{
    "moves": {
        "1. e4 c5": "Another Sicilian, just as in round 1.",
        "2. Nc3": "The closed Sicilian, preparing to play the Grand Prix.",
        "2... d6": "In the first round my opponent played 2...a6 and caught me offguard. This move is more common, though the most popular move is 2...Nc6.",
        "3. f4": "And this is the Grand Prix Attack. White wants to play on the kingside. His plans involve Nf3, d3, either Bb5 (and an exchange on c6) or Bc4 and O-O. The queen usually goes to e1 and then either to f2, g3 or h4 depending on Black's play. If Black is well-prepared it shouldn't be too dangerous, but most Black players aren't.",
        "3... g6": "A popular choice against the Grand Prix is to fianchetto the bishop. It was obvious that my opponent was not prepared for 3.f4, as he already took some time to think about this move.",
        "4. Nf3 Bg7 5. Bb5+": "The standard plan of the GPA.",
        "5... Bd7 6. O-O": "6.Bxd7+ is also possible, but I wanted to keep the tension between the two Bishops. Moreover, I had played another game in which a similar position occurred (but Black had played ...e6 and ...Be7 instead of ...g6 and ...Bg7) and there the computer recommended O-O.",
        "6... a6": "A slight inaccuracy. Black does not like the tension between the bishops and forces my bishop to make a decision. But if I exchange (7.Bxd7+ Nxd7) his knight is not in a very good position. Had he played 6...Bxb5 7.Nxb6 a6 8.Nc3, he had had the choice to develop his knight to a better position (8...Nc6). It would be the same position as in the game after move 7, but then with the knight on c6 instead of d7, which is probably better for Black. Black's choice is less flexible for him (and more flexible for me, as I could also have played 7.Bc4 if I had liked to).",
        "7. Bxd7+ Nxd7 8. d3 e5": "?! I don't like this move. It's a serious weakening of the central light squares, my knight gets a nice outpost on d5 and the d6 pawn becomes weak. I don't think the g7 bishop liked to see this move either. More solid is 8...e6. White had 1:26 on his clock, Black 1:14 (we started with 1:30 and got 30 seconds extra time per move, so I had used 8 minutes and my opponent 20).",
        "9. Qe1": "Normal GPA development.",
        "9... Ne7 10. Qg3": "!? Preparing f5 (if Black would play ...gxf5?? the bishop on g7 would be hanging) and putting more pressure on the e5 pawn.",
        "10... Nc6": "More defence for the knight, but Black plays very passively and slowly, while he does not really have the time for it. Better was to try and get some counterplay with 10...Qb6, as suggested by the computer.",
        "11. f5": "I was not sure whether to play this or 11.fxe5. I chose this move because I can damage Black's pawn structure on the kingside and open up his king (if it castles on the kingside) next move. But probably 11.fxe5 is a more direct approach.",
        "11... Nf6": "I'm not sure what Black is doing, he seems to be moving his knights around with no purpose. It's not that he makes very bad moves or anything, but he seems to lack a plan.",
        "12. fxg6": "I take to open the f-file, but Black gets the h-file in return. I felt that my f-file would be more useful than his h-file, but I'm not sure.",
        "12... hxg6 13. Bg5": "Putting pressure on the knight on f6.",
        "13... Qd7": "?! This loses a pawn. Better was 13...Nh5!. The exchanges after 14.Bxd8 Nxg3 15.hxg3 Rxd8 give White nothing, so he should probably play 14.Qg4, with some advantage, but not too much.",
        "14. Nxe5": "! This nice little combination wins a pawn due to the discovered attack on the knight. Also good was 14.Bxf6! Bxf6 15.Nd5 with the threat of Nb6 forking queen and rook, as well as a threat to the bishop, so the ugly 15...Bd8 is forced when White has a strong bind on the position.",
        "14... Nxe5 15. Bxf6 Bxf6 16. Rxf6 O-O-O": "Probably this is the safest place for the king.",
        "17. Nd5": "Finally taking the outpost and threatening the royal fork Nb6+.",
        "17... Kb8": "Moving out of the way so there's no check on b6.",
        "18. h3": "A safety measure because I was expecting a doubling of rooks on the h-file combined with ...Ng4 to attack my kingside. I did notice that after for example 18.Raf1, the immediate 18...Ng4?! would not be so strong due to 19.Nb6! when the defender of the knight has to move and I can take the knight next turn (e.g. 19...Qc7 20.Qxg4 Qxb6), but I thought this move would be necessary anyway if the rooks double up on the h-file. The computer doesn't think it's necessary though, and prefers the doubling of rooks with 18.Raf1.",
        "18... Rh7": "It seems that Black is indeed planning to double rooks. The computer wants to play 18...Qa4 19.c3 Qc2 to try and get some counterplay.",
        "19. c3": "Preparing d4.",
        "19... Ka7": "I don't know what Black is trying to do, maybe he wants to defend the b6 square or step out of the diagonal of the White queen.",
        "20. d4 Nc4": "I think 20...Nc6 wasbetter. Now the knight can be threatened again, so it has to move to a bad square.",
        "21. b3 Nb6": "?! After the game I said that I thought this was the decisive mistake. Now I can get the Black king into the free. Better was 21...Na5 which can eventually be followed by 21...Nc6 bringing the knight back into the game (didn't I say that 20...Nc6 was better last move?). 21...Na3 is not good either, because of 22.dxc5 dxc5 23.Qf2! with the threat of 23.c4 when the knight will be caught with 24.Qb2, as well as the threat of 23.Qxc5 winning a pawn.",
        "22. Nxb6 Kxb6 23. dxc5+ Kxc5": "The computer suggests 23...Ka7 but that gives White an easy win with 3 pawns up after he takes on d6. 23...dxc5 was not possible due to the pin on the d-pawn.",
        "24. Qe3+": "?! Not best. I thought there must be a mate somewhere, but there isn't. Better was to bring other pieces into play with 24.Rd1, or to open up the position further with 24.e5.",
        "24... Kb5": "?! Not best either. The king would be relatively safer on c6.",
        "25. Qd4": "Again I should have played 25.Rd1 or 25.e5.",
        "25... Qc6": "?? Right idea, wrong move. 25...Qc7, to defend with the queen, was better. This blocks a crucial escape square and therefore walks into a mate in one.",
        "26. a4+": "? Somehow I missed the mate in one 26.Qb4#, but did see the mate in two with 26.a4+ Ka5 27.b4#. Anyway, I had won my first game and was happy with it. Hope you enjoyed the annotation again, see you later for roud 4."
    },
    "url": "https://gameknot.com/annotation.pl/r3-an-attacking-game-in-the-grand-prix?gm=45959",
    "gameName": "R3: an attacking game in the Grand Prix",
    "players": "l-d-j (1387) vs. Black Player (1287)",
    "opening": "Sicilian (B23), closed"
}