{
    "moves": {
        "1. e4 e5 2. Nf3 Nf6": "My usual Petroff. At GM level pretty drawish, but at amateur level any result can come out of it. I do not play it to get a draw, I always want to win even as Black.",
        "3. Nc3": "The main move is 3.Nxe5, usually followed by 3...d6 4.Nf3 Nxe4 when White has a number of choices, the most common being 5.d4, but also the recently popular 5.Nc3 is possible and some less interesting lines (5.d3 and 5.Qe2). Here, 3.d4 is another possibility and even 3.Bc4 can be played. The text is also possible, but less challenging to Black.",
        "3... Nc6": "This has to be the simplest of all openings: the four knights.",
        "4. d4": "The Scotch four knights - a line I know very well, from both sides. This has to be the variation I have played the most games with.",
        "4... exd4 5. Nxd4 Bb4": "Pinning the knight and putting pressure on e4.",
        "6. Nxc6 bxc6 7. Bd3 d5": "The usual freeing break for Black in e4 openings. Also by far the most common in the position though 7...O-O is also possible.",
        "8. Bd2": "!? A rare move. Far more common is 8.exd5 cxd5. This move breaks the pin but does not really challenge Black.",
        "8... O-O": "I looked at a pawn-winning line, namely 8...Bxc3 9.Bxc3 Nxe4 10.Bxe4 dxe4 11.Qxd8+ Kxd8, but my pawn structure after that is pretty awkward and I'm lacking in development, so I decided not to play it. What I didn't even see is that 12.Bxg7 would immediately win the pawn back and after 12...Rg8 White has the intermezzo 13.Bf6+ and can defend his g2 pawn afterwards, so the line wouldn't even have won a pawn after all.",
        "9. O-O Bxc3": "But now that we have castled, I can take with the rook on d8 in the line mentioned before so I decided the pawn win was safe now.",
        "10. Bxc3 Nxe4 11. Qh5": "?! White was playing passively until now, but now that he gets aggressive, it's just the wrong time for it. He prevents 11...Nxc3?? 12.Qxh7# and 11...Nf6?? to chase the queen is also not possible because of 12.Bxf6 and there's a mating threat on h7 again. But I have...",
        "11... g6": "... This move, which does weaken the dark squares around the king, but chases the queen and prevents the mate.",
        "12. Qe5": "Another mating threat, but it's easily parried again. 12.Qh6 does not accomplish anything either after 12...Nxc3 13.bxc3 and now for example 13...Qf6 and White has to retreat to prevent losing a second pawn.",
        "12... f6 13. Qf4": "Seems like the best square since on d4 it can be chased yet again with 13...c5. (Yes, it can be chased from this square with 13...g5, but that would needlessly weaken the kingside.)",
        "13... Nxc3 14. bxc3": "We can see now that Black has an advantage. He is a pawn up and has nice central control. The only factors that may be to White's advantage are the slightly unstable position of the Black king and White's superior development, but there are no immediate threats so Black can simply develop and try to catch up with White before White can take advantage of those advantages.",
        "14... Qd6": "Proposing a queens exchange and if White refuses, he has to move his queen yet again to a more passive square.",
        "15. Qe3": "The exchange with 15.Qxd6 cxd6 would give Black a strange pawn structure of which it's not clear to me whether it's strong or weak. The computer thinks that 15.Qh4 would have been slightly better, because on e3 the queen is vulnerable to attacks yet again, this time by the rooks that cannot wait to be developed onto the open e-file.",
        "15... Bd7": "Developing, connecting the rooks and covering the e8 square (if I would have developed the bishop to, say, b7 and White would have played 16.Rfe1, I could not have played 16...Rfe8? because White could then get two rooks for a queen with 17.Qxe8+! Rxe8 18.Rxe8+ Kg7).",
        "16. Rfe1": "The computer prefers 16.c4, probably to prevent 1 ...c4 push by me and to close the center, where Black has a pawn majority. The pawn exchange with 16...dxc4 17.Bxc4+  does not offer Black real winning chances due to his doubled c-pawns and the lack of a passed pawn.",
        "16... Rae8": "!? I did not do a safety check before this move and was awakened by White's next move. But actually this move is not bad at all, since for the pawn White gets superior center control and Black's queen is in an awkward position after it has taken the pawn on a7. But if I'd have seen that my pawn would be hanging, I'd have played 16...Rfe8 for sure.",
        "17. Qxa7 c5": "Highlighting the bad position of the White queen, threatening to trap her with ...Ra8 and/or ...Bc6.",
        "18. Qa3": "The computer proposes 18.Rxe8 Rxe8 (perhaps to reduce the activity of Black's major pieces) followed by 19.c4.",
        "18... Re7": "?! Preparing to double on the e-file. Fritz prefers 18...Ra8 to threaten the queen, but that moves the rook off the open e-file which I found a bit strange (I didn't play it because I thought it wouldn't accomplish anything).",
        "19. Rad1": "?! Again Fritz prefers 19.c4 to close off the center and gives that position as equal (White has the passed pawn, Black the more activity).",
        "19... Rfe8": "Natural, but Fritz wants me to play 19...Rxe1+ 20.Rxe1 c4 now, to chase the bishop to a passive square.",
        "20. Qc1": "The last chance for 20.Rxe7 Qxe7 21.c4. Now Black does it.",
        "20... c4 21. Bf1 Re7e5": "Black has more center control and more space, but is it enough to win? A club member with a rating of 1800 who was playing in a higher section of the tournament suggested after the game that I should have played 21...Bf5 here, which I had considered, but I thought White could just hold and the computer agrees. I noted during the game that 22.Bxc4?? is not possible, because I can simply take with 22...dxc4! and the queen on d6 is immune due to the back rank mating threat.",
        "22. Rxe5 Qxe5 23. Qd2": "Forced to defend c3. Attacks d5 at the same time.",
        "23... c6": "Freeing my pieces from the defence of d5. Here 24.Bxc4 still does not work.",
        "24. f3": "Maybe to tempt me into playing my next move, but it seems more natural to play 24.a4, to try and get the passed pawn to the 8th rank.",
        "24... Qe3+": "?! Forcing a queen exchange, thinking I could win the c-pawn afterwards, but forgetting about the Bxc4 threat.",
        "25. Qxe3 Rxe3 26. Bxc4": "! of course. Now 26...dxc4 leads almost immediately to a draw after 27.Rxd7 Rxc3 and the rook ending must be an easy draw, so I decided to keep the bishops on the board.",
        "26... Rxc3 27. Bb3": "Everything just holds for White.",
        "27... Bf5": "?! An inaccuracy by me. Better was 27...Kf8.",
        "28. Rd2": "?! White returns the favour. 28.g4! was possible because 28...Bxc2?? fails to 29.Rc1 and the bishop is lost, or an exchange after 29...Bxb3 30.Rxc3.",
        "28... Kf8 29. Re2": "Probably to block my king, but it seems better to get his own king involved.",
        "29... d4 30. g4 d3": "?! This leads almost immediately to a draw and probably even a slight advantage for'White. My club mate proposed 30...Bd7, to continue with ...c5 (attacking the a4 pawn) when ...c4 trapping the bishop becomes a real threat.",
        "31. cxd3": "Of course not 31.gxf5?? dxe2. A rook move is no good either because then 31...dxc2 with the threat of promotion wins material.",
        "31... Bxd3 32. Re3": "?! 32.Re6 even wins a pawn for White, but probably Black has enough activity to hold the draw. But at least White could have tried it. But  maybe White, having defended the whole game, was content with a draw. Now Black can reach the draw quite easily.",
        "32... Rc1+ 33. Kf2 Bc4": "The exchange of bishops leaves us with a single rook ending with four pawns each.",
        "34. a4 Bxb3 35. Rxb3 Ra1 36. Rc3": "If White wanted to try something, he should have played 36.Rb4 when he has the passed pawn that is the hardest to reach for the kings because it's far from where the kings are and which is also one step closer to promotion, but the rook would be forced to stay on the fourth rank to defend it and the pawn would not be able to advance any further so that would be a draw as well, I guess.",
        "36... Rxa4 37. Rxc6": "Now that the passed pawns are exchanged, we're left with three pawns each on the same wing. No one can really try anything in this position so my opponent offered a draw, which I accepted. I think it was a quite solid game overall with some mistakes from both sides. I held the advantage for most of the game, but a draw always seemed to be a likely result. Hope you enjoyed, thanks for reading!"
    },
    "url": "https://gameknot.com/annotation.pl/r4-is-it-enough?gm=46002",
    "gameName": "R4: is it enough?",
    "players": "White Player (1451) vs. l-d-j (1387)",
    "opening": "Petrov three knights game (C42)"
}