{
    "moves": {
        "1. d4 d5 2. c4": "This opening is called the queen's gambit. It is one of my favorites now that I have started playing 1. d4.  ",
        "2... e5": "This variation is one you do not see every day. I'm more used to e6, dxc4- queen's gambit accepted, or c6- Slav. I guess this is playable though. Dxc5 would fail to D4, clogging up white's development. ",
        "3. e3 exd4 4. Qxd4": "Although white gains time while attacking d5, his queen is soon destined to get chased away. I would rather capture that way than 4. exd4, though",
        "4... Nf6 5. Nc3": "Having more attacking power on d5. But now that a piece of low value is protecting d5, nc6 can be played",
        "5... Nc6 6. Qd1": "Still with the threat, though, of cxd5",
        "6... Bf5": "Controlling an important diagonal.",
        "7. f3": "This move is questionable. The point is to build a pawn chain to take the bishop off that diagonal. It is vital because of the threat of Nb4",
        "7... Nb4": "Dodge didn't know how to defend this attack without going down the exchange.",
        "8. Qa4+ Qd7 9. Qxd7+ Kxd7": "Black doesn't care about castling.",
        "10. e4": "The best defense against the threat on c2",
        "10... dxe4 11. fxe4 Nxe4": "Black went up a pawn, and white is freaking out. The middle files are open, and that is VERY dangerous when black's rooks are close to taking charge on the files.",
        "12. Rb1": "This allowed white to escape the fork.",
        "12... Nc2+ 13. Kd1": "A mistake. Loosing a rook.",
        "13... Nf2+": "White is being overwhelmed by attacks. ",
        "14. Ke2 Bc5": "Black didn't need to capture the rook immediately, because, is it going anywhere? He instead decided to continue developing. Now his rooks can go to the open files in 1 move!",
        "15. Nf3": "This move could have 50 question marks after it because he just made the biggest mistake of the game. You will see why. It is a mate in 2 thanks to that knight! Can you spot it?",
        "15... Bd3+ 16. Kd2 Be3#": "That's right- mate! you see how black and white's knights and bishops form a rainbow. White smothers himself with that knight on c3, and the pieces form a pattern. It was an amazing mate! GOOD JOB HOODLING! Thanks for watching this game. BYE!"
    },
    "url": "https://gameknot.com/annotation.pl/rainbow-game?gm=35064",
    "gameName": "rainbow game",
    "players": "Dodge (?) vs. Hoodling (?)",
    "opening": "QGD (D08), Albin counter-gambit"
}