{
    "moves": {
        "1. d4 b6": "One of the most uncommon approaches to the opening. Of course, white has the chance to overextend with d5, which offers black a target. But I want to see if the London holds. ",
        "2. Bf4 Bb7 3. Nd2": "If Nf3 at once, some players play BxN, just to scramble my pawns. I would have an edge, but even so I didn't want to play this line. ",
        "3... Nf6 4. Ngf3": "Now, BxN is just answered with NxN or exN, as desiderd. ",
        "4... e6 5. e3": "I won't force e4... still. I am happy with e3 and c3. ",
        "5... h6": "Wasting time. More important was to catch up in developement, or go c5 at once. ",
        "6. Bd3": "Supporting a future e4.",
        "6... Be7": "Still passive, so I can...",
        "7. e4": "...and it's not a loss of tempo, due to the presents black gave to me. ",
        "7... d6": "Ok, black makes this hard-to-work-out move, so I have to think carefully about any pawn push. On blitz. ",
        "8. c3": "...I just skewered the decision. I'm now planning some attack on the white squares, so I wanted to leave room for my minor pieces, but correct would have been c4, depriving Nf6 from his fly square after e5.",
        "8... O-O": "Still passive. Sound, but passive. Black defines white's targets better, while he could have developed instead. ",
        "9. Qc2": "Putting an eye on h7. Now I am threatening e5... but for Nd5 in return. No good plan!",
        "9... c5": "Finally! Black has his chance and takes it. Now, I tried to force something by winning some tempoes while I leave this pawn to make his feeding race. ",
        "10. e5": "I planned, after Nd5, something like Bxh6, h4, etc. Probably unsound. Bd3 as second best (NxB, fxN, g5!?). ",
        "10... dxe5": "How to retake? I have three options: dxe5, kicking the N to his dream post, d5, forcing my B do defend. Bxe5, allowing for Ng4 and to have it exchanged or neutralized. So I choosed the \"worse\" one. ",
        "11. Nxe5 cxd4": "I didn't care at all Bxg2, Rg1, this only helps me. I don't care to exchange the pawn, since then Qxd4 would harm me a lot. I was looking to Nxf7, but I found no trick or mate... still. My problem is Nf6, shielding h7.",
        "12. Ne4": "This would be a surprise for him, and the exchange option leaves en prise Ra8, so black must be careful. ",
        "12... dxc3": "This was the \"munching march\" I was allowing him. ",
        "13. Nxf6+": "Just to make a point of the white squares domination. Probably not the best. ",
        "13... Bxf6": "Nxf7 still doesn't work...",
        "14. Bh7+": "...and this leaves the B trapped after g6, which black can't play because of Bxh6 or Nxg6. So I was confident. And, moreover, I was eyeing a back-rank mate threat very useful... ",
        "14... Kh8 15. bxc3": "...but I didn't dare to play Rd1 at once! After it, black has to defend his Q, and I get the central column. Let's put it that way: without the BQ, Nxf7+, RxN, Rd8+ and mate. I was trying to help this happen, but I got scared about the black pawn, and I found Qe7 for black, which saves the day for him. In doing so, I leave the initiative to black. ",
        "15... Qd5": "Black's turn to attack. The idea is simply a double threat, against Ne5 and g2 (after Qxg2, Rg1 is not possible anymore). Nothing that I cannot handle. How?",
        "16. Nxf7+": "The answer is forced. ",
        "16... Rxf7 17. Rd1": "and NOW, the BQ can't leave or... NOPE! Bf6 defends d8, the whole plan was a bad one! Sigh!",
        "17... Qc4": "Preventing me from castling, and leaving with a neat -3, a nearly trapped B, and Bxc3+ to meet. Homework: how can W get out of all this with just one move? (I may be wrong, of course!)",
        "18. Be5": "Cute, istn't it? Black can't take the B or Rd8#. At the same time, it defends c3. ",
        "18... Nc6": "This N threats the B and Nb4, and of course it stops the back rank mate threat. I had no time to think. I couldnt find a convincing following after Bg6 or Qg6. I had to accept the defeat and try to minimize the damage. ",
        "19. Bxf6": "Opening a dangerous column for black, but what else? ",
        "19... Rxf6": "Ok, time to save my B before my Queen will be forced to move. Where to put it? Be4 headed for exchanges, which I don't want...",
        "20. Bd3": "Horrible, but at least I... help my enemy's Q to attack me! :-)",
        "20... Qg4": "Cool blood, here. The dangerous unbalancing piece here is black's lsb, eyeing g2. As often, castling is just suicide, here. I have to exchange, and beg it's not too late! These are the typical misjudgements one do in blitz games. Don't take example from them. ",
        "21. Be4": "Again covering g2 and assuring a B exchange, after which the only unbalanced piece would have been the N, and it will end well far away. ",
        "21... Na5": "Ok, that's it. ",
        "22. Bxb7 Nxb7": "Some rest at last... ",
        "23. O-O": "NOW I can - more or less - castle. He has Rg6, but I can play either f3 or g3 to defend. ",
        "23... Raf8": "Adding pressure, of course, why not? Black has a won game!",
        "24. Rd7": "Stupid move. ",
        "24... Nc5 25. Rd4": "Well, go back to the track: my resource will be to harass the BQ and covering e4. ",
        "25... Qf5": "Black can easily go for an endgame, and I have not good ideas about my Q...",
        "26. Qxf5 Rf6xf5 27. f3": "...at least now will be an engame. With a piece less... a lost position. ",
        "27... Rd5": "If I dont' exchange, the R will penetrate to d2. Alternate defence: ",
        "28. Rfd1 Rfd8": "Black goes for massive exchange. I can't avoid it. ",
        "29. Kf2": "I'll let him start, though. ",
        "29... Rd5xd4 30. cxd4": "Just one R, pal, just one. ",
        "30... Na4": "The N can't inmediately threat the pawn, but black omitted that I couldn't have taken it because Ra1 is undefended, and RxRd1 will be a losing bargain. ",
        "31. Ke3": "If e5 - taking advantage from the pin - Ke4 and exd4. If I don't want to lose it, I'll have to exchange my last R. ",
        "31... Kg8": "Fortunately, black goes another way!",
        "32. Rd3": "? Another mistake. Now the R is defended, but I had to play Ke4 at once, and black would have lost his chance to play e5. Please, mr. Capablanca, we have a drink for you... on the bar. Don't look at this...",
        "32... Kf7 33. Ke4": "A move too late, now the BK is near enough!",
        "33... Rd7": "Nc5+, dxN, RxR, KxR, bxc and black wins the slow way. ",
        "34. f4": "Well, at least I contest e5 once more!",
        "34... b5": "Pushing his pawn to nowhere. Now what?",
        "35. Ra3": "On time pressure, I just think in making many quick moves, so I can recover some seconds. This is to prevent b4, and if Nb6, Ra5, pressing his pawns. ",
        "35... Rc7": "This is to free the N via c3. Sigh!",
        "36. Ke5": "Not really sure about this, but I wanted to avoid the Nc3 move with check. Now if Nc3, Kd6, Nd5...",
        "36... Rc2": "Going for the kill, winning my pawns. Ok. ",
        "37. Re3": "I'll go for his e6 pawn, that is the more important to me, to make my d pawn free, and dangerous. Hopefully. ",
        "37... Rxg2 38. Kd6": "He can defend with Rg6, of course, but Re5... it gives me some pressure.",
        "38... Rxa2": "Going for another pawn, and letting me...",
        "39. Rxe6": "He has two free pawns as well, but the important thing is the distance...",
        "39... a6": "Poor choice, but Re7+ - Rxa7 would have been good for white. ",
        "40. Re7+ Kg6 41. Re6+": "Black doesn't want to draw, so he has to get shield. ",
        "41... Kh7": "Black can exchange his N for my pawn at any moment, and still win. So if I go d5, Nb6 followed by Nxd5 and black wins. ",
        "42. Kd5": "This is not any good! I can't remember what was I thinking. Probably b4, Kc4. ",
        "42... Rf2 43. Rxa6": "This pawn is more dangerous than my f4 pawn. Exchange pawns, not pieces. ",
        "43... Nc3+": "The end of the story. I couldn't see it in the hurry. Kc4 is not possible. ",
        "44. Kc5 Rxf4 45. d5": "I have to cope with a simplification. I didn't see Ra3, but b4 solves black's problems (If I'm right on the fly!).",
        "45... b4": "Nxd5 wins the hard but sure way, again. ",
        "46. d6 Ne4+ 47. Kxb4 Nxd6+": "Now it's still a lost game. My pawns whorted his, which is not enough but not all that bad. I have to be aware of N forks. ",
        "48. Kc5 Ne4+ 49. Kd5 Ng5 50. Ra2": "What else? ",
        "50... Rh4 51. Rf2": "Preventing Nf3.",
        "51... Rh3 52. Kd4": "?? Allowing a fork to happen. ",
        "52... Nf3+ 53. Ke4 Nxh2 54. Kf4": "?? Again. I allow for exchanges after g5+, and if Rf5, Rf3+. ",
        "54... h5": "? Allowing me in.",
        "55. Kg5 g6": "?? Wanting to build a cage, but allowing for...",
        "56. Rf7+ Kg8": "Here, not Kxg6, Rg3+ and I lose the R. ",
        "57. Ra7 Rg3+ 58. Kf6": "...this time I tempted him. Can you see which is my very last resource / strenght in this lost position? About to materialize if black goes wrong...",
        "58... Ng4+": "And he does! Why?",
        "59. Kxg6": "Now, mate is threatened (Rh8#), so I still have a grip on black. Just one. ",
        "59... Nf6+": "Black prefers to lose the N than the h5 pawn. He's right. ",
        "60. Kxf6 h4": "Ok, I have no mate now... but the BK is on a CORNER, so there are two mates easily threatened...",
        "61. Ra8+ Kh7 62. Ra7+": "He has to het out of this. He can, but I want to see. A rated blitz is not the same...",
        "62... Kh6": "Set for the other checkmate. Ra8 will do, but it is too easy to see. ",
        "63. Ra4": "...this is much better. Black can defend the pawn with Rh3, but then Kf5 and if Rf3+, Kg4. He can still draw by Rf3+, which stops the mate threat. But this player lost the chance to have a high win by blunderding...",
        "63... h3 64. Rh4#": "I hope my life would be like this game... lost until a good luck strike, undeserved but for faith and perseverance (and a less-than-accurate play for both parts). "
    },
    "url": "https://gameknot.com/annotation.pl/rated-blitz?gm=60134",
    "gameName": "Rated blitz...",
    "players": "damafi (1435) vs. tao9tao (1354)",
    "opening": "Queen's pawn (A40), English defence"
}