{
    "moves": {
        "1. c4 e5 2. Nc3 Nc6 3. e3 Nf6 4. g3 d5 5. cxd5 Nxd5 6. Nge2 Ndb4 7. d4 Bg4 8. Bg2": "here i should of moved a2-a3 and traded knights",
        "8... exd4 9. f3 d3 10. fxg4 Nc2+ 11. Kf2 Qf6+": "here i think leaving the queen at d8 and taking the rook with Nc2 would of been better.  due to now he leave d3 without support and if he moved his queen back he loses his chance at the rook.  the qf6+ was a waste of a move because nothing came of it and he lost a good position.  have that pawn and knight where it is would of really put a cramp on white.",
        "12. Kg1 Nxa1 13. Qxd3": "now black lost that position and now white can go from def to off",
        "13... Rd8": "HERE HE MAKES ME MOVE MY QUEEN WHEN I WANT TO ANYWAYS.  it sometimes is worth while when you want to move to a certain square to have your opponent threaten the piece and then move it to where you want to go because sometimes your opponent doesn't look so carefully when he thinks he made your move from a spot u wanted to be at.",
        "14. Qb1 Nb3 15. axb3 Bc5 16. Qe4+ Ne7 17. h3": "here we move h2-h3 to so we can move the king and free up the rook.",
        "17... O-O 18. Qxb7": "here we open blacks pawn structure so they can't support themselves but require assistance from a minor piece(s) for protection.",
        "18... Bb6 19. Kh2 Rdb8 20. Qe4 Rfe8": "Rf8-e8 hoping to move knight and put my queen in jepardy",
        "21. Rf1": "but i'll beat him to it.  now if he moves N i take his R with my queen and put him in check then take his queen and as a result open up his king",
        "21... Qd6": "i see he must not of liked that idea",
        "22. Qc4": "so now we go after the f7 pawn",
        "22... Ng6": "moves his horse to get access to the e3 pawn",
        "23. Qxf7+": "but first i am going to get a pawn and a free turn since he has to move his king",
        "23... Kh8 24. Rd1": "now we attack something more valuable then taking the e3 pawn so they leave it alone",
        "24... Qe7": "now i can retreat or take his queen",
        "25. Qxe7": "since i want another turn before dealing with e3 i take the queen.  because even if i defended e3 i only have 2 defenders and he will have 3 attackers",
        "25... Rxe7 26. Nd5": "now i move to horse for 2 reasons \r\n1. i will win any exchange they try \r\n2. i want that bishop so they can't try this again\r\n",
        "26... Ree8 27. Nxb6 Rxb6": "i would of thought he would of used one of the pawns to take the knight to help give protection to each other",
        "28. Rd3": "protect b3",
        "28... Reb8 29. Rd7": "they take a pawn i take a pawn",
        "29... Rb6xb3 30. Rxc7 a5 31. Ra7": "now to try and stop their potential queen",
        "31... Rb3b5 32. e4": "try and get one myself but now that i look back i should of moved h3-h4 to give my king another way out should something threaten it and it will loose up my bishop in case someone pins my bishop to my king.",
        "32... h6 33. Nd4 Rc5 34. Bd2 Rxb2 35. Bxa5": "no need to worry about that pawn now",
        "35... Rc4": "attacking my knight on d4",
        "36. Rd7": "rook moves to protect",
        "36... Ra4": "now bishop and knight under attack but knight is protected as long as bishop stays on a5-e1 file or Rb2-d2 to attack my knight",
        "37. Bc3 Rf2": "threatening to move Ra4-a2 to take my bishop",
        "38. Kg1": "bishop unpinned and rook a4 can't move a1 for check without being taken",
        "38... Rfa2 39. Nf5": "here i go after g7 and his king",
        "39... Ra2a1+": "trying to get my bishop to take his rook.  well as you will see it worked but i think kh2 would of been better. because then i could",
        "40. Bxa1 Rxa1+ 41. Kh2 Ne5 42. Rxg7": "rook under attack by knight so i attack to get out from under the attack by the knight by taking g7 ",
        "42... Ra2": "i saw Nf3+  43. Kh1 Ra1+  44. Bf1  Rxf1  45. kg2  Nd2  46. Rd7  Rd1  47. Ne3(so i should gain back either the knight or rook) so this led me to move my Rook without worry to king.  boy was i wrong in what he had planned.",
        "43. Re7 Nf3+": "here is where he almost mated me",
        "44. Kh1 Ra1+ 45. Bf1": "everything going as planned and then....",
        "45... Ra2": "i wondered why move here and not take a free bishop?  well Rh2#  now do i move my bishop back up to block or can i hopefully get his king in a posion for for a skew with my white bishop to his king and rook.",
        "46. Re8+": "so it begins",
        "46... Kh7 47. Re7+ Kg8 48. Bc4+": "gotcha.  no more need to worry about mate",
        "48... Kf8 49. Bxa2 h5 50. gxh5": "and well thats it folks.  black resigns"
    },
    "url": "https://gameknot.com/annotation.pl/ratinhos-mini-tournament?gm=25380",
    "gameName": "ratinho's mini-tournament",
    "players": "7angels (1536) vs. spursboy (1615)",
    "opening": "English (A25), Sicilian reversed"
}