{
    "moves": {
        "1. d4": "So I start with my usual",
        "1... Nf6": "He knew that I would play the Sämisch Variation, and prepared a line which Kasparov had played. I am not convinced that it is that good!",
        "2. c4 d6 3. Nc3 g6 4. e4 Bg7 5. f3 O-O 6. Be3": "This is a main line of the King's Indian Defence. For my comments on these moves, see this annotation of mine http://gameknot.com/annotation.pl/penyfordd-v-rhyl-chester-district-league?gm=35684 or also see this http://en.wikipedia.org/wiki/King%27s_Indian_Defence,_S%C3%A4misch_Variation",
        "6... e5": "Black strikes at the white centre.",
        "7. d5": "White closes the position",
        "7... c6": "Black attacks white's centre",
        "8. Bd3": "White develops",
        "8... cxd5": "Black exchanges. I regard this as a mistake as it relieves pressure on the white centre. If white were ever to play 0-0-0 it would be hard for black to open up files against the white king.",
        "9. cxd5": "So I take back.",
        "9... a6": "I'm not sure this is best, why not Nh5 and f5 immediately?",
        "10. Nge2": "So I develop",
        "10... Nh5": "The usual knight move",
        "11. Qd2": "I develop my queen",
        "11... Nd7": "He develops his knight",
        "12. O-O-O": "After a long thought, I decide to castle queenside, which is what I often do in this sort of position. My thinking is this - if I castle kingside he has a ready-made attack with f5-f4, g5-g4-g3 etc. If he tries to attack my king on the queenside, he is going to find it hard to open uip the a or the b file. There are two plans I can follow - either move my king to b1, and try and take over the c file, or to launch an attack on the kingisde. However afterwards I found that castling kingside is more common in this position. What do you think dear reader, which side would you castle on?",
        "12... b5": "So his \"attack\" starts",
        "13. Kb1": "I tuck my king away. I am not afraid of 13...b4 14 Na4 as he can't then make much progress on the queenside.",
        "13... Qa5": "Threatening b4 now. I was surprised that this position is in the Gameknot opening database. There are two games. Both times white played a3 here. But I thought a3 would just help black open up lines on the queenside. I decided to give my knight the d1 square and played...",
        "14. Rdc1": "Also with a view to taking over the c file sometime.",
        "14... Bb7": "So he develops. I considered Nxb5 here, but it is refuted by Qxd2 16. Bxd2 axb5 17. Rc7 Nc5, attacking Bd3, so I played",
        "15. g4": "Going for the king side attack",
        "15... Nf4": "A thematic pawn sacrifice. Otherwise he just gets hammered on the kingside.",
        "16. Nxf4": "So I take",
        "16... exf4": "He takes back",
        "17. Bxf4": "I take the pawn.",
        "17... Ne5": "He hits d3 and f3",
        "18. Be2": "So this is more-or-less forced",
        "18... Rfe8": "Again, I looked hard at Nxb5 here. Maybe going into an ending where I have 3 pawns for a knight was a good idea? My passed a and b pawns look good. Any views dear reader.",
        "19. h4": "Instead I continued with king side operations.",
        "19... Rac8": "And again I considered Nxb5 - now that his Ra8 has moved to c8 of course he can't meet it with a x b5 like he could before. What do you think dear reader?",
        "20. h5": "Instead I continue my king side attack",
        "20... b4": "He hits my knight",
        "21. Nd1": "I retreat",
        "21... Rxc1+": "He takes. He explained afterwards he was wanting to take my queen away from protecting my bishop on e2. Of course I can't recapture with my king as my pawn on a2 is hanging",
        "22. Qxc1": "So I take with the queen",
        "22... Nxg4": "and this is his combination. It isn't really sound, but I fail to find the best defence.",
        "23. fxg4": "I take, although taking on g6 or d6 are also options.",
        "23... Rxe4": "He takes, hitting my bishop",
        "24. Bf3": "I hit the rook.",
        "24... Bxd5": "What is this? A further sacrifice?",
        "25. Bxe4": "I was thinking that he was planning  Bxe4+ 26. Ka1 Bxh1 when 27. Qc8+ Bf8 28. Bh6 mates him. I completely overlooked that he was also attacking a2. Afterwards I was thinking that instead of taking the rook, I could have played 25. Qc8+ Bf8 26. Bh6 immediately. However that fails to him playing Qxa2+ followed by Rc4+ winning my queen. But I did miss a win here. I should have played 25. b3 and white is clearly winning.\r\n",
        "25... Qxa2+": "So he takes",
        "26. Kc2": "Forced",
        "26... Bxe4+": "Now he takes",
        "27. Kd2": "Forced again",
        "27... Qd5+": "and I am clearly losing",
        "28. Ke2": "Not 28. Ke3 Qd3+ 29. Kf2 Qf3+ and he picks up the rook with check.\r\n",
        "28... Bxh1": "Now he takes. Now 29. Qc8+ Bf8 30. Bh6 fails to Qe6+ exchanging queens and I am just 3 pawns down in the ending.\r\n",
        "29. Nf2": "Threatening his bishop. I am 3 pawns down without compensation, but you never know....",
        "29... Bf3+": "He checks",
        "30. Kf1": "I try to find a safe place for my king.",
        "30... Qb5+": "He checks",
        "31. Kg1": "I run. My king has now travelled from b1 to g1",
        "31... Qc5": "He offers the queen exchange. I was expecting Qe2 and if I check on c8 followed by Bh6 he has Qe1 mating.",
        "32. Qe1": "I refuse",
        "32... Bc6": "He prepares to put his queen on the long diagonal and blast my king into the open again.",
        "33. Qe7": "I thought, \"what the heck, may as well play aggressively\"",
        "33... Qd5": "So he threatens mate",
        "34. Qd8+": "I throw in a check",
        "34... Bf8": "forced",
        "35. Kf1": "I see to the mate threat",
        "35... Qc4+": "and he forks king and bishop. Time to resign. So I've lost to both juniors I have played this season (see http://gameknot.com/annotation.pl/chester7vpenyffordd2wirral-league?gm=49458) Many thanks for reading this. Please leave a comment or two, and rate it on the star system. Until next time dear reader!"
    },
    "url": "https://gameknot.com/annotation.pl/rd-10-4ncl-hinckley-england?gm=49950",
    "gameName": "Rd 10 4NCL Hinckley, England",
    "players": "Charles Higgie (ECF162) vs. Jonny Pein (ECF164)",
    "opening": "Old Indian (A53), Janowski variation"
}