{
    "moves": {
        "1. g3 d5": "I guess this is called the Benko opening (g3 that is). I had studied a few of gnitnaws games before I joined his game. I saw he favored queens pawn games (as white he seemed to prefer a queens gambit game) and as black he favored variations that began with d5. ",
        "2. Bg2 e6": "1.g3 2.Bg2 are very common sequences for me in the beginning. I love opening like this. It fits my style of play and I'm able to develop into so many different openings from here.\nBlack I'm assuming is going for a french defense here. \n\nI generally aim for a quick king side castle in most games.  ",
        "3. d4 h6": "I played d4 here. Not a bad move but I would probably play Nf3 here instead if I were playing this game over. ",
        "4. Nf3 Nc6 5. O-O Nf6": "Simple development. I honestly don't know what this opening is called at this point. At the time I started this game I hadn't been playing g3 openings long. I've really just begun exploring the king side fianchetto. Now I prefer to begin with e4 though my general goal is to fianchetto king side. I'm a big fan of the Kings Indian Attack. ",
        "6. Bf4 Bd6": "I moved my bishop to f4 here for two reasons. I wanted some extra protection in case of a pawn push to e5 and at this point I was planning to bring my Knight to that e5 square. I like to open up the c6 square against my opponents. That gives me a line at the King. Also, I wanted to put some pressure on the f7 square. ",
        "7. Ne5 g5": "The push... I wasn't expecting g5. ",
        "8. Nxc6": "I went ahead and captured. Putting pressure on the queen and doubling pawns on his queen side. ",
        "8... bxc6 9. Bd2 c5": "Here I'm retreating but leaving plenty of space covered. Like I said in the beginning I had studied a few of gnitnaws games before I joined. c5 was expected and a common patterns in his games. As I said I saw how he favored the queens gambit games. It was at this point I noticed if I could get him off of the d5 square I'd have a shot at his rook on a8...",
        "10. Bc3 O-O": "Do you see my plan? Added benefit of a discovered attack on the knight at f6.\n\nHe castles king side...",
        "11. Nd2 a5": "Do you see it yet? \n\nI was very happy to see him move to a5. It gave me hopes he may overlook what I was working towards. ",
        "12. Nc4 dxc4": "YES! These kind of sacrifices are why I love this game.",
        "13. Bxa8 Ba6": "I got the rook and +2. He moves his bishop to open a line at my bishop with his queen. ",
        "14. Bg2 a4": "The beauty of the fianchetto is the ability to retreat and attack at/from opposing corners. It's occasionally overlooked as it was 2 moves prior as well.\n\nHe continues his pawn push on the queen side. ",
        "15. dxc5 Be7": "I captured a pawn and I expected him to recapture allowing me to get his knight on f6... he made a great move and retreated back to e7. ",
        "16. Qxd8 Rxd8": "Traded queens... He now has a well placed rook on the open d file. Unfortunately for black, this position isn't so great when you're down a rook and your opponents rooks are connected.  ",
        "17. Rad1 Rxd1 18. Rxd1": "White's position just became a lot stronger. No black rooks on the board and my rook is on the open d file. ",
        "18... Ne8": "At this point I'm trying to figure out how to trade down and simplify the position. ",
        "19. Bc6": "Forking the knight and pawn",
        "19... Nf6": "Retreat to protection...",
        "20. Bxa4": "Taking the pawn instead. ",
        "20... Bxc5": "Taking back the pawn, but... you just left the knight unprotected. ",
        "21. Bxf6": "Finally got the knight... it was at this point my opponent resigned. \n\nAll in all it was a fun game. The loss of the rook early on was really the downfall for black. Definitely a confidence booster for me and my new found love of the king side fianchetto. "
    },
    "url": "https://gameknot.com/annotation.pl/recent-long-game?gm=57881",
    "gameName": "Recent Long Game",
    "players": "jc0le (1480*) vs. gnitnaws (1374*)",
    "opening": "Benko's opening (A00)"
}