{
    "moves": {
        "1. d4 Nf6": "Another Remohgramps game, this one is quick and brutal. Not much to see here (just annotating it because I annotate all my games). We were both playing fast, the game ended in just a few hours while we were both playing frequenly in multiple other games as well - a sure recipe for disaster. White's d4 meets black's Indian System. ",
        "2. Bg5 Ne4": "And then it gets weird.",
        "3. Nh3 d5": "Claiming a slice of the center with a secondary threat.",
        "4. Nc3 Bxh3": "Getting right into it. White needs to be careful here.",
        "5. gxh3 Nxg5": "Oops. 5. gxh3? was a blunder and it cost white a piece. Better was 5. Nxe4.",
        "6. Qd2 e6": "Defending the knight and the pawn.",
        "7. h4 Ne4": "7. ... Nh4 is a bit strange, but 6. ... e6 left the knight only this one move to escape white's pawn on h4.",
        "8. Nxe4 dxe4": "Doubled pawns. Well, at least white has some doubled pawns too...",
        "9. O-O-O Qxh4": "... But not any more.",
        "10. d5 e5": "Getting a little scary. If 10. ... Qxf2, then 11. dxe6 opens the d-file for white to get a back-rank checkmate with 12. Qd8#. Black could prevent it, but now that the threat is on the board, I prefer simply to advance with 10. ... e5 and not have to worry about it.",
        "11. e3 Bd6": "Holding everything together.",
        "12. Bb5+ Nd7 13. Bxd7+ Kxd7": "Well, so much for castling. But things are going well, so a central king isn't too much of a burden at the moment.",
        "14. Qb4 Bxb4": "Oops again. 14. ... Qb4?? was truly a decisive blunder. Already down a piece and a pawn, white cannot afford the outright loss of his queen and resigns on the spot. A bit anticlimactic after my near-death experience against the same opponent in our last game (refer to the Giving Him a Little Rope #2 annotation)."
    },
    "url": "https://gameknot.com/annotation.pl/recipe-for-disaster?gm=22802",
    "gameName": "Recipe for Disaster",
    "players": "remohgramps (1128) vs. blake84120 (1804)",
    "opening": "Trompovsky attack (Ruth, Opovcensky opening) (A45)"
}