{
    "moves": {
        "1. d4 Nf6 2. c4 d6 3. Nc3 g6 4. g3 Bg7 5. Nf3 Nbd7 6. Bg2 O-O 7. O-O a5": "something i thought was a little different as i've never played it before also mainly because i'd lost a really embarassing game after someone played b4 as white on move 8 and i wanted to avoid repeating the experience - even at the cost of delaying playing e5. if anyone does no the correct continuation (C5 perhaps?) could they please correct me.",
        "8. e4 c5": "transposing into something like a sicilian\n",
        "9. b3": "a bit quesitonable, wouldn't Be3 be more sound? two bishops pointing at the same flank and all that?",
        "9... cxd4 10. Nxd4 Ne5": "a fantastic position! asthetically beautiful. identical pieces except knights which are symetrical around the h1-a8 diagonal and marginally different pawn structures! perhpas thats what drew me to play this move as it isn't all that strong in its own right. Yes it centralizes the knight and starts making a bid for the f3 and g4 squares BUT it gives white the oppertunity to win tempo with f4 and also to create a rather dashing pawn formation. the main idea behind this of course being Bg4 as a substatial threat after f4 is played. (or Ng4 meaning something must stay back to protect e3).",
        "11. a4": "? whilst this halts any queenside advance i think black is making fairly clear his intentions lie in piece play on the kingside and there might have been more productive moves made here- Bf4 or Bg5 may have cost black a little more. as would ideas such as Be3, follwed by Qd2 challenging the fianchetto.",
        "11... Qb6": "not much of a threat really - black is planning to unveil his knights and open up an attack from the bishop on the D knight and the unprotected c knight behind it- white has the resource Ndb5 or Ncb5 here and the drama is essentially over",
        "12. Be3": "a little too greedy perhaps? Neg4 is now strong for black",
        "12... Nfg4": "?? objectively the wrong knight move here. Neg4 is much stronger as it readies e5.",
        "13. Nd5": "now black must loose time and run away home to protect e7",
        "13... Qd8 14. Re1": "a poor use of the extra tempi. a more agressive move such as Qd2 might have been more interesting, presumably this is in preparation for f4, so that after Nxe3, Rxe3 (NOT Nxe3?) the black queen cannot threaten via b6",
        "14... Nxe3": "played perhaps a little too early, but the knight is in danger of getting hemmed in if it stays there much longer, and the threat on the fianchetto posed by the black squared bishop is a little disconcerting.",
        "15. Nxe3 Bd7": "a waste of time by black- what can the bishop do here that it couldn't have done from c8? pretty much nothing.",
        "16. Rb1": "removing blacks threat down the long diagonal",
        "16... Nc6": "black tries to apply some non-existant preasure, but more importantly softens up b4 for a knight landing",
        "17. Nec2": "a doubly useful move protecting d4 and also prohibiting a the black knight to go to b4",
        "17... Qc8": "with designs on the white bishops - playing the line that white opted not to play earlier by allowing the Bishop on e3 to have been taken.",
        "18. h4": "why not f4>? arent pawns strongest with the last one in the chain touching the edge? similarly this prevents the strong formation of pawn chain from h to e towards the centre of the board, effectively isolating the e pawn",
        "18... Bh3 19. Nxc6": "giving black the option to join up his pawns on c and d- had i been playing white i would have preferred to keep the knight there longer - it's in no hurry to move and is nicely central. any threat from e5 could be countered with this move with the gain of a pawn perhaps due to the discovered attack from the queen on the d file. however the knights stationing wasn't without cost, the queen and other knight were needed there constantly and white it seems would prefer to free up the pieces than keep the outpost",
        "19... bxc6 20. b4": "this cannot be sound. it breaks up whites pawns and gains nothing really in the way of tempo or positioning unless black blunders. after axb,Nxb c5? Nd5! yes white does have an excellent outpost for the knight and commands an open file, but assuming black playes something more sensible this is unlikely to become a reality",
        "20... axb4 21. Nxb4 Bxg2 22. Kxg2 Qd7": "this is slightly more sensible than c5, black joins his rooks and allows them to sit side by side or on the same file attacking whites passed a pawn",
        "23. c5 Rfd8 24. Nd3": "a fairly sensible move - in the current position ... dxc5, Qxd7, Rxd7, Nxc6 would hang the knight, so the the knight has lost use on the c6 square. however, now note that as whites knight is now on a light square, it must next move move to a dark square, meaning that black has the oppertunity to trap it or exchange the bishop for it",
        "24... Qa7": "Black is in no rush to take on c5 as the exchange on d6 keeps his pawns connected the worry now is the threat perhaps of e5 which black removes by arranging a pin on the white knight and queen the moment pawns are free from the D file",
        "25. Rb6": "a mistake perhaps as white cannot now really protect a4 fast enough (especially as the knight cannot go to b2 if the rook moves)",
        "25... Rdc8 26. Qb3": "again the motivation for this is questionable - white can't protect a4 fast enough because of the black bishop controlling b2 and a3. similarly due to the finachetto settup there is no chance of a back rank mate - simplification cannot be good for white here as he has inferior pawn structure and (at best) this is what this move leads to. so blacks plan of action is clear",
        "26... Qxa4 27. Qxa4 Rxa4 28. cxd6 exd6 29. Rc1": "another move that forces simplification by white, or at least allows it. black now cannot keep his two connected pawns to gether, but enters the endgame with the advantage of an isolated pased pawn over his opponent for it",
        "29... Rxe4 30. Rbxc6 Rxc6 31. Rxc6 Rd4": "(the rook and pawn working to force the knight backwards or to f4",
        "32. Rc8+ Bf8 33. Nf4 Kg7 34. Rc7 Kf6 35. Kf3 h5 36. Ke3 Ra4 37. Nd5+": "a good move, halting the pawn and winning a tempi.",
        "37... Kg7": "37..., Ke6? Nf4+, and king must go back unforth or else Rxf7.",
        "38. f3 Ra5": "black sets up to offer an exchange on c5 for the troublesome rook.",
        "39. Ke4 Rc5 40. g4": "white strangely accepts the exchange, perhaps thinking that his pawns were far advanced enough that black could not get his king into play in time to save the lone pawn",
        "40... Rxc7 41. Nxc7 Be7": "finally the bishop can come into play",
        "42. g5 f6 43. f4 fxg5 44. fxg5 Kf7 45. Kd5 Bd8": "a good strong move, if the knight moves to b5, as was expected, the bishop travels round many dark squares via a5 and e1 in a large square to win the h4 pawn for the d pawn. this would indeed have been a very complex endgame, and anyone with a good chess engine feel free to tell me if the game is winnable after 46. Nb5",
        "46. Kxd6": "?? the mistake now black can take on g6 and white cannot catch the runnaway pawn.",
        "46... Bxg5 47. Ke5": "white realises his mistake and gives up the other pawn as well in hope of stalling the pawn progression",
        "47... Bxh4 48. Kf4 Be1 49. Nd5 Bd2+ 50. Kg3 Ke6 51. Nc7+ Kf5 52. Ne8": "and black must advance his pawns to the endzone. white resigns, 0-1.but an incredibly tight match with only minor errors by white."
    },
    "url": "https://gameknot.com/annotation.pl/redclouds-mini-tournament?gm=26398",
    "gameName": "redcloud's mini-tournament",
    "players": "spcmn (1587) vs. crazyeye180 (1611)",
    "opening": "Old Indian (A53), Janowski variation"
}