{
    "moves": {
        "1. d4 d5 2. c4 e6 3. Nc3 Nf6 4. e3 c5 5. cxd5 cxd4 6. exd4": "white accepts an isolated queens pawn in exchange for potentially some more time",
        "6... Nxd5 7. Nf3 Bb4 8. Bd2 O-O": "the kingside is weak enough! activating other pieces would have been more appropriate",
        "9. Bd3": "a good strong move building an attack on a kingside that has jsut been further weakend by castling",
        "9... Nxc3 10. bxc3": "white is in no hurry to loose his bishops in this position and the pawn's prevent any nasty surprizes from the two active dark squared pieces",
        "10... Ba5": "the position is brilliant for white.he has excellent chanses on the queenside and some very active pieces coupled with the ability to dominate the b file with a rook at leisure",
        "11. O-O": "an iritating move but i think a necessary one if the rook is to be involved in the kingside assult, whilst Q c2 is more direct it leaves open the chance of the attack being under-powered",
        "11... Nc6": "planning e5 perhaps? however white has noticed the line Bxh5, Kxh5  Ng5+! and teh queen can cause major problems on either h5 or c2 if it wants due to black having no controll on teh white squares",
        "12. Bxh7+ Kh8": "black has obviously also seen this line and wants to avoid it, however this allows white leisure to play Ng5 and with the tempo advantage  this is leathal",
        "13. Ng5 g6": "certainly this is a response (stopping the queen going via h5 to its destination), however perhaps there are better ways to go about this such as Qf6  which is infinitely more accurate",
        "14. Qf3": "so white now does the journey it two steops. perhaps white should have actually played Qg5 here as there is no way to stop the queen getting to the h file, but i was not confident in my analysis and chickened out leaving the threat of Nf7! as teh safer option",
        "14... f6": "black repsonds to Nf7",
        "15. Qh3": "white now really has it all anything other than Kf7 by black forces mate in two after Qh6! though i noticed this as i pressed submit on move 16 :(",
        "15... fxg5": "Qh6!! and the game is over.",
        "16. Bxg6+ Kg7 17. Qh7+ Kf6 18. f4 Nxd4 19. fxg5+ Ke5": "the position is still obviously good for white.",
        "20. Qg7+ Kd6 21. Rxf8 Ne2+ 22. Kh1 Qb6 23. Rd1 Bd7": "the motivation for this move is unclear to me, the threat of Be3 is match winning.",
        "24. Be3+ Nd4 25. Rxd4+": "game over in one of two ways",
        "25... Kc7 26. Qxd7#": ""
    },
    "url": "https://gameknot.com/annotation.pl/redclouds-mini-tournament?gm=26233",
    "gameName": "redcloud's mini-tournament",
    "players": "crazyeye180 (1621) vs. rader20022000 (1502)",
    "opening": "QGD (D35), 3...Nf6"
}