{
    "moves": {
        "1. e4 c6": "Though the Caro-Kann and I had somewhat of a falling out a little way ago, because I kept getting in traps and tactics from white, I began to believe in its power again after I won a wonderful game against a street chess hustler in Kiev. ",
        "2. d4 d5 3. Nd2 dxe4 4. Nxe4": "I was playing Nd7 here before, which is favored by Karpov, one of my heroes. But I don't think it was really to my taste, and I finally switched to the main line. ",
        "4... Bf5 5. Ng3 Bg6 6. Nf3 Nd7 7. h4 h6 8. h5 Bh7 9. Bd3 Bxd3 10. Qxd3 Qb6": "All moves have been standard until this move. This is a lesser-known continuation, but I thought it gave black more counterplay than usual. The black queen eyes the e4 and b2 pawns, while allowing queenside castling and the eventual joining of rooks. More common is Ngf6 or e6. ",
        "11. b3 Ngf6 12. Bb2 e6 13. O-O-O": "An interesting progression: though white is a bit open on the queenside, he still castles there. This shows that White is ready for a fight. ",
        "13... Bd6 14. c4 Bxg3": "Though I usually prefer bishops over knights in most positions, I thought that giving my opponent a worse pawn structure was a good idea. In retrospect, though, I think this capture was not so beneficial, as it opens up the f-file so white can attack my king more readily. To avoid the fork on c5, better was probably Bf4+.",
        "15. fxg3 Qa5": "Making a double attack on the h5 and a2 pawns, though after a supposed Nxh5, black can easily counter with Bc3. A better move was probably castling or Rc8/Rd8. ",
        "16. Kb1 O-O 17. Bc3 Qc7 18. Ne5 Rfd8 19. Qf3": "Now it becomes clear that taking the knight before on g3 was not a smart choice. The f-file is successfully being used by white and his plan is quite clear.",
        "19... Nxe5": "I eliminate the knight so his attacking material and power lessens. ",
        "20. dxe5 Nh7 21. g4 Ng5 22. Qe2 b6": "Now that I gained a tempo, I start progressing with my own attack on the queenside. ",
        "23. Rd2": "White chooses to attack now in the center since my knight controls the f7 square easily. ",
        "23... a5 24. Rhd1 Qe7 25. Bb2 Qc7 26. Ba3 c5": "At this point or somewhere around this point, I offered a draw, believing that both of us had no chances to move forward with any advantage. Obviously, my opponent refused the draw offer. ",
        "27. Bb2 Kf8 28. Rd2d6 Rab8 29. Bc1 Qe7 30. Qd3 Ke8 31. Bxg5 Qxg5 32. Qe4 Kf8 33. g3 Rbc8 34. Qf4 Qe7": "Exchanging queens would definitely be in his favor, so I come back to keep my drawing chances alive. White has an imposing position, though it is unclear as to what he is supposed to do. ",
        "35. Kb2 Kg8 36. Qd2": "I think this may have been a fault of white. This allows my queen more freedom after the exchange that follows. ",
        "36... Rxd6 37. Qxd6": "White wants to hunt the b6 pawn, but actually this move is a serious miscalculation. Black gains winning chances with this move, as white gives away the g5 square which my queen can occupy with great effect. If white took with the pawn instead, black would gain the pawn eventually by the king maneuvering to f7-e6 after a pawn advances.",
        "37... Qg5": "I think White did not see this continuation and counted on an exchange on d6 or my defense of the b6 pawn. ",
        "38. Ka3": "White cannot defend the g4 pawn and taking the b6 pawn leads to capturing on e6 with check and ensuing tactics, or taking on g4 with an attack on the rook. ",
        "38... Qxg4 39. Rg1 Qxh5 40. Qd7 Rf8 41. Qd6 Qh2 42. Qd1 Qf2 43. g4 Qe3 44. Re1 Qc3 45. Qc1 Qd4 46. Qd1 Rd8 47. Qe2 Qc3 48. Rd1 Rd4": "I enjoy paralyzing moves like these. White has no good continuations - there is tactics that can happen with Qb6+ and Rd2 if the rook moves away - if Qb2, then checkmate on b6 with the queen - if black exchanges rooks, I get a dangerous passed pawn. ",
        "49. Rxd4 cxd4 50. Qe4 Qe3": "(!)  I saw that white could get some counterplay with Qa8, then Qe4+, with me pushing g6 eventually and getting in trouble with a possible perpetual on f6-d8. With this move, I secure my passed pawn's future while cutting out white's counterplay. \n\nThough my opponent had some right to refuse my draw offer, as he had some chances still in retrospect, he should have been more wary my possible counterplay. \n\nMy play was inaccurate at some points and led to my opponent gaining tempo and the momentum. Though at the right time, near the end, I played fairly on point, and didn't give my opponent rest until I had a large advantage. It shows that even though a game seems drawn or even worse for oneself, it can turn out to be the opposite with special attention to accuracy. \n\n\n\n"
    },
    "url": "https://gameknot.com/annotation.pl/refusal-of-draw-offer-leads-to-winning-endgame?gm=53496",
    "gameName": "Refusal of Draw Offer Leads to Winning Endgame",
    "players": "bad5 (1714) vs. klacsanzky (1689)",
    "opening": "Caro-Kann (B12), 3.Nd2"
}