{
    "moves": {
        "1. e4 c5": "Another game from the 54th GK Tournament. Again I am black, and again I am faced with my favorite move and reply with the Sicilian - I don't like playing against the Sicilian, so it seems natural that I should return the favor to white.",
        "2. f4 g6": "This used to be known as the Philidor Variation (2. f4), something of a reversed Dutch position. Way back in 1834, Louse-Charles Mahe de La Bourdonnais played his greatest match of his career, hailed by many as a world championship match (though there was no title back then) against Alexander McDonnell. In that match, La Bourdonnais demonstrated that this variation is not sound and allows black to equialize efficiently. Today it's better known as the Grand Prix Attack, or the McDonnell attack. Me, I really know nothing about this attack, so I let the DB guide me through my next few moves.",
        "3. Nf3 Bg7 4. Nc3 Nc6": "Really all just seem like normal developing moves. We have altered the move order but arrived at the standard position for the Grand Prix Attack after 4 moves. The more common move order is 1. e4 c5 2. Nc3 Nc6 3. f4 g6 4. Nf3 Bg7. As played, black could have chosen 2. ... d5 which is a stronger way to handle 2. f4.",
        "5. Bb5 Nd4 6. O-O a6 7. Bc4 b5": "In for a penny, in for a pound. Black gains a bunch of turf on the queenside chasing the white bishop around, but the white bishop gains a strong position on d5. For now.",
        "8. Bd5 Rb8 9. e5 e6": "Time to chase away a bishop.",
        "10. Nxd4 exd5": "Or not. Black voluntarily doubles his pawns on the d-file, but this is generally not very weak, and either way, it was going to happen, on d5 or d4.",
        "11. Nf3 d6": "Moving for a quick undoubling of those d-pawns, and opening lines for the queen's bishop.",
        "12. Qe1 Ne7": "12. Qe1 seemed a bit unusual to me. The point is the discovered attack after exd6, but since black has Be6 and Qxd6, discovered attack won't go far. Consequently, a rook on e1 instead of the queen seems more dangerous - rooks on open files and mobile queens for attacking all over the board. Maybe white planned to push his d-pawn soon and wanted his queen to defend his knight on c3 against black's fianchettoed bishop on g7.",
        "13. a3 Bg4 14. Qg3 Be6": "The black bishop overextended himself. White defended his knight avoiding a potentially ruinous doubling of pawns and exposure of the white king, and at the same time she threatens the black bishop who must retreat (defense is not an option since black intends castling kingside and wants his queen to remain mobile).",
        "15. d3 Nf5 16. Qf2 O-O": "White opened a line for his bishop and black advanced his knight with tempo, then castled. This position looks very much even right now.",
        "17. b4 dxe5": "White's attack on the queenside is met by black's attack into the center. Black would like to open the a1-h8 diagonal for his bishop.",
        "18. fxe5 f6 19. Qe1 fxe5": "White's queen has made 4 moves and yet is standing on e1, only one square away from where she started. Of course, white wanted to be able to recapture on e5 and also wanted to get his queen off the open f-file so black cannot get a discovered attack or pin with his rook on f8.",
        "20. Nxe5 Qb6": "Black's bishop on g7 dearly wants a piece of white's rook on a1. All that stands in the way are a pair of white knights. With the queen on b6, black threatens a discovered check with 21. ... cxb5 which will win the white knight. I was hoping this move would invite white to move his knight off of c3, leaving the other knight pinned on the long diagonal, but I was expecting either 21. Kh1 or 21. Rf2 to prevent the discovered check.",
        "21. Nxd5 Bxd5": "White took me by surprise with this move. Obviously, his plan is 21. ... Bxd5 22. Nd7, forking queen and rooks and winning the exchange. This speculative sacrifice, if it works, could trade evenly, two white knights for a black rook + pawn, and has the added advantage of blunting black's attack. However, white miscalculated. 21. Nxd5? simply loses his knight for a pawn - if white stops here to reconsider.",
        "22. Nd7 Bd4+": "White continues with his plan, but black surprises white by refuting his speculative sacrifice with 22. ... Bd4+!. Now if 23. Kh1, Black wins easily with 23. ... Qc6! (threatening 24. Bxg2#) 24. Rf2 Rbe8 25. Be3 (Not 25. Qg1? Ng3+ 26. hxg3 Rxf2 27. Kh2 Rxg2+ 28. Qxg2 Bxg2 and mate to follow) Nxe3 26. Ne5 Bxg2+ 27. Kg1 Nd1! 28. Nxb6 Rxe1+ 29. Kxg2 Rxf2+ and mate to follow. White is much better off with 23. Rf2 Rbe8 24. Be3 (not 24. Qf1 Ng3 etc.) Qc6 25. Bxd4 Rxe1+ 26. Rxe1 Qxd7 27. Bxc5 and black has a clear material and positional advantage (Q+R+B+N vs. R+R+B). Faced with this inevitable loss of material, white resigned."
    },
    "url": "https://gameknot.com/annotation.pl/refuting-a-speculative-sacrifice?gm=24972",
    "gameName": "Refuting a Speculative Sacrifice",
    "players": "zardok (1730) vs. blake84120 (1999)",
    "opening": "Sicilian (B21), Grand Prix attack"
}