{
    "moves": {
        "1. e4": "So he starts with the usual.",
        "1... c5": "And I play my usual  Sicilian.",
        "2. d4": "Slightly unusual, but perfectly playable, although statistically white does better with the main line. (Nf3 or Nc3)",
        "2... cxd4": "So I take.",
        "3. c3": "He plays the Smith-Morra Gambit, offering a pawn for speedy development.",
        "3... Nf6": "Black can accept the pawn, but this is good as well, a suggestion of Leonard Barden.",
        "4. e5": "This is the most commonly played move in the position.",
        "4... Nd5": "And this is the only decent move for black.",
        "5. cxd4": "So he gets the pawn back",
        "5... Nc6": "I develop.",
        "6. Nf3": "and so does he",
        "6... d6": "I need to undermine his pawn before he gets the chance to support it.",
        "7. Bc4": "He develops with gain of time, hitting my knight.",
        "7... Nb6": "So likewise I hit his bishop.",
        "8. Bxf7+": "Ah the over-optimism of youth! He gets a bit of an attack and a pawn in return for the bishop, but it is never enough. I would so far as to say 8. Bxf7 check is the losing move already.",
        "8... Kxf7": "So I take.",
        "9. Ng5+": "He checks",
        "9... Kg8": "I retreat.",
        "10. e6": "He advances the pawn and makes my development hard.",
        "10... Qe8": "So I move my queen to protect the f7 square. After the game my opponent suggested he should have picked up the exchange here with Nf7 and Nxh8. The problem is my bishop and knight far outweigh his rook. Later, looking on the opening databases, was confirmation that black normally wins from such positions.",
        "11. Qf3": "He is now threatening a neat mate in 2 - Qf7+ QxQf7 pxQf7 mate! I can of course just play Nd8, but after d5 white's centre pawns are secure and it is hard for black to complete his development. On the opening databases, black wins 4 of the 5 games in this variation, but wins both the games with the improved move I played.",
        "11... g6": "Now his d pawn is hanging, and if d5 Ne5 and my knight(e5) has a lovely square, his knight can't reach f7. Black won in Paldus, Petr (2015) vs. Folk, Petr (2225) 1997. Shredder thinks d5 is the best move for white in this position, but assesses the position as +2.13 for black.",
        "12. Be3": "As played in Fabre Perez, Jose Maria (2151) vs. Echarte Buil, Oscar (2121) 2001.10.21, which black also won.\n",
        "12... Bg7": "The logical follow-up, as played in Fabre Perez, Jose Maria vs. Echarte Buil, Oscar (not that I knew that at the time of course!) Shredder gives this as +2.55 to black.",
        "13. Qg4": "White defends the d pawn. We are out of the opening databases (not that we were using them of course, this was an over-the-board game)",
        "13... h5": "So I hit his queen.",
        "14. Qe4": "Queen stays on the d pawn.",
        "14... d5": "I hit the queen again, and make sure he can never play d5 himself.",
        "15. Qd3": "Queen moves again",
        "15... Nd8": "and now his e pawn is dropping. Shredder gives this +3.33 to black.",
        "16. Nd2": "White is hopelessly lost of course, but this is a blunder, 0-0 was better.",
        "16... Nxe6": "So I take the pawn.",
        "17. Nb3": "and he misses another chance to play 0-0 and carries on with this strange knight manoeuvre.",
        "17... Nxg5": "So clear the path for my bishop.",
        "18. Bxg5": "He takes back. I have a lovely choice here. e5 looks good, Bd7 is good, so as to meet 0-0 with Bb5 winning the exchange and meet 0-0-0 with Rc8+, but eventually I play the obvious.",
        "18... Bf5 19. Qe3": "So the queen has to move.",
        "19... Nc4": "My knight comes in.",
        "20. Qe2": "The queen has to move again.",
        "20... e5": "And now this central thrust is very strong. White could resign here with a clean conscious, but the optimism of youth....",
        "21. O-O": "He finally castles",
        "21... exd4": "I take a pawn.",
        "22. Qf3": "He avoids the queen exchange",
        "22... Be4": "I hit his queen again.",
        "23. Qf4": "His queen moves",
        "23... Be5": "I hit is yet again. He seems to have spent most of the game running round with his queen, while I improve the position of my pieces hitting it.",
        "24. Qc1": "And now it is very poorly placed.",
        "24... Rc8": "threatening discovered attacks on his queen.",
        "25. Re1": "which he choses to ignore.",
        "25... Ne3": "So I carry out my threat.",
        "26. Bxe3": "He decides to trade queen for rook and bishop",
        "26... Rxc1": "so I take",
        "27. Bxc1": "he takes back. As well as having a huge material deficit all his pieces are passively placed and he was nearly out of time on his clock. OK find the move which caused him to finally resign (Shredder verified that this was the best move)",
        "27... Qb8": "Did you find it? Shredder assesses this position as +7 for black. I love the variation 28. g3 h4 and my Rh8 which hasn't done much all game suddenly comes to life! Many thanks for reading this annotation, I hope you enjoyed it. Please rate my annotation - give it a few stars and leave a comment or two!"
    },
    "url": "https://gameknot.com/annotation.pl/refutation-of-an-unsound-sacrifice?gm=42648",
    "gameName": "Refutation of an unsound sacrifice?",
    "players": "Promising youngster  vs. Charles Higgie ",
    "opening": "Sicilian (B21), Smith-Morra gambit"
}