{
    "moves": {
        "1. Nf3": "I'd have to go back in my archives to know for sure, but I think it was 1976 that I started playing the King's Indian Attack.\nThe advantage of finding an opening/defense and sticking with it a long time is you can get real familiar with its themes, and that gives you a good advantage.",
        "1... d5 2. g3 Nf6 3. Bg2": "In the King's Indian Attack, White develops quickly and then fights back in the center.\nBlack often develops his pawns in the center and controls it at the start.",
        "3... e6 4. O-O c5 5. d3": "So far, White develops almost without regard to anything Black's doing.",
        "5... Nc6 6. Nbd2 Be7 7. e4": "These are all standard moves for White. \nNow that I'm castled, I start to look for a way to play e4 and get back to the middle. I'm also interested in playing e5 and supporting the pawn with a rook on e1 and queen on e2.\n",
        "7... O-O 8. e5 Nd7 9. Re1 Qc7 10. Qe2 h6": "Not a typical move in this position. \nNormally, White's plan is Nf1, h4, and Nh2. And Bf4 in there, too.\nCould he be making this move to stop a Ng5 that I'm not planning, or is he preparing for g5. I know I want to play h4 eventually, so I think I'll play it now while it's still somewhat easy to play.",
        "11. h4 b5 12. Nf1 Bb7 13. Bf4 Nb6 14. Nf1h2 a5 15. Ng4": "Too bad his rook isn't on e8, then I'd have a legitimate threat with Nf6+. \nSo he's all lined up to attack the queenside. I'm all lined up on the kingside. Supposedly, my attack should be stronger because I'm attacking the side his king is on (and he isn't). But I'm not sure what I'll be doing next. So far, I've followed my serendipity method of playing chess, which is to put pieces on good squares and then good things will happen. I feel like there's lots of potential energy stored in my pieces right now, and I've got to find the next target ... or the next better square to move to.",
        "15... Nd7 16. h5": "I keep looking at moves that start with Nxh6+, but none of them lead to an advantage for me that I find. Not sure where I need to go next -- maybe something with d4. In the meantime, I'll use h5 to make my kingside more secure. The pawn can't be attacked by pieces. What it gives me is that it prevents g5 because of hxg6 e.p. and then Bxh6. So he can't use a pawn to chase away my bishop.",
        "16... a4 17. c4": "I can't sac anything on h6 yet, but I keep looking at it.\nI think I'll use c4 to slow down Black's pawns. Then I'll play Qd2 and follow up with Bxh6.",
        "17... bxc4 18. dxc4 d4 19. Qd2 Rfe8 20. Rad1": "I keep looking at Bxh6  gxh6; Nxh6+ followed by Qf4 with all kinds of threats against f7 and checkmate threats using the knights or the h-pawn. The problem is that I keep finding ways for Black to defend -- and end up with an extra pawn. You can't make moves expecting your opponent to miss things (especially when the opponent is rated 2228). \n \nSo I'm going to have to into holding to see if Black does something to give me an opening.",
        "20... a3 21. Bxh6": "I decided I couldn't take it any longer. The person's rated more than 200 points above me, but I'm going to play an interesting move and make him find a good defense. If he defends well in a tough position, he wins. If he messes up, then I win. What more could you ask for?\nIf he recaptures with gxh6, it's my knight that's going to recapture, and the queen will head to f4.",
        "21... gxh6 22. Nxh6+ Kg7 23. Qf4 Ref8": "Oh-oh. This is what I expected, and I thought I had a winning line ready, but now it's looking like a mirage.\nI probably should've trusted my first analysis that said, a few moves ago, that capturing on h6 didn't lead anywhere good.",
        "24. b3": "That's a big concession - basically that I don't have an attack, after all.",
        "24... Qd8 25. Ng4 Rh8 26. h6+ Kf8 27. Rd2 Ke8": "So now I have to think defense. I have two pawns for the bishop and his king is in the middle, but well-protected.\nI'm guessing the king moved off of f8 to make room for the bishop to attack the pawn or the knight to go to g6..",
        "28. Qe4 Rb8": "Now that his bishop's protected, he's threatening Ncxe5 with a discovered attack on the queen.",
        "29. Qf4 Nb4": ""
    },
    "url": "https://gameknot.com/annotation.pl/relying-on-a-mirage?gm=32810",
    "gameName": "Relying on a mirage",
    "players": "chuckbo (2020) vs. docjan (2054)",
    "opening": "Reti (A07), King's Indian attack, Yugoslav variation"
}