{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Nc3 d6 4. Bb5 Bd7 5. O-O Nd4 6. Nxd4 exd4 7. Bxd7+ Qxd7 8. Ne2 c5": "I now started looking for ways to exploit his doubled Pawns",
        "9. a3 Nf6 10. d3 d5 11. Bg5 dxe4": "He made the wrong move here. Lets me open a file where he needs to castle and double his Pawns again",
        "12. Bxf6 gxf6 13. dxe4 Bg7 14. Nf4 O-O 15. Nh5 f5": "A bishop is doing the job of a Pawn. That is easier to break down as I can just swap material and open the file up.",
        "16. Nxg7 Kxg7 17. Qh5 Qb5 18. b3 fxe4 19. Qe5+ f6 20. Qxe4 Rae8 21. Qg4+ Kh8 22. a4 Qc6 23. Qd1 Rfg8 24. f3 b6 25. Qd2": "Now it is hard to see a way to get a win.",
        "25... Re5 26. Rae1 Rh5 27. Qf4 Rg6 28. Qb8+": "He gave me the breadk I needed. Now I can try to disrupt his defense and pick up some material, but I have to be careful about letting him connect his two Rooks and Queen",
        "28... Rg8 29. Qxa7 Qd6": "Here is a potentially lethal threat. all his pieces are getting coordinated. ",
        "30. f4": "This move blocked his threat. I nearly did not see it. It would take him several moves to tear down the Pawn block without losing material and that gives me time to develp my own threats.",
        "30... Qd5": "This one is easy to defend against",
        "31. Rf2": "However, my Rook is doing double duty. Defending two squares. Not a good long-term strategy",
        "31... Qf5": "All his threats here take two moves, so I have one move to work with, then I will have to defend--unless I can mate him, of course.",
        "32. Qxb6 Qh3": "He did the move I thought of first. It was obviously what he was intending and he did it even though I had made a move changing  the board. I have a threat that I did not have one move ago. That will cost him the game.",
        "33. Qxf6+": "Bam! It is now mate in one. He is one move away from mate himself, but he will not get to make that one move.",
        "33... Rg7 34. Re8#": "A two-move mate that he did not see coming. Very satisfying win!!!"
    },
    "url": "https://gameknot.com/annotation.pl/rematch?gm=8901",
    "gameName": "Rematch?",
    "players": "almageccom (1496) vs. conqueroo (1399)",
    "opening": "Three knights game (C46)"
}