{
    "moves": {
        "1. e4": "Hi all; chicoboy asked me to annotate this game for him, so here goes! A quick and bloody opening & midgame results in a drawn-out Rook-and-pawn endgame with lots of fodder on the board, but no pieces. Enjoy!",
        "1... e5 2. Nf3 Nc6 3. d3": "I am not aware of any particular name for this King's Pawn Game. More common is for White to bring his LSB out before blocking it in with d2-d3.",
        "3... d6 4. d4": "? Why spend two moves to play d2-d4? Now White has a Scotch Game position, except he's behind by a move. Wasting time like this in the opening is terrifically dangerous; better was 4.Nc3, 4.Be3 or 4.Be2 (of course, simply playing 3.d4 would have been good, too!) It's important, at all stages of the game but especially the opening, to ask \"why am I playing this move? What does it contribute to my longterm goals?\"",
        "4... Bg4 5. h3": "? This loses a pawn for White, though it's not a terrible disadvantage this early in the game, since he'll retain the Bishop pair and good activity for his Queen.",
        "5... Bxf3 6. Qxf3 Nxd4 7. Qd3 Nf6": "Black snatches the pawn and continues logical development.",
        "8. c3": "This is a kind of strange move--clearly White wants to get rid of the Black Knight, but it's still the opening and this is White's third pawn move that doesn't aid in his development, out of only eight moves total! Better was 8.Be3.",
        "8... Nc6 9. Bg5 Be7 10. Be2": "Both sides continue to develop pieces to natural positions and prepare to castle. Black's Bishop is quite restricted but should be able to find play on the kingside, whereas White's Queen is in the awkward position of being the only defender for e4.",
        "10... d5": "? Black overlooks the same trick that White missed six moves ago, and inadvertently gives back the pawn.",
        "11. Bxf6 dxe4": "?! This is an interesting variation. Rather than equalize, Black has given himself a significant central/kingside pawn majority in exchange for a bit of material. After 12.Qxd8+ Rxd8 13.Bxe7 Kxe7 (keeping the Black pieces centralized and preparing to double on the d-file), White has a Bishop for two pawns. Black's pieces are slightly more active, but I don't think the compensation is enough, as Black has no immediate threats.",
        "12. Qxd8+ Rxd8 13. Bxe7 Nxe7": "? I would have preferred 13...Kxe7, but Black is prioritizing castling here. It's important to note that castling is frequently a strong maneuver, but it is not objectively correct in all circumstances. Being a piece behind, Black should be keeping the King and Knight centralized to assist in the pawn push; there is no danger of a mating attack yet from the stagnant White pieces, whereas Black *must* play more energetically to have any chance of success.",
        "14. Nd2 O-O": "See above; castling is not important for Black here, and in fact probably gives White an advantage (especially since this move sacrifices the important e4 pawn). A better choice would have been 14...f5! where if White plays 15.g4, Black can coolly respond with 15...g6 and soon ...Kf7, and get the pawn storm rolling before White can coordinate his pieces.",
        "15. Nxe4 b6 16. O-O": "As White has a Bishop for a pawn and Black is very passive, he can castle without worry--the endgame should be a win, so he can simply consolidate, removing his King from possible checking tactics, and make ready to compound his advantages.",
        "16... f5 17. Bc4+ Kh8": "?? This move loses the exchange after 18.Ng5!, where White is threatening either 19.Ne6 or 19.Nf7+, winning a Rook in either case. Better for Black was 17...Nd5.",
        "18. Ng5": "! See above; this move wins material with threats of multiple forks. Black can save his Rook with 18...Rd2?! but loses any hope of counterplay after 19.Nf7+ Kg8 20.Nxe5+ Kh8 21.b4.",
        "18... Nd5": "Recentralizing the Knight, but too late to be of use.",
        "19. Ne6 Nf6 20. Nxd8": "White takes the Rook on the open file, so that he can challenge it again with 21.Rad1 and force Black to either exchange (which gives White an easy win), or spend a tempo retreating his Rook.",
        "20... Rxd8 21. Rad1 Rf8 22. Rd2 e4 23. Rfd1 Ne8": "?? This appears to be intended to get the Knight to d6 and block the White Rooks, but with the Black Rook and King so vulnerable, this simply walks into a winning pin along Black's back rank. Best was 23...g5, allowing the BK to escape his prison and support his Rook from g7, as well as leaving the Knight where it defends d7.",
        "24. Rd2d8 g5 25. Bf7": "?? White is quite far ahead, so this isn't a losing blunder, but there's no reason to exchange when you can simply win the material for free! 25.Bb5! wins the Knight for nothing. As Lasker said, \"when you see a good move, wait--look for a better one.\"",
        "25... Rxf7 26. Rxe8+": "White clearly has a vastly better position as this RP endgame approaches, but I will continue to make occasional comments.",
        "26... Kg7 27. Rdd8": "Doubled Rooks on the back (or 7th/2nd) rank are a fantastic way to chew through your opponent's pawns.",
        "27... Kh6 28. g4 fxg4 29. Re6+": "? This allows the Black King down to h5; better was to first restrain him with 29.hxg4.",
        "29... Kg7": "? 29...Kh5 was better, gaining the h-pawn in exchange for the g-pawn and retaining some (albeit very slight) chance for counterpressure down the h-file.",
        "30. hxg4 h6 31. Ree8 Kf6 32. Rd5 Kg7 33. Rdd8 Rf4 34. Rd7+ Rf7": "Probably 34...Kf6 would have been better, retaining more activity for the endgame (after 35.Rf8+ Kg6 36.Rxf4 gxf4 37.Rxc7 Kg5).",
        "35. Ree7 Rxe7 36. Rxe7+ Kf6 37. Rxc7 Ke5 38. Kg2 Kf4": "Black's King is far more active than White's, but there's no way to force a pawn through with that Rook drifting around on the 7th rank and the WK guarding the coronation squares.",
        "39. Re7 Kxg4 40. Rxe4+ Kf5 41. Re8 h5 42. Rf8+ Kg4": "42...Ke4 was better; the text allows White to trap the BK on h4 with 43.f3+! and quickly clean up his remaining pawns without any worry about advancing Black pawns.",
        "43. Kh2 h4 44. f3+ Kh5 45. Kh3 Kg6 46. Kg4": "Black has lost all his activity, and with it any hope for counterplay.",
        "46... a5 47. Rb8 a4 48. Rxb6+ Kf7 49. Rh6 Kg7 50. Kxg5 h3 51. Rxh3 Kg8": "? This is sort of a silly thing to do. Black is presumably hoping that White will advance pawns willy-nilly and end up with a stalemate, but this move actually sets up a very simple mate in three for White (52.Kf6! a3 53.b3 Kg8 54.Rh8#). The BK needed to remain on the seventh rank as long as possible with 51...Kf7.",
        "52. Kg6": "? White either does not see the mate or does not care to look for it. I expect (based on White's choices in the remainder of the game) that it is the latter, but it's always best to take the simple, guaranteed mate if it's there. From here on out, White doesn't do anything terrible to let Black out of the mating net, but he also ignores the simple KR endgame and instead goes for the promotion.",
        "52... a3 53. bxa3 Kf8 54. Rh7 Kg8 55. c4": "Should have been mate in two: 55.Rf7 Kh8 56.Rf8#",
        "55... Kf8 56. c5 Ke8 57. c6 Kd8 58. Kf6 Kc8 59. Ke6 Kd8 60. Kd6 Ke8 61. c7 Kf8 62. c8=Q#": "There you have it. Perhaps a slower mate than necessary, but certainly smoothly-executed by White. Black's failure to understand the urgency of keeping pieces near the central pawn structure when down in material led predictably to those pawns becoming vulnerable, and falling in due course. Hope you enjoyed!"
    },
    "url": "https://gameknot.com/annotation.pl/request-rook-and-pawn?gm=45728",
    "gameName": "Request: Rook and Pawn",
    "players": "chicoboy (1217) vs. catos (1320)",
    "opening": "King's pawn game (C44)"
}