{
    "moves": {
        "1. e4": "Hi all! This is a game from the Walking the Walk Mini-Tournament Group 4 that I'm annotating on chicoboy's request. Enjoy!",
        "1... e5 2. Nf3 Nc6 3. d4": "White avoids the Ruy Lopez (3.Bb5) and chooses the Scotch Game instead. This opening is characterized by the open center and usually White's strong central presence.",
        "3... exd4": "This is best. There's no good way for Black to maintain his pawn on e5, and taking with the Knight (3...Nxd4 4.Nxd4 exd4 5.Qxd4) leaves White's Queen on a very strong central square without an easy way to drive her away.",
        "4. Nxd4 Qf6": "4...Bc5 or 4...Nf6 are far and away more popular, and safer. This is too early to bring out the BQ, and furthermore she's blocking the King Knight's best square.",
        "5. Be3": "A good developing move, defending both the Knight and the f2 pawn.",
        "5... Bc5": "Black piles up on the Knight.",
        "6. c3": "White still has adequate defenses, though he's forced to take the c3 square away from his QN.",
        "6... Nxd4": "? Black has nothing to gain from this exchange. At best, he'll give White a formidable center and a developmental edge (7.Bxd4 Bxd4 8.Qxd4 Qxd4 9.cxd4). Better choices would have been 6...d6 or 6...Ne7, to simply continue development.",
        "7. Bxd4": "White recaptures.",
        "7... Bb6": "?? Hugely, Black overlooks the threat to his Queen.",
        "8. Bxf6": "White wastes no time.",
        "8... Nxf6 9. Bd3": "Black could resign, with a mere Bishop for his Queen, but chooses to fight on--it's still early in the game, and there's plenty of time for White to make mistakes.",
        "9... d6 10. O-O O-O": "Both players get their Kings to safety.",
        "11. Nd2 g6": "? I simply don't see a purpose to this move. It needlessly weakens the Black King's position, when Black *should* be focusing on getting all his pieces out. When you're behind in material, it is absolutely critical to make every move count, and make more use of the pieces you *do* have.",
        "12. Re1": "White is playing soundly, just developing and solidifying his advantage.",
        "12... Kh8": "? Again, there's no reason for this move. All the King-related movement suggests that Black is feeling how far behind he is and panicking as a result.",
        "13. Nf3": "White prepares e4-e5.",
        "13... Rg8": "I guess this is the point of Black's last move--but what is he going to do with his Rook over here? He should be developing and making active counterplay, not this passive repositioning with no apparent purpose. This Rook belongs on e8 anyway, to contest White's pawn advance.",
        "14. e5 dxe5 15. Nxe5 Be6": "Finally, Black starts to pay attention to his other pieces.",
        "16. Qf3": "White forks the Knight and b7 pawn.",
        "16... Kg7": "This is probably the best response Black has to offer. 16...Nd5 would defend b7 momentarily, but loses to a tactical shot because weak Black castle is so vulnerable. (e.g. 16...Nd5? 17.Nxf7+ Bxf7 18.Qxf7 c6 19.c4 and now the Black Knight falls, since moving would allow 20.Re7 and mate soon to follow.",
        "17. Bc4": "! White stays the course, continuing to hammer at Black's weak King by pointing more pieces at f7.",
        "17... h5": "? It's not clear what Black is planning, but it sure isn't \"keeping his King safe\". This lets White force the exchange on e6 and further grow his advantage.",
        "18. Bxe6 fxe6 19. Qg3": "Threatening a mate in two (20.Qxg6+ Kh8 21.Nf7#). But, it's easily defended.",
        "19... Kh7": "Black gets his King out of the way, letting the Rook defend the g-pawn. Bear in mind that it only needs defending because of all the weakening moves Black made in the first place!",
        "20. Qf3": "Back to the fork.",
        "20... Raf8": "Black defends his Knight, and begins to put some indirect pressure on f2.",
        "21. Qd3": "Now it looks like it's White who can't decide what he wants to do!",
        "21... Ng4": "Not great. You should try to avoid piece trades when so far behind, since they just give the other player (White) a bigger advantage.",
        "22. Nxg4 hxg4 23. Ref1": "Defending f2.",
        "23... Rg7": "Black prepares to double.",
        "24. h3": "This may not be ideal, but I like it--White gives his King an escape square and threatens to open the h-file for use against the Black King.",
        "24... gxh3": "Ooh, not good. This loses a pawn to 24.Qxh3+ Kg8 25.Qxe6+. Not to mention, it opens the h-file.",
        "25. Qxh3+ Kg8 26. Qxe6+ Rgf7": "The Rooks are doubled now... but pinned.",
        "27. Kh1": "? There was no need for this. Now the WK is on the open file. White ought to have simply picked up another free pawn while maintaining his checks: 27.Qxg6+ Rg7 28.Qe6+",
        "27... Kh8": "Unpinning the Rf7...",
        "28. f3": "?? White wants to release his Rook from guard duty, but it would have been easier to simply give up the pawn. This allows the Bishop to cut off the King's only escape route...",
        "28... Rh7+": "! Black finds his opening. White has only one response.",
        "29. Qh3 Rxh3+ 30. gxh3": "White still has the advantage, but obviously it is much less pronounced.",
        "30... Kg7 31. Rae1": "This Rook should have been developed fifteen moves ago.",
        "31... Rh8 32. Kg2 c5": "? Loses a pawn to 33.Re7+. Black should be trying to get his King into the game with ...Kf6-f5.",
        "33. c4": "White locks up the Bishop instead of grabbing the free pawn.",
        "33... Ba5 34. Re7+ Kh6 35. Kg3": "Fine, though I would have played 35.Rxb7.",
        "35... Kh5": "Black is apparently unconcerned about his queenside pawns. To be fair, White doesn't seem to care about them either.",
        "36. Re5+ g5 37. Rxc5 Bb6 38. Rf5 Bc7+ 39. Kg2": "Better was 39.f4 (Black can't capture it since his g-pawn is pinned).",
        "39... Re8 40. Rf2": "40.f4 was still better. White should be pressuring (and therefore winning) the g-pawn.",
        "40... Kh4": "?? For some reason, Black is intent on putting his King in the most dangerous corner he can find. It looks like he wants to play ...Bg3 to threaten White's Rook... but why? That doesn't actually accomplish anything. Black should be focused on getting his King to an active square, not back here where it can't escape from anything. 40...Kg6 was far better.",
        "41. Rf7": "Threatening mate thanks to the BK's ugly location.",
        "41... Bg3": "?? Black overlooks the mate threat. 41...g4 was called for.",
        "42. Rh7#": "Well-spotted by White. This was a game, I think, about dealing with mistakes. Black gave up his Queen early and seemed to panic as a result, making a lot of useless moves and unable to come up with a plan. White gave his Queen up to a nice tactic later, but didn't get nearly so flustered, and continued to simply look for a victory with his other pieces. It's a good lesson to learn."
    },
    "url": "https://gameknot.com/annotation.pl/request-dealing-with-mistakes?gm=48780",
    "gameName": "Request: Dealing With Mistakes",
    "players": "chicoboy (1251) vs. chrisforbes21 (1166)",
    "opening": "Scotch game (C45)"
}