{
    "moves": {
        "1. d4": "Queens pawn game... i prefer playing against e4 but oh well.",
        "1... Nf6": "Developing the Knight, a common reply to d4.",
        "2. c4 e6": "I honestly don't know what this is called but i believe it essentially transposes into the Queens gambit.",
        "3. Nc3": "all standard so far.",
        "3... d5": "Contests the center, i believe we are in a Queens gambit game.",
        "4. Bg5": "Pins the Knight to the Queen",
        "4... Be7": "Removes the pin as well as preparing to castle. My King has a pool table so it is a pretty legit castle.",
        "5. e3": "Opens up his light squared bishop. I believe this is all standard so far.",
        "5... O-O": "Chillin' like a villain, with a pool table.",
        "6. Nf3": "Developing move.",
        "6... dxc4": "So i think i played this a bit too prematurely. This allows him to simply recapture with the bishop, thus developing a piece. My eventual goal was to play c5 to contest the center and i didn't want a scenario like 6...c5 7. dxc5 Bxc5 8.cxd5 exd5 which would leave me with an isolated d pawn. In  retrospect, i don't think this was best.",
        "7. Bxc4": "develops his bishop with the recapture.",
        "7... c6": "um... i think i was looking for a caro-kann type structure but with the bishop still closed in on the back rank this just seems bad. Now my Knight doesn't have the c6 square to go to either. I don't really know what i was thinking but i don't like it.",
        "8. O-O": "Goes into safety, however i doubt his castle has a pool table like mine.",
        "8... Nd5": "forces the exchange of bishops however i don't think this benefits me too much as my other bishop is blocked in and i am exchanging my good bishop for his bad one, even if it is outside his pawn chain... It is clear that i'm not playing winning chess right now.",
        "9. Bxe7 Qxe7 10. Qb3": "Gets the evil succubus into play and piles up on the knight at d5. However, my pawns have him pretty reinforced for now.",
        "10... Nd7": "develops my Knight, i need some catching up to do.",
        "11. Nxd5 exd5 12. Bd3": "Was that exchange beneficial for him? ",
        "12... Nf6": "So my bishop sees some light although he is still considered bad. At this point i was really looking to try to exchange him...",
        "13. h3": "takes away the g4 square.",
        "13... Ne4": "Centralizes the knight. I wouldn't mind him exchanging his good bishop for my knight.",
        "14. Rac1": "but that wasn't in the cards. Instead he gets his Rook over to a semi-open file.",
        "14... Ng5": "My intention here was to try to entice the exchange of knights and after the eventual recapture with my queen i could move my bishop out with the threat of Bxh3 or even Bf5 enticing the exchange of bishops. At this point i didn't have a definitive plan of action and was just trying to simplify. Not the greatest strategy but at least i was striving for something...",
        "15. Nxg5 Qxg5": "So he accepts the exchange.",
        "16. Kh2": "Preventing Bxh3. Something i also failed to recognize at the time was that Bf5 simply hangs a pawn after the exchange which certainly wouldn't help my cause.",
        "16... Re8": "So i move my rook over to a semi-open file, just trying to get some activity for my pieces.",
        "17. Qc2": "Doubling up on the diagonal and threatening the h7 orchid.",
        "17... Re6": "My goal here was to sac a pawn in an attempt to gain activity for the rook and eventually pile up on the king side. In retrospect, i believe this was simply unsound. ",
        "18. Bxh7+ Kh8 19. Bf5": "So now i'm a pawn down. Great...",
        "19... Rh6": "Continuing with my plan simply because i just can't see what else to do...",
        "20. Bxc8": "Well hey... at least my bad bishop is off the board now.",
        "20... Rxc8 21. Qe2": "I don't know the purpose of this move?",
        "21... g6": "My goal here was to get my king of the back rank and try to pile up on the semi-open files. ",
        "22. f4": "This creates a target at e3 although i don't really have the manpower to take advantage of it.",
        "22... Qe7": "Still, it is something to look at at least. At this point i was thinking maybe i could exchange queens, try to keep the board locked up and hope for a draw.",
        "23. Qg4": "threatening my rook on the back rank, maybe now i can make use of that target at e3?",
        "23... f5": "Or not... This makes the queen move and it adds more manpower to cover the e4 square. But maybe better was Re8?",
        "24. Qf3": "I'm out of ideas other then remove the queens and try to get a draw.",
        "24... Qe4": "So i went for it.",
        "25. Qxe4": "And he accepts the exchange.",
        "25... dxe4": "So now i should be focused on getting my rooks into play. especially the one on h6 who simply put, sucks.",
        "26. Rc5": "Oh dear... so he is going to double up on the c file and then push that d pawn. i feel like i'm in rough shape here.",
        "26... Rh7": "Just trying to get as much reinforcements as possible over there. perhaps b6 was better?",
        "27. Rfc1": "So he is doubled up now and that looming pawn push is looking pretty nasty right now.",
        "27... Rd7": "If he is going to push the pawn and ultimately exchange, at least i'll have a rook on an open file afterwards. Things are looking pretty bleak.",
        "28. d5": "And sure enough there it is.",
        "28... Rd6": "Defending c6 with all the material i have, however after he starts pushing is a and b pawns i'm not going to have enough man power to defend it.",
        "29. b4": "And sure enough here they come.",
        "29... a6": "Holding on with every little bit i have.",
        "30. a4": "Unfortunately for me he simply has more.",
        "30... Kg7": "Trying to get my king involved in some action although at this point c6 is a lost cause.",
        "31. b5": "He continues to advance and rightfully so. ",
        "31... axb5": "fighting back with what little i have over on that side of the board.",
        "32. axb5": "And now i'm in a bit of a hole.",
        "32... Rcd8": "Well i might as well double up on the soon to be open file, see if i can find any sort of counter play.",
        "33. dxc6 bxc6 34. Rc5xc6": "An exchange here will simply leave me with an eventual loss. So lets try to find some counter play.",
        "34... Rd6d3": "Targets the week and backwards e pawn that i was wishing i could successfully target some time ago.",
        "35. b6": "I'm not too sure about this move. If he had played Rb1 first the pawn would be far more imposing. However now he is giving me an opportunity to stay alive.",
        "35... Rb3": "Rooks belong behind passed pawns and because he neglected to move his rook to b1 i will happily get behind his pawn. Although i am still behind it looked like a little glimmer of hope.",
        "36. Rc6c7+": "If i move to the back rank, b7 is the death of me.",
        "36... Kh6": "So i move over here. Still, this is a pretty dangerous area for my king as now i don't have anywhere to go.",
        "37. Rc1c6": "Pins my g pawn to my king. I'm still in quite rough shape.",
        "37... Rb8": "Protecting myself from the very imposing pawn.",
        "38. g4": "My king has no where to run to. I have to take otherwise g5 Kh5  Rh7#.",
        "38... fxg4 39. hxg4 Rxe3": "Now i reduced the material advantage to one pawn and it actually seems like i have a tiny shred of counter play going on.",
        "40. f5": "Piling up on the pinned pawn.",
        "40... Kg5": "Now i have an open file for my rook on the back rank. There is some light, although not much.",
        "41. Rxg6+": "I'm desperately trying to get some counter play, so that pawn is the least of my worries.",
        "41... Kf4": "Now it actually seems like i have some legitimate counter play going on. ",
        "42. Rgg7": "? so after this move my opponent actually offered me a draw. Only a few moves ago i would of been eager to accept a draw, although now it seems as though i have a legitimate shot at this game.",
        "42... Rxb6": "So seeing a light at the end of the tunnel, i decide to play on. I have held on long enough and now i feel like i am back and better now than i have been all game.",
        "43. Rcb7": "trying to trade off rooks, however i am not remotely interested in that.",
        "43... Rh6+": "And just like that, my rooks are extremely active and his king has no protection from his pieces.",
        "44. Kg2": "Things are looking great for me now.",
        "44... Rg3+ 45. Kf1": "His fate is pretty much sealed now.",
        "45... Rh1+": "Here comes the hammer.",
        "46. Kf2 Rh2+ 47. Kf1": "So his king is stuck on the back rank and he has some serious problems.",
        "47... Kf3": "The winning move.",
        "48. Rb3+": "A desperate attempt to prevent the mate.",
        "48... e3": "However it is easily parried. And with this my opponent resigned, leaving my a kind message as well. So although i was down for pretty much the entire game, i held on and with a little luck managed to pull out a win. Thanks to drpat23 for playing a great game with me."
    },
    "url": "https://gameknot.com/annotation.pl/resilience?gm=46807",
    "gameName": "Resilience",
    "players": "drpat23 (1749) vs. yrahcaz1990 (1735)",
    "opening": "Nimzo-Indian defence (E20)"
}