{
    "moves": {
        "1. e4": "ALL COMMENTS ARE WELCOME !!!\n-------------------------------------------",
        "1... e5 2. f4 exf4": "king's gambit accepted",
        "3. Nf3 g5 4. Nc3 Bg7 5. Bc4": "we arrived to an old position in king's gambit accepted. \nh4 is often played. \nthis position is not played nowadays as it gives poor chances for black to win, even to draw\n",
        "5... g4": "d6 is more careful. From now, i was expecting a bad cyclone on my head !",
        "6. O-O": "a good move ! white sacrifies a piece to open the f column and gain time. ",
        "6... gxf3": "let's go !  I want to loose with my stomach full of white knight !",
        "7. Qxf3": "the f4 pawn will now pay for Knight's death. ",
        "7... d6": "digestion ...",
        "8. Qxf4": "... it seems that white did not analyzed the situation correctly: \nthe sacrifice Bxf7 was giving surely a winning attack :\nBxf7, Kxf7, Qh5 , Kf8, Rxf4 , Nf6, Nd5, Nd7, b4 etc.",
        "8... Bd4+": "after a long analyze, i found  this move that makes me live for some time more... ",
        "9. Kh1 Qf6": "here it is, black are ready to sign for a queen exchange as they have two points advance.",
        "10. Nd5": "white looks to c7, but let black exchange queens\ni was expecting Qg3\n\n",
        "10... Qxf4": "black takes a breath \nwhite cannot take c7 immediatly ? : Nxc7 , Kd7, Nxa8,  Qxf1, Bxf1 etc.",
        "11. Rxf4 Bb6": "just in time to defend c7",
        "12. Nxb6": "here white are not obliged to take immediatly. i think Rxf7 was better",
        "12... axb6 13. Bxf7+": "black are loosing a pawn again, but escaped from the 1st white storm. \nat that time, i sweared never accept again a king's gambit !\n",
        "13... Kd8": "Ke7 was better to control f6, f7 and f8",
        "14. d3": "now is a series of white imprecisions.\nwhite have still a development advance. their plan would be d4, a3, Bd2 or e3 and Rf1",
        "14... Ne7": "black have a lot of work to develop.  black king must find rapidly a square to be secured.",
        "15. Be3 c5": "black plan is to give the c7 square to their king, d7 to the bishop and c6 to the \"b\" Knight, and to finally coordinate rooks",
        "16. d4": "an error. white 2nd attack is not prepared. white needed to play a3 to put a second rook in action.",
        "16... Nbc6": "\n",
        "17. dxc5": "taking c5 isolates pawn e4 and let black to take with b6, it also gives the e5 square to black. \nprotecting the pawn with c3 was better.\n",
        "17... bxc5 18. a3": "finally open the liberty door to Ra1.",
        "18... Kc7 19. Bd5": "a strange move. why did the white want to exchange an active piece and give the pair of bishop ? Raf1 was definitly more frightening",
        "19... Nxd5 20. exd5 Ne5": "the black knight is now the chessboard's more powerful piece. it prevents c4, Rf7. ",
        "21. h3": "a passive move. i was expecing Rf1. this gives the chance to black to achieve their development",
        "21... Bd7": "black aim is done",
        "22. b3": "a bad move. \nRf1 was better",
        "22... b5": "for the first time of the game, i have the initiative.\nthe rook a1 never moved !! ",
        "23. Kh2 Rhe8 24. Bg1": "black plays actively",
        "24... Ref8": "black want to enter in a winning final",
        "25. Rxf8 Rxf8 26. a4": "white have a passed a pawn",
        "26... bxa4 27. bxa4": "the white pawn structure is now ruins",
        "27... Ra8 28. a5": "with this move, the d5 pawn is now not defendable",
        "28... Bb5 29. Bf2 Bc4 30. Bg3": "a good plan for black, but too late",
        "30... Bxd5 31. Bxe5 dxe5": "black have a decisive advantage with one piece more. ",
        "32. Ra4": "yes :-) !!! the rook is waking up and is hungry ",
        "32... e4 33. g4 e3 34. Kg1 Kc6 35. c4": "the c4 pawn is now a target for the Black bishop\nblack have a winning final. \n",
        "35... Bf7 36. Kf1 Kd6 37. Ke2 Re8 38. a6 Kc6 39. h4 Kb6 40. a7 Ra8 41. Kxe3 Rxa7 42. Rxa7 Kxa7 43. Kd3 Kb6 44. h5 Kc6": "it was my birthday, i was 44 !"
    },
    "url": "https://gameknot.com/annotation.pl/resurection?gm=16274",
    "gameName": "RESURECTION",
    "players": "pizzakeith (1581) vs. yanov (1637)",
    "opening": "KGA (C37), Quaade gambit"
}