{
    "moves": {
        "1. e4": "Stalhandske challenged me to a dual because in a early annotated game in which he was played the Alekine defense I made the pompous statement that Alekine defense was dead and a guaranteed win for white in all lines. So he challenged me to walk the talk and prove it.  FYI if there are many grammar and spelling mistake please excuse them as this was done in a rush. ",
        "1... Nf6": "Black tempts white into advancing the e-pawn beyond the 4th rank in order to prove some time in the near future that white's \"big\" center is weak not strong. ",
        "2. e5": "Of course I do not believe that and say, \"my pawn shall crush you!\" ",
        "2... Nd5": "black has now wasted tempo by moving the knight twice. This is perfectly ok because White done the same thing by pushing the e-pawn and not developing pieces. ",
        "3. d4": "White defends the e-pawn and tries to hang onto his space advantage in the center. ",
        "3... d6": "This is the key that unlocks all of black's \"perceived\" problems. Now there is now way that white can hold onto the e-pawn which at once equalizes for black. ",
        "4. Nf3": "This is the modern approach to the Alekine. The traditional space hungry grab 4. c4 has fallen out of favor because white's already over extended pawn structure is over extended even more.  ",
        "4... dxe5": "Objective complete! Black has eliminates white's center superiority and the game is equal. I am not a fan of the main alternative 4. ...Bg4 5. Be2 e6 6. 0-0 in my view is more pleasant for white.  ",
        "5. c4": "This in hindsight was not as good as I thought. While it gains space at the expense of the knight it makes defending the d-pawn extremely difficult for white. ",
        "5... e4": "I like this move a lot!  Black counters white's threat with threatening to eliminate a key defender of d4 and allowing white to double up his pawns on the d-file.",
        "6. cxd5": "Maybe this is not the best move but it still leaves me in charge in the center. The gameknot engine suggested 6. Ne5 as best. But here are my thoughts. I have already resigned to the fact that white has gained absolutely nothing from the opening. At this point I am visualizing how I might be able to make something happen on the king side. I see that first I must strengthen the D-pawn my last bastion in the center. Then I see the glimmer of excitement when I have a bishop on c2 and the queen on d3. But this is not enough in of itself. I must provoke black into making some positional concessions on the king side. So maybe Bg5 with the help of h4-h5 will be often to break the dead lock. ",
        "6... exf3 7. Qxf3": "White still controls the center but has major positional weakness. ",
        "7... c6": "Again black continues to pound away at white's center. I love the beautiful simplicity of black's strategic plan. ",
        "8. Nc3": "With d4 being so weak the last thing I want to do is help black build pressure up against it. 8. dxc6 Nxc6 is in my view better for black this is what the gameknot engine suggested. ",
        "8... e6": "Now black threatens to solidify his stake in the center with ...cxd5. So this forces white to expose d4. ",
        "9. dxe6": "Since I have a choose on which piece black will develop I am going to choose the one that puts less pressure on d4. The gameknot engine disagrees slightly by suggesting that 9. dxc6 nxc6 10.d5!? is slightly in whites favor. This maybe true objectively but I am sensing that Stalhandske would do quite well in such open positions. Feeling this I decide to play the possibly inferior dxe6 in order to steer the game into where quiet positional maneuvering is required. I therefore, make this move confidently that my positional skills are superior to Stalhandske's rewarding me with the mating opportunity that I dream about. ",
        "9... Bxe6 10. Be3": "Stalhandske commented at this point during the game that he felt he had succeeded in proving that the Alekine defense is not dead. Myself of course with a lump in my throat had to agree. It is in my opinion that in this current position black is slightly better. He has no serious pawn weaknesses, his pieces are able to mobilize freely and quickly. the only real drawback for black is that he has no real prospects of attack. This however, did not discourage me, I will continue on executing my term plans and rely on my strong positional skills to create some magic. I intend to do a dance(the shuffle) to reorganize my pieces put pressure on the king side. My fingers are crossed that Stalhandske will assist me by playing moves like ...h6 and maybe if I am so lucky ...g6. ",
        "10... Nd7": "This knight is quite strong here where it eyes c5 and e5 and can possible go to d5 via b6 or f6 ",
        "11. h3": "This is the beginning of my attacking scheme. I continue to dream that one day this pawn will forcing black into playing g6 or h5",
        "11... Bb4": "Now the game takes on a very masterful feel where both sides make small moves that have long term significant. It is important to note that neither side is looking for knock out blows( this is in stark contrast to amateur games where one side will make a ration move looking for that quick strike). it is here where the position is absolutely level where master games are won and lost. It is imperative to be patient, make small improvements and make no weaknesses. With that said we can see that while 11. ...Bb4 is good it is not ideal because it is short sighted in that the pin on c3 is of no real consequence. So what is can black do to gain something down the road. Maybe the answer is 11. ...Bd6!? controlling the b8-h2 diagonal which will become really important 10 moves from now. ",
        "12. Be2": "I do not think black is too serious about capturing on c3 since it helps support the d-pawn. Now 12. Bd3 is short sighted since after 12. ...Nf6 13. 0-0 Nd5 black is creating magic on c3. By playing 12. Be2 I earn the right to castle but more critically I keep the 3rd rank clear to defend c3 with my queen, rook and bishop. ",
        "12... Nf6": "Now black maybe thinking of capturing on c3 with the support of ...Nd5. When Stalhandske played 11. ...Bb4 this is what I thought he might be up to. However, I have already adequately made preparations for it well before he got up this morning!That is a joke a Stalhandske ;)  ",
        "13. O-O": "Breaking the pin. ",
        "13... O-O": "Now here I have to say that black is slightly better than white because of the weakness of the d-pawn. From here the game shifts into a quiet positional battle where each player seeks to slowly improve their pieces without creating any more weaknesses. My plan is to stack up my rooks on the e-file, place the LSB on c2 with the support of the queen on d3 to eye h7 and g6 and play g4-g5 or h4-h5 to rattle black's cage in hopes of spooking him. It is a long shot I know but hey it is the best I got. ",
        "14. Bd3": "With the king castled I no longer fear the capture on c3 as it no longer benefits black in anyway. Though it is still quite playable for black ",
        "14... Re8": "Stalhandske like myself is seeking to steadily improve is his prospects. ",
        "15. Rfe1": "In order to stack my rooks I have to put a rook on e5 which has its risks since black still has his DSB. ",
        "15... Qd7": "creating the possibility of long term threats on h3 and clearing the bank ranks to connect the rooks. ",
        "16. Bg5": "clearing the e-file but encouraging black to play Nd5 which is what he wants to do. ",
        "16... Nd5 17. Bc2": "defends c3 if black wants to go that route but also allows me to play Qd3 forcing black to play ...g6. ",
        "17... h6": "it is hard to slap Stalhandske's hands for this since there is no way he could foresee the long term consequences of conceding the g6 square to white. But it has to be said that this is where it starts to go south for black. This is considered as a \"positional concession\" and one like this one is not too bad but the problem is that it is like kicking a hornets nest, it causes more problems than it solves. In this game the hornets nest is the light square weakness on g6 and h7. ",
        "18. Bd2": "now that the bishops mission of provoking ...h6 weakening g6 is a success it goes back to the defense of c3. ",
        "18... Ba5": "not a bad move but I think black is under estimating the weakness on b1-h7 diagonal. It is clear that black wants to keep his DSB. However, on a5 it is less active and short sighted. It ignores the possibility of an attack on the king side via h4-h5 or g4-g5. Perhaps the idea behind Stalhandske's logical is that he intends to play ...Bc7 controlling the critical b8-h2 diagonal. If Stalhandske was thinking long term he maybe had opted for the prophylactic 18. ...Bf8 anticipating the impeding attack. ",
        "19. Qd3": "Of the two players I must say that white has improved his position much more than black. This is a result of the contrasting approaches to the position. Black who has chosen to active piece development that have immediate short term prospects is running out of useful moves. Furthermore, his pieces are not as harmonious as their counterparts. Compared to white who has chosen to resist immediate attacking prospects for long term advantages. From here on out all of white's patient maneuvering begins to pay dividends as black now starts to scramble just to keep up with white.  ",
        "19... Nf6": "Is this the forbearer of doom? As the knight feels obliged to abandon his active post on d5 in order to return to the defense of h7. ",
        "20. Bf4": "Challenging black for control of all the open diagonals. This forces blacks hand as he can not allow white to control this diagonal. This is the germ seed of my ultimate plan of doubling my rooks on the e-file. I am envisioning a rook on e5 that ties black completely down. Yet, I still can not see a clear line for a win. ",
        "20... Bc7 21. Bxc7": "With the Dark square bishops gone I have gained soul possession of the e5 outpost. It is now safe to put a rook there. ",
        "21... Qxc7 22. Ne4": "Eliminating the primary defender of the light squares in front of the king is the next step of softening the defenses for h4-h5. ",
        "22... Nxe4 23. Rxe4": "While white's position is active black is still very solid and should easily draw. I would only say that white is slightly better. ",
        "23... Qd7": "Black has nothing useful to but sit and wait. This is one of the major drawbacks of the Alekine defense. It is a defensive juggernaut but it sorely lacks attacking resources. ",
        "24. Rae1": "It took almost 12 moves but my positional maneuvering is almost complete. ",
        "24... Rad8": "Stalhandske also completes his positional maneuvering. However, white has the edge due to the fact that his pieces are better coordinated and superior to their counterparts. Yet, the edge is not enough to win because of the lack of exploitable weaknesses. This is not unusually in master games and it is one of the distinguishing features between a master game and an amateur game. When all things are equal the true strength is pulling a magic rabbit out of your hat. ",
        "25. h4": "The first signal to black that it is game on!",
        "25... b5": "Stalhandske is sticking true to his character by choosing the most immediate active defense. I assume he wants to play ...Bc4 but I have something bigger in mind. I think to myself if I can get my rook on e5 then just maybe the support of Qg3 combined with either H4-h5 or Rh5 is looking pretty good for white. ",
        "26. Re4e5": "This all but forces black to make a further concession in front of his king because he does not have a knight on f6 anymore thanks to 22. Ne4",
        "26... g6 27. Qg3": "now the threat is h4-h5. 27... Qxd4 28. Bxg6 Kh8 29. h5 Rg8 30. Qf3 is clearly in white's favor",
        "27... Kh7": "The best move but forced even though I am sure Stalhandske feels uncomfortable sitting on the same diagonal as white's LSB.  ",
        "28. Re1e3": "The immediate 28. h5 is parried with 28. ...Bf5! It is here that white's long term planning is beginning to take shape. White can continue to nurse his advantages at his own pace while black is reduced to passive waiting. ",
        "28... Kh8": "?? This is the losing blunder, either Stalhandske did not understand why he had to play 27. Kh7(perhaps just seeing the immediate need to protect g6) in the first place or he just cracked under the mounting pressure. Now black can not stop the break through. Best was 28. ...Bf5 which is made possible because of the king on h7 which leads to a slight advantage for white.",
        "29. h5": "There is no greater thrill in chess than to see the successful execution of your plans. This was the form that my mysterious imagine had conjured up all the way back on move 11. In that time there has been a lot that has transpired. But like all great attacks it takes two. I could not have realized my dreams without the help and support of Stalhandske. ",
        "29... g5": "The seas have parted and the way is now clear. ",
        "30. Qf3": "planning 31. Qf6 winning a pawn.",
        "30... Kg7": "forced to prevent Qf6",
        "31. Qe4": "Now Qh7+ winning a pawn is threatened",
        "31... f5": "forced",
        "32. Qf3": "winning the f-pawn",
        "32... Bd5": "Only good move",
        "33. Qe2": "Black is pretty much bound and gaged. As the old saying says  \"If you want to rob a man blind in his own house you first must bind the man!\"",
        "33... Rxe5 34. Rxe5 Qd6": "forced or Rd7+ is in the cards",
        "35. Rxf5 a5": "Black can only passively wait on white to move. ",
        "36. Re5": "renewing Rd7+",
        "36... a4": "Now this is interesting! Black has managed to create a threat. The idea is that if 36. b3 axb3 37. axb3 Ra8 or Rf8!? is given black a chance to make things interesting. But I doubt that is enough to hold to the end. If anything it does create complications",
        "37. Qd3": "Dealing with the threat by threatening something more urgent I. e Qh7+",
        "37... Bg8": "preventing Qh7+ ",
        "38. a3": "This stops all of black's hopes on the queen side. This is what black should have done on move 25. ",
        "38... Qf6": "!! very good move that is very cunning. I can not remember the exact line but I did see a possibility of a queen exchange on f4 that lead to a draw. So avoided it. ",
        "39. Qe4 Rd6 40. g3": "rules out any queen exchanges on f4",
        "40... Rd7": "now black is dead in the water all he can really do is move his rook back and forth while white continues to push forward. ",
        "41. Bb1": "Kh2 and f3 lead to the same drawing lines. ",
        "41... Rd8 42. f3": "Now 42. f3 followed by Kf1 going to e3 prevents black from exchanging queens. On e3 the king will defend d4 and after f3-f4 white will end up with two past pawns for the win. Stalhandske resigns. In conclusion, Stalhandske did prove that Alekine defense is still alive and doing well. However, the true test of the Alekine test does not lay in the opening but in the ending. It has to be said that white does have most of the chances to win coming out of the opening. yet, despite this advantage I am quite confident that I could have easily defended this game to a draw after 28. ...Bf5! In short, this is a great defense for amateur players because of it's great defensive resources. Because of the rating difference it was up to me to prove that my positional skills were better than Stalhandske's. Had Stalhanske found and played 28. ...Bf5 then he would have achieved a great victory by achieving a draw over a player most likely 400 points north of his own. "
    },
    "url": "https://gameknot.com/annotation.pl/resurrecting-the-alekines-defense?gm=47787",
    "gameName": "Resurrecting the Alekine's Defense",
    "players": "elyhim (2302) vs. stalhandske (2090)",
    "opening": "Alekhine's defence (B04), modern, Larsen variation"
}