{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Nc3 Bb4 4. d4 exd4 5. Nxd4 d6": "Three Knights (C46), Schlechter variation.  However, Black makes d6 instead of the typical Nf6 progression.  This isn't a bad move, per se, however the knight move does give Black option to castle and a solid defense.  ",
        "6. Nxc6": "White decides to trade and creates the stacked pawns for Black.",
        "6... bxc6 7. Qd4": "This is a solid move for White as it threatens the g7 pawn and the BSB. ",
        "7... Bxc3+ 8. Qxc3 Nf6": "At this point, Black is going to lose one of his hanging pawn.  He decides to save the g pawn and keep open the option to castle behind a solid pawn structure.",
        "9. Qxc6+ Bd7": "Required to save the Rook.",
        "10. Qc4 O-O 11. Bd3": "Allows White to castle.",
        "11... Be6 12. Qc3 Ng4 13. Be3": "It is unclear what White was attempting to accomplish with this move.  Black is better with the exchange (it is better for Black that white does not have both bishops in the end game and it doubles his pawns on e. ",
        "13... Nxe3": "Black happily exchanges.",
        "14. fxe3 Bg4 15. Qd2 Qf6": "White has not prevent Black from castling for the time being.",
        "16. c3 Rfe8 17. Qf2": "This might not be White's strongest move.  By offering the queen trade, White will forgo any possibility of castling to a strong position and he ties his WSB to the e4 pawn defense.",
        "17... Qxf2+ 18. Kxf2 Rab8 19. b3 Bh5 20. Rhf1 Bg6": "Building the attack on the e4 pawn.",
        "21. Rad1 Bxe4 22. Bxe4 Rxe4 23. Rd4": "Black does not wish to accept the trade as White will be able to take with the e pawn and build a strong queen side formation for the end game.  It is better for Black to leave this pawn floating in the middle of the board.",
        "23... Re5 24. Re1 Rbb5 25. Rc4 Rbc5 26. Rxc5 Rxc5 27. c4 g6 28. e4 Kg7 29. Rd1 Kf6 30. Rd5": "Black has his King in a much better position to achieve the opposition and attack the White pawns.  He also has the advantage of three pawns to two on the king side so trading the rooks is not so bad in this situation.",
        "30... Rxd5 31. exd5 Kf5 32. Ke3": "At this point we ran into time trouble and were not able to keep proper notation.  The next phase of the game consisted of pawn pushes that left ended up with White promoting on b8 at the same time that black promoted on g1 with a white pawns remaining on h4 and d5 and black pawns on d6 and h5.  Black was in better position with his queen so he forced a queen trade then captured the white pawn on h4 and was able to promote his h5 pawn and then ended with a White resignation.  This was a difficult endgame position."
    },
    "url": "https://gameknot.com/annotation.pl/reverse-angle-9-round-3?gm=17999",
    "gameName": "Reverse Angle 9  - Round 3",
    "players": "Suthaharan, Praveen (1143) vs. Carerros, Charles (1168)",
    "opening": "Three knights (C46), Schlechter variation"
}