{
    "moves": {
        "1. c4": "English Opening",
        "1... e5": "Reversed Sicilian",
        "2. e3 Nf6": "Developing toward the center.",
        "3. a3": "Preparing b4, and a possible queenside attack.",
        "3... d5": "Occupying the center, and releasing the path for my light squared bishop. Now all of my pieces can develop with relative ease.",
        "4. cxd5 Nxd5": "My knight is in a good square. My opponent should probably try to get it out of there.",
        "5. b4": "He doesn't. He prepares Bb2, and grabs some queenside space. However, I can get some initiative due to his lack of development.",
        "5... Bf5": "Developing my piece towards the center, and trying to prevent e4.",
        "6. Bb2": "He develops his bishop to control the very long diagonal. This bishop can become very powerful if I am not careful.",
        "6... Bd6": "Defending the pawn and developing another piece.",
        "7. d4": "Challenging my e5 pawn.",
        "7... exd4": "Challenge accepted.",
        "8. Bxd4": "Perhaps he should have taken with the queen. So that he didn't fall behind so much in development and gained some attacking chances.",
        "8... O-O": "My king is safe for now, and his king is still in the center. Most of my minor pieces have been developed, and he has only one minor piece developed. I should probably begin to push.",
        "9. Nd2": "Perhaps he should have developed his bishop to c4, attacking my d5 knight, and forcing me to defend or move it, and getting a step closer to castling kingside. Another consideration should be his knight to f3, which would have gotten him closer to castling kingside and would have helped control the e5 and d4 central squares. What Nd2 does though, is threaten a fork with e4! If I don't play judiciously, I could get behind in material.",
        "9... Re8": "Taking control of the semi-open file with my rook. Prevents the e4 fork, pins the e3 pawn to the king, and prepares a nasty tactic which could have been the clincher.",
        "10. g3": "Another pawn move. Let's count his pawn moves. c4, one, e3, two, a3, three, b4, four, d4, five, g3, six. Six pawn moves. Six pawn moves in the first ten moves. As a general rule, you shouldn't play more than two or three pawn moves in the opening phase of the game, especially if the center is not closed, or fixed, and especially if you're behind in development. There are exceptions to the rule, of course, but in this case he should have kept developing instead of moving his pawns.\n\nI have developed all but one of my minor pieces, my king is safely castled, my rook, my bishops, and my knight control the center. My opponent hasn't castled, hasn't developed his kingside at all, and has minimal control of the center. How do you think I should proceed?",
        "10... Bxb4": "This is the beginning of a combination I had prepared. If he doesn't take my bishop, my queenside pawn majority, and my lead in development should prove to be a winning advantage.",
        "11. axb4": "So he takes, allowing a nasty tactic to take place.",
        "11... Nxb4": "This is a lethal double threat. I am threatening to take his d4 bishop with my queen, since it's pinned due to his king being on the same semi-open file as my rook. I am also threatening to fork his king and his rook by way of Nc2+. Besides winning the exchange, this second threat also takes away white's ability to castle, which would be devastating since his king would remain in the center with little chances of surviving without heavy loss of material.",
        "12. Rc1": "He decides to defend his castling ability and lose a piece, or perhaps he just didn't see that I could take his bishop with my queen.",
        "12... Qxd4": "The end of my combination. I am up two points, and his king is still in the center. I'd say this is completely winning.",
        "13. Bg2": "Finally develops another minor piece. Threatens to win b2 pawn, and consequently my rook, or trade his bishop for a rook and a pawn, if I don't proceed accurately. Fianchettoed bishops like this can be very powerful, since they control the longest diagonal on the board, however, in this game, it is too late, since he is down two pawns, he is behind in development, and his king is still in the center, by move 13!",
        "13... Nb8c6": "Defends the Bxb2 threat, and develops another piece towards the center.",
        "14. Ne2": "This might have been a mistake, he does develop a piece, and he will gain a tempo since he is attacking my queen, but this falls prey to another tactic that I had devised.",
        "14... Nd3+": "First, I take away his castling ability and fork his king and his rook. ",
        "15. Kf1": "It's his only move.",
        "15... Qf6": "Moving my queen to a safe square so my knight can actually threaten the rook and to continue with the tactic I had prepared.",
        "16. Rc3 Nxf2": "The decisive shot. Forking his queen and rook. He can't take with his king because of Bc2+ winning his queen.",
        "17. Qe1": "He notices that he can't capture the knight with his king so he at least preserves his queen, and threatens to capture the knight if I don't move it.",
        "17... Nxh1": "Fortunately, I can move it, and win the exchange at the same time. I am now up by five points.",
        "18. Bxh1 Bd3+": "More tactics ensue.",
        "19. Kg1 Rxe3": "Threatening to capture his knight with my rook and also threatening to capture his rook on c3 with my queen, since after 20...Qxc3 21. Nxc3 Rxe1+, I'd be adding five more points to my material advantage.",
        "20. Rxd3": "He gives up the other exchange.",
        "20... Rxd3": "My material advantage is more than enough.",
        "21. Nf4 Qd4+": "And after this move, he surrendered. His d2 knight was my next victim and he'd be down 11 points after that."
    },
    "url": "https://gameknot.com/annotation.pl/reversed-sicilian?gm=50345",
    "gameName": "Reversed Sicilian",
    "players": "sak1b (1694) vs. rickypr18 (1761)",
    "opening": "English opening (A20)"
}