{
    "moves": {
        "1. Nc3": "This was Steve's great come-back match - his first in the evening leagues for about 3 years - against his old club! Steve's comments are in inverted commas. The Dunst Opening is a chess opening where White opens with the move: 1. Nc3. \nThis fairly uncommon opening may have more names than any other: it is also called the Heinrichsen Opening, Baltic Opening, van Geet's Opening, Sleipnir Opening, Kotrč's Opening, Meštrović Opening, Romanian Opening, Queen's Knight Attack, Queen's Knight Opening, Millard's Opening, Knight on the Left, and (in German) der Linksspringer.",
        "1... d5": "\"I spent four minutes on my reply to move 1 as I had prepared this line played in the game roughly to move 8 or so against John years ago and was trying to remember it!\"",
        "2. e4": "This is the same position as 1.e4 d5 2.Nc3, an obscure branch of the Scandinavian Defense. ",
        "2... d4": "The move 2...d4 gives Black a spatial advantage, which White may work to undermine along the lines of hypermodernism. Keilhack writes, \"2...d4 is chosen either by somewhat naive players who are attracted by the fact that Black wins time and space ... or by strong players who are aware of the strategic risks but are striving for a complex battle.\" (Keilhack 2005:44)",
        "3. Nce2": "He considers the Van Geet Attack, 2...d4 3.Nce2 followed by Ng3, to be \"the core of the 1.Nc3 opening,\".",
        "3... Bg4": "But black stops that for the time being.",
        "4. d3": "Preventing black from playing d4-d3",
        "4... Nf6": "Black simply develops.",
        "5. h3": "White attacks the bishop.",
        "5... Bh5": "So bishop retreats.",
        "6. Bg5": "White develops a bishop.",
        "6... h6": "Black puts the question to the bishop.",
        "7. Bd2": "And the bishop runs back - I think I would have exchanged rather than lose the tempo.",
        "7... e5": "Black takes the centre. I prefer black already.",
        "8. c3": "White tries to undermine the black centre.",
        "8... c5": "So white re-enforces it.",
        "9. Qb3": "White attacks b7.",
        "9... Qb6": "Black protects.",
        "10. Ng3": "White attacks the bishop.",
        "10... Bg6": "So it drops back.",
        "11. Nf3": "The other knight comes out.",
        "11... Nbd7": "And black develops his.",
        "12. Be2": "And white's last minor piece comes out.",
        "12... Qxb3": "Queens come off.",
        "13. axb3": "White takes back.",
        "13... Bd6": "Black develops his Bf8.",
        "14. Nh4": "Attacking the bishop.",
        "14... O-O": "Black castles.",
        "15. Nhf5": "Instead of exchanging the white knight takes up a commanding position, attacking, amongst other things, the bishop on d6.",
        "15... Bc7": "So the bishop drops back.",
        "16. O-O": "White finally castles.",
        "16... Rfe8": "The rook is moved to the logical square.",
        "17. Rfc1": "Presumably planning on breaking open the c file.",
        "17... Kh7": "Perhaps played to one day advance the king via g6?",
        "18. c4": "Steve says \"John could and probably should have won a pawn by playing cxd exd and then Nxd as I cannot recapture due to losing my bishop but I do have the John could and probably should have won a pawn by playing cxd exd and then Nxd as I cannot recapture due to losing my bishop but I do have the intermezzo BxNg3. This is not John's style....it's mine!!! so he bottled out and went solid without much play.. This is not John's style....it's mine!!! so he bottled out and went solid without much play.\" To me the intermezzo BxNg3 seems to win a piece for the pawn and refutes 19. Nxd4. However is does seem strange to block the c file immediately after moving the rook to the c file.",
        "18... a5": "Fritz likes this move and now gives black a slight edge.",
        "19. Ra2": "White doubles on the a file, but a5 is easily protected.",
        "19... h5": "Black is gaining space on the king side as well as the queen side.",
        "20. h4": "White blocks that.",
        "20... Re6": "Preparing for action on either side of the board.",
        "21. Rca1": "Carrying on with his plan.",
        "21... b6": "But it is easily met.",
        "22. Rf1": "White appears to be just shuffling his rooks around without any strategic plan.",
        "22... Nb8": "Presumably with the plan of Nb8-c6-b4.",
        "23. f4": "White at last does the pawn break.",
        "23... Nc6": "Black completes the re-positioning of his knight.",
        "24. fxe5": "White takes.",
        "24... Bxe5": "Black takes back.",
        "25. Bf4": "This seems like a strategic error by white to exchange off his good bishop in exchange of black's bad bishop.",
        "25... Bxf4": "So black takes.",
        "26. Rxf4": "White takes back.",
        "26... Rae8": "Steve says \"I was happy now as I felt that I have all the chances to win as long as I am careful\".",
        "27. Ra1": "This rook starts returning to a more useful square.",
        "27... Bxf5": "Another exchange.",
        "28. Rxf5": "Steve says \"Maybe Knight is a fair bit stronger...not pawn takes though due to potential tactical shots!\" Pawn takes of course loses white two minor pieces for a rook. It doesn't make much difference whether white recpatures with rook or knight as black is playing g6 next move whatever, driving the piece back.",
        "28... g6": "Like this.",
        "29. Rf4": "And the rook drops back.",
        "29... Kg7": "King repositions to counter any threats white may develop along the semi open f file.",
        "30. Raf1": "The other rook comes across.",
        "30... Ne5": "Steve says \"Much better than Nb4 I thought.\" yes it is, the knight takes up a dominating post in the centre of the board.",
        "31. Rd1": "\"Draw offered by John....no thanks we need to get the win to help the team!\" Steve was quite right to turn down the draw. In a four board match we went two down, but managed to draw it with wins on this and the other top board. But even without that to consider, Fritz gives this position as about plus 1 for black. Clearly white's bishop is virtually useless, hemmed in by its own pawns, unable to defend on dark squares. In these blocked positions knights are far better than bishops.",
        "31... Re8e7": "\"Now John can't break through at all easily as f7 is protected.\"",
        "32. Kh1": "\"....shuffling about...\"",
        "32... Nfg4": "\"The winning try now I have all the squares!\" Fritz agrees that this is the best move.",
        "33. Bxg4": "White takes.",
        "33... Nxg4": "Black takes back, threatening to go to e3.",
        "34. Nf1": "So the white knight has to drop back to stop this.",
        "34... Rf6": "\".....threatening Nf2 if he doesn't exchange......\"",
        "35. g3": "\"Ooops!\"",
        "35... Nf2+": "Black corrrectly takes the chance to win the exchange.",
        "36. Rxf2": "White has to take otherwise Rd1 goes.",
        "36... Rxf2": "Black takes back. \"....and now the fat lady starts to warble.......\"",
        "37. b4": "A hopeless gesture.",
        "37... axb4": "Black simply takes.",
        "38. b3": "Black saves the b pawn, at least for the time being, but the position is resignable - white is exchange and pawn down and black dominates the second rank, all white's pieces are passive.",
        "38... Ra7": "Once the other rooks enters it is curtains.",
        "39. Kg1": "White attacks the rook.",
        "39... Rb2": "Rook attacks b3.",
        "40. Nd2": "White protects.",
        "40... Raa2": "But now white can't avoid the loss of at least another pawn, and so gives up. In my view a most impressive come-back game! Thank you for reading, please rate the annotation on the star system, and leave a comment or two to let me know how I am getting on. Until next time dear reader!"
    },
    "url": "https://gameknot.com/annotation.pl/rhyl-prestatyn-2-v-malpas-oswestry-2?gm=63743",
    "gameName": "Rhyl & Prestatyn 2 V Malpas & Oswestry 2",
    "players": "John Simmons (ECF111) vs. Steve Rush  (ECF143)",
    "opening": "Dunst (Sleipner, Heinrichsen) opening (A00)"
}