{
    "moves": {
        "1. d4 d5 2. c4 e6 3. Nc3 Nf6 4. Bg5 Be7 5. e3": "So it starts off as a very standard Queen's Gambit Declined. https://en.wikipedia.org/wiki/Queen%27s_Gambit_Declined",
        "5... O-O": "Castling is pretty standard here.",
        "6. Qc2": "Played with a view of meeting h6 with h4!?",
        "6... Nc6": "This is unusual. The Nb8 normally goes to d7 in this sort of variation.",
        "7. a3": "Played to stop the knight coming in to b4.",
        "7... a6": "I am not quite sure why he played this. There is only one game in the Gameknot opening databases with this position, donmartigre (1786) vs. rkarka (1904)\t\tTime control: 2 days per move\nStarted: 24-Dec-10, Ended: 15-Jan-11 which continued 8. Bd3 dxc4 9. Bxc4 and white eventually winning in 33. I think the move I played is an improvement.",
        "8. Nf3": "Because now if he takes on c4 I take back with my bishop and I haven't lost a tempo with my bishop. So we are already out of the opening database - or at least the ones I have access to.",
        "8... h6": "The computer likes this move.",
        "9. h4": "The computer prefers Bf4. The idea is of course, if he takes the bishop he has to be very careful where he moves the knight, after I recapture his pawn. After 9......hxg5 10. hxg5 he really has to move his knight to e4 otherwise I play Qh7 mate. I can then capture twice on e4 and I have two pawns for the piece and a raging attack.",
        "9... Nh7": "Computer prefers Na5. This move is a little passive, and his knight is de-centralised. ",
        "10. Bf4": "Computer prefers the exchange on e7, but I wanted to keep pieces on.",
        "10... f5": "This seems a very logical way to slow down, if not stop the white attack altogether. We both miss a little trick here. Computer prefers bringing the knight back to f6.",
        "11. O-O-O": "I play aggressively, but I missed a little tactic. I could have taken twice on d5, and after 11. cxd5 exd5 12. Nxd5, if he takes back with the queen I have Bc4 winning the queen.",
        "11... Nf6": "Now the knight comes back and it is no longer possible. Computer agrees this is the best move.",
        "12. Ne5": "Computer likes this move too, trying to build up an attacking position.",
        "12... Nxe5": "He takes, and again, the computer gives this as a mistake. There are once again tactics which we both miss.",
        "13. Bxe5": "It seems natural to recapture this way, and to keep my pawns in a good formation. However, the computer points out that taking on e5 with the pawn wins the d pawn, for instance 13. dxe5 Ne4 14. Nxe4 fxe4 15. cxd5 exd5 16. Rxd5! and if the queen takes the rook on d5 17. Bc4 wins the queen again.",
        "13... c6": "But now he puts a stop to anything like that! Computer prefers b5, sacrificing a pawn to open lines for black's pieces.",
        "14. Be2": "So I continue my development.",
        "14... Bd6": "He exchanges an attacking piece.",
        "15. Bxd6": "So I take.",
        "15... Qxd6": "He takes back.",
        "16. Rdg1": "With the idea of trying to blast open lines on the king-side",
        "16... h5": "He tries to stop g2-g4",
        "17. f3": "So I threaten it again.",
        "17... Qg3": "Black takes rather desperate measures to prevent g2-g4.",
        "18. Bd3": "I stop his queen from coming in to f2 and also plan Ne2 or Rh1-h3, driving his queen out. ",
        "18... b5": "He finally does something on the queen-side.",
        "19. cxd5": "So I take.",
        "19... cxd5": "He takes back",
        "20. Ne2": "I boot his queen out.",
        "20... Qd6": "Queen drops back.",
        "21. e4": "Now a central pawn thrust, threatening e4-e5",
        "21... dxe4": "He takes",
        "22. fxe4": "I take back.",
        "22... Ng4": "Computer prefers exchanges on e4 and advantage to black.",
        "23. e5": "Computer likes this advance, but still thinks black is better.",
        "23... Qd7": "It prefers Qb6.",
        "24. Qd2": "My queen is eyeing the weak black squares in the black king side, as well as maybe the ones on the queen side too! Computer likes this move, but still advantage to black.",
        "24... Qe7": "He stops my queen coming in, although computer prefers Bb7.",
        "25. Nf4": "I like this move, putting pressure on h5 and e6, although the computer prefers Bc2, presumably with the idea of going to b3 with pressure on e6. Computer still prefers black.",
        "25... Qf7": "He defends again. Computer prefers the counter-attack Rd8. I guess part of the attraction, both here and later, is that if white ever protects the d4 pawn by moving the bishop, then black has Ng4xe5, and the d4 pawn is pinned by the Rd8.",
        "26. Kb1": "I finally do another move the computer likes!",
        "26... Bb7": "This can't be a bad move, putting the bishop on a wonderful long diagonal. Computer likes Rd8 still instead.",
        "27. Rgc1": "This was part of my plan. Computer likes this move too.",
        "27... Rac8": "The natural reply. Computer is still keen on Rf-d8.",
        "28. Rxc8": "I take. Computer likes this too.",
        "28... Rxc8": "This must be the right way to take back.",
        "29. Rc1": "This looks right too, contesting the c file. Computer assesses this as dead even.",
        "29... Rxc1+": "Computer still likes Rd8.",
        "30. Qxc1": "Now white's control of the c file gives him a small edge.",
        "30... Nf2": "He hits my Bd3, although computer prefers Kh7.",
        "31. Bc2": "I am heading for b3. Computer prefers Be2, but I am not sure it makes much difference. His queen still can't come over to the c file because of the pressure of my Nf4 on h5.",
        "31... Kh7": "So he does now make his king a little safer. Computer likes that move.",
        "32. Bb3": "Computer likes this one too!",
        "32... Bd5": "This seems forced, but the computer points out an alternative. Black could have checked on e4 and then played Nf2-d3. Both lines are assessed as better for white.",
        "33. Bxd5": "Computer prefers the knight capture.",
        "33... exd5": "He takes back.",
        "34. Qc6": "Now my queen comes up to support my e pawn, and his pawns are vulnerable too. ",
        "34... Ne4": "The position is getting very hard for black.",
        "35. e6": "Instead of winning pawns, I decide to start pushing my e pawn.",
        "35... Qe7": "He tries to blockade it.",
        "36. Qd7": "I force my pawn through. I calculated that I would eventually get my king out of the checks which are about to come in.",
        "36... Qxh4": "So he takes the pawn.",
        "37. e7": "And I push again. This seems to be a mistake, computer recommends Nxd5 instead. Normally the advice in endings is \"Passed pawns must be pushed\", but this looks like an exception!",
        "37... Qe1+": "It seems natural to throw in the check, but computer says advantage for black after Qxf4 38. e8=Q Nf6 and black wins one of the white queens back.\n",
        "38. Ka2": "So My king starts to run.",
        "38... Nc3+": "He throws in another check.",
        "39. bxc3": "I naturally take.",
        "39... Qd2+": "Another check.",
        "40. Kb3": "Another run.",
        "40... Qd1+": "Check again!",
        "41. Kb4": "Running again!",
        "41... Qa4+": "Another check.",
        "42. Kc5": "Forced!",
        "42... Qxa3+": "Another check!",
        "43. Kb6": "And black decides to throw in the sponge. \nMany thanks for reading! Please rate my annotation on the star system and leave a comment or two. Until next time dear reader! All the very best for Christmas and the New Year!"
    },
    "url": "https://gameknot.com/annotation.pl/rhyl-prestatyn-1-v-malpas-whitchurch?gm=60393",
    "gameName": "Rhyl & Prestatyn 1 v Malpas & Whitchurch",
    "players": "Charles L Higgie (ECF177) vs. Gareth Ellis (ECF148)",
    "opening": "QGD (D53), 4.Bg5 Be7, 5.e3 O-O"
}