{
    "moves": {
        "1. d4 f5 2. Bf4 d5 3. Nf3 e6": "Black declared his intentions and his strategy. Now it's all about how to attack it. And, as usual, I'll got there by delaying my castling, so winning tempoes.",
        "4. Nbd2 Nf6 5. h3 Bd6 6. Ne5": "Black, of course, can still play successfully against this, but he has to be careful.",
        "6... Nc6 7. e3": "This prevens his N to go to h5 where needed. ",
        "7... O-O": "\"Secure your king!\" seems the lethany all players hear to. But not into the enemy's fire. ",
        "8. g4": "This is \"romantic\". No well informed player would go for such a \"naive\" attack, but it happens to work. I'm still counting on the \"surprise\" that represent for my opponents to open my castling side so carelessly. But black can't take advantage of this right now. Black still can defend, and even get an edge on my open king. But he has to know how. ",
        "8... fxg4": "...and it is not like this.",
        "9. hxg4 Bb4": "This is the second imprecise move black plays, and this time the cost is very high. ",
        "10. c3 Be7": "....so he just gave me an important tempo to play a move I'd have played anyway. The rest is almost pure technique. ",
        "11. Bd3": "Treatening h7 while improving my pieces and developing. ",
        "11... Nxe5": "Helping me to dislodge his Nf6. Ne4 loses a pawn and doesn't stop my lsb from pointing to h7. Dutch players: f5 should not take on g4, or the white diagonal would be hard to defend).",
        "12. dxe5": "Third surprise for him?",
        "12... Ne4": "This is the only moment my attack can be slowed down to an endgame with a pawn and the edge for me. Let's see if black takes advantage of it. ",
        "13. Nxe4 dxe4 14. Bxe4 g6": "Fourth mistake, weakening the pawn's structure. QxQ+, RxQ was needed. ",
        "15. Qc2": "...with a classic and thematic threat to sac the B on g6 with soon-to-follow mate. ",
        "15... Bg5": "Logical attempt to bring the Q to g5, which I won't allow. Rd1 comes to mind, but after Qe7 his Q is just a step forward defending his King, so I won't go for it. ",
        "16. Bxg6": "A free pawn, since if he takes, Qg6#.",
        "16... h6": "Now comes the interesting part. I can be alredy satisfied with my game, but I \"need\" to finish my opponent, and this seems to stop me from further attack. I though a lot here, I sensed I had all the conditions set for the killing, but... how? My own lsb is on the way, but Bh7+ Kh8 just allows him to play Rf7, Qe7 and so on. If 17. Bh7+, Kg8, 18. Qg6, Rg8 (losing an exchange), or Qe8 slow me down. On the other side, 17. BxB QxB was losing all my edge for the next moves. Allowing him to play BxB, exB, Rxf4 is no plan. So...",
        "17. Rxh6": "If he takes my R, BxB and I'll recover the exchange for sure, as a minimum. But the threats are much worse; now I can play Bh5, threatening the unstoppbable Qg6+, and I also have Ke2, allowing the Ra1 to join the attack via h1. He thought a lot, too, and came with...",
        "17... Rxf4": "! Well done! Reacting with a countertactic! I am a move (Ke2) to play Rh8+, KxR, Ra1+, sealing the game in my favour. So... how to continue? If exR, BxR and I'm not sure I'll have the best of it. It seems almost a puzzle-like situation. Please point out what I'm missing...",
        "18. Rh7": "I though this was the killer move, and I liked it because of it apparently innocent appeareance. But now Bf7+ is threatened, following by Rh8+, winning a clean Q (after Rd1+). Black has no defence...",
        "18... Rf3 19. Bf7+ Rxf7": "Here it comes what I foresee...",
        "20. Qg6+ Kf8 21. Rh8+ Ke7 22. Qxg5+": "RxQ, KxR, Qg8+ was not as much as deadly. Thank you for reading!"
    },
    "url": "https://gameknot.com/annotation.pl/romantic-chess?gm=64079",
    "gameName": "Romantic chess",
    "players": "damafi (1545) vs. Gualberto_Zumbardo (1569)",
    "opening": "Dutch (A80)"
}