{
    "moves": {
        "1. d4": "Hi all, and here is a game which I believe demonstrates the awesome power of rooks on the 7th rank. This is from Round 3 of the Intermediate 51st GK Tournament, and I open with my usual queen pawn.",
        "1... d6": "!? Unusual move, but allows a direct transposition into the Pirc Defence, and possibly into a KID.",
        "2. e4 Nf6 3. Nc3": "Another option is 3.f3, soon transposing directly into the Samisch KID. Since I prefer the Averbakh Variation of the KID, this transposition is no good to me, so I resolve to swallow my irritation at not being allowed 3.c4 and develop my queenside knight, allowing a main line Pirc position to form.",
        "3... Nc6": "?! Unusual, as the knight can be kicked aroung with 4.d5.",
        "4. d5 Ne5 5. f4": "Gaining a powerful pawn centre, with tempo. No wonder GameKnot's DB shows excellent statistics for White.",
        "5... Ng6 6. Nf3 c6 7. dxc6 bxc6 8. f5": "Following the (very few) games in the GK DB that followed these lines.",
        "8... Ne5 9. Nxe5": "An opportunity to mess up Black's pawn structure seriously presents itself. The DB agrees.",
        "9... dxe5 10. Qxd8+ Kxd8 11. Bc4": "(!) Ruining Black's pawn structure. Since the queens are off, Black's central pawn troubles are particularly bad for him, as it is easier for me to turn this into an endgame.",
        "11... e6 12. fxe6 fxe6 13. O-O Bd6": "Not a good place for the bishop at all, seriously blocked in. What's wrong with 13...Bc5+, gaining a more active post with tempo?",
        "14. Be3 Bd7": "Now both Black's bishops are banging their heads against granite. And, it's time for me to put the pressure on down that lovely open d-file.",
        "15. Rad1": "There you go. White's pieces are textbook examples of active play. One rook on each open file, bishops have lovely diagonals to rake down. In contrast to Black's rooks, marooned on a8 and h8, and Black's bishop, biting on concrete. This, coupled with Black's awful pawn-structure, gives White a HUUUGGGEEE positional advantage - am I right?",
        "15... Bb4 16. Bxe6 Bxc3 17. bxc3 Nxe4": "This move gets a ? - it allows both my rooks to immediately dive into heaven on the 7th rank, hence the annotation title.",
        "18. Rxd7+ Ke8 19. Rff7": "Yes! POWER! Now my rooks and light-squared bishop dominate Black's position.",
        "19... Nf6 20. Rde7+ Kd8 21. Rfxg7": "I was hoping for the elegant(ish) 21...Nh5 22.Rxa7 Nxg7 23.Bb6+ Ke8 Rxa8#",
        "21... Re8 22. Rexa7 Rxa7 23. Bb6+": "Forced mate after 23...Rc7 24.Bxc7#. Readers, I hope you appreciate this example of the benefits of actively placed pieces, and of course the power of rooks on the 7th rank! Thanks for reading!"
    },
    "url": "https://gameknot.com/annotation.pl/rooks-on-the-7th?gm=23659",
    "gameName": "Rooks on the 7th!",
    "players": "fatcat2 (1453) vs. vancekalani (1363)",
    "opening": "Queen's Pawn (A41)"
}