{
    "moves": {
        "1. e4": "I play black on this one, and white seems to be pre-occupied by his passed pawn to notice my infiltration of his kingside.  Leaving him in too bad a shape after I end up with 2 passed pawns.",
        "1... c5": "my standard defense against e4",
        "2. d4 cxd4": "I figure why not, if she takes then I'll chase'er a bit!",
        "3. Qxd4 Nc6": "my N attacks with his swfit feet...",
        "4. Qd1": "she retreats...apparently had enough and didn't want to be chased any further.  I've already gained the initiative.",
        "4... Nf6 5. Nc3 e5 6. Nf3 a6 7. Bc4 b5 8. Bb3": "my p-a6 proved to be more useful than just blocking the N advancement.",
        "8... h6": "more blocking, and also my kings possible escape route after castling.",
        "9. O-O Bc5 10. h3 d5 11. exd5 Nd4 12. Nxd4 Bxd4": "after the sacrificed pawn I end with a nice powerful position in the middle.",
        "13. Re1": "??  why not bring out the bishop?",
        "13... O-O 14. Ne2 Bxf2+": "!  This move takes a pawn that would retreat my N, forces king exposure, and promotes my upcoming attack!",
        "15. Kxf2 Ne4+ 16. Kg1 Qf6": "getting her settled in...",
        "17. Rf1 Qg6": "now she's ready...",
        "18. Rf3 f5 19. d6+": "Now he's thinking that pawn my run for the endzone!  w/  ",
        "19... Kh8 20. Qe1 f4": "must move this pawn to keep his rook still, stop the bishop that he still hasn't moved, and make room for my rook to advance.",
        "21. c3 Rf5 22. Bc2": "he is sensing a problem",
        "22... Rh5": "Now we're cook'n up the plot!",
        "23. Bxe4 Qxe4": "He side lined me for a second with that take.",
        "24. Qf2 Qg6": "but I quickly get back to my post",
        "25. Qc5": "now he's concerned with that passed pawn again",
        "25... Bxh3": "ok, now the big bad white king is in trouble",
        "26. Qf2": "there's not a lot good that can come from this situation, especially with my pawn on f4 causing problems for any piece that could occupy the g3 square.",
        "26... Bxg2 27. Qxg2 Rg5": "as I said earlier, he's not wanting to drop a rook to a pawn...and he certainly doesn't want to lose his queen and have nothign to show for it.",
        "28. Ng3": "the obvious move",
        "28... Rg4": "I did this move to keep pressure on the same position, but more importantly to be able to pxg3 without having my rook take by his bishop on c1.  Which, I would guess, he was hoping that I overlooked.",
        "29. Qh3": "I'm assuming he did this to simply remove his queen from the G file held up by my rook. ",
        "29... Rxg3+ 30. Rxg3 fxg3 31. Bf4": "??  In my opinion this move was the only real blunder he made.  There could've been some better positional play, but this was a blunder.",
        "31... exf4 32. d7": "he continues with his pawn advancement, which isn't a bad idea in most cases.",
        "32... Rd8": "I block, not too concerned about the only open E file in which he'll move his rook soon....thanks to my Q also guarding the diagonal to e8 in case of an exchange.",
        "33. Re1": "he makes the move I assumed.  It was here that I noticed my plot to end the game with a nice rook sac",
        "33... f3 34. Kh1": "He obviously moved his king to keep from the f2 fork with a pawn and/or a variety of other problems if he just moved the rook and allowed me to check him with the pawns...",
        "34... f2 35. Rf1 Rxd7": "He leaps at the opportunity to take my rook!!",
        "36. Qxd7": "but....",
        "36... Qe4#": "He failed to see the mate on e4.  Pretty mate if you ask me, haven't seen one like this in a while. "
    },
    "url": "https://gameknot.com/annotation.pl/rook-sacked-for-sweet-mate?gm=21629",
    "gameName": "Rook Sacked for sweet Mate!",
    "players": "fuzi (1244) vs. cyko (1433)",
    "opening": "Sicilian (B21), Andreaschek gambit"
}