{
    "moves": {
        "1. e4 c5 2. d4 e6": "I thought my opponent will play cxd4, but ok...",
        "3. Bc4": "I continue with my development.",
        "3... Nc6 4. d5 Ne5 5. Bb3 b5": "Here my opponent is trying to close down on my bishop, I had two options in my mind, a3 or a4, I played...",
        "6. a3": "a3, because if 6. a4 bxa4 7. Bxa4, and my bishop is no longer on a2-g8 diagonal which I like so much.",
        "6... c4 7. Ba2 Qh4": "I didn't know what to think about this move. For me the queen come out to quickly, but if more support is added to her, it could mean trouble.",
        "8. Qe2": "Protecting my e and f pawn.",
        "8... Bd6": "Support is coming...",
        "9. Nc3": "Another piece to protect my weak e pawn.",
        "9... Nf6": "OK now I'm not that happy, g4 square is my weak point...so I think.",
        "10. Nf3": "Whit this move I was trying to drive away the Queen, and put some pressure on e5 Knight.",
        "10... Qg4": "And here I was starting to think about rook sacrifice. It was may turn to move, and if he goes for my rook, I could take my pieces closer to black King.",
        "11. Nxb5": "Well I decided to go for it, and lat see what my opponent will do...",
        "11... Qxg2": "There is no turning back now, the bait is taken...",
        "12. Nxd6+ Ke7 13. Nxe5": "I took two pieces for rook, and another trap is set. If my opponent decided not to take the rook, instead he will play Kxd6, then Nxf7+, and his rook is gone too.",
        "13... Qxh1+": "Well he take the rook.",
        "14. Kd2 Rf8": "And he saw the trap. Now is time to protect the Knight.",
        "15. Nexc4 Ba6": "Whit this move, I was scared for my e pawn...",
        "16. f3": "so I protect him, and h pawn too ;)",
        "16... Bxc4 17. Nxc4 exd5": "And here is a mistake I grab with both hands. If my opponent play exactly as I want, than is mate in no more than ten moves.",
        "18. exd5+ Kd8 19. d6": "! (I think this move deserves a !)",
        "19... Re8 20. Ne5 Rf8 21. Nxf7+": "If my opponent wont take my Knight, which is protected with my Bishop on a2-g8 diagonal, than is mate in 3 or 2 ;).",
        "21... Kc8": "Obviously the rook is too important for my opponent. Mate in 3 or 2 ;).",
        "22. Qc4+": "1.",
        "22... Kb7": "Ok it will be mate in 3.",
        "23. Qc7+": "2.",
        "23... Ka6 24. Bc4#": "3. Checkmate. I think it was a good game, I like to see some comments, if you like this game too, and to correct me if I made some mistakes in the game. Have a nice day."
    },
    "url": "https://gameknot.com/annotation.pl/rook-sacrifice?gm=32315",
    "gameName": "Rook sacrifice",
    "players": "stojanc (1445) vs. 0llyc (1390)",
    "opening": "Sicilian (B21), Smith-Morra gambit"
}