{
    "moves": {
        "1. d4": "I am Black. The person playing White was the highest rated person in this tournament. He ended up getting 1st, but I like this game because it reminds me I was the only person in the tournament who managed to beat him.",
        "1... c5": "The Benoni Defense. I immidiately challenge White's pawn.",
        "2. d5": "The strongest move. Moves like e3 and c3 are also okay, but they're passive and let Black get easy equality.\nA worse move option for White is dxc5, which gives Black a slight advantage, and then it's White who is fighting for equality.\nAlso, White can play Nf3, which goes into an entirely different opening, if he doesn't want to study the Benoni.",
        "2... e6": "I challenge White's pawn again. Forcing him to defend with e4 or c4. Other moves for White aren't good, because he moved his d-pawn twice, and must keep the pawn on d5 by defending with another pawn. Otherwise the tempi used advancing the d-pawn will be a waste.",
        "3. c4": "This move is the sharpest, leading to an unbalanced sharp tactical game, while defending with e4 is more dull and drawish. I usually play Nf6 before I play e6 because it avoids the boring line e4, but since I was playing a much better player, I wouldn't have minded if he'd played the drawish e4.",
        "3... exd5": "I open my e-file I can use after I castle.",
        "4. cxd5 d6": "This move stops White's pawn from advancing any further, although it isn't necessary right now, because if he advances I can play Qb6 and his pawn cannot be defended, because Bf4 leaves b2 hanging.",
        "5. Nc3 g6": "Fianchettoing this bishop in the Benoni Defense is very important because I need to add to my control of the central dark squares.",
        "6. e4 Bg7 7. Nf3 Nf6": "This is a very common position in this opening, although I thought Bg4 was better because it trades my passive bishop for White's centre-controlling knight.",
        "8. h3": "White stops Bg4, I should've played it the move earlier. ",
        "8... O-O 9. Bd3": "This bishop develops to d3 to defend the e-pawn.",
        "9... a6": "I am planning to play b5, giving me nice queenside control.",
        "10. a4": "This guy was much higher rated than I was, so he knew how to stop my plan.",
        "10... Re8": "Bd3 helped defend White's e-pawn.",
        "11. O-O Nbd7": "The only good move I saw.",
        "12. Re1": "White playing e5 later could be dangerous.",
        "12... Qe7": "I like my queen here because it defends my weak d-pawn, and there weren't very many other moves in this cramped position.",
        "13. Bf4 Qf8": "I was worried about White playing e5 while my queen was in line with his rook. If he plays e5 now, then I can play Nh5 attacking the bishop and discovering an attack on his e5-pawn.",
        "14. Qc1": "This move looked awkward to me. I thought a5 was better because it gains more space on the queenside.",
        "14... Nh5": "I want to trade because White's actively placed bishop is better than my knight controlling unimportant squares.",
        "15. Be3": "If Bh2, then I play Bh6 with tempo and can get a slight initiative after Nf4, blocking White's dark bishop while attacking his light bishop.\r\n\r\n",
        "15... h6": "I didn't want White to play g4 and g5 with tempo, so I stop g5. I also could've played f5, but I didn't feel comfortable going into a complicated position with such a good player.",
        "16. g4 Nhf6 17. Rb1": "White wants to play b4, disturbing my strong c-pawn.",
        "17... b6": "I make sure that my pawn has a suitable replacement.",
        "18. b4 h5": "I'm not worried about g5 anymore because now my knight has the h7 retreat square.",
        "19. g5 Nh7 20. h4": "A dubious move. The g-pawn doesn't really need a fourth defender.",
        "20... f6": "I was hoping White would take the pawn, because Qxf6 forks the knights.",
        "21. bxc5": "White is claiming the b-file, but I can always try to trade rooks, and I'll have a passed c-pawn after 21...bxc5.",
        "21... bxc5": "I thought the position was equal here, but White's next move however, definitely gives me the upper hand with a nice and clear advantage.",
        "22. e5": "White was probably happy here, because defending my g-pawn with queen allows e6-fork, and taking on e5 allows Bxg6 and Bxh5. So how did I ever win here?",
        "22... fxg5": "I can afford to ignore the threat on g6, because I will take advantage of White's exposed king.",
        "23. Bxg6": "White probably underestimated my intended kingside attack because of my rating.",
        "23... Qxf3 24. Bxe8 Nxe5": "Even though I'm losing material-wise (my rook for his bishop), White's king is exposed and I am threatening Bh3 then mate.",
        "25. Qd1": "White wants to trade queens, because then his king is in less danger, and he gets to keep his extra material.",
        "25... Qh3": "My new threat is Nf3 .",
        "26. f4": "White must free the f2 square to save his queen, otherwise Nf3  and White must give up his queen and lose. If White tries to stop Nf3 with Bxh5, then I can simply play g4, blocking the bishop.",
        "26... Nf3+ 27. Kf2 Qh2+": "If 26. Bxh5 g4 had been played in this position, then White would have to play Kf1, and I'd play g3 winning because I'm threatening Bh3  and g2 ",
        "28. Kxf3": "If Kf1 then Bh3#",
        "28... Bg4+": "White's attempt to save his queen has failed, so he resigned here. Plus e8 and c3 are hanging, and his king is even more exposed.\r\n"
    },
    "url": "https://gameknot.com/annotation.pl/round-5-of-burbank-championships?gm=1678",
    "gameName": "Round 5 of Burbank Championships",
    "players": "J. Stein (2088) vs. bakerbaker (1635)",
    "opening": "Old Benoni (A43), Franco-Benoni defence"
}