{
    "moves": {
        "1. d4": "Hi all! This is my second 90+45 tourney game. This time white engage a Stone Wall Defense or Berlin's Defense. I arrived very late to the match because previously I was on another chess tourney (from my University). My time was 45min left (from 90) when I sat down, so I played very fast to regain time (I almost didn't used my time, I tried to think all in my opponent's time, so I missed some good moves)",
        "1... f5": "I didn't know my opponent, not even his chess rating (ELO), so I tried to play something I knew, but already with f5 I was a little lost (I haven't studied this yet), so I applied chess principles and pawn structure for the opening. ",
        "2. c4": "2. c4 is one of the main line, the other one here is 2. g3 (which I didn't know)\n",
        "2... Nf6 3. g3": "Not knowing the defense, I spotted that the d5 makes very difficult for black to make e5, so probably black will play with d5, then playing a fianchetto with the white bishop is a very good idea for two reasons: use of the h1-a8 diagonal, and for king side castle secure.",
        "3... e6": "Incredibly e6 it's not the most played continuation, but g6 O.o (but it's the second main line, or the old one)\nGM Nakamura, Kamsky and other great GMs follow the line with g6.",
        "4. Bg2 d5": "Ok, Black could have played d5 or d6. Now he have played d5, it's a full Stone Wall defense, which I do know from before matches.",
        "5. b3": "Blunder! (I mixed lines). Now black could have played: 5. .. dxc4 and if 6. bxc4?? Bb4!+ 7. Nd2 Qxd4 with an early advantage for Black. (6. Nf3 cxb2 7. axb2 loosing a pawn in the very start of the game).\nThe main line was: 5. Nf3 dxc4 6. Nbd2 b5 7. a4 c6 8. axb5 cxb5 9. Nh4 Nd5 10. e4 fxe4 11. Qh5+ Kd7 12. Ng6 Qe8 13. Ne5+ Kd8 14. Qe2\n",
        "5... c6": "\"fewww\".. Black missed the good move dxc4 (That reminds me that we should always analyse the possible pawn captures!). Now that Blacks has missed the opportunity b3 is a good pawn!\n",
        "6. Nf3 Bd6 7. O-O O-O": "7. .. Qe7 is more played here (Black can queen-side castle), and Qe7 supports e6-e5",
        "8. Bb2": "8. Ba3 was another option here. I analyse both in the match, and yes, Black's black bishop is his best and very active bishop, so it's a good move to play Ba3 to exchange it, but I didn't do it because i'm used to play this kind of structure as white with Bb2, now it will follow several knights moves in order to stop e5 and put a knight over there.",
        "8... Nbd7 9. Nbd2 Qe7": "Now Black threats e5, white MUST react immediately!",
        "10. Ne5": "Thematic. White stop e5 with the support of d4 and Bb2.",
        "10... Ne4": "Black hurries to use e4 as white has used e5 square.",
        "11. Ndf3": "Do not take the Knight! Black wants to play an attack to the king side, and taking Nxe4 it allows Black to take with f-pawn, making an open file for his rooks. Now White's plan (my plan.. xD) is to play: Nd3, Nfe4, f3, Qc2, Rae1 and a possible e4!, as my chess teacher tough me.",
        "11... Rd8": "Why for? 11. ..Rd8 is a very uncommon move. D-file is closed, better is Ndf6 (which allows black to play Bd7, Be8, Kh8, g5, etc). Other plan could be a queen side attack/stop, playing a5. Finally Black can always play Nxe5 to try to simplify.",
        "12. Qc2": "The good spot for the queen. It allow c5 advance, it helps for a future engagement in e4 square, connect the rooks and now it's not in the \"line of fire\" of the Rd8.",
        "12... Rf8": "Really a waste of time for Black, now white is far ahead in develop.",
        "13. Rae1": "Nd3 was the other option, and it's the best one.",
        "13... a5": "Black stop the white queen side as it allowed him to start an attack over there.",
        "14. a4": "a4 was necessary if White wanted to continue with his plan. Other moves I could have done are Rc1 or Rd1, changing my plan to play in the c-file or the d-file (after opening the position)",
        "14... Kh8": "Black could really hurry his develop problems bringing out his Nd7 to f6 and trying to bring out his white bishop. It's very difficult to play such a closed position, but in this kind of position white shouldn't desperate, and always remember that he/she is better (in the position) and play with this little advantage trying to make more and more pressure until the advantage is enough to open the game and reach a winning final. ",
        "15. Nd3": "I continued with my plan.",
        "15... Ndf6 16. Nfe5 Bd7": "Finally Black has done something, now he is trying to play through Be8, and g5 advance. Also he has a3-f8 diagonal.",
        "17. f3": "f3, kiking out the Knight. Now White's advantage is big enough to open the game (note that all my pieces are playing, plus I have a Huge Knight on e5)",
        "17... Ng5 18. c5": "c5, just to avoid some counter play Black could have on that diagonal. ",
        "18... Bc7 19. Nf4": "I've noticed the g6 problem. Here black should play Kg8. The best move for white was Bc1, putting even more pressure.",
        "19... Be8": "Blunder!! Black wants to protect while he develops his bishop, but now black has problems with his knight! (where to retreat it?!) \nAlternative variation: 19... Kg8 20. e3\n",
        "20. h4": "h4! Now white advantage is clear.",
        "20... Bxe5": "Nge4 was a little better for Black, still White would have a good advantage.",
        "21. dxe5 Nd7 22. hxg5": ".",
        "22... Bf7 23. g6": "With the material advantage I should have open the game with e4! g6 it's a little blunder, but nothing to worry about. I was trying to open more that black king.",
        "23... hxg6 24. Kf2": "Kf2, in order to play Rh1",
        "24... Qxc5+": "Black is desperate to regain some material, but this is in fact a big blunder for Black. It shouldn't open the game in such a position (with a white bishop that doesn't play,  with double pawns, and a poor king location).",
        "25. Qxc5 Nxc5 26. Ba3": "Ba3! X-rays to the Rook",
        "26... b6 27. Nd3": "My second big blunder. In this point, I was a little hurry to end the game, so I changed my mind and stop looking to the best moves (Rh1+ was the best one here, ending in the same Nd3 but in a better position), so I calculated how to reach to an easy and wining end-game.\nAlternative variation: 27. Rh1+ Kg8 28. Rh2 Rfc8 29. Reh1 Kf8 30. Rh8+ Ke7 31. Rxc8 Rxc8 32. Nd3 (30... Bg8 31. Nxe6+ Kf7 32. Nxc5 bxc5 33. Rc1 Rab8 34. Rxc5 Rxb3 35. f4 (35. Bc1) 35... Rxa3 36. Bxd5+)\n",
        "27... Nxd3+ 28. exd3 c5 29. d4 Rfc8 30. dxc5 bxc5 31. Rec1 c4 32. bxc4": ".",
        "32... Rxc4 33. Rxc4 dxc4 34. Rc1 Rc8 35. Bf1 c3 36. Bb5": "From move 28 and until this move, all the moves where the best ones! (computer analysis). I played Bb5 to left Black with no play! Bd6 and Ke3 where slightly betters ",
        "36... g5 37. f4": "Blunder! Not necessary to play! Ke3 was better, or the tricky one Bb2!! ",
        "37... gxf4 38. gxf4 c2": "Another blunder. Black still thinks c-pawn can survive. He tries to play Bh5 and the Bd1 to save it, but the material advantage, the two bishop concept, and the king activity is to much to fight against.",
        "39. Bb2": "Bb2, not the best move, but I was happy not letting Black activates his Rook via c3, so I could bring my King happily through e3.",
        "39... Kg8 40. Ke3 Bh5": "Big and last blunder for Black, now his end hurries a lot more.",
        "41. Bd7": "Bd7! ",
        "41... Rb8 42. Bxe6+ Kf8": "Black should have cover himself with Bf7, but in this point it really doesn't matter.",
        "43. Ba3+ Ke8 44. Rxc2 Bd1 45. Rh2 Kd8 46. Rh8+ Kc7 47. Bd6+": "1-0"
    },
    "url": "https://gameknot.com/annotation.pl/round-4-table-4-inter-institutions-tourney-2013-chile?gm=50343",
    "gameName": "Round 4, Table 4. Inter-Institutions Tourney 2013, Chile",
    "players": "Apablaza De La Cuadra, Alexis  vs. Bernucci Calisto, Enzo (1695)",
    "opening": "Dutch defence (A90)"
}