{
    "moves": {
        "1. d4": "I prefer e4 since it develops faster and pieces have more mobility, but d4 is just as playable, even though it's slower and more cramped.",
        "1... c5": "I don't play this opening anymore, because it isn't sharp, and I think Nf6 is a more accurate move.",
        "2. Nf3": "A sharper move is d5. But Nf3 is solid and safer.",
        "2... Nf6": "The strongest developing move.",
        "3. Nc3": "White usually doesn't obstruct his c-pawn in this variation, but whatever. And he shouldn't take on c5 and try to hold the pawn, because I will eventually get it back with a better position.",
        "3... cxd4": "I force White to move a knight twice in the opening, because if he recaptures with his queen, then Nc6 gains a tempo.",
        "4. Nxd4 d5": "After 4...e5 5.Ndb5 d5, White wins a pawn after 6.Nxd5 Nxd5 7.Qxd5 Qxd5 8.Nc7  recovering the queen. So if I wanted to play e5, then I'd have to play d6 after Ndb5 since White's threatening Nd6 , and then e4 would transpose into the Sveshnikov Variation of the Sicilian, an opening I played for three years but now consider to be good for White.",
        "5. Bg5": "Isn't much of a threat, since taking my knight will only improve my position.",
        "5... Nc6": "I thought about e5, but I played this first because I wanted White to play f4 trying to stop e5, which would leave him with a backward e-pawn.",
        "6. e3": "White doesn't want to recapture his knight with his queen if I trade it.",
        "6... e5": "Tempo.",
        "7. Bxf6": "Not good, because like I said earlier, it will strengthen my position.",
        "7... gxf6": "Now White has strengthened my centre, given me an open g-file, and an extra open line for my bishop if I need it.",
        "8. Nxc6": "White is only strengthing my centre more.",
        "8... bxc6 9. a3": "White stops the unpleasant Bb4, while giving him the option of expanding with b4.",
        "9... f5": "I stop White from playing e4, because it disrupts my strong centre. And I also strengthen my centre slightly more.",
        "10. Qh5": "White places his queen on an advanced square where it cannot be chased away. But other than the pressure on my h-pawn, White's queen isn't a threat.",
        "10... Rb8": "I place my rook on an open file while attacking White's pawn.",
        "11. b4": "Rb1 is more passive, and Na4 allows Qa5 ",
        "11... Qf6": "Now there isn't any more pressure on my h-pawn, because if I move my defending rook, then Qxh7 would lose to Rh8.",
        "12. Rb1": "Maybe White should be developing, but there isn't much else he can do here. Because of my rock-hard centre, I plan to slowly grind White down.",
        "12... e4": "The central advance begins with tempo.",
        "13. Nd1": "Rb3 defends the knight, but I have tactical threats after Be6.",
        "13... a5": "Now that White's knight is no longer defending the rook, I can take advantage of the b-file pressure.",
        "14. c3 axb4 15. axb4 c5 16. b5 d4": "If I can succeed in opening up the centre, my newly centralized queen and dark bishop will tactically crush White.",
        "17. c4": "White doesn't let that happen.",
        "17... d3": "Now that my central advance is complete, I have ended up with a passed d-pawn.",
        "18. g3": "White wants to play Bh3, putting pressure on my backward f5 pawn.",
        "18... Be6": "Now I attack his pawn.",
        "19. Bh3 Rg8": "I prepare for an attack on the g-file if White castles kingside.\r\n.........Bxc4 looks like a good move since it severely weakens White's b-pawn, but after Bxf5, White has a lot of annoying threats, mostly his attack on my pawn chain.",
        "20. Kd2": "White knows that castling is dangerous, and obligates his king to stop my passed pawn.",
        "20... Ra8": "My rook will be very strong if it reaches a2.",
        "21. Nc3": "stops Ra2",
        "21... Ra3 22. Rhc1 Bg7": "I sneakily add pressure to White's knight.",
        "23. Qh4": "This was White's losing move that gives me a clear win. He was probably desperate to get queens off the board to stop my attack on his queenside, but this is totally winning for Black.",
        "23... Qxh4 24. gxh4 Bxc3+ 25. Rxc3 Ra2+ 26. Ke1": "White needs his king guarding f1 so that Bf1 will stop mate...........for now.",
        "26... Rg1+ 27. Bf1": "Now there are so many winning lines for Black, like d2  or f4-Bh3. I had calculated the d2  win when I played Qxh4, but didn't realize until now that I had a simple mate in 2.",
        "27... Re2+": "White resigned. My rooks are crushing."
    },
    "url": "https://gameknot.com/annotation.pl/round-3-of-san-diego-championships?gm=2815",
    "gameName": "Round 3 of San Diego Championships",
    "players": "Bad Player (1500) vs. bakerbaker (1650)",
    "opening": "Old Benoni defence (A43)"
}