{
    "moves": {
        "1. e4": "I played this game at the Norwalk Championships. It shows the dangers of castling on the wrong side of the board.",
        "1... Nf6": "The Alekhine Defense.\r\nBlack wants to lure my pawns to attack his knight, causing me to overextend my position.",
        "2. Nc3": "Most people play 2. e5 here, but I didn't study the Alekhine back then, so I preferred the safer Nc3 over the sharper e5. A lot of times playing Nc3 will transpose into other openings less familiar to an Alekhine player.",
        "2... d6": "2...d5 is a more common move. Black can also play 2...e5 transposing into a double king-pawn position.",
        "3. d4": "But Black's d6 move has simply transposed into the Pirc Defense.",
        "3... c6": "This variation of the Pirc is somewhat passive. Black's sharpest plan is to play Nbd7 and e5, then fianchetto the king's bishop, transposing into a King's Indian Defense-type formation, but where I don't have a pawn on c4.",
        "4. Bg5": "I usually develop my bishop to e3 in this opening, but I would have to play f3 first to avoid Ng4.",
        "4... Nbd7 5. f4": "I am equalizing the control of e5.",
        "5... h6": "I thought it was okay for Black to play e5 here, because after 6. fxe5 dxe5 7. dxe5 Nxe5 8. Qxd8 Kxd8 9. O-O-O  Kc7, Black's position is fine, and my isolated e-pawn may be a problem in the resulting endgame.",
        "6. Bxf6": "Bh4 still allows e5, and I did not want that. I want to play e5 before Black does.",
        "6... Nxf6": "Black lets me play e5, because gxf6 gives my queen the good h5 square where I can control the 5th rank along with my pawns. And exf6 brings the e-pawn to the f-file, where Black can no longer play e5, also f7 becomes vulnerable after Bc4.",
        "7. e5": "Although Black is no longer threatening e5, I must take dynamic action, because in the Pirc Defense, White needs to crush Black's passive position before Black finishes development and gets equality.",
        "7... dxe5 8. fxe5 Nd5": "Nd7 cramps Black's position.",
        "9. Bc4": "Not the best move, because usually you should only develop your bishop to c4 if Black's e-pawn is gone or has passed e6, because then you are pressuring f7.",
        "9... Be6": "I thought e6 was more solid, but Be6 is more agressive.",
        "10. Bxd5": "I don't like my misplaced bishop.",
        "10... Bxd5 11. Nf3": "After Bxf3 gxf3, both sides should castle queenside, resulting in an equal game where Black focuses on undermining my advanced central pawns, and I focus on attacking the newly opened g-file.",
        "11... e6": "Black missed his chance for equality, and gives me more chances to get an advantage.",
        "12. O-O": "I place my rook on the open f-file.",
        "12... Be7": "Black clears the way to castle kingside, which I believe is a mistake. I think Black's king is much safer on the queenside, because I don't have any open files there, and most of my pieces are active on the kingside.",
        "13. Qd3": "I am waiting for Black to castle, so now I am prepping my attack.",
        "13... O-O": "Watch how I exploit Black for wrongfully castling.",
        "14. Ne2": "I need all my forces on the kingside to launch my crushing attack.",
        "14... Bxf3": "Black should be defending his kingside instead of helping me get my rook to the third rank where it can easily go to g3 or h3 to attack.",
        "15. Rxf3 b6": "Maybe Black could've stopped my coming attack and gotten another chance for counterplay, but if Black keeps making pointless moves like this, I don't think so.",
        "16. Raf1": "I bring my other rook to the open f-file so that it can get to the third rank via f3 when I decide where to put my f3-rook.",
        "16... c5": "Black's cheap attempts for counterplay don't bother me because c3 solidifies my centre. Black's best chance of survival is to defend, but  it is still unlikely that Black can recover.",
        "17. c3": "I solidify my centre and Black has no counterplay to disturb my growing attack. Had Black castled correctly on the queenside, he may have had a chance to attack my kingside, where he has a majority of pawns.",
        "17... a5": "I didn't look for anything better for Black, but there may be moves which stall my attack.",
        "18. Nf4": "My plan is to play Nh5 Rg3 to pressure g7. And if Black tries to stop Nh5 with 18...g6, then I have 19. Nxg6 fxg6 20. Qxg6  Kh8 21. Qxh6  Kg8 22. Qg6  Kh8 23. Rh3  Bh4 24. Rf4 and Black can no longer block the mating path.",
        "18... Qc7": "I couldn't really see any moves for Black here. He is just sitting passively and waiting for me to finish my attack.",
        "19. Nh5 g6 20. Rg3": "I am threatening Rxg6  with mate in a few moves.",
        "20... g5": "I thought Kh7 was better, because my attack would take longer to carry out. ",
        "21. Nf6+ Bxf6": "Forced because of Qh7#",
        "22. Rxf6": "Black's overextended pawns will fall, leaving Black's kingside completely opened. In endings with only queens and rooks on the board, an exposed king will often be mated or devastatingly attacked.",
        "22... cxd4": "I'm not going to dignify that with a response.",
        "23. Rxh6": "Threatening Qh7# again.",
        "23... f6": "I thought Black should've moved his rook and escaped with his king awhile ago. But 23...f6 loses much faster.",
        "24. exf6": "I have a new mating threat of Qg6.",
        "24... Rf7": "If Kf7 then Qg6#",
        "25. Rxg5+": "Black should resign now, because if Kf8, then Rh8#",
        "25... Rg7": "Black is still trying to get out of mate, but he is going to lose a lot of material so he may as well just resign.",
        "26. Qh7+": "Rxg7 was another way to win, but I like exploiting pinned pieces and I thought this was a more fun way to win.",
        "26... Kf8": "Forced.",
        "27. fxg7+": "Totally crushing.",
        "27... Ke7": "Forced.",
        "28. g8=Q+": "Black finally resigned, because Kd6 Rxe6# is mate.\r\nHere I have double the amount of heavy pieces Black has! This shows the devastating dangers of castling on the wrong side of the board."
    },
    "url": "https://gameknot.com/annotation.pl/round-3-of-norwalk-championships?gm=1671",
    "gameName": "Round 3 of Norwalk Championships",
    "players": "bakerbaker (1545) vs. R. Luchetta (1484)",
    "opening": "Alekhine's defence (B02), Scandinavian variation"
}