{
    "moves": {
        "1. e4": "I am annotating this game for a few key learning elements.  Although I wound up winning the game both allanshessw and I made several mistakes that warrant further investigation.",
        "1... e5 2. Nf3 Nc6 3. Bb5": "Ruy Lopez (Spanish opening)",
        "3... a6 4. Ba4 b5 5. Bb3": "All fairly standard Ruy Lopez so far.  Black has several options here to move the game forward.  The most common play here is to bring the knight out at Nf6.",
        "5... d6": "Shoring up the e pawn and giving his bishop more options for development, a solid move.",
        "6. O-O": "Discretion being the better part of valor, I protect my king, to allow my rook to eventually get into the game on the e file.",
        "6... Be7": "This move is logical and will give Black's bishop some good options.  g6 as an alternative is not very sound in my opinion.  I would have played Nf6 in this position most likely, but no fault anywhere yet.",
        "7. d4": "In recent games I have taken to attacking the center early and often.  I like creating opportunities and you need to attack to do that.  This move allows my dark-squared bishop entrance into the game and also attacks the center. Moves that can accomplish more than one thing are always best.",
        "7... exd4": "An alternative could have seen Black take with the knight (Nxd4) instead of this move.  The logical conclusion to that series would be\n8.\tNxd4\texd4\n9.\tBd5\tRb8\n10.\tQxd4\t\n\nBy taking here, I now have an opportunity.  There is now no longer a pawn in front of his king.  My main goal now is to get my own e pawn out of the way so I can directly challenge his king.",
        "8. Bd5": "Now I move to bring my plan into effect.  Black has two potential responses here, and only one of them is worth considering.",
        "8... Bb7": "This move is basically forced.  Had black chosen Bd7, Nxd4 will cause some problems.",
        "9. Nxd4": "The natural follow through.  As I see it Black has a few options here.  He can take my knight (Nxd4), Move the queen up to d7 (my favorite) or what he wound up doing.",
        "9... Na5": "This move I think is a mistake.  It allows me to add some pressure onto him by my next move.  It does appear to be a good move on the surface and gave me some pause.  If I take his bishop on b7 with my own, he can retake with his knight, and while that puts his knight in a bad position, it doesn't give me a lot of attack options.  I still need to see if I can get him to take my bishop so I can move my e pawn and get my rook into the game.",
        "10. Bd2": "Putting pressure on his knight and continuing my development.  ",
        "10... Bxd5": "Success so far, let's see where this takes us.",
        "11. exd5": "Retaking is imperative here, but it also allows me to bring my rook into the game.  As his knight is still under attack, he has to either move it or defend it.    The best move from this position, I think, is the one he made.",
        "11... Nc4": "Not only does this give his knight a good-looking post, it also simultaneously attacks my bishop and b pawn.  ",
        "12. Bc3": "To defend the b pawn and move my bishop out of harm's way.  So far we are even on exchanges, but I have a significant attack angle on his king, almost no matter what he does.",
        "12... Bf6": "This move surprised me a little bit, as I anticipated him bringing his knight to the same square, to allow him to move closer to castling and safety for his king.  However, the post of his d pawn looks to be helpful.",
        "13. Re1+": "Building the pressure.",
        "13... Ne5": "Black's best move here is to move his king to f8.  It will complicate his position as he will have to find an alternative way to get his rook into the game, but this move opens him up to a nasty attack which I did not use because of tunnel vision.",
        "14. Nc6": "Time to wade in to dislodge the queen, give my knight a nice post, and also add additional pressure on the knight.",
        "14... Qd7 15. Nxe5": "This is a blunder on my part.  I had tunnel vision and didn't analyze as well as I should have.  I was thinking that he would try to castle kingside giving me significant advantage against his knight, which would come out to give his king.  The proper play here is to bring the f pawn into the fray with f4.\n\n\n15.\tf4\tNe7\n16.\tfxe5\tdxe5\n17.\tBxe5\tO-O\n18.\tBxf6\tNxc6\n19.\tdxc6\tQxd1\n20.\tRxd1\tgxf6\n21.\tRd7\tRac8\n22.\tNd2\tRfe8\n23.\tNf3\t",
        "15... dxe5 16. Bxe5 Bxe5": "The computer rates this move as an inaccuracy, saying it is better to castle queenside.  I don't know how I feel about a queenside castle here, as his pawn structure is wide open.",
        "17. Rxe5+ Ne7": "Giving a chance for a castle or other escape.",
        "18. Qe2": "Adding pressure to his knight.  If he castles then I get his knight for free.  Also, bringing the queen to the e2 square will allow me to bring my rook over for a triple battery if and when I can my knight into the game.",
        "18... f6": "This is a great response from Black and I congratulated him in game.  This move gives him the space to bring his king up to f7 and relieve the pressure on his knight.",
        "19. Re3": "I toyed around with the idea of Re6 for some time here, but ultimately decided against it.  I like the extra protection of the f pawn and once he brings his king up, it could complicate matters for me down the road with protection.  Better to avoid all of that and make a tactical retreat for the time being.",
        "19... Kf7": "Giving his knight a chance to get back into the game.",
        "20. c4": "This move lets me protect my d pawn a little longer, since it was unprotected at this point.  Bringing the knight out is no good, as b4 would dislodge it.",
        "20... bxc4": "This move allows me two options.  One is a retake with my queen or bringing my knight out first.",
        "21. Nc3": "This move finishes my piece development and allows me to get the rook into the game.  It also provides some extra protection to my d pawn, which is in danger.",
        "21... Rhd8": "I am uncertain if this is the best rook to bring into the battery role for the d half file, but will defer to allanchessw's analysis on the matter.",
        "22. Qxc4": "Regaining the 1 pawn advantage and threatening a discovered check on his king.",
        "22... Nxd5 23. Nxd5 Qxd5": "I have a few options here, but ultimately decided that a queen trade was not as advantageous as a pawn grab with check would be.",
        "24. Qxc7+ Rd7": "Natural response.",
        "25. Qc2": "I have two options and this one is the better of the two in my opinion.  I need to protect the d1 square since my king is subject to a back-rank mate if I do not.  Moving to the c2 square is preferred since it allows my rook on the a1 square to move more freely.",
        "25... Rad8": "I thought black might try Rc8, which would force me to move Qe2, however he went for the triple battery.",
        "26. h3": "Forced to allow my king an escape route.",
        "26... Qd2": "Offering a queen exchange.  I'm not ready for this route, especially since his h pawn is open.",
        "27. Qxh7 Qxb2": "The computer rates this as a blunder.  I have no real option but to move my a rook to e1, and that creates a powerful combination to assault black's king.",
        "28. Rae1 Qxa2": "Now I am at a crossroads.  Black's king is exposed and surrounded by powerful pieces.  My mating radar was going off big time and I knew there was a winning combination there.",
        "29. Re3e8": "This move is a blunder on my part.  I thought long and hard about it and thought I had every possible response mapped, but I didn't count on one.  Luckily Black did not see the ideal response either, as it would have negated my move.  I was actually really pumped about this sequence until I saw the computer analysis.  \n\nDiscounting Qd5, black is going down almost no matter what he plays here.  The question becomes what pieces does he want left at the end.\n\nThe ideal sequence is \n29.\tQh5+\t\tg6\n30.\tRe7+!!\tRxe7\n31.\tQh7+\t\tKf8\n32.\tQxe7+\tKg8\n33.\tQxd8+\tKg7\n34.\tRe7+\t\tQf7\n35.\tRxf7+\tKxf7\n36.\tQd7+\t\tKg8\n37.\tQe6+\t\tKg7\n38.\tQe7+\t\tKh6\n39.\tQxf6\t",
        "29... Rxe8": "Discounting the Qd5 ideal response, this is the only move on black's part that didn't end in either mate or serious loss of points/pieces.",
        "30. Qh5+ g6": "Any other move is mate.",
        "31. Qh7+ Kf8 32. Qh8+": "And now black has to decide, do I block with the queen and go down the path of \n32.\tQh8+\t\tQg8\n33.\tRxe8+\tKxe8\n34.\tQxg8+\tKe7\n35.\tQxg6\t\n\nor do I want to lose both of my rooks with \n32.\tQh8+\t\tKf7\n33.\tQxe8+\tKg7\n34.\tQxd7+\t\n\nHere black resigned.  I consider allanchessw a tremendous player and will look forward to future matches with him."
    },
    "url": "https://gameknot.com/annotation.pl/ruy-lopez-c70-graz-variation?gm=43219",
    "gameName": "Ruy Lopez (C70), Graz variation",
    "players": "evilgm (1750) vs. allanchessw (1733)",
    "opening": "Ruy Lopez (C70), Graz variation"
}