{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Bb5 a6 4. Bxc6": "The Exchange Variation, popularised by Bobby Fischer. White gives Black the two Bishops in exchange for a slightly better pawn formation. It might have been enough for Fischer; for mere mortals there's a whole middle game ahead...",
        "4... dxc6": "Better than 4...bxc6. Now if White captures the e-pawn Black has 5...Qd4, regaining the pawn with a slight advantage.",
        "5. d3": "Now White has supported his own e-pawn, Black's is genuinely threatened.",
        "5... Bd6": "Fischer actually recommended 5...f6, but I thought I'd try this instead, which is perfectly playable, as is 5...Qd6.",
        "6. h3": "A bit over cautious, I think. White wants to prevent the pin, but would be better completing his development.",
        "6... Ne7": "So I can go to g6, adding to the defence of my e-pawn.",
        "7. c4": "This rather creates a hole on d4. Perhaps the idea is to lure away the Bishop so the e-pawn can be taken?",
        "7... Ng6": "I continue with the planned support of the e-pawn.",
        "8. a3": "White has now made five pawn moves and he still hasn't castled or started to develop his Q-side. This should give me some advantage.",
        "8... O-O": "I've nearly finished developing while White is way behind.",
        "9. b4": "Still preoccupied with attacking the Bishop.",
        "9... c5": "I take the opportunity to try to undouble my pawns.",
        "10. bxc5": "White obliges...",
        "10... Bxc5 11. Bb2": "Not a bad idea, to seize the long diagonal and renew an attack on my e-pawn. But it allows me a neat tactic...",
        "11... f6": "Which I miss, as preoccupied with defending the pawn as White is in attacking it; 11...Nf4 attacks the g-pawn and the d-pawn and must win one of them.",
        "12. O-O Nf4": "Too late now White has castled!",
        "13. Ne1": "A bit of an ugly attempt to defend the d-pawn.",
        "13... Nxh3+": "I see a chance to blow open White's K-side pawns...",
        "14. gxh3 Bxh3": "For some reason, here I thought I'd trapped the Rook...",
        "15. Ng2": "Completely missing this defence.",
        "15... Qe8": "Panic rather sets in. I need to get my Queen involved, while I have the initiative, but I leave my Bishop undefended. 15...Qd7 would have been better.",
        "16. Qf3 Qd7": "Once again I'm a bit late with the right move.",
        "17. Kh2 Bg4 18. Qg3": "I'm still clinging to a fair position, but it could have been much better.",
        "18... Be2": "Still, I can get back on level material terms now...",
        "19. Re1 Qxd3 20. Qxd3": "White takes the sting out of my attack by exchanging.",
        "20... Bxd3 21. f3": "Then defends one loose pawn...",
        "21... Bxc4": "Leaving me to snaffle up the other.",
        "22. Rc1": "This is more dangerous than I'd thought. I can defend the Bishop...",
        "22... b5": "As I do.",
        "23. a4": "I expected this attack on the Bishop's supporting pawn. But White would have been better attacking the Bishop itself with 23.Nd2 and my advantage rather withers away after 23...Bb6 24.Nxc4 bxc4 25.Rxc4",
        "23... Bd4": "I thought White wouldn't want to allow me a passed pawn by exchanging his Bishop on the long diagonal.",
        "24. Bxd4": "But he does!",
        "24... exd4 25. Nd2": "Like me, White plays the right move a little late in the day.",
        "25... Be2": "Getting ready to advance my passed pawn.",
        "26. Nf4 d3": "Supporting my Bishop.",
        "27. Rce1": "White wants to win back his pawn, but this is not the best way to do it. He could simply take the pawn on c7 or play 27.Ne6 followed by 28.axb5 and 29.Rxa8 with probably a better game.",
        "27... c5": "White's last move allows me to get my c-pawn back into the game, so I will still have a dangerous passed pawn should White capture my Bishop and d-pawn.",
        "28. Nxe2 dxe2 29. Rxe2 c4": "This is probably even better for me than the position I had before, since my passed pawn is supported.",
        "30. axb5 axb5": "Now I have two passed pawns and feeling like the win is on the way.",
        "31. Rb1 Rab8": "I get behind one of my passed pawns, as the books tell you. But this rather loses the advantage after 32.Rb4. 31...Ra2, pinning the Knight, followed by 32...c3 would have been much better!",
        "32. Rb4": "As it is, my pawns are rather stopped in their tracks.",
        "32... Rfc8": "I get behind the c-pawn, since the b-pawn clearly isn't going anywhere.",
        "33. Nb1": "White can now get his other Rook in front of the b-pawn.",
        "33... Kf7": "Time for my King to get involved.",
        "34. Kg2": "White has the same idea. With his extra piece for the pawns, though, I'd have thought building up an attack on the b-pawn a better plan?",
        "34... Ke6 35. Kf2 Ke5": "My King is trying to penetrate via d4.",
        "36. Ke3": "A plan soon stopped by the White King. But still, why not 36.Rb2, a better plan. White can get back into this if he plays it right.",
        "36... Rcd8": "Since my c-pawn is safe I decide to cut off the White King's path.",
        "37. f4+": "White drives my King back, but again 37.Rb2 is stronger.",
        "37... Ke6 38. Rd2": "Curiously offering an exchange. With two passed pawns I fancy my chances.",
        "38... Rxd2 39. Nxd2": "It allows White to get his Knight back into the game. My advantage is really only in my head now, but White's chances to seize the initiative have also gone.",
        "39... c3": "At least until I play this clanger, separating my connected pawns.",
        "40. Nb3": "The wrong place - 40.Nf3 and then 41.Nd4+ drives my Kings back and allows the White King to get to my c-pawn as well as winning the b-pawn:40. Nf3 Rc8 41. Nd4+ Kf7 42. Kd3 h5 43. Rxb5 Kg6 44. e5",
        "40... h5": "Time to launch my other passed pawn!",
        "41. Nd4+": "The b-pawn and so the c-pawn must surely fall soon?",
        "41... Kf7": "I switch tack and keep my King on the K-side.",
        "42. Kd3": "While the White King heads over to stop my Q-side pawns. I've rather made a mess of this ending.",
        "42... g5 43. fxg5 fxg5": "At least I've got two passed pawns on the K-side to play with instead. Hopefully I make a better job of advancing them!",
        "44. Ke3": "But White dithers. Instead of mopping up the Q-side pawns (4. Rxb5 Rxb5 45. Nxb5 h4 46. Nxc3 h3)? he heads back.",
        "44... Kf6": "Supporting my pawns...",
        "45. Ne2": "Missing the chance to drive back the King with 45...e5+ I could now advance the c-pawn out of the line of the Knight's fire...",
        "45... g4": "But I've given it up for dead and advance the g-pawn instead!",
        "46. Nxc3 Kg5": "I support my pawns with ym King, allowing White a final chance to get back into the game. As soon as I played this I saw that 47.Rxb5+ Rxb5 48.Nxb5 means it's going to be hard to win. Maybe impossible?",
        "47. Ne2": "Thankfully, perhaps with the idea that keeping pieces on the board when you are material down, White heads over to my passed pawns.",
        "47... h4": "Another advance helps.",
        "48. Kf2": "White can probably force a draw?",
        "48... Rf8+": "Forget the b-pawn now; my Rook has to get active.",
        "49. Kg2 h3+": "Driving back the King. I'm still optimistic, but White rather hands it to me...",
        "50. Kh2": "According to the analysis 50. Kg1 Kh4 51. Rxb5 g3 52. Rf5 Ra8 53. Rf4+ Kg5 54. Rf5+ Kg4 55. Rf4+ Kg5 forces the draw. But this loses the Knight instead.",
        "50... Rf2+": "Worse is to come for White....",
        "51. Kg3 Rg2#": "A rather terrible end to a tight game."
    },
    "url": "https://gameknot.com/annotation.pl/ruy-lopez-exchange-variation?gm=62662",
    "gameName": "Ruy Lopez, Exchange variation",
    "players": "metcalfe (1807) vs. jimspellman (1790)",
    "opening": "Ruy Lopez (C68), exchange, Alekhine variation"
}