{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Bb5 a6 4. Ba4 Nf6 5. O-O Be7 6. Re1 b5 7. Bb3 d6 8. c3 O-O 9. h3 Nb8": "This is how the Breyer's System begins.  And, it is also where the voting begins.  Simon: 10.d4\nWith the knight undeveloping itself, an aggressive more into the centre seems best to me. \n\nWhite has opening advantage plus an extra two tempi?  Joe: my vote is similar, but it would be 10.d3 The idea being to prevent an exchange because if 10.d4, she can play 10...exd4, and I'm keeping in mind what kenneth_fiore_3 told me about exchanges which is to hold off on that. And, that was due to me getting impulsive and doing so whenever possible which is a big no no.  ION: I'll join in...\n... but for reasons of a rather erratic attention span (I've only just seen this thread though it must be three days old already) I do not wish to 'captain' the side. I reckon charleshiggie would be very suited to the role. \n\nMy vote: 10.d4 \n\nSeems to me as good a time to stake a big claim on the centre, and it frees the Q-side for development. \n\nBlack's immediate programme will be to reorganise her Q-side. We can use that time to develop our own.  Jeremy: I also vote 10.d4 \n\nIt's a bit aggressive but with the position, and the knight not challenging, we stake a nice claim on the center, open a space for our dsb to move, and gets us one step closer to completing development. ",
        "10. d4 Nbd7": "Joe: Could change, but my vote, for now, is 11.d5 as that prevents an exchange. The only drawback is that our development is hindered since that same pawn will be moving.  Simon: I vote 11.Nd2\nThis seems the obvious way to develop the knight as the c3 square isn't available. From here it'll probably go to f1 and then g3 for a kingside assault, which would free our bishop on c1 at the same time. \n\nWhite could also consider 11.c4 or 11.a4 to threaten on the kingside but it feels a little premature to me. \n\njkarp - I think the exchange would be to our benefit. If ...exd4 then cxd4 and we have a central pawn duo and good control of the centre.  Joe: I agree with you Simon which is why Janet did not play 10...exd4 So, I change my vote. I like 11.Nd2, but this appears to cramp Knight. Then, again, there are situation where this must be done. However, another move that develops which I was also thinking about was 11.Bg5. Therefore, this is my new vote. Although not even a half pin, there appears to be some pressure against Janet's Nf6. And, in somewhat similar positions to this and the same scenario as we're seeing here, I have played moves like this. Therefore, my vote is now 11.Bg5.  ION: The Quieen's knight...\n... will develop via Nb1-d2-f1 and the e3 or g3 as we think best. I believe we can afford to maintain the tension in the centre for now. Let Black exchange if she durst. I don't reckon she will. If she plays 11...Bb7, we can support the e-pawn with 12.Bc2. ",
        "11. Nbd2 Bb7": "ION: I suggest...\n12.Bc2. \n\nReason is that we will want to move the d2-knight again very soon, in order to free the dark-square bishop. The knight will have to go to f1, and thence to e3 or (more likely) g3. But before moving the knight we ought to ensure the protection of the e-pawn, hence playing the bishop move first.  Joe: I don't know how this frees a square for the N. As that moves the LSB, as opposed to, the DSB. I know that Bf1 would. Therefore, believe it or not, my vote is the same as ION but for a different reason. If it were for freeing the N, I'd vote 12.Nf1. But, what I like about 12.Bc2 is that the both of the Bishops are nicely aligned. As I analyzed a training game between adevela and Steppenwolf. And, what I learned just by being a spectator is that you want your B's aligned and vertical to each other. So, 12.Bc2 is my vote.  Ron: I would also suggest 12. Bc2. That's if I can join in on this game. I know it would be the 3rd time moving this piece, but I like the Bc2 position.  ",
        "12. Bc2 Re8": "Simon: 13. Nf1\nContinuing the plan. \n\n13. a4 or 13. b3 are also worth considering.  ION: I'd be ...\n... happy with 13.Nf1 or 13.a4. If there is otherwise an even split, I'll probably go with the knight move. The a4 move is on the cards sooner or later. It can afford to await the further development of our pieces.  Jeremy: I really like b3 to activate the dsb and prepare for a4 (coming). Nf1 is an interesting decision, but my preference is b3.  Charles: On this opening database, Nf1 seems to be the most popular move, but a4 and b3 seem to score better...  Joe: Which is my vote. And, that's because the idea is freeing up our DSB. So, my vote is for 13.Nf1.  Simon: I can definitely see the merits of a4 and b3. \n\nIf we go down the Nf1 and subsequently Ng3 or Ne3 then we'll have ended up moving the knight three times and the bishop 3 times, which is hardly what the grandmasters recommend! \n\nBy playing b3 (or a4 and b3 later) we can develop the bishop without having to move the knight again and hopefully retain more opening advantage. \n\nI'll switch my vote to b3 just to keep things interesting.  ",
        "13. b3 Bf8": "Joe: I'm not sure exactly what to do. 14.Nf1 looks good. But, seeing that we have freed our Bc1 with the fianchetto, my vote is 14.Bb2 to take advantage of that long diagonal.  Simon: I like 14. Bb2 here to develop the bishop and add pressure to the long diagonal.  ION: I suggest...\n... we carry in with normal development: Nf1 followed by Ng3  Jeremy: Bb2 is my vote. The knight moves​ take from our tempo advantage.  ION: The knight moves ...\n... must happen sooner or later. I don't think it makes much difference what we do within reason: Bb2, Nf1, even d5 - all seem reasonable moves to me, and would have no quarrel with any of them.  ",
        "14. Nf1 exd4": "Janet: 14.Bb2 or 14.a4 was essential.  ION: Oops -\n- Methinks I made a boo-boo, and have contributed to our having to fight a thankless defence for the rest of the game. My blunder: I simply didn't check. \n\nLet that be a lesson. Take the time (I was in a bit of a needless hurry), and when offering a move for selection, make a case. \n\nIt might also be an idea to examine others' options and be prepared to argue for or against. Usually I try to do this, but chose an occasion in which I didn't to propose a lemon. \n\nAt this point I see nothing better than 15.cxd4, but suggest we look further. ",
        "15. cxd4": "Even if it is not the moral of the story, Janet's next post is a very important lesson, so I have decided to tie it in with the moral for the annotation.  That's because with different defenses, and more then just two he has implied how important it is to study variations.  What he has told me is to play moves that are most played by Masters and Grandmasters.  Of course, you don't know what they always play.  But, what he has implied is that it is very important to study the variations carefully as the moral to some of my games.  Janet: I would be willing\nto call this game a draw,start over up till move 14. 14.Nf1 is a bad error. But it seems it was caused by a slight vote count error. It is more important to study this opening variation then for me to have an easy win. Mr Lopez and Mr.Breyer would be disappointed.... Let me know guys.  ION: Thanks, Janet.\nI do not believe that we could make a successful defence of this as it stands: a pawn ffalling, and a centre pawn at that. \n\nWhat do the rest of youse jokers reckon?  Jeremy: Agreed to draw.  "
    },
    "url": "https://gameknot.com/annotation.pl/ruy-lopez-breyer-system-consultation-game?gm=62873",
    "gameName": "Ruy Lopez, Breyer System Consultation Game",
    "players": "Chess Problems Lovers Club  vs. brigadecommander (2377)",
    "opening": "Ruy Lopez (C88), closed, Leonhardt variation"
}