{
    "moves": {
        "1. Nc3": "A passive first move for white.",
        "1... e5": "This move will probably transpose the opening into an open game.",
        "2. e4 Nc6": "Nf6 would have been a little more aggressive. After ...Bb4 I could've put pressure on the middle. But instead I decide to keep this calm game as such.",
        "3. d3": "White is keeping things very passive here. ",
        "3... h6": "Stopping a Knight or Bishop move to g5.",
        "4. Nf3 Bb4": "Usually white puts the pressure on one of black's knights, so I decide to flip it around. I've made two defensive moves so far, time for some offense.",
        "5. Bd2 d6": "This move opens up my white-squared bishop and is great timing since my black-squared bishop is already in front.",
        "6. h3": "Stopping ...Bg4.",
        "6... Nf6 7. a3 Ba5": "I decided against the trade here as I felt my bishop's presence and pressure from the queen-side was worth preserving.",
        "8. b4 Bb6 9. b5": "I felt this pawn move brought white's front line too far forward and I would gain tempo from attacks behind the pawns.",
        "9... Nd4 10. Nxd4 Bxd4": "An even exchange, and I like where my bishop ended up.",
        "11. a4": "Losing tempo to protect the b5 pawn.",
        "11... c6": "Opening a lane for my queen.",
        "12. Ra3": "White saw the ...Qa5 move so decided to double protect the knight at c3 early.",
        "12... Qb6": "Putting pressure on f2.",
        "13. Qf3": "I understand the reasoning to go all the way to f3. More open lines for the queen and leaving a spot for Be2. But I still think Qe2 would have been better. Protecting the bishop at d2 as well as the f2 pawn and keeping closer to the king. White is in defense mode now and needs to overprotect in order to gain a tempo for any kind of counter attack.",
        "13... Be6": "My first thought was Qc5 forcing his rook to b3 and then ...Be6 forcing his rook to abandon the knight at c3 losing a minor piece. I then thought I could trap the rook by first doing Be6. After I moved I realized I was better off following my first plan as it gauranteed a minor piece. White is still in big trouble here though.",
        "14. Be3": "A better move here would have been to retreat the knight to d1. White is desparate and trying to counter attack somehow.",
        "14... Qc5": "Adding more pressure.",
        "15. Bxd4": "White felt trapped here so tried to trade off some pieces. A better move would be Nb1 to protect the rook at a3 and the c3 square.",
        "15... Qxa3": "Winning the exchange.",
        "16. Nd5": "This was not a good move after losing the exchange. I owned the d5 square.",
        "16... Qc1+": "I wanted to trade queens so that when I took the knight at d5 with my pawn, I could take white's pawn after exd5.",
        "17. Qd1 Qxd1+ 18. Kxd1 cxd5 19. exd5 Bxd5": "Attack complete and I am up a whole rook. I have total control of the game at this point.",
        "20. Bc3 O-O 21. f3 Rac8 22. Bb4 Rfd8 23. a5 Be6 24. g4 Nd5": "Time for another attack. This move will win me the pawn at c2.",
        "25. Ba3 Ne3+ 26. Kd2 Nxc2 27. Bb2 Rc5": "Once you are up in pieces, eliminate the opposing pawns. They are the only pieces that can win the game for white at this point, if one can manage to clear the end of the board.",
        "28. Bc3": "Trying to cut off access to my knight.",
        "28... Rdc8 29. Kxc2": "This trade was not in white's best interests. It may save a pawn but two rooks bearing down on the king all alone is not a good situation.",
        "29... Rc5xc3+ 30. Kd2": "White has few choices at this point. Only a certain path of retreat can stave off checkmate.",
        "30... Rc3c2+ 31. Ke3 Rc2c1 32. Rg1 Re1+ 33. Kf2 Rcc1 34. Rh1 Bd5 35. h4 Bxf3": "This move will end up trading bishops and rooks while winning another pawn.",
        "36. Kxf3 Rexf1+ 37. Rxf1 Rxf1+ 38. Ke2 Rf4": "The game is basically over at this point. A rook and two pawns down is 0-1.",
        "39. g5 Rxh4 40. gxh6 Rxh6 41. Kd2 g5 42. Kc3 g4 43. Kc4 g3 44. a6 bxa6 45. bxa6 g2 46. Kb5 g1=Q 47. Kc6 d5+ 48. Kxd5 Qd4#": ""
    },
    "url": "https://gameknot.com/annotation.pl/0-1?gm=14582",
    "gameName": "0-1",
    "players": "bosnia81 (1357) vs. agentsparrow (1466)",
    "opening": "Dunst (Sleipner,Heinrichsen) opening (A00)"
}