{
    "moves": {
        "1. Nf3 Nf6": "My usual response to White's opening, playing just as non-committally.",
        "2. c4 g6": "... and my next 3 moves are also my standard approach to this kind of thing.",
        "3. d4 Bg7 4. g3 O-O 5. Bg2 d6": "Staying with a standard King's Indian Defence, where White has fianchettoed on the K-side.  5...d5, the Neo-Gruenfeld, is also playable, but not my thing, really.",
        "6. Nc3 c6": "Also playable is the standard 6...Nbd7.  I quite like to leave a hole for my Q at c7 from time to time.",
        "7. O-O Bg4": "A major departure for me.  I've never played it before; I'm not sure I will again.  7...Nbd7 or maybe 7...Qc7 were preferable.",
        "8. h3": "Putting the question.  But there is really just one answer...",
        "8... Bxf3": "As the Russians say: \"If you say 'A', you must then say 'B'\".  This exchange is the sole purpose of the bishop sortie, and the hope that White is weakened in the central dark squares and/or on the K-side.  Is that how it works out?  Well ... partially.",
        "9. Bxf3 e5": "Maybe this ought to have waited until after 9...Nbd7.",
        "10. d5": "A major strategic decision, to close off the centre.  Also playable was 10.dxe5.",
        "10... c5": "Played almost by reflex.  But I don't much like the look of 10...cxd5 11.Nxd5 Nxd5 12.Qxd5 Nc6 13.Rd1 ...",
        "11. Bg2 Nbd7 12. Bg5": "I was half-expecting (hoping for?) 12.e4, here, closing the centre completely.  The pin doesn't seem so very frightening ...",
        "12... h6 13. Bd2": "... and this retreat was the sole purpose of White's bishop sortie, having induced a weakness in Black's K-side.  This proves to have more of an impact in the unfolding drama, though much of it \"behind the scenes\".",
        "13... e4": "(?!)  One of those decisions that \"seems like a good idea at the time\".  Since White has omitted e2-e4 himself, why not?  But as it transpires, Black never seems quite able to bring in sufficient support for the advanced pawn, nor to establish compensating advantages against its loss.  All the same, a considerable battle rages around this pawn for the next several moves.",
        "14. Qc1": "First strike against h6.  A refined move, since the cruder 14.Nxe4 was also playable: 14.Nxe4 Nxe4 15.Bxe4 Bxb2 16.Bxh6 Bg7 17.Bxg7 Kxg7 18.Bg2 (say) and a fine game for White.",
        "14... Kh7": "One of the slightly annoying things about this move is that it takes from the f6-knight a useful square by which to redeploy.  Not that he gets much chance to do so in the sequel...",
        "15. Qc2": "Now White has 3 attacking e4 and Black has one defending.  Active play against other targets keeps the e4-pawn alive for the moment.  The fact is, though, the pawn already survives solely on sufferance, since 15.Nxe4 was still playable.",
        "15... Qb6": "Partly in defence of the e-pawn by putting pressure on b2; partly to bring the a-rook into the e-file.",
        "16. Rab1": "Also Nxe4 or even a2-a4.",
        "16... Rae8 17. e3": "Immobilising the victim. There's something of the fly in the spider's web about that wretched e-pawn.",
        "17... Qd8": "Freeing the Q-side pawns to advance.  Maybe White will let the e-pawn live one move longer...?",
        "18. Nxe4": "Not a chance.  At last, waiting until rescue was imminent, White nabs the pawn.  Black doesn't appear to have much for it.",
        "18... Nxe4 19. Bxe4": "What now for Black?  White has the bishop pair as well as an extra pawn.  19....f5 looks aggressive, but to my mind rather weakens Black's K-side without achieving a great deal.  Instead, I sought counterplay on the other wing.  It has to be said, prospects didn't look promising there either.",
        "19... a6": "A modest beginning...",
        "20. Bg2": "Consolidating...",
        "20... b5 21. b4": "(!) The impact of this was as I imagine that felt by a skate-boarder who uses his face as a braking device.  Right at the beginning of my counterplay, too.  Neither pawn capture looks very enticing, yet we have to go on... ",
        "21... cxb4": "Marginally better than the alternate capture.  21...bxc4 22.Qxc4, and it is White who has the play on the Q-side.",
        "22. Rxb4": "(!?) Moderately surprising, as the bishop capture looks attractive on account of the threat on d6.  Black's reply would have been as in the game:",
        "22... Qc7": "Can something be made of the pin on the c-file?",
        "23. Qc1 Rec8": "Now the c-pawn is threatened with capture.  A file magically opens up for Black's major pieces, and now he has something to play with!",
        "24. cxb5 Qc2": "(!) Rather than lose the file after 24...Qxc1??  Inviting the Q exchange, Black hopes to establish a rook on the 7th, whence he can haul in White's Q-side pawns: 25.Qxc2 Rxc2 26.Bc1 Rc8 with strong counterplay.  Of course, to achieve this much activity, Black hardly notices the loss of a second pawn...",
        "25. a4": "(!) ",
        "25... a5": "(!?) Was the 'natural' ...axb5 better?  The move played looks counterintuitive, allowing White a protected passed pawn on the 5th rank.  Yet to protect the supporting a-pawn, the b4-rook has to stay on the fourth rank.  As it transpires, the 4th rank is a dangerous place for the rook...",
        "26. Rh4 Qa2": "Gaining a tempo to avert the Q exchange (note how sometimes the exchange is invited, at other times avoided), and to gain time to go after the h4-rook.  Game on!",
        "27. Qd1 Bf6 28. Rg4 h5 29. Rf4": "29.Re4 would transpose into the game.",
        "29... Be5 30. Rh4": "(!) To induce the bishop back to f6.  Had the rook gone at once to e4, Black would have had the option of 30...Nf6, with attack on the d-pawn as well as on the rook.",
        "30... Bf6 31. Re4 Nc5": "At last the rook has either to give up the a-pawn, or die in its protection.  He turns out to be one loyal bodyguard...",
        "32. Bxa5": "(!) Netting a third pawn for the exchange.  From Black's point of view, this is a material improvement on the two-pawn deficit, but the price is high in terms of White's advanced pair of passed pawns.  Both sides still have a battle on their hands - White if he is to win; Black to save the game.",
        "32... Nxe4 33. Bxe4 Kg8": "(!?) White was threatening 34.Qh5, but maybe this retreat was overcautious?  Black would have liked to play 33...Rc4, but 34.Qh5  looked unpleasant.  Now, this line turns out fine for Black: 33...Rc4 34.Qxh5 ? Kg7 35.Qf3 Rxa4 and Black would have been well and truly back in the game.  But White can improve: 34.Bd3! Rxa4 35.Bc7 Be7 36.Qxh5  Kg7 37.Qf3.  Not quite so delightful for Black.  However, 33...Kg7 might have been a better retreat in order to protect the bishop, but I wanted to keep the g7-square open for its retreat should it become necessary.",
        "34. Bb1": "(!) The more obvious 34.Bb4 would have been met by 34.Rfd8 - not a very active posting for this rook.  But the move played gains time for White to combat Black's threat to win the a-pawn by ....Rc4.",
        "34... Qb2": "(!?)  Maybe 34...Qa3 was more pertinent?  The move played was intended to inhibit the advance of the b-pawn, but it seems possibly better to have maintained pressure on the a-pawn.",
        "35. Bb6": "Now, what can be done about the a-pawn's advance?",
        "35... Rc3": "(!?) Getting the rooks behind the passed pawns.  Now a tremendous battle rages about White's passed pawns as Black's major pieces flood into White's Q-side.  Yet I wonder if Black might have been better advised to have sacrificed back the exchange by 35...Rb8 36.a5 Rxb6 37.axb6 Qxb5 38...Qxb6.  But White need not accept the bait: 35...Rb8 36.Bd4! Bxd4 37.Qxd4 Qxd4 38.exd4 Ra8 39.Bc2 Rfc8 40.Bb3 Rc3 41.Rb1.  ",
        "36. Bd3 Qa3": "36...Rfc8 seems to have its points, though Black would have been no closer to hauling in those runaway pawns: 36...Rfc8 37.a5 Rb3 38.Qe2 Qa3 39.Rd1 etc.",
        "37. Be2 Rfc8 38. a5 Rc3c2": "Black is wholly reliant on the activity of his pieces to restrain White's pawns.  There sure ain't anything in front of them to stop them!",
        "39. Bd3 Ra2": "Partly with the idea of ...Ra1; but also to keep the a-pawn honest.",
        "40. Qf3 Be5 41. Rd1 Rc3": "Rooks go behind the passed pawns.  But Black also had some idea of action along the 6th and 7th ranks.  The f2-square looked an especially vulnerable spot.  The tension here is enormous - with a species of guerilla warfare taking place.  White has to combine his Q-side infantry offensive with home defence near his castled king, whilst Black conducts commando operations behind enemy lines.",
        "42. Bf1": "The safest spot for the bishop from which to defend b5.",
        "42... Rcc2 43. a6": "(!) Onward !  There's nothing to stop the pawn reaching a7.  Can Black withstand the pressure?  In fact, Black seemed to me so close to pulling off a miracle save, but was deterred from trebling the major pieces on the 7th rank by 43...Qb2 44.e4!  White's bishops sure believe in good works!",
        "43... Qb3": "Having to bring the Q to the back rank to defend.  Why not, though, 43...Qc3 at once?  That would have led to 44.Bd3 Rcb2 45.Ba7! Qc8 46.b6 - an irresistable looking attack.  By allowing the a-pawn to advance, Black prevents Ba7, and can - just - contain White's Q-side.",
        "44. a7": "(!) ",
        "44... Qc3 45. Bd3 Rcb2": "...as in the previous note.  But now the b-pawn cannot advance.",
        "46. Kg2": "Black has successfully arrested White's progress on the Q-side, yet seems no closer to rounding up the pawns.  How is White to make further progress?  Having achieved for the moment as much as he can on one wing, White looks to the other.",
        "46... f5": "(!?)  Too weakening maybe?  Was 46...Kg7 better?  The move was intended to restrain White's K-side, but it does weaken not only Black's K-side pawns, but also Black's second rank, should a White rook penetrate to b7 or c7.  This might become significant later.",
        "47. Bb1": "Eases the pressure on f2.",
        "47... Ra4": "(!)  Not 47...Ra3 48.Rd3! forcing off a pair of rooks.  Black is not in the slightest interested in piece exchanges, reliant as he is on activity.",
        "48. Bxf5": "(!!?) Bravo!  And now we see why White drove the rook away from a2.  Had he played 47.Bxf5 at once, Black's counteraction against f2 after 47...gxf5 would have been enough to hold the game.",
        "48... gxf5 49. Qxf5": "A sight you don't often see: R plus 2P vs 7P!  ",
        "49... Qc2": "(!?) Regrettable necessity, by the look of things.  After the alternative 49...Rxb5, White would have got a tremendous attack: 50.Qe6  Kf8 51.Qd7! [A] 51...Qb3 52.Rc1! Qxd5  53.Kg1! Bc3! 54.Bd4! (with a plus); or [B] 51...Qc4 52.Qb7 (...Qe4  53.Kg1 Bxg3 54.a8=Q  Rxa8 55.Qxa8  (also with an edge).",
        "50. Qxc2 Rxc2 51. Rb1": "(!) Keeps Black's rook off this file.",
        "51... Kf7": "The last reserve.  51...Raa2 is pointless in view of 52.e4.",
        "52. Rb3": "Mildly puzzling, and White withdrew the move at once after Black's reply.  But maybe the move was played to draw Black off the c-file?",
        "52... Rca2": "I now think thios ought to have been played only with the intention of exchanging rook for bishop and pawn on a7.  I certainly gave that idea serious consideration, but perhaps overestimated the effect of the alternative actually chosen at Black's next move",
        "53. Rb1 Bb2": "(?!)  This seemed such a good idea at the time!  The enemy rook, cut off from the rest of the b-file is in effect immobilised.  I didn't quite appreciate the effect on Black's own pieces.  Two alternatives suggest themselves: [A] the sac on a7, though I didn't really fancy Black's chances with bishop against 4 pawns; or [B] simply 53...Rac2, inviting White to declare himself or repeat moves.",
        "54. Kf3 Ke7 55. g4 h4": "(!?) A 50-50 call between this and ...hxg4, it seems to me.",
        "56. g5 Kf7 57. e4 Rb4": "Carrying out his own plan.But it has become a game of \"Bull Rush\" (as it is called in New Zealand).  Surely someone is bound to get through?  Black wins a pawn, but a pawn is all he'll get.",
        "58. Be3 Rxb5 59. Kg4": "(!) It was precisely here that realisation dawned just how bleak Black's prospects had become.  The problem is the b-file, and the pin on the bishop at b2, not only against the rook - that can move away - but against the b7 and b8 squares.  In immobilising White's rook, Black had stymied his own pieces even more.",
        "59... Rb4 60. Kh5": "(!) 60.f3 looks good too, but not 60.Kxh4? Rxe4  61...Re8 and Black would have been back in the game.",
        "60... Rba4 61. f4": "(!)  Exploiting the immobility of Black's pieces.  If 61...Rxe4 62.Rxb2 brings down the curtain.",
        "61... Ra4a3 62. Bg1": "(!) After this Black is completely bereft of counterchances.",
        "62... Rb3": "(?) Better was 62....Ra4, but it's no use.  In effect the bishop is pinned anyway against b7 and b8, so the a2-rook is committed to its protection.",
        "63. f5 Raa3": "(?) ",
        "64. g6+ Kg7": "(!?)  A deliberate decision, played in full knowledge of the immediate material consequences.  I did hope there would be some relief from the pressure as a result, though.  There was none to be had from a line like 64....Ke7 65.e5! or 64...Kf8 65.e5! (65...dxe5 66.Bc5  etc).",
        "65. Rxb2 Rxb2 66. Bd4+ Kf8 67. Bxb2 Rxa7 68. f6": "(!) Crushing.  ",
        "68... Ra2": "Rooks go behind passed pawns :-)  But it's really a case of playing a losing hand down to the last card...",
        "69. Bc1": "(!) Ends the game at once.  The threat is 70.Bh6  ... 71.f7 .  1-0.\r\nWell maybe I didn't quite \"walk the walk\", and was outplayed, on the whole.  But I enjoyed the game, especially once I managed to find counterplay, and for a long time it did seem that, just maybe, I could pull off the draw.  Very well and imaginatively played by my opponent!"
    },
    "url": "https://gameknot.com/annotation.pl/walking-the-walk?gm=18465",
    "gameName": "\"Walking the Walk\"",
    "players": "easy19 (2191) vs. archduke_piccolo (2030)",
    "opening": "Reti opening (A05)"
}