{
    "moves": {
        "1. e4": "Dundee vs St. Andrews - round 3.  The third game between bigpeta and myself.  I have now been added to Pete's growing list of players he's beaten playing the Latvian Gambit.",
        "1... e5 2. Nf3 f5": "2. ...f5, completes the Latvian Gambit setup.  Both sides played fine through move 27.  So I'll skip ahead.  But as it is fun and unusual, here is the game if you'd like to click through http://gameknot.com/analyze-board.pl?bd=18747532 [won't create a link, so please copy & paste].  Many alternatives from 3 through 27; so comments on this section are of course welcome.",
        "3. Nxe5 Qf6 4. d4 d6 5. Nc4 fxe4 6. Nc3 Qf7 7. Be2 Nf6 8. Bg5 Nbd7 9. O-O h6 10. Bh4 g5 11. Bg3 h5 12. f3 h4 13. Be1 exf3 14. Rxf3 h3 15. g3 b6 16. Re3+ Kd8 17. Bf3 Rb8 18. b3 g4 19. Bc6 Bb7 20. Bxb7 Rxb7 21. Qd3 Qh7 22. Rd1 Bh6 23. Re2 Qxd3 24. Rxd3 Re8 25. Rxe8+ Kxe8 26. Bd2 Bg7 27. Bf4": "27. Bf4.  Here is the final position before I let myself be provoked into an interesting but unwise move.  Material is even.  My pawns being intact, I reason that exchanging a minor piece for two pawns may be worth the investment.  On the other hand, given that both sides are somewhat depleted, N (or B) for P+P may not be a very good idea.  ",
        "27... b5": "27. ...b5, provokes...",
        "28. Nxb5": "28. Nxb5.  Perhaps too much focus on the \"damage black's pawns\" idea.  But since white can still gain two pawns for the N, why not?",
        "28... Rxb5": "RxB.",
        "29. Bxd6": "29. Bxd6.  Grabbing the second pawn.  The question becomes, can white's three pieces and strong pawns overcome the master player's four pieces.",
        "29... Nb6": "Recapture being too pricey, bigpeta tempts white to give up yet another piece and let black's pawns regroup AND threatens to damage white's pawns.",
        "30. Re3+": "30. Re3+.  Allows white to move B and N to less problematic locations.",
        "30... Kd8 31. Be7+": "31. Be7+",
        "31... Kd7": "31. ...Kd7.  A key point in the game.  I spent quite a bit of time weighing options.  Decided against BxN due to the pawn on d4 being in danger afterward, instead playing...",
        "32. Na3": "32. Na3.  Unfortunately, during the latter part of my evaluating, I had let go of black possibly responding with Nd5.  Not a fatal oversight, but I was caught off guard when black played...",
        "32... Nfd5": "32. ...Nfd5.  Now, both sides threaten an opposing rook.  But I regret not having extended my evaluation a bit further.  Perhaps should have played 32. Bxf6.  Comments?",
        "33. Re4": "33. Re4.  Here again, my evaluation doesn't extend quite far enough.  While I think 33. ...Nc3 could be followed by RxP threatening RxB, black would actually land a checkmate with 33.\tRe4\tNc3, 34.\tRxg4\tNe2+, 35.\tKh1\tRf5, 36.\tRxg7\tRf1# (though white could avoid # with Kf1 or Kf2 which are not uninteresting).  Regardless, I have now placed pieces based on bad evaluation, in effect wasting some amount of time over the past few moves.  GK computer agrees this was not a good move, preferring 33. Rd3.",
        "33... Nc3": "33. Nc3, one move from landing a check that would preserve his knight (which I fear), so...",
        "34. Nxb5": "NxR.  Eliminates a powerful piece, but at the cost of my rook.",
        "34... Nxe4": "NxR.  Still, I hope to be able to make something of this.  White has not gone down beyond the one pawn value lost with the exchange at 28 & 29, ...though has not gained either.  And I do know Pete is very strong in the endgame, ...gulp?",
        "35. Bc5": "35. Bc5.  Annoyingly limited options for the B to retreat to. ",
        "35... a6": "35. ...a6, protecting the a pawn and kicking out the knight.",
        "36. Na3": "36. Na3.",
        "36... Kc6": "36. ...Kc6.",
        "37. Kf1": "Not paying attention, I hope to get the king in to the action with 37. Kf1.  Immediately repelled with...",
        "37... Nd2+": "37. ...Nd2+ (I've wasted another move!).",
        "38. Kg1": "38. Kg1.",
        "38... Nd7": "38. Nd7.  Beginning a beautiful arc wherein this knight come to team up with the other to win.",
        "39. Bb4": "39. Bb4.  The first move in a plan to edge a pawn toward promotion just ahead of black queening a pawn.  But it is a delicate plan which black quickly foils.  [The flimsy plan: 39.\tBb4\tNf3+ 40.\tKh1\tBxd4 41.\tBe7\tBg1 42.\tNc4\tBxh2 43.\tNa5+\tKb5 44.\tb4\tKa4 45.\ta3\tKxa3 46.\tb5+; and white can promote the a pawn a few moves later]",
        "39... Nf3+": "39. ...Nf3+, and white must choose from poor options.  I reason that black will not be able to checkmate me before my counter threats distract him.  But it is a big commitment to lock myself away with...",
        "40. Kh1": "40. Kh1.  I'll admit that even though I knew the danger of two knights, I thought black would bring the B down, heading toward Bxh2.",
        "40... Bxd4": "40. ...Bxd4.",
        "41. Nc4": "41. Nc4",
        "41... Nf6": "41. ...Nf6. Hmm.  Looks like I had to play 42. Ba3, here! Double Hmm.",
        "42. Na5+": "42. Na5+",
        "42... Kb5 43. c3": "43. c3.",
        "43... Ne4": "43. ...Ne4.  oof! One move to checkmate.  Live and learn.  Psychological blunder.  That knight seemed WAY back in black's territory.  I dismissed its ACTUAL threat and so did not plan for what it could ACTUALLY do. A slow piece but not that slow!  See annotation at 41.",
        "44. a4+": "44. a4+.  Could have resigned here but set the final moves as conditionals instead.",
        "44... Kb6": "44. ...Kb6",
        "45. Nc4+": "45. Nc4+",
        "45... Ka7": "King now out of reach and no way for white to defend f2!",
        "46. cxd4": "PxB.",
        "46... Nf2#": "46. ...Nf2#.  A fun and interesting game.  Thank you to bigpeta for introducing me to the Latvian and for another good game."
    },
    "url": "https://gameknot.com/annotation.pl/walking-the-walk-and-learning-to-run-welcome-mt-1?gm=48261",
    "gameName": "Walking the Walk and Learning to Run Welcome MT #1",
    "players": "hogfysshe (1749) vs. bigpeta (2070)",
    "opening": "Latvian (C40), Nimzovich variation"
}