{
    "moves": {
        "1. e4": "After working with flank openings for months, I've started playing e4 with some success. I think the flank opening experience has helped me certainly, but I will be playing e4 for a while.",
        "1... d5": "I really like this move. I prefer aggressive play. It is my favorite response to e4. Unfortunately, I don't quite have it totally worked out yet, as will be shortly witnessed.",
        "2. exd5 Nf6": "I was hoping he would bring the queen out, more experience there. I hadn't opposed this previously, so needed to referenced the Game Database.",
        "3. d4": "This move seemed interesting. I don't like open e file, but there's some time.",
        "3... Bg4": "Was a little surprised at this move, this would seem to give me an advantage by allowing LSB development and future castling potential. Hmmm... seems almost to simple.",
        "4. f3": "Paranoid, I rethink my strategy and decide to push a pawn. Disrupts my future castle a bit, but I think I'll be ok.",
        "4... Bf5": "Chased the bishop away, which gives me some confidence.",
        "5. Bb5+": "Wondering if this was premature.",
        "5... Nbd7": "In hindsight, not sure why black didn't respond with ..c6. It would seem the exchanges to follow would lead to a serious black advantage.\n",
        "6. c4": "Trying to protect d5.",
        "6... e6": "And there's the threat.",
        "7. Nc3": "Additional stress on d5",
        "7... exd5": "That was mean, he wasn't hurting anyone.",
        "8. cxd5": "Glad the knight is in place.",
        "8... a6": "I've faced this a lot and always wonder what to do. Take the knight? Bring the bishop back home to e2? I am pretty sure anything but a4 is ok.",
        "9. Ba4": "So I played the move I dislike the most. Frankly, not sure happened here at all. I think maybe this was the morning I was late for work and spilled a cup of coffee on my shirt. Yea, I'm going with that for now.",
        "9... b5": "<sarcasm>What a surprise move.</sarcasm>",
        "10. Bc2": "If I would have pulled the bishop back earlier, I wouldn't have wasted those moves. I considered Bb3, but the bishop just didn't seem happy there. I figured I would force a bishop exchange. His bishop was fairly advanced and mine has been around the board and back, so I thought it might be a good idea. I also thought I had a master plan involving a queen pin in the future.",
        "10... Bxc2": "So black takes.",
        "11. Qe2+": "Game losing move. I really thought there was an interesting play here when he pinned my queen, but I simply didn't consider all his defenses.",
        "11... Qe7 12. Qxe7+ Bxe7": "And from here, the game is downhill.",
        "13. Nge2": "Defensive posture activated, attempting to castle.",
        "13... Nb6 14. Nf4": "More tension at d5.",
        "14... O-O-O": "I did think black would castle king. White simply has no more defense to bear on d5...  goodbye little buddy.",
        "15. O-O": "Now I realize I spent way to much energy on d5.",
        "15... Nfxd5 16. g3": "Maybe my pawns can stir things up.",
        "16... Bf6": "Attack continues... he really doesn't like those pawns.",
        "17. Nfe2": "Seemed like a nice defense configuration to hold out to the end :)",
        "17... Rhe8": "Or maybe not.",
        "18. Bd2": "Wanted to connect my rooks... who doesn't?",
        "18... Nc4": "Would've have resigned here if I wasn't required to play this out.",
        "19. Nxd5": "Decided to play some erratic moves, maybe I can daze and confuse him!",
        "19... Nxd2": "Yea, that didn't work.",
        "20. Rfc1 Rxe2": "I think I see a check if I can pull this off.",
        "21. Rxc2 Nxf3+": "Yea, didn't see that coming. I need some more tactics training.",
        "22. Kf1 Rxc2 23. Ne3 Rd2 24. Rd1 Rd8xd4 25. Rxd2 Rxd2 26. Nf5 g6 27. Nh6 Bd4 28. Nxf7": "Just wanted to take something before it's over.",
        "28... Rf2#": "Good game. Thanks again reaper for the game! Until next time."
    },
    "url": "https://gameknot.com/annotation.pl/walking-the-walk?gm=55820",
    "gameName": "Walking The Walk",
    "players": "russ20124 (1350) vs. thereaper1 (1982)",
    "opening": "Scandinavian defence (B01)"
}