{
    "moves": {
        "1. d4": "Thanks Baumannjoe for the time-share.______I had annotated in live, playing the game.\nNo db, no engine and without moving pieces (to train the visualization).\nI had written the candidates moves and the lines i had seen (or believe to see).______So all can be totally wrong :-)________Any comments are welcome. ",
        "1... d5 2. e3 Nf6 3. Bd3 e6 4. Nd2 c5 5. c3 Nc6 6. f4": "Here is the end of the line of this thematic game.",
        "6... cxd4 7. exd4 Bd6 8. Ndf3": "With this move i am at the end of my opening knowledge.",
        "8... O-O 9. Ne5": "The usual outpost but with Nf3-e5 and Nd2 to keep an eye on Ne4.______Because of the move order of this thematic mt, things are differents.",
        "9... Ne7 10. Ngf3 Ng6 11. O-O Nh5 12. Ng5": "The turn of the game.______12.Ne1 looks ok but restrict the attack and take the square for a Qe1-h4. i don't look more because Ng5 looks very interesting______12.Ng5 f6_13.Qxh5 fxg5_14.Nxg6 hxg6_15.Bxg6 Re8_\n16.Qh7_and i suppose g7 will be taken by the white queen (but i can't visualize well in my mind)\n______or______13...h6_14.Bxg6 and it looks like the line above______\nIf take with the knight :______12...f6_13.Nxg6 hxg6_14.Bxg6 But it can't visualize more______\n12...Nf6 and it is hard to see a line after this move. An idea can be 13.Rf3-h3 and then throw the knight or the rook on h7 to remove Nf6. Qh5 will be then possible.\n",
        "12... f6 13. Qxh5 fxg5 14. Nxg6 Rf6": "15.Ne7+ Bxe7\n16.Qxh7+ seems a dead-end______15.Ne5 Rh6 (or g6 or h6)_16.Qxg5 Qxg5_17.fxg5 Bxh2+ not cool_\n.....i look again and Fxh2 is not possible because of Ne5. Difficult once again to visualize in the mind the lines.",
        "15. Ne5 Rh6 16. Qxg5 Be7": "17.Qg3 and no lift Rf3-h3______17..Qg4 the lift Rf3-h3 is possible",
        "17. Qg4 Bd7": "18.Nxd7 free e6, i don't like______18.f5 Rh4_19.Qf3 and... well i don't know but i don't think there will have a tragedy for white so let's go. ",
        "18. f5 Rh4 19. Qf3 Be8": "20.fxe6 Bh5_21.Qf5 g6_22.Qf7+ (and a bishop or a knight on f7 perhaps, but one again it am not able to visualize 2 moves and a half)",
        "20. fxe6 Bf6 21. Bg5": "According to \" how analysis \" it is important to have one move we like in the game. It is this one for me, mostly because it show that spending hours doingtactics exercices will give a cool feed-back....sometimes.",
        "21... Rh5 22. Bxf6": "22...gxf6_23.Nf7 Bxf7_24.exf7+ Kxf7_25.Qxh5+ and there is lines open so probably very dangerous.\n______23...Qb7 (or Qe7)_24.Qxh5",
        "22... gxf6 23. Nf7": ""
    },
    "url": "https://gameknot.com/annotation.pl/walking-the-walk-and-learning-to-run-part-6?gm=48864",
    "gameName": "Walking The Walk and Learning to Run Part 6",
    "players": "mrtoduvet (1716) vs. baumannjoe (1353)",
    "opening": "Queen's pawn (D00), stonewall attack"
}