{
    "moves": {
        "1. e4": "This is an opening e4 that I used to use all of the time, until TA suggested I start developing the d4 line.",
        "1... g6": "Since I'm playing someone who will definetly win, why not play something that I can possible learn from or at least explore something different.",
        "2. d4": "looks like he taking a stong hold on the center.",
        "2... e6": "I will play somekind of primitive pawn development game.",
        "3. c4": "White is playing pawn development also, but I feel he is really just opening his forces.",
        "3... c5": "purely reactionary move on my part.",
        "4. d5": "he looks to be trying to establish an advance pawn structure, forcing me into a closed game.",
        "4... exd5": "I try and redirect where the pawns end up at.",
        "5. cxd5": "anticipated, it does open the door for the dark bishop.",
        "5... d6": "trying to regroup a stronger pawn structure, I'm hoping I'm not wasting to many moves at the cost of other piece development.",
        "6. Nc3": "purely developmental move",
        "6... Bg7": "time to get the dark bishop out.",
        "7. Nf3": "developmental",
        "7... Nf6": "developmental on both of now.",
        "8. Nd2": "something I wouldn't usually do, normally play more aggressive. I would assume he is planning on where he wants this knight to end up at.",
        "8... Nbd7": "this is better than the edge of the board.",
        "9. Be2": "not sure where he is going with that move, maybe a move to set up castling.",
        "9... b6": "try and develop a pawn structure wall on the queen side.",
        "10. Nc4": "with the game tending towards closed structure, I knew blacks knights would play an important role.",
        "10... Qc7": "not to sure why I made this move, probably ke5 would have been better, I think must have made this move while thinking about something else.",
        "11. Nb5": "I'm paying the price of that last move, white is jump on the opportunity offered up to him.",
        "11... Qb7": "wrong move, in hindsight, maybe Qb8 would have been better.",
        "12. Nbxd6+": "don't have to worry about the bad Queen move she is gone now.",
        "12... Kd8 13. Nxb7+ Kc7": "All out of position now this game will truely be rough to finish.",
        "14. Nbd6": "preparing to pick me apart, to the victor goes the spoils.*****************************************************************************\n*****\n*\n~~~~~therealjimfriar: Sounds good. One good tip is always to recapture if you can. If I capture a piece you retake unless theres a better move...",
        "14... Nb8": "I'm so rattled at this tage I give the taking of the knight and set him up for somethin else.",
        "15. Bf4": "an impleid check",
        "15... a6 16. Nxf7+": "gains a pawn, will gain a rook, the knight id look pretty strong here as it slices and dices.",
        "16... Kb7 17. Qb3": "seems white has mercy on me, maybe, maybe he sees something better!",
        "17... b5": "try to get rid of the knight, and strengthen my position, knowing this leads to another possible check.",
        "18. Nfd6+": "anticipated, but I figured he would grab the rook while he was there???",
        "18... Ka7": "trying to seek cover.",
        "19. Nxb5+": "This doesn't look good, I know enough when you have knights working in tandem, with backup support from the Queen, it will not last much longer.",
        "19... Kb7": "Hoping for a mistake, I doubt I will see that....",
        "20. Nd4+": "Mate pending, I have enjoyed the game."
    },
    "url": "https://gameknot.com/annotation.pl/walking-the-walk-learning-to-run-welcome-mt-pt-8?gm=50933",
    "gameName": "Walking the Walk & Learning to Run Welcome MT Pt.8",
    "players": "therealjimfriar (2206) vs. knightgator (1100)",
    "opening": "Norwegian defence (B06)"
}