{
    "moves": {
        "1. e4": "This is my traditional opening, the King's Pawn Game (B00).",
        "1... Nf6": "I've rarely experienced this opener before, which is Alekhine's Defense (B02). I knew though that against someone this strong, this would be expected.",
        "2. e5": "Normally, I'd protect my pawn, but with being against a master, and getting better at chess lately, I felt that the Alekhine's Defense Mokele Mbembe (Buecker) Variation (B02) was a good idea. Stalhandske told me that this was a good move. ",
        "2... Nd5": "Black continues the Alekhine's Defense (B02). ",
        "3. c4": "I continue the Alekhine's Defense (B02) by attacking the knight again. ",
        "3... Nb6": "The Alekhine's Defense Steiner Variation (B02) continues.",
        "4. c5": "I respond with the Alekhine's Defense (B02) two pawns' (Lasker's) Attack. Again, black tells me this is a good move, which I am glad to hear, for I'm usually good with openings. ",
        "4... Nd5": "Black plays the Alekhine's Defense (B02) two pawns' attack Mikenas Variation. ",
        "5. Bc4": "I continue Alekhine.",
        "5... e6": "Black continues Alekhine. ",
        "6. d4": "Alekhine's Defense is now over, along with the book openings. Quite impressive though that both sides, namely white, was able to stay with the book for 5 moves. Now the game continues without the book,",
        "6... b6": "If I do not play cxb6, black will probably play b5 next and attack my Bishop...",
        "7. cxb6": "...so I decide to attack and trade.",
        "7... axb6 8. Nc3": "This would of continued Alekhine's Defense if played on move 6.",
        "8... Nxc3": "Wasn't completely expecting fair trade, but I'll except. Knights can be powerful pieces, but in this case it doesn't really matter for each side because it's a fair trade and neither Knight is a threat. ",
        "9. bxc3 d5": "My Bishop gets attacked.",
        "10. Bb5+": "I play check, which may not be the best move, but not the worse.",
        "10... c6": "I expected this move. I basically gave white a free move, and now I must protect my Bishop to.",
        "11. Bd3 c5": "I think black may be planning more trade, but could also be trying to control center.",
        "12. Bb2": "I played the opening of this game quite well, but finally I made an inaccuracy, which wasn't a bad move, but computer analysis says that Nf3 would of been better, which yes it would of, for it would of got my knight out there.",
        "12... Nc6 13. Nf3": "Now I get the knight out.",
        "13... Ba6": "My bishop is attacked again, but since I plan on castling soon, and with the Bishop already protected, I let black decide his plans.",
        "14. a3 Bxd3": "As I suspected, black wanted it gone, but of course, black's bishop is gone to. Bishops can also be powerful pieces, but again, this doesn't really matter, for it's fair trade and neither piece is a immediate threat,",
        "15. Qxd3 c4": "I expected this. Of course I'll retreat.",
        "16. Qc2 b5": "Black is controlling center more.",
        "17. O-O": "I finally castle king-side, Giving my king more protection.",
        "17... Be7": "I think black is planning the same thing.",
        "18. g3": "I do not want black's bishop to land on h4 at some point, so I played this.",
        "18... O-O": "As I thought, black does castle king-side.",
        "19. h4": "I get the pawns out further on the king-side.",
        "19... h6 20. Bc1": "I would quickly realize why this was not a good move.",
        "20... b4": "axb4 seems to be logical at a simple viewpoint, but doing so would result in Rxa1, resulting in a huge disadvantage for white. cxb4 is good here. Black would then play Nxb4, which then my queen would retreat and be safe along with my rook.",
        "21. Qb2": "I play this instead. I thought I could take the b4 pawn. I was clearly oblivious to the fact that that pawn was well protected by black's bishop and knight. I'm not surprised that the computer analysis viewed this move as a mistake. As I thought, cxb4 would of been better.",
        "21... Rxa3": "Now I'm down a piece. I have done well in this game so far, but that will quickly change.",
        "22. Rxa3": "I give fair trade.",
        "22... bxa3 23. Qa2": "Attacking the a pawn.",
        "23... Qa5": "Black responds with extra protection.",
        "24. Bxa3": "?! I don't know why I felt this was a good move. For some reason, I thought that I had another piece (which there isn't one) on that pawn. I basically just gave up my Bishop. Computer analysis surprisingly views this as a mistake, but it's really a blunder. It says Bd2 would of been better.",
        "24... Bxa3": "Now I have a size-able disadvantage.",
        "25. Ra1": "I put more pressure on the Bishop.",
        "25... Rb8": "I'm a bit surprised black didn't move his rook to a8 instead. If I attack the bishop and so on (26. Qxa3 Qxa3 27. Rxa3 would result in a even material score again. It's not a bad move, but I would of played Ra8 (but I'm not the master here.)",
        "26. Nd2": "I instead try to get my knight involved, which would end up being a pointless move. Computer analysis views this as a mistake and says that, um, Kg2 was better? I don't think black would of moved his rook to b1, for then it is lost. In my opinion, Qxa3 was better.",
        "26... Qxc3": "My material disadvantage grows. ",
        "27. Nf1": "I retreat my knight, as I have stated to panic here, which is never good.",
        "27... Rb3 28. Qe2": "I felt I needed to retreat my pieces and protect my king, but in a panic, I did not think about my move thoroughly and made it in a nervous panic. Right after I made this move, I saw the blunder I made. My rook had no protection at all, and white abandoned it. When I saw this, I told stalhanske I messed up and resigned. Although I started off strong, I crumbled in the end. This game was now over. I may of lost. but I knew that would happen. It was a good learning experience. I hope you enjoyed this annotation and feel free to rate and comment about it. "
    },
    "url": "https://gameknot.com/annotation.pl/walking-the-walk?gm=54428",
    "gameName": "Walking the Walk",
    "players": "joveyboy1 (1060) vs. stalhandske (2175)",
    "opening": "Alekhine's defence (B02), two pawns' attack, Mikenas variation"
}