{
    "moves": {
        "1. e4": "Basic e4 opening, the same opening I've played thousands of times before.",
        "1... Nf6": "Stalhandske replies with Alekhine's Defence... I am fairly familiar with this defense because I've played it pretty often myself.  This game was one of the first times I faced it with white and I was determined not to allow my pawns over extended in the center of the board...",
        "2. Nc3": "I choose the Scandinavian Variation.  Just a simple statement letting my far superior opponent know early that I am not taking the bait and would rather develop my own pieces at my own pace.",
        "2... e5 3. Nf3": "I now have a Halloween Gambit transposition in my mind.  I figured I needed to make bold moves to take my opponent out of his comfort zone, of course taking him out of his comfort zone won't make him as uncomfortable as I am, and I'm aware of that at this stage of the game.",
        "3... Nc6": "He responds accordingly and we now have our third variation of the match, the Four Knights Game.",
        "4. Nxe5": "And I take.  GK database always lists this as a mistake, but I've had several opponents blunder away winning positions all the way up to the end game when I've used this approach, it's like it is cursed for black!",
        "4... Nxe5": "He takes, and this Walk the Walk game has seen four different possible openings in the first four moves.  Is this incredible?  Quien Sabe?  But what I can say is you know the game isn't going well for you when you're proud of your transposition skills rather than your game play.  At least I took his Alekhine's Defence and turned it into what I wanted to play, right?",
        "5. d4": "Or did I?  In the end his original ploy was to get me to stretch my pawns thin...",
        "5... Ng6 6. e5": "Which, of course, I do... and in the process I handed over a knight in exchange for a pawn.  Can I get a mulligan? ",
        "6... Ng8 7. f4": "Attempting to dominate the center.  A better move here might have been to develop my King's Bishop.  20/20 hindsight...",
        "7... d6": "Staking a claim of his own...",
        "8. Bc4": "On second thought, maybe not.  My e-pawn did need an extra defender and using the Queen's Bishop to do so would have hindered development.  I think I out thunk myself.",
        "8... dxe5 9. fxe5": "Simply recapturing, the thing about trying to gain an advantage by giving up material is you can't afford to lose any more.",
        "9... Nxe5": "A gift?  Perhaps he pitied me and tried to cut me some slack?  Doubtful.  At this point he's like a shark that smells blood, only I haven't yet realized I'm bleeding...",
        "10. dxe5": "I am now praying for a monumental blunder on his part.  Any time you find yourself praying, you're in trouble.  If he messes up here, say for instance going 10. ... f6, I can then play 11. Bf5+ Kxf5 and 12. Qxd8.  The only problem is that I'm not playing someone rated 1350 or so, unfortunately that is a BIG problem and I'm hinging to much hope on mistakes...",
        "10... Qh4+": "See what I mean? The beginning of the end.",
        "11. g3": "I realized my Bishop was hanging, it was really a solid move by Stalhandske, he has a tremendous advantage now and I cleared out all the center pawns for him, thus saving him the middle game work the Alekhine usually requires.",
        "11... Qxc4": "En prise.",
        "12. Bd2": "Trying to clean house for an emergency O-O-O!!!",
        "12... Bg4": "Whoop!  Hold it right there!  \"Ok\" I say, meekly. ",
        "13. Ne2": "And now all my pieces are defending my King rather than setting up for a later attack.  It's getting ugly.  ",
        "13... O-O-O": "Oooooh!  I know I'm in trouble, but I'm seriously awestruck by some of these moves and a bit jealous I don't think of them on my own.  Here, Stalhandske castles Queenside not in defense, but as an attack.  Things are going from bad to worse.",
        "14. h3": "Nonsense move.  Better MAY have been b3, but at this point the boat is sinking and I can't bale the water fast enough to keep it floating.",
        "14... Qe4": "I wanted to resign here.  There are no offensive moves that I can find, I now must move my Rook in defense and it feels like my hands are tied and I'm headed for the gallows.",
        "15. Rh2": "I try to salvage something while adding a defender to my knight.",
        "15... Bf3": "A good move, my hands are still tied and my opponent isn't even using half his pieces...",
        "16. Rf2": "What did this do?  Here was a chance to manage something, perhaps, if I could see something.  Either way, less thought was going into the moves at this point simply because I felt so restricted.",
        "16... Bb4": "Mr. Bishop floats in like the last vulture to the carcass, and man does this one stink!",
        "17. c3": "I finally get some pawn development, on the bright side.  I know I'm in the end game here, I'm just trying to find something somewhere to get one last shot in...",
        "17... Bc5": "Of course, now my Rook is the target.  Everything's falling apart.  Everything has fallen apart I should say...",
        "18. Rh2 Be3": "Well played!  He still got exactly what he wanted and now I can't even attack his Queen with my knight.",
        "19. Kf1": "Begrudgingly... ",
        "19... Rxd2": "Time to move it or lose it.  ",
        "20. Qe1": "Makes the most sense to me, and alternative was b1 to offer a Queen exchange he wouldn't have taken.",
        "20... Rxb2 21. a3": "Rd1 was probably my best option here.  I gave up too soon and played recklessly in the beginning and this move was a total waste.  ",
        "21... Bxe2+": "Here I can capture with my Queen and lose it to the rook, but recapture the rook with my rook only to lose by Qh1#.  There was a way out of this that I didn't see, but it would have cost me hugely in material.  Instead Rxe2 and Checkmate.",
        "22. Rxe2 Qh1#": "Thanks for reading, I hope I was able to provide some humor and to those who faithfully read annotations, I hope I was able to provide some knowledge and insight, albeit on what not to do.  Cheers!"
    },
    "url": "https://gameknot.com/annotation.pl/walking-the-walk?gm=47378",
    "gameName": "Walking the Walk",
    "players": "jj414 (1387) vs. stalhandske (2095)",
    "opening": "Alekhine's defence (B02), Scandinavian variation"
}