{
    "moves": {
        "1. e4": "This was a game I recently played against dynamic_dv.  While he is a +2000 player and a member of the club Walking the Walk, this isn't technically considered a W the W game because I had played him and been defeated by him previously.  I'm proud of my performance in this game, even though it all fell apart for me in the end game, I was in a position to possibly win or draw when we reached end game.  ",
        "1... c5": "Looks like the Sicilian Defense.  I like to play the Sicilian, I'm not fond of playing against it though.",
        "2. Nf3": "Open Sicilian.  I am currently playing a version of the Sicilian closed that turned into the Sicilian Grand Prix Attack.  I didn't really want to find myself in that position here, the positions are a bit too complex for me and the advantage would likely go to DV.",
        "2... e6 3. Bb5": "A discussion with Elyhim during our previous W the W game led to me making this choice.  Normally I would have gone Bc4 instead, but this seemed to cause a weakness in his defenses early, one I saw and tried to remember to exploit later.",
        "3... a6 4. Bc4": "Back to my comfort zone, there's a good chance I'll want to exchange this Bishop later with all of DV's pawns currently inhabiting white squares and this Bishop not being placed on the most optimum of diagonals.  ",
        "4... Nc6 5. d4": "Time to challenge the c5 pawn.  As white I rarely play this move, opting usually to let the piece occupy the square, defending it might have been a bit difficult for my opponent later, but I wanted to see where this line would lead.",
        "5... d5": "I didn't expect that response...  I see pursuit of the Bishop in order to stall development on my end.  The problem is it delays black's proper development as well, so I'm not too concerned for this right now.",
        "6. exd5": "We'll trade and open up the center a little bit.  This open e-file ends up being the crux of our game, all the action seems to take place within this alley.  ",
        "6... exd5 7. Be2": "Time to end the pursuit of the bishop and begin developing all the other pieces in my arsenal.  I do realize I have a slight development advantage, but at this time I don't feel it's enough to really capitalize on and gain a solid advantage.",
        "7... Nf6 8. O-O": "When I play 1. e4 I like to be castled by move 4.  This wasn't possible in this game because of the bishop pursuit.  To wait any longer could have been disastrous, it was the right time to do this.",
        "8... cxd4": "One of the rules of chess I try to follow is \"To take is a mistake.\"  That is unless it gains you a clear positional or material advantage.  I break this rule often enough, which is why I clung to it in this game like a drunken sailor clings to his wonderful wooden legged dance partner (which really was a chair, we got pictures).  But I digress, I wanted my opponent to capture here and I continue to feel good about my position and development.",
        "9. Nxd4": "Equalizing material...",
        "9... Bc5 10. Nxc6": "I broke the rule here.  I decided that crippling his queen side pawn structure was crucial to my game and position.  This move pretty much forces bxc6 as my knight is sitting pretty if left unbounded.",
        "10... bxc6": "At this point it looks as though I should prepare a king side attack.",
        "11. Bg5": "Just pinning the knight to the queen.  I have no intention of trading a bishop for a knight when the board is beginning to open up.",
        "11... O-O": "Castle, just in time too.  A quick rook step towards the queen and things might have started to look ugly.",
        "12. Nd2": "Developing the knight to d2 is an attempt to move it to more useful positions on the king side of the board, and to get it there quicker.  Developing to c3 would have rendered the piece pretty much jammed on the queen side for a good portion of the game.  With my opponent's rating, I needed ALL of my pieces at my disposal to be useful and productive, else I needed to try to exchange them for the strongest pieces possible from DV's arsenal.",
        "12... Re8 13. Nb3": "Which is the explanation for this move.  I actually made an in game note to try to trade this knight for this bishop.  With the board being open in the center, I'd speculate that knights are worth about 2 points here and bishops about 4 points rather than 3 and 3.  Ideally I want to see the queen come out and cover the bishop here so I could get my exchange.  I felt brilliant and crafty at this point.",
        "13... Bd6": "Well, I must have been on to something...",
        "14. Qd3": "Trying to get the queen into the game and this square is a hub to the game, my queen is very productive in this position, eyeing the h7 square, defending the e2 bishop, dominating the 3rd rank and just taking up a lot more space on the board than simply the d3 square.",
        "14... h6": "He's shooing me...",
        "15. Bh4": "Let's see how much he's willing to compromise his king's security...",
        "15... Be5": "Looking for a free pawn and an attack on my rook... ",
        "16. c3": "I briefly considered Nd4 in hopes of an exchange, but I didn't for 2 reasons.  1. He wasn't willing to exchange before and 2. On the chance of an exchange, I didn't want my queen going to d4 because it would have left my bishop on e2 undefended and free for the taking.",
        "16... Qd6": "I expected this at some point...",
        "17. Bg3": "No point pressuring the knight anymore anyways.",
        "17... Bf5": "I knew these bishops would be strong...",
        "18. Qxf5": "Here comes a bloodbath... ",
        "18... Bxg3 19. fxg3": "I like the f-file open when I play white, so this isn't much of a problem for me, although it will be a problem in the endgame.",
        "19... Rxe2 20. Rab1": "Just defending the b2 pawn.",
        "20... Rae8": "Now it seems the e-file has become an interstate, or a launching pad of Intercontinental Ballistic Missiles.  Both knights are fairly useless at this time, I wanted to avoid a knight endgame because I'm not as strong with knights in the endgame as I should be for my rating.  I need to work on that.",
        "21. Nd4": "A more central position, just trying to make this mysterious piece as strong as possible.",
        "21... Qc5": "A solid pin...",
        "22. Kh1": "I break it...",
        "22... Re2e4 23. Qf2": "The d4 square is becoming a lynch pin of the game...",
        "23... Qb6 24. b4": "Trying to free up my rook and take up more real estate on the queen side of the board. ",
        "24... Qc7 25. Rbe1": "According to the GK post-game analysis, this was my first mistake -inaccuracy- of the game.  It recommended, instead, Qd2.  ",
        "25... c5 26. Nf5": "Slowly the advantage is beginning to swing in favor of DV.  ",
        "26... Re4xe1 27. Rxe1 Ne4 28. Qe3 cxb4": "Pawns are going to be crucial I do believe...",
        "29. cxb4 Nd6": "In this situation, Nd6 spells \"serious trouble.\"",
        "30. Ne7+": "There weren't many other options here...",
        "30... Kf8 31. h4": "h3 would have been better, I believe.",
        "31... Rxe7 32. Qxe7+ Qxe7 33. Rxe7": "I felt better entering the endgame with this scenario.  It isn't the best, and certainly not as good as I was 10 moves ago, but I might be able to work something here.",
        "33... Kxe7 34. Kg1": "Trying to bring the king to the middle of the board, a bit behind at this point, however.",
        "34... Ne4": "Well, I can't defend g3 now, brilliant move by DV.",
        "35. g4 Ke6 36. Kf1 Ke5 37. a4": "I doubt DV will let me promote, but I have to try...",
        "37... Kf4 38. b5 axb5 39. axb5": "That knight is a pain...",
        "39... Kxg4 40. b6 Nc5": "Now my King has to work.... sigh... my king likes to lounge around and eat grapes and cake and stuff like that.",
        "41. Kf2 d4 42. g3 d3": "I guess I better try to address that pawn... the writing is on the wall, DV just needs to play a patient game and this game will win itself.",
        "43. Ke3 Kxg3": "My only hope is that pawn on b6...",
        "44. h5 f5 45. Kd4 d2": "My opportunity has passed, but we could have sat there all day, that f5 pawn was going to promote and there was nothing I could do to stop it.",
        "46. Kxc5 d1=Q 47. b7 Qd8": "I know where this is headed... it's a sinking feeling in my stomach really, the possibility of a win or a draw slips away after a well played game because of my sub par end game skills.",
        "48. Kb5 f4 49. Ka6 Qb8": "Maybe it I can move my king he'll forget about that pawn...",
        "50. Kb6": "Maybe...",
        "50... f3": "Ah nope.  I resigned at this point.  My king is simply waiting to die on the 6th rank and I couldn't bear to see him tortured any further.  I hope you enjoyed my annotation and found some knowledge and humor within it.  One's not any good without the other.  Cheers!"
    },
    "url": "https://gameknot.com/annotation.pl/walking-the-walk-and-learning-to-run-welcome-mt-1?gm=48170",
    "gameName": "Walking the Walk and Learning to Run Welcome MT #1",
    "players": "king-nothing (1415) vs. dynamic_dv (2092)",
    "opening": "Sicilian defence (B40)"
}