{
    "moves": {
        "1. e4 c5": "Sicilian opening.",
        "2. f4 d5 3. Nf3 dxe4 4. Ng5 Nf6 5. Bc4": "Looking at this attack, I thought that it would be enough to just block the bishop with my pawn. Looking back now, I missed that I could have attacked his queen either offering to trade queen and bishop for queen and knight. Computer analysis confirms that would have been the best move.",
        "5... e6 6. Nc3 Be7 7. Ngxe4 Nbd7 8. d3 a6 9. a4 Nb6 10. Bb3 O-O 11. Be3 Nbd5 12. Nxf6+": "Two ways to tackle this check, 12. ... Nxf6 or 12. ... Bxf6. I chose Nxf6 which not only recaptured, but took all the tension out of the middle of the board. This would prove to be a bad idea as the N on c3 proved to be a very good attacker on d5 later in the game. Had I gone forward with Bxf6 the exchange of knights on d5 might have given me a better position later.",
        "12... Nxf6 13. O-O b6 14. Qf3 Rb8 15. Rad1 Bb7 16. Qh3 Qc7 17. f5": "Up until here, this seemed like a fairly even game. Even amount of material gained/lost. Positions not overly out of balance. Computer analysis even shows the \"Score\" as -0.00. Unfortunately, my next move started the downward (spiral isn't even the right word) crash and burn. Even now, looking at this position, I'm not sure I would have exchanged pawns even though I do see the merit of it. Keeps the position even, doesn't really give away anything.",
        "17... Nd5 18. fxe6": "Another chance to remove some of the minor attackers off of the board which would come to haunt me later. Instead, I focused on the major pieces and allowed white's Q to infiltrate and cause my position to degrade wildly.",
        "18... fxe6 19. Qxe6+ Kh8 20. Bxd5": "Looking at this position, I thought I could force the exchange on b7 by threatening the B on d5 with a rook. Turns out I didn't need to do this and I should have shielded my rook so I could remove the queen from the tight grip she had on my position and gain a little breathing room.",
        "20... Rbd8 21. Rxf8+": "With the forced exchange, not only could I no longer scare off the queen, I lost any hope of getting some breathing room and maybe some momentum for a counter attack.",
        "21... Rxf8 22. Bxb7 Qxb7 23. Nd5": "Here is the N on d5 I mentioned earlier in the game. I couldn't get him off of this square even if I was so inclined. I made a comment during the game about how I should have thought about going ahead and removing the knight sometime during the next few moves. Here, I should have cleared out the bishop so I had a better chance of defending the rook and a little more room to maneuver. ",
        "23... Bd8": "Instead I clogged up my position even more. Bh4 was what the computer analysis recommended. ",
        "24. Rf1 Rg8": "Save yourself! I need every piece I can hold onto, because . . . because . . . The computer analysis didn't call this a mistake, but clearly I should have done something more. I'm not sure what would have been better though.",
        "25. Rf7 Qb8": "This move didn't serve the purpose I thought it would have. I was looking to save my queen at the expense of the game. I removed any tension there might have been against the knight. I moved to a8 on the next turn, but it would have been much better to do that on this turn.",
        "26. Bf4 Qa8": "Forced. Exchange of the Queen for Bishop, while it sounds wildly bad might have staved off mate for a few more moves. Instead I moved into a forced mate in 5.",
        "27. Bh6": "Computer analysis calls this move by white a \"Blunder\". It allows for the exchange of queens on c5 if I had played it correctly, but to do so would have required me to sacrifice my bishop on g5, my rook right where it is and offer my queen twice, the second time with check so that he had to take it. It would have extended the game and maybe I could have called it a moral victory.",
        "27... Qxd5": "Instead I tried to disrupt his mate by taking it down from Mate in 5 to Mate in 3.",
        "28. Bxg7+ Rxg7": "Forced. Mate in 2.",
        "29. Rf8+ Rg8": "Forced. Mate in 1.",
        "30. Rxg8#": ""
    },
    "url": "https://gameknot.com/annotation.pl/walking-the-walk?gm=57269",
    "gameName": "Walking the Walk",
    "players": "a_random_guy (1966) vs. gtrigity (1508)",
    "opening": "Sicilian (B21), Grand Prix attack"
}