{
    "moves": {
        "1. d4": "A \"Walking The Walk\" club game.  Playing black vs battlefleet, yikes!  He opens with 1. d4.  I consider resigning here.",
        "1... Nf6": "trying something new. 1. ...Nf6",
        "2. c4": "looks like a gran prix except with no advanced pawn for black.",
        "2... e6 3. Nc3 Bb4 4. Nf3 b6": "4. ...b6.  seems a reasonable initial position for black.  good mobility and castling options in both directions.",
        "5. Bg5": "5. Bg5.  Now this causes me problems.  Not so much now.  But complications arise soon.  Still, my dsb can come back if necessary (for the moment).",
        "5... Bb7 6. e3 h6 7. Bh4": "7. Bh4.  Here I consider g5 and then castling long.  But instead...",
        "7... c5": "7. ...c5.  which commits the dsb.  This is first of several moves that contribute to black's difficulties a bit further along.  perhaps should have recalled the B and played 7. ...Be7.",
        "8. a3": "8. a3",
        "8... cxd4": "8. ...cxd4.  a lesser of evils move that will leave white's pawns slightly disrupted.  ",
        "9. axb4": "9. axb4",
        "9... dxc3": "9. dxc3",
        "10. bxc3": "Black still ok here.  Or is he...",
        "10... O-O": "that bishop is limiting my queen and g5 is not a good solution.  so, black is ok but with problems; white by contrast has none.  I suppose I should be regretting not having the queen's knight developed by now.  that is really the theme of the game for black: TOO SLOW!!!",
        "11. Be2": "11. Be2.",
        "11... Qe7": "11. ...Qe7.  ",
        "12. O-O Rd8": "14. ...Rd8.  A bad idea if I need the d-pawn pawn to continue to guard c6, which as shall be seen I will...",
        "13. Nd4": "a good square for the knight.",
        "13... d5": "white seeking to open things up.  but should have played Nc6 or e5?  opinions and comments please.  This is probably THE losing move.  I certainly want that pawn back on d7 a few moves later.  I am surprised I let those queenside pieces stay so bunched up.  had ideas of further knocking his pawns around, as little sense as that makes to me now!  Still, it's only the 13th move and I suppose I don't expect battlefleet to kill me quite as quickly as he does. Lesson: expect and play against the fast efficient play likely from a master!",
        "14. cxd5": "14. cxd5",
        "14... Bxd5": "14. ...Bxd5",
        "15. c4": "15. c4.  white's pawns not terribly impacted by the earlier exchange. ",
        "15... Bb7": "15. ...Bb7",
        "16. Bf3": "bishops face off.",
        "16... Rd7": "16. ...Rd7",
        "17. Rb1": "I begin to see nothing but problems.  And I am going to need my queen to be able to move away from the knight. So...",
        "17... g5": "17. ...g5.  I am picturing his dsb moving back and THEN I'll play Ne4.  But of course...",
        "18. Bxb7": "white clears the way for his queen and black has nothing but problems.  ",
        "18... Rxb7 19. Bg3": "Specifically, this arrangement puts black in a very awkward position, there being no simple way to keep white's N off c6.  Black's N is suddenly in trouble. My head is spinning with ideas of how many moves I'd like to take back, ...not to mention how to solve the problem at hand.  Any initiative I might have found moves further away.  And so...",
        "19... Qd7": "I play this odd looking 19. ...Qd7.  While not pretty, this solves a few problems.  It puts some protection on c6, removing the threat of a Q-R fork, while also keeping protection on b7.  Perhaps I have bought some time to regroup.  Unfortunately... ",
        "20. Qf3": "...white continues improving his position while limiting my options.  ",
        "20... Ne8": "Q can not move back to e7 (and Kg7 invites Be5), so knight retreats.  not bad in some ways, having some influence over the 2nd and 3rd ranks as it does.",
        "21. Rfd1": "21. Rfd1 keeps the pressure on.",
        "21... Qc8": "continues to protect b7.  the start of an attempt to untangle things before it's too late.  but update: it IS too late!",
        "22. Rbc1": "not needed to protect pawn.",
        "22... Na6": "rook had to stay put.  freeing this N will hopefully allow things to open up a bit.  quite a cost to all these moves spent untangling.  no investment in building a strong position.  ",
        "23. Nc6": "oof! here, I think of the line from \"The Perfect Storm,\" ...\"it's not going to let us out.\"  While I had alleviated some of the problems with white playing Nc6, battlefleet makes black suffer with those that remain (queen about to be trapped; rooks still pinned down; unoccupied e7 square still a checking square; jumpoff to e5 for white's N; etc).   ",
        "23... Rd7": "I expect to exchange R+R for R+N, the least damaging scenario I can find.",
        "24. Rxd7 Qxd7 25. Ne5": "but white has an easy way to keep his N.  game is lost.",
        "25... Qd2": "a quick hail mary with a conditional 26. Qxf7+ Kh8 set for battlefleet's convenience.",
        "26. Qxf7+ Kh8 27. Ng6#": "another game beautifully played by a WTW Master.  thank you to battlefleet for playing.  "
    },
    "url": "https://gameknot.com/annotation.pl/walking-the-walk?gm=47634",
    "gameName": "Walking the Walk",
    "players": "battlefleet (2077) vs. hogfysshe (1765)",
    "opening": "Nimzo-Indian (E21), three knights variation"
}