{
    "moves": {
        "1. Nf3": "My third loss out of three \"walking the walk\" club games.  My assessment is that bad moves at 12, 16, and 19 cost me the game.  Sixteen I can live with, though hopefully will not repeat.  But 12 and 19 were careless.  Hopefully I will learn from these mistakes and use these lessons to strengthen my game.",
        "1... Nf6 2. c4": "Reti opening transposes in to English.",
        "2... b6 3. g3 e6 4. Bg2 Bb7 5. O-O Be7 6. Nc3 O-O 7. d4 Ne4 8. Qc2 Nxc3 9. Qxc3": "I am reasonably happy with the opening so far.",
        "9... c5 10. Bf4": "...but, because of what comes after, this move turns out to be problematic.  I did want to free up my queen's rook.  But I should not have put the bishop on f4, the problem being that once black's knight goes to c6 I have poor options for protecting my d-pawn and e5 can become a forking square for black.  Or perhaps I'm overthinking things and pxp would have been good enough.",
        "10... d6 11. Rad1": "I still have not recognized the problem I mentioned earlier.",
        "11... Nc6": "and I still think I am in good shape here.  But, despite considering my next move for some time...",
        "12. e3": "...I make this poor move.  Game losing mistake.  I had considered moving the bishop back but stubbornly thought of how that would represent a wasted move (given that I could have gone to d2 or e3 at move 10).  It did not occur to me that black would play g5 here.  ",
        "12... g5": "But of course he did.  Certainly a loss of more than 1 point value for black to let go of that particular pawn.  Regardless, I am very annoyed with myself, having just played poorly during the opening in my previous wtw game vs ionadowman.  ",
        "13. d5": "Of quite a few options, this seemed ok, ...no worse than an immediate capture of the attacking pawn. And it gave me a bit more time to search for a solution.",
        "13... exd5 14. Nxg5 Bxg5 15. Bxd5": "now to see if I can quickly take advantage of black's king's reduced protection.  Dark square bishop will likely be captured next move.  I'm looking at g1 and g3 as potentially good places to put my rooks (though the rook on the d-file is happy enough for now).  For the moment, despite being down in material, I believe I have a slight mobility advantage.  To free up his N & lsb, I expect black's rook will move to c8 (or poss Q to c7 or d7).  So any mobility advantage will vanish very soon. ",
        "15... Bxf4": "I considered capture with g-pawn here.  but 16. ...Re8 would have given black a good escape route.  What I fail to appreciate is that capturing with the e-pawn removes important protection from d4, which black's N will come to comfortably occupy.  Too much ambition and not enough caution.",
        "16. exf4": "Will white be able to make good use of the open e-file?  Or will there be a trade-off where black comes out ahead?  Can I put a rook on g before black can defend?  In retrospect, I should have captured with the g-pawn, primarily to keep protection on the d4 square.  I'll count this as Major Mistake #2.",
        "16... Nd4": "A nice move by black.  Knight threatens K-Q fork and can sit on d4 a long as it likes.  The momentary mobility advantage I thought I had was a phantom.  As mentioned, I wish I still had a pawn on e3.  Plus, the open file that would have come with 16. gxf4 might have been useful, though it may also have been trouble.  Comments?",
        "17. Rd2": "Protects against fork and may help with eventual rook attack on the black king.  ",
        "17... Bxd5 18. cxd5": "Bishops now off the board.",
        "18... Qd7": "limits white's pawn moves.  and, I see later, sets up Q to h3, ...which I could easily defend against, \"could\" being the operative word!",
        "19. f3": "Should have moved 19. Kg2!  Major Mistake #3.  Too focused on trying to rally an offense, ...neglectful of limiting black's attacking options.  Whatever chance white had of exploiting black's king's \"weakened\" position is now gone.  White will now be on the defensive.",
        "19... Qh3": "black takes advantage of white's poor choice.",
        "20. g4 Rae8": "White has to be very careful as black now has a number tactical possibities.",
        "21. Qd3": "Puts 2x protection on e2. ",
        "21... h5 22. Rg2": "White intends to reduce black's many tactical possibilities by pushing his queen back. ",
        "22... hxg4": "most moves here lose for white.  a tempting move, Rxg4 really only leads to a trade-off of rooks or worse.  attacking the queen loses the attacking rook (by 23. ...Ne2+).  ",
        "23. Kh1": "allows R to go to g3.  still, black's 4 pieces to my 3 doesn't look good.  too bad b4 won't do a thing to knock that horse off his comfortable outpost.",
        "23... Re2": "RxR = QxR#.  Threatening Q = QxR+.  Capturing pawn w/check leads to loss of rook.  PxP = QxQ.  stalhandske's screen name suits him well.",
        "24. Rff2": "ok for a second.  but once black releases pin, white's f-pawn will be attacked 3 times.",
        "24... Re1+ 25. Rf1 Rfe8": "all roads lead to disaster.  black's pieces are extremely well arrayed, either defending or attacking.  Per the club \"Rules\" (play the game out), I'll see if I can do something to improve my situation.",
        "26. Rxg4+": "that pawn was almost as menacing as black's 4 pieces.  it figured in to several mating or capturing scenarios.  still 4 to 3, though.",
        "26... Kf8 27. Rgg1": "no way out.  white will have no defense for 27. ...R8e2.  resigns.  Thank you to stalhandske for the game.  commenters will please advise if there was a way out after 19. f3."
    },
    "url": "https://gameknot.com/annotation.pl/walking-the-walk?gm=41598",
    "gameName": "walking the walk",
    "players": "hogfysshe (1630) vs. stalhandske (2015)",
    "opening": "Reti opening (A05)"
}