{
    "moves": {
        "1. e4": "A Walking The Walk game. Played versus bigpeta with some rules; 10 days per move and unrated game. Although it was at times a good thing to have so much time to think I must admit that it was really too much. I have to thank bigpeta for being so patient with me.",
        "1... e5 2. Nf3 Nc6 3. Bb5": "The Ruy Lopez, one of my favorite openings. Although is quite known it has several variations creating many different kind of games.",
        "3... Qe7": "And that's the example. First time I've seen this variation, named 'Vinogradov variation', so I had to illustrate myself about it and guess what could happen next.",
        "4. O-O": "Prophylaxis applied.",
        "4... Nf6 5. Re1 Qc5": "This was the first move from a strong attack the black pieces started. Quite aggressive in my opinion although defensible.",
        "6. Ba4 Ng4": "At first glance, I wasn't very worried about this attack that I considered too premature but keeping in mind the rating of my opponent and that I was playing a variation a didn't know I thought I should be prepare for anything.",
        "7. Qe2 Nd4 8. Nxd4 Qxd4": "I could guess the two moves made before but, after the exchange, I had to admit to bigpeta that I didn't know the best continuation. I saw to possibilities: exchange my bishop for his knight (I lose a bishop against a knight, something quite normal in this opening but only when you keep the initiative. In this case I had lost the initiative and could end up in an endgame with an open position with knight-bishop against two bishops) or protect my bishop either with Bb3 or Nc3, and here is where I had problems. Fortunately, bigpeta took this game as a masterclass and helped me to take a decision with some useful tips. Thanks bigpeta.",
        "9. Nc3": "Finally, I decided to play Nc3 (following one of the posibilities bigpeta gave me). Keeps the bishop pinning the d7 pawn and develope a piece. The draback, in my oppinion is that disallow the c3 move, just in case the white bishop need the c2 square, and also could helped for a posible d4 in the future.",
        "9... Bc5": "Logical move to keep the threat.",
        "10. Rf1": "I saw no other defence.",
        "10... Nf6": "Good! I seemed the storm went over and I could breath for a while.",
        "11. d3": "Releasing the path to the BSB.",
        "11... Qd6": "Here I had another of those moments where I didn't know what to do. Two possible moves came to my mind: Be3 offering the bishop exchange and Bg5 to put pressure over the black king side. Black doesn't necessarily have to accept the exchange and, thinking that the black king will probably castle short, I thought Bg5 would work better.",
        "12. Bg5 c6": "Possibly preparing b5 to get rid of the bishop on a4 or d4 once the queen goes out of d6.",
        "13. Be3": "Really bad move. Not for the move itself but because this suppose moving the same piece twice consecutively, and in the opening. Furthermore, this means a change in the strategy first thought.",
        "13... O-O": "No comments!",
        "14. Kh1": "This move is part of my plan (the one that made me turn my bishop back). I was preparing f4 and I didn't want my bishop pinned just in case exf4 happens and I decided to take with that bishop. My idea was to start an attack with the rooks opening the f column, bring the bishop on a4 back to the game moving it to b3 putting pressure over the a2-g8 diagonal (taking advantage of the problem in developing the black LSB).",
        "14... Bxe3 15. Qxe3": "Not just what I really wanted according to my plan. I think I should have taken with the pawn. It would have opened the f column and that pawn could help in a possible d4. Instead, I thought the queen should leave the e2 square for the knight because f4 is still possible.",
        "15... a5 16. Bb3": "It was quite clear to me that the bishop should go out of there and look for a better position.",
        "16... Qd4": "A queen exchange that helps black pieces to play d5, getting more control of the centre and releasing the path for the LSB.",
        "17. Qg3": "I didn't want a queen exchange yet. But I think d2 would have been much better move, useful to play f4 and still allow Ne2. Maybe a4 would be the best option here but at the risk of allowing the queen exchange.",
        "17... a4": "That's why a4 would have been better.",
        "18. Nxa4 Rxa4 19. c3 Qa7 20. Bxa4 Qxa4": "After those changes I thought that keeping the two rooks was a good idea. Mainly because of the bad black LSB position.",
        "21. Qxe5 Qc2": "A really didn't see that simple move! But, of course, I shouldn't think that an expert player will let me take a pawn for nothing.",
        "22. f3": "Trying to protect the e4 pawn just in case Qd3. What I didn't see is that it would be better to protect the b2 pawn for the pawn structure than let the a2 pawn isolated.",
        "22... Qxb2 23. Qd4": "I was looking for a better position of the queen, avoiding the obvious Re8.",
        "23... Re8 24. a4": "I thought the best way to use that isolated pawn was to advance it, thinking in a possible exchange to open the column. But I still didn't realise about a huge problem that I didn't see when I exchanged my pieces for the rook ...",
        "24... h6 25. Rfb1": "Trying to get the queen out of there.",
        "25... Qd2 26. c4 Nh7": "Preparing f5 to open the e column for its rook.",
        "27. Rb2 Qf4 28. Qf2 Nf8": "Tha was the beginning of a set of maniouvers for the knight.",
        "29. Qd2": "Now, it was me whoe were looking for the queen exchange.",
        "29... Qc7 30. d4": "Black was trying to play d6 o d5 to release its bishop. So, I thought that creating a pawn line would be a good idea.",
        "30... d6 31. d5": "Bad move! I didn't see the holes at c5 and e5 for the knight, which will be a real nightmare for the rest of the game!",
        "31... Nd7 32. a5": "Here I saw the problem with Nc5 but it was to late to avoid it. So, I thought the pawn would be better on a5 disallowing a possible move for the b pawn. The black LSB can't go anywhere for the moment and I wanted to be this way as long as possible.",
        "32... cxd5 33. cxd5 Nc5 34. Qc2": "Trying to keep the knight quiet. As I could see later it wasn't in its mind to move from there ...",
        "34... Re5": "Preparing f5.",
        "35. Rb4 f5 36. h3": "To protect the g4 square from the bishop in case of fxe4, fxe4.",
        "36... fxe4 37. fxe4 Bd7 38. Ra3": "At that point I knew to things: I couldn't use the a5 pawn the way I thought, and my e4 pawn was in danger. My problem, I'm not very keen managing the rooks ...",
        "38... Be8 39. Qb1": "At that point white has not much to do but trying to resist the they can. No way to get advantage of they to rooks (too busy protecting pawns) and a very week e4-d5 pawns.",
        "39... Bg6 40. a6": "Thinking in breaking a hole even losing a pawn.",
        "40... bxa6 41. Rb8+ Kh7 42. Qb6": "A desperate attack. I knew my e4 pawn was lost and the d5 pawn will came afterwards.",
        "42... Qe7 43. Qd8 Bxe4 44. Qxe7": "I thought that without the queens I could stay a little bit more. But really this is the end of the story.",
        "44... Rxe7 45. Rd8 Nb7 46. Rc8 Bxd5": "And white resigns. Thanks again bigpeta."
    },
    "url": "https://gameknot.com/annotation.pl/walking-the-talk?gm=45636",
    "gameName": "walking the talk",
    "players": "marvin2 (1655) vs. bigpeta (2101)",
    "opening": "Ruy Lopez (C60), Vinogradov variation"
}