{
    "moves": {
        "1. e4 e5 2. f4 exf4": "The KGA is brought to you by Crush soda. Remember when you are in a rush, you need a Crush (soda).",
        "3. Bc4": "I have started playing 3 Bc4 exclusively. I don't like 3. Nf3 because we'd be in the database for 15 moves. I'd rather the database be all my games and my opponent's think, \"What have I done?!\"",
        "3... Nf6": "What I consider as the best response.",
        "4. Nc3": "Don't worry pawn I still need you.",
        "4... Nc6": "This is unorthodox to say the least. I already started thinking of all the bad things I'm about to do. I like c6 as a move more.",
        "5. Nf3 d6": "I was once told that, if someone played a Fischer d6 move in the 3. Bc4 lines it's a bad idea, but there are always exceptions. This isn't the exception. Bb4 or Na5 are more accurate.",
        "6. d4": "I love having the center with no resistance against me. Black must be accepting my reign as king.",
        "6... Nh5": "Protecting the pawn, but what protects you?",
        "7. O-O Bg4": "I think 7. ...g6 was the best move here.and I might go as far as saying this moves a blunder. It looks nice, but the bishop gets scared easy.",
        "8. h3": "Run you sniper. You can't fight hand to hand.",
        "8... Bd7 9. Nd5": "e5 or Nd5 was my choices here in my mind. I like this move more just because the N that starts on b1 is never a part of the attack and get's lonely. Seriously though, I have complete control of the center and nothing to deter me from making these moves, so I happily take them.",
        "9... Be7": "Be6 seemed to be the only move to me here. Not sure why we are avoiding tactics against a KGA. It's asking for trouble.",
        "10. Ng5": "Ok so here was my plan with this move. I had decided that I had enough pieces on the kingside, but I needed to take away my opponent's key pieces on the kingside. And here comes the boom.",
        "10... Bxg5": "only move.",
        "11. Qxh5": "Only move",
        "11... O-O": "Only Move",
        "12. Bxf4": "ONLY MOVE!",
        "12... Bxf4": "Ok so this is a blunder (not the only move did I trick you?), but I don't blame her for not seeing the attack. It's a pretty cool one. h6, Bh4 Be7 are some of the better moves.",
        "13. Rxf4": "Just look at this position. Of the 16 middle squares I have pieces in 5 of them, and I technically control all the ones behind my pieces. I could claim I have control of 12 or 13 of the most important squares. That's a big deal folks.",
        "13... h6": "It didn't matter here my next move was coming no matter what pretty much.",
        "14. Nf6+": "Can't take with the pawn or it's checkmate in 4 moves. 14. ... gxf6 15. Qg6+ kh8 16. Qxh6+ Kg8 17. Rh4 ? 18. Qh8++ and taking with the queen loses a Q and a lot more.",
        "14... Kh8 15. Bxf7": "15. ...Ne7 16. Rae1 Bc8 17. Rh4 Nf5 18. Qg6 and it is game over.\n\nThanks for reading. Feel free to comment and rate."
    },
    "url": "https://gameknot.com/annotation.pl/walking-the-walk-and-learning-to-run-mt-part-4?gm=48320",
    "gameName": "Walking the Walk and Learning to Run MT Part 4",
    "players": "myevilluck (2131) vs. jstevens1 (1941)",
    "opening": "KGA (C33), bishop's gambit, Bogolyubov variation"
}