{
    "moves": {
        "1. d4 c5": "Start guessing the move!",
        "2. d5": "Well done if you got 2. d5! 1.....c5 is an inferior way of playing the Benoni Defence. 1. d4 Nf3 2. c4 c5 is better as, compared to the game continuation, White has made a non-developing pawn move(2. c4). White has the c4 square for a Knight or Bishop and is also able to play Bb5+ at some stage. 2. d5 is the most aggressive way of playing for White, so nothing for anything else.",
        "2... d6": "Guess the move!",
        "3. Nc3": "Well done if you found this! I will also give a point for 3. e4 which will transpose.",
        "3... Nf6": "Guess the move!",
        "4. e4": "There was a big hint last time! I will also give a point for Nf3",
        "4... e6": "Guess!",
        "5. Bb5+": "I wanted to capture on e6 without allowing his Bishop to recapture.",
        "5... Bd7": "Guess",
        "6. dxe6": "Big clue last move. Nothing for anything else.",
        "6... fxe6": "Guess",
        "7. Bc4": "Nothing for anything else. White has a space advantage, wants to prevent Black playing d5. If Black can be induced to play e5, he is very weak on the a2-g8 diagonal. ",
        "7... a6": "Guess",
        "8. a4": "White doesn't want the Bc4 knocked of the wonderful a2-g8 diagonal",
        "8... Nc6": "guess",
        "9. Nf3": "White continues his development and stops Black from playing Nd5.",
        "9... Be7": "Guess",
        "10. Bf4": "A point for 0-0 also. White attacks d6, hoping to induce e5",
        "10... Na5": "Guess",
        "11. Ba2": "I think the Bishop belongs on this diagonal, so nothing for anything else.",
        "11... Qc7": "Guess",
        "12. e5": "White wants to disrupt Black's development. Given time Black can block out the Ba2 with c4",
        "12... dxe5": "Guess",
        "13. Nxe5": "Far superior to Bxe5. I think White has to win at least a pawn now.",
        "13... Bd6 14. Nxd7": "I think Black has chosen the best way forward.",
        "14... Bxf4": "Guess",
        "15. Nxf6+": "Yes, pretty obvious!",
        "15... gxf6": "Guess",
        "16. Bxe6": "And so White wins the pawn, keeps his white squared Bishop in the game, and stops Black from castling.",
        "16... Qe5+": "Guess",
        "17. Qe2": "Yes, the only move!",
        "17... Rd8": "Guess",
        "18. Rd1": "Computer prefers Bd5, so a point for that move too",
        "18... Rxd1+": "Knight or King?",
        "19. Nxd1": "Computer analysis prefers the King move, and I tend to agree now, so nothing for the Knight recapture I played and a point for the King recapture.",
        "19... Ke7": "What now?",
        "20. Bd5": "Computer analysis prefers Qxe5, and now I tend to agree, so a point for that also.",
        "20... Rd8": "and now?",
        "21. Nc3": "Qxe5 is still stronger. While I was looking at this position, I realised that Bc1 now was quite strong for Black. Luckily he didn't play it!",
        "21... Nc6": "your move",
        "22. Qxe5+": "You have had enough warning!",
        "22... Bxe5": "and now?",
        "23. Bxc6": "Computer also likes Be4 so a point for that too.",
        "23... bxc6": "and now?",
        "24. O-O": "Computer actually prefers Nd1, and I think it is better, so nothing for 0-0 and a point for Nd1. Now, again, as I saw when I was waiting for him to move, Black should play Rb8 with equality. Luckily for me, he went in to another variation, which looks pretty good, but isn't!",
        "24... Rd2": "rook to the 7th rank - usually good, but not the best here!",
        "25. Rc1": "Forced, but I will still give you a point!",
        "25... Bd4": "and now?",
        "26. Nd1": "forced again, but again a point!",
        "26... Be5": "and now?",
        "27. g3": "the start of a plan to block out his Bishop by putting most of my pawns on black squares",
        "27... Ke6": "and now?",
        "28. Kf1": "and another part of the plan is to drive the rook from the 7th rank!",
        "28... Kf5 29. Ke1": "You had warning last move. Computer prefers Ne3+ so a point for that too.",
        "29... Rd8": "so the rook has been driven back. And now?",
        "30. Ne3+": "you did have a hint! If now Ke4 I play Ke2 and his king is in big trouble!",
        "30... Ke6": "so he retreats",
        "31. c3": "Further restricting his Bishop. Computer prefers Nc4 so a point for that too.",
        "31... Bc7": "I'm not sure of the point of this move!",
        "32. Rd1": "Yes! when materially up, exchange pieces but not pawns.",
        "32... Ke5 33. Rxd8": "Yes, big hint last move!",
        "33... Bxd8": "and now?",
        "34. Ke2": "Yep! King up for the endgame!",
        "34... f5": "and now?",
        "35. Nc4+": "computer prefers Kd3 so a point for that too.",
        "35... Kd5": "I think you know what to do now!",
        "36. Kd3": "Further enhancing my King and restricting his....",
        "36... Bf6": "round about here, he turned the clocks back. I wondered whether he really needed to bother....",
        "37. f4": "More restriction for his King and Bishop!",
        "37... h5": "perhaps an attempt by him to exchange a king side pawn?",
        "38. Ne3+": "Finally driving his King back",
        "38... Ke6": "he had to go to e6 to maintain his pawn on f5",
        "39. Kc4": "yes, his c5 pawn is now a target",
        "39... Be7": "the only way to avoid the loss of a pawn.",
        "40. Ng2": "Preventing Black from playing h4, and preparing a winning manoeuvre.",
        "40... Bd6": "He has nothing better.",
        "41. Ne1": "Continuing the plan.",
        "41... Be7": "Black just has to wait for the execution",
        "42. Nd3": "The c5 pawn is a goner now.",
        "42... Kd7": "The King hurries to defend the other Queenside pawns",
        "43. Nxc5+": "Of course!",
        "43... Bxc5": "Black probably hurries towards the end of the game with this exchange, but otherwise the a6 pawn goes too",
        "44. Kxc5": "naturally",
        "44... Kc7": "he could resign here",
        "45. a5": "Further restriction",
        "45... Kb7": "and now?",
        "46. Kd6": "And Black finally resigned. OK, thanks for taking part. Leave your score as a comment, (be honest now!). Don't forget to rate this annotation!"
    },
    "url": "https://gameknot.com/annotation.pl/wallasey4vpen-y-ffordd1bd5?gm=37775",
    "gameName": "Wallasey4vPen-y-ffordd1Bd5",
    "players": "Charles Higgie  vs. Graham Heath (BCF109)",
    "opening": "Old Benoni (A43), Schmid's system"
}