{
    "moves": {
        "1. e4 c5": "I had started playing this opening since a few years without actually studying it very well, but so far, my results have not changed much.",
        "2. g3 Nc6 3. Bg2": "White has chosen a somewhat weird plan in my opinion. But perhaps a big assault can be made from this spot by white.",
        "3... d6 4. f4 g6 5. Nh3": "This move is clearly too slow. Either he moves his knight to g5, which will waste time, since it can easily be chased away or it moves to f2, where it effectively does nothing",
        "5... Bg7 6. Nf2 Nf6": "I'm almost done developing my pieces and white's queen side is still at the starting position. This cannot end well!",
        "7. Nc3 h5": "This move essentially surrenders the kingside castling while attempting to attack the only part of the board that has somewhat developed.",
        "8. d3 Nd4": "Why not? Nc3 and e4 have made this square an important one for black to have, since there are no pawns that can immediately chase off pieces.",
        "9. O-O": "This is already the decisive mistake. If anything, h5 is a clear message that the kingside is going to be attacked. Moving your king there voluntarily is equal to suicide.",
        "9... h4 10. g4 h3 11. Bxh3": "Oh, dear",
        "11... Rxh3": "White can't take back because 12. Nxh3 Bxg4! and white can't defend the knight because his queen is attacked. For example 13. Qd2 Bxh3 14. Rf2 (14. Re1? Nf3+!) Ng4 and white will be a full piece behind and a horrible kingside to boot.",
        "12. e5": "A desperate attempt by white to complicate matters and probably the best move",
        "12... dxe5 13. fxe5 Rh4": "Best place to continue pressing on the 2 weak points in the king side.",
        "14. exf6 Qd6": "White can't take the bishop because of Qxh2. 15. h3 fails due to Qg3+ 16. Kh1 Nf3 17. Qxf3 (17. Bf4 Rxh3+ 18. Nxh3 Qxh3+ 19. Bh2 Qxh2 mate or 17.any move and Qh2 mate) Qxf3+ and the bishop takes on f6 to take away any chance for white to complicate matters.",
        "15. Nh3": "An ugly move, but it's the only move to defend h2",
        "15... Rxh3 16. Bf4 Qxf6": "If white were allowed to play fxg7, then that pawn could not be stopped from promoting to a queen, so it's time to put an end to that threat while consolidating the piece advantage.",
        "17. Nd5 Qc6": "This moves sacrifices the rook on a8, but since there is a destructive kingside attack and the rook on a8 is not part of it, it will not be missed. Note that both rooks have been offered to white in just the first 17 moves!",
        "18. Nc7+ Kf8": "White has no real threats against the black king, so it's not a big loss that black cannot castle anymore.",
        "19. Nxa8": "With this move, white (although ahead in material) acknowledges defeat.",
        "19... Nf3+": "This move destroys any hope white may have. I was hoping for 20. Kg2, because it allows the beautiful combination 20. Kg2 Nh4!+ 21. Kxh3 Qg2!+ 22. Kxh4 Bf6 23. Bg5 Qxh2 mate or 23. g5 Qh3 (using the bishop, which despite never moving from c8 is essential for mate!)",
        "20. Rxf3 Rxf3": "Not with the queen, because trading off queens will stop the kingside attack. Note how all of black's pieces are right where they need to be or can be there in one move, while the knight on a8 and the rook on a1 are completely out of play.",
        "21. Bd2 Bd4+ 22. Kg2": "22. Kh1 Rf1 mate.",
        "22... Rf2+ 23. Kh3 Qg2+ 24. Kh4 Qxh2+ 25. Kg5 Bf6#": "1001 ways to finish the game, but this was the fastest."
    },
    "url": "https://gameknot.com/annotation.pl/wanton-destruction?gm=31479",
    "gameName": "Wanton destruction",
    "players": "A. D. (1807) vs. bewxdarkone (1764)",
    "opening": "Sicilian (B20), Steinitz variation"
}