{
    "moves": {
        "1. e4": "Hello those who like to follow annotated games I'm hoping to get good comments on this one.",
        "1... e5": "in my passed annotations i started at 1350 elo and ive been steadily climbing with some bumps here and there, and as i climb i always like facing tougher opponents.  this is my third opponent in the 1700 range since my return and this also happens to be a revenge match in a tourny we are playing together,",
        "2. Bc4": "my classic LSB exit,  This was our 2nd game where i lost the first after playing 43 moves even and then just straight out blundering to lose,",
        "2... Nf6": "the nf6 i face most often",
        "3. Nc3": "previously i went d3 here but i had annotated i prefer to go nc3 when the opponent goes nc6 and we will get to see why, i told myself im coming out hard vs this guy and making it a pawn war and i will not be looking for a checkmate early unless some blunderous option appears.",
        "3... Bc5": "and like i previously noted ive learnt the blacks like to park their DSB on c5 so i dont need to do a2 that i love to do lol,",
        "4. Nge2": "and my response to this is ne2 with a quick d4 depending on what my opponent plays next",
        "4... b6": "oppurtunity appears for d4 i love it",
        "5. d4 Bxd4": "curiously he decides to swap out his DSB this is the scenario i prefer when i play d4",
        "6. Nxd4": "natural replies ensue",
        "6... exd4 7. Qxd4 Bb7": "i saw the fianchetto coming this delighted me cause some nice antics are coming",
        "8. e5": "if he retreats back to the backline he delays his castling  and its what i sometimes expect. when they go to h5 is when i love it",
        "8... Nh5": "he went to h5 perfect!",
        "9. Qg4": "force the pawn development and then i can develop my DSB",
        "9... g6 10. Bg5": "attack on the queen unless he wants to lose pieces he has to move her to c8",
        "10... Qc8 11. Bh6": "and i prevent his castling getting ready to castle myself i was maybe looking to queen side castle,  i like the set up i have at the moment and hence why i like to play d4 if allowed over d3 early on, it can offer many antics and a fun game, but this is far from over my opponent will not lie down and just surrender politely",
        "11... Nc6": "unexpected reply sorta even if he doesnt really have many other choices. but i didnt think he would block his LSB,\n\nhes now attacking my beacon of hope pawn i must defend him",
        "12. Qe4 Ne7": "i can see hes heading for my DSB i see this as a opening to get a pawn up high and disrupt his castle still if he goes as planned",
        "13. Nd5": "cant let my queen die and i have to hold on to my LSB longer than my knight if he decides to swap out his LSB",
        "13... Nf5": "i can see hes going for my dsb i will let him take it as planned",
        "14. g4": "so i attack both knight to equalize",
        "14... Nxh6 15. gxh5 Nf5": "here i wonder if it wouldve been better for him to take my pawn but it played into what i wanted",
        "16. Nf6+ Ke7 17. Bd5 c6": "he didnt want to swap out with my queen so high with a knight and pawn close to his king",
        "18. Bb3": "i didnt want him to possibly expand another pawn to b5 and it costing me another bishop move so i thought moving him here was wiser",
        "18... b5": "ah ha! the b5!",
        "19. O-O-O": "i can finally queen side castle at this stage i was still surprised my pawn on h5 was still standing",
        "19... Rd8": "hes playing highly defensively i loves this move and saw it as an oppurtunity to grab a pawn",
        "20. Nxh7 c5": "he decides to try to budge my queen i will offer lsb exchange to maintain a high guard lol",
        "21. Bd5 Rb8": "hes forced to reinforce the lsb or swap them out, he opted to reinforce it",
        "22. h6": "here i decided to pass my pawn it was safe, if he takes it with knight i queen check on h4 and he would find himself in a difficult position",
        "22... Bxd5": "he finally decides to swap out LSB's, i guess it was to relieve pressure",
        "23. Qxd5": "here if he takes my pawn with his knight i believe its checkmate with 23... nxh6, 24 Qd6+, ke8 24, Qf8# i guess my opponent considered this and tried to see if i would trade out queens or possibly push mine away.",
        "23... Qc6": "this delighted me i needed my queen do be on a dark square. and to keep covering that pawn now on h6",
        "24. Qd2": "i think this reply really froze my opponent cause of the possible queen check on g5",
        "24... Ke8": "this move i think he did to try to relieve stress but it delighted me cause it was either wasted time and i could move my pawn higher and maybe he will make a mistake and block it off with his king ",
        "25. Nf6+": "get the check ",
        "25... Ke7": "he comes back to his previous state",
        "26. h7": "and now its getting dangerous for him. i can definately count one of his rooks as pinned behind that pawn for a while i have to start looking for simplification to head into end game.",
        "26... Rdh8": "and he seals that rooks fate for a while. but looking at the board and the fact i control the open lanes i can see i will be able to get a queen but it will be difficult.\n",
        "27. Qxd7+": "my opponent went on vacation as i played this move looking to simplify into end game.  i think there were some nice lines to be played if i took with the knight though (i analysed during the week he was away lol). i did not want to give me opponent time to recover though. i felt i had been controlling tempo all game long and wanted to keep doing so",
        "27... Qxd7": "forced to swap out queens. i looked to retake with the rook but then i looked farther down the line and if i want to be able to queen safely i have to bring my king over to the right side of my D file rook, so double stacking now would not be wise cause of that knight could come down and be very dangerous. ",
        "28. Nxd7": "i decided to take with knight to force him to play his rook or i was hoping he would take my pawn lol in a rook sacrifice ",
        "28... Rbc8": "hmm un anticipated reply. i thought he would go to d8",
        "29. Nf6": "have to reprotect my pawn",
        "29... Ke6 30. f4": "reinforce with pawn because i do not want to pin one of my rooks behind the e pawn  and since i didnt send my rook to d7 earlier i can still prevent his knight from coming down and place himself in a good position",
        "30... a5": "he decides to start crunching my king. i forsaw this and hence why i need to get my king to the other side",
        "31. Rd7": "decide to block off the path so my king can pass. if he offers his rook ill trade out and get kicked to the other side on his recapture",
        "31... Nd4 32. Re1": "i dont want him to take my f pawn and if he goes to f3 i can double stack ",
        "32... a4 33. c3": "invited him to go to f3 but to my surprise he retreated back",
        "33... Nf5 34. Kd2": "time to pass my king, now im controlling all the exits to his knight too. this game had been very thoughtful. my opponent would play 1-3 moves max a day i had to keep staying atleast 5-8 moves ahead",
        "34... Rcd8": "he offers the anticipated rook exchange",
        "35. Rxd8 Rxd8+ 36. Ke2": "and kicks my king across on the recapture i was happy. but it still wasnt over.",
        "36... Rh8": "hes forced to back to h8 or else i play ng8 and he cant prevent queen",
        "37. Rd1": "i had seen i could get my queen when we still both had our queens, i could see it would be an even trade in material but i would rather have a queen vs a rook and knight end game and focus moving only 2 pieces, queen and king",
        "37... b4": "hmmm im curious if he thinks i will take. id rather he take c3 and i recapture blocking off both his pawns or that he moves forward and i play a3 in reply. since i plan on getting a queen id rather not let any of his pawns have a chance to pass.",
        "38. Rd8": "force to exchanges to get my queen",
        "38... Rxd8": "natural replies. maybe there was something else he could do left side. i didnt look into it but i thought this is how it would play out for the next 3 moves",
        "39. Ng8 Ne7 40. h8=Q Nxg8": "cant obviously do a check on f6 he recaptures with knight,",
        "41. Qh3+ Ke7 42. c4": "and deny the passing for the pawns, I thought this choke point would make it alot harder for his rook to get by",
        "42... Kf8": "he has to gain space to get his knight back into play. i plan on getting my queen back over the pawn line",
        "43. Qe3 Rc8": "force him to defend his pawn",
        "44. Qd3": "take control of the file and i can now get my queen up there",
        "44... Ne7": "anticipated reply",
        "45. Qd7": "and here comes the queen!",
        "45... Re8": "hmmm this move really delighted me i anticipated him to go to a8 and had planned many different responses to that affect lol. i was happy he left a pawn hanging",
        "46. Qxa4 Nf5 47. Kf3": "decided to try to get my king to the right side as a time controller. i have to be careful if i go after his d5 pawn or when i attack with a3 and he replies with b3, i can see hes setting up a fork on d4 with his knight when my queen would be on b3 after taking his pawn",
        "47... Rd8": "here i saw i have a dangerous checkmate on myself if im not careful with my king and place him too high like the g4 square",
        "48. a3": "go on with my attack",
        "48... b3": "anticipated reply",
        "49. Qa5": "i decide to attack his c5 pawn i had seen his fork attempt!",
        "49... Rc8": "he reinforces and it prevented any schemes on my king i was happy. this fight i looking better and better as the moves go by, but winning 3 points has taken me almost 50 moves!",
        "50. Kf2": "decide to relieve fork stresses on my king i plan on running up my a pawn and i can see he will come for it with his knight. so i play ahead and see i can give him my A pawn and will be able to get his b and c pawns in return.",
        "50... Nd4": "gets his knight closer to the action and defends his b pawn",
        "51. Qa6": "i attack his rook to get my queen in a spot thats farther from my king. that knight is scaring me lol",
        "51... Rc6": "anticipated reply defended by knight",
        "52. Qb7": "and i get my queen out of the A file pawns way",
        "52... Ke8": "he doesnt have many choices of moves at this stage. hes congested his knight into protecting his rook and pawn so that piece is now sleeping ",
        "53. Kg3": "i decided to bring his king back or else my king will be able to eat his pawns",
        "53... Kf8": "and he pulls his king back",
        "54. Kg4 Kg7 55. a4": "time to climb the A file",
        "55... Re6": "i had seen this scenario earlier and having placed my queen on b7 this is his only playable square for his rook",
        "56. a5 Nc6": "his knight reply to come after the A pawn and i will get my 2 pawns for 1",
        "57. Qxb3 Nxa5 58. Qb5 Nc6 59. Qxc5 Ne7": "now i was proud with myself this looked almost in the bag, but not time to blunder like last game",
        "60. b4": "off to the races!",
        "60... Nf5": "i looked at the e3 check my queen was safe so was my e pawn if i dont move my queen",
        "61. b5 Nh6+": "hmm unanticipated reply this is ok. he brought his knight away and i can just focus left side now",
        "62. Kh3": "so i decide to place my king in a place where he cant check him with his knight again",
        "62... Ng8": "after this reply i took a long time to calculate something.  and after playing what i think every possible play through due to his knight and kings position i thought this next move to be epic!",
        "63. Qd6": "bam! if he takes my queen with his rook he cannot stop me from re queening.   my opponent played 1-3 moves a day with easily 1 hour to 5 hours Minimum between each move, although here he played within 3 minutes of me playing this",
        "63... Rxd6": "i was like wow the only move i dont think he thought through of the entire game was the winning one,\n\nwas this a real sacrifice this time Ion? hehe",
        "64. exd6 Nf6": "he plays the next 2-3 moves still i told him i think i calculated my queen sacrifice properly",
        "65. c5": "there is a very important order to the pawn movements here. it would take forever to type it all out its fun to explore to see if you can queen as black and prevent it as white.",
        "65... Kf8 66. c6 Ke8 67. b6": "and after this state of game my opponent realised it was impossible for him to prevent queen and resigned.\n\nthis had been a great revenge match to make it 1-1 in the tournament and i hope you all enjoyed the game. all Comments appreciated!"
    },
    "url": "https://gameknot.com/annotation.pl/war-of-attrition-queen-sacrifice-to-win-comments-appreciated?gm=58751",
    "gameName": "War of Attrition (Queen sacrifice to win) comments appreciated.",
    "players": "trixstermtl (1500) vs. peter_perf (1657)",
    "opening": "Bishop's opening (C24), Berlin defence"
}