{
    "moves": {
        "1. d4 Nf6 2. c4 e5": "Testing the Budapest.",
        "3. dxe5 Bb4+": "Something has to block the check. ",
        "4. Bd2 Bxd2+ 5. Nxd2": "If Qxd2, Ng4 all the same. But it was better for white. ",
        "5... Ng4 6. h3": "It comes to mind Qh4 (pinning the pawn to the rook). I didn't because of g3. In that case, to mantain the pin will cost several tempos to black, and I won't get much (by experience). ",
        "6... Nxe5": "f4 is disastrous for white, so this seems safe. ",
        "7. e3 d5": "Uff, just a \"shot in the dark\". I should have castled first. ",
        "8. Ngf3": "Any attempt to defend the knight seems to fail, and NxN just helps him, so...",
        "8... Nxc4": "...aware of QxQ+ to come. ",
        "9. Nxc4 dxc4 10. Qxd8+ Kxd8 11. O-O-O+ Ke7": "This because there are no queens on the board, an white misses his dsb. ",
        "12. Bxc4 Nc6 13. Ng5": "Foreseen. ",
        "13... f6": "Now, Nd7 will just lose the knight. Black's position is not all too bad (white is still better). ",
        "14. Ne4": "I have to play with great care, stopping the \"holes\" everywhere in my position. If Bf5, Nc5. ",
        "14... Ne5 15. Bb3": "Now I have a shadow of a grimp on d3. I'll try to exploit this. ",
        "15... Bf5 16. Nc5 b6": "The knight has to retreat, \"losing\" control of d3. ",
        "17. Na6 Nd3+ 18. Rxd3": "Very well, since if white allows Nxf2, Nxc7 is not a match, because of the opening of the c column...",
        "18... Bxd3": "Now the position is not too unbalanced. White has to fight with an exchange down...",
        "19. Nb4 Be4 20. f3 Bb7": "It was tempting to keep the diagonal, but after e4 it will be closed all the same. ",
        "21. e4 c6": "I have to control the white pieces. And I don't have to exchange the lsb, if possible. ",
        "22. Re1": "Preparing e5. This gives me a tempo, since is only half dangerous (Kxf6 is possible provided the rook can't penetrate). ",
        "22... a5": "Go back. ",
        "23. Nd3 a4": "Just to remove the bishop from the diagonal.",
        "24. Bc2": "Not inmediately b5, because of Nc5. \"Be patient...\"",
        "24... Rhd8": "Preparing to activate my last piece. ",
        "25. e5": "There are 3 ways to react: to take, to advance and to wait. ",
        "25... Ba6": "White's best piece is now a headache. ",
        "26. Nf4": "Good (I would have played Nb4, but Bc4 would be the answer). White's weakness will be felt soon. ",
        "26... a3": "Just \"crazy\". I wanted to disrupt white's pawns, so I can take them later. ",
        "27. b3": "Ok, but this gets the king into a cage. ",
        "27... Rd4": "This was not the best move, for sure. ",
        "28. exf6+ Kxf6 29. Nh5+": "Yes, ok. And the h pawn is hanging, I know. ",
        "29... Kf7 30. Ng3 g6": "I could have given the h pawn. I have something on the queenside. ",
        "31. Ne4 Rd5": "Just controlling the knight. ",
        "32. b4": "!? Not a good choice, since it opens the way for my lsb to c4. ",
        "32... Bc4": "If Bb3, BxB, and my a pawn becomes a serious threat. ",
        "33. b5": "Using the same tactic, but it won't work, now. ",
        "33... cxb5": "Opening the column. I'm winning, I can feel it. ",
        "34. Nc3 Rc5": "Better and better. I have a rook on the right column, now...",
        "35. Ne4 Rc6": "...and still I have it. Bxa2 is deadly. But white has other plans. ",
        "36. Ng5+": "I just can't allow Nxh2+, so...",
        "36... Kg7": "...aware of the rook penetration. But if I can survive this, my force on c will prevail. ",
        "37. Re7+": "The \"trick\" is that white... cant' attack h2 with the bishop. ",
        "37... Kh6": "...I can allow myself this. ",
        "38. h4": "Threatening mate in one, but better would have been Nxh7. ",
        "38... Bg8": "Et voilà, white's attack is stopped. ",
        "39. Kb1": "Bxa2+, Kxa2, RxB, ok, but then... I'll lose the rook or the a pawn. But the right attack (IMO) is...",
        "39... Rac8": "Of course, forcing white to defend (if the bishop moves, Rc1# - I like my pawn!.... Re2, only one, but then Bxa2 becomes possible. White lost by timeout. I think white is lost, but... what do you think?"
    },
    "url": "https://gameknot.com/annotation.pl/was-it-a-win?gm=53948",
    "gameName": "Was it a win?",
    "players": "player (2000) vs. damalfi ",
    "opening": "Budapest (A51), Fajarowicz variation"
}