{
    "moves": {
        "1. d4 d5 2. c4": "Queen's Gambit. Black's main options are to either take the gambit pawn (Queen's Gambit Accepted or QGA), 2)...e6 (Queen's Gambit Declined or QGD) or 2)...c6 (The Slav Defense ",
        "2... c6 3. Nf3 e6": "This gets into a Semi-Slav, which is a very common defense to the Queen's Gambit",
        "4. Nc3 h6": "This move is merely a waste of time, and black should have been looking to carry out his plans, namely developing his knight on g1, taking on c4 after I develop my LSB, playing b5, and maybe something like Bb7 and then later on c6-c5 to open up the light square diagonal. It is clear from this move that Black has no plan, and is simply waiting to react to my moves, which is a terrible way to start out a game.",
        "5. e4": "Since my opponent doesn't want to accomplish anything, I can play strong center moves like this.",
        "5... dxe4 6. Nxe4 Be7 7. Bd3 Nf6 8. O-O Nxe4 9. Bxe4 Bf6": "I guess this attacks d4, but that pawn is well established and defended by my pieces, and now he's moved his DSB twice, wasting yet another vital tempo",
        "10. Bf4 Nd7 11. Re1 Nb6": "Not necessarily a waste of tempo since this attacks the undefended c4 pawn, but Black really needs to focus on castling and establishing pawn breaks to undermine my center at this point.",
        "12. Rc1 Bd7 13. Qb3": "Usually it is a good idea to play Qb3 as white after black has moved his LSB in Queen's Gambit type openings/midgames, as this queen now puts a lot of pressure indirectly on both the center and the undefended b7 pawn.",
        "13... O-O 14. c5": "Ousting that impediment between my queen and that tasty b7 pawn",
        "14... Nd5 15. Bd6 Be7 16. Bxd5 cxd5": "I liked Bxd6 a bit better, but black is starting to falter in either case",
        "17. Bxe7 Qxe7 18. Qxb7 Rfb8 19. Qxd5": "Taking advantage of the x-ray on e6",
        "19... exd5 20. Rxe7 Be6": "White is 2 pawns up and has a rook on the 7th rank on the only fully open file, things are looking quite solid",
        "21. b3 Kf8 22. Rc7 Ke8 23. Ne5": "The knight joins the fray",
        "23... Rb4 24. Nc6 Rb5 25. Rb1": "Preparing an a4 push, gaining even more space, and soon black will be drowning in it's own mess",
        "25... Bd7 26. a4 Bxc6": "I don't see the compensation here, but my opponent needed something radical here. I just don't quite think this was it.",
        "27. axb5 Bxb5 28. Re1+": "Now my second rook can jump to the 7th rank, and from there it'll be easy",
        "28... Kf8 29. Ree7 Be8 30. Rcxa7 Rb8 31. Reb7 Rc8 32. b4": "I control all the open files, my rooks dominate in black's camp, and I have a passed b and c pawn looking fit to queen. In this position, black resigned."
    },
    "url": "https://gameknot.com/annotation.pl/waste-of-tempo-quick-massacre?gm=44489",
    "gameName": "Waste of tempo = quick massacre",
    "players": "go4broke (1686) vs. jtg123 (1223)",
    "opening": "QGD Slav (D11), 3.Nf3"
}