{
    "moves": {
        "1. e4": "I wanted to try annotating a few games as a study exercise and decided to make it public as an afterthought. I chose a rather simple game to start with because annotating an entire game is not as easy as it appears! If you really want to get down most everything you understand about what is happening on the board it's a lot of work! But the idea was to do just that, rerun the thought process, write it all down, and maybe some of the ideas that come out of it will stick. Many thanks to my opponent in this game, which occurred in the 118th GK Tournament, June 2014. Any comments or observations are welcome. For me this is a learning process and I need all the help I can get. \n______________________________________________________________________________________\n\ne4, developing a pawn to the center and opening diagonals for my queen and bishop.",
        "1... Nc6": "Nc6, nothing wrong with this move. Could easily be seen as a prep for e5. Simple development of a knight to its natural square.",
        "2. Nf3": "Nf3, also simple development, anticipating my opponents move to e5.",
        "2... e5": "e5, there it is. Grabbing a piece of the center and opening the diagonals for his bishop and queen.",
        "3. Bb5": "Bb5, the Ruy Lopez. With this move white paves the way to castling and directly attacks the knight on c6. It has the additional benefit of casting a threatening eye on the black king. It's a marvelous move that loosely pins the knight as it inhibits moves like d6, or d5.",
        "3... a6": "a6, a common reply. It's a move that \"put's the question to the bishop.\" I forget who said that, but it always struck me as funny and incredibly appropriate. The bishop now has to decide whether to attack or retreat.",
        "4. Ba4": "Ba4, the retreating option, has the benefit of keeping up the pressure on blacks position. I play both variations, attack and retreat, and the retreat usually makes for a dicey game, putting pressure on whites development, especially when black replies with b5.",
        "4... b5": "b5, oh no, there it is. Dicey, cramped game ahead. Blacks thinking is relieve the pressure on his knight, and to push the bishop all the way back to the 3rd rank. At this point I am usually thinking about the best way to get my queenside development going. ",
        "5. Bb3": "Bb3, the bishop has no options. At the same time, black has spent a lot of time jacking up his queenside pawn structure. This is a point I try to keep in mind as I sweat through my own queenside development. ",
        "5... h6": "h6, a common and much maligned move. I get it. As a preventative measure it will keep my knight or dark square bishop from occupying the lovely g5 square. But at this point in the game... probably not a good idea. Besides, the queen is already protecting g5. Better to concentrate on true development. The moves Nf6, d6, Bc5, would all be better in my book. ",
        "6. d4": "d4, grabbing another chunk of the center and attacking the pawn on e5. Another valid move would have been to castle, but I wanted to get that development going and d4 opens a diagonal for my dark squared bishop. Also, I considered Nc3 because the knight can get hemmed in  should black decide to play b4. ",
        "6... Nf6": "Nf6, a good developing move. Gets the knight out where it ought to be and attacks my undefended pawn on e4. A better move, though, would have been exd4. We would exchange knights and pawns and material would be equal. ",
        "7. d5": "e5, attacking his knight on c6 and taunting his knight on f6. It also inhibits blacks development somewhat as he is forced to move the knight. The pawn is strong as it's triple protected... the bishop on b3, the queen at d1, and the pawn at e4. All that said, analysis engines rate it a 2nd class move, preferring Nxe5, which would threaten a strong check at f7 should black should fail to retake on e5. I totally missed it during the game.",
        "7... Ne7": "Ne7, a forced move that will further hinder his development. Black has options, but he is running out of good ones. Na5 looks like his best move. Since I played d5 my bishop on b3 is now vulnerable and trapped.",
        "8. Nxe5": "Nxe5, I could not resist the \"free\" pawn on e5. The move also attacks his weak spot at f7. ",
        "8... Nxe4": "Nxe4, now he has captured my pawn and is attacking my weakest point at f2. At the time I don't think I realized how bad a move this was for black, but I certainly knew it was opening up some doors for me. f7 is now a blatantly obvious target. How to best proceed?",
        "9. Qf3": "Qf3, still a bit early to bring my queen out, perhaps, but I see an opportunity I can't pass up. The move defends f2, attacks the knight, and also targets blacks own weak square at f7. He has to defend f7 or the game will soon be over. \n\nStill, a much better move would have been d6, opening up the diagonal to f7 for my bishop, denying mobility to blacks d pawn, and attacking the knight on e7 and the pawn at c7. Also, a pawn on the 6th rank is always a dangerous threat because it's just two moves away from promotion. It would demand some attention. ",
        "9... Nf6": "Nf6, the knight retreats to f6, protecting the weak f7 square by covering it from the white queens attack. Better would have been Nd6, actually defending f7 as opposed to blocking it, and would also have blocked my pawns advance to d6.",
        "10. d6": "d6, better late than never. Now d7 is under a lot of pressure and he has a pawn on 6th rank to consider.",
        "10... Ned5": "Ned5, not a good move, but was perhaps his best. His position is so closed there was simply no good defense. Nfd5 would have been worse. ",
        "11. Bxd5": "Bxd5, ouch! Removing the knight and forking the f7 square and the rook on a8. Also, I don't think I even realized that the pawn on d6 was covering the e7 square until now. Blacks options are really limited at this point. Perhaps he could try Bxd6, cxd6, or even Qe7. All would save him from mate, at least for the moment.",
        "11... Rb8": "Rb8, black has missed the mate and is saving the rook. ",
        "12. Bxf7#": "Bxf7#. The lessons here are many. First and  perhaps most important, is to use your opening moves wisely. Black did himself no favors by playing such moves as b5 to chase my bishop around, and h6 to ward off a threat that did not yet exist. Second, play in the center is important, and you need to fight for your piece of the center squares. Black had opportunities to get some play in the center, but he passed them up and let my d pawn march right on through. Finally, if you realize your weak point (f2 for white, f7 for black) is under attack, you MUST defend it as well as you possibly can. "
    },
    "url": "https://gameknot.com/annotation.pl/watch-your-weak-points?gm=60370",
    "gameName": "Watch Your Weak Points!",
    "players": "mcmurma (1406) vs. davidibus (1296)",
    "opening": "KP (B00), Nimzovich defence"
}