{
    "moves": {
        "1. d4 f5": "The Dutch!",
        "2. Nf3 Nf6 3. g3 g6 4. Bg2 Bg7": "Common version of the Leningrad System. Important is the bishop on g7. As for white, there exist multiple ways to respond, like 2 Bg5 or the gambits 2 g4 or 2 e4. I even saw a few matches where white decides to smash the Idea of blacks king castling to the king side by starting a pawn storm immediately.",
        "5. c4 O-O 6. O-O d6 7. Nc3 Qe8": "And finally we arrive at the starting position. Blacks position is a bit more cramped and in this tournament so far I met two times the move 8 d5 which causes black's knight to loose even more options and the light squared bishop seems to have problems to leave his home.",
        "8. b3": "However since I'm more used to play the english, i thought i'd try to challenge the a1 h8 diagonal.",
        "8... Nfd7": "Opening the diagonal but blocking the bishop. This leaves e6 unprotected, alongside with c7.\nHowever although it blocks d7 for the 2nd knight, 9 ... Nc6 is possible, since i can't play d5 now.\n",
        "9. Bb2 Nc6 10. e3": "Again a move i regularly play in my english games, not sure if it's that good vs Leningrad. Maybe d5 or Nd5 would've been better. Nd5 looks like a sweet outpost",
        "10... e6": "Looks like black thought so too... however the lightsquared bishop won't go anywhere in the near future.",
        "11. Ng5": "Only at this point of the game I noticed that the weak squares at blacks side are: c7 and e6... ",
        "11... h6": "?? Black did not notice that e6 is weak, and so I'm free to take it and the game is already sort of gone.",
        "12. Nxe6 Qxe6": "Well the other options are not that good either. Nxc7 cannot be prevented, and therefore it does not make a big difference.",
        "13. Bd5 Qxd5 14. Nxd5": "White gets to light figures for his queen and a pawn., and e6 and c7 still stay weak.",
        "14... a6 15. Nxc7 Rb8 16. Ne6 Rf7 17. Nxg7": "\"Always exchange if you are up ahead\" is the first reason... the second is that d5 will follow anyways :D",
        "17... Rxg7 18. d5 Nce5": "The only saving grace, however now f4 will be the problem.",
        "19. f4": "Black just can't escape it's problems",
        "19... b5": "? does not help at all. e5 is now a big problem, since the bishop is eyeing it impatiently ",
        "20. fxe5 dxe5 21. c5": "! for the sole defender of e5 to leave",
        "21... Re7 22. d6 Re6 23. c6": "I first was not sure what would be better: b4 or c6... after all these pawns are quite strong and annoying, but an open field is a bigger advantage to me than to  black, since the knight won't get that much out of it, and as for my queen... well yeah.\n\nAdditionally I would block my own bishop...",
        "23... Nb6 24. d7": "Simplify!",
        "24... Bxd7 25. cxd7 Rd8 26. Rc1": "occupy the open file",
        "26... Kf7": "I'm not sure why he played that move, I expected Rxd7... but well",
        "27. e4": "! since the  f pawn can't move, i threat blacks rook.",
        "27... Rxd7 28. exf5": "Simplify again! I get two rooks and an open field for a queen.",
        "28... Rxd1 29. fxe6+ Kxe6 30. Rfxd1": "Rfxd to threaten Rc6...",
        "30... Nd7": "Final error.",
        "31. Rc6+": "and the knight is lost too. If K f5 it is free to be taken, otherwise follows Rc7.\n\nI found  it very interesting that everything flow perfectly together and seemed solely caused by the early abandoning of the e6 square."
    },
    "url": "https://gameknot.com/annotation.pl/weak-e6-in-leningrad?gm=46175",
    "gameName": "Weak e6 in Leningrad",
    "players": "thedeafone (1591) vs. aulus (1480)",
    "opening": "Dutch (A80)"
}