{
    "moves": {
        "1. e4 c5": "Team Match, I am playing black, and since my opponent wants an open game, I play the Sicilian. My opponent builds up an overwhelming attack against my castled king, but I find the way to weather the storm.",
        "2. Nf3 d6": "Gunning for the Dragon. Because I like dragons. Big and scary.",
        "3. d4 cxd4 4. Nxd4 d5": "This move strikes me as odd (even though I am the one who played it). It's in the GK DB, but my Sicilian book doesn't talk about it, nor does Wikipedia. It seems weird, costing black a tempo, but it does strike at the center. I thought it might be fun to try.",
        "5. e5 e6 6. Nc3 Nc6": "Developing.",
        "7. Bb5 Bd7 8. Be3 Nxe5": "I guess white forgot about his advanced e5 pawn.",
        "9. Qe2 Be7 10. O-O-O Nf6": "More developing.",
        "11. Bxd7+ Nexd7": "I didn't like my undefended knight sitting on e5. That square has already been bad luck for undefended pieces (well, for a pawn anyway). My knight on e5 is just one good move by white's d3 bishop away from ignoble death.",
        "12. f4 O-O 13. g4 Nb6": "I'm starting to get concerned about white's advancing pawns. My pieces need a bit more mobility, and I want to trade away white's pieces, so I wanted to move my knight off of d7. But moving it away from those advancing pawns made me a little nervous.",
        "14. f5 e5": "Capturing on f5 seemed like a bad idea, isolating the d5 pawn. Better to strike out at white's pieces and maintain decent pawn structure. If white retreats the knight from d4, black can play 15. ... d4 and fork white's bishop on e3 and knight on c3. Of course, black's d-pawn is pinned to his queen by the rook on d1, so black would have to waste a move unpinning the pawn, which would allow white to save both pieces.",
        "15. g5 exd4": "White counterattacked the black knight on f6. Since the fork on d5 isn't really going to succeed, I decide on a different approach to break up the white pawn advance before it crushes me. I am expecting white to respond with 16. gxf6 maintaining material balance.",
        "16. Bxd4 Ne8": "White surprised me, recapturing on d4, which loses material for him, but his advanced kingside pawns are still looming large, and now black's pawn at d5 is isolated and likely to fall. Black's knight on e8 is virtually undeveloped, though it may be a critical defender in white's upcoming kingside attack.",
        "17. h4 Nc8": "White added a third pawn to his attack. Yikes! OK, that knight I moved to b6 four moves ago is severely misplaced. I need to bring him back to defend my king, but d7 won't work or the black pawn on d5 falls immediately. The black pieces are a mess, all lined up on the back rank like little ducks all in a row, about as far from being effective as they can be.",
        "18. Qg4 f6": "Black has to do something to strike out at the advancing white pawns. The f-pawn is supported here by pawn, bishop, knight, rook, and queen. That's a severely strong pawn.",
        "19. g6 h6": "White avoids the exchange, and in the process, seems to overextend his attack. Of course, black wouldn't want to capture at g6 for then there is no escape from 20. fxg6, 21. Qh5, 22. Qh7#.",
        "20. Be3 Nc7": "The black pawn on h6 is about to fall. Black's king needs running room. Black's rook on f8 needs queen support. And the pawn on d5 needs a defender now. Since g7 is not quite such a high priority now, the knight on e8 is just in the way.",
        "21. Bxh6 gxh6": "Accepting the sacrifice. I didn't feel white had enough material on scene to press his attack to conclusion.",
        "22. g7 Rf7": "White's pawns are now over extended. The g-pawn won't have long to live.",
        "23. Rhg1 Bc5": "The black bishop was in the way, so he needed to move with tempo. Striking out at the white rook buys black the time he needs.",
        "24. Rg2 Qd7": "Aiming at white's pawn on g7. Note that black's isolated pawn on d5 is attacked twice, so capturing immediately on g7 will lose the d5 pawn. An extra move, such as 25. .. Nb6 or 25. ... d4, may be needed first.",
        "25. Re1 Rxg7": "White's rook move freed the black queen from defense of d5; the black knight on c7 is adequate to hold against white's knight on c3. Time for white's impetuous pawn on g7 to die.",
        "26. Qf3 Nb6": "Maybe exchanging rooks to take advantage of black's two-piece material lead was called for. As played, black wanted to open his other rook on a8 to defend the back rank and be ready to jump into offensive action when needed, and at the same time move his knight off the bank rank so it could be more effective too, and add some defense on d5 if it becomes needed.",
        "27. Rd2 Re8": "Black has weathered the storm. White's kingside pawns are isolated and blocked, and the black king is adequately defended. It's time to get an inactive rook out onto an open file and challenge white.",
        "28. Rxe8+ Qxe8": "Black is only too glad to trade, and now glad of the two knight defenders on d5. Even though white has more attackers than there are black defenders, two of the attackers are major pieces, so white will lose material capturing on d5. It seems, after all the exchanges, that white will end up with a queen on d5, forking the black king and the black bishop on c5, but after black moves out of check, white cannot play Qxc5??? or he will lose immediately to black's Qe1#.",
        "29. Kb1 Rg1+ 30. Rd1 Rxd1+": "Exchanging more material.",
        "31. Nxd1 Qe7": "My big fear now is how easily white could get his queen into black's camp and find a perpetual check to turn easy victory into a draw. I am willing to play fairly conservatively for now, making sure white has no chance to pull that off.",
        "32. a3 Nc4": "Threatens the royal fork on d2. One can dream, can't one? OK, it's not entirely hope chess. It does bring the knight to a much more active square, ready to support an attack on white's king.",
        "33. Ka2 Ne3": "Forking the knight and the undefended pawn at c2. Black is, of course, more than willing to exchange knights to consolidate his material advantage.",
        "34. Nc3 Qe5": "34. Nxc2 is met by 35. Nxd5. This seems to favor black, since the d-pawn is isolated and it's a pain to defend it. And it allows exchange of knights with 35. ... Nxd5, 36. Qxd5  but now white is forking the black king and the bishop on c5 and white seems to win material, so I didn't make this move in the game. Upon further examination, black's response would be 36. ... Qf2!, blocking the check and skewering the white queen to her king, forcing an exchange of queens and an endgame where black is ahead by a bishop and knight.",
        "35. Qh5 Qxf5": "White advances toward black's vulerable king, just the thing I had feared. But I see a winning combination and I go for it, starting with 35. ... Qxf5.",
        "36. Qxh6 d4": "White's reply was obvious and expected, but now the white queen has no threats against the black king. Black really wants to move his bishop, but he's currently busy defending the black knight, so the obvious move is 36. ... d4.",
        "37. Na4 Bf8": "White's knight was en prise so running from the pawn seems like the right thing to do. But white overlooked the greater danger and now his queen has nowhere to run, nowhere to hide. Already two pieces down, white is about to become down by a queen and a minor piece. Instead, he took the noble way out and resigned before his lovely lady had to lose her head."
    },
    "url": "https://gameknot.com/annotation.pl/weathering-the-storm?gm=21947",
    "gameName": "Weathering the Storm",
    "players": "justnkase42 (1538) vs. blake84120 (1504)",
    "opening": "Sicilian (B54)"
}