{
    "moves": {
        "1. d4": "Hi everyone!  Another session with Master Freddy which ended in a trouncing.  Behold, Master Freddy gives me another lesson in how to execute a checkmating sequence, so it all ends with me copping Old Matey from him yet again!  He starts off with d4 and I respond with an unusual reply c5 which is called The Old Benoni.",
        "1... c5 2. d5 Nf6 3. Nc3 d6 4. Nf3": "4. Nf3 - Freddy steers the opening into the Woozle Defense, whatever that is ... it's one of his fav's ..... sigh and double sigh!",
        "4... e6 5. e4 exd5 6. exd5 a6": "6. ......... a6 - to prevent an enemy knight or bishop settling on d5 and preparing a possible b5.  Freddy puts the blockers on this idea by playing his pawn to a4 next turn.",
        "7. a4 Be7 8. Be2 Bf5": "8. ......... Bf5 - I trusted the World DB and Freddy exposed this as a weak, time wasting move.  Freddy moved his knight to h4 and I had to either back up or move the bishop.  I chose to move Fou Leblanc to d7.  In retrospect would Qc1 have been a better choice.  Jury please advise.",
        "9. Nh4 Bd7 10. O-O O-O 11. a5 Ne8": "11. ....... Ne8 - a Sneaky Knight move here (I am a member of that team and Gothicgirl is my skipper!), but (a test for the jury) what does it threaten?",
        "12. Nf3 Bg4 13. Re1 Bxf3 14. Bxf3 Bg5 15. Bxg5 Qxg5 16. Ne4 Qd8": "16. ......... Qd8 - after a plethora of exchanges, Glenda returns to d8 and Nf6 is prepared for my next turn.",
        "17. Qd2 Nf6 18. Qf4 Nxe4 19. Bxe4 Qc7": "19. .......... Qc7.  Next move I will play Nd7 and my rooks will be connected.  The knight will then hop on to f6.  But wait...... Freddy has other ideas!",
        "20. Bxh7+": "20. Bxh7  - ............. A SACRIFICE ON H7!  Yup, it turns out to be the bog standard Greek Gift (Trojan Horse) sacrifice.  I accept it because if I don't I will be a pawn down without sufficient play for it, but a post match pm from Freddy stated that this would have been the lesser of the two evils!",
        "20... Kxh7 21. Qh4+ Kg8 22. Re7 Nd7": "22. .......... Nd7 - finally I manage to develop that horse, but I end up in deep horse dung!",
        "23. Ra3": "23. Ra3 - let's begin with a rook swinger.  This rook is heading for h3 with a deadly line up of the Wicked Witch of the West and her castle.  That is a sure recipie for copping Old Matey.",
        "23... Rfd8 24. Rh3 Kf8": "24. ....... Henry tries to escape but to no avail.  Freddy plays his queen to g5 and tells me that I am going to be checkmated (Oh No, not that again!).",
        "25. Qg5 g6 26. Rxf7+": "26. Rxf7  .......... but Oh Yes!  Freddy now announces #3 (he did tell me he had a # in 13 before I played g6).  Could you the jury spot this mate in 13?",
        "26... Kxf7 27. Rh7+ Ke8": "27. .......... Ke8 - I am 6 points up in material but that is SFA when Henry is about to get the kiss of death!  Just before I played Ke8, Freddy asked me to spot the mate in 3.  Here are the other two variations that lead to the mate in 3:-\r\n\r\nVariation A\r\n\r\n27. Rh7  Kg8 \r\n28. Qxg6  Kf8 \r\n29. Qf7# \r\n\r\nVariation B\r\n\r\n27. Rh7  Kf8 \r\n28. Qf4  Kg8 \r\n29. Qf7# \r\n\r\nVariation B1\r\n\r\n27. Rh7  Kf8 \r\n28. Qf4  Ke8 \r\n29. Qf7# \r\n",
        "28. Qe7#": "28. Qe7# - it's all over folks!"
    },
    "url": "https://gameknot.com/annotation.pl/well-and-truly-freddied?gm=21398",
    "gameName": "Well and truly ................ Freddied!!!!",
    "players": "easy19 (2246) vs. jstevens1 (1755)",
    "opening": "Woozle defence (A43)"
}