{
    "moves": {
        "1. e4 d5": "..Scandavian....looking to not get into a Sicilian for a change and see what happens...",
        "2. exd5 Nf6": "..looking for the Icelandic Gambit. If white opens wrong it can be curtains in 10 moves...typically c4 is played by white then e6, de Bxe6, Nc3 Bb4....etc",
        "3. d4": "...one of the antidotes....",
        "3... e6 4. Nc3 Bb4": "white declines the gambit for development.",
        "5. a3 Bxc3+ 6. bxc3 Nxd5": "...Bishop is blocked now so have to look at Q side finachetto...",
        "7. Bb2 Nc6 8. c4 Nf6 9. Nf3 O-O": "...keeping the development going as will lose time finachetto'ing..White can start to untangle a bit here...",
        "10. Bd3 b6 11. O-O Bb7 12. c5 Qe7 13. cxb6": "want to keep the place open a little ..Brings the rook into playand gives 2 open files to aim at.....",
        "13... cxb6 14. c4": "White has good solid centre...rooks to the game will add to this....so with this in mind...",
        "14... Rfd8 15. Qc2 Rac8": "...just occupy them for the mo....",
        "16. Rfe1 Na5 17. Re3": "...white is now threatening to remove Nf6, and lead to a nasty attack ( i thought) of d5...with a view to Bxf6 Qxf6, Bxh7 ...with the knight Rook and Queen quickly into the Kingside...",
        "17... Ng4 18. Bxh7+": "...dropping a pawn...Doh !!",
        "18... Kf8 19. Rc3 Bxf3": "...get rid of a key attacker...have to watch out for eventual Rh3",
        "20. Rxf3 Rxc4": "get the pawn back but the rook won't be there for long....",
        "21. Qe2 Nf6 22. Bd3 Rc7 23. Rh3 Kg8": "....nasty Rook...",
        "24. d5": "...i thought white needed to bring in the other rook and continue to build...this helps me get a piece into defend.",
        "24... Rxd5 25. a4": "...might be looking to anchor the bishop into b5",
        "25... Nb3 26. Rd1 Nd4": "...a4 is now  a target and the a & b pawns can eventually be nasty passed pawns.....",
        "27. Qe3 Qb4": "...making use of the bishop being loose....",
        "28. Ba3": "....nearly took the bishop.....after Bh7  Black loses straight away...",
        "28... Qxa4": "...2 pawns up but still a nasty attack for white possible.",
        "29. Ra1 Nc2": "....a nasty fork. White can't take the knight as Qxc2 is very strong for Black with Rc1 to follow. White needed to play Qc1",
        "30. Bb2": "....black now wins with the next move. As in effect material loses for white and strong passed pawns mean very strong advantage for Black...",
        "30... Qxa1+ 31. Bxa1 Nxe3": "...fxe3 and Rc1  winning the choice of bishops. Kf2 (forced) and black also has Ng4  to follow. Rxa1 is most likely."
    },
    "url": "https://gameknot.com/annotation.pl/well-now?gm=10000",
    "gameName": "Well now....",
    "players": "neimaq (1364) vs. shambobala (1637)",
    "opening": "Scandinavian defence (B01)"
}