{
    "moves": {
        "1. d4": "white opens pawn to d4 in the center.",
        "1... Nf6": "Black brings out Nf6.",
        "2. e3": "white protects d4 pawn",
        "2... d5": "d5 moving my pawn to the center protected by Nf6.",
        "3. Nf3": "White brings out Nf3 protecting d4 and center.",
        "3... Nc6": "Black brings out Nc6.",
        "4. c4": "c4 pressure on blacks d5 pawn.",
        "4... e6": "Black brings out e6 pawn to protect his d5 pawn. Black is under development by having both knights in play.",
        "5. Nc3": "White develops further bringing out her other knight to Nc3 adding pressure to the middle pawn on d5.",
        "5... h6": "Black pawn to h6 blocking any advancing of white knight to g5.",
        "6. Bd2": "White brings out bishop to Bd2, further developing on Queenside.",
        "6... a6": "Black pawn to a6 to stop any advancement of white knight to b5.",
        "7. Bd3": "White brings out other bishop to Bd3. Now has four pieces out to plan attack on Black.",
        "7... dxc4": "pawn takes pawn on c4.",
        "8. Bxc4": "Bishop takes pawn xc4.",
        "8... b5": "Black pawn to b5 to pressure white bishop on c4.",
        "9. Bd3": "white bishop moves back to Bd3 to avoid take by pawn on b5.",
        "9... Nb4": "Black moves up Knight to Nb4 and putting pressure on whites bishop on Bd3.  ",
        "10. Be2": "White bishop moves back in front of King on Be2.",
        "10... c5": "Black puts pawn to c5 attacking whites center pawn on d4 which is protected by whites knight on Nf3. Black is playing with tempo and has opened up and is also crowding in white. Both of whites bishops are boxed in.",
        "11. O-O": " O-O White castles on King side and has good pawn structure on f2,g2, and g3 with a Nf3 protected by Be2.",
        "11... cxd4": "Black pawn takes  cxd4. ",
        "12. Nxd4": "White takes pawn xd4",
        "12... e5": "black pawn to e5 putting pressure on Nd4 of white.",
        "13. Nc2": "white brings back Nc2",
        "13... Nd3": "Black moves N d3 which is protected by Qe8. Black hopes white bishop will take then Queen would take bishop.",
        "14. Bxd3": "White takes Knight Bxd3.",
        "14... Qxd3": "Suprise Black queen takes Bishop Qxd3.",
        "15. Ne1": "White moves knight to Ne1 pressuring the black Queen on d3.",
        "15... Qd6": "Black pulls back Qd6. ",
        "16. Nf3": "White moves Kf3 not realizing d3 is not protected.",
        "16... b4": "Black moves up pawn to b4 and is attacking Whites Knight on Kc3.",
        "17. Ne2": "White brings knight back to Nf3.",
        "17... Bd7": "Black moves bishop tp d7 behind the Queen on d6 and now has to goods lines of attack either Queen side or King side. It also protects c8 open fileon c6.",
        "18. Qb3": "White queen to Qb3 attacking pawn on f7 king side.",
        "18... Qb8": "Black pulls Queen back to Qb8.",
        "19. Rfc1": "Whites Rook to Rc1. Rook now attacking c-file.",
        "19... Qb5": "Black Queen to Qb5 attacking Ke2.",
        "20. Ng3": "Whites moves Knight to Kg3 out of attack from Blacks Queen.",
        "20... Rb8": "Whites moves Rook to Rb8. protecting Queen. ",
        "21. h3": "Whites moves pawn tp h3 to stop advance of black knight  to g4",
        "21... Be6": "Black bishop to Be6 attacking Qb3 h3.",
        "22. Qc2": "White Queens moves out of attack from bishop to Qc2.",
        "22... Rc8": "Black Rook to c8 attacking Qc2.",
        "23. Qd1": "Queens moves out of attack from rook on c8 and is back on Qd1.",
        "23... Rd8": "Black Rook moves out of attack from White rook by moving to Rd8.",
        "24. Qc2": "Queen moves to Qc2 attacking open c-file.",
        "24... Rc8": "Black Rook to Rc8.",
        "25. Qd1": "Qd1 again.",
        "25... Rd8": "d8 again!",
        "26. Qc2": "Qc2 again.",
        "26... Rc8": "c8 again!  I ask White how many times are we going to do this? Are you looking for a draw? White has alot less time than Black. This was going to be decided by time out. ",
        "27. Qd1": "Qd1 again!",
        "27... Rd8": "d8 again!",
        "28. Qc2": "c2 again!",
        "28... Rc8": "c8 attacking White Queen again.",
        "29. Qd1": "d1 again! This soon will stop as white is just buying more time to think of something better to play.",
        "29... Rd8": "d8 once again!",
        "30. Qe1": "Change this time!!! Qe1",
        "30... Rd3": "Black Rook to Rd3",
        "31. b3": "White b3 moves up pawn.",
        "31... Be7": "Black moves up bishop in front of King to Be7.",
        "32. Rc7": "White attacks on c-file to  Rc7. attacking Bishop on e7. Black has other bishop on e6 protecting c8.",
        "32... Bd6": "Black moves bishop to Bd6.",
        "33. Rc2": "White pulls back rook to Rc2.",
        "33... O-O": "O-O Black castles king side.",
        "34. Rac1": "Whites doubles up rooks on c-file moving Rc1.",
        "34... a5": "Black moves up pawn to a5.",
        "35. Qe2": "White queen to Qe2 to attack Rook on Rd3",
        "35... e4": "Black moves pawn to e4 protecting his rook on d3.",
        "36. Ne1": "White moves to Ke1 to add pressure to rook on d3.",
        "36... Bxg3": "Black takes knight Bxg3.",
        "37. fxg3": "White pawn takes Bishop fxg3.",
        "37... Qd7": "Black moves to Qd7 protecting Rook on d3, Rook can be taken by Ne1, which is backed up by Qe2 of White.",
        "38. Nxd3": "White Knight takes  Rook xd3",
        "38... exd3": "Black pawn takes Knight exd3. And White runs out of time ....  So the question is.... what could Black of done better to end this game?"
    },
    "url": "https://gameknot.com/annotation.pl/what-could-black-have-done-better?gm=44446",
    "gameName": "What could Black have done better?",
    "players": "White (1200) vs. redfox17 (1200)",
    "opening": "Queen's pawn game (A45)"
}