{
    "moves": {
        "1. e4 e5 2. Nf3 Nf6 3. Nxe5 Nxe4": "Standard protocol in the Petrov defense is to play ...d6, removing the knight so you can recapture safely. However, recapturing immediately gives white a nice revealed attack threat after 4. Qe2.",
        "4. Qe2 d5 5. d3 Qe7 6. dxe4 Qxe5 7. exd5 Qxe2+ 8. Bxe2": "4...Qe7 5. Qxe4 d6 6. d4 dxe4 7. dxe4 was another option open to black. He then would have kept his queen instead of the forced trade and a loss of center control. He loses a pawn either way.",
        "8... Bf5 9. c4 c5": "This move surprised me a bit. I guess since he knew that I like to trade pieces, he decided he would risk this move hoping I would capture en-passant. However, knowing this would allow his knight to develop while I lose center control, I decided to keep my passed strong pawn to annoy him later, and I just kept developing.",
        "10. Be3 Nd7 11. Nc3 Bd6 12. Nb5": "This idea of mine was flawed. I thought I could tie down his bishop defending the c7 square by making it run back to b8, but wasn't thinking about how easy it would be to remove my knight the next move, and then re-locate the bishop. Also a better option for black would be to play 12...Be5, keeping his piece active and still defending the important square.",
        "12... Bb8 13. h4": "This move prepared the trap of g4 followed by h5, a simple trick I learned the hard way in a recent game. Notice all squares but c2 and e4 are defended, and e4 is bad due to the simple f3.",
        "13... a6 14. Nc3 Be5 15. Rc1": "This move is key to my trick. Now when I play g4, he can no longer move to c2. What I did not notice, was he can go to b1 after capturing my knight and I capture back with rook. This allows him to get two pawns in exchange for his bishop.",
        "15... O-O 16. g4 Bxc3+ 17. Rxc3 Bb1 18. O-O Bxa2 19. Ra3 Bxc4 20. Bxc4 Ne5 21. Be2 b6 22. f4": "The pawns the marchth forth to war! A fun move which leaves my king totally unguarded by pawns, but in this position he does not need to be. This move allows me to have a bit of fun chasing that knight around the board while advancing my pawns.",
        "22... Ng6 23. h5 Ne7 24. d6 Nd5 25. Bf3": "This move forces more trades, and allows me to take control of the e-file!",
        "25... Nxe3 26. Rxe3 Rad8 27. Rd3": "Here a better move is Rd1, but since I was playing at blitz speed, I totally missed that idea until after I had submitted my move, and I noticed he could now play Rfe8 unchallenged.",
        "27... Rfe8 28. f5 a5 29. Bc6": "Having a little fun attacking his rook while stopping two of his pawns on the queen side.",
        "29... Re2 30. Rf2 Re5 31. b3 g6 32. hxg6 hxg6 33. Kf1": "g6 was a good move, and I didn't know how to respond to it for a while. Upon later analysis, I found that fxg6 is better in the long run. Kf1 also is incorrect since I should capture the g pawn, and open a convenient file for my rook.",
        "33... Kg7 34. fxg6 Kxg6 35. Re2": "I challenge his rook so I can remove more blockaders of my pawn, while also possibly threatening Re8 if he moves away.",
        "35... f6 36. d7 Kg5 37. Rxe5+ fxe5 38. Rd5 Kf4 39. g5": "I trade off pieces to continue my goal. Kf4 is a blunder, since g5 is awesome which presents black with two problems, the passed g-pawn, and the threat of Rxe5 then Re8. My opponent chose to capture the pawn which is also not the best move which would have been Kf5, At this point though, my opponent would have been well lost anyway, and after I played 41. Re8 his resignation was in order.",
        "39... Kxg5 40. Rxe5+ Kf6 41. Re8": ""
    },
    "url": "https://gameknot.com/annotation.pl/what-not-to-play-in-the-petrov-defense?gm=63686",
    "gameName": "What not to play in the Petrov Defense",
    "players": "smallfry425 (1804) vs. stingray17b (1543)",
    "opening": "Petrov (C42), Damiano variation"
}