{
    "moves": {
        "1. d4": "The following game was played over a 40 1 hour period. So you might as well call it an OTB game. ",
        "1... Nf6 2. c4 e6 3. Nf3 c5": "I was surprised by my opponents 3rd move choice. Why because I am known for my expertise in the Benoni on Gameknot. As I have annotated well over 20 games on the subject! ",
        "4. d5": "I am going to the main lines. ",
        "4... b5": "!? another surprise move by my opponent that transposes into the benko lines. ",
        "5. Bf4 a6": "This game is going to explode into a furious fire of the epic kind. ",
        "6. e4": "I stake chances in the middle while my opponent tries to crash through on the queen side. ",
        "6... Nxe4 7. Bd3": "I get two strong bishops for the pawn. ",
        "7... exd5": "black is looking very good here though I sense that momentum is shifting slightly into my favor. ",
        "8. cxd5 Bd6": "forcing me to give up the bishop pair but at a cost. The knight on d6 will be slightly undeveloped and the black LSB will be hard pressed to find active duty. But black retains the greatest plus which is his active queen pawns. I must be on my guard against squeezed off the board. ",
        "9. Bxd6 Nxd6 10. O-O O-O 11. Qc2": "The is what a good move looks like if there ever was one. It has multiple threats, develops a piece and forces the opponent to defend",
        "11... c4": "drives a massive wedge into the white camp but a the cost of returning the pawn. ",
        "12. Bxh7+": "a small but much needed king side weakness. ",
        "12... Kh8 13. Re1": "seizing control of the e-file while preparing for operations on the light squares. ",
        "13... Qf6 14. Be4": "taking the bishop leads to a winning advantage ",
        "14... a5": "here comes the pawns. Starting to get a bit nervous but I take a deep breath and try and find the most active way to defend. ",
        "15. a4": "! This greatly slows the queenside momentum to the point that I know longer fear the black pawns. ",
        "15... b4 16. Nbd2": "attacking the newly created weakness of c4 ",
        "16... Ba6 17. Re3": "!! highlights the point of 12.Bxh7+",
        "17... b3": "black has gone as far as he can go on the queen side and has gained very little. It is now time to switch gears and go on the offensive. Alternative variation 17...Rc8 18. Rae1 c3 is also good for white ",
        "18. Qc1": "My idea is to clear the dark diagonal for the queen to invade via g5. I will do this via Nb1-Nc3!",
        "18... Rc8 19. Nb1 Kg8 20. Nc3": "the vast majority of black's pieces are all locked up on the queen side. This looks very bad for him. ",
        "20... Bb7 21. Ne5": "With the threat of Ng4",
        "21... Re8 22. Ng4 Qd4 23. Nh6+": "The knight can not be taken because of Rg3+ and Qh6+",
        "23... Kf8": "The point is not just s simple checks ",
        "24. Nb5": "deflecting the defender of f5",
        "24... Nxb5 25. Nf5": "Checks the queen and cuts off the only escape route aka e7 for the black king ",
        "25... Qf6 26. axb5": "I completely own the center. ",
        "26... g6 27. Nh6": "Threatening Rf3",
        "27... Qd4 28. Nxf7": "The final sac",
        "28... Rxe4 29. Rf3": "Now the Queen will finally invade via G5. ",
        "29... Bxd5 30. Nd6+ Kg8 31. Qg5": "I am down by three pawns but I have a mating attack. ",
        "31... Nc6 32. Nf5 Rg4 33. Nh6+ Kg7 34. Nxg4": "regains the material balance",
        "34... Bxf3 35. gxf3 c3": "black has one last kick at the can. ",
        "36. bxc6 cxb2 37. Re1 dxc6 38. Kg2 b1=Q 39. Rxb1 b2 40. Re1 Ra7 41. Re5 Qxe5 42. Qxe5+ Kh7 43. Nf6+ Kg7 44. Ne4+ Kh7 45. Ng5+ Kh6 46. f4 Rg7 47. Qc3 b1=Q 48. Qh3#": ""
    },
    "url": "https://gameknot.com/annotation.pl/what-happens-when-you-give-up-the-centre?gm=52498",
    "gameName": "What happens when you give up the centre",
    "players": "elyhim (2373) vs. excelsior_s (2292)",
    "opening": "Blumenfeld counter-gambit (E10)"
}