{
    "moves": {
        "1. f4": "Birds opening, I dont see it that often but I do occasionally.",
        "1... e6 2. Nf3 b6 3. e3 Bb7 4. Nc3 d5": "I had no knoledgde of the ideas behind the opening, so for all the first part of the game I was just winging it. (excusing the bad pun)",
        "5. b3 Nf6 6. Bb2": "I suppose white seeks control over the e5 square.",
        "6... c5": "I figured a little more central control wouldn't be a bad thing.",
        "7. Bd3 Bd6 8. O-O a6": "to prevent the knight invading b5 square, I had plans of playing Qc7",
        "9. Ne2 Nbd7 10. Ng3": "brining all his pieces over to the king side. My opponent wanted to get an attack started.",
        "10... O-O 11. Ng5 Re8 12. Nh5 h6": "Possibly weakning. I wanted to kick the knight but perhaps moving some pieces over to defend would have been fine.",
        "13. Nh7": "mixing things up a little. This aims to lure my knight away from f6 which at the moment is preventing the queen from invading blacks position.",
        "13... Nxh7 14. Nxg7 Nhf6 15. Nxe8 Qxe8": "so we come out of it and black has two knights for a rook and a pawn. blacks h pawn will be hard to defend and the king is a little open but for the most part blacks position is looking pretty fine.",
        "16. Qe1 Kf8": "I retreated my king to somewhere where it would have a bit more cover, maybe I could have used my time in other ways. ",
        "17. Qh4 Ng8 18. Bh7 Qe7": "looking to trade queens and thus nullify whites attack, then maybe I could seek counterplay on the opposite flank.",
        "19. Qg3 Ngf6 20. Qh3 h5 21. Bd3 Ke8 22. Be2": "the h pawn can no longer be protected.",
        "22... h4": "But if I am going to lose it I am going to lose it on my own terms, this practially forces a queen trade.",
        "23. Qxh4 Ne4 24. Qh8+": "rather than trading queens on e7 which will help me bring my king to where he wants to go.",
        "24... Qf8 25. d3 Qxh8 26. Bxh8 Ke7": "with a discovered attack on the DSB.",
        "27. Bb2 Nef6": "So lets take another look at the position, black has two knights for a rook and two pawns. so I am down in material by one point, furthermore my opponent has a clear path on the kingside. so perhaps white has a slightly easier time, however the game is far from decided yet. My position looks solid and I should be able to drum up some counterplay somewhere.  ",
        "28. h3 Rg8 29. g4 Nh7": "Maybe not the best place for the knight.",
        "30. Kf2 e5": "Maybe I should have looked for play on the queenside, there is nothing too wrong with this however.",
        "31. f5 d4": "maybe the first real mistake, closing up the position will probably only help white.",
        "32. e4 Ng5 33. Kg3 Nf6 34. Bc1 Ngh7": "the problem is my knights dont have alot of very good squares.",
        "35. Kf3 b5": "finally the move that should have been done a while ago.",
        "36. a4": "but now things have changed slightly.",
        "36... b4": "?! another mistake I think. with the final nail in the coffin, this locks up the position completly and basically means the whole game will be based on the g and h files. A better plan may have been to leave the pawn where it was and played something Like Bb8",
        "37. Rh1 Nd5": "This should get my knight to some better squares, all those dark squares have been screaming for a knight to be occupied. This move is only made possible by the rook beinng on h1 and the king being on f3.",
        "38. Bd2 f6": "? poor move, I dont know why I did it. It was about here that it was getting quite late, I had had very little to drink that day and after playing chess for so long it may have started taking effect. Nf4 might have been a better move.",
        "39. exd5 Bxd5+ 40. Kf2 Bxh1 41. Rxh1 Ng5 42. Bxg5": "Not too sure why this move was made, I wouldn't have been in such a hurry as white to do that.",
        "42... fxg5 43. h4 Rh8": "hxg isn't possible because of the pin.",
        "44. h5 Rh6": "It's after this move I think that I offered a draw. to me this seemed fairly drawish, my opponent thought otherwise, and rightfully so considering the result.",
        "45. Bf3 a5": "up untill now I had avoided making this move since white playing a5 would put the pawn on the colour of my own bishop. However it also workd the other way and would make my pawn a target for white. With this the blockade is nearly complete. ",
        "46. Bd5 Kf6": "Possibly Bc7 was a better move.",
        "47. Kf3": "I was so confodent of a draw at this point that I had overlooked my opponets entry point on d5. I have to get my king to d6 and my bishop to f6 then it should be a draw.",
        "47... Bc7": "Luckily I have enough time.",
        "48. Ke4 Ke7 49. Bc4 Kd6 50. Rf1 Bd8 51. Bf7": "aiming at g6 to cut of communication between my pieces.",
        "51... Bf6": "Now I have the ideal position for a draw. Now that he blockade is complete I should be able to shuffle my rook between h6 and h8 and laugh as my rating goes up by a couple of points.",
        "52. Bg6 Rh8 53. Rh1 Bg7": "??????? I can only only put it down to my lack of nutrience causing a momentary lapse in concentration that I played this. this is pretty much what lost it, although much more difficult, things just got alot more complicated. though black can olny play to hang on and white can play for the win. The logical Rh6 would have been fine. then after say Rh3 black simply plays Bg7 then if white tries to swicth to the f file Bf6 and white cannot break through. as long as black has both pawns blocked things are fine.\r\n\r\n\r\n\r\nthere are many ways for white to win from this point. He could try f6 for one. 54.f6 Rh8 55.Rf1 Rxf6 56.Rxf6+ Bxf6 57.h6! Ke6 (only way to cover both f5 and d5) 58.Bf5+ (or even h7 first and then follow up with this line) Kd6 59.Bc8!which clears the f5 square for white. the black monarch can't cover both f5 and d5 because the LSB controls e5, now lets say black chasses after the bishop. ...Kc7 60.Ba6 and it's game over. the bishop can come to c4 and the king can break through the lines with the bishop tied down to the defence of h8 he wont have enough man power to stop white wreaking havock on the position.  \r\n\r\n\r\nOf course white chooses a more effiecnt way to win.\r\n",
        "54. h6": "This easily wins it for white. Rxh6 doesn't work at all. 54..Rxh6 55.Rxh6 Bxf6 56.f6 Ke6 ( to cover f5 and d5) 57.f7 now any king move opens either the f5 or d5 square. 57....Bf8 58.Bf5+ Kxf7 59.Kd5 and it's a simple enough matter. If black instead of taking the pawn tries Kd6 to keep control over the entry points then Bc8! wih a simmiler theme to what was mentioned before. 57...Bg7 runs into the same problems after Bf5+\r\n\r\n\r\nI tried Bxh6 but as you will see that was even worse.",
        "54... Bxh6 55. f6": "!!",
        "55... Ke6": "...Rf8 would have set a nice little trap, if after ... Rf8 white played Rxg6?? then Rxf6!! would win for black, the only way to stop mate for white would be to give up the rook with Bf5. However the simple f7 would prevent that.",
        "56. f7 Kd6": "Kf6 would have held on for a while longer, but in the end it would still be game over.",
        "57. Rxh6": "I was very dissapointed to have a drawn game end like this because of a stupid blunder, however I do think I learnt lots from this. And hopefully by annotating it I can learn even more by comments from some gameKnot players who are more expierenced than myself."
    },
    "url": "https://gameknot.com/annotation.pl/what-should-have-been-a-draw?gm=40354",
    "gameName": "What should have been a draw",
    "players": "opponent (1644) vs. thereaper1 (941)",
    "opening": "Bird's opening (A02)"
}