{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Bb5": "The following game is a variation of the Ruy Lopez that I enjoyed because it demonstrates how delaying the castle allows white to gain piecemeal advantage. This game would not be at masters level.. my rate fluctuates from 1480 to 1540. So this is game played at the mid 1550 level. ",
        "3... d6": "This move is a mistake. Black expects one of two things; either O-O-O or Bxc6+. However this move is not prepared to meet d4 w/o losing a pawn",
        "4. d4": "Black could chose cx4, but that would be worse than a6. White could respond to cx4 with Ncx4 which wins white development. F6 would be even worse because it blocks black's knight from moving ou. ",
        "4... a6": "I don't agree with this move. The sequence it inaugurates ends badly for black. I would chose Qe7.. with the plan of Bg3 to pin white's knight and then rd8 to exploit the opening in the pawn line. ",
        "5. Bxc6+ bxc6 6. dxe5": "White is up a point, but is winning the opening decisively. Black's knight cannot move out anywhere safely, the bishop on f8 is trapped as well. It will be very hard from here on out for black to castle. Black makes the best choice possible on this situation to try and regain momentum. ",
        "6... a5": "Bg4 links the queen and the rock, which would free up black to take the e5 pawn and even out material. This will work, but it allows white to develop faster. ",
        "7. O-O Bg4": "I don't agree with this bishop aggression. Bg4 is better because the bishop is defended by the rook, black doesn't have to keep moving it. It also allows white to move Bf4 b/c the rook isn't threatened. ",
        "8. Bf4": "Erasing the material deficit just became much more difficult. ",
        "8... Ne7": "I don't agree with this move.. there is nowhere the knight can productively go from e7. Black moves it because he needs to castle, but I think moving the g6 then black's Bh6 is a better choice. ",
        "9. Qd3": "White has several options at this point.. Nd2 might have been a more prudent choice than moving the queen out. ",
        "9... Rb8": "This move is a waste. The rook will end up on the d column once black initiates the queen trade. ",
        "10. b3 dxe5": "the exchange is on. ",
        "11. Qxd8+ Rxd8 12. Nxe5": "I could have taken with the bishop to menace the c7 pawn... but I've learned from experience that is very bad if BxNf4, gx3 because it disrupts the king's defenses. ",
        "12... Be2": "A mistake. Forcing Re1 is good for white, the rook has to move out eventually and re1 protects the e4 pawn. ",
        "13. Re1 g6": "Baiting the back rank checkmate. I would chose a more aggressive move, Ng6 comes to mind. It would also free up the bishop and finally allow black to castle. ",
        "14. Nc3 Ba6": "Retreats",
        "15. Rad1": "This prevents the castling for an additional move and allows white to retake control of the center. ",
        "15... Rxd1 16. Rxd1": "Only possible response for black. ",
        "16... Bg7 17. Na4 O-O": "I would have delayed the castling to meet Nc5. Although I cannot see a move here that prevents Nc5. Also look how long it takes black to castle! The stage of black's development lags considerably behind white's. ",
        "18. Nc5 Be2": "I'm not sure why Be2.. the rook is going to move up the field anyway. Be2 does not stop Rd7 which is where white will snipe a pawn. ",
        "19. Rd7": "Black's knight is anchored to e7 in order to defend the c6 pawn. He has to defend it with either the rook or the bishop. He chooses the bishop I think was a mistake b/c the bishop is unsupported. ",
        "19... Bf6 20. Rxc7": "Is Rd8 a threat to white? ",
        "20... Rd8 21. Rd7": "Short answer... no. ",
        "21... Re8 22. Rd2": "In the event of a rook trade, I didn't want the bishop to be in a position to wreck havoc on my pawns. It also baits a trap... the only safe move for the bishop is Bh6. Bb5 leads to disaster. ",
        "22... Bb5 23. a4": "Retreat is blocked by the knight. ",
        "23... Bxe5": "Motivated more by desperation than strategy. ",
        "24. Bxe5 Nc8 25. Nd7": "Black has to respond to the imminent lose of his bishop or his rook. ",
        "25... Re6 26. axb5 cxb5": "White continues to accumulate material advantage. In this kind of position, I prefer to slowly accumulate a material lead instead of attempting a quick kill. That's not quite how it worked out here though. ",
        "27. f4": "supports the bishop so the knight can move around again. ",
        "27... Ne7": "Ne7 is a disaster... where can the knight move from here? what kind of attack can it support? Also it prevents the rook from being able to defend the against rd8#.. which is coming. From here.. Nc5 presents black with a terrible choice.. lose the rook or be checkmated. ",
        "28. Nc5 Rc6": "Opting for the latter course of action. ",
        "29. Rd8#": "There are several key points in this game. 1. d4 is difficult to meet in the Ruy Lopez. 2. Don't overmove periphery pieces when you need to develop your castling position. 3. Force a piece to move where it natural wants to go is not pressure. 4. Don't isolate the rook from the back rank unless the king is well defended. \n\nAs always, I'd like to thank black for the game. "
    },
    "url": "https://gameknot.com/annotation.pl/when-aggression-is-better-than-castling-successful-execution-of-the-ruy-lopez?gm=42952",
    "gameName": "When aggression is better than castling; successful execution of the Ruy Lopez",
    "players": "big_red (1487) vs. Anon.  (1568)",
    "opening": "Ruy Lopez (C62), old Steinitz defence, Nimzovich attack"
}