{
    "moves": {
        "1. d4 d5 2. Bf4 Nf6 3. h3 e6 4. Nf3 Nc6 5. e3 Bd6 6. Ne5 O-O": "Completely standard till here. I usually play g4, here, intending g5, Ne4, and I go into tactics with moves like Qg4 or h5. But this time I tried something different.",
        "7. Nd2 Nd7": "White cannot lose time in the opening, and Nd2 was a loss of time. Ok. So, against the liberatory f6 to black, I have one move to pose some counterthreat. ",
        "8. Qh5": "Qg4 was better, since if then f6, Qxe6+. But black can simply play Nf6 again, and my queen keeps around there pointlessly. \nWith this move, if black f6, white can think about Bd3 and if fxN, Qxh7+ etc. should do (?).\nOf course, black can go g6, and if he does, I'll go thinking if I dare Nxg6, then Bxg6 and Qxg6+...",
        "8... Ndxe5 9. dxe5": "Here I didn't like g6 at all, since I'll lose e5, with great damage for my game. I simply didn't think about it...",
        "9... Be7": "Thank you, sir. ",
        "10. Bd3": "No best place to have the bishop in. ",
        "10... g6": "Unavoidable. So, now what? ",
        "11. Qh6": "Just trying. The plan is h4-5, but it won't be easy.",
        "11... Kh8 12. Nf3": "...so the horsie goes in help, charged with poison. ",
        "12... Rg8": "Setting for himself the second part of the trap. ",
        "13. Bg5": "The bishop is untouchable: BxB, NxB, threatening mate. Rg7, h4. Still not clear...",
        "13... Qf8 14. Qh4 Bxg5 15. Nxg5": "Not bad, but not enough!",
        "15... Qg7": "And black seems to be well shielded!!!! How was it possible? I can't figure out where I did wrong... help! :-)",
        "16. f4": "Necessary. At least, black's queen is trapped. But my knight will soon be rejected, so I have to find something useful to do with it.",
        "16... Ne7 17. g4": "Preventing Nf5. I was dreaming of a plan to remove the d5 pawn (not easy wihtout his help) in order to go Ne4 - f6. Just a dream.",
        "17... h6 18. e4": "Interestingly, I have an unusual \"extra tempo\", since the pawn is pinned. Funny and unusual. ",
        "18... Bd7": "I cannot believe it! We are \"developping\"... ",
        "19. Rf1": "Ok, this was because if I decided to go exd5, and he didn't take with the e pawn, but with Nxd5, f4 is defended by the rook. Of course I didn't plan to exchange pawns, because exd5 benefits him. But maybe I could ever have broken in with f5...",
        "19... Rgf8": "My plan of Ne4 won't become true. ",
        "20. O-O-O": "To reinforce the idea of f5 in the near future. ",
        "20... Kg8": "Ok, time to go to the only place...",
        "21. Nf3": "Curiosely, I didn't see that with this move my queen attacks his knight. Neither of us did. ",
        "21... c5": "Oh, yes, and besides, black saw the right move to attack... once protected the knight!!",
        "22. c4": "Can you believe that? Such a stupid move, allowing d4, blocking all my pieces!!!??? :-)",
        "22... d4 23. Qxe7": "Finally. Ok, now I am winning, isn't it?",
        "23... Rad8 24. Qxc5": "Come to daddy.",
        "24... b6 25. Qa3": "Not Qxd4 because of Ba4, winning the exchange. Here a7 is threatened. ",
        "25... a5 26. Nxd4": "Ok. Is it not a winning position? So, what happened?",
        "26... Rdc8 27. Kb1": "b3 gives him strange ideas about a4, so better to support the pawn with the rooks, in case of. ",
        "27... Rfd8": "Except that I couldn't find where to break black's position! With +5, I am half tangled, and this cannot be considered black's strategy, I think! So I decided that by simplifying, even not to my clear advantage, would have had black to resent of his passive (even if very strong on e5) queen's position. ",
        "28. Nb5": "Black's lsb is the threat for white, so better to exchange for my unconfortable knight.",
        "28... Bxb5 29. cxb5 Rc7": "Even now, I don't have a clear attack. I think I should have just exchanged as many rooks I could, and play with the queen over b6. I'm not sure I played for that, really.",
        "30. Rf2 Rdd7": "I'd say ?, since the doubled rooks are potentially very strong. It forces me to Rf2-d2, and I can proceed with my simplification plan. ",
        "31. Rfd2": "Even now, +5, I am suffering from the \"weakness\" of e5. I cannot understand how I can feel tangled with such an advantage and such an overwhelming crowd of pawns... but my pieces are not coordinate for a kingside attack, and the extra bishop is playing no part at all in the fray. ",
        "31... f6": "And black \"sees\" it. After exf, black's queen is free, and dangerous, and f4 is under attack and I'll need to defend. But how can I avoid fxe and Qxe??",
        "32. Qb3": "Attacking e6.",
        "32... Qe7": "This was probably the right moment to play f5!, threatening f5xe6.",
        "33. Bc4": "This doesn't seem bad at all, though. He is forced to exchange rooks. ",
        "33... Rxd2 34. Bxe6+": "Yessir, I'm winning!",
        "34... Kg7": "Here of course if exf6+, Kxf6, and the bishop is lost. So...",
        "35. Rxd2": "See the next: ",
        "35... fxe5": "If Rf2, he cannot take the pawn because he will have to avoid Rf7. But hey, what about Qc5? \nSo I had to go something like Qd5, threatening Qe5+. I didn't. ",
        "36. fxe5": "Breaking the pawn's chain. I just overlooked the power of...",
        "36... Qc5": "!! So \"innocent\", so \"naive\". But e5 is just lost!!!! The only defence is Rd1, Qxe5. Ok, I wanted to try something different. If I go Qf3, and he exchanges and takes f3, I can make something whorthy with Rd7+... or at least I hoped so. ",
        "37. Qc3": "In thinking it, I overlooked...",
        "37... Qg1+": "And I am checkmated in the next. I couldn't believe it. Not a game to be proud of... but still curious, I hope. "
    },
    "url": "https://gameknot.com/annotation.pl/when-6-in-a-good-position-is-not-enough-to-win?gm=44122",
    "gameName": "When +6 in a good position is not enough to win :-(",
    "players": "damalfi  vs. flip27 ",
    "opening": "Queen's pawn, Mason variation (D00)"
}