{
    "moves": {
        "1. e4": "He opens with the standard e4, the most noble of openings!",
        "1... c6": "I prefer the Caro-Kann to the sicilian or the standard e5 reply. It usually yields a better pawn structure in the end game as well as solid play on the queen side.",
        "2. f4": "I usually see d4 or a Knight move so this was a bit surprising to me, though i'm sure it is a very normal move.",
        "2... d5": "so i'm just going to carry on with the Kann.",
        "3. e5": "all standard so far.",
        "3... Bf5": "develops the bishop. Standard Caro-Kann.",
        "4. Nf3 h6": "Probably a wasteful move but it keeps the g5 square out of the Knights hands and gives my bishop a place to go in case of h4. I'm not big on bishop for knight trades and i wanted a solid pawn structure.",
        "5. d4": "adds more infrastructure to his e5 pawn.",
        "5... e6": "Freeing up the dark squared bishop. Pretty standard caro-kann position.",
        "6. Bd3 Bxd3": "So i'm trading my bad bishop for his good bishop, i can't really see it being a bad thing, even if my bishop was outside the pawns.",
        "7. Qxd3 c5": "attacking the closed center from the wing and giving the c6 spot back to my knight.",
        "8. c3": "further defending his center pawns.",
        "8... Nc6": "adds pressure to the d4 orchid and develops. So far there really hasn't been any exciting play but it is still the opening.",
        "9. O-O": "tucking the king safely into the corner. White has a pretty fortified center and a safe king. Often times when play the Caro-Kann my king side stays undeveloped for a little while which probably isn't a good thing. However, i often have play on the queen side and when that opens up i am able to develop more.",
        "9... Rc8": "Preparing to open the c file for my Rook.",
        "10. f5": "This was a pretty solid move. He is looking to open up the center with my king still right in the thick of it. ",
        "10... cxd4": "But i'm going to carry on with my own plans of trying to control the c file.",
        "11. Nxd4": "With the advance of his f pawn, this capture now leaves the pawn at the e5 orchid unguarded.",
        "11... Nxe5": "So i snatch it, putting pressure on his lady.",
        "12. Qb5+ Qd7": "I'm wondering if Nc6 would of been better. My king side is still undeveloped and that pawn is looking to break open the center, so my thought process was that a queen trade would really slow the game down and give me a little more freedom to develop.",
        "13. fxe6": "retaking the pawn would leave his Knight at a really nice spot at e6, not something that is acceptable.",
        "13... Qxb5": "the only move to make i think.",
        "14. exf7+": "I'm in no hurry to retake the pawn, although Nxf7 might of been the course of action to take.",
        "14... Kd7": "I decided on this move. Once he takes the queen i can develop my other knight and his pawn won't be going anywhere.",
        "15. Nxb5 Nf6 16. Bf4": "develops his bishop to a good spot.",
        "16... Nxf7": "So now the board is opened up and my king is exposed, however without the queens on the board he isn't in any immediate danger so i'm okay with that.",
        "17. Nxa7": "Oh no! This is the first instance in this game where my opponent gets caught being greedy. Better would of been to develop the other knight and get the rooks into play.",
        "17... Bc5+": "So he may of went a pawn up, but that is very short lived as now he loses his Knight to the fork.",
        "18. Kh1 Bxa7": "So now i am up a minor piece minus a pawn and while my king is exposed, it really isn't a bad thing as my opponent is not in a position to take advantage of it.",
        "19. Na3": "Finally developing his Knight, eyeing the b5 orchid.",
        "19... Ne4": "Threatening check at f5 which would be pretty nasty for him. If he plays Nb5 i could just play Bb6 and the threat remains.",
        "20. Bg3": "Defends f5 but at this point i definitely feel like black has the advantage now.",
        "20... Nxg3+": "trading a knight for a bishop on an open board, as well as doubling his pawns. Can't be bad for me right?",
        "21. hxg3 Nd6": "Centralizing the Knight and taking away the b5 orchid from his Knight.",
        "22. Rad1": "Threatening the isolated pawn, however my king is there to provide that little extra support.",
        "22... Kc6 23. Nc2": "Looking to add pressure to the pawn on d5. How can i stop this?",
        "23... Rhf8": "Well that doesn't really help but at this point i just want to trade down and have a simplified end game.",
        "24. Nb4+": "wins the pawn. bummer...",
        "24... Kd7 25. Rxf8": "Necessary before taking the pawn.",
        "25... Rxf8 26. Rxd5": "So an interesting position here.",
        "26... Rf1+ 27. Kh2 Bg1+ 28. Kh3": "White has to be a little careful because of the pressure around his king. It isn't exactly in a great spot.",
        "28... Ke6 29. g4 Ne4": "Keeping his king somewhat trapped as well as getting the knight into the heart of the board.",
        "30. Rb5": "this is the second time my opponent gets a little greedy. I don't think that pawn should be one of his worries right now...",
        "30... g5": "His king is now stuck at that square and his pieces are all on the other side of the board. How can i take advantage of this?\n",
        "31. Rxb7": "Greed isn't that great in chess...",
        "31... Bf2": "White is in a bad way now.",
        "32. g3": "desperately trying to get away from the impending onslaught.",
        "32... Bxg3": "No such luck though, my pieces are all coordinated and ready for the kill.",
        "33. Kg2": "White is really in a bad way...",
        "33... Rf2+": "pushing him into the corner.",
        "34. Kg1": "Better would of been Kh1, it would of taken a move before i could finish him off. This just forces the mate.",
        "34... Bh2+": "only one option.",
        "35. Kh1 Ng3#": "I thought this was a real pretty mate, my pieces were all very coordinated for it. My opponent simply got greedy trying to grab that extra pawn instead of going back to home with his pieces. Lemme know what you all think."
    },
    "url": "https://gameknot.com/annotation.pl/when-greed-becomes-costly?gm=46474",
    "gameName": "When Greed Becomes Costly",
    "players": "gopackwin  vs. yrahcaz1990 ",
    "opening": "Caro-Kann defence (B10)"
}