{
    "moves": {
        "1. e4": "The King's Pawn opening, my personal favorite.\n\nNote: be sure to read the full introduction to this game (click the back arrow)",
        "1... e6": "The French Defence.  The pawn on e6 will support a pawn on d5.",
        "2. d4 d5 3. Nc3 c6": "Rather than threatening to win a pawn with 3) ... Bb4, black decides to solidify d4 further.  The potential downside to this opening is that black's light-square bishop will be very restricted if the center closes up.",
        "4. Nf3": "Developing the knight and possibly preparing an eventual Bg5.",
        "4... Ne7": "Although this move seems strange at first, it's the only real spot for the knight, since it could be kicked out of the f6 square after white plays e5.  The knight will soon move to g6, freeing up black's dark-square bishop.",
        "5. Bd3": "Developing the bishop to eye h7 after an eventual e5.",
        "5... Ng6": "Completing the knight maneuver and freeing the dark-square bishop.",
        "6. e5": "Leaving the database and closing up the center, thus restricting the mobility of black's light-sqare bishop.  My own light-square bishop is now poised for an eventual kingside attack.",
        "6... b5": "This move seemed a bit strange to me at first.  However, it does a couple of things for black.  First, it expands on the queenside.  Second, it gives black's light-square bishop room to develop.  Third, it has the possibility of attacking my knight on c3 with the move b4.",
        "7. O-O Be7": "Black prepares to castle as well.  I think that b4 is the better square for the bishop, but the bishop on e7 is still a farily solid defensive structure.",
        "8. Be3": "Developing the bishop and allowing me two options: Qd2 and Nd2.",
        "8... Nd7": "Rather than commit his king immediately by castling, black decides to develop his second knight.",
        "9. Nd2": "This move prepares the pawn thrust f2-f4, and also potentially prepares the knight maneuver Nd2-b3-c5, taking advantage of the weak square in black's position.  Of course, this knight manuever is more of a potential threat than an immediate threat, since both his knight and his bisop currently guard c5.",
        "9... O-O 10. f4": "Now that black's king is committed to the kingside, I can start my kingside attack.",
        "10... f5": "Closing the pawn structure and preventing f4-f5, as well as shutting off my light-square bishop from the attack.",
        "11. Qh5": "Although this move looks aggressive, there aren't any immediate threats behind it.  The most immediate threat is that of Rf1-f3-h3, attacking h7.  I now no longer have the possibility of exf6 ep, but I had a different plan for dealing with the pawn on f5.",
        "11... Bb4": "Threatening to double my pawns on the c-file.",
        "12. Ne2": "This move both removes black's threat of doubling pawns and starts to bring my knight potentially into the attack.",
        "12... Qh4": "With the kingside pressure inevitably mounting, trading off queens to reduce pressure is a good idea for black.",
        "13. Qxh4": "I considered a move like 13) Ng3 (which probably would have been better), but I decided that I would have enough pressure to form an attack even without the queens on the board.",
        "13... Nxh4 14. c3": "Removing the threat of black trading down material.  If I start trading down material, my chances of a successful attack dwindle.",
        "14... Be7 15. g3": "Continuing to push away his minor pieces from my position.",
        "15... Ng6": "Black is now defensive and a bit restricted.  However, there's still potential for counterplay from black on the queenside.",
        "16. Nf3": "Edging my pieces toward the kingside and eyeing the g5 square.  A knight on g5 would attack the currently undefended pawn on e6 (though he only needs to move his knight on d7 to defend it with the light-square bishop).",
        "16... a6": "Preparing to expand and generate play on the queenside with c6-c5.  16) ... c5 is impossible because the pawn on b5 would hang.",
        "17. Kh1": "At first glance, this move looks sort of odd.  However, it's all part of my kingside attack.  If I can put a rook on g1 and play g3-g4, I can start to bust open the kingside.",
        "17... c5": "Continuing with the plan of expanding on the queenside.",
        "18. Rfg1": "I'm not worried about the queenside, however.  I'm focusing my energy lining everything up for a kingside attack.  Of course, I can't ignore the queenside, but I looked and didn't see any tactical shots he had on the queenside.",
        "18... Bb7": "Finally developing the light-square bishop and connecting rooks on the back rank.  In the abstract, it also lines up his bishop with my knight (which is currently undefended) as well as my king, so I have to be wary of potential tactics.",
        "19. g4": "The only possible bishop tactics I saw for black existed if I capured his c5-pawn with my d4-pawn, so I went ahead with my plan of attacking the kingside.",
        "19... fxg4": "Black doesn't have much choice.  No matter what happens I will have the g-file to work with for my rooks.  If he allows 20) gxf5 exf5, I will have a protected passed pawn on e5 and I will still have the g-file open.  However, 19) ... fxg4 has its own downsides, as shown in the annotation for the next move.",
        "20. Rxg4": "I now threaten to win a pawn with 21) Bxg6 hxg6 22) Rxg6.  The only way to defend the pawn would be 22) ... Kf7, after which I still win the pawn after 23) Rag1, attacking the pawn once more.  Black cannot defend g6 enough.",
        "20... b4": "My opponent does not wish to bring his king out into the open, so he decides to continue with his counter-attack on the queenside.",
        "21. Bxg6": "Again, I saw nothing dangerous about his queenside counterplay, so I took my chance to win a pawn.",
        "21... hxg6 22. Rxg6": "Now I'm up material and have plans of doubling rooks on the g-file to continue the attack.",
        "22... Kf7": "This attacks my rook and prepares to move his king away from the now-open kingside.",
        "23. Rag1": "I now threaten to win a second pawn.",
        "23... Rfg8": "The only way to defend the pawn.",
        "24. f5": "A nastly little trap.  If black plays 24) exf5, then I immediately counter with 25) e5 , winning his knight.  The move 24) f5 also prepares to bring my bishop into the attack and threatens his pawn on e6.",
        "24... Nf8": "The only move.  I saw this move when I played f5 and had my response planned out.",
        "25. fxe6+": "The plan: simply trade off material since I'm ahead a pawn.",
        "25... Nxe6 26. Nf4": "Again, aiming to trade off material.",
        "26... Nxf4": "Considering that black is down a pawn, it would probably be better to have avoided the trade.",
        "27. Bxf4 Bc8": "Although this move seems a bit counter-intuitive because it moves the bishop back to where it came from, it has plans of chasing away my rook with 28) ... Bf5.  Unfortunately for black, I now have a tactical shot to win another pawn.",
        "28. Bh6": "! Because of black's last move, his pawn on g7 is now pinned to his rook on g8, so he can't take my bishop.  I will win the g7 pawn and have a passed pawn on the h-file.",
        "28... Bf5": "Since black can't do anything about the pawn, he instead chooses to move his light-square bishop into my position with and eventual Be4, pinning my undefended knight.",
        "29. Rg6xg7+": "Winning the second pawn.\n\nAlthough I hadn't yet lost my other game in the tournament, I made the dangerous psychological decision of telling myself that I had already won this game.  Although black is down material and position in an endgame, he still has chances for counterplay.  Winning a won game is possibly the hardest thing to do in chess.  When your opponent is down and on the verge of destruction, he/she will be looking for his/her chances the most.  If you make one slip, the game might just slip away from you, and recovering from such a psychological blow can be very difficult.",
        "29... Rxg7 30. Rxg7+": "Being up two pawns, all I need to do is trade off material (preferably the rooks) and I should have this game under wraps.  However, to do so I need to play the correct moves.  You don't win a chess game by making bad moves, after all.  You always need to play the best move, even in a winning position.",
        "30... Ke6": "Moving the king toward the center as opposed to letting it become trapped on the edge.  In the engame, the king is a valuable fighting piece, and should be treated as such.  This theme of an active king being used as an attacking piece will eventually become the deciding factor of this game.",
        "31. Bg5": "Again, offering to trade material and simplify.",
        "31... Bf8": "Of course, my opponent can't take on g5.  If he plays 31) Bxg5, then I end the game immediately with 32) Nxg5#.  My rook now looks like it's running out of room, but I use my rook's active position to my advantage.",
        "32. Rc7": "I now threaten two things.  One is to simply win the pawn on c5.  My other threat is to move my bishop, which then threatens Ng5# (note how my pawns and rook trap his king on e6).",
        "32... Be4": "Removing both threats by pinning my knight while simultaneously threatening to capture it for free.",
        "33. Kg2": "The only move to defend the knight, which is still pinned.",
        "33... bxc3": "Black finally relieves the tension on the queenside, but with a purpose.  After 34) bxc3 cxd4 35) cxd4, the threat of me winning the pawn on c5 no longer exists.",
        "34. bxc3 cxd4 35. cxd4": "And the position has now simplified itself a bit.  I was starting to feel a bit uneasy about winning the game because of the positioning of my two passed pawns.  Passed pawns that aren't too far advanced and have two files in between them are able to be picked off by a lone enemy king.\n\nI won't go into too much detail, but king-and-pawn endgame theory shows that two connected passed pawns are self-supported, since if the king takes the back one it will be unable to catch the other.  Likewise, passed pawns with one file between them are also self-supported due to a \"wall\" that they create.  Ironically, passed pawns with two files in between are no longer self-supported and can be picked off safely by the enemy king if the pawns are not advanced too far.\n\nAlthough this was a bit far-fetched of an analysis of the position, that thought started to weigh down on my mind.",
        "35... Bb4": "Potentially threatening Bc3 if I ever leave that square unguarded.  More importantly, though, it allows his rook to come into the game and threatens 36) ... Rf8, attacking the pinned piece.",
        "36. Kf2": "I continue to centralize my king while unpinning the knight.  If black tries 36) ... Rf8, which threatens the knight, then I can play 37) Bf6 to adequately defend.",
        "36... Bxf3": "An interesting idea by black.  After my king recaptures, he will be able to move his rook onto the open file with check, buying him some time.",
        "37. Kxf3 Rf8+": "Now if I make a move like 38) Kg4, he will have the possibility of 38) ... Rf2, winning either the a-pawn or the h-pawn.",
        "38. Ke2": "This move guards f2 while staying on light squares to avoid check by black's bishop.  Ke3 was probably a bit more accurate, though, and black utilizes my poor decision a bit later on.  The mistake: putting my king on the same rank as my pawns.",
        "38... a5": "Avoiding a fork of his king an pawn after Rc6 .  This move also solidifies his bishop and pawn, who now defend each other and cannot be easily attacked.",
        "39. h4": "Likewise, I connect my pawn and bishop so that each defends the other.",
        "39... Rh8": "Stopping me from pushing my passed h-pawn.\n\nIt was around this point in the game where I blundered in my other game.  I was frustrated at myself for making such a huge blunder in that other game (I was calculating a bunch of endgame lines and missed the fact that my first move allowed him to take my rook for free), and suddenly needed to win this game in order to advance in the tournament.  The psychological pressure definitely started affecting my moves, which were sometimes too forcing and not calculated enough.  My next move is a good example of this.",
        "40. Rc6+": "This move had the wishful thinking that he would go after my weak d-pawn with his king and play 40) ... Kf5.  My plan was then 41) Rf6 , hoping for him to play 41) ... Ke4, allowing 42) Rf4#.\n\nOf course, I had calculated out other lines for black, and with each line I tried to convince myself that there was something there such that I could win by force.  The line that my opponent played was one that I had calculated out, but incorrectly evaluated at the end.\n\nThe move I probably should have played was 40) Kd3, as you will see later on.",
        "40... Kd7": "This almost seems to be the most obvious move, attacking the rook (it was also the move that I most expected to see him play).  I continued with my calculated line.",
        "41. Rh6": "Offering a trade of rooks, which would effectively win the game for me.",
        "41... Rc8": "As I expected, he declined the trade.  I also expected him to move to one of the open files, and probably the c-file, since it threatens Rc2 , winning a pawn.  This is the reason that 36) Kf2 was a mistake: it allows black to threaten Rc2 .  This is also why I should have played 40) Kd3.  Leaving my king on e2 was a mistake, and part of the reason I missed it being a mistake was because I was focusing on my attack, and not thinking clearly about his possible counter-attacks.\n\nIf my king were on d3, he probably would have moved his rook to f8 instead of c8 in order to threaten the move Rf2.  If his rook was on f8 instead of c8, his 42nd move would have needed to be different than what it was.  This would allow my to move my rook behind my passed e-pawn.  All will be explained in the next move's annotation.",
        "42. e6+": "Now it becomes clear why the rook can't be on f8.  If his rook is on f8 and he moves his king to d6 (or c6, like he did in the game), then I would have 43) e7 , winning the rook on f8.  If his rook is on f8 and he plays 42) ... Kc7 [or Kc8], then I play 43) e7, threatening his rook and preparing Re6 to get behind my passed pawn.  If his rook is on f8 and he plays 42) ... Ke8, I play 43) Bf6, followed by Rh8, forcing a trade of rooks.\n\nBack to the game, this was all still part of my calculation made on move 40.  I figured he would move his king to c7, c6, or d6.  Afterwards, I would play 43) e7[ ], and he would play 43) ... Kd7.  That is what ended up happening in the game.",
        "42... Kc6 43. e7+ Kd7": "Now black is threatening my pawn on e7.  I'm still focused on trying to force a win, and I didn't want to just give up my passed pawn that was advanced so far.  I would love to play Re6 to get behind the passed pawn, but his king defends the e6 square.",
        "44. Rh7": "The only move to defend the pawn.  However, this move was still a mistake.  This was still part of my calculation on move 40, and the continuation I saw was 44) ... Re8, attacking the pawn once more.  After this I would play 45) a4, and after all exchanges took place I would have a winning king-and-pawn endgame.\n\nHere again comes the theme of psychology.  I was convinced that he would play 44) ... Re8.  I never even considered what he actually played.  The move I should have played was 44) Kd3.  I needed to let my e-pawn go, since I would still be up a pawn in a rook-and-pawn endgame.",
        "44... Rc2+": "The irony of it all is that I saw earlier in my calculation that Rc2  was a threat made by Rc8.  I wanted to force a win so badly that I missed the simple fork that I had seen earlier.  Now I lose my a-pawn, and he gets a passed pawn of his own on a5.",
        "45. Kf3": "Considering that his bishop, pawn, and rook form a wall preventing my king from getting to the queenside, bringing my king around this way was the correct idea.\n\nHowever, I'm now in a bit of psychological trouble.  I was two pawns ahead in an endgame.  Now I'm only one pawn ahead and he has a passed pawn.  I was looking for any opportunity I had to try to force a win.  The most direct route I saw was by bringing my king to e5 to attack his pawn on d5.  His bishop can't defend it, his rook has a hard time defending it, and his king can't defend it because it needs to defend the queening square of my pawn on e7.\n\nMy plan was to play 46) Kf4 and 47) Ke5.  I saw his saving move 46) ... Re2, but I found myself not caring due to my mindset of needing to win.  I was trying to lock onto anything I could.",
        "45... Rxa2 46. Kf4 Re2": "Now I was starting to feel worried, since my opponent has stopped my plan of reaching e5 with my king.  At this point in the game I tried calculating out what the endgame would be like after 47) h5 Bxe7 48) Bxe7 Rxe7 49) Rxe7 Kxe7.  I can't remember my exact calculations, but I think I ended up seeing both of us queening with me queening first for one line.  Actually, my mind kept on wandering through calculations and I don't know if I was thinking perfectly clearly.\n\nI'll go through some calculations I've made since the game ended.  First off, I can't run my h-pawn up the board alone because his king is close enough to catch it.  If I try 50) Kg5 to defend my pawn as it comes up the board, then my opponent plays 50) ... Kf7, and he can pin my king against the edge, blocking my h-pawn.  After that, he can simply queen his a-pawn, and I would lose.  The final idea was a rather long one: each of us going after the other's pawn and coming back to the pawns on the d-file.  Neither of us moves our pawn because it just wastes a tempo for our king.  The variation runs as follows: 50) Ke3 Kf6 51) Kd3 Kg5 52) Kc3 Kxh5 53) Kb3 Kg4 54) Ka4 Kf4 55) Kxa5 Ke4.  There's nothing I can do to stop 56) ... Kxd4, and an eventual win by black.\n\nI ended up pretty tired after trying to calculate everything out and not seeing a win for me, so I went with option number two:",
        "47. e8=Q+": "Double-check, forcing his king to take the queen on e8.  Again, I had a calculation in mind that gave him chances to slip up, but would ultimately end up a draw if my opponent played correctly.",
        "47... Kxe8": "Forced.  I now played a move which did nothing except move him into temptation.  My opponent played the first move I was looking for, but played correctly later on when I needed him to slip up a second time.",
        "48. Ra7": "The temptation for black: 48) ... Re4 , which forks the king and pawn.\n\nWhen I was calculating out black's possible responses to my 48th move, I found the move 48) ... Bc3, which would basically force a draw.  The continuation I saw was 49) Bf6 [defending the attacked pawn] Re4  [winning the pawn] 50) Kf5 Bxd4 51) Bxd4 Rxd4 52) Rxa5 Rxh4 53) Rxd5 Rh5  54) Ke6 [or Ke4] Rxd5 55) Kxd5 and draw by insufficient material.  Note that 50) Kf3 would lead to the same general thing, except it would be king and rook vs. king and rook, which is a technical draw.",
        "48... Re4+": "My opponent missed his immediate chance at a draw, and instead played what I had calculated out.",
        "49. Kf5": "My king being in close proximity to his king is a crucial element of my plan.",
        "49... Rxd4 50. Ke6": "! And now black is in a bit of trouble.  He is still able to save the game with 50) ... Re4  51) Kxd5, evening up the material and becoming a technical draw.  My plan, though, was for him to mess up and play 50) ... Kf8 instead (the only other move that stops checkmate without immediately losing material).  I would have then played 51) Ra8 , forcing 51) ... Kg7.  Then I would have 52) Bf6 , winning his rook.\n\nAll this was still part of the calculation I made back on move 47.  I had my hopes up, but my opponent played the correct move.",
        "50... Re4+": "Giving up the pawn, but avoiding the tactics I mentioned before.",
        "51. Kxd5 Re1": "My opponent now has plans of moving his rook behind my passed pawn.  The way the board sits, it should probably be a draw.  The main reason I kept on playing was because I needed the win.  I saw that it would be hard for me to lose the position, so I kept trying to find the forced win, even though there really isn't one in this position.",
        "52. Kc4": "My idea behind this move was to somehow win his pawn on a5 after getting my king to b5.  After the game, I later discovered that I should have instead played 52) Bf6.  The plan behind putting the bishop on f6 would be to put the bisop on d5 and the king on e6.  The most likely continuation would be 52) ... Rh1 [getting behind my passed pawn] 53) Ke6 Re1  54) Be5 Be7 [the only move to stop checkmate] 55) Rxa5.  This would win a pawn for me and give me a better shot at winning the game.\n\nI think that a lot of the reason why I didn't see 52) Bf6 was because I was looking for a direct way to win.  Piling up pieces on a5 is the direct way to win the pawn.  However, black should still be able to pull off a draw in this position.  The only key difference between my position and black's position is that my king is active in the center, while his is pinned against the edge of the board.  With this, I have a small advantage and can try to use it to win the game.  Of course, the advantage is so small that the game should still technically be a draw.",
        "52... Rh1": "Putting his rook behind my passed pawn and creating an odd symmetry in the position.",
        "53. Kd5": "At this point in the game I realized that the king on e6 and the bisop on e5 was the correct idea.  My mind had calmed down a little bit.  However, I was still playing off of wishful thinking.",
        "53... Be1": "?? Black's costly blunder of the game.  Although it doesn't look like a complete blunder at first glance (no material is lost and it attacks my h-pawn), there is a crucial element to the position that loses the game for black.\n\nWhite to move, mate in 5.",
        "54. Ke6": "! To be honest, I didn't see just how powerful this move was when I played it.  It wasn't until I was looking at what to do for my 55th move that I found the win for white.\n\nNow it becomes clear why 53) ... Be1 was a serious blunder.  Black's bishop blocks the checking square for black's rook!  Black has only one move to avoid Ra8#, which he played.",
        "54... Kf8": "I looked at this position for a long time, calculating out possible lines for me.  I looked at 55) Ra8  for the longest time.  After the king moves to g7, I looked at 56) Bd6 .  Unfortunately, black can survive with 56) ... Kg6.  The king will be able to escape to h5 and g4.  I also looked at 56) ... Kh7, and saw a win for white.  Only after looking for a while did I find the winning move, and I started to get excited.",
        "55. Bf6": "!! The quiet bishop move that wins the game by force.  Now black is forced to play 55) ... Kg8 to avoid Ra8#.",
        "55... Kg8": "Forced.",
        "56. Ra8+": "Only now do I give check with the rook.  His king is now forced to go to h7...",
        "56... Kh7": "...and we've reached the position I looked at after 55) Ra8  Kg7 56) Bf6  Kh7.  Had I not gone through all the lines of 55) Ra8 , I don't think I ever would have found this position, which I have forced by changing my move order.  All it takes is one final nail in the coffin and black is done for.",
        "57. Kf7": "! One final exclaim.  In the beginning of my final combination, his bishop stopped him from delievering check to my king.  Now in the ending, my own bishop stops him from checking my king!  At this point in the game black resigned, because there's nothing he can do to stop 58) Rh8#.\n\nThere's a certain beauty surrounding my final combination.  A checkmating net formed by a king, bishop, and rook.  A net where there was a single checking move before the final checkmate.  This brings up yet another theme: the threat is often stronger than the execution in chess.  If you leave several threats hanging in the air, your opponent will have to try to defend all those threats.  Once you grab on to one threat, though, your opponent no longer has to worry about many threats and can simply defend one.  One final psychological theme out of many found in this game.\n\nAnother note: the \"need to win\" was what caused my opponent to get back in the game, and it was also his downfall.  My opponent acknowledged that he needed to keep his bishop and pawn connected, and the game would probably be a draw.  However, he went for the \"win\" by attacking my pawn, not fully realizing the consequences.\n\nI hope you enjoyed reading this annotation, and I also hope you learned something from it.  I hope you not only learned from the final combination, but also from the psychological themes that appeared in this game.  Psychology is a huge part of chess, especially in over-the-board games."
    },
    "url": "https://gameknot.com/annotation.pl/when-you-have-to-win?gm=746",
    "gameName": "When You Have to Win",
    "players": "yttrio (1650) vs. driss (1527)",
    "opening": "French (C10), Paulsen variation"
}