{
    "moves": {
        "1. e4": "Hi everyone!\n\nAfter conceding that Low Draw against Dan in that K & P ending, in my return match against him I find myself in a rook ending a pawn up.  Dan ended up losing a pawn in the middlegame in order to beat off Old Matey who was loitering with intent on his kingside.  I found it really hard to make my advantage work and I had to watch out that Henry did not get stalemated on a8!  So, did I get out of that one?  Well, there is only one way to find out, my friends, READ ON!",
        "1... e6": "1. .... e6 - the French Defense.",
        "2. d4 d6": "2...... d6 - unusual.  As Alice in Wonderland would say, \"Curiouser ......",
        "3. Nc3 a6": "3. ..... a6 - and curiouser!",
        "4. Nf3 h6": "4. ..... h6 - hmm, maybe he is trying to take a leaf out of the Master Mater's book and play a few wacky openings and try and sucker me mid game!",
        "5. Bd3 Nc6": "5. ..... Nc6 - at last, he develops a knight!",
        "6. O-O Nge7": "6. ..... Nge7 - and the other!",
        "7. a3 d5 8. exd5 Nxd5 9. Nxd5 Qxd5": "9. ..... Qxd5 - after this plethora of exchanges, the Wicked Witch of the West occupies a strong central vantage point.  I will pull out all the stops to eject her from there!",
        "10. c3 Be7 11. Re1": "11. Re1 - patience.",
        "11... Qd8": "11. ...... Qd8 - aha, a retreat!",
        "12. Bf4 Bf6 13. Qc2": "13. Qc2 - waiting for King Dan to land on g8.",
        "13... Ne7 14. Rad1": "14. Rad1 - as Ion said in a previous match \"Always put rook on same file as enemy queen no matter how many pieces are in the way\".  It is amazing how many players can be hit by tactical shots this way.",
        "14... c6 15. Be5 Bxe5 16. Nxe5": "16. Nxe5 - bishop trade.",
        "16... O-O 17. Bc4 Nd5 18. Rd3": "18. Rd3 - I start to plan my mating attack.",
        "18... Qc7 19. Rg3": "19. Rg3 - with a rook lift.",
        "19... b5 20. Ba2 Bb7 21. Re4": "21. Re4 - and another!",
        "21... f5 22. Rh4 Rf6": "22. ..... Rf6 - organising his defense.",
        "23. Bxd5 cxd5": "23. ..... cxd5 - B for N trade.",
        "24. Qd2 Kh7 25. f4 Raf8 26. Qe2": "26. Qe2 - edging toward King Dan.",
        "26... Bc6 27. Rgh3 Be8 28. Nf3": "28. Nf3 - can't seem to find enough pieces for that killer blow.",
        "28... Kg8 29. Nd2 Bg6 30. Nb3": "30. Nb3 - I hit on plan B!",
        "30... Qc4 31. Qxc4 bxc4": "31. ...... bxc4 - Stage 1, queen trade .....",
        "32. Nc5": "32. Nc5 - Stage 2 - one knight fork threatens another.  I am threatening either Nd7 forking the rooks on the f column and the black pawn on a6.  Dan defends with Be8 but abandons the pawn on a6.  The knight captures it and that poor little p(r)awn finds itself on Henry and Glenda's belated Valentine's Day menu!",
        "32... Be8 33. Nxa6 Rg6 34. Nc5 Rff6 35. Re3": "35. Re3 - pressure on e6.",
        "35... Kf7 36. Rhh3 Rg4 37. Rhf3": "37. Rhf3 - defending f4.",
        "37... Ke7 38. a4": "38. a4 - I think it is time to push my outside passer.",
        "38... Kd6 39. a5": "39. a5 - onwards and upwards.",
        "39... Rgg6 40. Rfg3 Rxg3 41. Rxg3": "41. Rxg3 - rook trade.",
        "41... g6 42. Re3 Bc6 43. Kf2": "43. Kf2 - Henry is heading towards the queenside to try and facilitate a tearful reunion with Glenda.",
        "43... h5 44. h4 Ba8 45. Ke2 Bc6": "45. ..... Bc6 - at the moment, Dan is scratching around.  Good. Meanwhile, Henry keeps on heading east.",
        "46. Kd2 Bd7 47. Kc2 Rf8": "47. ...... Rf8 - now the black rook finally threatens to spoil Henry and Glenda's Valentine's Party.",
        "48. Nxd7 Kxd7": "48. ..... Kxd7 - now for a N for B trade.  Can Henry get to the a pawn in time?  We shall see!",
        "49. Rg3 Rg8 50. b4 cxb3 e.p.+ 51. Kxb3": "51. Kxb3 - yes he can!",
        "51... Ke7 52. Ka4 Kf7": "52. .... Kf7 - keeping guard over the g6 pawn.",
        "53. a6": "53. a6 - just two squares away from Glendadom.",
        "53... Rb8 54. Ka5 Rb1": "54. ..... Rb1 - Oh dear - Henry is confined to the a column - can he escape?  We shall see!",
        "55. Rd3 Ra1+ 56. Kb6 Rb1+ 57. Ka7": "57. Ka7 - Henry takes refuge behind the passed pawn but he is well and truly ...... stoooock!",
        "57... Ke7 58. Rd2 Rb3 59. Rc2 Kd7 60. c4": "60. c4 - trying to open the c file to cut off King Dan from it!",
        "60... dxc4 61. Rxc4": "61. Rxc4 - pawn trade.",
        "61... Rb2 62. Rc3 Rb5 63. Rg3 Ke7 64. Rxg6": "64. Rxg6 - finally the g6 pawn falls and so does the rest of black's kingside.",
        "64... Kf7 65. Rg5 Rb4 66. Rxh5": "66. Rxh5 - another p(r)awn for the table!",
        "66... Kg7 67. Rg5+": "67. Rg5+ - now I have another passer, this time on the h column.  This is gonna be mega useful.",
        "67... Kf7 68. h5": "68. h5 - yup, Glenda is now threatening to appear on h8!",
        "68... Rxd4 69. h6": "69. h6 - said the a6 pawn to the h6 pawn, \"I'll race ya!\"",
        "69... Rd7+ 70. Kb8 Rd8+ 71. Kc7": "71. Kc7 - stops all checks - dead!",
        "71... Re8 72. Rg7+ Kf6": "72. ..... Kf6 - with Henry shielded from rook checks along the 7th rank, it is now curtains for Dan.",
        "73. a7": "73. a7 - this move now prompts Dan to hit the resign button.  Dan will have to give up his rook for the pawn to stop Glenda making her appearance on a8.  However, once the rook and the pawn have been traded off, Henry will head towards the kingside to protect his rook and to allow Glenda to appear on h8 and proceed to m8.  That's all for now folks but I will be back!  Anyhow - have a nice evening everyone!  Bye for now - Joanne"
    },
    "url": "https://gameknot.com/annotation.pl/where-theres-a-will-theres-a-way?gm=54056",
    "gameName": "Where there's a will, there's a way!",
    "players": "jstevens1 (1852) vs. pennsylvaniadan (1531)",
    "opening": "Lengfellner system (C00)"
}