{
    "moves": {
        "1. e4": "The King's Pawn Opening.",
        "1... c5": "As usual, I respond with the Siclian Defense.",
        "2. d4": "This is ok, but I would have played 2.Nf3, for the Open Sicilian.  However, this is not going to be an Open variation, but it will become the Morra Gambit.  Now, I also know how to handle this variation.",
        "2... cxd4 3. Qxd4 Nc6": "There is one drawback, however.  This gambit involves capturing with the Queen, so I decide to drive it away, while developing.  Right now, everything looks good, but I will stop developing and resort to unsound aggression, momentarily.",
        "4. Qc3 e6": "At this point, I want to develop my DSB, and transpose the Morra Gambit into the French Defense.  That is why I played this. ",
        "5. Qf3": "I do not know why he moved there, but this is where I start my unsound aggression tactic.  How will I do this?  ",
        "5... Nb4": "That's how.  Like my last game against blitzkov, I want to win his a1 rook and take away his opportunity to castle, in one move.  In this position, his only options are 6.Bd3.  However, if 6.Qd3??, 6...Nxd3, winning his Queen and the game.  This time, however, my plan will work because he will not play 6.Bd3.  Therefore, he allows me to take his c2 pawn and a1 rook.  In addition, it is no longer feasible to castle.  As a result, I am now in favor to win this game.  Note: I am not saying that this is his loosing blunder.",
        "6. Bc4 Nxc2+ 7. Kd1 Nxa1 8. Nc3": "Now, he decides to develop his knight, but his center is destroyed.  In other words, he cannot control the center, any longer, because his rook is gone.  Note: To control the center, both of your rooks have to be connected.  Although I can control the center, I will not bother because I will come up with other ways to defeat him.",
        "8... Bb4": "I decide to his knight.  Although it is not pinned, his c3 knight is almost trapped.  In this position, his knight can only be saved with 8...Ne2.  However, he does not play this, so I will take with 9...exd5.  BTW, I wanted to put him in this situation, and that is why I played this.  Having said that 9.Nd5 will be his loosing blunder.  Note: my goal is to chase his knight away so that I can mate him.  Why does 9.Nd5?? loose, and how will I mate him?",
        "9. Nd5 exd5 10. Bxd5": "That is the answer.  Now that his Knight and LSB are away from the c file, I try to mate him quickly.  What is my plan?  ",
        "10... Qc7": "!! This is it.  If he is not careful, 11...Qc2#, mating him in one.  I know that he will spot this threat, so why did I play this?  Even if I cannot mate in one, I will eventually mate, sooner or later.  It might take a long time, but I will find a way to mate him with my Queen and Knight.  BTW, that is why 9.Nd5?? was his decisive mistake and the loosing blunder.  In addition, that is also why this move deserves two exclamation points.  Note: A !! move=an extraordinarily brilliant, even if it takes a long time.  It is not reserved for a really solid move, that does not have long lasting effects.  This time, however, my plan is inevitable.  I was very scrupulous with this position and did a lot of HW, to come up with this plan.",
        "11. Qxf7+": "! He discovers my plan, so he decides to place me in check.  What does this accomplish?  In this position, I have lost my opportunity to castle.  I normally make a big deal, about this, but I no longer care about the center.  Why?  I know that is a matter of time before I mate him, even if it takes a long time.  In fact, he will continue with perpetual checks because he thinks that he will mate in one.  However, this is not going to happen.  Instead, I will stick to my plans because I know that it will lead to mate.",
        "11... Kd8 12. Bg5+": "Now, he thinks that he has won.  In fact, he believes that it is mate in one.  Why?  12...Nf6, or 12...Ne7 are my only options, so he figures 13.Qe7#.  However, 13.Qe7+??, does not mate.  Instead, 13...Bxe7, so he looses his Queen and the game, immediately.  He knows this, so he decides to play 13.Bxf6+.",
        "12... Nf6": "As noted earlier, I could have responded with Ne7, but this is best.  If 12...Ne7, 13.Bxe7+, Bxe7 14.Qxg7, so he gets a pawn back.",
        "13. Bxf6+ gxf6": "This move is forced, but I do not mind.  Why?  In this position, I won his dominant bishop.",
        "14. Qxf6+": "This is a serious because it forks my King and h8 rook.  After I get out of check, he will win the rook.  However, I am not going to give up because I know that I will still defeat him, sooner or later.  This is a similar situation to my last game against blitzkov because the game was lost, but I decided to continue because I thought that I had a chance to win.  This time, however, I know that I am going to do that, but I am not going to underestimate.  Why?  Being overconfident will cost me the game.",
        "14... Ke8 15. Qxh8+ Ke7": "Also forced.  This time, however, it is a problem because my King is exposed, and it is now more open then his King.  However, I am not going to give up because I know his weak spot, and that is why I am going to mate, as I had noted earlier.",
        "16. Qxh7+": "He wins a pawn, with this check, but I know that there is a way, out of this.  However, I cannot do this with 16...Kf8, or 17.Qg8#, mating me in one.  BTW, I am familiar with this type of mating threat because it is a similar Scenario to SM (Scholar's Mate).",
        "16... Ke8 17. Qh8+": "Therefore, this is a nuisance check, instead of, a mating move.",
        "17... Ke7": "Before I saw an immediate mating threat, I figured that I would settle with a draw by repetition, as I would be satisfied.  ",
        "18. Qh4+": "However, he figures out a way to avoid the Threefold, and that is what I wanted.  As it turns out, 17...Ke7 was a trap, and it worked.  My goal is to distract him, so that I could mate him sooner, but that is not going to happen.  However, I am going to get him, sooner or later.",
        "18... Kd6": "?? This should have lost.  Why?",
        "19. Qf6+": "Best was 19.Qf4.  Then, he could have played 20.Qxc7!, winning my Queen.  I did not realize this, until now.  That is why 18...Kd6?? was a serious blunder.",
        "19... Kc5 20. Qe7+": "He decides to place me in another check.  This time, however, it benefits.  In other words, this was a harmful.  In this position, I can win his Queen, but I will do something that will immediately win.  This is going to happen because of my a1 knight, so stay tuned.",
        "20... Kb5 21. a4+": "First, he will check again, but I am going to take.  ",
        "21... Kxa4 22. b3+": "This is the last time that he will place me in check..",
        "22... Ka3": "Until now, I thought that this was my only option, but 22...Nxb3 was another option.",
        "23. Qf6": "Now, the game is lost for black.  Why?  In this position, I will mate in one, with 23...Qc2#, and that is whey 10...Qc7 was the winning move.",
        "23... Qc2#": "This was almost, as bad as, my last game against blitzkov, in terms of my performance. but that is the point of this annotation.  Most of the time, a good opening, developing, and controlling the center are needed to win.  There are occassions, however, where you have to play badly, in order to play well and defeat your opponent.  That is the moral, of this annotation.  "
    },
    "url": "https://gameknot.com/annotation.pl/where-poor-opening-play-wins?gm=46210",
    "gameName": "Where, \"Poor Opening Play\" Wins",
    "players": "youthanasia666 (1086) vs. jkarp (1102)",
    "opening": "Sicilian (B21), Andreaschek gambit"
}