{
    "moves": {
        "1. e4": "this all began on a sunny day in greece...as usual i started out with the French Ketchup opening.",
        "1... e6": "he countered my french ketchup with a nasty little move, not sure what this one is called, but it doesn't smell like ketchup. ",
        "2. d4": "ahh, yes, this is where it all begins, i now bring in the guns, his no name opener is no match for this ketchup master....watch as it starts coming down!",
        "2... Nf6": "see, here he is obviously scared by the ketchup covered beginnings that he is just moving random pieces, at any given place with an open square, hoping to distract me from my messy death hole with which i will place him in.  mmmm  yummy!",
        "3. Bg5": "i act with speed, and pin his horsey.  for those who are just starting.  If he moves his donkey then i will snag a queen and then proceed by jumping up and down yelling \"ketchup is king\".  lets watch to see what happens!",
        "3... Be7": "hmm.  well he didn't move his Q, he must have seen my plans that i left open on my desk earlier today!   i'll have to stop doing that.  no worries, i have better and bigger plans up my sleeve.  his Q will be mine!!!!!!1111",
        "4. e5": "i continue with my stern moves, i am clearly at this moment trying to take over the center of the board, which i have pretty much mastered at the moment.  and we all know, that whoever has the center will prevail in the end.  so pretty much my opponent should just resign....long live the ketchup opener!!!!",
        "4... c6": "well, he's basically just giving me the center...this is gonna be awesome, this is going to be easier than ramming my body head first into a pile of bricks.  I don't really see any benefit to this move, I've searched and i could not find any references that claim this position.  though it seems that he is trying to free his Queen side castle.  lets see what happens next.",
        "5. exf6": "at this point i have decided that it was partial to my victory to take his horse figurine.   it was not completely necessary, as this move is not out-lined in the ketchup tactics notebook, but what is most important is that i am now at PLUS THREE in my score, and he is still at zero.....i am winning!",
        "5... Bxf6": "from all my years of playing, how could i have not predicted such a move?  i am stupid, i did not realize that was going to happen.  it's okay though, i am still at PLUS TWO, i am still in the lead.  just need to make no more mistakes from here on out! ",
        "6. Bxf6": "I wasn't ready for this, he struck me by surprise here, i thought he was going to attack using his usual pirate ambush tactic, which i was ready for, which is why i pressured his black bishop with my black bishop.  he could have easily of backed off, but he chose not to, im thinking that he is trying to open up my king side, and then hope to break my pawn forcefield, ha ha, like that will happen.",
        "6... Qxf6": "well now he's really in for a kick in the spleen.  I've had to result in bringing my queen out, i did this for a reason, i could have alternately moved my G pawn and captured his bishop, but i am smarter than that.  He wanted me to use my G pawn, so i surprised him, and brought out the big guns.  he won't see this coming, now im smooth sailing, it's all pretty much downhill for him, im hoping for a checkmate in under 10 moves. ",
        "7. Bd3": "okay, his bishop is now brought to the front line, in an obvious attempt to attack my H pawn on the queen side.  instead of capturing my opponents D pawn with my Q.  notice his position as of now.  He has a direct line of attack all the way down on both sides of the board with his white bishop.  my plans are to slowly move all of my pieces to black squares.  how will his bishop attack if all my men are on black???!!!111  EXACTLY!!",
        "7... d6": "so he wanted me to take his middle side pawn with my queen!  instead I step out my C pawn, in an effort to clear out my king side, to castle!  he thought i would take his pawn, and once again, i have out smarted him!  and at the same time i have landed yet another piece on a black square.  chess is all about multi-tasking, i have mastered this feat.  i am almost always doing something else while playing chess, sometimes I'm eating a pizza, or a waffle.  Once i even took a shower while in the middle of a chess battle.  Yes i did lose that game, but i have never lost while being SO clean.",
        "8. d5": "This is where im starting to get scared.  even after i tried to scare him with my pawn brick wall, he keeps pressing his D pawn forward.  i can only guess it's to try and penetrate my wall of pawns, but for what reason?  He has no chance at victory.  Possible suicide maybe?  We can only hope!",
        "8... exd5": "with his previous daring move to penetrate my wall of stone hard pawns, he wants me to swap pawns, and i really don't have a choice, this is probably his best move of the game.  the question is:  which pawn should i swap?  im sure he would like me to swap with my E pawn, so i should swap with my C pawn.  But wait, he knows that i know that he wants me to swap with the E which means that he knows that i will swap with the other one.  so his plans are being built on this single swap.  he is counting on me knowing what he knows.  so instead i will indeed strike with my E pawn.  completely knocking him off his feet, and having to re-think his entire plans.",
        "9. Qe2+": "at this point, I'm starting to re-think my process.  Originally i was thinking this was going to be an easy win for me like all the rest of them have been.  His Q just placed me in check.  i can either throw my own queen in front of this assassin attempt, OR i could signal for my whit bishop to pull the grenade launcher out and blast my opponent off the map.  ",
        "9... Be6": "well, i choose to just wimp out and move my white bishop into play to block the punch.  ",
        "10. Nc3": "oh oh, he's letting his horsey out of his stall.  now there's going to be horse poop everywhere.  Bringing the horse out doesn't seem to really do anything to me at all, so i must keep pressing onward with my plan.  I still have several pieces that need to be moved onto black squares.  it's a slow process, but in the end, completely worth it.",
        "10... c5": "perfect, i have him exactly where i need him.  I bet he's gonna move his donkey again, i bet it's gonna be in another \"L\" shape like his last one....he's so predictable!",
        "11. Nxd5": "i know his moves too well, i study this guy like last weeks math homework, i know how he works.   Right now he is targeting my queen, on the not the king's side (queen side for the lay people).  and i can smell his horse feces already!  I have no choice but to retreat my queen. ",
        "11... Qd8": "my king needs a little loving anyways, we haven't had physical contact in like ......wellllllllll, anyway!  so my guess is that he is next going to try and open up his queen side castle.  he's going to defiantly move his A pawn up two spaces to free his castle.\n\n\n\n[SAVE FOR LATER]\nhis Q up against the front sidewall, which in turn would open up my BFG (Bobby Fischer's Gap).  This type of move can only be managed by only the best trained chess players.  I doubt at any means that he will be able to pull this BFG off.  There have only been three recorded events of this being accomplished EVER.",
        "12. O-O-O": "....or a queen side castle.....which was my second guess.    he always castles on the  12th move, it's a given, i don't even have to worry about him not doing it.  He has it built into his conditional moves to always castle on #12.",
        "12... Nd7": "i proceed to engage my knight out of his nook, and saddle him up for action.  notice, that i moved him in the traditional \"L\" move much like my opponent has been doing.  I'm hoping that by copying his knight techniques that he will become intimidated and eventually just giving up, that,  or grab the nearest banana and stabbing it through his heartal area, either one is okay.",
        "13. Re1": "he counters my knight speedy horse action and is seemingly stunned, he begins to retreat his men.  first being his castle.  this is going better than i thought!",
        "13... Qg5+": "i again move with speed, and attack his king, his king has few possible moves without ending in a messy, messy death.  I bet the life of a stranger that he'll move his king to the B2 square.  like i've mentioned previously, i've studied this guy inside and out, and i know how he ticks.  he will move his king.",
        "14. f4": "BLASTED, he's going haywire, i could have never suspected this.  he's blocked the attack by my queen with his lowly pawn, that is just despicable.  though he did not see that i could immediately remove his D knight from the board.  that will bring my score back to  1, YESSS!",
        "14... Qxd5": "and i do just that.  i bet he is crying with his face in his hands.  Life sucks sometimes.",
        "15. f5": "he must still have tears in his eyes, cause that was loser move right there, after all of that, he inches up another pawn.  I'm going to throw him off, instead of moving my bishop out of the way of his pawn, im going to leave it there, i do this sometimes just to mess with him.  so now im just going to move my knight, he's going to be so confused.  he'll probably start crying again.",
        "15... Nf8 16. Rd1": "he's moving his castle over to the d square, probably hoping to get my queen, by checking my king with his bishop.  That's not going to fly.",
        "16... O-O-O": "i briskly castle my king, leaving his queen snatching plans sunk to the sea.  his life sucks right about now.  he's lost all hope of catching up to my winning score of  1.",
        "17. fxe6": "finally he takes my bishop with his pawn.  ",
        "17... Re8": "to stop him from queening his pawn, i quickly react, and position my castle dude to stop him in his tracks.  That pawn is going nowhere.",
        "18. Qg4": "he's hopelessly trying to get the pawn to the top, he thinks he is going to put me in check.  not so fast.",
        "18... Kd8": "i again, reposition my king, killing any chances of a check.",
        "19. exf7": "he's hit me hard, and took my pawn, i am no longer in the lead, being at -3, i must act fast.  i need to regain my lead that i have kept during the entire game.  at the moment my castle is in danger.",
        "19... Qxf7": "almost without even thinking i move my queen in, and remove the threat of his pawn.    I'm getting closer to my well deserved lead.  now at -2",
        "20. Nf3": "he brings his queen side horse figurine out.",
        "20... h5": "I decide to sneak attack him with my H pawn, lets see if he sees this.  i doubt he will, as it's so subtle, if my plans go right i will be in the lead after i capture his queen with this lowly pawn.",
        "21. Ng5": "dang, he's good.  not only did he notice, but he countered it with a classic twist-twist-double cut.  i have very little options here.  i must act fast, my queen side queen's life is on the line.",
        "21... Qxa2": "i quickly think over all of my options.  i decide my best route is to move across the board and attack my opponents A pawn, which in the end will leave me a direct shot to a checkmate after i finish setting up plan B, which i can initiate after finishing plan A (aka project black square).",
        "22. Qc4": "he seems to think that he is going to block my queen in that hole, i will not let this happen, i am so close to winning this game it's not even close to funny!",
        "22... Qa5": "i pulled my queen side queen down to A5, she's safe right now, but at this point in time, i am not able to predict my brother's move, like normally.  there's some sort of mental block in my brain, almost like he's hypnotized me...over the internet.  very strange feeling i must say.  and not even close to fair.",
        "23. Nf7+": "man, how could i not have seen this, this is bad, it's going to be hard to recover from this, ofcourse i will be able to, but it's going to be hard.  I'm now down a castle, only one more left.  ehh, i only need one castle anyway!  one giant house of stone is enough for this king.",
        "23... Kc7": "i didn't have many options here, i chose to move my king as far away as possible. ",
        "24. Nxh8": "bye bye queen side castle!  I love you.",
        "24... b5": "well, now it's time for business.  I immediately begin to attack his queen, my plans are just to bombard his pieces until he just decides to surrender, he can only run for so long.  I'll give him, three, maybe four moves left before he decides he's had enough.",
        "25. Qxb5": "dang.  didn't see it coming, and it was right there in my face.  that's what i get when i try to play with my eyes close, randomly moving the mouse around and periodically clicking and pressing key board buttons.  ohh well.\n\ni've evaluated my position and it seems that the best thing to do is sacrifice my queen, for his queen.  by doing this i will accomplish two things.  one, i will make him think that he has an edge now (which I'm clearly in the lead) and he will loosen his game up and give me an even larger edge.\n\nsecondly, im already so far ahead of my opponent that i could lose several more pieces and still have this game in the bag.  i don't need my queen, it's just a pawn to me, a large mutant pawn.",
        "25... Qxb5": "i proceed with my plan.  most likely my opponents next move is to take my queen.  i will start building my plans around this move.",
        "26. Bxb5": "i knew it.  he moved his bishop in, my plans are right on track!",
        "26... Rb8": "this is going to be good, i tricked him, now i have cornered his bishop.  his bishop is going to be in check no matter where he moves on the B row now.  i pretty much own that entire row now.  ",
        "27. Rhf1": "he doesn't seem to notice the threat that i have just created, and seems distracted still by my queen swap.    he inches his castle out into the open, what his plans are, i am not sure, but i am ready!",
        "27... Ne6": "I decided to retract my knight, as he was in danger of death by crushing.  it's not everyday a big castle falls out of the sky and lands on a horse and crushes every bone in it's animal body.",
        "28. Rf7+": "wow, that is the fastest moving castle i have ever seen.  i didn't even know castles of this period could even move.  that's just amazing and undoubtedly unexpected .  this is going to put a small kink in my plans.",
        "28... Kb6": "i did what any man would do to save his life, i ran from the scary castle.",
        "29. Bd7": "the bishop is now in the picture again.  im actually starting to get worried.  i was ontop of the world, and now it seems there is a small chance that i may lose this game.",
        "29... Ka6": "i disparately  try and weave my king out of this mess.  just like the brave slaves of my ancestors i must move north.   that is my plan.  ",
        "30. Rxd6+": "well, those things sure do come from out of nowhere, i didn't even know they could move that way.",
        "30... Ka5": "north is good, north is good, north is good.",
        "31. Rxe6": "he seems confused.  this is my chance, i must make a move.",
        "31... c4": "my pawns have been in training for months and are very skilled with hand combat.  i'm going to try and breach my opponents wall and check me a king.",
        "32. c3": "and he stops me dead in my tracks.",
        "32... Rxh8": "haha, i took his last horse.  that really hurt him, he's going to really feel this.",
        "33. Rf5#": "in check again.  i think that's all he can do.   he just tries to intimidate me with his checking abilities.  it's not even that hard to do.a\n\n[EDIT]  dangit, i tried to move and, well, it didn't work, i had no spaces.  it seems he caught me by surprise, again.  good game old chap, good game!"
    },
    "url": "https://gameknot.com/annotation.pl/where-it-all-comes-down-to?gm=3615",
    "gameName": "where it all comes down to",
    "players": "fycorsia (1294) vs. felkajamine (1148)",
    "opening": "French defence (C00)"
}