{
    "moves": {
        "1. d4 Nf6 2. Nf3 e6 3. Bg5 c5": "I don't know its name, but it has not betrayed me yet. No danger in d5... but I never actually faced it. ",
        "4. c3": "I like myself this instead of c4, but I feel a little worried about...",
        "4... cxd4": "If white takes back with the pawn, it opens a nice attack on the dark squares. It will not damage white, but he'd have to play defensively. So I'd suggest Nxd4 instead. Of course, it lets the way open for e5-d5 from black's side. ",
        "5. cxd4": "Ok, I won't have played this one as white.",
        "5... Qa5+ 6. Nc3": "? First weak move.",
        "6... Ne4 7. Bd2 Nxd2 8. Qxd2": "I got rid of his Bpair, I still have strenght on the dark squares and the B, and white has to spend tempoes for developing, just as me. It's not \"his game\" anymore. ",
        "8... Bb4 9. a3": "? Useless move, since I can ignore the threat due to the hanging R.",
        "9... Nc6": "? A \"Just developing\" move I hate. d5 would have been natural, but I didn't want to open the way for possible counterattack on the white squares.",
        "10. Rc1": "Making the threat on my B actual. ",
        "10... Be7": "Another \"sgrunt\" move. The idea is to control Qg5, with some embarassement from my part.",
        "11. e4 d5": "Now or never. He chooses...",
        "12. e5": "...to close the center, which makes my lsb a headache. Moreover, if I castle, my K will be naked. ",
        "12... h6": "? Not necessary. I though on f5, hoping in exf6, and the chanche to move my e pawn, even sacrifying it for the sake of activating my lsb. But I didn't dare: on a blitz, it was too risky. g7-Ba6 was another plan, but it only aimed to getting along, nothing more. ",
        "13. Bd3 g5": "...g4 is a threat, as the N has no squares. And it grabs space, while my K is in the center, but well protected for the time being. ",
        "14. h3": "Easily preventing my threat. But now, his N is fixed. Of course, h5 was not possible. Qd8-Rg8 could be a nice idea.",
        "14... a6": "...but instead, I saw the weakness of d4, and played this in order to play b5 in order to prevent the N to go to a4, kicking my Q. Q and N will press d4, forcing white to defend. But...",
        "15. O-O b5": "?? I overlooked here a tactic I would have certainly seen being the white player: Nc6 is undefended after Nxb5 or Nxd5. ",
        "16. Qc2": "? This makes only easier my task, since I can defend the N with the B and the Q won't take it. ",
        "16... Bb7": "Maybe a mistake. Bd7 was more in line with the idea of shielding my K in the center. But the idea was to play on d4, and if I get it, my d5 pawn will be able to move, aiming at his K.  ",
        "17. Nb1": "Maybe the idea is to play b4 having a3 defended, but my idea was...",
        "17... Qb6": "...anyway, so white just spent a tempo. ",
        "18. Nbd2": "...I thought I could have cashed the d4 pawn, but... at the cost of Qc7 from white, which doesn't appeal me. ",
        "18... Kd7": "...and this makes Bg7 the good move. My K will help in the defence of the c column, connecting R and stay shielded at the same time. I still can't take d4, but I will be able. Of course, white has countergame...",
        "19. Nb3": "Goodby my Bpair. I'm still wondering if f5 (if exf6, Bxf6, adding pressure to d4 and still guarding the white squares) was preferable. ",
        "19... Rac8": "? A waste of a move, following a simple exchange game with no... well, let's see. ",
        "20. Nc5+ Bxc5": "Sigh! Bye bye, dearest! Your blind brother will spread his wings thanks to your sacrifice.",
        "21. Qxc5 Qxc5 22. Rxc5": "...or not. Now, this is embarassing, but I can't allow a formal white R penetration on C. ",
        "22... Na5": "No R doubling, white...",
        "23. Rfc1 Nb3 24. Rc5xc8 Rxc8 25. Rxc8": "The lsb is more mobile than my K, and I like it as centralized as possible. ",
        "25... Bxc8 26. Kf1": "Well, this is a tricky position. I can use my N for good, or lose it miserably. Just a matter of care. And I still have to solve the problem of my lsb!",
        "26... Kc6": "The plan was a5, and then, a4 or b4, depending... I dont' intend to move the f pawn and offer him a square for his N. ",
        "27. Ke2 a5 28. Nd2": "I realize now his blunder, and the fact I lost the chance to plan Nxd4, probably winning in the long run. ",
        "28... Nc1+": "? I can exchange now his lsb, making my own one strong... ",
        "29. Ke3": "He will be able now to play the Qside pawn, and get dangerous. ",
        "29... b4": "? Just desperado. By this time I had about 10 sec on my clock. ",
        "30. a4": "! Making my work harder. Bb5+, followed by Be8. ",
        "30... Nxd3 31. Kxd3 Ba6+": "Finally, my B gets strong as it deserves. ",
        "32. Ke3": "Still, it has no  place to go to! So...",
        "32... Bc4": "If he falls for NxB, I'll have a pawn majority he will have to stop.",
        "33. b3": "Sgrunt! Now my B is still a bad one...",
        "33... Ba6 34. f4": "...and here it comes his attack. I won't lose time. ",
        "34... Kd7 35. Kf3 Ke7 36. Kg4 f5+": "? Not a good idea? Better was Be2, and if Nf3, Bd1 wins a pawn and more.",
        "37. Kh5": "He wins a pawn instead. ",
        "37... Be2+": "Too late. ",
        "38. Kxh6 gxf4 39. h4": "Now, this is the position which I saved the game for. Can white win or not?",
        "39... Bd1": "? Kf7 was necessary and probably enough to draw. ",
        "40. Kg7 Bh5 41. Nf3 Bg4 42. Kh6 Kf7": "Well, after this nonsense dance, I'll lose another pawn. ",
        "43. Kg5 Kg7 44. Kxf4 Kh6 45. g3 Kg6": "I'm playing horribly, but I have just 2-3 seconds per move. ",
        "46. Ke3 Bh5 47. Ne1 Bd1 48. Nd3": "He accepts a pawn's exchange in order to break in. And he will. ",
        "48... Bxb3 49. Nc5 Bd1 50. Kd2 Bf3 51. Nb3 Bg4 52. Ke3 Bd1 53. Nc5": "This is the same postion than before, but now I had a sudden whisper from Caissa: ",
        "53... b3": "White has to sac the N or lose the game since he has no way to stop me from castling. ",
        "54. Kd2 b2": "Nice and elegant. After all both sides' mistakes, my first plan succeded, at last... "
    },
    "url": "https://gameknot.com/annotation.pl/whisper-from-caissa?gm=62819",
    "gameName": "Whisper from Caissa",
    "players": "klokklok (1552) vs. damafi (1477)",
    "opening": "Queen's pawn (A46), Torre attack, Wagner gambit"
}