{
    "moves": {
        "1. Nc3 d5": "Another ladder game. My opponent opens with the Dunst Opening and I turn again to the DB since I know nothing of this opening. Both 1. ... d5 and 1. ... c5 are the two most chosen moves, and 1. ... c5 has the best percentage for black, but it's not to my liking so I go with 1. ... d5 occupy the center and open a line for my bishop.",
        "2. d4 Nf6": "White's 2. d4 is not as popular a choice as 2. e4, but serviceable. It occupies the center and prevents 2. ... e5, and also prevents black from chasing away white's knight by playing his pawn to d4. In return, I develop a knight to add pressure to e4.",
        "3. Bg5 c5": "3. ... c5 is not the most popular move here in the DB, but it is played by the highest rated players and has the best success rate. It immediately strikes at white's center which, though well defended, threatens to invite white's queen out early and make a target of her.",
        "4. e3 Nc6": "Keeping up the pressure and/or offering up a bit of a gambit, sort of a black version of the Queen's Gambit.",
        "5. dxc5 e6": "Like the QGA, the pawn won't stay \"gambitted\" for long. This pawn really wanted to go to e5, but with the d5 pawn en prise, he had to stop short.",
        "6. Nf3 Bxc5": "I would say that black has fairly well equalized. Both players have three pieces developed and are otherwise positionally even.",
        "7. Nb5 O-O 8. Bd3 a6 9. Nc3 Bb4": "White advanced his knight prematurely with no good threats for it, and now it has returned to c3 where it is now pinned.",
        "10. a3 Bxc3+": "The half-open c-file seems like a good avenue to attack some helpless doubled and isolated pawns.",
        "11. bxc3 e5": "And now the black pawn completes his journey to e5, with the added threat of playing to the fork on e4.",
        "12. e4 dxe4 13. Bxe4 Qxd1+": "Oops, white just gave away a piece with 13. Bxe4?. Normally, I don't like exchanging queens against a player significantly below my rating; I prefer to keep things complicated. But, this gains a piece and, combined with white's wrecked queenside which is sure to cough up at least a pawn, it should be more than enough to begin simplifying and heading for a certain win.",
        "14. Rxd1 Nxe4 15. c4 Bg4": "Black's knight attacks the white bishop which is defended by white's knight. 15. ... Bg4 pins that white knight and threatens to win the exchange after 16. ... Nxg5.",
        "16. Be3 Rfd8 17. Rd3 Nd6": "Black is not quite ready to exchange rooks, especially at the cost of fixing most of white's pawn troubles.",
        "18. Nd2 Bf5 19. Rb3 Nxc4": "The pawn on c4 seems defended, but it isn't, so black gobbles up a pawn to extend hsi material lead.",
        "20. Nxc4 Bxc2": "And now black's bishop forks the two white rooks. Well, OK, not exactly, but white's rook on b3 is directly threatened and black is also threatening 21. ... Rd1+ which wins the other white rook on h1. One of these rooks must fall. ",
        "21. Rxb7 Rd1+ 22. Ke2 Rxh1": "And now black is ahead by a rook and a pawn.",
        "23. Nd6 Rd8": "White is threatening the pawn on f7. But black finds a sneaky trick. White's safest play here is 24. Bc5, but will he see that?",
        "24. Nxf7 Bd1#": "No, white missed the danger. Frankly, who can blame him? With black's two rooks so far away, the threat of being checkmated by what appears to be a lone bishop seems awfully remote, but that is just what happened, and black advances on the Fast Ladder, but unfortunately, only one rung, since white removed himself from the ladder while the game was in progress."
    },
    "url": "https://gameknot.com/annotation.pl/who-can-blame-him?gm=25442",
    "gameName": "Who Can Blame Him?",
    "players": "marx57 (1163) vs. blake84120 (2035)",
    "opening": "Dunst (Sleipner, Heinrichsen) opening (A00)"
}