{
    "moves": {
        "1. d4": "Ok, this is another draw, where I would ask stronger players to say whether they think one side or another had an advantage in the final position. Weaker players may enjoy and interesting tussle. It started out as another Noimzo-Indian Defence, so I would refer you to another anotated game adamraoof (2006) vs. charleshiggie (1932) for the first 3 moves on both sides.",
        "1... Nf6 2. c4 e6 3. Nc3 Bb4 4. e3": "Adam played a3 here, e3 is more common, and scores better according to the on-line databases.",
        "4... b6": "0-0 and c5 are more commonly played than b6, but it is equally sound.",
        "5. Nge2": "White wants to avoid doubles pawns.",
        "5... Ne4": "Black re-news the threat to double to c pawns.",
        "6. Bd2 Nxd2": "My Scottish oponent takes the opportunity to get the 2 bishops.",
        "7. Qxd2 O-O 8. a3 Be7 9. Nf4 d6 10. Be2 Bb7 11. O-O": "White had more central control and better development for the two bishops. Chances are even.",
        "11... Nd7 12. Rfd1 Bg5": "So far, as in Aleksandrov, Aleksej (2660) vs. Ehlvest, Jaan (2610) ½-½ in 16 moves (13. b4 Qe7 14. Rac1 Bh6 15. Bf1 g6 16. Qc2 c6 draw agreed). I now come up with an alternative move.\r\n",
        "13. Nh3 Bh6 14. b3 g6 15. f4 Bg7 16. Ng5 Nf6 17. Bf3 Bxf3 18. Nxf3 Re8 19. e4": "White now has a massive centre, but the exchange of minor pieces eases Black's position somewhat. Do you think it was a mistake by me to force off the white squared bishops?",
        "19... e5": "This I thought was a mistake, giving away a pawn, but as it turns out, not for long.",
        "20. dxe5 dxe5 21. Qxd8 Raxd8 22. Rxd8": "Giving up the open file may seem wrong, but I wanted to pull his rook away from the e file, otherwise in some variations he recovers the pawn on e5 with his rook on e8.",
        "22... Rxd8 23. Nxe5 Nh5 24. g3 g5": "Ah, keeping my extra pawn is going to be hard.....",
        "25. Rf1 gxf4 26. gxf4 Nxf4": "Now if I take his knight, he takes my knight and material is equal, so I try a desperado take with my knight.",
        "27. Nxf7 Rd3 28. Rxf4 Rxc3 29. Nd8 Rxb3 30. Ne6": "With some interesting threats, such as Rg4 winning the bishop, and if Be5, then Rf8 mate! I really didn't expect my Islander opponent to fall for that, I rather expected 30... Bh6, 31 Rf6 Bg7 32. Rc4 and a draw by repetition. My opponent found another way to defend.",
        "30... h5 31. Rf5 Bb2": "and draw agreed on Black's suggestion. The question is - who is better in the final position. Material is level, with pawns on both sides of the board, the bishop is better than the knight. Also in these sorts of positions, it is better to have the passed pawns on the side away from the kings, ie the Queen side. On the other hand white has two passed pawns, the e pawn is further up the board than the passed a pawn black has. over to you dear reader - who do you think is better?"
    },
    "url": "https://gameknot.com/annotation.pl/who-if-anyone-is-winning-this-game?gm=27028",
    "gameName": "Who (if anyone) is winning this game?",
    "players": "charleshiggie (1956) vs. skyeman (1948)",
    "opening": "Nimzo-Indian (E44), Fischer variation, 5.Ne2"
}