{
    "moves": {
        "1. e4 c5 2. Nf3 Nc6 3. d4 cxd4 4. Nxd4 e5 5. Nf3": "It isn't usual to see the knight retreat. This was similar to the previous round where my opponent took on c6.",
        "5... Nf6 6. Nc3 Bb4 7. Bc4 Bxc3+ 8. bxc3 O-O": "I thought through this move long and hard. I could not take on e4 right away because of the threat of 9. Qd5! threatening checkmate while attacking the knight. A move like 9. Ba3 would be detrimental to my position, and if I prevent that, there is also Bg5 to be cautious of, since I had lost my dark-square bishop.",
        "9. Bg5 h6 10. Bh4 d6 11. O-O g5": "Before playing this move I was particularly worried about 12. Bxg5 or 12. Nxg5, followed by 12... axg5 and then another recapture on g5. The white queen would then be free to come to h5 and harass my king at some point. But given the knight on f6 as well as my remaining bishop, queen, and rook, I figured that my pieces would be able to defend from the attack.",
        "12. Bg3 Nxe4": "And then I could finally grab the pawn on e4 while attacking the bishop.",
        "13. Qd3 Bf5": "White was in for a world of pain if she didn't move her queen.",
        "14. Qe3 Nxg3 15. fxg3": "Note the open a7-g1 diagonal.",
        "15... Qb6": "I simply used this opportunity to get the queens off the table.",
        "16. Qxb6 axb6 17. Nxg5": "A bold move, winning the g pawn and attacking both the bishop and the pawn at f7. I had high hopes for taking on c2, but I guess those hopes were dashed, not that it would matter in the end anyway.",
        "17... Bg6 18. Rf6": "A blunder...",
        "18... Kg7": "..now I essentially forked the knight and rook, simultaneouly freeing my f7 pawn from the pin and making my king immune to an attack from her bishop.",
        "19. Rxg6+ Kxg6": "Note that if fxg6 the white knight would have forked at e6, giving up my material advantage.",
        "20. Nh3": "Nf3 might have been better, since it wouldn't be on the edge.",
        "20... Ra3 21. Bb3 Na5 22. Nf2 Nxb3": "Ironic though it was that, in the opening, I gave my opponent attacking potential while doubling up her pawns, I ended up fixing her pawn structure for the sake of taking material off the board. This move also closed up the b file and saved my doubled b pawns from a future rook attack, so it was indeed necessary.",
        "23. cxb3 d5 24. Nd3 f6 25. Kf2 Rc8": "I attacked an indefensible pawn. If Rc1 then the a pawn would fall with check. If c4 then dxc4 and white couldn't recapture with bxc4 since the knight would fall.",
        "26. Nb4 Rxc3 27. Ke2 Ra5 28. Kd2 d4 29. Nd3 e4": "My two passed pawns become the focus of the board.",
        "30. Nf4+ Kf5 31. Ne2 Rd3+ 32. Ke1 Re3 33. Kd2": "Note the repetitions. I moved my rook from c3 to e3 without using a turn.",
        "33... Ke5 34. Nf4 Rc5 35. Ne2": "Again with the repetitions. My king and rook both moved as if a turn wasn't used. I guess White didn't have anything better to do for a defense.",
        "35... Rd3+ 36. Ke1": "More repetitions!",
        "36... Rc2 37. Nf4 Rdc3 38. Kd1 d3 39. Ke1": "And yet more...",
        "39... d2+ 40. Kd1 Rc2c1+ 41. Kxd2 e3+": "I gave up the passed pawn for a rook. I probably could have played better, but I wouldn't be able to promote with the steadfast a1 rook guarding the first rank anyway.",
        "42. Ke2 Rxa1 43. Nd3+ Kd4 44. Nf4 Rxa2+ 45. Kf3 e2+": "I might as well have pawn-pushed since after 45...Rf2+ the king would escape to g4 anyway.",
        "46. Kf2": "My opponent's last-ditch effort to stop promotion ends in a forced mate. Kg4 would be safe for not a bad period of time (depending on what you would consider \"bad\"). Also Nxe2 would have helped.",
        "46... e1=Q+": "A noble queen sacrifice. My pawn at least gets a chance to promote before the game is won.",
        "47. Kxe1 Rc1#": "Winning this epic game landed me a 4th place finish out of 44 in the tournament. I could not have asked for a better result, since, if I won in the 3rd round, I probably would have lost the next two. My rating from this tournament went up 281 points, more than anyone else who competed in the reserve section. In doing so well, I realized my true chess potential, and as a result I became more active within in my club and with chess in general. Final Score: 4-1 or 4.0/5.0. Thanks for watching!"
    },
    "url": "https://gameknot.com/annotation.pl/whsca-ind-championship-u1300-sec-rd-5-5?gm=29548",
    "gameName": "WHSCA Ind. Championship: (U1300) sec. rd. 5/5",
    "players": "Robyn Lesh (1193) vs. Travis Olson (878)",
    "opening": "Sicilian (B32), Labourdonnais-Loewenthal variation"
}