{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Bc4 Nf6 4. Nc3 Bc5 5. h3 O-O 6. d3 h6 7. O-O d6": "Speeding through the opening with out losing any time on the clock. In a very simple and common position to this point.",
        "8. Be3": "Looking to remove the Black Bishop and possibly open up the f-file for my rook. ",
        "8... Nd4 9. Bxd4 Bxd4 10. Nxd4 exd4 11. Nd5": "Putting my Knight on a nice central square and offering a trade.",
        "11... Nd7": "Declined",
        "12. Nf4": "Opening up the Bishop's diagonal aiming at the Black King.",
        "12... Ne5": "Threatening to trade Knight for Bishop.",
        "13. Bb3": "Bishop is too valuable to trade for the Knight at this point.",
        "13... Qg5": "Threatening QxN and Bxh6 if the Knight is moved",
        "14. g3": "Only safe move",
        "14... Kh8": "Unpins f-pawn from King",
        "15. Kh2": "Protects h3 more thoroughly ",
        "15... f5 16. Be6": "BxB, NxB is a fork of Queen and Rook",
        "16... fxe4 17. Bxc8": "Threatening Fork still",
        "17... Nf3+": "Infiltrating white protection. This Knight will become a thorn in my side for many moves to come",
        "18. Kh1": "Kg1 or Kg2 result in RxN for free",
        "18... Rxf4": "Still can take Knight due to the mating combination of:\ngxR, Qxg, then unstoppable mate on h2 with the Queen",
        "19. Bxb7": "Attacking the Rook and the pawn on e4",
        "19... Rh4": "Rxh3 results in unstoppable mate after Kg2 then Rh2   ",
        "20. Kg2": "Only move",
        "20... Qg4": "Threatening Qxh3   ",
        "21. Rh1": "Best and only move",
        "21... Ne1+": "Realizes he is in trouble with all of the attacked pieces and begins to try an attack, but is too late",
        "22. Qxe1 Qf3+ 23. Kg1 Rf8 24. gxh4 Qf4 25. Rh2 e3 26. fxe3 dxe3 27. Qe2": "Black resigns at this point due to the lost pawn on e and the lack of available material.\n\n I end up going 4.5-.5 on the day. Might annotate the rest of them if I get a chance.\n\nI appreciate any and all comments. Feel free to message me too if you see something interesting."
    },
    "url": "https://gameknot.com/annotation.pl/whsca-mini-teams-tournament-rnd-2?gm=12279",
    "gameName": "Whsca mini-teams tournament rnd 2",
    "players": "Chris Peterson (1266) vs. Peter Watts (1776)",
    "opening": "Two knights defence (C55)"
}