{
    "moves": {
        "1. e4": "this is my most common move. d4 I used to play a lot, but now I rarely use it.",
        "1... e5 2. Nf3 Nc6 3. Bb5": "I swear, this is the last time I am ever going to play the ruy lopez. I hate the theory, and it's just not my type of opening.",
        "3... d6": "some steinitz variation, I think...",
        "4. O-O Bd7 5. Nc3 g6 6. d4": "There is the saying:flank advances should be met by center counters. g6 is not a threat, but I figure opening the position can't hurt me.",
        "6... Bg7 7. dxe5 Nxe5 8. Nxe5 Bxe5 9. Bxd7+ Qxd7": "some exchanges.",
        "10. f4": "I know that most inexperienced players think that pawn structure is very critical, which is untrue. The order of advantages from the highest to least in a position evaluation are: material, piece activity, king safety, and finally pawn structure. Also, here, if he takes, I get an open b file and get to exploit the weak dark squares easily. If his king castle on either side, I will have play against it.",
        "10... Bxc3": "it was probably better to keep the bishop to watch the dark squares.",
        "11. bxc3 O-O-O": "well, now I can't exploit the dark squares, but my b file gives play against the king.",
        "12. Qd4": "fork.",
        "12... f6 13. Qxa7": "threatening an obvious Qa1mate",
        "13... Qc6 14. Qd4 b6": "pointless. better is to get his pieces out safely.",
        "15. Kh1": "I forgot why I played this. It seems like a very slow move, but I think I was paranoid of Qc5.",
        "15... Qd7": "the queen is moving back and forth without any clear plan.",
        "16. Be3": "just completing the development.",
        "16... Qe6": "too many queen moves!! The knight and rook are not doing anything.",
        "17. f5": "open the position when you have better development.",
        "17... Qe5": "still moving with the queen.",
        "18. Rab1": "trade is fine for me. I am experienced at handling small material advantages (not so great at generating unclear attacks) and a trade is fine, as it will undouble the pawns and leave my pieces relatively better. I will also, of course have 1 extra pawn.",
        "18... Ne7 19. Qc4": "threatening Bxb6, and he will have to really do something about this. This also sets a little trap, which black can blunder into if he over reacts",
        "19... Kb7": "totally over reacting.  What do you think I played now??",
        "20. Bxb6": "Bxb6! anyways! The bishop is immune(not really,because black getting mated and can do whatever he wants), and black should resign, as he is another pawn down and will be mated.",
        "20... cxb6": "A better choice : resign",
        "21. Rxb6+": "second sacrificial tactic.",
        "21... Kxb6 22. Rb1+": "this is like a two rooks mate (queen is fine too), with the king cornered to the edge of the board\n ",
        "22... Ka5 23. Qb4+ Ka6 24. Qb6#": "mate."
    },
    "url": "https://gameknot.com/annotation.pl/wild-mating-sacrificial-tactics?gm=32805",
    "gameName": "wild mating sacrificial tactics",
    "players": "chessboard12 (1682) vs. lvali40 (1417)",
    "opening": "Ruy Lopez (C62), old Steinitz defence"
}