{
    "moves": {
        "1. e4 d5 2. e5 Bf5 3. f4": "One of the most aggresive responses. The only move to save my bishop is...",
        "3... h5 4. d3 e6 5. Nf3": "Now black has a somewhat cramped game.",
        "5... c5": "Maybe better is Bc5 instead, but I wanted a good center control.",
        "6. Be2 Nc6 7. c3": "Good. This contests my center, and set d4 as a resource.",
        "7... Qb6": "Inmediately pressing the diagonal. If Be3, Qxb2 is playable. ",
        "8. O-O": "Just into the fire! But confident because c4+, d4 closes the chances for black. ",
        "8... Nh6": "I want to keep the black diagonal free for my bishop. ",
        "9. Ng5 Ng4": "Just to tempt him to BxN, opening the white king. ",
        "10. h3 f6": "Very risky, but I was playing for fun. ",
        "11. hxg4 hxg4": "Where is he going to retire the knight? Nxe6, g3, to close the king's movements, no matter the material loss. I lose a pawn, true.",
        "12. Bxg4": "Smarter. ",
        "12... fxg5": "Recovering my piece, but leaving my own king wide open.",
        "13. fxg5": "BxB, QxB, Nxe5, Qe2 was not good for black. If white goes BxB, I'm in trouble.",
        "13... Nxe5": "...but I couldn't resist.",
        "14. Bxf5 exf5": "Rxf5 and the game is over for black, but for some \"maybe\" tricks: Rxf5, c4+, d4, Nd3... maybe something can come out of it.",
        "15. d4 Ng4": "Risking again, knowing that f5 is going to fall, but looking for some way out. ",
        "16. Rxf5 Qe6": "Otherwise, Qe1+. only apparent sac, since I recover the piece soon.",
        "17. Qxg4 Qe1+ 18. Rf1 Rh1+ 19. Kxh1 Qxf1+ 20. Kh2 Qxc1": "Recovering the piece, but in an inferior position, but for Qxb2, winning the rook. Now, white won't be standing still in the meanwhile.",
        "21. Qe6+ Be7 22. Qg8+ Bf8 23. Qe6+ Kd8": "Only way to escape pepetual or losing material. Probably, the \"exchange\" would have favoured me, but it seemed to lead to drawn. ",
        "24. Qxd5+": "Losing another pawn for the sake of a nice game. ",
        "24... Kc7 25. Na3": "Bd6+ is not possible because of QxB+, KxB, RxQ. Now I have chance to check. The game stopped here because of connection error. A pity. ",
        "25... Qxa1": "or Qf4+, looking helplessly for a perpetual that doesn't exist. Kg1. \nOr: Qxb2, defending from the knight check, R moves, Rd8... ",
        "26. Nb5+ Kb6 27. Nd6 Bxd6+ 28. Qxd6+ Kb5 29. Qxc5+ Ka6 30. b4 Qxa2 31. b5+ Ka5 32. b6+ Ka6 33. c4 axb6 34. Qb5+ Ka7 35. c5 Qa6 36. cxb6+ Qxb6": "And the game is over for white. Just exploring. ",
        "37. Qa4+": ""
    },
    "url": "https://gameknot.com/annotation.pl/wild-west?gm=42872",
    "gameName": "Wild west",
    "players": "perrenial  vs. damalfi ",
    "opening": "Scandinavian (centre counter) defence (B01)"
}