{
    "moves": {
        "1. Na3": "This is a famous game between lord Jabborg (playing white) and his elderly pet lobster 'Carlsberg' (playing black). The game took place on the top floor of Willy Wonkz palace, submerged in the 'purple ocean' 45 goblemetres Northwest of the historical sinking of the 'Flying Fangerblot' at minus 3 minutes to 37 o clock on the 91.5th of Krumpember year 208 (since Wacky World was first discovered). The game contains moments of genius, melancholy, evil and madness and is one of the most celebrated games in western Wacky World (of course, only among the Squoppulant race).\r\n\r\nThe 1st Move is the most conventional opener since Wacky World was discovered.",
        "1... Nh6": "Carlsberg responds with the 'by the book' nh6",
        "2. Rb1": "This move suggests that Jabborg is thinking of the 'corner knight' opener here, a variation of the 'retreat to formation' style.",
        "2... Ng4": "Carsberg decides to capitalise on the invaluable g4 square",
        "3. Nb5": "as expected; Carsberg's best defence here is ne5",
        "3... Ne5": "This move is practically forced, a move to e3 would viciously threaten the morale of the h7 pawn whilst inadvertently offering a 'habbajoop' duel ",
        "4. Ra1": "Bombshell! An ancient technique known as the 'rerooker', the move has had mysterious history, it was studied in great length by the 'Moonlagoom' Race",
        "4... Nc4": "This move suggests that Carlsberg may be inviting Jabborg to a 'cross-knight-swap', a superstitious ritual which is usually played among lobsterian sages. The ritual is known to 'clean the game of evil' and both players will live prosperously.",
        "5. Nd4": "Jabborg accepts Carlsberg's invitation",
        "5... Na3 6. Nf5 Nb1 7. Nh6 Na6": "with the extra move to Carlsberg's advantage, he offers his knight to a6 so Jabborg may regain ground",
        "8. Ng8 Nb4 9. Nf3 Nc6 10. Nd4 Ne5 11. Nb5 Ng6 12. Nd4 Nf4 13. Nc6 Nh3 14. Nb8 Ng1": "And so, the first part of the ritual is complete, it is now up to Jabborg who will decide how to 'honour the soul' of Wackyworld's saviours 'the Jellamin Army' who fought to success in the Great Tanatrog War.",
        "15. Rxg1": "He chooses the most popular technique 'murder at 4 corners'",
        "15... Rxb8 16. Rxb1 Rxg8": "With the game now 'cleaned of evil', it is up to both players to prove who is the most 'Grophworthy'.",
        "17. f3": "Jabborg is known to favour pawns over all other pieces. He once played 760 consecutive games using only his pawns and remarkably won 2 of them.",
        "17... Ra8": "This move suggests that carlsberg may be beginning a taunt technique known as the 'Wings of Waffapoon'",
        "18. a3 Rh8 19. c3 Rb8": "Sure enough, Carlsberg has commited to taunting his opponents pawns and reserving energy within his pieces",
        "20. e3 Rg8 21. b3 Ra8 22. g3 Rh8 23. h3 Rb8 24. f4 Rg8 25. c4 Ra8 26. b4 Rh8 27. g4 Rb8 28. e4 Rg8 29. d3 Ra8 30. a4 Rh8 31. d4 Rb8 32. h4 Rg8": "With Jabborg's pawns regrouping on the 4th Rank, it will be interesting how Carslberg will respond. If he decides to advance his front line, it would surely be a merciless pawn battle similar to that of the famous pawn battle between Count Gok and Proffessor of Flimanin Science Peetabob Haphomski.",
        "33. d5 e6 34. dxe6 fxe6 35. e5 g6 36. b5 h6 37. c5 d6 38. b6 dxe5 39. c6 cxb6 40. g5 bxc6 41. f5 hxg5 42. a5 gxf5 43. axb6 gxh4 44. bxa7": "With Carsberg's flourid pawn agility easliy winning over his opponent's troops, Jabborg's left foot went a pale green colour and he felt a wave of anxiety as he realised that he was (as Bwophsquant types say) 'up Lobsterian Creek'",
        "44... c5 45. a8=N Rxa8 46. Ra1 e4 47. Rb1 c4 48. Ra1 e5 49. Rb1": "With the game going through somewhat of a sag in excitement, it was said to have have been remarked by Carsberg in his deep croaky voice 'now we ball-race'. Carlsberg was a fan of ball-racing around pawns, it was a tradition among some lobsterian types and he was said to always offer a ball-race if he was playing as black.",
        "49... Bh6": "And so, Carlsberg decides the ball-race will be Chazakwise (named after Wackyworld's moon which rotates around the planet. This term's opposite is Chopawise which was a considerably smaller moon that rotated in the opposite direction. It was destroyed in a head on collision 109 years ago, the event was named 'the great moon reduction of 99')",
        "50. Ba3 Rg3 51. Qb3 Qg5 52. Bd3 Be6 53. Rg2 Ra7 54. Qb6 Rf3 55. Be7 Bf7 56. Ra2 Qg2 57. Rb5 Bc1 58. Bc2 Bh5 59. Rd5 Rfa3 60. Ba4+": "Suddenly, Jabborg accidently checked Carlberg's King. In a fit of rage, Carlsberg, clearly unamused, began blowing out vast amounts of air making all of the pieces, 1 by 1 lurch to Jabborg's side of the board completely untouched by the players.",
        "60... Ra7xa4 61. Qb1 Bd1 62. Bb4 c3 63. Rdd2 Kf7 64. Ra1 Ke6 65. Bxa3 f4 66. Bb2 Kf5 67. Bxc1": "Before the game got out of hand, Jabborg stod up and insisted that the game be finished in a 'Phrappenite' manner (a term derived from the mythical race of Phrappenians, who are said to have completely green skin, live in clouds and are known to be the purest of beings) and both players should agree to continue the game from the positions on the board. Carsberg recovered from his frustration, glanced at the board and decided that Jabborg was right.",
        "67... Qg1#": "The checkmating move was delivered mercilessly. Following his final move, Carslberg was known to have stood up from his bean bag and cried out to his wife 'Fneeba! Fneeba! I won again!'. It is known that Jabborg's family feasted on 2 roast lobsters that evening."
    },
    "url": "https://gameknot.com/annotation.pl/willywonkz-wackyworld-1a?gm=13119",
    "gameName": "WILLYWONKZ WACKYWORLD #1A",
    "players": "Lord Jabborg  vs. Carsberg (1)",
    "opening": "Durkin's attack (A00)"
}