{
    "moves": {
        "1. e4": "I start off with e4, as it often leads to wild tactical play.",
        "1... c5": "My opponent responds with a Sicilian, common among high level players.",
        "2. f4": "I decided to go for the grand prix, as I would easily lose a steady positional game. In fact I hope to play the infamous Bryntse gambit, which is 1. e4 c5 2. f4 d5 3. Nf3 dxe4 4. Ng5 Nf6 5. Bc4 Bg4 6. Bxf7+ Kd7 7. Qxg4+ Nxg4 8. Be6+ with an all-out attack.",
        "2... Nc6": "But my opponent does not comply. Oh well...",
        "3. Nf3 g6 4. Bc4 Bg7": "My opponent places his bishop to a strong square. He also prepares to castle. If he does, I would have a hard time to break through his defenses.",
        "5. f5": "I try to open some lines toward Black's monarch, as a wild tactical play (which is my favourite type of play) is my best bet to at least draw the game.",
        "5... gxf5": "He accepts the gambit. The h5-e8 diagonal has somewhat opened for business.",
        "6. Bxf7+": "Why not?",
        "6... Kxf7 7. Ng5+": "I have to keep the king in check, or else he can escape.",
        "7... Kg6": "Black gets somewhat greedy and attacks my lone knight. Mybe better was Kf8. Now...",
        "8. exf5+": "Of course! If I can bring his king towards my pieces, I may be able to mate him! That would be great...",
        "8... Kxg5": "Black is really greedy here. I don't know if there is a better move though.",
        "9. d4+": "Of course!",
        "9... Kf6": "He retreats to a square where I can't check him without simply losing a piece. What to do?",
        "10. Qh5": "! I cut any escape the black king had and I threaten Bg5+, which would be very dangerous.",
        "10... Nxd4": "He brings in his knight and frees the e5 square for his.",
        "11. Bg5+": "Of course!",
        "11... Ke5 12. Kd1": "This move serves two purpose: It protects the c2 pawn while allowing my rook on the e file. My king cannot be checked for now as well.",
        "12... d5": "? Black tries to develop his pieces while giving cover squares for his king. However...",
        "13. Bf4+": "I won't allow the black king to escape! If the black king goes to f6, I simply plays Bg5+. He must either take the perpetual or lose his queen (at least). However, if he takes my bishop...",
        "13... Kxf4": "??Which he does... ",
        "14. Re1": "!! Deadly move. I cut off any escape square from the black king. I also threaten g3#, which is almost unavoidable.",
        "14... Nxf5": "The ONLY MOVE!",
        "15. g3+": "Of course.",
        "15... Nxg3 16. hxg3+ Kxg3 17. Rg1+": "? Re3+ is better, as it forces mate quicker. And I must NOT play 17.Qg5+ because of 17...Bg4+ 18.Kc1 Bh6, pinning my queen to my king. DO NOT WANT. Those bishops can be pesky here. ",
        "17... Kf4": "? Surprisingly, Kf2 is better­ (I think). I now see the forced mate...",
        "18. Qg5+": "Of course! My queen switches from light square control to dark squares control. My b1 knight shall go to d2, where it controls three key light squares.",
        "18... Ke4": "18...Kf3 19.Nd2+ Kf2 20. Qg3#",
        "19. Nd2+": "Not 19.Rg4+, because of 19...Bxg4+.",
        "19... Kd4": "Only move.",
        "20. c3+": "Of course! the king must go to d3.",
        "20... Kd3": "Forced",
        "21. Rg3#": "CHECK and MATE! After many sacrifices to bring the black king near my pieces, I finally finish him off. Since this was in a simul, I can't take full credits for that. However, it is still a victory against an IM, with a totally unsound opening and a sack-fest of pieces. Even though we both made mistakes, it was very fun to play. Please feel free to leave any comments and/or feedback whether it is positive or negative. That way, I will be able to make better annotations. Until then, Adieu!"
    },
    "url": "https://gameknot.com/annotation.pl/win-against-an-international-master?gm=34736",
    "gameName": "Win against an International Master",
    "players": "Étienne Chouinard (unr) vs. Arnaud Rainfray (2390)",
    "opening": "Sicilian (B21), Grand Prix attack"
}