{
    "moves": {
        "1. e4 e5 2. Nf3 f5 3. Nxe5 Nf6": "An interesting sacrifice I had not seen before. I thought carefully, and then decided to take the pawn and try and  hold on.",
        "4. exf5 Qe7 5. Qe2 d6 6. Nc4 Qxe2+ 7. Bxe2": "At this point I felt white had accomplished something by the queen exchange.True, black gets one pawn back, but white still has a pawn more and is not behind in development",
        "7... Bxf5 8. Ne3 Bg6 9. c3": "White wants to build a strong pawn formation first.",
        "9... Nbd7 10. d4 O-O-O 11. O-O Be7 12. Nd2 Nb6 13. b3": "Here I felt White should have a win. This prepares to push pawns on the queenside, hoping for exchanges into a favorable ending. But it does give Black a target. ",
        "13... Nbd5 14. Bb2": "I did not look hard enough at the knight capture on e3, opening the f file was not as advantageous for white as I had thought, now I would prefer to exchange knights first and then play Bb2, and eventually advance the queen side pawns, then exploit the kingside majority.",
        "14... Nxe3 15. fxe3 Rhf8": "here and on the next move black should have done more to restrain the backward pawn",
        "16. Bf3 c6 17. e4 Nd7 18. Rae1": "White now has a good position and is a pawn up. But White needs a plan.",
        "18... Rde8 19. Bg4": "white is still trying to provoke exchanges towards a favorable ending.",
        "19... Rxf1+ 20. Kxf1 Rf8+ 21. Kg1 Kd8 22. Bf3 Nb6 23. e5 dxe5 24. Rxe5": "White is still trying to provoke exchanges, but Black's pieces are becoming more active as a result.",
        "24... Nd7 25. Re1 Re8 26. c4": "This move was made in haste. In retrospect, I think White should have prepared more first. ",
        "26... Bf6": "Now the pawn is pinned. White must be careful now that ...c5 will be possible.",
        "27. Rxe8+ Kxe8 28. Ne4 Bxe4 29. Bxe4": "White has induced more exchanges.",
        "29... g6": "Now c5! is a threat.",
        "30. Kf2": "If now ...c5, Ke3 holds.",
        "30... Kf7 31. Ke3 Nb6 32. Ba3": "White plans to advance the pawn by relieving the pin and also to penetrate to d6 with the bishop if possible.",
        "32... a6 33. d5": "White hopes to invade using the passed pawn to advantage.",
        "33... cxd5 34. cxd5 Nd7": "Black has set up a solid defensive formation, and wants to force an opposite color bishop ending.",
        "35. Bb4": "White is still trying to find a plan, decides to provoke and see what develops.",
        "35... b6 36. Bd6 Bg7 37. Kd3 Ne5+": "hoping for opposite color bishops",
        "38. Kd4 Nd7+ 39. Kc4": "White is still trying to find a way in, hoping Black blunders.",
        "39... Bf6 40. a4": "White decides to try and fix the pawns hoping the bishops will be more powerful.",
        "40... Bd8 41. b4 Kf6 42. b5 a5": "White thinks that fixing the queen side pawns will restrict Black.",
        "43. Kd4 Kf7 44. Bf3 h5 45. g3 Kf6 46. h4": "So far, Black has played well and White seems to be getting nowhere. But White has now come up with a plan, to try and get to the a3-c8 diagonal. ",
        "46... Kf7 47. Bg2 Nf6 48. Bh3 Ne8": "This seems like a good defensive try, but White has the desired position. First, some forcing checks.",
        "49. Be6+": "Be6 ! Finally...the start of series of moves towards a winning plan to exploit Black's limited mobility, drive the king away and penetrate the position. Black has no good options from here on out.",
        "49... Kg7 50. Be5+": "Forces the Black king back while clearing d6, allowing the pawn advance. ",
        "50... Kf8 51. d6": "And now, finally, d6!. The advance has been carefully timed and calculated. White can now penetrate via d5, and calculates the opposite color bishop ending is winnable because the king will be too far away.",
        "51... Nf6": "Otherwise just Kd5...hoping the opposite color bishops can hold.",
        "52. Bxf6": "BxN... because Black has calculated the ending can be won.",
        "52... Bxf6+ 53. Kd5 Bd8": "Necessary to protects the weak dark square pawns, but...",
        "54. Kc6": "White now invades. ",
        "54... Ke8": "Forced, otherwise Kd7 winss",
        "55. Kb7": "Exploits the immobility of Black's pieces. Black must move, unfortunately.",
        "55... Kf8 56. Kc8": "Attacks the queening square.",
        "56... Bf6": "If instead ...Ke8, 57 Bf7 ! and the pawn will queen.",
        "57. d7": "And Black resigns. Proof that opposite color bishop endings when only a pawn up can sometimes be won."
    },
    "url": "https://gameknot.com/annotation.pl/winning-with-opposite-color-bishops?gm=18649",
    "gameName": "Winning with opposite color bishops...",
    "players": "dmaestro (1524) vs. jstevens1 (1712)",
    "opening": "Latvian (C40), Nimzovich variation"
}