{
    "moves": {
        "1. e4 a6 2. d4": "Black surprised me with an odd opening, so I guess I will just fall back on general opening principles.\r\n\r\n1. Control the center.",
        "2... e6 3. Nc3 c5 4. Bc4 Nc6 5. Nf3": "2. Develop pieces rapidly, so that they add to the control of the center.",
        "5... b5 6. Be2 d5 7. exd5": "Black's move 6... d5 costs him a pawn. This is because those opening principles gave white a superior position in the center, making it difficult for black to successfully attack there.",
        "7... exd5 8. dxc5 Bxc5 9. Qxd5 Nge7 10. Qxc5": "White threatened the bishop and knight. Black's response was not the right way to save material. He should have exchanged queens or maybe gotten mileage out of Qb6.",
        "10... O-O 11. Bg5 Be6 12. Rd1 Qc7 13. Bxe7": "! It looks like the N on E7 is protected by two pieces, but it really isn't protected at all. If Qxe7 then Qxc6, or worse, if Nxe7?? then Qxc7. White was putting pressure on both knights, and one was pinned. The right way to save them both was 12. ... Qe8.",
        "13... Qxe7 14. Qxc6 Rfc8 15. Qd6": "Ahead by two Knights and a Pawn, time to exchange everything down.",
        "15... Qf6 16. Nd4": "My fear was 16...b4 chasing away my knight and exposing c2, and once black's rook takes that, the pawns at b2 and a2 would be in danger too. I almost played 16 a3 to prevent it. Then I realized my queen covered black's pawn advance quite nicely so I found a better way to attack, forcing an exchange of knight for bishop or an exchange of queens.",
        "16... b4 17. Qxb4": "I didn't expect him to give me a free pawn. At least he avoided any exchanges.",
        "17... Rab8 18. Qa3": "All the fun looking moves cost me a slew of pawns, so I played conservatively, planning to milk the material advantage.",
        "18... Rce8 19. Nxe6": "I am not sure why black allowed this material exchange when he was so far behind in material. I will gladly trade all day when I am up two pieces and two pawns.",
        "19... Rxe6 20. O-O Qh4 21. Bxa6": "I expected Ra8 to pin my bishop, to which I would reply rd6, defending the bishop and letting me stack my rooks on the D-file, or exchange rooks, either of which was fine with me.",
        "21... Rg6 22. Nd5": "Nice try by black. His last move hreatens Qh6 followed by 23 g3 Rh6 and all kinds of fun ensues for black. I didn't expect anything to come out of moving my Knight, I just wanted my Queen to protect against black's tricks. Also, moving the Knight to D5 puts it in range to protect the Bishop if black responds by finally playing Ra8",
        "22... Kh8 23. Ne7 Rf6 24. Bc8": "Threatens immediate mate with Rd8  . That's the obvious threat. This move also forces some more material exchange, in my favor. Black cannot play g6 because I would reply Nf5! threatening mate with my queen, allowing me to capture the black queen.",
        "24... h5 25. Rd8+ Kh7 26. Bf5+": "! Lose a bishop, gain a rook. It's all good. Side note: After Rxf5, white cannot play 27 Nxf5, which looks like a good trick to threaten the queen and still play Rxb8 next move, but black responds by 27 ... Qxd8",
        "26... Rxf5 27. Rxb8 Rg5 28. Qb4": "Black is back on that old attack. I can't blame him; he doesn't have anything else at this point.\r\n\r\nTime to win material. I predicted black's next move (Qh3), and I also worked out how I would proceed from there, covering the checkmate and mounting at attack that would gain a rook in the process.\r\n\r\nBlack should respond by 28...Rg4 which causes some problems for white and puts me back on the defense for a bit - but I didn't think black would do this; he seemed focused on his own attack.",
        "28... Qh3 29. Qe4+": "! It's liquidation time, and it doesn't hurt that my Queen now guards my g2 pawn and prevents the mate. Black has nothing that works here - he has to exchange material.",
        "29... g6 30. Nxg6": "! A free pawn, and it breaks up black's pawn structure. \r\n30...Rxg6 is very bad (that rook is the only thing keeping the black queen alive, if white takes the rook with check, black's queen dies), but 30...Pxg6 is also bad after 31 Qe7  Kh6 32 Rh8  . Moving the king to avoid the discovered check is the only option (all queen moves allow white to exchange queens or kill her outright with discovered check).",
        "30... Rxg6 31. Qxg6+": "! Now it's game over. Black is down to only two pawns and white reigns with two unopposed rooks.",
        "31... fxg6 32. gxh3 Kg7 33. Re1": ""
    },
    "url": "https://gameknot.com/annotation.pl/winning-on-opening-principles?gm=20584",
    "gameName": "Winning on Opening Principles",
    "players": "blake84120 (1200) vs. from_the_north (1101)",
    "opening": "St. George (Baker) defence (B00)"
}