{
    "moves": {
        "1. e4 e6": "The French Defence was what we played in school days, to prevent the horror of the Scholar's Mate attack; and later became my favorite when I found I couldn't really foot it theoretically with the Sicilian (1...c5).",
        "2. d4 b6": "Normally I prefer the standard 2...d5, but it does one good to vary from time to time.  I like this version of Owen's Defence, deferring the central struggle for the time being.  But Black does have to watch that he doesn't allow White to shove a pawn wedge into his centre.",
        "3. Nf3 Bb7": "Bringing pressure against e4...",
        "4. Bd3": "...to which White responds in sensible fashion.",
        "4... d6": "Possibly this is too restrained - the GK engine 'thinks' so, indicating 4...c5.  Last time I played that I got my head handed to me.  The move played has the virtues of solidity and flexibility.  But it doesn't interfere with whatever plans White has in train.",
        "5. c4": "Also good was 5.0-0, but there was no reason not to seize as much central territory as he could hold...",
        "5... g6": "Transforming the game into a Modern Defence - specifically, the Hippopotamus.  Black plans to bring White's centre under a crossfire of bishops.  But he has to be careful.  There is always the danger of the Hippo having his head shoved under and held there.",
        "6. Bg5": "(!) A bit embarrassing for Black.  ",
        "6... f6": "(!?)  Apparently weakening, but it has its points.  For one thing, I just didn't fancy 6...Ne2 7.Bf6!, though, come to think of it, Black's game would not have been all that bad.  But Black has it also in mind to counter any advance White maks in the centre with an advance of his own.  Note that the Black pawns on the third rank advancing to the fourth obviate any 'en passant' captures, which might have been a nuisance.",
        "7. Bh4": "(!?)  Possibly 7.Be3 was an improvement, building up his centre.  This bishop could have, and probably should have, been chased back to g3 after this, where it would have been a target for Black's K-side pawns.",
        "7... Nd7": "(!?) OK, but 7...g5 was indicated, really.  I did concern myself with the possibility White would try a sac (7...g5  8.Nxg5 fxg5  9.Qh5ch Kd7  10.Bxg5...) but after 10...Qe8 it's not clear that White has much.  Would White have tried it on had I played ....g5?  I wasn't prepared to find out. ",
        "8. Nc3 Bg7": "(!?) 8...g5 was still playable, with a knight interposing after the bishop check: 8...g5  9.Nxg5?! fxg5  10.Qh5ch Ke7  11.Bxg5ch Ngf6  12.e5 dxe5  13.dxe5 Nxe5 and Black seems to escape with the extra piece.",
        "9. O-O": "White's mobilization is just about complete, and he commands more space.  But Black is not far behind, and is ready for anything.",
        "9... Ne7": "You might think White has much greater mobility, and it's true enough.  But, under no particular constraint by White, Black's game (in my view) contains a lot of potential energy.   Incidentally, there is no real concern that the respective knights will continue on to c6 and f6, taking four tempi to develop to squares reachable at the outset in two!",
        "10. Rc1": "I have a feeling that this developing move lacked any real purpose.  Possibly White had in mind to advance the Q-side pawns and bust open the c-file with the advance of that pawn.",
        "10... O-O": "With the completion of Black's mobilization, there still has been no contact between the respective armies - just a brief skirmish at g5.  But now White makes his first real strike.",
        "11. Qb3": "Threatening 12.c5!  ",
        "11... c5": "Stops White's little scheme, but now Black's d6-square is weakened.  ",
        "12. d5": "This was what Black was waiting for, and now he can close the centre.  The move is OK - there really wasn't anything doing with 12.Nb5 Qb8 -  but it does release quite a lot of the tension that existed along the #5 rank.  Black now casts his eye towards a K-side operation.",
        "12... e5": "Closing the centre.  Now for the K-side...",
        "13. Qa4": "(!?) This move was a bit of a mystery to me.  Was he thinking of following up with 14...Nb5, then?  ",
        "13... a6": "Also playable, and probably more in keeping with Black's 'grand strategy', was ...Bh6, with operations upon the dark squares.  But I didn't really consider it, deciding to keep out the knight from b5 instead.  This move was later to come in useful...",
        "14. Qb3 g5": "At last!!",
        "15. Bg3 h5": "With two quick pawn thrusts, Black grabs the initiative.  But it has to be admitted, the bishop that has just been chased off had served a useful function in keeping back Black's f-pawn from its usual ...f5 break.  On the other hand, it was left a target, and is driven to a spot with very little outlook.",
        "16. h3": "Just about forced, as ...h4 was threatened.",
        "16... Bc8": "Played after quite a lot of thought.  Already I was beginning to spend almost as much time on this game as all the others combined - though, as will be seen, this time expenditure was not continually maintained.  I didn't want to play ...h4 - not yet at any rate - as I felt I would need the pawn where it was to obtain leverage against the strong light squares in White's position.  I didn't like ...Qc7 as I wanted that piece able quickly to get to the K-side, and the immediate ...Ng6 didn't seem to offer much either.  This bishop move served two purposes: [a] to give support along the light squares on the K-side, and [b] to make way for the a8-rook to take up guard duties on b8... should this service be required of it.",
        "17. Be2": "Good move, eyeing the loose pawn on h5...",
        "17... Ng6": "Heading for f4.",
        "18. Rcb1": "I think this was intended to support the advance of the b-pawn (b2-b4) once the Queen stepped aside.  Fair enough: White is the stronger on this flank, and the game has developed along lines very similar to a King's Indian Defence - with Black building up a K-side attack, and White conducting operations on the other wing.  At that, White could probably feel reasonably confident that his K-side is adequately defended.  The light squares in particular are heavily mined.  It will require some preparation to break through there.",
        "18... Nf4": "A very nice spot for the knight - so strong indeed that White gives up his rather moribund bishop for it.",
        "19. Bxf4": "(!?)  Expected, but, as confirmed by the GK engine, the retreat Bd1 came into consideration.  Black is making progress on the K-side, albeit slowly.",
        "19... exf4": "(!)  It was so tempting to take with the g-pawn and open up a file for the rook against the castled White King.  But after 19...gxf4  20.Nh4! it would have been already hard to see Black could proceed.  Maybe 19...gxf4  20.Nh4 f5!  21.Nxf5 Nf6  22.Nxg7 Kxg7  23.Qc2 (preparing the foreshadowed pawn break) ...Rg8  24.b4  Kh6  25.Qd3! Rg7 with very nebulous chances ... for both sides.  The capture played gives Black a fine post at e5 for his remaining knight.",
        "20. Nh2": "I more than half-expected this, though Nd2 also came into consideration.  White is making those light squares very hard to traverse.  Something like 20.Rfe1 instead would certainly have provoked a strong attack: 20.Rfe1? f5!  21.exf5 g4!  22.hxg4 hxg4  23.Nh2 g3  and if 24.fxg3 fxg3  25.Nf3 Ne5 Black would be having the more fun.  Meanwhile, Black carries on his attack, sacrificing a pawn...",
        "20... Ne5": "(!?)  Giving up a pawn fo the sake of momentum.  But the GK engine doesn't like it one bit, preferring to preserve the pawn by ...h4.",
        "21. Bxh5 f5 22. exf5 Bxf5": "Attacking the rook at b1.  All very menacing, but... Black still hasn't broken past the d1-h5 diagonal that is proving something of a Maginot line...",
        "23. Rbe1": "It was after this move that I subjected Black's resources on the K-side to a thorough scrutiny.  Conclusion?  It was stalled for now: no further progress could be made on this wing.  OK, if we can't break through, let's go round.  The only way is via the Q-side.  But that's where White was supposed to be operating!  As it turns out, White is not especially strong on that wing after all, so much having been devoted to K-side defence.",
        "23... b5": "(!) I do like these sudden switches from one flank to another.  Apart from anything else, it shows who is calling the shots!  But things weren't going to go all my way, as it transpired...  Incidentally, I didn't think much of 23...Nd3 at all.",
        "24. cxb5 axb5": "(!?) This, as it happened, was a change of mind, having originally intended 24...c4 at once: 25.Qb4 (to protect the lead b-pawn) ...Nd3  26.Qxc4 axb5  27.Nxb5 Nxe1  28.Rxe1 Bxb2, but after 29.Bg4!! with an eye the e6-square, things didn't look too flash for Black after all.  Maybe somewhere in the middle of that line ...Rc8 would have improved Black's prospects.  ",
        "25. Ne4": "(?) This move took me completely by surprise - and I quite failed to appreciate the implications.  I was fully anticipating 25.Nxb5 (not 25.Qxb5? Bd3!)  25...c4  26.Qb4! but maybe White didn't like his prospects after 26...Nd3 or 23...Rxa2.  Even 23...Qb6 looks OK for Black: 27.Qxd6 Qxb5  28.Rxe5 Bxe5  29.Qxe5 Rxa2.  Whether any of these lines would have led to much for Black is hard to say, but I can well understand if White wasn't prepared to test them.  But as it transpires, this Knight move was the mistake that brought White back into the game!  ",
        "25... c4": "(?!) Thematic, but played much too hastily.  After spending so much time on the game, this was one of the moves I played with almost no reflexion at all.  A bit more thought about the implications of White's previous move might have revealed the power of 25...Ra4! and Black would have a formidible initiative on both sides of the board.",
        "26. Qxb5": "(!) Of course.  Thinking 'nothing much has really changed, just take on a2,' Black continued...",
        "26... Rxa2": "(!?) But maybe ought to have taken the time to look at whether 26...Qc7 or 26....Bxe4 offered more.",
        "27. Nf3": "(!?) Again, an unanticipated move (27.Nc3), but it may be the best!",
        "27... g4": "(?) A complete miscalculation, as the GK engine observes.  Originally planning on ...Rxb2, I had the uneasy feeling that I'd already let the advantage, if not the initiative withal, slip away from me (that rook move I overlooked two moves back, of course!).  This move was a violent attempt to wrest back the initiative that should have got the kicking it deserved.",
        "28. hxg4": "(?!)  This really ought to get a (?), as 28.Nxe5 would have placed the  advantage firmly in White's hands.  I had completely overlooked that possibility, assuming, as I (ought to) know better than to do, that White would retake on g4.  However, this recapture leaves the game finely balanced: all on for a battle royal for the initiative!",
        "28... Rxb2": "(!) As you were.  Of course, the rook may not be taken (29.Qxb2; Nxf3ch), but White has attacking chances of his own.  ",
        "29. Qa6": "(!) Things are starting to look a bit weird as the pieces considerably outnumber the pawns.  This became more pronounced later on...",
        "29... Nxg4": "(!?)  The alternative, 29...Rb6, might actually have been better, but I wanted to push the issue.  This involved some risk, though I felt sure that I could always bale to a draw if things went turnip shaped. ",
        "30. Bxg4": "(!?) As you'd expect.  But as it transpired, White missed a fine opportunity, right here.  The Queen sacrifices itself for very promising endgame prospects:  30.Nxd6! Rb6  31.Qxb6!! (What the...?) 31...Qxb6  32.Nxf5 Rxf5  33.Bxg4 Rf8  34.Re6 ... and White has a lot of pressure on Black's position.  Well, I didn't see it at the time.  As it happens, the GK engine also gives White a plus after 30.Qxc4 Nf6  31.Nxf6.  So Black was running close to the extreme edge, here!",
        "30... Bxg4 31. Qxc4": "Resources have become very slender, with few pawns remaining, but a heck of a lot of pieces.  By the way, the 2B bs 2N motif was largely meaningless in this position, so Black's next is hardly surprising...",
        "31... Bxf3 32. gxf3 Rf5": "Aiming for the g- and h-files...",
        "33. Qc6": "(?) The GK engine calls this a mistake, preferring 33.Rc1.  Possibly the latter frees the immobile f1-Rook...",
        "33... Rb4": "(!) Against an opponent with a similar rating or greater than mine, I would most likely have cut straight to the draw with 33...Rg5ch.  But I still thought the game offered Black chances of more.  The threat is ...Rxe4, with mate then looming on the g- or h-file.  I didn't much like ...Rb6, but maybe it ought to have been looked further into, with ...Rb7 as a possible follow-up.",
        "34. Qxd6": "(!?) Suddenly things weren't so simple.  White's salvation, it was becoming clear, lay in the timely retreat Ne4-g3, giving up the knight for the likely Rook and Bishop vs Rook ending.  This called for some very intricate manoeuvring, with no guarantee that Black would get more than the draw even then.    I admit that the Ng3 move I had anticipated somewhat down the track, but the GK engine recommends it right here (34.Ng3!), giving Black only a minimal advantage.",
        "34... Rg5+": "It was this or 34...Qxd6 at once.  I figured that they transposed into the same line, but stand to be corrected on this.",
        "35. Kh1": "(?)  I notice the GK engine also points to this as a mistake.  At the time I had a feeling this might lead to more for Black than Kh2 would have done, as the latter might have allowed the f1-rook to slip out via g1 or h1.  At any rate, the real reason why this retreat turns out badly will emerge later...",
        "35... Qxd6 36. Nxd6 Rb6": "Pinning the knight against the h6-square.  How can White save it?  How will it get back in time to sacrifice itself at g3?",
        "37. Re6 Rxd5": "Renewing the pin - only now it's a double pin, as the knight is pinned against the rook, AND h6.  But White can survive this, at least",
        "38. Re8+": "The first unpinning...  But at the time, it suddenly dawned on me that 38.Re4!? might have been be feasible.  The idea was that Black runs out of pawns after, say 38.Re4 Rdxd6  39.Rxf4  Rh6ch  40.Kg2 Rg6ch  41.Rg4 If a pair of rooks come off, Black has just R and B vs R and 2P, and somehow, it was hard to imagine that the two pawns would transform a book draw (R and B vs R and no pawns!) into a loss.  To realise any advantage after 38.Re4, Black would have had to proceed much more subtly. ",
        "38... Kh7": "Forced.",
        "39. Ne4": "If Re4 was feasible a move back, it was still feasible here.  Having said that, the knight move was what I expected, and it still looked as though it might hold.  But the possibility of Ng3 had been on my mind for quite some time, and now I thought I had the answer.",
        "39... Rg6": "(!) Threatening mate, and confining the K to the h-file.  There is only one possible defence.",
        "40. Ng3": "Biting the bullet.  Yet with no pawn remaining, how can Black win the ending?  Surely 2R plus B vs 2R is no better than with one rook apiece?  And White has extra pawns into the bargain.  The answer lay in the poor position of White's King.  Had it stood at h2, the win for Black, if one existed at all, would have been very problematic.",
        "40... fxg3 41. fxg3 Rd2": "(!) The key to White's castle.  Having left the second rank, the pawns can not shield the White King, who is imprisoned in his own dungeon.",
        "42. Re7": "(?!) Not as good as 42.Re4, though Black already had the answer to that: 42...Bf6!",
        "42... Rh6+": "(!?) Better was to take the pawn at once. but I preferred this as in keeping with a winning plan I had in mind.",
        "43. Kg1 Kg8": "Threatening ...Bd4ch.",
        "44. Rxg7+": "(?) Rather too drastic a solution, but White's game was heading south already anyway.  Instead 44.Re4 would have led to an ending in which he kept his pawns... for a while longer...",
        "44... Kxg7 45. g4 Rhh2 46. Re1 Rhg2+": "A finesse to gain a tempo to attack and win the f-pawn.  Much better than the immediate ...Rhf2.",
        "47. Kh1": "If course the other direction led to mate at once",
        "47... Rgf2 48. g5": "The f-pawn was defenceless.",
        "48... Rxf3 49. Rg1": "Cutting to the chase?  My opponent allowed it was a simple oversight.  But, cramped as he is - neither K nor R can leave the back rank - the game was up anyway.",
        "49... Rh3#": "(0-1)  A fascinating game, I found: quite a few mistakes by both sides, and taking some bizarre turns in its latter stages.  I was very impressed with White's play in this game.  He came  desperately near to pulling off a draw - so close that for a while I thought he had just about succeeded.  "
    },
    "url": "https://gameknot.com/annotation.pl/wired-or-just-weird?gm=40581",
    "gameName": "Wired... or just weird?",
    "players": "thereaper1 (1480) vs. ionadowman (2002)",
    "opening": "French defence (C00)"
}