{
    "moves": {
        "1. e4 d5 2. exd5 Nf6 3. c4 e6": "Standard Icelandic move.",
        "4. dxe6 Bxe6 5. d3": "Yummy position for black.",
        "5... Bb4+ 6. Bd2 Qe7": "Bxc4+ is threatened, or, if you prefer, Bg5+. ",
        "7. Bxb4": "Not advisable. Be2 seems better. ",
        "7... Qxb4+ 8. Qd2": "Only move to protect b2. ",
        "8... Nc6": "Developement granted if white exchanges queens. ",
        "9. Qxb4": "Thank you white. You'll see what developement advantage is about. ",
        "9... Nxb4": "Nc2+ is threatened. ",
        "10. Na3 O-O-O": "Nxd3 is threatened. ",
        "11. Kd2": "If Rd1, Nxa2. But it was highly preferable than this. ",
        "11... Ne4+": "Nxf2 is threatened. ",
        "12. Ke3": "Ke1 or Ke2? allow Nxd3. But still better than centering the almost naked K like this. ",
        "12... Nf6": "Time to be wise. I'm not sure about any other move. Ng5, say, and white can start harassing me and try to catch in developement. ",
        "13. h3": "Preventing Ng4+, but it was only a \"naive\" check without serious consecuences. White is not moving his pieces. ",
        "13... Rhe8": "Black's position is completely winning, but still nothing \"concrete\". I must be careful about losing \"steam\" and get a favourable endgame but nothing more. Again, a discovered chck is threatened. ",
        "14. Kd2": "Kf3 could be a little better, but white is doomed. ",
        "14... Ne4+": "I can go on with this forever, but I'm just controlling the position. My aim is to threaten all the time, so white can just defend and nothing more. ",
        "15. Kc1": "White decides to give up some pawn. But Nxd3, BxN, RxB just helps him to free his pieces. When you have a dev adv, you must avoid piece's exchanges, it just helps the opponent. ",
        "15... Nxf2": "Now this is not all that terrible, since the R has an escae route. ",
        "16. Rh2": "I can take now the d3 pawn. ",
        "16... Bf5": "...but my aim is not exchanging pieces, so I create a threat (Re1+, winning Ra1 or Bf1. ",
        "17. g4": "Now Re1+, Kd2, RxR, gxB. But I don't want to exchange... still, in the blitz hurry, I have to be careful not to overattack and lose some piece. ",
        "17... Nfxd3+ 18. Bxd3": "Nxd3+ gets the tempo, but then I'll have to lose it retreating my B. Re1+ etc. still wins me the exchange, but nothing more. ",
        "18... Bxd3": "Now, very few moves are left to white. I would recommend Rd2, so to defend Re1+ with Rd1. He went...",
        "19. Kd2": "...setting a nice trap: this concedes the pawn c4, but hey, be careful: Bxc4+, Kc3, and I lose a piece!!!",
        "19... Bg6+": "So, this is much better. ",
        "20. Kc3 Na6": "...and this. My pieces are solidly placed, and still white has it very hard to move. Rd3+, Kc2 (forced), Rxh3+ followed by RxR is threatened. ",
        "21. b3": "Still neglecting developement, but if Ne2?, Re3#!, or if Nf3, Rd3+ and the N is just lost for nothing. This move opens a fly square for the white K. ",
        "21... Rd3+": "All the same, without being able to spot something more. ",
        "22. Kb2": "How to go on, now? It's much harder to play attacking than defending. Again, I am only +1 in material, so I have to find a way to make my advantage concrete. ",
        "22... Rde3": "Almost no useful moves for white, again. ",
        "23. Nb5": "Well, you'll expect Kb8, defending a7, but... I can easily give away a pawn for a tempo. ",
        "23... Nb4": "This threatens Nd3+. Not a big deal, but still going on and keeping my pieces over the WK. ",
        "24. Nxa7+ Kb8": "See? Nothing happened. Of course, I didn't play c6? the previous move (Nd6+, losing he exchange). ",
        "25. Nb5": "...and this N is harmless, and I have the tempo. ",
        "25... Nd3+ 26. Ka3": "Not clear about Kc3 instead, but who wants another discovered threat?",
        "26... Re8e6": "This is very sadistic. A \"quiet\" move threatening Ra6...#!",
        "27. Nc3": "Only move to prevent mate. You can see Nc3's potential. ",
        "27... Ra6+ 28. Na4": "Ok, but this N is lost after...",
        "28... c6": "...threatening b5. White can hardly cope with it. My advantage will be concrete (a full piece as the least). Of course, b4 - opening a square for the K is useless as it sets up a discovered check with the N... which I wouldn't have gone for, of course!",
        "29. Re2": "Nice (given the losing situation), since it get rid of one of my attacking pieces. I had to choose among Rmoves along the 3rd rank (Re8+ is no dangerous), but I preferred the tempo (almost always preferring tempo!)",
        "29... Rxe2 30. Nxe2 b5": "A piece as the least is mine. Can you see the best white's move here?",
        "31. cxb5 cxb5": "Again: can you see the best white move here?",
        "32. Nec3": "?? No, he just wants to retake his N with the c3's one, but overlooked my answer. I almost went for the N, I confess. But you have to look and search for \"something more\", ever... even to find out that there is nothing. Fortunately, I did see it...",
        "32... b4#": "Even material, and a very nice mate, with just N and pawn. No need for R or B. Thank you Caissa, you were with me this time. "
    },
    "url": "https://gameknot.com/annotation.pl/with-some-touch?gm=60235",
    "gameName": "With some touch",
    "players": "Metkan (1549) vs. damafi (1460)",
    "opening": "Scandinavian (B01), Icelandic gambit"
}