{
    "moves": {
        "1. f4": "It doesn't crop up very often but when facing Bird's Opening I like to play From's Gambit. I don't play many gambits as I don't like giving away pawns but I particularly like this variation with 4 . . g5 as black seems to have reasonable compensation.",
        "1... e5 2. fxe5 d6 3. exd6 Bxd6 4. Nf3 g5": "{black has given up a pawn but is threatening to immediately force the Knight from f3}",
        "5. g3 Nc6 6. Bg2 g4 7. Nh4 Nge7 8. b3 Ng6": "{hoping for Nxg6 hxg6 opening the h file . . .} ",
        "9. Bxc6+": " {white avoids opening the h file by making g2 available for the Knight but giving up the light squared Bishop seemed risky even if it did weaken Black's pawns.} ",
        "9... bxc6 10. Ng2 Be5": "{Shredder likes this move, stopping white getting any pressure with Bb2} ",
        "11. Nc3 h5": "{ignoring what I recommend to juniors about developing pieces quickly when teaching chess but Shredder also played this move so I guess it's okay.} ",
        "12. Bb2 h4": "Continuing the pawn advance, Shredder also plays this move}",
        "13. e3": " {taking on h4 is no better for white after ... Nxh4}",
        "13... hxg3": " {regaining not just the gambit pawn but also the h pawn} ",
        "14. Qe2 Qe7 15. O-O-O gxh2": "{I had slight concerns about my lack of development but there's no way for white to exploit this.} ",
        "16. d4 Bd6 17. e4": "{threatening to trap my Bishop with e5 but I anticipated this and after my Nf4 expected to exchange on g2 and follow up with Bf4+ and Qg5.}\n\n",
        "17... Nf4": "{Shredder prefers f6 here but this felt more forcing?}",
        "18. Nxf4": "{Shredder likes Qd2 which it gives as slightly better for black.} ",
        "18... Bxf4+ 19. Kb1 g3": "{my 10th pawn move, whilst a Bishop is still resting on c8 and my King still on e8! I'm often telling juniors to limit pawn moves to 3 in the first 10 and instead develop pieces and castle early! but I felt this was justified and I also advise them that there are often exceptions to the rule.} ",
        "20. Qc4": "{Attacking c6 but Bd7 is intended anyway so this seems wrong?}",
        "20... Bd7 21. Qf1 Qg5": " {defending the Bishop and threatening g2 and Bishop h3}",
        "22. Ne2": "{Losing the exchange but white has nothing better.}",
        "22... g2 23. Qxf4 Qxf4 24. Nxf4 gxh1=Q 25. Rxh1 O-O-O": "{better late than never and mainly to activate the other Rook.} ",
        "26. d5": "{forced to enable the white Bishop to get to d4 preventing my d8 Rook moving to g1 via g8 but this allows black to eventually manoeuvre the Bishop to c6} ",
        "26... Rdg8 27. Bd4": " (Bxh8 is met with Rg1+)",
        "27... Rh4 28. Ne2 Rg2 29. Nc3 cxd5 30. Nxd5 Rxe4 31. Bxa7 Reg4 32. Kb2": "{to prevent Rg1+ (as Rg1 would then be met with Rxh2 and if Ne3 then Rg1)}",
        "32... Kb7 33. Be3 Bc6 34. Nf4 Rxc2+": "{and after Kxc2 and Bxh1, the h pawn is going to Queen so white resigns.} \n0 - 1\n\nEntered the game for the Worcestershire Woodcock Prize and won it for the first time!\nhttp://www.raycollett.net/worcs/woodcock.htm\n\nThanks for looking."
    },
    "url": "https://gameknot.com/annotation.pl/worcestershire-i-v-nottinghamshire-i?gm=66370",
    "gameName": "Worcestershire I v Nottinghamshire I",
    "players": "Andrew Walker (171) vs. John Wrench (160)",
    "opening": "Bird (A02), From gambit, Lasker variation"
}