{
    "moves": {
        "1. d4": "So he starts with d4",
        "1... Nf6": "I play my usual",
        "2. c4": "Still very conventional",
        "2... g6": "and the same from me",
        "3. g3": "Slightly unusual, Nc3 is more common",
        "3... Bg7": "I develop",
        "4. Bg2": "So does he",
        "4... d5": "I prevent e4. I call this the semi-grunfeld, but I see the opening database calls it the King's Indian (E60), 3.g3, counterthrust variation.",
        "5. cxd5": "so he takes",
        "5... Nxd5": "and I take back",
        "6. Nf3": "He develops",
        "6... O-O": "I castle",
        "7. O-O": "so does he",
        "7... c6": "So now I had to start thinking for myself. This move seemed reasonable, to blunt his Bg2. Afterwards I saw that Nb6 and Nc6 are more commonly played.",
        "8. e4": "So he grabs the centre",
        "8... Nc7": "I thought that this was most consistent, but I found out later Nb6 is more usual",
        "9. Nc3": "So he develops",
        "9... Bg4": "I put pressure on the centre. I am threatening to take on f3 then d4",
        "10. Be3": "So he protects",
        "10... Nd7": "I develop",
        "11. h3": "This move seems to me to be very natural, but it takes us out of the opening databases (not that either of us were using them at the time of course). Qb3 is the only move on the Gameknot opening databases",
        "11... Bxf3": "So I take",
        "12. Qxf3": "he takes back",
        "12... e5": "I attack his centre",
        "13. Rfd1": "he mobilises the rook",
        "13... Qf6": "I offer a queen exchange",
        "14. Qxf6": "which he takes",
        "14... Bxf6": "I take back",
        "15. d5": "He advances. Now I thought that the best plan was to block the position up a bit, as he has the 2 bishops, the last thing I want is the position opening up. Shredder assesses this position as +1.41 for white.",
        "15... c5 16. a4": "so he stake a claim to space on the queen side as well as the centre. Shredder likes h4 immediately.",
        "16... Rfd8": "Shredder likes Rfd8 too",
        "17. h4": "so he plays it now",
        "17... Ne8": "I have a plan to blockade the passed d pawn with my knight on d6. Shredder likes this move too, but still gives it as +1.59 to white.",
        "18. Bh3": "Improving the scope of his bishop, and also threatening to take the knight, followed by the pawn on c5. I didn't want to play b6 as then he has a5 and the chance to open the a file.",
        "18... Rac8": "So this rather curious self-pin is the best move, according to Shredder",
        "19. f3": "so he gives support to e4",
        "19... Be7": "and I prepare to give support to my knight which is going to d6. I thought if d6 immediately he has Nb5 hitting my pawn on a7, and if I exchange on b5 my pawn on a7 is then under attack down the a file. Shredder actually prefers Nd6 immediately and if Nb5 then Nc4",
        "20. Kf2": "and now he mobilises his king. I was rather afraid 20. d6 may be good for him in this position",
        "20... Nd6": "so now I play it",
        "21. Nb5": "He plays the expected",
        "21... a6": "I continue with my plan",
        "22. Nxd6": "He takes",
        "22... Bxd6": "I take back. Shredder gives this as +1.68 to white",
        "23. Bg5": "I hadn't really looked at this. If I move my rook, my knight on d7 goes, so I have only one move.",
        "23... f6": "which I played. Now simply Bxd7 looks good for white. I was looking at 24. Bxd7 Rxd7, 25. Bxf6 h6 (threatening to trap his bishop) 26. f4 exf4 27. e5 fxg6 28. Kxg6 and although I have managed to maintain material equality, his connected passed centre pawns look like winners! Interestingly Shredder doesn't like h6 and also prefers 26. g4 to 26. f4. It also prefers 25. Be3 rather than taking the pawn.",
        "24. Be6+": "Nick told me after the game, he only looked at Kf8 and Kh8 as replies and overlooked my simple reply.",
        "24... Kg7": "Shredder still gives white as being +1.18",
        "25. Be3 b6": "I think it was around here I offered a draw. Shredder prefers c4 to b6",
        "26. Bh3": "I am not convinced this is best, Shredder likes h5 or Rh1 or Rdc1",
        "26... Rc7": "So I finally break the pin. Shredder still likes c5",
        "27. Bf1": "The point of the retreat",
        "27... Ra8": "Easily dealt with however",
        "28. Rdc1": "Not quite sure why he played this",
        "28... f5": "so I played this.",
        "29. exf5": "He took and offered a draw, which I was pleased to accept. Shredder still thinks white is slightly better - +0.68 to be exact. OK thanks for reading, please leave a comment of two, and don't forget to rate the annotation!"
    },
    "url": "https://gameknot.com/annotation.pl/worcester-v-kidderminster?gm=41116",
    "gameName": "Worcester v Kidderminster",
    "players": "Nick Harris (BCF176) vs. me (BCF158)",
    "opening": "King's Indian (E60), 3.g3, counterthrust variation"
}