{
    "moves": {
        "1. e4": ".",
        "1... c5": ".",
        "2. Nf3": ".",
        "2... Nc6": ".",
        "3. d4": ".",
        "3... cxd4": ".",
        "4. Nxd4": ".",
        "4... Nf6": ".",
        "5. Nc3": ".",
        "5... d6": "In questa apertura Siciliana (B67), Fabiano opta per una variante complicata, la Rauser, che l'anno scorso, non senza rischi, gli ha creato una certa popolarità",
        "6. Bg5": ".",
        "6... e6": ".",
        "7. Qd2": ".",
        "7... a6": ".",
        "8. O-O-O": ".",
        "8... Bd7": ".",
        "9. f4": ".",
        "9... h6": "In questa posizione il nero ha diverse possibilità. La scelta di Fabiano è dettata dai suoi propositi per la prossima mossa. Una specialità di Li Chao che Anand ha a lungo studiato e rielaborato (intervista con caruana a fine partita)",
        "10. Bh4": ".",
        "10... b5": "Sarebbe stato meglio 10. ... Cxe4 11. De1 Cf6  in vista di 12. Cf5. Per una partita così importante, anche queste mosse sarebbero state da prendere in considerazione.",
        "11. Bxf6": ".",
        "11... gxf6": "L'idea è quella di indebolire la posizione del Re avversario e le case bianche. Un'idea intelligente. Al nero sarebbe stato più utile avere il pedone in h7 anziché in h6.",
        "12. f5": ".",
        "12... Qb6": ".",
        "13. fxe6": ".",
        "13... fxe6": "Forse 13. Cxc6 seguito da Ad3 avrebbe permesso al bianco una più ampia possibilità di gioco.",
        "14. Nxc6": ".",
        "14... Qxc6": "Dxc6! Insolita risposta con questa struttura di gioco, ma a mio parere, più forte che catturare il cavallo con l'Alfiere. Fabiano tiene protetta la casa d7 per rinforzare la debolezza di e6. Il ragionamento è abbastanza lungo, ma interessante. Se fosse stato giocato \n14. ... Axc6\n15. Ad3 h5\n16. Rb1 b4\n17. Ce2 Dc5\n18. Thf1 Ah6\n19. Te1 a5\n20. b3\navrebbe permesso al bianco di poter pianificare Ad3-c4 e Ce2-d4 mentre il nero avrebbe dovuto perdere tempo prezioso per coprire Pe6.\n",
        "15. Bd3": ".",
        "15... h5": ".",
        "16. Kb1": ".",
        "16... b4": "16. ... Ah6?! 17. Df2 avrebbe aiutato il bianco a amalgamare maggiormente la formazione.",
        "17. Ne2": ".",
        "17... Qc5": ".",
        "18. Rhf1": "Fabiano  si accorge delle conseguenze della sua apertura che in questa occasione non ha dato i frutti che sperava. Infatti giocando 18. e5!. Il bianco avrebbe sacrificato un pedone per scardinare il muro davanti al Re nero.",
        "18... Bh6": ".",
        "19. Qe1": ".",
        "19... a5": ".",
        "20. b3": "Assicura all'Alfiere una posizione forte nella diagonale a2-g8, non per attaccare ma per premunirsi contro la probabile a5-a4.",
        "20... Rg8": "20. ... a4, 21. Ac4 axb3, 22. Axb3 non aiuta il nero. Il Re bianco è al sicuro grazie a Ab3.",
        "21. g3": ".",
        "21... Ke7": ".",
        "22. Bc4": ".",
        "22... Be3": "Nell' Hockey si potrebbe definire questa mossa un passaggio intelligente in un'altra zona. Con 22. ... Tg4, 23. Cd4 a4, 24. Tf3 il bianco avrebbe avuto tutto sotto controllo.",
        "23. Rf3": "Forse Cf4 avrebbe reso la partita più interessante.",
        "23... Rg4": ".",
        "24. Qf1": ".",
        "24... Rf8": ".",
        "25. Nf4": ".",
        "25... Bxf4": "Cercare di mantenere l'Alfiere, avrebbe dopo: 25. ... Ad4, 26. Tfd3 Ae5, 27. Cxh5, creato solo problemi.",
        "26. Rxf4": ".",
        "26... a4": "Come riconosciuto da Caruana dopo la partita, 26. ... Ac6 avrebbe alleviato la tensione sui suoi pezzi. Se il bianco avesse risposto con 27. Dd3, il nero avrebbe replicato con Tf7?! rendendo il sacrificio di pedone più utile e limitando l'iniziativa del bianco.",
        "27. bxa4": ".",
        "27... Bxa4": ".",
        "28. Qd3": "Ora il bianco sta elaborando e4-e5.",
        "28... Bc6": ".",
        "29. Bb3": ".",
        "29... Rg5": ".",
        "30. e5": "Non c'è alcuna possibilità per il bianco di di rintuzzare questa offensiva. Ma probabilmente Fabrizio deve aver pensato che l'attacco è la miglior difesa :-)",
        "30... Rxe5": ".",
        "31. Rc4": "Si poteva giocare anche 31. Dh7+ Tf7, 32. Dh8.",
        "31... Rd5": ".",
        "32. Qe2": ".",
        "32... Qb6": ".",
        "33. Rh4": ".",
        "33... Re5": ".",
        "34. Qd3": ".",
        "34... Bg2": "Con 34. ... d5, 35. Dh7+ Tf7, 36. Dh8, il nero avrebbe avuto qualche difficoltà nel bilanciamenro della struttura della sua formazione.",
        "35. Rd4": "Il bianco si è accentrato.",
        "35... d5": ".",
        "36. Qd2": ".",
        "36... Re4": "Probabilmente sarebbe stato meglio giocare; 36. ... Ae4, 37. Txb4 Dc6, 38. Rb2, portando la partita verso una patta.",
        "37. Rxd5": "La ragione di questa mossa è chiara anche perchè è l'unica da giocare in questa combinazione finale.",
        "37... exd5": ".",
        "38. Qxd5": "Minaccia matto in d7. La disarmonia nella formazione dei neri, nonostante il vantaggio materiale, è un grande svantaggio.",
        "38... Qc7": "Si sarebbe potuto giocare anche Td4, ma anche dopo 39. Dxd4 Dxd4, 40. Txd4 Tb8, per il nero sarebbe stato difficile non perdere.",
        "39. Qf5": ".",
        "39... Rf7": "A questo punto Fabiano Caruana ha chiesto la patta che, logicamente, è stata rifiutata.",
        "40. Bxf7": ".",
        "40... Qe5": ".",
        "41. Rd7+": ".",
        "41... Kf8": ".",
        "42. Rd8+": "Se 42. ... Rf7, 43. Dh7+ Re6 44. Dd7# matto."
    },
    "url": "https://gameknot.com/annotation.pl/world-championship-candidates-mosca-11-28-marzo-2016?gm=62028",
    "gameName": "World Championship Candidates, Mosca 11-28 Marzo 2016",
    "players": "Sergey Karjakin (2760) vs. Fabiano Caruana (2794)",
    "opening": "Sicilian (B58), classical"
}