{
    "moves": {
        "1. e4 e5 2. Nf3 Nf6 3. Nxe5 d6 4. Nf3 Nxe4 5. Nc3 Nxc3 6. dxc3": "Having said that, Susan starts here with, \"Petroff again but 4. Nf3 instead of Nd3. This is more ambitious approach with 0-0-0\"",
        "6... Be7 7. Be3 O-O 8. Qd2 Nd7 9. O-O-O Nf6 10. Bd3 c5": "The whole idea is white will launch a Kingside attack. This has the making of a very dynamic game!  Giri played 11. Rhe1 We are still in opening theory. But Carlsen is thinking here. So perhaps he is trying to recall some special home prep to create chaos since 10...c5 is well known. ",
        "11. Rhe1": "and Caruana played",
        "11... Be6": "immediately. In top level games, white won 1 and drew 3. Here Karjakin played 12. Bg5. So did Giri while Sasikiran played 12. Kb1. Be prepared for some Carlsen surprise soon I am quite surprised. Why is Carlsen thinking so much? We are still in opening theory. After ",
        "12. Kb1 Qa5": "immediately. So they are following the Sasikiran v Miro game in St Louis just a few weeks ago.",
        "13. c4 Qxd2 14. Bxd2": "Carlsen cannot help himself. He wants to head to endgame immediately. No risk grinding! It seems that both sides are satisfied with what they have ",
        "14... h6": "preventing 15. Ng5 Sorry but this now has the making of a long boooooring game I am at a suite overlooking Hyde Park. But I am not in London for the World Championship. I am here for other reasons  – at Four Seasons Hotel Carlsen opted for ",
        "15. Nh4": "with a direct threat of Ng6 or Nf5. Things can get wild with 15... Ng4 16. Ng6 fxg6 17. Rxe6 Nxf2 18. Rde1 Nxd3 19. cxd3 Bf6 20. Rxd6 ",
        "15... Rfe8": "and",
        "16. Ng6": "immediately. That is what Carlsen wants. Long slow grind with microscopic advantage with no risk. ♟Carlsen once again had nothing special prepared. He is like in an MMA fight and his only objective is to get his opponent on the ground to grind something out, little chance of getting knocked out. ♟ – at Four Seasons Hotel Even if he can hold on to his title, Carlsen will have big trouble holding on to his #1 ranking long term unless he modifies something. He cannot continue to hope that he can beat others all the time with this style. ♟ ",
        "16... Ng4 17. Nxe7+ Rxe7 18. Re2 Ne5 19. Bf4 Nxd3 20. Rxd3 Rd7 21. Rxd6 Rxd6 22. Bxd6 Rd8 23. Rd2 Bxc4 24. Kc1 b6 25. Bf4 Rxd2 26. Kxd2 a6 27. a3": "Very disappointing! Another simple draw. Terrible for the fans! So the game had 99% chance of draw, and 1% of Carlsen winning. Is this the best approach for final white game in classical chess? Carlsen thinks so and fans are frustrated. It is clear he wants rapid/blitz playoff. Caruana decided that the easiest way to draw is to give up the c pawn to play out pawn down endgame with Bishops opposite colors. He wants to prove that it would be a draw even with a pawn down."
    },
    "url": "https://gameknot.com/annotation.pl/world-championship-tournament-11-live?gm=65781",
    "gameName": "\"World Championship Tournament 11 LIVE\"",
    "players": "Carlsen  vs. Caruana ",
    "opening": "Petrov (C42), Nimzovich attack"
}