{
    "moves": {
        "1. c4 e6 2. d4 d5 3. Nc3 c5": "In the 2nd Game if the 1966 match Spassky played 3...Be7 and went in for the Tartakover Variation of the Orthodox Defence.",
        "4. cxd5 exd5 5. Nf3 Nc6 6. g3": "At the moment, Spassky and Petrosian are showing that they are great strategists.",
        "6... Nf6 7. Bg2 Be7 8. O-O O-O 9. Bg5 cxd4 10. Nxd4 h6 11. Be3 Bg4 12. Nb3": "This game, so far, is being played the exact same way that it did when Spassky played Korchnoi an another championship match!!!",
        "12... Be6 13. Rc1 Re8 14. Nb5 Qd7 15. Nb5d4": "It is preffered to play 15. Bc5. It is much more sturdier move.",
        "15... Bh3 16. Nxc6 bxc6 17. Qd3 Bxg2 18. Kxg2 a5 19. Rc2 a4 20. Nd2": "This knight's job is to neutralize its opposite number.",
        "20... Qb7 21. Kg1": "It took a very long time for Petrosian to decide this move.",
        "21... Rac8 22. Rfc1 Nd7 23. Nf3 c5 24. b3 axb3 25. axb3 Bf8 26. Ra1 Nf6 27. Rca2 Rca8 28. Ra2xa8 Rxa8 29. Rxa8 Qxa8 30. Qc2 Ne4": "Spassky has the freer game and is therefore right to start probing white's resistance.",
        "31. Nd2 Nxd2 32. Bxd2 Qa6 33. Kf1": "If white was not careful, he could have fallen into a nasty trap. Can you see it?",
        "33... Qb5 34. Bc3 g6 35. Qd1 Qc6 36. f3 Qe6 37. Kg2 h5": "Strong pawn structure for black.",
        "38. h3 Bd6 39. Qd3 Be5": "I really don't think that the 2 GMs should sacrifice their bishops. I do not know why.",
        "40. Bxe5 Qxe5": "At the moment, Spassky is winning on position, but white can pose a threat.",
        "41. h4 Kf8 42. Kf1 Ke7 43. Kf2 Qe6 44. Qb5": "This is to stop the king from getting to the queenside.",
        "44... Qd6 45. Qb7+ Kf6 46. Qb5 Qc7 47. Qd3 c4": "Coming tricky for Petrosian.",
        "48. bxc4 dxc4 49. Qc3+ Ke6 50. Ke3": "White does not need to worry about a pawn ending.",
        "50... Qc5+ 51. Qd4 Qa3+ 52. Kd2 Qa5+ 53. Kc2 Qb5 54. Kc3 Qb3+ 55. Kd2 Qb4+ 56. Kc2 Qa4+ 57. Kc3 Qa5+ 58. Kxc4": "White has no more troubles.",
        "58... Qc7+ 59. Kd3 Qxg3 60. Qe4+ Kf6 61. Qd4+ Ke7": "And so both players decide on a draw.\r\n\r\nThank you for watching this breath-taking match, and goodbye :)"
    },
    "url": "https://gameknot.com/annotation.pl/world-championship-match?gm=11908",
    "gameName": "World Championship match",
    "players": "Petrosian (Unknown) vs. Spassky (Unknown)",
    "opening": "English opening (A13)"
}