{
    "moves": {
        "1. e4 c5 2. Nf3 e6 3. d4 cxd4 4. Nxd4 Nc6 5. Nb5 d6 6. c4": "white get space advantage , this variation structure reminds the English opening .",
        "6... Nf6 7. Nb1c3 a6 8. Na3 Be7 9. Be2 O-O 10. O-O b6 11. Be3 Bb7 12. Qb3 Na5": "good move , Kasparov trys to take Karpov out from the regular continuations that Karpov familiar with. even if it cost Kasparov some  inferiority . the pupular continuation is , 12...Nd7.13.Rfd1-Nc5.\n\n\n",
        "13. Qxb6 Nxe4 14. Nxe4 Bxe4 15. Qxd8 Bxd8 16. Rad1": "In this position Kasparov decided to sacrifies a pawn for  the reason he wanted to avoid passive defense on the weakness on d6 which white might make very hard pressure on that spot . however this pressure was the best of a bad lot .",
        "16... d5": "mistake : Kasparov simply loses a free pawn .",
        "17. f3 Bf5 18. cxd5 exd5 19. Rxd5 Be6 20. Rd6 Bxa2": "black didnt have to much chances after 20...Be7 or 20... Bf6",
        "21. Rxa6 Rb8 22. Bc5": "white must play corectly ,after 22.b4?-Re8!",
        "22... Re8 23. Bb5 Re6": "ether 23...Re5 didnt help so much to Kasparov ,after 24.Bd6!-Rexb5.25.Nxb5-Rxb5.26.Ra8-Nb7.27.Bc7! and win .",
        "24. b4 Nb7": "the weakness on blacks queen side and on e6 is to much for Kasparov . its all so no good for black 24...Nb3.25.Rxe6-fxe6.26.Bd6  and black in deep troubles .",
        "25. Bf2 Be7 26. Nc2 Bd5 27. Rd1": "the 2nd Rook juins to the attack .",
        "27... Bb3 28. Rd7": "Karpov with nice combination finishing the game . if 28...Bxc2 .29.Rxe6!-fxe6.30.Bxe7and black loses a free pawn and with 2 pawns lead its hopeless game for black .",
        "28... Rd8 29. Rxe6 Rxd7 30. Re1 Rc7 31. Bb6": "black resigns , this is  so unusual for me to see Kasparov so humiliated , thank you i hope you enjoyed the game ."
    },
    "url": "https://gameknot.com/annotation.pl/world-championship-match-moscow-1984?gm=45752",
    "gameName": "World championship match Moscow 1984",
    "players": "A.Karpov  vs. G. Kasparov  ",
    "opening": "Sicilian, Szen, hedgehog variation (B44)"
}