{
    "moves": {
        "1. e4": "and challenge Caruana to play his drawish Petroff.",
        "1... c5 2. Nf3 e6 3. c4": "But Caruana went for something else because a draw is over for him! ",
        "3... Nc6 4. d4 cxd4 5. Nxd4 Bc5": "This is now a must win or else for Caruana! Whether you like or dislike Carlsen, or think he deserves to win or not, it does not matter. He won in accordance to FIDE regulations, fair and square! He has never lost a WC playoff and one again he will not lose this one. So you can fault the system but not him.",
        "6. Nc2 Nf6 7. Nc3 O-O 8. Be3 b6 9. Be2 Bb7 10. O-O Qe7 11. Qd2 Rfd8": "Carlsen is trying to play rock solid! He just wants a draw and forces Caruana to go nuts if he wants to win. That is his simple game plan. This entire match came down to this position! If Caruana held, things could have been so different. But losing this devastated him! He could not recover! This is THE critical position of the playoff! Endgame matters! This is why when I played in my World Championship match in 1996, I did NOT want the match to be close. I was the challenger! I wanted to the title and nothing was going to stop me! The best of 16 game match ended after 13 games and best of 10 Candidates' Final in 7 games!",
        "12. Rfd1 Ne5 13. Bxc5 bxc5 14. f4 Ng6 15. Qe3 d6 16. Rd2 a6 17. Rad1 Qc7 18. b3 h6 19. g3 Rd7 20. Bf3 Re8 21. Qf2 Ne7": "Carlsen is telling Caruana to go ahead and try to win! I did not go into my World Championship match to do well! I wanted to win! I wanted to win big! I did not want to take any chance for a close match. This is what I hope future challengers will learn from. You must go into the match with no doubt that you will crush your opponent! This is why I strongly believe in my long time quote: \"Champions play to win while others play not to lose!\" There can only be one champion at a time, so if you want it, fight hard and give everything you have for it! ",
        "22. h3 Red8 23. Bg2 Nc6 24. g4 Qa5 25. Na4 Qc7": "Carlsen is playing very smart chess in this game. He is playing rock solid knowing that Caruana is in a must win situation. His experience shows.",
        "26. e5 dxe5 27. Nxc5 Rd7xd2 28. Rxd2 Rxd2 29. Qxd2 Ba8": "But if Caruana manages to win game 3 with black, watch out! Anything can happen in game 4! Nerves still a factor here. As long as Rapid and Blitz playoff still exist, someone has to beat Carlsen in Classical Chess as he is a beast in this format! ",
        "30. fxe5 Qxe5 31. Nd7 Qb2 32. Qd6": "Carlsen is clearly going for a draw! He is not taking any chances, and not trying to win. He is close to that point! ",
        "32... Nxd7 33. Qxd7 Qxc2 34. Qe8+ Kh7 35. Qxa8 Qd1+ 36. Kh2 Qd6+ 37. Kh1": "It will soon be a draw no matter how hard Caruana will push. Decisive victory in rapid chess for Carlsen after 6-6 tie in Classical Chess! ",
        "37... Nd4 38. Qe4+ f5 39. gxf5 exf5 40. Qe3": "The fans from Norway is about to go nuts! ",
        "40... Ne6 41. b4 Ng5": "Caruana is still trying but unless there is some divine intervention, he will not win this game. Caruana overpushed and Carlsen is winning this game too. Will Caruana offer a draw or will he go down in flame in all 3 games?",
        "42. c5 Qf6 43. c6 Ne6 44. a4 Nc7 45. Qf4 Ne6 46. Qd6": "Winning for Carlsen!",
        "46... Qa1+ 47. Kh2 Nd4 48. c7 Qc3 49. Qc5": "This is basically finito! Caruana cannot stop white from Queening! Carlsen retains his title for 2 more years! ",
        "49... Qe3 50. c8=Q f4 51. Qg4": "Caruana resigned! He lost all 3 rapid playoff games! Carlsen is the World Champion again! Hard fought in Classical Chess and dominating in playoff! Caruana resigned! Thank you everyone for enduring my endless GIFs!  I hope they will go 16 or 18 games next time! I still have so many GIFs remain in my repertoire! \n\nWhat is your overall feelings about this World Chess Championship match? I have a very strong feeling that Caruana will be back again, and with the experience he got from this match, the outcome of the next one may be different! Rocky II in 2 years? Caruana's last words in London: \"I'll be back!\" "
    },
    "url": "https://gameknot.com/annotation.pl/world-championship-tournament-live-sudden-death-finale?gm=65780",
    "gameName": "\"World Championship Tournament Live\"-Sudden Death Finale",
    "players": "Carlsen  vs. Caruana ",
    "opening": "Sicilian defence (B40)"
}