{
    "moves": {
        "1. e4 e5 2. Nf3 Nf6": "Yes! It will be a battle today, hopefully! ",
        "3. Nxe5 d6 4. Nd3 Nxe4": "this is rare move and a new fashion in search for something different against the super solid Petrov.  Just a couple month ago Caruana faced it against So:\n[Event \"6th Sinquefield Cup 2018\"]\n[Site \"Saint Louis USA\"]\n[Date \"2018.08.27\"]\n[Round \"9.1\"]\n[White \"So, W.\"]\n[Black \"Caruana, F.\"]\n1 e4 e5 2. Nf3 Nf6 3. Nxe5 d6 4. Nd3 Nxe4 5. Qe2 Qe7 6. Nc3 Nf6 7. b3 Nc6 8. Bb2 Bf5 9. Nf4 O-O-O 10. Qxe7 Nxe7 11. O-O-O Ng6 12. Bd3 Bd7 13. Nxg6 hxg6 14. Ne4 Nxe4 15. Bxe4 g5 16. h3 c6 17. c4 Be6 18. Bf3 d5 19. d3 f6 20. Rhe1 Bf7 21. cxd5 Bxd5 22. Bxd5 Rxd5 23. Re8+ Rd8 24. Rxd8+ Kxd8 25. Re1 Bc5 26. f3 Re8 27. Re4 Kd7 28. Kc2 Bd6 29. a4 a6 30. Bc3 b5 31. Bb2 Re6 32. Bc3 Re8 33. Bb2 Re6 34. Bc3 Re8 35. Bb2 Re6 1/2-1/2\nThe players are cranking out these early moves! Both are well prepared! Let's see if Carlsen and his team have a novelty somewhere for Caruana!",
        "5. Qe2 Qe7 6. Nf4 Nc6": "this seems to be a novelty.\nIn the only other GM game in my database that reached the position after 6.Nf4, Black went for the endgame with 6...Nf6\n[Event \"71st ch-RUS HL 2018\"]\n[Site \"Yaroslavl RUS\"]\n[Date \"2018.07.04\"]\n[Round \"8.5\"]\n[White \"Motylev, A.\"]\n[Black \"Rakhmanov, Ale\"] 1 e4 e5 2. Nf3 Nf6 3. Nxe5 d6 4. Nd3 Nxe4 5. Qe2 Qe7 6. Nf4 Nf6 7. d4 Qxe2+ 8. Bxe2 Nc6 9. c3 g6 10. f3 Bg7 11. h4 h5 12. Na3 Ne7 13. Nb5 Kd8 14. Kf2 a6 15. Na3 b6 16. Bc4 Rf8 17. Nc2 Bb7 18. Ne3 Kd7 19. a4 Bc6 20. Rd1 Bh6 21. Nd3 Bxe3+ 22. Bxe3 Bd5 23. b3 Bxc4 24. bxc4 Nf5 25. Bf4 Ng8 26. c5 Nxh4 27. cxd6 cxd6 28. c4 Nf5 29. c5 h4 30. cxb6 Nge7 31. Rab1 Nd5 32. Bd2 Rab8 33. b7 Nfe7 34. Rdc1 Nc6 35. Nf4 Nce7 36. Rh1 Nxf4 37. Bxf4 Nd5 38. Rxh4 Kc6 39. Rc1+ Kd7 40. Rb1 Kc6 41. Bg3 Rfe8 42. Rhh1 f5 43. Rbc1+ 1/2-1/2",
        "7. Nd5 Nd4 8. Nxe7 Nxe2 9. Nd5 Nd4 10. Na3": "Magnus is playing it super safe. Clearly still in his preparation.",
        "10... Ne6": "Caruana is a well known expert in the Petroff. No one seems to be able to crack it so far. So unless Carlsen has something well prepared, it will be very hard to beat Caruana with his pet opening. Caruana is making the Petroff fashionable like Kramnik did it with the Berlin!",
        "11. f3 Ne4c5 12. d4": "It looks like Carlsen will attempt to squeeze water from stone again. Black has no opening issues here. Rock solid!",
        "12... Nd7 13. c3 c6 14. Nf4": "I am not sure what Carlsen and his team have prepared for the match. I have not seen formidable novelties or anything which can cause Caruana to break a sweat. It seems that he once again relies on his superior middlegame and endgame play. But that is not enough so far.",
        "14... Nb6": "Black can just develop his Bishop e7 then 0-0 and he has no problem whatsoever with this game.",
        "15. Bd3 d5 16. Nc2 Bd6 17. Nxe6 Bxe6": "and still NOTHING! Caruana's position is like rock solid wall. ",
        "18. Kf2 h5": "The fans need to remember that Carlsen is in no pressure to win this match in 12 games. If the score is tied 6-6 (maybe 12 draws), then the players will have a playoff with rapid, blitz, etc. This will heavily favor Carlsen. So basically he has a big draw odd. So the pressure is on Caruana to win in regulation!\nIt is clear that Carlsen cannot allow Black to play h4. That can be uncomfortable for White has he cannot move his h1 Rook. And if h3 then the g3 square becomes problematic. ",
        "19. h4 Nc8 20. Ne3": "The players seems to be content to move the pace at glacier speed so far in this game.  The problem is how to break through or make progress without big risks? So for example, if Black plays 20...Ne7 to defend the f5 square, what can white do?",
        "20... Ne7 21. g3": "One has to admire Caruana's preparation and work ethic. He has always been a very hard worker ever since I knew him back when he was 6 years old. He is the example of how to maximize his talent through hard work. \nCaruana started playing rated chess at my Chess Center in NY. He won just 1 game out of 4 in his 1st ever tournament. He went home to train harder, came back and scored 1 win out of 3 in his 2nd tournament against tougher competition. He kept on improving and not giving up.",
        "21... c5 22. Bc2": "So finally, will we see the position opening up and maybe some actions? ",
        "22... O-O 23. Rd1 Rfd8": "This type of position is very difficult for many players, especially club players. When to break, when to exchange pawns, and to shift the dynamic of the position to favor you. I have news for you. It is hard for the grandmasters too!",
        "24. Ng2 cxd4 25. cxd4 Rac8 26. Bb3": "Black has a very strong f5 square. I think Carlsen needs to start trading some minor pieces before the position becomes dangerous. Caruana's pieces are better placed.",
        "26... Nc6": "If this is the best White can get then it is an opening success for Black.\nCarlsen may want to trade his dark square Bishop. So perhaps 27. Bg5 f6 then 28. Bf4 just to provoke f6. He wants his own Knight on f4. ",
        "27. Bf4": "Same idea of trading the dark square Bishop. But I prefer Black's pawn to be on f6 instead of f7. ",
        "27... Na5": "All of sudden, the White Bishop on b3 has limited squares to go to. Caruana has to be really happy with his position. To have this position in the 1st of 2 consecutive black games is great! \n​I am curious to know the mindset of Carlsen's team up to now. They surely cannot be happy with the type of positions he has been getting out of the openings. It is clear that team Caruana has done a better job with opening preparation. But because Carlsen is so good, he is doing fine so far.",
        "28. Rdc1 Bb4": "Black does not want to trade, especially the dark square Bishop. He wants to maintain the pressure. It is much easier to play with the Black side now. Carlsen has to go into holding this game mode as White has no concrete plan to play for any kind of advantage. As I said a few moves earlier, it is in Carlsen's interest to trade some minor pieces off. Otherwise, Caruana may have to much play. But as you can see, Caruana is wise not to trade. He thinks he has chances to play for a win here, or at least at no risk. ",
        "29. Bd1 Nc4": "It would be crazy for anyone to suggest that Carlsen is happy with his current position with White. I am sure that it is a disappointment for him so far in this game, and a draw will be good here for Carlsen.",
        "30. b3": "To be clear, White is not losing here. But it is simply much more comfortable to play black with the space advantage and better piece placement.\nOne way to simplify the position for White to hold is 30... Nd6 31. Rxc8 Rxc8 32. Rc1 Rxc1 33. Bxc1 ",
        "30... Na3 31. Rxc8 Rxc8 32. Rc1": "Here is another way to simplify. That is very important for Carlsen to trade down pieces. He is very smart to do so.",
        "32... Nb5 33. Rxc8+ Bxc8 34. Ne3": "Black still has a more comfortable position but Carlsen is making it a little easier to hold now.\nEven though things look less difficult now, Carlsen still needs to be extra careful. There are still some weakness he has to deal with such as the d4 and a2 pawns. But it sure is a lot less complicated than a few moves earlier.\nIf​ 34... Be6 35. Nc2 Bc3 36. Be2 Bxd4+ 37. Nxd4 Nxd4 38. Be3 and potentially we can have a Bishop opposite color endgame with White down a pawn but draw.",
        "34... Nc3 35. Bc2 Ba3": "White still has issues with the a2 pawn.\nCarlsen could try this 36. Bd3 Be6 37. Nc2 Bb2 38. a4 Na2 39. Ke1 Nc1 40. Bxc1 Bxc1 But he has to allow Caruana to have the Bishop pair.",
        "36. Bb8 a6 37. f4": "Carlsen took a lot of time for the last few moves. He knows that this is a critical moment for him as there is danger lurking around with the a2 and d4 pawn.",
        "37... Bd7 38. f5 Bc6": " Caruana is in good shape. He is the one putting on a tremendous amount of pressure against Carlsen, who is clearly in survival mode here. Even if Caruana does not win, it has to give him a big boost knowing that his beloved Petroff worked gloriously.",
        "39. Bd1": "Carlsen is willing to give up his light square Bishop against the Black Knight to alleviate some pressure against his a 2 pawn.\nIt is not easy being a World Champion. Carlsen has business obligations, commercial meetings, appearances, meeting with sponsors, etc. This took away a lot of his training time. In spite of this, he held his title since 2013. But the gap is closing! So soon he will have to make a hard choice of finding a better balance.",
        "39... Bb2 40. Bxh5": "Here is a decision Caruana has to make. To take on a2 or to go after the d4 pawn, or maybe both eventually? I would personally go after the d4 pawn with 40...Ne4+",
        "40... Ne4+": "Caruana also chose the d4 pawn. ",
        "41. Kg2 Bxd4": "Both players made time control. Caruana still maintains his small edge and a much easier position to play.",
        "42. Bf4": "The glaring problems for Carlsen are Black's d pawn, as well as his own a2 pawn.",
        "42... Bc5": "Clearing the way for the d pawn to march forward.\nCarlsen should make a mental note to himself. No more 1 e4 against Caruana! No more Petroff! \nAfter a long thought, Carlsen decided on",
        "43. Bf3": "Now Caruana has to move his Knight away to d2 and not allow the trade.",
        "43... Nd2 44. Bxd5 Bxe3 45. Bxc6 Bxf4 46. Bxb7 Bd6 47. Bxa6 Ne4 48. g4": "Brilliant sequence by Carlsen. He gave up a piece for a bunch of pawns hoping to simplify things to draw.",
        "48... Ba3": "Black had to stop the Queenside pawns from advancing to give time for the Knight to swing over to capture the pawns.",
        "49. Bc4 Kf8": "White only has one goal, to trade off all the pawns. If he can do it, he will hold. Black's main objective is to try to hang on to at least 1 pawn. ",
        "50. g5 Nc3": "I am sure Carlsen and his team are sweating now. Even it is hard and quite long, it is possible to Black to win. This is Caruana's best chance of the match so far. It will be devastating for Carlsen to lose with the White pieces.",
        "51. b4 Bxb4 52. Kf3": "Carlsen correctly gave up his b pawn to save the a pawn. Still a lot of work and maybe even some luck to hold.",
        "52... Na4 53. Bb5": "Not an easy endgame to win, and also not an easy endgame to hold. But these are the two best players in the world and here is their chance to prove it. Clearly this is Caruana's best chance in the match so far. ",
        "53... Nc5 54. a4": "Caruana can go after the h4 pawn with 54...Be1",
        "54... f6 55. Kg4": "Again the objective for both sides is simple. White must try to trade all Black's pawns to hold. Black must try to hang on to at least one pawn to try to win. This is the key battle. Another factor is time. White's mission is clear and not very difficult to find moves. But Black has to be so accurate to maintain winning chance. So time may come into play later on.\nWhite has no chance to win. He is fighting to survive! Black is the only one with chances to win here. ",
        "55... Ne4 56. Kh5 Be1": "This endgame is very complicated. But it is fitting for a closely contest World Championship like this one. I think it is too hard for most players, including Grandmasters. ",
        "57. Bd3 Nd6 58. a5 Bxa5 59. gxf6 gxf6 60. Kg6 Bd8 61. Kh7": "So Carlsen gave up his last pawn on the Queenside to fulfill his objective. Now he is banking on his h pawn while putting pressure on the f6 pawn forcing Black to use a piece to guard it.",
        "61... Nf7 62. Bc4 Ne5": "It does not seem that Caruana has figured out how to win this. Carlsen has done a magnificent job trying to hold this. We may have to take the title of \"Minister of Defense\" from Karjakin and give it to Carlsen if he succeeds.",
        "63. Bd5": "And Caruana must be scratching his head saying \"What do I have to do to win a game?\" \nFull disclosure: I have no idea who to win as Black here either. I cannot find any viable line!",
        "63... Ba5 64. h5": "The problem is Black's King is cut off to the g file. And Black cannot win the h or f pawn without help. So we are going around in circles without progress! \nNot so easy to dethrone a Champion! ",
        "64... Bd2 65. Ba2 Nf3 66. Bd5 Nd4": "Caruana is still trying.",
        "67. Kg6 Bg5": "White has to remember to block the Black King from getting to either g8 or g7. ",
        "68. Bc4 Nf3": "Still no progress",
        "69. Kh7 Ne5 70. Bb3 Ng4 71. Bc4 Ne3 72. Bd3 Ng4 73. Bc4 Nh6 74. Kg6 Ke7 75. Bb3 Kd6 76. Bc2 Ke5 77. Bd3 Kf4 78. Bc2 Ng4 79. Bb3": "​One scenario I could see if Black will go after the f pawn, allowing the h pawn to go to h6. Then Black will sac his Bishop for the pawn. That would lead to N+P v B but that is still a draw as Carlsen can sac his Bishop for the pawn.",
        "79... Ne3 80. h6 Bxh6": "This is like Caruana offering a draw because it is a dead draw. And they took a draw! This is a HUGE escape by Carlsen, Mr. Houdini himself! "
    },
    "url": "https://gameknot.com/annotation.pl/world-chess-championship-game-6-live?gm=65712",
    "gameName": "\"World Chess Championship Game 6 LIVE!\"",
    "players": "Carlsen  vs. Caruana ",
    "opening": "Petrov (C42), French attack"
}