{
    "moves": {
        "1. d4 Nf6 2. c4 e6": "The Queen's gambit, one of the favourite openings of most World champions.",
        "3. Nf3": "Anand avoids the Nimzo-Indian.",
        "3... d5 4. Nc3 dxc4": "Gambit accepted leads to sharp and lively complications.",
        "5. e4": "5. e3 is the more solid move.",
        "5... Bb4 6. Bg5": "A counter pin by Anand.",
        "6... c5": "Kosteniuk sacs a knight!",
        "7. e5": "Slightly impetuous move by White. 7. Bxc4 was better.",
        "7... cxd4": "Kosteniuk pins Anand's knight on c3!",
        "8. Qa4+": "An aggressive move by Anand. ",
        "8... Nc6 9. O-O-O Bd7 10. Ne4": "Both players are following theory.",
        "10... Be7 11. exf6 gxf6 12. Bh4 e5": "Black has a strong center and sufficient compensation for the knight. Theory suggests 12...Rc8 which Kosteniuk played once against Maya Chiburdanidze.",
        "13. Bxc4 a6 14. Qb3": "Anand makes his first mistake here allowing a knight fork by Black. This game is full of forks. 14. Qc2 would have maintained a good initiative for White.",
        "14... Na5 15. Bxf7+": "A bishop sac by Anand! A surprising mistake by Anand which leads to decisive material loss.",
        "15... Kf8 16. Qd3": "Kosteniuk thought for some time whether to accept the bishop on f7 immediately and played the in between move next.",
        "16... Bb5 17. Qd2 Kxf7 18. Qh6": "Anand played this move very quickly which Kosteniuk calls a mistake and shows how to win from here. 18. Kb1 is suggested by Kosteniuk.",
        "18... Qc8+ 19. Kb1 Qf5": "A powerful centralizing queen move which sets up a deadly pin of the knight on e4.",
        "20. Rhe1 Bc6 21. Ka1": "Losing decisively. 21. Nfd2 could have been played. Blitz game error!",
        "21... Bxe4": "Material loss for Anand and his game is lost from here.",
        "22. Nxd4": "? Losing more material.",
        "22... exd4 23. Rxd4 Rad8": "Kosteniuk misses a mating combination here!",
        "24. Ra4": "Anand misses 24. Rdxe4.",
        "24... Nc6": "Time pressure is telling on both players now.",
        "25. g4 Qxg4 26. f3": "Anand offers another pawn....",
        "26... Qg6": "and Kosteniuk does not accept! Time pressure.",
        "27. Qf4": "White cannot exchange queens as he is behind in material.",
        "27... Bc2 28. Rc4 Bd3 29. Rcc1 Rhe8 30. Qc7 Ne5 31. Qxb7 Rd7 32. Qb3+ Kf8 33. Bg3 Qf7 34. Qa4 Bb5": "This is a strong move setting up a deadly fork next.",
        "35. Qe4 Nd3": "There it comes!",
        "36. Reg1 Bc5": "Kosteniuk is falling behind on the clock which showed only 10 seconds left, and Anand might have pinned his hopes on the clock.",
        "37. Qh4 Bxg1 38. Rxg1 Ne5 39. Bf4 Ng6": "Another fork!",
        "40. Bh6+ Kg8 41. Qb4 Red8": "Anand resigns. A sweet win for Kosteniuk against the reigning world champion who is widely known as the best Blitz player in the world today."
    },
    "url": "https://gameknot.com/annotation.pl/world-blitz-ch-2009-moscow?gm=39350",
    "gameName": "World Blitz Ch, 2009, Moscow",
    "players": "V. Anand (2788) vs. A. Kosteniuk (2517)",
    "opening": "Queen's pawn game (E10)"
}