{
    "moves": {
        "1. c4": "Some of the comments are based on a video from agamator's chess channel on youtube:  https://www.youtube.com/watch?v=dv52uwNfFZg",
        "1... e6": "Fischer has played 1. c4 only twice before.\n",
        "2. Nf3 d5 3. d4": "This is the first time that in his career Fischer played the Queen's Gambit Declined from the White pieces.  The Russians prepared mostly for 1. e4.\n",
        "3... Nf6 4. Nc3 Be7 5. Bg5": "This is all standard theory of the QGD.\n",
        "5... O-O 6. e3 h6 7. Bh4 b6": "This is the Tartakower variation. Spassky claimed that he never lost with this variation.\n",
        "8. cxd5": "White will eventually want to attack the backward pawn on the C file.\n",
        "8... Nxd5 9. Bxe7 Qxe7 10. Nxd5 exd5 11. Rc1": "I have personally been in positions like this.  This is a well known position of the Tartakower variation.  \n\nThe small problem with 11... Bb7 is that at some point Black will play c5, and after the pawns exchange on c5, White might have a slight bit of pressure on b7 after Qb3.\n\n",
        "11... Be6 12. Qa4": "A great move because White is controlling many squares on the Queenside.\n",
        "12... c5": "This is a well known move.\n",
        "13. Qa3": "White pins the c5 pawn and threatens to win it.\n",
        "13... Rc8 14. Bb5": "This is an interesting move because it controls the squares of Black's knight.  The idea is that 14... Nd7 15. Bxd7 Qxd7 (15... Bxd7 16. O-O and the game is equal.) 16. dxc5 bxc5 17. Rxc5, but all this is a bluff since White is losing after 17... Rxc5 18. Qxc5 Rc8.\n\nNow Black would be slightly better after 14... Qb7.\n",
        "14... a6": "This is is not a threat immediately but will be later.\n\n\n\n",
        "15. dxc5": "If 15... Rxc5 16. O-O.",
        "15... bxc5": "\n",
        "16. O-O": "Now Black is slightly better after 16... Qa7.\n\nAlso possible is 16... Qb7 17. Ba4 Qb6.",
        "16... Ra7": "\n",
        "17. Be2": "According to Stockfish, 17... Kf8 is nearly equal.\n\n17... a5 is not different than the game. 18. Rc3 Nd7 19. Nd4 Qd8 20. Nxe6 fxe6.",
        "17... Nd7": "\n",
        "18. Nd4": "Fischer activates his knight.  White has a tiny edge.\n",
        "18... Qf8 19. Nxe6": "Fischer simplifies into a better position.\n",
        "19... fxe6": "Now not 20. Bg4 Qe7 and Black is fine.",
        "20. e4": "Fischer does an excellent job of attacking the center.  Black is okay after 20... Nf6, 20... a5, 20... dxe4 21. Rc4 Nf6 22. Rfc1, but most likely the best move is 20... c4 21. Qh3.  Now Botvinnik mentions. 21... Qf7  (21... Nc5 is better.) 22. Bg4 (22. Bh5 Qe7 is no problem for Black.) 22... Re8 ( 22... Rc6 is better.) 23. exd5 exd5 24. Rfe1 (24. Rce1 is better for tactical reasons.  24... Ne5 25. Bh5 g6 26. Qg3 Kh7 (26... Rae7 27. Rxe5 Rxe5 28. Bxg6) 27. Rxe5) 24... Rxe1+ ( but Black can play 24... Ne5 25. Bh5 g6 26. Qg3 Rae7 27. Red1 (27. Rxe5 Rxe5 with a mate threat.)) 25. Rxe1 Nf8(Not 25... Kf8?? 26. Qa3+ Kg8 27. Be6.)   Botvinnik thinks that Black is okay here, but in fact White is winning.  26. Qc3 or 26. Qe3.",
        "20... d4": "This is where Spassky goes wrong. White suddenly has a winning advantage because Bc4 is coming.\n\n",
        "21. f4": "Fischer is amazingly accurate. He prevents Ne5.\n",
        "21... Qe7": "Threatening to play e5.\n",
        "22. e5": "White locks the Black e6 pawn down, and controls the squares that the knight can move to.\n\n22. Qh3 is stronger because of the pin aiming toward c8.  If 22... e5 23. fxe5 Qxe5 24. Bc4+ Kh7 25. Rf5 (Or 25. Rf7) 25... Qd6 26. Rcf1 or 26. Rf7 and White is winning.\n",
        "22... Rb8 23. Bc4": "If 23... Nf8 24. f5. Then if 24... Kh8 25. f6.",
        "23... Kh8": "\n",
        "24. Qh3": "If 24... Rxb2 25. Bxe6 White will have a strong passed pawn.",
        "24... Nf8": "\n",
        "25. b3 a5 26. f5": "It is time to break through.\n",
        "26... exf5 27. Rxf5 Nh7": "Now 28. Rf7 loses to Ng5 29. Rxe7 Nxh3+ 30. gxh3 Rxe7.",
        "28. Rcf1": "\n",
        "28... Qd8": "This creates the possibility of d3 later.\n\n28... a4 is slightly better.\n",
        "29. Qg3": "Planning to go to e5 later.\n\nIf 29... Ng5 30. h4 Nh7 31. Rf7 Rxf7 32. Rxf7 Qg8 33. Re7 (33. e6 (threatening Rxg7 and Qxb8) 33... Ra8 34. e7 Re8 35. Rf1).",
        "29... Re7": "Spassky tries to activate his pieces.\n\n",
        "30. h4": "Very accurate.\n",
        "30... Rbb7 31. e6": "If 31... Nf6 32. Rxf6 gxf6 33. Rxf6 Rh7 34. Qe5 Qg8 35. e7.",
        "31... Rbc7": "Protects c5.\n\n\n",
        "32. Qe5": "This is a wonderful centralizing move.\n\nIf 32... d3 33. R5f3 (33. R1f3 d2 34. Rd3 fails to Qxd3) 33... d2 34. Rd3.\n",
        "32... Qe8 33. a4": "Fischer bides his time.  Black has no good moves.\n\nSlightly better is 33. Qe4 Rc6 34. Bd3 Nf6 35. Rxf6 gxf6 36. Rxf6 Kg8 37. Bc4 Kh8 38. Rxh6+ Kg8 39. Qg4+ Rg7 40. e7+ Qf7 41. e8=Q#.\n",
        "33... Qd8 34. Rf1f2 Qe8 35. Rf2f3 Qd8 36. Bd3": "Because the queen is coming to e4 aiming for h7.\n",
        "36... Qe8 37. Qe4": "Finally. Black has no good choices.",
        "37... Nf6 38. Rf5xf6 gxf6 39. Rxf6 Kg8": "Now many moves are winning.\n",
        "40. Bc4": "The most accurate with the threat of Rf7.\n\nIf 40... Ra7 41. Rf7 Rxf7 42. exf7+ Qxf7 43. Qg6+.",
        "40... Kh8": "\n",
        "41. Qf4": "Now nothing is left. Black resigns.  If 41... Rh7 42. Rf8+.   If 41... Rc8 42. Rxh6+ Rh7 43. Qf6+ Kg8 44. e7+ Qf7 45. Rg6+ (45. Bxf7+ Rxf7 46. Rh8#) 45... Rg7 46. Qxg7#.\n\nPlay might continue ...\n",
        "41... Qg8": "White could try 42. Rxh6+ Rh7 43. Qf6+ Rcg7 44. e7 Rxh6 45. Qxh6+ Rh7 46. Qf6+ Rg7 47. Bxg8 Kxg8 48. e8=Q+ Kh7 49. Qh5+ (49. Qf5+) or he could play ...\n\n",
        "42. Rf8 Re8 43. Qf6+ Rg7 44. e7 Rc8 45. Bxg8 Rc6 46. Be6+ Kh7 47. Bf5+ Rg6 48. Bxg6#": ""
    },
    "url": "https://gameknot.com/annotation.pl/world-championship-28th-reykjavik?gm=68653",
    "gameName": "World Championship 28th, Reykjavik",
    "players": "Fischer, Robert James (2785) vs. Spassky, Boris V (2660)",
    "opening": "English opening (A13), Agincourt variation"
}