{
    "moves": {
        "1. c4 e5": "We once again have the English!",
        "2. Nc3 Nf6 3. Nf3 Nc6 4. g3 d5 5. cxd5 Nxd5 6. Bg2 Bc5 7. O-O O-O 8. d3 Re8": "So far following Game 4 of the match",
        "9. Bg5": "the first change from Game 4 where Carlsen played 9. Bd2. This is already practically new territory (except for one game by some lower rated players according to my database) 9... Nxc3 10. bxc3 f6 11. Bc1.",
        "9... Nxc3 10. bxc3 f6 11. Bc1 Be6": "Nothing seems to surprise Caruana so far as he is moving at lightning speed. ⚡️ This has a strong psychological impact on his opponent as he is saying: \"Is this all you got? You can't surprise me!\" 😂♟️",
        "12. Bb2": "Interesting retreat with the Bishop. There are 2 reasons for this: keep the d2 square open for a potential Knight-maneuver with Nf3-d2-c4 and try to employ the Bishop via a3 after advancing the pawn to a4. It also gives support to the d4 square eventually.",
        "12... Bb6 13. d4": "So far this home prep by Carlsen has a better psychological impact than on the actual board. He has not much in the game but this keeps away from Caruana's home prep. So a moral victory of sort. Objectively speaking, Carlsen has nothing. But Caruana is out of home prep and he is thinking for the first time so far in this game. That is what Carlsen is banking on. He believes he is better than Caruana in the middlegame.\nAs for the Women's World Championship, it looks like Lagno is on her way to be the next Women's World Champion! She held a very difficult position today. All she needs is a draw tomorrow with white to win the match!\n​After 13. d4 Caruana thought for a long time before finally playing ",
        "13... Bd5": "long enough for the British to have afternoon tea.\nSurprisingly, Carlsen immediately responded with",
        "14. Qc2": "Now Caruana is thinking again.\nAt high level chess, nerves, self confidence & mental toughness play major roles. This is why sometimes you see players in the 2600's losing to players in the 2800's in \"objectively drawn\" positions, ones where they can draw weaker/same strength players with their eyes closed.",
        "14... exd4 15. cxd4 Be4 16. Qb3+ Bd5 17. Qd1": "This is an equal but unbalanced position. So let's see what Carlsen can do. I do not expect much though.",
        "17... Bxf3": "? What is this about? I do not get it? Is this a real move or broadcast error? This move does not smell good.\nCarlsen now has 2 good replies: 18. Qb3+ and 18. Bxf3 Both moves will potentially lead to an edge in opposite color Bishop endgame. 17...Bxf3? does not cause an immediate loss. However, it makes his equal position more complicated for no reason. This is kind of inexplicable for me. 🤔",
        "18. Qb3+ Kh8 19. Bxf3 Nxd4 20. Bxd4 Qxd4 21. e3": "Equal materials and Bishop opposite colors. But the a and c pawns are isolated. White is slightly better and can play on forever without risks. Black believes that he can hold.",
        "21... Qe5 22. Bxb7 Rad8": "What Carlsen will play for is the lack of mobility of the b6 Bishop and c7 pawn. But it is a long long way from \"winning\". White can only continue to grind hoping for more inaccuracies.",
        "23. Rad1": "I am curious to know what Caruana was thinking taking on f3. Why? While he can probably hold, why complicate things and give Carlsen any confident for the final 4 games? Carlsen has the draw odd with the fast time control playoff. Why give him a mental boost?",
        "23... Qe7": "Now that Black Bishop is stuck on b6, white can try to weaken the Kingside with h4-h5-h6",
        "24. h4 g6": "Stopping h5. It is not a straight forward position. But Carlsen can basically do whatever he wants while Caruana has to sit back and hold. Much more comfortable to play white, and easier on the clock as well.",
        "25. h5": "Carlsen keeps on moving forward. This is vintage Carlsen. While it may not give a \"win\", he keeps on compounding pressure on his opponent hoping that eventually someone will \"crack\" under pressure! Their styles are so different.",
        "25... gxh5 26. Qc4": "There is no really \"concrete\" way for Carlsen to win. All he is trying to do is create more \"weaknesses\" to make it difficult for Caruana to defend everything. It is like how to defend the entire Great Wall of China? Which part? Where?",
        "26... f5 27. Bf3": "All of Caruana's pawns are isolated pawns. So in spite of Black being a pawn up, it is White who is trying to win by trying to exploit the weaknesses. Carlsen may not succeed but his ideas are quite clear and easy to understand. 😂 Now for Caruana, he has to play aggressively and fight back. He cannot just sit back and defend. If all pieces are off the board except for the Bishops and pawns, it is 100% draw. So he can trade Rooks or give back the pawn with h4 but open up the g file.",
        "27... h4": "This is the correct plan. He has to punch back and not allow himself to become a piñata. I think Carlsen's h5 was a bit too premature. He could have improved his position and not much Caruana could do to really improve his position. So no need to rush h5 by allowing black to play gxh5 then h4. Just my opinion. He could have been a bit more patient.",
        "28. Rxd8 Rxd8": "And now Carlsen must take the h pawn with gxh4. Otherwise, he will be worse.",
        "29. gxh4": "The correct recapture. The position is equal. But as you can see, it is slightly easier for humans to play on the White side as Black has weaker pawns and White King is a little safer. But still should be a draw unless someone makes a colossal mistake.",
        "29... Rg8+ 30. Kh1 Qf6": "Caruana tries to seal the weak diagonal where his King is hiding in. The position is equal. Carlsen will push but it will be a draw.\n​Carlsen is a very well rounded athlete. He likes to play soccer, basketball, tennis, ping pong, and sometimes even ... chess :)",
        "31. Qf4 Bc5 32. Rg1 Rxg1+ 33. Kxg1 Bd6 34. Qa4": "Seeing that he gets nothing from the position, Carlsen traded Rooks to change the dynamics of the game. Now he does not have to worry about being mated as the King can always escape the Black Queen. This gives him time to try to exploit Black's weaknesses.",
        "34... f4 35. Qxa7 fxe3 36. Qxe3": "More simplification. But Carlsen is still slightly better because of the Black King safety issue. Should be a draw.",
        "36... Qxh4 37. a4": "And if 37... Qxa4 38. Qc3+ Kg8 39. Bd5+ Kf8 40. Qh8+ Ke7 41. Qxh7+ Kf6 Completely equal.",
        "37... Qf6 38. Bd1": "Still should end in a draw. Caruana was afraid of some potential complication with 27...Qxa4 so he chose the safe way.",
        "38... Qe5 39. Qxe5+ Bxe5 40. a5 Kg7 41. a6 Bd4 42. Kg2 Kf6 43. f4 Bb6 44. Kf3 h6 45. Ke4 Ba7 46. Bg4": "What Carlsen hopes for is for Caruana to think this will be an easy piece of cake draw so he becomes careless.",
        "46... Bg1 47. Kd5 Bb6 48. Kc6 Be3": "What Caruana is banking on is even if he has to sacrifice his Bishop for the a pawn, he c and h pawn will march, and the White Bishop will have to try to defend them and he can simply take the f pawn = draw.",
        "49. Kb7 Bb6 50. Bh3 Be3 51. Kc6 Bb6 52. Kd5 Ba7 53. Ke4 Bb6 54. Bf1 Ke6 55. Bc4+ Kf6 56. Bd3 Ke6": "Now the advantage is back on Caruana's side. He will have 2 white games in the final 3. The World Championship title is in his own hands!"
    },
    "url": "https://gameknot.com/annotation.pl/world-chess-championship-game-9-live?gm=65731",
    "gameName": "\"World Chess Championship Game 9 LIVE!\"",
    "players": "Carlsen  vs. Caruana ",
    "opening": "English (A22), Bellon gambit"
}