{
    "moves": {
        "1. d4": "This game is interesting, as I won a pawn and tried to hang on to it. I think I went wrong soon after and lost the exchange and from then on I had a lost position. After the game my opponent said that I was wrong to try to hang on to the extra pawn, but I suspect it is not really that bad. I would very much appreciate your views dear reader!",
        "1... d5": "So he replies in kind",
        "2. c4": "I continue with the Queen's Gambit",
        "2... e6": "and he declines it in the most popular way.",
        "3. Nc3": "I continue with the usual.",
        "3... c5": "and he continues with the Tarrasch Defence. http://en.wikipedia.org/wiki/Tarrasch_Defense \"With his third move, Black makes an aggressive bid for central space. After White plays cxd5 and dxc5, Black will be left with an isolated pawn on d5. Such a pawn may be weak, since it can no longer be defended by other pawns; but it grants Black a foothold in the center, and Black's bishops will have unobstructed lines for development.\"",
        "4. cxd5": "I play the recommended. ",
        "4... exd5": "As well as this recapture, Black has the interesting Hennig-Schara gambit. 4. cxd5 cxd4 5. Qxd4 Nc6 6. Qd1 exd5 7. Qxd5 Bd7 is one line. White should be ok, but I was slightly worried that he would play this and know it better than me!",
        "5. Nf3": "So I continue with the usual development.",
        "5... Nc6": "And so does he.",
        "6. g3": "This is all main line. White intends on exchanging on c5 and having the Bg2 bearing down on the isolated d pawn on d5.",
        "6... Nf6": "Black ignores the chance to play The Swedish Variation (also called the Folkestone Variation) is a sharp line beginning 6... c4. Black now has a four to three queenside pawn majority, and will try to expand with ...b5, with White aiming for a central break with e4. The line is considered somewhat dubious, and is rarely seen nowadays.\r\n\r\nThe Swedish Variation has ECO code D33.",
        "7. Bg2": "and White carries on with developing.",
        "7... Be7": "As does black.",
        "8. dxc5": "I thought it was time to take on c5, as he has moved his bishop from f8. In a similar black playing the standard defence to the Queens Gambit declines waits before white moves his Bf1 before exchanging on c4. I also prevent a transposition to the Swedish variation. I was interested to see that in fact both 0-0 and Bg5 are more popular at this point.",
        "8... Bxc5": "So he recaptures.",
        "9. Bg5": "I decided to increase the pressure on the d5 pawn.",
        "9... d4": "Which he relieves by advancing",
        "10. Ne4": "I attack his Bc5 and threaten to take on f6",
        "10... Be7": "so he defends.",
        "11. Nxf6+": "I take",
        "11... Bxf6": "He takes back",
        "12. Bxf6": "I take again",
        "12... Qxf6": "He takes back again",
        "13. Qd2": "I cover the black squares with my queen.",
        "13... O-O": "He castles",
        "14. O-O": "So did I",
        "14... Bg4": "and this is the logical square to develop his bishop. Now this position has been seen before. I found out later that the Gameknot game chessterkh67 (1802) vs. jraul (1706) continued with 15. Rac1 and white won in 34. According to the Gameknot opening databases, h6 has been played 6 times with 3 white wins, 3 black wins, Rfd1 has been played with 1 white win, one black win, and 15. Rac1 led to a win for black in Ancival Lucien (2068) vs. Guillaumat Jean… (2057). I find another move. See if you can find what I played?",
        "15. b4": "This seemed logical to me. Boot the knight from c6 by continuing with b5 and then take on d4. What do you think of this move dear reader? Is this where I first went wrong?",
        "15... Rfe8": "so he delevops his Rf8 to a logical square.",
        "16. b5": "I carry on with my plan.",
        "16... Bxf3": "Rather than just lose the d4 pawn, he plays this.",
        "17. Bxf3": "I recapture.",
        "17... Ne5": "He hits my bishop.",
        "18. Bxb7": "So I take the b7 pawn instead.",
        "18... Rab8": "and he has to move his rook. Now, this is the critical position. After the game my opponent criticized my next move, Ba6 as it meant my bishop was out of the game. At the time I didn't want to just give up my extra pawn. Also although I knew the bishop was a bit out of the action on a6 at least it protects the pawn on b5, and prevents black from contesting the c file with Rc8. I would be very interested to know your thoughts dear reader! I would also love to know what decent chess computers would play for white in the position?",
        "19. Ba6": "So I retreat my bishop to a6. Naturally Bc6 loses a pawn to Nxc6 followed by Qxc6 and any other retreat just allows Rxb5.",
        "19... d3": "So, a pawn down, he decides to try and mix it a bit. Now if I play exd3 he has Rbd8 and he wins the pawn back on d3. ",
        "20. f4": "This is an aggressive reply, if knight moves then I can take on d3. Maybe it is a mistake as it weakens my king position?",
        "20... Qb6+": "He throws in a check",
        "21. Kh1": "I was quite happy with this position. His queen has no checks on the long white diagonal.",
        "21... dxe2": "So to avoid the lose of another pawn he has to exchange now.",
        "22. Qxe2": "and I recapture.",
        "22... Nc6": "This move surprised me. I thought he may be aiming for Nb4 and exchanging on a6",
        "23. Qc4": "so I put a stop to that",
        "23... Nd4": "He centralises his knight.",
        "24. Rfe1": "I contest the open e file.",
        "24... h6": "He wisely gives his king a square. For instance I had been dreaming of variations such as 24....Rbd8 25. Rxe8 Rxe8 26. Rd1 Nf3 27. Qc6 threating Qxe8 mate and if 27.....Qxc6 28. bxc6 he can't play Re2(threatening mate on h2) as I have Rd8 mate!",
        "25. Rad1": "Now I think this is the losing mistake. Perhaps Kg2 or Qc3 or d3 prevents the combination that follows. What do you think dear reader?",
        "25... Rxe1+": "This is more or less forced, and I was still quite happy, I thought he was giving up control of the e file.",
        "26. Rxe1": "so I recapture.",
        "26... Nf3": "But this is the problem. If my rook advances, he has Qg1 mate, or if it moves to any square other than f1 he has Qf2 and Qxh2 mate, so f1 it has to be.",
        "27. Rf1": "and it attacks the knight, but......",
        "27... Nd2": "He has this fork, and now black is winning. Although a pawn is sometimes enough compensation for being bishop v rook down, this is not one of those positions!",
        "28. Qd3": "so queen moves.",
        "28... Nxf1": "Knight takes.",
        "29. Qxf1": "queen takes back",
        "29... Qe3": "his queen centralises",
        "30. Qg1": "now, normally I wouldn't try and exchange queens when materially down. \"Exchange pawns not pieces when materially down, exchange pieces not pawns when materially up\" is the usual advice. However this is not one of those positions. White is in grave danger of being mated by black's queen and rook, white the queenless endgame is probably just about ok for white.",
        "30... Qe4+": "So for those reasons he does not exchange",
        "31. Qg2": "Forced!",
        "31... Qb1+": "Check again!",
        "32. Qg1": "forced again",
        "32... Qxa2": "He takes a pawn.",
        "33. Qxa7": "I take a pawn.",
        "33... Re8": "He threatens a mate!",
        "34. Qg1": "I defend",
        "34... Qa5": "He misses a mate in 2! 34....Qd5 would have mated.",
        "35. Kg2": "So I struggle on. ",
        "35... Qd2+ 36. Kh3 Qd7+ 37. Kg2 Re2+ 38. Kf3 Ra2 39. Qb1 Qd5+ 40. Ke3 Ra3+ 41. Kf2 Qf3+ 42. Kg1 Rd3 43. b6 Rd1+ 44. Qxd1 Qxd1+ 45. Kg2 Qd5+ 46. Kh3": "and I resigned."
    },
    "url": "https://gameknot.com/annotation.pl/wrexham-1-vpen-y-ffordd-1?gm=40645",
    "gameName": "Wrexham 1 vPen-y-Ffordd 1",
    "players": "Charles Higgie (BCF158) vs. Charles F Morris (BCF186)",
    "opening": "QGD (D34), Tarrasch, Prague variation, 7...Be7"
}