{
    "moves": {
        "1. d4 Nf6 2. c4 e6 3. Nc3 c5 4. d5 exd5 5. cxd5 d6": "This is the starting point of all the games in this thematic Mini-Tournament.  Black looks for pawn play on the Q-side, coupled with action down the e-file, or along the long dark diagonal.  White's usual plan is to storm through the centre and K-side.  The battles are apt to be sharp, and bloody.",
        "6. e4": "One of several options available to White, this is the most straightforward.",
        "6... g6": "Preparing to bring the Bishop to g7, rather than develop on e7.  Black is especially interested in controlling e5 and d4, but the squares further on are also kept under close observation.",
        "7. Bd3": "This move became popular in the 1960s after White victories in the games Ojanen-Keres and Penrose-Tal.  GM Mischa Tal was World Champion when he lost his game to the English master Jonathan Penrose.",
        "7... Bg7 8. Nge2": "Continuing in the manner of Master Penrose...",
        "8... O-O 9. h3": "The games quoted above went 9.0-0, but this move seems a very good alternative.  Sooner or later White will want to play f2-f4, and he doesn't want to be outflanked by a knight or a bishop coming in at g4.",
        "9... Re8": "Often a desirable placement of Black's King's Rook in the Benoni.",
        "10. O-O c4": "(!?) Unexpected.  Black wants the e-pawn and offers the pawn to divert the bishop's attention from it.  ",
        "11. Bc2": "White keeps guard of the e-pawn.",
        "11... b5": "Another diversion?  ",
        "12. Nxb5": "Why did White accept this pawn and not the other in exchange for the e-pawn?  For one thing, 12.a3 - to hold back the b-pawn - would have been met by ...a5, when suddenly Black has got his thematic pawn roller well under way.  The second reason is that now Black's Queen side pawns are broken up and weakened.  Black will have to hope his centre operations are worth these concessions.  ",
        "12... Nxe4 13. Bxe4 Rxe4": "Indications are that Black got some value for 'sacrificing' his Queen-side majority.",
        "14. Nec3": "Planning to challenge Black on the e-file.  Ordinarily one might choose to move the other knight to threaten the rook, but that would have left the e2-knight still to move, after Rf1-e1.  Besides, the b5-Knight is having an inhibilting effect on Black's Q-side, it seemed to me (pressure on d6 and c7, for starters, but also the possibility of Nb5-a3xc4).",
        "14... Rh4": "Interesting!  What might this portend?  Of course White has to consider the possibility of ...Bxh3 and a K-side attack by Black.  ",
        "15. Re1": "Seizing the e-file.  It is often said that the best counter to a flank action is a counter-action in the centre.  But Black hadn't yet declared himself...",
        "15... Bxh3": "(!?) Now he does!  Considering that White has just the one piece on the K-side - the rook at e1 - this at first sight looks promising.  But what follows is the first forcing line of the game.  White had reason to believe he could survive this attack.",
        "16. gxh3 Rxh3 17. Qg4": "Black has two pawns for the piece, but the problem he faces is that White controls most of the K-side. If Black can establish his Bishop safely at e5, maybe he could achieve something of interest, but first he has to find a decent square for his rook.",
        "17... Rh4": "Hoping to gain a little time...",
        "18. Qg3": "This at first seems to play into Black's hands.  Now will come ...Be5 attacking this Queen.  Then what?  We'll see... White did have an alternative in 18.Re8ch Qxe8  19.Qxh4 but the game looked fairly even after that.",
        "18... Be5": "Black looks to be making progress...",
        "19. Rxe5": "(!) This was the hole in Black's plan.  The sequel is forced, whereby White emerges with a piece extra.",
        "19... dxe5 20. Bg5": "The counterblow.  Black does well to contain the damage...",
        "20... f6": "Ensuring White will retain just the one extra piece",
        "21. Bxh4 g5 22. Bxg5": "Desperado.  The Bishop is a goner, so White extracts as much value for it as he can.",
        "22... fxg5 23. Qxe5": "White emerges from the battle with an extra knight.  What's worse for Black it that his entire attacking corps has been wiped out.  The rest of his pieces have yet to move.  Now I did not see this far ahead when Black played 15...Bxh3, but I did see as far as 20.Bg5, and that was enough to satisfy me that Black's attack would fail.",
        "23... Nd7": "Without criticizing this move - what can you do a piece short when you really have to start again (or give up altogether)? - but this led to another forcing line that was going to cost Black all his pieces.",
        "24. Qe6+ Kf8": "It is doubtful that the alternative K moves would have had a happier outcome.",
        "25. Nd6": "Threatens mate.  There is but one reasonable defence that does not cost at least a piece.",
        "25... Qe7 26. Re1": "Bring up the reserves at just the right moment.  Under enormous pressure, considering the scanty material, how can Black avoid loss of his knight at least?",
        "26... Qxe6": "There was absolutely no choice.  To stay on the board, the Queen had to stay in touch with the knight and with the f7 square.  The only possible location would have been at g7.  But the game would have then ended in two moves: 26...Qg7  27.Qe8ch Rxe8  28.Rxe8#.  That would have been rather a nice finish.",
        "27. dxe6": "Much, much better than taking with the rook.  Now the pawn will barge his way to the Queening square, supported by pieces.  This has all the look of a Crusaders' scrum driving for a pushover try...",
        "27... Nf6": "Essential to guard the e8-square.",
        "28. e7+ Kg8": "Shoved aside, the King can not contribute to defending e8.  ...Kg7 would have made no difference.",
        "29. e8=Q+": "Black has to take with the knight...",
        "29... Nxe8 30. Rxe8+": "And now Black can do nothing about the exchange of rooks.",
        "30... Rxe8 31. Nxe8": "White emerges two knights ahead, as the Black c-pawn will certainly fall.  This whole 8-move sequence from move 24 has been forced: Black could do absolutely nothing about it, except find a quicker way to lose.  ",
        "31... Kf7 32. Nd6+ Ke6 33. Nxc4": "The thing about these knights is that for the remainder of the game they do not depart from where they now stand.  Together, they form a barrier along most of the e- and d-files, the only approach being via d7 onto the c-file.  Guess what White will play next.  There is but one move to prevent it, but that will simply incur worse.",
        "33... h5": "Black pins his hope where he is strongest - the K-side.  Of course, 33...a5 was out of the question on account of 34,Nxa5.  Now White gets in his planned advance...",
        "34. b4": "Sealing of the c-file approach to the Knights.  Now White can concentrate on driving home one of the pawns on the Q-side.",
        "34... g4 35. b5": "Keeping back Black's a-pawn.",
        "35... h4 36. a4 Kf5": "Committing himself to attack rather than defence.  36...g3 simply lost both K-side pawns; 36...h3 would have been met by 37.Kh2 then 38.Kg3 leaving Black with no more attack.",
        "37. a5 Kf4 38. b6 axb6 39. axb6 h3 40. b7": "The distance between the Black pawns and their queening squares is just too great",
        "40... h2+ 41. Kxh2 Kf3 42. b8=Q": "Black has just two legal moves available.  It is mate in two...",
        "42... g3+": "... or one...",
        "43. Qxg3#": "[1-0]  I have found that narrow forcing lines of the type encountered in this game don't crop up very often, not in so much depth at any rate.  Given the scant opportunty for the defender to diverge, one can 'see' a very long way along them. They're great if you are doing the forcing; bally dismal when it is you being driven under the lash.  That ptitroque had the fortitude after such treatment to play the game down to mate is to be commended.  "
    },
    "url": "https://gameknot.com/annotation.pl/wtw-modern-benoni-mt-viii-forcing-lines?gm=50385",
    "gameName": "WtW Modern Benoni MT VIII:  Forcing Lines",
    "players": "ionadowman (2101) vs. ptitroque (1709)",
    "opening": "Nimzo-Indian defence (E20)"
}