{
    "moves": {
        "1. d4 Nf6 2. c4 e6 3. Nc3 c5 4. d5 exd5 5. cxd5 d6 6. e4 g6 7. f4 Bg7 8. Bb5+ Nfd7": "The best move is supposed to be 8. Nbd7",
        "9. a4": "To prevent a further b5",
        "9... Na6": "Lancelot enters in the battle",
        "10. Nf3 O-O 11. O-O Nb4": "The brave Lancelot stands in the middle of the opposite army",
        "12. Re1": "Dangerous because of Bd4+",
        "12... a6": "First getting rid of the annoying LSB. The footman challenges the bishop",
        "13. Bf1": "Probably to keep the e and d files free for the heavy pièces.",
        "13... Re8": "The most logical move.",
        "14. h3": "Safe move to avoid Bg4",
        "14... Nf6": "Perceval must get ready to prepare 15. Nh5",
        "15. Bc4": "The LSB has moved twice, unnecessarily",
        "15... Nh5": "Perceval is in ambush for further action. ",
        "16. Na2": "Lancelot is menaced",
        "16... Qa5": "Dame Guenièvre, worried, comes to support her faithfull knight.",
        "17. Nxb4": "which meet his doom.",
        "17... Qxb4": "but Dame Guenièvre revenges her true lover.",
        "18. Qb3": "Big mistake.",
        "18... Bd4+": "Long hesitation, it seemed to be a clue move. I do not like to exchange the DSB in benoni because it's a very powerfull piece and I hoped it was worth it. If 19. Nxd4 Qxe1+",
        "19. Kh2": "So that king Henry wisely hides",
        "19... Qxb3": "Lancelot is dead, Dame Guenièvre won't survive.",
        "20. Bxb3 Bf2": "To take the f pawn.",
        "21. Rf1": "Mistake, it doesn't save the f pawn and the e pawn is now unprotected",
        "21... Bg3+": "Now black can take the e and f pawn.",
        "22. Kg1 Rxe4": "e pawn first",
        "23. Nh2 Bxf4": "Now f pawn",
        "24. Bxf4": "trading",
        "24... Nxf4": "Perceval enters in the melee",
        "25. Bd1": "At first sight I found this move strange for the 2 rooks are not joined anylonger and there is not direct menace. In fact there are a bunch of traps for black ; If 25. ...Ne2+ 26. Kf2 and the knight is doomed. If 25. ... Nd5 26. Re5 Rxe5 27. Rxe5 Nc7 28. Re8. I studied  several other sequences in which black always loses. Poor Perceval, he won't accomplish anything great this move.",
        "25... Rb4": "Menacing b2 and protecting b7, so that the LSB can move easily to defend the center.",
        "26. b3 Nxd5": "One more pawn.",
        "27. Nf3": "Bringing out the reserve",
        "27... Be6": "defending the center and the f pawn.",
        "28. Re1": "to prepare 29. Ng5",
        "28... Nc7": "Perceval doesn't like to drawback but the orders are clear : defend the bishop and menace 29. ... Bxb3.\nWhite could have tried to attack black's king but it seems Joanne prefers to defend. Now back's plan is to get rid of white's a and b pawns, if necessary by trading but, in this case, without having his own pawns isolated.",
        "29. Nd2": "Preventing 29. ... Bxb3",
        "29... Rd4": "attacking one defender of the b pawn.",
        "30. Nf3": "escaping",
        "30... Rd3": "Black carries on his plan",
        "31. Rb1 b5": "A common benoni move... Usually done earlier in the game, but \"better late than never\"",
        "32. axb5": "Trading",
        "32... axb5": "\"Well done, brave footmen. Mission half completed\". Now, the next task : capture white's b pawn, if possible without damage (for us).",
        "33. b4 c4": "Now black's plan is to bring the c and d pawn to the second line to oblige white to exchange pieces against pawns.",
        "34. Be2 Rda3 35. Nd4 d5 36. Kf1 Ra3a2": "Fruitless move Joanne is defending very well and despite my material advance, I have a lot of trouble to gain terrain.",
        "37. Red1": "Still defending",
        "37... Rb8": "To prepare 38. ... Na6 39. ... Ra4 and 40. ... Nxb4",
        "38. Rba1": "White sees the combo abd prevent it.",
        "38... Ra4": "So that I try something else : if 39. Rxa4 bxa4 and I have a passed pawn.",
        "39. Rdb1": "White again has a proper answer.",
        "39... Bf5": "?! So that I make another plan. At least, the move will probably surprise my opponent. It considerably weakens black's kingside but I need to eliminate the white knight and play d4 so that Perceval can be posted on d5 and it is the price to pay. I suppose that I'll be strong enough on the right center to compensate this drawback. I can bring a rook on  the open e file in case of need.",
        "40. Nxf5": "trading",
        "40... gxf5": "The ennoying knight is no more... Perceval will be free for new adventures. His horse is impatient.\nThe f pawn is lonesome but well spotted for it controls e4 and g4, 2 important squares... An heroïc footman. The white bishop will probably capture it but it will take 2 moves.",
        "41. Bd1": "Menacing the rook",
        "41... Raa8": "If 41. ... Rxa1 42. Rxa1 menacing 43. Ra7 Ne6 44. Bh5 menacing f7 etc. So that retreat seemed better.",
        "42. Bc2": "Of course...",
        "42... d4": "Finally advancing a pawn",
        "43. Bxf5": "sacrifice...",
        "43... d3": "... in exchange of another step.",
        "44. Be4": "I overlooked this move",
        "44... Ra4": "Back to a previous menace : preparing 45. ... Nd5 to take the pawn",
        "45. Bc6": "preventing 46. ... Nd5",
        "45... Rb6": "Threatening the bishop and enabling the rook to put the white king in check",
        "46. Rxa4 bxa4": "No other  choice",
        "47. Bxa4": "Mistake but white has little else to do.",
        "47... Nd5": "\"Now, my brave Perceval ! You've been home for a long time, just watching around. It's time you go to battle\" \"Aye Aye Sir\" answers Perceval to his king and he goes to d5 from where he can ride whether on b4, directly attacking the white footman or on c3, to menace both rook and bishop or on e3+. The brave knight rides for the decisive charge for which black has sacrificed two poor footmen and his king safety.",
        "48. Bd7": "Only move to free the bishop",
        "48... c3": "Advancing manoeuvers",
        "49. Bg4": "defending d1",
        "49... c2": "Only one more step and the little footman will be general",
        "50. Rc1": "But there is still a mighty opponent on the road",
        "50... Rxb4": "preparing 51. ... Rb1",
        "51. Ke1 Rb1 52. Kd2": "Only move",
        "52... Rxc1": "trading",
        "53. Kxc1": "\"Perceval, go for the winning charge !\"",
        "53... Nb4 54. Bf5": "In case if black makes a mistake",
        "54... Na2+": "Perceval the brave menaces the white king wh has to leave the c1 square. 54. ... c1 is unavoidable by white so that Joanne submits here. "
    },
    "url": "https://gameknot.com/annotation.pl/wtw-modern-benoni-mini-tournament-viii?gm=51149",
    "gameName": "WtW Modern Benoni mini-tournament VIII",
    "players": "jstevens1 (1836) vs. ptitroque (1748)",
    "opening": "Nimzo-Indian defence (E20)"
}