{
    "moves": {
        "1. c4": "Hi all! I'm bringing you a rather tense (in my opinion, anyway) positional game. This type of play is not my strong suit--but fear not, we reach some tactical lines later on. I kick it off with the Engligh Opening. Enjoy!\n",
        "1... Nf6 2. g3 e6": "Black announces his intention to compete with White for control of d5.\n",
        "3. Nf3 d5 4. Bg2": "Of course Black likely won't play 4...dxc4, as doing so would give up a large portion of his center control.\n",
        "4... Be7 5. b3 O-O 6. Bb2 Nbd7 7. O-O c6 8. d3": "Similar positions on both sides, but there are a couple of important differences. The pawn chains restrict both players' light-squared Bishops, but White's has a little more freedom being outside the chain. White is now focusing, for the moment, on preventing Black from playing ...e6-e5, which would free his position considerably. In the meantime, the White forces have a solid foundation to build from, but lack a concrete plan.\n",
        "8... Qc7 9. Nbd2 b6 10. Qc2 Bb7 11. e4": "Both sides are basically developed, but there are no obvious attack plans for either player. This leads me to the theme of the game: when you can't simply attack and there are no obvious threats to deal with, pick a weak piece and seek to improve it. With this move, White is trying to improve his King Rook and light-squared Bishop by taking more control of the center. This move also increases the tension on the board, staking another pawn on the restriction of Black's position and the expansion of White's.\n",
        "11... dxe4 12. dxe4 c5": "Black opens up the diagonal for his own Bishop. Personally I think 12...e5 was better, since it would prevent White from playing 13.e5 himself (not that I actually did, of course)...\n",
        "13. Rfe1": "I think now that perhaps 13.e5 was better, to cramp Black's position a little more. At the time, I didn't like the idea that 13.e5 Ng4 14.Rfe1 f6 and Black may get a good kingside attack down the f-file, but now I think it looks like White can hold, which would leave Black in an inferior endgame with an isolated e-pawn.The point of this move was of course to develop my Rook to a better square and defend the e-pawn.\n",
        "13... e5": "Probably best, I think. This does create a hole on d5, though.",
        "14. Rad1": "I'm planning some Knight maneuvers, and I want to keep the e-pawn guarded when the Nd2 moves. Now that I've activated my Queen Rook by placing it on an open center file, I want to improve my Nd2--easily my weakest piece--by redeploying it to d5 or f5.\n",
        "14... Rfd8 15. Nf1": "The Knight begins his march.\n",
        "15... Ne8 16. Ne3 f6": "I'm not so sure I like this. Black reinforces his center, but at the expense of his mobility.\n",
        "17. Nd5": "Success! Of course my brave Knight is unlikely to make it through the day, but I'll gain something else...\n",
        "17... Bxd5": "As expected.\n",
        "18. exd5": "Now I have a passed pawn where my brave Knight was: not a win condition by itself, but my positional advantages are mounting. White has more space, mobility, and the initiative.\n",
        "18... Nd6": "Black, meanwhile, is making a redeployment of his own, while blockading my new passed d-pawn. Now White has to pick something else to improve. His light-squared Bishop is currently his least useful piece, but rather than move it directly, all that is needed is to create an opportunity to use it. Right now, I was looking at the interesting fact that White's Bishop is aimed at the Black Rook.\n",
        "19. Nh4 Bf8": "Black's position is very cramped. His plan appears to be a redeployment of his Bishop to g7 or h6. As White, I was rather happy when I saw this move--to me it meant that he was likely to play ...g7-g6 if provoked the right way. That will become important shortly... for now, I need to continue to work on improving my position. Following the pattern, I pick my weakest piece and improve it.\n",
        "20. Nf5": "A much better place for a Knight than the side of the board! This does give Black an opportunity to trade down, which is usually advantageous for the player with less freedom, but that trade would also activate the White Queen...\n",
        "20... Nxf5": "Black must be careful. That Knight was performing an important function on d6. \n",
        "21. Qxf5": "Black's choice of ...f6 is looking a little more dangerous now, and he must also watch out for tactics down the long diagonal.\n",
        "21... g6": "? Remember what I said about being able to provoke this move? This is what I was thinking about. Unfortunately, this is where Black stumbles, and gives up a more concrete advantage than the space and mobility that White already has. Better here was 21...Bd6, or perhaps 21...Kh8.\n",
        "22. Qe6+ Kh8 23. d6": "With the WQ out of danger, it's time to push the powerful passed pawn, creating a double threat and winning material for White. Granted, it's pretty much a wash at the moment, since White will trade an active Bishop for a stagnant Rook, but as the endgame approaches, that advantage will become more and more evident.\n",
        "23... Qc8 24. Bxa8 Qxa8": "White now has an endgame advantage, but I have to get there intact still. Without an obvious way to proceed, it's back to the old standby: keep making small improvements; keep restricting the opponent's options.\n",
        "25. Rd5 Bg7 26. g4": "?! Frankly this is probably a mistake, but I thought it was fun. It reduces the material on the board, which is good for the player with a material advantage and is why I chose it. However, it also creates a much more significant material imbalance, which is good for the defender. Probably 26.f4 was the safer play.\n",
        "26... Nf8": "Winning the Queen! ...but at what cost?\n",
        "27. Qe7": "This is the best place to lose the Queen.\n",
        "27... Rd7": "Now she's trapped for good.\n",
        "28. g5": "White can't save his Queen, but the ensuing carnage will open up Black's castle, as long as the rest of White's pieces are in position to take advantage of it right away. This move essentially follows the theme of the rest of the game: while waiting for Black to take the Queen, White plays a move that improves his worst piece: namely, the Bb2, which is currently cut off from the BK by all those pawns.\n",
        "28... Rxe7 29. dxe7 Qe8": "Of course not 29...Ne6?? 30.Rd8+! where Black loses instantly if 30...Nxd8? 31.e8=Q+! Bf8 32.Qxf8#, and still doesn't have a fighting chance if he tries 30...Qxd8 31.exd8=Q+ Nxd8 32.gxf6 Bxf6 33.Bxe5.\n",
        "30. exf8=Q+ Qxf8": "I think 30...Bxf8 was better, even though Black will still be behind in material after gxf6 and Bxe5. The text move puts Black's Q and K lined up on the same rank...\n",
        "31. Red1": "Threatening Rd8 and an easy win.\n",
        "31... Qf7 32. Rd5d8+ Bf8": "Here begins a really intense series of pins against the Black King and Queen.\n",
        "33. Rd1d7": "Things are looking very grim for Black. I'm going to relax the annotations at this point, since there's not much Black can do anymore. While material is still even for the moment, White's positional advantages have become truly overwhelming.\n",
        "33... Qg8 34. gxf6 h5 35. Bxe5 g5 36. f7+ Qg7": "Pins! It's all over but the shouting.\n",
        "37. Rxf8+ Kh7 38. Rh8+ Kg6 39. Bxg7 Kf5 40. f8=Q+": "Not long now.\n",
        "40... Kg4 41. Kg2 Kh4 42. Qf3 g4 43. Bf6#": "Many thanks to blitzkov for this very fun and educational (for me at least) game! Comments are much appreciated, and thanks for reading!\n"
    },
    "url": "https://gameknot.com/annotation.pl/wtw-mt3-small-improvements?gm=50010",
    "gameName": "WTW MT3: Small Improvements",
    "players": "bwaa (1799) vs. blitzkov (1890)",
    "opening": "English, 1...Nf6 (Anglo-Indian defense) (A15)"
}