{
    "moves": {
        "1. e4": "So, as usual, I start off with the King's Pawn Opening.",
        "1... e5": "Because of his rating, I had expected him to respond with the Sicilian.  But, this response is fine and I am very accustomed to this, as well.  Having said that, with everything that is about to be played, this opening will transpose into the King's Knight opening followed by the Ruy Lopez.",
        "2. Nf3 Nc6 3. Bb5 a6": "Believe it or not, I thought that he would continue with development by playing 3...Nf6, and then I would also develop and bring an extra piece for protection after 4.Nc3.  But, this is a move that I kind of expected, as well.  In these types of positions, the opponent kicks the B.  I don't know why, as it doesn't post as any threats, at the moment.  But, that is irrelevant because I know how to respond and the best outpost for this move.  That's because I have dealt with this situation against Jack Stockel, so best is 4.Ba4, in this position.",
        "4. Ba4 Nf6": "At this point, he is now interested in developing, while attempting to force an exchange.  I could allow it, but I choose not to.  The reason being is that I have had bad luck with NXP, NXP.  Therefore, I will refute this and develop even further with 5.Nc3.",
        "5. Nc3 b5": "And, as I expected, he decides to reattack my B.  Now, the only outpost is 6.Bb3.",
        "6. Bb3 Be7": "So, this is where he places his B.  If I were black, I would have played, 6...Bc5 because the Master Mater adviced me to and Mr. Arboite (the assistant coach of Jack Stockel, at the time, implied to) place your B where it covers the most squares (which is also why I was taught to fianchetto them).  For me, that does not just apply for the midgame, because the recommendation from Mr. Arboite, applied during the beginning game.  However, this move is perfectly fine and it won't make a difference because Jim and I are both going to castle Kingside on our next move.",
        "7. O-O O-O 8. d4": "I remembered something that cdeburca said, but applied it here, as opposed to earlier.  In a different game, I learned that if black's pawn only advances one square on his or her first move, it's best to respond with d4.  Now, although that didn't happen, the position wound up becoming similar where both of our N's are out, pretty similar to a reversed two Knights defense.  Therefore, I decided to advance my d pawn, as it should strengthen my position.  What's more interesting is that my choice is going to lead to an exchange variation.",
        "8... exd4 9. Nxd4 Nxd4 10. Qxd4 c5": "He decides to attack my Q.  I understand that because that's what I might have played, if I were black.  The question is, however, what does this accomplish?  ",
        "11. Qe3": "?? In the meantime, this is where I decide to retreat, but according Jim, this is the losing blunder.  That's because it will lead to the Noah's Ark, which I cannot get out of.  I didn't know what this thing does, but we will find out during the end of this game.",
        "11... c4": "So he responds by attacking my B.  Unfortunately, there is no way for me to defend my piece.  I do, however, get lucky for a short while because he doesn't take it immediately, but that luck is short lived.  Sooner or later, he is going to win my LSB, and there's nothing that I can do about it.",
        "12. Bd2": "With nothing to lose, I decide to develop my last piece, so that development is complete.",
        "12... d5": "At this point, he is interested in forcing an exchange.  But, there is more to this then meets the eye.  During this phase, he will win my B for two pawns, as I implied on my last move.",
        "13. exd5 cxb3 14. axb3 b4": "After the exchange, he decides to attack my N.  But, this move does more then that.  In order to prevent the exchange of a N for a P, I have no choice but to let my d pawn go.  This means that I'm still losing something, when I'm already behind, so this gives a very strong edge.  And, he takes by attacking my Q, which means that like before, there will be no compensation for what I'm about to lose.",
        "15. Ne4 Nxd5 16. Qg3 Qb6": "I do not know why he played this.",
        "17. Bh6": "?? But, that did not bother me when it should have.  I figured that he let his guard down and underestimated.  So, I thought that he had allowed a mate in one.  In other words, I thought that mate would be inevitable after 18.Qxg7#, as it is illegal for black to take with his g pawn.  As it turns out, however, this move is actually unsound because I overlooked where black's Q was located.  Therefore, Jim will punish this because he can and will take with his Q.  Therefore, I inadvertently gave away a free piece, with this choice.  With that in mind, he has an official winning advantage.  But, I am not ready to resign yet.  ",
        "17... Qxh6 18. Rfd1": "After he takes, I attempt to punish black by kicking his N.  But, he has an easy way around it and despite being behind in development, the game is almost over for white.  And, I am almost ready to resign, but I still have some fight in me.  I feel that resignation is a little premature, in this position.",
        "18... Nf4": "!! At first, I was wondering why he played this, as opposed to something like 18...Nb6 or 18...Nc7.  As it turns out, black has an extremely good reason for this move.  And, it is extraordinarily brilliant because in a few moves he is going to threaten mate in such a way that will end the game for white, as we are about to see.",
        "19. Kh1": "At this point, I see that he is attempting to fork my Q and K with 19...Ne2.  Therefore, determined not to allow that, I respond with this.  Also feasible, however, was 19.Re1.  Unfortunately, I did not think about that possibility before playing this move.  But, I don't know if this choice or Re1 was better because they both accomplish the same thing.  And, the only problem with either move, is no matter what I do, he is still going to my fork my K and Q shortly.",
        "19... Bb7": "So, he attempts to win my e4 N by completing his development with a fianchetto.  Unfortunately for him, I am not going to allow that.  However, the game is officially lost white, at this point.  But, I am still determined to hang in there for as long as I can.",
        "20. Nd2 Bxg2+": "And, it starts with this move because he just won another pawn, and my K is now exposed.  Therefore, 21.Kg1 is forced. and that's a move that I did not want to play.  However, it is about to get a lot worse.",
        "21. Kg1 Ne2+": "This is it!!  At this point, what I was trying to prevent just became inevitable.  What was I trying to prevent?  Well, he successfully played this fork.  So, at this point, I know that my Q is gone on top of what I already.  Therefore, I resign, this time because I am going to so far behind, and there will no compensation.  BTW, I put that in my resignation.  And, my opponent said, \"Now, you learned about the Noah's Ark Trap.\""
    },
    "url": "https://gameknot.com/annotation.pl/wtw-mentoring-game?gm=51448",
    "gameName": "WTW Mentoring Game",
    "players": "jkarp (1196) vs. therealjimfriar (2216)",
    "opening": "Ruy Lopez (C77), four knights (Tarrasch) variation"
}