{
    "moves": {
        "1. e4 c6": "Going for the Caro-Kann defence (B10).",
        "2. d4 d5": "Now white has several options.. The most popular (according to GK Game DB) is 3. Nc3, which is leading to the Classical Variation. Second popular is 3. e5, the Advance Variation. Third is 3. exd5, the Exchange Variation.",
        "3. e5": "Caro-Kann (B12), advance variation. White is choosing for a lead in space.. ",
        "3... Bf5": "Caro-Kann (B12), advance, Short variation. Since white hasn't made an open c-file in black's ranks, it's safe to play 3. ... Bf5. ",
        "4. Nf3": "Good developing.. White is wanting to play Nh4 sometime, to exchange his knight for my lsb.",
        "4... e6": "\"Closing\" the pawn-formation. This is a very good set-up for the pawns; hard to break through for white ! ",
        "5. Be2": "In my opinion one of the best moves to do for white. Some players like to exchange bishops by 5. Bd3 Bxd3 6. Qxd3, but you have to keep in mind that most of black's pawns are on white squares.. So why trade the light-squared-bishop ?? He can be useful in the endgame ! ",
        "5... Nd7": "Giving some support to c5, when it's time to advance that pawn.. Also, an idea for white is to play c4 sometime. So we have to be cautious on the queenside !",
        "6. O-O": "Safety first ! After doing this, white is almost ready to attack.. ",
        "6... Ne7": "Also 6. ... h6 was an option. But I left the options open: 7. Nh4 Bg6 8. Nxg6 Nxg6 and no problems at all. And if needed, my knight could still do a manoeuvre like Nc8 - Ncb6.",
        "7. Nbd2": "Ok, I'm thinking he's heading for a c4-attack within a few moves.. ",
        "7... h6": "White certainly masters the majority of space on the board, so I need to develop some more pieces. The idea behind 7. ... h6 is to play Bh7, followed by Ng6, so my dsb can take care of the f8-a3-diagonal.",
        "8. Nb3 Bh7": "As said before.. ",
        "9. Bd2": "This bishop has a nice diagonal on c1-h6, but probably he's aiming to go to b4 sometime. ",
        "9... Ng6 10. c4": "Opening some lines ! ",
        "10... dxc4": "I preferred to open the line myself, because after some other move for black, white could play 11. c5, closing in my dsb, which would give me problems to develop it properly.",
        "11. Bxc4 Nb6": "Challenging the lsb, and giving some breathing space for my cramped king's position.. ",
        "12. Bd3 Be7": "Preparing to castle.. ",
        "13. Re1 O-O 14. Qc2": "Doubling his attack on g6. My knight has no field to go to, once it's attacked !  So probably, white will come with an h-pawn-attack. Haven't seen that one coming in the game though :( ",
        "14... Nd5": "I was looking for this nice outpost for my knight. It can't be chased away shortly, unless white is willing to exchange his lsb for my knight.. ",
        "15. h4": "There it comes ! I can't play the knight away by 15. ... Ng-f4, because 16. Bxh7+ will follow. ",
        "15... Re8": "So I'm making space for my knight to come to f8, whereby he is also serving as backup-guard for my lsb on h7 !",
        "16. h5 Nf8 17. Bxh7+": "No doubt ! He forces me to take back with my knight, where that poor horse has little fields to cover. It will be pretty inactive on h7, which is precisely what white wants !",
        "17... Nxh7 18. Re4": "A nice idea ! An ideal situation for white should be 19. Rg4 and 20. Bxh6, but that's something I don't like that much, so I wanted to be faster as Alexey. ",
        "18... Bg5": "So I offer an exchange of pieces. After the exchange, I was looking hopeful to withstand the pressure on my kingside. ",
        "19. Nxg5 Nxg5 20. Rg4": "This already looked a little bit troublesome.. White's pawn f4 is a danger which cannot be ignored ! ",
        "20... f5": "At this point, I was almost running out of inspiration for a new strategy.. So I tried to get some initiative, and in meanwhile I opened a hole for my knight on g5, so it could go back to f7.",
        "21. exf6 e.p.": "Pretty obvious.. ",
        "21... Qxf6": "At the time, I thought this was the best move. 21. ... Nxf6 was also an option, but I wanted to keep an extra force towards my g5-knight and the g7-square.",
        "22. Bxg5": "Obvious ! Open up these lines towards the enemy king ! ",
        "22... hxg5 23. Nd2": "Actually I was waiting for a move like 23. Re1, followed by 24. Nc5. But with doing this move, white surely has some extra threatening danger on e4 ! ",
        "23... Ref8": "A try for some counterplay on white's kingside. But it won't be for long.. ",
        "24. Nf3": "Blocking my way to f2 and double-attacking my g5-pawn. ",
        "24... Qh6 25. Qg6": "The best move ! 25. Nxg5 was also a contender, but 25. Rxg5 Rxf3 26. gxf3 Qxg5 would be very worse for white.",
        "25... Qxg6 26. hxg6 Rf5": "Trying to maintain my pawn, but it won't be given a long life.. ",
        "27. Rxg5 Raf8": "I choose this move, because 27. ... Rxg5 28. Nxg5 Re8 29. Re1 would also cost me my e-pawn. But going through this game afterwards, it surprises me I played the move myself, actually.. Probably it was best to go for a queenside-pawn-advancement. ",
        "28. Re1": "Sure ! Go for it ! ",
        "28... Rxg5": "This was the only counter I could find. Most disturbing is that g6-pawn, wich is retaining my king on the back rank ! ",
        "29. Nxg5 Nf4": "Going for \"a pawn for a pawn\".",
        "30. g3 Nxg6 31. Rxe6 Rf6": "White has the most active pieces, and he surely is able to get an advantage of that ! ",
        "32. Kg2": "As said in a previous annotated game; bringing the king towards the center is always a good idea in the (starting) endgame ! ",
        "32... Kf8": "This was a little bit tricky: 33. Nh7+ Kf7 34. Nxf6 Kxe6 and my chances for counterplay would rise..",
        "33. Re3": "Alexey doesn't bite the bait and chooses for a frontal attack.. Probably 34. Ra3 will be next.. ",
        "33... Rd6 34. Ra3": "I'm pretty bad in such positions.. From now on, it's as good as game over for black.. Any idea's to play this endgame better would be welcome ! ",
        "34... a6 35. Rb3 Rd7 36. Ne6+ Ke8": "Moving my king closer to the fighting-scene.",
        "37. Nc5": "My b-pawn is lost anyway, and so will the c- and a-pawn. So I'm going to capture his d-pawn, as last satisfaction for this game. ",
        "37... Rxd4 38. Rxb7 Ne7 39. b4 Rd2 40. a4 Rb2 41. Nxa6": "This is The end \nBeautiful friend \nThis is the end \nMy only friend, the end..."
    },
    "url": "https://gameknot.com/annotation.pl/wtw-2-kingside-attack-towards-the-caro-kann?gm=53150",
    "gameName": "WtW 2 - Kingside-attack towards the Caro-Kann !",
    "players": "alex_ratchkov (2050) vs. taufiq (1647)",
    "opening": "Caro-Kann (B12), advance, Short variation"
}