{
    "moves": {
        "1. d4 Nf6 2. c4 e6 3. Nc3 c5 4. d5 exd5 5. cxd5 d6 6. e4 g6 7. Nf3 a6 8. Nd2": "To prepare 9. Nc4",
        "8... b5 9. a4 b4 10. Ne2 a5 11. Nc4": "to obsessed by the plan and in a bad mood to properly play chess, I overlooked the now unprotected e pawn.",
        "11... Nxe4": "A pawn is a pawn, like joanne said.",
        "12. f3": "Now white's plan is to put the king in safety and launch a strong attack toward the e file and the d6 pawn.",
        "12... Nf6": "Black has to retreat",
        "13. Ng3": "to prepare a further Ne4",
        "13... Qe7+": "I'm not sure it's a good move, for the white knight had to move anyway and the black queen will have to move twice and left the e file within 3 moves (at least it was my plan when I wrote this anotation).",
        "14. Be2": "To enable 15. O-O ... 16. Re1 ...",
        "14... Nbd7": "to prevent 15. Nb6",
        "15. Bf4": "Menacing d6 and developping (joining the rooks)",
        "15... Ra6": "Protecting d7",
        "16. O-O": "To prepare 17; re1.",
        "16... Bg7": "Developing.",
        "17. Re1": "Taking contrlo from the e file",
        "17... Kd8": "Black could have castled but, appearantly, prefers to  have the queen on her left wing and the king on her right, oposite in case of castling. I would have choose the opposite side but I'm not sure about which is the best option.",
        "18. Bf1": "So that white's plan is to hold the e file as long as necessary to emiminate all the defensors on the  kingside (if necessary with sacs), then to give mate to the isolated king, a majority of black pieces being blocked on the kingside.",
        "18... Qf8": "No choice",
        "19. Ne3": "To enable 20. Bb4. Black must defend and cannot regain the initiative.",
        "19... Ra7": "probably another mistake from black 19. ... Rb6 would have been better (in my opinion at least.)",
        "20. Bb5": "Directly menacing the king's personal mounted guard and at the essential e8 square.",
        "20... Ne8": "to free the DSB and protect the weak d6 pawn.",
        "21. Nc4": "Attacking the d6 pawn, protecting b2 and opening the e file.",
        "21... Bd4+": "developping",
        "22. Kh1": " 22. Kf1 would probably have been better but it had no incidence on the course of the game.",
        "22... f6": "I'm not sure about this move. Maybe done to enable 23. ... Qf7 or to support 23. ... Ne5 (the latest move having the interrest to close the e alley which directly leads to the black king.",
        "23. Re6": "As the e alley to the king could be closed by 23. ... Ne5, I thought it was ok to bring as much material as possible behind the future gate. the rook on e6 menaces d6 and e8 whic are two focal points.\n24. ... Ne5 is impossible now due to 25. e8+ Qxe8 26. Bxe8",
        "23... Be5 24. Bxe5": "White keeps the pressure",
        "24... fxe5": "... but is still one pawn late",
        "25. Ne4": "still pressing black on the center",
        "25... Ndf6": "This knight proved to be a big problem for white further in the game.",
        "26. Nexd6": "Mistake. 26. Nxf6 would have been better, for if 26. ... Nxf6 27. Rxe8 and the black queen is lost.",
        "26... Bd7": "GK computer considers it' a blunder. Black should have plaid Bxe6",
        "27. Qd3": "White didn't punish black's last blunder. White should have plaid Nxe8",
        "27... Nxd6": "Again, GK computer points this as a mistake., prefering Bxe6 but...",
        "28. Nxd6": "again, black's mistake is not punished because white makes another mistake. Rxd6 would have been better.",
        "28... Bxe6": "Untill the game's end, black makes no more mistake, according to GK computer and white still complete his collection.",
        "29. dxe6 Ke7 30. Rd1": "Mistake. White still has a better game but this move loses one tempo, giving black a time to reinforce her position. The proper move was 30. Nf7 (menacing the rook and enabling 31. Qd6+)",
        "30... Qb8": "Good defensive move. White's main threat at this point was Qd6 and it's no more possible.",
        "31. Bd7": "Still a mistake, Nf7 was the move to play. I didn't like 31. ... Kxe6 because it would have spoil the attack but 32. Nxh8 would have win material. If 32....  Qxh8 33. Qd6+ and black is in trouble again.",
        "31... Rd8": "good move.",
        "32. Nc8+ Rxc8": "black takes",
        "33. Bxc8": "I hoped that black would take : if 33. ... Qxc8 34.Qd6 and white has good winning chances (at least I thought so.",
        "33... Qxc8 34. Qd6+": "Henri has little choice.",
        "34... Ke8 35. e7": "Menacing the knight but overlooking black next move.",
        "35... Rd7": "It's finished. Dame Guenievre must die. If not, 36. ... Rg1 mate. White submits here."
    },
    "url": "https://gameknot.com/annotation.pl/wtw-modern-benoni-mini-tournament-viii?gm=51882",
    "gameName": "WtW Modern Benoni mini-tournament VIII",
    "players": "ptitroque (1761) vs. jstevens1 (1820)",
    "opening": "Nimzo-Indian defence (E20)"
}