{
    "moves": {
        "1. d4": "Lesson learned not to repeat moves and found that this admits I made the wrong moves too many time in my game with elyhim. I opened d4 and made it 45 Plus moves when the mating net was dropped on this sly fox. I resigned before the mate but I don't give up easy or do I? I used the analyze the board through out the game and this Redfox was out smarted and instead of rising, I raised the white flag! Good game elyhim. As part of my conditional surrender I am hear now to annotate our game.",
        "1... Nf6 2. c4 e6 3. Nc3 d5": "c4 e6\n3.Nc3 d5 \n4.cxd5 exd5 \n5.Bg5 c6 \n",
        "4. cxd5 exd5": "This was played so far with ease.",
        "5. Bg5": "I deploy my lsb and pin his N",
        "5... c6 6. Qc2": "This opens up my base rank",
        "6... h6 7. Bxf6": "B take N",
        "7... Qxf6 8. e3": "protecting the d pawn",
        "8... Nd7 9. Nf3": "development of my other N",
        "9... Bd6 10. Be2": "lsb now developed",
        "10... Qe7 11. O-O": "I castle 0-0",
        "11... O-O 12. Bd3": "lsb now to d3 after he castles",
        "12... Nf6 13. Bf5 Re8 14. Bxc8 Raxc8 15. h3": "I weaken my K with this move in an attempt to protect g4 from his N",
        "15... Ne4 16. Rac1 f5 17. Nd2 Ref8 18. Nf3 Rce8 19. Qe2 Qf7 20. Rce1 Re6 21. Nd2 Qe7 22. Qd1 Ng5 23. Nf3 Re8 24. Nxg5 hxg5 25. Qf3 f4 26. Kh1 b5 27. a3 a5 28. Nd1 b4 29. axb4 Bxb4 30. Re2 Rf8 31. e4 dxe4 32. Qg4 Rd8 33. Nc3 Rxd4 34. Kg1 Rd8 35. Na2 Bd2 36. Nc3 Re5 37. Nb1 Bb4 38. Kh1 a4 39. Rc1 e3 40. Rf1 Red5": "39.Rc1 e3   Na3 would have been better\n40.Rf1 Red5 \n",
        "41. Qf3 Rd5d1": "The end is near",
        "42. Kg1 Rxf1+ 43. Kh2 Rdd1": "\n40. Rf1 Red5 \n\n41.Qf3 Rd1 \n\n42.Kg1 Rxf1+ \n\n43.Kh2 Rdd1 \n\n44.g4 Qd6 \n\n  \n\n ",
        "44. g4": "played g4 thinking his f pawn might e.p to g3+",
        "44... Qd6 45. Na3 Rfh1+ 46. Qxh1 f3#": ""
    },
    "url": "https://gameknot.com/annotation.pl/wtw-game-repeated-moves-loses-game?gm=61279",
    "gameName": "WTW game Repeated moves loses game",
    "players": "redfoxrising (1849) vs. elyhim (2571)",
    "opening": "Nimzo-Indian defence (E20)"
}