{
    "moves": {
        "1. e4 e6 2. d4 d5 3. Nc3 Bb4 4. e5 c5 5. a3": "This is the MT starting position, although after some research I think the opening still has a couple of moves. At first glance it looks like white has an advantage.",
        "5... Bxc3+ 6. bxc3": "I think this is the actual end of the Winawer variation of the opening, although I'm not positive.",
        "6... Qc7": "Qc7 attacks c5, but I think black probably has his sights set on c3.",
        "7. Qg4": "This seems like a good way to attack g7 and defend d4 at the same time.",
        "7... f5 8. Qh5+": "Playing white, I considered Qh4, Qg3, and Qh5. Qh4 seemed to keep the defense on Qd4, but would give him an opportunity to develop the knight and prepare a castle. Qh5 forces a pawn advance. I still have the dark square bishop, he may not want to castle short. Analysis shows Qd1 (a move I really didn't consider) as the best one. I still think maybe Qg3 may have been better. Would value opinions on Qg3 versus Qd1.",
        "8... g6 9. Qh4": "I really wish I would have thought through Qd1. It seemed like a retreat, but would have been better than this. My thought was to defend d4 first, then move Qg3 to defend the fork. At this point, I realize I should have moved to Qg3 earlier.",
        "9... cxd4 10. Qxd4 Nc6 11. Qa4": "I underestimated the value of the e5 pawn and decided to leave it unprotected so I could pin the knight. I've been told I undervalue pawns and I am starting to understand this comment.",
        "11... Qxe5+ 12. Ne2": "Down one now, but still trying to protect c3. Black now seems pretty well formed, while I have not determined how to diffuse the c3 pressure point. I noticed I don't really have a consistent strategy. I started out attacking king side, but the knight pin fractured that concept.",
        "12... Bd7": "Black responds to the pin, and now I'm thinking about an exit strategy for my queen. However, I also know I have to do something about the black queen.",
        "13. Bf4": "If he moved e4, I would almost have to exchange queens. I don't know how a queen exchange would play out. However, the exchange would double black's center pawns, so I thought he would retreat the queen.",
        "13... Qg7": "Black obliges. However, now the reasoning I used for move 8. Qh5+ really showed up as flawed. He can easily castle kingside.",
        "14. Be3": "I decided to focus on my strengths. I noticed black has a monopoly on white squares, but I have the dark squares. Not really sure what to do with this information, but the my dark bishop is important to me.",
        "14... Nf6 15. Nd4": "I wasn't sure about this move because my queen is less mobile, but I really wanted to get more control of the center. Analysis indicates this is a mistake. In general, I think sometimes I play a bit too aggressive without considering the repercussions.",
        "15... O-O": "The black castle seems to seal his defense tight. At this point, I'm uncomfortable with my earlier Nd4 move. ",
        "16. Nxc6 Bxc6 17. Qd4 Ne4 18. Qxg7+": "Even though I was down one, the queen trade seemed to be the best option. But now how to deal with the knight? I would like to get my king out of the middle sometime in the near future, but I don't see how when the attacks keep coming. The white bishop seems almost useless.",
        "18... Kxg7 19. c4": "Trying to activate my white squared bishop.",
        "19... Ba4 20. Bd3": "Those c pawns are really troublesome. Because I realized I was undervaluing my pawns earlier in the game, I think I have to defend it. I thought about Bd4, then advance the pawn, but moving Bd3 opens up for the castle.\n",
        "20... Rfc8 21. O-O-O": "I intended on castling the other way, but thought somehow if I put my king behind the pawn it would be ok. I also thought having the rook at d1 would be strong support for the bishops somehow. Once I moved, I realized how bad this move was. His rooks are lining and the bishop is attacking that side already. I don't know why I moved my king into that mess.",
        "21... Kf7 22. f3": "I can see the pawns are going to cause me problems, so I want to try and break them up.",
        "22... Nc3 23. g4": "Yea, I have no idea why I didn't defend against the rook attack... it appears the wheels are coming off. Its all but over from here. I end up resigning. Thanks for the game Steven!",
        "23... Nxd1 24. Rxd1 dxc4 25. Bf1 Rcd8 26. Bxc4 Rxd1+ 27. Kxd1 Rc8 28. Bd3 Rc3 29. Ke1 Bxc2 30. Bxc2 Rxe3+ 31. Kf2 Rxa3 32. Kg3 b5 33. Kf4 b4 34. Kg5 b3 35. Bd3 b2 36. Bc2 Rc3 37. Bb1 Rc1 38. Ba2 b1=Q 39. Bxb1 Rxb1": ""
    },
    "url": "https://gameknot.com/annotation.pl/wtw-mt-11-french-defense-winawer-game-1?gm=51675",
    "gameName": "WtW MT 11: French Defense Winawer (game 1)",
    "players": "russ20124 (1214) vs. itchynscratchy (1986)",
    "opening": "French (C18), Winawer, classical variation"
}