{
    "moves": {
        "1. d4 Nf6 2. c4 e6 3. Nc3 c5 4. d5 exd5 5. cxd5 d6": "Here beginneth the real game.",
        "6. Nf3": "Choosing non-committally.  Will White play the Knight's tour Variation, or revert to the Main Line?",
        "6... g6 7. Nd2": "Knight's Tour it is...",
        "7... Bg7 8. e4": "...or maybe not.  The GK engine still calls this 'book', but for mine, it is already 'seat-of-the-pants' country.  My opening play ever was indifferent.",
        "8... O-O": "One of the beauties of this opening from Black's point of view is that the early programme is simple and straightforward: fianchetto, castle, check out the Q-side...",
        "9. Be2": "Of all the choices of destination for the Bishop, this seemed to be the most circumspect.  Any Black incursion at g4 is ruled out, and the Bishop presents much less of a target than he would at c4 and b5.  Although in some systems the Bishop would have still well at d3, it seems that it doesn't in this, again because it presents more of a target than doing anything useful.",
        "9... Re8": "Striking towards White's semi-backward e-pawn.  This move is multi-purpose, the rook being very handy on the e-file: discouraging e4-e5; hitting the e-pawn, and with veiled threats down the whole length of the file.",
        "10. O-O": "OK, there will be no pins down the e-file!",
        "10... Nbd7": "A pretty standard and thematic move.  It further restrains White's projected advance of the e-pawn, and even contemplates a blockade by ...Ne5 (though this doesn't often happen).  Further, there is the possibility of slotting in at c5 if the pawn presently there were to advance.",
        "11. a4": "That Black has not yet played forward her flank pawns does not stop White from getting in this restraining move.  ",
        "11... a6": "Thematic, though usually in this opening, Black gets it in before White's a4 advance.    But also possible was 11...Ne5!? with the idea 12.f4? Neg4! threatening a Q/R fork at e3.  After the text move,  I could have played 12.a5, but chose instead to build up the centre. ",
        "12. f4": "This advance goes towards the central plan of breaking through in the centre, if possible.  But it also keeps the Black Knight out of e5.",
        "12... Rb8": "At this point we leave the GK engine's opening book.  The rook supports an advance by Black's b-pawn.",
        "13. Kh1": "[!?]  Now, why did I play this?  All sorts of moves come to mind to play here, but I chose this non-committal - almost a 'waiting' move - for reasons that I can no longer recall to memory!  Very likely it had something to do with the possibility of a bishop check at d4 (or a queen at b6), but why it should have worried me at this point is hard to fathom.  I hadn't yet foreseen the way this game would go... I suspect I had seen something similar in a recent game, and thought it would be appropriate here.",
        "13... b6": "[?!] Surprisingly restrained.  I was expecting the thematic 13...b4.",
        "14. Qc2": "Over-protecting e4, as the d2-knight will soon be heading to c4.",
        "14... Nf8": "Clearing the line of the c8-bishop, with the view of bringing a knight in to g4, and again threatening a knight-fork at e3.  E.g. 15.Nc4 Bg4  16.Bxg4? Nxg4.  It is probable that  it was in view of a line such as this that I played the pragmatic Kh1 move.  ",
        "15. h3": "Keep out!",
        "15... Qc7": "Over-protecting the e5-point.  That is something Black always has to be aware  - and beware - of: the weakness at d6 undermining Black's centre.",
        "16. Nc4": "At last the knight reaches its destination, from which he strikes at Black's tender point at d6.",
        "16... b5": "[!]  A combative response, and probably Black's best move here.",
        "17. axb5 axb5": "OK... now what?  The knight took a long time to reach c4, and now, almost at once, has perforce to vacate the premises.  Quite playable is 18.Na5, heading for Nc6, an idea that has certain attractions.  But I had already seen an altogether different idea that would lead to a tactical brawl.",
        "18. Nxd6": "[!?] Not really a sacrifice, as we shall see...",
        "18... Qxd6 19. e5": "If worse comes to the worst, this fork recovers the piece.",
        "19... Qd8": "[?] Understandable, but Black overlooks a tactical riposte that would have kept a rough dynamic balance:  19...Bf5!  20.Bd3 -[20.Qxf5 gxf5  21.exd6 b4 looks good for Black]- 20...Bxd3  21.Qxd3 c4  22.Qf3 Qe7  23.exf6 Bxf6  24.Rd1 ... The position looks pretty unclear to me.",
        "20. Bxb5": "[?!] Striking at rook and knight.  But this was not the best, and compromised the advantage Black's previous move gave me the opportunity of obtaining:  20.exf6! Bf5  21.Qd1 Qxf6  22.Bxb5 Nd7 -[to maintain the rook in the e-file, an intervention is necessary.  The Knight isn't doing much otherwise, so it seems the logical choice.]- 23.Re1 Qd6 -[I'm following the GK engine's line, here]- 24.Rxe8ch  Rxe8  25.Ra6 Qe7  26.g4 Qh4  -[26...Be4ch!?]- 27.Bf1 Re1  28.Ra8ch Bf8  29.Qf3 ",
        "20... Nf6d7": "[?!] 20...Bf5! with an equal game;  21.Qd1 Ne4 22.Bxe8 Qxe8  23.Qf3 Nxc3  24.bxc3",
        "21. Be3": "The GK engine suggests Bc6, here, and that is a very powerful post for the bishop.  But the move played aims to round up Black's c-pawn, and restore thereby a rough material equality, at the same time bringing into being (I hoped) a second passed pawn.",
        "21... Qc7": "Contesting White's plan...",
        "22. d6": "[!]  It took me a longish while to decide upon this move, as I was a bit concerned about e6 in particular being made available to Black's f8-knight.  But I was unable to find any other continuation that furthered White's progress.  The attack upon the Queen at least gave White a tempo.  Black now has three moves available for the queen.  Only one of them allows her to protect the c-pawn...",
        "22... Qb6": "[?] This, the only move that maintained the queen's guard over the c-pawn, turns out to be the critical mistake that tips the balance in White's favour.  Jo has terrible luck against me, and this is an example of it.  As it transpired, it took me a while to appreciate what had happened.  Instead, according to the GK engine, 22.Qd8 would have kept Black in the game: 22...Qd8  23.Qf2 Ne6!?  -[The GK engine gives 23...Bb7  24.Bxc5 f6!  25.Bd4 fxe5  26.fxe5 Bxe5  27.Qf7ch Kh8   28.Bxe5ch Rxe5  29.Bc4 -[threatens mate]- 29...Ne6  30.Bxe6 Rxe6 , but after 31.Qxe6, White looks to be winning.  Black just would not have had enough counterattack on the 2nd rank.]. ++++++++++++++++++++++++++++++++++++++  It turns out that 22...Qb7 also looks hopeful for Black: 22...Qb7  23.Ra5 Ra8  24.Rxa8 Qxa8  25.Ne4 Rd8 -[unpinning the knight]-  26.Nxc5 Nxc5  27.Qxc5 Bxh3!!  28.Bc6! Qa6!  29.Bb5! Qa8 and a draw by repetition.",
        "23. b4": "Exploiting the pin along the dark diagonal.  Black as yet can match defenders to attackers against the c5-pawn, and can bring in a third, but by Ne4, White can in one move bring two further attackers to bear.",
        "23... Ne6": "[?] Again, entirely comprehensible.  How would anyone realise that Black's salvation already required something drastic?  23...Bxe5!  24.fxe5 Rxe5  25.Qf2 f5  26.Bxd7 Bxd7  27.bxc5 Qc6; and after 28.Bd4 Re6  29.Qf3 Rb2  30.Qxc6 Bxc6 Black has at least conjured up some counter-play.",
        "24. bxc5": "That central pawn array suddenly looks very formidable!  This isn't the first time Jo has been looking down the barrel of one of my centre pawn phalanges!",
        "24... Nexc5 25. Rfb1": "Now White's pieces are all in action.  There are pins and masked batteries all over the place.  Meanwhile the centre phalanx performs its usual Philippic function: to hold the enemy left flank in place.  ",
        "25... Qd8": "Whatever Black plays, a piece at least must fall.",
        "26. Bxc5 Nxc5 27. Bxe8 Rxb1+ 28. Nxb1": "[!]  Any of the three possible captures would have been OK, but this is the most decisive one. ",
        "28... Qxe8": "Or 28...Qb6  29.Qc4 Be6  30.Qb5 Qxb5  31.Bxb5 ... Having forced the queens off, White's material edge of the exchange plus two pawns is too big a hill for Black to climb.",
        "29. Qxc5": "[?] Far from the best, yet decisive for all that.  Black can not hope to make up such a deficit so late in the game.  However, 29.Ra8!! would have been immediately crushing: 29.Ra8 Qc6 -[only move]- 30.d7! Qxd7 -[again forced]- 31.Qxc5 and the c8-bishop shortly follows."
    },
    "url": "https://gameknot.com/annotation.pl/wtw-modern-benoni-mini-tournament-viii-broad-daylight?gm=50982",
    "gameName": "WtW Modern Benoni mini-tournament VIII: Broad Daylight",
    "players": "ionadowman (2120) vs. jstevens1 (1830)",
    "opening": "Nimzo-Indian defence (E20)"
}