{
    "moves": {
        "1. e4 d5": "As we know, 1.e4 is the opening I stick to.  Well, I know Fred and he often responds with the Scandinavian Defense.",
        "2. exd5": "Waisting no time, I take to prevent him from winning the pawn, instead.",
        "2... Nf6": "His most common reply, and as we're about to see, he is going to get the pawn back, on his next move.",
        "3. Nc3": "But, that gives me time to develop a piece.  And, when he takes, we will go into an exchange variation.  Now, I did something that cplusplus11 mentioned after what I noted about exchanging often, on if it's of equal value.  In general, I wouldn't be sure, but in this case, I think it is.  If I didn't, I'd be left with an uncomfortable position because the only other choice would be 4.Ne2  And, I don't like cramming my N's, so I think this is the right call.",
        "3... Nxd5 4. Nxd5 Qxd5 5. Nf3": "One of the reasons being is that his Q is out early, so I'll use that time to continue with my development.  However, I know that he doesn't have a weakness, so caution is needed.",
        "5... Bg4": "With that being said, he develops another piece by pinning my N.",
        "6. Be2": "So, I break it with the most common response.  It is worth noting that since he is a master, unless I must, I will not deviate from General Openings.  You've got to play it safe against someone who is much stronger.",
        "6... c5": "This makes it safe for Fred to play 6...Nc6, after I castle.  ",
        "7. O-O Nc6 8. d3": "?! I had a hard time evaluating between this move and 8.b3  I like fianchettoing, but I felt that there wasn't enough time to do that.  However, there was, so I missed a big picture which is of bad omen.  It's worth noting that this move came before I finished my game against bhidragon and received this kind of advice.  So, missing the big picture was much more problematic, and I'm afraid that I did that here.  With that being said, I think that better was 8.b3  This time, it's not premature to say it, so this move leaves me with a bad bishop since I won't be able to restrengthen it.  But, with b3, I would've had a nice long diagonol for my LSB which would not be blocked in by any of my own pieces.  With that being said after the next move after which would be 9.Bb2, and I'd have a stronger then I do now.",
        "8... e6": "For Fred, however, it's a different story as there is a place where he can place his DSB, which once it does, it'll be quite dangerous.  Not only that, but he doesn't have a bad bishop, as in this case, it would be premature to think that.  His LSB has a lot of options, in this position.",
        "9. Be3": "Completing development.  And, I am now interesting in seeing how Fred will respond.",
        "9... Rd8": "Putting pressure right on the center as this is another means of controlling it.",
        "10. c4": "Waisting no time, I decide to attack his Q, at once.  The idea behind this is that, once he retreats, I'll be able to pin his N.  Whereas, this wasn't possible before the c pawn had advanced, due to my bad bishop.",
        "10... Qd7 11. Qa4 Be7": "Completing his development and preparing to castle, at some point.",
        "12. d4": "Son that I don't feel as crammed, I decide to go into another long exchange variation.  The only problem is that my K might not be as safe.  It's hard to access it, whereas, before it wasn't.  This exchange involves the g pawn which is right near the K.  I used to be worried about this, but feel that I'll be ok after this.  The idea being is that tactical-abyss says that just because a pawn near the K is removed (or opened up) does not necessarily mean that your K is exposed or near exposure.  I think that applies here, as I still have a long ways to go, whereas, if it were a problem, it would be game over by the 20th move, at most.",
        "12... Bxf3 13. Bxf3 Nxd4 14. Qxa7 Nxf3+ 15. gxf3 Qc6": "Going after my f3 pawn.",
        "16. f4": "So, I protect.",
        "16... O-O": "And, this is where Fred decides to castle, at once.",
        "17. Rad1": "?? Now, I'm doing the same thing that Fred did earlier.  The idea is, \"Two can play that game.\"  Since he attacked my center by bringing his R on the d file, I decide to do the same thing.  But, unlike with my game against bhidragon, this time, I did overlook the threat.  By playing, he is going to win my Q for a R, on his next move.  Therefore, best was 17.Ra3, and if 17...Ra8, I can get out of harms way.  But, when he plays this now, there will no way to protect.  With that being said, the game is now lost for me.  The problem is that while thinking about the other concept, I missed the big picture and patterns which is problematic.  Yet, I'll still do whatever I can to stay in.  And, since I'm doing as not just a WTW game, but the Supplemental Talking the Talk, I will not resign until he can prove a mating sequence.  And, for those that are wondering, this is actually my style of doing things.  In addition, I have taught my students not to resign until the opponent has a mating sequence.  Now, many people feel differently, but reachforgoals (who I've also mentored) remembered my advice.  With that being said, she played a game, blundered and wound up with a lost position.  In fact, she was down 10 points, I think it was.  Therefore, the position to many people was resignable.  Yet, she stayed in, and her opponent blundered which enabled her to pull a swindle and win.  I was very proud of that.",
        "17... Rda8 18. Qa3": "With no way out of this, I decided to retreat.  The idea being that when Fred takes, I will get a R, in return.  Whereas, had I gone anywherelse, he would've won this for free.  Well, I was not going to allow that.",
        "18... Rxa3 19. bxa3 f5": "Unlike before, I don't know why Fred played this.  My guess would be to put pressure on the f file.",
        "20. Rd3": "Meanwhile, I bring my R up because the idea is attempting a swindle.  While I'm confident that it won't work against him, it's still worth a try.  So the idea behind this move is to double up on one file.  Not only did a good example happen against Jack where I won his Q (and that time for free), but by allowing him to double up, he enabled to pull a swindle.  But, the same thing happened with tactical-abyss in his Q sac as black.  One of the ways his opponent went wrong was enabling Joe to double up on one file, which did contribute his opponents downfall.",
        "20... Qf3": "Until this game was over, I had no idea why Fred played, and thus, viewed it as pointless.  However, it's anything but that.  Now, I considered 21.Rfd1 with the of doubling up, right away.  But, I wanted to win a piece, so instead, I'll bring the R to f7.  Now, I was lost for, sure, but little did I realize how busted I was.  Either way, Fred does have a mating sequence against, which he points out.  However, I still won't resign since the goal is to last, at least, 25 moves.",
        "21. Rd7 Rf6": "After this move, however, I realize that, \"To take is a mistake.\"  For if I do that, he will mate, immediately.  In fact, I asked myself what I could do and only saw one move, which sadly loses.  Believe it or not, Fred said that I should mark down 25 moves here since it would take, at least, 9 moves before things would change.  But, with my next move, however, it's lights out, at once. ",
        "22. h3": "?? Since I am busted, I started moving quicker a few moves ago, but this is where I rushed thinking that I had nothing else to lose.  The problem is that I did here.  That's because with this move, I'm not going to last 25 moves.  Instead, I had to move my Rf1, as he pointed out.  But, with this move, however, he has a forced mate in two.  Can you see it?",
        "22... Rg6+": "And, with that being said, I resign.  That's because 23.Qh2 is forced, and after that, he has 23...Qg2#  So, the lessons to be learned, is, first, what was mentioned in the previous annotation which I mentioned to reachforgoals.  It is important to see the big picture.  For example, my idea was to attack the center to control it.  But, I overlooked my Q being en-prise, and by doing so, he won it for a R.  From there, things were going to go downhill.  Second, even when you are lost you should still take your time and concentrate.  The idea being is that, in a lost position, there is more to lose then one might realize.  For example, had I taken more time, I would've realized that moving my R off of f1 would've allowed me to play 23.Kf1, after 22...Rg6+  From there, I would've lasted longer.  But, by rushing, I also missed the point because my monarch got confined to one square (like what we see in those endgames), and from there he was going to mate immeidately, as opposed to, eventually. "
    },
    "url": "https://gameknot.com/annotation.pl/wtw-all-your-base-are-belong-to-us?gm=60097",
    "gameName": "WTW- All your base are belong to us -",
    "players": "jkarp (1337) vs. easy19 (2243)",
    "opening": "Scandinavian defence (B01)"
}