{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Bb5 Nf6": "Not surprised to see him play the Ruy Lopez.  I used to answer with 3...Be7 due to me being overly protective of my Nf6, when the reality is that it's a waste of time to even think that.  So, I had to remind myself of something important that ubermensch43 told me, which I later emphasized to my students being that a, \"Fight or Flight\" syndrome is not supposed to occur in chess.  That used happen to me, but later, I followed some advise from reversion and annotated a game between tactical-abyss and brigadecommander on the Berlin Defense.  Not only does this inhibit that mechanism, but now, I feel more comfortable about my position because my K side is better placed.  The Bishop was allright on e7, but now, I don't feel that my position as crammed.  As later, I'll bring to a square which I like better since the plan involves K side development and castling short.",
        "4. O-O": "Meanwhile, he castles.",
        "4... Bc5": "And, I complete my K side development this.  Although it's not an inaccuracy, I forgot that there was a slight problem with this move, as white can answer with 5.c3, followed by, 6.d4  Not much tempo loss, but the problem is that, after exchanging pawns, white would be left with a solid pawn structure, as reversion emphasized in our training session.  This is something that I do not like and had overlooked.  Therefore, I'm lucky that he doesn't follow up with c2-c3.",
        "5. Nxe5": "Instead, he takes.",
        "5... Nxe5": "Knowing that my Nc6 is not pinned, I take back.  Yes, \"To take is a mistake.\"  Therefore, I normally wouldn't have even considered this move, but kept in mind what bhidragon told me since my focus was on castling and controlling the center.  But, for me, that's just chess bits and wisdom.  What he said, however, was not to focus on those chess quotes or bits and wisdoms, but rather, think about what the board is telling me.  In this case, the board appeared to indicate that it's allright to take.  If I saw an immediate threat like mate or loss of material, I wouldn't have played it.  The thing is that I don't see that, in sight.  However, that says little since there is something that I might be missing.  This is important to try and find out, though.",
        "6. d4": "I kept in mind this move since I know that nothing is free, lest you paid the ultimate.  But, in anticipation, I thought that there might be something to do to limit the damage.  He will definitely take back a piece, but my instincts are right, as I get a pawn, in return.  In doing so, I do not wind up behind.  However, there is something that I forgot about it.  It boiled down what he'd take.  I anticipate his next move, but the issue was forgetting that it was 1.e4 deal.  That makes an open position, and I took his N.  In the process where he gets my Bishop, I've already lost the exchange because a B is worth more.  Therefore, he gets the stronger piece and winds up with a slight initiative.",
        "6... Nxe4 7. dxc5 Qe7": "So, I delay castling to think more about what the board was telling me, as noted.  I almost played a move that a more experienced player wouldn't have even come close to considering.  The move was 7...Nxc5?? which looks good, but in reality, is an outright blunder.  It's because I, nearly, overlooked 8.Re1.  Now, that would've left my Ne5 pinned, after which, he gets a piece for pawn.  So, I had to think about what else.  Therefore, based on what reversion did to me in our second game, after a mistep, I decide to add an attacker here.  The idea being is that white's c5 is attacked twice by Ne4 and Qe7.  Consequently, I felt that he better be careful or lose a pawn.",
        "8. Re1 Nxc5": "?? Figuring that he made a mistake with this move, I felt that in the context of this position, \"To take is a mistake\" did not apply here.  As a result, I knabbed his pawn.  But, what I kept in mind, before playing this, was that, although the N remains pinned to the Queen, that's the worst that can happen.  I could break this pin and protect, though, with ...Qd6.  So, I planned ahead but miscalculated, and this problem has gotten a lot worse.  I was thinking of a whole bunch of moves that he might play.  And, that would come with variations based on how I'd respond (which is, in fact, the main way that I've surpassed a 1300 rating.)  But, what I overlooked was the immediate danger.  I already know that it was bad.  Mr original instincts would be that I'm forced to give up a piece or  the Queen.  In reality, no matter what I do, he will get my Queen for Rook.",
        "9. f4 a6": "Knowing that the Queen isn't pinned, yet, I thought I had an answer.  My chess thought process was that, if he took on e5, I'd take back on b5, as it would be even.  It was wrong calculation since the inference was that he'd captured with his f4.  What I overlooked is where the Queen is since it's on the same file as his Rook.  So, when he captures with my Rook, my Qe7 will be pinned.  Therefore, not only does he get a Queen for Rook, but on top of it, a piece for free.  With that being said, I'd normally resign, right after 11.fxe5 since as reversion puts, there's technically, nothing more to learn.  But, because it's a WTW game, I'm following the Supplemental Talking the Talk Rules which prohibits resignation, until there is a forced mating sequence.",
        "10. Rxe5 Qxe5 11. fxe5 O-O": "?? With nothing else to lose, I go back to my bag of chess quotes and castle, at once.  However, this was not the time or place to do it, for better was 11...axb5.  At least, I would've gotten a piece back.  But, by playing this, his next move will result in liquidation since pieces will be exchanged.  And, that's something that I do not like when far behind, like this.",
        "12. Be3 axb5 13. Bxc5 Re8": "Knowing that there's nothing else to lose, I go after his e5.",
        "14. Nc3": "All I can say is that this completes his development.  But, I think that better would've been 14.Bd4, as now I will take his e5.  However, the capture, in itself, does not help my position.  As noted, I stay in to sastify the Supplemental Talking the Talk rules in order to avoid being questioned by the mods at the WTWLTR club.",
        "14... Rxe5 15. Bd4": "I don't know why, but for whatever reason, he decides to attack my Rook.",
        "15... Rg5": "So, I protect.",
        "16. Qe2": "Threatening mate.",
        "16... h6": "Which I put a temporary stop to by opening up.",
        "17. Qe8+": "Doesn't stop him from checking, though.",
        "17... Kh7": "Forced.",
        "18. Ne4": "I thought he played this for the gain of tempo since my Rook is attacked.  But, in this case, I missed the real story being that he's organizing his pieces for a mate threat which will be impossible to drive off.",
        "18... Rg6 19. Bxg7": "He takes.",
        "19... Kxg7": "Figuring that I got a small amount of counterplay before what unfolds, which I see happening, I take back.  Even if taking is a mistake, there are no good moves left, anyhow.  So, I might as well.",
        "20. Rf1": "I also missed the important part to the story because I thought it was, before the sac, his B+N+Q that he used to mate.  I was right about all of that, except the Bishop.  Instead, he uses his R+N+Q for this attack.",
        "20... Kh7 21. Rxf7+ Rg7": "Forced.",
        "22. Qf8": "Bearing in mind that my Rook is pinned, I have one move to prevent 23.Qxg7#  But, it's of no use because of what's going to happen next.",
        "22... Kg6 23. Rxg7+": "Which is this move.  And, I resign here because he has a forced mate.  23...Kh5 is forced.  After which, white has two moves which will mate just as quickly.  The first one is 24.Nf6+, forcing 24...Kh4, and then 25.Rg4#  Or, 24.Ng3+, also forcing 24...Kh4 which allows 25.Qf4# "
    },
    "url": "https://gameknot.com/annotation.pl/wtw-reversions-open-fire?gm=61255",
    "gameName": "WTW-Reversion's Open Fire!",
    "players": "albertwall (2343) vs. jkarp (1353)",
    "opening": "Ruy Lopez (C65), Berlin defence, Beverwijk variation"
}