{
    "moves": {
        "1. d4 d5 2. e3 Nf6 3. Bd3 e6 4. Nd2 c5 5. c3 Nc6 6. f4": "This is the starting position of the stonewall attack. I am not very familiar with that opening to be honest. I know that White wants to place a knight on e5 and attack the kingside, especially the h file.",
        "6... Bd6 7. Ngf3 Bd7": "Both sides develop their pieces.",
        "8. Ne5": "The knight goes to e5, a theme in the stonewall. It is very difficult to displace that knight without compromising Black's position. ",
        "8... O-O 9. O-O": "Both sides castle.",
        "9... cxd4 10. cxd4": "Pawn exchange. The computer prefers 10.exd4, as now I can take the c file with my rook.",
        "10... Rc8": "Just like this.",
        "11. Qf3": "White prepares his forces to attack my kingside.",
        "11... g6": "I try to blunt White's light-square bishop assault on my king.",
        "12. Qh3": "White aims down the h file, which is thematic in the stonewall.",
        "12... Nb4": "! I attack white's bishop and I threaten to land my knight on c2, which could cause some problems to White.",
        "13. Bxg6": "?? Ouch! This is not a sound sacrifice. White's pieces are not enough developped to pursue the attack. I have enough time to consolidate my defences before the rest of White's army arrives.",
        "13... hxg6 14. Rf3 Kg7": "Now I can place my rook on h8, denying any possible attack down the h file.",
        "15. Qg3 Bxe5": "I decide to trade off that knight. It is a good idea to trade off pieces if you are up in material, as the difference in material is more important in the endgame.",
        "16. fxe5": "The downside of the exchange is that White now has a completely cemented pawn on e5 which bears down on f6. However, this is not as bad as it seems. A rook on f6 wouldn't do much. A queen there would be dangerous, but mine is watching that square, resulting in an even trade (which is good for me). The most terrifying piece that could land on f6 is the bishop, but it is not even close to that square, so no worries.",
        "16... Ne4": "! I threaten both the queen and knight, resulting in even more pieces off the board.",
        "17. Nxe4 dxe4": "Knight exchange. I attack the rook as well.",
        "18. Rf4 Nd3": "! A powerful move, forking the rook and bishop.",
        "19. Rf6": "? White misses the threat on c8.",
        "19... Rxc1+ 20. Rxc1 Nxc1": "I am now up two pieces, minus a pawn.",
        "21. Qh4 Rh8 22. Qxe4": "White takes my lone lone pawn, but allows me a tactical shot.",
        "22... Ne2+": "!",
        "23. Kf2": "White did not play 23.Kh1, as that would have led to 23...Rxh2+! 24.Kxh2 Qh8+ 0-1",
        "23... Bc6": "!",
        "24. Qg4": "? Wrong place. This most likely loses the queen, albeit for some material (which benefits me in the grand scheme of things). Better was 24.Qd3.",
        "24... Rxh2": "! There is no stopping Rxg2 now. (25.e4 Qxd4+ isn't much better.)",
        "25. Kxe2 Rxg2+ 26. Qxg2 Bxg2": "The rest is just simplification.",
        "27. Kd3 Qa5 28. Rf2 Qxa2": "?! This is not the best move, but it works.",
        "29. Rxg2 Qb3+": "White resigns, as the loss of the rook is unavoidable. (30.Ke4 Qd5+) (30.Ke2 Qxb2+ 31.Kf1 Qxg2+ 32.Kxg2 a5, the king is too far away to stop the pawn.) 0-1"
    },
    "url": "https://gameknot.com/annotation.pl/wtwltr-welcome-mt-against-baumannjoe?gm=49059",
    "gameName": "WTWLTR Welcome MT against baumannjoe",
    "players": "baumannjoe (1305) vs. a_random_guy (1847)",
    "opening": "Queen's pawn (D00), stonewall attack"
}