{
    "moves": {
        "1. d4 d5 2. e3 Nf6 3. Bd3 e6 4. Nd2 c5 5. c3 Nc6 6. f4": "This is the starting position of the mini-tournament; White has adopted the stonewall setup, characterised by the pawns on c3, d4, e3 and f4. In this opening, White wants to post a knight on e5 and create a lot of pressure on the kingside.",
        "6... Bd6 7. Ngf3": "Both sides develop their pieces.",
        "7... cxd4": "! I decide to immediately take the central pawn. Why? White can't recapture with the e pawn in this position without losing her f pawn. This means White will either recapture with her c pawn or her knight. Taking the pawn with the knight seems a bad idea, as there will be 1 less defender of the e5 square, an important square in this opening. Taking with the c pawn allows some shenanigans on the Queenside from Black.",
        "8. cxd4 Nb4": "I immediately attack White's bishop, a key piece for White in this opening.",
        "9. Bb1": "White simply retreats her bishop, while keeping an eye on my h7 pawn. However, this move has the downside of blocking White's rooks form each other, which will lead to White's downfall later on.",
        "9... Bd7": "A powerful development move. It allows my rook to occupy the c file later on and my bishop to occupy the a6-f1 diagonal, a big weakness in White's camp as her bishop isn't on d3 anymore.",
        "10. a3 Nc6": "White pokes my knight back to c6, blocking my bishop and the c file for now.",
        "11. Ne5 O-O 12. O-O Rc8": "Development from both sides.",
        "13. g4": "! White starts her attack with this aggressive pawn push towards my king.",
        "13... Ne7": "! I send my knight to the defence of my king. This move also has the bonus of freeing both my bishop and rook for some queenside operations.",
        "14. g5": "White pursues her pawn push.",
        "14... Ne8 15. Qh5": "White threatens mate on h7! However, this is easily dealt with.",
        "15... g6": "White's bishop on b1 is really annoying for Black in this position, so it is a good idea to limit his scope. This also opens the g7 square for my knight and attacks the White queen.",
        "16. Qh6": "?! White aggressively places her queen near my king, but it turns out to be a bad move. I can chase her away with my knights in a few moves. ",
        "16... Bxe5": "I decide to take that pesky knight. My dark-squared bishop didn't have many important squares to go, so I felt that this exchange was good for me.",
        "17. dxe5": "This came as a surprise to me. I was pretty sure that White would recapture with her f pawn, opening the f file for her rook and more importantly NOT removing a blocker of the g1-a7 diagonal. ",
        "17... Ng7": "Just as planned.",
        "18. Qh4": "White preemptively retreats her queen, as she saw she couldn't succeed in her attack after one of my knight lands on f5.",
        "18... Bb5": "! Now that that the mating threats are off, White's bishop is off the a6-f1 diagonal and my knight no longer blocks my bishop, I can play 18.Bb5!, attacking the rook. That rook is currently the only piece defending the c1 bishop form my rook, so it cant move off the first rank.",
        "19. Re1": "A mistake would be 19.Rf3 (Sacrificing the bishop so her rook would go on h3 faster, threatening mate) Rxc1+ 20.Kg2 Nef5 21.Bxe5 (Discovered attack on the rook) fails to Nxf5, attacking the queen and the a1 rooks falls afterwards. 19.Re1 moves the rook away from danger and protects the e pawn, but it has lost the option to come down to h3, attacking my king. This means my king is now perfectly safe.",
        "19... Qb6": "Now I move my queen to a powerful position; I pin White's e pawn to her king while eyeing for her b pawn after my bishop moves.",
        "20. Nb3": "?! A risky move. White probably wants to post her knight on d4, but overlooks my next move.",
        "20... Ngf5": "I attack her queen and her weak e pawn. I also cover the d4 square, so that White should not place her knight there.",
        "21. Qh3": "? Much more active (and better) was 21.Qf7. 21.Bxf5 is not a good option either, as my other knight simply recaptures the bishop and the c2 square becomes all mine.",
        "21... Ba4": "I attack the knight twice and it is currently undefended. The knight must move away, barring some sort of crazy sacrifice that I didn't see in the current position.",
        "22. Nd2": "White retreats her knight to the only \"safe\" square.",
        "22... Rc7": "I heavily considered taking on c1 with my rook at this point, but I decided against it. 22...Rxc1 23.Rxc1 Qxb2 24.Bxf5! Qxd2 (24...Nxf5 25.Nf1) 25.Bg4 leaves me down 1 point in material. 22...Rxc1 23.Rxc1 Nxe3 24.Kh1 leaves me down in material, but then I missed the following 24...Nd1! (Threatening a royal fork on f2), with a certain advantage for me. However, 22...Rc7 is not a game-losing blunder; I simply planned to double my rooks on the c file.",
        "23. Nf3": "?? This is White's losing move.",
        "23... Rxc1": "! Taking the bishop now simply wins for Black. Why? What has changed from a move ago? White's knight is now on f3 instead of d2. What does it change? The queen is no longer protecting the e pawn. How can I make use of this? Simple; with a double removal of the guard. 24.Rxc1 Qxe3+ 25.Kg2 (the others options lead to the same move, but with check.) Qxc1 26.Bxf5? Qxb2 and every possible move for White leads to a piece capture with check. Ouch. Alternately, 24.Bxf5 Rxa1! wins at least the e pawn in addition to the bishop. 24.Qf1 leads to the capture of the e pawn, resulting in Black having at least a 4 point advantage in material anyway. White resigned. 0-1"
    },
    "url": "https://gameknot.com/annotation.pl/wtwltr-welcome-mt-against-jstevens1?gm=49830",
    "gameName": "WTWLTR Welcome MT against jstevens1",
    "players": "jstevens1 (1904) vs. a_random_guy (1904)",
    "opening": "Queen's pawn (D00), stonewall attack"
}