{
    "moves": {
        "1. e4": "King pawn opening.",
        "1... e5": "Typical response.",
        "2. f4": "Kings gambit.",
        "2... d6": "My opponent defends his e5 pawn.",
        "3. fxe5": "I take the e5 pawn trying to open the center a bit and also setting up my next move.",
        "3... dxe5": "My adversary recaptures the e5 pawn.",
        "4. Nf3": "I attack the e5 pawn with my kingside knight",
        "4... Bg4": "Kradwan defends the e5 pawn by pinning my knight to my queen.",
        "5. Bc4": "I develop my kingside bishop.",
        "5... Bxf3": "Kradwan retires the offensive knight.",
        "6. Qxf3": "I recapture with my queen setting up a possible checkmate.",
        "6... Qf6": "My opponent challenges my queen with his queen.",
        "7. O-O": "I castle and move a rook in to backup my queen.",
        "7... Qxf3": "Kradwan exchanges queens.",
        "8. Rxf3": "I recapture the queen with my rook.",
        "8... Nf6": "Black develops a knight and protects the f7 pawn.",
        "9. d3": "I protect my e4 pawn and open up the c1-h6 diagonal for my dark square bishop.",
        "9... h6": "Black tries to limit my bishops movements on that diagonal.",
        "10. Nc3": "I develop a knight.",
        "10... Bc5+": "Black checks my king and develops a bishop.",
        "11. Be3": "I protect the king and develop my queenside bishop.",
        "11... Nbd7": "Kradwan develops another knight to a position where he can protect his bishop.",
        "12. a3": "I move up my a2 pawn with the intention of moving my b2 pawn next.",
        "12... O-O": "Black castles and connects his rooks.",
        "13. Bxc5": "I take out the bishop becase i see that his knight would be in a poor position after retaking my bishop.",
        "13... Nxc5": "My opponent recaptures my bishop with his knight.",
        "14. Rg3": "I try to put some pressure on my opponents king.",
        "14... c6": "Black moves up the c7 pawn to c6 to curtail my knights movements.",
        "15. Rf1": "I move the rook over to try to steal a knight on my next move.",
        "15... Nh5": "Black hops the knight to safety and attacks my other rook.",
        "16. Rg4": "I move the rook out of danger.",
        "16... Nf4": "Black hops his knight into a more convenient location.",
        "17. b4": "I try to persuade his other knight to retreat.",
        "17... Nd7": "And lo and behold it does retreat.",
        "18. Rg3": "I move my rook to a more secure location.",
        "18... Kh8": "Black decides to move his king to a better location.",
        "19. b5": "I try to make some maneuvering room for my pieces. ",
        "19... cxb5": "Black takes the offensive pawn.",
        "20. Bxb5": "I recapture the pawn with my bishop and attack his knight.",
        "20... Nf6": "The knight skidaddles out of harms way.",
        "21. Nd5": "I blundered here moving my knight from its location where it was protecting the e2 square.",
        "21... Nf6xd5": "My opponent doesn't seem to see my blunder and captures my forward knight.",
        "22. exd5": "I recapture his knight with a pawn.",
        "22... f6": "Black moves a pawn forward and protects his e5 pawn.",
        "23. d4": "I move up a pawn so my bishop protects me from my previous blunder while trying to loose his knights protection.",
        "23... a6": "Kradwan attacks my bishop with a pawn and tries to move my bishop off its protective diagonal.",
        "24. dxe5": "I try to exchange knight for bishop by removing his knights protection.",
        "24... fxe5": "Black recaptures and protects the knight.",
        "25. Bd3": "I am forced to move here to protect from the knight fork on my king and rook.",
        "25... Nxd3": "Black exchanges his knight for my bishop.",
        "26. Rxd3": "I recapture with my rook trying to leave my pawn structure intact.",
        "26... Rxf1+": "My opponent exchanges rooks.",
        "27. Kxf1": "I recapture with my king.",
        "27... b5": "Black advances a pawn to a better location.",
        "28. d6": "I do likewise.",
        "28... Kg8": "King to the rescue.",
        "29. Ke2": "I also move up my king.",
        "29... Kf7": "The kings keep moving forward.",
        "30. Ke3": "And again.",
        "30... Ke6": "...",
        "31. d7": "I move my pawn near the back rank.",
        "31... Rd8": "Black move his rook in to protect from my pieces promotion.",
        "32. Ke4": "I advance the king.",
        "32... Rxd7": "Black takes out the pawn with his rook.",
        "33. Rxd7": "I exchange rooks.",
        "33... Kxd7": "Black king recaptures the rook.",
        "34. Kxe5": "I advance my king again.",
        "34... Kc6": "Black moves his king over to that side.",
        "35. Kd4": "I move back to protect my pawns.",
        "35... a5": "Black advances a pawn.",
        "36. c3": "I move my pawn forward to stifle his advances.",
        "36... a4": "Black moves a pawn forward and commits to this side of the board.",
        "37. g4": "I move my pawns into better position on the other side of the board.",
        "37... g6": "Black advances a pawn.",
        "38. h4": "I move up the other pawn into better position.",
        "38... Kb6": "Black blunders here but I am unaware of it.",
        "39. Kd5": "I move to block his king in.",
        "39... g5": "Black moves a pawn on the other side of the board.",
        "40. hxg5": "I capture the pawn.",
        "40... hxg5": "Black recaptures.",
        "41. Kd6": "I advance my king.",
        "41... Ka6": "I should not have accepted the draw offer because I could have forced him to move a pawn or move away from his pawns here."
    },
    "url": "https://gameknot.com/annotation.pl/www-answersingenesis-org?gm=10331",
    "gameName": "www.answersingenesis.org",
    "players": "floppyjoe (1419) vs. kradwan (1468)",
    "opening": "King's gambit (C30)"
}