{
    "moves": {
        "1. d4 d5": "So we start off with a common queen's pawn opening.",
        "2. Nf3": "Far more common is 2. c4 but it can still transpose.",
        "2... Nf6 3. Bf4": "So my opponent chose to play the London System. I will admit that I had not prepared for this opening at all. So I just played moves that were natural and followed opening principles.",
        "3... c6": "!? 3. c5 is considered the main line. This response is slightly more passive, but it is still O.K.",
        "4. e3 Bf5 5. c4 e6 6. Nc3": "This position is quite unusual. However, both sides seem to have decent chances.",
        "6... Bb4": "?! This is an inaccuracy that gives white the initiative. ",
        "7. Qb3": "I had overlooked this move. The bishop can not move because it is pinned to the b pawn. ",
        "7... Qe7": "? Best probably would have been to exchange immediately. Now I must be very careful with my next few moves.",
        "8. c5": "! Cutting off the bishop from the queen's protection. This move also opens up the threat of Bd6 which would prevent me from castling and making my position cramped.",
        "8... Bxc3+ 9. bxc3 Ne4": "This is practically force to keep the bishop off of d6.",
        "10. Bd6": "!? Interesting. White will seize a strong initiative, but I can create a counter attack quite easily. White will have a difficult time defending that d pawn. However, it certainly can cause some problems in the future...",
        "10... Nxd6 11. cxd6 Qd7 12. Ne5": "White gains another tempo, but now I will start to really pressure white.",
        "12... Qc8 13. Be2": "I think 13. c4 might have been a slightly better alternative.",
        "13... Nd7": "Putting some pressure on the knight.",
        "14. O-O O-O 15. c4": "With the intentions of playing c5 at some point to protect the d6 pawn, or cxd5 to open the c file.",
        "15... Nxe5": "Exchanging for white's powerful knight.",
        "16. dxe5 f6": "My plan was quite simple at this point. Open the f file, get my queen to g6 to attack white's king, and try to isolate the d6 pawn.",
        "17. f4 Rb8": "Further defending the b pawn and preparing to play Qe8.",
        "18. Rac1 Qe8 19. a4": "?! I don't really know what the purpose of this move is. Perhaps cxd5 or maybe even Qd1!? was worth considering.",
        "19... fxe5": "Opening the f file for my rook, as well as creating a weakness on e5 for white.",
        "20. fxe5 Qg6": "Now that my plan has come to fruition I have a comfortable position. I am now threatening Be4 with a decisive advantage. As far as I can see white has only two good options. Either Bf3 (probably best) or a more aggressive Rf3. ",
        "21. Rf3": "And the more aggressive approach is what white chose.",
        "21... Be4 22. Rg3": "This drops the e5 pawn, however there is not much else white could really do about the threat of mate.",
        "22... Qf5 23. Bf3": "This move is basically forced to prevent the queen and rook battery. Now I am up a pawn, but I must still be careful.",
        "23... Bxf3": "?! This is not best. The immediate Qxe5 was probably better, leaving white to decide whether to exchange or not.",
        "24. Rxf3 Qxe5 25. Rxf8+ Rxf8 26. c5": "The best way to defend the d6 pawn. I thought long and hard about playing b6, in an attempt to be rid of the pesky pawn. But after 26...b6 27. cxb6 axb6 28. Qc3! and white should be able to hold a draw. However, I chose to immediately put some pressure on the king.",
        "26... Qf5 27. h3": "!? A very gutsy decision by white to create a worse pawn structure around his king.",
        "27... Qf2+ 28. Kh2": "And here we reach a critical point in the game. It is almost as if white is daring me to play Rf3. My opponent was getting very low on time though(just under 15 minutes). I started to get really nervous. Second guessing myself and I began to struggle with my calculations. So I messed up.",
        "28... Rf3": "? This move does not lose. I just have to be extremely precise with these next moves to force a draw.",
        "29. Qxb7": "The obvious move. Now comes an important move for black. 29...Rxh3+! 30. Kxh3 Qxe3+ 31. Kh2 Qxc1 and I have a draw by repetition available to prevent white from promoting that d pawn.",
        "29... Qg3+": "?? I missed it. Now white should easily be able to force a win. The only thing that was keeping my hopes alive was that white was in time trouble.",
        "30. Kh1": "Forced.",
        "30... Rf2": "Anything else loses also. Just the threat is enough to make an opponent get scared and slip up sometimes though. ",
        "31. Qc8+ Kf7 32. Qd7+": "?! Waste of time. White should just play Rg1 and push his d pawn.",
        "32... Kf6 33. Qe7+ Kf5 34. Rg1": "My position is completely lost. However, I have one move up my sleeve that really threw my opponent off. It made him think for a while, until has clock had run all the way down to under 3 minutes. That is when he messed up.",
        "34... Qg5": "Of course, a simple move, Qe8 followed by d7 and promotion should not have been too hard to find right?",
        "35. g4+": "? Wrong! Now the white king is very exposed. And that could become a major problem.",
        "35... Kg6": "Forced, or else I lose the queen.",
        "36. Qxe6+ Rf6 37. Qe8+ Kh6": "Now that my king is safe enough I can threaten mate with Qh4. My opponent did not have time to calculate how to prevent this so he did the simplest way of doing so.",
        "38. Qh5+": "? Exchanging! Now this game is probably a draw.",
        "38... Qxh5 39. gxh5 Rf7": "! And now material will be equal.",
        "40. Rg4 Kxh5 41. Rf4": "Hoping that I will exchange rooks which of course I can't do or otherwise I can't stop promotion.",
        "41... Kg6 42. Kg2": "?! Now that my king is in position to stop the pawn, an exchange of rooks will pretty much force a draw.",
        "42... Rxf4": "Which I was perfectly okay with at this point.",
        "43. exf4 Kf7 44. Kf3 g6 45. Kg4 h5+ 46. Kg5": "?! A bit risky to get that far from my d5 pawn....",
        "46... d4": "This now forces f5 so that the king can catch the pawn.",
        "47. f5 gxf5 48. Kf4 Ke6 49. Kf3 h4 50. Ke2 f4 51. Kd2 f3 52. Kd3": "There is no way either side can promote.",
        "52... a5 53. Kd2 Kd7 54. Kd3 Kd8 55. Kd2 Kd7": "Draw agreed. This was a stressful game where my nerves got the better of me. I should have lost, but I got lucky."
    },
    "url": "https://gameknot.com/annotation.pl/n-c-open-rd-2?gm=51772",
    "gameName": "N.C Open Rd.2",
    "players": "Shawn Spencer (1559) vs. Ben (1168)",
    "opening": "Queen's bishop game (D02)"
}