{
    "moves": {
        "1. e4 c5": " Sicilian defense is the most common opening VS. 1.e4 these days. ",
        "2. Nf3": " Most common move, White can also try\n A. 2.d4 smith morra gambit ( Black MUST be careful i recommend it!)\n B. 2.b4 wing gambit ( not very common, i don't recommend it)\nC. 2.c3 alapins ( Is considered quite harmless to Black)\nD. 2.Nc3 and follow up with 3.f4, 4.Nf3 and then 5.Bc4 for the Grand Prix attack! ",
        "2... d6": "  2. d6 is the most common but also Black can play.\n \n A. 2.Nc6\n B. 2.e6  ",
        "3. d4": " White alternative choices are...\n \nA. 3.Bb5  is Moscow variation it helps Black's development, so i dont recommend\nB. 3. c3 the alapins it sets a trap up too after 3.Nf6 4.Be2 Nxe4?? 5.Qa5 ! wins\n        a bishop but the problem is after 4. Nbd7 White will have a awkward \n      position after 5. Qe2 or 5.Bd3",
        "3... cxd4": " forced.",
        "4. Nxd4 Nf6": " Threatening the pawn.",
        "5. Nc3 a6": " This move initiates the Najdorf's pet opening the Narjdorf variation\n Other choices Black has instead are;\n \nA. 5. g6 Sicilian dragon (most popular, I don't play it much, but i recommend it)\n\nB. 5.Nc6 Sicilian classical variation ( not the  fun Sicilian, i dont recommend)\n\nC. 5. e6  I like to play as White because I like to use the Keres attack 6.g4\n        ( another reason Paul Keres is my faveroute chess player.  \n    ",
        "6. Bg5": " The sharpest way to play against the Narjdorf as White.\n Also possible are\n  A. 6.Bc4 Bobby Fisher's move of his choice and I recommend it!\n  B. 6. Be3  I dont  recommend because a future Ng4 will disrupt development.\n  C. 6. Be2 I don't recommend because it is passive\n  D. 6.  f3  Is atleast ok. follow up with 7.Be3 but it looks rather slow.",
        "6... e6": " Also playable is Bobby Fisher's favorite weapon 6. Qb6 which he got impressive \n  results with.",
        "7. f4": " Threatning 8. e5!",
        "7... Be7": " Breaks the pin and allows the King to castle King side when ever he wants to.",
        "8. Qf3": " Preventing 8. b5 because of 9.e5! threatening the Knight and the Rook on a8,\n also allows White to castle Queen-side and supports a future f5.",
        "8... h6": " Threatening the Bishop.",
        "9. Bh4": " White is correct not to exchange by 9. Bxf6 Bxf6 then Black is threatening the \n Knight and also has the advantage of the 2 bishops. ",
        "9... g5 10. fxg5 Nfd7": " To prevent white playing 11.pxh6 because of the obvious 11.Bxh4 . But instead\n Keres does a brilliant sacrifice.... ",
        "11. Nxe6": " LIKE THIS!!! to tear away Blacks defenses!",
        "11... fxe6": " Matters would obviously just get worse for Black if he ignored the Knight. ",
        "12. Qh5+": " Check",
        "12... Kf8": " A forced move.",
        "13. Bb5": " !!  AN ABSOLUTELY BRILLIANT SACRIFICE!!! that I did not myself, see coming!\n  If Black accepts the Bishop 13. pxb5 then 14. 0-0 ! The castling also gives a\n  check, how funny! 14. Bf6 ( If 14. Kg8 or Kg7 Black walks straight into \n  checkmate after 15. Qf7 mate) 15. pxf6  ( If 14. Nf6?? after 15.pxf6 White gets his piece back plus the Bishop on e7 because it is totally paralyzed!) and White\n anyway has the better position.",
        "13... Kg7": " Black would rather move his King now than have it move by check and then\n immediate mate with Qf7 afterwards!",
        "14. O-O": "  White now threatens immediate 15. Qf7 checkmate.",
        "14... Ne5": " Just to guard f7",
        "15. Bg3": " Threatens 16. Bxe5 dxe5 and then 17. Qf7 checkmate.",
        "15... Ng6": " Now to Block the Queen from mating on f7. ",
        "16. gxh6+": " White fells that he must open things up.",
        "16... Rxh6": " recapturing....",
        "17. Rf7+": " ",
        "17... Kxf7": " Any other move that  Black makes instead he will still have to drop his Rook, \n LOL!!",
        "18. Qxh6 axb5": "  Black now fells that he can accept the sacrifice and also survive but \n Paul Keres' answer to that was \"NO I DON'T THINK SO!!\"",
        "19. Rf1+": " This move probably struck like a Thunderbolt!",
        "19... Ke8": " White forces mate after Black's other choice 19. Kg8  by playing 20. Qxg6 \n Kh8 ( Black's only move) 21. Rf7! Qg8  22. Qh6  Qh7  23. Qxh7 checkmate!",
        "20. Qxg6+": " White gets his piece back but also with a vicious attack!",
        "20... Kd7": " Blacks only choice....",
        "21. Rf7": "  To pin the Bishop to the Black King.",
        "21... Nc6 22. Nd5": " To increase the pressure on the pinned Bishop.",
        "22... Rxa2": " defeat for Black is imminent!",
        "23. h4": "  !    So White can move his King to h2 and not have to play Rf1 to block the dam\n       check and therefore the exchange of Rooks which would favor Black a lot. ",
        "23... Qh8": " Black is now very desperate to do something.",
        "24. Nxe7 Nxe7 25. Qg5": " Black resigned at this point, as to much is being threatened 26. Qxe7  Kc6  \n  27. Qc7 checkmate! and 26. Qxb5  Kd8 27. Bxd6 Which is winning for White.\n   GREAT GAME!! Paul Keres  beating Miguel Najdorf and against his own opening, LOL!  If you rate this 2 or less you must tell me why you have, but if\n you have any feedback then please send me a message!\n    Cheers!\n   "
    },
    "url": "https://gameknot.com/annotation.pl/najdorf-using-his-pet-opening?gm=7544",
    "gameName": "Najdorf using his pet opening",
    "players": "Paul Keres (N/A) vs. Miguel Najdorf (N/A)",
    "opening": "Sicilian (B98), Najdorf, Goteborg (Argentine) variation"
}