{
    "moves": {
        "1. e4": "Hi everyone!\r\n\r\nI won't beat about the bush, after 41 games against the Master Mater still nul point.  The only thing I can say is is that between the Traxler Game as Black against him called At Each Other's Throats and this one I have not even looked like competing and I have certainly played to my OTB level against him (1200).  Well, I think this is more like a Master v Class A player game.  The former class A player does not make a losing move until nearly 50 moves is completed in the game, that is some improvement I suppose.  Anyhow, after a double king pawn opening, Freddy surprises me with ......",
        "1... e5 2. Qf3": "2. Qf3 - the Napoleon Opening.  For a moment my heart sank.  For in my one and only loss against The Dentist that was the opening he played against me.  Here it is:- http://gameknot.com/annotation.pl/the-dentist-has-his-day?gm=17287.  Can I improve on this one here?",
        "2... Nf6 3. Bc4 Nc6 4. Ne2 Bc5": "4. ...... Bc5 - behold, some normal \"sensible\" development from yours truly.",
        "5. a3 Nd4 6. Nxd4 Bxd4 7. c3 Bb6": "7. ...... Bb6 - after an exchange of knights, Fou Lenoir is driven back to b6.",
        "8. d3 h6 9. Qg3": "9. Qg3 - a very nasty looking move, I dare not castle kingside because I will drop a pawn by Bxh6!.  My e pawn is also en prise!  Help!",
        "9... Qe7": "9. ...... Qe7 - but help is at hand in the form of Glenda the Defender.  The g pawn is en prise but Freddy did not wish to take it because he was a little worried by a move such as Rg8.  He wanted to castle short and he did not want any open lines to his king!  A nice feeling that, I have actually done something to worry the Master Mater!",
        "10. a4 a6": "10. ...... a4?! - Freddy pointed out that had it been him he would have played a5.",
        "11. a5 Ba7 12. Be3 Bxe3 13. fxe3": "13. fxe3 - pawn trade.",
        "13... O-O": "13. ....... 0-0 - here, with Freddy's dsb exchanged off I now feel more comfortable about putting Henry on the kingside, even though, his nemesis in chief, the Wicked Witch of the West is bearing down on him from g3.",
        "14. Nd2 d6 15. Qh4 Be6": "15. .... Be6 - now Fou Leblanc emerges and I have cleared the decks.",
        "16. O-O": "16. 0-0 - now Freddy castles short.  Maybe he is using the open f column to bring his rooks to bear down on Henry.  Must get ready for this!",
        "16... Bxc4 17. Nxc4": "17. Nxc4 - I now trade off Fou Leblanc for Freddy's remaining bishop.  That is one less piece that can get at Henry.  Can I keep that white horsie out though?",
        "17... Rfe8 18. Rf5 Nd7": "18. .... Nd7 - inviting a queen trade.",
        "19. Qf2 f6": "19. ...... f6 - now I try and erect the Joblock - a device to lock Freddy's pieces out.  Can it hold though?",
        "20. b4 c6 21. Qg3 Kh7": "21. ...... Kh7 - maybe a good idea to unpin that g pawn.",
        "22. Raf1 d5 23. Nd2": "23. Nd2 - Freddy's knight is momentarily driven back but I just hope he does not create mayhem on my kingside castled position.",
        "23... Reg8 24. Rf5f3 Nf8 25. Qg4 Qe8": "25. ..... Qe8 - still defensive but at least Freddy is getting nowhere!",
        "26. Rg3 Qe6 27. Qxe6 Nxe6": "27. ..... Nxe6 - Freddy was disappointed that he felt he had to trade off his queen - good, make the oppo do what he likes doing least!  The recapture has moved my knight off the rim.",
        "28. d4 exd4 29. exd4": "29. exd4 - Freddy said that I should have refrained from the capture.  It looked good at the time but it is gonna allow him a passer on the e column.",
        "29... Rgf8 30. Re1 Rae8": "30. ..... Rae8 - my last piece comes into play.",
        "31. Rge3 Nc7 32. Kf2 Kg8 33. g4 Kf7": "33. ..... Kf7 - Henry decided to follow his counterpart - move towards the centre.",
        "34. h4 Rfh8 35. h5": "35. h5 - pawn roll.",
        "35... Rhf8 36. e5 fxe5 37. Rf3+ Kg8 38. dxe5": "38. dxe5 - Freddy now has a passed pawn.  I blockade it with Ne6.",
        "38... Ne6 39. Kg3 Rf7": "39. ..... Rf7 - I was wondering whether Rxf3 was better.",
        "40. Rxf7 Kxf7 41. Nf3 Ke7": "41. ....... Ke7 - Henry begins a trek across to the queenside.  However, he would have perhaps done better to have remained on the kingside.",
        "42. Nh4 Kd7 43. Nf5 Rf8 44. c4 dxc4 45. Rd1+": "45. Rd1+ - taking control of the open d file.",
        "45... Kc7 46. Rc1 Rd8 47. Nd6 Rf8 48. Nxc4": "48. Nxc4 - Freddy regains his pawn.",
        "48... Rf4 49. Nb6 Kb8": "49. ..... Kb8?? - here is the losing move.  Freddy had this to say about this and my 50th.  \"49...Kb8 should have been Rd4 block the file for intrusion. 50...Re7 should have been Re4 - do not give any chance of exchanging rooks because that rook was a key element for drawing the game.\"",
        "50. Rd1 Rf7 51. Rd7": "51. Rd7 - my previous move was to counter this rook move but it does me no good as Freddy's note above suggests.",
        "51... Rxd7 52. Nxd7+ Kc8 53. Nc5 Nc7 54. Kf4": "54. Kf4 - the WK comes in with devastating effect.  After one spite check I decided to wave the white flag after 55. Kf5 - there is no way I will be able to prevent the WK from gobbling up my kingside pawns - the white kingside pawns will be unstoppable.  Oh well, I will just have to keep on trying to end that losing run.  Hope you've had a good read.  Bye for now - Joanne.",
        "54... Nd5+ 55. Kf5": ""
    },
    "url": "https://gameknot.com/annotation.pl/napoleons-opening?gm=30162",
    "gameName": "Napoleon's Opening",
    "players": "easy19 (2279) vs. jstevens1 (1782)",
    "opening": "KP (C20), Napoleon's opening"
}