{
    "moves": {
        "1. e4": "A sharp Kalashnikov where White tries a rare sideline and Black defends very well for a time, but ultimately succumbs to a tricky idea from White. The jury is out on this variation after Black's very strong 8..Rg8!",
        "1... c5 2. Nf3 Nc6 3. d4 cxd4 4. Nxd4 e5 5. Nb5 d6": "Introducing the modern Kalashnikov Sicilian, which is basically a Sveshnikov setup without the 4..Nf6 5.Nc3 intermezzo. Black immediately lashes out in the center with tempo.",
        "6. Bg5": "'!?' - The bishop is poison (of the Najdorf variety - ...Qxg5 is a fairly common try), but that is not all. This move initiates a sideline (used successfully by Velimirovic) designed to unbalance Black in the opening. Though not objectively best (c4 is critical), this move induces a pseudo-Sveshnikov position where White has not yet played Nc3. If not 6..Qxg5!?, Black must play ...Nf6 (if ..Be7? 7. Bxe7, then Black must awkwardly recapture ..Kxe7 to avoid dropping the d-pawn; and ..f6 is somewhat ridiculous but similarly possible). More typical is 6.c4(!), initiating a positional stranglehold that is uniquely available in the Kalashnikov and considered bad for Black. It is also the reason many players prefer the Sveshnikov move order.",
        "6... Nf6 7. Bxf6": "'!? or '?!' - This has been played by Topalov in his early days and White tends to score rather well, but much of this owes to surprise value that to some extent is less valuable in corr chess. Still, this initiates a doubled-pawn position White is familiar attacking from Sveshnikov play, where f7 becomes a target and White plays for a quick attack.",
        "7... gxf6 8. Bc4 Rg8": "'!' - Simplest and best, seizing the open file and annoyingly attacking g2. It also prepares to defend f7 via a future ..Rg7. Certainly the strongest continuation for Black, though it appears to be an original one.",
        "9. Qh5 Rg7 10. Nb1c3 a6 11. Na3 Nd4": "Simple and solid. After ..b5-b4 there may be problems with the c2 square too in some variations.",
        "12. Nd5 Rxg2": "'!?' - This greedy move is difficult to refute. If the d5 knight moves (threatening Qf7#) then Black can retreat ..Rg6! and White has gotten nowhere. Black's retreat covers f7 and threatens ..Rh6, driving off the White queen.",
        "13. O-O-O Bg4": "'!?' - Black goes in for further material gain. White must prove himself quickly. The immediate ..Rg6 was also possible, though obviously not ..Rxf7? Qh4 and White is winning.",
        "14. Qh4 Bxd1": "Black must allow the discovered check after Nxf6 , as something like ..Be7 allows Bf1 trapping the Black rook, among other options.",
        "15. Nxf6+ Ke7 16. Rxd1": "Clearly best. White can play for a future Rxd4 in some attacking lines, or pressure the d6 pawn if the knight moves. Meanwhile there is no useful application for the discovered check, yet.",
        "16... Rg6 17. Nd5+": "An interesting aside is 17.Nxh7!? Kd7 18.Nxf8  Qxf8 19.f4!, threatening the Black knight's d4 home and a pin  along the d-file if allowed to continue fxe5. Very much unclear.",
        "17... Ke8 18. Qxh7": "A concession. White allows perpetual after ..Rh6 Qg8 Rg6. If he cannot pester the f7 square, his attack will not get anywhere.",
        "18... Bh6+": "'?' - Black's move paves the way for White to attack f7 once again, which cannot be good for the second player.",
        "19. f4": "'?!' - This tricky move is actually inferior. Later analysis reveals that 19.Kb1! b5 20. Nf4! introduces an ultra-sharp position where White is winning with accurate play, which might continue  20..Rf6 21.Nh5 Rxf2 22.Qxh6 bxc4 23.Nxc4 when Black is up an Exchange but subject to a vicious winning attack as the knights occupy crucial (and often unassailable) holes in the Black position. The text relies on ..exf4?? Qh8  ( -) and, as seen in the game continuation, f4-f5 wins the rook with attack.",
        "19... b5": "A solid intermezzo.",
        "20. Kb1": "'!' - White notices that the c4 bishop cannot be taken, as the threatened f4-f5 wins outright. In fact, Black's only move is 20..Bf8!, defending against White's back-rank dreams and allowing ..Rh6 in the event of f5. ..Bf8 leads to a double-edged game.",
        "20... bxc4": "'??' - The game is over.",
        "21. f5 Rf6": "This move loses quickly, but there is nothing else. Most tenacious is 21..Rg2, when after 22.Qxh6 there follows moves like Nxc4 and c3, bearing down on the d6-pawn while the ..Rg2 is misplaced.",
        "22. Qh8+": "The point. Black's rook is toast, with the bishop to follow."
    },
    "url": "https://gameknot.com/annotation.pl/neilskyes-1st-thematic-sicilian?gm=6207",
    "gameName": "neilskye's 1st thematic (Sicilian)",
    "players": "scottyad (1668) vs. bunta (1794)",
    "opening": "Sicilian (B32), Labourdonnais-Loewenthal (Kalashnikov) variation"
}