{
    "moves": {
        "1. d4 d5 2. c4": "I started this game with the Queen`s Gambit, like I usually do. It`s not one of the sharpest openings, but the positions most commonly turn out to be interesting. ",
        "2... Bf5 3. Qb3": "I had never seen this move before so I decided to follow the database. This move seemed pretty nice to me because it attacks the pawns on d5 and b7. On the other hand white has already moved his Queen and if black should manage to hunt the queen while developing his own pieces he might get a huge opening advantage.",
        "3... e6": "B7 appears to be hanging, but after 4.Qxb7 Nd7 follows 4...Rb8 and black gets open files while having two more pieces in play. I am sure this would be enough compensation for one or two pawns. ",
        "4. Nc3": "Therefore I decided just to develop, once more attacking d5. However, the next move did kind of shock me. ",
        "4... Nc6": "Not only d4 is hanging, Nb4 followed by Nc2  must be met somehow, too. ",
        "5. cxd5": "I decided to take the pawn so that I could play more actively, and because I hardly saw any better possibilities to prevent Nb4 and protect the pawn on d4.",
        "5... exd5": "5...Nxd4?? 6.Qh4   -\nBut it still appears that white is in trouble. First of all d4 is hanging, secondly after e.g. 6.Nf3 black threatens not only 6...Nb4, which would be met with 7.e4 dxe4 8.Ne5 with a nice attack, but could prepare this with 6...Nf6, and white still has difficulties to find something against the fork on c2. I didn`t like 6.Be3, which protects d4, either. It just looked wrong to block the pawn on e2. \nAfter 6.Qxb7 obviously follows 6...Nxd4.\nHowever, I found a move I do like very much because it looks very pretty and is actually quite strong.",
        "6. Bg5": "6...Qxg5? 7.Qxb7 and I get either the rook or the knight. \n6...Nf6 7.Qxb7 Nxd4 8.0-0-0 and I think white is better.\n6...Nxd4 7.Qa4  Bd7 8.Qxd4 Qxg5 9.Nxd5 Bd6 with a difficult position but a white extra-pawn.\n6...f6 7.Bf4 Nxd4 8.Qa4  Nc6 9. 0-0-0 and I`ll not only get the d5 pawn but the game will get pretty sharp and the black king is in the middle. \nHowever, although I would like the positions after 6...Nxd4 and 6...f6, they are still unclear and probably more or less even. ",
        "6... Nge7": "I`m not sure about this one. Now white gets time to play Nf3 and protect d4, and Nb4 is not so much of a threat any more. f6 or Nxd4 was probably better.",
        "7. Nf3 f6": "Why not earlier? Now the bishop does not have to care about d4 any more but can choose between the two nice squares f4 and d2. ",
        "8. Bd2": "After 8.Bf4 I feared 8...g5 and black starts a march on the kingside. 9.Nxg5 fxg5 10.Bxg5 Nxd4 doesn`t appear to be good. ",
        "8... a6": "This move made me wonder, too. Nb5 was no real threat, I think 8...Na5 Qa4  Nec6 was far better. ",
        "9. g3": "I decided to play the bishop to g2, I thought I`d perhaps get the d5-pawn. I didn`t see that g3 is actually dubious due to 9...Bg4! and d4 is in danger. I think the best move would be 10.Qxb7 Bxf3 (...Rb8 Qxa6) 11.exf3 Nxd4 12.0-0-0 Nxf3 13.Bf4 getting the pawn back.",
        "9... Na5": "Although this was not the best move it`s certainly a good idea to get the knight from e7 to c6, giving the Bf8 more space. ",
        "10. Qa4+ Nec6": "What I didn`t notice (and, fortunately, black didn`t, either) is ...b5!, and the queen has to move back to d1, whereas black gets active play. ",
        "11. Nh4": "This move should drive away the black bishop, and, apart from that, after Bg2 the pawn on d5 would be hanging. Actually, it is not so good. 11...b5 would be really annoying, and after 11...Be6 12.Bg2 follows 12...g5 13.Nf3 g4 14.Nh4 b5 15.Qd1 b4 16.Na4 Nxd4.",
        "11... Qd7": "Missing two big chances and finally giving white an advantage.",
        "12. Nxf5 Qxf5 13. Bg2 O-O-O": "White could now continue very well with 14.Rc1 or 14.0-0. However, I went for a miscalculated variation.",
        "14. Nxd5": "?? Just bad.",
        "14... Rxd5 15. e4": "? After 15.Bxd5 black`s very good, however, white can still fight. Now black just has to play Qe6, pinning the pawn, and is a whole piece up. \nI didn`t see that, just thought of the game continuation.",
        "15... Rxd4": "?? exchanging, ",
        "16. Qxd4 Nxd4 17. exf5 Nc4": "A surprise. I had thought of 17...Nc2  18.Ke2 Nxa1 19.Bxa5 Nc2 20.Rc1 Nd4  21.Kd3 Nc6 22.Bxc6 bxc6 23.Rxc6 with an advantage. However, this move gives black some  counterplay despite loosing the exchange.",
        "18. Be4 Nxd2 19. Kxd2 Bb4+ 20. Ke3": "White does hardly have any other choice; 20.Kd3 Rd8",
        "20... Bc5": "This one finally makes the white king start a journey into the corner, where he`s pretty passive. ",
        "21. Kf4 Bd6+ 22. Kg4 g5": "I like this one. 23. fxg6 hxg6 24. Bxg6? is just a draw: 24...Rg8 25.Kh5 Rh8  and white always has to take care of the bishop, and if I don`t take with the bishop I can hardly prevent f5 . After 23.fxg6 hxg6 probably the best is 24.Rad1 f5  25.Kf6 fxe4 26.Kxe6 Re8  which allows black to attack the white king. \nTherefore I decided not to take on g6.",
        "23. h4": "To either immobilize or trade the black pawns.",
        "23... h5+ 24. Kh3 g4+ 25. Kg2": "He didn`t want to trade, but now the pawns can`t move any more. Now I can start trying to create a passed pawn.",
        "25... c5 26. Rad1 Rd8": "Now that my king is unlikely to be attacked because far away from everything happening I need to find some way to show why rooks are superior to minor pieces in the endgame. Therefore they need to go to open files. ",
        "27. b4": "His knight had a good outpost, so I hoped to get rid of it somehow.",
        "27... b6 28. Rd2": "Clearing the first rank - I do still have a second rook.",
        "28... Nb5 29. bxc5 bxc5 30. Rb1 c4": "Of course. Since he is down the exchange he has to make use of this passed pawn. Or at least try to.",
        "31. a4 Nc3": "31...c3 32.Rc2 and there is no fork because c3 is hanging with check: 32..Na3 33.Rxc3+ +-\n",
        "32. Bb7+": "Although it`s risky I decided to continue with more tactical lines. It was perhaps not necessary because I already had an advantage, but I thought it could be difficult to make use of it. Another idea might have been 32.Re1 Nxa4 33.Be8, advancing on the kingside. (33...Bb4 34.Rxd8+) I think 32.Bb7+ is better, in fact, because without his dangerous pawns black can hardly play for more than a draw, although winning might be difficult with all pawns on one side. ",
        "32... Kc7 33. Rc1 Nxa4 34. Rxc4+ Nc5": "After 34...Kxb7 35.Rxa4 black still has a passed pawn but after e.g. 35...Bb7 (because of the thread Rae4, forcing his king to c7) 36.Rxd8 Bxd8 37.f3 I should be faster.",
        "35. Bxa6": "White is clearly better now. ",
        "35... Kb6 36. Bc8 Kc6": "He does not want to exchange more pieces, which is probably rather sensible.",
        "37. Be6 Kb5 38. Rcd4": "Forcing him to an even more passive position. ",
        "38... Kc6": "38...Nb7 seems better to me although it hardly matters anymore.",
        "39. Bf7": "Going for the kingside. ",
        "39... Nb7": "Now this move just turns out to be the final mistake in a lost position.",
        "40. Bd5+": "Winning a piece because the king cannot protect b7 and d6 at the same time, so black resigned. Although far from faultlessly played by both sides, I enjoyed this game very much and do even think it is interesting. Anyway, thanks for reading. "
    },
    "url": "https://gameknot.com/annotation.pl/neither-faultless-nor-boring-qg?gm=21806",
    "gameName": "Neither faultless nor boring - QG",
    "players": "archaeopteryx (1348) vs. pianoadam (1200)",
    "opening": "QGD (D06), Grau (Sahovic) defence"
}