{
    "moves": {
        "1. e4": "I always wonder if there will be a day when I have the courage to play 1.d4.",
        "1... e6": "French.",
        "2. d4": "Go for the center whenever possible...",
        "2... d5 3. Nc3": "Defends and develops at the same time.",
        "3... Bb4": "Nice pin, trying to win a pawn.",
        "4. e5": "Closing the position and saving the pawn temporarily.",
        "4... c5 5. Nf3 h6": "Preventing the knight to go to g5.",
        "6. Bd2": "Not avoiding an exchange but unpinning the knight on c3.",
        "6... cxd4 7. Nxd4 Bxc3 8. Bxc3 a6": "Now that the dark-squared bishop is gone for black, it's very important to stop the knight from going to b5 and then a nasty Nd6 .",
        "9. Bd3 Ne7": "f6 is not available for the black knight, so this would be plan B for developing that knight.",
        "10. O-O O-O 11. Qg4": "I was not sure about this move. I probably made it as a waiting move.",
        "11... Nbc6": "Forcing white's knight to make a decision or the e pawn will be gone.",
        "12. Nxc6 Nxc6": "White has now to anticipate the threat ...d4",
        "13. f4": "Defends the e pawn and prepares for an eventual opening of the f file.",
        "13... a5 14. Bd2": "This might look like a mistake from white, but this will turn into a tricky position soon.",
        "14... Qb6+": "Winning the pawn on b2.",
        "15. Kh1 Qxb2 16. Rab1": "I'm not sure why I'm giving away those pawns...",
        "16... Qxa2 17. Rbd1": "The plan here was to move that rook from danger, since I was planning to bring my other rook to f3 and eventually to g3 or h3.",
        "17... f5": "I wasn't expecting this move (not sure if it's good or bad).",
        "18. Qh4": "If I go with 18.Qg6, then 18...Ne7 it's annoying and loses a tempo for white.",
        "18... Nd4": "?? The queen can now be trapped and white can win the exchange, a rook for the black queen!",
        "19. Rda1": "The black queen will be gone! ...right?",
        "19... Nf3": "!? Black realizes that his queen is about to be trapped! So black decides that it's better to lose the knight rather than losing the queen.",
        "20. gxf3": "Not with the rook! As that would lose the exchange with 20...Qxa1 ",
        "20... Qb2 21. Rfg1": "Threatening with 22.Qxh6.",
        "21... Qd4": "Black totally ignores it.",
        "22. Qxh6": "Threatening with mate in one.",
        "22... Rf7 23. Raf1 Kf8": "?? This move sealed black's fate.",
        "24. Qh8+ Ke7": "There's no other choice. This loses the g pawn for black and keeps the attack for white.",
        "25. Rxg7 b6": "A futile attempt to bring the other rook to defend with a Bb7.",
        "26. Rxf7+": "Attack continues mercilessly...",
        "26... Kxf7 27. Qf6+ Ke8 28. Bb5+ Bd7 29. Qxe6+": "Exploiting every weakness to finish the job.",
        "29... Kf8 30. Bxd7": "This will be the only non-check move from white. Black's fate is still imminent.",
        "30... Qc4 31. Qf6+": "Mate in 3... I mean... mate in 2 and a half... ",
        "31... Kg8 32. Rg1+ Kh7 33. Bxf5#": "So may options to checkmate: 33.Qg7#, 33.Qh4#... This was a nice game, which secured me at least a fourth place on this mini-tourney."
    },
    "url": "https://gameknot.com/annotation.pl/nemesis-saves-his-queen-tourney-9?gm=18311",
    "gameName": "Nemesis saves his Queen (Tourney #9)",
    "players": "sergeidave (1547) vs. nemesis1010 (1430)",
    "opening": "French (C17), Winawer, advance variation"
}