{
    "moves": {
        "1. d4": "This my first attempt to annotate a game, I would be interested in hearing some deeper analysis from some more accomplished players. Development is basically even until move 20  and 21 where white blundered twice in a row.",
        "1... d5": "Normal development.",
        "2. Nf3 Nc6 3. e3 Bg4": "Pins the knight in preparation for e5.",
        "4. Nbd2": "Provides replacement if I take the knight.",
        "4... e5": "Attack and attempts to wrest control of the center.",
        "5. dxe5 Nxe5 6. Be2": "Breaks the pin so eliminate the annoying knight.",
        "6... Bxf3 7. Nxf3": "Attacks my undefended knight",
        "7... Nxf3+": "Fine",
        "8. Bxf3 Nf6": "Protect my stake in the center while continuing development.",
        "9. O-O Bc5": "Prepare to castle",
        "10. b3": "Preparing to fianchetto the queenside bishop.",
        "10... O-O 11. Bb2 c6 12. a4": "Preparing a queenside advance.",
        "12... a5": "Defending the bishop from b5",
        "13. Qd3": "Attacks the h2 square.",
        "13... Qd6": "Connect the rooks",
        "14. Rad1 Rfe8 15. Rfe1 Re6 16. h4 Bb6": "When he moved his h pawn I realized the h2 square was underdefended.",
        "17. h5": "Threatening to tear open my pawn structure.",
        "17... Bc7": "I can attack sooner.",
        "18. g3": "Bummer, he saw that coming.",
        "18... h6": "Stop the advancing pawn.",
        "19. Kg2 Rae8": "Threatening to march down the e-file.",
        "20. Reh1": "?? The pawn on f2 is overextended. This will cost white at least a pawn",
        "20... Re6xe3": "f2xR leaves g3 defended once and attacked twice. QxR fares no better after... RxQ,\nFxR still leaves g underdefended.",
        "21. fxe3": "And white has no defense.",
        "21... Qxg3+": "Spring the trap.",
        "22. Kf1": "only legal move",
        "22... Qxf3+": "I have evened up in material and have destroyed white's defenses",
        "23. Ke1": "kg8 fares no better after Ng5 threatening Qf7#",
        "23... Qxh1+": "Wins a whole rook, Rxe6 works less well because white's best play gives me a queen and two pieces against two rooks and a biship in the end game.",
        "24. Qf1": "Attempting to exchange queens to blunt the attack.",
        "24... Qxh5": "A pawn for free, I could not play Rxe6 because there's no good follow-up.",
        "25. Kd2 Ng4": "Threatening to fork queen and rook with Nxe6. White's best move here is probably Qh8, trying to blunt the attack by exchanging queens.",
        "26. Qe2": "Should have seen that a fork of rook and queen wasn't my only threat.",
        "26... Rxe3": " I don't have to take with the knight. I'll happily trade a rook and a knight for a queen (and that may have been white's best move).",
        "27. Qg2": "Protect the queen.",
        "27... Bf4": "But the best possible outcome is the loss of a rook after Rh8 RH3 , K moves, RxR, but that's the only way to save the queen.",
        "28. Kc1": "The only way to avoid mate, but it wouldn't take a rocket scientist to see the next move.",
        "28... Rg3+": "white resigns. "
    },
    "url": "https://gameknot.com/annotation.pl/never-neglect-your-defenses?gm=1940",
    "gameName": "Never neglect your defenses.",
    "players": "jean_valjean (1459) vs. gyurkovitz (1257)",
    "opening": "Queen's pawn game, Chigorin variation (D02)"
}