{
    "moves": {
        "1. e4": "\n",
        "1... e5": "\n",
        "2. Nf3 Nf6": "It all started here . The petroff defence. Just boring opening. and usually leads to drawn and dull game. I was already in bad mood.",
        "3. Nxe5 Qe7": "This line of petroff is not familliar but I have seen it before. Usually continues 3.d6 Nf3  4.Nxe4 and my favourite was the open game that follows with ...Nc3 5.Nxc3 etc ",
        "4. Nf3": "Alternative variation: [Stockfish 9 64 POPCNT:] 4. d4 d6 5. Nf3 Qxe4+ 6. Be2 Bf5 7. c4 Qc2 8. O-O Qxd1 9. Bxd1 Nc6 10. Re1+ Be7 11. d5 Nb4 12. Nd4 Bg6 13. Re3 h5 14. f4 Ng4 15. Bxg4 hxg4 16. f5 Bh7 17. Bd2 Na6 18. Nc3 Kd7 [1.06/21]\n",
        "4... Nc6": "surprised me . I expected 4...Nxe4 or 4...Qxe4 and continuewith 5.Be2\n",
        "5. d3": "Yeah why not keep the pawn. What is wrong with that? Prove me wrong.\n",
        "5... d5": "Oh yeah . Opening theories huh. This moment I thought perhaps my opponent knows this line so well. So I thought trying to hang on the extra pawn is what my opponent is prepared for . So I decided to change course and to just give it up and continue rather with my development.\n",
        "6. Be2": "\n",
        "6... dxe4 7. dxe4": "0.31/19\n",
        "7... Bd7": "\n",
        "8. Nc3": "\n",
        "8... O-O-O": "Opposit castling. Ibelieve from here on the game is going to be lively. ",
        "9. Bd2": "Post mortem analysis  pointed out that 9.Bd3 would still have shielded my queen from a possible  discovered attack by Rd8  and protect the extra e4 pawn. I was just  rigidly following my earlier decision to just give up pawn. And also so called \" Never move a piece twice in opening \" rule. But sometimes it is good to evaluate current position and be flexible.  Because if now  Bd3 and I can not see any Black's counter attack and I will simply be up a pawn. \n",
        "9... Nxe4": "Gone baby gone!!!\n",
        "10. Nxe4": "\n",
        "10... Qxe4": "\n",
        "11. O-O": "\n",
        "11... Bd6": "This looked threatening for me\n",
        "12. Bd3": "Chasing away the queen and gaining tempo\n",
        "12... Qd5": "\n",
        "13. Re1": "\n",
        "13... Rhe8": "\n",
        "14. Bc3": "Giving my Bishops splendid positions. But I still feel black is better.\n",
        "14... Bg4": "This really spooked me. It really suffocated me. Black is doing well and I don't seem to have a game plan. And I had enough. So I decided to shake things up. I am playing white and black has easily equalised and now dominating. No way!\n",
        "15. Be4": "Let the fire works begin!! Now there are many lines which had to be seen! And I did not see all of them. I just see a couple of variations and I thought I will be OK. I admit when I made this move  a bit carelessly. I am tired and just want to be over with.  \n\nLets see the  variations. \na) 15...Rxe4 16.Qxd5 Rxe1+17.Rxe1 Bxh2 18.Nxh2 Rxd5 19.Nxg4 I will be a bishop up .So my bet here was on Nxg4 which could have easily been overlooked by my opponent\nbut I  overlooked myself the best reply \nb) 15...Bxh2+ 16.Kxh2(not taking the bishop leads to worse position) ...Qh5+17.Kg1 Rxd1 18.Raxd1 would be the BEST LINE for black in which case I will have a rook and bishop for my queen + a pawn \n\n\n",
        "15... Qh5": "This is still a good move by black. Now I realize that I have to depart with my queen. Other alternatives I see would lead to mate. If I retreat the Queen Bxf3!! is too strong. So I considered to resign. \nBut then I thought in exchange for my queen I get Bishop and Rook . And I don't see a quick mate insight. So I decided to play on.  \n",
        "16. h3": "Reason why 15... Qh5 is inferior is because of the text move . Now there is no Bxh2. So I keep my h pawn. And the proves to be decisive in the outcome of the game.",
        "16... Bh2+": "\n",
        "17. Kxh2": "\n",
        "17... Rxd1": "\n",
        "18. Raxd1": "Obviously not Rexd1 \n",
        "18... Bd7": "According to the engines this is a dead draw.\nHere blacks queen is cornered by its own pawns f7 g7  and h7, best would be f6 as it defends g7 and also prepares exit square for the queen on f7.",
        "19. Bxg7": "Best was  19. Rd5 Qh6 20. Bf5 Be6 21. Bd2 Qf6 22. Bc3 Qh6  which engines gave dead draw.\nBut in the actual game I did not see that idea at all . I just went for pawn grabbing which engines don't like for a beautiful tactical reason.\n\nAfter this move I was on the back foot pretty much throughout the game. The ball was on my opponents side. But his advantage was not that big either\n",
        "19... f5": "Here Black missed 19... Rxe4 20. Rxe4 Qg6 forking my R and B \n",
        "20. Bd5": "\n",
        "20... Rxe1": "\n",
        "21. Rxe1 Qg6": "\n",
        "22. Be5": "Better was  22. Bf8 Qf6 23. Ba3 Nd4 24. Re7 Nxf3+ 25. Bxf3 h6 26. Bxb7+ Kxb7 27. Rxd7 Qe5+ 28. Kg1 Qe1+  but still a draw\n",
        "22... Nxe5": "\n",
        "23. Nxe5": "\n",
        "23... Qd6": "\n",
        "24. Bb3": "Here c4 was better as allowing Qd2 is problematic ",
        "24... Qd2": "\n",
        "25. Nd3": "I thought it can be defended this way but not the right way to defend.\n",
        "25... Bb5": "Now a question on how to parry Bxd3 and subsequent pawns losses\n",
        "26. Be6+": "I want to take f5 pawn and have pawn majority on king side but?",
        "26... Kd8": "\n",
        "27. Re3": "\n",
        "27... Qxc2": "Now Bxd3 is the threat\n",
        "28. Bxf5": "I defended it by Bxf5 but this was  not so sound\n",
        "28... Qa4": "Now Black completely missed his advantage. I don't know if it was winning or not . \nThe best move was c5 and I do not have good reply for c4 move. But now suddenly worst is over and even I can hope for more considering my pawns majority on the king side\n",
        "29. Bxh7": "I think Black must have been sweating by now.\n",
        "29... Bxd3": "\n",
        "30. Rxd3+": "\n",
        "30... Ke7": "\n",
        "31. Re3+": "\n",
        "31... Kd6 32. Bb1 c6 33. g4": "\n",
        "33... Kc7 34. Rg3": "\n",
        "34... Qd4": "\n",
        "35. Rg2": "\n",
        "35... Qf4+": "\n",
        "36. Kh1 Qc1+": "\n",
        "37. Rg1 Qxb2": "\n",
        "38. f3": "\n",
        "38... Qf2": "\n",
        "39. Be4": "\n",
        "39... Qh4": "\n",
        "40. Kh2": "\n",
        "40... Qg5 41. Kg3": "\n",
        "41... Qe5+": "\n",
        "42. Kh4 Qh8+": "\n",
        "43. Kg3": "Draw agreed. I was very much satisfied with the result and I get first place too thanks for the half point earned in this game. \n"
    },
    "url": "https://gameknot.com/annotation.pl/never-resign-too-early?gm=66156",
    "gameName": "Never Resign Too Early",
    "players": "Gotes (1670) vs. Juvonen Aleksi (1680)",
    "opening": "Petrov (C42), French attack"
}