{
    "moves": {
        "1. e4": "Comments are from Leontxo García, so I am violating copyright, but I hope he won't sue me!",
        "1... c5 2. Nf3 d6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 g6": "The game shows a novelty by black in Dragon Sicilian. ",
        "6. Be3 Bg7 7. f3 Nc6 8. Qd2 O-O 9. O-O-O Bd7 10. g4 Rc8 11. h4 Ne5 12. h5 Qa5 13. Nb3 Qc7 14. Be2 b5": "All standard stuff till here. ",
        "15. Kb1": "Leontxo says: \"! After 15. Nxb5?, BxN, 16. BxB, Nxf3, 17. Qe2, Nxg4! black will get the most of the pressure over c2\". I say black's position looks promising. Something must be taken as wrong in white's attacking scheme. It looked suspicious the bishop outcome in e2, and the assumption that attacking was just to push the pawns up (against a fiachetto? it is ok only when you are ready to sac in g6, or something like that...)",
        "15... Nc4 16. Bxc4 bxc4 17. Nd4 Rcb8": "A direct strike over the king, supported by c4 pawn, that proves to be very strong. White is already defending. Note that the rook move blocks Nb5, with the intention to try to annoy or exchanging some minor pieces. But white chooses another plan for defending, and again it proves to be any good. ",
        "18. Ka1": "Leontxo says: \"Game proves this plan to be slow and wrong; it looks much better 18. Bh6, to accellerate white's attack)\"",
        "18... Qb7 19. Rdb1 Rfc8": "Leontxo says: \"Novelty, better than the known 19... e5\".",
        "20. Nde2": "White reinforces Nc3, but I wonder if he had something to fear now. Not e5?, self-blocking the bishop's diagonal. The problem is that white doesn't have any way to block the Rf8 to enter into the fray. Another idea could have been hxg6 (now that the rook is no longer in f), followed by Bh6, with an eye on the sac Nf5, to open the black king to the rook's action - if time allows it. Leontxo comments this move \"?!\".",
        "20... Rc6 21. Nf4": "Trying to reach d5, maybe, but this is pointless. Leontxo says: \"More solid is 21. a3, Ra6, 22. Bd4\". ",
        "21... Ra6": "Leontxo says: \"Be careful! There are very hidden deadly threats.\". He refers to a knight or bishop sac in order to exploit the firepower on b2, which in fact happens later. Leontxo says it on the next move, but I copy it here in behalf of a better sight: \"The deadly trap: 22. hxg6?, Nxe4!!, 23. fxN, Rxa2+!! and mate in two. If: 22. a3?, Bxg4!, fxB, 23. Nxe4, 24. Nxe4, Rxa3#\". Nice, isn't it? Now, I would say that after 22. hxg6?, Nxe4!!, white should try 23. gxf7+, and if Kxf7, 24. Qd5+, exchanging queens and releasing some of the pressure. Black can go 23... Kf8, and white 24. Qd5 all the same. But I cannot say if it saves white. ",
        "22. Qc1": "Nevertheless, black finds his way to victory with a difficult-to-see sac.",
        "22... Bxg4": "Leontxo says: \"!!\" :-)",
        "23. fxg4": "Seeing the following, one can suppose white should have not taken the bishop, but it is difficult to find another move that shields white against the powerful black battery. ",
        "23... Nxe4": "Leontxo says: \"if 24. Nxe4?, Rxa2+, 25. Kxa2, Qa6#\"",
        "24. Nfe2": "This proves Nf4 was a loss of tempo. ",
        "24... Qb4": "This sounds a little slow, but white is blocked. Leontxo says: \"If 25. Rd1, NxN, 26. NxNc3, BxN, 27. bxB, Qxc3+, 28. Rb2, RxR, 29. Qxb2, QxBe3, with decisive advantage\". Qb8+ or h6 don't save white, since f6 defends everything.",
        "25. hxg6": "Leontxo says: \"? But white had a hidden resource with 25. h6!!, whose main idea is that after the previous line, white could give mate with Qb8#. The best line seems to be: 25... Nxc3, 26. bxN, Bxc3+, 27. NxB, Qxc3+, 28. Rb2, f6, 29. Bf2, Kf7, and the black pawns whort more than the bishop\". ",
        "25... fxg6 26. Rf1": "It gives white again the mate threat with Qb8+. Leontxo says, \"Not falling in the trap 26... NxNc3?, 27. NxNc3, BxNc3, 28. bxBc3, Qxc3+, 29. Rb2, RxRb2?, 30. QxRb2, QxBe3, 31. Qb8+ and mate.\"",
        "26... Qa5": "Renewed attack, this time on a2. White has not anymore Qb8+, and no tempo to defend a2, so he must play...",
        "27. a3 Nxc3": "The knight cannot be taken. If 28. NxN, BxN, and if Nd4, NxR provides black with overwhelming advantage... it is correct? :-) ...and white resigned here. Either if white could have saved, it seems that this novelty puts a lot of pressure over white queenside castling, putting a question mark over all the scheme of white's attack. The Sicilian is endless... :-)"
    },
    "url": "https://gameknot.com/annotation.pl/new-black-attack-in-dragon-sicilian?gm=39772",
    "gameName": "New black attack in Dragon Sicilian",
    "players": "S. Vaibhav (2430) vs. S. Williams (2520)",
    "opening": "Sicilian (B75), dragon, Yugoslav attack"
}