{
    "moves": {
        "1. e4": "Hi everyone!\n\nMaster Chrisobee kindly invited me to attend his team's chessic New Year's Party tournament.  Yours truly somehow manages to join in the fun by making an absolute meal of a victory against my Class C opponent, Ed.  Ed did play very well all the way through to ensure that I did make heavy weather of such a victory.  In fact I think he was very unfortunate to lose this game but his speculative piece sac in the middlegame to try and checkmate Henry did not pay off.  So, how did I manage to do this?  Well, here is the Gameknot Analysis as follows:- http://gameknot.com/analyze-board.pl?bd=17135473&fb=1&rnd=0.3426624133135317.  As you can see from the analysis, there is plenty of yellow my side of the board!!  In response to my opponent's e4 I decided to play the French Defense.  Since being absolutely canned by my master buddy Lighttotheright in this opening in a training game I have not played this opening very much in a rated game, particularly with 18 or 19 rating points at stake if I mess up here!  But I take my courage in both hands and thankfully I was eventually rewarded, but not until the Wicked Witch of the West gave Henry a few scares!  So, here we go ......",
        "1... e6 2. d4 d5 3. Nc3": "3. Nc3 - the Tarrasch Defense.  Such play can sometimes lead to the Witch putting herself on g4, threatening Qxg7 to restrict my kingside play.  Thankfully she does not go there until Move 14, and that is after I have developed a few pieces and Henry has gone kingside.",
        "3... Bb4 4. Bd2 Nc6 5. Bb5 Bd7 6. Bxc6 Bxc6": "6. ..... Bxc6 - some rapid development on both sides and a trade off of B and Kt.",
        "7. e5": "7. e5 - cramp.",
        "7... Ne7 8. a3 Ba5 9. Nf3 h6": "9. .... h6 - the usual enemy Bishop on knight and queen pin preventative.",
        "10. O-O O-O 11. b4 Bb6 12. Be3 Be8": "12. ...... Be6 - white appears to have the better of it here, a lot of superior mobility.  Can he make this count?  I hope not - remember, I have 18 points to lose here!",
        "13. Nh4 Nc6 14. Qg4": "14. Qg4 - uh-oh!  Here comes the Wicked Witch of the West and the threat of Bxh6 winning the exchange plus a pawn due to Henry being in Old Matey's shadow.",
        "14... Kh7": "14. ..... Kh7 - Henry anticipates this and gets out of the pin.  Henry also clears the decks for a move such as Rg8 lining up against the Witch.",
        "15. Ne2 f5 16. Qg3": "16. Qg3?! - this move drops a piece for two pawns but it does leave Henry dangerously exposed and there is still the fear of Old Matey making another appearance.",
        "16... g5 17. Nf3 f4": "17. ...... f4 - here it is, a pawn fork, but again, can I get away with leaving Henry soooo exposed?  We shall see.",
        "18. Bxf4 gxf4 19. Nxf4 Bf7 20. Nh4": "20. Nh4 - white's pieces come swarming in, can Henry survive this?  I decided to grab a pawn.",
        "20... Nxd4 21. Qd3+ Nf5 22. Nxf5 exf5 23. Qxf5+ Kg7 24. Qg4+ Kh8 25. e6": "25. e6 - this little pawn becomes a pain in the absolute you know where for many moves to come!  Right now, though, Henry is in dire need of an extra hose and doublet never mind those medieval stockings!",
        "25... Be8 26. Rfe1": "26. Rfe1 - now a white rook tries to join in the attack.  Glenda now gives up her life for Henry's by taking the Witch along with her.",
        "26... Qg5 27. Qxg5 hxg5 28. Nxd5 Bxf2+ 29. Kh1 Bxe1 30. Rxe1": "30. Rxe1 - now, let's take stock.  Suddenly Henry is no longer in Old Matey's shadow thanks to the disappearance of the two queens.  However, there is a little matter of the pawn on e6 threatening to orchestrate the appearance of the Wicked Witch of the West.  Firstly though I decided to save my c7 pawn.",
        "30... c6 31. e7 Rf2": "31. ..... Rf2 - As the pawn on e7 is contained for now, I decided to give my opponent a bone in the throat.",
        "32. Nc7 Rc8 33. Ne6 Rxc2": "33. .... Rxc2 - might as well increase my material advantage, that e7 pawn is still not going anywhere.",
        "34. Nxg5 Rc7 35. h4 Rd7 36. Nf3 Rd3 37. Re6 Kg7": "37. .... Kg7 - Henry decides to help in coralling the passed pawn on e7.  Henry must be very wary of knight forks and castle fire however.",
        "38. h5 Bxh5": "38. .... Bxh5 - I am prepared to give up Fou Leblanc just to get rid of that e pawn.  I will be still 2 material points ahead, enough to force a win in the endgame.",
        "39. Ne1": "39. Ne1 - a knight fork but there is a way out, with a ......",
        "39... Rc1": "39 ...... Rc1 - ...... PIN!!",
        "40. Kh2 Rxa3": "40. .... Rxa3 - gobble, gobble, now I am the equivalent of a whole rook ahead but that white pawn on e7 keeps the WK upright.",
        "41. g3 Rcc3 42. Kh3 Rcxg3+": "42. ..... Rxg3+ - another white pawn drops.",
        "43. Kh4 Be8 44. Nc2 Rgh3+ 45. Kg5 Rag3+": "45. .... Rag3+ - the black rooks chase the WK about but alas, they cannot weave a mating net around the WK.",
        "46. Kf5 Rh6": "46. .... Rh6 - this move either forces a rook trade or a retreat of the WR.",
        "47. Re4 Rf6+ 48. Ke5 Kf7": "48. ..... Kf7 - Henry moves to within touching distance of the pawn on e7, that pawn isn't going to survive for very much longer.",
        "49. Kd4 Re6": "49. ..... Re6 - indeed, this move ensures that the p(r)awn on e7 falls two moves down the line, Henry will have the honour of tucking in to it.  White knows this and he finally topples his own king.   Wheeew and double wheeeew!!  Hopefully I will have a few more games to annotate but until then I hope you are all enjoying your Easter Hols.  Until then, bye for now - Joanne"
    },
    "url": "https://gameknot.com/annotation.pl/new-year-lets-party-jo-makes-a-meal-of-it?gm=44133",
    "gameName": "New Year - Let's party :) Jo makes a meal of it!",
    "players": "yorga (1425) vs. jstevens1 (1847)",
    "opening": "French (C15), Winawer, fingerslip variation"
}