{
    "moves": {
        "1. b3": "We have been playing this thematic opening for a while in a mini tournament. It has some different names, but being a Dane, I know it as the \"Baby Orangutang\" - a joke from GM Larsen. Big players like Fischer has also tried it out with big succes.",
        "1... c5 2. Bb2 Nf6 3. f4": "Black has chosen not to play e5 in this case, and then I always opt for the Bird Opening, which I have played for many years. The strategy is very simple: Fight for control of e5 and keep everything else flexible. The Bishop on b2 can really be a monster during a game like this.",
        "3... d5": "A natural response. Black tries to take control of the center with his pawns.",
        "4. e3 Nc6 5. Nf3 a6": "Avoiding the unpleasant 6. Bb5 and also building up on the Queen side. Then again: I have always been very confident with this kind of Bird positions.",
        "6. g3": "White still controls e5, and the Bishop has to go to \"fianchetto\" to g2.",
        "6... e6 7. Bg2 Be7 8. O-O O-O": "According to the new - and great! - computer analysis on GK, Black is a bit better here. I do not agree. White has a lot of options, and the Black Bishop on c8 looks like dead meat behind his own Pawns.",
        "9. Qe2": "Preparing the push of Pawn to e4.",
        "9... b5": "Blacks best chances are on the Q-side.",
        "10. d3 Bb7 11. Nbd2": "After 11 moves, White reaches the typical Bird set up. Black has nothing to fear though - but it is a matter who likes this kind of middle games best. The next move seemed a bit strange to me.",
        "11... Re8 12. Ne5 Qc7 13. c4": "White still has total control of e5, so it is time to challenge the nice placed Black Pawns. The risk is that d3 and e3 can become targets.",
        "13... dxc4 14. bxc4 b4 15. Ng4 Red8": "A very questionable move by Black. Now he will get a weak position around his King, which will prove fatal for the game. After 15. - Nxg4 the game is still level.",
        "16. Nxf6+ Bxf6 17. Bxf6 gxf6 18. Ne4 Qe7 19. f5": "Another move the computer did not like, but fortunately you are allowed to play your own game with the risk of making mistakes. Keep it that way :)",
        "19... e5 20. Qg4+ Kh8 21. Qh4 Kg7": "Probably inviting for a perpetual after 22. Qg4+, but White has good reasons to play on and a little tactical trick...",
        "22. Rad1 Rd7 23. Qg5+ fxg5 24. f6+ Kg6 25. fxe7 Nxe7 26. Rf6+": "Not the best move, but I always learned that a check to the King could make your opponent making mistakes. Simply 26. Nxc5 would give White an easy endgame. ",
        "26... Kh5": "The final blunder. After 26. - Kg7, White would still have the advantage, but Black has a good chance to save the game. Now it is mate in 4, and you are welcome to find it if you wish. The next move leads directly to it. Hope you enjoyed it and play the Bird sometime.",
        "27. g4+": ""
    },
    "url": "https://gameknot.com/annotation.pl/nimzovich-larsen-attack-1-b3?gm=31047",
    "gameName": "Nimzovich-Larsen Attack (1. b3)",
    "players": "ybrevo (2044) vs. flatlander (1857)",
    "opening": "Nimzovich-Larsen attack (A01), English variation"
}