{
    "moves": {
        "1. d4 Nf6 2. c4 e6 3. Nc3 Bb4": "The Nimzo-Indian, a defence I've rarely played. But I should; it's direct - Black gets his pieces out quickly to enable fast castling, and often doubles White's pawns.",
        "4. a3": "White can play 4.Qc2 here to avoid the doubled pawns...",
        "4... Bxc3+ 5. bxc3": "But in this line White accepts the doubled pawns for a strong pawn centre. It also means Black has no dark-squared Bishop.",
        "5... d5": "Black must counter quickly in the centre.",
        "6. c5": "Now my opponent has gone a little astray, but not disastrously so. It's just that advancing the pawn is rather against the spirit of the variation, I would have thought. White's strength is in those pawns, and more usual is 6.e3 or even 6.f3, which I see was the most popular move in the database. Already there are only nine games with this position.",
        "6... Nc6": "Now my move is rather against the idea of the opening - swift castling. Instead I develop a piece and in fact don't castle K-side at all.",
        "7. Bg5": "The lack of Black's dark-squared Bishop is immediately exploited.",
        "7... h6": "So the attacker must be driven away.",
        "8. Bh4 g5": "And again...",
        "9. Bg3 Ne4": "Black has really seized the initiative now.",
        "10. Qd3": "White really doesn't want a second set of doubled pawns, and this is the only way to avoid them.",
        "10... f5": "A little drastic, but threatening to cut off the Bishop.",
        "11. h3 f4": "Instead it's driven back.",
        "12. Bh2": "At this point we are a few moves out of the databse and I'm unsure of the best continuation. I feel like I'm on top...",
        "12... e5": "And I'm sure White won't want to take this pawn and saddle himself with pawns that are doubles and isolated.",
        "13. f3": "He can, however, drive away my Knight quite easily.",
        "13... Nf6": "I'm eyeing that open diagonal against the KIng, but I can't see how to exploit it.",
        "14. e4": "White can actually exploit the fact that I didn't castle when I had the opportunity, and play 14.Qg6+, preventing castling altogether. Instead he tries to challenge in the centre and free his Bishop. But this just loses a pawn.",
        "14... dxe4 15. fxe4 exd4 16. cxd4 Nxd4": "16...Qxd4 is better, since White is probably obliged to exchange Queens, but I feel like the momentum is with me...",
        "17. Rd1": "White can accomplish what he wants to accomplish by castling Q-side, but probably didn't fancy all that space. In the end, his centrally placed King was his undoing. Curiously, I hadn't even spotted this, which rather forces me back...",
        "17... Ne6 18. Qb5+": "Instead of exchanging, White counter-attacks, and suddenly my early advantage seems to be withering away, a frequent experience against this opponent.",
        "18... Bd7": "I have to block the check and Queen threat, and if White snaps up my b-pawn then 19...Nxc4 wins my pawn back.",
        "19. Qb2": "Instead he retreats. Curiously, the analysis suggests giving up a further pawn with 9. c6 bxc6 20. Qe5 Qe7 21. Nf3 Rh7, keeping the pressure on.",
        "19... Nxc5": "I get greedy. I know this is going to allow 20.e5 but I decide I'll worry about that if White plays it.",
        "20. e5": "He does, and now I worry.",
        "20... Qe7": "This only puts off the problem for one move.",
        "21. Be2": "Now I'm in a dilemma. Trying to save the Knight with something like 21...Ne4 in the hope of counterplay is fraught with danger, since I've only just spotted that the Queen is threatening my undefended Rook, the result of my failing to castle. I have to give up the Knight!",
        "21... O-O-O": "The analysis prefers castling K-side, but that side is so open now I've advanced my pawns I don't fancy it.",
        "22. exf6 Qe3": "This seemed like a move to save me, especially if I can follow up with 23...Ne4, threatening mate. the fact that it happens is due only to my opponent missing the option to force a Queen exchange with 23.Qd4. It's true I get to win the pawn on f6, but it's never going to Queen and the resulting position after 23. Qd4 Qxd4 24. Rxd4 Rhf8 25. Nf3 Rxf6 26. O-O Re8 probably favours White. It must do; the computer says so.",
        "23. f7": "This is really disastrous. That pawn is going nowhere, and White needed to look to his defence.",
        "23... Ne4": "I get to threaten mate as planned. But 23...Ba4 was more dangerous...24. Rd5 Rhf8 25. Qd4 Rxd5 26. Qxe3 fxe3 27. Nf3 Rxf7 puts me well ahead. As it is, I think I have a mating  attack, but it's only in my head.",
        "24. Rd3": "Clearly my opponent thought, and I did, that the Rook had to move to give the King an escape square, and where better to go than to attack the Queen, even if it allows 24...Qf2+ But the only escape was 24. Qd4 Nf2 25. Qxe3 fxe3 26. Rc1 Bc6 27. Ba6 Kb8 28. Bb5 Nxh1 29. Bxc6 bxc6 30. Rxc6 Rhf8 31. Rxc7 and I'm still winning, but haven't won. As it is, mate is forced.",
        "24... Qf2+ 25. Kd1 Ba4+ 26. Kc1 Qe1+": "White could have prolonged the game by interposing his Queen.",
        "27. Rd1 Rxd1+": "But it's mate next move and he resigned. An attack that gave me a kind of spurious satisfaction, in that it only worked because my opponent missed key defensive moves. But it was played quickly in an hour or so!"
    },
    "url": "https://gameknot.com/annotation.pl/nimzo-indian-defence-samisch-variation?gm=62743",
    "gameName": "Nimzo-Indian Defence, Samisch Variation",
    "players": "metcalfe (1807) vs. jimspellman (1803)",
    "opening": "Nimzo-Indian (E24), Saemisch variation"
}