{
    "moves": {
        "1. e4 e5": "The standard Kings pawn opening - nothing too special\n",
        "2. a3": "Already a strange move, which doesn't seem to have any logical sense (other than stopping my bishop from reaching the b4 square, but that isn't really a threat this early in the game, is it?)\n",
        "2... Nf6": "developing, and threatening Nxe4\n",
        "3. d3": "of course, this threat is easily parried, but I would have preferred Nc3 here (still, this move lets White prepare Bg5, if he wishes to)\n",
        "3... Nc6": "Already, my knight has its eyes set on the d4 square, but it can't do that yet because of c3.\n",
        "4. Ne2": "Developing, but the problem with this is that it'd be slow development; not that White would want to move the knight, but the only reasonable move now for it is Ng3 because of my pawn on e5. It does make me forget Nd4 though\n",
        "4... Bc5": "Further developing, plus giving the option to castle kingside. \n",
        "5. h3": "with the same idea of White's second move, only concerning Black's other bishop. Although it's a little more effective than 2.a3 (Bf5 is also impossible) I still think it's a little premature here, since the bishop isn't free yet, but it doesn't really matter in this game...\n",
        "5... d6": "because if White had developed before this move, he would have played h3 now (still, what if Black had castled, or decided to fianchetto his bishop?)\n",
        "6. Nbc3": "also worth considering for White is 6.Bg5\n",
        "6... Be6": "I'm not going to castle yet; instead, I decide to make queenside castling possible as well (I prefer queenside castling, actually, because it tends to make rooks more active)\n",
        "7. Na4": "Obviously looking at Nxc5, which can't be stopped. However, I give this move a ? because it involves moving the knight three times, and since White has not finished developing yet, this is bad!\n",
        "7... Qe7": "since White has decided to neglect development, Black calmly continues his, and opening up queenside developing as an option\n",
        "8. Nxc5": "expected - since White had already started the attack, there's no point in giving up on it\n",
        "8... dxc5 9. Nc3": "That's four knight moves in a row for White! It allows for Be2, then castling, but given White's situation he might have been better off going for queenside castling (Be3, then Qd2, then 0-0-0) which develops a little more (although, admittingly, White's light-square bishop would be horrible in that position) It's not as if White's lost in this position, of course\n",
        "9... O-O-O": "since dxc5 allowed for a half-open d-file, I immediately grab it with development. It also has the benefit of placing the rook on the same file as White's queen\n",
        "10. Be3": "Development, but this brings my attention to the d4 square, and I realise....\n",
        "10... Nd4": "that my knight can now land on that square! White now has to decide whether to capture the knight or let it be (bearing in mind that only the bishop can shift it). Leaving the knight doesn't seem like too good an option, since the d4 square is great for the knight. If white were to take the knight...\n",
        "11. Bxd4 Rxd4": "! Black can do this! I like this move - the trade helps with Black's development, while doing nothing to help White's. If Black had captured with a pawn, it probably wouldn't have made as big as an impact, despite chasing away the knight. \n",
        "12. Nb5": "as it turns out, White decides to move the knight anyway, forking the rook and the a-pawn\n",
        "12... Rd7": "The only logical square for the rook (the d8 square is reserved for the other rook)\n",
        "13. Nxa7+": "I'm always unsure whether its safe to take pawns in this manner, as there has been plenty of examples of this coming back to haunt the attacking player (and example is this game between freddz123 and nuntar; http://gameknot.com/annotation.pl/game-number-11-too-early-for-the-queen-attack?gm=26640) This move, though, turns out to be safe.\n",
        "13... Kb8": "pretty much forced, since Black still wants the d8 square for the rook\n",
        "14. Nb5": "The only move. White's in trouble here because of his backward development, and the fact that his one developed piece, the b5 knight, isn't really threatening anything. The only advantage White has is the fact that he is a pawn up\n",
        "14... Nxe4": "?! Black equalises temporarily, taking advantage of the pin on the d-pawn, but White has a simple reply to this that gets the pawn right back (maybe 14...Rhd8 was better?)\n",
        "15. Qe2": "Breaking the pin, and immediately skewering the knight to the pawn- the knight has to move\n",
        "15... Nf6": "I preferred this move to Nd6, because White would have less pressure after the attack, but when I think about it now, Nd6 could have worked (it was better, in fact); 15...Nd6 16.Qxe5 Nxb5 17.Qxg7 was what I was worried about, thinking during the game that White would gain my h7 pawn as well, but I missed two flaws in that plan; 1) 17...Qe8, which protects everything, or 2) 17...Rhd8, because if 18.Qxh7?? Bf5+! wins the queen\n",
        "16. Qxe5": "what I had also considered before playing 15...Nf6 was how to chase the queen away (I can't move the f-pawn because of my knight) but I didn't need to do that - I could still chase her away...\n",
        "16... Rhd8": "...though I don't do so yet (I don't need to, really). First, I double up my rooks on the d-file. as far as I can see, there isn't anything White can do to break them up\n",
        "17. g3": "preparing to fianchetto the bishop, I assume, but I think better would have been Be2, with 0-0 next move to get the king to safety (The majority of Black's firepower is queenside)\n",
        "17... Rd7d5": "chasing away the queen, and preparing Qd7\n",
        "18. Qe2": "I don't play it straight away, as I immediately see the king and queen on the same file, and my rook who can move onto the file this turn! Turns out the queen is safe enough for now, since the rook won't be protected, but I keep the possibility in mind all the same\n",
        "18... Qd7": "this move achieves two things; it threatens the knight and sets up Alkaline's Gun (that's what it's called, right?) If I could get rid of the d3 pawn (c4, maybe?) I could have a hard-hitting attack\n",
        "19. Nc3": "a good move which forces the rook to move, but much better is 19.c4!, which forces the rook off the d-file altogether\n",
        "19... Rd4": "threatens c4, which White can't take because of Re4, but better was Rd6, threatening a much more destructive 20...Bd5! (also a surer way to win material)\n",
        "20. O-O-O": "White sidesteps the danger and eliminates any chance of pinning the queen. However, there is now a chance of a skewer on the d1-h5 diagonal. At first, I considered a sacrifice with Ng4, but; a) White need not take it, b) it opens up the h-file for White's rook and c) even if White accepts the sacrifice, it would just boil down to an even trade (two pieces for a pawn and a rook)\n",
        "20... g5": "instead, I hope to play the pawn to g4, which is a much better way of laying the trap\n",
        "21. Bg2": "fianchettoing the bishop, and finally completing White's development. Looking at the board from White's point of view, it actually doesn't look so bad\n",
        "21... g4": "holding out the bait...\n",
        "22. h4": "but White does not take it. Since I don't want to waste my pawn moving to g4...\n",
        "22... h5": "I decide to close up kingside. At this point I notice that White's bishop can go nowhere, although it's on the best diagonal. This is the start of the nature of White's position for the rest of the game (also, because of my g-pawn, White is prevented from a nice tactic which wins a pawn and frees up White's position a bit; 23.Bxb7! Kxb7 24.Qf3+ Kb8 25.Qxf6\n",
        "23. Rhe1": "the rook, however, is not so confined, and comes over to support the queen on the e-file\n",
        "23... b5": "starting a pawn storm on the queenside - I'm not worried about the safety of my king because White can't launch an effective attack\n",
        "24. Bf1": "? White may have seen that the bishop couldn't go anywhere on the long diagonal, but that was hardly any reason to relinquish the pressure on the diagonal. A lot better would have been 24.Qe5!, which wins at least a pawn (24...Nd5 25.Qxh5)\n",
        "24... b4": "! forces the knight back to the b1 square (well, this knight actually came from the g1 square, but you know what I mean :) )\n",
        "25. axb4": "better, it seems, than letting Black follow through with the exchange, but it allows for a nice little tactic later on\n",
        "25... cxb4 26. Nb1": "I'm confident about my game at this point - White hardly has any room left to breathe!\n",
        "26... b3": "looking at breaking up the king's defence, hoping for a promising attack\n",
        "27. c3": "White sidesteps the danger (though the b3 pawn could be a thorn in White's side) I was thinking, after the game, that c4 might have been better, but...\n",
        "27... Qc6": "pins the pawn to the king (White's 24th move comes back to haunt him). If White had played c4, Black could try a bishop (or even rook) sacrifice, depending on what White moves\n",
        "28. Kd2": "?? this move is understandable from White's point of view (what other move is there), and it does threaten the rook, but there are three major problems with this move; a) White has escaped from one pin - but walked right into another! b) The rook can be made safe (and I did consider this in the game) with Nd5, because if 29.cxd4?? 30.Qc2# and c) the d2 square would have been a great square for another piece...\n",
        "28... Re4": "! the queen, for instance. Black's rooks shows their true influence over the game! (This was chosen over Nd5 because, white this move guarantees a comfortable lead, Nf5 does not, if White spots the danger)",
        "29. Bg2": "? a desperation move, hoping to turn an advantage into an exchange, but this only makes a bad situation worse...\n",
        "29... Rxe2+": "because of the extra tempo Black gains with the check. Now White loses the bishop as well!\n",
        "30. Rxe2 Qxg2": "of course\n",
        "31. Na3": "bringing the knight out again, but I would have preferred Re1, doubling the rooks\n",
        "31... Bf5": "Gaining another pawn - White can't defend with Re3 because of Qxf2 (actually, this move justifies White's last move, as it prevents mate) That doesn't matter though, as White resigns at this point. Great game!\n"
    },
    "url": "https://gameknot.com/annotation.pl/no-room-to-breathe?gm=27863",
    "gameName": "No room to breathe!",
    "players": "cripa (1348) vs. x-machine (1264)",
    "opening": "KP (C20), Mengarini's opening"
}