{
    "moves": {
        "1. d4 d5 2. c4 c6 3. Nf3 Nf6 4. Nc3 e6 5. Bg5 h6 6. Bxf6 Qxf6": "The Moscow variation in the Slav defence. White gave up the bishop pair for the sake of faster development and superior control of the center. Thus, he usually enjoys a slight spatial advantage in this line, although black tends to gradually equalize chances with correct play.",
        "7. e3 Nd7 8. Rc1": "There are many options for white here and on the previous move, but a sure-fire way for obtaining opening advantage is quite elusive. Magnus comes up with a rare approach.\n\nThe main line used to be 8.Bd3 dxc4 9.Bxc4 g6 10.0–0 Bg7 11.e4 e5 12.d5 Nb6 13.Bb3 Bg4 and although they could claim a slightest of advantages, white came up on top too few times to be able to call this a refutation of the solid Moscow variation.\n\n\n",
        "8... g6 9. Be2": "putting this bishop to a more restrained position on e2 (rather than d3) is a sign that white would like to enter the Carlsbad pawn structure (more about that in a second).",
        "9... Bg7 10. cxd5": "As expected, Magnus goes for the structure announced by his previous two moves.",
        "10... exd5": "Now we have one of the oldest known typical middle-game pawn structures: Carlsbad pawn structure. For those who may not be familiar with it, it is characterised by 2 pawn chains on both sides of the board as can be seen in the diagrammed position. Needless to say, every strong player needs to know the typical plans for white and black in this type of position as Carlsbad structure can arise from many openings (including Queen’s gambit declined, Nimzo-indian defence, Gruenfeld defence, etc., Torre system and Caro-Kann with colors reversed, etc.) Those plans often stretch well into the middlegame and sometimes as deep as the endgame. Carlsen enjoys slow kinds of positions that usually arise in this structure, while Topalov is not a big fan of them and I doubt that he has had much experience with them as he usually seeks to play more dynamic positions.\n\nThe point of Rc1 can be seen in the variation 10…cxd5 11.Nb5",
        "11. b4": "A trade-mark plan in the Carlsbad is the minority attack. In a nutshell, white’s a and b pawns attack three black pawns on the queenside (thus the name “minority” attack), aiming to create pawn weaknesses that white would later like to exploit with his pieces. A famous example of this plan in a very similar position is game Seirawan-Kasparov, 1986. that the ex-World champion lost!",
        "11... a6 12. a4 O-O 13. b5 axb5 14. axb5": "White achieved his plan relatively effortlessly. The pawn on c6 is currently immobile due to the weakness of d5 pawn.",
        "14... Qd6 15. O-O Nb6 16. Qb3": "[Carlsen seeks to fully employ his pieces before determining the pawn structure on the queenside.]\n\nIn that sense, 16.bxc6 bxc6 (intending to create a backward pawn on c6) would be premature. Black would benefit more from opening of the position.",
        "16... Rb8": "16…c5 is premature as white wins a pawn after 17.dxc5 Qxc5 18.Na4 Qd6 19.Nxb6 Qxb6 20.Qxd5; 16…Ra3 17.Qb2 is rather pointless for black.",
        "17. Nd1": "!? Where most players would automatically play Rfd1, Carlsen becomes creative. The knight is obviously headed towards d3 square via b2. From there, it would control the important c5 square, highlighting the immobility of the backward c6 pawn. The most recent example of this knight manoeuvre in a similar pawn structure could be seen in Carlsen’s brilliant positional win over Levon Aronian in Wijk an Zee this year.",
        "17... Bf5": "! Excellent positional judgement by Topalov in anticipation of the aforementioned plan. The knight on d3 would be stronger than black light-squared bishop, so why not exchange it.",
        "18. Nb2 Rfc8 19. Nd3 Bxd3": "Consistent.\n\n19…Nc4 looks tempting, but effects of such an “active move” are fleeting, while the exchange on d3 is more to the point, positionally speaking. White could continue putting the pressure with 20.Ra1 etc.",
        "20. Qxd3 c5": "! Topalov achieved the desired break, getting rid of the backward c-pawn, so he has roughly equalized.",
        "21. dxc5 Rxc5": "An isolated pawn structure should not bother black as long as he remains active as he is.",
        "22. h4": "! What a great fighter Carlsen is! Even in such “dry” positions, he finds ways to create practical problems to the strongest chess players in the world. Should black play h5 now and weaken his g5 square or allow white to soften his kingside with the same move?",
        "22... Na4": "After a long think, Topalov decides that he will allow weakening of his kingside after h4–h5, gxh5 and deal with the consequences by active counterplay on the queenside. A risky decision, to say the least.\n\n22…h5 was definitely more solid and I don’t see any immediate benefits white would get from 23.Ng5 although it is an achievement for white.",
        "23. h5 Rbc8": "Probably not the most accurate way to seek counterplay.\n\nMore straightforward was  23…Nc3 24.hxg6 Qxg6 25.Qxg6! fxg6 (The point being that after 25…Nxe2+ 26.Kh2 fxg6 the rook on c5 is not defended 27.Rxc5) 26.Bd3 Rbc8 27.Ra1 Kf7 28.Ra7 when white enjoys a slight, or should I use the synonym, “Carlsen” edge in the endgame, but his active pieces promise him very good chances to equalize.",
        "24. Rxc5 Nxc5 25. Qc2": "! Carlsen curbed black’s queenside activity with this calm move and can claim an advantage as in the addition to a potential target on d5, he already has something going on the kingside.",
        "25... gxh5": "Topalov decides that he will at least get something in return for the inevitable positional suffering he will be subjected to by the World champion.",
        "26. Nd4": "Logically aiming for the weakened f5 square.",
        "26... Qg6 27. Nf5": "A critical moment. Carlsen prefers to keep the queens on the board.\n\nThe alternative was the endgame  27.Qf5 Qxf5 28.Nxf5 where black’s multiple pawn weaknesses look juicy. Yet, he seems to be able to hold with 28…Bf8 29.Rc1 (winning the d5 pawn with 29.Rd1 would give black a breather:29…Ne4! 30.Rxd5 Nc3 31.Rd2 Nxe2+ 32.Rxe2 Rc5 with a draw.; as well as 29.Bxh5 Ne4) 29…Rc7! 30.Bxh5 (in case of 30.Bf3 black barely escapes with a draw after 30…Ne6 31.Rxc7 Nxc7 32.b6 Nb5! 33.Bxd5 Nd6 and he can hold the position with opposite colored bishops even being a pawn down.) 30…Ne6 where white could still hold an edge with 31.Rd1 Rc5 32.Be2",
        "27... Bf8 28. Rd1 Qe6 29. Rc1 Nb3": "! Typical Topalov with a sharp eye for tactical solutions. This tactical sequence leads to a queen endgame with good chances of survival for black.\n\nAlternatively, he would be faced with prospects of defending an unpleasant positиon in the middlegame, although black’s activity in the view of 29…Ra8! 30.Bxh5 Ne4 31.Nd4 Qe5 32.Qd1 Ra2 33.Qg4+ Qg5 would be sufficient to hold the position even in such circumstances.",
        "30. Qxc8 Nxc1 31. Qxc1 Qxf5 32. Qc7 Qb1+ 33. Bf1": "It seems like the b7 pawn is lost and Carlsen would cruise to his first victory in the tournament.",
        "33... d4": "! There is no doubt in my mind that Topalov prepared this move as a punchline for the Nb3 combination.",
        "34. exd4": "Forced,\n\nas white can not win after 34.Qxb7 dxe3 35.fxe3 Qe1 36.Qe4 Bd6 with such a weak king.",
        "34... Qd1": "?! Topalov’s determination to keep white bishop outside of the game is understandable as white can not win the game without its help. Yet, the most natural move\n\nwas 34…Qe4 protecting the pawn on b7, attacking the one on d4 and centralizing the queen, all at the same time. None of the possible variations lead to anything for white. For example 35.g3 (35.Bc4 Qe1+ 36.Kh2 Qxf2; 35.Qg3+ Bg7 36.Bc4 h4 37.Qb8+ Bf8; 35.Qd7 h4 36.d5 b6 37.d6 Qf4) 35…h4! a double pawn comes in handy to open up the possibilities of perpetual check against white king! 36.gxh4 Be7 37.Bg2 Qe1+ 38.Kh2 Bxh4 39.Qc8+ Kg7 40.Qg4+ Bg5 41.f4 f5! with an inevitable draw.",
        "35. Qe5": "The most stubborn try.\n\n35.Qxb7 Qxd4 is drawish as the pawn will be blocked on b5. 36.b6 fails to 36…Bc5",
        "35... Bg7 36. Qe8+ Bf8 37. Qd8 Kg7": "?! It is difficult to find the right way in a maze of possibilities, but making the king more vulnerable is rarely a good policy.\n\nIt seems that 37…Qg4 among a few others would be a more precise choice.",
        "38. Qd5": "! Carlsen mercilessly punishes Topalov’s inaccuracy with a quiet move, typical for his style. It proves to be surprisingly difficult to defend the b pawn now.",
        "38... b6 39. Qe5+ Kg8 40. Qf6": "! This is the point. Black can not defend the b-pawn any more. Fortunately, he can win the d-pawn and hope to get enough counterplay against white king.",
        "40... Bg7 41. Qxb6 Bxd4 42. Qxh6": "Now we get a dream endgame “50–50″ scenario for Carlsen where there is fifty percent for draw, should black defend accurately and 50 percent for white to win, should black make a mistake.",
        "42... Qg4": "! Virtually the only move that keeps black in the game. He stops g3 and threatens Qh4.",
        "43. Qd6": "Dealing with the aforementioned threat in the most efficient way.",
        "43... Qd1": "! Again, the best defence. Now discovered attack Bxf2+ is threatening, so white queen has to leave the d-file.",
        "44. Qd8+": "Fortunately for black, the geometry works in his favor in case of 44.Kh2 Qxf1 45.Qxd4 Qxb5 draw.",
        "44... Kh7": "? The only real mistake in the game after which white probably gets a winning position.\n\n44…Kg7 would keep within the famous “50–50″ boundaries.",
        "45. Qc7": "A simple move that refutes Kh7 as taking on f7 and b5–b6 are threatened simultaneously.",
        "45... Kg7 46. b6": "White gained a valuable tempo to push the b-pawn to the brink of promotion.",
        "46... Qg4 47. b7 Qh4": "!",
        "48. g3": "48.b8Q?? Bxf2# would be embarrassing.",
        "48... Qf6": "Clever, but white repels the attacks with",
        "49. Qc2 Qe5 50. Qd3 Ba7": "Topalov managed to block the pawn, but now he is about to just sit and watch Carlsen gradually improve his position until it is winning, which is something he is currently the best at in the world. The problem is not only the dangerous b-pawn, but also weak black pawns on the kingside. If those pawns were on f7 and g6, for instance, black’s drawing chances would be much greater.",
        "51. Qf3 Qf6": "!? Another clever defensive try by Topalov, offering a dubious queen trade.",
        "52. Qe2": "Carlsen says: “Thank you, maybe later”.\n\nIndeed, the opposite-colored bishops endgame is drawn, but only due to the fact that black can force an h-pawn with a wrong bishop: 52.Qxf6+ Kxf6 53.Be2 Kg5 54.Kg2 h4 55.f4+ Kf5! 56.gxh4 Kxf4 and what would normally be a winning position for white is drawn since black can give up his bishop for b-pawn while keeping the king on h8.",
        "52... Qc3 53. Kh2 Qd4 54. Qf3": "Carlsen is improving his position ever so slowly. There is not much black can do about it.",
        "54... Bb8": "He could not find relief in queen exchange any more as now white king is positioned much better on h2 and after 54…Qf6 55.Bg2 Qxf3 56.Bxf3 Kg6 57.Kh3 he can not defend his h-pawn 57…Kg5 58.Be2 Bb8 59.f4+ Kg6 60.Kh4 Bc7 61.Bxh5+ and white is winning since he will be able to force another passed pawn on the g-file.; However, the last attempt to hold the position was 54…h4 55.Kg2 (as 55.Kh3 hxg3 56.Qxg3+ Kf6 57.b8Q Bxb8 58.Qxb8 Qxf2 is drawn.) 55…Bb8",
        "55. Kh3 Bc7 56. Be2": "Carlsen is beginning to measure up black’s weaknesses on f7 and h5. Looks like h5 pawn will not survive much longer.",
        "56... Bb8 57. Bd1": "! It turns out he is interested in the f7 pawn after all!",
        "57... f5": "As usual, Topalov goes all in with a tactical sequence. As it turned out, this was the best practical decision!\n\nA more stubborn defence was 57…Ba7 58.Bb3 Qd7+ 59.Kh2 (59.Kh4!? would be very brave 59…Bb8 60.Kxh5 Bd6 although I am not sure anyone would feel comfortable playing this with Qh3 and Be7 in the air.) 59…Qe7 and white still needs to make the final break.",
        "58. Be2 f4": "58…Qg4+ would allow white to win quite easily 59.Qxg4+! hxg4+ 60.Bxg4 fxg4+ 61.Kxg4 and black is stretched too thin.",
        "59. Qxh5 Qxf2": "This was Topalov’s idea. White can not take the bishop on b8 as checkmate is threatened on g3.\n\n59…fxg3 60.fxg3 would presumably be easily winning for white as any queen exchange would lead to a winning bishops endgame.",
        "60. Qg5+ Kf7": "As Topalov played his 60th move, Carlsen sunk into thought looking for the winning continuation. Unfortunately, he spent all his remaining time, not being aware that there is no increment after move 60 (which was the case in last year’s tournament)! It is difficult to say who was more shocked by this turn of events, Carlsen himself or the spectators around the world who could not believe seeing the result 0–1. Sadly, such an interesting struggle had to finish this way.\n\n\nLeaving the unfortunate fate of this game aside, does white have a win after  60…Kf7 ? He does indeed, but working it out at the board is quite a difficult task, regardless of what many “couch-experts” (with Houdini or Stockfish running on their computer) might say. The right move is 61.Bc4+! (The attempt to attack from the kingside with 61.Bh5+ Ke6 62.Qg8+ Kd7 63.Qc8+ Ke7 64.Qe8+ Kf6 65.Qf8+ fails to bring a full point as the king escapes to the center (An interesting attempt to create a checkmating net with the help of white king is 65.Qc6+ Ke7 66.Kg4!? Qxg3+ 67.Kf5 but black has 67…Qd3+) 65…Ke6 66.Bg4+ Kd5!) 61…Ke8 62.Bb5+ keeping the king away from the central squares 62…Kf7 63.Qf5+ Ke7 64.Qd7+ Kf6 65.Qd8+!  \n\n\nThe key check and the one that might be the toughest one to find in the calculation of a long line. The point is that black king can not step onto e5 due to Qxb8 with check, so it has to stay in the corner. 65…Kf7 (65…Ke6 66.Bc4+ Kf5 (66…Ke5 67.Qxb8+) 67.g4+! is even simpler.) 66.Bc4+ Kg6 67.Qe8+ Kf6 68.Qf8+! using the same idea to keep the king away from e5! 68…Kg5 69.Qg7+ Kf5 70.g4+! This move is essential, otherwise white can not win!  (70.Bd3+ Ke6 leads nowhere.) 70…Ke4 71.Qg6+! Another key queen check preventing king’s run toward the center 71…Kf3 (as 71…Kd4 72.Qb6+ wins the queen!) and now white wins with a study-like queen manoeuvre: 72.Qc6+ Ke3 73.Qc5+ Kf3 74.Qd5+ Ke3 75.Qd3#!  \n\n\nA beautiful winning combination and a beautiful final position, too bad we could not see it happen at the board!"
    },
    "url": "https://gameknot.com/annotation.pl/norway-chess-2015-stavanger-nor?gm=59176",
    "gameName": "Norway Chess 2015 Stavanger Nor",
    "players": "GM Carlson (2876) vs. GM Topalov (2798)",
    "opening": "QGD Slav (D15), 4.Nc3"
}