{
    "moves": {
        "1. b3": "This is a fun opening I've enjoyed playing over the years. Since White has an extra move, he can spend some time fianchettoing (putting his bishop on the long diagonal) on the queenside and not fall behind in development.",
        "1... e5 2. Bb2 Nc6 3. e3": "Now my bishop has an escape, and my knight is headed for f3.",
        "3... Nf6 4. Nf3": "There's one thing about this layout that always bothers me ...",
        "4... e4": "... and Black found it. It's a pain to have black's pawn on e4 and clogging up my development.",
        "5. Nd4 Nxd4 6. Bxd4 Be7 7. Be2": "I continue to develop. You can't play a successful game if you don't use your pieces.\nI'd like to play c4, but when I do, it gets uncomfortable to have a hole on d3. I've tried that before and haven't been as successful, but maybe I need to look at it again ... play c4 so I can put the knight behind the pawn and then play d3 at some point. It's just that what usually will happen is Black will not trade on d3 -- he'll wait until I trade on e4 and then he can put a knight or something on d3 that a pawn can't chase away.",
        "7... c5": "Yeah, in this setup, Black gets to play c5 and d5 and chase my bishop back to b2 and control the center.",
        "8. Bb2 O-O 9. d3 d5 10. Nc3": "This move means I can't challenge the center with c4.\nI'm trying to encourage him to trade on d3, but he won't go for it. His position is stronger with the pawn on e4.",
        "10... Qa5 11. O-O Be6": "That surprised me. i figured he would play Rd8 so if I trade in the middle, his rook will own the only open file.\n  \nWhat do I like about this position?\n... - My bishop on b2 is in an influential position, even though it's currently blocked by my knight.\n... - I feel like I have lots of potential energy and flexibility in my position. My pawns aren't committed to a specific layout, and my pieces are on good squares, ready to attack either side of the board.\n   \nWhat don't I like about my position?\n... - his pawn on e4 makes it hard for me to maneuver.\n... - if the d-file opens up after a trade, he'll put a rook there, I'll have to move my queen, and he may even double his rooks. That'll be a substantial advantage for him.\n \nTo me, that 2nd weakness is my primary concern and what I need to do something about.",
        "12. Qd2": "There's a trap here, but I don't expect him to fall for it. \nI'm threatening to win a pawn by playing Nxe4. He won't be able to take the knight, because I'd play Qxa5 and win his queen. If he takes my queen, I recapture Nxd2 and save my knight. If he retreats, I put the knight back on c3 and g3 and win the pawn.\n \nI expect him to guard the queen with b6 or to retreat the queen to b6 or c7. Then I'll trade pawns and play Rad1. By the time he moves his rook to d8, I can play my queen to c1, and he won't control the d-file. And after the center opens up a little, he'll have two pawns (on e4 and c5) that I can target, while mine feel harder for him to attack.",
        "12... exd3 13. Qxd3 Rac8 14. Bf3 Rfd8 15. Rfd1": "I don't have a specific reason or plan in mind to put this rook over here, but it looks more useful here than on f1. I'm thinking that if he pushes d4, I'll look at putting my queen or d4 and e5 and trading on d5 -- with a checkmate threat on the long diagonal pinning his knight.\n\nIf he doesn't play c4, and I'm thinking he won't because he gives up control in the center, I'll have to decide what to do with the queen. I want to leave the d-file and let the rook have it instead of the queen. I haven't looked at Qe2 or e4 yet. Qb5 doesn't thrill me because I feel my queen is doing more than his is.",
        "15... c4 16. Qd4 Ne8 17. e4 dxe4 18. Qxe4 Bf6 19. Qe3": "To me, this is the toughest kind of position. There are lots of ways to do captures, and if you do it in the wrong order, you lose. Dan Heisman, who's written lots of chess books and has a column on Chess Cafe, describes it as a tactic: Counting. And he also claims that it's the tactic that so often causes you to lose because you don't look far enough ahead or at all of the possible captures to determine if it's safe or not.\n\nHere, I looked a little at Rxd8 to get his rook off of the c-file (I'm afraid that after everything clears, it's going to capture the pawn on c2 and win because of that), but I can't give him the open d-file. That also leads to doom & destruction for me. Qxb7 doesn't work because he just plays Bxc3 and wins a knight. I looked a long time at Na4 to move the knight (that's attacked twice and guarded just once), and it guards the bishop from there. If he plays Bxb2, I recapture with the knight. I have a threat against d8 from my rook. If his bishop goes to f5 to help the rook move to c2, my queen will have a threat against e8. So I was almost ready to play Na4. \n But you always have to ask: what if he ignores the trade. If he plays b5, then he's attacking my bishop and knight. I pretty much have to play Bxf6, but he recaptures with the knight (Nxf6), and now he's attacking my knight on a4 with a pawn and my queen on e4 with the knight. I can play Qe5 to temporarily pin his pawn, but I don't think this will turn out well. Plus, he can trade pawns and then play Rxc2 and have a win. So maybe the best I can do is play Qe3. If he trades the knight (which he won't), then my pieces start to escape. More likely he adds pressure, but now I can play Na4, and if he plays b5, I can trade bishops and then move the knight -- and he won't be attacking my queen.\n \nNow that I've made the move, it suddenly hits me that I didn't consider him playing cxb3. I can't recapture cxb3 because I lose the knight; three pieces attacking it and only two guarding it. I'll have to recapture axb3 and attack his queen, so he can't stop and take my knight. Maybe he'll play Qc7 so he's still attacking it three times. I can rescue the knight with Nb5, attacking his queen, but he plays Qxc2 and wins a pawn. That doesn't look good for me, down a pawn and rapidly coming to the endgame. This isn't looking good for our team. My partner was swept, and it's looking like I'm heading for the wrong side of a sweep, too.",
        "19... Nd6 20. Na4": "Not sure what I'll do if he plays Nf5, but I've got to free up my knight and bishop.",
        "20... c3 21. Ba3": "I'm thinking that when the dust clears, I'll be lucky if I'm only down a pawn.",
        "21... Nb5 22. Bc5": "I was afraid of b5, when I should've been worried about Nb5. Looks like the best I can do is get two pawns for the bishop and go into another losing endgame a pawn down.",
        "22... b6 23. Bxb6 axb6 24. Nxb6 Nd4": "This is why I tell people that I know I'm overrated. He's got something going on way too sneaky & clever for me to see. So at this point, I'm just going to see what develops, hopefully learn from it, and then, admiringly, tell him \"nice job!\"",
        "25. Nxc8 Nxc2 26. Qb6 Qxb6": "He's got me. Now I see what I missed. After he trades the N for the R on a1, he plays c2. I was planning to get my knight back to stop the pawn, but now I see the problem -- the discovered attack from his bishop on my rook. That's a nice combination.",
        "27. Nxb6 Nxa1 28. Rxa1 c2 29. Rc1 Rd2 30. Nc4 Bxc4 31. bxc4 Bb2": ""
    },
    "url": "https://gameknot.com/annotation.pl/not-the-best-way-to-play-the-larsen-nimzovich-attack?gm=32850",
    "gameName": "Not the best way to play the larsen-nimzovich attack",
    "players": "chuckbo (2027) vs. patzereli (2068)",
    "opening": "Nimzovich-Larsen attack (A01), modern variation"
}