{
    "moves": {
        "1. e4": "The game database identified this as C41: Philidor's defence",
        "1... e5 2. Nf3 d6 3. d4 f6 4. dxe5 fxe5 5. Bc4 h6 6. Nc3 a6 7. Be3": "at this point i've developed all 4 minor pieces and black's are still all on his back rank.... ",
        "7... c6": "Black wastes another move and takes away the best square from his knight",
        "8. Qd2": "i am now prepared to castle long",
        "8... b5": "Black advances yet another pawn.  ",
        "9. Bxg8": "i decide to stop letting black take space with his pawns and this prevents black from castling kingside",
        "9... Rxg8 10. O-O-O": "now i have my queen and rook focused on the pawn on d6",
        "10... Rh8": "another pointless move",
        "11. Bc5": "Black cannot play dxc5 without losing his queen",
        "11... d5 12. Bxf8": "i take black's better bishop and i will gain a pawn after Rxf8",
        "12... Rxf8 13. Nxe5": "i debated exd5 but i know that i can play that move next ",
        "13... Qg5": "black forces a trade of queens and doubles his paws on the g file",
        "14. Qxg5 hxg5 15. exd5": "finally i get a chance to play exd5",
        "15... Bb7": "I don't know what black was thinking here.  Rxf2 seemed logical",
        "16. dxc6 Bxc6 17. Nxc6 Nxc6": "i'm two pawns up when the dust settles with a strong pawn structure and  two more pawns than my opponent",
        "18. Rd6 Rc8 19. f3 b4 20. Ne4": "moves the knight to a square where black's pawns cannot attack it and attacks black's pawn",
        "20... a5 21. Nxg5 Rf5 22. Re1+ Kf8 23. Ne6+ Kf7 24. Nd4": "Forcing an exchange of knights",
        "24... Nxd4 25. Rxd4 Rh8 26. h3": "i control both open files and have a 3 pawn advantage",
        "26... Rg5 27. Re2 Rc8 28. b3 g6 29. Rde4 Kg7 30. Re4e5": "Forcing the exchange of rooks or black losing a pawn",
        "30... Rg3 31. Rxa5 g5 32. Rb5 Ra8 33. Rxb4 Rxa2 34. Ra4": "Ra4! black is now forced to trade rooks and resignes because his other rook is trapped and his king cannot cross the E file, so nothing can stop me from getting 2 more queens"
    },
    "url": "https://gameknot.com/annotation.pl/nutmeg-of-consolation-viii?gm=211",
    "gameName": "Nutmeg Of Consolation VIII",
    "players": "acrewboy02 (1412) vs. miike (1337)",
    "opening": "Philidor's defence (C41)"
}