{
    "moves": {
        "1. e4": "This is a nice little game in which I sacrificed a knight for the attack. Nothing very interesting happens until move 18, so feel free to skip ahead. I'll be posting my thoughts rather than computer evaluations.",
        "1... c6 2. d4 d5 3. Nc3 dxe4 4. Nxe4 Bf5 5. Ng3 Bg6 6. h4": "I played a couple of games using this line of Caro-Kann. The h-pawn advance kind of disrupts my kingside, so in these situations I castle queenside.",
        "6... h6 7. h5 Bh7 8. Nf3 Nd7 9. Be3 e6 10. Bd3": "My plan is to quickly develop the light pieces, castle queenside and attack on the kingside.",
        "10... Bxd3 11. Qxd3 Ngf6 12. O-O-O": "So far so good.",
        "12... Be7 13. Ne4": "I need to advance the g-pawn, so the knight on g3 needs to go.",
        "13... O-O 14. Nxf6+": "If he recaptures with the knight, than e5 is free for my own knight.",
        "14... Nxf6 15. Ne5": "In this position, I considered Bxh6 and Ng6, but neither of them looked very promising at the time.",
        "15... c5 16. g4": "Now that I control g4, I can safely advance the g-pawn and prepare for g5.",
        "16... Qa5": "Obviously, black counterattacks on the other flank.",
        "17. a3": "I also considered 17.Qb3, but I preferred to keep my queen on the b1-h7 diagonal.",
        "17... Rfd8": "Applying some pressure on the d-column. A reasonable move, but now, f7 is exposed.",
        "18. Nxf7": "I felt this move would spice things up a bit. My plan at this point is 19.Qg6+, 20.g5 and try to focus all my forces towards his (hopefully exposed) king. A knight sac on f7 certainly isn't original; it was the first move that came to my mind and \"felt\" right. The computer (Crafty) prefers 18.g5, but this is more interesting and I fancy myself playing like Morphy. Minus the genius part.",
        "18... Kxf7": "Sacrifice accepted and acknowledged.",
        "19. Qg6+": "The obvious continuation.",
        "19... Kf8 20. g5": "I also considered 20.Bxh6, but I'd rather try to open up the g-column. Besides, I didn't have the guts for a second sacrifice :) (I bet Morphy wouldn't have hesitated for a second)",
        "20... Ng8": "Black chooses to retreat and keep an eye on h6 and f6.",
        "21. gxh6": "I try to keep the pressure on.",
        "21... gxh6": "I didn't realize at the time, but apparently this is THE mistake, because now the g aisle is wide open. Computer evaluation is +6.5, aka \"+-\" for 21..gxh6 and only +2.8 (+/-) for 21..Nxh6",
        "22. Rhg1": "I briefly thought about 22.Bxh6, but this looks more promising. I threaten both 23.Qxg8+ and 23.Qg7+ and there is no way black can avoid both. ",
        "22... Bg5": "Maybe there is a way after all. I'm sorry to say I didn't see this, but it's only temporary.",
        "23. Bxg5": "Bishop goes, rook stays.",
        "23... hxg5 24. Rxg5": "Kind of obvious. I can see some mate threats already.",
        "24... Ne7 25. Qf6+": "I had both Qf6+ and Qg7+ in mind, but this one seemed better. It's already mate in 9, but I didn't know.",
        "25... Ke8 26. Qxe6": "Best move. Keeps the king prisoner and threatens 27.Rg8#",
        "26... Kf8": "Only move to escape immediate checkmate.",
        "27. Rdg1": "This one seals the game. \n27..Ng6 means a simple checkmate 3 starting with 28.Rf5+\n27..Qd2+ is only a desperate attempt to postpone the end \nand the main threat is 28.Rg8+ Nxg8 29.Rxg8# (sacrifice almost everything and checkmate with the last remaining pieces, in true Morphy style :)\nBlack resigns.\nThe level of this game is not very high, but I deemed it entertaining enough to annotate it. Enjoy and learn if there is anything to learn."
    },
    "url": "https://gameknot.com/annotation.pl/nxf7-oldest-trick-in-the-book?gm=26729",
    "gameName": "Nxf7.. oldest trick in the book",
    "players": "andydufresne (1701) vs. oldhamer (1657)",
    "opening": "Caro-Kann (B19), classical, 7...Nd7"
}