{
    "moves": {
        "1. d4": "Here is my 4th OTB game and my first win. There are mistakes from both sides, but is worthy of a second look. Please feel free to give feedback. \r\n",
        "1... Nf6": "I like to use Alekhine's defence for e4 openings and tend towards KID or Gruenfeld for d4.",
        "2. c4": "Claiming the uncontested centre.",
        "2... g6 3. Nc3 d5": "Entering the Gruenfeld",
        "4. cxd5": "White chooses the exchange variation. Nf3 is also quite popular.",
        "4... Nxd5 5. e4 Nxc3 6. bxc3": "White now has an impressive looking centre, which black will attempt to undermine. ",
        "6... Bg7": "Looking through the centre at the dark squares and preparing to castle. ...c5 is another way to attack the centre. ",
        "7. Bc4 O-O": "I'm still quite green with this opening, so from about this point on I was playing moves that felt natural. The GK database doesn't disagree with me yet. ",
        "8. Ne2": "Reinforcing the White pawn centre and preparing for castling. ",
        "8... c6": "...c5 was probably better (certainly more popular) but this seems playable. My idea behind this move was to shift the white bishop off its nice diagonal with ...b5 (if Bb3, then ...a5,a6) and gain some space on the queen-side. It provides some more options for the queen too. ",
        "9. O-O Re8 10. Ba3": "I'm not sure why White played this move. It doesn't seem like the most useful diagonal. ",
        "10... e5": "Probably not the best move. I played this with the idea that if White were to exchange pawns there would be 2 isolated pawns to try to defend. if White advances then I gain some free space on the queen-side with ...b5, and load the a8-h1 diagonal with a bishop (this is an option that was already there, but I hadn't considered...)",
        "11. d5 b5 12. Bb3 Bb7": "As planned.",
        "13. Rc1 a5": "Threatening ...a4, taking away a defender of d5. ",
        "14. Re1 a4": "As planned, Black will gain a valuable pawn. ",
        "15. Bc2 cxd5 16. exd5 Bxd5": "I had no desire to trade queens at this point, the white queen is less dynamic than the black queen. And this way the pawn at a2 is threatened. ",
        "17. Bb1": "Defending a2.",
        "17... Ra7": "Threatening ...Rd7 with loads of discovered threats. ",
        "18. Qd2 Rd7": "Setting up a battering ram on the e file. The white queen must move.",
        "19. Qb2": "The queen looks misplaced here, but it does threaten b5. I think Qe3 may have been better. ",
        "19... Qg5": "Threatening mate at g2. ",
        "20. g3": "Not f3. (...Bxf3 could be embarrassing for white!) This move creates a real white square weakness. ",
        "20... Qg4": "Looking to walk around to g2 via h3 or f3.",
        "21. Nf4": "Nice move by white. Threatening the powerful d5 bishop. Taking advantage of the lack of communication between the black rooks. ",
        "21... Bc6": "Staying on the lethal diagonal and protecting b5 (not that White really has the time to waste taking it!)",
        "22. Re3": "White has shored up the holes at h3 and f3. It is a game ending blunder too, but I didn't the mate at the time!",
        "22... Red8": "22...Qd1+ 23.Rxd1, Rxd1 24.Re1 Rxe1# would have been the correct way to finish, but at this point there are too many threats for white to overcome anyway. ",
        "23. Nd3": "Blocking the d file. The stepping stone at h3 is no longer relevant due to the rook at e3. ",
        "23... f5": "I thought there was probably a more decisive move, but I couldn't find it. ...e4 just blocks the diagonal for the bishop, Qh3 doesn't work. this move threatens ...f4 with many threats. ",
        "24. f3": "Seems like the best defence. ",
        "24... Bxf3": "Trading a strong bishop for a defensive rook and a pawn. ",
        "25. Rxf3 Qxf3": "The white king looks awfully lonely now. ",
        "26. Nf2 Rd7d2": "White resigns, and I get to chalk up my first win. Thanks for reading, all comments welcome!"
    },
    "url": "https://gameknot.com/annotation.pl/nzcf-club-game?gm=39885",
    "gameName": "NZCF Club Game",
    "players": "L. Rudkins (1191) vs. S Holdaway (unr)",
    "opening": "Gruenfeld (D86), exchange, Larsen variation"
}