{
    "moves": {
        "1. Nf3": "Here is another OTB game of mine. This is the third round of an 11 round championship, but the first round where my opponent actually turned up! \r\nI like to start with Nf3 because of its flexibilty. I have been trying the Reti opening and Kings Indian Attack for the most part, adjusting depending on what black plays. ",
        "1... d6 2. e4": "Going for the centre, and looking to set up some form of KIA. ",
        "2... e5 3. g3 Nc6 4. Bg2": "Nothing too out of the ordinary yet. ",
        "4... Qf6": "I thought this move was a bit dubious. I'm not sure what Black's ideas were. Maybe preventing the queen from being blocked in after Nge7. Perhaps looking at Bg4, then Nd4?",
        "5. Nc3": "Deviating from my usual KIA setup where the knight goes to d2. On this occaision there look to be potential opportunities for a knight at b5 and d5. I almost always prefer to advance the c-pawn before planting a knight here, but this knight won't be there very long. ",
        "5... Be6 6. Nb5": "Threatening the fork at c7 and preparing for d4. Black must now castle or retreat his queen to protect the a8 rook. ",
        "6... O-O-O 7. d4": "Although I had already planned for d4, Black's castling gives it more potency, because now the black queen and rook are on the same diagonal of the bishop I am about to release. d4 is now a double attack of sorts. Bg5 wins rook for bishop, there is also a nasty little pawn fork, d5. ",
        "7... d5": "I hadn't expected this, but although interesting, I think it is not one of the better moves black could have made. ",
        "8. Bg5": "Aiming at the rook on d8, whilst removing a guard from e5. ",
        "8... Qg6": "Forced",
        "9. Bxd8": "9...Qxe4+ looks an interesting response to this move but after 10 Qe2, black must either allow the white bishop to escape, or exchange queens which may not be the best plan when behind in material and with a somewhat shaky position. ",
        "9... Kxd8": "Not wanting to recover with the knight, as it is busy where it is (overworked in fact), defending both a7 and e5. ",
        "10. Nxe5": "Attacking the black queen and also discovering some protection from Qe4+ (10...dxe4 is not dangerous as it allows 11 d5) ",
        "10... Nxe5": "More or less forced - the black queen only had one square to move to where it could have a chance to see move 12. ",
        "11. dxe5 c6": "Trying to provide some protection for the d-pawn, and trying to chase the knight away. ",
        "12. exd5": "Counterattacking with threat of a nasty double-check. If 12...cxd5, 13 Bxd5, Bxd5 14 Qxd5+ and Black is all but finished. ",
        "12... Bd7 13. dxc6": "Pinning the bishop.",
        "13... bxc6 14. Nxa7": "Gobbling up a pawn and threatening Nxc6+, or Bxc6. ",
        "14... Kc7": "Breaking the pin. ",
        "15. Qd2": "Aiming at a5, and also making way for a rook to join in the attack. ",
        "15... Qe6 16. Qa5+": "Drawing the Black king away from his defenses. ",
        "16... Kb7": "Black pins his own pawn. Nb5, threatening Qa7 or Qc7 crossed my mind, but it just looked like harrassment without actually threatening anything decisive. ",
        "17. O-O-O": "Bringing some more artillery into the fray. ",
        "17... Ne7 18. Nb5": "With a rook on the d file, the threat of Qc7 is far more dangerous. ",
        "18... Nc8 19. Qc7+ Ka6 20. Rxd7": "The knight will fall, but a rook planted on d7 (not to mention the bishop that used to be there) is more than enough compensation. ",
        "20... Kxb5 21. Bxc6+": "I think there are better moves than this, but I saw a tactical shot that I couldn't resist...",
        "21... Qxc6 22. a4+": "The black queen cannot be protected.  ",
        "22... Kc5 23. b4+ Kxb4 24. Qxc6": "Although it was decisive here, Black fights to the bitter end.",
        "24... Bc5 25. Qb5+ Ka3 26. Qb3#": "I hope you enjoyed the annotation. Thanks for reading, all comments/feedback are welcome and appreciated. "
    },
    "url": "https://gameknot.com/annotation.pl/nzcf-club-game?gm=40158",
    "gameName": "NZCF Club game",
    "players": "S. Holdaway (unr) vs. M. Lopes (???)",
    "opening": "Reti (A04), Wade defence"
}