{
    "moves": {
        "1. e4": "Hi everyone!\r\n\r\nThis game belongs to the Knights of Honour Pawn Structures thread.  This is about a little passed pawn on the a column which was left to create some mayhem similar to the Berzerker Pawn which is what I will raise in the thread later on.  Here is a game against The Dentist who has returned from Vietnam after another long sabbatical.  He does put me under a bit of pressure in the middlegame but he makes the mistake of leaving his dark square bishop in a pin and then I take full advantage of this.  After a double king pawn opening he plays 2. Qf3 which is the Napoleon Opening.  The last time he played that opening against me I lost - see The Dentist Has His Day http://gameknot.com/annotation.pl/the-dentist-has-his-day?gm=17287.  Just hope I don't get bogged down yet again.",
        "1... e5 2. Qf3 Nc6 3. c3": "3. c3 - gameknot described this move as an Inaccuracy: +1.14 » 3. c3 Nf6 4. Bc4 Bc5 5. Ne2 Na5 6. Bb5 c6 7. Bd3 d5 8. O-O O-O 9. exd5 Nxd5\r\nBest: +0.58 » 3. Bc4 Nf6 4. Nc3 Nd4 5. Qd3 c6 6. Nf3 d5 7. exd5 Bf5 8. Nxd4 Bxd3 9. cxd3 exd4\r\n\r\nHmm, in the best line I get his queen for two pieces!",
        "3... Nf6": "3. ..... Nf6 - out come the knights.",
        "4. b4 a6 5. h3 b5": "5. ...... b5 - gameknot described this move as an Inaccuracy: +0.30 » … b5 5. a4 Rb8 6. axb5 axb5 7. Na3 Ba6 8. Bd3 d5 9. exd5 Qxd5 10. Qxd5 Nxd5 11. Nf3 Bd6\r\nBest: +1.25 » … d5 5. exd5 Qxd5 6. Na3 Qxf3 7. Nxf3 e4 8. Nh2 Be7 9. Be2 O-O 10. d4 Bf5 11. O-O Rad8\r\n\r\nHmm, in the best line I have a lead in development but not much else.",
        "6. Bb2": "6. Bb2 - and this move is also described as an Inaccuracy: +1.21 » 6. Bb2 d5 7. exd5 e4 8. Qe3 Qxd5 9. Nf3 Bf5 10. Na3 O-O-O 11. c4 Qd7 12. cxb5 axb5 13. Ne5 Nxe5 14. Bxe5 Bxb4 15. Nxb5 Bxd2+\r\nBest: +0.49 » 6. a4 Rb8 7. axb5 axb5 8. Na3 Ba6 9. Bd3 d5 10. exd5 Qxd5 11. Qxd5 Nxd5 12. Nf3 Nf4 13. Bf1\r\n\r\nOnly a slight spatial advantage at the end of the best line.",
        "6... Bb7 7. d3 Be7 8. Ne2 d6 9. g4": "9. g4 - a pawn push, designed to deter me from castling kingside.",
        "9... h6": "9. ....... h6 - and I try and hold it up.",
        "10. Bg2 Na7 11. Nd2 c5 12. a3 a5 13. Ng3 Bc8": "13. ...... Bc8 - gameknot flagged up this move as an Inaccuracy: -0.42 » … Bc8 13. Nf5 O-O 14. bxc5 dxc5 15. c4 Bxf5 16. exf5 Rb8 17. O-O Bd6 18. Rfe1 Qe7 19. Qg3\r\nBest: +0.31 » … cxb4 13. cxb4 axb4 14. axb4 Nc6 15. Rxa8 Qxa8 16. Nf5 Bf8 17. O-O Nxb4 18. Ra1 Qd8 19. Rc1\r\n\r\nAgain only a slight spatial advantage at the end of the best line.",
        "14. Qe3 Be6 15. f4 Rc8 16. f5 Bd7": "16. ...... Bd7 - white appears to be exerting a cramp on the kingside.",
        "17. Nb3 a4 18. Na5 Qc7 19. Rc1 Nc6 20. Nxc6 Qxc6": "20. ...... Qxc6 - knight trade - at least I have got rid of that troublesome queen knight.",
        "21. c4": "21. c4 - gameknot classed this move as an Inaccuracy: +1.29 » 21. c4 cxb4 22. axb4 Qa6 23. O-O O-O 24. c5 a3 25. Ra1 a2 26. d4 exd4 27. Bxd4 dxc5 28. bxc5\r\nBest: +0.37 » 21. O-O O-O 22. Qf2 Rfe8 23. bxc5 Qxc5 24. Bf3 Bc6 25. Rfe1 Bd8 26. Qxc5 dxc5 27. Nh5 Nxh5\r\n\r\nAt the end of the best line the knight trade messes up white's kingside pawn structure which could be a big disadvantage to him in the endgame.",
        "21... cxb4 22. cxb5": "22. cxb5 - and another Inaccuracy: +1.97 » 22. cxb5 Qxb5 23. Rxc8+ Bxc8 24. O-O bxa3 25. Bxa3 Qb3 26. Ra1 Ba6 27. Bf1 O-O 28. Nh5 Nxh5 29. gxh5\r\nBest: +1.31 » 22. axb4 Qa6 23. cxb5 Rxc1+ 24. Qxc1 Bxb5 25. d4 O-O 26. dxe5 dxe5 27. Qd2 Qd6 28. Qxd6 Bxd6 29. Ba3\r\n\r\nAt the end of the best line I would have taken advantage of the fact that white has not castled and played a move like Rc8 and then Rc3 attacking white's dark squared bishop and then winning the b pawn.",
        "22... Qxb5 23. Rxc8+ Bxc8 24. O-O": "24. 0-0 - some late castling on both sides.",
        "24... bxa3 25. Bxa3 Qb3 26. Ra1 O-O": "26. ..... 0-0 and I castle even later!",
        "27. Nf1 Bb7": "27. ...... Bb7 - here is an Inaccuracy: +1.49 » … Bb7 27. d4 Re8 28. Qxb3 axb3 29. d5 Ba6 30. Nd2 Bd3 31. Nxb3 Bxe4 32. Bxe4 Nxe4 33. Re1 Nc3\r\nBest: +2.44 » … Ba6 27. d4 Qxe3+ 28. Nxe3 exd4 29. Nf1 Rc8 30. e5 Ne8 31. exd6 Bxd6 32. Bxd6 Nxd6 33. Rxa4 Bxf1 34. Kxf1\r\n\r\nIn the best position I have a passed pawn but it will need defending.",
        "28. Nd2 Qb5": "28. ..... Qb5? - aargh - a Mistake: +0.98 » … Qb5 28. Rb1 Qd7 29. Nc4 Ba6 30. Qb6 Ra8 31. Kf2 Nh7 32. Bf3 Bxc4 33. dxc4 Ng5 34. Bg2 Kh8\r\nBest: +1.99 » … Qc3 28. Ra2 Ra8 29. Bf1 Ba6 30. Nb1 Qc6 31. Rb2 Bb5 32. Nd2 Rc8 33. Nf3 Qc3 34. Be2 Qxa3 35. Rxb5\r\n\r\nIn the best line I have a passed a pawn and Glenda is in front of it - could be decisive.",
        "29. Bf1 Rc8 30. d4": "30. d4 - an Inaccuracy: +2.10 » 30. d4 Qb6 31. Nc4 Rxc4 32. Bxc4 exd4 33. Qf2 Nxe4 34. Qb2 Qxb2 35. Bxb2 Nc3 36. Bd3 Bd5 37. Ba3\r\nBest: +1.46 » 30. Rb1 Qd7 31. Qa7 Ba8 32. Qxd7 Nxd7 33. Nc4 d5 34. Bxe7 dxc4 35. Rb4 cxd3 36. Bxd3 a3 37. Kf2\r\n\r\nIn the best line I still have a pawn advantage but white has the bishop pair.",
        "30... Qb6 31. Rb1": "31. Rb1 - another Inaccuracy: +2.83 » 31. Rb1 exd4 32. Qd3 Qa7 33. e5 Ne8 34. Qb5 Bc6 35. Qa6 Rc7 36. Rc1 Qxa6 37. Bxa6 Kf8 38. e6\r\nBest: +1.98 » 31. Nc4 Rxc4 32. Bxc4 exd4 33. Qf2 Nxe4 34. Qb2 Qxb2 35. Bxb2 Nc3 36. Bd3 Kf8 37. Rc1 Bg5 38. Re1\r\n\r\nHmm, in the best line an interesting material imbalance - I will have 3 pawns for the exchange and one of those is that passed a pawn.",
        "31... Qa7 32. Bb2 Nd7": "32. ..... Nd7 - ooops, a Mistake: +2.05 » … Nd7 32. Nc4 Rb8 33. Ba1 Bc6 34. Rxb8+ Qxb8 35. Bc3 Bg5 36. Qe1 exd4 37. Bxd4 Ne5 38. Kg2 Bf4\r\nBest: +3.30 » … d5 32. exd5 Nxd5 33. Qxe5 Bf6 34. Qe2 a3 35. Ba1 Nc3 36. Bxc3 Rxc3 37. Nb3 Bxd4+ 38. Nxd4 Qxd4+ 39. Qf2\r\n\r\nHmm, that passed a pawn is looking more and more menacing as the game goes on.\r\n\r\n",
        "33. Nc4 Qa8 34. d5": "34. d5 - fixes the d6 pawn and tries to exert a further cramp on Fou Lenoir.",
        "34... Ba6 35. Nb6 Nxb6 36. Qxb6 Bxf1 37. Kxf1": "37. Kxf1 - I think this is the decisive Mistake: +5.47 » 37. Kxf1 a3 38. Bxa3 Qxa3 39. Qb3 Qa6+ 40. Qb5 Rc1+ 41. Ke2 Qa2+ 42. Rb2 Rc2+ 43. Rxc2 Qxc2+ 44. Kf3 Qh2 45. Qe2 Qxh3+ 46. Kf2 Bh4+ 47. Kg1\r\nBest: +3.42 » 37. Rxf1 a3 38. Ba1 a2 39. Qb3 Qa6 40. Qb2 Bg5 41. Re1 Qa4 42. Kf1 Bh4 43. Qb7 Qc4+ 44. Re2 Qc1+ 45. Kg2 Qxa1 46. Qxc8+ Bd8\r\n\r\nIf white had recaptured with the rook his dsb would not have found himself in a decisive pin.",
        "37... Rb8 38. Qc6 Qa5 39. Ke2 Qb4 40. Qc1": "40. Qc1 - a Blunder: +14.52 » 40. Qc1 Qxe4+ 41. Qe3 Qxb1 42. Bc3 Bh4 43. Qd2 Rb3 44. Qe3 Qc2+ 45. Qd2 Qe4+ 46. Qe3 Qxe3+ 47. Kxe3 Rxc3+ 48. Kd2 Rxh3 49. Kc2\r\nBest: +7.26 » 40. Qc2 a3 41. Bxa3 Qxb1 42. Qxb1 Rxb1 43. h4 Rb3 44. f6 gxf6 45. Bc1 Kg7 46. Bd2 f5 47. gxf5 Bxh4\r\n\r\nThe bishop on b2 is doomed whichever way you cut it.",
        "40... a3": "40. .... a3 - a Blunder: +8.46 » … a3 40. Qc2 axb2 41. Kf1 Qa3 42. Qe2 Qxh3+ 43. Kg1 Bg5 44. Qg2 Qxg2+ 45. Kxg2 Bc1 46. Kf2 Rb3\r\nBest: +14.52 » … Qxe4+ 40. Qe3 Qxb1 41. Bc3 Bh4 42. Qd2 Rb3 43. Qe3 Qc2+ 44. Qd2 Qe4+ 45. Qe3 Qxe3+ 46. Kxe3 Rxc3+ 47. Kd2 Rxh3 48. Kc2\r\n\r\nEven with this blunder I am still winning hands down with the equivalent of rook and 3 pawns to the good, that white dsb is lost, lost, lost!",
        "41. h4": "41. h4 - a Blunder: +19.30 » 41. h4 Qxe4+ 42. Qe3 Qxg4+ 43. Kd3 a2 44. Rg1 Qxf5+ 45. Qe4 Qh3+ 46. Qe3 Rb3+ 47. Kc2 Rxe3 48. Kd2 Bxh4 49. Ra1 Rd3+ 50. Kc2\r\nBest: +8.46 » 41. Qc2 axb2 42. Qd3 Bg5 43. h4 Bxh4 44. Qc2 Bg3 45. Qd3 Rb5 46. Qc2 Bf4 47. Kf2 Kh7\r\n\r\nEven in the best line white is well busted though.  Now I decided to nab a pawn with check before taking off that white dsb.",
        "41... Qxe4+ 42. Kd1": "42. Kd1 - this now allows the win of the rook or I get the pleasure of delivering mate.  I think if I were white I would be seriously considering waving the white flag.",
        "42... Qd3+ 43. Ke1": "43. Ke1 - a Blunder allowing Mate(1) » 43. Ke1 Bxh4#\r\nBest: +23.39 » 43. Qd2 Qxb1+ 44. Bc1 a2 45. Qc3 Bxh4 46. Ke2 a1=Q 47. Qxa1 Qxa1 48. Bxh6 gxh6 49. f6 Rb2+ 50. Kd3 Bxf6\r\n\r\nAs per my previous note his rook is doomed and in the final position I am a whole queen up and the end for white will surely not be too far off.\r\n\r\nFou Lenoir, who has been stuck on e7 for a long, long while steps up to do the ultimate honours.  Hope you have had a good read - bye for now - Joanne",
        "43... Bxh4#": ""
    },
    "url": "https://gameknot.com/annotation.pl/passed-pawn-mayhem?gm=31658",
    "gameName": "Passed Pawn Mayhem",
    "players": "The Dentist (1305) vs. jstevens1 (1842)",
    "opening": "KP (C20), Napoleon's opening"
}