{
    "moves": {
        "1. e4": "Hi everyone!\r\n\r\nI decided to take another trip down memory lane.  This game ended on 21.08.08, over a year ago.  Somehow I get struck down by passivitis yet again, but as you will see, that passive position conceals a coiled serpent in the grass.  After a normal double king pawn start my opponent plays the Patzer's Opening, although, I have to say, that Master Freddy is not averse to playing the white side of it!  The move is 2. Qh5 trying for that evergreen famous Scholar's Mate.\r\n",
        "1... e5 2. Qh5 Nc6 3. c3": "3. c3 - sometimes the follow up is the standard Bc4.  Now I chase that Wicked Witch of the West away with a good developing move such as Nf6.",
        "3... Nf6 4. Qf3 Bc5 5. b4 Bb6": "5. ...... Bb6 - the first sign of passivitis, Fou Lenoir is driven from c5.  I am however, ready to castle and I do so next move.",
        "6. Bc4 O-O 7. Ne2 a6": "7. ....... a6- creating a bolt-hole on a7 for Fou Lenoir.  Once white castles kingside the f2 pawn will be pinned against his king.",
        "8. Ba3 Re8": "8. ...... Re8 - I see the exchange winning discovery (b5) and take evasive action.",
        "9. h3 d6": "9. ...... d6 - opens line for Fou Leblanc.",
        "10. g4 Be6 11. d3 Bxc4 12. dxc4": "12. dxc4 - bishop trade.",
        "12... Na7 13. Nd2 c6 14. h4": "14. h4 - the beginnings of a pawn storm perhaps.",
        "14... c5 15. g5 Nd7": "15. ...... Nd7 - a forced retreat.",
        "16. Ng3 Nf8 17. Qg4": "17. Qg4 - now the Witch is bearing down the g file and Henry is on it!  So, Glenda makes her only move in the game, Qd7.  The Dentist decided to trade queens.  I am so relieved because it will be very difficult for him to get Henry without the witch.",
        "17... Qd7 18. Qxd7 Nxd7 19. Rf1 Nc8": "19. ...... Nc8 - some subtle manoeuvres, Fou Lenoir is gonna be moved later on.",
        "20. f4 exf4 21. Rxf4": "21. Rxf4 - You would never believe that white could lose from here now, would you?",
        "21... Ne5": "21. ...... Ne5 - suddenly I make my first really active move of the game.",
        "22. Ke2 Ba7 23. Rd1 b6 24. h5 Bb8": "24.  ..... Bb8 - a seemingly passive square for Fou Lenoir, but just look at the white pieces lined up on that h2-b8 diagonal.",
        "25. Rdf1 Ra7": "25. ....... Ra7 - the start of an escape from the corner for my QR.",
        "26. h6 g6": "26. ...... g6 - With white's 2 rooks still on the board I do not wish to open up that g file.",
        "27. Ke3 Rae7 28. Ne2 Nd7": "28. ....... Nd7 - a retreat but suddenly the e4 pawn is pinned.",
        "29. Bb2 d5": "29. ...... d5 - remember what I said about that h2-b8 diagonal earlier, my friends?",
        "30. Rg4 dxe4 31. Rxe4 Re7xe4+ 32. Nxe4": "32. Nxe4 - this pawn + rook trade now results in the e4 knight being pinned.  Now that passive knight on c6 comes into action by piling up on that white steed.  The Dentist now backs it up with Ne2g3.",
        "32... Nd6 33. Ne2g3 Nxc4+": "33. ........ Nxc4+ - first blood to me!  The c4 pawn drops, but look, can you spot a knight fork?",
        "34. Ke2 Nxb2": "34. ..... Nxb2 - I can and now the black dsb drops off.",
        "35. a3 Bxg3": "35. ..... Bxg3 - now another victim, the knight on g3 as the e4 knight is still pinned.",
        "36. Kf3 Be5 37. Kg4 Nc4 38. bxc5 Nxc5": "38. ....... Nxc5 - pawn trade.",
        "39. Nxc5 bxc5": "39. .... bxc5 - knight trade.  My pawns are split but look at that material plus!",
        "40. Re1 Kf8": "40. ...... Kf8 - Henry unpins Fou Lenoir by backing up my rook on e8.",
        "41. a4 Bh8 42. Rc1 f6 43. Rb1 fxg5 44. Kxg5": "44. Kxg5 - pawn trade.  Now the c3 pawn drops off.  White can play Rc1 skewering Fou Lenoir and my c4 knight but Fou Lenoir can move out of the skewer with a bishop fork on d2 winning the rook and no doubt that if I was white I would certainly wave the white flag!",
        "44... Bxc3 45. Rb7 Kg8 46. Rc7 Bd2+": "46. ..... Bd2+ - to separate the WK from the h6 pawn.",
        "47. Kg4 Nb2 48. Rxc5 Nxa4": "48. ....... Nxa4 - pawn trade.",
        "49. Rc2 Bxh6 50. Ra2 Nc5": "50. ...... Nc5 - now white only has his rook.",
        "51. Ra5 Bf8 52. Kg5 Ra8": "52. ...... Ra8 - get behind the passed pawn!",
        "53. Kf6 Nb7 54. Rd5 a5 55. Rd7 Nd8": "55. ....... Nd8 - solidification!",
        "56. Ke5 a4 57. Rd2 a3 58. Ra2 Nc6+": "58. ..... Nc6+ - heading for b5 when the WR will have to give way to my a3 pawn, clearing the way to Glendadom.",
        "59. Kd5 Nb4+": "59. ...... Nb4+ - now the WR is toast and The Dentist duly waves the white flag as he will be left with only bare king.  Whew, that was amazing!"
    },
    "url": "https://gameknot.com/annotation.pl/passivity-then-massacre?gm=26248",
    "gameName": "Passivity then Massacre!",
    "players": "The Dentist (1275) vs. jstevens1 (1537)",
    "opening": "KP (C20), Patzer opening"
}