{
    "moves": {
        "1. e4": "So, I start off with my usual.",
        "1... d6": "But, somewhat similar to my second game with Ken, I'm not used to this being played against me.",
        "2. d4": "So, I stick with what I already know.  That as a general rule, when the opponents first move only involves moving a pawn one square, 2.d4 is generally played.",
        "2... Nf6": "Not surprisingly, Ken develops.",
        "3. Nc3": "Likewise, I continue with my development.",
        "3... Be6": "As does Ken.  But, I have ideas which is to gain tempo and get a nice pawn chain, which is why I play 4.d5.  For after that, I use that time to develop another piece with my fifth move.",
        "4. d5 Bd7 5. Nf3 c6": "Ken wants to exchange pawns.  The bad part is that I don't have the patience yet, as this was played before that important.  So, I only did a little research to figure out if the exchange benefits me.  In other words, what do I get?  After only a few seconds to a minute, I decide that it's worth it.  For the idea is attempting to break through.  Now, looking at a little more, I don't there's much to get from this exchange.  Therefore, when I see something like this, I will delay it and let him take first.  As I see something that might have been a little more beneficial had I allowed ...cxd5, for after exd5, there's something about white's d pawn that appears to be stronger.  Thus, at the very least, another move like 6.Bg5 ought to have been considered, and in a situation like this, it will be next time.",
        "6. dxc6 Bxc6 7. Bc4": "? Meanwhile, I continue with my development.  The idea is also to castle.  But, the dream still hasn't happened yet, and similar to where I went wrong against Dave, this was only played because it was good during a game against blitzkov.  It's true that I went wrong a move later by bringing the Queen out and going for something similar to SM.  That, however, isn't happening anymore.  And, I have no intentions of bringing out the Queen, yet.  So, my thought was by something that a coach discussed.  But, due to lack of patience, at the time, I was thinking that it worked in that one game, so I'll just play it.  And, nothing else came into consideration here.  But, similar to the game with Dave, it doesn't work here as I am about to lose a pawn.  Had I been more patient, I would've given this more thought, and thus, would've defended with 7.Bd3.",
        "7... Nxe4": "At first, however, I thought that this was mistake and almost took back on e4, until I saw where his LSB was located.  This would've happened, but I based on past positions with what happened in my first training game with Kenneth_fiore_3, I inferred that my Nf3 was my weak N, and that my Nc3 was the good one.  And, that was immediately combined with a different inference that his Ne4 is stronger then my weak N.  So, I decide to exchange with my next move.  Plus, there is a strategy behind it, when he takes on g2.  I felt that I could give him another pawn for gain of tempo because in a position with GM Judit Polgar, a Grandmaster drawed the game by giving up his Rook as stalemate was bound to come.  So, here I try to do that kind of thing.  However, I'm still impatient, and looking into deeper, with best play, black should win.",
        "8. Ng5 Nxg5 9. Bxg5 Bxg2 10. Rg1 Bh3": "I did, however, anticipate this move.  But, the reason why nothing else came into consideration, despite what just happened is that by attacking the B, in the aftermath, my Rook has more mobility.  However, this is most certainly not the right approach which needs to be kept in mind for the future.",
        "11. Qf3": "But, now, I make a threat.  At this point, I realize that my instinct was wrong.  And, he should win the game.  Therefore, I become aggressive and play Hope Chess by threatening mate.  I know that he'll protect, but I'm just hoping that he does in such a way that he overlooks something.  As at the very least, I'd compensate and then some by getting back a pawn and winning the Rook.  And, similar to my second training game with Ken, I started to become confident which should not be.  But, unlike that game, it worked here, against all odds.  However, what's important to keep in mind is that it would not have worked against a more experienced player since they're answer would be 11...e6, and if white were to take on b7, black would develop the N and would keep the initiative.  However, he plays the move that I was hoping he'd do.  So, after 11...Be6, I start the attack, at once.  With that being said, it's worth noting that the dream still hasn't occurred yet, but we're getting very close now.  ",
        "11... Be6 12. Bb5+": "But, not here.  Better would've been take it at once.  With Tunnel Vision, I overlooked that and delivered check instead.  However, I take advantage of that opportunity, after Ken answers with 12...Bd7.",
        "12... Bd7 13. Qxb7 Bxb5": "Not before, but right here, that dream occurred at once.  Had it not, I would've just taken at once with 14.Qxa8, as I didn't think about what was said of, \"When you find a good move, look for something better.\"  Instead, without giving them second thought, I used to just play one move because it was good.  With that coaching from God, I thought about what TA said about the N visualization count, of what the N can do.  So, instead of just taking on a8, I recaptured the B, as I have discovered a new threat which is more dangerous.  But, I wished I had this training earlier in the game, as blundering a pawn or two could've of all been avoided.  Plus, I realize that more experienced players would not have allowed this.",
        "14. Nxb5 f6": "Ken attacks the B, and I wonder what to do.  Like before, I would've played 15.Qxa8?!, if I didn't have that dream.  All I would've thought, contrary to the second game with Kenneth_fiore_3, is that this puts me ahead which should be enough for the win.  But, I have changed, at this point, for good since I finally figured out what's really been affecting my thought process.  And, what is still there is the N visualization count.  This accounts for a good amount of mobility which is going to be overwhelming.  At first, I'd still try to get a Rook.  However, there is one more variation that I looked at which appears to win the Q, instead.  It was after I checked that made me realize that I don't even need it as the patience is only growing here.  Otherwise, I would've taken with 16.Nxa8, getting more then what I would've won earlier. ",
        "15. Nc7+ Kf7 16. Qd5+": "The variation that would've won the Queen was 16...e6.  At first, I was asking what I could do, and then found 17.Bxf6.  Yes, just like before, it was just one other move that I might have considered but would've come close to thinking.  Then, I realized that I don't even need it because that variation leads to mate.  So, winning more material isn't needed or necessary.  With the next move, I just mate at once with 17.Bf4#.  But, had he played 16...e6 I would've check with 17.Qxe6+, and after 17...Kg6, 18.Bxf6.  Taking on d8 right afterwards would've won the Queen.  And, considered it, but instead, would've mated with 19.Qh3#",
        "16... Kg6 17. Bf4#": "So, the important lesson to be learned from this game is that patience is, very much of a virtue.  You must be patient to find the best move and remember the important lessons that you're coach and/or mentor have provided.  Becoming impatient can spell disaster as it has done with my past games on numerous occasions.  I am also planning to annotate the other team game against this same opponent.  For, after having had lost a piece early without compensation, remembering this lesson helped me allowed me to pull a swindle.  As it went from a loss to a draw."
    },
    "url": "https://gameknot.com/annotation.pl/patience-is-of-a-virtue?gm=62410",
    "gameName": "Patience is of a Virtue",
    "players": "jkarp (1309) vs. 1pawnsoon2queen (1353)",
    "opening": "Pirc defence (B07)"
}