{
    "moves": {
        "1. b3": "White opens with Larsen's Opening (sometimes known as the Nimzovitch-Larsen Attack, especially when played 1.Nf3 2.b3), seeking to control the center from the flanks and pressure the Black kingside with control of the long diagonal.",
        "1... c6": "A nonstandard response, this move shows thoughts of transposing into a Caro-Kann variant after ...d5.",
        "2. e3": "White continues his slow play, setting his Bishops free but refraining from placing them just yet, until Black has committed more to his pawn structure. Keene recommends 2.e4 instead.",
        "2... d5": "Seeing that White does not obviously intend to fight over d5 at the moment, Black takes the opportunity to grab a stake in the center.",
        "3. Bb2": "The Bishop quickly reaches its post, preventing Black from following up with ...e5.",
        "3... Bf5": "With no Knights in play yet to drive it off, this seems like a comfortable spot for a Black Bishop, outside any potential pawn wall and leaving room for a Knight on d7.",
        "4. f4": "White gives himself significantly more control of e5, strengthening his Bishop's diagonal considerably. The purpose of his second move is now clear, and Black is in no position to make any aggressive moves against the momentarily-weakened White kingside.",
        "4... Nf6 5. Nf3 Nbd7": "Both players continue their development logically.",
        "6. Bd3": "?! White offers an exchange of Bishops, as White's DSB is much more powerful than Black's is likely to be anytime soon. However, an exchange on d3 will introduce a serious, potentially-exploitable weakness into White's pawn structure.",
        "6... Bxd3 7. cxd3": "White now has a half-open c-file, but no clear way to use it, and a pawn on d3 that looks difficult to defend. On the other side of the board, Black's position is a little cramped, but solid.",
        "7... e6": "White has e5 in a deathgrip, so this seems like the best way to develop the Bishop.",
        "8. a3": "White looks to restrict the range of Black's remaining Bishop, preparing b4 to claw out yet more space for himself.",
        "8... Nc5": "Seeing the impending pawn move that would prevent this attack, Black strikes quickly at the weak e3 pawn and his Knight begins a short journey with the intent of enticing White into additional weakening pawn moves.",
        "9. d4": "White really could use a light-square Bishop to cover these holes in his center.",
        "9... Nce4": "9...Nd3 looks somewhat tempting, but it is hard to support so far advanced and has nowhere to retreat to after 10.Bc3 Qb6 11.Qc2 Qa6.",
        "10. d3": "Logical, but now White's e3 and d3 pawns cannot be defended by other pawns, and are likely to come under fire.",
        "10... Nd6 11. h3": "Seeing Black's cramped position, White seeks to prevent any further expansion by the Black pieces.",
        "11... Be7": "Black prepares to castle and aligns his Queen and Bishop, appraising the h4 square, potentially after the Knight moves ...Nh5-g3, taking advantage of the latest hole in the White pawns.",
        "12. Nc3": "Now White can back up g3 with Ne2, if needed, and this Knight also helps support an advance to e4.",
        "12... Qb6": "Black's play is simple: if White wants to advance his e-pawn, that will leave d4 difficult to defend. The Queen also pressures b3, tying the WQ down to its defense.",
        "13. O-O": "Black is focused on the queenside; White goes Kingside.",
        "13... Rc8": "Preparing ...c5. 13...Nf5 might have been an interesting alternative here, threatening the backward e3 pawn, but after 14.Re1 it's unclear how Black might continue to mount the assault.",
        "14. Rc1": "White prepares to contest the c-file.",
        "14... O-O": "And, with the Rook tension mounting, Black needs to consolidate his own back rank.",
        "15. Ne5": "Now that Black has committed to his position, White brings his Knight up to a strong forward outpost and threatens to blow the position open by pushing the g-pawn to g4-g5, where the Black Knight can't get out of the way because of the threatened fork on d7.",
        "15... c5": "Without any real kingside options, Black opens up the queenside for counterplay.",
        "16. dxc5": "White eliminates his weak doubled pawn and gives his DSB--usually a powerhouse in the Larsen but so far ineffectual--a somewhat brighter outlook on life.",
        "16... Rxc5": "Black ensures that if White manages the fork at d7, it will be as brutal as possible. It might have been more efficient to retake with ...Qxc5, threatening e3 and likely provoking White into kicking out the Queen with 17.d4, ensuring that the e3 pawn stays weak and backward for a long time to come.",
        "17. Re1": "Defending e3 against 17...Rxc3 18.Bxc3 Qxe3+, but pulling pressure off the f-file in the process. 17.Qd2 might have been a stronger choice.",
        "17... Rfc8": "Black wastes no time in doubling his Rooks and prepares a subtle threat, aimed at White's weak center pawns.",
        "18. g4": "White threatens g5, winning material thanks to the powerful e5 Knight.",
        "18... d4": "! Black ignores White's various threats and throws a pawn of his own across the table. This seeming-sacrifice begins a sequence of aggressive moves that threatens to blow White's position wide open.",
        "19. exd4": "19.g5 is an interesting alternative, leading to a variety of equally-violent variations, but after 19...dxe3 20.gxf6 Rxe5 White is forced to drop his Rook for the e-pawn to prevent ...e2+!, and the resulting position (after 21.Rxe3 Qxe3+ 22.Kh1 Qxf4 23.fxe7) is pretty well hopeless for White.",
        "19... Rc5xc3": "! If now 20.Bxc3, Black wins a pawn with 20...Rxc3! 21.Rxc3 Qxd4+.",
        "20. Rxc3": "Of course, this doesn't do much better. White's flimsy pawn structure cannot defend any of his pieces adequately.",
        "20... Qxd4+ 21. Kh1": "21.Kg2 might actually be better here, keeping the King near his far-advanced pawns so he can potentially provide some much-needed support.",
        "21... Rxc3 22. Bxc3 Qxc3": "Now Black has a Knight and Bishop against White's Rook, as well as numerous threats to White's pawns.",
        "23. g5": "White is now looking for a back-rank mate--but he needs to drive away the Knight pair defending e8 first.",
        "23... Nd5 24. f5": "?! Baiting the other Knight away from its guard of c8, but leaving the Ne5 terribly vulnerable and dropping another pawn or two in the process. ",
        "24... Nxf5": "?! I think this is inaccurate--24...Bxg5 25.fxe6 fxe6 (26.Nf3!? Ne3 27.Qc1 Qxc1 28.Rxc1) looks very strong for Black.",
        "25. Qc1": "?! Looking to exchange or, preferably, to drive the BQ off the c-file.",
        "25... Qxc1": "? 25...Bxg5! would be a much stronger play here, picking up another free pawn and denying c1 to the White pieces (26.Qxg5?? Qxe1+ 27.Kg2 Qxe5). The text move donates control of the c-file to White, and forces Black to spend a tempo creating some luft for his King.",
        "26. Rxc1 g6": "Preventing 27.Rc8+ Bf8 28.Nd7 etc.",
        "27. Rc5": "?? There's no strategic reason to put the Rook there, and it hangs anyway. This must be an oversight.",
        "27... Bxc5": "0-1. White has nothing left going for him, and throws in the towel. White's frivolous pawn thrusts left his skeleton vulnerable to counterattack, which Black was able to exploit thanks to his active pieces and the open c-file. Many thanks to mccaddy89 for the good game! Comments on the annotation or the game itself are much appreciated, and if you leave a star rating, please also comment telling me what I did well or need to improve! Thanks for reading!"
    },
    "url": "https://gameknot.com/annotation.pl/pawns-can-never-go-home?gm=45115",
    "gameName": "Pawns Can Never Go Home",
    "players": "mccaddy89 (1436) vs. bwaa (1650)",
    "opening": "Nimzovich-Larsen attack (A01)"
}