{
    "moves": {
        "1. d4": "a Queen's pawn opening...",
        "1... h5": "?! huh? This is a strange opening choice for Black!",
        "2. c3": "I ignore it for now and go ahead with my own development",
        "2... e6": "Opens up the diagonals for the queen and bishop, but Black seems to have no interest in contesting the centre.",
        "3. e3": "and I've finished with my pawn structure - the d-pawn backed up by the c and e pawns.",
        "3... d5": "Black now makes his own claim to the centre ",
        "4. Bd3": "I bring out my bishop, where it sits and waits for a chance to strike. I guess that's the idea for this opening - defence",
        "4... f5": "?! I guess this would be to block my bishop, but still, it's another strange pawn move from Black",
        "5. Ne2": "usually, I play Nf3 in this position, but I was worried about the prospect of 5...g5, which could end up having me lose tempo trying to retreat my knight",
        "5... g6": "it's here that I begin to recognise this position - there are some chess players who do this kind of pawn line-up all over the board. I hate it when that's played against me - it leads to some very cramped play... but then again, here it could hold an advantage for Black as his dark-square bishop is a lot more mobile than my own (one of the drawbacks that discouraged me from this opening for awhile)",
        "6. O-O": "castling kingside, as I normally do, but maybe that should have waited - I just castled to the area of all Black's pawns.",
        "6... Nf6": "Black finally develops a piece, but right now it doesn't hold much of a threat against me",
        "7. Nd2": "Like I've already mentioned, the trouble with this is the lack of mobility of my dark-square bishop - but hopefully White's solid defence should compensate for that",
        "7... Nc6": "Black brings out his other knight, which prompts me to play...",
        "8. b4": "threatening to drive away his knight, and starting a queen-side attack with my pawns (you know, I'm really starting to like my pawns :) )",
        "8... a6": "White prevents my b-pawn from reaching the b5 square...",
        "9. a4": "so I put more pressure on it. This game is starting to open up a little",
        "9... a5": "? a mistake - White can now do what it intended to do in the first place...",
        "10. b5": "drive away the knight!",
        "10... Na7": "? another mistake here - it leave White with a possible future opportunity to attack the knight, as well as leaving the knight with no escape options (the other alternative was Ne7 - definitely the better choice)  ",
        "11. c4": "provoing dxc4, where I could then develop my knight or bishop",
        "11... c6": "huh... It's like Black wants me to attack him...",
        "12. c5": "with pleasure!",
        "12... cxb5 13. axb5": "a pawn trade, which benefits Black more as he gains a passed pawn from it",
        "13... Bd7": "Opening up an escape square for his knight...",
        "14. b6 Nc8": "and Black takes it - White has a lot of pressure on the queenside here",
        "15. Nc3": "eyeing the b5 square - I don't want Black's light square bishop to be there",
        "15... Ng4": "Black opens up opportunities for a counter-attack - White needs to watch out for the queen getting on the h2-c8 diagonal (which is impossible for now, due to my pawns - but my plan involves moving those pawns)",
        "16. Nb5": "I could drive the knight away with h3, but my attack was in full swing... but this was the wrong piece to exchange. The exchange was forced either way, but an exchange with the bishop would have been better as immediately after Black has to deal with the threat here (Nc7+) also, this would count as a closed game, and a bishop-for-knight exchange would benefit Black in that retrospect",
        "16... Bxb5 17. Bxb5+": "then again, Black can say bye-bye to any chances of castling (though I don't see how that could help him in any way here)",
        "17... Kf7 18. c6": "now that the bishop's gone, I can continue with my pawn storm. I plan to take Black's b-pawn next turn to fork Rook and knight (if Black were to move that knight, I would play 19. c7 Qc8 20. Bc6!! which would sacrifice a bishop to give White two extremely powerful passed pawns) (hmm, but is Bc6 worthy of two exclams? What if Black doesn't accept the sacrifice and moves his black bishop?)",
        "18... bxc6": "the best move for Black in terms of material, but White still gains material with...",
        "19. b7": "(!) a pawn fork on two undeveloped pieces! not bad! but then again...",
        "19... Rb8 20. bxc8=Q Qxc8 21. Bd3": "though it was an impressive-looking attack from White, it only got it 1 material pt advantage in the long run, and Black's rook has grabbed control of the b-file, so the results aren't that effective, really",
        "21... Bb4": "defending that passed pawn of Blacks",
        "22. Nf3": "I wish to keep my knight on the board here, plus this move protects h2 from a future Qc7 threat",
        "22... Ke7": "?! A passive move, maybe? this move could just get a plain ? depending on...",
        "23. Ba3": "whether Black should keep his black bishop on the board or not. Because of the pin on the king, the exchange is forced here",
        "23... Bxa3 24. Rxa3 c5": "Black sacs his passed pawn to launch an attack on the centre..",
        "25. Rxa5": "I take it, of course..",
        "25... cxd4": "but Black's pawn sacrifice opens up the c-file for Black's queen! not that there's anything to attack on the queenside but it's definitely something it can work on",
        "26. exd4 Qc3": "A weak threat on the rook, but that's not the only thing the queen does - my knight's pinned down to defending the pan, and my queen's pinned down to defending my bishop, so the only pieces I can move freely are my two rooks",
        "27. Ra7+": "A check with tempo",
        "27... Kf6": "yes, it does look like this is Black's best choice (and it probably is - it defends both pawns on the 6th row) but Black's king isn't as defended as it looks...",
        "28. Re1": "preparing my plan....",
        "28... Rhe8": "White obviously was thinking I was planning an attack on his backwards pawns",
        "29. Ne5": "yes! there's going to be a big storm coming for Black...",
        "29... Qb2": "but first I have to deal with his queen (Qf2+)",
        "30. Re2": "Black may not have actually have had a mating attack, but I wasn't taking any chances - what I wanted to play was h4, threatening mate with Rf7 (actually, the more I think about it, the more I think I should have played h4)",
        "30... Qc3": "keeping the pressure...",
        "31. Rf7+": "again, h4 would have been better, but I was worried about a counter-attack by Black",
        "31... Kg5 32. Qd2+": "and now a Queen exchange is forced, as Kh4 loses to Nxg6#",
        "32... Qxd2 33. Rxd2 Rb1+": "?? It could have been a strong attack, but Black should have manoeuvred his rooks due to my bishop (though it gives me ample time to escape - g3 or h3 perhaps?) ",
        "34. Bxb1": "and Black resigned - it's a shame, this would have been a great game to play out if it wasn't for that blunder (heck, it WAS a great game!)"
    },
    "url": "https://gameknot.com/annotation.pl/pawn-pushing?gm=26778",
    "gameName": "Pawn pushing",
    "players": "x-machine (1176) vs. hegi (1159)",
    "opening": "Queen's pawn (A40)"
}