{
    "moves": {
        "1. d4": "Ding-a-ling!  Time for Round 2 against Grundnorm in the Beafyness tourney.  I get a seemingly reasonable position as white but then a pawn push on the queenside pushes my pieces back and later on black has a decisive pawn majority which nets him a passed pawn.  I try to get my pieces to pile up on it but I do not get the chance to take it free of charge.  The position of the black rook and the Wicked Witch of the West provide the final denouement for me.  I decide to kick off with d4 as I played e4 against him in a recent unrated game and lost so I thought I would mix things up.",
        "1... d5 2. c4 Bf5": "2. ....... Bf5 - an unusual 2nd move, but that bishop stays there until a few moves before the end with devastating effect as that will help to interfere with the co-ordination of my pieces.",
        "3. Nc3 e6 4. Nf3": "4. Nf3 - this was the most popular move and most favourable to white in the database and it does develop a piece.  However, I wonder whether I should have now taken the opportunity to have exchanged on d5.",
        "4... c6 5. Qb3 b6 6. g3 Nf6 7. Bg5 Be7 8. Bg2 O-O 9. O-O": "9. 0-0 - a natural developing move but maybe in light of what happens next I am wondering whether Ne5 or cxd5 was a better option here.",
        "9... dxc4 10. Qxc4 b5 11. Qb3 a5": "11. ......... a5! - here comes that pawn roll.  Glenda now has to retreat fast to her home square.",
        "12. Qd1 b4 13. Nb1": "13. Nb1 - more reverse development, although my knight hops onto d2 on move 16.",
        "13... h6 14. Bxf6 Bxf6 15. e3 Ra7 16. Nbd2 c5 17. Nb3": "17. Nb3 - I cannot play dxc5 here as black will take the pawn on b2.  My knight tries to come to c5, he gets there but unfortunately he just cannot stay there.",
        "17... c4 18. Nc5 Nd7 19. Nxd7 Rxd7 20. Qc1 Rc7 21. a3 c3 22. axb4 axb4 23. bxc3 bxc3": "23. ...... Bxc3 - I manage to avoid losing all my queenside pawns but that pawn majority I talked about earlier has released a deadly passer!",
        "24. Ra3 c2 25. Rb3": "25. Rb3 - I try to avoid allowing black to control the b file.  If I allow black to do this then a rook coming to b1 can have a devastating effect.",
        "25... Qd6 26. Qb2 Qa6 27. Rc1 Qe2": "27. ......... The Wicked Witch comes into my position with devastating effect.  I get on with the process of trying to round up that b pawn.",
        "28. Ne1 Qd2 29. Bf1 Ra8 30. Bd3 Ra2 31. Rb8+ Kh7 32. Bxf5+ exf5 33. Qxa2": "33. Qxa1 - forced or Glenda drops.",
        "33... Qxc1 34. Qa5 Kg6 35. Kg2 Qd1 36. Nxc2": "36. Nxc2 - I must now give up the knight for the pawn to avoid heavier material loss but as discussed in a previous note, those heavies on my first and second rank are a bundle of aggro!",
        "36... Rxc2 37. Qd5 Rc1 38. Rb5": "38. Rb5 - threatening Qxf5# but ......",
        "38... Qh1+ 39. Kh3 Qf1+": "39. ........ Qf1 .  Glenda is obliged to block the Witch's check and desert the white rook on b5.  The Wicked Witch will turn him into mush next move so I wave the white flag.  A delightful lesson on how to convert a pawn majority into a victory - Joanne.\r\n"
    },
    "url": "https://gameknot.com/annotation.pl/pawn-squeezed-part-2?gm=20266",
    "gameName": "Pawn Squeezed - Part 2",
    "players": "jstevens1 (1738) vs. grundnorm (1940)",
    "opening": "QGD (D06), Grau (Sahovic) defence"
}