{
    "moves": {
        "1. e4": "So this game was a mini-tournament created by Pawnbandit.\nIt was a King's Gambit Accepted.\n",
        "1... e5": "In this game, Pawnbandit has agreed to annotate his half of the game and I will annotate my half of the game at pivotal points as play develops. I write comments for the White pieces and Pawnbandit commentates for the Black pieces..I have some comments for black as well. To make this easy I will put Pawnbandits comments in brackets.",
        "2. f4 exf4": "This is where each game in the tournament started. White to move.",
        "3. Nf3": "Nf3 is line for the 3rd move for white. Takes some squares in the center as well as guarding the h4 square.",
        "3... g5": "This seems to be the berlin defense. I'm not positive. It was definitely the favorite for black in this tournament.",
        "4. h4": "This line follows.",
        "4... g4": "(Bg7 is one of many possibilities here but too passive for my taste. I like to force the issue with g4 and see what develops.)",
        "5. Ne5": "This is the best move for white. Anything else is trapped",
        "5... h5": "(Nf6 leads to the Kieseritzsky Gambit and can lead to some interesting games. Here I feel like doing something different with a view to consolidating my extended pawn structure on the king side so I play 5..h5)\n",
        "6. Bc4": "The crucial square in the kings gambit f7. In this position for the Berlin it's easy to kick out.",
        "6... Nh6": "(Developing the knight on the side of the board and defending f7. This looks awkward but is consistent with the king side pawn thrust that follows.)",
        "7. d4": "Castling on the king side would be an obvious mistake now. White's advantage is this game is quick development. This defense slows it down.",
        "7... d6": "(Time to kick away White's centralized knight and open the way for the white squared bishop )",
        "8. Nd3": "I thought here for awhile.\nPlaying 8.Bxf7   Nxf7\n9. Nxf7  Kxf7\n10. Bxf4  \nthen castling king side with a check.\nthat would have been too aggressive and would have failed just as quickly. It could have been interesting though",
        "8... f3": "(This sort of early kingside thrust is often seen in 19th century games and has lead to quick wins for Black)",
        "9. gxf3": "Of course capturing is the best idea here.",
        "9... Be7": "Instead of taking back, black threatens bxh4 .\nBlack wins a pawn as well as stopping white from castling.(Attacking the pawn on h4 and threatening a check which would prevent any chance of queenside castling. )\nI guess this one is pretty clear.",
        "10. Bg5": "White still loses a pawn, but white can now still keeps an ok position.",
        "10... Bxg5": "(The h pawn can't be saved but White's move prevents the check.)",
        "11. hxg5 Qxg5": "(The exchange of bishops ends up winning a pawn)",
        "12. f4": "Trading the pawns here wold be a bad idea. Keeps great center control while keeping the queen at a distance.",
        "12... Qe7": "(Black is now a pawn up and in a favourable position. )\nHowever I did not feel this way. ",
        "13. Nd2 h4": "(A kingside pawn thrust is initiated)",
        "14. Qe2": "This is the only square for the white queen. Castle next",
        "14... h3 15. O-O-O Nc6": "I'm not sure about this move. I think Nd7 would have been stronger.\n(This was a mistake. Better was Nd7 followed by Nb6 )\nWe both agree on this..",
        "16. d5": "It allows white to immediately move my pawn forward and kick out the knight.",
        "16... Na5": "(Hoping to exchange knight for bishop but this is another mistake.\nBetter to return the knight to b8 then head for b6 via d7)",
        "17. Bb5+": "I did not want to trade my last bishop for a knight. ",
        "17... c6": "(Pretty much forced. If the king moves or Bd7 Bxd7 Qxd7 then b4 wins the knight. )",
        "18. dxc6": "This is good for white, now the queenside is opening up.",
        "18... bxc6": "(At least now the knight has the opportunity to escape from a possible b4 but\nat the cost of weakening the queenside. )",
        "19. Ba4": "Not going to trade off the my active bishop for black knight thats not really doing anything anyways.",
        "19... g3": "(At this stage of the game it looked like White's pieces were tied up defending against the kingside pawns so that despite the weaknesses on Black's queenside they were at the moment unexploitable. White presses home his advantage on the kingside.)",
        "20. Rde1": "This was probably a wasted move. gives black tempo with already strong position. I felt i was losing here.",
        "20... g2 21. Rhg1 Bg4": "(A terrible move, pushing the White queen to a perfect square supporting a counter attack )",
        "22. Qf2 Bd7 23. e5": "Start going forward in the center. ",
        "23... d5": "(d5 was a very strong move threatening to open up the centre. I didn't have much choice here. )",
        "24. Nc5 O-O-O": "Seems safe for black. But maybe he was just as safe in the center.\n(Developing the rook with a view to supporting a future advance on the kingside. )",
        "25. Na6": "Obvious threat of Qxa7.",
        "25... Kb7": "This is better than moving the bishop off the c pawn.\n(Forced. Allowing Qxa7 would be fatal. )",
        "26. Nc5+": "This is a much better square for the knight. I could have guarded with the queen. But I had other ideas for her.",
        "26... Ka8 27. Nf3 Ng4": "(Drumming up some counterplay. )",
        "28. Qd4": "The idea behind this was next Qb4 threatening mate on Qb7. Also attacking the knight.",
        "28... Nb7": "(Encouraging the exchange of the dangerous knight on c5. )",
        "29. Nxb7": "This is possibly a mistake for white. I have played Na6.",
        "29... Kxb7": "(With the knight now gone, Black can breathe a bit easier and press home his advantage on the kingside. )",
        "30. Kb1": "Some people would consider this a waste.",
        "30... h2": "Good move by black. White can't take on g2, it loses a rook.\n",
        "31. Nxh2": "And here I thought about resigning.",
        "31... Nxh2": "(With the knight now gone, Black can breathe a bit easier and press home his advantage on the kingside. )",
        "32. Re3": "Still can't take g2. Because of Nf3 pinning my queen and rook.",
        "32... Rdg8": "Guarding his passed pawn. This gives white the tempo back. ",
        "33. Ra3": "The idea of 34. Bxc6 Bxc6 35. Qa7  winning the queen.",
        "33... Kb8": "Great defensive move by black.",
        "34. Qf2 Qh4": "This leaves behind the c5 square\n(Hoping to exchange queens and move into a winning end game. )",
        "35. Qc5 Qxf4": "(A terrible blunder and a losing move for Black. Defending the c5 square was critical in this phase of the game )",
        "36. Bb5": "If black takes. Rxa7 and white has mate in a few moves.",
        "36... Qxe5": "Another great defensive move. Winning another pawn\n(Kc8 is hardly any better. After Rxh7! Black quickly loses. )",
        "37. Qxa7+ Kc8": "(Its all over for Black now.)",
        "38. Qb6 Bf5": "Black still can't take on b5 because of Ra8 . which leads to mate. Blacks also gives his king the d7 square to flee.",
        "39. Ra7": "Keeping the king on the back rank",
        "39... cxb5": "Black is lost now. ",
        "40. Qb7+ Kd8 41. Ra8+ Bc8 42. Rxc8#": ""
    },
    "url": "https://gameknot.com/annotation.pl/pawnbandits-kings-gambit-accepted-challenge?gm=12853",
    "gameName": "Pawnbandit's King's Gambit Accepted Challenge",
    "players": "emtogsdia (1479) vs. pawnbandit (1755)",
    "opening": "KGA (C39), Kieseritsky, long whip defence, Jaenisch variation"
}