{
    "moves": {
        "1. d4": "Queen's Pawn Opening",
        "1... Nf6": "King's Indian Defense",
        "2. c4 g6 3. Nc3 Bg7 4. e4 d6 5. Nf3 O-O 6. Be2 e5 7. d5 Nbd7": "Is 7...a5 preferable to stop the b4 push?",
        "8. b4": "And there is the b4 push.",
        "8... b6 9. O-O a5": "Better late than never?  Need to deal with the aggressive Queenside expansion and make some room.",
        "10. Ba3 Ba6 11. bxa5 bxa5 12. Qc2 Nb6": "Attacking the c4 pawn twice.",
        "13. Nb5": "Revealing the Queen as a second defender to the c4 pawn.",
        "13... Qd7": "Adding another attacker to the b5 square.",
        "14. Rab1": "Adding another defender to the b5 square.",
        "14... Rab8": "Adding a revealed attacker to b5 after 15...Nxc4.",
        "15. Nd2": "Adding another defender to c4.",
        "15... Nxc4": "Breaking open the Queenside and winning a pawn.",
        "16. Bxc4 Bxb5 17. Bxb5 Rxb5 18. Rxb5 Qxb5 19. Rc1 Bh6": "Attacking the Knight and skewering the Rook.",
        "20. Rb1": "Attacking the Queen.",
        "20... Qe2": "Attacking both the Knight and the e4 pawn.",
        "21. Rb2": "Adding pressure on the second rank but leaving the back rank undefended.  I looked long and hard at a way to exploit this but came up short.  21...Qe1+ is met with 22.Nf1.",
        "21... Bxd2 22. Qxd2 Qxe4 23. Qxa5 Nxd5": "Taking two pawns for one and bringing the Knight into the action.",
        "24. Qd2 Ra8": "Attacking the bishop.",
        "25. Bb4": "If 25...Nxb4 then 26.Rxb4 takes back and attacks the Black Queen with tempo.  Instead...",
        "25... Rxa2": "!!  If 26. Rxa2 then 26...Qb2+ wins it back and gains a pawn.  So instead...",
        "26. f3": "I honestly did not consider this move but Black is up three pawns and exchanges are to his advantage so...",
        "26... Rxb2": "Attacking the Queen.",
        "27. fxe4 Rxd2 28. Bxd2 Nf4": "Keeping the third pawn.  And now we enter the endgame where Black has a decisive advantage.",
        "29. Kf2 Kf8 30. g3 Ne6 31. Ke3 Ke7 32. Kd3 Kd7": "Moving the Black King to support the strong central pawn push.",
        "33. h4 h5 34. Be3 c5 35. Kc4 Kc6 36. Bf2 f5 37. exf5 gxf5 38. Be3 d5+ 39. Kd3 d4 40. Bd2 Kd5 41. Bg5 e4+ 42. Kd2 e3+ 43. Kc2": "As the King is driven away the Bishop can safely be exchanged for the Knight.  Better might be 43. Bxe3 but White would still be in the worse position.",
        "43... Nxg5 44. hxg5 Ke6": "Calculated that White has no chance of making a Queen without being caught while Black can Queen without being caught and White resigned."
    },
    "url": "https://gameknot.com/annotation.pl/pawns-really-can-make-a-difference?gm=51098",
    "gameName": "Pawns Really Can Make a Difference",
    "players": "ral1268 (1674) vs. johnmv1 (1681)",
    "opening": "King's Indian (E93), Petrosian system, main line"
}