{
    "moves": {
        "1. e4 c5": "The starting position for the mini-tournament.",
        "2. Nf3": "This response is very flexible for white, avoiding the closed sicilian (2. Nc3) and the grand prix attack (2. f4)",
        "2... g6": "The accelerated dragon.  Often, the goal in this opening is to proceed as a regular sicilian dragon but to delay d6 in order to get in d5 directly, thereby saving a tempo.",
        "3. d4 cxd4 4. Nxd4 Nc6 5. Nc3": "Book so far, but many top level players prefer 5. c4!? here, setting up the Maroczy bind.  \n\nFor me, however, I'm content to go ahead and develop my pieces at leisure.",
        "5... Nf6 6. Be3 Bg7 7. Qd2": "!?  Alright, now we have to take a look at what's going on here.  If black had played d6 by now, white could play f3, setting up the yugoslav variation of the sicilian, which has very interesting chances for both sides.  I *like* the yugoslav as white, but black hasn't played d6 yet.  The pawn serves an additional purpose by being on f2; more on this in the note to move 12.\n\nMy analysis tells me that if black and I both castle (him short, myself long), and he plays d5, the game will continue roughly as a standard yugoslav with 9. 0-0-0 instead of 9. Bc4 (and without f3).  I do note, however, that I could have played Bc4 here, instead of Qd2, preventing black from playing d5 directly.",
        "7... O-O 8. O-O-O": "I could have played Bc4 here as well, but after 8. ... d5, I believe the exchanges favor white (slightly).  Let's see how it plays out.",
        "8... d5": "8. 0-0-0 d6 9. f3 would transpose back into the standard yugoslav, but this is the most aggressive continuation for black.",
        "9. exd5 Nxd5 10. Nxc6": "The best recapture for white, isolating black's pawn on the c-file.  By the way, only with this move do we leave the game DB.",
        "10... Bxc3": "?!  An interesting try, but bxc6 was better, as this loses a pawn tactically.",
        "11. Nxe7+": "!  Black cannot recapture with the knight or he loses a rook, and a king move loses a full minor piece.  Black must play Qxe7.",
        "11... Qxe7 12. Qxd5": "And now white is up a pawn.  Note how useful it is for white to have NOT played f3, as the pawn on f2 protects the Be3.  (I had to calculate this back on move 7 -- something I couldn't have done were this not correspondence chess!)",
        "12... Be6": "Completing development and tempoing the queen, which will allow black to save his dark squared bishop.  White is up a pawn, but black has a lot of open lines towards white's king.",
        "13. Qd6": "Offering a queen exchange to blunt the firepower in black's attack.",
        "13... Qxd6": "The only way to keep the dark bishop on the powerful a1-h8 diagonal is to exchange queens here.",
        "14. Rxd6 Be5": "Hitting the rook and forcing it into a more passive position.  Black is down a pawn, but his bishops are in command of the board.  Compare the activity of the black bishops to the passivity of the white ones.  (And keep an eye out for a reversal of fortunes.)",
        "15. Rd2": "! The best square for the rook.  It allows the Bf1 to develop and gives the Rh1 full freedom along the back rank.  The one care is that the dark squared bishop must guard against a move like Bf4.",
        "15... Bxa2": "?? Back before Bobby Brown was known for beating his wife, doing drugs, and singing the monster mash with Mike Tyson, he had a song that went,\n\n\"Kiss her, miss her, love her... that girl is poi-i-son\"  \n\nThat pawn on a2 looked poisonous to me that I didn't really consider black would take it.  On the other hand, with so few pieces left on the board, can it really be bad to take a pawn?  I had expected Ra-c8, and that was part of the reason I played Rd2 on my last.  But now I had to think.  My game note to myself was \"does 16. b3 trap the bishop?\"  I spent a couple of days thinking about it, and then played...",
        "16. f4": "!?  I like this move as an in-between move.  It drives the black bishop back to either f6, g7, or h8, as any other move simply allows white to play 17. b3, 18. Kb2 and the bishop falls without a fight.  Also, it allows the Be3 to move freely without having to worry about the rook getting pinned to the king.",
        "16... Bg7": "Hard to argue with that choice, as it preserves the possibility of a pin on the Rd2 if white blunders.",
        "17. b3": "!  Alright.  Time to prove that this bishop made a mistake on the 15th!",
        "17... Rac8": "Threatening Bxb3, where the bishop is immune due to the pin along the c-file.  White would love to play Kb2, but that pesky bishop on g7 prevents it.",
        "18. Bc4": "!  A good continuation.  Now Bxb3 is impossible.  How will black respond?",
        "18... a5": "?  Too slow, I think.  Perhaps best for black was to play b5 immediately, or even to play Rxc4, giving up the exchange for a pawn and the bishop pair (and chances).  One mistake doesn't usually lose the game, but two can be decisive.\n\nNow, white has the means to win the bishop.",
        "19. Bd4": "!  Blocking the dark-squared bishop's path to the b2 square, and allowing the king to get in there.  Note the contrast between the positional power of the white bishops after this move vs. after black's 14th.",
        "19... b5": "This is definitely too slow now.  Black needed to try Rxc4 and try his luck in an inferior endgame.",
        "20. Bxg7": "!  The black bishop on a2 is lost now.  Black must recapture with the king or white simply has an overwhelming advantage.",
        "20... Kxg7 21. Bd5": "!  Much better than Bxb5, where black escapes with equality.  The Ba2 is completely trapped.",
        "21... Rfd8": "Attempting to complicate...",
        "22. Kb2": "But the threat is a phantom.  The bishop will fall and all black will get is a pawn at most.  After 22. ... Rc5 (the only way to threaten the light-squared bishop), 23. Rh-d1 clinches the win for white.  Black resigns 1-0.\n\nThis game just goes to show that pawn-grabbing is not just bad in the opening, but can be fatal even in the endgame!"
    },
    "url": "https://gameknot.com/annotation.pl/pawn-poison-can-be-fatal?gm=4100",
    "gameName": "Pawn Poison can be fatal...",
    "players": "ethansiegel (1817) vs. reubenfine (1612)",
    "opening": "Sicilian (B27), Hungarian variation"
}