{
    "moves": {
        "1. e4": "Hi everyone!\n\nFirst and foremost, my biggest thanks to hityerclock for commenting on my annotations. Next, I just don't know what has been happening to my game lately.  I have been falling for a rash of one move blunders lately and this game has been one of them, although I was lost the previous move.  This game started off as a Sicilian Dragon type game with both sides castling on opposite sides, white on the queenside and black on the kingside.  We are in the book for quite a while before I decided to challenge rooks on the c column.  Black then threw me a curve with a piece for 2 pawn sac which proved decisive later on.  So, how did all this happen, well, read on.  Gameknot analysis is provided here. http://gameknot.com/analyze-board.pl?bd=16090381&rnd=0.8934997643125019",
        "1... c5 2. Nf3 g6 3. d4 cxd4 4. Nxd4": "4. Nxd4 - fairly standard main line Sicilian moves.",
        "4... Nc6 5. Nc3 Bg7": "5. ..... Bg7 - the Dragon bishop - this bishop can be quite a moster for Henry to deal with should black mount a standard a3, b5 pawn storm etc.",
        "6. Be3 Nf6 7. Bc4 O-O": "7. ..... 0-0 - black goes kingside, nacht.",
        "8. Bb3 d6 9. f3 Na5 10. Qd2": "10. Qd2 - Glenda moves to d2 to clear the decks and to think about an exchange of dsbs on g7.",
        "10... Bd7 11. O-O-O Nxb3+ 12. cxb3": "12. cxb3 - N for B trade.",
        "12... Qb8 13. Kb1": "13. Kb1 - Henry seeks protection behind his pawns so that he does not need too many pairs of medieval stockings from Glenda to deal with the draughtiness.",
        "13... b5 14. g4 b4 15. Na4": "15. Na4 - black does not like this move - here are his comments:-  15.Na4 was a mistake on your part, as that N is now out of play, and in fact allows Bxa4, displacing the pawn on b3 with one move and giving me counter-play. Better would have been retreating to e2 where it supports the one on d4, and can swing in to f4 or g3 to help with the attack, and also forcing me to use two moves (a5/a4) to dislodge the b3 pawn if I want to press my attack. When each side is attacking on an opposite wing like this, tempo is very important.\" - but it seems to be book.",
        "15... Rc8 16. Rdc1": "16. Rc1?! - black likes this move even less and here is what he also said in his post-match pm.  \"I think your downfall was playing 16.Rc1, which immediately stalls your k-side attack and leaves you without any counter-play. I was expecting 16.h4 or 16.Bh6, continuing to press on the K-side. In fact, this is pretty much mandatory in these types of positions.\" \n",
        "16... Qb7 17. Rxc8+ Rxc8 18. Rc1 Nxe4": "18. ..... Nxe4 - after the exchange of one pair of rooks black now sacrifices a piece for two pawns.  Here is what he said in his post-match pm. \"The GK computer doesn't seem to like my Nxe4 sacrifice and indicates that it gives white an edge, but I disagree. I think it's black's best attempt to punish white for Rc1. I get at least two pawns for the N, the two bishops become very active, and white has king safety issues. \n\nThis is clear positional compensation for the material, and in my (admittedly biased) opinion, white no longer winning chances after that.\" \n",
        "19. fxe4": "19. fxe4 - hmm, maybe I should have traded rooks before playing this move.  Glenda could not have been captured because black's king would have been in check.  At least it would have cut down black's attacking power which was bearing down on Henry.",
        "19... Rxc1+ 20. Kxc1 Qxe4 21. Nc2": "21. Nc2 - defending the back row and blocking off the c column.",
        "21... Bxg4 22. Bxa7": "22. Bxa7?! - hmm, black did not like this move and said \"I think your best chance to hold the position would have been 22.Qxb4 (instead of Bxa7) and 23.Nc3, getting your wayward N back into the game, then try to blockade the center pawns with your N's. Otherwise, the black pawns will just scurry like cockroaches towards the first rank.\" \n",
        "22... Bh6 23. Be3 Qh1+ 24. Ne1 Bxe3 25. Qxe3 Qxh2": "25. ...... Qxh2 - now the Wicked Witch of the West blasted off my only kingside pawn (tears!).  Did you ever see such an imposing looking pawn mass?",
        "26. Qd2 Qg1 27. Qxb4": "27. Qxb4 - a few moves too late.  My queenside passers will be no match for black's kingside passers.",
        "27... h5 28. Qb8+": "28. Qb8+ - a desperate attempt to get among the black pawns and to, perhaps, give black Ye Olde Perpetualle.  Black is having none of it and just moves his king to g7.  In order to enable Glenda to do this, Henry decided to defend the pinned knight on e1.  Unfortunately he could be checked away from that square by the evil witch.",
        "28... Kg7 29. Kd2 Qf2+": "29. ..... Qf2+ - and so the Wicked Witch of the West will take my knight next move.  This is the one move blunder I fell into.  However, I feel that it was only a matter of time before black uses one of those black passers on the kingside to resurrect the evil one's sister, the Wicked Witch of the East and both those besoms would make Henry's life sheer hell on earth.  There was only one thing to do, wave that bally (as Coach Ion would say!) white flag."
    },
    "url": "https://gameknot.com/annotation.pl/pawn-mass-acred?gm=39603",
    "gameName": "Pawn Mass-acred!",
    "players": "jstevens1 (1795) vs. hityerclock (2218)",
    "opening": "Sicilian (B27), Hungarian variation"
}