{
    "moves": {
        "1. d4 d5 2. Nc3 Nf6": "This is a Veresov wich is going to have some nice pawn formation.",
        "3. Bf4 a6": "Just preventing a close Knight",
        "4. Na4 e6 5. c3 Nh5": "Pawn close up, nice diagonal formation, symetric but whit a bishop thretning c2",
        "6. e3 Nxf4": "Went for a change to open Kings column",
        "7. exf4 c6": "Another close up by pawns, nice picture. Note that a prision has been formed leaving the white Knight trapped, it´s doomed.",
        "8. Nf3 Nd7 9. Ne5": "I think this is not too good for white",
        "9... b5": "Pressure on the prisioner",
        "10. Nc5": "Two Knights front attack, but note that there is +1 for the black, 11. Nc4xN d4xc5 12 Bc4x.. ",
        "10... Nxc5 11. dxc5 Qc7": "Cautelous defence for breaking formation",
        "12. g4 f6": "I think i should won the pawn first, but well, pressure to the K see what happen",
        "13. Nd3 e5 14. fxe5 fxe5 15. b3": "This is a good formation, going for a fresh start, like new attack, or contraoffensive, black winning place",
        "15... e4": "New pawn structure. Stairways formed giving a diagonal strong attack, i don´t know why but two diagonals cover usually falls into mistakes, they are hard to see (in this level of play of course). I mean diagonals by Bc1 and Qc2.",
        "16. Nf4": "See what i mean, but even g4 was doomed whit Knight retreat, ohh humans!! didn´t want to retraet and fell in, no one can blame, Knight to the back and  restores the original chess position, is awful so mind play tricks on us.",
        "16... Qxf4 17. c4": "White searching room for a Queen-Rook counter attack maybe, if holes are open",
        "17... Bxg4": "Completing the attack, Queen Bishop went downstairs, formation by pawn holding the white offensive",
        "18. Be2 Bxc5": "Most completed",
        "19. Rf1": "White into the waters of black evil",
        "19... Bh3 20. Bh5+": "Inoffensive check",
        "20... Kd8 21. f3": "And awful move",
        "21... Qe3+": "Check and the rest is clear. 21 ..Qe2 22 Qc3 and rook dies",
        "22. Qe2 Qc3+ 23. Kd1 Qxa1+ 24. Kc2 Bxf1 25. Qd2 Bd3+ 26. Qxd3": "Attack worked and queen dead is going for mate",
        "26... exd3+ 27. Kxd3 Qd1+ 28. Kc3 b4+ 29. Kb2 Bd4#": "And a good looking mate! So Veresov, without a plan by white, retreating can be devastating. But i found really interesting the pawn structures i repeat: \n5. Diagonal bicoulur formation, symetric (with a white bishop pushing just a little more)\n7. Semicircle Prision to white Knight\n14. Refreshing the attack, linear formation\n15. Stairway formation\n17. Stairway holding, Queen and Bishop double attack.\n\nThanks!!\n"
    },
    "url": "https://gameknot.com/annotation.pl/pawn-structures-on-veresov?gm=46609",
    "gameName": "Pawn Structures on Veresov",
    "players": "justinrocks (1130) vs. ofiuco (1207)",
    "opening": "Blackmar-Diemer gambit (D00)"
}