{
    "moves": {
        "1. e4 e5 2. Nf3": "The King's pawn opening, followed by knight development threatening the pawn. All standard stuff for me\n",
        "2... Qf6": "?! 2...Nc6 and 2...d6 both seem to be better here. Bringing out the queen this early could be bad for Black...\n",
        "3. Nc3": "White brings out his other knight, while threatening to pressure the queen with 4.Nd5\n",
        "3... c6": "Although this is mainline (according to the DB) and it does prevent Nd5, it also blocks any of the good squares for Black's queenside knight\n",
        "4. Bc4": "continuing development, but this move can be dangerous in light of...\n",
        "4... a5": "...this move (though I didn't understand it at the time). I say 'can be dangerous' because the bishop isn't threatened with capture yet, as it can still retreat along the f1-a6 diagonal... (but if White wishes to keep the bishop on the a2-f8 diagonal, the best move would be to move the a-pawn)\n",
        "5. d3": "? Blocking that retreat is probably the worst thing that White can do here...\n",
        "5... b5": "! now 4...a5 is justified. White's bishop can't retreat to the b3 square because of 6...a4\n",
        "6. Nxb5": "the best way to get something out of the situation - Black will end up a point up\n",
        "6... cxb5 7. Bxb5 h6": "?! too slow - it allows White at a lead in development which may compensate for the point disadvantage... \n",
        "8. O-O": "developing, getting my king to safety\n",
        "8... Qb6": "Threatening the knight, but that's easily countered...\n",
        "9. c4": "White doesn't want to retreat the bishop, so he simply supports it with the pawn. Since Black has left the e-pawn hanging, his next move would probably have to be defending that pawn\n",
        "9... g5": "nope - Black looks to be thinking about a kingside pawn storm. I don't fear that yet...especially since Black has no developed pieces other than his queen... (also, the h5 square could prove to be a weak square for White)\n",
        "10. Nxe5": "White eagerly snatches the chance to regain material equality - a knight for three pawns\n",
        "10... Rh7": "this move makes no sense whatsoever... even if Black was looking to move the rook over to the g-file, why didn't he just move the knight first? (though as I look at this, I see a knight sac opportunity if Black hadn't made that move; 11.Nxf7 Kxf7 12.Qh5+ Kg7 [any other move is met with Bxg5, as the h-pawn is pinned to the rook] 13.b3.... it seems to be a powerful attack from White, and I would have tried it if I had the chance, but whether it amounts to anything...) [actually, I would have given this move a ??, but it actually saves Black from a devastating attack later on in the game...]\n",
        "11. Be3": "White brings his other bishop into the action, with a threat to the queen as well!\n",
        "11... Qc7": "Black sidesteps the attack and makes a counter-threat on the knight on e5.\n",
        "12. d4": "White is playing aggressively here - again, his piece chooses not to escape, and remains a threat to Black\n",
        "12... Bd6": "Black threatens to win a pawn with 13...Bxe5 14. dxe5 Qxe5, while developing one of his pieces. The best move for Black in this position, I think \n",
        "13. f4": "here we are - the four-pawn strong centre! White's move, here, has prevented the pawn loss, and put a real cramp in Black's game. (13...gxf4 14.Bxf4 keeps the defence up, as well as giving an open file for White's rook on the f-file (well, after the bishop moves, of course)\n",
        "13... f6": "I have a feeling that Black saw the moves up to move 18 when he played this move  - all of White's moves are pretty much forced if he wanted to retain his material (apart from move 15 - the move I played there dropped a pawn, but I don't regret the choice looking back at this game...actually, it may have been that Black saw up to move 18 from move 15...I don't know) This moves does seem weakening at first (it probably is, now I think about it) and Qh5+ does come into consideration, but I couldn't see any way to continue the attack (in fact, it actually justifies Black's Rh7 - after Qh5 now, Kd8 doesn't fall far a King/Rook fork, and Kf8 and Ke7 doesn't fall for Qf7 mate)\n",
        "14. Ng6": "the only move which can save the pawn on f4, but I like this move all the same - the knight is actually pretty powerful on the g6 square\n",
        "14... Ba6": "Black keeps his threats fresh - If White exchanges the bishops, Black will be threatening the capture of the c-pawn. If I had played Bxa6 here, my move to save the c-pawn would have transposed into the game continuation which occurs at move 19, albeit with slight differences. It could have also been possible to allow Black to initiate the exchange at b5, ut that would leave my pawn in an uncomfortable position\n",
        "15. Qa4": "!? As I said before, this move will drop a pawn (though not directly) but it seemed perfectly natural at the time - as I wasn't ready to advance my pawns just yet, replacing the bishop with the queen to keep up the pressure couldn't be bad from White's point of view\n",
        "15... Bxb5": "Since the queen now protects the c-pawn, White would be able to safely trade bishops, so Black decides to initiate the trade himself\n",
        "16. Qxb5 Rg7": "Here's that pawn-winning move - White's knight has nowhere to move to (apart from the h8 square, where Black might want to try a draw by 3-move repetition with Rh7) Therefore, White's only logical move here... (bearing in mind that the queen now cannot move to the h5 square)\n",
        "17. f5": "opens up the h2-b8 diagonal, and Black's bishop and queen are perfectly aligned...\n",
        "17... Bxh2+": "Of course\n",
        "18. Kh1": "forced; 18: Kf2?? Qg3+! 19.Ke2 Qxg2+ 20.Ke1 Bg3+ 21.Bf2 Qxe4+ 22.Kd2 Bxf2 23.Rxf2 Qxd4+ 24.Ke1 and White's strong pawn centre, and his game, is ruined [or; 22...Qxf5, forking the now undefended knight and the doubly attacked, and pinned bishop - actually, this move is better, I think] Now, although Black has just gained a pawn, his bishop is in a dangerous position, and could be suddenly threatened by White blocking the queen's scope with the pawn to e5. It was one of the first things that I had considered, but what I was afraid of was this; 19.e5 Bxe5 20.dxe5 fxe5 and although Black has given up his material advantage, White's pawn structure is scattered - not good [21.Nxe5?? Re7! 22.Ng4 h5 and Black wins material] \n",
        "18... Bd6": "Thankfully, my opponent makes things easier for me, and now I decide that an attack is in order here\n",
        "19. c5": "Here it comes!\n",
        "19... Be7": "? Retreating back to the f8 square seems so much more better here - now White can advance his d-pawn with tempo...\n",
        "20. d5": "Threatening a pawn fork at d6 - Black will have to retreat one of his pieces again\n",
        "20... Bd8": "right now, none of Black's pieces have extended past the 8th and 7th rank, and White's pawns severly cramp Black's position - he will have quite a fight on his hands if he wants to get back into this game\n",
        "21. Bd4": "another advantage of White's position is that he has threats - now Black's best move (there really isn't much else he can do) would be to move the rook...\n",
        "21... h5": "Like I said, Black's short of choices here (I think the best move he could try is Na6)\n",
        "22. e5": "White's wall of pawns have advanced to the 5th rank, and Black can't take the pawn because White will fork rook and queen when he takes back with the bishop. Before I go on, though, I'm just going to look back at move 15 for awhile... What if, instead of 15.Qa4, White had decided to exchange bishops instead; 15.Bxa6 Rxa6 16.c5 Be7 17.d5 Bd8 18.Bd4 Rg7 19.f5 h5 20.e5 [yes, I do realise Black would probably have played 15...Nxa6 and would have probably not played 18...Rg7, but bear with me] This would be pretty much the same position, only with the rook on a6 and the queen on d1 - I'm putting a diagram up on that [again, not needed, but since I already asked another player, I didn't want his advice to go to waste :)] If that had happened, the play could have continued; 20...fxe5 21.Bxe5 Qxc5+ 22.Kh1 R7xg6 23.fxg6 Rxg6, with an even trade and an easier position for Black (though I'd still give White the advantage) That's only with two pieces in different places as well! [I have no idea why I put all this up... I just felt like it, I guess :P]\n",
        "22... g4": "I guess Black might have thought that White couldn't attack if he kept the position closed (or he just didn't see any other move) but best here would have been Kf7, moving the king out of the line of fire of White's next move... though White still has excellent attacking opportunities e.g. e6+, Qc4 or even what was played next in this game... [maybe moving the rook would have been better]\n",
        "23. Rae1": "! here comes the pain...\n",
        "23... Rf7": "Black sees the danger of exf6 (which would win the rook) but Black will still lose material...\n",
        "24. exf6+": "Because of the g6 knight, the Black king has nowhere to run. He must use a piece to block the attack\n",
        "24... Be7 25. fxe7": "Now White is a piece up, and has a well protected pawn on the seventh rank\n",
        "25... a4": "still no good moves for Black...\n",
        "26. Nh8": "continuing on with the attack. White hopes for 26...Rh7 27.f6 Rxh8 28.f7#. That would have been an awesome checkmate - Only Black's queen would have been developed (even the king's in the original position!) and White has two seventh-rank pawns backed up by two rooks sealing the Black King's fate. Black has one more choice...\n",
        "26... Rxe7": "and although it was better here, it is about to lose more material... [I suspect Black was happy to finally show some activity]\n",
        "27. d6": "! A pawn fork on the queen and the pinned rook 27...Rxe1?? 28.Rxe1! wins the queen\n",
        "27... Qc6": "offering to exchange queens. After the material White's going to win, sure! :)\n",
        "28. Rxe7+": "recapturing with the pawn seems to win more material, but you'll see why I chose to recapture with the rook in just a little bit...\n",
        "28... Nxe7 29. Qxc6 dxc6": "I think taking back with the b-knight would have been better here\n",
        "30. dxe7 Kxe7 31. f6+": "White uses the power of his pawns once again - his threats are never-ending!\n",
        "31... Kf8": "Black's natural defence....\n",
        "32. f7": "and most of the time, this would work...\n",
        "32... Nd7": "Black sees that the king can be forced off the f8 square, and opens up the line for the rook to defend. The problem is...\n",
        "33. Ng6#": "Where does the king go? An unusual checkmate, and a very enjoyable game! I have a newfound respect for my pawns :)\n"
    },
    "url": "https://gameknot.com/annotation.pl/pawned?gm=28806",
    "gameName": "Pawned!",
    "players": "x-machine (1297) vs. jrm12 (1252)",
    "opening": "Greco defence (C40)"
}