{
    "moves": {
        "1. b3 d5 2. Bb2 Bg4": "This is brand new for me -- I've never even prepared for it in my opening database.\nI know that I need to play Nf3. I'm guessing that he's ready to capture on f3, and I can't imagine taking back gxf3.\nBut having pawns on f3 and f2 isn't a completely bad arrangement. They protect e3 and e4 from invasion, and it makes me want to play d4 to control e5, too.",
        "3. Nf3": "Sometimes I think that the most valuable thing about extremely uncommon moves like Bg4 is it creates doubt in my mind about my opening. I'm thinking it's because I don't play and read chess so frequently that I have more natural confidence in what I'm doing.\nBut isn't that an ongoing trade-off? The beginners I teach are always extremely confident -- so confident that they move way too fast and tend to fall off the virtual cliff because of the simple things they overlook. ",
        "3... Nd7 4. e3 e5 5. h3 Bf5": "I expected him to take the knight. What am I missing here?",
        "6. Nxe5 Nxe5 7. Bxe5 Qe7 8. Bb2": "Now I'm a pawn up, so it's time to complete my development.",
        "8... O-O-O 9. Be2 Kb8 10. O-O Qg5 11. Bg4": "Normally, you wouldn't offer this trade to weaken your pawns. But I'm already ahead by a pawn. I want to make trades. And the doubled pawns don't come close to compensating him for my extra pawn.",
        "11... Bxg4 12. Qxg4 Qxg4 13. hxg4 Ne7 14. f4": "I'll be getting my knight out soon. I haven't decided whether to put him on a3 (then where would he go) or d2 heading to f3. I'm not ready to block my bishop yet. In the meantime, I know that I'll need to make this move, so I'll go ahead and do it and see what his plans are. ",
        "14... h5 15. gxh5 Rxh5 16. Nc3 Nc6 17. Ne2 Nb4 18. Nd4 Rd6 19. a3 Nxc2 20. Nxc2": "I sure didn't see that move coming -- I don't see what his plan is, yet. But one of the open principles is that the best way to refute a sacrifice is to accept it. (Sometimes)",
        "20... Kc8": "So I think his last move was just a mistake. I don't see any fantastic follow-up for him. Now, I just need to trade off some more pieces and win in the ending. I look at this position and can confidently say that no one's going to checkmate in the middle game -- the winner will be the person that gets another queen. That's what I'm working towards.",
        "21. Rac1 Ra6 22. b4 Kd7 23. Nd4 Rb6 24. Rc2 Bd6": ""
    },
    "url": "https://gameknot.com/annotation.pl/pawn-generosity?gm=35749",
    "gameName": "Pawn Generosity",
    "players": "chuckbo (2004) vs. bozzoh (1967)",
    "opening": "Nimzovich-Larsen attack (A01), classical variation"
}