{
    "moves": {
        "1. d4": "So I start with my usual",
        "1... Nf6 2. c4": "Still very normal",
        "2... c5 3. d5": "So into the Benoni-Benko systems. White has a slight space advantage. But will play his Bf8 to g7 and try to build up pressure along the long black diagonal, combined with play on the Queen's side. White may try for a large break through in the centre and/or a king side attack. It is quite unbalanced, which is why it is popular. According to the stats, 2.....c5 leads to less draws and more wins for both White and Black.",
        "3... b5 4. cxb5": "So Dave goes for what the English-speaking world call the Benko Gambit, after Pal Benko, a Hungarian-American Grandmaster who provided many of the ideas. In other countries it is known as the Volga Gambit. Black gives up a pawn on the Queen side. The idea is to get open a and b files, which combined with the Bg7 can give overwhelming pressure on the Queen side. The advanatages of this system is that Black's initiative and pressure can last well into the endgames and can continue even if a number of pieces have been exchanged. It is also a relatively easy system to play for Black.",
        "4... a6 5. Nc3": "I prefer this to just falling in with Black's idea by taking the second pawn. There are some interesting lines here, such as 5. Nc3 axb5 6. e4 b4 7. Nb5 Nxe4 8. Qe2 (if Black moves the knight White has Nd6 mate!) f5 9. f3 Ra5 10. fxe4 Ba6 11. exf5 Bxb5 12. Qh5+ g6 13. fxg6 Bg7 14. gxh7+ Kf8 with advantage to white. Zontakh, Andrey (2545) vs. Milanovic, Dani… (2420) and Sauleda Roig, J… (2152) vs. Fiol Company, J… (2189). White won both games.",
        "5... d6 6. e4": "So I grab the centre, and give further protection to my pawn on b5.",
        "6... g6 7. f4": "Hoping at some stage to be able to get in e5 and cause disruption to the Black set-up.",
        "7... Bb7 8. Nf3": "I find Bb7 a bit odd. Bg7 looks so natural, and indeed, is the only move on the Gameknot World Database. Nf3 is played to support an eventual e5.",
        "8... Bg7 9. Bd3": "Computer prefers bxa6 or Bc4 here. I did conside Bc4. I was a bit afraid of the bishop being hit by Nb8-d7-b6.",
        "9... O-O 10. O-O": "Computer agrees with these moves and already thinks White has the upper hand. I was quite confident too, but mindful of my previous 2 games, I was being careful not to get over-confident.",
        "10... axb5 11. Bxb5": "Computer agrees these are the best moves for both sides.",
        "11... Qb6 12. Qe2": "Computer prefers Na6 for him and a4 for me. What we both missed was that Black can in fact play Nxe4 here. If White takes the knight with the Queen, Black can exchange on c3 and then pick up the Bishop on b5, and if White recaptures the knight on e4 with his knight then Black plays c4 which puts White in Check and then he can play Queen takes bishop next move.",
        "12... e6 13. dxe6": "Instead he tries to open the centre, but he misses a tactic.",
        "13... fxe6 14. Ng5": "This is it! the Black e pawn is hard to defend.",
        "14... d5 15. e5": "14...d5 of course defends the e pawn with his Queen, but this moves allows me to cut his Bg7 out of the game, gains a space advantage, and it is still hard for him to prevent losing a pawn. Computer actually likes 15. exd5. What do you think dear reader?",
        "15... Ne4 16. Ncxe4": "Rather than go into defensive mode, Dave decides to give up a pawn.",
        "16... dxe4 17. Bc4": "This time I did see that if I took the pawn immediately, c4 would lose a bishop",
        "17... Bd5 18. Nxe4": "Computer actually prefers Rd1, but both moves seem good to me.",
        "18... Nd7 19. Nd6": "Computer prefers Nc6 to Nd7 and still likes Rd1. Certainly the knight on d7 doesn't seem to have many prospects and comes under fire down the d file. I wanted to make sure that there were no sacrifices on e5 - he may well have been loking at giving up a piece for 2 pawns on e5 to free his position.",
        "19... Qb4 20. Bxd5": "Now if he takes back with the pawn, which is probably best, I was going to play Qg4 hitting the knight on d7 and also with ideas of playing Qe6 check followed by Nf7 check, picking up the exchange. Computer actually prefers to follow up with 21. Rd1 and thinks White has a decisive advantage, because after 21. Qg4 Black has Qd4 check and if Kh1 Black can then take the pawn on e5 with either knight or Queen, as there is a pin on the f4 pawn, and if White captures on e5 there is Rf8xRf1 mate! Or if instead Rf2 Black has Nxe5 and there is still a pin on the f4 pawn. However Black decides to throw in the Queen check immediately.",
        "20... Qd4+ 21. Be3": "He is getting his bishop back, but helping my development.",
        "21... Qxd5 22. Rfd1": "Computer agrees with these moves and says White has a decisive advantage.",
        "22... Qc6 23. Qc4": "I was originally going to play Qg4 with similar threats, but I thought that this move kept more central control. I was wrong, Qg4 would have been better, as now he finds a way of staying in the game.",
        "23... h6 24. Qxe6+": "With the Queen on g4 I would have been able to play Qxg6, but White is winning easily. For the record, computer prefers 24. b4. What do you think dear reader?",
        "24... Kh7 25. Rac1": "Mobilising my reserves....computer actually prefers Qe7",
        "25... Rae8 26. Qh3": "Dave takes advantage of a pin on my knight, so if 26. NxR?? QxQ. Once again I have the chance to win two rooks for the Queen with 26. QxR, RxQ 27. NxR, but I decided this was better.",
        "26... Rea8 27. Nc4": "Computer actually prefers e6 and afterwards I was thinking that b4 may have been better. I think they all win!",
        "27... Rxa2 28. Rxd7": "After the game Dave confessed he just didn't see this move. Computer prefers the Queen capture.",
        "28... Rf5 29. Rd6": "Rf45 threatened my rook of course.",
        "29... Qa4 30. Rxg6": "A nice move to play!",
        "30... Kxg6 31. Qg4+": "Regaining the rook.",
        "31... Kh7 32. Qxf5+": "White is winning easily. Computer wants to resign this position.",
        "32... Kg8 33. Nd6": "Computer prefers e6 and is probably right.",
        "33... Ra1 34. Qf7+": "Black is making one last bid....",
        "34... Kh8 35. Nf5": "Threatening mate!",
        "35... Rxc1+ 36. Bxc1": "Black has just a few spite checks.",
        "36... Qd1+ 37. Kf2": "Black could resign here.",
        "37... Qc2+ 38. Kg3 Qd3+ 39. Be3 Bxe5 40. fxe5": "and Black finally resigns. Thanks for reading my annotation. Don't forget to leave comments and to rate my annotation, to let me know how I am doing! Until next time....."
    },
    "url": "https://gameknot.com/annotation.pl/pen-y-ffordd2-v-pensby1-board2?gm=37510",
    "gameName": "Pen-y-ffordd2 v Pensby1 Board2",
    "players": "Charles Higgie  vs. Dave Ashton ",
    "opening": "Benko gambit (A57), Zaitsev system"
}