{
    "moves": {
        "1. d4": "One of those games which are lovely to play. White's king goes for a little walk, encouraged by the offer of a pawn and then a bishop, both of which he accepts and white resigns rather than get mated on move 20. Of course afterwards Fritz tells me how I could have done it quicker!",
        "1... Nf6": "I play my usual.",
        "2. Bg5": "Trompovsky attack (Ruth, Opovcensky opening) (A45) https://en.wikipedia.org/wiki/Trompowsky_Attack",
        "2... Ne4": "Although generally it is not a good idea to move pieces twice in the opening, here it is justified, as there is the attack on the bishop.",
        "3. Bh4": "So the Bishop moves.",
        "3... g5": "Hitting the bishop again.",
        "4. Bg3": "He retreats, although 4. f3 is more commonly played and scored better.",
        "4... c5": "Attacking his centre.",
        "5. f3": "Attacking my knight.",
        "5... Nxg3": "So I take.",
        "6. hxg3": "He takes back.",
        "6... Bg7": "I attack d4 again.",
        "7. c3": "He protects.",
        "7... Qc7": "Protecting c5 and attacking g3. Qb6 is strong here too.",
        "8. Kf2": "So he protects g3. ",
        "8... cxd4": "I decided to open the position for my bishops.",
        "9. cxd4": "He takes back.",
        "9... e5": "I strike in the centre again.",
        "10. e3": "I think 10. d5 e4 11. fxe4 Bxb2 12.\tNd2 Bxa1 13. Qxa1 O-O is probably a better attempt by white - he has a pawn as compensation for being the exchange down. As played he gets torn apart.",
        "10... exd4": "So opening it up more.",
        "11. exd4": "He takes back.",
        "11... Nc6": "I attack d4 for a third time.",
        "12. Ne2": "He defends it.",
        "12... Qb6": "I attack and pin d4.",
        "13. Ke3": "The only way to protect d4, but probably better just to allow d4 to fall. White already has a very difficult position.",
        "13... O-O": "With Re8 check coming in.",
        "14. f4": "So he tries to create a safe square for his king.",
        "14... Re8+": "So I check.",
        "15. Kf3": "Continuing with his plan.",
        "15... g4+": "Offering first the pawn. Fritz likes this move, although he tells me Nxd4+ was marginally better - a mate in 15. Obviously I need to do some work on my mates in 15!",
        "16. Kxg4": "Which he takes.",
        "16... d5+": "Bringing my other bishop into play with tempo.",
        "17. f5": "Blocking the check.",
        "17... Bxf5+": "But the bishop will not be denied! I was glad that Frizt agreed with me that this is the best move.",
        "18. Kxf5": "White takes again. Ok stop - what would you play as black?",
        "18... Re4": "Did you find this? I am threatening two mates in 2 now. At the time, I thought it was mate in three now. Fritz tells me it is mate in 8 now, and Ne5!! was a quicker execution - a mate in 5.",
        "19. Nbc3": "Nf4 was the only way to fight on, although as I said, white is still getting mated in 7 after Nxd4 check.",
        "19... Ne7+": "White resigns rather than be mated.\nMany thanks for reading, please leave a comment or two and rate it on the star system."
    },
    "url": "https://gameknot.com/annotation.pl/pensby-v-malpas-oswestry-1?gm=61884",
    "gameName": "Pensby v Malpas & Oswestry 1",
    "players": "Liam Cadigan (ECF131) vs. Charles L Higgie (ECF166)",
    "opening": "Trompovsky attack (Ruth, Opovcensky opening) (A45)"
}