{
    "moves": {
        "1. d4": "So I start with my favourite d pawn opening",
        "1... Nf6": "He suggests he is going into the Indian systems",
        "2. c4": "I continue on classical lines",
        "2... g6": "Aha either a Kings Indian or a Gruenfeld",
        "3. Nc3": "I continue to follow the main line",
        "3... Bg7": "So a King's Indian it is then",
        "4. e4": "And I prevent any tranposition to the Gruenfeld",
        "4... d6": "Main line",
        "5. f3": "And this is the Samisch Variation, which I have played off and on for about 40 years!",
        "5... O-O": "The usual continuation",
        "6. Be3": "As is this. Black now really has to think about where his counterplay is coming from. White has an imposing centre, if given time to support it.",
        "6... b6": "This is unusual. c5, e5 or Nc6 are the most commonly played moves here.",
        "7. Bd3": "So I continue my development.",
        "7... Nbd7": "I was rather expecting Bb7 or a6 after his last move.",
        "8. Nge2": "And I continue to develop",
        "8... c6": "This really doesn't fit in with the other moves he has been playing. Surely c5 or Bb7 is more consistent. c5 is actually the only move in the World database and it scores well for black! Bb7 is in the Gameknot Database. Black isn't really challenging the white centre.",
        "9. Qd2": "With a view maybe of a king's side attack and queen side castling.",
        "9... Re8": "Black continues with non-challenging moves. Is the rook any better on e8 rather than f8? Maybe and maybe not.",
        "10. O-O-O": "I thought that he has wasted so many moves I may as well go for his king.",
        "10... e5": "Finally breaking in the centre",
        "11. d5": "I want to keep the centre closed.",
        "11... cxd5": "So he opens a line",
        "12. cxd5": "I want to avoid exchanges, as I have more space, which is why I recaptured with a pawn rather than my knight",
        "12... a6": "Starting his counter-attack on the queen side, but he will find it hard to open another file against my king, which will be quite safe on b1.",
        "13. g4": "So I start my king side advances. I was thinking he may try pawn b6-b5-b4, and that in replay I could play Ng3 followed by N(c3)-e2",
        "13... Nf8": "And now he goes back to this very defensive mode. I wondered how I would break through on the king side with all his pieces guarding key squares, but at least I didn't have to worry about any sort of queen's side counter-attack. Nc5 or b5 would have been stronger. Notice how his b6, as well as wasting a tempo, is also blocking his queen's path to a5.",
        "14. Ng3": "So my, more aggresive build up continues.",
        "14... b5": "At last he starts the counter attack, but white is slightly better.",
        "15. h4": "So my king's side play continues. I have played moves in this order so that he can't play h5 to block my h pawn's advance, without allowing me to open the g file, which would be very dangerous for him.",
        "15... Qa5": "Threatening of course to play b4 followed by taking on a2.",
        "16. Kb1": "But my king wanted to go there anyway. In some variations I may want to contest the open c file. It did cross my mind that I could have an alternative plan in this position - exchange main pieces down the queen side and then win using my more mobile minor pieces. His Bg7 for instance at the moment has a purely defensive function and is secured blocked by his pawn on e5. However I thought the king side attack was better. I did also consider playing Qf2 round about here, with threats of Bb6 picking off his queen. However he can parry this with Rb8 and Rb8 is probably a move he is going to play anyway to help his counter attack. Further with my queen on d2 it prevents him playing h6, which may make it harder for me to open lines on the king side. Furthermore after he plays b4 and I reply N(c3)-e2 my queen pins his pawn on b4 preventing b3. So I decided to keep my queen on d2.",
        "16... Nf6d7": "Another mysterious knight move! Bringing this knight round to the squares the other knight could have gone immediately..... It is probably the best move in the circumstances.",
        "17. h5 Rb8": "See I knew he wanted to put that rook there!",
        "18. Rdg1": "Already dreaming of Nf5 at some stage.",
        "18... Nc5": "At last getting in on the action!",
        "19. Bh6": "I knew that he could win a piece here, but I correctly calculated that if he took the piece I would have a strong attack.",
        "19... Bxh6": "So he takes it, diverting my queen away",
        "20. Qxh6": "I have to recapture of course",
        "20... Nxd3": "and he takes the poisoned bishop. b4 first may have been better, or Na4 instead",
        "21. Nf5": "The move I had been planning for some time! Threatening mate on g7 of course.",
        "21... Bxf5": "He dare not take with the pawn and open the g file of course.",
        "22. gxf5": "Although materially down, white is winning now. There is the threat of f6 renewing the mate threat on g7, and if Ne6 to stop the mate I just take the knight with my pawn on d6. There are also threats to open the files, captures on g6 etc.",
        "22... Qb4": "So he tries one last trick, threatening mate in one.",
        "23. Rh2": "I covered it that way so that if he did a desparate sac on b2, my other rook would be free to operate on the g file. But now he could play Q d4 or c5 to attack my rook g1, so maybe Rg2 was better.",
        "23... Rb7": "Defensive to the end! Maybe dreaming of defending f7, g7 and h7 along the rank with his rook.",
        "24. f6": "And he resigned as mate is in sight. See Gameknot Chess puzzle number 32331"
    },
    "url": "https://gameknot.com/annotation.pl/penyfordd-v-rhyl-chester-district-league?gm=35684",
    "gameName": "Penyfordd v Rhyl, Chester & District League",
    "players": "Charles Higgie  vs. Mike Williams ",
    "opening": "King's Indian (E82), Saemisch, double fianchetto variation"
}