{
    "moves": {
        "1. e4": "So he opens with the standard",
        "1... c5": "I reply with the Sicilian Defence",
        "2. Nf3": "He carries on with the most popular",
        "2... Nc6": "And I play the Classical Variation",
        "3. d4": "He turns it into an Open Sicilian",
        "3... cxd4": "And I take",
        "4. Nxd4": "He recaptures",
        "4... Nf6": "I carry on with the main line",
        "5. Nc3": "This is the only sensible way to defend the e pawn",
        "5... d6": "I carry on with main line",
        "6. Bc4": "This was Bobby Fischer's favourite, the Sozin variation, but I, and probably most Sicilian players, prefer to meet this, rather than the Richter-Rauzer Attack (B63)\r\n1 e4 c5 2 Nf3 d6 3 d4 cxd4 4 Nxd4 Nf6 5 Nc3 Nc6 6 Bg5 ",
        "6... e6": "Black has to do something about the White threat to take on c6 and then play e5.",
        "7. O-O": "I, and probably most Sicilian players, prefer to meet this, rather than the sharper variations where White castles queen side and Black on the king side and both sides throw forward their pawns against the respective kings.",
        "7... Be7": "So I carry on developing.",
        "8. f4": "This is a bit unusual",
        "8... O-O": "So I castle.",
        "9. Nf3": "This is unusual too. He is hoping to follow up with e5. It is not on Gameknot's world database, it is on their database of Gameknot games - although of course, as this is an over-the-board game, I didn't know at the time.",
        "9... Qc7": "Now this move is not in any database, but it seemed quite logical to me - delay his intended e5 advance. Instead the database has 6 games with a6, one with Bd7 (white win) and one with Nxe4 (black win). The computer actually spots a tactic in this position, b5 is playable.",
        "10. Qe2": "So he renews the threat of e5.",
        "10... Rd8": "Played to discourage e5 - I can exchange on e5 and then dump my Knight on d5. Computer prefers a6.",
        "11. Be3": "Computer prefers Nb5",
        "11... Ng4": "Computer prefers a6, but I think it is better to grab the 2 bishops in an open position. What do you think dear reader?",
        "12. Nb5": "He attacks my queen. Computer agrees this is best.",
        "12... Qb8": "I retreat. Computer agrees this is best.",
        "13. Rad1": "This is a logical move. I think he was planning on playing his bishop back to c1, but I decided not to give him a chance. Computer prefers c3, but for reasons I explain later, I don't think c3 is a good move. I tend to think computers play tactical positions very well, but strategic positions like this, they are not so good. Any views?",
        "13... Nxe3": "So I don't give him a chance!",
        "14. Qxe3": "He naturally takes back.",
        "14... a6": "And now I hit the knight.",
        "15. Nbd4": "and he retreats to the best square.",
        "15... Qc7": "So I return the queen to its most natural square. Computer prefers a7, although I am not convinced it is any better. Any views readers?",
        "16. Bb3": "He avoids any tactics based on moving my knight and attacking his bishop on c4 at the same time. Computer prefers Nxc6, but again, I am not convinced that is any better. Any views?",
        "16... Bd7": "I complete the development on my minor pieces, but computer prefers the immediate Na5. I don't think it makes much difference.",
        "17. c3": "I'm not a great fan of this move. Presumably the ideas are to support d4 and to give his bishop another square on c2. The disadvanatge is that black's basic plan in this position - and most other open Sicilian positions - is to launch a minority attack with the 2 black queen side pawns against the 3 white queen side pawns, hopefully eventually weakening and winning a white pawn. c3 makes a target for black, if black can get in b4-b5 and then exchange on c3, files are opened on the queen side, white's pawns are weaker.",
        "17... Na5": "This is also part of the plan. Computer likes this move too!",
        "18. Kh1": "I don't like this move either. It avoids tactics on the g1-b6 diagonal, but in an endgame the white king is further from the centre.",
        "18... Nc4": "I think this is a wonderful square to put the knight, and much better than taking on b3. Computer prefers Nxb3, but I am not convinced it is any better.",
        "19. Bxc4": "So he decides to take the knight. Computer prefers Qe2, and this time I agree with computer. Computer also still thinks this position is equal.",
        "19... Qxc4": "So I recapture.",
        "20. b3": "He attacks my queen. Computer likes this move too, although I am not impressed, I think it weakens white's pawns.",
        "20... Qc5": "I tend to think this is better than the retreat to c7, the computer does not agree. What do you think dear reader?",
        "21. e5": "Computer likes this move.",
        "21... Rac8": "So I pile up on the c pawn. Computer agrees!",
        "22. c4": "So he moves the c pawn to safety. Computer prefers to exchange on d6 and play Rd3.",
        "22... b5": "Computer agrees with this move. All part of my master strategy!",
        "23. Nc2": "This is where he blunders and allows me a much better ending. Computer still prefers exchanging on d6.",
        "23... bxc4": "I thought that this gave me a won ending, although computer prefers d5 and assesses the position as \"black has the upper hand\".",
        "24. Qxc5": "He has to exchange to prevent the pawn on c4 going.",
        "24... dxc5": "Computer actually prefers the recapture with the pawn, and thinks black is 1.56 ahead. This seems much easier to me, the bishops are getting into play on the queen side with a vengence! Any views dear reader?",
        "25. bxc4": "so he recaptures.",
        "25... Ba4": "and this is a tricky move to meet.",
        "26. Rxd8+": "This is probably best, but now I control the open d file.",
        "26... Rxd8": "of course I have to take back",
        "27. Ne3": "and he has to do something about the attacked knight.",
        "27... Rd3": "obvious and good!",
        "28. Re1": "This is the best move for him",
        "28... Bd8": "Computer actually prefers Bc6, with the idea of taking on f3, but I think it is better to play this, my bishops are so good! Any views?",
        "29. Re2": "Protecting the 2nd rank, but Kg1 is better.",
        "29... Ba5": "So into play!",
        "30. Ne1": "I tend to think he is so tied up, this position is won for black whatever he plays.",
        "30... Rc3": "I had to move my rook of course.",
        "31. Nf3": "He just repeats.",
        "31... Rc1+": "So I throw in a check.",
        "32. Ng1": "This is forced.",
        "32... Bc3": "and this is heading for a massive square on d4, where it will attack on both sides.",
        "33. h3": "He gives his king a flight square.",
        "33... Bd4": "I complete that plan",
        "34. Kh2": "He breaks the pin.",
        "34... Rc3": "I attack his knight again.",
        "35. Rb2": "He threatens a back rank mate. It was worth a try I guess, but he is losing co-ordination between his pieces.",
        "35... Kf8": "I avoid the mate!",
        "36. Rb8+": "He throws in a check.",
        "36... Ke7": "I centralise my king.",
        "37. Ng4": "He moves the knight. I don't think there is anything better.",
        "37... h5": "But now it has no squares.",
        "38. Ne2": "So he forks my pieces.",
        "38... Rc2": "Both his knights are attacked.",
        "39. Nxd4": "He exchanges.",
        "39... cxd4": "I recpature - and his other knight still has no squares.",
        "40. Rb7+": "So he throws in a check.",
        "40... Bd7": "and I block.",
        "41. Nf6": "One last try.",
        "41... gxf6": "I take.",
        "42. exf6+": "He takes.",
        "42... Kd6": "I don't fall for Kxf6??",
        "43. Rb6+": "He throws in one last check",
        "43... Bc6": "And I block. He resigns now, because if he, for instance play this",
        "44. Rb3": "I have this",
        "44... Rxg2+": "which forces this",
        "45. Kh1": "and now black has several discovered checks to win. OK many thanks for reading this, please comment and rate my annotation!"
    },
    "url": "https://gameknot.com/annotation.pl/penyfforrd-v-wallasey-wirral-cup-final?gm=38446",
    "gameName": "Penyfforrd v Wallasey Wirral Cup Final",
    "players": "Leon Wolszczak (ECU142) vs. CharlesHiggie ",
    "opening": "Sicilian (B58), classical"
}