{
    "moves": {
        "1. d4": "This was a rather painful loss from a couple of years ago. Our knock-out team were away to Pen-y-Ffordd. On paper they seemed a perfect match for us, with 2 stronger players and then a big gap and 4 weaker players. Unfortunately when we turned up, I found that they had a couple of \"ringers\" - Pat Bennett being one of them - who hadn't played for Pen-y-Ffordd before or since. At the time Pat out-graded me, but most of my other players were out-graded by an even higher amount, so although I was black, and faced what was on paper a stronger opponent, I wanted to win!",
        "1... Nf6": "So it starts conventionally enough.",
        "2. Nf3": "Perfectably playable, although 2. c4 is more common.",
        "2... g6": "I normally play the Grünfeld Defence https://en.wikipedia.org/wiki/Gr%C3%BCnfeld_Defence against d4.",
        "3. c4": "I was wondering if this was going to transpose into a Grünfeld Defence",
        "3... Bg7": "I continue to develop.",
        "4. g3": "He decides to fianchetto his King's Bishop too.",
        "4... O-O": "I castle.",
        "5. Bg2": "He completes his fianchetto.",
        "5... d5": "I play this, mainly because it is played in the Grünfeld Defence. I play in the same 4NCL league team as my opponent, and I asked him months later whether or not he had specially prepared this opening against me. He replied that he had prepared it, not against me specifically, but generally against Grünfeld Defence players.",
        "6. cxd5": "So he takes.",
        "6... Nxd5": "I take back. ",
        "7. O-O": "He castles.",
        "7... Nc6": "I develop.",
        "8. e4": "He advances in the centre.",
        "8... Nb6": "I retreat.",
        "9. d5": "He advances again.",
        "9... Ne5": "I found out later that Na5 is more commonly played and scores better. At the time, to me, it seemed to make sense to try and exchange a few pieces as white has the stronger centre.",
        "10. Nxe5": "So he takes.",
        "10... Bxe5": "I take back.",
        "11. Nc3": "And he develops again.",
        "11... e6": "I chip at his centre. ",
        "12. Bh6": "He develops his bishop with tempo, attacking my rook.",
        "12... Re8": "The rook only had one square.",
        "13. Qb3": "This move scores two out of two in the database of world chess games!",
        "13... exd5": "So I take.",
        "14. exd5": "He takes back.",
        "14... Bf5": "I develop my Bishop. Now this position has been seen twice on the opening databases of Gameknot. On the database of games played on Gameknot there is pitagoran (2031) vs. wildrussianbear (1806) and on the database of world games there is Heck, Norbert (2271) vs. Mueller, Frank (2004). White won both of them.",
        "15. Be3": "pitagoran (2031) vs. wildrussianbear (1806) continued with 15. Rac1 instead, while Heck, Norbert (2271) vs. Mueller, Frank (2004) continued with 15. Rad1",
        "15... Qf6": "The queens adds power to the Be4 and also protects Nb6 along the rank.",
        "16. Rad1": "He mobilizes his rook.",
        "16... Rad8": "And so do I.",
        "17. Nb5": "He attacks a7.",
        "17... a6": "So I defend, and hit the knight.",
        "18. Nd4": "The knight takes up a more central role.",
        "18... Bc8": "And my bishop drops back, freeing my Nb6.",
        "19. f4": "He hits the other bishop.",
        "19... Bd6": "Which drops back.",
        "20. f5": "And he continues his king side advances, threatening f5xg6 and discovering an attack on my queen. I can answer that with Qxg6 but then it means my king side pawns are isolated and weaker. My computer likes simply capturing on f5 now with the pawn, but I felt this left my king side pawns rather weak and isolated. 20...Bxf5 is playable too. 21. g4 doesn't win a piece as black has 21....Qe7 braking the pin and attacking Be3. White can get the pawn back immediately with\tBxf5 21. Nxf5 gxf5 22.\tBxb6\tcxb6 23. Qxb6.",
        "20... g5": "Perhaps this is chickening out, but it does keep the king side closed.",
        "21. Nf3": "And now his knight, which started out as his queen side knight, now takes up the position usually taken by this king side knight! Computer says this is the best move for white in this position.",
        "21... g4": "The pawn was attacked, so it advances again. Computer likes this move too.",
        "22. Bd4": "He attacks my queen with tempo.",
        "22... Qh6": "This seems the best square for the queen.",
        "23. Nh4": "His attacked knight advances.",
        "23... Nd7": "And I reposition my knight to a more central location. Computer likes this move.",
        "24. f6": "He advances again.",
        "24... Be5": "I am trying to exchange bishops, and hopefully win the pawn on f6. Computer prefers Ne5.",
        "25. Be3": "He avoids the exchange and attacks my queen.",
        "25... Qf8": "My queen drops back.",
        "26. Bg5": "And he re-enforces the pawn on f6.",
        "26... h6": "I decide to attack his bishop. He now comes up with a combination that I hadn't seen. Computer prefers 26...Qc5+",
        "27. Ng6": "Of course! If I take the knight, 28. f7+ is very strong. ",
        "27... Qd6": "27....Ac5+ can be met with Be3, but that may have been marginally better than what I played.",
        "28. Ne7+": "So he throws in a check. It may be best just to give up the exchange here, but white is winning easily no matter what. Cartainly black has to avoid 28..... Kf8?? 29. Bxh6 mate. 28....Kh7 Qd3+ looks pretty grim for black too.",
        "28... Kh8 29. Nf5": "This is another strong move by white, attacking my queen. I should have taken the queens off with Qb6+ here. Black is still losing, but black is crushed in the game.",
        "29... Qc5+": "So I throw in this check instead. ",
        "30. Be3": "Bishop comes back with tempo.",
        "30... Qf8": "30....Qb5, trying to exchange queens was probably stronger.",
        "31. Bxh6": "Finally the pawn goes.",
        "31... Qg8": "I felt safer having my queen near the king for protection, but it is an illusion, in fact the queen takes up a valuable flight square for the king. 31...Qc5+ was better.",
        "32. Bg7+": "He throws in a check. I see that I am losing my queen, but I decide to at least get two pieces for her.",
        "32... Kh7": "So my king comes up.",
        "33. Nh6": "Checkmate to the black queen! 33. Qe3 threatening mate was perhaps even stronger, but both moves win for white.",
        "33... Qxg7": "I take the bishop.",
        "34. fxg7": "He takes her. ",
        "34... Kxh6": "I take the knight.",
        "35. d6": "Opening up the diagonal for his queen to come in.",
        "35... Bxg7": "Played to reach the time control. Black's position is hopeless. By the time all the other games were over. We had lost the match heavily. Rather than put the clocks back 15 minutes each, I decided to resign.\n\nMany thanks for reading this! Please rate the annotation on the star system and leave a comment or two. Until next time dear reader!"
    },
    "url": "https://gameknot.com/annotation.pl/penyffordd-ko-v-malpas-ko?gm=60462",
    "gameName": "Penyffordd KO v Malpas KO",
    "players": "Pat Bennett (ECF170) vs. Charles L Higgie (ECF 177)",
    "opening": "King's Indian (A48), East Indian defence"
}