{
    "moves": {
        "1. e4 c5": "This is an interesting draw, with moments of drama! Anyway, he opens e4 and I play my usual Sicilian",
        "2. c3 Nf6": "2. c3 is slightly unusual, but perfectly playable. I believe the Deep Blue Computer famously beat Kasparov with it in 1996 - the first game to be won by a chess-playing computer against a reigning world champion under normal chess tournament conditions, and in particular, normal time controls.\r\n.",
        "3. d3 e5": "3. d3 is not as aggressive - and not as good for that matter - as the standard 3. e5. I was tempted to play d5 and expected in reply either 4. Nd2 or 4. e5 Nf6-d7 and, after a later d4 by white we will go into a position similar to a variation of the Tarrasch Variation of the French Defence(1. e4 e6 2. d4 d5 3. Nd2 Nf6 4. e5 Nfd7) where Black has an extra tempo because White has wasted a move by playing d3 and then d4. I thought at the time that Black would struggle to make the extra tempo count in a blocked position. I went for something more ambition. But wrongly! After the game a glance at the Gameknot World Database shows d5 was the better move.",
        "4. Bg5 Be7": "There is already only a few moves on either the Gameknot World or the Gameknot internal opening database with this position.",
        "5. Bxf6 Bxf6": "I really don't understand this unforced exchange of minor pieces by White. On the databases I can only find games with 5. Nf6. However Black seems to have the better of those games.",
        "6. Nd2 d5": "So, having the two bishops I wanted to break open the centre and give scope to my bishops. I was a bit afraid of him closing up the centre with 7. c4, ruling out ....d5 for ever. I thought that in that position his knights may be at least equal to my bishops. Computer seems to prefer Nc6 or 0-0 and black stands slightly better. What do you think dear reader?",
        "7. exd5 Qxd5": "So of course I saw that his knight can come to e4 with gain of time. But what of it? I can then play f5 with gain of time. In the meantime he has a backward d pawn on a semi-open file, I have the 2 bishops and more space. What more could one want after just 7 moves? Compute prefers 7. Qb3, but Black still slightly better, ",
        "8. Ne4 Be7": "Computer agrees I can't allow an exchange on f6.",
        "9. Nf3 Nc6": "Normal developing moves. Computer agrees with both.",
        "10. Be2 f5": "So I continue with my plan. Computer agrees with both his move and mine, and assesses the position as better for Black.",
        "11. Ng3 h5": "Now this is where I started to over-estimate my position again. I thouhght that if he castles, h4 and his knight is forced back to h1 where is has no influence. I can follow with moves like Be6, 0-0-0 and g5 and a ready-made attack on his castled King. On the other hand I thought that 12. h4 would virtually rule out King side castling for him, and is pawn on h4 could prove weak. Computer prefers the simple 0-0.",
        "12. h4 Be6": "Computer agrees with both these moves, and Black only slightly better.",
        "13. Ng5 Bxg5": "Computer agrees with 13. Ng5 and gives 13..... 0-0-0 as a good alternative to Bxg5",
        "14. hxg5 g6": "I had been worried about 14. Bxh5+ and computer agrees it is a better move for White, although it thinks Black still has a slight advantage. It prefers 0-0-0 to g6 - if he takes on h5 I can take on g2 and gives h4 as an alternative. No marks of course for an immediate 14.... Qxg6?? Losing the queen to Bf3 - as I noticed in the game.",
        "15. Bf3 Qd7": "Computer likes 15. Bf3, but prefers Black to drop the queen back to d6. I'm not sure it makes much difference.",
        "16. Qe2 O-O-O": "Computer prefers 16. Qa4. It agrees with my queen side castling and thinks this position is better for Black.",
        "17. O-O-O Bxa2": "Round about here I could have lost the game! My mobile phone went off and I rushed out of the palying area to answer it. Afterwards, the Gameknot player frebec, who also plays in the same over-the-board tem, pointed out that my opponent could have claimed the game. It was my live-in girl friend, she had forgotten I had a chess game. She asked me when I would be back. I told her it depended on how long the game went on for. She told me to try to be quick!",
        "18. Bxc6 Qxc6": "Round about here I started having mental aberations. I thought he wil take on e5, I play Bb6, he moves the rook, then Qa5 and I am mating him, and I will be back home with be beloved like she wanted! I completely missed his rather obvious defence!",
        "19. Qxe5 Bb3": "Computer prefers 19. Rd1-e1, although Black is clearly winning. It prefers Rh8-e8 and Black is winning. Gosh I could have been home early!",
        "20. Rd2 Qa4": "Again, simply Rh8-e8 first and Black really is winning. I forgot the old bit of advice, \"if you see a good move, sit on your hands and look for a better one\".",
        "21. Qxc5+ Kb8": "Of course, now the white queen gets back to defend.",
        "22. Qa3 Qb5": "Now I am a pawn down, but I do have some compensation. My bishop is much better than his knight, my pieces are in attacking positions. Of course being a pawn down, I don't want to exchange queens. Computer agrees with me, but gives advantage to White.",
        "23. d4 Rhe8": "Computer prefers Ne2 to d4 and it is probably right. From e2 it is threatening to go to d4 and fork my queen and bishop. I wasn't threatening to take on d3 and after he exchanges rooks my bishop on b3 goes. now he can't move the knight. Computer now gives the position as even.",
        "24. Qb4 Qd5": "So he tries again to exchange queens, and I avoid again. Computer agrees with the basic plan, but prefers 24. Qc5. It also prefers 24...QxQb4 25. cxQb4 Rc8+ 26. Kb1 f4 27. Ne2 Rc2 28. RxRc2 BxRc2+ 29. KxBc2 RxNe2+ with the better ending for Black. I was looking at variations like that, but missed 27.....Rc2!",
        "25. f3 Rdc8": "Played with the idea that his pawn on d4 is going to be pinned in some variation, and that I may be able to take on d4 - as indeed I do in the game. Computer likes f3, doesn't like my move, prefers Bc4 and claims that the position is equal.",
        "26. Re2 a5": "As I said, I had a plan to win his d pawn. Instead the computer prefers exchanging on e2 followed by Qe6 and white stands slightly better. Computer also prefers 26. Ne2 to 26. Re2",
        "27. Qa3 Qxd4": "27. Qa3 is forced. Computer prefers the exchange on e2 or h4 rather than taking the pawn on d4.",
        "28. Qxb3 Qf4+": "I had looked at another variation - 29.... Rxe2 30. Nxe2 Qe3 31. Kd1 Rd1+ 32. Ke1 Rd2, but after 33. Qb5 White seems to be holding and consolidating his extra piece. Computer actually prefers that line, and assesses it as equal.",
        "29. Kb1 Qxg3": "Both moves more of less forced. So we have returned to material equality, but I have given up my good bishop and he has got rid of his bad knight.",
        "30. Rhe1 Rxe2": "Now instead of exchanging on e2 I did look at Qxe1+ 31. Rxe1 Rxe1+ and Black has two rooks for the queen. 32. Ka2 looks best and I thought on the open board the queen is as good as the two rooks, my pawns on g6 and a5 look weak. I looked at 32.... Rc8-d8 with ideas of going to d1 but they didn't see that good, White seems to have defences. Computer actually rates this line as much better for Black, but gives 32....Rc6 I guess that if necessary it can go to a6 and protect both pawns. I'm still not convinced that is it good. What do you think dear reader?",
        "31. Rxe2 Qxg5": "Compared to this, when I am a pawn up, but now the initiative has passed to White.",
        "32. Qf7 Qd8": "He threatened to come in with his rook to e7. Now I can meet Re7 with Qb6 and both b2 and g6 are protected. He can't of course take on g6 immediately, as I have a Queen fork on d1 winning. Computer agrees with me that this is the best move for me, and doesn't like Qb3-f7 and says Qb3-b5 is better. It thinks Black is slightly better.",
        "33. Kc2 Qb6": "Computer prefers 33. Re7 anyway. Computer likes Qb6 and thinks Black is better.",
        "34. Qe7 Qc5": "As I am a pawn up, it seemed sensible to try and exchange queens, but computer prefers Ka7 and, with the benefit of hindsight, I agree.",
        "35. Qe6 Rc6": "I am trying to make everything safe, and engineer a favourable exchange of queens. Computer agrees with this move.",
        "36. Qe5+ Ka7": "I didn't want an ending where my King is stuck on the back rank, but I don't think it makes much difference.",
        "37. f4 Qxe5": "I think he wanted to pin down my King side pawns a bit. I finally exchange. Computer prefers Qb6, but I think the exchange is better. Any views Dear Reader?",
        "38. Rxe5 Ka6": "so now everything is protected and my King is in the game",
        "39. g3 b5": "So as well as mobilising the King Side pawns, maybe in some variations I may be able to engineer a passed a pawn? This may be on the cards if he plays b3 or b4.",
        "40. b3 b4": "Now I should have just calmly played 40....Rd6 or Kb6, but I tried to force matters with a little combination which didn't really work out.",
        "41. c4 a4": "I could have chickened out with Rd6, but I wanted to be consistent.",
        "42. Rb5 axb3+": "Computer actually prefers a3, I would be interested in your views!",
        "43. Kxb3 Re6": "So this is the plan, to go after his King side pawns.",
        "44. Kxb4 Re3": "White can actually save the pawn with 45. Ra5+ and 46. Ra3 but after Re4 it is hard for him to make any progress. He decides on anothe plan.",
        "45. Kc5 Rxg3": "According to plan.",
        "46. Rb8 Rg4": "Going after the other pawn",
        "47. Kc6 Ka7": "of course he threatened mate!",
        "48. Rb7+ Ka8": "No more checks!",
        "49. Kb6 Rg1": "Threatening Rb1+ winning",
        "50. Rg7 Rb1+": "He has nasty mate threats",
        "51. Kc6 Ra1": "I indirectly protect the g6 pawn. If 52. Rxg6?? Ra6+ wins.",
        "52. Rg8+ Ka7": "Forced!",
        "53. Rg7+ Kb8": "i didn't want to go to a6 as then he can take the pawn on g6 safely",
        "54. Kb6 Rb1+": "and a draw finally agreed. By the time I got home my dear lady was asleep! Thanks for looking at my annotation. Please leave comments and don't forget to rate my annotation. Many thanks!"
    },
    "url": "https://gameknot.com/annotation.pl/penyffordd1vmold-buckley1chesterleague?gm=37188",
    "gameName": "Penyffordd1vMold/Buckley1ChesterLeague",
    "players": "K Evans (BCF137) vs. Charles Higgie ",
    "opening": "Sicilian (B22), 2.c3, Heidenfeld variation"
}