{
    "moves": {
        "1. d4": "Hi everyone!\n\nThis game started very slowly with little advantage to Yours Truly until late on in the middlegame white blundered a pawn.  I took full advantage but I still had to work hard for that win.  Thanfully Fou Leblanc with the aid of Henry managed to lure his counterpart onto a diagonal which led to an exchange down into a K & P ending and I then managed to get Henry right up into his arc.  Henry duly tucked in to his favourite nosh and it was inevitable that he was gonna help a pawn get to the 8th rank and inflict Glendadoom on his opponent.  Chris realised this and resigned on the grounds of Unavoidable Mate.  How did all this happen?  Well, Gameknot Analysis will shed some light on the matter: http://gameknot.com/analyze-board.pl?bd=17359307&fb=1&rnd=0.8334781184207715.",
        "1... d5": "1. ..... d5 - the game starts with a double QP opening.",
        "2. c4 dxc4": "2. ...... dxc4 - the QGA accepted.",
        "3. e3 Nf6 4. Bxc4": "4. Bxc4 - there is no good way to hold on to my extra pawn but I will somehow get a free and fairly easy game, just watch.",
        "4... e6 5. Nf3 c5 6. Qe2 a6": "6. ..... a6 - I am trying a breakout with the idea of b5.  I do get this move in 2 moves later.",
        "7. dxc5 Bxc5": "7. ...... Bxc5 - but first we have a pawn trade.  Although I am a bit behind in development it looks as though I may be able to put my pieces on decent squares without too much interference from white.",
        "8. e4 b5 9. Bd3 Nc6 10. Nbd2 Ng4 11. O-O Nge5 12. Nxe5 Nxe5": "12. ...... Nxe5 - knight trade.",
        "13. Bc2 O-O 14. Rd1 Qb6": "14. ..... Qb6 - Aha, here comes Glenda.  Glenda and Fou Lenoir are both putting pressure on the f2 pawn.  Now all I need to do is clear the decks with either Bb7 or Bd7.",
        "15. Nf3 Nxf3+ 16. Qxf3": "16. Qxf3 - another knight trade.",
        "16... Bb7": "16. ..... Bb7 - b7 I choose you!  Already the white pawn on e4 is pinned to the Wicked Witch of the West.",
        "17. Be3 Bxe3 18. Qxe3 Qxe3 19. fxe3": "19. fxe3 - hmm, after the queen trade white is left with doubled pawns.  But how can I exploit this?  Thankfully my opponent soon helps me out.",
        "19... Rfd8 20. Rxd8+ Rxd8 21. Rd1": "21. Rd1? - a natural move, neutralising the d column, but .......",
        "21... Rxd1+ 22. Bxd1": "22.  Bxd1 - but, look at that e4 pawn that Fou Leblanc has set his eyes on.  Now that white's lsb has moved to d1 it is no longer defending that e4 pawn.  Now that p(r)awn is about to grace Henry's table! ",
        "22... Bxe4": "22. ..... Bxe4 - yum, yum!",
        "23. a3 Kf8": "23. .... Kf8 - and now Henry gets quickly into the centre as there are no major pieces on the board.",
        "24. Kf2 Ke7 25. g3 Kd6 26. Bb3 Ke5": "26. ..... Ke5 - Henry has managed to do a few miles for Macmillan but what next?",
        "27. Bd1 f5 28. Bb3 a5 29. a4 b4": "29. ...... b4 - I eschew the pawn trade because I have an idea up my sleeve.",
        "30. Bc4 Bd5 31. Bb5": "31. Bb5 - naturally white declines the bishop trade, but notice white's queenside pawns have been momentarily separated.  I will exploit this fact in the next two moves.",
        "31... Kd6 32. Ke2 Bc6": "32. ..... Bc6 - white must trade bishops or he loses the a4 pawn, giving me a two pawn lead.",
        "33. Bxc6 Kxc6": "33. .... Kxd6 - so white trades but I now have a K & P ending, one pawn to the good, and now Henry is Moving on Up!",
        "34. Kd3 Kd5 35. b3 g5": "35. ..... g4 - preparing to put white in a zugzwang.",
        "36. h3 h5 37. h4 g4": "37. ..... g4 - now here is the zugzwang.  Although there is no further material loss for white at the moment, his king has got to retreat, allowing Henry to penetrate to e4.  Henry is licking his lips big time!",
        "38. Ke2 Ke4 39. Kf2 Kd3": "39. ....... Kd3 - now Henry heads towards the pawn on b3.  However, it is the e3 pawn that will be for his consumption.",
        "40. Kf1 Kxe3": "40. ....... Kxe3 - munch, munch!",
        "41. Kg2 e5 42. Kg1 e4 43. Kg2 Kd2": "43. ..... Kd2 - Henry clears the e pawn's march to Glendadom.  Chris plays on for one more move before waving the white flag.  I did set up some conditional moves but Chris saved me the bother.  Another instructive way of forcing victory if you are ahead in an endgame.  Hope you are all enjoying your weekend - more to come - bye for now - Joanne",
        "44. Kf2 e3+": ""
    },
    "url": "https://gameknot.com/annotation.pl/persistence-pays-off?gm=44406",
    "gameName": "Persistence Pays Off",
    "players": "patzerblitzer (1738) vs. jstevens1 (1845)",
    "opening": "Queen's gambit accepted (D20)"
}