{
    "moves": {
        "1. e4": "Currently I'm waivering towards a preferance for d4 as a first move, which seems to inject an element of dynamism into the center. Anyway here I play e4 aiming for probably the Ruy (a line I am beginning not to like).",
        "1... e5": "Double Kings pawn",
        "2. Nf3 Nf6": "Petrovs defense. A line I'm not particularly familiar playing but havent experienced much difficulty combatting in my past games. Without knowledge of the variations, I'd assess that this line is fairly easy for white to maintain the first move advantage well into the middlegame.",
        "3. Nxe5": "next few moves are standard. To provide a brief explanation, white first move advantage denies black from an immediate recapture owing to the threat of Qe2. Once black recaptures the pawn via his knight, white stakes a claim for the center. And black does likewise. From here its a race to castle, with white aiming to pressurise blacks advanced knight whilst simultaneously developing pieces into active positions. Black is likewise aiming to develop and castle as quickly as possible.",
        "3... d6": "Some play Qe7 here, although I've never come across Qe7 from a stronger opponent - possibly oweing to obstruction of the kings bishops development. d6 is a fine move here in any case",
        "4. Nf3 Nxe4 5. d4 d5": "last two moves contest the center (and consolidating blacks advanced knight)",
        "6. Bd3 Bd6": "both developing to active squares for kingside castling",
        "7. O-O O-O 8. Re1": "Looking at the GM database, c4 is the usual continuation. And possibly slightly stronger. As it retains the option of a later Re1. (Its usually better to hide your intentions - here Re1 announces itself quite predictably). ",
        "8... Re8": "Reenforcing e4. When the E file opens, the option to trade rooks is available which benefits black slightly. ",
        "9. c4": "undermining the d pawn",
        "9... c6": "reinforcing d5",
        "10. Nc3": "aiming to crack the kingside open",
        "10... Nxc3 11. bxc3": "Very nice doubled pawns. Which will inevitably lead to an isolated center pawn for black",
        "11... Bg4": "a strong pin.. which contrains both knight and queen and threatens to bust up whites king pawn barrier. ",
        "12. Rxe8+": "I remove the pesky Rook to avoid any prospect of a future Rxe1, Qxe1, Bxe3 \r\n",
        "12... Qxe8 13. Bd2": "Creating the threat of a cheap pawn trick with Bxh7, Kxh7, Ng5 , Kg7, Qxg4 winning a pawn with good prospects",
        "13... Qd8": "Qd7 is better here defending g4 and the weak b pawn.",
        "14. cxd5": "to isolate blacks central pawn",
        "14... cxd5 15. Bg5": "I reply in kind with a bad move of my own, rather then play the logical a3. The intention of this move was to provoke a pawn weakening. \r\n\r\nI was hoping black overlooked the exchange Bxf3, Bxd8, Bxd1, Rxd1, f6. Which leaves black with a much better game oweing to whites poorly placed bishop",
        "15... Qc7": "Instead black opts to form a battery threatening to capture the h pawn with check. Whilst doubling against the c pawn",
        "16. h3": "buying time to deal with both threats, and once more the game is roughly even",
        "16... Bh5": "abandoning the threatening c8-h3 diagonal in order the maintain the pin  ",
        "17. Bd2": "appears to be passively defending the c pawn, but with more sinister intentions in mind",
        "17... Nd7": "looks to be a natural enough developing move",
        "18. Bxh7+": "but - allowing the cheap pawn grab to surface to the fore once again! However in a slightly different way.\r\n\r\n",
        "18... Kh8": "Black opts not to racapture. Although to do so could lead to interesting positions\r\n\r\nFor example \r\nKxg7, Nf5 , Kg6 fails to g4 and blacks in trouble... this could continue bf4, Qc2  and f6 is the kings only safe square (eg Kxg5, Qf5 , Kg5 and Qf5 mates; and similar for Kh6 or blocking with f5)\r\n\r\nKxg7, Ng5 , Kg8, Qxh5 would be a possible response and follows Nf6, Qf3, and white has the better game but black can develop a more active position\r\n\r\n",
        "19. Bd3": "removing the bishop to safety away from a possible g6. while also closing entry points along the open e - file.",
        "19... f6": "effective move that plans an escape route for the white bishop. But leaves his kingside with a number of nasty white square holes.",
        "20. g4": "volunteerily weakening my pawn structure in order to mobilize queen and knight. Often this concession is necessary to rid this type of pin... usually playing this move requires an ability to control the weakened  squares near my king. And here I believe I had sufficent resources to call upon. \r\n\r\nThe alternative Be2 followed by a Knight move was worth consideration... however I felt was slightly passive and also moves the bishop momentarily off the lavish b1 to h7 diagonal it currently dominates",
        "20... Bf7": "while passive... the bishop fulfils an important defensive function for the time being.. however its difficult for black to generate any serious threats from this setup.",
        "21. Nh4": "heading for an outpost on f5.. while also threating to control the g6 square",
        "21... Nf8": "to control g6 (and h7)",
        "22. Nf5 Bh2+": "aiming for some counterplay",
        "23. Kg2": "I preferred this over Kf1 since it has the potential to interfere with blacks immediate plans. It also lends active support my weakened pawns. \r\n\r\nKf1 would support the F file, but I felt this wasnt particularly relevant at the moment.",
        "23... Ng6": "A good move continuing the counterthreats. aiming for check on f4 (or possibly h4), or supporting a bishop retreat to f4. ",
        "24. Ng3": "But this is refuted by interferrance along the b8-h2 diagonal. I am happy with this active defense, that threatens to capture for free should black follow with Nf4 ",
        "24... Bxg3": "logical to keep material",
        "25. fxg3": "Again I'm very happy with my doubled pawns which stops the knights progress in its tracks... also g4 functioning as a projectile aimed at blacks remaining kingside pawns.",
        "25... Re8": "Activating the rook into an open move, is quite a natural move... also possible is Ne7 or Nf8 in order to bring the knight back into play",
        "26. Qc2": "a slightly passive move that I wouldnt call a mistake, but helps black with his plans... here I'm aiming at the obvious knight target. However this knight wants to move anyway, so is helping black regroup",
        "26... Nf8": "the logical response.. black is close to getting his game back albeit a pawn down",
        "27. Rf1": "The rook gets posted here with the intention of pressurising this file in the near future",
        "27... Qd8": "? The mistake I was waiting for. Ne6 is better, widening the influence of blacks knight and contesting key kingside squares. Here black aims to defend his f pawn, but critically weakens his 7th rank",
        "28. g5": "My favourite move of the game! Of course I could have pushed this pawn previously to crack open blacks kingside. The pawn is untouchable for the time being, oweing to the discovered threat against blacks bishop.",
        "28... Nd7": "holding f6 as a strong point, however apparently overlooking a further advance to g6 which is now on the cards",
        "29. Qd1": "I was tempted to play the immediate g6. however after g6, Be6, Qd1, Kg8, Qh5, Re7, Qh7 , Kf8, Qh8 , Bg8 and black holds. So I opted for this quiet(ish) move, putting more pressure on black to make his best move to alleviate the pressure, while maintaining the strength of my position.",
        "29... g6": "Kg8 I felt was slightly better here. If this was played then I'd respond Qg4. From this position the response Qg4 would be met by f5, which would help black. ",
        "30. gxf6": "But of course I played gxf6... which leaves black with a dilemma.. Retake and face a concerted attack. Or ignore a dangerous passed pawn with mating prospects near the king",
        "30... Nxf6": "opting to capture... his black squares near the king are now a major weakness",
        "31. Qb1": "I had a lot of options here , and chose a double attack against the b and g pawns. Again this puts the question to black. For example if he plays b6, I respond with Bg5, pinning the knight and queen.",
        "31... Qd6": "The options arent great here for black, possibly kg7 or b6 would be an improvement. Black possibly anticipating bd5 preemptively aiming to avoid this possibility",
        "32. Bf4": "My eye is turning to other black squares, and drives the queen back, gaining a likely tempo in the process. Now threatening the incisive Be5!",
        "32... Qd7": "Queen aims to move off the threatened black squares.. only to hop onto another bad square. As this results in an ugly skewer on b5",
        "33. Bb5": "The skewer in question, that aims to exchange with the rook once blacks  queen steps asside. Although my white bishop is powerful, swapping to the rook wouldnt detract from the continuation of this attack, and it also serves to continue to hound blacks queen",
        "33... Qe6": "Black plays his final move, with the misfortune of blocking the rooks control of the e file, and then with good reason promptly resigns... My continuation would be Be5, and black is powerless to avoid dropping the knight and further material..\r\n\r\na sample line might continue.. Be5, Qc8, Bxe8, Qxe8, Rxf6, Kg8, Qxb7 and black cannot hold out for long against whites threats.\r\n\r\n I hope this annotation added something. I posted this match, as I believe the play here is reasonably accurate, and shows gradual pressure being applied to achieve a winning position. \r\n\r\n"
    },
    "url": "https://gameknot.com/annotation.pl/petrovs-defense?gm=8840",
    "gameName": "Petrovs Defense",
    "players": "leereuben (1728) vs. claimers (1719)",
    "opening": "Petrov (C42), classical attack, Tarrasch variation"
}