{
    "moves": {
        "1. e4": "I like playing against e4, I switch between the Sicilian and the petrov. I know your supposed to master 1 opening and keep with that, but i like both. I have also recently found the philidor which i really like and will be playing more often. I should also say that i have only been back playing chess proper this year (april), so i am still looking for the openings that suit me best. I have found the website highlighted on marinvukusic profile www.chessgames.com very helpful.",
        "1... e5 2. Nf3 Nf6 3. Bc4": "The petrov, Italian variation. Usual, i have found, is 3. Nxe5, d6, 4. Nf3, Nxe4, 5. d5, d4. 6.Bd3....is more common, so this was quite exciting! As a kid i always played this opening as white to try and fork the queen and rook (Ng5, Nxf7), :) you could only ever do it straight off against beginners though. Nostalgic moment there!",
        "3... Nxe4 4. Nxe5 d5": "This threatens whites bishop whilst creating pressure around the centre of the board. I will now develop, which should be carried out whilst gaining tempo thanks to whites retreat of the bishop (anticipated move).",
        "5. Qe2": "(anticipated retreat of the bishop does not materialise) Had never played against this so it took me by surprise. now taking bishop leads to an exchange of minor pieces leaving white in a superior position, therefore gaining tempo from whites retreat is no longer on.",
        "5... Be6": "I think this is the best move. It prevents a discovered check if i move my e4 knight, it strengthens the centre of the board and it is constructive development. ",
        "6. d3": "Having to move the threatened knight or go for exchange. i don't like the exchange as afterwards white has control of the centre and would dictate the way i will play (dxc4, Qxe4, c6, white superior). moving knight gives me better defensive security and allows my development to continue at my pace and my say so.",
        "6... Nf6": "knight retreats into position which i feel comfortable with, while at same time leaves white to ponder the threat on the bishop. From here i should be able to develop with ease.",
        "7. Bb3 Bd6": "Continuing development, and putting pressure on e5 knight as it is cause for concern.",
        "8. O-O O-O": "strengthens my defence and continues development. I could have played (8...., Nc6 9...., Nd7) however that i am sure would end up with myself doubling pawns, which i am not a fan of.",
        "9. Bg5 c6": "c6 can be looked at as a strange move, it blocks the knights usual route out of the back line however it stabilises my position within the centre of the board. (I am also anticipating f4.)",
        "10. f4": "anticipated well. Now a intricate little battle is going on around my king side. white is perhaps hoping i play Nbd7 or Bxe5 which would lead to white probably winning the game. I have numerous moves which can prevent white gaining an advantage.",
        "10... Qb6+": "However Qb6  is best. Knight is no longer pinned and now the e5 knight (which I think is key in whites attack) can be removed.",
        "11. Kh1": "Qb6  allows black the option of how future play will work out around my king side and as previously stated i believe the removal of the e5 knight is now essential.",
        "11... Bxe5": "gets rid of pesky knight and relieves pressure on the king side.",
        "12. fxe5 Nfd7": "best place for knight as threatening light squared bishop will be next move which starts a interesting battle. ",
        "13. c3": "white seeing the threat to his bishop makes an escape route for him.",
        "13... Nc5": "This now kick starts the battle to which i refer in the first page of this annotation was the main thing to look out for.",
        "14. Bc2": "a clever well thought out move, had i falling for the trap or mistake?. it looks like a mistake and that is what i take it for as black still needs to make 1 more mistake before the queen is trapped. A mistake that can quite easily be played.",
        "14... Qxb2": "(At time my thinking: if white moves knight i win a piece, if not i win rook. can i escape with queen....should do. Good I have advantage.) ",
        "15. Be7": "On move 14 we where even on points. now i am a pawn up. so i am ahead. if we exchange rooks i will be 4 points up when king takes bishop. what if i take rook then white takes knight....can he trap me.....oh! yes he can, if after Qxa1, Bxc5, then i move Re1, white can then Bb3, Na6, Bd4, c5, Na3, Qxf1 , Qxf1, cxd4, cxd4 am a point up but the future does not bode well.\r\n",
        "15... Qxa1": "I decide to take rook fully expecting Bxc5.",
        "16. Bxc5": "what i expected. now i have to use my experiance. as i said on move 14 i was even. so if Qxa2, d4, g6, Bxf8, Kxf8 i am 2 points up and i have white pinned for a few moves so i am ahead and happy with my position. therefore.....",
        "16... Qxa2 17. d4": "So after g6, Bxf8, Kxf8 again 2 points up.",
        "17... g6": "expecting Bxf8...",
        "18. h4": "complete surprise. I think this is completley crazy when he can exchange bishop with rook. I see why he is doing it, holding on to the prospect of taking queen for free but now i can free rook from bishops sights and save queen whilst going 4 points up!",
        "18... Re8": "Rook, freed from bishop, onto the best square as this may result in a free pawn after Bf5....f6.",
        "19. h5": "Black looks to execute an extremely flawed plan.",
        "19... Nd7": "White resigns. I don't think this is a premature resignation as white has a material advantage and is positionally superior.\r\n\r\n2 important points in this match were:\r\n\r\n 1. the intricate battle around the black king side which is successful for black because of the c6 pawn which allowed the check and black to dictate the pattern of play. \r\n\r\n2. the gamble white takes. clever as it was, these moves should be made when you are certain of success or position as failure can result in a loss of both.\r\n\r\nanother point to be made is discipline. if black sees only material gain then he losses queen and probably match, where as from that position being happy to gain the 2 point lead ultimately wins the match for black. \r\n\r\nI would be grateful for comments from the higher rated players to see there take on this match.\r\n\r\nRegards,\r\n\r\nDavid."
    },
    "url": "https://gameknot.com/annotation.pl/petrov-defence?gm=12112",
    "gameName": "Petrov Defence",
    "players": "bormoley (1552) vs. klondyke (1694)",
    "opening": "Petrov (C42), Italian variation"
}