{
    "moves": {
        "1. e4": "I annotated the game without computer assistance, then ran it through a Fritz blunder check (typically about 17 ply). Therefore comments and computer analysis do not always agree. Fritz only found a single blunder by each player, where a blunder is a move that changes the evaluation by >0.6 pawns.",
        "1... e5 2. Nf3 Nf6": "Petrov's Defence is the most respectable way for Black to avoid the Ruy Lopez in the open game. I haven't faced it much but have struggled when I have.",
        "3. Nxe5 d6 4. Nf3 Nxe4 5. d4 Bg4": "5... d5 is more commonly played.",
        "6. Bd3 d5": "White's advantage is founded on Black's d-pawn taking two moves to reach d5.",
        "7. O-O Be7 8. c4 Nc6 9. Nc3 Nxc3 10. bxc3": "So now there are some imbalances worth discussing. White has a slight lead in development and a strong presence in the centre, but has weaknesses on c4, c3 and potentially d3. Black's pin on f3 has the potential to be a real nuisance. White can try to aggressively exploit the b- and e-files, while Black can put pressure on White's weaknesses.",
        "10... O-O 11. Re1 dxc4 12. Bxc4": "This was the last move in Fritz's opening book, so hereafter I will post Fritz's score.",
        "12... Bd6": "The bishop was safe enough on e7, but now Black can challenge for the e-file. Worth considering was 12... Na5 13. Bd3 c5, striking at White's centre immediately. (Fritz: score of+0.65 / 16-ply analysis)",
        "13. h3": "Forcing Black's DSB to choose between the d1-h5 and c8-h3 diagonals, an easy choice. I wanted to play this move before the queen reached the c8-h3 diagonal, and to push the bishop to h5 for reasons we will see. (Fritz: +0.64/18)",
        "13... Bh5 14. Rb1 Rb8": "? Unnecessary, e.g. 14... Qf6 15. Bd5?! (15. Rxb8?? Na5) Bh2+. The wasted tempo gives White a clear advantage. (Fritz: 14... Rb8 +1.25/17; 14... Re8 +0.37)",
        "15. Rb5 Bg6 16. Bg5": "Piling in, now White has the initiative. (Fritz: +1.10/17)",
        "16... Qd7": "16... Be7 or 16... Ne7 both fail to 17. Rd7. (Fritz: +0.83/14)",
        "17. Nh4 a6 18. Nxg6 axb5": "18... hxg5 might have been better. The rook would then have been forced to retreat. (Fritz disagrees: +0.78/18)",
        "19. Nxf8 Kxf8": "Also interesting is 19... Qf5 20. Bd3 Qxg5 21. Nxh7 (Fritz: +0.78/16)",
        "20. Bxb5 Qf5": "White can now play 21. Qh5, threatening Be7+, but after the simple 21... Kg8, h5 is not a particularly good square for the queen. Still, the game line leaves us with opposite bishops and chances of a drawish endgame. (Fritz: +0.99/18; according to Fritz, the attack was played accurately by both players)",
        "21. Bxc6 Qxg5 22. Qb1": "Threatening 23. Qxh7 while maintaining the bishop on the excellent c6 square, but this move is also making a rod for White's back. The queen is bound to the b-file, and d2 has been gifted to Black's queen. (+1.21/18)",
        "22... g6 23. a4": "? The pawn march could win the game for White if there was time for it, but there isn't. (Fritz: 23. a4 +0.58/19; 23. Qb2 +1.24)",
        "23... Qd2 24. Rc1": "Leaving an excellent square to passively defend c3, but it was necessary. (+0.24/19)",
        "24... Kg7": "This simple move deals with all Black's troubles in the position except the material deficit. Now White has to be careful in disentangling his position, otherwise Black's simple plan of Qf4, Re8 and Qh2+ could become dangerous. (+0.23/17)",
        "25. Bf3 f5": "This seemed a slight waste of a tempo to me. (Fritz: 25... f5 +0.44/18; 25... Qf4 +0.00)",
        "26. Qc2 Qxc2": "Black gives up the initiative for an endgame in which White will struggle to make use of the extra pawn. (Fritz: +0.42/19)",
        "27. Rxc2 Re8 28. g3 Re1+ 29. Kg2 b6 30. Bc6 h5": "(Fritz: +0.36/19)",
        "31. c4": "?! White needed to play (e.g.) Bb5 first. (Fritz: +0.22/19)",
        "31... Bb4": "! White's idea had been e.g. 31... Kf6 32. c5, creating a passed pawn for White, but after 31... Bb4 32. c5 bxc5 33. dxc5 Re5, Black is also getting a passed pawn. Now Black threatens 32... Rd1, forcing 33. d5, which is dead drawn. (Fritz: +0.22/19)",
        "32. Kf3": "Now 32... Rd1 33. Ke3 Re1+ draws, but I simply was hoping for a mistake. (Fritz: +0.22/18)",
        "32... Kf6 33. Bb5 Re4": "Advancing either pawn leads to a draw. I chose the one with the best chance of provoking an error. (Fritz: +0.06/19)",
        "34. c5 Rxd4": "34... bxc5 35. dxc5 and we could have played on. (Fritz: +0.06/23)",
        "35. cxb6 cxb6 36. Rc6+ Rd6 37. Rxd6+ Bxd6 38. Ke3": "Draw agreed. (Fritz: Score +0.00 / Ply 25-ply analysis)"
    },
    "url": "https://gameknot.com/annotation.pl/petrovs-defence-and-one-or-two-stalled-attacks?gm=31632",
    "gameName": "Petrov's defence and one or two stalled attacks",
    "players": "kicorse (1856) vs. johnpap6 (1866)",
    "opening": "Petrov (C42), classical attack"
}