{
    "moves": {
        "1. e4": "This match is a training game with my teammate kvikas.  We welcome all comments and suggestions for improved play.",
        "1... e5 2. Nf3 Nf6": "I really like Petrov and play it a lot.  Part of it is because I just dislike the lines in Ruy Lopez, but I just like the path less trodden.",
        "3. Nc3": "Now we're in a three knights game.",
        "3... Nc6 4. d4": "Standard developmental attack.",
        "4... exd4 5. Nxd4 Bb4": "All book so far...",
        "6. Nxc6": "The first choice.  Note that if I play dxc6, Qxd8+ is a winning play",
        "6... bxc6 7. Qd3": "Decent play.  More common is Bd3, continuing development and preparing for a castle.  If you want to move the queen I might also consider Qd4 or Qf3.  Bd2 is also a strong contender...",
        "7... O-O": "No need to hesitate here, go for the castle and prep for completing development.",
        "8. Bg5": "Not a bad move, especially if you're thinking of castling queenside.  I might have played Bd2 instead.",
        "8... Re8": "When in doubt, rooks love half-open files, especially when a king is on the other side...",
        "9. Be2": "Puts some separation between the king and rook, allows for a kingside castle as well.  White is in pretty good developmental shape and is close to escaping unscathed from the opening.",
        "9... Bxc3+": "Offering a chance to go up a pawn.  If Qxc3, then Nxe4 wins.",
        "10. bxc3": "We're still pretty even here, and doubled, isolated pawns aren't the end of the world, but I still consider myself slightly ahead.",
        "10... h6": "Looking to chase away the bishop or make an exchange...",
        "11. e5": "unexpected!  I think top play was Bxf6 instead.  Black now has a few choices in how to respond.  I can either exchange pieces and win a pawn, or just win a pawn and see what happens.",
        "11... Rxe5": "I choose pawn now.",
        "12. Bxh6": "More and more unusual.  When you're down points you should trade pawns, not pieces.  We also don't want to trade bishops for pawns if we can help it. I expected White to flee or perhaps trade.  ",
        "12... gxh6 13. f4": "Not a bad play, forces me to move my rook.",
        "13... Rd5 14. Qg3+ Kh7 15. O-O d6": "Looking to get my LSB into the game.",
        "16. Bc4": "Good move by White.  It threatens Bxf7, setting a possible bad position for my king.",
        "16... Be6": "This move was a mistake on my part.  Better to move the rook, perhaps to c5, allow the f pawn to be taken, and then move my bishop to f5 to finalize deployment of my pieces, and protect against the Q/B combo on g6.  I just moved too quickly without fully analyzing my position...",
        "17. Bxd5": "f5 was a stronger play, increasing pressure on my pieces.",
        "17... Bxd5 18. f5": "Eventually the pawn now at f5 could present complications for me, but as of right now, it's a protective barrier for my knight and queen to inhabit the f6 square.",
        "18... Ne4": "I also thought about Qg8 here instead.  I wanted to see if I could create any \"play action\" by getting my pieces into the middle of the board.",
        "19. Qh3": "Perhaps with an eye towards defending g2 with the queen?  Uncertain.  I feel like Qd3 was a better move, as it set the queen on a diagonal with the Black king.  As a general tip when positioning power pieces, put them in lines that naturally allow attacks, either direct or discovered, as it creates pressures and possibilities. Your pieces are generally more useful when they can attack than just being used for defense.",
        "19... Qf6": "Natural positioning for the Black queen.",
        "20. Rf4": "Good idea getting the rook into the game.",
        "20... Rg8": "Again, natural pressure building.",
        "21. Re1 Ng5": "This move isn't as useful as just taking the c3 pawn, which is what I wanted to do.  I was curious to get some action against the g2 pawn and see what I can make happen.",
        "22. Qh5": "This move represented a huge blunder on White's part and I didn't see it.  Qxc3 would have been a huge play for Black!  It would threaten the rook with capture and a follow up of Ng3+!!  The top play for White was Qe3.",
        "22... Bxg2": "Sometimes after a game you look back at what might have been and shake your head at the things you missed.  This move was one of those moments for me.  I saw a small prize and didn't notice the big one that was available.",
        "23. Kxg2 Ne6+ 24. Kf3 Nxf4 25. Kxf4 Qxc3 26. Qxf7+": "Unexpected.  I thought White might play Re7 first.  A thing to remember, the immediate kill isn't always the best option.  Sometimes it's better to build a coalition of strength through more pieces in play, before delivering the final blow.  A key difference between junior and more advanced play is the willingness to let power build so you can deliver a more decisive blow rather than taking the first offering.",
        "26... Rg7 27. Qe8 Qd4+": "When a king is exposed in the middle of the board and you have a Q/R combo, check the possibilities before jumping in.  I should have played Qd2 instead, as it affords me the chance to scarf some pawns and get a better set of attacking options.  Poor play by me!",
        "28. Kf3 Qg4+": "Here I make a play for the f5 pawn.  Perhaps Qc3+ would have been better, with the chance for 2 pawns instead of 1.",
        "29. Ke3 Qxf5 30. Kd2 Rg2+ 31. Re2 Qa5+ 32. Kd1": "Now White is forced into an exchange, all but securing a Black victory.",
        "32... Rg1+ 33. Re1 Rxe1+ 34. Qxe1 Qxe1+ 35. Kxe1": "When you find yourself in these situations you need a game plan on how to secure victory.  White's pawns are all singletons, so there is no support there.  Essentially Black gets their king to the middle of the board, pushes the three pawns on the c and d files up, and then leverages 3 on 1 attacks with the king to promote.  If White moves to block with their King, the Black king can go scarf the h pawn and promote.  It is almost impossible to not win as Black here, but you still have to execute.",
        "35... Kg6 36. Ke2 Kf5 37. Kf3 c5 38. a3 c4 39. c3 d5 40. Ke3 c5": "I'm not certain if this is the best move or not, but it hardly matters at this point.  c5 prevents White's king from coming into the d4 square and affords me enough flexibility that regardless of his next move, I can start forcing a pawn to promotion.  Either I can attack with the King towards h2 or advance the pawn to d4 and it's all but finished...",
        "41. a4 a5 42. h3 h5 43. Kf3 Ke5 44. h4 d4": "thanks to kvikas for a good game.  Appreciate your comments."
    },
    "url": "https://gameknot.com/annotation.pl/petrov-three-knights-training-game?gm=61859",
    "gameName": "Petrov three knights training game",
    "players": "kvikas (1482) vs. evilgm (1920)",
    "opening": "Petrov three knights game (C42)"
}