{
    "moves": {
        "1. e4 e5 2. Nf3 Nf6 3. Nxe5 d6 4. Nf3 Nxe4": "Standard opening.",
        "5. Nc3 d5": "?! Not a great pawn sac. Maybe Nxc3 should have been considered?",
        "6. Qe2": "Next few moves develop as expected.",
        "6... Be7": "Black will loose a little tempo here having to move the DSB twice in a matter of moves.",
        "7. Nxe4 dxe4 8. Qxe4 O-O 9. Bc4": "Bd3 looks more obvious although is easily defended with 9...g6   a continuation would lead to black having good compensation for the pawn if he could get Bishops into play. ",
        "9... Bd6 10. O-O": "White is aiming for a quick development. The center is totally open. White has a good lead in development.",
        "10... Re8 11. Qd3 Nc6 12. b3": "! Nice move. Allows white to get DSB into play.",
        "12... Qf6 13. Bb2": "Great move. Instead of holding on to pawns white is looking at bigger picture and attacks.",
        "13... Qxb2 14. Ng5 Be6": "After 14.. g6 15. Bxf7+, Kg7. 16. Bxe8, Qe5. 17. Qc3,  Kd4. 18. f4  very nice  :)",
        "15. Bxe6 fxe6": "Creates an isolated pawn but allows more room for King to escape.",
        "16. Qxh7+ Kf8 17. Rae1": "IS c3 stronger? This move allows Queen to return home & defend.",
        "17... Qf6 18. Qh5": "Better than Qh8+",
        "18... Kg8 19. Re3": "Looking to get to h3 and force a back row mate.",
        "19... Bf4": "Black trying to rid advanced knight.",
        "20. Qh7+ Kf8 21. Qh8+": "White forced into playing winning exchange and wait for the win.",
        "21... Ke7 22. Rxe6+": "Good move. Wins Queen & pawn in exchange for Rook and Knight",
        "22... Qxe6 23. Qxg7+ Kd6 24. Nxe6 Rxe6 25. d4": "Queenside pawn charge to pressure blacks king.",
        "25... Rae8": "Black has to get rooks working togeather to make up for the lack of Queen.",
        "26. c4": "Pressing forward ",
        "26... Re8e7 27. Qf8 Re6e4": "Putting pressure on pawn.",
        "28. Qf5": "White spots something more valuable.",
        "28... Rxd4": "Black picks up the free pawn... but doesn't spot....",
        "29. c5#": "Nice finish. Mate with a pawn   :)"
    },
    "url": "https://gameknot.com/annotation.pl/petroff-defence-g33?gm=27263",
    "gameName": "Petroff defence (g33) ",
    "players": "  vs.  ",
    "opening": "Petrov (C42), Nimzovich attack"
}