{
    "moves": {
        "1. e4": "I opted to annotate this game as a training discussion for my team, The Burninators.  It starts off easily enough as a three knights game.",
        "1... e5 2. Nf3 Nf6 3. Nc3 Nc6 4. Bc4": "The development thus far is pretty standard stuff that I have played as white a time or two.  I decided to spice things up a bit and start a charge to see how white would react.  One of the things that discomfits people is the unexpected play.  My guess is that white has not played against this variation before, when I played my next move.",
        "4... Nxe4": "This is a very aggressive early play by black.  On the surface it is a positional play to exchange material early and often for a more open game.",
        "5. Nxe4": "Takes the pawn, allowing the pawn pin.",
        "5... d5": "There are a lot of potential responses.  My favorite is Bd3, keeping pressure on the king's bishop pawn and doubling up the e-file pawn.  Another popular play is Bxd5.",
        "6. Neg5": "I did not, however, ever expect white to play this move, which is a mistake.  It allows me to gain the e pawn for free, only at the expense of a doubled c pawn.",
        "6... dxc4 7. c3": "I wasn't certain what white was attempting to accomplish here.  Much stronger would be a castle, to protect the king and start using those knights to your advantage.  Once the king is safe, then you can consider bringing your b or d pawn into the game to get rid of that pesky c4 pawn.  Pawns that are allowed to sit around sometimes end up becoming permanent.",
        "7... f6": "I considered a few other moves, such as Qd3, but felt that allowing white to keep projecting power into my space with his knights was a bad idea.  Besides, it was an easy choice.  His knights would run away and I could still do the queen move later.",
        "8. Ne4": "Any other move by white allowed either direct capture or ripping apart his kingside pawn structure.",
        "8... Qd3": "Now we bring the queen up to trap his king.  White has a few choices here, and none of them are good.  He can't move either knight to directly threaten my queen, because of my black bishop or placement of his other pieces.  He can either move his queen up to e2 or move his f3 knight, followed by his f2 pawn, to put his e4 knight to shoo me away.  Three moves at this stage while I get to continue to develop is a bad choice, so I think white made the best decision here.  However, none of this discussion would be taking place if white had castled instead.  Wasted moves early in a match can spell big trouble very quickly.",
        "9. Qe2 Qxe2+ 10. Kxe2": "Now white is down a pawn and has lost his castle.  His black bishop is also completely fenced in.  How could I make his life more painful in short order?",
        "10... f5": "Now we begin the pawn march.  White has two knights sitting out there that are being threatened by my pawns and can continue to be harrassed for some time unless he plays smartly.",
        "11. Neg5": "The move to g3 would have been a better play, and is the move I was expecting white to make.  Now, however, I can do some more pawn marching.",
        "11... h6 12. Nh3 g5": "This move threatens a knight fork by a pawn.  White now has to move one of this two knights to safety.",
        "13. Nhg1": "I haven't analyzed the position too well to see which of the two knight moves was better.  Neither move is very desirable at this point.",
        "13... e4": "This move forces white to either retreat yet again or to double up and isolate some pawns.",
        "14. Nd4 Nxd4+ 15. cxd4": "Double and isolated pawns in the middle of the board are no one's friend.  White has one developed pawn, lost his ability to castle and has all of his remaining power pieces in their starting gates.  How did we come to this place?  White overextended his pieces and allowed me to mercilessly pawn march them back into their holes.  You have to move your pieces out smartly.  I honestly think that the 6th and 7th moves by white are what got us here.  Instead of doing proper development, white took a more haphazard approach to development and now he is down a staggering amount of development.  The game isn't completely over yet, but it's about to get ugly quickly.  I can get all of my remaining pieces into play without any real constraints, and black still has a ways to go to try and catch up.",
        "15... Be6 16. Nh3": "I looked at where white was and this was the safest development choice, but I don't think it was the smartest.  White is going to have a hell of a time getting his bishop into the game while the c4 pawn is in its location.  Perhaps Rb1 in preparation for a pawn push to get your bishop into the game?",
        "16... O-O-O 17. Re1": "It might have been better to move Rb1 and then trade pawns so his bishop can get into the game and connect his rooks.  Despite the fact that white is woefully behind in development, he is still only down one pawn (for a little while longer).  If he can get his pieces into play he is still in the game.",
        "17... Bg7": "Instead of Rxd4.  White could have played \n\n18. b3 Bg7\n19. bxc4\n\ngiving lots of breathing room for his bishop to come out and play.  By moving the bishop up first instead I prevent that possibility and the d4 pawn is still there for the taking.",
        "18. Kf1": "Freeing up his rook via a manual castle.  While I think it's a good idea to get your king to safety, I'd consider getting your bishop and other rook into the game a higher priority at this stage for white.",
        "18... Bxd4 19. Kg1": "White still has almost no development.  It would have been better to keep the king where he was for the past two moves and get his other pieces into the game.  Moving the king away more doesn't offer any hope of regaining momentum or trying to get back in the game.  It looks like a series of moves just prolonging an inevitable death.",
        "19... Be5": "Centralization is always a good thing.  This move, however, was designed to trap white's knight.",
        "20. Rb1": "Finally working on a plan to get out the black bishop.",
        "20... g4": "Because white chose to move the king twice and block of the knight's escape, this sequence became possible.",
        "21. g3": "This move should probably be categorized as a blunder.  Instead consider f4.  It provides a pathway to parity at least.  Now white gives up the knight for free, only slightly inconveniences black, and provides a portion of a potential future mating net for his own king.",
        "21... gxh3 22. f4": "too little, too late.",
        "22... Bd4+ 23. Kf1": "The better of the two choices.  If Kh1 instead, then 23... bd4 starts making white very uncomfortable.",
        "23... c3": "To exchange a rook for a pawn and a bishop.  Although the d pawn is weak and isolated and now white can reconnect it with his brethren on a-b, this move still provides black with more material gain and, more importantly, opens up the d file to a double rook attack.",
        "24. dxc3 Bc4+ 25. Re2": "Note that this pin is only possible because of white's previous blunder by giving up the knight for free.",
        "25... Bxe2+ 26. Kxe2 Bb6": "In retrospect I should have moved to g1 instead to eat white's h and g pawns.  However, we can't make the right moves all of the time.",
        "27. a4": "b4 is a much better play, giving more options to the black bishop, which becomes important in a few moves.",
        "27... Rd3": "Threatening the loss of the h/g pawns via my bishop and also allowing the rooks to double up.",
        "28. Bd2": "In theory a decent move if you are most concerned with the g/h pawns, but it also seriously compromises white at the same time.",
        "28... Rhd8 29. Rd1": "A blunder.  At this juncture it would have been better to move the bishop to e1 and cede the h/g pawns as lost.",
        "29... e3": "A crushing play that ends the chapter on this game.  The major learning points from the game are to develop smartly.  You can lose a game in the first few moves and white's moves 6-7 are a good example of this principle.  Instead of seeking shelter for the king, white made unnecessary moves that laid the early foundation for his defeat.  Once he did get to a point where he was forced to trade queens to keep his king alive, I was able to pawn march his pieces back into their starting places, seriously restricting his overall development.  When the pawn march had finished, white became obsessed with protecting his king with a manual castle instead of finding a way to get his other pieces into the game.  The rest, as they say, is history."
    },
    "url": "https://gameknot.com/annotation.pl/petrov-three-knights-game-c42?gm=44577",
    "gameName": "Petrov three knights game (C42)",
    "players": "cubanisimo (1359) vs. evilgm (1746)",
    "opening": "Petrov three knights game (C42)"
}