{
    "moves": {
        "1. e4 e5 2. Nf3 d6 3. d4 exd4 4. Nxd4 Nf6 5. Nc3 Be7 6. Bc4": "More usual, and possibly better, is 6.Be2; here the Bishop can be attacked by advancing pawns. It also gives Black the option of 6...Nxe4 though after 7.Nxe4 d5 8.Bd3 dxe4 9.Bxe4 White is better placed, according to the computer.",
        "6... O-O 7. O-O": "We both get our Kings tucked away...",
        "7... a6": "Preparing to drive away the Bishop with 8...b5?",
        "8. Bf4": "I ignore that threat and develop another piece, giving me a strong centre.",
        "8... Nc6": "A dubious move, partly since it makes Black's last move 7...a6 rather pointless, and also because it allows me to double Black's pawns by exchanging, rather like in the Scotch Opening.",
        "9. Nxc6": "So I do.",
        "9... bxc6 10. e5": "Now Black really doesn't want to take on e5 and leave himself with doubled, isolated pawns.",
        "10... Ne8": "So the Knight must retreat.",
        "11. Re1": "Equally, I don't want to take on d6 and allow Black to undouble his pawns, so I support the pawn with my Rook.",
        "11... d5": "This gives Black the opportunity for counterplay, driving away my Bishop...",
        "12. Be2": "I decide to go to e2 and think maybe it would have been better there in the first place?",
        "12... Rb8": "Black makes the most of the half-open file.",
        "13. Rb1": "I defend the threatened pawn; 13.b3 leaves the Knight undefended.",
        "13... Bb4": "In turn threatening to double my own pawns.",
        "14. Bd2": "I don't want that! Black has driven me back quite successfully!",
        "14... f6": "Now my lone pawn is vulnerable, so I exchanging rather than supporting it with 15.f4, which could leave me with a weak and isolated pawn...",
        "15. exf6 Nxf6": "However, it does let Black's Knight back into the game.",
        "16. a3": "Now it's my turn to drive my opponent back.",
        "16... Bxc3 17. Bxc3 Ne4": "From e8 to e4 in two mightly leaps - this now threatens my f-pawn, and Black has acres of space on the K-side to exploit...",
        "18. Qd4": "As well as (sort of) defending the f-pawn I threaten mate on g7.",
        "18... Qg5": "Black counters with the start of a dangerous looking attack; I can see that Bh3 is soon to follow!",
        "19. f3": "I can't see anything better, even though I am wary of weakening my King's position.",
        "19... Nxc3 20. Qxc3 Bh3 21. Bf1": "This attack really has me on the back foot, but I feel I can hold the position.",
        "21... Qg6": "Defending the attacked c-pawn, though I am more preoccupied with defence at present!",
        "22. Kh1": "At least it gives me a move to get out of the Queen's line of fire and so putting the Bishop under threat.",
        "22... Bf5": "Threatening to win the pawn on c2.",
        "23. Bd3": "I wondered about nicking the undefended pawn on a6 in return for the c-pawn - something like 23.Bxa6 Bxc2 24.Rc1 Bf5 25.Qxc6 Qxc6 26.Rxc6... but it looked very suspect. I haven't seen an analysis, so this may indeed have been a better plan.",
        "23... Qd6": "Declining an exchange of 23...Bxd3 24.Qxd3 Qxd3 25.cxd3, which rather fractures my pawn position. Again, I do not know if this would have been better. Understandably, though, Black wants to keep the momentum of his attack going.",
        "24. Bxa6": "I decide it's safe to nick the pawn. Now Black's bridges are burned; he's a pawn down and has doubled pawns, so an endgame, even against me, looks hard to win.",
        "24... Rf6": "Clearly lining up to go to h6 and threaten mate.",
        "25. Bf1": "But I have time to get back.",
        "25... Rh6 26. h3": "More weakening pawn moves around my King, but I can't see alternatives.",
        "26... Rf8": "It's looking horribly dangerous now!",
        "27. Re2": "I agonised for ages between this and 27.g4, but decided that weakened my pawn structure too much and that this, instead, would hold the position. However, Black's going for it...",
        "27... Bxh3": "It's win or bust now. Or is it?",
        "28. gxh3 Qg3": "Ouch!",
        "29. Rh2": "Clearly, threatening the Queen with 29.Rg2 loses. Instead I double my defence of a very weak pawn. I spend the rest of the game avoiding mating threats.",
        "29... Rxf3": "Black's attack more than compensates for his lost exchange. But can he force a win?",
        "30. Qd2": "If the Rook on h6 stays there I may be able to take the sting out of the attack my giving up my Queen for it and following up by pinning Black's Queen?",
        "30... Rhf6": "But the Rook gets behind his partner and threatens mate on f1.",
        "31. Qe2": "I am just about holding on.",
        "31... Qf4": "A triple alliance against my Bishop.",
        "32. Bg2": "Potential counter-threats on e8 exist in my imagination only. I have to keep defending.",
        "32... Re3 33. Qf1": "Offering a hopeful exchange?",
        "33... Qe5": "But Black just revals another threat to my Queen. Both Rooks are tied down defending pawns, so I depend on my Queen and Bishop; allowing the b-pawn to fall would just let Black mop up my Q-side pawns.",
        "34. Qg1": "Three pieces protecting my King. I'm glad there isn't a Knight on the board!",
        "34... Re6": "Now Black lines up for the kill; if I allow 35...Re1 36.Rxe1 Qxe1 37.Qxe1 Rxe1+ 38.Bf1 Rxf1 I'm sunk.",
        "35. Bf1": "So I block the threat.",
        "35... Rg6": "Black goes back to attacking my Queen.",
        "36. Bg2": "I block again...",
        "36... Re6": "He lines up his pieces again.",
        "37. Bf1 Rg6 38. Bg2": "I see no options: 38.Rg2 and mate follows Rxh3, while 38.Qf2 Rf6 and we continue torepeat...",
        "38... Re6": "So I claimed a draw by repetition. Could I have escaped and made the most of my extra material? Did Black miss a mate? I'd be interested to know...."
    },
    "url": "https://gameknot.com/annotation.pl/philidors-defence-was-there-a-missed-mate-here?gm=63977",
    "gameName": "Philidor's Defence -was there a missed mate here?",
    "players": "jimspellman (1733) vs. metcalfe (1740)",
    "opening": "Philidor (C41), Berger variation"
}