{
    "moves": {
        "1. d4": "A40 Queen's Pawn Opening. The Queen's Pawn opening move is somewhat slower than the popular e4, because White will not be able to castle for three more moves. Its advantage is that it gives White more control over tactical surprises and often provides more lasting initiative and pressure.\n",
        "1... d5": "D00 Queen's Pawn Game 1.d4 d5. Black answers symmetrically, challenging the center directly.\n",
        "2. Nf3": "D02 Grunfeld Reversed. A solid opening move, delaying c2-c4 to avoid the Queen's Gambit.\n",
        "2... Nc6": "D02 Grunfeld Reversed / Chigorin Variation 1.d4 d5 2.Nf3 Nc6. Positionally suspect. In Queenside openings, one rarely is rewarded when blocking the c-pawn because you lose that as a lever against the center. 3.c4 (see!) 3...Bg44.cxd5 Bxf3 5.gxf3 Qxd5 6.e3 e57.Nc3 Bb4 8.Bd2 Bxc3 9.bxc3Qd6 and White is 8% better, possessing the Bishop pair and a strong center.\n",
        "3. Bf4": "Out of Opening Book. c2-c4 would have been in the Grunfeld Reversed / Chigorin Variation 1.d4 d5 2.Nf3 Nc6 book opening. §\u0090ž¯³¹—¨ ƒŸƒ\u008fƒŸƒŸ \u008f\u0090—\u0090\u008f\u0090\u008f\u0090 \u0090\u008f\u0090Ÿ\u0090\u008f\u0090\u008f \u008f\u0090\u008fÿ\u008f\u009d\u008f\u0090 \u0090\u008f\u0090\u008f\u0090•\u0090\u008f ýÿý\u0090ýÿýÿ ¦•\u0090ª²›\u0090¤ \n",
        "3... Nf6 4. h3 e6 5. Nc3 Be7": "Makes way for a castle to the kingside.\n",
        "6. e3 O-O 7. Bb5": "Clears the way for a kingside castle.\n",
        "7... Bd7 8. a3 a6": "Attacks White's bishop at b5.\n",
        "9. Ba4": "Moves it to safety.\n",
        "9... Be8 10. Qd3": "Enables the long castle.\n",
        "10... Bd6 11. Bg5": "Pins Black's knight at f6.\n",
        "11... e5": "Leads to 12.a4xc6 e5-e4 13.g5xf6 g7xf6 14.c3xe4 e8xc6 15.e4xd6 d8xd6 16.O-O-O c6-b5 17.d3-f5, which wins two bishops and a knight for a bishop, two knights, and a pawn. Better is b7-b5, leading to 12.a4-b3 h7-h6 13.g5-h4 b5-b4 14.a3xb4 g7-g5 15.h4-g3 d6xg3 16.f2xg3 c6xb4 17.d3-e2, which wins a bishop and a pawn for a bishop and a pawn. This was black's only serious miscue, but black was able to stay close and eventually mated. §\u0090\u008f¯ž¨³\u0090 \u0090Ÿƒ\u008f\u0090ŸƒŸ Ÿ\u0090—¹\u008f˜\u008f\u0090 \u0090\u008f\u0090Ÿƒ\u008f\u009d\u008f ›\u0090\u008fÿ\u008f\u0090\u008f\u0090 ÿ\u008f–ªÿ•\u0090ý \u008fÿý\u0090\u008fÿý\u0090 ¦\u008f\u0090\u008f²\u008f\u0090¤ \n",
        "12. dxe5": "Leads to 12...c6xe5 13.f3xe5 d6xe5 14.a4xe8 f8xe8 15.g5xf6 d8xf6 16.c3xd5 f6-g5 17.O-O-O g5xg2 18.d3-f5 a8-d8, which wins a bishop, two knights, and two pawns for two bishops, a knight, and two pawns. Better is a4xc6, leading to 12...e5-e4 13.g5xf6 g7xf6 14.c3xe4 e8xc6 15.e4xd6 d8xd6 16.O-O-O c6-b5 17.d3-f5, which wins a bishop, two knights, and a pawn for two bishops and a knight.\n",
        "12... Nxe5": "Protects Black's bishop at d6 and Black's knight at f6 and attacks White's queen.\n",
        "13. Nxe5": "Removes the threat on White's queen.\n",
        "13... Bxe5": "Black wins a knight and a pawn for a knight and a pawn. Material is even.\n",
        "14. Bb3 d4": "Attacks White's knight.\n",
        "15. Ne4": "Slightly better is c3-d5.\n",
        "15... h6": "Slightly better is e8-b5.\n",
        "16. Bxf6": "Forks Black's bishop at e5 and Black's queen and blocks Black's pawn at f7.\n",
        "16... Bxf6": "Protects Black's queen.\n",
        "17. Nxf6+": "Checks Black's king and blocks Black's pawn at f7.\n",
        "17... Qxf6": "Protects Black's king.\n",
        "18. c3": "Leads to 18...d4xe3 19.O-O e8-b5 20.c3-c4 a8-d8 21.d3-e2 b5-d7 22.a1-d1 e3xf2+ 23.e2xf2 f6xf2+ 24.f1xf2 d7-e6 25.d1-e1, which wins a queen and a pawn for a queen and two pawns. Better is d3xd4, leading to 18...f6-e7 19.b3-d5 a8-d8 20.d4-e4 e7xe4 21.d5xe4 b7-b6 22.a1-d1 e8-b5 23.e4-f3 f8-e8 24.d1xd8 e8xd8, which wins a queen, a rook, and a pawn for a queen and a rook.\n",
        "18... dxe3": "Black wins a bishop, a knight, and a pawn for a bishop and a knight. Black is ahead by a pawn in material.\n",
        "19. f3": "Look out. Allows an enemy passed pawn on e3. Leads to 19...f6-h4+ 20.e1-d1 a8-d8 21.b3-d5 e8-b5 22.c3-c4 b5xc4 23.d3xe3 f8-e8 24.e3xe8+ d8xe8 25.d5xb7 h4-f2, which wins a rook and two pawns for a queen and a pawn. Much better is O-O, leading to 19...e8-b5 20.c3-c4 a8-d8 21.d3-e2 b5-d7 22.f2xe3 f6-b6 23.b3-a2 d8-e8 24.a1-e1, which wins a pawn. This was white's key error. White was not able to regain the lost ground and was eventually mated. §\u0090\u008f\u0090ž¨³\u0090 \u0090Ÿƒ\u008f\u0090Ÿƒ\u008f Ÿ\u0090\u008f\u0090\u008f¯\u008fƒ \u0090\u008f\u0090\u008f\u0090\u008f\u0090\u008f \u008f\u0090\u008f\u0090\u008f\u0090\u008f\u0090 ÿ›ÿªƒý\u0090ý \u008fÿ\u008f\u0090\u008f\u0090ý\u0090 ¦\u008f\u0090\u008f²\u008f\u0090¤ \n",
        "19... Qh4+": "Protects Black's pawn at e3, checks White's king, and blocks White's pawn at h3.\n",
        "20. Kd1": "Moves it out of check and threatens Black's pawn at e3.\n",
        "20... Rd8": "Pins White's queen with a partial pin, removes the threat on Black's pawn at e3, and attacks White's queen.\n",
        "21. Qxd8": "Leads to 21...h4xd8+ 22.d1-c2 d8-d2+ 23.c2-b1 d2xg2 24.b1-a2 e8-c6 25.a1-e1 g2xf3 26.h1-f1 f3xh3 27.f1-f4 c6-g2 28.e1-g1 e3-e2 29.f4-d4, which wins a rook for a queen and three pawns. Better is b3-d5, leading to 21...e8-b5 22.c3-c4 b5xc4 23.d3xe3 f8-e8 24.e3-c3 d8xd5+ 25.d1-c1 h4-g5+ 26.c1-b1 g5xg2 27.h1-c1, which wins a pawn for a bishop and two pawns.\n",
        "21... Qxd8+": "Protects Black's pawn at c7 and checks White's king. Black wins a queen for a rook.\n",
        "22. Ke2": "White steps into the forced mate. Much better is d1-c2. d1-e2 leads to 22...d8-d2+ 23.e2-f1 d2-f2# and mate.\n",
        "22... Qd2+": "Black will mate next turn. Protects Black's pawn at e3 and forks White's king and White's pawn at b2. Leads to 23.e2-f1 d2-f2# and mate.\n",
        "23. Kf1": "Forced. Moves it out of check.\n",
        "23... Qf2#": "Checkmates White's king. \u008f\u0090\u008f\u0090ž¨³\u0090 \u0090Ÿƒ\u008f\u0090Ÿƒ\u008f Ÿ\u0090\u008f\u0090\u008f\u0090\u008fƒ \u0090\u008f\u0090\u008f\u0090\u008f\u0090\u008f \u008f\u0090\u008f\u0090\u008f\u0090\u008f\u0090 ÿ›ÿ\u008fƒý\u0090ý \u008fÿ\u008f\u0090\u008f¯ý\u0090 ¦\u008f\u0090\u008f\u0090°\u0090¤ \n"
    },
    "url": "https://gameknot.com/annotation.pl/phoenix-phoenix-academy?gm=54194",
    "gameName": "Phoenix, Phoenix Academy",
    "players": "F. Walls  vs. C Colley ",
    "opening": "Queen's pawn game, Chigorin variation (D02)"
}