{
    "moves": {
        "1. e4 e5 2. d4": "This a game from my own tournament, and the highest rated player I've beaten. I offered up the Danish Gambit",
        "2... exd4 3. c3": "He accepted and so I offered yet another pawn",
        "3... dxc3 4. Bc4": "the bishop comes out, creating a nice diagonal. My opponent can still choose to decline by bishop b4, if so the recommende move is to take his pawn with the bpawn, forcing him to move his bishop. If he now moves the bishop to a5 it is lost with white's queen to d5.",
        "4... cxb2 5. Bxb2": "He didn't decline, and this is the Danish accepted line ",
        "5... Qh4": "his queen came out",
        "6. Nc3 Bb4": "my knight and his bishop",
        "7. Nge2 Ne7": "my knight to protect the other knight, and he develops his knight to the e7 square",
        "8. O-O a6": "I castled queen-side and he pushe his a-pawn. With the intention, I think, for his b-pawn to kick the bishop",
        "9. Bxf7+": "So I take his f7 pawn hoping his king walks",
        "9... Kxf7 10. Qb3+": "it did, and now my queen captures his bishop",
        "10... Ke8 11. Qxb4": "I am still one down, and he has the move. But my pieces are very active, his queen is out walking (without a chaperone), and he can no longer castle",
        "11... Nbc6 12. Qb3": "he pulled his knight into the action with a tempo, forcing me to backtrack my queen, but it's not a bad square.",
        "12... Qg5 13. f4": "his queen moving to g5 I don't really understand, but I push my pawn, hoping to free up space for my rook",
        "13... Qg6 14. f5 Qg5": "Hei falls back, I push, and he insists on the g5 square, probably looking to d2 (?) ",
        "15. Nd5": "I'm hoping for the c7-fork",
        "15... Nxd5": "he forsees it and kills my knight",
        "16. Qxd5 Ne7": "I revenge the knight, and he falls back with his other knight, threatening my lady Queen",
        "17. Qb3 b5": "Again I fall back with her, and he pushes his b-pawn",
        "18. f6": "allowing me a sneak-attack on his kingside pawn-structure",
        "18... gxf6 19. Bxf6": "He probably thinks he can avoid the fork with an inbetween check",
        "19... Qc5+ 20. Bd4": "but he can't",
        "20... Qh5 21. Ng3": "He moves his queen to the h-file and I use the advantage to develop my knight to a better square",
        "21... Qh6 22. Bxh8": "he retreats his queen and I cature his cornered rook",
        "22... d6": "he creates space for his king to hide, and opens the way for his bishop",
        "23. Qf7+ Kd7": "allowing me to check him, forcing him behind his knight, blocking for the bishop, and now I can attack his queen with bishop to g7",
        "24. Bg7 Qe3+": "he checks the king",
        "25. Rf2": "i protect with the rook",
        "25... Qd4": "and then the blunder of queen to d4 allowing me to stab her in back with my bishop",
        "26. Bxd4": "and black resigned. Not a brilliant game from black's perspective but at 1553 a nice scalp for me, and an ok version of the danish gambit accepted. Hope you enjoyed, feel free to comment"
    },
    "url": "https://gameknot.com/annotation.pl/pidah-klooss-danish?gm=56464",
    "gameName": "Pidah Kloos's Danish",
    "players": "pidahkloos (1261) vs. mihait (1553)",
    "opening": "Danish gambit (C21), Collijn defence"
}