{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Bc4": "A classic move; one of the oldest openings.",
        "3... Nf6": "This is the Two Knights Defense: black pressures the e4 field, but reduces his own ability to defend the f7 field. As black, this is my favorite e4-e5 opening, not because I am particularly successful with it, but because it always full of tactical and sharp play.\n\nMikhail Chigorin, who played two matches for the World Champion title against Steinitz, loved this opening and played it often.",
        "4. Nc3": "At a first glance, a good move: white develops a knight and defends a pawn. But in this particular position, there are better moves: 4.Ng5 (which always tempts me to play the Traxler experiment 4...Lc5?!), 4.d4, or less sharp 4.d3.",
        "4... Nxe4": "This is the reason why 4.Nc3 isn't really good: black gains the initiative.",
        "5. Bxf7+": "On 5.Nxe4, black would reply with a fork 5...d5, so white decides to at least prevent black from castling.",
        "5... Kxf7 6. Nxe4 d5": "Controls the center with the tempo. My plan is to gain space and push white knights back to their ranks.",
        "7. Neg5+": "I was expecting 7.Ng3. After this check, white knight will end on a rim.",
        "7... Ke8": "I regretted this move later, 7...Kg8 was probably better. This leaves the black king in the center and puts it on a semi-open e-file. However, many times in the past, I've lost games that started similarly due to the sudden kingside attacks, so this time my personal experience trumped the common sense. Besides, I've thought that this move would mean easier future development for the rook. As it turned out, that rook served only one purpose till the end - to be captured by the white knight. :)",
        "8. h4": "I don't know whether this move was played to protect the knight or to start the kingside offense, but neither seems realistic to me. Fritz suggests 8.d4 h6 9.Nh3 Bxh3 10.gxh3 and evaluates this position as slightly better for the black.",
        "8... h6": "I stick to my \"gain space/chase knights back\" plan.",
        "9. Nh3 e4": "And yet again; white knight has to retreat to his starting point.",
        "10. Qe2": "Trying to pin down the pawn, but this complication could have ended bad for white.",
        "10... Qe7": "As a reply, I've played this move without too much thinking, missing the opportunity to play 10...Bg4, and the white knight falls after 11...Qe7.",
        "11. Nfg1": "The knight retreats to g1. I was quite happy with the opening: white is underdeveloped, his knight is on the edge of the board, black controls the center and has the space advantage.",
        "11... Qxh4": "Capturing the pawn was probably the best move, although I felt \"greedy\" after playing it.",
        "12. Qb5": "At this point, I regretted my earlier Ke8 move. White Queen is attacking the d5 pawn, pressuring b7 and pinning down the black knight.",
        "12... Qh5": "I wanted to defend my pawn, and didn't notice the possibility 12...Qg4 13.f4 Qxg2 14.Nf2 with the better position for black.",
        "13. Ne2": "A developing move. Fritz suggests 13.c4 instead, which increases pressure on d5.",
        "13... Qe5": "This was meant to prevent 14.Nd4 and to put the queen on a field safe from the white knight attack. However, the position is now evaluated as equal by Fritz. It suggests simply 13...Bd6 (and on 14.Nd4 Bd7 without the fear for b7 pawn) or 13...a6.",
        "14. d3": "A mistake. This move means that black will be able to pin down the white knight on e2. Fritz suggests 14.Nhf4 Bd7 15.Qxd5 (not 15.Nxd5 Nb4 16.Qxb7 Qxd5 17.Qxd5 Nxd5 and black is better) Qxd5 16.Nxd5 with the equalization.",
        "14... exd3": "Computer would attack the queen first: 14...a6 15.Qb3 exd3.",
        "15. Qxd3 Bf5": "An attempt to develop the bishop with the tempo.",
        "16. Qb3": "? I was expecting 16.Qb5 as that would keep the pin on knight.",
        "16... Rb8": "This was played after the long thinking. As soon as the pin was removed, I thought: 16...Nd4, but, of course, white would reply with 17.Qa4+. Then I thought about 16...Bb4+ and then, if 17.c3? Nd4!, but then I saw some variation which again loses material, and gave up (the computer analysis says that this would be the best move).\n\nThe next idea was 16...a6, to take away b5 field as a possibility for the white queen. I was willing to allow Qxb7 and even to sacrifice the rook to start the attack by Nd4. I believed I would have an edge in this variation (again, the computer says I was wrong).\n\nFortunately, I opted for 16...Rb8 as the more solid variation.",
        "17. Bf4": "For a moment, I thought that this move by white will make me a big trouble. But then I saw that black's attack is faster after 17...Qe4 18.Bxc7...",
        "17... Qe4": "...and I played this. I thought it's an excellent move, as it keeps the pin and attacks both c2 and g2.\n\nHowever, I took for granted that white will capture on c7. Fritz takes into account that white can play the best move available, and suggests 17...Qxe2+ 18.Ke2 Nd4+ 19.Kd1 Nxb3 20.axb3 a6, and black is better with +1 pawn, bishop pair and doubled white pawns.",
        "18. Bxc7": "An expected capture, but it's a mistake, as white ignores the defense, and this bishop will only die here.\n\nAccording to Fritz, white could equalize with 18.0-0-0 g5 19.Nc3 Qxc2 20.Qxc2 Bxc2 21.Kxc2 gxf4 22.Nxd5.",
        "18... Rc8": "Puts the rook under bishop protection, and attacks the black bishop. A logical move for me; the machine approves and even gives me an exclamation mark. :)\n\n18...Qxg2 is bad, as the tide turns after 19.0-0-0 Rc8 20.Rhe1!",
        "19. Qxb7": "Again ignores the defense. 19.Bf4 bishop escape is better.",
        "19... Nd4": "This is what I was waiting for! The previous move by white means he's not able to reply with Qa4+ anymore.",
        "20. Nhf4 Nxc2+": "I was also considering 20...g5, but decided that I shouldn't complicate the position. (And I was right, according to the computer, g5 is an inferior move.)",
        "21. Kd2": "The best move. 21.Kf1 would only make the job easier for the black knight.",
        "21... Bb4+": "I wanted to increase the pressure by bringing bishop into play. For some \"romantic\" reason, I was complicating the position. I could have won by simply playing 21...Nxa1 22.Qc6+ Bd7 23.Qg6+ Qxg6 24.Nxg6 Bb4+ etc.\n\nWhat I didn't see here is the danger black faces on the e-file if the white knight is removed from e2. Until now, this knight was pinned, and during the time the other knight was on h3 and king on e1, I was completely unaware of the white's possibility to castle. In that case, e2 knight would remain unprotected and I'd simply capture it with my queen - that was my calculation and it ended there, completely ignoring the following move by white - a skewer on e-file! (Correction: pin, not skewer, thanks haile1996.)\n\nPerhaps white oversaw that as well, as he didn't castle in the previous moves.",
        "22. Nc3": "I'm not seeing the danger on e-file...",
        "22... Nxa1": "??? a losing move. 22...Qd4+ would have won the game in a simple way.",
        "23. Qc6+": "??? but the white also misses 23.Re1 and the road to victory!\n\nAfter 23...Qxe1 24.Kxe1 the fight would still rage on, but white would surely have an advantage.\n\nUntil the end of the game, I didn't have a clue of what happened in these two moves. The post-game analysis was quite a shock. :)",
        "23... Bd7 24. Qg6+ Qxg6 25. Nxg6": "After the queen exchange, the position is simpler, and white has little to hope for.",
        "25... Rxc7": "And this solves the game.",
        "26. Nxh8 Bf5": "This traps the white knight. Fritz claims that immediate 26...d4 is better, but at this point, it doesn't really matter (hey, this even rhymes :D).",
        "27. Rxa1 d4 28. Re1+ Kf8 29. Ke2 Re7+ 30. Kd2 dxc3+ 31. bxc3 Bxc3+": "The final blow.",
        "32. Kxc3 Rxe1 33. Kd2 Re6 34. f3 Kg8 35. g4": "This can't save the white knight.",
        "35... Bh7": "And white resigned.\n\nThis was really a tactical game. As you saw, in these sharp positions, players of our level can ruin their own chances with a single move. It is said that the surest way to learn is from your own mistakes, but I hope that this annotation will also help some other players to avoid similar errors. :)"
    },
    "url": "https://gameknot.com/annotation.pl/pin-for-the-win?gm=48212",
    "gameName": "Pin for the win",
    "players": "otherguy (1513) vs. donjova (1576)",
    "opening": "Two knights defence (C55)"
}