{
    "moves": {
        "1. e4": "Hi everyone!\r\n\r\nAfter 9 successive losses I have finally managed to win a game.  In mitigation, most of the losses were against 2000+ oppo!  This victory came against my buddy dmaestro.  He seemed to have a slight edge in the middlegame but somehow, after a late tactical melee he ended up dropping the exchange as a result of a pin.  This game is another Latvian.  I kick off with the standard e4 and my opponent responds with the equally standard e5.  Another standard Nf3 follows and then ......",
        "1... e5 2. Nf3 f5": "2. ...... f5 - the Latvian.",
        "3. d4": "3. d4 - last time against Iceberge I responded with Nxe5.  I thought I would mix things up a bit with the d4 option which does have good results in the World DB.",
        "3... fxe4 4. Nxe5": "4. Nxe5 - pawn trade.",
        "4... Nf6 5. Bc4": "5. Bc4 - development + clears the way for 0-0.",
        "5... d5 6. Bb3 Be6 7. O-O Nbd7 8. Nxd7 Qxd7": "8. ....... Qxd7 - knight trade.",
        "9. Be3 Bd6 10. Nd2": "10. Nd2 - clears the decks.  A future plan is to play f3 and then put that knight on f3 after the resulting pawn trade on that square.",
        "10... c6 11. c4 Rd8 12. Bg5": "12. Bg5 - a pin, but this one is fairly harmless!",
        "12... O-O 13. cxd5 cxd5": "13. ........ cxd5 - pawn trade.",
        "14. f3 exf3 15. Nxf3": "15. Nxf3 - as planned - see my note for move 10.",
        "15... Be7 16. Bxf6 Bxf6 17. Ne5": "17. Ne5 - this knight could be exchanged resulting in each side having an isolani passer, mine on the e file, dmaestro's on the d file.",
        "17... Qd6 18. Qe2": "18. Qe2 - Glenda fulfils her usual role, defending my e5 horsie!",
        "18... Rde8 19. Rae1": "19. Rae1 - bolstering the defense of e5 as I notice a masked battery by white's lsb which screens off the rook on e8 - another attacker of e5.",
        "19... Qb6 20. Qd1": "20. Qd1 - after Qb6 pinning my d pawn it looks as though I am about to lose material.  However, things are not that simple as you will see!",
        "20... Bf7 21. Nxf7": "21. ...... Nxf7 - I might as well trade off that vulnerable e5 knight on my terms.",
        "21... Qxd4+": "21. ...... Qxd4+ - I expected Bxd4+.",
        "22. Qxd4 Bxd4+": "22. ....... Bxd4+ - queen trade.",
        "23. Kh1": "23. Kh1 - Henry's only legal move.  True I can play Rf2?? but I do not wish to drop the exchange if I can help it thank you!",
        "23... Rxe1 24. Rxe1": "24. Rxe1 - rook trade.",
        "24... Rxf7": "24. ..... Rxf7 - dmaestro thinks he has won back his piece and is a pawn up but ......",
        "25. Bxd5": "25. Bxd5 - with this move he has another think coming.  His rook is pinned and he will drop the exchange next move.  If he takes the pawn on b2 attempting to win back a pawn for the exchange then he will cop Old Matey on e8.  I woke up this morning to find that Dmaestro had waved the white flag - a pleasant awakening indeed!"
    },
    "url": "https://gameknot.com/annotation.pl/pindown?gm=23888",
    "gameName": "Pindown!",
    "players": "jstevens1 (1784) vs. dmaestro (1531)",
    "opening": "Latvian counter-gambit (C40)"
}