{
    "moves": {
        "1. e4": "e4. Centre opening - lets the Bishop and Queen out.",
        "1... c5": "c5. The Sicilian Defense, which is one of the most commonly played openings in the world.",
        "2. Nf3": "Nf3. The normal line of the Sicilian.",
        "2... e6": "e6, deviating from the main line. This is supposed to strengthen d5 and also let the Bishop and Queen come out when needed.",
        "3. d4": "d4, letting the dark-squared Bishop come out and also not blocking in the light squared Bishop.",
        "3... cxd4": "Exchange of the pawns, letting White have a N on d4.",
        "4. Nxd4": "Recapture.",
        "4... Nc6": "Developing a Knight. If NxN, White will have swapped off the only developed piece and after bxN Black can push into the centre with d5 and develop quickly on the queenside.",
        "5. Nc3": "Defending the e pawn and developing a piece.",
        "5... a6": "Protects against N or B to b5.",
        "6. Be3": "Defending the Knight and developing a piece.",
        "6... d5": "An attempt to go through the middle with an attack.",
        "7. exd5": "Swaps off the pawn, as I preferred this line to not taking the pawn: for example ...dxe4 Nxe4 leaves two knights in the centre easily attacked.",
        "7... exd5": "Recaptures.",
        "8. Be2": "Develops the Bishop - ready to castle. Notice Black has one piece developed and White has 4.",
        "8... Be6": "Black now has 2 pieces developed. Both people carry on developing in the next few moves.",
        "9. O-O Nf6 10. Re1 Bb4 11. Nxc6": "Nxc6 lets the B come back to defend the N; if this move is not played first the Knight on d4 drops.",
        "11... bxc6 12. Bd2 c5 13. a3 Bxc3 14. Bxc3 d4 15. Bd2": "In this position Black is more forward and has his pieces developed well - White has the slight advantage in development due to the Rook on e1.",
        "15... O-O 16. Bf3": "The Bishop is now on a better diagonal; the Rook is on a better file.",
        "16... Rb8": "So Black does not lose a tempo.",
        "17. b3 Qc7": "Qc7 - this seems not to do much; it attacks the h2 square but now the Q and R are in a diagonal line...",
        "18. Qc1": "Threatens Bf4.",
        "18... Ng4": "Threatening h2, but White can now swap off...",
        "19. Bxg4 Bxg4 20. Bf4": "...so he can get the pin.",
        "20... Qc6": "Moves the Queen to a safe place.",
        "21. Bxb8 Rxb8 22. Qf4": "Forking the Rook and Bishop, meaning Black has to move his Queen back.",
        "22... Qc8 23. Re5": "White takes the initiative, threatening Rxc5, winning a pawn (if QxR, QxR , Qf8 Qf8 and Whte will win).",
        "23... Be6 24. Rxc5": "Threatening the Queen, and winning a pawn.",
        "24... Qd8": "Black does not want to swap off - he is losing and tries to keep his pieces on the board.",
        "25. h3": "Prevents mate. Black should do the same; many of the tricks are to do with mate.",
        "25... Qb6": "Does not threaten anything; QxR QxR Qf8 and White will win.",
        "26. Rd1 Rd8": "The Rook is finally threatened...",
        "27. Rxd4": "White does not bother to defend it! Another pawn is won. If Black takes the Rook on c5, RxR  Qf8 Rxf8  Kxf8 and White is up by a long way.\r\n",
        "27... Rxd4 28. Qxd4 h6": "Thinks the threats are over...",
        "29. Rc8+": "Rc8 ! The discovered attack on the Queen makes Black resign."
    },
    "url": "https://gameknot.com/annotation.pl/pins-back-rankers-and-poisoned-rooks?gm=8553",
    "gameName": "Pins, Back Rankers and Poisoned Rooks",
    "players": "casmith_789 (1690) vs. bobgazais (1525)",
    "opening": "Sicilian (B46), Taimanov variation"
}