{
    "moves": {
        "1. e3 e5 2. c4 Nf6": "2. ..... Nf6 - normal development here.",
        "3. Nc3 Nc6 4. a3 g6 5. d3 Bg7": "5. ..... Bg7 - I decided to develop Fou Lenoir on the long diagonal.  I am ahead of the game as far as pieces on the back deck are concerned and am ready to put Henry away on the kingside.",
        "6. b4": "6. b4 - pawn roll.  This type of play is very reminiscent of my buddy, The Dentist (aka Tofuman).  He really just lurved to roll those pawns!  I must be alert and counter in the centre.  Moving up my d pawn two squares opens up the c8-h3 diagonal for Fou Leblanc.",
        "6... d5 7. d4 exd4 8. exd4": "8. exd4 - pawn trade.",
        "8... O-O 9. c5 Re8+": "9. ...... Re8+ - I thought I would try and catch the enemy king in the centre.  Pity my rook on e8 does not have much back up at the mo.",
        "10. Be2 Ne4 11. Nxe4 Rxe4": "11. ...... Rxe4 - knight trade.  I am trying a pile up on the e column and to perhaps take advantage of the uncastled white king to try and either get a checkmate or material gain.",
        "12. Be3 Bxd4 13. Bxd4 Rxd4": "13. ...... Rxd4 - weeel, I have netted a pawn, but I really must be careful not to get my rook trapped.",
        "14. Qc2 Bf5": "14. .... Bf5 - I keep the pressure on by developing a threat - on the Wicked Witch of the West!",
        "15. Qc3 Qf6": "15. ..... Qf6 - threatening a discovery on the Witch by Re1+.  However, both Glenda and the Witch are undefended so I must still be careful here.",
        "16. Rc1 Re8": "16. .... Re8 - at first sight this move seemed to be a terrible blunder as I thought I would blow the exchange.  However, I did find a resource that enabled me to still maintain a material plus which turned out to be decisive.",
        "17. Nf3 Bd3": "17. .... Bd3! - this is the counter-pin.  Fou Leblanc piles up on the white lsb which is pinned to the WK.  I let the white knight take my rook because, as in my previous note, it will result in a decisive material advantage for yours truly.",
        "18. Nxd4 Qxd4 19. O-O": "19. 0-0 - Delta castles but now I bring myself back in the lead material wise by firstly initiating a queen trade on c3.",
        "19... Qxc3 20. Rxc3 Bxe2": "20. ....... Bxe2 - now this is what I have been waiting for.",
        "21. Re1": "21. Re1 - as predicted but I set up a conditional move which put Henry on f8 to defend my rook to enable Fou Leblanc to escape the pin on the e8 rook next turn.",
        "21... Kf8 22. Re3 Rxe3 23. fxe3": "23. fxe3 - rook trade.  As you can see, I have two pieces and a pawn for a rook - this will certainly be a telling advantage in this game.  Those queenside pawns still look secure, don't you think?",
        "23... Bd3 24. Rd1 Be4": "24. ..... Be4 - well, maybe, but first I must find a decent anchor point for Fou Leblanc.  I do, on the pawn on d5.  As there are no pawns on the d or f columns, Fou Leblanc can sit quite comfortably while my knight's destructive tour de force is about to begin.",
        "25. Kf2 Ne5": "25. .... Ne5 - and here he comes, already threatening Ng4+ winning another pawn.",
        "26. h3": "26. h3 - stops this threat, but my rampant steed finds another.",
        "26... Nc4 27. a4": "27. a4 - nacht.",
        "27... Nb2": "27. ..... Nb2 - fork.",
        "28. Ra1": "28. Ra1 - nacht again but here comes another fork!",
        "28... Nd3+ 29. Kg3 Nxb4": "29. ..... Nxb4 - those queenside pawns that I had been talking about in my notes a few moves back are certainly not secure.  In fact they are totally shattered.  Delta also feels well and truly shattered and waves the white flag at this point and my rating goes back into the 1780s.  Now, all I need are a few more of these results to get me around that precious Class A watermark."
    },
    "url": "https://gameknot.com/annotation.pl/pins-and-counter-pins?gm=39494",
    "gameName": "Pins and Counter-Pins!",
    "players": "delta38 (1695) vs. jstevens1 (1795)",
    "opening": "Amsterdam attack (A00)"
}