{
    "moves": {
        "1. d4 d5 2. c4 dxc4 3. Nf3": "Queen's Gambit, Accepted. I don't think I've played this opening in at least two decades...",
        "3... Nc6 4. e4": "Trying for a strong center presence.",
        "4... Nf6 5. Nc3 Bg4 6. Be3": "Gotta keep up the defenses on the d4 pawn. I also considered 6. d5 but then I thought black would just go with 6. ... Ne5 for more pressure on my knight at f3.",
        "6... Bxf3 7. gxf3": "7. Qxf3 would prevent the doubled pawns, but it would lose my pawn at d4.",
        "7... e6 8. Bxc4": "Finally I get back my gambit pawn, with a stronger center and greater development, although I'm not fond of the double pawns on the f-file or the isolated h pawn.",
        "8... Bb4 9. Qb3": "I was hoping for 9. ... Bxc3  so I could play 10. Pxc3 and put a pawn on defense of my d4 pawn, and also creating a threat at b7.",
        "9... b6 10. Bb5": "Black evidently wanted to prevent that pressure on b7. But 9. ... b6? costs him a piece. Now he's on pins and needles...",
        "10... Bxc3+ 11. Qxc3": "I had wanted to play Pxc3 but I feared I would lose my advantage on c6. I think, however, that after 11. Pxc3 black has no way to save his knight. 11. ... Qd7, 12. Qa4 and the knight still falls. 11. ... Qd6, 12 Qa4 Kd7, 13 e5 wins a different piece, although I think this line would have been best for black since he would then play 13. ... Qd5 threatening my pawn on f3 and then my rook on h1, which might almost force me to liquidate with 14. Bxc3  and after all the exchanges, I would be only up a knight for a pawn, with isolated pawns on d4, f3, f2, and h2. So after all that, I decided to just double up my assault on c6.",
        "11... Qd6 12. Qxc6+": "Here I overlooked 12. ... Ke7 which saves black's rook and only lets me gain a piece (the knight I just took). AFter 13. Qxd6 pxd6 my attack is finished and I am only a knight ahead. Not 13. ... Kxd6? because of 14. e5 . My correct sequence would have been 12. Bxc6  K~, 13. Bxa8 Rxa8 leaving me up a rook instead of just a knight.",
        "12... Qxc6 13. Bxc6+": "But black missed his better continuation and traded queens, allowing me to capture his rook after all. After the game he confessed to me that he didn't know he could not castle out of check - he had planned on castling queen-side to save both king and rook.",
        "13... Ke7 14. Bxa8 Rxa8 15. Bg5": "To liquidate pieces, of course. And to open a file, if black will let me.",
        "15... h6 16. Bxf6+ gxf6 17. Rg1": "Taking the open file. The threat is Rg7 and Rh7 and Rxh6, creating a passed pawn for white. Black could immediately defend by Kf8 to defend g7, but then white can castle, then double the rooks on the g-file at which time the king becomes inadequate defense. Or black can defend by getting his rook to h8 before white gets to h7, but this ties his only rook to tedious defense.",
        "17... Rd8 18. O-O-O": "Defends the pawn at d4 and prepares to double rooks on the g-file, though that means bringing my king up to c3 for pawn defense.",
        "18... a5 19. Rg7": "After this move, black decided he had had enough."
    },
    "url": "https://gameknot.com/annotation.pl/pins-and-needles?gm=20918",
    "gameName": "Pins and Needles",
    "players": "blake84120 (1442) vs. remohgramps (1117)",
    "opening": "QGA (D21), 3.Nf3"
}