{
    "moves": {
        "1. d4": "I had noticed that my opponent was fond of playing Colle/CZ types of setups. They can be quite powerful if White is able to carry out his plan of development, so it was in Black's best interest to disturb the game immediately.",
        "1... Nf6": "The ever flexible and dependable.",
        "2. Nf3": "Intended either as part of a development scheme that does not include c4 or a simple postponement thereof (to avoid certain variations).",
        "2... e6": "A simple development move - giving my opponent the chance to play a traditionally proper opening with c4, but with an insidious plan against e3.",
        "3. e3": "A move to develop the typical scheme of 4.Bd3, and then either c3 or Nbd2 with a queenside fianchetto eyeing a possible e4 advance.",
        "3... c5": "An immediate attempt the disturb the development scheme. If 4.dxc5 then 4... Bxd5 and Black has a great position.",
        "4. Bd3": "White continues with his development plan, where Black typically has a choice between d5 or b6.",
        "4... cxd4": "Undermining the center and intended development scheme - White will no longer be in familiar waters while Black will have an easy scheme of development. The plan will revolve around Be7, O-O, a queenside fianchetto, knight on either c6/d7 and fighting up the semi-open c-file.",
        "5. exd4 Be7": "The only square that makes sense for the bishop, which helps to support the central pawn mass and knight.",
        "6. O-O O-O 7. Qe2": "c4 would have been stronger to fight for the center.",
        "7... b6": "Nc6 was probably also fine, but it's clear where the bishop belongs, but not so the knight.",
        "8. Nbd2 Bb7 9. Ne4": "White looks to increase the tension between the pieces. By initiating the exchange, Black is able to gain a tempi on the queen.",
        "9... Nxe4 10. Bxe4 Bxe4 11. Qxe4": "The Queen is now able to be kicked with d5.",
        "11... Nc6": "But first to complete developing the minors.",
        "12. Bf4": "A strong square for the bishop to gain a stranglehold on e5 (and c7...)",
        "12... d5 13. Qe2 Rc8": "The c-file is half open, and a good file to fight through onto the queenside.",
        "14. c3": "White looks to close the file - the only way to open is with b5->b4 if the c-pawn can be fixed.",
        "14... Bd6": "To double rooks on the c-file, the bishops need to be exchanged to gain c7. This has the added benefit of developing the queen.",
        "15. Bxd6 Qxd6 16. Rfe1": "White looks to control his semi-open file.",
        "16... Rc7 17. Qd3 h6": "It's necessary to prevent any antics planned around Ng5",
        "18. Re3 Na5": "A knight on the rim...",
        "19. Rae1 Nc4": "... is probably in transit to a strong outpost. Not only does the outposted knight harry the opponent being on the 4th (and gaining on the rook as evidence), but this fixes the c-pawn to be undermined.",
        "20. Re3e2 Rfc8": "The rooks are doubled, the c-pawn fixed - it's now time to advance the b-pawn.",
        "21. Ne5": "Looking to exchange the aggressor knight. Note: 21.b3 is met with Na3 22.Rc1 (since the pawn is weak) b5 23.b4 a5",
        "21... b5 22. Qf3": "I think perhaps knight takes knight it may have been stronger and resulted in a more drawish position. 22.a3 intending to meet b4 can be countered with a5 for support.",
        "22... b4 23. cxb4 Nxe5": "Exchanging knights first prevents Nd3 after the Queen recaptures and the exchange creates a passed d-pawn and cedes some control over the c-file.",
        "24. dxe5 Qxb4 25. a3 Qd4": "Keeping the queen centrally active to hit a lot of squares",
        "26. g3 Rc7c1 27. Kg2": "And white resigned here...  he would have ended up a pawn down (b2) and at a positional disadvantage."
    },
    "url": "https://gameknot.com/annotation.pl/planning-pays-off?gm=47366",
    "gameName": "Planning pays off...",
    "players": "N.N. (1680) vs. tisamon (1736)",
    "opening": "Queen's pawn (A46), Yusupov-Rubinstein system"
}