{
    "moves": {
        "1. e4 c5 2. Nf3 g6 3. d4 cxd4 4. Nxd4 Nc6 5. c4 Bg7 6. Be3 Nf6 7. Nc3 Ng4 8. Qxg4 Nxd4 9. Qd1 Ne6": "This is where the action starts in this variation. Black's plan is to play on the dark squares and generate counter-play on the Q-side.",
        "10. Rc1 Qa5 11. Qd2 b6 12. Bd3 Bb7 13. O-O d6 14. Qe2": "! Note how this opponent keeps the pawn on f2 until the black DSB is neutralized. White won't find an advantage trying to counter black's play, and instead takes advantage of his own control of the light squares.",
        "14... O-O 15. Nd5 Qxa2": "!?  Black decides to swap his e-pawn for the white a-pawn.  Black's plan is all about Q-side play, so passive defense of the e-pawn is out of the question.",
        "16. Nxe7+ Kh8 17. Rc2 Nd4": "Now white can either sac the exchange, or give up his dark-square bishop.",
        "18. Bxd4 Bxd4 19. Nd5": " I've got the bishop pair and dark-square control. White controls the light squares, and has an excellent N on d5. IMO, white has a slight edge here, but black should have excellent play ... if I can find the right continuation ...",
        "19... Bxd5": "? ... and this is not it! At the time, it seemed like a good idea to trade my bad bishop for the well-placed N, but I'm committing the same kind of positional blunder that my previous two opponents committed.  You'd think I would learn from their experience!  Now white has a free hand on the light-squares. Both ...Qa4 and ...Rc8 show more promise here.  Maybe in \"part 4\"?",
        "20. cxd5 Rac8 21. Rd2": "Not 21.Rfc1 Rxc2 22.Rxc2 Qa1+! the queens come off, and the endgame is dead equal. If 21.Rxc8? Rxc8, and white has issues with the b2 pawn.",
        "21... Rc7 22. g3": "White now plays to neutralize the black DSB",
        "22... Kg8 23. Bb5 Bg7 24. Kg2 Qa5 25. f4": "With most of his pieces on light squares, and the e5 square under control for the time being, white can now make the thematic f4 move. This opponent actually took the time to prepare f4.",
        "25... f5": "!? Objectively, probably not best, but black needs to mix things up and generate some play.  The other moves I considered were ...Qb4 (I didn't like the looks of Ra1), and ...Rc5 (couldn't find a good follow-up after Bc6).",
        "26. exf5": "Note that the natural-looking 26.e5 doesn't work: 26...dxe5 27.fxe5 Bxe5! winning a pawn (of course not 28.Qxe5? Qxd2).",
        "26... Rxf5 27. Qd3 Re7 28. Rc1": "! The rook is headed for c6. White doesn't allow himself to get distracted by the \"threat\" of ...Re4.",
        "28... Rf8": "I had been planning 28...Re4, but white can just ignore it with 29.Rc7! Rb4 30.Qe2, and black's got nothing.",
        "29. Rc6 Qb4 30. Re2 Rxe2+ 31. Qxe2 Qxb2": "Hoping to get some counter-play from the a + b pawns, but white's d-pawn turns out to just be too strong.\n",
        "32. Qxb2 Bxb2 33. Rxd6 Bd4 34. Kf3 Bc5 35. Rc6 Ra8": "Not 35...Re8? (looking to get the R behind the d-pawn) 36.Rxc5! wins on the spot.  I was still trying to get some play from the pawns, but there's no time. Objectively ...Rd8 seems to defend better, as it saves a tempo.",
        "36. d6 Kf8 37. d7 Rd8 38. Re6": "! Keeping the black king away from the pawn.  I considered resigning here, as white will just march the K down to c7, but decided to play a couple of more moves to see what happens.",
        "38... Be7 39. Ke4 a6": "Might as well push the pawns ...",
        "40. Bc6 b5 41. g4 b4 42. f5 Kf7": "The immediate threat was 43.f6",
        "43. Ba4 a5 44. Ke5": "Renewing the threat of f6.",
        "44... Bg5 45. f6 Bf4+ 46. Kd5 Bg5 47. Re8 Bxf6 48. Kd6 Kg7 49. Kc7 Rxd7+ 50. Kxd7 Kh6 51. Ra8": "Black can't defend the pawns, so black resigns.\n"
    },
    "url": "https://gameknot.com/annotation.pl/playing-against-the-maroczy-bind-part-3?gm=40832",
    "gameName": "Playing against the Maroczy bind, Part 3",
    "players": "devour (2462) vs. hityerclock (2231)",
    "opening": "Sicilian (B27), Hungarian variation"
}