{
    "moves": {
        "1. e4 d5 2. exd5 Nf6 3. Nc3 e6 4. dxe6 Bxe6 5. Nf3 c6 6. g3": "First move that deviated from the usual lines. It's interesting, I can use the pin on Nf3 and press on f2. But I was playing with fear, so I take the tempo to cover my Be6.",
        "6... h6": "In this opening, Ng5 threats NxBe6, leaving me with a very weak, isolated pawn, and I have to prevent it. This means to castle (queenside, of course, since I plan a pawn attack on the Kside), and very quickly, so to be able to play Bf5 in case of Ng4. All that, taking care of Nxf7. ",
        "7. Bg2 Qc7 8. O-O Nbd7": "If Re1, o-o-o, it is still possible for white to sac the exchange (RxBe6), and go on with a nice game. ",
        "9. d4 O-O-O 10. Bf4 Bd6": "More accurate can be Qa5, then g5, and then Bd6, taking control of the diagonal. ",
        "11. Bxd6 Qxd6": "The bad side of this exchange is that now I don't have anymore the Nc5 thrust, taking advantage of the pinned d pawn. Too bad. ",
        "12. a4": "Going after my castled K. ",
        "12... Bg4": "More accurate is g5, going for my own pawn storm. ",
        "13. h3 Bh5 14. g4": "The known sac of a piece for two pawns was tempting me, but hey, against a 1800... I had to play with care! If he allows it, he must be sure it isn't sound.",
        "14... Bg6 15. Nh4": "Well... it doesn't sound like a 1800 move, isn't it? Still, I am wondering why he doesn't play d5 at once, which is the move I have to fear. ",
        "15... Bh7 16. Re1 g5 17. Nf3": "Now I have to figure out how to play h5 without losing g5. ",
        "17... Rhe8": "...but again, I was playing with fear, so I preferred to offer a R's exchange and see what happens.",
        "18. Rxe8 Rxe8 19. a5": "What I am not seeing?",
        "19... a6 20. Rb1 Qb4": "My Q blocks his planned b4. Now he should play d5,",
        "21. Ra1": "Ok, he plans Ra4, and I have to be careful about where to put my Q. I thought that \"of course\" Qxb2 was bad, just opening columns for him to attack my castled K. As I said, \"playing with fear\", but it was sound. ",
        "21... Ne4": "If Ra4, NxN. If he doesn't go for the exchange, Ne2+ and I'll win the R. ",
        "22. Nxe4 Bxe4 23. c3 Qe7": "If Qc4, Nd2 and I lose my beloved lsb. Fear pays. ",
        "24. b4 f5": "Alea iacta est: counterattacking. ",
        "25. gxf5 Bxf5 26. Kh2": "? I expected some pawn advance on the Qside.",
        "26... g4 27. hxg4 Bxg4": "...can't be so easy. What am I missing?",
        "28. Qd3 Bxf3 29. Qxf3 Qh4+ 30. Qh3 Qxf2": "If Qxh6, Qb2.",
        "31. Rf1 Qe3 32. Qxe3 Rxe3 33. Rf3 Re2 34. Kg3 Kd8 35. Bh3 Ke7": "My K controls the f column, unles...",
        "36. Bxd7 Kxd7 37. Rf2 Re3+ 38. Rf3 Re6 39. Rf7+ Kc8 40. Rf8+ Kc7": "I am glad with a draw (again a 1800).",
        "41. Rf3 Rd6 42. Kh4 b6": "It seems a bad choice, and it is: Now, Rf2+, Rd7, RxR, KxR, axb6 and I am lost. My K doesn't have time to take on b6 before it is defended by the c pawn. ",
        "43. axb6+": "? Even if my pawns get splitted, this gives life to my K as an active piece. ",
        "43... Kxb6 44. Kh5 a5 45. bxa5+ Kxa5": "Draw is assured. If Rf5+, Ka4 and I'll threaten his pawns from the back. He has to exchange R in order to take my h pawn, and this will give me time to grab his pawns. ",
        "46. Rg3 Kb5 47. Rg6 Rxg6 48. Kxg6 Kc4": "Now I am even winning!",
        "49. Kxh6 Kxc3 50. Kg5 Kxd4 51. Kf4 Kd3 52. Kf3 c5 53. Kf2 Kd2 54. Kf1 c4": "He resigned here. 1800? No. It was his first game, his rating was only temporary. But playing \"as he was a 1800\" paid, even with my usual blunders. Thanks for reading and commenting!"
    },
    "url": "https://gameknot.com/annotation.pl/playing-with-fear-pays?gm=64596",
    "gameName": "Playing with fear... pays!",
    "players": "Sajib_human_being (1577) vs. damafi (1636)",
    "opening": "Scandinavian defence (B01)"
}