{
    "moves": {
        "1. e4 c5": "Every time I play this move against 1. e4 I imagine a boxer dodging a direct jab and countering with a right hook, staggering his opponent. On a more serious note, this move is probably responsible for the lower statistical rating of 1. e4 as opposed to 1. d4. ",
        "2. Nf3 Nc6": "So far I have a very good rating with this line, the positions are much more dynamic than after 2...d6 and the initiative can shift much quicker to Black.",
        "3. d4": "The Rossolimo line with 3. Bb5 scores better in databases and probably with good reason. White can keep a pleasant initiative and can construct a stable pawn centre.",
        "3... cxd4 4. Nxd4 Nf6 5. Nc3 e5 6. Ndb5 d6 7. Nd5": "The only serious alternative to 7. Bg5",
        "7... Nxd5": "Forced, there was no way to defend c7",
        "8. exd5": "Taking with the Queen is pointless as that would only ease Black's task in pushing d5 and gaining the initiative.",
        "8... Nb8": "The best retreat. On e7, it would just tangle up pieces and it wouldn't have a good place to go.",
        "9. c4": "White has several plans in this position. The one played is the most popular, but the others are just as playable. Other alternatives involve playing with a4, going for piece play rather than pawn attacks, and in case Black plays a6, squeezing the Q-side with a5. Another plan is with f4, stabilizing and blocking Black's central pawns.",
        "9... Be7": "The most elastic move. Black's plan is to castle and play f5, usually in that order.",
        "10. Bd3": "This signals that White isn't going for the f4 plan, which would simply lose a tempo since an e4 pawn push would hit the Bd3 and instead wants to keep the lines open for his pieces and try to make use of the absence of a Knight on the K-side and attack there.",
        "10... a6": "Black is well-advised to wait with this move since playing it at a wrong time can just create entry points on the dark squares on the Q-side. Since White has played such a brazen Bishop move, I was more relaxed about his intentions.",
        "11. Nc3": "There are some lines in which the Knight goes to a3, but that is connected to an early c5 push, clearing c4 for the Knight, pressurizing the Q-side.",
        "11... O-O 12. O-O f5": "The best plan for Black in these structures. White usually tries to go for a c5 push, creating a passed d-pawn.",
        "13. Qh5": "A rather adventurous plan. The theoretical move is f3, trying to contain the mobile Black pawn centre.",
        "13... e4": "The Bishop gets a blow to the head and is given a standing count by the referee.",
        "14. Be2 Nd7": "Now it's time to start developing.",
        "15. Bf4": "White develops his last piece and takes control of e5.",
        "15... Ne5": "The tempting 15...Nf6 just gives White time to send the White Queen to greener pastures via h3.",
        "16. Qh3": "White probably should have exchanged on e5 here and his position would have been pretty good.",
        "16... Bf6": "Now the Knight is stabilized and it's time to start play on the other side of the board.",
        "17. Rae1": "White obviously still wants to get the attack going at all costs.",
        "17... Bd7": "Getting the last piece out and planning b5, opening lines on the Q-side. With White's pieces oriented on the K-side, it's pretty hard to start active operations there without allowing the White pieces to come to life. Instead, keeping a more flexible state of mind can make sure you don't misjudge the position and can find the most adequate plan.",
        "18. b3": "This seems like a mistake. White secures the c4 pawn at the expense of weakening the long diagonal.",
        "18... b5": "Now b5 gains in force as it has a fiendish tactical coup that my opponent missed.",
        "19. cxb5 axb5 20. Bxb5": "White gobbles up the pawn, thinking it was a free lunch.",
        "20... Ng6": "The first part of the check. The Bf4 is lose and the diagonal is cleared with tempo and suddenly the Nc3 is overcharged.",
        "21. Bc1": "White again miscalculated. Better was 21. Bxd7 and after 21...Nxf4 22. Be6+ (an important move to save the Bishop) Kh8 23. Qe3 Bxc3 24. Qxc3 Rxa2, although I'm still better, it's not by much.",
        "21... Bxc3": "Now I win an exchange and get a very active Knight.",
        "22. Bxd7 Bxe1 23. Be6+ Kh8 24. Rxe1 Rxa2": "The forced moves are over White's Bishop pair is hardly working. The b-pawn is rather weak and pretty soon the White King will have problems. White tried to put up a good fight, but there wasn't anything that could cause serious problems.",
        "25. Rf1": "White sees that once a Knight lands on d3, f2 will need protection and takes steps accordingly. He also wants to take on f5 without fear of Qf6.",
        "25... Qf6": "Protecting f5 and taking control of the long diagonal.",
        "26. b4": "A desperado advance but it's hard to suggest anything constructive for White.",
        "26... Ne5": "Eyeing the sweet d3 square.",
        "27. Qg3": "Intending to play Bg5 and try to put the Bishop pair to use.",
        "27... f4": "Not right now, thanks. I think I'll kick your Queen around some more.",
        "28. Qb3 Rfa8": "Connecting the Rooks. Every Black piece is active, I have a mobile pawn phalanx and I'm up an exchange. Life sure can be sweet sometimes.",
        "29. Qh3": "Trying to be consistent with 29. b5 doesn't promise anything after 29...Nd3 30. b6 Nxc1 31. Rxc1 Ra1 32. Rd1 Qb2 33. b7 Qxb3 34. bxa8Q+ Rxa8 and I'm up a Queen for Bishop.",
        "29... g6": "Getting rid of back rank mate threats and limiting the Be6.",
        "30. Bd7": "With the idea of Qe6. My Queen is far more dangerous than White's, so it makes a lot of sense to try and swap them.",
        "30... Nd3": "An advanced Knight can be a very dangerous piece. This Knight hits the Bc1, the b4 and f2 pawns and it covers f2. ",
        "31. Qe6": "Offering the intended Queen trade.",
        "31... Qd4": "Accepting the Queen exchange would have prolonged White's resistance.",
        "32. Bc8": "Intending Qe8+ with a hopeful perpetual.",
        "32... Ra2a7": "Covering the seventh rank. The Bc8 is now a goner.",
        "33. g3": "Attacking the f4 pawn in order to develop the Bc1 and making a breather for the King. The downside is that now I can win the Bc8.",
        "33... Rc7 34. Bxf4 Nxf4 35. gxf4 Raxc8": "More material is exchanged but White's position hasn't got any easier.",
        "36. Qxd6 e3": "Dismantling the White castle.",
        "37. Qe6 Rc7c3 38. d6": "38. fxe3 loses to Rxe3! 39. Qxc8+ Re8+, winning back the Rook with a lot of interest.",
        "38... Qxf4 39. fxe3 Qg5+ 40. Kh1 Rc3c1 41. Qf7 Rxf1+ 42. Qxf1 Qxe3": "White didn't bother playing anymore since after 43. d7 Qe4+ 44. Kg1 Qd4+ wins the d-pawn and after that it would be pointless to continue."
    },
    "url": "https://gameknot.com/annotation.pl/playing-on-the-whole-board?gm=31268",
    "gameName": "Playing on the whole board",
    "players": "alcol1960 (2180) vs. nyctalop (2081)",
    "opening": "Sicilian (B33), Pelikan, Bird variation"
}