{
    "moves": {
        "1. e4": "hey hey all. i wanted to save this game because it is short and sweet. it is the story of the 2nd match against the host of a mini tournament i am in.",
        "1... e5": "currently im happy with my result in the tournament. its given me a nice annotation against the leader of the tournament and im placed second.  i can still win but i left my victory in the hands of the current leader. Where he has to lose his last two games and i must win my final 1 to win.  if he loses 1 and wins 1 we tie etc..",
        "2. Bc4": "A little back story before this game which may make it more enjoyable as you read.  this is my second mini tournament on game knot where i won the first. and i was able to pull a game like this in each tournment.",
        "2... Nf6": "this opponent lost to me in game 1 where i sacrificed all my material to leave him a knight up but have a fast passed pawn and successfully got him to promotion for the win.",
        "3. d3": "so my plan this game was to look for an even faster pawn race from the get go, and just see what develops as i assumed my opponent was not well accustomed to defending a fast racing pawn.  ",
        "3... c6": "opponent adopts a defensive development.  ",
        "4. a3": "i open this up in case he comes down with b5 instead of d5.  i was really hoping he was going to go d5",
        "4... d5": "yay!",
        "5. exd5": "exchange",
        "5... cxd5 6. Bb5+": "check! more often then not black players will block with their LSB to get an easy trade off of LSB's maybe it is wiser to block with the knight in this instance with the hopes to reinforce the d5 pawn with the b7 pawn if white decides to trade his lsb for a knight.",
        "6... Bd7": "as for me its what i wanted. but ill let him do the trade!",
        "7. c4": "theres my racing pawn! muahaha",
        "7... Bxb5": "exchanges right away to conserve his middle. maybe exchanging the d pawn out first might be better for black opening more views to the white king",
        "8. cxb5": "and so recapture",
        "8... Qa5+": "tries to get the pawn immediately",
        "9. Nc3": "the knight protects the pawn while being pinned",
        "9... d4": "exploits the pin",
        "10. Qa4": "but now its queens off to make a pawn race easier!",
        "10... Qxa4": "and he accepts",
        "11. Nxa4": "now the knight is set up to defend the pawn for when he is allowed access to the b6 square",
        "11... Nbd7 12. Ne2": "more development towards my pawn and head towards a castle option",
        "12... a6": "gives my pawn access to the b6 square!",
        "13. b6": "ill take it! 2 steps away now!",
        "13... Rc8": "preparing pressure for the pawn and also taking control of the open file probably one of his best current replies",
        "14. Bd2": "develop DSB to go help defend the pawn",
        "14... Rc6": "forseen pawn pressure",
        "15. Ba5 Bc5": "develops bishop so ill take his DSB off for a knight",
        "16. Nxc5 Rxc5": "recaptures, buys me a move to muster some form of confusion for him. im wearing out of b6 defenders. but now i see a cruel skewer appear after he castles",
        "17. b4": "defend bishop push the rook around",
        "17... Rb5": "i think this was a mistake for my opponent, i think his effort was to prevent my pawn from coming up to b5 but this invites a4 to gain time on the rook again",
        "18. a4 Rd5 19. Rc1": "so now i can take control of the open file and it sets up a deadly check attack",
        "19... O-O": "defends with his castle",
        "20. O-O": "so i castle also to be safe. ",
        "20... Rd6": "reapplies pressure to b6 and that skewer is right there!",
        "21. b5": "prepare the skewer.  i wonder here what his best option was.  im petty sure taking one of my pawns should be it. as in axb5 or nxb6.",
        "21... Nd5": "but he decides to apply triple pressure to the pawn and this temporarily defends against the skewer",
        "22. bxa6": "so natural response, i thought, to also open the way to the b pawn or the a pawn now becomes the racer.",
        "22... Nd5xb6": "i believe n7xb6 was better to not have the skewer unprotected.",
        "23. Bb4": "and so im able to get it",
        "23... Rd5": "moves 1 rook aside",
        "24. Bxf8": "i still grab it. if he takes my pawn i save my DSB if not hes in big trouble considering my rook and the fact i follow through with axb7",
        "24... Kxf8 25. axb7 Nb8": "i think this was mistimed by him overlooking a bit of finesse in the rook sacrifice. i was thinking it was going to play out 25 ...nbxa4 26 Rc8+ Ke7 27 b8=Q ndxb8 28 Rbx8  costing me the pawn for the knight and being in a good position to end it.",
        "26. Rc8+": "and so opponent resigns.  i hope you all enjoyed this game i love pawn racing games hehe."
    },
    "url": "https://gameknot.com/annotation.pl/pleasant-pass-time-passing-pawns?gm=59323",
    "gameName": "pleasant pass-time, passing pawns!",
    "players": "trixstermtl (1516) vs. tokkiet (1508)",
    "opening": "Bishop's opening (C24), Berlin defence"
}