{
    "moves": {
        "1. d4 d5 2. Bf4 Nf6 3. Nf3 Nc6 4. Nbd2 h6 5. h3 Bf5 6. c3": "All normal stuff. Just note: if I don't play this move now, in the near future Nb5 by black can annoy me a lot, given the threats on c7 and d6. True, white can defend with Qa5+, forcing the N back, but after e6 or Qd7 this doesn't work anymore.",
        "6... e6 7. g4 Bh7": "Black, normally retreats on g6, making Ne5 a good move. Even better if I play something like Qa4 first, pinning the Nc6. But now, I wanted to experiment. ",
        "8. g5": "?! If Nh5, Be3. It blocks my central pawn, but I have Bh2, followed by a tempo when moving the e pawn. ",
        "8... hxg5 9. Bxg5": "This B can't be harassed anymore by h6. I thought on Nxg5, but black's lsb can move away, and it seemed a bad idea to me. One of the central features of this opening is N's control on e5.",
        "9... Be7 10. h4": "\"cementing\" the B. But all this in unexplored territory for me, and I'm not sure it will work. ",
        "10... Ne4 11. Rg1": "This is the central idea. My h pawn will go to g5, so his R won't threat it. ",
        "11... Bxg5 12. Nxg5 Nxg5": "Here I played too quickly hxN, Maybe Rxg5 was better, with tempo on g7. ",
        "13. hxg5 Bg6 14. f4": "I am aware my kingside is completely exposed, but I thought the pawn chain was strong enough to prevent black's incursions. I was wrong. ",
        "14... Qd6 15. e3 O-O-O": "Ok, so I have a very strong pawn chain, but nothing more, and his lsb is really annoying. Under control, but still annoying. A possible attack plan was b4, but hey, I am very underdeveloped. ",
        "16. Nb3": "It looks as a bad move, but my N has a nice outpost in c5, and if b6, Ba6+ looks interesting. Moreover, I can now play Bd3 so to exchange his lsb. If Bh5, I go Be2. Of course, black has countergame...",
        "16... Rh2": "Ouch! Ok, what is this R doing here?",
        "17. Nc5": "This has two purposes: the first, conquer my outpost, and, second and more important, allow my Q to go to b3-a4 in case of Bh5. Because I am now aware Be2 doesn't work anymore. ",
        "17... Rxb2": "A mistake! If Rd-h8, black would have probably won the game, but this just helps me to get open column b to his K. Now, I can get rid of his lsb. Please, come in... ;-)",
        "18. Bd3": "I threaten BxB, doubling and isolating his pawns. ",
        "18... Bxd3 19. Qxd3": "I have to be careful: if Nxd3, Qa3 and his pieces become unbearably active!",
        "19... g6 20. Rh1": "...Stopping any Rd-h8 ideas, and threatening Rh7, with pressure on f7.",
        "20... Rg2": "This R is well installed on the second rank, but its purpose is limited! Now, this makes me free to pressure on the b column.",
        "21. Rb1": "Threatening as a minimum a N fork on his Q and R. Na5 was the only way for black to escape his fate. I'd had a hard time. But he played the light...",
        "21... b6": "?? Incredible, I'm too lucky these days! \"White plays a move and black resigns\". Too easy.",
        "22. Qa6+": "Some more points over the 1600 barrier. Sometimes is the opponent who blunders a game. I am aware I can't expect this to go on for too long... Thanks for reading!"
    },
    "url": "https://gameknot.com/annotation.pl/please-come-in?gm=64492",
    "gameName": "Please, come in...",
    "players": "damafi (1618) vs. zyzoonleon (1621)",
    "opening": "Queen's pawn, Mason variation (D00)"
}