{
    "moves": {
        "1. e4": "Standard King Pawn opening.",
        "1... e5": "Kings pawn game (C20)",
        "2. Nf3": "Kings Knight Opening (C40)",
        "2... Nf6": "I recently started using this.  It is called the Petrov's Defense (C42)",
        "3. Nc3": "Now this is called the Petrov Three Knights Game  (C42)",
        "3... Nc6": "In my opinion it should now be called the Four Knights Game, but what do I know.  ",
        "4. Bb5": "White threatens the black knight.   We are still using the \"book\" according to GameKnot Analyzer.",
        "4... Nd4": "Black horse threatens white bishop.  Notice that Black leaves his e5 pawn unprotected, but seems to be unworried. We are still using the \"book\" according to GameKnot Analyzer.",
        "5. Ba4": "White bishop flees.  Black pawn is still in jeopardy. We are still using the \"book\" according to GameKnot Analyzer.",
        "5... Bc5": "Black develops a bishop and continues to ignore the extreme peril that his e5 pawn is in.  We are still using the \"book\" according to GameKnot Analyzer.",
        "6. O-O": "White castles. Don't know why he declined to take the black pawn here. ",
        "6... O-O": "Black castles and still remains completely unconcerned about that poor pawn on e5.",
        "7. Nxe5": "Finally white takes the pawn and black goes one point down with no apparent possibility of getting that point back ever again.",
        "7... d6": "Black shoos away the white horse and gives some support to the black Bishop.",
        "8. Nd3": "White horse runs away, but maybe that was the wrong direction to run.  It looks fine at this point but as the games progresses you will see that white is leaving his king out to dry with no protection.",
        "8... Bg4": "Black develops a Bishop and also acts as a pesky fly to annoy the white queen.",
        "9. Qe1": "The white queen gets herself out of trouble but maybe this was not a good way to do it.  Why did not white push the f pawn to f3? Oh I see.  Its because the threat of a \"discovered check\" if the black horse moves to take c2.",
        "9... Nf3+": "Black makes a bold sacrifice.  The black horse forks the white King and Queen so that the only possible response is for white to take the horse with his pawn.  This leaves the white King a little exposed to the elements, but black is bleeding away material and is fixing to go 3 points down.",
        "10. gxf3": "As expected white takes the black horse and black is now 4 points down.",
        "10... Bxf3": "Black gets one point back but remains a horse down.  In return the black bishop is in a good spot with no apparent way to be dislodged. ",
        "11. Nxc5": "White decides is time to swap.  Its usually a good idea when you are ahead on points to just start swapping. According to the GameKnot analyzer, this is where white makes his first \"Blunder.\"  ",
        "11... Ng4": "This is very surprising.  Black decides not to take the white horse.  Black is now 6 points down!  But black is now in a very threatening position and there is not much to protect the white king.",
        "12. Bd7": "White decides to threaten the black horse.  This seems to be a good idea on the surface.  White needs to defend the King.  According to the GameKnot analyzer, this is where white makes his second \"blunder.\"",
        "12... Qg5": "The black queen comes into action and puts even more pressure on the white King. Black hints at the idea that he could simply move the black horse and the white King would be in check.   Keep in mind that the white horse is ripe for the taking but black ignores the chance to get his points back.  What good are points?   We are going for the kill.",
        "13. d4": "So white threatens the black queen.",
        "13... Ne3+": "Black blocks the threat from the white bishop and also creates a \"discovered check.\"   The only move is for white to block the check with his Bishop but this won't stop the checkmate for long. White resigns!  So the moral to this story is: Throw caution to the wind.  Go for the throat. Sacrifice everything you have for the sake of glory.  Points mean nothing. Keep your eyes on the prize and you will bask in the light of Triumph!!!"
    },
    "url": "https://gameknot.com/annotation.pl/points-mean-nothing?gm=59620",
    "gameName": "Points mean nothing!",
    "players": "craftyfox (1673) vs. jutterback (1490)",
    "opening": "Petrov three knights game (C42)"
}