{
    "moves": {
        "1. d4": "I play this a lot - I play 1. d4 against players >1300 and 1. e4 against players <1300 as you may have seen against my previous annotations. ",
        "1... d5": "1. ... d5.",
        "2. e3": "e3 - rather seen with stronger players that don't mind blocking their DSB.",
        "2... Bf5": "My bishop surges into the game.",
        "3. Bd3": "This is a really annoying move - if Bxe3 then Qxd3 and white has developed more than I had, and if my bishop moves, then I lose a tempo - white's bishop is perfect on d3.",
        "3... Bxd3": "Not much of a choice, but I choose to exchange.",
        "4. Qxd3": "He takes with the queen - the best move to avoid doubled pawns.",
        "4... Nf6": "Knight surges into centre - I am preparing Ne4 perhaps.",
        "5. Qb5+": "Seeing this, this early queen check also forks the b-pawn.",
        "5... Nc6": "Though this develops a piece, I actually think that c6 would have been better and if Qxb7 then Nbd7.",
        "6. Qxb7": "He greedily nabs the pawn.",
        "6... Na5": "Probably not that great - I try to force him back.",
        "7. Qb5+": "Looking like a deadly queen fork - even when I looked at this, first-sight, a bead of sweat came towards me, but I can wriggle.",
        "7... c6": "The pawn blocks the check and the queen protects the knight - perfect!",
        "8. Qd3": "The queen heads home.",
        "8... e6": "Trying to give my DSB a path.",
        "9. Bd2": "Developing, and targeting my knight.",
        "9... Bd6": "I develop my bishop.",
        "10. Nh3": "Flanky knight - as I call it. It has two other perfectly fine squares to go to, so why not go to them?",
        "10... O-O 11. O-O": "Castling from both sides.",
        "11... Rb8": "My rook controls the half-open b-file.",
        "12. b3": "I don't see why this move was played.",
        "12... Re8": "I develop my other rook.",
        "13. f4": "My opponent is getting aggressive.",
        "13... Ne4": "Seeing that 14. f3 can no longer be played, I hop into the outpost of e4.",
        "14. Qa6": "Targeting my knight.",
        "14... Bb4": "Of course, I didn't like Nb7 as it looked rather odd - so I opted for an exchange of B's.",
        "15. Bxb4": "He accepts - well, there was nothing else to do, really.",
        "15... Rxb4": "I take back.",
        "16. a3": "Pawn v rook - my rook has no active square to go to.",
        "16... Rb8": "Not Rb6? as the knight would have been under attack.",
        "17. Qxa7": "?? This occurred previously in one of my annotations - Why not to go to Scandinavia 1. This is a truly poisoned pawn, though rather this is less crude than the one that occurred in the Scandinavian annotation. Not Rb7?! but ...",
        "17... Ra8": "Ra8! which traps the queen of the flight square a6 and leaves the queen with no good move. Let's sum up - it's rather pretty actually.\n\na6 and a5 is controlled by the a8-rook.\na8, b8, c7, d7 and e7 are controlled by the d8 queen.\nb7 is controlled by the a5 knight.\nc5 is controlled by the e4 knight.\n",
        "18. Qxa8": "The only move to gain the maximum material.",
        "18... Qxa8": "Who could resist such an offer?",
        "19. f5": "My opponent tries to open some lines against my king.",
        "19... e5": "Unfortunately not.",
        "20. Ng5": "?? What about Nxg5.",
        "20... Nxg5": "So I do so.",
        "21. f6": "Still trying to open lines - but as I did in my game vs tk29650 -",
        "21... g6": "I decline the offer.",
        "22. Nd2": "Developing and attacking the rooks.",
        "22... exd4": "Opening the e-file.",
        "23. exd4 Qc8": "Trying to centralize my queen.",
        "24. Rac1": "Developing still.",
        "24... Qg4": "And black resigns here, thinking that after Re2 or Nf4/h4 he is doomed. But, other than the poisoned pawn, well played jagroop52. And I hope you enjoyed the game to. @oodle3.\n\nEDIT (30/12/14): archduke_piccolo is right - white resigned, not black."
    },
    "url": "https://gameknot.com/annotation.pl/poisoned-pawns?gm=57353",
    "gameName": "Poisoned Pawns",
    "players": "jagroop52 (1275) vs. oodle3 (1200)",
    "opening": "Queen's pawn (D00), stonewall attack"
}