{
    "moves": {
        "1. e4": "Game one of  a two game match with a friend rated around 1500 in preparation for the 2012 Chicago Open, where we both played in the U1700 section.  My friend won around 1500$...",
        "1... Nf6": "He plays the Alekhine Defense",
        "2. e5 Nd5 3. d4 d6 4. c4 Nb6 5. exd6 cxd6": "In this structure, black should strive for an e5 break which he preps with g7 Bg7 Nc6 etc.  White hopes to maintain his space advantage in the center and press it forward to stifle black's play.",
        "6. Nc3 Nc6 7. Be3": "This set up is recommended by Lev Alburt and Roman Dzindzichashvili in their \"White Openings Explained: winning with 1.e4\"",
        "7... g6 8. Be2 Bg7 9. Nf3 Bf5 10. Nh4 Bd7 11. Nf3 Bf5": "I think O-O is more principled for black, I had sought to prove that the bishop is as useless on d7 as on c8 but this is simply untrue. My Nh4 idea should lose all advantage for white as it is a useless tempo tosser.",
        "12. O-O Nb4": "?!",
        "13. Rc1": "Part of white's desired set up is to play Rc1 anyway, so this is quite good.",
        "13... Rc8 14. b3": "Solidifying the QS and preparing to push forward with initiative.",
        "14... d5 15. a3": "The fallback of black's Nb4 idea",
        "15... Nc6 16. c5": "Gaining more space on the QS.  This also kicks the knight and threatens to win material.",
        "16... Nd7": "Jettisoning the d pawn, Na8 looks aweful, but slowly the black knight can hope to return to the battlefield via c7.  White still holds an edge there because of time and greater harmony in his camp.",
        "17. Nxd5 Nxc5": "?? Reckless play hoping for complications where white will go astray.  There are two main options for white.  My opponent said in PM that he hoped for de where he plays Bb2 but I demonstrated that this is still winning for white even if white decides to give the rook for bishop as white is left with two pieces for a rook and the bishop pair in that.   I opted for Rxc5 which I thought was easier to deal with (less calculation), objectively it is worse than the other line, but not much. ",
        "18. Rxc5 b6": "The idea",
        "19. Rxc6 Rxc6 20. Nxe7": "?! Bb5 right away was better",
        "20... Qxe7": "Kxe7 was interesting and I couldn't see a clear way to get at the king.  I thought after missing Kxe7 that I may be worse even after the Bb5 idea, but it turns out white is still better.",
        "21. Bb5 Bd7 22. Bxc6 Bxc6 23. d5": "And white is close to winning",
        "23... Bb5 24. Bg5": "! The start of a powerful combination that simplifies to an easily winning ending.",
        "24... Qxa3": "Greedy, but what else was there?",
        "25. Re1+ Kd7 26. Re7+ Qxe7": "Fairly forced. Other lines lead to the shedding of the f and a pawns of dangerous mating nets for the black king.",
        "27. Bxe7 Kxe7 28. Qe1+ Kd7 29. h3": "Creating luft",
        "29... h6": "? A pointless move.  This does not prevent the centralization of the knight, which will enter the game with great effect anyway.  In an ending where black is looking to fortress the position, time is of the essence.",
        "30. Qb4": "Tempo move.",
        "30... a6": "Probably best.",
        "31. Qf4": "The idea.  The WQ is now coordinating to get the knight in via e5 perhaps.  She is centralized and ready to probe for weaknesses in the black camp.  Black is absolutely lost here.  A few more errors from my opponent lead to the finish.",
        "31... f6 32. Qg4+ Ke7 33. Qxg6 Rg8 34. Qe4+ Kd8 35. Qe6": "Too many threats. 1-0"
    },
    "url": "https://gameknot.com/annotation.pl/pokemasters-match?gm=44794",
    "gameName": "PokeMasters Match",
    "players": "Ryan Murphy (13xx) vs. Siddharth Patel (14xx)",
    "opening": "Alekhine's defence (B03), exchange, Karpov variation"
}