{
    "moves": {
        "1. e4 c5": "Game #3 against Mr. Jabbawock. The first two were in a mini-tournament but this one is a direct challenge from him - he poked the bear. I'm playing black and we start off with the Sicilian.",
        "2. Nf3 d6 3. d4 Nf6": "This move avoids the Chekhover variation. I've been having some fun with it, bringing out the queen early as white, and I don't want to play black against it.",
        "4. Nc3 cxd4 5. Nxd4 a6": "Hi ho. Hi ho. It's the Najdwarf. Or something like that.",
        "6. Be3 e6": "The English Attack against the Najdorf. Pretty mainline stuff so far.",
        "7. f3 b5 8. g4 h6 9. Qd2 b4": "Six straight pawn moves. In fact, 8 of black's first 9 moves have been pawn moves.",
        "10. Na4 Nbd7 11. c4 bxc3 e.p.": "Eh, why not. I hardly ever get to say en passant...",
        "12. Qxc3 Bb7": "Prevents white from castling. 13. 0-0-0?? is met by 13. ... Rc8 skewering white's queen to his king. Castling kingside is, obviously, inadvisable.",
        "13. Bd3 d5": "If for no other reason than lately I've moved too many pieces. I need to get back on track with pawn moves.",
        "14. Nc6 Qc8 15. Na5 dxe4": "Time for a little exchange combo from which black should emerge quite nicely.",
        "16. Qxc8+ Rxc8": "The ladies were just getting in the way.",
        "17. fxe4 Bxe4": "Gaining a pawn and forking white's bishop and rook. White's reply isn't exactly forced. If 18. Bxe4 then 18. ... Nxe4 leaves black ahead by a pawn. But that little lonely black pawn over there on a6 looks almost too tempting to leave it alone...",
        "18. Bxa6 Ra8": "White regained the pawn deficit, creating two passed pawns for himself in the process. But black's rook responds by moving out of danger, with threats, and white's rook at h1 is still en prise. Further, white has no direct moves with knights or bishops that threaten black in any way because black's knight and bishop cover all the good white moves. White must lose material. Instead, he resigns."
    },
    "url": "https://gameknot.com/annotation.pl/poking-the-bear?gm=23555",
    "gameName": "Poking the Bear",
    "players": "jabbawock (1572) vs. blake84120 (1965)",
    "opening": "Sicilian, Chekhover variation (B53)"
}