{
    "moves": {
        "1. b4": "First move of the Polish Opening.",
        "1... Nf6 2. d4": "Immediately head to control center.",
        "2... d5 3. a3": "Reinforce my first move with A3.",
        "3... Bf5 4. e3": "Reinforce my control on the center.",
        "4... e6 5. c4": "Challenging his pawn on D5.",
        "5... dxc4": "He falls into my trap!",
        "6. Bxc4": "I capture his trapped pawn with my bishop.",
        "6... Bd6 7. Nf3": "Reinforcing my controlling pawn on D4.",
        "7... h6 8. O-O": "Castled.",
        "8... Nbd7 9. Nbd2": "Making sure my bishop stays safe on C4, and also protecting my other knight on F3.",
        "9... O-O 10. Re1": "Just more reinforcement. Never hurts right?",
        "10... Nb6 11. Bf1": "Didn't want him to take my bishop so I moved it.",
        "11... Ne4 12. g3": "Taking more tiles.",
        "12... Nd5 13. Nxe4": "Captured his knight to give him less pieces to work with. I fully expect him to take my knight.",
        "13... Bxe4 14. Nd2": "He did take it as expected, so I challenge his bishop with my last knight.",
        "14... Bg6": "Of course he falls back.",
        "15. e4": "Pushing back his knight, taking full control of mid-board. ",
        "15... Nb6 16. Bb2": "Protecting the free pawn, so it isn't a free piece anymore. :P",
        "16... Re8 17. Qb3": "Trying to make him think I am going for his center at E6. (I'm not.) Just pushing my way up the left side of the board.",
        "17... e5": "See? He moved his pawn to get center back, confused by my queen move.",
        "18. Rad1": "Preparing for future moves that'll involve my rook.",
        "18... exd4 19. Bxd4": "Taking back my control of center. I won't let him have it!",
        "19... Qc8 20. Bg2": "Reinforcing once more my control of center board.",
        "20... Be5 21. Bxe5": "At this point I am just taking pieces from him and opening bubbles on his side I will use later against him.",
        "21... Rxe5 22. f4": "Pushing back his rook.",
        "22... Re8 23. f5": "Pushing back his bishop.",
        "23... Bh7 24. g4": "Creating a pawn stronghold in the center. It's all mine!",
        "24... Nd7 25. Nf3": "Preventing his pawns from cuddling up to mine. ",
        "25... Ne5 26. Nxe5": "Limiting his moves by taking his pieces forcefully. But he basically gave me this one. Not sure why he moved there.",
        "26... Rxe5 27. Qc3": "Tried to push back his rook.",
        "27... f6": "Instead he reinforced.",
        "28. Rd5": "Hoping he will take the baited rook.",
        "28... Rxd5": "He does!",
        "29. exd5": "Now I have utter control of the center and there isn't much he can do about it.",
        "29... Qd7": "Tries to intimidate me with his queen because he realized he messed up by giving me control of the center.",
        "30. Rc1": "Protecting queen just in case he moves to C6.",
        "30... Rc8 31. Qc5": "Threaten him a little bit by advancing my queen forward. Hopefully he overthinks this move by thinking I am going for his king.",
        "31... Kh8": "Again, he does!",
        "32. d6": "I just keep pushing my way forward. No reason to go backwards right?",
        "32... c6": "He decides to not capture, but brush up to my pawns.",
        "33. b5": "Once more, I aggressively threaten his pawn.",
        "33... Rd8 34. bxc6": "Again, he was too lax and didn't take it, so I took his pawn opening more holes in his defense.",
        "34... bxc6 35. Rd1": "Protecting my furthest pawn.",
        "35... Qb7 36. Bxc6": "Threatening his queen big time.",
        "36... Qb6": "BLUNDER!",
        "37. Qxb6": "Take his queen fully expecting him to take mine right after.",
        "37... axb6 38. d7": "I keep chugging forward trying to get another queen.",
        "38... Bg8 39. Re1": "I move in for the kill.",
        "39... Bf7 40. Re8+": "I try to push his rook out of the way.",
        "40... Bxe8 41. dxe8=Q+": "Hey there is my queen!",
        "41... Rxe8": "Nevermind it is gone again. ;) ",
        "42. Bxe8": "I take back full control of the game, and checkmate is now inevitable. He resigns.\n\nThe Polish Opening, also known as the Sokolsky Opening (named after Alexey Sokolsky) relates to the closed openings and is considered an irregular opening. It ranks 9th in popularity and I would seldom recommend using this opening in high level chess play, ex tournaments etc. It does immediately give black an advantage off the bat after the first move, so using this against high level players will not turn out good. They will not give any advantage back to you! But I managed to take back advantage mid game, and secure the win during the end game mostly because he didn't know how to react to certain moves. Basically the whole game, I am working my way up through the middle of his defenses with strategically placed \"bubbles\" I created by taking certain pieces of his, or allowing him to take some of my pieces. But a win is a win and I will take it. :) "
    },
    "url": "https://gameknot.com/annotation.pl/polish-opening?gm=63558",
    "gameName": "Polish Opening",
    "players": "kluskie  vs. estor ",
    "opening": "Polish (Sokolsky) opening (A00)"
}