{
    "moves": {
        "1. e4": "This game is the first in a series of games which (attempt to) show some of the fun involved in the portuguese gambit.  Black sacrifices a pawn but in return gets a nice developmental edge, gives white doubled pawns (admittedly on the d file so there not so bad) and white gets a VERY weak pawn on f3.  This is not a very deep game, but it's always enjoyable to see games where 6/16 moves are made with white's king.",
        "1... d5 2. exd5 Nf6": "In the portuguese black lets the pawn be.  He's prepared to meet 3.c4 with a gambit like 3... c6 or 3... e6 (the Icelandic gambit).  Either way he will soon have two pieces out when white has zero.  The (more popular) alternative to 2... Nf6 is the simple queen recapture with 2... Qxd5.",
        "3. d4": "White decides not to hold onto the pawn, he'll get a space advantage after 3... Nxd5 4.c4 and after 3... Qxd5 4.Nc3 we've transposed back into lines with 2... Qxd5.",
        "3... Bg4": "This initiates the portuguese gambit.  Black will regain the pawn in some lines, but he gives white the chance to be greedy.",
        "4. f3": "White is a greedy patzer.  However, he has little choice.  3.Nf3 Qxd5 and it's difficult to show that white has an advantage (black's development is very good) and after 3.Be2 Bxe2 4.Qxe2 (4.Nxe2 is an equally good alternative) 4... Qxd5 5.Nf3 black should once again be perfectly fine.  The point is white is forced to either play greedily or black gets an easy game.",
        "4... Bf5": "Black induces weakness and then retreats to a different, but no less active square.",
        "5. c4": "White MUST hold the pawn (otherwise there was no reason to create the weakness that 4.f3 created.  But this is the wrong way, 5.Bb5  followed by c4 brings the bishop into the game with tempo while pinning black's game down a little.",
        "5... e6": "Black needs to find a way to bring the rest of his pieces into the game, c6 is the natural square for his knight, but for the moment white's pawn guards it.  He also needs to activate his dark squared bishop.  This move achieves both goals quite cleverly.",
        "6. dxe6": "Once again, white accepts material.  And once again it's probably his only hope for anything.  Otherwise black will simply win back d5 and be at least equal.",
        "6... Nc6": "Black didn't plan to take back, he just wanted a square to develop his knight to.",
        "7. exf7+": "This time the materialistic plan is silly.  It looks intriguing to grab the pawn and draw black's king out to f7.  Normally f7 is a great square to attack.  But notice that there's none of the natural checks via Qb3 , Qh5 , Bc4  or Nf3-g5 .  But white is just falling into black's plan.  I should note that 7.d5 is stronger but black is still active after 7... Nb4 threatening c2.",
        "7... Kxf7": "Black's king turns out to be completely safe on f7, and now the white king turns out to be the weak king.  Black has given up two pawns but his developmental advantage is growing and he now has an open e file to work with.  Also the d4 pawn is attacked and white cannot simply let it be taken or black will have two open files to work with.",
        "8. Be3": "The only other move is the passive 8.Ne2 but after 8... Nb4! white either checks on c2 or on d3.",
        "8... Bb4+": "White activates with tempo.  The main point of this move is not even to develop the bishop but to bring his rook into the game.",
        "9. Nc3 Re8": "And white once again has a problem with the d4 pawn as the bishop is now pinned.  At the same time he has to worry about the bishop as the pawn weakness induced on move 4 means that e3 is now defended.  There is only one way to break the pin and defend the bishop...",
        "10. Kf2": "An ugly move that allows the following combination, but what choice was there?  Black's development is so great, and white's king has become a great target.  But now black is at the crossroads.  He must continue his attack.  He has (for all intents and purposes) completed his development and he must break through now or white will have time to develop and maybe his two pawns will come to fruition.  So black must either find a way to strengthen his position or he must attack with all that he has.  What's the move?",
        "10... Rxe3": "Perfect!  White's king is drawn into the open where black is perfectly posed to meet his with another excellent sacrifice.",
        "11. Kxe3 Nxd4": "This sacrifice strikes from the same place.  White can decline but Black is threatening c2.  He also threatens anything from Qe7  (Kxd4 Rd1 !) to Bc5.  Not an easy position to defend.  But it's always more fun when people accept your sacrifices.",
        "12. Qxd4 Qe7+": "With the point of 13.Kd2 Rd8! winning the queen.  Admittedly white would still be ahead in material but his position is completely tied down, he has NO WAY to develop after 14.Qxd8 Qxd8  15.Kc1 Bxc3 16.bxc3 Qe7! where black infiltrates on the dark squares.  White can also play 14.Kf2 but this loses to 14... Bc5.  So white is left with one choice...",
        "13. Kf4": "His king comes further out, into the lions mouth.",
        "13... Bd6+": "White's bishop has done it's duty on b4.  Now it cuts off white's retreat to g3.",
        "14. Kxf5": "No choice here, 14.Qe5 loses the queen and allows mate in one to 14... Qxe5, and 14.Kg5 is mated very similarly to the mate in the game.",
        "14... Qe6+": "The queen covers the retreat along the light squares, the bishop controls the dark.  There is no retreat.  14... Qd7  has the same purpose and is objectively equal.",
        "15. Kg5 h6+ 16. Kh4 g5#": "Ouch!  This was a short game but I think it gives a very pleasant first taste of the portuguese gambit.  I hope you enjoyed.  As always, if you have any comments, criticisms or analysis please PM me."
    },
    "url": "https://gameknot.com/annotation.pl/portuguese-gambit-1?gm=6442",
    "gameName": "Portuguese Gambit #1",
    "players": "A Patzer  vs. The Mighty Portuguese Gambit ",
    "opening": "Scandinavian defence (B01)"
}