{
    "moves": {
        "1. d4 d5 2. c4 Nc6": "aiming for the Chigorin variation of the queens gambit. The plan is to allow white to take on 3.pxd5 after which I will play 3...Qxp 4. Nf3 e6 5. Nc3 Bb4. Eventually I will have to give up the bishop pair but I Will have active play in the center.",
        "3. Nf3 Bg4": "continuing with the plan of putting pressure on the center. I'll take the knight with the bishop at the proper moment.",
        "4. Nc3 e6": "hoping to play 5..Bb4 pinning the white knight and allowing black to take on d5 with his queen if white ever exchanges on d5. However, white may be better if he takes on d5 immediately since after 5. pxp pxp the black knight seems a little awkward on c6. Instead of 4..e6 black should play 4...pxp 5. e3 (protecting the d pawn)  5...e6 6. Bxc4 Bb4 with play similar to the game.  Blacks plan would be to exhange on c3, get the kings knight on d5 and if white exchanges on d5 to recapture witth the queen putting pressure on the pinned knight on f3. The main difference between this line and the actual game is that here whites dark square bishop would probably go on b2 hoping the a1 h8 diagonal will open up.",
        "5. Bf4": "This allows black to execute his plan. White would probably be better after 5. pxp pxp",
        "5... Bb4": "allowing black to answer 6. pxp with Qxp",
        "6. e3 Nf6": "A normal developing move to see if white will exchange on d5.",
        "7. Be2 O-O 8. O-O dxc4": "Realizing white may never take on d5 I decide to take matters into my own hands. I want to occupy the center with a piece.",
        "9. Bxc4 Bxc3": "This allows me to occupy the center with a piece.",
        "10. bxc3 Nd5": "threatening the pawn on c3. If white protects c3 blacks can disrupt whites pawn structure with 11. NxB",
        "11. Bxd5": "white may be expecting 11...pxB here as black is down a pawn after 11..Qxp 12. Bxc7",
        "11... Qxd5": "Actually black did not really notice he would be down a pawn here. Black was focused on carrying out his plan of getting a piece in the center.",
        "12. Bxc7": "Black is down a pawn. But is his position really all that bad? Already he has good pressure along the h5 d8 diagonal. After he plays Rc8 he puts pressure on the backward c pawn. Next the c6 knight will get to c4 via a5. All this amounts to clear compensation.",
        "12... Rac8 13. Bg3 Na5 14. Rc1 Nc4": "The position mentioned in the previous note.",
        "15. Re1": "White begins an attack on the position of the black queen.",
        "15... f5": "Of course 16. e4 cannot be allowed. ",
        "16. Qe2": "Now black cannot stop e4 and after exchanges on e4 the pin will be broken. 16. Nd6 will be answered by 17. BxN QxB 18. e4. ",
        "16... Kh8": "To be honest, I was not sure what I could do to improve my position, so I figured the safest thing to do is to move my king(as a waiting move)",
        "17. e4 fxe4 18. Qxe4": "White executes his plan. The pin is broken, black's bishop is under attack, and the e6 pawn is weak. How should black respond?",
        "18... Bxf3 19. gxf3": "forced as 19. QxQ BxQ loses a piece",
        "19... Nd2": "Getting the pawn back with a positional plus.",
        "20. Qxd5 exd5 21. Kg2 Nxf3 22. Re3": "This loses another pawn.",
        "22... Nxd4": "as pxN RxR wins the exchange.",
        "23. Rd3 Ne2 24. Rb1 b6 25. Re1 Nf4+": "Of course I should take the c pawn with the knight. Now the game drifts to a draw.",
        "26. Bxf4 Rxf4 27. Rxd5 Rcf8 28. Re2 h6 29. Rd7 Rf8f7 30. Rd4 Rf4f5 31. Ra4 Rc5 32. Re3": ""
    },
    "url": "https://gameknot.com/annotation.pl/positional-pawn-sacrifice?gm=18013",
    "gameName": "positional pawn sacrifice",
    "players": "Moon, Ryan (2079) vs. Stack, James (1602)",
    "opening": "QGD (D07), Chigorin defence"
}