{
    "moves": {
        "1. d4": "This is a fascinating positional game, where White makes several small positional errors early on. Black's development is always a little bit more smooth. Both sides play the positional middlegame very well, improving the position of their pieces consistently; however, Black's position is always a little bit more harmonious, which means that the tactics eventually all start working in his favour. Please do feel free to comment on and rate this annotation: I am always extremely grateful for feedback!",
        "1... Nf6 2. c4 g6 3. b3": "This is a relatively unusual try against Black's King's Indian - only 6 games in the GameKnot World database reach this position, with several more reaching similar positions via transposition. I suspect that the weakened dark squares on this diagonal make Black's fianchettoed DSB more powerful, even after White places his own bishop on b2. The normal move here is 3.Nc3, after which 3...Bg7 4.e4 keeps White's anti-KID options open.",
        "3... Bg7": "Proceeding as normal with Black's KID setup. 3...c5 crossed my mind as an alternative, looking to highlight the problems caused by White's 3rd move: if White responds with 4.d5 (which is normal in KID positions, taking advantage of Black's structure by seizing space in the centre), then 4...Bg7 means White immediately needs to start worrying about the exposed long diagonal (including the rook on a1). I decided on 3...Bg7, though: Black will develop the bishop here eventually, so I may as well do it immediately and get castled.",
        "4. Bb2": "Logical after 3.b3, and necessary to cover those exposed dark squares.",
        "4... O-O 5. e3": "A fairly modest approach by White. The most aggressive approaches to playing against the KID normally involve White playing e2-e4 fairly early on. This is because Black has completely ignored the centre, so (if White wants to play for an advantage) the most logical approach is to grab as much of the centre as possible, in order to take advantage of Black's omission. Obviously, 5.e4 would be impossible in this position, since Black's knight is covering e4; however, 5.Nc3 or 5.Nd2 followed by 6.e4 would be a more ambitious approach. Normally, if White only plays e2-e3, Black can be fairly certain of easy equality.",
        "5... a5": "Since White hasn't occupied the entire centre (and Black therefore isn't in immediate danger of being crushed to death), I have time for this move, even though it isn't strictly necessary to develop. I felt it would be helpful to take control of b4, which makes any White expansion plans with a3 and b4 a bit more difficult; later on, Black might play ...a4 in order to disrupt White's queenside pawns and try to create some weaknesses. On reflection, though, I don't think this is a particularly helpful move for Black at this stage; it would have been more useful to continue the typical KID plan of d7-d6 and e7-e5. Furthermore, the advance of this pawn might well create weaknesses on Black's queenside later.\n\nAs it happens, this move proves exceptionally useful later on: a lot of my positional squeezing revolves around this pawn creating weaknesses on White's queenside.",
        "6. Nc3 d6": "d7-d6 and e7-e5 is a common motif in the KID, challenging White's central formation.",
        "7. f3": "I'm not sure this move is particularly good: it takes away a useful square for White's knight, and creates potential long-term weaknesses on White's kingside. Simply 7.Nf3 might have been better, which develops a minor piece and forces Black to delay playing ...e5. Alternatively, 7.e4 is a reasonable move, occupying the centre and supporting a further advance: 7...e5 8.d5 (admittedly, 5.e3 and 7.e4 would mean that White has wasted a tempo).",
        "7... e5": "Thematic, but perhaps a little bit too early. If White plays 8.dxe5 now, 8...dxe5 9.Qxd8 Rxd8 results in a rather dry endgame position. Of course, Black has done well in that case (achieving equality on move 9!), but I wanted a more complex interesting game, which chances to play for an advantage. Therefore, I would not have been happy if White had played for an early queen exchange.",
        "8. Bd3": "Luckily for me, White played this instead (it's possible that White also wanted to play for an advantage, and didn't want an early queen exchange!).\n\nThis developing move looks useful, but it's risky for White to allow the centre to be opened up with his king still in the centre; 8.d5, keeping the centre firmly closed, might have been a safer option, after which e3-e4 secures a central space advantage for White.",
        "8... Re8": "I considered taking immediate advantage of White's exposed king with 8...exd4 9.exd4 Re8+, but I couldn't see any obviously strong continuation after White simply blocks with 10.Nge2 (and then castles). Instead, I decided to keep the central tension in place (which generally gives me more options later on) and place this rook on a useful central file.",
        "9. dxe5 dxe5": "Recapturing with the rook looks tempting, with the threat against White's e3-pawn. However, after 9...Rxe5, White has 10.Nd5, defending the e3-pawn and discovering an attack from White's bishop against the rook. I think Black's still fine in that line, but it looks a bit complicated. I felt that Black's position was better at this point (White looks a bit cramped, and Black can develop all his pieces really smoothly), so there's no need to complicate things unnecessarily: simply developing pieces and trying to squeeze White is a safer plan.",
        "10. Nge2 Nc6": "A useful square for the knight. This highlights why Black's earlier a7-a5 was a useful move: Black has control over b4, which could be a useful square for the knight later on.",
        "11. a3": "Preventing any irritating knight expeditions by Black, but potentially weakening White's other queenside pawns.",
        "11... Be6": "This develops Black's last minor piece, and also starts to put pressure on White's queenside pawns, which have been weakened by 11.a3. A possible plan later on is a5-a4, trying to weaken White's b3-pawn and potentially win the pawn on c4.",
        "12. O-O Qe7": "I wasn't entirely sure where Black's queen belongs yet, although this does put some more useful pressure on b4. But I also wanted to vacate d8 for Black's rook, which will pin White's bishop to the White queen. Again, Black's position is slightly more harmonious than White's, with pieces placed slightly more usefully: however, this won't turn into a win just yet. So I simply improve my pieces' position, little by little, and create small difficulties for White.",
        "13. Ng3": "A decent move. White attempts to solve the problem of his slightly passively-placed pieces: from here, the knight can target the useful e4-square. In addition, this creates more space on e2 for White's queen, which in turn means he can place a rook on d1 so it can target the open d-file.",
        "13... Rad8 14. Qe2 Nd7": "Both sides are improving their pieces' position, and Black still looks a bit better, but I wasn't sure what to do. So I played this very useful multi-purpose move, which achieves 3 useful things:\n\n1) The knight is moving towards c5, where it will put pressure on white's light-squared bishop and target White's b3-pawn;\n2) It unblocks Black's dark-squared bishop, which can start to put pressure on the long diagonal;\n3) It allows Black to play f7-f5, which will gain more space in the centre and kingside (a typical plan in the KID), as well as preventing White's knight from landing on the strong e4-square.",
        "15. Nb5 Nc5": "This is a clever move. Instead of passively defending the c7-pawn from White's knight, this move is active, turning Black's knight into a more powerful piece; in addition, it discovers a defence of Black's pawn from the queen on e7.",
        "16. Bc2": "Forced: both White's bishop and b3-pawn were under attack.",
        "16... f5": "Seizing more space and locking White's knight out of e4. By this point, I felt that Black was clearly better, although there's still no obvious win.",
        "17. Bc3 Qf7": "I suspected that White's 17.Bc3 was intended to prepare b3-b4: this is a useful move, expanding on the queenside and kicking Black's knight away from its strong post on c5. Therefore, I played Qf7. This is a very useful move, which prevents 18.b4? as this would allow 18...Bxc4, skewering White's queen and rook. It also intensifies the pressure against White's queenside pawns. This means that 18...a4 is a strong threat.",
        "18. Rad1": "A useful move, challenging Black's powerful rook on the open d-file. However, this does nothing about Black's threat of ...a4, which proves fatal for White. I suspect White has to play 18.a4, which looks a bit ugly and creates long-term weaknesses on White's kingside but stops Black from winning immediately. If White had done this, I would have turned my attention to the kingside, perhaps with ...f4 at some point to create more weaknesses in White's position.",
        "18... a4": "By this point, I felt that Black's positional dominance was strong enough to go on the attack. This fatally undermines White's queenside pawns. If 19.bxa4 or 19.b4, 19...Bxc4 wins for Black by skewering White's queen and rook. White cannot leave the pawn there, because 19...axb3 will win the pawn and 20...Bxc4 is inevitable.",
        "19. Nd6": "I can't explain this move, which simply drops the knight. Perhaps White simply didn't spot Black's pawn on c7, and was attracted by the apparent fork of Black's queen and rook. Nevertheless, by now, I think Black was clearly winning anyway, due to the intolerable pressure on White's queenside.",
        "19... cxd6 20. b4": "As explained after 18...a4, White doesn't really have anything better.",
        "20... Bxc4 21. Qd2 Bxf1 22. Nxf1": "Black is now an entire rook up, so the win should be trivial. One more tactical blow means that the game is decided immediately.",
        "22... Nb3": "This puts Black's knight in a really powerful position: it severely restricts the movement of White's pieces from b3. If White captures the knight with 23.Bxb3, the piece exchange is useful for Black (since he is already a rook up); in addition, the pawn on b3 after 23...axb3 is quite dangerous.",
        "23. Qd3 e4": "Surprisingly, this discovered attack wins White's dark-squared bishop: the queen must move, and this will leave the bishop undefended. Understandably, White resigned here, since he will be a rook and a bishop down. Thank you very much to my opponent for a fascinating and instructive game. :) Please feel free to comment, criticise and rate my annotation - feedback is always welcome!"
    },
    "url": "https://gameknot.com/annotation.pl/positional-squeeze-157th-gk-tournament?gm=63571",
    "gameName": "Positional Squeeze! (157th GK tournament)",
    "players": "cipsav (1462) vs. armavirumque (1484)",
    "opening": "King's Indian defence (E60)"
}