{
    "moves": {
        "1. e4": "This game features a rather interesting queen side attack.  I don't castle till move 25, for one I didn't need/want to and two seemed to lose to much time in my strong attack if I did.  The game starts of with the Sicilian so we'll start when white breaks the main line.",
        "1... c5 2. Nf3 d6 3. Bc4": "Bc4 the first break in the main line I believe Blake(2000+) annotated a game in which white played this move.",
        "3... e6": "Blocking off f7 transforming into a Schevengin Sicilian structure.",
        "4. d4 cxd4 5. Qxd4": "Qxd4?! best in my opinion was Nxd4 preparing an early king side attack with g4 going for something like the Keres Attack vs the Schevengin.  This just seems to waste a tempo.",
        "5... Nc6 6. Qd1": "White might try to move the queen to d3 trying to keep some development.",
        "6... Be7 7. Nc3 Bd7 8. Be3 Qc7 9. Qe2 Nf6 10. O-O-O a6": "a6 is a typical move in the Sicilian defends the very vulnerable b5 and prepares b5 in time.",
        "11. a3": "a3?! not sure if white couldn't figure out what to do here or just wanted to keep Nb4 out of the picture.",
        "11... Rc8": "Doubling up on the half open file.",
        "12. Na4": "Na4? Black now has a discovered attack and can attack another piece at the same time.",
        "12... Na5 13. Nb6": "White decides it's best to at least gain a rook for two pieces.",
        "13... Nxc4 14. Nxc8 Qxc8 15. Qd3": "Defends e4.",
        "15... Bb5": "Sets up a possible discoveries.",
        "16. Qc3": "Qc3? losses a pawn and gives black space.",
        "16... Nxe4": "Nxe4! the g7 pawn might as well be green from poison...  Qxg7?? Bf6 and the queen now must be sacrificed in order to stop mate.  Bxb2+ Kb1 Nc3#.  Funny at the time I didn't see this simple mate.  Black actually has mate several mates after Qxg7?? Bf6 (Qg4???) but I knew I had forced mate after Qg4??? and that's all that matters.",
        "17. Qe1": "White gets the queen out of fire Bf6 really doesn't do much now as white can block of the diagonal with the bishop. ",
        "17... d5": "So I solidify my beautiful knights.",
        "18. Nd2": "Trying to pull more pieces to the defense but white misses my potential threat.  Nd2 makes it possible I think.",
        "18... Nxa3": "Nxa3! beginning of a multi-move combination that will leave whites king exposed.",
        "19. bxa3": "Think this is forced for if c3 Nxc3 will more than likely lead to mate.",
        "19... Bxa3+ 20. Kb1 Qc3": "Qc3 now white must give back material to stop mate with Nc4.",
        "21. Nc4 Qxc4": "I take back with the queen because I'm not done pressuring whites king, White has very little to defend with the pawn on c2 is more of a hindrance than a help.",
        "22. Rd3": "White brings a piece into defensive mode.",
        "22... Bb4": "Attempt to move the queen so I can play Nc3+",
        "23. Bd2": "White blocks but loses the exchange.",
        "23... Nxd2+ 24. Rxd2 Bxd2 25. Qxd2": "Now I'm up a whole piece and a few pawns to boot.  Time to consolidate a bit and bring my last piece into play.",
        "25... O-O": "I castle Planing to play Rc8",
        "26. Re1 Rc8 27. Re3 Ba4": "Now I have three pieces on c2.",
        "28. c3": "White decides to push.",
        "28... Qb3+ 29. Qb2": "White offers up a trade.",
        "29... Qd1+": "I'd rather trade on c1 if I can to keep the king less active.",
        "30. Ka2": "White decides to run.",
        "30... b5": "keeping my bishop near the king.  So my queen keeps the pressure on.",
        "31. Ka3": "White continues to run.",
        "31... b4+": "b4+ not sure this was best but is a cleaver trap the natural Qxb4??? Qa1# Kxb4 Rb8+ winning the queen for a rook.",
        "32. cxb4": "White takes with the pawn.",
        "32... Rc2": "Forcing the queen to move.",
        "33. Qe5": "Now take a look at whites position.  One might think for a second that black must play Rc8 but no black has Ra2# if Kxa4.  Whites queen is stuck on the long diagonal because of Qa1#  The rook must stay on the rank-3 to avoid Qc1+ Kxa4 Ra2+ Kb3 Qc2#.",
        "33... h6": "So I stop checkmate and make a waiting move.",
        "34. b5": "White tries to take some pressure from the king.",
        "34... Bxb5": "Bxb5 was best because now I need not worry about Kxa4 and it also makes escaping a bit harder for whites king if it decided to try to run Kb4 Ka5 Kb6",
        "35. Rg3": "White threatens mate yet again.",
        "35... Qc1+": "Qc1+ Kb2 Qb2# forces Kb4.",
        "36. Kb4 Qd2+": "Ka3 was played in game so I'll skip over that one.  Kb3 Rb2+ Ka3 Qb4# Best was Rc3 Qc3+ Qxc3 Rxc3 Kxc3 and now I have a winning endgame.",
        "37. Ka3 Qa5+": "Forces Kb3",
        "38. Kb3 Qa4#": "Hope you enjoyed this game almost as much as I enjoyed playing it."
    },
    "url": "https://gameknot.com/annotation.pl/posioned-pawn-queen-side-attack?gm=25481",
    "gameName": "Posioned pawn + Queen side attack.",
    "players": "rorytours (1392) vs. yoshark (1439)",
    "opening": "Sicilian (B50)"
}