{
    "moves": {
        "1. d4": "A game from a real-time tournament which I would like to highly recommend as a game in which my opponent was slowly squeezed out of life!",
        "1... d5 2. c4": "My all-time favourite opening, which I always play as White, given the chance.",
        "2... Nf6": "The Marshall Defence. This is quite common in minor tournament level, like this one - in fact I had been faced with the Marshall Defence in the game before this one - but it is considered anti-positional at the highest levels, as after 3.cxd5 Nxc5 4.e4 White has as superior position and excellent control of the centre with tempo as the knight must flee. The creator of the Marshall Defence, Frank Marshall, ditched it after losing with it to Alexander Alekhine at the Baden-Baden tournament of 1925 - that should tell you what HE thought of his opening...",
        "3. cxd5 Nxd5 4. e4": "I proceed according to plan, gaining a superior position with tempo. When I look at this position I can never believe that anyone plays the Marshall Defence.",
        "4... Nb6": "4...Nf6 5.e5 and a quasi-Alekhine's Defence position is formed, but better for Black because White's c-pawn no longer exists. Black goes for the more open and flexible choice 4...Nb6, so I restrain my eager central pawns and hurry with my pieces' development.",
        "5. Nf3 e6": "Preventing ...e5 in the near future.",
        "6. Nc3 Be7 7. Bf4 O-O 8. b3 c5 9. Bc4": "I have a sometimes irrational liking for this immensely geometrically pleasing development. Look at White's immensely neat \"rectangle\" of development.",
        "9... Nxc4 10. bxc4": "Which my opponent spitefully decides to ruin.",
        "10... b6 11. d5 exd5 12. cxd5": "Still in the opening, and White has already managed to create a passed pawn. I just need to hold on to it, and it will be a win in the making.",
        "12... Bf6 13. e5": "White's pawns can be restrained no longer. They cut deep into the big empty space of Black's centre, with tempo as Black's bishop must eventually flee, even if Black holds this off with 13...Re8 pinning the pawn. Look, it's a contest of White's two central pawns, one of which is passed, against Black's no central pawns. No contest really...",
        "13... Re8 14. O-O": "Breaking the pin - with tempo! White seems to be doing everything with tempo.",
        "14... Bh4 15. g3": "No, no, no, you impertinent bishop. Your place is in passivity on the BACK rank.",
        "15... Be7 16. d6": "\"Once more unto the breach, dear friends, once more\" and the bishop is forced onto f8.",
        "16... Bf8 17. Nb5": "Time to press my attack. I sense that the time to convert my positional advantage into a material advantage has finally come. Black's pieces are all lined up on the back rank awaiting their fate!",
        "17... Na6 18. Qd5 Rb8 19. Ng5": "Attacking on the Eastern Front too. I am pressing my attack in all possible areas, trying to tie down Black's pieces in defensive posts...though, let's face it, they are pretty well tied down already.",
        "19... Qd7 20. Rad1 h6 21. Nxf7 Bb7 22. Nxh6+": "Black resigned. For the first time in this game, I was completely dumbfounded and stunned as I watched his king slowly roll of the table. So many times in my career I have had a massive positional advantage but was unable to convert it into a win and have had to settle for a draw - but this time I didn't even need to convert it for my opponent to resign. But the thing that surprised me was that it seems to me that, at least in the short term, Black's position can at least be held. He is beginning to break through my positional blockade, and my attack might not last long - for example, after 22...Kh7 (only move, as 22...Kh8 23.Qg8#) 23.Qg7  Kg6 and what then? How do I press my attack? And should Black have resigned?"
    },
    "url": "https://gameknot.com/annotation.pl/positional-squeeze?gm=20977",
    "gameName": "Positional SQUEEZE!",
    "players": "fatcat2 (48) vs. E.B. (63)",
    "opening": "QGD (D06), Marshall defence"
}