{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Bb5": "I found the ruy lopez too tricky!! so ",
        "3... Nd4": "I found the ruy lopez too tricky!! therefor whenever i want to afford falling into a trap i simply force an exchange and simplify things!! ",
        "4. Nxd4 exd4 5. O-O Nf6": "even this variation of the ruy lopez can be very trick for black!! i have to move my knight out now otherwise pawn to e5 will make my life miserable!!",
        "6. d3 Be7 7. f4": "i like my opponent his aggressive!! i am aggressive this gonna be a jam!!",
        "7... O-O 8. e5 Nd5 9. Bc4 Nb6 10. Bb3 a5 11. a4 d5 12. f5": "now in my earlier chess career i would have panicked but i quickly assessd the position and noticed that white wants to weaken my kingside and i see hes gonna succed no matter what i do because if i play f6 he plays e6 creating a very annoying blockade which shuts out my light sqaure bishop which makes an important defensive team along with the dark sqaure bishop and my queen but if i don't do anything white plays f6. opening up the g file. ",
        "12... c5": "well let him come i have confidence in my defenders plus whites pieces are not fully developed so i will counter attack in the center and cross my fingers!!",
        "13. f6 gxf6 14. Bh6 Re8 15. Qf3 Qd7": "and his attack fizzles out!! white simply attacked too early with out proper development!!",
        "16. exf6 Bf8 17. Qf4 Qg4": "and his attack completely failed!!",
        "18. Bxf8 Kxf8 19. Qc7": "i have no idea want white is thinking yes i see he is attacking my pieces but they are irrelevant. he now went from a great position to a bad position!!",
        "19... c4": "i can't move my rook to e2 just yet but it definetly will happen! first i need to secure my back rank unfortunately this move was not the best move bishop d7 is better!!",
        "20. dxc4 dxc4 21. Qxb6 cxb3 22. Qxb3 Re2 23. Qf3 Rxc2 24. Na3 Qxf3 25. Rxf3 Rxb2": "now I am simply winning why? simply because i had a superior position I even made mistakes and I am still winning!! and all thanks to my opponent!!",
        "26. Rd1 Rb4 27. Rg3 Bf5 28. Nb5 Rxa4 29. Nxd4 Bg6 30. Nb5 Rb4 31. Nc7 Rc8 32. Rd7 Rc4 33. Nd5 Rc4c1+ 34. Kf2 Rc1c2+ 35. Ke3 b5 36. Nb6 Rc8c3+": "blunder!!  but i think i can still force a draw!! ",
        "37. Kd4 Rc3c4+": "best!!",
        "38. Nxc4 Rxc4+ 39. Ke5 Ke8 40. Rd5 Re4+ 41. Kd6 Re6+ 42. Kc7 Rxf6": "finally! that pawn was one hell of a pain in the ass!!",
        "43. Re3+ Re6 44. Rd8+": "wtf?? forget the draw now i think i can win!! ",
        "44... Ke7 45. Rc3 Re2 46. Rd7+ Kf6 47. Kb6 a4 48. Kxb5 Bc2 49. Rg3 Ke6 50. Rd8 Ke7 51. Rc8 Bb3 52. Kb4 Rb2 53. Ka3 Ra2+ 54. Kb4 h5 55. Rh8 Bd1 56. Re3+ Kf6 57. Re1 Bb3 58. Rxh5 Rxg2 59. h4": " ",
        "59... Kg6 60. Ra5 Rg4+ 61. Ka3 Rxh4 62. Rg1+ Kf6 63. Rf1+ Ke7 64. Ra6 Rh3 65. Re1+ Kf8 66. Rf6 Kg7 67. Rf4 Kg6 68. Rg1+ Kh5 69. Rf5+ Kh6 70. Rf6+ Kh7 71. Rf4 Rh6 72. Rfg4 Rg6 73. Rh4+ Kg7 74. Rf1 f6 75. Rfh1 f5 76. Rxa4 Bxa4 77. Kxa4 f4 78. Kb4 Kf6 79. Kc4 Ke5 80. Re1+ Kf5 81. Kd4 Rd6+ 82. Kc5 Rd2 83. Kc4 f3 84. Kc3 Rd8 85. Re7 Kf4 86. Rf7+ Ke3 87. Re7+ Kf2 88. Rf7 Re8 89. Kd3 Re3+ 90. Kd2 Re2+ 91. Kd1 Re3 92. Kd2 Ra3 93. Kd1 Kf1 94. Rf8 f2 95. Rf7 Ra2 96. Rf8 Kg2 97. Rg8+ Kf3 98. Rf8+ Ke3 99. Re8+ Kd3 100. Rd8+ Ke3 101. Re8+ Kf3 102. Rf8+ Kg2 103. Rg8+ Kf1 104. Rg7 Re2 105. Rg6 Re8 106. Rf6": "the final mistake in a game riddled with them!! what a game!!",
        "106... Re1+ 107. Kd2 Kg2 108. Rg6+ Kh3 109. Rh6+ Kg4 110. Rf6 f1=Q": "game over!! "
    },
    "url": "https://gameknot.com/annotation.pl/position-is-very-important?gm=30524",
    "gameName": "position is very important!!",
    "players": "totenking  vs. africanboy ",
    "opening": "Ruy Lopez (C61), Bird's defence, Paulsen variation"
}