{
    "moves": {
        "1. e4 c5": "Sicilian.",
        "2. Bc4 e6 3. Nc3 Nc6 4. Nf3 Nf6 5. d3 a6 6. Bg5 Be7 7. O-O d5": "!?\nThis move cost me a pawn, but only if White allows me to open up the g-file. It was careless if I'm honest, I hadn't analysed the position enough and did not see that White could take the lead.",
        "8. Bxf6": "White seizes upon the error.",
        "8... gxf6": "At least I realised my mistake immediately. I decided that best plan now was all out attack, and that meant living dangerously. ",
        "9. exd5 exd5 10. Bxd5 O-O": "As crazy at this might look at a glance, it's practically  forced. I simply had to get my King off the e-file immediately, or White begins pinning pieces and I'm fighting to stay alive. Kd7 is not really an option, and Kf8 doesn't look great either.",
        "11. Bxc6": "?\nKey move. I think it's bad, though I might be wrong. It certainly allowed my WS Bishop to dominate later proceedings. Omus even said straight after that perhaps he shouldn't have played this move. Of course, being a pawn up, I can understand why he would want to further weaken my pawn structure whilst simplifying the board, but he certainly misses this Bishop later.",
        "11... bxc6 12. h3": "Obviously to deter the pin, but weakens his Kingside a little.",
        "12... Kh8 13. Ne4 Rg8 14. Ng3": "?\nI think this move should cost White the pawn he has gained. Perhaps Kh1 was better.",
        "14... Bd6": "Time to pile on the pressure. The Knight is pinned, as if he moves, then Bxh3.",
        "15. Kh2": "White seems too concerned about protecting his lead. This keeps the knight pinned.",
        "15... Qc7": "Load up on the diagonal. ",
        "16. Qe1": "Still White thinks he can maintain material advantage.",
        "16... Be6": "!\nAbsolutely the correct square for the Bishop.",
        "17. Ng1": "I was expecting Nd2, preparing for Ne4. Perhaps this would be a better line for White, though the pawn on f6 threatens to cause havoc.",
        "17... Rae8": "Better than doubling up the Rooks on the g-file. Threatens to force the Queen off e1 and thus finally win back the pawn.",
        "18. Ng1e2 Bd5": "Now White has both Knights pinned. ",
        "19. Qd2": "I'm not sure White is left with any choice here but to hope I'm not good enough to see the winning move ahead!",
        "19... Rxe2": "!\nThat's the move he was hoping I wouldn't make! Omus even said he hoped I had gone too early, though if I waited, he would play R(a)e1 and tidy up his position nicely. Also, this move makes it easier for my WS Bishop to dominate, as White no longer has a piece he can trade it for without giving me the lead.",
        "20. Qxe2": "What choice now?",
        "20... Bxg3+ 21. fxg3": "Omus did contemplate declining the Bishop, and instead playing Kh1. My initial analysis suggested this line would take me to an endgame featuring either the two Queens and me with a two pawn lead, or an equal material endgame with just Kings and pawns, with my King winning the race to the other side. But this analysis may be flawed, and perhaps I would only have found myself a pawn up with a lot of work still to do. Still, I'd rather have had the two Bishops than the extra Rook.\nIn case you hadn't noticed, Kg1 was not an option, or mate in two with Bh2 , Kh1, Bxg2#",
        "21... Qxg3+ 22. Kg1": "Kh1? Qxh3 , Kg1, Rxg2 , Qxg2, Qxg2#",
        "22... Qxg2+": "!\nI couldn't find a mate, nor could I find a way to win material, and there was the threat of threefold repetition if White's Queens was allowed to get to f6, so instead I turned my attention to manipulating a favourable endgame position.",
        "23. Qxg2": "I had wanred Omus that he would not enjoy this next passage one bit, and placed conditional moves so he could get through it as fast as possible!",
        "23... Rxg2+ 24. Kh1 Rxc2+": "You can see where this is going...",
        "25. Kg1 Rg2+ 26. Kh1 Rxb2+": "I almost felt bad. Almost.",
        "27. Kg1 Rg2+ 28. Kh1": "I spent a long time deciding whether next move should be Rd2  or Rxa2 . I initially thought it was best to leave the a2 pawn where it was, keeping that file closed, and instead claim the d3 pawn and then put pressure on h3. But I went with a different option...",
        "28... Rxa2+ 29. Kg1 Rxa1": "!\nI think this is the move that ensured I had a won endgame, coupled with my next one. I didn't like the idea of White having two rooks, there were just too many variables for a player of my ability to analyse. I didn't think my Rook was my key piece, and felt I had more to gain by simplifying the position.",
        "30. Rxa1 c4": "!\nAnother key move. Either White takes the pawn, allowing me to protect the pawn on a6, or he pushes him, giving me another, more dangerous, passer. At this point I felt I had it in the bag.",
        "31. d4": "It seemed the better option, White's only hope now is my pawn structure is too weak for me to force through.",
        "31... f5 32. Rxa6 Kg7 33. Kf2 f4": "!\nI'm just being nasty now, aren't I? Blocks White's King from further advancement.",
        "34. Ra1 Kf6 35. Re1 Kf5": "Premature.",
        "36. Re5+": "Exactly!",
        "36... Kg6 37. Re1 f6 38. Rf1 Kf5 39. Re1 Be4": "Again, premature. Luckily for me, these slight lapses in concentration where not damaging, White could only make me move the Bishop back and find a different route.",
        "40. Ra1 Bd5 41. Re1 h5": "!\nI think this puts White in zugzwang. If he moves his Rook off the e-file, my King can sneak through. If he moves his pawn, my King will capture him shortly after. If he moves his Rook to e7 or e8, my Bishop can close the file, and I'd be looking to play f3, Kf4 and then f5, while he moves his Rook back around to the back row, where it needs to be. If he moves his King to e2, my King moves to e4. If he moves his King anywhere else, he's losing ground  and will find himself committed to defending his h3 pawn. So White has just one choice left...",
        "42. Re2": "And it invites the reply...",
        "42... f3": "Advances with a tempo. White must lose a tempo by moving his Rook, meaning his King cannot stop mine from advancing. And after I have got my King off the 5th, my Bishop can start getting where it wants to be.",
        "43. Re1 Kf4 44. Re3 Be4": "And off the bishop goes!",
        "45. Rc3 Bd3 46. Rc1 Be2": "And my Bishop has repositioned himself nicely, while all White can do is move the Rook about aimlessly.",
        "47. Ra1 Ke4 48. Ra6 Kd5": "Wasn't too keen on the Rook getting behind my passer, though I don't think he could stop me winning if he did. I'd prefer him to have his Rook over on the h-file.",
        "49. Ra5+ Kxd4 50. Rxh5": "Wasn't concerned about losing that pawn, there's no way he has time to push his h-pawn.",
        "50... c3": "No more positional moves any more, it's time for brute force.",
        "51. Ra5 c2 52. Ra1 Kc3 53. Ra6": "Cheeky! ",
        "53... c1=Q 54. Rxc6+ Bc4 55. h4 Kd4": "And White resigns. He was hoping I'd blunder, but I wasn't willing to oblige after all the hard work I'd put in! Thank you Omus for an excellent game."
    },
    "url": "https://gameknot.com/annotation.pl/postage-stamp-challenge?gm=18517",
    "gameName": "postage stamp challenge",
    "players": "omus (1704) vs. tugger (1558)",
    "opening": "Sicilian defence (B20)"
}