{
    "moves": {
        "1. e4 e5 2. Bc4 Nf6": "Normal opening",
        "3. Nf3": "Threatens the pawn on e5",
        "3... Nc6": "Normal defense",
        "4. Ng5": "This leads to an interesting game",
        "4... d5": "Standard reply, I would not even think 1 second on a real board.",
        "5. exd5": "There are some options here: Nxd5 or Na5. I usually played Nxd5 because I've seen people do that a lot on a real board. But after playing a little with the chess game database I think Na5 is better.",
        "5... Na5 6. d3": "protects the bishop and opens the line for dsb, defending the knight.",
        "6... h6": "White could do a gambit and play Nxf7 but at this position I think its bad because it doesnt give an active thread to the king. With the knight on f6, Qf3 tricks are not possible. So black made the right decision. I didnt like to wait if he would do it or not so I forced him to decide now. It's not a lost in tempo since black has to move his knight away, instead it removes any attack from g5.",
        "7. Nf3 Bg4": "Pinned the knight and developed a piece",
        "8. Nc3 Bb4": "Pinned another knight and developed another piece",
        "9. Bd2 O-O 10. h3 Bxf3": "Now I have to make some notes here. Normally I do not like to trade a knight with a lsb, because I like a lsb more than a knight. But in this situation if I play bh4 or bf5 he could play g4, trying to play a pawn attack, and do a long castling (0-0-0). Bd7 seems too passive for me.",
        "11. Qxf3 Re8": "e4 seems like a strong move after Bxc3. This was sort of my plan but it didn't turn out that way.",
        "12. Qg3": "White now threatens Bxh6 hoping for an easy game.",
        "12... Nh5": "g6 or leads to Bxh6 and weakening my pawn structure. g5 seemed to make my pawnstructure even worse. This seemed to be a good move to solve it though it makes the knight more vulnerable",
        "13. Qg4": "White wants to get the knight away",
        "13... Nf4": "This seemed for me the best choice. I could go back to Nf6 and the queen had to move again but I'm a player that likes to play risky. It's just more fun. g3 seems like a good move, I would have answered it with Bxc3. It would have lead to a different game. This knight will stand here for 15 moves, so it didn't turn out to be a bad move at all.",
        "14. O-O": "White decides to castle to save his king. Maybe I would have castled long but its a rule that castling short is more safe. ",
        "14... Nxc4": "decided to exchange pieces here because I thought my position was stronger, at least, i had some initiative.",
        "15. dxc4 Bxc3 16. Bxc3": "white now has a weak doublepawn although he is still one pawn ahead. (5 exd5)",
        "16... Qf6": "Now was the time for some counterplay of my own.",
        "17. Rfe1": "putting preasure on the pawn. Obvious move, white did not see what was coming.",
        "17... Rad8": "This is a preparation move, nothing else. My idea is h5, but if I dont do this move first, white will do Qd7 and eat pawns. Maybe 17Qd7 was better but it leads to Rac8 and my pawns are well defended.",
        "18. Re4": "Black knows how to play and wants to double his rooks on the e line.",
        "18... h5": "So this is the plan. h5!",
        "19. Qg3": "h4? leads to Qg4.",
        "19... Qf5": "pushing forward and attacking the rook",
        "20. Rae1": "obvious move to put some more pressure on the e-line",
        "20... f6": "I have to protect e5. This also leads to some more powerfull moves after Kf7",
        "21. Qf3": "This move is just bad because it's much too passive. I would have played Bd2 to attack the knight, or Qe3 to attack the pawnstructure, and then try a pawnrush.",
        "21... Kf7": "more defense for f6 and also able to do some powerfull attack when the rooks are moved to g8 or h8",
        "22. Kh2": "White already feels some sort of attack is coming. Maybe white wants to prevent some sort of Ne2+",
        "22... g5": "Decided not to waste time to move my rooks first, every move counts here. ",
        "23. Bd2": "White doesnt mind to trade the knight for the bishop here.",
        "23... g4": "continue to move forward. I don't know what happens after Qg3. h3 looks vulnerable and Rg8 is incoming too.",
        "24. hxg4 hxg4": "Attacking the Queen.",
        "25. Qg3 Reh8+ 26. Kg1 Qh5": "Qh1# White has 1 normal move to get out of it.",
        "27. f3": "Any other move was fatal",
        "27... Rdg8": "putting pressure on f3. Bxf4 is not too good here because I will play gxf3. the Queen is attacked by the rook on g8 and the Queen doesn't have any place to run (Qf2 Qh1#)",
        "28. Kf2": "The king tries to walk out of it. I've looked a long time at this but didn't see any good moves. I was afraid of Bxf4 and getting a huge counterattack on e7 after exf4. But analysing the board is possible, and I found the next move. I'm not sure if I would find the next move on a real board.",
        "28... Nh3+": "This is not a sacrifice as you will see. The king should have moved to e2 but I don't know what happens after gxf3. Ke3 looks bad because of f5. Kf1 looks alright because ... gxf3 Qxf3",
        "29. gxh3 gxh3": "Attacking the Queen",
        "30. Qh2 Rg2+ 31. Qxg2 hxg2": "Now this is where white could have done better. He should have played Rg1. Qh1? Rxg2 or Rg8? Rxg2. I couldn't protect the pawn anyway",
        "32. Kxg2": "This is wrong because it loses material. Since white is 3 pawns ahead, the score is 0 for both at this moment.",
        "32... Qh2+ 33. Kf1 Rg8": "Trying for Qg1# or Rg1#. There is only 1 normal way out of this",
        "34. Rg4 Qxd2": "Black is now +3 ahead. White can't move the rook out of the g-line because of Qg2#",
        "35. Rxg8 Kxg8 36. b3 Qxc2": "Simply eating a pawn.",
        "37. Re2 Qd3 38. Kf2 f5": "A dirty trick! Rxe5 Qd4+ 40 Re3 f4 losing the rook.",
        "39. Re1 Kf7": "Putting it out of check",
        "40. Kg3 e4": "if Rf1 e3 and if K... Qxf3. White resigns. "
    },
    "url": "https://gameknot.com/annotation.pl/powerful-kingside-attack?gm=44287",
    "gameName": "Powerful kingside attack",
    "players": "nitinkhare (1649) vs. schakertje (1644)",
    "opening": "Bishop's opening (C24), Berlin defence"
}