{
    "moves": {
        "1. e4": "Hey Chap and everyone else at one of the best chess sites in the world.  Here's my annotation \nof a game played in late 2007.  Cursory, at best, but at least some ideas \nto throw in the hat.  Thanks to everyone at Gameknot who continues to make this a wonderful\nplace to freely play and freely learn the game we all love.  \n\n",
        "1... e6 2. Nf3 d5 3. e5 c5 4. c3 Nc6": "Better for Black might have been pushing the d pawn to d4.  If White decides to exchange his c pawn, this would give Black the chance to \nchallenge the solidness of White's huge pawn on e4.  Also, white's d pawn would be hemmed \nin stagnating the development of White's queenside minor pieces.  \nProblem with this option is that uses an additional move for the same piece in the opening.  Already\nhaving the disadvantage as the player who goes second in the game, Black should not nurse that\nproblem by trying to stir up trouble just yet in the center.  Indeed, it was good that Black didn't waste \ntime with that- Black didn't even have time to castle this game!",
        "5. d4": "Thus far has been a very strange move order to get into the French defense (adv. variation).  \n\nAnother option here for White is to develop his bishop to Bb5 and allowing the king to castle.  If\nBlack moves his queen to b6, White can capture the knight on c6 and reducing some pressure off\nof d4.  Tough call as this would give Black the two bishop advantage.  ",
        "5... Qb6 6. Be2": "A typical French Defense set up.  White plays the advance variation (3.e5).  Playing a slow game, such as\r\nin correspondance, it gave me a chance to play Nh6.  Tough variation, since the French is already so \r\ndense, but interesting and fun nonetheless.  \r\n\r\nWhite can also play Be3, because of the well-known tactic in case Black\r\ngets pawn greedy: \r\n6...cxd4 7. cxd4 Nxd4 8.Nxd4 Qxd4 9.Bb5! and the discovered attack on\r\nBlack's queen is fatal.",
        "6... Nh6": "This is risky, but well calculated.  If White takes on h6 then Black gets an added pawn \non the kingside on the h file (after...Bg7 fianchetto, Black has a nice castle).  In exchange, white has the more mobility, or \"space\" since the position is closed in the center, thus making his knights more valuable.  \nIndeed, Black would have trouble developing the \"problem\" bishop in the French Defense.  It wasn't until\nmove 15 where Black's light squared bishop made a cameo during an exchange on e6.\n\nOn another note, if White decides not to exchange on h6, then if Black moves the Knight to the\n outpost f5 White can always play the irritating g4.  ",
        "7. Bxh6 gxh6 8. O-O": "White has been playing soundly thus far, not giving Black any room for error.  \nWhile castling here was appropriate, he sacrifices his pawn structure on the queenside. \n And though he is ahead in development, and it will take black at least two moves to castle, \nbetter here was the move 8.Qc1 or 8.b3 in order to protect b2.  Though c3 is the base of White's \npawn structure on the queenside, b2 is quite important to support the base.  ",
        "8... Qxb2 9. Nbd2": "In this advance variation of the French- more importantly in light of the position on the board as of now, it seems to help me put the b pawn on b2 as early as possible-almost as important as castling, and fianchettoing the bishop on b2.  If Black decides to take with the c5 pawn, white still has plenty of protection for d4.  Especially if black had been able to post his kingknight on f5 (great outpost and attacks d4)\n\nOne reason Black sends his Queen on an early voyage in the French is to\nexert influence on the B file.  The b2 pawn can easily become a source of\npain in this opening.  ",
        "9... Qxc3": "gobble gobble",
        "10. Nb3": "better here for White is 10.dxc5.   He could further box in the Queen with 11.Rc1 THEN bringing \nover the knight to b3.  ",
        "10... c4": "closes in the center for good and forces the white Knight to retreat.  ",
        "11. Nbd2": "gives Black another pawn for free.  If White still had both Bishops this sac may have helped \nclear up the center for play along the long diagonals (a1-h8 and b1-g7).  Throughout the game, white\ndidn't have a justified reason for the pawn sacrifices, therefore allowing me to take. \n\nNotice here an idea that I read in one of Silmans books.  Certainly not an original idea, but he helped \nme understand it better:  It is common that your attack should be directed towards the side where your pawns are pointed.  \nWith my f7-e6-d5-c4 it's easy to see that my attack on the queenside is further justified.  ",
        "11... Nxd4 12. Nxd4 Qxd4 13. Nf3": "threatens an enemy piece and develops a piece.  powerful moves, which have compound funtions like this\nare a good find.  ",
        "13... Qc5 14. Nd4 Bg7 15. Bg4": "White's central pawn!, one of his most important pieces (controlling e5 and exerting control of f6 \nand d6 was his last hope in saving his center. Better here is 15.Re1 and eventually Kf3 and Queen \nto follow if additional support is needed.  As Black, my focus the whole game was my pawn on d5.  \nMaking sure it was reinforced as needed and waiting to advance the d and c pawn on the endgame.  \nBetter here for White was 15.f4 or Nf3\n\nTook a lesson with a GM once and the FIRST thing he did was point to the four central squares of \nthe board and say \"this is what you're playing for\".  \n\nLike any game, football-soccer-table hockey, if you\ncontrol the CENTER you control the whole playing field.",
        "15... Bxe5 16. Nxe6": "Nice way to give up the knight and avoids losing the rook.  Didn't see this one.  A nice tactic that eventually cleans up the center \nand gives White some more mobility- it may have been better for White to keep his forces and \nuses them in a surge-like attack on the kingside.  If one is down in material it's good to avoid exchanging off pieces.  Basically, keeping pieces on the board allows a delay of the endgame.  In the \nendgame, of course, a material advantage is easily exploited.  ",
        "16... Bxe6 17. Bxe6 fxe6": "Better for Black is 17...Bxh2  18.Kxh2 Qd6  19.Kg1 Qxe6 Keeping the King more protected.  Much\nmore protected.  This oversight gave White the bulk of initiative for the rest of the game.  ",
        "18. Qh5+": "Interesting note here:  White's queen starts a journey that almost circumvents the whole\n board by move 25",
        "18... Ke7 19. Qxe5": "a beautiful 4-move tactic that White completes on this move.  ",
        "19... Rae8 20. Qg7+ Kd6 21. Qxb7": "lots of sharp tactical play by White mops up some more pawns, but leaves Black with a very strong \r\ncenter- including an advanced pawn on the c file.  Now Black simply aims to march down the center \r\nfiles with the pawns, having plenty open space to thwart any attacks on the exposed King.  At this \r\npoint I knew that I could simply exchange off all the major pieces leaving me with a pawn structure \r\nthat would easily win in the endgame.  \r\n\r\nHad white began a campaign of building a battery of pieces on the e file in order to attack black's weak e pawn, chances seem likely that he would eventually mop up some of blacks pawns inevitably.  ",
        "21... Reb8 22. Qg7 a5": "more efficient by Black would be to make a nest for his naked king, and forego the development of his a pawn.  ",
        "23. Rfe1 d4 24. Qxh6": "That gain in material is not needed.  Not just because it weakens White general attack and \nusefulness of her Queen, but also because it grants Black more time to march down the center. \nIt will take the White Queen a move to get back into true action.  White is a tempo\nbehind now and will have to catch up very quickly if she wants to stop the pawn march.\nPawn grabbing is a very \nrisky venture- Better could have been to get the A rook into the action.  \nNevertheless, it helps clear up some potential endgame threats that were lurking.  \n\n",
        "24... Rbf8": "A drunken oversight by Black.  Obviously better was 24.Rbe8.  ",
        "25. Qxe6+ Kc7 26. Re5 Qd6": "Black would like to exchanges of Queens asap.  If White gets the Black king to the b file, then White will check him using his rook currently on the a file.  From there, matings threats will surely follow.  ",
        "27. Qe7+ Qxe7": "whoosh....close call.  A little too close for comfort.  with the exchange of queens now and the passed pawns, \nthis game Black is doing well.",
        "28. Rxe7+ Kd6 29. Rae1": "As said before, my plan was to march down the pawns.  With the pawn blunder and now my \nrooks out of action it seems like White could possibly draw the game, or at least even up some\n material.  ",
        "29... Rfd8": "took me a long while to find that move.  i've been finding that quiet moves are 1.difficult to find\n2.very effective!",
        "30. Re1e5 c3": "a common thread in endgame theory is this:  the player who can centralize (get the king to one of \nthe four center squares or as close as possible)\nthe king in the endgame has more space, and as a result more control of the whole board.  as in the opening where we try to castle asap, in the endgame its a good idea to centralize the king asap.  Here white could have a plan of f3, Kf2, Ke3, etc.  \nOf course, there are some exceptions:  you might take a look at this position here and say \"the centralized\nblack king is in jeopardy.  Though, even with the two white rooks owning the e file and close to the enemy\nking, there are no significant mating threats.  Indeed, as GM Mike Christiansen has said \"the threat \nis often greater than the execution\".  Nevertheless, Black is using his king as an active piece: claiming \nterritory and aiding the safety of the passed pawns.  ",
        "31. Re5e1": "White could have kept that rook on e5.  Instead, 31.R(7)c6 and eventually exchanging \nd rook.  After the king takes on, i.e. Kxd7, then the e5 rook can now take the pawn on the a file,\nafter which his king could march in and save the day.  Note that the Black king is quarantined below\nthe 5th rank because of the White rook on a5.  Even so, black still has a chance to quarantine the \nWhite king by playing Re8- allowing no chance for the king to come in and gobble\nup the pawns\n\n",
        "31... d3 32. Re7e3 Kc5 33. Rc1": "White couldn't have drawn the game here, but instead of shipping the e1 Rook over to the \nc file checking and rechecking the king from the efile \nmight have forced Black to exchange one of the rooks, giving better chances of using his king \nto stop the pawn march.  The Black king is in a precarious position here of protecting his\nd pawn and not allowing White to draw the game.  A chess tactician would called that \"overloading \nthe defender\".  In this case, the king.  ",
        "33... c2 34. Kf1": "too late for the white king to get in on the action.",
        "34... Rhe8 35. g4": "better here for White is 35.Re1.  If Black plays 35...d2, then 36.Rxc2  Kb4 37.Rd1!  Leaving Blacks\ndream of queening a pawn in the dust.  NOW White would actually be winning as he has a huge pawn \nmajority on the kingside.  His pawn grabbing from earlier on would come in handy now.  NOTE that while material is even here, the advanced pawns of Black have a value of a minor piece or major piece.  White\nis having to expend all his forces to keep the black pawns from queening.  This concept of \"overloading\" is\nproviding Black with more and more space on the board.  ",
        "35... Rxe3 36. fxe3 Kc4 37. h4 Kc3 38. Kf2 Rf8+": "Getting the king out of the way as far as possible.  ",
        "39. Kg3 d2": "now the fatal strike.  here on out is just standard endgame technique- which is my nemesis.  ",
        "40. Rxc2+ Kxc2 41. g5 d1=Q": "the material advantage will now be decisive.  ",
        "42. e4 Qf3+ 43. Kh2 Rd8": "this seems the fastest way to checkmate. ",
        "44. e5 Rd2+ 45. Kg1 Qd1#": "Great game, with a lot to learn from each side.  Good example of the power a passed pawn. Had White not given up material in the beginning of\nthe game it would have given him a more solid position in the center and and equality of position. \nThere's alot missing from this annotation.  \nAny thoughts?  Thanks to whoever might have actually read this whole annotation.  \nThanks alot Chizznappy for playing- "
    },
    "url": "https://gameknot.com/annotation.pl/power-of-the-passed-pawn?gm=12373",
    "gameName": "Power of the Passed Pawn!",
    "players": "chizznappy (1305) vs. sycilmathai (1214)",
    "opening": "French (C00), Wing gambit"
}