{
    "moves": {
        "1. c4": "I start with the English.",
        "1... f5": "I have never encountered this defense called the: English (A10), Anglo-Dutch defense.",
        "2. d4": "I grab hold of the center!",
        "2... Nf6": "He develops a Knight!",
        "3. Nc3": "I do the same!",
        "3... d6": "Probably a e5 push?",
        "4. Nf3": "I develop my other Knight!",
        "4... Nc6": "He does the same!",
        "5. a3": "Here I made my first mistake I was worried that a Knight will come and sit on b4! Quote id=darknite13: \"OK, as a tip for your future games, you want to make development moves in the opening. 5. a3? is a move that could be played down the line, but not all your pieces are developed. This tempo loss can add up and you can be quickly outplayed if you continue to make non-development moves in the opening.\"",
        "5... e5": "E4!",
        "6. d5": "I chase his Knight!",
        "6... Ne7": "He moves it!",
        "7. Nd2": "Yet another mistake. Quote id=darknite13: \"An example of a development move would be 5. Bg5 or Bf4, bringing the bishop into play and staking your claim for the center of the board: one of the primary goals in the opening.\" Now I have just blocked the Bishop!",
        "7... Ng6": "Making space for his Bishop and bringing his Knight back into the game!",
        "8. e4": "I go for the center!",
        "8... Be7": "He moves his Bishop so he can Castle King side!",
        "9. Be2": "I do the same! After looking at it later I think it would be better to take his f5 pawn!",
        "9... O-O 10. O-O c6": "We have both Castled and he attacks!",
        "11. b4": "I don't recall why I made this move. The computer say best is c5!",
        "11... a5": "Logical! Here the game turns id=darknite13 said that after this move I started making mistakes!",
        "12. Bb2": ".",
        "12... Nxe4": "With this move he is starting to break my center!",
        "13. Ndxe4": ".",
        "13... fxe4": ".",
        "14. Nxe4": ".",
        "14... Nf4": ".",
        "15. dxc6": "I should have played g3!",
        "15... bxc6": ".",
        "16. c5": ".",
        "16... d5": ".",
        "17. Ng3": ".",
        "17... Qc7": ".",
        "18. Re1": ".",
        "18... Rb8": ".",
        "19. Qb3": "Here I made my first mistake according to the computer! I should have played Bc3! And Quote id=darknite13: \"20. Bc3?? - Bf3 would be better. Maybe Ne4\".",
        "19... Bxc5": "Now he is just breaking/beating me!",
        "20. Bc3": "To late! I should have played Ne3!",
        "20... Bxf2+": "Here he declares mate in four!",
        "21. Kxf2": "????",
        "21... Qb6+": "!!",
        "22. Kf1": "????",
        "22... Nd3+": "!!!!",
        "23. Bf3": "????",
        "23... Qf2#": "GOOD GAME id=darknite13! And thanks for mentoring me! I hope to learn more from you!"
    },
    "url": "https://gameknot.com/annotation.pl/practice-match-1?gm=54311",
    "gameName": "Practice Match #1",
    "players": "andriesvorster (1325) vs. darknite13 (2073)",
    "opening": "English (A10), Anglo-Dutch defense"
}