{
    "moves": {
        "1. Nf3 d5 2. d4 e6 3. c4 Nf6 4. g3 Be7 5. Bg2 O-O 6. O-O b6": "Closed Catalan\nAlternative variation: 6... c6 [ is a more common way to keep the position closed. The game could continue] 7. Qc2 Nbd7 8. b3 [with the option of 8...b6 or 8...b5 here.]\nAlternative variation: 6... dxc4 [ is the strongest move, because White will need to eventually take time to recapture the pawn.] 7. Qc2 a6 8. Qxc4 b5 $11\n",
        "7. Qc2": "Not the most accurate move.\nAlternative variation: 7. Nc3 Bb7 8. Ne5 Na6 9. b3 [ gives White a very nice position with a slight edge.]\n",
        "7... Nbd7": "Alternative variation: 7... c5 [ seems to be the best way to take advantage of 7.Qc2. Black should now try to get his rook on the c-file.] 8. Nc3 Nc6 9. Rd1 Bb7 [with an even game.]\n",
        "8. Ne5": "Alternative variation: 8. cxd5 [keeps the edge for White.] Nxd5 9. Nc3 $14\n",
        "8... Bb7": "Alternative variation: 8... Nxe5 9. dxe5 Ng4 $15 [and White is having trouble defending the e5 pawn.]\n",
        "9. cxd5 exd5": "Alternative variation: 9... Nxd5 [uses a nice tactic to defend against Ne5-c6.] 10. Nc6 Nb4 11. Nxb4 Bxg2 12. Kxg2 Bxb4 $11\n",
        "10. Nc6": "Good move. Taking advantage of the hole on c6.\n",
        "10... Qe8": "Alternative variation: 10... Bxc6 11. Qxc6 [ isn't any better for Black. The pawns on d5 and c7 are too weak to hold onto.] \n",
        "11. Nxe7+ Qxe7 12. Qxc7 Ba6 13. Re1": "Black has the opportunity to take a large lead in development here by harrassing White's queen.\nAlternative variation: 13. Nc3 [ developing and protecting e5. If] Bxe2 14. Re1 [wins the bishop.]\n",
        "13... Qb4": "Alternative variation: 13... Rfc8 14. Qf4 Ne4 [followed by Ne7-f6.]\n",
        "14. Qc3 Qe7 15. Qa3 Qe6": "Alternative variation: 15... Qxa3 [only move.] 16. Nxa3 Rac8 [and White should be able to win in this position being up a pawn and having the bishop pair.]\n",
        "16. Qxa6 Rfc8 17. Nc3 Rc4 18. Bxd5 Nxd5 19. Qxc4 Nd7f6 20. Nxd5 Nxd5 21. e4 Rd8 22. Bg5 Nf6 23. Qxe6 fxe6 24. Rad1 Rc8 25. Bxf6 gxf6 26. d5 e5 27. Rdc1 Rd8 28. Rc7 a6 29. Rec1 Rf8 30. Rc7c8 a5 31. d6 Rxc8 32. Rxc8+ Kf7 33. d7 Ke6 34. d8=Q Kf7 35. Qg8+ Ke7 36. Rc6 Kd7 37. Qe6+ Kd8 38. Rc8#": "Game Summary: In the opening, White made a small inaccuracy with 7.Qc2. Black had a chance to equalize at that point by playing 7...c5 and grabbing space in the center. After 8.Ne5, Black could have weakened White's pawn structure with 8...Nxe5, also taking the initiative. White played a very strong game after that point taking advantage of a small mistake by black (9...exd5) and converting his edge to a win.\n"
    },
    "url": "https://gameknot.com/annotation.pl/practice-games-home?gm=30435",
    "gameName": "Practice Games, Home",
    "players": "Mukherjee, Piyush (1970) vs. Lekah, Daniel (1670)",
    "opening": "Reti opening (A06)"
}