{
    "moves": {
        "1. e4": "I was White in this game which is the first time I ever beat my coach. Although I cannot take full credit for beating a 2500, because he was playing about 30 other students at once, in an opening he doesn't normally play.",
        "1... d5": "My coach taught us the Center-Counter Defense that day, and was testing my knowledge of it, although he usually plays the Sveshnikov. Whenver he teaches his students a new opening, he plays it against them all at the same time. In the Center-Counter, Black sacrifices one tempo in the opening for imbalanced positional play.",
        "2. exd5 Qxd5 3. Nc3 Qa5 4. d4 Nf6": "During the lesson, my coach instructed us to play Nf3 in this position, but I knew that if I wanted to beat him, I'd have to play a variation he wasn't familiar with.",
        "5. Bd2": "My coach was probably less familiar with this variation, especially since he doesn't even play this opening.",
        "5... c6": "Black prepares to retreat his queen to c7 if I move my knight.",
        "6. Bc4": "I want to play Nd5 to attack the queen, so I need my bishop to defend d5.",
        "6... Bf5": "Bringing out the bishop so it won't be blocked when Black plays e6.",
        "7. Nd5 Qd8 8. Nxf6+ gxf6": "This is better than exf6, because it brings a flank pawn toward the centre to control, while exf6 does the opposite.",
        "9. Nf3 e6": "My coach was moving very fast here, since he had 30 other boards to move on.",
        "10. c3": "I need to solidify my centre so my knight won't have to be tied down to defending d4.",
        "10... Nd7": "Black's setup is similar to the Colle System, or (Businessman's Opening), except that Black's queen bishop isn't blocked in, and the d and e pawns have been exchanged.",
        "11. Nh4": "Preparing Qf3 while threatening to triple Black's pawns.",
        "11... Bg6": "Be4 is interesting, but my coach (playing many games at once) probably doesn't want to waste time analyzing a variation that is probably good for White.",
        "12. Qf3 Bd6 13. O-O f5": "Threatens my knight.",
        "14. g3": "Of course I'm not going to trade my posted knight for Black's terrible bishop.",
        "14... Be7": "Black really wants my knight off its post.",
        "15. Ng2 Nf6 16. Rfe1": "Pretty much the only logical move.",
        "16... Ne4": "Threatens my bishop.",
        "17. Bf4": "I can make this move now that Black's knight cannot disturb me with Nh5.",
        "17... Qd7": "There isn't much to do in this cramped position.",
        "18. Qe3": "My queen is a lot stronger here since it joins the bishop in controlling the dark squares, and joins the rook in controlling part of the e-file.",
        "18... Rg8": "Again, there are few options in this cramped position, so all Black can do is make maneuvres that intend to attack my kingside.",
        "19. Be2": "My bishop isn't doing anything on c4, so this positional maneuvre clears way for my queenside pawns to advance since Black will eventually castle queenside, and my bishop can go to f3 later to control the long diagonal.",
        "19... h5": "Intending to attack.",
        "20. h4": "Stopping Black from playing h4.",
        "20... O-O-O 21. b4": "Since I have stalled Black's attack, I begin my own attack against Black's king. It was at this point when I realized that I had a chance to beat my coach, because usually I'm dead lost before move 20.",
        "21... Bd6": "Attempting to free up space.",
        "22. Rad1": "I thought deeply here since I had such a big time advantage, and concluded that I wouldn't get anywhere playing a4 and b5 even though it seemed good at first. My better plan, is to play a3 and c4 and make a break in the centre with d5, instead of my previous idea to make a break on the flank.",
        "22... Kb8": "Black really can't do anything in this position.\nI told myself, \"I'm winning against my own coach and have more time to think! I can't screw this up!\"",
        "23. a3 Ka8": "Black has nothing.",
        "24. c4 Rge8": "Probably playing for an e5 boost.",
        "25. Bxd6": "Playing d5 only opens up the position and frees Black's crampedness. I had to trash that idea and plan to play Nf4 and Bf3, which makes my pieces more active and increases my chances for a mating attack on the queenside. I started to swallow my pride and realize that beating my coach may only be an illusion.",
        "25... Qxd6 26. Nf4 Nf6": "There still isn't much Black can do in this position, so I felt better knowing that I was the one who had the attacking chances.",
        "27. Bf3 Kb8": "Taking the king off the line of my bishop.",
        "28. Qe2": "Threatening h5.",
        "28... Ng4": "Rh8 is too passive.",
        "29. b5": "This is where you should really pay attention. After calculating the next few moves, I realized that I may have a winning attack against my coach. It seemed too good to be true, but I didn't see anything wrong with it. Hopefully my coach didn't have any professional tricks up his sleeve.",
        "29... cxb5": "Opening the c-file is less dangerous than letting me open the b-file.\nBut I think c4 may be Black's best chance to survive. My coach didn't have much time to think, and probably jumped at the chance to win a pawn, since a3 is hanging. But I think my attack is winning thanks to my brilliant move.",
        "30. c5": "30.c5!!\nDespite being down a pawn, I have an open b-file to attack, and Black's pawn structure in front of his king is weakened.",
        "30... Qd7": "If Black gives me back the pawn on b5, then he's dead on b7 and the light squares. Black's only chance to survive my attack is to try to hold onto the pawn.\nBut how long will it hold?",
        "31. Rdb1 a6": "If Qxd4, then I play Bxb7, and Black's king's position falls apart.",
        "32. a4": "Now I have enough forces to win my pawn back, since if Black takes, I have Qxa3 or Rxb7, both crushing.",
        "32... e5": "Finally Black has some counterplay, so now I need to play extra-accurate, especially since my opponent is an International Master (IM)",
        "33. Nd5": "This blocks Qxd4 and brings my knight closer to Black's king.",
        "33... e4": "If 33...exd4??, then I play 34.Nb6 with tempo, and if 34...Qe6, then I simply play 35.Qd2 and Black's queen is driven to f6, where I have Rxe8, and if Black takes back the rook, then Nf7  wins the queen.\nAnd if Black tries 33...exd4?? 34.Nb6 Qc7, then I have Qxe8  Rxe8 Rxe8  Ka7 Ra8#",
        "34. Nb6 Qxd4": "I lose another pawn, but I think my attack is still winning.",
        "35. Bxg4": "Now that Black has blocked my diagonal, my bishop is worthless and needs to be traded.",
        "35... fxg4 36. Rbd1": "I'm setting up Black for Qxc5 Nd7 ",
        "36... Qc3 37. axb5 Ka7": "Opening the a-file is too dangerous for Black.",
        "38. bxa6 Qxc5": "I'm still down material, but Black's king is very weak.",
        "39. Nd7 Qc3 40. axb7": "All Black's defensive pawns are gone, and Black's king is exposed to checks. It was here when I knew for sure that I had a won game.",
        "40... e3": "A last desperate chance for counterplay.",
        "41. Rda1+": "The next few moves are pretty much forced.",
        "41... Kxb7 42. Qb5+ Kc7": "This gets mated a move quicker than Kc8, but I can still get Black's king to c7 with Ra8.",
        "43. Qb6+ Kxd7 44. Ra7+ Kc8 45. Qb7#": "This was the single greatest game of my life. But I didn't win because I'm better than my coach (which I'm not!) I just caught him at an off-moment, since he was playing a lot of simultaneous games in an opening he wasn't familiar with. But still, I BEAT A 2500!!!!!!!"
    },
    "url": "https://gameknot.com/annotation.pl/practice-game-with-my-coach?gm=3791",
    "gameName": "Practice game with my coach",
    "players": "bakerbaker (1789) vs. Cyrus Lakdawala (My coach!) (2550)",
    "opening": "Scandinavian defence, Lasker variation (B01)"
}