{
    "moves": {
        "1. e4": "In this game, the 2 players agreed to a draw when captrook was up 1 pawn. It may have seemed drawish at first, but I looked at a move that may have changed things. Im tired right now and decided no analysis board, so please check my analysis and ideas for me. ",
        "1... c5 2. Nf3 d6 3. Bb5+": "Moscow variation, sicilian defense. Canal sokolsky is another name",
        "3... Bd7 4. Bxd7+ Qxd7 5. Nc3": "An acceptable move, but c4 is the most common. ",
        "5... Nc6 6. O-O": "Playing d4 at some point may have been a nice choice, opening up the game. ",
        "6... e5": "Standard in many london sicilians. Black clamps down, preventing d4. ",
        "7. d3 Be7": "Both sides are playing reasonably, developing pieces. No real mistakes yet.",
        "8. Bg5": "An odd looking move at first, but nothing tactical wrong with it. A good of a move as any.",
        "8... f6": "Not necessary, cutting off a good square for the knight. In this closed position, both players have potential in f4 or f5, when properly developed. Also, whites got an outpost on d5, while black has no outpost. White's position, while not greatly superior, is more comfortable in general. But f6 is not seriously wrong.",
        "9. Be3 h6": "But this is going too far. Black's position is now riddled with dark square weaknesses, and the white knights are going to take advantage of this. Moves like Nh4, Nd5, in conjunction will cause trouble in the black position. My choice in this position would be Nh4 now, placing on f5 or g6, depending on the opponent. ",
        "10. Nh4 O-O-O": "White is much better now. He has the opportunity to attack with Nd5, c3 or a3, with b4, and opening the position of the king. The 2 rooks can be transfered quickly. That plan springs to mind in an instant. White may also consider moves like Qh5, Nf5 or Ng6 with Nd5 and f4. Black's position is very difficult already. Most stronger players on this site could recieve a winning ad from this position as white. Once black hass castled, a critical principle comes in play. When 2 players are castled opposite, the one that gets to the other first will usually recieve the advantage. Whether it is with pieces(open positions generally) or pawns, morelikely, this principle will likely decide the game in these kind of positions. Black cannot really attack now, he is not developed enough and his attack is hard to generate.",
        "11. Nd5 g5": "Not good at all, but it was hard to suggest a pleasant alternative. ",
        "12. Nf5 Rh7 13. Ndxe7+": "A bad move on white's part. He relieves a ton of pressure and helps black develop. Black's position, although still bad, is suddenly spared. I would have played c3 or Rb1 in preperation to attack. Qd2 is also possible to transfer a rook. Other options were to play on the other side, although its a smaller target and less important. ",
        "13... Ngxe7 14. Nxe7+ Nxe7": "And just like that, white releases black from his grip, and allows him a defensible position. In fact, black's knight has good prospects, certainly better than the bishop. Also, black has now fully developed with white's help, and can advance on the kingside and transfer a rook. Black has good conterplay and stands fine, but white still is just a bit more comfortable, as the bishop can be freed with c3 and b4, or a line can be opened for the white rooks, leading to the black king.",
        "15. c4": "Not good. White should focus more with opening lines on the kingside",
        "15... f5": "Black wastes not time at all in opening the kingside. A little preperation may not have hurt, but this is the right idea. Black would like to transfer the rook and queen and knight, and advance the g, h pawns.",
        "16. f3 f4": "Now, the advantage has shifted, to black. Black has the initiative now, and his attack is coming directly. ",
        "17. Bd2 h5": "Black obviously understands the principle. He may have not been executing it properly so far, but is doing far better than white, as you will see.",
        "18. b3": "Still headed in the wrong way.",
        "18... h4": "Not so sure about the execution. I believe black could have gotten some more prep with either Ng6 or Rg8/h8. Now white plays h3 to lock up the kingside more. It will be hard to break through.@l-d-j ...g4 will open the kingside. But since white could hardly do much to stop him, why shouldn't black transfer a rook now? ...g4 now is much better than h4 though. Thats why I wasn't so sure about the execution. ",
        "19. Ba5 b6 20. Bc3 Nc6": "Both sides have missed an opportunity. White's h3 seemed likely to stall the attack for now, and black has not yet proceeded with the attack, playing Nc6, heading away from the offensive. h3 for black was important now.",
        "21. Qe1 h3": "The move is played now. Probably a good move, but g4 was viable, and if white captures, then the white king is in mortal danger on the kingside. I can invision all the black pieces aimed for g2, all the white ones defending. Then a timely breakthrough using the knight is possible, while the bishop is near useless. If white does not capture on g4, black follows up h3 and the white king is once again in danger.",
        "22. g3": "the main dilemna with this move is that black can play g4 now, and transposes to a line mentioned in my previous comment. Black will have the white kingside blasted open, and invade with Rg8 and a full assortment of major pieces. White will be totally losing. After 22...g4, black can wait and pack a full force behind the pawns before capturing. Analysis of lines is not critically important here as long as black watches out for threats or plans white has to stop his attack. Otherwise, black can just 'play along' as he adjusts his possibilities to counter white's defense. It does work. With limited time, I definitely have not looked at all lines, but can see that black is totally in control here.",
        "22... fxg3": "Not as good as g4. If only black had the black knight even close to the white king. But the knight can still get into the battle with Nd4. ",
        "23. Qxg3 Rg8": "getting his prep. Good in that sense, but bad in the fact that white may choose 24.Qg4 and swap Qs. After 24...Qxg4+ 25.fxg4 Rh4 the pawn is a goner, and black would probably win anyways, with his superior minor piece as well, so Qg4 will not save white. However, white does have 25.f4, and if f5 can be gotten in quickly, white may have staved off an immediate death. 25...exf4 26.Rxf4 white can hopefully close by doubling on the f file or trading some pieces. Even this gives white an ad though. Without the attack, black has a better minor piece. ",
        "24. Bd2 Nd4": "threatening to win the queen, and getting the knight to a great square. ",
        "25. Qg4": "The queen trade. ",
        "25... Qxg4+ 26. fxg4 Rh4": "my line mentioned. White is without help. ",
        "27. Kh1 Rxg4 28. Rfg1": "will trading rooks favor white? It will certainly make his g/h pawns untouchable and loosen some targets on the Qside for the knight. Black is winning. Once the king enters, it will be over.",
        "28... Rxg1+ 29. Rxg1 Nf3": "the idea was to play g4, to secure all pawns, where the knight and king would have decided things. but this is not bad. ",
        "30. Rd1 Nxd2": "Now black trades off the great knight for the bishop which could hardly move until now. Not a good choice, and the pieces left on the board, a rook and king for each do not promise black anything. Now his only hope is that after black blockades the pawns with ease, he will be able to create a 2nd weak spot on the queenside, thus winning. This task would be eased if black had his good knight.",
        "31. Rxd2 Kd7 32. Kg1": "Kings in action.@tonnerre youre variation works very well. A great idea, and if white tries to trade rooks Rf2, then move the rook where it is guarded by the e pawn and moev the king out. A great idea.---------However, not the only way to win. If white had played the more accurate 33.Kf2, black would break through on the queenside and threaten white's pawns with his king. White's own king cannot assist, it is too far away. Not only can black's rook guard the g pawn, it can play important defense along the 6,7,8th ranks. If white's rook ventures to far into black's camp, black will let the g pawn go and penetrate himself. This will win. Black can start by moving to Kc6. All black has to do here is put the rook on g7 and king on c6 and break with the king. Once the rook is off the f file, it will have to, the g7 rook penetrates, taking ALL the pawns. ",
        "32... g4 33. Rf2": "seizing the file. UPDATE:But this is a little less accurate than Kf2, because black has the g3 break coming up. If white cannot blockade the pawn, it will advance. It doesn't even have to advance now, becuase the white king nor the white rook will be stopping it.But in my previous update, Kf2 also loses.",
        "33... Ke7 34. Rf5": "making room for the king. If white tries to invade through Rh5, black will also gain access into the white position through f file, and black will prevail. The f file black rook will serve as a wall for the black king, and eats the white pawns from behind. I suggest now to simply activate the king for white. Unfortunately, the line 34...g3 is unpleasant for black. There are unguarded pawns on ranks 1  and 2. This move allows a penetraation, capture or not. Black plays 34...g3 threatening gxh3+ and Rg2+, winning. Rf3 does not help. No good counters are there for black... capturing looses the d3 pawn and all of the queenside pawns... ",
        "34... a5": "A bit rash. Why not wait with this advance. a6 could have been important, or maybe waiting moves  would need to be played. Not at all necessary and could jepordize the win. ",
        "35. a3": "Activate that king. ",
        "35... Ke8": "And here, the players agreed to a draw, black seeing that he can make no progress. He simply missed that g3 wins, as it did 2 turns ago. Now instead of Ke8, waiting, 35...g4 36.Rf3 gxh+ 37.Kxh Rg2+ followed with Ra2/b2 is a win. Again, no counters, and black will recieve a passed pawn on queenside no matter what. If the analysis is wrong, please let me know and I will have learned something. If the analysis is correct, than I have proven a winning resource. "
    },
    "url": "https://gameknot.com/annotation.pl/premature-draw-winning-resource?gm=40119",
    "gameName": "Premature Draw? Winning resource?",
    "players": "regicida (1518) vs. capt_rook (1440)",
    "opening": "Sicilian (B52), Canal-Sokolsky attack, Bronstein gambit"
}