{
    "moves": {
        "1. e4 Nf6 2. e5 Nd5 3. d4 d6 4. f4": "Según la base de datos que utilizo, hay 60 partidas más que llegan a esta posición, de las que el 27% terminó en Tablas, un 33,6% dió victoria a las blancas y 39,4% correspondió a victoria de las negras. Estadísticamente, f4 es pues una respuesta, al menos, inapropiada. Pero sule ser seguida de dxe5 o Af5 para producir los mejores efectos para las negras. De esas partidas tomamos como ejemplo la jugada por J. Pelikian y G. Milos, en la Copa Itaú, San Pablo, 2004 y que siguió de este modo 4 ... dxe5 5.fxe5 c5 6.Cf3 cxd4 7.Dxd4 Cc6 8.Ab5 Af5 9.Cc3 e6 10.Da4 Cb4 11.Axc6+ bxc6 12.Ae3 Axc2 13.b3 Dd3 14.Ad4 Ae7 15.a3 Axb3 16.Dxb3 Cc2+ 17.Rf2 Cxd4 18.Tad1 Dxf3+ 0-1\n",
        "4... Nc6": "Movimiento fuera del libro  dxe5 43% Af5 38% g6 19% IvanHoe v73: Análisis reporta errores, con cambio de  puntuación desde:  -0.29 / +0.43\nAlternative variation: 4. ... dxe5 5. dxe5 Nc6 6. Nf3 Bg4 7. h3 Bf5 8. Bd3 Bxd3 9. Qxd3 Ndb4 10. Qe4 e6 11. O-O Bc5+ 12. Kh1 Qd5 \n",
        "5. Nf3 Bg4 6. Bc4 e6 7. c3": "IvanHoe v73: Análisis reporta errores, con cambio de puntuación desde:  +0.06 / -0.74\nAlternative variation: 7. O-O dxe5 8. fxe5 Be7 9. Nc3 O-O 10. Nxd5 exd5 11. Bb3 Qd7 12. c3 Bf5 13. Ng5 h6 14. Qf3 = \n",
        "7... h6": "IvanHoe v73: Análisis reporta errores, con cambio de puntuación desde:  -0.74 / -0.05\nAlternative variation: 7. ... dxe5 8. Bxd5 Qxd5 9. fxe5 f6 10. exf6 gxf6 11. Nbd2 O-O-O 12. Qb3 Ne7 13. O-O Kb8 14. Qxd5 Nxd5 15. c4 Ne3 16. Re1 Bh6 17. Ne4 Bxf3 18. gxf3 Rhg8+ 19. Kf2 =+ \n",
        "8. h3 Bxf3 9. Qxf3 Nb6 10. Bb3 d5 11. O-O Ne7 12. Bc2 Nf5": "Tras éste movimiento quedaban en nuestros relojes 54m (mío) y 57m (Guisande). Ello implica que yo llevaba 22 minutos de reflexión (1.10+30s es el tiempo de disputa) y mi oponente 19 minutos.\n",
        "13. g4 Nh4 14. Qf2 Rc8": "IvanHoe v73: Análisis reporta errores, con cambio de puntuación desde:  +0.18 / +1.16 Movimiento fuera del libro\nAlternative variation: 14. ... g6 15. a4 a5 16. b3 h5 17. g5 Nf5 18. Bxf5 gxf5 19. Ba3 Be7 20. Bxe7 Qxe7 21. Na3 Rg8 22. Nb5 O-O-O \n",
        "15. f5 exf5": "Mi reloj indica ahora 52m por lo que he utilizado 25m30s. Mi rival ha utilizado 22m30s, indicando su reloj 55m.\n",
        "16. gxf5 c5 17. f6": "IvanHoe v73: Análisis reporta errores, con cambio de puntuación desde:  +1.38 / +0.68\nAlternative variation: 17. Be3 cxd4 18. Bxd4 Qg5+ 19. Kh1 Bc5 20. Bxc5 Rxc5 21. f6 Rc4 22. Rg1 Qf4 23. Qxf4 Rxf4 24. fxg7 Rg8 25. Bh7 Rf3 26. Kh2 Rf2+ 27. Kg3 \n",
        "17... g5 18. a4": "IvanHoe v73: Análisis reporta errores, con cambio de puntuación desde:  +0.68 / +0.16\nAlternative variation: 18. Bd1 Rc6 19. Be3 cxd4 20. cxd4 a6 21. a3 Nc4 22. Nc3 Nf5 23. Bc1 Nh4 24. Bg4 Nxa3 += \n",
        "18... a5": "IvanHoe v73: Análisis reporta errores, con cambio de puntuación desde:  +0.16 / +0.70\nAlternative variation: 18. ... cxd4 19. cxd4 Qd7 20. Kh2 Nf3+ 21. Qxf3 Rxc2+ 22. Kg1 Qc7 23. Nc3 Qc4 24. Qd1 Rxc3 25. bxc3 Qxc3 26. Ra2 Qxh3 27. Rf3 Qg4+ 28. Rg2 Qd7 29. Rh2 Bb4 30. Rfh3 Bf8 31. Rc3 Nxa4 \n",
        "19. Bd3": "La amenaza mejora al ser soportado el alfil por el Peón, y al estar b5 fuera del alcance del caballo.Aquí yo analizo erróneamente 20 Ab5+ Cd7 21 e6 fxe6 22 f7+ Re7 tras lo cuál pienso Df6 y lo veo cómo mate, olvidando que ahora d6 quedaría accesible, ya que no está el peón blanco de e. Me creo a punto de caer en un mate en 4. Me desmoralizo, y no queriendo renunciar a cambiar en c5 (¿Qué hago con mi Alfil negro?), erro jugando el Caballo en la próxima, siendo que cxd4 o incluso c4 me habrían resuelto la situacion.\n",
        "19... Nc4": "IvanHoe v73: Análisis reporta errores, con cambio de puntuación desde:  +0.80 / +1.37\nAlternative variation: 19. ... cxd4 20. cxd4 Bb4 21. Bf4 Qd7 22. Bb5 Rc6 23. Bxc6 bxc6 24. Kh2 O-O 25. Bg3 Ng6 26. Rc1 h5 27. h4 g4 28. Nd2 Re8 29. Kg2 Bxd2 30. Qxd2 Nc4 \n",
        "20. b3": "Sencilla y efectiva, sólo explicable no haberla considerado como efecto psicológico del mate que creo inminente.\n",
        "20... Nb6": "Finalmente, mi reloj indica 48m por lo que he utilizado 32m y el de mi rival indica 36m, por lo que él usó 46m\n",
        "21. Bb5+": "Y abandono porque creo todo liquidado. Es más, le comenté antes que moviese Guisande a Pedro Lamas, \"Tiene mate en 4, si hace la primera, dejo\". Inmediatamente a abandonar Guisande me muestra que no era mate... pero ya es tarde. A continuación un análisis de programa de cómo podría haber seguido todo.\nAlternative variation: 21. Bb5+ Nd7 22. c4 Qb6 23. cxd5 cxd4 24. Re1 Bb4 25. Bd2 Bc5 26. e6 O-O 27. Bxd7 d3 28. Re3 Rcd8 29. e7 Rxd7 30. e8=Q Rxe8 31. Rxe8+ Kh7 32. Be3 Bxe3 33. Qxe3 Qxe3+ 34. Rxe3 Rxd5 35. Nc3 \n"
    },
    "url": "https://gameknot.com/annotation.pl/primavera-2010-trebejos?gm=33789",
    "gameName": "Primavera 2010, Trebejos",
    "players": "Guisande, Fernando (2080) vs. Uria, Guillermo (1534)",
    "opening": "Alekhine's defence (B03)"
}