{
    "moves": {
        "1. f4": "In this game Nate plays white and House plays black (age before cripple apparently). Nate opens with the bird opening which House notes is \"a passive approach, sign of a coward\".",
        "1... c5": "House replies with 1...c5 and Nate comments \"Sicilian Defence, sign of an idiot\". although technically speaking i'm not sure u would call this a sicilian. needless to say the verbal jousting between the two continues throughout the game.",
        "2. Nf3 d5": "Transposing back into the Bird System/Dutch variation",
        "3. e3 Nf6 4. b3 e6 5. Ba3": "As far as i can tell this a novelty and to be honest this move seems pretty dodgy to me the bishop is trapped in by blacks c5 pawn. Bb2 looks much better to me. Seems our child prodigy is feeling a little under the weather (which is to be expected since he's dying of liver failure).",
        "5... Bd6 6. Bb5+ Nc6 7. Nc3 O-O": "House isn't actually shown making this move on the show (seems this move and the whites reply hit the cutting room floor in the editing phase so i had to figure it out by looking at later shots of the board) ",
        "8. Rb1": "Whoever composed this game stuck this move in to make the following combinations work out later on. as u'll see soon if this move wasnt played blacks attack wouldnt be possible (white would have too much extra tempo). ",
        "8... e5 9. fxe5 Nxe5 10. Be2": "Too passive for my liking 10.Nxe5 was probably better.",
        "10... Ne4": "Black leaves the pawn hanging better would be 10...Nxf3",
        "11. Nxd5": "Nate Grabs the pawn. I think u'll agree that the play so far has been mediocre at best - but dont forget they are playing under 5 minute time controls and Nate's skin has turned a horrible shade of yellow- but its now that the beautiful combinations kick in. ",
        "11... Nxf3+": "House Triumphantly announces check and informs Nate that there is \"a fine line between tortured genius and awkward kid who cant get girls. It's about now that the fireworks really begin.",
        "12. Bxf3": "The only sensible reply 12.gxf3 leads to disaster in the form of 12...Qh4  13.Kf1 13...Qf2#",
        "12... Qh4+ 13. g3 Bxg3+": "House sacs his bishop in hopes of an attack on blacks king",
        "14. hxg3 Qxg3+": "As before 15.Kf1 leads to checkmate, fortunately for white his bishop as left a space for the king to run to",
        "15. Ke2 Ng5": "At this point house is probably feeling pretty good about his chances as after 16.Qf1 16...Nxf3 17.Qxf3 17...bishop g4 and the queen is pinned. unfortunately for House Nate has a nasty surprise for him",
        "16. Qf1": "As House is about to make his move Nate informs him of his upcoming mating net and suddenly has a seizure   House is later seen making the moves on his board and eventually tipping his king, heres how the game would have continued.",
        "16... Nxf3": "? Critical mistake for black more prudent would have been 16...Bg4 or even retreating with 16....Qd6 (preventing Ne7 from being played which House comments on later in the episode",
        "17. Qxf3 Bg4": "??? The more astute among u may have realized by now that white has a Forced mate. See if u can figure out how white achieves mate. DON'T CHEAT!!",
        "18. Ne7+": "! Forces the king to h8",
        "18... Kh8": "The only move",
        "19. Rxh7+": "!!! brilliantly sacs the rook in return for an inevitable mate",
        "19... Kxh7 20. Rh1+": "Blacks choices are incredible limited right now but all roads lead to mate regardless",
        "20... Bh5": "Blacks last gasp",
        "21. Qxh5#": "!! What a game, while some of the moves in the middle game left a bit to be desired, the endgame is just sublime. When i first set out to reconstruct the game to be honest i wasnt expecting a whole lot from the producers. After all the entire game sequence lasted all of 60 seconds on the show but overall i was left pleasantly surprised with the quality of the play. \n\n"
    },
    "url": "https://gameknot.com/annotation.pl/princeton-plainsboro-teaching-hospital-new-jersey?gm=12458",
    "gameName": "Princeton-Plainsboro Teaching Hospital, New Jersey",
    "players": "Nate Harrison (?) vs. Dr Gregory House (?)",
    "opening": "Bird's opening (A02)"
}