{
    "moves": {
        "1. e4 Nf6": "Alekhines Defence",
        "2. Nc3 d5": "now the game has transposed to a scandinavian setup, but with the knights already developed to f6 and c3 white no longer has the option of playing c4 and if white exchanges on d5 blacks queen is not easily attacked in the centre as white no longer has his queens knight to force it back with.",
        "3. exd5": "whites altenative here is e5 when Ne4 leads to interesting play",
        "3... Nxd5 4. Nxd5 Qxd5": "exposing your queen in the opening normally isn't advised as your opponent can gain  time by attacking her, here however white has no convienient way to atack the black queen",
        "5. d4 Nc6 6. Nf3 Bg4 7. c4 Qd7": "?! not the best square for the queen, d6 or h5 would have been better places for the queen. ",
        "8. Be3": "an immediate d5 would be stronger when white would have a definate space advantage",
        "8... O-O-O": "?! black should try to prevent d5 by e6. an interesting alternative is the pawn break e5, after 9.d5 Bb4  white must play 10.Ke2 as after 10.Bd2 Bxd2  white must choose between 11.Kxd2 Nd4 or 10.Qxd2 Bxf3 11.gxf3 Kd5 niether of which looks to pleasing",
        "9. d5": "white has a definate advantage here, he controls the centre well and is ready to start attacking play on the queenside where as black is cramped and is in no position to start offencive operations on the kingside.",
        "9... Qf5": "?? loses by force, the idea was to pin the pawn to the queen but black can simply block the pin and attack the queen with Bd3. Bxf3 was required when the knight can come to e5",
        "10. Be2": "? misses the win by Bd3 when blacks c6 knight falls, but white still has a definite advantage after Be2",
        "10... Bxf3": "black realises the need to play Bxf3, anything else gives white even more of an edge",
        "11. Bxf3 e6": "either that or Ne5, e6 looks stronger as it allows the dark square bishop to be developed more quickly",
        "12. Bg4": "?",
        "12... Qe5": "? black should have played Qe4 winning a pawn, when white would have to fight hard to show an advantage.",
        "13. Qe2 Bb4+": "black forces the white king to move as Bd2 loses to 14...Bxd2  Kxd2 15. Qxb2  Ke3 16.Qd4  Kf3 17.Ne5 ",
        "14. Kf1 Ne7": "Nd4 is more active, but black might do better to play h5 or f5 driving away the light square bishop as the pin on the e6 pawn is quite strong.",
        "15. dxe6 fxe6": "again h5 attempting to drive the bishop away is prehaps a better try.",
        "16. a3 Bd6": "prehaps wrongly black aviods the exchanging of dark square bishops by Bc5",
        "17. f4": "although the white king looks in danger after this move in fact he is not, the black forces are in no position to attack the slightly exposed white king",
        "17... Rhf8 18. Kg1": "? Ke1 was better although this seems much more natural, trying to tuck the king away in the corner is bad here, not only does it block the kings rook it allows black a powerful rook sacrifice in Rxf4, when black will be firmly on the offencive",
        "18... Qe4": "to be honest i didn't even consider the sacrifice Rxf4 here, its quite difficult to get out of the defencive mind set.",
        "19. Bf3 Qf5 20. g4 Qf7": "the black pieces are now very passive and so can in no way exploit the exposed white king, whites pieces however are very threateningly placed, the two adjacent bishops look especially powerful",
        "21. f5": "prehaps wrongly white presses on with his kingside pawns, i think a better plan would be to release the kings rook and start a kingside attack",
        "21... exf5 22. Bxa7 Rde8": "from a purely analytical stand point it is probably correct to trap the bishop with b6 and allow the black king to become exposed leading to a very tactical position with both kings exposed and white on the offencive. in such postions it is easy to overlook some tactics and lose, so i rejected traping the bishop as i thought i was more likely to make a mistake",
        "23. Qd3 fxg4 24. Bxg4+ Nf5": "forced, obviously black can't move his king into the pin on his d6 bishop",
        "25. Rf1 g6": "the knight needs to be secured",
        "26. c5": "the only try for an advantage, white needs to keep his attack going and make sure the black pieces remained hemmed in as if the blacks forces unwind whites exposed king and trapped rook will mean black will be easily winning",
        "26... Be5": "better than Be7 when blacks pieces are more cramped",
        "27. c6": "again the only try, attempting to expose the black king",
        "27... b6 28. Qa6+": "as so often in chess the threat is stronger than the execution, here Rd1 with the threat of Qa6 was far stronger",
        "28... Kd8 29. Rd1+ Bd6": "if white had played Rd1 on move 28 black would have to have played Bd6 anyway now white wins the b pawn but it is not enough as the black forces are ready to spring into action",
        "30. Bxb6 Ke7": "? not nessisary here, black should immediatly activate his forces with Re4! when it is whites king who is in danger not blacks. black now decides to move his king over to the kingside to find cover",
        "31. Bf2": "a good move, but the sacrifice Bxc7 is also very strong",
        "31... Kf6": "the king continues his walk to the kingside",
        "32. Kg2": "white frees his kings rook, relocating his queen by something like Qd3 also looks good",
        "32... Kg7": "here black might want to consider activating his forces with moves like Qb3 or Re4, the computer sees a very strange move that it suggests is best by a long way, but i doubt there are many human players that would have played 32....Kg5!! ",
        "33. Rhf1 Kg8": "? the king is fine on g7, this just unneccisaryly lines the king and queen on the a2-g8 diagonal, black should be looking for ways to activate",
        "34. Bf3 Ne7": "Qf6 was a better way to prevent the pin",
        "35. Bh4 Reb8": "! a cunning defence, the exclaim is not for the actual strength of the move but for the chances it creates, the simple Kh8 was stronger but this move gives black fighting chances instead of settling for a position where white has all the play",
        "36. Bd5": "?! this is what black was playing for, b4! blocks all blacks counter play.",
        "36... Nxd5": "?! slightly inaccurate move order as white has an extra possiblility in this line, the immediate Rxb2  was stronger",
        "37. Rxf7 Rxb2+": "here is where white has the extra chance with Rf2 with a win, if this were played a move earlier black would have to play Kg1 as after Rf2 black wins by Rxf2 ",
        "38. Kg1": "? white misses the best chance in Rf2 and now black has real chances, at least for the draw",
        "38... Rxf7 39. Qc4": "?? this move just loses on the spot, white wins a whole rook in fact and keeps the initative. Bg3 was the only try for an advantage. Rxd5 was probably best when white should give up up his bishop to prevent the draw",
        "39... Ne3": "Game over, blacks advantage is huge, white can't even win the knight after it takes the rook",
        "40. Qd4 Rg2+ 41. Kh1 Rxh2+ 42. Kg1 Nxd1": "now if Qxd1 black captures the bishop",
        "43. Be1 Rc2": "white now has the threats of Bh2  and Bc5 to deal with, white can easily resign here as both threats can only be met by Qd5 or Qd3 and black still has his mating threats ",
        "44. Bd2": "meeting the first threat but not the second",
        "44... Bc5": "White resigns. this game was full of errors from both sides but it goes to show that sometime this best move isn't always the move you should play, sometimes it pays to play an objectively weaker move that gives you opponent chance to go wrong, or that gives you counter play (35...Rb8) than the stronger move that gives your opponent a definate advanage in a quiet position. if your opponent has a winning advantage you should try to give yourself chances rather than play the 'best' move."
    },
    "url": "https://gameknot.com/annotation.pl/prog-rock-fans-1st-tournament?gm=3859",
    "gameName": "Prog' Rock Fans 1st Tournament",
    "players": "gunars (1615) vs. kingstuart (1497)",
    "opening": "Alekhine's defence (B02), Scandinavian variation"
}