{
    "moves": {
        "1. e4": "This is the first time I've played 1.e4 OTB in over 4 years. The last time I played e4 was against Robin Browne in Keighley, when I played a Closed Sicilian. I am still using this weapon online but have yet to face a Sicilian since returning to over the board chess. My last white game was 1.b3 against Simon Watson in 2017 but I'm attempting to be more ruthless now!\n",
        "1... e6": "I completely forgot that Rob was a French player, good job i've done some preperation over the past couple of months. My current line against this is a King's Indian Attack. Being a French aficionado myself, I know how solid it is. The KIA is actually most effective against the French and Booby Fisher used it himself against ...e6.\nAlternative variation: [Here's the line I'd looked at, in case I was playing Mike Bramson. I found some of his games on chesstempo.] 1... e5 2. Nf3 Nc6 3. d4 exd4 4. Nxd4 Qh4 [ So the dodgy ...Qh4 Scotch, it gets even more interesting...] 5. Nc3 Bb4 6. Be2 d6 [What is this all about? No idea, but Mike plays this. Best is just ...Qxe4 because otherwise the Queen is just misplaced on h4 after what I had prepared.] 7. O-O [According the the databases, everyone has just continued with the plan against Mike with Ndb5 but I preper just castles here.] Nf6 8. Nf3 [And white is just better here. So of course I was disappointed to not have been playing him. I'll refine this line even more and will hope to play him another time.]\n",
        "2. d3": "Of course 2.d4 is the main line but I've been working on the KIA so why not use it at the first opportunity. There will also be chances to take Rob into unfamiliar territory.\n",
        "2... d5 3. Nd2": "Alternative variation: [Of course not] 3. Nf3 [when] dxe4 4. dxe4 Qxd1+ [is at least equalising for black.]\nAlternative variation: 3. Nc3 [This could lead to a Closed Sicilian] c5 4. g3 Nc6 5. Bg2 Nf6\n",
        "3... c5": "So now we're into a Sicilian where I would prefer my knight on c3.\n",
        "4. Ngf3 Nc6 5. g3": "Pretty standard stuff here.\n",
        "5... Bd6": "Black makes it clear from early on that he wants to prevent my central expansion by putting an iron grip on e5.\n",
        "6. Bg2 Nge7 7. O-O Qc7": "Playing e5 is going to be impossible for white but I will still try and achive it.\n",
        "8. Re1": "Standard move although white can usually already play e5 at this stage, even after Re1 I still don't have sufficient control of the important square.\n",
        "8... O-O 9. Qe2": "I'm not sure whether this is best but I needed to try and get e5 in.\n",
        "9... f6": "Excellent move and I was worried that Rob might play this.\n",
        "10. Bh3": "Not a great move but the intention was rather than try to play e5 (as it wasn't happening), I was looking at ideas involving exd5, possibly exchanging on c8 and using the weakened light squared complex.\n",
        "10... Nb4": "Alternative variation: [ The idea behind Bh3 was something along these lines] 10... a6 11. exd5 exd5 ( 11... Nxd5 12. Bxe6+) 12. Bxc8 (12. Be6+ Kh8) 12... Raxc8 13. Qe6+ [But none of these variations really achieve anything. I was just trying to keep some form of plan regarding the centre as I wasn't yet prepared to turn my attention to a different area of the board.]\n",
        "11. Nf1": "Knight can maybe to to e3 and later work with the exd5 plan by going to the f5 square at some point.\n",
        "11... e5": "Weakening more light squares, this could help with securing f5 later on.\n",
        "12. Bxc8 Raxc8": "Black has possible ...c4 breaks now, bringing some life to the dark squared bishop. I will have to do something about that.\n",
        "13. c3": "I realised that I shouldn't have played this after I played it. This pawn is going to need to be on c4 to keep the Bishop and Queen locked away.\nAlternative variation: [An alternative was] 13. a3 Na6 14. c4 [when black's pieces are currently locked away.The a6 Knight is misplaced and the Bishop and Queen are simply biting on granite.]\n",
        "13... Na6": "It's obvious that black is intending ...c4 here when all of his pieces become active and suddenly the Knight will be able to go to c5.\n",
        "14. c4": "This seems like a bit of a waste of tempo but I would rather lose a move and prevent black's pieces from becoming active.\nAlternative variation: [I could have tried this] 14. exd5 Nxd5 15. Qe4 Qf7 16. a4 Rfe8 17. Nh4 [with an improved position to the actual game position. My pieces are more active and ...c5 is still being held back!]\n",
        "14... dxc4 15. dxc4 Nc6": "Black's Knight's are eyeing up the weak dark squares in  my camp but I also have some weak sqaures to target. Black has equalised but it's nothing more than equal at this stage.\n",
        "16. a3": "I can't prevent ...Nd4 but I didn't want a Knight coming into b4 as well. This is why I should have played a3 then c4, rather than c3 then c4.\n",
        "16... Nd4 17. Qd3": "There's going to be some tactics floating down the d-file but the Queen had to move somewhere and this seemed the most reasonable, albeit temporary, post.\n",
        "17... Rfd8": "This was obviously going to happen.\n",
        "18. Kg2": "The point of this was to prevent black from being able to capture on f3 with check and also to defend the Knight, in case I wanted to play Ne3 at some point.\n",
        "18... Bf8": "Black's playing everthing that I've expected so far, which is only helping me to play the best moves.\n",
        "19. Qc3 Qf7": "Now black is looking at playing ...f5 but I have the perfect response lined up for this.\n",
        "20. Ne3": "Keeping an eye on the f5 square.\n",
        "20... Nc7 21. Nd5": "Grabbing my outpost and preventing black from gaining any counterplay down the d-file.\n",
        "21... Nce6": "Crazy position but this is just a dead draw now.\n",
        "22. Nh4": "This is absolutely a Knight's game!\n",
        "22... Qh5": "I didn't understand why this was played but I reacted to in unneccesarily with the next move. Both of us were relatively low on time at this point so the remainder of the game was played at a fairly fast pace.\n",
        "23. f3 Kh8": "Possible idea of ... g5? I dunno, I wouldn't have minded that.\n",
        "24. Bd2 Qf7": "I wonder how many tempi have been wasted in this game!\nAlternative variation: [And if] 24... g5 25. Nf5 b5 26. Rad1 [ would probably have been even better for me but still drawish.]\n",
        "25. Nf5": "Not a great move but my plan now was literally just to hope some pieces get exchanged and then to just set up a solid fortress.\n",
        "25... Nxf5 26. exf5 Nd4 27. g4 b5 28. b3 bxc4": "Alternative variation: 28... Nxb3 29. Qxb3 bxc4 30. Qxc4 Qxd5 [Black missed a win]\n",
        "29. bxc4": "So black missed the tactic ...Nxb3 due to time pressure but that's part of the game and the draw is back on track now.\n",
        "29... Rcb8": "Pieces are about to start flying off now.\n",
        "30. Rab1 Rb7 31. Rb2 Rdb8 32. Reb1 Ne2 33. Qc2": "Obviously the Queen has to stay in touch with the Rooks.\n",
        "33... Bd6 34. Be3 Nd4 35. Qc3": "Nobody's really making any progress now and both our clocks are running dangerously low!\n",
        "35... h5 36. h3 Ne2 37. Qc2": "Here I was expecting a force of repetition.\n",
        "37... Nf4+": "Big decision to make now.\n",
        "38. Bxf4": "Decided to take with the Bishop as my Knight is stronger than black's Bishop in this position. My position is getting better but at the wrong stage of the game, getting into more time trouble means it's unlikely that I'll be able to make use of my advantage.\n",
        "38... exf4 39. Rb2b3": "Just side-stepping the Bishop going to e5 and hitting my Rook.\n",
        "39... Rb7xb3 40. Rxb3 Rxb3 41. Qxb3": "I think we had about 3 minutes each by this stage, if not less. Position is very drawish still.\n",
        "41... Qe8 42. Kf2": "Didn't want the Queen penetrating via e2 or e1.\n",
        "42... hxg4 43. hxg4": "Keeping things closed up.\n",
        "43... Qe5 44. Qd3 Qb2+ 45. Qe2": "Sacrificing a pawn with just 2 minutes on the clock, if black takes on a3 then I have a forced repetition on e8 and h4.\n",
        "45... Qd4+": "Alternative variation: 45... Qxa3 46. Qe8+ Kh7 47. Qh5+ Kg8 48. Qe8+ [and if] Bf8 [then] 49. Ne7+ Kh7 50. Qh5#\n",
        "46. Kg2 Be5 47. Ne7 Qd8 48. Ng6+": "Here with 90 seconds plus 10 second increments remaining and slightly more for my opponent, I decided to offer a draw. As my position was better here, he accepted.\n"
    },
    "url": "https://gameknot.com/annotation.pl/pudsey-a-vs-pudsey-b-farsley-liberal-club?gm=65533",
    "gameName": "Pudsey A vs. Pudsey B, Farsley Liberal Club",
    "players": "Ibbitson, Anthony (141) vs. Dean, Robert (154)",
    "opening": "French (C00), Reversed Philidor formation"
}