{
    "moves": {
        "1. d4 Nf6 2. c4 g6 3. Nc3 d5": "My favorite defense against 1.d4. It's one of the most elastic openings in chess with a lot of theory to learn and in which White has a plethora of plans to chose from. I like it more than the KID because it's more dynamic and more fun to play.",
        "4. cxd5": "The most principled approach after which White can build a strong pawn center and Black will gain counterplay by attacking it.",
        "4... Nxd5 5. e4 Nxc3 6. bxc3 Bg7 7. Rb1": "A strong prophylactic move, removing the Rook from a sensitive diagonal and pressuring b7, hampering the development of the Bc8.",
        "7... O-O 8. Nf3 c5": "The modern main line, highly disputed in the '90 and early 2000 years. So far Black is holding his own.",
        "9. Be3": "9.Be2 was the main idea, sacrificing the a2 pawn in order the gain a lead in development and maintain a flexible center.",
        "9... Nc6": "Attacking the center with tempo.",
        "10. Bc4": "This active looking move is the first slip. 10.Be2 was to be preferred.",
        "10... Bg4": "Now that the White Bishop is on c4, Rxb7 is no longer a threat in view of Na5.",
        "11. e5": "White cracks under pressure and breaks the nice center pawn phalanx. 11.0-0 was possible since after 11...Bxf3 12.Qxf3 cxd4 13.cxd4 Nxd4 14.Bxd4 Qxd4, White can recover the pawn with 15.Bd5",
        "11... Qa5": "Bringing the Queen into the fray with tempo and clearing d8 for a Rook.",
        "12. Qd3": "This is a bigger mistake than the previous two and should have been punished at once with 12...Bf5. To be honest that move never even entered my mind once I saw I could gain a clear advantage by dismantling the center.",
        "12... Bxf3 13. gxf3 cxd4 14. Bxd4 Nxe5 15. Qe4": "15.Bxe5 Qxe5+ 16.Kf1 Rac8 17.Rxb7 Rfd8 would have left Black perfectly placed to exploit the uncastled White King.",
        "15... Nxc4": "After this White resigned. The long forced line in which Black wins a piece goes like this: 16.Bxg7 Nd6 17.Qe5 Qxa2 18.0-0 Nc4 19.Qd4 Nd2 20.Ra2 Qc2 21.Kg2 Nb3 22.Qe5 f6 23.Qc7 Kxg7. The Knight's war dance is quite impressive and in the course of a few moves he manages to threaten every White piece."
    },
    "url": "https://gameknot.com/annotation.pl/punishing-early-aggression?gm=25846",
    "gameName": "Punishing early aggression",
    "players": "bracun (1654) vs. nyctalop (1868)",
    "opening": "Gruenfeld (D85), modern exchange variation"
}