{
    "moves": {
        "1. e4 d5": "This was a great game for black considering white was a higher rated player. Note how Black set the tempo throughout the entire game and limited white's development. ",
        "2. exd5 Nf6 3. Nf3": "White NF3. What would your move of been in this scenario? ",
        "3... Bg4": "Bg4- pinning white knight. Perhaps a gambit.",
        "4. Be2 Qxd5": "Queen captures white pawn. I considered capturing with Kf6 but opted for the Queen",
        "5. h3 Bh5": "White advances pawn to kick out Bishop. I could of traded pieces with the Knight but too early and decided to pull back to Bh5",
        "6. Nc3 Qe6": "White Nc3. Here is where it starts to get interesting. I thought about where to put the Queen. Could of pulled back or moved to lets say Qb6.  Actual move limited any development of Black Bishop. However actual position moved pins white bishop. If white moves Kf3 possible attack on white queen or check on white King. What would you have done?",
        "7. O-O Nbd7": "White castles. Black responds with Nd7 to add more pressure to White's King side. ",
        "8. d3 h6": "White advances pawn to d3. Black responds with h6. This may seem like a wasted move for black, I thought about it for a while before making the move as my black bishop has no chance in development now however what it does do is eliminate any significant advancement of white's bishop to attack Nbf6",
        "9. Re1 g5 10. Be3 Rg8": "Black supports pawn with Rg8. If you look at the board now, white is in serious trouble and quite limited with options. The game is pretty much won for black now. Do you agree? What would your move be for white at this stage?",
        "11. Qd2 Bxf3": "White plays Qd2. Black captures White Knight. ",
        "12. Bxf3 Ne5": "After white takes black knight, black moves Ne5. Keeping the pressure on the F3 square",
        "13. Bd1 g4 14. h4": "White did not take pawn on g4, if he did plenty of options for black to retake pawn (g4 protected by 4 pieces). \nIs h6 square for black a risk? Not in my opinion. ",
        "14... Nf3+": "Black advances Nf3 checking the white king. White has to take black Knight but with which piece? In either scenario white will be soon check mated. ",
        "15. Bxf3 gxf3": "Expecting a resignation from White at this point. If you were white, can you figure out a solution?",
        "16. Bg5 Qg4": "White resigned. "
    },
    "url": "https://gameknot.com/annotation.pl/puzzle-for-white?gm=62393",
    "gameName": " Puzzle for White",
    "players": "timmulvey59 (1478) vs. jokeriswild (1320)",
    "opening": "Scandinavian defence (B01)"
}