{
    "moves": {
        "1. d4 Nf6 2. e3 d6": "The idea is to play the Budapest anyway, with e5, and if dxe5, Ng4, exd6, Bxd6, with some developement for the pawn. ",
        "3. Nf3 e5": "I'll be able to throw in the Q's exchange... maybe just a plain mistake. ",
        "4. Bd3": "But my opponent blundered like this!",
        "4... e4 5. O-O": "Good. At least, I'll spend a tempo for the piece. ",
        "5... exd3 6. Qxd3 g6": "? d5 was necessary. Ne5 is less dangerous than c4, Nc3...",
        "7. b3": "Normally, if I plan to castle, my B will be defended, and his won't. So the opposite fianchettoes - as a general principle - are stronger when the K is castled and the B defended. Otherwise, they can be a weakness. ",
        "7... Bg7 8. Bb2 d5": "Finally I \"saw\" that this move was dued, but now maybe now. Anyway, white was too shy in not taking advantage of e4 at once, and I had to put something in the way. ",
        "9. Nbd2": "It's true I'm not developing, but I have no hurry since white's has to define his choices for me to react adequately. I didn't want to compromise myself to some Nc6, Qb5 or things like that. ",
        "9... Qe7": "I further secured e4, confident in being able to castle the next move or so. ",
        "10. Ne5": "It's ok, nothing to worry about - still. ",
        "10... Nbd7": "If he exchanges, I free my lsb. If he doesn't, I'll have still time to castle. ",
        "11. c4": "White got aggressive, finally. This is a nice move, intending to open the c column... white is playing very well. ",
        "11... c6": "The plan will be like that: ",
        "12. cxd5 Nxd5": "Now, my N has nices outposts on b5 (with care), or f4 - in case of e4. ",
        "13. Nxd7 Bxd7": "White \"must\" play e4 now...",
        "14. e4": "Ah!",
        "14... Nb4": "If Ba6, NxQ, BxQ, KxB.",
        "15. Qc4": "Difficult to see a a mistake. The Q has only f,g,h3 to go. ",
        "15... Be6": "WQ is not trapped, but...",
        "16. Qc3 c5": "This is a very nasty move, in my view and if I am not omitting something. ",
        "17. Ba3": "? but it was not easy for white to untangle himself. Qc1 must have been taken into consideration, despite the ugly look. ",
        "17... Bxd4 18. Bxb4": "?? Overwhelmed by surprise, white further blunders. ",
        "18... Bxc3 19. Bxc3 O-O": "Now, despite the material advantage, as usual, I just \"felt\" I had a single, logical way to proceed. And maybe I was wrong. ",
        "20. Rad1 b5": "...a pawn's storm, supported by my Q and B, not to mention the Ra8 behind . A \"gimme\".",
        "21. Rfe1": "What else?",
        "21... a5 22. Nf3": "Still nothing dangerous. I can go on. ",
        "22... b4 23. Bb2": "? Be5, threatening Bd6 was much better. Not because on disadvantage you shouldn't threat the most with your pieces, ",
        "23... a4": "White's central power gets undermined on the flanks. White was probably very surprised not to seeing my heavy pieces standing still. ",
        "24. Ne5": "Now, the threat is: if I move Be6, Rd7 will be annoying. But I need my B for my attack on white's b3. Don't I?",
        "24... axb3 25. axb3 Ra2": "Let's try like this.",
        "26. Ba1 Bxb3": "It seems a mistake, because it allows the annoying Rd7, but Black (me) had a response that practically seals the game for him. ",
        "27. Rd7": "As predicted. Now: what would have been black's \"master-like\" move? If RxBha1, white is forced to retake RxR, after which QxNe5 seals white's fate. But I was \"even farther\" than that, with this \"!?\" move. ",
        "27... Qf6": "Was it correct? It adds to the before threats Qxf2+ and mate. ",
        "28. f4": "Very well, almost the only answer. ",
        "28... Qxf4": "The threat persists. ",
        "29. Rf1": "Now is tempting Qe6+, Kh1, Qe2, Rg1, but then I had no more fork.",
        "29... Rxa1": "...like this one. White has to take, or mate. ",
        "30. Rxa1 Qxe5": "...and black wins for free the N, with overwhelming material advantage, that made white resign, honourably. "
    },
    "url": "https://gameknot.com/annotation.pl/puzzle-like-tactics?gm=60488",
    "gameName": "Puzzle-like tactics",
    "players": "svsmani (1359) vs. damafi (1413)",
    "opening": "Queen's pawn game (A45)"
}