{
    "moves": {
        "1. e4": "Nothing unusual here....",
        "1... d5": "I started my game aggressively, something just may have irked me at the time of starting this game and felt like lashing out!",
        "2. exd5": "I've read that if you are going to exchange then you should take with the e-pawn so...of course these nuggets of \"advice\" are always debatable..",
        "2... Qxd5": "The book usually advises against advancing the queen during the first few opening moves of a game and as we will see, you can sometimes put the book down and just play how you feel....",
        "3. Nf3": "I expected my queen to be threatened...",
        "3... Nc6": "As she wasn't I left her where she was and started with my development as usual..",
        "4. Be2 f6": "In case i have to retreat my queen, this move should also announce that I plan to castle on the queenside...",
        "5. Nc3 Qf7": "Like so...",
        "6. b3 e5": "Releasing my K'sBishop and taking hold of d4..",
        "7. d3 Bd7": "Preparing to castle, so far this game has been fairly tame but as you will see in a few moves time this will have all changed...",
        "8. Bb2 O-O-O": "Now my king is safe i can work out some kind of plan of attack..",
        "9. O-O": "Hmm...",
        "9... g5": "I sometimes find advancing pawns toward the enemy king can work out very nicely when castling on the opposite side of the board so I don't hesitate..",
        "10. d4 Be6": "Pinning the pawn to the Queen...",
        "11. d5": ".....",
        "11... Bf5": "My knight is safe where it is...",
        "12. Bc4": "Hoping for a hidden attack on my queen...",
        "12... Qg6": "Dodging the bullet...",
        "13. Rc1 Nb4": "Putting pressure on the c5 pawn....",
        "14. g4": "This move baffles me??",
        "14... Bxc2": "So I carry on with my own plans...",
        "15. Qe2 Bd3": "Keeping up the pressure...",
        "16. Bxd3 Nxd3": "This is a nice way for my knight to travel safely to f4..",
        "17. Rcd1 Nf4": "Now that is a nice little spot...",
        "18. Qe3 b6": "Sneaky...",
        "19. Ne1 Bc5": "Now my Bishop has found a nice home too!",
        "20. Qf3": "The queen has to stay within sight of h3 to guard against +",
        "20... h5": "The most attacking move I could find, if I can open lines for my rook...",
        "21. h3 hxg4": "The only way to proceed really now the h file will be under my control, the white king will be frozen to the spot!",
        "22. hxg4 Qh6": "A quiet but deadly move I feel, this is where I am in the actual game, I can't see a defence for white at all..23.Qg3 Qh1#,23 Qg2 Nxg2 24 Kxg2 Qh3+ 25 Kg1 Qh2 (Qh1)# 23 Qe4 Qh2#"
    },
    "url": "https://gameknot.com/annotation.pl/qalice-com-game-short-sharp-shock?gm=27093",
    "gameName": "QAlice.com game.Short sharp shock!",
    "players": "  Constante   (2044) vs. daveyr18    (2033)",
    "opening": "Scandinavian defence, Lasker variation (B01)"
}