{
    "moves": {
        "1. d4": "Trap and counter trap makes this an entertaining game.",
        "1... d5 2. c4 e6 3. Nc3 c5": "Dr. Siegbert Tarrasch, German grandmaster considered this to be the only correct defense against the Queen's gambit.",
        "4. cxd5 exd5": "The main problem for Black in Queen's Gambit opening is his bishop on c8. Tarrasch's idea was to solve that problem by this exchange 4...exd5. Now the bishop on c8 is ready to take part in the game much early. The drawback of this opening is the Black pawn on d5 which is likely to become isolated which could be a double edged position. The struggle revolves around the Black's isolani on d5 whether it is a strength or weakness. ",
        "5. Nf3 Nc6 6. g3": "Polish super grandmaster, Akiba Rubinstein discovered the best set up against the Tarrasch defense with 6. g3 and almost demolished the Tarrasch defense. His idea was to fianchetto White's bishop on g2 and put pressure on the d5 pawn. Recently Gary Kasparov played this opening in his games and so interest has revived in the Tarrasch defense again.",
        "6... Nf6 7. Bg2 Be7 8. O-O O-O 9. Bg5 cxd4 10. Nxd4": "Now the d5 pawn is blockaded and the battle begins.",
        "10... h6 11. Be3": "11. Be3 is consistent with the blockade of the d5 pawn. White is tightening his grip on d4 square.",
        "11... Re8 12. Rc1 Bf8 13. Nxc6 bxc6": "White exchanges knights which brings a support to the d5 pawn. The pawns at d5 and c6 are separated from other pawns. They cannot be supported by pawns and so black has to support them using his pieces. Such a formation of pawns is called \"hanging pawns\". If we look at the pawn structure, Black has 3 pawn islands and White has 2 pawn islands. Pawn islands are a weakness in the endgame. So the strategy for White is to blockade the hanging pawns and force Black to tie down his pieces in defense and to breakup the position at the right time and proceed to the endgame.",
        "14. Na4": "14. Na4 increases the blockade of the c6 pawn which is also attacked by the White Rook on the c-file. The square c5 is under pressure from White's knight on a4, bishop on e3 and Rook on c1.",
        "14... Qa5": "14...Qa5?! gives some support to the c5 square but this is a pawn sacrifice. Black is probably not inclined to support the hanging pawns and tie-down his pieces. I also thought that this is a trap if the c6 pawn is taken. Black has declared aggressive intentions. After a closer look at the position, I played the next move.",
        "15. Rxc6": "One of the hanging pawns is taken.",
        "15... Bd7": "15...Bd7 was the retort from Black forcing the Rook to move and Black's bishop on c8 makes its first move with an X-ray attack on White knight on a4. Is White wrong in grabbing a pawn? Tarrasch's ideas are beginning to take shape.",
        "16. Bd2": "This was a move attacking the Black's queen which gives White a tempo. Black has to protect his Queen.",
        "16... Qb5": "Black attacks White's Rook a second time and saves his queen.",
        "17. Rxf6": "17. Rxf6! grabs a knight. Now White has sacrificed material !!! The game is becoming interesting. ",
        "17... gxf6": "Black gladly accepts the Rook. ",
        "18. Nc3": "White takes his knight out of the firing line and simultaneously attacks Black's queen and the d5 pawn, thus gaining another tempo.",
        "18... Qa6 19. Nxd5": "Now the hanging pawns have vanished and material is even. White's Rook sacrifice was in fact a decoy. Now Black king's castle is open on the g-file. White's knight attacks the f6 pawn.",
        "19... Rac8": "A good move. Black removes his Rook on a1 from the discovered attack from White's bishop on g2. The Rook occupies its position on an open file.",
        "20. Bc3": "20. Bc3 is a double attack. The bishop attacks the f6 pawn and White's queen X-ray attacks the bishop on d7. White's pawn on a2 is hanging. The game is now in the realm of tactics.",
        "20... Bg7": "Black protects his f6 pawn. ",
        "21. e3": "A quiet move in an explosive situation. The White queen's path to the g-file is open.",
        "21... Bb5": "Black removes his bishop to safety while attacking White's rook on f1. Black gains a tempo. Tactics are in full swing.",
        "22. Re1 Bc4": "Now Black attacks the knight and also the a2 pawn.",
        "23. Qg4": "White's Queen occupies the g-file and intensifies the pressure. The bishop on g7 is pinned and Nxf6 is threatened.",
        "23... Kh8": "Black moves his king and frees his g7 bishop.",
        "24. Nxf6": "White takes the f6 pawn anyway and sacrifices his knight. What is he gaining? A measly pawn?",
        "24... Bxf6": "A crucial position which White had planned for. Now Black's bishop on f6 is protected by the queen on a6. If the queen was not there, White can play 25. Bxf6+ Kh7 26. Qg7 mate. Is there a way to divert the queen?",
        "25. Bb7": "That is the move!!! If the bishop is taken then Black is mated. If not, Queen has to move and REMAIN on the 6th rank to protect her bishop on f6, then Bxc8! wins back the exchange for White and he will be 3 pawns plus which is sufficient to win the game. So, black resigns. Rubinstein's bishop did prove its value.\n\nHope you enjoyed the game as much as we did. I thank Black for his trap and tactics which allowed us to have this entertaining game."
    },
    "url": "https://gameknot.com/annotation.pl/qgd-tarrasch-defence?gm=29307",
    "gameName": "QGD Tarrasch Defence",
    "players": "dongoodman (2030) vs. rlcpw (1914)",
    "opening": "QGD (D34), Tarrasch, Prague variation, 9.Bg5"
}