{
    "moves": {
        "1. e4": "1 e4 the standard opening mowl has used for a while, after a little research(his past-game history) I found that he had not often faced the Center-Counter defense my current favorite reply to e4 at the time.",
        "1... d5": "And so I enter into the Center-Counter defense.",
        "2. exd5 Qxd5": "I opted to retake with my Queen even with the loss of time after 3. Nc3, the other option 2... Nf6 seems a little passive to me. From here we will follow the main line through 6... Bh5",
        "3. Nc3 Qa5 4. d4 Nf6 5. Nf3 Bg4 6. h3 Bh5 7. Bc4": "This is the point where White deviates from the \"book' opening, with this move I feel the position is equal.",
        "7... Nc6": "Now deviating from the standard I continue with my development.",
        "8. Bb5": "I would have gone for 8. g4 forcing the bishop back even further, of course taking into account the weakening of the King's protection once castled.\r\n\r\nBut White opts for a different approach and just as in the Ruy Lopez, White pins my Knight to my King with one small difference...\r\n\r\n",
        "8... O-O-O": "The LSB and Queen are not in the way so I opt to castle Queen-side and prepare for a pawnstorm once White eventually castles King-side.",
        "9. Bxc6": "White takes the Knight and in doing so, disrupts my pawn structure protecting my King. Although White surrenders the bishop pair in doing so.",
        "9... bxc6": "The logical reply despite the weakening of my King's defense.",
        "10. g4": "Now White pushes the pawn to g4 forcing my LSB to g6 ",
        "10... Bg6": "Forced",
        "11. O-O": "Not a bad move, yet Ne5 looks better. From e5 the Knight is in a great outpost to help the assault against the enemy King and it would have taken a several moves before I could have safely forced the Knight back.",
        "11... Nd7": "A defensive measure hindering Ne5",
        "12. Qe2 h5": "I feel it is time to open up White's position a bit. Since White has already weakened his King's protection, I will weaken it even more.",
        "13. Rb1": "White is readying his pieces for a pawnstorm of his own.",
        "13... hxg4": "hxg4 weakening White's pawn structure protecting his King.",
        "14. hxg4": "Forced",
        "14... e6": "Preparing Bd6 aiming my DSB towards White's King.",
        "15. a3": "This is where the game starts to get interesting, who's plan will come to fruition first? With a3 White prepares for b4 attacking the Black Queen while at the same time starting his pawnstorm.\r\n\r\nI feel that Bf4 was probably the best move here, it would have hindered Bd6(which leads to an eventual checkmate). ",
        "15... Bd6": "With this I align another piece towards the King-side. After this move with the h8 rook already aiming down the h file hindering the White King's movement  I get the first inklings of a brilliant combination.",
        "16. b4": "White continues with his plan and pushes his pawn to force back the Black Queen.",
        "16... Qb6": "Forced, the only safe square for the Black Queen.",
        "17. Be3": "White lines up yet another piece towards the Black King, while at the same time setting up a discovery attack against the the Black Queen with d5 should the opportunity arise.",
        "17... Qb7": "Defensive manuever to both protect my King and pull the Queen out of harms way. This also lines the Black Queen up on the a8-h1 diagonal that will come into play later.",
        "18. a4": "White continues with his pawnstorm, inching closer and closer to the Black King.",
        "18... Rde8": "This lines up another piece to White's King-side, towards the White Queen and gives the Black King a little room to move.",
        "19. b5": "White continues the pawstorm. a5 was another viable option.",
        "19... c5": "This opens the a8-h1 for the Black Queen, the combination is taking shape.",
        "20. dxc5": "White takes the pawn and attacks Black's DSB.",
        "20... Nxc5": "Removes the current threat on the DSB so that it can continue to put pressure on the b8-h2 diagonal.",
        "21. b6": "I feel this is the turning point of the game, White underestimates the danger his King is in. Bxc5 was best, pulling the DSB off the b8-h2 diagonal and removing a little pressure.",
        "21... Be4": "My pieces are all lined up, so I begin the assault. It is all or nothing, I will rise victorious or go down in flames.",
        "22. bxa7": "White threatens a8=Q, he sees the danger yet he gambles that his plan will win out or maybe that he can divert my plan.",
        "22... Bxf3": "I continue the assault.",
        "23. Qxf3": "White retakes with his Queen, in an atempt to pull my Queen away from my King's Defense.",
        "23... Qxf3": "I retake, all I must do now is move my Bishop to h7. Victory is so close I can almost taste it.",
        "24. Rb8+": "24. Rb8 ?? this is a major blunder, a8=Q would have pulled the Black Queen back relieving the pressure on the White King for a while longer. This move hands the win to Black, and White does not even see it.",
        "24... Kd7": "Forced, a minor delay.",
        "25. a8=Q": "It does not matter what move White makes, he is only prolonging the inevitable.",
        "25... Bh2#": "Checkmate!! And so the final piece moves in to complete the combination and secure the victory for Black."
    },
    "url": "https://gameknot.com/annotation.pl/qt-tournoi-vii-center-counter-defense?gm=19660",
    "gameName": "QT-Tournoi VII: Center-Counter Defense",
    "players": "mowl (1779) vs. kightsatthereti (1960)",
    "opening": "Scandinavian defence, Lasker variation (B01)"
}