{
    "moves": {
        "1. d4 d5 2. c4 dxc4": "But since I didn't tried  that for a long time I accepted this time to see how it went.",
        "3. Nf3 Nf6 4. e3 e5": "Not very good, my first mistake here. I didn't checked the possibility that the knight could capture the pawn. I was expecting dxe5 and force a early queen exchange. But even that was a bad play because the knight in f6 and the c4 pawn would be under attack.",
        "5. Nxe5 b5": "I think that this should have been my best play earlier, so, I did it now.",
        "6. a4 c5": "Again not a good play. My queen side became all opened and my pawns under stress.",
        "7. axb5 Be6": "Trying desperately to save something. ",
        "8. Qa4": "Not a bad play, but I think that Bxc4 or Kxc4 would be better.",
        "8... cxd4": "I was expecting the b5 advance and protect the check with a knight, so I tried to gain some strength in the center and eventually put some pressure on the white king.",
        "9. Bxc4 dxe3 10. b6+": "Now here comes the attack!",
        "10... Nbd7": "Although my knight became pinned my rook gain some mobility.\n",
        "11. b7": "That was not a strong play... the pawn in e3 is in a dangerous position a exf2+ puts the king in check. White b6 pawn although under attack and seemingly unprotected was not in danger.  ",
        "11... Rb8": "Now the pawn is in danger.",
        "12. Bxe3 Rxb7": "A glimpse of hope. The rook controls the b line and make way to Bb7+ putting the bishop in c4 unprotected, and allowing black to castle.",
        "13. Bxa7 Bb4+ 14. Nc3 Bxc4": "Now white is under pressure without the possibility to castle king side.",
        "15. Nxd7": "Not a good play, black d7 knight was pinned. Kxc4 was a much better play",
        "15... Qe7+ 16. Ne5+": "Now the knight is pinned and unprotected.",
        "16... Bb5 17. Qb3 Qxe5+": "White is losing by one bishop and the king is out in the open.",
        "18. Kd2 Rxa7": "With this \"strange\" move I was hoping that my opponent made a mistake. And if that didn't happen my interest now was exchanging some pieces and going to end game with and knight advantage.",
        "19. Rhe1": "That was the mistake I was hoping. The best play would have been 19. Rxa7 Qd4+ 20. Kc1 Qxa7 21. Qxb4",
        "19... Ne4+ 20. Kc2 Rxa1 21. Qxb4": "Not a good move again, the knight is now freed so Rxe4 would have been better. Although it would lead to 21. Rxe4 Qxe4+ 22.Kxe4 Ba4 pinning the white queen with the bishop. ",
        "21... Rxe1 22. Nxb5 Re2+ 23. Kb3 Rxb2+": "I enjoyed this game because of the great comeback and it also taught me to stay away from the queen gambit. A thanks to my opponent for this thrilling game."
    },
    "url": "https://gameknot.com/annotation.pl/queen-gambit-accepted?gm=30841",
    "gameName": "Queen Gambit accepted",
    "players": "kron (1225) vs. danaboca (1379)",
    "opening": "QGA, 4.e3 (D25)"
}