{
    "moves": {
        "1. Nf3": "I usually play the Catalan, but I like to get to the main Catalan position by transposition, mainly to avoid the QID.",
        "1... Nf6 2. d4 d5 3. g3": "Now my plan becomes apparant to my opponent; I want to transpose into a Catalan.",
        "3... e6 4. c4": "And with this move we reach the starting position of the Catalan.",
        "4... c6": "Known as the triangle set-up, it is reminiscent of a Slav in the QGD, and it is a solid option against the Catalan.",
        "5. Bg2 Be7 6. O-O O-O 7. Nc3": "Not the most common move, but it develops the Knight to its preferable square, and prepares the advance of e2-e4.",
        "7... Nbd7 8. Nd2": "!? An interesting and by no means bad move. White now plays with the sole intention of play e4 and getting a nice central pawn structure, extra space and more active pieces.",
        "8... Qc7": "Not a great move, as the queen will have no great future on c7 and will be subject to annoying ideas such as Bf4 for white, which comes later on.",
        "9. e4 dxc4": "After this move, white has a dream position; great pawn structure, lots of space and good, active pieces.",
        "10. Nxc4 e5": "Black must counter-attack in the centre or white will slowly squeeze black's awkward position. Pawn breaks are one of the key ideas when you have a small amount of space, and exchanging pieces is another objective when in a tight area, as the less pieces you have the less space you need.",
        "11. dxe5 Nxe5 12. Bf4": "And here we see the drawback of 8... Qc7. This pin becomes very annoying.",
        "12... Nfd7 13. Qh5": "I also considered 13. Bh3, but conceded after 13... Bf6 black was not too bad.",
        "13... Bd6": "?! This move leads to a great middle game for white, where my space advantage is enough to concrete a solid advantage.",
        "14. Nxd6 Qxd6 15. Rfd1 Qg6": "15... Qe7 was perhaps better, but still not pleasant for black.",
        "16. Qxg6 Nxg6 17. Bd6 Re8": "Let's stop here for a second... First of all, the first thing I notice in this position is blacks lack of development. His lone bishop sits on its starting square, blocked in by the knight and with no real good squares or diagonals to aim for, as well as disconnecting the two rooks, while my pieces are on great squares, and each has its own job and ideas for future improvement. Next, black's position is very cramped, his only hope of gaining space is pawn breaks, and he lacks any good ones at the moment. We now see black struggle to place his pieces on good squares, and attempt to gain space by pushing pawns, which leaves multiple weaknesses in his position.",
        "18. f4": "Gaining more space and controlling squares which black would to put his Knights on.",
        "18... Nb6 19. b3": "Preventing Nc4.",
        "19... Nf8": "Not a good move, black's position is really getting horrible now.",
        "20. Rd2 f6": "Here, I had a choice: give the bishop the e6-square and let him stay on a decent diagonal, or play f5, preventing this but giving the e5-square up to black's knights.",
        "21. f5 Nfd7 22. Rad1 Kf7": "? A waste of a move in my eyes, the king becomes a target on f7 in time.",
        "23. a4": "Threatening 24. a5",
        "23... Ne5 24. a5 Nbd7 25. h3 b6": "Black finally gets a pawn break in. YES!",
        "26. Ra2 Ba6 27. axb6 axb6 28. Rda1 Bb7 29. Ra2a7 Nd3 30. Ra1a2": "Of course 30. Rxb7 allows 30... Rxa1+, this move protects the rook, threatening Rxb7.",
        "30... Rxa7 31. Rxa7 Bc8 32. Bf1": "Hoping for Bc4+ followed by winning the rook, but unfortunately it was not to be :(",
        "32... Nd3e5 33. b4 Kg8 34. b5 c5": "Giving me total control of the d5 square.",
        "35. Nd5 Nf3+": "Desperation.",
        "36. Kf2 Nd4 37. Ne7+ Rxe7": "37... Kh8 38. Ra8 is losing for black.",
        "38. Bxe7 Ne5 39. Bd6 Nef3 40. Bc4+": "And black resigned, as Ra8 was coming next, and black would not last long. Thank you for watching this game, which was ultimately won by black's poor opening play. See you soon!"
    },
    "url": "https://gameknot.com/annotation.pl/queensland-junior-chess-championships-2015?gm=59246",
    "gameName": "Queensland Junior Chess Championships 2015",
    "players": "Callum Wilson (1338) vs. Timothy Hariss (1562)",
    "opening": "Reti opening (A05)"
}