{
    "moves": {
        "1. Nf3": "A good move championed by Reti which has become, like almost everything else in modern chess, very theoretical.",
        "1... Nf6": "The most logical answer would have been 1...d5 but I feel this plays right into White's intentions. This move usually transposes to a semi-closed game.",
        "2. c4 g6 3. Nc3 Bg7": "I could have played 3...d5, trying to transpose into the Grunfeld, but White can obtain a slight edge due to the fact that he hasn't moved his d-pawn after 4.cxd5 Nxd5 5.e4 Nxc3 (if Nb6, White can play 6.d4 and have a very solid center) 6.dxc3 Qxd1+ 7.Kxd1 and White has the endgame initiative.",
        "4. e4": "If 4.d4, I would have played 4...d5. This move can transpose to either the KID or the Maroczy.",
        "4... d6": "After 4...c5, White plays 5.d4 anyway since 5...cxd4 is the Maroczy bind, something which not many players enjoy as Black. An interesting possibility is after 4...c5 not recapturing but allowing White to gain space with d5.",
        "5. d4": "The KID classical main line. A very sharp opening in which White usually attacks the Q-side while Black tries to smash through on the K-side.",
        "5... O-O 6. Be2 e5 7. O-O Nc6 8. d5 Ne7 9. Qd3": "An unusual move and not a very good place for the Queen.",
        "9... Nh5": "This move is dual purposed since it intends both Nf4 and f5, both taking advantage of the misplaced Queen on d3.",
        "10. g3": "Guarding against Nf4 but now the King's position is slightly weakened.",
        "10... f5": "The typical KID counterplay.",
        "11. Ng5": "Threatening Bxh5 and unblocking the f-pawn, while also intending a subsequent Ne6.",
        "11... Nf6": "Retreating with tempo. White can't hold the center anymore.",
        "12. Ne6": "This feels a bit rushed. This is played only after Black loses a tempo with h6 and weakens his King's castle in the process.",
        "12... Bxe6": "Forced obviously.",
        "13. dxe6": "White's compensation lies in the d5 square and the potential pin on the a2-g8 diagonal. Black will have to maneuver for quite a bit before he can capture the stranded e6 pawn and White hopes that that will give him enough time to create serious threats.",
        "13... fxe4": "Liquidating the center and opening the f-file.",
        "14. Nxe4": "Because of the Qd3, White is forced to immediately recapture and divert his Knight from the ideal d5 square.",
        "14... Nf5": "Clearing the way for the Queen to come to e7 and preparing to play Nd4.",
        "15. g4": "Unnecessary. Black was going to move this Knight anyway. Now White has weakened a lot of black squares around his King.",
        "15... Nd4": "Now the e6 pawn will surely fall.",
        "16. f4": "Going for complications but weakening  the K-side even more. White dreams of supporting the e6 pawn with f5 but that's not going to happen.",
        "16... Nxe4 17. Qxe4 Qh4": "Activating the Queen and preventing f5 because of the pin on the 4th rank. Now Black can bring his last Rook into play.",
        "18. e7": "Sacrificing the pawn in order to bring back the Black Queen from her menacing position.",
        "18... Nxe2+": "Eliminating a defending piece and a potential intruder on the a2-g8 diagonal.",
        "19. Qxe2 Qxe7": "Black is now a clear pawn and he has nothing to complain about.",
        "20. g5": "This pawn weakens the K-side pawns but I guess White didn't want the Queen to come back to h4 any time soon.",
        "20... Rae8": "But now Black is simply winning. exf4 is the main threat.",
        "21. Qg4": "White gets off the e-file but now he's really starting to lag in development.",
        "21... exf4": "Finally the Bishop is activated as well.",
        "22. Rxf4": "A big blunder. But even after the better recapture, 22.Bxf4, White is in a lot of trouble after 22...Qe4.",
        "22... Qe1+": "Now Black gets a direct attack against the White King.",
        "23. Kg2 Rxf4": "Exchanging a defending piece.",
        "24. Qxf4": "This loses even more quickly that 24.Bxf4, even if that drops a full Rook.",
        "24... Re2+ 25. Kh3": "If 25.Kf3, Black mates with 25...Rf2+.",
        "25... Be5": "If White tries to save the Queen, he blocks his King and gets mated."
    },
    "url": "https://gameknot.com/annotation.pl/queen-misplacement?gm=26021",
    "gameName": "Queen misplacement",
    "players": "grandura55 (1659) vs. nyctalop (1915)",
    "opening": "Reti opening (A05)"
}