{
    "moves": {
        "1. e4": "Joe starts off with the usual.",
        "1... b6": "Dan played the Owen's Defense.  Since, for only the second time, I'm seeing that against two really strong players, there's still something for me to learn.  The first time I saw this was during the GAC era.  Even though, I don't take that seriously given that he's a thing of the past, I still remember from that far back.  This was similar except that it wasn't too GM's, but it's the first time I've seen it with strong players during a blitz game like this.  It doesn't matter, however, as Joe is about to give up his Q for a pawn in the usual way.",
        "2. Qh5 Nf6 3. Qxf7+ Kxf7 4. e5": "This move was played for tempo gain.  Being a Q for pawn down, he'll do whatever he can to catch up time.  Yes, this is one of Joe's strategies.  I saw a similar example in a game that fiercequeen annotated.  The only thing is that material was level, but constant gain of tempo is what allowed white to win the game.  So, it's very important, even here.",
        "4... Kg8": "With that being said, I believe that much better was for Dan to retreat his Nf6.  This move gives Joe a minor piece for a pawn as compensation.  But, after this move, Dan doesn't give anything else away.",
        "5. exf6 exf6 6. d4": "Opening up a line for his Bc1.",
        "6... d5": "Similarly, Dan opens up a line for his Bc8.",
        "7. Nc3": "This where Joe, formally, develops his first piece.  What I mean is that guideline of develop your minor pieces.",
        "7... c6": "I don't understand why Dan played this.  It doesn't help with his development in any way.  Instead, it hinders his Nb8.  That's why, as black even in blitz, I would've played 7...Nc6.",
        "8. Bd2": "As now, Dan is falling behind in development.  Might seem little, but against a senior master, however, it is a big deal.",
        "8... Qe7+": "Trying to put pressure against Joe, Dan throws in this check.  But, from my perspective, it wasn't necessary.  As now, black's Q appears to be out prematurely.  In fact, it's out, just about, as soon as, what I saw with Botvinik when he played Fischer.  It can be argued, however, that Joe brought it out earlier since he gave it away.  But, white can get away with not following the principles because of who he's against.  However, opponents who are not as strong should at least follow some of the guidelines.  Not doing so can be a recipe for trouble.  And, that is often the case in games like this.",
        "9. Nge2": "As the check helped Joe since another piece is now in play and well coordinated with the other N.",
        "9... Bf5": "This is where Dan starts developing another piece.  ",
        "10. O-O-O": "The best part, however, is that Joe had a very good spot to castle, whereas, Dan does not have that opportunity.",
        "10... a5": "Just like before, I don't see the point behind this move.  It doesn't develop anything.  I know that it's not all development, and that's not how I usually think.  But, against a Senior Master, I feel that it's vital.  Afterall, the idea is, \"know your principles.\"",
        "11. Ng3": "As now, Joe has a better place for his N.  In part, it's because his Bf1 is now free to move about.  In addition, this is an important tempo gainer.  So, despite remaining this far down, I strongly favor white's position here.",
        "11... Bg6 12. h4": "As now, Joe is planning to attack the B again.",
        "12... a4": "This time, I do see the point behind this move.  Dan is threatening to expose the black K.  The plan is to break through and double up white's pawns on the b file where Joe would be forced to recapture away from the center.  After that, black can prepare for something like ...Qxa3+ with a devastating attack.  In fact, it would pretty much be a forced mate.  For example, 14...Qxa3 15.Kb1 Qxa2+ 16.Kc1 Qa1#   Instead, I would've played 13...Nd7, so that even after 13.h5, black has gotten another piece developed.  However, being that Joe would not allow that, I give this move as an inaccuracy.  Once again, it's not going to help with black's development.",
        "13. h5 Bf7 14. Kb1": "To prevent black's next move from being a problem such as the checkmate example as shown above, Joe played this.",
        "14... a3": "This is the move that I was worried about.  As now, capturing leads to mate.",
        "15. b3": "! And, being that this was only 5 minutes, there's a good chance that I would've overlooked this opportunity and allowed the checkmate or further loss of material which may even lead to resignation.  With that being said, this was well executed by Joe, and I give him credit for that just based on an incorrect assessment that I would've mate which would lose immediately.",
        "15... Na6": "This does continue with Dan's development.  However, just like a GM game that fiercequeen annotated, the N is, indeed, in the wrong place.  Thus, I would not have hesitated to play 15...Nd7.  What's worse is that even though, there is a little mobility with the R, whereas, we didn't see it before, it's still limited.  On the other hand, had Dan developed that N to d7, the R would be free to move about.  And, the reason I draw that conclusion is because of just how important mobility is.  In this context, I think it's even more important because of how compromised the other wing is.  In other words, the K side is blocked up, completely, so my thinking is why compromise the Q side, at all?  Methinks that this ensures white a win.  Although I did favor Joe's position, with this move played, I think that white now has a win.",
        "16. Re1": "As now, Joe uses that time to harrass black's Q, for starters.",
        "16... Qd6 17. Be2": "Then, Joe completes his development.  And, it's worth noting that of his minor pieces are well places, whereas, one of black's pieces is gone.  Additionally, two of the others are not in a good spot.  So, that, immediately boils down to space advantage.  Now, fiercequeen said that it's not really about material advantage, but rather, it often comes down to space.  Well, I'd say that this is the case here. ",
        "17... c5": "Going after white's pawn.",
        "18. Nf5": "So, Joe protects it by going right after Dan's Queen.  But, there is a lot more to this then meets the eye.   I don't just think so anymore, but this is where I just begin to realize that white definitely has a won game here.  It's not official yet, though.  As it's not, ok white only has this and that to do to win.  But, with the best, which happens with Joe, white has a won game.  The reason being is that this N is now one of the main pieces that's indirectly attacking black's K, as we will see towards the end.",
        "18... Qc6 19. dxc5": "As this was one of the plans behind attacking the Q.  The immediate effect, of course, is that Dan recaptures to avoid giving away a pawn, after having had handed back a minor piece.  However...",
        "19... bxc5 20. Rh3": "!! By my books, this is a killer move right here.  Might not be worth two exclamation points, but I give it that because Joe adds another attacker to Dan's K.  So, things are unleashing here.  As now, this R will become very dangerous, as we're about to see.  It's still not quite easy, yet, but a win from white is closer.  In other words, it's a little bit quicker then what I thought earlier.  However, with best play from black, it still might take a while.  I was thinking before was that it might take over 20 moves, but I'm pretty confident that white can win, in about 10 moves.",
        "20... c4": "?? Trying to get a pawn, and maybe, thinking of a different mating attack similar to what I mentioned earlier, Dan played this.  Of course, even though I was beginning to realize that white has a won game, it wasn't official.  In other words, that would taken, at least, 10 moves.  But, with this move, however, a win is near.  Much better would've been 20...g6 to force the N back. ",
        "21. Rg3": "And, that's because of this move which is why I gave 20.Rh3 two exclamation points.  Black can hold the game a little longer with 21...g6, but after something like 22.Bh6 Bxh6 23.Nh6+, Dan is in a lot of trouble.  Or even something like 22.hxg6 Bxg6 23.Bh6, as now, black must do something to prevent a later Nh6+ where mate would not be far off.  So, after something like 23...Bd6 white can immediately play 24.Bg7+ which immediately wins back a R for B.  Or 24.Ng6+ which is a quicker and might be mate.  If not right away, it would be mate shortly after.  But, either way, black's position is hopeless.",
        "21... cxb3": "?? But, this game guarantees an instant checkmate.",
        "22. Nh6#": "What Joe told me is the moral of this game.  In it, he said, \"adrenaline simply blocked his K in with Bishops and made the mistake of never developing either of his Rooks,especially the h8 Rook which played a part in his demise\"  It's also worth noting that what got Dan's DSB blocked in was his failure to develop that.  It comes to show that even being a Q up, against stronger opposition, especially a senior, getting your minor pieces developed quickly is essential.  "
    },
    "url": "https://gameknot.com/annotation.pl/queen-sac?gm=63374",
    "gameName": "Queen Sac",
    "players": "deeper_insight  vs. adrenaline101a (2165)",
    "opening": "Owen defence (B00)"
}