{
    "moves": {
        "1. e4 e5 2. Nf3 f6": "2........ f6?! (This is the Damiano's Defence) - I call it Dodgy Damiano's!  It's dodgy because it opens up the Fool's Mate Diagonal (h5-e8) and blocks in the king knight.",
        "3. Nxe5": "3. Nxe5 - I decide to play Damiano's Gambit.  It is quite sound because if fe?? then I will play 4. Qh5  which will lead to mate or ruinous loss of material for black.  Just play out the database and you will see!!",
        "3... g6": "3. ......... g6?  An unusual way to decline the gambit.  It just loses a pawn.  Best is 3. ......... Qe7 which is the Macgregor-Chigorin Variation which regains the pawn but leads to retarded development.",
        "4. Nf3 Qe7 5. Nc3": "5. Nc3 - develops a piece and defends the threatened e pawn.",
        "5... c6": "5. ........ c6 - prepares d5.",
        "6. Be2": "6. Be2 - breaks pin, develops piece and prepares castling kingside.",
        "6... Bg7 7. d4 d6 8. O-O Nd7": "8. ...... Nd7 - sandwiched between 2 pawn moves black develops his king bishop and queen knight and I complete my development with 9. Be3.",
        "9. Be3 a6 10. Qd2 g5 11. Kh1 h5": "11. ......... h5 - a kingside pawn storm which goes no further.  For now I go on the defensive and black is lulled into a false sense of security and prepares queenside castling.",
        "12. Ng1 b6 13. f3 Bb7 14. Rfe1 O-O-O": "14. ........... 0-0-0 ?! He is castling into it.  My position at the moment looks innocent but I notice his castled position is rather draughty.  My next two moves take full advantage of this.",
        "15. b4 b5 16. a4 d5 17. exd5 Qxb4": "17. ........ The black queen is tempted by the hanging pawn on b4, but she is playing right into my hands because she can be easily driven back by 18. Rb1 which is just where I wanted to place my king rook!  More importantly it opens up the b file.",
        "18. Reb1 Qd6 19. dxc6 Bxc6 20. axb5 axb5 21. Nxb5 Bxb5 22. Bxb5": "22. Bxb5 - after a plethora of pawn exchanges and a couple of pieces I now have a two pawn lead, but look, I have denuded his king and just look at those big cannons on a1 and b1!!!",
        "22... Nb8 23. Qc3+ Kb7": "23. ....... Kb7??  He would have been better off interposing with his queen but I would have been very happy to go into an endgame with a 2 pawn plus!!  This move loses, loses, loses!!",
        "24. Ba6+": "24. ..... Ka7 - if he moves his king to a8 then Ba7 is double check and MATE!!!",
        "24... Ka7 25. d5+": "25. d5   my opponent threw in the sponge here as he will have to give up his queen and rook to escape the immediate clutches of Old Matey.  I am very pleased with this mating attack as I am normally a very passive player.  I really do need to develop this aspect of chess as I do tend to make heavy weather of converting material or positional advantages."
    },
    "url": "https://gameknot.com/annotation.pl/queenside-mayhem?gm=14076",
    "gameName": "Queenside Mayhem!!",
    "players": "jstevens1 (1552) vs. Unfortunate Opponent (1267)",
    "opening": "Damiano's defence (C40)"
}