{
    "moves": {
        "1. e4": "My usual opening",
        "1... e5": "His/her usual opening (maybe)",
        "2. Bc4 Nf6 3. d3 Nc6 4. Nf3 Bc5 5. Nc3 Ng4": "Breaks the rule of moving same piece more than once in the opening...but there's a clear and present danger on f2 now. So...",
        "6. d4": "Removes the threat on f2 and attacks black's DSB",
        "6... exd4": "Everyone loves the center pawn exchange more than the US stock exchange i bet",
        "7. Nxd4": "Getting material back",
        "7... Bxd4": "I believe it may have been better for black if he focused on developing the LSB which is locked at this point",
        "8. Qxg4": "Getting material back and attacking g7.",
        "8... Qf6": "Protecting g7 and attacking f2",
        "9. Qg3": "Protecting f2, and threatening c7 (if needed i suppose)",
        "9... Nb4": "Threatening a fork from c2. I still think black should focus more on developing this early in the game.",
        "10. Bb3": "Preventing the fork",
        "10... h5": "Not sure...perhaps to threatening white's kingside?",
        "11. Be3": "I don't like that d4 bishop so trying to move it away. if he exchanges bishop i'll have an open f-file for my rook",
        "11... Bxc3+": "Threatening fork by Queen on c3 after 11...bxc3 12. Qxc3",
        "12. bxc3": "Which I didn't see at that time",
        "12... d6": "And apparently black didn't see the fork at c3 either. Bringing black's LSB into play",
        "13. O-O": "Long live the king! Rooks are connected",
        "13... Nc6": "Only move besides a6 (which would be a worse choice for a knight i think)",
        "14. Rad1": "Claiming the open file",
        "14... Bg4": "Black clearly doesn't like a rook on the open file. Developing bishop while attacking the rook...",
        "15. f3": "...easily defended",
        "15... h4": "Blunder...giving me a free piece",
        "16. Qxg4 g5": "Not sure why? maybe as a backup to the h pawn which didn't need it at this time. If I was black I would try to get white to capture the h4 pawn then double the rooks on the h file (I know it's a long shot but worth a try perhaps?)",
        "17. Bxg5": "Free pawn...",
        "17... Qxc3": "...or not (lol)",
        "18. Qf5": "Attacking f7, which is already being attacked by the LSB",
        "18... Nd4": "Blunder!!! Black didn't see the impending doom...",
        "19. Qxf7#": "Was a great game! I'd like to thank devdor for this game. I'm sure I made many blunders, but in the end it worked out."
    },
    "url": "https://gameknot.com/annotation.pl/queens-party-tourney-6?gm=56422",
    "gameName": "QUEEN'S PARTY TOURNEY #6!",
    "players": "shushanta (1365) vs. devdor (1343)",
    "opening": "Bishop's opening (C24), Berlin defence"
}