{
    "moves": {
        "1. e4 c6 2. Nf3 d5 3. exd5 Qxd5": "The Caro-Kann again. After Qd5, rather than immediately chase the black queen away, white develops other pieces. In this position, the black queen IS going to be chased away, so white is not worried about doing so immediately.",
        "4. d4 Bf5 5. Bd3 Bxd3 6. Qxd3": "Typical mainline trade of the white bishop... I think. There are other more profitable continuations for white, in the sense that it takes black out of his preferred strategy, since black wants to trade those bishops. Or perhaps creating positional considerations for the bishop trade. But here, white is content to simply make that trade.",
        "6... Nf6": "I chose to develop this knight; from this point on, I have no idea of what the book Caro-Kann is, and develop instinctively. I prefer putting this knight here when there is no white pawn on the e file.",
        "7. Nc3": "The black queen is finally chased away.",
        "7... Qd8": "Karpov used to play the Karo-Cann a bit in blitz games. And often would do this with the queen, as other moves can end up wasting tempo's, and time.",
        "8. O-O e6 9. Bg5": "Sometimes this pin can be annoying.",
        "9... Be7": "So I remove it.",
        "10. h3": "Qd2 was possible, but white had already moved the queen to d3, and did not wish to move the queen again. h3 prevents Ng4 but I'm not so sure moving h3 is wise unless necessary, as now the white king's defense is a little weaker.",
        "10... h6": "H6 to kick the bishop before I castle, also, I don't want it staying on g5. Nd7 is also possible, and perhaps Qc7 or Qb6; however, I did not like any of the queen moves in this position as I ultimately don't think they will work in this position. Often white can sacrifice on h6, but in this position, it appears to me that white is not really set up to do so; and doesn't in the ensuing moves. I am still not developed all the way, and want to not just castle by rote here; let white guess a bit. But I have to be careful not to wait too long.",
        "11. Bf4 Nbd7": "This is to prevent Bxb8. Since the light squared bishops are off the board, sometimes an imbalance of two knights verse a knight and a bishop is better, especially if the pawns are mostly still on the board. Yes, the bishop can cover the board more quickly, but two knights can work very well together, and the pawns can hem the bishop in, so it depends on the position. I did not want white to make that particular trade. Besides, this is typically where the queen's knight goes anyways.",
        "12. Rfe1": "Now the pressure is increasing some on the black king; white is gearing up his pieces here. However, he does not make decisive decisions... how's that for a phrase? And so black weathers the pressure, but it lasts a looong time. Play continued.",
        "12... Nd5": "Normally I don't like making this move with no other piece able to retake but a pawn, as one strategy of the Caro-Kann is to try to keep d5 for an outpost. However, white's pieces are beginning to become coordinated, and so I decide to lessen some of the tension.",
        "13. Nxd5 cxd5": "In this position, this is the only move. Taking with the e pawn would be a bad idea, as the black bishop has few defenders.",
        "14. Ne5": "I should not have allowed this position; the white knight can be dangerous there. Nxf7 and Ng6, were white prepared to make those moves, could prove unpleasant. For example, were white allowed to, Nxf7 Kxf7 Qf3 and the black king must retreat; but Kg8 is very unpleasant, and Ke8 is just dangerous after Rxe6. I have one move to make before white can consider it, so I do what I think will not allow white enough compensation to make such a move. ::edited:: Yes, black can move the knight to f6 instead of moving the king, but it just seems dangerous to keep having pieces tied up on defense allowing white more initiative, and the white rooks would quickly be able to add pressure down the e file if I chose that. So as I said...::",
        "14... O-O": "About time I castled. If white still had three minor pieces, or  if white's rooks were positioned to support the kingside, black would be in a dangerous position. Now, however, the move h3 made by white some moves ago makes it more difficult to get both rooks involved quickly, and I think black will be able to defend just fine. White however still has the initiative.",
        "15. c3": "I don't like this move. Yes, it shores up the d4 pawn, but why now? I think white should have considered something more threatening to black... and designed to keep black on his heels.",
        "15... Nxe5": "I was curious which piece he would retake here with. I did not want to let white initiate the trades when he was ready to, so... begone, knight! That white knight was unpleasant for black.",
        "16. Bxe5": "White chose to recapture with the bishop rather than the pawn or rook. Either of the other two would have been interesting; but the bishop recapture seems a little passive to me because it delays other tactics on h6 and doesn't seem to give white any additional pressure.",
        "16... Bf6": "Now whether or not I take with the bishop depends on how white's plan develops as indicated by his moves. I am still trying to equalize. Some may say it looks equal, but white up to the last couple moves had maintained an initiative. I am close to changing that. White's attack has really evaporated now.",
        "17. Qg3": "I have time before the white rooks get involved in an attempt to threaten the black king. I am already looking ahead to my counter play on the queenside; after a short think, I decide to move the Rook to where I think it will do the most good. When queenside play begins, notice how the black rook moves and black queen position result in an advantage for black. I could not at this point know what my opponent would do, but after considering the possibilities, thought that the c file would become open before long.",
        "17... Rc8": "So I moved the a file rook to the half- open c file. As I said in the last comment, notice that I just did not do this because that's what you do. I thought of what would likely happen, and what I would be doing. The white bishop was not the deciding factor for me either; had I wanted the rook on the b file, the bishops would have come off first. Just about all of the time, putting rooks on open files, or half-open files is the right thing to do. But it's good to consider what you'll do there!",
        "18. f4": "Further weakening the white king, and I don't see how this will really help white. Either he moves f5 in which case I still have three pawns covering my king, or he retakes with the f pawn if a bishop trade is initiated by me; but the resulting half open f file has not been prepared yet by white to control it. So I don't see what white's point is here especially with his one rook woefully biding time in a corner, like a disobedient child on time-out.",
        "18... b5": "Now is the right time to prepare a queen side counter. Minority pawn attack!!",
        "19. a3": "White decides to blunt it, but in a passive way. a4 was possible here, despite the black rook on the c file.",
        "19... a5": "I have you now, Luke! Err, umm... just deleted his name. ;) Actually, I think he hasn't played much against the Caro-Kann, as his moves are not as precise as I've faced on occasion. Well neither are my responses to be fair. ;) My intent right now is to riddle the queen side full of holes, distracting white from his kingside plans, and then whatever white pawn is left, gang up on it. The white kingside is very weak now, and if the game goes that way, I'll have a lot of opportunities on that kingside. But we'll see here...",
        "20. Rac1": "Now white sees what is in store for the c file, and decides not to allow it. Well, he hasn't looked deep enough yet!",
        "20... Rc6": "Setting up the back rank for the other rook to move to the c file or elsewhere as conditions warrant. The black queen will support queenside operations as needed, and perhaps reposition more than once, but we'll see.",
        "21. Qd3": "I thought he might do that... and now I feel as if I have wrested the initiative firmly away from white.",
        "21... Bxe5": "So I decide now is the time to get rid of the bishops, as white's bishop's position was simply worth more than mine. Oh, I hear the screams now: White's bishop is a 'bad' bishop. But black's bishop is doing nothing at all, while white's is supported, and threatening. And if things are opened up, I don't think there will be a decisive bishop comparatively speaking. Yes, I recognize that I could have moved Be7, but the white bishop can't be trapped, f5 would follow. I don't really want, while pursuing my queenside counter, to weaken my king's defenses. So, the bishops can give each other last rites: be gone. Now, white can try to win a pawn by interposing Qxb5 in response to black's Bxe5, and then we have an interesting position: black can move Rb6 and if Qxa5, black could move Bxf4 saving the bishop at the expense of connected passed white pawns on the queenside, or move Bxd4+. Would the black bishop be worth the connected white pawns, or would it be better to isolate the white a and d file pawns? (...Rxb2 would follow the bishop retake) It's an interesting question. I wish I had a computer engine to crunch it. But, white retakes the black bishop immediately.",
        "22. fxe5 Qb6": "Well I wish white would have tried the interposing; it would have made for a far more interesting game. Now, however, black is well positioned to continue the minority pawn attack. White senses things are going to open up a bit, and hides his king.",
        "23. Kh2": "But I don't like this move here, because white doesn't have much time... and I'm not referring to game time, but tempo!",
        "23... b4": "And so I attack the majority pawns!",
        "24. cxb4 Rxc1 25. Rxc1": "White must retake.",
        "25... axb4 26. a4": "A sneaky try. Immediately I play b3. Were white allowed to support that passed pawn, such an advantage could prove to be a winning one in an endgame, where the black king must travel all the way to the side of the board to stop it. And it would be hard and likely impossible for black to remove such support once it was done. I cannot allow white to play b3, period.",
        "26... b3 27. Rc3 Rb8": "And lo, white is totally out of position to protect the a pawn, and black's piece coordination is much better. Look how white controls the c file, but in this position it's not so important! ;) Play continues.",
        "28. g4": "This move is very bad for white, and the only real blunder by my opponent. Those pawns aren't going anywhere, and grabbing space at this point at the expense of king cover/safety is a mistake.",
        "28... Qb4": "The a pawn is already dead, but doesn't know it yet.",
        "29. a5": "A good try. However, this leads to a combination that proves to be the winning one. See if you can spot it, it's pretty easy.",
        "29... Qxa5": "Qxa5!",
        "30. Rxb3": "Rxb3",
        "30... Rxb3": "RxR",
        "31. Qxb3": "Qxb3, and now after a check, the d pawn falls:",
        "31... Qd2+ 32. Kg3 Qxd4": "White has no choice now, and must protect e5. He is able to with tempo, since I left my king on the back rank because of the b1-h7 diagonal being unobstructed.",
        "33. Qb8+ Kh7 34. Kg2": "This move just did not seem wise now. Black will not try to force a queen trade due to the fact that the b file pawn ought to be sent towards queening immediately. Black cannot stop the b pawn with his king; and by the time black orchestrates a queen trade on the b8-h2 diagonal, the b pawn will be unstoppable. Therefore, black will not try to make such a trade at all, but must either queen first, perpetually check, or lose. It turns out black can queen first. White will lose a tempo regardless when black moves his queen from obstructing his own passed pawn, no matter if the white king is on g3 or g2, for black will move with check. The same cannot be said for the white queen, unless it's to allow the black king to take it on g8 or h8. So the next several moves could become a pawn race, and black has the upper hand! Notice how black has kept a pawn advantage, and has seized the initiative from white by that minority pawn attack. I wonder if white considered resigning here.",
        "34... h5": "This move was a mistake by me. 'nuff said. Well okay; here's how it was a mistake: if white were to find a way to check from c2 with the white pawn still on e5, black would wish to avoid a perpetual, and perhaps even move g6. But with a white pawn on h5, that could be a bit problematic. Also, it's rather a waste of time doing nothing immediately to force the game, unless I were trying for a draw. Why did I do it during play? At the time, I was thinking if the queens were off the board, this could make it easier for those white pawns to fall. And it would. But now it seems obvious that all I did was waste time and weaken my own king's position.",
        "35. gxh5": "White responds. That response... was it really necessary or was there something better for white? White thought so. But anyways, now we get down to brass tacks, so to speak.",
        "35... Qe4+": "Whether e4 or e3, the white king was going to be checked.",
        "36. Kf2": "A gallant try, but ultimately gives me more tempos; there is no good way for white to stop the d pawn, just as that b pawn would be mighty hard for me to stop if I needed to.",
        "36... d4 37. Qb5": "White has realized he cannot win a simple pawn race, and after a few ineffectual queen moves resigns. White's queen is currently 'overloaded' that is, it has too much to do and can't do it all. White needs to protect the e pawn on e5, prevent black from picking off the other white pawns when opportunity arises, and even more importantly, needs to stop the d pawn. Oh, and also support queening that passed b pawn. It would seem she doesn't have time to do it all; the position is extremely difficult for any white chances, including drawing. There may be a chance that white could have orchestrated a queen trade where the white king finishes off the d pawn. To summarize: in this position, White probably needed to some how get the queens off the board, blockade black pawn advances with his king, and advance the b pawn to the eighth rank in order to win. I am not envying white here!",
        "37... d3 38. Qa5 Qe2+": "And this was the position where white resigned. I hope this proves the value of a minority pawn attack in busting up a majority of pawns, and creating counterplay, that in this game proved decisive. Any comments appreciated!"
    },
    "url": "https://gameknot.com/annotation.pl/queenside-minority-pawn-attack-proves-decisive?gm=49175",
    "gameName": "Queenside minority pawn attack proves decisive.",
    "players": "Anonymous (1803) vs. Pierre99 (1200)",
    "opening": "Caro-Kann defence (B10)"
}