{
    "moves": {
        "1. e4": "The was a strange game, with the advantage swinging from one side to the other, with neither side able to capitalise on our opportunities. In the end it came down to the old chess adage: “The winner of the game is the player who makes the next-to-last mistake” (Savielly Tartakover)",
        "1... e5 2. Nf3 Nc6 3. d4": "The scotch game. I faced this opening several times against one of the top players in my chess club. My database shows that it is fairly even with all 3 outcomes (0-1, 1-0, 1/2) around 33% each, slightly in favour of white.",
        "3... exd4 4. Nxd4 Qh4": "A strange looking move but the 3rd most commonly played. Attacking the e4 pawn, and will win the pawn after something like; 5. Nc3 Bb4 6. Bd2 Bxc3 7. Bxc3 Qxd4. However white will have good attacking chances in exchange for the pawn.",
        "5. Bc4": "This is an early mistake, giving me a free pawn early on. Although the lead in development gives slight compensation.",
        "5... Qxe4+ 6. Qe2 Qxe2+ 7. Nxe2": "With an extra pawn I was happy to exchange queens, and remove any chance of quick counterplay. After this mass of action both sides will look to develop as quickly as possible.",
        "7... Nf6 8. Nbc3 Bd6 9. Bg5": "This move threatens to double the f-pawns, but can easily be met by Ng4, however I thought I could see a better move...",
        "9... Be5": "...That turned out to be a complete blunder. Over the next few moves my opponent takes a large lead in development and in position, that gives him good attacking chances",
        "10. f4": "A good move; If 10...Bd6 then 11. Bxf6 gxf6 leaves me with doubled isolated pawns, a positional nightmare. ",
        "10... Bxc3+ 11. Nxc3 Ng8": "Once again I overlooked Ng4, fearing the knight would struggle to make it's way back to my side. This was unfounded as Ng4-e3-f5 is useable, although wastes a lot of time with the knight.",
        "12. O-O-O": "This looks like a good aggressive move, however fails to take advantage of hte undefended c7 pawn, which cannot be easily defended (Kd8 blocked off by the bishop) And so the best move would have been either Nd5 or Nb5.",
        "12... f6": "Driving away the bishop, and so allowing the king to move to d8, and so removes the threat of Nd5 completely. ",
        "13. Rde1+": "A nice zwischenzug (inbetween move) before retreating the bishop white activates his rook to the open file with check.",
        "13... Nge7 14. Bh4 d6": "With my pinned knight and with 2 bishops and a rook lurking ominously i try to get my last piece out and look to castle to safety if given the chance.",
        "15. h3": "White wants to make the pawn thrust g4, so this is a prepatory move, however it is rather slow, and white could have played g4 straight away, as after 15. g4 Bxg4 16. Rhg1 h5 17. h3 Bd2 18. Rxg7, the position looks very much in whites favour.",
        "15... Bf5": "Better would have been Bd7, as Bf5 allows white to play g4 with a tempo as it forces the bishop to retreat.",
        "16. g4 Bd7": "Bg6 would have been better, looking to move Bf5-g6-f7 to try and remove one of whites aggressive pieces",
        "17. g5 Rf8": "a stunningly bad move. It would have been better to play fxg5 and deal with the extra pressure from the bishop after Bxg5. Rf8 should cost a pawn after\r\n18. gxf6 gxf6 19. Nd5! (attacking both c7 and f6 pawns) Kd8 20.Bxf6 and the pawn is lost and the knight is re-pinned by the bishop.",
        "18. Re3": "Played to double rooks on the e-file after Rhe1, and is a logical plan, however missing the massive opportunity to win back the pawn and gain a far superior position, makes this another fantastic blunder",
        "18... O-O-O": "I take the opportunity to move my king to safey and simultaneously protect the c7 pawn and release the e7 knight.",
        "19. Bg3": "A blunder that is difficult to understand, perhaps with the king moved to a new position white is repositioning the bishop to a more aggressive spot, however it is hidden by his own pawn, and looks straight into my d6 pawn. A better move would be to take the f6 pawn, then move the bishop back to f2, a considerably better square for the bishop. My next combination proves to be a real knightmare for white (pun intended)",
        "19... Nf5 20. Rd3": "white can't move his rook off the 3rd rank without losing his bishop, he could have played Rf3, however this fails to 21...Ncd4 22.Rd3 Bc6 23. Rhd1 d5 24. Bf2 dxc4",
        "20... Nb4 21. Rf3 Bc6": "And I remove the last available square for the rook. White must now lose a rook for the bishop, but does have some tricks available, using my undefended knight",
        "22. Be6+ Kb8 23. Bxf5": "Winning the knight, and a good square for the bishop, however the loss of the exchange is far more costly.",
        "23... Bxf3 24. Rf1 Bc6 25. gxf6 g6 26. Bd3 Nxd3+": "Ahead in material I am more than happy to exchange the pieces off the board, this move also creates an isolated d-pawn, which could become the point of an attack, as it can be a serious weakness",
        "27. cxd3 Rxf6": "A silly blunder, the pawn would be impossible to defend, and I needed to make a rook move like Rde8 before taking the pawn.",
        "28. Bh4": "Skewering both of my rooks, winning back the exchange he lost. I am still a pawn up, but winning will be less comfortable.",
        "28... Rdf8 29. Bxf6 Rxf6 30. Ne4 Rf8 31. b3 a5": "A look at the pawn structure shows that I have a kingside majority, so I decide to attack on that side, possibly better would have been d5, to kick the knight away to a less useful square, such as g3 or g5, which gives me more space on the kingside",
        "32. Kd2 b5 33. Ke3 Bd7": "A cheap attack on the h3 pawn, to give me time to prepare to move the c-pawn to join the attack",
        "34. h4 Re8": "I can't push the c-pawn yet as I will lose the d-pawn, the rook move pins the knight, and so allows me to push the c-pawn",
        "35. Kd4": "Unpinning the knight and moving the king more into the centre, and into a very powerful position",
        "35... Bf5": "This move aims to remove the knight that prevents me moving my c-pawn",
        "36. Rh1": "This is a very strange move, presumably aiming to drive the h-pawn forward, hoping to cause me problems on the queenside, however his main concern should be the kingside.",
        "36... Bxe4": "I could have played c5  then if 37. Kd5 Kc7 38. Nxd6? Rd8, winning the knight. ",
        "37. dxe4 c5+": "Finally pushing the pawn forward!",
        "38. Kd5 Kc7 39. h5": "A good move to turn the tables, and justifies the earlier rook move, as I failed to take advantage of it. This counterplay evens up the match despite my extra pawn. Taking the h-pawn would give white a passed pawn (the f-pawn) and an active rook, and allowing it to be taken allows Rh7  winning the d6 pawn.",
        "39... g5": "The only option I could see. It is protected indirectly as fxg5 leads to Re5#",
        "40. f5": "oh dear, a careless slip costs him the match, we've both made several mistakes, but this one costs him the match",
        "40... Re5#": "A slightly dissapointing end to what could have been and interesting fight, however as rook endgames aren't my forte I was happy to come out with a win\r\n"
    },
    "url": "https://gameknot.com/annotation.pl/quickplay-walhalla-60?gm=623",
    "gameName": "quickplay walhalla 60",
    "players": "dafool (1527) vs. alloutwin (1655)",
    "opening": "Scotch (C45), Pulling counter-attack"
}