{
    "moves": {
        "1. e4": "A short Sicilian game with an interesting checkmate at the end,",
        "1... c5 2. Nf3 Nc6 3. d4 cxd4 4. Nxd4 e5 5. Nb5": "Strongest response.",
        "5... a6 6. Nd6+ Bxd6 7. Qxd6 Qf6 8. Qd3": "One of many alternatives in a fairly common position, with a better winning percentage for White. Black must play carefully. ",
        "8... Nh6": "?! An innovation which did not turn out well for Black. It leaves the d5 hole weak and the threat of ...Ng4 is easily parried. ",
        "9. Nc3": "Since Black has decided not to defend d5, White will control it.",
        "9... Rb8": "Preparing for a push down the b file and protecting the rook from Nc7+, but White gets a dangerous initiative here and Black's developmental advantage is suffering. Black was probably concerned that after the more natural ...0-0, 10 Nd5 Qd8 that Bxh6 would leave his K exposed.",
        "10. Nd5": "White must strike quickly before Black can regroup, occupying d5 and preparing a quick attack ",
        "10... Qd6": "?! This aggressive response exposes Black's queen to tactical threats and makes development harder. Better is the more patient 10 ...Qd8.",
        "11. Bg5": " !! I rarely give this rating to my own moves but this is a very subtle but diabolical move with a hidden sting made possible by Black's inaccurate Q move, which is also very difficult to meet effectively. The immediate threat is the somewhat subtle 12 Nf6+! Ke7 (otherwise the Q is lost) 13 Ng4+ f6 14 QxQ+ KxQ  15 NxN PxN 16 BxP with an easily won game. And the natural looking 11 ...0-0? is now met by Ne7+! winning the Q. ",
        "11... f6": "?? Wants to drive off the Bishop and probably play 0-0 next move, and is willing to accept Bxh6 doubling and weakening the K side pawns, but misses the primary threat and so loses even more quickly. Black's best move was probably the defensive retreat ...Ng8! and patient defense, although White retains a clear edge.",
        "12. Nxf6+": "! Fairly obvious now but exposing the hidden threat. ",
        "12... Ke7": "Otherwise the Q is lost.",
        "13. Ng4+": "Forces the K to e6 with check if Black wants to defend the exposed Q.",
        "13... Ke6 14. Qc4+": "And my opponent resigns, since checkmate follows after the forced ...Qd5, 15 QxQ#."
    },
    "url": "https://gameknot.com/annotation.pl/quick-checkmate-on-d5?gm=31834",
    "gameName": "Quick Checkmate on D5",
    "players": "dmaestro (1532) vs. NN (1530)",
    "opening": "Sicilian (B32), Labourdonnais-Loewenthal (Kalashnikov) variation"
}