{
    "moves": {
        "1. e4": "...good enough for Fischer, good enough for me.",
        "1... d5 2. exd5 Qxd5": "This is what black typically goes for in the opening, getting his queen out early.  I like 2. ...Nf6 better for black, though.",
        "3. Nc3": "Now, white has the tempo here, and black typically moves the queen to a5, pinning the knight in the event of d4, and daring white to overextend by chasing her.",
        "3... Qd6": "A little more unusual than Qa5, but offers a lot of possibilities.  In fact, there's a whole book about it:\nhttp://www.jeremysilman.com/book_reviews_jd/jd_scandinavian_defense.html\n",
        "4. Nf3": "d4 is more common, but I'd rather get some pieces out and decide whether d4 or d3 is a better square for the pawn.  Just a personal thing, but I'd rather make the non-committal move and allow my opponent the option to make a bad move.  In hindsight, black could play e5 here, which d4 would prevent.",
        "4... Nf6": "Standard development.",
        "5. Bc4": "Again, waiting on what to do with the d-pawn.  c4 is a good square for the bishop, and eyes a possible assault on the always-weak f7 square.",
        "5... a6": "?!  Really?  This is the most common move in the gk database, with good success for black, but wouldn't it be better to develop something rather than chase the bishop (which clearly isn't going to b5)?",
        "6. d4": "Time to give the queen's bishop an out (it's clear that a fianchetto would be a bad move), and to step up my presence in the center.  White's looking pretty good so far.",
        "6... b5": "Consistent with a6, and forces the bishop to choose between b3 and d3 (or e2).",
        "7. Bb3": "Again, eschewing the success rates in the game DB.  Why?  To maintain pressure along the a2-g8 diagonal.  With his queenside a mess like that, I owe it to myself to put as much pressure on the center/kingside as possible, since that's where his king will be.  This also keeps the d- and e-files clear for heavy pieces after 0-0.",
        "7... e6": "Alright, so this makes f7 harder to get to.",
        "8. O-O": "Good!  The rook belongs on e1, and I'm one move away from having a considerable amount of pressure built up on e6, too.",
        "8... Bb7": "Again, the most common move in the game DB, but I'm not sure it's best.  Notice how black has no good place to put his bishop on f8, because the Qd6 blocks it in.  He clearly can't castle queenside, and so it looks like if I hurry, I can get him with his king trapped in the center.",
        "9. Re1": "Obvious but good.  Black is going to have to scramble to catch up in development.  I would say Be7 is relatively best here, but black suprises me, and goes for...",
        "9... Nbd7": "Nbd7?!  I don't like this move at all.  There's enough firepower in place that I see that Ng5 allows me a strong in on the kingside, with the possibility of Nge4, d5, and moving the Queen along the d1-h5 diagonal.",
        "10. Ng5": "Going for it!",
        "10... Nd5": "?!  A dubious move in a tough position, clearly trying to exchange pieces and block the bishop's access to the e6 square.  Notice that the e6 pawn is pinned, though, and that the f7 square is still weak.  I decide that now's the time to make a play for f7.\n",
        "11. Qh5": "The other major option was Qf3, but this provokes g6 first.",
        "11... g6": "I saw that one coming.",
        "12. Qf3": "Although really, I could've played this last move.  I was a little bit afraid that black could play f6, complicating matters, on the move before.  However, if he did (or does now), I have Rxe6 , winning the queen.",
        "12... Nd7f6": "A very reasonable move.  In addition to the threat on f7, I'm also attacking the Nd5 3 times, and it was only defended twice due to the pin on e6.  But this isn't adequate, because...",
        "13. Bxd5": "This move forces a recapture, otherwise black just loses the Bb7.",
        "13... Nxd5": "Bxd5 was better.  Yes, it loses the Nf6, but what follows is much worse.  This opens up the f7 square...",
        "14. Qxf7+": "Obvious but strong.  In fact, I made this move so quickly that I didn't realize just how strong it was.",
        "14... Kd8": "Forced.  Now, Rxe6 looks tempting, but there is a better move...",
        "15. Nxe6+": "!!  This ends the game.  Black has only two legal moves.  If Kc8, 16. Qe8  Qd8 17. Qxd8#, and if Qxe6, white not only wins the queen, but can force the wipeout of all of black's pieces by move 22.  A good game by theinnergame, as I continue to claw my way out of a negative team score.\n\n(I'll get there one day, thomas!)"
    },
    "url": "https://gameknot.com/annotation.pl/quick-n-brutal?gm=15709",
    "gameName": "Quick n' Brutal",
    "players": "ethansiegel (1742) vs. theinnergame (1773)",
    "opening": "Scandinavian (B01), Pytel-Wade variation"
}