{
    "moves": {
        "1. d4": "This was a fun game that I recently played. I decided to annotate it because I had a pretty good attack and also because I had lost me previous game against this opponent and it was nice to get some revenge.\n\nThis is my first annotated game, so if you have any comments on my annotation style I'd appreciate hearing them.\n",
        "1... d5 2. c4 e6 3. Nc3": "Just a basic Queen's gambit declined",
        "3... dxc4": "Oddly enough he changes his mind and accepts the gambit. I don't think I've ever seen this before, but maybe it's more common than I think?",
        "4. e4": "So I stick another pawn in the center and attack his pawn at the same time.",
        "4... Bb4 5. Bxc4 Bxc3+": "I'm not sure why he did this. Not only does he lose his bishop for a knight which is not usually a good trade, but he also allows me to bring a pawn into the middle and it opens the b file for my rook. It does leave my a pawn isolated, but I don't think I would have played this move.",
        "6. bxc3 a6": "Possibly preparing for b7-b5",
        "7. Bf4": "I develop my other bishop. White has a strong center and a lead in development over black.",
        "7... Bd7 8. Nf3": "I finish developing my minor pieces and prepare to castle. After that, I can look to attack.",
        "8... h6": "Again, he moves his pawn. He really needs to develop his pieces.",
        "9. O-O Nc6 10. d5": "I strike at his knight.",
        "10... exd5 11. exd5": "One of the benefits of that exchange is it opens a file to his uncastled king.",
        "11... Nce7 12. Re1": "I pin his knight to his king",
        "12... b5 13. Bb3 g5": "Here I should have played Bf4xc7, followed by d5-d6 forking the black queen and knight.",
        "14. Be5": "Instead I threaten his rook",
        "14... f6 15. Bxc7": "Now I notice the move I should have played earlier.",
        "15... Qxc7": "Perhaps it would have been better for him not to retake?",
        "16. d6 Qxc3": "He evens up the material, but now his queen cannot defend his king from the attack that is to follow.",
        "17. Bxg8": "This allows me to play Re1xe7+ instead of d6xd7",
        "17... Rxg8 18. Rxe7+": "And now black is in serious trouble",
        "18... Kd8": "Moving to f8 would let the bishop fall.",
        "19. Rc1": "Attacking the queen and bringing another rook into the assault.",
        "19... Qb2": "It would have been ideal if black could have moved his queen back to defend his king, but instead it is pulled still farther from the battle.",
        "20. Rc2": "So that I can move my queen without him taking my rook.",
        "20... Qa3 21. Qd5": "Forking his rooks. The end is near.",
        "21... Rc8": "Hoping that I'll exchange rooks, maybe?",
        "22. Qxg8+": "No such luck, unfortunately.",
        "22... Be8": "Forced.",
        "23. Qxe8#": "And mate! That was a fun game to play, hopefully it was fun to read through as well. If you noticed any mistakes on my part, please leave a comment telling me."
    },
    "url": "https://gameknot.com/annotation.pl/quick-game-with-a-decisive-attack?gm=60016",
    "gameName": "Quick game with a decisive attack",
    "players": "blenderboy (1359) vs. enemy_chaser (1351)",
    "opening": "QGD (D31), 3.Nc3"
}