{
    "moves": {
        "1. e4": "hey hey, this is a quickie i wanted to save cause it was short and sweet with a 2 nice little traps within 16 moves",
        "1... e5 2. Bc4": "my, boring by now, bishops opening,",
        "2... Nf6 3. Nc3": "and my preferable nc3. this game though has given me new incite on nc3 and possible follow ups",
        "3... Bc5": "the c5 parking spot",
        "4. Nge2": "and my ne2 reply to try to set up a d4",
        "4... c6 5. d4": "my aggressive d4",
        "5... exd4 6. Nxd4 b5": "hmm third time i face this but the last two times i faced this, i did a dive with my bishop on f3 to prevent his castling\n\nand just to try new avenues lol. i won 1 of those in 10 moves. lost the other over the long course where i wasnt able to compensate for the sacrifice.   this third time i decided to explore not diving the bishop",
        "7. Bb3 Bb4": "hmm unanticipated reply but i decide to play risky and let him double pawn me. most players know the LSB is generally stronger for white. considering this i want to park my DSB on b2 in anticipation of his king side castle and just play c4 with my pawn and sorta condemn my white lsb temporarily. i thought this would give him a confidence boost and focus his efforts on my lsb. i was trying to already calculate attacks on his king with my DSB, remaining Dknight and queen after his dsb exchange",
        "8. O-O": "so i decide to castle to invite the double pawn. i also thought since hes taking his DSB off the board it adds increased value to mine.",
        "8... Bxc3": "natural reply",
        "9. bxc3 O-O": "forseen king side castling due to his crunched left side hard to deploy any pieces",
        "10. Re1": "protect my pawn with rook and get it into action ",
        "10... a6": "kinda considered this  waste of time. hes highly under developed, i sorta considered this some type of focus to my LSB that i wanted him to waste time on after all",
        "11. Bb2": "park my DSB on desired diagonal bearing down on the g7 pawn diagonal ",
        "11... Bb7": "anticipated reply. i calculated that the natural replies after this, if i sacrifice a rook will set up a checkmate attack with a hidden checkmate 2nd attack if he defends \"naturally\" as the game has been going considering the board set up",
        "12. c4": "open up my dsb view condem my LSB",
        "12... c5": "anticipated reply and helps set up the dangerous attacks",
        "13. Nf5": "now my knight as planned is ready to work with my queen and DSB",
        "13... Bxe4": "natural reply this is where i set up the rook sacrifice and i just had a big hunch he would take it with his knight and the 2 next natural replies would lead to his demise.",
        "14. Rxe4": "juicy rook!",
        "14... Nxe4": "oh oh something bad is about to happen",
        "15. Qg4": "i dont know if he anticipated this. and the natural reply looks like g6, which prevents the queen from going in and kicks the knight away at the same time.!",
        "15... g6": "but the proper defense is blocking with his knight or queen depending on if he wants to lose his knight or the g7 pawn with 3 of my pieces bearing down on his king",
        "16. Nh6#": "dun dun dun! wasnt that short and sweet! rarely do i get a Knight and bishop mate ><"
    },
    "url": "https://gameknot.com/annotation.pl/quickie-bishop-knight-mate-with-a-rook-sacrifice-when-natural-replies-get-calculated?gm=58759",
    "gameName": "Quickie bishop knight mate with a rook sacrifice! When natural replies get calculated.",
    "players": "trixstermtl (1512) vs. cliver1 (1522)",
    "opening": "Bishop's opening (C24), Berlin defence"
}