{
    "moves": {
        "1. d4 d5 2. Bf4 e6 3. Nf3 Bd6": "This is the first sign of aggressivity from my opponent. Now, the planned Ne5 is just disastrous to f6, e5 etc. ",
        "4. Bg3": "It seems a loss of tempo, but if BxB, my open column will be an edge, compensating the bad bishop I'll have left.",
        "4... f5 5. e3": "Definitely aggressive. I like that!",
        "5... Nf6 6. Ne5": "The BN on f6 is the ticket to Ne5.",
        "6... Nbd7 7. Nd2": "My N is inmune, and if BxN, black loses a B for nothing. ",
        "7... O-O": "Castling into the fire. But now I have the B on g3, and my plan is to remove the Nf6 in order to get the Q up there. Still, I sensed not h3 or h4 will be of real help, and tried the other way instead: ",
        "8. c4 c6 9. c5 Bc7 10. b4": "I dared to close the center, now I have to keep some possibility of life for my lsb on b5. I've not compromised my kingside, yet, so no real reason to keep the Qside static. I'm grabbing space, for sure. ",
        "10... Ne4 11. Qh5": "Yes, my Q can be harassed. But his lsb is trapped in for a couple of moves, and the dsb is also far from my Q. ",
        "11... Nxd2 12. Kxd2": "I though about this: no problem: my R are connected. My K is in the center, but safe... no no, it is not, since I have an echange going on on my d pawn...",
        "12... Nxe5": "Ouch! My fault. A full exchange set, and I would have been safe. But I overlooked it. Now: Bh4 is not really working after Qd7 - the least. But do I want to keep the lsb or not? Sure, it will help him to break in on a5. But without the Bpair, I feel a little unarmed.",
        "13. dxe5": "Now, if d4, Rd1 seems possible (dxe6+, Ke2, Q defends, fxe6...)",
        "13... a5": "This instead. I want to play a4, in order to prevent black from get his B to a5, but I have no time. No choice: ",
        "14. b5": "He can't play a4 or b6.",
        "14... cxb5 15. Bxb5": "My lsb out and with tempo! Wow! I got something. Still, a4 here was deadly for me.",
        "15... Bd7": "If a4 now, BxB, axB, threatening b6 again was the best. But I overlooked the threat on b6, and I had \"an idea\". ",
        "16. Rhb1": "...like swearing the danger in the center was gone. Big mistake. The other rook, maybe, but this one must keep the eye on d8, just in case of... did I forget?",
        "16... d4": "Very embarassing. BxB+ is looming... how can I neutralize it? the answer was given by my opponent when he played Bd7.",
        "17. Bh4": "Who cares about the central pawn? Quitting the Q from the d column reduces the pressure on my position. ",
        "17... dxe3+": "Thank you, dearest.",
        "18. Kxe3 Qe8": "Now he wants to exchange Q. Otherwise, I lose my dsb. It seems he found a good way to defend! Now I saw a shadow of a combination, based on sacrifying the e5 pawn. A dangerous play. ",
        "19. Qxe8 Bxe8 20. Bxe8 Rfxe8 21. Rxb7 Bxe5 22. Rd1": "...the idea was to keep forever one or two R on the 7th. Maybe Rc1, intending to push th pawn, would have been more accurate. It's technique matter, I'm no expert. ",
        "22... h6": "Noak's ark on my lsb. Of course. ",
        "23. f4": "Counter noak's. But Black had a very nice tactic I overlooked. ",
        "23... Bxf4+ 24. Kxf4 g5+": "Of course. Well, they are still a lot of pawns!",
        "25. Bxg5 hxg5+ 26. Kxg5 Rad8": "My advantage factor is the closed position of the BK, while mine is protected by the enemy's pawns. ",
        "27. Rxd8": "I allos his left R to go grabbing my rear pawns in order to set some nasty net up there. ",
        "27... Rxd8 28. c6": "Re7 grants me the two black pawns and the game. But this is... well, a mistake. ",
        "28... Rc8 29. c7 Kf7": "THIS is the reason. Having my K been in g6, now I'll win. But he can escape. Well... almost. He can get my c pawn, but in the meantime...",
        "30. h4 Kg7 31. h5 Kf7 32. h6 a4 33. a3": "Zugzwang... but h7 will win quickly.",
        "33... f4 34. h7 Kg7 35. h8=Q+": "KxQ, Rb8 wins. RxQ, c8=Q+ too. I'm glad to have seen it, this kind of position is always tricky. Thank you for reading, and I hope you get some amusement. Would you have fallen like black did?"
    },
    "url": "https://gameknot.com/annotation.pl/zugzwang?gm=62852",
    "gameName": "Zugzwang",
    "players": "damafi (1486) vs. Marham (1551)",
    "opening": "Queen's pawn, Mason variation (D00)"
}