{
    "moves": {
        "1. e4 e6 2. d4 d5 3. Nc3 Bb4 4. e5 c5 5. a3 Bxc3+ 6. bxc3 Qc7 7. h4 Ne7 8. h5 cxd4": "Samamoodi mängisid Ladva ja Lapidus ka äsjastel juunioride meistrivõistlustel. Siis Lapidus ei võtnud d4-etturit. Etturikahingu vastuvõtmine annab valgele hea mängu ja pole siin mustadele eriti populaarne lahendus. Sellegipoolest on mõned suurmeistrid ka sedasi mänginud.",
        "9. cxd4 Qc3+ 10. Bd2 Qxd4 11. Nf3 Qe4+ 12. Be2 Nf5 13. Kf1 Nc6": "Tundub, et Lapidus ei ole avanguvarianti kodus uurinud, muidu oleks ta kindlasti valinud käigu 13... b6\n",
        "14. Bd3 Qg4 15. Rb1 a5": "Sellised käigud nõrgestavad tublisti musta seisu.",
        "16. c3": "Siin oli valgele väga hea käik 16. h6!\n",
        "16... Rb8 17. Qc2": "Kahjuks ei leidnud Ladva siin plaani musta lipu kinnipüüdmiseks. Tüüpiline trikk on 17. Vh3 ähvardusega Rf3-h2.",
        "17... Bd7 18. Rb5": "Väga hea käik. Nüüd päästab ähvarduse Vh3 ja Rh2 vastu üksnes 18...b6 19.Vh3 Ra7, kuid efektne 20.a4! Rxb5 21. axb5 sunnib musta lipüukaotuse vältimiseks loovutama vankri 21...Vc8 22.Rh2 Ld4 23.cxd4 Vxc2 24.Oxc2 Oxb5+ 25. Od3 ning valgel on vigur kahe etturi vastu ning võidušansid üsna head.",
        "18... h6": "Lapidus ei märka ohtu.",
        "19. Qb3": "Aga ka Ladva ei näe tekkinud võimalust. Lipu võitis 19. Vh3! ühes Rh2.\n",
        "19... O-O 20. Rxb7": "Taas võitis 20. Vh3\n",
        "20... Rfd8 21. Rh3": "Kahju. Alles nüüd teeb Ottomar õige käigu... paraku lippu enam kinni ei püüa.",
        "21... Be8 22. Kg1 Kf8": "Õnnetu käik. Must kuningas jääb f8-l tempotule alla.",
        "23. Kh2 Rxb7 24. Qxb7 Rb8 25. Qc7 Rb2 26. Bxf5 Qxf5 27. Be3 Rc2 28. Bc5+ Kg8 29. Qc8": "Valge võidab viguri, kuid esialgu on asi võidust veel kaugel.",
        "29... Qf4+ 30. Rg3 Nxe5 31. Qxe8+ Kh7 32. Qf8": "Ilus variant oleks tulnud pärast 32. Rxe5 Lh4+ 33. Vh3 Lf4+ 34. g3 Vxf2+ 35. Kg1! Vf1+! 36. Kg2 Lxe5! 37. Kxf1 Lf5+! ning valge peab võidule mängimiseks andma tagasi vankri (muidu igavene tuli), misjärel tekiks aga võrdsete võimalustega seis.\n",
        "32... Ng4+ 33. Kh3 Rc1": "Ladva pidi lipukahingut nägema küllalt kaugele ette...",
        "34. Qxg7+ Kxg7 35. Rxg4+ Qxg4+ 36. Kxg4 f6 37. Nd4 Kf7 38. Nb5 Ke8 39. Be3 Rb1 40. a4 Ra1 41. Bxh6 Rxa4+ 42. Kg3 Kf7 43. Be3 Ra1 44. h6 Kg6 45. Nc7 e5 46. Nxd5 f5 47. Ne7+ Kf6 48. h7 Rh1": "Vajalik oli 48... f4+ 49. Kg4 Vh1\n",
        "49. Bh6": "Ilus löök, mis jätab valgele enamviguri.",
        "49... Rxh6 50. Ng8+ Kg7 51. Nxh6 f4+ 52. Kg4 Kxh7 53. Nf7 a4 54. Ng5+ Kg6 55. Ne4 a3 56. Nd2": "Täpne ratsumanööver lõpeb a-etturi kinnipidamisega.",
        "56... Kf6 57. Nb3 Ke6 58. c4 a2 59. c5": "?? Lihtsa võidu annaksid käigud 59. Kf3, 59. g3 fxg3 60. fxg3, 59. Kg5 jne.\n",
        "59... Kd5 60. Kf5 Kc4 61. Na1 Kxc5 62. Kxe5 Kc4 63. g4": "Veel oli valgel šanss lipulõppmängus: 63. Kxf4 Kc3 64. g4 Kb2 65. g5 Kxa1 66. g6 Kb2 67. g7 a1=L 68. g8=L\n",
        "63... fxg3 e.p. 64. fxg3 Kc3 65. g4": "?? Viigi tegi 65.Ke4-d3-c2",
        "65... Kb2 66. g5 Kxa1 67. g6 Kb1 68. g7 a1=Q+": "Nojah... no comments.",
        "69. Kd5 Qxg7": "Viik? Ilmselt sai mustal aeg otsa..."
    },
    "url": "https://gameknot.com/annotation.pl/vabaetturi-rhv-turniir-tallinn?gm=31900",
    "gameName": "Vabaetturi rhv turniir, Tallinn",
    "players": "Ladva, O.  vs. Lapidus, M. ",
    "opening": "French (C18), Winawer, classical variation"
}