{
    "moves": {
        "1. e4 e6 2. d4 d5 3. Nc3 Bb4 4. e5 c5 5. a3 Bxc3+ 6. bxc3 Qa5 7. Bd2 Qa4 8. Qg4 Kf8 9. Ra2 Nc6 10. Nf3 b6 11. Qf4": "Jürgens Lieblingsaufbau gegen Queen's Blues.\n",
        "11... Nge7 12. Bd3": "Alternative variation: 12. dxc5 Qxf4 13. Bxf4 bxc5 14. Be3 c4 [Das Feld d4 sieht stark für Weiß aus, aber Schwarz hier dennoch sehr bequem.] 15. Bc5 ( 15. Rb2 Ng6) 15... Rb8\n",
        "12... h6 13. O-O": "Alternative variation: 13. c4 Ba6 $15\n",
        "13... c4 14. Be2": "Der normale Plan von Schwarz besteht nun darin, den König nach h7 zu bringen.\n",
        "14... Bd7 15. g4": "Das Jürgen nicht lange wartet war klar. Schwarz kann immer noch mit Kg8-h7 operieren, aber nach etwas nachdenken gefiehl mir eine weitere Option besser.\n",
        "15... Ke8": "Der König wandert seelenruhig nach b7. Weiß kommt auch nur weiter, wenn er seinen f-Bauern in Bewegung bringt. Dafür muss er aber auch Zeit investieren.\n",
        "16. Ne1": "Alternative variation: 16. Nh4 Rf8\n",
        "16... Rf8 17. Qg3 Kd8 18. Ng2 Kc7 19. f4 Kb7 20. Ne3": "Beide Seiten haben Ihre Ziele erreicht und Weiß droht f4-f5.\n",
        "20... f6": "Der Gegenstoß kommt genau rechtzeitig.\n",
        "21. exf6": "Alternative variation: 21. Bf3 fxe5 22. fxe5\n",
        "21... gxf6 22. Bf3": "Verstärkt den Druck gegen d5 und erneuert die Drohung f5.\n",
        "22... Qa5": "22...f5 wäre wahrscheinlich noch präziser.\nAlternative variation: 22... f5 $15\n",
        "23. Qg2": "Alternative variation: 23. f5 e5 $13\n",
        "23... f5 24. g5": "Die Lage im Zentrum hat sich geklärt und nur Schwarz kann noch Druck am Königsflügel ausüben.\nAlternative variation: 24. Kh1 $15\n",
        "24... Ng6": "Nicht schlecht, es ging aber besser.\nAlternative variation: 24... Rh8 [ Danach ist ...Sg6 noch stärker und deshalb ist der Turmzug besser. Allerdings habe ich ihn komplett nicht beachtet.]\n",
        "25. Bh5": "Eine gute Ausrede, die mich zum langen rechnen zwang.\n",
        "25... Rfg8": "Alternative variation: 25... Nh4 [Hier rechnete ich bis zum Remis.] 26. Qf2 hxg5 27. fxg5 Rh8 28. Qxh4 Be8 29. g6 Bxg6 30. Qf6 Bxh5 31. Qxe6 Rag8+ 32. Kh1 Nxd4 33. Qd7+ Ka8 34. cxd4 Qxd2 35. Qxd5+ Kb8 $11\n",
        "26. Bxg6 Rxg6 27. h4 hxg5": "Alternative variation: 27... Rg7 28. h5 hxg5 29. fxg5 Rag8 30. g6 Be8 [ist der Vorschlag von Kommodo, aber zwei so weit vorgerückte Bauern erlauben auch keinen Fehler mehr.]\n",
        "28. fxg5 Rh8 29. Be1": "Die Stellung ist unklar. Jürgen dachte er stünde besser, aber da die Bauern gut blockiert sind, kann davon keine Rede sein.\n",
        "29... b5": "Alternative variation: 29... Rg7\n",
        "30. Ra1 Rg7": "Auf g6 soll bald der Springer stehen und ... b5 diente dazu die Dame einen Weg für die Dame frei zu machen.\n",
        "31. Qf3": "Um die schwarzen Felder auszunutzen, wäre 31.Dg3 stärker gewesen, mit Chancen auf leichten Vorteil.\n",
        "31... Ne7 32. Ng2 Rgh7": "Es kündigt sich ein Qualleopfer an, welches ich auch unbedingt spielen wollte.\n",
        "33. Nf4": "Falls Weiß darauf verzichtet, hätte ich ...Sg6 gezogen mit guter Stellung.\n",
        "33... Rh7xh4": "Alternativen hatten keinen Platz mehr in meinen Gedanken. 33...Dd8 war eine weitere vernüftige Lösung.\n",
        "34. Bxh4 Rxh4 35. Rae1 Rg4+ 36. Ng2": "Plötzlich hat sich die Stellung verändert und Jürgen muss von Angriff auf Verteidigung umschalten, was ihm nicht mehr gelingt. Nach dem Springerzug ist Weiß verloren.\nAlternative variation: 36. Kf2 [Davor hatte ich etwas Angst, da ich mir nicht sicher war, wie gut die Kompensation denn wirklich ist.] Qc7 [Wir haben hier lange analysiert und in einer Partie ist es pychologisch sehr schwer mit Weiß die Stellung zu spielen.] 37. Ke3 (37. Ke2) 37... e5 (37... Rxg5) 38. dxe5 Bc6\n",
        "36... Ng6 37. Kf2 Qd8": "Und auf einmal taucht auch die Dame auf.\n",
        "38. Rfg1 Qxg5 39. Ne3": "Mit wenig Zeit auf der Uhr, ist mir die Schlusspointe erst sehr spät aufgefallen.\n",
        "39... Qh4+ 40. Ke2 Qh2+ 41. Qf2 Nf4+": "Bis hierhin zu rechnen ist nicht so schwer gewesen, aber wie geht es weiter?\n",
        "42. Kf3 Qxf2+": "und nicht 42... Dh3+ was ich die ganze Zeit zum Laufen bringen wollte.\n",
        "43. Kxf2 Nh3+": "Weiß verliert zuviel Material, weshalb Jürgen nur die Aufgabe blieb.\n"
    },
    "url": "https://gameknot.com/annotation.pl/vem-2015?gm=59131",
    "gameName": "VEM 2015, ?",
    "players": "Messarius, Jürgen  vs. Schmücker ",
    "opening": "French (C18), Winawer, advance variation"
}