{
    "moves": {
        "1. d4 Nf6 2. Bf4 d6 3. Nf3 Ne4": "Twice in a day, after thousand of times I play white. It must be the new trend.",
        "4. Nbd2 Bf5": "Even more interesting. This guy is giving me free theory lessons!",
        "5. Nxe4 Bxe4 6. Ng5": "I expected B to retire on c6, but...",
        "6... Bg6": "My knight will be mercislessly kicked away. I have to make some good move.",
        "7. e3": "Not such a great move, but the best. I assure free ways for my bishop and queen, and don't give up the center. ",
        "7... h6 8. Nf3 e6": "Very solid. This won't be easy. ",
        "9. Bd3": "I hate this move, but this time...",
        "9... Bxd3": "Damn, he took. f5 wouldn't have been bad, completely crushing me. ",
        "10. Qxd3": "\"Threatening\" Qg5+, Qxb7.",
        "10... Be7 11. h4": "Played quickly, to counter the space black is winning with his solid pawn chain. ",
        "11... Nd7 12. O-O-O": "Too late to take advantage of the doubious Qb5+ plan. ",
        "12... Nf6": "A faint way to break in would have been g4. If Nxg4, Rg1 is not great but opens a column to work with. But I wanted to prepare it, and I missed a nice countermove. ",
        "13. Rdg1 Ng4 14. Qe2": "Worse than Bg3? We'll see. ",
        "14... f5": "This is becoming a little asphixiating...",
        "15. e4": "Now or never. I have to break in before it's too late. ",
        "15... O-O": "This man is on for giving surprises. Well, ok!",
        "16. exf5 exf5 17. Qe6+ Kh8": "Ok, now what? I have Bxh6 in mind, but the knight must not be there, so I tempted him with a juicy free pawn, when in fact he will just help me to...",
        "18. Rh3 Nxf2 19. Rg3": "...essentially, forcing him back to g5 but having a tempo for doubling rooks on e. In doing this, I'm leaving h4 unprotected. ",
        "19... Bxh4 20. Rxg7": "...and this was MY planned \"surprise. I swore I would retake the bishop on h4, scrambling black 's game in the process. ",
        "20... Qf6": "...but black surprises me anothe time in return! Wow! I wonder if there is a way I can win at least a miserable pawn from all this...",
        "21. Qxf6 Bxf6 22. Rxc7": "I'd preferred h6, but...",
        "22... Rfc8": "Now my blindness was complete. Black is giving me another pawn... what for?",
        "23. Rxb7": "Oh, no! With Nd6+ I lose the bishop! ",
        "23... Rc4": "I couldn't believe he didn't see it, but I played",
        "24. c3": "He deserved it. ",
        "24... Nd3+": "Returning the courtesy.",
        "25. Kc2 Nxf4": "Now the game is really challenging. ",
        "26. Rf7": "Let's take as much as I can. ",
        "26... Bg7 27. Rxf5 Ne2": "It's very tempting Re1, but there are too many pieces pointing to a pinned d4 pawn. ",
        "28. Rd1 Ng3 29. Rd5": "In this situation anything is possible. ",
        "29... Rc6 30. Re1 Rd8 31. Re7": "I realize now this was a bad mistake. I needed b4 in order to double rooks on the Seventh rank. ",
        "31... a6": "Now, it is precluded. Now, how to go on? Nd5 doesn't really work. BxN, and if RxN, dxR is possible because RxR+ is not mate. ",
        "32. Nh4 Kh7 33. Nf5 Nxf5 34. Rxf5 Kg6 35. g4": "I could double rooks, causing him to make any move. Let's try more.",
        "35... Bxd4": "wonderful. I just missed another trick!",
        "36. Re6+ Kg7 37. Re7+ Kg8 38. Rff7": "With the idea to grab h6 via h7. ",
        "38... Be5 39. Rfh7 Rf8 40. Rxh6 Rf2+ 41. Kb3 Rb6+ 42. Ka3 Rbxb2": "Can you believe? I lost two pawns, and in a horrible position. ",
        "43. g5 Rbxa2+ 44. Kb4 Rfb2+ 45. Kc4": "Black will give me to my refuge and I'll mate him.",
        "45... Ra4+ 46. Kd5 Rg2": "Changing technique. It was foreseen.\n",
        "47. Rg6+ Kf8 48. Ke6": "Now, any r movement to the queenside is a mate threat. ",
        "48... Rag4": "My opponent, obviously, after such a brilliant game (except he missed the Nd3+... once), cannot see the trick number a-lot-of.",
        "49. Ra7": "I managed to get into a position where, being a piece under, I have a mate in one no matter what black does. Incredible... Thank you for reading. ",
        "49... Rg4xg5 50. Ra8#": ""
    },
    "url": "https://gameknot.com/annotation.pl/very-witty-game?gm=55428",
    "gameName": "Very witty game",
    "players": "damalfi  vs. player (+1700)",
    "opening": "Queen's pawn game (A45)"
}