{
    "moves": {
        "1. b3": "Hi all! This was the final, deciding game in a recent team match. An early miscalculation puts White a piece down, and the rest of the game sees him trying to compensate for it with sheer aggression. Enjoy!\n",
        "1... e5 2. Bb2 Nc6 3. g3 d5 4. Bg2 Nf6 5. d3 Bc5 6. Nd2 O-O 7. Ngf3": "White begins with Larsen's opening (sometimes also called the Nimzovitch-Larsen Attack); Black chooses the very popular Modern variation. This is all pretty much by the book so far; excepting that generally ...Bf5 is played before ...Bc5. The position on the board is a classic display of the hypermodern style--White makes no attempt at all to challenge the center directly, choosing to allow Black complete occupation in preparation for breaking up that center mass from the wings.\n",
        "7... Re8 8. O-O Qe7 9. e3 Bg4 10. h3": "Still very conservative play from White. There's pressure building on the Black center, but Black is also preparing to play ...e4 while White's Knight is pinned.\n",
        "10... Bh5 11. c4": "? White miscalculates the upcoming combination, thinking to maintain equality and even pick up a pawn on d5 with 11...e4 12.g4 and the resulting bloodbath. Unfortunately, after 12...exf3, Black's pawn has a beautiful line of pieces to demolish, whereas White's will have no such luxury, and White will be forced to drop a piece in exchange for two pawns.\n",
        "11... e4 12. g4 exf3 13. Bxf6 Qxf6 14. Nxf3 Bg6": "Let's take stock of the situation again. White is about to take on d5. He gave up the powerful DSB in order to mitigate his material losses by removing the d-pawn's defender. In some respect, White has actually accomplished a major goal--Black's center is completely wiped out, whereas the White central presence is now pretty strong. Black has a material edge, but lags just a bit in activity.\n",
        "15. cxd5 Nd8": "I think 15...Ne5 was better here. Black is slightly ahead, and could stand to trade off this Knight rather than stuffing it back into the barracks.\n",
        "16. Rc1 Bb6": "Also possible was 16...Bd6, blockading the d-pawn, but Black wants to keep this Bishop lined up on the WK to discourage White from pushing his center pawns too strongly.\n",
        "17. d4 Be4": "The natural move, preparing to eliminate the nuisance at d5.\n",
        "18. g5": "White cannot defend d5 without giving up his LSB, but he can force Black to delay its capture. 18.Ne5 Bxg2 19.Kxg2 might have been more solid.\n",
        "18... Qg6 19. h4 Bxd5": "The miserable Nd8 is free to move again!\n",
        "20. Ne5": "...or not. White continues to construct delays and multiple-threats. To borrow a term from Fred Reinfeld, White's next several 'forcing, violent moves' are all played with the purpose of cramming the Black forces on the queenside and preventing them from participating in the game for a while.\n",
        "20... Qe6": "It was either this or 20...Qd6; Black must defend the Bishop.\n",
        "21. e4 Bc6": "Forced, but not as dangerous as it appears: 22.d5? is an extremely ineffective fork that in fact would lose material for White after 22...Bxd5 23.Qxd5 Qxe5.\n",
        "22. Nxc6": "Strong, and the main goal of this sequence: Black is forced to put a pawn on c6, blocking his Knight and therefore his QR as well. (If 22...Nxc6? 23.d5 wins the piece back for White now that there's no hanging Knight on e5).\n",
        "22... bxc6 23. e5": "Pinning the weak c-pawn so it can't trade itself off, and tying down the Black Q and N to its defense.\n",
        "23... Rb8 24. Kh2": "White's kingside dominion is preposterous, and now that Black is suitably cramped, it's finally time to get the King out of the sights of the Bb6.\n",
        "24... Qf5 25. f4": "Blocking the BQ's imminent invasion at f4.\n",
        "25... Qd7": "Keeping c6 under guard while putting pressure on d4.\n",
        "26. Rc4": "The only defense, but this awkward placement will haunt White for some time to come. Despite the material deficit, White's active forces still give him significant fighting chances. The computer places White just about a pawn's-worth behind.\n",
        "26... Qf5": "Moving back to the square the BQ just vacated, Black is practically begging White to win a pawn on c6 and free up Black's game. This is actually a mistake, I believe: it was better to play 26...a5 and make play on the fragile queenside. The text, unless I am mistaken, allows White to cash in on his huge spatial dominance by claiming a forced draw with 27.Bh3 Qe4 28.Bg2 Qe3 29.Rf3 etc. \n",
        "27. Kg3": "?! White chooses not to take the draw, instead playing for a win despite his serious setbacks. He is going to need to use every piece to its fullest effect to make anything out of this attack, so he brings up his King so it can keep the BQ out of g4 and support Bishop advances. This is the deciding move of the game: White declares that a draw is not good enough: victory or death are the only possible outcomes!\n",
        "27... Qe6": "Retracting the unintentional draw offer.\n",
        "28. f5 Qd7 29. h5 Kh8": "Making room for a ...Rg8 shift. The computer gives White less than a pawn's disadvantage now--but where can White go from here?\n",
        "30. Kh4": "Staying off the critical lines and out of view of the BQ, but wherever the monarch goes, he's going to be blocking a potential line of attack. It may have been better to play 30.g6 immediately.\n",
        "30... a5": "Faced with all this kingside pressure, Black strikes back at White's weakest point--his queenside, specifically the Rc4 and pawns at b3 and d4.\n",
        "31. Qg4 Ba7": "Preparing ...Rb4! Both sides have deadly force and are ready to rumble--the question now is who can bring the hammer down hardest.\n",
        "32. g6": "I still don't know how I feel about this move. There are a huge number of possibilities with complex lines arising from each possible advance. This particular pawn move is the only one that can guarantee White the ability to open a file if he chooses, but it also opens a line to his King.\n",
        "32... fxg6 33. hxg6": "Not willing to force the Queen trade just yet.\n",
        "33... h6": "This is inaccurate, I think. 33...Rb4 looks strong; the g-pawn doesn't really pose a huge threat right this moment.\n",
        "34. e6": "?! With the pawns marched about as far as they can go with so much material still on the board, White now seeks to trade off his Bishop, which has outlived its usefulness to some extent, for the Black Knight, which is threatening to come into play any moment. However, I think this may have been the wrong pawn push--allowing the Queen trade with 34.f6 Qxg4+ 35.Kxg4 may yet allow White to push his kingside advantage without trying to switch flanks.\n",
        "34... Qe7+ 35. Kh5": "??! This is so very, very dangerous. Probably 35.Kh3 was called for, but White is just completely going for broke here and wants his King threatening h6.\n",
        "35... Rf8": "Black halts the f-pawn's advance in preparation for ...Qa3.\n",
        "36. Bxc6": "? Initiating the exchange, with a look to advancing d4-d5 as well as opening space for the Rook. I think this is White's first significant mistake in the latter part of this game, though--by leaving the Rf1 undefended, he allows Black to reactivate his Knight with an overlooked tactic. Of course, the real mistake may have been nine moves ago, when White didn't take the draw when he had the chance!\n",
        "36... Nxe6": "! White cannot recapture, or he loses his Rook.\n",
        "37. Re1": "Questionable at best, though I'm not entirely certain how to improve on it. This still loses an exchange, but the BQ is not nearly as devastating on White's first rank as a Black Rook would have been. Since further material loss is now inevitable for White, perhaps 37.Qh4 Qxh4+ 38.Kxh4 Nxd4 would have been the lesser of the available evils.\n",
        "37... Nf4+": "Ouch!\n",
        "38. Qxf4 Qxe1 39. Bf3": "Seeking to prevent checks along the d1-h5 diagonal, but White's game is pretty well lost now.\n",
        "39... Qb1 40. Be4 Qxa2 41. Rxc7": "Hoping desperately for play along the seventh rank.\n",
        "41... Qxb3 42. Rxa7": "?? White could have held out for a bit longer, though the situation was pretty well lost by now. The text, though, fails to prevent a very slick mate in four. Do you see it? Black does.\n",
        "42... Qh3+ 43. Qh4 Rxf5+": "! Very nice.\n",
        "44. Bxf5 Qxf5+ 45. Qg5 Qxg5#": "Congratulations are due to Black for a very excellent game. White had one brief chance to equalize thanks to his massive pawn front and active play, but demonstrated quite clearly the dangers of pushing too hard for a win in a losing situation, whereas Black defended carefully and patiently, and it paid off in spades.  Many thanks to white_noise for a great game! Comments and ratings on the annotation are appreciated, and thank you all for reading!\n"
    },
    "url": "https://gameknot.com/annotation.pl/victory-or-death?gm=47497",
    "gameName": "Victory or Death!",
    "players": "bwaa (1679) vs. white_noise (1753)",
    "opening": "Nimzovich-Larsen attack (A01), modern variation"
}