{
    "moves": {
        "1. e4 e5 2. Bc4 Nf6": "So, it starts with these moves, automatically made.  redfox17: vote game continues 3) d3 riaannieman: Vote 3) a1 a2- pawn one forward.   ",
        "3. d3": "Now, there were only two voters and despite the difference, this is what was decided.",
        "3... Nc6": "This is where I got a little lost, based on the conversation.  But, I think these two were the discussion before the moves were played.  riaannieman: I still want that pawn out I still say a2 a3. Or maybe h2 h3. Get that pawn moving. Create space for the rook.  redfox17: I'm looking to castle as best move.",
        "4. Nf3": "With that being said, this is what was decided.",
        "4... h6": "riaannieman: Aha!  You see, I've been told over and over to castle as soon as possible, but somehow I always have another priority before I do it. Maybe that is why I don't play as well as you do. I really must start reading more about chess tactics and openings. \n\nPlease help me: why castling now? Which side? \n\nIf I understand that, maybe I will do it in my own games.",
        "5. O-O": "redfox17: made the 0-0 king side castle been waiting to get the king protected.  riaannieman: So the move is Then we need the knight out: g1 f3?",
        "5... d6": "riaannieman: I still want to get the pawn out\nI vote a2 a3. The pawns should advance to seize control. After a2 a3, I would try b2 b4.",
        "6. a3": "redfox17: Vote game white played 6). a3 black to move",
        "6... Be7": "Now archduke_piccolo gets involved.  redfox17: Participation in Vote games All are welcome to update I have a current unrated game with Dan and I must make my moves in our game. I am open to suggested votes and believe for better or worse in taking the moves to the actual game. Lack of participation in the club needs move voters to make the game playable. It doesn't matter when you start to participate. If someone could tally the votes, it is easy to make the move. It's move 7) and I can make a move by votes or the word MOVE to ... in the Subject will be cause to play the move, at least in this game, If there is more structure in future games that would be great.  archduke_piccolo: Something about vote games...\nFor one thing, vote games are very reliant on the active participation by the voting side - and a willingness to discuss their plans. When bigpeta's coaching club was still going, I was invited to play against the team of club members. The result was this game, as annotated by hogfysshe. It was a tough, even game until deep in the end game when a very subtle oversight tipped the balance. \ngameknot.com \nAt move 9 you will find in the comments a link to the club forum thread with all the discussions.  This current game...\nStarted out as a 'Bishop's Opening' and old fashioned line that has, I believe, undergone a little bit of a revival since GM Bent Larsen's experiments with it in the 1960s. Black has played a species of Hungarian defence against it (the DSB's development on e7, rather than a fianchetto bu ...g6 and ...Bg7). As White has yet to mobilise the Q-side, and there is no other compelling plan that suggests itself, I'd probably be inclined to bring out the minor pieces, 7.Nc3, say. \n\nBut where should the bishop go subsequently? Be3 suggests itself, but Black might then play ...Ng4. Do we want to exchange B for N on e3 (losing the 'minor exchange' and doubling e-pawns, but strengthening the centre and opening the f-file). If this is unattractive, then we either develop the bishop to d2, or pre-empt a Black minor piece's incursion at g4 by h2-h3. \n\nBut that can wait upon 7.Nc3. \n\nA whole different plan does occur to me here, though, which involves a breakout in the centre: 7.c3; 8.Re1; 9.d4. Is this playable?  riaannieman: I suggest b2 b4. That is a start to attacking the knight on c6  redfox17: vote game 1 vote for b2 h4 has been suggested. I suggest h3 it prevents Bg4 pin on our knight on f3. \n\n1vote for b4 \n1vote for h3 \n\nClub-members, can you give us a suggestion 7.c3; 8.Re1; 9.d4. is on the table, We still have 2 un-developed pieces on the base line.  archduke_piccolo:   If it is OK for me to vote...\n... then I plump for the developing move, 7.Nc3. \n\n(In my previous post I suggested the 7.c3 line, but on the whole the knight move seems to me more circumspect. For the rest, I have no real objection to 7.b4 nor 7.h3 if the panel prefers one of them).  redfox17:  this vote game all can vote or make suggestions\n1 vote 7. Nc3 developi",
        "7. b4": "redfox17: 7.b4 played by us.  Black to play. Lets discuss possible moves made by black \nvote game after black moves 7.\n7.\tb4\tBg4 \n8.\th3\tBh5 \n9.\tNbd2\tNd4 \n10.\tBb2\tNxf3+ \nThese are my votes for white if black plays as shown. \nIf anyone else can suggest moves, we can move forward to what black plays. \n\nChess is turned based but you can look ahead in your games. This is just 1 line from projected move 7 by black.  riaanieman: I think we should start to develop the assets\nWe have much firepower still stationary and it should be developed. To do that we need to create some space in the middle. I would like to see the center cleared of opposition, therefor I suggest to move the pawn on c2 forward to c3. My tactic would be to move the pawn on d3 to d4, therefore forcing an exchange and thus gaining control of the center. Now we would have room to move those assets at the back forward and take control of the game. \n\nThe position of the king in that ally behind the pawns seems very dangerous to me. I have used that many times to clinch a game. If you force the king towards the corner it is trapped and ready for mate by a rook or queen. Those three pawns should be set up to give the king some protection, space to move out of danger and at the same time foil an attack from that side. It is something to keep it mind as a secondary priority. I like to have an asset such as the knight or rook in position there to assist the king. \n\nIn my experience and tactics we should also start thinking of exchanging stronger assets besides the exchange of pawns in the center which should be advantageous to us. If you know your opponent, one could exchange our least favorite asset for a favored one of his, for example a knight for a bishop or bishop for bishop. This is something to consider later.  archduke_piccolo: Black's potential responses...\nCan I just say here that the proper time to discuss these would really have been before we played our 7th move. just sayin'...   \n\nBlack's most likely move is 7...0-0, for two reasons. Rather than play a minor piece to b4 right now, Black might want to wait a move to see what we intend, for instance, to move the Q-side bishop to e3, when Black MIGHT consider ...Ng4 in reply (He might not, too). In addition, it places the K in a safe spot and brings out the rook. \n\nIf Black were now to play 7...Bg4 (threatening 8...Nd4), how should we respond? I'd be quite happy to strike at the bishop by 8.h3, but what if 8...Bh5? Well, we could try 9.g4, but I'm pretty uncomfortable with that sort of move. When it is good, it is usually very good indeed, but often it can be cripplingly weakening. We would have to be very confident of our prospects I think before playing such a move. Still, the upside is that after 9...Bg6, the bishop is for the time being locked in, so I wouldn't rule it out by any means. \n\nI'd probably be more inclined, though, (after 7...Bg4 8.h3 Bh5) to play 9.Nbd2 and then work on unpinning the f3-knight (Qe1, say, or c3 then Q",
        "7... O-O": "archduke_piccolo: Still on Black's agenda...\n... are the possible moves ...Bg4 and ...Be6. He might even be considering playing 9...Bg4 10.h3 Be6. If we play 9.h3 now, then I think 9...Be6 would be a very likely response. Something to think about. \n\nMy candidate moves (in no particular order of preference): \n8.h3 \n8.Be3 \n8.Nc3 \nBut I am open to other suggestions (8.c3; 8.Bd2, even 8.Re1, say, seem reasonable).  riaannieman: Your first choice is also mine\nYes, I think h3. That would have been my vote. However, I am also keeping in mind my earlier suggestion: the center needs to be taken control of, or at least opened up for our assets to be developed. To me that is pressing harder and harder; very soon we would have to do something about it (but not immediately).  redfox17: vote game\nI see 2 candidate moves in addition to h3 from Ion \n1 vote also from Riaan for h3 and I like h3 \n\n3 votes for h3 and was played as requested. \n\nWe should attempt to suggest new possible moves prior to what black may play.  archduke_piccolo: Just to be clear...\nI probably would have preferred 8.Nc3, but in my view there was not enough among the 3 'candidates' I suggested to come down hard and fast on any of them. 8.h3 just happened to be the first I noted down. But the pawn move is fine, and does narrow Black's range of options. \n\nAt this point I am half-expecting Black to play 8...Be3, to which I suggest 9.Nbd2 or 9.Nc3. I remain, however, open to other suggestions. (I would not object to 9.Be3, for instance). \n\nAgainst anything else, I'm inclined to take a 'wait and see' attitude. Black has no immediate threats that I can see, so we can here afford to wait.",
        "8. h3": "redfox17: Vote game Black to move \nBlack I think will play Be6, leaves us 2 moves that are developing moves Nc3 and Be3 not in this order. Anyways lets Black make his move. We can then make our votes as to what we think is best and why. \n\nThe game is even piece wise but white is not developed as much as black.  riaannieman: I agree\nBlack will probably play Be6. I don't think it wise to exchange assets at his insistence and think we should try to 'inconvenience' him and try something unexpected. If he doesn't mind losing the bishop, he may put more value in the abilities of the knight, and those would then be my target. Let us see how that develops. \n\nIf he doesn't move that bishop, I see him developing the queen side at this time. That would have been my strategy. So I am thinking in the line of moving that pawn of ours on b4 up one, and backing it with the pawn on a3. \n\nSo I have two options in mind when we get to it. It all depends on the next move by black. ",
        "8... a6": "archduke_piccolo: Only a moderate surprise...\nI thought 8...Be6 much more likely, but this pawn advance, possibly heralding 9...b5 did cross my mind. As I didn't think it imposed on White in any way, I didn't comment. It is just possible Black is thinking in terms of developing the QB via b7. \n\nWe might as well, then, develop our Q-side - Nc3 and/or Be3. Normally one develops knights before bishops on any given side, but this is no cast iron rule. We might want the QN to develop at d2, in which case, I'd prefer to move B-K3 (Be3) first. Mind you, 9.Nbd2 and 10.Bb2 is a playable enough sequence. I'd be prepared to go along with that. \n\nMy own preference is for the straightforward 9.Nc3, but there isn't much in it.  redfox17: vote game\nWe have some extra time as Dave set vacation flag for 3 days and he has 33 games total in play. \nSo we can continue to discuss things until he takes his time off. Could also see if anyone else is interested in helping us with move suggestions and discussions.  riaannieman: My suggestion\nI suggest to move that pawn on b4 forward, and then get it backed up by the pawn on a3. After that we need to develop our assets in a hurry; we are at a tactical disadvantage because we have no mobile assets yet.  archduke_piccolo: Let's look at 9.b5...\nIt is possible that Black had reason to apprehend that move, so 8...a6 was less a waiting move than a preventive one. For mine, b5 is not a move that comes to mind right away, but if it had served (or serves now) to disrupt Black's game, then it is worth thinking about. \n\n9.b5!? axb5 \n10.Bxb5 Bd7 (This seems to be the move most called for here...) \n11.a4!? ... \nI wonder if we really would want to play 11.a4 at this point. The pawn, isolated as it is seems to me better placed on a3, but stand to persuaded to a different view. Shouldn't we rather play one of the unmoved minor pieces instead? \n\nHaving said that, I feel that Black is by no means inconvenienced by this sequence, and we might have harmed our own game - not by much, but something we might be better avoiding. We would be left with an isolated flank pawn on a file half-open to Black's rook(s). \n\nRiaan has indicated we ought to get our Q side mobilized quickly, and I agree. It is probably better not to wait upon 9.b5, but shovel B and N out now-ish: 9.Nc3  redfox17: Vote looking at 9.\n9. b5 does attack the knight which can then advance forward gaining tempo for Black. \n9. Nc3 is a developing move for us gaining us the tempo. \nI would not develop our DSB yet, Our Queen can also wait to be moved at this time. \nLooking at the game Fen diagram we have followed the basic rules of development. We have only moved our developing pieces 1 move each. We have castled getting our King safer.We have not moved out our Queen early in the game prior to minor piece development. \n\nMy vote for 9. is Nc3.  archduke_piccolo: I ought to have added...\n... that I didn't really see that our cause was much advanced by 9.b5, either - not now at any rate. ",
        "9. Nc3 Be6": "redfox17: It's our turn to move. \nwhat are are strengths? \nWhat are blacks strengths? \nDo we develop our DSB to e3 next? 10. Be3 \nWhat is Black likely to play in the future. We need to think moves ahead, not just 1 move at a time.  riaannieman: I don't think we should allow the exchange the ishops\nIn my opinion we should have frustrated the efforts to exchange until we are satisfied it will gain us a strategic advantage. That will not happen now. Unfortunately the exchange will happen no matter what. Our next option is to make the exchange in such a manner as to gain us the most advantage. Will attacking the opposing bishop where it is now be the best? Should we let him attack and make the exchange closer to 'home base'? Is it an option to ignore the pending exchange and launch another option? \n\nWe need to create some space somehow. Usually I would use the paws for that.  redfox17: Vote game\nlets look at some candidate moves... we are not forced to take Bxe6 yet \n10. Nd5 Bb2 Bd5 \n\nthese moves will let us wait and see what black does.  riaannieman: \n  What happens if we take the opposing bishop?\nIf we take the opposing bishop I think his only option to exchange is using the pawn. Will that create an opportunity for us? The line towards the rook and king at the back is open.....  redfox17: Vote game\nClick on the Fen diagram to analyze. I took Bishop and looked at counter play by black taking with pawn which doubles up pawns. I also looked at not taking back the piece. Eventually I retreated the Bishop. The question is would this really happen? What do you see happening with 10.Nd5? \nI Think Black would bring out his Queen. The other candidate move was developing our basline Bishop to b2 or d5. Lets keep up our discussion, you never know if someone might give some further assistance. At this point lets put on our thinking caps and look out a few moves. That is most hard when you reach a delicate position. We want to come out ahead with an advantage.  archduke_piccolo: Big think time...\nI had half an idea that our 9th move would 'induce' this bishop move by Black. It was certainly on the cards. What should we do then? We can: \n1. Exchange on e6. Reasonable, but let's see if we can't do better. \n2. Move the bishop and permit its exchange on another square (e.g. 10.Bd5). \n3. Play something else and allow the c4-bishop to be exchanged on its present square. The move 10.Be3 comes to mind, with 10....Bxc4 11.dxc4 likely to follow. \n4.Block the line of the confronting bishops, viz: 10.Nd5. \n\nWhat I'll do now is carry out a 'Karpov' style evaluation of the position. I won't be doing this often!. During its course I'll touch on the alternatives I have suggested. \n\nEvaluation: \n1. Material relationship: \nDead even. Early days. \n\n2. Presence of direct threats: \nIf you think of the likely exchange of bishops on c4 or e6 as a 'direct threat', there isn't anything much imminent. \n\n3. King position and their safety: \nBoth Kings safely castled short; both 'castles'",
        "10. Be3": "Vote game 10 Be3 played  Be3 was voted for by White, It is now Black's turn to move  If taking the attacking Bishop on e3 was moving to Be3. Not meant to be taking as by Bc4 xBe6. ",
        "10... d5": "redfox17: Vote game 11. White to move\n I think e Pawn takes pawn on d5 is my vote. 11. exd5  archduke_piccolo: Agreed.\nI rather thought - or second thought - Black might play this advance. I don't think it really matters all that much how we take on d5, but take we really should. I prefer the pawn capture as it 'forks' two Black minor pieces, and carries on the exchanges. So we should probably be prepared to exchange two pairs of minor pieces to follow: \n\n11.exd5 Nxd5 \n12.Nxd5 Bxd5 \n13.Bxd5 Qxd5 \n... \nWhat to play at this point? We should probably decide now, as such a decision would inform us whether or not to pursue all three moves of exchanges. I quite like 14.c4, even though it seems to leave the d-pawn backward and weak. I think that after the Q moves, we can look at the 15.d4 break. \n\nMy vote for move 11: exd5.  redfox17: Vote game 11,12,13\n2 votes for 11. exd5 \n\nExchange as follows if played \n11.exd5 Nxd5 \n12.Nxd5 Bxd5 \n13.Bxd5 Qxd5 \n\nThis is the expected exchange and asking for one more vote preference before playing.  riaannieman: The next three moves are straightforward\nI agree with the proposal. We exchange assets and the queen moves up, which I like. We just have to make sure about the tactics after that. What are we going to do? We need to explore our future tactics. \n",
        "11. exd5": "redfox17: 3 votes for the expected exchange 11,12,13\nOk move 11. exd5 has been made  And, the day after that, without discussion, the other two moves were played.",
        "11... Nxd5 12. Nxd5": "A few moves have been made without a discussion, either, up to my surprise.  It was, however, the continuation of the exchange variations that was mentioned by ION earlier.   ",
        "12... Bxd5 13. Bxd5 Qxd5": "At this point, redfox17: White to move 14  Vote game\nI vote c4 and expect Qd7 or Qe6 \nWhere black moves is not as important \nAre there any other candidate votes?  archduke_piccolo: H'mmm...\nI was thinking 14.c4 as well. There is a downside to the move that we should think about, though. That is the d-pawn that is being left backward and weak. If we let that sit, Black will no doubt pile pressure on the thing. Probably we can hold, but I would prefer not to be forced to do so. So I am considering following up the c4 advance with the immediate 15.d4 break. \n\nThis is likely to result in the further exchange of a minor piece, but what we are left with is a late middle game with symmetrical pawn formations. Our winning prospects are vanishingly small, I accept, but I do like our prospects of keeping the draw.  ",
        "14. c4 Qd7 15. d4": "redfox17: H'mmm...\nmove 14. c4 2 votes with 15. d4 there after 2votes Move has been made  ",
        "15... exd4": "redfox17: Vote game Black played exd4 \nWhite to play \n\nMy candidate Vote is to take with our Bishop 16. Bxd4 \n\n\nIf we take using our Knight I think Black could attack with his BISHOP to f6 and would have 3 attacking pieces the d4 square. \nThat is why I think taking Bxe4 is best and is my vote for 16. Bxd4  archduke_piccolo: Good point...\nSomething we have to consider very carefully. \n\nThe concern I would have with taking 16.Bxd4 is that after 16...Nxd4 17.Qxd4 Qxd4 18.Nxd4 we would be facing an endgame with knight against bishop on an open board. Objectively, such an ending ought probably to be tenable, but it would not be easy! The bishop is much more mobile, and would have an edge - enough to keep us on the hop - in the ensuing game. One thing for sure: we should be reluctant to exchange more than one pair of rooks subsequently, though the exchange of minor pieces would (in general) suit us. The symmetrical pawn formation and large numbers of pawns would probably favour our survival at any rate, though I would have preferred the Q-side to be less far advanced! \n\nI think I might have a tactical answer to 16.Nxd4 Bf6, at least to the threat it carries, but I'll leave it for youse guys to test out for the next, oh, shall we say 24 hours or so? \n\nThis is where we will have to calculate actual moves and sequences of moves. The question is, is 16.Nxd4 playable? How playable? If we find that it won't do, then we can at least fall back on the 16.Bxd4 line.  riaannieman: I like the advanced queen side. I think it creates opportunities.  I don't think we should exchange assets now. Set up a stronger attack. That pawn will stay right where it is for now. In my opinion we are in a bad strategic position and we will lose what little we have. We have two static rooks- get them moving first. \n\nI am also thinking of doing something unexpectedly, like advancing the pawn on b4 to get that knight out of there. Obviously the pawn will be taken, but exchanging with our other pawn still puts that knight under pressure. We will first need to get the queen side rook covered by the another asset instead of the queen. \n\nThe proposed exchange on d4 will force our queen to keep on covering for a while, effectively pinning her down. \n\nI don't follow the long discussion and explanation yet; let me go over it slowly on my chess board.  archduke_piccolo: Can I say this, though: we really must recapture the pawn on d4. Recall that right at the moment we are a pawn down, and if we don't restore the balance at once, we'll stay a pawn down, with very problematical chances of saving the game. Further mobilization will have to wait. \n\nIf we do give up (cede) material, we must have somethng for it in terms of time and/or space. We have no such advantages to justify letting the pawn go. So right now only two move come into serious consideration (as far as I can see): 16.Nxd4 and 16.Bxd4. \n\nIf you want to minimise exchanges, then after 16.Nxd4 Nxd4 we could retake with the bishop 17.B",
        "16. Bxd4": "redfox17: Misplayed 16 accidently 16. Bxd4\nThere are no take backs in chess, Black to move... \nI misplayed 16 accidently as Bxd4. with one click. I am sorry, but the game goes on... riaannieman: That take-back button!\nI've looked for it myself often. What will black do now?  redfox17: No Take backs here unfortunately\nI will update the board with the current position. I'm like the manager or coach for this team game and I can let everyone know if we lose it's my fault. Anyways the game is not lost, It will most likely have faster exchanges.  archduke_piccolo: Too bad...\n... we'll just have to take our lumps. \n\nIt is very likely Black will play 16...Nxd4, whereat our choice (to maintain the material status quo) will be between 17.Nxd4 and 17.Qxd4. \n\nWhat I have to say at this point is 'first pass' - I am very open to correction here. My preference will be to take with the knight (if we can), effectively enquiring of Black if he wants to keep the Queens on. If he replies (to 17.Nxd4) with 17...Bf6, then 18.Nf3 will, one way or another, preserve our a1-rook. \n\nThe reason for not offering the Queen exchange ourselves has to do with timing. If we play 17.Qxd4, then 17...Qxd4 18.Nxd4 Rfd8 (say) 19.Nf3 and Black achieves control over the d-file. If we take with the knight, then 17.Nxd4 Rad8 18.Nf3 and now if 18...Qxd1 (unlikely, but suppose) 19.Rfxd1 Rxd1ch 20.Rxd1 and White has control over the d-file. \n\nBlack will not want that to happen, of course, but at worst (it seems to me right now) we will be better placed to challenge Black's possession of the central files. ",
        "16... Nxd4": "redfox17: VOTE GAME OUR MOVE 17 take our lumps Nxd4 white to move...  Vote game  Change in my vote I think we can first try Nnd4 and play out the lines from there. It looks better now to me and I think Ion is in agreement. \n\nNow we could have 2 votes for 17. Nxd4 pending Ion affirmation.  archduke_piccolo: Little difference...\nBut further investigation hasn't revealed any hidden nastinesses against 17.Nxd4, so I vote for that. I have given some reasons. But there is another. In end games featuring a Queen, the knight often works better than a bishop. So I won't be put out if Black offrs to exchange off all the rooks... \n\nMy vote: 17.Nxd4. ",
        "17. Nxd4": "riaannieman: Keep our knight\nI am feeling more strongly about that knight as the game goes along. I think we should try to keep it safe for the end game where it would probably be put to good use, more so than a bishop. \n\nMy suggestion is to start moving the rook on f1 now. I propose to get it moving towards the white queen, trying to skewer her in front of another rook or even better, the king. The other option that I think of is the three pawns on a-c, which still holds some promise is we can move one of them past the enemy lines and force white to sacrifice a good asset to prevent us from promoting. We may be able to get out of such an exchange one up, if we plan it correctly. I believe if we use the rooks in concert we will be able achieve that.",
        "17... a5": "redfox17: vote game  Black played a5 White to move  Now we can discuss candidate moves. Distraction is a tactic I try to use and this moves does this in an attacking way. Our pawn on b4 is under attack. Nc2 would protect our pawn on b4. \n\nOur pawn on c4 is hanging. moving it to c4 would link up our pawn chain. \n\nblacks rooks are connected and ours are not. \n\nWhat do you think about the position now? I believe blacks dsb could easily skewer our knight if we don't move it. Rook on a1 to b1 stops the skewer attack. \n\nUse this board to analyze. click on it and look for our best candidate move. riaannieman: Yes the rook is in danger\nI think we should start with rb1 (hope I got it right!). Then we get the knight in a better position.  redfox17: vote game\n I clicked on the board above and played for example \n\n\n1.\tRb1\taxb4 \n2.\taxb4\tRa4 \n3.\tNc2\tBxb4 \n4.\tNxb4\tRfa8 \n\nI'm not saying this would happen but do what I have done to analyze the board. See if you like anything. We are not in a bad position yet! \n\nWe just need to play carefully.  riaannieman: I see it that way as well\nIt seems to be the most obvious play  archduke_piccolo: I must admit...\n... to being a little bit concerned that Black might play this. It is an attempt to win a pawn 9...axb4; axb4 Bxb4), or else split our Q-side (bxa5). That they can become targets can be the problem with advanced pawns in the ending. That does not prohibit such advances, of course; merely indicates that care is needed. \n\nIn the line suggested by redfox17, I think he has forgotten the BQ stands unprotected. But at least gives us something to work on. \n\nredfox's idea of moving the knight makes sense. I don't (much) like 18.bxa5, here, as it leaves our pawns split and isolated. If it turns out to be our best move, then we should certainly play it. But a knight move, exploiting the BQ's lack of immediate protection, should give us time to counter Black's threat against our Q-side. We ought at kleast to consider it. \n\n17.Nc2 ... I had not previously considered, myself, but it looks reasonable, if maybe a little passive. It does gain us a wee bit of time. Black must choose between [a] exchanging queens, [b] protecting his Queen, or [c] moving his Queen. \n\nAfter 17...Qxd1 18.Rfxd1 Bf6 19.Rb1 ... (I'd be a bit worried about leaving the rook loose on a2) 19... axb4 20.axb4 ... (I'll leave youse guys and gals to check out the alternative recaptures...) 20...Ra2. \nThe establishment of a Black rook on our second rank would be a development not to our liking, methinks. \n\nInstead 17...Rfd8 18.Qxd7(?!) Rxd7 19.Rfd1 Rad8 20.Rxd7 Rxd7and although White can pick up the a-pawn (21.bxa5) 21...Rd2, in combination with ...Bc5 or maybe ...Bf6 probably more than compensates Black for his (temporary) pawn deficit. \n\nOf the possible Q-moves, it is hard to pick which Black might play: ...Qf5, ...Qe6, ...Qc6, ...Qa4. Of these, 17...Qc6 seems likely enough: \n17...Qc6 18.Qe2 Bf6 19.Rb1 axb4 20.axb4 ... (20.Nxb4 Qa4) 20...Ra2. \n\nThese are merely ",
        "18. Nb5": "riaannieman: We are waiting for black?\nIf I was black I would try to save the queen for now and exchange later when there will be an advantage afterwards. However, I can't predict with certainty what black will do; it seems that the majority opinion is an exchange with white. \n\nI thought that our move 18 would be rb1, but instead it was kb5. I'm not sure what to do next. There is a little attack on our pawn on b5, which I can't see us getting out of ahead. If we retaliate and exchange the pawns on b5, our rook is vulnerable and will most probably be taken. If we don't retaliate we are 1 down, and at this stage in the game will be fatal. \n\nOur best hope is to position the knight to make the most of an opportunity later. It may be that we can force black to position the king and a rook in a position for a nice fork with our knight. I think the possibility of a pawn 'push' on a-c is now gone.  archduke_piccolo: I think...\n... things might be getting away from us a bit. I hadn't quite yet voted for 18.Nb5, merely stated that was where I was leaning. I think I would have voted that way, though. \n\nBut I was hoping others would get in their arguments before we made a decision. \n\nRather belatedly let's revisit 18.Rb1. Before doing so, I should mention I looked at redfox17's continuation, and simply forgot to go back to Riann's original idea. It is easy to see the motivations behind it. For one thing, it obviates any pin along the dark long diagonal (a1-h8). But it also beefs up the defences on b4. How might the game then proceed? \n\n18.Rb1 axb4 \n19.axb4 ... \nOnly option: 19.Rxb4 loses the exchange after ...Bxb4. \nAt this point, a small tactical idea comes to mind: \n\n19...Bxb4 \n20.Rxb4 c5 \nForking rook and knight. Does this mean Black wins a pawn? Let's continue: \n\n21.Rb5 ... \nNow, if 21...cxd4 22.Rd5 looks awkward for Black to meet. But how about... \n\n21...Qxd4 \n22.Qxd4 cxd4 \n23.Rd5 Rfd8 \n24.Rd1 Rxd5 \n25.cxd5 Ra4. \nAlthough this line isn't definitive, it seems to indicate Black might come out of 18.Rb1 with a little bit of an edge, and maybe gets to win and keep an extra pawn.  riaannieman: Sorry, I am out of ideas for now. I really don't know what to do. I will follow the suggestion of the better players and try to understand. At this stage of the game, if I was playing alone, I probably would have lost quickly. From here on is why I am involved- I want to learn.  archduke_piccolo: Riann -\nI - we - should still value your input. Whether your suggestions are good or not so good, I think you will find the exercise more valuable if you do come up with your own ideas. \n\nIn my view, your previous suggestion (Rb1) was quite plausible, and worth investigating. We were too inclined to pass over it I think. Sorry about that. \n\nHaving said that, this game is turning out to be not so easy to play. There isn't much concrete upon which to fasten a plan, and the game being symmetrical and balanced (barring the minor pieces remaining). But that is all the more reason t",
        "18... Qc6": "At this point, I become involved in the club game.  This happened, just after I rejoined the club, but this time, for good.  redfox17: new board our move 19.  white to move  pawn on c4 attacked by blacks queen \nRook to c1? what do we want to do next? \npawn on b4 has 2 attackers but is defended by pawn on a3 \nblack has undefended bishop on e7  riaannieman: @Ion\nYou are right in everything you said, and it was indeed my intention just as you describe. It's just that I am out of ideas right now. I'm sure I will spot something soon..... I will say so when I spot it. Usually at this time of the game I will move without aim, just getting my assets together and covering each other until I can formulate a new plan. This will be interesting to watch now.  archduke_piccolo: @Riann...\nI can understand that. I'm not finding it an easy matter to find moves here, nor accurately to predict Black's responses. Well, I can, but only because I am canvassing multiple moves. \n\nBlack has just played 18...Qc6. I considered this about as likely as Q exchanges, but you will see that I spent more time discussing the latter. But that was because the exchange led to lines more easily calculated. \n\nBlack's move threatens two of our pawns, the c- and the b-pawns. Faced with this sort of thing we look for: \na] Direct defence, \nb] Indirect defence, \nc] Counter-play/ counter threats. \n\nHere, the most obvious - and it looks like the only - direct defence for both pawns is 19.Qb3. A counter threat worth looking at might be 19.Qe2, attacking the Bishop. At the moment (I'm in a bit of a hurry) I can't find anything that might constitute an indirect defence. \n\nPerhaps I should explain that concept. 'Indirect defence' involves methods that, whilst permitting a capture, imposes a cost upon it. Immediate recapture is simply 'direct defence'. 'Indirect' is less straightforward.  jkarp: I like unrated club games. But, I was inspired by ION himself since I was there in the WTWLTR Club. And, it was the first time I saw an unrated club game. Then, as I saw more in that club, I did more of that in my club. So, without further adue, as it is hard to find a good move, I have a very slight preference for Qd6, as there is some pressure on the d file and while no biggie, we have the h pawn pinned. Again, I don't know what the best move, and I thought of a good move before this. But, the move I vote appears better, and as they say, \"When you think you have found a good move, look for something better.\"  archduke_piccolo: Joe...\nAre you thinking of 19.Qd5, and referring to the a-pawn?  redfox17: Joe Vote 19  My vote is 19 Qd5 my first choice it offers queen exchange and protects c4 hanging pawn \n2nd choice Qd3 as both connect are rooks and protects the hanging pawn \n3rd choice Qc1 protects the hanging pawn but rooks are not then connected. \n\nBe sure to use the board I posted in the threads above \n\npawn on c4 attacked by blacks queen this pawn is hanging!! \n\nRook to c1? also would protect c4 but then",
        "19. Qb3": "redfox17: 19. Qb3 most votes was played\nWe played 19. Qb3 Black to move \n",
        "19... axb4": "redfox17: Vote game 20. White to move\nBlack has played \n19.\tQb3\taxb4  jkarp: Very complicated position. Now, I asked myself a question, if white takes back with 20.axb4, is there a threat we were missing. I clicked on the fen, and then analyze. My determination is that there isn't, and if we don't take, black winds up a pawn ahead. But, if we recapture, it becomes an even exchange. So, my vote is 20.axb4  redfox17: Vote game 20,\n20. axb4 1 vote \n\nOn page 6 now and need to look back at diagram. \nI will post my vote with a new diagram, I am still \nnot sure if this is some kind of threat as Joe said  2 votes game 20\nI vote with Joe 2 votes 20.axb4 \n\n\nWe take back pawn and he may take our a1 rook which we recapture. \nThen we just need to be sure to protect our knight. \n\nThe end game is our Knight against a DSB. If the queens come off this will be a hard game for us. \n\nWhat do we want do do for move 20. that is our next move. Any one can post a current fen diagram if they need it to decide the next move.  archduke_piccolo: I think the situation here is clear cut: we must retake the pawn. \n\nMy vote: 20.axb4 \n\nI don't mind if Black exchanges a pair of rooks - don't mind (in principle) if all the rooks come off. If we get into a Q+N vs Q+B endgame, we'll be doing reasonably well. The reason is the Q and N complement each other very well in end games. In such an ending, Q/B will have a slight edge in mobility, but the Q/N will generally be the handier (especially as the bishop's influence will be on one colour of squares). \n\nHaving said that, would Black be willing to shed all the rooks? I think he might exchange one pair, but maybe not the other. \n\nOne thing I would suggest: that if the exchange of Queens is in prospect, that we should look to get something extra (not necessarily material) to sweeten the deal for us. Or, of course, we should have to accept the swap if that is the only way to avoid incurring a worse outcome. \n\nSo, all other things being equal: \nI'll be happy to exchange rooks; \nI'll be happy to exchange minor pieces (bishop for knight); \nI'll be happy to exchange pawns; \nI'll not be so happy to exchange Queens. \n\nAll if this might indicate a plan for Black: to force the Queens (if not all the major pieces) off the board. Note...\n... that what I have said above is not cast in stone. Circumstances may well arise in which the relative values change. If you played through the line I posted In parentheses on 1st May, you will see that Black offers to exchange rook for knight, and is later even prepared (apparently) to give up a whole rook. Whether the 'exchange sacrifice' would have been sound, I don't know for sure, but so sound is the subsequent rook 'sacrifice', it is no sacrifice at all. redfox17: Vote game 20 axb4\nWe have 3 votes for axb4 \nThis is a forced move in sorts, if we don't recover the pawn. Whats to stop black from taking another pawn. I will make this move. \n  \n",
        "20. axb4 Rxa1": "redfox17: 20 triggered conditional move by black vote 21.\nWe need to take back with our Rook on f1. \nThat is my vote 21. Rf1xRa1  riaannieman: \nOh boy the time zones.....\nI wanted to propose that we delay the exchange of pawns but the decision and move was made while I was sleeping. I also wanted to argue against the exchange of rooks at this time; I am perfectly happy to exchange but I wanted to force the exchange at a time and place where we would be left with a tactical advantage. To me this exchange was not in our best strategic interest right now. We have no option but to retake that opposing rook. This takes the initiative away form us and we will now be kept running for a while. We are now on the back foot but we don't have another choice. \n\nExchange, then. It is inevitable. I doubt that black will willingly exchange the other rook as well. \n\nWhat is going to follow will be more or less predictable. The only small advantage we will have is the knight over the DSB. We need to keep our assets off the dark squares, and use the knight to (hopefully) create a conundrum from which black won't be able to escape. With less opposing assets on the board this will be less likely to happen for us. \n\nMy original idea was to use the knight to create a fork which would give as a good advantage. It is easier to do this when the opponent has more assets on the board. Now we will have to rely on the knight to negate the opposition's assets, at best. It is going to be an uphill battle. The only possibility that I can see right now is to take a pawn and hope that one point advantage will be enough to cinch the game for us. \n\nForgive me if I think in military terms. I plan on strategic, tactical and operational level.  archduke_piccolo: Time zones...\n... I tend to find this a problem, too, living as I do at the ends of the earth! \n\nI have expressed my own views on exchanges in my previous posting but one: rooks, yes; minor pieces, probably yes; pawns, yes; Queens, no. But I agree that we have to be alive to the nuances of the position. \n\nThis present exchange doesn't hurt us, and we really had to take the pawn back at once anyhow. But after we play 21.Rxa1 the game enters a new phase. \n\nRiann is correct to imply that there is a battle going on for the initiative. Right now it is up for grabs, though Black does have this advantage: it's his move! \n\nOur problem is that we are lacking targets to hit. The enemy is better off slightly in this regard. Our Q-side pawns are just a little bit easier for him to come at than his are for us. On the K-side, we have a slight weakening of the dark squares - the same squares as the enemy bishop operates on. That the Black K-side is similarly placed is immaterial, as we don't have the light-square bishop to exploit it. These little features don't amount to much in themselves, but they do give Black something to work on that we don't (yet) have. \n\nMy assessment of the situation is that Black has a very marginal edge, but the ga",
        "21. Rxa1 Rd8": "redfox17: Move 21 made and we got another conditional move Move 22.  After taking Rxa1 Black moved Rd8 on a open d file white to move  What are our options? Rd1 lose c4 pawn on exchanges. \nThe d2 square can be protected by black in a couple ways. \nI don't think we want blacks rook to get to d2 \nIs there anywhere to move our knight? \n\nHow about f3 then g4 putting our pawns on white squares? \nLets share some candidate moves.... \nRe1 \nRa2 \nQc2 then loss of protecting pawn on d4 c3,b2 \n\n\nBlack Squares to avoid with a Q move avoid b2 and c3 due to attack on black diagonal. \npost a vote soon and we can discuss it.  riaannieman: Yes do that\nWe need to get our pawns out of the reach of the DSB. Put our pawns on white. \n\nOur knight is effectively pinned at the moment. Unfortunately there's a pesky rook covering the d-line. I would have loved to get our knight moving. Kd4 would have been a good start. \n\nAt least we have the a-line open. Maybe there is an opportunity in there, if we can keep the opposing queen otherwise occupied and get some assets towards the h8 corner.....  archduke_piccolo: Difficult...\nLet me say that this ain't an easy position! Not for us at any rate. \n\nI'm going to throw in a move to consider that I would normally avoid: \n\n22.Qf3. \nI'll tell you right now: I don't like it, I don't want to exchange queens, I don't want to break up our K-side, I would rather not be left with a minor piece end game (if the rooks come off as well). But I have an uneasy feeling that already we might be fighting for survival. I'll have a bit more of a think about it (it might simply be unplayable). \n\nLest you think I'm being inconsistent - previously advocating avoiding Q exchanges, yet now suggesting an unfavorable exchange such as this - we have to be alive to changes in relative values as the position changes with each move. Black's seizing the d-file was a very strong move - one I rather think I underestimated. Mind you, I don't think we could have done anything about it. \n\nFor the rest: \n\n1. 22.Re1 certainly demands consideration. \n\n2. I think we ought also at least to look at 22.Rd1, even though it drops a pawn: 22...Rxd1ch 23.Qxd1 Qxc4 24.Qd7... I doubt we'll get enough for the pawn, but we should a least check it out. \n\n3. 22.Ra2 - to keep the BR out of our second rank? Sounds like a good idea. \n\n4. I'm definitely not keen on pushing the K-side pawns as has been suggested, and here's why. Now I understand the reasoning: get the pawns into light squares that the enemy bishop can't reach. But in my view, now is not the time. Once the game has been reduced to one piece, or maybe two without the Queens, then we probably should revisit this idea. \n\nRight now, the result would be a serious weakening of the dark squares around the White King which Black will be well placed to exploit. If 22.f3 would be bad enough, to follow with 23.g4 would I think put the game well beyond our reach. \n\n5. I want to look at 22.Na7. It probably isn't much chop, the knight b",
        "22. Re1": "redfox17: Move 22Re1 made Black to move...  No conditional move made by black!  archduke_piccolo: Well,,,\n... I was about to vote for 22.Re1.   \n\nI think this move keeps us well in the game. Investigation into Black's replies seems to indicate a bishop move. \n22...Re8 permits 23.Nd5 or 23.Nc3; \n22...Rd7 and I'm looking at 23.Nc3 in reply, with a view to relocating: Nd5. \n22...Qd7 (the only playable Q move) suggests 23.Nc3 \n\nSo it is going to be a bishop move (...Bf6 or ...Bg4 or possibly ...Bh4). \nWe can start thinking about our reply to any of these. I have a move tentatively in mind for 23...Bg4, but I'll leave that for another posting.  jkarp: One thing is for sure. What black does, as I think ION is implying, what's important is to, \"Consider all threats, checks, and captures\", as cplusplus11 has emphasized in past annotations.",
        "22... Bf8": "archduke_piccolo: Whoa...!\nThat is a surprise! I did not expect the bishop's retreat.  riaannieman: I think....\nI think it is time to move our knight out of that position and use it positively. At the moment it is a liability by locking up a pawn that can be used to disrupt b- and c-pawns. We need to turn this over to a positive game, not a passive/defending game. \n\nWhat about Kc3 or Ka7? Ka3 does not do a lot for us.  redfox17: Retreat by Black!!\nLets share some candidate moves \nAdrian suggested a few ideas anyone else?  archduke_piccolo: I'm thinking of ...\n... Nc3 myself. \n\nI agree that the knight is no longer doing much good where it is, and I'd like to relocate it to d5 if we can. Now seems to be a good moment. We do have to suss out what response we should make to 23.Nc3 Rd3, though. 24.Rd1 Rxd1 25,Nxd1 seems likely enough. \n\nRight now I don't see anything against Nc3, but as it has just gone midnight, I'll leave a closer look for tomorrow.  redfox17: another idea\nmove the knight to the rim to get it back where we want it and push up the pawn... But I will look at what ION has suggested  Vote 23\nI like Na3 and Nc3 \nIon Nc3 \nanyone else ...  archduke_piccolo: Before we vote...!!\n... I think I have discovered what the enemy is about. \n\nThe reason for his strange bishop retreat is that Black is after or Q-side pawns. Looking at 23.Nc3, I anticipated 23...Rc3, to which 24.Re3 is a good reply. But I overlooked \n\n23.Nc3 Rd4! \nThe c-pawn is under attack, and there is but one defence: \n\n24.c5 ... \n...and now... \n\n24...b6! \nAnd this was the point. If%",
        "23. Rb1 Rd2 24. Qe3 Qg6 25. Rb3 Rd1+ 26. Kh2 c6 27. Na3 Bxb4 28. Qe8+ Kh7 29. Qe3 Bd6+ 30. g3 Bc5 31. Qe2 Ra1 32. Nc2 Ra2 33. Qe5 Bxf2 34. g4 Rxc2 35. Qf5 Qxf5 36. gxf5 b6 37. Kg2 Bc5+ 38. Kf3 Rxc4": ""
    },
    "url": "https://gameknot.com/annotation.pl/vote-game-challenge-from-dynamic_dv?gm=59623",
    "gameName": "Vote game Challenge from dynamic_dv",
    "players": "Chicoboy's Legacy Club  vs. dynamic_dv (2414)",
    "opening": "Bishop's opening (C24), Berlin defence"
}