{
    "moves": {
        "1. e4 e5 2. Nf3 Nf6 3. Nxe5 d6 4. Nf3 Nxe4": "My favorite defense against E-pawn  :-3) ",
        "5. Qe2 Qe7": "This is the most drawish, slow variation.",
        "6. Nc3 Nxc3 7. bxc3": "Although this move supports the advance of the d-pawn.  It creates potential problems.  In the endgame, your A-pawn is poor and the creation of these pawn islands isn't my first choice and puts your position in a potential bad way. \r\nEvery exchange from here on out puts you at a serious disadvantage.\r\n",
        "7... b6 8. d4 Bg4": "On b7, my bishop could be hemmed in with you playing d5 and c4.  Good for me because you light bishop would have a horrible life this game, potential inactivity.  \r\nIt didn't settle well with my gut.  I couldn't expect you to make that move and if you did, I'd have to reposition my own L-Bishop.  So I had to think of which square I'd put it on and why.  G4.  \r\nA chance to ruin your pawn structure. Should you exchange queens and play Be2, after d5 and Bishop exchanges, my knight can take up c4 and hem in your dark bishop.  \r\nThe former seemed to give me greater endgame prospects.",
        "9. h3 Bxf3 10. gxf3": "Four pawn islands, a dream come true for me.",
        "10... Nc6": "Thinking about c4 and provoking the advance.  Your pawns are weak, if you advance them even if I can't take advantage now, it should be death soon.",
        "11. f4": "You've chosen central play. But I don't know what you plan on doing with your bishops.  Pawn moves are the enemies of proper piece placement.",
        "11... d5 12. Bg2 O-O-O 13. Qxe7 Bxe7": "Exchanges feel great for me, I thought you may try holding on to your queen and keep chances for attack open.  Now they're dimishing.",
        "14. Be3": "Trying to hit me with c4, but this doen't stop my plan, only inhibits your dark bishop.  He has no future on this square.",
        "14... Na5 15. O-O Nc4 16. Rfe1 c6": "Basic support, only way to undermine my pawns is to push you iso a-pawn.  But I have a solid hold on the queenside.  Your counterplay is seriously limited.",
        "17. Rab1 Rhe8": "Looking for exchanges along the e-file and heading into a won endgame.",
        "18. f5 Bh4": "Trying to utilize the pin to force exchanges.",
        "19. Bf4 Na3 20. Rxe8 Rxe8 21. Rc1 Nb5 22. Bd2 h6": "I want to exchange bishops on g5.  Two g-pawns isn't so bad here.  H pawns tend to be drawish, and i still keep your h-pawn from dangerous advances. If you play f4 to block it, then your bishop is completely worthless.",
        "23. Bf1 Nd6": "Not ready to say goodbye to my favorite piece. The ability to hit both light and dark squares in this semi-closed position means more to me than one of the rooks! \r\nMaybe...",
        "24. Bd3 Kd7 25. Bf4 Bg5": "To save the knight, but I wanted this exchange anyway. Now I have to make my knight superior to the bishop.  Must battle the imbalances we have.  ",
        "26. Bxg5 hxg5 27. Kg2 c5": "Push the bishop back and claim e4 so I can hit c3.  The possibilit y of having an adcanced d-pawn is suddenly real and must always be watched.",
        "28. dxc5 bxc5 29. Kg3 c4 30. Be2": "It still wasn't an easy win until this.  ",
        "30... Rxe2 31. f4 Ne4+ 32. Kf3 Rf2+ 33. Ke3 gxf4+ 34. Kd4 Kd6": "Mate can't be stopped, Ng3 and Nf5 mates, your rook can't stop anything.\r\nThis was a good game.",
        "35. Rd1 Ng3": ""
    },
    "url": "https://gameknot.com/annotation.pl/vs-newmuis?gm=4035",
    "gameName": "Vs. Newmuis",
    "players": "ozydog (1414) vs. newmuis (1996)",
    "opening": "Petrov (C42), Cozio (Lasker) attack"
}