{
    "moves": {
        "1. e4": "This is a game were I finally get exposed to a more positional match. Hope you enjoy!",
        "1... e5 2. Nf3 Nc6 3. Bc4 h6": "Trying to assure Ng5 never happens. In my humble opinion there were better moves to be made; although my opponent was probably wary of Ng5 because I utilized it in our previous game. ",
        "4. d4": "Applying pressure on e5. Now my opponent is faced with a decision; does he attack or defend? He chose...",
        "4... Qe7": "to defend with the Queen. 4...d6 would have been advantageous by allowing both Bishops freedom as opposed to the restrictive Qe7. ",
        "5. d5": "Being  by nature someone who likes playing open positions you would've thought I would have preferred dxe5 but I didn't cherish the thought  of his Queen being on e5 pointing at b2. This also saves me a tempo because he has to deal with his Knight now....",
        "5... Nb8": "After five moves White clearly has the upper hand. Better developed? Check. More space? Check. But can White convert this into something substantial?",
        "6. b3": "?! I remember vaguely wanting to get some support for the bishop while preparing to go fianchetto with the other thereby exerting pressure on the center and e5. In hindsight Bd2-Be3 were better moves, serving to hit two diagonals and adding to my spatial advantage. ",
        "6... a6": "Trying desperately not to develop.",
        "7. Bb2": "My (faulty) plan achieved. Now my e5 attackers out number his Queen in the struggle for the center. ",
        "7... d6": "Adding more support for e5 and finally giving the Bishop and his Knight some room. Notice his Knight can only go to d7 while his Bishop can only go to d7 and f7. ",
        "8. O-O": "Being I was gearing up for more of a positional battle and not the tactical fireworks (usually lobbed by my opponents) I was used to I decided to get this out of the way. ",
        "8... Nf6 9. Nh4": "Looking for a Knight outpost on f5 to attack the Queen and cramp Black even further. Better would have been to develop my other Knight to protect e4 which I clearly overlooked.Re1 would have done the trick.",
        "9... g6": "Phew! So did he. I guess he was jealous of my fianchetto. ",
        "10. Nd2": "Chose Nd2 over the more conventional Nc3 because I was eying f3 to put pressure on e5. Also there weren't that any good squares Queen-Side to place it on after I hit c3.",
        "10... Ng4": "Protected from Qxg4 with his light square Bishop. Black has removed the threat from e4 allowing me to play Nf3 as planned. Although Black probably was trying to attack Nh4 with his Queen I was grateful; I wanted my Knight there anyways. Synopsis after ten moves: White is still ahead in development and space, although Black has narrowed the gap. ",
        "11. Ndf3 h5 12. Qd2 f5": "?? Black not only  exerts pressure again on e4 but also Pan-Sears a Rib Eye to a perfect medium rare, makes the reduction sauce and all that White had to bring is the....",
        "13. Nxg6": "! FORK!! ",
        "13... Qh7 14. Nxh8 Qxh8 15. Ng5": "Outpost on g5 sponsored by Qd2!",
        "15... f4": "After fifteen moves Black still behind in development but Black has gained a lot of space on my King-side and also has the only Bishop but it cost him a piece in the process. ",
        "16. g3 Bh6 17. gxf4 Bxg5 18. fxg5": "Black willing to take a loss of a pawn for exchanging a active knight for his bad bishop; although there were variations which he could have recouped it. ",
        "18... Qg7 19. f4": "!? Now White tries to break up the center a bit to give him more room to operate even though it obliterates my King-side defenses.",
        "19... Nd7 20. b4 Nb6 21. Bb3": "Preventing a Nxc4 which would also fork the Queen and Bishop. After twenty White preparing to clear room and expand.",
        "21... Bd7 22. fxe5": "?? Also procuring the f file for my Rook! But also a mistake. I had the Knight on g4 trapped and now I let him out of the cage.",
        "22... O-O-O 23. a4 Nxe5 24. a5 Na8": "Cramping Black even further because now the Knight has no safe square to land on from the corner!",
        "25. h4": "Freeing up White's Queen from babysitting the lowly pawn on g5.",
        "25... Qg8": "? Not sure what the point was. And also allows me clear conscience to play.... ",
        "26. Bxe5": "Even though the diagonal was opening up and I lost my Bishop pair, I felt taking away his only active piece was paramount. By moving his Queen the move before I also didn't have to deal with his Queen on e5 with plenty of room to operate, making to retake with his d pawn partially opening the d file for my Queen. All around a score for White!",
        "26... dxe5 27. d6": "White has a lot of different options after this move for future attack plus this opens a discovered attack on Black's queen.",
        "27... Bc6": "?? Giving me his Queen, although I must say his Bishop is finally attacking!",
        "28. Bxg8": "!! And Black resigns. Would love to say I outfoxed him but his two blunders really allowed me to a easy victory. Thanks for reading!Thanks to my opponent."
    },
    "url": "https://gameknot.com/annotation.pl/tactitian-stuck-in-a-positional-struggle?gm=43521",
    "gameName": "Tactitian stuck in a Positional Struggle",
    "players": "shshlomo (1510) vs. janshad (1379)",
    "opening": "King's pawn game (C50)"
}