{
    "moves": {
        "1. e4": "Was asked by moku to annotate this game. Looking ahead it appears both sides played a good game. I will attempt to find tactical improvements. Should be just a few as the game becomes an exercise in trading off pieces. Those with a strong endgame will use this plan frequently, usually once they are ahead a pawn or have the better pawn structure.",
        "1... c5 2. Bc4 e6": "Usually a good idea to give the bishop a pawn chain to bite on.  Thus white should wait for e5 to be played prior to Bc4 or till moving the e pawn for black is not a good option in the game.",
        "3. a3": "Possibly a prophylactic move by white to take away an outpost for the black knight once it moves to c6. This is not a strong move in the opening as it takes away whites iniative and gives black a tempo for developement.",
        "3... g6": "Fianchetto coming (Bg7) next. This defense is called the Sicilian Dragon and is in the hypermodern style of chess openings. Hypermodern is a style where the center is not occupied with pawns early but controlled/influenced by pieces instead. The premise is to let the opponent set up a center then go about undermining it with pawn advances or levers causing weakness in the opponents game. Thus hypermodern openings have a built in plan.",
        "4. Nf3 Bg7 5. c3": "Now white gives black's bishop a pawn chain to bite on, touche! This does take away the natural and usually best square for the white queen's knight, c3. ",
        "5... a6": "Possibly preparing b5 to drive away the bishop. ",
        "6. d4": "Contesting the center. ",
        "6... cxd4": "In most Sicilian defenses d4 is met by this capture. Black is trading a wing pawn for a more valuable center pawn.",
        "7. Nxd4": "PxP is also playable. 7.cxd4 has several advantages: It occupies the center with another pawn. The pawn at c is gone so the only way for black to contest the d4 square would be with e5, and e5 would result in white playing d5. This essentially blocks in blacks fianchettoed bishop and immobilizes it for the time being. 7.cxd4 also gives white back the c3 square for the white knight to move to.  \r\nSo black's play after cxd4 might be 7.d5 which continues 8.exd5, exd5 with matching isolated pawns and an even game. \r\nThus Nxd4 is fine and a bit better maybe than cxd4 considering the black's best response to cxd4 is a drawish line.. ",
        "7... Ne7 8. Be3 O-O": "A bit better might be 8...d5 as now 9.exd5 results in Nxd5 and if white replies 10. Bxd5- Qxd5 gives black a strong queen presence in the center.",
        "9. O-O Nbc6": "Again, d5 a bit better for black.",
        "10. f4": "Starting a king side attack possibly.",
        "10... d5": "Here comes d5.",
        "11. exd5 Nxd5 12. Rf3": "I would guess here that white is preparing R to g3 or h3 which doesn't work against a fiachettoed position usually.  The better way to guard the bishop would be Re1. What is hard to see here is that after the knight at d5 moves then black has three threats on the d4 knight and white has only two defenders if the bishop is taken at e3. After Rf3 the knight at d4 can't move later due to QxQ for free. \r\nWhites best play after 11....Nxd5 is Nxc6 and black responds bxc6 with an isolated c pawn and a weakness. ",
        "12... Nxe3 13. Rxe3 Nxd4": "As I was saying earlier, the N at d4 falls. Excellent read by black. Great tactical combination!",
        "14. Rd3": "and not cxd4 due to Bxd4 and the pin of the rook to the king.",
        "14... Qb6": "Much better was Qc7 as this forces the bishop to be moved or guarded then the knight moves and black is up a piece. or PxP after Qc7 and QxB still leaving black up a piece.",
        "15. cxd4 Rd8": "Pilling up on the d pawn. It is pinned by the queen.  ",
        "16. g3 Rxd4 17. Qb3 Rxd3+": "Here black missed the best move. 17.... Qb3 (QxQ) = BxQ and RxB with more material then the way it was played and game too black.",
        "18. Qxb6 Bd4+ 19. Kf1": "Better for white was Kg2. Then blacks best move is Rxg3 check an Intermezzio (Inbetween in Italian) move seeing that Bxb6 returns Bxd3 loosing the rook. Thus the rook check gains black a pawn. \r\n\r\nKf1 results in black saving his rook with another intermezzio move but this time not having to exchange it for a pawn.",
        "19... Rf3+ 20. Kg2 Rf2+": "Now the Rook is guarded and black can finally capture the queen. Also a rook on the 7th (a pig) is strong as it limits the king to the back rank if he is there already.",
        "21. Kh1": "Better was Kh3 as this limits the kings movements as stated prior. The king is stuck on h1 because moving to g1 subjects him to a discovered check once the rook moves. The rook usually kills something then says check and thank-you then moves away.",
        "21... Bxb6": "Now Black is up a rook for a pawn. 4 points if your counting.",
        "22. Nc3 Ba7": "? maybe fearing Na4. Why move the bishop as Na4 may not happen. Black has the intiative and should control the ending now. Black is maybe preparing b5 later.",
        "23. b4 e5": "Why not b5 now? Drives the bishop away.",
        "24. Ne4 Rc2 25. Bb3 Re2 26. Nf6+ Kg7 27. Ne8+ Kh6 28. Nf6 Bh3": "Hemming in the king further.",
        "29. Bd5 Rd8 30. Bxb7 Rdd2": "Two pigs on the 7th hard to defend even if you had a queen on the board. Rxh2 is mate next. White can throw in Ng4 then Bxg4 and follows 32. Bg2, Rxg2 with mate at h2 still next move.\r\n\r\nA case of black seeing some fine tactics. Well played!!! \r\n\r\nFor a site that allows tactical practice and tactics are 90% of the game according to a GM whos name I do not remember: http://chess.emrald.net/ \r\nCan't do a link here so copy and paste. Suggest you just click on guest and practice away. I wouldn't worry about score or time but concentrate on finding the best move/tactic. If you'll practice often, you should make good progress in your games.\r\n\r\nWayne"
    },
    "url": "https://gameknot.com/annotation.pl/tactics-101?gm=18114",
    "gameName": "Tactics 101",
    "players": "Player (1428) vs. mokru (1499)",
    "opening": "Sicilian defence (B20)"
}