{
    "moves": {
        "1. e4 c6": "caro-kann\n\nit was tempting to play sicilian, but i wanted to play something leo probably didn't face very often...",
        "2. d4 d5": "i played this by accident, and cursed my early casualness... it was force of habit... i had been toying with 2... g6 and was getting good results, winning all three, but i habitually played 2... d5 and was on book...",
        "3. e5": "advance variation",
        "3... Bf5 4. Nf3 e6 5. Be2 Nd7 6. O-O f6": "and we're off book... the point here was to aid the development of the knight, and give the rook an open file after castling... didn't turn out quite that way...",
        "7. exf6 Ngxf6": "seems ok to me...",
        "8. Bd3 Ne4": "i think this might've been a mistake, not too sure, but i certainly don't think it was a good idea to get tactical with the guy... should've just traded the bishops and hurried castling along...",
        "9. Nbd2": "i did anticipate this...",
        "9... Ndf6 10. Ne5": "but not this...!",
        "10... Qb6": "?\n\ni should've developed the bishop",
        "11. Bxe4": "and off we go...",
        "11... Nxe4": "?\n\nbad, bad move... but i didn't see the extent of the damage this would cause...",
        "12. Nxe4 Bxe4 13. Qh5+": "!\n\nand here's why...",
        "13... g6 14. Nxg6": "!\n\nand now i'm starting to worry... surely a man of this rating couldn't drop a knight in a dodgy sac...?",
        "14... Bxg6": "well, what else...?",
        "15. Qe5": "!\n\nexcellent... attacks rook and king's pawn... the rook has no flight square, since after 15... Rg8 16. Qxe6 wins the rook anyway... so it wasn't a dodgy sac after all... it was brilliant...",
        "15... Bg7": "return of material is the only way to save rook... i'm down a pawn, and wide open... ",
        "16. Qxg7": "naturally...",
        "16... O-O-O": "and the rook saved, but at what cost...?",
        "17. Bf4": "oh dear... now the queen is tied down to preventing mate... how i could use that black square bishop...",
        "17... Bxc2": "plan... even out the game and trade queens... part one was simple...",
        "18. Qe5": "!\ncovers both c7 and b1, and hence stopping Rd7 and preventing my queen from attacking. so a better square for the white queen than g7.",
        "18... Bf5 19. a4": "!\n\nthe winning move... ",
        "19... a5": "i had to block the pawn, or the queen is screwed... Rd7 is out as it blocks my king's only flight square after Qb8... i guess Qa5 is an alternative, but b4 soon sorts that out...",
        "20. Ra3": "!\n\nthis is when i realised i was in deep trouble, but i had one last plan... run away...!",
        "20... Kd7": "i have to get the king away, or Rb3 wins... the queen cannot take the rook, nor go anywhere else...",
        "21. Qg7+": "and i resign... just two squares... e8 and the rook is gone, c8 and the queen is gone... excellent play by leo..."
    },
    "url": "https://gameknot.com/annotation.pl/tactically-outclassed?gm=3864",
    "gameName": "tactically outclassed",
    "players": "leo_london (2090) vs. tugger (1704)",
    "opening": "Caro-Kann (B12), advance, Short variation"
}