{
    "moves": {
        "1. e4": "my usual please landlord....E4 it's what i know and love.",
        "1... c6": "I don't like this move for him i mean it stops Nc6 i like Nc6...",
        "2. Nc3": "Developing....",
        "2... d5": "Ditto...",
        "3. d3 dxe4": "you know whats coming....A typical trade off..",
        "4. Nxe4 Bf5": "Hmmm, is he gonna exchange off pieces this early? i sometimes get uncomfortable with trading off this early i wonder if the opponent just likes to take rather than think..generally speaking.",
        "5. Qf3": "take me or i take you, or run.....plus i develop a little more. I don't know if this was my best option i could just leave the knight and carry on as normal maybe Be2 or something",
        "5... e6": "Or get back up, of course theres no way back for that bishop now, he's committed to the cause..",
        "6. Ng3": "I quite fancy that bishop now pawn aswel! thats if i get a chance..",
        "6... Bg6": "Very coy.....how cute...",
        "7. Be3": "back to development then....",
        "7... Bd6 8. Nh3": "can't remember why i did this but it looks good, right? I think i saw this in a book and decided to give it a go....",
        "8... Nd7 9. Ng5": "Just a push really...maybe i was better off with Ne4 with ideas of Nd6 ..",
        "9... Ngf6": "clearing the way....Still don't know why i havn't gone to Ne4...",
        "10. h3": "Just in case, it's like a nervous tic i have on the chess board.....",
        "10... Ne5": "Alert!! Queen threatened....And some major advancement on his part, i'm getting claustrophobic in here..",
        "11. Qd1": "Back to safety....for a little while..",
        "11... Qc7": "Hmmm...",
        "12. c3": "An exit route.....",
        "12... Ned7 13. Ng3e4": "Trying to exchange off a few bits just to clear the congestion..Too late me thinks..",
        "13... O-O-O": "yup...",
        "14. Nxd6+": "I like bishops, yum yum...plus i felt i needed to relieve some of the pressure i was feeling..",
        "14... Qxd6": "he had to....forced pretty much...",
        "15. Be2": "had to protect that little beauty...And i had to clear the way for a quick castle should the need arise..",
        "15... h6": "if only that bishop wasn't there Bg6..I'de love to go Nf7 right now..",
        "16. Nf3": "So back i go.....i hate going back if it's out of sheer self preservation but i had to really..",
        "16... b6 17. Qa4": "That back door again? Probably not. i'm hoping for a miracle i'm rubbing that lamp real hard but no genie is appearing..",
        "17... Kb7": "hmmmm...",
        "18. O-O": "Time to castle.....",
        "18... Nc5": "This is a double edged threat look at the eye's on d3, that's gotta be his entry point...",
        "19. Qc2": "So i try to block that entrance..",
        "19... Nd5": "I'm not liking this knight advance, we're all level material wise so i'm happy to exchange off a few pieces but i'de rather not right now because positionally i think he would be better off, lets see what happens...",
        "20. Bd4": "A rook for your trouble sir? again more wishful thinking...",
        "20... f6": "I thought not...",
        "21. b4": "How about a knight then?",
        "21... Nd7": "No.....I feel at this point had i made the right move i may have caused a bit of trouble here...",
        "22. g3": "To stop Nf4 and the threat to my bishop...and to stop him eyeing d3 aswel...",
        "22... e5": "Erk!...too late to cause an irritation on the queen side now..",
        "23. Be3": "Back and forth...",
        "23... Rhf8": "He's starting to coordinate his forces i need a reply with menace...and plenty of it..",
        "24. a3": "Does that scare you?..",
        "24... f5": "He's getting closer...",
        "25. Bd2": "So i move further away this looks weak but i have my reasons...",
        "25... Bh5": "Go away!!",
        "26. c4": "I'm starting to like this pawn thing i got goin on here....",
        "26... Nd5f6": "Bye bye...It's about time he did a bit of the retreating..",
        "27. b5": "I had so many options here but i chose to keep the pawn advance going simply to keep pressure on his king....on reflection this was the wrong move maybe Qa4 would have been better...",
        "27... cxb5": "Good i like a king who's pawn guard is shattered...But not completely ruined sadly...",
        "28. Bb4": "Come to me queenie...",
        "28... Nc5": "Ah....I got blocked there well and truely....",
        "29. cxb5": "I'll have to make do with a pawn...",
        "29... Qd5 30. Nh2": "I didn't want to lose 2 pieces for the price of 1...",
        "30... e4": "Things are getting sticky here he's all over me with more potential movement and better lines, i could be in trouble...\r\n",
        "31. d4": "i just couldn't allow e4xd3 threatening both queen and bishop so a pawn sacrifice is the order of the day...",
        "31... Nb3": "This is a nightmare i gotta keep dodging bullets and i aint bullet proof!",
        "32. Rab1": "all i could do..",
        "32... Nxd4": "see what i mean about running and bullets?",
        "33. Qa4": "threatening check..",
        "33... Bxe2": "this was innevitable what to do now, by this time i got tag in my ear boasting and pontificating...",
        "34. Rfc1": "This cause for major action....",
        "34... Bxb5": "i'm really getting it from tag now, i hope my plan works....",
        "35. Rc7+": "Suprise!! A rook sacrifice, something needed to be done i hope this works...",
        "35... Kxc7": "A little respite but i can see this turning into a bloodbath...",
        "36. Qxa7+ Qb7": "He's got all bases covered and i have no answers...",
        "37. Rc1+": "Just to keep myself alive....",
        "37... Nc6 38. Qxb7+": "No choice....",
        "38... Kxb7 39. Ra1": "I'm just waiting to be put out of my misery now, i've resorted to pawn pushing... pawn pushing.....",
        "39... Nxb4": "He's doing what i would do, trade off material, he has it to burn, i don't!!",
        "40. axb4 Rd4": "Not my pawn!",
        "41. Rb1 Rfd8": "Oh poo!",
        "42. f3": "Here we go more pawn pushing, just deal with me tag and do it now!",
        "42... Rd4d1+": "My swan song coming up..",
        "43. Rxd1": "again forced play, but the last thing i want to do...",
        "43... Rxd1+": "HELP!!",
        "44. Kg2": "I'm in a corner and wondering where it went wrong....",
        "44... Rd2+": "King hunt on!",
        "45. Kg1": "up and down...",
        "45... Nh5": "here comes sir kill me off..",
        "46. Nf1": "what the hell, i've lost the will to live now, i want it over and quick...",
        "46... Bxf1": "great...",
        "47. Kxf1 Nxg3+ 48. Ke1 Ra2 49. fxe4": "Pawn pushing again, it's all i have left...",
        "49... Kc6 50. b5+ Kc5 51. e5 Kd5 52. e6 Kxe6 53. Kd1": "I say i'm happy to resign now, please spare me....",
        "53... Kd5": "This is getting emmbarresing i really should resign but i want to give tag the pleasure of saying checkmate so i plod on..",
        "54. Kc1 Kc4 55. Kb1 Kb3 56. h4 f4 57. Kc1 f3 58. Kd1 f2 59. Kc1 f1=Q#": "And there we have it, still havn't worked out what went wrong, i'll work it out though. Cheers, good game."
    },
    "url": "https://gameknot.com/annotation.pl/tagged-and-bagged?gm=15812",
    "gameName": "tagged and bagged!!",
    "players": "daveyr18 (1437) vs. tag1153 (1441)",
    "opening": "Caro-Kann (B10), Goldman (Spielmann) variation"
}