{
    "moves": {
        "1. e4 g6": "Okay on with the show. Tal is white here and he is playing against Tringov and this game was played in Amsterdam 1964. Tal kicks off with e4 and Tringov responds with g6. ",
        "2. d4": "This might look weird to some,that tringov just let Tal have the entire center,but the fact is that in some positions black can surrender the center if its restrained,that is to say in pirc and modern defense.",
        "2... Bg7 3. Nc3 d6": "Yes,now we see what black has in mind. The normal moves for black is Nf6,0-0,c6 and Nbd7. Somewhat solid.",
        "4. Nf3 c6": "Black plays c6 right away.",
        "5. Bg5 Qb6": "Allright,since Bg5 came,tringov decides to play Qb6,because the bishop is absent from the b2 pawn now. But now Tal played a charactaristic move here....",
        "6. Qd2": "Qd2. Instead of protecting the pawn Tal lets Tringov take it. In return Tal will get better development.",
        "6... Qxb2 7. Rb1 Qa3 8. Bc4": "You see? White has developed the knights,the bishops and the rook has taken the b-file for only one pawn.",
        "8... Qa5": "Qa5,still no sign of further development by tringov. The point was probably that the queen can now drop back to c7.",
        "9. O-O e6": "Tringov continues with e6. possibily planning to develop the knight to e7",
        "10. Rfe1 a6": "Tringov have played to many pawn moves i think. Look at tal's development compared to tringov. Now Tal can take advantage of this development and attack.",
        "11. Bf4": "Tal doesnt have to worry about tempo here. Now you see that the d-pawn is attacked,delaying tringov to develop any pieces here again. ",
        "11... e5 12. dxe5 dxe5": "some exchanges was made. I have a question,what would you play in this position. Does Bg5 or Be3 look best to you? Well the fact is....",
        "13. Qd6": "Tal saw a combination here. if 13. ... exf4 14.Nd5! cxd5 15. exd5+ and Black is demolished. So therefor black can not take the bishop.",
        "13... Qxc3": "But the knight was underfire as well. Tal has sacrificed a knight here and his bishop is still underfire....",
        "14. Red1": "Well This threatens checkmate on d8. Things are starting to look very critical for black.",
        "14... Nd7": "To protect the mate on d8. And now look on this position! Both of Tal's bishops are underfire. The bishop on c4 is attacked and the bishop on f4 is attack. If you were going to play here,which bishop would you save? or infact what move would you play at all?",
        "15. Bxf7+": "Well....it turns out Tal was never interested in saving any pieces. A second sacrifice leaving Tal with -6 score was made here. Absolutely devastating and absolutely brilliant. I love this move.",
        "15... Kxf7 16. Ng5+": "The point of Bxf7. Now Ng5+ came.",
        "16... Ke8": "Only move.",
        "17. Qe6+ Kd8": "Again the only move. And now There is a mate here that Tal saw...",
        "18. Nf7+": "Nf7+",
        "18... Kc7 19. Qd6#": "BAM. Tal demolished tringov here. I think its safe to say that this game shows how incredibly talented Tal was."
    },
    "url": "https://gameknot.com/annotation.pl/tal-crashes-modern-defense?gm=44928",
    "gameName": "Tal crashes Modern Defense",
    "players": "Mikhail Tal  vs. Tringov ",
    "opening": "Robatsch defence (B06), two knights, Suttles variation"
}