{
    "moves": {
        "1. e4 e5 2. Nf3 Nf6": "The Petroff has a reputation of being dull and uninspired. However, it offers attacking opportunities for both sides, and a few lines are quite sharp. Grandmasters Karpov, Yusupov, Marshall, Kramnik, and Pillsbury have frequently played the Petroff as Black.",
        "3. Nxe5 d6 4. Nf3 Nxe4 5. Nc3 Nxc3": "Normally Black retreats his knight to f6.",
        "6. dxc3 Be7 7. Be3 O-O 8. Qd2": "White prepares to castle queen side and launch a king side attack.",
        "8... Nd7 9. O-O-O": "Kings have castled on opposite sides and we shall see both players launching their attacks.",
        "9... Ne5": "Pawn storm should be considered here with c6, Qa5, etc.",
        "10. h4": "White's attack begins. The player whose attack arrives first is likely to win in these sharp lines.",
        "10... c6 11. c4": "White should play on king side and should not disturb his pawns in front of the castle.",
        "11... Be6 12. Ng5 Bf5 13. Kb1 Re8": "Black should drive away the White knight from the vicinity of his king.",
        "14. f3": "Probably preparing g4.",
        "14... h6": "White's knight has to leave its post.",
        "15. Be2": "?! White offers his knight which is not a sound sacrifice, a typical Tal sac. 15...hxg5 16. hxg5 Qd7 17. Rh2 Bg6 18. g4 Qe6 19. Rdh1 and White's attack looks dangerous but Black could have defended and with his extra piece could have won the game.",
        "15... d5": "Kramnik thought for a long time and was probably surprised by the offer and preferred to decline the knight offer.",
        "16. g4 Bg6 17. f4 dxc4": "? Nxc4  or hxg5 were better.",
        "18. Qc3 Nd3": "?! Surprising knight sac not totally sound.",
        "19. f5": "White's attack reaches before Black's. ",
        "19... Bxg5 20. fxg6 Rxe3": "Kramnik was in time pressure by now and he leaves his bishop on g5 which should have captured the e3 bishop. Bxe3 was better than Rxe3.",
        "21. gxf7+": "Qxc4 was better. White is excited that his attack has arrived and plays a wrong move.",
        "21... Kf8 22. Qxc4 Rxe2": "Time pressure! b5 was better.",
        "23. hxg5 Qxg5 24. Qxd3": "Pieces are exchanged and White's f7 pawn is looking dangerous. Black's Rook is attacked.",
        "24... Qe3": "? Time pressure again. Re5 was better.",
        "25. Qh7 Qe4 26. Qg8+ Ke7 27. Qxg7": "Just in time! Black was threatening Qxc2 followed by Qxb2 mate.",
        "27... Qxc2+ 28. Ka1 Rf8 29. Rhf1 Rd2 30. Rfe1+ Re2 31. Qc3": "! A terrific move and Black is lost in all variations.",
        "31... Kxf7 32. Qf3+": "White attacks the Rook on e2 twice and black cannot save it. So Black resigns. An attacking game in a dull opening. Tal's spirit can be seen in this game."
    },
    "url": "https://gameknot.com/annotation.pl/tal-memorial-tournament?gm=34979",
    "gameName": "Tal memorial tournament",
    "players": "Sergey Karjakin (2765) vs. Vladimir Kramnik (2787)",
    "opening": "Petrov (C42), Nimzovich attack"
}