{
    "moves": {
        "1. e4": "Tal's final first move was his beloved e4. He almost always played e4. But he could occasionally play english or reti with 1.c4 or 1.Nf3",
        "1... c5": "Kasparov resonded c5 the sicilian defense. He responds often 1.e4 with the sicilian.",
        "2. Nf3": "Tal responds with the open sicilian. 2. Nc3 is closed sicilian.",
        "2... d6": "Kasparov continues with d6. It is still unclear what opening this will transpose to.",
        "3. Bb5+": "Tal possibly wanted to make this opening a bit unusual instead of 3. d4 as he knows that kasparov is well prepeared to play the sicilian. Kasparov probably has something stored for this move but since this is a blitz game (as i mentioned earlier) and the middle game will be more thinking than showing preperations,kasparov might have some problems with time. When it comes to Tal, well he must have prepeared something with Bb5+.",
        "3... Nd7": "Kasparov played Nd7,eyeing a potential outpost on e5 perhaps.",
        "4. d4": "Now this is becoming a clear open sicilian since white could still have played Nc3 making it into a closed. Tal immideately attacks the center.",
        "4... Ngf6": "Kasparov decided to respond Nf6 attacking the e-pawn.",
        "5. O-O": "0-0!? a Tal-move. Gambiting the center pawn. For compensation Tal hopes to attack down the e-file.",
        "5... a6": "Kasparov decides to decline this and attack Tal's bishop instead. Of course if you accept a Tal sacrifice you will probably run into quite some trouble in the game.",
        "6. Bxd7+": "Tal decides to surrender his bishop pair. He wouldn't be better of playing for example 6. Ba4 b5 7.Bb3 c4 anyways. and retreating to d3 or e2 looses tempo.",
        "6... Nxd7": "Draging the knight away from the center and blocking his Light squared bishop. I think the point of kasparovs move is because if he takes with the bishop he will run into e5 in the future or perhaps immideately.",
        "7. Nc3": "Tal continued with development.",
        "7... e6": "black contests the d5 and the f5 squares and prepearing to develop his Bishop to e7 and castle.",
        "8. Bg5": "Development and attacking the queen.",
        "8... Qc7": "Kasparov just moved his queen aside attacking down the c-file.",
        "9. Re1": "centralizing his rook and supporting the e-pawn.",
        "9... cxd4": "Alright kasparov finally decides to take the pawn on d4.",
        "10. Nxd4": "The point is that kasparov wanted to play...",
        "10... Ne5": "Knight e5 centralizing his knight",
        "11. f4": "Tal being aggressive,attacking the knight.",
        "11... h6": "Kasparov decides to ignore that by playing h6. An in-between-move.",
        "12. Bh4": "Tal Retreats his bishop. and now another in-between-move.",
        "12... g5": "The point is that kasparov wants to get rid of the f-pawn. He wants to make a hole on e5 to take advantage of.",
        "13. fxe5": "Tal decides to exchange the knight.",
        "13... gxh4": "Pawn takes bishop. Black gets a double isolated h-pawn. Kasparov perhaps hopes to play Rg8 soon,putting pressure on Tal.",
        "14. exd6": "Tal wanted to delay any pressure against himself. And get rid of the double e-pawn.",
        "14... Bxd6": "Hence after Bxd6 even more pressure gets added on Tal's king. Kasparov threatens to play h3,Bxh2,Rg8 and Tal has to do something. And he did. Try to see what move Tal found before scrolling down.",
        "15. Nd5": "Nd5!? a typical Tal move, attacking Kasparovs queen. ",
        "15... exd5": "Kasparov must have wasted some serious seconds thinking how to reply but in the end he decided to accept this knight sacrifice. Remember that this was a blitz game and i find sacrifices like these in a blitz game quite amazing!",
        "16. exd5+": "Pawn takes Pawn with check!",
        "16... Kf8": "Kasparov played Kf8",
        "17. Qf3": "Tal had probably this position on his board,on his preperations. This was the point of this knight sacrifice. And now suddenly out of nowhere (unfortunately!) kasparov lost on time. He probably spend time thinking on how to react to this knight sacrifice. I would have been very pleased to see how this game would have gone if Kasparov didn't loose on time. Maybe Ne6+ comes on the right moment? who knows. So this was a nice last game by Tal. He opened with his favorite e4 and managed to make a sacrifice against kasparov. gg."
    },
    "url": "https://gameknot.com/annotation.pl/tals-last-chess-game?gm=35410",
    "gameName": "Tal's last chess game",
    "players": "Mikhail Tal  vs. Gary Kasparov ",
    "opening": "Sicilian (B51), Canal-Sokolsky (Nimzovich-Rossolimo, Moscow) attack"
}