{
    "moves": {
        "1. d4 d5 2. Bf4": "My favourite.",
        "2... Nc6 3. Nf3 Nf6 4. h3 e6 5. g4": "Premature, but I was looking for a psychological effect (it was a blitz).\n",
        "5... Bd6 6. Ne5": "The usual response, that...",
        "6... Ne4 7. h4": "To avoid the annoying Qh5. But I miss a tempo to prevent f6, so here it comes...",
        "7... f6 8. Nxc6": "I don't like Nd3 because after the exchange my knight is easily kicked out.",
        "8... bxc6 9. Qc1": "A bit of another surprise for black. I don't think it is all that bad...",
        "9... c5 10. c3 cxd4": "I would have preferred a developement move as Ba6 or Rb8.",
        "11. cxd4": "Qc6+ is not a real threat, but still it is there. No Ba6 is possible, for instance. ",
        "11... c5": "Freeing the black diagonal to the queen. My way to play this opening (this time) was awful. I have to go back to natural moves at some point before (probably g4 should be delayed).",
        "12. Bh2": "My queen is free now to move, and exchanging only gives my rook a good square against Nxf7. I bet I could survive to the black squares' attack. But in fact, to exchange bishops would heve been infinitely better. ",
        "12... O-O 13. f4": "Trying to fix things. Of course f6, Nb6, Rg1, NxB... it is playable, but not particularly exciting (for a fun game :-)",
        "13... cxd4 14. e3": "!? To untangle his pieces, white sacrifices a pawn. Qc6 is pointless now, so better try to relocate the queen. ",
        "14... dxe3 15. Qxe3": "He went for it. Now, more untanglement. ",
        "15... Bc5": "Aha, it will be costly. I'm playing awfully :-)",
        "16. Qb3 Qa5+ 17. Nc3 Bd7": "I'm cooked, here. If Bb4, Rb8. Ke7 is mortal after NxN, bxN, Rb8 etc. ",
        "18. Bd3 Bf2+": "? Ba5 and I would have to take away my queen, chased by the rooks... a disaster. But with this blunder, black gives me chances. ",
        "19. Ke2 Qc5": "This is nice. Instead of any desirable piece exchange, white must prevent Qe3+, so the only good move is...",
        "20. Nd1": "Now black's pieces start to feel unconfortable. ",
        "20... Rab8 21. Qa3": "The queen's exchange would give me a bad pawn's structure, but I preferred it to Qc7 for some strange (and probably wrong) reason. ",
        "21... Qxa3 22. bxa3 Bd4": "Correct. He saves his hanging piece. ",
        "23. Rb1": "I decided to exchange, but I was wrong again. Rc1, and if Rb2, Rc2. A nice tangled position, probably full of traps I can't see...",
        "23... Rxb1 24. Bxb1": "Awfully distributed pieces, but maybe I have a chance to coordinate. ",
        "24... Bb5+ 25. Bd3 Bxd3+": "Thank you, black, your bishop's pair was much stronger than mine...even if I am left the useless (by now) dsb. ",
        "26. Kxd3 Bb6": "My knight controls his, but can't move, so my other pieces are half trapped too.",
        "27. f5 e5 28. Bg1": "What else? But now, Ng6, BxB, NxR, Bxa7, Ra8, Bc5 seems to hold, even if it leaves the black knight the possibility to escape via g6. But black should have gone for it. Instead, he played...",
        "28... Rc8": "...which is not bad, too.",
        "29. Bxb6": "This was another mistake, as it gives him facilities to attack my doubled pawns. ",
        "29... axb6 30. Rh2": "Rh3 could have been the only attempt to save a3. ",
        "30... Ra8 31. a4": "Having to lose a pawn, I'll lose it at my condition... ",
        "31... Rxa4 32. Nc3 Ra3": "...but they are not necessarily good for me... now, look...",
        "33. Rc2": "Black cannot win the knight with d4, because of KxN. Black timeoutted here, a pity. The simple b5 wins, because white is so tangled he cannot avoid to lose the knight and the game, deservedly. :-("
    },
    "url": "https://gameknot.com/annotation.pl/tangling-myself?gm=43639",
    "gameName": "Tangling myself. ",
    "players": "damalfi  vs. yojer ",
    "opening": "Queen's pawn, Mason variation (D00)"
}