{
    "moves": {
        "1. d4 Nf6": "Mini tournament game, I go for the Indian.",
        "2. c4 Nc6": "Tango, anyone? This defense is known as The Black Knights' Tango, also known as the Mexican Defense or Kevitz-Trajkovic Defense. And that right there is all I know about it - at this point, I'm pretty much hoping the GK DB will offer me some good advice from here on out.",
        "3. Nf3 e6 4. a3 d6 5. Nc3 g6": "Oho, we've tangoed ourselves right into a King's Indian Defense, more or less.",
        "6. e4 Bg7 7. Bg5 h6": "A bit reminiscent of a delayed Averbakh Variation, not a strong suit for white, although there have been a couple extra moves in here first.",
        "8. Bh4 g5 9. Bg3 Nh5": "Black seems determined to teach that bishop a lesson.",
        "10. d5 Nxg3": "Lesson learned.",
        "11. hxg3 Ne5 12. Be2 exd5 13. cxd5 Bg4": "Offering needless exchanges. In fact, given the disparity in ratings (though the difference was much smaller when the game began), black might be better suited trying to keep the game complex.",
        "14. Nxe5 Bxe2 15. Qxe2 Bxe5 16. Qb5+ Qd7": "White forked the black king and the pawn on b7, gaining a pawn. It's usually a temporary gain, as it's easy enough for black to post a rook on b8, chasing away the queen and winning white's b-pawn in the process.",
        "17. Qxb7 O-O 18. Qa6 Bxc3+ 19. bxc3 Rfe8": "Expecting 20. f3 f5 and if white defends the backward e-pawn with his queen, then black has Qg5 or even Qf4 (as long as that pawn stays pinned to the king) to bring in the extra firepower to win the pawn.",
        "20. O-O Rxe4": "But white let it go cheap, so black gets it while the getting's good.",
        "21. Rfe1 Ra4": "White offered a trade, but there are better plays for black. The position is already almost too simplified, black wants to keep the major pieces on the board a while longer.",
        "22. Qd3 Re8": "And only one move later, black decides maybe simplification isn't too bad after all.",
        "23. Re3 Rxe3 24. Qxe3 Qb5 25. Qe7 Qa5": "Threatening three white pawns while simultaneously defending all the black pawns.",
        "26. Rb1": "White played this move, and then resigned, though I'm unconvinced that the white position is so dire. In fact, this opponent resigned 23 games on this date, dropping over 200 points in rating in the process. I hope he's OK. I'll take the win, but it would have been more fun to play it out."
    },
    "url": "https://gameknot.com/annotation.pl/tango-anyone?gm=23724",
    "gameName": "Tango, Anyone?",
    "players": "renatodefrias (1409) vs. blake84120 (1977)",
    "opening": "Kevitz-Trajkovich defence (A50)"
}