{
    "moves": {
        "1. e4": "Hello folks, in a deviation from my recent string of Benoni games, here comes a good old-fashioned Sicilian. As Fred Reinfeld writes, the game quickly becomes 'an all-out struggle' in a very complicated position. Enjoy!\n",
        "1... c5 2. Nc3": "I choose the Closed Sicilian, because I'm trying to learn the Grand Prix on the White side of the board.\n",
        "2... Nc6 3. f4 e6 4. Nf3 Nf6": "It's more usual for Black to develop with ...g6 and ...Bg7, since White tends to get a very strong hold in the center. This is certainly fine, though.\n",
        "5. e5": "?! Not many games in the database for this move, but I had recently had success against another player with this setup and I wanted to see if it was just a fluke.\n",
        "5... Ng8": "The one game in the World DB with this line continues 6.Bb5 d5 7.exd6 e.p. Qxd6 8.Ne5 Bd7 9.Nxd7 Qxd7 10.O-O and Black managed to hold a draw through a very complex endgame.\n",
        "6. Bb5 a6": "I like 6...d5 better. White is likely to trade this Bishop for the Nc6 anyway; there's no need to provoke it right away.\n",
        "7. Bxc6 dxc6 8. O-O": "White is castled and has two pieces on the field. Black is cramped and has nothing developed--I don't envy his position here.\n",
        "8... g6 9. d3 Ne7": "?! Black opened up a spot on g7 for his Bishop, so he should place his Bishop there. The text allows White to activate his Knight with force:\n",
        "10. Ne4": "Threatening both the pawn on c5 and (!!) instant mate with Nf6!\n",
        "10... Ng8": "The Knight retreats to guard f6; the only way to avert both threats.\n",
        "11. Qe1": "This move is thematic in the GPA; White's Queen prepares to shift over to f2, g3, or h4 to aid in the kingside attack.\n",
        "11... f5": "! I like this move quite a lot. Black's kingside is very exposed, of course, and he still has zero developed pieces, but this move kicks the Ne4 as well as controlling g4, and if White takes en passant, 12.exf6 e.p. Nxf6 frees Black's position immensely, though at the cost of a weakened pawn structure.\n",
        "12. Neg5": "I think 12.exf6 e.p. was playable here, but I wanted to go for the invasion and keep Black as crammed as possible. Plus, I was having delusions of getting my other Knight to d4 and trying to win the e6 pawn.\n",
        "12... h6": "Yet another pawn move, but it seems natural. Black's kingside is a prickly wall of just-barely-defended soldiers.\n",
        "13. Nh3": "An unfortunate place for the Knight, but perhaps a well-timed g2-g4 could break open Black's shell eventually.\n",
        "13... Be7": "Black quickly puts a stop to White's idea of playing Nh4 to threaten the g-pawn.\n",
        "14. Qg3": "I did a lot of thinking before this move, but eventually decided to go with it because it messes with Black's position even more. The only satisfactory way to defend the pawn is ...Kf7.\n",
        "14... Kf7": "Around here, my opponent declared that it would be a miracle if he survived at all! While I agree that Black's position certainly leaves a lot to be desired, I don't know if it's quite that bad yet. White needs reinforcements of some kind if he's going to break Black's resistance. As I have the spacial advantage, I look for a way to switch flanks to take advantage of my superior mobility.\n",
        "15. Be3": "This seems like the most reasonable choice to me. It blocks off the diagonal to my King (though I'd like to get him to h1 soon anyway), attacks c5 to overwork the Be7, and connects my Rooks.\n",
        "15... Rh7": "Black's kingside is gnarly, but it's still a tough nut to crack. The Knight can't move, but the Rook can still be brought up to defend g6. Meanwhile, White needs to reorganize his own forces to make them useful again.\n",
        "16. c4": "? It took me a long time to decide on this move, and in the end I overlooked the obvious. The intention was to prepare for d3-d4(-d5), but I completely oversaw that Black can simply take the now-defenseless pawn at d3! Worse, after 16...Qxd3, White is suddenly hard-pressed to defend both his Be3 and the pawn on c4. The only compensation is that the Queen will no longer support the Black dark-squared Bishop, and White may be able to gain time with Rad1 at some point.\n",
        "16... Qxd3": "Black makes his first incursion into White's half of the board.\n",
        "17. Bf2": "By keeping the Bishop pointed at c5, White hopes to discourage ...Qxc4 (which could be answered by Rc1). Perhaps 17.Qf2 would have accomplished the same thing, while placing the WQ in a more useful location.\n",
        "17... Qd8": "Black retreats after snatching a pawn and opening the d-file. I think the Queen could have still taken on c4, but the position is unclear.\n",
        "18. Rad1": "White grabs the open file.\n",
        "18... Qe8 19. Kh1": "This shift makes room for White pieces to use g1--White's kingside is badly tangled, and needs some serious unraveling.\n",
        "19... Bd7 20. Nhg1": "Intending Nh4 and Ngf3, but probably a queenside switch would have been better: White has more space, so he should use it to create attacks on both flanks that Black can't adequately respond to, instead of hitting where Black is already fortified.\n",
        "20... Rd8": "Black prepares to challenge the open file (and relieves his Queen from her defense of the Bd7). Lucky for White, Black's position is just as tangled as his.\n",
        "21. Nh4": "Probably 21.Ne2 was better, to begin a queenside mobilization. The text invites 21...g5, gaining some space and hitting the weak f4 pawn with tempo.\n",
        "21... Bxh4": "Trades make it easier for Black to defend. I do think 21...g5 was playable here.\n",
        "22. Qxh4 b6": "Propping up the weak c5 pawn.\n",
        "23. Nf3": "White brings his Knight back into play and frees g1 for a Rook.\n",
        "23... Kg7 24. Rfg1 Ne7": "Daring White to play 25.Qf6+ Kg8, which looks more dangerous than it really is.\n",
        "25. g4": "White pushes for an open line against the Black King.\n",
        "25... Kh8": "Black dodges out of the way.\n",
        "26. Rg3": "? This is where White really starts to go astray, I think. I made this move with the intent to move Rh3 and bear down on the h-file, but it had been much better to simply proceed with the original plan and break open the g-file with 26.gxf5, where 26...Nxf5 can be met with 27.Qf6+ Rg7 28.Rxg6 Qxg6 29.Qxd8+.\n",
        "26... Qg8": "? Black should have taken on g4 immediately, to half-open the f-file against White's backward f-pawn. Moreover, this move prevents the BQ from defending g6 down the e8-h5 diagonal, so that when White plays Qf6+, Black must respond with ...Qg7 rather than ...Rg7 (if Black interposes with the Rook, gxf5 Nxf5 Rxg6 is very strong). After ...Qg7, White has g4-g5, creating a strong point and eventual passed pawn on f6, and allowing (eventually) a Knight to jump in on e5, striking at all of Black's weaknesses.\n",
        "27. Rh3": "? I was too preoccupied with my flawed plan, and couldn't see how strong 27.Qf6+ was here, but that was the correct move.\n",
        "27... fxg4": "Black short-circuits the White attack.\n",
        "28. Qxg4": "Things still look pretty strong for White, but it's not at all clear if his attack can accomplish anything decisive.\n",
        "28... Nf5 29. Nh4 g5": "Black puts the question to White: exchange or no? Of course White isn't really threatening f5, since Nxf5 exf5 would gain tempo for Black. The real threat is Ng6+ once the g-file is open.\n",
        "30. fxg5": "This seemed prudent. Black doesn't want to recapture with his h-pawn, as it's needed to defend his King, and he mustn't recapture with his Queen because of a deep combination that wins a piece for White...\n",
        "30... Qxg5": "?? All of White's wildest dreams have come true. I believe this *should* win for White now, thanks to the Knight check on g6 and the unprotected status of Black's Rd8. Black needed to play 30...Nxh4 here, because now White has: 31.Qxg5 hxg5 32.Ng6+ Kg2 33.Rxh7+! Kxh7 34.Rxd7+! Rxd7 Nf8+ and White regains the Rook, with an extra Bishop to his name. Unfortunately...\n",
        "31. Qe4": "?? I had gone on vacation around this time, and completely forgotten about the combination I was to play in this position. Now Black has time to consolidate on the open g file with ...Rg8.\n",
        "31... Qh5 32. Rdd3": "? 32.Rhd3 was better; the text indicates how fixated I still was on the kingside attack.\n",
        "32... Rg8 33. Be1": "Still thinking about this Kingside attack and not at all about defense, I was planning to relocate to d2 or c3, but I overlooked...\n",
        "33... Rg4": "...Rg4. Now it's Black with a strong attack.\n",
        "34. Ng2": "?? This is the final mistake. My Queen trade offer comes too late; necessary was 34.Qf3. Now Black picks up an extra Rook.\n",
        "34... Qxh3": "0-1. After 35.Rxh3 Rxe4, Black's lead is insurmountable, so White resigns. Many thanks to gotschall for this great back-and-forth game! I hope you enjoyed reading it; comments are much appreciated!\n"
    },
    "url": "https://gameknot.com/annotation.pl/tangled-tango?gm=53953",
    "gameName": "Tangled Tango",
    "players": "bwaa (1733) vs. gotschall (1736)",
    "opening": "Sicilian (B23), Grand Prix attack"
}