{
    "moves": {
        "1. e4": "Here's an exciting Sicilian from a Team match I just finished.",
        "1... c5 2. Nc3": "The dreaded Closed again (see my recent OTB draw against George Salter).",
        "2... Nc6 3. g3 g6 4. Bg2 Bg7 5. d3 d6 6. Be3 Nf6 7. h3": "Both sides proceed cautiously, concentrating on development and commanding good squares.",
        "7... Rb8": "To avoid any future pins and support the advance of the b pawn, as in the Modern defence.",
        "8. Qd2": "Planning the standard manoeuvre against a fianchettoed bishop and possibly castling queenside, though I'm well placed to attack a king so positioned.",
        "8... O-O 9. Bh6": "As expected.",
        "9... b5": "Ignoring the threat to swap my crucial bishop.  If I take on h6, his Q is invited into the heart of my defence and is difficult to shift.  If White takes on g7, the K prevents the Q from approaching without further preparation.  I launch a counter-attack, gaining space on the Q-side.  If I withstand the attack on the kingside, this will give me a long term advantage.",
        "10. Bxg7 Kxg7 11. Nge2": "This gives White \"redundant knights\", meaning that they both want to be on the same square (e2) but this one may also jump to f4 and either e6 or d5 at an opportune moment.",
        "11... Be6": "I'm usually loath to put a B in front of my e pawn but I need to develop it to clear the back row and I don't particularly need to move the e pawn in this position.",
        "12. O-O": "Deterred by my last move from castling long, or as always planned?",
        "12... Qd7": "connecting my rooks and threatening to take on h3",
        "13. Kh2": "a threat that was easily met",
        "13... b4": "forcing the N to make a decision while its brother occupies its ideal square",
        "14. Nd1": "This is OK provided White has time to redeploy it, otherwise it can be a real nuisance for him.",
        "14... a5": "progressing the Q-side pawn storm immediately.  There's no time to lose in these positions.",
        "15. f4": "! Counter attacking in the centre and on the other wing simultaneously.  A good, powerful pawn advance.",
        "15... Qc7": "Defending e5 and getting out of the way of a potential discovered attack on the d-file.",
        "16. f5": "Immediately striking at the heart of Black's position and once more opening up the Q's direct line to h6.",
        "16... Bd7 17. Ne3 e6": "taking immediate action to repel the intruder",
        "18. Ng4 Nxg4+": "Giving White doubled pawns in front of his King but also allowing him to exploit an open h file, so it's double-edged.",
        "19. hxg4 Ne5 20. f6+ Kg8 21. Qh6": "I thought \"Oh no!  It's mate in one!  I may as well resign.  Hold on, what was my last move and why did I play it?  Of yes, Nxg4 forks K & Q.  Phew!\"",
        "21... Nxg4+": "!! The only move wins the game."
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=20346",
    "gameName": "Team match",
    "players": "richn (1765) vs. rjacobs (1620)",
    "opening": "Sicilian (B26), closed, 6.Be3"
}