{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. d4": "Scotch opening (variation of the King's Pawn Game).",
        "3... exd4": "Relfsson Gambit of the Scotch Opening.",
        "4. Nxd4 Nf6": "Schmidt variation of the Relfsson Gambit of the Scotch Opening...",
        "5. Nxc6": "Mieses variation.",
        "5... bxc6 6. Bg5": "The most popular move for white here is e5, to threaten the black knight.  Bg5 is the fourth most popular move, and for some odd reason appears to give black a slight advantage.  It looks like a perfectly decent move to me, except that h6 encourages a bishop/knight swap, otherwise Nxe4.",
        "6... Be7 7. Bxf6 Bxf6 8. Nc3": "This move finally abandons the database.  c3 (which blocks the knight's advance to the field) is more commonly played.",
        "8... Bxc3+ 9. bxc3 O-O 10. Qf3 Re8 11. Bc4 d5 12. Bd3": "Although Pxe4 forks white's bishop and queen. the pawn is covered by a rook, so the fork is plastic instead of steel.  It would be just a simple pawn trade, but then black could follow with Pf5 or Bf5, pinning the bishop against the king.  White has nothing else to protect the bishop trapped on e4 at that point.",
        "12... Re6 13. O-O Qd6 14. exd5 Rh6": "Ah, black moves in for a quick kill.  15 move game.",
        "15. Qg3": "White sees through black's feint and parries.",
        "15... cxd5 16. Qxd6 Rxd6 17. Rfe1": "Another mate opportunity, this one for white, again before 20 moves.",
        "17... g6 18. Re5 Be6 19. Rb1 Rc6 20. Rb3 d4": "Black uncovers a threat to the white rook, while leaving his own rooks vulnerable to a pin by white's bishop.",
        "21. Be4": "...just like that.  Black will lose the bishop if he takes the rook, though.",
        "21... Bxb3 22. Bxc6 Rd8 23. axb3 Kg7 24. Bd5": "Oops, black wins white's bishop with Pf6.  The rook has to move off the rank--possibly Re7+.  But Kf6 or Kf7 leaves white with no way to guard against RxBd5.",
        "24... Rd6 25. Bc4": "Now the bishop is safe, and the king need not worry about Rd1# (which black would require several moves to set up).",
        "25... dxc3 26. g3 Kf6 27. Rc5 Kg7": "?  This does not protect against Rxc7.  And after that, Pa7 falls.",
        "28. Rxc7 Rf6 29. Bd3": "...or Pc3.  I prefer Rxa7 here as Pc3's advance is blocked.  White can then promote Pb3, which enjoys a pretty clear path.",
        "29... a5 30. Ra7": ""
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=55188",
    "gameName": "Team match",
    "players": "phoag53 (1307) vs. wanana (1301)",
    "opening": "Scotch (C45), Mieses variation"
}