{
    "moves": {
        "1. d4 Nf6 2. c4 g6 3. Nc3 Bg7 4. e4 d6 5. Nf3 O-O 6. Be2 e5": "Classical king-indian setup",
        "7. d5 a5 8. O-O Na6 9. Be3": "I think usually h3 is played first in these positions to prevent black's next move.",
        "9... Ng4 10. Bg5 f6 11. Bh4 Nc5 12. a3": "Starting Queen-side counter play",
        "12... Bd7 13. b4 axb4 14. axb4 Na6 15. Ne1": "Using attack on the knight to redeploy my knight to d3 square protecting b4 and working towards c5 push, the plan is to also push f3 and redeploy the dark-squared bishop to f2 to support my c5 push",
        "15... Nh6 16. Nd3 b6": "He is aiming to stop my queen-side advance. Perhaps he should've been focusing more on his king-side play.",
        "17. Ra2 Qc8": "Good move, his queen works both sides well and also removes the pin and to allow his f5 king-side attack",
        "18. Nb5": "Here I started to drift a bit, I wasn't sure how to continue. I figured the knight is very hard to remove and somewhat paralyzes black's queenside pieces and pawns.",
        "18... f5 19. f3 Nf7 20. Bf2": "All of white's pieces are now pointing to the queen-side, but black has not managed to organize a king-side attack quite yet",
        "20... c6": "I missed this, this was the point of Nf7",
        "21. dxc6 Bxc6 22. Bxb6 Qb7 23. Bf2": "Black gets some initiative in the center",
        "23... fxe4 24. fxe4 Bxe4 25. Bf3": "Good move, this was the only way that I could see to not lose the pawn",
        "25... Bxf3 26. gxf3 Nc7 27. Rxa8 Rxa8 28. Nc3 Ne6": "Nice redeployment of the night, narrowing down on the central light squares paralyzing black's centeral pawns and the dark-squared bishop",
        "29. Ne4 d5 30. Nec5 Nxc5 31. Nxc5 Qxb4 32. Qxd5": "Pretty shaky position here for me. Luckily tactics worked in my favor here.",
        "32... Rd8 33. Qe6": "Keeping the knight pinned is important here",
        "33... Qc3": "Attacking f3 and threating my fairly unsafe king.",
        "34. Nb7 Rd3": "A mistake. Black must keep white's queen from invading on the back rank. Although it's hard to find a good spot for the rook. If Rb8 then Ba7, if Rf8 then Bc4. Perhaps, Ra8 was the better spot for the rook",
        "35. Qe8+ Bf8 36. Bc5 Nd6": "Only move",
        "37. Bxd6 Rxd6 38. Nxd6 Qd4+ 39. Kg2 Qxd6 40. Qc8": "So white won an exchange and is better in this end-game, but there is still a lot of work and dangers remain. Qc8 is a good move as it protects the important g4 square.",
        "40... Qd2+ 41. Rf2 Qg5+ 42. Qg4": "Here's the point of 40. Qc8",
        "42... Qe3 43. Qe6+ Kg7": "Here I tried lots of different path's but nothing seemed to work as black always had a chance to go into checking frenzy on the white king.",
        "44. Rb2": "Good move, it still protects white's 2nd rank from queen's checks and threatens Rb7",
        "44... Qg5+ 45. Qg4 Qxg4+": "?! Making white's job that much easier. ",
        "46. fxg4 Kf7": "And here a nice final touch",
        "47. Rf2+": "Keeping the king stuck in the corner or else blocking the bishop from stopping the white's passed pawn",
        "47... Ke7 48. c5 Ke8 49. Rxf8+": "! This key deflection gives white the one extra move that he needs to penetrate black's position",
        "49... Kxf8 50. Kf3 Ke7 51. Ke4 Ke6 52. c6 Kd6 53. c7 Kxc7 54. Kxe5 Kd7 55. Kf6": "And now everything is clear",
        "55... Ke8 56. Kg7 h5 57. g5 h4 58. h3 Ke7 59. Kxg6 Kf8 60. Kh7": ""
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=6164",
    "gameName": "Team match",
    "players": "rumata (1739) vs. edandevy (1746)",
    "opening": "King's Indian (E92), Petrosian system, Stein variation"
}