{
    "moves": {
        "1. e4": "This was a recent short game that I really enjoyed playing.  It starts off with my standard e4.    ",
        "1... e6": "Black responds with e6 - the French defence. ",
        "2. d4 d5 3. Nc3 Bb4": "The Winawer variation.  In this position I think white normally plays 4.e5, and then black responds with 4...c5, exerting some pressure on the centre.  ",
        "4. a3": "But I am not one for lots of opening theory so I played 4.a3.  This is probably some sort of established line but the idea is to sacrifice the pawn on e4, to exert some pressure on black's kingside.    ",
        "4... Bxc3+": "Black captures the knight.",
        "5. bxc3": "I re-capture.",
        "5... dxe4": "And now the pawn sac is accepted.  ",
        "6. Qg4": "Black now has a choice as to which pawn to return.  The one on e4 or the pawn on g6.  ",
        "6... Nf6": "Offering the pawn on g6 in return for some piece development but losing the ability to castle kingside.  ",
        "7. Qxg7 Rg8 8. Qh6": "This is all pretty standard stuff I think.  In terms of material, both sides are level.  Black is slightly ahead in development but must castle queenside and his pawn on e4 is weak.  A fairly balanced position in my view.",
        "8... Nbd7 9. Bg5": "A useful pin.  ",
        "9... b6": "Black is looking to fianchetto his bishop to protect e4 and potentially exert some pressure on g2.  It also assists with castling.  ",
        "10. Bb5": "Threatening the knight on f6.",
        "10... Rg6": "A good move.  Defending the knight and kicking the queen. ",
        "11. Qh4": "The only square that protects the bishop.",
        "11... Bb7": "A perfectly natural move but a mistake.",
        "12. Bxd7+": "Now black must recapture with his king or face losing the knight on f6.  ",
        "12... Kxd7": "Now black has a horrible pin and his king is out of position.  Can I exploit this?  ",
        "13. Ne2": "Catching up on development but threatening Nf4.  ",
        "13... Qh8 14. Nf4": "Which black allows.  Now black must go the exchange down or lose the knight if the rook retreats.  ",
        "14... Rxg5": "Black opts for the loss of exchange.  ",
        "15. Qxg5 h6 16. Qe5 Qg7": "Aiming for queen g5 and simplification.  ",
        "17. O-O-O": "I thought for a while before deciding which side to castle.  Kingside looked better protected but I was concerned about black playing rg8, e3 and then attacking g2 using pawn h5 to h4 to h3.  Castling queenside places the rook on d1 on the same file as black's king, which I thought useful. ",
        "17... Qg5": "Aiming for an exchange of queens and simplification, perhaps with drawing chances.  ",
        "18. c4": "A cunning plan.  Now if 18...Qxe5, 19. fxe5+ and white wins the knight as it cannot go to d5. ",
        "18... c6": "Looking to control d5",
        "19. h4": "A useful move that forces the queen to g7.  White's queen still can't be captured due to dxe5+ and picking up black's knight.",
        "19... Qg7 20. d5": "Now the breakthrough.  Black is threatening to rip open the d-file and invade with the rook.  ",
        "20... exd5 21. cxd5 c5": "Black attempts to keep the d-file closed and avoids a pawn exchange on c6 with discovered check.  Now I was struggling to see how to progress the attack.  If 22. d6 (threatening 23. Qd7+), black can play 22...Rd8 and he seems to be OK.  I needed to get my rook on d1 into the game.  ",
        "22. Ne6": "So I played 22. Ne6.  A positional sactifice that threatens 23. Qc7+ and then 24. Qxb7, picking up the bishop with a strong attack.  So black must take the knight.  ",
        "22... fxe6": "Which he does",
        "23. dxe6+": "And I recapture with discovered check and bring my long lost rook on d1 into the game.  ",
        "23... Kc6": "Probably the best square for the king.  If 23....Ke7, white has 24. Rd7+, picking up the bishop on b7 or black's queen if the knight captures the rook.  23...Ke8, then 24. Rd7 and white again picks up the bishop with a strong attack.  23...Kc8 loses instantly to 24. Rd7 and then 25. Qc7# or black must give up his queen with 24...Nxd7.  ",
        "24. Rd6+": "Now the king is getting flushed out.  ",
        "24... Kb5": "Black cannot play 24...Kc7 as this allows 25. Rd7+ with a double attack and picking up black's queen for free.  ",
        "25. a4+": "Harrassing black's king some more and trying to draw it up the board.  If 25....Ka6 then white has Qxc5 and a threat of mate on b5.  ",
        "25... Kb4": "Black ignores the pawn and his king heads to b4.  Now white must strike quickly and try to force a mate. ",
        "26. Qb2+": "So I play Qb2+.   Now 26...Kc4 loses to 27. Qb3# and after 26...Ka5, 27. Qb5#.  ",
        "26... Kxa4": "The only square.  Now I just need to land a knock-out blow!  But how?",
        "27. Rh3": "A deadly quiet move.  Suddenly the rook is coming to a3 to mate and there is nothing black can do about it.",
        "27... e3": "Delaying the inevitable. ",
        "28. Rxe3": "But it's all over, and here my opponent resigned.  A fun game and a nice little king hunt to finish.  Look forward to your comments.  Cheers.  "
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=52245",
    "gameName": "Team match",
    "players": "prcpower (1832) vs. nativenewyorker (1860)",
    "opening": "French (C15), Winawer (Nimzovich) variation"
}