{
    "moves": {
        "1. d4 d5 2. Nf3 Nf6 3. e3 Bg4 4. c4 e6 5. Qb3 Bxf3 6. gxf3": "(W) Mm, I like QxPb7 better.  Black must deal with the rook, then white picks off the bishop, picking up a pawn in the process.",
        "6... b6 7. Nc3 Nc6 8. a4 Bb4 9. Bd2 dxc4 10. Qxc4 Qd7 11. Bh3 Bxc3 12. Bxc3 O-O 13. O-O-O a6 14. d5": "This was a pretty good move on white's part.",
        "14... exd5 15. Qh4": "(W) Although this protects the bishop, 15. BxQd7 is better.  PxQc4, 16. BxNc6 and black has the threat at Ra8 to deal with.\n",
        "15... Qd6 16. Rdg1 g6": "(W) QxNf6.  You could use the bishop, but Q kind of forces a trade of queens.  Black must counter 16. Qg7#.  Black should probably have considered Ne8 instead.",
        "17. Bxf6 b5 18. Rgd1": "(W) Not sure the point of that.  I kind of like 18. Pa5.  NxPa5, Be7 forks the black queen and rook.  Can't fork wile Nc6 is guarding e7, though.\n\nRg4 is another move with promise.  White would dearly love to move Qh6, but cannot while QxBf6 (the queen is the only piece covering white's black bishop).",
        "18... Rfe8 19. Bc3 Qc5 20. Kb1": "?  Why not Qh6?  The white king is not threatened.",
        "20... b4 21. Bd2 d4 22. Rdc1 Qd5 23. e4 Qb3 24. Rxc6 Qxa4 25. Rc4": "(W) I'm kind of partial to Bd7 here instead.  If black does not move the queen (but moves the rook instead), RxPg6+.  PxR (who cares which one) BxQ.  The nice part is I don't see how black avoids a rook/bishop exchange.\n\nFor black, Pa5 protects Pb4.  Rb4 does too, Rab4 maybe.",
        "25... Qb5 26. Rxd4 a5 27. Rd5 Qa4 28. e5": "(W) Ok what?  The rook is covering d7.  Bd7.  Bd7 forks the black queen and rook!\n\n",
        "28... Qc6 29. Qe4 f6 30. Rc1 Qb6": "(W) What could be cool here is Qc4.  If black responds with RxP or PxP, Rd6+ trades the white rook for the black queen.",
        "31. Be3 Qb7": "I still like Qc4.  Be6+ looks promising.  RxB, Rd8+ and white gets a queen for a rook and bishop.  A bit expensive, but RxPc7 is in there too.",
        "32. e6 c6 33. Rd7 Qxd7 34. Qc4": "(W) Mm, I am partial to 34. PxQ, RxQ 35. PxR4.  White ends up with a pawn on the 7th rank backed by a rook and couple of bishops.  Black moves the queen and catches up materially (good move, T!)",
        "34... Qc7 35. Bf4": "Not necessary to push the queen--Pc6 belongs to white here.",
        "35... Qe7 36. Qxc6": "Ok it is cheaper this way.",
        "36... f5 37. Rg1": "Not sure why not Re1 instead.",
        "37... a4 38. Bxf5": "(W) Oh, right.  Yes, 37. Rg1 was a pretty good idea.\n\nOops, just realized my guy is playing black.  Will go back and redo this for black's advantage, labeling original suggestions with (W).",
        "38... Rac8": "Nah, Pa3 is probably better.  Here QxPa4 for free.",
        "39. Qxa4 Qc5 40. Bh3 Rca8 41. Qb3 Re7": "I think I like Qa5 better.  Black could pick off white's other rook with Qa1+.  Of course white would probably play 42. Pe7+ Kg7...  Black cannot check with the queen or bishop without losing either.",
        "42. Be3 Qa5 43. Kc2 Qc5+": "Down three points black should check with the rook instead.  Here BxQ and threatens the black rook too.",
        "44. Bxc5": "Just like that.",
        "44... Rc7 45. e7+ Kh8 46. Qxb4 Re8 47. Qc3+ Kg8 48. Be6#": ""
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=56563",
    "gameName": "Team match",
    "players": "santorini (1339) vs. phoag53 (1259)",
    "opening": "Queen's pawn game (D04)"
}