{
    "moves": {
        "1. e4 e5 2. Nf3 d6 3. d4 Qf6 4. Bg5 Qe6 5. Nc3 f6 6. Nd5": "This was silly. I thought the threat of the fork would be great, but it made things a bit clumsy in the end. The ease with which black could play 7... c6 made this pointless.",
        "6... Qd7 7. Be3 c6 8. Nc3 Ne7": "Now black has removed most of the pressure",
        "9. d5": "if 9... cxd5 then 10. Nxd5 is useful - even if the exchange of knights happens, the remaining black d6 pawn is not happy.",
        "9... a6 10. b4": "Trying to support playing a4 and a5 here. I wanted to create a positional squeeze in black's camp.",
        "10... Qc7": "Attacking the c3 knight. If 11... cxd5 12. Nxd5 Nxd5 13. Qxd5 Qx3  is nasty.\n\nI need to remove the fork on the rook at move 13, ideally whilst protecting the b4 and c2 pawns -- hmmm....",
        "11. dxc6": "I think there is little choice to play the exchange, this is quite awkward for white, as the defences are stretched very thin to look after the pawns because of their poor structure.",
        "11... Qxc6 12. Qd2": "Defending the pawn, and the c3 square, allowing the knight to defend the d5 square properly, and advance their itself if appropriate.",
        "12... Be6 13. Be2": "Considered playing b5, but decided against it because of the ease which the Queen could move out of the way. Obviously 13. b5 axb5 14. Bxb5 is losing for black, but unless white gets b6 and gets the a pawn up to a5 it will be hard to hold material I think. Maybe this line would have been better, but I wanted to castle and relieve the pressure on any c3 forks to reactivate my queen in an attack.",
        "13... d5 14. exd5 Nxd5 15. Nxd5 Bxd5 16. Rd1": "This is interesting. I am now looking at Qd8 , giving a long term positional awkwardness to black's back rank. The bishop needs defending, and 16... Bxf3 17. Qd8  Kf7 18. Bxf3 looks very interesting. This game could still explode somewhat I think!",
        "16... Bxa2 17. Qd8+ Kf7 18. O-O Be6 19. Rd2 Rg8": "Looks like the pawn sacrifice was a foolish move. Now the threat is 20... Bxb4 and I cannot defend the pawn with Qb6, Bc5 or c3, so I am looking at losing a second pawn. Again, material sacrifice for initiative is top on my agenda, so I am going to try a crazy looking combination:\n\n20. Nxe5  leaves a king / queen fork, and after 20... fxe5 21. Bh5  g6 (forced) 22. Bg5 I have some fun mating possibilities with Qe7, Qf6 and / or Rd8.",
        "20. Nxe5+ fxe5 21. Bh5+ g6 22. Bg5": "22... gxh5 is not possible due to 23. Qf6  Ke8 24. Rd8#\n\nHowever, because of the knight on b8 white is very restricted, regarding pressure on d7 -- as such, simply Bd7 or Nd7 works well.",
        "22... Nd7": "Both the bishop and the queen are hanging, and after gxh5 there is a mate threat on g2 if the g5 bishop moves, so 23. Qxa8 gxh5 leaves the other bishop hanging also. Things are looking very grim for white.",
        "23. Bf3": "Last, desperate counter-attack measure. After 23... Rxd8 24. Bxc6 either the d7 knight or the d8 rook are hanging. If 24... Ke8 then 25. Bxd8 Kxd8 26. Bxb7 seems good, returning material to equal again.\n\n23... Qxf3, bizarrely, looks best, as after 24. Qxa8 the immediate danger is over with a slightly favourable exchange for black (bishop and knight for the rook).",
        "23... Qc8": "This is presumably expecting a simple exchange of queens, but after 24. Rxd7 , 24... Bxd7 25. Rxd7  and 26. Rxb7 seems reasonable for white - there is also a lot more pressure on the black position.\n\nThe alternative, 24... Qxd7, allows 25. Qxa8 which evens out material. This game is as sharp as any I have had going in team games so far.",
        "24. Rxd7+ Qxd7 25. Qxa8": "Material is now even, but Bxb4 will level the playing field again, and forces me to squeeze out uncomfortably through the a7 square. One pawn behind, but otherwise back in the game!",
        "25... Be7": "Oh dear, I lied, this is not nice at all :-(\n\nLooks like material is still positive for black after all, after 26. Qxb7 Qxb7 27. Bxb7\nBxg5 28. Bxa6\n\nif 26... Bxg5 then 27. Qxa6 gives the same material advantage.",
        "26. Qxb7 Bxg5 27. Qxa6 Rc8": "Hmmm... nice idea, threatening 28... Bc4 or 28... Rxc2, whichever I don't prevent. Actually, I can probably delay this with 28. Rd1 threatening the queen and removing the fork.",
        "28. Rd1 Qc7": "Doubling up to take the pawn. Could simply play Be4 and defend the pawn, or alternatively 29. Bd5 Bxd5 30. Rxd5 is interesting, though it looks like 30... Qxc2 31. Rd7  Be7 would end any long term attacks. It's a tactical possibility for the future though.",
        "29. Be4 Rd8": "Awkward, even with the threat of back rank mate I don't really want to exchange (30. Rxd8 Qxd8 31. Bd3 may be possible), yet obviously the immediate threat is mate in one anyway. I'll retreat here and try to regroup.",
        "30. Qe2 Bc4": "Hmmm, 31. Bd3 seems to expect material exchanges, but keeps  my two passed pawns ok after 31... Bxd3 32. Rxd3 Rxd3 33. Qxd3. I'm going to play Qf3 in the hope of finding some tactical traps appear. This isn't really good chess but mass material exchanges don't seem ideal for white either :(",
        "31. Qf3+ Kg7 32. g3": "Removing back rank mate threats.",
        "32... Rxd1+ 33. Qxd1 Qb6": "Threatening the obvious Qxb4 and the pin at Be3",
        "34. c3 Be3": "Qf3 works here, and is simple, but for some mad reason I overlooked this and instead opted for another check. Hopefully again there is sufficient counter-play to make it worth-while!",
        "35. Qd7+ Kh6 36. Qh3+ Kg7 37. Qd7+": "White is happy with a draw considering ....",
        "37... Bf7": "But black is not.",
        "38. Bd5": "If 38... Bxd2  39. Kg2 it is hard to see black's next move.",
        "38... Bxf2+ 39. Kg2": "As said, Black now has two hanging bishops, it is hard to see where to go from here.",
        "39... Qf6 40. Qxf7+ Qxf7 41. Bxf7 Be1 42. b5 Bxc3": "Material is now even again.",
        "43. Bd5 Ba5 44. Kf3": "Opposing bishops, one passed pawn each - draw seems logical and was agreed."
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=10140",
    "gameName": "Team match",
    "players": "topazg (1497) vs. hinki99 (1479)",
    "opening": "Philidor's defence (C41)"
}