{
    "moves": {
        "1. e4": "Tipping Point = a point in the game, usually leaving the opening book and entering the end game, in which the game is tipped slightly in favor of one player.\n\nI concentrated on gaining the advantage at each tipping point.",
        "1... c5": "I chose the Sicilian Defense because of comments in MCO-13 and the fact that most upper rated players seem in favor of it.",
        "2. Nf3 d6 3. Bb5+": "NCO-13 comments: ...a safe system, avoiding the complications of the open variations. White gains an initiative against imprecise play, but otherwise has few prospects for advantage.\n\nSince I am looking to tip the scales of advantage in my direction, I simply try to be precise and look for the advantage for me.\n\n",
        "3... Bd7 4. Bxd7+ Qxd7 5. d4": "White left the NCO-13 opening book at this point. Probably a benefit for me in looking for the first tipping point advantage.\n\nI would rather be closer to castling, and maybe not have the queen off the back rank yet. BUT, I'll take the possibility of advantage.",
        "5... cxd4 6. Qxd4 Nc6 7. Qe3": "White left the GameKnot database at this point -- possibly another weakness.\n\nThe next few moves prepare black for castling. White is not aggressive.",
        "7... g6 8. O-O Bg7 9. c3 Nf6 10. h3 O-O 11. Nbd2 e6 12. Nc4 b5": "Is this a gain of tempo for black, forcing his knight back?",
        "13. Ncd2 a5 14. Nb3 b4": "I found a place to increase my aggression here.\n\nBy now, I think we are well pass the first tipping point with not much tip.",
        "15. Bd2 Rfc8 16. Nbd4 h5 17. Rac1 e5 18. Nxc6": "This starts a series of exchanges that puts black temporarily behind in material. Could this be the second tipping point? I devoted my attention to recovery of material.",
        "18... Rxc6 19. cxb4 axb4 20. Bxb4 Rxc1 21. Rxc1 Rc8": "Perhaps a tempo gain for black. He decides to hunker down.",
        "22. Rf1 Rc4 23. Bc3 Rxe4": "Gaining material equality again..",
        "24. Qc1 Nd5 25. Re1 Rc4 26. Qd2 Qc6 27. Qg5": "I worried about his advanced queen for a while, but then decided for more aggression instead.",
        "27... Nxc3": "Begins a combination to gain a point.",
        "28. bxc3 Rxc3 29. Kh2 Rc2 30. Qd8+ Bf8 31. Kg3 Qc5": "Here black has an eye on gaining significant material advantage by setting up an attach on white's rook. Notice the possibility of a fork of his rook and king next move.",
        "32. Rf1 Qc4": "This is a fork between his rook and mate. He probably did not see the mate.",
        "33. Re1 Qf4#": "Thanks for looking over this game. I am learning chess, so I appreciate any comments that anyone has throughout."
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=16140",
    "gameName": "Team match",
    "players": "barrios (1451) vs. mibsam (1526)",
    "opening": "Sicilian (B52), Canal-Sokolsky attack, Bronstein gambit"
}