{
    "moves": {
        "1. e4 d5": "2. exd5 is the preferred approach.",
        "2. e5": "Now 2 ... Bf5.",
        "2... e6 3. d4": "3 ... c5 here",
        "3... Ne7": "4. Nf3 or c3 is preferred. I can see that neither player is using the GK World database.",
        "4. Bd3 b6": "5. c3 is called for.",
        "5. Ne2 g6 6. O-O Bd7 7. c4": "7... dxc4",
        "7... c6": "Now White should develop a piece, like Bg5. Or, if White insists on moving the c pawn, exchange it for a center pawn. But don't push it.",
        "8. c5": "What was the point of this??",
        "8... bxc5 9. dxc5": "What has White wrought with 8. c5?",
        "9... Bg7 10. f4": "OK, this pawn push was needed to protect the e pawn.",
        "10... O-O 11. Nbc3": "Excellent!  You're developing your pieces.",
        "11... a5": "I'm skeptical of this.  How about f6 instead?",
        "12. Na4 Bc8 13. Nb6": "A nice outpost!",
        "13... Ra7 14. Bd2 Nd7 15. Nxd7 Qxd7 16. g4": "What?? How about developing your pieces?  Like Nd4. Qa4.  Be skeptical of your pawn pushes so early in the game when your pieces are not out yet.",
        "16... Ba6 17. Bxa6 Rxa6 18. b4": "What??  Another pawn push?  How about Qa4 instead.Or Nd4.",
        "18... axb4 19. Bxb4": "I am expecting Black to double rooks.  Rfa8. Or g5 first with idea of Ng6. White cannot take without getting double isolated pawns and losing pawn protection for e5.\n",
        "19... Raa8": "This is a surprising move, and not in a good way.  Timid.",
        "20. a4": "Nimzovitch tells us to act in the center.  So, were I Black, ... f6 would be my move. \n\nNow, this a4 move works out for White in the game, but I am generally skeptical of these pawn pushes. I would be expecting g5 or f6 and would likely have moved my Bishop to c3 first.",
        "20... Qc7": "I'm thinking Qd2, anticipating ... f6 or ... g5 and wanting to backstop my Bishop and position my Queen to help protect my advanced Kingside pawns.",
        "21. a5": "Black has the better game at this point in my opinion.  ...g5 then ... gxf4 or Ng6 and Black attacks the center.",
        "21... Bxe5": "A blunder. Black had the right idea of countering here, but not this way.  Instead, g5. White now has the better game.",
        "22. fxe5 Qxe5 23. a6": "Now we expect Black to use his superior center. Qe3+, then e5, then f5 or f6 and a counterattack begins.",
        "23... Ra7": "Ineffective.  Better Qe3+.",
        "24. Qd3 Qc7": "Black is retreating and giving up initiative to White.",
        "25. Ba5 Qe5": "I'm getting whiplash watching this.",
        "26. Bb6 Raa8 27. Nd4": "Yes, finally!",
        "27... Qg5 28. a7": "A mistake. White seems to have just one thing on his mind!  Qg3 was necessary to defend the King, to prevent Black's counterattack (at last).  Black would follow with moves like h5, e5.",
        "28... Qxg4+": "Better e5 first, driving away the Knight. BUILD the attack.",
        "29. Qg3": "Ouch!  This is a mistake as now White loses its Knight. Black is all of a sudden decisively ahead. [Hmmmm.   Someone isn't using the Analysis board and Flip.]",
        "29... Qxd4+ 30. Qf2": "At this point, a piece ahead, I would exchange my Queens. ",
        "30... Qg4+ 31. Kh1 Nf5 32. Bc7 d4": "Better e5",
        "33. Rfb1": "A blunder.  Now Rxa7.  If RxR, then Qe4+, taking the Rook and beginning the march of pawns with e5! This is Black's game now to lose.",
        "33... Rfc8": "A Rxa7 was needed here.  ",
        "34. Rb8": "Excellent!",
        "34... Ng3+": "A blunder. It's White's game now.  [Someone else isn't using the Analysis and Flip features of GK.] Rf8 or Qe4+ was called for.",
        "35. Bxg3": "Qxg3!  Then, perhaps ... Qxg3; Bxg3, Rf8; Bd6, Rfxb8; axb8(Q), Rxb8; Bxb8. White's ahead and should want to exchange Queens.",
        "35... Qe4+ 36. Kg1": "Now I would expect ...Rc x b8 or ... Rf8.  What does Black do? ",
        "36... Qd5": "Blunder. I guess the Analysis board was unavailable.",
        "37. Rxc8+ Rxc8": "Now I imagine Qf6. There is a recurring theme here, that you can build the attack.  \n\nThe pawn on a7 is safe and the Rook is busy protecting the back rank.  Let's get more pieces in on the attack.  \n\nYou can imagine Qf6, then Be5 threatening mate. Queens will get exchanged and White's bishop will land on f6, limiting the King's movement. Then Rb1-Rb8+ (Black cannot take the pawn on a7 because of Rb8 mate). If Black takes the rook, then the pawn Queens.  Black will lose his rook with the check.  IfThe Black King will start running, with h6 as a start. ",
        "38. a8=Q Rxa8 39. Rxa8+ Kg7": "Ra7, threatening Qxf7 mate.",
        "40. Bd6 d3": "A blunder.  White has mate now.  Bf8+, Kg8; Bh6+, Qd8; Rxd8 mate.",
        "41. Ra1": "Oh no!! White panicked. One move ago White had mate.  ",
        "41... d2 42. Rd1 Qg5+ 43. Qg2 Qe3+ 44. Qf2 Qg5+ 45. Bg3 Qd5": "?",
        "46. Rxd2 Qg5 47. h4 Qe7 48. Qd4+": "There is no good place to hide. ",
        "48... Kh6 49. Bf4+": "Excellent!",
        "49... Kh5 50. Qe5+ Kxh4 51. Rh2+ Kg4 52. Rg2+ Kh3 53. Qe3+ Kh4 54. Bg5+": "The next move is Qf3 mate."
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=48359",
    "gameName": "Team match",
    "players": "chrisforbes21 (1279) vs. blue148 (1202)",
    "opening": "Scandinavian (centre counter) defence (B01)"
}