{
    "moves": {
        "1. e4": "Titled \"An Inane Conception\" (\"The French Connection\" \"The Immortal Game\" and \"The Iger Sanction\" were all taken) my annotations may also be taken as refective of the title.\r\n\r\nBest by test RJF",
        "1... e6": "Better than the rest, Watson?",
        "2. d4": "\"More options than 2.Nc3\" , CAC",
        "2... d5 3. Nc3 Bb4": "A Winawer, yea ! I like this variation.",
        "4. e5": "Best by test ... me again, Metro Chess 1987?!",
        "4... c5": "Most common, even Beujuez . Did I spell that right?! I am only 1/16 French tho. (But enough to keep my hair in )",
        "5. Bd2": "No! No, no no no no. This is very Boring line! Okay, so lets just play what Ross plays against me in blitz ... ",
        "5... a6 6. Qg4": "Okay, so now I know what to do to Ross... that was quick! ",
        "6... g6": "This is a great blitz move, it'lll work here too. No one under 1812 ever refutes it ... ",
        "7. a3 h5": "Zwishenzug! (and we all know, \"Zwishenzugs win games!\" CAC GK Forums 2004) and, Continuing my plan of weakening BL's dark squares.\r\n(chasing queens with pieces Good, chasing Queens with pawns Bad. CAC 2006)",
        "8. Qf4": "Still we battle for control of f5. I cant get rid of that queen! ",
        "8... Bxc3 9. Bxc3 cxd4 10. Bxd4 Qc7 11. Nf3 Nd7": "All routine developments, yawn. ",
        "12. Bd3": "Uh, oh. Threatening f5",
        "12... f5": "You will not have f5 !! Bite on that...",
        "13. O-O Nf8 14. Rac1": "Going after my weakened Kingside ... ",
        "14... b5": "To distract him from my weakened kingside ... clever eh?",
        "15. c4": "c4! Clearing c2, Now WT can play Ne1,Nc2,Ne3 adding pressure to f5! ",
        "15... dxc4 16. b3 Qe7 17. bxc4 bxc4 18. Rxc4": "I hate woodpushing, sigh",
        "18... Qxa3": "Remembering that old adage \"When in doubt, move a Rook pawn\"  ... so I moved his",
        "19. Qd2": "Finally! There is an Admission. He gives up and I have Won the battle for f5. As per Nimzo or Steino, I forget, but anyway ... \"establish a strong point and overprotect it\". I hope they are proud :) Now I've only to clean up, and its over...",
        "19... Qe7 20. Rfc1 Bd7": "Note how even now, the Bishops exertion on f5 is not diminished. So Bd7 is OK",
        "21. Rc4c7": "More Nimzovich, Put your Rooks on the 7th rank",
        "21... Qd8 22. Bb6": "hmmm Cleaning up is starting to display techinical difficulties for BL . ",
        "22... Rh7": "Since it cant reach My 7th rank, this will have to do ...",
        "23. Ng5 Rg7 24. Bxa6 Rxa6 25. Rc7c8": "He Told Me that Rook was going to stay on the seventh rank forever, so I feel Very Betrayed here. }B-((",
        "25... Rxb6 26. Rxd8+": "Not surprising, when all my analysis was based on having a WT rook on the 7th!\r\n",
        "26... Kxd8 27. Qa5 Ne7": "I know, I know. If I had had this knight here, protecting f5, earlier I would not be having these troubles. But I thought it important to be sure this was better than Nh6 for covering the key square, f5. I did consider Nh6 at many points. Yet , Obviously I've chosen e7 wrongly, and now my game deteriorates. ",
        "28. Qxb6+": "Check",
        "28... Ke8 29. Qb8+": "Check And here I resigned, when it becomes apparent that the BL King will not ever reach f5 now.  Usually I allow a combinative win to play thru to conclusion.\r\nI must've passed out on the keyboard"
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=489",
    "gameName": "Team match",
    "players": "apastpawn (1813) vs. ccmcacollister (1779)",
    "opening": "French (C17), Winawer, advance, Bogolyubov variation"
}