{
    "moves": {
        "1. e4 e5 2. Nf3 d6 3. d4": "Not c3, as I tried in another annotated game of mine. Although I won that game, its opening phase seemed questionable on my part, so I decided to go more conventional in this case. ",
        "3... exd4 4. Nxd4 g6": "preparing Bg7 leading to a rather strong bishop for black",
        "5. Bc4 Bg7 6. O-O Nf6 7. Bg5 O-O 8. Qf3": "Pressuring the knight, but in hindsight this is really too optimistic, or at least too early: as we will see in a moment, the queen will be hurled around a bit, while black positions his pieces nicely. simply developing the knight seems better.",
        "8... Nbd7 9. Qf4": "profilaxis against Ne5. It doesn't prevent the move, but it does prevent it from being an annoying fork.",
        "9... Qe8 10. Re1 Nh5 11. Qe3": "I wanted to develop my other knight via d2, so I avoided Qd2 here, but as we will see later, this is not really the most convenient square either, since black will be able to place a knight on g4 with a tempo gain later on.",
        "11... Ne5 12. Bb3 Ng4": "As mentioned earlier, the ill-positioned queen allows black to make this move à tempo and it leads to a powerful sequence winning a pawn",
        "13. Qd3 Qe5 14. Nf3": "14. h3 doesn't seem great either because of 14...Qxd4 15. xg4 Qxb2 16. Nd2 Nf6",
        "14... Qxb2 15. Nbd2 Ne5 16. Nxe5 Qxe5 17. Nf3 Qe8": "Black doesn't mess about with his queen out in the open, but retreats to set up his pieces for what should be a favourable end game, as he is a pawn up and white's pawn structure on the queen side is messed up",
        "18. Rad1": "Normally one might indeed want his rooks on the centre files, but in this case, the rook was probably better positioned on b1, where it gets to put on some (momentary) pressure. Black's favourite move to develop his bishop (seen next move) would for example not be possible in that case",
        "18... Be6 19. h3": "unnecessary. g4 might be an interesting move to play somewhere in the future, but since the bishops are likely to trade anyways, preparing it in this manner doesn't do much but waste time.",
        "19... Bxb3 20. axb3": "black trades off to take away tension from the board and make transition to a won end game more comfortable, but it comes with the down side of fixing white's pawn structure.",
        "20... Qc6 21. e5": "opening up the centre would be favourable as I have already positioned my rooks along the centre files.",
        "21... Rfe8 22. g4": "looking to trap the knight, but really losing another pawn, since black can punch right back with his own little trick",
        "22... dxe5 23. gxh5": "Given that black will win back a knight with e4 on his move, playing Nxe4 first is better. This still loses a pawn through 23...Bxe4 24. xh5 xh5, but at least in that position, black has a bunch of weak pawns, rather than a pawns on f3, preventing my king to move out in the end game.",
        "23... e4 24. Qe2": "Preparing for an exchange sequence",
        "24... exf3 25. Qxe8+ Rxe8 26. Rxe8+ Qxe8 27. Rd8 Qxd8 28. Bxd8": "and we've entered the end game. White seems heavily disadvantaged, but it didn't look much better before the exchange if for example Qd2 would have been played, rather than Qe2",
        "28... c6 29. hxg6": "Seems a bit inaccurate in hindsight. If I allow black to take, his pawn structure is ruined, so I am likely to get the pawn back anyways and in this way, I allow black to create a fast lane for his king.",
        "29... fxg6": "Opens up a quick route for the king to rush forward.",
        "30. Bc7": "Trying to secure the h2-g3 route for the king but",
        "30... Bd4": "effectively prevents that",
        "31. Bf4 a6": "Be3 was coming, so this move is useful to make sure that black is not obligated to trade in that position (which would free the white king and doom the f3 pawn).",
        "32. Be3 Be5": "avoiding the trade to keep the king locked up",
        "33. Bb6": "I planned on getting my king to e3 and wanted to block his QS movement in the meantime. However, this wasted one tempo too many, as black's king will join the action too quickly now.",
        "33... Kf7 34. Kf1 Ke6 35. Ke1 Kd5 36. Kd2 Ke4": "With the black king this far advanced and two pawns down, there really is no hope any more, since the pawns on the king side should easily overwhelm me. I rather pointlessly played some more moves.",
        "37. b4 Bf6 38. Be3 g5 39. c4 b5 40. cxb5 axb5 41. Bc5 h5": "And a concession. Black can free up his h-pawn, then block the b8-h2 diagonal with a bishop on e5 and happily march to h1."
    },
    "url": "https://gameknot.com/annotation.pl/team-match-yeshuas-warriors-vs?gm=57888",
    "gameName": "team match yeshua's warriors vs.",
    "players": "martenp (1866) vs. donex7 (1861)",
    "opening": "Philidor (C41), Larsen variation"
}