{
    "moves": {
        "1. e4": "The game begins with a king pawn opening which can lead to early tactics.",
        "1... c5": "Black replies with a Sicilian, an opening which creates the most opportunity to unbalance the game and offers black counter attacking chances.",
        "2. d4": "White responds with an out of sequence move. The usual move is 2.Nf3 which prepares the move d4.",
        "2... cxd4": "Black follows through with the normal response to d4 of ...cxd4, which in this case will draw attention to d4 until the black pawn is captured.",
        "3. Nf3": "White continues with the out of sequence, main line move of Nf3 which prepares Nxd4, the next move in sequence from this point. Black can not successfully save the pawn due to the double attack on it presently.",
        "3... Nc6": "Black continues with a normal developing move. The intention is not to recapture as in [4.Nxd4 Nxd4  5.Qxd4]. The idea is to maintain central pressure of N vs N, and influence on e5 and d4. Another reason for not wanting to recapture with the knight is because is takes a tempo that is better spent on further development.",
        "4. Nxd4 e5": "Black develops a pawn with tempo. White is forced to move the knight.",
        "5. Nxc6": "White makes the choice of exchanging knights instead of a retreat to f3. This move regains the tempo because black is forced to recapture the knight to maintain material and to remove the threat on the queen.",
        "5... bxc6": "Capturing towards the center. This choice avoids an early exchange of queens which would put black at a disadvantage because the king is the only piece that could recapture, thus losing castling rights. A line for the c8 bishop is opened, and an ideal placement of ...Bb7 is considered for later.",
        "6. a3": "White plays to prevent ...Bb4 , but this move costs some development time. Better was [6.Bd3] to be followed by 0-0. If black plays [6...Bb4 ] then [7.Nc3] or [7.c3] will suffice.",
        "6... Nf6": "Black develops with castling in mind. The move also attacks e4.",
        "7. Bd3": "White develops the bishop to protect the pawn and also prepare 0-0.",
        "7... Be7": "Black continues to develop in preparation for 0-0. The bishop is not developed to c5 where it is a target of b2-b4, and also not to d6 where it blocks the d7 pawn advance. The bishop also covers the knight in case of [8.Bg5].",
        "8. Bg5": "This is a move favored by Kasparov in some Sicilians. In this position it does not seem to offer much pressure due to the bishop and queen protection of the knight, but it could be used in an attempt to lure the move h7-h6, weakening the castle - although that move is not forced and the f6 knight can simply be moved to apply a counter attack on the g5 bishop.",
        "8... O-O": "Black has almost completed back rank development. The king is safe and all that is needed is to move the bishop and queen from the back rank at some point so the rooks will be tied. The position is about equal.",
        "9. O-O": "White also has just to develop the queen and knight from the back rank to complete back rank development.",
        "9... a5": "Black seeks to play positionally against queenside development, in which the move b2-b4 is expected. If [10.b4] then [10...axb4] and now [11.axb4 is not possible due to the unprotected rook at a1.",
        "10. c4": "White plays against the center while black is playing against the flank. The key square of focus is d5.",
        "10... Bb7": "Black develops the bishop from the back rank in a diagonal that targets d5.",
        "11. f4": "White switches to a kingside flank attack on the unprotected e5 pawn. If no pawn exchange occurs then f4-f5 will be uncomfortable for black as it seeks to cut off the black pieces from the king side of the board.",
        "11... exf4": "Black alleviates the pressure, mindful that the knight can incur an attack from e4-e5. There are 2 possible ideas for the knight, the first is [12...Nd5 which attacks the undefended bishop while placing the black knight in danger of capture. If [13.Bxe7] then [13...Nxe7] and the knight is safe. Else if [13.exd5] then [13...Bxg5] and material balance remains. The second idea is to retreat the knight to e8, but this move offers no real counterplay.",
        "12. Rxf4": "White recaptures with the rook into a slightly vulnerable square.",
        "12... Nd5": "A twin attack, but it is not as effective as it would be if Bxe7 did not have the rook and queen targets. Now the move [13.Bxe7] is expected.",
        "13. Bxe7 Nxe7": "Material is still even. White has some need for development and a coordination of pieces. Black is a little closer to completing development, but also has a need to coordinate pieces. Black does have inline rooks, while white does not. Not a big factor at the moment, but the f4 rook is hanging.",
        "14. Qc2": "White develops into a diagonal aligned battery which aims at h7. This move does overprotect the d4 pawn to work against the pawn push d7-d5. It is a defensive move that could turn to an attack.",
        "14... Ng6": "The knight develops to a somewhat better square while attacking the rook to gain tempo and also blocking any attack on h7.",
        "15. Rf1": "The rook returns to the back rank where it could be repositioned to the e file, which would free the e4 pawn to move.",
        "15... Ne5": "Black deploys a blocking maneuver, Tarasche-Steinitz style, which also attacks the bishop, which will force it into a less useful position.",
        "16. Be2": "Even with the bishop positioned here, it is not an easy task for black to mount an attack on the d4 pawn because white has the move [Nc3] providing enough support for the pawn.",
        "16... c5": "This move opens the bishop line to put (mostly psychological) pressure on e4. This move may not be the best in retrospect because of the weaknesses incurred at b5 and d5, which now become excellent outposts for the b1 knight.",
        "17. Nc3 d6 18. Nd5": "A very good move. The knight occupies an excellent square where it causes disruption to the movement of the black pieces. Note the influence on the squares that the black queen would have been able to use.",
        "18... Bc8": "Black seeks to improve the position of the bishop, which because it is a white squared piece is free from immediate attack by the knight. The idea is [19...Bg4] with the idea of exchanging, a plan typical for black when in a cramped position. Note that the same squares that the queen is unable to use because of the d5 knight are the same squares that that knight is unable to use because of the queen.",
        "19. b4": "White can not play further in the center and now switches to the flank.",
        "19... axb4": "Either [...axb4] or [...cxb4] seem to be about equal choices.",
        "20. axb4 Rxa1": "Continuing the plan to exchange pieces.",
        "21. Rxa1 cxb4 22. c5": "Now the situation gets interesting. The game is leaning towards an endgame, and could almost be considered to be in the early stages of such. White seeks to break up the center with this move. This is where I began to look at options, calculating lines. [22...dxc5  23.Qxc5] leaves the b4 pawn under attack by the queen, but does remove the threatening c5 pawn. Any other move results in [23.c6] and [24.c7] where the pawn becomes a serious threat. I could not find any moves that threatened either a piece or back rank mate and so exchanged the pawn on my move.",
        "22... dxc5 23. Qxc5 Ng6": "This move became an apparent necessity when I noticed that [24.Ne7 ] was possible.",
        "24. Qxb4": "Regaining material equality. This is where I sunk into thought trying to find a plan that could give me some advantage. I was aware of the potential risks along the back rank due to the queen line on my rook and from a pin by rook on the bishop, but after looking at some potential moves for queen or bishop I found a plan to work against the harmony of the white pieces by using the queen.",
        "24... Qg5": "This move offers a little threat of [25...Bh3] where the queen threatens mate on g2.",
        "25. Ra8": "This move is a counter to the mate attempt, but in moving the rook a weakness has been opened on the back rank.",
        "25... Qc1+": "This move over protects the bishop at c8 while gaining a tempo by check. I had considered [26.Bf1] a response to this move. My next [26...Bg4?] is not good due to [27.Rxf8 Nxf8  28.Ne7  Kh8  29.Qxf8#], so I would be left with queen maneuvers. I gave [26...f5] a glance, but it looked dangerous due to opening the white diagonal to the king. My move was made with the idea of creating counterplay in the way of a pin, like white has put into play. I was seeking to find a method to trade queens, but there seemed to be nothing available for that idea. I was essentially looking for a method to draw at this point in the game.",
        "26. Kf2": "This move was the turning point for the game. I was happy to see this move because it meant that white would be running out of squares for the king. I felt the game shift to a slight advantage for black at this point. Better was [26.Bf1].",
        "26... f5": "With the idea of bringing the rook into play.",
        "27. Qc3": "Seeking to trade queens, but this is not a forcing move and black can continue with the plan of attacking with the rook.  In retrospect, better was [27.Ne7  Nxe7  28.Qxe7] with control of the g5 square, and the possibility of [29.Rxc8 Rxc8  30.Qe6  !] forking the king and rook, gaining the rook.",
        "27... fxe4+": "There is no effective method to block the check without losing a piece. The king is forced towards the dangerous kingside where black has more resources.",
        "28. Kg3 Qg5+": "Black is fortunate that white has no pieces that can block the check effectively in this position either. The white king is completely immobilized, and so has no escape squares. If [29.Bg4] then [29...Qxg4#] supported by the c8 bishop. White resigns."
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=18692",
    "gameName": "Team match",
    "players": "holypawn (1398) vs. chessknave (1441)",
    "opening": "Sicilian (B21), Andreaschek gambit"
}