{
    "moves": {
        "1. e4 e5": "{Double Kings pawns opening.}",
        "2. Nf3": "{Wanting an Evans Gambit.}",
        "2... d6": "{Getting a Philidor.}",
        "3. d4": "{Last book move.}",
        "3... Bg4": "{Book options from here would be the following variations:} 3...exd4, 4.Nxd4 d5 {Paulsen} (4...g6/Nf6) {Larsen, Philidor}  3...exd4, 4.Qxd4 Nc6 (4...Nf6) {Morphy}  3...f5 4.dxe5 fxe4 5.Ng5 d5 6.e6 (6.Nc3) {Del Rio, Steinitz}  ...3.Nd7 4.Bc4 c6 5.c3 (5.Nc3, Ng5, 0-0) {Hanham}  3...Nf6 {Nimzowitsch}  3...Nf6 4.Nc3 Nbd7 5.Bc4 Be7 6.Bxf7  (6.dxe5, Ng5, 0-0) {Improved Hanham} {The text move applies a pin, but the knight is covered by the g pawn and the d4 pawn is guarded by the queen. There are no special tactics to be applied here.}",
        "4. Nc3": "{White develops a piece adding a little more control to d5 and guard to e4. White has no hanging pieces. Black has a hanging bishop. The position appears quiet and nearly equal except for white having 2 good bishops and black has only one.}",
        "4... Nd7": "{Black develops the knight with caution, because if instead of the text move, plays} 4...Nc6 5.d5 Nd4 6.Qd3 {pressuring the bishop to take the knight} 6...Bxf3 7.gxf3 {to breakup the kingside pawns and prevent } (7.Nxd4 exd4 8.Qxd4). {The alternative loses a pawn, and the BxN variation doesn't look bad for black, having a posted knight, except white has the 2 bishop advantage. The text move develops defensively and prepares 0-0-0.}",
        "5. Be3": "{Over protects d4 and makes ready for 0-0-0. Now if 5...Bxf3 6.Qxf3 and the bishop covers d4. Appears to improve the position for white some.}",
        "5... c6": "{An unusual looking move. Fights for control of d5 some. Assumed to gain passage for} 6...Qa5",
        "6. Qe2": "{Developing the queen off the back rank where castling will line the rook up with the opponents queen.}",
        "6... b5": "{Black plans an early pawn storm. The knight at c3 is facing the threat b5-b4.}",
        "7. Qd2": "{This is very post-mortem analysis. Assumedly I was thinking of the variation:} 7...b4 8.Ne2 Rb8 9.b3 {...and perhaps a change of plans for castling.}",
        "7... h6": "{Philidor would be proud.}",
        "8. h3": "{Deciding to press the exchange, but if the mass of pawns remain on the board the knight could be missed.}",
        "8... Bxf3 9. gxf3": "{The rook now has an opportunity to apply pressure on the g file. The downside is the pressure queenside and the decision to castle there looks a bit unappealing.}",
        "9... Qf6": "{Attacking f3.}",
        "10. Be2": "{Defending}",
        "10... c5": "{Building up pressure on d4 with the threat of a fork.}  11...cxd4",
        "11. dxc5": "{Trying to relieve the pressure.}",
        "11... dxc5 12. O-O-O": "{A less than good move, aka blunder, deserving a ??, better was...} 12.Bxb5 {...gaining a pawn and applying a pin.}",
        "12... Rd8": "{Black overlooks the same pawn. This move deserves a ?, because it leaves a weakness unguarded. Better was...} 12...b4 13.Nd5 Qc6 14.Kb1 Bd6 (14...a5) {With a pawn storm.}",
        "13. Nxb5": "{White gains material, while black has the king locked in the center. There is a check threat by Nc7+ or capture Nxa7.}",
        "13... Qb6": "{Guarding c7 and a7.}",
        "14. Nd6+": "{White has confidence in exchanging pieces, then queens because the c5 and a7 pawns remain immediate targets afterwards. White has a 1 point material lead.}",
        "14... Bxd6 15. Qxd6 Qa5": "{At this point I calculated this variation:} 16.Bxc5 Nxc5 17.Qxe5+ Kf8 18.Rxd8+ Qxd8 19.Qxc5+ Ne7 {Where white would stand well with a material edge and a good postion.}",
        "16. Bxc5 Nxc5 17. Qxe5+ Ne7": "{This is the deviation point from my calculation. Well I made a good 3 ply estimate. The calculation was based on too much hope and not enough variation width.}",
        "18. Rxd8+ Kxd8": "{Obviously better than Qxd8 losing the knight.}",
        "19. Rd1+ Kc8": "{If instead of the text move} 19...Ke8 20.Qc8+ Qd8 21.Qxd8# {at best for white, or} 19...Ke8 20.Qc8+ Nc8 21.Qxc8+ Ke7 22.Qxh8 {...with big material gains for white. So the move is forced.}",
        "20. Qxe7": "{And white is able to gain 2 points from the position analyzed after move 15, blacks move. White has a 3 point advantage.}",
        "20... Nb7": "{Black reels in the knight with hopes of using it defensively. Its hard to find a better move. Black needs to maintain defense while hoping for a Qe1 mating scenario.}",
        "21. Qxf7": "{A review of the board by white shows how the rook must guard the back rank from mate. The bishop is not quite in a good enough position to be useful - it is semi bad because of the f3 pawn and has no optimal placement, not even where it stands loose on the board. So white grubs a pawn to gain more material advantage while looking for positional improvements. }",
        "21... g5": "{Protecting the pawn.}",
        "22. e5": "{White plans a ruse of pushing the passed pawn - to get a6 for the bishop. Positional improvement by small sacrifice. Tactical theme:Deflection.}",
        "22... Qxe5": "{At this point I calculate another variation:} 23.Ba6 Qc7 24.Qe6+ Kb8 25.Rd7 Qc8 26.Bxb7 Qe8 27.Qd6#",
        "23. Ba6 Qb8": "{Black deviates from the calculation, but not with advantage.}",
        "24. Qd7#": "{A nice miniature. Many thanks to my opponent for a great game, and who I am sure will find some wins against me in the future.}"
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=9131",
    "gameName": "Team match",
    "players": "chessknave (1502) vs. marcdamien1974 (1481)",
    "opening": "Philidor's defence (C41)"
}