{
    "moves": {
        "1. e4 c6 2. d4 d5 3. exd5 cxd5 4. Bd3": "This (the exchange variation) is not what I was expecting.  Recently, I've been looking into the Panov-Botvinnik attack and was surprised to see this tamer continuation.  Still, theory holds white retains a slight edge coming out of the opening, so it's hard to blame white for this line.",
        "4... Nc6": "Pressures the newly undefended pawn.",
        "5. c3": "A very solid structure!",
        "5... Nf6 6. Nf3 e6": "?!  Black overprotects his pawn, but locks in the bishop.  Perhaps Bg4 was a more enterprising continuation, though black does want to be careful not get caught with an uncastled king!",
        "7. O-O Bd6 8. Re1 O-O 9. Qc2": "This move puts pressure on the h7-pawn, but maybe this was a bit premature.  Bg5 comes to mind, as the queen certainly can delay development.",
        "9... Qc7": "That being said, black only has a few pieces left to develop, and the bishop maneuver to d7 doesn't look appetizing.  Instead, black's real purpose is not the h3 pawn, but the e5 break.",
        "10. h3 Bd7": "?! More consistent would be to try Rd8 and play for the break.  This play is rather passive.",
        "11. Bg5 h6": "Though the knight is not pinned, black does not feel comfortable with the bishop on the d8-h4 diagonal.  Finally, this meets black's threat (Bxf6 followed by Bxh7+).  Still, black may face some troubles with the half open g-file.",
        "12. Bxf6": "! The point of white's \"tactic\" on h7.  Black could not stop both this and the loss of a pawn.  Now, black's king will be feeling the heat.",
        "12... gxf6 13. Nbd2": "?!  White can hardly be faulted for bringing his last piece into the game in most situations, but here, white needs to quickly harass the black king before he can consolidate.",
        "13... Kg7": "Given a tempo, black rearranges to exploit the kingside himself.  It is, after all, HIS half-open file.",
        "14. Nf1": "White is moving his pieces to the kingside, but his play comes more slowly than black's.",
        "14... Rfg8": "Better than the overly ambitious plan of playing this rook to h8 and the other rook to g8, I think, because black is already well-poised to exploit the kingside.  The other rook would take unnecessarily long in this plan.",
        "15. Ne3 Kf8": "The black king gets out of danger quickly and exposes the g-rook.",
        "16. Ng4": "White threatens the h-pawn and the f-pawn, but should black be worried?",
        "16... Ke7": "The king is on a file controlled by the opposing rook, but there seems to be no way for white to take advantage of this tactically.  ",
        "17. Nh4": "White could have considered Nxh6, but then black would greedily have put his rooks on open h- and g-files.  Scary.",
        "17... Bf4": "!  Not only defends the pawn, but also keeps the white queen out of the action.",
        "18. Qe2": "Settling for the best square the she can.  White did seem to have a punishing reply in Nf5+!, where black would probably lose the h-pawn without real compensation.",
        "18... Raf8": "Black sees that there is no way to defend the plethora of threats and so prepares to shuttle his king over to the queenside without locking in the rook.  ",
        "19. Qf3": "Again, white fails to take advantage of the devestating Nf5+ tactic.  Still, maybe the two open files were ominous (though if black's bishop takes a knight off, white's queen gains the powerful h6-c1 diagonal).",
        "19... h5": "Black puts off the kind movement a move to prevent white from taking the f6-pawn.",
        "20. Ne3 Kd8": "White has been consistently offering the h-pawn in order to gain pressure on those files, and white has failed to make him back up his talk.  Here, though, it doesn't seem as though white could hold the knight after taking the pawn with the queen.",
        "21. Nf1 Bg5": "Black consolidates by threatening the white knight, which has no squares. ",
        "22. Qg3": "(The only way) to protect the knight.  ",
        "22... e5": "!!  Black doesn't see a way to win material by the discovery and so plans more insidious threats.  Finally having secured his king (somewhat), he looks to open files and ATTACK ATTACK ATTACK!  Possibilities of trapping the queen open up here.",
        "23. dxe5 fxe5 24. Re2": "White misses black's idea.  The queen has so few squares that he may already have to give up a queen for rook and bishop by Nf3 Bd2 Qxg8 Rxg8.  The text defends the exchange (Bd2 was a threat), but loses a piece.",
        "24... Bf4": "The queen has only one square!",
        "25. Qf3 e4": "fork.",
        "26. Bxe4 dxe4": "White hopes for some counterplay on the e- and d-files, against the black king.",
        "27. Rxe4": "Infinitely superior to Qxe4.  This move keeps black's piece-protecting of h3, renews threats on the h5-pawn and attacks the bishop!  And, technically, white is only one pawn from material equality!",
        "27... Bd6": "To keep more of the d-file closed.",
        "28. Rd1": "Pressuring the black king.",
        "28... Kc8 29. Nf5": "White rejects the pawn (again, I don't think white can answer Rh8 in a way that saves the knight) and pushes against the black king!",
        "29... Bc5": "Black's bishop finally sees no more purpose on the b8-h2 diagonal and pins the f-pawn.",
        "30. b4 Bb6 31. Ne7+": "?!  This move releases some pressure on black, but does force pieces off.  The real downside is the opening of black's light-squared bishop.  ",
        "31... Nxe7": "To save the exchange, of course.",
        "32. Rxe7 Qc6": "Escaping the pin and forcing a trade into an endgame.  (the pawn on g2 is very weak).  White could never pick up the h5-pawn, always just behind in material.",
        "33. Qxc6+ Bxc6 34. Ng3": "A final blunder suddenly decides the game!  g3 was necessary, but unpleasant.",
        "34... Rxg3": "0-1  "
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=27762",
    "gameName": "Team match",
    "players": "ironhunter (1618) vs. bobdoleeatsfood (1680)",
    "opening": "Caro-Kann (B13), exchange, Rubinstein variation"
}