{
    "moves": {
        "1. e4 e6 2. d4 c5 3. dxc5 Bxc5 4. Bf4 Qb6": "An early mistake by me, as I now have to waste a tempo by protecting f2, and so losing the b2 pawn.",
        "5. Bg3 Qxb2 6. Nd2 Bb4 7. Ngf3 Nf6 8. Bd3 Nh5 9. Rb1 Qa3 10. O-O": "Just look at the difference between white and black.  Although a pawn down, I've got more than enough compensation with my development.  ",
        "10... Nxg3 11. fxg3 Bc5+ 12. Kh1 Qxa2": "IA bit greedy.  Instead of taking another pawn, black should castle and get his king safe...",
        "13. Ng5 f6": "I can play Nxe6 followed by Q-h6 check (and picking up the black bishop on c5) but I saw something more adventurous...",
        "14. Rxf6": "And here it is...",
        "14... gxf6 15. Qh5+": "The point of my rook sacrifice.  Black's King is now out in the open, and if Kd8, Nf7  picks up the rook and black is way out of position",
        "15... Ke7 16. Qf7+ Kd6 17. Qxf6": "Keeping the initiative by forcing the black rook on h8 to move.",
        "17... Rg8 18. Qf4+ e5": "I had the option here of playing Qf5  and then Bc4, winning the rook back.  Instead I wanted to bring my knights into play",
        "19. Nc4+ Kc7 20. Qxe5+ d6": "Black has to protect his bishop on c5 and block the check.  Kc6 instead allows Qd5  and then capturing that bishop. ",
        "21. Qe7+ Kc6 22. Rf1": "Moving my rook in order to avoid a rather embarassing back-rank mate!  Looking at the position here, although white is a whole rook down, I have a monster attack and black's pieces are so badly co-ordinated.  Just look how out of the action black's queen is...",
        "22... b5 23. Nd2 a6 24. e5": "Keeping the pressure on",
        "24... Ra7 25. Qf6 Nd7 26. Qf3+ d5 27. Nf7 Qb2 28. e6 Nb6 29. Re1 Bd6 30. Nb3 a5 31. Qe3 Rg4": "This is a mistake, but in fairness to black there's not much he can do.  ",
        "32. Nxd6": "Winning a piece outright (KxN allows Qxb6 )  ",
        "32... Rgg7 33. Qc5#": "My best game to date.  Happy to hear your comments.  "
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=9288",
    "gameName": "Team match",
    "players": "prcpower (1710) vs. hannibal5 (1707)",
    "opening": "French defence (C00)"
}