{
    "moves": {
        "1. e4 e5": "Black responds symmetrically and we have a King's pawn game.",
        "2. Qh5": "White attacks immediately in the opening with 2. Qh5, putting pressure on e5 and the weak spot at f7. Black loses material quickly if he plays 2... g6?? 3. Qxe5+ and 4. Qxh8.",
        "2... Bc5": "A mistake from Black as he misses the threat of Qxe5 and develops his bishop to c5.",
        "3. Qxe5+": "White takes the pawn at e5, providing a check and threatening the bishop just developed.",
        "3... Ne7": "Black makes another error - possibly worried about 4. Qxg7, Black develops the Knight but leaves the Bishop all alone.",
        "4. Qxc5 b6": "Black attacks the White Queen and provides an avenue for his Bishop to develop into. I'd have preferred 4. d6 to prevent Qe5, but I don't mind this.",
        "5. Qe5": "White chooses to attack the weak pawn at g7 again.",
        "5... f6": "And Black responds with another pawn move, weakening a possible king-side castle, but attacking the Queen.",
        "6. Qg3": "Five of the first six moves from White have been made by the Queen, but it has done some damage as it returns with a pawn and bishop. More pressure on g7.",
        "6... O-O": "Black chooses to castle here - given this choose of move, I think Black might have been better castling last move.",
        "7. d4": "As it stands at this position, White has a very strong advantage - both materially and spatially.",
        "7... Re8 8. Bh6": "White is relentless in attacking the Black King, by making use of the pin of the g7 pawn and threatening checkmate.",
        "8... g5": "Black tries to trap the White Bishop with a pawn push, but further weakens his castle. 8. Ng6 would have prevented the mating threat and forced the bishop to move away... However, Black would have won his piece back with Nf5, using the Rook on e8 to pin the pawn to e4.",
        "9. h4": "White attacks the weak pawn structure in front of the Black King, which will also release his rook.",
        "9... Nbc6": "Black finally develops a queen-side piece, but I wonder if Ng6 might have been more suitable in this situation... as well as providing some support to the king, it gives Black some counterplay with the threat on e4.",
        "10. hxg5": "Black's defense is starting to crumble from under him.",
        "10... Nxd4": "Black chooses to attack and takes back a pawn on d4, threatening the fork at c2.",
        "11. Bc4+": "White develops another piece to the attack with a check.",
        "11... d5": "This is the best move for Black, giving up a pawn but opening up the Bishop's c8-f1 diagonal. 11... Kh8 12. gxf6 would lose for Black. 12... Ng6 13. Bg7# or 12... Rg8 13. Qg7+ Rxg7 14. Bxg7# or 12... Nf5 (either knight) 13. Qg7+ Nxg7 14. Bxg7#.",
        "12. gxf6+": "Discovered check, attacking the knight and threatening checkmate. 12... Kh8 clearly loses.",
        "12... Ng6": "Only move for Black to continue with.",
        "13. Bxd5+": "White continues on relentlessly, taking the d5 pawn to check the Black King.",
        "13... Be6": "11... d5 earlier means that this is playable too, developing another piece for Black. Kh8 is clearly mate again from Bg7.",
        "14. Bxa8": "White chooses to grab another piece, putting him +11 up in material terms at this moment. White's King is in the middle of the board with little support and I think White underestimates how quickly Black can now mobilise for an attack on that King. Black has a forced mate in four here.",
        "14... Nxc2+": "I like this move a lot - many players will re-take a piece just because they assume they must. Black ignores the Bishop to mount an attack of his own.",
        "15. Ke2": "Only move as 15. Kf1 Qd1#. ",
        "15... Bc4+": "Black continues the attack, forcing the king towards the centre. His only flight square now is f3.",
        "16. Kf3 Qxf6+": "Black misses a forced mate in two here with 16... Qd1+ 17. Ne2 Qxe2#, but continues his attack with Qf6+ trying to close his pieces in around the White King.",
        "17. Bf4": "White blocks the check from the Queen with his bishop.",
        "17... Kh8": "Black releases the pin on the knight by moving the King - he chooses to ignore both the Bishop and Rook, threatening mate in one.",
        "18. Nd2": "White tries to develop, attacking the LSB... he misses Black's checkmate.",
        "18... Ne5#": "And in one swift Knight move, rekraparker gets an unexpected win even though he is down by a Rook, Bishop and pawn. I want to congratulate rekraparker on effort in this game, trying relentlessly, even when it looked like White had got well on top of him.\n\nThank you all for reading."
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=40674",
    "gameName": "Team match",
    "players": "jhjdj532 (1185) vs. rekraparker (1209)",
    "opening": "KP (C20), Patzer opening"
}