{
    "moves": {
        "1. d4 d5 2. c4 c6 3. Nf3 Nf6 4. Nc3 e6 5. e3": "White have to consider also Bg5, although that is the line that I usually use myself.",
        "5... Nbd7 6. Bd3 dxc4 7. Bxc4 b5 8. Bd3 a6": "So far all is theoretical.",
        "9. e4": "Is it a must now?\r\nUsually it is better to castle first. I think that it is not so bad, as the black king is not castled yet and white can attack in the middle.",
        "9... c5": "Black is not yet developed.",
        "10. e5": "It is too soon to break through. white had to castle first and move his rook to e1. if black would take on d4 than white should have taken with the knight and he controls the center well.",
        "10... cxd4 11. exf6 dxc3 12. fxg7 Bxg7 13. Qc2": "black is left with a pawn up in all the exchanges and he got the h8-a1 diagonal.",
        "13... Qa5": "wants to take on b2.",
        "14. O-O": "a must play move.",
        "14... Bb7": "black should have played here 14... Nc5 and I dont see how white avoid exchanging the bishop with the knight.",
        "15. Ng5 Rc8": "one would think that black has the advantage. by letting white to play Ng5 black is in defense and not attack. his kingside is very weak and wont last long in the batlle.",
        "16. Qe2": "the queen is now setting up the final attack.",
        "16... h6 17. Nxe6": "of course. black is falling apart.",
        "17... fxe6 18. Qxe6+ Kd8 19. Re1": "now we see how not organized are black pieces.",
        "19... cxb2 20. Bf4": "mate on e7...",
        "20... Rc6": "only move.",
        "21. Qe7+ Kc8 22. Bf5": "mate on d7...\r\nthe pair of bishops are working great together.",
        "22... Rd8": "only move.",
        "23. Rab1 Bf8 24. Bxd7+": "mate in 4.",
        "24... Rxd7 25. Qxf8+ Rd8 26. Qf5+ Rd7 27. Re8+": "pay attention to the final position. it looks like a problem solved."
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=23139",
    "gameName": "Team match",
    "players": "stylas (1675) vs. breizh2008 (1635)",
    "opening": "QGD Slav (D15), 4.Nc3"
}