{
    "moves": {
        "1. d4": "My standard.",
        "1... d5 2. Nf3 Nf6 3. h3": "? Very, very slow on my part. I have been playing around with variants of the QGD (my #1 weapon as white), and was curious to see where the game would go if black's light squared bishop could be restricted early on. This play was made strictly for it's educational value.",
        "3... Ne4": "Strong.......black nabs the first really good outpost of the game.",
        "4. Bf4": "While black has aggressively moved his knight twice already, white accelerates development.",
        "4... f6": "? Very suspect. Black has opted to bolster his perceived dominance of the center and the black squares, but this \"dominance\" is just an illusion. As a matter of fact, black has just destroyed his pawn chain on the kingside.",
        "5. e3": "Developing and preparing for 0-0.",
        "5... Nc6": "?! Yes, this move looks good - but perhaps 5...Be6 was better, as it could shore up the holes on the white squares around his king.",
        "6. Bb5": "Developmental tempo with a nice pin to boot.",
        "6... Bd7": "Interposing the pin and developing to a strong square.",
        "7. Nbd2": "Last piece developed. Time for white to begin coordinating his pieces for attack.",
        "7... e5": "?! .......and black now pries open the position. Take note of his pawn structure over the next several moves. It crumbles right before his eyes.",
        "8. dxe5 g5": "!Strong attempt. White finally sees the weaknesses around his king (or has he just been setting white up?), and lashes out. White must now deal with this distraction. Black has the opportunity to gather some time.",
        "9. Bxc6": "! White responds with a strong distraction of his own. White wants to lure his opponents light squared bishop further away from the e8-h5 diagonal.",
        "9... Bxc6": "Black regains his material, but this bishop is now on an awkward square.",
        "10. exf6": "!! This bishop sac is whole-heartedly sound. Just look at all of the weak squares around the black king. White sees a whole buffet of brutal checking combinations should black take the sacrifice.",
        "10... gxf4": "Black accepts the bait, and is brutalized for it. 10...Qxf was better.",
        "11. f7+": "! White forces black into making a very unpleasant decision -  evade the check or neutralize it. Run away from material equality or equalize now and hope to withstand the storm. ",
        "11... Kxf7": "Black chooses to equalize. Now, his problems are only beginning.",
        "12. Ne5+": "The obvious play. But more importantly, the white squares on the kingside are now open for business.",
        "12... Kg7": "? While 12...Ke7 would restrict the dark squared bishop, it could still get to the long diagonal. That was the play. Black just makes things easier for white.",
        "13. Nxe4": "First things first. White removes all impediments evenly vaguely close to the enemy king.",
        "13... dxe4": "Practically forced. Black now reluctantly invites an exchange of queens.",
        "14. Qg4+": "No way white accepts. Though down in material, white has great attacking chances.",
        "14... Kh6": "?? The worst possible move to make. 14...Kf6 was the only play.",
        "15. Nf7#": "!! .....and white delivers the knockout punch. An unusual gem of a final position. White delivers mate with a Royal Fork that hits an enemy rook as well. I hope you have enjoyed - Thomas"
    },
    "url": "https://gameknot.com/annotation.pl/team-match-w-royal-fork-mate?gm=4880",
    "gameName": "Team match w/Royal Fork mate",
    "players": "tag1153 (1455) vs. cosmichd (1442)",
    "opening": "Queen's pawn game (D02)"
}