{
    "moves": {
        "1. c4 e5": "The English Opening is tough for me to play against, because it requires a lot of patience which I sometimes lack, especially in correspondence games. Black usually can't afford to get aggressive early on but the answer 1...e5 is in my experience the best try to keep a dynamic flavour to the game.\n",
        "2. Nc3 Nf6 3. g3": "The usual White setup. The White bishop fianchetto is a strong weapon.\n",
        "3... d5": "The main move here together with 3...Bb4. True, it opens the White bishop diagonal, but gives Black more space in the centre and therefore possibilities for active piece play.\n",
        "4. cxd5 Nxd5 5. Bg2 Nb6": "This is the main move here, and unfortunately a necessary retreat. In fact, changing the Knight on c3 only strenghtens White's centre, while defending the Knight on d5 with 5...Be6 or 5. ..c6 allows White to strike in the centre with d2-d4. Now the Black Queen controls the d4 square, and at least Black has a bit more space than White.\n",
        "6. e4": "This is a strange move, not at all played by elite players. Usually white plays Nf3, 0-0, d3 and then decides his plan. But this doesn't mean that there is an easy confutation to this move. \n\nWhite has given the d4 square to the Black pieces, but he wants to prepare the d2-d4 advance and obtain a strong position in the centre. Black must react in the correct way and not allow White to push on d4. To do so, he has to keep control of the d4 square as much as he can.",
        "6... Nc6": "This was easy, Black develops and puts another piece on control of d4.\n",
        "7. Nf3 Be7": "The bishop could find a good square in c5 too, eyeing the d4 square, but I have another plan in mind.\n",
        "8. O-O Be6": "To prepare Qd8-d7 and 0-0-0.\n",
        "9. d3 g5": "This is a very strong move. Black is not starting an attack on the kingside: the move is purely positional. Black wants to chase the white Knight away from the control of d4, and the horse will be able only to retreat in the ugly square e1, because otherwihe the backward d3 pawn would fall. This g7-g5 isn't of course a new idea. Similar moves exist in the main line of this opening, but with the centre closed (pawns on e4 and e5) it is much stronger. I also had the pattern in mind because i had recently looked at a Carlsen-Nakamura game in a Sicilian Defence with more or less the same structure with \n1. e4 c5 2. Nf3 d6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 a6 6. Be2 e5 7. Nb3 Be7 8. Be3\n8. g4 etc. and it inspired me.",
        "10. a4": "It is clear that Black will castle queenside now, and this move rightly wants to provoke some weaknesses.\n",
        "10... g4 11. Ne1 a5": "Black can't allow the White pawn to a5. Now the b5 square is a bit weak, but the b4 square is weak, too.\n",
        "12. Be3 Qd7 13. Rc1 O-O-O": "Black has achieved his strategic goal. The d4 square is in his hand. I think he already has a slight advantage.",
        "14. Bxb6": "To create further weaknesses in Black's queenside, but with good play by Black (And if the black player is me anything can happen!) this shouldn't worry him. I wasn't worried.\n",
        "14... cxb6 15. Nb5": "Interesting move. I was expecting 15. Nd5 Kb8 [Forced] 16. Nxb6 Qd4 [And Black is fine.]\n",
        "15... Kb8": "To escape the pin of the White Rook on the Nc6.\n",
        "16. Qd2 h5": "I was very happy here with Black's position, and now I see that Fritz agrees with me. I played  h5 not to start an attack on the kingside (yet), but to stop any White couterplay at all.    Because here I thought that White has only two sources of counterplay, one of which is to break through in the kingside with f2-f4: if my pawn is on h5, I could play gxf3 en passant and then at some point attack the White king myself  with h5-h4. So I stopped f2-f4 once and for all. \n\n The other source of counterplay is the one that my opponent actually adopted, but since it involved material investment, I didn't consider it particularly dangerous...\n",
        "17. Qe3": "\n",
        "17... Bc5 18. Rxc5": "At this point this move was no surprise: there is no other way to disturb Black. Anyway, the sacrifice turns out stronger than I thought.\n",
        "18... bxc5 19. Qxc5 Qe7 20. Qb6": "Of cource White doesn't exchange queens.\n",
        "20... Rd7": "I played this to have the chance to play Qd8 if needed or bring into play the other Rook as well. Now that I can check Fritz I see he suggests 18...Bb3, probably to avoid Ne1-c2. I did not consider Ne1-c2 dangerous because I thought that I could play Bb3 *when* the White Knight goes to c2 and it will have to retreat or I can exchange it. But...\n",
        "21. Nc2 Bb3": "21... Rxd3 was a possibility, but I thought the move played was stronger simply because I hadn't considered White's reply!\n",
        "22. Na1": "This move came completely unexpected to me! Fritz says it's weak, but I couldn't find the right reaction. I only saw that after 22... Bxa4 23. Nc3 the Bishop seems trapped, but Fritz says that with 23...Rd4 everything is obviously under control and Black is winning.",
        "22... Be6": "\n",
        "23. Rc1": "Now all White pieces come into play and the situation is much more complicated, because I can't avoid anymore the White  sacrifice d3-d4 followed by e4 e5 and the White bishop comes into play.\n",
        "23... Ka8": "Forced because the threat was Rxc6\n",
        "24. d4 exd4": "It is all forced because every other move seems to lose material or worse.\n",
        "25. Rxc6": "The second exchange sac! But this time it is strong...\n",
        "25... bxc6 26. e5": "The tremendous bishop finally comes into play.\n",
        "26... Rc8": "Giving one exchange back for the strong bishop. But  even an exchange up, the White Knight going to d6 is even stronger than a rook. Luckily the other knight in a1 is useless for white.\n",
        "27. Bxc6+": "I was a bit relieved by this, actually. 27.Nd6 seemed even stronger to me.\n",
        "27... Rxc6 28. Qxc6+ Kb8 29. Nd6 Rc7 30. Qb6+": "Luckily seems that White has nothing better than a perpetual. If he tries something different it may backfire because Black has Rc1+ and the pawn on d4 can easily become strong.\n",
        "30... Ka8 31. Qxa5+ Kb8 32. Qb6+ Ka8 33. Nb3": "Last try for a win but I take it away from the board!\n",
        "33... Bxb3 34. Qa6+ Kb8 35. Qb6+ Ka8 36. Qa6+": "Alternative variation: 36. Qxb3 Qxe5 [and Black wins.]\n",
        "36... Kb8 37. Qb6+ Ka8": "I hope you enjoyed the game as much as I did! \nFeel free to leave your comment. Thank you."
    },
    "url": "https://gameknot.com/annotation.pl/team-match-http-gameknot-com?gm=57610",
    "gameName": "Team match, http://gameknot.com/",
    "players": "max181 (1996) vs. tartakow3r (1974)",
    "opening": "English (A22), Bremen, reverse dragon"
}