{
    "moves": {
        "1. e4": "Closed Sicilian, Lines without g3",
        "1... c5 2. Nc3 Nc6 3. f4 g6": "There are just 15 pawn structures that may arrise from common opennings. It is not many, I expected more combinations. I am learning the first one and books tell me to try to achieve f4-f5 and force black to exchange ... gxf5 followed by exf5. If the goal is achieved, white should be able to produce passer.  ",
        "4. Nf3 Bg7 5. Bb5 Qb6 6. Nd5": "I knew that black would not capture the bishop, but I tried it. [Computer: 5. Bb5 last book move]",
        "6... Qd8 7. O-O e6": "5. Nd5 is useless move and I have a problem... e6 prevents my long term plan. [Computer: 7. ... Nf6 8. Nxf6+ Bxf6 9. d3=]",
        "8. Nc3 Bxc3 9. dxc3": "Another problem, this time in my pawn formation. I need to get rid of double pawn. [Computer: 8. ... Nge7, 8. ... Bxc3? - interesting that double pawn is not problem]",
        "9... Nge7 10. Be3 b6 11. Qd2": "I went through games typical for this opening and pawn formation. Very common pattern is to attack with bishop supported by queen Bh6 or Bf6 together with Rf3-Rh3. [Computer: 11. f5!? gxf5 12. Ng5 h5+-]",
        "11... Bb7 12. b4 cxb4 13. cxb4": "Double pawn problem resolved. [Computer: 12. Rad1!? d5 13. exd5 Qxd5 +-]",
        "13... a6 14. Ba4 b5 15. Bb3": "New strategy: e6 pawn still prevents my plan f4-f5, but pawn formation a2,b4 and c2 can produce passer in end game, the only problem might be pawn d7. [Computer: 15. ... a5 16. a3 +-] ",
        "15... Qc7 16. Rac1 f6 17. c4 bxc4 18. Bxc4": "My intention was to pin Nc6 with 16. Rac1, but there is something more important.\nNow my position is better, pawns a2 and b4 can produce passer. I no longer care about d7, but it is weak, therefore I am going to test the pawn, first of all I want to prevent pawn movement. ",
        "18... Rc8 19. Bc5 Kf7 20. e5": "I made sure pawn cannot move. [Computer: 20. f5 Kg7 21. fxe6 dxe6 22. e5 Nxe5 23. Nxe5 Rhd8 24. Nd3 Qd7 25. Qb2 Nf5.... 20. f5 gxf5 is even worst for black]   ",
        "20... f5": "d5 and d6 is prevented by e5 and Bc5, pawn at d7 cannot move, the goal achieved, but my original strategic plan (f4-f5) is definitely gone. I also saw possibility of opening \"f\" file for my rook, this oportunity is also gone. [Computer: 20. ... fxe5]",
        "21. Rfd1": "I am just trying what happens without real plan.",
        "21... Rcd8 22. Qf2": "Threatening Bb6 [Computer: 22. Ng5+ and white can already relax]",
        "22... Qc8 23. Bb6 Rde8 24. Rxd7": "I focus primary on pawn formation, but I accept tactics, however I was not sure about the result: rook + bishop + (knight) against queen and pawns, black rook will be very passive anyway. [Computer: 23. ... h6 the only chance to get some counterplay] ",
        "24... Qxd7 25. Bxe6+ Qxe6 26. Ng5+ Kg8": "I made it, it is not always the case, many times oponent surprises. There is another plus: passer on e5.",
        "27. Nxe6 Nd5": "Now I need to simplify position by swaping pieces. ",
        "28. Nc7 Rd8 29. Nxd5 Rxd5 30. e6": "I no longer care about pawn formation, this another kind of end game, I need to avoid complications.",
        "30... Ne7 31. Qh4": "I was thinking of Bd4 instead of Qh4, but it looks that it no longer matters. On the other hand I am just 3 pawns ahead, but thanks to imprisoned Rh8, passer e6 and black king I am much more better.",
        "31... Nc8 32. Qf6 Nd6 33. e7 h5 34. Qxg6#": "It does not happen often to mate."
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=51409",
    "gameName": "Team match",
    "players": "ondrej (1678) vs. mircea_56 (1675)",
    "opening": "Sicilian (B23), Grand Prix attack, Schofman variation"
}