{
    "moves": {
        "1. e4": "White is opening with 1.e4, wich says a little bit about his style. Most e4-players like open, tactical positions..",
        "1... c6": "I'm heading for my normal response to 1.e4; the Caro-Kann.",
        "2. d4 d5 3. e5": "Ok, white chooses for the Advance-variation of the Caro-Kann. By advancing his e-pawn to e5, he's gaining space, and in meanwhile he's countering my development.",
        "3... Bf5": "First of all, my bishop needs to get out of the back rank. f5 is a good spot to take a rest.\nBy playing 3. ... Bf5, we're reaching the Short-variation in the Advanced Caro-Kann.",
        "4. Bd3 Bxd3 5. Qxd3": "All book-moves. These are \"natural\" opening-moves. We now see that white takes control of the most black squares in the center, and black controls the white center-fields. ",
        "5... e6": "By closing the pawn-chain, we now have a solid pawn-structure for black. ",
        "6. Nf3": "A normal developing move; white is preparing to castle kingside.",
        "6... Nd7": "I played this move to get a response ready for the case white plays Qb3, threatening to take my b-pawn. If white does that right now, I have the answer Qb6. After a possible exchange of queens, my knight would be nicely placed on b6.",
        "7. O-O": "Bringing his King to safety; normal procedure.. ",
        "7... h6": "Preparing the moves Ne7 going to Ng6. In this manner, the opponent can't play Bg5, pinning my knight in front of my Queen. ",
        "8. Bf4": "Well, maybe this wasn't the move I would play if I where white.. I'd rather go for a b3-c4 pawn-storm. ",
        "8... Ne7": "I'm leaving my options open.. This knight can go to g6, as well as f5 and c6 (once the c-pawn is advanced).",
        "9. c4": "Ok, white is trying to make some open lines. A good idea ! \nThe thing is, I can't let him play 10. c5, because my black bishop would be enclosed. ",
        "9... dxc4": "So, let's make some room for my pieces ! See how the important d5-squares is coming free ? That would be a nice outpost for my knight ! ",
        "10. Qxc4 Nb6": "Developing and attacking at the same time.. ",
        "11. Qb3": "White's plan is to create pressure on b7. But black isn't in a hurry, there's time to develop my pieces. ",
        "11... Ned5 12. Be3": "Must be played in order to save the bishop. If black plays 12. Be3 Nxe3 13. fxe3, white would've created an open line in front of his rook on f1. So I'm not going to do that, yet.. ",
        "12... Be7": "Developing to the only square that's possible at the moment, though it's a good position for that bishop ! ",
        "13. Nc3": "He's willing to do something on my d5-stronghold ! ",
        "13... Qc7": "Protecting b7 and giving my king the opportunity to castle wich side he wants; either kingside or queenside.. ",
        "14. Nxd5": "Just exchanging a piece; surely I recapture with my knight, because I won't let go that d5-spot..",
        "14... Nxd5 15. Rac1": "Taking care of a semi-open file.. Probably, his plan is going for a pawnstorm on the queenside.",
        "15... O-O": "So I decide to bring my King to safety. Next plan is to get some rooks on the c-file, followed by a c5-advance.",
        "16. a3": "He's starting to launch a queenside-pawnstorm..",
        "16... Rfc8": "That rook was misplaced near my king, so I bring it closer to the place of action.",
        "17. Ne1": "My opponent is making space, so he can play his f-pawn ahead.. ",
        "17... Qb6": "I wanted to trade the queens, so it would ease some tension off the board.",
        "18. Qxb6": "He accepts.. ",
        "18... axb6": "By taking with my a-pawn, I'm making an open a-file for my rook, and I could go for another trade; my knight for his bishop. The position is pretty open, so I think my bishop would be better than his remaining knight.",
        "19. Nd3": "A knight in the center is stronger than when he is on the border..",
        "19... Nxe3": "As said, a knight for a bishop..",
        "20. fxe3": "He now has a stronghold of pawns in the center, so I must be careful with those ! ",
        "20... c5": "So it's best to break it down. If 21. dxc5 bxc5, my pawns would become undoubled.\nIf, on the other hand, 21. d5 exd5, I would gain a superior position in the center, so he wouldn't play the latter.. ",
        "21. Nf4": "Something else ! With this, he surrenders me to do the choice.. Advancing my c-pawn, or take on d4 ? ",
        "21... cxd4": "Maybe this wasn't the best move.. But I wasn't looking forward to a position like 21. ... c4 22. d5. This would give him the initiative, either I played 22. ... exd5 or something else, but than I had to keep in mind 23. d6 would follow ! ",
        "22. exd4 Bg5": "The best move I could see at this moment. My bishop for his knight.. Afterwards, the rooks would have to take care of everything ! ",
        "23. g3": "Nice move ! If he would've played something else, I could play Bxf4, Rxf4 and Rxc1+ (bad idea for white). Also 23. ... Bxf4 24. Rxc8+ Rxc8 25. Rxf4 would be not so great for white, because black has the control of the c-file..",
        "23... Bxf4 24. gxf4": "Best move. White wants to hold control over the open c-file; so does black..",
        "24... Rc6": "The choice is left to my opponent. If 25. Rxc6 bxc6 26. Rc1 Rc8 and my pawns would become undoubled.. If he goes for 25. Rc3 Rxc3 26. bxc3 Rxa3 and I win a pawn.. ",
        "25. Rc3": "Second choice.. ",
        "25... Rxc3 26. bxc3 Rxa3 27. Rc1": "A logical move.. By now, he's willing to push that pawn forward. But first, his king has to get closer, to protect the d-pawn. But so is my king, towards the center !",
        "27... b5": "But first, I'm willing to take care of my doubled pawn. Surely I want to trade that one for his c-pawn.",
        "28. Rc2": "I don't really understand this move.. Probably, 28. Kf2 was better..",
        "28... Kh7": "Instead of going for the queenside, I'm heading for the kingside.. His f-pawn is a nice target. After white comes closer with his King, I can push my g- and h-pawn forward.",
        "29. Kf2 Kg6 30. Kf3": "We're both going for the f-pawn.. But he has to do something about his king, he's in the same line as my rook. So if I get the opportunity to push my b-pawn.. ?",
        "30... Kf5": "So I'm taking away a few key-squares. Both e4 and g4 are mine. My next move would be 31. ... b4, if he stays there with his king ! ",
        "31. h3": "Not the best move.. I don't know, maybe 31. Rb2 was better ? But that would result in 31. ... Rxc3+ and the hunting season starts ! ",
        "31... b4": "As promised.. ",
        "32. Rb2": "He notices the danger, but too late.. ",
        "32... Rxc3+": "Game over.. After 33. Ke2 (or another King-move) b3 34. Kd2 Rxh3 and the whole position collapses.. White's f-pawn is dead and I could eventually play Rh2+, trading off the rooks and promote with my kingside-pawns.. \nThanks Gensek8130 for the game ! "
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=52928",
    "gameName": "Team match",
    "players": "gensek8130 (1597) vs. taufiq (1649)",
    "opening": "Caro-Kann (B12), advance, Short variation"
}