{
    "moves": {
        "1. d4 d5": "This games starts out as a typical double Queen pawn opening.",
        "2. e4": "Blackmar Deimler Gambit. I decide to present an opening that has both risk and opportunity, offering chances for tactics.",
        "2... e6": "Black declines the gambit and makes clearance for developing the bishop. It appears to be a fairly solid approach to the opening.",
        "3. e5": "Transposing into a French Advanced position which will slow the g8 knight down by taking away the f6 square. Black suffers the usual problems inherent to the French, the bad bishop, and in this case the retarded knight.",
        "3... Nc6": "Black contemplates the followup attacking move of 4...Bb4+.",
        "4. Nc3": "Placed as a shield against the expected 4...Bb4+",
        "4... Bb4": "A pin is applied.",
        "5. f4": "White charges directly into an attack. There is a minimal threat of 5...Qh4+, but this is refuted by 6.g3 driving the queen back at the expense of a sound pawn structure.",
        "5... Nge7": "Black develops a piece as best able in the confined pawn structure.",
        "6. Nf3": "Continued development of pieces. The knight is developed with the idea of forming an attack on the kingside after the opponent has castled there.",
        "6... Bd7": "Black continues to develop pieces, not making the commital 0-0 and possibly hinting at 0-0-0.",
        "7. Bd2": "Improving the position by removing the pin on the knight and opening up the queenside more for a possible 0-0-0.",
        "7... Ng6": "The knight is developed out in an attempt to gain activity. This move causes the bishop at d2 to be pulling double duty protection of c3 and f4. The threat is 8...Bxc3 9. bxc3 which leaves the pawns in disarray. The bishop must maintain protection of f4.",
        "8. Bd3": "White continues to develop pieces. Both players have bad bishops, with black having the worse situation.",
        "8... Qe7": "Black appears to be looking at 0-0-0 and adds protection to the bishop at b4.",
        "9. f5": "White drops a flank pawn to gain a center pawn, as will be seen shortly.",
        "9... exf5 10. Nxd5": "A forking attack on queen and bishop.",
        "10... Bxd2+": "Black forces a reply.",
        "11. Qxd2 O-O": "Black while possibly seeing the fork threat of 12.Nxc7+, overlooks the threat to the queen by 12.Nxe7+ - the turning point of the game.",
        "12. Nxe7+": "White has a considerable material advantage and strives to apply the most direct technique for a win.",
        "12... Ncxe7 13. O-O-O": "With the idea of using both rooks to attack on the kingside.",
        "13... f4 14. h4": "With the idea of removing the defender of f4.",
        "14... Nf5": "Possibly wanting 15.Ne3 to post the knight, but the move is a tempo behind.",
        "15. Bxf5": "Applying the theory of exchanging while materially ahead and reducing the material on the kingside to clear a path to attack the king.",
        "15... Bxf5 16. h5 Ne7 17. Qxf4": "Gaining the pawn now that the knight has been driven back.",
        "17... Be6": "Attacking a2, but the threat is minimal due to 18...Bxa2 19.b3! and the bishop is lost after 20.Kb2 Bxb3 21.Kxb3.",
        "18. h6": "Attempting to crack open the castle.",
        "18... Nd5": "Forcing the queen away.",
        "19. Qd2": "The queen moves to a point of safety that also limits any knight moves to b4, e3 and f4, while also maintaining protection at h6.",
        "19... g6": "Black thwarts the pawn attack but inherits a weakness at g7.",
        "20. c4": "Driving back the pieces using pawns. The idea is to sweep the pieces away from the center using the strong mass of central pawns.",
        "20... Ne7 21. d5 Rad8": "A pin stops the rolling pawn advance.",
        "22. Qg5": "The queen begins manuevers to reach g7.",
        "22... Bc8 23. Qf6 Nf5": "Black drives a wedge into the attacking plan.",
        "24. Ng5": "With the idea of 25.Rd1-f1 followed by 26.Rxf5 to allow 27.Qg7#",
        "24... Rfe8": "Not the best move because it allows check.",
        "25. Qxf7+": "Now 25...Kh8 26.Qxh7# wins. (Obviously not 26.Qg7 now because of 26...Nxg7.)"
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=9129",
    "gameName": "Team match",
    "players": "chessknave (1498) vs. grabar (1483)",
    "opening": "Blackmar gambit (D00)"
}