{
    "moves": {
        "1. e4 e6 2. d4 d5 3. Nd2 Be7 4. Bd3 c5 5. c3 cxd4 6. cxd4 Nc6 7. Ngf3 dxe4 8. Nxe4 Nf6 9. Nc3 Nb4 10. Bb5+": "On the world database can be found only Bb1, with which white can eventually build up a king side attack. This is also preferred by SF5 (27/38), which considers Bb5+ inferior.",
        "10... Bd7 11. Bxd7+": "White move achieves one of most important goals for black in the french: to exchange the white squared bishop. Be2 was better.",
        "11... Nxd7": "SF5 prefers Qxd7 in order to mantain control of d5.",
        "12. O-O": "White should size the moment and play a3 to avoid black to blockade d5.",
        "12... O-O": "But black also misses the point. Better was Nb6 to respond Nd5 to a3 without having the knight exchanged.",
        "13. a3 Nd5 14. Re1": "White misses the importance of exchanging black's knight.",
        "14... Nd7b6": "Finally! Black recognizes the imporance of the d5 square.",
        "15. Qb3 Rc8 16. Nxd5": "Bad move. Every step to the endgame is a bad step for white, which will have difficulty defending Pd4. Better would have been Bd2 and after Nxc3 white have a weak pawn in c3.",
        "16... Qxd5 17. Qd3 Bf6 18. Ne5": "There is no justification anymore for Ne5. Be3 was passive, but better.",
        "18... Nc4": "Rfd8 was even faster.",
        "19. Nf3 Rfd8 20. b3 Nd6": "Both Na5 (with the idea Nc6) and Ne5 were better. Particularly interesting is the variant 20. ... Ne5 21. Nxe5 Bxe5 22. Be3 Bxd4 23. Bxd4 Qxd4 24. Qf3 Qd5 and now to avoid the activation of black rooks white is forced to exchange queens.",
        "21. Be3": "Bb2 was better, since e5 is not anymore possible since the rook is not blocked by Be3.",
        "21... Nf5": "Black misses e5 22. Qd1 e4 23. Ne5 Nb5 -+",
        "22. Rad1 Rc6 23. Rdc1 Nxd4": "The Pd4 is finally lost.",
        "24. Nxd4 Bxd4 25. Rcd1": "Allows exchange of queens. Better Rxc6",
        "25... Bxe3 26. Qxd5 Rxd5 27. fxe3 Rxd1 28. Rxd1 Kf8 29. Rd3": "The rook cannot move there.",
        "29... Ke7 30. Kf2 Rc2+ 31. Kf3 Rb2": "First of all white king's mobility must be limited: 31. ... f5 or 31. ... e5 were better.",
        "32. h3 e5 33. g4 Ke6 34. b4 Ra2 35. h4 h6 36. Ke4 g6": "Misses the tactical possibility 36. ... Rg2! 37. Kf3 e4 38. Kxe4 Rxg4+ 39. Kf3 Rxh4 -+",
        "37. Kf3 f5 38. gxf5+ gxf5 39. Kg3 Ra1 40. Kg2 b5": "b6 was more precise according to SF5, since it avoids counterplay based on Rc3",
        "41. Kg3 Rc1": "h5 was correct! Now a4 gives white a chance of counterplay!",
        "42. Kf2": "White misses his chance.",
        "42... Rc4 43. Kg3 h5 44. Kh3 f4": "Almost a blunder which can give white good defending chances. After 42. ... Rc2 or e4 white has no moves anymore. It must either leave the c file or the third row.",
        "45. exf4 exf4 46. Rf3": "The weakest. Better 46. Kg2 Rc2+ 47. Kf3 Ke5 48. Rd7 Rc3+ 49. Kg2 Rg3+ followed by Rxa3",
        "46... Kf5 47. Kg2": "Rb3 would have resisted some moves longer.",
        "47... Kg4": ""
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=55956",
    "gameName": "Team match",
    "players": "django42 (1896) vs. stefano80 (1841)",
    "opening": "French (C03), Tarrasch"
}