{
    "moves": {
        "1. e4 c5 2. d4 cxd4 3. Qxd4 Nc6 4. Qd1 Nf6 5. Nc3 g6 6. Be3 Bg7 7. Nf3 d6 8. Bc4 O-O": "I'm playing a very characteristic Sicilian Dragon opening.  Knights are all in the right spot, the c pawn is gone, the d and g pawns are in position, and the black bishop fianchettoed nicely.  I mostly got this from \"How to Think Ahead in Chess\".",
        "9. O-O Be6": "I was out of things to develop, and I wanted to open up the rook's file.  In this situation, white can choose between letting his white bishop run around and waste tempo, or he can just trade and double up pawns on the e file.  He chose to trade off.",
        "10. Bxe6 fxe6 11. a3": "To prevent Nb4",
        "11... Ng4 12. b4 Bxc3": "Oops.  It happens.",
        "13. Rb1 Nxe3 14. fxe3": "Since I'm ahead, trading off pieces and opening up lines (even for the opposition) makes sense.  Also, now he's got double isolated pawns.",
        "14... Rc8 15. Ng5": "Putting pressure on the doubled pawn.",
        "15... Ne5 16. Nxe6": "Forked like a rookie.  How disgraceful.",
        "16... Qb6 17. Qd5": "Preparing for a revealed check, but in my humble opinion taking the rook might have been wiser.",
        "17... Qxe3+ 18. Kh1 Rxf1+ 19. Rxf1": "Now I've gotten the rook out of danger and taken the pawn back, so the beautiful fork comes to nothing.",
        "19... Nf7 20. Ng5 Qxg5 21. Qxf7+ Kh8 22. Qe6 Rg8 23. Qc4 Be5 24. Qe2 Qh4 25. h3": "Saving himself from Qxh2 mate",
        "25... Qg3": "Threatening Qh2 mate",
        "26. Kg1 Qh2+ 27. Kf2 Rf8+ 28. Ke1 Qg3+ 29. Kd1 Rxf1+ 30. Qxf1": "Trading off.",
        "30... Kg7": "This attack just ran out of steam, but I've succeeded in trading off pieces while maintaining my advantage.",
        "31. Qe2 Qxa3 32. h4 Bc3 33. Qd3 Bxb4 34. Qd4+ e5": "Protecting with tempo",
        "35. Qd5 b6 36. Qb7+ Kh6 37. Qf7 Qe3 38. Qd5 Qe1#": "My bishop advantage proves enough for the checkmate."
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=16985",
    "gameName": "Team match",
    "players": "horseshoe (1377) vs. pretz (1410)",
    "opening": "Sicilian (B21), Andreaschek gambit"
}