{
    "moves": {
        "1. e4 e5 2. d4": "And again with the centre game. The only pieces that cannot move are the rooks, as both bishops and knights are free, along with the queen and king (not that I'd want to move the latter).",
        "2... h6 3. dxe5": "As he didn't capture my pawn, I capture his. There is the possibility of another pawn advancing, on either side of the king, turning this into some sort of gambit...",
        "3... Qe7 4. Nf3": "...but as the queen comes out, I cover the front pawn with my knight. Although the pawn won't stay defended forever, I can get ahead on development...",
        "4... d6 5. exd6": "...and indeed it is the queen's pawn that steps forward, so I capture it. It looks as though I am going to be pegged back again...",
        "5... Qxe4+": "...and indeed this is what happens. I have dropped one pawn, halving my advantage, and I'm about to drop another, to be back level again, but I know how to stop the queen...",
        "6. Qe2": "...and that is to put mine in between, as the kings are still in their starting positions, which pins the queens to them...",
        "6... Qxe2+ 7. Bxe2": "...and getting the queen trade gets my bishop out, and allows me to castle kingside. I now have two pieces off the bottom rank, although one is on the third, and the other on the second.",
        "7... Bxd6": "Not surprisingly, the bishop recaptures the pawn. My opponent needed to keep his pawns connected, and my dark-square bishop now has more limited choices...",
        "8. Nc3": "...so I bring out my other knight. I am hoping to advance it up the board by putting it back on its starting file by playing Nb5...",
        "8... Nf6": "...and he pulls back on development by bringing out another knight...",
        "9. Nd4": "...but I maybe advanced the wrong knight here. Nb5 may have been more forceful, as if the bishop moves away from the b8-h2 diagonal, with the exception of Bb4+, the pawn on c7 and the rook will disappear. Or 9... Ba3 would make the bishop disappear...",
        "9... O-O": "...and he castles kingside to bring a rook into play...",
        "10. Ncb5": "...and now I advance my other knight, doing the move I mentioned. Both are covered by each other, and the bishop only has one square to move to, if it does: e5...",
        "10... Na6": "...but as he moves out his other knight, onto the edge, trying to cover his pawn (which I am not trying to take, as it is defended by the bishop)...",
        "11. Nxd6 cxd6 12. Bxa6 bxa6": "...I do the double-exchange, capturing the bishop first, then the knight. I think this was a very good exchange: look at the queenside pawn formations: my pawns are side by side, all in their starting squares (a2, b2, c2), connected and strong and my opponent's are all over the place (a7, a6, d6), all isolated and weak, including doubled pawns in front of the rook. They will now become easy targets for my pieces...",
        "13. Bf4": "...and I develop my last piece to threaten the isolated pawn on d6...",
        "13... Bb7": "...but he fianchettos his bishop onto the long light diagonal to threaten my pawn on g2...",
        "14. f3": "...but because my g2-pawn was much stronger than his d6 one, I protect mine with its neighbour. 14. Bxd6 Bxg2  would have left me with a dilemma: would I play 15. Bxf8, with a probable Bxh1 response, then if it did happen, should I castle queenside such that 16... Rxf8 would be followed by 17. Rxh1? (The question mark is not for a questionable move, it's just a question I would have asked myself). Anyway, those pawns on f2 and h2 would have become isolated, but as it is, my kingside pawns remain strong.",
        "14... Rfe8+ 15. Kd2": "I could have blocked the check with my knight on e2, but my knight would have lost tempo. So I move up my king to connect my rooks, and as he cannot move onto the open e-file, I keep him close in case of a rook exchange...",
        "15... Rad8": "...and now there's no chance of me capturing the pawn on d6, now that the other rook is protecting it...",
        "16. Rae1": "...so I decide to contest the open file, hoping to seize control of it by exchanging...",
        "16... Rxe1 17. Rxe1": "...and I get the exchange. I think this was a pretty reasonable one for me: although we're level on material, I have control of the open file, and I could potentially gain more tempo...",
        "17... Nd5": "...but now my bishop is under attack. I had to think my next move through extremely carefully...",
        "18. Be3": "...and I pull my bishop back, so that if the knight captures, my rook gains some tempo.",
        "18... Rc8": "Now with the rook threatening my pawn on c2, should the knight land on b4, I'd lose a pawn...",
        "19. c3": "...so I restrain the latter by advancing the pawn the rook was threatening...",
        "19... a5": "...and now that the free doubled pawn has dropped its guard on the b5 square...",
        "20. Nb5": "...I place my knight there, threatening the isolated pawn on d6, as well as the one on a7...",
        "20... Re8": "...but as the rook moves onto the open e-file, no doubt hoping to capture my rook, to force me to capture back with my king...",
        "21. Nxd6": "...I capture the isolated pawn on d6, giving myself a passed pawn on c3, and forking the rook and bishop (notice that the knight now controls the e8 square)...",
        "21... Rb8": "...and as he moves his rook back to cover his bishop...",
        "22. Bxa7": "...I can capture a second isolated pawn. See how easily those two fell? Also notice that the rook now cannot leave its rank, and is under attack from the bishop, and mine, along with my knight controls the e8 square, so with the king also on the same rank as the rook, a rook exchange is on the cards...",
        "22... Ra8": "...but although the rook threatens the bishop, it's about to get a nasty surprise...",
        "23. Re8+": "...from mine. As the king and rook have both been forked by my rook, I will get the exchange I was seeking, being ahead on material...",
        "23... Kh7": "...but this was dubious. OK, the rook is defended by the bishop, but the knight is also threatening the pawn on f7...",
        "24. Rxa8 Bxa8 25. Nxf7": "...and not only do I get the rook exchange, I also steal the pawn. That pawn was stronger than the one on a5, but I go into the single-bishop (both queenside, as they're both on the opposite square shade) and single-knight endgame three pawns up (the equivalent of a bishop or knight).",
        "25... Kg6 26. Ne5+": "I decide the check is worth it, to force the king to move. I must bring my bishop back to help my knight, though...",
        "26... Kf5": "...as it is threatened by him...",
        "27. Bd4": "...so I retreat my bishop. His king cannot enter the following squares: g6, g4 or e4, whereas moving to f6 would result in a discovered check, and allow me to win the pawn on a5: Nc4/c6.",
        "27... Nf6": "Instead the knight moves onto the f6 square, no doubt hoping I'll move mine away, so I can trade it for my bishop. However, I have a different idea...",
        "28. g4+": "...and that's advance a pawn to distract the king. I have much more control of the square, with my pawn on f3, and my knight on e5, which also covers the f3 square, too...",
        "28... Kf4 29. Ke2": "...and now so does my king, should the bishop capture the pawn, the knight captures it back.",
        "29... Bd5 30. Ng6+": "I give the king the runaround again, giving him one available square...",
        "30... Kg5": "...and again he threatens my knight...",
        "31. Ne5": "...so I move it back to its previous square. Now the king only has two possible squares: f4 and h4, so I'm looking to close him down further...",
        "31... Kh4": "...and as he chose the square on the edge of the board...",
        "32. Bf2+": "...my bishop can box him in further. He can only move onto h3 (where I could then play Bg3 to protect the pawn, which would also protect the bishop in return), or g5 (where I could possibly play f4+, forcing Kxf4, then Bg3+), where I could save my knight.",
        "32... Kh3": "As the king chose to attack the pawn...",
        "33. Bg3": "...I can instantly save it. He can only move onto g2 now...",
        "33... Bxa2": "...but as the bishop captures my rook's pawn on the queenside...",
        "34. Kf2": "...I can block off the king's escape route, and threaten mate.",
        "34... Bd5 35. Nd3": "Why did I play my knight there instead of g6? I could possibly have mated in one move...",
        "35... g5": "...as the pawn has read the mate on f4...",
        "36. Kg1": "...so I move my king to threaten mate on f2...",
        "36... Nxg4": "...but the knight reads that too...",
        "37. fxg4": "...so I capture the knight...",
        "37... Kxg4": "...but lose the pawn. Once again, I have a three point advantage, but this time, I have an extra knight.",
        "38. Kf2": "I'm still trying to restrict the enemy king's movements, and I'm staying close to my bishop, should it be threatened by a pawn on h4...",
        "38... h5": "...and although the KRP advances to its 4th rank, not threatening it...",
        "39. Bc7": "...I threaten the queenside pawn, as it will soon disappear, (39... a4 40 Nc5 Bc6 then I move my king to help out)...",
        "39... a4": "...and the pawn moves, as I anticipated it would...",
        "40. Nc5": "...so I threaten it with my knight...",
        "40... Bc4": "...but the bishop fails to cover it...",
        "41. Nxa4": "...so I accept the pawn, making mine on b2 passed. I now have the option of trying to box the king in on his side of the board, or to use a queenside pawn to get a queen...",
        "41... Kh3": "...but why did he move his king there?",
        "42. b4": "I get a queenside pawn moving, just in case I drop my kingside pawn...",
        "42... g4": "...but what was he thinking, advancing his KNP? If he plays h4, then his king is really in trouble: all I need to do is manoeuvre my knight either to g1 or g5.",
        "43. Ke3": "I may have wasted a move here...",
        "43... h4": "...but was he boxing his king on purpose? I just need Kf2, then I can manoeuvre my knight to mate...",
        "44. Kf2": "...so I move my king, to block in the enemy. Now all I need to do is manoeuvre my knight to a square where it would check the king to mate, where if he plays g3+, I can play hxg3, and complete the obliteration of his pawns.",
        "44... Bb3": "Although the bishop threatens the knight...",
        "45. Nc5": "...I threaten it back...",
        "45... Bc4": "...and the bishop covers the d3 square...",
        "46. Ne4": "...so my knight closes in...",
        "46... Bd5": "...and although it is threatened again...",
        "47. Ng5#": "...it finishes the job. My opponent could have played g3+ on any of his 44th, 45th of 46th moves, then I would have responded by hxg3, and then I would have completed the obliteration of his pawns: hxg3+ would have been responded by Bxg3, anything else with gxh4, and I would have had to rely on my queenside pawns."
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=25702",
    "gameName": "Team match",
    "players": "aspiemikey (1416) vs. maxillo (1338)",
    "opening": "Centre game (C21)"
}