{
    "moves": {
        "1. e4": "sicilian again...it's all i do these days.",
        "1... c5 2. Qf3": "now i'm out of my element here.  so i'm just going to continue w/ d6.  perhaps Nc6 is best?",
        "2... d6 3. Bc4": "oldest mate attempt in the book.. as Jobe would say, common!",
        "3... Nf6 4. Nh3": "don't really know how to go about this.  we're about the same strength, yet white is making moves that conflict w/ what i understand as good opening principles.",
        "4... a6 5. d3 b5": "push the bishop, while giving my ability to fianchetto bishop",
        "6. Bd5": "why would white put his strongest bishop at risk as a move.  white could have played Bb3, no?",
        "6... Nxd5": "happily exchange here.",
        "7. exd5 Bb7": "done",
        "8. c4 bxc4": "i could have moved b4, but that would have closed off the game for my white-squared bishop.. looks like it may do that anyway.",
        "9. dxc4 g6": "dragon.. need my other bishop out",
        "10. Ng5": "i'm in trouble here if i don't be careful.  wasn't expecting that knight to come down... dang.\n",
        "10... f5": "safer... for now.  killed my dragon though",
        "11. Ne6 Qb6": "just want to get her out of there.",
        "12. O-O a5": "my thinking is that i'd like a spot for my knight to develop to, but would like to use the d7 square as an option for the king should i need it from attack",
        "13. b3 Na6 14. Nxf8 Rxf8": "happy with that exchange, i did not enjoy the threat of a safe knight near by.  was that a blunder on white's part?",
        "15. Bg5": "white continues w/ the pressure.",
        "15... Qc7": "protect the e7 square... he'll probably move rook or queen over.",
        "16. Re1 Rf7": "more e7 protection.  eventually, i want to push my e7 pawn to e5 for a good blockade.",
        "17. g4": "that doesn't threaten me, imo.  if gxf5 then Rxf5, and win tempo attacking queen.",
        "17... e5": "hopefully white moves dXe6, forgetting about my Bxf3 threat... but doubt that'll happen.  if not, i'm happy to block his rook out.",
        "18. gxf5 Rxf5": "just fine",
        "19. Qg3": "i'd like to win that bishop.  i'm going to try to pin the bishop at h4, or push him off so i can castle queen side.",
        "19... Qg7 20. Nd2 h6": "good.  let's see how this plays out.",
        "21. Be3 O-O-O": "i so badly want to play Rg5 to pin the queen.  need that bishop off that diagonal first.\nneed to protect my king, then Nb4, Nc2... and hopefully white doesn't move a single piece.  lol",
        "22. f4": "again, tempted with Rg5 I want to play exf4 to protect Rg5, but of course white will respond Bxf4.\n\ni'm not so sure I care about this move as white's clearly trying to protect from my rook with this move... which leads me to think white has no idea about what's to come.",
        "22... Nb4": "i am one move away from my trap.  only problem is that white should clearly see my next move as both rooks would be forked, not just the bishop with Nc2.  Hopefully, white does something like Rf1 instead of Rc1.\n\nIf white puts a rook on C1, i'm going to sac my bishop with Bxd5 eventually.  cxd5 then Nxd5 and his bishop has to flee or exchange.  If there's an exchange, Rg5... with a lot of assumptions.  pawn on f4 isn't there... and Rxe3 as the result of Nxe3.",
        "23. Ref1 Nc2": "white still needs to move fxe5 to make this ideal.  his next move should be Rc1.",
        "24. Rac1 Nxe3": "ah well... looks like Qxe3.  trap will be squashed.",
        "25. Rf3": "hmmm... does this make sense?",
        "25... exf4": "i will either capture a queen or a rook, i THINK.  not certain why white decided to give me material.",
        "26. Rxf4 Rg5": "i can't believe this occurred.",
        "27. Qxg5 hxg5": "i'm very excited that i was able to play this out.  i bet white's next move is Rf1.  wait, white's rook is under attack.  Rf3 is possible.  \n\ni see Qb2 as a next possible move for myself.  attacking rook, knight, and pawn.  i'd like to get my knight and bishop in the attack.\n\nQd4 is also nice.  Attacking their knight, or discovered check potential.  \n\nMy king is safe, but need to move Kb8 and allow my bishop out.",
        "28. Rf3 Qd4 29. Kh1 Qxd2": "it's going to be difficult for white to recover",
        "30. Ra1": "not certain what the plan here is.",
        "30... Qg2#": "any thoughts would be helpful.  thanks"
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=37041",
    "gameName": "Team match",
    "players": "fidelibus (1248) vs. unohuim (1292)",
    "opening": "Sicilian defence (B20)"
}