{
    "moves": {
        "1. e4 e5 2. f4 exf4": "Kings Gambit, accepted",
        "3. Nf3 Bc5": "and here we're done with my knowledge of theory",
        "4. d4 Bb6 5. Bxf4 d5": "White hunts the bishop and enables itself to retake the pawn on f4 (I'm pretty sure this has some name, I think I've seen this quite often).",
        "6. Nc3 Bg4": "Black decides to pin White's Knight and leaves the Pawn on D5 defended only by the Queen... so White decides to take it",
        "7. exd5 Ba5 8. Bb5+": "Now Black tries to pin the knight, such that the Queen can retake the pawn. White counters by a check on B5.",
        "8... c6": "The other option I saw for black was Nd7, which would also have saved the pawn",
        "9. dxc6 bxc6 10. Ba4 Bxc3+ 11. bxc3": "Black gives away the pair of bishops.",
        "11... Qa5 12. Qe2+": "White tries to build up some pressure",
        "12... Ne7 13. Bd6": "White builds up some pressure (mate on Qxe7) and wants to snatch of the knight",
        "13... O-O 14. Qxe7 Na6": "Black prevents a mate on Qxf8",
        "15. Bxc6": "A big blunder by white, a better option would have been 15. Bb3. Of course it could not have prevented the check on Qc3. I actually thought about castling short for a few moments... don't know why I didn't...\nPossible variation would then have been:\n15.Bb3 Qxc3+ 16.Kf2 Bxf3 17 xf3 Qxd4+ 18. Kg3 h6 And white would have a naked King, but the pair of Bishops and thereby a piece in advance (although a pawn less)",
        "15... Qxc3+ 16. Kf2 Qxc6": "What had to come...",
        "17. Ne5": "Trying to increase the pressure",
        "17... Qxc2+ 18. Kg3 Be6 19. Qb7": "Attacking the Knight and the Rook at once",
        "19... Qc3+ 20. Nf3 Qc8": "Defending the Knight by a counterattack",
        "21. Qb5 Rd8 22. Rhc1": "Starting again a counter attack and slowly starting to move into a bad position",
        "22... Qd7": "Up to this point an exchange could have been the startingpoint to an balanced endgame. Although white has an isolated pawn (which would get hard to defend)",
        "23. Rc6 Nb8 24. Ne5": "Again: attacking instead of defending, following a tactic, which has in this situation no hope for success",
        "24... Qe8 25. Bxb8 Raxb8 26. Qc5 f6": "The next blunder... I thought i Take the Bishop and then I'll have a forkat C6... but this fork is no real fork, sind black can escape while checking...",
        "27. Rxe6 Qxe6 28. Nc6 Qe3+": "and the ending starts...",
        "29. Kg4": "This was esspecially bad since it allows Qe2+ and then to save one Rook....",
        "29... Qe2+ 30. Kh3 Rb5": "What had to come... white begins to get desperate and takes a pawn... leaving the King defenceless",
        "31. Qxa7 Rh5+ 32. Kg3 Qe3+ 33. Kg4 Rg5+ 34. Kh4 Qf4+": "And I resigned, seeing the mate in one"
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=33302",
    "gameName": "Team match",
    "players": "bufferunderflow (1488) vs. e2toe4 (1490)",
    "opening": "King's knight's gambit (C34)"
}