{
    "moves": {
        "1. e4 c5 2. Nf3 Nc6": "The Sicilian Orthodox variation, one of the main alternatives to the Dragon",
        "3. Nc3": "A rarer move, more common is d4, Nc6 keeps the game closed, which is not a good idea against the Sicilian.",
        "3... e6": "Freeing the KB to protect the pawn on c5",
        "4. d4": "An important move against the sicilian, opening up the board, black must capture or white will gan ground in the centre",
        "4... Nf6": "A mistake, black should have captured when he had the chance, now d5 will wreak havoc in black's position",
        "5. d5 exd5 6. exd5 Qe7+": "The only way to save the Knight without retreating, black's queen is badly placed (it would be better on c7 or b6 to support a queenside counter attack) Black will continue to suffer for not capturing on d4",
        "7. Be3 Ne5 8. Nb5": "An odd attack that is easily refuted by a6",
        "8... d6": "Black's knight is a liability which he will be forced to defend, better would be Nxf3, attempting to open up the game to correct blacks earlier mistake",
        "9. Nxe5": "If Qxe5, then Nc7 !!, winning a rook, if dxc5 then black's pawn structure is ruined",
        "9... a6": "A good way to refute the attack, limiting white's attack on the vulnerable pawn on d6",
        "10. Nxf7": "White completely throws away his advantage, much better would be Nc4, axb5, Nb6, ontinuing to ruin black's position",
        "10... Qxf7 11. Nc3 Be7": "Preparing to castle",
        "12. Bc4 b5": "Finally begining his counter attack, white has lost his advantage, both sides are equal at this point.",
        "13. Be2 O-O 14. Bf3 Rb8": "A better move would have been Bc7, puuting pressure on the pawn and winning it after b4!",
        "15. a3 Bb7": "Begining the attack on the pawn, but too late, white can prevent b4! by playing B4 first",
        "16. b4 c4": "The point of the Sicilian is to counter attack on the queenside, this move shuts down blacks pawn advance, weakens his position, and strengthens white's e3 Bishop. Better would be Rc8, forcing white to defend his knight, followed by cxd4 and Rc4, continuing his attack",
        "17. O-O Bc8": "Here black beginings a desparate attack on white's king, which is easily refuted. Black has lost his ability to attack on the queenside and so turns to the kingside.",
        "18. a4": "Continuing to weaken black's queenside",
        "18... Qg6 19. axb5 axb5": "Opening up white's Rook rook ",
        "20. Qe2 Bh3": "Begining his kingside attack, which if countered correctly is easily refuted",
        "21. Ra5": "Winning a pawn",
        "21... Nh5": "This move does nothing to assist black's attack, white's king is solidly defended, blacks best bet would be to attack White's splintered queenside pawns with Bf5",
        "22. Nxb5": "White gets greedy, better would be Kh1 in order to win the Bishop",
        "22... Rf6": "Here was black's best chance to defeat white, and he missed it. Much better would be Rxf3! After Qxf3, Bg4! winning the Queen",
        "23. Kh1": "This accomplish's nothing, after Rxf3 white still cannot recapture with his pawn because Qg2#!",
        "23... Nf4": "Black once again misses his chance and offers a tradeoff which makes his Rf6 move even worse because now the rook will move again",
        "24. Bxf4 Rxf4 25. gxh3": "Black's attack is gone, he has lost his chances on the queenside and kingside, his board will now quickly fall apart",
        "25... Rxf3": "A useless sacrifice as the Bishop is no longer needed to defend g2",
        "26. Qxf3 Rf8 27. Qe2 Rf4 28. Qxe7 h6 29. Nxd6 Rf6 30. Rg1": "While both players made mistakes, his kingside attack would have not even had a possibility of working had white played correctly. Black lost this game because of one move. 4...Nf6?? The best lesson that can be learned from this game is; always study an opening before using it. Gameknot has an excellent databse available to all players, and it is not breaking any rules to view the database during a game, so use it if you are not sure what to play during the opening."
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=2674",
    "gameName": "Team match",
    "players": "mottistone (1379) vs. scaryfinger (1317)",
    "opening": "Sicilian defence (B30)"
}