{
    "moves": {
        "1. d4": "Standard.",
        "1... d5": "Also standard.",
        "2. c4": "Playing the QG, which I often play against it, when I play with Jack, but it's a QGD.  Even if not, I'd be used to it since I've played the QG on a couple of occassions.  However, I still like the KP opening the best and have had the best luck.  I guess, it's trial and error because when I've played 1.d4, they've responded not even with the Benoni, but rather KID after which, I have no idea what to do.",
        "2... e6": "QGD.",
        "3. Nc3": "Standard development.",
        "3... a6": "In general, you should develop your pieces before the wing's pawn, and with it, I believe that white, already has an advantage.",
        "4. cxd5 exd5 5. Nf3": "Continuing to develop.",
        "5... Nf6": "Same.",
        "6. Bg5": "Playing an effective pin, as I know from experience.",
        "6... Be6": "I don't understand why he didn't break.  I would've played 6...Be7, if I were black.",
        "7. e3": "Understandable.  It's development since it's a central.  Actually was thinking of 7.e4, which I thought was best but see it's a mistake, as it loses a pawn, and would lose an exchange which we don't since it would result in liquidation, so this is a good response.",
        "7... Bd6": "Still developing, but as noted, I would've played 7...Be7",
        "8. Bd3": "Preparing to castle.",
        "8... O-O": "Black does so first, but subsequently, this will be white's next move.",
        "9. O-O Nbd7": "Development, but I would've played 9...Nc6 since that N is said to be in an uncomfortable position, as it appears crammed.",
        "10. h3": "I don't know why he played this as the as his N on f6 was not a threat since it's pinned.  Plus, that pawn is right near the K, and generally, I hold off until later because maybe I misunderstood which frequently happens, but I seem to remember Jack telling that opening that pawn right around the K this early often leaves vulnerable to exposure, in the long run.  But, I also know that white has a plan behind it, and it'll be interesting to see that tactical motif, as that's often the plan.  In fact, tactical motifs, as I recently learned is more powerful then strategy.",
        "10... c6": "I don't know why he played this.",
        "11. Bf4": "I believe that the idea here is to exchange, as black's B is stronger.  The idea is get rid of the stronger bishop pair.  And, I disagree with what I was told in the past because I go solely by what I learn from Jack.  That since black's is on his color, his DSB, that's his dominant B.  Whereas, white's DSB is the weak B, since it's not on the color he's playing.  So, this is a good strategy.",
        "11... Qc7": "Not surprinsly, black declines.",
        "12. Qd2": "The idea is to connect the R's, and perhaps, double the up in the long run, or place that Q in front of the R, as that's a known strategy, which nowadays, I typically do.",
        "12... Rfe8": "To put pressure on the center.",
        "13. Rfe1": "Same idea.",
        "13... h6": "As noted earlier, there has to be a tactical motif, but I don't know what it is, yet.",
        "14. a3": "And, white has another tactical motif, in stock.",
        "14... c5": "I think the idea is to exchange, which is about to happen as white accepts, so we get a variety of exchanges, also known as an exchange variation.",
        "15. dxc5": "PXP",
        "15... Nxc5": "Black takes back.",
        "16. Bxd6": "Same.",
        "16... Qxd6": "Also, what you expect.",
        "17. Bc2": "And, is not going to allow an exchange here since this is his stronger B.",
        "17... Qb6": "The idea is to win a pawn.",
        "18. Ne2": "To prevent 18...Qxb2, as we're about to see.",
        "18... Rac8": "So, he dosen't.  But, this is where I ask myself if, \"To take is a mistake\" applies.  In this position, it is since white would immeidately win the Q by trapping it after 19.Reb1 so that it would have no place to go.  Beleive it or not, that's how I won a second game against Jack, but I consider to be a good win because in first one it wasn't good.  That was just luck which you can't go by.  After having had made a ton of blunders even after winning a R, he went to show me a move and what he could, but missed that the other was en-prise so I was able to take it, and once I did, he resigned.  But, in the second game, by thinking and planning ahead and not making mistakes, I was able to trap his Q.  I almost missed the move, and Jack wanted the game to end, and was thus, testing me to see if I found the right move, as you typically see with GM's.  But, this time, I passed his test with flying color and found the winning move.  He wasn't surprised but impressed that I found it.  After which, I also kept improving, unlike the first time where my rating was around 900.  But, that's also because that second win also happened to me after my epic and historic game against him, which I consider to be the most important game I've ever played as that's where I also learned how helpful chess in life.",
        "19. Rac1": "I believe it's to add a defender since there is pressure on the B.",
        "19... Rc7": "Not immediately, but the idea is to double up, I believe.",
        "20. Qb4": "Going for an exchange.",
        "20... Qd6": "But, black declines.",
        "21. Nfd4": "The idea is to be able to the E N in a more comfortable position, I believe.  In other words, so that's it's no longer restricted to the first two ranks.",
        "21... Bd7": "To prevent the exchange, though I don't know why since this is the weak B.  So, I would've allowed 22.NXB, in this position. ",
        "22. Red1": "Aligning the R's, but also rearanging them that the connection is on opposite.  This is good because one thing that Jack mentioned is that when connecting R's, you generally don't want them on the same color, since the opponent could fork both with his or her B, and since it is the LSB and the R's were on the white colors, that feability, in the long run, did exist.",
        "22... g6": "In the long run, white would eventually be able to safely play Bh7, as this was his intention.  But, this move prevents that.",
        "23. Nc3": "What I noted on the 21st move, as the N is now in a better place.",
        "23... Kg7": "Since this is not an endgame, the K is not a weapon, yet.  So, I don't know why black played this.",
        "24. Nde2": "I also don't know why white played this.",
        "24... Bc6": "To strengthen d and b files for the same reason that pawn chains are said to be good.  It's about giving support to the pawn which strenthens the structure around it.",
        "25. Nf4": "Now, the N's are well placed, and since we're in a closed position, a N are worth more then a B.",
        "25... Rcc8": "I would've played 25...Rec8 to double up.",
        "26. Qd4": "Putting further pressure on the center.",
        "26... Ne6": "To force an exchange which white accepts.",
        "27. Nxe6+": "As it increases his advantage.  Dishing in the check with a N is known to do so which was how we know it's a closed position, making the N extremely dangerous.",
        "27... Qxe6": "As Jack will sometimes say when I find the right move, \"Of course.\"",
        "28. Bb3": "Possibly, to strengthen his R's since now, the B is not around it.",
        "28... Qe5": "Going for the Q exchange.",
        "29. Qxe5": "This time, white accepts.",
        "29... Rxe5 30. Ne2": "I don't know why moved his N back to the second rank.",
        "30... Ree8": "I also don't know why this was played.",
        "31. h4": "Increasing the tactical motif, which I'm just beginning to understand.  Perhaps for that pawn structure, as he will play g3, later on.  The idea is that you advance, and have a plan, that often gives you a winning advantage, as I learned from WB, wrecking_ball in that video about pawn structures.",
        "31... h5": "The idea, of course, to prevent that.",
        "32. Nf4": "To add a reinforcer to the pawn since the N is closer, and as we know, right now a N is more dangerous then the B and the move also emphasized why we're in a closed position.",
        "32... Rcd8": "With the LSB, it's about bringing the R's on opposite colors, as noted earlier.",
        "33. g3": "As I alluded to on white's 31st move.",
        "33... Re7": "To double, and although it dosen't happen on the same file, it involves the same R, which by defintion is also what we allude to as doubling up since the R's are by side, but passed it's homesquares, as that's how the dangerous threats, generally, occur.",
        "34. Rd4": "White is also about to double up.",
        "34... Rdd7": "As noted on black's last move.",
        "35. Rcd1": "Same idea.",
        "35... Re4": "In an attempt to exchange R's.",
        "36. Rd4d3": "Whtie declines, however.",
        "36... Re5": "Don't understand why this was played.  I would've responded with 36...Rde7",
        "37. f3": "However, I know the plan here.  To strengthen pawn structures since it's about a pawn chain. ",
        "37... Rc7": "This time, I'll call it pointless since I don't know why he moved here.  I still would've played 37...Rde7",
        "38. Rc3": "To put pressure on the b file since you have a half pin on the B, as moving it would lose the R.",
        "38... Rd7": "He easily breaks, and in the way that I anticipated.",
        "39. Kf2": "Normally, as noted, wouldn't understand this move since we're not at the endgame, yet.  But, here the pawns need support, so the K adds the protection and pressure.",
        "39... Re8": "Normally, I'd also view it as pointless, but this time, I do see a point to defend against the pressure.  However, I'd still double up, in this position.",
        "40. Rd4": "Adding a defender to the N.",
        "40... Red8": "At last, he's doubled and with both on one file.",
        "41. Rcd3": "But, so is white.",
        "41... Rc8": "Just don't understand why a R keeps moving.",
        "42. Rd3d1": "Almost the same, but moving it back on it's homesquare while doubled is generally a good strategy and does damage.",
        "42... Rcd8": "Ok.",
        "43. Rd1d2": "Still keeping the pressure.",
        "43... Rc8": "Pointless.",
        "44. Ba2": "Adding pressure with the B.  Just don't know how, though, but we're soon to find out.",
        "44... Rcd8": "Still can't figure what's going on with the R's.",
        "45. Rd2d1": "Same.",
        "45... Rc8": "Therefore, this is also pointless since the we don't have doubled R's, and they keep moving on the same file.",
        "46. Rd1d3 Bb5": "Going for one of the R's.",
        "47. Rd3d2": "So, it needed protection.",
        "47... Bc6": "As noted earlier, the pawns are protected by the B.",
        "48. Bb3": "Don't know why he moved here.",
        "48... Kf8": "Moving the K back to it's homesquare.",
        "49. Rc2": "Putting pressure on the B.",
        "49... Rdc7": "49...Bb5 was also possible, but I like this better for the reasons noted earlier.",
        "50. Rc3": "Don't why the R moved to c3.  Instead, I would've placed on d3 and for the same reason.",
        "50... Kg7": "Moving the K back and forth.",
        "51. Rd1": "Also can't figure why he moved here.  The R was not in danger.",
        "51... Rd7": "Pointless, and I believe given that the R has moved in the same spot, that eventually, he is attempting a draw by three fold repetition in the long run.  But, white is not going to accept, yet.",
        "52. Rd2": "There are things that I can't figure out.",
        "52... Rcd8": "As the saying goes, \"same old, same old.\"",
        "53. Rcd3": "Nothing new here.",
        "53... Rc8": "Very complicated to understand.",
        "54. Rd2d1": "Same.",
        "54... Rcd8": "Also applies here.",
        "55. Rd3d4": "Ok.",
        "55... Kg8": "Going back to homesquare, like we saw before.",
        "56. Rd4d2": "Where we were before.",
        "56... Kg7": "Same thing could be said here.",
        "57. Rc2": "Still confused.",
        "57... Ng8": "And, now we start to see something.  However, I don't know why he black brought his N back to his homesquare.  It undevelops the N.  I would've played 57...Bb5",
        "58. Re2": "A little different then what we saw before but still don't know why the same R keeps moving.",
        "58... Nf6": "And, now, we're starting to see the N's getting reorganized and becoming even more powerful.",
        "59. Red2": "Back to square 1 again.",
        "59... Rc8": "Same for black.",
        "60. Ne2": "While it wouldn't appear so, the N is in a good spot and a good place to support the K and pawns around it.",
        "60... Bb5": "The idea is to force an exchange, espeically since the N's more powerful.",
        "61. Nc3": "For that very reason, white declines.  Plus, he wants an exchange.",
        "61... Bc6": "But, black avoids it.",
        "62. Rd2d4": "Like before, I don't why this was played.",
        "62... Rdc7": "Doubling up, but otherwise, the same.",
        "63. Ke2": "To strengthen the R because as, now, the K is next to it.",
        "63... Rd7": "Pointless.",
        "64. Ba2": "This time, I have to say pointless since the B was ok on b3, so I'm not sure why he moved it back to a2.",
        "64... Rcd8": "Same old, same old.",
        "65. g4": "Now, white does damage.  Yes, we do have a passed pawn on the e file, but now he's going for a second passed pawn, which is about to happen as black will not have pawn in front of white to interfere with a passage, thus, making it a passed pawn.",
        "65... hxg4": "As I thought, and with it, white has a second passed pawn, and as we know, passed pawns are very dangerous.  So, even though, material is even, it is now safe to say that white has a winning advantage, in this position. ",
        "66. fxg4 Re7": "So, this is pointless.  Instead, I would've played 66...Kh6 to make the K a powerful weapon, as it would support the g pawn, against his h pawn, since that passed pawn is more dangerous then the e pawn.  And, with it, I now know the tactical motif behind 10.h3?!  As it turns out, the idea behind it, the entire time, was to get a dangerous pawn, which is virtually unstoppable, at that.",
        "67. g5": "Therefore, I like this move.  And, once the N moves, he can do further damage to increase his advantage.  With it, I think it goes from a winning advantage to the fact that he is going to win.",
        "67... Nh5": "The only other options involved bringing the N back to it's homesquare, so on the 8th rank.  But, that would interefere with the connection of his R's.  So, this was best.",
        "68. Kf2": "But, I don't understand why he moved his K away from the d1 R.",
        "68... Rf8": "? Despite the fact that white was winning, this is black's first mistake.  The move loses a pawn.  As chesskingdom64 would put it, \"Almost any move was better then this.\"  That's because the R would've kept the pawn safe.  In fact, best was 68...Red7 to keep add another defender to the pawn, so that there be room to play this move.",
        "69. Nxd5 Re5": "Wants the N, in exchange.",
        "70. Nf4": "Not surprisingly, white does not allow it.",
        "70... Nxf4": "?! This time, not dubious, but an inaccuracy, as he's exchanging N for B when down a pawn, which is liquidation.  The idea is that there nothing wrong with exchanging pawns if, but when behind, you don't want to exchange pieces.  The way to remember is what elyhim said back in the Caro Kann Challenge.  \"Exchange pawns, not pieces\", as the rule of thumb.",
        "71. exf4 Re7": "At least, it keeps the R safe.",
        "72. Re1": "Since he's ahead, white wants to exchange.",
        "72... Rxe1": "?! But, black makes an inaccuracy by accepting it, for the reason outlined earlier.",
        "73. Kxe1 Re8+": "So, now comes pressure with a check.  However, this is just a nuicanse as white can do a lot about it.",
        "74. Kd2": "This is an example.",
        "74... Rh8": "Going for whites h file, especially since this is the dangerous passed pawn.  Unfortunately, there is nothing that white can do about it, this time which proves that I was right earlier as someone implied that passed pawns could never be stopped, but I always knew better from a different commentator earlier.  And, this is an example, which shows that even the most dangerous passed pawns, by defintion can be stopped.",
        "75. Rd6": "So, white prepared by putting pressure on the sixth rank.",
        "75... Rxh4": "Once again, white's dangerous passed pawn is gone, and he's going after another pawn.",
        "76. Rf6": "But, white stops it cold, whilst, putting pressure on black's K.",
        "76... Be8": "In anticpation and to do something about the pressure white has, he plays this which adds support and protection to the f pawn.  While not immeidately in danger, it was something that was bound to happen.",
        "77. Bd5": "And, now with the the threat on the b pawn.",
        "77... b5": "The obvious response.",
        "78. Ke1": "I don't why he moved his K back.",
        "78... a5": "Trying to strengthen his pawn structure of it's own accord.  However, this does the opposite as it breaks up the pawn chain and makes it difficult to near impossible to get another due to white's pawn chain on the same files, and now, close to the same rank.",
        "79. Kf2": "Still don't know why he played this.",
        "79... Rh3": "Almost pointless, but if he wanted to put pressure on the K, I understand.  However, best was 79...Rh2+, which would a pawn for when white gets out, black would have 80...Rxb2  So, I would've played 79...Rh2+, if I were black.",
        "80. Bf3": "I believe, to keep his pawn chains strong.",
        "80... Bd7": "To support black's R since the B adds protection as they're adjacent to the same file.  Meaning, run along the same lines, as the B covers 6 squares from c8 to h3, and with the R on h3, this works very well.  Remember, another important concept as easy19 told me earlier is to count how many squares your B covers.  Now, I had trouble remembering and never thought it was important, especially after what WB taught which was theory and then the 7 point checklist, as you learned from GM Kasporov because archduke_piccolo covered it in the consultation thread for the group he mentored in the WTWLTR club.  And, it was also soemthing that elyhim emphasized, so I studied that.  But, then I spoke to WB, and he said how many squares the B covers is also a very important part of theory.  The reason it was never covered is that it's much more basic, and because his club was, The Deeper Chess Theory Club, he was going over things much more advanced.  But, he recommended that I go over the basic parts despite the disagreement with easy19 so I went back, and it finally makes sense.  It goes by which square those B covers.  The max you'd see is after a fianchetto where you put it on the longest diagnol, and then it would cover 8 squares.  But, I realize now from experience, that it espeically matters in end games.  That's one thing I kept in mind in my last game against Ted and won with the last move being mate, and I kept in mind how many squares my DSB covered.",
        "81. Kg2": "The idea is that, now, the K is a weapon since we're in an endgame.  And, now, it is doing a lot of damage.",
        "81... Rh4 82. Bd5": "And, afterwards, this is where things heat up.  Black's f pawn is in danger so now it will be difficult to defend.",
        "82... Be6": "The only move, as anything else loses the B.  Instead, it will become an exchange.",
        "83. Bxe6 fxe6": "But, white can still win a pawn.",
        "84. Kg3": "The idea is to make the K a more powerful.  However, I would've immediately played 84.Rxe6 to win the e pawn, but this option is still avaliable.",
        "84... Rh1": "I would've played 84...Rh8 and worth noting that not only is the R safe, but like this move, it dosen't compromise his mobility, and as we know mobility is the most important aspect of chess.",
        "85. Rxe6": "As noted, white now has a free pawn.  And, with it, while not immidetialy, it is a guaranteed win for him.",
        "85... Rb1": "He wants the b pawn, and pressure on that file.",
        "86. Re7+": "But, white has other ideas.",
        "86... Kg8": "Obviously.",
        "87. Re2": "To protect the b pawn.",
        "87... b4": "Going for a pawn exchange.",
        "88. axb4": "And, white accepts.",
        "88... axb4 89. Kf3": "I would've played 89.Kg4 to support the pawns.  Worth noting is that more often then not, one of the main things that makes the K dangerous in the endgame, is when it goes in between those pawns as that's where it does a lot of damage, in part, by strengthening the pawn chain.  However, this move is better because of what's about to unfold.",
        "89... Kf7": "No longer pointless because, like white his K is also a weapon.  And, with this move, black now has the opposition which is important.",
        "90. Ke4": "Continuting to strengthen the K.  I now understand why he didn't play Kg4, and I actually I like this position much better, believe it or not.",
        "90... Ke6": "Maintaining the opposition.",
        "91. f5+": "But, he missed this check which happens to be very nasty.  As HW, Jack has made me study these kinds of position and tested me to see what the best move, which I failed multiple times.  I didn't pass, but I finally had the solution.  The solution (answer) is putting your opponent in check with the pawn, as we see here, leaving the K aside.  This is the perfect example, as I don't how to explain it well.  So looking at this particular position, the K is on e4, with the pawn right next to it on f5 checking the K on e6 so the idea then is that the P+K work right next to one another, so that you place him or her in check with that pawn.  At the time, however, I didn't pass any tests, until I did the one thing that I emphasize to students.  It's using the analyze the board, and when I take various quizzes, I apply the same concept.  And, sometimes if I've missed things outside of GK, I will put the position on practice and then study, as it still qualifies as Analyze the Board.  And, nowadays I apply the same concept of what you see in Analyze just by looking and seeing all threats because analyzing is something else that the Mater implies by, \"Be a spectator\"  That's because in order to see everything on the board, as opposed to one or two things, you really have to analyze which is why it is a very good feature to get used to.  ",
        "91... gxf5+": "Normally, this would be ideal because of what I noted earlier, but white has a plan that black overlooked which will leave him in worse shape because it loses another pawn.",
        "92. Kf4+": "The discovered check.",
        "92... Kf7": "He also could've played 92...Kd5 or 92...Kd6, but with this move, white regains the opposition.  ",
        "93. Kxf5": "But, as I was alluding to earlier, no matter how black got out, the check was serious, as white was going to play this, one way or another.",
        "93... Rf1+": "You might as well just place white in check.  As Jack once said right before I mated him, and he took the piece, he said, \"I might as well take since I have nothing else to do.\"  This was true because, no matter what else he did, I had a mate in one, anyway.  Well even though there's no mate in one and he didn't take, the same thing applies here since white has a win here.",
        "94. Ke5": "94.Ke4 was also an option.",
        "94... Rg1": "Going for the pawn.  Normally, there wouldn't be much meaning as a move would be played for an attack, but not in this position.  Since white has a win, black's getting aggressive.  And, unlike what happened in the WTWLTR club, now it is safe to have that defeasitic attitude.  This works, as long as, there's no immediate, as that's when you would have to think defensive, as opposed to, aggressive.  But, there's no immediate danger, you might as well do anything to stay in.  It's better then getting nervous which is something I also used to do, which is where the Fight or Flight syndrome, as I talked about, kicks in.  Instead, black's confidence is increasing that is going to help him, even in a situation like this.  As a matter of fact, there was a time where I was even more lost then what happened in my first game ubermensch.  It happened against Jack, which is why I keep boasting despite stronger players playing me to see how well I'll do.  It holds me back shortly but not for long.  But, in a game against Jack, which I've mentioned, and as we know his real rating is 1800, I've blundered way earlier with a worse mistake and was, thus, hopelessly lost.  However, I was able to afford to think aggressively, as there wasn't an immeidate danger.  Doing this helped me gain confidence, which in turn, helped me pull a swindle and win in what was a hopelessly lost game.  Note: I do get this idea of boasting from WB, so it's not going to stop, especially since I've hit my strongest rating.  The idea, however, is that no matter how bad the sitution, not only don't you give up, but you don't get nervous or let the Fight or Flight kick in.  Instead, you maintain confidence and focus on how to get out of trouble, which is also why Jack Stockel is the best coach, ever, since when I was still having and with little to no help, it's something he emphasized, and by remembering I've played better, and it has helped to succeed in life, as well.  So, this lesson about confidence and optimisim is something I emphasize to my students.  And, the way to remember this, which is very important, is that in life there are obstacles.  Knowing how to overcome those obstacles is a way to acheive your goals.  That's my model.",
        "95. Rf2+": "Of course, white has a plan.",
        "95... Kg7": "Better was 95...Kg6, putting pressure right on the pawn, and with the R on g1 he gets some counterplay, as now white would face a threat.  I know because this is another position that Jack made me study.",
        "96. Kd5": "Making the K more dangerous, and now white has another threat.  It's against the g pawn.  However, I would've played 96.Kf5 to prevent black's next move.",
        "96... Rxg5+ 97. Kc4": "But, now the threat has increased.  I know what it is.  Right now, white's passed pawns are gone, but it is even.  However, the idea is that if and when he can take, white will, at once, have a passed pawn that can't be stopped, which is also another important tactical motif because in order to promote, you need an unstoppable passed pawn.",
        "97... Rg4+": "Obviously.",
        "98. Kb5": "Not surprisingly, whtie has other ideas, and this is the move that I anticipated.",
        "98... Kg6": "To strengthen that K.  However, I would've stopped the pawn cold with 98...b3, in this position.",
        "99. b3": "This is why.",
        "99... Rh4": "Pointless.  Instead, I would've played 99...Kh5 for the reasons outlined earlier, but this time, black would gain the opposition as he would get the K opposite one another, first.",
        "100. Ka5": "Planning to win the pawn.  It is, however, a compicated tactical motif, which most of them are.",
        "100... Re4": "I don't know why he played this.",
        "101. Rf8": "I would've played 101.Ra2, with the idea 102.Ra2, and subsequently, 103.Rxb4",
        "101... Rh4": "The idea is to be able to bring the K right to the R, making it more powerful.  But, it's too little, too late because of what white does.",
        "102. Rb8": "This is why, and it has the same effect that 101.Ra2 would've had, as we're about to see. ",
        "102... Rh5+": "Like I said before, you might as well place black in check because white was going to win the remaining pawn.  And, with it white has an unstoppable passed pawn.  As we know, one pawn often makes a difference between a win and loss.  And, this game is a perfect example.",
        "103. Kxb4 Kf7": "I would've played 103...Rh4+, in an attempt to get a draw by repetition.  That K would've moved back a few times.  However, I don't think that white would've allowed it, anyway because let's say 103...Rh4+, 104.Kc3, Rh3+ 105.Kb4, Rh4+, now white has, say 106.Kb5 which would've prevented the draw.  Nontheless, however, I believe it was worth trying.",
        "104. Rc8": "But, now, white has a lot of overwhelming advantage and an undisputed passed pawn which will promote.  With it, black resigns.  This game emphasizes that one pawn will often make or break a game, so they should not be underestimated as pawns are more powerful as they appear.  Remember: In the end, there are generally a few pawns left, and it shows that it only takes one to do the damage.  That's why, \"Don't give things away\", is very important.    "
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=57404",
    "gameName": "Team match",
    "players": "geniusacamel (2411) vs. slobodanmijic (2422)",
    "opening": "QGD (D31), Janowski variation"
}