{
    "moves": {
        "1. Nf3": "This game shows lots of principles in action I've been teaching my students recently. No real mating threats or strong combinations -- but a game decided by who controls the initiative.",
        "1... Nf6 2. g3 d5 3. Bg2 c6 4. d3 Bg4 5. Nbd2 Nbd7 6. O-O e6 7. e4": "This is all standard stuff so far.",
        "7... dxe4": "This is just my impression, but it seems like the stronger players I face like to trade here and convert this to an open game. It used to be that I was playing e5 more often and seeing a closed game when I was lower rated, and doing better. But maybe it's just me; maybe I do better in closed games.",
        "8. dxe4 Bc5 9. Re1 Qb6": "A simple threat to play Bxf2+, but it's still effective and has to be dealt with.\nFortunate, Qe2 is a common move here anyway.",
        "10. Qe2 Ne5 11. h3": "I need to get rid of that pin.",
        "11... Nxf3+ 12. Bxf3": "I've never recaptured with the bishop before. Usually, I take with the knight so it can just take the place of the captured piece. Plus, that lets the QB into the game. \n \nSo why did I use the bishop? I got tired of dealing with the pin. And I was wondering how I could get some initiative if I used the knight. \n  - My queen would still need to stay on e2 or f1 to guard the pawn on f2.\n  - If the queen's on e2, then the knight's still pinned.\n  - My queen and rook are guarding another pawn on e4.\n  - I can't play Be3 to block his threats without losing the pawn on e4 (and opening up difficulties with Qxb2).\nSo I decided to use the bishop. I wondered if he would play Bxh3. I'll play g4 and end up trading two pawns for the bishop, but my king would be wide open. Fortunately, his queen's on the other side of the board.",
        "12... Bxf3 13. Qxf3 Nd7": "I figure his knight's going for a good spot on e5. I feel like I'm reacting to him instead of having any initiative, and I've got to turn that around. I'm tempted to play Nc4. It protects e5 and the pawn on b2 and attacks the queen, but after Qb4 attacks the knight and rook, I've got to play Qc3, and a trade would give me real bad pawns. So I decided to let him have e5 and, instead, protect my b-pawn a different way and maybe trade off that bishop that's giving me problems.",
        "14. Nb3 Ne5 15. Qe2": "He's got way too many threats. The queen has to keep his knight off of f3. I can't move over to c3 because he gets to play Bb4 and win the rook. ",
        "15... O-O 16. Rd1": "I thought hard about taking that bishop. When you're under attack, you want to trade off pieces. But I decided it was more important to grab the open file. Also, now my rook can't get caught in a fork on f3.",
        "16... Rfd8 17. Bf4": "No way will I just trade and let him control the d-file. With my knight blocking his queen, I can get my bishop out and get his knight off of that good square.",
        "17... Ng6": "I'd prefer to hold on to a bishop.",
        "18. Bg5 Be7": "I joked that he got impatient, waiting for me to take his bishop with my knight, so he finally moved away. Now I'm feeling better; his last two moves have been retreats, and I know how to make it three in a row.",
        "19. Be3 Qc7": "I can finally start to attack, now.",
        "20. Rxd8+ Rxd8 21. Bxa7 b6": "I'm not planning to get my bishop trapped down there.",
        "22. Qa6 b5 23. Bb6": "I'm a pawn ahead. When you're ahead, it's a good idea to trade off pieces (unless you're busy attacking).",
        "23... Qc8 24. Qxc8 Rxc8 25. a4": "This looks like the best way to get my rook into the game.\nI just taught my students last night that you want to move the unopposed pawn to create a breakthrough. In this case, I figured that he couldn't afford to let it become a passed pawn.",
        "25... bxa4 26. Rxa4 Rb8 27. Ra6": "I like that. I guards the bishop, of course. It also will let my knight move without risking Rxb2. And, when the bishop moves, I'll have a discovered attack on his pawn with the rook (if my knight isn't able to take it first).",
        "27... h5 28. Na5 Rc8 29. Be3": "I also thought of moving it to d4 to keep his knight from coming to e5. But that would've given him a free move by attacking the bishop with a pawn, and I'd have to move it to e3 anyway.",
        "29... Ne5": "Maybe the pawn's better off on c5.\nThis move's just going to lose another pawn.",
        "30. f4": "I didn't expect his last move, but this is what I was planning to do to keep his knight off of e5.",
        "30... Ng6": "He doesn't have a good place for that knight. After Nf3+, I can trap it after Kf2. But it's going to be several moves before that knight's a factor again.",
        "31. Nxc6": "I thought about trading with the rook, but I was worried that he would play Ra8 and get my open file. What I like about this is his rook can't go to a8, b8, c8, or d8 -- and he can't chase away my knight with his bishop!",
        "31... f5 32. e5": "I don't want to open up any new lines that he might be able to use.",
        "32... h4": "That's a challenging move. ",
        "33. g4": "I knew that I didn't want to take the pawn. I end up with an isolated rook's pawn on the same side of the board as his king, so I didn't see any value in that. And I really didn't want to let him recapture with his knight (or bishop that goes to g3). And I figure that I can block his h-pawn with my king, so it doesn't feel like a bad threat yet. And I made this move the same night that I taught a lesson about passed pawns and how especially strong connected passed pawns are.  So it's an easy decision to play g4 here.",
        "33... fxg4 34. hxg4 Bf8 35. c3": "I'm thinking of moving my knight to d4 soon, so I plan to play b4 and Bd2 before I do.",
        "35... Kf7 36. b4 Ne7 37. Nd4": "Bad, bad, bad move. \nThis is the second time in a team game where I've had my moves planned out and then I made a move out-of-order. The last time I did it, I had to immediately ask for a draw (and I think he pitied me and gave it to me). This time, maybe I'm far enough ahead that I can still win ... but it'll take lots more work.",
        "37... Rxc3": "Time to regroup. All of the plans I had are kind of shot.",
        "38. Bf2": "Suddenly, that pawn feels more dangerous. I don't think I can keep my b-pawn, so I want this in a trade.",
        "38... Nd5": "That's another strong move. As I said, I've already written off the b-pawn mentally, so I want to hold on to the others.",
        "39. Nxe6 Be7": "He saw my threat.\nAfter Nxb4, I play 40. Ng5+. He has to retreat the king, and I play Ra8+ to get the rook away from the knight and then Bxh4, leaving me with 3 pawns to his 1.",
        "40. Ng5+": "But then I realized that he didn't stop Ng5+ -- there are some other threats in there.",
        "40... Bxg5 41. fxg5 Ne3": "I'm not sure why he didn't play Nxb4. Maybe he's hoping he can check me on c1 and eventually win my bishop. I plotted out the course after \n45. Bxe3   Rxe3\n46. e6+    Rxe6\n47 Rxe6    Kxe6\nseveral times.\nIt looks like I can get his last two kingside pawns while he chases down the b-pawn, and I can queen a pawn, but maybe he plays 46.  ... Ke7 to just block that pawn instead of capturing it. I think I can do it, but then I found an easier way.",
        "42. g6+": "That's the key move. It opens up the h4-d8 line.",
        "42... Kf8": "I imagine he didn't want to play Ke2 so he wouldn't be in check on the next move, but his king's in more trouble now.",
        "43. Bxh4": "Threatening Ra8#",
        "43... Rc1+ 44. Kh2 Nxg4+ 45. Kh3": "And now Black realizes that he has no way to stop the checkmate."
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=23203",
    "gameName": "Team match",
    "players": "chuckbo (1904) vs. wwwdotcom (1867)",
    "opening": "Reti (A05), King's Indian attack, Spassky's variation"
}