{
    "moves": {
        "1. d4 d5 2. e3": "Queen's Pawn, Stonewall Attack.  Black does well with Nf6 or Bf5.",
        "2... h5": "H5 is unusual, but black does well with this too, in he database.\n",
        "3. Bd3 Bg4": "Nc6 and B6 have been played with good success.  This move is off book and easily countered.\n",
        "4. Be2 f5": "Oops.  Nowhere left for the bishop to fall back.",
        "5. f4": "F3 instead would trap the black bishop.",
        "5... Qd6 6. h3": "Pretty much forces the bishop exchange.\n",
        "6... Bxe2 7. Nxe2 Qb4+ 8. c3 Qc4 9. b3 Qc6 10. Ba3 Nd7 11. Nd2 Qa6 12. c4": "Ba3 is undefended, and a tasty morsel for the black queen.",
        "12... c6 13. c5": "Ba3.  Ba3!  QxBa3 for free.",
        "13... b6 14. Bb4 Qb5 15. a3 a5 16. Bc3 Qd3 17. cxb6 Nxb6 18. O-O": "I'm thinking Qxc3+.\n",
        "18... Qxc3": "Not a free bishop, because NxQc3.\n",
        "19. Nxc3 e6 20. Nf3 h4 21. Ng5 Ke7 22. Qe1 Kf6": "?  Black would do better developing the king side knight and bishop.\n",
        "23. Nxe6": "?  KxNe6 for free.  Kings can take pieces.",
        "23... Kxe6 24. g3 Be7 25. Ra2 Nf6 26. Rf3 a4 27. b4 Nc4 28. b5 c5 29. dxc5 Bxc5 30. Kg2 Bxa3 31. Qf2 Bc1 32. Rc2 Ba3 33. Ra2 Ne4 34. Qc2 hxg3 35. Qb1": "Ouch.  Nd2 forks the queen and f rook.  Either black knight, but Ned2 is clearly the superior choice, as the c knight guards the black bishop.",
        "35... Rh5 36. Qh1 Rah8 37. Ne2": "Nd2 still leaves Rf nowhere to run.",
        "37... g5 38. fxg5 Nxg5": "Oh, the rook was a better choice.  White gets a free pawn.",
        "39. Rf4": "White could trade a rook for knight and bishop.",
        "39... Nxe3+": "White should not take the pawn, or black can pin the rook with Bd6.  Black must remember the bishop is cut loose.",
        "40. Kxg3": "Here Rxh3+ trades rook for queen, though white would pick off Ba3.  Eight points for ten (queen plus pawn).",
        "40... Ne4+ 41. Kf3 Rh5xh3+": "Nice.  Queen goes bye bye, while rook saves knight.",
        "42. Qxh3 Rxh3+ 43. Ng3": "Nope.  RxNc4+ gives up the knight for nought.\n",
        "43... Nc4 44. Re2 Ne5+ 45. Kg2 Rxg3+ 46. Kf1": "Rf3+ trades rooks.  Fair trades now favor black, up six points.",
        "46... Bc1 47. Rh4 Rf3+ 48. Ke1": "Re3 trades rooks.",
        "48... Bd2+ 49. Kd1": "Nice.  Nc3+ forks the white rook, but black should play Bg5 to frighten the other white rook first.",
        "49... Rf1+ 50. Kc2 Bg5 51. Rhh2": "Ok, Nf3 to scare Rh2, followed by Nd4+ to fork the other rook.  Knights excel at forking rooks.",
        "51... Bf4": "This gives white momentum, allowing the b passed pawn to advance.\n",
        "52. b6": "?  White should probably have played Rh7 instead.",
        "52... Bxh2 53. Rxh2": "Rf2+ trades rooks, and black still prevents pawn promotion with Nd7 or Kd6.",
        "53... a3 54. Rh6+ Nf6 55. b7 Rf2+ 56. Kb3 Rf3+ 57. Ka2 Ned7 58. Rh8 Rf2+": "Nope.  Sacrifices pawn for nothing.",
        "59. Kxa3 Rf4 60. b8=Q Nxb8 61. Rxb8 Rc4 62. Ka2 Nd7 63. Ra8 Rb4": "Keep the king pinned against the wall and promote a pawn.",
        "64. Ra6+ Rb6 65. Ra8 d4 66. Re8+ Kd6": ""
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=59915",
    "gameName": "Team match",
    "players": "pambro (900) vs. nevhelp (991)",
    "opening": "Queen's pawn (D00), stonewall attack"
}