{
    "moves": {
        "1. f4": "hmmm bad luck for me.. its not the e4 move but its f4.. In some variations of the french defence, The winawer as example f4 is playd in a later state.. therefore i still replied with e6 with keeping the possibility in gaining that position open",
        "1... e6 2. Nf3": "Still possible. But Also kept in mind that there is a good change that we wont end up in a french defence variation.",
        "2... d5": "Still possible.. But Also kept in mind that there is a good change that we wont end up in a french defence variation. However, the moves that are played in the French defence looks legit on against this opening as well. ",
        "3. e3": "Okay, well in the french defence the e pawn normally goes to e4 instead. So maybe its time to drop that idea for black. however as said before.. the pawn position that you go for in the French Defence, also looks strong here. So I just proceed with that way of developing. ",
        "3... c5 4. Be2 Nc6 5. O-O": "At first sight, this looks solid for white. However, If I can brake up the center the black squares might become available for my dark bisschop. I believe we got an equal position here.",
        "5... Bd6 6. b3": "b3 gives white the opportunity to set the white dark bisschop on the long diagonal.",
        "6... b6 7. Bb2 Nf6 8. d3": "this moves makes the square e3 weak. So I wouldn’t be surprised if white wants to go for e4 and maybe even f5. However, this migt take some time.. My dark bisschop is attacking the f4. When he plays e4 white will lose the defence on f4. I also want a to let my white bisschop go to a better square. I prefer to do so without blocking other options. Bisschop looks strong on b7 but on the other side.. there is a lot material in the way for that long diagonal. Also the knight on f3, is overprotected. On a later state, I also want some options to do something on white queenside of the board.. therefore I do believe that the move a5 makes sense. If I can push that pawn fun further on the a file.. It might give white holes. If I get it to a3 it also might irritate white darks bisschop. Plus, I leave the option to move my light bisschop to a6. \r\n\r\nIt might be a bit odd to make the move cause the idea to make some brakes in the white pawn structure.. However.. to do that quick, white needs to weaken his pawn structure a bit more. \r\n",
        "8... a5 9. Qe1": "hmmm now the queen is defending the pawn structure a bit less. I think whites idea is to go to g3 or h5 and attack on my kingfile. Specially when I castle. I do have enough faith in my own position to handle this attacking idea at this point. + I also need to bring my king into a save position. ",
        "9... O-O 10. Nc3": "This move, if you look at it, it might look decent. The knight is developed now, disadvantage point of it, its blocking the diagonal but Nb5 looks like a good move for white.. I want to keep my dark square on the at this point silly looking diagonal. So I have want to avoid white knight to come to b5. easiest way is to play Ba6 here. But often, I do prefer a counter attack",
        "10... Ng4": "If white decides to play Nb5 here anyways, I simply take on e3 anyways. Attacking the rook on f1, and also threaten to play NXc2 and forking the queen on e1 and the rook on a1\r\n\r\nThe main threat is going for the e3 square here. Cause of black is attacking the pawn on e3, white probably needs to defend the pawn. Bd1 looks a bit weird.. Same as Nd1, both options will make the Rook on a1 looks imprisoned. Same counts for Bc1. but for Bc1, also counts that the strong placed bisschop left its diagonal. \r\n",
        "11. Bd1": "I can understand this move.. White needed to defend e3. But Bd1 seems like an odd position for the bisschop. At this point, look how important it was to play a5 instead of Bb7 right away. This saved me one tempo and Ba6 looks attractive now. ",
        "11... d4": "I can understand this move.. White needed to defend e3. But Bd1 seems like an odd position for the bisschop. At this point, look how important it was to play a5 instead of Bb7 right away. This saved me one tempo and Ba6 looks attractive now. However, the e3 square is defended by the queen.. I do have a center brake here cause of that.. the square d4 is defended twice.. 1, the Knight on f3, 2 the pawn on e3. ( the e3 pawn has to leave the square that I want for my Knight ) I also uses the disadvantaged side of the whites 10th move (Nc3). 2 options here: Ba6 or the center brake.. Well easy decision for me.",
        "12. Ne4": "Here I think white blunders 2 pawn. Going for the exchange on e6 is to slow cause taking the pawn on e3, uses as a attack on the rook as well. ",
        "12... Nxe3 13. Rf2 Bxf4": "2 pawns up, the centrum is mine and the Bisschop on b2 has lost functions here.",
        "14. Bc1": "logical. Now it has functions again.. Then again, the moves has some disadvantages. If white exchanges on e3, I take back with my bisschop. The bisschop is placed strong on e3 and its also threatening a +exchange cause of the pinned rook on f2.",
        "14... f5 15. Ned2 Bb7": "hmmm .. Mayb this is not the best move.. Bisschop h6 might be better. Makes me able to defend the e4 with one more defender (pawn to f5 as a next move) a well :P ",
        "16. g3": "thats for the second change to do that ;) Good thing that I have that idea at this point were it was missing on the previous move.. or maybe its just a lucky incident cause I'm forced to move my bisschop here.",
        "16... Bh6 17. Nf1 f4": "And voilla. ofcourse white can play  g4X here but that weakens white kingside badly.",
        "18. Bxe3": "The power of f4 is that the rook on f8 joins the attack. After this move, white is kind a forced to play Rg2 to keep defending the Nf3 with the Bisschop on d1. Whites 11th move was a great move after all. ",
        "18... fxe3 19. Re2": "No!! thats a shame of this game. Position was really good for black but at this point.. black is 2 pawns and a piece up. Rg2 would also be powerfull for black cause of the Bb7. Plan was to play the weird looking move Na7 and Qf6",
        "19... Rxf3": "I can't blame Juva for giving up over here. He was down to much material. \r\n\r\nFinding the right moves after a game is of course easier then during the game. However you have a lot of time for every move your play and I do believe that white has chosen for a difficult reply on blacks move. Stills its not a bad idea to play games like this with white. You learn a lot from games like this.. And better test stuff like this out online then during an official match in real life.\r\n\r\nI do believe that this games shows that it is hard to find the right moves for white. If black playd Ba6 on move 10. instead of Ng4 whites game would be a lot easier.. \r\n\r\nI find it fun and also a bit my style to play e6 against the f4. I’m not a professional and there are many stronger then me but still if you like the way I playd against f4 feel free to do so as well. \r\n\r\nSpecial thanks to Kneilca for looking into this game :)  \r\n"
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=45803",
    "gameName": "Team match",
    "players": "juva (1592) vs. rslaman (1591)",
    "opening": "Bird's opening (A02)"
}