{
    "moves": {
        "1. c4": "c4, my favourite, though not exclusive",
        "1... Nf6 2. Nc3 e5 3. d3 d5 4. cxd5 Nxd5 5. Nf3 Nc6 6. g3 Bb4 7. Bd2 Nxc3 8. Bxc3 Bxc3+ 9. bxc3 O-O 10. Bg2": "And this is one of my favourite situations too. I still don't know why, because it is not even clear white is or not better.",
        "10... Qf6": "and this is a first surprise. I guess c3 is in the goals.",
        "11. O-O": "here, i guess i was exposed on e4 followed by dxe and Qxc3.",
        "11... Bg4 12. Qa4 Bh5 13. Rab1 Rab8 14. Rb2 Ne7": "mistake?",
        "15. Qxa7 e4 16. Nd4": "as Nc6 is no more, e4 has no more the same effect.",
        "16... exd3": "many possibilities, but I think my solution is the best one",
        "17. Rxb7 Rba8": "unexpected, I must admit, but still no harm",
        "18. Qc5 dxe2 19. Re1 Rxa2 20. Rxc7 Re8 21. f3": "doubble effect: Bh5 has no more harm and K can now move to e2",
        "21... h6": "I thought something like a kNight move would have occurred. But no, then...",
        "22. Rxe2": "... why bother?",
        "22... Rxe2 23. Nxe2 Bg6 24. Kf2 Qe6": "threatening some knight move, I guess... But there is no peculiar harm...",
        "25. Qc4": "please do exchange: my c pawn is free...",
        "25... Nd5": "No sir. But I will attack on e2",
        "26. Rc6": "chasing the queen",
        "26... Qf5 27. Rc5 Qd3": "big mistake. Next moves are forced.",
        "28. Qxd3 Bxd3 29. Nc1": "losing a minor piece.",
        "29... Nxc3": "taking back the pawn for the price...",
        "30. Rxc3 Bg6 31. Bf1 f6 32. Re3 Rc8 33. Nd3 Rc3 34. Nf4 Rc2+": "I'll have my exchange at last",
        "35. Re2 Rxe2+ 36. Bxe2 Bf7 37. Ke3 g5 38. Nd3 Bc4 39. Kd4 Ba6 40. Nf4": "and another exchange...",
        "40... Bxe2 41. Nxe2 Kf7 42. Kd5 Kg6 43. f4 h5 44. Ke4 f5+ 45. Ke5 h4 46. Nd4": "and a pawn falls..."
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=53976",
    "gameName": "Team match",
    "players": "thitho (1730) vs. bearskin (1649)",
    "opening": "English opening (A16)"
}