{
    "moves": {
        "1. c4": "Some kind of English\n\nI annotate this game because I've requested a draw several times, playing with blacks. My opponent declined and finally I won the endgame.",
        "1... e5 2. g3 Nc6 3. Bg2 h5": "3. ... h5 !? \n\nfirst time I played that move, my main strategy was to confuse my opponent. I cannot say I've managed in my intention but nothing bad for the blacks. Closed positional game avoiding any surprises.",
        "4. Nc3 f5": "4. ... f5 !? same song",
        "5. e3 Nf6 6. Nge2 d6 7. a3 Bd7 8. b4 a6 9. Bb2 g6 10. Qc2 Bg7 11. Rd1 O-O 12. d4 e4 13. O-O Rc8": "I think blacks plan turned out. Not bad position and even the initiative into the black's hands",
        "14. Nf4 Qe8 15. Ncd5": "it's action time",
        "15... Nxd5 16. Nxd5 Ne7 17. Nxe7+ Qxe7 18. Qb3 c5 19. dxc5 dxc5 20. Bxg7 Qxg7 21. bxc5 Bc6": "minus a pawn, but in strong position",
        "22. Rd6 Rfd8 23. Rfd1 Rxd6 24. cxd6 Qd7 25. c5+ Kh7 26. Rc1 Ba4": "I think I offered a draw first in here, ok - minus a pawn but let us see what the whites were able to do",
        "27. Qd5 Bb5 28. Bf1 Bc6 29. Qb3 Ba4 30. Qb4 Qc6 31. Be2 Qd7 32. Rb1 Bc6 33. Bc4 Ba4 34. Qxb7": "Queens exchange didn't help much to the whites ",
        "34... Rxc5 35. Qxd7+ Bxd7 36. Rb7 Rxc4 37. Rxd7+ Kh6 38. Ra7 Kg5": "I stopped my draw offers here and started desire the triumph",
        "39. d7 Rc1+ 40. Kg2 Rd1 41. f3": "And the whites made their fatal mistake 41. f3 ?",
        "41... Rd2+": "41. ... Rd2+ !",
        "42. Kf1 exf3": "so now we have another story. It's not only the pawns revenge, it's all over",
        "43. h3": "nothing helps",
        "43... h4": "43. ... h4! rush attack",
        "44. gxh4+ Kxh4 45. Rxa6": "45. Rxa6 ! preventing the mate ... for a moment",
        "45... g5": "45. ... g5! my soldiers desired the crucial battle  ",
        "46. Ke1 Rxd7": "all white's hopes crushed here",
        "47. Kf2 g4": "47. ... g4! do you respect the pawns now",
        "48. hxg4 fxg4 49. Rh6+": "nothing helps",
        "49... Kg5 50. Ra6 Rd2+": "50. ... Rd2! let's rock",
        "51. Ke1 Re2+ 52. Kf1 g3 53. Ra8 g2+": "who said it was a pawn ?",
        "54. Kg1 Re1+ 55. Kf2 g1=Q+ 56. Kxf3 Rxe3#": "a mortal kiss"
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=44309",
    "gameName": "Team match",
    "players": "buboy (1572) vs. mirkonitto (1664)",
    "opening": "English opening (A20)"
}