{
    "moves": {
        "1. e4": "This is a game I lost. I underestimated my opponent's attack. It's a Sicilian, Rossolimo variation. I never thought it was a particularly offensive variation, but I had to change my mind.",
        "1... c5 2. Nf3 Nc6 3. Bb5 e6 4. Bxc6 bxc6 5. O-O d5 6. d3 Nf6 7. Nc3 Be7 8. Bg5 O-O 9. Re1 Rb8 10. b3 Ba6": "I have a solid center, a rook on an open file, I can't complain overall. The thing is, my pieces are drifting away from the king-side, and I am not thinking of aggressive resources of my opponent at all. I think this move is already a bit unconventional. First, 10. ... a5 fit better the idea of queen-side attack. Second, Black has to think about what will happen when White will push forward the e-pawn. And I am not doing that.",
        "11. Qc1 c4": "This is an attempt to open the center which I consider now not likely to work.",
        "12. e5 Nd7 13. Bxe7 Qxe7 14. dxc4 dxc4 15. Ne4": "And that's the reason. White's pieces are better placed.",
        "15... f6": "I did not resign to the knight dominating the center. This weakens the castle: the Black should worry more about gaining some space to maneuver, before opening the lines.",
        "16. exf6 gxf6": "The bitter truth. e6 will become a far too easy target, if the Black takes the pawn otherwise.",
        "17. Ng3 e5": "This unduly concedes f5. The Black must call the far-away forces to the king-side: 17. … Rbe8 18. Qh6 Qf7. The c4 pawn and the black bishop are laughable.",
        "18. Nf5 Qe8": "18. ... Qf7?? 19. Nh6+",
        "19. Qh6 Qf7 20. Nf3h4 Rfd8": "Trying to breath. This is an educational example: one of those situations in which it really matters what rook you move.\n… Rbd8 21. Re3 Kh8 22. Ne7 Rg8 23. Nxg8 Rxg8 somehow resisted.",
        "21. Re3 Nf8 22. Rg3+ Kh8 23. Rg7": "Black resigns. So if you're attacked, don't forget: seek space and bring the pieces to the bombed area!"
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=37779",
    "gameName": "Team match",
    "players": "bert11111111 (1921) vs. ciocionheart (1894)",
    "opening": "Sicilian (B30), Nimzovich-Rossolimo attack (without ...d6)"
}