{
    "moves": {
        "1. e4 c5": "Oh, how I hate Sicilian, it is 3rd on my list of openings I do not wish to face.",
        "2. Nc3 Nc6 3. Nf3 g6 4. Bc4": "Before white's 4. Bc4 Chessbase live found more than 2000 games with these moves. Now we are down to a mere 784 games. Gameknot's database also starts to give equal \"chances\" for both white and black. ",
        "4... Bg7 5. O-O a6": "This was a bit surprise. I was expecting d6. Now we are out of the \"official\" Gameknot theory. No 1900  rated games with this move on the database.",
        "6. a4": "I like my bishop where it is. If b5 then axb5 and if black captures back the rook at a8 is dead. ",
        "6... e6": "Again, I would have done d6. I don't particulary much like black's bishop on g4.",
        "7. d3 Nge7 8. Bg5 f6": "I should have seen that coming. This won the tempo for the black.",
        "9. Bh4 h5 10. h3": "Forced? 10. Bg3 d5 and then there is no other way for bishop to escape than h2.",
        "10... g5 11. Bg3 b6": "Black is like an avalanche that suddenly stops a yard from your castle.  Black seems to be preparing for Bb7 which suits me fine because it weakens his d7. How can I exploit that? Lets try to open d-rank. Opening d-rank also looks good for me, because I get to move my knight away from then king's side and get more room to manoeuvre against the avalanche when it continues.",
        "12. d4 cxd4 13. Nxd4 Nxd4 14. Qxd4 Nc6": "Again black wins tempo. ",
        "15. Qe3": "Also b6 is only proteced by queen. So it seems fair to threaten it with queen. ;-)",
        "15... Nb4 16. Bb3 Bb7": "Now the waited Bb7 happens and I can start doing something instead of reacting for blacks push. ",
        "17. Rad1 e5": "Bishop at g3 is now currently out of the game and black made a holes at f7 and d5. I don't know if doing Bd6 would have been better for me instead of doing Rad1. At least my majors are free to move.",
        "18. Rd6 Bc6 19. Qf3": "Threatens to capture e5 with bishop. If black captures back with the pawn it will be checkmate with Queen on f7.",
        "19... Qe7 20. Rfd1": "The more the merrier. It would have been too passive just to retreat.",
        "20... O-O-O 21. Qe3": "And had I retreated the black's queen could have had access to c5. I want her to be on the king's side. There is no other way to protect the pawn but moving the king. ",
        "21... Kc7 22. a5": "Now, if I just could get my Knight on d5 without losing my rook on d6 and my queen on c5... Wait, I can. I just sacrifice pawn at a5! There also is a7, which looks very tempting when the debris before it is cleared.",
        "22... Rdb8": "Nope.",
        "23. axb6+": "I was hoping for Rxb6 and Qc5. Then doing Nd5,,,",
        "23... Kb7 24. Ba4": "There are two pieces of black's that I wish to get rid off, the Bishop and the knight. Even I should be able to gain victory after that. Let's threaten d7 to see if black would do an exchange?",
        "24... Rhd8": "Nope. And if I exchange now on c6 it helps black more. Queen starts to participate and black could probably exchange my attacking pieces away. Lets try to pressure the knight.",
        "25. Qc5 a5": "There is no place for the knight to go, so black sacrifices a pawn to make room at a6 for him.",
        "26. Qxa5 Na6 27. Bb5 Rba8 28. Bxa6+ Rxa6 29. Qb4": "For me the most crucial thing is to know when I am capable of making moves. This was not one of those times. Qc5 would have saved the pawn. Had black captured it knight would have gone to d5 threatening both rook at b5 and queen on d5. If the bishop had captured the knight my queen would have captured the rook at b6 with check. After that moving king to a8 would have been checkmate with Ra1 and Kc8 would have lead for pawn capturing bishop at d5. After that it would have taken a couple of moves for victory. Black's rook at d8 effectively blocked with his king. Queen blocked by my rook and d-pawn. My second rook free to move for the kill thru a1 and finally a8. \n\n",
        "29... Rxb6 30. Qa3": "Another dubious move? What would have happened if black had played 30. .. Ra8? 31. Rxd7  Bxd7 32. Qxe7 [threatens both bishops at d7 and g8. Black would have been left with two rooks, one bishop against queen, rook, knight and bishop with worse position. ] What if black had continued to harass the queen with Ra6? \n",
        "30... Qf7": "If black just could use his queen a bit more effectively the game could still be saved. But now there is not enough time.",
        "31. Ra1 Rb8": "Probably black thought that Qa7  Kc8 would lead to Qxb6 and decided to save the rook and make room for king to escape from the back rank. ",
        "32. Nd5": "But that saving move made another opening. If 32. .. Rb5 33. Qa6# ",
        "32... Bxd5 33. Rxb6+": "If 33. .. Kc7 then 34. Qd6  Kc8/Kd8 (forced) 35. Rxb8#\nif 33. .. Kc8 then 34. Rxb8  ....",
        "33... Kxb6": "Now it takes a bit longer. There are two escape routes for black's king: d8 and d6. Let's make sure that at least d8 is blocked. ",
        "34. Qa7+ Kb5": "And now close the other one.",
        "35. Qa6+ Kc5 36. Ra5+ Kb4 37. Rxd5": "Again the black's queen is blocked and there are simply too many things for black to guard against. ",
        "37... Qf8 38. Qa5+ Kc4 39. Qc3#": "Done. It is rare  to have two interesting games against same opponent at the same time. From the one James annotated it is very apparent that he is stronger in the end game than me and has more extensive knowledge on openings. But sometimes one or two too passive moves can suddenly turn the tide against you. "
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=14947",
    "gameName": "Team match",
    "players": "dafool (1516) vs. james1471 (1597)",
    "opening": "Sicilian (B23), closed, 2...Nc6"
}