{
    "moves": {
        "1. e4": "Chads.>Please  reply with improvments for the game .I love playing the french and hope to master it sometime.... Thank You.",
        "1... e6 2. d4 d5 3. Nc3 Bb4": "The French Winawer is an opening i began to play when i found a nice Book in a bookshop for £2.00 ...One of only a few books i own and have read ferverously. From here it is up to white to choose , but carefully as each variation is unstable with no time to stumble ...  Im not a good enough player yet to understand why there unstable but they are.",
        "4. Bd2": "The keres gambit 4.Bd2...  Most games i play are due to 4.e5 locking in the pawns but this variation allows black to snaffle some pawns while white gets stuck in on the king side.",
        "4... dxe4 5. Qg4 Nf6": "all known theory and quite relieving for me as most of my games encounter 4.e5 and the knight always seams awkward to me on e7 after whites kingside thrust.",
        "6. Qxg7 Rg8": "This has all known theory so far and the moves just come naturally.",
        "7. Qh6 Qxd4 8. O-O-O": "I have an extra pawn with my Queen expecting a discovery by white at any time",
        "8... Bf8": "This position has been played before between Boleslavsky and Bronstien ,but we got here in a different move order , this Bishop move back to f8 has a strong pyschological effect as it goes back to its origional square and puts the white Queen in decision time.",
        "9. Qf4": "Now here Bd6 or Rg4 have been played before in competition but i tryed something new.",
        "9... c5": "A new move i havent read about or seen before ... although blacks position seems to have a lot of holes the centre is quite active and peices can still develop to the protection of the king.",
        "10. Nb5": "c7 under some pressure and mostly the reason for moving c5.",
        "10... Nd5": "Attack and defence.",
        "11. Nc7+ Nxc7 12. Qxc7": "So the Queen has c7 after all and can smell the king.",
        "12... Nd7": "Just saving the Bishop.",
        "13. Bg5": "Oh Dear an inevitable discovery with mate to follow ...... But my Active CENTRE should be sound.",
        "13... Rxg5 14. Rxd4 cxd4": "Level material and White to play .... Both of us have Developed slowly and have awkward decisions to make.The two pawns look happy togeather in the centre and mostly my reason for this variation.",
        "15. a4": "I thought this move unfortunate for white ... I couldnt really see Where he was going with it ......The bishop to b5 cant get took by the rook but  its too slow and it allows me to take command of the centre.",
        "15... Rc5": "The centre is mine .",
        "16. Qf4": "My Attack plan was under way now .. i saw a possible check from the Dark Squared Bishop , i had to get my Rook activated , the lazy white squared Bishop to move some how",
        "16... d3 17. Qxe4 Rxc2+": "Hello King........",
        "18. Kd1 Nc5": "Hello Queen.... Attack and Defence.",
        "19. Qd4": "now i wanted to activate my two Queenside peices , i attempted to make white develop them for me.",
        "19... e5 20. Qxe5+ Be6": "Space at last",
        "21. Nf3 Bh6": "space at last",
        "22. Ng5": "spoil sport",
        "22... Rc8": "out at last",
        "23. Bxd3": "all out to play except poor old rook in the corner .... A complicated game for two amatuers im two pawns down now but have co-ordination and all my peices can wreak havoc    ......... ",
        "23... Nxd3 24. Qb5+ Ke7 25. Qxd3 Rc2c1+ 26. Ke2 Bc4 27. Rxc1 Bxd3+ 28. Kd2 Bxg5+": "I Just liked this game not just becuase i won but i played a new variation of an opening i enjoy and sacrifised The Queen for Centre activity ..... Its probably subject to ridicule by top players but i thoroughly enjoyed the game and i thank my Opponent for that and Frank Marshell who first introduced the move 4.Bd2  in 1901 against Chigorin."
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=134",
    "gameName": "Team match",
    "players": "cmiller (1447) vs. chads (1495)",
    "opening": "French (C15), Winawer, fingerslip variation"
}