{
    "moves": {
        "1. d4 Nf6 2. h3": "White probably wants to steer away from opening preparation.",
        "2... b6": "Good diagonal for the light bishop. Especially if White doesnt fianchetto his.",
        "3. c4 Bb7 4. Nc3 e6 5. Bg5": "Moving the bishop here might lead to either trading it for the knight or wasting tempos moving the bishop from pawn attack by h6 and g5. Worst situation is that the bishop might get shut off from the fight after black plays d6.",
        "5... Bb4 6. Qc2 h6": "putting the question to the bishop's motif",
        "7. Bh4 g5 8. Bg3 Ne4": "the bishop pin at c3 is rather annoying for white, especially since his dark bishop strayed to the king side already and theres no other pieces to protect nc3 other than his queen.",
        "9. Be5 Rg8": "my kingside is weaken by earlier pawn advances (white's bishop might be termed the provoker) so theres no point in castling there. i just need to protect vital squares on that side while developing and safeguarding my king on the queenside. black is good since white hasnt developed his king side at all (he will have to castle there since his queen side structure is surely crippled after a trade at c3.)",
        "10. f3": "annoyed by the pin, but further crippling his pawn structure while neglecting development.",
        "10... Bxc3+ 11. bxc3 Nf6 12. e4": "white seems to have a strong center and the bishop pair (typical in d4 variations with bb4) but he's behind in development and his pawns might turn out to halt the scope of his own bishops (note white's light bishop) instead of aiding it. but black needs to blockade white's pawns for this to work.",
        "12... d6 13. Bh2": "too proud to trade his bishop for a knight. but this turns out to be one of the main point of the match. when the position is blockaded, my knight will be a far more powerful piece than his blinded bishop.",
        "13... Nbd7 14. Bd3 e5": "and white's bishops are blocked in. the dark bishop is obstructed by my pawns chain at d6 and e5 while his light bishop is shut in by his own pawns at e4 and c4.",
        "15. Ne2 Nh5 16. g3 c5": "further blockade of the center.",
        "17. d5": "playing into my hand. his light bishop AND his dark bishop are becoming big pawns. my light bishop is actually not that bad since i can reactivate it on another diagonal.",
        "17... Qf6 18. Rf1": "forfeiting kingside castle. he will leave his king in the center since its so solidly blockaded. but his heavy pieces are not connecting well.",
        "18... O-O-O": "my king is safe here for the rest of the game. cant say the same for his.",
        "19. a4": "futile attempt to breach the castle wall.",
        "19... a5": "white has no play against my king because the only possible weakness is the b file (can be attacked with 2 heavy pieces) which is covered by my knight. meanwhile. i can maneuver all my pieces to crack open his king side and get to his king.",
        "20. Qb2 Kc7": "just in case",
        "21. Rb1 Qg6": "maneuvering sequence.",
        "22. Nc1": "white pieces have no targets and squares to attack from.",
        "22... Ng7 23. Nb3": "try to get sneaky with na5 and qb7.",
        "23... Ba6 24. Nc1 Qh5 25. Qg2 Rdf8": "preparing f5.",
        "26. Be2 Qg6 27. g4": "temporarily disallowing pawn breaks. drawback is that h4 and f4 become weak and are perfect squares for knights.",
        "27... h5 28. Bd3": "taking the pawn leads to weak isolated pawn on h file.",
        "28... Rgh8 29. Bg3 Rh7": "doubling the h file. i will initiate the pawn exchange when all my pieces are set up to penetrate white's structure. white cannot organize his pieces to defend.",
        "30. Ne2 Rfh8 31. Kd2 Nf8": "plan to hop into h4 and f4.",
        "32. Rb2 Nd7 33. Nc1 Ne8": "one knight needs to be at d7 to defend b6 in case white double his rooks.",
        "34. Nb3 Nef6 35. Kc1 Nf8 36. Nd2 Nf6d7 37. Rf2 Qf6 38. Nf1": "white's trying to get his knight to f5.",
        "38... Ng6 39. Ne3 hxg4": "the moment's ripe to exchange pawn.",
        "40. hxg4": "forced. otherwise h3 is too weak.",
        "40... Nf4": "strange at first to exchange my knight for his near useless bishop but i see a way to force material gain.",
        "41. Bxf4 exf4": "open up e5 for the other knight to use.",
        "42. Nd1": "forced, i was threatening his knight and the pawn at c3.",
        "42... Ne5": "the pawn at c4 is lost.",
        "43. Kc2 Nxc4": "again, allowing white to exchange his ineffective bishop for my powerful knight. but the situation is open enough now that my light bishop should prove useful than his remaining knight which doenst have a lot of space to move around.",
        "44. Bxc4 Bxc4 45. Qg1 Rh7h1": "my bishop and rooks are restricting his heavy pieces.",
        "46. Qg2 Re1": "doubling on rank 8!",
        "47. Rb1 Rhh1 48. Rd2 Qh6 49. Rb2": "blunder. lead to loss of the knight after a forced sequence. but the position is lost for white.",
        "49... Reg1 50. Qf2 Rgf1 51. Qg2 Rhg1 52. Qh2 Qxh2 53. Rxh2 Rfxd1": "if 54.Rh7 trying to counterattack then rdf1 threatens mate win."
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=3740",
    "gameName": "Team match",
    "players": "renich (1587) vs. lordnguyenvo (1652)",
    "opening": "Queen's pawn game (A45)"
}