{
    "moves": {
        "1. e4 e5 2. f4 exf4 3. Bc4 Nf6 4. Nf3 d5 5. exd5 Nxd5 6. Bxd5 Qxd5 7. O-O Be6 8. Nc3": "I like how white pushes the black queen.  She must move about four times while white develops his pieces.",
        "8... Qc5+ 9. d4": "Here white makes up the lost pawn.",
        "9... Qc6 10. Bxf4 Bb4 11. Ne5 Qb6 12. Be3 O-O 13. Qf3 Nc6": "Whoa, Pd5 forks black's bishop and knight while simultaneously threatening black's queen.  Nc6 seems pretty questionable in light of that.",
        "14. a3": "Why would white threaten the black bishop by doubling its pawns?  This trade is black's advantage, and forsakes the pawn/knight trade PxNc6.",
        "14... Bxc3 15. bxc3 Bc4 16. Rfb1 Qa6 17. Nxc6 bxc6 18. Rb4 Rfb8 19. Rf1": "?  Maybe white was eying the f7 pawn, which was protected by the black bishop.  But the bishop/rook trade works for black's advantage.",
        "19... Bxf1 20. Rxb8+": "5 points down every trade now works to black's advantage.\n",
        "20... Rxb8 21. h4 Rb1 22. Kh2 h6": "?  I personally favor QxPa3.  Sure, it leaves Pc6 undefended, but QxPc6 would be answered by Qd6+ followed by a queen exchange.  White's pawns are all blocked and defended only by white's black bishop.  Meanwhile, black could focus on promoting the a pawn or toppling the white king.",
        "23. Qg3": "Now Ph6 is vulnerable.  Pc5 lets the black queen defend Ph6, but Pc7 would be vulnerable.  QxPc7, Qg6.  Qd8+ Kh7.  Qg6 would then be followed by a queen exchange--or white#.  or white might move Qf3 to protect Pg2.  Black is so far ahead sacrificing a queen and bishop for white's queen and pawn still results in a black victory.\n\n",
        "23... Qc8 24. Bxh6 g6 25. h5 Qb7": "?  I don't see black's strategy.  personally I'm partial to qf5.  PxPg6, Qh5+.  White either trades queens or loses the bishop.  If white answers with QxPc7, QxPh5+ wins white's bishop for free.",
        "26. hxg6 c5 27. gxf7+ Kxf7 28. Qg7+ Ke6 29. Qe5+ Kd7": "White can continue checking into stalemate.  Black must avoid checkmate.  White must either check every move or protect against Pg2.  If I were playing white I would try to settle for a draw.\n",
        "30. Qf5+ Kc6": "I like QxPc5.",
        "31. Qf3+ Kb6 32. dxc5+ Ka5 33. Qxb7 Rxb7 34. g4 Rb2 35. g5 Rxc2+ 36. Kg1 Bd3": ""
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=49253",
    "gameName": "Team match",
    "players": "jakdarb (1309) vs. jrgcoulson (1364)",
    "opening": "KGA (C33), bishop's gambit, Cozio (Morphy) defence"
}