{
    "moves": {
        "1. d4 e6 2. Nf3 Nf6 3. e3 b6 4. Be2 Bb7": "4. I am using my typical defense set up that involves pawn advancements to the 6th rank, development of minor pieces within the first 3 ranks, and keeping the 5th rank as a line of demarcation. I am not interested in going over the efficacy of this strategy in this annotation. ",
        "5. O-O": "5.   Early castle by white. I start to hone in on the king side see if a plan develops.",
        "5... Bd6": "5. Sometimes I will fianchetto both bishops, but this time decide to keep the f g and h pawn on the 7th rank.",
        "6. h3": "6. The h3 pawn push is a wasted moved and gives me an edge on development.  Even though white has a castled king he is still a minimum of 3 moves from full development and that is if I do not count central placement of the rooks.  \n\nI am opposed to early a or h pawn moves (when white) to the 3rd rank.  This gives your opponent a hook to pry the enemy king out of hiding. There does come a point when the a3 or h3 pawn moves are needed. For instance, a castled king has a rook protecting the 1st rank, but the rook is needed else where.  You open the h3 pawn in case there is a back rank check.  However, early in the game I feel it is more important to develop minor pieces and gain central control.  You will see this move done often when a knight is perched on g5 or b5.  The knight when placed there typically do not pose an immediate threat because they need another minor piece or a pawn to truly gain a hold in your territory.  There is time to deal with the threat.  I find that many players will use the a or h pawn to kick the knight.  They do this almost by rote like an enemy in your camp must be pushed away no matter what.  \n\n",
        "6... Nc6": "6. Continuing to develop",
        "7. Nc3 Qe7 8. a3": "8. Yet another time wasting move.  White would have done better to advance the b pawn, so at least he could develop both the bishop then the queen on the next 2 moves.  He also has the option of developing the queen to d3 which would leave the d2 square for his bishop.  ",
        "8... O-O-O": "8. I am developed at this time.  Typically, I would try to place my rooks in the center and create a plan of attack.   However, since white is castled and he has advanced the A pawn I decided to try and use that h3 pawn as a hook to pry the enemy king out from safety.  One of the tactics I use to do this is the fishing pole.  I did not expect this trap to work, but I thought I would give it a try since I was ahead on development I had some time.  Even if the trap failed and white did not take the bait I would be in a good position and perhaps I could force a mistake.",
        "9. b4": "9. Yet another pawn push at least this one allowed white to develop his bishop.  ",
        "9... h5": "9. I know that I am now using my h pawn, but the situations between white and I are different.  I am almost fully developed with just the placement of the rooks to worry about. I plan on using this rook lift as a way to either set a trap or if he does not bite then I will advance on the king side.  You will notice that my bishops, the knight on f6, and my queen are all poised to move quickly to the king side.",
        "10. Bb2 Ng4": "10. The fishing pole has been baited.  I am hoping that white will take the knight on g4.  However, I did not expect him to fall for it, so the placement of the bishop on d6 was a bit of insurance.  If things looked like I might get in trouble after white's next move I could move the knight to h2 forcing a move from the rook on f1 to allow me to keep the initiative. ",
        "11. hxg4": "11. Perfect!\n\nI am now down in material, but I have a big edge on piece placement and initiative especially after my next move. I did not expect a player with over 5000 games completed to fall for such a rookie trap especially when we are not playing a blitz game.  However, I have noticed that a lot of players play the h3 pawn move without thinking about moves further down the line.  ",
        "11... hxg4": "11. This pawn capture gives me a little material compensation for the sacrificed knight.  In addition it gives me an open h file with a rook staring all the way into enemy camp.  Furthermore, I now have initiative because the knight must flee or I will end up 1 point ahead on material with a huge positional advantage. ",
        "12. Ne5": "12. This now gives white 3 pieces aimed at the offending pawn, but I am going to ignore this pawn for now and press the attack.  If white sees the danger and tries to give the king a flight square this pawn will become invaluable, but for now it is a good distraction/blocking piece.",
        "12... Qh4": "12. Threatening checkmate on the next move with Qh1. White now has to find some room for the king or somehow attack my queen and drive it away.  The only response that I see is to push the f2 pawn to open up room for the king.",
        "13. f4": "13. White tries to open up some room for the king to flee.",
        "13... g3": "10. I push my pawn and seal the king's tomb and White resigns because of mate when queen moves to h1 on the next move. "
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=67954",
    "gameName": "Team match",
    "players": "pawnjuan (1488) vs. edessa (1552)",
    "opening": "Queen's pawn (A40)"
}