{
    "moves": {
        "1. d4": "Here is recent team game. It contains one of the more interesting endgames I've had in a while - six pawns vs. a bishop and three pawns. I have the white pieces, and set up a very formidable attack involving a dual rook lift in front of my own castled position.  Black counters the threat nicely, and ends up picking up a piece for three pawns. The endgame took some work, but white's pawns were able to carry the day. I felt this game was worthy of sharing, as the endgame was quite instructive. Enjoy:)",
        "1... d5 2. Nf3 Nf6 3. c4": "Queen's Gambit.",
        "3... c6": "Slav variation - black reinforces d5.",
        "4. cxd5": "I've always preferred this method against the Slav, as white can generally get to the c file and own it first.",
        "4... cxd5": "Best. 4...Nxd 5. e4 allows white developmental tempo.",
        "5. Nc3 Nc6 6. a3": "?! Slow, I know - but I have found black's dark squared bishop to be rather pesky after it reaches b4.",
        "6... e6 7. Bg5": "Bd2 was also considered, but I made the decision to go ahead and get it outside of my pawn chain and hopefully trade it off.",
        "7... Be7": "Interposing the pin against his queen and developing, while hastening 0-0.",
        "8. e3 h6": "?! Slow on black's part. Bd7 followed by Rc8 may have been better.",
        "9. Bh4 O-O 10. Bd3 Re8 11. O-O": "Logical development by both sides.",
        "11... Nd7": "?! Black offers to trade dark squared bishops. I feel that this benefits white more.",
        "12. Bxe7 Rxe7 13. Qc2": "Putting pressure on the enemy compound.",
        "13... f5": "Black stops my battery threat for the moment while dangerously opening up real estate around his king.",
        "14. Rac1": "Achieving my initial goal after playing 4. cxd.",
        "14... Nb6": "Trying to find a square for his light squared bishop.",
        "15. Nd2 Bd7 16. f4": "I sense my opponent is going to swing pieces over to the kingside for a push, so I go ahead and try to lock it down, as my queen/bishop battery is already stalled.",
        "16... g6": "?! I'm not sure what this was all about. White now has ideas of getting vertical on the g file.",
        "17. Rf3 h5": "g6 is now the glue holding black's kingside together. If it can be exploited, black will have a ton of problems.",
        "18. Rg3 Rg7 19. Rg5": "! As black does not have a dark squared bishop, this move freezes any advancement idea black might have.",
        "19... Qf8": "As predicted, black now starts moving pieces behind his advanced kingside pawns.",
        "20. Rf1": "This rook is heading to g3!",
        "20... Ne7": "This knight returns to e7, having wasted some tempo by going to b6.",
        "21. Rf3 Rc8": "Black stakes a claim to the c file which white seems to be abondoning, and sets a nice pin as well.",
        "22. Rfg3 Qf7": "I think black is realizing the weakness of his g pawn, and tries to protect it further.",
        "23. Be2": "?! This move is OK, but I later recognized that Nf3 followed by Ne5 was much stronger.",
        "23... Nc4": "Getting this knight to an active post and closer to the conflict.",
        "24. Nxc4": "As my opponents last move would have stopped my previously mentioned knight trek to e5, I opt to go ahead and remove it, hoping to clear some room for tactical shots.",
        "24... dxc4 25. Bxh5": "! This one fell in my lap, as I didn't really see it after 23. Be2. Black can't take (25...gxB 26. RxR QxR 27. RxQ KxR with a very comfortable game for white).",
        "25... b5": "As he has a 3-2 advantage, black pushes ahead on the queenside.",
        "26. Bf3": "Having done some good work, this bishop returns to exert influence on the long diagonal.",
        "26... a6": "This turns out to be  a critical move for black - not weak by traditional standards as it supports his chain, but weak in the sense that b6 is now vulnerable to white's light squared bishop. Perhaps Nd5 was stronger (it was what I expected).",
        "27. Bb7": "This pawn killer goes hunting yet again.",
        "27... Rb8 28. Bxa6 Nd5": "Perhaps a turn too late, but effective still.",
        "29. Nxd5": "As  white is up in material, this trade is welcome.",
        "29... exd5 30. h4": "?! This pawn's intentions are obvious, but it was here that I realized with horror that my pet pawn killing bishop was in serious trouble.",
        "30... Rb6": "! Strong move! Black now returns to equality.",
        "31. Bxb5": "Since he's dead anyway, pawn killer goes down swinging.",
        "31... Bxb5": "And black is back in the game big time. I do remember wondering if Rxb5 were better though.",
        "32. h5": "A little demoralized after losing that last skirmish, white presses ahead on the kingside and hopes to strip away the enemy king's defenses.",
        "32... Be8": "Strong move yet again, as this hits g6.",
        "33. hxg6": "It's interesting to note that white is hitting g6 only twice now to black's four hits, but white has the initiative in this attack, so he strikes first.",
        "33... Rgxg6": "Black had a difficult decision. Equalize or simply move his queen out of harms way. He chose to equalize, but 33...Qb7 had it's merits.",
        "34. Rg5xg6+": "Critical decision for white - wholesale exchanges or passive style defense. White clears the board, and enters the endgame of K 6 vs. K B 3.",
        "34... Rxg6 35. Rxg6+ Qxg6 36. b4": "Attempting to get outside connected passed pawns.",
        "36... Qg3": "?! I REALLY counted on black capturing e.p. This move signal black's intent to force a draw by perpetual check.",
        "37. Qf2": "Killing any ideas black may have had of a draw, and encouraging a queen exchange. White is playing for the win - king to c3 stopping the passer and pushing the a and b pawns. A little risky I know - but this was a team match and Southern Chess needed the full point.",
        "37... Qg4": "Still keeping lines open to deliver check, and probably hoping to hunt the a pawn.",
        "38. Qc2": "! Protecting the vulnerable d1 square, freezing the enemy queen to it's isolani, and covering a4. A very multi purpose move.",
        "38... Kf7": "The black king will be needed in an offensive role, so my opponent begins to centralize.",
        "39. a4": "Of course.",
        "39... Ke6 40. b5": "And the race is on. Black is forced on the defensive.",
        "40... Bh5": "Interesting idea - black is attempting to come in through the back door and exchange queens. Then his king and bishop will be more readily available to stop my queenside advance.",
        "41. Kf2": "I realize black's plan, and put a stop to any queen exchange.",
        "41... c3": "Trying to sucker me away from the second rank to deliver check, and hopefully perpetual check.",
        "42. a5": "No need to go pawn snatching - I see the importance of protecting the second rank. I simply push my passers.",
        "42... Kd6": "Rushing to stop the enemy pawn advance.",
        "43. a6": "The a pawn is my queen candidate.",
        "43... Qd1": "?! The defining move - black is attempting to promote his c pawn via this proposed exchange.",
        "44. Qxc3": "As black's c pawn was just a little too close to promotion, I take him out. Now the trick will be to weather the storm and evade black's attack. Luckily for me, I have my g pawn to maneuver around if need be, and if given ANY time at all me queen will easily return to the action to defend. It's going to be a good one!",
        "44... Qe2+ 45. Kg3 Qxb5": "! Very nice! (45...Qg4  46. Kh2 Qh4  47. Kg1 fails to further threats because white controls the e1 square.) Black regains equality.",
        "46. Qc5+": "! White punches right back! ",
        "46... Qxc5 47. dxc5+": "This pawn can't be taken because of the promotion threat. While black is tied up dealing with the a and c pawn issues, white will be able to go pawn hunting after 47...Kc6 48. Kh4!",
        "47... Kc6 48. Kh4 Bg4": "Black's last remaing piece gets tied down with defensive duties, allowing the white king to roam.",
        "49. Kg5 Be2": " Black correctly assesses that my a pawn has got to go. Any chance of winning now rests with his d pawn.",
        "50. Kxf5 Bd3+": "Nothing more than a spite check, as the white king was headed to e5 anyway.",
        "51. Ke5 Bxa6 52. e4": "! Secures the draw. Black's d pawn falls next move no matter what.",
        "52... dxe4": "Black's d pawn dies with dignity, taking down an enemy with him.",
        "53. Kxe4 Kxc5": "Eliminating white's queenside threat. Black must now play to lock up enemy pawns with his bishop being supported by his king. The second race of the game now begins!",
        "54. g4 Bb7+": "Another spite check. Perhaps Bc8 was better.",
        "55. Ke5": "Cutting off the black king from the real estate I will need for promotion.",
        "55... Bd5 56. g5 Kc6": "The black king is just a step too slow. It desperately tries to get in front of the white pawns.",
        "57. Kf6": "! White can now successfully protect the f8 square, which has been selected as the square I hope to promote on.",
        "57... Kd7 58. f5": "Since Kg7 will still be available next move, white starts the march to get a queen.",
        "58... Ke8 59. Kg7": "Wins, as f8 is covered as is any conflict on f7 after white plays g6.",
        "59... Bc4": "Nothing else to do here. Black is just praying for a miracle draw.",
        "60. g6 Bd5 61. f6 Kd7 62. f7 Kc6 63. f8=Q Kb5 64. Kf6": "And black graciously resigned. What a wonderful endgame! Many thanks to everlast75 for the pleasurable game. I hope you enjoyed it:) - Thomas"
    },
    "url": "https://gameknot.com/annotation.pl/team-match-6p-vs-b-3p-endgame?gm=7789",
    "gameName": "Team match (6P vs. B+3P endgame)",
    "players": "tag1153 (1340) vs. everlast75 (1334)",
    "opening": "Queen's pawn game (D02)"
}