{
    "moves": {
        "1. d4": "Here's a game with several unexpected moves. I thought I gained an advantage, but he defended well.",
        "1... f5 2. c4 Nf6 3. g3 e6": "No Leningrad version this time. I'm going to teach the kids the Stonewall this fall, so I need some practice playing it, first.",
        "4. Bg2 Be7": "I want to get out of the center.",
        "5. Nf3 O-O 6. O-O d5": "My opening database says that playing d6 here (the classical Dutch) gives White a slightly less advantage than playing the Stonewall here, but then how would I learn it?",
        "7. b3": "One thing I've learned about the Dutch is the importance of playing Ne4. Seize the center.",
        "7... Ne4": "I'm not sold on this move either, but I can see the strategy. My pawns are on white squares. If he trades off my dark bishop, I'll have holes on d6 and f6 and e5 that are harder to defend. But it gives up using the bishop to put pressure on the center and defend the knight going to c3.",
        "8. Ba3 Nc6 9. cxd5": "Surprise!\nTo me, playing Ba3 signals that you're going to trade bishops, so I'm not sure why he chose this move instead.",
        "9... exd5 10. e3 Be6": "It looks like the bishop's taking the role of the pawn that just moved up, but I'm looking at getting him into the game from f7 over to the kingside.\n \nAll this time, I keep looking at playing Bxa3, too. My bishop's pinned, so it can't do anything on the kingside, and trading would push his knight to the side. But I haven't done it for a couple of reasons. Mainly, he can't develop the knight while his bishop is still on a3. Also, if he decides to capture me, I get my queen off the back row. I don't want to use one move to take his bishop and another move to bring my queen off the back row (especially since I haven't decided for sure yet where I want to put her).",
        "11. Qc1 Bd6": "I feel like I'm just tempting him to take my bishop -- but now, if he takes it, I'll either get to put my queen on d6, which I like, or I might even like to take back with the pawn (expecting to play dxe4 some day when he trades off my knight) and putting my rook on the same file as his queen.",
        "12. Nbd2 Rc8 13. Bxd6 Qxd6": "I decided that I wanted the queen to help defend e5 and c5.",
        "14. Qb2 Nb4": "I know that this will let his knight come up to e5, but I need to get out of the way so I can play c5 and counter the open line he has for his rook.",
        "15. Ne5 c5 16. dxc5 Rxc5 17. Ndf3 Rc2": "I taught the kids that rooks are always trying to get to the 7th rank.",
        "18. Qa3 Nxf2": "I looked at this move for a long time. It's one of those wild moves that completely changes the direction of the game. I still remember a tournament I played in back in the 80s. Every game reached a similar position, and they were all kind of dull; I think I went 2-3 in that tournament. I remember thinking that if I wanted to excel in chess, I should study and become an expert in that position and drive all of my games to that position.  And I knew if I did that, I'd get bored with chess and not be playing after a few years. My decision after that tournament was to try to avoid playing boring chess -- when I have a choice between a safe and an interesting move, I want to play the interesting move. And chess has always been fun for me using that philosophy!\n \nHere, there's no way he can take the knight of course. After  \n20. Rxf2       Rxf2\n21. Kxf2       Nd3+\nI get the queen with the discovered attack. I expect he's just going to play Qxa7 to stay even. But it means my pieces are near his king, and his queen is far from the action. So I had to go for it!",
        "19. Qxa7 Ne4 20. a3": "This is the messy, unbalanced position that I enjoy in over-the-board games, though they can make me a nervous wreck. Let's see, I have two isolated pawns, a bishop that's just a big pawn, and a piece and a pawn under attack. But on the plus side, I have a rook on the 7th rank and the initiative.",
        "20... Nc6 21. Nxc6 Rxc6 22. b4": "I didn't think he could play Qxb7 because my other rook goes to b8 and gets into the action.",
        "22... Ra6 23. Qd4 Rc8 24. Nh4 Rc4": "The other game I had with him was all positional. This one is all action. But, like I tell my kids, if you've got the initiative, that's often the biggest advantage you can have; it can even overcome being behind in material.",
        "25. Qb2 g6 26. Bxe4 dxe4 27. Rad1 Qe7 28. Rf2 Rc8": "I hated retreating, but I need to prepare for his doubled rooks, either by putting both of mine on that file or by counter-attacking.",
        "29. Ng2 Rca8 30. Rc1 Ra6xa3": "Why give me the pawn?\nBut I taught my students what Pandolfini says -- the best way to refute a sacrifice is to accept it. Also, he teaches to rely on your ability; if you don't see consequences, you have to play as if it isn't there. If there aren't any consequences, then you probably win. If there are consequences, well, then you've learned something.",
        "31. Qe5 Qe8": "Now my bishop isn't pinned.",
        "32. Rfc2 Bb3": "Here's another one of those sudden moves that changes everything. The queens are going to disappear, and I'm going to undouble his rooks.",
        "33. Qxe8+ Rxe8 34. Rc2c3 b5": "My bishop is safe for the moment, even though it's pinned. \nNow I can play Rea8 to protect the pawn and then Bc4 to free the bishop and shut down his file.",
        "35. Rb1 Ba2 36. Rxa3 Bxb1 37. Nf4 Rc8 38. Ne6": "I'm feeling pretty good here. I've got the extra pawn, and his are scattered. I have the bishop against the knight.",
        "38... Rc4": "But this move doesn't turn out as well as I'd expected. \nMaybe I need to play Kf7 or h6 first, something to not give him something to counterattack.",
        "39. Ra8+ Kf7 40. Ng5+ Kg7": "This turns out to be a bad decision. I thought I could hide among the pawns and avoid his mating threats. And I thought that I'd get my king down to g4 or even f3 with my own threats.",
        "41. Ra7+ Kh6 42. Nf7+ Kh5 43. Ne5": "I spent a weekend here making a spreadsheet where I plotted out about three dozen lines, looking at h6, rc1+, Rxb4, and Bd3. Most lines led to draws, some led to positions where I win (if he doesn't make the right move), and a couple led to losses. So I knew that I could force a draw if I needed to -- but I couldn't force a win.",
        "43... Rc1+ 44. Kg2 Rc2+ 45. Kg1 h6 46. Ra6 Ra2": "I ",
        "47. Rxg6": "That's the right move for him. Now I have to force a draw.",
        "47... Bd3 48. Rf6 Ra1+ 49. Kf2": ""
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=23216",
    "gameName": "Team match",
    "players": "wwwdotcom (1868) vs. chuckbo (1903)",
    "opening": "Dutch (A93), stonewall, Botwinnik variation"
}