{
    "moves": {
        "1. Nf3": "This is a White open. It is not e4 or d4. \nIt is time to take advantage of this open as it is NOT what I would ever do. Check my records. \n",
        "1... Nf6": "Mirroring an unusual open is okay for me like the English (aka Bird's Eye or Reverse Sicilian) I could have done something else as I have done against this nf3 (current game) against blitzkov.  I am just doing what I do to digest the game into a classical formation. Today a lot of people think by doing a move 2nd to e4 or d4 is some sort of shock operation.  I just look ahead and make it a classical game. ",
        "2. c4": "A sort of Bird's Eye or English or Reverse Sicilian move.  I am thinking to treat this as a Bird's Eye that develops after n3 open. ",
        "2... c5": "An English Open can always be successfully mirrored. And so I do it. ",
        "3. Nc3": "It appears White is definitely doing a Reverse Sicilian here. I will do the same. \n",
        "3... b6": "White's King Bishop is yet to develop.  White MUST evacuate the King's 0-0 box at this point. I have no threat anymore from White at this point. I am going to attack using Sicilian....",
        "4. e4": "Expected and anticipated. ",
        "4... Nc6": "My Sicilian in operation. In Sicilian the Queen knight has to go there. ",
        "5. d4": "I respect this move. White is advancing his IN (Infantry LIGHT) in a Battalion IN (LIGHT) Commander's orders!",
        "5... cxd4 6. Nxd4 Bb7": "Have to protect the knight if it remains. Have to have a bishop diagonal in case I deploy the knight....or just exchange....with development. ",
        "7. Be2 Nxd4": "Time to exchange the Queen's knight. And sucker the opposition's Queen toward the center of the board where she becomes vulnerable with what I can do! ",
        "8. Qxd4 e6": "This is a safe move for me on defense.  It reverts to my favorite Sicilian: The Shev!  I know by setting this pawn from e7 to e6 I am containing my \"Mirror or Reverse\" Sicilian to White.  Now I can further move into the Shev to make the center of the board askew from White Attack. ",
        "9. O-O": "But of course White Castles! \nI have yet to castle as Black! \nWhite seems to know something is a bit askance on the field here.....",
        "9... Bc5": "Attacking the Queen....",
        "10. Qd3 Qc7": "Developing my Queen.  One move in the right direction develops the most powerful piece on the board. ",
        "11. Bf3": "White is worried about the bishop I have on b2 and makes an adjustment. ",
        "11... h5": "Nothing wrong with advancing the LIGHT INFANTRY! ",
        "12. g3": "White does a sort of delayed fianchetto action here to either hide his bishop or advance pawns. In the former case it is okay in the latter the pawn has opened the King's Box and therefore subject easily from forward or diagonal attack. The fianchetto is only useful in the King's Indian Defense against d4:  In my time at the very least. ",
        "12... h4": "Time to take apart the fianchetto position without the bishop actually in front of the King...",
        "13. Bf4": "Attacking my Queen. But my Shev Sicilian Pawn (LIGHT INFANTRY) shall push him OUT! ",
        "13... e5 14. Nd5": "Instead of retreating another attack on my Queen! \nOf course the latest attack shall be handled by my King's Knight....",
        "14... Nxd5 15. exd5": "Expected and anticipated....",
        "15... exf4": "Now I can break easily into the King's Fianchetto (be careful to Fianchetto.  My advice is only use it in the King's Indian Defense or the Sicilian Dragon). Not when you are White and supposed to be on the attack. ",
        "16. Rfe1+": "Good move. The only move for White that is supposed to be on the attack! ",
        "16... Kf8": "I've already got the King's h Pawn passed ready to fix and kill. \nWhy worry about castling now?",
        "17. d6": "Another attack on my dear Bride (the Queen) and I always make sure she can fight without a threat to continue! Our wives love a fight! (OOOPS! I just got into the bane of having a wife!)",
        "17... Qc8 18. Re7 fxg3": "My King side pawns are in position to do real damage on the original fianchetto style chosen by White. He sends a down on the 7th rank (according to White) but my King's pawns are going to move forward to expose the White King. ",
        "19. Qf5": "A possible checkmate here. White is doing all White can to really create delay to his problems. Accolades! ",
        "19... Bxf2+": "But too late. The LIGHT INFANTRY has already crossed over into the No Man's Land all set up for my Bishop! \nCHECK!  This always halts maneuvers straightway! ",
        "20. Kh1": "I am still a under a possible checkmate but timing is key here...",
        "20... Bxf3+": "CHECK!\nIt always halts maneuvers....I said this before....",
        "21. Qxf3 Qc6": "I PIN the Queen trying to checkmate me with the rook. She is guarded by the SHEV PAWN in the SHEV SICILIAN which is my FAVORITE SICILIAN!",
        "22. Rxf7+": "I have the Queen (the back up) pinned to the King here.  I am checked and so I simply move the king one square. ",
        "22... Kg8 23. Qxc6 dxc6": "This exchange was necessary from White.  White is behind in points but there was nothing better to do than give up his queen at the expense of my faithful Bride.  I am saddened and will Eulogize her.  She was a QUEEN from beginning to inevitable end in this game. I doubt I'll find a better bride in the future so I think from this point on I shall remain single and die that way.",
        "24. Rc7": "Light Infantry moving forward..",
        "24... gxh2 25. d7": "White's Light Infantry moving forward....",
        "25... Bg3": "You have no idea how I felt to reinforce my own Light Infantry with my bishop. I love my pawns. I love pawn skeletons. I love what pawns do to sacrifice, fix and kill the Enemy. ",
        "26. Rxa7": "Good move. Rooks are good to block promotions.....",
        "26... Rd8 27. a4 Rh6": "No need to keep the King's Rook on base. He can move forward to operate at this time...",
        "28. c5 bxc5 29. a5 Rf6 30. Rd1 Kh7": "I had to move my King out of the way.  Bobby Fischer believed that making sure his King was safe FIRST was his FIRST obligation.  Don't get fancy with your King becoming vulnerable beyond means. \nThere IS one time you can make your King Vulnerable.  You must be White. You open e4 and Black responds e5 (the dull Ruy Lopez so popular everywhere beyond my sense of reason for who knows what) and you, RESPOND KING'S GAMBIT whether it is accepted or declined. I have an annotated game here on the KING'S GAMBIT.  I request recommend require all to to investigate and understand it. \n",
        "31. Kg2 Rf2+ 32. Kh3": "Got the opposition's King trapped and fixed. With assistance from The IN (LIGHT)...",
        "32... Rxb2": "White wants to make his IN (LIGHT) pawn a threat.  It IS a THREAT!  Never underestimate a passed pawn. ",
        "33. a6": "Another pawn PASSED over the No Man's Zone! Good for White! A double threat to ME! ",
        "33... Bb8": "Will the King take a pawn at the cost of his rook? I think not....",
        "34. Rb7": "Time to get that rook out of action. ",
        "34... Rxb7": "That rook (FIELD ARTILLERY) is out of action.",
        "35. axb7": "At a cost. But FIELD (LIGHT) Artillery are still in opposition! ",
        "35... Rxd7": "A short range mission for LIGHT FIELD ARTILLERY I did here. However, it is basically the end of the battle for White! \nWhite resigns because of trading the Rook. Infantry Pawn moves to Queen. "
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=47664",
    "gameName": "Team match",
    "players": "perangjantan (1857) vs. 9422m (1924)",
    "opening": "Reti opening (A05)"
}