{
    "moves": {
        "1. d4": "I thought I played very well on this game, but after used post game computer analysis, I found that I made a couple of mistakes. Fortunately, those mistakes were not critical and also my opponent did not play the best defence.",
        "1... d5 2. Nf3 Nf6 3. Bf4 c6 4. e3 Bg4 5. Be2 e6 6. h3 Bh5 7. O-O Nbd7 8. Nbd2 Be7": "White is a little better here.",
        "9. c4 O-O 10. Ne5 Bxe2 11. Qxe2 Nxe5 12. Bxe5 Nd7 13. Bg3 f5 14. c5 g5": "That is a risky move. But I did not like being squeezed, so I tried to attack.",
        "15. Qh5 Kh8 16. Nf3 Bf6 17. Bd6": "Things are not very nice now.",
        "17... Rg8 18. Qf7 g4 19. hxg4 fxg4 20. Nd2": "Ne5 is better.",
        "20... Rg6 21. Qxe6": "Not the best move for white because of Bxd4!",
        "21... Bxd4 22. Qf5 Bxc5 23. Bf4 Qe7 24. Nb3 Rf8 25. Qc2 Bd6 26. Bxd6": "This is the third inaccurate move of my opponent. White was better at oppening, but lost this advantage now.",
        "26... Qxd6 27. Nd4 Rh6 28. f4 Qf6": "I thought that this was a good move, but computer analysis says it is not very good.",
        "29. Rad1": "I think my opponent is wasting time, probably because of understimation of mate threats.",
        "29... c5": "Actually, Qh4 was better. But still, I am having a winning position here.",
        "30. Nb3": "Terrible move. White totally ignores the defence of the king.",
        "30... g3": "Clinical finish. White king is in a cage.",
        "31. Rxd5": "Desperate move. Rf2 is the only possibility to escape mate, but still the position is lost for white.",
        "31... Rh1+": "Nice finishing. Forces Rxh1, Qh4, Rg1, Qh2 mate.\n\nThings to learn from this game.\n\n1. When attacking, putting presure should be priority.\n2. It is very easy to lose advantage in the middle.\n3. Understimating mate threats is very dangerous.\n4. When in better position, relaxing causes bad moves.\n5. A bad move may turn good, if opponent does not exploit its weakness."
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=32853",
    "gameName": "Team match",
    "players": "zoki88 (1705) vs. atatabi (1735)",
    "opening": "Queen's bishop game (D02)"
}