{
    "moves": {
        "1. e4 c5": "Sicilian",
        "2. d4": "Andreaschrek gambit...",
        "2... cxd4": "... accepted.",
        "3. Nf3": "Common move",
        "3... d6": "Black doesn't try to defend has advance pawn.",
        "4. Nxd4": "... so that white equalises. Lancelot is now on the center.",
        "4... Nf6": "developping and menacing white's central pawn.",
        "5. Nc3": "logical move",
        "5... a6": "To prevent 6. Nb5",
        "6. Nb3": "Later or sooner, Lancelot will have to retreat (if 6. ... e5). ",
        "6... Nc6": "Developping",
        "7. Be2": "7. Bd3 or 7. Bc4 were other candidate moves. 7. Be2 is quieter. It gives possibilities of attacks by the d1 h5 diagonal",
        "7... e6": "Classical sicilian pawn structure",
        "8. O-O": "Long castle was another option.",
        "8... Be7": "Black doesn't opt for a fiancheto, more common in a Sicilian, probably to prevent 9. Bg5",
        "9. Be3": "... so that white opts for Be3 (only proper place for the DSB)",
        "9... O-O": "Black's developpement is allmost complete.",
        "10. Nd4": "I felt a bit cramped. Black's position is very solid and I see little attacking possibilities. At least 10. Nd4 enables 11. b3 ",
        "10... Qc7": "Probably to menace the c3 knight if 11.b3. It also aims at h2.",
        "11. Bf3": "Menacing c6, defending e4 in case of 11. d5 but forbiding 12. Nf3. White is stronger at the center but the position is not very comfortable. I have the impression that black has more available options",
        "11... Ne5": "Attacking on the center. Not a bad move but 11. Bd7, joining the rooks might have been better.",
        "12. Qe2": "To join the rooks",
        "12... b5": "Black advances on the queenside. He now has the initiative and white has not yet a clear plan, although I begin to imagine some lines, aiming directly at the black king.",
        "13. a3": "To take control of b4",
        "13... Bb7": "Bishop on the big diagonal",
        "14. Bf4": "Menacing the central knight and enabling the queen to protect the e4 pawn. ",
        "14... Nc4": "Goodmove, creating 2 threats (Nxb2 and e5 with fork attack between d knight and DSB)",
        "15. e5": "Initiating complex trades at the end of which I hoped that white's general position would be slighly better than black's one. White's plan is now clearer : attacking the king side where he can quickly have material superiority.",
        "15... dxe5": "beginning of the trading sequence.",
        "16. Bxb7": "This bishop on the big diagonal seemed the most dangerous white piece.",
        "16... Qxb7": "The queen now takes control of the big diagonal but I prefer to have it on the closed b file than on the c semi open file.",
        "17. Bxe5": "carrying on the trading sequence",
        "17... Nxb2": "Double edged move. It proved to be a strategical and tactical mistake. Black is one pawn ahead but the black knight is lonesome, far away from the center and will be easily attacked. White will occupate the b semi open file.\n17. ... Ng4, seriously menacing the white DSB would probably have been better.",
        "18. Rab1": "White is now one pawn late but black's b knight is under menace (if 18. ... Na4 19. Nxa4 and black's b pawn is pinned to the queen. If 18. ... Nc4 19. a4).",
        "18... Bxa3": "To prevent white's menace on the b file (see comment above) but probably a mistake. Black has not enough pieces left on the kingside.",
        "19. Bxf6": "To weaken the black king.",
        "19... gxf6": "Black has little other choice",
        "20. Ne4": "Menacing an attack with knight and queen on the isolated black king.",
        "20... Be7": "Black reinforces his kingside",
        "21. Rxb2": "So that white is now ahead in material, occupates the center, the black king is weak, both pawn structures aren't very good, black has one passed pawn, nobody controls the open d file, white has 2 unprotected pieces but the initiative and an immediate threat on the black king. I estimate that white is significantly better despite black's countergame possibiities.",
        "21... f5": "Creating a threat, taking control of one central square but opening the a1 h8 diagonal for the white queen.",
        "22. Ng3": "Little other choice, the knight has to stay on the kingside.",
        "22... Bc5": "Menacing the unprotected central knight.",
        "23. Qe5": "defending and attacking.",
        "23... Bxd4": "Black has no choice (if any other move 24. Qg7+ mate)",
        "24. Qxd4": "I estimated that the trade was in white's favour because of the lead in material.",
        "24... Qe7": "Reinforcing the kingside",
        "25. Re1": "The rook has to enter the battle. It pins black's e pawn, forcing black to defend.",
        "25... Qg5": "Unpining the e pawn and reinforcing the king.",
        "26. Rb3": "To menace 27. Nh5 Qxh5 28. Rg3+ or if black doesn't take, 28. Rg3 pinning the queen",
        "26... Rfd8": "menacing the queen",
        "27. Qa1": "The queen has to stay on the long diagonal. If it can protect the e rook at the same time, even better.",
        "27... Qg7": "Queen exchange wouldn't be so bad for white because of the material advance. On the other hand it blocks white's main threats so that I decided to try something else.",
        "28. Qc1": "The queen is not on the long diagonal any longer but it controls h6, ",
        "28... Rd4": "Good move : if white plays Rg3 (which is still the plan), black plays Rg4. Furthermore, it permits black to double his rooks.",
        "29. h3": "To prevent Rg4 and provide an escape to the queen, so that Q and R doesn't have to guard the rear line.",
        "29... Kh8": "So that the king and the queen are not on the same diagonal anylonger.",
        "30. Nh5": "Launching the final attack",
        "30... Qg6": "Menacing the knight and preventing 31. Qh6",
        "31. Qb2": "If 31. Qxh5 32. Qxd4+ Kg8 33. Rg3+ Kf8 . 34. Qh8 + Ke7 35. Qxa8 and black is 2 rooks late in material",
        "31... Rad8": "Only move I saw (if 31. ... e5 32. Rxe5)",
        "32. Rb4": "Menacing the pinned d4rook ",
        "32... e5": "Only move to defend the rook (the only squares where the queen could come are controlled by the knight).",
        "33. Rxe5": "The d4 rook is not pinned any longer but if 33. ... Rxb4 34. Re8+. If 33. ... Qxh5 34. Rxd4...",
        "33... Rd4d1+": "So that black opts for a counterattack.",
        "34. Kh2": "Only place but it's enough.",
        "34... Qd6": "Last try for black, pinning the e rook",
        "35. g3": "Simple defense. Black submits because :\nif 35. ... Qxe5 36. Qxe5+ Kg8 37. Qg7+mate(36. ... f6 only delay the mate)\nif 35. ... Qd4 36. Rxd4 and white is 6 points ahead in material.\nif black plays anything else (appart of 35. ... Rh1 36. Kxh1 which loses material without solving the prolbem) 36. Re8+mate."
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=52184",
    "gameName": "Team match",
    "players": "ptitroque (1766) vs. thefiddler (1819)",
    "opening": "Sicilian (B21), Andreaschek gambit"
}