{
    "moves": {
        "1. d4 d5 2. c4 e6 3. Nc3 c6": "This is the recommended way of playing the Semi-Slav according to American IM Larry Kaufman in his excellent book 'The Chess Advantage in Black and White' (McKay Chess Library, 2004). Kaufman's repertoire opening book is worth having a look at if you're searching for practical openings that aren't too analysed to death (Najdorf, Sveshnikov etc) or too drawish. The point of 3...c6 instead of 3...Nf6 is to avoid the Queens Gambit Declined exchange variation (4.cxd4) which is supposedly good for white because he hasn't yet committed his kings knight (to f3), so can more easily play f3 and e4 (after e3, Bd3 and Ne2-g3 etc). This move order means that black has to be prepared for the Marshall Gambit (4.e4) which is tricky but, for a clued-up black player, is probably not quite sound (though I have been on the wrong end of this in an over-the-board game!).",
        "4. Nf3 Nf6 5. Bg5": "Now black has a choice. 5...Be7 is super-solid and can lead to the Lasker Defence, the Classical or the Tartakower; 5...Nbd7 can lead to a Classical or Cambridge Springs set-up (black plays 6...Qa5, which usually gives black the two bishops (after Bxf6) but allows white to keep an edge). Instead, the move I chose is the whole point of the Semi-Slav's c6 and e6 (a plan to take on c4 either to hold onto the pawn with b5 or, after white plays Bxc4, to hit the bishop with b5 and follow up with Bb7, a6 and a later c5). This leads to a razor-sharp position.",
        "5... dxc4": "Black snags a pawn, but now white can set up a classic pawn centre (pawns on e4 and d4) with an immediate threat of 7.e5",
        "6. e4": ". . . which white does.",
        "6... b5": "This is the ambitious (and only real) way of playing, holding onto the pawn. It does, however, invite the enormous complications of the Botvinnik Variation, which is nicely explained in Glenn Flear's interesting book 'Starting Out: Slav and Semi-Slav' (Everyman, 2005). Please note, however, that this book is five years old, which is light years when it comes to Slav and Semi-Slav opening theory. Kaufman, instead, recommends avoiding the Botvinnik by playing 5...h6 (this is called the Moscow Variation). However, the Anti-Moscow Gambit (in which white gives up a pawn after 6.Bh4 g5 7.Bg3 dxc4) gives white a lasting positional advantage and is not easy to play against.",
        "7. e5 h6": "The only move to prevent the loss of a piece.",
        "8. Bh4 g5": "Ditto.",
        "9. Nxg5 hxg5 10. Bxg5 Nbd7 11. g3": "White's usual move here is 11.exf6, when 11...Nxf6 would leave black's remaining knight stuck in a terribly inconvenient pin and would not be recommended. After 11.exf6 black invariably plays 11...Bb7. Because white delays taking on f6 by one move, black has an interesting alternative to committing the bishop to the b7 square (according to Flear).",
        "11... Qa5": "This is it, to which Flear attaches an exclamation mark: 11...Qa5! Like most players, I LOVE to play moves with such a suffix.",
        "12. exf6 b4 13. Ne4 Ba6": "Flear says: \"The bishop on a6 defends the c-pawn and is part of a plan to rapidly mobilise the queenside.\"",
        "14. Be2": "I couldn't understand this move (and still don't). It seems entirely natural to play 14.Bg2 (especially after 11.g3). In the source game of this variation (in which Mikhail Botvinnik beat Arnold Denker in the famous USSR-USA radio match of 1945), Denker put his bishop on e2 and was crushed (and that was with the g-pawn remaining on g2). However, according to Flear, 14.Qf3 is the move to play, presumably to x-ray target the c6 pawn and keep the white bishop on the f1-a6 diagonal for the time being.",
        "14... Rd8": "I can't remember why I played this instead of 14...0-0-0. I recall seeing a number of games in which white managed to get a pawn to e7 with a fork on two pieces, and figured that the king might be useful in the centre. In hindsight, I'm not sure this was a great move.",
        "15. Qc1": "A double attack on the c4 pawn, but I'm not sure moving the queen away from the d1-h5 diagonal was a good idea (also, the queen is no longer defending the e2 bishop and the d3 square is weakened).",
        "15... c5": "In this opening black is pretty well committed to attack as the best form of defence. This move, as well as hitting white's only central pawn, also opens the a8-h1 diagonal for black's QB.",
        "16. d5": "White takes up the challenge.",
        "16... c3": "I figured that this move prevents white from castling (the e2 bishop is then hanging) and if 17.Bxa6 Qxa6, white still can't castle and has waves of weak white squares flooding around his king.",
        "17. dxe6 Ne5 18. exf7+": "I was expecting 18.e7 when (as mentioned earlier) a white pawn makes its way to the seventh rank with a fork. I'm sure this is weaker. It gives a check and, on the face of it, exposes the black king on the kingside. But the f6 pawn actually acts as a useful shield, and, meanwhile, black has strong central and queenside threats. One interesting variation could be: 18.e7 Bxe2 19.exd8=Q+ Qxd8 20.Qe3 (20.Kxe2?? Qd3+ 21.Ke1 Nf3 mate) 20...cxb2 21.Kxe2 bxa1=Q 22.Rxa1 Rxh2 23.Nxc5 when 23...Qd5 (centralising the queen) looks to be about equal.",
        "18... Kxf7 19. bxc3 Bxe2": "This means white cannot castle except 'by hand' (Kf1-g2-Re1). But that takes three moves and, right now, it's black who has a lead in development (and those white squares are still desperately weak).",
        "20. Kxe2 Qa6+": "Logical. The black queen moves to a white diagonal. Note how much control black has over the crucial d3 square.",
        "21. c4": "White hastens to block the diagonal (even if only for a moment). Why play this move, giving up a pawn? Firstly, 21.Ke1?? allows 21...Nf3 mate! And 21.Ke3?? leads to 21...Qd3+ 22.Kf4 Qf3+ 23.Kxe5 Re8+ 24.Kd5 Qxe4 mate (those white squares again). After 21...Nxc4, white can play 22.Kf3 and try to get the king to g2 (probably the best option). If 22.Kf1, then 22...Nd6+ wins the white knight. And 22.Ke1 invites 22...Ne5 targeting the f3 square and, more crucially, a royal fork on d3.",
        "21... Rd4": "I really liked this move. Yet again it's a tempo gainer (the obvious threat is 22...Rxe5+). Also, taking with the rook on c4 is now a very nasty threat because a) it gains a tempo by attacking white's queen on c1, and b) a subsequent discovered check with a rook move is brutal. Meanwhile, because the black knight is still on e5 the king plan of f3 and g2 is impossible.",
        "22. Nd2": "To stop the rook taking the c4 pawn.",
        "22... Nxc4 23. Ke1": "23.Nxc4 Rxc4 leads to the same assessment of the rook discovered check.",
        "23... Qe6+": "Now the black queen comes to the e-file with a gain of tempo. This wasn't a difficult move to find. A check, after all, is a check.",
        "24. Kf1 Nxd2+": "Bang goes the defender of the f3 square.",
        "25. Bxd2 Qd5": "And now a double attack (on the bishop on d2 and the rook on h1). Black's reply is forced.",
        "26. Ke2 Qe4+ 27. Be3 Rc4": "The rook finally arrives at c4 with tempo, and eyes up the c2 square. I thought this was a strong move, but didn't quite appreciate how strong until I started to examine the white queen's options for retreating from the attack.",
        "28. Qg1": "An unfortunate necessity. Other queen moves lead to a debacle: 22.Qb1 Rc2+ 23.Kd1 (Ke1 then Qxh1+) Qd3+ followed by mate on e2; 22.Qd1 Rc2+ 23.Kf1 (or e1) Qxh1+. 22.Qd2 or b2 and the black rook going to c2 is decisive.",
        "28... Bh6": "Obvious. The idea behind this move is to exchange the e3 bishop which is the glue holding together white's defence.",
        "29. Kf1 Bxe3 30. fxe3 Rc2": "The rook reaches c2 and it's all over because of the twin threats of 31...Qf3+ and 31...Qd3+ (note, those white squares again).",
        "31. Qf2 Qxh1+ 32. Qg1 Qf3+ 33. Ke1 Qe2#": "Fitting, I think, that mate is given on e2, the square on which white's KB should probably have never visited.\n\nIf you're looking for an opening to play against 1.d4 and 2.c4, then the Semi-Slav is rich in possibilities. Obviously, you have to be clued up on the Meran and the Anti-Meran (both covered in Flear's and Kaufman's books), but I've found that the positions you get with black always seem to be nicely unbalanced and offer chances of fighting for the initiative (a bit like playing the Najdorf Sicilian against 1.e4). The Nimzo-Indian also fits the bill against 1.d4 and 2.c4, but white can avoid it by not playing 3.Nc3. personally, I don't much like playing the black side of the Queens Indian (3.Nf3 b7), and the Bogo-Indian (3.Nf3 Bb4+) offers at least one forced variation which gives black a cramped position that, at best, is drawish. So my advice is: MUG UP ON THE SEMI-SLAV: (\"there is one defense that does it all – the Semi-Slav\" says Kaufman)."
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=32214",
    "gameName": "Team match",
    "players": "marcosnatal (1937) vs. sligunner (2086)",
    "opening": "QGD (D31), semi-Slav, Noteboom variation"
}