{
    "moves": {
        "1. e4": "Based to that game i made an chess puzzle. It's one of my best black game to this moment. Weak position of black king was not fully used. White made three big mistakes ended in five moves mate on lone white King. I hope you like it, it's not upper level game, still is one of my favorites.",
        "1... e5 2. d4": "This was my move from another game, still i know that it is easy to destroy this formation, though I didn't want to show it to my opponent.",
        "2... d5 3. dxe5 dxe4": "Exchange...",
        "4. Qxd8+ Kxd8": "...and I can forget about castling.",
        "5. Nc3 Bb4": "pinning, but my plan is to exchange till I can hide king",
        "6. Bd2 Bxc3 7. Bxc3": "Correct.",
        "7... f6 8. O-O-O+": "castling with check I could do only...",
        "8... Ke8": "...such a movement, it sounds like bad dream to lost moves in that silly way.",
        "9. Ne2 Nd7": "Pawn on e5 was big pain, bigger then help of e4 pawn.",
        "10. Rd4 fxe5 11. Rxe4": "For me cool exchange.",
        "11... Ngf6": "Protecting not directly is the second strongest movement in chess(first is check)",
        "12. Rc4": "What's the point here?",
        "12... Nd5 13. g3 Rf8 14. f4": "Good, still I need exchanges with weak position of king.",
        "14... exf4 15. Re4+": "That's why I need to travel long distances...",
        "15... Kd8 16. Bxg7": "Strange to not capture f4, This pawn is more dangerous then white think about it.",
        "16... Rf7 17. Bd4": "Not much have changed, only that he missed opportunity to take my pawn on f4",
        "17... f3": "F4 live loosen position, I feel better.",
        "18. Ng1": "OK, why? This pawn in danger will just only advance. Knight coming on starting position and tower with no idea how to quit. It's mistake that will cost white two movements, or even more.",
        "18... Nd7b6": "Don't need to hesitate, I prefer to dance with knights.",
        "19. Re1": "What was that?? I Can't believe my eyes! Second of big shocks this game! this tower gone where i wanted it to go just in dreams.",
        "19... f2": "Courage of pawn is famous in chess. I have won a piece with not much afford, just forking his mistake.",
        "20. Rd1 fxg1=Q": "Queen, he must beat.",
        "21. Rxg1 Be6 22. Be5 Ke7": "freeing last tower and knight with protection of bishop.",
        "23. Bg2 Rd8 24. h4 Ne3": "In this moment I thought about exchange pieces.",
        "25. Rde1": "in this moment I saw weak position of lonely king",
        "25... Nbc4": "Preparing assault. Just to move my tower on d2 and hope for Bishops to stay far away.",
        "26. Bxc7": "Greedy bastard, maybe he will get more...",
        "26... Rd2 27. Bxb7": "...greedy! Big mistake. Bishop should stop on e4. It was the greediest movement ever. I didn't even imagine this could have happen.",
        "27... Rxc2+": "Mate in Five moves",
        "28. Kb1 Rxb2+ 29. Kc1 Rc2+ 30. Kb1 Na3+ 31. Ka1 Rxa2#": "That was the end. Hope you like it. My opponent made three big errors, and didn't took full advantage of my noncastling king. Nice game with good ending. I hope you like it."
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=26979",
    "gameName": "Team match",
    "players": "musica52 (1271) vs. polisam (1381)",
    "opening": "Centre game (C21)"
}