{
    "moves": {
        "1. e4": "1. e4 is considered best by test; but honestly, it is no better than 1. d4 or 1. c4.  Each of these moves lead to entirely different types of game.\r\n\r\nThe initial move of e4 usually leads to an open game that is generally highly tactical in nature.  If you are a good tactician, then this opening should be one of your favorite tools as white.",
        "1... c5": "Sicilian",
        "2. Nf3": "Normal response, but not the only one possible.  \r\n\r\nAn immediate 2. d4 stakes out the center and is already protected by the Queen.  Another good choice is 2. c3, but that can be a little tricky even though it is sound.  Some people like to try the bishop opening with 2. Bc4.  The bishop second move is a little less clear of a choice, but can be effective when used as a surprise weapon against an unprepared opponent.",
        "2... d6": "2. ... d6 is one of the most common responses by black.  It's primary purpose is to prevent e5 so that Black's knight can safely move to f6, not necessarily to support the pawn on c5.  \r\n\r\nThis is a traditional fight for control of the center.  Generally control of the square d5 is extremely important in the Sicilian.  Black must use incremental steps when contesting this square.  He must prepare before venturing.",
        "3. d4": "This move opens lines for the Queen's bishop and immediately creates tension in the center.  The question is put to Black as to whether White retains the strong central pawns.\r\n\r\nA strong central pawn duo is usually an immediate strategic goal for White in many openings.  Here White does not expect to keep it.  White is merely using it for transitional purposes.",
        "3... cxd4": "3. ... cxd4 is the smart exchange. ",
        "4. Nxd4": "4. Nxd4 maintains material equilibrium while advancing the knight for possible further attack later in the game.",
        "4... Nf6": "This was prepared for earlier by 2. ... d6.",
        "5. Nc3": "5. Nc3 is necessary to protect the pawn on e4.",
        "5... g6": "This is the signature move for the Dragon variation.  9 times out of 10, Black's next move will be Bg7 to complete the fianchetto.\r\n\r\nWhite's next move is an important decision that will determine the flow the game.",
        "6. Be3": "This helps clear the first rank for a possible queen-side castle, O-O-O.  Its draw back is the potential Ng4 by Black, attacking the bishop immediately.  The bishop is currently safe until the presumptive 6. ... Bg7.\r\n\r\nIf 6. ... Ng4, then 7. Bb5  and Black is in deep serious trouble.   Black has only four possible moves:  Nc6, Bd7, Nd7, and Qd7.  With Qd7, the bishop simply takes.  With Nc6, 8. Nxc6 bxc6 9. Bxc6  forking the King and Rook.  With either Bd7 or Nd7, White's Queen takes the knight on g4.",
        "6... Bg7": "This move is almost routine.",
        "7. f3": "This is the signature move for the Yugoslav Attack against the Dragon Variation. \r\n\r\nIt prevents Black from moving his knight to g4, which would cause some minor problems for White.  It also frees the white knight on c3 from mandatory guard duty.  \r\n\r\nAlthough it is not the only viable strategy, the Yugoslav Attack is considered White's best answer against the Dragon.  The 'motis operandi' is clear.  White will castle queen-side and push either the f, g, or h pawn - depending upon what Black does.  The h pawn sortie is a natural attack upon the King's fianchetto position.  Such an attack is usually effective with the proper timing.",
        "7... Nc6": "This and the next few moves are normal, but their order can be slightly altered.",
        "8. Qd2": "This Queen move is another attack upon the fianchetto position.  If Black wants to castle, he should do it now.",
        "8... O-O": "The position is nearly ripe for an h pawn attack.  White should prepare further first.",
        "9. O-O-O": "This was routine for me but was not main line.  The sharpest continuation would have been Bc4 before the castle.  Frankly, I've always gotten away with this move in the past.   It is very playable.  In hind sight, this move is probably not the best.  Yet, there is nothing particularly wrong with it either.\r\n\r\nI was looking for a win instead of a draw.  This move carries the game in directions other than normal.\r\n\r\nNormally, the sparks fly in this opening with opposite end attacks upon each others Kings.  The hunt for each others King becomes a race.  Timing is important.  The tactics can be mind bending!",
        "9... d5": "9. ... d5 is somewhat more common these days, but would have been considered unusual in the past.  Instead of developing other pieces, Black moves the pawn a second time during the opening.  Granted the opening is almost finished, but the thrust does not appear to be natural at first glance.  Appearances can be deceptive.\r\n\r\nThe move prevents the sharpest Yugoslav continuation of 10. Bc4 (with a slight move order change).  The most significant aspect of this move is that the natural response of 10. exd5 leads to a series of exchanges that White (wanting to win at all costs) would prefer not to occur.\r\n\r\nI am one of those that used to think the Dragon Variation was fatally flawed.  Not anymore.   This  9. ... d5 variation is one reason why.",
        "10. h4": "I thought about 10. Kb1, but quickly dismissed it.  I thought about g4, but was uncomfortable with it.  I considered playing 10. exd5 again, but could not dismiss my dislike for settling for a draw against the Dragon after all the resulting exchanges (I guess it was a pride thing).\r\n\r\nI decided to play thematic.  I'm used to applying my intuition in a given situation.  Unfortunately, I was wrong this time.  Since h4 against the Dragon usually works,  that's what I played.   \r\n\r\nPerhaps h4 in of itself was not too bad...but I started the theme and continued it until I realized it was wrong.  \r\n\r\nI should have known better.  The safe push of the pawn to d5 is often a significant strategic goal for Black in a number of Sicilian variations.  By playing h4 at this particular moment, I gave the pawn safe passage.  I should have played 10. exd5.",
        "10... dxe4": "I kind of suspected this would happen and was hoping it would not.  Most people who played me in the past would likely initiate the thematic 10. ... h5 in response - which would have given me wiggle room to win the game.",
        "11. h5": "I decided to play with confidence.   This strategy probably works better over the board, then it does with correspondence.  I thought my opponent would second guess himself and perhaps he did.  The problem is that there was enough time for him to recover from any doubts he might of had.",
        "11... Nxd4": "At this point, I knew I was losing control over the center.  It was too late to do anything about it.   These exchanges were about to kill my chances and I knew it.",
        "12. Bxd4": "Forced",
        "12... e5": "12.  ... e5!!  This maintains Black's initiative in an unclear position.  It is especially good because it is sacrificial.",
        "13. h6": "This game has just turned into 'Poker'.   With 13. h6, I added an additional bet into the pot.",
        "13... exd4": "Black now has good control over the center and the initiative.  White is in trouble, but I still thought a draw was possible.",
        "14. hxg7": "...maintains a modicum of material equality.",
        "14... Re8": "Black has a strong attack down the center of the board.  Re8 reinforces it.",
        "15. Nxe4": "White must contest the center, even though this results in several isolated pawns.",
        "15... Nxe4": "Now I must scramble for trades in material to maintain a draw.  My problem is Black's King-side pawn formation.  My only chance is promotion along the queen-side.  Generally, you don't want to push the pawns on the side that you castled; but it is required here in this position.",
        "16. fxe4": "Forced.",
        "16... Qf6": "This maintains connection with the center while evacuating the d8 square for an eventual Rad8 move.",
        "17. Qxd4": "I'm hoping for a queen trade here.  It was possible that Black would have been satisfied with a draw; but he didn't take it.",
        "17... Qf4+": "A queen trade would have given White some control over his destiny.  This move allows Black to finish development with initiative.",
        "18. Kb1": "I was under significant pressure here.   I needed some improvement along the queen-side before allowing additional exchanges.",
        "18... Bg4": "This seems almost too easy for Black.",
        "19. Re1": "No matter what I do, White is in trouble.  Development of my bishop is imperative, but Black is not allowing me enough time to do it.",
        "19... Rad8": "This move was basically forced, but it is still good for Black - despite dropping the a7 pawn.",
        "20. Qxa7": "At this point, I felt pretty good.  I thought I had weathered most of the storm and had improved my queen-side position.  Now I could afford to trade pieces, right?  Wrong.  \r\n\r\nHolding onto the g2 pawn was very important.  It was going to be difficult doing so, while developing the bishop at the same time.  I'm 'not out of the woods yet'.",
        "20... Qxe4": "I cannot take the queen...else it is checkmate with Rd1#.",
        "21. Rc1": "Forced.  Black maintains his initiative.  My material advantage is no advantage at all.",
        "21... Rda8": "21. ... Ra8!\r\n\r\nI'm being chased into oblivion.",
        "22. Qc5": "This was the only tactically safe move.",
        "22... Rec8": "Black continues to place additional pressure on my queen-side and King.",
        "23. Qd6": "There are no good answers on this move.  After 23. ... Rxc2, things look bad for White.  I'm just hoping he doesn't see that move.  \r\n\r\nThe alternative of 23. Qb5 is really no better with similar results.",
        "23... Rxc2": "Well, that was no fun!",
        "24. Rxc2": "I was still thinking that I had hope, but I needed to get rid of Black's b pawn.",
        "24... Bf5": "Where does this guy come up with his moves!!!  Now I've lost the a pawn and/or the g pawn.  Although the move was not difficult to find, I was getting upset.  \r\n\r\nI'm in worse trouble in this position than I've ever been in this game so far.",
        "25. Bd3": "This is forced; but appears to be an excellent move.  Yet, it is too little too late.  I had a feeling that my opponent was probably thinking the same thing I was during his last move...\"Where does this guy come up with these moves!!!\" LOL.",
        "25... Qxd3": "This is the only winning move for Black.  If anything else, then I could have crushed him.  I didn't expect anything else.",
        "26. Qxd3": "Now we exchange down into a complex endgame.  Since White will have to retake on c2 with the King, Black will be able to take the a pawn.  It sucks to be White at this point.  It really does!",
        "26... Bxd3": "The pin forces a favorable exchange for Black.",
        "27. Rd1": "I tried to complicate the position.  \r\n\r\n27. Rc1 leads to ... Rc8 28. b4 Kxg7 29. Kb2 Rxc2  30. Rxc2 Bxc2 31. Kxc2 Kf6.  The Black King can support his b pawn and the three pawns on his King-side can easily force their way through my single g pawn.  Black would have to play accurately, but it can be done.  Perhaps this was the best choice anyway.  \r\n\r\nYet, I felt I needed a piece on the board to help force my queen-side pawn to promotion.  So, I did it this way.",
        "27... Bxc2+": "King takes and the a pawn is dropped.",
        "28. Kxc2": "Now White must find a way to capture Black's b pawn.  I won't talk about the King-side.  It is in pretty bad shape.  If I can promote safely, then there is still a chance.",
        "28... Rxa2 29. Rd7": "I need immediate threats for counter-play.",
        "29... b6": "The plan was to keep the pawn moving until it is easily captured. ",
        "30. Rd6": "If I can block the Black king away from the action with my rook, then I might be able to hold the g pawn unless...",
        "30... Ra5": "Black decides to give up the b pawn to gain position on the g pawn.",
        "31. Rxb6": "I take because there isn't much I can do to stop it without jeopardizing my position.  Besides, I now have a chance to promote and that is what I wanted.",
        "31... Rg5 32. b4 Rxg2+": "This is becoming a race and I need to gain time for better positioning of my Rook.   This isn't easy.",
        "33. Kc3": "My King guards b2 so that Black cannot easily get behind my b pawn,",
        "33... h5": "The race is futile unless I can gain some time.",
        "34. Rf6": "This move may seem strange, but it allows me time to get behind my  b pawn.  The g7 pawn was toast regardless; and, I wanted to slow down the movement of his h pawn through distraction.",
        "34... Kxg7": "It worked.",
        "35. Rf1": "I could not get behind the h pawn because the black King would have prevented it.  Even if I could have exchanged my pawn with one of his,  the resulting R vs RPP endgame was winning for Black.",
        "35... h4": "The race resumes.",
        "36. b5": "There is not much I can do but push my pawn.",
        "36... Re2": "Black realizes just in time that his rook was slightly out of position.",
        "37. Rb1": "I'm going to push my pawn anyway.  It is my only chance.",
        "37... h3": "The race resumes again.",
        "38. b6 g5": "Two pawns against a lone rook is winning for Black.  He knows what he is doing.  I thought I might have some advantage in the endgame, but no.",
        "39. b7": "There is nothing else to do.",
        "39... Re8": "Now even if he sacrifices his rook to capture the pawn, he still has enough to win.  ",
        "40. Kd3": "I'm thinking that perhaps I can get my King into play once that sacrifice occurs.  It is a long-shot.",
        "40... g4": "I was kind of hoping that he would play 40. ... Rb8 allowing my King to get into position.  I was just one small move away!!  ...but  could not get there from here.\r\n\r\nP.S.  I had a lot of hope in this game.  Sometimes a hope and a prayer are simply not enough.",
        "41. b8=Q": "The rook blocked the movement of my King.  This sacrifice is the only way to unblock it.",
        "41... Rxb8 42. Rxb8": "My material advantage means nothing.",
        "42... h2": "I cannot stop the promotion, but...",
        "43. Rb1": "I can slow it down in an effort to get my King in better position.",
        "43... g3": "The lone rook against two pawn loses, unless...",
        "44. Ke3": "I can get my King involved.",
        "44... g2 45. Kf2": "Unfortunately, I am one move too short.",
        "45... h1=Q": "I know he expected me to take and then he re promotes on h1.",
        "46. Rg1": "But I have one last trick up my sleeve!!",
        "46... Kf6": "That does it.  Now I know for sure he knows how to handle a single pawn endgame.  He is getting his King out front early.",
        "47. Rxg2": "Perhaps he won't sacrifice the Queen.",
        "47... Qxg2+": "But he does.",
        "48. Kxg2": "There is nothing else to do.  \r\n\r\nThis is a simple endgame that he knows how to handle.  Against a much lower ranked player, I would continue.  Shajmaty's rating had risen above 2210 since the beginning of this game.  It was best to resign with some dignity. \r\n\r\nWhen you think about it, this really was an incredibly good game.  The end position looks closer than it actually is from the perspective of an untrained eye."
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=18306",
    "gameName": "Team match",
    "players": "lighttotheright (2181) vs. shajmaty (2190)",
    "opening": "Sicilian (B75), dragon, Yugoslav attack"
}