{
    "moves": {
        "1. c4": "With c4 my opponent tells me that he likes slower, more positional games.",
        "1... Nf6": "I show that I am going to use an Indian defense.   If he plays d4 straight away then I can play ...e6...Bb4 going into the nimo-indian.  If he plays Nf3 and avoids Nc3 then I can go into my usual Kings Indian set up.",
        "2. Nf3 g6": "Showing the King's Indian",
        "3. b4": "This is Reti's setup against the King's Indian.  He won a famous game against the great Capablanca with this opening.  You can see it at chessgames.com ( http://www.chessgames.com/perl/chessgame?gid=1102101 )\nThe idea behind this move is to gain space on the queenside, since black has made no move in the center.  This keeps with the hypermodern approach.",
        "3... Bg7 4. Bb2 O-O 5. e3": "This move may not be the best.  I think that it is best to develop the bishop on the h1-a8 diagonal.  on the f1-h6 diagonal the bishop does not do much. ",
        "5... c5": "I now attack the white \"center\".  I can't let white develop completely freely or he will take over the whole board.  So I will fight for my space.",
        "6. bxc5": "If 6.b5 then the Kings bishop is really in bad shape, and white would lose his play on the queen side.",
        "6... Na6": "To regain the pawn, maybe not the best.  Qa5 was better.  In my research I found that this position had come about once before, with Petrosian playing black ending in a draw.\n\nhttp://www.chessgames.com/perl/chessgame?gid=1279145",
        "7. d4 b6": "Here I give up material for the initiative and free development.",
        "8. cxb6 Qxb6 9. Qb3": "Can't trade queens as I am down material",
        "9... Qc7 10. Be2 Rb8": "Tempoing the queen and gaining access to the open b file",
        "11. Qa3 d6 12. O-O Qb6": "Continuing to take over the b-file.",
        "13. Bc3 Bf5": "With the bishop on c3 guarding the dark squares on the queenside I start to take over the light squares because White's Kings bishop is inactive.",
        "14. Nbd2 Nc7 15. Rab1": "A mistake, dropping the exchange.  But things were already becoming difficult for white.  He should have tried to use the extra material and open the center, luckily for me though I had him completely concerned about my side of the board.  (The joys of playing 15xx players!)",
        "15... Bxb1 16. Rxb1 Qc6 17. d5": "This move weakens the dark squares on the queen side.  Definitly not good when I am already up the exchange, and penetrating on the queen side.",
        "17... Rxb1+": "Trading material, good when up material",
        "18. Nxb1 Qb6 19. Nbd2 Na6 20. h3 Nc5 21. Bd4 Qc7 22. Ne1 Rb8": "Again using the b-file.",
        "23. Nd3 Nfe4 24. Bxg7 Kxg7 25. Qc1 Nxd2 26. Qxd2 Rb1+ 27. Kh2 Ne4 28. Qc2 Qb6 29. f3 Nf6 30. c5 dxc5 31. Qxc5 Qxc5 32. Nxc5 Nxd5": "Now I am up two \"points\".  But sometimes these endgames can be hard to convert if all the pawns are on one side.  So I will play to keep my QS pawn.",
        "33. e4 Nc7 34. Nd7 Rb2 35. Bc4 Nb5 36. Ne5 e6 37. Nc6 a6 38. Ne5 Nd4 39. Bxa6 Rxa2 40. Bc4 Rc2 41. Bd3 Rb2 42. Kg3 Kf6 43. Ng4+ Ke7 44. Ne3 Ne2+ 45. Kg4 Rd2 46. Bb5 Nd4 47. Ba4 Re2 48. Kf4": "A mistake losing another pawn.",
        "48... g5+ 49. Ke5 Nxf3+ 50. gxf3 Rxe3 51. Bd1": "This just loses a piece.",
        "51... Rd3": "Game over.  Some may ask why did he resign?  Well....  if the bishop moves, say Bc2 then f6#!  I have (with some help) formed a mating net!"
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=8495",
    "gameName": "Team match",
    "players": "bubbrubb (1525) vs. stringplayer92 (1535)",
    "opening": "English opening (A15)"
}