{
    "moves": {
        "1. e4 c5 2. Bc4 e6 3. Nc3 Nc6": "Slightly strange Sicilian for me, not quite sure how to develop this one, but looking at the obvious d5 at some stage.",
        "4. Nf3 Nf6": "Possible threat of 5. e5 here, but I played this anyway -- would be interested to know if 5. e5 is a genuinely nasty move (I was hoping that 5... Ng4 would be enough to counter).",
        "5. d3 d5 6. Bb3 dxe4": "This exchange is good, as if 7. Nxe4 Nxe4 8. dxe4 Qxd1 9. Kxd1 leaves white unable to castle with the king stuck on an exposed central file.",
        "7. dxe4": "Ah yes, that makes more sense, but this works too, keeping the ability to castle in exchange for a loss of material.",
        "7... Qxd1+ 8. Nxd1 Nxe4": "Black is now a pawn ahead.",
        "9. O-O Be7 10. Ba4 Bd7 11. Re1 Nf6": "Consolidating position.",
        "12. c3 O-O 13. Bxc6 Bxc6 14. Ne5 Bd5": "Wanting to keep hold of both bishops, but I think Ra-c1 would have been better...",
        "15. Bg5 h6": "Forced, gives an obvious combination for Black to remove a bishop and double my pawns.",
        "16. Bxf6 Bxf6 17. Nd7 Rfd8 18. Nxf6+ gxf6": "Kind of unpleasant, but at least I still have one more pawn and the open file.",
        "19. Ne3 Bc6": "Expecting Ra-d1 now, but Ng4 is an obvious possibility, attacking both pawns.",
        "20. Ng4": "As expected, but I cannot see easily how white will continue to attack after Kg7 -- white really wants to get a rook onto the d file to contest for its control.",
        "20... Kg7 21. h3": "Really unsure about this move. I simply don't understand the purpose apart from protecting against a back rank mate?",
        "21... Rd2": "Awkward choice for white, Re-d1 to sacrifice the b2 pawn and get to Rd7, or protect the pawn.",
        "22. Rab1": "Chose to protect the pawn, but tied up another rook in the process.",
        "22... b5": "Protecting the c4 square, partly from the white knight as I don't want it to become any more useful than necessary.",
        "23. a3": "Presumably this is to prevent b4, but I think, again, that white needs Re-d1 to contest for the d file.",
        "23... Rad8 24. b4": "Ah, ok, presumably a3 was to stop the a pawn from hanging after this advance. Now I suspect white wants cxb4 axb4 so that he can attack on the a file.",
        "24... c4": "so I will lock the position. Removing the d3 and b3 squares from white, this should make it very hard to defend both the a3 and c3 pawns.",
        "25. Ne3": "This is the move I played b5 for, but now the c4 pawn is well and truly awkward for white (though the knight sacrifice is a possibility, 26. Nxc4 bxc4 27. b5 is interesting). d3 looks like a nice place to get my bishop if I can now.",
        "25... Rd8d3": "Simple threat against the c3 pawn.",
        "26. Rec1": "Defends, but now Ra2 seems to win a pawn, either after Ra1 Rxa1 Rxa1 Rxc3 or simply Rxa3",
        "26... Ra2 27. Rba1 Rxa1 28. Rxa1 Rxc3 29. Kh2 f5": "Now two pawns up, trying to remove white's ability to advance by taking the g4 square away from the knight.",
        "30. g3 Kf6 31. h4 Bf3": "The position is now relatively seized up for the moment. h5 is needed to fully lock the kingside, but it is not urgent.",
        "32. a4 a6": "bxa4 would definitely be bad, but the exchange if white captures is quite reasonable for white.",
        "33. Rb1": "A strange move, losing the b4 pawn. 33... Rb3 34. Rxb3 instead would simply lose the game as the b pawn would queen.",
        "33... Rb3 34. Rc1 Rxb4 35. axb5 axb5": "Now three pawns up with a lot of queenside pressure.",
        "36. Ra1 Rb2": "Threatening Rxf2 and allowing the c and b pawns to advance.",
        "37. Ra5": "I can get a free pawn and keep b5 defended -- now 4 pawns ahead.",
        "37... Rxf2+ 38. Kg1 Rb2 39. Kf1 b4": "Time to start the advance. 40. Nxc4 fails to 40... Be2 ",
        "40. Ke1": "Blundering the knight for nothing.",
        "40... Re2+": "Game annotation for team benefit --"
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=10157",
    "gameName": "Team match",
    "players": "marillion_pt (1511) vs. topazg (1510)",
    "opening": "Sicilian defence (B20)"
}