{
    "moves": {
        "1. e4 e5 2. Qf3": "Going for the old four move.",
        "2... Nh6 3. Bc4 Nc6 4. d3": "White wants to take the knight to bring a quick end to the game.",
        "4... Nd4": "Black doesn't fall for that.",
        "5. Qd1": "Black is now better developed.",
        "5... b5 6. Bd5 c6 7. c3 cxd5 8. exd5 Bb7": "The knight is worth more than that pawn.  I am partial to dNf5.\n",
        "9. cxd4 Bxd5 10. Qe2 d6": "No!  BxPg2 gives black a pawn and rook.",
        "11. f3 Be7 12. dxe5 dxe5 13. Qxe5 O-O 14. Qg3": "Ooh, you know what a totally AWESOME move for black is?  Bh4 pins the white queen.",
        "14... Nf5": "So sad black didn't see it.  Any time the queen and king or rook and king are in a line, a bishop pin ought be sought.",
        "15. Qe5 Qd7 16. Nc3 f6": "Way better is Rfe1.  If the white queen stays put, Be anywhere pins the biddy.",
        "17. Qxd5+ Qxd5 18. Nxd5 Bd6 19. b3 Rfe8+ 20. Ne2 g5": "OMG no.  NxPf6+ trades knight for a tasty black rook.",
        "21. Nxf6+ Kf8": "I like Kf7 better.",
        "22. Bxg5": "Ok, so white prefers pawns to rooks!",
        "22... Bb4+ 23. Kf2 Re6 24. Nxh7+ Kf7 25. Nf4 Bc5+ 26. Kf1 Ne3+ 27. Kf2 Nc2+": ":) I would have suggested this, but down 7 black should not take the rook until Re6 is safe.",
        "28. Kg3 Rg8": "?  Why would white not take the rook?",
        "29. Kh4": "Crazy.  Rac1 attacks the threatening knight.  Black loses it or the bishop.  Or NxR also yields three points--either way.",
        "29... Be7": "All even trades favor white.",
        "30. Nxe6 Kxe6 31. Rac1 Nd4 32. Bxe7 Rh8": "I guess white can choose bishop or knight.  Except Bc5 rescues the knight.",
        "33. Rce1+": "...as does that.  Knight is saved.",
        "33... Kf5": "...my mistake.  White cannot save that knight.",
        "34. g4+ Kg6 35. Re4": "Ooh, black likes NxPf3+",
        "35... Rxh7+": "Ok too, maybe.",
        "36. Kg3 Nc2 37. Re6+ Kf7 38. Rc1": "Ooh, rook for knight!  Yes!",
        "38... Kxe6 39. Bc5": "White, still ahead, is better off trading.",
        "39... a5": "Oh he'll no.  Rook protected that pawn, which was less valuable than the knight anyway.",
        "40. Rxc2 b4": "Nope.  Now white cleans up both pawns with Bb6.  ",
        "41. Re2+ Kd5 42. Bb6 Rh8 43. Bxa5 Rb8 44. f4 Rb5 45. Re5+ Kc6 46. Rxb5 Kxb5 47. Bc7 Kc5 48. g5 Kd4 49. g6 Kxd3 50. g7 Kc2 51. g8=Q Kb2 52. Ba5 Ka3 53. Bxb4+ Kxb4 54. f5 Ka3 55. b4 Kxb4 56. f6 Ka4 57. Qb3+ Ka5 58. f7 Ka6 59. f8=Q Ka7 60. Qfb8+ Ka6 61. Qa3#": ""
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=56215",
    "gameName": "Team match",
    "players": "nathansa (928) vs. psycho422 (1039)",
    "opening": "KP (C20), Napoleon's opening"
}