{
    "moves": {
        "1. e4 d5 2. exd5 Nf6 3. d4 Bg4 4. Be2 Bxe2 5. Qxe2 Qxd5 6. Nf3 Nc6 7. c4 Qh5": "Qf5 seems a bit better. After 7...Qf5 8. f5 Nb4 9. Nd4 Qe4 black is not in too much trouble. After 7...Qh5, the white pawn thrust will prove to be considerably more problematic.",
        "8. d5 Nb4 9. a3 Na6": "Without support from the queen, the knight is now pushed back completely to the edge of the board, without great prospects.",
        "10. b4": "Cutting off c4 to keep the knight out of the game",
        "10... O-O-O": "castling now means the white knight has a safe retreat at b8 in case white prepares b5 (for example by playing Be3), but given white's next move, it may have been better to go for g6 first, possibly allowing me to castle short instead after developing the dark-squared bishop.",
        "11. Ne5": "effectively winning a pawn and an important one too: after the c-pawn has fallen, d6 will be a great square for the white knight.",
        "11... Qxe2+ 12. Kxe2 Rg8": "Unable to really prevent the knight from getting to f7, the only thing to do against the fork, is to move both rooks.",
        "13. Nxf7 Re8 14. Ng5 h6": "I don't want to play e5 first, since that would turn into a weakness after Ne6",
        "15. Ne6 g5 16. Nd2 Bg7 17. Bb2 Nh5 18. Bxg7": "I don't think this trade is necessarily ideal for white. Black now gets to get his knight in place to trade the annoying one on e6 away. If instead 18. Rb1 Bxb2 19. Rxb2 Ng7, white has gained an extra tempo compared to the game, used to get a rook the second row, protecting f2, which certainly seemed relevant later on in the game",
        "18... Nxg7 19. Nxg7": "Allowing white to trade creates a weak pawn on e6, that will be hard to defend.",
        "19... Rxg7 20. Nf3": " ",
        "20... e6": "resolving a weakness and creating some space for my rooks. While I am still a pawn down, the higher activity of my rooks might create enough pressure to reach equality at some point.",
        "21. dxe6 Rxe6+ 22. Kd3 Rd7+ 23. Kc3 Re2": "Now entering the second row for strong pressure. As we can see, having the rook on b2 would have been strongly advantageous for white.",
        "24. Rhf1 c5": "Creating space for the knight, but c6 may have been more effective, as taking on b4 seems subpar, since it would open a line of attack for the white rook.",
        "25. Rae1 Rde7": "I am not willing to relieve my influence on the second row.",
        "26. Rxe2": "Maybe white should play Rd1 to try some counter play over the d-file instead? Now he remains rather passive.",
        "26... Rxe2 27. b5": "This move may also have also made things a little too easy for black. As black had created some trouble for himself with c5, he would have had to play b6 before being able to move his knight to a more active square. White's move here allows black to start doing that more quickly.",
        "27... Nc7 28. Nd2": "White's plan of forcing the black rook off the second row by taking away it's free movement along it won't work now as black's knight will be in time to support it. Perhaps it would have been better for black to simply take the pawn loss via 28. Rd1 Rxf2 29. Rd2, as he would at least have a more active position to work with. ",
        "28... Ne6 29. Kd3 Nf4+": "quite disastrous for white, since the king is pushed back towards less activity and the pawn on g2 is lost.",
        "30. Kc3 Nxg2 31. a4 b6": "basically fully locking up the queen side, as the pawns can no longer force anything through. With the white king shut out from the king side, I want to make that the only place where chess is played.",
        "32. Nb3": "Heading for c1 to force away the rook from the second row. ",
        "32... Kd7": "On its way to support the black pieces on the king side. However, given the upcoming Nc1, it may have been better to play Ra2. White can secure his a-pawn through a5 and then a6, but my if my rook gets forced off the second row after that with Nc1, the rook gets to relocate via Ra3+ to f3, thus keeping the pressure on f2.",
        "33. Nc1 Re4 34. Nd3 Kd6": "Activating the king. Rh4 doesn't seem great, as white can defend with f3 followed by Rf2",
        "35. Rd1 Rd4": "Going for Ke6 may have been a good option as well with the purpose of further attacking the kind side. I played the rook instead to prevent the white rook from potentially creating problems by picking apart my queen side after penetrating the back rows.",
        "36. Rd2": "Now threatens to enter my position after all, but via the e-file. Covering that with the rook won't be an option because of Nf5+/ ",
        "36... Nf4": "This will lead to a draw after exchanging the pieces, but it doesn't seem like black can do much better, given the threat of Re2",
        "37. Nxf4": "trading here also seems best for white, as trying to get to e1 via Rd1 will also lead to exchanging the pieces, and at least now black willhave to deal with some pawn weaknesses.",
        "37... Rxd2 38. Kxd2 gxf4 39. Kd3": "And a draw is agreed upon. Black will play Ke5 and after 40. f3, black's king is bound to e5 and f5 in order to keep the white king away from e4, while white can't really go for an adventure on the king side either, because that would allow the black king access to d4"
    },
    "url": "https://gameknot.com/annotation.pl/team-match-kingslayers-vs-the-white-knight?gm=57895",
    "gameName": "team match kingslayers vs the white knight",
    "players": "cheester (1854) vs. martenp (1866)",
    "opening": "Scandinavian defence (B01)"
}