{
    "moves": {
        "1. e4": "So, Bill plays this, which I'm most used to.  No surprise there, as now, I answer with the usual.  After which, I wasn't sure how he'd respond.  But, when white choses the open variation, I stick with it.",
        "1... c5 2. Nf3 d6 3. Bc4": "The problem is just like with my second game with Ken on how intense openings can be, I'm absolutely not aware of it.  That's because I saw that once and was overwhelmed at it's first time.  With that being said, I thought that I was already used to it.  But, boy was I wrong.  This is a small example of getting overly confident.  The problem is, however, that I do so much of it that I forgot lesson 1 with Ken.  As this is where I fail to analyze multiple (even one variation).  So, right there, that's worse then average because with Ken, I was only analyzing one variation, and he said that I needed multiple.  Therefore, I, begin to stop thinking about the game, which is not a good way to go about.  On top of that, at the beginning, things had quieted down at work.  However, I do other things that take away from being able to play chess like working out.  Before that, it starts to pick up at work again, at this point.  Although, it's not a big problem yet, that will change.",
        "3... Nf6": "Meanwhile, I develop with the other idea being to attack his pawn.",
        "4. Ng5": "This does more then protect his pawn.  And, that's where it really starts to go wrong, and I mess up.  I figured that he made an inaccuracy by playing this since it moves the same piece twice.  Even after the rated game with bhidragon, my attitude was still trying to sastisfy some of the basics of opening play which is not how it's supposed when the board reveals another story.  So, in other words, I once again failed to figure out what the board was telling me.  In fact, unlike that other game, I didn't even try which had worse affects.  I just figured that he was making a threat by trying to place pressure on the f file.  That would've existed, but that threat is a mere nuicanse.  Instead, the real threat is much worse.  Therefore, without even looking at one variation, I figured that I got rid of the problem by driving off that burden with 4...h6?? which is the losing blunder.  The other reason behind it was in an attempt to get a semi open file with the Rook.  Now, things have suddenly gotten busy both in and outside of work.  So, instead of getting nervous, I became overly confident by figuring that I just knew what to do, rather then looking at the threats.  What that boils down is playing a move because it looks good rather then knowing if it's good or not and why, which is also something that I've emphasized to my students.  The reason, though, that I deem it worthy of an annotation is because of something similar that Jack emphasized involving the same threat but with a different game.  That's because my weakest pawn, and thus, a major piece were at risk since the real threat, obviously, involves a N fork.  He said that when coped with that you must exchange by bringing the B out on that diagnol.  With that being said, 9...Be6 was forced.  The idea, as he showed involves exchanging the B, and even though black gets doubled pawns, he is allright because that keeps everything defended with the extra defender.  And, that is a well known fact.  Unlike my game with Ken or bhidragon, none of that came into consideration.  In fact, I did not even think twice about it before playing my next move, somewhat similar to what I mentioned in that game where Korchnoi defeated Fischer.  ",
        "4... h6 5. Nxf7 Bg4": "?? After seeing what I had done, I figured that this move gives me counterplay.  This is where I begin looking into variations, but as you'd now expect, I only looked at one variation.  The real truth is, as Ken noted, multiple variations are needed.  With that being said, my attitude is that I'll let Bill have my Queen.  For, if he takes it, I'll recapture his Queen on d1, and if he then takes my Bishop, I'll take his N.  If, however, he protects the N, I'll protect my B, and from there, it's even.  But, I did not, however, give his next move any consideration, whatsoever.  For after he attacks it with 6.f3, I'm forced to protect my Queen.  In exchange, on top of the Rook, I'm going to lose another piece, without any compensation.  When you count the pawn, this is the equivalent to a Queen, without anything in return.  But, that's the least of my problem.  On top of that, it's now stressful at work, so I figured that by having this though process, rather then the nervousness, I was out of the woods.  As I just learned, that's not so since you can do so much that you forget, just about everything you were taught.  And, you can also forget the important lessons you've taught to your students, which is what happened here.  Therefore, had I given this anymore consideration, I would've played 5...Qa5 to prevent what happens next.",
        "6. f3 Qa5 7. Nxh8 Qb4": "Figuring that I've prevented a loss of another piece, I played this.  As before, aside from one variation, nothing else came into consideration.  Sure, I don't enjoy liquidation in this position.  But, my thought was, if he takes on g4, I'll take back, and in return, won't lose anything.  In fact, I'll attempt counter play since I am better developed, and thus, would get my Nb8, and then advance my e or g pawns to get my Bf8 into play.  The reason behind this thought process is that someone won a game under that condition, after having had lost her Rook.  Although I didn't think she played well and was lucky to get counterplay, a commentator disagreed with me.  In it, he said that despite losing a R, she was always in better shape due to being better developed.  So, I figured that a swindle was possible under those conditions, but I was wrong here, as his next move took me off guard since.  As you'd expect, it did not come into consideration.  That's because he checks with the same piece that I was threatening to take, so when I get out, he gets another piece, with only a pawn in return.  After which, it is a resignable position, and I'm almost ready to resign.  But, without anything else to lose, I'll try one more thing.",
        "8. Bf7+ Kd7 9. fxg4 Qxe4+ 10. Qe2 Qh7": "That is, this move.  I figured that it was trapped.  Here comes to the first time in the entire game where I start to think about more then one variation, but it's too little too late since I forgot about his Bf7.  With Ghost Vision, I thought that it was on h5.  Were it not on f7, this would've worked.  So, with that being said, I believed that it only had one square, which is the move that he plays next.  After which, I'd be ready to grab it. ",
        "11. Ng6": "After figuring out that I was wrong by rechecking where it was, I resigned.  What I'm doing differently which will last until after Halloween is cut the game load way down.  Usually, I can handle up to 6 games, but I'm going to keep it down to only 1 game at a time, until after Halloween as on top of work, I'm also gonna be at the gym and getting together with friends.  After November, I'll wait and see.  Eventually, when it really quiet's down, and I've got more availability and flexibility, it'll go back to normal.  In the future, that's how it's also going to be.  Sometimes busyness, like with this game, happens on the spot where you have no advanced warning.  But, once it starts, the game load will go down because it has the same affect as when I was playing those 20-30 simultaneous games with an average time control of much too quickly.  The similarity is that it takes away too much concentration, and with it, the ability to absorb the information and digest the information.  And, at some point when this tourney is completed, I will be showing Jack Stockel this game.  That's because he showed his club members what to do when coped with that threat that I saw, after 4.Ng5 was played."
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=62068",
    "gameName": "Team match",
    "players": "brudi (1383) vs. jkarp (1315)",
    "opening": "Sicilian (B50)"
}