{
    "moves": {
        "1. d4": "Natanya and I enjoy playing each other.  She is up on me with our games by 7 to 3.  I have never kept my 2 pawns in the centre and marched them up to mate the king.  It is not as easy as it seems but I just seemed to get my pieces in the right places and came out the winner.  This time!",
        "1... d5": "I started the game with queens pawn to d4 and black went with pawn to d5",
        "2. c4 dxc4": "I now move pawn to c4 while black took this with his d5 pawn.  I often play Nf6 to protect my d4 pawn but if black takes c4 I will halt him with my next move Nc3.",
        "3. Nc3 e5": "So my next move was Nc3 and black played e5.",
        "4. d5 c6": "I now push my d4 pawn up to d5 and black plays c6.",
        "5. e4 Nf6": "I now back up my d5 pawn with e4 and black plays Nf6.  I will be looking to protect my d5 pawn further.",
        "6. Bxc4 c5": "I capture black's c4 pawn with my LB and black pushes his c pawn to c5.",
        "7. Nf3 Bd6": "I develop my knight to f3 and black brings out his DB to d6.",
        "8. Bg5 h6": "I develop my DB out to g5 with the protection of knight at f3 and attacking the f6 knight.  Black pushes his h pawn to h6 attacking my DB.",
        "9. Bh4 g5": "I move my DB to h4 and black pushes his g pawn to g5 chasing my DB.  This has left his king with not a lot of protection.",
        "10. Bg3 g4": "I continue to retreat my DB down to g3 and black's g pawn continues to attack white with move to g4 and attacking knight at f3.",
        "11. Nxe5 h5": "I move my f3 knight to e5 into the path of black's DB but should black take the knight my DB is on the same diagonal at g3 and will retake.  Black continues to push his king side pawn on the h file to h5. ",
        "12. Qa4+ Bd7": "I now move my queen out to check king at a4 and black moves his LB to block the check.",
        "13. Nxd7 Qxd7": "My e5 knight takes black's LB at d7. Black retakes with queen.  I have the protection of my knight at c3 so may not move my queen.",
        "14. Bxd6 Qxa4": "I now take the 2nd bishop at d6 with my DB as I aim to push my pawns which have control of the centre. Black queen takes my queen at a4.",
        "15. Nxa4 b6": "I now retake black's queen with my c4 knight and black brings out his b pawn to b6.  I need to get my knight back to c3 to protect my e4 pawn as black's knight could take as currently at f6 and I have nothing to defend this capture.",
        "16. Bb5+ Kd8": "To give me a chance to move my knight back I check the king and I can then move my knight back to protect my e4 pawn.  Black's king moves out of check to d8.",
        "17. Nc3 a6": "I now move my knight back to c3 and protect my e4 pawn.  Black moves out his 'a' pawn attacking my bishop at b5.  This is also being protected by my good 'c' knight.",
        "18. Bd3 Ne8": "My LB moves to d3 and is also protecting the e4 pawn and black's knight goes to e8.  I think he must see that I am coming up and is getting ready to defend.",
        "19. Be5 Rh6": "I move my DB to e5 to provide protection to my d5 pawn as I prepare to move it to d6. Black moves his h rook to h6 ready to take my pawn should I be stupid enough to put it on the 6th row.  Or this may be protecting his pawn as he prepares to bring his pawn down to f6 and my DB is covering this square.",
        "20. O-O-O f6": "I now castle to bring the rooks together to support my centre pawn push.  Black moves his pawn to f6.  This pawn is protected by the knight at e8 and h6 rook.",
        "21. Bf4 Rg6": "I retreat my DB to f4 and black moves his rook over from h6 to g6 as my DB is now attacking h6.",
        "22. e5 Rg7": "I now get to move my pawn to e5 and I think white is better here with pair of bishops and 2 extra pieces and a pawn.  I am looking to push my centre pawns and mate the king.  I will bring my h rook across to the centre e file to protect my other pawn.  Black moves his rook back to 7th row and may be looking to protect his king now as may expect his pawn could be taken but I will keep my pawn on the centre row to give me some security if one queening is captured then I have another one.",
        "23. e6 b5": "I push my e pawn to e6 and black pushes a pawn to b5.  I would have thought that he may have put his rook by his king and block my pawn progress but I see that as my other pawn came up to d6 this would attack the rook at e7.  Another move might might have been move the knight to d6 and block d5 pawn but my DB at f4 was a threat to this move.",
        "24. Rhe1 b4": "Now I bring across my h rook to e1 to protect pawn on the e file.  Black pushes his b pawn and attacks my knight at c3.  I do have an extra piece and I must try to keep this advantage.",
        "25. Ne2 h4": "I feel I don't have to rush and I do protect my knight and retreat him to d2 and black pushes another pawn on the h file.",
        "26. Bf5 c4": "Now I move my LB to protect my passed pawn at e6 and black pushes his c pawn.",
        "27. d6 Nc6": "Now I push my d5 pawn to d6 and black moves his knight to e6 which will cover the e7 square where my pawn will check the king.",
        "28. d7 Nc7": "I push my d6 pawn to d7 and black's knight moves out from e8 where he was being attacked by d7 pawn. This knight is now attacking my pawn at e6.  There was a rook also on the 7th row but as said before he could not capture as he would be recaptured by the e6 pawn.",
        "29. Bh6 Rg8": "I now attack the rook at g7 with my DB and black moves his rook up to g8.",
        "30. Nf4 Rb8": "I bring up my e2 knight to f4 another protector for my e6 pawn as I thought the c7 knight may try to capture it and black moves his 'a' rook across to b8.  The rook move may be an attempt to attack my king down the b file where there are pawns ready to assist.  I think I need to get on with the job now.",
        "31. Nd5 Nxd5": "I don't like the knights sitting on the side of the king on the c file especially as the c7 knight is protecting the queening square for my e6 pawn.  So I move my knight over to d5 and black captures this knight.",
        "32. Rxd5 Ne5": "I now capture the d5 knight with my d1 rook and black moves his other knight to e5 now attacking my d7 pawn.",
        "33. f4 Nd3+": "I push my pawn to f4 and attack the e5 knight which now moves to check my king at d3.  However this square is protected by my LB at f5.",
        "34. Bxd3 cxd3": "I capture the knight on d3 with my LB and black recaptures with e4 pawn.",
        "35. e7+ Kc7": "I don't waste time now capturing the d3 pawn and I check the black king but there are 2 rooks on the 8th row which can capture my queening pawn.  Black king moves out to c7 to get out of the check.",
        "36. Re6 Rg6": "Now I bring my e rook up in order to attack black's pawn at f6 and black moves out his g rook to g6 to protect the pawn and also threatening to take my DB at h6.  At the moment I am 4 points up so maybe black is looking to equalise a little by capturing a piece.",
        "37. d8=Q+ Rxd8": "Now there is only 1 rook so I push my pawn and queen but this is captured as expected by the b rook.",
        "38. exd8=Q+ Kb7": " Once the rook captures then I queen my e7 pawn by capturing the rook at d8 which checks the king at c7.   The king moves out of check to b7 as that is the only move available.",
        "39. Rd7#": "I now bring up the d5 rook to d7 and its checkmate."
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=60955",
    "gameName": "Team match",
    "players": "milly64 (920) vs. natanya (996)",
    "opening": "Queen's gambit accepted (D20)"
}