{
    "moves": {
        "1. d4": "This was a team game I played recently. I lost my game as black due to misplaying the opening, combined with blundering a bishop, but I managed to recover with this attack. (I have realised that the vast majority of my annotated games are wins - I apologise for this, but bcause of my reckless style my wins tend to be rather more interesting than my losses).",
        "1... e5": "The Englund (yes, that is meant to be a u) defence. ",
        "2. dxe5 Nc6 3. Nf3 Qe7": "Here I decided to return the pawn, and immediately, rather than hanging onto it via 4.Qd5 or giving up a different pawn via 4.Bf4.",
        "4. Nc3 f6": "This seems inferior to simply taking - while black has a slight development advantage, there does not seem to be much possibility of an immediate attack, and in the long term the pawn should be more useful. Besides, the development advantage will not last long as a tempo must be spent letting the f8 Bishop out.",
        "5. exf6 Nxf6 6. Bg5": "With ideas of Nd5.",
        "6... Qf7": "Removing the pin, but leaving black a pawn down for no good reason.",
        "7. Nb5 Bb4+": "...d6 was also possible, but black prefers his bishop on the a7-g1 diagonal than merely backing up the f6 knight.",
        "8. c3 Ba5 9. e3": "Establishing a stranglehold on d4. 9.b4? is horrible in view of ...Nxb4 10.cxb4 Bxb4+ 11.Ke2 (11.Nd2? Ne4).",
        "9... O-O 10. Bd3 a6": "Fortunately for white, he has already prepared a retreat for the knight, and this simply wastes a tempo forcing it to take up a central position.",
        "11. Nbd4 b5": "This gives Nxc6 a lot of punch, for example if black plays 12...Rd8?? then 13.Nxc6 dxc6 14.Bxh7+ and white is easily winning.",
        "12. Qc2": "Gunning for h7.",
        "12... h6 13. Bf4 Bb7": "This allows a dangerous tactic that establishes a fearsome attack.",
        "14. Nxc6 dxc6 15. Ne5": "White establishes an outpost on g6, and black must be very careful to avoid dropping the exchange.",
        "15... Qd5": "A good counterattacking response.",
        "16. e4 Qe6 17. Ng6 Rfe8 18. e5": "The black peices are being run out of squares.",
        "18... Nd5 19. Bf5 Qf7": "The only place left.",
        "20. e6 Qf6 21. Be5": "Now, if 21...Qd8 22.e7 reaches a similar position to the one that appears in the game a few moves on.",
        "21... Qg5 22. g4": "Now, with the queen unable to do anything except stay where she is without dropping the exchage, white plans to force her to move with h4, then open up the h-file.",
        "22... c5": "Again, a good counterattacking move, opening up the long diagonal.",
        "23. h4 Qd8 24. e7": "Now, if 24...Nxe7?, 25.Be6+ Kh7 26.Nf8++ Kh8 27.Qh7#.",
        "24... Rxe7": "A very good move - after 25.Nxe7 Qxe7 black has excellent drawing and even winning chances due to the open positionand the pin on the e-file.",
        "25. O-O-O": "This ties the d5 knight to d5, brings in another attacking peice, and brings the king to safety - white now properly threatens Nxe7 because the e5 bishop is no longer pinned.",
        "25... Re8": "Retreating to safety. Material is now level, but white stands far better due to his initiative.",
        "26. g5 Qb8": "This removes the pin on the knight, but this was the wrong time to be worrying about that with a pawn storm about to hit.",
        "27. gxh6": "If 27...gxh6 28.Rhg1 removes blacks biggest targetand creates a route for the rook to reach g7, when mate cannot be more than three or four moves away.",
        "27... Nf6": "Attacking the h1 rook and adding to the defense, but the rook is irrelavent while it is on h1, and white could play 28.Bxf6 gxf6 29.Rd7!, where black can only delay mate for a couple of moves via 29...Re7 30.Rxe7 Qf8 31.h7#",
        "28. Bxf6 Bxh1 29. Bxg7": "29.Rd7! was more accurate, but this also forces a quick mate.",
        "29... Bc6": "Covering d7.",
        "30. Ne7+": "30...Rxd7 31.Bh7+ Kf7 32.Qg6#",
        "30... Kf7 31. Bg6+ Ke6 32. Qe2+": "Or 32.Qf5+ Kxe7 33.Qf7#/Qe5#/Qf6#",
        "32... Be4 33. Qxe4#": "Note that the king's defenses have been completely destroyed, and the effectiveness of the bishops working as a pair."
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=25396",
    "gameName": "Team match",
    "players": "goingdown (1689) vs. g_wellington (1663)",
    "opening": "Queen's pawn (A40), Englund gambit"
}