{
    "moves": {
        "1. e4": "In this game it will be my first time playing against the caro kann and black will be playing a dynamic but dubious line.",
        "1... c6 2. d4 d5": "So this stuff is pretty normal. I could play the advance variation with e5, Nd2 Nc3 or f3.",
        "3. Nc3 dxe4 4. Nxe4": "Pretty standard stuff. Main line is Bc4 then Ng3, Bg6 h4, h6 , h5 Bh7 , Nf3 , Nd7 and Bd3",
        "4... Nf6": "This move is dubious. I will inflict doubled pawns but blacks position could be solid if he captures the knight with a e pawn. Blacks base would be hard to crack open. Better here was the super solid Nd7.",
        "5. Nxf6+ gxf6": "THis is the Bronstein- Larsen variation. Although rather dubious black tries to attack down the g- file.",
        "6. Bc4 Nd7": "Bc4 pressurises the weak f7 square.",
        "7. Qh5": "This adds more pressure and e6 is forced. Now f6 could be a target.",
        "7... e6 8. Nf3 Nb6 9. Bb3 Bd6 10. c3 Rg8": "Castling kingside is dangerous here especially with the rook on the g file.",
        "11. g3": "Protecting the pawn on the g file while not making a rook move.",
        "11... Nd5": "Centralising the knight.",
        "12. Qxh7": "A free pawn. If the next move was to be Rf8 then Bh6 wins the exchange.",
        "12... Ke7": "This was forced. If Kd7 then the f7 pawn drops.",
        "13. c4": "Attacks the knight.",
        "13... Nb4 14. a3 Na6 15. Be3 b5": "Attempts to soften up the strong pawns.",
        "16. c5": "Advancing move which will confine black in the first 3 ranks.",
        "16... Bc7 17. Nh4": "A plan was to play Nf5 which looks like a free piece but afther Exf5 then Qxf7 is game over. Blacks most important piece here is probably the pawn on e6 which is preventing mate.",
        "17... e5": "Here black makes a fatal mistake. Blacks pawn on e6 was doing the most on blacks entire side. The rook on a8 is doing nothing, the bishops on c8 and c7 are doing nothing. The knight on a6 is doing nothing, the queen is useless, the rook is also useless. Although the other pieces had the most potential the pawn was more helpful than the entire army combined!",
        "18. Qxf7#": ""
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=41183",
    "gameName": "Team match",
    "players": "richard1234567 (1515) vs. zal667 (1423)",
    "opening": "Caro-Kann (B16), Bronstein-Larsen variation"
}