{
    "moves": {
        "1. e4 d5 2. Nc3": "2.Nc3? is a totally weak move against the Scandinavian (centre counter) Defence. Better is 2.exd5, the Scandinavian Defence (Lasker Variation).",
        "2... d4 3. Nce2 e5": "This is why. My knight is blocking the Bishop's and the Queen's diagonals.",
        "4. Nf3 Nc6": "Slow developement begins with the knights coming out at each other. My knights are in a totally ill-logical position. It is right now worthwhile to lose them.",
        "5. c3 d3": "A not-so-simple mistake by black. Only moving pawns may not be a problem now, but it will become a problem later.",
        "6. Ng3 Bg4 7. Qb3 b6": "Both sides are =.",
        "8. Nxe5 Nxe5": "I was waiting for black to make another mistake.",
        "9. Qb5+ Qd7 10. Qxe5+ Be7": "Black is starting to drown in hot water.",
        "11. f3 f6 12. Qf4": "A critical threat to the bishop. ",
        "12... h5": "A totally ill-logical move by black. This costs black two more points.",
        "13. fxg4 hxg4 14. h3": "Not  the best move by me, but it can be helpful.",
        "14... O-O-O 15. Nf5 g6": "An unbelievably ill-logical move.",
        "16. Nxe7+ Nxe7 17. Qxf6 a5": "This move is a blunder of nothing.",
        "18. Qg5 Rh5 19. Qf4 gxh3": "Black's bad decision slowly leads to a loss.",
        "20. gxh3 a4 21. b3 b5 22. c4 bxc4": "Black may be winning by defence, but, it has a disadvantage: it's own offence.",
        "23. Ba3 c3 24. dxc3 Rc5": "24. Rc5?? trashes the rook and loses offence and defence.",
        "25. Bxc5 d2+": "Come on black, you can do better than this! If you think that I'd fall for 26. Qxd2?? or Ke2?!, you would forget about Kd1!",
        "26. Kd1 a3": "Another trapped pawn, and an almost entirely open field. My rampage begins with this weak move.",
        "27. Bxe7": "An excellent bishop sacrifice. 27.Bxe7!! makes up for all of my mistakes.",
        "27... Qxe7": "The best bishop-queen mate begins.",
        "28. Qg4+ Rd7 29. Qxg6 Qxe4": "Thanks for the free queen, black! This lazy blunder gets my queen in the right position.",
        "30. Qxe4 Kd8 31. Qh4+ Kc8 32. Ba6+ Kb8 33. Qb4+": "Black resigned for this forced mate finishes off black. 33...Ka8 or 33...Ka7 34.Qb7#. This mate wriggles black's king out of the rook-pawn security."
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=37098",
    "gameName": "Team match",
    "players": "austinwkeller (573) vs. mick48 (868)",
    "opening": "Scandinavian (centre counter) defence (B01)"
}