{
    "moves": {
        "1. d4 d5 2. c3 Nc6 3. Nf3 Bg4 4. Bf4 Nf6 5. e3 a6": "Well played so far. Im not sure if Bb5 is a threat.  5...e6 looks sound or for those who overvalue bishop may try Nh5. ",
        "6. Be2 e6 7. Ne5 Bxe2 8. Qxe2 Bd6": "exchange would maintain your structure, it may not be that big deal but since you already played a6 having double pawns would waste its effort , exchange holds the same \"tempo\" since the move you develop will go to waste anyways on d6 (bd6). so instead 8...Nxe5 9.Bxe5 10...Bd6 might look better.",
        "9. Nxc6 bxc6 10. Bxd6 Qxd6": "The good side of this move is that your queen is better placed. tempo does not have such eminence anymore now that pieces are exchanged with pawn on D6 your able to get use of both pawns by attacking on C5 later on. Drawish game though.",
        "11. O-O h5": "Thats an interesting attempt to attack.something what I would do, mayby objectively better would be 0-0, Ke7 or c5",
        "12. Nd2 g5 13. c4 g4": "Now it was your last chance for c5.",
        "14. c5 Qe7 15. b4 h4 16. a4 e5": "would be great if he would exchange this pawn, but white handles this wisely by ignoring this.",
        "17. Rfe1 e4 18. b5": "Now it would be great time for  threatening kingside pawns H3 rather.",
        "18... Qd7 19. Ra3 axb5": "Great move.",
        "20. Rea1 b4": "this will eventually die since theres no protection, just trade and then  Ke7.",
        "21. Rb3 g3 22. fxg3 hxg3 23. h3 Rh4": "I dont know what to recommend here so lets see what are you planning here. ",
        "24. Rxb4 Ng4": "Okay, this was totally unnecassary move. notice though that it would've been quite tricky had you had your Queen on E7 instead. 25.hxg4 25...Rh1!!  26.Kxh1 26...Qh4  27.Kg1 27...Qh2  28.Kf1 28...Qh1 mate.",
        "25. hxg4 Ke7 26. Nf1 Rxg4 27. a5 Qf5 28. Rb7 Qh5": "I will end my annotation to here since the rest is somewhat obvious. hope you find something interesting, Regards, Kain",
        "29. Nxg3 Qh4 30. Nf5+ Kd7 31. Nxh4 Rxh4 32. g3 Rh3 33. Qg4+": "1-0"
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=14363",
    "gameName": "Team match",
    "players": "alexandrucirmaci (1544) vs. kitesurferx (1511)",
    "opening": "Queen's pawn game (D00)"
}