{
    "moves": {
        "1. d4": "This game features excellent middle game strategies and endgame technique",
        "1... Nf6 2. c4 e6 3. Nf3 d5 4. Nc3 c6": "This is a very stable setup for black. If he can manage to keep the centre fixed then it will more then likely end in a draw.",
        "5. Bg5": "A very sharp way to continue that offers white a host of possible attacks",
        "5... h6": "!? more than likely inferior to Nbd7 or Be7 but I was looking for quick tactical chances after Bxf6. ",
        "6. Bh4 dxc4": "before playing ...g5 I release tension in the centre ",
        "7. e4": "A great move by white that keeps the center dynamic. ",
        "7... g5": "The game is quickly shaping up to be a run and gun type ",
        "8. Bg3 b5 9. Be2 Bb7 10. h4 g4": "There was nothing to be gained from allowing axg5 so I decided to gamble with forcing white into a bit of a cramped position. the drawback is that my pawn structure is messy and white has the better center. However, I have gained real threats in g4 and b4. \n\nThe real value for me in the move 10. ...g4 is that it actively strikes at the heart of white main idea which is to break through with e4-e5. By forces white to play Ne5 prematurely it forces white to weaken is his control of e5. Thus allowing me to exchange of knights white loses a value piece in the conquest of play e4-e5. Black on the other hand at this point in time retains the option of playing b5-b4",
        "11. Ne5 Nbd7": "playing ...a5 simply allows white to cement his knight on e5. ",
        "12. Nxg4 b4 13. Nxf6+": "A good exchange for white because it diverts a piece away from the queen side. ",
        "13... Nxf6 14. Na4 Nxe4": "regaining the important e-pawn with a slight initiative but at the cost of a weakened queen side initiative.",
        "15. Be5": "preserving the bishop for the time being. It is unlikely that anything favorable for white would come from allowing ...Nxg3",
        "15... Rg8 16. Bf3 Qd5": "This move is the best move because 16. ...c5 is premature. Any flank attack the begins while the center is in a state of flux will most likely fail. ",
        "17. Qe2": "Threatening to win the knight",
        "17... f5": "a forced weakening move. ",
        "18. a3": "This forces black to play ...c5 insuring the draw after 19. Nxc5",
        "18... c5 19. O-O-O": "!? allowing black to get away with ...c5 is just asking for trouble. 17. Nxc5 was necessary",
        "19... O-O-O 20. Bf6 Re8 21. h5 cxd4": "white's last center pawn is gone and he has a hanging knight on a4 plus black still has a strong queen side pawns. ",
        "22. Rxd4 Qa5 23. Bxe4 fxe4 24. Qxc4+ Kb8": "White's piece active has increased drastically in the last few moves. ",
        "25. Rhd1 Bg7 26. Nc5 Rec8 27. axb4 Rxc5 28. bxc5 Bxf6 29. Qxe6 Qxc5+": "Forcing white into a inferior endgame. Techniquely speaking black would need an extra pawn with the bishop pair to win easily against a rook and a pawns, but this type of position is draw for white and winning chances for black. ",
        "30. Rc4 Qxc4+ 31. Qxc4 Rc8 32. Qxc8+ Kxc8": "I decided to keep the LSB centralized ",
        "33. Rd6 Bg5+ 34. Kd1 Kc7 35. Rg6 Bd5 36. Ke1 e3 37. fxe3 Bxg2": "Playing 37. ...Bxe3 is bad because white will have an easier time defending connected pawns. ",
        "38. Kf2 Bc6 39. Re6 Bd7 40. Re4 a5": "discouraging b2-b4 and limiting the range of the rook",
        "41. b3 Kb6 42. Kg3 Bf5 43. Re8 Bc2 44. Rc8 Bd1 45. Rb8+ Ka7 46. Rb5 Bd8": "Black needs the bishops so the greed 46. ...Bxh5? draws after 47.Rxg5! hxg5 48. h6 = or after 47. Rxa5+ Kb6 48. Re8=",
        "47. Kf2 Ka6 48. Rb8 Bb6": "! the only way to win. It blocks the rook from defending b3 and creates a advanced h-pawn for black ",
        "49. Rh8 Bxb3 50. Rxh6 a4": "Wins! because black can block the advance of the h-pawn, force the exchange of the rook for a bishop and then queen his own pawn. ",
        "51. Rh8 a3 52. Ra8+ Ba7 53. Rc8 a2 54. Rc1 Bb8": "Moving the bishop to e5 where it blocks the e pawn, supports the a pawn and stop the h-pawn. ",
        "55. h6 Be5": "White can not stop the bleeding now",
        "56. h7 Bc2 57. Rxc2 a1=Q": ""
    },
    "url": "https://gameknot.com/annotation.pl/team-game?gm=40642",
    "gameName": "Team game",
    "players": "mannx (2221) vs. elyhim (2212)",
    "opening": "Queen's pawn game (E10)"
}