{
    "moves": {
        "1. e4 c5 2. Nf3 d6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 g6 6. Bc4 Bg7": "I played this to get into less known territories than the Yugoslav attack which in some lines is 20 moves long.  I don't really want to get into a theory debate with my opponent. ",
        "7. Bg5 O-O 8. f3": "I must build up my central post e4 as the normal Sicilian break will be at d5.",
        "8... Nbd7 9. Qd2 a6": "Here black deviates from the book lines.  Nc6 is given as the main line.",
        "10. a4": "This is not the greatest move.  My only thought was to provide a escape square for my bishop upon b5, and to take control of the dark squares on the queen side with a eventual a5 but this is to weakening for such a double-edged opening, even more so that I had been thinking about castling long and pushing my king side pawns.",
        "10... Qc7 11. Ba2 Re8": "This probably wasn't the best move as it leaves f7 weak, and black will not be playing e5 anyways.  He should have developed his queen side.  I think that Nc5 would have been better.  If black can get his pieces out he will be better because of the weakening move a4 played by white (me)",
        "12. h4": "Since it seemed that he wasn't making a counter in the center I decided to play on the wing that my pieces were aiming at.  The king side.  With the bishop on a2 when I play hxg6 he won't be able to play the sometimes superior fxg6, limiting his options.  This always helps when you are attacking since the less options he has the less you have to consider.",
        "12... Nb6 13. Bh6": "Trying to get rid of the defender of the dark squares.  Normal for attacking the fienchetto.",
        "13... Bh8 14. g4": "Advancing on the king side since black can't counter in the center or get active play on the queen side.",
        "14... Nfd7 15. h5": "Since all of black's pieces are trapped on the queen side I have easy development on the king side.",
        "15... Qc5": "Still moving aimlessly with his already developed pieces.  He needs to get a plan and develop his queen side.  I still think that Nc5 was better.",
        "16. Nde2 Ne5 17. O-O-O": "I am going all out.  I sacrificed the pawn to open the f-file.",
        "17... Nxf3 18. Qf4 Ne5 19. hxg6 e6": "This was an obvious mistake resulting in mate in 5.  Better was hxg6, when I was planning Qh2 and Black will have trouble covering both focal points of h7 and h8.",
        "20. gxh7+ Kxh7 21. Bf8+": "If Kg6 then Rh6#",
        "21... Kg8 22. Rxh8+ Kxh8 23. Qh6+ Kg8 24. Qg7#": "The end of a miniature.  This shows why most beginners are taught to \"Never move the same piece twice\" and to develop their pieces.  Black moved his knights a total of 7 TIMES!! And the one on b6 is still not taking part in the ensuing battle on the king side.\n"
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=7417",
    "gameName": "Team match",
    "players": "stringplayer92 (1535) vs. blitzwar0 (1527)",
    "opening": "Sicilian (B70), dragon variation"
}