{
    "moves": {
        "1. e4 c5 2. Nf3 d6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 a6 6. f3": "taking control over g4 early on to facilitate a king side pawn storm and making a bishop on e3 impossible to harass with a knight.",
        "6... Nc6 7. Be3 e6": "This move is fine, but I think I like 7...e5 a little better, as it gives the light-squared bishop an excellent square to go to, which it was lacking in this game.",
        "8. Qd2 Qc7 9. O-O-O Be7 10. g4": "Black could of course still opt to castle long, but if he does not, the game will likely turn into a race towards weakening each other's king's postions, so it's important not to waste too much time.",
        "10... b5 11. g5": "Maybe too early? If the knight moves to h5, I will have to do quite some maneuvering to get it out of the way (probably via Be2 and f4, both of which block easy access of my queen and dark-squared bishop to the king side). for the pawn storm it would be necessary to get a pawn to h5 anyway, so maybe I should try to do that first, before playing g5.",
        "11... Nd7": "I am not sure if I like this retreat. On h5, the knight would have been a better defender if black wants to castle short, as he can retreat it to g7. Here, it is obstructing the light-squared bishop and making the position quite cramped.",
        "12. h4": "If black castles short, the pawn will help me open up black's king's position. If he castles long, I like my bishop on h3 without obstructing my h-pawn, so this move works nicely for both scenarios",
        "12... b4 13. Na4": "I am not too worried with my knight in this position, since it can momentarily block black's a-pawn's advancement and it is actually not that easy to harass it, in part because of the obstructive knight on d7",
        "13... Nxd4 14. Bxd4 e5 15. Be3 Rb8": "Covering b4 and enabling b3, which can be very dangerous.",
        "16. b3": "So I block that. This move also allows my knight to retreat to b2, should there ever be the need.",
        "16... O-O": "At this point, it will take me only three more pawn moves until the h-file and g-file can be opened up completely. Of course, the black king can't castle long any more, but with the g- and h-file not being as safe as they may seem, it may have been better to keep the king in the middle, at least until some pieces are forced off the board through an attack on white's position.",
        "17. h5 Nc5": "I also don't really like this move. I guess the knight needed to make room for the light-squared bishop, but the trade will lead to the closure of the c-file, which means there is very little white has to worry about.",
        "18. Nxc5 dxc5 19. g6": "I want to open the h-file, but playing h6 first will lead to the very annoying g6, which would pretty much stop the entire attack. Blocking that advance means I can play h6 on the next move in order to open up at least one of the king-side files, leading to a strong attack.",
        "19... fxg6": "The final mistake. 19....Be6 may have made things a bit harder for white, but now even the light-squared bishop gets to be part of the attack.",
        "20. Bc4+ Kh8 21. hxg6 h6 22. Bxh6": "And black resigns. 22...Rxf3 to try and block the h-file on h3 is now insufficient, as white will mate through 23. Bxg7 Kxg7 24. Qh6 Kf6 25. g7# "
    },
    "url": "https://gameknot.com/annotation.pl/team-match-christ-our-redeemer-vs-the-white-knight?gm=57896",
    "gameName": "team match christ our redeemer vs the white knight",
    "players": "martenp (1866) vs. devonmichael (1806)",
    "opening": "Sicilian (B90), Najdorf"
}