{
    "moves": {
        "1. b3 Nf6 2. Bb2 d6 3. e3 e5 4. Nf3 Nc6 5. Bb5 Bd7 6. d4 exd4 7. exd4 Be7 8. O-O": "Standard development so far.",
        "8... O-O 9. Re1 a6 10. Bxc6": "I didn't feel like retreating to e2 and blocking my rook.",
        "10... Bxc6 11. c4 Be4 12. Nbd2": "And I didn't want to develop to c3 and block the bishop.",
        "12... Bf5 13. Nh4": "This seems like a waste. I didn't have a real plan, just chasing the bishop around.",
        "13... Bg4 14. Qc2 d5 15. h3 Be6 16. Nhf3": "So the knight's back where it started. At least the bishop's no longer on f5 attacking that diagonal.",
        "16... h6 17. Ne5": "I like putting the knight up there. It's hard to chase it away, but I don't know what it'll do yet.",
        "17... Qc8 18. cxd5": "I had just taught a lesson on isolated pawns, so why am I accepting one? I don't know except that the position felt too balanced, and I wanted to get it unbalanced somehow. This probably isn't the best way, but I also liked having access to c4 and e4.",
        "18... Nxd5 19. a3": "Stopping the knight from going to b4.",
        "19... c6 20. Ne4 Nf4": "Do I have to worry about him sacrificing the knight on h3 and swooping down with the bishop and then the queen on g4? My magic 8-ball said \"you better believe it!\"",
        "21. Qc3 Bd5 22. Qf3": "It's getting hard to find a way to hold off his attack. He has lots of pieces pointed towards my king.",
        "22... Ng6 23. Nc4": "No way am I going to trade and let him recapture with the f-pawn and get his rook into the attack.",
        "23... Qc7 24. Qd3": "I feel like my queen's running around trying to plug the holes in my setup.",
        "24... Rae8": "I've got to keep an eye out for Bxa3 and the discovered attack on my knight.",
        "25. Qg3 Qf4 26. Ned6": "Enough dancing -- it's time for a massive trigger. We both know it's coming, and we're just trying to get our pieces in a spot so they'll be better placed after the trade.",
        "26... Bxd6 27. Nxd6 Rxe1+ 28. Rxe1 Qxg3 29. fxg3 Bxb3": "And he accepted a draw here. Actually, he must've offered it, since he just moved. I remember being real surprised, because I thought I was in more trouble. Sure, I get back the pawn on b7, but I wasn't thrilled about Bb8. After his bishop moves, what can I do with my bishop. It seems like it'll be forever blocked by the pawn on d4 and easy for his rook to harass. Maybe it's because the draw assured his team of winning the match; I needed to win for us to have a chance to catch and tie them."
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=22257",
    "gameName": "Team match",
    "players": "chuckbo (1867) vs. jankisa (1821)",
    "opening": "Nimzovich-Larsen attack (A01), Indian variation"
}