{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Nc3 Nf6": "A four knights opening..... I always like getting my knights going early when playing black",
        "4. d3 d5": "And I prefer a more open game - so usually play d5 when given the opportunity",
        "5. exd5 Nxd5 6. Nxd5 Qxd5 7. Be2": "So far fairly standard",
        "7... Bf5 8. Be3 O-O-O": "I'm never sure whether Q side castling is a good idea - especially laying black, but it seemed the right thing to do here.",
        "9. O-O Kb8 10. a3 Be7 11. h3 h6 12. b4": "So it's going to be a race to attack the respective Kings with the pawn advances. I mst admit that I'm often bad at judging these positions - I'm prone to focus too much on my own attack - it almost brings me undone here.",
        "12... Bd6 13. c4 Qe6 14. c5 Be7 15. b5 Nd4": "At this stage I think I'd rather be white!",
        "16. b6 Bxc5": "Dangerous - it gives him attacking chances, but I played this out a few times and think I can hold onto the pawn",
        "17. bxc7+ Kxc7 18. Rc1 b6 19. Nxd4 exd4 20. Bf4+ Kb7": "THis was a mistake - I should have gone to c1",
        "21. Bf3+ Kc8 22. Qa4 Rd7 23. Qa6+ Kd8": "Quick - get that K out of there!",
        "24. Rfe1 Qb3": "My best chance is now to swap down as soon as possible while holding the pawn advantage",
        "25. Bc6 Bxd3": "I don't think he saw this move - it forces the Q swap which helps me.",
        "26. Qa4 Qxa4 27. Bxa4": "So I'm now 2 pawns up, but in a tricky position with K exposed against 2 bishops and 2 rooks..... I need to simplify further and I can now afford to sacrifice a pawn to do so because I'll still be a pawn up for the endgame",
        "27... Re7 28. Red1 Bf5 29. g4 Bd7 30. Bb3 f6 31. a4 Rhe8": "With a view to swapping rooks - the plan is to sacrifice the pawn on d4 for an easier position.",
        "32. a5 Bb4 33. Rxd4 Re7e1+ 34. Rxe1 Rxe1+ 35. Kg2 bxa5": "and I need to take this with the pawn rather than bishop or I'll end up losing the pinned bishop on d7 (I need to stop him moving the bishop to d6 after I move the rook to e7).",
        "36. Ba4 Re7 37. Bb8 Kc8": "forces a swap of pieces.... almost there.....",
        "38. Bxd7+ Rxd7 39. Rxd7 Kxd7 40. Bxa7": "And so we arrive at the endgame with my pawn up intact...... I'm a very bad endgame player, but I guess I just need to force a bishop swap to allow the pawn to run home.",
        "40... Kc6 41. Bd4 Kd5 42. Ba1 Kc4": "and he resigned becuase he can't stop me moving the bishop to c3"
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=53580",
    "gameName": "Team match",
    "players": "adicarmine (1748) vs. wallaby66 (1836)",
    "opening": "Four knights game (C46)"
}