{
    "moves": {
        "1. d4 d5": "The Queen's pawn game. My second choice opening as black, as I can free up a bishop, and my queen has partial freedom.",
        "2. e3": "The Stonewall attack. His light-square bishop is now free, and his dark-square one now has restricted freedom...",
        "2... Nf6": "...so I get ahead on development with my knight, keeping with the Stonewall attack.",
        "3. Nf3": "He now brings out his own kingside knight to get level on development...",
        "3... Nc6": "...so I bring out my other knight to get back ahead.",
        "4. Bd3 Nb4": "I advance my knight further to attack the bishop, limiting its options...",
        "5. a3 Nxd3+ 6. Qxd3": "...and decide to trade the pieces, as the bishop has a wider range, although it did bring out the queen...",
        "6... e6": "...so I free up my kingside bishop, limiting the queenside bishop's freedom...",
        "7. b3": "...and he's now hoping to fianchetto his remaining bishop...",
        "7... c5": "...and I decide to attack his queen's pawn to attempt to create some space...",
        "8. Bb2": "...and he fianchettos his bishop, as I anticipated...",
        "8... cxd4 9. exd4": "...and we trade pawns.",
        "9... Qe7 10. Nbd2 a6": "I thought it was important to prevent a queen check on b5, so I move up my QRP to cover the square...",
        "11. O-O Bd7": "...and I decide it's time to get a bishop out...",
        "12. Rac1 Bb5": "...and to attack the queen...",
        "13. c4": "...but he covers it with a pawn...",
        "13... dxc4 14. Nxc4": "...so we trade pawns, and he uses his knight to protect his queen...",
        "14... Bxc4 15. Rxc4": "...and we trade the two pieces, but it allowed his rook onto the attack...",
        "15... Qd7": "...so I move my queen and free my other bishop...",
        "16. Rfc1": "...but I'm not too worried about his rooks being connected, as my queen and one of my rooks guard the c8 square...",
        "16... Bd6": "...so I free my remaining bishop...",
        "17. a4 O-O": "...and castle kingside.",
        "18. d5": "Why did he move his pawn...",
        "18... exd5": "...when I could accept it with my pawn, which is now too well defended?",
        "19. Rh4 g6": "This was the fatal error. I didn't realise that my KNP was the only piece defending my knight: I was trying to give my king an escape route should a queen/rook land on his starting rank, although it is guarded by both rooks...",
        "20. Bxf6": "...but not only does the bishop capture my exposed knight, it also blocks off the escape route. I'm suddenly in deep trouble...",
        "20... Rac8": "...so I contest the open file with one of my rooks. I maybe moved the wrong one, as my king cannot move at all...",
        "21. Qd2 Rxc1+ 22. Qxc1": "...and we end up exchanging the rooks.",
        "22... Rc8": "I move my remaining rook to attck his queen...",
        "23. Qh6": "...but she moves down to close in on my king...",
        "23... Qc6 24. Qxh7+": "...and I resign after this move, as I could only do Kf8, which would have resulted in mate on the next move: Qh8#. The moral of the story? One mistake can cost you a tight game, so be careful with your moves."
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=25634",
    "gameName": "Team match",
    "players": "edwardnorton (1254) vs. aspiemikey (1380)",
    "opening": "Queen's pawn (D00), stonewall attack"
}