{
    "moves": {
        "1. e4 c5 2. Nf3 d6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 a6 6. Be3 e5 7. Nde2 Be6 8. f3 Be7": "Sicilian, Najdorf\n1. e4 c5\n2. Nf3 d6\n3. d4 cxd4\n4. Nxd4 Nf6\n5. Nc3 a6\n6. f3 e5\n7. Nde2 Be6\n8. Be3 Be7",
        "9. Qd2": "Ok, I am starting to get concerned with the d file, Justinian already controls d4 with more firepower than I, and I don't think I can bring much, maybe my other knight in a few moves.",
        "9... h6": "maybe a bit passive, but wanted to keep the bishop and queen away from my future home for my King.",
        "10. O-O-O": "White adds more power to the d rank.  I fee like I am a bit cramped on my e file.  Need to move some things to gain space.",
        "10... O-O 11. a3 b5 12. f4 Bg4": "black offers a trade of bishop for knight, here I am just looking to clear out the middle hoping I can activate my bishop and queen soon.",
        "13. h3 Bxe2 14. Bxe2 Nc6": "engage knight.  I still feel like I am behind, but hoping to maybe bring knight to d4 and block the Queen Rook cannon.",
        "15. Bf3 d5 16. exd5": "I like this move for white, but as I look at it, I like it even more for black.  I see he wants to either get a free lunch on my knight, or create a pin and get my Rook in a move.\n\nI see another option as a possibility building here....",
        "16... e4": "Lets see if he bites.",
        "17. Nxe4": "I'll continue to force the line I want with my knight.",
        "17... Nxe4 18. Bxe4": "OK, white has let me in, lets see if I can get him to take the bait, I see a Queen King fork if I can get my knight to b3....will need to support that with Rb8 to pin that pawn.  \n\nMoving my knight, he should move pawn and get the double attack on my rook and bishop.  ",
        "18... Na5": "Perfect, my plan is complete...insert evil laugh, white can have my bishop and even take the pawn fork on my rook and queen.",
        "19. d6": "Perfect.  He thinks he's got a free bishop or forced Queen swap due to the discovered attack on my Rook.....watch out Nb3.",
        "19... Rc8 20. dxe7": "BINGO, he can't see it, the Rook Queen fork is just to tasty to pass up.  I think this is going to hurt white a bit.",
        "20... Nb3+ 21. Kb1 Nxd2+": "This only worked as I get the second check, which means I can save my Rook and Queen.",
        "22. Rxd2 Qxe7": "trap / plan is complete, I feel great to be 2 up....from here on out I'll play to the material advantage. ",
        "23. Rd4 Rcd8": "Lets presure the Rook to move and take the bishop, or take the trade and increase my material percentage.",
        "24. Rxd8 Rxd8 25. Bd3 Qxe3": "White knows he's beat, game over."
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=12077",
    "gameName": "Team match",
    "players": "justinian (1455) vs. capt_rook (1434)",
    "opening": "Sicilian (B90), Najdorf, Byrne (English) attack"
}