{
    "moves": {
        "1. e4 c5 2. d3": "Weak",
        "2... Nc6": "Good!",
        "3. h3": "?",
        "3... d6": "e6 better, or Nf6",
        "4. Nc3 g6": "Better e5 or Nf6 or e6",
        "5. Nf3": "Good",
        "5... Bg7 6. Be2": "Good",
        "6... Nf6": "Good development",
        "7. Be3": "Black's response should be d5. Attack in the center. exd5, Nxd5. The failure to make the d5 move is at heart of this game.",
        "7... b6": "Of not d5, then O-O",
        "8. Qd2 e5": "No, d5",
        "9. O-O O-O 10. Rab1 Nd4": "Better d5",
        "11. Bxd4": "Not a good exchange for White",
        "11... cxd4": "The game is looking good for Black now, all of a sudden.",
        "12. Nb5": "OK> are we ready for d5? [Nxe5, Qe8; Nxg6,hvg6 pp If Nf3 then Qxb5] Or is it a6? What forcing move will Black make?",
        "12... Nh5": "d5 better. action in the center is better. This was not necessary to protect the e pawn even if Black makes d5 move, per analysis prior.",
        "13. Qb4": "White sees vulnerability of Knight.  Black should get his Knight back in game with Nf4, which also protects d5 square and drives B on e2 away or move of Rfe1.  Then, d5!",
        "13... Be6": "Nf4 or d5",
        "14. Nxd6": "Mistake, but works for White here. Now Black responds a5; Qa3, Nf4; Bd1, Rb8; Nc4, f6 and Black loses a pawn for initiative.",
        "14... Bxa2": "Now I expected a5.",
        "15. Rbe1 Be6 16. Nh2 Nf4": "Finally!",
        "17. Bg4": "We need now from Black a5, then Qc7 provoking  Nc4 then Bxc4. Black has many opportunities here.",
        "17... Bxg4 18. Nxg4": "Now Black should move Qg5! Then h5",
        "18... h5": "How about Qg5?",
        "19. Nh2 Bf6": "Black's initiative is evaporating. Qg5 is still a good move.",
        "20. Nc4 Rc8": "Or Rb8, threatening b5.",
        "21. Nf3": "White's Knight is back in the game.",
        "21... Be7 22. Qb5": "f6 now or Rc5",
        "22... Ra8": "? needed f6",
        "23. Qxe5": "Now White is ahead and with material to show for it. Ne6 is needed, protects d4, is protected by the pawn on f7.  Be skeptical when you start moving your Kingside pawns under pressure.",
        "23... g5 24. Nxd4": "It should have been Qxd4.  Now f6; Qf5, Qxd4.  This is one of those critical moves where you need for sure to use Analysis board and Flip.",
        "24... g4": "Blunder. Now Nc6 or Nf5",
        "25. Qxf4 Qxd4 26. hxg4 b5": "Or h4",
        "27. Nd2": "Ne3 better",
        "27... Qh8": "Qg7 better, then after gxh5, Bg5 driving Queen away and attacking Knight.  Again, this is one of those crucial moves to study.",
        "28. gxh5": "See? If only Q were on g7, Bg5 would win a piece.",
        "28... Qxh5": "Qxb2. Black's hope lies in Queening one of his Queenside pawns. Or Rfc8.",
        "29. Nf3": "White is right to recruit more pieces.  I would have tried Re3.",
        "29... Rad8": "Rfe8 a little better to give King room to move.",
        "30. Qg3+ Kh8": "See? If Rfe8, another possibility, Rf8.",
        "31. Qh3": "I would not have exchanged Queens if I were White.",
        "31... Qxh3 32. gxh3 Rfg8+": "You're just helping White do what he wants any way.  a5",
        "33. Kh2 Rd6 34. Ne5 Rg7 35. Rfg1 Rh7 36. Rg3 Bh4 37. Rg4 Rdh6": "Rf6. Now if Rge1, Rxf2+",
        "38. Reg1": "Excellent!",
        "38... Bxf2": "Bg5; Rxg5, Rxh3+; Kg2, f6; Ng6+Kg7; Nf4+, fxg5 and White is winning.",
        "39. Rg4g8#": "Yes."
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=48501",
    "gameName": "Team match",
    "players": "rizwan1 (1338) vs. ffweaver1 (1251)",
    "opening": "Sicilian defence (B20)"
}