{
    "moves": {
        "1. e4 Nf6": "1...Nf6  The Alekhine Defense, promising sharp tactics.",
        "2. Nc3 e5": "2...e5.  Oops, not so fast with the Alekhine Defense.  We seem to be heading to some hybrid of the Philidor and the Dunst Opening.  Everybody has heard of the Dunst, of course?!# ",
        "3. Nf3 d6 4. d4 Nc6 5. d5 Nb4": "5...Nb4.  Probably 5...Ne7 is better, since it does not induce the Q-side pawn push that W now conducts.  However, 5...Ne7 would slow B's K-side assault later.  This Knight will develop into a major hindrance to B for much of this game.",
        "6. a3 Na6 7. b4": "7. b4.  At this point, this game has exactly one game in the GK database as a comparison, namely akre_pasa  v. gasparinov  from 2007.   So we are in relatively untested waters already.",
        "7... Bg4 8. h3 Bh5 9. Be2 Bxf3": "9...Bxf3.  I would at least consider 9...Bg6, putting some heat on the base of W's central pawn chain.  Of course, 10. Nd2 would then start the central assault and protect that base of the chain, if W chooses that path.",
        "10. Bxf3 Be7 11. O-O O-O 12. Be3 c5": "12....c5.  Probably hoping for the en passant capture, in order to free some space for B's King Bishop.  But W does not oblige, and proceeds to cement the \"stonewall\" there.",
        "13. b5": "13. b5.  The \"stonewall\" construction commences on that flank!",
        "13... Nc7 14. a4 a5": "14...a5 Conceding to the stonewall, as it can't be stopped anyway.    Note that as the game progresses, the stonewall reduces B's chances except where he is best mobilized on the K-side, and it does nothing to impede the power of W's bishops.",
        "15. Be2 b6": "15...b6.  B does not have the luxury of time to seal the stonewall.  It is probably best to play 15...Nd7 and if W takes the time for Na2 and c4, then B has a stronger attack on the base of the central pawn chain.",
        "16. Na2": "16. Na2  I'm not sure what W was thinking here, but I would look seriously at a properly timed f4, for example 16. Bd3 and then 17. f4.  The key is to support W's K-pawn long enough to threaten e5, when B's pieces are not well-coordinated to handle that.  ",
        "16... Nxe4 17. Qd3 f5 18. f3 Ng3": "What would W do against 18....c4?  If 19. Qxc4, then 18...Nc5 gives the Knight an excellent outpost in the center, and at the same time W's  Knight is out of action indefinitely.  In addition, the threat ....e4 is looming.  Is that enough compensation for the Pawn?  And if W just exchanges his excellent Bishop to eliminate the Knight, does that compensate W by blowing open the stonewall?  I am uncertain, but I would certainly consider 18....c4.  ",
        "19. Rfe1 e4": "19...e4.  Why not just 19...f4 20. Bf2 Qe8 and 21...Qh5?  Then ...Rf5 seems to bring some serious threats against the W K-side. ",
        "20. fxe4 f4 21. Bf2 Bh4 22. Bf3 Qf6 23. Qc3 Qxc3": "23...Qxc3 Surely it is worth keeping the Queens on the board, since the Queen is keeping B in the game.",
        "24. Nxc3 Rae8 25. Ne2 Re5 26. c4": "Maybe 26. Re1-d1, 27.  Be1 and 28. Bc3 work to better coordinate W's pieces.",
        "26... Ne8 27. Nxg3 fxg3 28. Be3": "The exchanges have helped W to operate on some open lines for the Bishops and they are beginning to take command now.   ",
        "28... Nf6": "28...Nf6 The key blunder.  But what is the alternative? Probably just forcing the trade of the B-squared Bishops with 28...Bg5 is best. 28...Bg5 also rids B of that useless Bishop of his. The Rook sac with 28...Rxf3 merely hastens the end. ",
        "29. Bf4": "29. Bf4.  The Bishops start to sweep the board.",
        "29... Ree8 30. Bxd6 Rf7 31. e5": "31. e5.  The central Pawn mass is incredible to see in action.  Pawns should not be pushing so many pieces around, but that is exactly what is happening.  W had to be really enjoying himself here.",
        "31... Rd8": "31...Rd8  A vain attempt to delay the advance of the e-Pawn.",
        "32. e6 Ra7": "32....Ra7  Unbelievably, the only safe spot for that Rook!  Those Bishops and Pawns are just raking the center of the board.",
        "33. Bf4 g5": "33...g5  A colossally bad move, but at least it has the advantage of being in a colossally bad position, so it hastens the end.  I think only 33...Ne8 can marginally hold this position, but for how long?  At least it has the advantage of freeing B's Bishop so that it is no longer just a tall Pawn guarding g3.   The Bishop can then march in and stop the Pawn surge with 34...Be7, by giving up the Pawn at g3.",
        "34. Be5 Kg7 35. d6 Kg6 36. e7": "36. e7  This Pawn roller is just gruesome to watch in action.  Its carnage is equivalent to the Terminator.",
        "36... Re8 37. Bc6": "37. Bc6  Compare this Bishop to B's.  The Bishop at h4 remains a tall Pawn the entire game.",
        "37... Rg8 38. Bxf6 Kxf6 39. e8=Q": "39. e8=Q.  W's Queen #2 in the game.",
        "39... Rxe8 40. Rxe8 Kf5 41. Re7 Rxe7 42. dxe7 g4 43. hxg4+ Kxg4 44. e8=Q": "44.e8=Q.  And now W's Queen #3 for the game.  A great use of those central Pawns to decimate the opposition."
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=32889",
    "gameName": "Team match",
    "players": "chriseyre2000 (1491) vs. countalucard (1464)",
    "opening": "Alekhine's defence (B02), Scandinavian variation"
}