{
    "moves": {
        "1. e4": "Hey, this seems like an interesting game to study and discuss. I'll put some initial comments, pls feel free to expand the analysis and correct me where I'm wrong :)",
        "1... c5 2. Nf3 d6 3. d4 cxd4 4. Nxd4 Nc6 5. c4 Nf6 6. Nc3 e6 7. Be2 Be7 8. O-O O-O 9. Be3 Ne5": "Inaccuracy, I believe. What is the purpose or threat of this move? A common plan here is a6-Qc7-b6-Bb7, making the 'hedgehog'",
        "10. f4": ".",
        "10... Nc6": "How do Nd7 and Ng6 look? Nd7-c5 seems both reasonable and threatening.",
        "11. g4": "No need to be intimidated by white's pawn rush. This is to be expected in this opening most of the time anyway. What is a natural reaction to a side attack like this?",
        "11... Ne8": "This is probably a mistake, giving in to imaginary threats. The correct reaction I believe was e5: when facing attack on the side, start your own game by opening up the center!",
        "12. a3": "I am not sure what is white doing. Waiting for black's plan?",
        "12... Nc7": ".",
        "13. Qc2": ".",
        "13... Bd7": ".",
        "14. g5": ".",
        "14... e5": "! good defensive move, in the spirit of the position: wait till opponent gets too ambitious and then counterattack!",
        "15. Nf5": "Is this a mistake? Seems to be losing a pawn to Bxf5 16. exf5 exf4 17. Bxf4 Bxg5. In view of that, I'd play Nxc6",
        "15... g6": "Is this a mistake? Black could have won a pawn?\n\nAlso they say when facing a pawn assault, don't move your own pawns that are being attacked, unless tactically necessary. It only creates weak squares.",
        "16. Nh6+": ".",
        "16... Kh8": ".",
        "17. h4": "Here it feels like a critical position for black to try and get some counter-initiative or at least exchange some pieces. How is f6? Or exf4 followed by Ne5 and Ne6? Straight Ne6?",
        "17... Ne8": "?",
        "18. f5": ".",
        "18... gxf5": "How was 18 ... f6?",
        "19. exf5": ".",
        "19... f6": ".",
        "20. Nd5": "This knight is strong, I'd just try to exchange it with Nc7",
        "20... fxg5": ".",
        "21. Bh5": ".",
        "21... gxh4": ".",
        "22. Nf7+": ".",
        "22... Rxf7": ".",
        "23. Bxf7": ".",
        "23... Nf6": ".",
        "24. Qg2": ".",
        "24... Qf8": "It was probably good idea to try to exchange both d5 knight and f7 bishop",
        "25. Be6": ".",
        "25... Bxe6": ".",
        "26. fxe6": ".",
        "26... Nd8": "? Loses pinned knight. ",
        "27. Bg5 Nxe6 28. Bxf6+ Bxf6 29. Rxf6": "Game over",
        "29... Qe8 30. Raf1 Qg8 31. Qxg8+ Rxg8+ 32. Kh2 Nd4 33. Rf6f7 Ne2 34. Nf6": ""
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=32108",
    "gameName": "Team match",
    "players": "alex8181 (1805) vs. jbnugas (1693)",
    "opening": "Sicilian (B54)"
}