{
    "moves": {
        "1. e4": "This was  a complicated game played well by my opponent. I will work on this over the next few days. Feel free to comment.",
        "1... c5 2. Nf3 d6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 g6": "A Sicilian Dragon. I play this as black occasionaly and understand some of the ideas, but it is complicated.",
        "6. Be3 Bg7 7. f3 O-O 8. Qd2 Nc6 9. O-O-O Bd7 10. Bc4 Rc8 11. Bb3 Na5": "All standard theory as far as I recall, with maybe some transpositions.",
        "12. h4": "Going for an attack. Alternatives are 12. Bh6 or 12. Kb1",
        "12... Nxb3+": "Normal here is 12... Nc4  13. Bxc4 Rxc4 , forcing an exchange and bringing the rook to c4 ",
        "13. Nxb3": "Preferable to any pawn recaptures, which may weaken the queenside",
        "13... h5": "Seems sensible but ultimately may be weakening the kingside",
        "14. Bg5": "Trying for a tactic based on the idea of e5, de, bxf6 and taking twice on d7",
        "14... Be6": "which Anita side steps",
        "15. Kb1 Rc4": "Now the above  tactic is on again, with the back rank weakened. ",
        "16. e5 Ne8 17. exd6": "Not the only option. White could have continued with 17. Nd5 Bxd5 18. Qxd5",
        "17... Nxd6": "Well defended",
        "18. Bh6": "Going for an exchange of the powerful dragon bishop",
        "18... Bh8": "Interesting, sometimes it is worth sacrificing the exchange to keep the bishop",
        "19. Bxf8 Qxf8 20. g4 hxg4 21. h5": "Sacrificing material for a direct attack on the king",
        "21... Qg7 22. hxg6 Qxg6 23. fxg4 Rxg4": "A difficult position to assess and play, with black having the 2 bishops both baring down on the white queenside. I am trying to create threats of my own and watch out for mate",
        "24. Nc5": "The knight was not doing much on b3 so I tried to activate it",
        "24... Bf5": "Maybe Bg7 here, with 24...Bg7 25. Nxe6 Qxe6",
        "25. Nd5": "More pressure",
        "25... Qg7": "Threatening mate on b2, but white has a check and a tricky combination first",
        "26. Nxe7+ Kf8 27. Rxh8+ Qxh8 28. Qxd6": "winning a piece by giving the exchange back",
        "28... Bxc2+": "I eventually figured out that taking back on c2 would allow annoying checks from the queen and rook, so I decided to delay the capture, black is forced to get her king and queen out of the way",
        "29. Kc1 Kg7 30. Kxc2 Qh7+ 31. Kb3": "I was bit surprised black resigned with the queens still on the board, but white is well ahead in material. Still, plenty of room for mistakes by both sides."
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=21889",
    "gameName": "Team match",
    "players": "gmkonig (1778) vs. chessanita (1768)",
    "opening": "Sicilian (B76), dragon, Yugoslav attack, Rauser variation"
}