{
    "moves": {
        "1. e4": "A combination of some very poor chess and some very tricky tactics, but in the end it came together surprisingly. I am black playing at the time an opponent of very similar chessic knowledge. E4",
        "1... c5": "C5 the sicilian defence, i like the sicilian because i always like to develop away from the centre and counter attack later on",
        "2. d4": "d4, an aggressive leap. White generally wants to have no options for black to extend its pawns to the centre. I personally dont mind this as this system doesnt require such a dominant presence in the centre",
        "2... d6": "d6 keeps my presence there but nothing forcing. ",
        "3. d5": "d5 closing the space, stopping my queen knight on the c6 square. Its annoying for black, but at the moment I didnt really mind this otherwise i would of probably taken on d4",
        "3... Nf6": "nf6, attacking both. developing a piece. Nothing more complex than that",
        "4. f3": "f3 defending",
        "4... e6": "i played e6 to again open up for development, counter and trying to pursue white to give up his nice centre",
        "5. dxe6 Bxe6": "he exchanges pawns allowing me to develop my bishop, the centre i feel now is mine.",
        "6. Bb5+": "simple bishop check\n",
        "6... Nc6": "i gave up my knight in the hope he will give up his light square bishop to make mine strong. My knight isnt really doing anything in this position. ",
        "7. Bxc6+ bxc6": "my pawns are doubled. doubled pawns arent always bad. The double pawns sort of cement my presence in the centre allowing any attack to undouble my pawns and obtain a dominant pawn island",
        "8. Ne2": "hes starting to develop for castling",
        "8... Be7": "same for me",
        "9. b3": "trying to flanchetto that bishop",
        "9... d5": "trying to undouble my pawns",
        "10. e5 Nd7": "he forces my knight away the same time i attack his over extended pawn, his weakness now",
        "11. Bb2": "defends with the bishop\n",
        "11... d4": "i really like this move, d4 shuts down that bishop. This move i feel played a huge part in my victory. I always had the idea that his dark squared bishop would be a weakness as my centre is much stronger and the influence of the piece is very limited. As you notice the game develop keep and eye on d4",
        "12. f4": "f4, opens for the queen",
        "12... Bg4": "a handy pin, slows whites development. Keeps the game tense and accentuates blacks pressure with the queen and bishop combo",
        "13. g3": "g3, horrific? what does white gain here apart from a weak structure of pawns and holes in his defense? nothing! Perhaps he was really worried with my bishop h4 check. As josh waitzkin says, the potential of chess is often more dangerous than the execution",
        "13... Bh3": "bh3, taking advantage of the poor defence, the bishop cannot be attacked and stops castling and keeps pressure",
        "14. Nd2": "nd2, b4 again. The power that D4 has is ridiculous. It is dictating the game. The knight is not bad here, but im sure i know it bothers him very much. The queen is also ridiculous here, absolutely useless",
        "14... Qa5": "qa5, ive sensed a weakness and its the c3 square. ",
        "15. a3": "a3, trying to get a pawn on b4 i think and block that diagonal",
        "15... O-O": "castle. It seems quite late, you best protect the king before you make any attack yourself. I should of castled earlier, if not last move",
        "16. Nc1": "knight back to c1, maybe thinking of d3. What about, knight to g4, it blocks my bishop in and centralises his knight. Even if Ng4, h5, Ne2 white can work on the weak h pawn",
        "16... Rfe8": "lining up rook and king",
        "17. Qf3": "queen to f3, i didnt notice a couple of whites next moves, such as g4",
        "17... Rac8": "Rook defending that pawn, the queen move was double edged and had me caught off guard",
        "18. g4": "I cringed when i saw this move, i dont think i made another move for 2 days, I studied every variation i could play. In the end, it was a surprising sacrafice i found. I give you great respect if you saw this move, please post a comment if you did :) Ok here it is",
        "18... Nxe5": "Nxe5!, see if you can follow up why i played this. If white takes, which he does i have a few very exciting moves in store. ",
        "19. fxe5": "what i wanted",
        "19... Bh4+": "Bh4 check! Now look at my rook on the e file my queen, my bishops. Its all coordinating",
        "20. Kd1": "kd1",
        "20... Bg5": "bishop g5 threatening mate",
        "21. Qf2": "Qf2 defending that mate, but he left behind the pawn on g4. Disastrous!!",
        "21... Bxg4+": "bxg4 check! Its all over for white. My sacrifice has turned into devastating attack",
        "22. Ke1": "king to e1 only move, No knight to e2 because of mate on d2! Or a queen sac which is ridiculous.",
        "22... Rxe5+": "rook check. still no knight d2 because of rook check winning the queen",
        "23. Kf1": "kf1 only move",
        "23... Bh3+": "bh3 and he resigned. Only way to block is with the queen, he didnt want to suffer any longer. A couple of key points here. Notice d4 as mentioned before and how it has crushed white. D4 has forced 3 white pieces away from developing and ever getting into the game, the bishop and 2 knights have done nothing the whole game. I fought white metaphorically 3 pieces up as his 3 pieces never got into the game. A clever tactic brought on by a poor move. Thats chess!"
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=23012",
    "gameName": "Team match",
    "players": "jsmitch (1373) vs. jimmison (1422)",
    "opening": "Sicilian (B21), Smith-Morra gambit"
}