{
    "moves": {
        "1. e4": "This is my first annotated game and one that I feel shows the importance of developing lines of attack. It is the second team game I had against this opponnet with him winning a decisive victory in only 9 moves by playing totally in a style that I wasn't use to. So at the beginning of this game I felt I had to develop a strong defence. Any comments/ views  would be appreciated!",
        "1... c5": "Standard Sicilian defence",
        "2. Nf3 Nc6 3. d4": "To take pawn allows white to devop better in the centre",
        "3... a6 4. dxc5 e5 5. Bc4 b5": "Qa4 may have been better but again was thinking defencely",
        "6. cxb6 e.p.": "Didn't see enpassant!!",
        "6... Qxb6": "Didn't want to bring queen out so early but little other options",
        "7. Qd5": "White plays aggressively going for pawn f4 and possibility of destroying kingside defences.",
        "7... Nd8": "Obvious defencive move",
        "8. Qxe5+": "white takes pawn on e5 controlling the centre and making me very worried!!",
        "8... Ne6": "Obvious defence ",
        "9. b3": "I think white should have played Ng5 to add further pressure?? But could also see that whites next move would be Bb2 however",
        "9... Bc5": "The move allows me to open a line of attack my first chance of the game",
        "10. O-O": "White rightly castles",
        "10... Nf6": "This allows me to develop knight and block queens diagonal",
        "11. Nc3": "White continues with development and defence of e4 pawn",
        "11... d6": "The queen is bothering me and I want to move it before I castle",
        "12. Qg3": "I now see a way of capturing whites queen",
        "12... Nh5": "If white moves Qh3 then Ng5 will ensure queen is captured however",
        "13. Qh4": "Opponnent sees my plan",
        "13... Nf6": "I retreat",
        "14. Rd1": "White lines up rook for possibility of later attack??",
        "14... Bb7": "I now open up second diagonal of attack. Both bishops are in good positions and I am happy",
        "15. Bb2": "White follows suit.",
        "15... O-O-O": "With whites attack strongly on kingside I now castle on queen side!!",
        "16. e5": "Again I feel under pressure so attack queen",
        "16... g5": "White has no other option as white queen has no where else to go so exchanges",
        "17. Bxe6+": "bishop for knight",
        "17... fxe6": "I take the bishop again feel as I am in a better position as whites attack isn't well developed",
        "18. Qxg5": "I feel white made a blunder here as now will allow me to open yet another line of attack which will cost him the game",
        "18... Rhg8": "Rhg8 now supports attck on g2 pawn with added pressure from bishop and queen white was now in trouble",
        "19. Qxf6": "Queen takes knight sacrifice and I can put my final attack together.",
        "19... Bxf2+": "Checking king and hoping that white will move king to h1",
        "20. Kh1": "Which he does",
        "20... dxe5": "I take pawn hoping that white will fall into the trap and take pawn on e5 with knight which he does",
        "21. Nxe5 Bxg2#": "Checkmate. I suppose I got lucky in the end but still feel the game warrants annotation as it shows the importance of good lines of attack. I hope you enjoyed it. "
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=18941",
    "gameName": "Team match",
    "players": "jugaz (1469) vs. darren6464 (1470)",
    "opening": "Sicilian defence (B32)"
}