{
    "moves": {
        "1. e4 e5 2. Nf3 d6": "This defense is considered standard, but is probably inferior.",
        "3. d4 exd4 4. Nxd4": "Nxd4?! is playable of course, but perhaps stronger is 4. Qxd4!?, with 4... Nc6 being answered by 5 Bb5, while after 4... Bd7 white can develop his Bc1 and then answer Nc6 naturally with Qd2. ",
        "4... Qh4": "Qh4? is simply bad. There is a line in the Scotch game where Qh4 is played, however, but that is with extenuating circumstances.",
        "5. Nc3 c6": "It is now clear that Qh4 did nothing.",
        "6. g3 Qd8 7. Bg2 h5 8. h4 Nd7 9. Bg5 Be7": "Be7?? loses.",
        "10. Bxe7": "Now Bxe7?? lets black back into the game. Instead 10. Nf5! threatening both g7 and d6 is winning: Bxg5 Nxd6+ Kf8 (Ke7 hxg5) hxg5 and now Qxg5?? loses a piece to Nxc8 (Rxc8 Qxd7).",
        "10... Qxe7": "Qxe7?? loses again! After Nxe7 black is holding for the moment, although having lost his dark square bishop the d6 pawn may be in some trouble.",
        "11. Qd3": "Qd3?? lets black back into the game! Again Nf5 wins.",
        "11... Ne5": "Now the f5 square is guarded.",
        "12. Qe2 Bg4 13. Bf3": "Bf3?? drops a piece.",
        "13... Nxf3+ 14. Nxf3 O-O-O": "0-0-0?? lets white back, instead ... Qf6! is winning.",
        "15. O-O-O Qf6 16. Rd3 Re8 17. Qd1 Kc7 18. Re1 d5": "Of course this invited complications. Perhaps black should have avoided it altogether. Of course, it is also true that black did not defend at all in the game, but it appears that even with reasonable play the reply exd5! may be strong.",
        "19. exd5": "This appears sound, although it should not have led to as large an advantage as it did in the game.",
        "19... Rxe1 20. Qxe1 Bxf3 21. d6+ Kd7": "This is the point where black might have wanted to pay attention. Clearly the maneuver Qe3-a7 is possible, so black might have wanted to defend by 21 ... Kd8 22 Qe3 Bg4 23 Qxa7 Bc8. With two pawns already and a potential third on b7 following Ne4-c5 (or potentially Na4-c5/b6), white looks better, but black could have continued playing.",
        "22. Qe3 Bd5 23. Nxd5 cxd5 24. Rxd5": "Rxd5? is probably bad. Instead 24 Qxa7! seems to leave white with a winning position.",
        "24... Qe6": "Of course, this loses. Black could have tried ... b6! perhaps?",
        "25. Qc5": "Now white is winning.",
        "25... Ne7 26. Qc7+ Ke8 27. d7+ Kf8 28. d8=Q#": ""
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=55119",
    "gameName": "Team match",
    "players": "veganjohn (1495) vs. gittite (1478)",
    "opening": "Philidor (C41), exchange variation"
}