{
    "moves": {
        "1. e4": "I was Black in this game in a team match. This game shows the importance of pawns. Especially in closed positions.",
        "1... c5": "The Sicilian Defense.",
        "2. Nf3": "White's other playable options are Nc3, f4, and c3. Risky, but interesting options are d4 and b4. And unsharp options are Bc4 and d3.",
        "2... e6": "This is Black's most flexible move, because it doesn't immediately commit to a plan, and simply opens lines for development. Moves like d6 and g6 already commit to a plan. Nc6 doesn't commit to a plan either, but it allows the sharp Bb5 opening, which is a serious distraction to Sicilian players who don't know the opening.",
        "3. Nc3": "I haven't revealed exactly what I plan to do in this opening, so White doesn't either. He just simply develops a piece. And playing 3.d4 against the e6-Sicilian isn't as strong as it is in other Sicilians.",
        "3... a6": "I make another move that doesn't commit to a plan. In most openings, and especially Sicilian ones, it is very important not to reveal your plans within the first few moves. Although I think 3...Nc6 was more accurate here, since 4.Bb5 isn't strong anymore because I can simply play 4...Nge7.\r\nAnd 3...d5 is terrible because you shouldn't open up the position when you're behind in development. White is very good after 4.exd5 exd5 5.d4!.",
        "4. d3": "White is the first to commit to a plan. White playing d3 in any Sicilian signifies that he wants to play a Closed Sicilian, where he tries for a slower, more strategic buildup.",
        "4... Nc6": "A simple developing move. Playing 4...b5 may be risky.",
        "5. Be2": "It is better to fianchetto the King's bishop in the Closed Sicilian, because it gives White a King's Indian-type setup. The bishop isn't as strong on e2.",
        "5... d5": "Perhaps this boost was premature. Like I said, opening up the position can be risky if you're behind in development.",
        "6. exd5": "A more common strategy for White is to castle and keep the pawn on e4, where it can be replaced with the d3-pawn.",
        "6... exd5 7. Bf4": "Not the strongest move, because the bishop doesn't do much here. And if White plays 7.d4, then I play 7...c4 and am strong on the light squares.",
        "7... Bd6": "I immediately challenge White's questionable bishop move.",
        "8. Bxd6": "Bg3 is another option, and goes into more complicated variations.",
        "8... Qxd6": "Now I have a strong centre and am catching up in development.",
        "9. O-O": "When the e-file is wide open, it is a signal to castle immediately.",
        "9... Nf6": "I plan to do the same.",
        "10. Re1 O-O": "Just in time.",
        "11. h3": "Whie plans to strategically maneuver his knights. A common strategy in closed positions.",
        "11... b5": "White should've tried stopping this boost with a4, but I'd most likely be able to make this boost eventually. ",
        "12. Nh2 b4": "While White is busy maneuvering on the kingside, I am already storming the queenside with my strong pawns. Pawns are especially valuable in closed positions, because they hold everything together. Pawns aren't worth much in open positions because they tend to act like speed bumps.",
        "13. Na4": "I thought Nb1 was better, because the knight can redevelop and reach better squares. The knight isn't very active on a4.",
        "13... Be6": "I'm preparing for a c4 boost at some point in the game.",
        "14. Ng4": "White is trying to distract me by taking action on the kingside.",
        "14... Nd7": "I simply decline his trade offer and maneuver my knight toward the queenside where it is needed. I don't need any complications on the kingside where White's play is.",
        "15. Bf3": "White's kingside isn't improving very much, and my queenside is already creeping up.",
        "15... Rfb8": "Maybe Rab8 was better, because I should get this rook to the c-file to help with my planned c4 boost.",
        "16. b3": "White is passively defending my pawn storm. This move may make my future c4-boost even stronger.",
        "16... Nb6": "I wan't to get rid of White's defensive queenside piece. Notice how White's pieces are scattered and inactive, while mine are all directed toward the queenside.",
        "17. Nxb6 Rxb6 18. a4": "White is trying to close off the queenside, where all my play is. White shouldn't be worrying about my queenside attack. In closed positions, especially the Closed Sicilian, you should try an attack on the opposite wing before your opponent completes theirs.",
        "18... Na5": "Getting more forces for my c4-boost.",
        "19. Qd2": "White needs to get his queen in the game for a counterattack. Something he should've been doing a long time ago.",
        "19... Rc8": "Now that my rook is off the dangerous diagonal, my c4 boost is ready to play.",
        "20. Qg5": "White realizes he needs to counterattack on the kingside instead of trying to defend my queenside storm.",
        "20... c4": "My attack was completed first.",
        "21. dxc4 dxc4": "Notice how White can't play Qxa5 because of Rc5! trapping his queen. Trapping pieces is common in closed positions.",
        "22. Re5": "White sees my threat and tries to challenge my knight, but he has underestimated the power of my pawns.",
        "22... cxb3": "Pawns are very valuable in closed positions. A lot of times two pawns can be worth more than a piece, as here. In open games it's the opposite. Pawns are almost worthless and four pawns can sometimes be worth less than a piece.",
        "23. Rxa5": "White's other option is accepting the loss of a pawn and passively defending his queenside.",
        "23... bxc2": "Now I have two connected advanced passed pawns. Probably better than my knight.",
        "24. Bd5": "White has to make a do or die attack instead of waiting passively for my pawns to advance.",
        "24... b3 25. Bxe6 fxe6": "Maybe Qxe6 was stronger, but I was too impatient to allow Rd5.",
        "26. Nh6+ Kf8": "Obviously Kh8 loses to Nf7 .",
        "27. Rf5+": "White realizes he must play a risky attack, because playing safe will only let me advance my pawns easily.",
        "27... exf5 28. Qxf5+ Ke7": "I cannot allow White to take my rook with check.",
        "29. Re1+": "White wants me to play Kd8, allowing Nf7 .",
        "29... Qe6": "I can give up my queen because my passed pawns will promote soon.",
        "30. Ng8+": "A last desperate attempt to stop my pawns. White wants my rook off the c-file so that I won't be able to promote as easily.",
        "30... Rxg8 31. Rxe6+ Rxe6": "Now all I have to do is get my king safe and promote.",
        "32. Qc5+": "White controls my pawn's promoting square.",
        "32... Kd7 33. Kh2": "White can't do anything in this position. His only chance is to keep checking my king, hoping for perpetual check.",
        "33... Rc8": "Now White \"has\" to check my king to avoid losing.",
        "34. Qd5+ Rd6": "Once White runs out of checks, there'll be nothing stopping me from promoting. The rest of the game was easy.",
        "35. Qf7+ Kd8 36. Qf8+ Kc7 37. Qf7+ Kb6 38. Qxb3+ Ka5": "White resigned, because he has run out of checks, and there is nothing stopping me from queening. This game is a good demonstration of the power of pawns, especially in closed positions."
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=2405",
    "gameName": "Team match",
    "players": "vicit (1647) vs. bakerbaker (1657)",
    "opening": "Sicilian defence (B40)"
}