{
    "moves": {
        "1. d4 Nf6 2. e3 e6 3. a3 c5 4. Nf3 Nc6 5. Bc4 a6": "Aiming to support b5 and c4, squeezing the Queenside with black pawns. I expected white to play a4 here, thus losing a tempo to hold onto the territory on that side.",
        "6. O-O b5 7. Be2 c4 8. b4": "Hoping for cxb3(e.p.) perhaps?",
        "8... Be7 9. Nc3 O-O 10. Ne5 Bb7 11. Bf3 Qc7 12. Nxc6 Bxc6 13. d5 Nxd5 14. Bxd5 exd5 15. Nxd5 Bxd5 16. Qxd5 Rad8 17. Bb2": "The game now looks very even. It is hard to see how to move on here, and the d7 pawn looks likely to remain weak as it cannot get ahead of the c4 pawn.",
        "17... Qc6": "Hoping to swap Queens and open the d file and lessen the weakness of the d7 pawn (it allows c5 and the exchange of pawns)",
        "18. Qe5": "Oops...",
        "18... Bf6 19. Qf4 Bxb2 20. Ra2 Qf6 21. Qxf6 Bxf6": "Consolidating the position, and maintaining the advantage. D7 pawn is still weak, but this is no longer concerning.",
        "22. f4": "Giving me Re8 and maintaining the initiative - I think this was to support a kingside pawn rush starting with g4, but it seems unsupported.",
        "22... Rfe8 23. Rf3 g6": "Helping against the risk of g4 / g5. I really need to keep the bishop on the long diagonal as it has incapacitated the white rook and white cannot play c3 to free the rook either. Perhaps white needs a4 for counter play opportunities.",
        "24. g4 Re4": "Trying to increase the pressure on the e3 pawn. I was looking at Bc3 -> Bd2, but held off as Ra2 is tied up and c3 is not possible whilst the bishop can capture it.",
        "25. g5 Bc3 26. Kf2 Rde8": "Now the pawn cannot survive if black gets Bd2 -- Ke2 is the logical defence.",
        "27. h4 Bd2 28. c3 Bxc3": "Taking the free pawn. c4 is now a fully passed pawn, and has become very powerful.",
        "29. Rc2 Bg7 30. Rh3 d5": "Hoping to push through in the middle.",
        "31. Rc3": "Oops... dropping the rook.",
        "31... Bxc3 32. Rf3 Bb2 33. h5 Bxa3 34. hxg6 hxg6": "Material swapping is now in blacks favour. After Bxb4 the game is safe.",
        "35. Rh3 Bxb4 36. Rh8+ Kxh8 37. Kf3 Re4xe3+ 38. Kg4 Be1 39. f5 Rg3+ 40. Kf4 Re4#": "Game annotation for team benefit --"
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=9987",
    "gameName": "Team match",
    "players": "tkelly910 (1528) vs. topazg (1538)",
    "opening": "Queen's pawn game (A45)"
}