{
    "moves": {
        "1. d4 Nf6 2. c4 c5": "Aiming for the Benko. This is solid counterattacking play.",
        "3. Nc3 cxd4 4. Qxd4": "Black has a central majority, but will be hard pressed to take advantage of it.",
        "4... Nc6 5. Qh4": "A sensible retreat.",
        "5... e5 6. Nf3 Bc5 7. Bg5": "Putting pressure on the knight; white controls this diagonal.",
        "7... Qb6": "Rather than opposing this, black reduces its worth: if there was somewhere to go, then the knight would be free to move, and black has a rather more dangerous attack: capturing on f6 leaves white a bishop down with his king in severe danger after 8...Qxb2 9.Bxg7 Qxc3+ 10.Kd1 Qxa1+ 11.Kc2.",
        "8. b3 Qa5 9. Bd2 Bb4": "White has lost his own diagonal, and is instead under severe pressure at the other end of the board.",
        "10. Rc1 Bxc3 11. Bxc3 Qxa2 12. Nxe5 Qxb3 13. Nxc6": "This recovers the pawn, but perhaps white would have been better off accepting the material decefit and relying on his position.",
        "13... dxc6 14. Bxf6 gxf6 15. Qxf6 Qb4+ 16. Qc3": "Interposing with the rook is almost certainly better, giving white good chances of at least a draw.",
        "16... Qxc3+ 17. Rxc3 Be6": "Now black gains the advantage: while his pawn structure is weak, his pieces cut through the position like a knife through butter, while white's peices, locked up and inactive, are unable to effectively respond with any kind of plan or counterplay.",
        "18. e3 Rg8": "Tying the bishop to defending g2.",
        "19. g3 O-O-O 20. Bg2 Rg5": "Seizing the key open rank, which allows the rook to maneuvre around the board freely. Nevertheless, white would be alright now if he simply castled: 21.0-0 Rc5 21.Rc1 Rd2 gives black a clear advantage, but with accurate play white should draw.",
        "21. Bf3 Rc5 22. Be2 Bh3": "The h1 rook is trapped; the king is trapped; and at least one of the c3 rook and bishop is tied to defending to c4 pawn. Black could win a pawn via b5, but it would almost certainly be only a temporary advantage with the doubled c-pawns, and black would ruin his structure for no good reason.",
        "23. f4 Ra5": "With the obvious threat of ...Ra1+, but also gaining an outpost on the seventh rank that quickly leads to another.",
        "24. Rc1 Ra2 25. Bf1": "25.Rd1 is better, although still losing after ...Re8 26.Kf2 Ra3.",
        "25... Bxf1 26. Kxf1": "White is entirely confined to his back rank: 27.Rc3? Ra1+ 28.Kg2 Rd2+ wins a rook and creates a net around the white king.",
        "26... Rdd2": "Both rooks are on the seventh rank and able to go wherever they like, while white's may neither stray from the first rank, nor go too near to the king.",
        "27. h4 Rdf2+ 28. Ke1 Rae2+": "White resigned, on the grounds that black will simply chew up his pawns, one by one, before exchanging rooks and promoting a pawn, and there is no point in delaying the inevitable."
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=24293",
    "gameName": "Team match",
    "players": "donaloc (1599) vs. goingdown (1621)",
    "opening": "Benoni defence (A56)"
}