{
    "moves": {
        "1. e4 e5 2. d4": "Centre counter, should give white open lines to attack with, and better centre control",
        "2... exd4": "Accepting the pawn, the better move. Trying to protect the pawn gives white the option to push the d-pawn to d5 cramping blacks position.",
        "3. c3": "White is now offering an extra pawn for speedier development. Accepting means black has to be accurate with his defence as white has better attacking options",
        "3... dxc3": "I always take the extra pawn, although it hasn't brought me much success in the past. White now has the options of Nxc3 or Bc4.",
        "4. Bc4": "The danish gambit, offering a 3rd pawn to allow white to get 2 bishops aimed at the kingside, and a lot of room on his queenside.",
        "4... Nc6": "I decide I need to do some developing. More usual is cxb2, but a pawn up I feel no need to grab extra material at the minute. I go back on this decision next move, but with the night on c6 I have the option of Ne5 protecting the weak f-pawn if things get difficult",
        "5. Nf3": "Still ignores the pawn and continues development",
        "5... cxb2": "I take the pawn allowing white to develope a 3rd piece to my 1.",
        "6. Bxb2": "Naturally recaptures the pawn. In this position white although 2 pawns down looks in a very strong position.",
        "6... d6": "Played to allow me to move the g8 knight out without the annoying e5 push from white.",
        "7. O-O": "Castles to safety and brings out a rook which, when the queen moves, has 2 open files to use.",
        "7... Bd7": "I cannot play an immediate Nf6 as Ng5 will cause a number of problems. So I play a quiet move and wait for white to show his hand",
        "8. Nbd2": "White continues development, bringing out his final minor piece. He moves the knight here to keep it out of the line of his bishop on b2. The move seems awkward, and blocks the queen, but I would think the main aim of it is to allow the rook some movement. With three open files to use two well placed rooks could be a major asset for white.",
        "8... Be7": "A terrible blunder, leaving the g2 pawn completely undefended. Such a simple mistake, and brings up a major point I was always telling the novices I taught. Always, before making a move, consider what your opponent will play. Whether this is a threat you need to block or a weakness you create with a move.\nAfter a move like that it's crucial to maintain focus and keep fighting, even if you have given your opponent a winning advantage. ",
        "9. Bxg7": "Winning the pawn and the exchange",
        "9... Bf6": "Naturally to win back the bishop after it takes the rook. My hope in this position is that the extra pawn and bishop pair will give me some chance of defending the game",
        "10. Bxh8 Bxh8": "At this point I badly need to rearrange my forces and castle. My opponent however continues to make small threats that I need to defend, giving me no time to achieve anything I want to.",
        "11. Rb1": "A subtle move, but very clever. As I mentioned before I badly want to castle, and can only do this queenside. Whites move forces a very difficult choice.\n1) 11...Rb8 giving up castling rights, and trapping my king in the centre\n2) 11...b6 weakening the white squares on the queenside, making it less safe to caslte. eg Ba6 gets behind the pawns and opens up mating threats on b7 with either the queen or by pushing the a-pawn to open up the pawns",
        "11... Rb8": "Relatively best, but my play needs to be accurate to avoid a swift checkmate with my exposed king",
        "12. Qc2": "A quiet move, setting up the threat of 13. e5 and 14. Qxh7, with major complications.",
        "12... Nge7": "Played with the intent of Ng6 if white pushes the e-pawn. However again goes against my own policy of checking what your opponent can play. Better would have been Qf6, then if 13. e5 dxe5 14. Qxh7 Qg7, and I can improve my position with a queen trade, or by moving out the d7 bishop if the queen retreats.",
        "13. Qb3": "My knight move however means my queen can no longer move to defend the f7 pawn. This pawn will now fall, and my king driven away from the pieces near it. Notice that having so many pieces around the king actually ends up smothering him, and he's driven away and out of their protection",
        "13... Na5": "A desperate attempt to force a mistake, however it will be in vain as white plays solidly.",
        "14. Bxf7+": "Winning the pawn and pushing the king around",
        "14... Kf8": "Forced",
        "15. Qa3": "Offering the trade of bishop for knight, my knight move meant the queen couldn't stay on the bishops diagonal.",
        "15... Nac6": "I chose to avoid the exchange, which in hindsight is probably a mistake.\n1) The bishop plays a large role in trapping the king, keeping him exposed\n2) My knight is too far away to play any real role in defending the king, and had white played correctly the knight wouldn't have moved from c6\n3) In generaly fewer pieces on the board make a quick checkmate less likely, although the king does expose himself further in capturing the bishop.",
        "16. Ng5": "Again a simple threat to the h7 pawn, although I saw another threat Ne6  aswell. Looking back on the position I had considered 17. Ne6  Bxe6 (forced to protect the queen) 18. Bxe6 was totally winning with an impending Qf3  . However I had overlooked the resource 18...Nd4, controlling the f3 square, allowing me time to re-organise.",
        "16... Qc8": "Played to prevent the knight moving to e6",
        "17. Bh5": "Another quiet move that is very clever. The bishop stands ready to support a checkmate on f7, and prevents my king from running to the queenside by covering the e8 square.",
        "17... h6": "A futile attempt to push the attackers away, but not much is playable here. Perhaps Nd4 holds the attack for a move or two, but Qg3 is almost as crushing followed up with moves like Nxh7 and a rook lift.",
        "18. Qb3": "Qf3 would have been better, this move allows me to move my queenside knight round, giving a glimmer of hope to shielding the king.",
        "18... Nd8": "Defending the checkmate, but a look at the position tells me that my chances of holding the game are very small.\n1) I have no pieces beyond my 2nd rank\n2) My queen and rook are completely out of the game\n3) White has 3 pieces lurking around my king,and open files to bring the rooks into play.",
        "19. Qf3+": "White finally plays the crushing blow, it's pretty much curtains now",
        "19... Kg7": "Almost forced, the only other alternative is Kg8, which allows 20. Bf7  Kf8 21. Ne6  Bxe6 22. Bxe6  and again the queen is set to swoop in with a telling attack",
        "20. Nf7": "Another very clever move. I cannot take the knight with 20...Nxf7 due to 21. Qxf7#, and not taking it means 21. Nxd8 and I can't take back again because of 22. Qf7#.\nThe best move in the position would be Ne6, so that after an exchange on h8 the knight can move across to give the king some cover, however it is a badly losing position",
        "20... Be6": "Not seeing the resource Ne6, I thought I had to defend f7 with something other than the knight, which I had assumed would be taken next move. However my opponent once again finds a crushing blow to remove all hope of resistance",
        "21. Qc3+": "There is simply no defence, and I will lose the bishop, the best I have is Kf8 then Ng8 to prolong the match, however I have seen enough and trust my opponent would not throw away the advantage. Well played tekoahbaer, a good example of how to win in a won position."
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=4191",
    "gameName": "Team match",
    "players": "tekoahbaer (1617) vs. alloutwin (1610)",
    "opening": "Danish gambit (C21), Collijn defence"
}