{
    "moves": {
        "1. e4 e5 2. Nc3": "King's pawn opening, Vienna Game.  ",
        "2... Nf6": "Falkbeer Variation of the Vienna Opening.",
        "3. d4": "Nf3 is the most popular response, though black seems to enjoy a slight advantage with that.  Bc4, f4, and g3 are other popular responses for white.  Pd4 seven moves down the list, and is black's favorite response down to Bd3, which thoroughly traps white's black bishop.",
        "3... Bd6 4. Bg5 h6 5. Nd5": "In Jolivos vs. Ratinho, Jolivos moves Bh4.  With Nd5 white trades a knight and bishop for a knight and pawn.  Not a bad trade if white ends up exploiting some brilliant positional advantage not readily apparent to me here.\n\nhttp://gameknot.com/analyze-board.pl?bd=5862002&mv=9&rnd=0.9964051939155457\n",
        "5... c6": "While this permits the black queen's easy access to the field, I wonder what was wrong with white's free bishop?  That's not a trojan bishop.  I think it is a Free Methodist bishop.  Methodist, Baptist, Presbyterian--either way black open's the king rook's file by taking it, gaining another slight advantage.",
        "6. Nxf6+ gxf6 7. dxe5 Bxe5 8. Be3 b5 9. Bd4 Qe7 10. Bc3": "With this move black's trade of bishops doubles white's pawns (a minor annoyance), while sacrificing Pe4.  (10. Bc3 Bxc3+, 11. bxc3 Qxe4+.)  White interposes the queen or knight, because Be2 results in Qxg2, which some call a \"poisoned pawn,\" but black begins racking up a pawn point advantage by it.",
        "10... b4": "Interesting.  Not as good as BxB, but, ok.",
        "11. Bxe5": "White's obvious response.  Bd2 is not an alternative, since black's response is Bxb2, and then white must move a rook, and black again enjoys QxPe4+.",
        "11... Qxe5": "PxB undoubles black's pawns, but this move is clearly better.  White loses either b2 or e4.",
        "12. Bd3": "Bye, b2.  We hardly knew you.  White still enjoys options, as the queen has Ra1 covered.  I like Nf3, to get the knight out onto the playing field.",
        "12... Qxb2 13. Ne2": "Ne2 too is good.  Even Nh3, followed by Nf4.  White has options",
        "13... Qe5 14. Ng3": "Excellent!  Establishes control over the center, while protecting the king's castle.",
        "14... Ba6 15. Nf5 Bxd3 16. Qxd3": "Blunder.  PxBd3 leaves the white queen protecting Ra1.  While it is nice to have the d file open for the queen, black will trade queens if white interposes, since every every subsequent trade boosts black's material advantage.  If white moves the king both rooks fall for free.",
        "16... Qxa1+ 17. Qd1 Qxd1+ 18. Kxd1 a5 19. Re1 Na6 20. e5 fxe5 21. Rxe5+ Kd8 22. Rxa5 Kc7 23. Nd4 Rhe8 24. Nb3 d6 25. Rh5 Re6 26. Rf5 Rf8 27. Nd4 Re5 28. Rf4": "Mm, I kind of like Rf6.  Black might respond with Rh5, then white moves h3.  Rg5, g3...  White's pawns defend each other.  Rc5 or (better) Ra5 would be bad for black, as Ne6+ ends with white trading a knight for a rook (PxN, RxR).",
        "28... Rd5": "Well that pins white's knight.  Kc1 might be the best bet.",
        "29. Kc1": ":)",
        "29... Nc5 30. Ne6+": "Not now--Nxe6 for free.",
        "30... Nxe6 31. Rxb4 Rg8": "White could play for a stalemate.  White's a pawn is passed, while black's pawns have to claw their way through white's.  So white still enjoys some advantages.  A stalemate is as good as a victory if that half point wins the match for the team.\n\nThat extra rook and knight can work to white's advantage.  Give a guy a .22, and he has to be very cautious with shot placement.  But armed with a bazooka, overconfidence can lead to disaster--black could shoot his own foot off."
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=55213",
    "gameName": "Team match",
    "players": "phoag53 (1293) vs. tommyflyer (1347)",
    "opening": "Vienna (C26), Falkbeer variation"
}