{
    "moves": {
        "1. e4 e5 2. Nf3 d6 3. d4 Nd7 4. Bc4 h6 5. dxe5 dxe5 6. Bxf7+": "There are lots of tactical traps to play after 6... Kxf7 7. Nxe5 (Black cannot play 7... Nxe5 because of 8. Qxd8).",
        "6... Ke7": "Black leaves the bishop alone, but now has dropped a pawn and lost the ability to castle.",
        "7. Bg6": "Defends the e4 pawn and keeps the mobility of the king down. If 7... Kf6 8. Bf5 is planned, but perhaps after 8... g6 black can start to mobilise pieces.",
        "7... Ngf6 8. Nc3": "Threatens a future Nd5  check, and just generally helps development",
        "8... b6": "Clearly aiming for Bb7, I decided that the timing is right for 9. Nd5 , as the exchange after 9... Nxd5 10. Qxd5 is favourable for white -- the rook at a8 is hanging and the Queen can join with the bishop to attack black's king",
        "9. Nd5+ Ke6": "Chose to avoid the exchange, but doesn't achieve anything solid with this move.",
        "10. Bf5+": "Only two options here -- if 10... Kd6 then 11. Nxf6  is very painful, as it drops material for nothing and allows white to swap off the other knight, the c8 bishop and the queen on the d7 square, whilst leaving white the next move to castle kingside.\n\nif 10... Kf7 then I plan on 11. b3 to fianchetto the c1 bishop and attack the lone e5 pawn. If 11... Bb7 then 12. Nxf6 is possible, but my e4 pawn is in danger, so perhaps another strategy will be required. Nc3 seems passive but perhaps Nxe5  is strong instead...",
        "10... Kf7": "The only safe option.",
        "11. b3 g6": "Interesting, I rather like the bishop here, so I will lay a trap that, in the worst case, leaves a straightforward material exchange.\n\n12. Nxf6 only allows a King capture (before g6 the pawn was possible) now, as 12... Nxf6 13. Qxd8 seems losing.\n\n12... Kxf6 13. Qd5 leaves some interesting threats. The rook is hanging but if 13... Rb8 14. Qe6  Kg7 15. Qxg6# is a straight win. interestingly, 13... gxf5 14. exf5 is also good as the pawn can replace the bishop in the mating attack if 14... Rb8\n\nAlternatively, 13. Ne5  is also strong, with 13... Kxe5 14. Qd5  winning material for white.\n\n12. Nxf6 seems therefore to give white a potentially winning advantage, unless there is some trickery I have missed!",
        "12. Nxf6 Kxf6 13. Qd5 Qe7": "An unexpected defence. I guess I assumed black would either move the rook or take the bishop. This seems to lose material now as the bishop can escape with a capture on the knight at d7",
        "14. Bxd7 Bxd7 15. Qxa8": "Material is heavily lost now, and black requires some tactical counter-play. I need to make sure the exposed nature of my king does not allow tactical combinations involving the queen and bishops. For example, whilst my queen rests on a8, a check with the f8 bishop allowing the rook to capture it is a real risk, albeit when the black queen is no longer on e7.",
        "15... Qb4+ 16. Bd2 Qxe4+": "The irony is, I had also missed the fact this pawn was defended when I played Bd2, and very nearly played 17. Kd1\n\nFortunately I spotted the capture in time... ",
        "17. Qxe4": "Game annotation for team benefit --"
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=10006",
    "gameName": "Team match",
    "players": "topazg (1497) vs. drcrack (1493)",
    "opening": "Philidor (C41), Hanham, Krause variation"
}