{
    "moves": {
        "1. e4": "I have been asked to annotate this game",
        "1... d5": "The centre counter defence, a respected, if slightly unambitious defence.",
        "2. exd5": "White takes.",
        "2... Qxd5": "Black takes back",
        "3. Nc3": "White hits the queen.",
        "3... Qe5+": "Black throws in a check. I remember reading an article in the magazine \"Chess\" promoting this move, although post-match computer (hereafter referred to as \"computer\") gives it as an error. The downside is that White can continue with Be2 and Nf3 hitting the queen again. The article suggested continuing 4. Be2 c6 5. Nf3 Qc7 and justified this on the grounds that c6 and Qc7 is often playing in this opening anyway. I am not convinced!",
        "4. Qe2": "White doesn't go in for the lines mentioned above. I think white should",
        "4... Qxe2+": "So black takes",
        "5. Ngxe2": "white takes back",
        "5... Bf5": "Black hits c2",
        "6. d3": "White defends. Computer gives Nd4 as better, but I don't agree!",
        "6... Nc6": "Black develops",
        "7. Bf4": "white hits c7",
        "7... e5": "Black develops and defends against the threat.",
        "8. Ng3": "White counter attacks. I wonder if black considered Bxd3 here? It seems to win a pawn. Computer prefers Be6.",
        "8... g6": "But black plays this",
        "9. Be3": "White now retreats",
        "9... Bb4": "Black develops",
        "10. Bd2": "White prevents the doubling of his pawns. Computer gives this as a mistake, and I tend to agree.",
        "10... Nd4": "Computer prefers Be6, but I like this move, attacking c2 and protecting Bf5",
        "11. O-O-O": "White protects c2 and develops.",
        "11... a5": "This is given as a mistake and I agree.",
        "12. Nd5": "White copies black's idea. This is also given as a mistake.",
        "12... O-O-O": "As is this. Computer prefers Bxd2+ first. I tend to agree. Computer also prefers 13. Nxb4 to white's next. ",
        "13. Nxf5": "But white takes here.",
        "13... gxf5": "Black takes back. Computer prefers Bxd7 first. I agree. In an open position like like bishops are better than knights. Also I think 13.....Nxf5 is better than gxf5, as it avoids pawn weaknesses.",
        "14. Nxb4": "So white makes it two knights v two bishops.",
        "14... axb4": "Black takes back.",
        "15. Bxb4": "And white wins a pawn. Computer puts white +2.21 here.",
        "15... b6": "b6 is a reasonable move, if followed up with c5, blocking the bishops lovely diagonal.",
        "16. c3": "white attacks the knight",
        "16... Nf6": "which black seems to completely miss.",
        "17. cxd4": "So white takes the knight",
        "17... Rxd4": "Black takes the pawn.",
        "18. Bc3": "White retreats the attacked bishop.",
        "18... Ra4": "Black continues to attack with the rook. Computer gives this as a mistake, black has to retreat his rook to d5 to protect e5.",
        "19. Kb1": "But White fails to exploit this. 19. Bxe5 was better.",
        "19... Nd5": "19.....Nd5 is not given as a mistake, but I can't see why black just gives up another pawn. Can't black play Ne7 or Re8 or maybe Ng4, what do you think dear reader?",
        "20. Bxe5": "So white just takes",
        "20... Re8": "Black moves the attacked rook.",
        "21. d4": "A good move, protecting the bishop and opening a line for his other bishop.",
        "21... Rd8": "Rd8 is not given as a mistake by the computer, but I can't see the point of it. 21....f6 seems better to me, although really black position, a pawn and bishop down, is completely lost.",
        "22. Rd3": "White comes up with a reasonable plan - it is usually a good idea to exchange pieces not pawn if you are materially ahead.",
        "22... f6": "Better late than never!",
        "23. Ra3": "White throws away material. Black could have exchanged on a3 and then on e5 and would still have fighting chances.",
        "23... Rb4": "But black is a beginner too!",
        "24. Bg3": "And here I don't understand why black can't just take on d4. ",
        "24... Re8": "This move is not given as a mistake by the computer however.",
        "25. Bd3": "And neither is this, although I would prefer Rd3 hanging on the pd4.",
        "25... Rxd4": "Which goes at last.",
        "26. f3": "White makes room for his bishop.",
        "26... f4": "Black attacks the bishop.",
        "27. Bf2": "Bishop attacks rook.",
        "27... Rb4": "Black naturally moves the rook, but white could very easily win here with Rb4 28. Ra8+ Kd7 29. Bf5+ Ke7 30. Re1+ Ne3 31. Bxe3 Rxa8 32. Bc5+ Kf7 33. Bxb4 c5 34. Bd2 Rd8 35. Bxf4 b5 36. Be6+ Kg6 37. g4 Kg7, so Rxd3 is maybe better, although black is lost in any case.",
        "28. Be1": "White misses that chance.",
        "28... Rd4": "Black is forced to repeat.",
        "29. Kc2": "White misses a quicker win with 29. Ra8+ Kb7 30. Rxe8 Rxd3 31. Bh4 Re3 32. Re1 Rxe1+ 33. Bxe1 Ne3 34. g3 Nf5 35. gxf4 Nd4 36. Bc3 Nxf3 37. Rh8 Nxh2 38. Rxh7\r\n",
        "29... Nb4+": "This looks clever, but hastens the end. Kb8 30. g3 Ne3+ 31. Kc3 c5 32. Bxh7 Nd1+ 33. Kc2 Re2+ 34. Kc1 Nxb2 35. Bc3 fxg3 36. hxg3 Rc4 37. Bg8 Nd3+ 38. Kb1 is better, but still bad for black.\r\n",
        "30. Bxb4": "White plays the right move.",
        "30... Rxb4": "Black takes back.",
        "31. Kc3": "There is only one way to protect the rook on b4 now, but it loses the other rook. Black could resign here.",
        "31... c5 32. Ra8+ Kd7 33. Bf5+ Ke7": "Computer gives Ke7 as a blunder, as it is mate in 10 now, but is Kc7, as suggested by the computer really better?",
        "34. Re1+ Kf7 35. Rexe8 Rd4 36. Be6+ Kg6 37. Reg8+ Kh6 38. Bf5": "Bf5 is given as a blunder, as 38. Raf8 Kh5 39. Rxf6 Rd3+ 40. Kxd3 c4+ 41. Bxc4 b5 42. Bf7+ Kh4 43. Rxf4# mates quicker, but it doesn't really make any difference.\r\n",
        "38... b5 39. Ra7 b4+ 40. Kb3 c4+ 41. Ka4 c3 42. Rxh7#": "Many thanks for reading my annotation. Please leave a comment or two and rate my annotation! Many thanks."
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=41325",
    "gameName": "Team match",
    "players": "michael333 (1277) vs. qprgeezer (1222)",
    "opening": "Scandinavian defence, Lasker variation (B01)"
}