{
    "moves": {
        "1. c4": "this can go several ways...possibly English opening",
        "1... Nf6 2. d4": "now it appears to transpose into a nimzo-indian",
        "2... e6": "Nc3 and then Bb4 would be a nimzo-indian round-about, but this game doesn't take that direction. Being a transposed d-pawn opening though, it is a good idea to get the c pawn to c4 and the knight out behind it asap.",
        "3. a3": "this is a very unusual move, per the chessgames.com database 20,699 upper-ranked players played Nc3 here, whereas only 45 played a3 (with a 28.9 % white score and a 49.9 black win score). It now turns into a Queen Pawn game (E00) or a Queen's Indian (E12).",
        "3... a6": "NO more book moves, these guys are on their own.",
        "4. e3": "this looks like too many pawn moves with no development.  If Nc3 was in place, then the pawn could have gone to d4 right off...",
        "4... c6": "another pawn move, presumably preparing d5, but it wasn't needed (and now blocks the knight.",
        "5. b4": "total forgoing of development to get space. The problem is that if the pieces aren't out there the opponents pieces can invade behind the pawn wall. ",
        "5... d5": "here comes the d5 'break move' but it doesn't really break anything. Both sides are dangerously underdeveloped and and black at least can castle in 2 moves...",
        "6. Nf3": "scrambling to prepare for castling. Prevents e5 which WOULD be a break move for black (albeit a dangerous one).",
        "6... b6": "I read on digg.com today that checkers had been solved this week.... maybe these guys were inspired by this computer feat....",
        "7. c5 Ne4 8. Nfd2": "Why not the other knight....develop a piece and then exchanging knights would have doubled black's pawns. The only thing saving White so fare is that black isn't developing either. White may have planned to kick the knight with f3, but there are now dangerous threats with Qh5. ",
        "8... bxc5 9. bxc5": "black opens a file, but it will take a while to use it. ",
        "9... Qf6": "Immediate checkmate threat, plus threatens bishop sacrifice on c5 with pressure on the unprotected a-rook.",
        "10. Nxe4": "White quickly douses the flames.",
        "10... dxe4 11. Bb2": "threatens a discovery on the queen and somewhat protects the rook. White is still not too bad, both players have one iece developed and black has both doubled and 2 isolated pawns. White has one problem pawn, but the bishop is weaker than black's queen.",
        "11... Qf5": "black gets out of discovered attack.",
        "12. Bc4": "White prepares to castle.",
        "12... g6": "Black takes his time in castling in order to get a better bishop. ",
        "13. O-O Bg7 14. Qa4": "rooks still aren't connected. What is white attacking here...it does prevent the black knight from coming out but the queen is dangerously off-side. The precep of attacking on the side where the pawns are pointing does not apply here as the center is not locked and it was never the 2 central pawns that were locked (just the c and d pawns). ",
        "14... O-O": "now black castles (finally) but white can connect his rooks more quickly. ",
        "15. Nd2 e5 16. d5 Rd8 17. d6": "this stops the threat, but the c5 pawn is weak. If the knight has to go into service to defend c5, the king will be woefully blocked in....",
        "17... Ra7 18. Qc2": "good move - double threat on e4 and the queen can defend f2 if she has to... Black's queen would like to go to g5 and threaten Bh3, but the double attack on e4 prevents this. ",
        "18... Be6": "one way to remove the threat on e4.  (but white shows that it doesn't work) ",
        "19. Bxe6 Qxe6 20. Nxe4": "white grabs the free pawn and double protects the weak c5. However this may prove to be a poisoned pawn as it was keeping the black bishop forever blocked in.",
        "20... Nd7 21. Nd2": "seeing that the knight can be hassles by f5 he quickly moves out of the way, giving up double protection on c5.",
        "21... Nf6": "knight/queen combinations are deadly...white has to keep the knight out of the kingside. h3 would do it. ",
        "22. f4 exf4 23. exf4": "the problem here is that black gets the open file...two of them. The queen can get out of the way and switch in a rook on f8.",
        "23... Rb7": "a blockaid with Be5 or N to c4/b7 might be a plan here. Double threat on b2 and overworked queen problems are starting to arise.",
        "24. Rfe1 Qd5 25. Re5": "Re7 may have tied black up more and threatened using the good d pawn.",
        "25... Rxb2": "a bold exchange sacrifice.",
        "26. Qxb2 Qd3": "basically the only place for the queen to go....",
        "27. Rd1": "this just pins the unprotected rook....",
        "27... Ne4": "now black has a skewer on the rook and queen.....",
        "28. Qb3": "Qb1 would have been better....Qx on b1, RxQ, N takes a free knight on d2 or an exchange on e5 and NxN on e4....white at least has some counter-play with Q to b6 or b7 and using the advanced d-pawn.....instead a horrible windmill ensues....\nactually looking at this again, the windmill would have happened with Qb1 anyway....!",
        "28... Qd4+ 29. Kh1": "if white played K the other way to f1 it would be an immediate checkmate.",
        "29... Nf2+ 30. Kg1 Nxd1+ 31. Kh1 Nf2+ 32. Kg1 Nh3+ 33. Kf1 Qf2#": "beautiful windmill.....this game goes to show the power of queen/knight combinations. One of the benefits of having 2 bishops is the ability to exchange one of them at a propicous juncture in order to get rid of a nasty knight if need-be. Could white have kept the 2-bishop advantage instead of exchanging white bishops at move 19? It seemed reasonable at the time, as white valued the black bishop due to black being weak on black squares.....but maybe 19.Be2 was the better move.\nWhite played a good game,no real obvious errors until the end when (as it usually does) tactics took over. Probably 25.Re5 was the loosing mistake."
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=9240",
    "gameName": "Team match",
    "players": "chessknave (1450) vs. br4inz (1375)",
    "opening": "English, 1...Nf6 (Anglo-Indian defense) (A15)"
}