{
    "moves": {
        "1. d4 d5 2. c4 e5 3. dxe5 d4 4. Nf3": "This is all standard so far for the Countergambit so far",
        "4... Nc6 5. Bg5": "According to book my options here are 5. a3 5. Nbd2 and 5. g3. White's goal is to fianchetto the kingside Bishop and black often uses a long castle. Because I was unfamiliar with the opening I was the first to break standard play. ",
        "5... f6 6. exf6 Nxf6 7. e3": "I should probably have played 7. g3 here to free my light squared Bishop via the fianchetto or even captured with the Bishop although that allows Black's Queen into the game very quickly.",
        "7... Bb4+": "Now things start to get very cramped for white",
        "8. Nbd2 dxe3 9. Bxe3 Ne4": "There are now three pieces both attacking and defending the white d2 square and if Black can bring another piece into play white is going to have a difficult time",
        "10. Qe2": "Seeing the coming trouble I realized my best hope was for a long side castle although that part of the board is badly exposed. My pieces are all locked up and Black has more than adequate compensation for the sacrificed pawn as far as I can see",
        "10... Bg4": "Attacking one of the pieces defending the d2 square",
        "11. O-O-O": "This seems to be best play although the knight on e4 has to worry about getting pinned if White's dark squared Bishop moves away in something like. 11. h3 Bxf3 12. gxf3 Bxd2+ 13. Bxd2 ",
        "11... Qf6": "This was a blunder I think leaving the knight on e4 hanging. Up until this point I thought Black was in a much better position. Better might be 11. ... Qe2 12. Nxe4 Qxe4 although that line is not forced.",
        "12. Nxe4 Qe6": "Removing the Queen from being attacked but setting up some strong counterplay for white. I thought 12. ... Bxf3 13. Qxf3 Qxf3 14. gxf3 was better although trading Queens when down a piece is not usually a good idea.",
        "13. Neg5": "Bothing attacking the Queen and setting up a discovered check when the dark squared Bishop moves. 13. .. Qe7 seems the only good move for black to me and with White's light squared Bishop and queenside Rook still out of the game there is a chance Black can make some headway if he is able to castle.",
        "13... Qf5": "This is a mistake possibly overlooking the discovered check in the zeal to keep the pressure on my exposed King",
        "14. Bc5+": "I almost played 14. Bxa7 here grabbing material but this line had a lot more chances for blunders for Black and I wasn't sure opening the a rank to Black's Rook was a good idea in any case.",
        "14... Ne7": "This was not the correction response. I see 14. ... Qe5 as the only possible play to keep the game going. It continues something like this. 15. Qxe5+ Nxe5 16. Bxb4 Nxf3 17. Nxf3 and White has a large material advantage. Also possible is 15. Nxe5 Bxe2 16. Bxe2 Bxc5 17. Nxc6 Bxf2 with less of an advantage for White",
        "15. Qxe7#": "I thought Black played the Countergambit nicely until the Knight blunder and then compounded one bad move with several others. It is a feeling I know all too well. It is strange that once I make one bad move my first instinct is to blunder further rather than accept the loss and play strongly afterwards hoping for a mistake from my opponent. I imagine most of us have been there before."
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=29088",
    "gameName": "Team match",
    "players": "tomlib (1484) vs. atmoz (1513)",
    "opening": "QGD (D08), Albin counter-gambit, Alapin variation"
}