{
    "moves": {
        "1. c4 Nf6 2. g3 e6 3. Bg2 d5 4. d4 Bb4+ 5. Bd2 Bxd2+ 6. Nxd2 O-O 7. Ngf3": "The queen's Gambit declined/Catalan opening.",
        "7... c6 8. O-O Nbd7 9. Qc2 Re8 10. e4": "Preferable was a3, because white can then continue with b4, a4 and b5, weakening black's Queenside. Here, white concedes a small portion of his/her central advantage by losing a key centre pawn.",
        "10... dxe4 11. Nxe4 Nxe4 12. Qxe4 Nf6 13. Qc2": "White still has the advantage.",
        "13... b6 14. Rfd1 Bb7 15. c5": "I'm not quite sure what white wanted to accomplish with this move. Perhaps he/she feared the c5 push, which would only lose to dXc5. Now, the square d5 makes a nice nest for black's knight on f6.",
        "15... Nd5 16. Ne5 Qf6": "Not quite sure why I played this move. I may have wanted to play Rook d8 as a follow up. In hindsight, this is a slow plan. I don't think there was anything better though.",
        "17. Nc4 Ba6": "A mistake. I tried to get tempo and greater scope for my bishop, but leave d6 wide open for white's knight to settle. This secures a great advantage for white.",
        "18. Nd6 Red8 19. a3": "Better is Rc1, developing a major piece onto a half open C file. White also has the crushing Ne4, which actually wins a pawn after Qe7, cxb6, axb6, Qxc6.",
        "19... Rab8": "Trying to get counter play which actually works towards the end of the game. Right now, there's not a whole lot I can do.",
        "20. b4 Bb7": "Will white take the bishop? Probably not, but I was trying to remove the Knight at all costs.",
        "21. Rd3 a5": "I create an open b file.",
        "22. bxa5 bxc5 23. Qxc5 Ba6 24. Rf3": "White has an extra pawn and a great position. All is well...",
        "24... Qg6 25. Nxf7": "This completely loses. Being trapped in a false sense of security, white thinks, \"I'm up one pawn, lets grab another!\" Black now gains an unstoppable attack.",
        "25... Rb1+": "A flamethrower.",
        "26. Bf1": "White can't take the rook on account of checkmate.",
        "26... Bxf1": "If black takes the rook, white takes the rook with the Knight and has a checkmate of his/her own.",
        "27. Nh6+": "A desperate fling. Hoping for Qxh6 and then Rxb1",
        "27... gxh6": "This should be an insurmountable deficit. White resigns."
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=41609",
    "gameName": "Team match",
    "players": "gerd1978 (1711) vs. asimov45 (1690)",
    "opening": "English, 1...Nf6 (Anglo-Indian defense) (A15)"
}