{
    "moves": {
        "1. Nf3 d5": "I've got an idea for something new to try today.",
        "2. d4 f5": "I'm going to be teaching my class the Stonewall Defense, so maybe I should try it a few times before then.",
        "3. e3 Nf6 4. c4 e6 5. Nc3 c6": "So far, everything looks like normal development.\nNext, I'll be developing by Bishop to d6 so I'm ready to castle.",
        "6. cxd5 exd5": "Did I use the right pawn? I remember being nervous about cxd5 and leaving b5 undefended.",
        "7. Be2 Bd6 8. O-O O-O 9. Ne5": "We're thinking along the same lines. I figured that was coming, and I'll use my other knight to trade it off. \nBut I'm also trying to play Ne4 myself -- always a strong move in the Dutch, I've been told.",
        "9... Be6": "I want to get the bishop out before I move Nbd7 so it won't be blocked.\nOh, wait, it's still blocked by a couple of pawns, isn't it? But from here, at least it supports the f-pawn, and I also have the option of Bf7 and bringing it out on the kingside if there's anything interesting over there.",
        "10. f4 Nbd7 11. Qe1 Ne4": "Interesting how our knights on the e-file and the f-pawns are mirroring each other. But he still that backward pawn on e3, and I wonder if I can find a way to exploit it.",
        "12. Nxe4 fxe4": "In another annotated game, I said that I was tempted to take dxe4, and an annotator remarked that that capture is often calling to black but that taking with the f-pawn will almost always work out better. In this case, I like that the pawn can be supported by the queenside chain instead of having to play g6 to guard it with a pawn. I also like giving my bishop some extra room and maybe opportunities for the rook. ",
        "13. Bd2 Nxe5": "I knew I'd do this eventually. I can't let his knight stay there, I'm not happy with mine where it is, and I feel that his pawn setup will be worse than mine.",
        "14. fxe5 Be7": "I'm sure not going to trade rooks and let his queen go to f1. Yet this is starting to look like a massive trade-off is on its way.",
        "15. Rxf8+ Qxf8 16. Qg3 Bb4 17. Rf1": "My threat was too obvious. He's not going to trade and worry about my queen roaming around over there.",
        "17... Qe7 18. Bc1": "IMPLODe   K analysis:\nInitiative - no one seems to have an advantage\nMaterial - even\nPawn structure - I'm ahead. He has three pawn islands and doubled pawns\nLines & squares - I feel he's ahead because of his rook on f1 (temporarily) and his queen controlling the g-file is stronger than mine controlling e7-h4.\nOfficers - I'm ahead; my bishops are in better position (though only until he plays a3).\nDevelopment - even\nKing safety - even\n\nLooks to me like we're running out of pieces, and I'm not feeling excited about breaking through in the pawn endgame.",
        "18... Rf8 19. Rxf8+ Qxf8 20. a3 Be7 21. Bg4 Qc8 22. Bxe6+": "We called the draw here. As we get closer to an endgame with just pawns, I'm not feeling so confident. My king will be limited where it can go because of his passed pawn on e5."
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=21038",
    "gameName": "Team match",
    "players": "jankisa (1821) vs. chuckbo (1867)",
    "opening": "Reti opening (A06)"
}