{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6": "All standard so far",
        "3. c3": "Hmm, I don't think this move is a mistake but I don't usually see it. It could transpose into a Guicio piano.",
        "3... Nf6": "But I decided instead to take advantage of the fact that his QN can't defend the pawn.",
        "4. d3": "So now his LSB is blocked in",
        "4... Be7": "I thought this was the best square. d6 not only blocks in the d pawn but doesn't have much scope. On c5 it would just get chased away.",
        "5. d4": "A mistake that loses a pawn",
        "5... exd4 6. cxd4 Nxe4": "So I take it",
        "7. d5": "I'm not sure this is great. Sure it pokes my knight but it overextends the pawn so that it's harder to defend.",
        "7... Nb4": "A rather awkward square but the only other safe one was a5.",
        "8. a3 Na6": "It probably would have been better to go to a5 in the first place",
        "9. Bxa6 bxa6": "my queen side pawn structure is busted",
        "10. O-O d6 11. Qd4 Bf5 12. Nc3": "I don't want to exchange my centrally placed knight, but it looks like I have to.",
        "12... Nxc3 13. bxc3 O-O 14. Nh4": "?? This is the blunder. I guess he didn't realize I had two pieces attacking it.",
        "14... Bxh4 15. Be3": "I might have considered fianchettoing it, lining up the bishop and queen so that if the c pawn is moved checkmate is threatened. ",
        "15... Qf6 16. Qf4 Bg5 17. Qc4 Bxe3": "While this move does exchange material, I'm not sure it was so wonderful. Taking back opens up the file for the rook and pins my LSB.",
        "18. fxe3 Qg6": "I unpin it",
        "19. Qxc7": "...But lose the pawn",
        "19... Be4": "Forks mate and the d5 pawn",
        "20. g3 Bd3": "??? If I had taken the pawn it would never have promoted.",
        "21. Rf2 Qg4 22. Qxd6": "There goes another pawn and suddenly whites d pawn becomes a threat.",
        "22... Qh3": "Maneuvers closer to the WK",
        "23. Qf4": "Clears the way for the pawn to advance...",
        "23... Rad8": "Impeding the pawn",
        "24. d6 Rfe8 25. Rd1": "Forces the bishop out of the way so the rook can support the pawn",
        "25... Bg6 26. Rfd2": "The pawn can now advance safely",
        "26... h6": "With all those pieces lined up I was a little worried about a back rank mate",
        "27. d7": "It advances",
        "27... Re4": "At least I can make the queen move",
        "28. Qc7": "...But it just pushed the queen where it wanted to go",
        "28... Ra8 29. d8=Q+ Rxd8": "No other reasonable choice",
        "30. Qxd8+": "And I was really glad I created some space for my king",
        "30... Kh7 31. Re1": "Defends the pawn",
        "31... Rc4": "Goes for a different one",
        "32. Qa5": "Nope",
        "32... Rc6 33. Rd8 Be4": "Threatens mate",
        "34. Re2": "But he sees it. Oh well, I didn't really expect it to work",
        "34... Rb6": "Thinking about playing Rb6b1+",
        "35. Rd1": "He stops it, but runs into a skewer",
        "35... Bf3 36. Kf2": "?? I guess he wanted to get my bishop in exchange, but now it's mate in two",
        "36... Qg2+ 37. Ke1 Qxe2#": "...And MATE! As always, please comment if you notice something"
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=50434",
    "gameName": "Team match",
    "players": "sbmr (1069) vs. porcho (1089)",
    "opening": "Ponziani (C44), Jaenisch counter-attack"
}