{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. c3": "OK eventhought I am not an expert with this opening system I have a the ability to find similiarities with other systems or a practical appilication of postional appreciation!  With this system white threatens to \"bulid\" a board pawn center, this is the good... but on the \"dark side\" c3 take best square for the Nb1! ",
        "3... d5": "This is a good \"reaction\" to whites \"threat\"... black begins a quick counter in center and begins to challenge whites control over the white squares in the center. ",
        "4. Qa4": "The alternative was 4. Bb5 but I mention this  only in passing. The center theme of this struggle will be who can control the light squares! Whi exte is ahead a pawn but blacks compensation will be found in the elerment of TIME... or more players off the b ench and into the game!",
        "4... Bd7 5. exd5 Nd4 6. Qd1 Nxf3+ 7. Qxf3 Bd6": "Alternatives where 7. ...f5 or Nf6 again \"fighting for control of the white squares.",
        "8. Bc4 Qf6 9. Qxf6": "This I believe is  contrary to the nature or favor of the stuggle I checked this out with a computer evaluation and It gave me comformation of what I believed to be true, Qe2 or Qe3 was better or \"consistent with the plan\".  Especially sense it is important for white to keep pieces that will fight for control of the light squares.",
        "9... Nxf6 10. d3 b5 11. Bb3 a5 12. c4": "This was an critical decision... from a practical stand point white must find a way to maintain something, ...eithier material and or postional compensation and often these decisions are based on style or ones apperication of the nuncanes of this situation!  Here I would chose to play a4 and if bxa4 Ba2, maintaining the interigty of the white pawn postion! I see where the  struggle between strategy & tactics might be going so I choose to move the game into a perticluar direction!",
        "12... a4 13. Bc2 Bf5": "I will repeat my earlier comment, black is ahead in TIME and with his three on one fastbreak he is \"pressing\" whites position to the maximum! Notice the combination of a positional theme blending in with tactical role play.",
        "14. Nc3 bxc4 15. Bxa4+ Rxa4": "This is a excellent ideal, black is awhere of the relative value of the material but in the stroggle or posittion or the initative material is only a means to an end, the work ethic of the pieces is often more important than the point count, notice how effectively black removes whites only white squared protector... remember knights attack squares & bishops control color!",
        "16. Nxa4 cxd3 17. Nc3 Kd7 18. Bg5 Ne4 19. Bd2 Rb8 20. b3 Nxc3 21. Bxc3 e4 22. h3 f6 23. g4 Bg6 24. h4 Bf7 25. g5 Rg8 26. Rg1 f5 27. a4 g6": "Looking at this position I understand whites decision but I believe that \"trading off\" the d5 pawn and keeping the b pawn would maintain the strenght of whites pawn position and offer better chances to continue the fight! The strenght of blacks position is the \"actvitity of his pieces combined with the mobility of his pawns in the center\"!",
        "28. a5 Bxd5 29. b4 Rb8 30. a6": "Rb1 would protect whites valuable b pawn and threaten to advance the a pawn as well and after Bc4 the struggle would continue.",
        "30... Bxb4 31. Bxb4 Rxb4 32. Kd2 Rb2+ 33. Ke3 Re2+ 34. Kd4 Kd6 35. Rgc1 Rxf2 36. a7 Ba8 37. Ra6+ Kd7 38. h5 d2 39. Rd1 f4 40. hxg6 hxg6 41. Rxg6 e3 42. Kc5 Bf3 43. Rg8 Ke7 44. Rg7+ Ke6 45. Rg8 Kf7 46. Rd8 Ke7 47. Rd3 Rg2 48. Kc4 e2": ""
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=37399",
    "gameName": "Team match",
    "players": "locathah (2027) vs. marcosnatal (2069)",
    "opening": "Ponziani (C44), Caro variation"
}