{
    "moves": {
        "1. e4": "My usual is e4.  I suspect a Sicilian or e5 to get my attention for different reasons. If it will be Sicilian I will have my work cut out for me. If I get e5 then I can get the game over with rapidly. If I get Caro-Kann against me (god forbid) I will have to deal with that.  If I get Alekhine's then I deal with that. If I get French Defense I'll breath a sigh of relief like I would do with the slow Ruy Lopez (e5). \n\nWhat will my opponent do?",
        "1... e6": "He elects the French Defense. I guess he studied my records and wanted to do this to show me that the French Defense is worthy. I don't care. The second he chose this defense I knew what to do. ",
        "2. e5": "I advance against the blockade he is thinking he is going to set up for the usual French Defense Blockade and get him thinking again about this choice (poor choice) as a Black Defense according to all my records and experience.  ",
        "2... d6": "Well, he could have done d5 but the move is the same since we have the en passent here...",
        "3. Nf3": "Just developing instead of trading here. Development is attack and I am white. ",
        "3... dxe5": "Expected. He wanted that passed pawn. ",
        "4. Nxe5": "Trading into his territory with a piece there...a knight. ",
        "4... Nd7": "Black is trying to develop as well as get my knight into a forced move...",
        "5. Nf3": "I move back even with black. His knight is in the way of his queen and his queen bishop but my queen and king bishop are free with his king bishop. ",
        "5... Ngf6": "He doubles his knights together and this is a proper thing to do with a pair of knights that are developing. ",
        "6. Be2": "Clearing house for 0-0. Why not? Black can't do anything to prevent me from protecting my king. ",
        "6... Bd6": "He's clearing house too. We both expect to 0-0 soon...",
        "7. d4": "This pawn to d4 is a development and attack at the same time. ",
        "7... O-O": "He ensconces his king out of the way. Understandable. \n",
        "8. O-O": "Oh, why not? If your opponent 0-0s and you can 0-0 why not?",
        "8... Re8": "Good move rook to the e rank. It is a strong position that is often taken after a 0-0. ",
        "9. Nbd2": "The French Defense works in some ways like a Sicilian: it waits for white to make a mistake when white tries to take control too fast. \nNo need ever to rush against the French Defense. Just be thinking about development and getting things in order while that Defense is waiting for you to make a mistake. \n\n",
        "9... e5": "Black is forging a straight path with the support of that rook on e rank. There isn't really anything else to do here since he chose the French Defense. I'd have chosen the Caro-Kann or Sicilian instead but that is the way I think about defense. I'd have even chosen the Alekhine's Defense before the French Defense. In fact I don't think I even ever used the French Defense since I knew Sicilian and Caro-Kann before encountering it.  I did study the French Defense open and closed and either way I felt the Sicilian or Caro-Kann or Alekhine's was better.  The Ruy Lopez I never use. I have used it recently just to see if it is as viable as my chosen e4 defenses.  To date I feel the Ruy Lopez is a dead defense. ",
        "10. Nc4": "Some sparkle in developing and protecting. Many times a move like this is in waiting for us. It's a move when you clear the way for more development at the same time you protect (and attack)! ",
        "10... exd4": "He takes a pawn but I really want his bishop and also to isolate/stack his pawns on the d rank. ",
        "11. Nxd6": "So there I go to do just that. ",
        "11... cxd6": "So I keep up with the pawn trading. I could use my queen but really the queen should be kept in reserve when there is more movement for her to do her dastardly action. ",
        "12. Nxd4": "The knight. ",
        "12... h6": "Foot pawn. ",
        "13. b3": "Clearing the diagonal for queen bishop....",
        "13... Ne5": "Black is advancing slowly to clear his own q bishop...",
        "14. Re1": "This is always (most times) a strong move no matter what it threatens. Artillery has to be positioned correctly in the least number of moves to be effective. ",
        "14... a6": "Foot pawn again. A safe move. Lying in wait for me to get really offensive before I am ready to do so. ",
        "15. h3": "So I do the foot pawn here. I do it because his two knights with the bishop are trying to move slowly slowly forward while I make a mistake thinking I can take him. With the French Defense you don't get anxious or try to over run. You set up while he (French Defense) sets up. You play the game to match each move rightly and wait before the onslaught. \n",
        "15... Bd7": "What else is left for Black to do to await my mistake in my development to crush him?",
        "16. c4": "Infantry (LIGHT) advances. IN mission: Fix and Kill. ",
        "16... Rc8": "His artillery moving behind the lines to get into some kind of action ",
        "17. Bf4": "Time to send out the q bishop. The bishop is the Pope's messenger and he can be very effective...",
        "17... Qc7": "I would have held back on this. The queen should not be in FRONT of a rook. It means artillery fire is volleyed first by the Queen. She is a valuable piece not to be caught up in artillery unless she is BEHIND the artillery. \n",
        "18. Qd2": "Threatening the King foot pawn to get the Queen down there to treat the king with some problems in space and maneuver and checkmate...",
        "18... Ng6": "Guarding his fort with his king...",
        "19. Bf3": "A disclosed artillery attack on the way...",
        "19... Nxf4": "I choose to diminish the black king guard in the process here. ",
        "20. Qxf4": "So I do it. ",
        "20... b5": "Okay. I pause here.  There is no threat to my king to just take out b5 as far as I can see. I do it...",
        "21. cxb5": "It seems like my king is in danger but the rule of rooks there along with my queen guarding c1 is fine.",
        "21... Rxe1+": "Expected artillery fire from Black. ",
        "22. Rxe1": "I do the rule of the rooks in the back place. Use them together...",
        "22... axb5": "He picks up a pawn to even it out. ",
        "23. Qd2": "I am protecting c3. Look where queens can go and respond. ",
        "23... Qc3": "She is backed by a rook and here she comes! Time to exchange the queens...",
        "24. Qxc3": "Exchange. ",
        "24... Rxc3": "Exchange. ",
        "25. a3": "This move seems so small but really it was the best move for me to make. It is because when a rook comes downrange a rook can create a lot of havoc with pawns sitting in original positions that may not seem to be in immediate danger. \nHowever, if I left that a2 pawn back where it was from the beginning I may as well have sacrificed it. ",
        "25... Kf8": "Moving the King square by square...",
        "26. Be2": "I need to pay attention to that isolated pawn. I attack it. ",
        "26... Rc5": "He defends it. ",
        "27. Kf1": "I need my king close to the rook and the bishop as soon as possible. ",
        "27... Re5": "And this is why!",
        "28. Bf3": "Counter artillery! ",
        "28... Rc5": "Retreating back from my counter fire! With the need of the King to do it! ",
        "29. Ke2": "What side of the board should my king be on? Answer: the LEFT! Now is the time to move him NOW! ",
        "29... Re5+": "Expected. ",
        "30. Kd2": "Now I am crossing over with my king to the LEFT square by painstaking square...",
        "30... Rxe1": "Oh well. Another trade. ",
        "31. Kxe1": "So it is...",
        "31... Ne8": "I don't know why black retreated his knight. Perhaps he saw something I did not see and felt he had to do this. I honestly don't know. Unless he is trying to save the isolated pawn b5.\n",
        "32. Bc6": "This move is really just to downsize and keep the status quo the way it is. I don't have isolated pawns but black does have this isolated pawn. I feel downsizing is fine at this point. ",
        "32... Bxc6": "Black really has no choice here. ",
        "33. Nxc6": "Downsize to the isolated pawn....",
        "33... Nc7": "The protection of the isolated pawn comes after an exchange. Now we are down to a knight apiece and equal pawns. But black has the isolated pawn and I do not! ",
        "34. Kd2": "I go after that area with the most (second) powerful piece on the board....",
        "34... Ke8": "Black is doing the same...",
        "35. Nd4": "By attacking the pawn I freeze his only defender....",
        "35... g6": "And then black is moving forward on the right side of the board--but to no avail. The real action is where the kings are going. I have to freeze the right side as White to get to business on the LEFT side. ",
        "36. g3": "There is the freeze on the right for me to move about on the LEFT. ",
        "36... Kd7": "He is moving into the left where the action really resides now...",
        "37. Kc3": "So am I!",
        "37... d5": "His king has to get to the front so a pawn has to make way. Black is using his knight for support instead of coming forward to check me. My king is not in a position to really be hassled by the black night anyway. ",
        "38. Kb4": "A king forward is what it should be. Leading the way into battle instead of resting on heels in a safe place.  In the end game the King is King! ",
        "38... Kd6": "And does Black know this! ",
        "39. Nxb5+": "Time for a skirmish. Of course I see that d5 pawn and I am \"opening the way\" to promotion for him if I make a wrong move.  But the RIGHT side of the board will help ME on the LEFT side of the board should it come down to a promoting endeavor by the Black King and pawn! ",
        "39... Nxb5": "I have to take it and I am confident to stop a promotion by the d5 pawn to d1. I anticipated this and the way Black would have to move that pawn and king to get there....",
        "40. Kxb5": "I take the knight at a possible seeming risk to allow the d5 pawn through the lines to promotion. But, I have my f2 pawn and g3 pawn (and h3 pawn) in a funneling effect to diminish the opposition's movement of King! ",
        "40... Ke5": "There he goes for the promotion walk! ",
        "41. a4": "There I go to do the same! ",
        "41... d4": "Now that his pawn is running for it it is time to get aside him as kings can do...",
        "42. Kc4": "Aside! ",
        "42... Ke4": "Now the funnel I talked about. My right side pawns have left an obstacle course for the King to accompany his pawn that is racing to the promotion rank! ",
        "43. b4": "There is nothing Black can do to promote his pawn. I just take it if he moves away and I just advance while the king remains. \nBlack resigned seeing the funnel effect. "
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=47894",
    "gameName": "Team match",
    "players": "9422m (1943) vs. kmcl (1852)",
    "opening": "French (C00), Steinitz attack"
}