{
    "moves": {
        "1. e4 d5 2. exd5 Nf6 3. d4 Bg4 4. Be2": "White avoids too complicated play by forcing the trade of the bishops early on and giving up the pawn, leading to a dynamic game where both players get to develop freely",
        "4... Bxe2 5. Qxe2 Qxd5 6. Nf3 Nc6 7. O-O O-O-O": "Opting against 7.... Nxd4 8. Nxd4 Qxd4 9.Rd1. While I would be a pawn ahead, my long castle is cut off and I felt that I would rather simply develop than greadily grabbing a pawn and defend against white's rapidly developing pieces.",
        "8. Be3 e6": "More agression with e5 seems interesting as well, although it does allow white to take a jab at a7 via 9. xe5 Nxe5 10. Bxa7.",
        "9. c4 Qh5 10. Nc3 Bd6 11. c5": "Chases away the bishop from what looks like its optimal square, but also severely weakens the pawn on d4 which is now hanging.",
        "11... Be7 12. b4 e5": "In hindsight, I really don't know what I was thinking here. Not only does this straight up lose a pawn, since one of the defenders can be traded off, but even without that being the case, I solve white's main weakness for him. Setting up the rooks to be doubled via 13...Nd5 14. Nxd5 Rxd5 seems better.",
        "13. Nxe5 Qxe2 14. Nxe2 Nxe5 15. dxe5 Ng4 16. Bd4": "blocking my open file as well as defending his pawn. If 16. Bf4 instead, I can counter with 16...g5 17. Bg3 Rd2",
        "16... Rd5 17. Bc3": "Defends e5 as 17....Nxe5 can now be answered with 18.Nf4, winning the knight.",
        "17... Bg5": "Although this looks to block Nf4, I can still not take on e4, since that would now open me up to a fork by a pawn thrust to f4. Therefore, it would probably have been better to play 17... Rhd8",
        "18. h3 Nh6 19. f4 Be7 20. Rad1 Rhd8 21. Rxd5 Rxd5 22. g4 a5": "Trying to put some pressure on the QS pawn structure.",
        "23. a3 b6 24. cxb6 cxb6 25. Rc1 Kb7": "Moving away from a potentially dangerous battery (e6 followed by Bxg7 comes to mind for example).",
        "26. bxa5 Bxa3 27. Rb1 Bc5+ 28. Kg2 Kc6": "Although white can now push his pawn, it seems to me that I should be able to catch it, so I would much rather move my king to the centre, rather than allowing white to trade his pawns and put my king somewhat out of the game after 28.... Kh6",
        "29. axb6 Bxb6 30. Ng3 g6": "blocking f5, but creating some holes in my position for the white to jump into as well. Trying to get my knight into the game would likely have been better.",
        "31. Ne4 Ng8 32. Ng5 Rd3": "I am going to lose another pawn, so I might as well try to get my rook active and cut off his king from access to my back rows.",
        "33. Rc1 Kd5 34. Nxf7 Be3": "winning back one pawn",
        "35. Rc2 Bxf4 36. Be1": "freeing up his rook to move to the seventh row. It also allows me to win the pawn on e5, but at least he then gets to trade my bishop away, leaving me with my weak knight.",
        "36... Bxe5 37. Nxe5 Kxe5 38. Rc7 Nf6 39. Bc3+ Ke6 40. Bxf6": "Rc6 luckily doesn't work, because of 40...Kd5 Rxf6 41. Rxc6",
        "40... Kxf6 41. Rxh7 Kg5": "With white's king cut off from the third row, he can't really progress any more now.",
        "42. Kf2 Ra3 43. Kg2 Rd3 44. Rf7 Ra3 45. Rh7": "And a draw is agreed upon. Forcing a rook trade via 45. Rf3 also does not work, because of 45...Rxf3 46. Kxf3 Kh4 47. Kg2 (47. Kf4 Kxh3 48. Kg3) g5 48. Kh2 stalemate."
    },
    "url": "https://gameknot.com/annotation.pl/team-match-kingslayers-vs-the-white-knight?gm=57890",
    "gameName": "team match kingslayers vs the white knight",
    "players": "cheester  (1854) vs. martenp (1866)",
    "opening": "Scandinavian defence (B01)"
}