{
    "moves": {
        "1. d4 d5 2. e3 Nf6 3. Bd3": "Yes, I like the Stonewall. Not sure why, but it is fun.",
        "3... Nc6 4. f4 Bg4 5. Nf3 Bxf3 6. Qxf3 Qd6 7. c3 O-O-O": "Will a queen side castle free my opponent from the powers of a Stonewall attack?",
        "8. O-O h6 9. e4 Kb8": "9 ... Kb8, not sure what he was avoiding, but he steps into a tasty pawn fork.\n",
        "10. e5 Qe6 11. exf6 Qxf6 12. b4": "Let's start my pawns marching down this open side - something good has to happen.",
        "12... a6 13. a4 e6 14. Qe2": "What would a Stonewall attack look like going against the queen side? Something like this...",
        "14... Na7 15. b5": "If I led with the bishop, the rook would be blocked by the pawns, so I lead with a pawn",
        "15... a5": "and he declines to open up the a file to a castle and a queen. Bummer.",
        "16. f5": "Can I scare his queen onto the black squares?",
        "16... Qe7": "Yes!",
        "17. Ba3": "Now I might be able to get a pawn past his pawn on d5...",
        "17... Qd7 18. Bc5": "the bait is cast - will he block with a pawn or trade bishops?",
        "18... Bxc5": "he likes his pawn structure the way it is... what a shame.",
        "19. dxc5": "Now I can disrupt it with pawns! However I do have to watch out for him ramming the d and e pawns down my throat.",
        "19... d4 20. c4": "Let's keep my pawns together so they can sacrifice themselves against his pawn structure and prevent his queen from occupying d5.",
        "20... c6": "How am I going to trap the king and clear the a file?",
        "21. b6": "That should trap the king and clear the knight...",
        "21... Nc8 22. Qe5+": "Pushing the king into the corner...",
        "22... Ka8 23. Na3": "Getting ready to sacrifice a knight to clear the a file...",
        "23... exf5": "Definitely going to keep the bishop blocking the c4 pawn - and the queen and castle on the same file.",
        "24. Nb5": "Will he take the bait? Will he let me clear my own pawn from the a file?",
        "24... cxb5": "Sweet!",
        "25. axb5": "Now the a5 pawn is helpless - somebody is going to get checked...",
        "25... Nd6": "Trying to clear room to run? Trick me into a wasted move?",
        "26. cxd6": "I wasted a move.",
        "26... f6 27. Rxa5+": "But get back on track, after all, how cool would it be to win down a queen?",
        "27... Kb8 28. Rfa1 Qxd6": "But he takes the pawn instead? I guess he is trying to make space for his king to scuttle away.",
        "29. Ra5a8#": "The end."
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=27278",
    "gameName": "Team match",
    "players": "socialblunder (1556) vs. supremo (1536)",
    "opening": "Queen's pawn (D00), stonewall attack"
}