{
    "moves": {
        "1. e4": "White open with his Kp",
        "1... c5": "I play the Sacilian",
        "2. d4": "White initiates the Sicilian Smith-Mora Gambit",
        "2... cxd4": "I capture (Sicilian (B21), Andreaschek gambit)",
        "3. Qxd4": "And white has had enough of proper openings",
        "3... Nc6": "This move attacks the queen, forcing white to retreat and gains me a tempo (clearly no one ever told white that it is not a good idea to win a pawn with your queen)",
        "4. Qd1 e5 5. Bd3": "White decides to active his bishop, I don't suppose there is anything wrong with this more, personally I would have played Nf4",
        "5... Nf6": "Looking at this now I like Bb4+, but in this game I decided to go for a more solid Nf6.",
        "6. Nf3": "White seems to have the same sort of idea in mind.  I'm thinking if I where him I might consider a late game ruy-lopez sort of thing (is this a good idea?)",
        "6... Bc5": "I am fairly fond of this formation, Ng4 from here seems to catch people off guard, however now that I'm playing in the 1300's this may no longer work so well. ",
        "7. O-O": "And my pretty little plan is shot.",
        "7... d5 8. Nc3 d4 9. Ne2 Nb4": "What was I doing you ask, well blundering of course.  I think over confidence had something to do with it.",
        "10. Nxe5": "White capitalizes on my error.",
        "10... O-O": "I go for king saftey and beging wondering how on earth I can recover, e5 being a pretty important part of my game.",
        "11. c3 Nxd3 12. Qxd3 Qe7 13. Bf4 Be6 14. cxd4": "Things are not looking good.",
        "14... Rad8 15. Qe3": "I think this move by white was the only thing that gave me a bit of breathing room, allowing me a little bit of tempo.",
        "15... Ng4 16. Nxg4 Bxg4 17. dxc5 Bxe2 18. Bd6 Qf6 19. Qxe2 Rfe8": "...",
        "20. e5 Qe6 21. Qf3": "I think it was here that I started to see my only chance, and decided to go for it full throttle.  When I am behind like this I like to throw everything I have at one attack, and hope it work out, Kamikaze style.",
        "21... Rd7 22. Rfe1 b6 23. cxb6": "If white had played c6 here I would have been toast.",
        "23... Rxd6": "Will he take it I'm wondering?",
        "24. exd6": "CHECKMATE!",
        "24... Qxe1+": ""
    },
    "url": "https://gameknot.com/annotation.pl/tedheads-mini-tournament-vi?gm=29055",
    "gameName": "tedhead's mini-tournament VI",
    "players": "jamesroome (1370) vs. thegoodbishop (1321)",
    "opening": "Sicilian (B21), Andreaschek gambit"
}