{
    "moves": {
        "1. d4": "The opening moves are book and not very interesting so I'll just skip over them fairly quickly.",
        "1... Nf6 2. Nf3 e6 3. c4 Bb4+ 4. Nbd2 O-O 5. a3 Bxd2+ 6. Bxd2 d5": "First move that isn't technically 'book' but still fairly straight forward.",
        "7. Qc2 Nc6 8. e3 Ne4": "This seems like a nice outpost for blacks knight.",
        "9. Bd3 f5": "Trying to secure the knights outpost.",
        "10. cxd5": "My Bishop is already where I want it and this pawn wasn't doing much. Perhaps I should have let it be then if black was to capture with dxc then I would have a nice pin on his king and only one pawn would be supporting the knight on e4.",
        "10... exd5 11. Bc3": "Yes a bishop pair is a good thing however in this case to save the bishop I need to move it to the awkward c1. Besides this bishop isn't doing much at the moment yet blacks knight is doing more. Should I entice black to take with Nxc3 then Get a nice solid pawn structure and a shiny new open file to play with.",
        "11... f4": "Bu black doesn't take my bishop and instead gives away a free pawn?",
        "12. Bxe4 dxe4 13. Qxe4 Bf5": "This move is a mistake. It just gives away yet another pawn. Better was simply fxe.",
        "14. Qxf4 Qd5": "Gives away another pawn.",
        "15. Qxc7": "At this rate black isn't going to have any pawns left to play with.",
        "15... Bg4": "finally a decent move.",
        "16. Qxb7": "!? I wasn't sure about this move I felt it was just pawn grabbing as it was. I realised black had the option of Bxf3 gxf3Qxf3 winning back the pawn. After a while looking at the position I thought I could get away with this further consolidating my advantage with Rg1?? and a checkmate threat. It's not till I made the move that I realised this wouldn't work since after Bxf3 gxf3 Rg1?? fails since Blacks queen would have the rook protecting it allowing for Qxf2+!. ",
        "16... Bxf3 17. gxf3 Qxf3 18. Rf1": "This is the only move really. As I outlined earlier I can't make the move Rg1 like I would have liked to.",
        "18... Rab8 19. Qc7": "Computer lists this move as an innacuracy coming up with the continuation  Qc7 Rbe8 20. Kd2 Qe4 21. Rae1 Rf7 22. f3 Qd5 23. Qg3 Nxd4 24. exd4 Rxe1 25. Rxe1 Rxf3 Which atually is very good for white because of the bank rank weaknesses. I admit though I didn't look into it that depeely, I just made this move because I saw no better square for my queen.\r\n",
        "19... Rbe8": "Utilising the pin on my king.",
        "20. d5": "?? I'm glad both me and my opponent missed the mate here. Can you see it?",
        "20... Ne7": "The correct moves were  d5 Rxe3+ 21. Kd2 Qe2+ 22. Kc1 Qxf1+ 23. Kd2 Rxf2+ 24. Kxe3 Qe2#\r\nInstead this move bodes badly for black.",
        "21. d6": "This pawn is making some nice headway and chasing the knight away at the same time.",
        "21... Nf5 22. Qxa7": "This is not the best move in this position. Better was Qc4+ the computer lists the following sequence of moves.  Qc4+ Rf7 23. d7 Rd8 24. Rd1 Qb7 25. Rg1 Rdxd7 26. e4 Kh8 27. Rxd7 Qxd7 28. exf5 Re7+ 29. Kf1 Qxf5\r\nWhere I can once again use the bank rank theme as well As the g7 weakness to great effect.",
        "22... Qd5": "Computer lists this as the best continuation  Re6 23. Rd1 Qg2 24. Rd3 Rxd6 25. Rxd6 Nxd6 26. Qe7 Qg6 27. f4 Re8 28. Qa7 Qb1+ 29. Kf2 Qg6 andyet If play followed that way then I would have the resource Rg1!! and black can't save safly save his queen.\r\n",
        "23. Rg1": "Making use of the open file and the weakness of g7 and yet the computer lists this a mistake.",
        "23... Rf7 24. Qa4": "Blacks rook is haning and needs to be delt with.",
        "24... Rff8 25. Rd1": "Chases the queen and protects mys powerful passed d pawn.",
        "25... Qf3 26. Qd7": "According to the computer this is a blunder. I made this move to further apply pressure to the weakness on g7. According to the computer this is a blunder because of the continuation Qd7 Rxe3+ 27. Kd2 Qxf2+ 28. Kc1 Rxc3+ 29. bxc3 Qe3+ 30. Kc2 Qe2+ 31. Rd2 Qe4+ 32. Kb2 Rb8+ 33. Ka1 Qe3 34. Rb1 Qxc3+ 35. Rbb2 Qxa3+ 36. Kb1\r\nhowever although I would only be down to two points up my position would be a practically won. ",
        "26... g6": "Black s looking to relieve some pressure by blocking off my rook.",
        "27. Rg3": "I was looking to chase the queen away from it's outpost on f3. I couldn't see how Blacks queen would be better placed on h1 so I thought this to be sound.",
        "27... Qe4 28. Rg1": "Once again the computers are unable to see far enough ahead to make an accurate interpretation of the position. The computer lists this move as a blunder because of the continuation  Rg1 Rf7 29. Qb5 Nxe3 30. Qd3 Qf4 31. Kd2 Nf1+ 32. Kc2 Qxf2+ 33. Kb1 Qxg1 34. d7 Rd8 35. Re1 Rff8 36. Qd5+ Rf7 however if the lines continued that way the I would win with Re8+!! leading to a forced mate because black must play Rxe8 the dxe8=R#",
        "28... Rf7 29. Qb5": "Wanting to keep the pressure on the rook on e8. but I missed......",
        "29... Nxe3": "! which turns the favor. No matter how much I looked into this position I couldn't find away out of it. In the end I cam up with..",
        "30. Bd2": "?? I had basically given up at this point and was relying on black missing any winning cotinuations. I thought here black could play Nc4+ Kf1 Qe2+ Kg2 then Ne3+ winning my queen I was just praying black would miss it. Turns out my position was even worse than that because black had aforced mate with  Bd2 Nc4+ 31. Kf1 Qe2+ 32. Kg2 Qf3+ 33. Kf1 Qxf2#\r\nThe correct movefor white that prevented mate but lost the advantage was Qd2",
        "30... Nc2+": "this still leads to mate in six if black plays this. Kf1 Rxf2+ 32. Kxf2 Rf8+ 33. Kg3 Rf3+ 34. Kg2 Rxa3+ 35. Kf2 Qf3#\r\n",
        "31. Kf1 Qe6": "? Lucky for me Black missed all this. ",
        "32. Bc1": "The reason behind this is to keep the bishop pointed at the e3 square. Computer lists black as having a forced draw in this position. Bc1 Nd4 33. Qd3 Rxf2+ 34. Kxf2 Rf8+ 35. Kg3 Qe5+ 36. Kh3 Qh5+ 37. Kg2 Qd5+ 38. Kh3 Qh5+ Which is a forced repetition.",
        "32... Ne3+": "With this final mistake I think black has lost all his counterplay and won't be able to pull through.",
        "33. Bxe3 Qxe3 34. Rg2 Ref8": "probably blacks only shot at anything, going for the f2square.",
        "35. Qe2 Qh3 36. Kg1": "I'm not going to miss anything like before.",
        "36... h5": "I'm not quite sure what got in my opponents head but for the next sevral moves he makes some pretty poor choices. I left a note asking him if he had simply given up and was going to allow me to play to checkmate but was surprised with the reply that he never gives up!",
        "37. Rxg6+ Rg7 38. Rxg7+ Kxg7 39. d7 Qh4 40. b4": "It's pretty sailing from here on in.",
        "40... Kh6 41. Qd2+ Kh7 42. d8=Q Rg8+": "He didn't just take my queen?",
        "43. Kf1 Qh3+ 44. Ke2 Qg4+ 45. f3 Qg2+ 46. Ke3": "Now black has no more checks and surely has to take on my queen on d8?",
        "46... Qg7 47. Qd8d3+": "I missed a mate in 9 but this is still mate in twelve.",
        "47... Kh6": "And now it's a mate in 8 ",
        "48. Kf2+ Qg5 49. Rg1 h4 50. Rxg5 Rxg5 51. Qf5": "I was reasonably happy to see this, it's nothing special but I still am glad to have seen it. Now Kg7 holds out fo an extra move ortwo.",
        "51... h3": "But instead he does this. This is when I asked himif he had just wanted it overwith yet apparently he missed the mate?",
        "52. Qdxg5#": "Please comment. And tell me if you picked anything else up that I may have missed."
    },
    "url": "https://gameknot.com/annotation.pl/tekreis-mini-tournament-xiv?gm=38286",
    "gameName": "tekrei's mini-tournament XIV",
    "players": "thereaper1 (1312) vs. cisko (1372)",
    "opening": "Queen's pawn (A46), Torre attack"
}