{
    "moves": {
        "1. e4": "This is an old game I played when I was still a 1st category player, but it remains to this day one of my favourite (and best) games. I am posting it on Gameknot because it is a pretty typical Sicilian game, where Black counterattack is triggered basically by White's inactivity and lack of consistency. It is also a good representation of my playing style from that time - I was then a counterattacker, usually defending and waiting for the opponent to weaken his position before I charged in for the \"kill\". The Sicilian is simply perfect for this style of play.",
        "1... c5": "Another important thing to mention is that in this game I felt that I was completely overmatched, as the rating difference clearly shows. My opponent was a strong and experienced master candidate in good form, while I started playing tournament chess in 1996., so I was still pretty inexperienced. My chances to \"survive\" were objectively minimal, but I played with a sence of desperation, determined not to go down without a fight. At that time I was literaly obsessed with development tempi (and still am I suppose), especially since I knew how important they are in such a sharp opening as the Sicilian. This factor will play a very big role in this game.",
        "2. Nf3 Nc6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 d6": "This variation is what I exclusively play in rated games, although I am now considering branching out to the Paulsen variation (1.e4, c5; 2.Nf3, e6; 3.d4, cd4; 4.Nd4, a6).",
        "6. f3": "Not the best move, but not a bad one either. I never saw it before, so after some thought I decided to \"take advantage from it\" and remove the d4 Knight as I usually did, but without bringing the unpleasant Bd4 (after Be3) to the centre. This is actually not a bad decision, but today I would also consider playing 6...e6 and allowing the English attack (Be3, Qd2, 0-0-0, g4 etc.).",
        "6... Nxd4 7. Qxd4 g6": "Usually I played e6 and developed the Bishop on e7, but I couldn't resist the potential later tempi on Qd4. Also I knew that in the Dragon variation the Queen has to be on d2 to support eventual Bh6, so I figured if he wants to play this way I will again gain a few tempi while he sets it up. So everything looked rather rosy at the moment. Objectively, the game is equal.",
        "8. Bg5 Bg7 9. O-O-O O-O 10. Qd2": "And here it is! Now I knew I achieved a small victory in the opening, with smooth development and a clear plan (Be6, Rc8, Qa5). Correct moves are 10.e5 or 10.Bc4 with equal game (slightly more comfortable for White), but I guess White played pretty relaxed due to his heavy favourite status. At this moment I had spent 19 minutes from the clock, he spent 4.",
        "10... Be6": "Taking advantage from the fact that there is no opposition on the diagonal.",
        "11. Kb1": "A good consolidation move, but it also gives Black time to increase pressure against White's position.",
        "11... Rc8": "The fact that the Bishop is on \"the wrong square\" g5 and not e3 allowed me to play this immediately. Otherwise I would have to prepare Rc8 with 11...a6.",
        "12. g4": "?? This is a mistake, and I immediately knew it! Now why is it so? The answer is simple: every move Black made was a straightforward and active developing move, except for 6...Nd4 - but that evened out with Qd4-Qd2 from White. On the other hand, White additionally played defensive 11.Kb1, and his Bg5 Bishop is somewhat badly placed - it doesn't really pressure Black position (B:f6 would be a bad exchange), while it can't block Bg7 at all (if it was on e3 then Bd4 would be a possibility). All Black pieces are in aggressive positions and are ready to attack. So obviously White has to neutralize the pressure on his position before he starts to play actively. There were two ways to do this: 12.Be3 (another loss of tempi) or 12.Nb5, a6; 13.Nd4 - both variations with equal game and a comfortable/happy Black player. The last straw is that 12.g4 actually creates another weakness on g4, as it will soon become apparent.",
        "12... Rxc3": "! I played this move after only 5 minutes of thinking, but I was so excited that I couldn't make myself think any more :) actually this move is correct and the best available. The interesting thing is that after only 12 moves Black has a brutal attack on White's position, without any obvious blunder on White's part. But a small loss of tempi (Qd4-Qd2), a misplaced piece (Bg5), a consolidating move (Kb1) and an untimely (unprepared) display of activity (g4) together have tipped the scale in Black's favour.",
        "13. Qxc3": "13.bc3, Ne4!; 14.fe4, Qa5 is even worse. Black is a Rook down but all remaining pieces are concentrating unopposed fire on the queenside. White now started to play seriously, but it is too late - the underdog Black had nothing to lose, and has sensed the golden opportunity. The plan is clear and everthing \"goes with music\".",
        "13... Nxe4": "Double attack on the Queen, and additionally Bg5 is in trouble.",
        "14. Qe3": "Another option was 14.Qa3, Ng5; 15.h4, Nf3; 16.Qf3, Qa5 with advantage for Black.",
        "14... Qa5": "Double attack, on a2 and Bg5.",
        "15. fxe4": "15.Qe4?!, Qa2; 16.Kc1, Bb2; 17.Kd2,Qa5 and Bg5 is history. But now g4 pawn is loose and can be picked up when needed (with tempi if possible, of course).",
        "15... Qxa2+ 16. Kc1 Qxb2+ 17. Kd2 Qb4+": "Starts another series of forced checks which further strip the cover of the King.",
        "18. c3": "18.Ke2?, Bg4; 19.Kf2, Bd1 and 18.Kc1?, Bb2; 19.Kb1, Bc3; 20.Kc1, Qb2#",
        "18... Qb2+ 19. Ke1 Bxc3+ 20. Rd2 Rc8": "My second obsession from that time (besides tempi): when attacking the King, always throw everything into the fight. This is a simple and strong move.",
        "21. Be2": "21.Qd3, Rc4; 22.Be2, Rd4 and 21.Qe2, Bb4; 22.Bg2, Rc2 also don't help.",
        "21... Qb1+": "The best move, with forced variation that reduces the material while keeping the initiative.",
        "22. Bd1 Bxg4": "I just couldn't resist this move, but the best move order is in fact 22...Bd2. After that 23.Qd2, Qe4 gets Rh1, and 23.Kd2, Bg4 creates horrible threat 24...Qb4. This can be prevented by a Queen move but then Bg5 is lost after Qc1. If 24.Bg4 then 24...Rc2; 25.Kd3, Qb3; 26.Kd4, e5#",
        "23. Kf2 Bxd2 24. Qxd2 Qxe4 25. Re1 Qf5+ 26. Kg3": "26.Qf4, Qf4; 27.Bf4, Bd1; 28.Rd1 is similar to the game ending. Black has 6 (!) pawns for the Bishop.",
        "26... Bxd1 27. Rxd1 Rc4": "Again the simplest move I could find, bringing the Rook into the fight. By this time I spent 1:53 of my time, leaving 7 minutes for 13 moves - which is plenty considering the position. My opponent played quickly most of his moves - they were more or less forced anyway.",
        "28. h3 f6": "Defending e7 with tempi. Now I only wanted to exchange Queens and play out an easy ending.",
        "29. Be3 Rc2": "Now there is no Rg4, so this is the only good place for the Rook.",
        "30. Qd5+": "This pretty much resigns the game. 30.Qd4 is the only hope, however slim it may be. I would probably start pushing the 2 queenside passers, while trying to create mating threats on the kingside. Since the only open line is in Black's hands, there is virtually no danger of getting mated suddenly.",
        "30... Qxd5 31. Rxd5 a6 32. Rd3 Kf7 33. Bb6 Rb2 34. Bd8 Rb5 35. Rc3 Rc5 36. Re3 e5 37. Rb3 b5 38. Ra3 Rc6": "1:57 on the clock, and everything is defended. White did not resign yet though (and even managed to create a passed pawn!).",
        "39. Ba5 Ke6 40. h4 d5": "The time control. After this both players received additional 30 minutes on the clock.",
        "41. Bd2 d4 42. Kg4 Kd5 43. h5 e4 44. h6 e3 45. Bxe3": "Nothing else is really possible. ",
        "45... dxe3 46. Rxe3 Rc4+ 47. Kg3 Re4 48. Rd3+ Ke6": "Now I decided to go and take out the h6 pawn, before I do something really stupid and lose :)",
        "49. Rd8 Kf5 50. Rd7 Re3+ 51. Kf2": "51.Kg2 is slightly better, but the pawn is lost anyway after Kg5.",
        "51... Rh3 52. Rxh7 Kg5 53. Ra7 Kxh6 54. Rxa6 Kg5 55. Rb6 Rb3": "White finally resigned. I hope you had fun watching the game. Learning points (I hope) are: 1. Never underestimate your opponent. This was really White's downfall. We played 2 more games within 3 years from this one and he outplayed me both times, playing seriously and powerfully. 2. It is necessary to play with consistency, and according to the reality of the position. 3. Tempi are everything in tactical positions! --- Thank you for looking over this game, I can answer any questions on private.\r\n\r\nRegards,\r\n\r\nMarin Vukusic"
    },
    "url": "https://gameknot.com/annotation.pl/the-making-of-a-sicilian-counterattack?gm=7969",
    "gameName": "The making of a Sicilian counterattack",
    "players": "White player (2190) vs. marinvukusic (2062)",
    "opening": "Sicilian (B58), classical"
}