{
    "moves": {
        "1. d4 Nf6 2. Nc3 e6": "I am playing the Queen's Indian Defense.",
        "3. Bf4 b6 4. e3 Bb7 5. Nf3 Bb4": "Removing this defender because I want to control d5 and e4 in particular.",
        "6. g3": "Preparing to fianchetto, but white has also greatly restricted the maneuverability of his DSB.",
        "6... Bxc3+ 7. bxc3": "And we have doubled pawns as well. So far so good for me.",
        "7... Ne4": "Centralizing the knight, aiming at c3 to capture the weak pawn. I wanted to be aggressive though my development is incomplete.",
        "8. Qd3 Nxc3": "Taking the pawn because I have just discovered an attack against white's knight, which has no defender.",
        "9. Qxc3 Bxf3": "And forcing the rook to move, meaning that white can't castle kingside. And for the moment, he can't castle queenside and most likely wouldn't want to anyway.",
        "10. Rg1 Nc6": "Continuing development",
        "11. Bg2 Bxg2 12. Rxg2 O-O 13. Qd3 d6": "Restricting the bishop and preparing a pawn break on e5.",
        "14. Ke2 h6": "Further limiting the bishop, though I didn't foresee that trapping it meant that this h pawn would become the target for white to get compensation for the loss.",
        "15. c3": "Still, white didn't seem to see what was happening. Instead, he solidified his center.",
        "15... e5": "And the bishop is mine.",
        "16. Bxh6 gxh6": "But now, I have little protection. This is a problem.",
        "17. Qe4 Qd7": "Cutting off the white queen's options (Qg4, namely), and protecting my knight at the same time.",
        "18. Qh4 Kh7": "I feel horribly exposed at this point.",
        "19. g4 exd4": "Trying for counterplay. This move also opens a spot for my knight that will be important, and also opens the e-file for my rook.",
        "20. g5": "Continuing the push.",
        "20... Qe6": "Protecting.",
        "21. Rag1": "Building the attack and the push of the pawn, specifically.",
        "21... Qxa2+": "And I decided to make a bold decision to disrupt white's initiative, the drawback being that I don't have the tempo to spend on better defense of my position. However, I thought it might be possible that attacking would generate more chances to change the flow of the game...little did I know how much that would be true!",
        "22. Kf3 Qd5+": "Not even really looking ahead right now, just pushing white and attacking. Sometimes, the psychology of the game is important, and I wanted to disrupt white as much as I could.\nAnother consideration is Ne5+, which I actually played next. I do like this queen move, though.",
        "23. e4 Ne5+": "This move was great for multiple reasons. It continues the attack, but also adds a defender of g6 to halt the advance of the pawn.",
        "24. Ke2": "In hindsight, it might have been better for white to have done a different move that wouldn't have landed him in another check right away, even if it was Kg3.",
        "24... Qc4+": "Now this attack is actually looking real. The white king doesn't really have a safe spot to go, it seems.",
        "25. Kd2": "Here I could have forked the king and queen, and I didn't even see it!! However, it ended up not mattering much. Suddenly, the tides are drastically turning on white.",
        "25... Qxc3+ 26. Ke2": "One of two places to move. I don't know which would have been better.",
        "26... Qd3+": "I was proud of this move, because now the white king has only one spot to go, and at this point I had foreseen the ...Nf3, which I thought would just land me the queen. I didn't look comprehensively enough to realize that...",
        "27. Ke1": "...",
        "27... Nf3#": "...It's also checkmate!! A sequence of 7 checks leads to a checkmate that also happens to be a 4-way fork. This doesn't happen every day. It's beautiful, though I sympathize with white, who definitely had the initiative until this crazy sequence unfolded."
    },
    "url": "https://gameknot.com/annotation.pl/the-most-welcome-win-is-the-most-unforseen?gm=50670",
    "gameName": "The Most Welcome Win is the Most Unforseen?",
    "players": "jughoul  vs. cazador2 ",
    "opening": "Queen's pawn game (A45)"
}