{
    "moves": {
        "1. e4 c5 2. f4 d5 3. Nf3 dxe4 4. Ng5 Nf6 5. Bc4 Bg4 6. Qxg4 Nxg4 7. Bxf7+ Kd7 8. Be6+ Ke8": "Same as my previous games, I preferred to return my king to its original position as I believe I can protect it better in this way. \n\nHowever, id=antagonistknigh responded to this move as : \n\n\"First off with 8. ... Ke8 it shows that you are attempting to draw the game by threefold repetition (or at least that is what most people are attempting with that move.) The other thing you may be thinking is that moving your king back to this spot puts him at a more protected location than at c6, now that is a matter of how well you can set up your defenses. There are several holes like e6, e5 and f7 I can use to attack your king. So choose your defense/counterattack carefully. It is my job to prevent you from setting up the best defense and checkmate you before my initiative runs out, because the longer the game continues the better your chances are. ...\"",
        "9. Bxg4 e5": "Again, since my king is not at c6, I can play 9. ... e5 to attack the white's knight defender. The idea is to remove the defender and the attack to the knight, or at least force white to re-place his knight. I played the same way against id=antagonistknight, and he responded with 10. O-O, which seems better than 10. d3",
        "10. d3": "As I said, I think castle king side was a better move. In this way if I play 10. ...exd3, which I did, logically white can respond with cxd3. But the fact is his queen side pawns' position will be weakened thereafter as white will have an isolated pawn at D file.",
        "10... exd3 11. cxd3": "As you can see, white's pawn at d3 is isolated now!",
        "11... h6": "Trying to force white to remove his knight from the strong position that it holds.",
        "12. Nf3": "White blocks the way for black's queen on h4+",
        "12... Nc6": "Expanding the position of my pieces.",
        "13. Nxe5": "White offers his knight for exchange, which I willingly take it as the rule for white to win was \"not to cash in soon\". So it means black can take advantages by cashing in soon!",
        "13... Nxe5 14. fxe5 Qh4+": "Now while the defender of h4 square removed, black's queen can freely start to attack.",
        "15. g3": "Expected!",
        "15... Qxg4": "Taking white's pieces one by one. ",
        "16. O-O": "Good move, quite late though.",
        "16... Qd4+ 17. Kh1": "It is clear that 17.Kh1 was better than 17.Rf2, as Rf2 pins the rook to the king.",
        "17... Qxd3": "The poor white pawn, which was released helpless in the mercy of black's nobility was betrayed by black's queen!!",
        "18. Re1": "Protecting f rook and also supporting the pass pawn at e file.",
        "18... Qf3+": "Trying to be close to the king to limit its moves.",
        "19. Kg1 c4": "Trying to open diagonal for the DSB to attack f2 square.",
        "20. Be3": "White found about the attack, trying to capture the free diagonal.",
        "20... Bb4": "Instead, black attack the defender of the bishop. ",
        "21. Nc3": "Best move in this situation, trying to block the way of black's bishop.",
        "21... Rd8": "Just capturing the opened file not to let white's rook take it.",
        "22. Bf2": "As white's king life depends on not to let the black bishop take the diagonal, his life depends on white bishop. On the other hand white bishop's life depends on white rook and rook's life, itself, depends on white knight, so can be said that white knight was pinned to his king. \nBy this move white tried to remove the undirected pin!",
        "22... Rf8": "Prepare more back up for my queen to have the possibilities of double attack.",
        "23. Ref1": "Defending the bishop and also f2 square. Now all the pressure is on f2 square so white tries to protect this square.",
        "23... Rd2": "One more attacker brought to the game to attack f2 square.",
        "24. Bd4": "This was the mistake, as opened the rank for my rook to cover my queen on g3 square. All the White's defenders focus on f3 square and g3 remains on the mercy of no one!\nI think better was 24. Nd1. However, as white sacrificed his queen and also lost one of his bishops, the losing was certain. ",
        "24... Qg2#": "The moment of glory!"
    },
    "url": "https://gameknot.com/annotation.pl/the-knights-coaching-project?gm=29755",
    "gameName": "The Knights Coaching Project",
    "players": "dungeonking (1271) vs. ariaraman (1540)",
    "opening": "Sicilian (B21), Grand Prix attack"
}