{
    "moves": {
        "1. e4 d5": "I play what I Always play against e4, d5 the great Scandinavian defence!",
        "2. exd5 Nf6": "And no, not Qxd5, way to passive for my liking, this most of the time gives a much nicer game to play.",
        "3. c4": "I thank my opponent for this, as you can see this is the only move that allows white to hang on to its pawn, but it leads to...",
        "3... e6": "3.... e6!, the Icelandic gambit, an awesome gambit with great attacking lines for black and white has to defend real secure to keep his pawn up and don't lose material.",
        "4. Nc3": "He does however not accept and with Nc3 I will start the trade.",
        "4... exd5 5. Qe2+": "an in between check that in my opinion only allows me to develop my bishop early.",
        "5... Be6 6. cxd5": "more trading",
        "6... Nxd5 7. Qb5+": "And yet another in between check (and a second queen move in the opening!), however this one is not so easy to counter as Nc6 gets countered by Qxb7 getting the pawn with tempo on my knight and 7.... Qd7 also leads to Qxb7 and the loss of a rook as well. Bd7 leads to Qxd5 losing my knight and so the only decent option was...",
        "7... Nd7": "Nd7 'sacrificing' the knight at d5 to counter with 8.... c6 forking knight and queen so I win the knight back.",
        "8. Nxd5 c6 9. Qxb7": "Now white is a pawn ahead, but as you will notice, taking the pawn on b7 will prove once more poisonous.",
        "9... Bxd5 10. Qa6": "That or d4 were his only moves as Nc5 locks the queen (10. Nf3 Nc5 11.Qb4 Nd3+ and the queen is mine).",
        "10... Qe7+": "This was practically forced, as I can't allow white to play Qe2+ himself as that would've lead to queentrade which I have to prevent! He now has two options being 11.Qe2 and 11.Ne2 (as 11.Be2 leads to 11.... Bxg2 winning the rook)",
        "11. Ne2": "He chose Ne2 which in my opinion is the least good, I would've opted for Qe2. And thus now I unleash my final blow:",
        "11... Nc5": "Nc5 leaving only Qa3 open",
        "12. Qa3 Qe4": "and Qe4! threatening Nd3+ winning the queen and threatening as well Nxf2+ winning the rook (as white can only reply to 13.... Nd3+ with Kd1).",
        "13. Kd1": "Kd1 moving out of the check, but I still have my attack with Nb3:",
        "13... Nb3": "threatening the rook on a1, the queen with my bishop and the queen can only move back to a6 to get to safety.",
        "14. Qxf8+": "And my opponent takes on f8, it doesn't seem the strongest move, as my bishop isn't really playing and so he takes out an 'inactive' piece. I would've taken the knight on b3 to get the active knight and bishop back for my queen.",
        "14... Rxf8 15. Nc3": "Taking a tempo before attaking my knight, it however bumps into the nice:",
        "15... Qg4+": "Qg4+ which wins another pawn with tempo as f3 is not an option (16.f3 Bxf3+ 17.gxf3 Qxg3 winning the rook) and 16. Ke1 Nxa1 and mating issues with Nc2.",
        "16. Be2": "so Be2 is the only option leading to",
        "16... Qxg2": "Qxg2 and threatening to take the rook, so he moves to e1",
        "17. Re1": "I didn't like the look of that bishop and rook lining up on my king so I decided I had time enough to spare a tempo for Kd7",
        "17... Kd7": "notice that axb3 isn't possible for the threat of Bxb3 checkmate.",
        "18. Nxd5": "and so he takes my mighty bishop out.",
        "18... Nxa1": "and I go gobbling up more material.",
        "19. Ne3": "Threatening the queen.",
        "19... Qg6": "with ideas of Re8 and mating chances on c2.",
        "20. Bg4+": "trying to get some of his pieces playing.",
        "20... f5": "blocking the bishop out and eyeing for f4 and mate on c2 (21.Be2 f5 22. Bg4+ Kc7 and troubles)",
        "21. Bh3": "missing the last threat in the game.",
        "21... Qh5+": "Winning the bishop and 0-1. thanks for reading, hope you enjoyed it, feel free to comment!"
    },
    "url": "https://gameknot.com/annotation.pl/the-poisonous-b7?gm=56535",
    "gameName": "The Poisonous b7",
    "players": "Opponent (1520) vs. Bert (NC)",
    "opening": "Scandinavian (B01), Icelandic gambit"
}