{
    "moves": {
        "1. e4": "This is one of the most famous games in chess, justly known as the \"Evergreen\" game.",
        "1... e5 2. Nf3 Nc6 3. Bc4": "The most aggressive square for the LSB. Controls d5, and bites down on the weak f7 pawn.",
        "3... Bc5": "In turn biting down on the weak f2 square.",
        "4. b4": "Evans gambit, a sharp try for control of the center and attacks on f7.",
        "4... Bxb4": "And black accepts, the best move here.",
        "5. c3": "This is the point of the Evans gambit.",
        "5... Ba5": "Retreating the DSB while keeping the pressure on c3. Matter of fact, this is the only black move that prevents white from getting a keepable pawn center with d4.",
        "6. d4": "Anderssen plays 6 d4 anyway. Notice that the c3 pawn is pinned.",
        "6... exd4": "Black takes while keeping c3 pinned.",
        "7. O-O": "The natural move, removing the pin on c3, which enables white a pawn center if given the opportunity, while activating the rook to slide over to the critical e file.",
        "7... d3": "!? Opts to keep the d file closed and slow down white's development, since he is betting white will take. Black effectively prevented the strong pawn center, but lost lots of time, and now the attack will begin. Better was 7 ... dxc3.",
        "8. Qb3": "Attacking the weak pawn. Usually the fast attacks in the opening when black is slow castling come on f7. Notice white does not defend the hanging d pawn...white will have plenty of chances to take this pawn later. It cannot be defended easily by black.",
        "8... Qf6": "Defends f7 while double-attacking c3.",
        "9. e5": "Black cannot take this; 9 ... Qxe5 10 Re1! Or 9 ... Nxe5 10 Re1 and now the knight is pinned.",
        "9... Qg6": "Retreating while still defending f7.",
        "10. Re1": "White now grabs the critical e file. Although the e file is not yet open, white puts tremendous pressure on the center. For example, black cannot play 10 ... d6 11 exd6+, and white is poised to play the battering ram pawn push e6. The e5 pawn is a thorn in black's side.",
        "10... Nge7 11. Ba3": "Extremely powerful position for white's DSB as it puts incredible pressure on the centralized black king.",
        "11... b5": "? A foolish try since black is not castled. Better is 11 ... 0-0.",
        "12. Qxb5": "Taking the free offering.",
        "12... Rb8": "Grabbing the b file and attacking white's queen.",
        "13. Qa4": "Best square for the queen.",
        "13... Bb6": "Strengthens the under-fire bishop, undoing the pin on the knight and also bites down on f2.",
        "14. Nbd2": "Developing the knight to its only possible square.",
        "14... Bb7": "? Again, better is 14 ... 0-0.",
        "15. Ne4": "Centralizing the knight where he attacks key squares.",
        "15... Qf5": "? Needless black queen move. Black had better moves like 15 ... d2 forcing white to waste time taking the pawn. In fact d2 was suggested by Lasker when he looked at this game.",
        "16. Bxd3": "Threatening a discovered attack on the queen.",
        "16... Qh5 17. Nf6+": "!! Excellent move by white. Black has no choice but to recapture, opening up the g file for counterplay.",
        "17... gxf6 18. exf6": "Opening up the e file with a bang.",
        "18... Rg8": "Strong move that activates the rook, attacks white's knight by pinning g2, and threatening mate with the help of the queen, and bishop on g7. If white did not have brilliancies here, this position would be equal.",
        "19. Rad1": "Gambits a piece (knight on f3) in exchange for a brilliant attack.",
        "19... Qxf3 20. Rxe7+": "! White threatens mate with this move.",
        "20... Nxe7": "Leads to forced mate, better is 20 ... Kd8.",
        "21. Qxd7+": "White sacrifices the queen for an unstoppable checkmate. Not an easy move to see.",
        "21... Kxd7": "What else is he going to do?",
        "22. Bf5+ Ke8": "Best try. 22 ... Kc6 23 Bd7#",
        "23. Bd7+ Kf8 24. Bxe7#": "Mate."
    },
    "url": "https://gameknot.com/annotation.pl/the-evergreen-game?gm=32101",
    "gameName": "The Evergreen Game",
    "players": "Adolf Anderssen  vs. Jean L Dufresne ",
    "opening": "Evans gambit (C52), compromised defence"
}