{
    "moves": {
        "1. e4": "Hello everyone! Just here looking for some friendly advice from the experts and a chance to show off my win. Just by reading some of the comments on this annotations have really boosted my chess knowledge. I'm white by the way. ",
        "1... g6": "He wants to put his bishop in what I call \"shotgun\" (This is not the official term mind you!). That rook looks exactly like a shotgun about to go off. He moves his bishop diagnal to the rook and he automaticly controls the middle. ",
        "2. d3": "Simple development. ",
        "2... Bg7": "\"shotgun\" going as planned. ",
        "3. Nc3": "This not only develops a piece, but guards my rook from future attack. ",
        "3... c6": "Development. A route for his queen maybe? ",
        "4. Qf3": "I'm simply looking to castle. Is it better to castle on the right or left side? Just wondering? Anyway, since my knight is already in the action, I believe the left side will be quicker. ",
        "4... Nf6": "He wants to castle too I suppose. Also another positive of \"shotgun\". ",
        "5. Bf4": "Castle development. ",
        "5... d6": "I assume he wants to confront my queen? ",
        "6. O-O-O": "Castle time, at last. ",
        "6... O-O": "I'm not the only one throwing a party in the castle.....",
        "7. e5": "I don't like the pathways to his king clogged up like that. I need some space to work. ",
        "7... Bg4": "I knew this was coming. Bad timing...for me that is. I forgot I had that rook down there at the time, so this hurt. ",
        "8. Qg3": "Just a safe move to keep me in the general area of the action. ",
        "8... Bxd1": "Now I've got a decision to make. I'm in a great position to come back. By delaying his attack on my queen/rook, I've got a knight I can take down, and then I've still got another bishop to bring down as well. ",
        "9. exf6": "As I said on the previous slide, he shouldn't have waited for his attack. ",
        "9... Bxf6": "The smart thing to do in this postion. Get what you can, pawns included. ",
        "10. Kxd1": "Comeback complete. ",
        "10... Qb6": "His attack on my pawn is too obvious. (Almost as ovious as the queen/rook attack I missed). ",
        "11. Kc1": "I can't move the pawn, or the knight is gone. The only thing I could do to protect the pawn. ",
        "11... Bxc3": "This exposes my pawn. Nice move. In the endgame, having two pawns on the same row is a nightmare! ",
        "12. bxc3": "Double pawns...............ugh.",
        "12... a5": "This seems like harmless development....but it's not. ",
        "13. Bg5": "A free pawn if I can get it. A rook looks good too. ",
        "13... e5": "Ahh...bad. Now I can embarrass the rook. ",
        "14. Be7": "I like this. It's either the rook or the pawn. ",
        "14... Re8": "What else could he do? ",
        "15. Bxd6": "The ovious takedown. ",
        "15... a4": "The nightmare pawn approaches. It seems harmless...until it hits the other side...",
        "16. Bxe5": "Haha! A free pawn! Taking down the bishop is not an option, or the rook is gone. ",
        "16... a3": "Now, I notice the nightmare pawn. I see a check or checkmate looming. I don't like it. ",
        "17. c4": "This opens the door for the bishop to fly down to the rescue in case of a queen attack. ",
        "17... Nd7": "You can tell it's important. He's building his game around that nightmare pawn now....",
        "18. Bc3": "I have to move, I don't want the nightmare pawn to become a queen...on move 18? ",
        "18... Re1+": "The pawn is his game. No question now. If you are willing to sacrifice a rook for it...it's important. ",
        "19. Bxe1": "I take a huge risk. It's hard to turn a rook down. ",
        "19... Qb2+": "No doubt about this move. Take down my pawn, and your pawn is a queen. ",
        "20. Kd2": "I want to leave the trenches. It's unsafe on the bottom row. ",
        "20... Qxa2": "The nightmare pawn is on it's way. ",
        "21. Ne2": "I want to move the knight into the danger zone to scare of the queen, and the nightmare pawn from a2. ",
        "21... Qb2": "He either doesn't know or care. He thinks he has an open path to making a queen.  ",
        "22. Nc3": "Defense is present. ",
        "22... Qb4": "He wants to pin my knight. I'll give him credit for trying, not a bad move at all. ",
        "23. Ke2": "But, it's not that easy. I see it from a mile away. ",
        "23... Re8+": "I assume he wants to \"scare\" my king back to his original position, or in a vulnerable spot.  ",
        "24. Ne4": "I try to catch him off guard with my bishop. What a take that could have been! ",
        "24... Qb2": "The plot has been discovered. ",
        "25. Bc3": "I will try to focus on the queen. If I can get it to go away, the nightmare pawn will be easier to take. ",
        "25... Qxc3": "A mistake by me. The knight can't move, the rook is in its way. ",
        "26. Kf3": "Another chance to catch my opponent off guard. ",
        "26... Qxc2": "The plot is discovered yet again. I can't say it wasn't ovious though. ",
        "27. Be2": "This is a success. The bottom of the board is protected by my rook. The nightmare pawn is no longer a threat...for now. ",
        "27... Qb2": "But the nightmare pawn could still lead to the downfall of my rook. ",
        "28. Qc7": "Since my queen is not currently in any defensive action, it might as well start being useful offensively. ",
        "28... Ne5+": "Ouch. Now I lose out on a knight and my king is put into a yet more vulnerable spot. ",
        "29. Ke3": "Or maybe not. I like the little fort I have built myself. ",
        "29... Ng4+": "Oviously, he took notice of it. ",
        "30. Kf3": "Confront the opposition. ",
        "30... Nf6": "Thank goodness we don't have to go through that again. 3 move repetition leads to a draw you know. ",
        "31. Re1": "I might as well protect my bishop from further attack. What else could I have done? ",
        "31... a2": "The nightmare pawn advances yet again. ",
        "32. Qa5": "The queen is back on the defense. It was in the perfect spot to stop a new queen. ",
        "32... Nxe4": "I don't like this. The knight was in a nice defensive spot. Now it is replaced with a weak pawn. ",
        "33. dxe4": "Weak is an understatement. ",
        "33... Qb3+": "Throughout this game, my opponent was constantly trying to bully me with checks. I have to get used to this very quickly. ",
        "34. Kf4": "I hate this position. The king is in the middle of the board? ",
        "34... b6": "A minor attack. It's nothing I cannot handle. ",
        "35. Qa6": "Basic attack, basic retreat. ",
        "35... f5": "This \"pawn pushing\" will later lead to my opponent's downfall. He is oblivious of that now, and only cares about removing my pawn from his area. ",
        "36. f3": "That's exactly why I'm not going to let my pawns leave. ",
        "36... Rd8": "He's moving in to try to give the nightmare pawn some more backup. ",
        "37. exf5": "This will lead to another set of annoying checks. ",
        "37... Rd4+": "Check. ",
        "38. Ke5": "If my king is vulnerable, it might as well be useful. ",
        "38... Rd2": "Take the bishop, I take you, and the nightmare pawn is a queen. ",
        "39. fxg6": "I try to open up my chance for checkmate....the easiest checkmate in the book. ",
        "39... Qb2+": "He should have just taken the bishop, and I'd be forced to take his rook. Then, the nightmare pawn is a queen. ",
        "40. Kf4": "Too late, I see it just in time. Greed is going to destroy him in this game. He was greedy, and wanted condolences for his rook. Bad idea. ",
        "40... hxg6": "Frustrated, he takes down my harmless pawn. This will lead to his downfall. ",
        "41. Qa7": "I don't think he knew what I was doing. I'm actually setting up a checkmate. My opponent's king is trapped on the top row, waiting for my rook to fly up there. ",
        "41... c5": "I assume he thought I was after his pawn? ",
        "42. Bd1": "I'm going to test his impulse. Due to my bishop moving in front of my rook, I no longer have two pieces defending the nightmare pawn. It becomes a queen...if he lets it. But what he doesn't know is if he makes a queen, I make a mate. ",
        "42... a1=Q": "My opponent's impulses destroy him. The nightmare pawn has simply been misunderstood. The nightmare pawn, now the nightmare queen, is not my nightmare, but my opponent's. ",
        "43. Re8#": "Checkmate. I wonder what my opponent was thinking after the message popped up in his gameknot mailbox. Did he think I resigned? Oh no...much the opposite. Thank you for reading this annotation, and making comments and your suggestions. I will read all of them one by one. "
    },
    "url": "https://gameknot.com/annotation.pl/the-nightmare-pawn?gm=43548",
    "gameName": "The Nightmare Pawn ",
    "players": "spainwins (1190) vs. pnennig (1212)",
    "opening": "Robatsch (modern) defence (B06)"
}