{
    "moves": {
        "1. e4": "Mikhail Tal was perhaps the best attacking player of all time. The eighth World Champion was a calculating monster who loved to sacrifice pieces during attacking combinations. The game that follows was played during the 23rd USSR Championship (about four years before he won the title). Living up to his reputation as \"the attacker's attacker\", Tal forces Simagin to move his king 20 times out of 44 total moves! Enjoy:)",
        "1... c6": "Black appears to be leaning towards a Caro Kann. Or is he?",
        "2. d4 d6": "!? One of Simagin's \"pet\" lines. Time to throw the book out of the window.",
        "3. Nc3": "Simple development. A more positional approach was 3. c4 (hitting d5 while expanding on the queenside).",
        "3... Nf6": "Developing as well and preparing to castle kingside.",
        "4. f4": "?! While deliberately weakening his kingside, Tal sees the importance of the e5 square.",
        "4... Qb6": "Applying pressure on d4, and restricting white's dark squared bishop.",
        "5. Nf3 Bg4 6. Be2 Nbd7": "Logical development by both players.",
        "7. e5": "Tal tests the waters.",
        "7... Nd5": "Threatening to double white's pawns on the c file.",
        "8. O-O": "Tal is not too worried about his pawns stacking up, so he secures his king.",
        "8... Nxc3 9. bxc3 e6": "?! Sort of slow. 9...g6 was more aggressive.",
        "10. Ng5": "! Is it possible that Tal sees a mating combination on the kingside this early?",
        "10... Bxe2 11. Qxe2 h6": "?! In an attempt to kick out the knight, black creates a new weakness.",
        "12. Nxf7": "!! You must understand that chess was king (pardon the pun) in the former Soviet Union. This game was played before a big crowd of people. When Tal played 12. Nxf7, the place erupted. It got so loud in the hall that the arbiter threatened to kick out all of the spectators! Can you imagine being held \"in contempt of court\" at a chess match?",
        "12... Kxf7": "Simagin takes the material advantage. Little did he know that his king was about to get very, very tired.",
        "13. f5": "Since white owns the f file, he attempts to open it up.",
        "13... dxe5": "?! It's tough to come up with anything better here. However, black is now officially in trouble.",
        "14. fxe6+": "Black has to take the pawn to save the knight. But the real surprise comes next. Can you spot it without looking ahead?",
        "14... Kxe6 15. Rb1": "!! WHAT??????????????????????????????? Tal is at -3 on material and he sacs a rook? A known lover of vodka, Tal may have seemed to his opponent to be totally drunk. Was this a total blunder? or a tactic so deep that only the Magician could see?",
        "15... Qxb1": "Simagin accepts the bait, and a series of forced moves follow.",
        "16. Qc4+ Kd6 17. Ba3+ Kc7 18. Rxb1 Bxa3 19. Qb3": "! Attacking the bishop AND b7! Sorry black, you can't save them both!",
        "19... Be7 20. Qxb7+ Kd6": "Once again, black is forced into a series of king escapes.",
        "21. dxe5+ Nxe5 22. Rd1+ Ke6 23. Qb3+ Kf5 24. Rf1+ Ke4": "Black's king is attempting to stay in the middle of the board to avoid losing any more material. The problem is, that is JUST what Tal wants.",
        "25. Re1+ Kf5 26. g4+": "! Taking with the king only brings him closer to white's power - taking with the knight loses his bishop.",
        "26... Kf6 27. Rf1+ Kg6 28. Qe6+": "! Checking AND forking two pieces.",
        "28... Kh7": "Trying to find a hole to hide in and catch a breather. Black's king is now due for his 3000 mile oil change.",
        "29. Qxe5": "Tal opts to take the knight. His pressure on black has momentarily stalled.",
        "29... Rhe8": "Now black tries to get back in the game.",
        "30. Rf7": "Threatening Qxg7#.",
        "30... Bf8": "A weak discovered attack on white's queen.  It does, however, force Tal to react (for once!)",
        "31. Qf5+ Kg8 32. Kf2": "!? WHAT!!!!!!!!!!!!!!!!!!!!!!!!! Tal INVITES Simagin to attack him! He MUST be drunk! (In reality, Tal's post mortem explained his desire to get his king to g6).",
        "32... Bc5+": "Black now starts his first real offense of the game.",
        "33. Kg3 Re3+ 34. Kh4 Rae8 35. Rxg7+": "!! Tal sees that his king won't make it to g6 after black has doubled up his rooks, so he just SACS ANOTHER ROOK!!!!!!!!!!! All kidding aside - he's drunk. Got to be..............................",
        "35... Kxg7 36. Qxc5 Re8e6": "?! Many question this play.",
        "37. Qxa7+ Kg6 38. Qa8 Kf6 39. a4": "And Tal starts the run towards promotion.",
        "39... Ke5 40. a5 Kd5 41. Qd8+ Ke4 42. a6 Kf3": "? Re2 was better.",
        "43. a7 Re3e2": "Black now threatens to gobble pawns, but it is too late.",
        "44. Qd3+ Re6e3 45. Qxe3+": "And black resigned as he can't stop the a pawn from promoting. When it comes to sacrifices, no one could match Tal! Both rook sacrifices in this game were genius (especially the first one on move 15). Because of inspiring play like this, Tal went on to win the World Championship from Botvinnik four years later (he turned right around and lost it to Botvinnik a year after that). While his reign at the top may have been short, Tal continued to be considered an upper echelon GM some 30 years after he lost the title. And I wasn't kidding around with drinking jokes - Tal was a chain smoking booze lover (who allegedly got hooked on morphine as well). The toll that his vices took on his body was severe. I guess that his addictions were the great equalizer with the rest of us. He was only a man - but his chess was truly magic. I hope you have enjoyed:) - Thomas"
    },
    "url": "https://gameknot.com/annotation.pl/the-magician-from-riga?gm=790",
    "gameName": "The Magician from Riga",
    "players": "Mikhail Tal (2475) vs. Vladamir Simagin (2625)",
    "opening": "Caro-Kann defence (B12)"
}