{
    "moves": {
        "1. d4": "I decided to try out the Queen's Pawn Opening.",
        "1... Nf6 2. Nf3": "The Queen's pawn Game (A46). Next move does not comply with any variation of the opening.",
        "2... d5 3. Nc3 Nc6": "The Development looks like the reverse four knights game.",
        "4. Bf4": "I develop normally.",
        "4... e6 5. Ne5": "This, I think, was not the best move I could have done. Black would never move to e5 anyway! Better was 5.e3.",
        "5... Qd6": "Black probably thought that his Queen was to be queened royal highness of every other piece. Black started to get trapped in his own victory road.",
        "6. Nxf7": "Gave up a lingering and almost entirely useless Bishop for a rook. Best to call this breaking news article: Knight Suicided; Bishop lost.",
        "6... Qxf4 7. Nxh8 Ng4": "Black calibrates my eternal weakness, f2, but luckily it is a one move fix.",
        "8. f3 Ne3": "The Royal Dinner Pin coming right up.",
        "9. Qd2 Nxd4": "I saw Black's threat and there's only one way to prevent it. Also note that my knight on h8 has no escape right now. ",
        "10. Rc1 Qe5 11. Qd3": "I wanted to get my Queen out into the field, but I have to make sure that as of right now, c2 is guarded twice",
        "11... Nef5 12. e4 c5 13. Qd1": "I could have done 13.b3, but what happens in the next two moves is magically mysterious.",
        "13... dxe4 14. fxe4 Qxe4+ 15. Nxe4": "Black lost his delicately place Queen after his Queen entered my knight's secret weapon, a cannon.",
        "15... b6": "I don't even know why Black bothered to play this move.",
        "16. c3 Nc6": "Maybe a Black Knight is just as bad in luck as a Black cat, only except that the bad luck affected his team.",
        "17. Bb5": "17.Qa4 is just as good.",
        "17... Bd7 18. O-O Ne3": "This is not even close to a fork.",
        "19. Qh5+ Ke7": "Why not 19...g6? 19...g6 20.Qxh7 Nxf1 21.Rxf1 and there's no doubt about the winner.",
        "20. Qf7+": "The Knight that has been stuck in the pit is now being helped out of it.",
        "20... Kd8 21. Qxf8+ Be8 22. Bxc6": "This was the best way to get checkmate.",
        "22... Rc8": "there are many ways to mate, but I decided between two of them. One was harder to see: 23.Nf7+ Kc7 (no choice) 24.Qd6#. The other one is the easier one that I played where the White Queen and the Black King actually mate (just kidding)!",
        "23. Qd6+ Bd7 24. Qxd7#": "Using all of my pieces from beginning to end helped out a lot in the process of checkmating."
    },
    "url": "https://gameknot.com/annotation.pl/the-pressure-game?gm=40011",
    "gameName": "The pressure game",
    "players": "chesskingdom64 (800) vs. brodhubel (1179)",
    "opening": "Queen's pawn game (A46)"
}