{
    "moves": {
        "1. e4": "Knowing how my opponent would defend I set out knowing I could play this without fear of something I dislike.",
        "1... Nf6 2. e5 Nd5 3. d4 d6 4. c4 Nb6 5. exd6": "The exchange variation. My preferred way to play against the Alkhine, I have never tried the four pawn attack and instead play the exchange variation which is a little less ambitios but good none the less. I am actually going for a specific sub variation, the one I call the weird v variation.",
        "5... cxd6": "Some people play exd I dont know which is better or for that matter which I prefer my opponents to play however all my opening knowledge is for if they play this move. So I am happy to continue my book knowledge.",
        "6. Be3": "I'm not sure exatly what order I'm meant to play the moves for my variatoion however I do know the set up which is good enough.",
        "6... g6 7. Nc3 Bg7 8. Rc1 O-O 9. b3": "The Voronezh variation. I cant spell it without looking it up and I certaintly can't prounounce it. So I just call it the weird v variation. It delays kingside development to stop black adopting his usual game plan for the opening. It also scores very well for white.",
        "9... Nc6": "I have found out since playing this that after ...Nc6!? white mainline is for white to play d4 however I didn't know that at the time.",
        "10. h3": "?! probably a waste of time, it was done to prevent the knight being pinned which is I think thematic in the alkhine, however I suspect the immediate Be2 was better especially as that is whats likely to be played anyway.",
        "10... Bd7 11. Nf3 Rc8": "I'm still waiting for the eventual e pawn thrust which is I also think common in this version of the alkhine.",
        "12. Be2 f5": "threatens ...f4",
        "13. Qd2 Be8 14. Bh6": "To be rid of blacks strong DSB. I was also considering playing Ng5.",
        "14... Nd7": "?! I dont think this was a very good move from blacks perspective, it blocks the d7 square for the LSB so that white can now trade it off. I think as white my position is alright. White seems to have a slight bind going on as well as more options to play.",
        "15. Bxg7 Kxg7 16. Ng5": "! Cashing in on the hole at e6. black will have to give up his other bishop.",
        "16... Bf7 17. Nxf7": "This probably could have waited. instead 17.d5 comes into consideration, it keeps up the bind and leaves black with few options. and it's not like I was in a hurry to take the bishop, the only other square for it was g8.",
        "17... Rxf7 18. O-O Nf6 19. Rfe1": "probably d5 was still the better option here. This has the feeling of letting black gradually get something out of his position.",
        "19... e5": "Good move, I cant help but feel I have let go a bit of my good position.",
        "20. dxe5 dxe5 21. Qxd8 Rxd8": "I suspect I have missed some kind of oppertunity here, with all these exchanges black has managed to free up his position.",
        "22. Rcd1": "contesting the open file. probably I should have played f3.",
        "22... Rfd7": "good move, doubling up on the only open file.",
        "23. g3": "?! weakning probably f3 or even RxR were better.",
        "23... Nd4": "! ",
        "24. Bf1": "?? Absoloute blunder. ",
        "24... Nf3+ 25. Kg2": "Maybe even Kh2 to open the g2 square for the LSB.",
        "25... Nxe1+ 26. Rxe1 e4": "cramping white a bit.",
        "27. Na4": "aiming for some better squares.",
        "27... b6": "cutting off the c5 square.",
        "28. c5": "counterplay. if black tries ..b5 then I can play c6 and have something going.",
        "28... bxc5 29. Nxc5 Re7": "only square that stops me playing Ne6+ ",
        "30. Bc4": "renews the threat however.",
        "30... Nd5": "Of course my first insinct is to play Rd1, however that would be a blunder since it allows Nf4+ ",
        "31. Kg1": "allows Rd1 but probably not the best move I could have made.",
        "31... Nb6": "?? Black returns the favour of blundering the exchange, however this time black will get a bit of compensation in the form of a better endgame.",
        "32. Ne6+ Rxe6 33. Bxe6 Kf6 34. Bc4": "only move",
        "34... Nxc4 35. bxc4": "so material is back to even however black definatly has the better endgame.",
        "35... Rd2": "! taking over the the second rank.",
        "36. Rc1": "Giving up the a pawn to push the c pawn. however black does actually have enough time to stop a promotion, I didn't realise this when I played the move but then maybe there wernt many other options. a3 was an alternative though. Maybe giving up the a pawn by playing Rb1 was best.",
        "36... Ke6": "Black wasn't concerned about going after my a pawn just yet. Instead he brings his king closer to the action.",
        "37. c5": "the theory was to push the pawn as far as possible before the king could immobalise it. ",
        "37... Kd7": "practially forced.",
        "38. c6+": "a3 was the better move here, it presents some sort of resistance.",
        "38... Kc7 39. a4": "Black is going to win this, I dont think there are any ways to turn it around or even hold the draw, perhaps the viewer can shine some light on the situation and offer alternatives on how I could have played the endgame? I suspect I need to work on my endgame play if I want any hope of advancing beyond the 1000 region of rating.",
        "39... Rd6 40. f4": "? a very poor move to make, I wanted black to take it so maybe f3 would have been more accurate.",
        "40... Rxc6 41. Rxc6+": "?? I should have kept rooks on if I wanted any hope of drawing this game.",
        "41... Kxc6 42. Kf2 Kc5 43. Ke3 Kb4": "0-1 I could see no way of holding this game so I resigned. Please comment, I suspect here many improvements I could have made throughout this game so please tell me so I can improve."
    },
    "url": "https://gameknot.com/annotation.pl/the-weird-v-variation?gm=41073",
    "gameName": "The weird v variation",
    "players": "thereaper1 (1072) vs. opponent (1698)",
    "opening": "Alekhine's defence (B03), exchange, Karpov variation"
}