{
    "moves": {
        "1. e4": "Well, surely not the high-quality game of the day, as both sides commit severe mistakes, but hopefully a entertaining one.",
        "1... c6": "I usually choose the Caro-Kann to defend against 1. e4.",
        "2. d3": "I don't see what virtues the modest d3 might have, I guess d4 is simply better.",
        "2... d5 3. exd5": "...especially if you go for the exchange variation.",
        "3... cxd5 4. Nf3 Bg4": "Bringing the bishop out before playing e6.",
        "5. Be2 Nf6 6. Bg5 e6 7. Ne5": "Black does not fear this manoeuvre as his light-squared bishop is not a very precious piece in the Caro-Kann.",
        "7... Bxe2 8. Qxe2 Nc6 9. Nd2": "White might consider taking on c6 here, leaving black with a backward pawn on the c-file.",
        "9... Rc8 10. O-O Nd4": "Premature. Better is Bd6 or Be7, with equality.",
        "11. Qd1 Rxc2": "A silly move! If you play one of the pet openings of former world champion Anatoly Karpov, you should also follow his rule not to engage serious actions before having finished the development of your pieces. Once again Bd6 was the right move here. Even taking with the knight seems to be better than the text: ...Nxc2, and 12. Rc1  Kb4 (or Kd4), 13. Qa4+ Nc6, 14. Nxc6 Qd7, 15. Qxa7 might follow.\n",
        "12. Be3": "The right move! Of course not 12. N2f3 because of 12. ...Nxf3+.",
        "12... Rxd2": "Losing the exchange for a pawn. Even worse is 12. ...Bc5, 13. Bxd4 Bxd4, 14. Qxc2 Bxe5, after 15. Nf3.",
        "13. Qxd2 Nf5": "White has won material, but has not yet won the game. This seems to be the best square available for the knight.",
        "14. d4": "If 14. Bxa7, ...b6.",
        "14... Bd6 15. f4": "Seems to lose a tempo and slightly weakens the king's position. The Knight can be chased anyway after ...Ne4, followed by ...f6.",
        "15... O-O": "From now on I wisely stick to finishing my development...",
        "16. h3": "Preparing g4 in order to chase the knight on f5 but at the same time offering him an even better square at g3!\n",
        "16... Ne4": "But first I bring the other knight into the center, with tempo.",
        "17. Qd3": "Seems to be the best square for the queen, but White's position already is not enviable.",
        "17... Nfg3": "As long as Black's two knights manage to stay where they are, there is no need for crying over the lost rook...",
        "18. Rf3": "Maybe the rook had better stay on the back rank.",
        "18... f6": "Chasing the knight as planned.",
        "19. Ng4 Qb6": "Attacking the pawn and thus bringing the rook into play with tempo.",
        "20. b3": "In hindsight maybe Rb1 might have been better, keeping the c3-square protected.",
        "20... Rc8 21. Rc1": "White would like to get rid of one of the knights by playing 21. Bf2, but he has to contest the c-file, otherwise the rook comes to c3!",
        "21... Rxc1+ 22. Bxc1": "Now the bishop is badly placed.",
        "22... Qa5": "Also attacking the pawn on a2, but this is not the main target.",
        "23. Be3": "23. Be3? White must not allow Black's queen coming to e1, so the only move is 23. Qd1.",
        "23... Qe1+": "At this point white offered a draw considering that he has to give back the exchange to avoid mate (because of 24.Kh2? Qh1#).",
        "24. Rf1": "But black has a better move than 24. ...Nxf1.",
        "24... Ne2+": "White has to give the queen for the knight or, as played, loses the rook (and I think there should be a forced mate available, something like: 25. Kh2 Qxf1,26. Bf2 Bxf4+, 27. g3 Bxg3+, 28. Bxg3 Qg1#; or: 26. Qc2 Bxf4+, 27. Bxf4 Qxf4+, 28. Kh1 Qf1+, 29. Kh2 Ne2g3).",
        "25. Kh2": "0-1"
    },
    "url": "https://gameknot.com/annotation.pl/the-revenge-of-the-knight?gm=24093",
    "gameName": "The Revenge of the Knight",
    "players": "sutrisno (1615) vs. mirela22 (1738)",
    "opening": "Caro-Kann (B10), closed (Breyer) variation"
}