{
    "moves": {
        "1. e4 c6 2. d4 d5 3. e5 Bf5 4. Nc3 e6 5. g4 Bg6 6. Nge2 Bb4": "With the idea of developing the bishop before playing ...Ne7.  However without any specific objective the bishop might as well stay on f8.",
        "7. h4 Be4 8. Rh3 h6 9. a3 Be7": "loses a couple of tempi.  If Black is not going to play ...Bxc3, what is the point of 6... Bb4.",
        "10. Nxe4 dxe4 11. Be3 Bxh4 12. Nc3 Nd7 13. Nxe4 Be7": "The bishop moves yet again.",
        "14. c3 Qc7 15. Qc2 O-O-O 16. O-O-O Kb8 17. f4 f6": "Fritz suggest 17...Nb6!?",
        "18. Bc4 f5": "White has a strong position and Fritz recommends 19 Nf2.",
        "19. Bxe6": "I decide to give up my knight for two pawns, giving me a mobile pawn center.   Fritz considers this a major blunder, since I am not only giving up material but Black will have the initiative for awhile.   My feeling is that Black's initiative will eventually dissipate and then my mobile pawn center will make it's power felt.   This is all beyond the machine's horizon and illustrates the difference in how humans view things as opposed to computers.    ",
        "19... fxe4 20. Qxe4 Nb6 21. Qg6 Bf8 22. Ba2": "This is where Ion has suggested White could improve.   Perhaps 22. c4 Ne7 23 Qe4.",
        "22... Ne7 23. Qc2 Ned5 24. Bd2 Qd7 25. f5 Be7 26. c4 Nc7 27. Be1 Bg5+ 28. Kb1 Na6 29. Qh2 Ka8 30. e6 Qe7 31. d5 cxd5 32. cxd5": "Fritz believes that Black has an edge.",
        "32... g6": "?? The losing move according to Fritz.  Here Fritz suggests 32... Nc8 when Fritz believes that Black would have an edge.   I disagree and believe that White still has better chances after 32...Nc8.",
        "33. d6": "Black is now overrun by the White pawn center.",
        "33... Qg7 34. Bc3 Bf6 35. Bxf6 Qxf6 36. Rxh6 gxf5 37. Rxf6 Rxh2 38. e7 Re8 39. Rf8 Rh8 40. Rxe8+ Rxe8 41. gxf5 Nd7 42. Bf7 Rh8 43. e8=Q+ Rxe8 44. Bxe8 Nab8 45. Bxd7 Nxd7 46. Re1": ""
    },
    "url": "https://gameknot.com/annotation.pl/the-worth-of-a-pawn-chain?gm=25941",
    "gameName": "The Worth of a Pawn Chain",
    "players": "blake78613 (1798) vs. sipo (1578)",
    "opening": "Caro-Kann (B12), advance, Short variation"
}