{
    "moves": {
        "1. e4 e5 2. Bc4 Nf6": "Bishop's opening, berlin defense, in thematic tourney",
        "3. Nf3": "The position has now shifted into Petrov, Italian",
        "3... Nc6": "Two knights",
        "4. Ng5 d5": "the most common move is exd5,\nYet, in two knight opening, f7 pawn sacrifice makes for interesting middle game, and since two opponets are evenly matched the advantage for adventure is on the white's side",
        "5. Nxf7 Kxf7": "Black takes knight to avoid queen loss",
        "6. exd5": "exd5 \nAs a black, I would probably reply with Na5 since that takes care of the white bishop reign;  while controling the center and removing  a strong king threat. \nIn which case i would reply with d3 and white's advantage would have turned to marginal.   instead Black replies with ...\n",
        "6... Nxd5": "Nxd5 a popular move.   But now we are in Fegatello Attack variation.\nand black needs not to make mistakes to survice",
        "7. Qf3+ Ke6": "standard move within variation",
        "8. Nc3": "Building pressure on d5 pin",
        "8... Nce7": "Nc-B4 would have been a more proactive choice to counteract white's attack\nInstead Black is trying to defend its lead",
        "9. O-O": "castling, in order to add pressure next move on Re1",
        "9... c6 10. Re1 Qc7": "Better move was Kd6, The king would have escaped two pins, while still holding to e-pawn",
        "11. d4 Ng6": "while the black had to protect the e-pawn with its only remaining defense Ng6. \nblack has weakened d5 square",
        "12. Nxd5 cxd5 13. Qxd5+": "A  strong position for white, ",
        "13... Ke7 14. Bg5+": "Adding another bishop to the attack",
        "14... Ke8": "Ke8 forced move",
        "15. dxe5": "Altough still hanging in there, black's King is wide open! ",
        "15... h6 16. Bd2": "The only good retreat move for my bishop",
        "16... Bf5": "Bf5 opens a way for the future Rd8 move, but ...",
        "17. Bb5+": "Bb5  and black losses tempos with his bishop retreat",
        "17... Bd7 18. Rad1": "control of the center is crucial for white to keep advantage.\n",
        "18... Bxb5 19. Qxb5+ Qc6": "a queen exchange would even out  this game. However, with Black King open it gives me more chances to win if i dont exchange",
        "20. Qd3": "Qd3 is perhaps not the best retreat move",
        "20... Rd8": "that is why",
        "21. Qb3": "could have just moved to Qb3 earlier (but I got lost in all the thinking)",
        "21... Bc5 22. e6": "passed pawn, is stronger as it gets closer to its target (assuming its well protected)",
        "22... Ne7": "Ne7 is good defensive reply, since it block white pawn development protects the knight and does not interfere with Rf8 move to attack my f2 pawn",
        "23. Qg3": "Qg3 changing directions to plan attack from the other side",
        "23... Qb6": "Black adding pressure on f7 pawn, and at least capturing b-pawn as a back-up plan",
        "24. Qxg7": "f7 square threat for mate, im not too worried with Bxf2  move",
        "24... Bxf2+": "check",
        "25. Kh1 Rg8": "Black misses the f7 threat. he should have played Rf8\n\n\n",
        "26. Qf7#": "f7 square mate which started with popular knight sacrifice.\nEven without the Rg8  mistake White eventually probably mates.\n\nSo, Analyzing the board\n\n25. Rf8-Bh6 now there is threat for f7 & f8 mate\n      Black cannot take my d rook because of Qxf8  \n         If black moves 26. Rf5 to protect f7 & f8 squares,\n         Then  i have other tricks in my sleeve, for example Qh8\n\n\nIf you can figure out the defense for the black please email me i'd like to hear it\nThanks!\n\n"
    },
    "url": "https://gameknot.com/annotation.pl/the-bishops-opening?gm=2498",
    "gameName": "The Bishop's Opening",
    "players": "pelvitski (1646) vs. amad_perets (1645)",
    "opening": "Bishop's opening (C24), Berlin defence"
}