{
    "moves": {
        "1. d4 b6 2. e4 Bb7 3. d5": "This shall not be good. But my opp played all the time this line, and I wanted to test him against it. A pity my opponent resigned - far too early!",
        "3... e6 4. Bc4 exd5 5. Bxd5": "By retaking wiht the pawn, I expose myself to all kind of threats based on the diagonal. ",
        "5... c6 6. Bb3": "Now I have time to defend somehow... or not?",
        "6... h6": "Now this is a waste of a move. But I can understand: the follow up attack on e4 is with Nf6, but if he plays it, I can pin and exchange his N. This prevents it. ",
        "7. Qf3": "Planning some kind of tick based on e5 and the loose lsb. ",
        "7... Qe7 8. Ne2": "This column is something I shall care for asap. ",
        "8... Na6": "? d5 would have been crushing. Still, I can understand he wants to get rid of my lsb, and plans Nc5. Those are three moves. What can I do in three moves?",
        "9. O-O Nf6 10. Nbc3 O-O-O 11. a4": "Go for my lsb, go!",
        "11... Nc5 12. a5 Ncxe4": "He didn't. He grabbed a central pawn. Very important. Still, it doesn't threat much right now!",
        "13. axb6 a6": "Saved for now, but weakened. ",
        "14. Bf4": "The c7 spot belongs to my B!",
        "14... c5 15. Bc7": "Black didn't defend from this, based on his own fork threat: ",
        "15... Nd2": "What a move! Still...",
        "16. Qd3": "Eyeing a6 for a deadly sac! Can you see it?",
        "16... Nxf1 17. Rxa6": "...ignoring the N. Always think about what would you win letting a loose piece like the Rf1 en prise: if you are not forced to reatke it, two full tempoes for the attack. Now, of course, if BxR is mate in one. But hey if he doesn't take the R, what? This is part of the plan: can you see it?",
        "17... d6": "Opening a fly square for the king. Shall I take the N back? Would you? The plan was: Ra8+!, BxR (forced), Qa6+, Bb7, and now Qa7 threatens mate in one, so black has to move the d pawn, say d6. Then Ba4, renewing the mate threat, and I can't see anything black can do to avoid mate or, in the worst case (let's say I forget to play Ba4, and went for Qb8?+: Kd7 - forced, QxB. Moreover: even if the black K manages to escape to e6, I would still have Nf4+, with the other N covering e4 and d5. I can't lose, even with -4. Black has virtually  N, a R and a B not playing. ",
        "18. Ba4 g6": "Having played d5 before, now black could have saved the day with c4. Now, another desperado move would be Qe5, threatening h2. But white has no problems playing Ng3. White shall not move his Nc3 at all, or black will play Qe4, threatening mate on g2 and thus forcing the Q's exchange. ",
        "19. Ra8+": "My opponent resigned. Let's see some more moves: ",
        "19... Bxa8": "Forced. ",
        "20. Qa6+ Bb7 21. Qa7 Qxc7": "The only move that will spare the mate for black, as far as I can see. ",
        "22. bxc7": "Qb8# is still threatened, so ",
        "22... Kxc7": "is forced. White can't relax or Ra8, and it is still -4 (even taking the N, material would be almost even!). From here, white nas NO forced win as far as I can see. The WQ is trapped after Ra8, so white has to keep black controlled with Qa4+, Kc8 (forced, or loses the R. Then, Nb5 allows lines similar to the following. Nf4 is another way to win, after Nf4, ...Ra8, Nd5+, ...NxN, NxN+, ...Kc8 (forced), Nb6+ and wins Ra8. But let's say white plays... ",
        "23. Nb5+ Kc6 24. c4 Ra8 25. Ned4+ cxd4 26. Nxd4+ Kc7 27. Nb5+ Kc6 28. Nc3+ Kc7 29. Qd4 Be7 30. Nb5+ Kb8 31. c5 Bc6 32. cxd6 Bd8 33. d7": "Threat is Qd6+.",
        "33... Bxb5 34. Qd6+ Kb7 35. Qb4 Nxd7": "What else?",
        "36. Qxb5+ Nb6 37. Qc6+ Ka7 38. Qc3 Rh7": "Any square on f, g and h is exposed to forks at some point. ",
        "39. Bc6 Kb8 40. Bxa8 Nxa8 41. Qb4+ Kc7": "...and white will win more pieces: ",
        "42. Qf8": "Only way to save the R is Bf6, but then QxN. Still, black's N stands on f1... untaked. Can you believe? :-)"
    },
    "url": "https://gameknot.com/annotation.pl/the-unplayed-battle?gm=62164",
    "gameName": "The unplayed battle. ",
    "players": "damafi (1461) vs. myth1_1999 (1434)",
    "opening": "Queen's pawn (A40), English defence"
}