{
    "moves": {
        "1. a4": "The first move for the Ware Opening.",
        "1... e5 2. e4": "Took to claim the center.",
        "2... d6 3. Nc3": "Reinforced my claim for the center on e4.",
        "3... Be6 4. Nf3": "Challenging his pawn on e5.",
        "4... f6 5. d4": "Once again challenging his pawn on e5. (Protected by my knight on f3.)",
        "5... c6 6. Be2": "Protecting the knight on f3.",
        "6... Nd7 7. O-O": "Castled.",
        "7... Qb6 8. a5": "Trying to move away his queen from the side so he can't make any good moves.",
        "8... Qc7 9. a6": "Trying to open up a pocket on the side here.",
        "9... bxa6 10. Rxa6": "Took his pawn, and now put him at risk of taking several more pieces.",
        "10... Ne7 11. Be3": "Limiting his range of movement with my bishop.",
        "11... g6 12. d5": "Trying to shuffle up his pieces and cause chaos in his center.",
        "12... cxd5 13. Nb5": "It works because he took my pawn so I am getting ready to take his free pawn on d6 because I am assuming he will move his queen.",
        "13... Qb7 14. Nxd6+": "He did move his queen so I took the free pawn and putting his king in check.",
        "14... Kd8 15. Nxb7+": "Took his queen because he had no choice but to move his king to avoid being checked.",
        "15... Kc7 16. Rxe6": "He is now at a serious disadvantage and there is no way he can win this game. I also took a free bishop.",
        "16... Kxb7 17. Rxe7": "I decide to take his knight to move in for the checkmate.",
        "17... Bxe7 18. Qxd5+": "Check his king once more and getting him one turn closer to checkmate.",
        "18... Kc7 19. Bb5": "Boxing his king in.",
        "19... Nb6 20. Qc6+": "Checking once more.",
        "20... Kd8 21. Bxb6+": "The walls are closing in :D",
        "21... axb6 22. Qd7#": "And checkmate in 22 moves! :)\n\nThe Ware Opening (1. a4) is often dismissed as a pointless move, doing nothing for development. However, like every move, it does have its advantages. In this game, I manage to use the a-pawn to open up the queen-side, allowing a rook penetration down the opened files and ultimately, a win. It is named after U.S. chess player Preston Ware, who often played uncommon openings. The Ware is considered an irregular opening, so it is classified under the A00 code in the Encyclopedia of Chess Openings. I would consider this an \"okay\" opening for regular play. The advantages of using this opening is that it does open up their queen-side and allow for a quick checkmate like in my game, if they don't know how to properly react to such an irregular opening. If used in high-level chess, it would most likely end in a draw, but if you get lucky you could pull a win using this. I would not recommend this though as it does give away your opening advantage, and also gives some advantage to black right off the bat, and if you are playing a well experienced player, it will be very hard to get that advantage back."
    },
    "url": "https://gameknot.com/annotation.pl/the-ware-opening?gm=63553",
    "gameName": "The Ware Opening",
    "players": "kluskie  vs. miguel77777 ",
    "opening": "Crab opening (A00)"
}