{
    "moves": {
        "1. e4": "White starts conventionally.",
        "1... e5": "Black replies with the same.",
        "2. Nc3": "This is the Vienna Game http://en.wikipedia.org/wiki/Vienna_Game",
        "2... Nc6": "Black continues to copy.",
        "3. f4": "This is now the Vienna Gambit, a King's Gambit, with both sides having their queen's knight developed.",
        "3... exf4": "Black accepts. In the 19th century, it was considered unsporting not to accept gambits.",
        "4. d4": "This is a mistake by White, allowing the black queen to check on h4. Better is Nf3 or even Bc4, so that if the queen checks, the white king has f1 to go to.",
        "4... Qh4+": "So black throws in the check.",
        "5. Ke2": "And the king starts his march up the board.",
        "5... d5": "Black gives his extra pawn back, to open up the game. It is very much in the style of 19th century chess. Simply d6 is better.",
        "6. exd5": "So white takes.",
        "6... Bg4+": "Black throws in a check",
        "7. Nf3": "White blocks, rather than part with his queen.",
        "7... O-O-O": "Black castles, sacrificing a knight for an attack.",
        "8. dxc6": "So white takes.",
        "8... Bc5": "Black concentrates on development.",
        "9. cxb7+": "White takes again.",
        "9... Kb8": "The black king decides to shelter behind he pawn, rather than take it. Amazingly all this was played again in 1997! http://gameknot.com/analyze-board.pl?bd=x592552&mv=17&rnd=0.6976808656472713\nIn that game white decided to try Qe1 and lost after Qh5\n11.\tBxf4\tRe8+ 12.\tBe3\tBxd4 13.\tNd1\tNf6 14.\tQd2\tBxe3 15.\tNxe3\tBxf3+ 16.\tgxf3\tNd5 17.\tRe1\tNxe3 18.\tKf2\tNg4+\n19.\tKg3\tNe5  20.\tBg2\tRe6 21.\tQc3\tRhe8 22.\th4\tg5 23.\tRe4\tf5 24.\tRa4\tgxh4+ 25.\tRhxh4\tQg5+ 26.\tKf2\tNg6\n27.\tRh2\tRe2+ 28.\tKf1\tQc1+",
        "10. Nb5": "Played to protect d4",
        "10... Nf6": "Blcak continues to develop.",
        "11. c3": "White re-enforces d4 again.",
        "11... Rhe8+": "Black throws in a check.",
        "12. Kd3": "The king advances again.",
        "12... Bf5+": "Another check",
        "13. Kc4": "King advances again.",
        "13... Be6+": "Check again",
        "14. Kxc5": "and white accepts another sacrifice, but it is very risky!",
        "14... a5": "This is a great move by black, stopping the white king from retreating. White can now take the black queen as well, but, as Hartston points out, if he does, he is mated by 15..... Ne4 check, 16. Kc6 Bd5 mate.",
        "15. Nxc7": "This is a great move by white, sacrificing a knight, but giving his king the flight square of b5.",
        "15... Qh5+": "Black throws in a check.",
        "16. Ne5": "And white comes up with this brilliant queen sacrifice. As Hartston points out, if black takes the queen on d1, white regains the queen with 17. Nc6! and if Kxf7 then Bxf4+ or if Kxb7 then Ba6+ and in both cases the bishop move, as well as giving check, opens the way for a white rook to take the black queen.",
        "16... Nd7+": "So black throws in another check instead. Of course white can't take this knight with his knight on e5 as it is pinned by the Black queen on h5.",
        "17. Kb5": "So the king moves.",
        "17... Qxd1": "and now the queen falls. 18. Nc6+ now no longer works, and after Kxb7 the white king on b5 blocks the Bf1 from going to a6 with check.",
        "18. Bxf4": "White sacrifices again, to get his bishop into the attack!",
        "18... Qxa1": "So black takes! ",
        "19. Ka6": "As Hartston says \"Suddenly the white king is transformed into an powerful attacking piece. The threat is Nc6 mate and 19.... Kxc7 20 Nxd7+ Kxd7 22. Bb5+ would also win for white.\"",
        "19... Nxe5": "Black takes.",
        "20. Nxe8": "White takes. To quote Hartston again \"White threatens Bxe5 mate. Black should now play Rd5, but instead makes a plausible error.\"",
        "20... f6 21. dxe5": "White takes the knight, threatening e5xf6 mate.",
        "21... f5": "So black keeps the diagonal closed. ",
        "22. Be3": "Threatening Ba7 mate. ",
        "22... Rxe8": "This gives the black king c7 as a flight square.",
        "23. Bb5": "White brings his last piece into the attack, sacrificing his other rook.",
        "23... Qxh1": "Black takes the rook. ",
        "24. Ba7+": "White throws in a check.",
        "24... Kc7": "The only way out of the check. White now has a draw with 24. Ba6-b6+ Kb8 Bb6-a7+ etc, but he tries for more.",
        "25. Bc5": "White is now threatening 26. Bd6+ Kd8 b8=queen+! There is an amazing defence in Bc8! when white has nothing better than to accept the draw with Bb6+ etc again. White again makes a plausible defence.",
        "25... Rd8": "Black prepares sacrifice his rook, should white check on d6. OK, in the position, try and find white's next move!",
        "26. Ka7": "Did you find it? With this move, white threatens Bb6 mate and black resigns. To directly quote Hartston for one last time \"A Truly remarkable position. There is no satisfactory defence to the threat of Bd6 mate, Despite his extra Queen and Rook, Black is completely helpless, The White King, for so long an object of attack, finally has the last word,\"\nMany thanks for reading my annotation, please leave a comment, if not more, and rate it on the star system...."
    },
    "url": "https://gameknot.com/annotation.pl/the-king-leads-the-way-to-victory?gm=57325",
    "gameName": "The King leads the way to victory!",
    "players": "The Hon. R Steel  vs. Unkonown ",
    "opening": "Vienna (C25), Steinitz gambit, Zukertort defence"
}