{
    "moves": {
        "1. e4": "I liked this game because of the end game. I was down 2 pawns to 3 with a rook each, hoping against hope for a draw, and turned it around to a rook vs 3 pawns.",
        "1... e5": "You know the drill. :)",
        "2. Nf3 Nf6": "When I was younger I always played knight to c6, the most commonly made 2nd move, but after a while I got to thinking... When I play white I play the exact same opening, so why should I do what I would want me to do if I was playing me?\nSo I looked for something different about 8 months into my GK life, and I found this. Things begin to happen much faster with this opening, and some players even make an early blunder, thus allowing me an easy advantage.",
        "3. d4": "Not the most common white response, but I don't mind it at all. I like to escape the monotony of boring four knights openings. :)",
        "3... Nxe4 4. Bd3 Nc6": "This move was just trying something new. I saw it in the database and liked it, so I figured: why not? It looked fun. So I played it.",
        "5. Bxe4": "Seems free, right?",
        "5... d5": "Well, okay, not FREE, per se. Bishop's only safe retreat gets the bishop and knight forked.",
        "6. Nxe5": "A fine move, the pieces were going to be exchanged anyways, white just did it his way.",
        "6... Nxe5 7. dxe5 dxe4 8. Qxd8+": "An inevitable loss... the castling king. I believe that this is why I ended up with a losing position coming into the end game. It's now going to take me 3 moves to castle, at the very minimum. White even has ways of stopping that castle from ever taking place.",
        "8... Kxd8 9. Bg5+": "All white wants to do right now is develop before black has a chance- white's advantage is that he can spend 2 extra moves developing while blacks trying to castle. I don't know if I agree with this move, however, as black then gets a bishop exchange AND moves his king to e7, leaving only 2 moves left in his castle, and now white no longer has moves to stop the castle. White has just effectively shortened his 2 move lead to a one move lead.",
        "9... Be7 10. Bxe7+": "I think I might have just pulled back to f4 as white, even after the wasted check. I don't understand why white wants to trade bishops, as if black ever gets the initiative back his white bishop can be a lot more powerful than white's knight.",
        "10... Kxe7": "Re8 or Rd8 allow me to get my king into a castled position, as well as either attacking a pawn or taking a file.",
        "11. Nc3": "Again, white is developing. It's obvious he would like to queen side castle, immediately laying claim to the d file, but there is nothing black can do to stop that. ",
        "11... Bf5": "Bishop protects pawn, only logical move I found.",
        "12. O-O-O": "White completes his queen side castle, still a move up on black.",
        "12... Rhd8": "At this point I'm willing to exchange for the open d file, because my e pawn and bishop may be able to team up with my rook to make a better attack than his knight can ever hope to achieve.\nBetter for black is Ke6, attacking the week pawn and leaving the king in the middle of the board- if the rooks get traded black is going to want to be in the center, not back on f8.",
        "13. Nd5+": "So white now gains a pawn. Kd7 doesn't work because of the double check from Nb6. All right, well this isn't a devastating set back, is it? We'll soon see for sure.",
        "13... Kf8": "Okay, the good news is that black has finally completed his castle. The bad news is that it is now much harder for black to get his king into the battle against the e5 pawn, which he should have done earlier.",
        "14. Nxc7": "White has guaranteed a winning endgame position here.",
        "14... Rxd1+": "It seems to me this was a stupid mistake on my part. I did not have to give up the open file, and I didn't have to trade rooks right now, as more trading will only bring the end game that much quicker, and I'm already down a pawn.",
        "15. Rxd1": "Obvious move, claiming the open file.",
        "15... Rc8": "The only rational move, this move also has a look on the c2 square, if ...e3, fxe3 Rxc2 , and then white's pawns are reduced to cannon fodder. However, this is no more than a dream, as whites Nd5 immediately quashes all hopes for that.",
        "16. Nd5": "Now if ...e3 then Nxe3, thus protecting the c2 square as well as attacking blacks winning bishop.",
        "16... Re8": "At this point I'm desperate to get the pawn back... the end is coming closer and closer by the second and I'm frantically trying what I can.",
        "17. Ne3": "Attacks the bishop, but allows black to gain the pawn back. I make the mistake of assuming I have to get the pawn now, and lose my strong bishop because of it.",
        "17... Rxe5": "Well, at least we have an even score, and the position could be worse for black.",
        "18. Nxf5 Rxf5": "So now black is attacking white's fgh pawns, with the hopes and dreams of one day pushing that e pawn for the win. Hopes and dreams, nothing more.",
        "19. Rd7": "White forsakes his pawns for the exchange.",
        "19... Rxf2 20. Rxb7": "Even again.",
        "20... e3": "It seems now that black may have been better off with the simpler Rxg2, then after 21 Rxa7, Rxh2. On move 22 white's rook is limited in where he can move, and black now has the chance to get behind the pawn.\nA hasty mistake, it seems.",
        "21. Kd1": "The king moves in, of course. If e2 then Ke1 blocks the queening and now black can't even look at the cba pawns without a lot more work.",
        "21... Rxg2": "black takes the pawn now, better late than never.",
        "22. Rxa7 f5": "Now as black I want to get my f-pawn into the attack. The rook moved over, giving him a clear shot, the problem is that it will take way too many moves to even get that pawn close enough.",
        "23. b4": "White even has time to push his pawns, setting up for a better position after the exchange.",
        "23... f4 24. Ra5": "Now white looks to fork on f5. Very easy to avoid, really.",
        "24... f3": "Or....you could just not avoid it? Can't honestly tell you what was going through my head... a very sharp needle, or something, I'd assume.",
        "25. Rf5+": "Losing the pawn here is devastating for black, but it's not over yet. Let's see what the king can accomplish.",
        "25... Ke7 26. Rxf3 e2+": "Okay, so now I have to push, or the pawn gets it.",
        "27. Ke1 Rxh2": "Enjoying a light snack of pawn crunchables.",
        "28. a4": "Pushing more pieces towards the queening ranks. Blacks going to have trouble now.",
        "28... h5": "I chose to move my rook back to attack the pawns, as c3 solidifies white's position too much for my likings.\nInstead I'm going to see if my h pawn can promise any death and destruction after an exchange.",
        "29. Re3+": "Okay, so white finally chooses to win the pawn. Once the rooks are traded there will be no stopping the a b c pawns from marching to victory.",
        "29... Kd6 30. Rxe2": "That powerful e pawn has finally taken his last breath. *funeral music plays in the distance* If not for that stupid f pawn dropping, the e pawn may have one day grown up to be the queen, but she was stabbed in the back by one of her closes friends. ",
        "30... Rh4": "Then, I trade roo---- wait what? No! I can't trade rooks! Not yet! I must keep trying!",
        "31. c3": "But of course! Secures white's little pawn party, which of course I wasn't invited to.",
        "31... g5": "Okay, so now that I got rid of the pesky f pawn there will be nobody to stop the g pawn from achieving her goal of becoming a queen, right? Well... you'll have to wait and see!",
        "32. Rg2": "White's trying to limit blacks squares, and succeeding, give the cba pawns even more power.",
        "32... g4 33. Rg3": "White doesn't want black moving to h3, it seems.",
        "33... Rh1+": "Perhaps maybe I can still get a draw by getting my rook to do enough damage to the cba crew before white picks of my last few men?",
        "34. Kf2 Kd5": "The king wants to join the battle... ",
        "35. Kg2 Rc1": "White's king claims the corner, making it harder for me to run my g and h pawns up after any exchange of rooks.",
        "36. a5": "Okay, so white's now just taking his time. If black moves c4 and tries to exchange rooks the a pawn becomes a queen faster than you can say taco sauce!\nBut it's not over yet!",
        "36... Rc2+": "And now I see it. Remember the e pawn, earlier, betrayed by her dearest friend f, who was secretly working with the white side, and ruined her chances of ever becoming a queen? Well, do you also remember, then, that the g pawn, who can no longer be betrayed by the evil f pawn also one day wants to become a queen?\nWell it just so happens that there's a third piece that wants to one day be promoted. The h pawn. He, however, hopes to one day be a rook, as he's really not into cross-dressing. And he's willing to do anything he has to do it. Luckily, his high school buddy, the rook, is willing to help!",
        "37. Kh1": "Step one: force the white king out of the corner, unless white instead chooses to have a draw. Yeah, right.",
        "37... Rc1+ 38. Kg2": "Back and forth we go, where we're headed nobody knows! Okay, so basically anywhere not on the e file, really.",
        "38... Rc2+ 39. Kg1 Rc1+ 40. Kf2 Rc2+ 41. Ke1 h4": "Now that black has gotten the king out of the corner, phase two of the plan begins: shove your buddy in front of the guard and make a run for it.",
        "42. Rxg4": "It's the guards duty to kill trespassers, so that's what he does, of course.",
        "42... h3": "Run, pawn, run! RUN!!!",
        "43. c4+": "White see's what's coming, and he decides to take this free move to get his pawns one space closer to a queen of his one.",
        "43... Kc6": "I want to be in front of the pawns, once any trading goes down. ",
        "44. Rg6+ Kc7 45. Rh6": "Okay, so the rook finally decides to attack the h pawn.",
        "45... h2": "Aaaaand now he's safe again.",
        "46. Rh7+": "But where on Earth will my king go? Oh no!",
        "46... Kb8 47. Kd1": "White decides to poke the rook, though I can't for the life of me tell you what he hopes to get out of it.",
        "47... Ra2 48. Rh8+ Ka7 49. Rh7+ Kb8": "So at this point I finally open my eyes and say \"enough of this crap!\"",
        "50. Rh8+ Kc7 51. Rh7+ Kd8 52. Rh8+ Ke7 53. Rh7+ Kf8 54. Rh8+ Kg7": "White has to stay on h to avoid getting mated.",
        "55. Rh3": "And now remember how that h pawn would do anything to become a rook? Sacrifice his buddy? Endanger his old friend the rook? Well he wants to be a rook so bad, even if only for a second, that he's willing to die for it. And that's exactly what he does.",
        "55... h1=R+ 56. Rxh1 Ra1+ 57. Kc2 Rxh1 58. Kb3": "NOW the game gets interesting. black has gone from a slight hope to draw to a chance at winning.",
        "58... Kf8 59. b5": "Black's king, however, has a long ways to go to get in the battle.",
        "59... Rh7": "This was a mistake. I eventually wanted to get the rook down here, but not until later: I needed him to be able to get behind the c pawn later, if I wanted a chance to win.",
        "60. Kb4 Ke8": "If that king doesn't get to b8 before his pawns push too much all is for naught.",
        "61. b6 Kd8 62. Kb5 Kc8 63. c5 Kb8 64. a6": "And now we're fine. Rook jumps around a bit, not allowing white to do anything at all, and eventually white accepts a draw.",
        "64... Rh5 65. Kc6 Rh6+ 66. Kb5 Rh5 67. a7+ Kb7 68. Kb4 Rh4+": "Thanks for reading about the little pawns who died, an epic tale of deceit, betrayal, and ultimate sacrifice. If you liked it drop me a comment. If you didn't like it, drop me a comment. If you agree or disagree with something, drop me a comment. If you think I'm a magnificent poof, drop me a comment. If you just want me to shut up...well dropping a comment would just get me to talk more.\nThanks everyone!\nVegiemite"
    },
    "url": "https://gameknot.com/annotation.pl/the-little-pawns-who-died?gm=20329",
    "gameName": "The little pawns who died",
    "players": "pawnpusher2004 (1635) vs. vegiemite (1581)",
    "opening": "Petrov (C43), modern attack, Trifunovic variation"
}