{
    "moves": {
        "1. e4 e5 2. Bc4": "This as a bid to control the center.",
        "2... d6 3. Nc3 Nf6 4. d3": "Already we can see that this game will hinge around the two e-pawns.",
        "4... g5": "Confusing.  Black's motivation for this one is difficult to figure out.",
        "5. Bxg5": "Obvious to take the hanging pawn, and pin the knight to the queen.",
        "5... Bg4": "An attack on the queen, simple enough.",
        "6. Qxg4 Nxg4 7. Bxd8 Kxd8": "White chooses to trade queens, and eliminate the bishop, exploiting his better control of the center (especially the d5 square).",
        "8. Nf3 Bg7": "More bolstering the center.",
        "9. Bxf7": "Another pawn en prise, and it's taken.",
        "9... Rf8 10. Bh5": "White's bishop is chased off the square but continues its attack.",
        "10... c6": "A decent hope to attack the d5 square, but a knight lost.",
        "11. Bxg4 d5": "Having lost the knight, Black might as well press on.",
        "12. exd5 cxd5 13. Nxd5": "Even more stupid on Black's part.  White's control over the center is almost complete.",
        "13... Nc6 14. c3": "Black is trying to hold onto a little bit of the center.  White intends to press on to victory.",
        "14... e4 15. Ng5": "A good attack by Black, but White has spotted something.",
        "15... exd3 16. Ne6+": "Black has missed the triple fork.",
        "16... Kd7 17. Nxf8+": "Black moves badly to escape the check and is met with the loss of a rook and a double check.",
        "17... Kd6 18. Nxh7 Kxd5": "White will take another pawn.  He has the kingside completely at his mercy and can deal with the loss of a knight.",
        "19. Kd2": "The king must get involved, as Black's is almost halfway across the board.",
        "19... Ke4 20. Bf3+": "White will chase Black's king away.",
        "20... Kf4 21. Bxc6 bxc6 22. Rhe1": "White, after eliminating some of Black's tools, is now ready for the last attack.",
        "22... Bxc3+ 23. bxc3": "Why? Why? Why the useless sacrifice of his last minor piece?",
        "23... Rh8 24. Nf6 Rxh2": "No choice.",
        "25. Re4+": "Note how White has used the black pawn as a piece of protection and is able to attack instead of run away from Black's rook.",
        "25... Kf5 26. Ng4": "White will trade rooks.",
        "26... Rxg2 27. Ne3+": "Now he WILL.",
        "27... Kxe4 28. Nxg2 Kf3 29. Ne1+ Kxf2 30. Nxd3+": "Black's hope is gone.",
        "30... Kf3 31. Re1 a5 32. Ne5+ Kf2 33. Nxc6 a4 34. Nd4 a3 35. c4": "Now simply to queen and win easily.",
        "35... Kg3 36. c5 Kg4 37. c6 Kg5 38. c7 Kg4 39. c8=Q+ Kg5 40. Qf8 Kh4 41. Rg1 Kh3 42. Qh6#": "White was already winning when his king moved to the d2 square, but the use of the pawn as a shield allowed him an easier and more simple win."
    },
    "url": "https://gameknot.com/annotation.pl/the-pawn-as-a-maneuvering-tool?gm=42561",
    "gameName": "The pawn as a maneuvering tool",
    "players": "johnpbro (1177) vs. dayday052 (961)",
    "opening": "Bishop's opening (C23)"
}