{
    "moves": {
        "1. e4": "(This is Game 2 of the rematch series Kasparov was having against IBM's Deep[er] Blue. All six games took place in May 1997.) Here, Deep Blue opens with e4. Now, before I go any further, I'd again like to repeat that I am a mere inferior advanced player, purely interested in Grandmaster annotations to better myself in the long run. I plan on doing these alongside my blitz and standard annotations, but in these ones especially, I am looking to compare my own thoughts of the position to what others make of the position. I am not stating that my opinions are correct- these are masters, and they would crush me any day. :P",
        "1... e5": "Kasparov plays e5. I can't remember who said this, but apparently some spectators were surprised, as he usually is a fan of the Sicilian, but he had certain intentions for this day.",
        "2. Nf3": "Nf3. This is getting closer to the camp of what I'd play as a White player, planning...",
        "2... Nc6": "Black plays Nc6. Fearless as always.",
        "3. Bb5": "Bb5 - we enter the Ruy Lopez. This is one of my favorite White openings, heralded as one of the best openings to get to play with as the White pieces. It's well known for the early castling and has one of the best chances to develop early for attacking sooner.",
        "3... a6": "Black plays a6. Very common, and forces the bishop to move. White still has several options.",
        "4. Ba4": "More popular is the variation where White doesn't capture Nc6. If the knight is taken, Black suffers an early Queenside scatter, but at the cost of the typically stronger bishop for White to have.",
        "4... Nf6": "Also main line. This develops Black, and is a fast reminder to White that he's left the e4 pawn hanging for the time being.",
        "5. O-O": "But it doesn't usually stop White from castling anyway, because there's a certain gambit if Nxe4, starting with Re1. That would mark the beginning of the Tarrasch Defense, where the knight retreats to c5 (usually), and then White plays Bxc6, scattering the Black's queenside further, and making Rxe5+ a possible move. It turns into a very violent and open game, definitely not something I'd opt for as Black.",
        "5... Be7": "Normally, Black instead plays this, the Closed variation to the Ruy. For good reason- the general, overall wide consensus of the Chess community back in 1997 was that when it comes down to Open games, tactics (trading, targetting pieces) tends to be where a computer is stronger, as opposed to Closed games, where strategy (no contact unless needed, more about winning control of squares rather than pieces), tends to be where people would evaluate positions stronger than computers back then. Kasparov himself was famous for inventing this approach, and he was very confident at the time that it was going to work to his advantage. Unfortunately, it doesn't quite work that way for him.",
        "6. Re1": "White plays Re1 to guard the e4 pawn. Better than d3 (because White wants to play d4), and Nc3, the worst reply IMO, because of Black's next move...",
        "6... b5": "If Nc3 was played now, White would have too many pieces on this side of the board that this pawn could harass without issue.",
        "7. Bb3": "So the bishop retreats here, targetting f7. It's safe for now.",
        "7... d6": "This is known as the Leonhardt Variation on GameKnot. As Kasparov was hoping, this was a good choice for a convoluted opening, because I think he was playing the best overall moves as Black from here. It involves a lot of re-arranging of pieces, transforming into a difficult knot in the center for White to untangle... d6 offers more strength to e5 after White clearly wants d4, and opens the light bishop into the game.",
        "8. c3": "And for White, I also think Deep Blue was also choosing better moves. After d6, d4 now would be totally premature. c3 offers an additional defender to the d4 square, and gives c2 as a hiding place to the bishop in case of a5 or Na5.",
        "8... O-O": "Black castles now before delaying it starts getting in the way of his plans.",
        "9. h3": "Black instead could have played Bg4, an aggressive move to pin the knight. It's not an option anymore, but I'm sure that wasn't a concern to Kasparov.",
        "9... h6": "h6 - preventing Ng5 from White, who plans to trade the bishop-knight pair for Black's f7-rook. It would leave Black's king exposed on f7, but no real good way to attack it immediately with only the White Queen after the light bishop sacrifice. Still, this is a very passive response from Black, trying not to give Deep Blue any clear, fast entry into his domain.",
        "10. d4": "And then, White plays d4. Nothing much else to say, it gives White more space to do things, but Black is still very solid, no matter how you slice this. I don't think d3 would be any better- it was time to move this pawn.",
        "10... Re8": "Planning to defend e5 if White captures, no longer needing to worry about f7 falling after Ng5. Black could maybe entertain Bb7, to pressure e4, or perhaps Rb8, planning b4, but I think this is better.",
        "11. Nbd2": "Hmm... I can't remember if I've ever played this myself. White doesn't want this knight to stay here. He wants to move it to another square to continue guarding e4, eyeing Ng3. Be3 could be played at the expense of allowing Nxe4. White also had d5, but that simply is answered by Na5, chasing the bishop out. Or maybe even Na7 looks okay. I'm not sure of my analysis here.",
        "11... Bf8": "Meanwhile, Black has this wonderful square for the dark bishop. It's a bonus guard to g7, to his back rank, influences h6, and remains sights on c5-d6. Really the only drawback to playing this is it being harder to rush down White with f5 any time soon, but that's more of an endgame concern at this point- Kasparov plans to take his time with the computer here.",
        "12. Nf1": "The knight continues its journey to g3, and d4 is strengthened again.",
        "12... Bd7": "Hmm... I'm not sure about this move from Kasparov, though. If it was time for the bishop to move, then why not Bb7? Is it because he wants Be6 to remain playable for the long term part of this match? I'm not sure why he's comfortable with blocking the queen's influence on the d-file like this.",
        "13. Ng3": "The knight now lands on g3. Black no longer has any hope of attacking e4 any time soon, and White can return to further development to claiming more ground.",
        "13... Na5": "Kasparov notices this, and decides he needs to start pushing White back in order to gain ground of his own; this forces the bishop away, and frees his c-pawn for him to work out where it needs to go.",
        "14. Bc2": "So now White has two back-rank pairings, with the knights and bishops. This is ideal, and another reason why I love the Ruy as White. The games can get complicated, but for situations like this...?",
        "14... c5": "But for now, Kasparov gains space of his own with this, attempting to tempt White into capturing, and distorting the control of the center.",
        "15. b3": "Instead, White plays this, countering Black from playing ...c4. Still, I wonder- if White had just played d5 now, would allowing Black c4 cause too much of a disruption?",
        "15... Nc6": "Black wants the knight in a better home, having a certain idea in mind if White pushes again...",
        "16. d5": "And White grabs hold of d5, probably the most logical looking move at this point...",
        "16... Ne7": "And finally, the knight retreats here, as planned. Let's take a moment to evaluate the position. I suppose this answers me why Kasparov elected for Bd7 instead of Bb7... somewhat. Nf5 is looking a little scary at this point, and it's a bit harder for White to break in from that way for now. It also answers why Black played c5 instead of c6 as a counter to White's d5, because this knight wouldn't have been able to fall back to e7 as easily, and now d5 is being fought back reasonably. But still... Grandmaster behind the black pieces aside, I definitely think Deep Blue was winning this game at this point. White has a clear mobility advantage, and both pairings of the back pieces prevent Black from reaching out just the same as Black's arrangement prevents White from coming in any further for now. Yes, Kasparov has three quite scary looking queen pawns that could bother White a little, and the Black Queen and Rooks can aid in such an attack, but Kasparov cannot ignore White's mobility to continue defending or attacking. Given that White clearly has more options, I say so too is the advantage a little clear in White's favour at this point, in my honest opinion.",
        "17. Be3": "Be3 - I'm guessing White wanted to develop the bishop off of the back rank for the rooks. There's not really any good squares for this bishop to have right now, so I'd imagine Deep Blue thought that it was going to get in the way somehow. I wonder why it didn't consider Bb2, though?",
        "17... Ng6": "Though I guess that if Bb2 were going to be played, it would be seriously undermined by this move. Black copies White's knight pair, adding 2 more defenders to e5, making it more difficult for White to target it. Bb2 would be more to undermine an attempt to weaken the kingside defenses. Maybe this is why Be3 was better?",
        "18. Qd2": "And now, White plays this. It definitely looks like there's a plan with the A-rook now, because Bxh6 is out of the question entirely with a position looking like this. Either that, or White's planning to go ahead with f4 eventually, and have the Queen there ready to help aid such a pawn push.",
        "18... Nh7": "It looks like Kasparov thinks so too, so I'm guessing he's trying to hide the knight away, freeing his f-pawn and Queen to help aid in the kingside defenses. But surely he isn't planning ...f6, right? If f6, that knight is going to lose a lot more influence, and the Queen's ability to help in the kingside will be cut. So while I like this move, and I can't suggest any better ones... I also just have to wonder what he's thinking. Specifically, why Black isn't advancing more ground in the queenside? What's Kasparov waiting for before he does something that way?",
        "19. a4": "Okay. From this part on, I'm openly going to predict that my annotations aren't going to be exactly accurate for the rest of the match, and this move signals it- the board has gotten far too complex for a player of my level. This move is a very interesting one, as it gives White even more space to control, and it begins to contest Black's scary looking queenside, but at the same time, I would be concerned about if Black played bxa4 on his 19th. White would have bxa4, but then Black could then play Rb8. White's Queen is stuck on d2, and would have to waste a tempo in order to return back, but Black would always have a grip on the b-file. I would think that such an exchange could help Kasparov, wouldn't it?",
        "19... Nh4": "But no. Kasparov instead instigates a knight exchange. But quite honestly, I question if this is the best move Black has. That knight on g6 was a powerful one, and Black has more influence on the queenside, whereas White had more in the kingside. So the fact that this knight was helping undermine White, I don't think it's as valuable as White's Nf3! Further, it looks to me like White wants to play f4, so the Nf3 would have to move anyway, so the knight exchange would actually help accelerate White to play f4! I'm not sure how long it took Kasparov to come up with this move... but I really wonder why he went for it instead of something like bxa4.",
        "20. Nxh4": "It looks to me that Deep Blue agreed with my analysis, and accepts the knight trade. Interestingly enough, after twenty moves, this capture marks the first one of the match!",
        "20... Qxh4": "And now the Queen finishes the exchange. A bit soon, I think, for Black to play a bit wayward over here for my liking. The Queen is safe here for now, but isn't attacking anything of value at the end of this exchange. Back on d8, there seemed to have more options helping advance Black on the queenside.",
        "21. Qe2": "Deep Blue comes up with this. Now, this, I'm less sure why. I'm not certain if it was because e4 needed another defender, if White plans on c4, or something else. Could White play a5 instead, and Black responding with b4 be not that bad?",
        "21... Qd8": "As though she found a sale price before anyone else at the marketplace, Black's Queen rushes off back home as soon as she appeared. I'm more and more unsure if I appreciate 19 ...Nh4 at this point, because all I see is it giving White more of a tempo after that exchange. I'm back to thinking that maybe bxa4 back then was better.",
        "22. b4": "Deep Blue must have thought that the board wasn't complicated enough, and out comes this. I like it, but again, I think it gets awfully twisted once you start asking, what happens if Black accepts bxa4? Is Black's light bishop too powerful to trade off on a4? Or does White just not mind the thought of c4?",
        "22... Qc7": "Qc7. Planning c4, or cxb4? Moreover, would it have worked better before the knight trade?",
        "23. Rec1": "This at least helps against the cxb4 part. Obviously Rac1 wouldn't work, because it loses a pawn after ...bxa4 at this point.",
        "23... c4": "After Rec1, I agree with Kasparov that this is probably best for Black. c3's looking a bit weak for White, but I be inclined to argue that if White plays a5 here, Bb6 looks like a really good outpost for White's dark bishop! After all, I can't say it's not doing much better on e3, and Black would be forced to move the queen again. There seems to be more that Deep Blue saw to this position than just winning Bb6 as an outpost, but here is where I have to re-evaluate the position in White's favour again. I think after the knight trade, White was able to use enough time to pierce a hold into Black's stronger part of the board, and Black seems to be running out of more and more counterplay in the meantime.",
        "24. Ra3": "For example, Deep Blue thought it'd be a good idea to allow the rooks to be stacked down on the a-file, while defending c3 and making both axb5 as well as a5 to be powerful moves by White. If Black tries to respond with bxa4 right now, the rook stacking can still work after the bishop trade, and a6 is left hanging.",
        "24... Rec8": "Given the previous comment, now I'm wondering about this. I'm not sure what Kasparov saw, but I'd be afraid of White entering through the a-file at this point. At the very least- wouldn't Reb1 have been better, to help in some way in case axb5? Maybe Kasparov played with the idea of stranding c4 in his idea of the lines, but I'm not sure if this was better for Black.",
        "25. Rca1": "The rooks are stacked now. White's looking vicious and ready to open the board now. It seems that White's planning axb5 instead of a5 now- if axb5 from Black, then Rxa8 wins a rook for White, and Black cannot play bxa4 at all anymore, because once Bxa4, Black cannot avoid the bishop trade, and White will win the rook threat again.",
        "25... Qd8": "So, at least if White were to play axb5 right now, only a6 is won, because the queen will stop the rook from being dropped. Black is not good shape- this is the Queen's third time stuck on d8!",
        "26. f4": "And now, f4 is played! Yet another fascinating move from Deep Blue. Again, I'd be inclined to think that I would have liked to see the Queen on d2 for this. You know, just in case f4 needed another defender in case Black were to play exf4 here.",
        "26... Nf6": "Instead, Kasparov plays this... and I have to wonder why. Won't White want to exchange on e5, now that Ng6 and Re8 aren't there anymore? Wouldn't f6 be better? It might expose the king and weaken the light squares around Kg8, but if White's pawn is stuck on d5 because d6 blocks it from moving, I would think White's light bishop wouldn't be able to come in to threaten the king just yet.",
        "27. fxe5": "As expected, Deep Blue exchanges on e5. Now Black's Nf6 is being attacked.",
        "27... dxe5": "Pretty much forced. White now has a surpassed pawn on the d-file, and Black on the f-file. I think White's is clearly better, thanks to the guard on e4, and e5 is left miserably lonely...",
        "28. Qf1": "This sparks a move that has me wondering something. Deep Blue wasn't all that happy with the queen on e2? Neither was I, because e4 was pretty well defended as is. I've been saying for some time now that I think 21. Qe2 wasted some of White's time.",
        "28... Ne8": "Suddenly, Black's knight retreats here. Okay, probably because it wasn't attacking or defending anything on f6, so this all still makes some sense on Kasparov's part.",
        "29. Qf2": "But now Qf2. That's two wasted moves on White's part to the Queen! What was so useful about Qe2 in the first place, then? And why couldn't White have played Qf2 last turn? This Queen has been strengthening the dark bishop since the opening, so what was the knight doing on f6 that had this Queen hopping about when Qd2 -> Qf2 was a straight shot? Why such a detour? If White wasted any tempo this match, it was these two queen moves, and I'm sure Kasparov could have capitalized on this, if it weren't for the knight trade way back when... Those are just my thoughts.",
        "29... Nd6": "Now, IF White had not wasted those moves... then this would be too late. Kasparov knew that Nd6 now aids in the position. White had Rf1, and would have been able to play Qxf7+ by now. Instead, Black has enough time to retreat this knight, to not only defend f7, but also prevent White from gaining any ground by being able to advance on d6 at this point. If Kasparov had any chance of a draw, I think here is where it all begins to look hopeful to recover again.",
        "30. Bb6": "Now comes Bb6. Good, because such an outpost can now be made possible via the White Queen, instead of having to give up axb5. Again I'm thinking this is a consequence for Black due to not choosing Reb8 all that time ago, but I also think White could have made this move sooner as a consequence for all those queen moves. (And I realize I'm repeating myself, so I'm really hoping some of you higher players aren't yelling at me for my insolence right now... xD)",
        "30... Qe8": "Qe8 - excellent, another f7 defender, and well needed, at that. It also strengthens a possibility of playing bxa4, a combination I think Black may want to consider for now...",
        "31. Ra3a2": "R3a2. Interesting. Did Deep Blue see a line where the b4 pawn and Nd6 knight move, leaving the a3 rook under attack by Black's dark bishop?",
        "31... Be7": "Be7 - If Black was never going to entertain the idea of f6, I guess he's doing it now. But I wonder if Black has any better moves. f6 now, perhaps, or is Kasparov worried about White playing Nf5 in response to that?",
        "32. Bc5": "Sure enough, Deep Blue is tired of this game being so closed. Can't say I disagree- that bishop looks very secure on c5. If Black tries to move the knight away, then White just plays Bxe7, forcing Qxe7, and the Queen has to take another move to defend anything of value; it will do nothing on e7.",
        "32... Bf8": "Yeah, Kasparov. Perhaps you shouldn't have moved the bishop, and if Nb7, Kxf8 after Bxf8 wouldn't have been so bad. I think f6 should have been earlier, and you're going to be punished for that.",
        "33. Nf5": "Nf5 right now? I guess I don't see why not. Black is going to have to start giving away material either way. But with White threatening so much right now- axb5, or Bxd6, or maybe even Rf1, onto f7... I'm surprised that Deep Blue keeps confusing the matter with Kasparov. I'm really not that surprised that he was so exhausted mentally by this point. But could White do any better by acting on any of his threats right here instead of Nf5?",
        "33... Bxf5": "Why not Nxf5? With that bishop gone, White is able to get away with axb5 even more now... and again, I don't think the dark bishop is worth keeping anymore, and Kxf8 doesn't look like a terrible square for the King to end up on...?",
        "34. exf5": "Obvious- and that light bishop is looking scarier by the second.",
        "34... f6": "If Black doesn't play this right now, White will do it, and that would become problematic, because gxf6 would be forced. Doubled pawns and an exposed King are the last thing Kasparov needs right now.",
        "35. Bxd6": "Deep Blue is just being terribly unforgiving right now. It's not letting Kasparov have any say in this matter at all, and he even vocalizes being quite disturbed by the situation right here.",
        "35... Bxd6": "Poor Kasparov is getting forced move after forced move at this point.",
        "36. axb5": "And here marks the pinnacle of stress for Kasparov. It took him some time to figure out this move. He wants to play e4, but isn't sure if e4 is going to work (after exchanging) should White play Be4, and then of course, totally ignoring this exchange means he loses yet another pawn. How can he keep material in balance, and if he can't, how can he use a deliberately lost pawn to generate positional advantage? He starts focusing in on the move e4, and realizes that Black can pierce through into the center that way. What gets me is his reasoning after this...",
        "36... axb5": "The thing is, I don't know what took him so long to play this move! Just by looking earlier, there was no way Black could just jump into e4, because, he would be down more than just a pawn at that point. Now this is where things get controversial. REMINDER: Please DO NOT comment on the legitimacy of the game played. I don't think this is the place for it, and I care slightly more about the rationale behind the moves being made. Kasparov believed, for his own reasons, that Deep Blue would get materialistic, and play Qb6, eventually winning the b5 pawn. He had one major concern. Lo and behold, the concern was played.",
        "37. Be4": "Be4. With this move, Black is horribly confined and locked down into place. Kasparov keeps his b5 pawn (for now), but ultimately loses a lot of choices in play for the next while. The only open file Black can get into the game with, is the same file where White has two stacked rooks and a Queen ready to invade. Kasparov loses a lot of composure here, but there is still plenty to talk about from the moves that followed, and those moves following this highly controversial one (but frankly... I can only think are the two only obvious moves as White), are why I'm annotating this game. I want to see what can be made of the endgame for Black following this point and onward.",
        "37... Rxa2": "The rook on a8 has nothing better to do, besides sacrifice itself. White cannot be allowed to have three rook-equivalents pressuring on the a-file. I seriously doubt Rab8 is worth playing... White would have Ra7, pressuring g7.",
        "38. Qxa2": "Not Rxa2, as Qxa2 reaffirms White's absolute control of the only open file right now. Ra8 is also impossible for Black to play now.",
        "38... Qd7": "Qd7? I suppose a last ditch effort to preserve the queen's mobility strength instead of confining her to the back rank; it also adds pressure to White's next move... an obvious one.",
        "39. Qa7": "Qa7 - contesting the Black back ranks, and demanding that some action take place to help the Black Queen's lack of defenses.",
        "39... Rc7": "And I guess Rc7 will stop a Queen trade, but I wonder if leaving the back rank exposed is worth it? Is Qc7, planning Bxc7 after Qxc7, any better for Black? Qc7 is possible to stop White's next move...",
        "40. Qb6": "...which White can play now without much concern. This gives the White Queen a firm hold on the weak pawn, and allows the rook to enter the back ranks.",
        "40... Rb7": "An attempt to remove the White Queen without risking the Black one. Also prevents Ra7.",
        "41. Ra8+": "White targets the King before any further action, now that both attackers are here and secure.",
        "41... Kf7": "The Black King has to forfeit a tempo to White. But why not Kh7?",
        "42. Qa6": "White's Queen needs to get off the b-file, and I'm not sure if Qc6 right now is any better.",
        "42... Qc7": "Planning check.",
        "43. Qc6": "Now White seems fine with playing Qc6. If Black isn't careful, then Qe8#...",
        "43... Qb6+": "Throwing in the check, as planned, and stacking the rook and Queen on the weak b-pawn.",
        "44. Kf1": "Kf1 instead of Kh1. A move people have questioned before. There's yet another controversy on this move as well, as it seems to be that Black's Queen could have a perpetual on the White King that wouldn't otherwise exist if White had just played Kh1. This will come up again in a moment. Once again, I'm not interested in the comment of the computer's legitimacy- I'm concerning myself only with the draw outcome. Say if Kh1- is the draw completely averted right then and there?",
        "44... Rb8": "Rb8- to forever remove the immediate threat of checkmate on e8, and chasing the rook away.",
        "45. Ra6": "It instead comes here to help support the White Queen, as well as attack the Black Queen. Kasparov, at this point, had had it, and resigns in pure frustration. ---THE GAME ENDS HERE AND WHITE WINS---, but I'm going to continue a little bit longer to address a certain notation that was brought to Kasparov's attention in a restaurant after this game, and I'm wondering if our better players can help me see if this truly was an actual drawn outcome after this. The combination I hear that Kasparov apparently had- it confuses me...",
        "45... Qe3": "Apparently, as Kasparov was told, it all begins here. Had he kept going, and not resign the match, Qe3 is threatening a perpetual on the White King. Black deliberately throws away the dark bishop- a move everyone was sure the computer would take, but this would become a problem for White, they were theorizing...",
        "46. Qxd6": "So White is apparently forced to take this bishop here, in order to preserve any winning chances. A very wonderful attack on the Black King appears, but apparently, according to the Kasparov team, it was all going to happen only a move too late...",
        "46... Re8": "Here is my first question about the draw theory- Why is Re8 required? I can see Qd7 now being blockable, mate probably completely averted after this. What I don't see, is why doesn't the Black Queen now begin checking the White King, probably starting on Qc1? What is stopping the perpetual checks after Qxd6, that it's necessary for Black to delay them with this move? If Kasparov truly had a draw, I don't see why his team were recommending this move to him after the fact, because the black rook itself doesn't seem to stop anything over on White's side of the board where the King rests.",
        "47. Qd7+": "I preface this by admitting that it was a Youtuber going by the name of \"kingscrusher\", who hints that the first move to secure Deep Blue's win, would next play Qd7+, should Black try Re8. Apparently, the Queen landing on Qd7, will allow White to play Qc6 after Black blocks the check with Re7. So it goes, if Black tried Qc1 after 47 ...Re7, Qc6. Then White would be able to manage d6 eventually, attacking the rook, and forcing Mate in 11 after a perpetual ending with the King on d1, where Black plays Qxc3.",
        "47... Re7 48. Qc6": "So then... is it really true that White can be saved from the draw? Here is where I'll end the annotation- too many combinations derive from the perpetuals to try to recreate. Did Kasparov have a draw here, or is it theoretically possible for White to have stopped it? Thanks for reading the annotation, for tolerating my lower-level opinions, and I would love your feedback! :)"
    },
    "url": "https://gameknot.com/annotation.pl/the-grandmaster-files-case-1-draw-or-no-draw?gm=57687",
    "gameName": "The Grandmaster Files, Case 1 - Draw or No Draw?",
    "players": "Deep Blue  vs. Garry Kasparov ",
    "opening": "Ruy Lopez (C88), closed, Leonhardt variation"
}