{
    "moves": {
        "1. d4": "Some people have made a life purpose to prove that this is better than 1. e4 or vice-versa. Most notably Hans Berliner has stated that White is won here. Proving it is a whole other ballgame however.",
        "1... Nf6": "I like this over 1...d5 because it leads to much more unbalanced position and tbh, I find the Q's Gambit very boring.",
        "2. c4": "Seizing central squares. However, many defense systems for Black are aimed at exactly this square, including the Gruenfeld, the Nimzo-indian and the Benko gambit. Maybe one day a super computer will refrain from this pawn advance and play something slower like 2. Nf3. Until then, mere mortals like us, can only use accepted knowledge to make our decisions.",
        "2... g6": "Black wants to fianchetto his Bf8 and go for a quick castle. He's postponing the central struggle until he's better developed.",
        "3. Nc3": "With the aim of playing 4. e4. This move is another reason why 2. c4 was played first. Now the d5 square seems under strict control.",
        "3... d5": "But wait, what's this? Black was supposed to castle first then fight in the center. Well, that's the KID, you're talking about, this is his naughty brother, the Gruenfeld. I have to confess, I really like this opening. Playing it against someone that doesn't know much theory can lead to a very fast and crushing win. The downside is that there is a lot of theory and the resulting position vary a lot, so you can't rely on one line to play another, you have to know them all.",
        "4. cxd5": "White exchanges the c-pawn for the d-pawn and in the process creates for himself a central majority. But, just like in the Q's Gambit accepted, Black is looking to the future, hoping that the endgame will favor him due to the pawn majority on the Q-side.",
        "4... Nxd5": "I don't think it really has a name, but 4...c6 is a gambit that will surely take White players by surprise in a blitz game.",
        "5. e4": "White's wet dream becomes a reality. But like all dreams, fantasy is the only place where things are perfect, the reality makes sure that everything has a drawback.",
        "5... Nxc3": "Even though this bolsters White's center, retreating the Knight is very bad, since more pieces on the board mean more attacking chances and with the center in White's hands, it's clear who's going to be the attacker.",
        "6. bxc3": "Black's strategy seems to have failed. Just counting the moves, White has one extra tempo and on top of that, he has acquired a nice looking central phalanx, bolstered by the c-pawn. What was Black thinking?",
        "6... Bg7": "Older books claimed this is a mistake because now White could play 7. Ba3 to prevent c5. The problem with that move is that the Bishop isn't very active on a3 and Black will make c5 happen with 7...Nd7 anyway.",
        "7. Bc4": "The old main line. White is already envisioning a K-side attack. If Black would play passively, that would quickly become a dire reality, with Ne2, 0-0 and f4-f5, going for the throat.",
        "7... O-O": "Now that Black has completed development, it's time for the second strike at the center.",
        "8. Ne2": "White plays very tidy and rightly so. For example, the more natural 8. Nf3 can turn sour very fast after 8...c5 9. 0-0 Bg4 10. Be3 Nc6 and White can't hold the center anymore.",
        "8... c5": "If you want to play the Gruenfeld, there is a simple rule you always have to remember, it's always about White's d-pawn.",
        "9. O-O": "Hans Berliner had a different idea about this position, namely 9. Be3 Nc6 10. Rc1 cxd4 11. cxd4 Qa5+ 12. Kf1, which he regarded as won by White. It's strange though that no one has made it work so far.",
        "9... Nc6": "Putting the final screw on d4.",
        "10. Be3": "White has managed to hold the center and according to old principles should claim an edge in this position. Black must play very energetically to claim equality.",
        "10... Bg4": "The old move, nowadays 10...Qc7 and even Shirov's 10...Nd7 are played in this position.",
        "11. f3": "The point behind White's 8th.",
        "11... Na5": "A little counter-attack. It's also important to remember not to play cxd4 early as Black because without the c-pawns, White would happily play Rc1 and relinquish the Bishop pair in order to hold the center.",
        "12. Bxf7+": "The starting line of the Seville variation. White's idea is more than to win a pawn, which doesn't even count as a full pawn, what he's really after is a better endgame.",
        "12... Rxf7": "Not much to chose from here.",
        "13. fxg4": "Winning back the piece.",
        "13... Rxf1+": "Forcing White's King to misplace himself.",
        "14. Kxf1": "After 14. Qxf1, Black quickly regain the pawn with 14...Nc4",
        "14... cxd4": "This isn't forced, Kasparov himself has played Qd7 is this position, although with not much success.",
        "15. cxd4": "Keeping the central phalanx.",
        "15... e5": "This looks like a major concession by Black, giving White a passed d-pawn. Black's goal is to blockade that pawn and start pushing the Q-side pawns.",
        "16. Kg1": "16. d5 was objectively stronger, I guess White was worried about the exposed King.",
        "16... Nc4": "Activating the Knight. Remember that comment about White's second move?",
        "17. Qb3": "Pinning the Knight and attacking b7.",
        "17... b5": "Tactically defending both threats. 18. Qxb5 with the idea 18...Nxe3 19. Qb3+ Kh8 20. Qxe3 doesn't work because Black will win the d4 pawn.",
        "18. Rd1": "White keeps refraining from pushing d5 and I don't see a good reason behind it.",
        "18... a6": "Defending b5.",
        "19. Bf2": "Again, 19. d5 would have been better.",
        "19... exd4": "Now that White has lost a tempo with the Bishop, I can exchange in the center with less concern.",
        "20. Bxd4": "After 20. Nxd4 Qe8, White has problems defending the e-pawn.",
        "20... Bxd4+": "I don't mind the exchanged, as I see it, I have better prospects in the endgame, still.",
        "21. Rxd4": "Taking with the Knight might have been slightly better but in both cases, I can claim at least equality.",
        "21... Qb6": "Maybe not the most accurate move but sometimes tricks score more points than sound play.",
        "22. Kh1": "White plays his King again, hoping that now it's finally safe.",
        "22... Qf6": "The threat is Qf1+. Well, not really a threat, just enough to get White jumpy and propose a convenient exchange of Queens.",
        "23. Qf3": "Hoping to bolster the K-side pawns.",
        "23... Rf8": "Not on your life, buster. I'm going to keep my f-file.",
        "24. Qxf6 Rxf6": "Now is where White begins to drift. He still has the extra pawn, a passed e-pawn, all that he needs now is a plan of action.",
        "25. Kg1": "This King is really going back and forth. I think he's had too many and needs to sober up.",
        "25... Ne3": "Ouch! I'm going to get my pawn back and then can look hopefully to a brighter future.",
        "26. Ng3": "Defending f1.",
        "26... Rc6": "I'm not a greedy person, really I'm not. I just wanted to activate my pieces to the maximum before I take any material.",
        "27. h3": "White sees the opportunity to save the g-pawn and takes it.",
        "27... Rc2": "Another ouch for White. Now I win back not only my pawn but gain another for comfort. For some reason, White resigned here. I would have really loved he hadn't, I like playing endgames, especially those which I can win."
    },
    "url": "https://gameknot.com/annotation.pl/the-dangers-of-drifting?gm=29850",
    "gameName": "The dangers of drifting",
    "players": "rlcpw (1929) vs. nyctalop (2034)",
    "opening": "Gruenfeld (D87), exchange, Seville variation"
}