{
    "moves": {
        "1. e4 c5": "Hi, here a blitz game. I've got black and this is the Sicilian defense.",
        "2. Nf3 d6 3. Be2": "Not very enterprising. Most of the time d4 is played or Nc3.",
        "3... g6": "?! Nc6 is most of the time a must before doing the fianchietto. Now black is entering into a lot of complications.",
        "4. d4 Bg7": "?! cxd4 then Qxd4 lead to a lot of complications. I'm trying something different.",
        "5. dxc5 dxc5": "Qa5+ then Qxc5 could have been a solution to prevent the exchange of the queens. But I would have lost a lot of tempo.",
        "6. Qxd8+ Kxd8": "Now white have a big advantage but he has everything to prove. Without the queens, the game turns into slow maneuvers like some variations of the berlin defense in the ruy. In this position, white have some tempo and black must quickly defend his position. The threats will come fast. I don't think that this opening is any good for black finally.",
        "7. Nc3 Nc6 8. Ng5 Ke8": "Be6 could have been a solution but I didn't like my pawn structure at all after Nxe6 fxe6. It's already time to think about the endgame.",
        "9. Nd5 Be5 10. c3": "?! f4 would have been much better in my opinion.",
        "10... h6 11. Nf3 Bb8": "Bd6 was possible but I wanted to prevent to move my bishop again because of a further e5. My rook gonna be harder to develop but I don't care at this point of the game.",
        "12. O-O Nf6 13. Nxf6+ exf6": "Now the threat of Nc7+ is removed.",
        "14. Be3 Bd6": "b6 15.Bb5 Bb7 would have been probably a better solution.",
        "15. Nd2": "?! Rd1 was a better solution to keep the momentum.",
        "15... Be6 16. Rfd1 Kf8": "Ke7 could have been a solution but I thought that the king would be much safer at g7.",
        "17. Nc4 Be7 18. Nd6 b6": "Now my position is safe. White still have a small advantage.",
        "19. Nb5 Rc8": "Now my position is fine but white still have the advantage.",
        "20. f4 f5 21. e5 Kg7 22. a4 g5": "Time to counter attack.",
        "23. g3 g4 24. Nd6 Rc7 25. Bb5 Na5 26. Ne8+": "?! Not sure about this move.",
        "26... Rxe8 27. Bxe8 Nc4": "! Forcing the bishop to go to c1, white's attack is completely annihilated.",
        "28. Bc1 a6": "! I don't see a way to save the white bishop at this point.",
        "29. b3": "? I think white best chance was 29.a5 b5 30.Bxb5 axb5 31.a6",
        "29... Na5 30. b4 Nb3 31. Rb1 Kf8": "!",
        "32. bxc5 Bxc5+": "Now black have a great advantage.",
        "33. Kf1 Kxe8 34. Bb2 Bc4+ 35. Ke1": "Now the king is trapped.",
        "35... Ke7 36. Ba1 f6": "White left at this point. If 37.exf5 Kxf5 white have to sac his Rook to protect himself of Re7#. Even without taken it, black still have a big advantage. Like in the tale of the rabbit and the turtle, the rabbit have too much took things easy instead to go right to the goal. The turtle finally won slowly."
    },
    "url": "https://gameknot.com/annotation.pl/the-rabbit-and-the-turtle?gm=55640",
    "gameName": "The rabbit and the turtle",
    "players": "iamedgar  vs. drchopper ",
    "opening": "Sicilian (B50)"
}