{
    "moves": {
        "1. e4 e6 2. Nc3 d6": "  Foregoing the classic 2...d5 of the french defence for the confining 2....d6. ",
        "3. d4 Nf6 4. d5 exd5 5. Bg5": "  Hoping to pin the knight in.....",
        "5... Be7": " Breaking the pin",
        "6. Qe2": "  Developing my Queen while preparing to castle. Like most beginners I am prone to developing my queen too early.....",
        "6... Nbd7 7. exd5 Ne5": " Good move by my opponent setting up his Knight in a key central square.",
        "8. Nf3 Bg4": " At this point I was willing to trade Knights but as if reading my mind...... 8...Bg4!!",
        "9. h3 Bxf3 10. gxf3 Nxd5": " After ten moves my opponent is clearly ahead in terms of space and development, not to mention my doubled pawns!",
        "11. Bxe7 Nxe7": " Good combination allowing  Black to maintain the pawn advantage.",
        "12. Ne4 O-O 13. f4": "Improved my space greatly these last few moves....",
        "13... Ne5g6": " ",
        "14. O-O-O": " Mistake not playing 14.Qg4 to protect my f4 pawn. Black pounces.....",
        "14... Nxf4 15. Qf3": " Too little too late, but at least succeeding in driving the Knight away.",
        "15... Nfd5 16. Qh5": " First real attacking thrust of the match by either side....",
        "16... Nf4 17. Qh4 Ned5 18. Ng5": "  Once again a nice little combination by Black to gain space; White hoping Black will overlook the obvious 19.Qxh7#",
        "18... h6": " Yeah right.",
        "19. Nf3 Qxh4": " A good move trading a under developed piece for a developed piece.... I was disappointed at this point while Black was solidly gaining space while conservatively nursing his two pawn advantage.",
        "20. Nxh4 g5": " Allowed White to put his Knight on a good square while never really posing a threat.  ",
        "21. Nf5 Kh7": "   21....Kh7!? I would love a explanation for this move.... 22.Ne7+ easily defensible with 22.....Nxe7.",
        "22. h4 g4 23. Rxd5": " 23.Rxd5!? \"The sacrifice!\" Forcing the Knight on f4 to take me to start a decisive mating attack which could not have happened without 21...Kh7.",
        "23... Nxd5 24. Bd3": "Setting up a discovered attack.",
        "24... Kg6": " 24...Kg6?! Another puzzling move.",
        "25. Ne7+": "The end is draws near....",
        "25... Kh5": "The end draws near for Black. 25...Kg7 the better play.",
        "26. Nxd5": " ",
        "26... f5": "Desperation tactics do little. ",
        "27. Nf4#": "  The lesson I learned as a beginner is clear. One can play solid chess but must seize the advantage when one has one. Be aggressive; Chess is a mental game as well as a intellectual one. Thanks for reading and please give me tips to improve my game and my annotations."
    },
    "url": "https://gameknot.com/annotation.pl/the-sacrifice?gm=24292",
    "gameName": "\"The sacrifice!\"",
    "players": "shshlomo (1200) vs. voske (1068)",
    "opening": "French defence (C00)"
}