{
    "moves": {
        "1. d4": "I usually play 1.e4 because 2 pieces are released. But 1.d4 I play rarely because sometimes it can get boring but 1.d4 is what many grandmasters play. But it was worth a try!",
        "1... e6": "not very common against  1.d4.  I tried to get him into the French defence by doing.....",
        "2. e4": "This.  I was expecting  the French  ( 2. d5) the most common move,  but I was shocked to see.....",
        "2... d6": "2.d6?  this move deserves a question mark it really does, because it is a dull move,  far too  passive and both bishops are shut in.",
        "3. Be3": "getting out my Queenside pieces.",
        "3... Nf6": " !   Developing a piece with a threat  (4.Nxe4)  good move!",
        "4. Nc3": "! developing a piece too and at the same time covering the e4 pawn!",
        "4... c6": "?   Prevents the b8 knight from coming to c6.",
        "5. f4": "Getting my King-side attack rolling!",
        "5... Be7": "  Preparing to 0-0.",
        "6. Nf3": "?    Developing a piece but allows  6. Ng4",
        "6... O-O": "?  Yes, Yes, Yes  Dellerth had castled on the same side as my attack was  going to   take place. I think Dellerth  should have delayed castleing or maybe not to castle at all.\r\n   ",
        "7. Qd2": "    Getting ready to 0-0-0 and also to have the Queen and bishop lined up on \r\n    the diagonal. Not blocking my f1 bishop,  which was my very powerful weapon\r\n   later on!",
        "7... b5": "!    A very good move. That made me not wanting to 0-0-0 at any point. Dellerth was also threatning 8. b4  9. Ne2 and Nxe4  winning  a pawn\r\n     ",
        "8. e5": "!     Threatning to swap off.....",
        "8... dxe5": "  Like that!",
        "9. fxe5": "     So I could open up the Queen and bishop diagonal and an Ideal f- file for my \r\n     rook, but I did not use it.",
        "9... Nd5": "   The best place to retreat, also threatning  10. Bb4!",
        "10. Nxd5": "  I did not like the look of the pin (10.Bb4)",
        "10... Qxd5": "?    More solid would have been  exd5 also letting out the c8 bishop!",
        "11. Bd3": "!   Placeing my light squared bishop on the all important diagonal that eyes on \r\n      black's weak point ( h7) setting up the classic bishop sacrifice!!!",
        "11... a5": "?     no good as I was not thinking about castleing anywhere. Instead I \r\n      setting up the Classic bishop sacrifice. Hope lied  within something such as\r\n      11. Nd7 followed by 12. f5 for black.",
        "12. h4": "!!     The point of this move was when I did do the bishop sacrifice. Kxh7\r\n       Ng5 !! If black would take the knight with the bishop. pxh5  opens up the\r\n      h- file with a deadly attack which comes with mate!\r\n     But the sacrifice is not quite ready yet.\r\n ",
        "12... b4": "?         Black should have worred about his king here instead of doing stuff on  \r\n           the Queen-side that did not even bother me. It was not too late at this   \r\n            point to have tried 12. Nd7  followed by 13. f5.\r\n          ",
        "13. Qe2": "  Now after the bishop sacrifice and Ng5   the queen will have access to h5!",
        "13... Nd7": "??     TOO LATE!   13. f5 or 13. g6 where the only two moves.",
        "14. Bxh7+": "!!    Here comes the beautiful bishop sacrifice!",
        "14... Kxh7": "        A forced move......",
        "15. Ng5+": "    If   15.Bxg5  16. pxg5   Kg6   17. Qh5   Kf5   18. g4 checkmate   \r\n     If  16. Kh6  17. Nxe6    discovery check by the bishop  17. Kh7  18. Nxf8 \r\n     gives white a won game!",
        "15... Kg8": " ",
        "16. Qh5": " Threatning  17. Qh7  checkmate.",
        "16... Bxg5 17. hxg5": "  opens up h-file  and threatning  Qh7 or Qh8 checkmate!",
        "17... f6": "    The king tries to run away.....",
        "18. g6": "     But it does not work!   And now 19.Qh8  checkmate is unstopable!",
        "18... Nc5": "  Black's position is just hopeless.",
        "19. Qh8#": " Checkmate!   What a wonderful sacrifice and what a wonderful game. \r\n    I would like to thank  Dellerth  for the absolutly brilliant game we had!"
    },
    "url": "https://gameknot.com/annotation.pl/the-classic-bishop-sacrifice?gm=4606",
    "gameName": "The Classic Bishop Sacrifice",
    "players": "whizzkid111 (1554) vs. dellerth (1634)",
    "opening": "Queen's pawn (A40)"
}