{
    "moves": {
        "1. e4": "The title is there for a reason; after a dubious opening from White, a queen exchange leaves Black in a far better position, and eventually a rook up after some careless moves on White's behalf. Whilst most would have given up, White graciously fought back his material and remained a pawn down to the very end until Black himself made two costly careless errors at the end that cost him the win; White escapes with an entertaining draw.",
        "1... e5 2. Nf3 Nc6 3. Bc4 a6 4. d4 b5 5. d5 Nd4 6. Nxd4 exd4 7. Bxb5": "? Incredibly strange sacrifice. Normally 7. Be2 is the better continuation. White will be behind until the end of the match.",
        "7... axb5 8. Qxd4 Ra4 9. Qd3 Ba6 10. Qf3 Qf6 11. Qxf6": "Trying to take queens to get a better chance in the middlegame. 11. Qe3 is the better option here. ",
        "11... Nxf6": "Black missed his \"in-between\" move with 11...Rxe4+, winning a pawn and having a huge clamp on the center, before recapturing. ",
        "12. Nc3": "White misses to hold his pawns with 12. f3 which clamp down strongly. Then 12...Rc4 13. c3 Ra4 gives Black a small edge, but White avoids some danger.",
        "12... Bb4": "Trying to win the e4 pawn, but 12...Rc4! places the rook firmly in position as well as attacking White's weakened queenside.",
        "13. O-O": "White still misses 13. f3. Now Black takes control.",
        "13... Bxc3 14. bxc3 Rxe4 15. Be3 Nxd5 16. Rab1 Nxc3 17. Rb3 b4 18. a3 Bxf1 19. Kxf1": "Considering White is a whole rook down, most would have resigned by now, but the next few moves turn the tables dramatically. ",
        "19... Nd5 20. axb4 Nxb4 21. c3 Nc2": "Ruh Roh! The double whammy 21...Nc6! both protects the knight and the threat of Rb8+. Now White gets a rook back. ",
        "22. Rb8+ Ke7 23. Rxh8 Nxe3+ 24. fxe3 Rxe3": "White has now limited the damage to two pawns, but you would still think Black has enough resources to eventually win. ",
        "25. Rxh7 Rxc3": "A slight inaccuracy. There was no way White was going to defend that pawn, so 25...Kf6 stomps the counter-capture of g7. ",
        "26. Rxg7": "Now White has worked his way back from a rook and pawn down to a pawn. Incredible!",
        "26... c5 27. Ke2 d5 28. Rg4 f5 29. Rf4 Ke6 30. h4 Ke5 31. Rf1 d4 32. h5": "White hopes that the distraction of the h-pawn, combined with the protection of the h3 square nullifies Black's king. However, White's rook is tied down to that defense, and the rook and two pawns will eventually overpower the white king.",
        "32... Re3+ 33. Kd2": "After defending with utmost care, White intends on trying to hold the pawns down, but better was 33. Kf2, when White will still have counter play and better chances. ",
        "33... c4": "Probably better here was 33...Rg3. ",
        "34. h6 c3+ 35. Kc1 Kf6 36. h7": "With this move White throws away his chances. 36. Rh1 was probably better, but in the long run, Black should win in the end.",
        "36... Kg7 37. Rxf5 Kxh7": "Probably not best; pushing the pawns with 37...d3 easily give a clear-cut win. However, with sensible play, Black should still win.",
        "38. Rf2": "Another mistake. 38. Rc5 offers better hope, although Black should eventually win.",
        "38... d3 39. Rf1": "Another bad error; 39. Kd1 will hold out longer, but Black will eventually force a win with his passed pawns.",
        "39... c2": "Phenomenal, after concise attack, Black makes a crucial mistake; 39...Re2! wins eventually. ",
        "40. Kd2 Rg3 41. Rc1 Kg6 42. Rf1 Rxg2+": "And so Black gives up the remaining of his advantage. 42...Kg7 would keep a small advantage in the hope that White would blunder at some point. White will now draw.",
        "43. Kxd3 Kg5 44. Rc1 Kf4 45. Rxc2 Rxc2 46. Kxc2": "An amazing comeback! White draws at level material."
    },
    "url": "https://gameknot.com/annotation.pl/the-semi-amazing-comeback?gm=53864",
    "gameName": "The Semi-Amazing Comeback",
    "players": "moistcomrade (1488) vs. marthy_jason (1315)",
    "opening": "King's pawn game (C50)"
}