{
    "moves": {
        "1. e4": "The result is not a surprise, given the ELO difference among the players. Anyway, voicich does well enough during the opening, and...",
        "1... d5 2. exd5 Nf6": "I know this kind of opening is a surprise. The moves seem to be illogical, just bad. It is not entirely so. Black won't survive a very skilled player, but it's still playable at amateur level. ",
        "3. d4": "\"It can't be bad\". And it isn't. It's better than c4, that opens the way for nasty black tactics. ",
        "3... Qxd5": "This is not the wisest response, but I don't like Nxd4, c4 (with tempo). So I tried this to see where does it lead ",
        "4. Nc3 Qa5": "Bd2, c6, followed by Qc7. Quite a nice trip, but black is kind of solid. ",
        "5. Nf3": "Good choice, but better was d5! It seems to lose a tempo, but undermines black's plans (c6, dxc6!, followed by a terrible counterattack based on B/Nb4...). ",
        "5... c6": "Going on with the scheme. Nc6 is not wise in this position, since after d5 the knight's journey doesn't accomplish that much. ",
        "6. Bc4": "Not daring to go for d5 (and I can't blame him), white develops with attack. But I'm not worried, since I know this kind of attack very well. ",
        "6... Ne4": "The normal choice was Bf4, followed by e3. But I wanted to cash something. If Ne5, black wins the following exchanges.",
        "7. Bd2": "It's always nice to see that the white's dsb can be exchanged...",
        "7... Qb4": "Threatening the bishop and b2 in return, just playing with fire. ",
        "8. Nxe4 Qxc4": "White accepts the exchange, and true is that I am far behind in developement, and my opponent has an edge right now. But... how to capitalize on it?",
        "9. b3 Qd5": "This is a slippery queen...",
        "10. Nc3": "Better was c4, IMO.",
        "10... Qh5": "...ready to Bg4.",
        "11. Ne5": "Well, I can't see anything better at this point (Qh4, Be3), so...",
        "11... Qxd1+ 12. Nxd1": "Overcaring for his castling, but comprehensible... Now, look: white is VERY far ahead in developement. I'm smashed! How can it be? And what can I do?",
        "12... f6": "Keep him busy. No queen or bishop to press the white diagonal...",
        "13. Nd3 g5": "Just taking space. My pieces won't be so effective without a solid pawn structure contrsting his quick taking control of the board. ",
        "14. Nd1b2": "Better was Ne3. I can guess white wanted to keep the e semicolumn open, in sight of its weakness, and I can't say it's wrong. But this just slowens white's developement. The white knight can go to c4, true, but this is a better place for the pawn. ",
        "14... Na6": "Odd developement, for quickness, not obstaculizing the lsb, and protecting b4. ",
        "15. O-O-O": "(saved but unprocessed lines)\n15.\te1-c1\tc8-f5\n16.\tc2-c4\te7-e6\n17.\tc4-c5\te8-c8\n18.\th2-h4\tg5-g4\n19.\th4-h5\td8-d4\n20.\td2-c3\tf8-c5\n21.\tc3-d4\tc5-d4\n22.\td3-f4\t",
        "15... Bf5 16. Na4": "White makes a strategic mistake, or either he just wants to offer me to lose the bishop pair for a doubled pawn. Interesting...\n\n(saved but unprocessed lines)\n\n16.\tb2-a4\te7-e6\n17.\tb3-b4\tf5-d3\n18.\tc2-d3\tf8-b4\n19.\td2-b4\ta6-b4\n20.\ta4-c5\te8-f7\n21.\th1-e1\th8-e8\n22.\tc5-b7\tf7-e7\n23.\tb7-c5\te7-d6\n24.\ta2-a3\tb4-d5",
        "16... e6": "I don't fall for it... yet. I love my bishop pair, look at it. From f8, my \"undeveloped\" bishop is powerful. I exploited the b3 move by white. Of course, I calculated what happens after Re1. ",
        "17. f3": "Just a tempo. White should press on the e column as fast as possible anyway... IMO. ",
        "17... Ba3+": "Such a developement well deserves to wait until the 17th move!",
        "18. Kb1": "Now wanting to pin a knight. ",
        "18... Rc8": "Foreseeing c5 as a disruptive move. ",
        "19. Ndc5": "White avoids me... the temptation to exchange the bishop (I was almost prepared to consider it in sight of c5), but blocks my pawn's advance. Good...",
        "19... b5": "...let's interpose a nasty move.",
        "20. Nc3": "Now black wins a pawn. ",
        "20... Nxc5 21. dxc5 Bxc5": "...and the bishop pair is magnificent. Chess is cruel: even such a great edge can be reverted if you not take advantage of it inmediately and aggressively.",
        "22. g4 Bg6": "It's ok.",
        "23. h4": "Good try by white. ",
        "23... gxh4 24. Rxh4 f5": "I choosed this way to manage white's attack: slippering it. Now, if g5, I have plenty of moves to play with, and if gxf, Bxf just improves my position. ",
        "25. Bf4": "A good move. ",
        "25... fxg4": "Opening the way for my bishop. ",
        "26. fxg4 O-O": "!? Just under the fire. But I am so well placed...",
        "27. Be5": "This seems to be a good move, but in fact it is the losing one. f2 must be covered at all costs, since it is clear that white doesn't have the tempo to play Kb2 to guard a3 from the black's dsb. The problem is that from there the bishop blocks the only place for the rook to defend c2. White can't afford to lose a second pawn without a sound compensation. After 27. Bg3, black has Rf3, and white is forced to 28. Rd3. Black misses a tempo to play Ba3 and seriously threat mate. It was dangerous, but it was the only choice for white. ",
        "27... Rf2": "This is deadly, since c2 can't be defended.",
        "28. Rh2": "It was calculated, very well!",
        "28... Rcf8": "I can play at the same game, unfortunately. ",
        "29. Rc1": "The key of the position is that the white's dsb is not covering any vital square, given the solid protection of the white squares. It's wonderful position is useless. The only white's possibility is to exchange his knight with the lsb, but this is very difficult to achieve. ",
        "29... Ba3": "Trapping the king, and winning c2. ",
        "30. Rxf2 Rxf2 31. Ka1": "Desperation. Anyway, white's position is unholdable. After the rook retires, c2 falls, and white has no perspectives. The same principle was applied: try to get the maximum as soon as possible from any edge. In very few moves, the game has turned from a long endgame into a losing position. I hope to have been accurate (but I can be wrong), and to help some player with some hints about the game. Thank you for reading. ",
        "31... Bxc1 32. Bd4 Rxc2 33. b4 Bb2+ 34. Kb1 Rd2+ 35. Ne4 Bxe4#": ""
    },
    "url": "https://gameknot.com/annotation.pl/the-slippery-queen?gm=52924",
    "gameName": "The slippery Queen...",
    "players": "vocihc (1452) vs. damalfi (1797)",
    "opening": "Scandinavian defence (B01)"
}