{
    "moves": {
        "1. d4 Nf6": "It's been a while since I've annotated a game; this is the first game I have finished in nearly two weeks. Tired of the old d5, I play something a little different. The Indian Defense.",
        "2. e3 g6": "2. e6 indicates that white might want to set up a Stonewall Attack. So I begin choosing moves that don't bang my head against that stone wall.",
        "3. Bd3 Bg7 4. f4 O-O": "More Stonewallish moves from White.",
        "5. Nf3 c5": "I'm offering white an opportunity to break up his own Stonewall with 6. pxc5 Qa5  and 7. ... Qxc5 and now his stone wall has a big hole in it.",
        "6. c3 d6": "White wasn't having it - he completes the \"classic\" Stonewall formation.",
        "7. O-O Nc6 8. Nbd2 Bg4": "Pinning the knight, thinking along lines of Qc7 and e5.",
        "9. Qe1 cxd4 10. exd4 Nd5": "Aha! The stones crumble! And now I threaten more of the wall.",
        "11. Nb3 Qc7": "White saved what's left of his stones, so now I get back on my e5 plan.",
        "12. Qg3 Bd7 13. a4 e5": "I'm not sure what 13. a4 was doing but it seems harmless enough, and now I can't help but notice that the knight on b3 is undefended. Unfortunately, I don't see a convenient way to remove the pawn on c3.",
        "14. fxe5 dxe5": "Exchanges abound.",
        "15. Nxe5 Nxe5 16. dxe5 Bxe5": "Not much left of that wall now.",
        "17. Qh4 Qb6+": "White's 17. Qh4 and that c3 pawn takes all the fun out of the fork.",
        "18. Nd4 Nb4": "If 19. Pxb4 then 19. ... Bxd4  and 20. ... Qxb4 and black has gained a pawn. Meanwhile, I threaten the undefended bishop at d3 and a nice little fork at c2 (puts three pieces on White's pinned knight on d4).",
        "19. Be4 Nc6": "White's 19. Be4 put the kabosh on all of my knight's threats, so I play a simple move, attacking the knight on d4. In retrospect, I think now that 19. ... Bxd4  might have been more aggressive, and would have won a pawn as well as creating opportunities to liquidate some pieces to exploit that material advantage.",
        "20. Bxc6 Bxc6": "Black has gained the bishop pair advantage, though that's hardly decisive.",
        "21. Kh1 Qa6": "White unpinned the knight on d4 and black seizes an opportunity to fork the rook on f1 and the pawn on a4. Note that I don't plan on playing Bxa4 any time soon since that bishop would be pinned and easily won by white with b3.",
        "22. Bh6 Rfe8": "22. Bh6 was a strong move by white. He linked his rooks, defending the en prise rook on f1 and at the same time threatens to win the exchange by capturing Black's rook on f8. I didn't really see this coming, and it became a thorn in my side for a several moves - but I vow that eventually white will pay the price for stationing his bishop so far from home.",
        "23. Nxc6 Qxc6": "Well, there goes the bishop pair, and now things look pretty much dead even. I don't know if white is playing for a draw, but I certainly would not be satisfied with drawing.",
        "24. Qf2 Qe6": "White threatened the pawn at f7 with certain mate to follow. Black's queen rushes to the defense.",
        "25. Rae1 f6": "White played as expected, pinning Black's bishop on e5. f6 saves the bishop from any future embarrassment and at the same time, the bishop protects the pawn, too.",
        "26. a5 Qa6": "White has a strong attack going, 4 pieces bearing down on a broken castle with only 3 defenders. I was surprised he played 26. a5. My response threatens the pawn. I have to play carefully here though, with White's strong attack.",
        "27. b4 Bxc3": "White seems to have made his first mistake of the game. Black can safely take the pawn, forking White's rook on e1 and the pawn on b4. It's important here that both the bishop and the queen remain on defensive duty to save the f6 pawn and the subsequent mate threats.",
        "28. Rxe8+ Rxe8": "A welcome trade since black now has a winning material advantage. This also evened the number of attackers and defenders by exchanging white's strong rook, part of his attack, for black's weak rook that was far removed from defending.",
        "29. Qf4 Bxb4": "White's 29. Qf4 seems to defend the pawn at b4, but the defense is an illusion, for black takes the pawn anyway and now if 30. Qxb4??? then black wins instantly with 30. ... Qxf1  . 29. ... Bxb4 does allow white to play 30. Qxf6, but black's queen is still on defense so after 30. ... Qxf6 31. Rxf6??? Rf1  wins immediately for black.",
        "30. h3 Bd2": "And now my piece de resistance. My favorite move of the game. If White's queen moves away, black wins the bishop on h6. If white captures Black's bishop he loses less material after 31. ... Qxf1 . ",
        "31. Qf2 Bxh6": "Remember that vow I made on my 22nd move?",
        "32. Qa2+ Kg7": "The long range check is only a minor inconvenience now that the white bishop is gone from a6, and White's rook is still en prise on f1.",
        "33. Rf2 Re1+": "Rf2 insures that White's two remaining pieces defend each other and defend their remaining pawns, too. But black has a combination that cracks White's defense open like an egg. With careful play, white can squirm out of immediate loss (at least I didn't find a forced mating combination here) but even those lines allow black to exchange White's queen and rook and win easily with a bishop and two pawns advantage.",
        "34. Kh2 Be3 35. Rc2 Bf4+": "35. Rf3 saves White's game for now, but after 35. Bg2  white is in serious trouble. As played, white is now doomed.",
        "36. g3 Qf1": "Not a check, white is not forced. But he has nothing. Black threatens mate on g1 and h1. The rook cannot protect both squares. 37. h4 loses to 37. ...Qh1  . White could try 37. Rc7  Bxc7 38. Qg2 to stop all the immediate checkmates, but 38. ... Re2 wins White's queen and black mates in a few moves with his bishop and queen.",
        "37. gxf4 Qg1#": "Final position."
    },
    "url": "https://gameknot.com/annotation.pl/the-stones-crumble?gm=21362",
    "gameName": "The Stones Crumble",
    "players": "djcp99 (1181) vs. blake84120 (1504)",
    "opening": "Queen's pawn game (A45)"
}