{
    "moves": {
        "1. e4": "Normal.",
        "1... c5 2. Nf3 d6": "Sooner or later, black needs to play g6, 'cos his DSB is blocked.",
        "3. d4": "d3 is usally a better move",
        "3... cxd4 4. Nxd4 Nf6 5. Nc3": "In this position, White's two knights prove very strong, especially the d4-knight controlling the centre. Black should play e5 sending back the knight and developing his DSB. ",
        "5... g6": "Very popular move after the Silican defence, as I explained.",
        "6. Bg5": "White's move is one that I have not encountered previously. That is because he is following a diffrent plan this time: he intends to castle Queen side. He therfore mobilizes his Queen-side forces more rapidly than he would ordinarily, when contemplating King-side castling.",
        "6... Bg7 7. Qd2": "Supporting the bishop and preparing for Queenside castling (O-O-O)",
        "7... Nc6 8. O-O-O": "Exactly what I meant, queenside, (smart, eh?).",
        "8... O-O": "We have now reached a point where we can fruitfully inquire into the logic behind White's Queen-side castling. As we have seen earlier, the possibility of Pawn captures and recaptures is a very important factor in planning the course of a game. These captures and recaptures result in  line-opening. And this line-opening in turn creates highways for the movements of our forces in an aggressive mood. In this case, White's basic tactical idea is to play h4, followed by h5, then PXP, taking advantage of the fact that Black's King pawn is at g6. Once white has playe h5, he is certain of opening the h-file, and having Black's address he will muster his heavy artukkery ib the newly-opened King Rook file to operate agianst Black's King.",
        "9. Nb3": "This is the usual move made by White to avoid any tactical tricks due to the fact that White's knight at d4 was directly attacked by Black's Knight at c6 and indirectly attacked by the \"Dragon Bishop\" at g7.",
        "9... Be6": "And here is such an inexact move. Black should first play Re8!! so that he can answer 10. Bh6 with 10....Bh8!!! retaining the Dragon Bishop without any collisions",
        "10. Kb1": "But White is inexact too. Expoliting Black's last move, he should play 10....Bh6!!!! forcing the removal of Black's precious Dragon Bishop (Obviously, 10......Bh8? is answered by 11.BxR winning the exchange) The text has its points though. By playing Kb1, the white king protects the a2 pawn with another piece.",
        "10... Rc8": "Again Black is wrong. Intent on prosecuting his counterattack, he neglects to preserve his Dragon Bishop by playing Re8. ",
        "11. f3": "Preparing to begin the Pawn-stroming attack with g4 followed by h4 and h5. But again White has negelected to remove the Dragon Bishop by Bh6.",
        "11... Re8": "!! Now Black is certain of being able to retain the Dragon Bishop as 12.Bh6 is answered by 12......Bh8 With the vital point established once for all, Black's counterattack can flourish",
        "12. g4 Ne5": "! Preparing for the powerful infiltration.....Nc4; as we know, occupying the aggresive outpost is one of the key features if Black's policy.",
        "13. Be2": "Now, it has become clear that Black's threats are maturing more rapidily than White's. Yes, what use is this move? Where's h4? If White has not begun to play h4, then what use is g4? Well, we'll see as the game gets on. Anyhow, Black can now play 13....Nc4, but instead he hints in a much more effective move.....",
        "13... Nfd7": "...Nfd7!! His idea is to play Nb6, after which he is certain of keeping a knight on c4 no matter how White proceeds. This is bound to be disatouras for White. Another useful point is that the Dragon Bishop is pointing directly for action against White's king!",
        "14. Bh6": "Too Late! The Dragon Bishop can now reatreat to two squares (h8 or f6, and not f8!)",
        "14... Bh8": "Now that Black's Rook is at e8, he can simpily avoid the exchange of Bishops.",
        "15. h4": "Another little case of \"too little and too late\". Black simply continues with his own attack. (We no longer call it counterattack as it is obvouis that it is Black which is the real aggresor)",
        "15... Nb6": "Going ahead with the knight plan (as I explained about).",
        "16. h5 Nec4 17. Bxc4": "Not very bad, or good. Why?",
        "17... Nxc4 18. Qh2": "White seems almost on the pont of reaching his objective. His Queen and Rook are on the h-file, which is about to open after PxP. But meanwhile, Black has placed his forces in menacing postions and even at this stage he can shatter his opponet's postion with......Well, can you guess?",
        "18... g5": "!!!!! Beautiful play! Black has paused in his attacking maneuvers to sacrifice in order to avoid the opening of the a-file. (note that hxg6 e.p is not possible).",
        "19. Bxg5": "Even though Black's kingside is a little weak, his pieces are working to form action. White cannot attack with only one Bishop, and now Black has a outstanding move (could you guess what it was on move 17?)",
        "19... Nxb2": "Nxb2 is the answer!!!!!!!! Smashing up white's castled postion. The carefully prepared attack now bursts upon White's king with murderous force!",
        "20. Kxb2 Rxc3": "! Even stronger is BxN+, for by threatening a fearsome double check-RxN+. Black gains time for increasing pressure on the c-file.",
        "21. Kb1 Qc7": "!! Black does not bother with the gain of a Pawn (21....Rxf3) as he wants to win in the quickest manner.",
        "22. Bc1": "Helping in hand, but squeezing up the king's squares!",
        "22... a5": "White's protcetive knight at b3 must be removed!",
        "23. Qd2": "23. Bb2 does not help, as Black imperturbably strengths the grip on the postion with 23...Rc8 (Rec8) and if BxR, QxB, threatening mate. Then, white might have a very hopeless game, indeed.",
        "23... a4": "Chasing the protective but poor knight away. Sorry, Knight.",
        "24. Nd4": "White thinks he has closed the terrible long diagonal, but he is immediately undecived! The powerful Black bishops are just too much for him!",
        "24... Bxa2+": "Another wealthy sacrifice! ",
        "25. Kxa2": "Exposing White's king out into the danger.",
        "25... Qc4+": "Murderous Queen in the game. Bad for White!",
        "26. Ka1": "(Now, Black is squeezing White's king into the corner) After 26 Kb1 Black works out pretty much the same kind of finish with 26......a3 intending 27.......a2+. 26....Kb2 simply loses time (26....a3+)",
        "26... Rxc2": "Taking advantage that the knight on d3 is pinned! Also, have you noticed that the White King and the Dragon Bishop are on the same diagonal?",
        "27. Qg5+": "If Bg7, white might play Qxg7+ or leave the DRAGON BISHOP PINNED! ",
        "27... Kf8 28. Bb2": "Closing up the diagonal and protecting the knight.",
        "28... Rxb2": "!! But why is this sacrifice needed? (Find it out later in this annotation)",
        "29. Kxb2 Rc8": "Black chief threat is now 30.....Qb3+; 31.Ka1, Rc2!. Note that white's knight, being pinned by the Dragon Bishop, cannot capture either queen or rook, and is helpless in the game.",
        "30. Qe3": "Or 30 Qd2, Qb3+, 31 Ka1, Rc2 winning the queen (and a piece, what is it?).",
        "30... Qb4+": "Still an outstanding check, even though the White queen is preventing the queen check on b3.",
        "31. Ka1": "? Better was Ka2.",
        "31... Rc2": "!! Threatening mate on b2!!",
        "32. Rdb1": "This is one of the ways to stop mate, but has its own faults.",
        "32... Bxd4+": "Bxd4+!!! Now White is forced to capture, as 33. Rb2 fails to 33.Qxb2* checkmate with a fascinating ending of a game. ",
        "33. Qxd4": "Now White's game is hopeless as after 33....Qxd4+, white's king cannot move. 34. Rb2 also fails to 34....Qxb2* checkmate.",
        "33... Qxd4+": "Yes, and if Black sees, its mate in one.",
        "34. Rb2": "Well, we are near the end, so.... This tournament was played in High Barnet, White (Clareus) vs. Black ( G. Lynn). The maximum was 35 moves, and Black wins in 34 moves. Lynn won with glee, of course. Now let's get on to the next and final moves and see this marvellous game come to an end.",
        "34... Qxb2#": "!! Thank you for reading my annotation.\nI hope you enjoyed it.\nPlease add any extra comments and rate this annotation.\nTHANK YOU\n@oodle"
    },
    "url": "https://gameknot.com/annotation.pl/the-dragon-variation-1?gm=44083",
    "gameName": "The Dragon Variation (1)",
    "players": "B. Clareus  vs. A. G. Lynn ",
    "opening": "Sicilian (B70), dragon variation"
}