{
    "moves": {
        "1. e4": "Hi everyone!\n\nHere is another game in GM Cyrano's MT where I have been playing against the big boys, this time a Master with a rating close to IM level.  I end up in a position where I have a rook against 2 pieces.  Boy those two pieces proved to be much more lethal than a rook.  In fact, all black's remaining pieces swarmed around Henry who, sadly, got stung and suffered an anaphylactic shock.  So how did this happen.  Well before I start, here is the gameknot analysis: http://gameknot.com/analyze-board.pl?bd=17836549&rnd=0.9027691620956812",
        "1... e6": "1. .... e6 - this is the French Defense.  At first sight it appears cramping but this can cause the white player to overplay his or her hand later on.",
        "2. d4 d5 3. exd5 exd5": "3. ..... exd5 - exchange variation.",
        "4. Nf3 Bd6 5. c4 Nf6 6. Nc3": "6. Nc3 - both sides concentrate on piece development.",
        "6... O-O 7. cxd5 h6 8. Be2 Nbd7 9. O-O": "9. 0-0 - and Henry tucks himself away on the kingside.  Alas, this will be where Henry will meet his doom later on.",
        "9... Nb6 10. Bd3 Nbxd5": "10. ..... Nbxd5 - this pawn could not be sustained.  Things are gonna start hotting up over the next few moves.",
        "11. Ne5 c5 12. Nxd5 Nxd5": "12. ...... Nxd5 - knight trade.",
        "13. Qf3": "13. Qf3 - hitting out at the knight on d5 and Glenda is also fixing her beady eye on f7.",
        "13... Nb4 14. Bc4": "14. Bc4 - pin and another piece attacks f7.",
        "14... Qc7 15. Bxf7+ Rxf7 16. Nxf7 Qxf7 17. Qxf7+ Kxf7": "17. ...... Kxf7 - so, after a tactical melee over the last few moves we have a position of R and P v 2 pieces.  My position does not look too bad at the mo - but ..... a few moves down the line .....",
        "18. dxc5 Bxc5 19. Bd2 Nd3 20. Bc3 Bg4": "20. ...... Bg4 ..... it will.  The swarm now begins.",
        "21. a3": "21. a3? - Gameknot Analysis thought that b4 was better, giving up a pawn but freeing myself from the bind I am currently in.",
        "21... Be2 22. Rfb1 Bxf2+ 23. Kh1 g5 24. b4": "24. b4 - three moves too late.",
        "24... Be3 25. h3 g4 26. hxg4 Rg8": "26. .... Rg8 - now comes the black rook.",
        "27. Ra2 Rxg4 28. Kh2 Rh4+": "28. ..... Rh4+ - deadly, Henry has only one square to go.",
        "29. Kg3 Bf2#": "29. ..... Bf2 MATE!! - Henry is fatally stung by black's dsb on f2.  This is awesome, guys!"
    },
    "url": "https://gameknot.com/annotation.pl/the-swarm?gm=46087",
    "gameName": "The Swarm!",
    "players": "jstevens1 (1928) vs. kikoursus (2394)",
    "opening": "French (C01), exchange, Svenonius variation"
}