{
    "moves": {
        "1. e4": "I won't insist on the opening so much, since it isn't modern practice anymore, but remembering the setup that White uses might prove useful someday.",
        "1... d5": "The Scandinavian Defense.",
        "2. exd5 Nf6": "The modern handling of the defense, inviting White to try and keep the pawn, after which Black can get good compensation.",
        "3. Nc3": "More reserved, White carries on with his development.",
        "3... Nxd5 4. Bc4 Nb6 5. Bb3 Nc6 6. Nf3 e5 7. d3 Bg4 8. h3": "Had Black known what was going to happen next, he would have undoubtedly exchange here.",
        "8... Bh5": "Everything looks peaceful, doesn't it? Black is two moves away from castling, White one, Black has a little more space, White is slightly better developed.",
        "9. Nxe5": "And here it comes. Since this was a correspondence game, White must have calculated the long forced sequence before making this move. But that doesn't make it any less impressive. White is sacing the Queen just to drag out the Black King to the middle of the board. There isn't a direct, forced mate but White knows that Black would have to relinquish a great deal of material to save his King.",
        "9... Bxd1": "Not capturing the Queen would have been better but how can you resist the adventure? Objectively speaking even after 9...Nxe5 10. Qxh5 White has a very good position. But now we are in for a treat.",
        "10. Bxf7+ Ke7 11. Bg5+ Kd6": "What now? Capturing the Queen with 12. Bxd8 would give up the attack and White would find himself a piece down.",
        "12. Ne4+": "Giving up more material to make sure there is no retreat for the Black King. This had to been seen beforehand or else the Queen sacrifice wouldn't have worked.",
        "12... Kxe5 13. f4+ Kd4 14. Rxd1": "Black gets a breather now but White is still threatening mate with Ke2 and c3. The best way to remove this threat would have been giving back back the Queen with 14...Qxg5 but after 15. c3+ Ke3 16. fxg5 followed by 17. 0-0, the Black King still doesn't make it home safe and sound.",
        "14... Ke3": "A bold decision to prevent Ke2.",
        "15. O-O": "Now there is no save from mate.",
        "15... Nd4": "Not the best defense but even at the most stubborn defense, 15...Bb4, White still manages to mate. Black's idea is to exchange this Knight for a Rook in hopes that the reduced material won't be enough for mate. He guessed wrong.",
        "16. Rde1+": "16. Rfe1+ is one move quicker but a little more dry.",
        "16... Ne2+ 17. Rxe2+": "No pause for the Black King.",
        "17... Kxe2 18. Bh5+": "A nice retreat.",
        "18... Ke3 19. Rf3+ Kd4": "It seems the King is on his way back to safety and Black is a lot of material up.",
        "20. Bf7": "This move cuts of the path and Black is unable to stave of mate anymore.",
        "20... Nd5 21. c3+ Nxc3 22. bxc3#": "A nice picture. Black's Queen has been en-prise for 11 moves but White had a bigger prey to catch."
    },
    "url": "https://gameknot.com/annotation.pl/the-thrill-of-the-hunt?gm=30392",
    "gameName": "The thrill of the hunt",
    "players": "Imbaud (?) vs. Strumilo (?)",
    "opening": "Scandinavian defence (B01)"
}