{
    "moves": {
        "1. e4 d5 2. exd5 Nf6 3. Nf3": "One of the many other choices from white. All have their good and downsides. This one is \"just mainline\" for the Icelandic. ",
        "3... e6 4. dxe6 Bxe6": "Don't do this at home. Just for fun. Black has a slight advance in developement, but no central pawns, and his progress will be delicate and full of dangers. ",
        "5. Nc3": "Still uncompromising the center with d4, in the believing that \"this was just what I expected him to do\". Like \"wait and see\". But not \"really\" bad. But think: the move involves the decision to let c2 where it is, and this doesn't help white to make black feel painfully his central power with d4 and c4. ",
        "5... Qe7": "This is thematic, and white is not really in any dangers, but it makes white play \"at my pace\". In this scheme, I plan to develop the dsb through fianchetto, in closed lines, or I accept to lose a tempo later relocating my queen. I won't win the fight for the e column, that will be left to white. ",
        "6. a4": "A total loss of tempo, since I have no piece to put on b5. Of course, white here decides not to worry about the discovered check, and he was right. But why not d3 instead? Or Bb5+ at once, leaving the bishop the possibility to relocate on b3, undermining black's crucial point e6. ",
        "6... Bc4+": "Another way for black to play this could have been Nd5 first, where NxN, BxN+, Qe2, BxN, forcing white to double its pawn - a doubtfully desirable objective, but something to work on. ",
        "7. Be2 Bxe2": "I played simple here. I just wanted to test the opening in its purest state (a pity for a4).",
        "8. Nxe2 c5": "!? The mainline suggests g6 instead, but I wanted to try this one. I bet I'll find time to castle short asap. ",
        "9. O-O Nc6": "Grabbing the last tempo. I still think on a long casting here, since it throws my rook just where it hurts, in front of white's queen. This factor, that may be seem so remote, did actually pay a strong role in the game, and it is the main reason I am annontating this game. ",
        "10. Re1": "Here it comes, of course. ",
        "10... O-O-O": "Just as a ballet. Now let's see where will go that knight...",
        "11. Nc3": "A pity. Nd4 would have been much more funny. ",
        "11... Qd7": "Not Qc7, Nb5...",
        "12. d3": "Finally. Of course d4 just loses the pawn, and this is a kind of defeat for white in the opening. Let's me explain. Here, as black, I want to prepare a battery on h2. This is my most likely plan while developing. My enemy is the Nc3 (not all that bad move, after all), but I don't want to lose a tempo playing a6. So, I plan to let him put the knight there to kick my bishop, that will go to b8. After it, I'll kick the kinght with a6, and he would have to retreat the knight, and I am not losing a tempo. Moreover, I'll have the queen in front of the battery, and this implies a different way to attack (probably Ng4, that must be supported by h5 against the queen... a nice tactic play). The participation of white's dsb, which this moves abilitates, will help in stopping the nasty plan only if g3 is played, to support Bf4, and accepting a weak kingside. ",
        "12... Bd6": "Here it goes step number one. The bishops is supposed to be kicked back to b8. ",
        "13. a5": "White tries another plan, I didn't see before. Very smart, but with an incredible side-effect. ",
        "13... a6": "Now I've got the tempo to block his knight out of b5, but...",
        "14. Na4": "...not from b6! Still, I thought a little, and I found that this was not a problem at all. ",
        "14... Qc7": "If white goes Nb6+, I'll go Kb8, and that's it... for the moment!",
        "15. Be3": "White attacks c4, a good idea. Now, take into account black coud play c4, since white cannot take dxc4 or loses the queen to the rook after Bxh2+. Unfortunately, black can't play c4 because of Bb6). But for a similar reason, white can't play d4. Still, I felt in trouble. How to get out of it?",
        "15... Nd4": "I sac a pawn, but this will imply white's Nf3 to leave h2 unguarded, and after Bxh2+, Kh1, RxN, black has a good position for an attack. ",
        "16. Nb6+": "White throws in the useless check. ",
        "16... Kb8 17. Bxd4": "It begins the party. ",
        "17... cxd4 18. Nd2": "Being very wise, white subtracts from the previous line the RxN part, making it much less attractive... or not?",
        "18... Bxh2+": "The downside that white must keep in mind when doing such checks is the very nasty possibility to simply lose the bishop after g3. You have to keep in mind at any move what will be the result of such a move by white, and be sure you can either retire the bishop or sac it for g3 \"only if black wins as a result\". ",
        "19. Kf1 Bf4": "I decided to retire it. I've lost too many games for risking too much. True is that Qc6 was very interesting, since if after it white plays g3, Qh1+, followed by Re8#. But white could have other moves... I thought about Re7, as a \"last hope sac\" for later. ",
        "20. Ndc4": "Wow, white is ignoring me, and driving an impressive knight's power chain. His real scope at the moment is to preclude me the dark squares after g3, forcing me to exchange or retire on h6 my bishop. I can't allow that. A good way to counter this plan was Qc6, but I played...",
        "20... h5": "...since I saw the win on behalf of the knight joining the fry. Maybe I lost a chance, here. ",
        "21. Qf3": "Trying to unravel his pieces and correctly prevents Qc6. ",
        "21... Ng4": "I threat Nh2+, of course. ",
        "22. Kg1": "Not that simple, \"joe\"... :-)",
        "22... Bd2": "By this, I open the way for my queen to h2+, then h1+, Re8+, that will be lethal. White can avoid that, but must lose the exchange, and will merge with an inferior position. ",
        "23. Qg3": "Well, I'll cash it. I'm not really sure I can get much more from the position. ",
        "23... Bxe1": "The ball continues. It's amazing to observe how the two white kingths are almost useless for white!",
        "24. Rxe1 Qxg3 25. fxg3": "Here the interesting part of the game ends. Black has came out from the opening with a more than decent position, despite the isolated pawn in d4 he can even afford to lose. ",
        "25... Rhe8": "Forcing the rook's exchange. I'll have a hard fight against the kinght, and the more pieces are on the board, specially \"easily forkable ones\" as the rooks, the more white's knights will be dangerous and tricky. Be aware, exchange as much as you can and you'll win. White is almost forced to exchange, or Re2. ",
        "26. Rxe8 Rxe8 27. Kf1": "Whte of course have to meet Re1#. Here I blundered very heavily. ",
        "27... Re3 28. Nxe3 Nxe3+ 29. Ke2 Nxc2": "I explained it was just a blunder, and I thought the game was interesting enough to go on. ",
        "30. Nd7+": "My knigh'ts hunt won't succeed. Can you see why?",
        "30... Kc7 31. Ne5 f6 32. Nf3": "I was helping him to drive the kinght exactly in its best place. ",
        "32... Kd6": "Here, white would recover the pawn by kicking my knight. I can try to reveng on white's a and b pawns, with doubtful result. My opponent blundered here and the game loses interest. I'll make a possible line. ",
        "33. Kd2 Nb4 34. Nxd4 Kd5 35. Kc3": "Black's only hope here is to trap the white king in a fool's ball.",
        "35... Na2+ 36. Kb3 Nc1+ 37. Kc2 Na2 38. Kb3": "...and so on. ",
        "38... Kxd4 39. Kxa2 Kxd3": "If white breaks the ball, this will be more or less the result, and I think black has serious chances to win the game. "
    },
    "url": "https://gameknot.com/annotation.pl/the-lone-sentinel?gm=56147",
    "gameName": "The lone sentinel",
    "players": "player  vs. damalfi ",
    "opening": "Scandinavian defence (B01)"
}