{
    "moves": {
        "1. d3": "I actually meant to play d4, but my mouse was screwing up... probably because there was a mouse trap on the d4 square.",
        "1... e6": "No matter because now i can transpose into the blootstein attack, first used by legendary grand maestro Swang Dudeetsen.",
        "2. e4": "Staking claim in the center, a very key component to successfully executing the blootstein attack.",
        "2... a6": "b5 was blocked from my bishop for the time being, so this move was unnecessary.",
        "3. f4": "I will continue to play the blootstein.",
        "3... c6": "takes away a good spot for his horsey.",
        "4. g3": "Hmmm... i actually meant to play g4... there must of been another mouse trap there.",
        "4... d5": "hmmm... attacking my pawns.",
        "5. e5 Ne7": "developing his Knight.",
        "6. g4": "Now i can play the move i originally intended at g4. The blootstein formation is coming together... it will be a great assault.",
        "6... Ng8": "Just moving back to its starting square... i don't know.",
        "7. d4": "It is quite clear that my blootstein attack has caught him off guard. If you are not well versed in the ways of swang dudeets, most of his techniques look a little strange.",
        "7... Qh4+": "I anticipated this, a perfect time to start my attack.",
        "8. Kd2 Qd8": "Just moving back to the starting square again...",
        "9. Kc3": "Now the idea of the blootstein attack is to use your king to take the opponents pieces. That is why all my pieces are not developed, the king really is your strongest piece in this attack.",
        "9... Qa5+": "Hmm...it would appear that he has seen the potential of the blootstein attack and would like to deviate away from that. A solid choice.",
        "10. Kd3 Qd8": "Retreating once more.",
        "11. Kc3": "So i will try to start my blootstein attack again.",
        "11... Qa5+": "He still wants none of it.",
        "12. Kd3 c5": "not retreating this time but this allows me to develop my bishop and chase his queen.",
        "13. Bd2 c4+": "closing the center of the board. After my failed blootstein he should probably not close the board like that as now my king is safe in the center of the board.",
        "14. Ke3 Qd8 15. Nc3": "Developing my Knight. ",
        "15... Nc6": "He starts to develop again.",
        "16. a3": "Probing to see if there are any mouse traps on b4.",
        "16... f6": "Challenging my pawns.",
        "17. b4": "So now it is clear that there are not any mouse traps on the b4 square.",
        "17... f5 18. h3": "I'm going to keep the center closed, in hopes that eventually i will be able to get my king into enemy territory in order to do battle with the opposing army.",
        "18... Nh6": "Develops his other knight but he doesn't have very many prospect squares.",
        "19. g5": "Go away yo.",
        "19... Ng8": "And now he is back at his starting square for the third time.",
        "20. h4": "I will continue to take space, allowing my king more room. This expansion is necessary in order to fit the many apple orchids i've acquired over the course of my chess career.",
        "20... Bd7": "develops, but again not much in the way of activity.",
        "21. Nge2": "activating my other horsey",
        "21... Qc7 22. b5": "i'm going to attack his horse, and if he moves it i will exchange pawns, because i can.",
        "22... axb5 23. Nxb5": "Now i'm going to eat all your apples.",
        "23... Qc8": "Forced to retreat.",
        "24. c3": "locking up the board, obviously a great move.  It deserves an exclamation mark but i'm pretty modest.",
        "24... Na7": "Just exchanging horses. Not the best of moves. Much better would be Na5 targeting the b3 square.",
        "25. Nxa7 Rxa7 26. a4": "Necessary to protect the pawn.",
        "26... g6": "His king side is really cramped now, it is clear my blootstein attack has left me with a solid position despite not being able to get my king up to the 8th rank.",
        "27. h5 Ne7": "Defending the pawn at g6, he can't take retake with the pawn because then i'd win his rook.",
        "28. Ng3": "bringing my knight into the action.",
        "28... h6": "attacking the g5 pawn.",
        "29. hxg6 Nxg6 30. Nh5": "I see a very nice spot to place my horsey at f6. hopefully there aren't any mouse traps there.",
        "30... Kf7 31. Nf6": "clearly the blootstein has been successful as my position continues to improve.",
        "31... Bc6": "? he should be happy if i decided to exchange my awesome horse for his useless bishop.",
        "32. Be2": "finally going to make use of my bishop.",
        "32... Be7 33. Bh5": "pinning the horse to the king.",
        "33... Bxf6": "Black is now lost.",
        "34. Bxg6+ Kxg6 35. Qh5+": "about to just bust the king side wide open.",
        "35... Kg7 36. exf6+": "now i have two past pawns, an insurmountable attack awaits.",
        "36... Kf8 37. g6": "material loss is inevitable.",
        "37... Bd7": "this doesn't help at all but mate is pretty unavoidable regardless.",
        "38. g7+": "Moving on up.",
        "38... Kg8 39. Rag1": "Now i could win the rook, and after the king takes my queen can swoop in for the win. But i like this more.",
        "39... Rh7": "Death by pawn.",
        "40. f7#": "So i'm quite sure this demonstrates the incredible potential of the blootstein attack. Obviously grand maestro Swang Dudeetsen played it a lot better than I, acquiring multiple mates in his career with the King."
    },
    "url": "https://gameknot.com/annotation.pl/the-blootstein-attack-and-a-pretty-mate?gm=46345",
    "gameName": "The Blootstein Attack and a Pretty Mate",
    "players": "yrahcaz1990  vs. adam0211 ",
    "opening": "Mieses opening (A00)"
}