{
    "moves": {
        "1. e4": "I played in a simul once when I was 9 (and lost in something like 50 moves), and the guy giving the simul had white on all the boards, and played 1. e4 against me... I wonder if it's a theme among advanced chess players?",
        "1... d5": "The scandinavian (or center-counter) defense, where black's queen comes out early but he normally winds up with a solid position, especially if white devotes too much time to chasing the queen.",
        "2. exd5 Qxd5": "2. ...Nf6 is less common, but also sound.",
        "3. Nc3": "A natural developing move, forcing the queen to move.",
        "3... Qa5": "No surprises.  An interesting alternative for black is Qd6.  In my very first gameknot game, black played 3. ...Qc6???, which loses immediately to 4. Bb5!, so watch out for that trap!",
        "4. d4": "All standard so far.",
        "4... c6": "Slightly more common is 4. ...Nf6, but this is a good move, as it allows Qc7, which is generally a good square for the queen after a move like 5. Bd2.",
        "5. Nf3": "Just keeps on developing.  This game is pretty unremarkable so far.",
        "5... Bg4": "5. ...Nf6 and 5. ...Bf5 are good alternatives to this move, which pins the knight, but will often lead to black ceding the bishop pair after white plays h3.",
        "6. Bf4": "Denying black the use of the c7 square for his queen, and solidifying white's ownership of e5.  This move is unpopular, however, and 6. h3, 6. Be2, 6. Bc4, and even the super-obvious 6. Bd2 are more common than this move, which seems to allow a long-term pin on the Nc3, at least until white castles.\n\nA reasonable plan for black in the face of this unusual move is 6. ...e6 followed by 7. ...Bb4.",
        "6... e6": "And black sees this as well!",
        "7. h3": "And now that the c8-h3 diagonal has been closed, it makes sense for white to break the pin on the Nf3; it looks like he may emerge with the two bishops after all.",
        "7... Bxf3": "This perfectly natural move has never been seen on gameknot before... but there's nothing terrible about it.  I prefer Bh5 myself, as the text develops white's queen for him.",
        "8. Qxf3": "Of course.  Now, white is ahead in development, but black's position looks pretty solid, and he still has Bb4, but it doesn't look so menacing with a queen on f3.",
        "8... Bb4": "Okay, now I'm not sure whether this is a bad move objectively or not, but I don't like it.  It seems far too optimistic of black, given his developmental deficit and the fact that both his knights are still at home.  \n\nI would've thought about Be7 or Nf6 instead, here, trying to catch up in development.",
        "9. Be2": "White continues his development, looking to castle kingside, perhaps.  The e2 square suits the bishop, where it can eye both sides of the board -- developing to c4 or d3 restricts its mobility, given the position of the black pawns.",
        "9... Nd7": "?  This move gets a question mark, not because it's a bad move, but because it's the start of a dubious plan by black.  This anticipates a queenside castle, but that's a pretty poor decision given white's development.  \n\nBetter, I think, would've been 9. ...Nf6 followed by 0-0.",
        "10. a3": "!?  An interesting trap!  While black isn't afraid of axb4 because of Qxa1 , there is an unbelievable combination if black plays 0-0-0, instead of, say, Nf6 next.",
        "10... O-O-O": "???  Noooooo... how many times have you been warned against \"castling into it\", no name?  Now black falls victim to an amazing sacrificial combination.",
        "11. axb4": "!  Excellent here.  White offers black the exchange.",
        "11... Qxa1+": "?  The losing move.  Relatively best was 11. ...Qb6, where black can regroup, just being down a piece, and can try to coordinate his forces.",
        "12. Kd2": "!!  Amazing!  This offers a second rook, and is MUCH stronger than either 12. Bd1 or 12. Nd1.  Takes a lot of guts to offer both rooks!  Note that the only move besides Qxh1 that doesn't lose the queen for black is Qxb2, which gets checkmated just as quickly.",
        "12... Qxh1": "The last hope for black was to play 12. ...Ne5 here, hoping for 13. Rxa1 Nxf3 , where black is at a large disadvantage, but it isn't as bad as what comes next...",
        "13. Qxc6+": "!!!  Are you kidding me?  You just sacrificed both rooks and now you're giving up the queen?  Who do you think you are, Esteban Canal?",
        "13... bxc6": "Forced.",
        "14. Ba6#": "Oh, apparently you think you're Boden, as this characteristic move (Ba6 or Bh6) is known as Boden's mate.\n\nI seriously wonder how often something like this could happen to regular chessplayers like us, if we just remembered to look for it?"
    },
    "url": "https://gameknot.com/annotation.pl/the-peruvian-immortal-game?gm=9551",
    "gameName": "The Peruvian Immortal Game",
    "players": "E. Canal (2500) vs. NN ",
    "opening": "Scandinavian defence, Lasker variation (B01)"
}