{
    "moves": {
        "1. e4": "Hello, I would like to annotate an enjoyable game that I recently played here on Gameknot. There are quite a few mistakes in the game, but I have tried to explain in a way that lower rated players can learn something.",
        "1... c5": "c5, the Sicilian defence. e4 is perhaps the most common opening move, so it is essential to learn a good response to it. I prefer to play c5 rather than e5 because it is more aggressive and gives black a more open game.",
        "2. Nf3 Nc6": "d6 is the most common move here by black, but Nc6 is absolutely playable. The idea is to challenge the d4 square.",
        "3. Bc4": "Bc4 is not a move I have seen often. The gameknot database suggests that it is slightly inferior to the more common move of d4 (initiating the pawn exchange by black). Bb5 and Nc3 also yield better results for white overall.",
        "3... e6": "Planning to play d5, driving back whites LSB, gaining tempo, space and control of the centre.",
        "4. Nc3": "Developing the knight to a good square and preventing d5 for the moment.",
        "4... Nf6": "Developing the knight to a good square and preparing again to play d5.",
        "5. d3": "Activating the DSB and providing support.",
        "5... d5": "Finally I get to play d5, attacking whites bishop.",
        "6. exd5": "Pawn exchange.",
        "6... exd5 7. Bb3": "Retreat, and loss of tempo. At this point I lose access to the GK database, it shows that black has a reasonable advantage already, presumably due to blacks stronger central control and small space advantage.",
        "7... Bd6": "I think this is a mistake, as it allows white to capture the pawn on d5. Without access the the DB and having just got back from several months hitch hiking in West Africa, where chess is almost unheard of, I am a bit rusty. Better moves would have been Be7 or Bg4.",
        "8. O-O O-O": "Both sides get their king off the dangerous, open e file.",
        "9. h3": "Stops any ideas of pinning whites knight with Bg4, but opens up other possibilities such as a sacrifice on h3. I think perhaps this move was a bit slow at this stage, with Bg5 or Nxd5 being better alternatives.",
        "9... d4": "Threatens the N and prevents Nxd5, but whites bishop now has a strong diagonal, aiming at my king!",
        "10. Ne4": "I think Nb5 is slightly better, but I am not sure.",
        "10... h6": "Three enemy pieces can land on g5, so I decide to secure it.",
        "11. Re1 Re8": "Contesting the crucial open e file. I later realised this to be a mistake. Nxe4, dxe4, then Re8 is a much better alternative, as will be explained.",
        "12. c3": "c3?? Both players missed the significance of Nxf6+. The Queen cannot recapture on f6 because it would leave the rook on e8 attacked and undefended. After 12. Nxf6+, gxf6 13. Rxe8+, Qxe8, 14. Bxh6, giving white a huge advantage.",
        "12... dxc3 13. bxc3": "The possibility of Nxf6+ is still there.",
        "13... Bf5": "The rook on e8 now has another defender, making Nxf6 a less serious threat.",
        "14. Nxf6+": "Too late!",
        "14... Qxf6 15. Bb2": "Eyeing up the black Queen, but white cannot open the diagonal until the bishop on b2 is defended.",
        "15... Rxe1+": "I decided to exchange here because if white recaptures with the Queen, I can win the d pawn, and recapturing with the Knight, weakens whites position.",
        "16. Qxe1 Bxd3": "Munch.",
        "17. Qd2 c4": "c4! Defends my annoying bishop on d3, attacks whites bishop, and advances a Queenside pawn, where I now have a majority.",
        "18. Bc2": "Ba5 is better.",
        "18... Bf4": "Forces the Queen to d1, where defensive possibilities are more limited.",
        "19. Qd1 Rd8": "Secures the bishop and takes control of the open file. It is important to note that the rook is also defended here. Blacks pieces are now working together well. White has a cramped position, his bishop on b2 is almost useless, and it will be a few moves until his rook can have an influence on the game.",
        "20. Bxd3": "Bxd3? White tries to trade off the annoying piece, but it allows the pawn on c4 to become passed and dangerously close to promotion.",
        "20... cxd3 21. Rb1": "Rb1? g3, Bc7, Nd2 may have offered better resistance.",
        "21... d2 22. c4": "White attempts to activate the DSB, but it only makes black play a move that he wanted to play anyway...",
        "22... Qg6": "Qg6! Can you see the danger of this move? ",
        "23. Bc3 Qxb1": "Qxb1!! Wins the rook outright, as after Qxb1, d1=Q+, Qxd1, Rxd1 with mate to follow, forcing immediate resignation. I'd like to thank my opponent kentathena for a good game!"
    },
    "url": "https://gameknot.com/annotation.pl/the-sicilian-defence?gm=43772",
    "gameName": "The Sicilian defence",
    "players": "kentathena (1415) vs. the_hitch_hiker (1200)",
    "opening": "Sicilian defence (B30)"
}