{
    "moves": {
        "1. d4": "Hi all! This is a game between me and my long-standing Arch-Rival, who has only recently come to GameKnot. He is playing White, and before this game the score between us is 1.5-1.5. So there's a lot to play for...",
        "1... Nf6": "I play the move for Black which points the way to main line Queen Pawn openings, such as the King's Indian, Nimzo-Indian, or Benoni. The benefit of this move is that Black has more or less complete freedom to choose the opening.",
        "2. Nf3 g6": "Pointing the way to a King's Indian Defence.",
        "3. c3": "This solid move, my Arch-Rival told me, is often played to bypass the sharp play and the theoretical lines of the King's Indian Defence, also blunting Black's fianchettoed bishop. Annoying for me, as I am more comfortable with main line KID.",
        "3... Bg7 4. g3 O-O 5. Bg2 d5 6. O-O Nbd7": "Both sides develop, in nearly symmetrical fashion.",
        "7. Bg5 Re8 8. Nbd2 e5 9. dxe5 Nxe5 10. Nxe5 Rxe5 11. Bf4 Re8": "Mass exchanges in the centre, opening up the position more: this is a far cry from the main line King's Indian Defence, and much more open.",
        "12. Re1 c6": "Solidifying my advantage in central control.",
        "13. e4 Bg4 14. Qc2 dxe4 15. Nxe4 Nxe4 16. Rxe4 Bf5": "A pin...but sadly, not one that wins material.",
        "17. Rxe8+ Qxe8 18. Qd2 Rd8 19. Re1": "Fine. You harass my queen, I harass yours.",
        "19... Qd7": "I prefer keeping my queen in a central, dominant position with ...Qd7, than hide in the corner with ...Qf8. This is a CRITICAL BLUNDER BY ME.",
        "20. Qxd7 Rxd7": "I recapture my queen. I had, yes, foreseen lines with 21.Re8+ Bf8 22.Rb8 Rd2, which I think are narrowly advantageous for me.",
        "21. Re8+ Bf8 22. Bh6": "AAAAARGH!!!!!!!! No! Dead in the water! Thwarted by an irritating bishop attack! Why? This is exactly as GM Yasser Seirawan describes this combination in \"Winning Chess Combinations\" and I fell right for it! No! An embarrassing loss against my ARCH-RIVAL!",
        "22... Rd1+ 23. Bf1 Bh3": "I may as well replicate the attack. There's nothing else I can do.",
        "24. Rxf8#": "Owch. 2.5-1.5 to you, jelly...this is not yet over..."
    },
    "url": "https://gameknot.com/annotation.pl/the-tiebreak?gm=22324",
    "gameName": "The Tiebreak",
    "players": "jelly939 (1200) vs. fatcat2 (1456)",
    "opening": "King's Indian (A48), East Indian defence"
}