{
    "moves": {
        "1. d4": "Yes! I always play d4 too!",
        "1... d6 2. Nc3 d5": "Black appears to have just wasted a move. I would play 3. e4 now",
        "3. h3": "This a non-developing move. As well as e4, I would say Bf4 or Nf3 were both better",
        "3... Nf6 4. Nf3": "Good move!",
        "4... e6": "I'm not sure why black blocks in the Bc8. I would prefer Bf5",
        "5. a3": "Now, in contrast to h3, this is part of a decent plan. White plans Qd3 and e4 and doesn't want this foiled by Bb4",
        "5... Be7 6. Qd3 O-O 7. e4": "The position in some ways looks a bit like a French defence now",
        "7... b6 8. e5": "I like this move, gaining space",
        "8... Nfd7 9. h4": "and this move could be part of a king's side attack. White threatens Ng5 and Qxh7 mate and if black takes the knight on g5 white can recapture with the pawn, opening up the h file for her rook, so again threatening mate on h7.",
        "9... Ba6": "so black wisely cuts across this idea.",
        "10. Qe3 Bxf1 11. Kxf1": "white has to take with the king otherwise the h pawn falls. Although unable to castle, this shouldn't be too much of a problem with the centre blocked.",
        "11... c5 12. g4": "I think this move is a mistake. Although the correct plan is a king's side attack, as black hasn't advanced the f, g or h pawns, it will be hard to open a file there. I think best was to secure the d pawn with Ne2, may followed by B-d2-c3 and Rd1, and then use the Nf3 to go back to the old plan of attacking h7 with the Ng5 and queen on d3 or h5",
        "12... Nc6": "Black correctly piles on the pressure on the d pawn",
        "13. g5": "and white continues with her plan. Ne2 was still best",
        "13... cxd4 14. Nxd4": "Now white's e pawn falls, and without a solid centre her king is vunerable",
        "14... Ndxe5 15. Rg1 Nxd4 16. Qxe5 Nf3": "ouch! black forks the queen e5 and Rg1 to win the exchange",
        "17. Qe2 Nxg1 18. Kxg1 Rc8": "black correctly mobilises reserves",
        "19. Nd1": "A strange retreat! White needed to develop her bishop to f4. Not to d2 when d4 wins the c pawn for black, or even worse e3 when d4 forks knight and bishop",
        "19... Rc4 20. f4": "f4 is the only way to prevent the loss of a pawn, but now the Bc1 has less squares to go to",
        "20... Qc7": "Piling up on c2. White needs to play c3",
        "21. Qf3 Bc5+ 22. Kh1": "White misses yet another chance to develop her Bc1 - to e3",
        "22... Rxc2 23. Ne3 Bxe3 24. Qxe3": "and now, no doubt white didn't want her b2 pawn to drop",
        "24... d4": "An excellent move by black!",
        "25. Qxd4 Qb7+ 26. Kg1 Qg2#": "Apart from 3. h3? white plays the opening well, follows a good plan to enforce e4 and correctly follows up with e5 and a king's side attack. White loses by not developing pieces quickly enough and not securing the centre before going in for the king's side attack. Black plays well after making mistakes in the opening. "
    },
    "url": "https://gameknot.com/annotation.pl/the-july-challenge?gm=25932",
    "gameName": "The July Challenge",
    "players": "thundergirl001 (1438) vs. koekje666 (1538)",
    "opening": "Queen's Pawn (A41)"
}