{
    "moves": {
        "1. e4": " ",
        "1... e5 2. f4": "  The King's Gambit a very powerful opening, giving up a pawn for the sake of\r\n  rapid development. The King's Gambit was very  popular  in  Anderssen's day.\r\n  The King's gambit is very rarely seen in top chess today.\r\n  \r\n   ",
        "2... exf4": " The most common move....",
        "3. Bc4": "   3. Nf3 prevents  what black plays in this game.....",
        "3... Qh4+": "    like that!",
        "4. Kf1 b5": "  Black sacrifices a pawn to get the white bishop of the good diagonal but \r\n      white  gets a pawn back...",
        "5. Bxb5 Nf6 6. Nf3": "  White and Black are trying to develop their pieces as fast as they possibly can\r\n       for the  attack. Nf3 develops with a threat!",
        "6... Qh6": " The Queen retreats.......",
        "7. d3": "  White protects his e4 pawn and lets out his dark squared bishop.",
        "7... Nh5": " ?  Black is threatening 8. Ng3   9. hxg3  Qxh1 .  But this move loses control over the center.  But opening rules these days are  don't move pieces twice in \r\n opening unless you are forced to. Bring out all your pieces then try to attack is \r\n another rule.",
        "8. Nh4": " Stopping the threat and looking at putting the Knight on the excellent  f5 \r\n  outpost where it attacks black's Queen.\r\n             ",
        "8... Qg5 9. Nf5": " Look at how many times both players are moving the same pieces again and\r\n again.",
        "9... c6 10. g4 Nf6": "?   Black wastes more time. Black should have gone for the exchange,  10. cxb5\r\n    11. gxh5, even though White would retain an advantage.",
        "11. Rg1": "!    White has really had enough!  He defends his g4 pawn and sacrifices his b5\r\n      bishop so that his pawns can gain some time by chasing away Black's \r\n      Queen!",
        "11... cxb5": "   Not wishing to be banned from all the future chess events, Black acceps the \r\n   gift and also glares at his opponent.",
        "12. h4": "   take that!",
        "12... Qg6": "  Queen retreats....",
        "13. h5": "  take this!",
        "13... Qg5": " ",
        "14. Qf3": "   White develops a piece and also threatning the obvious 15.Bxf4 which will\r\n   trap Black's Queen.",
        "14... Ng8": "   Black retreats his knight so his Queen gets access to f6 or d8 safely retreating\r\n   his queen.",
        "15. Bxf4": "     Another White piece is developed also with a gain of tempo.",
        "15... Qf6": "  threatning   16.Qxb2  winning a1 rook",
        "16. Nc3": "   stops  Black's threat....",
        "16... Bc5": "?      This attack on White's rook can be easily stopped. Black should have \r\n     realized that stopping White's next move was much more important than\r\n      engaging in a counter-attack.",
        "17. Nd5": "!?      A modern player these days would  force Black back by playing  17. d4\r\n       ( if 17.Bxd4?  18.  Nd5!  and Black's queen has to move and where ever  \r\n         it goes Black will have to lose the d4 bishop afterwards)  17. Be7  now\r\n       18. Nd5 is absolutly crushing!",
        "17... Qxb2": "      Black is treatening the obvious  Qxa1 .....",
        "18. Bd6": " !       White ignores all of Black's threats. As you can now see  White is \r\n        beggining to surround the Black King with his pieces!",
        "18... Qxa1+": "    Very greedy.....",
        "19. Ke2 Bxg1": " ?    Very greedy now. But Black wanted to take the rook and challenge White to\r\n       try and prove his point.",
        "20. e5": "   White does not want Black's Queen taking part in the defence at all.",
        "20... Na6": "   Black could have been more stiff by doing 20. Ba6  which gives his King the c8\r\n   square to run off to.  But White gets a winning ending but only after 21. Nc7 \r\n   Kd8   22. Nxa6  Bb6   23. Qxa8  Qc3   24.  Qxb8   Qc8   25. Qxc8    Kxc8  \r\n    26. Bf8   h6     27. Nd6    Kd8     28. Nxf7    Ke8    29. Nxh8  Kxf8  30. Ng6 \r\n    30.  Kf7     31.  c3    Ke6   32. d4.",
        "21. Nxg7+ Kd8 22. Qf6+": " !     Whit draws the Knight  away from the defence of the crutial  e7 square!",
        "22... Nxf6 23. Be7#": "    Checkmate!\r\n   This position is very pleasing indeed!  White has sacrificed his Queen, both his\r\n   Rooks and also a Bishop to get a pure minor piece checkmate!"
    },
    "url": "https://gameknot.com/annotation.pl/the-immortal-game?gm=4608",
    "gameName": "The Immortal Game",
    "players": "Anderssen (N/A) vs. Kieserizky (N/A)",
    "opening": "KGA (C33), bishop's gambit, Bryan counter-gambit"
}