{
    "moves": {
        "1. d4": "Hi all. I have decided to annotate this game, as the end of an era for me. This is - was - the last chess game in which I ever played the Stonewall Attack as White. I know that readers may have different opinions, but I have finally become convinced of how difficult it is to crash home with this attack against an experienced player. Several bad experiences with the Stonewall Attack, both OTB and online, have caused the decision to give it up. Have a look at this game to see why.",
        "1... d5": "I start with the queen pawn, and my opponent plays his queen pawn.",
        "2. e3": "This move characterises White's aim at playing the Stonewall Attack, although there is still the option of transposing to a Colle System with 3.Nf3. White will place his central pawns to dominate the dark squares, on d4, e3 and f4.",
        "2... Nf6 3. Bd3 e6": "This tends to be the response that White is hoping for, to facilitate his kingside attack. It tends to be harder to attack if Black plays ...g6 and ...Bg7, as Black's g-pawn is then a strong buffer, and also rules out any possible Greek Gift sacrifices - although these are rare in the Stonewall. Another good option for Black is 3...Nc6! threatening both 4...e5 and 4...Nb4, either of which disrupts White's Stonewall formation.",
        "4. f4": "Characterising this fully as a Stonewall Attack. White closes the centre, dominates the dark squares, and prepares for a powerful kingside attack.",
        "4... c5 5. c3": "Solidifying the structure, and preventing any future problems from ...Nb4. If Black tries ...cxd4, White replies exd4 and opens up the centre for his dark-squared bishop.",
        "5... Nc6 6. Nf3": "In hindsight, I should probably have played 6.Nb2, to prevent Black's next move - the last trick he has up his sleeve against my Stonewall formation. I would then have continued 7.Nf3.",
        "6... Ne4": "Owch. Suddenly there is a major stumbling block to my attack. I considered 7.Nbd2, but then Black plays 7...f5! solidifying the powerful grip on the centre that his 6th move has brought him.",
        "7. O-O": "Instead, I played a normal developing move, bringing my king to safety, while placing the rook on the f-file, from where it can become active via f3 in a future attack.",
        "7... c4": "Unfortunately for me, Black's plans to not seem to allow White to play any kind of \"future attack\". Black is trying to lock down on my position and cramp my centre, so that the attacking pieces...simply cannot get out. Ordinarily, ...c4 is a weak choice for Black, as it removes all his possible counterplay on the queenside. Under the circumstances, however, and accompanied with his powerful grip on the centre, it is a strong option.",
        "8. Bc2": "In hindsight, maybe the bishop would have been better on e2. I at the time wanted to keep my bishop on the powerful c2-h7 diagonal - but, of course, Black will soon close that.",
        "8... Be7 9. Nbd2": "My last resort to try to shift Black's powerful knight.",
        "9... f5": "Consolidating Black's powerful centre. Black is now dominating the centre and the queenside, while White's attacking pieces have barely any room to breathe. Black's backward pawn on e6 is in no way weak. The good thing for White is that Black has no way to break through and convert his positional advantage into a win - his pieces cannot get past my pawns on the queenside, while the centre is locked.",
        "10. Nxe4 fxe4 11. Ne5": "I exchange off that irritatingly powerful knight outpost on e4, and return the favour: I shove my knight on e5. Black has the slightly better position, because his dark-squared bishop is well placed, while both my bishops are banging their heads on granite. However, at this point, I felt that neither side had any tangible advantage that could bring a win.",
        "11... O-O": "I had been hoping that Black would allow me to try out my one trap: 12.Qh5+!, which would have won material after 12...g6 13.Nxg6 (12...Kf8?? 13.Qf7#) but then again, it was unlikely that he would miss it.",
        "12. Qg4": "I tried to generate activity by bringing my queen out, and putting some pressure on Black's backward e-pawn. Of course, with no other White pieces able to reach it, that pawn was not going to fall.",
        "12... Nxe5 13. fxe5 Rxf1+ 14. Kxf1 Qf8+ 15. Qf4 Bd7": "Black goes for some exchanges, and locks the pawn-structure in the centre. I was hoping that he would try 15...Qxf4 16.exf4, in which I would have been able to hope for a breakthrough with my e- and f-pawns. I believed that my bishops would be able to control Black's passed e-pawn.",
        "16. Qxf8+ Rxf8+ 17. Kg1": "I exchanged queens, and offered a draw, which Black accepted. Objectively, Black's position is superior, with his bishops far better-placed. However, it is only a matter of time before White's bishops can scramble out of their hole onto the kingside, and in the meantime Black has no way of breaking through. So, I felt that a draw was a fair result for this game - but I will leave that to the viewers to decide! I was happy with the high-rated draw I had reached; however, the stagnant, cramped game had taught me a harsh lesson. I was no longer going to play the Stonewall."
    },
    "url": "https://gameknot.com/annotation.pl/the-end-of-the-stonewall-era?gm=27714",
    "gameName": "The End of the Stonewall Era",
    "players": "fatcat2 (1419) vs. toriki (1557)",
    "opening": "Queen's pawn (D00), stonewall attack"
}