{
    "moves": {
        "1. e4": "Hey hey all! Good afternoon!",
        "1... Nc6": "Here's yet another nimso annotation hehe. This game gets quite hectic real fast. But the ending is worth keeping.",
        "2. d4": "Strongest reply",
        "2... d5": "Preferred d5. We all got our playstyles :)",
        "3. exd5": "Ooooooo , takes and not advance, we are gonna have some exchanges this game it looks like",
        "3... Qxd5": "Recapture",
        "4. Nf3": "Going nc3 right away can allow Queen takes pawn for a Wiley game or forces a queen retreat",
        "4... Bg4": "Pin+development",
        "5. Nc3": "Nc3 now forces a queen retreat, gaining some development tempo",
        "5... Qe6+": "But I'm a gambler at heart! queen check! For the players who don't like tangled positions or don't want to risk a queen trade here. Retreating the queen back to d8 is playable",
        "6. Be3": "It is best for white to block with queen here. Allowing him to develop lsb when black exchanges queens. As for me I love the games where opponent blocks with a piece.",
        "6... Bxf3": "Exchange to double pawn him or gain the d4 pawn if he recaptures with queen.",
        "7. gxf3": "Opponent chooses double pawn.",
        "7... Qf5": "I reposition my queen to allow my e pawn some movement room",
        "8. Bd3": "Maybe I could've chosen a better square. His bishop develops with tempo on my queen.",
        "8... Qh5": "Maybe queen d7 was better. But I wanted my queen to be out still and have diagonals to the queen side. Was anticipating him to castle queen side.",
        "9. Qe2": "Opponent heads towards queen side castling. He's way more developed than me. But his structure makes it a bit easier to anticipate his moves.",
        "9... e6": "Told myself I can wait until he plays his Knight to b5 to castle. Until then it's time to bring my other pieces out.",
        "10. O-O-O Bb4 11. Nb5 O-O-O": "And so after his castle my dsb development he plays the Knight to b5 and I go with my castle.",
        "12. Kb1": "I'm thinking he played this because I don't have an lsb anymore. ",
        "12... a6": "I take the opportunity to kick his Knight away. This also protects my a pawn in the future from his dsb",
        "13. Nc3 Nxd4": "His Knight retreated and I thought this attack was a pawn up exchange.  It was too soon to attack. I should've developed my other Knight first. Nf6 or to e7 both look playable and then possibly centralised my h rook before launching my attack.",
        "14. Bxd4 Rxd4": "Take and take with a surprise to follow",
        "15. Bxa6": "I didn't anticipate this bishop dive!",
        "15... Bxc3": "Had to protect my rook and taking the lsb with pawn loses the rook when he recaptures with queen check",
        "16. bxc3 Ra4": "I played this to put pressure on the lsb and in anticipation to slide my queen over",
        "17. Qd3": "After this move I didn't want to trade queens so I take his lsb at the cost of my rook. If I don't block the queen or take the lsb. Checkmate is looking with Qd8#",
        "17... bxa6 18. Qd7+ Kb7 19. Qxa4": "Goes forward with his plan now it's gonna be rough. Knight rook queen vs rook rook queen.",
        "19... Nf6": "Develop my Knight. ",
        "20. Ka1": "He moves his king for the second time this game without it being promoted to.",
        "20... Nd5": "So I bring my Knight in closer",
        "21. Qe4": "He pins my Knight. I anticipate c4 to follow",
        "21... c6": "Break the pin and allow movement for my king sideways without blocking my rooks movement",
        "22. Rdb1+ Kc7 23. Qa4 Ra8": "I can finally bring my rook over. My queen hasn't moved in a long time. What I like about the structural damage I did to him during the game. Pushing pawns will be difficult for him.",
        "24. Qa5+": "Probing my king. I think he's looking for ways to come down",
        "24... Kd6 25. Rhd1": "Renews a pin with the threats of c4 ",
        "25... Ke7": "At least the squares his queen has access too behind my pawn line are protected.",
        "26. c4": "He finally plays c4 but without a pin and a way for his queen to come in. My Knight becomes deadly!",
        "26... Qe5+": "If opponent blocks with c3 I have to capture the pawn with queen. It forces a queen exchange but my Knight forks the two rooks",
        "27. Rb2": "So he blocks with rook. I don't have to move my Knight yet.",
        "27... Rb8": "Moving my rook to the open file is safe it creates a mate in one threat and his rook is pinned",
        "28. Qa3+": "He protects mate and has a check at same time",
        "28... Nb4": "I take this opportunity to save my knight",
        "29. Qb3": "I'm not to sure what his queen move here is for. May to play a3 with the threat to take my rook if I move my knight",
        "29... c5": "So I solidify my Knight ",
        "30. Qa4": "Again queen move maybe he thought a3 was to slow. Or he loves that nice d7 square protected  By his rook",
        "30... Nd3": "But it allows triple pressure on the b rook. He can't capture Knight cause of mate threat and the queen no longer has safe access to the d7 square",
        "31. Rdb1": "He attempts to protect it",
        "31... Nxb2": "But I can just capture and he can not retake with rook or it's checkmate",
        "32. Qb3": "His final response giving his queen up for my rook",
        "32... Nxc4+": "But I felt this finishing move was even more cruel and my opponent resigned.  I hope you all enjoyed this game and that it's appropriately named hehe\n\nOne more to the nimso annotations bank"
    },
    "url": "https://gameknot.com/annotation.pl/the-revenge-of-the-knight?gm=62967",
    "gameName": "The revenge of the Knight!",
    "players": "??? (1557) vs. TrixsterMTL (1593)",
    "opening": "KP (B00), Nimzovich defence, Marshall gambit"
}