{
    "moves": {
        "1. e4": "The Steinitz standard.",
        "1... e5 2. Nf3 Nc6 3. Bc4 Bc5": "The Italian Game.",
        "4. c3": "The standard (or \"book\") move, which aims to support playing d4.",
        "4... Nf6 5. d4": "The most aggresive continuation. White is playing to maintain the tempo he has by virtue of having the first move of the game. Control of the center is the aim!",
        "5... exd4": "Black strikes first, drawing first blood. This is the sound play.",
        "6. cxd4": "Regaining the material, and establishing a strong base of operations in the middle of the board.",
        "6... Bb4+ 7. Nc3": "!? The most aggressive way to deal with the check. White opts to interpose with development. Safer, but far less sexy was [7.Bd2 Bxd2 8.Nbxd2 d5 9.exd5 Nxd5 10.Qb3!? Nce7] with even chances (albeit a little passive for white).",
        "7... d5": "?! Dubious, and condemned by many far more experienced than this lowly commentator. Modern theory suggests [7...Nxe4?! 8.0-0 Bxc3 (8...Nxc3!? 9.d5! The Moeller Attack)].",
        "8. exd5": "! White keeps up the pressure.",
        "8... Nxd5 9. O-O": "! from many including Kasparov. [9.Bxd5!? Qxd5 10.0-0 once again yields even, although passive chances for white].",
        "9... Be6": "! The best move. Black saw the danger of playing 9...Nxc3, as 10.bxc3 Bxc3 11.Bxf7 Kxf7 12.Qb3 ! Be6 13.Qxc3 yields a strong initiative for white.",
        "10. Bg5": "Obviously I'm no Steinitz, but 10.Bd2 seems a little safer as the dark squared bishop can now be made to retreat if black plays h6.",
        "10... Be7": "Black now sets the table for a feast of tactical captures.",
        "11. Bxd5 Bxd5 12. Nxd5": "White once again attempts to maintain his tempo.",
        "12... Qxd5 13. Bxe7 Nxe7 14. Re1": "! Logical and strong! Black cannot castle now or his knight falls.",
        "14... f6 15. Qe2": "Steinitz loads up on the e file, preparing a potent battering ram.",
        "15... Qd7": "Black is now forced to retreat. Time for Steinitz to start turning up the heat.",
        "16. Rac1 c6": "Solid looking, and it does sort of just feel right. But a subtle chink in the armor is detected by Steinitz. ",
        "17. d5": "!! The first move that sets up a combination that required incredible foresight. Steinitz opens up d4 for his knight.",
        "17... cxd5": "Black takes the bait.",
        "18. Nd4": "! Here comes the combination.",
        "18... Kf7": "Practically forced, as the pin was restricting just about all options black had. Disasterous was 18...Rc8 19.Rxc8  Qxc8 20.Qxe7#",
        "19. Ne6": "! In his personal notes, Steinitz called his knight \"A bone stuck in poor old Bardeleben's throat!\"",
        "19... Rhc8 20. Qg4": "!! Steinitz now has MULTIPLE threats, including winning the black queen with a discovered check!",
        "20... g6": "Absolutely forced according to Fritz. Forget about any thoughts of playing 20...Rxc1, as 21.Qxg7 Ke8 22. Qf8# comes quickly.",
        "21. Ng5+": "! Setting up a beautiful sacrifice that will follow once black retreats his king to protect his queen. Can you see it?",
        "21... Ke8 22. Rxe7+": "!! POW!! If he retakes with his queen, black loses all material because of the double attack on c8 which forces exchanges with vicious checks. Then the white knight simply mops up. If he retakes with his king, white plays 23.Re1  forcing 23...Kd8 which followed by 24.Ne6  which wins.",
        "22... Kf8": "Forced, and even a little devious. Black is hoping that white jumps all over his queen, so he can force a back row mate by playing Rxc1#.",
        "23. Rf7+": "Steinitz sees this, and just keeps right on hammering away. His threat against c8 is still alive and strong should black move his queen.",
        "23... Kg8": "Forced yet again.",
        "24. Rg7+": "Steinitz can dance this dance all night long...........",
        "24... Kh8": "Black obviously can't take the rook, as white responds Qxd7 . Kasparov called this \"a ridiculously easy win\" for white.",
        "25. Rxh7+": "In utter frustration, Bardeleben just stared at the board and let his time expire. A beautiful attack by Steinitz, where his opponent was literally doomed no matter what he played after move 22. I hope you have enjoyed it:) - Thomas"
    },
    "url": "https://gameknot.com/annotation.pl/the-pearl-of-hastings?gm=1474",
    "gameName": "The Pearl of Hastings",
    "players": "Wilhelm Steinitz  vs. Curt Von Bardeleben ",
    "opening": "Giuoco Piano (C54), Greco's attack"
}