{
    "moves": {
        "1. e4 e5 2. c3": "King's pawn Lopez opening.",
        "2... Nf6": "I attack White with an usual development move.",
        "3. f3": "Because of this move, White cannot bring his knights out at full power. Knights going to a3 and h3 are limited in power. Best if White cleared out c3 and f3.",
        "3... d5": "I attack the middle aggressively and usually. I normaly do the four knights, but since I'm not White, I have no control over the opening.",
        "4. Bd3": "Good news and bad news. Good news: Developement of a minor piece (finally); Bad news: Blocks in his other bishop. Apparently, White's light-squared Bishop is his most powerful minor piece.",
        "4... dxe4": "I wonder if White can do Bxe4 instead of his next move that he does?",
        "5. Be2 exf3 6. Nxf3 Nc6 7. Bb5": "White wins an extra pawn 7...Bd7 8.Bxc6 Bxc6 9.Nxe5.",
        "7... Bd7": "7...Qd4 does no better.",
        "8. O-O": "I wonder why he castled in a very unsafe shelter? This is probably how White messed up his game.",
        "8... Be7": "I could have done 8...Bc5+!.",
        "9. Ng5 O-O 10. Qc2": "Here, I was about to move my knight!! Instead, I found that Bishop check.",
        "10... Bc5+ 11. Kh1 Qe7 12. d4": "I predicted this move.",
        "12... exd4 13. Rf4": "13.Rxf6 could have won the game. I guess he wasn't watching where his Queen was positioned.",
        "13... Bd6": "13...g6 is a good move.",
        "14. Rf2 Qe1+": "I thought I won with this move, but that was me pretending that the Light squared Bishop was off the board.",
        "15. Rf1 Rfe8": "! ",
        "16. Rg1 Qe5": "! Threatening one move mate and his bishop.",
        "17. Nf3 Qh5": "Either I'm frantic to deliver checkmate, or I'm missing a bunch of good moves, because I forgot to take that FREE light squared bishop!",
        "18. Be2": "I am furious about that bishop that I forgot to take.",
        "18... Ng4": "Next move, 19...Bxh2 if he does not play 19.g3.",
        "19. g3": "I abhorred this move once I saw how it affected me. ",
        "19... Bf5": "I decided to take my vengeance on White's Queen!",
        "20. Bd3 Nf2+": "By the looks of this move, I was even foolish enough to let his Queen join the horrendous, frantic fight!",
        "21. Qxf2 Bxd3": "Finally! I captured his Bishop. That Bishop was probably mocking me ever since I forgot to take it with my Queen. ",
        "22. Nbd2": "22.Nfd2 is riskier than this move.",
        "22... Re2": "I bring my selfless rook into the Battle.",
        "23. Qxd4": "I can't believe it. White's letting his Queen down!",
        "23... Nxd4 24. Nxd4": "The end. I have three choices to mate him. #1: 24...Be4+ 25.Rg2 Bxg2# (If 25.Nxe4, 25...Qxh2#). #2: 24...Rxh2#. #3:do the exact move I do.",
        "24... Qxh2#": "A very frantic game indeed."
    },
    "url": "https://gameknot.com/annotation.pl/the-frantic-middle-game?gm=40036",
    "gameName": "The Frantic Middle game.",
    "players": "bbhollaway (1120) vs. chesskingdom64 (811)",
    "opening": "KP (C20), Lopez opening"
}