{
    "moves": {
        "1. e4": "This is a game from the Snowdragons team invitational tournament. By the time this game is played both players have resigned from the team already.  \r\nNevertheless Shakechess is the undisputed leader of the tournament with a 100% score. The 350 points rating gap also helps to keep white's expectations at a modest level...",
        "1... d6 2. f4 Nf6 3. Nc3 g6 4. Nf3 Bg7 5. d4 O-O 6. Bd3 Na6 7. O-O c5 8. Be3": "So far this opening was a Pirc (B07), but Be3 is not in the books.... The newspapers would write that Radboud had prepared this new move against his Angstgegner Shakechess....there is no lesser truth !!",
        "8... Ng4": "Admitted, Gameknot's 'game db' is a big help to come out of the opening reasonably against a higher rated player.",
        "9. Qd2": "Seems harmless still, but black is setting up a trap.",
        "9... Nxe3 10. Qxe3 cxd4": "The trap is to have white put his Queen and King on a diagonal. ",
        "11. Nxd4 Qb6": "Threatens Bxd4 to win the Queen. At the same time threatens at b2. \r\nOr, how you can own the center and still be in immediate trouble !!",
        "12. e5": "Cuts off the Bishop's diagonal. If Black decides to take on b2 then 13. Bxa6, bxa6. 14. Nd5 and White is still very much in the game.\r\n\r\nNote: Radboud's rating at this point = 1714, highest ever.",
        "12... dxe5 13. fxe5 Nc7 14. b3": "When I look at my position I like that I control the center, however with b3 that position is undermined, the Knight on c3 is not covered  and the Knight on d4 is weak being covered by the Queen on a diagonal with the King.... The pawn on e5 is badly defended too.",
        "14... Rd8": "Immediate threat is the Knight at d4. That piece is becoming black's target because it is pinned in front of the white Queen unhappily in the diagonal to the King. \r\n\r\nI looked at 15. Ncb5 but follows 15...., Nxc5. 16. Nxc5, Qxe3  or 16. Bxc5, Qxd4.\r\nI looked at 15. Rf4 to cover the Knight and develop an attack of my own, but those ambitions would quickly be killed by 15...., Ne6. ",
        "15. Nce2 Nd5 16. Qf3": "16......, Be6? 17. Kh1 to make the Knight on d4 free to move.\r\n\r\nWas Qg5 better? To save the pawn on e5.\r\n\r\nI am afraid of black's Nc3. \r\n",
        "16... Bxe5": "Wins the pawn and builds even more pressure on the Knight on d4.",
        "17. Qxf7+": "The idea is to get compensation for the material that is about to be lost on the center of the board.",
        "17... Kh8 18. c3": "Black later claimed that this move was the one losing the game for white, but really I don't see any way to save the Knight on d4. I think the position was lost earlier.\r\nMaybe 14. b3 was bad already, weakening the support in the center. 14. Rb1 was another option to save the b-pawn.",
        "18... Nxc3 19. Qxe7": "Is Nxc3 better? The idea of Qxe7 is to threaten Rf8 , Rxf8 and Qxf8  .",
        "19... Nxe2+": "With check, preventing Rf8 .",
        "20. Bxe2 Bxd4+": "Again check, preventing Rf8 .",
        "21. Kh1 Bf5": "Not 21...., Bxa1? 22. Rf8 , Rxf8. 23. Qxf8  .\r\n\r\nThis time without check, but Bf5 blocks the white rook on the f-file and connects the black rooks. If the game wasn't over yet then it is now.",
        "22. Rad1 Rde8 23. Qh4 Rxe2 24. Qxd4+ Qxd4 25. Rxd4 Rc8": "The remaining moves are played merely because both players are on-line, black agrees to play it to a finish.",
        "26. g4": "Move that Bishop so that I can have my f-file back !",
        "26... Rcc2 27. Rfd1": "27. gxf5? 28. Rxh2 , Kg1. 29. Rcg2  .\r\n27. Rd8  is pointless.",
        "27... Rexh2+ 28. Kg1": "The challenge is to find the mate...",
        "28... Rcg2+": "...without repeating positions 3 times...",
        "29. Kf1 Rgxa2": "Threatens Rh1  ",
        "30. Kg1 Rag2+": "As they say in Australia, try again mate.",
        "31. Kf1 Rgf2+ 32. Kg1 Rhg2+ 33. Kh1 Bxg4": "The Bishop comes to the rescue, without giving up d7. (But even if black gave up d7 it would take white too many moves to take advantage).",
        "34. b4": "Here we go for the finishing touch.",
        "34... Rgh2+ 35. Kg1": "forced",
        "35... Rfg2+ 36. Kf1": "forced",
        "36... Be2+ 37. Ke1": "forced",
        "37... Bd3": "37.... Rh1 ? 38. Kd2 and white escapes the mate..... (at the cost of material, but still, we are beyond that, we want to see checkmate).",
        "38. Rf4": "White refrains from Rd8 , Kg7, Rd7  because statistics on number of moves per game are not interesting.",
        "38... Rge2+ 39. Kf1 Rh1#": "Nice play by the italian master.....some team should sign this player soon !!"
    },
    "url": "https://gameknot.com/annotation.pl/the-snow-dragons-challenge?gm=18202",
    "gameName": "The Snow Dragons Challenge",
    "players": "radboud (1647) vs. shakechess (1927)",
    "opening": "Pirc defence (B07)"
}