{
    "moves": {
        "1. d4": "Troops line the battlefield. THE BATTLE BEGINS!",
        "1... Nf6": "The Knight of g8 leaps into the front lines, preparing for the Kings defense!",
        "2. Nc3": "His Knight of b7 sees this, and aims to control the center of the battlefield!",
        "2... g6 3. e4": "His minions advance onward through the night into a battlefield that will soon run red with the blood of peasants and noblemen alike!",
        "3... d6": "The mighty Yrahcaz's army continues to bolster their defenses!",
        "4. Bc4": "His noble Bishop of Light Square swiftly glides into the fray, staking his claim to the center of the battlefield!",
        "4... Bg7": "The castle is prepared and the king shall soon be escorted to safety!",
        "5. Nf3": "Lord Jpark further bolsters his control of the battlefield! How will the mighty Yrahcaz stand up to such a massive threat! ",
        "5... O-O": "The King retreats into his bulwark of Justice!",
        "6. Bg5": "His Bishop of Black Square prepares to do battle with the noble Knight of g8! What will become of the two noble Knight and his steed?!",
        "6... Nbd7": "Alas, the Noble Knight of b8 gallops to aid the Noble Knight of g8! Their blades cold to the touch, reflecting the icy conditions of their immediate extremities... such an unpleasant setting to do battle in! This field truly is comprised of incredible stalwarts!",
        "7. Qd2": "His queen leaps into the battle, her along with the Bishop of Dark Square eying down the h6 square! Back away evil succubus! Yrahcaz will not tolerate such a villain on his land!",
        "7... e5": "ADVANCE MY MINION! With the swiftness of leaping naked Mole Rat, my foot soldier leaps into the fray, contending the center of the battlefield! ",
        "8. d5": "ALAS! His foot soldier is not content to do battle, and continues forward! However, YOU SHALL NOT PASS SO EASILY!",
        "8... c6": "CONTINUE YOUR ADVANCE MINIONS! Battle will commence shortly!",
        "9. O-O-O": "His King is seen off in the distance retreating into the defense of the Mighty Rook. Such a powerful guardian! How will Yrahcaz be able to get past such a strong protector!",
        "9... cxd5": "AND THE FIRST BATTLE COMMENCES! DIE EVIL MINION!",
        "10. Nxd5": "His Knight of b1 leaps into the center of the battlefield, slaying one of my minions! ",
        "10... b6": "My minion advances, clearing passage for the Mighty Bishop of Light Square! Surely he will be able to strengthen the defenses of Lord Yrahcaz!",
        "11. Bh6": "His Bishop of Dark Square attempts to lure of my Bishop of Dark Square! ALAS, I SEE YOUR PLAN YOU DEVILISH ROGUE! It will take more than that to lure my officers away from their lord!",
        "11... Nxe4": "YOU HAVE LEFT YOUR MINION OPEN FOR ASSAULT! My noble Knight slays his e foot soldier and threatens his queen! BACK AWAY EVIL SUCCUBUS! ",
        "12. Qe3": "But the succubus is truly fearsome and advances! You will not seduce my Knight!",
        "12... Nef6": "My stalwart leaps away from the temptations of the evil succubus! TAKE YOUR WHORING ELSEWHERE! YOUR BLASPHEMY WILL NOT BE TOLERATED HERE!",
        "13. h4": "His minions continue their advance, readying themselves to storm my bulwark! ALAS, YOU HAVE MADE A GRAVE MISTAKE!",
        "13... Ng4": "MY KNIGHT RETURNS TO THE BATTLEFIELD! He prepares to do battle with both the opposing Bishop of Dark Square and the EVIL SUCCUBUS!",
        "14. Qd2": "His Queen is forced to retreat!",
        "14... Bxh6": "THATS ANOTHER OFFICER DEFEATED BY HUANG ZHONG!",
        "15. Ng5": "His Knight is forced to protect the queen! we've got them now!",
        "15... b5": "What is this?! My minion advances unprotected! Why does Yrahcaz order such a thing to happen?!",
        "16. Bxb5": "His Bishop of Light Square quickly slays my minion! alas, His Bishop of Light Square has strayed away from the a2-g8 diagonal! ",
        "16... f6": "This allows my minions to advance without a discovered attack on the king to commence! The mighty Yrahcaz threatens the capture of his Knight!",
        "17. f3": "Alas, this was not forseen...",
        "17... fxg5": "However, the exchange will commence!",
        "18. fxg4 Kg7": "My King advances, protecting his Bishop of Dark Square. A wise leader, AND A NOBLE WARRIOR! How will Jpark be able to contend with such prowess?!",
        "19. Kb1": "His king sees the danger, and retreats farther into his castle! WE HAVE THEM ON THE RUN!",
        "19... gxh4": "And with the might of a thousand raging warthogs, my minion stampedes into battle, his sword soaked in the blood and decay of all that oppose him!",
        "20. Qe1": "However, Jpark's queen and rook are both eying down my noble minion! ",
        "20... Nf6": "My Knight readies himself!",
        "21. Rxh4": "His Rook of h8 sweeps into battle! My minion battled bravely, but proved to be no match for such a well-trained stalwart...",
        "21... Nxd5": "My Knight leaps into battle!",
        "22. Rxd5": "and jparks defender glides into play! Both of his Mighty Rooks wreak havoc in the battlefield! But wait! They have left his back rank unattended! Can the mighty Yrahcaz exploit this?!",
        "22... Bd7": "Yrahcaz's Bishop of Light Square prepares to do battle with the opposing Bishop!",
        "23. Bxd7": "His Bishop of Light Square sweeps in, quickly ending Yrahcaz's own Bishop of Light Square! Surely yrahcaz's Queen shall avenge him!",
        "23... Qxh4": "But wait! What is this!? Why would she do such a thing! She has left herself vulnerable to an attack by the EVIL SUCCUBUS!",
        "24. Qxh4": "Mah lady is slain! NOOOOOOOOOOOOOOOOOOOOOOOO!!!!!! BUT WAIT, The Queens valiant sacrifice has left the back rank unguarded!",
        "24... Rf1+": "Yrahcaz's noble defender sees a passage to glory! He sweeps in!",
        "25. Qe1": "The EVIL SUCCUBUS returns to her post! IT IS TOO LATE!",
        "25... Rxe1+": "My Rook will not allow the EVIL SUCCUBUS to nullify the queens valiant sacrifice! WITH THE VICIOUSNESS OF A HUNDRED ATTACKING KITTENS WHO HAVE YET TO BE DE-CLAWED, MY ROOK STRIKES DOWN THE WENCH!",
        "26. Rd1": "His protector returns to the back rank, in a desperate attempt to thwart the impending onslaught! ALAS, WITH THE FORCE OF A RAGING CAMEL FULL OF WATER, HE TOO IS STRICKEN DOWN.",
        "26... Rxd1#": "It was an incredible epic! A glorious battle full of blood, bravery, and valiant sacrifice! In the end, The Mighty Yrahcaz claimed victory. The Defense was a success!"
    },
    "url": "https://gameknot.com/annotation.pl/the-glorious-defense-of-boo-radleys-apple-tree?gm=39315",
    "gameName": "The Glorious Defense of Boo Radley's Apple Tree",
    "players": "jpark959  vs. yrahcaz0729 ",
    "opening": "Queen's pawn game (A45)"
}