{
    "moves": {
        "1. e4": "King's Pawn Opening - my only repertoire as White. I have not run this through either GK or any other computer analysis as I would prefer to learn from my approach, so please comment wherever you think my analysis is flawed and tell me why. I'm not perfect - yet! :)",
        "1... c5": "Black responds with the Sicilian Defense, an opening that 1. e4 players must feel competent against due to it's popularity.",
        "2. Nf3 Nc6": "If Black had played 2... d6 instead, I would probably have continued with a Moroxy Bind with 3. c4, delaying d4 for later.",
        "3. d4": "I used to play some strange Anti-Sicilian methods like 2. b4? but have come to realise this is the best response for my style of play - and probably in general.",
        "3... cxd4 4. Nxd4": "A position reached for White in many variations of Sicilian's, with Black's second move being the variant of either Nc6, d6 or e6, in my experience.",
        "4... Nf6": "Developing his other knight with pressure on e4.",
        "5. Nc3": "I develop my second knight, defending the pawn and keeping a grip on e4 and d5.",
        "5... e5": "While this is still a Sicilian position, I'm happy to see this as it feels more like a position that I, as an 1. e4, would like to be in. I considered 5. Nf3, but it didn't appear to offer me much for the loss of time enforced on me. 5. Nb3 seemed a very solid choice, holding d4 and stopping Black's DSB from coming to c5. However, I went for the more adventurous...",
        "6. Ndb5": "... 6. Ndb5. An attacking move with the purpose of questioning Black's decision not to play a6, a popular move in most Sicilian systems for it's potential. My knight pressures the weak d6 square, seeming to force 6... d6. The d-pawn becomes a target on d6. The issue with my knight move is that it's going to be forced to a3 by the inevitable a6 pawn push.",
        "6... d6": "Holds the position for Black and provides support to e5.",
        "7. Bg5": "Creating a pin on the knight, White is establishing a stronger grip on e4 and d5. White's immediate threat being Nd5. ",
        "7... a6": "Black kicks away the dangerous knight on b5, and I think rightly so. If 7... Be7, 8. Bxf6 Bxf6 (or gxf6) 9. Nd5 O-O 10. Nbc7, in which White gets both his Knight's into enemy territory, holding quite firm and having plenty of potential.",
        "8. Na3 h6 9. Bxf6": "After Black questions 7. Bg5 with 8. h6, White takes on f6 with every intention of 10. Nd5, and kicking the queen or creating king-side weakness.",
        "9... gxf6": "Black makes the choice to take with his g-pawn - as White, I can't help but think that Black will be weak castling either side and try to make a conscious decision to attack the king where it sits now. After 9... Qxf6, 10. Nd5 Qd8, maybe Black would have been a little better, if still undeveloped.",
        "10. Nd5": "White quickly seeks the outpost on d5 attempting to hold many key squares on the board. It also opens up my queen side to allow a possible c3 to keep out the Black knight.",
        "10... Be6": "Black wants to dislodge the outpost made by White. I wonder if 10... f5 might have been stronger first, getting rid of the doubled pawn and pressuring e4.",
        "11. Nc4": "I've made six knight moves in my first 11 moves - I'm not certain they are all necessary. However, my knight on a3 was doing very little and could do with becoming involved in the action. Nc4 pressures both b6 and e3, threatening to make the outpost on d5 a permanent fixture.",
        "11... Bxd5": "Black eliminates the problematic d5-Knight",
        "12. exd5 Nd4": "I thought Ne7 here was best for Black supporting f5 and attacking d5, if slightly cramping. Black might be able to castle short here to relative safety.",
        "13. c3 Nf5 14. Qf3": "Upon reflection, I'm not sure this was best. Maybe 14. Bd3 might have been a better choice but I was worried about 14... e4. After Nh4 and Ng6, Black appears to cover most of his weaknesses.",
        "14... Ng7": "As I said in my previous comment, I think Nh4 was best here. 14... Ne7 15. Qxf6 Nxd5 (15... Rg8 16. Nxd6+ Kd7 17. Nxf7) 16. Qxh8 seems to be losing. If Qc8 or Qd7, 15. Nb6 forking Queen and Rook should win material. (15. Nb6 Nh4 16. Qxf6)",
        "15. Bd3": "Finally developing my LSB, wanting to hold f5. I'm aware of how dangerous f5 could be - that said, with the lack of mobility of the g7-knight and the position Black is in, maybe playing 15... f5 was best for Black here. He goes down a pawn but gives himself more play from the position.",
        "15... Rc8": "Black develops his a-rook to c8 and gives it a look on a half-open file. However, with c3, the potential of this move is limited. 15... Be7 or 15... f5?! would have been my choices.",
        "16. Ne3": "With the Black Queen seemingly tied to the defence of f6, I'm happy to move my knight to a more useful square. White has given up his hold on b6 and a5 for a lock down on the f5 square.",
        "16... Be7": "Black develops his bishop to e7 and finally releases his Queen from it's defensive duties.",
        "17. O-O Qd7": "I originally thought he was looking to use his Queen to attack on the king-side but with the knight on g7, I felt relatively safe of anything coming from that g-file, at this moment. It seems this was a defensive measure that stopped Qg4 and that I could possibly have played it earlier.",
        "18. Nf5": "This move leaves Black with very few options. Defending the knight via Bf8 at least puts White up the exchange 18... Bf8 19. Nxg7 Bxg7 20. Bf5 (20... Qc7 21. Qg4 O-O, and White doesn't quite win a piece). 18... Rg8 sacrifices the h-pawn. Castling loses to Qg4.",
        "18... Nxf5": "Black decides to take on f5, ridding him of his bad knight and, potentially, opening up the g-file.",
        "19. Bxf5 Qc7": "Reading a book would tell you that a bishop is worth 3 points and a rook is worth 5 points so, by definition, I should take the rook on c8 and be happy to be the exchange up. However, this is only a general rule. \n\nIn some positions, a positional sacrifice can allow you to open up files and diagonals to benefit from and therefore a rook might be sacrificed for a bishop. In this game, I believe that Black wants to give me the exchange in order to open up his game. That said, I think the power of my bishop on f5 far outweighs that of the rook on c8 - it's vantage point allows it to pen in the e and f-pawns, while blocking the king from getting to the 7th rank and watches over c8... For this reason, I sought to maintain it's power with...",
        "20. Qg4": "...20. Qg4. In hindsight, maybe Black would have preferred 19. Qd8 to keep his Rook on the half-open c-file. As it is, I have kicked it from c8 permanently and the King is locked into that 8th rank, stopping Black from connecting his rooks - moving the bishop to allow Ke7 still doesn't connect the rooks.",
        "20... Rb8": "As good a place as any, I think. Black might look to push to b5 and prevent c4, noticing the weak extended d5-pawn.",
        "21. Qg7": "Cramping black further by forcing Rf8.",
        "21... Rf8 22. Qxh6": "I thought about leaving that pawn for the moment and just remaining on the g-file. I considered 22. c4 or 22. b3, potentially giving up the c-pawn for control of the c-file. I wasn't totally sure it was sound so I decided to take the easy option.",
        "22... Qc4 23. Rfd1 Kd8": "Black looks to escape his king to c7 (and eventually a7, I imagine) in an attempt to connect his rook and pile them down my g and/or h-files.",
        "24. b3": "With the d-pawn defended and c-pawn too dangerous to remove, the Queen is kicked away.",
        "24... Qc5 25. Qe3": "With a pawn (with a set of doubled pawns) advantage, plus an outside passed pawn... I decided to offer a queen trade. I was a bit worried about how much trouble the rooks would provide if connected. Even with opposite coloured bishops, I felt I had enough of an advantage to convert a win if the queens were swapped off.",
        "25... Qxe3 26. fxe3 Rg8": "With Queen's traded off, he looks to pressure these half-open files. Given g4 can be played, preventing the h-pawn would probably have slowed White a bit.",
        "27. g4": "I feel the best way to respond is by pushing my pawns forward to make use of my advantage and try to force Black to defend with pieces.",
        "27... Kc7 28. h4": "Black connects his rooks while bringing his King to the queen-side action. In the meantime, White pushes his king-side pawns.",
        "28... Bf8 29. Kf2 b5": "While I'd pushed the king-side and moved my king into the game, this move left me wondering why I hadn't played c4 earlier. I felt now that I've made this quite a bit more difficult for myself.",
        "30. h5": "Continuing with my idea of getting these pawns as far up the board as possible to cause some headaches for Black.",
        "30... Bh6 31. Rdc1": "Putting my rook onto c-file, looking at how I can open up this queen-side to my advantage. It's worth noting that while Black's bishop is defending the king-side well enough, the g-rook just doesn't have any decent squares to find as of yet. ",
        "31... Kb6": "I thought Black might play 31. Rb7 and look to introduce his other rook on this side. I also wondered if e4 was an option for Black here... as it holds the King away and Black might be able to use the rook onto e8 and e5...",
        "32. a4": "Looking to create half-open files for my rooks.",
        "32... Kc5 33. axb5": "Opening up the a-file... after 33... Rxb5, my continuation was going to be 34. b4+ Kb6 35. Ra4 a5+ ......... or 34. b4+ Kc4 35. Rxa6 .......... or 34. b4+ Kxd5 35. c4+ Kc6 36. cxb5+ (and probably follow with 37. Rc8).",
        "33... axb5 34. c4": "Another attempting at opening up the c-file now, trying not to give Black any time get his pieces in better positions. Black loses if 34... b4 35. Ra5+ Kb6 36. Rca1, I think. If 34... bxc4, then White follows with 35. Rxc4+ Kb5 36. Bd3, threatening a potential Raa4-Rc6 mate. I felt that Black chose probably his best response in the situation.",
        "34... Rba8": "Challenging the a-file and offering to trade a rook each - which will only help Black - as with only opposite bishops left, this might be drawn. It's here when I really start to worry that I've let this slip and will only draw, even though I look better.",
        "35. cxb5+": "I've got the c-file open and going to look to pressure the open king and make use of my better positioned pieces.",
        "35... Kxb5 36. Bd3+": "Relinquishing my g-pawn defender to join my rooks knowing that I'll either get a rook to c4, or c6 after trading on a8. ",
        "36... Kb4": "36... Kb6 37. Rxa8 Rxa8 38. Rc6+ Kb7 39. Kxd6 looks to winning for White.",
        "37. Rc4+": "White is happy to give up his b-pawn now to expose the Black King completely. 37... Kb5?? 38. Rxa8!",
        "37... Kxb3 38. Rb1+ Ka2 39. Rcb4": "Using the checks I have to get the Black King onto the a-file and trap it there. It's up to White now to put his stamp on the vulnerable King. I should probably also mention that White has a forced draw, should he need it.",
        "39... Rgc8": "Preventing 40. Bc4+ Ka3 41. R4b3+ Ka2 (41... Ka4 42. Ra1#) 42. R3b2+ Ka3 43. Ra2#, as 40. Bc4+ Rxc4 41. Rxc4 Kxc4, and White has dropped his bishop.",
        "40. Rb4b2+": "I could have tried 40. R1b2+ here in the hopes of inducing the error Ka3... and just returning the position if Black played Ka1. However, I thought that would be a little obvious with no other threats.... and choice to save the threat for a later move.",
        "40... Ka3": "Forced.",
        "41. Rb2b6": "White is using the connected rooks here to good effect, using a windmill-esque pattern to threat mate in one with 42. Ra1. Ka2 is forced. I took a while to decide whether Rb7 or Rb6 was best here, but decided on Rb6 to threaten pushing the d-pawn.",
        "41... Ka2 42. Rb1b2+": "Checking on b2 now, offering Black the chance to make a mistake and play Ka3... which he does. Continuation I was expecting was 42... Ka1 43. Rd2 Rc1, fixing each rook to a-file and 1st rank respectively.",
        "42... Ka3": "A mistake from Black which results in, at least, White winning a rook and exchanging the other rook.",
        "43. Rb6b3+ Ka4 44. Bb5+ Ka5 45. Ra3+ Kb6 46. Bc6+": "All of these moves are forced for Black and we can see the rook dropping on a8.",
        "46... Kc5": "I think my opponent noticed that he was lost at this point and gave me an easy checkmate to end the game. Continuation as follows and most is forced, 46... Kc7 47. Rb7+ Kd8 48. Rd7+ Ke8 49. Rxa8 (pinning the Black Rook and forcing the exchange) Rxa8 50. Rxd6+ Ke7 (50... Kf8 51. Bxa8) 51. Re7+ Ke8 (51... Kf8 52. Bxa8) 52. Ra7+ picking up the Rook next move.",
        "47. Rc3#": "White traps the Black King in the middle of the board and mates him. I hope you all enjoyed the game and please leave your comments - especially if I have incorrect analysis. "
    },
    "url": "https://gameknot.com/annotation.pl/the-value-of-pieces?gm=45528",
    "gameName": "The Value of Pieces",
    "players": "gcah2006 (1798) vs. amorbg (1704)",
    "opening": "Sicilian (B33), Pelikan, Bird variation"
}