{
    "moves": {
        "1. d4 d5 2. c4 c6": "One of Flohr's favorite defenses against P-Q4. It keeps the Pawn position balanced and avoids blocking in the Black QB. ",
        "3. Nf3 Nf6 4. Nc3 g6 5. Bf4 Bg7 6. e3 O-O 7. Qb3": "White attempts to keep the Black QB tied down. ",
        "7... dxc4 8. Bxc4 Nbd7 9. Ne5 Qe8 10. Be2 Nxe5 11. Bxe5 Qd8 12. O-O Qb6 13. Qa3": "White resists the exchange of Queens. ",
        "13... Re8 14. Rac1 Bf8": "This mistake weakens the long diagonal. ",
        "15. Na4 Qd8 16. Rfd1 Nd5 17. e4 e6 18. Qf3 Nb6": "The Knight is driven away from the vital sector. ",
        "19. Nc5 Nd7 20. Nxd7 Bxd7": "Black has a fatal weakness on KB3, which White proceeds to exploit. ",
        "21. Bf6 Qa5": "If Black tries 21... B-K2, White has 22 P-K5! in reply. ",
        "22. Rc5": "A nice tactical shot. If 22... BxR, 23 PxB leaves Black facing both RxB and Q-K3-R6. ",
        "22... Qxa2 23. Rh5 e5": "Black has nothing better. ",
        "24. dxe5 Be6 25. Qf4 Qxb2 26. Bf1 Be7": "Avoiding 26... B-N2?? 27 BxB KxB 28 Q-R6 ch. ",
        "27. Qh4": "Missing the immediate win by 27 R-N1! Q-Q5 (not ...QxR??? 28 Q-R6!!!), 28 R-QN4!! Q-R8 29 Q-R4!! ",
        "27... Bc5": "Gaining a tempo by attacking White's KB2. ",
        "28. Rh6 a5": "The last hope for Black. ",
        "29. Rd3": "Threatening 30 R-KB3 followed by 31 RxRP. Black must now sacrifice a piece. ",
        "29... Bxf2+ 30. Qxf2 Qxf2+ 31. Kxf2 a4": "The White pieces occupy the holes at KB6 and KR6 with crushing effect. ",
        "32. Be2": "Black has no resources left. If 32... P-R6, 33 P-N4! P-R7 34 RxRP wins at once. Black's desperate sacrifice can only delay matters. ",
        "32... Ra5 33. g4 Rxe5 34. Bxe5 Bc4 35. Rdh3 Bxe2 36. Bf6 Re6 37. e5 Bxg4 38. Rh6xh7 Rxf6+ 39. exf6": "And Black resigns. "
    },
    "url": "https://gameknot.com/annotation.pl/the-judgment-of-salomon?gm=68058",
    "gameName": "The Judgment Of Salomon",
    "players": "Max Euwe (GM) vs. Salomon Flohr (GM)",
    "opening": "QGD Slav (D15), Schlechter variation"
}