{
    "moves": {
        "1. e4 e5 2. f4 exf4": "The King's Gambit is an aggressive opening for white, where sharp tactics and sacrifices tend to dominate play.  White weakens his own king's position with the idea of gaining a lead in development, a central pawn majority, and control of a half open f-file. The King's Gambit is an opening that will train your eye for tactics, and give you a feel for what can be accomplished with a material sacrifice.  Since these are probably the most important thing for beginning players to work on, the opening is well worth playing. ",
        "3. Bc4": "Typically, I respond with Nf3 as white, preventing Qh4+. Though this is still a decent response in terms of development.",
        "3... Qh4+": "As dangerous as this is for white, black has to play this position carefully. If black is not careful, he can lose his precious queen and be at a huge disadvantage.",
        "4. Kf1 b5": "!? - An interesting idea. Black gives a pawn to try and claim the center for himself.",
        "5. Bxb5": "A pawn white freely takes. ",
        "5... Nf6 6. Nf3": "! - A nice example of an important philosophy chess players need to advance: offense is the best defense. Yes the pawn on e4 is weak, but instead of worrying about this right away, white decides to chase away the black queen and in the process develop his knight. ",
        "6... Qh6 7. d3": "Defending e4 and opening up the other bishop to attack the weak f4 pawn. ",
        "7... Nh5": "Defending f4, but remember, the longer black tries to defend this position, the longer it will take him to develop.",
        "8. Nh4": "Attacking the knight and preparing to advance to black's territory. Since black still has a long way to go, attacking the weak kingside is a great idea",
        "8... Qg5": "Attacking the \"undefended\" knight.",
        "9. Nf5 c6": "Alternative: 9...g6 10. h4 Qf6\nI like this move though. Attacks an undefended piece in his territory. Though d6 and g7 are going to be big weaknesses for black to defend",
        "10. g4": "!? - White remains aggressive however, attacking the black knight. Makes black think twice about his next move. Black cannot take g4 via en passant, or his queen is lost, as are his hopes of winning this game.",
        "10... Nf6": "Responds to the attack with one of his own. g4 is now vulnerable unless...",
        "11. Rg1": "White responds correctly protecting the pawn with the rook instead of the pawn. ",
        "11... cxb5 12. h4 Qg6 13. h5 Qg5 14. Qf3 Ng8": "?! - Retreating the knight gives black a square for his queen to retreat to, but I like the alternative g6! here because the queen is not in immediate danger right now.",
        "15. Bxf4 Qf6": "My g6! idea would have the same result and the line I was looking at was the following:\n14... g6\n15. Bxf4! (White should take anyway) Nxg4 (Black responds and takes a weak defending pawn) \n16. Rxg4 Qxh5 (or Qf6)",
        "16. Nc3 Bc5": "? - Alternative: Qc6! Nd4 Qb6 Ncxb5 Na6 a4 Bc5",
        "17. Nd5": "! - A strong move that I feel really pushes the advantage white's way.",
        "17... Qxb2 18. Bd6 Bxg1": "?? - The killer move. It is from this move that Black's defeat stems. Wilhelm Steinitz suggested in 1879 that a better move would be 18... Qxa1+...likely moves to follow are 19. Ke2 Qb2 20. Kd2 Bxg1.",
        "19. e5 Qxa1+ 20. Ke2 Na6": "?? - Now with this move black effectively gives away the game. The position was still maintainable I think after 20...Ba6.",
        "21. Nxg7+ Kd8 22. Qf6+ Nxf6 23. Be7#": "A well played game and goes to show that material advantage means nothing in the game of chess. Until Black's severe blunders, he had a good chance to continue the game, maybe win with more solid play. Good effort from both sides though."
    },
    "url": "https://gameknot.com/annotation.pl/the-immortal-game-london-1851?gm=54183",
    "gameName": "The Immortal Game - London 1851",
    "players": "A. Anderssen  vs. L. Kieseritsky ",
    "opening": "KGA (C33), bishop's gambit, Bryan counter-gambit"
}