{
    "moves": {
        "1. Na3 e5": "Here is my first game played against Kerry Shirts using the so called Sodium Attack -- or Durkin Attack.  This is the opening move -- Knight to a3.  I've looked up this opening move on Chess.com, and most everybody hates it.  They say things that it was a stupid move.  Or it's hilarious.  However, it's not an attack so much as it is a feint. A Feint is defined as: \"a movement made in order to deceive an adversary; an attack aimed at one place or point merely as a distraction from the real place or point of attack.\"  Na3 is a feint on your opponent.  It's designed to lull your opponent into a false sense of security.  My opponent moved his king pawn to e5 following my feint.   ",
        "2. e4 Nf6": "Here, I moved to e4 and my opponent proceeded to Nf6.  First blunder in the main line for the Durkin Attack, but I am learning the Durkin Attack.  ",
        "3. Bd3 d5": "Here, I moved my bishop to support my pawn so I can move c3 to move my knight back.  My opponent does a central pawn thrust to d5.",
        "4. Qf3 Bxa3": "Here, I moved out my Queen, and my opponent ate my knight on a3.  I should have moved to c3 two moves before so I can tuck my knight out of safety.  However, I did not so I lost a knight.  And I responded with . . . ",
        "5. bxa3": "b2xBa3!!  I was mondo angry enough to eat a bishop.  CHOMP!  But it left me open on the b-file.  A severe weakness when you are playing an opponent that stresses use of your rooks in EVERY game.  ",
        "5... d4": "My opponent responds with a thrust with his central Q-pawn to d4. ",
        "6. Bc4 Be6": "Here, it's bishop versus Bishop.  I moved Bd3..Bc4, and my opponent moved his bishop to Be6. ",
        "7. Bb5+": "I quickly responded by putting my Opponent in check by moving my bishop to b5. ",
        "7... c6": "... my opponent defends by pushing his pawn to c6. ",
        "8. Ba4 O-O": "Here my opponent castles out of danger to get his king into safety.  I haven't castled yet, infact, I blundering in development here.  I haven't moved my Knight out and my black squared bishop hasn't been developed yet.   I am lagging behind in development in this point in the game.  My opponent has his rook developed, and his bishop and knight ready. ",
        "9. Ne2": "I finally get my other knight out by moving to Ne2.  I can now castle, however, I'm looking for targets now.  ",
        "9... Bg4 10. Qb3": "My opponent threatens my Queen, and I dodge her to to the b-file in order to prepare to take it with my Rook, stating that I own the file.  My opponent responds with . . . ",
        "10... b5": "A predictable move, as I planned it.",
        "11. Bxb5": "Which I promptly took.\n",
        "11... cxb5 12. Qxb5": "Which resulted in my Queen taking the pawn that attacked my bishop.  Yes, the sequence was a blunder, but my opponent also blundered. ",
        "12... Nbd7": "Here is where I start going on the offensive with my Queen.  He moved his Knight to d7.",
        "13. Qb7": "I moved my queen to b7. ",
        "13... Nxe4": "He takes a pawn, I am two points behind, but look where he took my pawn.  e4, and my Queen is on a diagonal to that square.  and so . . . ",
        "14. Qxe4": "I took his knight on e4, threatening his bishop. \n",
        "14... f5": "so, he threatens my queen and supports his bishop with a wonderful pawn outpost created by the f pawn. ",
        "15. Qd5+": "So, I moved to check my opponent's king. ",
        "15... Kh8": "He swiftly moves out of check. ",
        "16. a4": "I advance my pawn so I can develop my Bishop, finally. ",
        "16... e4": "My opponent does a pawn thrust. So far, he is looking to attack my centralized king, which is still in the center of the board. ",
        "17. Nxd4": "I promptly took his d4 pawn, which was undefended.  ",
        "17... Qf6": "He moved his queen to f6, as my opponent does his best to go through with his plan.  I still haven't moved my rook yet. ",
        "18. Qxd7": "I wanted to take his knight off the board first, so I am systematically destroying his power. ",
        "18... Rad8": "He responds by moving his rook to d8, to threaten my queen.  ",
        "19. Qxa7": "I responded by taking his pawn.  The next thing I know he did a scary move . . . ",
        "19... Rxd4": "By moving his Rook to d4 and taking my knight. It was at this time I developed my bishop. ",
        "20. Bb2": "By fiachettoing my bishop for preparations to attack that rook and take it out.  My opponent hesitated. ",
        "20... Rf7": "He moved his rook to f7. But he didn't know that my real target was his rook on d4. ",
        "21. Qxd4": "Which I promptly took in order to threaten his queen and invite him to take my queen in a queen exchange (which would have been to his advantage)..  But my Opponent blundered here. ",
        "21... Qg5": "He dodged his queen down.  Unfortunately. . . I fell into his trap!\n",
        "22. O-O": "By Castling and . . . ",
        "22... Bh3": "He moved his bishop to h3!  Brilliant!  It's checkmate in one move if I don't move a piece right. ",
        "23. Qd8+": "Check to the king!",
        "23... Qxd8": "My opponent takes my Queen, which delays checkmate.  So I had to  . . .",
        "24. gxh3": "take his annoying bishop, to prevent Checkmate once again.  But it left me wide open on the g file.",
        "24... Qxd2 25. Rad1": "He moved his Queen to take my pawn on d2, which means he's taking away potential queening pawns. I moved to threaten his lady. ",
        "25... Qg5+": "he moved his lady to g5, check to the King!",
        "26. Kh1": "I dodge out of Check moving to h1.",
        "26... h6": "He moved a pawn forward. ",
        "27. Bc1": "I promptly attack his queen with my bishop. ",
        "27... f4": "He pushes his pawn. ",
        "28. Rfg1": "I move to take the g-file for my own.  And soon, I'll own this file!",
        "28... Qc5": "He dodges his lady. ",
        "29. Rd8+": "Check to the King, moving Rd8. ",
        "29... Kh7": "He dodges his king down.  My target is his lady. ",
        "30. Rdd1": "I move my rook in retreat. ",
        "30... Qxf2": "He took a pawn that I was going to sacrifice anyway, but not this soon. ",
        "31. Rd2": "I made a gutsy move to take my seventh rank. ",
        "31... Qh4": "My opponent dodges his queen out. it's getting heated. ",
        "32. Bb2": "I move my bishop to prepare to take that g2 pawn, but I want everything set up correctly. ",
        "32... Qxh3": "His lady eats one of my own pawns but . . . ",
        "33. Rdg2": "I MOVE MY ROOK TO G2!  Doubled up rooks mean that I own this file!  ",
        "33... Qd7": "Finally, everything is ready!  I am going to take all of his power that he has left on the board all at once!",
        "34. Rg2xg7+": "Check to the King, ate a pawn. ",
        "34... Rxg7": "He ate my rook, no time to panic, I have him where I want him!",
        "35. Rxg7+": "Rook takes black Rook, Rxg7, Check to the King!",
        "35... Qxg7 36. Bxg7": "My Bishop takes Queen!!!",
        "36... Kxg7": "His King takes my bishop!  Now . . . it's up to who can queen first. ",
        "37. Kg2": "Obviously, I have no intention of letting him queen first.",
        "37... f3+ 38. Kf2 Kg6 39. Ke3": "I moved my King to a Centralized position.  I don't control the center directly, but . . . it's good enough to stop queening. ",
        "39... Kf5 40. a5 Kg4 41. a6 Kh3 42. a7 Kg2 43. a8=Q": "I finally promoted a pawn to a Queen. ",
        "43... Kxh2 44. Qg8": "I moved here to trap the King. ",
        "44... h5 45. c4 h4 46. Qg4 h3 47. Qxe4": "And at this point, he resigned. "
    },
    "url": "https://gameknot.com/annotation.pl/the-sodium-attack-is-a-feint?gm=41974",
    "gameName": "The Sodium Attack is a Feint",
    "players": "eltonj (1126) vs. kerryshirts (1400)",
    "opening": "Durkin's attack (A00)"
}