{
    "moves": {
        "1. e4 f5": "celebrating 4-20 with an inebriated opening choice. i'm going to improve on Swindler's variation in the Fred (1.e4 f5 2. exf5 e5?!) by investigating, like, totally peaceful developing moves before the e5 push is made. it came as a flash of inspiration while eating a bag of doritos with powdered donuts.\n",
        "2. exf5 Nc6 3. Qh5+": "i paused here to decide which developing move to make, and this gave white time to think. i believe this is what allowed 3. Qh5+. or maybe i'm just, like, you know.\n",
        "3... g6": "white envisions taking the rook two different ways (4...hxg6 5. QxR) or (4...Nf6 attacking the queen with 5. g6 NxQ 6. g6xR=Q)   \n",
        "4. fxg6 Bg7": "Bg7 isn't something expected, at least not at this rating level, so i prelude with a quick pause as if i've run through the variations and spotted something.  \n",
        "5. gxh7+ Kf8": "quick response needed\n",
        "6. Bc4": "white has taken the bait and is taunted into making a quick mate. the mainline is 6. h7xN=Q+ KxQ 7. Bc4+ e6, when white's queen is under attack, with undeveloped pieces. black is just starting his opening book, while white must develop into an unfamiliar position, having been taunted into thinking black is lost. such a taunted attacker in blitz most often loses as white in the mainline.\n",
        "6... e6 7. Nf3": "this threatens nf5 with mate on f7.\n",
        "7... Nf6 8. Qh3 d5": "indirectly attacking the queen.\n",
        "9. Bb5": "watch the queen charge in like a bull, yet look at how well my pieces coordinate.\n",
        "9... Rxh7 10. Qg3 Nh5 11. Qg5 Bf6 12. Qg6 Qe7 13. Bxc6 Nf4": "her safe squares are scarce.\n",
        "14. Qg3": "the queen is trapped, but she's seeing red.\n",
        "14... e5": "guarding the knight to take the queen.\n",
        "15. Bxd5": "the bishop eyes g8 for mate.\n",
        "15... Rg7 16. Qxg7+ Qxg7": "ah!\n",
        "17. g3 Nxd5": "white collapses in disgust. Fred's Swindle is a fun way to win blitz games for an average player. it's actually a fun way to lose as well, because it trains the ability to defend losing positions with an exposed king, which is helpful when you're a beginner like me, since most of my games start out in losing positions with an exposed king, especially when cartoons are on.\n",
        "18. O-O Bh3 19. Re1 Qg4": "no good sq for the knight.\n",
        "20. Nxe5 Bxe5 21. Rxe5 Qd1+": "white, who is rated about 1500, resigns as black's queen accentuates its lack of development. Fred's Swindle appears to need both timing and preparation. the taunting variations begin at move 5 or so, and as white is largely undeveloped, i think you could prep several moves, ready to capitalize on white's errors, as they need to spend more time in the unfamiliar opening to develop properly, but they will also be charging in like a bull toward your exposed king. they will make more errors under such double duress and you will have a fun time beating them or sustaining their attacks for 50 moves before losing. "
    },
    "url": "https://gameknot.com/annotation.pl/the-fred-swindlers-variation?gm=31021",
    "gameName": "The Fred - Swindler's Variation",
    "players": "NN (1495) vs. charlbroiled (1191)",
    "opening": "Fred (B00)"
}