{
    "moves": {
        "1. e4 Nf6 2. e5 Nd5 3. d4 d6 4. Nf3 Nc6 5. c4 Nb6 6. e6 fxe6 7. Nc3 g6 8. h4": "At this point I've been following the database for Alekhine's defence but, in retrospect, I think I should've taken five. I don't like this position at all, particularly having fallen (behind in material, having an ugly pawn structure, not having castled with a vacant e file devoid of White's pieces and generally development looking most un-king's pawn like. Consolation is the crampness of Black's position, with his knight's bottled up away from what appears to be the likely kingside site of action and the doubled pawns which close what would otherwise have been a dangerously open file. At the moment this seems like a competition between who has the least worst position. Next time I play against the Alekhine I think I'll move for something more Tipsy like. For now, however, I'll have to stick to the database and plug on. ",
        "8... Bg7 9. h5 e5 10. d5 Nd4 11. hxg6 Bg4 12. Rxh7 Qd7": "That move probably should have occured after the exchange of rooks as now Black has just sacced their Bishop. Possibly a mistake, Black may have viewed Rh8+ as inevitable and not realised that their dcb was vulnerable. Or possibly Black is deliberately making the sac, gaining the open h file to link up with the collapsed kingside it is about to force through 13... Bxf3. However, White hasn't castled so the collapsed kingside isn't the death it would be had White castled short. Additionally, the rook can get back to h7 to occupy the open file. Overall, I wouldn't class White as ahead by the full 4 given Black has a shorter route to castling long (if that makes sense :) ) but hell, I'll take it!",
        "13. Rxg7": "Nom nom nom. Black will probably further collapse the kingside now but me no care. Black has better position but I don't think it's over 4 in material better position which is what it would have to be to justify that bishop sac. Could be wrong. We'll soon find out! :) ",
        "13... O-O-O": "Oh dear. Not the time to be castling. Bxf3 should have been the move here. The positional advantage of having the shorter route to castling long has, paradoxically, been lost by Black doing exactly that. That's chess; a good move too early or too late becomes a mistake!",
        "14. Be3": "Pressure building...",
        "14... Qf5": "Black again fails to pull the trigger on an exchange, first the rook then the bishop for knight. This will put White up a full rook's worth in material at the end of this and Black has no positional advantage to compensate. In short. Black is like a 500 year old oak tree. Well rooted. :D",
        "15. Nxd4": "Nom nom nom. This is turning into a game of Pac-man! Pawn to recapture and Qxd4 to get itself out of the noose and to fill up on a loose pawn. Speaking of loose pawns e7 is also weak. ",
        "15... exd4 16. Qxd4": "As predicted. I can't see a good move for Black. Perhaps retreat; it still has power pieces a plenty, gather them all round the king and make a defiant last stand, hoping for an error in the meantime. Pawn to e5 maybe for a defensive jab to give it time to achieve this end. c5 another option. ",
        "16... Rh1": "And then there's that. Instead of retreating Black goes on the attack. But, as I've pointed out earlier, the king isn't castled and so Black cannot construct a credible threat on the kingside. Here the bishop is pinned but so what? The e7 pawn has been left wide open and White can snaffle yet more material, whilst also gaining the e file. The game of Pac-man continues.",
        "17. Rxe7": "Black has been making a run of mistakes but surely they won't fall for that g pawn trap. 17...Qxg6?? 18 Rg7! and it's curtains for the dcb. ",
        "17... Rdh8": "Well it's still curtains for the dcb. Black lurches from mistake to mistake like a drunk trying to navigate their way to bed via their lounge room furniture. Not that I'm speaking from experience or anything! :) ",
        "18. f3": "Bishop MUST sac and capture the f pawn, Black loses bishop for two pawns. Bishop could also stay where it is, I guess, and Black loses bishop for nothing. But Black cannot move dcb to h file otherwise it's mate in 2. ",
        "18... Bxf3 19. g7": "Threatens mate, forces Rg8, which breaks up the doubled rooks and moves pawn one closer to promotion. After this the bishop sac is completed. Qxf3 may look menacing but Bg1 cuts off the rook from capturing the f bishop and the kingside threats remain toothless. Not the least because Black has had 6 of their teeth knocked out! ",
        "19... Rxf1+": "Unexpected. I'll have to hand it to black here, for attempting, through sheer aggression, to get back to near parity. Lines such as: \n20.\tKxf1\tRh1+\n21.\tKf2\tBxd5+\n22.\tQf4\tQxf4+\n23.\tBxf4\tRxa1\n\nGet Black back to +1 though, of course, White would be erring with such play. Still, better players have made mistakes once their king was under \"pressure\". I put pressure in quotation marks since, as I've been saying all along, Black's ability to meaningfully threaten White's king here is an illusion....",
        "20. Kd2": "...unlike White's ability to threaten Black's king. White's king dances away, as troubled by the check as an oak is troubled by ants crawling all about its mighty branches. The mate in 2 is still in play and Black must sac its rook, losing more material.  ",
        "20... Rf2+": "Black's gallant heavy cavalry charge is over and the King remains unscathed. The Rook sac is now the bloody end to this bold but futile attempt to recover Black's losses. At this point Black admits they had a few when moving 12...Qd7?? Well...at least they were enjoying themselves! :) ",
        "21. Bxf2": "Qg5+ expected reply. ",
        "21... Qg5+ 22. Qe3": "I hesitated a little before this move because Nxc4+ forks king and Q. But it really doesn't matter due to that mate in 2 still in play. After 22...Nxc4+, 23. Kd3 Nxe3?? 24. gxh8+!! So the fork continues the trend of Black's attacks lacking teeth. ",
        "22... Nxc4+ 23. Kd3 Qf5+": "Another blunder. King takes knight. And shortly thereafter, pawn will take bishop. Remember all the way back at 16 when I said Black should have withdrawn, that the game was lost but at least they could make a last stand? That's really what Black should have done. ",
        "24. Kxc4": "Looking at rating we see Black's is artificial: 11w-1d-0L from their entire 12 matches on gameknot. Looking at this game we see Black's true ability lies perhaps somewhere closer to the 1300s as they are making a complete mess of this match. Black is finally getting taught a good chess lesson! Cheap rating points for the Tipsy! :) ",
        "24... b5+ 25. Kxb5": "I said it before, I'll say it again. This isn't chess. This is Pac-man. Black continues nuisance checks and White continues gobbling up pieces. Only one more check left, with either the c or a pawns, and the White King will probably move to c6, placing it in an uncheckable position and clamping down on the black king's movement. ",
        "25... Be2+": "Okay, 2 more checks left. ",
        "26. Qxe2": "Nom nom nom. Smashing this game of pac-man! ",
        "26... c6+ 27. Kxc6": "Like I said, no more checks so Black finally resigns. Pity. I was hoping to see just how much in material I could be up ere the end of the game! :) "
    },
    "url": "https://gameknot.com/annotation.pl/the-man-who-broke-the-bat?gm=59796",
    "gameName": "The Man Who Broke the Bat",
    "players": "tipsyjourneyman (1607) vs. batman44600 (1772)",
    "opening": "Alekhine's defence (B04), modern variation"
}