{
    "moves": {
        "1. d4": "Petrosian's move of choice. His style looks similar to Botvinnik but unlike his great predecessor, Petrosian had a very deep tactical vision.",
        "1... Nf6 2. Nf3 e6 3. Bg5 d5 4. c4 c6": "Black wants to play a Semi-Slav or the very Sharp Botvinnik variation.",
        "5. Qc2": "White develops his Queen early, which is not uncommon in the QGD. This square is particularly useful is you plan on exchanging on d5 and preventing an early Bishop sortie to f5.",
        "5... Be7 6. e3 O-O 7. Nc3 h6": "Black wants to resolve the pin. This is usually a good move since in some lines there are some tactics on h7, winning that pawn. There is a small downside however, in case White plays the exchange variation and castles long, the h-pawn might speed up White's pawn storm on the K-side. There are many subtleties like this in the QGD and it's very difficult to spot them if you don't have enough experience with the opening. Memorizing lines isn't enough.",
        "8. Bf4": "The most elastic move. White doesn't want to hand over the Bishop pair so early on in the game and he doesn't want to retreat to h4, which would make Black's task of equalizing easier since he would enter normal positions of the Orthodox Defense, where White's Queen isn't optimally placed on c2.",
        "8... Nbd7": "A very normal move and it's very hard to find anything else for Black. The problem is that once this Knight has developed, White can take with much more confidence on d5, since taking with the e-pawn leads to normal positions where White can choose between the minority attack and castling long, while taking with the c-pawn is inferior because the Bc8 is still a problem and c6 isn't available for the Knight.",
        "9. cxd5": "Waiting no more, White exchanges on d5. The exchange variation of the QGD is a very dangerous weapon, especially in the hands of a strategist like Petrosian.",
        "9... cxd5": "Unzicker was fearful of normal structures that would have resulted after recapturing with the e-pawn, after which the Qc2 and the Bf4 make perfect sense, so he recaptures with the c-pawn. White is unable to play the minority attack nor is castling long a good alternative. The problem is that Black doesn't have a good plan himself in this structure. Let's examine the other two possible recaptures. Taking with the e-pawn can lead to the following sequence of moves 9...exd5 10. h3 (preserving the Bf4 and preparing the pawn storm) Re8 (the standard plan for Black who doesn't have many squares to shuffles pieces around) 11. Bd3 (one of the reasons why The Exchange variation is good for White is that his pieces develop on optimal squares) Nf8 (making room for the Bc8 to come into play) 12. 0-0-0 (burning all bridges, but thanks to Black's 7th, White can be optimist he'll crash through first). I guess this was the position Black wanted to avoid in recapturing with the c-pawn. But there is another recapture possible, with the Knight. After 9...Nxd5 10. Nxd5! exd5 11. Bd3, White can play his second plan, the minority attack, which is very hard to meet and the missing pair of Knights favor White because Black has fewer attacking chances.",
        "10. Bd3": "Normal development. White's plan in this position is to use the c-file for infiltration and reduce Black's counterplay to zero. ",
        "10... a6": "A strategical error. Never move pawns on the flank where you are weaker and this game proves it tenfold. The reason behind this statement is that any pawn moves create weaknesses and your opponent will have something to target. However it's very difficult to find a working plan for Black, Unzicker must have been wanted to prevent Nb5 and try to resolve his Bc8 somehow.",
        "11. O-O": "White is in no hurry, Black can't contest the c-file any time soon. 11. h3 would have been an alternative but Petrosian must have not been afraid of losing the Bishop pair and wasn't in a hurry to weaken his castled position.",
        "11... b5": "Would you believe that after this move Black is lost? He has just created permanent weak spots on the c-file while giving his opponent a target in the b-pawn. The only sensible looking alternative was 11...Nh5 but even after that White has the strong reply 12. Be5! Nxe5 (12...f6 fails to 13. Nxd5! fxe5 (13...exd5 loses after 14. Bh7+ Kh8 15. Bc7 Qe8 16. Bg6 Rf7 17. Bxh5 and White has won the piece back and will soon win the exchange as well) 14. Nc7 exd4 15. Nxd4 Ne5 16. Bh7+ Kh8 17. Nxa8, these tactical variations show the hidden dangers in Black's cramped position) 13. dxe5 and Black has two bad pieces, the Bc8 and the Nh5.",
        "12. a4": "Very impetuously played by Petrosian. He takes advantage of the pin on the a-file and force Black to further advance his pawns. ",
        "12... b4": "Forced or else Black loses a pawn. He can't afford to open the a-file because the a-pawn will be very weak and cannot stand for long.",
        "13. Na2": "Stronger than 13. Ne2, this Knight is heading towards b3.",
        "13... Ne8": "Perhaps not the most active plan of defense mainly because White could have played 14. a5! and the pawn is immune because of Qc8. But both these players had already formulated the plans after which they would arrange their pieces and were staying on-course. ",
        "14. Nc1": "Consistent to the previous move.",
        "14... a5": "Black secures the pawn structure on the Q-side and prepares to exchange a pair of Bishops.",
        "15. Nb3": "Petrosian was a great admirer of Nimzovitch and was no doubt pleased to have setup an early blockade against the Q-side pawns.",
        "15... Ba6": "Black solves his bad piece but in the process has created further more insolvable problems.",
        "16. Bxa6": "This should be a good lesson, if your opponent has weaknesses, don't be shy to exchange pieces. In the endgame, weak pawns fall much faster than in middlegames. ",
        "16... Rxa6 17. Qd3": "Using the undefended position of the Ra6 to secure the c-file.",
        "17... Ra7 18. Rfc1 Nd6": "Heading for either c4 or e4.",
        "19. Bxd6": "No qualms over the superiority of Bishops over Knights. In structures like these, where there is only one open file on the board, the center in locked and you control that file, Knights are much better than Bishops.",
        "19... Bxd6 20. Rc6": "Petrosian wants to double the Rooks with tempo.",
        "20... Nb8": "Forcing White to retreat the intruder, but Black has wasted a tempo here. More sensible was 20...Nb6.",
        "21. Rc2 Nd7": "The Knight wasn't doing anything on b8.",
        "22. Rac1": "White has doubled Rooks and now must start attacking. Generally, if your only advantage is an open file, then that won't be enough to secure victory. Your opponent will either find a way to exchange Rooks and simply defend everything. So from a strategic viewpoint, once you have an open file, it's time to create new targets of attack or at least provoke your opponent into creating weaknesses that he can't defend. Look at this position. White stands better, but he isn't winning. There are no concrete targets to attack. Black has a small space advantage on the Q-side, which is enough for him to regroup his pieces and defend, albeit passively. White has to use the dominance on the c-file in other ways.  ",
        "22... Nb6": "Aiming for c4 and attacking a4. Since controlling the c4 square with a pawn is possible only by removing the blockading Nb3, White contests it with a piece.",
        "23. Qb5": "Since Black doesn't have his LSB anymore, the light squares are the perfect point to infiltrate on the Q-side.",
        "23... Nc4 24. Nfd2": "This Knight wasn't very active on f3, so White exchanges it off.",
        "24... Nxd2": "Retreating would have meant loss of all prospects for this Knight, so Unzicker rightly swaps it off. Sometimes it's better to exchange pieces, even if your position is worse, than retreating that piece to a passive square.",
        "25. Rxd2": "Since Black can't contest the c-file, this is a safe recapture.",
        "25... Qa8": "Black's alternative defense plan would be to exchange Queens and go for a passive defense, while allowing White his supremacy on the c-file. This might have put a more stubborn resistance but very few players like passive positions. ",
        "26. Rdc2 Rd8 27. Rc2c6": "White can't win anything on the Q-side. Black can defend everything and he's not going to run out of moves. So it's time to change the plan.",
        "27... g6 28. g3 Kg7 29. Kf1 Kf8 30. h4": "First, placing all the K-side pawns on the same color as his opponent's Bishop. This is an important point in endgames, where many beginners place their pawns on opposite color squares, so that the pawns will be safe from capture. This is a mistake, with one notable exception, opposite color Bishop endings, because you want to use your pawns to restrict the Bishop's movement. Petrosian knew this and moved his pawns accordingly.",
        "30... h5": "Unzicker knew this as well and move his pawns to the opposite color squares as his Bishop, so that the pawns will control the light squares and his Bishop the dark ones.",
        "31. Rc1c2": "Preparing for a brave plan. White has seen that things have stalled on the Q-side and that action is needed elsewhere. So he rightfully judged that he can move his King to the Q-side, where it will be perfectly safe and start attacking on the K-side. Black doesn't have that option, since his King wouldn't make it past the c-file. A brilliant concept by Petrosian and something to remember in case you run out of ideas.",
        "31... Kg7 32. Ke1 Kg8": "Not that Black can't start active plans because Petrosian has placed all his pieces on optimal squares to prevent this. All he can do is sit and watch the march of the White King, knowing undoubtedly what is coming next. ",
        "33. Kd1 Kh7 34. Kc1 Kg8 35. Kb1 Kh7 36. Qe2": "Time to start attacking the K-side.",
        "36... Qb7": "Black needs to activate his pieces before it's too late.",
        "37. Rc2c1": "Preparing to swing the Rook to the other side of the board.",
        "37... Kg7 38. Qb5": "Offering a Queen swap that Black dare not accept. This is another advantage to having the King on the Q-side, he can act as a blockader to Black's pawns in case an endgame is reached.",
        "38... Qa8": "Forced, after 38...Qxb5 39. axb5 a4 40. b6 Rad7 41. Nc5 Bxc5 42. dxc5, the endgame is won particularly because White can hold off the passed pawns with his King. Here is an instructive sequence: 42...b3, trying to limit the White King, 43. Rd1, with the notion of coming to d4 and b4, and also making room for the King, 43...e5, stopping one idea, 44. Kc1, but not the other and the King marches to b4 and wins the Black pawns.",
        "39. f4": "Gaining space on the K-side.",
        "39... Kh7": "Black has to stay passive, trying to blockade the pawns with 39...f5 fails to 40. Rb6 Kh6 41. Rcc6 Bc7 42. Ra6 Rxa6 43. Rxa6 Qb8 44. Nc5 and Black's Q-side crumbles",
        "40. Qe2 Qb7 41. g4": "Probably the sealed move. Back in those days, games were adjourned at move 40 and play would continue the next day. This also explains why Petrosian didn't hurry before with his plan, he wanted to analyze at home before playing it on the board.",
        "41... hxg4": "Black is forced to open the lines around his King.",
        "42. Qxg4 Qe7": "I'd like to take this moment to commend Unzicker's defensive play. Many modern Grandmasters would have lost their temper by now and blundered away their position. But in those days, defending was an art, alongside attacking. Modern Grandmasters have lost the capability to defend positions like this, they don't like to suffer in passivity and would rather risk an unsound counterplay than submit to shuffling their pieces around. ",
        "43. h5": "The second assault on the Black King.",
        "43... Qf6": "Good defensive move, Black intends to exchange Queens with Qf5+ or Qxg6+ in case White exchanges pawns.",
        "44. Ka2": "The King is now secure and attack can continue.",
        "44... Kg7": "Removing the King from the dangerous h-file.",
        "45. hxg6 Qxg6 46. Qh4": "White has no intentions of swapping Queens. This retreats with tempo, hitting the Rd8.",
        "46... Be7": "Black brings another piece into the defense of his bare King.",
        "47. Qf2": "Threatening Rg1. Black's pieces don't coordinate well and his King is still very exposed.",
        "47... Kf8": "Trying to find a secure refuge out of the two open lines on the K-side.",
        "48. Nd2": "A slight inaccuracy, 48. Qh2 would have been more forceful. It's very instructive that because of the weak King, Black can't defend the Q-side properly, for example 48. Qh2 Ke8 49. Rc7 Rxc7 50. Rxc7 Ra8 (defending a5) 51. Qe2! Kf8 52. Qb5 Bd8 53. Rc1! Be7 (forced, or else Qb7, winning the Rook) 54. Qb7 Re8 55. Rh1! (taking another poke at the Black King) Bf6 (making room and defending h8) 56. Nxa5 Qg2 57. Qxb4+ Kg7 58. Rc1 and White is two pawns up.",
        "48... Rb7": "With the idea of b3+.",
        "49. Nb3 Ra7": "Repeating the position, but there is no other way of defending a5.",
        "50. Qh2": "White finally breaks through. See my commentary on move 48. ",
        "50... Bf6": "Black chose another defense. It's still insufficient. Petrosian plays very accurately and gives no more second chances.",
        "51. Rc6c8 Rad7": "51...Ra8 doesn't work either after 52. R8c7 Bg7 53. Nc5 Qh6 54. Qg2 Rd6 55. Rh1 Qf6 56. Nd7+ Rxd7 57. Rxd7 and with an exchange up and very active pieces, Black can't last much longer.",
        "52. Nc5": "The Knight finally comes to the c5 square and what a great moment for it.",
        "52... b3+": "A spite check but a harmless one.",
        "53. Kxb3 Rd7d6 54. f5": "A double attack, the Rd6 isn't defended, the Rd8 is pinned.",
        "54... Rb6+ 55. Ka2": "Black resigned. After 55...Qxf5 56. Nd7+ wins a full Rook. A remarkable game by Petrosian."
    },
    "url": "https://gameknot.com/annotation.pl/the-boa-constrictor-in-action?gm=30419",
    "gameName": "The Boa Constrictor in action",
    "players": "Petrosian (?) vs. Wolfgang Unzicker (?)",
    "opening": "Queen's pawn (A46), Torre attack"
}