{
    "moves": {
        "1. e4": "She also likes to open with the King's Pawn Opening, and I understand that because this is also my favorite.  In addition, this is the most common opening.",
        "1... c5": "As usual, I enjoy opening with the Sicilian Defense.",
        "2. f4": "I do not know why she played this.  Afterall, this is not the, \"cornerstone\", of the Open Siclian, Closed Siclian, or Morra Gambit.  In my opinion, she is probably trying to develop her LSB immediately.",
        "2... a6": "Normally, I would play d6 immediately, and that is the traditional method of continuing the Sicilian.  However, 2.f4 was played, so I am worried that she will try to cause damage with her LSB on the 5th rank (respond with 3.Bb5+), if I play 2...d6.  That is why I played this move.  Note: I am thinking of a bunch of transpositions, and this is one of them, in my opinion.  How will things transpose?  That will be answered a little later.",
        "3. Nf3": "Unless she is trying to develop, I do not know why she moved there.  As I had mentioned earlier, this is no longer a Closed or Open Sicilian.",
        "3... d6": "In the meantime, I decide to continue with my defense.  BTW, this why the position has transposed, with the opening.  Note: For the Siclian, 1.e4, c5 2.Nf3, d6, followed by 3...a6 (if not 3.d4) , or 1.e4, c5 2.Nf3, d6 3.d4, cxd4 4.Nxd4, is played.  Therefore, this is not my normal routine.  If this is not a transposition, it is an anomoly.  Anomoly=different, out of the ordinary.",
        "4. Nc3": "! She decides to develop her other knight, and I understand that because development is essential.  In addition, I know this position very well.   In the past, I have developed with both of my knights, in the beginning. ",
        "4... Qa5": "In this position, I do not think or care about General Opening Principles.  Afterall, I do not see how she can chase my queen away immediately.  She can only do this with 5.b4, but then 5...cxb4?!, or 5...Qxb4!!.  However, 5...Qxb4 is best because it still wins a pawn but without wasting time.  Other then that, my queen is safe, for now.  At this point, I am planning a strategy that will eventually win material, but this strategy is a little premature, in my opinion.  In addition, this plan will eventually cause me to loose.  This will be explained later on.",
        "5. Bc4": "! At this points, she develops her LSB in order to castle.  I originally thought that her LSB was not well placed, but 5.Bb5+? is not feasible due to my a6 pawn.  As I had mentioned earlier, that is why I played 2.a6. ",
        "5... Nh6": "I was also thinking of 5...b5??.  Originally, I did not think that this move was as good, but 5...b5 would end the game.  How would this happen?  Stay tuned.",
        "6. O-O": "!? In the meantime, she decides to castle, but this is a mistake, in my opinion because it exposes her king.  How is her king exposed?  One of her pawns is open near the king.  BTW, I am referring to her f pawn.  Having said that, there are supposed to be three pawns that keep the king protected and closed in.  If one of them are open, the king is open, so it is exposed.",
        "6... Bg4": "?! At this point, I decide to pin her knight because it is extremely dangerous, in this position.  How is it dangerous?  I originally thought that she would win my f7 pawn and h8 rook.  However, I did not realize that my rook was protected by the knight on the rim, until now.  Most importantly, she can and will break the pin, easily, with her Queen.",
        "7. Qe1 Qb4": "?! At this point, I decide to attack her LSB.  Note: I am not trying to gain tempo, but I want win a free piece.  Although this move is not bad, it is a waste of time because she will protect it with 8.d3.  My attitude and thought process, on the other hand, is a serious mistake that will eventually cause the loosing blunder.  It is a matter of time before this happens.",
        "8. d3 g6": "I decide to advance my g7 pawn, so that I could develop my DSB.  However, she has another trick up her sleeve.  What is her trick?  That will be answered shortly.",
        "9. a3": "?! She decides to attack my queen, but I can retreat and protect it.  Therefore, I believe that this move wastes time, if she is trying to win my queen.",
        "9... Qa5 10. Bd2": "I think that she probably moved her piece for further development, but I do not completely understand this concept.  Afterall, her DSB is blocked by the f4 pawn.  Therefore, it does not have a lot of room to maneuver.",
        "10... b5": "?? This is what I had planned, since move 5.  In fact, I talked about this move and was obsessed with it, since my fifth move.  Why did I want to play this?  I thought that I would win a free bishop.  However, this is my loosing blunder, and it looses very quickly.  The game is lost because of what happens, from here on in.  In other words, what you will see from now, until the end, will prove that I do not have a chance. ",
        "11. Nxb5": "Therefore, she takes advantage by winning my pawn and attacking my queen.  Consequently, I cannot exchange my pawn for her knight.  If 11...axb5, 12.Bxa5, Rxa5 (loosing my queen, for her rook).  As a result, I must protect my queen and give up the pawn.  Having said that, this is just the beginning, so it will get much worse.  As I had mentioned earlier, the game is lost for black.  However, I do not want to give up, yet, because there is always hope, until the end.  As they say, \"It ain't over, til it's over\".  In fact, I want to stay in, until I know that I'm going to loose.",
        "11... Qb6 12. Ba5": "At this point, she decides to launch another attack, against my queen.",
        "12... Qb7 13. Nc7+": "After I protect my most important piece, she responds by forking my a8 Rook and King.  As a result, she is going to win a free rook, after I get out of check.  Why can't I exchange her rook for my knight?  I will be placed in another check, after she takes.",
        "13... Kd8 14. Nxa8+ Kd7 15. Nb6+": "?! At this point, I do not know why she placed me back in check.  I think that she is trying to trick me into taking her knight, so that she could win my queen.  This is called Reversed Psychology.  With Reversed Psychology, you are trying to trick your opponent by encouraging him or her to do something that you normally would not want.  Having said that, I also view Deflective Sacrifices as a form of Reversed Psychology.  However, I am not going to fall for her trick.",
        "15... Ke8 16. Qc3": "In this position, she is clearly trying to win my rook, but I am not going to allow this.",
        "16... Rg8 17. Qb3": "I do not know what this is going to accomplish.  For some reason, she wants to check me, again.  I think that she is trying to use a, \"Scare Tactic\", but I do not get overwhelmed easily.",
        "17... Rg7": "I figured that she would try to check me with 18.Bxf7+, so I was determined to stop her plan.  However, she had other plans that I was unaware of.  She will also find another way to check me, and I am also caught off guard.  On other hand, it will not bother me.",
        "18. Qa4+ Nc6": "That is because I get out of it with my Knight, instead of the King or Queen.  This is how some of my other opponents stopped my plans, after placing them in check.  They defended with other material, instead of the King or Queen.",
        "19. Bd5": "However, this turns out to be another serious check, not a nuisance, because my knight is now pinned, as a result.  ",
        "19... Qa7": "? I did not want her to attack my queen, so I decide to move it.  However, this is a mistake because she will win another free piece, by capturing my knight and placing me in check.",
        "20. Bxc6+ Kd8 21. Nd7+": "I had no idea that she would check again.  Afterall, this is a discover check, and discover checks usually catch me by surprise.  That is why I view them as the most dangerous types of check.  In addition, this is also serious because she will win another free piece, my DSB, after I get out of it. ",
        "21... Kc8 22. Nxf8 Kb8": "?? I moved my king because I thought that she was trying to find a mating pattern with her LSB, DSB, and f8 knight.  However, this moved just made her plan, realistic.  In other words, her plan is going to work because of this played move.  ",
        "23. Bd7": "Because she is going to mate me, my hope is gone, so I do not stand a chance.  Afterall, I now know that I am going to loose, and there is no way around it, at this point.  Therefore, I resign.  In chess, you should wait for opportunities to arise, instead of attacking or chasing pieces.  That is how you are going to win material, and it is the right way to do it.  More often then not, you are not going to win material by attacking them.  In some cases, it will cause you to loose, and that was illustrated, in this game.   "
    },
    "url": "https://gameknot.com/annotation.pl/the-right-way-to-win-material?gm=45452",
    "gameName": "the Right Way to Win Material.",
    "players": "jstevens1 (1897) vs. jkarp (1072)",
    "opening": "Sicilian (B21), Grand Prix attack"
}