{
    "moves": {
        "1. e4": "Hi guys. I played this game against my dad, which seems weird. I was black in the game, and I want you to notice how black took advantage of all the mistakes take white made in the game.",
        "1... c5": "I responded with the Sicilian Defense.",
        "2. Nf3": "All book.",
        "2... d6": "Here I tryed playing the Najdorf with 2.d4 cxd4 3.Nxd4 Nf6 4.Nc3 a6 5.Be2 e5. This is not what I usually play, but it's worth a try.",
        "3. d4": "Opening the center instead of playing the closed sicilian.",
        "3... cxd4": "takes",
        "4. Nxd4": "takes",
        "4... Nf6": "Trying to play the Najdorf.",
        "5. Bd3": "? I didn't think this was a really good move, since now the d4 knight is loose.",
        "5... a6": "I am not so sure if this is exact... maybe e5 was a bit better.",
        "6. c4": "Trying to take control of d5 that way black wouldn't play it.",
        "6... Nc6": "Attacking the d4 knight.",
        "7. Be3": "Defending the knight.",
        "7... Ng4": "A very important move when you are trying to win the bishop pair.",
        "8. Nxc6": "Trying to keep the bishop pair.",
        "8... bxc6 9. Bg5 Qb6": "At first I thought that this move would win a pawn, since it forks b2 and f2, but white can play...",
        "10. Qc2": "Defending both pawns.",
        "10... Ne5": "Trying even harder to win the bishop pair.",
        "11. b3": "?? At first I thought that my dad would give me the bishop pair, but then I realized that I could get something even better than the bishop pair...",
        "11... Qd4": "A free minor piece! My queen forks the B on d3 and the rook on a1. Always look for these traps. They can really come in handy in you future games.",
        "12. Nc3": "Defending the R on a1.",
        "12... Nxd3+": "I was not so sure about this move. Maybe Qxd3 was better, but I stuck with Nx because I thought that there would be some potential attack on the K-side.",
        "13. Kf1 Nxf2": "A winning tactic. If white plays Qxf2, Qxc3 wins a pawn.",
        "14. Qxf2 Qxc3": "Winning a pawn.",
        "15. Re1 Qd3+ 16. Kg1 c5": " At first I was too afraid to see Qb6. Now I don't see any problem with Qb6. Qb6= useless move. ",
        "17. h3": "Protecting against future attacks of back-rank mates.",
        "17... f6": "Driving the bishop away.",
        "18. Bh4": "Retreating, as usual.",
        "18... Qd4": "Trying to force a trade of queens, but he smartly avoided it with...",
        "19. Re3": "!? Trying not to trade when down material.",
        "19... Bd7": "Developing and preparing for a Q-side castle.",
        "20. Kh2": "Moving the K away for the rook.",
        "20... O-O-O": "K safety rules!",
        "21. a4": "Expanding on the Q-side.",
        "21... Qe5+": "At this point I thought that my queen would be trapped so I tryed to move it away with tempo on white's king.",
        "22. Bg3 Qe6": "f7 makes a perfect hiding spot for the queen.",
        "23. Rb1": "Trying to push with b4.",
        "23... Kc7 24. Qc2": "Defending c4 and a4 before b4.",
        "24... a5": "Now I can stop b4 forever!",
        "25. Rf3": "Waiting.",
        "25... Bc6 26. Re1 Qd7 27. Rfe3": "Now everything seems to be focused on the e-file, but luckily, white can't play e5.",
        "27... g6 28. Re3e2": "Waiting again.",
        "28... Bg7 29. Rf2 Rhe8": "My plan is to play e6 with d5, busting open the center.",
        "30. Qd2": "Making a sneak attack on a5.",
        "30... Kb6": "Defending a5. If he got in with Qxa5+, things could get confusing after Kb7.",
        "31. Qd3 e6": "Carrying out my plan.",
        "32. Ree2": "Waiting.",
        "32... d5": "Now the center is busted open. It seems to me that white played too many waiting moves. Now d5 is deadly. Something has to be done.",
        "33. exd5 exd5 34. cxd5 Qxd5": "Now that everything is traded off, black is clearly better.",
        "35. Qc2": "Not trading, a good idea.",
        "35... Rxe2": "takes",
        "36. Rxe2": "takes",
        "36... Re8": "Again, offering a trade of rooks for a winning endgame.",
        "37. Rd2": "Refusing to trade and instead, gaining a tempo on my queen with the advantage of another open file.",
        "37... Qe6": "Doubling on the e-file, making it almost impossible to challenge the Q with the rook",
        "38. Bf2": "attacking c5, a big weakness in my position.",
        "38... Bf8": "Trying to defend it the best I can.",
        "39. Qc3": "Waiting.",
        "39... Bd6+": "Taking advantage of white's last move and also gaining complete mobility from my bishops.",
        "40. Kg1": "If white played Kh1, Qe1+! wins the game.",
        "40... Qe5": "Forcing a trade of Qs for a winning endgame.",
        "41. Qd3": "??? It was here that my opponent completely threw away the game. Trading Qs was his only chance, and now the party is over.",
        "41... Qh2+": "! A forced # in 2.",
        "42. Kf1": "Forced, as you can see.",
        "42... Qxg2#": "And now... checkmate. He's roasted. A wonderful game of how the 2 bishops dominated the board."
    },
    "url": "https://gameknot.com/annotation.pl/the-power-of-the-two-bishops?gm=31798",
    "gameName": "The power of the two bishops",
    "players": "katy-daddy (1328) vs. acepoint2000 (1584)",
    "opening": "Sicilian (B54), Prins (Moscow) variation"
}