{
    "moves": {
        "1. e4 g6": "This is my 2nd longest game here on GameKnot, just three moves shy of my longest game. This one turned out to be a well-contended slug-fest that ends in a bit of a tricky endgame. It's a team match and I'm playing black. I'm tired of the Sicilian, so I try something different. The Robatsch, or Modern defense. As anyone who reads many of my annotations knows, I have long forgotten anything I used to know about openings, so I generally fly blindly through them, charting my course primarily by way of the GameKnot DB - for better or worse. I don't know this opening at all, so I was looking forward to exploring it a bit.",
        "2. d4 Bg7 3. Nc3 d6": "Main line so far.",
        "4. Nf3 a6 5. a4 b6 6. Bd3 Bb7": "More development. It looks like we can't decide whether we're playing the Modern Defense or the Pirc. Maybe it's a Modern because it's not quite a Pirc - is the term Modern Defens just a catch-all for non-Pirc lines starting with 1. e4 g6?. Then again, maybe it's just a Hippopotamus.",
        "7. O-O Nd7 8. Re1 c5": "Time to take on white's center.",
        "9. d5 Ngf6 10. Bf4 O-O 11. h3 Qc7": "OK, both sides seem more or less fully developed, but all things considered, I think I would rather have the white pieces. More room, more likelihood of finding a good attack. Black feels a bit cramped to me.",
        "12. Bf1 Ne5 13. Nxe5 dxe5": "Uncramping a little.",
        "14. Bh2 Ne8": "Hey, if white can retreat his pieces, so can black... Actually, I was thining this knight woudl be betterplaced on d6 and the bishop on g7 would want as few black pieces on the a1-h8 diagonal as possible.",
        "15. Qd2 Rd8 16. Rad1 e6 17. Qg5 h6 18. Qg4 Nf6": "So much for d6. Maybe later...",
        "19. Qf3 exd5 20. exd5 Nh5": "To defend e5.",
        "21. Bc4 Nf4": "To threaten d5 without losing defense of e5.",
        "22. h4 Rfe8 23. g3 Ne6": "The pawn on d5 is pinned to his queen, and therefore cannot capture the knight without loss of material.",
        "24. Qd3 Nd4": "Oooh, what a sweet sweet post for this knight.",
        "25. Ne4 Bxd5": "Oops. The knight on c3 defended the far-flung d5 pawn. Moving to e4 doesn't create any new threats, but it does remove a defender. Black pounces, but not after working out the eventuality of 27. c3.",
        "26. Bxd5 Rxd5 27. c3 c4": "I think white's plan was to pin the black knight to the undefended black rook on d4, then attack the knight with a pawn, winning material. It doesn't work, because black has a counterattack.",
        "28. Qe3 Nf5 29. Qe2 Red8 30. Rxd5 Rxd5": "Crisis averted, and black has a pawn to the good.",
        "31. Rd1 Rxd1+ 32. Qxd1": "And now white is making it easy for black to trade down pieces and try to leverage his pawn advantage into a winning endgame.",
        "32... Qc6 33. f3 Ne3": "White's queen is the only defender of the pawn on a4. This knight move drives her off of the defense.",
        "34. Qe2 Nd5 35. Nd2 Qxa4 36. Nxc4 b5": "But in the end, all we do is exchange pawns.",
        "37. Nd6 Qa1+ 38. Kg2 Bf8": "Finally black gets his bishop into the game. White's bishop is still trapped behind its own pawns, so for now, black is effectively up by a bishop and a pawn, and trying to leverage that into more material gains before the white bishop comes out of hiding.",
        "39. Ne4 f5 40. Nf2 Bc5 41. Nd3 Ne3+ 42. Kh3 Bd6": "42. Bd6! might be one of my sneakiest moves ever. The black bishop was en prise at c5, but it was the only defender of the white knight on e3. Surely, the bishop must retreat to b6 or a7 to maintain that defense, and then black will lose the pawn on e5. But then I found this move. Black seemingly blunders and leaves his knight hanging. But white cannot capture the knight, for that allows 43. ... Qf1#.",
        "43. Ne1 Nc4 44. b3 Qb2": "I must admit, I was sooooo tempted to simply play 44. ...Qxc3 45. bxc4 Qxc4, trading in my knight for two pawns. Two adjacent passed pawns on the far side of the board from white's king and his (nearly) trapped bishop. I whipped out a chessboard and played through that endgame a bunch of times and couldn't quite force one of those pawns to promote, so I backed down and played more conservatively. As played, 44. ... Qb2 forces white to trade queens or lose a pawn.",
        "45. Qxb2 Nxb2": "And now we begin the endgame, more or less. Almost 20 more moves, nearly all of which are just a big positional dance. Black's goal is to try to eliminate white's two remaining pieces in such a way that his pawn advantage will be decisive.",
        "46. Bg1 a5 47. Be3 Kg7": "Time to make the king get off his lazy butt and get into the fight.",
        "48. Bc1 Nd1": "Threatening a pawn, but it was also the only safe move for the knight.",
        "49. c4 bxc4 50. bxc4 a4": "OK, now we each have a passed pawn, but black's is farther from the action and a more imminent threat of promotion.",
        "51. Nc2 Nf2+": "What black really needs is his knight on d2 or b2 unopposed. Let's see if we can get there.",
        "52. Kg2 Nd3": "Threatening the bishop. White must respond. White has two objectives here, saving his bishop and preventing 53. ... Nb2. I don't think he can achieve both unless he plays 53. Ba3 which allows black to exchange bishops, an exchange that favors black. Still, I think 53. Ba3 was white's best move here.",
        "53. Bd2 Nb2": "Threatens 54. ... Nxc4. I don't think white can save the pawn. 54. c5? won't work. 54. Na3? won't work. 54. Ne3 is met by 54. ... f4! and the knight won't be able to stay on e3. Nor does white have a counterattack that manages to save the pawn, such as with 54. Bb4. Nothing seems to hold the pawn.",
        "54. Bc3 Nxc4": "And now it's a two pawn endgame. Black needs to help white reduce his material. Those pieces really need to come off.",
        "55. f4 Kf6 56. Kf3 Ke6 57. fxe5 Nxe5+": "A 3-2 kingside pawn advantage is more decisive than a 3-4 kingside advantage.",
        "58. Ke2 Nc6": "Thinking that this knight on b4 will help the pawn advance, once white moves either of his pieces that are currently protecting b4.",
        "59. Kf3 a3": "Time to finish this. If black can get white to trade a piece to prevent this pawn from promoting, the remaining material advantage (piece+pawn) should decide things quite nicely on the kingside.",
        "60. g4 Ne5+": "This is the losing move. 60. g4? allows black to force a piece trade, something white cannot afford. Now the black knight forks the white king and the pawn on g4. The king cannot simply move or the pawn is lost. White must capture the knight.",
        "61. Bxe5 Kxe5 62. gxf5 gxf5": "Decsions, decision. Capture on f5 with the pawn splits the black pawns, isoloating both of them and weakening black's pawn structure, but it does create a passed f-pawn. Capturing with the king prevents the isolated pawns, but also fails to create a passed f-pawn. I decide to go with the passed pawn.",
        "63. Ke3 a2": "One square away from promotion. Can the white king get there? 64. Kd3 Bc5! and now if 65. Kc3?, black responds with 65. ... a1=Q 66. Nxa1 Bd5+ 67. K-any Bxa1 and black has bishop+2 pawns against white's pawn, an easy endgame. If instead 64. Kd2 (intending to go to c1 instead of c3), 64. ... Bc5 65. Kf1 Bd4 and now the bishop covers b2 and the pawn covers b1 and the white king cannot approach the pawn. Not 66. Nxd4?? allowing 66. a1=Q+ and 67 Qxd4. So either way white plays, he is about to sacrifice his knight to capture the a-pawn, leaving black with his won endgame. Instead, white resigns."
    },
    "url": "https://gameknot.com/annotation.pl/the-modern-robatsch-pirc-hippopotamus-defense?gm=23744",
    "gameName": "The Modern Robatsch Pirc Hippopotamus Defense",
    "players": "yogy (1905) vs. blake84120 (1977)",
    "opening": "Robatsch defence (B06), two knights variation"
}