{
    "moves": {
        "1. e4 e5 2. Nc3 Nf6 3. Bc4 Nc6": "This game was a pure test for myself and a lot of risks on my part considering my opponents rating vs mine. I was playing white",
        "4. Nf3": "Knight to F3 for white",
        "4... Nxe4": "Black captures. White is down in material. White assumed, Black is setting up his bishop to C5. ",
        "5. Bxf7+": "White could of captured black's pawn on E5 however Black could just recapture with his Knight on C6. White could of further developed his bishop on C1 however any chance to win the game, White chose to sacrifice the bishop to prevent black from castling kingside. ",
        "5... Kxf7 6. Nxe5+": "Now the capture of the black pawn makes better sense as it will free up the white queen and for a check.",
        "6... Nxe5 7. Qh5+": "Notice white is down in a lot of material but from here on in but with the check to the black king white can make up the difference",
        "7... Ng6 8. Nxe4": "White blocks the check by moving Black night to F6 however the black night is now pinned. White knight responds and captures black knight on E4",
        "8... Be7 9. O-O": "black bishop to E7, White castles king side",
        "9... d5 10. Ng3 h6 11. f4": "White advances pawn, trying to open a line for rook on F1",
        "11... Bc5+ 12. Kh1": "black checks white King, White King moves to H1",
        "12... Bd6 13. f5 Bxg3": "White continues the push with pawn to F5 and scarifies the White Knight. Black responds with bishop taking white knight on G3 (Note White is still down plenty of material)",
        "14. Qxg6+ Kg8": "White responds with check to black king. Black King retreats.",
        "15. f6 Qd7": "White continues the pawn push. Black moves Queen to D7",
        "16. Qxg3 g5": "White takes black bishop on g3. Black pawn moves to g5. Note white is now +1",
        "17. d4 Kf7": "Black King moves to block white pawn progression",
        "18. Bd2 a5": "White advances bishop to D2",
        "19. Rae1 Re8": "Black looking to trade rooks. ",
        "20. Re7+": "Now here is where things get interesting and in my view the reason why black being a lot higher rated player than myself lost the game. Rather than swap rooks automatically, white places the white rook on E7 forcing black to take and auto checking the king after black rook takes white rook",
        "20... Rxe7 21. fxe7+": "plan worked. I leave the comments for the rest of the game out but I would appreciate any comments",
        "21... Kxe7 22. Re1+ Kf6 23. Rf1+ Kg6 24. Qd3+ Kg7 25. Qf3 c6 26. Qf8+": "Two conditional moves where set securing a check mate. ",
        "26... Kg6 27. Rf6+ Kh5 28. Qxh6+ Kg4 29. Qh3#": ""
    },
    "url": "https://gameknot.com/annotation.pl/the-sacrifice?gm=60027",
    "gameName": "The Sacrifice",
    "players": "jokeriswild (1326) vs. kamyarmov (1691)",
    "opening": "Vienna game (C28)"
}