{
    "moves": {
        "1. e4 c5 2. Nf3 d6 3. Bb5+": "Solosky-Canal Variation is a good alternative for white if he wishes to avoid main line stuff. I used to play this years ago as a surprise weapon on OTB play. \n",
        "3... Nd7": "Almost anything can be played here except for ...Qd7 of course\n",
        "4. O-O": "not bad but this does allow black to gain space on the queen side by checking the LSB. Usually, white tries to check the initiative by playing d4. \n",
        "4... a6 5. Bxd7+": "!?\nAlternative variation: [ Better is ] 5. Bd3 Ngf6 6. c3 [=][ white has some prospects. ]\n",
        "5... Bxd7": "Strictly speaking white can not be happy with how things are turning out. Black is far more advanced on the queen side. The LSB sits very well on the current diagonal. \n",
        "6. d4 cxd4 7. Nxd4 g6": "Deciding to develop the DSB on the g7 diagonal is a very good idea here because it is extremely difficult for white to shut it in. I am planning to setup a hedgehog formation which I love to play as black. \n",
        "8. Nc3 Bg7": "As I tell my chess students. If you play g7 then Bg7 should always follow. No exceptions. \n",
        "9. Be3 Nf6 10. Qd2": "When white plays Be3 in the Sicilian he almost always wants to play Qd2. Especially if black has played the Fianchetto. The reason for this is that later on white can setup all kinds of tactics on f6 and h6 with the support of the king pawns. But here this maybe a tad too early because this blocks the escape route of the DSB.  Allowing black to play his next move. \nAlternative variation: [better is ] 10. f3 O-O 11. Qd2 Rc8 12. Rad1 [=]\n",
        "10... Ng4 11. Nd5": "?!\nallowing black to get in the advantageous ...e6 with inattentive. \nAlternative variation: 11. Nd1 b5 12. f3 Nxe3 13. Nxe3 [=]\n",
        "11... e6 12. Bg5": "??\nThis a typical mistake, white ignores the attack on one piece only to put two in danger. It is kinda like a rescue mission gone bad. Where the rescuer ends up needing rescue too. \nAlternative variation: 12. Nc3 Nxe3 13. Qxe3 O-O 14. Rfd1 Rc8 [⩱]\n",
        "12... f6": "!\nWhite is forced to give up a piece. \n",
        "13. Nxf6+": "??\nWhite should have accepted his losses and enter damage control. Instead he, goes all kamikaze on me. He attacks a point(...f6) that is well in black's control. No hope at all!\nAlternative variation: 13. Nf4 fxg5 14. Ndxe6 Bxe6 15. Nxe6 Qd7 16. Nxg7+ Qxg7 17. Qxg5 Ne5 18. f4 [ is bad but white still has a long shot chance. ]\n",
        "13... Nxf6 14. f4": "??\nOk Kamikaze tactics never really worked for the Japanese and neither does it in chess. \n",
        "14... Nxe4 15. Qe3 Qb6": "A big \"x\" marks the spot with the D4-knight right in the cross-hairs\n",
        "16. c3 d5 17. Rfe1 h6": "I am not so much as attacking the DSB but rather the f4 weak point. Can you see how?\n",
        "18. Bh4 g5": "The art of combinations is what wins chess games. A combination is a series of three or more moves that leads to advantageous gain either material or positional. Here it is both. \n",
        "19. Bf2 Qxb2": "Alternative variation: [just as good] 19... gxf4 20. Qe2 e5 21. Nf5 Qf6 22. Nxg7+ Qxg7 [−⁠+]\n",
        "20. Bg3 gxf4 21. Qxf4": "?\nwhite I think is trying to stay active. Which is a good think when defending for your life. However, activity at the expense of a minus two pawn count is very bad. When defending you should avoid further material loss at all costs. \n",
        "21... Rf8": "Now I have a three point cross hair on f2. \n",
        "22. Qe3 Rc8 23. Rec1": "If you have a chance use all of your pieces! White should have played Rac1. Who cares about the pawn on a2 when you have the Cap in your cross hairs. \n",
        "23... Rxc3 24. Qe1": "It is a very bad day when you feel that your best move is to drop yet another piece. \n",
        "24... Bxd4+ 25. Kh1 Rxg3": "setting up a forced mate in 8. \n",
        "26. hxg3 Rf2 27. Qxf2 Qxf2 28. Rcg1 Nxg3+ 29. Kh2 Ne4 30. Rgf1 Qh4#": ""
    },
    "url": "https://gameknot.com/annotation.pl/the-tale-of-the-kamakaze-knight?gm=49639",
    "gameName": "The Tale of the Kamakaze Knight",
    "players": "king-nothing (1352) vs. elyhim (2341)",
    "opening": "Sicilian (B51), Canal-Sokolsky (Nimzovich-Rossolimo, Moscow) attack"
}