{
    "moves": {
        "1. e4 e6 2. h4": "My very oldest and latest thought in this opening. To the chess\r\naddict nurtured on spineless convention, this move comes like a\r\nslap in the face--but calm down, dear reader; after all, you cannot\r\nbe expected to understand such moves. (Forgive me - it is not your\r\nfault, until now no one has opened your eyes and ears.) Wait just a\r\nlittle while, and there will pass before you a miracle of\r\noverprotection of more than earthly beauty. (I assume that I rightly\r\nsurmise that you are quite familiar with my great theory of\r\noverprotection.)\r\n",
        "2... d5": "Black of course has no suspicion of What is coming and continues\r\nserenely in classical style.",
        "3. e5": "A move of elemental delicacy. (We detest, as a matter of principle,\r\nsuch words as \"power\" and \"strength\"; in the first place, such banal\r\nexpressions make us uncomfortable; and, in the second place, we\r\nlike even less the brutalizing tendency which such words imply.)\r\n\r\nWherein lies the beauty of 3 e5? Why is this move so strong?\r\n\r\nThe answer is as simple as it is astonishing. The move is strong\r\nbecause it is weak! Weak, that is, only in the traditional sense! In\r\nreality, that is to say, it is not the move but the Pawn on K5 that is\r\nweak--a tremendous difference! In former times, it is true, it was\r\ncustomary to reject any move ,which created a weakness. Today,\r\nthanks to me, this view is obsolete. For, look, my dear reader, the\r\nfact that the Pawn on e5 is weak obliges White to protect the Pawn\r\nmore and more until at last the state of overprotection arises as it\r\nwere of itself. But, as we have seen (cf. My System),\r\noverprotection is practically equivalent to victory. Hence it follows\r\nautomatically that the \"weak\" move, 3 e5, is a certain road to\r\ntriumph. The rest is more or less a matter of technique.\r\n",
        "3... c5 4. d4": "Here it is quite clear that it is more profitable for White first to\r\nprovoke c5 and then play d4, rather than the other way round,\r\nwhich is the customary course. For, if White first plays d4, there\r\nfollows c5 and White's d-pawn is under attack. But my clever\r\ntransposition of moves changes the situation completely. For now\r\nBlack's c-pawn is suddenly attacked by White's d-pawn!\r\n\r\n",
        "4... cxd4": "What else can Black do?\r\n",
        "5. h5": "All very clever, original and decisive! Of course the ordinary run\r\nof people who envy my every spark of genius but cannot follow\r\nmy line of reasoning for even three paces, outdo themselves in\r\nsneering at me with the poison-dripping epithet, \"bizarre.\"\r\n\r\nThe text move creates confusion in the whole Black army and\r\nprepares for the annihilating invasion by the Queen 18 moves later.\r\n\r\n",
        "5... Qb6": "Naturally not 5...Nc6 6 Bb5! etc. Why should Black play the\r\nFrench Defense only to allow the Ruy Lopez Bishop move after\r\nall?! (See Diagram)\r\n\r\n",
        "6. h6": "An avaricious dullard would never hit on this deeply conceived\r\nPawn sacrifice.\r\n\r\n",
        "6... Nxh6": "After 6...gxh6, White has an even more comfortable game.\r\n\r\n",
        "7. Qh5": "The reason for this becomes clear after next move.\r\n\r\n",
        "7... g6": "Black threatens to begin a successful siege of the weakling at e5\r\nwith Bg7. But White forestalls this.\r\n\r\n\r\n\r\n",
        "8. Qh2": "To every fair-minded observer, this move must come as a\r\nrevelation! All the previous maneuvers now become clear! White\r\nhas completed his development brilliantly and proceeds to\r\noverprotect e5. Against this, Black is helpless.\r\n\r\n",
        "8... Nf5 9. Bd3": "Note the splendid cooperation of White's forces: while the e-pawn\r\nand the King Bishop completely blockade Black's position, the\r\ndevelopment of the overprotective forces takes place behind the\r\nbroad backs of these sturdy blockaders.\r\n\r\n",
        "9... Nc6 10. Nf3": "As a rule this is a routine move. But here it is strikingly original\r\nand as such occupies a place in the treasury of my intellectual\r\nproperty.\r\n\r\n",
        "10... h5 11. b4": "A deep trap, as will soon become apparent!\r\n\r\n",
        "11... Bg7": "How Black must have rejoiced when he anticipated his formidable\r\nopponent in the occupation of the long diagonal. But... (See\r\nDiagram)\r\n",
        "12. Bf4": "...how bitterly disappointed he must have been to realize that 11 b4\r\nhad only been a trap and Bg7 had not been intended at all. The\r\nposition of Black's Bishop at g7 is now quite pointless. 11...Be7\r\nwould have been relatively better.\r\n\r\n",
        "12... Bd7 13. Nbd2 Rc8": "Black no longer has any good moves!\r\n\r\n",
        "14. Ke2": "Again, an extraordinarily deep move. White sees through Black's\r\nplans, and in addition he prepares a particularly powerful\r\ncontinuation of his strategy of overprotection.\r\n\r\n",
        "14... Nxb4": "Just what White was waiting for.\r\n\r\n",
        "15. Ne1": "This was the point of his previous move! Black is now forced to\r\nexchange off the attacking Bishop at d3. But, with that, even\r\nWhite's King Knight enters the fray with fearful effect at d3, while\r\nthe square f3 becomes available to the Queen Knight. Surely a\r\ngrandiose piece of strategy. The fact is that I'm a marvelous player,\r\neven if the whole chess world bursts with envy.\r\n\r\n",
        "15... Nxd3 16. Nxd3": "Naturally not 16 cxd3? which would have been quite inconsistent.\r\nThe Pawn on c2 is unimportant, and Black only wastes precious\r\ntime by capturing it.\r\n\r\n",
        "16... Rxc2 17. Rae1": "White continues his overprotection without much ado.\r\n\r\n",
        "17... a5": "This counterattack has no punch. Black would naturally like to get\r\na passed Pawn plus a Rook on the seventh, but it is too late for\r\nthat.\r\n",
        "18. Kd1": "Now the menaced Rook must scurry back, for capture on R7 would\r\nbe much too dangerous. (See Diagram)\r\n\r\n",
        "18... Rc6": "At last, Black gets the right idea: overprotecting his Pawn at e6.\r\nBut it is already too late.\r\n\r\n",
        "19. Re2 Ke7": "Introduced into tournament play by myself. See note to White's\r\n14th move. The King overprotects e6.\r\n\r\n",
        "20. Rhe1 Re8 21. Nf3": "Completing the overprotection of e5 and thus deciding the fate of\r\nthe game. Black has no defense. Note the esthetic effect created by\r\nWhite's position.\r\n\r\n",
        "21... Bf8": "Now Black threatens to complete the overprotection of e6 by\r\nplaying Ng7. But White has prepared a brilliant combination..\r\n\r\n",
        "22. g4": "Much stronger than the obvious Bg5  etc.\r\n\r\n",
        "22... hxg4 23. Qh7": "Now one clearly realizes the masterly understanding of position\r\nwhich went into White's eighth move (Q-h2!!).\r\n\r\n",
        "23... gxf3": "Had Black continued overprotecting by 23...Ng7 there would have\r\nfollowed 24 Bg5  f6 25 Bxf6  Kf7 26 Ng5 mate. Black's basic\r\nerror was that he started overprotecting much too late. \r\n\r\n",
        "24. Bg5#": "mate.\r\n\r\nOne of my best games! I am proud of it if only because Herr\r\nSystemsson is one of the strongest Scandinavian players. The game\r\nmade an overwhelming impression on the players and spectators as\r\nwell as on my opponent. The game has become famous in\r\nDenmark as \"the immortal game of overprotection.\"\r\n\r\nTo the incredulous, the above article was published in the\r\nFebruary, 1928,, issue of the Wiener Schachzeitung under the\r\neditorship of Hans Kmoch.\r\n\r\nKmoch admired and esteemed Nimzovich as a great player and a\r\nprofound and original thinker. Yet he could not help poking sly fun\r\nat Nimzovich's often pompous and bombastic manner. Luckily this\r\nrollicking parody is so good-natured, with a few grains of sense\r\nartfully concealed in a farrago of nonsense, that Nimzovich\r\nexpressed himself as vastly amused by it.--Ed [I.A. Horowitz]"
    },
    "url": "https://gameknot.com/annotation.pl/the-immortal-game-of-overprotection?gm=2258",
    "gameName": "\"the immortal game of overprotection.\"",
    "players": "  vs.  ",
    "opening": "French defence (C00)"
}