{
    "moves": {
        "1. e4 c5 2. f4 d5 3. Nf3 dxe4 4. Ng5 Nf6 5. Bc4 Bg4 6. Qxg4 Nxg4": "My second annotation of the Knights Coaching Project. I feel I played a better game than my first annotation even though I came out with a loss.",
        "7. Bxf7+": "Bxf7 is the best 7th move here for white, taking away blacks castling rights.",
        "7... Kd7": "black moves his king out of check.",
        "8. Be6+": "The move 8.Be6+ forks blacks king and Knight putting black into check again.",
        "8... Kc6": "Black moves his king to c6. From what I've read this is the more popular move for black, I am not quite sure why but I am thinking 8.Kc7 is not a good move because of a possible check threat from whites knight on g5, I could be wrong and would love to hear some feedback.",
        "9. Bxg4": "Capturing blacks knight.",
        "9... e6": "Again 9.e6 is the most favored move for black from what I have read but not quite sure why, any comments is much appreciated.",
        "10. Nxe4": "I am not sure whether this was a good move or a bad move, the reason for why I moved it was because of black moving 10.h6 and attacking my knight and therefore I would have to move the knight anyway. But I feel there could of been a better 10th move here.",
        "10... Qh4+": "Expected.",
        "11. Nf2": "11.Nf2 Blocking the check from blacks queen. I feel this could be a bad move and that 11.g3 might of been better.",
        "11... h5": "Expected.",
        "12. Bf3+": "Maybe 12Bf3+ was not so much a good move here, maybe 12.Be6 may of been better.",
        "12... Kc7": "Black moves his king out of check.",
        "13. d3": "Trying to develop my bishop on c1.",
        "13... Nc6": "Black develops his Knight.",
        "14. Bd2": "Here I am preparing to castle on queen side and stop blacks knight from landing on b4.",
        "14... Nd4": "Expected.",
        "15. Na3": "Moving my knight here will protect the c2 square from blacks knight. But after blacks next move I realised that this was a bad move.",
        "15... Nxf3+": "I should have moved 15.Bfd1 as now I have lost my bishop on f3 to blacks knight and I am in check.",
        "16. gxf3": "Taking blacks knight.",
        "16... g6": "Black preparing the way for his bishop.",
        "17. O-O-O": "Here I castled long and it's another blunder as now my Knight on f2 is a hanging piece and under attack by blacks queen. 17.O-O would have been a better move here.",
        "17... Qxf2": "Expected.",
        "18. Kb1": "Wasting moves here I think.",
        "18... Bg7": "Here I saw that black could be planning to form a battery with his queen and bishop on the a1-h8 diagonal and attack the b2 square and delivering mate.",
        "19. c3": "Here from what I could see I had a choice of three moves. The first move I considered was 19.Nb5+ but then after the possible move 19.Kb6 or 19.Kc6 for black I would have to retreat my knight back to a3. The second move I considered was 19.Bc3 and offering a bishop exchange which I did not really want to do. So I settled for the move 19.c3 protecting the b2 square and stopping blacks queen from moving to d4.",
        "19... Qxf3": "Judging by blacks move here, my d3 pawn is in trouble.",
        "20. Bc1": "Protecting my d3 pawn.",
        "20... Rad8": "Black forming a double attack on my d3 pawn.",
        "21. Nc4": "This might not of been a good move, But I was not ready to make rook exchanges.",
        "21... Rxd3": "Expected.",
        "22. Nd2": "Blocking the rook exchange.",
        "22... Qh3": "Black moving his queen away from the knight attack.",
        "23. Ne4": "I feel this was a bad move as it offers the rook exchange that I did not really want just yet, but I knew it was going to happen soon or later. But if I had not of moved my knight to allow the rook exchange then my minor pieces would have been cramped and not active, that is my theory anyway. ",
        "23... Rxd1": "Expected.",
        "24. Rxd1": "Capturing blacks rook.",
        "24... Qf5": "blacks queen pinning my knight to my king.",
        "25. Re1": "Protecting my knight.",
        "25... e5": "Black attacking my f4 pawn.",
        "26. Ka1": "Escaping the pin.",
        "26... exf4": "Black capture's my f4 pawn.",
        "27. Nf2": "Moving my knight from blacks queen attack.",
        "27... Rd8": "Black preparing his rook.",
        "28. Re7+": "This was probably a bad move as now the 1st rank is not protected.",
        "28... Kb6": "Black moving out of check.",
        "29. Rxg7": "Probably another bad move, I feel moving my rook back to the 1st rank would have been a better move here.",
        "29... Re8": "This is looking very bad now as the 1st rank is unprotected and I have no escape route.",
        "30. b3": "Trying to open an escape route, I feel 30.a3 might of been better here.",
        "30... Qc2": "Expected.",
        "31. a3": "Another bad move though there is nothing much I can do to save myself now.",
        "31... Qxc1+": "Expected and mate in the next move.",
        "32. Ka2": "Only square I can move to.",
        "32... Re2#": "And that's game. A lot of blunders in this game however I feel I played better than my first game in the project. I look forward to all comments:)"
    },
    "url": "https://gameknot.com/annotation.pl/the-knights-coaching-project?gm=27905",
    "gameName": "The Knights Coaching Project",
    "players": "richie513 (1287) vs. easy19 (2239)",
    "opening": "Sicilian (B21), Grand Prix attack"
}