{
    "moves": {
        "1. f4": "Not an uncommon opening. The idea is to get the KBP forward before planting the KN on the natural square, enabling this P to participate in a K-side thrust. And of course to veer down less explored paths than, say, the Queen's Gambit or the Ruy Lopez.",
        "1... d5 2. Nf3": "Focusing attention on Black's K4.",
        "2... Nf6 3. e3": "This opening is almost a mirror reflection of the English Opening. In that one, White plays P-QB4 and N-QB3, focusing on the light squares in the center. Here, White's focus is on the dark central squares.",
        "3... Bg4 4. h3": "Naturally I have no intention of letting Black maintain the pin on my Knight.",
        "4... Bxf3 5. Qxf3": "I wasn't expecting Black to so willingly give up a minor exchange.",
        "5... a6 6. b3": "Intending to fianchetto the QB...",
        "6... e6 7. Bb2": "...and increase my hold on the central dark squares.",
        "7... Be7 8. Be2": "Time to focus on completing my development.",
        "8... O-O 9. d3": "To clear Q2 for the Knight and avoid obstructing the long diagonal.",
        "9... c5 10. c4": "Turning up the heat on Black's central pawns.",
        "10... Ra7 11. Nd2": "The back rank is clear now.",
        "11... b5 12. O-O": "OK, development is finished.",
        "12... bxc4 13. dxc4": "The first Pawn exchange.",
        "13... Ne4 14. Nxe4": "This tactical skirmish...",
        "14... dxe4 15. Qxe4": "...centralizes my Q nicely.",
        "15... Qd2 16. Bd3": "Saving the B and threatening QxRP mate.",
        "16... g6 17. Rab1": "The mate threat gave me time to guard the other B as well.",
        "17... Rd8 18. Rfd1": "Naturally, I want to drive Black's Q from the heart of my position. I was expecting 18... Q-N5.",
        "18... f5 19. Qe5": "Black's Q is still en prise, but I now have an additional threat...",
        "19... Qa5 20. Qg7#": "...which Black overlooks."
    },
    "url": "https://gameknot.com/annotation.pl/the-bird-takes-flight?gm=54990",
    "gameName": "The Bird takes flight",
    "players": "last_archimedean (1392) vs. dimitri29 (1356)",
    "opening": "Bird's opening (A03), Lasker variation"
}