{
    "moves": {
        "1. e4": "My usual/only white opening. One day i must take the trouble to explore something different.",
        "1... c5": "A move that i have been experimenting with recently instead of e5.",
        "2. Nc3": "I ike to play Nf3 next, but he must want to play d5 to claim his share of the centre, so, Nc3 to prevent that for now.",
        "2... Nc6": "Hm, wasn't expecting that and it now means i can't get to d4.d3 looks a bit of a nothing move. At this point i had a real long think and the decided to go for something a bit different. ",
        "3. g3": "I decided on g3. (yes i know it weakens the defences around my king), but i hope to be able to build from there. ",
        "3... g6": "He must be thinking the same way. I wish i could see his notes now.",
        "4. Bg2": "Another long think, f4? I've already given up the idea of castling king side. d3? i still don't like it. So, Bg2, develops the bishop a bit and further protects e4.",
        "4... Bg7": "What is he doing? Is he really going to trade his bishop for my knight? I don't think so, he must have something else in mind.",
        "5. d3": "Having convinced myself that he is not going to harm my knight, it is now time for d3. It further protects e4 and opens a line for my dark bishop.\r\nat this point, I have to admit that i'm a long way outside my comfort zone and I really don't know what to expect next.",
        "5... d6": "Ok, he opens a line for his light bishop.",
        "6. f4": "My f pawn has some good protection there on 4 and i'm hoping to be able to get my knight to f3",
        "6... Nf6": "I reckon the thinking behind that move must have been to allow him to castle.",
        "7. Nf3": "So now i get the chance to move the knight to f3",
        "7... O-O": "Yes i thought that would happen. His king is so well protected in there that i'm not even going to think about an attack on it.  ",
        "8. O-O": "My king on the other hand is not so well protected. The original idea was to castle long but i'm not sure i'm going to be given the time to do that.",
        "8... Ng4": "Not sure that i understand that one. At this point, Brian put a comment on the game to say that my formation was looking good. This made me stand back and have a good look at the over all shape and pattern and yes i realised that i was satisfied with it so far.",
        "9. h3": "I dont like the knight there though so at the risk of further damaging the kings defences, I'll chase it away and hope that this will make Brian waste a further move.",
        "9... Bd4+": "That didn't go quite to plan, i hadn't spotted that he might do that. I dont think its too bad though. I think if i'm very carefull, i may be able to win a piece here.",
        "10. Nxd4": "First  things first though, the check had to be dealt with before i can think too far ahead",
        "10... Ne3": "Excellent, Brian has gone for the bait, now i can get one of my knights out of trouble",
        "11. Nxc6": "That should cause a bit of panic in the black ranks. Now i dont think he can even up the material. I think i will finish this little trade off still two pieces up.\r\nI was a little surprised that Brian resigned here, i thought he still had chances to get back into the game"
    },
    "url": "https://gameknot.com/annotation.pl/the-battle-of-the-great-annotators?gm=17635",
    "gameName": "The battle of the great annotators",
    "players": "aandersen (1326) vs. honeybrook (1558)",
    "opening": "Sicilian (B25), closed, 6.f4"
}