{
    "moves": {
        "1. e4": "My usual.",
        "1... e5": "And it looks like we're avoiding the Sicilian tactics.",
        "2. Nf3": "So out comes my Four Knights approach.",
        "2... Nf6": "My least favorite of the variations. It's more aggressive from Black, and I don't see it played as often- much less in a timed match.",
        "3. Nc3": "I don't want to step off the main line of the idea just yet.",
        "3... Nc6": "And we transpose back. So I decide to meet my aggressor with...",
        "4. Bb5": "Ruy Lopez would be proud.",
        "4... Bc5": "Discouraging O-O, as White clearly wants to do this right away.",
        "5. Bxc6": "So I punish it by doubling his pawns.",
        "5... dxc6": "This makes going after e5 harder in the immediate future, as the d2 pawn has nowhere good to go for the next bit of time.",
        "6. Nxe5": "Now, for me, it's been a bit of time since my last game. Here I thought this was a perfectly well placed knight (and for some of you, you would agree, but nonetheless), and I forgot what usually happens in this line. And yet, within Black's next two moves, I would already start panicking.",
        "6... Qd4": "I realized that e5 was not a free pawn, right here. Threatening Qf2#",
        "7. Nd3": "So the knight obviously must go here.",
        "7... Bg4": "And now I felt myself freaking out. In a Sicilian varation, this is part of a Grand Prix attack where White can actually consider taking the bishop, sacrificing the queen to harass a cramped Black King and using their developed space advantage to do so. This clearly doesn't work here. If f3, I need to worry about Nxe4 for at least the two turns it takes me to get the Queen off the LSB diagonal. If Ne2, I reverse the attack on the queen, but delay my ability to defend the e4 pawn, all the while it being clear that I cannot castle kingside this match.",
        "8. f3": "Since O-O is clearly not an option, I opt to protect virtually the only defender to the king.",
        "8... Bh5": "Deciding against Nxe4. Perhaps he felt he attacked too soon as well.",
        "9. Nxc5": "Maybe not the best move, but I want this level of pressure dealt with at once.",
        "9... Qxc5": "Virtually forced.",
        "10. b3": "Planning Bb2 instead of d3/d4 (allowing the queen to pin the knight) - e4 is still in danger.",
        "10... O-O-O": "I was surprised he didn't do O-O here. It would get the kingside rook closer to the action, while the King is probably safer... (even despite the next 10 or so moves that happen)",
        "11. Bb2": "A good square for the better bishop. Black is clearly suffering for only having the LSB right now.",
        "11... Qb4": "Daring me to move that d pawn, or perhaps even to try a3.",
        "12. Qe2": "Perhaps later. I want my king out of the way.",
        "12... Rhe8": "Adding a third attacker to match three defenders, locking my Knight/Bishop + Queen in place.",
        "13. g4": "I decide now is a good time to harass pieces and develop my pawns.",
        "13... Bg6": "4 attackers versus 3 defenders now, though my kingside is starting to take more of an aggressive shape as a result of this, harassing Black's LSB even further. It probably would be the first to attack e4...",
        "14. a3": "...but after this move, I develop my pawns even further, and force Black to delay the attack, lest he does Qxe4 first. The queen could go to say, e7, but it still attacks the square sooner than my own queen would need to defend it.",
        "14... Qd6": "So he tries to irritate the d file instead.",
        "15. O-O-O": "Now is the time to hide the king, and bring out my queen rook. Both my d and e files have dramatically increased in power as a result of this one, simple move...!",
        "15... Nd7": "Seeing 16. e5! and there's hardly anywhere better for this knight to go for now. ",
        "16. h4": "I continue storming up the kingside, advancing ground while threatening his second bishop.",
        "16... f6": "h6 was also possible, but it does nothing to hinder my E-pawn's grip on e5. Also, the LSB isn't really doing much on the b1-h7 diagonal at this time.",
        "17. h5": "And with this, most kingside pawn moves made by Black are fairly discouraged.",
        "17... Bf7": "Again, virtually forced.",
        "18. Rh3": "I decide to see what Black wants to do right now, defending f3 and limiting the reach of the queen in case I need this for later.",
        "18... Ne5": "Black clearly wanted to regain his ground in the d file, but much better was Nb6...",
        "19. f4": "Now Black suffers an attack made from aggressive pawns for wasting so much time this match.",
        "19... Nd7": "Again, virtually forced.",
        "20. Rf1": "Stopping Qxf4, and this will keep both rooks more active, as d2 remains fairly guarded.",
        "20... g6": "Either Black wanted more travel room for the back pieces on the kingside, or was afraid the pawn attack would worsen without forcing some exchange to happen right now. I'm not sure what the main plan behind this move was, or even if any of it worked.",
        "21. Rd3": "This queen has been out in the open for far too long, and is clearly the main source of Black's hindered development. But does this really mean that 6. ...Qd4 was a mistake?",
        "21... Qf8": "Black's queen is on a good diagonal right now, but is in far too much danger to act on it right now.",
        "22. hxg6": "I decide now is a good time to clear up the kingside a bit more.",
        "22... hxg6": "Bxg6 is clearly not going to help matters.",
        "23. f5": "And finally, this move seals off Black's control of the kingside, forcing him to continue playing his weaker queenside against my more strongly developed one.",
        "23... gxf5": "He prefers the open varation of the sealing, to the closed one (via g5)",
        "24. gxf5": "Now it's Black's turn to decide to do something.",
        "24... Qh6": "Once again, planning to add stress to the d2 pawn, but this is no longer a problem after Rd3.",
        "25. Kb1": "This will stop any further pins from happening to my pieces, and actually allows room for multiple surprise attacks after a bit of adjustment...",
        "25... Nc5": "Once again, I wonder if Nb6 was better...",
        "26. Rxd8+": "The exchange of rooks is better while I'm ahead, and this also preserves my initiative while he deals with his king for the time being.",
        "26... Rxd8": "Clearly better than Kxd8, even though there's no point in attacking d2 at this point.",
        "27. Bc1": "At this point, the Bishop is no longer needed on b2; it guards a3 just fine from here.",
        "27... Bh5": "Trying to re-establish more pull of the diagonals from here, in case he ever finds the ground for this to be beneficial again...",
        "28. Qf2": "-but it wasn't a good idea. The queen was never in danger, and has developed a new attack further because of it. The knight was probably better on b6 (like I've always said), now more than ever.",
        "28... b6": "A blunder. Na6 was probably the way to go, but he was clearly tired of moving it around.",
        "29. d4": "But now the knight is mine. The Black Queen would probably have to retreat to g7, and is wide open for more harassment. After that, 30. dxc5, bxc5, and then Qxc5 leaves White ahead a full two pawns and a knight, with the stronger White DSB vs the Black LSB. With an additional doubled pawn in front of the king, Black's game was clearly hopeless. Great match, and thanks for reading!"
    },
    "url": "https://gameknot.com/annotation.pl/the-blitz-series-pt-1-surprise-attacks?gm=57461",
    "gameName": "The Blitz Series Pt. 1 - Surprise Attacks!",
    "players": "Rickdaily12 (1576) vs. chad1313 (1200)",
    "opening": "Petrov three knights game (C42)"
}