{
    "moves": {
        "1. d4": "Hi all! This is the first game in a very fun team match. I have the Black pieces, and I experiment with the Dutch Defense--though it quickly turns into more of a Dutch Attack! I thought it was a very entertaining game; I hope you enjoy it!\n",
        "1... f5": "The Dutch Defense. I'm not very familiar with all the theory, but I'm eager to learn it more thoroughly!\n",
        "2. Bg5": "This is one of a few so-called 'anti-Dutch' lines. Black's dark squares in the center are notoriously weak, so this aims (among other things) to take advantage of them.\n",
        "2... g6 3. Nd2 Nh6": "I found a couple of mentions of this little Knight maneuver in the literature. I thought it was interesting, so I wanted to try it. The idea is to plant the Knight on f7 to lend support to the e5 and g5 squares weakened by Black's first move.\n",
        "4. e4 Nf7": "And the maneuver is complete! Now to see if it's as strong as I want it to be.\n",
        "5. Be3 fxe4 6. Nxe4 Bg7": "Both sides keep developing, albeit the pattern is a little strange thanks to the Knight maneuver and exchange in the middle. \n",
        "7. Bc4": "? It looks like a natural place to develop this Bishop, but unfortunately it also loses a piece.\n",
        "7... d5": "Forking Bishop and Knight.\n",
        "8. Bb5+": "Not particularly effective, I think.\n",
        "8... c6 9. Bd3 dxe4 10. Bxe4": "Black's isolated e-pawn is now his only real weakness, and he's up a Knight for a pawn. All he has to do now is hang on to that advantage.\n",
        "10... Bf5": "So Black gives White an opportunity to help him out.\n",
        "11. Bxf5 gxf5": "Now the e-pawn is no longer isolated. The more Black can trade down, the more his extra piece will be worth.\n",
        "12. Qd3": "Threatening f5 and preparing to castle queenside if White wants to.\n",
        "12... Nd6": "In retrospect I think 12...Qd7 was stronger, maintaining my claim to e5 in preparation for a pawn advance. \n",
        "13. Ne2 Qb6": "Threatening to win b2 and putting pressure on d4.\n",
        "14. Rb1": "Probably the best way to defend, and get the Rook off the long diagonal. White should be on the lookout now for opportunities to advance d4-d5 and discover an attack on the BQ.\n",
        "14... e6": "Attempting to free the Knight from defense duty, but I think this is actually pretty weak. In fact, the placement of this pawn on e6 will prove to hound me for the rest of the game.\n",
        "15. O-O Qa5 16. a3": "Defending the a-pawn, but I think Qb3 was much stronger.\n",
        "16... Nd7": "This Knight is hoping to make a journey across to the kingside. Now that White has castled over there, Black intends to use his open lines to blast in--or at least force some more favorable exchanges.\n",
        "17. b4 Qc7 18. Nf4": "Very strong place for this Knight.\n",
        "18... Nf8": "This is the best way to defend e6, in my opinion. Black is really regretting not keeping his Knight on f7 so he could push to e5.\n",
        "19. Nh5": "19.Qb3 was still better in my opinion.\n",
        "19... O-O-O": "Black's DSB is strong, but even exchanges continue to benefit him in the long run. So he gets his other Rook into action (lined up on the WQ, even!) and calls White's bluff regarding the threat to the Bg7.\n",
        "20. Nxg7": "? As I said above, I don't like this much. Exchanges are good for Black and this also allows him to swing his Queen over to the kingside without losing any time.\n",
        "20... Qxg7 21. c4 Rg8": "Of course. Threatening instant mate on g2. There's only one possible response.\n",
        "22. g3 h5": "Either by exchanging on g3 or by pushing on to h3, this pawn threatens to do serious damage to White's King's position.\n",
        "23. Bf4": "'Threatening' more exchanges--but again, I think they'd benefit Black.\n",
        "23... Ng6": "Trying to encourage White to follow through on his exchange.\n",
        "24. Bg5 Rd7 25. Bc1": "But, he doesn't. This is a weird place for the Bishop, in my opinion, but really it's not too bad. White's Rb1 isn't useful where it is, and he may need to be able to lift it to b2 and defend the kingside.\n",
        "25... Ne4": "Three thoughts. First, a direct threat on d4. Second is the general theory of moving more forces to the kingside. From e4, the Knight threatens f2 and g3, and I was anticipating it being useful in the coming assault. Third, the obvious way for White to defend d4 is with 26.Bb2, which takes the b2 square away from the Rook and gets the Bishop in a position that may prove too far removed to be able to effectively defend White's King.\n",
        "26. Bb2 h4": "The storm descends...\n",
        "27. Kh1": "White gets out of the (indirect) pin on his g-pawn. The computer actually considers this a huge mistake because of Black's next move...\n",
        "27... Ne5": "! Taking advantage of the pin on the d-pawn to get the Knight into position to threaten f3 and g4 (as well as the White Queen, obviously).\n",
        "28. Qe2": "?? This looks obvious and safe enough, but it's actually a huge blunder. White needed to keep his Queen in place to defend g3 with 28.Qb3. Now, there's actually a (longish) forced mate. Try to find it before going on...\n",
        "28... hxg3 29. fxg3 Nxg3+": "! This is the key move. Black's advanced Knight forks White's King and Queen, but if White takes it...\n",
        "30. hxg3 Qxg3": "This is the other move that takes a little looking to see. It's tempting to try to keep White in check, but that would actually allow the King to escape through g2 and maybe find safety on the queenside. The text allows no such escape.\n",
        "31. Rf2": "Delaying the incoming mate on h2...\n",
        "31... Rh7+": "Renewing the threat.\n",
        "32. Rh2": "Mate in three.\n",
        "32... Rgh8": "0-1. White sees that there's nowhere left to run, and resigns. Many thanks to my opponent for a great fight, and thank you all for reading! Comments are much appreciated; I'm sure I've missed things. Hope you enjoyed it!\n"
    },
    "url": "https://gameknot.com/annotation.pl/the-best-defense?gm=49075",
    "gameName": "The Best Defense...",
    "players": "zzac777 (1705) vs. bwaa (1769)",
    "opening": "Dutch, 2.Bg5 variation (A80)"
}