{
    "moves": {
        "1. e4": "This is my fourth annotation. In this annotation I would like to show you how you can come back from being the underdog near the beginning. As said in previous annotations, I always start with the king's pawn.",
        "1... e5": "One of the most common defences for this move. I was actually expecting this.",
        "2. Qf3": "Probably not the best option. Blocking a knight and a pawn. Attacking the black pawn on e5 would have been better.",
        "2... Nf6": "Just in case I went for the early checkmate, it was blocked.",
        "3. Nc3": "So my knight comes out to further defend the king's pawn.",
        "3... g6": "Could have played a move that opened up the centre of the board a bit more.",
        "4. Bc4": "The bishop comes out and my pieces start to take territory on the board.",
        "4... c6": "A move which opens up a queen and closes off a knight. ",
        "5. d3": "Opening up the bishop on c1 to dominate the centre of the board.",
        "5... b5": "Comes to attack my bishop.",
        "6. Bb3": "The only place I could move without being taken.",
        "6... a5": "About to close in my bishop. This is unstoppable, so I keep playing until he decides to attack.",
        "7. Bg5 Be7": "The defence for the knight. Also defending his queen in the process.",
        "8. O-O-O": "I castle queen side. Time to defend the king. Castling usually puts the king away and pretty safe if the pawns in front are there. Give the king a bit of room to move around though, otherwise if trapped, the game could be over in a few moves.",
        "8... h6": "Attacks my bishop on the black square.",
        "9. Bh4": "I move to still attack the knight.",
        "9... a4": "If I am about to lose a bishop, I might as well take something anyway.",
        "10. Bxf6": "Tried something else first.",
        "10... Bxf6": "And to no surprise, the bishop is taken.",
        "11. Nxa4": "I take the pawn on a4 and in the process, losing my knight.",
        "11... bxa4 12. Bc4": "I put my bishop away to safety.",
        "12... Bg5+ 13. Kb1": "Not much else I could do.",
        "13... O-O": "Black castles king side. White still has most control over the board.",
        "14. h4": "A very not-so-smart move losing another pawn.",
        "14... Bxh4 15. g3": "I go for the attack again waiting for black to retreat.",
        "15... Bg5 16. Nh3": "The knight comes out to attack the bishop again.",
        "16... Bf6": "Black moves the bishop out.",
        "17. Ng1": "A waste of a move, really, although opening the attack on h6.",
        "17... h5": "Of course, black sees this and blocks the h-file attack.",
        "18. g4": "Still trying to attack on the side.",
        "18... Ba6": "Didn't expect that. But then again, what was black meant to do?",
        "19. Qe3": "The queen moves to attack the h-file. If the pawn on h5 is removed, the path to checkmate is near.",
        "19... Bg5": "The bishop comes to attack my queen. Time to try another attack.",
        "20. Qh3": "Sticking to the h-file still.",
        "20... Bxc4 21. dxc4": "Exchanging bishops.",
        "21... c5": "Opening the knight in black's defensive line.",
        "22. gxh5": "Time to deliver the h-file attack.",
        "22... gxh5 23. Qxh5 Kg7": "So close.",
        "24. Rd6 Rh8": "Blocked, forking my rook on the other end. Unless...",
        "25. Qf3": "I defend it too.",
        "25... Qe7": "My rook is under attack from the queen. Black has taken domination of the board.",
        "26. Rxh8": "Exchanging rooks in the back corner of the h-file.",
        "26... Kxh8 27. Qh5+": "Giving my rook more time to get out of there.",
        "27... Kg7 28. Rd3": "Really the only way to save my rook was to move it out.",
        "28... Qf6": "Attack on the f2 pawn.",
        "29. Nh3": "If I can get that bishop out of the way, I might be able to finish black.",
        "29... Bh6": "Defending the king, ensuring not to lose the game.",
        "30. Rg3+": "Attack on the g-file.",
        "30... Kf8 31. a3": "Opening up the king for a not-so-nice attack from black.",
        "31... Nc6": "Knight comes out from the defensive line.",
        "32. c3": "Maybe opening up the king a little too much.",
        "32... Ke7": "Black gets his king out of the black line to give the rook a bit more space at the back.",
        "33. f3": "Just making sure the pawn won't get taken.",
        "33... Na5": "The knight wins a pawn.",
        "34. Ng5": "The knight comes in hoping the bishop would move away and get taken by the rook.",
        "34... Bxg5 35. Rxg5": "I do exactly that.",
        "35... Rh8": "The rook is planning to get my king on the defensive line.",
        "36. Rxe5+": "I check the king.",
        "36... Kd8": "He moves back. Maybe Kd6 would have been better in winning the rook.",
        "37. Qg5": "Had to get the queen away.",
        "37... Qxg5": "We exchange queens which is not so good for me as even though we are close on points, I'm running out of pieces to work with.",
        "38. Rxg5 Nxc4": "Black takes my pawns one by one.",
        "39. Rxc5": "We both try to win each other's pawns.",
        "39... Nd2+": "And also to get the other player into a bad position. topknot33 tries to corner my king and blocking off my openings.",
        "40. Ka2": "Maybe Kc2 would have been better.",
        "40... Nxf3": "Slowly losing my pawns. Maybe Rh1 would have almost finished it.",
        "41. Ra5": "Trying to fork the rook on the other side of the king.",
        "41... Nd2": "Maybe black didn't see that.",
        "42. Ra8+": "Successful.",
        "42... Ke7 43. Rxh8": "If I capture the knight, maybe I could win.",
        "43... Nxe4 44. Rh4": "Hoping the knight wouldn't move to Nc5.",
        "44... Nc5": "I knew it. Black obviously wouldn't give up a pawn. Why would he anyway?",
        "45. b4": "Hoping that black wouldn't pull of the en passant. See how much luck I'm depending on?",
        "45... Nb3": "The en passant would have worked better and the promotion of a queen would have come up quick.",
        "46. b5": "I try promote my own pawns, and also attacking a4.",
        "46... Kd8": "Winning a pawn at this time of the game is pretty good. Black is running out of checkmate options, and is a few points down (which is not that bad).",
        "47. Rxa4": "I win the pawn. This game has turned dramatically after losing by the same amount of points (please see the_golfer vs obee_ton as I prove that being ahead doesn't really matter in the end).",
        "47... Nc5": "Not unexpected for black. What else was there to do? Maybe Nc1 though...",
        "48. Ra7": "Trying to promote my pawn would definitely win the match.",
        "48... Kc8": "The king comes in. At this stage, the king is vital in achieving checkmate.",
        "49. Ra5 Kb7": "The king closes in on winning the rook or pawn.",
        "50. c4": "The pawn defence.",
        "50... f5": "Better be careful now. The f-file pawn is free and is soon going to turn into a queen.",
        "51. Kb2": "I try to stop it with my king. I will get there first even though we are going at the same slow pace.",
        "51... f4 52. Kc2 f3 53. Kd2 f2 54. Ke2 Ne4": "Not unexpected (yet again).",
        "55. Ra6": "The rook moves up on the a-file attempting to promote a pawn.",
        "55... Nd2": "Nd2 allows me to take the almost promoted pawn, but lose c4.",
        "56. Kxf2 Nxc4 57. a4": "Moving up to support promotion.",
        "57... Na3": "Comes in for an attack on the pawns.",
        "58. a5": "Losing b5.",
        "58... Nc4": "Decides not to go with it.",
        "59. Kf3": "If I lost my pieces, I would need to get my king into the action.",
        "59... d6": "A slow way to get a pawn promoted on the d-file.",
        "60. Ke4": "The king keeps going.",
        "60... Kc7": "And black finally moves away.",
        "61. Kd5": "What will black pull off now?",
        "61... Na3": "The knight is back where it moved four moves ago. A waste of moves?",
        "62. b6+": "The pawns are past halfway.",
        "62... Kd7": "The king would have been better of Kb7 although I would have responded Ra7+.",
        "63. b7": "The pawn is on the last line.",
        "63... Kc7": "Of course black would do that.",
        "64. Rxd6": "Ra7 would have been better there.",
        "64... Kxb7": "Losing a pawn. Made some bad decisions here.",
        "65. a6+": "The king is running out of options.",
        "65... Ka7": "Annoying, as I don't have much to work with anymore.",
        "66. Ke6": "So I try to close the king in with my own king. Expecting the knight to move now.",
        "66... Nc4": "Nice move. If black clears the pawn, the white king is free.",
        "67. Rc6": "Is black going to finally retreat?",
        "67... Nb6": "Here comes the interesting part of the game.",
        "68. Kd6": "Probably the best move I could pull.",
        "68... Kxa6": "The knight is now forked to the king. Time to take it.",
        "69. Kc5 Kb7 70. Rxb6+": "Success. The game has turned unexpectedly for me.",
        "70... Kc7": "Now to trap the king in the a-file corner.",
        "71. Rd6 Kb7 72. Rc6 Kb8 73. Kb6 Ka8": "The last legal move and the last move for black.",
        "74. Rc8#": "The game ends in a win for me, although I played a lot of silly moves, I could still come out to win. I would like to thank topknot33 for the game. It was great to play with you. Thanks also to blake84120."
    },
    "url": "https://gameknot.com/annotation.pl/the_golfers-mini-tournament-1-the_golfer-vs-topknot33-1-6-09-17-6-09?gm=24554",
    "gameName": "the_golfer's mini-tournament #1 the_golfer vs topknot33 1/6/09 - 17/6/09",
    "players": "the_golfer (1251) vs. topknot33 (1256)",
    "opening": "KP (C20), Napoleon's opening"
}