{
    "moves": {
        "1. e4": "Hello my fellow chess playing fans.I  would like to share this game with you.My opponent lost this game in way i once did in a bad habit i once did a lot.Hopefully i have broken this habit.It waspointed out to me and worked on  by my friend ,trachess,THE GREATEST CHESS PLAYER I EVER KNOWN.I dedicate this annotation to him.Okay here we go.I OPEN WITH E4",
        "1... e5": "Standard e5 response.The e5 response has caused me trouble in past,i have been victim of \"fools mate\".This is what i try to set up.",
        "2. Bc4": "Rev to c4",
        "2... Nf6": "Opponent counters with Nf6 maybe thinks i setting up for bishop and queen attack.Which i was going to do",
        "3. Nf3": "Nf3 so i can castle next",
        "3... d6": "Good move by opponent,nice chain",
        "4. O-O": "Castle",
        "4... Nxe4": "Here is where my opponent  starts to lose game.Attacking to quickly with not enough development.Been guity of this mistake also.",
        "5. Qe2": "Spooking cowboy(PLEASE FORGIVE HALLOWEEN  REFERANCE LOL) Looking back i also could have went d3 and started chain then he would have possibly went Ng3 sacficing Ng3 if i had went h2xNg3.If i had done this he would have hole in wall and he would have walked in withQ and Bc8.Or if for some reason i left Ng3 he could have Ng3xRf1",
        "5... Nf6": "RETREAT!!!His development now in real trouble.If you notice i have a lot of pressure on center",
        "6. Nc3": "Bring out other cowboy.Riding hard toward victory",
        "6... Bg4": "Admit this  is a good pin.But notice what i do next",
        "7. d3": "Opening door to release bishop",
        "7... Bxf3": "Expected i am now 2 pieces down.But Bf3 has no backup.Some say this is piece for piece.But to what advantage?What was that old saying of a thousand cuts?",
        "8. Qxf3": "Cancel Bf3 like a stamp.I am now better developed and only 8 moves into game.",
        "8... Be7": "He moves Be7 backing up Nf6",
        "9. Bg5": "Pin.Also i am setting up for the kill with both bishops and Queen.Nf6 is in my way my only problem.",
        "9... Nfd7": "Okay major blunder here.I believe he was thinking i would move  Bg5 because Be7 is backed up with queen and king.But he did not look at whole board.Been guilty of this myself.His king in my crosshairs.",
        "10. Qxf7#": "BANG!!!Qxf7 backed up by Bc4 and Bg5.Kinda like a arrowhead huh?Under development and fruitless unsupported early attack cost game for my opponent.I hope you have enjoyed this annotation and possibly learned something.As always postive feedback accepted,negative tolerated.Have a nice day!"
    },
    "url": "https://gameknot.com/annotation.pl/the_special_cats-mini-tournament-i?gm=56647",
    "gameName": "the_special_cat's mini-tournament I",
    "players": "hiredgun112 (970) vs. ownerof6cats (1013)",
    "opening": "Bishop's opening (C24), Berlin defence"
}