{
    "moves": {
        "1. d4 Nf6 2. c4 c5 3. d5 e6 4. Nc3 exd5 5. cxd5 d6 6. e4 g6": "Benoni 6, no surprise, A65",
        "7. Bb5+": "Not an ECO line, but not poor for white. Black has to be careful not to get his knights pinned all over. ",
        "7... Nbd7": "The white squared black bishop is often a very useful piece in the benoni, and is better than white's white squared bishop, often boxed in by its own pawns. ",
        "8. Nge2": "Nf3 is stronger, white shouldn't make the black squares (specifically e5 and d4) so easy to control. ",
        "8... a6 9. Bxd7+ Bxd7": "black already has equal (if not better) development and the bishop pair, looking to free open the board. ",
        "10. O-O Bg7 11. h3": "A waste of a move, in my opinion. The knight can get to e5 via d7 if it wanted to that badly, and if Bg4 would probably not be played on account ofr f3 being open. Better is Bf4, or Be3 developing. ",
        "11... O-O": "I was considering playing b5 here, going for the initiative, but decided to rather castle and finish developement first. ",
        "12. Bf4 Qe7 13. f3": "better is Ng3, as the knight is horrorous on e2, and this move completely weakens the black squares around white's king. ",
        "13... Nh5 14. Be3 b5": "black plays both sides of the board, looking for spacial advantage on the queenside with a queenside initiative. The vast majority of his pieces are aimed at the center and the queenside. ",
        "15. a3": "Yet another wasteful pawn move, in my opinion. White doesn't seem to have much of a plan, and definately does not have the initiative. Qd2, with developement, seems better, or perhaps g4?! with a tenacious kingside attack. ",
        "15... f5": "Black has achieved his two ideal pawn breaks in the benoni on b5 and f5. This is not good for white. ",
        "16. Qc2 b4": "working the queenside initiative. ",
        "17. axb4 cxb4": "black now has play on the open C file as well. ",
        "18. Na4 fxe4": "Whites pawn structure is crushed, and his pieces very uncoordinated. Black enjoys a deadly long a1-h8 diagonal, a strong white squared bishop, and an open C file. ",
        "19. fxe4": "I almost think f5 may have better. ",
        "19... Rxf1+ 20. Kxf1": "Rxf1? Rc8 w/Qxe4. ",
        "20... Rc8 21. Qb1 Bb5": "Another piece moves in on the white territory. White is being devastated in his attempt to defend. ",
        "22. Nb6 Rf8+ 23. Ke1": "trying to hold the knight. ",
        "23... Qh4+": "white's king is being fired on heavily. ",
        "24. Kd2 Ng3": "A very powerful move. ",
        "25. Nxg3": "White has to take or his knight will fall. ",
        "25... Qxg3 26. Qg1": "This is a perfect example of how although both sides are even in material, black is probably about 10 points up positionally. ",
        "26... Bh6": "A deadly blow to the white camp, taking the bishop leads to checkmate. ",
        "27. Re1": "see all the pins and attacked squares around the white king?",
        "27... Rf2+": "Still even in material, white resigns. He will lose his e4 bishop next turn, anyway, and his position won't be any better. "
    },
    "url": "https://gameknot.com/annotation.pl/thematic-benoni-6-for-fast-players-only?gm=15975",
    "gameName": "Thematic Benoni 6 for FAST players only",
    "players": "miszka (1646) vs. jakey101 (1748)",
    "opening": "Benoni (A66), pawn storm variation"
}