{
    "moves": {
        "1. d4 Nf6 2. c4 c5 3. d5 e6 4. Nc3 exd5 5. cxd5 d6 6. e4 g6 7. Nf3 Bg7 8. Bd3": "This is the classical Benoni. ",
        "8... O-O 9. O-O Re8 10. h3": "This prevents black from playing Bg4 in hope of exchanging the Knight that supports the e4-e5 advance. ",
        "10... a6 11. a4": "B5 can not be allowed",
        "11... b6": "a little slow normal is Nbd7",
        "12. Re1 Ra7": "An interesting idea of doubling the rooks on the e file in order to put preasure on e4. However, such a moves signal to me that I should switch my attack. ",
        "13. Bf4": "This is a naturally strong square for the bishop it targets blacks backward d pawn. ",
        "13... Rae7": "my opponent has done a good job in preventing the e4-e5 break. Which leaves me to be thinking about creating another weakness. ",
        "14. Nd2": "Defends e4 and sets up a samish system for white. For those who do not know what a samish system is it is the pawn structure extending from g2 to d4. The key feature is the pawn of f3 which ensures that the nature of the game progresses along quieter lines. \r\n\r\nThis type of set up is ideal for this game because the black rooks remain locked behind a wall of pawns. ",
        "14... Nh5": "another reason why it is good for white to play h3 early is to avoid this exchange of the bishop.",
        "15. Bg5": "Not Be3 when black does not have to pay for forcing me to move my bishop. This creates a weakness and blockaids the bishop on g7. ",
        "15... f6": "Good, my job is done it is time to retreat. ",
        "16. Be3": "This is a nice position for white. Black has a few problems to workout like his knight has no room to move. Which makes it an easy target. But the real problem for black is that he is in a zugwig. ",
        "16... Bf8": "If this is the best that black can do then he may have to rethink his plan. ",
        "17. Nc4 Qc7 18. b4": "And white breaks through black's defense. ",
        "18... cxb4 19. Bxb6": "I am like a python that is slowly squeezing the life out of my opponent. It would be tempting to feel that one has to move the knight however, I am always on the look out for stronger counter punches.  ",
        "19... Qd7 20. Ne2 Re7xe4": "a big blunder that gives up a rook for very little in return. ",
        "21. Bxe4 Rxe4 22. Rc1": "and black resigns. My plan was to play Nd4. "
    },
    "url": "https://gameknot.com/annotation.pl/thematic-benoni-4-for-fast-players-only?gm=12082",
    "gameName": "Thematic Benoni 4 for FAST players only",
    "players": "elyhim (1850) vs. drsbd (1822)",
    "opening": "Benoni (A70), classical without 9.O-O"
}