{
    "moves": {
        "1. d4 Nf6 2. c4 c5 3. d5 e6 4. Nc3 exd5 5. cxd5 d6 6. e4 g6": "The basic Benoni structure.",
        "7. Bd3": "I don't like this move very much, as the bishop is currently blocked by the e pawn, and is easily harassed with a knight on e5. however, it does open up Nge2, leaving f4 as a flexible option. ",
        "7... Bg7 8. Nge2 O-O 9. O-O Nbd7 10. h3": "I was a little surprised at this move, Ng4 isn't really a threat, and h3 just seems to be a pawn weakening move. ",
        "10... Ne5 11. Bc2 Qe7": "attacking the e pawn ",
        "12. Ng3 a6": "stopping Nb5 and preparing b5.",
        "13. a4": "stopping b5.",
        "13... h6": "stopping the annoying Bg5. ",
        "14. f4": "kicking my knight off of it's good outpost abd staking more room and control of the center. ",
        "14... Ned7 15. Qd3 Ne8": "leaving f5 as an option, and looking to swing my knight to c7 if needed. ",
        "16. Bd2 b6": "preparing a5, with a grip on the dark squares. ",
        "17. Rae1": "taking more center control ",
        "17... a5": "threatening Ba6, getting my very poor bishop active. ",
        "18. Bc1 Ba6 19. Nb5": "the knight can stay here for now, where it's pinned. ",
        "19... Qh4 20. f5": "this is a bold attacking move, but it heavily weakens the dark squares even more, now giving up the e5 outpost for good. ",
        "20... Bd4+ 21. Kh1 Ne5": "I will win the exchange due to the third rank weaknesses, when white must cover the knight. ",
        "22. Qb3 Bxb5 23. axb5 c4 24. Qa3": "white's queen must stay on the third rank to cover the g3 knight. ultimately, h3 is coming back to haunt white. ",
        "24... Bc5 25. Qc3 Bb4": "now the exchange is won, and it was forced. ",
        "26. Qe3 Bxe1 27. Rxe1 Nf6": "bringing my knight into an attack. ",
        "28. fxg6 fxg6": "while this may weaken my king, it opens the f file completely to my rook, and white can't make any immediate attacking threats. Qxh6 trades down to a won endgame for me. ",
        "29. Bd2": "however, white missed the attacking threats of my own. ",
        "29... Nfg4": "and not, Neg4? Anticipating your next attacking move is crucial when attacking. ",
        "30. Qc3 Nf3": "a move worthy of an exclam! white resigns as he is lost. The threats are too great to deal with. The most obvious threat is Nf2, checkmate. However, after gxf3 black has checkmate after Qxh3 .\r\n\r\nThe only way to stop mate would be to sack a queen and an exchange, in which the game is just over. "
    },
    "url": "https://gameknot.com/annotation.pl/thematic-benoni-6-for-fast-players-only?gm=16829",
    "gameName": "Thematic Benoni 6 for FAST players only",
    "players": "renatello (1899) vs. jakey101 (1839)",
    "opening": "Benoni (A66), pawn storm variation"
}