{
    "moves": {
        "1. d4": "Queens Gambit Accepted.",
        "1... d5 2. c4 dxc4 3. Nf3 h6 4. e3 Bg4 5. Bxc4": "Forces black to defend vulnerable f7.",
        "5... e6": "Easiest way to defend f7, however, does it hinder black's development? Could this have been left until later?",
        "6. Nc3": "This is a free development move, not forced by Bb4, though that is the obvious reply to keep the knight pinned.",
        "6... Bb4 7. Qd3": "Invites the exchange, hoping to open up the g file, while also bringing the queen into play.",
        "7... Bxf3 8. gxf3 Ne7": "Black should probably forget about castling kingside at this stage, and could probably have done better than this. Nf6 perhaps, or even Qg5.",
        "9. e4 Bxc3+ 10. Qxc3": "While black has been preparing to castle, white has taken position to threaten the castled king on g8. White has maintained control over the centre of the board, and can dictate the pace of the game from here, provided he executes the correct moves.",
        "10... O-O 11. b3 Nbc6": "Too little too late? Black attempts a strong counter, attacking the pawn on d4, but it's easily defended. Positioning is key in this game, and black just doesn't have enough of it.",
        "12. Be3": "Defends the pawn, while opening the first rank for the queenside rook.",
        "12... a6": "A wasted move. It suggests b5 will follow, but black hasn't given enough space even for this at this late stage, as white tightens his grip.",
        "13. d5": "White offers a pawn, aware that the natural sequence that follows sets the stage to wrap it up. The rook awaits deployment to d1, preventing dxc4 after 13...exd5.",
        "13... exd5 14. Rd1 d4": "An attempt to salvage something? No. White has seen this coming, and knows that the black queen can be forced out of the game.",
        "15. Bxd4 Nxd4 16. Rxd4 Qe8": "As planned, black's queen is now trapped out of the game, and white can focus on conjuring mate.",
        "17. Rg1": "Finally using the threat of the open g file to full advantage.",
        "17... g6": "The only response? Ng6 is not possible, as Rxg6 would follow with the pawn on f7 pinned. The only advantage would have been an attempt to bring the queen back into the game, but it's too late for that now.",
        "18. Rd5": "The sacrifice. The rook is far too tempting, especially given that it doubles as an attack on the white queen. Black hopes this will displace white's attack, but it merely sets the endgame in motion.",
        "18... Nxd5 19. Bxd5": "Once again pins the pawn on f7, but this time there's nothing to stop Rxg6 ",
        "19... c6": "g5 would have been better, as it would have delayed an imminent mate. Perhaps black has noticed the game is lost and rather than resigning offers white the respect of showing his final moves.",
        "20. Rxg6+": "Hammer blow. No defence remains.",
        "20... Kh7 21. Qg7#": "One of my better games, against a stronger, more experienced player. The focus was all on keeping the pressure on and preventing my opponent from making a threat at any stage."
    },
    "url": "https://gameknot.com/annotation.pl/thematic-grand-prix-stage-2?gm=4109",
    "gameName": "Thematic Grand-Prix: Stage 2",
    "players": "searcoid (1206) vs. achilles13 (1514)",
    "opening": "QGA (D21), 3.Nf3"
}