{
    "moves": {
        "1. e4": "A rollicking good game, particularly for the psychological see-saw the game took me and my opponent (Matsumoto) into. We were both under great time pressure at the end of the game. The moves we made are sometimes not the best and we both missed our chances, but Hell ! what a rollicking good game that was !",
        "1... a6": "The St. George defense.\nWhen an opponent plays something unusual , I ussually try to transpose the game into the openings i know. So, This move made me think .I thought for about 15 seconds and decided to avoid any plans that would involve a pin of black's Knight at c6 , also I couldn't use c4 for my bishop due to the threat of b5.\nMoreover I ussually prefer to castle on the queenside with white, Now I should avoid that.",
        "2. Nc3": "This move keeps my options open",
        "2... g6": "Now black's plan is getting clearer. He wants to play on the dark central squares and He would castle on the Kingside.",
        "3. d4": "Opposing black's plans on the dark squares",
        "3... d6": "As predicted",
        "4. f4": "Re-exerting control over the dark squares by preventing e5",
        "4... Bg7 5. Nf3": "Both of us are staking claim on the dark squares.\nWe have now reached a position from the Robatsch defence/Pseudo-Austrian attack by transposition.",
        "5... Nd7": "Black's options here are\ne6\nf5\nb5 (Book move - Robatsch defence)\n\nHowever he deviated from the book with this Knight move. I don't think it is a bad move though as it \na.Hits the central dark square e5\nb.Keeps the option of c5 if needed\n",
        "6. Be3": "I prevent c5 and I plan to exchange this bishop with the fianchettoed one by Qd2 and Bh6",
        "6... Ngf6 7. h3": "If I allow black to play Ng4 , he'd take my Bishop on e3 and I shall not be able to exchange it with Bg7. \nThis move also allows me to start a pawnstorm to attack the black King after he castles. \n\nChess engines rate any move available to my white Bishop at f1 better than this, but this was a blitz game and I loved the idea of a kingside pawn storm.",
        "7... O-O 8. Qd2": "Consistent with my plan of exchanging his fianchettoed dark squared bishop my own dark squared bishop",
        "8... c5": "Initially I had thought i wouldn't castle on the queenside because i was afraid of a pawnstorm there. But now I reflexively decided to do it  and have a go at the black king with a pawnstorm. I thought my pawns would bite faster than his.\r\n\r\n",
        "9. O-O-O": "\"Never attack till your Queen's rook has been activated\" - Seigbert Tarrasch",
        "9... Qc7": "Question mark ? Black should start his own pawn storm against me before deciding where to place his queen.\r\n\r\nI think black should have played either simply cxd4 (which would give his knight the option of coming to c4) or simply b5",
        "10. e5": "I simply do not understand why I deviated from my plan of playing dxc5 followed by starting the pawn storm with g4. \"Blitz - Bloody Hell !\"",
        "10... Ne8": "Instead of this retreat cxd4 or Nh5 are better. Now my position is winning (and decisively so) !\r\n\r\nQuestion for the reader : What do you think is the best move here ? (do not read further till you've answered)\r\nAnswer : I should have occupied more space by 11.Nd5 ! driving the queen back. (work out the variations if you want to be convinced)\r\n\r\nBut this is not what I did.\r\nI played _____________",
        "11. f5": "11.f5??\r\n\r\nBefore I played this move Fritz gives me an advantage of 2.03, but after this move it gives me -0.09.\r\nSo now I(white) is losing !\r\n\r\nbecause 11...cxd4 12.Bxd4 dxe5 13.Nd5 Qd6 14.Be3 gxf5 15.Bc4 Nc5. \r\n\r\nBetter was Nd5, leading to 11...Qd8 12.dxc5 dxc5 13.Bxc5 Nxc5 14.Nf6+ Nxf6 15.Qxd8 Rxd8 16.Rxd8+ Bf8 17.exf6 exf6 18.Bc4. This line would have kept the 2.03 I had.",
        "11... dxe5 12. fxg6": "??\r\n\r\nNow I reach new depths with a score of -0.94 from Fritz. Gosh I lost 3 points from +2.03 to -0.94 in just two moves.\r\n(+ is advantage white, - is advantage black for the uninitiated)\r\n\r\nThe only variations in my whole annotations\r\nThis leads to 12...cxd4 13.gxh7+ Kxh7 14.Ng5+ Kg8 15.Qd3 Nef6 16.Nd5 Qd6 17.Nxf6+ Nxf6 18.Ne4 which is bad for me (white)\r\n\r\nI should have played Nd5, leading to 12...Qd6 13.dxc5 Nxc5 14.Qb4 b6 15.Qxb6 Ne4 16.Qxd6 N8xd6 17.Nxe7+ Kh8 18.Nxc8 Rfxc8 19.fxg6 hxg6",
        "12... cxd4 13. gxh7+ Kxh7": "I am going to lose unless I do something drastic !",
        "14. Nxd4": "And here it comes !\r\nThis piece sac and the few moves that follow it change the nature of the game and allow me to draw it",
        "14... exd4 15. Bxd4 Bxd4 16. Qxd4 Nef6 17. Qh4+": "Congratulations to me, the score is again 0.0 by Fritz - No advantage to either Black or White. \n\nNow i decided to bring my queen closer to the King.",
        "17... Kg7 18. Qg5+ Kh8": "The reason Fritz said it was a 0.0 at move 17 was because now I can force repetition by Qh5 and Qg4..If black tries to put his Knight at h7 he loses quickly.\r\n\r\nBut ! this is not what I did...I was thinking of victory now\r\n\r\nSo------------",
        "19. Qh6+": "follows.",
        "19... Nh7 20. Rd4": "threatening Rh4",
        "20... Qe5 21. Bd3 f5": "The rook had to be brought out before this bishop",
        "22. Rh4 Ndf6": "??\r\nI missed a win by Qxf8 here. Silly Blunder in time pressure !",
        "23. g4 Rf7 24. g5 Qe3+ 25. Kb1 Ng8 26. Qh5 Be6 27. g6 Ngf6": "Both of us were under huge time pressure here. So I decided to decrease the complications. I thought that a safe king and a passed h pawn will win me the game",
        "28. Qe2": "So , I offered to exchange the queens. And here my opponent's clock ran down and he lost. "
    },
    "url": "https://gameknot.com/annotation.pl/thinking-not-thinking-win-lose-draw-in-28-moves?gm=34130",
    "gameName": "Thinking/Not Thinking : Win-Lose-Draw in 28 moves ",
    "players": "chess-writer  vs. matsumoto (1900)",
    "opening": "St. George (Baker) defence (B00)"
}