{
    "moves": {
        "1. e4": "Endali is a good friend of mine.I have played him twice before losing both times so I was nervous..He opens up with 1.e4 which is not what he usually plays (1.d4)",
        "1... Nf6": "Endali is an avid chess book collector and I heard that he bought books on 1.e4 e5,which is my normal move.I thought it would be suicide playing that.It turns out he did not read them at all.",
        "2. e5": "Harassing the knight.",
        "2... Nd5 3. d4 d6 4. Nf3 Bg4": "This is the main line so far.",
        "5. exd6": "5.Be2 is the main line.",
        "5... exd6 6. Be2 Be7 7. O-O O-O 8. c4": "Attacking the knight once more.",
        "8... Nb6 9. Nc3 Nc6 10. b3": "We are still in known territory.",
        "10... Bf6": "Giving the bishop more activity and threatning to win the b-pawn by 11...Bxf3 12.Bxf3 Nxd4",
        "11. Be3 d5": "Making the long awaited pawn break in the center.",
        "12. c5 Nc8 13. Qd2 Nc8e7 14. h3": "Attacking the Bishop and giving luft (breathing space) to the king.",
        "14... Bh5 15. Nh2 Bxe2 16. Nxe2 Nf5": "Still focusing on the d-pawn.",
        "17. Nf3 Nxe3": "I like this move because now I have a bishop for a knight and I can attack the queen by 18...Re8 after 18.Qxe3 or leave White with a backward pawn after 18.fxe3.So I am changing plans.I am no longer attacking the d4-pawn,I am now trying to open up the position for the bishop.",
        "18. Qxe3 Re8": "attacking White's queen and moving the rook on the half-open file.",
        "19. Qd2 b6": "trying to undermine the c5-pawn",
        "20. Rac1": "better than 20.cxb6 axb6 when the d4-pawn becomes a permanent weakness.Also Black could use the half-open a-file to his advantage.",
        "20... Ne7": "Moving the knight away because if I didn't 21.cxb6 could have a discovered attack on the knight.Still,I think 20...Qd7 might be a better alternative.since the knight was blockading the pawn.",
        "21. b4": "supporting the c5-pawn",
        "21... bxc5 22. dxc5 Nc6 23. b5 Ne5 24. Nxe5 Bxe5 25. Rfd1 Bf6": "A sneaky trap.",
        "26. Nd4": "26.Qxd5? Qxd5 27.Rxd5 Rxe2.",
        "26... Bxd4": "Otherwise the knight might go to c6 and wreak havoc.",
        "27. Qxd4 Re2 28. Rd2": "28.Qxd5? Re1+!",
        "28... Rxd2 29. Qxd2 Qd7 30. c6 Qd6 31. Qd4 Qa3": "Here I offered a draw which endali declined.",
        "32. Re1 Qxa2 33. Qe5": "I expected 33.Ra1.I worked out reams of lines against it,but I will post that another day.",
        "33... Qa3 34. Qxc7": "Here endali offered a draw which I accepted.However there is still a lot of play in this position.Black has a  weakness on the back rank and the c6-pawn might be hard to stop.However White has to be careful not to allow perpetual check.I also worked lines out for this,but that I will post later.All in all it was a very exciting game."
    },
    "url": "https://gameknot.com/annotation.pl/thrajins-may-2009-invitational?gm=24000",
    "gameName": "Thrajin's May 2009 Invitational",
    "players": "endali (1743) vs. rookie879 (1401)",
    "opening": "Alekhine's defence (B05), modern variation, 4...Bg4"
}