{
    "moves": {
        "1. e4": "Anyway Im sidetracking for today's annotation, in the greetings. An aspect of my game I've been missing is generating threats with moves and the abuse of outposts and watching higher players play and comment their games makes you learn a thing or two. \n\nSo todays game will demonstrate the use of an Outpost that generates checkmate threats and what happens when that threat is overlooked.",
        "1... Nc6": "Those who've seen some of my annotations might know I like to annotate to save games I want to save, and can be quite entertaining. Also why I like annotating here on gameknot, I rarely see nimsovich opening annotations by black. I have a few in my repertoire of annotations now but all with different lines. Thus why I like this opening.",
        "2. d4": "That all being said this game merits a save cause it was almost a perfect game (1 innacuracy and 1 mistake and my mistake was  because there was a stronger move to play).\n\nWhite doesn't allow for my favorite Gambit here and I prefer the scandanavian defense with d5.",
        "2... d5 3. e5": "Very rare that in multiple days time control I get an exchange on d5. ",
        "3... Bf5 4. Nf3 e6": "Natural opening moves done here. White tends to take different routes at this point. They can develop their other knight play either bishops or sometimes their c pawn tend to be the 4 pieces that will move.",
        "5. Bd3": "My opponent goes bd3 here and in the past when facing this I would always exchange lsb's here and let their queen come out. ",
        "5... Bg6": "This I stole from my recent internet viewings. I quite like letting white do the exchange and not letting his queen out. And if he wants to open my h file all the better. Nimso games where I get a queen side castle tend to go well for me. ",
        "6. c3 f6": "And with c3 and his queen not out I can strike at the middle right away. Usually f6 would have to come at a safer time if lsb's were off the board and whites queen had roaming ability.",
        "7. Bxg6+ hxg6 8. h3": "And so white gives the open file but I guess h3 is to hinder rook exit somewhat. Although what I like about the opening of the h file is not to take the rook out necessarily but the threats this open file can give if white castles king side.",
        "8... Nge7": "In games where white has that nice pawn chain connected with c3 and black having played nc6 , blacks dsb has to be patient and might only be able to come in play when whites dsb comes in direct play.",
        "9. Bf4 g5": "Discomfort the dsb and gain space for Knight also this was to invite dxf6 to undouble my pawns. But white doesn't want a nice Outpost for his Knight on d5.",
        "10. Bh2": "Here a little Knight dancing. I have to exchange a piece is my thought to gain maneuvering room.",
        "10... Ng6 11. Qe2": "Looks like my opponent is going queen side castles also.",
        "11... Nh4": "Here I was gonna let him exchange the knights out originally",
        "12. Rg1": "But when he replied this I judged that letting him exchange wouldn't be good anymore and since he doesn't seem to want to exchange on f6 I don't mind tempting him with letting him open the file",
        "12... Nxf3+ 13. Qxf3": "He didn't accept my generous double pawn offer :)",
        "13... f5": "And so now I can close the middle and look to lock up queen side and then castle.",
        "14. Nd2": "Final piece development for white before castling",
        "14... a5": "I played this to trick my opponent into not queen side castling hehe but also to get him to move the pawns into a lock up if he wants to queen side castle.",
        "15. a3": "I liked this response.",
        "15... b5": "This, in post analysis, is my first inaccuracy. The computer suggests g4 here and I have to agree g4 looks good cause I got myself into a scare in a few moves.",
        "16. Qd3": "Once he replied this I enjoyed it. It allows me to move my Knight out of my pawns way and I was eyeing the out post on c4 through na7 -> nc8 -> nb6 -> nc4 after the pawn lock up.",
        "16... Na7": "Step one",
        "17. b4": "The lock up I wanted!",
        "17... a4": "Click",
        "18. Rh1": "Here I was still fortifying maybe overlooking whites future plans.",
        "18... c6": "But all my moves look natural and logical so far.",
        "19. O-O-O": "Finally he castles!",
        "19... Qd7 20. g4 g6": "After he strikes at f6 comes the opurtunity to undouble pawns and it is very Important to Not give whites queen access to the g6 square when not castled as black.",
        "21. Rdg1": "Whites commiting all in to a kingside attack at this point",
        "21... Be7": "My Knight looks to be far from the frey, have to activate bishop before castling",
        "22. f4": "I was hesitating here to let him exchange and have my dsb on g5. But he would be badly defended and attacked by a rook once pawn exchange on f6. So it's better if black exchanges here.",
        "22... gxf4 23. Bxf4 O-O-O": "I can finally castle but the scary part is coming. ",
        "24. gxf5 gxf5 25. Rg7": "This here is very scary to me and that passed pawn is a ticking time bomb now!",
        "25... Kb8": "But don't panic and get to your plan the threats of nc4 is so strong combined with just my queen.",
        "26. Bg5 Nc8": "This temporarily protects dsb and is a step towards my Outpost.",
        "27. h4": "Here comes the scary pawn!",
        "27... Rdg8": "But it's already time to diffuse the situation",
        "28. Rxg8": "Exchange",
        "28... Rxg8 29. Bxe7": "And exchange to keep the pawn on the h file. Still a scary pawn!",
        "29... Qxe7 30. Qh3 Qh7 31. Nf3": "Queens to the front!",
        "31... Nb6": "What's this my Knight is going opposite way! his 3 pieces and a pawn vs 2 pieces, black has gone insane!",
        "32. Ng5 Qh6": "Use the pin to scare king",
        "33. Kb1 Nc4": "And finally Knight on a great outpost",
        "34. Ka2": "And white protects the hanging pawn but now if my queen gets to the 2nd row it can be lights out!",
        "34... Qh5": "Aiming for second row if white overlooks the Knight threats it's gg ",
        "35. Nf3": "Hmm looks like he sees the threat",
        "35... Rg4": "Gonna be hard for white to puncture through now!",
        "36. Ng5": "My opponent blunders here he did overlook the queen to the 2nd row and this is just a dropped knight",
        "36... Rxg5": "Bam my first mistake! Worst part is I did look at rxh4 but only for two moves and thought I'd get my checkmate. But if white were to defend properly rxg5 is a dropped knight while rxh4 is a dropped pawn and rook for no compensation. So always look carefully more than 2 moves guys c'mon! ;)",
        "37. hxg5": "My opponent gave me a good scare and came at me aggressively. Sadly he ended on two blunders overlooking threats and the strength of my Outpost.\n\nI hope you all enjoyed this game and comments are always appreciated at any stage.",
        "37... Qe2+": "King has only two squares followed by Qb2#"
    },
    "url": "https://gameknot.com/annotation.pl/threats-and-outposts?gm=62910",
    "gameName": "Threats and outposts",
    "players": "??? (1638) vs. Me (1647)",
    "opening": "KP (B00), Nimzovich defence, Marshall gambit"
}