{
    "moves": {
        "1. d4 d5 2. c4": "I've been playing the queen's gambit a lot lately",
        "2... Bf5 3. Nc3 e6 4. Nf3 Nf6 5. Bg5": "I haven't seen too many queen's gambit games but I think this is relatively normal.",
        "5... h6 6. Bxf6 gxf6": "? Okay, so this was a blitz game but really? This practically broadcasted to me that he was going to castle queenside. I would have captured with the queen.",
        "7. e3 Bb4 8. Qd2": "I played this so that after I played a3 and if he chose to capture, I could recapture with my queen.",
        "8... Nc6": "He completes minor piece development",
        "9. a3 Bxc3 10. Qxc3": "At this point I think white is slightly better as it does not have any doubled pawns, or isolated pawns. Black has both.",
        "10... Qe7 11. cxd5 exd5 12. Bd3": "I complete development and get rid of that black bishop's annoying long diagonal. ",
        "12... Be6": "!? Maybe I'm wrong but this seems to blocks in the bishop.",
        "13. O-O O-O-O": "We castle opposite sides so it'll be a race for the pawn storms. Although he has a slight disadvantage due to the doubled pawns.",
        "14. b4 Rhg8": "I notice that he's pinning my pawn and preparing to move his bishop to h3",
        "15. g3": "After about twenty seconds I decided on this.",
        "15... Bg4 16. Be2": "Defending the knight",
        "16... h5 17. b5 Nb8": "I force his knight to retreat",
        "18. a4": "I continue my pawn storm",
        "18... h4 19. Rab1": "His c pawn is pinned to his king, so if I advance my pawn and he exchanges I get a rook in a dominant position.",
        "19... hxg3 20. fxg3": "I played this so he didn't get an open file to my king.",
        "20... Qe4 21. Kf2": "This gives my knight more defense.",
        "21... b6 22. a5 Rd6 23. axb6 axb6": "And now I have an open file to his king.",
        "24. Rfc1": "Threatens mate, but I knew he see it.",
        "24... Rd7 25. Rba1 Rg7 26. Ra7": "Continues pressure on c7.",
        "26... Qe7": "Defends it again",
        "27. Ra8": "Pinning the knight and preparing Qc6.",
        "27... Kb7": "Gets out of the pin",
        "28. Rca1": "Defending my rook and threatening Ra7+",
        "28... Rh7": "Either he didn't notice it, or he couldn't do anything about it.",
        "29. Ra1a7+ Kc8 30. Qc6": "With the knight pinned again it's safe to bring my queen here.",
        "30... Bxf3 31. Qb7+": "I ignore the recapture because I see checkmate",
        "31... Kd8 32. Rxb8#": "And mate! It was a blitz game so I can't take full credit for the win but it was still fun. I think I played pretty well. Please leave a comment or two, and rate it. I liked this game because I won with a mating attack and not (as usually happens to me) winning material and exchanging down to an endgame or getting checkmate because my opponent blundered."
    },
    "url": "https://gameknot.com/annotation.pl/three-minute-plus-five-second-blitz-game?gm=50516",
    "gameName": "Three minute plus five second blitz game",
    "players": "Porcho (1125) vs. ??? (1700(Aprox))",
    "opening": "QGD (D06), Grau (Sahovic) defence"
}