{
    "moves": {
        "1. Nc3 d5": "Sticking my juicy plump pawn right in that horse's face! Oh, yeah!",
        "2. e3 e5": "Taking the Central spot!",
        "3. d4 e4": "Pushin' it forward!",
        "4. f4 Nf6 5. Bb5+ c6": "Almighty pawn wall!",
        "6. Ba4 b5": "Crazy pawn tentacles! Zomgz!",
        "7. Bb3 a6": "Extra protection, as bishop buzzes by.",
        "8. a4 Qa5": "You can cut up my pawn wall if'n ya like, but in exchange I will have one rook.",
        "9. Qd2 c5": "One pawn steps forward and all 3 pawns look unprotected to the untrained eye, but each one is guarded...unfortunately d5 is not guarded enough. The wall is to be shattered, and  I am in trouble...or so it seems. But I shall survive, recover, and win! Watch on, and see my triumph.",
        "10. Bxd5": "White chooses the bishop to attack first. Bad move, as you will see. The knight will not survive this encounter either, but the bishop COULD HAVE, and in addition WOULD HAVE taken care of business afterwards. Black made a mistake allowing this to happen, but white's sloppy attack plan makes sure it is black that benefits from it. For shame, Hilo! (Watch and see.) [Many players prefer to lose a bishop to a knight, myself included. The bishop's more of a pain in the ass piece to get a use out of come end game {pawns standing on the opposite color as a bishop prove untouchable}, and less tricky/dangerous in the beginning. But these decisions must not be made hastily, instead they must be made according to the situation, and in this situation, the horsie was the piece to lose...as wonderful as horsies are.]",
        "10... Nxd5": "He takes I take back. I am already relieved that this trade is happening in this way, that knight should he take my knight will make for good sport.",
        "11. Nxd5 Qd8": "And good sport he is. Now he has to move back to c3 no choice.",
        "12. Nc3 b4": "Smarter move here is actually all the way back into b1 or maybe even a2, but he's a hungry greedy horse, and his eyes are bigger than his stomach.",
        "13. Nxe4 Bb7": "Oops, now what? The knightly fellow is tired of running, which would have bee the proper choice of action.",
        "14. Qd3": "Queen steps forward to defend. Bad choice. Her movement has left g2 undefended, now if the knight were to choose to move I'd snatch first a pawn, and next move, sweet sweet rook. In other words that knight is now as good as pinned, and with no second defender in sight.",
        "14... Qd5": "Two attackers. One defender. What happens next?",
        "15. Nf3": "White steps out to block the horsie pin too late. The trade is made.",
        "15... Qxe4": "Bam, advantage black! White feels he has not shot himself in the foot enough times, and so...",
        "16. Qxe4+": "he trades ladies.",
        "16... Bxe4 17. c3 c4": "I push forward leaving b4 less defended. If a pawn trade occurs I can put some more discomfort on his majesty with my bishop.",
        "18. Ng5": "Ooh scary. The knight can feel free to move forward or so it seems...since he was not protecting a piece. Oh wait wasn't that the knight you were using as a blockade against my bishop snatching g2?",
        "18... Bxg2": "Yup, it was.",
        "19. Rg1 Bd5 20. e4 Bb7 21. Bd2 b3 22. d5 f6 23. Ne6": "Threatening the fork, but again this knight has stepped too far.",
        "23... Kd7": "I charge him, headfirst. He should have stood his ground perhaps, or retreated, but like his equally dead brother, his eyes are bigger than his stomach.",
        "24. Nxg7": "Another move that looks good at first glance.",
        "24... Rg8": "But what now? Knight is pinned to Rg1.",
        "25. f5 Rxg7": "White has learned from his bad queen trade, and decides not to go for the trade here.",
        "26. Rf1 Rg4": "There is no protecting e4. ",
        "27. Ke2": "This move is silly. Castling would be better. I think he saw my king do something like this, and thought it looked cool.",
        "27... Rxe4+": "If he had castled, protecting d5 would be a simple flick of the bishop, but now protecting it is not even an option.",
        "28. Be3": "Allowing yet another piece to be pinned rather than retreating...noticing a pattern here? Perhaps not the wisest course of action ever.",
        "28... Bxd5 29. Rfg1 Bh6 30. Rg4": "Should have went Rg3. Would have made for an even trade.",
        "30... Rxe3+ 31. Kf2 Rf3+ 32. Ke2": "Rook pawn fork.\n  ",
        "32... Rxf5 33. Rd4": "He pins my bishop, not bad.",
        "33... Re5+ 34. Kf2": "And then I walk him into the fork.",
        "34... Be3+": "See? (This is where he surrendered.) White loses based on pushing too far into uncharted and dangerous territories. ..... (Ruachessnut2, and Nuntar have rather aptly pointed out to me, that this is not entirely the case. Basically Hilo's rather daring moves could have went better had he made some rather spectacular tactical decisions to back them up, crushing me, utterly. This may be true, but I don't think we should forget that players with 1200 ratings are not Bobby Fischer, and until they become as good as he is, they need to play a little more carefully than he would. Therefor I say don't dive into the fray counting on your ability to manage a piece being attacked from 3 places at once that is pinned to another piece that also needs to be defended because of complicated and terrible future following dominos that your brain can barely comprehend. Play it defensive, I say. It is a poor teacher who doesn't advise his student to learn the basics. They say beginners should castle early, and experts should consider not castling at all. Perhaps Ruachessnut2 and Nuntar would simple tell a beginner to play like an expert, but I say...castle early, dangit!) Still, thank you boys for the advice. If you felt like saying something positive in the future, some people respond well to that kind of thing...or so I've heard."
    },
    "url": "https://gameknot.com/annotation.pl/throwing-good-horsie-after-bad?gm=21969",
    "gameName": "Throwing Good Horsie After Bad",
    "players": "hilo (1251) vs. hercules_isadore (1232)",
    "opening": "Dunst (Sleipner, Heinrichsen) opening (A00)"
}