{
    "moves": {
        "1. e4": "King's pawn opening.",
        "1... d5": "I'll use the Scandinavian defence.",
        "2. e5": "He pushes for space.",
        "2... Nc6 3. d4 g6 4. Bb5 Bh6": "I'd like to take his bishop and displace his Queen on the recapture.",
        "5. Bxh6": "Oops! He beat me to the punch.",
        "5... Nxh6": "Now my Knight is marginalized.",
        "6. Nf3 Bd7": "I hope to move my Knight and reveal an attack on his Bishop.  ",
        "7. O-O f6": "I need to break his hold on the center.",
        "8. exf6": "He expects me to recapture, but I think I'll",
        "8... e6": "Pass.  This should give 4u pause.  If he doesn't hassle me with a brilliant move, I should be able to capture with my Queen.  I want her King side.",
        "9. Ne5": "Not sure what he's up to.  He may want me to trade Knights, which would pair his pawns again.  His Queen's diagonal is no longer blocked...",
        "9... Qxf6": "Think I'll stick to plan A.",
        "10. Nxd7": "I anticipated this move, but failed to realize the danger for my Missy.  ",
        "10... Kxd7": "Now I can't castle.",
        "11. Na3": "Odd.  Covers his bishop, and allows his pawn to move to c3, opening that diagonal to his Queen...  I don't know.  I really need to unpin my Knight...  I could attack his Bishop with a6, the resulting action could free my Rook, but I'd rather keep him on the back row for now.  ",
        "11... Rae8": "I hate leaving my Knight pinned, but I don't want to let 4u build tempo and momentum.  I hope pushing my e peasant into the fray will turn the flow in my favor.",
        "12. c4": "Good move, reinforces the bishop, and threatens my Knight with c4xd5.  He could also simply advance to c5.",
        "12... Nf5": "Don't care for much of this, I suspect I'm gonna find myself scrambling in a few moves, so I'd like some muscle on central board.",
        "13. cxd5": "Expected.",
        "13... exd5": "Gives my Rook the e file.",
        "14. Qf3": "Pins my Knight to my undefended Queen, and attacks my undefended d5 Pawn!",
        "14... Re4": "Block.",
        "15. Nc2": "Defends his d4 Pawn.  Both my Knights are pinned!   I think I need to free them...  Kc1 is probably best.  Tucks my King in bed, where he can support the Pawns.  I could then play a6 and count on his retreat.  Or I could try Qh4, frees the Knight, and supports the Rook.  ",
        "15... Kc8": "I want to do both.  King to safety first.",
        "16. Bxc6": "Good move.  Breaches my defence.  bxd6 would strengthen my picket, but  weaken my fortress, so",
        "16... Qxc6": "I capture with my Lady.  Wanted to move her anyway...",
        "17. Rac1": "I rather thought he would advance his knight.",
        "17... Qb6": "This move obviates a revealed Rook attack on my Queen while attacking his weak b2 Pawn.  ",
        "18. b3": "I'd like to NXd4, but my Knight is preventing a Queen check.  Should I Kb8 before I capture his pawn?  He's likely to attack my Knight with g4 soon, maybe next turn.",
        "18... Nxd4": "OK, I bare my King in hopes of an advantageous exchange.",
        "19. Qh3+": "Expected.",
        "19... Kb8": "My castle is now more secure.",
        "20. Ne3": "Hmm, I thought he would trade Knights, but I guess he would rather pick on my peasant.",
        "20... Ne2+": "A fortunate fork!",
        "21. Kh1 Nxc1": "This should turn the tide.",
        "22. Rxc1 d4": "I need the d file.",
        "23. Nc4": "Thank you!",
        "23... Qe6": "When I made this move I failed to notice his Queen could capture.  It won't matter, in fact it may be advantageous to trade them, but I must focus!",
        "24. Qxe6 Rxe6": "This should work for me.  I'm sure 4u is wishing he'd lost his Knight rather than his Rook.",
        "25. g3": "The Keep of last resorts.  I'd do the same in his shoes.  Black has no diagonal assault pieces, and the King himself will defend his serfs from g2!",
        "25... Re2": "Where he will now run..",
        "26. Kg2": "Tucked in tight he is.",
        "26... Rhe8": "I was thinking that I didn't want to loose control of the e file, but Rf8, attacking the f2 pawn might have been better...",
        "27. Rd1": "Scratch that last thought.",
        "27... Rf8": "Rf8 WOULD have been better.  Still should be good.",
        "28. Rf1": "Yes, much better.",
        "28... d3": "This pawn advance should yield good results.  His Rook is stuck, and he would loose his Knight to stop me.",
        "29. a4 d2": "So far so good.",
        "30. b4 d1=Q": "He surely will capture my new Queen.  Then Rfxf2  begins to chase his King.  That will be fun.  (For me anyway...)",
        "31. Rxd1 Rfxf2+ 32. Kg1 Rfg2+ 33. Kf1": "White Rd8 is Checkmate, and I've run out of useful checks.",
        "33... b6": "Backdoor. ",
        "34. a5": "A pawn in my face could be a problem.",
        "34... b5": "Obviation.",
        "35. a6": "But not really.  His Rook on d8 is Checkmate again!",
        "35... Kc8": "So the brave King steps up to the plate!",
        "36. Na5": "And this Knight is going to cause problems!",
        "36... Rgxh2": "Gotta free one of my Rooks!",
        "37. Nc6": "As I expected!  Rd8 is Checkmate again!",
        "37... Re8": "So I obviate and sacrifice another peasant..",
        "38. Nxa7+": "Ouch!  That hurts!  If not for the little people...",
        "38... Kb8 39. Nxb5": "Nc6  would have been better for him.  I don't think he noticed",
        "39... Rh1+": "Rh1 Check!",
        "40. Kg2": "Staying close to his Pawn.",
        "40... Rxd1": "Follow through strike.",
        "41. a7+": "He never Quits!  Almost moved King to a8.  He would have forked my King and Rook!",
        "41... Kb7": "King to c8 would have allowed his Pawn to promote.  ",
        "42. Kh3": "Safest move.",
        "42... Rd3": "Pins the Pawn and traps the Knight.",
        "43. Kh4 c6": "And the trap is sprung.",
        "44. g4": "He never quits!",
        "44... cxb5 45. a8=Q+": "I like this guy!  ",
        "45... Kxa8 46. Kg5 Rd4 47. Kh4 Rd3 48. Kg5 Rf3": "He makes me fight for every inch!",
        "49. Kh6": "I debated letting him capture h7...",
        "49... Re7": "But I know this guy, he'll use my pawns for shields, and I'll have to dig him out like a clam...",
        "50. Kg5": "I'd love to do some fancy Rook work and force a superlative mate, but alas, such brilliance evades me, ",
        "50... Kb8": "And I begin the long trek",
        "51. Kh6 Kc8": "to trap his King.  If I try something fancy I fear he'll trick me into a stalemate.",
        "52. Kg5 Kd8 53. Kh6 Ke8 54. Kg5 Kf8 55. Kh6 Kg8 56. Kg5 Kg7 57. Kh4": "I can now force him to move his pawn.",
        "57... Re5 58. g5 Re4#": "And finish it.  Nothing spectacular, but a battle for me.  Peace."
    },
    "url": "https://gameknot.com/annotation.pl/tiebreaker?gm=20974",
    "gameName": "tiebreaker",
    "players": "4u2nv (1451) vs. jcrycket (1398)",
    "opening": "Scandinavian (centre counter) defence (B01)"
}