{
    "moves": {
        "1. d4 Nf6 2. Bf4 e6 3. Nf3 d5 4. Nbd2 c5": "I consider this to be the best for black. ",
        "5. c3": "My preferred line. Giving up c4 saves white from a lot of troubles, since I'm planning to castle queenside.",
        "5... Nc6": "As black, I would go for cxd5 for sure, but for some reason nobody plays it. I know there is a lot of theory behind...",
        "6. e3": "Now I am so solid...",
        "6... Qb6": "I have plenty of ways to defend, but I'm glad in seeing that black is doing his homework, applying pressure where he should. ",
        "7. Qb3": "b3 or Qc2 where options. In case of QxQ, axQ, and if c5, I'll go QxQ, axQ, Bc7, and if g6, b3  compensates... maybe.",
        "7... Qa5": "Interesting choice. Now, c5 is annoying. ",
        "8. Qb5": "I thought Bb5 didn't work because of c5!, BxN+, bxB, and my Q needs to retire. If c5!, Qa4  QxQ, BxQ, Bd7 and black is safe, I got nothing out of all this. ",
        "8... Bd7": "I was blinded thinking that Qxb7 was \"poisoned\". Not really, because of the dsb... I still thought it was risky, so I went for the ugly...",
        "9. Qxa5 Nxa5 10. Ne5": "Threatening to exchange black's lsb. The game looks pretty equal, so it's a matter of subtleties, now...",
        "10... cxd4": "Harmless...",
        "11. exd4 Bd6": "Well... Nxf7 comes to mind, and if BxB, NxR. But this N will be a goner, and I'll have no compensation for the exchange.",
        "12. Nxd7": "...but this is different. Now I have NxN+, so black has to take defending his lsb,",
        "12... Kxd7 13. Bb5+": "I wish his N was not there, but I couldn't see a force able to pevent him putting it there. Now, I think maybe Bd3 was more on the idea, answering Bf5+ if ever e5 was attempted. ",
        "13... Nc6": "[%clk 0:04:15]\n",
        "14. Be3": "I see no point in exchange my B. If Ng5, o-o-o and the B will be exchanged for a good reason. ",
        "14... a6": "Expected.",
        "15. Be2": "? Better than d3 because it prevents Ng5, but it does allow e5 by black!!",
        "15... Rab8": "Preparing for a queenside attack. Very bookish.",
        "16. g4": "I have no time to lose. I have to grab what's mine. ",
        "16... h6": "Reaction! I have to add pressure... how?",
        "17. f4": "[%clk 0:04:01] Until here, I spent a minute of my time. Not bad. \n",
        "17... b5": "So did him. And now, the attack. I can defend with a3, but it's an old story, and I know how it ends... and it doesn't please me at all!",
        "18. g5": "No doubt! Now or never! I know it is not wise, since it opens the h column for him, but it was my only possible reaction, as I saw it. ",
        "18... hxg5": "[%clk 0:04:03]\n",
        "19. fxg5": "[%clk 0:03:59]\n",
        "19... Nh5": "...with a nasty threat of Ng3. Solution? A counterthreat: ",
        "20. Rf1": "Any h move opens too dangerously the g3 square. It screams \"danger\"!",
        "20... Ke7": "Defending... and did I think on Nf3, defending the pawn? Not at all!",
        "21. Rf2": "It gives me time to defend h2 and hopefully Ra will land on f1. g6 was not good after f6. ",
        "21... f5": "Threatens f4, I have to prevent it...",
        "22. gxf6 e.p.+ gxf6 23. O-O-O": "A couple of R on f... and struggling for surviving! ",
        "23... b4": "Here he comes from the other flank! I know by hart that if b2 is removed, I'm lost. But I have a N in my sleeve...",
        "24. Nb1": "[%clk 0:02:57] This is an ugly square for my N, but it was doing nohing anyway. His Destiny on g6 (via h5) shall wait for another reencarnation... \n",
        "24... Ng7 25. c4": "[%clk 0:02:42] I had to accept the loss of h2, and I tried to become more active. This introduces some complications for my opponent, since d5 is threatened, stopping black's attack. However, I underestimated the black's next's...\n",
        "25... Nf5": "[Ouch! N is either exchanging my dsb, take d4 or h2... and c5 doesn't save me. It's the beginning of the fall... it was nice to play you, goodbye...",
        "26. Kd2": "[%clk 0:01:38] After a long time. 26 tense moves, now I'm finally crushing, and I found this way to kind of compensate...\n",
        "26... dxc4": "[%clk 0:02:05] Nxe5, either, were better for sure!\n",
        "27. Bxc4": "[%clk 0:01:37] Finally I get some activity! I'm even threatening Bxa6... and NxB, KxN, Rh3+ doesn't look unbearable. \n",
        "27... Ncxd4": "Winning a battle, but not the war. From now on, my position is very delicate and I struggle to find a way out, avoiding all the traps with the two knights...",
        "28. Re1": "[%clk 0:01:19] Not still in a good position to use my pressure on d6, but look: RxNf5, NxR, Ba7, and if Rb7, Rxe6+, saving the B.\n",
        "28... Be5": "More and more complicated, and the timer is running...",
        "29. Bxd4": "[%clk 0:01:00] I can't wait too long. I assumed that if Bxa6, Rxh2, so no point in it. \n",
        "29... Nxd4": "My B pair is gone for nothing... sigh!\n",
        "30. Re3": "[%clk 0:00:15] At least preventing Rh3, but I'm planless now...\n",
        "30... Nf5": "R3-e2 was sensible... \n",
        "31. Re4": "[%clk 0:00:14] ...but I went for this purposeless one. See I'm only 14 seconds left from now on. 30 tense moves, and I'm still in troubles, and no time to go. \n",
        "31... Rbd8+": "quickly, the best place... Kc1...",
        "32. Ke2": "? Allows \n",
        "32... a5": "[%clk 0:01:02] ? Rd5 was the start of my fall. \n",
        "33. Nd2": "[%clk 0:00:16] Nf3 in sight.\n",
        "33... Rxh2": "[%clk 0:00:55] ? Finally taking the \"dued\" pawn... but it was a mistake!\n",
        "34. Rxh2 Bxh2 35. Rxe6+": "[%clk 0:00:21] I got some seconds and a very nice outpost, and a pawn more than he!",
        "35... Kd7 36. Rxf6": "It is not only safe, but dued (Nd4+)\n",
        "36... Re8+": "[%clk 0:00:48] Kd1, Ne3+ wins, so...\n",
        "37. Kf3": "Allowing...",
        "37... Re3+ 38. Kg4": "I'm pretty sure I can be mated, but it is not so easy. Problem-like position...\n",
        "38... Ne7": "Material is 0, and forces are balanced. Both K are exposed, tree loose pieces on the board, a lot of forks possible... and just 20 seconds to play!",
        "39. Bb5+ Kc7": "Here, Rf2 was interesting, but I only saw...",
        "40. Nc4": "Threatening a5. ",
        "40... Rg3+ 41. Kh4": "My pieces are far, his pieces binded. ",
        "41... Ng6+ 42. Kh5 Ne7": "[%clk 0:00:07] I don't have much time...\n",
        "43. Nxa5": "[%clk 0:00:23] ...but my opponent is using his, too... we are about 10 secs a move maximum, now. \n",
        "43... Rh3+ 44. Kg4 Rg3+ 45. Kh4": "All this just to make black clear he has no break in. ",
        "45... Rg2": "[%clk 0:00:13] Another plan for black!",
        "46. Rf7": "? Blunder, as Kb6 and I don't welcome exchanges.",
        "46... Kd6": "At least my b2 is defended now (Nc5+)",
        "47. Nc4+": "Wasting the effect of it. ",
        "47... Ke6 48. Rf3": "Defending and going out of danger.",
        "48... Nf5+ 49. Kh3": "Please, please, am I overlookng some mate or tactic? No? ",
        "49... Rc2": "Will it never stop? This was one of most nerve consuming blitz ever!",
        "50. Ne3": "I have to exchange - but safely!",
        "50... Nxe3": "Well, one less!",
        "51. Rxe3+": "[%clk 0:00:29]\n",
        "51... Kd5": "[%clk 0:00:19]\n",
        "52. Rd3+": "? Rb3 was correct. If now Kc5, I'll lose the advantage. ",
        "52... Ke4": "? ",
        "53. Rb3": "[%clk 0:00:22] Finally!\n",
        "53... Be5": "?? Bd3+ wins, but I didn't see it. The game was probably a draw.",
        "54. Rxb4+": "?? when you overlooks something, you lose the chance to get it forever, unless...",
        "54... Kf5": "?? your opponent is so kind to offer you it again!",
        "55. Bd3+": "...and that's all folks! I hope you've enjoyed it!"
    },
    "url": "https://gameknot.com/annotation.pl/time-rush-in-55-moves?gm=61769",
    "gameName": "Time rush in 55 moves,",
    "players": "damafi (1444) vs. devon_rodgers (1587)",
    "opening": "Queen's pawn game (A45)"
}