{
    "moves": {
        "1. Nf3 f5": "Black goes with 1...f5.  Not what I usually see.  Often I see 1...d4, which leads into a Queen's Gambit game.",
        "2. g3": "Given that this looks nothing like a QG game now, I decide to go with a game I'm comfortable with--a fianchetto of my LSB.",
        "2... Nf6 3. Bg2 e6 4. O-O Be7 5. d4": "5.d4  I decide to stake a direct claim to the center.",
        "5... O-O 6. c4": "Taking more of the center.",
        "6... d5 7. Nc3 c6": "I'm not sure what type of opening White has (aside from Reti).  fritz has told me that Black has engaged in a Dutch Stonewall defense.",
        "8. b3 Ne4": "The first foray by either player into the other's territory.",
        "9. Nxe4 fxe4": "Black now has quite the pawn chain extending.  GameKnot scores this as -0.22, advantage Black.  Fritz says the game is equal.  I think I agree with Fritz at this point.  Although Black has the nice pawn chain, she also has doubled e-pawns.  Then again, Black's Rf1 now has a half-open file.  Chess can be confusing at times.",
        "10. Ne5": "10. Ne5 seemed like the only logical move.",
        "10... Nd7 11. Nxd7 Bxd7": "The exchange of Ns was expected.",
        "12. Bf4": "Development.  White's LSB is really chewing on serious granite.",
        "12... Bg5 13. e3": "13. e3 made more sense than to exchange B's and help Black develop her Queen.  Of course, I'll be doubling my pawns.  Is a file considered half-open if only one play has two pawns on the file?",
        "13... Be8 14. Bh3": "Attacking the backward pawn.",
        "14... Bf7 15. c5": "I was trying to develop a plan.  Positionally, I had more space Q-side, so I decided to push forward there.",
        "15... Bxf4 16. exf4": "No more DSBs.",
        "16... Qd7": "At this point, both GameKnot and fritz have the game as equal.",
        "17. Bg4": "17. Bg4.  I have found that when I play stronger players, it's a bad idea to leave pieces en prise as they tend to develop plans that result in my losing said piece.",
        "17... Bg6": "GameKnot now gives a slight advantage (-0.21) to Black.",
        "18. b4": "Continuing to gain space Q-side.",
        "18... Bf5 19. a3": "19. a3  I'm going slowly at this point as I'm not quite sure how to break through.  I know that I will not initiate the exchange of LSBs as I do not want e4 to be so reinforced.",
        "19... Qd8 20. Qe2 Rf6 21. a4 Rh6 22. Kg2": "22. Kg2 My thought was this was a nice waiting move, plus it added protection to my pawns and allowed my Rs to move down to h1, g1 should that be necessary.\n\nBoth GameKnot and fritz were not happy with this move.  GameKnot recommended 22. Bxf5  exf5  23. Rfd1 Qf6  24. Ra3 Rh3  25. b5 Re8  26. Re3 Qh6  27. f3 Kf7  28. Qc2 Qh5  29. bxc6 bxc6  If I follow GN's recommendation, the advantage to Black was -0.30.  As it was, GN scored it -0.86.  \n\nFritz recommended 22. Bxf5 exf5 23. b5 Rc8 and then said that this would be equal.",
        "22... Bxg4 23. Qxg4 Qf6": "attacking White's backward pawn.",
        "24. Rad1 a5 25. b5 Rg6": "GN has the advantage at -0.49 (for Black) while Fritz has the game equal.  ",
        "26. Qe2 Qxf4": "White wins a pawn.",
        "27. f3 cxb5 28. axb5": "27...cxb5 28. axb5  Black now has a passed pawn to contend with.",
        "28... a4": "28...a4 The saying \"passed pawns must be pushed\" comes to mind.  However, according to GN, Black went from -0.68 to -0.10 with that move.  I'm not quite sure why--should Black perhaps have moved 28...exf3  I'm not sure.  I do know that the next few moves wins a pawn back for White.",
        "29. fxe4 Qxe4+": "expected.",
        "30. Qxe4 dxe4 31. Rf4": "There's really no way to save e4 at this point.",
        "31... Rg5 32. Rxe4 Kf7": "We've moved into a double rook endgame.  GN now gives White the slight advantage +0.14",
        "33. h4 Rd5": "I mulled this move over for quite awhile",
        "34. b6": "34. b6  All of these moves took a fair amount of time for me.  I did not want Black to move b6 as my analysis showed that would lose a pawn for White.",
        "34... e5 35. Rxe5 Rxe5 36. dxe5 a3": "It was right about here that my opponent complimented my play thus far in the game.  It always nice when someone 300+ points better than you tells you that you are playing a good game.  She also told me that I had a draw on my hands if I played correctly.  I've never drawn against a 2000+ opponent, so, of course, I felt the pressure.  I deliberated several days over the next sequence of moves.  I don't know if I would have worked so hard at it if my opponent had not told me that a draw was possible.  At any rate, I worked out the correct moves but move 41 will undo it all.",
        "37. c6 bxc6 38. Rd7+ Ke6 39. Ra7": "I hoped Black might exchange Rs but she's too strong a player to do so.",
        "39... Rb8 40. Rxa3 Rxb6": "Again, my opponent complimented me.  GN has the score of the game as -0.01 and fritz has it equal.  While I don't know how equal the game is at this point while we're playing it, I know that it's going well.  I guess I need to protect e5  [cue ominous music]",
        "41. Re3": "And this essentially loses the game for me.  Not my typical blunder where I give away a piece--just inexact play against a superior opponent and bad things happen.  My opponent let me know that Ra7! was the move I should have made.  \n\nGN offered 41. Ra7  g6  42. Rxh7 Kxe5  43. Re7+ Kd5  44. Rd7+ Ke4  45. Re7+ Kd5\nFritz offered \"41. Ra7!? should be examined more closely\"  [sarcasm]You think so, fritz?[end sarcasm]\n\nI focused so much on keeping material even that I missed the threat caused by Ra7.  Ra7...Ra7...Ra7  Is see Ra7 in my nightmares.  ",
        "41... c5": "GN now scores the game -1.05 and this number will now just increase.",
        "42. Kf3 c4 43. Re2 Kd5 44. Rd2+": "This got a ? mark from fritz and GN didn't like it too much either.  I had a plan to attack, belatedly, g7 and h7, but it didn't work.",
        "44... Kxe5 45. Rd7 Rf6+ 46. Ke3 Rg6 47. Kf3 c3": "passed pawns must be pushed.",
        "48. Rc7 Kd4 49. Rd7+ Kc5 50. Ke2 Rxg3": "I figured I had to get to c3 and then worry about the other pawns.",
        "51. Kd1 Rg4 52. Kc2 Rxh4 53. Rxg7": "I didn't want to allow connected passed pawns so I thought I'd just take out g7 first",
        "53... Rh3": "For those keeping score at home, GN has it at -3.02",
        "54. Rc7+ Kd5 55. Re7 h5 56. Re8 h4 57. Rh8 Kc4 58. Rc8+ Kd4 59. Rd8+": "I wondered if I kept giving check if I could somehow get a draw.  :tears:",
        "59... Ke5 60. Re8+ Kf4 61. Rd8 Re3 62. Rd4+ Kg3 63. Rd6 Kg2 64. Rg6+ Rg3 65. Re6 h3 66. Re2+ Kf1": "And there is no way to stop at least one of Black's pawns from Queening.  I have to thank my opponent (thanks, janet) for being so encouraging and helpful during the game.  She certainly did not have to take the time she did and it was much appreciated.\n\nIt seems that my positional game has improved (when I avoid stupid blunders) and my openings are good enough to get me into the middle game competitively.  What this game has clearly demonstrated to me is that it is time to dedicate the larger portion of my study time to endgames.\n\nAs always, comments and input is appreciated."
    },
    "url": "https://gameknot.com/annotation.pl/time-to-start-studying-endgames?gm=31020",
    "gameName": "Time To Start Studying Endgames?",
    "players": "untateve (1747) vs. brigadecommander (2068)",
    "opening": "Reti v Dutch (A04)"
}