{
    "moves": {
        "1. e4": "This game between brewinski and flemming was played during the Toccata team mini-tournament. After a fairly passive opening, the middle game turns to chaos. The game has incredible swings of fortune. White, a Queen down, manages to draw the game, but as we shall see in the end game, analysed by Yttrio and l-d-j, there are missed chances for Black and White to play for a win. Many thanks to Yttrio, l-d-j and liam1260 for their comments, corrections and analysis.",
        "1... e5 2. Nf3 d6": "The Philidor Defence\n",
        "3. h3": "3.h3 is not necessarily a bad move, but it is too passive. 3.d4 is more aggressive. White need not fear Bg4. It leaves b7 undefended and, as we shall see, this proves to be a mistake: 3.d4 Bg4 4.dxe5 Bxf3 5.Qxf3 dxe5 and now White starts an attack on f6. 6.Bc4 Nf6 7.Qb3 - a double attack on f7 and b7. Black must defend f6, but in doing so loses b7. 7...Qe7 8.Qxb7. Thanks to liam1260 for his corrections on my notation here.",
        "3... Nc6 4. c3": "4. c3 is a rather passive way to prepare for d4 and prevents Nc3, defending e4. c3 is a good way to prepare for d4 in the Giuoco Piano and the Ruy Lopez. The difference is that the light square Bishop is already developed which allows castling and Re1, defending e4 and allowing c3 to be played shortly after. With this in mind, 4.Bb5 pins the Knight and prepares for d4, while keeping Nc3 ready to defend e4 when Black plays Nf6. ",
        "4... Nf6 5. d3": "Now White's plan of d4 is thwarted, his light squared Bishop is locked in and does not become active until move 24. 5.Qc2 may have been preferable.",
        "5... h6": "5...h6 is not bad but passive. Until now Black has been developing rapidly causing White some problems. It may have been preferable to keep developing pieces with 5...Be7 preparing to castle and also defending against a possible Bg5.",
        "6. Be3 b6": "Again a little slow and awkward. Black can move his Bishop to e6 with plenty of pressure on d5, however, that may be dangerous - after White plays d4, d5 becomes a real threat of forking Black's Knight and Bishop. Simply castling, keeping his Bishop undeveloped and playing d5 first may be best.",
        "7. Be2 Be7 8. O-O d5": "A good aggressive move - going for the centre!",
        "9. exd5 Nxd5 10. Bd2": "White wants to maintain the Bishop pair. In doing so he temporarily locks in his Knight on b1, but he can play c4, dislodging the Knight on d5 and allowing Nc3 - a good idea? L-D-J points out that the c4, Nc3 idea is no good because it leaves the weak backward d3 pawn on the half-open d file. Alternatively, leaving the Bishop on e3, with Black taking it, would give White a central e pawn and open the f file for his Rook - good compensation for losing the Bishop pair.",
        "10... Bb7 11. a3": "White's plan here seems to be to play c4 dislodging the Knight on d5 followed by Nc3, 11. a3 has prevented Bb4.",
        "11... Qd6 12. c4 Nf6 13. Nc3 Nd4": "A nice attacking move which also opens the diagonal for the Light squared Bishop.",
        "14. Nxd4 Qxd4 15. Be3 Qd6 16. f3": "This makes a hole in White's King defence with g3 a key weakness.",
        "16... a6 17. b4 O-O 18. c5 bxc5 19. bxc5 Qc6 20. Ne4 Nd5 21. Qc1 Nxe3 22. Qxe3 f5 23. Ng3 Bxc5": "And the Queen is pinned to the King.",
        "24. d4 Bxd4 25. Qxd4": "The only way to get any compensation, but as we shall see White has a plan for a draw, to activate his Rooks with tempo and attack Black's King.",
        "25... exd4 26. Rab1 g5": " Yttrio analyses 26 ... Rab8 would have defended against White's threat of winning the bishop and getting his rooks on the 7th rank. For example, 26...Rab8 27. Rfc1 Qd7, and Black appears to be fine. \n",
        "27. Rfc1 Qe8 28. Rxb7": "Yttrio analyses: White's win of the Bishop on b7 actually comes at a cost. If black plays 28... Qe3+, then he forks and wins the white rook on c1. This was black's last real chance to consolidate his advantage. ",
        "28... f4 29. Rcxc7": "Yttrio analyses: 29. Rcxc7 has a nice checkmate threat. If 29... fxg3, then 30. Rg7+ Kh8 31. Rh7+ Kg8 32. Rbg7#. Also, if Black defends with 29... Rf7, White pins the Rook to the King with 30. Bc4, and if 30... Qe1+, then 31. Nf1. After White wins the Rook, he has a Rook and two minor pieces for the Queen, which would lead to an interesting game. \n",
        "29... Qe3+ 30. Kf1 Qe5 31. Nh5 Rfc8 32. Rcg7+": "Yttrio analyses: White could have done better with 32. Bc4+ instead of Rg7+. Since 32... Kh8 leads to mate in one with 33. Rh7#, Black must play 32... Kf8. This is followed by 33.Rf7+ Ke8 and Black gets mated with 33... Kg8 34. Rg7+ Kf8 (if 34... Kh8, then 35 Rh7#) 35. Rbf7+ Ke8 36. Rg8#. If White follows with 34. Ng7+, Black must play 34... Qxg7 (if 34... Kd8, then 35. Rbd7#). After, 35. Rxg7, Black doesn't have time to take the Bishop with 35... Rxc4 due to 36. Rg8#, leaving White up a Bishop. ",
        "32... Kf8 33. Rgf7+": "Yttrio analyses: White has a winning game with 33. Rbf7+ Ke8 34. Nf6+ Qxf6 followed by 35. Rxf6 and White is up a Bishop (if 34.. Kd8, then 35. Rd7#). ",
        "33... Kg8 34. Rfg7+ Kh8": "After 34... Kh8 (or 36.... Kh8, for that matter) White can play 35. Rbg7+. If 35... Kf8, then 36. Rh8#. Therefore, Black must play 35...Qxg7 36. Rxg7+, leaving White with two minor pieces for a Rook and pawn as described earlier. \n",
        "35. Rgh7+ Kg8 36. Rhg7+ Kh8": "L-D-J analyses the possible continuation of the game: 37.Rh7+ Kg8 38.Nf6+ Qxf6 39.Rxf6 Kxh7 40.Rxa6 Rxa6 41.Bxa6 and White is an exchange down, so this was the best he could gain. \n\nYttrio provides a different analysis: after any of the three times White plays Rg7+ (moves 32, 34, and 36), Black can play Qxg7, and after White recaptures with the Rook, White has two minor pieces for a Rook and pawn, which would lead to an interesting game that probably favors White. \n\nYttrio summarises the game: Black had a couple of good chances to consolidate his lead and win the game, then White missed his own chances for a winning position. From personal experience playing over the board, sometimes draws like this feel like a minor victory for both players. \n\n"
    },
    "url": "https://gameknot.com/annotation.pl/toccata?gm=43961",
    "gameName": "Toccata!",
    "players": "brewinski (1433) vs. flemming (1454)",
    "opening": "Philidor's defence (C41)"
}