{
    "moves": {
        "1. e4": "The third game from this mini tournament I have annotated and the second against spglenn.",
        "1... c5": "After playing the Flohr variation last time I was hoping for a najdorf.",
        "2. Nf3 d6 3. Bb5+": "The Canal-Sokolsky attack",
        "3... Bd7": "I played this not checking the Game DB or the opening explorer but because I didn't want to play Nc3 pinning the Knight or Nd7 blocking the Queen and Bishop and Qd7 is just ridiculous.",
        "4. Bxd7+ Qxd7": "Still by the book and once again I choose not to go into the opening explorer or Game DB but played because I wanted the flexibality of playing Nc6 rather than Nxd2 which means I have to develop the queen on the a5-d8 diagonal and the Knight is forced into a more defensive square.",
        "5. O-O Nf6 6. d3": "Not Nc3",
        "6... h6": "Stopping Bg5",
        "7. Be3 Nc6 8. Nc3 e5": "!? Blocks the bishop but means chance of a d5 outpost for white as well as a d4 for black",
        "9. Nd5": "Wanting to half-open the e-file",
        "9... Nxd5 10. Bd2": "? gives away a free knight could have played exd5 removes the threat of Nxe3 and attacks the C6 knight",
        "10... Nf6 11. a4 a5": "Stopping b4",
        "12. b3 Be7 13. c3": "Could have closed the queenside with c4",
        "13... O-O 14. Nh4": "Looking for a kingside attack",
        "14... Qg4": "When up exchange",
        "15. Qxg4 Nxg4 16. g3 Rab8": "Planing on opening the queenside",
        "17. f3": "Forcing the Knight back",
        "17... Nf6 18. f4 exf4 19. Rxf4 Nh5 20. Rg4 Ne5": "Forces the rook into Zugzwang",
        "21. Rxg7+ Nxg7 22. Bxh6 Ng4 23. Nf5": "Don't exchange when down and also His Bishop is better than mine",
        "23... Nxh6 24. Nxe7+ Kh8 25. Rf1 Rbe8": "Attacking Knight",
        "26. Nd5 Ng4 27. Rf4 Nh6 28. Rh4 Re6 29. b4 cxb4 30. cxb4 axb4": "Trying to free up the queenside and queen with the a-pawn",
        "31. Nxb4 Kg8 32. g4 f5 33. exf5": "Now the Knight sac mate combo begins",
        "33... Ngxf5 34. gxf5 Rxf5 35. Kg2 Rg6+": "White resigns here because Rg4 Rxg4+ Kh3 Rf3# or Kh1 Rf1# or if Kh3 or Kh1 with no Rg4 Rf 1 or 3#\n\nLessons to learn\n\nDon't exchange when down\nDon't create an exchange and not follow through with it"
    },
    "url": "https://gameknot.com/annotation.pl/tomcapps-mini-tournament-i-knight-sac-mate?gm=38149",
    "gameName": "tomcapp's mini-tournament I (Knight Sac mate)",
    "players": "spglenn (1247) vs. thedessertfox (1272)",
    "opening": "Sicilian (B52), Canal-Sokolsky attack, Bronstein gambit"
}