{
    "moves": {
        "1. e4 e5 2. c4 Nf6 3. d3 Bc5": "Book so far...",
        "4. Bg5 d6 5. f3 Nc6 6. Nc3 Qd7": "Development proceeds apace...",
        "7. Nh3 Qe6 8. g4 h6 9. Bh4 g5": "Cutting off his Bishop at the pass.",
        "10. Bg3 Nd4": "With the preliminaries over, the game begins in earnest. I plant a Knight on a potent outpost.",
        "11. a3 a6": "Creating a safe haven for the KB, if needed, and preparing to stop a Pawn attack on the Q-side if my opponent goes that route.",
        "12. b4 Ba7": "Since I intend to castle on this side, having extra protection for my King can't be bad.",
        "13. Bg2 Bd7": "Clearing the way...",
        "14. Nf2 O-O-O": "...to tuck away the King.",
        "15. a4 b6": "intending to lock the Pawn chain if my opponent tries an attack.",
        "16. h4 Rdg8": "Hoping to engineer a potential K-side breakthrough.",
        "17. b5 a5": "Locking down the gates of the fortress.",
        "18. Nd5 Nxd5": "I will not allow the Knight to invade. It is easiest to simply exchange it off.",
        "19. exd5 Qe7": "Still aiming at the K-side.",
        "20. Ne4 f6": "A slight error, losing a tempo. I could simply have played P-KB4 at once...",
        "21. Bf2 f5": "...rather than use two moves to do it.",
        "22. gxf5 Bxf5": "Beginning to open up the position.",
        "23. Bxd4 exd4": "Completing the exchange.",
        "24. Qd2 Bxe4": "Aiming to create a flank majority on the K-side and fully open the KB file.",
        "25. fxe4 g4": "Mission accomplished, and now I have a passed KN pawn.",
        "26. O-O-O h5": "Protecting the Pawn.",
        "27. Kb1 Rgf8": "I take the open file.",
        "28. Qb2 Qe5": "My opponent counteraatacks the P on Q5, and I have to defend it.",
        "29. Rhe1 Rhg8": "Planning to advance the Pawn.",
        "30. Qd2 g3": "My opponent's B is a good blockade.",
        "31. Qc2 Rf2": "I try to force its removal.",
        "32. Re2 Rxe2": "My opponent counters nicely, and I choose to exchange instead of retreat.",
        "33. Qxe2 Kd7": "I look to get my King out of the corner...",
        "34. Rf1 Ke7": "...and into a more active role...",
        "35. Qd2 Kd7": "...but with my opponent threatening to attack down the open K-side, I abandon my idea. ",
        "36. Rf7+ Kc8": "Perhaps it's best to stay behind the fortress after all.",
        "37. Bh3+ Kb7": "I should be safe here...",
        "38. Rd7 Rf8": "Reclaiming the open file.",
        "39. c5 bxc5": "My opponent looks to break down the fortress and invade with his Q.",
        "40. Qxa5 Bb6": "I hope to drive him back...",
        "41. Qa6+ Kb8": "...but he has other plans.",
        "42. Rh7 Qf4": "Retreat? Never! With his Q gone from the defenses, I plan a vicious counterattack.",
        "43. Bd7 Qd2": "Threatening 44... R-B8 mate!",
        "44. Rf7 Rd8": "Obviously 44... RxR is answered by 45 Q-B8 ch. So I try to strengthen the defenses.",
        "45. Bc6 Qxd3+": "With my opponent now threatening Q-N7 mate, I have to be aggressive.",
        "46. Ka2 Qc2+": "As I can't stop the mate in 1, I have to take a perpetual check on the QB file. Draw agreed."
    },
    "url": "https://gameknot.com/annotation.pl/tonydogs-11th-mini-tournament?gm=39983",
    "gameName": "Tonydog's 11th mini-tournament ",
    "players": "leeg25 (1153) vs. last_archimedean (1306)",
    "opening": "King's pawn game (C20)"
}