{
    "moves": {
        "1. d4 Nf6 2. Bf4 g6 3. Nf3 Bg7 4. Nbd2 d6": "Black kind of omit d5, and this allows...",
        "5. e4": "Strong center?",
        "5... c6 6. c3": "c4 doesn't give me much more. My aim is the white diagonal pointing to f7, of course. ",
        "6... Nbd7": "If black neglected d5, now one of the consecuences is that white can press on the white diagonal. One of the strongest weapons black has is Na5 once Q and B are aligned. With this move black deprives himself from it, and e6 from a defender. ",
        "7. Bc4": "Provoking b5, Bb3. Of course I can't hope to get Q, B and N(g5) without resistance, so I wanted to face the problem at once. ",
        "7... b5 8. Bb3 a5": "a3, a4, Ba2... very boring. Can I get something more? Probably not, but I still tried...",
        "9. Ng5": "Black \"saw\" that if a4, Bxf7+, Kf8, Ne6+, winning the black Q. e6 heads for Bxe6, fxB, Nxe6, Qe7, which favours black. ",
        "9... O-O": "...which gives me tempo to face the white diagonal's problem:",
        "10. a4 b4": "...ok, another tempo for my attack. I can ignore bxc3, bxc3. ",
        "11. e5": "...and this is the more pressing move. Despite the weakness of my Bf4.",
        "11... dxe5 12. dxe5 Nh5": "After Bg3, NxB,e5 falls for free. But the e6's weaknes must be exploited. My distractions worked... almost, and now I have...",
        "13. e6": "Suddenly, the position is tactically complex. Black has NxB, followed by Nxg2+, opening W's castling shield. Ba6+ is not dangerous, but white can counter it easily. Black has also bxc3, bxc, and Bxc3, threatening the R and pinning my Nd2. White, on its part, has: exf7+, Kh8, Ne6, which forces Qb6, so white can play Be3, and after any defence, NxR ensures an exchange and the pawn in f7 is still alive. White also has Nxf7, Qg6, Be3, Qmoves, exNd7... black has to choose among attack and defence. Of course, NxBf4 comes to mind, but after Qf3, black has to consider Qxc6, threatening Ra8... what would you do? Attack? Defend? How?",
        "13... Nc5": "Black chooses to add another motiv to the position: NxBb3, or Nd3+. At the same time, covers e6 so I can't use it anymore. Very clever move. ",
        "14. Nxf7": "This allows Qd3, but except for castling, it leaves me Be3, threatening Nc5 in order to balance things. ",
        "14... Qe8": "? Now xN is completely impossible. True I have not many ways to use my good pieces... and I have to save the B, so...",
        "15. Nh6+": "If Kh8 I have assured a draw, but of course I want more. ",
        "15... Bxh6 16. Bxh6": "This gives me another tempo and my dsb is sure. Of course, it seems that I'll lose e6 for nothing...",
        "16... Nxb3": "I don't want my Q to be on a1. ",
        "17. Qxb3": "This is risky, but it controls e6. I can't keep it. But black must try to prevent my castling. ",
        "17... Rf6 18. O-O": "At least, I will settle my position. ",
        "18... Bxe6 19. Qc2 Bf5": "Ok, black has got out from the danger, and the material is... 0! ",
        "20. Ne4": "...time to take advantage from the king's position. If Kf7, Ng5+ and I'm at least equal. ",
        "20... Bxe4 21. Qxe4": "cxc3 is not so worrying. ",
        "21... Rd8": "This allows cxb4, and the win of a pawn. I didn't see it. ",
        "22. Qc4+ Rd5 23. Rad1 bxc3 24. Rxd5 cxd5 25. Qxd5+": "This is a puzzle position. A move and the situation is equal (white will probably win because of the extra pawn on the Qside. But if...",
        "25... Qf7": "??",
        "26. Qd8+": "...and that's all!"
    },
    "url": "https://gameknot.com/annotation.pl/too-much-is-too-much?gm=61107",
    "gameName": "Too much is too much",
    "players": "damafi (1385) vs. Pjotr999 (1433)",
    "opening": "Queen's pawn game (A45)"
}