{
    "moves": {
        "1. d4": "Each player was given the colour of choice for them and if they chose black they could chose whites first move provided it is something he would normally play. I chose to play white.",
        "1... d5 2. c4": "I went for the queens gambit here as it is something I am familer with and scores well for white. Prehaps what I should have done was create an extremly sharp tatical game considering he was playing something like twenty games at once.",
        "2... e6": "Queens gambit declined. Blacks looking for a boring simple opening where he doesn't need to spend time thinking about the moves.",
        "3. Nf3": "I actually meant to move Nc3 but I'm so used to this move that I just made it without thinking.  ",
        "3... c6 4. Nc3 dxc4 5. e4": "Once again I made the wrong move! I actually meant to move a4 but instead made this.",
        "5... b5": "Now black should be able to hold on to his extra pawn.",
        "6. a4": "In hopes to undermine his pawn chain.",
        "6... Bb4": "With a powerful pin on my King I can't move my knight.",
        "7. axb5 cxb5": "If I can get his Bishop to take my knight then I will have a nice pawn centre and should be able to get back my pawn later on.",
        "8. Be2": "I wanted to castle as soon as possible and didn't want to move my DSB just yet.",
        "8... Nf6": "I could protect my e pawn with something like Bd2 but I didn't want to isolate my b pawn.",
        "9. e5 Nd5": "Adds an extra attacker on My knight.",
        "10. Qc2": "This is a fairly strong square for my queen and it also protects my knight on c3.",
        "10... Nc6": "Naturally a master feels no need to trade off just yet. instead he develops another piece. A piece which proves to be fairly troublesome a little bit later on.",
        "11. O-O Nxc3 12. bxc3 Be7": "Well at the very least I got him to waste some tempo retreating the bishop.",
        "13. Be3": "I'm not sure what the reasoning for this move was. I just wanted to Develop my bishop quickly but then he came to my board before I had thought of a move so I panicked and did this. ",
        "13... O-O 14. Rfd1": "I didn't have a definite plan yet but I figured to bring my rook to here couldn't be so bad with ideas of a central pawn push and maybe doubling up on the d file.",
        "14... f5": "It's better for me to leave the pawn alone. Even if it does cut off my Queens long diagonal.",
        "15. Rd2": "With a blatantly clear plan to double up.",
        "15... Bb7": "This bishop turns out to be one of blacks most powerful pieces, even when it gets forced into the corner.",
        "16. Rb1": "But for now it at least allows me to try and win back my pawn! by making this move I threaten Bxc4 winning back my pawn since if bxc4 then Rxb7 and material is even.",
        "16... Qd5": "Black chooses this way to prevent my recapture of the pawn. looking at this I wonder if even now he had plans of a mate on g2 since it would only require the two knights to move for a mate threat to be present.",
        "17. Qa2": "Keeps up the pressure of material being back to equal.",
        "17... Rab8": "Look at that damn knight. It controls the pawn on a7 as well as both a5 and b4. soon it will also be protection for the rook on b8.",
        "18. Rdb2": "So instead of the planned doubling on the d file the file is now the be file. ",
        "18... Ba8": "Everything is guarded.",
        "19. Bg5": "? This is a mistake that losses another pawn. I thought it looked good at the time since I was planning on trading my relatively useless bishop for blacks slightly more useful one. But more than that I was hoping for some play by maybe getting rid of Blacks knight well placed on c6 as well as possibly targeting the weak e pawn.",
        "19... Bxg5 20. Nxg5 Nxd4": "! But I overlooked this simple tactic that wins another pawn. I was kicking my self for missing this. ",
        "21. Bf3": "Pretty much the only way to go.",
        "21... Nxf3+ 22. Nxf3": "Now I am looking like I'm in a little bit of trouble. I have to very careful not to move my knight here.",
        "22... Rf7": "This protects the a7 pawn.",
        "23. Rd2": "I considered here trying make a sort of blockade in the hopes of a draw but it would only tie up all my pieces and black would probably get through anyway with an assault on the kingside.",
        "23... Qc5 24. Nd4": "? this was another very poor move. infact I don't know weather he missed it or not but Black could have just taken the e pawn.",
        "24... Re7 25. Qa5 Qxe5": "! my position looks bad but is even worse than it looks. Black has many threats here.\r\n\r\nI took a very long time with my next move. I had only just realised my back rank was weak.",
        "26. Nxb5": "?? This was a very had decision to make. This move means black wins!",
        "26... Qe4": "!! Now mate is unavoidable. I was about to resign here when I found one last tactic.  I saw no way out of checkmate since black had mate threats on both g2 and b1! what I came up with was although makes no difference, commendable and offers the best resistance and even a winning game if black makes the wrong move. ",
        "27. Rd8+": "This offers the only resistance even if it still losses the game. What I found was ...Rxd8 Qxd8+ Kf7 then Nd6+!! unfortunately what I missed was that once I move my knight a third mate threat is opened up so black had no need to make the move 27. ...Rxd8. It turns out much to my displeasure that checkmate beats a queen any day of the week.",
        "27... Kf7": "After this I relised my final oversight and was about to resign. I chose instaed to go out in style by at least taking out Blacks queen.",
        "28. Nd6+ Kg6": "If black had moved his king to f6 then I still would have been in the game since Nxe4 would have come with a game winning check.",
        "29. Nxe4 Rxb1+": "Hope you enjoyed this game. I would really appreciate peoples insight into this because their was a point where the position is a little too complicated for me to figure out the correct moves.",
        "30. Rd1 Rxd1#": ""
    },
    "url": "https://gameknot.com/annotation.pl/too-many-mates?gm=38438",
    "gameName": "Too many mates!",
    "players": "???  vs. ??? ",
    "opening": "QGD Slav (D30)"
}