{
    "moves": {
        "1. e4 c5 2. Nf3 d6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 g6": "staffmarav apre con e4,il suo avversario opta per la siciliana con c5.Dalla Najdorf si va nella variante del dragone.",
        "6. Be3 Bg7": "Si continua con la linea principale",
        "7. f3": "Credo per bloccare Cg4 o Ag4 ",
        "7... Nc6": "Attacco Yugoslavo",
        "8. Qd2": "Si prepara all' arrocco lungo e si mette sulla stessa diagonale dell' alfiere",
        "8... Bd7 9. O-O-O a6": "Piu' giocato l'arrocco...ma perche' non saprei...ogni commento e' il benvenuto",
        "10. g4 Nxd4 11. Bxd4 O-O": "Mi sembra che l' arrocco del nero non e' molto sicuro...",
        "12. h4": "Infatti il bianco comincia a sparare pedoni per sfondarlo...e si dice che in caso di arrocchi eterogenei, chi inizia per primo l'attacco ha ottime possibilita' di vittoria.",
        "12... h5": "A me questa mossa sembra un errore...vuole fermare l'attacco del bianco,ma in questo modo scopre l'arrocco...o sbaglio?",
        "13. gxh5": "E un pedone dell'arrocco nero e' andato...",
        "13... Nxh5 14. Bxg7 Kxg7": "E al re nero tocca rimboccarsi le maniche e scendere in campo,mentre i suoi sudditi stanno a guardare...",
        "15. Rg1 Qa5": "Forse qui il nero pensa di essere ancora in tempo a capovolgere la situazione ed essere lui ad attaccare...",
        "16. Rg5 f5": "E l' arrocco del nero si indebolisce sempre di piu'...forse se il nero non avesse esposto cosi' incautamente la sua regina il pedone f avrebbe potuto muovere in f6 e difendere meglio il re.\n",
        "17. Qg2": "Qui a mio parere il nostro staffmarav non ha visto un' altra mossa ben migliore...qualcuno sa dire quale?\nVietato rispondere a chi ha un rating maggiore di 1800,lasciamo che gli altri sui divertano a trovarla...:)",
        "17... Nf4 18. Qg3 e5 19. Rxd6": "Credo che questo sia l'inizio della fine...per il nero",
        "19... Rf7 20. Bc4 Rc8 21. Rgxg6+ Kf8 22. Bxf7 Rxc3 23. Rxd7 Rxc2+ 24. Kxc2": "In questa serie di mosse ci sono vari aspetti tattici che io non so analizzare,sarebbe interessante sentire il parere dei nostri compagni piu' forti",
        "24... Qa4+ 25. Bb3 Qxd7 26. Rg8+ Ke7 27. Rg7+ Kd6 28. Rxd7+ Kxd7": "Qui il nero giustamente si arrende.Bravo staffmarav!"
    },
    "url": "https://gameknot.com/annotation.pl/torneo-open-c-elo-1500-1799?gm=66108",
    "gameName": "Torneo open C(ELO 1500/1799)",
    "players": "staffmarav (1510) vs. 2N  (1534)",
    "opening": "Sicilian (B75), dragon, Yugoslav attack"
}