{
    "moves": {
        "1. e4": "Ótimo lance. Deve ser o preferido de todos os iniciantes: tem ação central e libera caminhos para a dama e um bispo, além de oferecer uma casa  mais para um cavalo. Uma das vantagens de liberar o caminho desse bispo é que ele deve ser movido para que o roque pequeno seja possível.",
        "1... e5": "Ótimo, pelas mesmas razões",
        "2. Nf3": "Os jogadores continuam fazendo bons lances: essa é a casa mais natural para o cavalo, ao menos no início das partidas",
        "2... Bc5": "Essa é uma resposta rara, que ocorre em menos de 0,5% das vezes em que temos 1e4e5 2Cf3. As estatísticas indicam que esse é um movimento ruim, pois em cerca de 70% dos casos as brancas vencem. Observe que o cavalo poderá capturar o peão central das pretas.",
        "3. d4": "Lance ruim, pois desperdiça a chance de capturar o peão central das pretas. O correto seria Cxe5",
        "3... Bb4+": "Melhor seria capturar o peão. Esse xeque não teve muita objetividade, pois é facilmente contornado pelas brancas.",
        "4. c3": "Boa jogada: resolve o xeque, libera uma diagonal para a dama, atua no centro e realiza um ataque contra o bispo preto.",
        "4... Ba5": "As pretas movimentaram o bispo, depois movimentaram outra vez e agora movimentaram de novo! Isso viola um princípio importante: na abertura do jogo, evite usar a mesma peça mais de uma vez.",
        "5. Nxe5": "Boa jogada! As brancas ganham o peão (já deveriam ter feito isso, mas antes tarde do que nunca!)",
        "5... Nf6": "Bom lance, desenvolvendo o cavalo para a sua melhor casa, liberando o caminho para o roque pequeno e atacando um peão branco.",
        "6. f3": "Cc4 teria sido mais agressivo, mas o lance escolhido ao menos mostra que as brancas perceberam que seu peão estava ameaçado.",
        "6... Na6": "Lance ruim: atua sobre o centro? não! Desenvolve alguma peça? Não! Posiciona o cavalo em uma casa boa? Não! (como regra geral, cavalos não devem ficar nos cantos, a menos que exista algum motivo específico) Cria alguma ameaça para o adversário? Não!",
        "7. Bb5": "Ok, esse lance não compromete nada grave e ainda abre espaço para o roque pequeno. Contudo, se a ideia foi criar uma ameaça, esqueça: o peão em d7 conta com 4 defesas! Além disso, se esse bispo se tornar incômodo poderá ser facilmente expulso, por meio de um avanço de peão até c6.",
        "7... Nb8": "Péssimo lance, que revela que as pretas estão um pouco confusas e sem imaginação: primeiro colocam o cavalo em uma casa ruim, depois desperdiçam tempo fazendo-o retornar à casa inicial! Aqui, muito melhor teria sido rocar.",
        "8. O-O": "As brancas rocam. Ok, é bom rocar, pois isso coloca a torre em jogo e deixa o rei menos exposto. Mas veja: esse roque está fragilizado, pois um dos 3 peões que fazem a \"guarda real\" já foi movido.",
        "8... a6": "Ok, esse lance tem um mérito: é agressivo, pois coloca o bispo branco em risco. No futuro, porém, dêem preferência a ataques que não possam ser tão facilmente defendidos. Aqui, o bispo vai recuar sem maiores dificuldades (e se for atacado novamente pelo outro peão, continuará fugindo, e no fim das contas estará em uma boa casa!) 0 melhor teria sido ROCAR",
        "9. Ba4": "O bispo também poderia ter ido para a casa d3, onde ajudaria a dar uma sólida sustentação ao centro branco. Mas essa jogada é interessante, pois permite um futuro Bb3, de onde o bispo cominará uma importante diagonal.",
        "9... O-O": "Ok. Isso é bom: os dois jogadores realizaram o roque (beleza!), mais especificamente o roque pequeno (ótimo!), e fizeram isso antes do décimo lance (boa!!)\nA posição está boa para as brancas, que monopolizam o centro com seus 4 peões. As pretas, porém, têm um roque mais preservado, com 3 peões protegendo o rei, além de um cavalo e uma torre por perto - o nível máximo de proteção!",
        "10. Bg5": "Ok, é um lance jogável, desenvolvendo o bispo e \"pregando\" o cavalo - quando chegar a hora certa, esse bispo poderá forçar uma troca com o cavalo, bagunçando o roque das pretas, que está impecável.",
        "10... c6": "Esse lance não foi bom: tira do cavalo a sua casa natural - aliás, esse cavalo está 100% aprisionado agora!",
        "11. Qb3": "Cg4 seria bom. Esse movimento de Dama é errado por conta de um detalhe: retira a única casa de fuga que o bispo tinha - se as pretas perceberem, avançarão um peão até b5 e deixarão esse bispo em uma tremenda enrascada!",
        "11... d6": "As pretas desperdiçaram a chance de atacar o bispo branco, mas o lance realizado tem o mérito de ser ofensivo - realmente, devemos sempre deixar o adversário na defensiva, evitando jogadas passivas e sempre criando algum problema que complique o próximo lance do oponente.",
        "12. Nxc6": "Lance péssimo: as brancas capturaram um peão. Mas perderão um cavalo!",
        "12... bxc6": "ok, mas seria ainda melhor capturar com o cavalo que ainda se encontra no fundo do tabuleiro, desenvolvendo-o.",
        "13. Nd2": "Bom lance: possui ação central e permite que as torres se comuniquem.",
        "13... Qe7": "Ok, lance normal. As pretas precisam acelerar o desenvolvimento das suas peças.",
        "14. Nc4": "Provavelmente com a intenção de trocar cavalo por bispo (que normalmente é um bom negócio). Esse lance foi ok.",
        "14... Be6": "Uma defesa criativa, gostei! Em vez de fugir com o bispo ou providenciar alguma defesa, as pretas deram um jeito de PREGAR o cavalo branco: se as brancas insistirem em capturar o bispo de a5 com o cavalo, perderão a Dama com BxD! Contudo, um pouco mais de cálculo mostra que o lance não é bom, pois depois de trocar bispo por cavalo com BxC e g7xB as brancas poderiam avançar o peão até d5, anulando a pregadura - e assim o cavalo poderia capturar o bispo em segurança.",
        "15. Nxa5": "Esse cavalo está com o mal da vaca doida! Jogou tudo pro alto e foi em busca do bispo, deixando a própria Dama perdida!",
        "15... c5": "Alguém aí quer um par de óculos?? As pretas não perceberam que uma Dama suculenta estava pronta para ser devorada!",
        "16. Qd1": "Ufa! Depois de suar frio, as brancas fogem com a Dama bem rapidinho...",
        "16... Nbd7": "Isso não foi bom... o cavalo tampou a saída do bispo: se o bispo for atacado por um peão em d5, para onde vai fugir?",
        "17. Nc6": "Perdendo a chance de atacar o bispo.\nEsse ataque à dama não surte muito efeito, pois é fácil de defender - na verdade a Dama até agradece, pois ela precisava mesmo sair de onde estava, despregando o seu cavalo.",
        "17... Qe8": "correto.",
        "18. dxc5": "Muito melhor seria avançar esse peão para a casa d5, atacando um bispo que não teria meios de se defender. Ao jogar, fique sempre de olho nas peças adversárias \"sufocadas\".",
        "18... dxc5": "retomando sem maiores polêmicas",
        "19. Ne5": "ok...",
        "19... Qd8": "pouco inspirado...",
        "20. Nxd7": "Boa jogada.",
        "20... Bxd7": "retomando com a peça certa (retomar com o cavalo pregado causaria a perda da Dama).",
        "21. Bxd7": "Antes de fazer essa jogada teria sido melhor \"preparar o terreno\" com a troca BxC, pois além de bagunçar o roque, essa jogada elimina uma das defesas das pretas.",
        "21... Ra7": "Por que não retomou com a Dama? Se fizesse isso não haveria risco de perder a Dama, pois em caso de DxD as pretas responderiam com CxD (ou seja, seria uma simples troca).",
        "22. e5": "A ideia de atacar um cavalo pregado é boa, mas não nesse caso: agora era hora de defender o bispo!",
        "22... Rxd7": "Perfeito!",
        "23. Qe1": "defendendo-se passivamente",
        "23... Rd5": "Torres são peças muito pesadas: embora seu jeito de se movimentar lhe dê muita força nos finais, quando várias peças já foram capturadas e existe muito espaço para circular, antes disso elas são um pouco desengonçadas, como se fossem caminhões manobrando no quintal. As brancas podem avançar um peão até c4 para atazanar um pouco essa torre...",
        "24. f4": "As brancas se assustam um pouco com a presença da torre e tratam de providenciar uma defesa, sem perceberem que o peão atacado já conta com uma defesa (pela Dama). Por outro lado, para capturar o cavalo seria necessário retirar o peão da frente, deixando a torre livre para tomar o bispo",
        "24... a5": "Lance pouco inspirado... que dá às brancas uma chance de capturar o cavalo.",
        "25. Rd1": "A posição é bastante favorável às brancas, mas elas deixam escapar oportunidades preciosas. Mais uma vez o cavalo foi poupado",
        "25... Rxd1": "ok",
        "26. Qxd1": "retomada simples",
        "26... Qc7": "Aqui teria sido melhor DxD - as brancas teriam que perder tempo recapturando, e com isso as pretas teriam chance de salvar o cavalo, pois UM DIA as brancas vão acabar vendo que existe um peão prontinho para devorar um cavalo!",
        "27. exf6": "Aleluia!",
        "27... Qc6": "Em vez disso, deslocar a dama em diagonal para a casa b6 teria sido mais interessante. Mas tudo bem, não muda muito as coisas: as pretas estão completamente perdidas, com uma grande desvantagem material!",
        "28. a4": "Esse foi um lance passivo. O certo seria aproveitar para causar danos ao roque adversário, por exemplo com peão x peão",
        "28... Qe4": "Apesar de inferiorizadas, as pretas buscam um jogo mais agressivo, e posicionam sua Dama em um posto central e avançado, embora muito exposto a ataques.",
        "29. Rf2": "O correto seria colocar a torre na casa e1, ameaçando a dama. Esse foi mais um lance passivo.",
        "29... c4": "Mais um lance desprovido de objetivo: os dois jogadores alternam lances ruins, demonstrando que ambos estão passando por um momento de queda do grau de concentração. Conforme já comentei na primeira partida, nossa capacidade de permanecer atento oscila, e é normal que ocorram fases de baixa concentração. Até aí tudo bem - mas é importante ser capaz de perceber \"ôpa, estou meio desatento... deixa eu contar até dez e recobrar a linha de raciocínio, e enquanto estou zonzo não vou fazer nada!!\"",
        "30. fxg7": "bom lance",
        "30... Kxg7": "ok",
        "31. h3": "As brancas voltam a realizar lances a esmo, sem objetividade. A pressão do relógio às vezes causa esse tipo de desatenção.",
        "31... h6": "Boa! As pretas atacam o bispo branco",
        "32. Qh5": "Lance fraco: as brancas entregam o bispo, que será tomado pelo peão.",
        "32... hxg5": "Bye bye bispo... a vantagem das brancas se reduz um pouco.",
        "33. Qxg5+": "ok, certo.",
        "33... Kh7": "ok, sem maiores problemas...",
        "34. f5": "ok, bom lance.",
        "34... f6": "ok, certo",
        "35. Qh5+": "bom lance!",
        "35... Kg7": "As brancas estão com um forte ataque sobre o rei preto!",
        "36. Rd2": "Não!!! Péssimo lance! As brancas tinham a intenção de preparar a torre para um avanço até d7, encurralando de vez o rei preto... porém, não perceberam que poderiam receber um ataque duplo, com a dama preta dando xeque e ao mesmo tempo atacando uma torre indefesa.",
        "36... Qe1+": "PERFEITO",
        "37. Kh2": "Único lance possível, pois não sobrou nenhum outro meio de escapar desse xeque.",
        "37... Qe4": "Horrível!\nPor que a Dama preta não capturou a torre branca?\nPior do que isso: agora as brancas poderão realizar aquele plano de deslocar a torre para a casa d7",
        "38. Rd4": "Em vez de Td7+, as brancas preferem atacar a Dama...",
        "38... Qe5+": "certo!",
        "39. g3": "certo!",
        "39... Qe2+": "Nosso cérebro às vezes se enrola quando precisa prestar atenção em duas coisas ao mesmo tempo. Aqui existem dois assuntos para o condutor das pretas resolver: como atacar o rei branco e como preservar a segurança das suas peças. Ao jogar, parece claro que o cérebro só se ocupou da primeira questão, e providenciou um ataque... desprezando completamente a segurança das suas peças! Se a cada jogada ele tivesse o hábito de se perguntar \"será que com esse lance eu vou perder a minha Dama?\", com certeza não teria feito isso...",
        "40. Qxe2": "Bye bye Dama.",
        "40... Rf7": "O xeque mate é iminente...",
        "41. Rd8": "ok, jogável",
        "41... Kh6": "melhor teria sido recuar a torre... se bem que não existe lance que salve a partida das pretas: a única esperança é que as brancas errem.",
        "42. Qg4": "bom lance.",
        "42... Rg7": "A esperança é a última que morre: e se as brancas erram?",
        "43. Qh4#": "O jogo foi bom, mas com muitos momentos de passividade e de jogadas sem objetividade. Cada vez que temos o lance devemos tentar das duas uma: ou criar uma ameaça ou melhorar o posicionamento de alguma peça. Caso estejamos sob ataque, devemos pensar com calma para encontrar uma forma de defesa que seja sólida e não piore muito a posição das nossas peças.\nNesse jogo as brancas deixaram que a sua vantagem se reduzisse a apenas 3 peões a mais, e se não fosse a perda da Dama por mera falta de atenção poderia haver certa dificuldade de jogar o final."
    },
    "url": "https://gameknot.com/annotation.pl/torneio-afbndes-de-xadrez-sub-18-por-equipes?gm=59503",
    "gameName": "Torneio AFBNDES de Xadrez Sub-18 por Equipes",
    "players": "Thiago  vs. Renan ",
    "opening": "King's knight opening (C40)"
}