{
    "moves": {
        "1. d4 d5 2. Nf3 e6 3. c3 c5": "Christian juega un orden especial, sin sacar el caballo de f6; así que insto a las negras a \"volver a la normalidad\"",
        "4. Bg5 Nf6 5. e3 Be7 6. Nbd2 O-O 7. Bd3": "Ahí estamos, la receta de Tigrán Petrosián puesta en marcha. Había leído con ahínco sus recomendaciones y ya era hora de ponerlo en práctica",
        "7... Nc6 8. Ne5": "Segunda fase, las blancas retrasan el enroque buscando el cambio en \"e5\" para tomar con \"d4\" y así sacar al caballo de f6, el gran defensor del enroque.",
        "8... Nd7": "Esta es una de las posibilidades mostradas por Petrosián, aunque en otro orden de jugadas",
        "9. Bf4": "Ahí está. Las blancas no cambian el alfil de casillas negras, manteniendo en parte el atochamiento de piezas.",
        "9... cxd4 10. exd4": "Así es, sin abrir la columna \"c\"",
        "10... Ncxe5 11. dxe5": "Tercera fase, ahora hay que llevar las piezas al flanco, aprovechando la gran diagonal blanca (del Ad3) ",
        "11... Nc5 12. Bc2": "Hay que cuidar a este alfil",
        "12... Bg5 13. Qh5 h6 14. g3": "Ahora con el enroque debilitado, comienza el avance de la estructura de peones",
        "14... Bd7": "Las negras van muy lento en el flanco de dama",
        "15. Nf3": "¡Más piezas en el ataque!",
        "15... Bxf4 16. gxf4": "¡Ahora la columna \"g\" está abierta!",
        "16... Qb6 17. Rg1": "sacrificio completamente justificado, las blancas ganarán si las negras toman en \"b2\"",
        "17... Kh8 18. O-O-O": "Sin apuro, la falta de contrajuego en el centro y la cantidad de piezas asegura un mal pasar a las negras",
        "18... Na4 19. Bxa4": "El tiempo que necesitaba",
        "19... Bxa4 20. Rxg7": "con mate en pocas jugadas."
    },
    "url": "https://gameknot.com/annotation.pl/torneo-verano-2007-arica?gm=33502",
    "gameName": "Torneo Verano 2007, Arica",
    "players": "Mamani, Héctor  vs. Cuadros, Christian ",
    "opening": "Queen's pawn game (D02)"
}