{
    "moves": {
        "1. e4": "Esta es mi tercera partida, Yuri un joven oaxaqueño de 19 años, representante en las olimpiadas. Un rival fuerte.",
        "1... e6": "Me sentí bastante cómodo al jugar la defensa francesa, como bien saben, la prefiero por sus posiciones tácticas",
        "2. d3": "Debo admitir que me sorprendió mucho esta apertura, después la investigué un poco y averigüe que el GM Carlsen Magnus, la acostumbraba jugar. Es la apertura Stonewall. Supongo que por ese motivo se ha vuelto popular entre los más jóvenes ajedrecistas.",
        "2... c5": "Como dije me sorprendió bastante y decidí adelantar c5, aprovechando su punto debil d4. Pretendía basar todo mi juego en el control de esta casilla",
        "3. Nf3 d5": "Pidiendo explicaciones al peón de e4, me sentía bastante cómodo en esta posición",
        "4. Nbd2": "Creo que subestimando a mi rival, y a su posición pasiva decidi jugar g6, pero creo que era más fuerte d4, con el posterior e5, apoyado por el Cc6. Aunque no me gustaba del todo la idea porque podría venir un ataque fortísimo en el ala de Rey. Por esa razón y aprovechando mi ventaja posicional decidi continuar con la idea original y controlar la casilla d4",
        "4... g6": "No recuerdo bien que GM dijo \"en una apertura donde no sepas bien por donde van los cauces, aconsejo fianchetto\". Y me pareció buena idea, controlaba de lejos el centro y me limitaba a observar que se traía entre manos mi rival",
        "5. g3 Bg7 6. Bg2 Nf6 7. O-O O-O": "Desafortunadamente por la posición similar, y debido a que mi supuesta ventaja no era tal....y que era una posición igualada, me desanimé al percibir unas tablas",
        "8. Re1": "Me pareció una buena jugada, pretende llevar su caballo a f1 y moverlo a e3, seguir con avance en e5 y con un Ag5, la posición blanca estaría destrabada",
        "8... Nc6": "Ya quería cerrar el centro al ver lo que pretendía hacer",
        "9. h4": "Esta jugada me parece mala, creo que era mejor Cf1, luego Cg5 y seguir con f4.",
        "9... Qc7": "En la posición negra, ya sea en siciliana o francesa, hay una línea que debe ser seguida para darle continuidad a todas las jugadas y darle la mayor actividad posible. En este caso puede ser Db6, Da5, Dc7, de hecho IBM al configurar Deep Blue recomendaba esta jugada en la computadora que debía hacerse siempre por parte de las negras, Dc7.",
        "10. Nf1": "Sigue con su plan de Ag5, y e5",
        "10... b6": "Me siento bastante cómodo en esta posición, mis piezas se desarrollan con cierta naturalidad y las blancas tienen un poco de dificultad en desarrollar una estrategia",
        "11. Ng5": "Me sorprendió un poco esta jugada, pero me percaté que realmente planeaba f4 como antes había supuesto. Finalmente encontró que esas maniobras eran mejores. Así que decidí debilitar mi enroque con tal de que f4 no fuese hecha. ",
        "11... h6 12. Nf3 Bb7 13. Bf4": "Quiere liberar a su alfil mediante e5, la consiguiente toma ed y retirar su alfil a e3. Creo que teniendo una ventaja posicional en estos momentos, decidí abrir el juego",
        "13... e5 14. exd5 Nxd5": "Es posible que mi contrincante no le gustara la posibilidad de cambiar alfil por caballo, pero no tenía muchas opciones y a mí me parece que era su mejor opción",
        "15. Bd2 Rad8": "Desarrollo ante todo",
        "16. Qc1 Kh7": "Algo de contrajuego, pero resulta inútil. Quizás en una partida rápida hubiese funcionado, pero se trataba de un juego de más de dos horas es imposible un error de esa magnitud",
        "17. Nf1h2 f5": "Esta jugada me gustó mucho, amenaza romper la cadena debil de peones con f4. Mantiene al caballo a raya y también manejo la posibilidad de e4, además de que he activado indirectamente la Tf8",
        "18. g4 Nd4": "Como ya les había comentado, tomar piezas es un error si dejas posicionado a una pieza menor de tu rival. Sin embargo la decisión que tome con Cd4 no fue la mejor, me parece mejor Ce7. Y es que el cambio de piezas beneficia a mi rival, desahoga sus piezas.",
        "19. Nxd4 cxd4": "Es una pena porque de nueva cuenta estoy perdiendo mi ventaja posicional",
        "20. Qd1 f4": "Este estilo de juego me gusta mucho, presionarlos hasta la locura con peones. Es un juego agresivo, y basta un error para que la agresividad te rebote en la cara",
        "21. Be4 Ne7": "El cambio le favorece al blanco, sin embargo es un alfil que debe ser eliminado. Está muy bien posicionado y amenaza h5.",
        "22. Bxb7 Qxb7 23. Qf3": "Cuando movió esta pieza, me percaté de cuales eran las verdaderas intenciones de mi rival. Quería tablas. De hecho, después de que tomé su dama, me las ofreció \"te ofrezco tablas\", me dijo. Ambos habíamos consumido mucho tiempo, cerca de 45 minutos.",
        "23... Qxf3 24. Nxf3": "Ya decía yo que no debería confiarme en la mañosa e3, que por su simpleza, es bastante fácil de jugar por las blancas",
        "24... Nc6 25. Re4 Rd5": "De hecho, aquí estuve pensando un buen rato. Estuve calculando algunas variantes, estaba un poco molesto lo admito de tener ahora que defender mi peón débil de e5. Todo parecía indicar un triste final de tablas",
        "26. Rae1 Rb5": "Forzando b3, debilitando un poco los peones",
        "27. b3 Rc5": "Realmente buscaba esto, mantener la iniciativa. Aquí mi rival, se sintió un poco ofuscado por esta jugada. La desesperación empezaba a mellar. Habíamos estado cerca de 2 horas sentados, uno frente al otro calculando, esperando no cometer algún error",
        "28. Rc1 a5": "Era mejor Td8",
        "29. c3 dxc3 30. Rxc3 Rxc3 31. Bxc3": "Ahora todas las piezas están apuntando mi debilidad en e5, un peón que caerá irrremediablemente.",
        "31... Rd8": "Viendo que no había posibilidad de salvación, decidí por mantenerme activo",
        "32. Nxe5 Nxe5 33. Bxe5 Rxd3": "He capturado este peligrosisimo peón",
        "34. Bxf4": "Y finalmente, llevo un peón de menos. Pero entonces, con menos de media hora calculé algunas variantes y decidí jugar a la defensiva. Necesitaba ocupar Td4, para amenazar alfil, recuperar peón y si Torre blanca captura b6, Txg3 y Ad4+ con alfil de ventaja. Esta fue una variante, de algunas...y para mi fortuna, mi rival no la había calculado de hecho me sorprendió un poco que ya con menos de 20 minutos estuviese jugando ya sin darle importancia...de nueva cuenta me ofreció tablas. Las rechace",
        "34... Rd7 35. Re6": "La jugada que esperaba del blanco",
        "35... Rd4 36. Bg3 Rxg4": "Recupero el peón y la posibilidad de hacer una pequeña táctica si el blanco se equivoca....",
        "37. Rxb6": "Aquí me sumí de nueva cuenta al cálculo, a pesar de que todo esto ya lo había calculado me sorprendió que con 15 minutos ambos, se hubiese equivocado de esa manera. Sospeche y calcule por 30 segundos, al ver que no había problema decidí seguir con el plan.",
        "37... Rxg3+": "Ya había calculado que pasaría si tomase, si no tomase, etc.",
        "38. Kh2 Rg4 39. Kh3 h5 40. Rb5 Bc3 41. Rb7+ Kh6 42. Rb6": "Estaba tan concentrado que francamente no me había percatado que eramos de los últimos en seguir jugando, había sido una partida demasiado cansada y  comencé a notar que algunos curiosos comenzaban a ver la partida...y entonces volteé a ver a mi rival, había escuchado gimoteos desde que tomé el alfil, pero me sorprendí de nueva cuenta al ver que mi rival se deshacía en llanto abierto. Creo que la tensión del juego le pegó demasiado, ambos pusimos demasiada concentración y sólo bastó una jugada imprecisa para voltear la situación radicalmente. ",
        "42... Be1": "Lejos de sentirme indignado o burlón, empecé a sentir respeto por este joven que con tanta pasión lloraba por un juego de ajedrez. Me parece que nunca lloraría por una partida perdida, me parece que hay cosas más importantes en mi vida. Mientras los curiosos observaban al joven, y murmuraban, yo sólo guarde silencio y volteé mi mirada al juego. Sin embargo, el joven había perdido por completo la concentración, era cuestión de tiempo para que se equivocara. Entonces, me dio la mano, me firmó la hoja, se levantó y se fue. Sentí deseos de darle una palmada en el hombro, y decirle que admiraba su pasión por este juego. Pero cuando un hombre llora, realmente no hay que hacer nada. Todos pasamos por eso y es parte de la madurez. Luego, me lo volví a encontrar en la 6ta ronda y me felicitó por mi desempeño y yo también le deseé suerte."
    },
    "url": "https://gameknot.com/annotation.pl/torneo-unam-2012-round-3?gm=48424",
    "gameName": "TORNEO UNAM 2012 (Round 3)",
    "players": "Jimenez Capriolova, Yuri (1511) vs. Pastor, Arturo (1532)",
    "opening": "French (C00), King's Indian attack"
}