{
    "moves": {
        "1. d4": "Se trata del segundo round del torneo de la UNAM en mi categoría, menor de 1600. En estos momentos abrí con gambito de dama, veía que había muchos novatos y con gambito de dama se descubriría con alguna jugada inesperada.",
        "1... Nf6 2. c4 g6 3. Nc3 d5 4. Nf3 Bg7 5. Bg5": "La partida se ha desarrollado como un gambito de dama declinado, en su línea principal con Ag5. Las negras pueden responder con Cbd7, c5, o c6.",
        "5... c6 6. h3 Nbd7 7. e3": "Todo esto es teórico, realmente no hay nada nuevo. ",
        "7... Qc7": "Esto me parece un error, la jugada principal es 0-0 siguiendo la lógica de las jugadas anteriores (g6, Ag7, Cf6)",
        "8. Bf4": "Estuve pensando largo rato esta jugada, pero me pareció apropiada...aún no conocía la fuerza ajedrecistica de mi rival ",
        "8... Qb6": "Fritz recomienda Da5, con cierta posibilidad de igualdad a lo largo del juego",
        "9. Qc2": "En estos momentos, decidí seguir con la teoría y que la posición de las negras se derrumbara por si sola",
        "9... O-O 10. c5": "De nueva cuenta me sumí a pensar si era correcto, por la posibilidad de Da5 y como dije, Fritz iguala la posición porque de hecho es una mala jugada c5. Pero con tan pocas jugadas, me pareció que mi contrincante no tenía tanta experiencia y que se \"sofocaría\" ante la presión de peones",
        "10... Qd8": "Ha perdido 2 tiempos",
        "11. Bd3 Re8 12. O-O Nh5": "La única posibilidad de contrajuego de las negras",
        "13. Bh2 e5 14. dxe5 Nxc5 15. g4": "Todavía no estoy seguro si esta es una buena o mala jugada, por la posibilidad de contrajuego de las negras. Tuve que calcular hasta la jugada 20 más o menos y otras variantes, fue un poco extenuante para mi nivel de aficionado. Pero finalmente decidí hacerla",
        "15... Nxd3 16. Qxd3 Qd7": "Me parece que era la mejor jugada de las negras, se sumió en unos 15 minutos de reflexión. Ya la había calculado pero tuve que calcularla de nuevo...y es que como pueden ver sigue Dxh3, luego Ag4, y probabilidades de mate",
        "17. gxh5": "Sin duda fue la peor jugada, debi haber esperado. ",
        "17... Qxh3 18. e4": "Era evidente la amenaza Ag4, la única jugada que concebí como buena fue esta. Para seguir con Ce1",
        "18... Bg4 19. Ne1 Qxh5 20. Ng2 Bxe5 21. Bxe5 Rxe5 22. f4": "Una buena compensación de las negras por la pieza menor. ",
        "22... Re6 23. exd5 cxd5 24. Rae1": "Mi única posibilidad es el intercambio de piezas para hacer más notoria la pieza menor faltante de las negras",
        "24... Rae8 25. Nxd5 Be2 26. Qd4": "Una jugada deliberada, si 26. Axf1 sigue 27. Cf6+, Txf6, 28. Txe8+, Rg7, 29. Rxf1...y luego de Ce3-Cd5, la torre esta perdida.",
        "26... Qf5 27. Rf2": "Se sigue amenazando la misma táctica",
        "27... Bd3 28. Nge3": "Aprovechando el error del negro, la única era 28. De4, pero no le gustó la posibilidad de perder la pareja de torres con Cf6+",
        "28... Qh3 29. Qxd3": "He de admitir que para este momento, me sentí aliviado del craso error cometido y jugué bastante confiado en los siguientes minutos",
        "29... Qg3+": "Aquí tuve que hacer un paréntesis, después de tomar Dxd3 fui a comer. Casualmente me encontré con Manuel Fuentes, y comentando la partida le dije que mi siguiente jugada en caso de Dg3+ era Tg2, pues es la que estaba calculando mentalmente. Y Manuel me hizo ver mi error porque obviamente sigue Dxe1. Sin embargo, eran cálculos sin tablero y por las prisas había calculado mal, afortunadamente cuando regresé y vi Dg3+, me detuve a pensar mejor. En estos torneos nunca es sano jugar a la ligera.",
        "30. Kf1 Qh3+ 31. Ke2": "Mi única posibilidad era llevar mi Rey al flanco dama",
        "31... Re6xe3+ 32. Nxe3": "Un grave error, finalmente mi rival sucumbió a la presión. Llevábamos más de 2 hrs sentados pensando.",
        "32... Qg4+ 33. Kd2 Qg3 34. Ree2 Qh4 35. Qc3 Rd8+ 36. Kc2 Qh1 37. Rfh2 Qe4+": "Ya estaba muy difícil para las negras. Necesitaban un craso error de mi parte",
        "38. Kc1 Qxf4 39. Rhf2 Qg5 40. a3 Qg1+ 41. Rf1 Qg5 42. Kb1 h5": "Una jugada fea, no es recomendable",
        "43. Ref2 Rf8": "Las negras se apacigüan, no queda de otra que jugar a la defensiva",
        "44. Qb3": "Está clara la amenaza",
        "44... Qe7 45. Nd5 Qe6": "El golpe final táctico que inició con Db3",
        "46. Nf6+ Kh8 47. Qc3": "Era cuestión de tiempo para que las negras sucumbieran y con golpes tácticos es más rápido. Al final, el muchacho, sumamente molesto me dijo fríamente \"Ps felicidades\". Yo no respondí, sin embargo me parecen absurdas esa clase de comportamientos antideportivos. Pero seguía una tercera ronda, y estaba seguro que sería más complicado."
    },
    "url": "https://gameknot.com/annotation.pl/torneo-unam-2012-round-2?gm=48423",
    "gameName": "Torneo UNAM 2012 (round 2)",
    "players": "Pastor, Arturo (1532) vs. Bueno Ballesteros, Alfonso (1000)",
    "opening": "Gruenfeld (D91), 5.Bg5"
}