{
    "moves": {
        "1. e4 Nc6 2. Nc3 Nf6": "Breyer's line, with the development of both Knights before moving a Pawn, is peculiarly his own. [Now known as the Breyer Variation of the Niemzowitsch Defense -- LA]",
        "3. d4 e5 4. dxe5": "N-B3 would lead into a fairly simple variation of the Four Knights' Game, but naturally White hopes for more.",
        "4... Nxe5 5. f4 Nc6 6. e5 Ng8": "Although White has now gained in both time and space, he will have some difficulty in holding on to his advanced post on K5.",
        "7. Bc4 d6 8. Nf3": "Clearly after 8 PxP BxP Black's position is eased and White's advanced KB pawn becomes more of a hindrance than a help.",
        "8... Bg4 9. O-O Qd7 10. Qe1 O-O-O 11. Ng5 dxe5": "If now 12 NxBP Q-Q5 ch 13 K-R1 QxB 14 NxKR, and Black virtually has 2 pieces for his Rook. The best line for White was the simple 12 B-N3.",
        "12. Kh1 f6": "In return for the sacrifice of the Exchange it is Black who has the strong point on K4, a surprising turn after his opening moves.",
        "13. Nf7 Na5 14. Nxd8 Nxc4 15. Qe4 Nd6 16. Qb4 Be7": "The threat was 17 PxP PxP 18 RxB.",
        "17. fxe5 fxe5 18. Nxb7": "Somewhat more promising was 18 N-B6 PxN 19 Q-R5.",
        "18... Nxb7 19. Rf8+ Bxf8 20. Qxf8+ Qd8": "If 20... N-Q1, White recovers his piece with 21 B-N5 P-KR3 22 BxN QxB 23 QxP N-B3 24 N-K4.",
        "21. Qxg7 Nf6 22. Bg5 Rg8 23. Qh6": "Not 23 QxN RxB.",
        "23... Rg6 24. Qh4 Nd6 25. Rf1 Nf5 26. Qxg4 Nxg4 27. Bxd8 Nge3": "The deciding blow.",
        "28. Rf3 Kxd8 29. h3 Rg3": "Preventing P-KN4, after which White has no resource left.",
        "30. Rxg3 Nxg3+": "White resigns. [Afterword by Mr. Coles] In the Hypermodern movement the name of Julius Breyer must always rank high, for he was one of its greatest pioneers and probably had a clearer idea than any of his contemporaries as to its true nature."
    },
    "url": "https://gameknot.com/annotation.pl/tournament-game-vienna-1921?gm=50932",
    "gameName": "Tournament game, Vienna 1921",
    "players": "Max Euwe  vs. Julius Breyer ",
    "opening": "KP (B00), Nimzovich defence"
}