{
    "moves": {
        "1. e4 c5": "Hi all. Here is one of my games that I lost recently. My opponent is a 2100+ National Elo player and it's a 45min+10sec tournament.\n\n1. e4 c5\nI come here to say that this is all for all.. I'll play Sicilian Defense and I'm here to win!",
        "2. Nc3": "Closed Sicilian.. In some way I really didn't expect this movement. ",
        "2... e6": "Sicilian Kan Defense",
        "3. g3": "fianchetto? Really? Well, surely I didn't expect that movement. From now on I play myself, I mean, without knowing the theory or main line in this position. Something I know here, it's a good plan to play e5, so his white Bishop can't play well because of his own pawn on e4.",
        "3... Nc6": "Nc6 controling d4 and e5",
        "4. Bg2 Nf6": "Chess is played developing pieces.. I don't want to make more pawn moves until see how white develops, plus Knights must play through the center.",
        "5. d3": "Ok.. i really hate this. My opponent plays e4 and now I feel that I'm playing a closed opening (it doesn't looks like a common e4 opening). Now white has showed his plan: King side castle, and an attack to the king side (I know this because of the pawn chain structure). But this position has something peculiar.. the f2 bishop. That piece covers somehow d5 and attacks the queen side. Now I have to decide how I'm going to play, what will be my plan.",
        "5... Be7": "Not decided to do d5 before putting my king on safe, I develop my Bishop. The common battery of Qc7 and Bd6 to pressure h6 in some Sicilian Games clearly doesn't make any sense in this position, and a fianchetto in the king side is a little bit slow, I want to gain some space, or at least put my king on safe to start measures in centre. ",
        "6. f4": "f4!? an interesting move that I allowed playing Be7 instead of d5, White has seen that he can gain space and attach the king side, putting pressure in e5 and f5.",
        "6... d6": "d6!. Almost any other move is bad here, I know as a Sicilian player that I can not allow e5 advance in this position.",
        "7. Nf3 a6": "Castling? Not any more with f4. As white has hurried to pressure the king side, now I hurry to queen side attack, meanwhile I speculate with the castle.. maybe I'm going to King side castle, or maybe queen side, or maybe I'm going to leave the king in the centre! .. ",
        "8. O-O Qc7": "Qc7, a normal Sicilian develop for the queen. Qb6 is other interesting option here, as h5!? could be (an attack with the white bishop on b7, h5, Ng4, h4, is very common to see in GM as Karpov in this kind of positions.",
        "9. Ne2": "Well, white wants all. He wants to play his c pawn to put more pressure in the center (good idea because of Black's King)",
        "9... b5": "b5! I still have some time meanwhile white is organizing his attack., and I don't want to die because I don't have enough space to move my pieces.",
        "10. h3": "h3, preventing the uncomfortable Ng4",
        "10... O-O": "Finally I decide the future of the game.. I know that white will mount an attack in the king side, while I plan to Queen-side attack, maybe mixing my attack with some center attack. I do this because I know his Knights and pawn structure in the king side are not well positioned, so I should be able to survive his attack, and in some point I hope my attack will be faster than his (I'm counting that in this king of attacks, as White throws his king pawns, the King is exposed to many checks).",
        "11. g4 Bb7": "Bb7?!, maybe it's a mistake here. f5! and Ng3 are good moves for White, as he is first in the attack. Also the bishop on c8 somehow help in the defend of the king.",
        "12. a3": "a3? Surely Ng3 or f5 where better for white here.",
        "12... e5": "Well, white haven't played f5 before, now I'm sick of waiting, plus I have almost all my pieces develop, so it's time to take active measures, and what is more active than a punch in the center?",
        "13. f5": "White is happy closing the position, as he knows that if he can reach h5 and g5 with pawns, supported with the pieces he has right now, the pressure over h7, g7 will be deadly mortal.",
        "13... Nd4": "Time to exchange a passive knight for one of his own. Here I'm aiming to many things: 1) If white doesn't take my knight, well it is a HUGE knight over there. It makes pressure over almost all the white side, plus I can always exchange it for his f3 knight which is the most active one white has. 2) I want the a8-a1 diagonal free for my white bishop 3) I'm aiming to have the c-row open to use it with my rooks.",
        "14. Nexd4 cxd4 15. Bg5 d5": "As I said, I want my pieces active!, so lets free the diagonal for my white bishop. ",
        "16. Bxf6 Bxf6 17. g5 Bd8": "scare? No!.. I'm still calm as I know White have troubles in his c-row, and if I'm able to enter I will have a very expose king. Also I'm very proud of my defense abilities, so I'm counting that I will survive to his attack. Here f6 for white seems to be the move, that's why I played Bd8.. after the game, and with a computer analysis, It gives Be7 the best one.. seems that the computer can survive to anything with tactic.. After that, in my next games I surely will analyse Be7-f7-Bd5 (now I like it, because even when white is the one attacking in the king side, it's a premature attack, without enough piece force.. I need to be more brave ;)",
        "18. Qe2 f6": "f6. Not the best move, but I didn't want to think all the troubles that could involve the position if white do f6 first.. As my style of chess, I thought I would prefer to defend this position than the other one (after the computer analysis, the other position was much more easy to play as Black.. damn!, why I'm so thought-lazy?)",
        "19. h4 dxe4 20. dxe4 Rc8": "Do you guys feel uncomfortable with Black?.. well, I must tell that the computer analysis says that Black has been up in score almost all the match ;) ",
        "21. Rac1 Qc6": "Qc6. I missed the better one, Qc4! (really?, exchange?.. yes!, without queens Black can laugh of the white attack, and the c2-pawn weakness will be more workable.",
        "22. gxf6 Bxf6": "Now I'm happy.. I have almost all what I want! ",
        "23. Ng5": "Careful with Ne6!",
        "23... Qb6": "Here I wanted to threat the queen and pass my rook to c4 and bring the other rook to c8.. Still Qc4 were better, and maybe other move.",
        "24. Kh2 Rc6": "Rc6. I thought it was better to c6 instead of c4 because it could protect the king side as well.",
        "25. Rfg1 Bc8": "Second mistake. I wanted to play Rc8, but now Ne6 makes a lot of pressure in g7, plus other important squares like f8, d8 and c7 (where i wanted to put my queen), so I tried to protect the spot.",
        "26. Bf1": "At first I didn't realize why White did this move..",
        "26... Bd7": "Preparing Rfc8",
        "27. Qg2": "Pressure over g7!",
        "27... Qc7": "Bringing back the Queen first, then the rook to c8. Also Qc7 helps to defend on the 7° row.",
        "28. Bd3": "Bd3! Now I see why the Bishop to f1. Damn!, now It's really difficult  for Black to attack the c-pawn, and white can proceed with his attack. A very good move! ",
        "28... Bc8": "I'm a little bit confused over here. I've lost my plans, so meanwhile i want to prepare the defenses (I want to play Qe7)",
        "29. Qe2 Qe7 30. Qh5": "The good spot for the queen. It makes Black to move h6 or play Bxg5. ",
        "30... h6": "Really?, a pawn move? Weren't better Bxg5? What is thinking black here?. Well, when I moved Qe7 of course I knew white will play Qh5, so I calculated h6 first, as Bxg5 allowed white to take with h-pawn or with the rook, in both cases putting a lot of pressure in h-pawn. While I was analyzing this move (h6), I saw a counter attack, that surely exist (here exist a LOT of moves, black can always sacrifice his white bishop on f5 to do e4 and go with checks and pressure over the white king or having activity, for example (one of many). ",
        "31. Nh3 Bd7": "what?!, wait, and the h-pawn? I know!!!   Bd7 was the best move I saw!, I know I'm going to lose the h pawn, but I have counter attack! really believe me! Bd7 is necessary to play Be8 later. ",
        "32. Qxh6 Bxh4": "Wow, open all! I really have steel nerves sometimes.. and as you will see, sometimes I lost all my thoughts and loose in one move t.t",
        "33. Qh5 Rh6": "What the hell??? That was the right move, but in different order!! First I was going to move Be8, expeling his queen, and then Rh6, giving black a good counter attack (playing this was the first option for Rybka engine!, even better than BxNg5, giving black advantage of 0,6 pawns!). But I lost my mind because of people pressure (at this time, all the players were standing up from their chairs, and I got nervous, and made my move without thinking.. I had 18 min. left on my clock and my opponent only 3:30 mins, so surely was an stupid mistake not to use wisely my time and think).",
        "34. Qxh6": "Loosing my rook, I have nothing else to do here. I stopped the annotation and last like 6 moves more, but white took advantage of his rook, and devastate my position. A good game that I won't forget (I was really pissed off with myself). :("
    },
    "url": "https://gameknot.com/annotation.pl/tourney-game?gm=50151",
    "gameName": "Tourney Game",
    "players": "Navarro, Simón  vs. Apablaza, Alexis ",
    "opening": "Sicilian (B23), closed, Korchnoi variation"
}