{
    "moves": {
        "1. e4 e5 2. Bc4": "The bisschop's opening, my favorite. I love to attack and open games and in most of the cases this opening does lead to that kind of games",
        "2... Nc6 3. Nf3 Bc5": "Giuoco piano",
        "4. b4": "Evan's gambit, this is something new I found lately, if someone knows it's weaknesses or things you have to look out for, please put it in comment, thanks.",
        "4... Bxb4 5. c3 Bc5 6. d4": "This is what Evan's gambit tries to do, gain a firm grip on the center at the cost of a pawn, which in this case seems to go fine.",
        "6... exd4 7. cxd4 Bb4+ 8. Bd2 Qe7": "He threatens to take e4",
        "9. O-O": "almost finishing development and stopping the e4 thread as 9. ... Qe4 is followed by 10. Re1! winning the queen.",
        "9... Nf6": "renewing the assault",
        "10. Bxb4 Nxb4 11. Nc3": "some trades so my knight is safe on c3 protecting my e-pawn",
        "11... O-O": "and now I'm starting to break up his development",
        "12. a3 Nc6 13. e5 Ng4 14. Nd5 Qd8 15. h4": "I played this move to be able to play Ng5 followed by Qc2 threatening mate and some tactical positions.",
        "15... f6": "?? this I think is a blunder as it allows me to win a knight, however this isn't true as you'll find out later.",
        "16. Nxf6+ Kh8 17. Nxg4 d5": "Well, this is why, I lose or my knight or my bisshop. I opt to 'sacrifice' my bisschop for more momentum on my attack by playing Ng5.",
        "18. Ng5 dxc4 19. Qc2": "Qc2 tries for an obvious mate on h7, my opponents notices this and plays the best of 2 counters: Bf5",
        "19... Bf5 20. Qxc4": "He can now win 2 knights for a rook, but he doesn't seem to want to and protects the check on f7 with his queen.",
        "20... Qe7 21. Ne3": "protecting my knight",
        "21... Rad8 22. Rad1": "the d-pawn is a key figure in my structure so I'm not allowed to lose it.",
        "22... h6": "chasing my nicely placed knight but I can pin his rook for a mate.",
        "23. Nxf5 Rxf5 24. Qc2 g6": "He treatens to take d4 now",
        "25. g4": "and now I believe his best move was Rf4 winning at least two pawn in this sequence: 25. ... Rf4 26. Nh3? or is there a better move? 26. ... Rxg4+ 27. Kh2 Nxd4. but he opts for the trades with Nxd4.",
        "25... Nxd4 26. Rxd4 Rxd4 27. gxf5 Rg4+": "I don't get this check why just don't take the knight? 27. ... hxg5 28. hxg5 Qxg5+and black wins with mate in two, the threats are dangerous then.",
        "28. Kh2 Rxh4+": "with this move I can even hold on to my knight",
        "29. Nh3 Qxe5+ 30. f4": "Blocked a probable huge amount of checks",
        "30... Qd4": "keeping his queen on the a1-h8 diagonal so I can't check his king and waiting for me to move one of my pieces.",
        "31. Qxc7": "I decided to grab a pawn here, because I believe he can't win anything down there.",
        "31... Qd2+ 32. Kg3 Rxh3+": "Can anyone tell me why he would play this instead of Rh5? or Qd3+?",
        "33. Kxh3 Qd3+ 34. Kg2": "from hereon I just have to escape his checks until I can move",
        "34... Qe4+ 35. Rf3 Qe2+ 36. Kg3 Qe1+ 37. Rf2 Qg1+ 38. Kf3 Qh1+ 39. Ke3 Qe1+ 40. Re2 Qg1+ 41. Kd3 Qd1+ 42. Rd2 Qf3+ 43. Kd4": "escaped his checks",
        "43... Qb3": "The a-pawn is there to be taken, why play his queen there, it doesn't seem to help much more I think...",
        "44. Qd8+ Kg7 45. Qe7+ Kg8 46. Qe8+ Kg7 47. Qxg6+": "I will not give anymore comments further in the game as it is just a matter of trading queens and winning the game, thanks for reading, please rate and comment.",
        "47... Kf8 48. Qxh6+ Kf7 49. Qe6+ Qxe6 50. fxe6+ Kxe6 51. Re2+ Kf6 52. Kd5 Kf5 53. Kd6 b6 54. Re7 a6 55. Kc6 Kf6 56. Re5 b5 57. Kb6 a5 58. Kxa5 b4 59. axb4 Kg7 60. b5 Kf6 61. b6 Kg7 62. b7 Kf6 63. b8=Q Kg7 64. Qe8 Kf6 65. Qe7+ Kg6 66. Rg5+ Kh6 67. Qg7#": ""
    },
    "url": "https://gameknot.com/annotation.pl/tournament-game?gm=52728",
    "gameName": "tournament game",
    "players": "Bert  vs. Ewout ",
    "opening": "Bishop's opening (C23)"
}