{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Bb5 Nd4": "The Bird Defense, a very aggressive, if not perfectly sound, counter.",
        "4. Nxd4": "Initiating the exchange...",
        "4... exd4": "...and completing it.",
        "5. Bc4": "Pressuring KB7, a notorious weak spot.",
        "5... Nf6": "Developing, and preventing a Q-and-B attack with Q-R5.",
        "6. e5": "Trying to drive the Knight and allow Q-R5, followed by QxP mate.",
        "6... d5": "The best defense. Now the quick mate idea is snuffed for good.",
        "7. Bb3": "Still hoping to generate an attack on KB7. But now the initiative passes to Lange.",
        "7... Bg4": "Suddenly Lange is the better developed, and after Anderssen's next move he will be quite cramped.",
        "8. f3": "Blocking his Q, and the two Black QP's are squeezing Anderssen's Q-side.",
        "8... Ne4": "A very sharp attacking move. With Anderssen's Q-side logjammed, Lange will try to use his superior mobility to smash the White defenses.",
        "9. O-O": "Getting his K out of the center. However, the weakened diagonal from White's KN1-QR7 looks very dangerous [...P-Q6 opens the way for ...B-B4 ch, and the threat is looming.]",
        "9... d3": "Lange proceeds with his plan.",
        "10. fxg4": "Anderssen tries to reduce the scale of the attacking force. However, his imprisoned Q-side pieces are virtually valueless.",
        "10... Bc5+": "The logical follow-up.",
        "11. Kh1": "Practically forced.",
        "11... Ng3+": "A brilliant reply, and probably the winning move.",
        "12. hxg3": "Anderssen has little choice.",
        "12... Qg5": "The Queen draws a bead on the helpless White King.",
        "13. Rf5": "Desperation.",
        "13... h5": "A superb move. 14 RxQ would be countered by 14... PxP dis ch 15 R-R5 RxR mate.",
        "14. gxh5": "To prevent immediate mate.",
        "14... Qxf5": "The Rook falls, and Lange's attack has lost none of its fury. The threat is now 15...QxP ch 16 QxQ RxQ mate.",
        "15. g4": "The only defence.",
        "15... Rxh5+": "Pressing the attack.",
        "16. gxh5": "White can do nothing to stop the attack.",
        "16... Qe4 17. Qf3": "The last barricade. White's other pieces are frozen and cannot defend the exposed King.",
        "17... Qh4+": "Forcing Anderssen's response.",
        "18. Qh3 Qe1+": "Anderssen resigns. The curtain falls after 19 K-R2 B-N8 ch 20 K-R1 B-B6 dis ch 21 K-R2 Q-N7 mate."
    },
    "url": "https://gameknot.com/annotation.pl/tournament-game?gm=33298",
    "gameName": "Tournament game",
    "players": "Adolph Anderssen  vs. Max Lange ",
    "opening": "Ruy Lopez (C61), Bird's defence, Paulsen variation"
}