{
    "moves": {
        "1. e4 e6": "Marin plays a conservative French defense.",
        "2. d4": "Book.",
        "2... d5": "The standard response, and a must.",
        "3. Nc3": "Solid. 3 P-K5 locks the center but without development White will be hard-pressed to hold it.",
        "3... Nf6": "Tempting yates to play 4 P-K5.",
        "4. Bg5": "Yates instead continues his development. ",
        "4... Be7": "Practically forced. The only other choice was 4... Q-Q2 to avoid losing the pinned Knight by...",
        "5. e5": "...this move, which has now been adequately prepared.",
        "5... Ne4": "With the more cramped position, Marin naturally wishes to whittle down the wood. This move forces the exchange of at least one pair of minor pieces.",
        "6. Bxe7": "Yates elects to trade Bishops.",
        "6... Qxe7": "Completing the exchange.",
        "7. Qg4": "Attacking the weakened King-side at once.",
        "7... O-O": "Marin tucks his King into what he *thinks* is a safe spot...",
        "8. Bd3": "Threatening to win a Pawn by exchanging on K4, so...",
        "8... Nxc3": "...Marin preemptively exchanges off the Knight himself.",
        "9. bxc3": "Completing the trade.",
        "9... c5": "With Yates having a K-side spatial advantage, Marin wishes to gain space on the Q-side as a counterbalance.",
        "10. Nf3": "Developing with a hidden threat. The proper defence is 10... P-KN3, cutting off the Bishop's diagonal.",
        "10... c4": "Marin overlooks the threat, and is blindsided by...",
        "11. Bxh7+": "...this thunderbolt from heaven! Marin resigns at once. If 11... KxB 12 Q-R5 ch K-N1 13 N-N5, and the only way to stop mate is 13... QxN 14 QxQ leaving Marin with a hopeless disadvantage in material. [13... R-Q1 14 Q-R7 ch K-B1 15 Q-R8 mate.] And 11... K-R1 12 Q-R5 sets up a devastating discovered check that cannot be prevented."
    },
    "url": "https://gameknot.com/annotation.pl/tournament-game-hamburg-1930?gm=39316",
    "gameName": "Tournament game, Hamburg 1930",
    "players": "Frederick Yates  vs. Valentin Marin ",
    "opening": "French (C13), classical, Tartakower variation"
}