{
    "moves": {
        "1. e4 d5": "The first two moves are obvious because they are commonly played.",
        "2. exd5 Qxd5": "This starts as my opponent's gameplan is to be turned into a knightmare (get it?).",
        "3. Nc3 Qe5+": "I didn't see this, but it's just as worthless as all other moves black could do.",
        "4. Be2": "I was reminded that this was a good move.",
        "4... Qg5": "Two options that I was torn about: 5.d4, or 5.Nf3.",
        "5. Nf3": "Although I lost a pawn, I did not care. Black's in a terrible position.",
        "5... Qxg2 6. Rf1": "I missed 6.Rg1. Oh well, it seems about time that I stop bugging the Queen around and start developing the rest of my pieces.",
        "6... f6": "Flimsy and sloppy. That's all.",
        "7. d4 b6 8. Rg1": "I left Black no other option for his move.",
        "8... Qh3 9. Rg3": "\"Thanks for standing there, insane Queen!\" -my Rook.",
        "9... Qe6 10. d5": "\"I can do this all day!\" -my d-pawn",
        "10... Qd7": "Say goodbye to Black's Queenside.",
        "11. Bb5 c6 12. dxc6 Nxc6 13. Bxc6 Qxc6": "More Queen bugging.",
        "14. Qd3 Be6 15. Nd4 Qd6": "I won...unless...there's something luckier than this.",
        "16. Ncb5 Qd5": "I don't know why Black didn't resign after this move?",
        "17. Nc7+ Kd8 18. Nxd5": "I win a Bishop too because Black's tempted to take my Knight.",
        "18... Bxd5 19. Ne6+": "Goodbye, greedy Bishop!\" -my Knight.",
        "19... Ke8": "Two options: I could re-fork Black and earn his rook...",
        "20. Qxd5": "or I could take his Rook in a more torture-some way.",
        "20... Rc8": "Before revealing the answer, can you tell me how to mate in two?",
        "21. Rc3": "Move #1.",
        "21... Rb8": "He could also take my rook, which would be a mate in two or three afterward.",
        "22. Nc7#": "Lesson: Don't be too greedy and also, ward yourself away from taking the d5 pawn on move two with the Queen."
    },
    "url": "https://gameknot.com/annotation.pl/tournament-game-1-the-failed-scandinavian?gm=41399",
    "gameName": "Tournament Game #1:The Failed Scandinavian",
    "players": "Austin (730) vs. Joe (664)",
    "opening": "Scandinavian defence, Lasker variation (B01)"
}