{
    "moves": {
        "1. e4": "Une partie avec des hauts et des bas, des erreurs, un débusquage comme à la chasse à courre! \r\n\r\nOn part!",
        "1... c5 2. Nf3 Nc6 3. d4 cxd4 4. Nxd4 g6 5. Nc3 Bg7 6. Be3 a6 7. Qd2 Nf6 8. Be2 O-O 9. O-O d5 10. Nxd5": "Comment une telle erreur est-elle possible? J'avais décidé de prendre le pion (avec le pion évidemment) et à la dernière minute je me suis dit : Et si je prenais avec le cavalier, ce serait la même chose. Et de prendre sans réflléchir. Conclusion : il faut toujours bien réfléchir avant de jouer (c'est comme une vérité de La Palice, mais c'est vrai). Habituellement, je fais le vide sur mes réflexions avant de jouer, question de vérifier s'il n'y a pas quelque chose d'évident que j'ai manqué. Mais, visiblement, je ne l'ai pas fait sur ce coup.",
        "10... Nxe4": "Évidemment! Mon adversaire avait abandonné quelques jours auparavant dans une autre partie, aussitôt qu'il allait perdre une pièce (pas vrai, Nicolas ?). Je me suis dit que je le chicanerais pour son manque de ténacité. Donc, pas question que j'abandonne.",
        "11. Qd3 Qxd5 12. Nxc6": "Tout à coup il jouerait QxQ ?",
        "12... bxc6 13. Qa3 Nd6 14. Bf3": "Les fous blancs sont très bien placés, donc il y a peut-être de l'espoir.",
        "14... Qb5": "Excellent. Comment continuer? Les blancs doivent tenter de garder une certaine pression.",
        "15. c3": "Pas beaucoup de choix.",
        "15... Bf5": "Ici, je ne comprends pas pourquoi les noirs ne jouent pas Nc4. Le pion e7 n'est pas très important en vue de l'échange d'un des fous blancs et la possibilité de sortir une tour avec gain de tempo.",
        "16. b3": "Un coup qui ne m'a presque pas pris de temps de réflexion. Dans une position de désavantage, l'activité des pièces blanches est ce qui compte le plus. Donc, tant pis pour le pion c.",
        "16... Bxc3": "Les noirs auraient-ils été mieux de ne pas prendre? Mai après tout, un pion est un pion.",
        "17. Rac1 Bb4": "Le problème avec ce coup c'est qu'il permet aux blancs de placer sa dame à un endroit plus favorable.",
        "18. Qb2 Rfc8": "L'erreur qui justifie les blancs d'avoir continué. Il fallait jouer le cavalier pour laisser la case d6 au fou.",
        "19. a3 Ba5": "Ba3 était meilleur en raison de ce qui suit.",
        "20. Rc5 Qxf1+": "Ici, ma première réflexion fut : mon adversaire perd les pédales. Pourquoi sacrifier sa dame pour une tour. Bien sur, il perd une pièce autrement, mais n'est-ce pas mieux qu'une tour pour la dame? Mais j'ai changé de réflexion plus tard.",
        "21. Kxf1 Bd3+ 22. Be2 Bxe2+ 23. Kxe2": "Personnellement, j'aurais tenté de conserver les deux fous avec les blancs, mais c'est une considération purement théorique.",
        "23... Bb6 24. Re5 Bxe3": "Ici encore, il me semble que les noirs auraient du éviter les échanges. Mais ça aussi. c'est de la théorie.",
        "25. Rxe3 Rc7 26. g4": "Pourquoi avancer ce pion? Dans ce type de fin de partie, si on peut parler de fin de partie déjà, l'avantage de la dame est sa mobilité et sa capacité d'attaquer le roi adverse de tous bords et tous côtés. Mais pour cela, il faut que le roi adverse soit attaquable de tous bords et tous côtés. Il faut donc le débusquer de dans son petit coin tranquille.",
        "26... Rac8": "Ici (encore la satanée théorie), je ne comprenais pas la stratégie de mon adversaire. Les tours appartiennent sur les colonnes ouvertes. Ici mon adversaire semble faire fi de ce principe. Je me dis : victoire facile à l'horizon.",
        "27. Qd2": "Mais plus je regarde la position plus la victoire semble difficile. Finalement, toute la stratégie des noirs me semble pas si mauvaise. Et tant pis pour la théorie. Mais je suis encore confiant de l'emporter. Ce coup fait partie de mon plan de débusquage.",
        "27... Rd8": "Oups! Changement de plan. Je craignais au plus haut point c5, la suite logique, il me semble, des derniers coups noirs. Je crois toujours que c'est le coup qui aurait pu sauver les noirs, puisqu'il permet aux tours noirs d'entrer avec force dans le jeu. Surtout que le coup précédent devient une perte de temps. Le temps est important aux échecs.",
        "28. Rh3": "La suite du débusquage.",
        "28... f6": "Pratiquement forcé.",
        "29. Qh6": "Et le chasseur continue...",
        "29... e5": "Encore forcé",
        "30. Rd3": "Changement de plan? Non, suite du débusquage. Le roi noir est maintenant plus exposé.",
        "30... Rcd7": "Naturellement",
        "31. Qd2": "De retour au centre. Ma stratégie est d'échanger une paire de tours. Dans cette position, il sera impossible pour les noirs de l'empêcher. Dame contre tour et cavalier, avec le roi noir maintenant plus vulnérable, et la victoire est possible.",
        "31... Kf7": "Va dans le sens du plan des blancs, mais il est difficile de suggérer un meilleur coup. Si les noirs ne font rien, pour éviter un échange de tours, les pions blanc vont continuer d'avancer de côté roi, et le débusquage va continuer.",
        "32. g5": "Toujours dans le suite du plan.",
        "32... f5": "Je crois que c'est le meilleur coup.",
        "33. f4 e4": "Ici, par contre, les noirs auraient du prendre le pion. Mais c'est plus une intuition plus qu'une certitude.",
        "34. Rd4 Ke8": "Tentative louable de pouvoir jouer ensuite Nc4 et éviter l'échange de tours.",
        "35. Qa5": "Easy does it! (Pardonnez le changement de langue, mais c'est ce que je me suis dit).",
        "35... Nb5": "Aussi bien crever l'abcès, se disent les noirs. Nc4 ne fonctionne pas (RxN tout simplement, et la dame peut se sacrifier pour les 2 tours noires).",
        "36. Rxd7 Rxd7 37. a4": "Le coup clé qui justifie le 35ème coup des blancs. Le noirs vont devoir donner échec avec le cavalier en d4 au lieu de c3 (si la dame blanche avait pris le pion). Le cavalier en d4 bloque la tour, et, malgré les apparences, ne pourra pas prendre le pion en b3.",
        "37... Nd4+ 38. Kf2 Nxb3": "Non!!! J'ai bien dit que le cavalier ne pouvait pas prendre le pion.",
        "39. Qe5+ Kd8": "Tous le coups possibles ne peuvent empêcher la capture du cavalier. Même Kf7 (Qf6  suivi de Qe6 )",
        "40. Qb8+ Ke7 41. Qxb3 Rd3 42. Qb7+ Kd6 43. Qxh7": "Mi ni mi ni ma ni mo! Je prends celui-là.",
        "43... e3+": "J'attendais plutôt Rf3  mais la partie est tout de même terminée.",
        "44. Ke2 Ra3 45. Qxg6+": "On peut retenir deux leçons de cette partie (à part le fait de réfléchir avant de jouer et de ne pas abandonner trop tôt) : Il ne faut pas toujours se fier à la théorie (le sacrifice de la dame noire n'était pas si bête); les coups de tour des noirs sur la colonne c auraient pu les sauver, s'ils avaient continué avec la poussée du pion. À part ça, c'est tout de même un bon exemple de ce que la dame peut faire contre tour et pièce mineure. La dame va habituellement l'emporter grâce à sa mobilité, et avec l'aide du roi adverse si celui-ci est vulnérable."
    },
    "url": "https://gameknot.com/annotation.pl/tournoi-quebec-7?gm=2153",
    "gameName": "Tournoi Quebec #7",
    "players": "guy04 (1785) vs. lambertjn (1517)",
    "opening": "Sicilian (B35), accelerated fianchetto, modern variation with Bc4"
}