{
    "moves": {
        "1. e4 Nc6 2. Nc3": "If 2 P-Q4, 2...P-Q4 3 P-K5 B-B4 with a fairly easy development.",
        "2... e6 3. d4 d5": "Now the game has transposed into a kind of French Defense where Black has played N-QB3 instead of P-QB4.",
        "4. e5 Nge7": "If  4... QN-Q2, 5 QN-Q2 P-QB4 6 P-QB3.",
        "5. Nf3 b6": "One of the advantages of the system is that Black solves the problem of the bad QB in the French Defense.",
        "6. Ne2": "If 6 B-K2, 6... P-QR4 followed by 7... B-R3.",
        "6... Ba6 7. Ng3 Bxf1 8. Kxf1": "White is deprived of his best attacking piece.",
        "8... h5": "A typical Niemzowitschian maneuver. He secures a grip on the white squares and prevents White from getting a grip on the black squares with N-R5.",
        "9. Bg5": "Threatening 10 N-R4 P-N3 11 B-B6.",
        "9... Qc8 10. Qd3": "Avoiding 10 N-R4 Q-R3 ch 11 K-N1 Q-R5, where Black wins the Q pawn in exchange for the KR pawn.",
        "10... Ng6 11. c3 h4": "Now White cannot enforce a hold on the black squares with either N-R4 or P-KR4.",
        "12. Ne2 Be7 13. h3 Bxg5 14. Nxg5 Nce7 15. Kg1 f6": "At last Black makes his effort to secure the center.",
        "16. Nf3 Qd7": "Preparing ...P-QB4.",
        "17. Kh2 c5 18. c4": "If 18 KPxP, 18... Q-B2 ch 19 K-N1 NPxP and White's KR is shut in.",
        "18... Qc7 19. cxd5 c4": "If 19... PxKP?, 20 Q-N5 ch K-B1 21 N-N5 PxP dis ch 22 P-B4 NxBP 23 KR-KB1 NxQP 24 NxP ch wins for White.",
        "20. Qc2 exd5 21. Rhe1 O-O 22. Nc3 fxe5 23. Nxe5 Nxe5 24. dxe5": "White could have retained drawing chances with 24 RxN! N-B3 25 NxP Q-Q3 26 QxP NxR 27 PxN QxP ch 28 P-B4 Q-K3 29 P-B5 Q-K4 ch 30 K-R2 R-B2 31 R-Q1. After the text move the passed black QP becomes a terror.",
        "24... d4 25. Nb5 Qc5 26. Nd6 d3": "If 26... P-QN4, White holds with 27 QR-Q1 P-Q6 28 RxP RxP 29 R-Q2.",
        "27. Qxc4+ Qxc4 28. Nxc4 Rxf2 29. Rad1 Rc8 30. Ne3": "Not 30 N-Q6? R/1-B7 with complete control of the 7th rank.",
        "30... Rd8 31. Nc4 Nf5 32. a4": "Not 32 N-Q6 NxN 33 RxP N-N2 34 RxR ch NxR 35 P-K6 NxP 36 RxN RxP with a won ending for Black.",
        "32... Kf7 33. Re4 Re2 34. Rf4 Ke6 35. Rg4 d2 36. Rg6+ Kf7 37. Rg4 a6": "The move that forces the Knight to give way at last by the threat of ...P-QN4. If 38 NxP Black plays ...R-K8 at once.",
        "38. Rf4 Ke6 39. Nd6 Ne3": "White resigns."
    },
    "url": "https://gameknot.com/annotation.pl/tournament-game-niendorf-1927?gm=56554",
    "gameName": "Tournament game, Niendorf 1927",
    "players": "Alfred Brinckmann  vs. Aron Niemzowitsch ",
    "opening": "KP (B00), Nimzovich defence"
}