{
    "moves": {
        "1. b3": "Interesting opening that I rarely hear of.  In fact, I don't know what it's called, but 1.e4 or 1.d4 is the most common opening.  Not only that, but I haven't someone fianchettoing his or her Bishop on the first move.  I'm not saying that there's anything wrong with it, for indeed, I don't think there is.  But, what I mean is that we don't often see this opening which makes sense because the idea is for Ken to bring Andy into unfamiliar territory.  In fact, I heard of a Grandmaster winning by using that strategy.",
        "1... e5": "Sticking to what he knows, however.",
        "2. Bb2": "Forming a nice flank for his Bishop.  This answers the question as Ken is trying to get Andy in unfamiliar territory since the general idea is for the Knight to be developed before the Bishop.  Of course, there's always exceptions, but when it's this early, it becomes safe to infer that something else is going.  And, that other thing makes total sense which is how I came up with that conclusion.",
        "2... Nc6": "I haven't seen any games from Andy before, but the inference is that Andy is sticking to what he knows best.",
        "3. e3": "Preventing his center pawn from becoming en-prise, after Andy's next move.  ",
        "3... Nf6 4. Nf3": "Meanwhile, Ken continues with his development.",
        "4... d6": "Getting a nice pawn chain, in the process.",
        "5. d4": "Although it has not transposed, this position, however, rings a bell.  And, that would be the Cole System's.  They're not very similar, but there is a comparison with white's fianchettoed bishop on b2, pawns on e3 and d4, and black's knight on f6.  That's because the Cole's Franketort System starts off with 1.d4, d5 2.Nf3, followed by 3.e3, and an eventual b3, Bb2 as white.",
        "5... e4": "Hitting Nf3, which is somewhat similar to what I see in the Terasch Variation of the French Defense, except that it was black to who attacked.",
        "6. Nfd2": "As anticipated.  Anything else would allow Andy to get a nasty discover attack by moving his N.  After which, it would at the very least get exchanged with black's bishop and result in doubled pawns which we don't want here.",
        "6... Be7": "Continuing with his development.",
        "7. c4": "Unlike before, I have no idea why Ken played this.  I, most likely, would've continued developing by bringing my Bf1 and preparing to castle, in this position.  ",
        "7... Bf5": "Completing his development.",
        "8. Nc3": "And, Ken continues with his development, but in a different way.",
        "8... O-O": "Bringing his monarch to safety.",
        "9. a3": "I'm not exactly sure why this was played, but my inference is to prevent the annoying 9...Nb4  That is a common pattern which I know to well.  The reason being is that in the Ruy Lopez or Sicilian Defense, although we're reversing colors, the a pawn does advance to stop the Knight from coming on the b file.  Or to prevent a Bishop check which wouldn't happen, but the N swarming in is something to take caution.  I learned about this kind of tactic from GM Judit Polgar, in her win against Anand, before he became a world champion.     ",
        "9... a5": "But, in Andy's case, I don't see the point behind this move.  The thing is that I understand Ken much better then Andy, so I don't view any of white's moves as pointless.  But, with black, however, it's a very different story.  And, when that happens, I just don't understand what they accomplish, which is what is implied by not seeing the point.",
        "10. Qc2": "The idea is to connect the Rooks, which I like a lot.  Ken starts by mobilizing his Q side.",
        "10... d5": "? Strengthening his DSB, but I view it as a mistake.  Now, Ken told me that there were several mistakes.  In my books, this is the first one as it loses a pawn, when all is said and done.  Instead, I would've played 10...Bg4, so that if white were to complete his development, I'd just exchange.  And, I base some of this on what kenneth_fiore_3 of where I started to go wrong in my last annotation with Jack Stockel.  He said that one should not exchange against a stronger player just to develop.  When I did that, things started to go downhill, from then on.",
        "11. cxd5 Nxd5 12. Ncxe4 Qd7": "Connecting his Rooks.",
        "13. Bd3": "Completing his development, and it's important to note that if Andy did not play 10...d5?, this move wouldn't have been possible.  As now, the LSB is better placed.  That's another reason for viewing that move as a mistake.  Even if not, I deem it worthy of a queiry.",
        "13... Bg6": "Not only don't I know why Andy played this, but I don't see the point.",
        "14. Ng3": "But, it appears that this has become a closed position, despite the bishops not being blocked in by their own pawns, as Ken taught me in charleshiggie's most recent annotation.  Therefore, this retreats makes sense.  Afterall, it's important to keep the stronger piece. ",
        "14... Ndb4": "Now, the position becomes complicated.  In my opinion, Andy sacced his N to get an open file.  But, Ken, however, has some surprises, as we're about to see.  In fact, I've witnessed similar positions in GM games which shows how complex it's becoming.",
        "15. axb4 Nxb4": "That's because Ken is going to sac his Queen for a minor one.  Yet, despite having the Queen, just like what we see in TA's Q sac, one must understand their theory, as Joe emphasizes.  With that it's important to note, as I learned in, \"The Deeper Chess Theory Club\" that after saccing material, a lot of times, Joe's opponents go wrong by not understanding enough theory.  ",
        "16. Bxg6 Nxc2+ 17. Bxc2 Bb4": "In return, however, Andy pins the Knight.",
        "18. Ke2": "But, as it turns out that this pin isn't serious, at all.  However, I would've broken by castling long.  My first instincts was 18.0-0??, but that would leave d2 en-prise and enable black to get a piece.  In which case, the outcome would, likely, be different for Ken, in a negative way.  But, with 18.0-0-0, the Knight is protected and the monarch appears to safer.  Because the K was brought out, it leads to one inference.  What comes to mind is that this is an endgame, even though, it doesn't appear so.  If I'm right, it makes perfect sense because the King is a dangerous weapon in that phase of the game, as Jack Stockel and GM Susan Polgar have pointed out.",
        "18... Bxd2": "What's even more interesting is Andy's decision to exchange.",
        "19. Kxd2 c5": "I don't know why Andy played this.",
        "20. Bd3": "I'm also not sure why this was played, but my inference is to give the monarch added protection since there's a piece in front of it.  Now I know that it's an endgame because I often see the bishop right in front of the monarch, when we've reached that phase.",
        "20... Rfe8": "Preparing to do some damage by centralizing his Rook.",
        "21. h4": "Not exactly why Ken moved here, but my inference is that he's thinking many steps ahead.  The only idea that makes sense to me is an attempt to get a passed pawn.  Sure isn't now, but if it kept advancing, white's Ng3 moved, followed by the g pawn advancing, two pawns are connected, which also makes pawn chains dangerous.  Then, the f pawn adds to that, and they keep advancing.  Later you exchange, until one has a clear away, so that it's not in front of or next to the pawn, making the passed pawn.  ",
        "21... Qd5": "The plan, of course, would be to prevent that.  So, the idea appears to be 22...g5, 23.hxg5, Qxg5 preventing a problem.",
        "22. e4": "But, Ken puts a stop to that plan by attacking the Queen.  By doing this, he's now saccing another pawn which makes it more interesting.",
        "22... Qxb3 23. Bc3": "Protecting his Bishop.  But, after this, Andy goes for the gusto by exchanging another pawn.",
        "23... cxd4 24. Bxd4 Rad8": "Centralizing his other Rook, whilst, attacking Bd4.",
        "25. Ne2": "Which Ken protects.",
        "25... Qb4+": "It appears that for the thrills and giggles, Andy delivers a check.  The reason I posted thrills and giggles is that this check does not appear to be serious, so I don't see the point here.  Of course, I must be missing something because, more often then not, things that I view as pointless are known to be very damaging.",
        "26. Ke3": "In addition, I would've gotten out with 26.Bc3.  In doing so, I would feel a gain of time since black must protect his Queen, in which case, I'd try to come up with long term plans.  Instead, Andy has other ideas, as he'll sac his Rook for a Bishop.  In my opinion, this is unsound because it appears that Ken can do a lot of damage, in this position.  I'm not exactly sure what he'll do, but that's where it gets quite interesting.",
        "26... Rxd4 27. Nxd4 Qc5": "Pinning the Nd4.",
        "28. Rhc1": "Which Ken tries to break the pin with this attack.  ",
        "28... Qa7": "But, Andy figures out how to keep the pin, anyhow.",
        "29. Bc4": "Pinning f7.",
        "29... Rd8": "Which Andy does not want.  That's because, with this added attacker, Andy threatens to win a piece.",
        "30. Bd5": "So, Ken adds another defender to protect it.",
        "30... b5": "It appears that Andy is trying to wear down's Ken position because what's kept in mind is that Ken can't take on b5 since it's pinned.  So, my inference is that black is taking advantage of that to try and exploit white's position.",
        "31. Kd3": "It's well known that in an endgame, your monarch is a powerful weapon.  Ken is using that to his advantage.",
        "31... b4": "Getting a solid pawn chain, in the process.  However, Andy left himself vulnerable to a fork.  But, Andy does get out of it in a surprising way that is easy to overlook.  With that, what came to mind was defending with 31...Qd7, and if 32.Bc6, I'd answer with 32...Qc7.",
        "32. Nc6 Qa6+": "With that being said, this is how Andy responds since Ken is in check.",
        "33. Ke3 Qb6+": "The idea with this check is still the same.",
        "34. Kf3 Rd6": "Allowing Andy to protect both.  But, Ken has other idea, starting with the next move.",
        "35. Ne7+ Kf8": "Going after the N.  In this position, I, most likely, would've played 35...Kh8 only because Jack Stockel told me that, in general, bringing the monarch to the corner is part of K safety.  I recently learned, however, that this is not always true.  In fact, despite what I said or the response, I like black's his intentions better because black attempts to gain tempo, in the process.",
        "36. Nf5": "The only problem is that white is the one that gains tempo.",
        "36... Rd8": "As now, Andy was forced to protect his Rook.",
        "37. Rc6": "After which, Ken gains even more time with this move.",
        "37... Qb7 38. Ne3": "Which he uses on his visual N counts, which adds up to the amount of times the Knight moves, and on which squares.  The reason for mentioning this is because tactical-abyss said that this is very important, and it's one of the techniques he uses in his Q sacs.  I learned a bit from that and applied it one of my games.  In that game, I did not make blunders but used the N a lot, and the visual count enabled me to win that game.",
        "38... b3": "As the saying goes, \"Passed pawns must be pushed.\"",
        "39. Rb1": "But, Ken puts a stop to that by placing his Rook right in front of that pawn.  Now, Jack Stockel made me study a position that was a little, similar as Homework.  But, the idea and what he taught there was that, in general, the way to stop a passer is by placing the Rook in front of it, as we see here.",
        "39... a4": "But, this pawn chain can be a liability.  I studied a more similar example with tactical-abyss, specifically, on pawn chains.  Like what we see here and as mentioned, there was a passer stopped by the Rook.  But, what got dangerous was the other passed pawn connected to it, just like here and formed a pawn chain.  It was in a video by an IM, and with a pawn chain similar, he was able to force a win.",
        "40. Rc7": "?? So, the idea is to diffuse the situation with a double attack.  After what Ken mentioned about both sides making mistakes, this was, in my books, a blunder.  I don't see any threats affiliated with it, so in this position, I think that it's not a mistake to take here.  In other words, \"To take is a mistake\", is not applicable here.  ",
        "40... Rd7": "With that being said, I would've played 40...Qxc7.  In fact, by playing this, I believe that Andy will find himself in trouble, starting with Ken's the next move, as white will have a series of nasty checks.",
        "41. Rc8+ Ke7": "However, I think that black could've saved the game with 41...Qxc8.",
        "42. Nf5+ Kf6 43. Rc6+ Ke5 44. Ke3": "Getting the opposition which is very useful in endgames. ",
        "44... g5": "I'm not sure why black played this, but this loses even quicker.  That's because white get's another pawn.  Instead, I would've attacked with 44...g6 and after white's Nf5 drops back, I'd try to figure what I can do to prevent what's coming.",
        "45. hxg5 Qxc6": "In this position, there's nothing that Andy can do, so he might as well have taken the Rook.  In other words, one move is as good or bad as another because Ken mates, regardless.",
        "46. f4#": "And, the moral is the same as what we see with TA's Q sacs/unusual openings.  Strong players can, in general, give up material and still win.  What's important to remember is that against formidable players like Joe and Ken, one must understand their theory.  Lacking, even the slightest amount of that can lead disaster.  And, that's we saw, in this game."
    },
    "url": "https://gameknot.com/annotation.pl/tournament?gm=60573",
    "gameName": "Tournament",
    "players": "kenneth_fiore_3  vs. Andy ",
    "opening": "Nimzovich-Larsen attack (A01), modern variation"
}