{
    "moves": {
        "1. d4 Nf6 2. c4 e5": "Vidmar uses a Budapest Gambit, a relatively new line at the time. Rubinstein proceeds to badly mishandle the game.",
        "3. dxe5 Ng4 4. Bf4 Nc6 5. Nf3 Bb4+": "Rubinstein's greedy insistence on maintaining the Pawn will be punished. Modern players know that often times the best way to deal with a gambit is to return the Pawn at the appropriate time in return for a positional advantage.",
        "6. Nc3 Qe7 7. Qd5 Bxc3+": "Forcing an ugly weakness in Rubinstein's Pawn structure.",
        "8. bxc3 Qa3": "Aggressively posting his Queen.",
        "9. Rc1 f6": "Forcing the removal of the advanced KP.",
        "10. exf6 Nxf6": "Returning the Knight to its natural square with tempo.",
        "11. Qd2 d6": "Opening a line to develop his last minor piece.",
        "12. Nd4 O-O": "Tucking his King away before engaging in complications.",
        "13. e3 Nxd4": "Removing Rubinstein's strongly centralized Knight.",
        "14. cxd4 Ne4": "Planting his own Knight in a central outpost.",
        "15. Qc2 Qa5+": "Forcing Rubinstein's King towards the open spaces.",
        "16. Ke2 Rxf4": "A beautiful sacrifice, breaking apart the Pawn-chain shielding the White King.",
        "17. exf4 Bf5": "Now threatening 18... N-N6 ch winning Rubinstein's Q on the discovered attack.",
        "18. Qb2 Re8": "Now 19... N-N6 dbl ch would win the White KR.",
        "19. Kf3 Nd2+": "Beginning a furious King-hunt.",
        "20. Kg3 Ne4+": "Driving the King further away from his friends.",
        "21. Kh4 Re6": "Closing in.",
        "22. Be2 Rh6+": "The logical follow-up.",
        "23. Bh5 Rxh5+": "Another sacrifice, this one drawing the King onto a square from which a deadly double check can be issued.",
        "24. Kxh5 Bg6+": "Rubinstein graciously resigns rather than play out the checkmate."
    },
    "url": "https://gameknot.com/annotation.pl/tournament-game-berlin-1918?gm=37700",
    "gameName": "Tournament game, Berlin 1918",
    "players": "Akiba Rubinstein  vs. Dr. Milan Vidmar ",
    "opening": "Budapest (A52), Rubinstein variation"
}