{
    "moves": {
        "1. d4": "This game was part of \"trachess's Leningrad Dutch\" mini-tournament. The first 4 moves are predetermined to give us a staring position.\n\nI wanted to annotate this game to show the resilience of my opponent and how it is possible to maintain a serious attack even after loosing material. ",
        "1... f5 2. g3 d6 3. Nf3 g6 4. Bg2 Bg7": "First 4 moves was preset by trachess's mini-tournament with Leningrad Dutch opening.\nThe game starts with move 5.",
        "5. Bg5 c6 6. d5": "Mistake from karatekid, opening the diagonal for my bishop. So I tell myself, \"That's all I need to win this game! ( or is it? )",
        "6... Bxb2 7. Nbd2 Bxa1 8. Qxa1": "I've got a 3 point piece advantage at this point but... his queen has taken control over my bishop for the long diagonal. And that positional advantage will disturb me until the endgame.",
        "8... Nf6": "Only move possible to protect my Rook. ( Don't even think about e5 because : 9. dxe6 e.p. )",
        "9. dxc6 Nxc6 10. Bh6": "My next move will be a mistake, but I want to prevent ... Bg7",
        "10... Kf7 11. Ng5+": "Aie! I didn't see that coming. But It's part of Leningrad weakness for black (Ng5). I've learn from this mistake. The fact that my Bishop isn't there anymore and that the white Bishop is occupying h6, I couldn't do h6 as defencive move.\nNow, he's giving in real pressure on my King side.",
        "11... Kg8 12. g4 e6 13. gxf5 gxf5": "The pawn I chose for the exchange here is crucial for future defense against his Queen diagonal. I need to keep my pawn on the e column.",
        "14. Nge4": "This puts more pressure on his Queen diagonal. As you can see, if he can clear the diagonal, it's mate with Qg7.",
        "14... fxe4 15. Nxe4 e5": "Now you can see the importance of having my pawn to protect the diagonal.",
        "16. Bg5 Qa5+": "Finally, I feel the pressure going down a little and I got out of having my Knight pinned in front of my Queen by putting him in check.",
        "17. Nc3 Kf7 18. O-O Rg8": "His King is in a fragile position with his pawn on g missing.",
        "19. h4 Bf5 20. f4": "More pressure! With this move, he forces me to weaken my defense of the diagonal and he adds a pressure coming from his Rook.",
        "20... e4": "I couldn't let him have the clear way for his Rook on the f column. But by advancing my pawn, he regains access to the diagonal with his Queen.",
        "21. Bxf6": "Nice move! He gains my Knight because I can't take his Bishop back. If I do... :\n21. ... Kxf6  22. Nxe4+  (double check). Wherever I place my King, he comes in with his Queen at Qf6+ which puts me in a very uncomfortable position.",
        "21... Rg6": "This is an attempt to regain control over the g7 and f6 square to prevent an attack from his Queen.",
        "22. Bg5 h6": "So, would you say his Bishop is trapped? Let's see...",
        "23. Nxe4": "If I take his Bishop, he can finally open the f column fxg5 and that would pin my Bishop against my King. I would also loose access to the g column for my Rook. And his pawn structure is solidified.",
        "23... Bxe4 24. Bxe4 Re6 25. f5 Re5": "I can't take his bishop right now because of Qf6+. From there, he can force a threefold draw.",
        "26. Bxh6 Rg8+ 27. Bg5": "Now that I'm occupying the g column with my Rook, I can take the Bishop.",
        "27... Rxe4 28. Qf6+ Ke8": "As you can see, he can't really push his attack further now that I've placed my pieces at the right place.",
        "29. Kh1": "I can see he tried to remove the pin on his Bishop. But this Finally gives me an opportunity to attack.",
        "29... Rxh4+": "Rook sacrifice! (That move opens up the diagonal on his King) If he takes it, I've got a mate sequence. If he doesn't take it, he is sure to have some material loss.",
        "30. Bxh4": "He decides to take it. Mate in 5",
        "30... Qd5+ 31. Rf3 Qd1+ 32. Kh2 Qg1+ 33. Kh3 Qg2#": "It's been a real challenge to play karatekid. I had to be very vigilant to avoid his traps.  This game was really exiting!!!"
    },
    "url": "https://gameknot.com/annotation.pl/trachesss-leningrad-dutch?gm=54074",
    "gameName": "trachess's Leningrad Dutch",
    "players": "karatekid (1514) vs. slygal (1645)",
    "opening": "Dutch defence (A81)"
}