{
    "moves": {
        "1. e4": "1.e4, one of the most popular openings. ",
        "1... c5": "1...c5. The Sicilian. I am not secure in the Sicilian, but I decided to play along with what I knew and throw some curves.",
        "2. Nf3 d6": "2...d6. Standard book, I believe. Is this a Closed Sicilian?",
        "3. d4": "I try to open. This is actually a gambit, as you will soon see. I will sacrifice this pawn for a development and doubled d-pawns.",
        "3... cxd4 4. Bc4 Nc6": "Protecting and developing.",
        "5. c3": "Attacking. Building pressure.",
        "5... e5": "Now Black has three pawns and a minor in the center versus my one pawn and two minors. Black is cramped and underdeveloped. White can castle and continue developing. Perhaps get the Dark Squared Bishop to a3, where it can peek into Black's base.",
        "6. O-O Nf6": "Attacking the vulnerable e4 pawn. Nbd2 solves this problem, and develops. It can be argued that it would be a bad move, since it blocks in the Dark Bishop, and that may very well be why I played Ng5, but if White wants to put the Bishop on a3, then Nbd2 is best.",
        "7. Ng5": "7.Ng5. Defends the e4-pawn, and puts more pressure on the f7 pawn, getting ready to fork on f7.",
        "7... d5": "7....d5! This move undoubles Black's pawns, opens the center, attacks the Bishop and the e4-pawn, and opens the a3-f8 diagonal for Black's Dark Bishop. ",
        "8. exd5 Nxd5 9. Bxd5": "9.Bxd5!?. I think that here, the continuation 9.Qf3 f6 10.Qxd5 Qxd5 11.Bxd5 fxg5 12.Bxc6+ bxc6 13.cxd4 exd4 14.Re1+ Be7 15. Bxg5 leaves White ahead, even though material is even. \n",
        "9... Qxd5": "When the dust settles, White is down by one, and Black dominates the center. White's only pro in this situation is that he is castled.",
        "10. Re1": "Hitting/pinning the e5-pawn and putting indirect pressure on the King.",
        "10... h6": "Booting the Knight to preferable f3, where he can add pressure to the center.",
        "11. Nf3 Bg4": "Pinning and developing. Black can now castle. White needs to force Black's hand to keep his King in the middle.",
        "12. Nbd2": "12.Nbd3? This should have been done five moves ago. This move is too passive. Even h3 is more useful, stopping Black from castling.",
        "12... Be7": "Black is fully developed, almost, and White still has a minor and his Queen on the back rank.",
        "13. h3 Bh5": "13....Bh5. Better than the other options.",
        "14. Qb3": "14.Qb3! While it may not be always wise to trade when down, this move removes a defender from the middle. Black's busy Queen is more useful than White's back rank squatter. ",
        "14... Qd7": "And the final needed defender is removed. e5 will fall.",
        "15. Nxe5 Nxe5 16. Rxe5": "Now White has a ironfisted grip on the center, with a Rook in the center, and the Knight ready to move to e4. But White isn't dead quite yet. Not until he overlooks Rxh5.",
        "16... d3 17. Rxh5 O-O": "17....O-O. Nope. Too little, too late. The Queen and d3-pawn can be forked, and Black has castled into a trap.",
        "18. Rd5": "Forking the Queen and pawn.",
        "18... Qc7": "Eyeing h2, it appears.",
        "19. Rxd3 a5": "19....a5?? This is pathetic! What does it accomplish? ",
        "20. Nf1": "20.Nf1. This move proves to be White's saving grace on move 24.",
        "20... Rab8 21. Rd4 b5": "21....b5. More waste.",
        "22. Rg4": "The King is feeling the heat now.",
        "22... a4": "22.a4. Yes, let's push the Queen from her harmless post to somewhere where she can hurt us. ",
        "23. Qd5 Rbd8": "If not for 20.Nf1, the White Queen would be lost, for Rd1 would be mate.",
        "24. Qh5": "Three pieces --Rook, Queen, and Dark Bishop -- bear down on Black's King.",
        "24... Rd1 25. Qxh6": "This is better than taking with the Bishop.",
        "25... Bf6": "Predicted, and 26.Bg5 stops it.",
        "26. Bg5 Bxg5 27. Rxg5": "Mate in one, if Black doesn't watch it.",
        "27... Rxf1+": "Desperate.",
        "28. Kxf1 g6": "28....g6 stops mate.",
        "29. h4": "29.h4. Working his way to h5.",
        "29... Re8": "29....Re8? This doesn't accomplish much, except for delaying the inevitable.",
        "30. h5": "30.h5. Finally, he reaches h5. Now Black's King's safe haven is no longer safe.",
        "30... Re6": "30....Re6 stares down my Queen.",
        "31. hxg6": "31.hxg6. This open up more attacks.",
        "31... f6": "31....f6?? Why? Surely even fxg is better.",
        "32. Rh5 Qg7": "32....Qg7 doesn't help much. Only takes out White Queen, and traps the King in the corner.",
        "33. Qh7+": "32.Qh7+! This trades off Queens and puts Black's King in a tough spot.",
        "33... Qxh7 34. gxh7+": "34.gxh7+ is better that Rxh7. Now the King must move to h8, or White will Promote.",
        "34... Kh8": "34....Kh8 is the only viable option. It will now be stuck there until the Rook can come to aid.",
        "35. Re1": "35.Re1!! is the final nail in the coffin. Black cannot play the desired 35....Re7, because 36.Rxe7. If 35....Rxe1, then 36.Kxe1, and White can calmly eat all of Black's remaining pawns, then promote. \n\nMy opponent resigned here. Thank you for reading. Please leave any and all critical comments, since this is a training annotation. "
    },
    "url": "https://gameknot.com/annotation.pl/training-game-2?gm=44913",
    "gameName": "Training Game #2",
    "players": "theancientbeast (1398) vs. nikosbo (1300)",
    "opening": "Sicilian, Chekhover variation (B53)"
}