{
    "moves": {
        "1. e4": "This game is a training match with a teammate.  By no means am I perfect and I still miss plenty, so please feel free to add your own commentary so we can all learn together.",
        "1... e5 2. Nf3 Nf6": "As Black I prefer the Petrov defense (mostly because I dislike playing in Ruy Lopez), and there are several variations: Nxe5 - French attack, Nc3 - Three Knight game, and d4 - modern attack",
        "3. d3": "This move (Petrov's defense) shores up the e4 pawn, and opens an egress route for the DSB.",
        "3... d5": "Another option is to develop a knight at c6, but I prefer aggressive moves in training games.",
        "4. Nxe5": "going in early for the pawn grab... In this circumstance I prefer exd5 more as White, because Black must retake with the queen, allowing White Nc3 with tempo.  Other options worthy of consideration are Bg5 and Nbd2.  I don't like this play as much because it opens up White to an unfavorable queen trade to retain pawn parity.",
        "4... Bd6": "I played this move to see how White would respond.  I looked at dxe4 instead, but liked the tactical challenges this posed for White more.  This move gives White more challenges and I think allows Black a good chance at a free pawn or forcing a queen trade with White giving up the castle.  I anticipated d4, Nc3, or maybe even f4 in response.",
        "5. Bg5": "Unforced errors make it harder to win games.  This move coughs up the knight at e5 for free.  I think d4 is the top play.",
        "5... Bxe5 6. Bxf6": "When you are down you should trade pawns, not pieces.  A more interesting play would have been d4 or perhaps exd5.",
        "6... Qxf6": "No reason not to bring the queen out instead of taking with the bishop.  Whenever you have the chance to retake and develop a piece at the same time, you should almost always take it, provided there aren't any defensive considerations.",
        "7. c3": "To protect against Bxb2, winning a pawn and a rook.",
        "7... d4": "with an eye towards cxd4, Bxd4",
        "8. c4": "A wise counterplay, preventing my bishop from getting a dangerous post middle of the board.",
        "8... O-O": "Instead of castling I could have continued development of my power pieces...",
        "9. b3": "Far more important to get the king to safety.  Be2 or g3 are far better moves.",
        "9... c5": "Giving support to the d pawn and giving a space for the knight to come out to c6.",
        "10. Be2": "Good, going for king safety and hoping to connect the rooks.",
        "10... Qd6": "This move is the beginning of an assault of White's Kingside.  My bishops, queen, and rook will soon come into play.",
        "11. g3": "To prevent Bxh2.",
        "11... f5": "Another move I considered was Bh3, to prevent a castle, but saw that Bg4 would be a strong counterplay.  This move attacks his center pawns and lets my rook get into the game.  White's position is beginning to look precarious.",
        "12. f3": "I was expecting Bf3, f4, or Nb2.  This move gives up a bit of the defensive structure of White's pawns, and will allow for some nice attacks by Black.  Losing that knight early was costly.  I think Nb2 was the better play.",
        "12... fxe4": "Now Black has a lot of firepower trained on the kingside's pawns.",
        "13. f4": "This move was a little unexpected, because while fxe4 and dxe4 each have their problems, it still allows White to castle and link up rooks.  This move now offers exchange options for Black to blow open some holes in White's position and still keep a lot of pawns downrange for later advancement and positional restriction against White.",
        "13... Bxf4": "Willing to exchange a bishop to rip apart White's defenses.",
        "14. gxf4 Qxf4": "threatening e3 and Qf2+ for serious mating threats.",
        "15. Rf1": "The best response",
        "15... Qh4+ 16. Kd2": "since Rf2?? leads to mate.",
        "16... e3+": "Now White's king is inside of a little prison.",
        "17. Kc2": "This move was better than Kc1, as it will allow Na3 and rook/queen/rook connections.",
        "17... Rf2": "I looked at a lot of different options, but liked this one best, since it placed a pin on White's bishop.  I fully anticipated Rxf2 in response.",
        "18. Qe1": "Na3 would have been better if you don't want to trade rooks here.",
        "18... Qxh2": "Forcing the rook trade",
        "19. Nc3": "White has no choice worth considering but Rxf2.  This move only coughs up more material and is a mistake.",
        "19... dxc3 20. Rd1": "Rxf2 is still the better choice.  Second best is Kxc3.  This move is a blunder.",
        "20... Rxe2+": "Trading a queen and bishop for a rook...",
        "21. Qxe2": "Notice if White instead moves the king instead of retaking with the queen, it would lead to forced mate.",
        "21... Qxe2+": "Forcing Kxc3",
        "22. Kc1": "Blunder mate(1)",
        "22... Qb2#": "Unforced early errors caused some complications.  It is very important to get your king to safety early with a castle, and link your rooks.  Some lost opportunities for development and faster castling would have significantly changed the Black assault on the king.  Allowing Black to build a second assault on the king proved White's ultimate downfall.  Thanks for reviewing and your comments."
    },
    "url": "https://gameknot.com/annotation.pl/training-match-petrovs-defence?gm=59952",
    "gameName": "Training match - Petrov's defence",
    "players": "rave83 (1168) vs. evilgm (1899)",
    "opening": "Petrov's defence (C42)"
}