{
    "moves": {
        "1. e4": "This game is a training match to help my teammate get better.  If anyone has any comments or suggestions please feel free to add so we can all learn together.",
        "1... e5 2. Nf3 Nf6": "As Black I prefer Petrov to Ruy Lopez and it is one of the main lines I play.",
        "3. Nc3 Nc6 4. d4": "Straight to the heart of things, a good center play by White, and all standard fare.",
        "4... exd4 5. Nxd4 Bb4": "Adding pressure to the c knight in a pin against the king.",
        "6. a3": "I think that White is better if they take my knight on c6, causing me to double up some pawns, as this play allows me to double and isolate his c pawns completely, which could cause some trouble later on.",
        "6... Bxc3+ 7. bxc3": "Now White has a tougher defensive posture on his queenside.",
        "7... Nxe4": "Because now the defender is removed...",
        "8. Qf3": "Threatening my knight, protecting the c3 pawn, and developing some threats against my kingside.  I probably still would have taken the knight on c6 instead.",
        "8... O-O": "Note that if 9. Qxe4? Black responds with 9 ... Re8 and wins a queen for a rook.",
        "9. Bd3 Nxc3": "I considered d5 to see if White would let me post my knight up the board, but opted for this play to trade my knight for a bishop.  Long term I think d5 was a better play, but I don't think I lose much by doing this trade.  If possible I'd rather not have an open board and face off against two bishops.",
        "10. Bxh7+ Kxh7 11. Qxc3 Nxd4 12. Qxd4 Re8+": "Getting my rook to an open file...",
        "13. Be3": "My last was not quite a tempo, since it also helped White develop.",
        "13... d5": "Freeing up a path for my LSB and seeking to capitalize on my center pawn advantage.",
        "14. O-O": "White finishes his development.",
        "14... Bf5": "Finishing my development and threatening the c pawn.",
        "15. Rab1": "I like the initiative.  White's c pawn is isolated and alone, and if Black is willing to trade a good b pawn for a bad c pawn, then it's to White's advantage.",
        "15... b6": "Removing the rook threat and preparing to advance my own c pawn.",
        "16. Qc3": "Seeking to protect the c pawn.  It is sometimes difficult to see the best moves in open boards like this one.  If he leaves his Queen where it is, c5 is an obvious follow up and grants a tempo move.  I might have considered Qd2 or possibly even Qa4 instead, however.",
        "16... c5": "Effectively granting a tempo move, as d4 wins without bishop or queen movement.",
        "17. Bf4 d4": "Now White is in a bit of trouble.  I have significantly moved my pawns down the board with little resistance.",
        "18. Qg3": "I think Qc4 is a stronger play here.  It still protects the c pawn, threatens my f pawn, and effectively halts my pawn progression.  White gives up the c2 pawn with this move.",
        "18... Bxc2": "As it is no longer protected, time to strike while the iron is hot.  Now Black has three connected passed pawns.  If White cannot disrupt that pawn chain, any one of those pawns will get traded for a piece down the road.",
        "19. Rbe1 c4": "This play is a mistake on my part.  I didn't analyze the board well enough.  Instead I should have moved my queen to either d7 of d5, to connect my rooks and give me more center power projection.  I allowed White to do a power play against my King with \n20.\tRxe8\tQxe8\n21.\tBe5\tf6\n22.\tBxd4\n\nAs soon as I clicked send I saw my mistake.  :(",
        "20. Re5": "This move was unexpected by White.  I am assuming it was designed to build pressure against my King by a follow-on Rh8.",
        "20... Rxe5": "In retrospect I should have played f6 instead.  This all started because of my mistake on 19 ... c4",
        "21. Bxe5": "Threatening Qxg7#",
        "21... Bg6": "Seeking to get my bishop actively back in the defense, and seeing if there are any chances to keep my center pawns.",
        "22. f4": "A great follow on move.  I even told White in game this was a great play.  Here White seeks to dislodge my LSB.  I spent a lot of time pondering f6 vs. f7.  Ultimately I liked the options provided by f6 better.",
        "22... f6 23. f5": "The expected response of White.  Note that if I play 23 ... fxe5??, I am a sitting duck and will be in a lot of trouble after fxg6+.",
        "23... Bf7": "The only response worth considering",
        "24. Qh4+ Kg8 25. Bxd4": "Now I finally lose the center pawn I threw away in 19 ... c4.  While I am still ahead and in effect winning the game, the prospects are not as bright as when I had the three passed pawns.  That pawn at f5 is going to be trouble for me if I don't have sharp play.",
        "25... Qd5": "Seeking to finally get my queen centralized and get my rook into the action.",
        "26. Rf3": "Now White is materializing some potential threats with Rh3.  White should also have seriously considered Bc3, to get his bishop out of immediate queen threat, and have the potential to control the f8 square with Bb4.",
        "26... Re8": "Getting my rook into the game and moving to the open e file.",
        "27. Rg3": "This move was a mistake in my opinion.  I am assuming that the idea was Qxf6 and a pinned King.  Other moves worth considering are Qf2 or Bc3.",
        "27... Qxf5": "I seriously considered Re4 and should have played it instead as it ensured more material gain.  What I was looking at as a response was \n27.\tRg3\tRe4\n28.\tRxg7+\tKxg7\n29.\tQxf6+\n\nI think I would have been fine after a more detailed review, but I opted to play Qxf5 to remove the f pawn threat and give me a little more breathing room.",
        "28. Rh3": "Blunder Mate 7.  I expected White to play Rf3, which would have seen me play Qb1+ in response to start working my pawn down the board.",
        "28... Qb1+ 29. Kf2 Qe1+ 30. Kf3 Qe2+": "Bd5+ is two moves faster, but once I had worked out a guaranteed mate, I went with it.",
        "31. Kg3 Qd3+ 32. Kg4 Re4+ 33. Kf5 Re5+ 34. Kf4 Qxd4+ 35. Kf3 Qe3+ 36. Kg4 f5#": "Black showed some good thinking in game and was able to leverage pins and set up some strong threats.  I think he is doing well overall and should continue to rise in the chess ranks.  Thank you for your comments and good luck in your chess endeavors."
    },
    "url": "https://gameknot.com/annotation.pl/training-match-petrov-three-knights-game?gm=59865",
    "gameName": "Training match, Petrov three knights game",
    "players": "kvikas (1486) vs. evilgm (1899)",
    "opening": "Petrov three knights game (C42)"
}