{
    "moves": {
        "1. e4 e5 2. Nf3 Nf6": "Petrov's defence",
        "3. Nc3": "Petrov three knights game",
        "3... Nc6": "Very passive. Maybe Bb4 is more accurate.",
        "4. Bb5 d6 5. O-O Be7 6. d4 O-O": "Preferable would be exd4.\nThis move is wrong, since it loses a pawn.",
        "7. Bxc6 bxc6 8. dxe5": "Wins a pawn.",
        "8... Ne8": "An attempt to maintain connected pawns? \nThis move is very passive. Now black has all his pieces in the 7th and 8th rows.\nAlso note, that this piece has now moved twice.",
        "9. Bf4 Ba6": "The bishop blocks pawn a7, which doe not look important now. But what is the future of this bishop here? Although we cannot be sure at this time, it looks like Ba6 is probably lost time.",
        "10. Re1": "The attack on the rook was meaningless, since this was the natural move for the rook.",
        "10... Qb8": "This move does not feel right, although I cannot give a direct reason.\nIt seems like it cannot be bad: defense on d6 is maintained. \nThe attack on b2 requires some sort of response from white, which will lose him time.\nBut the queen is still in a very restricted position here and locks in the rook in a8.",
        "11. Re3": "Defends the knight at c3 and allows 11. ... Qxb2 which would be followed by 12. Rb1 Qa3 13. Nd5! followed by Nxd7+ or Rxa3.",
        "11... dxe5": "This exchange leaves black with an isolated double pawn, without compensation.\nThere was no direct danger, so it would have been better to find a different move, so that the three pawns stay together. This is difficult, I admit. One option would have been g6, perhaps, with the intention of placing the knight at e6 via g7. ",
        "12. Bxe5 c5": "This move opens up d5 to the white pieces. Also the bishop at e7 is now blocked toward the queen side.\nAnd: this is the second time a piece is moved twice, while the development has not been completed.",
        "13. h3": "White wants to play his knight to g4.\nQxb2 is still out of bounds, since the bishop at e7 is still unprotected.",
        "13... Bb7": "The third time a piece is moved twice in the opening stages.",
        "14. Nh2": "Note, that white has almost completed his development, only the rook is not developed. \nWhite is advancing his pieces in such a way, that the cannot be exchanged.",
        "14... Nd6": "This move opens up the 8th row and redevelops the knight.",
        "15. Qg4": "To provoke a weakening of the kings pawn structure.",
        "15... g6 16. b3": "To limit blacks options.",
        "16... c4 17. Rd1": "A simple development move. Develops whites last piece and pressures the d-line.",
        "17... Bc8": "The third move of this bishop.",
        "18. Qe2 Ba6": "The fourth move of this bishop.",
        "19. Nd5": "This move is possible, because of the undefended position of both bishops.",
        "19... Re8 20. Nxe7+": "Eliminites the defender of the plack fields on blacks kingside.",
        "20... Rxe7 21. Bxd6 cxd6 22. Qd2": "Introducing safety on the white position: cxb3 followed by Qxa6 b2 is taken out of the possible options.\nAlso prssures d6 and prevents c4-c3. ",
        "22... Rd7 23. Ng4": "Completing the plan that was made for this bishop on move 13.",
        "23... Rd8 24. Nf6+ Kg7 25. Nd5": "This piece now occupies a great position in the centre and blocks the d-pawn.\nNot Qd4, since then answer Qb6 would be good.",
        "25... cxb3 26. Qd4+": "The rest is almost forced.",
        "26... Kh6": "Or Kg8 27. Nf6+ Kf8 28. Nh7+ and the black king might find it's way to the queen side, but will find no safety there.",
        "27. cxb3": "To prevent the pawn from becoming a nuisance.",
        "27... Bb7": "Another move from this bishop...",
        "28. Nf6 Qc7": "Black comes too late.",
        "29. Ng4+ Kh5": "Or Kg5 30. Qg7 followed by h5 31. Qf6 or Kf4 31. Qf6 mate.",
        "30. Qg7 Kg5 31. Qh6#": "Look at the position: the black king is completely isolated. \nMost of black's pieces are developed now, but in a passive position.\nThe rook on a8 is still in it's original square and plays no role in the position."
    },
    "url": "https://gameknot.com/annotation.pl/training-game?gm=36507",
    "gameName": "Training game",
    "players": "ababila (1750) vs. pkkicker60 (1148)",
    "opening": "Petrov three knights game (C42)"
}