{
    "moves": {
        "1. d4": "This was a training game. Graeme divides his time between Malpas, Cheshire and Spain. When he is here he plays bottom board for my team in Division 4 of the Wirral Chess League http://www.wirralchessleague.uk/results.php?club=Malpas_Oswestry&team=2\nOliver is a young 18 year old student who has just joined my club, and I wanted to see how he would fare against a regular member of the side.",
        "1... Nc6": "This is a slightly unusual reply, it seems to encourage white to advance the centre pawns and then to undermine them.",
        "2. Nf3": "I personally would accept the challenge and play 2. d4-d5, but i see that in actual fact in the World opening database on Gameknot that 2. Nf3 is the most common reply and it is on the Shredder opening database, although on the Gameknot opening database 2. d4-d5 is more commonly played. ",
        "2... d5": "With this move we transpose back into more commonly seen positions.",
        "3. Bf4": "White simply develops. Instead 3. c2-c4 would transpose back to the Queen's Gambit, and a variation of the Chigorin Defence. https://en.wikipedia.org/wiki/Chigorin_Defense",
        "3... Bg4": "Black also puts his faith in sensible development.",
        "4. Nbd2": "White prevents his pawns from being doubled.",
        "4... Bxf3": "Black takes anyway. This is unusual, and I think it inferior to just continuing development with say, 4......e6, and leaving this capture to if and when white asks the question of the bishop with h2-h3.",
        "5. Nxf3": "White correctly takes back with the knight, avoiding doubled pawns.",
        "5... e6": "Sensible development by black.",
        "6. e3": "...and indeed by white.",
        "6... Bd6": "Although 6....Bd6 is the move favoured by the chess computer program Fritz, this move takes us out of all the opening databases that I have access to, in those 6...Nf6 or 6...Bb4+ were played. I don't like 6...Bb4+ it just seems to aid white's development with c2-c3, a move white may well want to play anyway. In that game black lost quickly - 7.\tc3\tBa5\n8.\tQa4\tBb6\n9.\tBb5\tQd7\n10.\tNe5\tQc8\n11.\tNxc6\ta6\n12.\tQb4\tbxc6\n13.\tBxc6+\tKd8\n14.\tQf8#\t",
        "7. Ne5": "White avoids exchanges - at least for the moment.",
        "7... Qf6": "Black has an unfortunate habit of moving his queen out too early, and this is another example. Fritz prefers 7....Ng-e7",
        "8. Bb5": "White continues with sensible development, threatening to take twice on c6.",
        "8... Nge7": "Black wisely protects c6 again.",
        "9. O-O": "White wisely castles.",
        "9... O-O": "But this is a massive mistake. Played quickly black unwisely copies white. What was a sensible developing move for white is not for black. Black misses 10. Ne5-d7! winning the exchange.I am sure that if black had played a bit slower he would have seen it - he found it afterward when I stopped them at this position and asked them to look for the best move for white here. Fritz like 9...a6 in this position, with equality.",
        "10. Qg4": "But white misses the opportunity!",
        "10... Ng6": "And black again misses the threat.",
        "11. Nxc6": "And white again misses the opportunity. ",
        "11... bxc6": "Black again does the first move that comes to mind. Fritz prefers 11...Bxf4",
        "12. Bxc6": "White takes again.",
        "12... Bxf4": "Fritz prefers 12....Nxf4",
        "13. exf4": "White takes back.",
        "13... Rab8": "Black is now a pawn down, but is attacking pawns on b2, d4 and f4 and it is impossible to defend them all. Fritz agrees that 13.....Rb8 is the best move for black here.",
        "14. b3": "White decides to keep the b pawn.",
        "14... Qxf4": "Far better is play Qxd4, keeping the threat to the pawn on f4 and also threatening Qc5 or Qc3 forking the bishop on c6 and the pawn on c3 and so winning a pawn.",
        "15. Qxf4": "White takes.",
        "15... Nxf4": "Black takes back.",
        "16. g3": "Another mistake - white misses the threat.",
        "16... Ng6": "And now it is black's turn to miss an opportunity - instead 16...Ne2+ forks king and pawn on d4, winning a pawn.",
        "17. Rae1": "White mobilises his a rook.",
        "17... Ne7": "Fritz agrees that this is the best move for black in this position.",
        "18. Ba4": "And clearly the best move for white too. Players have conspired to reach a level ending.",
        "18... Nf5": "Black attacks the d pawn.",
        "19. Red1": "Better is 19. c2-c3 and leaving the rook free for other things.",
        "19... Rfc8": "Black comes up with a good plan - c7-c5 and prepares this move. Fritz agrees that Rfc8 is the best move. It can't be stopped with 20. Bc6 because of 20...Rb6, but I was slightly expecting 20. Bd7 Rd8 21. Ba4 Rdc8 22. Bd7 with a draw. The position is still level. Instead white goes to pieces over the next few moves. ",
        "20. Rfe1": "White moves the rook for a better square.",
        "20... c5": "Black continues with his plan. Fritz agrees that this is the best move, and gives a small advantage to black.",
        "21. c3": "This is another mistake. 21. dxc5 was the best move.",
        "21... cxd4": "Black again correctly takes.",
        "22. cxd4": "White takes back.",
        "22... Rc2": "Black moves his Rc8 to an attacking position.",
        "23. Rda1": "White protects the a pawn, but unprotects the d pawn.",
        "23... Nxd4": "So black takes ",
        "24. b4": "Uncovering an attack on the rook on c2.",
        "24... Nf3+": "White is losing material and resigns. Many thanks for reading, please leave a comment or two and use the star system to rate the annotation. Until next time dear reader!"
    },
    "url": "https://gameknot.com/annotation.pl/training-game?gm=65378",
    "gameName": "Training game",
    "players": "Graeme Campbell (ECF26) vs. Oliver Haugh ",
    "opening": "Queen's pawn (A40), Lundin (Kevitz-Mikenas) defence"
}