{
    "moves": {
        "1. Nf3": "Hi everyone!\n\nHere is a match where I am playing a Class B player.  In the middlegame both players castle on opposite sides.  Black tries to create a rook line up on my kingside position whereas I somehow manage to win material which ought to be decisive by a few line openers on the queenside.  However, in the endgame, despite being 5 material points up, Henry ends up in a mating net.  But is there to be a Houdini Act?  Read on, Inquest Jury, I say, read on!",
        "1... b6": "1. ….. b6 - unusual response to the Reti.",
        "2. g3 Bb7 3. Bg2": "3. Bg2 - aha!  A bishop v bishop stare down along the h1-a8 diagonal!",
        "3... d6 4. O-O": "4. 0-0 - Got Henry castled early, on second thoughts, is it TOO early?!  We shall see.",
        "4... Nc6 5. d3 e6 6. c4": "6. c4 - after a series of third rank pawn placements I finally decide to put one of them on the fourth rank, the c column.  This paves the way for Sir Lollabout to emerge on c3 without impeding a pawn.",
        "6... Nf6 7. Nc3": "7. Nc3 - all four knights are developed.",
        "7... h6 8. e4 g5": "8. …...g5 - allo, allo, allo - the start of a pawn storm?",
        "9. Be3": "9. Be3 - time to get as many pieces out as possible to deal with such a threat.",
        "9... Be7 10. a3 a6 11. Qc2": "11. Qc2 - if King Qr19kaash goes queenside, Glenda is waiting to welcome him via the c file!",
        "11... Qd7 12. Rad1": "12. Rad1 - now my rook stares down the BQ on the d file!",
        "12... O-O-O 13. d4": "13. d4 - that little seed of an attack again starts to germinate in my head, when that happens I bet you are glad to be reading this game rather than be my opponent.  This idea is to try and storm the queenside castled position by opening lines.  This will distract black from getting any further with his kingside attack.  I think I am finally learning a bitter lesson from my loss against The Dentist many years ago when I failed to find any similar counterplay when we both castled on opposite sides and succumbed to passivitis and a 3 pawn loss in the endgame.  I The Black Queen will not make that mistake again!",
        "13... g4 14. Nd2 Rdg8 15. c5": "15. c5! - let the line opening begin!",
        "15... h5 16. cxb6 cxb6 17. Na4": "17. Na4 - hitting at b6.",
        "17... Bd8 18. d5 e5": "18. …… e5? - loses a piece for a pawn.",
        "19. dxc6 Qxc6 20. Qxc6+ Bxc6 21. Nxb6+ Kb7 22. Ndc4 h4": "22. …… h4 - black carries on with his pawn storm but I grab more material with check and keep black very busy with threats.",
        "23. Nxd6+ Kc7 24. Nxf7": "24. Nxf7 - more black wood disappears from the board.",
        "24... Rh7 25. Nxd8 Rxd8 26. Rxd8 Kxd8": "26. …. Kxd8 - this plethora of exchanges takes us into an endgame.  At least with one pair of rooks and the queens off the board, black's mating attack has been reduced to nil, or so I thought!",
        "27. Rd1+ Kc7 28. Nd5+ Nxd5 29. exd5": "29. exd5 - another set of pieces has been exchanged and more significantly a passed pawn appears on the d column.",
        "29... Ba4 30. Rd2 h3 31. Be4": "31. Be4 - attacking black's remaining rook, but it will prove to be very annoying.",
        "31... Rf7 32. b4 Rf8 33. Bc5": "33. Bc5 - preparing a pawn advance.",
        "33... Rf6 34. Bc2 Bb5": "34. ….. Bc5 - uh, uh, at the moment, Henry is boxed in.  It only needs one piece to checkmate him but will he find it?  We shall see!",
        "35. Bb3 Rf3 36. d6+": "36. d6+ Fou Leblanc is en prise and the pawn on a3 will fall when he moves.  Thankfully I can get my d pawn one square closer to Glendadom with check before I have to deal with the skewer.  Being 5 points ahead on material, the loss of a pawn isn't that bad in itself, the bigger concern is that rascally rook using a3 to get to a1 to deliver mate!",
        "36... Kd7 37. Bc2 Rxa3 38. Bf5+": "38. Bf5+ - black does take that pawn and Henry really is in Old Matey's shadow.  Before I play my rook back to defend my back row I prepare another pawn advance with check.",
        "38... Kc6 39. Rd1 Be2 40. d7": "40. d7 - now that my pawn is soooo close to Glendadom I can afford to let my rook hang.  I now set up a few conditional moves.",
        "40... Bxd1 41. d8=Q": "48. d8/Q - Boy am I glad to see Glenda, but can she save her beleaguered spouse?",
        "41... Ra1": "41. …… Ra1 - black threatens to move his bishop to any square to deliver mate.  Looking at the bottom half of the board you would think I was about to hit the resign button wouldn't you?  But …...",
        "42. Qd7#": "42. Qd7 MATE!!!! Yup, my deadly diva Glenda gets in first with a Swallow's Tail Mate - wheew and many times over wheew!"
    },
    "url": "https://gameknot.com/annotation.pl/trapped-on-the-back-row-faced-with-discovered-henry-is-doomed?gm=66200",
    "gameName": "Trapped on the back row, faced with discovered #, Henry is ...... doomed???",
    "players": "jotheblackqueen (1885) vs. qr19kaash (1659)",
    "opening": "Reti opening (A04)"
}