{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Bc4 Nf6 4. Ng5 Bc5": "The traxler signature move, where black abandon the f pawn for an attack on White's king.",
        "5. Nxf7": "The knight capture of the f7 pawn also forks the h8 rook and the queen, winning material in the process. However, time and development are of crucial importance while the material is not. This opening is double-edged, as white has the material while black has the position.",
        "5... Bxf2+": "With this move, black drags the white king near the f file, where it would be easily attacked by Black's remaining troops.",
        "6. Kf1": "White chooses the safest option, as 6.Kxf2 is met by 6...Nxe4, with a LOT of complications ands tactics down the road.",
        "6... Qe7 7. Nxh8": "White takes my rook. I am now 5 points down in material and my dark square bishop is hanging. Is it lost for black? Absolutely not!",
        "7... d5": "I open up lines for my light-square bishop while threatening my opponent's bishop.",
        "8. Nc3": "A novelty for me (and Gameknot's database). It brings out the knight, but it gives up the bishop for not so much compensation I think.",
        "8... dxc4": "The bishop that I take...",
        "9. Nd5 Qf8": "! I place my queen on the same file as the white king, which is covered by two of my pieces. If I have the time to remove these pieces, I would have a winning attack...",
        "10. Qf3": "! However, my opponents sees this as well and blocks the f file with his queen. Is my attack fading out yet? Maybe, but I have at least recovered some material...",
        "10... Bb6": "I retreat my bishop from harm's way. It also pressures white kingside a lot, as we will see later.",
        "11. Nxf6+ Qxf6": "Knight exchange.",
        "12. d3": "White prepares to bring out his dark-square bishop. However, this allows me the following tactic;",
        "12... Qxf3+": "! I exchange the queens. Although it is not considered good to exchange queens in highly tactical openings like this, I feel that the position lost its sharpness and dulled out. After the queen excahnge, I can easily pick up the h8 knight. However...",
        "13. gxf3 Nd4": "I also have this fork!",
        "14. dxc4": "? Some pawns are good for their rich nutritious values, others are not. Unfortunately for white, my c4 pawn was not.",
        "14... Bh3+": "! I force the white king to go to a dark square, where it will be easily attacked by my knight and my dark-square bishop.",
        "15. Kf2": "Kinda forced, as 15.Kg1 is met by the humiliating 15...Nxf3# and 15.Ke1 is met by 15...Nxc2+, winning the rook.",
        "15... Nxc2+": "Discovered check.",
        "16. Kg3": "The best move. I can either take the rook or save my bishop.",
        "16... Be6": "I choose the later. White has to move his rook.",
        "17. Rb1": "White saves the rook, but none of his pieces are currently active!",
        "17... O-O-O": "I free my rook with style.",
        "18. b3": "White somewhat does the same.",
        "18... Rxh8": "I take the free knight. I am now +1 in material and I also have a better position.",
        "19. Bb2": "White brings out his bishop, coonects his rooks and attack my e pawn. Good move.",
        "19... h5": "! Although innocent looking, this powerful zwisenchug forces white to react at once...",
        "20. Bxe5": "? And this isn't the way to go. This pawn was also poison. However, consequences are really bad this time... Better was h4.",
        "20... h4+": "! The logical folow-up. Where does the king go?",
        "21. Kg2": "If 21.Kf4?? then 21...Be3#, a BEAUTIFUL mate. ",
        "21... Ne3+": "! White must go into the g1-a7 diagonal, where my dark bishop will lend a discovered check when the knight moves.",
        "22. Kg1 Bh3": "! Another zwisenchug. Any knight move leads to mate now...",
        "23. Rb2": "?? Kf2 was necessary.",
        "23... Nd1+": "23...Nc2+ is faster, but it doesn't matter much at this point. This way, my bishop will rush through every defender of the king, for the show.",
        "24. c5 Bxc5+": "The pawn goes down...",
        "25. Bd4 Bxd4+": "The bishop goes down...",
        "26. Rf2": "An interesting fact about about this position: Only white's pawn can move!",
        "26... Bxf2#": "Finally, the rook goes down, along with the king. 0-1"
    },
    "url": "https://gameknot.com/annotation.pl/traxler-with-5-nxf7-the-poisoned-pawns?gm=34904",
    "gameName": "Traxler with 5.Nxf7 - The poisoned pawns -",
    "players": "x-machine (1617) vs. a_random_guy (1714)",
    "opening": "two knights defence (C57), Wilkes Barre (Traxler) variation"
}