{
    "moves": {
        "1. e4": "This is my second game against Joanne in the Traxler mini-Tournament. Joanne made short work of me with the black pieces, so I was determined to put up a better fight in this game. ",
        "1... e5 2. Nf3 Nc6 3. Bc4 Nf6 4. Ng5 Bc5 5. Nxf7 Bxf2+": "This is the first move in the game that isn't pre-set. this move has been played in almost all of the games in the tournament, although occasionally 5...Qe7 is played. ",
        "6. Kf1": "Joanne responds with the most common reply. Statistically speaking 6.Kxf2 is bad for white, although it does makes for a real knife edge kind of game.  ",
        "6... Qe7": "Forced",
        "7. Nxh8": "White takes the material advantage that was offered. ",
        "7... d5": "The most common move by black, threatening both the bishop on c4 and opening the door for bg4, trapping the queen if white isn't careful. A less common, but quite playable move is 7...Bb6. Interesting enough the GK engine prefers Bc5. ",
        "8. exd5": "The best move. Bxd5 will cost white the queen. Although White would still be up in material, the position is all but lost. ",
        "8... Nd4": "More or less forced. ",
        "9. d6 Qxd6": "The GK database suggests that cxd6 is more successful here. I chose to capture with the queen because I thouht that capturing with the pawn would allow black to Kxf2 relatively safely. ",
        "10. Nf7": "Extracting the knight. Perhaps this is why cxd6 was the most chosen option for the previous move. ",
        "10... Qc5": "Putting pressure on White's bishop while maintaining the Bg4 threat. Also bolstering the a7-g1 diagonal (which may prove to be very important later...)",
        "11. d3": "Providing an escape square for the queen, and opening the door for White's dark squared bishop.",
        "11... Bg4": "Bringing another piece into the fray. Black has a strong attack going now. The GK engine still puts white ahead by the equivalent of a minor piece. ",
        "12. Qd2 Be2+": "This move doesn't appear in any of the databases. I dreamed this move up whilst experimenting with the analyse feature. To the best of my reckoning this traps the white queen. My thoughts were the white must either swap its queen for a bishop and a knight or take the bishop with Kxf2 and try to walk the tightrope that begins with 13...Ng4+. If white isn't careful, here is what happens after 13...Ng4:  14. Kg1 Nf3# or 14. Kg3 Nf5+, 15. Kh3 Nf2# (a very aesthetically pleasing mate!) or white's only other option: 14. Ke1 Nf3+ 15. Kxe2 Nxd2 (if 15. gxf3 then Qf2#)",
        "13. Qxe2": "Joanne chooses the less dangerous path. ",
        "13... Nxe2 14. Kxe2": "The material is now only 2 points in White's favour, and now Glenda the Defender is out of the picture. ",
        "14... b5": "Pushing the bishop back to b3. ",
        "15. Bb3 Bg1": "I missed this in the previous move. White needs to exchange here to avoid a very problematic Qf2. ",
        "16. Rxg1 Qxg1": "Material is now even and looks about to swing into blacks favour. ",
        "17. Be3 Qxg2+ 18. Ke1": "Joanne acknowledged at this point that the black queen prevents development of pieces, and resigned on the grounds of pending ruinous loss of material, giving me my highest win to date. I feel fortunate to have chalked up a win to somebody of Joanne's calibre. \r\nThanks for reading. All comments/feedback welcome. "
    },
    "url": "https://gameknot.com/annotation.pl/traxler-with-5-nxf7-prospecting?gm=36384",
    "gameName": "Traxler with 5.Nxf7 - Prospecting",
    "players": "jstevens1 (1773) vs. pawnstar2010 (1508)",
    "opening": "two knights defence (C57), Wilkes Barre (Traxler) variation"
}