{
    "moves": {
        "1. d4": "A recently finished game in my mini-tournament, which is set to automatically start each game with the Gruenfeld Defence. In this game, I go into the endgame a pawn up, and then a series of THREE TACTICS wins me a rook, and the game.",
        "1... Nf6 2. c4 g6 3. Nc3 d5": "This is the Gruenfeld Defence. Black offers White the chance to create an imposing Classical pawn centre with 4.cxd5 Nxd5 5.e4 Nxc3 6.bxc3 but can then put terrific pressure on it with ...Bg7, ...c5 and ...Nc6 - this is the very sharp Exchange Variation. If White can maintain his powerful pawn centre, however, he can expect to hold a positional advantage.",
        "4. cxd5": "White's other option is to bypass sharp lines with the slower 4.Nf3, the Three Knights Variation, or with 4.Bf4. However, I have great faith in my ability to hold onto an advantage in central space, and as usual I play the Exchange Variation.",
        "4... Bg7": "(?) Not the main Exchange Variation move. Quite apart from allowing me to shore up a powerful pawn centre, this loses a pawn!",
        "5. e4": "White has a powerful, well-defended pawn centre and is ready to start cramping Black's position. The only problem is the backward and weak d4-pawn, but the extra pawn is more than enough to conpensate.",
        "5... O-O 6. f3 b6 7. Bc4": "Not a particularly active post for my bishop, but I wanted to make way for castling on the kingside - sharpening the game up with 0-0-0 would be foolhardy considering I am already up by a pawn and lots of space control.",
        "7... Bb7": "Fianchettoing the bishop into a brick wall. 7...Ba6 is the only reasonably active square for that bishop. However, at least from b7 the bishop can support a challenge to my centre with ...c6.",
        "8. Nge2": "Aiming for an active post on f4.",
        "8... c6 9. dxc6": "I reasoned that exchanging pawns here was fine, since was still a pawn up, with a dominant centre.",
        "9... Nxc6 10. Be3": "Shoring up the pawn, just in case. Be3 is a typical move in the Classical Exchange Variation of the Gruenfeld.",
        "10... Nb4 11. Qb3 a5 12. a3": "A bold advance, but I am determined that the knight should flee.",
        "12... Nc6 13. O-O e6 14. Rad1 Ba6 15. Bxa6": "Exchanging pieces when I'm a pawn up? Yes please!",
        "15... Rxa6 16. Qb5": "And gaining a dominant queen into the bargain, forcing Black into passivity: the only move (?) that saves him losing material is 16...Nb8.",
        "16... Nb8 17. Rdc1": "Rook to open file",
        "17... Qd7": "(?!) Allowing the queens to be exchanged, decisively consolidating my advantage of a pawn.",
        "18. Qxd7 Nbxd7 19. e5 Nd5 20. Nxd5 exd5": "More piece exchanges; all avoidable by Black.",
        "21. Rc7": "Rook on the 7th rank is definitely heaven. In this case, it forces Black's pieces into passive posts; to save the knight, he must either flee with 21...Nb8 or defend with 21...Rd8, tying down his rook.",
        "21... Rd8 22. Nc3": "Attacking the d-pawn. I think I expected Black to defend, and ignore the passive knight, with 22...Nb8 or 22...Nf8. I was not expecting...",
        "22... f6": "...this move, offering me the chance to gain a passed pawn. AT THIS POINT, I saw the following neat endgame tactical combination:",
        "23. e6": "TACTIC 1: 23...Nf8 24.e7! wins the knight.",
        "23... Nb8 24. Nxd5": "24...Rxd5 25.e7 and the pawn can only be stopped with 25...Kf7 and Black wins the bishop with 26.e8=Q+! Kxe8 27.Rxg7",
        "24... Rxd5 25. e7 Kf7 26. e8=Q+ Kxe8 27. Rxg7": "As we see.",
        "27... Rd7": "Just worsens Black's situation, losing another piece to another tactic:",
        "28. Rg8+": "TACTIC 2: A skewer",
        "28... Kf7 29. Rxb8 Re7 30. Re1 Kg7": "(?) Another tactic - discovered attack this time - forces a rook exchange.",
        "31. Bh6+": "TACTIC 3: Discovered attack.",
        "31... Kxh6 32. Rxe7": "Or even the win of the exchange. Now Black is thoroughly done for.",
        "32... b5 33. Rxb5 Rd6 34. Rxa5 Rxd4 35. g4 g5 36. Raa7": "Checkmate is forced.",
        "36... Rd1+ 37. Kg2 Rd2+ 38. Kg3 f5 39. Re6#": "Thanks for looking at this game: I hope you enjoyed the 3 ENDGAME TACTICS."
    },
    "url": "https://gameknot.com/annotation.pl/triple-endgame-tactics?gm=23042",
    "gameName": "Triple Endgame Tactics",
    "players": "fatcat2 (1444) vs. afghanknight (1470)",
    "opening": "Gruenfeld (D85), exchange variation"
}