{
    "moves": {
        "1. d4 Nf6 2. Bg5": "The Tromp! Al knows I have little respect for this opening, so his choosing it was done to needle me a little.",
        "2... g6": "Black signals his willingness to let White trade a perfectly useful Bishop for a Knight, for the minor inconvenience of doubled f-pawns.",
        "3. Nf3 Bg7 4. e3 d5 5. Be2 O-O 6. O-O Nbd7 7. Nbd2 c6 8. h3 h6 9. Bf4 Re8 10. c3 Nh5 11. Bh2 e5 12. dxe5 Nxe5 13. Nxe5 Bxe5 14. Bxh5 Bxh2+ 15. Kxh2 Qc7+ 16. g3 gxh5 17. Qxh5": "All of this was reeled off in about 3 minutes. Black is a pawn down, but White has no quickly accessible attacking lines.",
        "17... Re6 18. Nf3 Kg7": "18. ...Kh7?? 19. Ng5 is an instant winnner.",
        "19. Nd4 Re5 20. Qh4 c5 21. Nf3 Re4 22. Qh5 Be6 23. Kg2 b5": "! -- Black gains space on the Q-side. Play will be occuring on both wings in this position, so each player hurries to grab a piece of the pie.",
        "24. Rad1 Rd8 25. Nh4 Re5 26. Qf3 d4": "! -- Al misses the nasty little point behind this move.",
        "27. exd4 Bd5 28. dxe5 Bxf3+ 29. Nxf3 Rxd1": "? -- After the game Al pointed out (quite correctly) that this exchange was a mistake, quoting a hoary but still true chess axiom, \"Every exchange helps the defender.\" The right move was 29. ...Re8.",
        "30. Rxd1 Qa5 31. a3 b4 32. cxb4 cxb4 33. axb4 Qxb4 34. Rd2": "We might have called it a draw here: White's Knight and Rook are ideally placed for defense, and his King is well-shielded from checks. Neither player has a realistic chance of winning anymore. Black's only chance of prevailing lies in his a-pawn which is going nowhere as long as White's b-pawn sits safe and smug on b2; White's only chance is in advancing his K-side pawns to supplement a combined R-N-K attack ...which would leave White's King open to harrassing checks and potential missteps that might lose material.",
        "34... Qe4 35. g4 a5 36. Kg3 Qb4 37. Rc2 a4 38. Re2 Qc4 39. Rd2 Qb5": "Black is trying to finesse White into stepping off-plan. White will have none of it.",
        "40. h4 Kf8 41. g5 hxg5 42. hxg5 Kg7 43. Kg4 Qf1 44. Kf4 Qc1 45. Kg4 Qf1 46. Kf4 Qc1 47. Kg4 Qc4+ 48. Rd4 Qe6+ 49. Kg3 Qb6 50. Rd2 Qb3 51. Kg4 Qe6+ 52. Kg3 Qb3 53. Kg4 Qc4+": "Drawn by agreement. ... 1/2-1/2"
    },
    "url": "https://gameknot.com/annotation.pl/trompowski-attack-blitz-game?gm=47707",
    "gameName": "Trompowski Attack -- Blitz Game",
    "players": "alfreedom  vs. Avocet ",
    "opening": "Trompovsky attack (Ruth, Opovcensky opening) (A45)"
}