{
    "moves": {
        "1. e4": "Tras mi habitual jugada, quedaba esperar que me depararía el azar. Sí sí, !así mismo!... La versatilidad en el repertorio de mi rival era tan amplia y aleatoria que su primera jugada era todo un enigma... \n",
        "1... Nf6": "!Para nada se apoderó de mi sentimiento alguno de sorpresa! Al fin y al cabo, iba mentalizado a enfrentarme a cualquier defensa.\n",
        "2. e5 Nd5 3. d4 d6 4. c4 Nb6": "Desde hacía tiempo mi línea favorita era el ataque de los cuatro peones, pero hoy en día ya no me resulta tan atractiva. Así que...\n",
        "5. exd6 exd6": "Inocentemente pensé que Bauer capturaría con el peón de \"c\", para buscar una partida más desequilibrada. Pero realmente, tomar con peón \"e\" también tiene su veneno, a pesar de la posición tan simétrica.\nAlternative variation: [Tras] 5... cxd6 [ llegamos a una variante principal de la defensa Alekhine, donde el blanco ha llevado a cabo con suficiente éxito el plan siguiente:] 6. Nc3 g6 7. Be3 Bg7 8. Rc1 O-O 9. b3 e5 ([si] 9... Nc6 10. d5 $1) 10. dxe5 dxe5 11. Qxd8 Rxd8 12. c5 N6d7 13. Bc4 $14 [posición que parece favorable al blanco según ha demostrado la práctica.]\n",
        "6. Nc3 Be7 7. Bd3 Nc6 8. Nge2": "[%csl Ge2] El caballo es más flexible en \"e2\" para evitar la molesta clavada con Bg4.\n",
        "8... Bf6 9. Be3 O-O 10. b3": "Alternative variation: [El problema de] 10. O-O [es que permitiría] Nb4 [y no podríamos jugar] 11. Bb1 $2 [para conservar la pareja de alfiles, ya que nos podrían contestar con] Nxc4 12. Qb3 Nxe3 [ganando peón.]\n",
        "10... Re8 11. O-O Bg4": "[%csl Rd4]\n",
        "12. Qd2 Bh5": "Maniobra muy útil. Una de las reglas de oro del ajedrez dice que cuando se tiene desventaja de espacio, hay que tratar de cambiar piezas, para poder liberarse. Y eso es precisamente lo que se pretende con 12.. .Bh5 seguido de Bg6.\n",
        "13. Rae1": "Diagrama # Mentiría si dijese que esta idea la saqué en el tablero. Lo cierto es que hace tiempo vi una partida del GM Arkadij Naiditsch, que me gustó bastante por su simpleza en la ejecución del plan. La idea de poner la  torre de \"a\" en e1 tiene la virtud de mantener la otra torre en la columna \"f\", donde podría ser útil en un futuro, tras el plan h3-g4-Ng3, y un posible avance con f4.\n",
        "13... Bg6 14. h3": "[%cal Gg2g4,Ye2g3] De momento paso la pelota al rival, a la vez que contribuyo a mi futuro plan con una jugada útil.\n",
        "14... d5": "Temático avance en este tipo de posiciones.\nAlternative variation: [ La partida que inspiró mi elección de plan en el medio juego, continuó con:]  14... Ne7 [a lo que Naiditsch respondió con la idea preconcebida] 15. g4 Bh4 16. Ng3 Qd7 17. a4 Bxg3 18. fxg3 Bxd3 19. Qxd3 h5 20. a5 Nbc8 21. Ne4 Rf8 22. Ng5 g6 23. gxh5 f6 24. h6 d5 25. Bc1 Nd6 26. Ne6 Rf7 27. cxd5 Nb5 28. Nf4 g5 29. Nh5 Qxh3 30. Nxf6+ Kh8 31. Ne4 [1-0 Naiditsch,A-Polaczek,R/Vlaardingen NED 2005]\n",
        "15. c5": "Este avance es único, porque de abrirse la columna \"d\", el peón de \"d4\" sería un claro objetivo de ataque...\n",
        "15... Nc8 16. Nf4": "[%csl Rd5] !Cambiando de plan! ?Pero no quedamos en que iba a jugar g4 seguido de Ng3? Pues sí, así es... Pero si nos fijamos, tras el avance con ...d5 del negro, la posición se ha transformado. Eso quiere decir, que antes de jugar de forma mecánica, sería bueno preguntarse si hay nuevas alternativas a nuestro alcance. \n",
        "16... Nc8e7": "[%csl Gd5]\n",
        "17. g4": "Los alfiles de casillas blancas están enfrentados, por lo que se cambiarán en breve, Pero, ?debería quedarme quieto y que me capturasen en d3, o debería darme prisa y tomar en g6? Lo cierto es que la captura en g6 no me parecía logica, ya que haría más compacto el enroque negro, donde casillas como f5 quedarían muy controladas. Así que desistí de comer en g6, y continué progresando mi posición, en este caso ganando espacio a la vez que especulando con un posible avance con g5 ganando pieza.\n",
        "17... Bxd3": "Bueno, !ya no hay que preocuparse sobre los cambios de alfiles!\nAlternative variation: [Si] 17... Bxd4 18. Bxg6 Bxc3 19. Bxf7+ Kxf7 20. Qxc3 $14\nAlternative variation: [o si] 17... Nxd4 18. Bxd4 Bxd4 19. Bxg6 Bxc3 20. Bxf7+ Kxf7 21. Qxc3 $16\n",
        "18. Qxd3": "[%cal Gf4h5]\n",
        "18... g6": "Bauer decide asegurar la posición de su alfil, ya que podría haberle jugado Nh5.\n",
        "19. Reb1": "!Cambio de frente! Ahora las torres ya no resultan útiles en esa posición, así que hay que corregir su situación. Está claro que mi idea es expandirme en el flanco de dama con b4-b5 para crear debiliades.\n",
        "19... b6": "Alternative variation: [Si] 19... a5 [podría continuar con a3 y b4. Por otro lado, la casilla b5 es más débil, y quizás un plan del tipo Nfe2, Bf4 y Nb5 podría ser molesto.]\n",
        "20. b4 Qd7": "Alternative variation: [Si] 20... bxc5 21. bxc5 [y el blanco está un poco mejor, como pudimos comprobar en el análisis post-mortem.]\nAlternative variation: [Si] 20... a5 [quizás es interesante] 21. b5 (21. a3 [sería más segura]) 21... Nb4 22. Qd2 [se amenaza ganar pieza con a3] bxc5 23. Rfc1 $1 (23. a3 $6 Nc2 $1 24. Qxc2 cxd4 $15) 23... cxd4 24. Bxd4 Bxd4 25. Qxd4 c5 $1 26. Qxc5 Rc8 27. Qd4 $14 [ pero sigue requiriendo más análisis.]\n",
        "21. Rfd1": "Diagrama # Sin duda alguna esta es la jugada que más me gusto de toda la partida. En apariencia resulta un tanto insulsa e innecesaria, pero se basa en un conocidísimo concepto que ya teorizó el mismísmo Nimzowitch. En su obra \"Mi Sistema\" habló por primera vez de la sobreprotección de un punto. En concreto, puso el ejemplo de la variante del avance de la defensa francesa, y defendía la postura de que era muy útil sobreproteger el punto \"d4\" aunque ya estuviese suficientemente defendido, para así poder liberar de su defensa a otras piezas que pudieran desarrolar funciones más efectivas. Volviendo a la posición que nos acontece, esa fue precisamente mi idea. Así que, tan sólo nos quedará ver si estas reflexiones \"estratégico-filosóficas\" se adaptan a las necesidades reales de la posición, así que veamos...\n",
        "21... Bg7": "Parece normal.\n",
        "22. b5 Na5 23. c6 Qd8": "!Pasiva pero necesaria!\nAlternative variation: [Si] 23... Qd6 [he aquí la realización de mi idea preconcebida en la jugada 21.] 24. Ng2 $1 [[%cal Ge3f4,Yd3g3] La idea es jugar Bf4 y #Qg3 presionando \"c7\".] Nc4 25. Bf4 Qd8 $8 26. Qg3 Rc8 $8 27. Ne3 $1 $16 [[%csl Rd4][%cal Gd1d4] y es ahora cuando se puede comprobar la utilidad de haber sobreprotegido el péon de \"d4\" con la torre de \"d1\".]\n",
        "24. Ng2": "Igualmente llevaré mi plan a cabo.\n",
        "24... a6 25. a4 axb5 26. axb5 Nc4 27. Bf4": "Fue aquí donde tomé conciencia de que mi rival tenía una posición realmete difícil, ya que no puede generar ningún tipo de contrajuego.\n",
        "27... h5": "[%csl Rg4][%cal Gh5g4] Aquí Bauer hizo una de esas jugadas que esperan pasar desapercibidas, para posteriormente servirle de arma para darle la vuelta a la partida. Pero lo cierto es que era un farol, y la simple captura del peón le habría creado más problemas de forma innecesaria.\nAlternative variation: [Si] 27... Ra3 28. Ra1 [y la columna es del blanco, lo cual sería un hándicap más para las negras.] Nb2 29. Qc2 $1 $16\n",
        "28. Qg3": "Continua con el plan previsto, pero dada la última jugada de mi rival, mejor era:\nAlternative variation: 28. gxh5 gxh5 (28... Nf5 $2 29. Bxc7 $1 $18) 29. Qf3 [ [%csl Rd5,Rh5]] Ra3 30. Bc1 Rxc3 31. Qxc3 Nf5 $18 [y no hay compensación alguna.]\n",
        "28... Ra3 29. Rd3 Ra7 30. Ne3": "Otro concepto posicional: \"cambiar la única pieza activa del rival.\"\n",
        "30... hxg4 31. hxg4 Nxe3 32. Bxe3 Nc8": "Quizás la única chance práctica de mi rival es dar coletazos entregando peones y jugando activo.\n",
        "33. Qf3": "[%csl Rd5]\n",
        "33... Nd6 34. Qxd5 Qh4": "Y aquí se ve como su arriesgada jugada con 27...h5 (que no fue castigada) pudo comenzar a crearme serias molestias. Por suerte, su contrajuego no alcanzó a ser suficiente.\n",
        "35. Qg5": "Poniendo todo en orden.\n",
        "35... Qxg5": "Alternative variation: 35... Qh3 36. Rbd1 [[%csl Rh3] y la dama está inestable en h3.]\n",
        "36. Bxg5": "Entrando en un final en el que pensé que éste me otorgaría una ventaja decisiva por la incipiente presión en c7.\n",
        "36... Ra3 37. Rbd1": "Mi amenaza es clara, 38.Bf4, haciendo daño en el punto antes mencionado.\n",
        "37... Bxd4": "?Qué otra cosa se podría hacer?\n",
        "38. Rd3xd4 Rxc3 39. Bf6": "Ahora se amenaza Rxd6, además de g5 seguido de Rh4 con mate inevitable.\n",
        "39... Re6 40. g5": "Alternative variation: [Si] 40. Rxd6 Rxd6 41. Rxd6 Rc1+ [intermedia] 42. Kg2 cxd6 [pero parece que a pesar de ello] 43. Bd4 [debe ganar.]\n",
        "40... Ne8 41. Rd4d8": "Y el resto de las jugadas ya son consecuencia natural del trabajo hecho anteriormente.\n",
        "41... Rh3 42. Kg2 Rh4 43. Kg3 Rh5 44. Rd1d7 Rh1 45. Be7": "Y Bauer abandonó ante la inevitable pérdida de pieza.   Debido al prestigioso rival y a la partida tan lineal que se produjo, sin duda, recordaré esta partida como una de mis mejores batallas ajedrecísticas.\n"
    },
    "url": "https://gameknot.com/annotation.pl/trophee-universitaire-la-roche-sur-yon-fra?gm=41515",
    "gameName": "Trophee Universitaire, La Roche-sur-Yon FRA",
    "players": "Rodriguez Guerrero, Enrique (2464) vs. Bauer, Ch (2627)",
    "opening": "Alekhine's defence (B03), exchange variation"
}