{
    "moves": {
        "1. d4 d5 2. c4 e6 3. Nc3 Nf6 4. Bg5 Be7 5. e3 O-O 6. Nf3 Nbd7 7. Rc1 c6": "A very typical Queen's Gambit position where Black is waiting for White to move the bishop before playing ...dxc4.\n",
        "8. Qc2 h6 9. Bh4 Re8 10. a3 a6": "All these moves are common ones in that waiting game over White's LSB.\n",
        "11. c5": "White is running out of useful moves in the waiting game, but this move to end that struggle seems a little fishy. Either 11.Bd3 or 11.cxd5 would be better.\n",
        "11... e5": "A natural break in the center.\n",
        "12. Be2 exd4 13. exd4 Nf8 14. O-O Ne4 15. Bg3": "This felt pretty much forced. If 15.Bxe7 Qxe7 Black has the immediate threat of 16...Nxc3 winning a piece.\n",
        "15... Nxg3 16. fxg3": "Without the e-pawn to worry about defending, this capture away from the center made sense to open the f-file for the rook.\n",
        "16... Bf6 17. Kh1": "Black's last move appears to target the d-pawn, which can be attacked a second time with ...Ne6. Nudging the king over prevents ...Bxd4 from being a check, which could end up very useful tactically for Black. (So perhaps recapturing with the f-pawn wasn't a great idea.)\n",
        "17... Rb8": "I was expecting continued targeting of the d-pawn with 17...Bg4. I thought maybe the point of this move was to try hit at the b-pawn, although it can simply advance at the moment if the b-file were to open. Perhaps Black just wants to weaken White's queenside pawns generally.\n",
        "18. Rcd1": "First I looked at 18.Bd3 Bg4 19.Qf2 Bxf3 20.Qxf3 Bxd4 21.Qxf7+ Kh8 22.Ne2 Bxb2 23.Nf4 Re7 (23...Bxc1?? 24.Ng6+ will win for White) 24.Ng6+ Nxg6 25. Qxg6 Qg8 26.Rc2 and now both 26...Bf6 and 26...Bxa3 are good for Black. So it starts off awfully tempting to trade the d4 pawn for the f7 pawn, but Black is not obliged to do that and seems to be fine even if he plays every expected move in the variation. Then I considered 18.Rf2 to double rooks, but if White recaptures on f3 with a rook, a knight capture on d4 becomes bothersome. Then I considered 18.Qd2 to defend the d-pawn, but now ...Bg4 also opens up skewers with ...Bg5. What about 18.h3 which prevents ...Bg4 and could allow White to liquidate the doubled pawn with g3-g4-g5? It leaves the dark squares around the white king weak and White is already missing the DSB. So I ended up playing 18.Rd1, which also defends the d-pawn and is a slower way to double rooks, but it could still be done if desired. \n",
        "18... Bg4": "So Black does play ...Bg4 now and what 18.Rcd1 really means is that White has committed himself to passive defense of the d-pawn.\n",
        "19. Ng1": "Since it's now too late to meet the threats on d4 with a counterattack at f7, this knight becomes more important than the LSB. Black's only consistent reply is to give up the two bishops with 19...Bxe2, otherwise I just put the knight back on f3. 20.Ngxe2 will be forced (20.Ncxe2 Qe7), and Black has quite a few options for his 20th move, including 20...Ne6, 20...Qe7, and 20...b6. Those moves are useful at some point no matter what White's 19th move; trying to predict what he will do now, at the expense of the knight, seemed unwise.\n",
        "19... Be6": "Instead, Black prefers to keep the two bishops.\n",
        "20. Nf3": "The knight prefers to be on f3, but it's also worth a shot to offer a repeat position, even though it's unlikely to be accepted given our difference in rating.\n",
        "20... Bg4": "But there's ...Bg4 again for the second occurrence of this position. It could well be Black has no plans to draw and is using a psychological ploy, but there's no reason the same logic from White's 19th move would not apply on the 21st move.\n",
        "21. Ng1": "Still, I set 21...Bxe2 22.Ngxe2 as a conditional move to let my opponent know I wasn't expecting the draw.\n",
        "21... Bxe2 22. Ngxe2": "Which is what happened. (The conditional moves, not the draw!)\n",
        "22... Ne6": "With the d-pawn adequately defended (at least for now), White has some opportunity for active undertakings. The queen and the knight on c3 in particular could be put to better use, perhaps the queen on f5 or the knight on a4. A possible point to 23.Qf5 would be dropping it to f2 and reinforce the d-pawn and freeing the e2-knight for another action. If 23.Na4 Black could try to stop the knight from continuing to b6 with 23...Qa5 (24.Nb6 Bd8 and 25.Nd7 Rc8 26.Ne5 fails to 26...Nxd4), but 24.b4, a move that is probably going to be played at some point anyway, would change that. Even from a4, while on the rim, the knight would still freeze Black's queenside pawns. However, it weakens e4.\n",
        "23. Na4": "But the more I looked at it, the more 23...b6 seemed like a strong move worth preventing. The move Qf5 could come later. But this was the first move I reconsidered after making but before Black's reply.\n",
        "23... Qe7": "Threatening ...Nxc5 not only winning a pawn but potentially making a 7th rank invasion--threats only possible because of White's previous move. The good news is, with Black's queen now on e7, I didn't hate ...b6, so moving the knight back felt okay even though it gives up tempi. (But like I said, I began regretting 23.Na4 before Black replied.)\n",
        "24. Nac3 Qc7": "Here I became really tempted by 25.Rxf6, even getting to the point of deciding 26.Qf5 would be the best follow-up, but decided there wouldn't be enough compensation for the exchange. It would destroy his kingside pawn structure, remove an attacker of d4, and make f5 a nice-looking square for a knight. However, White's pieces are not in very good spots to take advantage of these factors. For instance, the quickest way to get a knight to f5 is to advance the g-pawn (allowing Ne2-g3-f5), but the half-open g-file gives Black counterplay against that pawn. Black also keeps his counterplay down the b-file. Trying to set up the sacrifice with 25.Qd2 was also considered but found wanting and Black could also reply 25...Bg5. White just doesn't have a strong enough position to sacrifice material.\n",
        "25. Na4": "Then I began looking at playing Na4 again. Black's last move seemed to indicate that a ...b6 break was indeed in his plans, taking his eye off e2 in the process.\n",
        "25... Re7": "I thought Black might try to double his rooks. The knight on a4 will move back to c3, but White has a move to work with before then. Is it of any use?\n",
        "26. Rxf6": "Despite all my qualms about this sacrifice, I went for it now since Black's queen has a harder time defending the kingside with a rook on e7. So I went for it instead of passively defending a hopeless position. I wasn't even sure if I would continue 27.g4 or 27.Qf5 or some other way. Hopefully the computer could tell me where I went wrong before this point, even if it was just the 11.c5 move and maybe the Na4 moves.\n",
        "26... gxf6 27. Qf5": "Chose this because after 27.g4 it's much harder for White to protect the king from back rank threats. If I can last just 10 more moves, this game is a moral victory for me.\n",
        "27... Ng7": "And already 10 moves was looking wildly optimistic. This was not a move I was expecting, although perhaps it should have been, with White's queen and knight attacked simultaneously.\n",
        "28. Qf3 Rbe8 29. Nac3": "Having the knight on a4 actually become one reason I went for the sacrifice, because being able to jump to b6 was useful in lines where Black allows White's queen to start checking and tries to escape a draw by running to the queenside. But it was already time to give up that pipe dream. If White can get to an endgame, perhaps the slightly better pawn structure gives drawing chances (yeah, right).\n",
        "29... Qd7 30. Ng1 Re7e1 31. h3 Qf5 32. a4 Qxf3 33. gxf3": "Now my pawn structure is a *LOT* better than Black's!\n",
        "33... Rxd1 34. Nxd1 Nf5": "White resigns. So I made it 7 more moves after the exchange sacrifice instead of 10. Close enough!\n"
    },
    "url": "https://gameknot.com/annotation.pl/trying-to-survive-vs-a-much-better-opponent?gm=55709",
    "gameName": "Trying to Survive vs. a Much Better Opponent",
    "players": "hscer (1746) vs. hanzelpeter (2310)",
    "opening": "QGD (D64), Orthodox defence, Rubinstein attack (with Rc1)"
}