{
    "moves": {
        "1. d4": "(game info on previous page) Yep..  Slow and true, the old wood pusher reaches out and plays what he knows.  \"e4 for show, d4 for dough\".  Not true of course, it's about opinion.  ",
        "1... d5": "I had played the flexible and most common Nf6 which is my usual response to 1. d4 twice against Graham.  It can transpose in many different openings such as King's Indian, Nimzo-Indian, Queen's Gambit and Queen's Indian to name just a few.  The 1st time he slaughtered me with a fantastic combination and the second game I should have won, I had the material advantage, blundered and a draw was agreed.  So I'm going to change it up here with the solid and logical d5, mimicking WT's 1st move, it tends to become quite a closed game and I'm adopting it as my main response from now.  It's yielded me good results.",
        "2. c4": "Queens Gambit, wants to exchange a wing pawn for 1 of my centre pawns to put it simply.",
        "2... c6": "Slav Defence.",
        "3. e3": "I would have chosen a sharper line, but I can't question this move really.  Goes with his solid opening style of minimal surprises possible (may cause the old boy a heart attack ;) and trying to slowly crush his opponents in the middle-game.  His Bishop on c1 has limited movement now however.",
        "3... Nf6 4. Nc3 e6": "Transposing into a semi-slav.",
        "5. Nf3": "Sensible stuff.",
        "5... Nbd7": "Thematic move in most QP variations.  It is better here than on c6 usually as it doesn't obstruct my c-pawn and prepares c5 and e5 advances (and yes, I know I can't put it on c6 anyway). ",
        "6. Be2": "Bd3 was a more aggressive alternative, but then it becomes slightly vulnerable to a fork on e4, also I can play 6. dxc4 7. Bxc4 and then to get it back on the powerful c1-h7 diagonal he would have to use up 'tempo' and b5 can come with more 'tempo' setting up some Q-Side play.  Still, both moves are pretty standard. ",
        "6... Bd6 7. O-O O-O 8. Re1": "Perhaps preparing a future e4 (and a disadvantage of the Bishop on e2, on d3 it would be perfectly placed in accordance with e4).  That QB needs developing soon though either via fianchetto or after e4.  When it eventually does move it is reduced to defensive duties..",
        "8... dxc4": "e5 could not be played without it. ",
        "9. Bxc4 e5 10. dxe5": "Qc2 was another option..",
        "10... Nxe5 11. Be2": " ",
        "11... Qc7": "Simple discovered attack on h2.  I Want to place a Rook on d8 & get some play going down that file.",
        "12. h3": "Secures g4.",
        "12... Bf5": "I feel in control here, with a quite active position.",
        "13. b3": "Prevents intrusion on c4 perhaps?  He never got to develop the Bishop to b2 so it counts as a wasted move probably, perhaps I'm being a bit harsh..  Nd4 was an alternative.",
        "13... Rad8": "My pieces are falling into place..",
        "14. Bd2": "14. Nd4 again is an alternative Bb4 15. Bd2",
        "14... Nxf3+": "Removing a defender of d2.",
        "15. Bxf3 Bb4": "Be5 is also good.  WT has a cramped position.",
        "16. Qc1": "Only reasonable option.",
        "16... Rxd2": "?! The question mark comes before the exclamation unfortunately.  Although at the time I was certain it was sound..",
        "17. Qxd2 Qa5 18. Rec1": "Also forced.",
        "18... Rd8 19. Qb2": "Forced again.",
        "19... Rd3": "I was certain here I was going to win a Knight and Bishop for a Rook at least, but I got lucky.  WT can wriggle out of the hole.  Find the correct move and why it was correct.",
        "20. Ne2": "The ultimate and unfortunate losing move.  You may have spotted Na4, it's not particularly spectacular, but did you find the reason for why it was good here?  It seems that Ne2 and Na4 do the same job, but retract the move and take a closer look at the position: \nHis Queen has to fall now with Rd2 and I must admit I just stopped my analysis there and presumed I had got the advantage full stop, but after 20. Na4 Rd2 21. Qxd2 Bxd2 22. Rc5!  The trick is to look at what squares your Knight would control on a4- You will notice c5 and then see how vulnerable my Q and B are to a fork.  Think \"if I could just get my Rook to c5, I would gain a Bishop\".  But there is one obstacle standing in your path: that annoying Bishop on b4, if only it wasn't there then it's happy days!  Therefore you will no longer fear moves such as Rd2, because you know once that Bishop is gone from B4 your plan can come to fruition.  Another reason is that here if Rd2 wasn't possible Ba3 would recover the situation and win back my material, Na4 also stops any Ba3 ideas.  So all in all a multi-purpose move which you will trust on yourself to find consistently with this mindset.\nComment from Dmisra (1512):  Na4 is brilliant but still has hurdles, for the way I see it- 20. Na4 Rd2 21. Qxd2 Bxd2 22. Rc5. What if black now plays b5!! The white rook takes black bishop on f5, black moves his pawn g6 and the white rook dare not take the knight ( because of.... Bc3) and is somewhat trapped in the middle of the board and gets harried around in a complicated middle game. The rook can escape but the white knight pinned on a4 is lost. Then, white has 2 rooks vs a queen and a knight - can white still win??\nComment from me:  Good analysis, I didn't spot that 1. But I never claimed the game was won for White after the combination. Black still has play, but will remain at a material disadvantage, even after your creative line. ",
        "20... Rd2": "Anyway he missed it.  The rest of the game is simple, so I'll leave it there, thx to Graham for the game and I hope you enjoyed it.",
        "21. Qd4 Rxd4 22. exd4 Be4 23. Rc4 Bd3 24. Rcc1 Bxe2 25. Bxe2 Bc3 26. Rab1 Qxa2 27. Bd3 Bxd4 28. Rce1 Bxf2+": ""
    },
    "url": "https://gameknot.com/annotation.pl/trying-to-break-down-the-thought-process-for-beginners?gm=16731",
    "gameName": "Trying to break down the thought process for beginners.",
    "players": "tassiac (1710) vs. toiletduck1 (1806)",
    "opening": "QGD Slav defence (D10)"
}