{
    "moves": {
        "1. d4": "After seeing a video about the Englund Gambit, featuring a particularly nasty trap, I wanted to give this a try. Despite the first move being considered one of the weakest replies black can have. The resulting game was one I particularly enjoyed, although I cannot in good conscience credit the opening for that.",
        "1... e5 2. dxe5": "White takes, as well he should.",
        "2... Nc6": "The hope here is that white protects with Nf3. After Qe7 (also not the best move early in the game), the trap can start to be set if white defends again with Bf4.",
        "3. Nc3": "Unfortunately, white already doesn't bite. The engine labels this as an inaccuracy; it does favor Nf3.",
        "3... Nxe5": "That gives me the option to equalize in material, although it leaves me behind in development.",
        "4. h3": "That is unless, of course, white wastes time. Perhaps my unusual opening has left him unsure what to do? The engine doesn't mind though, curiously.",
        "4... Nf6": "Just developing now, trying to transpose to a more regular position.",
        "5. Bf4": "Another inaccuracy; the engine again wants to see Nf3. I don't like the move though because of the attack on the bishop.",
        "5... Bd6": "? I don't really want to move the knight again, so I defend by bringing out the bishop. This was a mistake though according to the engine, likely because it blocks my d-pawn. Moving the knight back to b6 was better here.",
        "6. e3": "Another move by white that feels slow to me. Why not e4? But again, while this moves surprises me, the engine doesn't mind.",
        "6... O-O": "It gives me time to continue development.",
        "7. Bxe5": "? Mistake according to the engine, and this time I felt the same already before the post-game analysis.",
        "7... Bxe5": "That's because I don't mind this trade, at all. I felt like the knight was more a burden than anything in that position.",
        "8. Nf3": "Attacking my bishop.",
        "8... Bxc3+": "Losing the dark squared bishop isn't ideal, but at least this way I don't lose tempo because of the attack on said bishop.",
        "9. bxc3 d5": "Trying to gain some control in the center. I'm not expecting this pawn to last long, but at least this opens up an important diagonal for the bishop.",
        "10. Be2": "White wants to castle.",
        "10... Re8": "Continuing development, while practically inviting white to castle. I want him to, because I feel like I'm not that far away from a strong attack on the king side.",
        "11. O-O": "White obliges.",
        "11... Qd6": "Here's why I wanted him to castle. I'm now eying down h3 with my bishop and h2 with my queen. I want to prepare a bishop sacrifice on h3 to bust open his position, but for now there are too many defenders in the way.",
        "12. a4": "Not sure how much of a plan white really has at this point. I can turn that pawn into a target. ",
        "12... a5": "I'm considering Bd7 and want to take away the a5 square for the pawn on a4. The engine slightly preferred me to counterattack with Ne4 instead.",
        "13. Qd4": "This I feel is a big mistake from white. It allows me a nice rook lift with tempo. The engine only labels it as an inaccuracy.",
        "13... Re4 14. Qd2": "I expected white to retreat to d3. Engine doesn't mind.",
        "14... Bd7": "Putting pressure on the a4 pawn.",
        "15. Nd4": "Secretly I'm happy. That's one defender less (or at least in a worse position) on the king side. The engine indeed considers this an inaccuracy.",
        "15... c6": "Preventing Nb5, which would have been awkward for my queen. However, the engine doesn't like this move; it wanted to see Rh4.",
        "16. Bf3": "Attacking my rook, but I'm not impressed.",
        "16... Rh4": "I wanted to move my rook to this square anyway, so being able to do this attacking move under the disguise of taking my rook out of danger, can only be good for me.",
        "17. Rfb1": "Attacking the b7 pawn, obviously, but white has no time to attack, as will soon become apparent.",
        "17... Ne4": "? While I'm putting pressure on the queen, really what I want with this move is to get rid of the bishop (another defender for the king). Turns out the engine doesn't like this, though.",
        "18. Bxe4": "White takes the bait, as well he should, according to the engine.",
        "18... dxe4": "The pawn that I thought wouldn't last long, now suddenly becomes a force to be reckoned with. It'll take away two important squares from the king later down the road.",
        "19. c4": "? Another slow move from white, indeed marked as a mistake by the engine.",
        "19... Bxh3": "! Finally, I can put the plan into motion that I have already been planning since move 10. Let's see if this attack is as potent as I think it is. According to the engine, I only have a slight advantage...",
        "20. gxh3": "?? White accepts the sacrifice, which I was hoping for of course, and is actually a blunder according to the engine.",
        "20... Rxh3": "Already, white needs to be really careful. My queen is ready to join the party and checkmate is just a few moves away if white doesn't defend properly.",
        "21. Kf1": "Seeing the danger, white tries to flee.",
        "21... Qg6": "That does little to diminish the pressure though. If white doesn't do anything (e.g. Rxb7 or a similar move on the queen side), it's a forced mate in three after ... Rh1+ 23. Ke2 Qg4+ and either 24. f3 Qg2# or 24. Nf3 Qxf3#.",
        "22. f4": "?? The position proves too complicated for White. This is a blunder that actually leads to a forced mate in 10, although at this point my focus is on capturing the queen first. The correct move here is Qc3, vacating an important square that the king can use to escape.",
        "22... Rh1+ 23. Kf2": "Forced, because the only other option 23. Ke2 would be met with ... Qg2#.",
        "23... Rh2+": "Getting ready to take the queen.",
        "24. Kf1": "Again forced, because Kf1 would be met with Qg1#.",
        "24... Rxd2": "Even if I botch the forced mate, I'll have a huge advantage now.",
        "25. Ne2": "This blocks a mate in two starting with Qg2+.",
        "25... Qg4": "Attacking the knight, with again the threat of a mate in two.",
        "26. Rbe1": "The only defense against that mate.",
        "26... Qf3+": "Of course, this will win me even more material.",
        "27. Kg1": "Forced.",
        "27... Rxc2": "I feel like I have time to gobble up a pawn. I do, of course, but the more efficient move would have been Rd6, with thoughts of bring the rook to the g or h file to deliver checkmate.",
        "28. Rad1": "There's not much white can do in this position. This, at least, opens up the possibility of checkmating me if I'm not careful and walk away with my rook on a8.",
        "28... Qxe3+": "Having all the time in the world, I gobble up another pawn.",
        "29. Kf1 Qf3+": "Just repeating the position, so I can grab the knight for free.",
        "30. Kg1 Rxe2": "White is now forced to trade rooks, since if he doesn't, Qg2 is mate.",
        "31. Rxe2 Qxe2": "Captures captures...",
        "32. Rf1 Rd8": "Bringing in my final attacker. Mate was already inevitable for a while already, but even a lower level player like me is able to see the forced mate now.",
        "33. c5 Rd2 34. Rf2 Qxf2+": "One move before being checkmated, White resigns. Mr. Shaibel would be proud :) Thanks xildur for a really nice game!"
    },
    "url": "https://gameknot.com/annotation.pl/trying-out-the-englund-gambit?gm=68581",
    "gameName": "Trying out the Englund Gambit",
    "players": "xildur (1594) vs. larsw84 (1660)",
    "opening": "Queen's pawn (A40), Englund gambit"
}