{
    "moves": {
        "1. d4": "d4 is my best first move statistically so I played it.",
        "1... d5 2. c4": "Queens gambit.",
        "2... c6": "Slav defense",
        "3. Nf3 Nf6 4. Nc3": "Nc3 is flexible in case of e6 transposing into the semi-slav.",
        "4... dxc4": "This is the main point of the slav black will try to hold onto his c4 pawn.",
        "5. e4": "This will transform into a gambit a4 may have been slightly better.",
        "5... b5 6. e5": "forced if I want to hold onto my e pawn.",
        "6... Nd5 7. a4 e6 8. axb5": "slight trick black plays the best Nxc3.",
        "8... Nxc3 9. bxc3 cxb5 10. Ng5": "Took me a while to rationalize this move.  I felt that Be2 or Ba3 may have been slightly better, though this move doesn't have anything wrong with it.",
        "10... Qd7": "Qd7 responds to Qf3.",
        "11. Qg4": "Qg4 seem more reasonable than Qh5 the other option for the queen.",
        "11... Bb7 12. Be2 Bd5": "Black position is now very solid.",
        "13. O-O a5 14. Ba3": "Ba3 trades bishops and stops b4.",
        "14... Bxa3 15. Rxa3 Qb7 16. f4": "This move took me about 20 minutes or so to play.  I was also thinking about Bf3 though I feel that I would be going backwards in development.",
        "16... h6": "kicks my knight back.",
        "17. Nf3 b4": "I had expected O-O but black played b4 which is more fun!",
        "18. cxb4 axb4 19. Rxa8 Qxa8 20. Qxg7": "I finally got my pawn back but, the b and c pawns look ominous.",
        "20... Rf8 21. f5": "Qxh6 would be too greedy.",
        "21... Qa7 22. fxe6 Nc6": "Nc6 prepares the very strong Nxd4!",
        "23. exf7+": "This is probably the game winning mistake though blacks pawn are strong they are not quite decisive.  I got too greedy here I actually strengthened Nxd4.",
        "23... Rxf7 24. Qxh6 Nxd4": "Now I'm in big trouble 25. Nxd4? Qxd4+ 26. Kh1 Rxf1! 27. Bxf1 Qf2 28. Qb1 now black has up a few tempos to play around with while I try to figure out how to not lose a whole piece.  So I chose a different option.",
        "25. Qh8+": "25. Qh8+?! Rf8(what I expected) 26. Qxf8+ Kxf8 27. Nxd4+ giving myself a chance.",
        "25... Kd7": "Kd7?! this allows me to save my position in a better way.",
        "26. e6+": "e6+! Nxe6 must be played.",
        "26... Nxe6+ 27. Kh1 Kd6": "Getting out of Ne5+",
        "28. Rd1": "Threatens Qe5+",
        "28... Qc5 29. h3": "gives my king some room though not sure this was best here because it gives black time.",
        "29... c3 30. Qb8+ Ke7 31. Qe5": "The point of Qb8+ though I'm completely lost after the next few moves.",
        "31... Bxf3": "Best response and one I didn't consider for some reason.",
        "32. Qxc5+ Nxc5 33. Bxf3": "I resign here c2 forces a queen."
    },
    "url": "https://gameknot.com/annotation.pl/trying-my-hand?gm=24925",
    "gameName": "Trying my Hand",
    "players": "yoshark (1459) vs. ionadowman (2064)",
    "opening": "QGD Slav (D15), Tolush-Geller gambit"
}