{
    "moves": {
        "1. e4": "My comments are from Black's point of view, so it might be helpful to \"flip the board\" so that Black is on the bottom.  Tim starts every game with e4.  It's a strong first move since it takes control of the center and opens the diagonals for his Queen and light squared Bishop.\n",
        "1... Nf6": "This is a good first move for Black, as it attacks Tim's pawn on e4 and stakes a claim to the d5 square.  Tim will either protect his pawn with another pawn or more likely with his Knight (w/ Nc3).  He can also push his pawn forward to e5, threatening your Knight.\n",
        "2. Nc3": "Protecting w/ his Knight.\n",
        "2... Nc6": "Jim develops his second Knight, which stakes a claim to the e5, d4,  and b4 squares.  It sets up nicely for his next move, which should be to push his pawn to e5.  Nice job following the general rule that says:  Develop your Knights before your Bishops.  \n",
        "3. Nf3": "Tim also follows the rule, developing his second Knight.  Looking at Tim's development, he controls 5 central squares with his two Knights and one pawn: b5, d5, e5, f5 and g5.  Picture perfect.\n",
        "3... d6": "This move releases the light squared Bishop and claims control over the c5 and e5 squares.  A slightly better move (the move I would have played) is pushing your pawn to e5, but I might be splitting hairs.\n",
        "4. Bb5": "This is a signature move by Tim.  His Bishop is pinning the Black Knight to it's King, meaning you can't move the Knight because you'd be in check ( ).    is the symbol for check.  Tim did this same move in the game vs Putz that I commented on. \n",
        "4... a6": "I view this as a wasted move.  Putz did the same thing, if you go back and look at that game.  As I said then, on Tim's next move, he will take your Knight (no worries, because your Knight is protected so it's an even trade, but Tim's goal is to mess-up your pawn structure, giving you doubled pawns, as shown on your 5th move.  The best move here is to move your Bishop to the d7 square (Bd7) because it breaks the pin, prevents the double pawns and develops your Knight.  Compare that to what you've accomplished with a6.  So when Tim takes your Knight, you just take his Bishop with your Bishop.  \n",
        "5. Bxc6+": "Making the Knight Bishop trade.\n",
        "5... bxc6": "Completing the trade.  Now you have doubled pawns (which isn't always bad, but it can be).\n",
        "6. e5": "This is why I recommended playing e5 back on move 3, because it would have prevented this move by Tim. It's an even trade, pawn for pawn, but you'll have his Knight sitting menacingly in your territory.  \n",
        "6... dxe5 7. Nxe5 Qd6": "Good move.  Let's get that Knight outta there.\n",
        "8. d4": "Protecting the Knight\n",
        "8... Nd5": "Decent move. Another option here instead of moving the Knight is Bg4 which attacks Tim's Queen.  Your Bishop on g4 would have been protected by your Knight on f6.  I like this move instead because it forces Tim to move his Queen, develops your Bishop and clears the way to Castle long (0-0-0) which would put your Rook on the d file.  Just a thought.\n",
        "9. O-O": "Tim Castles short (0-0) getting his King to safety.\n",
        "9... c5": "Good move...aggressive.\n",
        "10. Nxd5": "Trading Knights.\n",
        "10... Qxd5 11. dxc5": "Tim let's Jim decide if they will play the remainder of the game w/ or w/o Queens.  Take a close look here, because this is a mistake by Tim.  A blunder.  Why?  Because Jim can take Tim's Knight with his Queen, giving Jim a material advantage.  If Jim did this, he'd have 2 Rooks, 2 Bishops and a Queen.  Tim would have 2 Rooks, 1 Bishop and a Queen.  Advantage Jim.  \n",
        "11... Qxd1": "But Jim missed it and traded Queens.  With this move, Jim has 2 Rooks and 2 Bishops.   Tim has 2 Rooks, 1 Bishop and 1 Knight.  Even material-wise; for the major and minor pieces.  Tim has slight advantage because he has an extra pawn.\n",
        "12. Rxd1 Bb7 13. Bg5": "Is Tim planning an attack on Jim's King using his Bishop, Knight and Rook?\n",
        "13... Rd8 14. Bf4": "Change of plans, Tim targets Jim's hanging pawn on c7\n",
        "14... f6": "Good move, kick the Knight.\n",
        "15. Nc4 g5": "Jim's intent was to kick the Bishop as well, but overlooked the fact that the Bishop is pointing at (attacking) Jim's hanging (unprotected) pawn on c7.\n",
        "16. Bxc7": "Jim decides to trade Rooks.\n",
        "16... Rxd1+ 17. Rxd1 Kf7": "Avoiding the   by Tim's Rook if Tim were to play Rd8\n",
        "18. Rd8": "Tim plays d8 anyway...\n",
        "18... Bg7": "Now Tim has the option to trade Rooks.  He will, because Tim wants to simplify the board (trade all the major and minor pieces) which will highlight his pawn advantage.\n",
        "19. Rxh8 Bxh8": "Let the endgame begin!\n",
        "20. b4": "Maneuvering this minefield won't be easy for either Tim or Jim.  This is where having plenty of time on your clock comes into play.  \n",
        "20... Bd5 21. Na5": "Looking at the board here, Jim has a pawn advantage on the left side of the board (e-h files), since it's 4 black pawn vs three white pawns.  On the right side of the board, Tim has the pawn advantage, 4 pawns vs Jim's 1.  Jim needs to do two things: Get his King to play offense by moving it to the right side of the board to attack Tim's pieces and pawns and also avoid losing (or trading) his Bishops.  If he can do these two things, he can shut-down Tim's pawns and have a good shot at winning. \n",
        "21... f5": "Uh oh...Jim needs to get his King over to attack Tim's Bishop, Knight and pawns, in coordination with his own two Bishops.  If he continues running his e-h pawns up the board, he'll lose.  Up to this point, Jim played a good game, certainly holding is own against Tim.\n",
        "22. a3 Bc3 23. c6": "Tim's goal is to get a Queen and eliminate Jim's Bishops.\n",
        "23... f4 24. Bb8 g4": "Jim's King is sitting on the sideline and he is ignoring Tim's pawn push.  Not good.\n",
        "25. c7 Be6": "Now Jim addresses the issue.\n",
        "26. Nc4": "Tim is repositioning his Knight to achieve his goal of a pawn promotion and elimination of Jim's Bishops.  His Knight will end up protecting the c8 square. \n",
        "26... h5": "Jim ignores the issue again.  His King is sitting on the sidelines, hands in his pocket, whistling Dixie!   He needed to get his King over to the c file, but it's too late now.\n",
        "27. Nb6": "This Knight has reached its destination and is now strategically placed to achieve both goals.\n",
        "27... Be5 28. c4 Bxc7": "Jim prevents the pawn promotion, but at a high cost.\n",
        "29. Bxc7": "Jim loses his Bishop and is down material.  Game over.  Tim wins.\n",
        "29... Bxc4": "Blunder.  ",
        "30. Nxc4": "Now he's really down material!  Jim's King better run for the hills!\n",
        "30... h4 31. a4 g3 32. hxg3 e6 33. gxh4 Kg6 34. b5 Kh5": "This was a good game with even play right up until the endgame.  \n",
        "35. bxa6 Kxh4 36. a7 Kg5 37. a8=Q e5 38. Bxe5 Kf5 39. Qf8+ Ke4 40. Qxf4+ Kd5": "Nowhere to hide...",
        "41. Bg7 Kc5 42. Qd4+ Kb4": "Feeling exposed?",
        "43. Nd6+ Kb3 44. Qc3+ Kxa4 45. Qc4+ Ka3 46. Nb5#": ""
    },
    "url": "https://gameknot.com/annotation.pl/tuesday-december-2-2008?gm=20263",
    "gameName": "Tuesday December 2, 2008",
    "players": "Tim (White) vs. Jim (Black)",
    "opening": "Alekhine's defence (B02), Scandinavian variation"
}