{
    "moves": {
        "1. e4 e5 2. Nf3 g6 3. Nxe5": "I am not sure this is a conventional opening. It seems to sacrifice the pawn at e5 for little gain.",
        "3... Bg7 4. Nf3 Nf6 5. Nc3": "Defends e4.",
        "5... O-O 6. Bc4": "Develop, develop, develop. White has more pieces developed and a stronger hold on the center. And a small material edge. Probably not the situation black had hoped for with his unconventional opening.",
        "6... d5 7. Nxd5": "Black is sneaky. d5 looks weak, and it looks like he gave white a free pawn, but if 7. Pxd5 Re8  and now white has to block with his knight or his bishop - either way his d5 pawn loses a critical defender.",
        "7... Nxe4 8. d3 c6 9. dxe4": "c6 was an odd choice. Black just gives up another pawn.",
        "9... cxd5 10. Bxd5": "And now black is behind by two pawns and has limited development of his pieces.",
        "10... Qe7 11. O-O Nd7 12. c3": "To allow me to move my bishop. Right now it was doing guard duty against black's fianchettoed bishop on g7.",
        "12... Nf6 13. Bg5": "! This causes black some headaches. White threatens e5 to win the pinned knight. I expect the queen to run away and then I can exchange on f6.",
        "13... Bg4 14. e5": "!  Attacks the pinned knight. All exchange variations that I can see end up with black losing material.",
        "14... Bxf3 15. exf6": "First we trade the knights. Both queens are now under attack, but black also has two bishops under attack, too.",
        "15... Bxf6 16. Bxf6": "Black trades his bishop for the white pawn, and now his material deficit has widened. If black retreats his queen, white plays 17. Qxf3 which then defends both bishops and black loses more matrial, so his next move is forced.",
        "16... Qxf6 17. Qxf3": "Now we can trade queens or not. Either way, white is ahead by a bishop and a pawn.",
        "17... Qe7 18. Rfe1": "Black wisely chose not to trade queens while he's down a bishop and a pawn. So it's time to chase her around, while getting my pieces into more active roles. I could have played Bxb7 but after black's R(a)b8 I end up losing my pawn at b2, which splits my a and c pawns too.",
        "18... Qc5 19. Bxb7": "Now I can safely take the pawn, since the black queen doesn't threaten the bishop on b7, so r(a)b8 means I don't have to immediately retreat the bishop.",
        "19... Rab8 20. b4 Qb6 21. Bd5 Qc7 22. Qe3": "Thinking about Qh6 and following up with Re3 and Rh3.",
        "22... h5 23. Qe5": "Took the wind out of my sails a bit, now I'm threatening to exchange queens (good for white) or Qf6 (threatens the unprotected pawn at g6 while f7 is pinned and allows Re7 putting loads of pressure on that poor pinned f pawn)",
        "23... Qd7 24. Rad1 Qa4 25. Qf6": "Not sure what black's move was about. The a2 pawn is protected by white's bishop. Now black's queen is far removed from defending. Maybe black was hoping for Qxd1  (or    if white is foolish enough to move the rook at e1 forward and also foolish enough to not leave the rook and queen on the e file to block the mate).",
        "25... Rb6 26. Qg5": "I have to admit, I had not considered black's last move. The perfect foil to most of my plans. Back to the drawing board...",
        "26... Re8 27. Rxe8+": "I was surprised to see black willing to exchange when he was down in material. I expected Qxe8. But then I remembered my theory about his move 24...Qa4 to set up Qxd1   and that's when I realized black was probably not planning to capture my rook at all. Turned out I was right. Free rook for me.",
        "27... Kg7 28. Rde1": "Black laid a trap for white, but white turned it around and gained a rook. Now I'm shoring up the position, protecting the rook on e8 and avoiding the mate on d1.",
        "28... Rb5 29. Bc6": "! Exchanges queens, capitalizing on white's crushing material superiority. Of course, if black doesn't exchange queens, white will take the rook free of charge.",
        "29... Qa6 30. Bxb5": "Two free rooks within 3 moves. It's like an all-you-can-eat buffet.",
        "30... Qxa2 31. Qe5+": "And now it's Checkmate in 5. Black cannot move his king at all or white plays 32. Rh8  .",
        "31... f6 32. Re7+ Kh6 33. Qf4+": "Now white has mate in 2. Black could have stalled by 32. ... Qf7, 33. Rxf7  Kxf7, 34. Qe7  Kg8, 35. Qd7 (any), 36. Re8  ",
        "33... g5 34. Qxf6#": ""
    },
    "url": "https://gameknot.com/annotation.pl/turning-around-the-trap?gm=20607",
    "gameName": "Turning Around the Trap",
    "players": "blake84120 (1200) vs. tunemarshall (1127)",
    "opening": "King's knight opening (C40)"
}