{
    "moves": {
        "1. e4": "Hi everyone!\n\nI am playing in Master Chrisobee's MT Love Conquers all and I found myself in a game where I grabbed a pawn and walked into a knight fork, losing my knight for two pawns.  However, I got a lot of play for that deficit thanks to my KR and Glenda.  I somehow managed to regain my piece with interest and Jo and I ended up in a K & P ending with me increasing that two pawn advantage into a 4 pawn advantage.  Jo tried to play for a stalemate but I was having none of it.  I carefully calculated at the end that I had a forced mate in 8 and announced it to my opponent who then resigned on the grounds of Unavoidable Mate.  Here is how it all happened.  Here is the Gameknot Analysis version of this game which started off as a Petrov's Defense.  http://gameknot.com/analyze-board.pl?bd=16936623&rnd=0.6334171524199531",
        "1... e5 2. Nf3 Nf6": "2. ..... Nf6 - after a double king pawn opening black tries the Petrov's Defense.",
        "3. Nxe5 d6": "3. ...... d6 - this move drives my knight back and the e4 pawn will be regained next turn.",
        "4. Nf3 Nxe4 5. d4 Be7 6. Bd3 Nf6 7. O-O": "7.0-0 - after getting my kingside pieces out, Henry and Jo's king both tuck themselves away on the kingside.",
        "7... O-O 8. h3 Re8 9. c4": "9. c4 - an attempt to expand on the queenside.",
        "9... Na6 10. a3 b6 11. Nc3 c5 12. d5 Bb7 13. Qc2": "13. Qc2 - putting pressure on h7.",
        "13... h6 14. Bd2": "14. Bd2 - Fou Lenoir clears the decks.",
        "14... Nc7 15. Rfe1 Qd7 16. Nh4": "16. Nh4 - with ideas of Nf5.",
        "16... Nh5 17. Nf5 Bg5 18. Bxg5": "18. Bxg5 - bishop trade.",
        "18... hxg5 19. Qd2 Nf4 20. Bc2 f6 21. Ne2 Nxe2+ 22. Rxe2": "22. Rxe2 - knight trade.",
        "22... Ba6 23. b3 b5 24. Ne3 Re7 25. Qd3 f5 26. Nxf5": "26. Nxf5 - I win a pawn, or do I?",
        "26... Rxe2 27. Qxe2": "27. Qxe2 - rook trade.",
        "27... Qf7 28. Nxd6": "28. Nxd6?! - I can't resist it, can I?  Unfortunately I have left my knight on for a fork by the Wicked Witch of the West moving to f6 and forking knight and rook.  Now why have I not given that move a double question mark?  Reason - a counter-attack brews over the next few moves.",
        "28... Qf6 29. Re1": "29. Re1 - best - doubling up on the e column.",
        "29... Qxd6 30. Qd3": "30. Qd3 - Glenda ensures that I bag control of the e file by keeping h7 under the hammer.",
        "30... Qh6 31. Re7": "21. Re7 - and now for the Bone In the Throat!",
        "31... Ne8 32. cxb5 Bb7": "32. ...... Bb7?? - best is BxP - this move just gives up the black lsb for nowt.",
        "33. Rxb7 Nd6 34. Rc7": "34.  Rc7 - now the black c5 pawn comes under the hammer.",
        "34... Rc8 35. Rxc8+ Nxc8": "35. ..... Nxc8 - rook trade - with me being 3 pawns up I am only too pleased to trade major pieces.",
        "36. Qg6 Qxg6 37. Bxg6": "37. Bxg6 - and I am also pleased to have the queens off the board.  Now I am in a piece endgame 3 pawns up.  If I can only get into a K & P ending it is game, set and match to Jo Stevens!",
        "37... Kf8 38. Kf1 Ke7 39. Ke2": "39. Ke2 - and now Henry comes out into the battlefield.  It is a hot summer's day (for once we have been having decent weather today!), the battlefield is not too far away from the sea and Henry is now thinking about having bar-be-que p(r)awns for his supper!",
        "39... Kd6 40. Be4 Nb6": "40. ..... Nb6 - I know that my d5 pawn is gonna fall but I am prepared to let it go because I will still be two pawns up and in that K & P(r)awn endgame I talked about.  Henry is really licking his lips!",
        "41. Kd3 Nxd5 42. Bxd5 Kxd5 43. a4": "43. a4 - with the plan of a5 and getting a passer on the a column.  Note - if I get to the stage where I am in a position to play b6 and Jo takes that pawn, I will not recapture assuming the BK stays where he is.  I will simply walk the a pawn on to a8 and Glendadom!",
        "43... g6 44. a5 Kd6": "44. ..... Kd6 - black is in a zugzwang.  His king has had to retreat to avoid losing further material (yet).  This however, allows Henry to move to c4 to attack his c5 pawn.  Now black cannot avoid losing further material.",
        "45. Kc4 Kc7 46. Kxc5": "46. Kxc5 - gobble, gobble!",
        "46... a6 47. bxa6": "47. bxa6 - I get a bit suspicious when my opponent voluntarily gives up material like this late in the game.  I must be careful not to give my opponent the wrong kind of mate.",
        "47... Kb8 48. b4 Ka7 49. b5": "49. b5 - I intend to keep the BK confined on the back row.  But can I ensure that he cops the right kind of mate?",
        "49... Kb8 50. b6 Ka8 51. Kd6": "51. Kd6 - aha.  Yup, it will be the b pawn that will inflict Glendadoom on my opponent because I then discovered, after careful analysis that Old Matey will descend on Jo a few moves after Glenda's re-appearance on the board.  I announced #in 8 and Jo waved the white flag.  This victory has taken me to within 3 points of a huge milestone - 1900."
    },
    "url": "https://gameknot.com/annotation.pl/twist-and-turn?gm=45282",
    "gameName": "Twist and Turn",
    "players": "jstevens1 (1893) vs. doji (1650)",
    "opening": "Petrov (C42), classical attack"
}