{
    "moves": {
        "1. e4": "maximum effect.",
        "1... e5 2. Nf3 d6 3. Bc4 Nf6 4. d3 h6 5. O-O a6 6. Nc3 b5": "So far I am simply emulating the game DB opening book.",
        "7. Bd5": "But this move is not there so from here out I'm on my own.",
        "7... Nxd5": "I don't want White's Bishop on my front door step.",
        "8. Nxd5": "And I should be able to chase this one away.",
        "8... Be6 9. a4": "Or not.  I always hate this position, if I preempt, White's Rook comes out of storage.  If I let White preempt, I can't retaliate as I'll loose my Rook to his.  And if I simply pass Whites pawn with b4, his Knight will pick him off...",
        "9... c6": "So I'll have my brave peasant scare the big white horse and support his brother vanguard.",
        "10. Nc3": "Works for me.",
        "10... b4": "Emboldened by his brother, the b pawn chases the big white horse.",
        "11. Ne2": "Coward!\r\n",
        "11... a5": "I'm usually more aggressive, but I'm thinking I need to learn to patiently secure my position while attacking.  I like stopping White's pawn at a4, and a5 now supports b4, but I'm now thinking support via c5 would have been better.  (white's Queen prevents b3 after a c3 attack...)\r\n",
        "12. c3 c5": "Better late than never I suppose.  Gives me an aggressive picket, but I feel it's rather fragile....",
        "13. c4": "Black is building a Pawn stone wall.",
        "13... Qf6 14. Ne1": "Black didn't run from my Queen for fear, so he must want this Knight on c2...",
        "14... Nc6": "I'd like to see my Knight on d4.",
        "15. Nc2 Nd4": "And we both get our wish...",
        "16. Ncxd4": "Destiny..  it just was not to be.",
        "16... exd4": "Capture with my e Pawn gives my Queen some elbow room.",
        "17. Nf4 g5": "I don't remember thinking what I'd do if white played Nh5...",
        "18. Nh5": "But I get to do that now...",
        "18... Qg6": "If White leaves his Queen where she is I can block her protection of the Knight with g4, trapping White's Knight.  A pawn storm would complicate the capture...",
        "19. Qf3": "Alas!  Was not to be!  Whites Queen to f6 unearths a plethora of worms...  How to obviate?",
        "19... Be7": "This should do it.",
        "20. e5": "Revealed attack on my Rook.",
        "20... O-O-O": "!?",
        "21. Qc6+": "I hate it when that happens!  Shape up JC!  Focus!",
        "21... Kb8": "Forced, and now,",
        "22. Qb5+": "White's Queen will enjoy a light snack",
        "22... Kc7": "right after this brief pause...  {Looking back I question this move.  I remember thinking I wanted my Rooks paired and free on my back file, Kc8 could have accomplished the same without the check.}",
        "23. Qxa5+": "This so sucks...  ",
        "23... Kd7": "But my Rooks are paired and free.",
        "24. Qb5+": "Gotta keep those Rooks together.",
        "24... Kc7": "This is getting old.",
        "25. a5": "White brings in the brave peasant for support.",
        "25... Rdb8": "Time for the Queen Bee to go...  ",
        "26. Qa6": "?!  What?  White's Queen is now isolated and restricted to two squares!",
        "26... Qxh5": "And I'm up two points!  I guess one good blunder deserves another...",
        "27. exd6+": "My heart skipped a beat when I first saw this move.  I assumed I had missed an obvious and fatal attack vector, but when the panic subsided, I saw this was simply a nuisance check, and maybe to my advantage...",
        "27... Bxd6": "as I remove White's passed pawn and threaten mate with Qxh2.",
        "28. g3": "White obviates the mate.",
        "28... Qe2": "So I will threaten White's pawn base...  !?  28... Qf3 followed with Bh3 would have lead to mate!  I still should be able to force mate, but it will take a few more moves.  4u hasn't played for many days, maybe he sees this and is trying to work a way out...",
        "29. Bxg5": "Now this move seems really odd...  Perhaps he's trying to distract me...  Kg2 would have slowed me down, maybe stopped me.",
        "29... Bh3": "The beginning of the end...",
        "30. Rfe1": "White's Rook on an open file could harass my King, ",
        "30... Qf3": "but my net is now cast, and I don't think White has an out...",
        "31. Re7+": "The best defence is offence...  At first I considered this a \"Nuisance check\", but you know, I harass my opponents' Kings in the hope they will blunder.  I must be careful here, White has 3/4 of his power focused on my King...",
        "31... Bxe7": "Reduce that to 2/3, and I've closed e-file to his remaining Rook.  I think I'll need the cover soon...",
        "32. Bf4+": "This guy never gives up.  I feel such a wuss...",
        "32... Kd8": "Next, White's Bishop to c7+.",
        "33. Bc7+ Ke8": "And White resigns.  A good game, kept me on my toes...  "
    },
    "url": "https://gameknot.com/annotation.pl/two-out-of-three?gm=22181",
    "gameName": "Two out of three",
    "players": "4u2nv (1449) vs. jcrycket (1454)",
    "opening": "Philidor (C41), Steinitz variation"
}