{
    "moves": {
        "1. e4 d5 2. e5 Bf5": "This game is easier and quieter than the accepted exd5 and its consecuences. And I played it a lot, so I felt confortable with it. ",
        "3. d4 e6 4. Nf3 a6": "Normal developement here, and now I \"lose a tempo\" with this move instead to go on with the inmediate c5. But it's on purpose. I just don't like to go - again and again - into Bb5+ etc. It can be very boring. ",
        "5. Bd3": "Here black has to think on Ne7, but it comes that the N on f5 is easily kicked out with g4, starting a pawn storm on the kingside. I don't really like a N on f5. And if White doesn't take, I'm self-closing me in. Why not BxB? This just gives white \"all\" and to me \"nothing\". Bg4 is anoher idea, but after h3, we'll reach a position similar to the game's. ",
        "5... Bg6": "It seems a loss of tempo, but white's B is also sitting there without scope.",
        "6. O-O c5": "Now, of course. ",
        "7. c3": "Opening the way for the Q to a4+, and I can't play b5 because of Bxb5+...",
        "7... Nc6": "...but it's all foreseen. Qa5 works too. ",
        "8. a4": "One of the thematic attacks. Here I lost the track and did make my first (I think) real \"inaccuracy\". ",
        "8... Qb6": "The pressure on d4 kind of ensures white'll play BxBg6 at some point. At the same time, the Q is preventing white to play the dsb. But I overlooked...",
        "9. a5": "Whooops. I did consider Qa7, but finally played",
        "9... Qc7": "...pressing on e5 and on the c column for the future. ",
        "10. Be3 c4": "? Black's game is in keeping the tension \"on\" in order to control the game with a constant threat on the center, pressure on the c column and intelligent use of Nb4... and I am throwing it all out with this move! In addition, I have no support against a future b3 because of my previous tempo loss allowing a5. And now I would struggle to develop. A very bad move for sure!",
        "11. Bc2": "Now white goes for Ba4.",
        "11... b5": "I just can't stay quiet. Now or never. Open the game or be squeezed in. ",
        "12. Ng5": "White's thematic attack - I know it - goes through f4-f5. Very dangerous. ",
        "12... b4": "I am allowing Bh4 for a tempo.",
        "13. f4": "Here it comes. It's very good game, except that I'm \"coming late\" since I lost precious tempos. ",
        "13... b3": "Alea Iacta Est. ",
        "14. Bxg6 hxg6": "...a new defender for g6 and and Sopen column for my R. But my pieces are stuck and undeveloped. I'm lost... except that white has to manouver wisely in order to develop himself...",
        "15. g4": "! Attacking f5, my weak point. Because of e6, of course. ",
        "15... Be7": "My B is useless and so it will be useful to exchange the annoying white N. ",
        "16. f5": "Here it comes. ",
        "16... Bxg5 17. Bxg5": "Severe danger now. ",
        "17... gxf5": "What else?",
        "18. gxf5 exf5": "...this is based on the fact that e5 is pinned. I'm sure I'll lose this, at this point. ",
        "19. Rxf5": "Extreme weakness. ",
        "19... Nge7": "Exchange quickly it's my only chance, if ever. ",
        "20. Rf3": "Probably a suboptimal choice, after Rh5. Neverhteless, I opted for ",
        "20... O-O-O": "...accepting Rxf7 and it's all over...",
        "21. Rxf7 Nxe5": "The last desperate try, based on dxN, Qxd5 threatening h2. Bf4, and it's over. ",
        "22. Rxe7": "!? Typical \"higher rated fear\". White thinks that there is a trick he can't see, so tries to complicate things in return. The move could be good, except for...",
        "22... Nf3+": "is a check. No choice for white...",
        "23. Qxf3": "I'm +6, but still alive. White is suffering from its underdevelopement much more than me!",
        "23... Qxh2+ 24. Kf1 Rdf8": "Is this a beauty or not? ",
        "25. Rf7": "Here, RxR will do... or not? RxR, QxR, and black will have a roadway to h1+ and so on. ",
        "25... Qh1+": "A hurry's mistake?",
        "26. Qxh1 Rxf7+": "Important move in order to play the previous one. ",
        "27. Kg2 Rxh1 28. Kxh1": "...and all my \"fantastic\" idea lent me into a -5 position, fighting two minor pieces with a R. I should lose, right? My only potential soldier is the pawn g7. It's my hero. As long as it stays where it is...",
        "28... Rf1+ 29. Kg2 Rd1": "Ok, now: let's try to figure out how to mobilize white's R or N without losing one of them, or compensation enough for it. ",
        "30. Kf2": "White can perfectly give up the N for a free R, and after a4 - b4 black is lost. But it's very hard to give up a piece for free, and besides, Rxb2+ would be deadly afterwards...",
        "30... Kd7": "My K can go to the center. It won't be able to prevent white's R entry, if white finds it, but in the meanwhile I have to go for my faint chances. ",
        "31. Ke2 Rg1": "White can't cover all the 1st row squares. It's a dead lock!",
        "32. Be3 Rh1 33. Nd2": "? White's blunder solves the tension in a questionable way, but let's see...",
        "33... Rxa1": "Now the material is 0, but still a game to play...",
        "34. Nf3 Ra2": "Setting my rule on the position... again. ",
        "35. Bc1 Rxa5 36. Ne5+ Kd6 37. Nf7+ Ke7 38. Ne5 Ra1": "? a last mistake, allowin Bg5+. ",
        "39. Kd2": "But my opponent wasted the occasion, and falls for ANOTHER DEAD LOCK. Now he will never be able again to move any piece but the N. Can you believe it? Beginners, be aware of such \"dead lock\"...",
        "39... g5 40. Nc6+ Kf6 41. Nb4 Ke6 42. Nc6 g4 43. Nd8+ Kf5 44. Nf7 g3": "If ever white manages to play Nxg, I'll win all the same... white carved his own grave without even knowing it..."
    },
    "url": "https://gameknot.com/annotation.pl/two-dead-locks-in-a-game?gm=61098",
    "gameName": "Two dead locks in a game!",
    "players": "Grand-Ayman (1324) vs. damafi (1423)",
    "opening": "Scandinavian (centre counter) defence (B01)"
}