{
    "moves": {
        "1. e4": "Hi again everyone!\r\n\r\nHere is the game I promised you.  This time my opponent is a former Class A player but his rating has just started getting back to what is was.  Thankfully it was against me that he got the blip!  We start off with a double king pawn opening and then I play the Ruy Lopez (3. Bb5).  In the middlegame I get my usual attack of passivitis but guess what, my opponent gets spiked on that hedgehog again and gets his rook trapped.  He must drop the exchange to extricate it.  Henry then survives a mating attack.  I return the exchange and finish two pawns up in a Q and P ending, so how does it become two against one?  Well, read on .....",
        "1... e5 2. Nf3 Nc6 3. Bb5": "3. Bb5 - Kasparov's Spanish Torture.",
        "3... a6 4. Ba4 Nf6": "4. ..... Nf6 - this is the main line Lopez.",
        "5. O-O b5 6. Bb3 Be7": "6. ..... Be7 - a standard closed Lopez.",
        "7. a4 b4 8. d3 a5 9. Nbd2": "9. Nbd2 - time to get some more wood out.",
        "9... O-O 10. Nc4 d6 11. c3 Bg4": "11. ...... Bg4 - pin.",
        "12. Ne3 Bh5": "12. ..... Bh5 - maintaining the pin.",
        "13. Qe2 Rb8 14. Bd1 Re8 15. Qd2": "15. Qd2 - a regrouping exercise is going on behind the hedgehog.",
        "15... Bf8 16. Be2": "16. Be2 - all to unpin that f3 horsie.",
        "16... Ne7 17. Qd1 Ng6 18. Nf5": "18. Nf5 - I try and break from passivity but it ain't gonna last.",
        "18... Bxf3 19. Bxf3": "19. Bxf3 - B for N trade.",
        "19... Ne7 20. Nxe7+ Bxe7": "20. ...... Bxe7 - N trade.",
        "21. Be3 c5 22. Qb3": "22. Qb3 - whoa there, Glenda makes a short journey to b3 on her Nimbus 2000!  She actually leaves the back two ranks!",
        "22... Qc7 23. Rfc1 bxc3 24. Qxc3": "24. Qxc3 - pawn trade.",
        "24... Rb4 25. b3 Reb8 26. Bd1": "26. Bd1 - a defensive but necessary move.",
        "26... h6 27. f3": "27. f3 - backing up e4.",
        "27... Qb7": "27. ...... Qb7 - ominous pile up of heavies on the b column.",
        "28. Qe1 Qa6 29. Bd2 Rd4": "29. ..... Rd4? - that rook is gonna find that square his Valhalla!",
        "30. Bxa5 Qxd3 31. Bc2": "31. Bc2 - the Wicked Witch of the West must retreat and now the trap is about to be sprung.",
        "31... Qa6 32. Bc3": "32. Bc2 - here it is, the black rook now has no moves whatsoever.",
        "32... Nh5": "32. ........ Nh5 - the beginnings of a kingside attack.",
        "33. Bxd4 cxd4": "33. ..... cxd4 - I am now the exchange up.",
        "34. Qf1 Qa7 35. Kh1": "35. Kh1 - Henry sidestepps a nasty discovery (d4+).",
        "35... Bg5 36. Rcd1 Rc8 37. Bd3": "37. Bd3 - blockading that passer on d4.",
        "37... Be3": "37. ..... Be3 - that black dsb is gonna be a thorn in my side for quite a few moves now.",
        "38. Bc4": "38. Bc4 - closing off the c column to prevent penetration into my position of the c8 rook.",
        "38... Qd7 39. g3 g5 40. Rd3": "40. Rd3 - preparing to return the exchange if necessary, black's kingside attack is beginning to look a little ominous and I can see a dark shadow in the distance in the shape of the chessic Grim Reaper, Old Matey.",
        "40... g4 41. fxg4 Qxg4": "41. ...... Qxg4 - a pawn trade bringing the Wicked Witch of the West that little bit closer to Henry.",
        "42. Bxf7+ Kg7 43. Bxh5 Qxh5": "43. ...... Qxh5 - this B for N exchange was necessary to cut down black's mating attack.  Henry is still not out of the woods yet though.  So Glenda snuggles up to her other half,  everyone say aaah!",
        "44. Qg2 Qg6 45. Rf1": "45. Rf1 - I thought it was necessary to take control of that f column.",
        "45... d5": "45. ...... d5 - this move prompts an important decision for me.  I decide that it is now necessary to return that exchange so that Henry can breathe more easily!",
        "46. Rxe3 dxe3 47. exd5": "47. exd5 - out of this melee I am still two pawns up.  Black's Witch and that rook can still do some damage so this game is by no means a gimme yet.",
        "47... Rc2 48. Qf3 Rf2 49. Rxf2 exf2": "49. ........ exf2 - now the rooks are traded.  Henry decides to move off the back rank.  Black will not be able to crown his passer.",
        "50. Kg2 Qc2 51. Qxf2 Qxb3": "51. ...... Qxb3 - pawn trade, passed f pawn goes for my b pawn.",
        "52. Qa7+ Kg6 53. Qa6+ Kh5 54. Qe2+": "54. Qe2+ - a series of zig zag checks from Glenda, boy she is gadding about on that broomstick here and she will certainly need to keep that satnav well charged up.  I now lose my a4 passer but rid myself of black's e5 passer in the bargain.  You would not believe that that weak looking passer on d5 could spell checkmate for black, would you?",
        "54... Kg6 55. Qxe5 Qxa4 56. Qe6+ Kg7 57. d6": "57. d6 - that weakie doesn't look quite so weak now though, well defended by Glenda and just two squares away from becoming her clone.  Henry must now risk running the gauntlet from the Wicked Witch.",
        "57... Qc2+ 58. Kh3 Qf2 59. d7 Qf1+ 60. Kh4": "60. Kh4 - can Henry still hide?  Also, he is taking a big risk going to the h file.  Also, here is a game (hope you can access this one) where my opponent did come to grief on that very column in a Q & P ending. http://gameknot.com/annotation.pl/caught-in-the-corridor?gm=8644.  Ion has commented on that one but perhaps you would like to add your own there!",
        "60... Qf2": "60. ...... Qf2 - better would have been Qf8.  I now find I can crown my pawn and although I anticipate black will take on h2 with check I have got that all covered .....",
        "61. d8=Q Qxh2+ 62. Qh3": "62. Qh3!! - just like this.  Either black trades and has to reckon with Glenda 2 or he plays Qg1 and it's Two against One.  Black does not like either scenarios so he waves the white flag.  My rating is at its highest, 1841, incredible that the Beginner with an OTB rating of BCF 75 (Elo 1200) which still stands now has got this far."
    },
    "url": "https://gameknot.com/annotation.pl/two-against-one?gm=26677",
    "gameName": "Two against One!",
    "players": "jstevens1 (1836) vs. NN (1672)",
    "opening": "Ruy Lopez (C78), Wing attack"
}