{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Bc4 Nf6": "Standard Two Knight's Defense.",
        "4. Ng5 d5 5. exd5 Nxd5": "Opening up to the the \"Fried Liver\" or Fegatello attack (which White plays). The attack by White is hard to meet and I would not personally consider trying it during tournament play due to time constraints and added pressure. However I felt confident that I could meet the challenge with enough time. ",
        "6. Nxf7": "\"Fried Liver\" attack. Black captures the knight with his king and white plays Qf3. ",
        "6... Kxf7 7. Qf3+ Ke6 8. Nc3 Ncb4 9. Bb3 Qf6 10. Bxd5+ Nxd5 11. Qxd5+ Ke7 12. Ne4 Qc6 13. Qxc6 bxc6 14. O-O": "Black is down a pawn and has weak structure, must put pressure on in the middle game to equalize. ",
        "14... Bf5 15. d3 Kd7 16. Re1 c5": "I was unsure what move to make before I settled on this. I want to bring my king to the queen side of the board, where white has more pawns. I was worried at first but then noticed that after 17 Nxc5  Bxc5 18 Rxe5 Rhe8 ensures that black cannot capture a bishop due to back rank mate. ",
        "17. Nxc5+ Bxc5 18. Rxe5 Rhe8": "Now we see a more told advantage to black. While material points are equal, black has the bishop pair where as White's points come in pawns. Black's king is ready to join the fight and he is more developed overall. ",
        "19. Bf4 Rxe5 20. Bxe5 g6 21. Re1 Rf8": "Looking for the fork at f2.",
        "22. Kf1 Be6 23. d4 Bd6 24. Bxd6 cxd6 25. b3 Re8 26. c4 a5 27. d5 Bf5 28. Ra1": "Not sure whether white should have captured. The pawns may have told in his favor without a heavy piece like a rook to gobble them up. ",
        "28... Kc7 29. f3 h5 30. h3 Rh8": "Now if 31. g4 hxg4 32. fxg4 Bxg4 (and if 33. fxg4 Rh1 wins the rook). ",
        "31. Kf2 Rf8": "Now if 32. g4 hxg4 33. hxg4 Bxg4 and white cannot recapture due to the pin. ",
        "32. Re1 Kb6 33. g4 hxg4 34. hxg4 Bxg4 35. Re3 Bf5 36. Re1 Kc5 37. Re7 Kb4 38. Rb7+ Ka3": "Now White is destined to lose pawns and the bishop will start to toll in Black's favor once the board opens. White resigns. "
    },
    "url": "https://gameknot.com/annotation.pl/two-knights-defense-with-5-kt-x-p?gm=14373",
    "gameName": "Two Knight's Defense with 5...Kt x P",
    "players": "gm_lemoncake (1248) vs. concordborn (1440)",
    "opening": "two knights defence (C57), Fegatello attack, Leonhardt variation"
}