{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Bc4 Nf6": "The Two Knights Defense in Italian. Me and my opponent had some blitz quarrels over this, so we decided to settle the score in a regular game... Modern theory continues with 3. ... Bc5 4. c3 Nf6 5. d4 exd4 6. cxd4 Bb4+... Might follow 7. Bd2 Bxd2+ 8.Nbxd2 d5 9. exd5 Nxd5 10. Qb3, with a slight edge for white, however 7. ... Nxe4 8. Bxb4 Nxb4, poses white more problems... After 7. Nbd2 Nxe4 8. d5 Bxd2 9. Bxd2 Ne7 black is slightly better...\n",
        "4. Ng5": "We follow the main line. I need to study the Max Lange Attack with 4. d4 exd4 5 0-0 Bc5/Nxe4",
        "4... d5": "The Traxler variation continues 4. ... Bc5!? 5. Nxf7 Bxf2+!? And white might soon run into trouble, after 6. Kxf2 (Kf1 is probably best) Nxe4+...",
        "5. exd5 Na5": "After 5. ... Nxd5, black gets in trouble... The so called Fried Liver Attack (Fischer) continues with the temporary sacrifice 6. Nxf7!? Kxf7 7. Qf3+ Ke6 8. Nc3 Ncb4 (Nce7, d4) 9. Bb3 (stronger then Qe4, c6, a3, Na6, d4, Nac7, and black is better)... Much stronger is directly 6. d4 (Fischer), postponing Nxf7...",
        "6. Bb5+": "The Morphy variation continues 6. d3 h6 (Bb4+, c3, Nxc4 (Be7, d6!), dxc4) 7. Nf3 e4 8. Qe2 Nxc4 9. dxc4 Bc5 10. Nfd2 0-0 11. Nb3 Bg4 12. Qf1...",
        "6... c6 7. dxc6 bxc6 8. Qf3": "The Blackburne variation. I prefer this over the main variation with 8. Be2 h6 9. Nf3 e4 10. Ne5, or the Steinitz variation with 10. Nh3!?",
        "8... Qb6": "Black had better, in 8. ... Qd5 9. Be2 e4 10. Qg3 h5 11. Nh3... After 8. ... Qc7, still 9. Bd3 h6 10. Ne4, after 8. ... Rb8 also...",
        "9. Bd3 h6 10. Ne4 Nxe4": "Unsound. Better is 10. ... Nd5 11. Ng3 (f5 threatens) g6 12. Nc3 Be6",
        "11. Bxe4 Bd6 12. a3 Bd7 13. d3 h5": "It is not clear, what black tries to accomplish here. Correct is 13. ... 0-0 14. Bf5 (else f5) Bxf5 15. Qxf5 c5/e4... Bg4 is no threat to white, after Qg3...",
        "14. b4": "I preferred this over directly 14. Qg3 g6, after which b4 has no meaning left... We need to develop Bc1...",
        "14... Nb7 15. Qg3": "For obvious reasons, I preferred this over 15. Nd2 f5 16. Bxf5 0-0 (Bxf5, Qxf5, and white wins) 17. Bxd7 Rxf3 18. Nxf3 a5 19. Be3 Qc7 20. Be6+...",
        "15... O-O-O": "Of course, after 15. ... g6 16. Bg5 (also preventing h4) ... 17. Bf6, castling is no longer an option for black. But this is not better...",
        "16. Qg5": "Ties black up, threatening Be3, alongside Nb1-d2-c4... After directly 16. Be3 Qa6, Bxb4! becomes a threat, after 16. Nd2 f5 17. Nc4 Qc7 18. Bf3 e4 19. Nxd6 Nxd6 white might lose control...",
        "16... Rdf8": "Preparing f5...",
        "17. Nd2": "17. Be3 Qa6 18. Bf5 Bxb4+! 19. Nd2...",
        "17... f5 18. Bf3 h4": "Correct is 18. ... Qd8 19. Qe3 Qb6 20. Nc4 Qxe3+ 21. Bxe3 Bb8... 18. ... e4, is met with 19. Nc4 Qb5/Qc7 20. Be2, or 19. ... Qd4 20. Bb2...",
        "19. Bb2": "I liked this better, than 19. Qxg7/Nc4... Nc4 is a double threat, now...",
        "19... Qc7 20. Qe3": "20. Nc4 is met with e4, Nxd6+, Nxd6, Be2, h3, g3... 20. Qxg7 Rhg8 21. Qh6...",
        "20... Kb8 21. h3 Rfe8 22. O-O e4 23. dxe4 Bf4 24. Qe2 Bxd2 25. Qxd2 fxe4 26. Bd1": "I liked this better, then 26. Be2 e3 27. Qd4 exf2+ ",
        "26... e3": "Better is 26. ... Nd6 27. Be2 Nf5...",
        "27. fxe3 Nd6 28. Bd4 Ne4 29. Qe1 Rhf8": "The losing move. There was no better than 29. ... Ng3 30. Rf2 Rhg8 31. Bc5, or 30. ... Rhf8 31. Bf3...",
        "30. Rxf8 Rxf8 31. Qxh4": "Black resigns... After 31. ... Ng3 32. Bg4 Bf5 33. Re1, it is over..."
    },
    "url": "https://gameknot.com/annotation.pl/two-knights-defense-dispute?gm=41843",
    "gameName": "Two Knights Defense Dispute",
    "players": "vonbonkisback (1952) vs. davids (1906)",
    "opening": "two knights defence (C58), Bogolyubov variation"
}