{
    "moves": {
        "1. e4": "This game was over very quickly.  I underestimated the danger to my uncastled king when I tried attacking too soon.  My 11 yr old opponent quickly showed me the error of my ways.\n",
        "1... c5 2. Nf3 d6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 a6 6. Bg5 e6 7. f4 Be7 8. Qf3 Qc7 9. O-O-O b5": "So far, so standard.  My main alternatives at this stage were .... 0-0, ....Nbd7 and ....Nc6.  I chose this because I wanted to pin the e4 pawn against White's Q as quickly as possible and follow up with an attack on the Nc3.\n",
        "10. a3": "At the time, I felt that this was an over-cautious response from White.  It gives Black time to catch up a little on development.  In retrospect it was a good move as it inhibited Black's scope for counter-attack.\n",
        "10... Bb7 11. Bd3": "Having delayed the development of this B, White now uses it to reinforce e4, enabling his Q to move and therefore enabling a future pawn advance and/or attack on g7.\n",
        "11... Nbd7 12. Qg3 Nc5": "I have had some nasty experiences castling on either side in this sort of position.  However, I think I should have castled before playing this thrust as I soon fall prey to a devastating exploitation of my weak kingside.\n",
        "13. e5 Nxd3+": "I wanted to set up an attack on White's king as soon as possible.  This move started to clear the c-file for heavy piece action and removed one of the key defenders of c2, also allowing me to respond to White's attack on my KN with another attacking move.\n",
        "14. Rxd3 Ne4 15. Nxe4 Bxe4 16. Re3": "I thought this was a wasted move, as I'd expected the annoying 16. Rc3\n",
        "16... d5": "I was rather pleased with this establishment of the e4 outpost for my B but I'd overlooked something ...\n",
        "17. Rc3": "Now that Black has cut off his own B from its defence of the White squares on the Q-side, White lays claim to the c-file.\n",
        "17... Qb7 18. Bxe7": "With this exchange, White starts to break open Black's precarious position.\n",
        "18... Kxe7": "I preferred this to taking with the Q as it enabled me to connect my Rooks.\n",
        "19. Qxg7": "Not just pawn-pinching but starting the final demolition.\n",
        "19... Rhg8": "This fails to budge the Q and fails to prevent White's next move.\n",
        "20. Nc6+": "Black exploits the weak white squares and wins more material.\n",
        "20... Ke8": "Alternative variation: 20... Qxc6 21. Qf6+ Ke8 ( 21... Kd7 22. Qxf7+ Kd8 23. Rxc6 ) 22. Rxc6 \n",
        "21. Qxg8+": "White goes a rook up with mate to follow shortly, so I resigned.\n"
    },
    "url": "https://gameknot.com/annotation.pl/o-dl-witney-1-v-didcot-1-witney?gm=49113",
    "gameName": "O&DL Witney 1 v Didcot 1, Witney",
    "players": "Pavel Asenov (1674) vs. Robert Jacobs (1690)",
    "opening": "Sicilian (B99), Najdorf, 7...Be7 main line"
}