{
    "moves": {
        "1. e4": "A nice win from last night's league match.  I achieved better activity from the opening than I usually manage and converted it into a neat mating attack.  However, I think my opponent missed a few chances ...",
        "1... c5": "My usual Sicilian.",
        "2. Nf3 d6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 a6": "The Najdorf variation.",
        "6. Be3": "The English Attack",
        "6... e5": "Other choices: 6...Ng4 has been quite successful on Gameknot but I rejected it last night because I couldn't calculate a sensible follow-up; 6...e6 is more flexible but doesn't show much ambition; 6...g6 transposes into a Dragon; 6...Nc6 allows White to create an isolated a pawn.   There are probably lots of other reasonable tries as well...",
        "7. Nb3": "The usual response.",
        "7... Be6": "I usually play this quickly to cover the hole at d5.",
        "8. Bd3": "Doesn't look right to me as it allows the B less freedom of movement than 8. Be2.   However, it does over-protect e4, allowing the Nc3 to contemplate occupying d5 (or swinging via a4) to threaten b6.  In the past I've often suffered from White exploiting the hole at b6 with B and N.",
        "8... Be7 9. Qe2": "Unexpected.  I'm not sure of the point of this move, other than to over-populate the e-file.  Moving the Q off the back row allows castling either side, to keep Black guessing, and this possibly supports Bc4 but it is more usual in the English Attack to back the other B from d2.",
        "9... Nbd7": "I continue my flexible development, covering b6 and envisaging a possible future occupation of c5.  White's quiet opening moves have allowed me to develop in peace.",
        "10. f3": "This usually comes earlier: either before Be3 or just after, to prevent ...Ng4 from disturbing the Be3.  Now it signals a probable kingside pawn storm with g4 threatened.",
        "10... Qc7": "So I prepared the possibility of castling queenside with this normal developing move.",
        "11. g4 Nb6": "Providing a retreat square for the Nf6 if White plays g5 and also preparing a possible advance of my d-pawn.",
        "12. Nd2": "Not sure about this retreat.  Presumably he wanted to prevent an advance to c4 by either my N or B but I wasn't contemplating that anyway - perhaps I should have been.",
        "12... d5": "A critical move.  I wanted to castle but didn't want to commit to one side or the other too early.  Kingside castling would have played into the hands of the expected pawn storm.  Queenside didn't look much safer, given the flexible central deployment of all White's minor pieces.  It goes against opening principles to move this pawn twice before I've castled but there are good concrete reasons to do so: it frees up Black's position, getting rid of the weak backward pawn, which is not currently required to defend e5, and threatens to fork the Nc3 and Be3, with a bind on White's position.  White is in no better position than Black to attack the uncastled King.",
        "13. exd5 Nfxd5": "By retaking with this N, I evade the threated attack from g5 and threaten to exploit the holes in White's kingside by ...Bh4+.  This is also a much better square for the N than the originally planned retreat square at d7, as it dominates the board, whence the N can either swap with one of White's minor pieces or move again to threaten mayhem on white's second rank.",
        "14. Nxd5 Nxd5": "Now I'm feeling very comfortable.",
        "15. a3": "Clearly White was worried about ...Nb4 or Bb4.",
        "15... Nxe3": "I decided that now was a good opportunity to eliminate White's powerful black-square B, allowing me to castle more safely.  At this stage, my opponent had 61 minutes left, I had 69.  By the end of the game, he had 3 and I had 40.",
        "16. Qxe3 Bc5": "Probably my longest think of the game as I spent a long time examining 16....Bh4+, which would have prevented White from castling but I couldn't see a good way to attack the K on e2 and, indeed, I would have been helping White to connect his rooks for a more efficient attack.",
        "17. Qe2": "I thought 17. Qe4 was better here but perhaps White wanted e4 for his N.  17. Qg5 was also an interesting possibility, which I planned to answer with 17....f6.",
        "17... O-O-O": "My head buzzing with possibilities, I decided first to secure the position of my K and render White's kingside gesture irrelevant.  My opponent chuckled to himself at this point, in a way that suggested he should have seen this coming but hadn't.  I smiled back ... White cannot castle kingside at present, because of the Bc5 so ...",
        "18. O-O-O": "Now at last the battlefield is laid out.  Black has the more active pieces and the remaining moves of the game exploit this to the full.",
        "18... Rd7": "Preparing to double rooks on the d-file or, in due course, to replace the Q on c7.",
        "19. Nc4": "Freeing up White's position slightly and attacking e5.",
        "19... f6": "The alternative was to swap my white-squared B for the N but I wasn't keen on giving up the advantage of the 2 bishops and was happy enough to consolidate the centre.",
        "20. Rhe1": "White completes his development by centralising the KR but this reduces his mobility rather than increases it.  With 20. h4 and 21. g5, he could have started to undermine Black's centre or with 20. Bf5 he could have swapped off a piece or two, though the tactics could have got complicated.",
        "20... b5": "Shifting White's most active piece at the expense of loosening Black's king's position.",
        "21. Nd2 Kb8": "Prepares ...Rc8 with a battery down the c-file and allows my white-squared bishop to vacate the h3-c8 diagonal without allowing White to skewer R and K from f5.",
        "22. Ne4": "White quickly reactivates his N.",
        "22... Bd4": "I was somewhat worried around here by the possibility of Bxb5 followed by Qxb5+, when my R on d7 would have also been vulnerable, but I also surmised from my opponent's timid play to date that he wouldn't dare to play that.  This move avoids the swap on c5, occupies a lovely outpost and begins to threaten a direct attack on White's castled King.",
        "23. c3": "I'd expected this and was happy to ignore it, exploiting the pin by the Qc7.",
        "23... Rc8": "Completing my battery but unfortunately, with the N on e4 defending the pawn on c3, it is currently ineffective.",
        "24. Kb1": "Releasing the pinned pawn.",
        "24... Bb6 25. h3": "An irrelevant waiting move.  White is clearly reduced to wood-shuffling.",
        "25... Qc6": "Quietly manoeuvring my Q into a better attacking position and allowing the rooks to double up on the c-file.  This square is just a stepping stone...",
        "26. Nd2": "more shuffling ...",
        "26... Qd5": "Now a serious threat is emerging but with good defensive choices White should be able to counter the attack.",
        "27. Bxh7": "White captures an irrelevant pawn and perhaps hopes that I will overlook the Bishop's backward defensive possibilities.",
        "27... Rdc7": "Now all my pieces are nicely aligned to deliver the coup de grace.",
        "28. Ne4": "The N returns to its best square, defending c3 and revealing a discovered attack on Black's Q but it also cuts off his own B from the defence of c2 and b1.  I thought that the odd-looking 28. Nf1 might have held out longer, allowing the B to come back in defence.",
        "28... Qa2+ 29. Kc1 Bb3": "I'd been struggling to find a suitable follow-up to Qa2+.  This move covers c2, forcing White's K to d2 after the threatened check on a1, when a rook check on the d-file, or the captures of the b-pawn and c-pawn would be crushing.  It also threatens the R on d1 but I had eyes on mate, not material, at this point.",
        "30. Nd2 Rc7xc3+": "Now there is no defence, so White resigned."
    },
    "url": "https://gameknot.com/annotation.pl/o-dl-didcot-2-v-cowley-workers?gm=53019",
    "gameName": "O&DL Didcot 2 v Cowley Workers",
    "players": "Martin Colebrook (1586) vs. Bob Jacobs (1658)",
    "opening": "Sicilian (B90), Najdorf, Byrne (English) attack"
}