{
    "moves": {
        "1. e4": "Hi everyone!\n\nAgain it has been a long time before I have been in a position to annotate a game - I have been trying to keep up with my moves in my regular games, but now at long last an annotation and it is a victory for Yours Truly.  Very late on in the game, Glenda emerges from her defensive role, much to the chagrin of my team captain, Julia-Celine who just happened to be my opponent in this game.  Glenda was aided by a humble pawn which lured Julia's king into a mating net.  How did this happen?  Well, gameknot analysis is provided here for you guys to follow the game. http://gameknot.com/analyze-board.pl?bd=15957675&rnd=0.8891978702023171",
        "1... e5 2. Nf3 Nc6 3. Bb5": "3. Bb5 - I usually play the Lopez here if black plays his or her knight to c6 after a double KP opening.",
        "3... a6 4. Ba4 b5 5. Bb3": "5. Bb3 - pretty standard moves so far.",
        "5... Nf6 6. O-O Be7": "6. ..... Be7 - Julia opts for the Closed Lopez.",
        "7. Re1 O-O 8. c3 d6 9. h3 Bb7": "9. ...... Bb7 - Julia is ahead on development but it will be amazing how I will catch up over the next few moves.",
        "10. d4 Nd7 11. Nbd2 Nb6 12. d5 Nb8": "12. ...... Nb8 - retreat.",
        "13. Nf1": "13. Nf1 - now that black cannot easily pin my knight on f3 my other knight goes to f1 and possibly e3 or g3 to unblock Fou Lenoir's diagonal.",
        "13... f5 14. exf5 Rxf5": "14. ....... Rxf5 - pawn trade.",
        "15. Ng3 Rf8 16. Ne4": "16. Ne4 - I take the opportunity to improve the position of one of my knights.",
        "16... Nb8d7 17. Nfg5": "17. Nfg5 - with ideas of plonking my knight onto e6.  The knight will be well supported on that square provided that Fou Leblanc remains on the a2-g8 diagonal.",
        "17... Bxg5 18. Nxg5": "18. Nxg5 - although my knight has been traded for Julia's dsb another knight threatens a fork on e6.",
        "18... Qf6 19. Qc2": "19. Qc2 - the Wicked Witch of the West evades the fork but now Glenda threatens to come into h7 on her broomstick to deal death to the BK.",
        "19... g6 20. Qd2": "20. Qd2 - as Julia prevents the mate threat with g6, Glenda moves onto another diagonal hoping to get onto h6, exploiting the weak castled position.",
        "20... Nc5 21. Ne4": "21. Ne4 - attacking the Witch.",
        "21... Nxe4 22. Rxe4": "22. Rxe4 - forcing a knight trade.",
        "22... Rf7 23. f3 Raf8 24. Qd3 Nd7 25. Be3": "25. Be3 - after a load of prophylaxis (f3 to ensure Julia's heavies are biting on granite) I complete my development on move 25.",
        "25... Qg7 26. Qd2": "26. Qd2 - Glenda drops back and now I threaten an exchange winning skewer with Bh6.",
        "26... Nf6 27. Rb4 Re8 28. a4": "28. a4 - due to the pin on Julia's lsb I now threaten to win a pawn.  Not only that, I also threaten to open up the a file for my rook on a1.",
        "28... c6 29. dxc6 Bxc6": "29. ..... Bxc6 - I gladly traded off my weak d pawn and it now results in a chance to win the exchange which I do so gladly next move.  Beware of line openers!",
        "30. Bxf7+ Kxf7 31. axb5 axb5": "31. ...... axb5 - I now proceed with opening up the a column.",
        "32. Ra7+ Re7 33. Rxe7+ Kxe7": "33. ..... Kxe7 - one set of major pieces have been exchanged and I am the exchange up but after my loss against Expert Charles Higgie I am in no mood to count any chickens!",
        "34. c4 bxc4 35. Rxc4": "35. Rxc4 - this pawn trade has resulted in me getting a passer on the b column.",
        "35... Bd7 36. Rc7": "36. Rc7 - pin.",
        "36... Qf7 37. Bg5 Qe6 38. Bxf6+ Kxf6": "38. ...... Kxf6 - I follow through with the principle, if ahead on material, trade pieces.  Now Glenda comes into Julia's arc.",
        "39. Qh6 Bb5": "39. .... Bb5?? - this is a blunder of which Julia will have to give up her queen to avoid mate.",
        "40. Qg7+": "40. Qg7+ - the start of a deadly king hunt.",
        "40... Kg5 41. h4+": "41. h4+ - Julia resigned on the grounds of Unavoidable Mate after I announced #4 and gave a few variations.  I will leave you dear readers to work out the denouement and put your answers on a postcard.  Hopefully I will have some more games to post after Christmas.  Until then, bye for now - Joanne"
    },
    "url": "https://gameknot.com/annotation.pl/of-pawn-sacs-and-mating-nets?gm=42356",
    "gameName": "Of Pawn Sacs and Mating Nets",
    "players": "jstevens1 (1759) vs. cheeky_knight (1616)",
    "opening": "Ruy Lopez (C70), Graz variation"
}