{
    "moves": {
        "1. e4": "\"Best by test\" RJF; but completely against standard anti-computer method which suggests that more closed positions are enjoyed less by electronic players than a fully open and tactical game ... which 1.e4 can often and easily lead to. \n\nBonus Question~! ... Can you remember the Name of the Robot on Lost In Space? \nAnswer on final page\n",
        "1... Nc6": "Ah, a Nimzovich Defense ... which has a reputation of potential to become somewhat cramped, develop into something less than a fully open tactical melee'. ",
        "2. d3": "Since my opponent was kind enough to enter a semi-closed defense, I will make the concession of playing d3 instead of d4, to help him keep it from becoming semi-open :) ",
        "2... e5": "Bonus Question 2: Do you know the name (alpha-designation) of the computer on 2001 A Space Oddessy, the same as a player I once met for Postal Chess in APCT, who i am told was a programmer of the first real computer ?  ",
        "3. f4 exf4 4. Bxf4 Bd6": "4....Bd6? is rather unsightly after the Bishop trade-off but Black has no concern \nabout it or else might have tried to correct the doubled-isolani situation or avoided allowing it in the first place~! \n    But this is all part of the freedom of expression which the programmers wished to inculcate into their brainchild. As explained in its paperwork, it does not use an opening book, but rather calculates each move to its own tastes & satisfaction. ",
        "5. Bxd6 cxd6 6. Nc3": "To help Black maintain his doubled-isolani situation as long possible, I try to hinder the pawn advance of ...d5. Also, according to Nimzovich (somewhat ironically considering it IS being used vs His Defense) the d5 square is a natural for a Knight blockade, and almost begs to be occupied. Unfortunately for Black, this game never really comes to a point where WT is going to consider winning of blockaded pawns . . . ",
        "6... Qa5 7. Qd2 h6": "How very Human~! Even to the point of making me wonder WHY such a move has been played . . .  \nPardon me please, I'll be right back as soon as I turn down the volume on my Target-Acquisition-Sight. I'll be getting \"TONE\" for the rest of the game now.  \nUnfortunately, I'm sure that even a Chess Box would not dare to O-O into my line of fire there now . . . \n\n",
        "8. Nf3 Nf6 9. Be2 Ne5": "Now he does present me with the opportunity to help undouble his d-pawns if I want to trade Knights on e5. But there is really no incentive to do so, since his Knight is very tame and well-mannered, with no where to go really. ",
        "10. O-O": "Offering Black the b-pawn; commonly called the \"Poisoned-Pawn\" in the Najdorf Sicilian. Will it prove as unpalatable here as in that opening? We'll see soon enough. ",
        "10... Qb6+ 11. d4": "Rather than trying to tempt him into 11.Kh1 Neg4, at which point his knight should realize that it has no place left to go after 12.d4, threatening to threaten a possible 13.h3, or even 13.Nh4 is interesting. But actually I Want our mechanical friend to take the b-pawn, where his Queen will be assured of becoming absolutely useless in any capacity except being another target. One that ends-up yielding several nice tempii later, before allowed to rest. ",
        "11... Nxf3+ 12. Rxf3 Qxb2": "Now with the b-file open, the thought of playing ...b6 & O-O-O cannot be very appealing to BL anymore. \n",
        "13. Rb1": "13.Rb1 ! \nI consider this quite a useful attack-in-passing, upon the BL Queen.  Whilst underway toward its real outpost assignment, to double on the f-file, the Queen's Rook takes a move to drive the WT Queen to the a3 square where it will be more accessible to future attacks upon it; perhaps by Nb5, Rb3 or some other Rook lift.  And such does turn out to be the case . . . ",
        "13... Qa3": "Note that 13. ... Nxe4? would fail since the Knight could be immediately pinned to BL's King by 14.Re3 ; leaving the WT Queen safe, while the BL Queen must run from the attack upon it despite a Knight en-prise. ",
        "14. Rbf1": "In a serious game, I would have made sure to review my Queen-side to be absolutely certain that the BL Queen could not be trapped & captured there (Nb5 with threats of Nc7+ and too Ra3 or Rb3, looks tough. The b2 square may give flight to the Q tho.)  But right now it is play by instinct and those are all pointing to King Hunt; a primal urge~! \n   }B-O   ... calling for a ululating Tarzan yell; to start The Hunt for\n                  The King Without A Castle. \n\n",
        "14... O-O": " ? ?! !?!  ???!!?? ??? ! ???? !! ?????  ?!?  ??!!?? ?????????????????????????????\nWHAT~!?/???  \nWhat is he DOING, trying to hide behind my Targets ?!? \n",
        "15. Rf3xf6 gxf6 16. Nd5": "Striking out at both the e7 and f6 squares with this powerful knight~! WT plays to finish-up this game, without allowing any significant counter-play from now on.\n \n",
        "16... Kg7 17. Rf3": "Now comes the anticipated tempo-gain from WT Queen ... very conveniently timed for WT's purposes :)",
        "17... Qxa2 18. Rg3+ Kh7 19. Nxf6+ Kh8 20. Qxh6#": "At this point my whirling, swirling opponent announced that White Has Won. ...\nThen accused me of using Human-moves! ... of receiving them from GM Kramnick, whilst he hid in the Rest Room dressed incognito as an extra-large pawn for playing  Lawn-Chess. OK, caught me on that one! \n\n(However, it was NOT the former WC; but rather George Michael Kramnick, known as the Singing Chessman of Happy Hollow, and ... Oh never mind, I cannot tell a lie. The stupid moves WERE mine )\n\nANSWER to Bonus Question: And I gave you a little hint in the Question, if you caught it ... Its name was \"Robot\" ! [NO, it was Not Robbie Robot. Robot actually had a fight with Robbie Robot in one of the episodes, shooting sparks and such. Robot had the head that looked like a round fish bowl (and may Have Been, since Beach Balls were used as land mines) whereas Robbie had the head shaped like an indoor mini-solarium (and may Have Been, since Robbie is even older than Robot; and a movie star btw) , rather parabolic. Robbie won the first round and shut him down, but I think Robot got him in the end~!? In any case, Robot lives] \n***\nANSWER to Bonus Question 2: Hal  [ Okay, lay it on me if I'm wrong or missed some numbers :) ]"
    },
    "url": "https://gameknot.com/annotation.pl/offhand-otb-online-game-vs-a-box?gm=11558",
    "gameName": "Offhand OTB/Online Game vs a box",
    "players": "ccmcacollister (1855) vs. Thinking Machine 4 (1200)",
    "opening": "KP (B00), Nimzovich defence"
}