{
    "moves": {
        "1. d4 Nf6 2. c4 d6 3. Nc3 e5": "Black's bold attack on the center offers the tempting opportunity to displace the Black King. Surprisingly, the results are not bad for Black. While less experienced players might assume 4 dxe5 gives White a big advantage,  according to the DB, if White plays 4 dxe5!?, the practical results actually favor Black, W 29%, B 34%, Draw 35%.  ",
        "4. dxe5 dxe5 5. Qxd8+ Kxd8 6. Bg5 c6": "Part of Black's plan. ",
        "7. Nf3 Nbd7 8. O-O-O Kc7": "Black's King is safe, for now. ",
        "9. Bxf6": "Doubled pawns but at the price of a DSB and more protection for e5.",
        "9... gxf6 10. g3": "Increases the scope of White's LSB. ",
        "10... Nc5": "Black begins to provoke.",
        "11. b4": "White drives away the N but weakens his pawn structure and enhances the scope of Black's bishops. This plan seems premature. ",
        "11... Ne6 12. a3 a5": "Here, 12...a5! demonstrates the surprising dynamism left in the position.",
        "13. Ne4": "Creates complications, but not necessarily favoring White.",
        "13... axb4 14. axb4 Bxb4 15. Nxf6": "So far, White's plan seems reasonable, the e5 pawn is under attack and White has a N on the 6th rank. White does not forsee Black's 16th move.",
        "15... Ra1+ 16. Kc2 Nd4+": "16 ...Nd4+! turns the tables.",
        "17. Nxd4 Rxd1 18. Kxd1 exd4": "The smoke has cleared, and Black has come out well, with the bishop pair in an open position and slightly better development and chances on the Qside.",
        "19. Bg2 Be6 20. Be4": "White tries to retain material equality since the c4 pawn was not defendable.",
        "20... Bxc4 21. Nxh7 Ra8": "Black exploits the lead in development and bishop pair, even though the game is still even materially in a near endgame White faces a strong attack.",
        "22. Ng5 Ra1+ 23. Kc2 Ra2+": "The game is still even materially, but my higher rated opponent resigns. Can you see why?"
    },
    "url": "https://gameknot.com/annotation.pl/old-indian-attack?gm=22334",
    "gameName": "Old Indian Attack",
    "players": "NN (1698) vs. dmaestro (1576)",
    "opening": "Old Indian (A54), Ukrainian variation"
}