{
    "moves": {
        "1. b4": "This is a game I played a little while ago where I neglected the safety of my King - and paid the ultimate price for my folly. Listen close and pay heed, for ultimately this - the safety of the kings - are the alpha and the omega of the game! So this then, though a cautionary tale, should not be read to mean that you should just cover in the corner like a frightened rabbit. Far from it! But it is better to attack from a strong position than from one riddled with weaknesses...",
        "1... e5": "So, I play the Sokolsky here - 1.b4. It is, to put it mildly, a somewhat uncommon opening choice. It is the 6th most common opening move here on GameKnot, but considering the enormous preponderance of 1.e4 and 1.d4 that still translates to barely 1/2 of a percent of all games played.... Somewhat surprising, actually, as it is eminently playable. Anyway, enough advertising! My esteemed opponent choses the standard reply here: e5.",
        "2. Bb2": "One of the hallmarks of the Sokolsky is this development of White's DSB (dark-squared Bishop). And indeed, somewhat in contrast with other openings at his disposal, White will often see his queenside developed a bit faster and easier than his kingside. Or, stated differently: I need to be a bit careful with the safety of my King here, as it is likely to remain in the center for a little while until I can get those other kingside pieces of the way. And the more so as I will almost invariably find myself castling short because the queenside is definitely unsafe now (after 1.b4).",
        "2... Bxb4 3. Bxe5": "I trade a flanking pawn for a center pawn and will now proceed to prove that this is to my advantage. Or that at least is the general idea...",
        "3... Nf6": "Notice how Black is already ready and primed for castling, while I have achieved nothing whatsoever on that front? In *principle* I may be correct in my claim that exchanging the b-pawn for a center pawn is a very good trade ... but Black has excellent compensation for that (minor) loss: my King is still far from safe and any kingside development will take quite some time yet.",
        "4. c4": "The GK engine claims this is a mistake (it prefers 4.a3 instead), claiming a Black advantage after 4.c4 O-O 5.Nc3 Ng4. But I don't intend to follow that line at all...",
        "4... O-O 5. a3": "Forcing Black to choose between keeping his Bishop on the a5 diagonal or retreating it towards e7. The position requires this (the alternative would give Black good attacking prospects on the kingside), but notice something? I still haven't developed a single kingside piece, while Black is all set to start brawling! Yes, I do have some advantage in the form of space and mobility, but that kingside is already causing me plenty of grief.",
        "5... Be7 6. Qc2 Nc6 7. f4": "This may not be the most accurate move in the position; in general I should keep the f-pawn fixed on f2 in order to keep my kingside as sturdy as possibly. Now, I will have to be on a constant lookout for bad things that might happen on h4 and f2. But on the plus side, this does give me more space on the kingside, making it a bit more difficult for Black to start something there, and it anchors the Bishop while denying e5 for the enemy Knight. Black can hardly afford to trade the Bishop, as 7...Nxe5 8.fxe5 Ne8 (where else?) looks pretty awful for him.\n ",
        "7... d6": "Kicking my Bishop away while opening lines of development for his own LSB.",
        "8. Bb2 h6": "Throughout the whole game Black remains very conscious of the safety of his King. Though this move may feel a bit excessive (I have hardly any threats in that direction yet), the point here is just as much to create some 'luft' (air) around the King (thus preventing 8th rank mates), as it is to take away control of g5 from White. This makes it a very useful waiting move in many positions, and indeed you will want to do something like this relatively early in the game, for you will often find that it is far too late to do this once things actually starts heating up! If you play through some grandmaster games from the last 20 years or so, you will find that this kind of move is very common quite early in the game! So, pay heed and remember this - give your King a bit of 'luft' to avoid finding him strangled later on ...",
        "9. e4": "Well, that pawn needs to move somewhere or the Bishop on f1 is never going to go away ... and this does create a rather impressive center presence! On the other hand, if you pointed out that my center is actually a bit shaky (those 4th rank pawns have little or no actual support) and that Black's position is quite solid, you would be quite correct in that too ...",
        "9... Re8": "A good tip: always move your rooks so they can take advantage of open and half-open files. Like Black is doing here.",
        "10. d3 d5": "The proper response! Black is challenging my center - but only *after* ensuring the safety of his own King. Doing it earlier would have been a mistake, as I might then have used my advantage of space of mobility to threaten his King and win additional tempi - and more force to my attack. Now the tables are nicely turned - my King is still in the center and finding himself more and more exposed by every move ...",
        "11. cxd5 Nxd5": "I have neglected the safety of my King and now I am starting to pay the price. Opening the e-file, with that rook pointing straight down the throat of my exposed King, would be sheer suicide now. 12.exd5 Bb4+ 13.Kf2 (13.Kd1 Re1#) 13...Qe7 14.Qc1 Bc5+ 15.d4 Nxd4 and things just go downhill from there...",
        "12. Ne2": "Too little, too late. The GK analysis engine gives Black a rather impressive +2 pt advantage here, based purely on the positional aspects of the position (meaning: my exposed King!) Or rather, after this move - which is a blunder quite in its own right - Black's advantage is actually more like 4½ pt! (due to lines like 12.Ne2 Ndb4 13.axb4 Nxb4 14.Qc3 Nxd3+ 15.Kd1 Nxb2+ etc.) Luckily for me he misses this - though, more to the point, so do I too or I would have moved 12.Nf3 instead! The idea behind the Ne2 move is rather simple: I need to shield my King from that rook on e8, and now the Knight has to move away from d5. It still would have been better to do Nf3 followed by Be2 however, as then I could at least have castled ... which would really have proven a big, big help later on!",
        "12... Nf6 13. Nd2 Ng4": "So, notice how f2 is really, really weak now that the f-pawn has moved away to f4? Like it's a great, big, ugly, gaping hole in my kingside position!? Well, that's what happens when you move those f-pawns away and then allow your King to just stand there ...",
        "14. Qc3": "Ok, threatening mate now ... that's better, yes? Means I have finally equalized and can forget about that pesky king-being-all-exposed thing?",
        "14... Nf6": "Well, yes. Kind of. But only because Black really missed his big chance after 12.Ne2 ... and though I do get some rather active play against the weakness in his own kingside now (namely: the long diagonal pointing straight at g7), that just means that for now the position is roughly even. If my King had been tucked safely away, as it ought to have been, I could have claimed a solid lead ...",
        "15. h3": "Creates a new weakness on g3 and weakens h4 even more. But it does have the advantage of taking away g4 from the enemy Knight - as long as he does not simply sacrifice it and follow up with tactics based on the h4 check! More things to worry about and keep track of ... It is quite possible that simply castling long would have been significantly better, all in all: that at least would have brought the King away from the threats on the e-file and activated the rather moribound Rook on a1 (with the additional bonus of actual threats against Black's Queen too).",
        "15... Be6": "... though moves like this was exactly the reason why I decided to let the King stay put on e1 just a little while longer. If White had some pawns in place on , say, a2 and b2, then castling long would have been a no-brainer. As it is, a long castle would simply exchange an extremely unsafe position for a very shaky one: better, but not really good.",
        "16. g4": "In for a penny, in for a pound ...",
        "16... Bd6": "The GK analysis lets Black do this without even hinting at any questionmarks... which might seem awfully odd considering that I can now fork his Knight and bishop simply by moving e5! But guess what? Those holes and weaknesses around my King - the consequence of stupidly letting him stay put in the center - they make the whole idea impossible! 17.e5? Nd5! 18.Qc2 Qh4+! 19.Kd1 Ne3+ and I might as well resign.",
        "17. d4": "But now, surely I must be able to fork something! I have two (2!) potential forks going: e5 and d5. He cannot possibly escape them both ...",
        "17... Nd5": "Right. Instead he can do this. And now 18.exd5 Bxd5 19.O-O-O Bxh1 20.d5 Qf6 (forced or mate on g7) 21.Qxf6 gxf6 22.dxc6 Bxc6 would mean playing against his pair of Bishops in a very open position - which would clearly favour him.",
        "18. Qf3 Nf6": "And now I stumble a bit. GK correctly flags this as an 'inaccuracy' and gives this, very instructive line as the alternative. It's probably not entirely correct (the GK analyses gets less precise towards their end), but the general idea is clear - and it shows again very clearly the consequences of having literally no protections in place around the King: here it let's Black get out of what would otherwise have been a hopeless bind. 19.Bg2 Na5 20.d5 Bd7 21.e5 Nxd5 22.Qxd5 Bc6 23.Qxa5 Bxg2 24.exd6 Bxh1 25.dxc7 Qh4+ 26.Kd1 Qxh3",
        "19. d5": "Aiming for a material bonus to offset my positional disadvantages.",
        "19... Nxe4 20. Qxe4": "A general tip: do try to avoid placing the Queen on an open file with the King behind her and an enemy Rook in front ... Those things are bound to cause grief - which is precisely why Black chooses to let his Knight capture here rather than on, say, d5.",
        "20... Bb4": "The bishop on e6 is untouchable, as 21.dxe6 Qxd2+ would make my position (even more) awful. And 21.axb4 is also firmly in no-go land after 21...Bxd5 22.Qc2 Bxh1 23.Qc3 f6 where I may have achieved material equality but is strategically lost.",
        "21. Qc2": "This, on the other hand, is even worse ... considering how this ends, I really do think I should just have captured on b4 immediately. The reason I didn't: those three pawns on his queenside were just going to roll down and squash me then, considering that I haven't a shread of shielding in front of my King over there on the queenside.",
        "21... Bxd5 22. axb4": "Finally deciding to sacrifice the rook in order to get the King away from that e-file.",
        "22... Bxh1 23. O-O-O Nxb4": "Black is at +2 materially, and plus something innumerable strategically. GK evaluates his advantage to +2.75, but that is definitely too low. I could just as well have resigned here, as the total lack of (pawn) protection for my King, coupled with those open d- and e-files and the linked queenside phalanx of pawns, ensures Black an easy victory.",
        "24. Qc4 Nd3+ 25. Kc2 Nxb2": "Neatly removes the most efficient piece remaining to me.",
        "26. Kxb2 Bf3 27. Kc1": "Both Knights were pinned.",
        "27... b5": "Sacrifices a pawn to open the b-file.",
        "28. Qxb5": "Capturing here is suicidal as the open b-file directly next to my exposed King means mating threats will now come quick and thick. But on the other hand, I cannot ignore the coming avalance either...",
        "28... Bxe2 29. Bxe2 Qf6 30. Qd3 Rxe2": "The coup-de-grace, utterly isolating the King from my remaining pieces.",
        "31. Qxe2 Qc3+": "A neat, very direct and totally deserving defeat. I violated several tenets in this game, and most importantly: I began operations against Black *before* ensuring the safety of my King. I will take pain to avoid doing so in the future!"
    },
    "url": "https://gameknot.com/annotation.pl/on-king-safety-i?gm=60492",
    "gameName": "On King Safety, I",
    "players": "rmannstaedt (1865) vs. railer_man11 (1834)",
    "opening": "Polish (Sokolsky) opening (A00)"
}