{
    "moves": {
        "1. Nf3 d5 2. d4 Bf5": "A weird outcome, just to test him.",
        "3. Nc3 e6": "Tempting him to Nh4.",
        "4. e3 a6": "Still waiting. The idea is to play c5 without fearing of intruders on b5.",
        "5. Ne5 f6": "Let's try to demostrate he lost a tempo and helped me. This is not true, but I wanted to try it anyway.",
        "6. Nf3 c5": "If I develop Ne2, this move is seriously delayed, with a low paced game involving Nc1, Ng3... too slow (and less known) for my taste.",
        "7. dxc5": "Thank you, white!",
        "7... Bxc5 8. Nh4": "OH, NOW! Well... Ne2 would have been fine, but after the exchange, my knight is poor a threat for white. So I go with the main plan.  ",
        "8... Bg6": "This loses a nice threat on c2, a bad loss. But opens the h column.",
        "9. Nxg6 hxg6": "Now, if Qg4, Ne2 and Kf2 will hold the position.",
        "10. Be2 f5": "Controls the white squares (g4 and I can wait for the exchange), and opens the way for the knight to f6, or to the queen. The good bishop for him to counter this is currently trapped...",
        "11. a3": "Struggling for developement. ",
        "11... Qc7": "Nice move. It threatens more than one thing. ",
        "12. b4": "And now you'll see why. White overlooked...",
        "12... Bd6": "But white missed the double threat. Bb2 was needed, accepting to lose the h2 pawn. ",
        "13. h3 Qxc3+ 14. Bd2 Qc7": "Where else? But this gave white strange ideas...",
        "15. Rc1 Nd7": "Unwise. But I calculated I will be able to hold. I was wrong. ",
        "16. c4 Qc6 17. cxd5 Qxd5": "Up here my calculations. Everything is covered, right?",
        "18. Bf3": "I foresaw Qb6, a4, Qb6... but it seemed too passive. I have a piece, for God Sakeness (as they say). So I went for ",
        "18... Qa2 19. Bxb7 Rb8 20. Bc3 Bf8": "When I found the necessity to play this (a couple of moves ago), I started to feel really worried. What an ugly position to be up a piece!",
        "21. Bc6 Rd8 22. Be5": "Aiming to c7, and it is difficult to see how to stop it. ",
        "22... Qxa3": "I could have played Nf6. But I was now one to check... maybe it whorts something (I was wrong). ",
        "23. O-O Ngf6": "No choice... to take the pawn now is useless.",
        "24. Bc7 Rc8 25. Bb7": "Let's give back material, and see if it is over (it wasn't).",
        "25... Rxc7 26. Rxc7 Be7": "This pretended to be wise: if Rc8+, Bd8. ",
        "27. Bc6": "This WAS mortal. ",
        "27... Qxb4": "No good, but what else? Rh4, maybe?",
        "28. Bxd7+ Kf7": "Better than letting the queen in.",
        "29. Rc6": "NO way to defend e6, so better I move it...",
        "29... e5 30. Be6+ Kf8": "The trick was Rc8+, Ne8... not such a big trick, indeed.",
        "31. Rc8+ Ne8 32. Qd7": "...because of this. Nice game, numbered friend. People must play like this..."
    },
    "url": "https://gameknot.com/annotation.pl/on-the-wrong-side?gm=42119",
    "gameName": "On the wrong side",
    "players": "0c70c4  vs. damalfi ",
    "opening": "Reti opening (A06)"
}