{
    "moves": {
        "1. e4 d5 2. exd5 Nf6 3. c4 e6 4. dxe6 Bxe6 5. d4 Bb4+": "The basic Icelandic gambit scenario. There are several improvements for white, this is the \"confident\" one...",
        "6. Bd2": "Black can't take the pawn d4 with the Q. After BxB, Qxb2 is refuted by Bc3. ",
        "6... Qe7": "Bxc4+(disc.) is theatened. If BxB, QxB+, Qd2, a5? gives black a nice game, despite the doubled pawns. ",
        "7. Qe2 Nc6": "My N is dreaming on c2+, and tempts white into the naive fork...",
        "8. d5": "On a blitz game, I'm not able to calculate everything, but I sensed the melee will come in my favour somehow. ",
        "8... Nd4": "The Q will be controlling c2+ AND shielding white from Bg4+. White tries to escape via...",
        "9. Bxb4": "I can't leave it as a Q's exchange, of course, I'm forced to go on. ",
        "9... Qxb4+": "White is forced to remove her Q or lose it. ",
        "10. Qd2": "My Q is inmune, due to Nc2+, NxQ. But in this case, I could just remove the B from e6 and save the day. Neverhteless, it would allow Na6...",
        "10... Nc2+ 11. Kd1 Qxd2+": "...and now I win the Ra1 AND I save my bishop. ",
        "12. Kxd2 Bf5": "...like this. Of course, white can try...",
        "13. Bd3": "And, incredibly, he does. Now, the wonderful consecuence of this is that my other N is ready to theaten... Nxf2+, winning the other R too... :-)",
        "13... Bxd3 14. Kxd3 Nxa1 15. Nc3 Ng4": "...I well know that Na1 is lost, and I won't spend time moving it. I'll let white spend moves for grabbing it. ",
        "16. Nh3": "The only sensible move. Now, we enter a very \"serious\" endgame. More strategic than tactic. But still, if I believe to the +1600' rating of my opponent, I should be a little proud of the outcome. Unfortunately, I doubt you can reach this rating being so unprepared on this opening. // Here, my K can go to d7. Somehow, I felt I had to spend my tempoes building some threat. The key must be the exposed position of the WK, so I have to open the game, using my R on the central columns. ",
        "16... O-O-O": "I'm not worried by Nb5 (a6).",
        "17. f3": "Expected. Nf6 doesn't convince me too much. True is that it controlles a possible c4. The check only helps his K to move away from my R's column... BUT WAIT, now I see that Ne5+ would have been almost a winner, after: 17... Ne5+, Kmust go to 18. d5 (or Nxc4). Rh-e8, and black threats c5+, Ke5 (forced, e.p. is impossible due to the Rd8), and black's attack seems unstoppable. Did I miss it? ",
        "17... Nh6": "My targets were g2 and e3.",
        "18. Rxa1 Rhe8 19. Ng5": "f6 is not possible due to Ne6. But after he takes on h7, f6 will make her lose the piece after Rh8.",
        "19... Nf5": "So let's take it, come on! Any of them. I'll sac a pawn but I'll conquer the e column and, possibly I'd be able to get both R on the 2nd rank. ",
        "20. Nxf7 Re3+ 21. Kd2 Rde8": "...unfortunately, my plan had a flaw. Can you see it?",
        "22. Ne4": "THis. Now my R is trappedd, and only my N prevents its death. It seems easy for white to force me to give back the exchange after g4, but it comes that after that move I can answer with Rxf3, preparing my revenge on Ne5. Very tricky, but when you are at my level, on a blitz, it was still thrilling. Will I lose this possible high-win? Will I be able to... throw it away?",
        "22... h6": "Trapping his other N, just trying to work out something against d6.... !!!",
        "23. d6 Kd7": "Of course not cxe6, Nxe6+, forking my R. ",
        "24. g4": "It seems fair Nxd6, KxR, NxN, but I had already considered...",
        "24... Rxf3": "Of course, I was very lucky, since my opponent didn't see Nc5+... and white wins! If my K can't stop the d pawn...",
        "25. gxf5": "Saved!",
        "25... Rxe4": "No fork in g5 (it was not a waste my pawn move). Now, white's pawns will fall like flies!",
        "26. dxc7 Kxc7 27. c5 Rxf5": "My +1600 had it for enough (Nd6 is not a real threat). Probably more dued to my opponent's light game than my ability. Sometime I had to be on the other side of a bad day's game! Thanks for reading!"
    },
    "url": "https://gameknot.com/annotation.pl/on-the-good-side-of-a-bad-day?gm=63319",
    "gameName": "On the good side of a bad day.",
    "players": "alexandra7243 (1606) vs. damafi (1502)",
    "opening": "Scandinavian (B01), Icelandic gambit"
}