{
    "moves": {
        "1. e4 c5": "I apologize to my opponent. On 1/17/09 when this game began, my rating was 1274 and our ratings were only 50-60 points apart, which didn't seem too significant. But now our ratings are nearly 700 points apart which is quite significant indeed. It led to a bit of a one-sided match. We played this open challenge game for nearly three months, averaging about 10 moves per month. In the future, I plan to avoid games with time limits of 14-days. I'm playing black and my opponent starts with the Open game so I respond with the Sicilian.",
        "2. Bc4 Nc6": "White's 2. Bc4 seems to have confused the Game DB but 2. Bc4 is called the Philidor Variation.",
        "3. c3 Nf6": "I don't have much on this opening line, so I'm playing on principle. Seems a good idea to develop a piece and threaten the pawn on e4 since white has deprived his queen's knight of it's favorite square.",
        "4. Qf3 Ne5": "A handy little fork that should drive the white queen to E2.",
        "5. Qg3 Nxc4": "Free piece. I'll bite - doesn't seem to be any overt reprisal.",
        "6. d3 Nb6": "On b6 the knight is a little out of the way, but not too bad, and here he doesn't restrict the d-pawn from getting into the thick of things - he even helps defend d5.",
        "7. c4 d6": "I'm not sure this was my best choice, but I wanted to get some play out of my queen's bishop before I play e6 and d5.",
        "8. h3 g6 9. Nf3 Bg7": "Clears the way for castling, and it was obvious this bishop would have had no chance to play along the a3-f8 diagonal for a long time to come.",
        "10. Ng5 h6 11. Nf3 e6": "Finally starting to work on d5. I considered 11. ... Nh5 which would force black's queen to h2, a very undignified square for a mighty queen (12. Qh4 loses to 12. ... Bf3). Then I decided against it in favor of attacking the center. Besides, playing the knight to attack the white queen would be much juicier if that pawn way up there at b2 were undefended.",
        "12. Na3 Nh5": "Yeah, then I did it anyway.",
        "13. Qh2 a6": "Don't want that knight on b5.",
        "14. g4 Nf6 15. g5 hxg5 16. Nxg5 Ng4 17. Qg3 Ne5": "This looks like a good square for a knight.",
        "18. f4 Nc6": "Or not. But now d4 is looking pretty good.",
        "19. h4 Na4": "Threatening the pawn on b2 with two pieces. White can defend it long-distance with 20. Rh2 or with 20. Qg2 (et. al).",
        "20. O-O Nxb2": "White didn't defend it, and now he cannot recapture with 21. Bxb2 because after black replies 21. ... Bxb2 black will be forking the knight and the rook. Further, white is threatening 21. ... Nxd3 followed by 22. ... Bxa1.",
        "21. Rb1 Na4 22. Bd2 Nc3": "Black's 7th consecutive knight move. Now the knight is forking the pawn on a2, the rook on b1, and best of all, the empty e2 square from which black would have the royal fork against white's king and queen.",
        "23. Bxc3 Bxc3 24. Rfc1 Nd4": "White's rook on c1 threatens black's bishp on c3, but black is again threatening the royal fork on e2.",
        "25. f5 Ne2+": "I have to give 25. f5?? a pair of ? for allowing the royal fork, and not even picking up the free bishop in the trade. I imagine the slow pace of the game lulled my opponent into overlooking the threat.",
        "26. Kf2 Nxg3 27. Kxg3 Be5+": "Time to save the bishop-who-should-be-dead.",
        "28. Kf3 Rxh4": "White probably didn't want to give up the h4 pawn. Now black has a way into enemy lines.",
        "29. Ke2 Qxg5": "Ditto.",
        "30. Rcg1 Rh2+": "Here white announced mate in 4 beginning with 30. Rh2+. If 31. Kf3, then 31. ... Qf4#. If 31. Kd1, then 31. ... Qd2#. If 31. Ke1, then 31. ... Qd2+ 32. Kf1 Qe2#. And finally if 31. Kf1, then 31. ... Qf4+ 32. Ke1 Qd2+ 33. Kf1 Qe2#. Instead of playing it out, white resigned."
    },
    "url": "https://gameknot.com/annotation.pl/one-sided?gm=23073",
    "gameName": "One-Sided",
    "players": "sugar7 (1215) vs. blake84120 (1903)",
    "opening": "Sicilian defence (B20)"
}