{
    "moves": {
        "1. e4": "I am white in this fast time control game. It shows how having more mobility for development is more important than a stupid pawn.",
        "1... c5": "This is the most popular response in Grandmaster games, but 1...e5 is the most popular amongst amateur games.",
        "2. Nf3": "Accurate developing move.",
        "2... g6": "Committing to a plan too early in the game can be dangerous. Black is committing to fianchettoing his kingside bishop on only the second move.",
        "3. d4": "Gaining more mobility for development.",
        "3... cxd4": "Slightly safer is b6, but it's also very passive and less exciting.",
        "4. Bc4": "One thing about me is that I don't like to waste moves taking pawns. I develop another piece while Black has yet to develop.\r\nOne might think Qxd4 is a good move since it attacks Black's rook while centralizing the queen, but it's a risky move so if you want to play it, do it at your own risk.",
        "4... Nc6": "Black could've held onto the pawn with 4...e5, and I can't play Nxe5?? because of Qa5 ! winning the knight. But it's okay, I don't want to waste a move taking the pawn anyway.",
        "5. c3": "I am giving up a pawn for more central space and mobility for development, plus another developing move. This will transpose into a variation of the Morra Gambit (e4 c5 d4 cxd4 c3 dxc3 Nxc3) but where Black has played g6, and playing g6 isn't good in the Morra Gambit, as you'll see.",
        "5... dxc3 6. Nxc3": "I have three very strongly placed pieces in the centre, plus a pawn and queen giving additional support. While all Black has is one piece developed and a cramped position. Playing this opening as White is risky because Black may recover and hold onto his extra pawn, but I love to take risks in chess since it makes it more fun.",
        "6... e6": "Controlling the d5 square, which I have four pieces attacking.",
        "7. O-O": "All my moves have been for development, so as a result of my pawn sacrifice, I can complete my development easily and all my pieces will have active squares, while Black is cramped and has to struggle to develop.",
        "7... d6": "Black needs to secure the squares on the third rank to make his position solid before he can comfortably complete development, but by then I'll have already launched an attack.",
        "8. Qe2": "Clearing way to bring my rook to the d-file. I shouldn't develop my queenside bishop yet since there isn't a clear place for it to be developed. I should develop my sharper pieces first and then a proper place for my bishop will come into play.",
        "8... a6": "Securing more squares.",
        "9. Rd1": "Black's main weakness in the Morra Gambit is having a weak d-pawn. If I can win Black's pawn, then material will be even and I'll retain a superior position.",
        "9... Qc7": "If Black leaves his queen on the original square, then I will have a lot of tactical threats on the d-file and dark squares, and Black's position will be even more cramped.",
        "10. Bf4": "Since my bishop doesn't have an active role yet, I decide to clear the way for my rooks to double on the d-file, while enticing Black to play e5, which will weaken the light squares in his position, especially d5.",
        "10... Nf6": "Black is barely starting to develop, while my already developed active pieces are reaching maximum attacking potential, and Black's position is cramped.",
        "11. Rd2": "Preparing to double.",
        "11... e5": "Black plays the tempting e5, weakening d5.",
        "12. Bg5 Nd7": "Black needs to be careful not to fianchetto his bishop because his d-pawn is very weak, especailly after I double my rooks on the d-file.",
        "13. Rad1 h6": "Remember this is a fast time control game, so Black doesn't have time to think of a way to improve his cramped position. He's just making fast moves that attack me.",
        "14. Be3": "I'm eyeing the weak square b6. When playing the Morra Gambit, always prey upon weak squares on Black's third rank.",
        "14... b5": "Trying to uncramp his position.",
        "15. Bb3 Qb8": "Black can't think of anything to do. This is because of his heavily cramped position.",
        "16. Nd5": "My knight is strong on the weak d5-square, while it joins with my bishop's attack on the weak b6-square.",
        "16... Bb7 17. Nh4": "I can freely maneuver my pieces to an attacking position, while all Black can do is maneuver his cramped pieces on his back ranks.",
        "17... Bg7": "Further weakening the d-pawn, but Black probably just wants to castle here.",
        "18. Nb6": "Attacking the weak d-pawn.",
        "18... Nxb6 19. Bxb6 Bf8": "Black's dark bishop is the only thing capable of defending the pawn, so Black cannot fianchetto his bishop like he was intending.",
        "20. Qf3": "Look how much territory and control my pieces have. Now Black has to struggle to defend f7. It doesn't really feel like I'm down a pawn.",
        "20... Rh7 21. Qf6": "I have a tactical threat of Nxg6 fxg6 Qxg6  winning the rook. Black tries to make a counter threat on the next move but it turns out to be a blunder. Blunders are common when you're in a cramped position and can't do anything. Black could've tried Rg7, which would leave me with a more complicated win that I would have to work harder for.",
        "21... Bc8": "Black thinks he is fine since he is attacking my bishop, but he is handing me an easier win, since he has overlooked my tactic.",
        "22. Bc5": "I am pounding on Black's weak d-pawn, and he cannot take because of Rd8  Nxd8 Rxd8#",
        "22... Qc7": "Black stops my threat of Nxg6 by moving his queen to the 7th rank to defend his rook.",
        "23. Bxd6": "Now that I have gotten my pawn back, I can be comfortable with my attack since Black doesn't have the pawn to compensate for his cramped position.",
        "23... Bxd6 24. Rd2xd6": "Now I'm attacking his knight, the only defender stopping my tactical mating threat on d8.",
        "24... Bb7": "Black defends the knight while adding another defender to d8.",
        "25. Nxg6": "It's time to break through to Black's hopeless passive cramped position and put him out of his misery.",
        "25... fxg6": "Black knew that if he declined the sacrifice, his misery would last longer when he's down a few pawns in a hopeless passive position. His first instinct must've been to accept it, giving me a faster more brilliant win.",
        "26. Qxg6+": "Now an array of tactical threats crush Black. Black has four legal moves, three of which will immediately lose material. Black chooses the one that doesn't lose material, and actually gets mated.",
        "26... Kf8": "Black probably overlooked my forced mate. He could've suffered longer with Rf7 Bxf7 Qxf7 Qxf7 Kxf7 Rd7  then Rxb7, which would leave me with a winning endgame, two rooks and an extra pawn against his rook and knight.",
        "27. Qg8+": "Annihilating Black's exposed king.",
        "27... Ke7": "Black tries to flee but.......",
        "28. Re6#": "He can flee no further. My active pieces have completed their tactical attack."
    },
    "url": "https://gameknot.com/annotation.pl/online-g-10-tournament?gm=3161",
    "gameName": "Online G/10 Tournament",
    "players": "bakerbaker (1795) vs. DonkeyKong (1643)",
    "opening": "Sicilian (B27), Hungarian variation"
}