{
    "moves": {
        "1. e4": "e4. Ah, my favorite opening. *cough* stupid d4... *cough*",
        "1... g6": "I think this is hypermodern. But the more normal response would have been 1. ... b6.",
        "2. d4": "Gain central space.",
        "2... Bg7": "Fianchetto-ing the bishop. All standard play here.",
        "3. Nf3": "Developing normally. A lot of times in hypermodern stuff, they try to pin the knight or something and pick up a central pawn.",
        "3... Nc6 4. Nc3": "I thought about d5, because then after  4. d5 Ne5 5. Nxe5 Bxe5 6. f4 I would have a lot of board control, but in doing so I would weaken my king side, and open up the long diagonal for his dark squared bishop. This maily develops, protects e4 for the future, and just gain more central space.",
        "4... e6": "Now d5 isn't really an option unless I did some weird line that I thought about at the time, but can not remember it at all right now. It had something to do with Qd2 then d5, then after exd5 i play exd5 winning the knight and/or bishop.",
        "5. Bc4": "After this move, i knew that ... d5 would come sooner or later.",
        "5... Nf6": "? At the local tournaments I go to, there is a person who plays hypermodern pretty much all the time. He is the only one there who ever does play it by the way. Whenever i play him, he always develops his knight on the fianchettoed side to the seventh rank. By going Nf6, he blocks his bishops and loses a tempo.",
        "6. e5 Ng8": "Poor knight, e8 and d7 weren't even options. =( the knight must be all sad face. Now i have both of his bishops kind of boxed in, although he can always fianchetto his LSB.",
        "7. Be3": "Preparing Qd2 with standard kingside pawn attack. however, he could always castle queenside, but then i would still have the minority pawn push.",
        "7... d5": "Saw it coming. ",
        "8. Bb3": "I thought about Bd3 or e2, but figured this would be better. I kinda didn't notice the knight.",
        "8... Na5": "Woops.",
        "9. Ba4+": "? No real point of this, just moved instinctively, hoping that maybe, just maybe he would block with his knight or his bishop. this just loses a tempo.",
        "9... c6": "best option",
        "10. Bb3": "Now i lose a tempo. i probably should have gone Qd2 and then after b5 go Bb3, but then his pawns would be threatening my queen side, where i planned to castle.",
        "10... Ne7": "Now his knight gets the right idea. My LSB isn't going anywhere, so he can ignore it for the time being.",
        "11. Qd2 Nf5": "Moving to a more useful square? Trying to trade off the bishop? No idea.",
        "12. Bg5": "I like my bishop though. I thought about Bf4, but there my bishop isn't useful. I was also looking at g4 to start the beginning of a king side pawn rush.",
        "12... Qc7": "Quick story time: I sometimes will be able to look 7 to 15 moves ahead and make the right decisions. this happens rarely though. With my ADHD, most of the time, i look ahead anywhere from 3 - 5 moves. I don't like long games, cause i can get bored... Here i was expecting 12. ... f6 13. exf6 Bxf6 14. Bxf6 Qxf6. My line of thinking went like this: I trade off his black squared bishop. yay! But then he is less cramped. A LOT less cramped. In the end this helped immensely.",
        "13. g4": "Bye bye Knight. Back to standing in front of the king!",
        "13... Nxb3": "Or you could take away my LSB  and ruin my queenside pawn structure, therefore kind of screwing up my castling ideas. Jerk. Oh well, that bishop wasn't doing much anyways.",
        "14. axb3": "I took a minute here trying to decide which pawn i should take with. If i did castle queen side, which i still planned on doing, i would have an open king if i took with the c pawn. I could always move to b1, but i would still be open. with the a pawn though, when i castle, i can move the king to b1 and i would be much more safe.",
        "14... Ne7": "Expected.",
        "15. h4": "PAWN STORM!!!!1",
        "15... c5": "?! this allows me to get an outposted knight. a very, very strong knight. However, got to give him some credit. He is aiming to bust open the center and get some counter-play. ",
        "16. Nb5 Qb6 17. Nd6+": "Ain't that just a stinka.",
        "17... Kf8": "?? this gives me a winning attack. Kd7 was the best move. Although i didn't see the \"free\" pawn, it was poison. After 18. Nxf7 Rf8, he wins material. {Insert correction that will undoubtedly come from Ionadowman here =P}",
        "18. Qf4": "Threatening mate in one, and he will have to lose material to protect his king, and his king can't even run away as fast as he can, although i probably could catch him because he's not the gingerbread man.",
        "18... f5": "an okay idea to stop the mate, one that i didn't expect. i was thinking that 18. ... Nf5 stopped it, if only temporarily, after 19. gxf5 exf5. {Insert another correction by someone else}",
        "19. exf6 e.p.": "Hooray for en passant! now he is forked and about to lose. ",
        "19... e5": "a worthy try, but it fails due to the power of double check.",
        "20. fxe7+": "UNLEASH THE FURY!!!",
        "20... Kg8": "Back you beast! back into your hole!",
        "21. Qf7#": "Kaboom. Hope you enjoyed this game and enjoyed finding my horrible mistakes like the community usually does. Peace =P"
    },
    "url": "https://gameknot.com/annotation.pl/online-rapid-game?gm=20164",
    "gameName": "Online Rapid Game",
    "players": "Jalis999 (188) vs. wimer  rooly (189)",
    "opening": "Robatsch defence (A41), Rossolimo variation"
}