{
    "moves": {
        "1. d4": "This was a game i recently played on playchess.com\nIt is a good example of how being aggressive pays off in otb chess, much more than correspondance chess.\nPlease leave comments using the new facility to do so. I haven't analysed very thoroughly, as this was more a game of instinct than calculated moves",
        "1... d5 2. Nf3 e6": "Planning c5",
        "3. h3": "Strangely quiet move",
        "3... c5 4. a3": "Another quiet move, better would be something like Nc3 or Bf4.",
        "4... Nf6": "Developing towards the centre still, starting to gain a nice advantage",
        "5. Bg5": "Good move, developing and attacking",
        "5... Be7": "Quietly defending, and developing a further piece",
        "6. Bf4": "A slightly strange move, retreating back for no apparent reason",
        "6... Nc6": "Continuing development towards the centre. ",
        "7. dxc5": "A reasonable move, though would have worked better had white kept his bishop on g5. Still it forces me to move my bishop a second time which is undesirable in the opening",
        "7... Bxc5 8. Nc3": "First big mistake. I suspect white is playing for a certain set-up, rather than playing against me.",
        "8... O-O": "Castle often castle early is the standard advice. I could have played Qb6 picking up a pawn, but in the heat of a blitz game i missed this.",
        "9. g4": "A very odd move, leaving white unable to castle kingside, and weakening his pawn structure.",
        "9... Qb6": "I find the move I missed last time, and overall i am in a much better position",
        "10. b4": "Defending the b2 pawn, however much better would have been e3",
        "10... Bxf2+": "I take the pawn and push right into whites territory.",
        "11. Kd2 Nd4": "I saw a chance to go on the offensive at this point. Better might have been Ne4 , but this offers the chance for white to make a mistake.\nIf white takes the knight then: 12. Nxd4 Qxd4 13. Kc1 Qxf4, leaves me a piece up and coasting to an easy win",
        "12. Ne5": "White sidesteps this trap",
        "12... Rd8": "Quietly setting up an attack rather than rushing in with Ne4 . This move means that the obvious response Nxe4 leaves an awkward discovered check after dxe4",
        "13. e3": "Probably the best move, trying to drive away the knight and releasing the bishop onto a good diagonal.",
        "13... Ne4+": "If this was a correspondence game i would most likely have analysed thoroughly and decided to quietly retreat. However a move like this is excellent for a blitz game with too many threats and variations to calculate besides the obvious.",
        "14. Kd3": "White assumed that he couldn't take the knight on e4, and certainly it looks bad after 14. Nxe4 dxe4 15. Kc1 (for example) Nb3 , losing the queen. However the computer suggests that it is the best move",
        "14... Nxc3": "This move was unnecessary, far better would have been 14...f6. This move reduces the number of pieces in the attack, thus reducing the threat the attack carries",
        "15. Kxc3 Bd7": "A quiet move planning to bring the final piece into play, the rook on a8. However it turned out to be a massive mistake as it left the knight en prise, and had white played 16. Qxd4 I would have been forced into a queen exchange, and lost the whole attack.",
        "16. Nxd7": "According to the computer this is the second best move to play, though during the match it was the only move I had seen",
        "16... Rac8+": "Following through with my plan without recalculating meant I didn't realise the knight could block this check.",
        "17. Nc5 Rxc5+": "Having committed so much into the attack already i decided to just keep pressing forwards, and what better way to do so than with an exchange sacrifice",
        "18. Kxd4": "A critical mistake by my opponent, had he taken the rook the position would be roughly equal although thats difficult to see in a blitz game. The move played allows my rooks to infiltrate and show how powerful they can be working together with the queen once most pieces have been removed from the board",
        "18... Rc4+": "Double check",
        "19. Kd3": "Ke5 gives mate in one",
        "19... Rxf4": "If 20. exf4 then 20...Qd4 21. Ke2 Qe3#",
        "20. Qe2": "White correctly doesn't take the rook, but better would be c3 to block my next move",
        "20... Rd4+": "Again white cannot take the rook without losing to Qxd4#",
        "21. Kc3 Rc8+": "Brings the other rook across to help close the net around the king. At this point my time was significantly low due to trying to calculate all the attacking moves. But from here my opponent finds he needs to take longer over his moves, allowing me some freedom",
        "22. Kb3 Bxe3": "If Qxe3 then Rxb4 wins the queen",
        "23. c3": "This move had me struggling for a few seconds until realising..",
        "23... Rdc4 24. Qf3": "A very strange move, and according to the computer even Qxe3 is better since checkmate in 8 is now possible",
        "24... Rc4xc3+": "Naturally",
        "25. Kb2 Bc1+": "Miscalculation under time pressure here. I thought i would win the queen, however...",
        "26. Rxc1": "Taking the queen now allows Rxc8 with a back rank checkmate.",
        "26... Rc3xc1": "So I remove the rook, winning the exchange instead",
        "27. Bd3": "Blocking my intended R8c2",
        "27... Qd4+ 28. Kb3": "Ka2 allows Qa1#",
        "28... Rc8c3+ 29. Ka4": "Under time pressure I missed the mate in 3 after Rxa3",
        "29... Rxh1": "I take the rook instead",
        "30. Qxh1 Rxd3": "Should have taken with the queen, but at this point all moves win",
        "31. Qc1": "Final gamble, hoping i would allow a backrank mate",
        "31... Qc3 32. Qxc3": "Taking the queen, and essentially resigning",
        "32... Rxc3 33. h4": "My opponent could have resigned, but he choses to prolong the match. I quickly push my d-pawn forward and close out the match",
        "33... d4 34. b5 d3 35. Kb4 Rc1 36. g5 d2 37. a4 d1=Q 38. b6 Rb1+ 39. Ka5 axb6#": "Quite a pretty finish, checkmate with the pawn. And overall a strange match, as i tend to be far more cautious early on in a match, and very rarely do sacrifices seem to pay off."
    },
    "url": "https://gameknot.com/annotation.pl/online-blitz-game?gm=9622",
    "gameName": "Online blitz game",
    "players": "Guest304288 (1600) vs. Guest297169 (1650)",
    "opening": "Queen's pawn game (D02)"
}