{
    "moves": {
        "1. Nf3": "Umm, I know this is a common opening, but I rarely ever play it. Also, in the annotation, if at any time i use [brackets], I'm asking for specific advice.\n",
        "1... c5": "I usually reply to 1. Nf3 with d5 or Nc6, so i decided to mix it up a bit.\n",
        "2. c3": "This confused me. Quite a passive play, aiming to set up a pawn at d4. Normally, people would respond with 2. c5, resulting in the symettrical english position, that I hate oh so much.\n",
        "2... d5": "Gain control of the center, also follows one of my other favorite openings, which i would say, but people would just tell me its a crappy opening.\n",
        "3. d4": "Contesting the center, as expected. Taking on d4, to either post a knight which could be chased away with e5, or take with the pawn, resulting in a semi-what symmetrical position [would that be an even position for black, or advantageous for white?]\n",
        "3... Nc6": "Put pressure on the d4 pawn, developing the knight, and if 4. dxc5 then 4. ... e5 [good idea?]. Kind of a flipped version of QGD. Or something like that.\n",
        "4. Bf4": "Preventing e5, develops the bishop, and prepares e3, to further fortify the d4 pawn and develop the LSB\n",
        "4... e6": "Protecting the c5 pawn, opening up my DSB, but sadly, blocking in the LSB.\n",
        "5. e3": "Expected.\n",
        "5... Nf6": "Developing, aiming for e4 if needed, but probably not.\n",
        "6. h3": "Preventing Ng4, which would have been useful later on. [Is this too passive for white?]\n",
        "6... a6": "Preparing b5 with the hopes of Bb7, to actually make my bishop useful\n",
        "7. Qa4": "Threatening Bb5, which will end up wrecking my queenside, and probably losing material.\n",
        "7... Bd7": "Preventing Bb5, and threatening a discovered attack, which wouldn't result in much at the moment, maybe just a single pawn, which might be useful. 7. ... b5 isn't an option due to Bxb5, and i can't take back because of the unprotected rook.\n",
        "8. Qb3": "Retreats to avoid the discovered attack, and attacking b7. [Poisoned pawn?]\n",
        "8... b5": "Preventing Qxb7, and gaining control of a LOT of light squares. [Would Na5 be better here?]\n",
        "9. a3": "Preventing...? I don't really know. Maybe preparing a future b4, preventing me playing b4. But it blocks in the Knight on b1, which could use a3 to develop quite nicely.\n",
        "9... c4": "And now the light squares belong to me. However, he does control a lot of dark squares, but he can't access them as well as I can access the Light Squares.\n",
        "10. Qc2": "Retreats, but aims at h7. Oh and did i mention i got quite a bit more space than he does?\n",
        "10... g6": "Preparing to fianchetto my bishop to g7. I viewed this as better than Be7 because it fortifies the kingside, and it is slightly more active than on e7. Plus it keeps the option of Ne7 followed by Nf5 or something like that. It also keeps the e7 square open for the queen, which can't use c7 due to whites DSB. [Which is better?]\n",
        "11. Nbd2": "Developing the knight, though not very well. It's hampered in. Too bad it can't get to c2 via a3, because then it could post on b4 and threaten me/annoy the crap outta me.\n",
        "11... Na5": "Maybe aiming to post at b3, or redevelop through b7. At c6, the knight's only purpose was prevent Ne5.\n",
        "12. Be2": "A weak development, but necessary. [Or is there something better?]\n",
        "12... Bg7 13. Ne5": "I fianchetto to be able to castle. White takes advantage of my momentary crampness, and threatens my beautiful bishop pair. However, in a position such as this, with such long pawn chains, knights might be better than bishops.\n",
        "13... Bc8": "I retreat to the only square that doesn't result in me losing my LSB. [Should i have traded?]\n",
        "14. b4": "Practically closes off the queenside, if i don't enpassant. However, the a3 pawn can still go a4 to break up that pawn chain a bit.\n",
        "14... Nb7": "Redevelop to the only square i could without losing material.\n",
        "15. a4": "Trying to break up my pawn chain, and gain more space.\n",
        "15... Nd6": "Making my knight much stronger, and if axb5, then i can take back with the Knight, and no major problems. Also threatening e4, though that doesn't do much.\n",
        "16. O-O": "[Should white have been more aggressive?]\n",
        "16... Nd7": "Threatening to get rid of the knight. However, I did notice c6 is open, but that doesn't do much for him.\n",
        "17. Ndf3": "Now if i take on e5, he just retakes and my problem remains the same.\n",
        "17... f6": "! First off, it chases away the knight. Second, after further chasing away the knight, i can push my e6 pawn, and win a lot of space, and an open f-file [Good move?]\n",
        "18. Nc6": "Expected\n",
        "18... Qc7": "Only safe move\n",
        "19. Na5": "Now the knight is a thorn in my side. However, a very tiny thorn, in my SIDE. It doesn't do much from there.\n",
        "19... e5": "Yay for pawn pushes! [Too agressive?]\n",
        "20. Bh2": "I think Bg3 might have been better. Keeps the bishop active.\n",
        "20... O-O": "May as well castle, if only to be able to retreat to h8 and get my rook on a potentially-half open file\n",
        "21. axb5 Nxb5": "Taking with the pawn would just create an open file, which would be quite annoying to defend with the knight on a5...\n",
        "22. dxe5": "Release central tension.\n",
        "22... fxe5": "A pretty strong center position, but slightly exposed king\n",
        "23. Nd4": "Taking advantage of the pinned pawn.\n",
        "23... Nb6": "Now i can just go Na4 to block up the a-file\n",
        "24. Nxb5 axb5 25. Rfd1": "Putting pressure on my slightly underdefended pawns, but also leaving f2 undefended.\n",
        "25... Bf5": "Finally get my bishop into play, gaining a tempo\n",
        "26. Qc1 Qd7": "Breaking the pin, but creating a new, but slightly less dangerous, pin in the process.\n",
        "27. Ra2": "Preparing to double his rooks on the d-file\n",
        "27... Rad8": "Guard the pawn even more, and activate my rook slightly more\n",
        "28. Rad2 Qf7": "Break the pin and threaten Bxh3 (which may not be very good) and threatens the f2 pawn\n",
        "29. Nc6": "Trying to activate his knight with tempo\n",
        "29... Rde8": "I could chase off the knight, and probably should have with Rc8 and then Re8.\n",
        "30. Qa1": "Making use of the open file?\n",
        "30... Na4": "Blocking any attempt at using the open file.\n",
        "31. f3": "31. Rxd5?? fails due to the overwhelming power of Be4. Either I'd win the rook for a pawn, or would have a very strong (and probably mating) attack.\n",
        "31... Bd7": "Chasing off the knight so the a-file would be blocked even more, and just getting rid of the annoying knight.\n",
        "32. Na5 Bh6": "Threatens Bxe3+ if the rook on d2 takes the d5 pawn.\n",
        "33. Rd2xd5": "Takes anyways\n",
        "33... Bxe3+ 34. Kh1 Nb6": "? Misses the fact that e5 is under-defended.\n",
        "35. Rxe5 Rxe5 36. Bxe5": "Removed some pressure, and got rid of his rook which was partially defending the kingside, and displaced his bishop which is, at least for now, an easy target\n",
        "36... Re8": "Aiming to attack the bishop of e2\n",
        "37. Bg3 Bf2": "Now my attack starts to show. With the bishop on d7 threatening Bxh3 which would move the pawn on g2, his king is not very well defended.\n",
        "38. Bxf2": "? allows me to get a very strong attack, but there was not much else he could do without losing material.\n",
        "38... Rxe2 39. Bxb6": "Although i'm down material wise, I have a very strong attack, and white has a semi-decent counter which could or could not work out.\n",
        "39... Bxh3": "!!\n",
        "40. Rd8+": "Now the start of the final retaliation.\n",
        "40... Kg7 41. Bd4+": "Trying to mate my king, or take another piece. Notice that the queen and knight are not very active as of this moment.\n",
        "41... Kh6 42. Qc1+": "Getting the queen into play\n",
        "42... Kh5": "! if 42. ... g5, then Rd6+ leads to a trade, in which i would come out on bottom.\n",
        "43. g4+": "Trying to corner my king enough to mate him\n",
        "43... Kh4 44. Kg1": "Qh6+ doesn't help. This at least prolongs it\n",
        "44... Rg2+": "I probably should have gone Qxf3, but it doesn't make much of a difference.\n",
        "45. Kh1 Qxf3 46. Qe1+": "Last ditch effort... There are many other ways that white could get a seemingly strong attack, but the all seem to fail. [Is there a way to pull it out of the bag for white?]\n",
        "46... Rf2+": "I've always wanted to checkmate someone while blocking check. Too bad it didn't happen here. Close though. This is where he resigned due to mate after 47. Kg1 Qg2#. Hope you enjoyed this game and were able to point out places where I would have been screwed over. Peace!"
    },
    "url": "https://gameknot.com/annotation.pl/online-20-minute-rapid-game?gm=24652",
    "gameName": "Online 20-Minute Rapid Game",
    "players": "tzsyu  vs. Jalis999 ",
    "opening": "Reti opening (A04)"
}