{
    "moves": {
        "1. e4": "White controls the centre and opens lines for development. I prefer the slower strategic buildup openings that arise from 1.Nf3",
        "1... e6": "The French Defense, Black wants to challenge White's pawn with d5",
        "2. d4 d5 3. f3": "The main lines to this opening are Nc3, e5, and Nd2. White has played f3? which loses a pawn because of dxe4 fxe4?? Qh4 ! but Baker planned to sacrifice the pawn anyway.",
        "3... dxe4": "Black probably thinks White will take e4 and Black will win it back with Qh4  with White's king in disarray",
        "4. Nc3": "This move transposes into a form of Blackmar-Diemer Gambit, but where Black has already played e6, so Bg4 is impossible.",
        "4... exf3": "Black immediately accepts Baker's sacrifice.",
        "5. Nxf3": "For compensation for the pawn, White has two developed knights and a strong pawn in the centre, while Black has no pieces developed.",
        "5... Nf6": "Trying to catch up in development so the extra pawn will be winning later",
        "6. Bg5": "White plans to play Qd2 O-O-O and start attacking Black's kingside",
        "6... Be7 7. Qd2 h6": "Pushing away the annoying bishop.",
        "8. Bh4": "White still wants his bishop on this diagonal in case Black moves the knight he can trade his bad bishop for Black's good one.",
        "8... g5": "Black weakens his position more in exchange for a tempo chasing White's bishop",
        "9. Bg3": "I thought Bf2 was better because Bg3 isn't as solid",
        "9... Nh5": "Or maybe Bf2 now",
        "10. O-O-O": "Baker doesn't like to waste moves and tries to develop as quickly as possible. Although leaving the bishop on g3 was a big mistake and is losing immediately.",
        "10... Nxg3": "Black wins at least a piece",
        "11. hxg3": "White probably thought the open h-file and Black's light square weakness was enough to compensate for his doubled pawns and lack of bishop pair, but Baker missed Black's tactic.",
        "11... g4": "Baker claims to be \"da masta\" of tactical play, but I can't believe he overlooked this when he castled queenside.",
        "12. Ne5": "When Baker showed me this position, he said he already saw Bg5 and would rather lose his queen for a bishop and still be active, than to defend passively down a piece for nothing. I must say that he has major guts, although losing the queen may actually be better since desperate times call for desperate measures.",
        "12... Bg5": "This guy may be expecting Baker to resign",
        "13. Ne4": "White will not resign this, he is going for a do or die attack against Black's centre and kingside, which appears as if it would fail, but the desperate attack left Black with a lot of blundering opportunities.",
        "13... Bxd2+ 14. Rxd2": "Obviously the correct piece to take with.",
        "14... f5": "Horrible. Black thinks he has already won the game, so his next moves were pointless, plus f5 weakens the light squares even more.",
        "15. Nc5": "Hitting the weak pawn on e6, but Baker's true intention was to get the knight to f4 to control the light square weakness",
        "15... b6 16. Ncd3": "White offers Black yet more material so he can play Ng6 Ndf4 with tempo and have a faster attack.",
        "16... Bb7": "If you ignore the fact that Black is  7 in material, his positional structure is garbage, and there are major weaknesses. Black may realize that now and didn't bother greedily taking the pawn.",
        "17. Nf4": "White's attack may be nothing, because Bc8 redefends the pawn. But White refused to resign, and Black's next mistake gave White a much better chance to steal the game",
        "17... Qf6": "Black is annoyed that Baker won't resign, and thinks any move is winning. But it is clear that Bc8 was totally winning and White hardly had any threats after that.",
        "18. Nh5 Qd8": "Black realizes his mistake and sends his extra queen home",
        "19. Bb5+": "A strong check by White",
        "19... c6": "Although it appears White has lost a tempo, c6 obstructs Black's position.",
        "20. Bd3": "White offers Black a pawn for more positional compensation",
        "20... Qxd4": "Black is a greedy fellow indeed. He has an extra queen and doesn't need to be snatching pawns with it.",
        "21. Re1": "White is fully developed and Black isn't.",
        "21... Qa4": "Black threatens to snatch another pawn, this time with a mate threat that would follow.",
        "22. Bxf5": "Here, Black's best move is to ignore the bishop and play Qxa2 because after Bg6  Ke7 it seems like White has no more threats, and Black is threatening mate. ",
        "22... exf5": "But Black thinks there is no way he could possibly lose this, and must've expected Baker to play Ng6  and win the rook, and Black's king appears safe. But when I see this move, I think, WHAT KIND OF IDIOT WOULD EXPOSE HIS KING LIKE THAT??????????????? Baker exploited this guy's stupidity over the next several moves",
        "23. Nxc6+": "Black should've considered all checks, and then I'm sure he wouldn't have accepted the bishop",
        "23... Kf7": "Black's up an entire queen for nothing, but is fleeing from White's dangerously placed pieces.\r\nNow, if Kf8, then Rd8  Kf7 Re7  Kg6 Nf4  and Black must sacrifice Qxf4 in order to not get mated. I think Black is still winning, but White has a MUCH better chance to steal now than when he first lost his queen \r\n",
        "24. Re7+ Kg6": "Obviously any other move gets mated Rd8#, so this is forced",
        "25. Nf4+": "This is a very in-depth cheapo, Black must take Qxf4 and Black is totally winning. Qxf4 isn't really that hard to see. So why didn't this guy play it?\r\n\r\nI personally would've played Rg7  Kxh5 Rd1 threatening Rh1# but then Qf4  stops mate, but then again Qf4  may be harder to see than Qxf4 in Baker's variation",
        "25... Kg5": "The most horrible blunder of the game. Black stubbornly will not give up his queen for an easy win, so Black is totally dead now, what a moron.\r\n\r\nAnd if Kf6 then Rd6  Kg5 Rg6#",
        "26. Rg7+ Kf6": "forced",
        "27. Rg6+": "Any idiot who would subject their king to this much harassment (especially up a whole queen) is a, I must say again, \"MORON\"",
        "27... Kf7": "forced",
        "28. Ne5+": "crushing",
        "28... Ke7": "Ke7 and Ke8 are the same as Re6  forces the king to f8 no matter what.\r\n\r\nAnd Kf8 immediately here, then Rf6  Kg8 (Kg7 Rf7  Kg8 Rd8 Qe8 Rxe8#)Rd8  Kg7 Rf7# and King to e-file after Rf6  will just transpose to the actual game after Re6 ",
        "29. Re6+ Kf8": "forced",
        "30. Rd8+": "This is the ultimate comeback",
        "30... Kg7": "forced",
        "31. Rg6+": "truly amazing how Baker can be down a queen, but still have a totally won position.\r\n",
        "31... Kh7": "forced",
        "32. Ne6": "Finally a non-checking move that seals Black's fate. There is a mating threat of Rg7# and no way to stop mate.\r\nQd7 fails to Rxd7 Nxd7 Rg7#\r\nh5 fails to Ng5#, and Rg8 simply fails to Rgxg8 forcing Rh8# in a move or two",
        "32... Rxd8": "I'm not sure if Black knew he had lost yet, but Baker's comeback must've made this guy pissed",
        "33. Rg7+": "If only Black had played Qxf4 on move 25, he could've avoided this embarassing swindle",
        "33... Kh8": "helplessly forced. ",
        "34. Nf7#": "If Baker could see this guy's face, he would laugh in it. Just look at the material count!"
    },
    "url": "https://gameknot.com/annotation.pl/online-g-10-tournament?gm=7032",
    "gameName": "Online G/10 Tournament",
    "players": "Baker (1985) vs. punkyfurr (1783)",
    "opening": "French defence (C00)"
}