{
    "moves": {
        "1. Nf3": "Hi everyone!\n\nHere I am, still yet to achieve my first ever Expert Victory in a non-timed out game.  Now wouldn't it have been lurvely to have just done it against The Coach!  Off the board, Ion has given me tremendous ongoing support, but alas, on the board Ion is painfully aware of my strengths and weaknesses and knows just how to tempt me into his tactical traps.  In this game it was not a case of simply walking into a one-move tactical shot and coming off worse, I won a pawn in a speculative gambit that Ion played against me and tried to hold on to it at a cost of my development.  This allowed Ion to put a lot of pressure on me, in particular the d column and he had a very strong knight which he used to devastating effect as first one black pawn, then another dropped.  Gameknot analysis is provided here  http://gameknot.com/analyze-board.pl?bd=15730439&fb=1&rnd=0.7837962235268192 to help you follow this game, of which, incidentally is my longest game against Ion.  He starts off with 1. Nf3 which is called the Reti Opening.",
        "1... f5": "1. ..... f5 of which I decided to try and surprise Ion with a move which could transpose the game into the Dutch Defense.  I remember playing the Dutch against Ion before and losing eventually so I thought that maybe I could learn from past mistakes and do a better job this time round.  However, Ion has other ideas with .....",
        "2. e4": "2. e4 .... a gambit.",
        "2... fxe4 3. Ng5": "3. Ng5, as Alice in Wonderland would say, curioser and curioser, Ion moves the same piece twice in the opening to attack my advanced e pawn after I accepted the gambit.  I decided to play d5.  Although this does not develop a piece at least it opens up the c8-h3 diagonal for Fou Leblanc.",
        "3... d5 4. d3 Nf6": "4. ..... Nf6 - maybe I should have undoubled those e pawns at once and played PxP but that would have allowed the Wicked Witch of the West to come into h5 and with a knight on g5 it would have looked really nasty for Henry.  So Nf6 prevents this check.",
        "5. dxe4 h6": "5. .... h6 - before recapturing I decided to drive back Ion's knight.",
        "6. Nf3 dxe4 7. Qxd8+ Kxd8": "7. ...... Kxd8 - hmm, I think Henry always breathes a little easier when the Wicked Witch of the West is off the board, especially when she belongs to my Expert or Master opponent!  Now, I am a pawn up and queens are off the board, can I make this count?!",
        "8. Ne5 Be6": "8. ..... Be6 - at least I can prevent a nasty threat (Nf7+ forking Henry and rook) with developing a piece.  Trouble is, what should I do with Fou Lenoir?",
        "9. Ng6 Rg8 10. Nc3 Nbd7": "10. ..... Nbd7 - I continue to clear the decks and if my knight on f6 should be exchanged then another knight can come to f6 protecting my e pawn.",
        "11. Bd2": "11. Bd2 - Ion also decided to clear his decks.  I now launch a combo to get rid of one of my doubletons for Ion's c pawn.  Alas this decision will back fire on me big time later on.",
        "11... Bf5 12. Nxf8": "12. Nxf8 - but first, Ion kindly solves the problem of what to do with Fou Lenoir for me.  He voluntarily trades in his active knight for my totally inactive bishop and helps me clear the back decks!  But, as I said before, on the board, when Coach Ion falls in with my plans he has far greater plans of his own!",
        "12... Rxf8 13. Bc4 c6": "13. ..... c6 - I do, however, play c6 before launching that combo first.  This is a multi- purpose pawn move.  It frees up c7 for Henry so that I can castle queenside by hand and it stops Ion from posting a knight on d5 or b5.",
        "14. O-O Kc7 15. h3 e3": "15. ..... e3 - now!",
        "16. Bxe3 Bxc2": "16. ..... Bxc2 - that little pawn trade has taken place but I now wonder whether I should have played either Rd8 or Re8 first.  You the Inquest Jury decide!",
        "17. Rac1 Bg6 18. Be6 b6": "18. ..... b6 - to create another flight square for Henry, b7, but alas it does weaken c6.",
        "19. Rfe1 Rae8": "19. ..... Rae8 - at last, the queenside castling by hand has been accomplished, but will it do any good?",
        "20. Rcd1 Bf7 21. Bf4+ Kc8 22. Bf5": "22. Bf5 - Ion will not relinquish that powerful bishop pair without exacting a heavy price from Yours Truly.",
        "22... e6 23. Bd3": "23. Bd3 - my e pawn advances to close off one diagonal, but alas that white lsb finds another.  Henry goes to b7 to prevent 24. Ba6+.",
        "23... Kb7 24. Bd6 Rfg8 25. a4 a5 26. Bc4": "26. Bc4 - this move puts pressure on e6 and Ion's dsb on d6 is three things, it's a menace, it's a menace, it's a menace!",
        "26... Nd5": "26. ... Nd5 - I try and improve the position of my pieces by easing the pressure on e6 (temporarily alas!) and posting my knight to a more active square.  Now, if BxN or NxN then I will recapture with my e pawn and be a pawn up with a solid queenside majority of 4 against 2.  Ion wisely declines this exchange.",
        "27. Ne4 Nd7f6 28. f3": "28. f3! - if I now play NxN then PxN forces my d5 knight to move and back goes the pressure on my vulnerable e6 pawn.  Maybe that could have been the better strategy though, compared with what was to follow.",
        "28... Bg6 29. Be5 Re7": "29. .... Re7?? - this move proved to be my undoing.  It is really awesome and frightening just to see how Ion punished me over the next few moves.",
        "30. Nd6+ Ka7 31. Bxf6 gxf6 32. Bxd5 cxd5 33. Rxd5": "33. Rxd5 - firstly Ion regains his pawn by taking the pawn on d5 taking advantage of the pin on the e6 pawn.  I wonder whether taking the rook would have been the better alternative to advancing the e pawn but I wanted to keep the kingside pawns as together as possible.",
        "33... e5 34. Rc1 Ka6 35. Rc6 Rd7 36. Rb5": "36. Rb5 - nasty!",
        "36... Rb8 37. Nc4": "37. Nc4 - and double nasty!",
        "37... Ka7 38. Nxb6 Rd1+ 39. Kh2 Bd3 40. Rxa5+ Kb7 41. Rxf6 Rg8": "41. ..... Rg8 - my position looks just like Sheffield did in the 1984 Nuclear War film, Threads.  A scene of utter devastation.  Although this counter-attack proved to be token, I just felt the need to do something to show Ion that I am not simply a certain product of my former company, Initial Textile Services, Cambridge Division (that small Cambridge outlet used to provide mats to various companies in the Cambridgeshire, Suffolk and Hertfordshire areas before it closed sometime in 2008) before deciding to wave the white flag.",
        "42. Rxe5 Rd2": "42. ...... Rd2 - 4 pawns to the bad I throw everything at Ion's king.  Alas, thanks to Ion's pesky knight, Ion has another little combo up his sleeve to force a rook trade.",
        "43. Re7+ Kb8 44. Rf8+ Rxf8 45. Nd7+ Ka8 46. Nxf8 Bf1": "46. ...... Bf1 - after the customary rook trade I throw one last thing at Ion's king, Fou Leblanc.",
        "47. Rg7 Rxb2 48. Ne6 Ra2": "48. ..... Ra2 - all my rook can do is to hold up the g pawn for a few more moves.",
        "49. Rg6 Rb2 50. Nf4": "50. Nf4 - I now realise this cannot be done and Ion is sure to crown one of those kingside pawns and snap up my h6 pawn.  I now finally waved the white flag.  Ion did say in his post-match pm \"I was expecting you to play on for quite a while, actually. Yes, I had a winning game, but you were still in a position to throw a few caltrops in the way of my gallop to victory!   And I anticipated you would play 49...Rb4, but it never occurred to me to play 50.Kg1 in response. I was planning on 50.Kg3 Rxa4 51.Rxh6 then back to the g-file and shove the h-pawn. But 50.Kg1 does have its merits: the bishop has just one square available (c4) so I can see why you would exchange down into the rook and pawn ending. The problem there is that the lone rook hasn't a prayer against R and 3, and even if I had only two or even one pawn, the fact that I could cut your king off on the Q-side would have given me the win. So after 50.Kg1, Bc4 would have to be tried.\" I think \nthat I could have played on but frankly, I had had enough.  So, yet again, any thoughts of my first ever Expert Victory remain only in my dreams.  Well played Ion."
    },
    "url": "https://gameknot.com/annotation.pl/only-in-your-dreams-jo?gm=39810",
    "gameName": "Only in your dreams, Jo!",
    "players": "ionadowman (2043) vs. jstevens1 (1764)",
    "opening": "Reti (A04), Pirc-Lisitsin gambit"
}