{
    "moves": {
        "1. d4": "This game was from a thematic mini-tournament. The starting position is after black's fourth move.\r\n\r\nThe result unfortunately was a timeout. However there were some interesting phases of play, which I have annotated in order to try and draw some lessons.",
        "1... Nf6 2. c4 g6 3. Nc3 Bg7 4. e4 d6": "The starting position for the mini-tournament.",
        "5. Nf3": "I select the classical approach, heading for a  queenside pawn advance.",
        "5... O-O 6. Be2 e5 7. O-O": "Decision time in the centre. I opt to maintain the tension for another move. Alternatives are the Petrosian variation (d5) or the (boring) exchange variation.",
        "7... Nc6 8. d5": "The \"Mar del Plata\" centre - closed, with the black knight displaced to e7.",
        "8... Ne7 9. Nd2": "One of several options here for white (currently not perhaps the most popular). The idea is to bring the knight to c4 putting pressure on d6; at the same time, white's control of the d1-h5 diagonal inhibits black from initiating his kingside counterplay by Nh5.",
        "9... a5": "It is important for black to prevent a quick b4 and c5 break.",
        "10. a3": "Building up to b4. This is OK as white controls a4.",
        "10... Nd7": "Helping to slow down the eventual threat of c5, while at the same time preparing his own f5 break.",
        "11. Rb1 f5 12. b4 Kh8": "This waiting move, also freeing g8 for the black pieces, has become standard.",
        "13. f3": "Relieving pressure on e4, allowing the knights to move. On the other hand white can no longer counter ...f4 by Bg4.",
        "13... f4": "Black's thematic response. Having provoked f3, the f-pawn moves on.",
        "14. Qc2": "Another important choice-point for white. In Ljubojevic-Kasparov (Linares 1993), white played Nb3, supporting the c5 break but leaving the knight misplaced for the sequel. This move is intended to put pressure down the c-file while adding to a possible later defence of g2.",
        "14... Nf6": "I thought this was a dubious move, removing a defender of c5. Black obviously thought it was time to get his own counterplay rolling, though in fact it never really materialized.",
        "15. c5": "The crucial break. For the next few moves I was convinced that white was on top.",
        "15... g5 16. Nc4": "Applying the thematic pressure to d6.",
        "16... axb4 17. axb4 h5": "Black's counterplay is slow, and his centre seems about to break.",
        "18. cxd6": "Fixing a weak pawn on d6.",
        "18... cxd6 19. Nb5 g4 20. Ncxd6 Bd7": "Black has to unscramble his queen's wing. The b-pawn is not really offered, because of Bxb5 followed by Qb6 .",
        "21. Nc7": "White looks to be on top, but his invading knights are in danger of becoming overstretched here.",
        "21... Rb8 22. Bb5": "This seemed a strong move tactically and strategically, offering the exchange of light-squared bishops. However black found a strong reply.",
        "22... Bc6": "Exclamation mark!",
        "23. dxc6": "Probably the weakest of the possible continuations. This move was made after a long gap, and to be honest I had forgotten my own analysis.",
        "23... Qxc7 24. Qd3 bxc6 25. Bc4 Rbd8 26. Rd1": "Not so much to save the knight as to challenge for control of the file.",
        "26... Kh7 27. Ba3": "Developing - apparently awkwardly, but with some threats down the diagonal.",
        "27... Ne8 28. b5": "I had accepted I was going to lose the knight, and the tactical sequence initiated here was supposed to bring me compensation. It turned out not to be good, and adhering to it blinded me to several not particularly difficult better moves during the coming phase. Another factor in this phase was a loss of morale at the overturning of my apparent advantage from the opening.",
        "28... c5 29. b6": "Nxe8 would have saved the knight.",
        "29... Qxd6 30. Qxd6": "Again, missing the not so difficult 30.Qc3!?",
        "30... Nxd6 31. Rxd6 Rxd6 32. Bxc5 Rd7 33. b7 Rb8": "The simple move that puts a stop to white's ambitions.",
        "34. Ba6 Nc6 35. Rb6 Na5 36. Bd6": "Not there fast enough. There is nothing for it now but to cut my losses.",
        "36... Rbxb7 37. Bxb7 Rxb7 38. Rxb7": "There was no good way of keeping the rooks on the board.",
        "38... Nxb7": "White is a piece down for the endgame. However his bishop is much better than black's, and the pawn structure holds out a slim hope for a fortress. ",
        "39. Bc7": "Keeping the black bishop tied down to the defence of e5.",
        "39... Nc5 40. Kf2 Kg6 41. Ke2 Ne6": "Heading for a strong outpost on d4.",
        "42. Bd6 Nd4+": "The white king is now tied down to f2.",
        "43. Kf2 Kf6 44. Bc5 Ke6": "I had entertained the possibility of playing for a pawn overlap with fg once the black king moved away from the kingside. However I decided this gave no real chances, and went instead for an attempted fortress.",
        "45. h3": "The crucial move in white's defensive plan. If black plays ...g3 it already looks like a fortress, while exchanging on f3 or h3 still leads to a position that is not easy to break down.",
        "45... gxh3 46. gxh3 Kf6": "Black's king changes direction and heads for the h3 pawn, a mistaken plan in my view.",
        "47. Kg2 Kg5 48. Bb4": "There is the nice possibility here of black allowing himself to be mated, after ...Kh4, Be7  :)",
        "48... Bf6": "...but Black makes sure that isn't going to happen.",
        "49. Kf2": "Inviting black to proceed with his kingside plan. The only winning chance, I believe, was to bring the king all the way round via the queenside to e2, and white could probably not have held.",
        "49... Kh4 50. Kg2": "White's plan now is to move the bishop between d6 and c7, keeping black's bishop tied to defending the pawn and of course the d8-h4 diagonal. If black moves the knight, the white king is free to move to h2, and if he moves the king, it is free to move to f2.",
        "50... Nxf3": "An interesting but flawed sacrifice. The flaw is that black's king will be blockaded on the h-file in front of its pawn, while the black bishop is powerless to dislodge the defenders.",
        "51. Kxf3 Kxh3 52. Bd6": "I believed the draw was secure (I originally annotated the position as drawn), and played this move intending to occupy the b7-g1 diagonal as soon as black advanced his king or pawn. After reading my annotations, my opponent suggested that the king retreat Kh4-g5 wins, and I now think he is right. This move was therefore a blunder; I should have played Be1, preventing the king retreat, and answering Bh4 with Bc3. \n\nUnfortunately (fortunately for me), at this point black timed out."
    },
    "url": "https://gameknot.com/annotation.pl/openings-kings-indian-defence?gm=8408",
    "gameName": "Openings: Kings Indian Defence",
    "players": "orangutan (1740) vs. kingstuart (1730)",
    "opening": "King's Indian (E97), orthodox, Aronin-Taimanov, bayonet attack"
}