{
    "moves": {
        "1. d4": "sorry for my english\r\nany comments welcome",
        "1... Nf6 2. c4 g6 3. Nc3 Bg7 4. e4 d6": "Initial position of mini-tournament",
        "5. Nf3 O-O 6. g3 Nbd7 7. Bg2 e5 8. O-O exd4": "black desided to exchange central pawns early",
        "9. Nxd4 Re8 10. h3": "preparing Be3, otherwise Ng4. But pawn on h3 could be weak",
        "10... a6": "Gallagher variation. Black desided not to play c6 (leaving d5 for white pieces) and trying to make counterplay on queenside.",
        "11. Re1 Rb8 12. Rb1 Ne5": "pawn c4 is common subject of black pieces in fianchetto line",
        "13. b3 c5": "black is continuing in his plan. This move makes white knight to leave his centralized field but d5 and d6 are now black problem",
        "14. Nc2 Nc6": "14. .. b5 is logical continuation but after 15. f4 Ned7 16. Qxd6 white has an advantage as shown in many games. \r\nI prefer Be6 instead of Nc6, there is no reason to leave with knight, let's wait for white f4 which makes white kingside weaker ",
        "15. a4": "prevent from black main plan - b5",
        "15... Be6 16. Re3": "Re3! attack (Rd3 heading for d6) and defence (cover of knight c3) in one move. ",
        "16... Qa5": "Original idea but well-tested Qd7 with h-pawn thrust is more testing for white. Now white can play \"normal\" development moves without weakening his position",
        "17. Bb2": "logical move. Strong King Indians black bishop on g7 has his oponent on b2 now\r\nNot Qxd6 because Bh6 and Rbd8 of course",
        "17... h5": "this move would be more stronger with queen on d7!\r\nbut we can see other weakness caused with h3 move. White will play f4 soon or later a black h4 can break white pawns structure. \r\nParadox is that white played h3 for Be3 and bishop is now on b2 :)",
        "18. Nd5 Bxd5": "Black get off weaknesses d5 and d6 but another trouble is about to be solved. Maybe acknowledge a mistake and return Qd8?",
        "19. cxd5": "yes, where is place for c6 knight? And there is beatiful place for white knight on c4",
        "19... Nb4": "Ne5 wasnt possible for f4 with e5, maybe stick with black plan and go for Na7?! with b5 idea\r\nKnight on b4 is out of play will stay here till the end",
        "20. Qd2": "pinning b4 knight and making space to transfer rook b1 to new battle-field, kingside",
        "20... b5 21. axb5 Qxb5": "Allow white knight to go for c4. ",
        "22. Na3 Qd7 23. Nc4 Qd8": "Black queen is back from trip d8-a5-b5-d7-d8 to starting position. was it worth 4 moves? Maybe somewhere here we can find co-reason of final result",
        "24. f4 Bh6": "Black doesn't want to exchange blacksquared bishops so there is another plan of defense ..",
        "25. Qf2": "Mistake IMHO. White logically wanted to leave from c1-h6 diagonal but forget about b4 knight. It's \"trapped\" on b4 square but some white piece must cover d3 field!",
        "25... Nh7 26. Rd1": "Consequence of inaccurate Qf2 move. Rook would feel better on f1 or e1",
        "26... g5": "surprise! I thought that Nh7 was preparation of passive f6. Black want to create any counterplay",
        "27. e5": "yes, white plans is over",
        "27... gxf4": "opening of g-file will help white's attack",
        "28. gxf4 dxe5 29. Rg3+ Bg7 30. fxe5 Ng5 31. h4 Nh7": "Ne6 Nd6",
        "32. Nd6 Re7": "Nf5 is lethal"
    },
    "url": "https://gameknot.com/annotation.pl/openings-kings-indian-defence?gm=6493",
    "gameName": "Openings: Kings Indian Defence",
    "players": "m_art_in (1717) vs. orangutan (1747)",
    "opening": "King's Indian (E90), Larsen variation"
}