{
    "moves": {
        "1. e4 e5 2. Nc3": "This is the Vienna Game, an unusual opening that easily transposes into the Four Knights Game.",
        "2... Nf6": "This is the Falkbeer variation.",
        "3. Nf3 Nc6": "As I have mentioned, it is very easy to transpose into the Four Knights.",
        "4. Bc4": "Worrying about 4...Nxe4? No problem, Black gives me a chance to fend the move off.",
        "4... Bc5": "Of course.",
        "5. d3": "Black should simply Castle right now.",
        "5... Nh5": "? It is horrible to lose material in the development phase of the Four Knights. Black, instead of Castling, gave me a free pawn.",
        "6. Nxe5": "Black has options. He can take my Knight and lose more material, or he can defend his Knight. There is perhaps one more option and that will be covered below.",
        "6... g6": "That one option is obviously Castling. Despite the fact that it loses more material, it prevents the Kingside disaster that I do in this game.",
        "7. Bxf7+": "It all starts with this move, winning yet another free pawn.",
        "7... Ke7": "This move isn't bad yet, but I prefer 7...Kf8 with the problematic 8.Bxg6! to deal with.",
        "8. Bg5+": "This isn't very very bad for Black yet, but it is very bad for him.",
        "8... Kd6": "THIS is the bad move although no matter what Black does, he loses. 8...Nf6 is met by 9.Qf3.",
        "9. Bxd8": "I am not missing out on taking the Queen.",
        "9... Nxd8 10. Nc4+": "Black has two options.",
        "10... Ke7": "10...Kc6 11.Bd5#! That's why Black played this move.",
        "11. Qf3": "I cannot save the Bishop unless I retreat it, but in exchange, this move offers 12.g4.",
        "11... Nxf7": "What other choice does Black have?",
        "12. Nd5+": "12.g4 was better, but this move is still okay. 12.g4 Ng7 13.Nd5+ Kf8 14.Ne5 wins.",
        "12... Kf8": "Here, 13.Ne5 is a good idea.",
        "13. g4": "Wastes the opportunity a little bit.",
        "13... Ng7": "The only place for the Knight unless it wants to get taken.",
        "14. Ne5": "The object is to bring every piece into the heart of the action.",
        "14... Ke8": "Although mate isn't possible yet, 15.Qxf7 wins six points for free.",
        "15. Qxf7+": "Actually, I have an idea for checkmate.",
        "15... Kd8": "16.Nf6 followed by Qxg7 (if possible) should be able to win.",
        "16. Qxg7": "Instead, I take no time to think and play this move.",
        "16... Rf8": "I see what Black is doing. 17.Rf1 works.",
        "17. Nf7+": "All I need to do is be rid of the Rook on f8. This is achieved by chasing the King away from the Rook. Then again, I also have to realize that the Bishop is also something I need to get rid of.",
        "17... Ke8": "18.Nxc7+.",
        "18. Nxc7+": "Now, the King has to block the Bishop from protecting the Rook",
        "18... Ke7": "Can you spot the move that wins a Rook?",
        "19. Nd6+": "! Since the King is pushed to take the Knight, I can take the Rook. Note that if 19.Kf8, I still win the Rook.",
        "19... Kxd6": "Black play the expected move.",
        "20. Qxf8+": "Warning, that free Knight loses a free Bishop.",
        "20... Kxc7": "I guess Black didn't care for the Warning. The plan now is to help the Kingside pawns promote.",
        "21. Qxc5+": "That is, after I take the Bishop.",
        "21... Kd8 22. O-O-O": "White's position is dangerous.",
        "22... b6": "Black's going to get nothing done either way.",
        "23. Qd5 Rb8": "A simple method now is to eliminate the g6 and h7 pawns.",
        "24. Qg8+ Kc7 25. Qxh7 g5 26. h4": "Making sure that my Rook gets into the Game.",
        "26... gxh4 27. Rxh4": "I don't think that Black is trying in these next moves.",
        "27... Kb7": "Step 1 of 4: promote the g-pawn.",
        "28. g5 Ka8": "What if Black did 28...d6 instead?",
        "29. g6": "It is impossible to stop the Pawn from promoting.",
        "29... Bb7": "Black's Bishop hops to this square in fear.",
        "30. g7": "Finally, Black resigns. Here's what the game could possibly look like: 30...Bc6 31.g8=Q Kb7 32.Ra6 Bb5 33.c4 Ka6 34.cxb5+ Kxb5 35.Qxd7+ and a mate in four at the most. Like Steintz explained, a premature attack usually loses, and this is one of those cases.feel free to editwhat the game could possibly look like because I may be missing better moves. When you have a chance to play a good move, play before it's too late. A good move can become a horrible move in one turn if you don't play it."
    },
    "url": "https://gameknot.com/annotation.pl/opening-strategies-vs-opening-weaknesses?gm=45067",
    "gameName": "Opening Strategies vs. Opening Weaknesses",
    "players": "chesskingdom64 (1307) vs. mt1982 (1234)",
    "opening": "Vienna (C26), Falkbeer variation"
}