{
    "moves": {
        "1. d4 e6 2. Nf3 d5 3. Bf4": "My favorite, I think it is called the \"London\".",
        "3... Nc6": "Nice for me. The best following for black involves c5 or c6, opening the way for the black queen to b6 and attacking b2. ",
        "4. e3 a6 5. h3": "This is to support g4, and to provide Bf4 a square to retire in case of Nh5.",
        "5... Nf6 6. g4 Ne4": "A nice outpost, but it is dangerous just in case of pressure on c3 or Qh5. ",
        "7. h4": "This is allowed by the previous N advance, and blocks Qh5.",
        "7... Bb4+": "A waste of time. This move would have been ok AFTER I played Nd2, that allows ideas of a sac in c3, that can be dangerous in some circunstances. ",
        "8. c3 Ba5": "g4 is not bad, to prevent definitively the sac in c3. But I made another plan.",
        "9. Ne5": "I forsaw Nxc6, with a double attack with Qa4. The best answer for black is NxN, followed by c6, B or Qc7, with a good game. ",
        "9... f6": "I'll never know if black saw the double attack of Qa4, but he went for it. If I had one more move, g5, now I could have played Qh5+, with a very good attack.",
        "10. Nxc6 bxc6 11. Qa4": "Oh, wonderful... but not. This was the lesson. Look what happens after Qxc6...",
        "11... Bb6 12. Qxc6+ Bd7": "Uh-oh. The queen is trapped. Something more for the \"being so stupid\" notebook. ",
        "13. Qb7 Ra7 14. Bxc7": "The best try. Maybe even playable. ",
        "14... Rxb7 15. Bxd8 Bxd8": "Minus one. It could be worse...",
        "16. b3": "Now I am very cramped... not good. Danger, danger...",
        "16... Bc7": "Black could have defended a6, but probably he overlooked it. ",
        "17. Bxa6 Rb6 18. Be2": "Caring for g4 in case of e5.",
        "18... O-O 19. Rh3": "This was played in order to f3 without Ng3, since I wanted to preserve my bishop, my only working piece. ",
        "19... e5 20. f3": "Set free!",
        "20... Nd6 21. dxe5": "Let him take it means 1) if exd, to open the column to the rook, or 2) if cxd, leave room for a bishop penetration through a5. ",
        "21... fxe5": "This means to open the column for his rook, but f3 is more defendable. ",
        "22. Nd2 Nb5 23. Rc1 Rbf6": "Rc6 was better, I think. Anyway, sooner or later my pawns will become dangerous.",
        "24. c4 dxc4": "The 3 piece's captures were possible. The check with the bishop leads to nothing. The knight can jump to e5, a good square. ",
        "25. Rxc4 Rc6": "Ok, a rook has to be changed, but still not bad. I have to go to the endgame, the less pieces, the best for me...",
        "26. e4": "Stupid move, not wise. I wanted to block black's action, but it was unnecessarily compromising to leave the black's dsb more action. ",
        "26... Nc3": "...and oversee this. ",
        "27. a3 Nxe2": "So my only bishop is lost, but his knight was more active at the moment. ",
        "28. Kxe2 Rxc4 29. Nxc4 Bb5": "Ok, I decided he won't separate my pawns, since it would have been horrible for my countergame.",
        "30. Kd3 Rd8+ 31. Kc3 Bxc4 32. Kxc4 Rd1 33. Rh2": "Time to relocate my rook, since any attempt until now was useless. Fortunately, with the bishop's exchange, my game is still active. The two black's bishop joined with a rook would have been deadly. ",
        "33... Rd4+ 34. Kc3 Bd6 35. b4 Kf7 36. Rb2 Ke7 37. a4": "Ok, now it's a pawns war. ",
        "37... Kd7 38. b5": "BLUNDER, in a very delicate position!!!!!!! Anyway, a pawn would have been lost anyway (it's interesting to follow with a5 and see what happens). ",
        "38... Rxa4": "Now I cannot avoid a rook exchange, due to f3, and I cannot advance it. ",
        "39. b6 Ra8": "I know this pawn is lost. ",
        "40. Kc4 Kc6 41. Rb3": "Just to prevent Ra3, but thinking I was lost. ",
        "41... Rb8 42. b7": "The farther the king, the better for me. My pawns are untouchable by the bishop. ",
        "42... Rxb7 43. Rxb7 Kxb7 44. Kd5": "Now my king wins...",
        "44... Bc7 45. Ke6 Kc6 46. Kf7 g6 47. Kg7 h5 48. Kxg6 hxg4 49. fxg4": "Two joined pawns... what else can I ask for?",
        "49... Kc5 50. h5 Kd4 51. Kf5 Bd8 52. h6 Be7 53. g5": "Blunder, h7 was crushing.",
        "53... Bf8 54. h7 Bg7 55. g6 Bh8 56. Ke6 Kxe4 57. Kf7 Kf4 58. g7 Bxg7 59. Kxg7 e4 60. h8=Q": "And he resigned. A good lesson for me."
    },
    "url": "https://gameknot.com/annotation.pl/opening-countertrick-lesson?gm=39710",
    "gameName": "Opening countertrick lesson",
    "players": "damalfi  vs. suru747 ",
    "opening": "Queen's pawn (A40)"
}