{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. d4": "I thought this was a Sicilian defence, (c5 instead of e5), so we end up in a Scotch.",
        "3... exd4 4. Nxd4 Nxd4 5. Qxd4 Qe7 6. c4": "Blocking in a bishop - Bc4 is an alternative, or Be3 to prevent Qc5.",
        "6... Qc5 7. Be3": "Not developing black's pieces for him.",
        "7... Qxd4 8. Bxd4 c6": "Prevents Nc3-d5, but gives up control of d6",
        "9. c5 f6": "Preventing e4-e5, with Nd2-c4 (or -e4) -d6 a possible plan. The bishop on d4 looks a bit silly, but not as much as the one on c8. Black could attack the pawns with b6, but white is probably better.",
        "10. f4": "Keeping control of e5",
        "10... d6 11. cxd6": "Probably better than trying to support the pawn on c5",
        "11... Bxd6 12. g3 Bb4+ 13. Nc3": "Also possible is Kf2, and my king is fairly safe. It's probably better to avoid the exchange, because I have problems defending e4.",
        "13... Bxc3+ 14. bxc3": "Bxc3 is an alternative, and I'm not sure which is better, but I didn't delete the conditional move in time.",
        "14... Ne7 15. a4": "Trying to restrain the queenside majority. Bc4 may have been better, to prevent both ...Be6 and ...O-O as after black's next it is no longer possible. (I may have been worried about ...b5, but after Bb3 white is fine.",
        "15... Be6 16. Rb1 b6": "A good move. c6-c5 is now a threat, so the bishop retreats.",
        "17. Be3 O-O 18. f5 Bf7 19. g4": "White should probably worry about defending e4 (and activating the rooks) before expanding.",
        "19... Rac8 20. h4": "Ba6 is probably better, and it could have been played on the next move too. (20. ... Rc7 21. Bf4)",
        "20... c5": "Another good move, getting space for the knight.",
        "21. a5 bxa5 22. Rb7": "Bad, because the knight can easily defend a7 and a5. Better is Ra1, and after 22. ... Nc6 23. Bxc5 Rfe8 24. Ra4 white is not worse.",
        "22... Nc6 23. Bxc5": "A mistake, as white should now lose a piece. I should have defended my e-pawn before grabbing material.",
        "23... Rfe8 24. Bg2": "Bd3 would prevent the later ... Bc4, although it also allows a strong ... Ne5.",
        "24... Nd8 25. Rb5": "After 25. Rxf7 Nxf7 26. Bd4 Nd6, the e-pawn is lost.",
        "25... Bc4 26. Rxa5 Bd5": "Overlooking Nb7!, which wins a piece.",
        "27. Kd2 Bxe4 28. Re1 Bc6 29. Rxe8+ Bxe8 30. Bxa7 Nc6 31. Bxc6 Bxc6": "Now white is not worse (slightly better even), although the opposite-colour bishops should lead to a draw.",
        "32. Bd4 Bf3 33. g5 fxg5 34. hxg5 Ra8 35. Rxa8+": "Exchanging rooks is very drawish, but I was worried about ... Ra2+ if I declined the exchange. I forgot that opposite-colour bishops favour the attacker, which is probably me after Rc5-c7.",
        "35... Bxa8 36. c4 Kf7 37. Ke3 Bc6 38. Kf4 g6": "? Bad, because white gets a protected passed pawn, but it's probably still drawn.",
        "39. f6 Ke6 40. Be5 Bb7 41. Bc7 Ba6 42. c5 Bb7 43. Bd8": "The immediate f6-f7 fails to 43. ... Kxf7 44. Ke5 Ke7, so the bishop goes to d8 to control e7.",
        "43... Bc6": "?? The bishop is very bad on c6. After passing with ... Bg2, the f7 idea only draws, because of the opposite colour bishops.",
        "44. f7 Kxf7 45. Ke5 Ke8 46. Kd6": "If the bishop wasn't on c6, white would have to give up the pawn for it, or allow the black king to get to d7, with a draw in either case. With the bishop on c6, white wins.",
        "46... Kxd8": "Or after 46. ... Bg2 47. Bf6, white wins the bishop and the game.",
        "47. Kxc6": "Black can resign here.",
        "47... Kc8 48. Kd6 Kd8 49. c6 Kc8 50. c7 Kb7 51. Kd7 Kb6 52. c8=Q Kb5 53. Qc3 Kb6 54. Qc4 Ka5 55. Kc6": "Mate next move. (not stalemate, because of h7-h5)"
    },
    "url": "https://gameknot.com/annotation.pl/opposite-colour-bishops-endgame?gm=31584",
    "gameName": "Opposite-colour bishops endgame",
    "players": "no_genius (1445) vs. iljadu (1554)",
    "opening": "Scotch (C45), Ghulam Kassim variation"
}