{
    "moves": {
        "1. e4 e5": "No Surprise here!",
        "2. d3 d5": "Black presses forward claiming real estate ",
        "3. Nc3": "I decide to play defensively and create an opportunity for an exchange that will leave us Queenless",
        "3... d4": "Instead, Black presses the land advantage ahead. ",
        "4. Nd5": "Knights can turn the table on real estate acquisition quite quickly",
        "4... Be6": "I don't mind exchanging a Bishop for Knight..just a preference I have. ",
        "5. c4": "And so I make my stand. Black controls 4 squares in my territory, I control 6 in his..early advantage me. ",
        "5... c6": "A Blunder in the offing. I can run away, or stay and fight.. .I choose",
        "6. Nf3": "Stay and fight. In my peanut brain, a Knight for a Pawn...what a nut. ",
        "6... Bg4": "Dave kindly offers me a way out - he was feeling sorry for me I guess, but in my state if mental collapse. ",
        "7. h3": "I offer to exchange his Bishop for my Knight - a point for point exchange I suppose, although now as I review the game, I think that the prudent move would have been to remove my Knight from danger. ",
        "7... Be6": "As Black does - well played Dave. ",
        "8. g3": "Me, I decide to capture some of my own territory by sacrificing a Knight",
        "8... cxd5": "Thus..I am three points down and in MUCH worse position than just one move ago. ",
        "9. cxd5": "With a brave face, I try to \"even the score\", failing miserably. ",
        "9... Bd7": "With the long reach of the Bishop, teh board structure is still in Dave's favor, although in some ways, he is a bit more exposed than I am with the present board. ",
        "10. Nxe5": "Again, I push ahead, trying to assert my self on the game. (The best form of defense is attack - at least by doing that I can distract others from my obvious blunder. )",
        "10... Bb4+": "Being just a point behind after the exchange, I am not surprised by the full frontal assault. ",
        "11. Bd2": "a natural defense. ",
        "11... a5": "Dave bolsters the Bishop with a flank attack and I push a pawn...",
        "12. a3": "This leaves Dave two options - option 1 - RUN AWAY and option 2 - ATTACK",
        "12... Bxd2+": "Dave chooses to attack my King - how dare he!",
        "13. Qxd2": "The Queen puts paid to that idea. and alters the board for the moment in whites favor. ",
        "13... f6": "Black tries to bring balance back to the board by attacking the Knight. ",
        "14. Nc4": "this time, I run away to fight another day!",
        "14... Bb5": "Dave is determined to capture my Knight. ",
        "15. b4": "I take an interesting position. This move might just prove to be important later on. ",
        "15... Ne7": "Black starts to develop the rear guard. ",
        "16. bxa5": "I see an opportunity to even the score and take myself a pawn",
        "16... f5": "Dave looks to make up points by capturing the two pawns in the middle of the board. ",
        "17. Bg2": "A bit of rear guard action for myself. ",
        "17... Bxc4": "Dave decides to exchange the Bishop for a Knight - I think that this move might just have been the killer move of the game for Dave.  This exchange un-doubles my d rank pawns and eliminates a late threat in the game. ",
        "18. dxc4": "and it balances the board for me. Also, counting squares, I control 10 squares on his side of the boar5d and he only controls 4 on my side of the board...advantage me.  ",
        "18... Rxa5": "His rook capture of my pawn evens things up a bit in that regard. but I can close the door on any pending assault by his rook just by ....",
        "19. O-O": "Castling! I also have his Rook in my sights, and I am still dominating the board and I have a pawn in my sights as well.",
        "19... O-O": "Rather than defend his central pawn, Dave Castles too. ",
        "20. Qxd4": "So I think him and take the poor bugger. canon fodder for sure.  This move also places my queen in direct contact with his castle too. ",
        "20... Nd7": "The Knight starts to make its way over to the battle",
        "21. Rfb1": "Leaving another pawn exposed to my wrath.",
        "21... b6": "But a good move to defend both the Rook and the pawn.  If I can get a pawn down to the 6th row in H, I will be just fine. ",
        "22. e5": "So to set a trap, I attack from the center of the board. ",
        "22... Nc5": "With this move, Dave exposes his Queen to the impending battle. ",
        "23. d6": "But I press on and put his Knight in danger (I am also on the 6th row!)",
        "23... Rf7": "Bow this is an interesting move.  Dave brings up his Rook to defend against an attack on either the Knight or the pawn in G",
        "24. Bd5": "But in so doing, exposes himself to a Bishop attack. ",
        "24... Nxd5": "Instead of being passive, Dave attacks my Bishop and surrenders his Knight = an acceptable exchange, except for the position it leaves me is once concluded. ",
        "25. Qxd5": "SO now I have pinned his rook with my Queen - at least for now. ",
        "25... Nb3": "Black has an advantage here. My queen or my Castle...my choice. A good move. ",
        "26. c5": "I choose my Castle...naturally",
        "26... Rxc5": "but in an effort to get too much, Dave chooses the pawn. and I choose his Knight...so I come out ahead in an exchange where I had my nuts in a sling. ",
        "27. Qxb3": "Thus!",
        "27... Rxe5": "The Castle does his work and reduces the deficit. ",
        "28. Qxb6": "but I even up the score on that exchange and stay two points ahead and offer my queen to boot. ",
        "28... Qd7": "Dave declines, and the game is moving into a new phase now...I still think I have the advantage on board position at this stage.  I control about 12 or 13 squares on his side of the board to his 5 or 6",
        "29. Rbd1": "It looks like the next flash point is the advanced pawn on d6...so I move to shore up an advanced position. ",
        "29... Re6": "Dave agrees and moves to make the battle decisive in his favor.",
        "30. a4": "When attacked in the imiddle, counter on the flanks...so here goes. ",
        "30... h5": "Dave does similarly",
        "31. h4": "I move to defend the flank",
        "31... Rff6": "Dave moves to attack the  middle. ",
        "32. Qb8+": "Outnumbered, I force him to defend his King. ",
        "32... Kh7": "Easy..",
        "33. Rdc1": "I abandon the pawn, and decide to execute an end around attack. ",
        "33... Rexd6": "The pawn dies immediately ",
        "34. Rc8": "This move creates an exchange that leads to the end game position with my one point advantage playing a huge role. ",
        "34... Rd1+": "The Castle exchange is first",
        "35. Rxd1 Qxd1+": "I hide in my King in my Castle ",
        "36. Kg2": "and Dave is forced to  find another route to attack",
        "36... f4": "I place him in Check",
        "37. Rh8+ Kg6": "He moves predictably",
        "38. Qe8+": "I place him in check",
        "38... Rf7": "He moves to block the maneuver again",
        "39. Qe5": "I see a mate brewing",
        "39... fxg3": "but so does Dave!",
        "40. Qxg3+": "I force check again and  stay one point ahead. ",
        "40... Qg4": "Dave forces teh Queen exchange and the game looks like it will end in a draw at this point. ",
        "41. Qxg4+ hxg4": "Except for that one little thing... my pawn over on the A4 square. ",
        "42. Ra8": "SO I defend it. ",
        "42... Kh5": "The black King starts to force me into a corner. ",
        "43. a5": "I press ahead. ",
        "43... Kxh4": "SO now it is an even game with that capture, but I still feel like I am ahead. ",
        "44. a6": "So I march on ...trying to force a Queen exchange. ",
        "44... Rf3": "This move allows me to get real close ...all the way to the seventh rank",
        "45. a7": "I can capture his Rook if I force the game along",
        "45... Ra3": "Black sees that and plays along",
        "46. Rh8+": "Check",
        "46... Kg5": "The King moves to tis only spot and I get my Queen",
        "47. a8=Q": "forcing the Castle to ",
        "47... Rxa8": "surrender for the queen ",
        "48. Rxa8": "my one point advantage has turned to a 4 point advantage",
        "48... g6": "now I have to create the channel for the mate",
        "49. Rf8": "so I block the Kings escape",
        "49... Kh4": "forcing him to the H rank",
        "50. f4": "I block the retreat along G rank with  my pawn advance",
        "50... Kh5": "Seeing the danger, the King trys to escape",
        "51. Kg3": "I make an extra move...an unnecessary move because Rook to H8 is mate in this situation too; ",
        "51... Kh6": "BUt the King retreats - I almost let him escape...",
        "52. Rf7": "but I block his retreat",
        "52... Kh5": "reluctantly he moves down the board. ",
        "53. Rh7#": "and its game over...."
    },
    "url": "https://gameknot.com/annotation.pl/opus-revenge?gm=8544",
    "gameName": "Opus Revenge",
    "players": "opus692 (1130) vs. daverap (1327)",
    "opening": "KP (C20), Indian opening"
}