{
    "moves": {
        "1. d4": "This was part of a Semi-Slav thematic mini, for which the starting position is after black's 4th move. I had already lost to this opponent with white, after a sharp game starting from the Meran Variation.",
        "1... d5 2. c4 c6 3. Nc3 Nf6 4. Nf3 e6": "The actual starting position.",
        "5. Bg5 dxc4": "In this position I would normally transpose to the Cambridge Springs, but decided to experiment for the first time with the Botvinnik system - partly out of a taste for adventure, but also knowing that my opponent himself plays the Cambridge Springs; its suitability for correspondence games has also been called into question.",
        "6. e4": "Both sides will be following established theory for the Botvinnik system for several moves; I will omit the explanations, though I may fill them in later.",
        "6... b5 7. e5 h6 8. Bh4 g5 9. Nxg5 hxg5 10. Bxg5 Nbd7 11. exf6": "An important alternative move order here is 11 g3 (favoured by Kramnik).",
        "11... Bb7 12. g3 c5 13. d5 Qb6 14. Bg2 O-O-O 15. O-O b4 16. Na4 Qb5": "This queen move is approved by current theory, but see the note to black's next move.",
        "17. a3 Bxd5": "Theory here would recapture with the pawn, ....ed. Then black's pawn mass on the queen's side balances white's pawn overlap on the king's side. The present idea (attributed to Shabalov) was played in Ivanchuk-Shirov 1994, with the important difference that Shirov had played ....Qa6 on the previous move. The present position differs in not exposing the queen to tactics on the a-file after ab (a feature of the Shirov game); on the other hand it deprives the e6 pawn of the queen's support.",
        "18. Bxd5 Ne5": "Threatening to recapture with the rook and keep the weakened long light-squared diagonal open, aiming particularly at f3.",
        "19. Bxe6+": "White sets about exposing the weak points of black's plan, weakening e6 and clearing the way for his own f-pawn to advance to f7.",
        "19... fxe6": "This and the next move are where the queen's support for e6 is missed.",
        "20. Qe2": "A strong move, which I thought at the time was probably already winning.",
        "20... Qxa4": "Black exchanges his central knight for white's marginal one in order to get back in time to defend e6. After f4 and Qxe6 his position would collapse quickly.",
        "21. Qxe5 Qc6": "At last the black queen finds a useful position, covering e6 and eyeing the long diagonal.",
        "22. f7": "The pawn comes to f7 with tempo, discovering attacks on both rooks.",
        "22... Rh5": "The only reply.",
        "23. Qf6": "White's plan is to get the queen to the 8th rank, pressurizing the black bishop. Black's plan is to stop her, or to harrass her enough to concede it more favourable terms to himself.  Right now of course white is threatening an immediate win with Qxd8 .",
        "23... Rd5 24. Bh4": "My opponent said that he had intended h4 here, but then  ....Rdxg5, 25.hg Rh1#.",
        "24... Rd4": "Keeping the pressure on the bishop. I was aware that white has Qg6-g8, but figured that my rooks would get back in time to prevent catastrophe. Actually this move was played after a week's interruption; I think I had originally intended to take precautions against white's rook invasion on the a-file first.",
        "25. axb4": "As I was saying...",
        "25... Rhxh4": "Now 26.gh would lead to ...Rg4#. I am not sure if white had seen this coming, but he calmly proceeds with his own attack.",
        "26. Rxa7 Rh6": "The black queen is doing a sterling job on that long diagonal, giving me time to harass her opposite number.",
        "27. Qg5": "Forcing the queen off the f-file, though giving her a push on her way to g8.",
        "27... Rd5": "I wanted to play ...cb here, setting up a queenside pawn majority and freeing c5 for my bishop, but was worried about the white queen possibly swinging over to a5.",
        "28. Qg8 Rd8": "The rook gets back just in time.",
        "29. Rfa1 Kb8 30. b5": "The beginning of a little pawn march which underlined the cost of not having captured it.",
        "30... Qf3": "Intending Rf6, with pressure on both the white f-pawns. The threat to f2 keeps one white rook tied to the back rank. Of course I also had to keep the queen on the long diagonal to prevent Ra8 .",
        "31. Rd7": "An excellent move. I cannot afford ...Rxd7?, Qxf8 !",
        "31... Rc8": "The only move. If ...Rf6, Rxd8  Kc7, the white rook gets back to d2.",
        "32. b6": "I had looked at Raa7, after which white has the opportunity to force a complicated endgame by Rdb7 . While I would have entered it nominally a point up, the lack of co-ordination of my rooks and pawns as compared with white's king's side pawns and queen made it a daunting prospect. After the present move I have the option of a perpetual check.",
        "32... Rf6": "Finally I have time for the not-so-subtle Rf6.",
        "33. b7": "If 33.Rf1, then ...Bh6, 32.Qh7 Be6 and white is in trouble. With mate imminent, I decide to set up the perpetual check.",
        "33... Qxf2+": "33 ...Qxb7 would have kept the game going, but I could not see any prospects for black.",
        "34. Kh1": "Unfortunately Gameknot's excellent site does not recognize perpetual checks, so we play out a threefold repetition. Don't bother to watch the rest.",
        "34... Qf3+ 35. Kg1 Qf2+ 36. Kh1 Qf3+ 37. Kg1 Qf2+": "1/2-1/2"
    },
    "url": "https://gameknot.com/annotation.pl/orangutans-mini-tournament?gm=4467",
    "gameName": "orangutan's mini-tournament",
    "players": "profdaum (1865) vs. orangutan (1728)",
    "opening": "QGD Slav defence, Alekhine variation (D10)"
}