{
    "moves": {
        "1. d4": "This was a lucky draw. I grabbed a pawn, but it resulted in my queen being lost for rook, knight and two pawns. In theory that material imbalance is favourable to me, but in practice in the open board his queen is  much stronger, and I am fortunate to escape with a draw.",
        "1... Nf6": "It looks like he will play an Indian Defence.",
        "2. c4": "I continue with my usual.",
        "2... e5": "He picked up his e pawn, twirled it in the air, and I though he was going to play a Nimzo-Indian Defence, but he put it down on e5 - the Budapest Defence. https://en.wikipedia.org/wiki/Budapest_Gambit\n",
        "3. dxe5": "Taking is by far the most popular move.",
        "3... Ng4": "After 3.dxe5 Black can try the Fajarowicz variation 3...Ne4 which concentrates on the rapid development of pieces, but after 4. a3! white has an advantage.",
        "4. e4": "I switched to this, after I learned how white can't hang onto the extra pawn safely. This move attacks the black knight.",
        "4... Nxe5": "So he takes the pawn.",
        "5. f4": "I attack the knight again.",
        "5... Nec6": "The most sensible move, although Nb-c6 is an interesting piece sacrifice, but black doesn't get quite enough.",
        "6. Be3": "Preventing 6.....Bc5 and white can't castle.",
        "6... Bb4+": "This is the most common move.",
        "7. Nd2": "This seemed to me to be the most logical, preventing black from doubling my c pawns if I had played Nc3. I was surprised to learn afterwards than 7. Nc3 is in fact more usual.",
        "7... O-O": "7....Qe7 threatening the pawn on e4 is more common.",
        "8. Bd3": "So I protect the e pawn.",
        "8... d6": "He develops.",
        "9. Ngf3": "So do I - I am keen to get my king out of the centre, away from possible pressure down the e file, and also breaking the pin on Nd2.",
        "9... Bg4": "He pins my other knight.",
        "10. O-O": "As planned. ",
        "10... Nd7": "And he completes the development of his minor pieces. I found out afterwards that this position has occurred in a couple of Gameknot games, both times white played a3 and black won, although this position is very level still, and in both games white made mistakes later.",
        "11. h3": "This seemed a reasonable move, gaining the two bishops in an open board. Fritz likes Nb3 or Qe2.",
        "11... Bxf3": "He is forced to take.",
        "12. Qxf3": "This seemed to me to be the best way of taking back. Fritz prefers taking with the knight at first, but later corrects to taking with the queen.",
        "12... Qe7 13. Rae1": "It seemed best to me to continue my mobilisation, although Fritz likes a3 or Nb3.",
        "13... Rae8": "He copies me.",
        "14. a3": "Fritz likes this move.",
        "14... Bc5": "He drops back - probably best.",
        "15. b4": "I already had the pawn sac continuation in the game in mind, but bearing in mind that was probably a mistake, the Fritz move of Nb1 (presumably with the idea of Nc3 and maybe Nd5) is probably better.",
        "15... Bxe3+": "So he takes - which way would you recapture dear reader?",
        "16. Qxe3": "Fritz agrees this is best.",
        "16... f5": "He attacks my centre.",
        "17. b5": "Fritz likes Nf3 with equality. Unfortunately I go for a risky pawn grab which should have lost.",
        "17... Nd8": "So the knight drops back.",
        "18. Qxa7": "I take the poisoned pawn. OK stop and work out black's best move.",
        "18... Nc5": "Did you find it? Black blocks my queen retreat and attacks my bishop.",
        "19. Bc2": "So the bishop drops back. What should black play now?",
        "19... Nc6": "At the time, I thought this was a brilliant move, but in fact Fritz prefers Nde6 or Qh4 with approximate equality. My queen has no escape squares, my reply is forced.",
        "20. bxc6 Rea8": "And now my queen is lost.",
        "21. Qxa8": "So it is best to get the rook for it.",
        "21... Rxa8": "And he takes back.",
        "22. cxb7": "So I take the pawn.",
        "22... Nxb7": "He takes back.",
        "23. exf5": "And I get a second extra pawn. However with best play, black can get a pawn back.",
        "23... Qf6": "He keeps his queen active.",
        "24. Be4": "I pin his knight.",
        "24... Rb8": "He protects it. I am surprised that at the moment, Fritz is giving a small advantage to white. I am not sure that Fritz really understands that with the open board his queen is boss, and I am going to struggle to tame her.",
        "25. Reb1": "This seems normal to me, pinning the knight again, but Fritz prefers Bd5+ or Nf3. Certainly I considered Bd5+",
        "25... Qd4+": "This is the only way to save his knight.",
        "26. Rf2": "And this the only way to save my knight.",
        "26... Qa7": "And now his queen drops back, and I have a long think. What would you play here?",
        "27. Rxb7": "Fritz gives 27. Bd5+ or 27. Nf3 with a microscopic edge (0.03) to white. I knew that queens and knights can sometimes work very well together, and I was confident of drawing the ending of knight, rook and pawn v queen, so I decided to take his knight and rook off, as my king is slightly exposed.",
        "27... Rxb7": "He takes back.",
        "28. Bxb7": "I take again.",
        "28... Qxb7": "He recaptures. What would you play now?",
        "29. Kf1": "This is what I played, although Fritz prefers 29. Rf3 or g4, both with advantage to black.",
        "29... Qa7": "This is a mistake. I saw before making move 27 that 29. Qb2 won a pawn, but I thought I could still hold that. (Fritz give black as 1.15 up after Qb2!). Fritz also prefers 29. d5 with black now up 0.75",
        "30. Rf3": "Best move for white according to Fritz - but black still 0.55 up",
        "30... Qd4": "Although this seems like logical centralisation, Fritz prefers 30. Qa5(black up 0.55) or h5 (black up 0.46)",
        "31. Ke2": "Fritz likes this move, but black still up 0.45",
        "31... Kf7": "One king move deserves another! (Perhaps an echo of his copied rook move on move 13). Fritz prefers 31. h5 (black plus 0.46) or Qc5 (black up 0.38)",
        "32. g4": "This seemed to me to be normal, protecting f5, but Fritz prefers 32. Rf1 or g3",
        "32... Qc5": "Fritz prefers 32..h5 or h6",
        "33. Re3": "Fritz prefers Kf1 (black up 0.16) ",
        "33... Qd4": "Black is unable to find a way to make progress, and starts repeating moves.",
        "34. Rf3": "Which I was more than happy to comply with! Many thanks for reading. Please leave a comment or two and rate the annotation on the star system, to let me know how I am getting on. Until next time dear reader!"
    },
    "url": "https://gameknot.com/annotation.pl/oswestry-v-telepost-shropshire-league?gm=62607",
    "gameName": "Oswestry v Telepost, Shropshire League",
    "players": "Charles L Higgie (ECF166) vs. Matthew Clark (ECF154)",
    "opening": "Budapest (A52), Alekhine, Abonyi variation"
}