{
    "moves": {
        "1. e4": "I was black in the first game, so we switched, and I played as white.  This is how I always open, and that's not going to change since I have the most experience with 1.e4.",
        "1... e5": "Ted has answered with the Sicilian Defense.  But, this is what he usually plays.  Now, I inferred that this was going to become a Spanish Opening.  That's because until last Friday after I played 2.Nf3, he has, 10 out of 10 times answered with 2...Nc6, with which, I responded with 3.Bb5.",
        "2. Nf3 d6": "However, he played decided to play the Philidor's Defense.  I assume that it was to take me off guard.  The idea of throwing me off guard would've worked, if I didn't know about this defense.  But, I have played, on several occasions, played this against my opponents on this site.  Therefore, I knew exactly what to do since the next move is standard. ",
        "3. d4 Bg4": "I thought that Ted was going to exchange on d4 since 3...exd4 is the most standard response. Then, white's response to this is 4.Nxd4 which is what I would've done.  However, Ted decided to pin my N.  Not a bad way to.  But, I deemed this pin to be serious because allowing 4...exd4 would force me to recapture with 5.Qxd4 which allows black to harass my Q with 5...Nc6.  Well, I didn't want to allow that as this would lose tempo which would allow black to continue developing, whereas, I'd fall behind.  However, I overlooked one thing.  After 5...Nc6, 6.Bb5 pins the N, and therefore, does not gain tempo.  Not only that, but I'd be able to castle on the move after since that pin involves my LSB.",
        "4. Be2": "However, the possibility of 6.Bb5 didn't occur to me.  My first instinct was just breaking the pin which is what I did.  The only thing that came to mind here is what Jack Stockel taught me which is that when your opponent pins the N like this, when possible, you're best off to break it with your B.  With that being said, this is similar to pinning the N were it to land on c6 because I can castle right after this. ",
        "4... Nf6": "This move, however, puts a delay on that because Ted is threatening my e pawn.",
        "5. dxe5": "So, I take before losing the pawn.  My idea wasn't just to exchange.  Instead, I thought that he would be forced to do this on e5 to avoid losing a pawn.  As then, I'd exchange on d8 to take away Ted's right to castle.  Might not seem like a good enough reason, but in a lecture, GM Susan Polgar said that one way to get an advantage was taking the opponents right to castle.  That's because she did that in one of her games by exchanging Q's on the same file.  What I didn't think about was how black would recapture.  As I forgot about his Nf6 here.  As he'll recapture with the Knight which doesn't favor white because, aside from the loss of castling, I wasn't going to exchange for any other reason.  So, I misjudged this.  Had I thought about his N, I would've played 5.0-0, instead.",
        "5... Nxe4 6. Qd4": "At first, though, I thought that his last move might very well be in my favor.  As my first thought was that I didn't want to exchange on e4.  But, I then thought that there was no reason to get upset about my analysis as it changed to, yes, I get a lucky break.  As I later thought that 5...Nxe4 because of this move since I later thought that with his last move, Ted will lose his N or B which is why I played this move.   What I overlooked is that black can and will defend both with his next move.  And, that's when I figured that there was some mistakes in the what I was thinking.  Against a stronger opponent, I believe that this thought process would've costed me the game.",
        "6... d5 7. O-O": "Knowing that, I castled here as this was also part of my plan behind 4.Be2  Though, it wasn't possible right away, I kept in mind that castling would become possible.  So, I took advantage of that opportunity before it was gone.",
        "7... b6": "I'm not sure why Ted played this since 8.Qxd5?? is obviously is unplayable.",
        "8. Bb5+": "But, I try to compromise Ted's Q side by placing him in check.",
        "8... c6": "I'm not surprised that Ted got out with this move.  Were it not for black's N on b8, I would've played 9.Bxc6+ to win a pawn and R for B.  But, since it's out of court, I retreat to a place where he won't reattack it.",
        "9. Bd3 c5": "So, he attacks my Q.",
        "10. Qe3": "Because one of his N's is on e4, this move is forced.  As I had considered and almost played 10.Qc3??  Were I to stay as tired, I would've made that blunder.  But, I got second wind for this game which allowed me to use better judgement and avoid any such blunder.  Therefore, I came back here.",
        "10... d4": "?? I am not surprised that Ted played this.  This is a natural looking move after this first.  But, this was the real losing blunder.  In other words, it's not just the first mistake that eventually lost which is how it usually happens.  As this is how Ted wound up losing a piece.  Therefore, just about any other move was better then this because the N was protected by his d pawn which has just been removed.  What I kept in mind here was a game that GM Susan Polgar at, \"Polgar Chess University 2017\".  It was a similar situation to what happened here where Susan threatened a N fork between the R and Q.  The opponent figured out what she was threatening and defended it.  However, he, forgot about the threat later on and removed the guardian.  In doing so, he allowed Susan to win the exchange being a R for her B, and that was losing blunder as it only went downhill from there.  Knowing that, I, similarly, grabbed the N right away.  ",
        "11. Qxe4 Bxf3": "Ted takes back either thinking that it was just an even exchange or, maybe, having the idea of exposing my K which would allow his Q to swarm in.  And, he'd be able to use some of his other pieces, like what I saw with bhidragon.  I think it's more likely that he thought it was even again. ",
        "12. Qxf3": "But, I recaptured without exposing my K since my Queen is still in action, or as we call it, in play.",
        "12... Nd7": "Ted is doing what he can to compensate for lost material since he is threatening to win the pawn and fork my Q and B.",
        "13. Bb5": "So, I prevent that by pinning his N.  However, I didn't look what would happen if Ted took and fork.  I should've allowed because this is the kind of thing that Ted would do.  So, supposing I had not played this, 13...Nxe5?? would've lost even quicker.  As I would've answered with 14.Re1  Forget about centralizing the R.  Instead, this would've pinned his N in the same way.  Now, his only option would be 14...f6 which, of course exposes K.  And, I would take advantage of that with 15.Qh5+.  Obviously, 15...g6 would lose more material because 16.Rxe5  You might think that black could simply recapture with 16...fxe5??. but 17.Qxf5 would win a pawn and win the R back by forking on e8 and a8.  Thus, after 15.Qh5+ black's best option is 15...Kd7  But, I'd continue with 16.Bb5+ and after something like 16...Nc6 17.Qd5+ Kc8 18.Qxc6+ still losing the N and R because if black tries to protect his R with 18...Kb6, I'd have a mate in 2 starting with 19.Ba6.  I didn't look into the variations and just thought that black would win the pawn back.  But, this pin was enough under the technicality that Ted had to leave early.  In fact, this is when he had to do it because he had an appointment.  Being a piece down, he resigned.  Had he not resigned, I would've called this game unfinished by recording as in progress since it would've timed out.  But, Ted wasn't going to play on.  Contrary to what I said in Bonnie's last annotation, though, I would not have resigned here.  In the last one, her opponent was behind but by the equivalent to a R with which there was nothing else to learn.  But, there is still something to learn being a minor piece down.  But, he went wrong by removing the guardian as the pawn protected his N on the d file.  Attacking my Queen with that pawn is what lost it.  So, the moral is the same as what I learned in Susan's game.  If you're piece is attacked and you defend it, you don't want to remove your defender."
    },
    "url": "https://gameknot.com/annotation.pl/otb-game-2?gm=63738",
    "gameName": "OTB Game 2",
    "players": "Joe  (1332) vs. Ted ",
    "opening": "Philidor's defence (C41)"
}