{
    "moves": {
        "1. e4": "As usual, he opens with the King's Pawn Opening.  Sometimes, however, he will start with 1.d4 and attempt the Queen's Gambit.  It all depends on what mood he's in, on that specific day.",
        "1... c5": "Although my favorite is the Siclian, I actually wanted to learn the Caro Kann defense, as I had to cope with it, on two separate occasions.  One of them was against master elyhim.  However, Jack Stockel told me that it is no longer played by Masters or Grandmasters in OTB chess.  He said that the Siclian is most common, nowadays, in OTB chess.  I told him that believe it or not, the most common is also my favorite defense, and he said, \"good\".",
        "2. Nf3": "So, he decides to go into the Open variation.",
        "2... d6": "And, I continue with what I'm doing and know best.  Afterall, one of elyhim's annotation was called, \"Stick with What you Know\", when he played the Caro Kann against me.",
        "3. d4 cxd4 4. Nxd4 a6": "Believe it or not, this is still the most common move with the Sicilian.  When Jack was still teaching me the Sicilian, he said that ...a6 is the proper continuation.  The only thing is that I often see 4...Ne6, followed by 5...a6.  In fact, before this game, the same opponent actually played 4...Ne6.  I actually like ...a6, as it prevents nonsense on b5, like Bb5+, or Nb5, though.  It's hard to say what should come first, as they are both good early in the game.",
        "5. Nc3": "Although I did not play ...Nf6 right away, I am not surprised that he played this.  Sooner or later, that pawn needs protection, as I am eventually going to play that move.  In addition, this move also develops another piece.  ",
        "5... Nc6": "With that in mind, I also decide to develop.  In addition, I want to force a Knight exchange, and I will be successful in doing so.  I don't like his Knight there because I have always felt that it could eventually do a lot of damage, as that is his good Knight.",
        "6. Nxc6 bxc6 7. Bd3": "! In the meantime, he is getting ready to castle.  In my opinion, this is the best spot for his bishop.  If anywhere else, I just attack it with my d6 pawn, so that hinders his development while I develop even quicker.",
        "7... e5": "Therefore, I do not waste time.  In this position, I just want to develop my Knight on the right wing so that I can castle Kingside.  However, I do not want put in a place where it will be attacked, so I decide to block his e4 pawn.  I know that this seems pessimistic, but in the past, I have had problems by letting e4 reach a stage where my Knight gets kicked around, after it reaches f6. ",
        "8. O-O Nf6": "So, I can now bring out my Knight without having to protect or worry about it.",
        "9. Bg5": "Of course, he finds a way to attack with a pin, but that does not bother me.  Because I can easily defend that by breaking the pin.  And, doing this, also establishes even more development and will enable me to castle, at last.",
        "9... Be7 10. Ne2": "?! I figure that he made this move to distract me.  Because he knows me pretty well, and getting distracted has prevented me from castling, in the past.  But, not this time, however, so I believe this move is a waste of time.  Now, I am not completely sure, and I normally would not guess, as to why an opponent would make a move.  However, myevilluck told me that there is always a reason for your opponents move, even if it is bad, in our first mentoring game.  He said, that you should always try to guess the logic behind a move made by your opponent.",
        "10... O-O": "As I just noted, this was going to happen, one way or another.",
        "11. c3": "Now, his goal is to get his Queen out.  Of course, since he is almost completely developed, I do not mind because it is not threatening to cause any damage.  Now, I was originally thinking of just attacking b2 with ...Qb6, but I am not going to do that.  Why?  That would just be a cheapo tactic to win the b2 pawn, and I already know that he will not allow such thing, especially because he is a very strong player.  Therefore, I am going to continue properly by developing another piece.",
        "11... Be6": "It might seem weird, but this is why I played this move.  First, 11...Bd7 would block my own bishop, and a pin from 11...Bg4 would just enable him to attack my LSB with 12.f3.  Most importantly, however, is the fact that I wanted to have two vertical bishops, like this.  In a coaching or mentoring game, I saw Expert adivela do this to a class a player, known as steppenwolf.  Of course, l-d-j told me that does not retroactively=a strong bishop pair.  So, I spoke to Jack about this move, and he said it was fine, and that there was nothing wrong with it.  Therefore, based upon that, this does qualify as a strong bishop pair.",
        "12. Qa4": "Now, he decides to attack c6.  Well, I am not going to blunder away material, if I can avoid it.  As Jack Stockel has repeatedly said, \"Don't give thing's away.\"  So I have several options.  First is 12...Bd7, but I don't want to play that because I feel that it will disturb my bishop pair.  My second option is 12...Rc8?, but then 13.Qxa6, which just loses pawn.  Therefore, my decision is made to play 12...c5.",
        "12... c5 13. Ng3": "As much as, you're supposed to know the logic behind your opponents move, I am completely clueless, as to why this was played.  However, that move is not going to stop me from attacking b2.  BTW, my goal is more then just what I mentioned, about b2.  So, what am I really trying to do, in this position?  Well, I just want to get my Queen my out because it is the only piece that is not developed.  Although the center is controlled, once I release my Queen, development is complete.  So, in the main sense, I am actually going to accomplish my goal.",
        "13... Qb6 14. Qc2": "I know that this move defends b2, of course, but I am shocked that he did not do this with 14.Rb2.  Normally, pawns like these are defended by one of the rooks, in positions like this.",
        "14... c4": "In the meantime, I decide to attack d3 instead.  I always like it, when my opponents have to run back and forth in order to defend pieces because I usually arrive at a position like this, and start to get nervous.  Even if it's aimless, kicking pieces around usually keeps my optimism high and inhibits the, \"Fight or Flight\", response when I start to get anxious and, occasionally, begin hyperventilating in a chess game.  Therefore, this is a very good reason for making a move, and these type of moves show that I am thinking a little.",
        "15. Be2 d5": "So, I take advantage with this move, as it leads to an exchange.  I think that I know one of his weaknesses, but this is not one of them.  However, an exchange is certainly not harmful, in this position because I am not behind in material.  Remember when I said that I made certain moves that might seem ludicrous in order to avoid getting nervous?  Well, I now feel very confident about my position, and I believe that things are starting to get interesting here.  Of course, I am not going to underestimate him.",
        "16. exd5 Bxd5 17. Rfd1": "Now, his goal is to put pressure on the d file, but I will have none have that.  So, I am am going to make the same move, or as it is said, \"Two can play that game\".  Then, we are going to exchange pieces.",
        "17... Rfd8 18. Bxf6 Bxf6": "I also could have taken with my g7 pawn, but 18...gxf6?? would have opened my King too much, at this point in the game.  Afterall, this is not an endgame.",
        "19. Qe4": "Ok.  This more then just a mistake.  Jack Stockel would not just make a careless or reckless move, so what's going on here?  Well, remember when I said that Jack rarely blunders, unless he is trying to test you?  Well, I learned that he tests people more often then I thought, earlier today.  In fact, he does this quite frequently.   This is the thing about Mr. Stockel, he is super patient and will point out what you could have done better, if you did not find the right move.  It also explains why this concept is basically the equivalent to Master elyhim's, \"Money in the Bank\", as I had noted in a previous WTW coaching game, against this same opponent.  This time, however, I am going to fail the test miserable, and that is what will essentially end the game, as we will see shortly.  So, why is he trying to test people with these intentional mistakes?  As it turns out, if you are in a losing position there is still a chance that your opponent will get reckless and make careless mistakes.  Therefore, instead of resigning, you take time and see how you can take advantage of these mistakes.  In some cases, you could turn a loss into a win, if you are successful, so the idea is also that you will solve a problem quicker by sticking with it, instead of running away from the obstacle.  When you try to run from a difficult situation, the problem just comes back.  With that in mind, Jack is not worried about winning or losing, and he is not always trying to avoid careless mistakes himself.  Instead, he is trying to teach you, so that you can learn from your own mistakes, just like any other coach or mentor.  However, his style of doing that is great for my style of learning.  Consequently, he is an excellent coach, by my standards.    ",
        "19... Bc6": "?? As I mentioned earlier, was not paying attention.  Why?  Well, I was busy taking notes for this annotation, instead, as today is the first day, where I bring in paper and a pencil and/or pen with me to write what was played.  BTW, that is the notation that my friend id=l-d-j recommended when playing OTB chess games, and that is not all that happened, on this particular day.  Although it was not blitz or a timed game, however, there was also a time crunch because I only had about 25-30 minutes before the club had to end.  That is, when the game started, and I am now only down to about 10 minutes, at this point.  Note: the club runs from 10:00 am-12:00 pm, but it was already 11:35 am when the game started; and 11:50 am when we arrived at this position.  And, if that's not enough, I really wanted to see a game that Mr. Stockel had to show.  In fact, the games that he has previously shown is why I went from just being a chess player and commenting in threads to being an annotator and a commentator.  In this context, showing people a game is the equivalent to annotating a game, and I have and do comment on the positions that this opponent shows.  Although he does not write them, Jack actually explains what went wrong and walks through the process of how we can improve.  BTW, that is also the main reason that I joined the, \"Walking the Walk Club\" by easy19 followed by, \"Walking the Walk and Learning How to Run Club\" by jstevens1 because it basically does the same thing and, therefore, matches my style of learning.  This also explains why I honor and recognize him as another helpful coach in the club by Joann.  What he shows is so inspiring, but had this game lasted more then 5 minutes, it would not have been feasible for him to do that.  In that, I did not take enough time to spot this feasibility.  Although not immediate, this move will eventually lose and is, therefore, a losing blunder.",
        "20. Rxd8+": "Of course, my opportunity is gone, so he decides to force an exchange.  Note: I am in check which is why it is not feasible to take his Queen, in this position.",
        "20... Rxd8 21. Qg4": "After that, he will not give me anymore chances to take his Queen.",
        "21... Rd7": "So, I move here with the idea that if, 22.Qxd7, 22...Bxd7.  Of course, I start to resort to unsound aggression because I missed an opportunity that I want back. But, that is never going to happen.  Instead, we are going to exchange pawns with 22.Bxc4, Qxb2.  I also get a little reckless, due to our time crunch.",
        "22. Bxc4 Qxb2 23. Nh5": "In this case, a Knight on the rim is dim.  He is threatening to do the unthinkable, in this position.  That's right, he is actually threatening mate or he wins bishop, if I prevent that with my pawn.  Of course, I can play 23...Qxa1+, but then 24.Bf1, and the threat of mate or serious loss of material is shortly back.  Instead, I have to think about how to handle the threat.  So, I spoke to my opponent and told him that I do not have many options, other then 23...Kf8, and he agreed with my assessment.  In fact, he said that this is about my only move here.  After that, he will force an exchange in the worst way.  This time, I will have no choice but to open up my King with 24...gxf6 after 24.Nxf6.  So, this move is actually going to expose my King as the eighth rank will be under attack.  Therefore, the game is going to end very quickly, as it is a lost position, with no way around it from here on in.  Note: Right now, none of us are being optimistic, but it is only due to the fact that we have to finish our game ASAP, so that he can show us a game, as I mentioned on move 19.",
        "23... Kf8 24. Nxf6 gxf6 25. Qh5": "Although, the game continued for a little longer, it does not last more then 5 moves from now.  In fact, I think that it ends in 2-3 moves at this point.  With that in mind, I resign very shortly after this.  So, why didn't I annotate anymore?  Because unlike before, this time, the positions are identical to the actual game, except for this move.  After that, however, I completely lost track of what was played because he started showing me what went wrong, as I was getting ready to resign.  BTW, that does not usually happen, but this is an extenuating circumstance.  Around this point, things have to end, or there will be no time to see the game that Jack wants to show, and I would certainly do anything to see it, even if I had to end things early.  But, how was this game lost?  Well, he plays something like Qxh7, winning a free pawn, and that is the very least of my problems.  After that, his Queen does reach the 8th rank resulting in a very serious check, but I am not exactly sure exactly how it happened.  And, it's not quite the same as this position, which is why I did not continue the annotation.  What I do know, however, is that after the check, I would have been forced to give up my Rook in order to avoid mate.  After that, he told me that I would be too far behind in material, to have any hope of catching up, so the game is dead lost, at this point even with best play.  Now, he taught me something very interesting after showing the game, and this happened while we were packing up and saying goodbye for this week.  What he told me is the moral of this game and pretty similar to the game he showed about the importance of paying attention.  Therefore, what is the lesson?  Well, in chess, you always have to pay attention and concentrate not just on the position but your opponents mistake as well, which is why he tests people.  If I had focused a little more, I would have seen his mistake and won the Queen, so like my game against bigpeta, I had a win that I threw away.  However, there is more then meets the eye.  Paying attention to and understanding the positions take time.  As he said, \"It doesn't happen in just one second\".  So, the idea is to take your time and concentrate on your opponents mistakes.  If you take enough time to absorb the information, you will be able to take advantage of your opponents blunders and ultimately pull a win, even in a losing position.\r\n   "
    },
    "url": "https://gameknot.com/annotation.pl/otb-wtw-coaching-game?gm=49043",
    "gameName": "OTB WTW Coaching Game",
    "players": "Jack Stockel (1800 USCF) vs. Joe (1166 ELO)",
    "opening": "Sicilian (B54)"
}