{
    "moves": {
        "1. e4": "So, I start off with my usual.",
        "1... c5": "Jack usually answers with 1...e5  But, he has played this before, and in fact, taught me the Siclian Defense.  However, Mr. Stockel said that he hasn't played it in a while.  What's implied is that, Jack wants to see how I do against it.",
        "2. Nf3": "Therefore, I stick to the mainlines.",
        "2... e6": "But, this is how Jack responds, and I'm not used to it.  The only variation I'm familar with starts off with 1.e4, c5 2.d6, etc.  ",
        "3. d4": "The reason for saying etc is that I play it, as though, he played 2...e6 since it's about, \"Stick with what you know\".  ",
        "3... cxd4 4. Nxd4 Bc5": "But, this, however, is where I start getting myself into trouble, as I'm familiar with this move.  I figured he'd play 4...a6 since it's still very similar but with a slightly different move order.  Therefore, although not a transposition, I wouldn't be in unknown territory.  What I didn't realize, however, is that it was all in book until we discussed it after this game.  Figuring that this was played to exchange my more active N for his less active bishop, I remember what Ken and Susan Polgar told me. ",
        "5. Nb3": "?? As I decline and reattack his Bc5.  But, according to the mentor, this is the losing blunder because of what follows which is why I give it two queries.  That's because we discussed the game, when it was over, and he said that best was to accept the exchange by continuing my development with 5.Nc3, as now, Jack implied that I went out of book.  And, in doing so, I'm going myself in so much trouble and won't be able to get out.",
        "5... Bb6 6. Bc4": "This was played to develop and to attempt some pressure on Jack which won't work.",
        "6... Qh4": "But, once he played this, I figured out that I'm in some trouble.  As of now, it's not check, but this move reminds of what happens after the Domiano Defense since 4.Qh5+ is played.  I realized that he's got pressure on my K side.",
        "7. Qd2": "?? In an attempt to reduce that, combined with wanting to maintain my castling rights without risking safety (which is the reason for not attacking with 7.g3) I played this.  However, this is a terrible mistake as I'm going to lose two pawns, without compensation.  Believe it or not, I think this is the losing move.  ",
        "7... Qxe4+": "Jack: Why didn't you play 7.Qe2  Joe: I didn't think it was a legal move because of a pawn blocking it.  Though, looking back, I see that it's what I could and should've done.  By saying I didn't think it was legal, I was implying that Ghost Vision was the key factor.  But, the cause of Ghost Vision was the distraction and thinking too much about the tourney.  The thing is that I thought that there was still a pawn at e2, forgetting about the 1.e4 opening.  Now, were it not for that distraction this wouldn't have happened.  But, in doing so, I'm going to lose material with no way of compensating.",
        "8. Be2": "Knowing what I had done and that I can't castle short, my goal is to be able to castle long.  So, I get out of check with my LSB, as opposed to, the monarch.  Later on, he said that I should've played in the tourney because of how bad I'm playing now.  I disagree about participating in the tournament this week; I wanted training which just happened to work out.  But, I agree that this is a terrible with bad performance, on my part.  However, our next game, which will be the Finale was much better, and I managed to get a draw.  I just need to learn to adapt to being put on the spot since the tourney just started on Friday, combined with the fact that it only started a minute or two before this game.  And, that's not to mention that I was feeling the affects here.",
        "8... Qxg2 9. Rf1 Qxh2 10. Nc3": "This is where I decide to continue with my development.  But, the plan is to castle long.  However, as he mentioned at the end of our game, this would've been much better on my fifth move.",
        "10... Nf6": "As now, Jack also continues with his development.",
        "11. Qd3": "My DSB was cramped which is something that I don't like as it's similar to how I went wrong in a different game.  In an attempt to undue that damage and try for completion of development and castle, I uncramb the position by advancing my Queen.",
        "11... Nc6": "Not to my surprise, Jack continues with his development.  So, I'll complete mine and attempt counterplay by putting pressure one his Nf6 with my next move.  However, he said something that I don't buy since ION told me not to trust my opponent.  Jack: you're in trouble.  Joe: I might have a way around that.  I know that, to an extent, it's true but don't believe that I'm in too much since I'm prepared to play my next move, anyhow.  After my next move, it was implied that my mentor anticipated as he said, \"that's allowed.\" ",
        "12. Bg5 Qe5": "This, however, undoes the pressure and stops me from castling, which is no wonder why he said that.  Thus, I was shocked to see Jack play this, but it's the only reason I can find for him moving here.  BTW, 12...Ng4?? was almost played, but with the glacoma he mistaked my pawn for the Bishop.  But, by feeling it, which is similar to blindfolded chess, he figured out what would happen and refrained from making that blunder.  So, some say it's not good and others use it.  I do use it since TA has, so my model for that is, \"expect the unexpected\".  Overlooking what's attacked, though, the game chat resumes.  Joe: What if I castled?  Jack: What about your Bg5  By that, he accurately said that castling will result in the loss of, yet, another piece.  If that happened, I'd resign right then and there.  Knowing what I overlooked and the mistake that was almost made, I go in a place that I think will leave me in better shape.  ",
        "13. Be3": "?! But, I overlook his next move which forces an exchange.  Therefore, better would've been 13.Be3  By bringing it back, he's going to exchange my more active Bishop for his less active Bishop which is something that I didn't want or have in mind.  To be truthful since I made a similar mistake with dynamic_dv, the only reason behind this retreat is because I studied a training game where the teacher brought his or her B directly in front of the other Bishop, like this.  However, I forgot something very important Ken told me which was to base it on the position.  And, in this case, not only didn't I base it on that, but the position was almost of no concern to me.  In other words, it didn't even come into consideration which is what's not supposed to be done.",
        "13... Bxe3 14. fxe3": "I take back with a pawn, for had I recaptured the other way, he would've forced a Queen exchange, which to me, adds insult to injury since things are bad enough, as is, for white.",
        "14... Nb4": "Due to my refusal to exchange he kicks my Queen which doesn't bother me, at the least.  As now, being put on the spot is coming to an end.  So, I'm to retreat in a spot where my c2 is still protected, and where a Rook remains mobile.  Therefore, it'll be on d2.",
        "15. Qd2 h5": "He said something like, \"I'm just going to keep pushing with my passed pawn until it promotes.\"  So, I'm thinking about what to do.",
        "16. Rh1": "With that comment and thought process, I figured that Jack forgot about this move since it stops the pawn from promoting.  And, I remember this from a previous Homework, some time ago, that he gave me.  You use your Rook to stop the passed pawn that right in front of the opponents Rook.  This time, I feel that my instincts are spot on as I do last longer.  Believe it or not, while I was in rough shape and, thus, really struggling, I'm already starting to feel more confident which will come up later in the game chat.  As now, I'm feeling less and less pressure. ",
        "16... b6": "Not knowing why Jack played this, I figured that he was just going for a pawn chain, which is meaningless to me.",
        "17. Nb5": "As I attempt to put pressure on Jack, knowing that he can't take my N.  But, there's more to the story then just pressure.  Won't say that it is since it's not.  The idea, though, is the same as Hope Chess, as I'm just hoping that Mr. Stockel will blunder, somehow, and remove the guardian by taking his Queen of the square.  If he does that, I'll wind up with the iniative with Nc7+, as suddenly, I'd win his Rook with the N fork.",
        "17... Ba6": "Not to my surprise, Jack doesn't allow that.  But, that's where I come up with the second plan, after my last move.  He, however, implied that it was a blunder.  The problem is that I only calculated 2 variations, but you need multiple variations.  One or two isn't going to cut the mustard.",
        "18. Qxb4": "Jack: You took my Knight?  Joe: I think that I've got my advantage back.  Jack: How do you like that.  Lol.  I just smiled after that to imply that I like it a lot.  And, I said that because I didn't feel any more pressure, from this point forward.  Plus, I calculated 18...Bxb5, as then, I was going to play 19.Bxb5 but had overlooked what came right after that.  In doing so, I, somehow, wound up forgetting what Ken told me about calculating multiple variations since I only bothered with one or two here.  ",
        "18... Bxb5 19. Bxb5 Qxe3+": "As this is the move that I missed.  Sure, I've got things back, for now, but my King is completely exposed.  Instead of feeling confident, I should've realized that I was under pressure and asked myself the same question that I asked myself which kenneth_fiore_3 asked me.  And, it was how to get out of problem.  The problem was that, after what took place, I, shockingly, forgot a lot of important things that took place in that training game which didn't happen on our second game.",
        "20. Be2": "Still trying to be able to castle long, I used my Bishop to get out of check but forgot about his next move which is going to prevent me from castling, at all since I'm gonna have to my monarch, after his next move.",
        "20... Qg3+ 21. Kd1 Nd5": "After which, Jack kicks my Queen.",
        "22. Qd4": "Not trusting him, I move it here.  The idea is to Jack will play 22...Ne3+, one way or another.  But, if I wasn't careful on where he'd win my Queen, as now, I remember something from my training game with Ken.  And, it's, where do you move your Q?  After careful consideration, I decided that this was the place to go.  For had he won it, I'd resign, at once.  By playing this, I'm still in the fight and keep it in perspective, as I did earlier, which was also how I gained confident but, unfortunately for me, it was at a bad time.",
        "22... Ne3+ 23. Kd2": "Feeling more and more confident, I bring my K right here.  In fact, Jack said, \"You nasty man.  It's a good move.  I cannot defend it.\"  I don't agree with this because there's no immediate win of material, but the idea is becoming a, \"Mr. tough guy\" as Jack implied with his first sentence on this move.  Sooner or later, I was planning to bring it up, move a rook over and then, bring it back down.  As then, it's the equivalent of castling.  So, by checking me the way that he did, I add an attacker to put more pressure on him.  It doesn't work.  I did anticipate him bringing it back but didn't realize that it was right in a spot where my Queen is reattacked.\n",
        "23... Nf5 24. Qe5": "?? Consequently, my next plan is to attack his 7th rank with Qc7.  This, however, is a terrible blunder that I overlooked as Jack could and should win my Queen.  When planning my on getting tough, I overlooked this basic threat which isn't good because, back in the day, this was something that I was trained not to do.  In fact, it fell right into the same category of not allowing the nasty checks or mate which is also a basic rule.  Therefore, it is a basic blunder.  ",
        "24... Rc8": "But, Jack puts a stop to that in order to prevent me from getting counterplay.  But, this is where I get really greedy.  Seeing that his h5 is week, I felt that there was no way he could defend it.  So, I take, at once, with my next move, and when he takes back, I recapture with 25.Rxh5  And, when I played that, he said, \"Nasty man.  This man is getting tough.\"  However, I forgot that my Queen is still hanging.  Therefore, best was still 24...Qxe5, at once.  With his glacoma, Jack has been known to miss moves like that. ",
        "25. Rxh5 Rxh5": "Taking my Queen is still the best move.  It's that we both overlooked it for several moves.  The reason I did was because of how poorly Jack said that I played which still gets to me, even at this phase.  When I tend to forget about it is the moment that the game ends.  I've got to find a way out of that, and no amount of training is going to help me since these things happen to me on the spot, against Jack.  There's no control of when it happens.  I think the lesson is taking the bad with the good and thinking about when I'm playing those good moves so that things like this doesn't get the best of me.  That's been an ongoing problem for years, to be exact.",
        "26. Bxh5": "Taking on g3, so 26.Qxg3 was still the way to go.  Then, he's forced to take back with 26...Nxg3, after which, I could've gotten his Rook with this move.  And, all of a sudden, the advantage has turned in white's favor, thus, pulling a swindle in a lost position, by my books.  The problem I had here was repeated episodes of Tunnel Vision since I got obsessed with taking the pawn on h5 but missed the bigger picture caused by overgeneralizing what Jack told me earlier which is a known weakness for me.",
        "26... Qg5+": "I said that because what I forgot is that I'm in check.  And, it gets worse.  He still missed 26...Qxe5, but this is also bad, as now, I'm going back down a piece.  I think getting greed and overanalyzing what he said is how I wound up missing my Queen being en-prise.  And, the reason for Jack forgetting to take it was the glacoma as I've seen that kind of thing before.",
        "27. Kd3 Qxh5 28. Qb5": "But, I get interested in trying to get a pawn.  So, I play this with the plan being my next move.",
        "28... Nd6": "Not sure why attacked it since my plan, as noted, is to play 29.Qa6",
        "29. Qa6 Qf5+": "But, I overlooked this check.  From here, I believe it's a mate in 6.  I did, however, present it in the Chess Problems Lover's Forum.  But, they didn't believe it was mate.  I, on the hand, think otherwise, and let comments by them be filled in.",
        "30. Kd2 Qxc2+ 31. Ke1 Qe4+ 32. Kf1 Qf3+ 33. Kg1 Rc2": "And, I resigned right here because it's a forced mate.  Now, I see it wasn't in 6, but the most I'd last is 3 more moves.  It could be blocked with 34.Nd2, but then comes 34...Rxd2  This forces 35.Qe2, but then comes 35...Qxe2, and then it's mate, as 36...Qg2# would become inevitable.  However, I thought it was inevitable.  But, one thing is for sure, which is that Jack has a forced mate, so resignation was called for.  After this game, we started a new one, but Mr. Stockel gave his input on where he thought that I went wrong.  In it, he said that my fifth move was the decisive mistake.  Therefore, 5.Nb3?? was the losing blunder.  Then, Jack told me the same thing he said years ago which is how I wound up giving milly64 the wrong information in her last information, regarding the Larsen's Defense.  In it he said, that after 1.e4, c5 2.Nf3, e6 3.d4, cxd4 4.Nxd4, Bc5 5.Nc6 is what's played, but I brought the N to b3 which is where I went wrong.  Therefore, Jack said that the lesson is to play moves that are played by Grandmasters.  I disagree with that.  Even after that, I was ok, until the seventh move being 7.Qd2, as 7.Qe2 is what would've prevented the loss of material but was overwhelmed by being put on the spot.  Later on, he made a blunder, in which I failed to expolit.  That was, leaving his Rook en-prise, and thus, not liquidating Queens which would've gotten the Queen.  Therefore, I think that the real moral's is learning how to adjust my attitude when it comes to being put on the spot.  For me, the problem was finding out that I'd have less time then everyonelse which was only 35 minutes which enfuriated me.  Later on, though, I decided to get to the bottom of it, once and for all, before it could affect future games.  That's when I asked him why I'd be given less time then everyonelse which is, of course, due to being a stronger player.  Before that kind of thing affected my chess games, it was problematic in life and wound up getting nasty and, in one case, having a temper tantrum when that happened.  So, what to realize is that, sometimes, there are inconviences, and life is about being put on the spot.  Therefore, you just have to be flexible.  The other moral is not overanalyzing what someone tells you, even the coach.  That's part of not trusting your opponent.  And, be it note that overanalyzing anything was a problem that dates back to before I started playing chess.  It's the main part of my disability which still needs to be worked on.  In the future, if I play, and Jack says oh this was bad and now you're in trouble.  What I've learned is not to take it too seriously, and just play normally so that it won't get to me.  Those factors will enable me to make better decisions which will lead to better results. "
    },
    "url": "https://gameknot.com/annotation.pl/otb-wtw-mentoring-game-semi-finale?gm=61652",
    "gameName": "OTB WTW Mentoring Game-Semi Finale",
    "players": "Joe (1333) vs. Jack ",
    "opening": "Sicilian (B40), Anderssen variation"
}