{
    "moves": {
        "1. e4": "This is a pretty standard opener for me; I sometimes play 1.d5 too.",
        "1... g6": "Black plays the Robatsch (Modern) defence. He aims to put his bishop on g7, pressurizing White's central pawns, and to castle kingside where his king would be quite safe from attacks.",
        "2. d4": "I place another pawn toward the middle of the board.",
        "2... Bg7 3. c4": "I put a third pawn toward the centre of the board. If Black plays too passively here, his pieces may lack manoeuvring room later on...",
        "3... c5": "However, this is a good way to start breaking White's center.",
        "4. d5": "Taking the pawn would be bad, as it would completely disrupt my pawn formation. Besides, Black could immediately regain the pawn via 4...Qa5+. A downside to 4.d5 is that it leaves d4 and e5 to Black.",
        "4... d6 5. Nc3 Nf6 6. f3 O-O 7. Be3": "Natural developing moves.",
        "7... e6": "Black starts to contest White's imposing center.",
        "8. Qd2": "Taking on e6 would leave Black with a somewhat backward e pawn, but it would have released some pressure on Black. I'd rather slow down the game and complete my development first, as Black do not have any significant lines of attack right now and my slight spatial advantage might be enough to win in the long term.",
        "8... exd5": "Black tries to open up the game, as my king is still in the middle of the board.",
        "9. cxd5": "This is better than taking with the e pawn, as the latter option would open up the e file (my king is there! Thought I could castle queenside) and it would leave f5 for his bishop. However, taking with the c pawn allows Black to break through the queenside more easily later.",
        "9... Na6": "Black plans to place his knight to c7 next turn in order to support a b7-b5 breakthrough and storm my queenside.",
        "10. Bxa6": "!? However, I decided to give away by bishop pair to take out his knight while I can. Since the position is relatively closed for now, knights might be more useful than bishops! As a small bonus, this move frees up space for castling kingside.",
        "10... bxa6": "The good news are that Black's queenside pawns are busted. The bad news are that the b file is quite open to his pieces...",
        "11. Nge2 Nd7 12. O-O": "Normal development.",
        "12... Ne5": "! This is quite annoying... I can't play 13.Bh6 here due to 13...Nc4.",
        "13. Bf4": "I played this so that 13...Nc4 does not force a trade of pieces. 13.b3 would be dangerous due to the bishop on g7 looking at my rook on a1.",
        "13... Rb8": "Black pressurizes my b pawn and threatens to play Nc4 once again.",
        "14. Rab1": "I move my rook out of the a1-h8 diagonal in order to support my endangered b pawn.",
        "14... Bd7 15. b3": "!? This is a bit risky, as Black may push his pawn to c4 and blow open my position if I misplay later on.",
        "15... Qa5": "Pressurizing my queeside even more, and pinning one of my knight to my queen. However, nothing is really threatened yet.",
        "16. Bh6": "Finally!",
        "16... Bb5": "! The threat here is 16...Bxe2 17.Nxe2 Qxd2 18.Bxd2, leaving all my pieces back in my base whilst Black's would be well positioned to attack me. This also pins my second knight to my rook.",
        "17. Bxg7": "!",
        "17... Kxg7": "! Black plays the correct move. 17...Bxe2? would have lead to 18.Bxe5 dxe5 (Forced, as White was threatening 19.Bf6 followed by Qh6 and Qg7#.) 19.Qxe2 or Rfc1 and white gets a monster passed pawn.",
        "18. Rfd1": "Now that my bishop does not cover my queen anymore, I had to parry the threat of Bxe2.",
        "18... Bd3": "! Black puts a huge thorn in my side of the field.",
        "19. Rb2": "I move my rook out of danger. I'm not quite sure why I didn't play 19.f4 here, as 19...Bxe2 20.Nxe2 Qxd2 21.Rxd2 Nc4 doesn't seem horrible for white.",
        "19... c4": "! Black bolsters his pesky outpost on d3. I cannot take the pawn on c4 due to 20...Nxc4 21.Qxd3 Nxb2 22.Qd4+ Kg8 and Black gets a rook for his bishop.",
        "20. Nf4": "I move my knight to threaten the bishop and hopefully shoo away Black's forces away. If I can hold on the position, I'd have a better pawn structure in the finale!",
        "20... Rfc8": "! Black springs the last of his pieces into the action, placing his rook on the maybe soon to be opened c file, bearing down on my knight. I can't really play 21.Nxd3 here due to 21...Nxd3 22.Rb1 or Rc2 cxb3 and then it gets bad for me.",
        "21. bxc4": "!! Yes, I declared this move as bad like 1 turn before. However, 21...Nxc4 is now met by 22.Rxb8! Nxd2 (22...Rxb8 23.Qxd3 and white is very fine)  23.Rxc8 (Protecting c3!) Bc4! and the position is very unclear.",
        "21... Rxb2 22. Qxb2": "Rook trade. My queen is sneakily lining up to his king too!",
        "22... Qc5+ 23. Qf2 Qxf2+ 24. Kxf2": "Queen trade. I felt that the trades advantaged me more than my opponent. My king is closer to the centre too!",
        "24... Bxc4": "Black regains his pawn. The material is now equal. However, my pawn structure is stronger than my opponent's.",
        "25. Rd2": "! I place my rook in my second rank. Black was threatening 25...Bxa2! 26.Nxa2 Rc2+, forking my king and bishop. On a side note, Black does not have any good discovered attack on my knight right now.",
        "25... Rb8 26. h4": "I ensure that Black does not play g5 to poke my knight out of f4 in order to land a piece on d3. Black does not have any entry squares available on my side of the field!",
        "26... h5 27. Nfe2": "I decided to move my knight away anyway. Black's plan to play Nd6+ Nb4 a5 a4 a3 Nxa2 Rb2 takes so many turns, I have the time to redeploy some of my pieces!",
        "27... a5": "As expected, Black tries to break through the a file.",
        "28. Nd4 Nd3+": "Black's first major mistake. His plan is just too slow to be effective. Better would have been to bring the king closer I think. To be fair, he was in time trouble at that point in the game. Bot players get an extra 45 minutes after the 30eth move.",
        "29. Ke3": "I threaten to trade my rook for Black's minor pieces here. 29...Rb2 30.Rxb2 Nxb2 31.Ndb5 Bxb5 32.Nxb5 Nc4+ 33.Kd4 and Black's d pawn is a goner.",
        "29... Nb4 30. Nc6": "! I fork both of Black's a pawn and his rook! He also can't trade knights here, as 30...Nxc6 31.dxc6 and white's passed pawn is extremely dangerous.",
        "30... Rb6 31. Nxa5": "I take out Black's advanced pawn while also hitting on his bishop.",
        "31... Bb5": "Black's pieces are badly coordinated and have only a few safe squares available.",
        "32. Nxb5 Rxb5": "Knight vs Bishop trade.",
        "33. Nc4": "! Black cannot defend his d pawn.",
        "33... Kf8": "He finally brings his king closer to the battlefield, though f6 might have been a better square to do so.",
        "34. Nxd6 Ra5": "Now it is I that cannot save my pawn.",
        "35. Rb2": "! Well, if black wants to take my pawn, he'll have to do so with his knight! Which puts it a little away from the action. Also...",
        "35... Nxa2 36. Rb7": "! Counterstrike! Black is in serious trouble now.",
        "36... f5": "This allows black to trade the pawn instead of simply losing it. 37.exf5 would cause some issues after 37...Rxd5.",
        "37. Kd4": "! I'm bringing my king closer to stop Black's a pawn... Or am I? (Side note: I'm also preventing Nc3)",
        "37... fxe4 38. fxe4": "I need to secure d5 to keep blocking Black's pieces off his king.",
        "38... Ra4+": "A spite check, accomplishing nothing.",
        "39. Ke5": "Getting closer...",
        "39... Nb4 40. Kf6": "GETTING CLOSER...",
        "40... Ra6": "Black is busted no matter what. 40...Kg7 41.Kxg6 Kf8 42.Kh7 and 43.Rf7#",
        "41. Rb8#": "And that's game. Overall, It was a pretty solid game from both players where I took a risk early on (trading on a6) that ended up paying its dividends later on after a long sequence of precise defense. Please feel free to comment and rate. Thank you! -a_random_guy"
    },
    "url": "https://gameknot.com/annotation.pl/otb-game-defend-and-counter?gm=59341",
    "gameName": "OTB Game - Defend and counter",
    "players": "Me (1789) vs. Opponent (1921)",
    "opening": "Robatsch (modern) defence (B06)"
}