{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Bb5": "As usual, it started off with the Spanish Opening.  But, I was interested in seeing how he would respond since Jack plays different moves.",
        "3... Bc5": "Like our last training session, he played this.",
        "4. O-O": "So, as I have also emphasized the importance to a student, I castled.  He said, \"Aha, very smart\", and I smiled.",
        "4... Nd4": "I was a little anxious, but using Jack's advise of not getting nervous, which I've stressed to two of my students, I took a while to think.  I asked myself if there was an alternative and considered 5.Nxe5.  But, after 5...Qe7, not only would he Jack get a pawn back, but I'd wind up losing tempo.  Aside from that, anything else looked nasty.",
        "5. Nxd4": "So, I decided to take this way.  He said, \"Sure, you have to.  Otherwise, you lose your bishop.  Right?  I said, right.  Of course, I realize that by looking at it on this website, that really isn't so, but I thought it was by the looks of 5...c6, or 5...a6 which I was determined to prevent, for now.",
        "5... Bxd4 6. Nc3": "Figuring out what to do after his last move, I decided to play this.  The idea being that not only do I continue to develop, but I am not concerned, if he doubled up my pawns with 6...Bxc3  The idea being is that we haven't exchanged major pieces.  I know that it depends on the position.  But when I'm not sure in a particular position, then I go by what tactical-abyss told me, as it makes sense to me..  In it, Joe has said that doubled pawns are, usually, of no real asset, until major pieces have been exchanged.  ",
        "6... Nf6": "Not only continuing with his development and preparing to castle, but he is threatening e4.  And, I must be on the lookout, as otherwise, he will that pawn after 7...Bxc3, and when 8.PXB, he has 8...Nxe4, which I was not going to allow.",
        "7. Re1": "So, I protect it.",
        "7... a6": "Now, he goes on the attack, against my LSB.",
        "8. Ba4": "I also considered 8.Bc4, but the problem is that it allows 8...b5, and now I have to block my d3 or e2 files which is the center (lest, I undevelop my LSB), or I am forced to play 9.Bb3 which just loses time, any how.  So, to save that, I decide to retreat on the most common square.",
        "8... b5 9. Bb3 d6": "Opening up a line for his Bc8.",
        "10. a4": "Thinking about what to do, I play this.  Now, I had considered 10.d3, to open up lines for my Bc1, but I was determined to prevent 10...b4, which would force me to place my Nc3 on an uncomfortable.  What I mean by uncomfortable is that you must place it on the homesquare.  Come to think of, is could've been allowed, as there is a better placement since Ng3 would become an option, later on.  But, what really went through my mind, in calculating variations was something like 10...b4, 11.Ne2, a5 (as now it would not be possible for me to take on b5), and that would be followed by ...a4, losing a piece for a pawn.  Plus, I thought it would allow Jack to get an open file, which is the last thing that I wanted.  It's especially because, in one of TA's Q sacs, (not on the weakest square) the opponent lost by allowing Joe to get an open file.  Therefore, it is example of how I learned from that game and applied for this one.",
        "10... Bb7": "Placing his B on a flank.  But, I've got a surprise for Jack.",
        "11. axb5": "And, he said, \"It's a good move.\"  One of the reasons I did was to exchange pieces and eliminate Jack's Ra8 before he can get an open file.",
        "11... Bxc3 12. dxc3 axb5 13. Rxa8 Bxa8 14. Bg5": "Therefore, I decide to go right for it and pin his N.  That's is another reason for playing 12.dxc3, as opposed to, 12.bxc3  Now, I'm confident that the center is contested which was also the goal.",
        "14... h6": "When you can use the B on the same square, Jack will often respond with something like this.  The idea being is that he doesn't like being pinned.  I can't blame, especially after the blunder I made in his pinning motiv which allowed him to win, quickly.",
        "15. Bh4": "? I was thinking about what to do.  15.Bxf6 strongly came into consideration, but the reason I didn't capture was to prevent 15...Qxf6, which appears to leave Jack better placed, since his Q would be more mobile.  However, this is a mistake which will give him an advantage, for once I retreat, he will a pawn.  I overlooked it due to playing 7.Re1  But, with his B on a8, my extra defender was gone, as he now has an additional attacker.  Therefore, best was to take his Nf6.",
        "15... g5 16. Bg3 Nxe4 17. Qf3": "Trying to recompensate for lost material, I played this.  I'm not trying to mate, but that's the threat.  Believe it or not, Jack told me that this was a blunder and asked me what happened if he plays 17...Nd2 forking my LSB+Q.  I told him that I would deliver mate with 18.Qxf2#  In fact, that's what was initially played, but since this is a training game unlike with an OTB tourney, but similar to what we see (before hitting submit), there are take backs.  Mr. Stockel told me why he made that mistake, and it is due to his glacoma.  He confused my LSB for a N.  In other words, he thought that a N was on b3, as opposed to, my Bishop.  Having corrected the mistake, he accurately said that 17...Nf6 is the only option.  After moving there, he said, \"My piece is protected\", and I nodded.  In fact, I realize that there's more to this then meets the eye.  For once he retreats to f6, my Q will be attacked which will force to get it out of harms way.",
        "17... Nf6 18. Qe3 Qe7": "Jack: I can give you a pawn for a piece.  After seeing how it happens when I take, I said, yes, but if I take your pawn, I lose a pawn.  He said, \"right\".",
        "19. Qa7": "Trying to get something.",
        "19... Kd7": "Joe: Wow, I overlooked that.  Jack: With my pawn on d6, my piece is protected.",
        "20. Qa5": "So, if I can't get his LSB, I'll, at least try to win back a pawn.  But, Jack prevents this with his next move.  ",
        "20... Bc6 21. Qb4": "Before moving here, we discussed it.  The reason being is that I was planning to play 21.c4, but after seeing what happened in my game against bhidragon (which I showed Jack before this game), I decided to discuss this, first.  Joe: If my Queen weren't out of play, I'd play 21.c4  Jack: The only problem is 20...Ra8  In it, he implied that I'd lose tempo since my Q would be forced to run back.  Well, as we know, tempo, in general is vital.",
        "21... Ra8": "Jack: Very dangerous now.  Joe: For white or black?  Jack: For black.  Maybe, I'll play here.",
        "22. c4": "Knowing that I don't have to worry about tempo loss and the fact that my Q isn't out of play, this is where I go for the gusto.  He figured that this is where I'd sac a piece for a pawn for something else which is not as good.  Jack: I thought you'd play 22.Bxe5, and I'd respond with 22...Qxe5.  And, if you take with 23.Rxe5, I have 23...Ra1#  So, this is your best move.  I agreed as we played through these variations together (which we typically do, as Homework that he gives me), and it's the same idea as when I play through them here with analyze the board.  So, I nodded, but there was one thing we both overlooked which is the same thing to what happened to me in a couple of annotations.  The fact is that 23...Ra1+ isn't mate right away.  After he would play that, I'd only have one move which is 24.Re1, but then 24...Rxe1#  Therefore, the point is that he would sac his Queen for a mate which you see, sometimes.  ",
        "22... bxc4 23. Qxc4": "I also considered 23.Bxc4 but saw an issue with that as it would cost me a piece.  So, I said, to prevent ...Ra4, I decided to take with the Queen.  And, he responded by saying, \"You could.  No question about that.\"",
        "23... Rf8": "This time, however, I have no idea why Jack played this.  ",
        "24. Ba4": "In the meantime, I was concerned about 24...Bd5  For, if he played that, I'd lose tempo.  So, I decided to prevent that by responding with this move, as now, his B is directly pinned.",
        "24... Bxa4": "Jack: I'll get rid of your Bishop.  However, this did not bother me, as I figured that he would play this.",
        "25. Qxa4+": "So, my response was, obviously going to be recapturing.  Therefore, although not on GK or with the features, 24...Bxa4 was a conditional move because it was preorganized.  So, under the condition that he took, I'd take back.  However, I forgot to do something important.  While there's no rule about it on this website, in an OTB tourney, when you place your opponent in check, you must announce.  If you fail to do this, and he or she did not realize that they were in check, you're not allowed to capture the K.  So, there's no checkmate.  Jack: You said check, right?  Joe: Forgot that it was, as I mixed the colors up.  The only problem (why I find fault with myself) is the fact that I have been doing that quite a bit.  What really upsets me is that I was, on one or two occasions giving one of my students the wrong information by reversing the colors, like this.  Therefore, I'm trying to turn that from a weakness into a strength, but the problem is still around.",
        "25... c6": "I thought Jack would respond with 25...Ke6, but this is how he gets out of check.",
        "26. Qa7+": "But, this time, I announced check.  Jack: I figured you'd do that.",
        "26... Ke6": "Joe: And, I figured that you'd do this.  Jack: I don't know, if I can get out of trouble.",
        "27. Qxe7+": "Not knowing what to do, I decided to check and exchange Q's.  Believe it or not, the only other move that came into consideration (after looking at a couple of choices) was 27.Qa6  But, the only reason I would play it would be in hopes of winning his c6.  However, I knew that my coach would not allow that, and would thus, be an unsound plan.  That's because he'd respond with 27...c6, and as we know based on what my coach stated and a mentor implied, \"Start thinking.\"  In other words, don't assume anything, which is something I stress to my students, as well.  However, I knew how dangerous his Q was based on how Mr. Stockel used it earlier.  So, I decided to get rid of this, at once.",
        "27... Kxe7": "Forced.",
        "28. Rd1": "Jack: You put your Rook there?  I nodded.",
        "28... Ra8": "Jack: I'll put my Rook here.  Joe: Ok, let's see what happens.  Jack: Yeah, let's see, it's interesting.  Very interesting.  And, I knew he'd say that it was interesting because that he frequently does, so I nodd.",
        "29. Rb1": "I anticipated 29...Ra2, as this would threaten to win my b2 pawn.  Knowing this, I also considered 29.b3, but he can still bring his Ra8-a2, and threaten c2.  So, to prevent that mess, I decided to move here.",
        "29... Ne4": "At first, I viewed this move as pointless.  But, then I figured out that he could double my pawns which I'm now trying to prevent as major pieces have been exchanged.  However, I saw a bigger danger which was ...h5, followed by ...h4, and if Jack could get his h6-h4, I'd lose a piece for pawn since my DSB would be locked in.",
        "30. f3": "To prevent that, I decided to move here.  The idea being is that, if Jack is to advance his h pawn, I could get out with my DSB. ",
        "30... Nd2": "Not only protecting his N, but threatening my R, in the process.",
        "31. Rd1": "So, I reattack by hitting his N.",
        "31... Nc4": "And, Jack goes after my b2 pawn.",
        "32. Rb1": "Which I protect.",
        "32... Ra2": "But, what I overlooked was this move.  When, he first played this, I wasn't afraid because I thought that if 32...Rxb2, 33.Rxb2, winning the R for a pawn.  But, with his Nc4, Jack would answer with 33...Nxb2, winning a pawn and liquidating.  For that reason, slightly better was 32.b3, and if 32...Nd2, 33.Rb1, so I'd get, as opposed to, losing time.",
        "33. b3": "But, now I do hit his N.  Though, as noted, I think it would've been better a move earlier.",
        "33... Nd2": "And, Jack reattacks.",
        "34. Be1": "?? But, I overlooked that my c2 pawn and R are attacked.  With that, Jack can and should win my R.  Best was 34.Rc1, protecting both.",
        "34... Rxc2": "Luckily, Jack overlooks it and takes my pawn, instead.  Though, I'm not happy with that blunder.  It means, however, that we both overlooked my Rb1 being attacked.  With my coach, however, it's excusable (I excuse it do to his glacoma.)  But, I don't excuse my blunder because, in this case, I moved too quickly and, therefore, did not take enough time to think before playing 34.Be1",
        "35. Bxd2": "Coincidentally, I took his N, as this was part of my plan, anyhow.  But, now I'm glad he did, otherwise, Jack would've taken my R.",
        "35... Rxd2": "For the obvious reason, he recaptures.",
        "36. b4": "Although it's not a passed pawn, I'm treating as though it were, and I remember that passed pawn must be pushed.  The point is that I'm treating b4 like a dangerous pawn since the plan is to promote, if black does slip up.  But, I know that with my coach, chances are very slim that this would occur.  However, since I'm at a disadvantage and am going for counterplay, I might as well play Hope Chess because the idea is hoping for a mistake that will allow you to get an advantage.  And, as we know, this once happened in a lost position, after being a R and two pawns down where he made a mistake and allowed me to mate in two.",
        "36... d5": "But, Jack sees my intention and stops it.",
        "37. Rc1": "With that being said, I figured that Jack made a mistake.  So, with his last move, 36...d5, I thought that I was going to win back a pawn.",
        "37... Kd6": "But, he found the only move to prevent this, up to my surprise.",
        "38. Rc5": "?? So, I decided to put pressure on his pawn chain, with one being a passed pawn.  The idea was to stop.  But, Jack pointed out that this loses immediately because of...",
        "38... Rb2": "This move, and with it, Jack said, \"I am going to another pawn.  So, it is safe to resign.  Therefore, best was 39.Rb1, but with my passed pawns, it's still lost for white.\"  And, we explored through different variations including giving me back a pawn or two.  But, then, he'd take a different pawn and promote.  After the game was over, we discussed it, and he said that I played very well.  In fact, I did not give away a piece, which after analyzing it here, I actually did.  But, it wasn't until 34.Be1?? which should've lost a R.  However, he said that where I really went wrong was blundering a pawn or two which is what sealed my fate.  And, that's where, \"Don't give things away\" applies.  And, that is a very typical theme.  In fact, he brought me back in time, and I reflected back on some of those GM annotations that I studied as there similar.  So, in it, Jack told me that Grandmaster's, in general, don't give away pieces, which for them is hard to do.  But, they do make a mistake that loses a pawn or two which is very easy to do but enough to lose the game.  The idea being is that those pawns make the difference in the endgame because it, generally, boils down to a one or two extra pawns that become passers which they'll use to Queen.  And, when that happens, it's lights out for their opponents."
    },
    "url": "https://gameknot.com/annotation.pl/otb-wtw-coaching-game?gm=60185",
    "gameName": "OTB WTW Coaching Game",
    "players": "Joe (1347) vs. Jack Stockel ",
    "opening": "Ruy Lopez (C64), classical defence, Zaitsev variation"
}