{
    "moves": {
        "1. e4 e5": "Not only am I not surprised by this move, but I would be surprised if he didn't play this.  In all of our games, he does play this.  And, like my game against tipsyjourneyman, I know Ted very well.  With that being said, this is going to become a Ruy Lopez.",
        "2. Nf3 Nc6 3. Bb5 f6": "I don't know why he played this.  ? But this is more then an inaccuracy, in my opinion which is how I used to feel, but I actually give it as a mistake.  For one thing, this doesn't develop.  Second, as I recently learned from tactical-abyss, f7 is the weakest square for black on the chess board.  By playing this, Ted has left himself a weakness, that I will now calculate and try to find a weakness.  If I can do this, it will be exploited. ",
        "4. O-O": "With that being said, I considered 4.Nxe5, with the idea being that if 4...fxe5, 5.Qh4+, and if then 5...g6, 6.Qxe5+ forking the K+R, as I learned in the Domino's.  With black's N on c6, however, this wasn't going to work, because taking on e5, would allow ...NXN in which, I actually would lose a piece for a pawn.  So, I find something as good, already seeing a potential weakness.  Since black has just waisted time with his last move, I was  going to get my K to safety.  Of course, that's important, and would've likely played it, anyway.  But, the other idea is that, when my development is complete, I'll have my Rooks connected which might be the cornerstone to setting up black for disaster, given that I already have a small space advantage since space is very important.",
        "4... a6": "Not surprised that he played, as I anticipated this, sooner or later.",
        "5. Ba4": "As noted in reubencuplay's recent annotation, I used to take with 5.Bxa6  This is the logic behind it, which I said there.  The reason why I didn't like 4.Ba4, was that black's next move would be 4...b5, and after 5.b3, a6, I had to think about where to place the B, to prevent 6...a4 which I think would lose the B very quickly because if 7.d5, black could answer with 7...c6  Something I was worry about, so to prevent stress (which has negatively affected performance) I exchange to prevent problems or complications.  For that reason, I felt uncomfortable doing it.  But, there's more to it then meets the eye.  In addition, exchanging on c6 doubled up my opponents including Jack's pawns.  But, as I learned from tactical-abyss, it's pointless.  He said when doubled pawns are good or not.  As a general rule, doubled pawns will benefit you on the b file.  However, they are no harmful, until major pieces have been exchanged.  After that, this is when you would want to avoid doubled.  So, in it, Joe actually stated that doubled pawns in Ruy Lopez, for example, was of no asset.  And, by that, he was actually alluding to this position.  In addition, to prevent 5...b5, as 5.c4 also would've resulted in this, I considered 5.Bd3, but the reason I decided against it is that it would cost me a tempo to get my DSB into play, when I really need that time to develop, especially if I'm to exploit my opponents weakness.  That's because Susan Polgar said that the way you punish your opponent for not opening properly is to calmly develop.  And, I ruled against 5.Be2, as now my LSB would be very uncomfortable and locked in on that square.  This would be close to as bad, as if the N were on there, since, now my Q would be blocked, whereas now, it can still be mobile.  So, with that and some very careful considerations, I decided to play the most common move. ",
        "5... b5": "As anticipated.",
        "6. Bb3": "Indirectly forced.",
        "6... d6": "Not only does this develop and give black a nice pawn chain, (which does help him with the space advantage, but he played this because of what Ted is going to do on his next move.  And, in order for this to work, there had to be an immediate opening for his good bishop.",
        "7. d4": "Unaware of this plan, my intention is to exchange.  What I am attempting is that well known variation.  So, it would be 7...exd4 8.Nxd4, Nxd4 9.Qxd4  But, black is going to get the pin which, at first, I thought I was in trouble.  But, then I found a solution to that problem.",
        "7... Bg4 8. d5": "?! The idea being is because of what I learned from Susan Polgar.  The difference, however, is that it involved the French Defense, in the Tarrasch variation.  You will note that this course was, in fact, a lecture.  The last time I listened to lectures involved unusual openings known as the Owen's, followed by, the Grunfeld Defense.  Since it was unusual, it was one of the few things that I didn't remember, though, I sort of wish I had since it's good to get used to things that are unusual, and those lectures involved a variations.  The big differences here is that, unlike the other two openings, the French Defense is a very standard opening, and the Tarrasch Variation is what's, most often, played, from what I think she implied.  In addition, this one with Susan Polgar was even harder since there were more variations.  But, because of how often it was played, even though I wasn't going to remember (since you'd have to memorize which as I've learned from GM's Susan Polgar and Damian Lemos, the one thing you don't want to do is memorize anything.)  Instead, it's about understanding and why they happen, I wasn't going to bother remembering everything.  But, I was going to remember the most important things which was the cornerstone.  I forgot the exact variation, that is weather three or four.  I actually think it was four, so somewhere missing one.  What I know, however, is that white kicks black N's not just to gain tempo, but also, to achieve a solid pawn chain in the opening to give white an advantage.  So, it is something like 1.e4, e6 2.d4, Nf6 3.e5  The only difference here is that it is not the French Defense, and it didn't happen in three or four, but rather, 8 moves.  However, I am applying the same concepts and treating it, as if this was the Tarrash Variation as it's what I'm comfortable.  Moreover, which I took right into consideration is that the same thing that makes it special with the French is happening here.  That, I have a solid pawn chain early, so the position is not much different as that of other defense.  But, in this case, it does and is, therefore, an inaccuracy because of where it's headed. ",
        "8... Nd4": "The idea being is that, despite not having major pieces exchanged, I do have to worry about doubled pawns, this time around.  Not on the b file, but rather near the K.  Now, this brings me to a question because tactical-abyss made a very good point, and one was proven in my last annotation.  He said that opening up your pawns around the K is not always a bad thing, depending on the position.  Before that, I thought that it always, and that's what other's including masters were saying, but he proved that it wasn't, depending on the position.  I was wondering if pawn structures around the K, so doubled pawns on the f file would be harmful was.  In this case, I thought it was, and in that case, wasn't going to take chances.  Therefore, for the first time in a while, where I actually went wrong, with my last move, I am now forced to cram one of my N's on d2.  I was wondering for a while now, but figured out why it is uncomfortable.  The reason being is that, if black makes the right choice, he'll get the space advantage back now because having to put on my Knight on d2 means that I'll have to, at least, one tempo to complete development.  Whereas, had I not attacked it, I don't think he would've played this.  So, thinking that I'm now in trouble based on what happened, I really start thinking about how to get out but have confidence because, unlike last time, he is not a stronger player.  Consequently, I do have hope.",
        "9. Nbd2 Nxf3+": "?! But, playing this made it quite easy for me.  I thought he play a different, in which I'd be struggling more.  However, I can exchange, and when I do, I'll be able to get my remaining piece into play, at once.",
        "10. Nxf3 Bxf3 11. Qxf3 a5": "I knew that, at some point, Ted would play this.  As mentioned earlier, I was worried about something like this, but here, I just expected it.  So, once he moved here, this is when I did what you're actually supposed to which is, \"Start Thinking\", as Jack has repeadetly emphasized.  I know that if I'm not careful, he will win my LSB at once, with 12...a4  So, I ask myself what to do, and analyze and think about it.  \"Upon further review\", I realized that the only way to prevent the loss of a piece is with 12.a4, so that if he takes, I take back.",
        "12. a4 b4": "But, he plays this, instead.  It's also worth noting that anything else, aside from taking or advancing would've lost this pawn.  Therefore, of the two options, I think that Ted made the right choice, as taking back would've taken away black's opportunity to castle immediately, and given that his f pawn has advanced the K would be exposed since when you move the most valuable pawn, there is a weakness, right then and there.",
        "13. Bc4": "Seeing that he prevented that, I come up with another plan to do just that.  This time, however, black will have to lose a pawn or have his K exposed.  Can you figure out why?  And, this is a time where I will deviate from General Openings and move the same piece more then once to do it since I am in better shape.",
        "13... g6": "Here is the solution to my quiz.  The only way to have prevented my next move was 13...c6, in which I would've taken a pawn.  But, with this, as well as, any other move, I will check.  There is still one way that black could castle.",
        "14. Bb5+": "But, it would mean losing his Q, immeidately, for my LSB since the only other alternative is 14...Qd7  However, black makes the right choice.  With that being said, it's very important to note that just because someone is behind or material is level doesn't mean anything.  Like in this case, it is even with material, but I have a very near winning advantage, at this point.  That is because not only is my development almost completed, whereas, he has two pieces undeveloped; but more importantly, his K is now exposed.  And, there is very little that he can do, at this point.",
        "14... Ke7 15. Be3": "But, this does more then just complete.  In addition, I am also planning something very nasty which will happen in several moves.  So, as a way to say this, I am planning long term.  This time, however, I do it, accurately.",
        "15... c5": "? I am surprised and don't why he played this.  Much better was 15...Rf8, or 15...Qc8 not just preventing my next move but, also, my long term plans.  BTW, it will be the first game in history where I make an en-pessant capture.  When I first joined this website, it wasn't allowed.  But, shortly afterwards, it changed, and my opponents have made en-pessant captures.  And, there was one or two times that I could but haven't because it's what I thought.  What I've been told by Jack is that usually the opponent allows an en-pessant because when you do it, he or she keeps the advantage.  But, this time, I will wind up with a winning advantage.  It doesn't just win a pawn, but it will help make my long term plans even easier.",
        "16. dxc6 e.p. h5": "Like before, I am still not sure why Ted played this as 16...Rc8 or 16...Qc8 were better alternatives.  With this move, my plan is going to happen in a couple of moves because on my next move, I will add pressure to the d file by pinning d6 for something devastating.",
        "17. Rad1 Bh6": "Ted sees that I have a winning advantage and knows that I have a nasty plan with my DSB, so he wants to exchange it.  I wasn't that far from falling into that trap, and see where it would be easy.  If I were still a novice, this would've happened, believe it or not.  But, with how much better and I am and the fact that I am somewhat well known training, coach, mentoring players, taking on h6 did not even come to consideration.  Instead, it is what I was planning to do for 4 moves, when I thought long term.  In fact, I believed that it would take much longer (about 10 moves).  But, with just one or two small inaccuracies, I was able to to do it much sooner.    ",
        "18. Bc5": "As now, the game is lost for black, no matter how you look at it.  That's because, as we know black takes my DSB, I will immeidately recapture on d8, winning his Q.  So, let's say 18...dxc5, 19.Rxd8, Kxd8, I would immeidately check him with 20.Qd3+ with mate on the next move because no matter how he gets out of check, I would mate him with 21.Qd7#.  Or, to prevent mate, black would have to lose his Q+R for both of my B's.  For example, 18...dxc5 19.Rxd8, Rxd8 20.c7, Rc8 21.Qd3, Rxc7 22.Rd1, Rb7 23.Qd6+, Kf7 24.Qd5+ (forking his K and R.)  In addition, I studied what would happen if the K move, on which squares, and their variations as Homework.  And, if the K went anywhere, in some spots there would be a mating sequence.  In others, there aren't, but white would win the Q, without any compensation, so needless to say that I'd get a free Q because of my passed pawn, B's, Q, and the R on d1.  Therefore, of all the best options, black finds the best move, but this will still cost him his Q and a center pawn for a R.",
        "18... Qc7 19. Bxd6+": "On that note, Ted resigned.  Personally, I would've stayed in longer, but this time, I don't think resignation was premature.  The reason being isn't so much because of material, but rather, it is the fact that black's K is terribly exposed, that I consider it quite resignable.  Black went wrong by pushing pawns, and advancing his weakest pawn on the chess board.  By doing this, he created a big weakness for himself allowing me to have an advantage by the third move, so I just used that needed time to develop my pieces, castle, and control the center.  In addition, I planned accurately and strategized to expose his weakness which, in the end, proved to be devastating."
    },
    "url": "https://gameknot.com/annotation.pl/otb-chess-game?gm=59866",
    "gameName": "OTB Chess Game",
    "players": "Joe (1270 ) vs. Ted ",
    "opening": "Ruy Lopez (C60), Nuernberg variation"
}