{
    "moves": {
        "1. e4": "As usual, and not to my surprise, this is how Mariann opens up.",
        "1... c5": "So, I respond with my conventional defense.",
        "2. h3": "?! But, this was before Jack got too busy to help her.  So, for a short while, I told Mariann that this is an inaccuracy.  The reason being is that this doesn't develop or help control the center.  Therefore, better would've been to bring one of the N's or a central pawn into play.  By this, I was implying 2.d4, 2.Nf3, or 2.Nc3  She said, \"Oh\" and looked shocked.  But, I'm basing a little bit on what Jack has mentioned to other students about developing your pieces which I've emphasized to one of my students, reachforgoals.",
        "2... d6": "So, I continue the conventional of the Sicilian.",
        "3. f3": "?! Now, Jack gets involved but only for this move.  He told Mariann that this is an inaccuracy, as that pawn shouldn't have been advanced.  And, Mr. Stockel said the same thing that I implied of which would've been better, as he said that better was to develop something at once.  Therefore, I said that he's, as usual, correct.  I said, as usual, not because it's obvious, but rather, because he's also the reason that I can coach her.  When not sure, I just go by what he said.  But, in this case, it's definitely.  And, she said that the reason behind this move was that she got the board mixed up.  Normally, it'd be hard to believe but not this time.  As I noted on the second game, I started off playing against Bernard, and the numbers were reversed which got the colors mixed up.  When that happens, inaccuracies, like this, are bound to happen.",
        "3... e5": "So, I do things, based on what, Kenneth_fiore_3 mentioned in one of my annotations, after coaching me.  As I try to turn it into something like the Domiano's Defense but reversing the colors.  Since the plan is to stop the e pawn from advancing to allow an eventual ...Ng8-xe5.  By that, I'm alluding to ...Nf6, followed by ...Nxe4, and if white answers with fxe4??, I'd answer with ...Qh5+, etc. ",
        "4. Bb5+": "Before any of that comes through, Mariann throws in a check.",
        "4... Bd7": "Which I break with this move.  I would've played 4...Nd7, but I wanted to keep my N on b8 for the same reason noted earlier.  As I didn't want to throw away the slightest possibility of playing something similar to what you'd do if black played the Domiano's Defense but in reverse.",
        "5. Bc4": "Instead of exchanging, she retreats.  I think that this was a very smart choice and reminds of the training game with Kenneth_fiore_3  As it turns out, her LSB was more active then mine so refusing that was the right choice.",
        "5... Nf6": "So, I go back to plan outlined with this move.",
        "6. d3": "Not only does this develop, but it stops the plan that I had.",
        "6... g6": "So, this comes as the next best thing, in my books, knowing that Mariann's behind in development.  Therefore, I fianchetto with the idea of forming a long flank, and then, castling.",
        "7. Nc3": "Continuing with her development.",
        "7... Bg7": "As do I with the nice long flank.",
        "8. f4": "She wants to exchange.  Now, I could castle here and exchange later.  But, I figured that this was a good time to exchange pawns.  Going by what Ken outlined in the most recent game with Loyd and in a similar position, I feel that I'm going to gain tempo after 8...exf4 since she's forced to take with her Bishop.",
        "8... exf4 9. Bxf4 Qc7": "It might seem early to bring the Queen out, and I usually wait.  But, by my books this was an exception, as she was threatening to win my d6 which is what the board was indicating.  Therefore, this what the position demanded, as bhidragon would put it.",
        "10. Nd5": "? Without engaging in too much conversation, I told her that this wasn't the best move.  However, I wasn't going to mention mistake, though.  For sure, I'm going exchange N for B.  Usually, I wouldn't do that because of what GM Susan Polgar outlined, but she mentioned an immediate advantage, which I see.  For afterwards, I'm going to win a pawn.  And, after 11...Bxb2, she said, \"Oh.\"  That means she was surprised, and I told her that it was easy to miss, but then, we continued.  This isn't so bad, yet, as later, she's going to win back a pawn after a mistake from black.",
        "10... Nxd5 11. exd5 Bxb2 12. Qe2+": "Things start getting nasty for me, as I'm in check.  And, I wonder what can be done about it.  But, I've found the move, as I didn't think that 12...Be6 would've worked, as I'm worried that it would've lost a piece but failed to calculate more as there's more then one variation that would've worked.  As it turns out, I think it would've been better.  As now, I'm giving her a Bishop, but if she takes, I would've gotten a Rook, in return, after 13...Bxa1.  I missed that move, and wound up playing 12...Be5 which winds up in an exchange which I think ought to have waited here.",
        "12... Be5 13. Bxe5 dxe5 14. Nf3": "Continuing with her development and threatening my e5 pawn.",
        "14... f6": "Which I protect.",
        "15. Rb1": "I figured that she was trying to win my Rook because it looked like her intention is to play 16.Ba6??, although I, likewise mixed up the colors.",
        "15... Qa5+": "Not knowing, I figured that I prevented the risk with this move.  And, when she gets out, that's when I make the mistake.  As, I'm fixated on castling right away which enables her to win back the pawn with 17.Rxb7.  Better would've been to hold off on the castling.  The problem, unlike with a previous game was Ghost Vision which is how GM Tal won since I figured that there was something there which would've allowed Ba6.  That ghost vision involved the monarch because, were that placed on b8, then that what I feared would've worked.  So, I mixed up the King for the Knight which is unusual, but especially, in a training game.  Therefore, I'm not proud that this happened.",
        "16. Kd1 O-O 17. Rxb7 Qc3": "But, now is the time that I come up with a nasty plan which the student overlooked.",
        "18. Rb3": "?? Which she overlooked with this move.  This was caused by Tunnel Vision as Mariann was obsessed with harassing my Queen.  In fact, this is the losing blunder, as it'll go down hill from here.  It's hard to suggest the best move since there were several option like 18.Qe1, 18.Re1, 18.Ne1, or 18.Rh2 so the coaching happened in the end.  But, I said that this was a blunder because of...",
        "18... Qa1+": "This move.  And, she said, \"Oh, I didn't see it.\"",
        "19. Kd2 Qxh1": "Then, she said, yeah, I figured you'd play that.  What she as alluding to was when I played 18...Qa1+  The problem is which you'll see in the end, and I know how she was thinking as this was in my thought process, back in the day.  But, it was on attacking the Queen but missing the threat that came after.  After this, the coaching ends, for the most part for the reason outlined earlier.  So, now, I base it on what ION noted of not being critical when you're already winning.  It's got to happen here, for the reasons outlined in the intro.",
        "20. d6+": "A discovered check.  Now, Mariann has, previously told me, that she puts her opponents in check for the thrill of it.  However, this is a nuisance, as it's not going to compromise black's position in any shape or form.",
        "20... Kh8": "Another option was 20...Kg7.  However, I remember what Jack Stockel has, previously told me, which was that part of King safety is bringing your monarch into the corner, which I have done here.",
        "21. Bd5": "So, she goes after my Ra8, instead.",
        "21... Bc6": "So, I protect, whilst, threatening to liquidate.",
        "22. Be6": "Not to my surprise, however, Mariann refuses to exchange, due to being behind.",
        "22... Ba4": "So, I hit her Rook.",
        "23. Rc3": "Which she protects.",
        "23... Nc6": "? And, that's when I use that time to get my remaining piece into play, as I'm worried that she'll threaten to win it, again.  However, this is a mistake, as now, she's going to get a pawn back, whilst, hitting my N, in the process.  Best was, therefore, 23...Rc8.",
        "24. Rxc5 Nb4 25. Qe4": "As now, it appears that she's going to get a piece back.  So, I think very hard about what to do.  That's because I'm feeling the same amount of pressure that I felt in my game against Kenneth_fiore_3 where he said that the position has become very complex.  And, that's what happened here.  But, after thinking about it, I found a way out, to prevent her from getting anything else back.",
        "25... Rab8": "As now, my N is protected which means that she can't get to my B, either.",
        "26. d4": "Wanting to exchange bad pawns and try to get her advantage.  ",
        "26... Na6": "But, like with Ken and based on what he outlined in one of my annotations combined with that game, I refused since I'm hitting her R, in return.",
        "27. dxe5": "?? However, she overlooked it, and took my pawn anyway, so now, I'm going to win her other R, but this time, without compensation.  And, as noted, I don't say anything with the fact that I was winning combined with what ION outlined for the reason outlined.",
        "27... Nxc5 28. Qh4": "Trying to set up a mate against me.  However, it's not obvious until her next move.",
        "28... Rb1": "Figuring that I had a mate against her, I played this.  But, what I miss is what follows later on, so there's no mate.  And, better was 28...Rb2 adding more pressure.  She can protect with by advancing the c pawn but would deal with, in my books, an overwhelming amount of pressure.",
        "29. Qh6": "This is where it became obvious that she wanted to mate me.  And, that's based with the loss against bhidragon, combined with, my game against Ted since ...Qh6 was played after white's decisive blunder.  Now, I was wondering what to do here, but there are a couple of options that save the position.  The bad news is that I almost overlooked it and came close to losing not only a won game but against the student which would've given her adequate compensation, and thus wouldn't have learned from her mistake.  Which is why not giving the right information is a pet hate of mine.  That's because losing a won game against the someone that you're training is the equivalent to that, and I'm not happy that I came, at all close, to overlooking the threat.  I say this because, as well as, 29...Qg2+, I considered a different move that would've lost, at once to 30.Qxf8#, and that was 29...Rb2??, for the reason outlined above since the aim was winning the pawn.  But, seeing where it would've been wrong and how she wouldn't have learned, I stopped that impulsiveness.  As, not only didn't I allow that mate, but I'm going to get another piece, for free.  And, this will also stop the mate, as now, the backrank is protect by the N once I capture.  With that being said, I'm going to take her Be6 since I did not overlook 29...Nxe6, at once.  I also kept in mind that she can't take back because when I take, the N will be protecting my R which is also how mate is prevented, in what I call an ironic twist of events.",
        "29... Nxe6 30. Qe3": "Bringing her Queen back to prevent mate because of what I'm about to do.  Yes, Mariann is going down another pawn, but it's better then being mated, at once.",
        "30... Qxg2+ 31. Qe2": "This is the right choice because, had Mariann gotten out with her K, I'd have mate.  Her intent is to reduce the damage by liquidating Queens.  Normally, I'd accept it because I'm ahead since liquidation would compromise her position.  But, not this time.  By refusing an exchange, I'm going to win, yet, another pawn.",
        "31... Qxh3 32. Qe4": "I'm not sure why she played this, but I'm going to throw in another check.",
        "32... Qg2+ 33. Ke3": "?? But, now, it's mate sooner.  I was trying to throw her off guard, and it worked here.  But, despite not having enough compensation, and thus, being a resignable position, anyhow, 33.Qe2 would've left me speculating on how to deliver the checkmate. ",
        "33... Rc8": "It starts with this move, as I'm going to give her back a Bishop, due to being this far ahead.  When she takes it, it's a mate in two.  Had Mariann, however, played 34.Qd3+, it'd still be mate as my next move would be 34.Re1#.",
        "34. Qxa4 Rc3+ 35. Ke4 Qxf3#": "After our second game, I analyzed the first game and told her where she went wrong, while we were packing up and saying goodbye.  So, I said that her decisive mistake (losing blunder) was trying to harass when there was a danger ahead.  In other words, I implied that 18Rb3?? was the move that lost.  So, I handed her the moral, and it's based on something that I've done and, believe it or not, made a similar mistake in a recent team game, afterwards, where I had a win and lost from one mistake.  Therefore, I told her that it's not a good idea to harass the Queen just because you can.  As we know, that's the thing that I've done before.  And, she said, \"Yes, but it's fun to do that.\"  So my response was that I know how you feel.  Sometimes, it's good to do that like gain of tempo, etc.  However, there are cases, like here where it doesn't work because there are threats that you need to be aware of.  By trying to chase my Queen you missed the threat which was the loss of a Rook.  From then on, things were going to go downhill.  And, she agreed with me and understood, from that point, where and why that happens.  What it boils to is a combination of what happened with Fred in my first loss against him, one of my students (reachforgoals) in two training games with her, as well as, with bhidragon which was figuring out what the board is trying to tell you.  With that being said, I hope and think that she will remember this lesson for future game and improve.   "
    },
    "url": "https://gameknot.com/annotation.pl/otb-coaching-game?gm=61591",
    "gameName": "OTB Coaching Game",
    "players": "Mariann  vs. Joe (1353)",
    "opening": "Sicilian defence (B20)"
}