{
    "moves": {
        "1. e4": "Now, my opponent usually kick's things off with the Queens Pawn Opening and attempts the QG.  But, sometimes my coach like to switch things off.  When Jack does, this is what he plays.",
        "1... c5": "But, like my other opponents, I just respond with the Siclian.  I am, however, interested in trying something completely different like the Carro Kann, but my coach a few weeks ago told me that Masters and GM's no longer player.  On the other hand, this is one of the very few times where I actually disagree with his assessment because the realjimfrior, the current mentor for the group I'm in for the, \"Walking the Walk and Learning How to Run\" club contradicts that.  I happen to agree with the mentor because a couple of players like elyhim have played that against me.",
        "2. Nf3": "My typical response.  That's right, he decides to play the Open Sicilian which I'm all too familiar with since this opponent taught me this variation.",
        "2... d6": "In the meantime, I just continue with my defense.",
        "3. Nc3": "Now this, however, is a move that I did not expect this early.  While it develops a piece, Mr. Stockel has repedetly told me that 3.d4 is best and the most common response to 2...d6  In fact, we kept practicing that together, until I was almost blue in the face.  It goes to show you that sometimes it's a good idea for you to get out of your comfort and get used to something that you're not accustomed to.  That's an important lesson that I learned from GM Judit Polgar, in the Alkehine Tournament, during her commentary.",
        "3... Nc6": "But, two can play that game.  If he can play something that I'm not used to, then I can play something that he might not be accustomed to.  In this position, we usually exchange where PXP, NXP.  Since that did not happen, I decided to develop my first piece, and as we will see later on, I am preparing to castle Queenside, this time.  That's because it will be much harder to get the DSB out, then my pieces on my other side.",
        "4. Bc4": "I understand that this move develops another piece, so I don't know why white did not play 4.Bb5 instead.  That does the same thing, while pinning my N and adding pressure to the c file. ",
        "4... Nf6": "But, I will continue to develop,  no matter what my opponent does.  As noted earlier, it will be difficult to get the DSB out, but this is a start.",
        "5. d3": "?! At first, I had the position wrong, and originally recorded that white played 5.d6.  But, that is not possible for white to make a move like that this early.  It would only be feasible, if you were black.  Then, I thought that that he played 5.d4.  However, I looked at the position and figured out why I recorded the inaccuracy.  As it turns out, white only advances his d pawn one square, as opposed to, two.  That, however, is an inaccuracy because blocks in his LSB, so that he can't pull it back.  Therefore, white will have less room to retreat his LSB, if it ever should get attacked.  ",
        "5... Bg4": "I played this move for two reasons.  First, develops another piece and prepares so that I can eventually castle Queenside.  Second, my goal was to pin his N and put pressure on the f file, and I thought that I took advantage of his inaccuracy.  Because he played 5.d3, it's not feasible for white to break the pin with his LSB, and I kept that in mind before playing this move.  So, I thought that I knew his weakness, and this is important because this same opponent has also repeatedly advised to try and find your opponents weakness, in some of my past games against him.  The only problem, however, is that I overlooked something important.  He can easily break the pin, so it's not one of his weaknesses, afterall.  He will start by attacking my LSB with 6.h3.",
        "6. h3 Bh5": "But, the pin is not going to be broken easily.  Believe it or not, I spoke to Jack about 6...Bd7, given that he is eventually going to attack and break the pin with g4.  He said that because I did not make a blunder of placing the N on the rim (did not play ...Nh5), then I can just retreat with this move.  So, since I can play this he asked why not move here.  Afterall, it is a better retreat and outpost for my B, then 6...Bd7.  BTW, this is the move that I was going to play anyway, but I decided to speak with my opponent about the different possiblilties, given that he is my favorite coach. ",
        "7. O-O": "Now, my opponent accurately pointed out that there is an immediate threat of 7...Qa5, as it would pin his other N.  I don't see why that is a big deal because he can break it with 6...Bd2, and I am still going to play 7...Qa5 on my next move for a completely different reason.  But, he told me that castling Kingside will prevent the pin.  Ok, I would have played this move, if I were not, but not for the same reason.  My goal would just be to castle in order to complete development and while the opportunity excisted.  That's because he and Mr. Arboite, a former assistant coach for Mr. Stockel told me that you want to castle, before the opportunity is gone.  So, the idea is to castle early and often.  ",
        "7... Qa5": "The real reason for bringing my Q out is to castle.  Sooner or later, that plan is going to become a reality.",
        "8. Bd2": "As mentioned earlier, 7.0-0 prevented the pin, but he decides to play this, anyway.  This time, however, it's for the same reason that I would bring out the DSB like this, development.",
        "8... e5": "But, my goal is to, \"punish him for neglecting center control\", as master elyhim once told me.  And, that is with this move.  That's because the same master told me that this is the way to do that, in a different opening, when we played the QGA.  It's the same idea, but in a completely different game, variation, and context.  However, I decided to apply the same idea in this game.  ",
        "9. Nd5": "In this position, his goal is to exchange, which he will eventually.  But, I am going to so something before allowing that.  That's because he is attacking my Q, so I will defend it before doing anything else.  Note: This is just another way that he quizzes me.  And, this is what that makes his quizzes similar to the Master Mater and in the same way.  He will attack and try to force an exchange, while using a different piece to attack attack (to attack and threaten the win of the same piece).  Sometimes, it can be very difficult, however, to see the threat.  But, that is sometimes the point because you really have to analyze before making a move.  And, this is what Jack Stockel means when he says, \"Start thinking\".  If you just make a move without giving it second thought, then you will usually wind up paying the ultimate price.  Now, had I played ...NXP, he would have told me that it would have been a very bad choice because you lose the Q.  I know from past experiences, so I looked at, \"the picture\" (his real intentions).  And, this is what he is trying to get me and his other chess students to do.  He wants to start look at the big picture by seeing his plan and threats associated with it.  So, I passed his test with flying color.",
        "9... Qd8": "At first, I thought that ...Qa4 was better, as this is an undeveloping move.  However, development is the least of blacks problems because if I had moved the Q to a4, then he could automatically win it after 10.b3.  So, I kept that in mind by not allowing it, in the first place.",
        "10. Nxf6+": "Now, he decides to exchange.",
        "10... Qxf6": "Believe it or not, I spoke to my coach about a different alternative.  In other words, I told him that I can either recapture with my Q or my g pawn.  He, however, told me that this move is better.  Before that happened, I considered 10...gxf6, but I was going to play this move anyway, as it was my first instinct.  That is because this move will bring me one step closer to castling, whereas with the other move, my Q still remains undeveloped which delays that.",
        "11. g4": "Now, he decides to break the pin, at once.",
        "11... Bg6": "My only retreat square.",
        "12. Bd5": "I don't know why he decides to attack with this move, as opposed to, 12.Bb5.  If it's because he's worried about 12...a6, his instincts would be accurate.",
        "12... O-O-O": "Either way, however, I decide to castle, as I mentioned earlier.  Now, I spoke to him about doing this now or bringing my DSB out and then castling Kingside.  He told me that this move is better.  The reason being is because of what I mentioned earlier.  In general, you want to castle before it's too late and the opportunity is gone.  That might have happened, if I had hyperfocused on playing ...0-0.",
        "13. Nh2": "I don't know why he played this.  But, as usual, it's generally a bad idea to place your Knight on the rim, as he implied earlier regarding 6...Bh5, as opposed to, 6...Bd7.",
        "13... h5": "In this position, I am interested in a pawn exchange which I am going to get shortly, but not, immediately.  At this point, I remembered everything that was played, but kept recording for seven more moves.  After this move, however, I do not remember what else got played, and what I recorded after this is inaccurate, so there was no point in annotating any other move.  Normally, it is extremely important for me to remember all of the moves, but this is an extenuating.  That's because as I mentioned in the into, there's no time to finish the game.  All we know, is that I am able to complete development with DSB and I exchange my g pawn with h pawn, during that move.  And, in 7-8 moves from now, there will be a ton of exchanges.  And, while it will appear that white would have the winning advantage, it will actually be a drawn position.  But, that is the important lesson to the game.  So, the moral of this story is, \"Don't give up right away\", as Jack Stockel has been telling since the beginning (since the first month that we've been playing each other.)  The reason being is that what appears to be a lost game, might actually be drawn position.  Therefore, resignation might be premature.  That's because if you resign, you might be forfeiting when, in reality, you might have thrown away an opportunity to achieve a draw.  In other words, you might subconsiencionciously resign a drawn position. "
    },
    "url": "https://gameknot.com/annotation.pl/otb-wtw-coaching-game-dont-give-up-right-away?gm=51113",
    "gameName": "OTB WTW Coaching Game-\"Don't give up Right away\"",
    "players": "Jack  (1800 USCF) vs. Joe  (1218 ELO)",
    "opening": "Sicilian (B50)"
}