{
    "moves": {
        "1. d4": "I was interested in what Bernnie would do.  In the past, I've been white and have played 1.e4.  Only once was 1.d4 played to try out the Colle's Franketort System which was in the game before this.  But, this is what he played.",
        "1... d5": "So, I stick to mainlines as this could either become a KID or Colle's System.  What I had in mind was the KID.",
        "2. e3": "But, it turns out to be the Colle's System.",
        "2... Nf6": "Whether it's this or Colle's, this is the most common move, anyhow.  So, the idea is sticking with what you know.",
        "3. c4": "But, he's transposing the Colle's into the KID.  I'm thinking that he might be trying to fool me or get into something that I don't know.",
        "3... e6": "Which won't work because when Kenneth_fiore_3 played the KID it wasn't from regular mainlines.  Instead, he transposed into that line, so I'm all too familiar with this approach.",
        "4. Nf3": "Thus, I develop, at once.",
        "4... b6": "?! The bad news is that I reversed colors since it's white who should be fianchettoing on the Queen, instead of the King side.  And, black should fianchetto on opposite wing.  Which makes this inaccuracy, and I think that this could compromise my position.",
        "5. Nc3": "Now that his c pawn moved, this works.",
        "5... Bb7": "?! Forgetting that I got the colors reversed, I continue behind the fianchetto plan, as black generally does on the opposite side.",
        "6. Qa4+": "I don't see the point of this move because I'm going to harass the Queen and then, use that time to continue with my development by pinning his Nc3.",
        "6... Bc6 7. Qc2 Bb4 8. a3": "A common move, but I would've answered with 8.Bd2  It's now a question of to exchange or not, but after what Ken mentioned in my last annotation combined with what happened in our game, similarly, I refuse.  And, instead of the most common retreat which is on a5, I don't want to chance the loss of tempo as it would happen on our next move.  So, I go back b6 which is a similar idea to what was mentioned when he said going to back to b2.  The idea being is that after 9.b4, I can and will castle, at once.",
        "8... Bd6 9. b4 O-O 10. c5": "It's at the cost of tempo, which to me, is well worth it since my monarch is safe.  I considered exchanging but figured that my pawns were useful.  So, I decided to go back e7 but this is was a bad as 10...Be7?! is going to lose several tempii with the attacks that are coming.",
        "10... Be7 11. b5 Bd7 12. c6 Be8 13. Bd3": "As now, Bernnie's able to continue developing with a good spot for his LSB, whereas, my LSB, however, is misplaced, in my opinion.",
        "13... a6": "Unlike before, my idea of a good time is exchanging pawns for a semi open file which is very useful.",
        "14. Ng5": "Not surprisingly, as I saw in a similar plan from Ken, Bernnie declines with this nasty threat.  Which I see.  It's easy to miss because my Nf6 does something but not enough since there's two defenders against three attackers, with the third, being his Queen.  So, I have to defend against the threat, first.",
        "14... g6 15. O-O": "After which, he castles.",
        "15... Qd6": "Then, I come up with a similar plan to him.",
        "16. Bb2": "Continuing with his development, but this is when I take advantage of the opportunity to exchange for the open file.  The only reason for this goal is because of what TA emphasized in one of his Q sac blitz games being that the semi open files are very important.  The bad part is that I'm going to get a little more then I asked for.  As per the saying, \"be careful for what you wish for\" as I counted my chickens before they hatched here.",
        "16... axb5 17. Nxb5": "Since I forgot that in the line, my Queen would be attacked.  Now, I'm thinking very hard, and even, clinging about what to do.  I don't want to exchange pieces, yet, because I might need them.  But, what I'm paranoid about is my Be7 as it's crammed.  What I'm worried about is that he plays a4 followed by Ba3, and then I lose a piece after Ba3.  And, that would be my Be7.  So, I felt that there was no choice but to exchange.  The problem is the opposite of what I had against Ken, this time around.  As I thought about too many variations.  It turns out that there were things in that line, which could've stopped.  So, 17...Qd8 would've been my best move.  By playing what I did, I think that he's already getting an advantage because looking into the end, I could've used one of my Bishops and my Q.  That's because once the Queens are off, I'm going to be forced to exchange my Be8 in order to avoid the loss of a Rook which is the one thing that I didn't want.  At least, one of them could've helped me out in the end.  And, If I could read it all in one week, I'd borrow that book based on what Ken outlined.  I think it's Youfan's book on endgames where he mentions about exchanging.  What I'm considering, though, is googling it or going into the library in the quiet area on occasion to study.  I'm also considering it borrowing if I go away and have to travel by plane as that's where I could also study this.  With that being said, although it's not the decisive blunder, it is, in my opinion, where I start to go wrong. ",
        "17... Qxc6 18. Qxc6 Nxc6 19. Nxc7 Rc8 20. Nxe8 Rfxe8 21. Bb5 Bd6": "?? This is, however, the losing blunder.  According to Bernnie this is the only mistake that I made.  To an extent, I agree with him but now that this wasn't the only flaw.  Exchanging Queens was the first inaccuracy that leads to Rome since, afterwards, I was forced to give up my stronger bishop, thus, losing the exchange.  That would've been needed in the endgame.  But, by playing this, he can and will attack my N a second piece.  At best, I'm losing a Rook for B.  The worst is if the N didn't move, at which, he'd have a free piece.  Well, I'm not going, so I'll retreat in one of the few places that doesn't give my opponent a free piece.  As Ken told me, when we get in a situation like this, then it becomes trying to minimize the damage which is true here.",
        "22. Rfc1 Ne7 23. Bxe8 Rxe8 24. Nf3": "Stopping the threat of 24...Ng4 followed by 25...Bxh2+ which I calculated but wasn't surprised to see this as it also came into calculation.",
        "24... Nf5": "After which, I come up with a different plan.  I don't like exchanges now, but felt that, similar to Ken, there was no choice because his N posed as a tremendous threat.  So, I'll wait, but when we reach a critical position with overwhelming pressure, that's when I feel that an exchange will be needed.  Unlike with Ken, Bernnie is going to allow it, but I hold back, until it's needed (a court of last resort, needless to say).",
        "25. a4": "Advancing his pawn.  The idea is attempting to get a passed pawn.",
        "25... Ra8": "And, I try to stop it with this move.",
        "26. Ba3": "But, Bernnie has an answer to that, as now, he's threatening to exchange Bishops.",
        "26... Bb8": "However, I decline to avoid further liquidation since I'm behind.",
        "27. Bb4": "Which grants him back the open file.",
        "27... Ng4": "Since he moved his Bishop, I decide to move the N.  Now, we're reaching a critical as I'm getting ready to exchange, should it be needed.  I'm optimistic at the moment but know that something is going to happen which I don't like.",
        "28. g3": "Stopping any plan I might have still had on h2.  Right now, there's not, but I was planning to in an attempt for counterplay.  I was trying to formulate a plan to kick his Nf3 in order to take on h2.  It certainly wasn't going to be easy, but the plan is now exploited with this move.",
        "28... Ba7": "So, I come up with another plan by trying to take away Bernnie's semi open file with this move as now, my DSB is in the way of his Ra1 and a4 pawn.",
        "29. Ne5": "Putting stop to that by attacking my Ng4 which I must protect.",
        "29... Nf6 30. Nc6": "Trying to exchange my Ba7.  But, this is where I feel that there is no choice but to allow it.  So, I try to calculate a different plan with my next move.  The reason for this exchange is an attempt to play ...b5 with the idea of getting a passed pawn.  Not to my surprise, though, Bernnie stops that.  It starts off with a series of checks, which to me, were not worrisome since I deemed them as a nuisance.  I felt that he was just trying to cost me tempo which I wasn't going to fall for.  But, the tempii is key and those checks are nasty, as we'll see later on since he does something, afterwards.",
        "30... Ne4 31. Nxa7 Rxa7 32. Rc8+ Kg7 33. Bf8+ Kf6 34. Kg2": "This is why I deemed those checks as just annoying because there's no immediate win yet, that I knew of.  But, there's much more to the story then meets the eye.",
        "34... b5": "And, this is why I felt that it was necessary to exchange my R for B and why I found those checks to be a waist of time.  If he takes, I'll get a Rook for free and compensate for everything.  I knew that he wouldn't take.  But, if Bert doesn't take, I'll get a pawn in return which would become a passed pawn.  So, despite being at -2, I felt that I've pulled a swindle as Bernnie's position seemed almost hopeless.  And, I took his next move into consideration.  But, I felt that it would, more or less, even out the game which means that I might be able to hold a draw with best play.  That's not so because my opponent keeps his winning edge after the next move.",
        "35. a5 Nd2": "This is why I figured that black might be able to get a draw, as I'm threatening to fork his Ra1 and a5.",
        "36. Ra2": "But, this is where I also found out otherwise since that won't work with this attack.  And, it is the one move that I did not calculate after 31.Nxa7, and 35.a5 since that was one of the variations that I calculated.",
        "36... Nc4 37. Bb4": "Protecting his a5.  Although I knew he'd win, this is where I discovered that I'm lost.  In fact, resignation is almost imminent.  The only reason for not resigning is because I felt that there was a little more to learn here.",
        "37... Nfd6": "Knowing that, I decide to exchange, but now it becomes something similar to Hope Chess even though the term is not correct here.  But, what I'm hoping for is that Bernie blunders after we exchange which would turn things around, as then, I'd be able to get a passed pawn.  I felt that exchanging his Bb4 which is blocking my b5 was the way to go.",
        "38. Bxd6 Nxd6 39. Rc5 Rb7": "If I advanced right away, 40...Rb2 would've stopped it.  However, his next move shows that my position will not hold.  In fact, what follows which will enable 41.a7 is the reason that I shouldn't have exchanged Queens.  As noted, once that happened, I was then forced to exchange Bishops which enabled 40.a6, in itself which is the dangerous pawn.  That's because were my LSB still around, his passed pawn wouldn't have been able to advance this far.  And, the only reason for exchanging, unlike with previous games, I didn't want to do it.  But, I felt that there was no choice with a variation of losing a piece.  So, what I learned is to calculate more carefully.  In other words, to be more careful in my analysis because there were ways to keep things safe without the exchange.  Problem is something that Ken noted in previous annotations being that I did not consider enough moves. ",
        "40. a6 Rb8 41. a7 Ra8": "I figured that his pawn was blocked, and thus, hoping it was the best that Bernie could do.  However, that does not happen, as we're about to see.",
        "42. Rc6 Ne8 43. Rb6": "This, however, is where I resigned.  Up until now, I felt that there was more to learn, and that I could still try to make things difficult for him, just like with Ken once I lost my Queen for Rook.  After this move, however, not only won't that work, but there is nothing else to learn.  So, felt that there was no point in continuing because Bernnie will play 44.Rb8 which is the reason behind this move.  After Bernnie plays that, he'll either promote, or I'll be forced to give up my Rook for a pawn, on top of what I've lost.  After this game, we analyzed this a little, and he said that the opening was what did me in.  By this, though, he was implying 21...Bd6?? which is actually the middle game.  According to him, I was flawless except for that, but it was enough to lose.  I don't agree about being flawless because of my faulty decision to exchange Queens, after which, I didn't have my LSB which could've been used to stop this promotion.  What it boiled down to was me not considering enough moves of what would've happens becomes something which isn't instructive for this game, but in life as well.  As the saying goes, \"Don't count your chickens before they hash.\"  And, on top of that inaccuracy, I think doing this is what also led to my fatal blunder.  "
    },
    "url": "https://gameknot.com/annotation.pl/otb-chess-game?gm=61537",
    "gameName": "OTB Chess Game",
    "players": "Bernnie  vs. Joe (1353)",
    "opening": "Queen's pawn (D00), stonewall attack"
}