{
    "moves": {
        "1. e4": "Like me, this is how Tom opens up, as well.",
        "1... c5": "And, I answer with my usual, as well.",
        "2. Nc3": "After taking note of what Tom did against my 1...c5 this is his most usual response.  Still shows how intense openings can be since I'm not so used to it.",
        "2... d6": "Therefore, I continue with my usual.",
        "3. Nf3": "Continuing with his development.",
        "3... Bg4": "As do I with this pin.",
        "4. Be2": "Not surprisingly, Tom breaks it.",
        "4... a6": "To prevent, 5.Nb5, I play the typical move in the Sicilian, despite it being the closed variation.",
        "5. d3": "Getting a pawn chain, but I don't like this move because this makes his Be2 much less mobile.",
        "5... Nf6": "Feeling like in a somewhat better position, I continue developing.",
        "6. Bf4": "As does Tom.  But, treating this a little bit like the Spanish Opening since I'm out of familar territory, I decide to kick his Bishop in an attempt to gain tempo.  But, it's not the best choice, as Tom will get a favorable exchange.  My goal was not to exchange, but rather make him retreat, but I didn't analyze what happened afterwards.  The reason being is, of course, being yelled at by Jack but for a good reason of moving too quickly in the last game.",
        "6... e5 7. Nxe5": "As I overlooked this.  I thought that taking lost a piece which is why I take back.  Might as well to avoid losing a pawn.  However, without giving any thought, I just figured that his Be2 will become a menace.  Therefore, unlike with other games, the only thing that came into consideration was getting rid of it, so I exchange on e2, first.  Maybe not a great choice because if you're to look from a different angle, my Bg4 was certainly more mobile then his Be2.  So, exchanging there wasn't the best choice.  Instead, better was to reduce it and just exchange on e5.  Once again, I didn't give it any thought as I'm still overwhelmed with what happened before.  And, it is an example of a bad moment getting the best of me.  This will continue, and things will only go downhill, as we're bound to see.",
        "7... Bxe2 8. Qxe2 dxe5 9. Bxe5 Nfd7": "Not wanting to further exchange, I retreat.  ",
        "10. Bg3": "But, with the B attacked, Tom protects.",
        "10... Be7": "And, I continue developing.",
        "11. Nd5": "So, Tom threatens to exchange.",
        "11... Qa5+": "And, this was played with the idea of tricking Tom into a pin.  It works because of what he does next.",
        "12. Nc3 O-O": "After which, I use the opportunity to castle.  But, better was 12...Bf6 because with two attackers against the N, now exchanging would benefit black as Tom would be faced with doubled pawns around the K.  In return, he's also left with isolated pawns.  As GM Susan Polgar pointed in the Polgar University 2017 this would not be a way good way to go about.  You don't want doubled pawns around the K where it's vulnerable to exposure, and you especially don't want your pawns isolated.  This is refereed to as a destroyed pawn structure.",
        "13. O-O": "Tom sees that I have missed that opportunity and castles, instead.",
        "13... Nc6": "So, I calmly continue developing, instead.  I'm also getting ready to attack his Queen, as well.",
        "14. Nd5": "Trying to win my Bishop.  But, this is where I lose it.  Part of it was me thinking about what happened in our first game and why Jack was being uptight about it.  Turns out that with what he showed, and what he explained while saying goodbye, and as per the chess diagram, he had good reason to get upset.",
        "14... Nd4": "?? By lose it, I meant that I didn't take enough time to see what was happening.  I figured that I just won tempo and possibly a pawn.  I figured that taking my Bishop would be a mistake because of the threat.  What I overlooked is that when he takes, I'm in check which is similar to what happened against tombulous in the loss with him where it was that one mistake that prevented a draw.  Best here was 14...Bg5.",
        "15. Nxe7+ Kh8 16. Qh5": "As now, Tom is bringing an attacker against my King.  So, I refrain from taking on c2 since there is a bigger danger.  I asked myself how to defend, and found a really good move that comes close to trapping his Queen.  So, I attack with my less active Nd7.",
        "16... Nf6 17. Qh3 Rfe8": "And, I also go on the attack, myself in case Tom has similar future plans.",
        "18. Nf5 Nxc2": "As now, I take and am beginning to feel quite happy about my position, believe it or not.  Though, the problem is becoming too satisfied that I miss other things.",
        "19. Nd6": "So, Tom attacks my Rook.",
        "19... Re7": "I considered exchanging with 20.Nxa1, but since I'm still behind, I didn't feel like liquidating.",
        "20. Nc4": "Not surprisingly, Tom defends by attacking my Queen.",
        "20... Qb5 21. Rac1": "After defending, Tom attacks my R.",
        "21... Nd4": "So, I attack again by threatening a N fork.",
        "22. Kh1": "Which Tom defends.",
        "22... Rd8": "So, I centralize my other Rook and plan to attack his d3 pawn.",
        "23. Be5": "And, Tom counterattacks.",
        "23... Ne2": "As do I.",
        "24. Rce1": "And, Tom attacks.",
        "24... Nd4": "So, I go back to plan A and allow him to exchange.  What I forgot is that I'm now forced take back with the pawn which will ruin my pawn structures.",
        "25. Bxf6 gxf6 26. Qh6": "At first, I didn't know why this was played, but this is the start to Tom's basic but ugly threat.",
        "26... Re6": "Therefore, I plan to Tom's Queen.  However, this is where we start running low on time because I have to leave in like 10 or 15 minutes.",
        "27. f4": "Trying to activate Rook which works.",
        "27... Nc2": "Not being able to spend too much time but also interested in getting the Rook, this was played very quickly.  Better, however, 27...f5, as now, Tom is forced to retreat.  And, after that discovered attack, I can reconnect my doubled pawns with 28...fxe4  From there, it would be, more or less, even.",
        "28. f5": "With this move, it's too late, as I must protect.",
        "28... Rc6 29. Rf3": "Because there was only, at most, 4 minutes before having to leave, I viewed as a blunder.  I didn't see the point.  And, I did the unthinkable.",
        "29... Nxe1": "?? That was, taking his Rook at once.  And, with what I mentioned, nothing else came into consideration because the attitude that I don't normally have is that I have fully compensated for lost material and then some.  As I was as confident as you'd get which I have gone wrong with that attitude, but that doesn't include that is this obvious.  However, it might as well be that I missed the threat, for had I defended, the game would've remained unfinished because I was, pretty much, out of time to continue playing.  So, the truth is that I had less then a minute here as it was close to noon.  And, that's not to mention packing up and getting ready to leave due to my work schedule.  When the game was over, Jack was enraged with my play here.  And, he accurately pointed out that best was 29...Rg8  However, if I just had only one more minute, I would've seen the threat.  By playing this, it was over, at once.",
        "30. Rh3": "And, I resigned here, as Tom is going to mate on h7, at once.  What I overlooked is that I can last a little longer with 30...Kg8, but after 31.Rg3+, it's still a forced mate since the K must move back which allows 32.Qg7#.  It started off with an hour, but in the end no time remained.  Jack, who was enfuriated yelled and said, \"ALWAYS ASK YOURSELF WHY YOUR OPPONENT MADE THAT MOVE AND FIGURE OUT WHAT HE WANTS.  DON'T JUST ASSUME THAT HE MADE A MISTAKE, BUT ASK YOURSELF WHY HE PLAYED IT.\"  That is an important lesson that GM Susan Polgar emphasized, and I have taught my students.  And, it seems so obvious, but it wasn't.  That's because right after my resignation, I had to get going, at once.  In other words, I had no more then 5 seconds to spare.  As noted, If time was on my side, I would've continued with 29...Rg8.  And, it would go as smoothly as it should be.  So, it's a good thing that it finished, as now, it's at least lost, instead of still in progress.  That's because if it doesn't finish, it remains that way as we don't resume.  Therefore, what there is to learn is actually what happened in the beginning where I blundered my piece, more then the threat that I would've seen with more time.  My take is that when a piece is threatened, you must ask yourself if they'll take with check or not.  Had I not been in check, my piece would've protected, as Tom would not have taken due to the Queen being in danger.  But, having gotten the check he had won a piece."
    },
    "url": "https://gameknot.com/annotation.pl/otb-chess-game-2?gm=62593",
    "gameName": "OTB Chess Game 2",
    "players": "Tom Walsh  vs. Joe (1297)",
    "opening": "Sicilian (B23), closed"
}