{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Bb5": "Sometimes, he plays the Siclian, and I have seen him also play the French, and one or two times, the Carro Kann.  But, usually, I get to play the Ruy Lopez against him.  This isn't any different.  As usual, I was wondering how he'd respond, as it differs.  Usually, it is 3...a6, but sometimes, he plays something else.",
        "3... Bc5": "And, he did here.",
        "4. O-O": "So, this is where the chat begins. Therefore, 4.Nxe5 didn't come into consideration for the obvious reason of what happens afterwards.  But, I did analyze 4.Bxc6, with the idea of eliminating that pesky N.  But, then I realized that my LSB is stronger.  Plus, his DSB is something to be weary about.  I also remember what tactical-abyss said which is that doubled pawns would be of no asset.  So, after capturing, and he plays, say, 4...dxc6  Now, the thing to worry about is a nasty pin with 5...Bg4, and after 6...Bxf3, 7.Qxf3, without the N there 7...Qh4, and to prevent a nasty check, 8.g3 would be, indirectly forced, in my opinion, in which, he has 8...Qxe4, losing a pawn.  Therefore, I said, I could've captured, but then, I lose something.  And, he said, \"aha!  Smart.  With a Bishop on c4, it would be dangerous to capture.\"  I agreed by nodding my head.",
        "4... d6": "Not at all surprised that Jack imposed this pin on himself.  He usually does, but as noted, it generally happens a move earlier.  But, even when it doesn't, this happens, sooner or later.  One reason to allow it is that this allows him to develop his LSB safely, without the loss of tempo.  In addition, this is a center pawn, so no matter how you look at it, it is a developing move.",
        "5. Nc3": "Waisting no time, I continue developing.",
        "5... Nf6": "So does he, which shows that not only his teaching style the same as my learning style, but we do think alike.",
        "6. d3": "With that being said, I have the same idea.  Develop a central, so that my DSB can come into play, without the loss of tempo, since I won't be forced to fianchetto.  It wasn't easy to find this, but after careful analysis, I realize that this is the way to go as I did think about a fianchetto.  But, after anticipating what is to come, what I was thinking was, in case of attack (which is between us going to happen on his eighth move) I need b3, so no fianchetto.  In other words, there just isn't time to do it.  With what unfolds, I realize that I made the right decision.",
        "6... O-O": "Not sure exactly what he said, but it was something like, now it's time for me to go home.  Jack often talks about going home, when he castles.",
        "7. Bg5": "Waisting no time or chancing anything, now was the time for me to get this pin, since he got out of the last one.",
        "7... Be6": "He said, as what I'm what I used to with the glacoma, I have to sometimes tell him, when I've made a move.  So, what Jack said was, \"You pinned my N? No problem\"  And, he responded with this move which doesn't surprise me, as now, his development is complete.  Therefore, it starts getting interesting, as we're both, about, even, so far. ",
        "8. Re1": "In his snapshot analysis thread, tactical-abyss said that one way to control the center was by attacking.  What he meant was bringing a R to e or d file, which I have.",
        "8... h6": "Not surprised to see this.",
        "9. Bh4": "Now, I did consider exchanging, by placing my DSB e3.  But, then, I asked myself, as one should if it's the best move and why, as one should.  Looks good, but then I determined that making the most common retreat, so to h4 is better because if we're to go by a good and bad bishops, both of my bishops since Jack's are semi blocked by his pawns, whereas, mine are not.  In addition, Jack also taught and gave me some good variations, which I knew he would being that he's an epic coach.  In it, he played through it by saying, \"Very good.  Much better then 9.Bxf6 because after 9...Qxf6, I can play 10...Nd4, and after 11.Nxd4, Bxd4, f2 becomes a target with my Q+DSB\"  Like before, I agreed by nodding my head especially because I recently learned from tactical-abyss that f2 for white and f7 for black are the weakest squares.  And, allowing the opponent to target could spell disaster.  In most of his Q sac examples, where he gives up his Q for a P, Joe still wins because he does it on the weakest square.  The opponents think that they have won with nothing to worry about, but the harsh reality is that there is still little to no room for error because that square is now target.  So, if you let your guard down, it can mean disaster.  And, yes, this is something I taught one of my students when her opponent not only didn't develop her pieces, but she also her opponent to target the weakest square, resulting in mate.  ",
        "9... a6": "Also not surprised to see this, either.",
        "10. Ba4": "I also could've played 10.Bc4, with the idea of exchanging.  But, if that happens, I'm left with isolated pawns, which I don't want since they say that (which would apply if ever we reached that phase) that one thing that is not good to have is an isolated pawn in the endgame.  But, everything, starting now makes that difference because of a concept which a GK friend introduced me to.  That, \"What you do in the opening will affect you in the midgame; what you do in the midgame will affect you in the endgame; and what you do in the endgame will affect the final results\"  Although were in the midgame, it still makes a big difference.  BTW, after I moved here, Jack said, \"You played this?  Ok.\"  In other words, what Jack is implying, as he's directly stated is that there is nothing wrong with this move.",
        "10... b5": "As I anticipated.",
        "11. Bb3": "And, for the obvious reason, this is now forced.",
        "11... Nd4": "Now, Jack plays the move that he provided as a variation, after I played 9.Bh4  This time, exchanging is of no asset because f2 is now safe.",
        "12. Bxe6": "But, I rather exchange his B's before his N.  Although one could classify it as one of the bad bishops, as well as, the others (given that both are semi blocked by his pawns); a bad bishop, in this context, isn't really bad.  That's the way tipsyjourneyman puts it.  In this position, his LSB is quite dangerous, and I'm thinking about what he might be very capable of doing with it because what if my coach, for example, decides to pin my f3 N with it.  The reason that's important is due to the fact that then Be2, isn't possible and even if so, he can still after exchanging on e2.  So, due to this I exchange it first.  But, when he takes back...",
        "12... fxe6 13. Nxd4": "That's when I eliminate his dangerous N.",
        "13... Bxd4 14. Qd2": "This time, my long term plan is to double up.  We will see this on my next move, and my goal from there is to, at some point, bring my other R to e1.",
        "14... Qe8": "I see a nasty plan looming from him.  In this position, Jack's plan is to play 15...Qg6, and with his remaining B on d4, and the R on f8, should the N ever move, the threat of winning a pawn begins.",
        "15. Re2": "As noted, this was also why I played 14.Qd2  The short term was to play this, anyway.  But, now, there's more to the story then originally stated.  The idea being is that this adds an important defender to f2.  When I played that, he said, \"Aha, you smelled that.\"  And, I said, Yes, I did.",
        "15... Nh5": "But, now that same threat that I mentioned earlier is immediate.  I was trying to think about what to do since I want to double up.  So, I asked myself if there was any other alternative to protect f2.",
        "16. Rf1": "Unfortunately, there is not.  And, with that being said, the long term plan that I had is void and invalid.  I think that Jack made the right decision because two R's on one file is known to be dangerous.  In fact, that was something he taught me and made me study one position as Homework.  That was because he got an overwhelming attack against me by allowing to double up on one file.  So, in this context, yes, I was trying to use his advice against him.  But, I am not surprised at the fact that it doesn't work since he is the coach and, therefore, knows what's really going on.",
        "16... Qg6": "I almost overlooked the threat as I have before.  In fact, at the time, probably about a year and a half or two years ago, we had a similar position with the same threat.  And, he played something like this.  At the time, I viewed it as pointless, and figured that he waisted his time, and that this would be the time where I'd play something and get the advantage.  Compare it to last time, and it would be the equivalent to, say 17.Be7, threatening to take his R.  So, he then responded, to, obviously what's the equivalent to 17...Nf4, forcing me to lose my Q for a N, were I to avoid mate.  So, the response was equal to 18.Bxf8, in which he did have 18...Qxg2#  By the equivalent to, I don't mean it was played, as the position was different.  In fact, I couldn't even remember what the exact position was, but it was very comparable to this position.  So, what I'm doing is comparing the positions and mentioning how I overlooked that threat, and since then what I've learned.  With that being said, I wasn't going to overlook this threat.  Therefore, as you might expect, I asked myself what I can do.",
        "17. g3": "But, \"Upon further review\" as the GK staff put it, this was the only alternative.  In other words, I had no choice but to open up which makes sense because he has told me that, sometimes, opening up is the only way to avoid mate, as the K needs, \"Air to breathe.\"  This is the perfect example.",
        "17... Rf4": "Seeing that my g pawn is pinned, I know that he is threatening to win it.  Once again, I thought about what to do.",
        "18. Be7": "?? And, I thought this was the only option.  But, after the game Tom (who came in just a few minutes ago), Jack, and I reviewed it.  As he pointed out, this loses right away.  When, we analyzed it, I realized that this was quite similar to a position I had, in my last loss against jstevens1, which was actually my second to last game against her.  I had a similar pin, but then I made a mistake allowing her K to move, and when she did, I was lost.  That's because when she eliminated a pin, like this by moving her K, I was left in a fork.  And, with that being said, my K had to move.  Therefore, 18.Kh1 was forced.  Like with that game loss, not only would the pin have been broken, this would also leave his R attacked.  Which, when all is said would have given me tempo.  What he said, and I forget was that in the next few moves he could win a pawn.  After being my own spectator, I realized that it isn't so, and that with gain of time, I just might have a small edge.   But, with this move, I am hopelessly lost. ",
        "18... Nxg3 19. hxg3": "?? You might have thought that I got greedy and wanted to win something.  Not this time, for had it been simple greed, I wouldn't have played it, after what I learned.  The problem is and was, especially here, that in OTB Chess there is no analyze the board.  And, I knew that once he moved his N, Jack would have a discovered check.  But, what I thought was that his discovered check would, however. be mate.  So, as far as, I was considered, I was preventing a mate in one.  By looking at the board (in the aftermath with analyze the board) I realize that this isn't so.  In fact, much better was to allow it.  Not exactly sure what I should've played, but something like 19.b4, came into consideration allowing him to do that.  Yes, this would've prevented that.  However, against my coach, it would still be lost because I would lose a piece, immediately, and two or three pieces in a few moves.  So, needless to say that, as jstevens1, I would face, \"ruinous loss of material\"  But, that is better then what is to come, as now, mate is inevitable. ",
        "19... Qxg3+ 20. Kh1": "On this move, however, I did become a little greedy.  Thinking that I had gotten some counterplay, I played 20.fxg3 which was taken.  That's because Jack and Tom accurately pointed out that taking would be an illegal move.  What I overlooked is that, in addition to, the g pawn, my f pawn was also pinned, so that I could not capture there.  With that being said, this is forced.",
        "20... Qh3+": "Seeing that he will mate on g4 after only having one square for my K, I resign.  Now, in the end, I learned something important.  First, Tom said something that he said a while ago, which is why I stopped annotating OTB games, sometime ago.  But, seeing how good Jack is, not to mention that he is famous, as I posted a lot about him, they asked me to annotate the game.  Now, in order to make the annotation, I had notate and record the position.  But, Tom said that one lesson was that I needed to stop writing things down so that I could concentrate on the actual game.  Jack agreed by nodding his head.  Normally, I would to, but easy19, who is currently a master, and therefore, has a higher ranking said that it is good to record.  That people have been notating games, whether tourney or not for over 100 years.  And, that doing this is good for you.  Consequently, I, believe it or not, agree with him.  But, after this game, I played against Tom, in which, I didn't notate.  Yet, I made the same mistake against, so the same move (Kh1 was must.)  Although it was a different position, he was threatening mate with two of the same pieces.  In fact, my coach said that he has seen this in a couple of my games, and he's seen is only OTB games.  With that being said, this mistake has also been made in a few of my games on this website so the moral is very important.  Having said that, the real lesson to be learned is that in certain circumstances, where your opponent threatens mate on the castled side with his or her Q+R you must move your K to the corner.  By that, he means on the a or h files, and on it's homesquare (so on the same rank where the K is initially placed.)  Doing that will stop the threat because those pieces won't be able to barge in and cause damage, as they did here.  Therefore, this is an important part of King Safety, as Jack put it."
    },
    "url": "https://gameknot.com/annotation.pl/otb-wtw-coaching-game?gm=59953",
    "gameName": "OTB WTW Coaching Game",
    "players": "Joe (1320) vs. Jack Stockel ",
    "opening": "Ruy Lopez (C64), classical defence, Zaitsev variation"
}