{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Bb5 a6": "As I already knew given how well I know Ted, this was going to become a Spanish Opening.  And, this is how Ted usually responds.  There's nothing new here.",
        "4. Be2": "But, in an attempt to avoid exchanging this early I retreated here.  I mentioned about this variation in my last annotation, and it happened here.  However, although the move isn't dubious, we're heading into unfamiliar territory, as this is the first time that I have played this move in the Ruy Lopez.",
        "4... Nf6": "Although it's not a transposition, this reminds me of the Berlin Defense.  Since I blocked the connection of my K and R with 4.Be2 e4 is now attacked.  As after the Berlin Defense, we often see 4.0-0 Nxe4 5.Re1 winning the pawn back.  Thus, it's a gambit but not a true gambit since fiercequeen said that gambits can also involve exchanges during the opening.  But, with my B on e2 that variation is not possible.",
        "5. Nc3": "So, this move is what I used to play right after the Berlin Defense, and with it, I remember that it's a great way to defend e4.  Of course, there are other options, but this deploys another piece, at once.",
        "5... Bb4": "Not surprisingly, Ted wants to exchange.  I was asking myself what to do here.  But, after further consideration, I realize that there is no way around it.  He'll exchange.",
        "6. O-O": "And, with it, I castle at once.",
        "6... O-O": "So does Ted.",
        "7. d4": "? Knowing that there's no Noah's Ark Trap with what ION explained, I decide to go after his d pawn.  There is a plan affiliated with that.  However, what I didn't realize is that this is going to cost me a pawn.  So, better was 7.d3 which fulfills a different function which becomes powerful.  As we'd be talking about planning a pin on Ted's Nf6.  ",
        "7... exd4 8. Nxd4 Bxc3": "As after this move rather then take back right away, this is the one time where I ignore the lesson about exchanging.  So, I take on c6 just because it's possible.  Be it note that this is only because I have to pack up and leave in, at most, 15 minutes.  And, I don't want this game timing out.  In other words, if my only two choices were to lose or have this game remain unfinished, I'd rather lose.  As that way, when I annotate, I can, at least, say that it finished.  However, even if I had taken on c3 first, I'm pretty sure that Ted would follow up with the later ...Nxd4 so we'd be talking about a transposition of this exchange variation.",
        "9. Nxc6 bxc6 10. bxc3 Nxe4": "This is what I'm talking about.  And, had I played 7.d3 this wouldn't have happened.  Yet, losing a pawn doesn't bother me here as this is where I start the unsound aggression.  Be it note that there's only about 10 minutes before I have to leave, at this point.",
        "11. Qd4": "Another thing to note is that Ted was threatening my c3 pawn.  In return, my Queen would be attacked.  Of course, a more sound option would've been 11.Bb2 which can pose as the same threat.  But, I'm also interested in attacking the N which of course, Ted will defend.  But, that's what I'm keeping in mind is the obvious threat.  Bear in mind that this is where I applied an idea that fiercequeen mentioned with her Q sac.  And, that was combined with some of TA's irregular openings.  Not even the blitz Q sacs, but he doesn't develop anything until the midgame, whereas, his opponent develops and controls the center early.  That should favor his opponent, but TA wins the game, anyway.  In my case, it's a threat that would not be difficult to drive off in which white would face some problems.  Worth noting that if I had more time, I would not make a threat that's so easy to drive off.  That is, unless it's a coaching or mentoring a game where a piece is en-prise with which I'd teach why, \"To take is a mistake.\"  But, that's not the case here.",
        "11... Re8 12. Bb2": "Continuing with the threat.  As noted, this is what I really had in mind.",
        "12... d5": "Somewhat similar to what I saw with blitzkov during the misstep Ted could've drove this away with 12...c5, and then, I would have some problems being his gain of tempo.  I knew this the entire time but had a feeling that he would miss the opportunity.  As I know my opponent.  And, that's something else that I kept in mind because if I didn't know him or he was about my strength like Tom Walsh, I would not make that kind of threat.  Instead, I'd really have to struggle to try to get the game done before having to leave.",
        "13. c4": "And, this is where the threat is there at once.  My anticipation was that he'd 13...dxc4?? which would end the same way as what he plays next.  But, there are good moves that would make my plan fail.",
        "13... Nd6": "?? But, this isn't it.  As now, mate is coming.  Better was 13...Qf6, but it's not all that good for black as then comes something like 14.Qxf6 Nxf6 15.Bxf6 gxf6 and his K side pawn structure is ruined.  Best would've been 13...Nf6 which would've put an end to my threat.  On a separate note, my instincts of how little time we'd have was correct.  As after this game, there was only 5 minutes before I had to leave.  That only gave me enough time to pack things up and do what I have to do before saying goodbye.",
        "14. Qxg7#": ""
    },
    "url": "https://gameknot.com/annotation.pl/otb-chess-game-4?gm=63470",
    "gameName": "OTB Chess Game 4",
    "players": "Joe (1323) vs. Ted ",
    "opening": "Ruy Lopez (C68), exchange variation"
}