{
    "moves": {
        "1. e4": "In contrast to Carl, but as with anyonelse, I know the opening that Tom likes.  Once or twice, he plays something else, but this is how he usually opens.  And, I have a ready answer for that since I like Sicilian Defense.",
        "1... c5 2. c4": "I'm used to seeing 2.Nf3 with anyonelse except for Tom.  As this is how he usually responds.  So, I'm going to play it, as though, I was preparing to go against the Italian Opening.  It's very different, but the idea for me is to become comfortable in unfamiliar territory.  Even though he usually plays, I haven't played him for a while.  And, whenever 2.c4 is played in the Sicilian, I always ask myself now what but come up with my next move, anyhow.",
        "2... e5 3. d3": "Tom guessed it right, as I will bring one of my N's out which threatens c4, but 3...Nf6 would've threatened e4.  This protects both.  In fact, my next move is a transposition of what I often do because my next move is usually 3...Nf6, followed by, 4...Nc6 for the same reason.  I decided to switch things for a little bit of an educational purpose as I was interested to see how things would differ with my own transposition.",
        "3... Nc6 4. Nf3": "And, it turns out to be nothing since this is what Tom plays with 3...Nf6  If he had played 4.Nc3, first, then it would've been a full transposition since he would be transposing, as well.",
        "4... Nf6 5. Nc3 Be7": "This is what I also do when both my N's are developed to enable castling on the next move which is going to happen here, as well.",
        "6. Be3": "Meanwhile, Tom continues with his development.  Also, it didn't occur to me, but I could've played ...Nd4 right here and now to threaten an exchange.  So, better for Tom would've been 6.Nd5, right then and there which turns it into a timing issue which is also critical.  Meanwhile, I wanted to get my K to safety right away.  Now, Coach Stockel said that in the opening you can move quickly, but when later on is when you have to take your time.  Well, given that I moved quickly here makes disagree with him about even the opening as things can still go wrong early on.  What happened this time aligns with what Michael posted in my previous annotation which is that I'm not looking ahead yet due to how early we are in the game.  I should be starting after the first move, even when I'm taken off guard early on.  In fact, I remember something similar happening with Ken in our second training right after the Owens Defense.",
        "6... O-O 7. Be2": "For a while, I thought that Tom had the same idea since this allows him to castle as well by completing his development.  But, white has other ideas.",
        "7... b6": "As before, it still didn't occur to me that I could play 7...Nd4 as I'm still playing fast.  My only idea was fianchettoing, so as per a different question from Kenneth_fiore_3 in previous annotations the answer here was no which is something that I, sort of, regret since I forgot how easy it is to go wrong very early on.  So, I didn't look at or consider anything else, besides this move.  But, this is the last move where that happens since the opening is, pretty much over.  Now, we're heading into the early middle game, so I start slowing down on my next move.  Although I forgot the time controls, in the end, I believe I had about 20 minutes.  If so, Tom had 25 because what I remember is that in the end, Tom only had 5 or 6 minutes more then me, so it wasn't as much rushing.  But, what's true is that he takes more time then Carl which is good. ",
        "8. b3": "Unlike before, I'm not sure why Tom played this.  But, 8.Nd4 was better to refute against my next move.",
        "8... Nd4": "As I am back to thinking about what happened in my first training game with Ken.  That is, how we won by refusing the exchange.  The point being is that I wanted to exchange, but that would've eased my tension.  The same thing is true here.  I don't exchange, unless I feel there's a very good reason for doing so.  And, by that, we're talking about extenuating circumstances.  Well, this is one of those times.  The idea behind it is to fork and win a piece for pawn.  Of course, Tom can still stop it by not exchanging, but seeing how well his Be3 is placed, I'd try to exchange that with 8...Ng4 since my N isn't as mobile.",
        "9. Nxd4": "?? But, this is where Tom blunders.  9.Nd5, although not as good now as it was earlier is still the best move.  Of course, I'd exchange, and as noted above, when he takes back, I'd answer with 10...Ng4 since the N's still blocked.  Having said that, I know why Tom played as he didn't want me bringing my N up, but it's a lot better then what to occur since I'm bound to win material, starting with my next move.",
        "9... cxd4 10. Nd5": "Trying to minimize Tom bring the N down now.  As noted, this was more effective earlier.  And, with that being said, this move helps because I would've grabbed something first, but I'll first exchange N's to turn it into liquidation.",
        "10... Nxd5 11. exd5 dxe3 12. fxe3 Bb4+": "Keeping in mind that his K is no longer due to him being forced to take back with the f pawn, I throw Tom right in check to take away his right to castle.  And, when Tom gets out, I place him back in check to further weaken his K by allowing me to pin his e pawn.",
        "13. Kf1 Qf6+ 14. Kg1 Bc5 15. d4": "Trying to get out of it, Tom goes on the offense.  At first, I thought that this will do, but then, I remembered about my e pawn.  And, with it, I figured out that there's no way out for him.  As taking back is going to lose an additional exchange (R for B) with best play.",
        "15... exd4 16. exd4 Bxd4+ 17. Qxd4": "?? I can understand this move as it's easy to think that this move compensates for lost material.  But, what I kept in mind from ION in one of my students annotation was I believe, he called retrograde captures.  And, if it wasn't that, then it's retrograde diagonals which are easy to overlook since I have my Q on the same diagonal.  Although there was very little hope for white, assuming that I was to blunder which happened once or twice, there's no chance of counterplay after this.  As now, I will capture his Q and pick up both of his R's without anything in return since when I take, he'll be in check.",
        "17... Qxd4+ 18. Kf1 Qxa1+ 19. Kf2 Qxh1 20. Bf1": "Having said all of that, I would've resigned here, as white.  But, I can understand why Tom didn't and Jack has told us not to resign during the tournament.  It's easy to get confused because what he meant was just being a piece down.  However, Tom also knows that there's a slim chance of me timing out.  So, this is something like Hope Chess.  He's not hoping for a blunder, but the hope is that I spend too long trying to find the right move.  And, in doing so, the flag drops, and I wind up losing on time.  I'm not going to let that happen, as it did against Mariann.  So, I think about what to do, but it takes me a minute to find the next move as I realize that his h pawn is still en-prise.  So, I take it but not just for the sake of getting a pawn.  It's also remobilize my Q so that it's not stuck on h1.",
        "20... Qxh2 21. d6": "Still doing what he can, Tom tries to block my d pawn.  However, even if I weren't to take it, this wouldn't matter.  He's probably thinking that I'm going to break through and try to promote, and it would work on that.  But, I have no intention of promoting.  As noted in some of Erika's annotations, when you have this much material, then you can use what you have to mate your opponent.  And, that is my real intention.  So, ignoring my d7 pawn, I take to further mobilize my Q as that's something I'll use to mate, later on.  And, unlike the last game, there's no visualization here.  I'm just thinking about how I can use my Q and get the other pieces in action, bits at a time.  It doesn't take long for them to come together, either.  At this point I have, something like 25 minutes, and so the game was over here, about 5 minutes after this move.",
        "21... Qxd6 22. c5": "I was not surprised to see Tom attack again.  But, it was here that I just began to realize how I could deliver the mate, and it's starting on my next move since he'll be in check.",
        "22... Qxc5+ 23. Kg3": "And, after this move, I thought about wherelse I could go.  And, this is where I really put the pieces together and work on a mate starting with my next move.  As now, I figure out a way to bring my other pieces in the action, as well.",
        "23... Qg5+ 24. Kf2 Bb7": "And, it's with this move.  As I do something different that I hadn't even considered since at the beginning of studying the B+N endgame checkmate.  Of course, that's when, even though I didn't use it, was told about the math perspective.  Particularly, it was trigonometry about an isocoles triangle.  In this case, it's not an actual triangle but it's something just like it, and I'm thinking along the exact same lines as one. For example, we generally of normal math symbols such as tangent, sine, and cosine, but I thinking of the opposite, like cotangent, etc.  As it's a little different, but as an example, I'm about to bring my Q and R on the same vertical, starting with my next move.  If my B were on, for example, d5, then this would be a triangle.",
        "25. a4 Rfe8": "As now, my Q+R+B have, pretty much formed something like it which will end the same way, in mate.  ",
        "26. a5 Qe3#": "After this game, Jack, as usual since he has to know, asked us who won.  When I told him, he said, \"Then, you are the champion for this tournament\".  After this, there was one more game between Tom and Carl, and I thought that if Tom won he was in second place, and if Carl won it would be a sudden death and they'd have to play the following week.  Carl won, but a new person prior to that came in.  He only played his first game against Carl and won.  But, he was disqualified from the tournament for not showing up to chess club.  Jack said that he still had to count that one loss, so Carl lost and Tom was in second place.  Upon winning the whole thing, he said, \"Good, you are improving and getting better at this game.\"  I thanked him and smiled for the compliment because as with Master Nathan Resika telling me not to go by my online rating, Jack also helped me to stay true myself by saying that.  As it means that I continue doing what I'm doing which is by staying calm in the way that I now know how to for the tournaments.  And, doing it is working and is the right path of improvement.  Of course, I am, at a later point going to speak to Carl about setting up the third game again with ION's analysis and suggestion.  I don't think it's going to work because a another tournament begun, as of last Friday.  And, games after that very week are usually forgotten about, but I'll try.  I also know that, at least, something else is working."
    },
    "url": "https://gameknot.com/annotation.pl/otb-tournament-game-5-semi-finals?gm=66567",
    "gameName": "OTB Tournament Game 5-Semi Finals",
    "players": "Tom  vs. Joe ",
    "opening": "Sicilian (B20), Gloria variation"
}