{
    "moves": {
        "1. e4": "I start off with my usual.",
        "1... c5": "And, he answers with the Sicilian Defense.",
        "2. Nf3": "Until things change, I stick with the usual.",
        "2... Nf6": "This, however, took me into unfamiliar territory, as 2...d6 is most often played.  2...Nc6 has also been played.  And, this move has been played but on the first move, so that would be 1...Nf6.  That's the Reti Defense.  This isn't since he played 1...c5, but it doesn't matter because I'll treat as if it were that defense.  That's because the most common answer to that is to defend the pawn with 2.Nc3, and I am going to play it but on my next move.  So, make it 3, as opposed to, 2, but the point is that it still works and is, thus, playable.",
        "3. Nc3 d5": "Preparing to exchange.  I probably should've declined this though, after the first lesson with Ken.  The reason I accepted it was due to me getting hooked on what's called the exchange variations.  That can take place with the Spanish Opening or the Ruy Lopez and it does involve exchanging this early.  The starting the position to that is similar.  We also see something like that in the Morra Gambit.  Even though it's not any of that being hooked on remembering those variations, I decided to apply what I know from those variations since I am still in unfamiliar territory.  My idea is to become familiar, but I feel that I'm doing things the wrong way as this was the only variation that I looked at.  And, the thing is that it's important to look at more then one variation as Ken noted in our first game which is exactly what I failed to do here.",
        "4. exd5 Nxd5 5. Nxd5 Qxd5 6. d3": "Thinking in terms of what I see in the Spanish Opening when d4 isn't played to avoid the Noah's Ark Trap, and thinking that the variation wouldn't work because of what happens when pawns were exchanged, I played this.  My worry was losing a pawn with something 6.d4 cxd4, thinking that 7.Qxd4 would lose my Queen.  What I forgot is where my N was located, and in this position, that exchange was acceptable.  But, I might as well have overlooked that since it did prevent me from jumping the guns.  As otherwise, I would've exchanged more, in which, I believe would've been unnecessary, as now, it would be just because I can with the fact that I had to come to work earlier then usual which gave me less time here.",
        "6... e5": "Opening up a line for his Bf8.",
        "7. Be2": "Yes, I'm preparing to castle, but it's more then meets the eye.  As now, a later ...Bg4 since my Nf3 won't be pinned.",
        "7... Nc6": "Continuing with his development.",
        "8. O-O": "And, I get my K to safety, at once.",
        "8... Bd6": "Similar to me, Perry is also continuing with his developing.",
        "9. b3": "?! Not knowing what else to do, I fianchetto'd my Bc1.  What I forgot is that I could've developed it, having forgotten that I advanced my d pawn much earlier.  Therefore, this becomes a near equivalent to the doubled fianchetto'd especially in the KID.  As this is a waste of time and could cause compromises with white's position.  It was a little later that I figured that out.",
        "9... Bg4": "?? I had expected this, but as noted, am not at all worried.  Given about the unnecessary fianchetto, that's not how I should feel.  But, I am the kind of person that feels more comfortable and happy about my position then I should.  I do know why, for when I was a novice several years ago, I got too nervous and episodes of the Fight or Flight response which led to a ton of mistakes.  About 50% lost, and there were a few where what should've been a loss was just a lucky win.  Ever since, I got into Yoga as I learned to accept wherever the journey takes me.  In this case, what the position demands.  But, I go the other way, feeling too comfortable and losing my way.  In fact, that's how I lost a piece so early in a team match and got a very lucky draw that I didn't deserve after thinking the same way against Ken in our second game which I lost.  In this case, it's ok to be happy as this move was a blunder.  As now, I'll continue to harass his Q which will allow me to win a piece.  But, in the future, I will have to be more careful with being happy or comfortable in the future as that has also negative affects on my play.  A perfect was my most recent loss.  After taking the B when Will threatened mate, I tried to force an exchange of Rooks, by attacking his R.  As I was happy and comfortable, but I shouldn't have been.  I thought that I'd gotten my way, but overlooked that the pawn next to it, which appeared to protect the other pawn was pinned.  After he took, Will was going to mate, before I resigned.  So, the idea is not to get nervous but finding the happy medium.  That's because at the same time, you don't want to be so happy that you just feel that everything is ok, or even, you have the advantage.",
        "10. c4": "With that being said, I felt comfortable and happy enough to go ahead and kick Perry's Q, as it was out after the exchange.  My plan is to continue harassing it, where I could do some damage.  As noted, in this case, being happy and comfortable does work because of what's about to happen, given Perry's last move.",
        "10... Qe6 11. Ng5 Qg6 12. Bxg4 h6": "Trying to see what he can do to get the piece back, he kicks my N.",
        "13. Bh5": "Given that my B is guarded by the Q, I counterattack.  As we're about to see, this move is going to allow me to win more material.",
        "13... Qf6 14. Nxf7": "I was debating between taking with the B, since Perry's in check or taking this way.  But, this is where I applied what I had learned with my second lesson against Ken.  The idea is mobility because what TA taught about the N visualization count.  It can go in so many places and be a monster.  And, that's going to happen.  What's more is that when this happens, I'll be able to throw in a discovered check since Perry must protect his attacked R.  This does mean, however, that will lose a second piece without compensation.  Therefore, I'll be up two pieces and three pawns which is the equivalent to a Queen.  Consequently, I'd call it a resignable position.  In other words, I'd resign, were I black, but Perry decides not to do that.",
        "14... Rf8 15. Nxd6+ Kd7 16. Nxb7 g6 17. Nxc5+": "I did anticipate Perry's last move, I kept in mind that this won another pawn since he is in check.",
        "17... Kc7 18. Bg4": "After which, I'm trying to figure if I can use my two B's in any way to deliver a checkmate.  That's because GM Susan Polgar illustrated that you don't just need your K's, and it doesn't have to, necessarily, be an endgame to deliver the mate with both of your B's because of the squares they occupy.  I was seeing if I could apply it here, but I can't.  However, there are still more tactics that I can apply which is overwhelming.  I'm a little surprised that Perry didn't resign here but not shocked.  That's because he is a novice, and ION told me that, as a general rule, the stronger players resign when you lose material.  But, the ones that aren't as strong will keep playing until it's almost mate.  And, I thought this way for a while, until a lesson with reversion.  And, were this someone of my strength or weaker, I'd probably stay in.  However, I would resign against someone much stronger, in this position.",
        "18... e4": "Doing what he can, Perry attacks my d pawn and threatens to win my R.  Had he not played this, I would've answered with 19.Nd7, as opposed to, what I play.",
        "19. Ne6+": "However, that helps my position even more as I can now liquidate one of his Rooks.",
        "19... Kb6 20. Nxf8 Qxa1 21. Nd7+": "What more is that I can still maneuver my N back and forth with what I learned from Senior Master Joe.  In the process that allows me to win another pawn.  But, I could do a lot better then that, as I overlooked a short range tactic here.",
        "21... Kc7 22. Bxh6": "With that being said, much better would've been 22.Bf4+.  As now, Perry would be forced to give up his Queen with that discovered attack.  I overlooked that with the urge to take his pawn immediately, as that's the first thing that came to mind.",
        "22... Nb4": "I am not sure why Perry played this.  But, Perry could have tried to stay in by retreating his Q.  I anticipated him liquidating here, but retreating was a better try.  This is going to allow me to win his Queen.  But, I thought that I had something better which is why I, intentionally, delayed it with my next move. ",
        "23. Bf4+": "As I, somehow, thought that I had a mating sequence with my B's, as I mentioned earlier.  After finding that I was wrong, I take Perry's Queen before that opportunity is gone.  As noted, this would've been better a move earlier, but I am going to play my next move, regardless.",
        "23... Kc6 24. Qxa1 Nxd3": "Rather then grab the pawn, remember when I said earlier that I wouldn't have resigned against someone of my strength or a weaker player?  Well, now I would with how far behind black is combined with white, on top of that, getting a free Q.  I'd now consider it hopeless.  He can try for a stalemate, but that requires Hope Chess.  Which is that the person who's winning makes a miscalculation which allows a draw.  That, however, usually doesn't work, and it won't here.",
        "25. Qf6+": "So, I can't use just my B's, but I'm trying to figure if I can mate here if we use my WQ, on top of that.",
        "25... Kb7": "I think not, though.",
        "26. Qd4": "?? So, I try something else, as my plan is trying to remove the guardian by chasing away his Nd3 which would allow Qd5.  Of course, the plan is Qc7!.  But, I overlooked what's happened as one of those pieces was attacked.  By playing this, Perry will get a piece back.  Better was 26.Bg3 where, not only is my DSB protected, but the same threat would remain.",
        "26... Nxf4 27. Nc5+": "So, this is played, as now, I will get an additional pawn with this fork.  That is another example of how dangerous the N's can be.  This is why Susan Polgar's general advise was to exchange your B for his or her N.  However, I could've won it even quicker, as well as, the N at once with 27.Qxe4+.  I know what it was, remember when I said that there was even less time then usual.  Well, I had to leave 15 minutes earlier then average.  As my shift began an hour earlier then normal.  Because I was running low on time, I did anything for a quick win, without taking enough time to think about short range tactics.  Had I spent a little longer, I would've taken advantage of my opportunity to take on e4 with that nasty check.",
        "27... Kb6 28. Nxe4+ Kc7 29. Qd6+": "Given that my Queen is protected by the N, I throw in this check.  The idea is that I will win, yet another piece with this fork.  By doing so, it basically voids out the blunder that I made with my DSB, as I picked a piece worth just as much.  ",
        "29... Kb7 30. Qxf4 Rh8": "I believe that Perry was worried that my h pawn would promote.  To his knowing, this move stopped.  But, I wasn't thinking about promoting here.  Instead, the plan is to put pressure on Perry by delivering checks with my Queen.",
        "31. Qf7+ Kb6 32. Qf6+": "And, the reason why is because of what's about to happen.  That's right, the real plan was winning his R, and thus, Perry's last piece.  And, I looked at some variations that would lead to this given the fork which will carry out the plan.",
        "32... Ka5 33. Qxh8": "On that note, Perry resigned here.  He told me that there was nothing left to fight for with how much I have against what he's got.  What's more is that I wouldn't have promoted, had he stayed in.  Instead, my next move would've been 34.Rd1 with the idea of 35.Rd5+ and mate would be soon to follow.  The point is that Perry had nothing left, and he realized it.  But, what helped to do was the important lesson on mobility combined with what I learned about those N.  As I used to my N and moved it to different places.  In doing so, I had those dangerous checks which led to this position, with which, Perry resigned.  The point is that mobility is super important, and judgement should be based on that.  That's something that I need to keep in more often in the future."
    },
    "url": "https://gameknot.com/annotation.pl/otb-chess-game-2?gm=62971",
    "gameName": "OTB Chess Game 2",
    "players": "Joe (1290) vs. Perry ",
    "opening": "Sicilian (B29), Nimzovich-Rubinstein variation"
}