{
    "moves": {
        "1. e4": "So, the best female player starts off with the most common opening.  We all know about the saying, \"Best by Test.\"  But, that especially applies to GM's.",
        "1... c5": "And, Pavlina responds with the Siclian.  And, whereas the King's Pawn Game is most common for most players, the Siclian is the most common defense for GM's.",
        "2. Nf3": "As one would expect.",
        "2... Nc6": "But, this is something that I wouldn't expect.  And, in fact, I think that it's out of book.  The most common move you'd see is the continuation, 2...d6, which is what most of us would have played.  But, not this move.",
        "3. Bb5": "Of course, I like this move.  But, it's under I guess you can say a faulty technicality.  But, it's faulty for me and not anyonelse.  That's because I'd do it to go back to familiar lines like Ruy Lopez since I wouldn't know what to play.  However, it's generally not a good idea.  The idea being that, ...\"when someone plays something that doesn't follow what you know then you must also play something that meets the change in the position\".  The question is, what move would that be here? ",
        "3... g6": "Now this move, I understand perfectly well.  In this position, Pavlina's goal is to fianchetto her DSB.",
        "4. O-O": "Meanwhile, Judit decides to castle.  I think that she made the right choice, and if I was white and playing the game, this is also when I would have castled.",
        "4... Bg7": "As mentioned earlier, black fianchetto's.",
        "5. c3": "I do not know why white played.  Personally, I would have continued developing.  One can develop by either advancing the d pawn, or bringing the N into play.  I would have played 5.Nc3, in this position.",
        "5... e5": "However, black waists no time in continuing to develop.",
        "6. d4": "? But, white almost has the same thing in mind.  I understand why JP played this, as opposed to, d3 as 6.d3, would have blocked her bishop.  However, this move is a mistake as it gives away a pawn, after a variety of exchanges.  One of the positives that can be taken away, however, is that white will have compensation, later on.",
        "6... exd4 7. cxd4 Nxd4 8. Nxd4 cxd4 9. e5": "So, all is said and done, white continues to advance her e pawn.  My guess is that she wants a passed pawn.  The thing is that we're not at the phase, yet, and that this is not going to become that, at all.",
        "9... Ne7": "In the meantime, black takes advantage of her opportunities to continue developing.",
        "10. Bg5": "The only problem is that white goes on the offense by pinning Pavlina's N.  As a result, I would have said that better was 10...Nf6?? except that it could result in the same.  In fact, that move would be a serious blunder due to white's e5 pawn.  And, 10...Nh6?? is not any better as it would also lose a piece due Judit's DSB.  So, was the best move here.",
        "10... O-O": "So, now, black tucks her monarch away.  However, the problem is that it allows something that white is about to do.  What is that?  Well, it allows JP to win back a pawn because of 11.Qxd4  Having said that, castling should have waited for another move, this time, as best was 10...Bxe5, winning another pawn and putting white further behind. ",
        "11. Qxd4 Nc6": "So, black decides to kick her white's Q.  Of course, there's more to chess then simply attacking pieces.  So, what was the goal?  I believe that it was tempii.  That the idea being was for Pavlina to attack her opponents Q to gain time, so that she can then develop.  And, black kept in mind that if white were to capture, so 12.Bxd8, then black can recapture 12...Nxd4",
        "12. Qh4": "? However, white launches a different attack, this time, on the K side.  But, at the same hitting on black's Q, so black must now take action.  The only problem, however, is that sooner or later, it loses a pawn.  That's the only reason, as to why, this move is a mistake.  And, unlike before, it's going to be a lot harder to for her to find compensation.  In fact, it will be an unusual since white is not going to win back material.",
        "12... Qb6": "And, this is how she does that.  But, don't know why.  I guess, however, black attacks with the idea being tempii because it should force white to retreat her LSB so that black can continue developing.  The only thing is that Judit has one move up her sleeve.",
        "13. Nc3": "And, here it is.  Instead of losing tempo, white actually gains time, so black did not achieve her goal.  In fact, it backfired, as 12...Qb6?! actually allowed white to complete development.  The only problem, as noted before, is that black wins material, a free pawn.",
        "13... Bxe5 14. Rae1": "!! Yes, it's generally very good to do after completing development.  But, at first, I wasn't sure why white would play this, and most certainly wouldn't even give a !.  Reason: with this move black will be able to exchange more material, and when you're behind, it's generally not a good idea to exchange, as it would give you less to defend with.  But, that is not the case, here.  In fact, there's a strategy behind this, after that exchange which is what makes this move extraordinarly brilliant, deserving a !!  So Pavlina, \"Better be careful from now on\", otherwise white will crush her.  ",
        "14... Bxc3 15. bxc3 Qxb5": "?? Normally, a move like this would deserve a !.  But, the saying, \"To take is a mistake\", applies here.  Black got overly confident since she was ahead, and this was Judit's plan, all along.  The idea was to force an exchange and give up a piece.  After which, something even bigger is going to happen, which is going to seal black's fate.  That's why this move was actually the losing blunder.  Note: What looks good might actually be bad, and it's important to be aware of that.",
        "16. Qh6": "So, white's brilliant plan starts with this move.  Therefore, as noted, Pavlina just walked into a lot of trouble, that she won't be able to get out of.",
        "16... Qf5": "I don't know why black played this.  But, this time, no matter what she does, it does not matter, this time.  That's significant, you know, because everything you and your opponent is essential and, therefore, should matter as few commentators said in some of my past annotations.  But, this is as an exception because no matter what, white has an inevitable mating pattern that black cannot get out of.",
        "17. Qxf8+": "And, after taking the R, black resigned.  Unlike the last time, resignation is not premature here.  Why?  Well, normally you'd think that this is quite bad, as that move should win a Q for a R.  But, \"It's not so easy\" as Jack Stockel and Judit Polgar has said.  And there's way to more this then meets the eye.  The reason being is that white now has a mate in two.  17...Kxe8 (forced), 18.Bh6+, Kg8 (forced), Re8#."
    },
    "url": "https://gameknot.com/annotation.pl/otb-chess-tournament?gm=53665",
    "gameName": "OTB Chess Tournament",
    "players": "GM Judit Polgar  vs. GM Pavlina Angelova ",
    "opening": "Sicilian (B31), Nimzovich-Rossolimo attack, Gurgenidze variation"
}