{
    "moves": {
        "1. e4": "So, I open with the King's Pawn Opening, and this is going to become a Ruy Lopez.",
        "1... e5 2. Nf3 Nc6 3. Bb5 Nd4": "Now, he responds in a very interesting way, that I have not seen before.  I am used to something like 3...a6 after the Ruy Lopez, but not this move.",
        "4. Nxd4": "In this position, I have a choice, between exchanging his Knight for mine, or nabbing his e pawn.  However, I think this is best.  Why?  If 4.Nxe5, 4...Qg5, so he eventually exposes my King or makes it unsafe to castle Kingside because if 5.c3, 5...Qg2.  It would force me to play 5.g3, and that is something I will not allow.",
        "4... exd4 5. d3": "I also could have castled, at this point.  However, I like this move better, at the moment.  Why?  If 5.0-0, 5...Qe7 is a feasibility.  If that happens, my e pawn is left hanging.  In addition, I have to play this move sooner or later, so why not now?",
        "5... Nf6": "In the meantime, he starts developing.  My goal, however, is to delay his development by forcing him to cram his own pieces and keep some of them stuck on the 8th rank.  So, I start by pinning his Knight.  After he breaks the pin, I castle Kingside.",
        "6. Bg5 Be7 7. O-O a6": "After I castle, he decides to kick my LSB.  Then, he will chase it again, forcing me to make another run, just before he castles Kingside.  However, I will pin his e7 pawn.  I intend to keep it that way because I believe that it will give me a longlasting strategical advantage.",
        "8. Ba4 b5 9. Bb3 O-O 10. Nd2": "After he castles, I decide to continue with development.  However, he is going to attack my LSB twice.  I understand that he wants to gain tempii, but there is one thing that I don't understand.  What is it?  Why does he want to open up his King, in order to do this?  In my view, 11.Bh4!?, and 12.Bg3!?  Note: I have lost a couple of games by leaving my King open.",
        "10... h6 11. Bh4 g5 12. Bg3 Bb7": "After I retreat, he decides to fianchetto his LSB.  In this position, that move is very effective for two reasons.  First, nothing is blocking his diagonal like his Knight.  Second, this is the only way for him to develop his LSB, as there is still a pawn on c7.",
        "13. Qf3": "Because I am completely developed, I decide to go ahead and bring my Queen out.  I am attempting long term tactics (not immediate mating threats).  The only question then is, at what point is it a good time to bring the Queen?",
        "13... Bb4": "As a result of my last move, he decides to attack my Knight, but that does not bother me.  However, I am going to make one mistake that will blunder away a free pawn and still leave my Knight hanging.  I thought that I could just end the attack with that one move, but as he would say, \"It's not so easy\".",
        "14. c3": "? This is the mistake.  In fact, he said that, \"this move benefits me, as I now get rid of my weak pawns\".  I think that I should just protect with my a1 Rook at once, not later.",
        "14... dxc3 15. bxc3 Bxc3 16. Rad1": "After which my Knight is still under attack, but my Rook is now attacked by the exact same piece.  However, this fork is just a nuisance, as I now defend both, with this move.  The problem, however, is that I gave something away due to miscalculation.",
        "16... d5": "And, he takes advantage by attacking my e pawn.  Of course, I do not mind, so I accept the exchange.  The only problem is that I am still behind, so I need a little more then just an even exchange.",
        "17. exd5 Nxd5 18. Qh5": "But, this is why I wanted the exchange.  Of course, he could have played 17...Bxd5, as opposed to ...Nxd5.  I mean, this was another possible response, in which case, this move would not be feasible.  In this position, I am actually trying to get something back, a pawn.  But, with this choice, my Q, LSB, and DSB will eventually become a mating threat, as we will see later on.",
        "18... Kh7": "So, he has to defend that pawn, in some way.  However, I will win it back, pretty soon, with my d Knight.",
        "19. Ne4": "And, here we go.  It starts off with a Knight fork, so he can no longer defend g5 without giving away his DSB.  ",
        "19... Bd4 20. Nxg5+": "Although it looks like an even exchange.  He cannot get out of check by retaking.  Why?  Because, 20...hxg5 is an illegal move, and I kept that in mind when I played 19.Ne4.",
        "20... Kg7": "So, this is how he gets out of check.",
        "21. Nf3": "After seeing the damage that I caused, I decide to take advantage by kicking his DSB since it gives me tempii.  As Master elyhim told me, gaining tempii is like taking money from your opponent, and depositing it into your own bank.",
        "21... Bf6 22. d4": "So, I kick it up a knotch because I know that I can get very tough and threaten mate.  This way, I feel that I am correcting some of my own mistakes, given that I previously blundered a pawn.",
        "22... Nc3": "And he decides to attack my Rook, but that does not bother me.  Instead, I will make a move that prevents him from taking my Knight.",
        "23. Bf4": "This is the move that I am alluding to.  That's right, if 23...Nxd1??, 24.Qxh5+, and mate is inevitable.  Why?  After 24.Qxh5+, 24...Qg8 (forced), 25.Qh7#.  BTW, my goal was not to immediately mate or trick him.  I am just trying to keep my Knight protected, without immediately losing tempii.  In addition, I am trying to prove to Mr. Stockel that I am really thinking, and I am succeeding in doing so.  After this move, my opponent said, \"You are getting really nasty\", and he was trying to prevent the mate.  BTW, when I played this, I looked at other feasiblilties, as previous commentator mentioned in a different annotation.  How?  He cannot take my Rook, in this position.  And, I kept that in mind when I lost against the Master Mater by grabbing one of his Rooks.",
        "23... Rh8": "! With that in mind this is best because he is still going to gain tempii, given that my Rook remains attacked.",
        "24. Rde1": "So, this is where I lose tempii, as I now have to keep my R protected.",
        "24... Nd5": "And he moves back, in order to attack my DSB, but that does not bother me.  In addition, I am not going to lose tempo, this time.",
        "25. Be5": "This is why.  Instead of retreating, I decide to force an exchange, and it does not affect my position since everything is even.  Therefore, I have nothing to lose with this exchange. ",
        "25... Bxe5 26. Nxe5 Qe7": "In this position, I do not know what he is trying accomplish, unless he wants to test me.  If he does, however, I am about to pass it with flying color.  This move, will enable me to threaten his Queen with a discover attack.",
        "27. Nc6": "Now, some people might think that black can just take the Knight, but that is not feasible.  Why?  As I mentioned on move 26, his Queen is attacked, so if 27...Bxc6, 28.Rxc7.  When you think about it, this is actually a double attack as my c6 Knight and e1 Rook are attacking his Queen.  ",
        "27... Qd6": "So, he responds with a double attack, against my Knight.",
        "28. Re7": "Ok, why did I move here?  It looks like I am just giving something away, but that is not the case, in this position.  The thing is that he cannot play 28...Qxe7, due to my Knight.  And, he cannot capture my Knight because if 28...Qxc6??, 29.Qxf7#, which is mate.  I kept that in mind before making this move.  BTW, I am not attempting mate or cheapo tactics.  So, what am I trying to do, in this position?  Well, I want to keep my Knight protected since it still remains attacked.  At first, I thought that my Knight was inevitably lost, but Jack Stockel would say, \"Think about things\".  And, l-d-j told me to look at other feasiblities, in a previous annotation.  This move prevents the, \"Fight or Flight\", response while protecting my Knight.  That is because, \"To take is a mistake\", at the moment.  In fact, Jack was quite amazed that I found this move.  \"Can you believe it?  He is actually threatening mate\", is what Mr. Stockel said.",
        "28... Kf6": "So, this move is his only option to prevent a mate in one.  Because he is out of danger, my Rook is back in harms way.  However, this will not last long, as I am going to win a free pawn and place him in check.  With that in mind, I go from a pawn behind to a pawn ahead.",
        "29. Qxf7+ Kg5": "Forced.",
        "30. Re5+": "Now, here comes real trouble.  Although it might not seem forced, Mr. Stockel's only option is to give up his Queen for one of my Rooks.  Because if 30...Kh4, 31.Qh5#.  And if 30...Kg4 31.Qf5+, 31...Kh4 (forced), 32...g3#, so mate is still inevitable.  This particular position is a little different then the actual game.  Whereas in the actual game, we arrived at a position that I thought was mate and had announced checkmate.  However, \"It's almost mate\", is what he said.  My opponent told me that there was only one other option, and the check had occurred on the eighth rank.  In that case, he only had one move.  What was it?  Bringing the Queen on the seventh rank.  In any case, he was still forced to give up his Queen for one of my Rooks.  BTW, your chances of winning Jack's Queen, is like getting a Royal Straight Flush in a poker game.  I only won his Queen, one time before this game.  And, it happened about 2 years ago.  After the game was over, he told me that I easily should have won that game, with the played move.  As we will see later on, however, I will make one mistake that turns a win into a loss, in the game, itself.",
        "30... Qxe5 31. Nxe5 h5": "I do not know what he wants, in this position.",
        "32. Ng6": "So, although it appears that best was 32.Qg6+, that was not an option in the actual game.",
        "32... Rh6": "?? This time, however, my Knight is actually attacked, so I have to find a way to protect it.  I cannot let him take, because if 33.Rxg6, 33...Qxg6 is not an option, due to his King.  Therefore, I thought that 33.Ne7 was the only move.  Although it is not the case, with this position, in the actual game this was the losing move, which is why I marked this with two question marks.  When the game was finished, Jack and I went over the game.  This was the opportunity to exchange material.  In my game, however, it was the Rook that could be exchanged for my LSB, as it was pinned.  That happened several moves after I exchanged his Queen for my Rook the position looked something like Ke8, ...Rf7, and Bg6 without anything to break the pin easily.  However, my only focus was on promoting the pawn, and that is what sealed my fate.  It is simply due to the fact that I was only concentrating on a pawn promotion, as opposed to, the position.  As a result, I was not thinking hard enough.  When everything was said and done, he was actually testing me to see if I was thinking, but, this time, I failed the test.  \"This is what I mean when I tell you to start thinking\", is what he said.  If I was thinking a little more outside of the box, I would have seen the pin and taken action.  And, that would have been enough to win. ",
        "33. Ne7": "Since, this position differs from the actual game, I recorded moves as just other careless mistakes that just lose the game, not the true blunder.  ",
        "33... Nc3": "Until now I did not see this, but after 33.Ne7 his Knight was attacked by my LSB, so he had to protect it in someway.  Why?  Exchanging would only harm his position, given that he is still behind.",
        "34. d5": "You might have thought that I was trying to mate, but that is not the case here.  In this position, my only goal is to promote one of my pawns, but he is not going to allow that.",
        "34... Rd8 35. f4+": "Now, I am trying to bring my King out, so that he can become active.  Note: In the endgame, your King is a powerful weapon.",
        "35... Kh4 36. g3+": "And, I am still trying to activate my King.",
        "36... Kh3 37. Kf2": "? Because he just got out of check, I am trying to establish the, \"opposition\", with our King's.  But, this is a mistake as it gives away a free pawn.",
        "37... Kxh2 38. Kf3": "Now that we were opposition, I am trying to promote a pawn by placing my King in between one of them.  BTW, this is a little similar to how the position looked, in the very end of our game.  That will be explained later on.",
        "38... h4": "Of course, he is trying to prevent my pawns from promoting, and he will be successful as we exchange material.  This time, exchanging material will benefit his position, even though he's still behind.  Otherwise, white gets an inevitable pawn promotion.",
        "39. gxh4 Rxh4 40. Rc1": "? So, I decide to attack his Knight, but this is a mistake as it enables him to connect his Rooks.  Note: This did not happen in the actual game.  However, as I mentioned earlier, I was recording position, as though white I was trying to lose.  That is because I lost the actual game, as soon as, I missed the opportunity to exchange material. ",
        "40... Rdh8 41. Nf5": "I figure that I would take advantage by attacking his Rook.  He responds, however, by placing me in check.  ",
        "41... Rh4h3+": "Now, 42.Kg4 is my only move, in this position.",
        "42. Kg4 Ne2": "Then, he decides to attack my Rook.",
        "43. Re1": "I, however, reattack.",
        "43... Nc3 44. a3": "After his retreat, I am still determined to promote, but he will do anything to prevent that.",
        "44... a5 45. d6": "In this position, I am attempting to exchange material since I am ahead, but he has a way to prevent that.",
        "45... c5": "Now, he is one step closer to promoting then me.  However, let's see, if I can something about that.",
        "46. a4": "In this position, I am not just going to pull my LSB back.  If I do, I do not think that I would be able to prevent him from promoting because he can connect his pawn.  Most importantly, his pawns are protected by his Knight and h Rook, on the third rank.",
        "46... c4": "?? However, he still decides to attack my bishop, and I am not surprised.  I knew that he would do this, but I thought that what I did was worth a try.  I realized that I was in trouble and do not think that I caused any more damage by trying to get out of a bad situation.  As my coach would say, \"When you are in trouble, concentrate.  Try to find a way out of trouble.\"  However, this is terrible blunder, as we will see later on.",
        "47. Bc2 Bd5": "After I retreat my LSB, he decides to attack my Queen.  In the actual game, he did this and won my Q back earlier.  That will be explained later on.",
        "48. Qg6 Rg8": "Now, the game is officially lost for white, as he is going to win my Queen.  As we all know, in this position, my Queen is pinned by his Rook, so it looks like he will retake with the Rook.  In the actual game, however, this is not how it happens.  Instead, he won it with a fork between my King and Queen.  He did so with his LSB, and it was very similar to a family fork.  However, my R was not attacked.  The actual position looked something like Kh1, Qd5, ...Bf3+, without any material to protect the Q and K.  That way, I would have to lose my Queen.  From then on, I sort of knew that black was going to win, even with best play.  But, I did not want to resign, until I knew that the game was actually lost for white.    ",
        "49. Ne7": "So, I decide to attack his Rook.  I knew that I would lose my Queen, as mentioned on move 48.  But, I did not want to give him a free Queen, so I made a decision to exchange it for one of his Rook.  In the actual game, this did not happen.  There were no exchanges, and he only had one rook.  As noted earlier, he won my Q with a Bishop fork.",
        "49... Rxg6+ 50. Nxg6 bxa4": "After this, however, he gets a free pawn.  And, a pawn promotion is officially inevitable.  Normally, I would just be able to recapture with my Bishop.  But, if 51.Bxa4, 51...Nxa4, so he would win a piece, for my pawn.  The rule is, \"exchange pawns, not pieces\", as master elyhim would say.  At this point, I realize that I do not stand a chance against him, so I resign.  In the actual game, however, I did not resign right after an exchange, and the position was completely different.  So, what happened?  Well, I was left with two connected pawns and my King, in between those pawns.  However, he was left with a P+K+LSB.  Therefore, if I were to promote, he would have taken one of my pawns with his LSB.  So, it looked like whites pawns were on something like f3 and g2, with white's King on f2.  And, blacks bishop looked like it was something like b3 so that he would take, if you were to promote.  But, it also appeared that black's remaining pawn was on something like d4, so that you could not stop it.  With that in mind, his remaining pawn was becoming more powerful, and I did not have anything to stop his promotion.  Consequently, I resigned.  Remember: What happened in the game is more important then, any of the positions that I recorded.  Believe it or not, my description of the actual game is the analysis.  The most important moral of this game is to think about all of the positions.  If I had analyzed this game and strategized a little more, I definitely would have won.  "
    },
    "url": "https://gameknot.com/annotation.pl/otb-wtw-coaching-game-failed-exchange?gm=48763",
    "gameName": "OTB WTW Coaching Game-Failed Exchange",
    "players": "Joe (???) vs. Jack Stockel (About 1800 USCF)",
    "opening": "Ruy Lopez (C61), Bird's defence, Paulsen variation"
}