{
    "moves": {
        "1. c4": "The English, I use 2 main openings this and e4 so i am familiar with it's nuances and am more than happy to play against it as black",
        "1... c5": "I usually use the Sicilian, so the English symmetrical is basically that..",
        "2. e4": "Creating a bind, this move does have the drawback of allowing the d4 square to the Qknight if the need ever arises, maybe this is less of a threat than the bind is an asset, I'm not sure...",
        "2... Nc6": "So i threaten to utilise this, obviously once I've developed...",
        "3. Nc3 e6": "I prefer to stop any chance of white plonking his knight on d5 for the time being, whilst i have the opportunity of doing the opposite..",
        "4. b3 Nf6": "Developing..",
        "5. Bb2": "i have a feeling that e5 will come at some point soon..",
        "5... a6": "A precautionary move..",
        "6. Nf3 d6": "This serves to stop any idea's of Nd5 in the near future..",
        "7. g3": "Preferring to fianchetto both Bish's..",
        "7... Be7 8. Bg2 Nb4": "I decide to take advantage of the fact that a3 has not been played and hopefully slow my opponent down a little, I can castle pretty rapidly if i need to, so I'm happy to plough forward a little..",
        "9. O-O": "Completing his development and getting out of the way of Nd3+! which would lose the Qbish..",
        "9... Nd3": "I play it anyway, it has great nuisance value i think..Although it's easily dealt with..",
        "10. Rb1 e5": "Opening up the diagonal for my Qbish...",
        "11. Ba3 b5": "I try to gain myself some space on the queenside so as to and maybe open up a couple of lines for my rook to operate on",
        "12. Qe2": "My knight is trapped, so what would be the best thing to do with it? I need to come up with something...",
        "12... Nxf2": "I decide to make use of it by taking away 1 of the kings defensive pawns and i have all that space to utilise my bishops with...",
        "13. Rxf2 b4": "The obvious move, now i have my piece back and the added bonus of taking out an important pawn..",
        "14. Bxb4": "Keeping things level...",
        "14... cxb4 15. Nd1 Bb7": "Putting pressure on the e4 pawn and tying my opponent down to defending and.. not attacking which is where i want him to be",
        "16. Nh4 g6": "I didn't fancy letting the knight onto f5 but in hindsight maybe Nxe5 is a far better move attacking both rook and knight....",
        "17. d3": "Now the moment has passed, should have taken it but maybe that's just greed talking...",
        "17... Bc8": "So i try and find a better diagonal for my Qbish now that the a8-h1 diagonal is well blocked for now..",
        "18. Ne3 Qb6": "I was hoping for Nd5 Nxd5 exd5 then i have a nice pin on the rook which i was hoping to take advantage of...Although my Kbish would have been blocked in and would have needed some attention to free up, so would it have been worth it?",
        "19. Rbf1": "Oh, loooking for a 2 4 1 bargain, ok..",
        "19... Qd8": "So back she goes..",
        "20. Nf3": "Looking at Ng5 no doubt..",
        "20... h6": "At this point i took stock and realised that I'm behind in development and have some menacing threats to b wary of, his forces are all building toward the traditionally weak f7 pawn and if I'm not careful i could find myself in real hot water...",
        "21. d4": "Starting to push for a few exchanges and open the game up to his advantage...",
        "21... Nxe4": "hah, a mistake on my opponents part and it's cost him a rook...",
        "22. Nxe5": "Sacrificing a piece just to get his rook back, not sure it's worth it...",
        "22... Nxf2": "So i dully accept...",
        "23. Bxa8": "As expected, so....",
        "23... Nh3+": "This move wins me the piece and I'm sure my opponent must have missed this check and was hoping for dxe6, Rxf2 and i would have been in real trouble due to the pressure on f7..",
        "24. Kg2 dxe5 25. Qf3": "Looking for a decisive attack rather than win pawns..",
        "25... Ng5": "Both defensive and offensive, i liked this move at the time of playing it..",
        "26. Bc6+ Kf8": "He must have been hoping for Bd7 but I didn't want to play Bd7, if you haven't spotted why already you will see real soon, so i play this which stops me castling but i felt that i was pretty safe and would be able to defend this position and it would be easy enough to develop my KRook by playing Kg7 so...",
        "27. Qf2": "He has to move his Queen which allows...",
        "27... Bh3+": "This! A lovely move, now both his rooks are lost and the pressure on f7 is alleviated, at this point my confidence was beginning to grow but it was a little premature....",
        "28. Kh1 Bxf1": "Obviously....",
        "29. Nxf1 exd4": "And i get a pawn too, great...",
        "30. Bd5": "Back to the f7 square, this guy is determined to get to me through this pawn...I guess it's his best way to proceed though....",
        "30... Bf6": "Protecting the d pawn and also once he plays h4 the f7 square will still be out of reach...",
        "31. h4 Nh7": "Extra support, which leaves my Q free to roam...",
        "32. Nh2 Kg7": "Freeing my Rook..",
        "33. Ng4 Rf8": "Freeing my Bishop if need be...",
        "34. Qf4 d3": "I allowed this upcoming check on purpose i knew it would lead no where and i wanted to free up the a7-g1 diagonal for my bishop to work on, it was about now that i saw a potential mating sequence..",
        "35. Qxh6+": "The check i was expecting...",
        "35... Kg8": "Now what?",
        "36. Qe3": "I knew he would have to take time out to round this pawn up, i think this 1 move gave me the time i needed to mount my attack...",
        "36... Re8 37. Qxd3": "I was a little concerned about a potential bish sac on f7 winning my queen if she wasn't covered but i wasn't going to let that stop me, i felt i could deal with it, and atm she is covered twice so....",
        "37... Re1+": "...on we go",
        "38. Kg2 Qb6": "Hoping to sneak in via g1...",
        "39. Qxg6+": "I have to admit i missed this move and sent a shock wave through my entire body, i didn't make any rash decisions though and studied the board for quite a time, i think i was about 20mins in front on time so i was happy to give this position the time it deserved..",
        "39... Kh8": "My only move...",
        "40. Qxf7": "Now I'm a move away from being mated myself and the pressure was beginning to tell at the time, i needed to act or i would find myself on the end of a un-deserved loss!",
        "40... Qd8": "it was either this or the rook being retreated , i felt the rook was more handy where it was rather than the queen..",
        "41. Nf2": "This move seals the game i think, why not Nh6, piling on the pressure and making me really tread carefully, although i haven't analysed this line so maybe it would have been wrong.",
        "41... Re2": "I can see nothing better...",
        "42. h5": "Not sure what white is trying to achieve, there's no way he has time to push this pawn to h6 and my bishop has g7  covered so i think this is just a waste, unpinning the king would have been smarter surely..?",
        "42... Bd4": "So i take whats on offer..",
        "43. Qg6": "getting his queen off that line for obvious reasons..",
        "43... Rxf2+ 44. Kh3 Ng5+": "I am really happy with this ending, very pleasing aesthetically aswel..",
        "45. Kg4 Qd7+": "Crowning my achievement with a little sac, he's doomed either way and this is just a little extra icing...",
        "46. Kxg5": "Accepting the knight and it's time for the death blow to rain down...",
        "46... Be3+": "Just Beautiful chess, i was really proud of this one hence the annotation...",
        "47. Kh4": "Forced..",
        "47... Rh2#": "And it's goodnight from him.....A great game of attack and counter attack, we both played well and had chances to dominate the game my opponent made a great account of himself considering he played most of the game a piece down and created real threats. I hope you enjoyed it and please add any comments. Thanks, Rich."
    },
    "url": "https://gameknot.com/annotation.pl/otb-match-bristol-england-comments-plz?gm=22963",
    "gameName": "OTB match, Bristol England, Comments plz",
    "players": "Anon  vs. Daveyr18 ",
    "opening": "English (A30), symmetrical variation"
}