{
    "moves": {
        "1. e4 g5 2. d4": "\"2.d4 is whites natural developing move. He now has his e4 and d4 central pawns developed.\"",
        "2... h6": "\"2....h6,my classic g5 pawn protector move. But this is the initiator of psychological strategy. Why? Because that g5 pawn can spring to square g4 at any given moment and attack the key f3 square where whites Knight usually rests on!\"\n",
        "3. e5 d6 4. Nf3": "? \"White could have moved Nc3 instead of Nf3,supported his central pawns more efficiently with an early c3 and a host of other responses....but failed to do so. \n\nWhy? Because he is only 1500 rated? No. That may be a small part of the reason, but not all. Its because this player is unfamiliar with this opening and was forced to traverse down a dark alley in thick fog. Even a 1500+player knows the basics of more sound development, but his mind plays tricks on him with sudden positions that surface from blacks King side development that are unusual. The hammer that shatters the glass usually occurs when a sudden central thrust from black occurs against whites central pawns or a multi attack occurs on both wings from black.....confusing white even more!\" \n",
        "4... g4": "\"4....g4(the classic creepy-crawly Knight attack)\"",
        "5. Nh4": "? \"Notice anything here? What was that I stressed many times about Knights on the edge file's losing some piece value due to restricted movement? And what did white do? So then, is my weaker 1....g5 opening defense still considered weak? No, in fact I am now equalizing at a rate as fast as the speed of light reaching whites town from a mile away.\" \n",
        "5... dxe5": "\"5.....dxe5 capturing a pawn makes white think. He does not want to take my pawn back on e5 for it will open up the center d file with possible early exchange of Queens and leaves whites King more vulnerable to attack. Either way, white is now at a disadvantage and the tide is turning swiftly in the Basman strategy I force on him.\" \n",
        "6. Be2 Nc6": "\"6....Nc6 counter defense support on my e5 pawn.\" \n",
        "7. Bxg4": "? \"7.Bxg4 is a double halo of poison. First my g4 pawn created a weakened white Knight on h4, now, by white capturing my g4 pawn, it \"allows\" black to begin a tempo attack on whites Queen after the Bishop exchange and the smoke clears. This early Q move from white simply amplifies whites insecurities with the Basman, now brought on by my Knight attack and then follow through with the classic semi open g file utilizing my Rook to control that file(and do not forget that white now has a central control pawn disadvantage with my well place Knight on c6\"\n",
        "7... Bxg4 8. Qxg4 Nf6 9. Qg3 Rg8 10. Qc3 e6": "\"Unusual doubled pawn position(move #10....e6)leaving a subtle potential ex-ray pin on whites King if he does not react quickly enough to remove his Q again. Another lesson in theory is to NOT line up your Q on a direct diagonal leading to your own King, especially with your opponents dark squared Bishop present and both your Q and K are ON THE DARK SQUARES!\" \n",
        "11. f4": "?? \"Yes, white fails to place his fleeing Q on a safe square and then gets the hammer to glass shattering move of mine\"",
        "11... Bb4": "\"Summary:  1.White allows my g pawn to attack his Knight on f3.That is his first mistake. Develop in other ways, like whites Q side. \n2.White has an early weak Knight move with loss of point value. Flank positioning of any Knight move early in the game is positional unsound development. \n3.Central pawn development is good for white initially as he proceeded to do, but failed at the proper \"support\" of those central pawns with other major pieces and/or f or c pawn support. \n4.Too early Queens moves for white began his downfall. \n5.White was simply not prepared to counter blacks WELL PREPARED Basman defense opening which BECAME tactically OFFENSIVE in nature against whites improper developing moves. \n\nSo, this weaker defense was a game of psychology which quickly, in 11 moves overcame whites POTENTIAL opening superiority. Yes, white can maintain an edge.....but must know HOW to maintain that edge in tempo and initiative! \n\nSo, this win of mine goes much deeper than simply a 2400 player brutalizing a 1500 player. It illustrates the sudden turning of the tide in 11 moves with a defense that is weaker than say, a Sicilian defense, but can have even more sting to those who travel into murky uncharted waters with no water map playing against this defense that moves OUT OF BOOK rather quickly from the onset. \n\nBy the way.... \n\nNotice in the final diagram above where Whites Knight is still positioned on h4,kind of protecting that g2 pawn of his, but still semi frozen and a obvious decrease in piece point value? \n\nYes, the Basman can have devastating results to the unprepared. And my opponent found this out in 11 moves of terror, confusion and bewilderment.\" \n"
    },
    "url": "https://gameknot.com/annotation.pl/otb-chess-game?gm=61230",
    "gameName": "OTB Chess Game",
    "players": "Jeff (1540) vs. Joe (2400+)",
    "opening": "Reversed Grob (Borg/Basman defence/macho Grob) (B00)"
}