{
    "moves": {
        "1. e4": "I start off with my usual.",
        "1... c5": "And, Jack wanted to change things up by playing the Siclian.  However, I'm all too familiar with it.  So, we stay in familiar until...",
        "2. Nf3 d6 3. d4 cxd4 4. Nxd4 e5": "This move.  As normally, 4...Nf6 is played, in which, white defends with 5.Nc3.  After that, it generally continues with 5...a6  But, with this move, I go back to the original square, as I don't know if other moves are better or not.",
        "5. Nf3": "That doesn't mean too much, though, as I looked at moves like 5.Nb5 and 5.Nb3  But, as usual, I didn't spend more then a few seconds considering them because I really didn't know what made them better or not.  Therefore, I just didn't see the point as one move with the N doesn't seem better or worse then the other.  So, I figure that it made the most sense to get the N back to it's original square and work my way from there.",
        "5... Nf6": "Not to my surprise, Jack continues with his development.",
        "6. Bg5": "As do I by pinning his Nf6.",
        "6... Be7": "Not surprisingly, this is how he breaks the pin as it is the most common way to do it.  Believe it or not, this is what I also would've played but not because it's the most common.  The real reason is that it brings black one step closer to castling.  And, I say that because I also would've given 6...h6 some consideration.  But, I don't like what happens after black castles which is why it would've ruled out of court, as that way, none of the pawns near the castled King have moved.",
        "7. Nc3": "Meanwhile, nothing holds me back from continuing with my development.  I did consider bringing my Bf1 into play at once with something like 7.Bc4 or 7.Bb5+.  But, I'm more comfortable getting the N out first, anyhow.",
        "7... Nc6": "I guess Jack has the same idea in mind.  But, this is also why I was not ready to play 7.Bb5+ at once.  As now, I can and will pin the N.",
        "8. Bb5 O-O": "I anticipated him breaking the pin with 8...Bd7.  With this played, I considered exchanging 8...Bxc6  But, not getting doubled pawns in return and, thus, keeping two connected pawns, I didn't see the point.  That's because after my first lesson with Ken, I thought about the possibility of using my Bb5 later on.  So, I decided to castle instead, just like Jack.",
        "9. O-O Bg4": "What I overlooked is this pin, as now, Jack will force a different exchange.  Better might have been 9...Nd2.  However, after a little consideration, I decided that exchanging is doesn't benefit black.  And, to my knowing, I might get an edge as his Bg4 appears stronger then my Nf3.  Therefore, I felt that a good strategy, in this position, is to connect my Rooks at once by moving the Queen to same rank as my Knights since, as usual, I have no idea of what else to do.  Obviously, I'm not going to exchange on c6.",
        "10. Qd3 Bxf3 11. Qxf3 Qb6": "As the saying goes, \"Don't trust your opponent\".  His instincts are right because another plan behind 10.Qd3 is that with Queen and Bishop on the same line, white, I believe, would get a stronger position.  So, Jack does what he can to stop it.",
        "12. Qd3": "But, I make it uneasy by bringing the Queen back to where it was.  Which means that the pressure is back on his next move.",
        "12... a6 13. Bc4": "So, I play this, as opposed to 13.Ba4, and it's still under the technicality that pressure against that f7 pawn worked in one game.  Plus, I was also a little worried that if I went back to a4, he could move the Queen which would threaten to trap my Bishop, with a later ...b5 which is somewhat similar to what we see in the Noah's Ark Trap.  So, I felt that to avoid any complications, combined with what happened in one game, this was best.  Now, if things, get out of control, I can always move my Queen, followed by the Bishop back and out of harms way, if the situation is to arise.",
        "13... Na5": "Of course, Jack will have none of that, as he threatens to exchange.",
        "14. Na4": "And, I refuse by attacking his Queen.",
        "14... Qc7 15. b3": "?! Instead of retreating, I felt that I was ok by adding an extra defender to Bc4.  But, I was wrong as this not only blocks the Bishop but will allow Jack to exchange, at the very least.  Better was to retreat with 15.Bd5, and that way, if 15...Nxd5, instead of recapturing the N, I'd take on e7.  And, after those series of exchanges, I'd feel more comfortable with my position.  By playing this move, he'll prevent what I noted with his next move, but that's not all.",
        "15... Rfe8 16. Be3": "? As here, I get too greedy and try to fork his Na5 and Qc7.  It's called being too happy about my position which as Ken noted in a recent annotation, I did the same thing against Tom Walsh which is another reason that I lost.  But, this is going to lose a pawn after Jack exchanges.  Better was 16.Bd5, and if Jack exchanges, it's not so bad.  As it would remain even, as opposed to losing a pawn and winding up with doubled pawns.",
        "16... Nxc4 17. Qxc4 Qxc4 18. bxc4 Nxe4 19. Nb6": "Trying to halt off the attack, I don't hesitate to attack his Rook.  And, by not hesitating, it means that I was not going to consider anything else.  That's because of what ION said when you're at a disadvantage which is, \"Play the man, not the board.\"",
        "19... Rad8": "Of course, Jack is not going to allow it.",
        "20. Nd5": "So, what comes to mind is the threat that TA called the N visualization count.  As I'm thinking, in the long term, of what to do with my N.  That's because, I might be able to come up with some nasty threats with it.",
        "20... Rdc8": "What I overlooked was this move since my pawn is attacked.  The problem is that I didn't think it mattered because of what this mentor said when I took one of two doubled pawns before.  The best example was in the tournament game against Tom Walsh to which I should've lost.  And, that was when he was yelling at me, as we know, and later calming down and saying I shouldn't target those pawns because it's two bad pawn when I have a piece under attack.  This is when we were saying good bye to each other a week prior.  I kept that in mind and didn't think, he'd take.  The difference is that in the last game, as noted, it involved an attacked piece that was only defended once and attacked twice.  But, in this position, it's not attacked.  However, there is no way to defend c4 even if I wanted to which is also a problem with doubled pawns, in general.  That's because with connected pawns, one often defends another.   Therefore, I know he'll take but hold off for as long as possible with my next move, as his Rook will be attacked..",
        "21. Nb6 Rc6": "But, he reattacks.  Doesn't bother me since the N is defended by the Bishop.",
        "22. Rad1": "So, I decide to centralize one of my Rooks, at once.  And, the reason that I used this Rook is that it will allow me to centralize the other Rooks because of where the center is located, as we know.",
        "22... Nc5": "But, now, the attack is a concern.  With the N there,  I need to defend.",
        "23. Nd5": "So, I get aggressive by trying to hold of his attack on my c pawn.  Therefore, I thought that the way to go was threatening an exchange.  As, I'm keeping in mind not to trust the opponent.  The good news here is that he did trust me with his next move.  That's because Jack thought that I'd exchange which I wasn't going to do.  Instead, I used what I call scare tactics to continue the idea of playing the man. ",
        "23... Bf8 24. Nb4": "And, that's when I reattack his Rook which, not surprisingly, Jack defends.",
        "24... Rcc8 25. Rd5": "So, I intend to put pressure on Jack.  Although it is defended, I was trying to take advantage of Jack by making him think that N is under attack.  Not a good strategy, for once he moves it, my c pawn is gone.  But, when he takes it, I am decide to play something similar to Hope Chess because of what Ken mentioned in our training, when there was nothing else to los.",
        "25... Ne4 26. Ra5": "The hope is that Jack will attack my Rook with ...b6, in which, I'd get a pawn back.  But, that plan is not going to work.  And, sure enough he will win another pawn.  So, it is a lost position.  All I can do is hope that Jack will go wrong.  That's because resignation is almost called for, but as it turns out, Jack will make mistakes which is going to allow me to win.  As noted in the intro Jack will do that for teaching purposes, as we'll see later on.",
        "26... Rxc4 27. Rb1": "Just as important is that my N was attacked.  And, this was the only way to defend it without losing material since I looked at 27.Bd2?? and even 27.Rb5??",
        "27... Nc3": "With that, Jack attacks again.",
        "28. Rb3": "So, I reattack.",
        "28... Nd1": "And, Jack is at it in a different form by threatening to liquidate my Be3 since I'm behind.  Not only is bad to accept for that reason, but the K side pawn structures would be destroyed which would put me at a further disadvantage.",
        "29. Bb6": "So, I refuse.",
        "29... Re4": "So, if Jack can't get anything else, he threatens mate.  ",
        "30. Nd3": "? I was tempted to try and defend with 30.f3??, but with his N on d1, I'd get mated in the same way.  Aside from that, this is the only other move that came into consideration.  As I didn't want to open up since it's not an endgame.  But, better was to open up with 30.g3, or 30.h3.  By playing this, my N is now semi cramped.  I should've kept it on b4, where it would have been better placed.",
        "30... Rc8": "This is why.  Had it stayed there, Jack would not have been able to win another pawn.  With what I played, he will get it.  This will, in return, leave me to an equivalent to a piece down.",
        "31. f3": "So, I try to hold off on that by attacking his Rook.  For when Jack defends, I will get my K into action.",
        "31... Re2 32. Kf1": "As now, Jack will continue attacks like this.  Of course, I keep his next move in mind, after which, I should be down by the equivalent without compensation.  ",
        "32... Rexc2": "Better was to take with the other Rook.  For after 32...Rcxc2, it would be about figuring out how to remove my Nd3 from that square.  As then, mate would become inevitable with a later ...Rf2#.",
        "33. Ke1 Rxg2": "After I attacked his Nd2, Jack played this.  Had he retreated, I would remain that far down.  But, by playing this, it goes back to me being down the equivalent piece for pawn.  Of course, that doesn't say much because white is still in bad shape and with a disadvantage.  In fact, it is still, as noted, winning for black.  ",
        "34. Kxd1 Rxh2 35. Rb2": "With my monarch confined to the first rank combined with Jack threatening mate, this was played bearing in mind that the Rook is protected by my Nd3.  The danger, of course, was 35...Rdc2.  From there, he was threatening ....Rcg2 which allows the back rank mate, so by playing this, I saw what was coming and put a stop to it.",
        "35... Rh1+": "Therefore, Jack responds by placing me in check.",
        "36. Ne1": "And, I decide to interpose with my Nd3.  I also looked at getting out with the K, but then, Jack would be able to check on the second rank and liquidate my Rb2 which I didn't want to allow since I'm still behind.",
        "36... h5": "Therefore, Jack tries a new strategy by pushing his passer since, \"passed pawns must be pushed.\"",
        "37. Ke2": "Since we're now approaching the endgame, I decide to use my K as a weapon.  It's not the best choice because of Jack's next move.",
        "37... Rh2+": "I considered and almost played 37...Kd3??.  But, Jack rightfully showed that this is a blunder because of what I call this half skewer against my Rb2.  Therefore, I was about to, believe it or not, resign in this position.  But, Jack said what he always emphasizes which I told to my student, Erika.  It wasn't only not giving up so quickly, but he also said, \"Now, start thinking\".  And, with it, I found the only way to defend the position.  However, it's more then just the only way, as it is the turning point in the game.  Before I made that comment, so up until this point he had the advantage which is why I got ready to resign.  But, because I told him that I was ready to give up since there is appears to be nothing else to learn, he is going to let me win from here on in.  And, the purpose to teach me otherwise, as the idea is that there is more to learn.  In addition, Jack has, on occasion, let his students beat them for teaching purposes.",
        "38. Bf2 Rc7": "Because of my last move, Jack intends to place pressure on my Ne1.",
        "39. Nd3": "So, I put a stop to that by remobilizing my Knight.",
        "39... Be7": "And, Jack redeploys his Bishop.",
        "40. Nb4": "So, I repost my N.  The reason is that it threatens to fork his Rc7 and Be7/",
        "40... Bh4": "Of course, Jack puts a stop to that by attacking my Bf2 twice since it is only defended once.",
        "41. Nd3": "So, I defend it a second time to match the equation of how many times it got attacked.  As that is how you protect material.  Of course, Jack is going to liquidate, but is better then letting him have another free piece.  As then, I would not have found the opportunity to win which I didn't realize that he did intentionally until the game was over.  As losing another piece would surely mean game over for white. ",
        "41... Bxf2 42. Nxf2 h4": "With that, Jack pushes his passed pawn again.",
        "43. Rd5": "So, I attack his d6 pawn.",
        "43... Rd7": "Which Jack defends again.",
        "44. Ke3": "And, I move my King up.  As the idea is supporting my f pawn, as it's dangerous.  However, what I also keep in mind is the possibility of supporting my Rd5.",
        "44... Kf8": "Of course, Jack tries to put a stop to that, as the idea is to centralize the K which is very useful in the endgame.",
        "45. Rb6": "Therefore, I attack d6 a second time.",
        "45... Ke7": "And, Jack defends that pawn again by centralizing his monarch.",
        "46. a4": "This is where the position had become corrupt.  As at first, this was recorded.  But, then, I got confused and changed the notation to 46.Ng4? being played first.  After careful review, I determine that this was played first.  As I know why I didn't move the N first.  Moving the N would lose the a pawn.  And, on top of the pawn, this one, believe it or not, is also going to help me to win the game, as we'll see later on.",
        "46... a5": "This was played right after since Jack, in response, moved the a pawn.  So, we're back on track.",
        "47. f4": "This is also where, at first, it got confusing.  After figuring out how this was pretty much played from the last move on, I had a difficult time remembering if I played f4, or Ng4 first.  The results would've been the same either.  But, it would have been a transposition as this would've been played on the next move, as opposed to the other way around.  But, how I figured it out, is that I went to the original notes, V. the changes that I made.  This, is what was originally notated.  So, I went by that because the original is more accurate.  That's because with one move, it was all of the other changes that corrupted the position.  That is when I realize that accept for one move, I figured it out, and thus, picked from where I left off in the 5 day period. ",
        "47... Rc7": "What I also knew, while figuring it out is that even if it had been the other move, this was definitely played right after 47.f4.  ",
        "48. Ng4": "Another factor is that had this been played first, Jack's next move would've protected the same way.  So, it would've been 47.Nf4, Rc2 48.f4, Rdc7.  But, as I mentioned earlier, I went by what was originally notated (before that little change) to determine exactly how it was played.  For, right after Jack's next move...",
        "48... Rhc2 49. fxe5": "I take right here because of the threat on his d6 pawn and then some which is bound to become a reality.  That's not to mention that with it, it is also where I start to compensate for lost material and start to build from there.",
        "49... Rc2c3+": "I knew that Jack one of his Rooks.  But, I also had a difficult time determining which Rook he used to deliver check.  But, after further studying which took an equivalent to an hour or two, I concluded that this is the Rook that he used.  And, you'll find out how I made that determination later on.",
        "50. Ke4": "This is one of the very few times, where what I originally notated was incorrect.  The original was that 50.Kf4 had been played, instead.  However, this is the move that I made as it gives my Rd5 additional support.  The idea being is that a pawn with K and R all working together in the endgame is very dangerous.",
        "50... Rc7c4+": "After the last check, it took me even longer to figure out which Rook Jack used to check again.  It took, at least, 2 hours.  But, I concluded the he used this Rook, as you'll find out soon.  And, that starts with the fact that this will be his last check for a few moves.  After starting to sort things out and in the process, this is was the hardest move to figure out from, what was, a corrupt position.  Since I was able to do it, that's when I realized that this is, most certainly, how the game was played.",
        "51. Kf5": "With that, this move was forced.",
        "51... h3": "With that Jack continues to push his passed pawn.",
        "52. exd6+": "How I determined that 50...R7c4+ was played, as opposed to, 50...R3c4+ is one fact.  The reason being is because, as noted, Jack didn't check before this move.  With that, his Kce7 and one of his Rooks would be forked.  And, I would've taken advantage of that fork because after 52...Kd7, I would've played 53.dxc7, as opposed to, what unfolds.  The best part now is that not only have I leveled out the game, but I went from losing to now winning. ",
        "52... Kd7 53. Rxb7+": "What unfolds is this move.  The reason behind it is because it wins another pawn.  Of course, I keep his next move in mind.  But, unlike before, the upcoming fork is of no concern to me thanks to my d6 pawn.  As it will have access to the promotion.  What that all boils down is the importance of mobility as emphasized by Ken in our second training game, as well as, what he mentioned in an annotation shortly after.",
        "53... Kc6 54. d7": "With that, I keep pushing my pawn.",
        "54... Rf3+": "In response, Jack holds off by checks this way.  And, this is where I determined that 49...R2c3+ was played, instead of 49...R7c3+  Had he checked on the seventh, it would not have been possible to check without losing material.  That's because instead of on f3 which is where it was, it would've on f2 which loses the N right away.  So, given that circumstance combined with the check that I delivered on d6 by capturing which was difficult, that's where I determined what unfolded.",
        "55. Kg5": "As I get out again.",
        "55... f6+": "Not surprisingly, Jack checks again.",
        "56. Kh5": "Since the f file is blocked by the Rook, I had to move my K to the h file.",
        "56... h2": "In which, Jack pushes and prepares to promote.",
        "57. d8=Q": "And, I promote at once.  I didn't even look at 57.Nxh2??, but it's a good thing that I didn't play this because he would've won back material, after 57...Nxh2.",
        "57... h1=Q+": "In response to my promotion, Jack tries to take advantage with his promotion, as well as, the check.",
        "58. Kg6": "But, it's too little too late.",
        "58... Kxb7": "Without many other options, besides pinning and winning my Ng4 he takes my Rook instead.",
        "59. Rd7+": "But, I've got a mating attack starting with this move.",
        "59... Kc6": "And, after this move, I mate him, at once.  However, if Jack had played 59...Ka6, I would've mated, starting with 60.Qa8+  The next few moves are forced which would lead to mate.  An, example would be 60...Kb6.  So after 61.Qa7 Kc6, I'd mate with 62.Qc7#  And, if Jack interposes with 59...Rc7, my next move would be 60.Qxc7+.  That gives Jack only two options of either 60...Ka6 or 60...Ka8, but the next move would be the same.  And, that is 61.Qb7# which is also mate.  Therefore, black would get mated in all variations.",
        "60. Qc7#": "After this game, Jack told me what happened.  First, instead of 54...Rf3+, we looked at what would happen if he forked before I promoted, so 54...Kc6  Black, however, would still be busted because of my a4 pawn since there is no way out of mate as he said.  For example, 55.d7 Kxd5 56.d8=Q+ Kc6 57.Qd7+ Kc5 58.Rb5#   But, as I thought that he made lucky blunders that allowed me to pull a swindle and win.  However, Jack said that the blunders that he made were not luck.  Instead, he allowed me to win because of my readiness to resign.  What he's emphasizing is something similar to what I see in TA's blitz Q sacs which is another reason I like studying them.  That is, don't resign so quickly, even if, you are at a disadvantage.  For, you don't know when you're opponent will go wrong.  I partially agree with him, especially with players at or below my rating.  But, I have doubts with players a lot stronger because ION, Ken, and reversion have all said that one should resign after getting a piece or higher, or when you feel that there is nothing left to learn.  That's what I thought against Jack, but he showed me otherwise which is why he has let his opponents win before.  However, another way of looking at it is not to trust your opponent.  So, one must decide whether to agree or not.  Normally, I would not and think of it as luck.  But, I don't here because after 47.f4, black did not capture with 47...exf4+  Had he done that, after 48.Kxf4, black is still winning and for the same reason being that my dangerous pawn is gone.  And, that would, in return, take away the opportunity to get back in the game.  And, after 49.fxe5, combined with the checks, he did not take back with ...dxe5.  Yes, I'd still get a pawn back but would, in return, lose the passed pawn which was used to promote and win the game.  So, him not taking back and allowing me to promote is what made me realize that there was no luck here.  And, that's because, in general, Mr. Stockel does not miss moves like that.  Therefore, the moral of this story is to not resign just because you feel that there is nothing left to learn.  Instead, keep playing, and only resign when the position hopeless against a stronger player.  So, as a new guideline I'll thinking of some of them similar to the Supplemental Talking the Talk (original WTW rules).  And, those rules state that one is not allowed to resign until a mate is proven.  That is, until the runner has a forced mating sequence. "
    },
    "url": "https://gameknot.com/annotation.pl/otb-mentoring-game-it-can-be-done?gm=62626",
    "gameName": "OTB Mentoring Game-\"It Can be Done\"",
    "players": "Joe (1296) vs. Jack ",
    "opening": "Sicilian (B54)"
}