{
    "moves": {
        "1. e4": "So, I open conventionally.",
        "1... c5": "Sometimes, he'll respond with the King's Pawn Game, but he usually plays the Sicilian against me.   ",
        "2. Nf3": "Of course, I am going into the Opening Variation.",
        "2... d6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 a6 6. Bc4": "?! After that, I decide to bring out my LSB.  Luckily for me, I don't have to fianchetto it.  6.Bd3 was also possible, but my goal is to keep his f7 pawn pinned, in this position.  However, this move is dubious and inaccurate because he will simply kick it with 6...d5.  ",
        "6... b5 7. Bb3": "Losing tempo does not stop me from keeping his pawn pinned.  Now, it would have been a different story, had he played 6...d5?  However, that would have been a mistake because of 7.exd5, losing a pawn.  Why?  Because if then 7...Nxd5??, 8.Nxd5 loses a piece.  Afterall, he would not be able to recapture with 8...Qxd5?? due to my LSB.",
        "7... Bb7": "In the meantime, he decides to fianchetto his LSB.  Now, people have told me in the club that you want to establish the longest diagonal with your bishop, but that person was not Jack.  In addition, as I have repeated in a couple of annotations, you don't want to fianchetto your bishop, unless it is the only way to develop.  Therefore, I believe that 7...Bd7! was best.  Consequently, I feel that he has a weakness, due to that inaccuracy.  However, that is not the case.  As we will see shortly, there is a lot that he can do, in this position.",
        "8. O-O": "? At this point, I decide to castle.  Afterall, I was planning to do this, ASAP because part of development and center control is that.  However, this is my first mistake.  Why?  It gives away a pawn.  Therefore, best was 8.f3 as 8.Qf3 also loses a pawn.  How will he take the pawn?  With 8...Nxe4, and this is a move that I had overlooked.  ",
        "8... Nxe4 9. Nxe4 Bxe4 10. Be3": "Despite the mistake, I am still determined to continue with development.  However, Jack told me that this was not the best move, but he also said that we have to see what plays out as this is very interesting.",
        "10... e5": "And, he decides to kick my Knight.  So, how can I protect it, and what are my options?  In this position, 11.Ne2 is my only move as anything else loses my Knight.  Note: 11.Nb3 WOULD HAVE BEEN the only other safe spot but is completely out of the question due to my LSB on that square.",
        "11. Ne2 Qf6": "In this position, he is determined to develop Queenside.  But, I do not know why he would bring his Queen out before the other pieces.  Afterall, he is not the Master Mater, or one that would typically go out of principle, like this. ",
        "12. Ng3": "! Therefore, I decide to take advantage by kicking his bishop, and he said, \"this is a very good move.\"  That is why I marked it with an exclamation point.",
        "12... Bb7": "So, he retreats it back to the starting square of his Fianchetto.  ",
        "13. Nh5": "?! But, I figured that this move gives me an advantage, as I am now attacking his Queen.  What is my goal, and what am I trying to accomplish?  In this position, I am trying to gain tempo in order to punish him for going out of principle.  Where did I get that idea from?  When cdeburca said, \"A good example of how to punish poor opening play.\"  Of course, however, his opening was not weak.  In addition, 11...Qf6 was not a mistake, but rather, an inaccuracy.  On the other hand, this move is also inaccurate and a waste of time.  With my choice, I lose and he gains what I was essentially trying to take away from him.",
        "13... Qg6 14. Ng3": "Therefore, I should have just left my N on this square. ",
        "14... Nd7": "After I pull back, he completes development on the left wing (Queenside).",
        "15. Qd2": "But, that is not going to stop me from completing development, controlling the center, and connecting my rooks.  ",
        "15... Nf6": "I understand that Mr. Stockel has a plan, as we will see shortly, but I view this as an inaccuracy as he moved one of his Knights more then once before completing development.  Of course, maybe he intentionally did this to test me because testing people is one of his styles of teaching. ",
        "16. c4": "In the meantime, I decide to attack his b pawn in an attempt to force an exchange.",
        "16... Ne4": "And, this is his plan.  In addition, we can infer that this is also a test, as I mentioned on move 15.  Afterall, he decides to fork my N and Q, or did he?  Well, as cdeburca told me in my previous annotation against this same opponent, it's not a good idea to describe this as, \"a forking move\".  In this position, I have a couple of options like moving my Q to d3 which was, btw, my first instinct.  However, if 17.Qd3??, 17...Nxg3, 18.fxg3, Qxg3, losing another pawn and opening up my K.  So, more then likely, that move would eventually lose the game as the K would be very vulnerable to exposure.  However, I thought of another alternative.  What is that?  17.Nxe4 which is the best move.  And, that is met by 17...Qxe4, so this is not an effective fork.  In addition, the alternative would pass his test with flying color!  ",
        "17. Nxe4 Qxe4 18. f3": "Now, things are very interesting.  In this position, he is actually threatening mate in one, 18...Qxg2#.  Here's the thing, however, like my first loss against the Master Mater, I almost missed this threat and for the exact same reason.  That's right, I was actually thinking of and was just about to play 18.Bc2??, attacking his WQ.  But, if I played that, mate would be inevitable.  So, I looked at this move, which also kicks his Q, but I did not base my decision on that.  My only goal is to prevent the mating move. ",
        "18... Qg6": "So, black retreats his Q back to where he attacked my N.",
        "19. Bc2": "But, I now have the opportunity to attack his Q with the same piece and in the exact same way, without it resulting in mate.  So, I basically achieve my goal without any drawbacks.",
        "19... Qe6": "! He also could have played 19...Qf6, but I just reattack with 20.Bg5.  So, this is best.   ",
        "20. cxb5": "Now, that he is safe, I decide to force an exchange which was another goal that I am going to achieve.",
        "20... axb5 21. Bb3": "At this point, I decide to take advantage by launching another attack against his Q.",
        "21... Qd7": "He also could have responded with 21...d5, but there is nothing wrong with this move.",
        "22. Rad1": "!? My goal is to put pressure on the d file, in this position.  Until recently, I had no idea, but it turns out that better was 22.Rfd1.  Why?  Last week, I learned that it is not a good idea to put both rooks on the same color as it could lead to a fork.  I did not know that, until the game was over, so how and when did I learn this infromation?  Believe it or not, there are two other members in the club, besides Jack Stockel and me.  One of those people have the same rating as my chess coach, and he showed an interesting game.  It was then that Jack told me not to place two rooks on the white squares if you're white and on the first rank; or both rooks on the black squares if you're black and on the eighth rank.",
        "22... Be7": "In this position, black is completing development, and this is the only way for Jack to develop his DSB immediately.",
        "23. Bd5": "In the meantime, I am determined to force an exchange because after we swap bishops, his Rook gets attacked.  Why did I want to attack his Rook?  Because he is attacking my a pawn.  So, my goal is to put him under pressure, before I permanently protect it with a3.",
        "23... Bxd5 24. Qxd5 O-O": "?! Although my intention wasn't a waste of time, it was pointless because he protects by castling Kingside.  BTW, in this position, this move is better then ...0-0-0 as castling Queenside initially leaves the King too open.  Now that the pressure is off, I either have to protect it with my R, or advance my a pawn.  However, I prefer 25.a3.  That ensures that I did not move the R away from a1, for nothing.  In other words, it ascertains that 22.Rad1 was not a waste of time.",
        "25. a3 Rac8": "I do not know why black played this, but we can infer that he is hoping for an exchange, in this position. ",
        "26. Rdc1": "But, that's what he's going to get.  Before I made this move, I spoke to him about exchanging Rooks.  I told him that I did not like it because I am still behind a pawn.  He said, \"Sure, you can play that.\"  I feel that this move also benefits my position, as it alleviates some pressure.  Note: His Left Wing Rook (or Rook closer to the Q was and is the only thing that's causing me stress.)  In that, some moves that benefit your opponent's position might also benefit your own position.  It's a similar idea to, and in this case will become, an even exchange.",
        "26... Rxc1 27. Rxc1 Rb8": "I know what he really wants.  In this position, he is trying to put pressure on the b file.  Here's the thing, he is eventually hoping to exchange pawns with axb4, ...Rxb4, which would leave my b2 pawn attacked.  This time, however, that does not bother me as I will have none of it.",
        "28. Bc5": "So, I decide to play this, a big moment and break for me.  Normally, you would ask yourself this question.  Why did Joe give away a free piece?  As it turns out, however, that is not the case as my B is protected by the Q.  Consequently, if 28...dxc5??, 29.Qxd7.  Of course, he is not going to make that blunder, and I kept that in mind just before making the decision.  As a result, my choice prevents him from playing 28...b4, which is why I played this.  Therefore, I no longer have to worry about the b file.",
        "28... g6": "Ok, I do not know what he was thinking with.  It opens up his King and since it's not an endgame, the K should not be opened.  Therefore, I spoke to Jack about this move, and he told me that there is nothing wrong with it. ",
        "29. Rd1": "This is an ok move, but I had originally played 29.Rb1, before we looked at the situation.  However, Mr. Stockel showed me why 29.Rb1?? loses immediately. 29...Qf5, which eventually leads to a powerful fork and significant loss of material, especially if then 30.Ra1.  He then told me that there was only one other move that was better then this.  However, I did not know why it was better then what I just played.  In addition, I had two instincts, this move or 29.Rb1??.  On the other hand, this was my first instinct.  Note: It's not always about finding the best move, as someone once told me in a different annotation, but rather, making a good choice that works for you.",
        "29... Rd8": "He told me that since the d file is under pressure he had to make this move.  Therefore, my B is now attacked as 30...dxc5 is now feasible, if I'm not careful.",
        "30. Bb4": "So, I have a couple of options to protect my piece, and I spoke to my opponent about the options.  He told me that this is best.  With any other move, the pressure is completely off which leaves many open lines available for black.  In other words, he would have a significant edge if, I were to move my B anywherelse because his Q would start attacking, immediately. ",
        "30... Kg7": "Now, he decides to move his K.",
        "31. Kf2": "So, I talk to him about this move.  Since his K moved before an endgame, I asked him if it was safe to use my K as a weapon.  And, he said, \"There's nothing wrong with this move.\"",
        "31... h5": "Meanwhile, he starts advancing his pawns.  In my opinion, it's not because he's interested in promoting.  Instead, he just wants to leave more options available for his WK.  Note: ...Kh6 is a feasibility because of this move.",
        "32. Ke3": "But, I will continue to keep my K working, as it can and will leave other options for attack.",
        "32... Kf6": "And, so will he.  His main goal is to eventually achieve the, \"Opposition\", in this position.  I know because I have played many games against him, and he often achieves that.  In fact, he's the one who taught me about the kings being opposite of each other.",
        "33. f4": "In the meantime, I am going to force an exchange.  Why?  Once his e pawn is off the board, I am going to accomplish what he wants anyway, the, \"Opposition\".",
        "33... exf4+ 34. Kxf4": "! and nearly a !! move.  Why?  Jack told me something very interesting.  In this position, I am actually threatening mate in one 35.Bc3#, but that was not even my goal.  In fact, I would have missed this opportunity, which is why I did not mark this with two exclamation points.  My only goal is to get tougher, catch up, and stay in the game because I got overly paranoid about being in a losing position since I am still down a pawn. ",
        "34... Qf5+": "In this position, my opponent said, \"This is my only option\".  After I saw what Jack pointed out, I looked at the board, and he is absolutely correct.  Any other move could have resulted in mate, which is something that he was not going to allow. ",
        "35. Qxf5+": "Therefore, I decide to exchange.  More often then not, unless you are far behind, exchanging Queens will often benefit your position.  How do I know?  I learned it from a different mentor, in November of 2012.",
        "35... gxf5 36. Rd5": "After the exchange, I move my R to the fifth rank with the intention to get a pawn back, as noted on move 34.  This time, I will achieve my goal, as we will see shortly.  ",
        "36... Kg6": "In this position, black's only goal is to prevent a check (so from 37.Rxf5 to 37.Rxf5+).  However, that does not matter because I never intended to place him in check.  Instead, I will simply take back a pawn on f5.",
        "37. Rxf5 Rc8": "He also could have played 38...Rb8 to protect b5, but that does not make a difference.  After I play 38.Rxb5, he will get something back, as we will see. ",
        "38. Rxb5 Rc2": "And, he will do so with this fork.  ",
        "39. b3": "?? I had the option of protecting the b pawn or g pawn, but I thought that it was completely irrelevant.  Why?  Either way, one of those pawns was going off the board.  On the contrary, it absolutely matters, as this is the losing blunder according to my opponent.  Like always, I generally have no idea why one particular move loses, until the game is over.  As it turns out, there is something about this move that takes away the coordination between my B, R, and pawns on the a and b files.  Coordination of material is absolutely essential and critical in a chess game.  With that in mind, best was 39.g2, and the game might have ended in a draw, according to my coach. ",
        "39... Rxg2 40. h3": "After he took, my h pawn was hanging, so I have to protect it.  As it turns out, this is the only way to do that.",
        "40... Rb2": "After that, he decides to attack my b2 pawn.",
        "41. Bc3": "But, I will not back down. ",
        "41... Rf2+": "So, he responds by placing me in check, but I don't know why.  In my opinion, better was the immediate 41...Rc2.",
        "42. Kg3": "In response, I decide to attack with my K.  Note: The K is a powerful weapon in the endgame.  Now, this is what the weapon can occasionally be used for.  I actually won a game against an opponent by attacking with the K, during an endgame.  Here's the thing, that game happened a while ago, and I was in a losing position.  That one move, however, turned a loss into a win.",
        "42... Rc2": "Now, black does what he could have done on move 41.",
        "43. Bd4": "After the retreat, I offer Jack Stockel a draw since it's an endgame and everything is even material wise (no one's ahead or behind), but he declines.  Jack said, \"A draw?  You're too weak to hold a draw.\"  By this, he was not referring to my rating, but rather, the position. ",
        "43... f5": "In this position, I am pretty confident that black is determined to get a passed pawn, either on f5 or h5.",
        "44. h4": "But, I am just as determined to prevent that.",
        "44... Rd2": "So, he takes advantage by attacking my DSB.",
        "45. Be3": "And, I respond by attacking his Rook.",
        "45... Rd3": "As a result, he reattacks my WB.",
        "46. Kf4": "? Now, this is very interesting.  In this position, I am planning a way to use my K as a weapon, again.  However, that's a mistake as it loses a pawn which I am not going to get back, this time.",
        "46... Bxh4 47. a4": "Consequently, I am planning to promote a pawn.  Sometimes, you can turn a loss into a win by promoting a pawn, but I am not going to be successful, as we will see shortly.  Believe it or not, I lost a game in a winning position when the opponent promoted and vica versa.",
        "47... Bg5+": "Instead, he places me in a very serious check.  Why?  In this position, mate is almost inevitable, so my only options are 48.Kf3, or 48.Kg3.  Either way, I lose a piece when I'm already behind in material, and there is no way for white to catchup, at this point.  Therefore, I resign.  "
    },
    "url": "https://gameknot.com/annotation.pl/otb-wtw-coaching-game-coordination?gm=49235",
    "gameName": "OTB WTW Coaching Game-Coordination",
    "players": "Joe (1157 Elo) vs. Jack Stockel (1800 USCF)",
    "opening": "Sicilian (B90), Najdorf, Lipnitzky attack"
}