{
    "moves": {
        "1. e4 e5": "Not knowing him, I was wondering how Loyd would response.  Usually, he answers with the French Defense, as that's what happened in our last two games which was right after this.  But, in our first game, he played this.  Therefore, I'll stick to what I know the best, The Ruy Lopez.",
        "2. Nf3 Nc6 3. Bb5 Nf6": "As anticipated, he answers with the Berlin Defense.",
        "4. O-O": "So, I castle.",
        "4... a6": "Staying in book.",
        "5. Ba4 Be7": "I anticipated 5...b5 and was, thus, prepared to answer with 6.Bb3.  But, by playing this, I use that time to continue with my development.",
        "6. Nc3 O-O": "Like me, he castles.",
        "7. d4": "So, I attempt the exchange variation.",
        "7... d6": "Which Loyd declines, as otherwise, he would've played 7...exd4",
        "8. d5": "I had a difficult time deciding how to answer.  I almost played 8.dxe5 with the idea of getting into a line similar to the exchange variation.  Then, I gave it more thought and took into account what GM Susan Polgar said about the French Defense which I saw from tactical-abyss.  However, this happened before cplusplus11 told me not to do single move attacks for the thrills of it.  While most chess terms stay the same, this is why I eliminated the tempo gain as that has also caused me to miss the entire story that the board was telling me.  Therefore, what Susan said in the French is that d5 is often played to attack black's Nc6, and when it retreats, white is also left with a solid pawn chain.  That's the idea of attacking the Knight.  Now that I've eliminated that, the next I go through a similar line that's not the French, I'll take on e5, instead.",
        "8... Nd4": "This is where the N often retreats.  And, as you might guess an exchange often happens because, as usual, white will win a pawn.",
        "9. Nxd4 exd4 10. Qxd4 c5": "Trying to stop my d5 from advancing, but this is a mistake due to what I overlooked.  This happened for an unusual reason which I find frustrating because this has caused me to blunder in two other games.  But, I missed the overall picture in one of them which directly led to a loss.",
        "11. Qd2": "? Although not quite as bad since my GK games were postponed, I was still spending too much focusing on going away.  As noted, I was thinking on how to get enough sleep for Sunday so that I could study the Susan Polgar book and stay awake.  Now, this game happened 2 days prior to me going away.  However, as we see here, the distraction wasn't quite as bad, as otherwise, I would've lost my Queen since the focus would've been on developing my DSB.  This means, that I would've likely played 11.Bg5?? had the distraction been what it was in the other two games.  But, best was the immediate 11.dxc6 e.p., winning a pawn.  He can answer with 11...bxc6, but then I would've answered with 12.Bxc6  This time, overlooking that is directly due to that distraction and be it note that things were getting rough, already.  That's because I still had a little packing to do.  And, when I was done, I had to get ready for work the next night.  And, after coming home at close to 10:30 pm, there was still a small amount more packing.  Had to go to bed, and then wake up at 6:15 am on Sunday, Feb. 14, to catch my flight.",
        "11... b5": "And, Loyd takes advantage of my mistake by attacking my Ba4.  However, this could've been done earlier, but my response will still be the same.  Here's another thing, after the mistake, which I felt should've cost me the win, I woke up and smell the coffee realizing what I had done.  So, I stopped thinking about the vacation and went right back to the game.  It was basically practice, as otherwise, I would've been distracted at work, which is even worse.",
        "12. Bb3 Bd7": "Completing his development.",
        "13. a3": "So, I go for it by getting a semi open file for my Ra1.  However, this was also played in anticipation of what Loyd winds up playing next.  I asked myself what would happen if he played this and could I defend my Bb3.  After remembering Jack's advice to, \"Start Thinking\" which I've emphasized to my students, I determined that this was only the way to prevent the loss of a piece.",
        "13... c4 14. Ba2 Qb6": "Mobilizing his Queen.  But, I have an answer to that.  ",
        "15. Qe2": "That's because I felt he had a threat, after 15...Ng5  Therefore, if Loyd plays that, I'll answer with 16.Qf3.",
        "15... Rac8": "Putting pressure against my Nc3.",
        "16. Be3": "So, I respond by completing my development, whilst, attacking his Queen.  And, that's where I analyzed where the GM's do it, without overgeneralizing as now, as now, I'm not concerned about anything he might be capable of doing.  That's because from here on in, I come up with plans to stop it, ahead of time.",
        "16... Qb7 17. b4": "By block his b pawn.  Normally, I don't care about this because it's not a passed pawn.  But, the problem is his Bd7.  I thought that if he could push b5-b4, once I took, Loyd would answer with ...Ba4 which I was determined to prevent.  However, I forgot that my Nc3 stops that, anyhow.  So, overlooking that was also due to that small distraction I had.  It's not that small, in reality, but I was comparing it to how bad it was in other two games, as this was way less.  The good news, however, is that, it was my last game, until a few days, after coming back from Florida, which was on, I believe it was the 23rd of February.",
        "17... Ng4": "Trying to exchange my Be3 for his N.  So, I asked myself why and figured out that my Bishop is stronger.",
        "18. Bd4": "Therefore, I don't allow it.",
        "18... Bf6": "Yet, Loyd is still determined to exchange.  But, with his DSB stronger, I accept, this time around.",
        "19. Bxf6 Nxf6 20. Qd2": "Figuring that Loyd would play 20...Bg4, I stop it.  However, I forgot that f3 is a possibility.  But, unless it's absolutely needed, I don't want to open up my monarch.  ",
        "20... Qb6": "Trying to figure the story that the board is telling me, as per bhidragon's advice.  And, I saw a similar pattern to what happened in our most recent game because his Bd7, Nf6, and Queen could all be nasty threats.  I asked myself what he was going for, in this position.  I think his first instinct is 21...Ng4 which could be nasty especially if his Bishop and Queen work with it.",
        "21. Rfe1": "So, I centralize a Rook.  The idea being is that, if he plays 21...Ng4, I'll answer with 25.Re3, followed by 26.Rg3 to stop any threat that he might have.",
        "21... Rce8": "However, Loyd centralizes his Rook.",
        "22. Re3": "So, I prepare to double up.",
        "22... Re5": "I think he might have a threat here but wasn't sure.  So, I double up, at once.  ",
        "23. Rae1 Rg5": "As now, he's threatening 24...Ng4",
        "24. Re3e2": "Which, this time, I spot, whilst keeping both Rooks on one file.  And, I kept in mind this discovered attack, determined to fix the mistake earlier being the en-pessant capture.",
        "24... Rg6 25. e5": "As now, I use that time to fork his d6 and Nf6.  I also kept in mind that it's not very effective, but that's almost irrelevant because everything is planned, for once he retreats to  g4, I'll exchange pawns.",
        "25... Ng4 26. exd6 Qxd6 27. g3": "But, what I did not count was the mate threat.  Therefore, I had to open up.  But, this game happened before the recent life changing game with Jack, where I realized that a pompous attitude was no way to become a better a chess player.  In other words, it's also how I figured out that improvement meant that I needed to change my thought process, afterall.  I wish it happened after that game because archduke_piccolo told me that f4 is preferred because this is right near the King.  Therefore, it's the pawn that should not be advanced after castling, unless you must do so.  Had this game happened, afterwards, I would've answered with 27.f4.",
        "27... Qf6": "So, Loyd tries to find another way as the threat is now 28...Qf5, followed by, 29...Qh5, as the entire story reveals that from there, 30...Qxh2+ is possible which is a mate in two.  31.Kf1 (forced), Qh1#.",
        "28. Ne4": "I generally don't use that term, due to kenneth_fiore_3's advice.  But, in this context, knowing the threat, I play Hope Chess.  I wasn't sure what to do or how to counter the threat which caused a, \"Fight or Flight\" syndrome, which chess is not supposed to be.  Therefore, the idea was to counter this threat by attacking his Queen.  That's because, instead of attempting calculations on how to prevent the threat, I'm just hoping that he won't play 28...Qf5  But, the plan does not work.  Keep in mind that, although not distracted from vacation anymore, I was also trying to prevent history from repeating due to what happened before.  However, I missed it, but best was 28.h3 to prevent the threat.  As now, 28...Qf5?? no longer works.  Therefore, it's safe to say that I was still not completely with it, and therefore, somewhat, distracted.",
        "28... Qf5 29. Nc5": "As, otherwise, I would've played 29.h3.",
        "29... Bc8": "But, I'm lucky here.  A more experienced player would've answered with 29...Qh5.  However, the answer is still there, but the difference being now is that black would've had ...Qxh3, followed by ...Rh6, and then, ...Qh1# which is mate.  That was something that should've been considered.  I hope that I'm not in this situation again.  Normally, going away and planning for the next day doesn't get to me.  The difference, in this case, was having to work late, the night before.  And, if there were choices on when the chess club takes place, I would've done it earlier. However, it's only held on Friday's.",
        "30. Re2e8": "Not seeing my weakness, I go right for his with the idea of keeping his Rf8 locked.  I kept in mind that, in general, you don't want to tie down your pieces.  By failing to mobilize his Rook, this is what happened.",
        "30... Ne5": "?? But, Loyd intercedes with his Knight, and this is the only time where I had to coach him.  So, I said that's a blunder because of...",
        "31. Re1xe5": "this move.  Now, he thought about what else to do.  But, not seeing anything else and being a piece down, Loyd resigned.  After this game, however, Jack went back in time.  Seeing that he could've done something different, Mr. Stockel made us continue the game, as Homework.  But, this time, it was like the game I continued with easy19 against Jack, himself.  In that game, after losing to Mr. Stockel, which Fred deemed as early due to not following the Supplemental Talking the Talk Rules which is not resigning until mate can be forced, he continued.  But, in this case, I played with Jack's pieces, and he played as mine.  So, we reversed colors, and I made a mistake that could've turned that win into a loss.  A similar story is true here, but he took over.  Therefore, I kept the same color, but Mr. Stockel played as black, and made Loyd watch it.  Now, he explained that best was to open up with 30...h6, so that his Rook Rf8 isn't tied up.  From there, I played 30.Rxf8, and as anticipated, he answered with 30...Kxe8.  But, later on, I made a mistake that could've lost since Jack got got two passed pawns and used them to advance.  With this Homework, he was teaching us that it was a close game, so white also had to be careful.  What was also being stressed is that the position would hold, if black could exchange Rooks as 30...h6 was the only way to do so.  So, one mistake, from either side could lose very quickly.  Afterwards, Loyd told me that he considered playing h6 for the same reasons that he mentioned and that the idea was playing the way Jack showed.  Afterwhich, I agree that he might have won, seeing the mistake I made against Jack.  With that being said, the moral of this story is what the mentor told Loyd.  In it, Jack said, \"Once the Rooks are doubled up, try to break them up.\""
    },
    "url": "https://gameknot.com/annotation.pl/otb-chess-game?gm=60964",
    "gameName": "OTB Chess Game",
    "players": "Joe (1355) vs. Loyd ",
    "opening": "Ruy Lopez (C65), Berlin defence, 4.O-O"
}