{
    "moves": {
        "1. d4": "Normally, I would play 1.e4, and then it would be the Ruy Lopez, as I know Bert.  However, I decided to try something different based on what GM Susan Polgar told me in an e-mail which I will mention.",
        "1... d5 2. Nf3": "Normally, I'd play the QG with 2.c4 but for the same reason that I noted in the beginning, I play this.",
        "2... e6 3. e3": "That's because this is now the Colle's System, named after GM Colle-Zukertort, who is believed to be the first world champion, dating back to 1886.  And, as noted, my favorite GM recommended that I give this is a try, so I was going to follow her advice for the OTB chess games where it's not rated, yet, you learn.  And, before that, I have never played this version.  One time only, I played 1.d4 followed by 2.Nf3, when 1...d5 wasn't played, but I have not played e3 so early, until, yesterday.  Having said that, I was planning on this since that e-mail, so we're talking about 3 weeks, (since July 20th.)  It's also worth noting that I don't memorize as per advise, but when Susan explains or has explained this (for that matter as I've completed the lectures by her) they become second nature very quickly which doesn't happen with most players, not even Jack.  So, in that, she said, \"Today, I'd like to introduce an interesting system for the white pieces that could save you a lot of time.  The reason it would save you a lot of time is because it's a setup that you play against most of black's possible responses and it's also a setup that guarantees you a healthy solid position for in all of your games.  I am talking about the Colle Opening, and to be more specific, the Colle-Zukertort system.  Johannes Zukertort was one of the early practitioners of this system.  Zukertort played in what many consider the first World Chess Championship match versus Steinitz back in 1886.  It is safe to say that this system has stood the test of time!  You open the game for white with 1.d4 moving the Queen's pawn and you follow up with active minor piece development, Nf3 getting the knight out and then e3 which opens the bishop which moves to a solid central square Bd3.  I think you should give it a try with the Colle-Zukertot opening system as it has been employed successfully at all levels (including the Grandmaster level!)\"",
        "3... Nf6": "Standard development.",
        "4. Bb5+": "Since I'm not used to it, I wasn't sure what to do, so I figured that I'd deliver check with gain of tempo.  However, more common was 4.b3, and then 5.Bb2  The thing is, as noted, I don't memorize things, but in the course she said that those two moves, if added, completes the variations of the Colle-Zukertot system.",
        "4... c6": "Not suprised to see this.",
        "5. Bd3": "I had a hard time deciding between this and 5.Bb3  But, after careful consideration, I moved here.  After 5.Bb3, though no worries yet, I felt he'd eventually hit my B on the third rank, and would, thus, lose a piece for a pawn as it would become possible to lock it in.  Thinking about the sequence, I wasn't going to take that chance.",
        "5... Bd6": "Standard and the B is right in the center which is a very good place.",
        "6. O-O": "This time, however, it's good to castle right away as K safety is vital, especially with what Bert might have in mind.",
        "6... Qc7": "Normally, I don't know why you'd bring the Q out before completing development since nothings en-prise and it's not the like Domino Defense.  But, after what dynamic_dv did which was very similar and with comments, I realize that this is a similar position which makes it a good move.  The idea isn't comparing games, but rather, comparing positions, as per what I learned from kenneth_fiore.",
        "7. c4": "But, this time, I don't deviate from guidelines as the idea is that with Q pawn openings, you shouldn't develop the N on b1, until the c pawn has moved.  With that being said, the plan is, of course, Nc3, when it's safe to do so.  Having said that, after we exchange, as it's safe to do, that's when I'll play that.",
        "7... dxc4 8. Bxc4 b5": "With that being said, I was planning to play 9.Nc3, but thinking about the forcing moves, which in this case means the obvious reason, that is not possible, as of the moment.",
        "9. Bd3 Ng4": "This time, I thought I could, as I wasn't worried about the N.  But, then, I did homework, asking myself why that N moved, since first, why is the most important and common question ask.  Second, for that reason, it's theory which is very important.  This is where I realize that Bert is threatening through a combo.  And, it's a very similar position to a quiz that Susan gave me with the same lecture which, for a change not only did I get correct but for the right reason.  Therefore, he threatens 10...Bxh2 and if 11.Nxh2?? he mates with 11...Qxh2#  So, the only other option would be 11.Kh1 which not only loses a pawn, but the K is exposed.  As a result, he'd have a noticeable, and I believe, a winning advantage from that point, which I cannot allow.",
        "10. g3": "Normally, I would've played 10.h3, but for the same reason, it won't help.  Sure, I don't lose a pawn, but wind up in trouble, after 10...Bh2+ for what I noted which isn't so obvious,  and thus, worth explaining.  With that being said, this is the only way out.",
        "10... Nd7": "Continuing to develop and preparing to develop.",
        "11. Nc3": "At last, it's finally safe and the time to play Nc3.",
        "11... Bb7": "Completing development and allowing to choose which side to castle on.",
        "12. Ne4": "Putting pressure in an attempt to exchange here since I feel that the DSB is dangerous which actually is.",
        "12... c5": "But, with this move, I felt that it was unsafe to do so since it appears that black is trying to win a pawn.  This time, however, I forgot about my e3 pawn which protects d4, and if this weren't OTB chess, I wouldn't have forgotten things like this since I use analyze the board.",
        "13. Bxb5": "?? Worried about my pawn, however, I thought I had two options on how to take.  The other way, of, course, was 13.dxc5  The reason I captured here was to, at the same time, keep his N pinned.  However, this is was a blunder caused by an oversight.  I overlooked the discovered attack, so the N had to be defended, instead.  By playing this, forget about a pawn because I lose a piece for the pawn, which wasn't worth it.  Best was the immeidate 13.Nxd6, and it's still even.  ",
        "13... Bxe4 14. Ng5": "Now, I start thinking about what I can do to compensate.  I knew I wouldn't win anything but kept in mind that, as GM Demion says, you should create threats.  With that I followed his advice and played this since now that I've blundered a piece, I will do some hope chess in an attempt to compensate which will, eventually happen, coincidentally as it's for an unusual reason, though.  Bearing in mind that if he's not careful, I'll take, either N or B.  Of course, I don't play simply to win something back as I know that he won't allow it.  But, the plan is that, when protecting, I will gain some needed tempo of my own.",
        "14... Ngf6 15. b3": "In reality, this was the immeidate plan behind 14.Ng5  The reason I fianchettoed again is that I knew I had time for it which is the beauty behind the gain of important tempo.  If 15.Bd2, I'm left with a bad B, which I don't want as I know how it'll end.  Coindentally, with the finachetto followed by the next move which I wasn't aiming, now we're in the equivalent to the full Colle-Zukertot system.  It wasn't the main, but it's how it all ended up, anyhow.",
        "15... Bg6": "I don't why black played that, but this is the point where he begins to get tired and is the conerstone to falling to asleep.  In addition, the reason I view it as pointless is that I feel that this is Hope Chess.  I felt that he was hoping that I'd make a mistake and play 16.e4? losing a pawn.  However, I saw that because, while I considered it, I decided not to as black would be achieving his goal.",
        "16. Bb2": "Therefore, I don't care and view it as a waist of time.  That's because I thought that best was to castle at once which I understand as white doesn't gain advantage should he do so.  At least, not to my knowledge.  Since I view his last move as pointless, I don't waist any time into completing development, once and for all.  As now, my optimisim of comensating for lost material has grown seeing that he is starting to fall asleep.  The idea is that when tired, you often make mistakes, as I learned from watching a GM game, based on comments by, I'm not sure who, but one of the most successful and famous Grandmasters.  In fact, I watched a video on a tourney that Judit Polgar commented, and I believe that this is where it was mentioned.",
        "16... h6": "This time, I know that there is a point.  Although, I would've castled, it'll give him time, away from the pesky which I view as a nuicanse.  But, if he wants it way, I've got no choice then.",
        "17. Nf3": "The only option as anything else loses my N.  Now, I, originally thought that the only other move which appeared better before playing it was 17.Nh3  The reason I didn't is that it also loses with his tactic after 17...Bf5",
        "17... O-O": "Now, I originally recorded that he castled long.  But, I mislooked the move.  First, the position got corrupt when I did that.  Second, this is how it looked after he castled this way.  So, I realize that this is what he did (how it was played.)",
        "18. dxc5": "Meanwhile, coming up with a plan to compensate for lost material, as mentioned earlier, I take.",
        "18... Be7": "?! This is where he fell asleep, as I had anticipated 18...Bxc5 winning back a pawn, at once.  But, I already knew the weakness seeing how tired he was.  With that, I felt that I had a possible advantage here.  Normally, I'd have no grounds for saying, but being tired affects your play, as noted earlier.",
        "19. c6": "So, I take advantage of his mistake.",
        "19... Qd6": "?? Right after this move, he's asleep.  With that being said, he had to retreat, this time around.  I looked and asked myself if there were options, and there isn't.  So, by playing this, the plan of total compensation for what I lost becomes a reality, and then some.  As now, I wind up ahead, when all is said and done.  And, this is how I remembered that he didn't castle long and why it wouldn't be as good.  Had he played 17...0-0-0, it wouldn't be 20.cxd7, but winds up in check so after 20.cxd7+ he would've lost a R, at the very least.  In addition, I had a hard time deciding between exchanging Q's with 20.Qxd6, or taking with 20.cxd7  The reason I captured on c7 was to win something at once, and I kept in mind that if and when he takes the Q, I can and would take back because what I was evaluating is if taking on d7 lost my Queen.  Once I determined it was safe, then was the time to take advantage of that opportunity.",
        "20. cxd7 Qxd1 21. Rfxd1 Bd8": "Also possible and I think that better was to bring one of the R's to d8 because, as noted, the R's should be behind the pawn.  However, this is about as good as it prevents me from promoting which I would've done.",
        "22. Ne5": "The idea being to add a defender to d pawn and threaten to force and exchange, knowing that if I take on g6, he winds up with doubled pawns, and I'm ahead.",
        "22... Bc7": "But, now that he played this, I thought I could win something, if am able to win something.  This, however, is where I start to go wrong.",
        "23. Nc6": "?? I had a tough time deciding between this and 23.Nxg6  The reason I didn't exchange was that I calculated a possible line that would Q, and possibly, win a R.  However, the calculation was inaccurate.  Best was, indeed, 23.Nxg6  This move, will mean trouble in the long run.  After everything was put away, Bert and I both had to use the restroom.  He told me where I went wrong.  In it he said that I should've exchanged earlier because by not doing so, his B combined with the other became so dangerous and impossible to stop that he was able to use his B's to defeat me later on.  Now, I got a picture in my head with the accurate position, and figured out what he was implying.  That this is where I should've exchanged.  While it's fine, for now, in the long run and towards the end, this will cost me the game.  And, that's the only reason I'm giving this move two quieries.  For, if we didn't have that discussion, I wouldn't mark with anything.",
        "23... Nd5": "At some point, after a promotion, I was going to fork and K and LSB, though, with 24.Ne7+  This move prevents that.",
        "24. Bc4": "Knowing this, however, the plan is to exchange his N for my B.",
        "24... Be4": "But, once he played this, however, I came up with better ideas.",
        "25. Rd4": "Not just attacking the B, but at the same time, attacking the center.  A plan is, of course, to double up right there.",
        "25... f5": "Still in sleeping and waking up, he played this.  Definitely protects, but better, in my opinion, was 25...Nf6 because his K is not as well protected.  Therefore, I plan to cause some damage for him.",
        "26. Ba3": "?! It starts with this move.  I took his next move into calculation but with an inaccurate calculation, though.",
        "26... Rf7": "That's because in the calculation, I thought I'd win something.  In this case, his DSB.  Without his f R, I thought along the lines of 27.d8=Q+, Bxd8 28.Nxd8  That's because I did something which I shouldn't have and just remembered what I did in my game against angellis where promoting won a R.  However, I forgot something that Karpov emphasized that you don't just play something in one game because it was good in a previous game.  You base on the position.  So, getting hyperfouces, I very breifly analyzed the position, but didn't do enough HW, as I overlooked his other R.  Therefore, promoting is going to give him back a pawn.  And, it's the move that I calculated and planned when playing 26.Ba3?!  But, that was inaccuracy for that reason, as well.  I'm not sure what the best move was here, but I think it was 27.Bxd5, and after 27...Bxd5, I'd play 28.Rad1 to double up.",
        "27. d8=Q+ Bxd8 28. Nxd8 Rxd8 29. Be2": "Coming up with a plan to make my R more active (give it more mobility.)",
        "29... Rfd7": "But, he, however, doubles up.",
        "30. f3": "Before that happens, I come up with a plan to win his B.  That's because I assume that black has made a mistake.  In an annotation who I gave advise to, I gave a suggestion which was bad because it blocks his B.  Then, I made a mistake in a game shortly after that did the same thing.  So, with that being said, the plan here is to lock his B, so that I'd win it.  I wind up locking it in, but there's one oversight that prevents him from doing so.  He is still in and out of it but more alert then he was before.  Once again, I forgot that you shouldn't compare with other games which I tend to do with stronger players.  Instead, it's about the position which I also analyze but not enough.  In other words, in OTB chess games, I move a little too quickly which is, a bit, problematic.  In part, it's because we only have 2 hours, and a game will often take more then half of that time.",
        "30... Bc2": "In anticipated this, but that's where I thought I'd win something as his B appears trapped.  Worth noting that since he's still a little tired, I was confident that he made a mistake, and thus, was going to lose something like what happened earlier.  Unlike in other games, this time, I get overly confident because towards the end he wakes up, is alert, and I wind up in trouble.",
        "31. Rc1": "? I had a little difficulty deciding between this and 31.Rc4 However, both moves are mistakes for the same reason, and he is slowly but surely getting back in the game.  With that, this loses a pawn, and now, things are even.  When Jack saw Bert play 31...Nxe3, he said, \"very interesting\". ",
        "31... Nxe3 32. Ra4": "Putting pressure on the a file.",
        "32... Bd1": "But, Bert finds a way around that by putting pressure on my B.",
        "33. Bb5": "? No problem, though.  Why run back when there's still a chance that Bert will fall asleep.  He does have more energy then he had before but is still, somewhat tired.  So, there is a chance that he'll asleep again, and I keep that right in mind.  However, I have now crossed the line, as we're about to see.  Best was 33.Bf1 because of what's about to unfold. ",
        "33... Rd7d2": "My last move is where I, officially, took things went too far.  Despite being a little tired, his concentration is back with a vengeance.  And, I am now trouble with the last move.  So, the tables have turned.  One way or another, he is going to win something.  33.Bb1 wouldn't have, however, because if 33...Nxf1, I'd take back, and it's still even.  But, now it winds up as anything but even, as I'm now behind.",
        "34. Bb4": "?? However, I didn't realize it here.  What I thought was that my f pawn was in danger and did Homework on what I had to do to protect it.  I did consider 34.Be2, but realized that I would lose my B.  Therefore, there appeared to be no way of protecting, except with this move.  But, what I missed was a discovered check which will lose something worth much more.  This time, it's my R.",
        "34... Rg2+ 35. Kh1": "Forced.  Now, I knew that I'd lose my pawn.  But, as noted, it gets much worse.  And, at this point, which just discovered, his energy is back.   But, this time, not only won't he fall asleep which I misjudged when figuring there was a chance, but he is no longer tired, either.  Therefore, I'm in trouble, from this point forward.",
        "35... Bxf3": "That's because no matter what I play, I knew he'd win my a pawn, but I missed the one move that he'll play.",
        "36. a3": "?? This is where I became confident that I protected my pawn and, therefore, wouldn't lose anything else.  However, I had to get my c R out of harm's way.  That's because of his next move.  ",
        "36... Rc2+ 37. Kg1 Rxc1+ 38. Kf2": "I also could've played 38.Be1??, or 38.Bf1?? but accurately realized that both would lose a piece, beforehand.  So, this was best.  In addition, I figured that I'd win a piece back, no matter what.  But, it won't, however, be enough to compensate for what's happened.  On the other hand, I last much longer, and it's still a very complicated position.",
        "38... Nc2": "I guess, a N is worth more then a B.  In addition, this is the only move that I wasn't sure how it was played.  That's because I recorded 38...Ne4, which obviously isn't possible.  So, I thought that, maybe, it was 38...Ng4  But, then I decided to stop fussing about what black played because it's not enough to change.  All that matter is that, regardless of where the N moved everything else, including the results, are the same.  So, nothing has changed.",
        "39. Kxf3 Rb1": "Going after my pawn.  So, I'll take, knowing that when he takes back, I haven't lost anything else.",
        "40. Rxa7 Rxb3+ 41. Kf4": "?? Getting out of the check in the most aggressive way since the idea is, now, centralizing my K.  I figured that he couldn't do any more damage because I applied what I learned and remembered from a previous mistake that I made by not centralizing my K when at a disadvantage.  In this case, I mean, launching towards the center.  However, it's a blunder, as I will lose another piece.  Best was 41.Kf2  One reason for this blunder, which is worth, is that, we're now on low on time.  It was 11:50 when I made this move and had to leave in 10 minutes.  So, this is where things change and I no longer care about the position, but rather, comparing what I did or a mistake I previously made.  Otherwise, I felt that I'd make worse mistakes and get mated very quickly.  Sure, enough, the fear of running out of time becomes a reality because it takes a few minutes to make two moves.  Therefore, this is where I start speeding and go even quicker then what you'd see for even a fast a blitz game.",
        "41... g5+": "Yes, I had anticipated this move.",
        "42. Ke5": "So, my plan of centralizing the monarch continues.  What I didn't realize, though, is that this was forced, and now, I lose another piece.",
        "42... Rd5+ 43. Kxe6": "Knowing that, I figured that I might as well, take the pawn.  In addition, there's only 4 minutes left, at most.  So, we're now in a major time crunch.  I no longer care if I make moves that lose quicker because if I don't and I can't finish, then I'd have no choice but to record the game as still in progress.  And, the reality of it is that since it'll be posted in the WTWLTR club, I have to record it as something whether win, loss, or draw, so that it's more meaningful.  Otherwise, what's the point if we say that nothing happened, at all.",
        "43... Rxb5": "And, it takes about 2 minutes to move here.  But, Jack said that I still might have a chance and was happy when I stated that I wasn't going to resign.  That's for the same reason that I mentioned in the last game, or when mentoring people, that, \"it's not over til it's over.\"  In addition, Jack, Bert, and I all agreed that this is and was very complicated and complex game.  And, the position is still quite difficult so, \"it's not so easy\", as Mr. Stockel has previously said.",
        "44. Rf7": "?? Time has just run out.  Actually, I made this move during the last 30 seconds.  And, the reason why I recorded as a lost, as opposed to, still in progress, is that, while we couldn't finish the game, the position is lost.  Like a good coach, Jack showed me why it was lost.  And, he asked me to stay for just one or two minutes so that I could study it before leaving.  I, reluctantly, agreed because it's important to study variations to become a better player.  Plus, as I've noted in previous annotations, if I didn't know his highest rating, it'd be very difficult to tell that he is not a GM because of how he explains things.  The very end, after we call it a wrap proves it since he will play through and show me variations to show what happens.",
        "44... Kh8": "With that being said, he moved here.  But, this is where Jack accurately said that the game was lost from here on in.  In it, he said that best was 44...Rb6+! was best  And, after getting out of check, e.g., 45.Ke7, 45...Re3+ wins my remaining R, but this time, it's without compensation.  That's because after getting out, he can take with my K.  After that, there's no hope left for white."
    },
    "url": "https://gameknot.com/annotation.pl/otb-wtw-game?gm=59544",
    "gameName": "OTB WTW Game",
    "players": "Joe (1282 ELO) vs. Bert ",
    "opening": "Queen's pawn game (D02)"
}