{
    "moves": {
        "1. e4": "I start off with my usual.  Unlike with some players, I know Ted's style of play, and this will become the Spanish Opening.  I knew this from when I played this and play what I'm most used to and comfortable with.",
        "1... e5 2. Nf3 Nc6 3. Bb5 a6 4. Ba4 b5 5. Bb3": "In fact, I knew that we'd get to this point.  But, what Ted does next is something that I haven't seen before.",
        "5... Bb7": "In all of the other games that I've played with him, Ted has played 5...Na5.  But, this came first.",
        "6. d3": "I also considered 6.d4?? but didn't want into the Noah's Ark Trap again.  That's because I now remember from a lesson with Ken in ION's recent annotation between and tombulous that you fall into the NOA trap with 6.d4.  But, 6.d3 and white is fine.  And, my intentions are the same which is opening up a line for my Bc1 to bring into play.",
        "6... Na5": "Ted now plays the move the move that I had anticipated earlier.",
        "7. Nc3": "Thinking that he would force the exchange, I asked myself why waste time when another piece can be developed.  The truth is that I'm ahead in development and am trying to take advantage of this.  What I forgot is that Ted can play 7...b4 which would force my Nc3-e2, leaving me with a semi cramped position.",
        "7... Bb4": "But, he pins, instead.",
        "8. Bd2": "And, I break it right away.  This time, it's not just because Jack said that it was the most common way to break it.  Yes, it was one of the reasons.  But, the main reason is that if and when he retakes, I can and will now prevent being forced to double pawns by taking with the B, instead.  Were I black, though, I would've captured with 8...Nxb3, but I gather that Ted wanted to try something different.",
        "8... Bxc3 9. Bxc3 Nc6": "As now, Ted brings his back to where it was.  However, nothing stops me from winning a pawn on e5.",
        "10. Bxe5": "And, I didn't capture with my N because I thought that Ted would recapture with his Nc6.  Although I'd still be a pawn up, the threat against f7 would be gone.  That's because I intend to threaten that by bringing my Nf3 to g5 or e5, at some point.  Also, with this move his Rook is threatened.",
        "10... f6": "It's understandable that Ted didn't want to liquidate do to being a pawn down.  But, it was necessary here because this will remove his pawn on the weakest.  And, as we know, you must always be aware of the f2 and f7 squares as they're the weakest on the board.  Once they're gone, you're in trouble, as I've learned with TA's blitz Q sacs.  Well, I kept that in mind.",
        "11. Bxg8": "And, that is exactly why I exchanged here.  I normally would've waited, but on top of the weakness that Ted has, this also prevents him from castling.  And, as usual, my idea of a good time is being able to take away my opponents right to castle.  With those weaknesses, I felt that Ted had something to worry about.",
        "11... fxe5 12. Bd5": "I also had this in mind when talking about depriving Ted of the right to castle given that the B controls the square where black would do this.  In other words, one of those files where you castle is controlled and attacked. ",
        "12... Rb8": "I don't know why Ted played this.",
        "13. O-O": "But, I waist no time in castling given that I took advantage of the opportunity, with which, I took away from Ted.",
        "13... Ne7": "As I overlooked, Ted decides to discover an attack on my B.  ",
        "14. Nxe5": "? But, since his N moved away from the pawn which was protected, I felt that it was ok to take it.  Plus, I'm also threatening 15.Nf7.  However, this is where Jack gets involved.  And, he was horrified that I played this move.  In fact, he asked me why I didn't play 14.Bxb7, and I told him that I was not ready to exchange.   Then, Mr. Stockel told me that this was a terrible move.  Now, Ted didn't know what to do.  But, Jack told him that the best move was capturing.  In it he said, \"Take the Bishop.\"  The logic was that he'd win a piece.  I realized that this doesn't because, if he takes, I can recapture.  I'm sure that he was thinking of something else.  I agree that this move is a mistake because preventing the loss of a piece should mean that he equalizes.",
        "14... Bxd5": "But, Jack asked me the same question that Ken asked me a similar question to what Ken asked me in our second game.  This time, it led to a worse mistake.  It was a blunder.  Jack said, \"Now what?  What are you going to do now?\"  ",
        "15. Qh5+": "?? I was originally thinking of 15.exd5.  But, asking that question made it seem like I was in trouble.  Therefore, I came up with a new plan.  My response was that I have to answer to that and checked this way.  He then asked, \"What's that going to do\"?  I said that I was thinking about what happened when Perry played a bad move and allowed me to bring the Queen like this.  His response was, \"that's not going to work\", and I thought he was right because it shouldn't have..  What I was implying with Perry's move was the Domiano's Defense.  In the tournament game against Perry, I was white and he was black.  It started off with 1.e4 e5 2.Nf3 f6?! 3.Nxf6 exf6?? 4.Qh5 g6 5.Qxe5+ which allows white to win the Rook.  Well, after he asked me that, I thought that this variation might work and, as what I'm generally guilty of, got very comfortable and happy with my position.  That's because if black messes up, I will get the Rook and have a plan.  Luckily, it does work.  But, this move is a lot worse then the previous move.  His next move is a good example which turns it from just happy to Hope Chess where I hope that he won't see it which will allow me to achieve my goal.  It's also worth noting that after this move, while Jack looked at the game one more time, he didn't get involved any more because the remainder of his time was spent on the other game.   ",
        "15... g6 16. Qh6": "Instead of retreating, I advance with the same plan of winning the Rook.  Yet, it's still possible for Ted to retreat his B.",
        "16... d6": "But, he attacks my N, instead.  That was one sign, in which, I figured out that my plan would work.  When something like this happens and he attacks, I give it to him, or as I'll apply with what Charles said in his annotation, the Greek Gift.  So, if it black takes, I get something worth more.",
        "17. Qg7": "Thus, I continue with my plan.  And, as anticipated, he takes.  In doing so, I not only get a Rook, but I'll win an additional piece for pawn.  This will put black to the equivalent of a piece behind.  That was the plan behind my unsound 15.Qh5+?? if plan A failed which it did.  Then, I worked on plan B.  However, it shouldn't have worked, as black could've left me behind by getting his Bd5 out of harm's way, earlier.  For example, 17...Rg8 which drives the Q back and allows him to get his Bd5 to safety.  In fact, something like that happened in a very recent game where I thought that I was winning my opponents Queen with the plan to pin it.  But, I overlooked that he would just take my N with his Queen, after which, I resigned as there was nothing else to learn.",
        "17... dxe5 18. Qxh8+ Kd7 19. Qxd8+ Rxd8 20. exd5 Nxd5 21. Rfe1": "With that being said, I go right after Ted's e pawn, as I don't want it to become a passer.",
        "21... Re8": "And, Ted protects it.",
        "22. c4": "So, I go right after his N.",
        "22... bxc4 23. Rad1": "Instead of recapturing right away which allows the N to escape, I see the potential to pin and win.  Thus, I would get back the piece I lost earlier and go way ahead.",
        "23... Nb4": "But, Ted sees and runs away.",
        "24. dxc4+": "So, I throw in the discover check by recapturing, at once.",
        "24... Kc8 25. a3": "And, instead of giving up my pawn, I attack his N.  When Ted retreat...",
        "25... Nc6 26. b4": "I plan to attack it again by advancing my b pawn.",
        "26... Nd4": "?? Seeing the plan Ted played this but missed something crucial.  As now, I've not only compensated, but I get back the piece that I lost and then some by remembering what ION said about short range tactics.",
        "27. Rxd4 exd4": "?? As I saw what's coming.  Thus, by taking, I'll be a R and pawn up without compensation since black will be in check using the same short range tactics.  ",
        "28. Rxe8+": "With that, I'd say that the position is pretty much resignable for Ted.  He can hope that I go wrong and stalemate him.  But, I've got ways to prevent, as I'm considered to be, perhaps, the strongest student in the chess club, according to Jack himself (which is why I get less time then everyonelse in the tournament and will likely give an even bigger handicap in the tourney.)  With that being said, I won't be giving Ted a chance of counterplay.",
        "28... Kb7 29. Rd8": "I saw where he might try, though, as Ted has a passed pawn, and this is it.  I must be careful to prevent the possibility of him promoting.  That's why I'm bound to take it.",
        "29... d3": "Why I also say that the position is pretty much resignable is that there is one move that would've delayed me from taking this pawn.  That was 29...c5, but after 30.bxc5 that pawn would fall as I'd take on the following move.",
        "30. Rxd3 Kb6": "Bringing his K into action.",
        "31. c5+": "But, using what I remember about pawn chains, I place Ted in check right away.  I think that better would've been 31.Rd5 to prevent his K from coming down as what happens.",
        "31... Kc6 32. Rf3": "Meanwhile, I attempt to target his c7 or h7 pawns.",
        "32... Kb5 33. Rh3": "I thought that this was a better way to do it.  I also ideas of promoting my f2, g2, or h2 pawns.  If I didn't fixate on that, I would've just played 33.Re7 right away which would get one of those pawns.",
        "33... Ka4": "Trying to get some compensation, Ted plays this.  As he is threatening three of my pawns.  I'm familiar with this pattern as I saw a similar example in the WTW consultation game between brigadecommander and stalhandske.  As I suggested a move that was bad, and stalhandske made me go by my suggestion and play that in her position so that I'd learn why it's bad.  Sure enough, as he would've won two pawns in a similar, and I'm keeping that in mind because I have not intention of allowing Ted to win back material.",
        "34. f4": "I would've played 34.Rxh7 but didn't want him to get my a3 pawn.  That's because after 34.Rxh7 Kxa3 35.Rxc7 Kxb3, nothing would stop Ted from getting a pawn back with 36...Kxc5.  What I overlooked is that 36.c6 would've stopped that.  So, better was to take right away on h7.",
        "34... a5": "As this move took me off guard.  ",
        "35. bxa5": "However, this move prevents Ted from getting a pawn back.  And, when he recaptures...",
        "35... Kxa5 36. Rxh7": "I take at once with this move.",
        "36... c6": "Not surprisingly, Ted protects.",
        "37. Ra7+": "So, I throw in a nasty check.  Of course, my plan is to promote my a pawn by remembering that the R belongs behind the passed pawn.",
        "37... Kb5 38. a4+": "With that, I also remember that passed pawns must be pushed.  Thus, I anticipate Ted's next move.",
        "38... Kxc5 39. Ra8": "Therefore, I leave more room for my passed pawn by bringing the R further back.  My plan is to keep pushing my passed pawn, until it reaches the seventh rank.  That way, I'd be able to play Rb8, which would enable the promotion.  ",
        "39... Kb6": "Not surprisingly, Ted goes after my R.",
        "40. a5+": "So, I continue with my plan.  ",
        "40... Kb7": "I did see this coming, as I'm forced to abandon my passed pawn to protect the R.  So, I come up with a different plan that will work.  That is, to win his g pawn.",
        "41. Rg8 c5": "What I overlooked is that his c pawn is a passer.  So, he can still try for counterplay using Hope Chess.  That is, hoping that I won't see his plan which would enable him to promote.  But, I see his plan and am thinking about how to handle it.  The idea is not to throw away your advantage or win by underestimating your opponent.  Thus, despite being way ahead, I must be careful, and I am.  As right after this move, I see what Ted is planning to do and have every intention to stop it.  I start by taking his g pawn.",
        "42. Rxg6 c4": "As I asked myself the question that Susan mentions, and that's, \"What's to do\".  But, I found the answer to that.",
        "43. Rg5": "As this move is what allows my R to reach the same file as his pawn, thus, putting an end to his threat.",
        "43... c3": "But, I can still understand where Ted is hoping that I'll make the mistake and forget about the pawn.  Afterall, when you're at a disadvantage like this, the only you can do is Hope Chess.  And, that's by hoping that you're opponent will make a mistake and not see the threat.  But, I know what he wants.",
        "44. Rc5": "And, this is where I stop it.  That's because no matter what he does, I'll take his pawn.  And, even when he gets my a5 pawn, he's just left with his K against my K+R+3 pawns.  Thus, there is no hope for him left.  That's because in addition to what I just said, I'm not going to give him a lucky break by allowing stalemate, if Ted decides to continue.",
        "44... Ka6 45. Rxc3 Kxa5 46. Rc1": "Right after this move, Ted resigned.  He implied that this was a lost position by admitting that there he has nothing left.  Had he not resigned, I would've played 47.Rb1 to keep his monarch confined to the a file.  Then, I would just keep pushing my f pawn until it promoted.  After the promotion, I would've checkmate on a8 with that promoted pawn.  Overall, I enjoyed how this game went, but it still shows that I need to work on my assessment.  This time, I gave Jack a ride to his house, as it was raining like cats and dogs.  But, while we were sitting and talking, Jack said that he was upset that I played 14.Nxe5  As first, one piece was hanging and then, I hung another.  Thus, I was too advanced to be making a mistake like that.  Well, he was wrong about my 14th move.  But, I made that very mistake on the 15th move.  Trying to treat it like a Domiano's Defense, left me with 2 pieces attacked.  I could and should've wound up the equivalent to a pawn down.  But, I got lucky that Ted blundered and allowed me to catch up on the game.  However, I'm gonna have to still work on my assessment as judging the position accurately is crucial.  A mistake has costed me multiple games, including two of my most recent games, both of which ended earlier today."
    },
    "url": "https://gameknot.com/annotation.pl/otb-chess-game?gm=62996",
    "gameName": "OTB Chess Game",
    "players": "Joe (1284) vs. Ted ",
    "opening": "Ruy Lopez (C70), Graz variation"
}