{
    "moves": {
        "1. e4": "Not knowing what Carl would do, since he often changes his defenses, as well as, openings, I play my usual.  As I know how to respond to most defenses with this particular opening, and the same cannot be said for any other openings where I wouldn't know to respond.",
        "1... e6": "And, he opts for the French which I, of course, know to handle well.",
        "2. d4 Nc6": "I was prepared for 2...Nf6, in which, I'd defend with 3.Nc3 defending e4 and developing.  So, I, for a short while wasn't sure of what to do.",
        "3. Nf3": "But, I decided to play the same move that I would do in 1.e4 e5 openings.  The reason being is to develop K side and bring me one step closer to castling.",
        "3... d5": "Carl decided to attack my center pawn which isn't a bad way to go.  I was trying to figure what to do, where to exchange or not.  When thinking about different options, I did not see a reason to exchange so I decided not to.  The only reason would've been due to it being possible, but I also know better now then to just exchange pawns readily, as well.",
        "4. e5": "And, with it, I protect this way to block both of his pawns.  I treat like a different variation, where ...Nf6 is played, and you play this to for the same reason.  But, it's also to attack the Nf6 which gains tempo and acheive a solid pawn chain.  Well, while there's no attack, the pawn chain, I felt, was critical since GM Susan Polgar emphasized in that other variation where you attack the N.  And, I saw a different example in one of TA's games which I annotated where he was teaching that a Q against both R's is a known draw.",
        "4... h6": "Stopping 5.Ng5, but I had no interest in playing, this time around.  Instead, my idea was to pin his Nc6, and not just for anyreason.",
        "5. Bb5 Bd7": "?! But, rather, this was my anticipation.  With pretty much, anyonelse, I don't know how they'll answer.  Carl, however, is a fast player, so trying to use his time controls against him I planned on him doing this as now, his Bd7 is very limited on mobility and only covers one square.  Better was to be more aggressive and play 5...a6, where I'd be forced back.  Had he played that, I would've exchanged on c6 to mess up his pawns structures.  But, with this move, I'll just leave my B where it is and keep his Bd7 limited in mobility, for now.  One reason being is that I castle, at once.  I was happier then I was to start off since I felt that unfamilar territory benefited me here for that reason.  However, I'm becoming too happy, again, which is making me overly optimistic.  As he will go on the offense once I castle.",
        "6. O-O a6 7. Be2": "Once that happens, I decide against exchanging since his B would be better placed.  My idea is to put more and more tension and pressure on his position.  In this case, it's by keeping his Bd7 locked in.  And, just like what Ken noted in our game, exchanging would only alleviate it.",
        "7... f6": "By playing this, I'm forced to exchange pawns.  Doesn't bother me now because I felt that exchanging gives me the advantage here since his weakest pawn will be removed, and he'll wind up with isolated pawns.  I couldn't have asked for anything better since I have now used, I believe 10 minutes, whereas, Carl has used, about, 3.",
        "8. exf6 Nxf6 9. Ne5": "And, with that being said, I opt for an exchange.  I wouldn't have done so, but my reason is to gain tempo.  In doing so, it becomes very similar to the variation that I mentioned in the French, previously since the attack will, likewise, come from my center pawn.",
        "9... Nxe5 10. dxe5 Ne4": "And, it's worth noting that this is also what black often plays when the N is attacked, as Carl did here.  So, although it's in a different setting, and thus, not a transposition, the same idea still worked.  Therefore, I feel that I now have an advantage because Susan Polgar said that exchanging and attacking like this give white a slight advantage.  I'm just not certain, but instead, 75% sure which was more then enough for me.  The reason why white would have the advantage wasn't just tempo but a pawn chain which I don't have here.  But, I was, already, back in familar territory and knew where I was going.  Whereas before, I had no idea and used to have, \"The Fight or Flight\" mechanism.  And, after figuring out why that happened, I realized that this happened whenever I was in unfamilar territory since that didn't just happen with bhidragon, in our unrated training games or unbermensch.  But, it also occurred in both of my training games.  With the Yoga breathes, when I'm in unfamilar territory, I don't hesitate, but as noted in a previous threat, I use my gut instincts which is also what occurred here.",
        "11. Bh5+": "And, those instincts were to play this move, as well.  As now, I'm treating as, if he played the Domiano's Defense.  I knew he wouldn't to avoid this check with my Q where when you black, as he will, then Qxe5+ wins the R.  The very first thing that I kept in mind is that when Carl plays 11...g6? to, fianchetto, attack my B, and try to keep his castling rights I'll pick up a pawn and liquidate.  That seems overly confident, but given how fast he plays, I knew that Carl was going to do that.  Against anyonelse, I'd be working my way from there, but I'd play this just knowing that black can't castle.",
        "11... g6 12. Bxg6+ Ke7 13. Bxe4 dxe4 14. Re1": "And, then I go after another pawn which, of course, Carl will defend.  Even if this didn't attack, I would've played this to centralize my R.  As elyhim told me during, \"Reversion's Open Fire\" that centralizing your R is a way to control the center in one of his more recent annotations.",
        "14... Bc6 15. Qxd8+": "In the meantime, I continue liquidating.  And, Carl acted happy that I played this since he'll recapture with his R.  That doesn't bother me because, even though his Ra8 will be in action and centralized, I'll, calmly, continue developing on my next move.",
        "15... Rxd8 16. Nc3 Bg7": "I misjudged here.  My thought was that if I don't do something, I'm going to lose a pawn.  And, I didn't want to allow Carl to equalize.  It took me more time to make other moves.  But, I'm about to play my next move too quickly.",
        "17. Nxe4": "?? As I didn't consider or look at anything else besides the move played.  As I thought that not only doesn't this protect e4, but it wins another pawn.  Much better would've been to defend by completing my development with 17.Bf4  So, timing was key here, as it gets played, a move later.  And, at the very end, while I didn't completely agree with Jack since he said that I had a win, which I didn't see.  I agree that I made a 2 second move, and this was it.  As now, not only does Carl equalize, but he wins the equivalent to a pawn, thereto.",
        "17... Bxe4 18. Bf4": "As I planned to, and almost played 18.Rxe4?? which was the conditional move after 17...Bxe4  Then I realized that it's not possible because without my B he would have back rank mate in 2, starting with 18...Rd1+  So, this is where I slowed and took 4 or 5 minutes, trying to figure what to do now.  And, I thought that this was the way to go since it's what I should've played a move earlier.  But, this is an example of where, what's good a move earlier is a mistake a move later.  However, I also knew that his next move isn't going to win a pawn because of what follows which is where I start doing what I can for counterplay. ",
        "18... Bxc2 19. Rac1": "With that being said, I follow ION's advise by playing the man, as opposed to, the board.  ",
        "19... Bf5 20. Rxc7+": "As this is where I play Hope Chess.  Of course, I knew that if he didn't blunder, I'd win back a pawn and equalize.  But, I was hoping that Carl would mistake by moving too quickly.  And, in doing so, I'd wind up a piece for pawn up which is exactly what happened.",
        "20... Ke8 21. Rxg7 Rd7": "Preventing the loss of another pawn, but better was to advance his b7, as know, I won't hesitate to liquidate.",
        "22. Rxd7 Kxd7 23. Rd1+": "In the aftermath, I throw in a few checks.",
        "23... Kc8 24. Rc1+ Kb8 25. Bd2": "And, I start looking for a way to free e5.  I'm now thinking on what I can do to make a promotion as I feel that there isn't enough to mate without something else, even if, it were an underpromotion, of some sort.",
        "25... h5": "Preventing me from attacking my B, which might be successful, if I were to play f3.  But, I have no intention of doing so.  My goal was to aim right at his R.  So, I'm going to answer with 26.Bg5.",
        "26. Bg5 Rg8 27. Bf6": "At the same time, I'm still about my e5 which I shouldn't be.",
        "27... Bh3": "Carl attacks in a tricky which, and I've overlooked these kinds of attacks before, since g2 is attacked twice.  I used to do something like bring the R behind e5, or things of that kind.  That is to try and do something with a pawn, and then, overlooked something like Rxg2+ which would win material, since I could not recapture.  Overtime, I learned how to handle a threat like this which I do on my next move. ",
        "28. g3 Bg4 29. Kg2": "And with that, I start getting my K into action since this is an endgame.",
        "29... Bf5 30. Rd1": "And, I prepare to check and liquidate R's which will happen, in a few more moves.",
        "30... Rc8 31. Rd8": "In fact, I get right to it.",
        "31... Be4+": "Trying to stop, but after my next move, I'll go forward with the liquidation.",
        "32. f3 Bd5": "I also considered sacking my R for B to see if I could stop a promotion.  So, I played in between those lines and figured out that this wasn't going to work because after 33.Rxd5 exd5 34.e6, Carl could and likely would answer with 34...Re8 stopping the pawn.  Thus, I just went back to my original plan.",
        "33. Rxc8+ Kxc8 34. b3": "And, I also think about what else I can do to get a passed pawn.",
        "34... a5": "Meanwhile, Carl is coming up with a plan to stop a2.  ",
        "35. Kf2": "And, I keep using my K.",
        "35... b5": "Continuing with his plan.  I thought about what to do and had considered playing 36.a3? or 36.a4?  I might have done so were his B not there, except that he could then answer with ...b4 and block my pawns, which I didn't there.  As I studied examples with TA, and even did something like that against Carl or Tom, and black often gets the advantage, that way.",
        "36. g4": "So, I go back on the offense.  As after we exchange, I will have a passed pawn, which was my goal.",
        "36... hxg4 37. fxg4 Kd7": "Like me, Carl gets his K in action for the same reason as me.",
        "38. g5": "And, I remembered that passed pawns must be pushed.",
        "38... Be4": "Stopping my passed pawn.",
        "39. Ke3": "I could've tried even harder to stop this with 39.h4, but Carl probably would've played the same move next.  Not only that, but I'm starting to run low on time with only 20 minutes left on the clock.  That's not so bad itself, but I, generally, start seeing a forced win when that happens.  And, it isn't the case here.  If I'm not careful here, move quickly enough, I will, likely, start losing on time.  Having said that, this is where I use more of the Yoga breathes since this also causes the Fight or Flight syndrome which is never good in chess.",
        "39... Bg6": "Blocking my pawn.",
        "40. Kd4": "So I use my K and start shifting my focus to his b pawn.  Better would've been 40.Kf4 which might have given me a win.  Although, Carl could answer with 40...Bh5, but if he doesn't do that, 41.h4 would, pretty much, seal blacks fate.",
        "40... Kc6": "Protecting his pawn.",
        "41. Kc3": "And, I'm still going after by getting the opposition here.",
        "41... Kc5": "And, Carl protects even further.",
        "42. a3": "So, I focus on getting a pawn check on Carl which starts on his next move.",
        "42... b4+ 43. axb4+ axb4+ 44. Kd2": "And, now I try to focus on my h pawn.",
        "44... Kd4": "And, Carl focuses on b3 which I can't defend anyway.  But, I felt that if he took, I had a win, so I continue with my plan.  What I forgot is that it becomes passed and, eventually, promotes.",
        "45. Ke2 Kc3 46. Kf3 Kxb3 47. Kg4": "As now, I'm free to advance h4 and not worry about him taking.  ",
        "47... Kc4": "Of course, Carl has other ideas since, as noted, the pawn is passed.  Normally, I would give up here.  But, I don't usually have a B, as well.  With this, I thought that even if I couldn't win, I, at least, had a draw.  And, I was spot on, this time around.",
        "48. h4": "With support and protection, I keep pushing, as does Carl on his next move.",
        "48... b3 49. h5 Bxh5+": "This is why I felt that Carl couldn't win.  As the B would have to go back, but I'd break through with my pawn.  So, he plays this, and I gladly take back.  Of course, I know that he'll promote, and I'm prepared for that.  In fact, promoting is the equivalent to a conditional move because I have plans for when he does.  I'm thinking harder and harder to with less then 15 minutes on the clock.  I had, about, 12 minutes here.",
        "50. Kxh5 b2 51. g6 b1=Q 52. g7": "As now, thinking about what happened against anitam, and the decisive mistake after throwing away a win that turned a draw into loss, I go forward with my pawn.  If Carl doesn't do something to stop g7, I'll have a win.  But, if he does, I'll be able to get a draw since, I know Carl, and he'll continue to throw in perpetual checks until it's a 3 fold repetition which was my goal due to how little time I have.  As a matter of fact, this is the first time that I've made what Jack calls, \"a 2 second move\" since 17.Nxe4?  However, it has to be like this for the rest of the game, as I only had 10 minutes left, at most.  The last time something like this happened I lost, on time.  It was against Mariann a number of years where I was winning, although we played it out, and I would've lost, anyhow with a blunder.  But, this is where I realized that I could not win but, at best, could get a draw.  And, I was confident that I would get one since Carl enjoys perpetual checks.",
        "52... Qh1+": "It starts right here, and I was happy again for good reason.  I keep going back and forth on the same squares, but he doesn't yet.  So, the same position doesn't occur for several moves.  On top of it, my notes or PGN for move order becomes sloopy which almost corrupted the position.  I think this happened because my hand got tired and with such little time left. ",
        "53. Kg6 Qg1+ 54. Kf7 Qa7+ 55. Kxe6 Qb6+ 56. Kf7 Qc7+ 57. Kf8 Qc8+ 58. Kf7 Qd7+ 59. Kf8 Qc8+ 60. Kf7 Qd7+ 61. Kf8 Qc8+": "Had that not happened, this is where I would've announced a draw by repetition.  I thought had a different move recorded.  In fact, the sloppiness, made it look like 61...Qd8+?? which Carl wouldn't have done and why he keeps going back and forth.",
        "62. Kf7 Qd7+ 63. Kf8 Qc8+": "But, my writing becomes a little neater since the 60th move, knowing that I might have missed the opportunity to announce the draw.  And, it turns out to have happened, but I wouldn't have done it before my 61st, as that's when, I can say for certain that the position occurred 3 times.  This, however, is where I announced it.  As I said that this is now a draw by repetition.  I'm not sure what Carl said or asked, but I think it was how come.  But, I definitely said that it was because the same position has repeated itself 3 times when he kept placing me in check and I kept going back.  I then told Jack that this was a draw and asked him what happens now since it hasn't happened in his tournament before.  Well, that's when I found out that a score like 0-1 black won, 1-0 white won, or 1/2-1/2 are actually scores of who gets points during a tournament.  I discovered this when Jack told me that after a win occurs someone gets the point, and the other is 0.  But, when it's a draw, each side gets a half a point.  Then he told me, as we were saying goodbye to each other, that he was still impressed with my play and that I was still improving.  But, I made a 2 second move and had a win that I missed from too fast.  I also know that Jack isn't always right.  And, I can say for certain that Jack is wrong about me having a win.  On the other hand, he was correct about me making a 2 second move because I almost overlooked something that I did not see right away which was a back rank mate.  That was, when I played 17.Nxe4 which was the same idea as Flip Coin Chess since I did not think twice about it before playing it.  As I felt that I could answer with 18.Rxe4+?? before seeing that 18...Rd1+ would've won.  In fact, Jack stopped analyzing it after our 17th move since he got busy with Nathan Resika in a simultaneous match.  So, my thought process is what still needs a little more work and polishing because had I thought about it before hand, I wouldn't have played 17.Nxe4, in the first place.  "
    },
    "url": "https://gameknot.com/annotation.pl/otb-tournament-game-2?gm=66603",
    "gameName": "OTB Tournament Game 2",
    "players": "Joe  vs. Carl ",
    "opening": "French defence (C00)"
}