{
    "moves": {
        "1. d4": "Sometimes, Jack will start off with the Kings Pawn Opening, if he is white.  But, this is how he usually opens, and it is going to become a QGD.",
        "1... d5 2. c4 e6 3. Nc3": "As a result, he brings his N out.  This is the most common response to the QGD, and it is a solid move because of development. ",
        "3... Bb4": "But, I am also going to start developing and in a very interesting way because this move pins N to the K.  However, I looked at the position, and now realize that this is certainly not the best move.  Better was actually 3...Bd6, as my DSB remains on a longer diagonal.  Now, the master mater told me that the best outpost for your bishop is on the space that covers the most squares, in my most recent game against Fred.",
        "4. cxd5": "Despite the fact that this is a QGD, he takes the same pawn, anyway.",
        "4... exd5": "But, so do I.",
        "5. Nf3": "After that, he continues to develop.",
        "5... Nf6": "But, so do I.",
        "6. e3": "I do not know why he played this.  Better was 6.e4.  That's because this move locks in his DSB so that it's confined.  Now, my opponent once told me not to lock in your own pieces, like this.  And, that's after I responded with something like e3, as opposed to, e4.",
        "6... Ne4": "?! Therefore, I try to take advantage of him because I feel that he has a weakness.  So, in this position, I am attempting to exchange, and I figured that white had no choice but to play 7.Nxc3.  But, as Jack proves, that is not the case, and white does not have a weakness, at the moment.",
        "7. Qa4+": "At this point, I told Mr. Stockel that I did not expect him to play this and am now in a lot of trouble.  I was essentially worried that I would either lose castling rights or a piece.  But, as always, Jack said, \"Start thinking\".  It was then that I realized that the position is not that bad for black, and I can easily get out of this with 7...Nc6.  In fact, that's the only option because any other move would result in the same consequence as what I just mentioned.",
        "7... Nc6 8. Qb3": "I do not know why he moved here.",
        "8... Qe7": "? In this position, my goal is to prevent another annoying check.  What I did not realize, is that this move is actually a mistake because it now allows him to win a free pawn, if 9.dxc5.  Lucky for me, however, he missed the opportunity.  On the other hand, that's not much of a surprise because he misses these opportunities from time to time.",
        "9. Bb5": "At this point, he decides to pin my N.  Although this isn't an intention, I will get out of this on my next move.",
        "9... O-O": "The real motif behind this move was to continue with development and castle before it's too late.  At first, Mr. Stockel told me that this was a mistake when he said, \"I don't like it.\"  Then, Jack changed his made by saying, \"Not bad, it's ok.  Go ahead and play it.\"  ",
        "10. Bxc6": "After this, he decides to start an exchange variation by taking my N.",
        "10... Bxc3+": "But, I retake by placing him in check.  After this move, we are going to exchange pawns.",
        "11. bxc3 bxc6 12. O-O": "! Then, he decides to castle, this time.  I understand that perfectly well and feel that he made the right choice.  Like me, white is also getting his K to safety before it's too late.",
        "12... Rb8": "At this point, I want to take white's c3 pawn, but his Q is preventing me from doing so.  On that ground, I decide to attack his Q, at once.  ",
        "13. Qa4 Nxc3": "After the retreat, I finally take advantage of the opportunity to capture his c pawn.  I actually thought that I had won it, but generally speaking, my coach will not give something away, unless he inadvertently overlooks it (which he does sometimes) or if it gives him a winning advantage.  In this case, that is not a free pawn because white will retake with 14.Qxc6, so it becomes an even exchange.",
        "14. Qxc6 Ne2+": "Not only that but by retaking, white attacked my N.  So, I decide to get out of it by placing him in check.  And, after getting out of this, I will exchange his DSB for my N.",
        "15. Kh1 Nxc1 16. Rfxc1": "I honestly thought that he would retake with 16.Qxc1, but I understand why he played this, instead.  Bringing his back to the first rank would undo some of his development, so this was the right decision.  Not only that, but this move puts pressure on the c file.",
        "16... Rb2": "So, I respond by putting white in a situation which I thought would be very difficult for him to get out of.  I decide to attack his f pawn, and I thought that this move would automatically win it or put Jack under enough pressure for him to make a blunder where he would find himself in trouble..  However, that goal is not going to work.",
        "17. Kg1": "! That's because of his response.  And, this is best.  By moving here he is able to defend f2 without any stress, so I now have to find a strategy before my position starts to deteriorate.",
        "17... Bg4": "So, I decide to complete development with this move.  That way, I can double up my rooks and put pressure on the b file, by bringing my f8 R to b8.",
        "18. Ne5": "Of course, white will have none of that when he decides to attack my LSB.",
        "18... Qg5": "? But, neither am I because his last move will make me extremely brave, in this game.  However, this move is a mistake that loses a pawn.  Therefore, believe it or not, 18...f5 was best.  While I don't like putting a whole around my K, protecting your material is far more important then King safety.  And, that's something which I keep forgetting.  ",
        "19. Nxg4 Qxg4 20. Qxd5 Qe2": "After he takes, I decide to put pressure on the second rank by threatening mate in one.  This time, however, I realized that he would see the threat, so I wouldn't not be able to mate him.  So, my goal was to put him in a tough situation, where it would be difficult to defend against the threat.  That way, he would really have to think about what to do next.  And, my plan worked, this time, because it took him a while to come up with the next move.  Well, as it turns out, he has several options, but this position is certainly not easy for him.",
        "21. Qf3": "That's because he defends with his Q.  At first, I thought that this was his only option, but a second look at the position shows that best was actually 21.Rf1, which defends against the threat even better.  The problem with this move is that I will not hesitate to force a Q exchange, and that will put a whole around his K.  Now, at first, I thought that his K will become exposed, but that is not the case.  Just because there's a space around the King, doesn't mean that it's open or exposed.  I mean, that's usually what will happen but certainly not in this game.",
        "21... Qxf3 22. gxf3 Rfb8": "? In the meantime, I decide to put pressure on the b file, as mentioned earlier.  However, this move is also a mistake as it loses another pawn.  Not only that, but my a7 pawn is left hanging.",
        "23. Rxc7 a5": "Therefore, I have to protect it.  Until now, I did not realize it, but 28.R2b7 was just as good and would have done the same thing.  However, there's nothing wrong with this choice.  ",
        "24. Rac1": "However, white now decides to put pressure on the c file by doubling up the rooks.",
        "24... g6": "?? Of course, I am not bothered by it.  Instead, I decide to respond with this move.  The reason being is that I believe that it will eventually win a pawn back, especially if Jack plays a sequence of moves like f4, followed by e4, and then something like f5.  And, I figured that there was nothing wrong with putting a whole around the K because it appeared to be an endgame.  During an endgame, your K becomes a weapon and, therefore, needs to come out.  However,  this is not an endgame.  Not only that, but he is not going advance his pawn. Most importantly, however, this is the losing blunder according to my coach which is why I marked with two question marks.  Therefore, Jack told me that better was 24...Kh8 or 24...Kf8, in this position for strategical reasons.  The reason being is that unlike 22.gxf3, this move exposes the K, as we will see later on. ",
        "25. Rc1c5": "At this point, he decides to attack my P.",
        "25... Rb2b1+": "But, I defend by placing him in check.  However, best was actually 25...Rxa2 and that would have won back a pawn.  On the other hand, I did not realize it, until Saturday, the day after our game. ",
        "26. Kg2": "Forced.",
        "26... a4": "But, my a5 pawn was still hanging.  In a case like this, I also could have brought one of my to b5.  However, in my opinion, this move was the best choice, this time.",
        "27. Ra7": "On the other hand, he is still determined to win my a pawn.",
        "27... Rb1b4": "But, I am not going to allow that.  So, unlike before, my only choice is to defend it with one of my rooks.",
        "28. d5": "At this point, he is determined to promote, but I am not afraid.  That's because I am now pretty confident that the game is now lost for black, and this was before Jack revealed the decisive mistake.  However, being in a losing position makes me braver and willing to take more chances, before I resign.  The reason being is that sometimes, you can pull a swindle and turn a loss into a win, as ionadowman pointed out in one of my earlier annotations.  On the other hand, getting worried can only exacerbate a bad situation.  So, I am not willing to give up, until I know that a game is lost because Mr. Stockel always says, \"Don't give up right away.\"",
        "28... Rd8": "So, I decide to continue fighting by putting pressure on the d file.",
        "29. e4": "However, he decides to end that pressure by connecting his pawns.  And, now it is an endgame during which connected pawns will strongly benefit your position.  ",
        "29... Rd4": "So, I attempt to reapply the pressure with this move.  Of course, that attempt is not going work.",
        "30. Rca5": "That's because of his decision to double up his Rooks.",
        "30... Kg7": "Since it is an endgame, however, I decide to bring my K out, in order to use it as a weapon.",
        "31. d6": "This, however, is how he responds.  At this point, I realize that the game is dead lost because white will promote, shortly after 32.Ra8.  And, there is no way around it because if 32...Rxa8, 33.Rxa8.  Then, even if I were to take back a pawn with say, 33...Rxd6, his pawn majority would outweigh my pawns.  So white will promote with one of his other pawns, and there is nothing I can about that.  Therefore, I resigned.  After this game, I learned an important lesson from Jack Stockel, and this lesson is the moral of this story.  It is always important to, \"Fight for your position\", in chess, and this game is a perfect example.  "
    },
    "url": "https://gameknot.com/annotation.pl/otb-wtw-coaching-game-maintaining-your-position?gm=51351",
    "gameName": "OTB WTW Coaching Game-Maintaining your Position",
    "players": "Jack (1800 USCF) vs. Joe (1218 ELO)",
    "opening": "QGD (D31), 3.Nc3"
}