{
    "moves": {
        "1. e4": "I start off with my usual but wasn't sure how Stanley was going to respond.  Afterall, he usually plays as white.  And, his first move is usually 1.d4 which later becomes the QGD-Slav Defense.  But, I played the move that I'm most used to.",
        "1... e5": "And, Stanley plays along with that.",
        "2. Nf3": "So, I continue with my usual but wasn't sure how Stanley was going to respond.",
        "2... Nf6": "I was not surprised to see him play the Petrov Defense.  However, I knew what to do since I studied it in a mini tournament.  And, I know that capturing the pawn on e5 is most common.  Likewise, black responds with 3...d6  The reason that 3...Nxe5 is unusual is the fact that white often attacks it with 4.Qe2.  But, 3...d6 wins back a pawn, as it will here.",
        "3. Nxe5 d6 4. Nc4 Nxe4 5. Bd3": "Not sure what else to do now, I decided to attack Stanley's Knight.  The only issue is that this blocks the center.  But, I looked at 5.Qe2 and decided against it since he'd answer with 5...Qe7 and let me stay behind in development.  5.d3 also came into consideration, but this would've limited the mobility of my Bd3.  So, after careful consideration, I thought that this was the best move available for white.  Part of the reason is that it also enables me to castle when Stanley retreats.",
        "5... Nf6 6. O-O Be7": "Meanwhile, Stanley continues with his development and prepares to castle.",
        "7. Re1": "And, knowing that this was his only square for the Bishop, I pin which Stanley answers by castling at once.  I, however, had planned that out because this will allow me to continue developing, at once.",
        "7... O-O 8. Nc3 Nc6": "But, Stanley has the same thing, in mind.",
        "9. Be2": "To prevent Stanley from attacking my LSB, as well as, opening up the d pawn, I retreat.  Better might have been 9.Bf1 to keep some pressure on the center, but I didn't want to undevelop, either.",
        "9... d5": "Meanwhile, Stanley goes after my N.",
        "10. Na3": "And, I protect.  Believe it or not, I had considered 10.Ne3?? since other options lose it right away.  The idea being is that I don't like having to place my N on the rim, but there's no choice because bringing it to e3 allows him to fork and win it for only a pawn, after 10...d4!",
        "10... d4": "But, Stanley attacks anyway.  And, I am forced to undevelop since 11.Nce5?? loses the Knight to 11...a6!",
        "11. Ncb1 Bf5": "Putting pressure d3 since Stanley also has his d4 pawn.",
        "12. d3": "But, I put a stop to that.",
        "12... Re8": "Centralizing his Rook.",
        "13. Bg5": "And, I bring out another piece and put pressure by trying to tie down either Stanley's Nf6 or Be7.",
        "13... Bd6": "But, Stanley will have none of that.",
        "14. Nc4": "So, I threaten to exchange B for N.",
        "14... Re6": "But, I have second thoughts about that when Stanley plays this move.  As after exchanging, ...Qe5 becomes an option, with which, I'd be worried about my Be2 since that gets attacked a second time.",
        "15. Nbd2": "Therefore, with I complete my development since the plan here is Nb3.",
        "15... Qe7": "Although, the Bishop is attacked again which makes me ready to exchange, at this point.  ",
        "16. Bf3 Rxe1+ 17. Qxe1 Qxe1+ 18. Rxe1 Bb4": "And, Stanley answers by pinning my Nd2.  I was thinking about what to do but decide to exchange his Nf6 first.  Be it note that it takes me a lot to exchange N for B.  But, the reason for doing it now is that it will mess up his King side pawn structures.  Once that's done, I will break the pin.",
        "19. Bxf6 gxf6 20. Re2 Kf8": "I don't know why Stanley played this since I can't place him in check right away.  The only real threat was 21.Bh5, I don't see a good continuation, afterwards.  ",
        "21. a3": "Having said all of that, I go right on the attack.  Stanley answers by exchanging, which I have no problem doing since it's his B for my N.",
        "21... Bxd2 22. Nxd2 Ne5": "Trying to exchange my B for N.  I was wondering what to do, until I saw that Stanley's b7 pawn is hanging and take advantage of that.",
        "23. Bxb7 Rb8": "Of course, this move was to be expected.  ",
        "24. Be4": "?? So, I go right after Stanley's B.  I thought that exchanging favors me since I'm now up a pawn.  Plus, I have a plan for when he exchanges.  But, I overlooked one move, 25...Rxb2 winning back a pawn.  In fact, although it would be very difficult to win, this loses because it will allow Stanley to pick up an additional pawn on c2 since a back rank mate is also threatened.  And, with that one extra pawn, it's still a win with best from black.  However, there would be nothing easy about the win.  Later on is where I really go wrong.",
        "24... Bxe4 25. Nxe4 Rxb2 26. f4": "Giving my King room to escape to prevent a back rank mate, whilst going after the N.  However, Stanley's N is going to become very important on his next move.",
        "26... Nxd3 27. Nxf6": "?? Of course, I couldn't take on d3 since this would lose my R.  But, this was the final blunder, as it guarantees Stanley an instant win.  27.g3 was essential because of what's about to unfold. ",
        "27... Rb1+": "At first, I thought that I'm fine after 28.Kf2, but it's illegal. This only leaves me with one option, 28.Re1, but 28...Rxe1# is mate. I thought that the threat was gone since there was the window out of a back rank mate, with just the R.  I completely forgot that the Knight was a monster, as well. We analyzed it, and 27.g3 was the only move.  After, 27...Kg7, it looked like a possible draw with best play from white.  However, black would still have a won game after something like 28.Nd5 Rxc2 with that extra pawn.  As now, black has an unstoppable passed pawn that would, eventually, promote.  But, it would have been very difficult for Stanley to find the winning continuation.   Getting impulsive and going right after one of the doubled pawns is what lost, at once.  The problem was me forgetting that Stanley had more then one threat against my back rank."
    },
    "url": "https://gameknot.com/annotation.pl/otb-wtw-coaching-game?gm=65166",
    "gameName": "OTB WTW Coaching Game",
    "players": "Joe (1319) vs. Stanley ",
    "opening": "Petrov (C42), Paulsen attack"
}