{
    "moves": {
        "1. e4 e5 2. f4 exf4": "Tim accepts the Gambit.",
        "3. Nf3": "Joe develops.  Now, I don't like getting into chess terms so much, these days, because this is where I start missing what the board is telling me.  When Joe plays something different it becomes complicated.  The only reason I'm using this term is because it's the only reason I can figure out for this move being played.  When in doubt, it's also good to figure out the reasons.",
        "3... g5": "Adding protection to his f4.  At first, I wasn't sure why this was needed since it's not attacked, yet.  But, Joe is threatening a discovered attack with his d2.  If he decides to advance it, black is protected since, for the obvious reason, TA can't play 4.Nxg5??",
        "4. h4": "Joe's idea is to do something different then what you generally.  In this position, I'd get my Bf1 out and prepare to castle.  TA played this to mobilize his Rh1.   ",
        "4... g4": "With that being said, I also would've move here, in this position.",
        "5. Ng5": "Knowing that his Knight is safe, Joe moved here.",
        "5... f6": "?? According to Joe, this loses.  In it, he said, \"This game moves into the Allgaier Gambit,but my opponent plays a bad book move early with 5....f6.If you check 5.....f6 is not in the GK opening book.\"  I agree because, first, Jack, as noted, told me to play moves that are most studied by GM's.  So, when TA says opening book, it's based on what Grandmasters analyze.  Second, it's similar to what you see in the Damiano Defense, and what follows is comparable.  As noted this is his week pawn which he leaves vulnerable.  And, that's, especially, applicable here.  In doing so, white will be able to exploit his weakness.  Joe also said, \"Much better would have been: \n\n5.Ng5,h6 \n6.Nxf7,Kxf7 \n7.Nc3,f3 \n8.gxf3,Be7 \n9.Qe2,Bxh4+ \n\nAnd now above,the advantage in position,control and tempo is reversed and in blacks hands would have been extremely favorable for the win.\"",
        "6. Qxg4": "As now, Joe has a poisoned pawn.",
        "6... fxg5": "?? But, Tim ignores the danger and takes, anyhow.  Now, this is similar to what's happened in some of my recent.  Therefore, by doing so, Joe has a mating sequence.  I think that the only move that would've helped black to last a little longer was 6...Ke7 because of what's coming.  Either way, however, white is still going to win sooner or later.  But, had 5...h6 been played, as noted, black would still have the initiative.  ",
        "7. Qh5+ Ke7 8. Qxg5+ Ke8": "Although, in general, you don't want to interpose a piece, unless necessary, I would've found necessary and would've responded with 8...Nf6  My attitude is that you might as well in a situation like this.",
        "9. Qh5+ Ke7 10. Qe5+ Kf7 11. Bc4+ Kg6": "Most of the other moves, after that were forced, until here.  But, I would've felt the need to play 11...d5 as it also appears to block future checks, temporarely.",
        "12. h5+ Kh6 13. Qxf4+ Qg5": "But, in this position, however, I wouldn't have played this.  Instead, I'd move my monarch to g7, with the idea now being 14.Qe5+, Nf6 (as a conditional move.)  But, despite mentioning what moves I would've played, it would not have made a difference, as Joe notes.  He'd mate, one way or another.  Another way to look at it is after playing 5...f6, followed by the poisoned Knight with 6...fxg5?? Tim had no good moves, one way or another.  That is the big picture.",
        "14. Qxf8+ Qg7 15. d4#": "The morals to this story are first, try to understand what the board is telling you.  When Tim made the wrong move, he missed the big picture because of what followed, thereafter.  Most importantly, know how to handle the situation.  Or as elyhim, as noted, puts it, \"Stick With what You Know.\"  As Joe also implied, not knowing how to adjust to something different, being the KG led to Tim's downfall."
    },
    "url": "https://gameknot.com/annotation.pl/otb-chess-game-stick-with-what-you-know?gm=60695",
    "gameName": "OTB Chess Game-\"Stick With what You Know\"",
    "players": "Joe (2400+ USCF) vs. Tim (1823 USCF)",
    "opening": "KGA (C39), Allgaier gambit"
}