{
    "moves": {
        "1. d4": "As white, Bernard enjoys opening with 1.d4.",
        "1... d5": "Which I'm used to, and his next move is the same.  I was interested in what would happen after 2...Nf6 since that's how I also answered last week.",
        "2. e3 Nf6 3. c4": "Unlike last time, it has become the KID.  So, we'll stick to mainlines, for a while.",
        "3... e6 4. Nf3 g6 5. Nc3 Bg7 6. cxd5": "But, this is where he deviates.  That's because, in the mainline, white fianchettos with 6.b3 which is preceded by 7.Bb2, as I learned by Ken.  Nonetheless I'll take back and am interested in how Bernard answers.",
        "6... exd5 7. Qb3": "Bringing his Queen out early.  I don't why Bernard did this.  My guess is that he's starting to face distractions, as well.  That's because my speculation is that, maybe, my opponent thought that he'd win a pawn with 8.Nxd5??, after which I win a N.  Later on, I find out that he wasn't going to take, but I still think that a distraction played a role.  However, this move is not premature because there will be several threats, affiliated with it, when I get distracted and forget some things that Ken noted, until it's too late.",
        "7... O-O": "But, aside from distraction, I don't care what the reason is.  As far as, I was concerned, he made an inaccuracy which I try to exploit by castling, at once since Bernard has K safety to worry about.",
        "8. Bd3": "With that being said, Bernard continues with his development.  ",
        "8... Bg4": "?? As do I.  But, I decide to do things differently then average.  Given that he brought his Queen out prematurely, I'm now threatening to destroy his pawn structures around the monarch.  With that being said, I figured that I've gained tempo.  But, I seriously miscalculated not to mention that the distraction has started for me.  As noted, I didn't think twice about where that N would retreat.  The only move that came into consideration was 9.Ng5, after which, I'd play 9...b6 to defend that pawn.  But, with this move, I'm forced to protect my N, after which, he knabs that pawn.  More importantly, however, is the fact that he'll win much more later on.   In fact, I think that this is the losing blunder, believe it or not, because I didn't just miss the story but everything that the board was indicating as my concentration just wasn't there.  As it turns out, what I thought was a waist of time happened to be the same threat.  Which I missed when deciding to calculate at once, as opposed to, considering other choices.  That's because, as noted, this was anything but a normal week at a chess club.  And, I hope that it doesn't get this crazy.  But, the point here is that there was more then one threat that needed to be considered.  Even worse is, never mind threats, I was back to only thinking about one, as opposed to, multiple variations which is something that Ken discussed in our game.  In doing so, things that were essential didn't even come close to consideration, with this game.",
        "9. Ne5 Be6 10. Qxb7 Nbd7": "Not only that, but my R was threatened.  Which made this the only way to protect it.  But, despite only being one pawn down, my position is already starting to crumble with the terrible choice.  In addition, the distractions are only going to get worse, and the judgement with multiple threats isn't going to get any better here.  ",
        "11. Nc6": "I knew that I had to get the N out but didn't think about this move.  Instead, thought that the worst that happens is Bernard on exchanging on d7 with 11.Nxd7  Instead, he's going to force me to exchange Queens which is something that I didn't want after being down what I am.  On top of it, I figured that I might need my Q later on, which I won't have now.  Then, I thought, ok we exchange Queens, but aside from that, the problem is over.  However, it's only beginning, as I also failed to calculate 13.Ne7+  After which, he's going to win my R for a N.  This is actually why 8...Bg4+?? was a blunder.  And, I didn't see any of this, and thus, missed the entire that the board was indicating because despite trying my hardest not to, I became too distracted to concentrate as noted when the blunder occurred.  In doing so, I also didn't think about and forgot what Ken said about calculating multiple variations.  Now, it's basically too late to save the position.  I don't realize until later on.  But, I'd call this a resignable position, at this point.",
        "11... Qc8 12. Qxc8 Rfxc8": "Although it's not needed here, what's worth noting is that I thought that this was the best that Bernard could do.  However, this was where the variations ended for me.  But, the next move took me off guard.  And, what this means is based on how I was thinking with Ken, as that I just wasn't thinking about the game.  I now know what I was thinking about.  In addition to that, most of my concentration was spent worrying about Jack's wife and hoping she was allright, rather then, how the game was developing which is a, \"no no\", as bhidragon pointed out.",
        "13. Ne7+ Kh8 14. Nxc8 Rxc8 15. O-O": "And, this is where Bernard castles.  Earlier in the game, I figured that he might have ruined his chance to castle by bringing the Q out early before figuring why he did it.  But, I knew that he might be able to castle later on.  As I also learned, (being that the Q was my favorite and one of the very few that I always follow) it didn't apply in this game because of the loss of material that I just dealt with.  Right after his played this, the distraction was, temporarely over.  However, it'll return and were it permanent, the position is still lost for me.  I can put a fight, and there's definitely more to learn, but in the end, Bernard will end up with an overwhelming advantage, as he's the equivalent to a piece ahead, without compensation.",
        "15... c5": "Trying to get some counterplay, though, I'm interested in exchanging pawns.  I wasn't just hoping but also figured that I could get a dangerous passed pawn by knocking off his c pawn since it looks like d5 would be something to watch.  However, this was a case of jumping the guns again since I forgot that d4 stopped it.  But, it was still worth trying and putting up a fight since Bernard said that despite this position, it was difficult for him to force the win.  And, that was due to how strong I played when I was not distracted, like now. ",
        "16. dxc5 Nxc5": "I also took note of the fact that his Bd3 would be attacked.  Bernard also implied that this was another reason that it wasn't easy for him to win the game which makes me happy because it shows that when things are normal, I do remember what Ken emphasized.  The problem is what to do, in the future, if I have a day like yesterday.",
        "17. Be2 Rd8": "This is the main way, in which, Bernard had to struggle as I've placed my Rook behind, what I thought was a passed pawn, based on Susan Polgar's advise.  What I overlooked is his e3, and therefore, was not a passer, after all.  But, I don't mind missing that as I'd still play this and treat it like a passed pawn, regardless, since that's what I'm used to (it blends in with my style of play).",
        "18. Rb1": "I don't know why he play this.",
        "18... Bf5": "And, although the reasons should matter, the distractions were starting up again so I didn't care.  My attitude was play a move that looks inaccurate, and I'll punish it by attacking something.  So, he moved the Rook without me knowing the logic, and I wound attacking the Rook which forces him back to a1.  I feel that if I'm going to lose, it won't be without me trying to pull a swindle.  And, part of trying the combat is by gaining tempo and attacking pieces, whenever possible.",
        "19. Ra1 Ne8": "Trying to reposition my N to a better spot.  The plan was 20...Nc7, followed by 21...Ne6 as I like better there then on f6, where it blocked my Bg7.",
        "20. Rd1": "Centralizing his Rook.",
        "20... Bc2": "? But figuring that it was inaccurate, so like before, this was the only move that came into consideration.  And, I'm now as distracted, as that of earlier, since Stanley has to leave, at this point, and therefore, said goodbye to everyone at the club.  So, I didn't consider any other move, except for this.  However, it's a mistake, as I missed the next move which does more then just attack the Bishop since he is going win a pawn.  Better was the immediate 20...Nc7, which is why I played 19...Ne8, in the first place.",
        "21. Rd2 Bf5 22. Rxd5": "Not only that, but I'm going to be forced into liquidating Rooks.  I didn't want this do to being behind.  But, if I don't take, he's going to win my Nc5, which I couldn't allow. And, if I retreat, he gets my Rd8 with this nasty fork.  So, my next move is forced.",
        "22... Rxd5 23. Nxd5 Be6": "But, I figured (so the thought process), is at the very least, I do gain tempo which made it appear worth it.  So, it's still going to make things difficult for Bernard.  However, that is not true because of what he does next.",
        "24. Nf4 Na4": "Unlike before, despite being behind, I'm ready to exchange pieces and act on it.  That was do to distraction and my thought process behind it was.  The reason behind this move was that I figured, that I'd win a pawn back.  So, no matter how hard he tried, Bernard couldn't prevent me from getting a little compensation which I miscalculated.  That's because the only variation that came to mind was 25.Nxe6, fxe6, followed by 26...Bxb2, 27.Bxb2, Nxb2 figuring that he had almost nothing left which, in theory, were it of equal strength could become a draw, and boom, I've made for some of the damage.  But, with the remanants of what left of that distraction, I missed what comes after that which was 28.Bxe8, so it's an example of needing to calculate multiple variations.  I say this because this is how I thought with Ken, when I said if this, then that happens.  And, he said that I needed to think about more then one variation which didn't change with this game.  It was right after he took back on 28.Bxe8 that the distraction was over, at once.  But, by then, it's a resignable position.",
        "25. Nxe6 fxe6 26. Bb5 Bxb2 27. Bxb2+ Nxb2 28. Bxe8 Nc4": "Figuring that I was still only down by the equivalent to a piece and pawn, but no more, I still play on.  Had I known about being this far down, I would've resigned.  That started to change, thought, on my very next move.",
        "29. Bf7": "The reason being is that I calculated what had v. what he had.",
        "29... Nd6": "So, I displayed some Hope Chess because of this attack.  As I'm hoping but know that he won't retreat.  Instead, he'll take with the Bishop so, like with Ken, it didn't work.",
        "30. Bxe6": "And, I resigned here.  As now, being this far behind on top of a pawn means that I'm not going to learn anymore.  Plus, he will promote.  But, more importantly, though, is the fact that I was too far behind.  In the second game, which wasn't annotated since it started on the wrong side of the board, I was not distracted, at all and played much better.  On the other hand, however, Bernard was and had to run, 30 minutes after the second one began.  So, I didn't let the distraction bother me, and with his mistake, I won material.  Then, I made a mistake which gave him back a piece.  However, being low on time means that he made a another mistake and lost another piece which enabled me to win that game.  Therefore, it was an interesting week.  What I hope happens, in the future, is that it stays normal or close to it.  In other words, I'm praying that things don't get so crazy that there's one distraction after another, as this is going to help me play better, in the future."
    },
    "url": "https://gameknot.com/annotation.pl/otb-chess-game?gm=61557",
    "gameName": "OTB Chess Game",
    "players": "Bernard  vs. Joe (1353)",
    "opening": "Queen's pawn (D00), stonewall attack"
}