{
    "moves": {
        "1. d4": "The theme here is development.  So far we have played 6 games and 50% of them have been decided by developmental problems.  This game is no exception.  I manage to get some very active piece play and once White steps out of theory, I am able to simplify the position to one in which Black has a winning engame.",
        "1... Nf6 2. Nf3 e6 3. g3": "My friend chooses this move order to avoid my well studied Bogo-Catalan lines with an early ...Bb4 .",
        "3... d5": "3...b5 is also possible and many GM's, including Topalov, have used this line successfully.",
        "4. Bg2 Be7 5. O-O": "Sharper lines see White delay castling.",
        "5... O-O 6. c4 dxc4": "Heading for the lines of the open Catalan.  White does not have the option of Qa4 .  This is the main difference in the Geller system.",
        "7. Qc2": "Ne5, Na3, and Nc3 are all possible.",
        "7... a6": "Now the main line runs Qxc4, b5; Qc2, Bb7.",
        "8. a4": "This is by far the most interesting move, as White wants to interfere with Black's plan of queenside expansion, and with it, his queenside development.  White does have to be careful, as it is a weakening move and he hopes that his center control will offset the weakenss of b4 and b3.  As often is the theme in the Catalan, Black's chances will most likely be tied to the activation of his queen's bishop.",
        "8... Bd7": "The best method of developing the light-squared bishop to oppose its opposite number.",
        "9. Ne5": "A very natural move which unleashes the power of the fianchetto bishop and prepares to recapture the c4-pawn with the knight.",
        "9... Nc6": "Other lines are drawish and this move offers Black the best practical chances to play for the full point.",
        "10. Qxc4 Nd5": "This keeps the position as complicated as possible without any spatial or positional concessions.",
        "11. a5": "An interesting move which proves to be a little to slow.  11. Nxd7 Na5; 12. Qc2 Nb4; 13. Qc3 Qxd7 gives Black an excellent position, due to the weakness of the b4 and b3-squares.",
        "11... Nxe5": "Here I opt to exchange the centralized knight and effectively nullify White's pawn advantage in the center.  Now simplification would yield a won endgame for Black due to the queenside majority.",
        "12. dxe5 Bc6": "Completing development and preparing to play ...Nb4 and exchanging the light-squared bishops.",
        "13. Bf3": "Protecting the e-pawn against a nonexistant threat. better is Nc3 or Be3.  Basically any move that attempts to get the queenside pieces active.",
        "13... Rc8": "Fritz likes ...Nb4, which does make Bf3 look a bit silly, however, ...Rc8 will fit in naturally with my plan, while keeping a trap set for my opponent, which he falls into on the next move.",
        "14. Rd1": "This allows a simplifying combination which gives Black the winning endgame, due to the weakness of e5, b2 and the nonexistant queenside development.",
        "14... Ne3": "Its also Fritz approved!",
        "15. Rxd8 Nxc4 16. Rxf8+ Bxf8": "...Kxf8 is stronger.",
        "17. Bxc6": "Inflicting a structural weakness, but also removing the only developed piece.",
        "17... bxc6 18. Bf4": "Ironically, this is a mistake.  f4 would have been the more natural choice, however, after ...Rb8, ...Bc5, and ...Bd4, the b2-pawn is falling.",
        "18... Rb8": "The rook will find a very nice home on the 7th rank.",
        "19. Nc3 Rxb2 20. Rd1 Rc2 21. Ne4 Rxe2": "Winning material with threat.  If the knight moves the e5-pawn drops.",
        "22. f3 h6": "Not only creating luft, but preparing to kick the bishop with ...g5, when the e5-pawn drops.",
        "23. Rd8 g5 24. Nc5 Kg7 25. Nd7 gxf4": "Also possible is ...Be7.",
        "26. Rxf8 Nxe5 27. Nxe5 Kxf8": "Here White resigns.  Thanks to my opponent for a well played game."
    },
    "url": "https://gameknot.com/annotation.pl/otb-g45-game-2-catalan-geller-robatsch-system?gm=4193",
    "gameName": "OTB G45 Game 2 -- Catalan Geller-Robatsch System",
    "players": "A friend  vs. Me ",
    "opening": "Queen's pawn (A46), Torre attack"
}