{
    "moves": {
        "1. e4": "After this move, Jack, as always, said, \"Ok, I'll make it easy for you.\"  This implies what's coming.",
        "1... e5 2. Nf3 Nc6 3. Bb5 Nf6": "I was wondering how Jack would respond to the Ruy Lopez.  He usually plays 3...d6  But, 3...Bc5?! has also been played.  Important to note that if he did that, I'd answer with 4.c3, and would continue with 5.d4 because it's about gain of tempo and solid pawn chain, as reversion told me.  Meanwhile, Jack said, \"I'll play it safe, I don't trust you.\"  I understand this very well as the idea is, \"Don't trust your opponent.\"  Because he played the most common move, I'm going to stick to mainlines.  I can deviate, but I feel that, unlike with nuntar, Jack knows too much if I play 4.Nc3, so likewise, I don't trust him, either.  Therefore, unlike the training session with John, for me, delaying castling was not an option in the context of this position.  If I didn't know Jack as well, things would likely be different due to my training game with John. ",
        "4. O-O": " Jack: You castled already?  Joe: Yes.  Jack: Very good. ",
        "4... Be7": "Continuing his development and preparing to castle.",
        "5. Nc3": "So, I continue with my development while adding a defender to e4 in order to threaten his e4.",
        "5... d6": "Seeing the threat, he said, \"I'll play it very safe.\"",
        "6. d4": "So, I opt for the exchange variation.  I figured Jack would decline it due to his Nc6 being pinned.",
        "6... Bd7": "Therefore, I said, I figured you'd play that.  As now, I have an answer to that.",
        "7. d5": "And, that's with this move.  Now, 7.dxe5 came into consideration.  But, I kept in mind what Susan Polgar told me when teaching about the French Defense and combined it with the longest game that I annotated with tactical-abyss since that same variation came up.  Therefore, I kick his N as the idea is that I have a solid pawn chain and gain tempo.  After the attack, Jack said, \"You're coming.  Allrighty, that's allowed.\"  ",
        "7... Nb8": "I was very surprised to see this played.  I anticipated the exchange variation with 7...Nd4  But, this undevelops.  Although I stopped thinking this way, the thought reoccured with this move.  It appears that Jack just waisted time with this move, and now, I believe that I have an advantage which I'll attempt to exploit.",
        "8. Bc4": "I considered completing my development.  But, this is where I abandoned the chess quotes, for now.  Though it doesn't happen so much here, in OTB chess there's not much choice due not having analyze the board or enough time to visualize.  Instead, pulling out the chess bits and wisdom is the best way to guide my play in this circumstance.  It, however, isn't needed here.  bringing my Bc1 into play would've allowed Jack to exchange.  Normally, I don't mind early exchanges.  The problem, however, is that it's a bad idea, in this position, because it gives his Nb8 a good outpost.  And, I want to keep Mr. Stockel's options limited.",
        "8... a6": "Preventing my Bc4 from going back to b5.  But, that doesn't bother since I wasn't going to play Bb5, anyhow.",
        "9. Bg5": "And, this is where it becomes safe to complete my development.  And, at the same time, there's added pressure to his dominant Knight.",
        "9... b5": "I figured he played this which is another reason why I wasn't ready to play Qe2.  Although it's a different move order and not a transposition, this is still a common theme in the Ruy Lopez.  The idea is driving the white's LSB back which Jack did.",
        "10. Bd3": "10.Bb3 is the most common move, in this position.  But, the decision was made to deviate from that.  Here's my thought process.  I don't lose anything after 10...a5, but I didn't want to chance it or be caught in a difficult situation.",
        "10... Ra7": "?! Mobilizing his Rook, but in my book, it's a waste of time as I'll attack.  And, my belief is that retreating will give me an edge, for when Jack does I feel more optimisitic about my position.  So, this is what I want.  I'm focusing on a little more then just the small stuff because of what comes after his retreat.",
        "11. Be3 Rb7 12. Nd2": "This is the logic behind my comment above.  My fear was that Jack would pin my Knight that was on f3.  So, by attacking his Rook and forcing him to waist tempo, I was able to prevent the pin.  Afterall, based on past experience and against someone of this strength, despite not being serious yet, make no mistake that an absolute pin of that sort would give him an edge.  The idea being is that they do become dangerous as I learned in the pinning motif where he had two pins that I failed to break in one move and lost shortly after.  Then, something similar happened against one of my students, followed by Wizard Chess.  The idea is to prevent history from repeating itself.",
        "12... b4": "However, I forgot about the move that comes after which is this.  As, now, I still walk into a pin.  But, unlike before, that does not bother me as I break it and attack him.  Therefore, I'm proud of myself as it shows that I've learned from my mistakes, in terms of, how dangerous those pins are.  Jack implied something similar because when I broke it, he said, \"Very good.\"",
        "13. Ne2 Bg4 14. f3 Bh5 15. Ng3": "Taking advantage of the fact that my pin is gone, I bring one of my Knights to a better outpost.  As GM Susan Polgar has mentioned in our e-mail course, this is very important.",
        "15... Bg6": "Knowing how menacing and strong his LSB was, my intention was also to exchange it for my N, which Jack wisely prevents.",
        "16. Nc4": "What Jack didn't know, however, is that I anticipated 15....Bg6 and this was the conditional move.  As now, both of my Knights are better placed.  And, despite material being even, I feel that my advantage has grown.  Now, it's possible that I'm overly confident with the position and acting like I understand more then I actually know.  But, I'd rather do this and be too confident then nervous.  In that past, I've been nervous and was corrected by Jack which I then emphasized to my students of not getting worried.  In doing so, and situations like this, I'm one extreme end or the other (not in the middle.)   That is, too anxious, or overly confident.  I'd rather be positive then anxious.  And, with it, I'm not afraid of what Mr. Stockel might do, for now.  The idea is, as Susan also mentioned, to have fun which is what's happening.  In fact, bhidragon when he noted that in our rated game.  In explaining that he was interested in how I'm playing these days, he also said, \"Let's have fun.\"  Well, that's my attitude here.",
        "16... c6": "Jack: This might be ok.  Joe: Maybe.  What he doesn't realize is what I'm about to play.  That is capturing which was the plan.  However, it doesn't need to lose material, but taking only builds my confidence even more.",
        "17. dxc6": "It is, however, very important to note that I almost blundered here.  I considered a move that anyonelse wouldn't have even thought about (that is, a more experienced player.)  But, I didn't for the same reason.  The move I was thinking of was 17.Na5?? to attack his Rook and gain tempo.  The good part is that I didn't need the analyze the board to see the threat of 17...Qxa5  Sounds easy, but in reality, it was an equivalent to a Homework assignment of a different form since this was, nearly, overlooked.",
        "17... Rc7": "? I'm a little surprised that he played this, as opposed to, 17...Nxc6, as now, I'm up a pawn.  However, he misses move that one would not generally expect from a coach.  But, I understand him too well and the actual reason is due to his glacoma.  That would cause anyone to miss something like that, despite touching pieces, which you see in blindfolded chess.  Jack has some qualities of that.",
        "18. Na5": "But, now I bring the Knight to the rim.  The thought process that goes in it is what kept in mind.  If he takes my c6, I'd pin with 19.Bb5.  However, this is wrong because his a6 prevents me from doing that.  Yet, I told Jack why I thought it was good before overlooking it.  And, he said, \"If you say that 18.Na5 is good, I believe you.\"",
        "18... Qc8": "Another reason for playing 18.Na5 is because of what I'm about to do.  I thought that attacking with Bb6 would win the Rook, but Jack defends.  Yet, I'll play it anyhow, since he can now strengthen his Nb8, which I don't want to allow.",
        "19. Bb6 Rxc6": "?? Up to my surprise, Jack played this.  But, I also understand the reason behind this blunder and realize that his glacoma is the reason behind capturing with the Rook.  He feels these things, and chances are, more then likely that he mixed the two up and thought that this was the Knight.  With that being said, I anticipated 19...Nxc6, after which, it's even.  I think I'd have a small advantage still, but with this move the advantage is much bigger since I win a Rook for Knight.  At this point, while I might not be successful due to how much stronger he is, I'll strive for a win.",
        "20. Nxc6 Nxc6": "This answers the question earlier, as the thought the Rook was a Knight.  As otherwise, he wouldn't have played this.  The reaspm being is that I'll liquidate since the idea is, \"Exchange while ahead.\"",
        "21. Qe2": "With that being said, I now bring my Queen into play in an attempt to win Jack's a6.  Another reason for not doing so earlier is that, I used to develop my Queen once everything else was developed.  I only do so in extenuating it's believed to be an extenuating circumstance, these days.  It's important to be careful, as it's how I went wrong against reversion.  But, Jack said that the Queen should be brought out much later on, when it absolutely needs to be and not just because development is complete.  And, that's due to how fragile the most powerful piece is early on.",
        "21... Qb7": "Not surprisingly, however, Jack protects.  I almost captured, anyhow, but saw that my Bb6 is attacked.  So, I'll retreat as the threat will be renewed.",
        "22. Be3 a5": "I'm also not surprised that Jack felt it and defends.  I don't think he saw with the same issues, but when feeling, despite the mistakes including this, Mr. Stockel generally plays the right move.  Remember: that when he feels things, it's an equivalent to playing blindfold chess.  I know this because when they don't see the moves (the GM's, they feel.)  And, I've seen examples from the Polgar Sisters.",
        "23. Ba6": "So, I come up with a different idea.  The is to attack his Queen.  That's because, as I learned about with the book, \"Chess Tactics for Champions\", it's about, \"Deflection and Removing the Guard.\"  His a6 prevented the move, but since I have the opportunity, my decision was made to go for it.  The idea is to exploit the weakness to enable the nasty pin on his Nc6.  When, Jack breaks it, I'll liquidate since I'm ahead.",
        "23... Qc7 24. Bb5 O-O 25. Qc4": "In order to do this, I needed another attacker.  That means adding pressure to the c file.",
        "25... Rc8": "Likewise, Jack needed a defender, as otherwise, I'd also win his Queen which would force him to resign.  At least, it's liquidation, as opposed to, ruinous loss of material.",
        "26. Bxc6 Qxc6 27. Qxc6 Rxc6 28. Nf5": "? With that being said, I try to further liquidate.  However, it's a mistake because I overlooked c2 being en-prise.  So, when we exchange, Jack will win back a pawn.  Much better was 28.Rac1.  After that, he might not allow it since 29...Bh5 is a possibility.  But, if he takes or doesn't move it, then I'd be successful liquidating.",
        "28... Bxf5 29. exf5 Rxc2 30. Rab1": "Learning from the previous mistake, I prevent him leveling out.  I also could've protected with Be3 but didn't want to undevelop as everything that happened earlier with getting pieces would've appeared to be nothing.  And, I don't like waisting time for no reason.",
        "30... h6": "Preventing a back rank threat.  It's not a threat, yet, but later on it could be, so I think that Jack made the right choice.",
        "31. Rfd1": "So, I put pressure on the d file.  Part of the plan is to unite my Rooks together.",
        "31... d5": "Trying to win my Be3 since the idea behind this move involves 32...d4, as I can't capture with my Rd1.",
        "32. Bb6": "So, I counterattack by going after his a5.",
        "32... a4": "Which Jack defends.",
        "33. Ba5": "So, I reattack to put pressure on his position given that I'm still ahead.  Yet, the position is even.  Knowing that a win is, most likely, not possible, my new goal is to go for a draw.  Yet, if were to offer one (which I have before) he'd decline and would say that it must be played out first.  This is why that offer did not occur.",
        "33... d4": "In addition to what I mentioned, there's a also a problem which is his passed pawn.",
        "34. Rde1": "So, I try to stop it.",
        "34... Nd7": "Not to my surprise, however, Jack holds onto it as now, I can't take since it's defended.",
        "35. a3": "I almost played 35.b3 but thought that it would lose a pawn.  However, after 35...axb3, 36.axb3, there's no way that Jack can win a pawn.  But, I missed it when playing this (which is as good), and as a general rule of thumb, \"It's better to be safe then to be sorry.\"",
        "35... b3": "I anticipated 35...bxa3 but am not surprised to see this.  After watching about pawn chains, from tactical-abyss, a similar position occurred.  And, what it makes me realize is that this is one of those times, where they are especially useful.  Might seem useful but we're in the endgame and one can promote.  In fact, this will happen when I start blundering, and we're not too far away.",
        "36. Re4": "My plan is to double up and sac a Rook for his Nd7 in order to stop his e5 from advancing further.",
        "36... f6": "But, this move stops it which is where I start to go wrong.  As now, taking won't work.",
        "37. Rg4": "? But, after teaching me and playing through variations that he wanted to show me, I realize that this isn't a mistake, afterall.  But, the game chat ensues which is why I still give a query.  Jack: That's a mistake.  Joe: I don't see how.  Jack: Do you want me to show you why?  Joe: I would.  Afterall, in the long run, I don't care about winning or losing.  In the end, the goal is to learn and making a mistake is how you do this.  With that, Jack sacced his Be7 for my a3, in order to push his passer since, \"Passed pawns must be pushed.\"",
        "37... Bxa3 38. bxa3 b2": "This is where I start to become a little anxious, yet, I'm also thinking about what to do, as opposed to letting my nerves take over.",
        "39. Bb4": "?? So, I decide to protect a3 to prevent 39...Nb6.  But, this is where seeing the overall picture becomes essential.  As it turns out, however, Jack rightly pointed that this is the losing blunder.  39.Be1 was the only way to save this position, so it was forced.  After the game we discussed this and why he called 37.Rg4? as mistake.  He said that best was to double up with 37.Ree1.  He was little upset that I moved it to Rg4, because somewhat similar to what bhidragon told me, Jack said something for years which I forgot.  Mr. Stockel told me that the general goal is to bring both Rooks on one file.  Even if not, you want to keep together.  By isolating one on g4 and got myself in trouble.  We went over variations as to what would've had I played the right, but why isolating the Rooks got me in trouble.  So, let's say I made the right choice and played 39.Be1, his next move would've been 39...Rc1+, now the only thing that holds is 40.Rxb2 (as 40.Rxc1?? allows him to promote and the game is over.)  But, after capturing on b2, Jack would answer with 40...Rxe1+  Before analyzing, I agreed that I would've lost a piece but it's better then allowing what's about to come which is a promotion.  However, had I doubled up in the center this wouldn't have happened.  Well, after analyzing, I discovered that after 40...Rxe1+, not only haven't I lost anything, but I'm still a pawn up.  With this, being played white is busted, no matter how you look at it as he will Queen.",
        "39... Rc1+ 40. Kf2": "?? But, I figured that I've stopped the promotion with this move.  My thought process, based on some passed games was that giving up my Rook prevented his b2 from advancing behind it.  However, the other idea is that a Rook should remain behind the passer.  So, with that being said, not only was there no way to stop it, but this move also loses a Rook.  Therefore, it is resignable as there are no good moves left.  But, I don't resign, yet, because of the way I thought which appeared to be his inability to promote.",
        "40... Rxb1 41. Be7 Kf7 42. Bb4 Rd1 43. Be1 b1=Q": "After Jack Queens, however, we both agreed on resignation.  For one thing, in addition to what I mentioned, resignation generally didn't happen until mate could be forced since easy19 continued that game where I resigned before mate was proven.  But, after showing my loss against reversion, he did not question it, so things have changed.  And, in this position, I figured that mate was soon to follow, after 44...Qc2+, but after getting out of check, it'd still take longer.  What can be agreed on, however, is that there is nothing else to learn here.  Right after this game was finished and in the Men's Room, while we were saying goodbye to each other for the week, the game was discussed with two things learned.  But, one of the things he said (which is the more important) is the moral of the game.  First, in general, you should keep the Rooks together, as opposed to, seperating them.  He said that I got myself in trouble by isolating both rooks.  In general, that's true, but after analyzing it here, I realized that it's not in the context of this game.  Because after those variations, I still have a manageable position.  Second, but more importantly (the lesson) is to slow down in the endgame.  In it, he said, that I could, sometimes, wiggle my way out of a mistake in the midgame.  But, in the endgame, however, one mistake will often make or break it.  This makes sense to me because as shamash put it, \"The endgame is your ability to play chess.\"  I can relate to that due to what I studied in understanding how to mate with your Knight and Bishop.  For one thing, you must play accurately in the N+B+K mate to win.  If you blunder, it will most, likely, end in a draw.  This happened to me for months before becoming second nature.  Second, during that time, in the second to fourth times that I retook the quiz, after failing the first time, I still didn't pass due to moving too quickly.  It took time before realizing that I had to slow down in order to become familiar with the concepts.  In doing so, things started making sense, and I was able to pass the quiz, understand the fundamentals, and use it to explain in previous annotations.  Well, the same thing is true in endgames like this because you must go slower and concentrate more then the middle game to hold the position, and even, win.  Failing to do so, is what led to my downfall."
    },
    "url": "https://gameknot.com/annotation.pl/otb-wtw-coaching-game?gm=60885",
    "gameName": "OTB WTW Coaching Game",
    "players": "Joe (1355) vs. Jack ",
    "opening": "Ruy Lopez (C65), Berlin defence, 4.O-O"
}