{
    "moves": {
        "1. e4": "The usual.",
        "1... e5": "Although I normally don't annotate this move (since it's what I'm used to, the chat isn't.)  In that, he said, \"Ok, I'll give you this.\"",
        "2. Nf3 Nc6 3. Bb5 a6": "This time, he plays the most common move in the Ruy Lopez.  Jack will differentiate, but the last two times, he played 3...Bc5  So, now it was time for my coach to do something different, but I'm most used to seeing 3...a6, and thus, know what to do.  As, I'll retreat on the most common square.",
        "4. Ba4 Nf6": "Continuing with his development.  Now, when Mr. Stockel played 3...Bc5, I'd castle.  But, even if he were to play that here, I would not.  That's because tipsyjourneyman and I discussed it.  And, we agree to an extent.  But, one thing is for sure which is that against a stronger player (espeically a runner), I'll delay castling and develop, first.  That's because John said that someone (he believes shamash) told him that castling should be used as the final step in development.  However, even if I wanted, it's not possible, in this particular.  The reason is that I'd lose a pawn if I did that.",
        "5. Nc3": "With that being said, this is the only move that protects it, as now, I have an extra defender to e4.",
        "5... Be7": "Jack: I'll play it safe.  I don't trust you.  Joe: Ok.",
        "6. d4": "At this point, castling is safe.  But, as noted, I'll prolong, until development is completed or it's absolutely needed.  With that being said, 6.d3 also came into consideration with a pawn chain.  But, I like going into the exchange variation.  Just before this happens, Jack will hit my Ba4, in which, I'll get out of harms way by retreating to b5 which is what we typically see. ",
        "6... b5 7. Bb3 exd4 8. Nxd4 Nxd4 9. Qxd4 Bb7": "Placing his LSB on the longest diagonal, which is known to be good.  That's why we often see players fianchetto.",
        "10. e5": "? I was directly applying what reversion said in my last annotation against this runner.  Although the position here is different, the idea behind it is the same which is the gain of tempo since Jack will be forced to get his Nf6 out of harms way.  BTW, that game started off with 1.e4, e5 2.Nf3, Nc6 3.Bb5, Bc5 4.0-0, Nd4 5.Nxd4, Bxd4 6.Nc3, when 6.c3 was more common, as everyonelse pointed out.  And, what he said was, \"This c3-d4 plan is quite common in the Ruy Lopez, mainly in this position, since it wins a tempo by attacking Bd4. No surprise it's what experienced players choose most. Note it also helps Bb5 to reach c2 immediately via Ba4-c2 in case it gets attacked by ...a6-b5.\"  In addition, I was worried about losing my e pawn, but it was protected until I advanced it.  With that being said, I'm not sure what the best move as here.  But, in this particular position, that plan was a mistake, which luckily, due to Jack's guacoma, black doesn't spot.  But, he can win a pawn with 10...Bxg2, and if 11.exf6, Bxh1 12.fxe7, Qxe7+ 13.Qe3, Qxe3+ 14.fxe3, not only liqudiating while being a pawn down, but also losing the opportunity to castle short, and losing, as opposed to, gaining time because my Bc1 remains undeveloped.  So, I'd be forced to bring into play, before castling long.  ",
        "10... Nh5 11. O-O": "Although I would've held off on this until completing development, there is no choice here.  I see the mistake I made, and now, I must fix it by getting the monarch to safety.  In fact, he implied that it needed to be done.  Jack: Very good, you're smart.  Joe: Thank you.  Jack: That was the right move.",
        "11... Bg5": "He wants to exchange our DSB's.  And, I, willingly, allow this because it completes development.  Plus, it depends on the position, but I've learned that, in general, you want to exchange early and often against a stronger opponent, unless they have a weaker piece.  Well, I felt that Jack's DSB was stronger then mine, so I felt that doing this would be beneficial here.",
        "12. Bxg5 Qxg5 13. g4": "?? But, this is where I really start to go wrong.  For this and thought process, I must now go back in time.  This is something I forgot about after presenting it in KOH club.  While I remembered the Homework, I forgot about all else as it seemed irrelevant.  The reason is because I got the right answer but for the wrong reason.  But, that same attitude and miscalculation led to this mistake which makes it important since we're talking about thought process.  Therefore, I change it from just Homework to a quiz.  By my own standards, I failed, and unlike with other courses, there are no retakes as the damage has been done.  This one, however, involved figuring out why black resigned.  The reason is that black would've lost a piece, but I calculated the wrong variations.  And, the teacher made a very good point because I thought it involved the Knight.  And, it was with the same results, that the pawn attacks it, after which it's blocked and would be lost.  He said, as part of the quiz before finding out it's Homework, don't you think it can move elsewhere, and he was quizzing me.  Well, that same thing occurred here, but now, the damage has been done, for real.  In other words, I calculated on how I could win Jack's Nh5. Just when I thought I looked at everything, and thought that black could not get out of this, Jack finds the only way out.  And, when he does, I run into problems, as we're about to see.",
        "13... Nf4": "When, he did, I was shocked and my jaw dropped.  Joe: I'm in trouble.  Jack: How many times must I tell you not to, voluntarily, expose your King?  And, we were trying to figure a way out.  But, both of us agreed that best is 14.f3  But, he said that I could still wind up in trouble even then.",
        "14. f3 h5": "Jack: What happens here?",
        "15. h3": "? Joe: Then I must play here.  However, as noted on my last move, I did not concentrate or take my time.  Therefore, I'm not sure what the best move was, but this is certainly a mistake as I'm going to lose a pawn.",
        "15... Nxh3+ 16. Kh2": "I get out by playing this.  That's because he has told me that bringing your monarch to the corner is an important part of King safety.  However, my King is not safe, no matter how you slice it.",
        "16... Qh4": "To take advantage of that blunder, he goes right after my monarch.  The plan is to get a discovered check.  However, despite my concentration being down, I figured out that this would lead to mate.  What I had considered, at first was, 17.gxh5??  But, Jack's plan is 17...Nf4+, 18.Kg1 (forced), Qg3+ 19.Kh1 (forced), Qg2# ",
        "17. Kg2": "Which I had to prevent.  But, in exchange, however, Jack will get another pawn.  And, it is only going to get worse for white.",
        "17... hxg4 18. Qe3": "To prevent further trouble, I decide to add an extra defender to f3.  However, it is already worse, as noted.",
        "18... gxf3+": "Jack: What happens, if I play here?",
        "19. Qxf3": "?? Joe: Then I capture here.   I know that moving my monarch will enable Jack to mate.  So, I played this, but it should lose my Queen.  Much better was 19.Rxf3, and if 19...Bxf3, 20.Kxf3, and now it would take longer for him to mate because if 20...Ng5+, 21.Ke3 and he doesn't have an immediate sequence.  But, with this move, Jack can win a Queen, but black does not take.  Instead, he plays something much better which win even quicker for him.",
        "19... Ng5": "And, that is with this move, as now, he is threatening mate.  But, this time, I overlook it.",
        "20. Qxb7": "?? This is the only move that, in the real game, was not played.  But, I decided to make it look like white got greedy and grabbed the bishop.  That's because sometimes, \"To take is a mistake\"  And, being greedy, as noted, would've led to this.  Instead, I played 20.Qd3 which is actually an illegal move since my Queen is pinned.  I didn't realize it, and due to Jack's glacoma, and the absence of Bert and Tom, he didn't notice it, either.  Nontheless, the next move is still the same.  So, in other words everything else, including the final blow was how all else was played.",
        "20... Qh2#": "Jack: But, isn't this mate.  Joe: Yes, it is.  And, he laughed, as he usually does, when delivering mate.  We reviewed it and played through variations.  But, this time, I must disagree with him because of one thing that just isn't possible.  In it he said that best was 20.Bf7+, as now, I'm threatening mate.  So, after this, the only way to refute that would be 20...Nxf7, allowing 21.Qxf7+, Kd8 22.e6, d6 (as 22...exd6? would be a mistake), and after 23.e7+, Kc8  And, the problem is that I didn't see any of it, as an important to learn is seeing the opponents weakness.  However, the line that Mr. Stockel gave me is unplayable because 21.Qxf7+ is also illegal, and for the same reason.  As it turns out, my Queen is directly pinned, so it cannot move.  Therefore, once I played 19.Qxf3, the only way to prevent this mate was giving up my Queen for my LSB.  But, the best I was going to get was the loss of a Rook and pawn for a bishop, after which, he'd be in better.  The real problem occurred due to rushing and having unreasonable attitude which, therefore, exposed my King, unnecessarily.  When that happened, he was able to exploit my weakness.  From there, things were only going to get worse. "
    },
    "url": "https://gameknot.com/annotation.pl/otb-wtw-coaching-game?gm=60295",
    "gameName": "OTB WTW Coaching Game",
    "players": "Joe (1370) vs. Jack ",
    "opening": "Ruy Lopez (C77), four knights (Tarrasch) variation"
}