{
    "moves": {
        "1. Nf3": "Of course, I didn't know what to expect from Carl.  He likes to take me and others off guard by changing his opening constantly.  Overtime, I came to realize that it's a good learning experience for me since Kenneth_fiore_3 would change openings each time.  And, he said that the idea is to get me into unfamiliar territory and learn different ones for learning.  That was, the same idea as Reversion's Open Fire.  In general, I just stick to the same defense, but when he plays something else, I play a different defense.  That's due to the fact that the best defense in one opening is different in another opening.  So, for example, after 1.e4,  1...e5 or 1...c5 is best.  But, after 1.d4, 1...d5 is best.  Thus, I change my defense with the next.",
        "1... Nc6": "And, that's to safely allow my e pawn to come out, at some point.  But, like what Ken mentioned in our first training game together, I'm interested in how Carl will handle this.",
        "2. d4 Nf6": "And, I respond by developing my other N.  Of course, we've transposed into the 3 Knights Defense.  But, what I was hoping for was 3.Nf3 which would turn it into a 4 Knights Opening.",
        "3. Bd2": "Of course, I'm not surprised to see Carl continue with his development.",
        "3... d5": "And, I stop his d pawn to prevent 3...d5 as I don't feel like being attacked or losing a tempo.",
        "4. h3": "Preventing 4...Ng4 or 4...Bg4  In general, I like this move a lot, and I often play something like this.  But, in this position, I find it to be a waste of time as I wasn't going to play either of these moves.  It wouldn't attack, pin, or threaten anything.  As white, I would've continued with 4.Nc3.  So, I look for a way to take advantage of white's lack of his development.",
        "4... Bf5": "I start with this move due to how mobile my LSB now is since it covers 8 squares here.  How much it would cover was the very first thing that I kept in mind since easy19 and GM Susan Polgar emphasized its importance.",
        "5. Nc3": "Developing another piece.  But, with a small advantage, I decide to target c7.  I normally wouldn't since, in general, it's easy to drive off.  However, I felt that Carl's position was already compromised due to my space advantage.  Development is, of course, equal but I have more space in the center since my pieces are more mobile.",
        "5... Nb4 6. e4": "Putting a stop to the threat, but it doesn't bother me, this time around.  As my next move is the first thing that I kept in mind.  I normally wouldn't since I don't exchange just because it's possible.  But, I did it here due to the fact that, when all is said and done, I'm a pawn up.  And, with a series of exchanges, it's going to become liquidation which is favorable for black here.  Of course, the first thing that I kept in mind was the masked battery which ION mentioned in my game against nuntar. ",
        "6... dxe4 7. Nxe4 Nxc2+ 8. Qxc2 Bxe4 9. Bd3": "Trying to prevent further damage, Carl quick plays this.  It's a good try, and I almost fell for it, as his goal is to have me exchange his B's.  As then, I won't pick up a pawn.  But, upon another masked battery, I realized that by taking his N 10...Qxd4 is, indeed, available.",
        "9... Bxf3 10. gxf3 Qxd4 11. Be4": "Trying to win back a pawn.  But, I put a stop to it by liquidating again which then enables to defend with my Ra8, as opposed to, playing 12...c6.",
        "11... Nxe4 12. fxe4 Rc8 13. O-O-O": "? And, Carl goes for it by castling long.  Better for Carl was to castle short, as now, I will pick up, yet, another pawn.",
        "13... Qxf2 14. Rdf1": "I'm not surprised to see Carl get aggressive and go on the offense.  This is generally the way to go when you're opponent has the advantage.  Pretty much, as what Ken also noted, the only thing you can do when at a disadvantage is play Hope Chess.  As now, you can only hope that you're opponent will go wrong somewhere and make a terrible mistake that will allow you to pull a swindle and win.  But, I wasn't going to allow that as I still have plenty of time on the clock.  Although I forgot time control difference, I had about, 25-30 minutes left which is certainly more then enough.  I also know that he's gonna continue to move real quick, since that's Carl.  And, I'll continue to take my time and look for ways to exploit his weaknesses.",
        "14... Qd4 15. Bc3": "Still hoping that I go wrong, Carl attacks again.  But, I have a ready answer for that.",
        "15... Qe3+ 16. Kb1 e6": "And, it's with this move since it will allow me to complete my development.",
        "17. Rfe1": "Going after my Q.",
        "17... Qc5": "And, I partially pin his Bc3.  It's not pinned but by partial, I mean that he'll forced into more liquidation if it moves which I know that he doesn't want to do.  Tom breaks with his next move, and I answer by trying to liquidate again.  What it really is by trying to liquidate is me putting more pressure and tension against Carl.",
        "18. Qa4+ Qc6 19. Qb3": "Not surprisingly, Carl refuses liquidation.",
        "19... Bd6": "? I became a little careless and played this move to complete my development and prepare to castle.  However, Carl will stop that.  Not only that, but this move hands him back a pawn which is something that I didn't want.  Better, I believe, was 19...Rd1 since it centralizes one of my R's.",
        "20. Bxg7 Rg8 21. Rhg1": "Carl could've retreated his Bg7, but this was his best move.  I'm still thinking very hard of what to do now.",
        "21... Bc5": "And, I decided to go back on the offense here.  I want to see how many tempii I could take away from Carl.",
        "22. Rg4 Bf2 23. Rc1": "It was 2.  But, I have something else up my sleeve.",
        "23... Qd7": "? As I plan to do something against his back rank.  As with a previous game, and for the first time in a long while, I start to visualize here which, indeed, turns into blindfolded chess.  Unless you have enough experience, this isn't recommended because it's very easy to go wrong since one can forget look in between the lines.  However, this is proof of my progress which doesn't show on my GK rating since it's about the same as it was then.  And, unlike before, I analyze through when it's his turn to move to see if his works.  The reason for doing it when it's white to move is that, at this point, I have a lot less time then Carl.  As now, I have about 20 minutes against his 40.  Now, that is, in general, more then enough time.  But, what's important to remember is that I have special needs, so as with exams, it takes me more time to do things then average.  So, this, for me, is an accommodation since during his moves, I'm also using those Yoga breathes while calculating in between the lines to keep calm and prevent the, \"Fight or Flight\" syndrome from developing.  Overtime, it's built up my confidence, and occasionally, too much, like my games against Ken.  But, I'd rather be too happy about my position and lose from overconfidence then lose because I got nervous and start rushing, which has also happened before.  Most of the time, this attitude has resulted in better play, and about 50% directly led to me winning games, such as this.  However, although I calculated through the lines during most of the visualization, I forgot one thing which is my b pawn en-prise, allowing Carl to win back a second pawn, out of 3.  Better would've been 23...Qd6, but I also knew, however, that it was only a matter of time before Carl made his final blunder.  In fact, it happened even sooner then predicted and became, more or less, what I visualized occurring with this move which was a back rank mate.  ",
        "24. Qxb7 Be3": "But, this is where I look in between the lines.  As I had considered 24...Rd1? which runs into 25.Rxc7 and if 25...Qd1+ white is well protected and has the advantage with 26.Rc1  So, as with Michael, during the end of our game, where he hit my N, I decided to do the same thing on Carl's R.  As after it goes somewherelse, in this case, against my B, I can and will take Carl to a place where he won't be protected for long.  Of course, he can still prevent mate, but not for long.",
        "25. Re1 Qd3+": "It starts with this move.  The first thing I kept in mind was how to mate with both of your B's.  And, it wasn't with a B+B endgame checkmate either.  Yes, a certain someone told me how, but what I didn't realize is that you could with just your B's, well before the endgame.  I learned this from GM Susan Polgar.  And, although I don't have both, I converted the equation here since my Q acts in a similar form to the LSB because it's covering the same diagonal since Carl's next move is forced which will give him some trouble on the back rank and will lead to mate sooner then later.  ",
        "26. Ka1 Rd8": "As now, I bring the R forward which was also the plan behind 23...Qd7.  However, right after this, the position starts to become corrupt. ",
        "27. Rg3": "As I had notated 27.Re1, but the R was there.  So, this was the only move where I was trying to figure out what he played.  As other things were recorded, but as I look back, what I have on this board is, exactly, how it ended since I visualized this pattern.  Afterall, what I have notated ends in mate and in the same amount of moves.  It was just with this move.  But, I am almost certain (95% sure) that Carl played this because he was concerned about my Q, and the idea is that if I move it my B falls.  What I had notated then is that the B moves and with the Q there's mate, but that didn't happen since it would not be possible to reach it in only 2 moves and he win my B right away and with the advantage.  And, that's when I remembered that I got him on the back rank.  So, his idea was most likely pinning the B.  Better, however, would've been to try and equalize with 27.Qxc7 I would've then answered with 27...Qd2  And, Carl would still be lost, as he'd be forced to give up his Q in order to prevent mate.  But, with this move, I kept in mind a chess puzzle from GM Judit Polgar where she gave up her Q for R in the same way to mate in the same way.  I also saw an example of this from brigadecommander, as she used the same technique against one of her students.  In fact, that's why I was able to visualize this occurring my 23rd move.  And, it was, exactly, how I visualized it.",
        "27... Qd1+ 28. Rxd1 Rxd1#": "After this game, Jack of course, asked who won.  And, he said that we moved a little too quick.  I told him how much time I had which was about 16.  But, I mentioned that Carl lost in only 10 minutes.  That's when Jack lost it and, sort of yelled at Carl by saying, \"I'VE TOLD YOU MANY TIMES BEFORE AND I'LL TELL YOU AGAIN.  SLOW DOWN AND TAKE YOUR TIME.\" "
    },
    "url": "https://gameknot.com/annotation.pl/otb-tournament-game-4?gm=66565",
    "gameName": "OTB Tournament Game 4",
    "players": "Carl  vs. Joe ",
    "opening": "Reti opening (A04)"
}