{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Bb5": "Not surprisingly, Jack opted for the Spanish Opening.  The reason I was going to play it is that I'm most used to it.  ",
        "3... a6": "For a while, Carl didn't know what to do.  In fact, he was inclined to play the Berlin Defense.  Jack said that it was a good move and nothing wrong with it.  But, this move, however, is more common, so his advice was to play it since his idea is playing moves that are most analyzed by masters and grandmasters.",
        "4. Ba4 Nf6": "Jack also told Carl that he could hit my B again but he wanted to Carl to continue developing.",
        "5. O-O": "So, I play it as though Carl played the Berlin Defense.  In fact, this could be a transposition into just that because after 4...Nf6 5.0-0, I seem to remember playing one game that then followed with 5...a6 6.Ba4 b5 7.Bb3.  Well, we're seeing the same thing but in a different order.  So, it's certainly a transposition, and I believe that it is with the very same defense.  The real reason behind this move is because of what Carl wants to do.",
        "5... b5": "As he was about to play 5...Nxe4  But, as noted, you have to think of this like a training game with Kenneth_fiore_3.  That's because Jack didn't allow Carl to capture on e4.  He said that taking there would be a mistake since white can answer with 6.Re1.  Afterwhich, I'd have the advantage.  Well, I don't completely agree that I'd get an initiative, but rather, I'd call it even since those moves have been played before.  In fact, cplusplus11 showed me an example, and I believe that game ended in a draw since it's all in book, and therefore, blends in theory.  With that being said, had he taken, I would've stayed in book by centralizing the Rook on e1.  Therefore, he told Carl to play this.  After which, as noted, it has transposed, and possibly into the Berlin Defense.  But, what I do is that this is interesting.",
        "6. Bb3 Bb7": "Not surprisingly, Carl takes advantage of his fianchetto.",
        "7. Ng5": "Not really sure what to do, I decide to threaten Carl's f7 pawn because of what I learned from TA.  And, what I apply to teach my students from his blitz Q sac is what GM Susan Polgar previously mentioned based on how important the f pawn is.  So, I target that square.",
        "7... d5": "Not surprisingly, he defends.  And, Jack gave this as his best move.  Right now, I must exchange to avoid losing a pawn.",
        "8. exd5 Nxd5 9. Bxd5": "But, right here is where my thought process and judgement starts to go down.  It's actually something that Ken has seen before.  Similar to another game, I didn't know what else to do.  Therefore, without thinking twice about it, I just exchange.  And, yes, I am back to doing it just because it is possible to do so.  The problem to is that I didn't give this time, either.  As after Carl takes back, I will harass the Queen which is just something that I enjoy doing.  For, had I taken a little longer, I would've either fianchettoed with 9.b3, or I might have developed with 9.d3.  The thing, however, is that nothing came into consideration, aside from this move.  It was right here that I start becoming impatient.  I think the reason behind is that I was still upset about all of the insults towards TA that it took away all of my concentration.  This is also why after complaints were made, I made the personal prayer that GK would suspend that club which is what happened.  As those kinds of things and getting all upset after a club war or insults towards a good teacher and friend has gotten the best of me.  That is what happened here. ",
        "9... Qxd5 10. Nc3 Qd8": "But, what I forgot is that it doesn't give me time to continue developing right away since my Ng5 is attacked.  ",
        "11. Nf3 Bd6": "As now, Carl is the one ahead in development.",
        "12. Re1": "And, with an added defender, I decide to centralize my Rook at once.  Jack told Carl that this is no worry, as it can be easily dealt with by castling.  As usual, I agree with coach Stockel.",
        "12... O-O 13. d3": "Which I anticipated, as now, I open up a diagonal for my Bc1.",
        "13... Re8": "That, however, gives Carl to defend again by centralizing his Rook.",
        "14. d4": "As bad as it sounds, I didn't give a lot of thought either.  In fact, it was only very slightly more then before which led to the previous exchange.  But, the only thing that I was thinking about was preventing Carl attacking my Nf3.  The problem is that I was impatient enough to overlook that this wasn't possible because of my Nc3.  By doing this, the exchanges favors black.  And, I also didn't give mobility enough consideration because what happens here is very similar to what occurred with my second game against Ken.  With better mobility, black is going to win a piece with, at most, a pawn in return which also favors Carl.",
        "14... exd4 15. Nxd4 Nxd4 16. Rxe8+": "Still being upset with those insults, as noted, I figure that I'll just exchange again.  And, the only reason is that Carl is in check.  I think part of it is given that I can't take his Nd4 which was my plan.  So, not thinking about it hard enough, I figure that exchanging is the answer to all of my problems since nothing else came into consideration here either.  The problem is that it does not fix my problems either.",
        "16... Qxe8 17. Be3": "As I couldn't take on d4, due to the threat, I decide to add an attacker with my LSB.",
        "17... Qc6": "But, Jack recommended this move to Carl.  Believe it or not, I almost made a blunder, as 18.Bxd4?? came into consideration.  In fact, I was very close to playing it, but then, I saw the threat that Carl has against me.  And, I weighed it in with what I learned from GM Susan Polgar which is also something that Jack mentioned in a loss against Tom Walsh.  And, it boils down to what your opponent wants to do.  In this case, Jack wants me to take to allow the mate.",
        "18. f3": "But, I saw it and put a stop to it.  Jack said, \"Oho, you saw that threat.\"  And, I said that I'm not going to allow the mate against me since K safety is vital.",
        "18... Nxf3+": "So, Jack recommended this move.",
        "19. gxf3": "Feeling that the glaucoma might have gotten the best of Jack, as it did in my first game with Carl, I recaptured this way.  As it appeared to win back what I lost.  But, what I overlooked is that it's really not compensation since I'm down a piece for a pawn.",
        "19... Qxf3 20. Qxf3": "As now, I'd like to avoid liquidation with his material advantage.  But, there are no choices as mate was threatened.  The only other option was 20.Qd2, but then black would've exchanged, anyway.",
        "20... Bxf3 21. Rf1": "So, doing what can be done for counterplay, I attack his Bf3.  I am not surprised that Carl retreats back to b7.",
        "21... Bb7 22. a4": "But, I am determined to exchange pawns with the hope of getting passed pawn.  As the idea is to push pawns and not pieces.  Of course, what's causing me to be impatient is the same thing as before.",
        "22... bxa4 23. Nxa4 h6": "With a potential threat against black, Carl opens up here.  Of course, the other big plan is a pawn chain, where Carl would get an unstoppable passed pawn.",
        "24. Rf5": "Thinking about mobility, I decide to put pressure on the fifth rank.",
        "24... Re8": "But, Jack will have none of that and advises Carl to attack my Be3.",
        "25. Bc5": "I'm fine with that and try to come up with an attack starting with liquidation.  Although, I overlooked something which makes liquidation still harmful.  The problem is that I'm too comfortable with my position here just like with my second game with Ken.",
        "25... g6": "Therefore, as the idea was using my Rook, it was counterproductive as now, my Rf5 is no long of help since it can't stay on the fifth rank.",
        "26. Rf2 Bxc5 27. Nxc5 Rb8": "The entire plan behind exchanging was attacking his Bb7 and trying to put comprises.  The plan though did not work since this move is powerful.  And, that's combined with those dangerous passed pawns.",
        "28. Rf6": "So, I try to put pressure on his a6 pawn.",
        "28... Bd5": "And, I overlooked this discover attack.  As I grab his a6 pawn.  Being, as noted, too comfortable, my thought was, yes, I'm finally getting some compensation by winning this pawn.  I was partially correct since 30.Nxc7 will be played.  But, there is no reason to be happy yet.",
        "29. Nxa6 Rxb2 30. Nxc7 Be4": "As Carl win my c2 pawn.  Which therefore means that the compensation is only temporary.",
        "31. c4": "Doing what I can to promote, I push the c2 pawn since the idea is that passed pawns must be pushed.",
        "31... Kg7": "So, Carl attacks my Rook, in return.",
        "32. Ne8+": "But, I had an answer to that since my Rf6 is protected by the very piece that delivered the check.  In fact, that was the logic behind this move.",
        "32... Kf8 33. Nd6": "As now, not only is his Bishop attacked, but I will take his f7 pawn with check.",
        "33... Bd3 34. Rxf7+ Kg8 35. c5": "After which, I continue pushing my passed pawn.",
        "35... Rb1+": "I am not surprised to see a check thrown at me.  But, I get out of it by attempting to centralize my monarch.",
        "36. Kf2 Rc1": "Not surprisingly, Jack is after my c pawn which is why he recommended this move to Carl.",
        "37. Rf3": "So, I attack the B.  Therefore, Jack told Carl that he doesn't have to win the pawn right away.  Instead, it can wait since the idea is not letting me get the Bishop.  As the idea behind it is not allowing white to get anything else.  That's because even though the position appears even material wise, black certainly has an advantage.  I am hoping that there is a miscalculation which will turn it the other way or end the game in a draw.  But, that isn't so since black is keeping the advantage.  The reason for his advantage is because his g and h pawns are dangerous.  In fact, those are the killers.  With two isolated pawns against his connected pawns, black has the better end of it.  Now, had I stuck to this game and not let the anger get to me, those exchanges would've been refused.  And, I believe that it would've been level.",
        "37... Rc2+": "With that being said, they decided to place this check on me.  The idea is that he's going to get win a pawn without anything in return.",
        "38. Ke3": "Once again, I try to stop that by attacking his Bishop.",
        "38... Ba6": "But, it's of no use.  ",
        "39. Kd4": "Therefore, it was a choice between my h2 and c5 pawn.  But, I let Carl take on h2 since my passed pawn is on the c square.  Now, it's similar to Hope Chess as I'm hoping that black makes a mistake and allows me to promote my c pawn.",
        "39... Rxh2 40. Ra3": "So, I attack his Bishop.  And, I'm faced with the upcoming checks which is of no concern to me.",
        "40... Rh4+ 41. Kd5 Rh5+ 42. Kc6": "And, that is by keeping my c pawn protected given that Carl's Ba6 is still attacked.  After defending it, I come up with a different hope which is not Hope Chess yet.  But, it will become that towards the end, as we'll see.",
        "42... Bf1 43. Ra8+": "After seeing what has happened to me in a couple of games, combined with what Susan Polgar showed in a stalemate lecture that would end the game in draw by repetition instead, I attempted the same idea.  That's right, I'm trying to trick to black into a draw by repetition.  And, that's by checking on the seventh and eighth rank.  Jack even asked me what I'm trying to do, and I told him that I thought that this might be a draw.  So, I persist on these checks.",
        "43... Kh7 44. Ra7+ Kh8 45. Ra8+ Kg7 46. Ra7+ Kf6": "But, Jack has had enough, and he told Carl that he's not ready to let white off with a draw yet.  I thought that it was forced but overlooked that the K could go on the sixth rank.  Besides which, it wasn't a draw because black's position didn't repeat themselves 3 times the way that white's position did.  But, that was my attempt which didn't work, and having enough checks he decided to play this.",
        "47. Ne8+": "However, I missed the that would've resulted in a swindle.  It was due to Tunnel Vision because I thought that my N was on a different line from black's King.  Therefore, I thought that if Rf7+, he could take the Rook but forgot that it was protected by the N. Therefore, best was 47.Rf7+.  And, now it goes from a disadvantage to win for white.  It was due to a similar fork that GM Susan Polgar showed in her book of Chess Tactics for Champions.  As that Bishop would've been free.  In doing so, I would've been able to move my Kc6 and promote the passed pawn.  And, Carl wouldn't have been able to stop it in anyway.  With this move, white is lost because black will stop it with his Bishop.",
        "47... Ke5 48. Kd7": "Still attempting to promote, I free the c5 pawn.  As noted, had I check with the Rook and then captured the B, I would've been successful.",
        "48... Bb5+": "As now, this check also favors black.",
        "49. c6": "So, I blocked it here.  But, Jack accurately said to Carl that my pawn is now pinned, and thus, of no use.",
        "49... Kf4 50. Ra5": "?? With that, I attack his B.  But, this shortens the game even more because it will allow Carl to win a pawn and Rook for a Bishop.  Now, it is lost.",
        "50... Bxc6+ 51. Kxc6 Rxa5 52. Ng7": "So, it officially becomes Hope Chess.  Up until recently, I'd resign at this point.  But, I decide to let Carl promote and see where it goes from there because of what I remember from GM Susan Polgar.  The reason why it's Hope Chess is that mate will be inevitable, unless Carl messes up.  But, if he does that, I could still pull a swindle and get a stalemate.  I've seen examples from Susan where one side is even further ahead then black will be, even after he promotes.  But, Jack said that I have no hopes and implied that there will be no mistakes.  I don't completely trust him since he some time ago made a mistake that allowed me to checkmate in a hopelessly lost position.",
        "52... g5 53. Kd6 g4 54. Ke6 g3 55. Kf6 g2 56. Kg6 g1=Q+": "With what I mentioned, I was still hopeful here.",
        "57. Kxh6 Qg5+": "But, that came to an end here.  In fact, Jack asked me how I was going to avoid checkmate here.  The answer is that it's unavoidable here.  That's because my monarch is stuck in the corner.  So, after 58.Kh7, Carl can just leave the Queen there and play 58...Ra7.  After that, my N is pinned, and thus, forces 59.Kh8.  From there, he'll checkmate with 59...Qxg7#  Seeing all of that, I resigned here.  I think the important lesson is that even if something happens that makes you angry, you shouldn't let get it you in a game.  Since that will affect one's judgement as it will happen to me.  For example, that's the main reason why I went back to exchanging just because it was possible to do so.  As otherwise, I would've been more patient and held off.  But, the other lesson is that opportunities only last a shortwhile.  And, had I play 47.Nf7+, I would've been back in the game with an advantage.  But, by missing that followed by another inaccuracy, it was over for white.  Well, after this game, Carl and I played one more which remains unfinished as we ran out of time.  But, Jack still took the time to coach like he did with these two games."
    },
    "url": "https://gameknot.com/annotation.pl/otb-mentoring-game-2?gm=62813",
    "gameName": "OTB Mentoring Game 2",
    "players": "Joe (1293) vs. Carl ",
    "opening": "Ruy Lopez (C78), Archangelsk (counterthrust) variation"
}