{
    "moves": {
        "1. e4": "Before we started, the starting position was in reverse.  So, as you'd expect, black's pieces were on the 1st and 2nd rank, whereas, whites was on the 7th and 8th rank.  Were this a casual game, I would've let it go.  But, since this was a tournament game, I decided to change things up.  Tom wasn't crazy about that, as he just wanted to start.  But, I sort of, insisted on it, and I told him that the reason this needs to be done is so that I can notate this game.  When I said that, he said, \"Ok, whatever floats your boat.\"  Of course, the idea behind the notation is that I then turn it into an annotation using the PGN notation for analysis with ION.  So, Tom starts off with the usual which I'm most used to.",
        "1... c5": "And, of course, I answer with the Sicilian.",
        "2. c4": "Were this against anyonelse, I'd expect 2.Nf3 to allow 2...d6.  But, I know Tom's style of play, and this is how he responds with the Sicilian.",
        "2... d6": "Of course, I still like this in the Sicilian and stick with what I know, as Terence put it.",
        "3. d3": "I, however, have not seen this move by him.",
        "3... Nf6": "But, that does not stop me from playing my usual.",
        "4. Bd2": "Meanwhile, Tom continues developing.",
        "4... g6": "And, I fianchetto, right then and there.  I'd normally hold off and play 4...a6 to prevent a later Bb5 or Nb5.  Well, Bb5 isn't possible anytime soon, and white's a long way away from playing Nb5 since his Nb1 remains undeveloped.  Keeping all of that in mind, I focus on my K side operation since the idea behind this is to castle, ASAP, and find a strong outpost for my Bf8.",
        "5. Be2": "Meanwhile, Tom continues with his development.",
        "5... Bg7": "And, I prepare to castle, at once, by completing my fianchetto.",
        "6. Bc3": "Trying to put pressure on the h8-f6 diagonal.",
        "6... O-O": "But, it doesn't work since I don't feel it any of that.  In fact, I feel happier about my position then I did a very short while back.  So, I get to and bring my K to safety.  Afterall, this was an important part to the plan behind my fianchetto.",
        "7. Nf3": "Tom is thinking along a similar line and continues with his development.",
        "7... Bg4": "Because he tried to put pressure on my N, I try the exact thing on his N.  I also kept in mind that it continues with my development.",
        "8. h3": "But, it also doesn't work because he sees it and attacks my B, instead.",
        "8... Bd7 9. e5": "And, that's when he attacks my N.  But, I answer by exchanging his center pawn.",
        "9... dxe5 10. Nxe5": "Tom also could've recaptured with his B but is interested in exchanging my B.",
        "10... Bf5": "I tried to prevent that with this move as d3 is now half pinned because if he moves it, I would've considered exchanging his Nb1 for my B.  However, that wouldn't have been a good way to handle things since his Nb1 is less active.  But, during our game, I thought it was more active, as I was worried about Na3-b5 which is what I wanted to prevent.  However, I forgot that if Tom played Na3, ...a6! would still be a very good response.  Then, I saw a better move before I even realized that his Nb1 was less active.  Thus, had Tom played 11.d4? which is what I was hoping he'd do, I would've played 11...cxd4!, in response winning a pawn.  Of course, if he recaptured, I'd win a piece, but if he didn't, that pawn would become dangerous.",
        "11. g4": "But, Tom, saw that, and as I thought, slowed down a little here.  He'll slow down in a situation like this since he learned that I've been known to use his own speed against him which can't be said for Carl.",
        "11... Bd7": " I moved a little too quick here as this allows Tom to exchange my DSB for his N.  But, it works out.  Had I been I spent a second or two longer, I would've played 11...Be6.  I refrained from that because I didn't want to block my center pawn which I corrected one of my students for doing.  However, exchanging works because his Ne5 was more active then my DSB, anyhow and was something worry, whereas, my B was not.",
        "12. Nxd7 Nbxd7": "I also could've recaptured with my Q, but I played this to complete my development.",
        "13. Nd2": "In the meantime, Tom continues with his development.  And, I'm starting to think about what his N might be capable of doing.",
        "13... Bh6": "So, like what I saw with kenneth_fiore_3, I decide to put a little bit of pressure on his monarch.",
        "14. Qb3": "But, this does not concern Tom.  I can relate to that because I wouldn't feel any pressure, as white, either.  But, he mobilizes the other side to attack my b7 pawn, and it allows Tom to castle on either side which makes for interesting play.",
        "14... Rb8": "Of course, I protect the pawn.  I also considered 14...b6, for a short while.  However, I thought that it would put my Q out of play, as it's mobility would be very limited, similar to what happened against bhidragon.  Wanting to maintain the mobility of my Q and leave with a lot of options, in addition to, keeping it in play, I decided that this move was my best bet.",
        "15. O-O-O": "Long and behold, Tom castles on opposite of wings of me.",
        "15... a6": "Preventing Tom from playing 16.Qa4 which I thought would win a pawn, as now, a7 would be attacked.  So, in order to defend, I'd have to play 16...Ra8  However, bringing the Q back to the b square would also cause me to bring the R to the b square, so there was no worries, actually.  However, this does give me connected pawns, or as I call it, a weak pawn chain.  As noted in Erika's annotation, it's not a solid chain, but might eventually become one.  My plan, as of now, is to play a later ...b6, followed by ...a5 which would, at some point, turn it into a solid pawn chain.  The reason I refrain from doing so now, is I'm also thinking about what my Nd7 can do, where it can go.  In fact, I would've eventually played ...Nb6.  But, what kept me from doing so is that white would have the option to pin with Ba5.",
        "16. Kb1": "But, then Tom played this, and that changed everything.  Afterall, I don't see the point behind this move since there's no immediate threats.  And, it's not an endgame where the K becomes useful.",
        "16... b5": "Viewing his move as pointless, I decided to advance right away, as I thought I could overwhelm him.  My plan was to play 17...b4 which would trap his B and force him to exchange for my Nd7.  As ...Nxe5 would bring my N to a better square, and I thought there was no way around it.  That was...",
        "17. Ne4": "Until he played this, as now, he can bring his Bc3 back.  So, I thought about what to do here.  ",
        "17... Nxe4": "I would've just attacked with 17...bxc4 at once, but I exchanged first to put pressure on his Bc3 and threaten to win his f2 pawn and fork his R's.  Although, I knew that he'd recapture with the pawn.  But, the main reason is because after 17...bxc4 18.Qxc4, if I play 18...Nxe4 he'd be able to recapture with the Q which would leave it better placed.  By playing this, however, I thought that I could weaken his position.  And, the reason for me doing this was still an attempt to punish him for playing a move that I considered pointless.  By that, I'm alluding to 16.Kb1 which probably wasn't, anyhow.  The problem with this move, however, is that it allows him to pin my Nd7.  So, better was to capture on c4, first.  But, I don't think it would've made much difference, as 17...bxc4 18.Qxc4 Nxe4, I still think that he'd capture with the d pawn, as opposed to, the Q due to the pinning motif.",
        "18. dxe4 bxc4 19. Qxc4 Ra8": "Instead, I had things to worry about, like my a6 pawn.",
        "20. h4": "Trying to trap my Bh6 since Tom's threatening 20...g5 which wouldn't be bad since I could exchange.  ",
        "20... Bg7": "?! I didn't think about this hard enough.  My goal was to exchange and start using my K.  Whereas, I didn't see the point earlier, we are nearing the endgame now and getting to the point where the K could be a useful.  Plus, I didn't see a way to prevent exchanging B's.  But, I should've considered and then played 20...Bf4  As exchanging was not to my benefit here, especially since, Tom is happy to do it.",
        "21. Bxg7 Kxg7 22. Qc3+": "I wasn't surprised to see him place me in check, here.",
        "22... e5": "And, I decided to interpose with my center pawn.  I also considered 22...f6 but didn't feel like advancing my f pawn.",
        "23. g5": "Threatening 24.h5 which gives more attackers if I answer with 24...gxh5  As after 25.Rxh5 I thought that he had a threat against my K which really wasn't something to threat about as everything was protected.  But, I tend to get paranoid about my K becoming exposed, and in this case, being paranoid is what costs me the game.  Better was to allow it.",
        "23... h5": "?? As I played this.  My hope was that Tom would capture en-pessant, as then I studied some variations which do occur.  But, I thought that was going to win material, when all was said and done.  However, I miscalculated something which will allow him to win material.  At the end of our game, Jack for the first time in a long while analyzed it and said that allowing Tom to advance was the losing move.  And, Master Nathan Resika then commented and said that allowing him to capture en-pessant was what allowed it.  He then said that enabling by advancing this pawn was what costed me the game.  Well, this was the move that did it, so this is, the losing move.  Nathan said that up until this move, I was fine, although I think that white had the better of it.  But, I wasn't lost, until this point.  Much better would've been 23...h6, as after exchanging, things are still quite level. ",
        "24. gxh6 e.p.+ Kxh6 25. Qe3+": "I still thought that I was ok here, but that's not so.",
        "25... Kh7 26. h5": "And, that's because of this move.",
        "26... Rb8": "I just begin to realize that I'm in trouble.  As I had considered 26...gxh5, but 27.Rxh5+ would result in a mate in 3.  As I must move my K back to the g square which allows 28.Qh6, and mate can't be prevented.  Knowing what I've done now, I try to target his K and think about how I could, potentially, threaten mate since a later ...Qb6 came into consideration.",
        "27. hxg6+": "But, it's too little, too late.",
        "27... Kg7": "Were it not for 28.Qh6#, I would answered with 27...Kxg6?? which I considered.",
        "28. Qh6+": "By doing things this way, I was able to prevent an immediate checkmate, but make not mistake, black is still lost with best play, as noted above.",
        "28... Kf6 29. g7+": "Believe it or not, I was doing a little bit of Hope Chess and hoping that he'd make mistake with 29.gxf7+?, allowing 29...Kxf7 with, still, a decent position for black.  But, I didn't think that I'd be successful, as this is what I anticipated.  Despite me beginning to realize what's going on, I still thought that I was ok after he promoted which is bound to happen.",
        "29... Ke7": "In the meantime, I still do what I can discourage Tom from Queening.  As I was still playing Hope Chess by Hoping that he'd make a mistake with 30.gxf8=Q+? right away.  In fact, I anticipated something like this, after he captured en-pessant and started advancing the pawn.  That's why I went ahead with 23...h5??  I didn't think it would work but also didn't see a good move.  So, I thought that his g7 was stuck where it was.  With that, I thought that he was going to play 30.Bh5 in an attempt to put pressure on my f7 pawn, with which, I'd answer with 30...f6, right away.  But, I overlooked his next move, as I didn't see 30.Qd6+!!.  And, with it, everything changes now.",
        "30. Qd6+ Ke8": "As, now, there's nothing that I can do stop Tom from promoting.",
        "31. gxf8=Q+ Nxf8 32. Qxd8+ Rxd8 33. Rxd8+ Kxd8 34. Bxa6 Kc7": "Except for the a6 pawn, I thought that everything was still level, and felt ok for a little.  As one can compensate being a pawn down.  But, then, I counted everything of what he had and I had.  And, then I realized that things were not ok, as after looking at what I lacked v. what he had, I quickly figured out that I'm a R+P down.  There's no way out of it, so that's when I started that black is lost.  My only hope for any form of counterplay is that Tom spends too much time looking for a win and times out, as something happened with World Champion Magnus Carlsen, about 2.5-3 years ago.  But, that's not going to happen now.",
        "35. Rc1": "Having said that, Tom now goes after my c5 pawn.",
        "35... Kb6": "And, I protect, and go after his Ba6.",
        "36. Bc4": "So, Tom goes after f7, which I'm also about to protect.",
        "36... f6 37. Rd1": "I'm not sure why Tom played this, but I think he's trying to go after my Nf8, and for sure, he wants my f6 pawn..",
        "37... Nh7": "But, I put a stop to that, for now.",
        "38. Rd6+ Kc7": "Of course, I'm doing what I can for counterplay by going after Tom's pieces, with no avail.  The idea behind it is trying to figure out what I can with some of my pawns, but the answer is nothing.",
        "39. Ra6 Kb7 40. Re6 Kc7": "?? This loses another piece.  Best was 40...Ng5, but I was lost either way.  My focus was on trying to attack the R, but even if I brought the N, he has 41.Rxf6 and after 41...Nxe4 42.Re6 allows him to win another pawn because my N and e5 pawn would be on the same file, as the R.  The only thing I'd be able to hope for is wearing down his time which, I don't think, would work that way, either.",
        "41. Re7+": "Despite that, I wasn't ready to resign, yet.  The only reason is because I was still hoping that I could time him out.  At first, I thought it was about even, but perhaps he had a minute.  For sure, we both took our time and don't have that much time.  But, after seeing what happened with Carlsen, I knew that there was chance, but very slim, that he'd use up all of his time trying to force a win and timeout.  About a move or two later, I looked again, and he had more then just a minute over me.",
        "41... Kc6 42. Rxh7 Kd6 43. Rh6": "With that, I resigned here.  First, I'm way behind with, pretty much nothing left.  More importantly, it's the fact that he has more time then me.  So, when all was said and done, he had 22 minutes left, which isn't a lot.  But, I had only 17.5 minutes left.  Well, first he's going to win my f6 pawn, in addition to, what I've already lost.  However, before he could continue, and perhaps promote or checkmate me, I'm going to lose on time.  So, with no way to prevent a timeout, and knowing a win is not far off, I threw in the towel.  Tom told me that, overall, I played extremely well, until the very end.  Jack, said that it was a very interesting game.  But, allowing Tom to break through with the pawn is what sealed my fate.  Then, Nathan said that this happened when I allowed him to capture en-pessant.  By that, he implied 23...h5?? which is, indeed, what sealed me fate.  As after breaking through and promoting, Tom was able to win too much material for me to have the slightest chance of counterplay."
    },
    "url": "https://gameknot.com/annotation.pl/otb-tournament-game-2?gm=65937",
    "gameName": "OTB Tournament Game 2",
    "players": "Tom  vs. Joe ",
    "opening": "Sicilian (B20), Gloria variation"
}