{
    "moves": {
        "1. e4": "So, I start with my usual.",
        "1... e5": "As does she.   After which, as with anyonelse, it often becomes the Ruy Lopez, and this is not an exception.",
        "2. Nf3 Nc6 3. Bb5 Bb4": "I wasn't sure what to do since it's not normal.  Yet, she didn't play 3...Bc5.  But, I remember yet reversion told me about 3...Bc5 which is 4.c3, followed by 5.d4 since that would late kick the B and we'd use tempo gain for the pawn chain.  Well, I wasn't sure about the pawn chain, but I decided that reversion's advice applied here more then anything else.  In the process of gaining tempo, black will face some pressure.",
        "4. c3 a6": "?? Which is not handled.  In fact, I mentioned that this is a blunder.  And, better would've been retreat, as now, I'll exchange on c6 after which, white wins a piece for free.  However, I understand why this mistake was made.  That's because the student said, \"Let's play a fast one.\"  Now, I'd normally, tell her to take the time she needed, just like what Ken did with me when we were playing.  But, this time, I had to say yes, as we didn't have that much time.  It was starting to get close to noon.  It was 15 or 20 minutes prior to, and we both have to leave right at noon.  That's because she needs to get a lunch and I forget what else it was.  But, I've got to ready for work since the shift started only 2 hours after it ended and figure that I need to eat lunch and get dressed up on top of that.  So, it's understandable how and why it happens.",
        "5. Bxc6 bxc6 6. cxb4": "In fact, she said that it was a terrible mistake, and I had to nod.  For the same reason, there really wasn't enough to analyze.  So, somewhat similar to my rated game with bhidragon, we had to just play.  Which means that there was very little that I could do for coaching which is why I only said OTB Game 2, as opposed to adding the coaching so OTB Coaching Game 2.",
        "6... Nf6": "Developing a piece.  But, now without a lot of time, and thus, not much time to think, I'll treat, as though, it were a Petrov which starts off with 1.e4, e5 2.Nf3, Nf6 3.Nxe5, Nxe4.",
        "7. Nxe5 a5": "She missed the better move which would've been 7...Nxe4 at once.  But, it's not too late to get the pawn.",
        "8. bxa5 Rxa5 9. Nf3": "The N was attacked which is why I protect.  But, this is where she'll get it back.",
        "9... Nxe4 10. Qe2": "Taking advantage of being ahead, I directly pin her Ne4.",
        "10... Qe7": "Which she breaks.  To prevent the Queen from being pinned and my desire to get the K to safety, I don't hesitate to castle, at once.",
        "11. O-O Ba6": "I did, however, overlook this move, which in general isn't good.  So, I ask myself what can be done about the skewer since Mariann is threatening to win material.  Not sure what to.  But,  I found the next move which not only keep my pieces protected, but her N will be attacked, at the same time.  Now, she's faced with more pressure.",
        "12. d3 Nd6": "So, she protects.  And, I will not hesitate to liquidate Queens.  Not only do I exchange, but this will lose castling rights for Mariann, at once.",
        "13. Qxe7+ Kxe7 14. Re1+": "After which, I take advantage of my opportunity to centralize the Rook.  There's to it then that.  As now, I'm exploiting her weakness of not being able to castle, as it appears that her King is exposed.  The issue is King safety which I can and figure that I've compromised.",
        "14... Kd8 15. Bd2": "After which I attack her Rook.  Due to time management, I'm not surprised that Marriann overlooked it.",
        "15... Re8": "?? As better would've been to retreat her Ra5.  Not only is this going to lose another R without compensation, but before that, I'm going to liquidate her other Rook to fully take advantage.  The reason being is that she'll be in check with 16.Rxa8+ and after she takes back, that's when I'll capture her Ra5.",
        "16. Rxe8+ Kxe8 17. Bxa5 Bxd3": "After which, probably thinking that she's gotten a little compensation, as that's how I once thought, she took here.  But, I'll recapture on c7. And, when that happens, her Nd6 will be attacked.",
        "18. Bxc7 Ne4": "Which she defends.",
        "19. Nbd2": "Given that she's this far behind, I attempt to liquidate further.",
        "19... Nc3": "?? Best would've been 19...Nf6 to avoid liquidation.  She saw a lot of things but overlooked my b2 which is understandable as the time continues to fade away.  In fact, we were down to about 10 minutes after this move since it's almost noon.  But, I am going to get the N for free.  And, when that happend...",
        "20. bxc3": "She resigned.  The reason why there wasn't much in the way of coaching is that we, just about had to leave after this game.  To be exact, there was only 8 minutes before I had to go, and Marriann had to leave a little earlier.  I did do a very small amount of analysis, in which, I said that her first blunder occurred early with a piece.  But, being short on time there wasn't much that could've been done to avoid the mistake.  My main analysis happened in our first game while we were putting the pieces and pawns (or what I call setup away.)  And, I know where her blunders were.  But, we can agree on one thing, that Mariann made these blunders due to being short of time.  There's not much advice that I can give for that since it was a problem for me, until last week.  In fact, that affected me even worse then other games prior to my training game with Kenneth_fiore_3 which is how the coaching started.  I guess, maybe ignore the time crunch.  That, however, only works for me where I don't let it get to me, anymore.  If, however, she did that, the game would've timed out.  So, think of it like here when someone times out.  The difference there is that isn't lost, but instead, the game would've remained unfinished since there wouldn't have been enough time for either one of us to finish the game.  I like her OTB style of play and that's actually a little slower then I play.  It doesn't mean that I rush, but she'll sometimes take 15 or even 20 minutes before a move.  The only issue is that we didn't have that kind of time, in this particular game.  Our first game, however, involved me coaching her where she went wrong later on.  That game took, about 75 minutes.  And, I'll be annotating, most likely, tomorrow as that's the tentative plan when I'm off from work since there will be more time as it was a longer game, unless it gets busy.  But, if not, it'll be later in the week, so definitely before Friday."
    },
    "url": "https://gameknot.com/annotation.pl/otb-game-2?gm=61589",
    "gameName": "OTB Game 2",
    "players": "Joe (1353) vs. Mariann ",
    "opening": "Ruy Lopez (Spanish opening) (C60)"
}