{
    "moves": {
        "1. e4": "I start off with my usual.",
        "1... c5": "And, I wasn't sure how Nathan would respond; but he answered with the Sicilian which I was prepared for since I have the most amount of experience with that defense.",
        "2. Nf3": "So, I respond with the most common move.",
        "2... Nc6": "This move almost took me off guard.  My anticipation was 2...d6 which is the most common move in the Game DB.  I would've tried to turn it into a Sicilian Nadjorf with 3.d4 since that's what I'm known to do.  Not being used to it combined with other things, I used the database, and I'm glad I did.  As I thought that this was an uncommon response; and that Nathan did this to take me by surprise since Ken did something like that in our training game.  But, this is the second most common move in the database.",
        "3. Bb5": "Not sure what to do, I played this.  As this is the move we see in the Spanish Opening.  It works here.  Slightly better, however, was still 3.d4.  That's because it's the most common move in the GK database.  Having said that, this is still very good and the second most common response to 2...Nc6.",
        "3... g6": "Not surprisingly, Nathan fianchettos, but I was ready for this.",
        "4. O-O": "As I treat this like a Morphy's or Berlins Defense by deciding to castle right away.  The thing to note is that in our very first game, during a simultaneous match, I played very well.  But, he won after I blundered two pawns.  The first of which occurred by being fixated on something, and thereby, failing to castle.  Well, I wasn't going to let it happen this time.  ",
        "4... Bg7": "I expected this, so it was a conditional move, as I have my next move planned.",
        "5. d3": "By opening up the center, as well as, a line for my Bc1.  Not only that, but this gives me a solid pawn chain.",
        "5... Nf6": "Of course, Nathan was ready for this.  Likewise, I was also prepared for this move.",
        "6. Bg5": "So, I respond by developing, whilst, putting pressure on his other N.  However, this is bound to fail because of his next move since I'll have to go on the defense.  That will cost me a tempo here.",
        "6... h6 7. Be3 Qb6": "Going back on the attack.",
        "8. c4": "Instead of losing another tempo, I defended this way.  One reason is because a while back fiercequeen mentioned about a move like this to protect a piece.  ",
        "8... a6 9. Bxc6": "?! I didn't exchange just because it was possible.  Instead, I did it because I thought that this was the only way to avoid losing a piece.  The problem is that I had Ghost Vision here.  I thought that after 9.Ba4 Qa5 10.Bb3, Nathan had 10...Na5, similar to after the Morphy's Defense.  As there the exchange is forced.  What I didn't realize is that the N is on the same which prevents black from being able to play 10...Na5.  Therefore, it wasn't forced here, but rather I didn't calculate accurately.  That's because with Ghost Vision, you get the pieces; or things like where they're located mixed up which is what happened here.  But, it doesn't work as Nathan will force me to exchange my B for his N.  With that being said, Nathan accurately said that this exchange is going to favor him.  That doesn't mean he has a winning advantage, yet, but he'll be a little better off now since, as usual, the B was worth more then the N, as is usually the case. ",
        "9... Qxc6 10. Nc3": "In the meantime, I complete my development.  Knowing what I just did, I already start trying to figure something else out; which will happen in the next 3 moves, when I threaten mate.",
        "10... d6": "Meanwhile, Nathan opens up a line for his Bc8.  But, I was ready for this move.",
        "11. e5": "That's especially since I try to break through here.  But, Nathan won't exchange right away.  Being ready for what's to come, however, I will exchange after his next move since this pawn is also a danger.",
        "11... Ng4": "I was wondering what to do here.  As I also considered retreating my Be3 to prevent his next move.  But, I decide that this is of no concern because I have a plan for when Nathan captures on e3.",
        "12. exd6 Nxe3": "BTW, I anticipated this move.  So, it was conditional, and with that being said, I would've responded with 12...Qxd6 first, followed by, this move to prevent what I'm about to do.",
        "13. Qe1": "This is where I gave him a run for his money.  I also considered 13.fxe3 which is good, but I didn't want to expose my King.  In most cases, I just play a good move because of what ION mentioned, but there are a few where I look for something more.  Afterall, \"When you see a good move, look for something better\" as kenneth_fiore_3 and GM Susan Polgar have emphasized.  This is one of those times.  As I'm not only threatening to win back a piece but I'm also letting him take my R knowing that it's mate, if he takes.  And, I learned how to apply this technique from Penelope80 in one of her training games with duke69.  Nathan said that this was interesting and that he was learning something from this move.",
        "13... O-O": "Nathan accurately pointed out that he could've defended with something else.  He was implying 13...Bd4, but he wanted to try something different.  So, Nathan decided to bring his King to safety.",
        "14. dxe7": "I was trying to figure out what to do here.  In fact, I almost played 14.Qxe3 right away.  But, I decided to play this since I'm threatening his R with my passed pawn.  The idea, and what blends into giving the runner a run for his money is playing the absolute best that you can.",
        "14... Nxg2": "My anticipation was that Nathan would stop my pawn with 14...Re8, but he captured here.  Once again, I was wondering what to do between taking the N or promoting.  But, I decided to promote at once since it wins his R.  And, after he takes back, that's when I'll grab his N.  Similar to clashofpawns 11 year old student, where she gave him a piece to see how he'd do with an advantage; Nathan was interested in how it would pan out after I took his R and N.  He wanted to see how I would handle things.",
        "15. exf8=Q+ Kxf8 16. Kxg2 Bh3+": "So, he continued with this move.",
        "17. Kxh3": "?? But, this loses right away, as Nathan pointed out when I resigned.  I took to prevent loss of material.  However, Mr. Resika pointed out that best was 17.Kg3, and the position still holds.  I just didn't want him to take on f1 as I thought that it was a free R.  But, after 17...Bxf1, 18.Qxf1 or 18.Kxf1 I'm still ahead by the equivalent of 2 pieces.",
        "17... Qxf3+": "I resigned here as 18.Kh4 is forced, and then comes 18...g5# which is mate.  But, after 16...Bh3+, I'd still be safe and better off with 17.Kg3  So, this is an example of where to take is a mistake.  Capturing on h3 is what allowed Nathan to swarm in and force this mating sequence. "
    },
    "url": "https://gameknot.com/annotation.pl/otb-wtw-game?gm=64991",
    "gameName": "OTB WTW Game",
    "players": "Joe (1319) vs. Nathan Resika (2300)",
    "opening": "Sicilian (B31), Nimzovich-Rossolimo attack, Gurgenidze variation"
}