{
    "moves": {
        "1. e4 d5 2. exd5 Qxd5 3. Bc4": "have no worries: White has not lost her mind; we are playing what we used to call 'Take Away Chess': in this type of chess, capture is mandatory; so after d5, exd5, Qxd5, were forced moves: now, Black has to capture; but he has multiple choices...",
        "3... Qxd2+": "getting rid of major pieces is always a good thing: after Qxg2 or Qxc4, Black would force himself into a difficult position...",
        "4. Bxd2": "taking the Queen is forced: we have to capture and get out of check at the same time; White decides to keep the Queen out of play...",
        "4... b5": "cleverly done: after Bxb5+, Black can offer some more material...",
        "5. Bxf7+ Kxf7": "but Black has to capture and solve check...",
        "6. Qg4 Bxg4 7. Bh6 gxh6 8. h3": "time to explain the object of this game: the winner is the player, that has only the King left; with all other pieces gone - hence take away chess - and not in check or mate: or the player, that mates the other one; mate is still possible...",
        "8... Bxh3 9. Rxh3 Nc6 10. Rxh6 Bxh6 11. Nf3 Bd2+ 12. Nbxd2 Nd4 13. Nxd4 c6 14. Nxc6 Rd8": "getting too carried away...",
        "15. Nxa7 Rxd2 16. Kxd2 Nf6": "Blacks' pieces are getting out of Whites' reach...",
        "17. Nxb5 Rd8+ 18. Ke3": "Nd4, Rxd4, would cost another piece: but White switches to a different game; exhaust all Blacks' moves...",
        "18... Rd6 19. Nxd6+ exd6 20. Kf4 Ne4 21. Kxe4 d5+ 22. Kxd5": "Black has nearly won this game: but how to get rid of h7?",
        "22... Kf6 23. f4 h5": "onwards...",
        "24. Kc4 h4 25. g4": "a tiny rule, Black forgot...",
        "25... hxg3 e.p. 26. Re1 g2 27. Re3 g1=Q": "Black is confident, he can ditch the Queen at some point...",
        "28. Kb5 Qxe3 29. c4 Qxf4 30. Kb6": "or maybe not?",
        "30... Qxc4 31. Kb7 Qxa2 32. Kc6 Qxb2": "White has won..."
    },
    "url": "https://gameknot.com/annotation.pl/otb-training-game-with-a-twist?gm=64860",
    "gameName": "OTB training game (with a twist)...",
    "players": "fiercequeen (2059) vs. opponent (1800+)",
    "opening": "Scandinavian defence, Lasker variation (B01)"
}