{
    "moves": {
        "1. e4": "I start with my usual.",
        "1... Nc6": "Because he always switches his first move, I did not know what to expect from him.  But, he played, I believe it is the Nimovitz Defense.",
        "2. Bb5": "?! So, I treat it like the Spanish Opening since that's 1.e4 e5 2.Nf3 Nc6 3.Bb5.  But, as ION noted in one of my earlier annotations, it's not always good to follow that.  Instead, if someone plays something that you don't know, then it's not just about adjusting, but rather, it's important to meet it up with right follow up.  Therefore, I reckon that I've made the wrong choice because of Carl's next move.  Although he moves the same piece again, I'm going to lose a tempo here which is why I deem it to be inaccurate.  If I was prepared for his next move, I would've followed up with 2.Nf3, instead.",
        "2... Nd4 3. Bc4 Nf6": "Going after my pawn.",
        "4. e5": "So, I hit his N.  And, when Carl defends, I'll attack again.  ",
        "4... Ne4 5. d3 Nc5 6. Qg4": "And, after defending again, I go back into attack mode.  But, this is where Carl will make his blunder which I'll exploit.  In fact, this move is, in general, inaccurate because you shouldn't bring the Q out before completing your development.  But, since I'm not used to this opening, I play Hope Chess here.  That is, this early.  As I'm hoping that Carl will hyperfocus on one thing, and miscalculate the obvious threat which will allow me to win material.  It generally shouldn't be tried, and most of the time, this is the way to go wrong.  But, what I was hoping for works this time around because of Carl's next move.",
        "6... d6": "?? As Carl played this.  It was also what I call Reverse Psychology.  The idea is that in general, if your Queen is brought out early, it's prone to harassment which allows them to gain tempo.  And, that was what I was also hoping for which is why it's Reverse Psychology.  I wanted black to think that he was gaining tempo and getting an initiative, but with this move, I'm going to take on my next move.  Best was 6...N4e6, but then, I would attack again with 7.c3.",
        "7. Qxd4 Ne6": "Carl decides to attack my Queen.  But, it does not matter as I will exchange.  Liquidating is to my benefit since I'm an entire piece up.",
        "8. Bxe6 Bxe6 9. exd6 exd6 10. Nf3": "And, I use the opportunity to continue with my development.",
        "10... Qe7": "I don't know why Carl played this.  Not only isn't the Queen out early and doesn't develop, but more importantly, it hems in (blocks) his Bf8.  With that being said, I will not hesitate to castle, at once.",
        "11. O-O c5": "Still going after my Queen, but it does not matter, as I will go right after the center by retreating there.",
        "12. Qe3 Bd5": "Trying to exchange Queens.  I'd normally do that since I'm ahead but thought that I might have something better.",
        "13. Re1": "As I am now threatening to pin it.  ",
        "13... Be6": "Of course, Carl sees that and prevents me from doing so.",
        "14. Ng5": "So, I go for something different, by threatening to pin his Queen.  That's because, if Carl pulls back his B, I'll pull my Queen which will win the Q for a R, as his Qe7 will be directly.   Therefore, Carl has no choice but to accept liquidation again.  Of course, I'm studying a variation several moves which are about to become a reality.  As this liquidation will allow me to pick up another pawn.",
        "14... h6 15. Nxe6 fxe6 16. Qxe6 Qxe6 17. Rxe6+ Be7": "I'm not surprised to that Carl interposed to get out of check.  But, I start thinking about a different variation, starting with my next move.",
        "18. Nc3": "It's more then just development as this is a variation that's going to come true.  As what comes to mind is what I learned about deeper_insight taught regarding the Knight Visualization Count and where they can go.  Counting them right is going to threaten something dangerous and almost force immediate resignation for black.  ",
        "18... Rf8": "I don't know why Carl played.  But, there are no good moves for black.  Regardless of what he played, I would've still continued with my next move as that blends in with Knight Visualization count.",
        "19. Nd5": "This was the plan behind 18.Nc3.  As now, I'm threatening a N fork which will win and additional Rook, and that's what I was calculating with this Knight.  That's also an example of what Joe mentioned with the N visualization count.  In order to prevent me from forking, Carl must accept the loss of another piece, regardless, being a Bishop.",
        "19... Rf7": "As the only way to prevent the fork was 19...Kf7 or 19...Kd7, but I would follow up with 20.Rxe7+.",
        "20. Nc7+ Kd8 21. Nxa8 Bh4": "Not earlier, but now is where the position starts to become corrupt.  However, this was also played.  It makes sense, as Carl is targeting my f2 play in an attempt to get counterplay, but it's too little too late.  ",
        "22. Rxd6+": "But, this is where I'm not exactly sure what was played.  So, it actually begins here.  As I recorded a move that involved the Rook when I was rushing the notation.  To be exact, I recorded 16.Re6+, but that was not possible right away.  But, I knew that 16.Qxe6 was played, as that's how I wound up winning another pawn.  In addition, it wasn't possible to bring the Rook to e6 with check without 16.Qxe6 being played, first which is how I figured out that I captured with the Queen on e6.  However, it doesn't really matter, at this point.  The only difference is that I'm ending the annotation a little earlier then when the game ended.  As Carl resigned 3 or 4 moves later.  The reason being is that black was too far behind for counterplay.  It was interesting, but the thing to note is to calculate things carefully as one blunder often leads to another.  And, that's why it generally only takes one big mistake to go wrong.  That's especially when the mistake occurs within the first 10 moves, as TA noted."
    },
    "url": "https://gameknot.com/annotation.pl/otb-game-3?gm=64400",
    "gameName": "OTB Game 3",
    "players": "Joe  (1318) vs. Carl ",
    "opening": "KP (B00), Nimzovich defence"
}