{
    "moves": {
        "1. e4": "I would've switched it up with 1.d4, and gone for the Colle Franketort System (which I only played one against a Bert.)  The cornerstone is 1.d4, d5 2.Nf3, followed by 3.e3.  But, since it's been a while, I'm very comfortable with sticking to the Ruy Lopez.",
        "1... e5 2. Nf3 Nc6 3. Bb5 d6": "Tipsyjourneyman were speculating how Jack usually responds.  I temporarely forgot and thought it was 3...Bc5  But, this is his most common response by allowing self imposing the pin.",
        "4. Nc3": "Instead of castling right away, I delay for one move by playing this.  In part, I remember what I'm studying with John.  But, mainly I based it on comments from kenneth_fiore_3 and felt most comfortable with this move.",
        "4... Bd7": "Developing and breaking the pin.",
        "5. O-O": "Not wanting to take any chances with his Bishops, in the long run, I get my K to safety, at once.  I felt that if Jack could organize both bishops, it could be very dangerous for me, if I'm not castled.  So, to avoid getting nervous, I play it safe because as the saying goes, \"Don't trust your opponent.\"",
        "5... Nf6": "Meanwhile, Jack continues with his development.",
        "6. d3": "I could've continued with the mainline (Exchange Variation): 6.d4, exd4 7.Nxd4, Nxd4 8.Bxd7+, Qxd7 9.Qxd4  First, sticking to mainlines might make Jack too comfortable on what to do.  So, after seeing what happened in my game with nuntar, I'm trying to put my coach out of his comfort zone.  By doing this, I felt that Jack wasn't used to this variation.  In addition, I get a nice pawn chain and place to complete my development, in return.  The other idea, as I learned from tipsyjourneyman and kenneth_fiore_3 is not to exchange against a stronger opponent, just because, you can.",
        "6... Be7": "Completing his development.  But, the only problem is that my coach is in a cramped position.  And, I will try to take advantage of that with the idea being to make things difficult against the runner, as easy19 pointed out in our last WTW training session together called, \"All your base belong to us.\"  In it, he said, \"Don't be afraid to make things difficult for me.\"  Well, that's the idea against any coach.",
        "7. Bg5": "Meanwhile, I also complete my development.",
        "7... O-O": "He tucks his monarch away, as \"the court of last resort\", as they say.  In other words, it's also based on what John also said which has to do with castling, as the final step in development. ",
        "8. Re1": "Meanwhile, I centralize my rook with the idea being that it's one way to control the center.  I know I've been told to hold off until later, but I wasn't going wait here.  The idea is centralization can also make things difficult for your opponent.  I hope I'm not overgeneralizing, but I saw that in a recent GM game.  Not only that, but, contrary to what I said earlier with 3...d6, now's the time that I go back to mainlines to keep Jack guessing.  Aside from that, the only other move that came into consideration was 8.Nd5, but I'd lose material after 8...Nxd5, 9.exd5, Bxg5 10.Nxg5, Qxg5  ",
        "8... a6": "However, Jack goes back mainlines, but at a later, so I abide in both cases.  ",
        "9. Ba4 b5 10. Bb3 Na5": "Believe it or not, this move came into calculation.  Now, I was wondering what to do, in this position.  I could allow him to double my pawns since the capture would be towards the center.  At first, however, 11.Nd5 was still ruled out due to the concern about the loss of material.  But, then, I came to my senses, as now, his Ra8 is en-prise.  So, I play it.",
        "11. Nd5": "This is one of the few times where Mr. Stockel and I disagree with each other.  Jack: You're in big trouble.  ",
        "11... Nxd5": "I anticipated this move.  That's because of the next move, and when he recaptures...",
        "12. Bxd5 Bxg5 13. Bxa8": "I take the Rook and now wind up ahead.  Don't forget that I remember the mistake I made with nuntar by forgetting to capture which would've left him in rough shape since he'd be down by a pawn and lose castling rights.  Well, I did not forget about that, and in return, left Jack clinging, as archduke_piccolo put it in our first game, where I also could've taken.  But, that happens here.",
        "13... Qxa8": "Figuring that he got something back, Jack recaptured.  For a couple of minutes, I was wondering what to do.",
        "14. Nxg5": "But, I found this move since the Queen did not defend his DSB.  He overlooked, and it was nothing short of the glamoma, as noted because it got confused with a pawn or bishop.  Jack: Oh, you had the Knight there.  Joe: The Knight is very dangerous.  Jack: Now, I must figure something else out.",
        "14... Qd8": "So, he attacks my Ng5 in such a nasty way.  Now, I'm the one that must figure something out.  I considered what appeared to be an exchange with 15.Qg4?? but saw that he'd get my Queen for free which could not be allowed.  So, I find something else, and not for a cheapo tactic.",
        "15. Qh5": "As I'm threatening a checkmate.  But, mate wasn't the idea for, if it were, this would not have been played.  Instead, I'm protecting the N.  And, when Jack responds, I felt that his options would be limited.  The idea is playing things that he doesn't anticipate, and yet, I know how he'll respond and am ready for it.  In return, I feel that my advantages increase which Jack implied later on in our game chat.",
        "15... h6": "Joe: I figured that you'd play this.  Jack: What else can I do?",
        "16. Nf3": "I'm not struggling, as it might appear.  For, I thought about what I could do, prior to playing 15.Qh5  Turns out that any other move, except 16.Nh3?? loses the N.  The problem with bringing the N to h3, isn't so much the exchange, but when it happens, my pawn structures around the K is destroyed.  That would expose the monarch, and as you remember, that's how I lost my last game against him.  Being ahead doesn't mean that you can compromise the safety of your monarch.  So, I retreated to the best square, in my books.",
        "16... Nc6": "Bringing his Knight to a better outpost, as well.",
        "17. Qh4": "Now, I go for an exchange.  The idea is to liquidate pieces when ahead.  In this case, the Queens are the target because, as I've learned, exchanging Queens, especially while ahead, changes the dynamics of the game, in a positive way.  Yes, I had the same kind of Homework with a mentor which makes me remember, all to well.",
        "17... Nb4": "Jack is threatening to fork both Rooks which I did not overlook yet.  Before defending against the threat, however, I decide liquidate once and for all.",
        "18. Qxd8 Rxd8 19. Rec1": "And, now I defend.  I also considered 19.Rac1 to keep the other Rook centralized.  But, he'd win back a pawn, after 19...Nxa2, which I wasn't going to allow.",
        "19... Be6": "Yet, he's still threatening to win a back a pawn.",
        "20. a3": "So, I defend, whilst, attacking his Nb4.  The idea being is that I'm playing, as though, it were an Archange line.  That's because ...Bc5, is generally played, after which, white plays c3, followed by d4.  If something's there, which he noted in a game against Jack, you attack it to gain tempo, which in return, allows a pawn chain.  The same thing applies here, but instead c2-c3 followed by d2-d4, the plan starts here, and when he retreats, I'll play 21.b4 and get a similar chain.",
        "20... Nc6 21. b4 Bg4": "I'm not sure why Jack played this, but I don't see the point since my Nf3 is not pinned. ",
        "22. Nd2": "So, I retreat to d2.  Another move that came into consideration was 22.c4??, but after exchanging, my monarch is still exposed.",
        "22... Nd4": "At first, I wasn't sure why Jack played this, and therefore, also viewed it as pointless.  But, this time my assessment is quite bad because in doing so, I made a mistake that allows Jack to recompensate.",
        "23. c4": "?? Not seeing the point, this where I take advantage of the opportunity to try and exchange.  But, in doing so, he will equalize with his next move.  As now, my monarch and Rc1 will be forked, allowing him to get a Rook for a Knight.  Best was to refute this bringing my monarch into the corner with 23.Kh1.  Another option was 23.Kf1, except for what might happen after 23...Be2+  That's why I think that the better alternative is having the monarch on h1.",
        "23... Ne2+ 24. Kf1 Nxc1 25. Rxc1 bxc4": "After my blunder, however, the exchange ensues.",
        "26. Rxc4": "But, in this position, however, I had a hard time deciding how to take back.  That is, whether to recapture with the Rook or d3.  In fact, 26.dxc4 was almost played in order to keep three pawns closer together to make a stronger pawn chain.  But, the reason I captured here is because of the fact that I'm now threatening his c7, whereas, after the other way, this wouldn't happen.  And, after Jack defends, I will have another threat.",
        "26... Rc8 27. Rc6": "With that being said, this was also part of the plan behind taking back with the Rook.  As now, I will take.  Initially, my thought process was winning back a pawn.  But, as we're about to see, white doesn't win anything",
        "27... Bd7": "My inference is that Jack is trying to scare so that I don't find the right move.  He's probably hoping that I'll retreat back, e.g., to c3 or c2.",
        "28. Rxa6": "But, it does not work against me, as I was going to take, one way or another.",
        "28... Bb5": "This, however, is where I discovered that my thought process.  With this fork, he is going to recapture.",
        "29. Ra5": "Knowing this, I attack his Bb5, but for the thrills and giggles here because my Rook needed to be protected.  And, there's no way to defend d3, anyhow, so one move is as good or bad as another with the R.",
        "29... Bxd3+ 30. Ke1": "I had a difficult time deciding between 30.Ke1, and 30.Kg1, in this position.  I almost moved my monarch to g1, with the idea of bringing it into the corner, as noted earlier.  The reason for playing this is the fact that we've now reached an endgame.  And, during that phase, the monarch is a powerful.  So, the idea is to keep, as mobile as, possible.",
        "30... f6": "I don't know why he played this.",
        "31. Rd5": "31.f3 was almost played to get a different pawn chain.  However, I wanted to put pressure right on his Bd3 knowing that the usual escape route (whilst attacking the Rook) with 31...Bc4??, won't work, due to my Nd2.  So, the idea of making things difficult for my coach remains the same.",
        "31... Ba6": "I had anticipated 31...Bc2, where his Bishop would not get reattacked.",
        "32. Ra5": "Believe it or not, I played 32.Nf3? here because of what GM Susan Polgar taught me about a better placement for the Knight.  But, Jack Stockel accurately pointed out that this is a blunder because I'd lose a pawn after 32...Bb7, without compensation.  Therefore, he made me find a better move, as Homework.  This is similar to what a mentor did by giving me HW when mentioning a move which I remembered to give my students Homework.  And, it's also similar to what kenneth_fiore_3 when we talked about the possibility of getting training from him before it got busy.  What Ken said is that there are times where he will not allow the student to make a move, if it's an error.  Well, the same thing is true here because Jack was not going to allow me to make that mistake.  Therefore, I found this move, and he said, \"Very good move!  That's much better.\"  But, this move will result with the same response, as he also outlined.  On the other hand, it doesn't lose material.",
        "32... Bb7 33. f3": "However, I decide to add a defender to e4 so that I can move my Nd2 to a better outpost, without the loss of material.",
        "33... Kf7": "As noted earlier, the King plays a powerful role in the endgame.",
        "34. Nc4": "Also mentioned is that my Knight is better placed.  Jack said, \"You moved the Knight.  That is a good move.\"",
        "34... g5": "Advancing his g7.  The idea being is that by playing this, his pawns are better connected which is also critical, at this phase.",
        "35. Kf2": "Like what we saw with Jack, I get to it by mobilizing my monarch.  The long term plan, however, is to get the opposition.  We're not at that phase, yet, since so many pawns obstruct the monarch, but the idea is getting towards that phase.",
        "35... h5": "Advancing his h pawn.  Now, if it can go to h4, this chain will become very dangerous.",
        "36. Ra7": "But, before he can do, I hit Bb7.  Then, Jack said, \"Nothing is good right now.\"  What he was alluding is for black.",
        "36... d5": "\"This is the best\", as he also said.",
        "37. Na5": "I considered exchanging his Bb7 for my Knight.  But, my N can do a lot here.  More importantly, (the reason for this decision) is that exchanging means that Jack would have passed pawn, right away.  That's because his d5 would keep advancing, and it would be unstoppable.  By playing this, however, that's not true, any longer.  Even if he plays ...d5, I'll answer with Ke2, and black can't place me in check, due to my Ra7.",
        "37... Ba8": "Since I denied that exchanged, Jack wisely retreats because anything else, loses the Bishop.  With that being said, another reason for playing 37.Na5, was to prevent him from responding with ...Bc6, as now, it's confined.  Although it's an endgame, the idea is to still leave black with a cramped position.",
        "38. exd5": "Now, how dangerous that pawn can be, I take, to prevent that from happening.",
        "38... Bxd5": "As expected, he takes back.",
        "39. Ke3": "This time, the plan is to get the opposition.  This involves exchanging more pawns, as a long term plan, though so that nothing interferes with the King's being opposite of one another.  And, I remember what Susan told me that this opposition is vital in endgames.  The other idea, is for something else which is important called triangulation (where the King moves in a triangle).  But, that will happen, right after his next move.",
        "39... Kg6": "Unpinning his c pawn.",
        "40. Kd3": "So, I take advantage of the opportunity to do the triangulation.",
        "40... g4": "And, he attempts to exchange pawns, which I accept due to the plan of getting the distant opposition.  However, that is a mistake because he is going to win a pawn, without compensation.  Better is 41.Ke3 or 41.Ke2, adding another defender to f3.",
        "41. fxg4 hxg4 42. g3": "Protecting g2, whilst preventing his g4 from advancing any further, for now.",
        "42... c6": "I'm not exactly sure why he played this, but my guess is to do damage with his c6.",
        "43. Rd7": "In this position, I reversed the colors and thought that his Bishop was pinned.  It's because I mixed up my King with his thinking that his monarch was on this square.  This still remains a weakness for me.  Doing this is not a good way to go, though, and has led to me giving some of students the wrong information in their annotations.  In fact, that's why it often happened.  But, it's worse here, as this is where I'll start to go wrong, believe it or not.",
        "43... Rh8": "As noted, Jack is going to pick up a pawn.",
        "44. a4": "The idea here is to get pawn chain followed by an exchange.  That's because my goal is to get a passed pawn.  But, I felt that it does not work since his pieces appear coordinate here. ",
        "44... Rxh2 45. Rd6": "But, before advancing my a4 further, I decide to pin his f6, first.",
        "45... Ra2": "However, he is still going to win my a4, one way or another.  With best play, I might be able to draw, as Jack told me later on.  This happened after this game, seconds before we said goodbye.  That's because when we were finished, my coach showed me a different position with a student as to, why it's not lost.  Right after we put things away, just before leaving he told me what happened.",
        "46. Nxc6": "?? With that being said, this is where reversing the colors becomes the costly error.  I figured that he's going to get my a4, but in return, I've won a piece since it appeared that his Bd5 was pinned.  As noted, I mixed up his monarch for mine.",
        "46... Bxc6": "Due to that weakness, I thought that this was unplayable.  Joe: This is an illegal move.  Jack: How is this illegal?  After which I looked at it and said that he was right.  But, the game is now lost for white, as he implied.  During our chat, Jack said that instead of exchanging Knight for Bishop, much better was to wait, and later on, sac the Knight for a pawn.  By playing this, he will get a passed pawn which will become impossible to stop.  The idea being is that in an endgame like this, the Knight can stop a pushed pawn from doing damage.  Eliminating it early on, takes away that opportunity enabling him to get a passer which will promote.",
        "47. Rxc6 Rxa4": "As anticipated he takes.  But, this also blends in with what he was saying because of the fact that I have two isolated pawns, against three of his connected pawns.  To of them are in a chain",
        "48. b5": "So, I do what I can to prevent further damage.",
        "48... Ra3+": "But, it's too little, too late because he will pick up another pawn with this fork.  Little did I realize that when he does, he'll have another passer.  And, this is the one that will do the damage.  At this point, however I figured out that I'm lost.  Although I'd normally resign, resignation is not an option, yet.  That's due to the fact that since this is a WTW game (which will be posted in that club, and the fact that I have a little more time then usual, 30 instead of 5-10 minutes, I'll follow the Supplemental Talking the Talk Rules.  It states that we don't resign until you see a forced a mating sequence.)",
        "49. Kc4 Rxg3 50. Kd5": "Doing what I can, I decide to stop his e pawn from advancing.",
        "50... Kf5": "But, he now has the opposition which is going to enable him to push e5 since I can no longer stop it.",
        "51. Kd6": "So, I try to come up with another idea.  The idea is to counterattack, if he plays 51...Kf5, for I'd respond with 52.Ke6.  Not to my surprise, though, it doesn't happen.",
        "51... Rb3": "Instead, he goes after my b5.",
        "52. b6": "Which I thought could be protected with this move.  But, Jack's got something else up his sleeve.",
        "52... g3": "It's with this pawn, as it's a matter of time before it Queens.  As the saying goes, \"passed pawns must be pushed.\"",
        "53. Ke7": "Doing whatever possible, I attempt to centralize my monarch.  That's because I still remember about mating with just two bishops and the king.  And, when you're on the other end of it (so they have the mate), the way to last longer is by centralization of the monarch.  The reason it appeared to apply here is that I thought we were similar territory.  Knowing that he'll Queen with a similar position, the idea was applying what I've learned.  But, it does not apply, however, in this position.  That's because it's even worse then I imagined and out found that I don't last longer after his next move.",
        "53... g2": "At this point, Jack told me that the position was resignable, as usual.  But, with 20-25 minutes, as opposed to, less time, I refused.  In it, I admitted to being lost but resignation was not an option, yet.  Now, he know's that I have a computer and annotate my games against him since I've told him.  But, I just told Mr. Stockel that I'm in a club, and they have a rule of not resigning until mate is forced.  And, I was going to abide by.  For those that are wondering, the only time I don't is when time management is an issue (meaning: that I'm almost out of time.  Otherwise, I don't.)",
        "54. Rxf6+": "So, I take, knowing that he can't back.",
        "54... Kg5": "I don't know why he played this.",
        "55. Rf7": "? But, I prepare, for when he promotes.  However, similar to what we saw when continuing a different game with my coach, after premature resignation, I made the same mistake.  By playing this, he is going to win another pawn.  Instead, my Rook had to remain on the sixth, where b6 was protected.  Therefore, just about anything else was better then the move played.  Another way of putting is what charleshiggies said in one of his annotations that this is a mistake in a lost position.",
        "55... Rxb6 56. Rg7+": "Without anything much better, I decide to place him in check.  This time, it is just for the thrills and giggles of it since there didn't appear to be anything to lose.  My thought was delaying the promotion for, as long as, possible since the it appeared that the only way to get out was with the monarch.  But, I overlooked his next move.",
        "56... Rg6 57. Kf7": "? So, I try to get his Rook, in return.  But, this is another mistake as he will liquidate.  Afterwhich, I can resign soon after since I'll only be left the monarch.  Much better was 57.Rh7, or 57.Rf7 where this exchange would not have been possible.  And, now, if he promotes, even with a Rook, I'd still have mine and might be able to hold off against mate.  Consequently, that would further delay my resignation.",
        "57... Rxg7+ 58. Kxg7 g1=Q": "Right after the promotion, I resigned.  With only my monarch against his Queen and King (even without the pawn) mate is forced.  That is due to what I remember on how to mate with your Knight and Bishop, since I studied this for several months until it became second nature.  Well, the same concept applies here because he will force my monarch into the corner (this time, h8 where mate would be forced.)  Therefore, it blends right in with the rules mentioned earlier of not resigning until mate is inevitable.  With that being said, my next move would be 59.Kf7.  After that, a likely continuation would be 59...Qd4, 60.Ke6, Kg6 61.Ke7, Kf5 62.Kf7, Qd7+ 63.Kf8, Kf6 64.Kg8, Qf7+ 65.Kh8, Qg7#  But, no matter how you slice it, mate is still forced one way or another.  "
    },
    "url": "https://gameknot.com/annotation.pl/otb-wtw-coaching-game?gm=60586",
    "gameName": "OTB WTW Coaching Game",
    "players": "Joe (1356) vs. Jack ",
    "opening": "Ruy Lopez (C62), old Steinitz defence"
}