{
    "moves": {
        "1. e4": "The opening I like to start with.",
        "1... c5": "Not surprised to see him play the Sicilian.",
        "2. Nf3 Nc6": "However, I had anticipated 2...d6  Although, this is allright, nontheless, as it's what I'm most used to, I'm still going to go for an exchange variation, as though, he played 2...d6  The idea is, as GM elyhim would say, \"Stick with what you know.\"",
        "3. d4 cxd4 4. Nxd4 Qc7": "I'm surprised that he played this, as opposed to, 4...Nxd4, in which case, I'd play 5.Qxd4  Of course, there's nothing wrong with this move.  My guess is that he's doing this to strengthen his position on the Q side which makes sense since there's added pressure to the c file.  Nontheless, I will take and force an exchange.  Now, we were still at the phase where I thought that you just should against stronger players.  However, I know otherwise, that you don't just do so because you can.  And, I feel that taking is going to strengthen his position which is why he would play this.",
        "5. Nxc6 bxc6 6. Bc4": "To develop and pin his f pawn.",
        "6... Nf6": "Also developing and threatening my e pawn.",
        "7. Nc3": "Instead of continuing by castling, this is a time where K safety must wait.  Without the defender, 7.0-0? would be a mistake because of the pawn is hanging.  So, it had to be protected, somehow.  I also considered 7.Bd3, but I didn't see a reason to deviate and be forced to move the same piece twice.  I only do that, if it were the only way to protect.  But, when I can defend by developing another piece, then that is what I will do.",
        "7... e6": "Developing, whilst, getting rid of the pin on his f pawn.",
        "8. O-O": "Well, now it is safe to castle.",
        "8... d5": "I would've played 8...Bb7 or 8...Ba6 because which would've given me a stronger B.  But, yes, this makes sense, as sooner or later, black is going to gain tempo.  It's not so much for thrills and giggles of attacking something, but the question is, what happens after that?  You get, which you can now use to develop another piece and brings him one step closer to castling.  In addition, as we know, tempo is, indeed, very important as I learned in a quiz with Judit Polgar.",
        "9. exd5 exd5 10. Bd3 Bd6 11. Re1+": "Waisting no time, I figured that I'd gain time of my own to complete development.  I thought that Dave would be forced to waist time, protecting with his DSB or Q, or being forced to give up castling rights.  However, I overlooked his next move, which will allow him to complete development since he will use his LSB.",
        "11... Be6 12. Bg5": "?! Now, this is where I made my first bad miscalculation which has always been weakness.  I planned ahead but mistimed this.  I thought that I'd either force him to lose time, or double his pawns right around the K which would make it unsafe to castle K side.  That's why I played this.  But, just the opposite happened, and then some.  I knew that he'd check, but what I forgot about what his Q directly behind his DSB.  Therefore, what I missed was the mistake that I avoided in a previous game.  By playing this move, he's now going to win a pawn and will weaken my K side.",
        "12... Bxh2+ 13. Kf1": "Forced.",
        "13... Be5": "I start figuring out what to do since I don't like the situation I'm in.  What Dave's threatening to do is double my pawns by trying to force an exchange on c3.  Well, one of the things I don't like is doubled pawns.  I ask myself if there's a way I can avoid it.  There is not, that much I can do, for if I move the N elsewhere, he will my b pawn since it's half pinned.  Realizing that there isn't much option, I must exchange pieces, despite not wanting to liquidate when down. ",
        "14. Bxf6 Bxf6 15. g3": "Normally, I don't just open up like this, unless mate is immeidately threatened.  But, I started thinking about those forcing, as per what I've studied by Susan Polgar.  The real question does black does have any threats.  I think that Dave did here, so I was preventing.  Now, I had considered 15.Bf5, given that his B is pinned.  But, the threat would still be there, and black would play what I'm worried about would be 15...Bh4 and if 16.Bxe4, instead of taking, Dave would also have the option of 16...Qf4 in which case, 17...Qxf2# becomes a real threat.  That's why I considered the move with the idea, that after 16...Qf4, that's when I would've been able to fork his Q+B with 17.g3 so I feel that I jumped the gun.  Instead of playing 15...Bh4, I believe that black would've taken back.  That's why I didn't play it.  Sure I was thinking about how he'd respond, and with that, he takes back with 15...fxe6  Normally, I like this as it would be unsafe for him to castle Q side, but since I'm down a pawn, I'm not going to allow him to liquidate pieces.  Therefore, I was going to take action, as if the threat was there, right now since it is bound to happen, anyway.",
        "15... O-O": "Like me, he waists no time to castle.",
        "16. Kg2": "Now, I worry about what he might, eventually do.  So, thinking about the possible threats, I advance early.  I hope, I'm not taking this too far.  It's worth noting that I did consider, in this case, what would've been a cheapo which is why I didn't play it that starts with the obvious 16.Qh5  If it weren't easy to drive off, I'd play it, since GM Damios said that you should create threats for your opponents.  But, by that, he was alluding to difficult to drive off.  However, this would be too easy after 16...g6 which would lose tempo, right away.",
        "16... g6": "Since I did not bring my Q to h5 and there are no immediate threats, I'm surprised that black played this.",
        "17. Na4": "The plan is to fork, and possibly exchange N for B, thus, doubling his pawns.  I thought that there was a chance that he'd have difficulty for him to see.",
        "17... c5": "Not surprised that it isn't because he is an IM.  Yet, I also kept in mind that when he does, I wouldn't lose tempo, this time around.  With this move it's no longer possible to do that, otherwise, ...QXN",
        "18. Rb1": "I thought that black would likely threaten my b pawn with 18...Qb7  The only thing I missed is that, even if he played that, Dave cannot take do to my N on a4.",
        "18... c4": "Now, that he is attacking my B, this is where I just begin to think about those GM annotations that I've studied.",
        "19. Be2": "Well, first of all, it's indirectly forced, as anything else, at the very least loses a piece for a pawn.  Second, even if the move wasn't forced, this is what I would've played.  Why?  In the variations that it mentions the player retreating, but in a place where it's right in front of the R for added protection.  So, seeing that, I would've done the same since the idea is applying what you've learned for your games.",
        "19... Qa5": "Not surprised to see this, either since those variations mentioned that after you retreat in the way I did, you often see the opponent attacking another piece.",
        "20. c3": "No good was 20.Nc3? as it loses a pawn, and I wind up with isolated pawns which is often of bad omen.  20...Bxc3 21.bxc3, Qxc3  Even if that weren't so, that would've been a candidate, and the only other one, of course, is the move I just played.  So, narrowing the two, I still would've played this because in a variation I studied from a GM game, one way you defend, is what I call a discovered defense taken from the same idea as discovered attack or discovered check.  So, that when you are attacked, instead of retreating or reattacking, you move something so that the piece behind defends your piece.  I think this is an example of interference because in a sense, I am interposing with another piece.  Although not direct it's indirect.  The only reason I mentioned it is that I am using tactics here and Susan said that an important tactical term to remember was interference, and now, I know the definition.",
        "20... Rad8": "Adding pressure to the center.",
        "21. b3": "At the same time, I'm adding further protection to the N, as now, something can move like my Q or pawn, without the loss of a piece.",
        "21... d4": "I am very surprised that he didn't take on b3.",
        "22. b4": "Since he didn't take, however, I do what I've studied from GM's, as this is how you attack something.  Note: The reason why I'm applying more of these variations with Dave then other players is nothing short of the fact that he is an IM, so I felt that I had to do things that way.  However, as we will see, too much of a good thing can become bad.  I also took notes here, giving myself a difficult homework assignment that required variations.  In it, the game notes that I took reads, Process of elimination.  No good is 22.bxc4, because, at the very least I would lose a R for B, when down a pawn.  22...Rxd4 23.Qc2, Bf5 24.Qc1, Bg5 25.f4, Bh6\n\nIn addition, 22.Bxc4 doesn't work because of 22...dxc3 23.Qc1, and after 23...c2, white loses a R for B.  That's because if the stays where it is, 24...cxb1=Q and if it moves to a1, we have 24...Bxa1.  \n\n22.cxd4 also doesn't work, as white would also lose a R for B.  22...Rxd4 23.Qc2, Bf5 24.Qb2, Rd6 25.Qa3  So, best is 22.b4.",
        "22... Qf5 23. g4": "This, however, is where it happens.  Normally, I'd play 23.Bg4, followed by 24.Bxe6, with that exchange.  Although, I don't like it, there aren't choices.  However, with the variations I studied, which was difficult to decide, you often attack with the pawn.  By overanalyzing those variations, I now wind up in trouble.  I'd normally feel that 23.Bg4 was better, but it isn't as black would've played the same thing.  So, I'm not sure what the best was.",
        "23... Bd5+ 24. f3": "? A terrible miscalculation and not because of analyzing/playing through variations, this time around.  Instead, I was fussed on the pawn chain since that's important as I learned from a video by an IM, forgot, however, what his name was.  But, the K had to move back.  By playing this, I wind up losing a pawn, and then some, adding insult to injury.  In fact, something I forgot is what Jack said.  That when getting out of check, it's better to use the K, as opposed to, interposing with a pawn or piece.",
        "24... Qxg4+": "That's where I miscalculate, as I anticipated 25.fxg3  The only problem is that with his LSB it's not possible as it would be an illegal move.  So, I must except the loss.",
        "25. Kf1 Qh3+ 26. Kg1": "I also could've played 26.Kf2, but I was worried about my K becoming exposed.  Plus I studied something from the e-mail course that you know about that when the K moves like this, you're safe.  Unfortunately, that isn't so here as you'd have a pawn.  Yet, and it's not a trick, but I thought along the lines that if black miscalculated which happened in my first game with easy19, believe it or not, I'd move my K back and forth until the position repeated so that I'd wind up with a draw by repetition.",
        "26... Qg3+ 27. Kf1 Rfe8": "Not surprised that black doesn't allow it.",
        "28. cxd4": "Like before, I became too confident by overanalyzed a variation.  They often wait until later, but in a position like this, there was a variation where PXP which is why I played it, thinking that there was nothing wrong.  But, getting greedy is what did it.  Nontheless, the game is lost, one way or another, so I felt that I might as well as there's nothing else to lose, when in reality there was.  I felt that he had something dangerous, but before doing so, I was complicating his position by taking.  The reason being is that 28...Be5 is no longer possible, and I'm accustomed to a mating sequence starting with that.  So, by playing this move, I thought that I had prevented the threat that's bound to come.  However, there is no way out.  Thinking that I did, I played a move that you'd typically see a strong player play, but it doesn't help here.",
        "28... Bh4": "At this point, Dave has a mate in one.  That's because the K is pinned, and in order to prevent mate it'd have to escape.  So, I resign as he will play 29...Qf2# with no way out.  The lessons to learn are not to become obsessed with pawn chains because when I did, it was lost from that point.  But, also, it's about not getting hyperfocused just because you think GM's play that move based on variations you've analyzed.  The perfect example was when I played 23.g4 after seeing similar position where the GM attacks Q.  By doing this, I started getting myself in trouble, and soon after there was no way out."
    },
    "url": "https://gameknot.com/annotation.pl/overanalyzing-gm-variations-annotations?gm=59526",
    "gameName": "Overanalyzing GM Variations/Annotations",
    "players": "jkarp (1268) vs. dynamic_dv (2420)",
    "opening": "Sicilian (B32), Flohr variation"
}