{
    "moves": {
        "1. e4": "The King's Pawn Opening.",
        "1... c5": "I respond with the, \"cornerstone\", of the Sicilian Defense.",
        "2. Nc3": "? This is a blunder.  In this position, he is trying to play the Open Sicilian, so 2.Nf3 would have been his best move.  ",
        "2... d6": "I decided to continue with this defense.",
        "3. Bc4": "? This is a mistake.  Even though his LSB is not jammed, it is not in a good spot.  In this position, I will trap his LSB, later in the game.  ",
        "3... e6": "? I made this move to trap his LSB as soon as I could, but this is not the proper continuation of the Sicilian Defense.  Therefore, 3...a6 would have been my best move.  If, however, 1.e4,c5 2.Nf3,d6 3.d4 then 3...cxd4 would be best.  ",
        "4. Nf3": "I do not know why he chose this candidate.",
        "4... d5": "I made this move to trap his LSB, as I had mentioned earlier.",
        "5. Bb3": "Therefore, he is forced to retreat his bishop.",
        "5... c4": "I chose this candidate because I wanted to exchange his bishop for one of my pawns.  That way, I would be two points ahead.  In this position, I actually thought that I was going to win his LSB, but I was wrong.  That will be explained shortly.    ",
        "6. Ba4+": "This was the first move that I had overlooked, but it was not a blunder because this is a, \"nuisance check\".  However, I will overlook moves, and it will get ugly, later in the game.  ",
        "6... Nc6": "I made this move because I figured that he would exchange his bishop for my knight with 7.Bxc6+,bxc6.  I wanted to put him at a strategical disadvantage because I believe that this is an open position, but I am not sure since I do not know the difference between an open and a closed position.  In an open position, the bishops are more powerful then knights.  I was, however, wrong because he will not exchange his LSB. ",
        "7. d4": "I do not know why he chose this candidate.",
        "7... dxe4": "I made this move to chase away his f3 knight.  However, I overlooked and forgot about his other knight (his c3 knight), so he will respond with 8.Nxe4.  ",
        "8. Nxe4 f5": "! In this position, his e4 knight is trapped, and that is exactly what I wanted.",
        "9. Nc3": "Therefore, he is forced to retreat his knight, so he looses a move.",
        "9... Bd7": "? I do not know why I chose this candidate, but it is not good.  That is because my queen is now crammed and has less room to maneuver, but I overlooked this.",
        "10. O-O": "! He decides to castle on the safe side because he is able to.",
        "10... Qa5": "? I made this move because I thought that I could win his LSB, for free.  However, I overlooked and forgot about his knight on c3.  This is now a, \"recipe for disaster\", as they say.  Although the game is not lost, I am in big trouble because I still have not developed my other knight or DSB.  Therefore, I cannot castle on the King's side or connect my rooks, but my opponent has already castled, as I had mentioned earlier.  ",
        "11. Re1": "I do not know why he chose this candidate because he cannot capture the e6 pawn, due to my DSB.",
        "11... Bb4": "In this position, his knight is pinned, and that is exactly what I wanted.  If he moves his knight, I will exchange his rook for my DSB, and I will be two points ahead.",
        "12. Bd2": "?? He made this move to break the pin, but it was a serious blunder.  That is because I will force an exchange before I win his LSB when 12...Bxc3 13.Bxc3,Qxa4 are played.",
        "12... Bxc3 13. Bxc3 Qxa4 14. d5": "?? He decides to play a fork between my knight on c6 and my e6 pawn.  Therefore, I can win his e6 pawn and be four points ahead, but this does not happen.  That will be explained shortly.",
        "14... Nb4": "?? Instead, I chose this candidate because I wanted to play a very powerful fork between his rooks.  That way, I would win a rook and be eight point ahead.  However, this turns out to be a mistake because he can win a pawn and a rook, if he plays Bxg7, and I overlooked this possibility.  Therefore, 14...exd5 would have been my best move, as I had mentioned earlier.  At the same time, it is starting to get ugly because I am overlooking more moves.     ",
        "15. b3": "! This is almost as bad as my original thought of 15.Bxg7. ",
        "15... Qb5": "That is because I am forced to retreat the queen, so he will capture a pawn with 16.dxe6.  It will deteriorate, \"from here on in\", as it is said because I will miss more options. ",
        "16. dxe6 Kf8": "?? I do not know why I made this move, but this was my worst move, in the entire game.  17...exd7 would have been, by far, my best move.  First, it would have been an, \"even exchange\", so I would have still been three points ahead.  Second, it is no longer possible for me to castle.  In addition, I will no longer be ahead because he will recapture a bishop (my LSB), with 17.exd7, and I overlooked all of these details.  Therefore, I will be a point behind instead of three points ahead, and it has become ugly and will only get worse from here. ",
        "17. exd7 Nf6": "?? I chose this candidate because I wanted to, \"even the score\", as it is said.  In other words, I wanted to capture his d7 pawn so that the score would be 0, but what was I thinking?  After all, I cannot capture his pawn with Nxd7 because his pawn was already on d7, before I played Nf6.  Therefore, Rd8 would have been my only move.  It is because, \"That looses immediately\", as Jack Stockel would say because he will get an inevitable pawn promotion and will place me in a very serious check after 18.d8=Q+.  Of course, I overlooked this position.  ",
        "18. d8=Q+ Rxd8": "Therefore, I am forced to take his promoted queen, and he will win my rook because he will play 19.Qxd8+.  As a result, he will be five points ahead.",
        "19. Qxd8+ Ne8": "I do not want to give him my other rook, so this move was forced.  That is because I cannot protect it with my queen or he will immediately take my queen and mate me with Qxe8#. ",
        "20. Re5": "! He made this move to chase my queen.",
        "20... Qc6": "?? In this position, I am forced to retreat my queen, and this is my only option.  If I move my queen anywhere else, he will capture it, for free.  In addition, he will capture my knight, so this will be a very serious check because he will play 21.Bxb4+.  In addition, he will be eight points ahead.",
        "21. Bxb4+ Kf7": "?? This was also a serious mistake because he can mate in one move, if he plays 22.Qe7#, and I missed that possibility.  21...Kg8 would have been my best move.  However, I am also lucky that he did not find this mating pattern, but the game is still lost. ",
        "22. Ng5+": "However, it is almost as bad as Qe7# because 22...Kg8 will be forced, so I just wasted a move.",
        "22... Kg8 23. Rxe8+": "At this point, he is going to win my other rook, at best.  Therefore, I am now 11 points behind and will be at -16, so I resign.  What did we learn from this game?  It is not a good idea to overlook moves, if you can avoid doing this.  Otherwise, you miss the important facts and do not play as well."
    },
    "url": "https://gameknot.com/annotation.pl/overlooking-moves?gm=43700",
    "gameName": "Overlooking moves",
    "players": "fortyrods (1200) vs. jkarp (1008)",
    "opening": "Sicilian (B23), closed"
}