{
    "moves": {
        "1. e4": "I rarely play anything else OTB.",
        "1... g6": "The Modern Defence, I think.",
        "2. d4 Bg7 3. f4": "Adopting the same gung ho attitude I'd displayed last time.",
        "3... d6 4. Nf3 c5 5. Be2 cxd4 6. Nxd4 Nf6": "Now this looks more like a Sicilian: an Accelerated Dragon, I think.",
        "7. Nc3 O-O 8. Be3 Nc6": "Now I was tempted to swap knights immediately to weaken Black's queenside pawns but eventually decided to castle first.  ",
        "9. O-O": "At this stage I had used more time than my opponent and was settling nicely into the rhythm of the game.",
        "9... a6": "Now the temptation to swap knights before Black was defending it with Q or B was too strong.",
        "10. Nxc6": "With this move, I chose my strategy of harassing Black's queenside, exploiting the hole at b6.  I think last time we played I attacked in the centre.",
        "10... bxc6 11. Bf3 Qc7 12. Rb1": "I was keen to play Na4 and either Nb6 or Bb6 but first I needed to move the rook off the long diagonal and defend the b-pawn.",
        "12... Rb8 13. Qe2": "Threatening the a-pawn forces Black's QB to stay on the short diagonal or one of the major pieces to defend it.  On the e-file the Q may also have a future attacking down the middle.",
        "13... Bb7 14. Na4": "I was already disappointed with the prospects for this attack but still felt it had value in tying Black down on the queenside.",
        "14... Nd7": "Black covers the hole and opens up the long diagonal.",
        "15. Qf2": "reinforcing the attack on b6 but now Black has a simple and strong reply.",
        "15... c5": "This blocks the attack on the black diagonal and opens up scope for Black's QB.",
        "16. Nc3": "So now I recentralise my knight.  I was not concerned by the prospect of Black doubling my c-pawn as that would cost him his fianchettoed KB.",
        "16... Nb6": "Black now prepares a counter-attack with ...d5 and, as I saw quite late, threatens ...Nc4, followed by ....Nxe3 and ...Bd4 or by ...Nxb2 and ...Bxc3",
        "17. Qe2": "So the Q returned to e2.",
        "17... e6": "Black builds his counter-attack slowly.",
        "18. Rfd1 Rfd8": "Now I couldn't see a way of preventing ...d5 with the threat of ...d4, forking N and B, so I looked for a way of counter-attacking or under-mining the pawn's support.",
        "19. a4": "?!  I didn't really believe in this as I played it and it didn't really help but I couldn't find anything else.  Curiously, I noticed that this was my first pawn move since my opening three pawn moves.  In contrast, Black had already made 8 pawn moves.",
        "19... d5": "!  Black has seen further than me.",
        "20. a5": "continuing with my plan, which delays...d4 by threatening axb6 and then bxc7",
        "20... Nc4": "! Now the N comes to c4, supported by the pawn on d5, with the aforementioned threats and also either ..Qxa5 or ...Nxc5.",
        "21. Bc1": "An ignominious retreat but at least the B lives to fight another day and my Q won't get pinned recapturing on e3.",
        "21... Nxa5": "Now I mistakenly think I can win back the pawn by taking on d5, missing a simple followup by Black.",
        "22. exd5 exd5 23. Nxd5 Bxd5 24. Bxd5": "Lo... the pawn is won back and the B is defended by my rook ... but...",
        "24... Bd4+": "! Of course!  The checking Bishop cuts off my Bishop from its defender.  Now I have the choice of losing my bishop or sacrificing the exchange to save it.",
        "25. Rxd4": "Going 2 points down seemed better than 3....",
        "25... cxd4 26. Bf3": "At this point we had both used about the same amount of time but from here on Black fell behind on his clock as he strove to make his material advantage count.  I didn't speed up or change the way I played, I just didn't need as much time as he did to find a plan.",
        "26... Rde8 27. Qf2": "The Q had to stay close to e1 to prevent back row threats, so I disdained the proffered a6 pawn.",
        "27... Rbc8": "Now my c2 pawn looked sick.  There was one way to defend it, however bad my bishops would look.",
        "28. Bd1 Qc4": "This threatens to trap my rook with ...Qa2",
        "29. b3": "so I nonchalantly pushed this pawn forwards",
        "29... Qe6": "and now the Q threatens a full frontal on e1",
        "30. Bd2": "I reactivate my B, defending e1 and attacking Black's N",
        "30... Nc6 31. h3": "This was partly to give my King air and partly to threaten a skewer.",
        "31... Qd6": "Black preempts that threat",
        "32. Qf3": "This discourages ...d3 and still supports a possible advance by my f-pawn",
        "32... Nb4": "Black supports the potential advance and threatens c2 again.",
        "33. Rc1": "White is still committed to cowering defence.  All these moves are eating away at the clock...",
        "33... Nd5": "Black has succeeded in centralising his N and the threats of ...Nc3 and ...Ne3 look nasty",
        "34. Be2": "Relieved from defensive duties, my white-squared B ventures out into the sunshine.",
        "34... Nb4": "Black reinstates the threat on c2.",
        "35. Bc4": "! but now I use my B to block that attack and simultaneously set up attacking chances involving f7.  I planned to make Black take even longer to think in order to ward off my threats",
        "35... a5": "Black apparently plans to undermine the Bishop's support.",
        "36. f5": "! giving Black further cause to think.",
        "36... Kg7": "Black unpins his f7 pawn and discourages f6",
        "37. Qg4": "setting up another pin and also toying with the possibility of Qh4 and Qh6+",
        "37... d3": "Black resumes his attack.  I had about 10 minutes left at this point, Black about 5; but he wasn't watching his clock....",
        "38. cxd3 Nxd3 39. Rf1": "threatening once again to advance to f6.  I started to feel hopeful now.",
        "39... Ne5": "Forking Q and B but I had my response already planned.",
        "40. Bc3": "Pinning the N",
        "40... f6": "unpinning",
        "41. Bxe5": "I was happy to play this essential swap.  This B was less useful than the other one.",
        "41... Qxe5 42. fxg6": " hoping to play Qd7+ soon.",
        "42... hxg6 43. Rf3": "but I saw another line of attack utilising my rook",
        "43... Rc7": "and Black prevented Qd7+",
        "44. Rg3": "and as Black pondered his reply, his flag dropped, as I was quick to point out.  I had about 4 minutes left myself.  We analysed briefly afterwards, both convinced that Black was winning on the board but couldn't work out how.  It was actually easier for White to equalise material than it was for Black to press for victory.  Overall, despite playing worse for most of the game, I think I deserved this win, for handling my clock better and creating problems for Black when I was down on material, giving him further time trouble."
    },
    "url": "https://gameknot.com/annotation.pl/oxford-league-witney-1-v-didcot-1-bd-5?gm=26658",
    "gameName": "Oxford League Witney 1 v Didcot 1 Bd 5",
    "players": "Bob Jacobs (1776) vs. Howard Searle (1840)",
    "opening": "Robatsch defence (B06), three pawns attack"
}