{
    "moves": {
        "1. e4": "Unlike the other grandmaster games that I have annotated so far, this game does not contain any spectacular sacrifices or fancy piece manoeuvring for a flashy win, but the play is sharp [though there is a sac in here, a positional one] However, you may find the ending position of this game very interesting indeed... ;) Howell takes the White pieces; Nielsen takes the Black pieces\n",
        "1... e5 2. Nf3 Nc6 3. Bb5": "Ruy Lopez...\n",
        "3... a6 4. Bxc6 dxc6": "...exchange variation\n",
        "5. O-O": "5.Nxe5 Qd4! is a well-known trick in the position, and there would be no doubt that Howell is aware of it. Castling now makes it safer to grab the pawn on e5...\n",
        "5... Ne7": "...which Nielsen neglects to protect, not that I'm calling it a bad move. I am never sure whether the e5 pawn is worth protecting in the Ruy Lopez - despite its reputation as one of the most popular chess openings, I don't come across the Ruy Lopez a lot in my games. \n",
        "6. Nxe5": "Capitalising, Howell immediately snaps off the pawn...\n",
        "6... Qd4": "... and Nielsen counters - the best move in this position, it looks to me. Both the knight and the pawn is threatened now, and Nielsen now has an opportunity to equalise...\n",
        "7. Qh5": "...once he protects f7, that is. Qxf7+ isn't checkmate, but obviously it shouldn't be allowed\n",
        "7... g6": "! A good multi-purpose move in this position, protecting f7, gaining tempo at the white queen's expense and preparing a kingside fianchetto\n",
        "8. Qg5": "Forced, to keep protection of the white knight...\n",
        "8... Bg7": "...which will now have to move anyway - it looks to me that Nielsen has successfully gained compensation for the lost pawn\n",
        "9. Nd3": "the best square for the knight, as you will find out over the next couple of moves....\n",
        "9... f5": "The e4 pawn is pure, undiluted toxin for Nielsen; 9...Qxe4?? 10.Re1! and Black will have to lose the exchange [Qxe1+] to avoid Qxe7 mate. However, the pawn is still in his targets; while capturing with the queen is fatal, capturing with the f5 pawn is perfectly fine. The pawn on f2 is unable to back it up because the Black queen pins it, so how can Howell save it?\n",
        "10. e5": "!? he doesn't... or does he? Seriously, does he, because in all honesty, I cannot see any reason why Nielsen can't regain the pawn here with 10...Bxe5, because that was not what was played. My only guess was that Nielsen was concerned with keeping his dark-square bishop, but if anyone has spotted a trick that I've missed, feel free to comment [oh, another fun note here is that the e5 pawn is now a passed pawn - and only ten moves in too! Though it never moves again in the game :)]\n",
        "10... c5": "It may also have been possible that Nielsen hoped to kick the knight away from its d3 post before taking on e5, so that Howell didn't have the option of getting rid of the bishop. If so, then the next move would have certainly been an unpleasant surprise...\n",
        "11. b3": "! Very nice! Not only is the a1 rook immune to capture [else Bb2 will win the queen], this also saves the e5 pawn - not because it hinders the advancement of Nielsen's, but because 11...Bxe5? will now be met by 12.Bb2!, winning the bishop. Notice how useful the d3 knight is in both variations. {EDIT; Actually, 11...Qxa1 12.Bb2 Qxa2 and the Q escapes... in that case, then Nc3! needs to be played first, and then the queen is lost next move after Ba3! - credit for this goes to eden8}\n",
        "11... b6": "No longer able to capture the e5 pawn, Nielsen switches focus. A fianchetto of the light-square bishop would be good for Black here, as the bishop claims the clear long diagonal while aiming at White's king. This may not have been Nielsen's intention with this move, as he doesn't want his queen tied down to the defence of c5...\n",
        "12. Bb2": "This move was just asking to be played - Howell fianchettoes his own bishop with tempo. - what's interesting about this is that the long dark-square diagonal is occupied by both bishops; the first of two rarities that will appear in this game.\n",
        "12... Qg4": "Offering an exchange of queens. It doubles up pawns on the g-file, but to be honest, the Black queen didn't have a lot of promise with activity if she retreated down the d-file. Besides, maybe Nielsen could make something of the semi-open f-file...\n",
        "13. Qe3": "Howell declines the exchange - I would have thought that the exchange would have favoured White, but he thinks differently [this understanding is beyond me!]. Perhaps he has future plans involving that queen...\n",
        "13... Nd5": "! But now Howell will have to deal with this move! Knight centralisation with tempo - simple and strong. The White queen only has one place to go...\n",
        "14. Qe1": "...and it appears that Black enjoys a healthy space advantage - good compensation for his lost pawn. Again, notice how useful the White knight is in this position, or else 14...Nf4!! would be crushing [15.g3 Bb7 and Howell would have severe light-square weaknesses]\n",
        "14... f4": "!? Interesting... I would have preferred Bb7 in this position. The threat of 15...f3! is very real indeed, but Howell prevents that easily...\n",
        "15. f3": "! With this move, which has the additional advantage of driving away the queen!\n",
        "15... Qg5 16. c4": "Howell continues to make good use of his gained initiative, gaining a tempo attack on the knight...\n",
        "16... Bf5": "?!... or not. Nielsen is looking for a positional advantage, but in doing so he gambits a second pawn...\n",
        "17. Nxc5": "! Like this!\n",
        "17... bxc5 18. cxd5 Bd3": "This is the point of Nielsen's idea taking advantage of the fact that Howell no longer has his light-square bishop, he thrusts his own light square bishop right into the enemy camp with tempo! Here, Rf2 is forced if Howell wants to maintain his material lead, at which point the rook will be hard-pushed to get into the game [the bishop also blocks the d2 pawn]\n",
        "19. Nc3": "! But then again, who says that Howell wants to preserve the rook? The idea is that White is willing to give back some material to nullify Black's desired positional advantage. I'm sure that Nielsen was surprised by this move, and I find his next two moves very strange indeed...\n",
        "19... O-O": "First of all, why not take the rook and equalise material right now? I guess that Nielsen wanted to see if he could still gain that positional advantage with the bishop - maybe Howell might chicken out and play Rf2 now? Perhaps Nielsen was also hoping for 20.Ne2, which also keeps the positional advantage for Black - along with a pawn after Bxe5\n",
        "20. Ne4": "Nope, Howell is still willing to let go of the rook, but first, of course, Black needs to deal with the fork on the queen and the pawn. Qe7 is the only way to save both...\n",
        "20... Qf5": "? so why wasn't it played? I can't see any attacking opportunities for the queen on f5, nor can I see a way to punish Qe7 (maybe d6?) If anyone knows the reason for this move, feel free to comment :)\n",
        "21. Nxc5": "Wasting no time, Howell pounces on the c5 pawn...\n",
        "21... Bxf1": "And Nielsen's bishop, threatened with capture, finally captures the f1 rook\n",
        "22. Kxf1 Rad8": "An attack on the d5 pawn...\n",
        "23. Qe4": "Howell defends.\n",
        "23... Rfe8": "Threatening to win the e-pawn this time...\n",
        "24. d4": "Howell defends once again!\n",
        "24... Qxe4": "Nielsen knows he's lost, but he allows the final position to take place...\n",
        "25. fxe4": "At this point Nielsen resigns - Black's position is hopelessly lost. He was a weak pawn structure with two isolated pawns on a6 and c7 which will be vulnerable to White's pieces. Furthermore, both rooks and the bishop are hampered by White's four pawns - the ultimate centre! Apparently, out of all the recorded games, only 15 have managed to achieve this feat. What a brilliant final position this is! Another interesting feature is that Howell was able to preserve all of his nine pawns! Hope you enjoyed! :)\n"
    },
    "url": "https://gameknot.com/annotation.pl/perfect-square?gm=33736",
    "gameName": "'Perfect Square'",
    "players": "D Howell (2616) vs. PH Nielsen (2700)",
    "opening": "Ruy Lopez (C69), exchange variation, 5.O-O"
}