{
    "moves": {
        "1. d4": "Another game from another one of Trafalgar's members, though this time not a team match. This game is now currently man-on-a-mission's highest rated win (against an expert player, no less). The game kicks off with a Queen's Pawn opening.... [looking at a game between higher rated players should also give me a few pointers on how to improve my own game :) It would also be likely that I miss certain strategies by both players, so all comments are appreciated]\n",
        "1... d5 2. c4": "and now the Queen's Gambit... (I see this a lot when I play in a d4 d5 game)\n",
        "2... c6": "...Declined\n",
        "3. Nf3 g6": "!? Black goes for an early fianchetto kingside\n",
        "4. cxd5": "White instigates a pawn trade...\n",
        "4... cxd5": "...and Black's kingside isn't looking that good. However, since White can't exploit this just yet, Black's in no real danger (for example, a check on a4 achieves nothing because Black can block with his bishop)\n",
        "5. Bf4 Bg7 6. e3 Nf6 7. h3 Nc6 8. Be2": "All normal developing moves, but I've noticed that White has taken a rather defensive approach to his opening move, such as 7.h3 (possibly seeing Bg4, pinning the queen) and 8.Be2 (the bishop doesn't have a lot of influence on that square) I would have simply played 7.Be2 (if I was worried about the pin) and would have never played h3 at all [though to be perfectly honest, I never play these kind of moves myself...perhaps there is something in this move :)]\n",
        "8... Nh5": "The plan is pretty obvious - Black is looking towards trading his knight for White's bishop. If White were to allow this, he would have lost a good bishop, and would have doubled pawns on the f-file. What to do? \n",
        "9. Bh2": "Of course - simply avoid the exchange! in addition, the bishop will be hard to attack on the h2 square, but keeps the pressure along its diagonal\n",
        "9... a6": "?! With the same idea as White's 7th, to stop the pin on the knight, but there would be no pin after 0-0 [but then again, I'm questioning a guy whose 450 above me in terms of rating, so what do I know? I'll just call it how I see it :)]\n",
        "10. O-O": "Castling queenside doesn't look too appealing here, so this move was pretty obvious\n",
        "10... Bf6": "This move seemed so weird when I first looked at it, and I would have never considered it if I were Black, [I would have just castled] but there is a purpose behind this- Knight to g7, then to f5 (definitely better than the square its on now) . A slow approach for Black, but there doesn't appear to be any breakthroughs for either side in this position\n",
        "11. Nc3": "simple knight development....\n",
        "11... e6": "?! apparently Black thought the queen wasn't enough to defend that pawn. However, this move makes it harder for Black to get his light-square bishop into the action\n",
        "12. Ne5": "! If Black were to exchange one of his pieces with White's knight, he could land a pawn on the e5 square, which would put a slight cramp in Black's position (would it?) It also threatens Bxh5, which (other than winning a pawn) would mean that Black will never have a truly safe haven for his king.\n",
        "12... Ng7": "Saving material (did Black plan to do this anyway? I wouldn't know...) But, since the material advantage has been denied, White will go with a positional advantage instead...\n",
        "13. Nxc6": "...with this exchange (and the reason why I gave White's last move a !) How? you'll see [maybe you've already spotted it :)]\n",
        "13... bxc6 14. Rc1": "The c-file is a good place for the rook right now\n",
        "14... O-O 15. Na4": "! The knight is headed for c5, and it can;t be stopped. That was what 13.Nxc6 achieved for White - there are no pawns to chase the knight away\n",
        "15... Nf5": "The Black knight completes it's journey to the f5 square\n",
        "16. Nc5": "And the White knight completes its journey to the c5 square. Looking at his position, only 16 moves into the game, I would definitely favour White - he has much more space and control and has finished development, whereas Black seems a little cramped and has yet to develop his rook and bishop! (both sides have yet to get their queens into the action) What's more, it will be hard for Black to get these pieces activated [why not Rxc6? my best guess to that would be that after Bf7, Black might have more space to work with]\n",
        "16... Be7": "Looking to get rid of that strongly placed knight...\n",
        "17. b4": "! good thinking - now, if Black tries to get rid of that knight, White gets a formidable looking pawn chain from f2 to c5 (which, by the way, are safe from the light-square bishop)\n",
        "17... Bd6": "Black forgets about the knight, and instead decides to exchange White's strongly placed bishop - it's gonna happen no matter what White does...\n",
        "18. Bxd6 Nxd6": "Qxd6 doesn't really achieve much, since the Black Queen wouldn't really have a lot of squares to go to\n",
        "19. Bd3": "Clearing way for the queen to advance\n",
        "19... f6": "seems reasonable enough - next would be e5, and if White exchanges then suddenly Black's rook, queen and bishop will have a lot more space to work with!\n",
        "20. Qe2": "connecting rooks and threatening to win the pawn on the a6 square - not a bad move!\n",
        "20... Qb6": "The alternative to defend the pawn was 20...a5, but then White will get the c-file completely opened up after 21.b5! Another thing this move does is to threaten the b4 pawn, and White needs to do something about it...\n",
        "21. Rcb1": "White defends with the rook, and places his rook on the same file as the enemy queen\n",
        "21... e5 22. dxe5 fxe5": "Black exchanges one of White's pawns, and makes more space kingside. Since all of White's pieces are currently aimed more at the queenside, Black doesn't need to worry about an attack...\n",
        "23. Qc2": "or does he? White's plan is 24.Bxg6! hxg6 25.Qxg6+ Kh8 26.Qxd6, winning two pawns and decimating the Black king's defence\n",
        "23... e4": "the best move - simply block in the diagonal. I'd say there's probably good chances for both sides to get a win out of this\n",
        "24. Be2 Nf5": "Black's attack has to be on the king kingside, so this is a natural move in Black's positio\n",
        "25. Rfd1 Qc7": "White doesn't seem to have much of a plan, as far as I can see. Black knows where he should attack, but there doesn't seem to be a breakthrough for him yet\n",
        "26. Qb3": "pinning the d-pawn to the king. White will immediately try to exploit this pin\n",
        "26... Nd6": "?! surely Nh4 would be better? White wouldn't be advised to play 27.g3? Nf3+! 28.Bxf3 Rxf3 - Black wins a pawn and suddenly has a powerful attack!\n",
        "27. f3": "threatening to win a pawn because of the pin on the d-pawn (notice how it seems to be White who is making all the threats?)\n",
        "27... Rf7": "Breaking the pin. Black sees that Kh8?? leads to a mate in three after Qc3+, and on that note he would like to avoid the tempo check after Kg7 (again, Qh3+) that would put White's queen on a better square. This move was probably best.\n",
        "28. fxe4": "White goes ahead with the pawn trade anyway\n",
        "28... dxe4 29. Rd2": "planning to double up the rooks on the d-file - this turns out to be critical in the final position for White\n",
        "29... Kg7": "Breaking the pin so that the rook can move....\n",
        "30. Rbd1 Rf6": "? but Black walks right back into it! I have no idea what he was thinking here...\n",
        "31. Qb2": "sure - why not?\n",
        "31... Kf7": "again, breaking the pin\n",
        "32. Qe5": "White gets aggressive! \n",
        "32... Qe7": "Hoping for a trade of queens, but White declines...\n",
        "33. Qc3": "notice the position of Black's queen? \n",
        "33... Ra7": "?! I don't really get what Black was trying to do with this move...\n",
        "34. Bc4+": "White gets in a check with his bishop...\n",
        "34... Nxc4": "? Ouch! Black has been parrying White's threats the whole game, but he has finally succumbed to a deadly combination from White!\n",
        "35. Qxc4+": "obvious...\n",
        "35... Kg7": "If Kf8, White would play Qh8+ to force the king back to the 7th rank (Black probably didn't play it because Qh8+ wins a pawn\n",
        "36. Rd2d8": "! Here we go! attacks the bishop and threatens Rd7+! The only move available for Black would be Be6... (but 36...Be6 37.Nxe6+ Rxe6 38.Rc8 and White keeps up the pressure)\n",
        "36... Bxh3": "? Black doesn't see this, and plays a desperation move!\n",
        "37. gxh3 Rf5": "?? Makes a bad situation much worse! now White wins material with 38.Rd7. Black sees this too, and resigns - well played by White! :)\n"
    },
    "url": "https://gameknot.com/annotation.pl/the-canadian-connection?gm=29840",
    "gameName": "'The Canadian Connection'",
    "players": "man-on-a-mission (1692) vs. cimo (1805)",
    "opening": "QGD Slav (D11), 3.Nf3"
}