{
    "moves": {
        "1. e4": "I really liked this game, The game is a good example of the awesome power that a queen and bishop can demonstrate when they combine their strength to form a battery.\n\nWhat I liked in particular is the creative way in which I managed to bring all my forces into play combined in a an attack over the a8-h1 diagonal.",
        "1... e5 2. Nf3 Nc6 3. Bb5": "Spanish, the first few moves are standard. I was already preparing for the Breyer variation, my favorite defence against the Spanish opening.",
        "3... a6 4. Ba4 Nf6 5. O-O Be7 6. Re1": "Nothing new so far",
        "6... b5 7. Bb3 d6 8. h3": "Still the usual moves. White needs to prevent Bg4 here because it would allow black to equalize easily.",
        "8... O-O 9. c3 Nb8": "And there is the Breyer defense. Te knight is on its way to d7 where is is better placed. I also play this move to avoid the more common opening lines, such as 9...,Na5. In fact I have played some nice games with 9...,Nb8; and feel comfortable with it.",
        "10. d4 Nbd7 11. Be3": "The normal continuation is Nbd2. The bishop is well placed on c1, so white is probably losing time here.\nThe best reponse for black seems to be 11...,Bb7, when white has to respond with d4-d5. After that black  can undermine white's pawn formation with c7-c6, and is probably better.\n\nIn the game I wasnt sure, and decided to continue with the usual build up. ",
        "11... c5 12. Nbd2": "During the game I felt white might be better now, I felt uneasy about that bishop on e3, putting pressure against c5. However the bishop is in reality not much better placed than it was on c1. Looking back I actually don't think black has much to fear.",
        "12... Bb7": "One disadvantage of Be3 is showing, the bishop is in the way of Re1.\nThis allow black to increase his pressure against the pawn on e4.",
        "13. Bc2 Re8": "Aiming at e4 again. At this point I am still playing the usual moves without giving it too much thought.",
        "14. dxe5": "A good response, opening lines, putting more pressure on c5, and defending e4.\n\nI was hoping for d5, a pawn structure I am familiar with. \nAfter that I would have played g6 + Nf6-g8-e7 + Bc8 to prepare for f7-f5. With the pawn structure closed (after d5) the game tends to be slow and include a lot of manoeuvring. However I think black has an advantage after d5, if he can push f7-f5 through.",
        "14... dxe5 15. b3": "A strange move. I he preparing for the pawn breaks c4 or a4?\nOr is he afraid of black playing c4 and Nc5?\nI think white would have done better to keep developing with Nd2-f1-g3.",
        "15... Bf8": "At this piint was still not feeling inspired, and was struggling to find a good plan.\n\nI was sticking to what I know, almost as if the exchange on e5 had never happened. \nHowever I am not sure if this moves makes sense here, since e5  is blocked after 14.dxe5,dxe5;",
        "16. Qe2": "Possibly aiming to attack b5 with 17.a4.",
        "16... Qc7": "In defence of both e5 and b5, in case white is planning a pawn break with either f4 or a4",
        "17. Nh2": "OK, so white is now planning f4.",
        "17... Kh8": "A weak move, showing a lack of inspiration. I had not good plan at this point.\nPartly I am still thinking about maybe playing Nf6-g8-e7, and preparing for f7-f5.\nThat plan looks suspicious in this open position though.",
        "18. Ref1": "More preparations for f2-f4. Black need to think about how to respond.",
        "18... Bd6": "Trying to prevent f2-f4.\nI dont think white  can play f4 + fxe5 because black will gain a strong outpost on e5 for his knight.\nHowever white could perhaps play f4-f5, in the hope of storming blacks king.\nIn that case black must seek counterplay through the centre of on the queens side of the board.",
        "19. g3": "This may seem a good move, but it is really a mistake.\nWhite is creating a dangerous gaps around his king.",
        "19... Qc6": "A strong response, which pinpoints the problem with white's last move, which weakened the a8-h1 diagonal. After this move black I feel has the upper hand, and white must be carefull. \n\n\nFor example,  white now has difficulty playing f2-f4.\nNot good is 20.f4, exf4; 21.gxf4?, Nxe4 and white is on trouble over the big diagonal.\nBut After 20.f4, exf4; 21.Bxf4 black gains a strong point on e5, an active play against the e4 pawn.",
        "20. Rae1": "Well played I thougt initially, but looking back the rook doesn't actually achieve much here. \n\nSo what should black do next?\nAfter pondering long about my last move, I had come to realize that I needed to continue with an  attack the e4 pawn, with the aim of and hopefully opening the a8-h1 diagonal. But how?\n\nMy thoughts were going in the direction of playing b5-b4, in the hope of attacking the knight with either cxb4,Bxb4, or bxc3.  Attacking the knight would undermine the pawn on e4. The problem is white can simply respond with c3-c4.\n\nI therefore decided on a creative pawn sacrifice with the aim of putting the above plan into action.",
        "20... c4": "An inspired strike at white centre. \n\nThe idea it to block c4 first with a pawn sacrifice, and then continue with b5-b4.\nSo if 21.bxc4 black continues with 21...b4!; 22.cxb4,Bxb4 and pawn e4 is under threat. \nThe whole position now  revolves around e4 and the b7-h1 diagonal.\n\nPerhaps the game might have continued 21,bxc4, b4!; 22.cxb4, Bxb4; 23.f3 (!), Bxb4. \nCertainly black has managed to create complications and put pressure on an opponent with a lower rating.",
        "21. b4": "Understandable, but this does not solve white's problem. In fact it makes it worse, because it allows black to bring in the heavy artillery (Ra8)",
        "21... a5": "Black is bringing in the rook reinforce his attack against e4.\nIt may seem odd that the rook on a8 can strike at e4, but it can, as we will see soon. ",
        "22. Reb1": "A mistake, white is not finding the best moves.\nHe could have continued 22.bxa5, Rxa5. 23.Bb1, Ra3; and white has to surrender a pawmn, either a2 or c3.\n\nHowever black cannot continue with his attacking idea after 22.bxa5..\nIf 22.bxa5, b4? then white can defend with 23.Nxc4, Nxe4; 24.f3 and black has too little for the pawn.\n",
        "22... axb4 23. cxb4 Rxa2": "Perhaps an immediate c3 might have been slightly better.\nFor example 23...,c3; 24.Ndf3, Ra2!, and the e4 pawn falls, opening the a8-h1 diagonal at the same time.",
        "24. Rfc1": "The most obvious response.\n\n",
        "24... c3": "Finally\n\nWhite had a chnace to respond with  Bb3 here, after which  suddenly things get complicated.\nHowever after 25.Bb3 ?!, Nxe4; 26.Bxa2, Nxd2; 27. f3, Nxb1; 28.Rxb1 black does have a clear advantage. Another method is 25...,Bb3?!, cxd2; 26.Bxa2, Nxe4 threatening Nc3 or Nxg3.",
        "25. Nb3": "Another small mistake, because pawn b4 is not protected.\n\nThis position we have reached is what black has been after.\nAll his pieces are working together in the attack on e4.\nAnd behind the e4 pawn lies an open diagonal to white's king.\n\nPlease also note that black has a second winning strategy here: Bxb4 to create a pair of free pawn which will be hard to stop.\n\n\nWhite should have played better however, stronger would have been Ndf3 to close the a8-h1 diagonal.\nFor example   25.Nf3, Nxe4; 26.Qd3, Nef6; threatening e4!. Black would also like to play Nd5 to attack pawn b4.",
        "25... Nxe4": "Finally, success, black now has major threats on the a8-h1 diagonal.\nWhite should have closed this immediately with f3.\n\n",
        "26. Bxe4": "Another mistake, but this time it is fatal. Black can now bring out the big guns.",
        "26... Qxe4": "Was white thinking about taking the rook on a2 ? \nHe does not have the time for it now, as black threatens checkmate on g2 or h1\n\n",
        "27. f3": "I had been planing to play Rxe2 here, but then I realized I have a much better move.\n\nBlack wins either way though. After 27...,Rxe2; 28.fxe4, Bxe4 white loses material, because of the tripple threats Rg2+ or Rxe3 or Bxb1. White's best bet is probably 29.Bf2, Bxb1; 30.Rxb1, Bxb4 and black should win easily with extra material and his free pawns.\n",
        "27... Qxb1": "Look ma'am, its a free rook!\n\nI thought white would surrender here, but he found one last trick to try.\nThe fight is over however, black has won.\n",
        "28. Qxb5 Qb2": "O my, another battery, this time rook and queen.\n\nThis time white surrendered, he has no defence left.\n\n"
    },
    "url": "https://gameknot.com/annotation.pl/a-battery-of-queen-and-bishop?gm=49761",
    "gameName": "A battery of Queen and Bishop",
    "players": "bareel_repo (1562) vs. eduard352 (1739)",
    "opening": "Ruy Lopez (C88), closed, Leonhardt variation"
}