{
    "moves": {
        "1. d4 Nf6 2. Bf4 Nd5": "Interesting and new but... good?",
        "3. Bg3 b5": "Even more original and even more questionable. ",
        "4. e4 Nb6": "Not even leaves the black diag to the queen, in sight the bishop is out of the defence. ",
        "5. Bxb5": "Why not?",
        "5... c6": "Blocking his own good diagonal. ",
        "6. Bd3 Ba6": "BxB, NxB and Nb4... a well known pattern. ",
        "7. c3": "The key point is b4, so I protect it by defending solidly. This opens the white squares to the queen, and the knight in c3 blocked my own pawn. ",
        "7... Bc4": "Again, original. But I won't lose my temper. ",
        "8. b3": "Voilà, and expansion free of charge on the queenside. ",
        "8... Bxd3": "Finally, and almost forced (the retreat was hummilliant). ",
        "9. Qxd3 a5 10. Nd2": "I decided not to care for the attack. ",
        "10... e6": "Still nothing dangerous. ",
        "11. Nh3": "the best square, since I want to go f4. ",
        "11... Ba3": "Wonderful... so what?",
        "12. O-O Na6": "Which kind of attack is black planning on the queenside?",
        "13. f4 O-O 14. f5": "Contact!",
        "14... e5": "I couldn't ask a better move, since...",
        "15. Bxe5": "Now, f6 was obvious, but cutted the black queen out of the action. ",
        "15... d6 16. Bxg7": "? Premature. I was sure I had a mate net, but I was wrong. ",
        "16... Kxg7 17. Qg3+ Kh8 18. f6 Rg8": "...and nohing. True the material is even, and black minor pieces are useless on the queenside. What else do I have?",
        "19. Qh4": "Threatening Ng5. Isn't it obvious?",
        "19... Bb2": "? Can you believe?",
        "20. Ng5": "? I should have played Nf3 before, and it would have been deadly. ",
        "20... Rxg5 21. Qxg5": "+2, and a threatened rook, plus a mate threat. ",
        "21... Qg8 22. Qxg8+ Kxg8 23. Rad1": "I'll lose c3, but...",
        "23... Bxc3 24. Nf3": "My position is not so terrible. ",
        "24... Nb4": "Black wants to make use of his dead pieces now that the storm on the black king has fainted. ",
        "25. Rf2": "! I like this move, it prepares a complete refutation of black's attack. ",
        "25... Re8 26. a3": "Never defend if you can safely attack something bigger...",
        "26... Na6 27. Rd3": "Idem... but now the bishop is trapped, and is dead lost. Ba1, Ra2. Here my opponent abandonded the game. "
    },
    "url": "https://gameknot.com/annotation.pl/a-bad-day?gm=53114",
    "gameName": "A bad day.",
    "players": "damalfi  vs. 1900 player ",
    "opening": "Queen's pawn game (A45)"
}