{
    "moves": {
        "1. e4": "This is a game I witnessed between two players who were in the same group as me in the 38th GK tournament, round 2. It's long, but I think it's well worth following through to the end to see an interesting endgame tactic... that the players missed.",
        "1... e6 2. d4 d5 3. e5": "French Defence, Advance Variation. The main alternatives are 3. exd5, 3. Nc3 and 3. Nd2.",
        "3... c5 4. c3 Nc6 5. Nf3 Qb6": "This is all book. Black is playing to put pressure on d4, White to defend it.",
        "6. Bd3": "Seems to weaken d4, but still a main line. 6. Be2 and 6. a3 are the alternatives.",
        "6... cxd4 7. cxd4 Bd7": "7...Nxd4? 8. Nxd5 Qxd5 9. Bb5 !",
        "8. O-O": "The Milner-Barry Gambit. White parts with the d4 pawn, hoping that his piece activity will compensate. 6. Bd3 basically commits White to making this sacrifice, since if 8. Bc2, Nb4!",
        "8... Nxd4 9. Nxd4 Qxd4 10. Qe2": "This is where we leave book, which is Nc3. (This seems to lose a second pawn, but if 10...Qxe5, 11. Re1 and 12. Nxd5.) Play might continue 10...a6 11. Qe2 Ne7.",
        "10... Bc5 11. h3 Ne7 12. a4": "To support a later Bb5 without allowing Bxb5 Qxb5 Qxe5. White's plan is questionable, as the original idea of the Milner-Barry Gambit is to allow White's light-squared bishop to reach its best square, while Black's LSB is trapped behind its own pawn chain (as often happens in the French).",
        "12... Nc6 13. Rd1": "Another poor move, failing to defend e5.",
        "13... Qxe5": "After the knight capture, White has Bxh7 chipping a hole in the Black king's intended refuge.",
        "14. Qxe5 Nxe5 15. Bb5": "As planned. But now that queens are off, this move seems even worse than it did before, because White is simply entering a poor endgame in which Black has two pawns and the compensation. (Who was it who made that quip?)",
        "15... Bxb5 16. axb5 O-O": "Black could have considered 16... Kd7; it isn't quite an endgame yet, but White has little chance of an attack, especially considering his poor development.",
        "17. Bf4 Ng6 18. Bg3 Rae8": "Black's first questionable move, by my tastes. The other rook is doing nothing on f8, whereas 18...Rfe8 would have allowed a later Rac8, taking the open file, or Rad8, placing both rooks behind the powerful central pawns.",
        "19. Nc3 d4": "Understandable, but careless, in view of White's reply.",
        "20. Ne4 Bb6": "Any other bishop move allows Rxa7, and 20... Rc8 is met by 21. Nxc5 Rxc5 22. Rxd4 Rxb5. Black finishes still two pawns up, but White has exchanged the worthless b5 pawn for the powerful d4 pawn.",
        "21. Nd6 Red8": "21... Rb8 is an interesting try here, asking White to do his worst. After 22. Nxf7 Kxf7 23. Bxb8 Rxb8 Black's two minor pieces should be worth more than a rook; after 22. Nf5, Rd8 keeps everything defended; best is probably 22. Nc4 Rbd8 23. Nxb6 axb6 24. Ra7 Rd7 25. Rc1 intending Bc7.",
        "22. Nxb7 Rd7 23. Nd6 e5 24. Nc4": "A good choice of retreat, combining defence with attack; on a later Rc8 (after defending the e-pawn), b3 keeps the c-file closed for at least a while.",
        "24... Rfd8": "Oh dear, what can the matter be?",
        "25. Nxe5 Nxe5 26. Bxe5 f6 27. Bg3": "Now material is level again at last. White has blockaded doubled pawns and Black has a passed pawn, so Black looks better, but the d-pawn will not be easy to advance now that it is isolated.",
        "27... Kf7 28. Rd3 Ke6 29. Re1+ Kd5 30. Rc1": "This move (together with the next) helps keep both open files guarded.",
        "30... Re7 31. Kf1 g5": "Black could double his rooks on the e-file as White has no immediate threat of winning the d-pawn, but he instead goes for kingside play, perhaps hoping to break through with three pawns against three.",
        "32. f3 h5 33. b4 h4 34. Bf2 a5": "A horrific blunder, as the following play proves.",
        "35. bxa5": "This gives White the better game, but he could have got (and kept) two passed pawns by 35. bxa6. Play might continue 35... Ra7 36. b5 Rb8 37. Rb3 Bd8 38. Ke2 intending Kd3 and Black has no easy way to win the b-pawn.",
        "35... Bxa5 36. Rxd4+ Ke6 37. Rc6+": "An in-between check to drive Black's king away, so that White's will have time to come to the defence of his pawn. 36. Rxd8 Bxd8 37. b6 Rb7 38. Rb1 Kd5 and Black will soon win the pawn.",
        "37... Kf7 38. Rxd8 Bxd8 39. b6 Rb7 40. Bc5": "So that the rook can remain on the sixth rank after the anticipated Ke8 and Kd7.",
        "40... Ke8 41. Ke2 Kd7 42. Rd6+ Kc8 43. Kd3 Be7": "It seems as though White's plan has failed....",
        "44. Rd5": "White cannot save the situation by 44. Rc6  Kd7 45. Rc7  Rxc7 46. bxc7 Kxc7 47. Bxe7 as Black just plays 46... Bxc5.",
        "44... Bxc5 45. Rxc5+": "This check saves White, allowing him to get his rook behind the pawn where it belongs.",
        "45... Kd7 46. Rb5": "But White misses a simpler continuation: 46. Rc7  Rxc7 47. bxc7 Kxc7 48. Ke4 Kd6 49. Kf5 Ke7 50. f4! gxf4 51. Kxf4 wins.",
        "46... Kc6 47. Rf5 Rf7": "Naturally, 47... Rxb6 48. Rxf5  is game over, and 47... Kxb6 48. Rxf5  isn't much better.",
        "48. b7 Kxb7 49. Kc4": "49. f4! gxf4 50. Rxf4 Rg7 51. Rg4 Rh7 52. Rg6 f5 53. Rg5 f4 54. Rf4 1-0",
        "49... Kc6 50. Kd4 Kd6 51. f4": "Now it's less effective, as Black isn't forced to capture.",
        "51... Ke6 52. Ke4 Rg7": "52... gxf4 53. Rxf4 (not Kxg4? Rg7) Rh7 should be a draw, as White can't afford to be left with just a rook's pawn.",
        "53. fxg5 fxg5": "53... Rxg5 54. Rxg5 fxg5 is a clear-cut draw, but 54. Rf2 doesn't seem to leave White much chance of winning either.",
        "54. Rc5 Kf6": "The decisive blunder. 54... g4 is an easy draw; 55. Rc6  Kd7 gets White nowhere, and neither does allowing the pawn exchange.",
        "55. Rc6+ Kf7 56. Kf5": "A beautiful move, quietly closing the coffin lid. 56. Rc7  any 57. Rxg7 Kxg7 58. Kf5 Kh6 would only be a draw.",
        "56... Rg8": "As good or bad as any other move (except 56... Rg6, which really would be a blunder). Black has no escape.",
        "57. Rf6+": "This is one way to do it, but 57. Rc7  any 58. Rc8  any 59. Rxg8 Kxg8 60. Kxg5 any 61. Kxh4 was a straightforward crush.",
        "57... Ke7 58. Rg6 Rf8+ 59. Kxg5 Rh8": "Black must hold onto the h-pawn for as long as possible to make White's task more difficult.",
        "60. Kg4": "White cannot yet win the pawn by Rh6 because of Rg8 .",
        "60... Kf7": "Continuing the theme of making White's task as difficult as possible.",
        "61. Rg5 Kf6 62. Rh5": "Now this move is correct.",
        "62... Rg8+ 63. Kf3 Rf8": "The discovered check is powerless except to delay things a little.",
        "64. Rxh4": "According to the Nalimov tablebase, White mates in 40.",
        "64... Kg5+ 65. Kg3 Re8 66. Rh7 Re3+ 67. Kh2 Kg6 68. Ra7 Kh5 69. Ra5+": "Both sides are playing good moves, Black trying to delay the advance of the pawns, White trying to regroup his pieces so he can start advancing them.",
        "69... Kh4": "A terrible blunder.",
        "70. Ra4+": "White misses the easy win: 70. g3 ! Rxg3 71. Ra4 . But the move played is still winning.",
        "70... Kh5 71. h4 Rc3 72. g3": "This will be White's main strategy: advance the h-pawn, advance the g-pawn, advance the king, advance the rook to prepare for the h-pawn to advance again.",
        "72... Rc2+ 73. Kh3 Rc3 74. Ra5+ Kh6 75. h5 Rc4": "Note that it makes no difference whether or not Black unpins the pawn: after for example 75... Rb3, White would just play Kh4 and then g4.",
        "76. g4 Rc3+ 77. Kh4 Rc4 78. Ra6+ Kh7 79. h6 Rc5": "79... Rc1, threatening some spite checks, would delay the win a little longer, but White can still advance: 80. Kh5 Rh1  81. Kg5 Rc1 82. Ra7  Kh8 83. Kh5 etc.",
        "80. g5 Rc4+ 81. Kh5 Rc5 82. Ra7+ Kg8": "White's next move threw away the win. Before reading on, can you do better?",
        "83. h7+": "83. Rd7!! mates in 21. In a sort of sideways Lucena position, White can shelter from Black's checks by Kg4-f5-f6-e5 and Rd5. After this move, it's a draw.",
        "83... Kh8 84. Kh6 Rc6+": "Black has two drawing strategies: the one played, or 84... Ra5, and Black's rook will just mimic the movements of White's, being immune to capture because of stalemate.",
        "85. g6": "After 85. Kh5, Black just moves the rook along the sixth rank and White can never make progress. Ra8  loses the h-pawn, while g6 allows Rxg6.",
        "85... Rxg6+": "The clincher.",
        "86. Kxg6": "Stalemate. A fitting, if bizarre, end to an encounter in which both sides missed winning chances. White went on to win the group, partly helped by me resigning in a balanced position after my loss to the player of Black in this game meant I couldn't progress from the group."
    },
    "url": "https://gameknot.com/annotation.pl/a-bizarre-rook-ending?gm=18258",
    "gameName": "A bizarre rook ending",
    "players": "yates24 (1434) vs. blackbaron (1383)",
    "opening": "French (C02), advance, Milner-Barry gambit"
}