{
    "moves": {
        "1. d4 Nf6 2. Bf4 d5 3. Nf3 c5 4. c3 Qb6": "The sharp line by black. Ok, now I can put my queen on b3, and accept black to decide whether if to exchange it or not. I don't like it. ",
        "5. Qc2": "With this move we enter in a well known opening trick: Black can try Bf5, in sight that after QxB, Qxb2 wins the rook. BUT white has Qc8#, black must defend, and is to be said whether white has compensation for the exchange. ",
        "5... Nc6": "Not now, at least, but the threat is still there. Now there is no mate on c8, so I have to think what to do against Bf5. The line e3 - Be3 doesn't work because after the exchange, Qxb2 has no compensation for me (I?ve played it successfully, though). ",
        "6. e3 g6": "Black gives me another chance, and I take it. ",
        "7. Nh4": "Is this good? I'm not sure. ",
        "7... cxd4 8. exd4": "Any doubt this is the best way to take?",
        "8... Bg4": "This actually helps me. ",
        "9. f3 Bd7 10. g4": "I had to think about h6-g4. Now, I'd go g5. ",
        "10... Bg7 11. Nd2": "This knight is heading to c5. ",
        "11... O-O 12. Nb3": "I should have worked on the kingside already, but I felt that myqueenside was to be addressed. Maybe a mistake. ",
        "12... e5": "Taking advantage of my centered king. Very good move. I played the fool believing that e5 was mine. ",
        "13. dxe5 Rfe8 14. O-O-O": "Well, this was anyway my intention. Now what?",
        "14... Nxe5": "Is tempting g5 to snatch d5, but it doesn't work. My pieces become attacked and I won't have any tempo to take the pawn. ",
        "15. Nd4": "trying to control the game. This knight is not well placed here, but I plan to move the king and the dsb to better squares in short. ",
        "15... Nc4": "An excellent opportunity to solve some of my developement problems while connecting the rooks... at the cost of the bishop pair. But it gives me no need to move the king, and this is a tempo. ",
        "16. Bxc4 dxc4 17. Ne2": "?? This allows Qf2, and the only answer for white is Ng3, but the scenario is not good for white at any rate! Moreover, I overlooked the following tactic trick: ",
        "17... Ba4": "Black seized the chance to have a rook on the second rank, and I can't deny it without losing material. This time black outplayed me. ",
        "18. Qxa4 Rxe2": "This is to be called weakness! The only option is...",
        "19. Rd2 Qe6": "Good and decisive. My hanging knight in h5 will pay the cost of resisting such an attack. And I can't take c5, the lock of the cage. ",
        "20. Rhd1": "Well, just a faint chance... ",
        "20... a5": "?I can't believe that! I observed that the knight could safely shield the king on e8, a white square, so I couldn't allow it. ",
        "21. g5": "Hoping that removing a defender would lead to something. ",
        "21... Nh5 22. Rd2d8+ Rxd8 23. Rxd8+ Bf8": "and now, I don't have Bh6 anymore. I had only one hope: ",
        "24. Qa3": "...and pray! Isn't this a dramatic position? :-)",
        "24... Re1+ 25. Kc2 Qe2+": "And here my only move was Rd2, with BxQ to follow, RxQ, RxR+, Kd1, Rxb2, white saves the b f4, maybe in c7, and black has a won endgame. I blundered with Bd2, with Qd1# as a very bloody mate. But I will go on with the other following instead for amusement. ",
        "26. Rd2": "Black can take NxB, and win the game. ",
        "26... Nxf4 27. Qxf8+ Kxf8 28. Rxe2 Rxe2+ 29. Kc1 Rxh2": ""
    },
    "url": "https://gameknot.com/annotation.pl/a-chocking-mate-i-recieved?gm=52953",
    "gameName": "A chocking mate... I recieved.",
    "players": "damalfi  vs. vaffel ",
    "opening": "Queen's pawn game (A45)"
}