{
    "moves": {
        "1. d4": "I like 1. d4 better than 1. e4, mostly because I am more comfortable in the slower, positional games that usually arise out of this first move. I often wonder whether I should wade out into more tactical waters more often.\n",
        "1... Nf6 2. c4": "This common second move stakes further claim to the center. I do sometimes play 2. Nf3, especially against a particular opponent outside of GK who has destroyed me multiple times with the double-edged Budapest Gambit (1. d4 Nf6 2. c4 e5).\n",
        "2... e6 3. Nc3": "3. Nf3 is the other common move.\n",
        "3... Bb4 4. Qc2": "With 3...Bb4, Black has opted for the Nimzo-Indian Defense. This queen move is called the Classical variation. With Black's 3rd move, she adds to her control of e4 by pinning the white knight. It also indicates a willingness to trade the bishop for the knight once White plays a3. This queen move allows White to recapture without doubling his pawns, although in that case Black can often then gain time with ...Ne4, forcing the queen to move a third time in the opening. Time, pawn structure, development, and bishop vs. knight are always important to keep in mind, but are especially common themes in the Nimzo-Indian.\n",
        "4... c5 5. e3": "Black often castles on the fourth move, but instead hits d4 here, which is no longer guarded by White's queen. With e3, White plays a useful move that begins his king-side development while guarding the d-pawn, although for the time being it concedes the e4 square to Black. As it turns out, the book reply is 5. dxc5. I'm not overly familiar with the books, and just try to play what makes sense in the opening, but I realized later that I had entered a position where BLACK has a whopping 54% to 35% advantage in the GK database.\n",
        "5... O-O 6. Nf3": "Continuing to develop. Not ready to play a3 yet.\n",
        "6... d5 7. a3": "I play a3 now, and the consistent follow up for Black is to capture. Now that Black has played ...d5, White has the option of recapturing with the pawn, because he can un-double the pawns with exchanges.\n",
        "7... Bxc3+ 8. bxc3": "Capturing with the queen is still possible, but 8...Ne4 can then be played, the queen will move again, probably back to c2, and the knight is now protected by the pawn on d5. Nevertheless, I am unsure whether this is the correct decision.\n",
        "8... dxc4 9. Bxc4": "I am not sure the exchange by Black here is wise. White had not yet moved the king's bishop, and by capturing on c4 now Black allows the bishop to develop in one move. If Black waits for the bishop to move and then captures on c4, White has then used two moves to develop the bishop. I think 8... Nc6 (hitting d4) or 8... b6 (eye on e4) were more consistent moves for Black.\n",
        "9... Qc7 10. O-O": "When Black played 9... Qc7, I must admit I was not clear on the purpose. I thought Black perhaps intended 10... cxd4 11. cxd4 b5. In that variation White obviously can't play 12. Bxb5 on account of 12... Qxc2. If correct, it might explain Black's 8th move. But what would be the point of the b5 advance? Perhaps to create a passed pawn with ...a5 and ...b4? I wasn't sure. Either way, the variation above wasn't a major threat (after 11... b5, 12. Bd3 works) so I simply castled and completed the king-side development.\n",
        "10... b6 11. Qe2": "This move limits Black's bishop to b7 by covering a6 a second time. (From a6 Black could exchange bishops and remove White's advantage of having both bishops vs. one. Additionally, White's remaining bishop would be the currently limited one on c1.) Second, although Black has now moved the b-pawn just one square, 11. Qe2 prevents any shenanigans with White's queen and bishop on the c-file. Lastly, it guards the Knight with a piece. However, with Black's 10th move I thought I saw another intention of her ninth move, and White must be careful. For example 11... Bb7 12. Bd2 Ng4 and now 13... Bxf3 is a major threat that is hard for White to meet. For this reason I was already planning my next move in the event of the reply 11... Bb7 (and it wasn't 12. Bd2).\n",
        "11... Bb7 12. h3": "And this was it, keeping the dark knight off of g4. Pushing a pawn in front of the king does weaken some squares, but in this instance, a weaker g3 is still manageable, especially as Black lacks her dark-squared bishop. It's also useful in general to avoid having to worry about a back rank mate in the future. Of course, you don't want to play these preventative moves too often and risk having your opponent dictate your moves. With development mostly complete, It was now time for me to devise my plans for the middle game.\n",
        "12... Nbd7 13. Nd2": "The moves I initially considered here were a4 and Bd3. 13. a4 to play Ba3 and perhaps a5 later to clear the isolated pawn. 13. Bd3 to contest e4, and potentially push the e-pawn which would open the c1-h6 diagonal and, if Black tried to pressure the d-pawn with e5, I could push to d5 with the support of e4 and create a passed pawn. The first plan seemed rather limited, so I looked at the second. I thought Black might reply in one of three ways: Rfe8, Ne4, and e5. I decided I could handle e5, although worried about one variation that ended with f3 being forced on White, creating ugliness around the king. Rfe8 also ultimately did not discourage me either. Ne4 looked tough. It would force Bb2 or Bxe4 and I liked neither. So I started looking at a4 again and realized Black's best move was 13... Ne4, and I couldn't effectively stop it! I began looking at Nd2. It also eyes e4, and if 13... Ne4, then 14. Nxd2 Bxe4 looked okay. It was a knight on e4 I didn't want, and in this situation Black needed three moves (Bb7, Nf6, Ne4) to get back there while White could then play Bd3 and e4. After all this, it was clear this was my toughest opponent yet. I played Nd2 and hoped my reasoning was sound.\n",
        "13... Ne4 14. Nxe4": "I spent literally an hour on my thirteenth move, and Black played her 13th almost instantly! Fortunately, Nxe4 was a relatively easy decision, but my 15th move was likely to be another ordeal.\n",
        "14... Bxe4 15. f3": "I began wishing I had played Nd2 a move earlier. It would also have prevented the feared Ng4, and would not have weakened g3. But now I was strongly considering f3, with e4 to follow, leaving a gaping hole at g3. The question was whether my past mistake would affect my future decisions. If it did, I was going to play Bd3, but expect Nf6. Nevertheless, I was heavily leaning toward the f3-e4 plan. I didn't want to give Black time for Nf6. I thought that without his dark squared bishop, the hole wasn't a big deal. But I was aware of the Knight possibly eyeing g3 via f6 and h5. I thought that in that time I could play Bc1-e3-f2. Also on my mind was that a move earlier, I had seen a possible 14... Ne4 15. Nxe4 Bxe4 16. f3 Bb7 17. e4 e5 18. d5 f5 19. d6+. Even if Black were to not blunder into the discovered check, she would need an extra move to attack the pawn chain if that course of action was intended. Anyway, it was time to forge ahead. I was moving much more quickly after 13. Nd2.\n",
        "15... Bg6 16. e4": "Black's switch off of the a8-h1 diagonal caught me off guard, but didn't change my plan, even if I was starting to doubt its wisdom. For instance, I could see the knight perching at f4 instead of g3. Then it occurred to me that, although I'd have to be highly careful, perhaps I could maneuver the bishop to h2 via e3 and g1 with Kh1 involved, now that the black bishop wasn't on that same diagonal.\n",
        "16... Nf6 17. Be3": "I went to bed for the night and came back in the morning to see the 16th move I expected from Black. I realized the Kh1 concept was obviously bad on account of what a knight arrival at g3 would mean. I left for work and during my commute figured out a plan that I thought would prevent any knight maneuver. 17. Be3 Nh5 could be met by 18. Rfc1, avoiding a Ng3 fork, and if the knight went to f4 or g3, my queen was free guarding from the bishop and could go to d2, forcing the knight right back (even 18... Rfc1 Ng3 19. Qd2 threatens 20. Bf4). So I had to find Black's best move after 17. Be3. A rook to c8 or d8 seemed like a possibility, but I didn't see a move that made 17. Be3 bad. I played it.\n",
        "17... Nh5 18. Rfc1": "Black played the consistent 17... Nh5, so I followed up with my intended move. Having rushed 12. h3 earlier, I did look at some alternatives here but found none good. 18. Bf2 would prevent the fork, but then 18... Nf4 would force the queen either out of action to a2, or to another square where 19... cxd5 could not be met with 20. cxd5 on account of the loose bishop. After my rook move, I began preparing not for another knight move from Black, but for a rook move to d8.\n",
        "18... Rfd8 19. Bg5": "As expected, Black played Rfd8. I originally planned to play 19. Qd2 anyway, but 19. Bg5 grew on me. Obviously, she could not play f6 (Bxe6 with check). 19... Ng3 20. Qd2 would force the knight right back. 19... Rd6 or 19... Rd7 20. Bb5 Rd6 presented an opportunity to skewer queen and rook for an exchange if I played g4. So I thought the reply might be Nf6, which would be a concession: I would have repelled the first attempt at invading the dark squares around the king. Of course, Black could also play Re8, planning for f6 and Rad8. I remained unconcerned by, even hoping for, an eventual ...e5, because I would push to d5 and create the passed pawn. So I had all my responses prepared: Bb5 if Rd7 or Re8, Bxe6+ if f6, and Qd2 for all the other anticipated replies. After making the move, however, I realized my bishop had left d4 and thought cxd4 might get hairy, but thought I was okay after 19... cxd5 20. Bxd8 Rxd8 21. cxd4 Rxd4 22. Bxe6\n",
        "19... Rde8 20. Bb5": "Played 20. Bb5 quickly. At least for the time being, Black has conceded the d-file, and this move also gets her off the e-file. Wherever Black moved the rook here, I was fairly sure I was playing 21. Qd2. It was here I also began considering playing d5 myself eventually, forcing through a passed pawn, and using c4 as support. Either c4 or e4 were theoretically possible for Black to undermine.\n",
        "20... Rec8 21. Ba6": "Even before making my 21st move, I realized my 20th was another I hadn't thought through. The best square for that bishop was clearly c4, and now it was misplaced. I began to wonder if a draw was okay. Right now, Black had 4 squares for her king's rook: b8, c8, e8, and f8. It was of some use on either c8 or e8, but not much on b8 or f8. But, if it only moved between c8 and e8, my bishop could continue harassing it from b5 and a6. So I decided to go for 21. Ba6. If Black went back to e8, I'd play to b5 and offer a draw. The only way Black could refuse a draw was by putting her rook on a sub-optimal square--or trying ...f6.\n",
        "21... Rce8 22. Bb5": "Indeed, the reply was rook again to e8. I was going to play Bb5 again, but wondered whether I should wait a move before offering the draw. Perhaps now she would move the rook to a less active location? So I made the move but not the offer, although it looked like there might just be one more move. If she replied Rec8, I'd reply Ba6 and suggest the truce.\n",
        "22... Rec8 23. Ba6": "Draw agreed. I don't know, I feel like maybe I was slightly better here, on account of the minor pieces, but I do have an isolated pawn and that gaping hole at g3. I didn't like either square Black is insisting for her rook, and I'm really not sure how to make any progress. So I was okay with the draw. How does everyone think this game might have or should have proceeded?\n"
    },
    "url": "https://gameknot.com/annotation.pl/a-classical-nimzo-indian?gm=48039",
    "gameName": "A Classical Nimzo-Indian",
    "players": "hscer (1200) vs. tweethart10 (1200)",
    "opening": "Nimzo-Indian (E38), classical, 4...c5"
}