{
    "moves": {
        "1. d4": "Hi everyone!  This was an interesting game with a material imbalance which Bob kicks off with 1. d4.  Bob had a R + Piece + Pawn for Glenda.  My opponent's material balance so nearly worked in his favour.  At the end Bob's rook, two minor pieces and a pawn were swarming around Henry.  It looked as though I was going to cop Old Matey, but wait, what about Glenda?  Well ....... read on .....",
        "1... b5": "1....... b5 - I try the unusual.",
        "2. e4 Bb7 3. Bd3 a6": "3...... a6 - all on the wing!",
        "4. Bg5 g6 5. Nf3 Bg7": "5. ....... Bg7 - double fianchetto.",
        "6. O-O c5 7. c3 Qb6 8. Nbd2 d6 9. d5": "9. d5 - white has a spatial advantage with this move.  He also has a lead in development.  I try to catch up.",
        "9... Nd7 10. Rb1 Ne5 11. Nxe5 Bxe5": "11. ...... Bxe5 - the knight exchange does not bring much relief, in fact passivitis sets in like gangrene.",
        "12. c4 Bg7 13. Re1 Nf6": "13. ....... Nf6 - development.",
        "14. e5 dxe5 15. Rxe5": "15. Rxe5 - now Bob's rook dominates the e file and it will look as though I am about to lose a pawn.",
        "15... h6 16. Qe2 O-O": "16. ....... 0-0 - at last - but I think I may be about to lose a pawn, or am I?",
        "17. Bh4 Rfe8 18. Rxe7 Rxe7 19. Qxe7 Re8": "19......... Re8 - It does seem as though I will lose that pawn but the Wicked Witch of the West is trapped!  However, Bob gets enough material for her worse luck!",
        "20. Bxf6 Rxe7 21. Bxe7": "21. Bxe7 - an interesting material imbalance and I think that the scales are in white's favour.",
        "21... Bc8 22. b3 f5 23. Re1 Bc3 24. Re2 Bd7": "24. ....... Bd7 - I decide to block Bob's passer.",
        "25. Nf3 Bf6 26. h3 Bxe7 27. Rxe7": "27. Rxe7 - one pair of bishops is exchanged but Fou Leblanc is under castle fire.",
        "27... Qd6 28. Re1 Kg7 29. Ne5 Be8 30. Re3 b4 31. Bc2 a5": "31. ....... a5 - I try to consolidate my queenside.",
        "32. Nd3 Bf7 33. f4 h5": "33...... h5 - not much else to do.",
        "34. Rg3 Kh7 35. Ne5 Be8 36. Rg5 Kh6": "36. ....... Kh6 - making moves which I hope do not worsen my position.  Bob now opens me up.",
        "37. g4 hxg4 38. hxg4 fxg4 39. Rxg4 Kg7": "39. ...... Kg7 - sidesteps a possible rook check on h4 but the g pawn is lost and Henry now comes under a fearsome attack - right now I feel as though I am playing Freddy!",
        "40. Nxg6 Kf6": "40....... Kf6 - sidestepping a nasty discovery.",
        "41. Ne5 Ke7 42. Rg7+ Kf8": "42. ...... Kf8 - I feel as though I am stepping through a minefield.",
        "43. Ra7 Qh6 44. Ra8 Qh3": "44. ....... Qh3 - suddenly Bob finds himself a close encounter with Glenda!",
        "45. Bg6": "45. Bg6 - nasty attack on the pinned Fou Leblanc but not to worry, Glenda indirectly protects Fou Leblanc and Henry by keeping Bob's king in check!",
        "45... Qg3+ 46. Kh1 Qh3+": "46. ........Qh3+ - the white king is checked again.",
        "47. Kg1 Qg3+": "47. ....... Qg3+ and draw offer - I did not think that I had anything better than a perpetual here as Fou Leblanc is doubly attacked and only once defended by Henry.  I already have a 1 point material deficit.  Bob kindly accepts my offer.  GAME DRAWN."
    },
    "url": "https://gameknot.com/annotation.pl/a-close-shave?gm=22796",
    "gameName": "A Close Shave",
    "players": "rjacobs (1559) vs. jstevens1 (1771)",
    "opening": "Polish defence (A40)"
}