{
    "moves": {
        "1. e4": "Hi everyone!\n\nHere is the first of two endgames from a new sparring partner called Dan.  He is a Class C player but with his stats - he has only lost 3 games out of 6 against me - he can start looking up towards Class B status.  I will now show you a couple of games against him in Chicoboy's Club's Mini-Tournament.  My score against him was 1.5 - 0.5 in my favour.  This is the game in which I was to concede a Low Draw in a K & P ending.  So, how did this happen?  Well, I end up trying out the Philidor Defense against him.  Surprisingly when I have played it I have done pretty well with it and one of those victories was my first ever Class A victory when I had a Class C rating - so I thought I would try it.  Here is how it all panned out.  Dan opens with 1. e4.",
        "1... e5 2. Nf3 d6": "2. ..... d6 - this move is the Philidor Defense named after Andre Danican Philidor who first played this move in a serious tournament.  It's one drawback is that it shuts in Fou Lenoir.",
        "3. h3": "3. h3 - unusual but playable.",
        "3... Nf6 4. d3 Be7": "4. ...... Be7 - development.",
        "5. Nc3 O-O": "5. ...... 0-0 - Henry is tucked away on the kingside - now I need to sort out my queenside.",
        "6. Be2 c6 7. Nh2": "7. Nh2 - this curious move prepares Ng4.",
        "7... Qc7 8. Ng4 Nxg4 9. Bxg4 Bd7": "9. ...... Bd7 - I did not want the Wicked Witch of the West to bear down on Henry on g4 so I decided to let Dan initiate the next set of trades.",
        "10. Bxd7 Qxd7 11. Be3 Na6": "11. .... Na6 - gotta get my pieces out somehow!",
        "12. a3 Nc7 13. Qc1 b6 14. Bg5 Ne6": "14. ...... Ne6 - putting the question to Dan's dsb.",
        "15. Bxe7 Qxe7 16. Ne2 Rad8 17. O-O Qg5": "17. ..... Qg5?! - Gameknot Analysis seemed to indicate that this was the move that condemned me to that Low Draw.  I really can't seem to resist the habit to trade queens.  Over the past few years I have managed to trust in Glenda a bit more but sometimes I do tend to lapse into those bad habits of inappropriate exchanges and passivitis!",
        "18. Qxg5 Nxg5 19. f4 exf4 20. Nxf4 Ne6 21. Nxe6 fxe6 22. Rxf8+ Rxf8": "22. ..... Rxf8 - after this plethora of exchanges, Gameknot Analysis indicates the position as dead level.  Dan and I continue to trade.",
        "23. Rf1 Rxf1+ 24. Kxf1": "24. Kxf1 - and it brings King Dan one step closer to centralisation.  I must now follow suit with Henry.",
        "24... Kf7 25. Kf2 Kf6 26. Kf3 Ke5": "26. ..... Ke5 - Henry gets centralised first but a fat loada good it is gonna do - he will be driven off his perch as you will see.",
        "27. Ke3 c5 28. c3 g5": "28. ...... g5 - trying to keep King Dan out of f4 but Dan finds counterplay on the queenside.",
        "29. g4 d5 30. exd5 exd5 31. d4+ cxd4+ 32. cxd4+ Kd6": "32. ..... Kd6 - Henry must retreat.  He now tries to get at the queenside pawns but Dan finds a way of preventing this.",
        "33. b3 a5 34. a4 Kc6 35. Kd3 b5": "35. ..... b5 - I am the Desperate Dan here!  I am doing my best to break through but Dan finds the right move.",
        "36. Kc3 bxa4 37. bxa4 h6": "37. ..... h6 - the queenside is completely locked.  Can I try something on the kingside?  We shall see.",
        "38. Kd3 Kd6 39. Ke3 Ke6 40. Kf3 Kf6 41. Kg3 Kg6 42. Kf3 Kf6": "42. .... Kf6- I decided that there was no mileage out of h5 and the writing is now firmly on my Facebook Wall - LOW DRAW!  I take nothing away from Dan here, in the entire 43 moves played he made NO ERRORS whatsoever and I made one inaccuracy - so Dan's performance is epic, utterly epic, although I was certainly loathe to concede 9 rating points, Dan deserved every one of them.  So I ended up hitting the offer draw button and Dan accepted.  Thankfully in my return match things worked out much better for me, but not without a fight.  That game will be annotated sometime this week.  Until then, bye for now - Joanne",
        "43. Kg3 Kg6": ""
    },
    "url": "https://gameknot.com/annotation.pl/a-class-a-performance-dan?gm=54015",
    "gameName": "A Class A Performance, Dan!",
    "players": "pennsylvaniadan (1508) vs. jstevens1 (1832)",
    "opening": "Philidor's defence (C41)"
}