{
    "moves": {
        "1. d4 d5 2. Bf4 c6 3. c3 Qb6": "This op choosed for this attack. I normally answer with Qb3, but now I experimented a little, saccing a tempo and invitin him to take b2...",
        "4. Qc2 g6": "Black can't play Bf5 right now. QxB, Qxb2 (winning the Ra1 for the B) but Qc8#. So he supports Bf5. As predicted. But now...",
        "5. Be5": "I force him to make a decision. The right one was Nf6, followed by Nb8-d7. But...",
        "5... f6": "This makes me lose a tempo, and allows black to accomplish his \"plan\". ",
        "6. Bg3 Bf5 7. Qb3": "I am not forced to counter the B's action. True is that now black has e5, but his B is in the middle of the pawnstorm. ",
        "7... Qxb3 8. axb3 Nd7": "Right. Now, his R is dued to a7.",
        "9. Nd2 Bh6 10. Ngf3": "Not compromising myself. I'm planning to use the possible W's lsb position to trap it. ",
        "10... e6": "Perfect. For me. ",
        "11. Bd6": "This is a monster B, and black can only counter it with Bc8. ",
        "11... Bg7": "This, instead, but when will he play e5?",
        "12. h3": "He better do it quickly...",
        "12... g5 13. g4 Bg6 14. h4 gxh4 15. Nxh4": "B must retreat, due to Rh8, undefended.",
        "15... Bf7 16. e4": "B out of the way, I can finally play e4 myself. I'm not sure about f3 first, but slowness is punished too often.",
        "16... e5": "Finally! In a critic moment! Now, let's be sure to follow any line... in a blitz.",
        "17. Nf5": "This forces Bc8.",
        "17... Bf8": "If BxB, NxB+, and I can choose among NxB or Nxb7. I like it. No hurry to exchange my monster B. Let's take care of the center...",
        "18. Bg2": "And developing, by the way... My K belongs to e2 or d2, once the N has gone.",
        "18... dxe4 19. Bxe4": "I need my N to keep guard of b3.",
        "19... h6 20. Nf3": "I decided that I had to move something on the board, and what else? Nc4 was better, in view of Na5. I didn't see it. ",
        "20... Bxb3 21. dxe5 fxe5 22. Nxe5": "The threat is NxN, Be5, trapping the BR.",
        "22... Bxd6": "He prevents that.",
        "23. Nxd6+": "Now I realized how different would have it been if I had played c4 previously. I also missed Bg6+, but I'm not sure about it. This kind of tactic positions easily slip out of your hands.",
        "23... Ke7 24. Ng6+": "I decided to bet I could keep the N instead of running into a potentially dangerous counterplay on my exposed K. Will I succeed, my dear reader? :-)",
        "24... Kxd6 25. Nxh8 Ngf6": "NO! My B is also under attack! The tricker was tricked in return. No way out. That's blitz. ",
        "26. Rxh6": "Nice try, but useless.",
        "26... Rxh8 27. Rxh8 Nxe4 28. Rxa7": "Very strange unbalanced force set here!",
        "28... Kc7": "This is very easy to throw to the garbage for me overlooking a fork or something...",
        "29. Rh7 Nef6 30. Rg7 Kb8 31. Ra5": "The threat on the lsb is useless.",
        "31... Bd5": "\n",
        "32. f4": "Well, if he can't build a mate net, I'll go with pawns!",
        "32... Nb6 33. g5 Ne4 34. g6": "I was really worried about a possible trick, and maybe there was some, but black didn't find them. Nc4 would have been my choice as black. ",
        "34... Ng3": "I can't se black's plan here... Nf5, maybe?",
        "35. Rh7": "Pawn rolling, a black piece is gone.",
        "35... Nf5 36. g7 Nc4": "too late...",
        "37. Rh8+": "I like the B better... and I'm preparing a surprise...",
        "37... Kc7": "[%clk 0:01:21]\n",
        "38. Rxd5": "This was the intended surprise. Now, black can't take the R or I get to the queening rank. But I'll return him the same as before, but now it will work.  ",
        "38... Nxg7 39. Rd4": "Otherwise, he can move the other N out from his position...",
        "39... Nxb2": "A small price for a piece...",
        "40. Rh7 Kb6 41. Rxg7 c5": "Here a funny dance stars.",
        "42. Rg6+ Kb5 43. Rg5 b6": "...and here I missed the simple, nice and elegant Rb4+, winning the N. SIGH!!! :-(((",
        "44. Kd2 Nc4+ 45. Kc2 Ne3+ 46. Kd3": "The N has no check and no good place to go to.",
        "46... Ng2 47. Rb4+ Kc6 48. Rg6+": "Dangerous, yes, but I can always give another check. And if my opp. is careless...",
        "48... Kd5": "like this, ",
        "49. c4#": "This is his fate. Nice problem-like position, isn't it? :-)"
    },
    "url": "https://gameknot.com/annotation.pl/a-couple-of-points?gm=62791",
    "gameName": "A couple of points",
    "players": "damafi (1474) vs. BARRIE8 (1490)",
    "opening": "Queen's pawn, Mason variation (D00)"
}