{
    "moves": {
        "1. d4": "I only play d4 in 'real time' or blitz chess. I really should start playing it in longer games too, but e4 has served me well so far and if it ain't broke...!",
        "1... Nf6 2. Nf3": "c4 or even Bg5 are possible lines",
        "2... e6": "Other main lines include d5 and g6, whereas b6, d6 and c5 are also playable",
        "3. c4 c5": "d5, b6 and Bb4  are more common",
        "4. d5": "g3, e3 and Nc3 are the other options",
        "4... exd5": "d6 is playable",
        "5. cxd5 d6 6. e4": "6.e4 is a favourite move of Alexander Khalifman and Zsuzsanna (Susan) Polgar, Judith's big sister. Nc3 is the more common continuation, but I like to try rare lines in 'real time' chess.",
        "6... g6": "a6 is the other possibility",
        "7. Nc3 Bg7 8. Be2": "h3 is playable",
        "8... O-O 9. O-O a6": "Re8 is another good continuation",
        "10. a4 Re8": "Bg4 is usually played here",
        "11. Qc2": "Also playable is Nd2, covering the e4 pawn. Black wants to push his queen-side pawns, which is why white played a4 and why Nd2 is a good move here preventing a future c4 pawn push by black.",
        "11... Bg4": "Nbd7 is another option",
        "12. h3 Bxf3 13. Bxf3 Nbd7 14. Bf4 Ne5": "Qc7 or Qe7 are the last 2 database moves, but there's much to be said for Ne5.",
        "15. Be2": "Protects the pawn structure in front of the king and gives the bishop range on both flanks.",
        "15... h6": "To what end? ... we'll soon find out. Rc8 or c4 and a queen-side initiative both look better here.",
        "16. a5": "Making b5 less attractive an option for black as the exchange would now take place on b6, leaving him with an isolani on the a-file. ",
        "16... g5": "A king-side pawn push is common in the King's Indian Defence, but usually initiated by f5. This effort looks to be going nowhere. Qe7 or Rc8 look better here.",
        "17. Bh2": "The best option. Bg3 merely invites black's pawns to continue their advance. Be3 is possible, giving a second bishop scope on both flanks. However, I wanted to keep my bishop focused on black's weak backward pawn on d6. ",
        "17... g4": "Seems to have over-extended in his desire to open lines to the king. Ng6, aiming for Nf4 is more patient and better. You should get your pieces into position first, then attack. ",
        "18. hxg4": "Probably not the best response: Bxe5 looks better.",
        "18... Nfxg4": "Better than dislodging the advanced knight on e5.",
        "19. Bg3": "Better than Bxg4.",
        "19... h5 20. Qb3": "Looking to counter on the queen side. Is the b7 pawn poisoned? Can black ignore this? All things being equal, Qd1 looks better here. Even Ra3 is a possibility. ",
        "20... h4 21. Bf4": "Trying to hang on to the bishop as long as possible. Hard to tell if Bxe5 is better here.",
        "21... Qf6": "Black's pieces are now well co-ordinated....mine less so.",
        "22. Bc1": "I am now on the back foot and looking for my opponent to give me a chance to get back in the game.",
        "22... Qg6": "Is h3!? better?",
        "23. f3": "A poor move, creating a hole on g3, which black could occupy via Nf6-h5-g3. Kh1 was the proper move to make. ",
        "23... Nh6": "Thank God my opponent couldn't read my last comment! Nh6 makes no sense at all, except to give me the chance to get back in the game.",
        "24. Bf4": "Offers extra protection to cover the holes on g3 and h2. A mistake would be 24.Qxb7? Qg3 25. be3 h3 and advantage to black.",
        "24... h3": "f5 is needed here to break white's nice pawn line g2-d5. ",
        "25. g3": "A simple but effective move. Black's h-pawn has advanced too far and is temporarily cut off. ",
        "25... f5 26. Rae1 Qh5": "A useless move, as pushing the pawn to h2 is no longer an option. 26. ... fxe4 27.Nxe4 Nf5 and black still has attacking possibilities. Even better is Rf8 with a strong initiative!",
        "27. Qxb7": "Now, however, the tide has turned and it's time for white to counter and invade. ",
        "27... Rab8": "As I've said before, bad moves come in pairs. This move, looking to bring the rook into the action via Rxb2 looks attractive, but the rook has nowhere to go after b2, apart from c2, and white's queen is about to wreck havoc. What are the options here? Qg6 doesn't work as 28.Bxa6 fxe4 29.Nxe4 is strong for white. However white could slip up here and play 29.Rxe4? Reb8 30.Qc7 Rf8 and black is back in charge. Another slip up would be 29.fxe4 Reb8 30.Qc7 Rxb2, throwing away the initiative. 27. ... fxe4 looks the only option here for black.",
        "28. Qxa6 Rxb2": "Oops.... underestimates the power of white's pieces. The queen is about to lead them into a swift and brutal counter.",
        "29. Qxd6 Rxe2": "Desperation. As I said earlier, c2 looks the only possible square for the rook. 29. ... fxe4 gives white the chance to throw it away: 30.fxe4 Nhg4 31.Qxc5? (Qa6 is the correct move) Nd3 32.Bxd3 Rg2  33.Kh1 Rh2  34.Kg1 Rg2  and a draw by repetition.",
        "30. Rxe2 Nxf3+ 31. Kh1": "As simple as that really. Black has nothing left to offer. White can exchange pieces and win with ease.",
        "31... fxe4": "The only other option was 31. ... Bxc3 but this loses anyway to 32.Bxh6",
        "32. Rxe4 Rf8": "32. ... Ng4 33.Rxf3 doesn't improve matters.",
        "33. Qe6+": "33.Bxh6 Qxh6 34.Qxh6 Bxh6 seems even quicker.",
        "33... Kh8 34. g4": "An attractive move which forces the decision. ",
        "34... Nxg4": "Qxg4 is again answered by Bxh6",
        "35. Rxf3 Bxc3": "Kh7 was the only way of prolonging the agony. ",
        "36. Be5+": "Checkmate imminent.",
        "36... Nf6 37. Rxf6 Rxf6 38. Qxf6+": "Even here there was still a chance for black to win! If 38.Bxc3?? Qf3  39.Kh2 Qg2 checkmate! Ouch....",
        "38... Kg8 39. Qg7#": "I hope you enjoyed the game and/or found the analysis informative. Comments are most welcome."
    },
    "url": "https://gameknot.com/annotation.pl/a-complete-game-of-attacking-chess?gm=11645",
    "gameName": "A complete game of attacking chess",
    "players": "LecceWulf (2250) vs. Complete (2250)",
    "opening": "Queen's pawn (A46), Torre attack"
}