{
    "moves": {
        "1. e4": "Hi everyone!\r\n\r\nAfter I waved the white flag on my buddy Steve I found myself entering some conditional moves after finding myself in a K & P ending against a bare king.  Luckily it was Hilary who found himself with the bare king - as he beat me in our first match - I was playing white in that game I was sure chuffed to get my revenge on him!  This, I am sure, will be of some benefit to members of the Coaching Club who may well encounter this type of ending, so maybe some useful guidelines here.  Anyhow, in the early stages of it I found myself on the black side of a Ruy Lopez.",
        "1... e5 2. Nf3 Nc6 3. Bb5 a6 4. Bxc6": "4. Bxc6 - of which he gave me the Exchange Variation.",
        "4... dxc6 5. h3 Qd6": "5. ..... Qd6 - Glenda makes tentative steps into the outside world.",
        "6. O-O Be6 7. b3 f6 8. Ba3 c5": "8. ...... c5 - I decided to screen out that dsb's attack on Glenda.",
        "9. c3 Qd7 10. Nxe5": "10. Nxe5?! - Hilary surprises me with a speculative sac.  Subsequent play, however, proves this to be unsound.  At the time he did get two pawns for his piece though.",
        "10... fxe5 11. Qh5+": "11. Qh5+ - aha, here comes the Wicked Witch of the West on her broomstick and she immediately fixes her glare onto Henry.  Glenda bravely steps out in front of her other half, aaah!",
        "11... Qf7 12. Qxe5 Bd6": "12. ....... Bd6 - Fou Lenoir develops with a threat - he tries to eject the Witch out of my position but that white besom does not go far!",
        "13. Qg5 b6": "13. ....... b6 - I now back up my advanced c pawn.",
        "14. d4 cxd4 15. Bxd6 cxd6 16. cxd4": "16. cxd4 - so, after one pawn trade and the disappearance of the two dsb's I am still a piece for two pawns up, but that wretched Witch is still in my face.  I still wish to castle kingside so I decided to move my queen rook to the d column and back up my isolani on d6.",
        "16... Rd8 17. d5 Bc8": "17. ..... Bc8 - forced to retreat Fou Leblanc I still have no time to develop my king knight and get castled.",
        "18. Nc3 Nf6 19. e5 dxe5 20. Qxe5+ Qe7 21. Qd4": "21. Qd4 - avoiding another invitation to trade queens.  I am still a piece for two pawns up and I have my eye on that dangerous looking white passer on the d column.  My next plan is to round it up.",
        "21... Qd6 22. Rfe1+ Kf7": "22. ...... Kf7 - oooh, I forgot to mention in my last note, I finally developed that horsie to f6 on move 18 to pave the way for castling.  However, white had other ideas with his last move - still, with the absence of white's lsb I can start a castling by hand manoeuvre by putting Henry on f7.",
        "23. Rad1 Rhe8": "23. ..... Rhe8 - mission accomplished - although Henry is not on g8 I have been able to get my king rook on e8 so I am as good as castled by hand.  That king rook now challenges white's king rook on the e column.",
        "24. Re3 Bb7": "24. ...... Bb7 - Fou Leblanc redeploys himself on the a8-h1 diagonal.  Let the round up begin!",
        "25. Red3 Re7 26. Na4 b5": "26. ..... b5 - I must take a little evasive action first though!",
        "27. Nc5 Bxd5 28. Qb4": "28. Qb4 - Fou Leblanc is now dangerously pinned - so how does Houdini Jo get out of that one?",
        "28... Qc6": "28. ..... Qc6 - answer ..... move Glenda to c6, out of the pin and still defending (story of her life!) Fou Leblanc.  Mind you, white's g2 pawn now comes under fire.",
        "29. Qa3 Ra8": "29. ...... Ra8  - to defend my a6 pawn.",
        "30. f3 Rc7": "30. ..... Rc7 - suddenly the white horsie finds himself under fire from my heavies on the c column.",
        "31. Ne4 Bxe4 32. fxe4": "32. fxe4 - I manage to trade under fire Fou Leblanc for white's knight.  I now isolate white's f pawn once it moves onto the e column.  First, now that I am a piece for a pawn up I decided to force a trade of queens thanks to the open a7-g1 diagonal.",
        "32... Qc5+ 33. Qxc5 Rxc5 34. Rd3d4": "34. Rd4 - defending his isolani, but I will not take no for an answer here!",
        "34... Re5 35. a4 bxa4 36. Rxa4": "36. Rxa4 - a pawn trade.",
        "36... Rxe4": "36. ...... Rxe4 - However, I am now in a position to nab the pawn on e5 making me a clear piece up.",
        "37. b4 Re5 38. Rd6 Re6 39. Rd4": "39. Rd4 - Hilary now makes pretty sure though that I have to work bally hard to earn those 9 rating points.",
        "39... Rb8 40. Kf2 Rb5 41. g4 Rbe5": "41. ..... Rbe5 - trying to attack down the e column but it does not come off.",
        "42. Rf4 Ke7": "42. .... Ke7 - Henry sidestepps a pin.",
        "43. Rc4 Ne4+ 44. Kg2": "44. Kg2 - pity - wouldn't it be nice (for me anyway) if white had played Nf3?  Can you the jury see why?",
        "44... Rb5 45. h4 h6": "45. ..... h6 - this move is played to create a bolt hole for Henry while the two rooks are on the board - it would help greatly if Henry was not subjected to annoying tempo-stealing checks from the enemy rooks.",
        "46. Rc7+ Kf8 47. Ra7 Nf6": "47. ..... Nf6 - this knight move triggers off some action on the queenside.......",
        "48. Kf3 Reb6 49. Ra4xa6 Rxa6 50. Rxa6 Rxb4": "50. ...... Rxb4 - namely one pair of rooks and the two queenside pawns have disappeared from the board.  Now the action is focussed solely on the kingside.  How on earth can I force a win from here though?",
        "51. g5 hxg5 52. hxg5": "52. hxg5 - hmm, running out of pawns here, only one pawn left.  Can I ensure this precious footman stays on the board?  I just hope I will not have to play out the 50 move rule with K + R + N v K + R.  We shall see.  I decided the safest course of action was to place my attacked horsie on e8.",
        "52... Ne8 53. g6 Rd4": "53. .... Rd4 - heading for d6.",
        "54. Ra7 Rd6 55. Rf7+": "55. Rf7+ - fortunately this check turns out to be little more than a spite check.  The pawn on g6 is doomed.",
        "55... Kg8 56. Re7 Rf6+": "56. ... Rf6+ - this rook move provides a space clearance for my knight to take his place on d6........",
        "57. Ke4 Nd6+": "57. ..... Nd6+ - ....... with check.",
        "58. Ke5 Rxg6": "58. ..... Rxg6 - pawn on g6 duly drops, eureka!  Now can I get my one and only precious pawn to the place of Glendadom!?",
        "59. Rd7 Kh7": "59. ...... Kh7 - hmm, so he is after my knight is he, well he is welcome to it because with my rook and knight dropping off in exchange for his rook I am left with K & P v bare king.  At least I know I cannot lose the game, but can I win it?",
        "60. Rxd6 Rxd6 61. Kxd6 g5": "61. ..... g5 - quick - march!",
        "62. Ke5 Kh6 63. Ke4 Kh5": "63. ..... Kh5 - Henry must support the g5 pawn onwards and upwards.",
        "64. Kf3 Kh4 65. Kg2 Kg4": "65. ..... Kg4 - Henry stays in front of my passer, now the white king cannot go forwards, only sideways and backwards.",
        "66. Kh2 Kf3": "66. ..... Kf3 - ooops - I have just realised, Henry is the wrong side of my passer.  If I try and walk my pawn up to Glendadom I risk stalemating the WK when my pawn reaches g3.  I must therefore get Henry back onto the h file and try and get the WK off it.  Luckily my opponent is very obliging here!",
        "67. Kg1 Kg3": "67. ...... Kg3 - I think this move is the clincher here!",
        "68. Kh1 Kh3": "68. ..... Kh3 - after going over the analysis board at least two or three times I now set up some conditional moves.",
        "69. Kg1 g4 70. Kh1 g3 71. Kg1 g2": "71. ..... g2 - and Hilary waves the white flag.  He is in Zugzwang.  Can you the jury see how?  Anyhow, hope you have had a good read - bye for now - Joanne"
    },
    "url": "https://gameknot.com/annotation.pl/a-day-of-ups-and-downs-part-2?gm=29417",
    "gameName": "A Day of Ups and Downs - Part 2",
    "players": "cornishman (1757) vs. jstevens1 (1772)",
    "opening": "Ruy Lopez (C68), exchange, Alekhine variation"
}