{
    "moves": {
        "1. e4 c5 2. Nf3 d6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 g6": "Sicilian Dragon, one of my favorite openings (for those of you doing research on my play style).  :)\n\nThe name comes from the similarity of black's kingside pawn structure to the constellation Draco.  The fianchettoed bishop is sometimes called the \"dragon's flame\" because of the threat down the long diagonal.",
        "6. Be3 Bg7 7. Bc4": "7. f3 is the usual move, preventing Ng4.  It's often followed by 8. Qd2 and 9. Bc4.\n\nI don't always follow the \"correct\" order when playing an opening, but sometimes that order exists to avoid traps.  Neglecting f3 allows 7...Ng4, threatening to exchange for the bishop.  On the other hand, I've fallen into a counter-trap with 7. Bc4 Ng4 8. Bb5  Bd7 9. Qxg4, so it pays to be careful from both sides.",
        "7... O-O 8. Qd2 Ng4": "I wanted to castle before starting an attack.  I didn't really know what to expect here and was a little leery about throwing my knight out to be harassed by a possible pawn storm.",
        "9. Bg5 Nc6": "More development instead of retreating.  Double threat on white's d4 knight.",
        "10. f3": "White elects to trade knights, though the reasoning behind it may have been to continue building towards the pawn structure seen in the Yugoslav attack.",
        "10... Nxd4": "I accept the trade, which wins a pawn.  It does open half-open the f-file, which can be dangerous when directed toward a castled position, but there are always tradeoffs and I think it's manageable, especially since my bishop will complicate castling for white.  The exchange also helps continue development, which never hurts.",
        "11. fxg4 Bxg4 12. h3": "White wants to keep her castling options open.  :)",
        "12... Be6": "Contesting the a2-g8 diagonal, since I hate to have my f-pawn pinned.",
        "13. Bxe6 Nxe6 14. Bh6": "White also wants to trade off my strong bishop.  This is a common exchange since it removes black's control of the a1-h8 diagonal.",
        "14... Rc8": "\"Rooks belong on open files.\"",
        "15. Bxg7": "I refuse to exchange, forcing white to do so.  Having my king on the 7th rank may save a move as we near the endgame and I wish to move him to the center.\n\nOdd that I mention the endgame when we've barely left the opening.  I don't think there's any clear demarcation between phases, but as pieces are traded off, threats against the king are reduced and play begins to revolve around pawn promotions instead of direct mates.  In this case, white is out of threats against black and black's king can start eyeing the path to the center of the board.",
        "15... Kxg7 16. O-O-O": "I try to follow the general rule that the first 10 moves should see all minor pieces developed, one or both center pawns occupying the center, and the king castled (to either side).  This castle is well outside that, but since I've had no attacks on the king, it hasn't hurt anything.",
        "16... Qa5 17. Kb1 Rc5": "?! - Questionable Move.\n\nI don't remember the specifics of this decision, but Rc6 would have served much better.  This is the first move I've \"rated\", since all other moves are completely reasonable depending on the ideas behind them.  This one may also have a solid reason, but it escapes me at the moment.  :)",
        "18. a3 Rfc8": "? - Poor move.\n\nOverlooking the obvious.",
        "19. b4 Qxa3": "I believe I originally intended Qb6, pinning the b-pawn, but overlooked 20. Na4.",
        "20. bxc5 Rxc5 21. Qc1": "! - Good move.\n\nWhite can't hold onto the knight safely and this prevent any mate threats I might have entertained.",
        "21... Qxc3 22. Qb2 Qe5 23. Qxe5+": "With an exposed king, trading queens is a good move for white.",
        "23... Rxe5": "I forced the queen exchange here to set up an attack on white's e-pawn.",
        "24. Rhe1 Nc5 25. Rd5": "Rd4 can't hold the pawn after 25...f5 and the pin would create other problems.  This way, white forces a rook exchange, which further benefits her.\n\n\"If you have a pair of Rooks and your opponent only has one, it is usually correct to trade Rooks.\"",
        "25... Rxe4 26. Rxe4 Nxe4 27. Kb2": "It's hard to classify the next few moves.  \n\nWhite can't win any pawns at the moment, since Ra5 is met with a6 and Rb5 is met with Nc5.  I plan on playing Nc5 at some point, because it also blockades white's c-pawn, but want to wait for her to force me to do so, hopefully winning a tempo.  My plan is to escort my kingside to queen while freezing play on the queenside.",
        "27... f5": "At this point, black has a solid advantage.  With careful play, black should have no problem pushing one of the pawns to queen.\n\nThis isn't because of any mistakes on white's part, but instead due to piece placement and pawn structure during the course of the game.  I've tried to comment on a few specifics, but it's hard to quantify what good or bad placement is without knowing why the move is made.",
        "28. Kb3 Kf6 29. Kb4 g5 30. Rd1 h5 31. Ka5 g4 32. hxg4 hxg4 33. Rb1 Nc5": "My plan seems to be proceeding well.",
        "34. Kb5 f4 35. Rh1 Kg5 36. Rh7 f3 37. gxf3 gxf3": "I've finally obtained a passed pawn, which I imagine will be traded for white's rook.  That should give me a winning advantage, though the game is far from over.\n\nIn retrospect, I should have moved my e-pawn, but during the game, I felt it was a useful sacrifice to keep white's rook occupied for a move or two while I advanced the f-pawn. ",
        "38. Rg7+ Kf4 39. Rxe7 Kg3 40. Rg7+ Kf2 41. Kc4 Ke3": "I finally spotted a flaw in my plan.  White can keep my king pinned behind my pawn, preventing it from queening.  Time to bring in my knight!",
        "42. Re7+ Ne4": "?? - Blunder\n\nThis wasn't the best way to do that.",
        "43. Kd5": "! - Good move.\n\nI don't know what I imagined, but this wasn't it!  White makes excellent use of the momentary pin to destroy any chance of an easy black win.",
        "43... f2": "I push the pawn to force an exchange before I lose due to underestimating white's rook again.",
        "44. Rxe4+ Kf3 45. Re7 f1=Q 46. Rf7+ Ke2 47. Rxf1 Kxf1 48. Kxd6 Ke2": "White can't capture my pawns, since moving to the 7th rank would allow my a-pawn to queen.",
        "49. c4": "I would have played Kc5, using the c-pawn to prevent black from playing Kd3, but I don't know if it really makes a difference.  \n\nAt some point, I needed to push my a-pawn to exchange for white's c-pawn.  If white managed to advance it and exchange with my b-pawn while keeping her king in front of my a-pawn, it's a definite draw.",
        "49... Kd3 50. Kc5 a5 51. Kb5 a4 52. Kxa4 Kxc4": "Black has opposition.\n\nThe opposition battle really starts here.  We could have tried to analyze it earlier and played slightly differently to change placement after capture, but this is what I want and now I just need to maintain pressure to keep white away from b1.\n\nThe \"rule\" to remember is that opposition changes anytime another piece is moved or one king moves diagonally and the other orthogonally.  Once one side has opposition, they should be able to maintain it with careful play.",
        "53. Ka3 b5 54. Kb2 Kb4": "Black has opposition.",
        "55. Ka2 Kc3 56. Ka3 b4+ 57. Ka2 b3+": "?? - Blunder.\n\nI believe I had this setup in a conditional sequence, having calculated thing incorrectly.\n\nHere's an example of correct play.  Black maintains opposition and controls white's moves to ensure control of b1 and a successful queening:\n\n57.\tKa2\tKc2\n58.\tKa1\tKb3\n59.\tKb1\tKa3\n60.\tKa1\tb3\n61.\tKb1\tb2\n62.\tKc2\tKa2",
        "58. Kb1 Kb4": "?? - Blunder.\n\njohnforteen6 pointed out that I should have played 58...b2, forcing white to a2.  I don't have any excuse for missing this.  It was part of a conditional sequence I'd setup the night before and I assume that I overlooked it during analysis by skipping the sequence.",
        "59. Kb2 Ka4 60. Kb1": "It's possible, with careful play, for white to obtain opposition and draw on a central file.  In this game, black maintains opposition, but fails to control the critical squares (due to calculation errors).",
        "60... Kb5": "1/2 - 1/2\n\nAfter recalculating and planning to change opposition, I realized I couldn't force my king to a3 and offered a draw.\n\nWhen reviewing, I was struck by the fact that white never made any serious mistakes.  There are a few places I would have played differently to obtain a different position after an exchange, but other than the lost pawn at the beginning, the game result was decided on positional play and my blunders.  The best advice I can offer is to centralize pieces when possible and double check any moves before submitting them.  :)\n\nQuestions and comments appreciated, especially if you find mistakes.  :)"
    },
    "url": "https://gameknot.com/annotation.pl/a-draw-worth-noting?gm=16234",
    "gameName": "A draw worth noting.",
    "players": "lyshatin (1625) vs. anotherminorpawn (1731)",
    "opening": "Sicilian (B72), dragon, classical attack"
}