{
    "moves": {
        "1. e4": "The first game on GameKnot. I joined a game with kammersl. The opening I chose was C41 (Philidor Defense).",
        "1... e5 2. Nf3 Nc6 3. Bc4 d6 4. h3": "White loses a tempo. O-O is the standard line.",
        "4... Be7": "Black can't attack Nf3, so developing for O-O is better.",
        "5. d3": "A weak move. The light bishop is locked!",
        "5... Nf6": "Preparing O-O",
        "6. Bg5 O-O 7. Nc3": "The Knight looks to move to d5. But Nf6 still covers d5, so black can counter.",
        "7... Be6 8. Bxe6 fxe6 9. d4": "White seems to give up d5 and changes to e5.",
        "9... d5": "! ",
        "10. dxe5 Nxe4": "! Bg5 is threatened and Black wants to trade Knights.",
        "11. Bxe7 Qxe7 12. O-O Nxc3 13. bxc3": "The result is a lone pawn e5. White has lost the center and also got a double pawn at file c.",
        "13... Na5 14. Re1 Rf4": "! White must now defend Black's Rook attack on the f file very precisely.",
        "15. Qd2": "?",
        "15... Raf8 16. c4": "??",
        "16... Nxc4 17. Qc3 b5 18. Rab1 c6 19. Rb4": "?? This move loses.",
        "19... Rf4xf3": "!",
        "20. gxf3 d4": "! 21. Qxd4 Qxb4",
        "21. Qb3 Nd2 22. Qb2 Qg5+ 23. Kh1 Qh4": "! White can not hold the King side pawns any more. But Black is not strong enough to checkmate the King. Now, the King had to run across the board, into the arms of his Queen.",
        "24. Kg2 Qg5+ 25. Kh1 Qh4 26. Kg2 Nxf3 27. Kf1 Nh2+": "! 28. Kg1 Qxf2 29. Kh1 Nf3 30. c3 Qxe1  31. Kg2 Qg1#",
        "28. Ke2 Qxf2+ 29. Kd1": "29. Kd3?? Rf3 30. Ke4 Qh4#",
        "29... Nf3 30. c4 Qxe1+ 31. Kc2 Qe2+ 32. Kb3 Nd2+ 33. Ka3": "The King in the arms of his Queen. There, he will die...",
        "33... Rf3+ 34. Rb3": "The only move without immediately losing the Queen. The Knight will fork now King and Queen. White is bound to die.",
        "34... Nxc4+": "White resigns, believing Black will take the Queen. But White is mate:  35. Kb4 a5  36. Kc5 Qxe5 37. Kxc6 Rf7 38. Rxb5 Rc7# It is up to the romantic reader to decide whether it is more beautiful  to let the King die side by side with his Queen or seeing him fall surrounded by enemies..."
    },
    "url": "https://gameknot.com/annotation.pl/a-fatigue-king-dying-in-the-arms-of-the-queen?gm=7723",
    "gameName": "A fatigue King dying in the arms of the Queen",
    "players": "kammersl (1370) vs. jprante (1200)",
    "opening": "King's pawn game (C50)"
}