{
    "moves": {
        "1. d4": "This was a fascinating game. After a complex middle game - which the post-match computer analysis (pmca) says Black makes a couple of mistake. It comes down to a queen v 2 rooks ending. The computer thinks I made a mistake, but my opponent says it was drawn anyway. Is he right? And if he is right, were his two \"mistakes\" really mistakes, if he was holding the position anyway. Is the pmca right, or is my opponent right? Please study and tell me your views, dear reader.",
        "1... Nf6": "So it starts conventionally enough",
        "2. c4": "I continue with my usual",
        "2... g6": "Black prepares to develop his Bf8 to g7",
        "3. Nc3": "So I continue, and threaten e2-e4",
        "3... d5": "He opts for the Grünfeld Defence, (http://en.wikipedia.org/wiki/Gr%C3%BCnfeld_Defence) rather than the King's Indian Defence with Bg7 instead of d7-d5",
        "4. cxd5": "I continue with the exchange variation, the most popular reply. http://en.wikipedia.org/wiki/Gr%C3%BCnfeld_Defence#Exchange_Variation:_4.cxd5_Nxd5_5.e4",
        "4... Nxd5": "So he takes back",
        "5. e4": "I seize the centre, or center, as my American friends would say",
        "5... Nxc3": "He takes - the usual continuation",
        "6. bxc3": "I take back",
        "6... Bg7": "He continues with development. White can develop his pieces in a number of ways in the Exchange Variation. For decades, theory held that the correct method of development was with Bc4 and Ne2, often followed by 0-0 and f4–f5, playing for a central breakthrough or kingside attack. It was generally thought that an early Nf3 was weak in the Exchange Variation because it allowed Black too much pressure on the centre with ...Bg4. In the late 1970s, however, Karpov, Kasparov and others found different methods to play the Exchange Variation with White, often involving an early Rb1 to remove the rook from the sensitive a1–h8 diagonal, as well as attempting to hinder the development of Black's queenside.",
        "7. Nf3": "With this move, I am planning on playing Rb1 next move.",
        "7... c5": "He hits at my centre",
        "8. Rb1": "So I do my rook move.",
        "8... O-O": "He castles",
        "9. Be2": "This is the usual square for the bishop in this variation",
        "9... Nc6": "So he develops.",
        "10. d5": "And I hit the knight, going into very complicated variations! Black can take the pawn on c3 with his Bishop with check, but after Bc1-d2 Black has to part with his powerful black squared bishop, as his knight on c6 is hanging. After Bxc3+ 11. Bd2 Bxd2+ 12. Qxd2 white has full compensation for the sacrifices pawn, so black doesn't normally accept the offered pawn.",
        "10... Ne5": "This is the usual move",
        "11. Nxe5": "So I take",
        "11... Bxe5": "He takes back",
        "12. Rb3": "I protect my c3 pawn",
        "12... Qc7": "Now I can't play 0-0 as he can meet that with Bxh2 check",
        "13. c4": "So I consolidate my centre and make it possible for my rook to swing across the third rank.",
        "13... e6": "and he hits at my centre. I was hoping to follow Kakageldyev, Amanmurad (2365) vs. Mikhalchishin, Adrian (2530), which white won, but black played f7-f5 in that game. I'm thinking for myself now!",
        "14. h3": "So I prepare to castle",
        "14... Bd7": "He continues to develop",
        "15. Qd2": "I move my queen to a better square, perhaps with Bc1-b2 and if he exchanges, retake with my queen, doubling up on b7",
        "15... exd5": "He opens up, the e file, a great idea with my king still on e1",
        "16. exd5": "so I take back",
        "16... Rfe8": "He moves the rook onto the open e file",
        "17. O-O": "So I get my king out of the line of fire",
        "17... b5": "My opponent now comes with this fine pawn sac",
        "18. cxb5": "so I take",
        "18... c4": "He advances",
        "19. Rb4": "I attack the pawn",
        "19... c3": "He advances again, attacking my queen",
        "20. Qd3": "So I move my queen",
        "20... Bf5": "He attacks it again",
        "21. Qf3": "So my queen is forced to move.",
        "21... Qa5": "He hits my rook",
        "22. a3": "I defend my rook",
        "22... Bd6": "He hits it again",
        "23. Rd4": "I move it again",
        "23... Bc5": "The pmca says this is a mistake, and prefers  Rac8 24. Bd3 Bd7 25. a4 c2 26. Rh4 f5 27. g3 Re1 28. Kg2 Re7 29. Rg1 Kh8 30. Kh1, which it says is only plus 0.25 to white, as opposed to the game continuation, which is ranks as plus 0.89 for white. Is this really true? Your views - and/or how your computer assesses this position would be most welcome! Certainly at the time, I didn't think this was a mistake.",
        "24. Rf4": "Now white has some concrete threats on the king side",
        "24... Bxa3": "So he takes the pawn",
        "25. Rxf5": "I sacrifice the exchange to open up his kingside",
        "25... gxf5": "He takes back",
        "26. Qxf5": "I take his pawn. Notice he can't take my Be2 because of Qg4 check, also attacking his Re2",
        "26... Bxc1": "So he takes my bishop on c1 instead",
        "27. Rxc1": "I take back with the rook. I have some nasty threats involving Bd3 followed by queen checks in h7 followed by h8, driving his king out into the open",
        "27... Qb6": "So the queen has to hurry back",
        "28. Rxc3": "I take the pawn, threatening join in the attack with Rg3 check",
        "28... Qg6": "Already black is looking at the queen vs 2 rooks ending - and so was I. I thought I may be able to win, it, my opponent thought he could draw. At the time I thought Qg6 was a mistake, and pmca thinks so too, and gives Qh6 29. Bh5 Re1+ 30. Kh2 f6 31. Rc7 Kh8 32. Rc8+ Rxc8 33. Qxc8+ Kg7 34. Qc7+ Kg8 35. Bf7+ Kg7 36. Qxa7 Qf4+ 37. g3 Qd6 38. Be6+ Kh6as a playable line for black, with an assessment that this is \"only\" 2.38 in white's favour, as opposed to the game continuation which it gives as 3.55 in white's favour. But is the computer right? Your views would be most welcome!",
        "29. Rg3": "So I pin the queen",
        "29... Rxe2": "He takes my bishop",
        "30. Rxg6+": "I take the queen",
        "30... hxg6": "He takes back this way, to give his king more shelter",
        "31. Qd7": "I move my queen up",
        "31... Re1+": "He throws in a check",
        "32. Kh2": "This is forced",
        "32... Rb8": "He offers to exchange pawns",
        "33. d6": "But now he hasn't time to take",
        "33... Rd1": "He has to watch this pawn",
        "34. Qc6": "So I make way for the advancing pawn",
        "34... Rd8": "He doubles up on the d pawn",
        "35. Qc7": "So I go after the a pawn",
        "35... Rd8xd6": "He takes",
        "36. Qxa7": "I take",
        "36... Rd6d3": "He prepares to double again the b pawn",
        "37. Qb8+": "I throw in a check",
        "37... Kg7": "King moves",
        "38. Qe5+": "Another check",
        "38... Kg8": "King back",
        "39. Qe2": "This is to prevent either rook leaving the d file",
        "39... Rd3d2": "So he hits the queen",
        "40. Qe8+": "I throw in a check",
        "40... Kg7": "King moves. Now this is where the pmca thinks I made a mistake. It things I should continue with 41. Qe4 Rd4 42. Qc2 R1d2 43. Qc3 R2d3 44. Qa5 Rd7 45. b6 f6 46. Qb5 R3d5 47. Qa6 R5d6 48. Kg3 Rd2 and claims that this is plus 2.9 for white. But my opponent thinks this line is still drawn. Who is right?",
        "41. b6": "This is one last hope for a mistake from black. I was hoping for Rb2?? allowing Qe5 check",
        "41... Rb1": "But he doesn't fall for those. Thought the b pawn is going, and then is it clearly drawn. May as well accept.",
        "42. Qe5+": "check again",
        "42... Kg8": "King goes back",
        "43. Qe8+": "and draw agreed, on my proposal. Many thanks for reading this, and I look forward to reading your comments! Please rate the annotation on the star scheme of rating, so I get an idea how I am doing."
    },
    "url": "https://gameknot.com/annotation.pl/a-fascinating-draw-but-did-i-miss-a-win?gm=53317",
    "gameName": "A fascinating draw-but did I miss a win?",
    "players": "charleshiggie (2031) vs. rmannstaedt (1791)",
    "opening": "Gruenfeld (D85), modern exchange variation"
}