{
    "moves": {
        "1. e4": "Team Match, I play white and, as (almost) always, I play for the Open game.",
        "1... c5 2. Nf3": "The Sicilian. I hate when black does that...",
        "2... d6 3. d4 cxd4 4. Nxd4": "Main Line.",
        "4... Nf6 5. Nc3": "Orthodox/Four Knights Variation.",
        "5... g6 6. Be3": "Black seems to be playing toward the Dragon, but 5. ... g6 may be a bit early. My opening library recommends 5. ... d6, 5. ... e6, or 5. ... e5 at this juncture. However, I don't really see anything wrong with 5. ... g6 so I continue with development, reinforcing my knight on d4 against the inevitable pressure from black's fianchetto on g7.",
        "6... Bg7 7. f3": "Shoring up the center.",
        "7... O-O 8. Qd2": "Kingside looks weak, and I will want those pawns when I attack black's castle, so I get the old lady out of the way, preparing to castle queenside. At the same time, she indirectly aims at h6 - one possible solution to alleviate black's fianchetto if it gets too irritating.",
        "8... Re8 9. O-O-O a6 10. Bc4": "I didn't see b5 as all that threatening, but black moved to keep my knights and bishop off of it. That's OK, c4 is a good home for him now anyway, with that f7 pawn looking so weak.",
        "10... b5 11. Bb3 b4 12. Nd5": "Premature. First, black chased my bishop back to a safe square that doesn't limit his usefulness in the center or in threatening the castled king's position. Then he chased my knight onto d5, right where he wants to be. And now his b4 pawn in en prise - I don't think he can save it. 12. ... Nxd4 is followed by 13. Bxd4 and black must choose to lose the pawn at b4 or the rook at a8.",
        "12... e6 13. Nxb4": "I've gained a pawn, and my pieces look set for more queenside mayhem.",
        "13... Nbd7 14. Ndc6": "Black's queen has only one place to go. More importantly, the knight move exposed my attack down the half-open (soon to be fully open) d-file.",
        "14... Qc7 15. Qxd6 Qb7 16. Ba4": "Black avoided exchanging queens for now. I have quite a bit of pressure on the knight at d7. If I can chase away the black knight at f6, say by pushing my pawn to e5, then capture at d7 with something other than my queen, I can probably win material here. Hence, the bishop move to a4. Now I can unmask the bishop's attack on d7 with a move like Na5 threatening black's queen. I can't force any of this yet, but I'm maneuvering toward making this happen. More importantly, that advanced knight on c6 needs some more defenders.",
        "16... Bf8 17. Qd4": "Black chased my queen away, but nothing has changed.",
        "17... a5 18. Nd3": "Black keeps chasing my pieces away. Doesn't he know I'm trying to attack here? Now that extra defender on my knight at c6 is playing a crucial role.",
        "18... Nb6 19. Qxb6": "Black saw, quite correctly, that he wanted to remove the last defender of my advanced knight on c6. However, he overlooked that both my queen and my DSB (Dark Squared Bishop) had b6 covered. I have to give 18. ... Nb6? a ? for that oversight.",
        "19... Qxb6 20. Bxb6": "And now white is up by a knight and two pawns.",
        "20... Bb7 21. Nxa5": "It was free, might as well gobble. This gives white a 3 to 0 queenside pawn majority which, not too surprisingly, will play a role in the final resolution.",
        "21... Reb8 22. Nxb7": "I'm thinking, at this point every exchange favors white with my large material lead. However, this one wasn't too bright, allowing the pawn at a2 to fall for nothing. I should have saved him first. I'll take the ? on my 22. Nxb7? move.",
        "22... Rxa4 23. Nbc5 Rxa2 24. Bc7": "The pawn at b2 looks to be in danger, but he's guarded by the unassailable knight on d3. Still, it can't be a bad idea to bring my bishop to the a1-h8 diagonal for additional support, if needed.",
        "24... Rb5 25. Nb3": "Must protect a1 - I would like to move my rook on d1 forward and prepare to double my rooks on the d-file, but would lose immediately if I played 25. Rd2??? Ra1# or would lose material if I prevent the mate but later I lose my h1 rook after black puts me in check with Ra1 .",
        "25... Nd7 26. Nb4": "I still can't play 26. Rd2? for black wins material with 26. ... Rxb3 threatening immediate checkmate on a1. Recapturing with 27. cxb3 Ra1, 28. Kc2 Rxh1 costs me a knight and doubles my pawns on the b-file, and my kingside pawns are all in danger now. As it is, this is a blunder that let's black get right back into this game. I'll take another ? on 26. Nb4?.",
        "26... Rxb4 27. Rxd7": "I thought I was just exchanging my knight at b4 for black's knight on d7, and setting up to double my rooks, but now I lose my knight on b3 too, for now 27. ... Rxb3, 28. cxb3? Ra1 , 29. Kc2 Rxa1 gains a whole knight for black.",
        "27... Rba4 28. Rhd1": "Black missed his opportunity to win my knight, and now I double my rooks and save the rook from ignoble death on h1. A fair bit of luck on my part. Though the loss of my knight wouldn't necessarily cost me the game (I would still be up by two pawns) it would have certainly complicated matters.",
        "28... Ra4a8 29. Rd7d8": "Pinning black's bishop must be good. So is exhanging those pesky rooks.",
        "29... Rxd8 30. Rxd8 Ra6 31. e5": "The threat was 31. Bd6, winning black's pinned bishop. Black prevented this with 30. ... Ra6. I looked long and hard at 31. Nc5 Rc6 (else 32. Bd6), 32. Nd7 Rxc7 33. Nxf8 threatening 34. Nxe6# but black can squirm out of it, and all it accomplishes is trading bishops. Although, in retrospect, I think all of black's squirming still must cost him at least one pawn, so it may have been the better choice. As played, 32. Bd6 is back on the table as a credible threat to win black's bishop.",
        "31... Kg7 32. Bd6": "Black saves his bishop, now all I can do is trade it, and maybe trade rooks in the process.",
        "32... Bxd6 33. Rxd6": "I considered 33. exd6 to get a passed pawn, but it seemed just a little to easily assailed.",
        "33... Rxd6 34. exd6": "Black chose to trade rooks. This wasn't forced, so he was probably better off not doing it. Maybe he thought he could get his king to my advanced pawn and gain a pawn for his troubles. If so, I don't mind showing him that this line of thinking was flawed.",
        "34... Kf8 35. d7 Ke7 36. Nc5": "Now my pawn is safe and black's king is tied dow to defending d8. True, I cannot yet force the promotion, but black has nowhere to go.",
        "36... Kd8 37. Kd2": "A waste of a move. I had thought to advance my king, and force the d-pawn's promotion. But there is a faster way.",
        "37... e5 38. b4": "And now I play the smart move. There is no way black can prevent both the b-pawn and d-pawn from promoting. He realizes this and resigns."
    },
    "url": "https://gameknot.com/annotation.pl/a-fair-bit-of-luck?gm=21848",
    "gameName": "A Fair Bit of Luck",
    "players": "blake84120 (1504) vs. justnkase42 (1538)",
    "opening": "Sicilian (B76), dragon, Yugoslav attack, Rauser variation"
}