{
    "moves": {
        "1. e4": "ive been practicing the nimzowitsch defense instead of the sicilian for the passed 2-3 months and its helped me improve my rating by 250~ heres a nice game with a gambit i love to do.",
        "1... Nc6 2. Nf3": "im usually most often faced with d4 in this situation but in these rare games where an oponent follows with nf3 i love transposing into this gambit,  ive had a few blunderous games with it  but its been very good to me.",
        "2... f5": "the fun part about my blunders they were usually against much higher rated oponents which made me learn quickly how to improve my moves and discover new ones.\n\ngambit starts here if they accept, it is to undermine whites middle and hold a strong middle as black",
        "3. exf5 d5": "from here on the game can take Very many different dynamics depending on what white does. the most aggressive move is usually Bb5, others also tend to play D4 first.\n\nwhen white starts to try to hold onto the pawn is when a nice game develops for black,\nBe2 or g4 are generally not good moves for white, neither is Kh4  and Bd3 also lacks alot of punch where black will have a fun game if he plays it right.",
        "4. Be2": "This is the first time i face Be2 and after researching this opening and practicing it i went against the general flow of my practiced opening because of Be2, ",
        "4... Bxf5 5. O-O": "some games ive gone g6 here others times ive also tried e6 or Kf6 also which have given me various results sometimes very difficult games for myself as white takes a really Passive deployment to an opening thats meant to be very aggressive and counter whites mid.\n\nbut this game white is not developing mid so i opted to go with a new d4 to crunch white in",
        "5... d4 6. d3": "hes forced to d3 if not i can push my pawn to d3 end up with possibly cxd3 Bxd3 Bxd3 Qxd3 blocking his black bishop in behind his pawn and then possibly castle queen side or develop my knight but he opted to play the D3,  which i found was ok as it kept his white bishop in",
        "6... e5 7. Re1 h6": "as im venturing forth in my new line in this opening i can start seeing my e5 pawn can be lost or can become my demise if i start focusing too hard on defending it,\n\nfor now ill prevent his Black bishop from coming into the game. ",
        "8. h3": "having played h6 last move allows me to have a tuck away spot for my white bishop when he plays g4 and him moving his pawns up is desired as im going king side attack",
        "8... Bd6": "at the time of the game after playing this move and following his reply is when i took a while to analyse that fighting for the e5 square was very dangerous for me in the long run",
        "9. Nh2 Nf6": "i had to fully develop, connect my rooks, queen side castle and forgo the e5 pawn.i concluded that path would have me in a far better position if play developed naturaly i would have too many pieces developed near his king for it to matter at the part of where i would lose my pawn.",
        "10. Bf3": "he still has to develop his knight to be able to come upon the e5 pawn ",
        "10... Qd7": "here i force the kick on the bishop to gain time for my queen side castle",
        "11. g4 Bh7 12. Nd2 O-O-O": "as i saw the battle coming to e5 is where i had to think of what my plan was. this is where i saw the checkmate from.  from my part thats if my oponent played how i calculated too lol but the game development looked natural enough to calculate.",
        "13. Nc4": "he wants to fight on e5 i knew it from a while back this is where i trick him ill act as if i dont want to fight on e5 anymore but to just gain time on that diagonal without repositioning his WSB either, to keep mine alive i do not want to have any types of exchanges on e4 either",
        "13... Bb4 14. Nxe5": "for sure he had no other choice but to go with what he had planned. i dont want to eat his Rook i want to reposition my Bishop on d6 without his queen or black bishop getting involved",
        "14... Nxe5": "so i exchange knights only piece he can recapture with is rook and allows me to gain time with my bishop",
        "15. Rxe5 Bd6 16. Re2 g5": "this is planning to open up the lines for my h8 rook it also kinda forces my oponent to make a passive move",
        "17. Bd2": "one of the reply i most likely thought as he was getting crunched and wants to get his last rook in play.",
        "17... h5": "looks like a mistake but its time to promote queen to d6 and not let him start stacking his queen and rooks or develop any type of attack queen side either.",
        "18. Bxg5": "natural reply looks like gaining material and attacking the knight. this is where my bishop sack comes in, and i was able to type in atleast 5 different lines of conditional moves to a checkmate from here on out. and i logged back in with a message congratulations game won checkmate",
        "18... Bxh2+ 19. Kxh2 Qd6+ 20. Kg2": "here was the second trick i thought of for him as he was a material grabber, and fully opening up my lines for my rook",
        "20... hxg4 21. Bxg4+": "the rook \"sacrifice\" is coming, i didnt need my d file rook. ",
        "21... Nxg4": "for some reason i knew he would eat the rook :D dont you love conditional moves that work",
        "22. Bxd8": "nothing he can do anymore from here on out. i believe i also had something calculated in the event he ate the knight first with pawn as in 22. hxg4 Bg6 23. Bxd8 Qh2+ 24 Kf3 Rf8+\n25. Bf6 Rxf6# still with a rook \"sacrifice\" i think it just looked too tempting for his bishop lol",
        "22... Qh2+": "1",
        "23. Kf3": "2",
        "23... Qxh3+": "3",
        "24. Kf4": "4",
        "24... Rf8+": "5",
        "25. Kg5 Rf5#": "a nice checkmate with 4 of my pieces surrounding his king looks pretty nice :D\n\ni hope you enjoyed the game feel free to comment,  i posted this game to help fellow kin black players :D who want to try new openings. i think i checked database once early on playing this opening and dont think i had found any games. also i did a computer analyze on one and it rates f5 as a mistake in the opening:D"
    },
    "url": "https://gameknot.com/annotation.pl/a-few-tricks-for-black-players?gm=55314",
    "gameName": "A few tricks for black players",
    "players": "vbelekar80 (1431) vs. trixstermtl (1493)",
    "opening": "KP (B00), Colorado counter"
}