{
    "moves": {
        "1. e4": "The usual 1.e4",
        "1... e6": "The French Defence, an opening I'm somewhat familiar with.",
        "2. d4": "Taking up more of the center, the most common response according to the GK game database.",
        "2... b6": "This is something I had never seen before, but after looking at it, I thought that it was pretty logical; the LSB is blocked in behind the e6 pawn in the French and putting the bishop on b7 both solves that problem and puts the bishop on its longest possible diagonal.",
        "3. Nf3": "Pretty standard, covering more of the center, preparing to castle, and blocking out the potential bishop on b7.",
        "3... Bb7": "Exactly what I saw coming at this point, I'm not extremely worried about that bishop right now because I have material in its way, but I do know I have to keep an eye on it.",
        "4. d5": "Looking at the GK game database, this is the only (somewhat reasonable) move that gives black the better winning percentage. From what I can see, the only bad thing with this move is that after an exchange of the pawns, white's queen side pawns might be a little overextended, but the d pawn would still block in his well-positioned LSB.",
        "4... Nf6": "A developing move that forces white to do something with the pawns planted on the a8-h1 diagonal and prepares to castle",
        "5. dxe6": "Looking back, I'm not so sure about this choice. It takes a pawn off the diagonal I was looking to block off but allows him to have more influence in the center with his 2 pawns to white's 1.\r\nI'm fairly certain that 5. Nc3 or Bd3 would have been better",
        "5... fxe6": "The logical recapture",
        "6. e5": "White left this pawn hanging, so this was one of the few options with this pawn, but now it's even more isolated.",
        "6... Ng4": "This keeps the knight off the diagonal, places it aggressively on the king side attacking the weak f2 square, and puts pressure on the isolated e pawn.",
        "7. Bf4": "This move is somewhat questionable; it overprotects the pawn allowing the knight to move if necessary and develops a piece evening things out as far as that goes, but very awkwardly puts the bishop in a place where it can only retreat.",
        "7... Be7": "Develops the bishop without overextending it and allows for black to castle and at the same time place his rook on the potentially open f file.",
        "8. h3": "White wants a little breathing room on the king side and that knight is both a pest and easily kicked out. This is a pretty safe move because there is no real possibility of a sac on h3 because the bishop is on b7.",
        "8... Nh6": "The knight's only square to go to",
        "9. Nc3": "Evening out development",
        "9... Nf5": "A strong square for the knight, and it practically begs white to push the g pawn to greatly weaken the king side",
        "10. Bd3": "Developing white's final minor piece allowing him to castle ",
        "10... O-O": "Securing the king and once again, placing the rook on the potentially open f file.",
        "11. O-O": "Also securing the king ",
        "11... h6": "This ensures that the knight will only become more aggressive if it moves, and it also prepares to clear out white's minor pieces on the f file and possibly start a pawn storm.",
        "12. Ne4": "This move brings the knight into the action while trying to keep black's LSB out of it; however, it doesn't do much as far as preventing a pawn push or pawn storm.",
        "12... Nh4": "Attempting to reopen the a8-h1 diagonal and open the f file while making a revealed attack on the bishop on f4",
        "13. Nxh4": "The only way I could see to keep from exposing the white king.",
        "13... Bxh4": "The more logical of the two possible captures, because it adds pressure to white's king and doesn't allow white to annoy black with 14. Ng6 which gains a tempo and puts the knight right in the black king's face after 13...Rxf4.",
        "14. Bg3": "Offering a trade to get black's stronger bishop off the board, but the trade would hang the e pawn.",
        "14... Bg5": "I do not care for this move, in my opinion retreating to e7 and then relocating on the queen side to work with the LSB to aim at white's king or leaving the bishop on h4 and letting white give the black queen a personal invitation into the game is much better.",
        "15. Qh5": "! With light square holes in black's defence, white tries to take advantage of them.",
        "15... Bf4": "Enticing a trade that would bring the black rook awkwardly onto the 4th row in the middle game, but it also takes away the bishop as a defender of the f6 square.",
        "16. Nf6+": "!! Either wins the exchange or clears the path for victory\r\n- 16... Kh8 17. Qg6 (no matter what black does besides 17... Be4, which just delays the inevitable, there is checkmate next move)",
        "16... gxf6": "Not seeing white's plan of action, black takes the sacrifice instead of the loss of material.",
        "17. Qg6+": "Using the newly opened g file",
        "17... Kh8": "Forced",
        "18. Qh7#": "That's all she wrote. Thanks for watching, and I hope you had a good time and maybe took something away from this. I probably missed some things in my annotation, and if you would like to point them out either through a comment or private message, I would appreciate it."
    },
    "url": "https://gameknot.com/annotation.pl/a-fun-miniature?gm=16363",
    "gameName": "A Fun Miniature",
    "players": "rockhawkamn10 (1437) vs. aghori (1552)",
    "opening": "French defence (C00)"
}