{
    "moves": {
        "1. e4": "The beginning of a game that will be fuill with tricks and tactics.\nIt start a biut slow, but at it height both players throw in some big moves.\nAnd the game seem to change direction several times.\n\nIts only thorugh sheer agressiveness that I managed to win it in the end.\nButy more importanly my oponnent and me both trully enjoyed playing this game.\n",
        "1... e5 2. f4": "The Kings gambit, I am not fond of it.\nIt has caused me some troubles, because I am too aggressive a player to like defense.",
        "2... exf4": "I have successfully tried Qh4+ several times.\nUnfortunately if white plays correctly he will have a good game.\n",
        "3. Qf3": "Odd move, and certainly not the strongest.",
        "3... Nc6 4. c3 Nf6": "I my experience developing another piece is always the best mpve.",
        "5. d4": "I am not liking it, how to deal with that centre? \nI contemplated d5, but I did not like it.\nSo instead I took the safe road, but it is too passive.",
        "5... d6": "To slow probably.",
        "6. Bxf4 Bg4 7. Qe3 Qd7 8. h3 Bh5 9. g4": "Black now has a very cramped position, but white has commited himself on the Kings side.\nIf I can just break it open for my pieces to come out, I could do some severe damage.\nBut for now I will have to content developing as many pieces as I can.",
        "9... Bg6 10. Bg2 O-O-O 11. d5": "I feel this is to black advantage, since I am gaining a strong field on e5.\nWhite is probably intending an assault against my king on the Queen side.\nLet me make good use of that e5 square first.\n\n",
        "11... Ne5 12. Nd2 Qa4": "Making room to manouver.\nUnfortunately the Queen is now sidetracked for a large part of the game.\nPerhaphs then Qe8 might have been better.",
        "13. Ne2 Nfd7": "Not bad, I have a good hold on e5 now.",
        "14. O-O": "Alright, he has shown his hand, he intends to assualt my king.\nThe pawn on g4 give me a chance to open up lines towards his own king.\nBut I am crammed, and need space to manouver.\n",
        "14... f6 15. a3 Bf7 16. b3 Qa6": "Aiming for e2, but here the Queen is out of action for a long time to come.",
        "17. c4 g5": "I need space! So I sacrifice a pawn, hoping for open lines I can use.",
        "18. Bxe5": "I",
        "18... Nxe5": "Had I been white I would have continued with Ng3.\nBoth f6 and f5 are good for using as a focal point of attack.\nThe extra pawn is not that valuable.\nAFter 20.Ng3, h5; 21 Nf5,hg4; 22.hg4, Bg6, my position is not great.",
        "19. Rxf6": "Giving black some crucial open lines.\nI dont think white should have taken this pawn at all.",
        "19... Bg7": "That should be worth a pawn.",
        "20. Rff1 h5": "Opening even more lines. \nIf my Queen were on the kings side, I could have a strong attack going here.\nAlas, she has wandered of to far places.\n\n\nYou might notice the bishop aiming at the rook on a1.\nAlas, there seems no direct way to profit from that.\n",
        "21. Ra2": "Things have changed, black has good play, but his Queen is still offside.\r\nIf only it was available on the Kings side of the board!",
        "21... hxg4 22. hxg4": "The game of tactics has started.\nIts is going to be a brawl.",
        "22... Kb8": "Ussually I would play asa agressive as possible.\nI regret not playing an immediate Rh4.\nBut I got worried about Qf5+, and wantd to remove that first.\nWhite needs to be carefull to take the g5 pawn, since it will bring in black Queen after Qb6+",
        "23. Bh3 Rh4 24. Kg2 Rdh8": "That one move delay has allowed white to build a strong defence.",
        "25. Ng1": "To my disappointment white has had time enough to solidify his position.\nIf only I had not played Kb8...",
        "25... Bg6 26. Qxg5": "That is dangerous, since it allows blacks Queen to re-enter the game,",
        "26... Qb6": "Getting the most important piece into play",
        "27. Rf8+": "Nice move! \nThis move makes it an interesting game by itself.\nBut there is more to come...\n\nFor a moment I though I just lost major material.\nThe I realized it is a fake sacrifice.\nWhite is hoping to release some pressure on the h file.",
        "27... Rxf8": "Forced. ",
        "28. Qxh4 Qe3": "Here she is, finally...\nThe rooks sacrifice has actually allowed black to bring in reinforcements.",
        "29. Kh2": "How should black continue now?\nI took my time deciding on my next move.\n\nAfter 29..,Rf2+; 3-.Bg2, there is not time to play Bxe4, because of Qd8#;\nAlso Nd3 seems possible, but after much thinking I did not like it enough.\n\nSo how to continue?\n\n",
        "29... Bh6": "This is a very mean move!\nOne of my best moves in this game.\n\nIt is hard to see its real purpose, which is to capture white Queen with either Bg5, or Ng6.\nOf course I had to calculate responses like Nf1, but I think black comes out on top.\nWhite needs to be on his guard!",
        "30. Kh1": "That is too simple, Nf1 seems better.",
        "30... Bg5": "Surpise!",
        "31. Nf1 Bxe4+ 32. Bg2": "Now black can simply gain a piece with 32... Qf4; \nThe knight on f1 remains unprotected.\nBut I was not satisfied with that result, and decided to go for more.\n",
        "32... Qxb3": "I noticed Qf4, but I wanted more.\nMy reasoning was that this should win me two or three pawns.\nSo it should be h=just as good, right?\nWhat I like about Qxb3, is that is leaves all white pawns hanging.\nIt seemed more aggressive to play this way, and I figured it might actually win quicker.\n\nI had calculate the next few moves carefully, but I managed to miss one important move.\n",
        "33. Rf2": "Surprise",
        "33... Rg8": "No surprises so far.",
        "34. Qxg5": "Of course, I had seen it, but I though I had a good reply.",
        "34... Rh8+ 35. Nh2": "If 35. Nh3, then we have a nice checkmate 35...,Qxh3+; 36.Kg1, Qh1+; 36. Bxh1, Rxh1#;\n",
        "35... Qg3": "I had calculated this far, and believed I was going to win some material here.",
        "36. Qh5": "Oopps!\n\nAnd what a move!\nOf cource Rxh5 is met with Rf8#;\nAnd after 36..Qxh2+; 37.Qxh2; Rxh2+; 38. Kxh2, Nxg4+; 39. Kg3; Hxf2 black is left with a piece down.\n\nHow things haved turned!\n",
        "36... Rg8": "My best bet. \nNow white should have continued 37. Bxe4!, Qxf2;\nAfter that white has the best chances.\n\nThe game seems to go in the same direction, but there is a major difference.",
        "37. Nh3 Nd3": "Aggressive play till the very end.",
        "38. Qf7": "Even now Bxe4 would have been better.\nBlack can not safe the exchange: 38. Ra2, Qe1+; 39.Ng1, Bxg2+; 40.Rxg2, Nf2+, etc.\n",
        "38... Nxf2+ 39. Qxf2 Bxg2+ 40. Qxg2 Qxa3": "If you think the game is even then you are mistaken.\nWhite is in trouble, because he need to defend both his kingsside and his queens side.\nThe poor knights dont have the leg be present on both sides of the board howoever.\n\nIf white has kept his bishop, it would be a different game.\nBut as it is he is going to be overwhelmed.",
        "41. Qf1": "White need to defend four things: his king, pawns g4 and c4, and he need to stop balck a pawn.\nBlack can win four ways.\nHe can win by checkmating whites kings, or he can march his a pawn to promotion.\nBiut black can also gain pawn c4, in order to create an unstopppable pair of pawn on the a and b fil.\nFinally black can win pawn g4, and then exchange all pieces to arrive and a winning pawn ending.\n\nWhite has a hard time defending again all these threats.",
        "41... Rh8": "Aggresive play yet again.",
        "42. Ng5": "Nf1 is way too passive.",
        "42... Qb2": "Another good move.\nOriginally I planned Qg3, but then realized I need to combine play on both ides of the board.\nFrom here the Queen threatens white Kings, threatens c4, and supports blacks a pawn.",
        "43. Ngf3 a5": "Here comes the cavalery.!\nWhite needs to play carefully, or he will be in trouble.",
        "44. Qe1 a4 45. Qd2": "Well played, the Queen and Night should be able to stop the pawn with combined strength.",
        "45... Qb1+ 46. Qe1": "Ne1 seems better, in order to bring the Knight to c2, to stop the a pawn.\nBlack easiest win would be Qe4+ and Qxc4 creating an unstoppable pair of pawns.\n\n",
        "46... Qd3": "Another strong move, ttacking Knight, pawn c4 and supporting the a pawn.\nThe game is over, because white can no longer defend against all these threats.",
        "47. Nd2 a3 48. Qa1": "Nice last try, but black has a simple response",
        "48... Rxh2+": "And white resinged.\n\nThe end is forced 49.Kxh2, Qxd2+; 50. K~, Qb2;\nAnd thee a-pawn is finally unstoppable.\n\n\nWhat a game!\n"
    },
    "url": "https://gameknot.com/annotation.pl/a-game-full-of-surprises?gm=43814",
    "gameName": "A game full of surprises",
    "players": "pmmiller (1727) vs. eduard352 (1756)",
    "opening": "KGA (C33), Breyer gambit"
}