{
    "moves": {
        "1. e4 b6": "New Year, new moves. I've decided to break with tradition (the 1... e5 response to 1. e4), and move up a knight's pawn in order to fianchetto my bishop...",
        "2. d4 Bb7": "...which is exactly what I do here. I'm hoping to give White a surprise with my bishop on the long diagonal...",
        "3. Nf3 Bxe4": "...which is what I do here. I decided that every pawn counts, so I accept it to give me an advantage, which proves to be crucial in the endgame.",
        "4. Nc3 Bxf3 5. Qxf3": "I may have squandered material and development by sacrificing my bishop to remove White's knight, but I am a pawn up, and I am trying to trade down as much as possible to make my extra pawn count...",
        "5... Nc6": "...and as the queen is threatening the rook, I block her line of attack with my knight, although her pawn could threaten it if it moves...",
        "6. Be3": "...but he's well ahead on development, getting out his bishop. I really should pull back soon...",
        "6... e6": "...so I free up my remaining bishop, as well as the queen, also attacking the square White's pawn, knight and queen could move into...",
        "7. Bb5": "...but he's well ahead on development now, four pieces against my one. If my knight stays, I lose a pawn...",
        "7... Nb4": "...so I move it forwards again. This was very dodgy, moving a developed piece a second time, but the rook on a8 is now defended by the queen, and I'm trying to catch White off his guard, hoping to win the pawn on c2 and the rook on a1...",
        "8. O-O-O": "...but he read that move. However, I can repel his light-square bishop...",
        "8... c6": "...by moving up the pawn that started in front of mine.",
        "9. Bd3 Nxd3+ 10. Rxd3": "I again decide to exchange, this time sacrificing my knight in exchange for White's bishop. No developed pieces to his four...",
        "10... Qf6": "...so I do something you shouldn't really do, unless you are exchanging knights on the f-file, and develop the queen onto the long diagonal on that file. That's the second time I've done something that shouldn't be done, but I'm contesting the file...",
        "11. Qxf6 Nxf6": "...but I do get the exchange. And my knight emerges, as a result. So that was a hopeful move which paid off, and I've pulled back on development.",
        "12. f3 O-O-O": "I think I may have made a mistake, castling queenside, as it is less of an issue, now that the queens have left the board...",
        "13. Bg5": "...as the bishop can now force the knight to act as a pin...",
        "13... Be7": "...so I develop mine to avoid doubled pawns...",
        "14. Ne4": "...and he brings his knight on the attack to put pressure on mine...",
        "14... Nd5": "...so I move mine out of the way, defending the bishop...",
        "15. Bxe7 Nxe7": "...so we trade our bishops. I felt as though I was in trouble here: White could play 16. Nd6+!, setting up 17. Nxf7!, to win a rook for his knight.",
        "16. g4": "I was extremely lucky there! White could have played 16. Nd6+! forcing my king to move, then 17. Nxf7!, forking my rooks, so I would lose one, for his knight...",
        "16... Rdf8": "...so now I avert the danger, by placing my rook behind the threatened pawn. Now there's no chance of the knight capturing a rook, I was lucky there, trying to keep a pair of minor pieces on, to try to make it easier to capitalise on a single pawn advantage...",
        "17. h4 f5": "...but now I can fork the knight and a pawn, with my pawn...",
        "18. Nc3 fxg4 19. fxg4": "...and although White probably benefited from the pawn trade (the first time in the game he's captured one of mine), being a pawn down, it did open up the file, so I could double rooks on it...",
        "19... Rf4": "...so I bring up my rook already on it to threaten the pawn on g4...",
        "20. Rg1": "...forcing his kingside rook into a passive position, as his queenside one, was already defending another threatened pawn.",
        "20... Rhf8": "As a result, I can double up on the open file, and even go in for an exchange...",
        "21. Ne2 Rf4f1+ 22. Rxf1 Rxf1+": "...which I get after the knight move, which I anticipated. My remaining rook is well placed, and I'm looking to exchange the remaining pair, or to hoover up White's pawns...",
        "23. Kd2 Rf2": "...so I use my rook to pin his knight down...",
        "24. Ke1 Rg2": "...but as the king pressures it, I pressure his pawn.",
        "25. Rg3 Rxg3 26. Nxg3": "This was another good exchange for me: we now have a single-knight endgame, where I'm a pawn up, and I thought I could capitalise on my slight advantage, as a knight has limited range, and can cover all the squares.",
        "26... g6": "I felt that moving up my knight's pawn was necessary to restrain White's knight by covering h5 and f5, to stop it from capturing the pawn...",
        "27. Ne4": "...but although e4 isn't covered...",
        "27... Nd5": "...I can cover f6, although White could play 28. Ng5 to threaten my rook's pawn...",
        "28. a3": "...but he felt I was trying to threaten his queenside, although there was a possibility he could trap my knight had I captured one of his pawns...",
        "28... Ne3": "...but I can now fork two of his pawns with my knight...",
        "29. c3 Nxg4": "...and I felt this was a good capture, as those kingside pawns were quite advanced. As a result, I've isolated the one on h4, whilst doubling my advantage.",
        "30. Ke2 Kc7 31. Kf3 Nh6": "This was the only square my knight could move to...",
        "32. Nf6": "...and White's is now eyeing up my rook's pawn...",
        "32... Nf5": "...so I threaten his own, as mine is unsavable...",
        "33. Nxh7 Nxh4+": "...and we capture them, making my knight's pawn passed, but isolated and weak. However, I have a two pawn advantage, again, and my knight can operate queenside...",
        "34. Kg4 Nf5 35. Nf6 Ne3+ 36. Kg5 Nd1": "..and fork two pawns on that side of the board...",
        "37. Kxg6 Nxb2": "...and I benefited from this pair of moves: I lost my weak isolated pawn, and captured a strong one, isolating one, too...",
        "38. Ne4 Nc4 39. a4 Nb2 40. Kf6 Nxa4": "...allowing me to make my own QRP passed. Ten consecutive knight moves made by me in 13 out of the last 14, with the king move being to protect my queen's pawn, but the knights are the fastest movers out of all the remaining pieces on the board, and a three pawn haul, in exchange for two of mine was very good for me: I can now finally make the most of my advantage.",
        "41. c4 d5 42. cxd5 exd5": "This was another good pawn trade for me: they are all connected once again, and White's only pawn is immovable, so I can get rid of it...",
        "43. Ng5 c5 44. dxc5 bxc5": "...and have connected pawns in the middle of the board, which could help each other.",
        "45. Ke5 Kc6 46. Nf3 c4 47. Ne1 Kc5 48. Nc2 d4": "Why did I advance that pawn...",
        "49. Nxd4": "...and not notice that the knight was controlling that square?",
        "49... c3 50. Nc2 Kc4 51. Ke4 Kb3 52. Kd3 Nc5+": "Now I can remove the protection from the knight...",
        "53. Kd4 Kxc2": "...and capture it, to give my pawn a free run...",
        "54. Kxc5": "...in exchange for my own knight...",
        "54... Kd2": "...and White resigned here, because he knew he couldn't stop my pawn."
    },
    "url": "https://gameknot.com/annotation.pl/a-good-exercise-in-knight-endings?gm=28737",
    "gameName": "A Good Exercise In Knight Endings",
    "players": "hkal (1393) vs. aspiemikey (1278)",
    "opening": "Guatemala defence (B00)"
}