{
    "moves": {
        "1. d4 Nf6 2. c4 e5": "The dangerous Budapest. I am exploring it, but I am still not convinced. ",
        "3. dxe5 Ng4 4. Nf3": "You can trhow the check in now, but it doesn' make much difference. Still, it is better to do it inmediately, to stop the white queen's excursion to d4 or d5.",
        "4... Nc6 5. Bf4 Bb4+ 6. Nbd2 Qe7": "This bishop is doomed, but it can always take the knight. ",
        "7. e3 Ncxe5": "No need to take BxN at once, unless white wastes a move forcing me. ",
        "8. Nxe5 Nxe5 9. Be2": "Now, I have to state that all this was for something. I am still far from castling... queenside!",
        "9... d6 10. O-O g5": "The fisrt shot. ",
        "11. Bxe5": "pawn or queen? The queen in e5 is very well placed, and threats b2 (the bishop can be saved after Qxb2, Rb1, Qc6, etc... or so I thought). ",
        "11... Qxe5": "Taking with the pawn would have provided a nice d open column, but probably I couldn't have used it for castling anymore, and... my kingside is to attack. ",
        "12. a3": "At least. I could have retired the bishop, but I didn't want to provide so much space to white pursuing it with the pawns. ",
        "12... Bxd2 13. Qxd2 h5": "Just throwing it there. ",
        "14. f4": "Good for him AND for me... interesting. ",
        "14... gxf4 15. exf4 Qc5+": "This check would be absolutely correct, and without it, I would have lost sooner. ",
        "16. Kh1 Be6": "Maybe wiser Bf5. Definitely. ",
        "17. f5": "the right one. ",
        "17... Bxf5": "The wrong one. I shoud have taken c5. ",
        "18. b4": "Uh-oh... look at the only place for the queen...",
        "18... Qe5": "A lot of tactic here... wait. ",
        "19. Bd3": "White thinks it is so easy to throw a rook on e1 and win... but...",
        "19... Qd4": "Now, if Re1+, Be6. But white went...",
        "20. Rxf5": "!",
        "20... Qxa1+ 21. Rf1": "So I have material advantage, an open king, and undeveloped rooks... this is a new game! How to proceed?",
        "21... Qd4": "Double-edged move. I smelt danger in taking the a pawn... Qg5 by white could have been very annoying. ",
        "22. Re1+ Kf8": "Not Kd7, losing the queen, of course, and not Kd8, blocking forever my rook. ",
        "23. Qe2 Qf6": "I was right to keep my queen on the diagonal. ",
        "24. Rf1 Qe7 25. Qb2 Rg8": "In this sequence, I am threatening all the time the back rank mate, and I am even piling up to g2. But, despite my advantage, I find difficult to unravel my pieces. ",
        "26. Qd2 Qe6": "Stopping his checks. If I can exchange queens, the trick is done. ",
        "27. Bf5 Qf6": "This was like a \"defiánce glove\"... I can defend, and more than that, I am pinning the bishop. ",
        "28. Qd3 Rg5": "Again, maybe better was Re8. Or Rb8, in sight of the loss of a pawn I overlooked. ",
        "29. Be4 Qg7 30. Bxb7 Re8 31. Bd5 Re7": "Maybe f6 was indicated, instead. But it starts to look funny. ",
        "32. Qh3": "I tried to imagine a way to provoke unbalance, and see if I can take advantage once more from the back rank threat. It will cost me pawns, and the game. ",
        "32... Rge5 33. Qc8+ Re7e8 34. Qxc7": "Now, he trheats Bxf7, so...",
        "34... Rf5": "Or Re1, better. Or, again, f6. ",
        "35. Qxd6+": "Third lost pawn. ",
        "35... Kg8 36. Rd1 Rf2": "Not a good move, but prevents him to move the bishop for a moment. ",
        "37. Qg3": "Well, I liked my queen, but now it's over. No back rank mate. I think I should have considered to return the exchange if I could have recovered some pawn in the midtime. But I threw my advantage away. The bishop, here, is as strong as a rook. ",
        "37... Qxg3 38. hxg3 Ra2": "\"I still have time to stop the pawn in c...",
        "39. Rf1 Re7 40. c5 Rd2": "Mistake. I should have taken the pawn. Anyway, white should have played his rook to c1, in my opinion. ",
        "41. Bf3": "The h pawn is lost, because if Re5, my rook doesn't control anymore the c pawn. It could have had the time to come back to the 7th or 8ht rank, but...",
        "41... h4": "Just bad. Better let him take the pawn and got an extra tempo for pawn's grabbing. ",
        "42. gxh4 Rd4 43. h5": "So I cannot even retake the pawn with the check. ",
        "43... Kg7": "We both overlooked the c column for our rooks...",
        "44. c6 Rc4": "At last...",
        "45. Rd1": "45 moves for a blitz are a lot. I was kind of lost, here. I must admit. ",
        "45... f5 46. Rd7": "Interesting. By changing the crowning's square colour, it should be easier for me to stop his pawns. ",
        "46... Rxd7 47. cxd7 Rd4 48. Bc6 Kh6": "Now the king takes the white pawn, and while white tried to progress on the other side...",
        "49. b5 Kxh5 50. a4 Kg4 51. Kh2": "White realized the mate net he was falling into. ",
        "51... f4": "Here, I followed the wrong plan (but everyone would have been bad...)",
        "52. a5 f3": "My final blunder, I didn't consider the obvious...",
        "53. Bxf3+ Kf5 54. Bc6 Rh4+ 55. Kg3 Rg4+ 56. Kf2 Rd4 57. b6 Kf4": "No time to threat again a mate. Thank you for reading, I hope you enjoyed the game. "
    },
    "url": "https://gameknot.com/annotation.pl/a-good-tricky-game?gm=47993",
    "gameName": "A good tricky game",
    "players": "player (1800) vs. damalfi ",
    "opening": "Budapest (A52), Adler variation"
}