{
    "moves": {
        "1. d4 d6 2. Bf4 c6": "Pretty unusual. It should be bad, but in a way that only great masters can exploit. ",
        "3. c3": "As a rule, in my scheme, when black moves the c pawn, I have to move mine, so I can counter Qb6 with Qc2 or Qb3. Period. :-)",
        "3... Qc7": "Strange movement, but it is seeking for an early e5 without fearing the queen's exchange. It makes sense. ",
        "4. e4": "I overlooked Nf3 in order to contest the center. My mistake. ",
        "4... e5 5. dxe5 dxe5 6. Bg3": "this way I thought that the pressure against e5 will compensate the bishop's inactivity. If black goes f6, it opens the way for a future Qh5+, once more conditions are met. ",
        "6... h6": "Useless move. Probably black is already thinking in a pawn's storm, but then why not h5?",
        "7. Nf3": "Attacking e5 and developing. ",
        "7... Nd7": "Defending e5, but blocking his own lsb. ",
        "8. Bc4": "Attacking f7. ",
        "8... Ngf6": "Attacking e4.",
        "9. Nbd2": "Defending e4. I'm not blocking any bishop with this move, but it is to be acknowledged that if my dsb were in e3 I'll stay better. ",
        "9... a5": "Well, the pawn's storm will be the other side. ",
        "10. Qb3": "I calculated that if a4 was played, Bxf7+, Kd8, Qe6, but I was unsure about Nb6, then, attacking the queen. The escape is Qxe5, so it's all ok. But I overlooked the simple... ",
        "10... Nc5": "A pity, possible because of my dsb not being in e3. ",
        "11. Qc2": "Sadly. And I have to cover e3 from the knight.",
        "11... Bd6": "Freeing the queen, developing for castling. ",
        "12. O-O": "No more risks. The game was slightly out of control, so better to be wise. ",
        "12... b5": "Black attacks, by his own right. Well done. ",
        "13. Be2": "Zen retreat. Often a best stategy. ",
        "13... Be6": "Occupying a good diagonal. Black is frankly better, but it is not easy to materialize his positional advantage. ",
        "14. b4": "The only one to react. I didn't want to wait passively for the black pawns, they were too well supported.",
        "14... axb4 15. cxb4 Na4": "Fortunately for me, e5 is occupied so the black's dsb can't do too much harm, and it doesn't support the knight. ",
        "16. a3": "Necessary to defend the pawn, and releasing the a1 rook from defending a2. ",
        "16... Qb6": "Planning to push the c pawn, suppoted by a rook. Very wise. ",
        "17. Rfd1": "The bishop is hanging...",
        "17... Nd7": "Supporting c5. It is the right moment to exploit the hanging bishop, to relocate the knight on a better square... (?)",
        "18. Nf1 Bc7 19. Ne3": "Well, the position holds, for the moment, but nothing can stop the c pawn to advance.",
        "19... c5 20. Rac1": "I avoid cxb4 (QxB), but I accept c4. I didn't like to open the position for the black minor pieces with bxc5, Nxc5, etc. It only gives black more chances (do you agree?)",
        "20... c4 21. Ng4": "Now, this was just a blunder. I wanted to try Nh4, or Nf5 instead, but as often happens in blitz, I just didn't see the white bishop. I'm ashamed, but it's true. ",
        "21... Bxg4": "Now, the incredibe thing about this is I win the game. How was it possible? Let's see: ",
        "22. Rxd7": "ANOTHER sacrifice.",
        "22... Kxd7": "Wrong move. Bxd7 and I had nothing. ",
        "23. Nxe5+": "ANOTHER sacrifice. ",
        "23... Bxe5": "-7. ",
        "24. Bxg4+ Ke7": "If Kd6, I had Rd1+, and the bishop is lost anyway. ",
        "25. Bxe5": "Piece recovered. -1. ",
        "25... Kf8": "Bad move since it blocks its own rook. But f6 left all the white squares to my bishop. Rg8 would have blocked the rook for a good while. ",
        "26. Rd1": "Black can still play Rd8. The exchanges release my firepower against his king. ",
        "26... Kg8": "Bad plan, since the king cannot find a secure shield in h7. My turn. ",
        "27. Rd6 Qb7": "Suddenly, the black Queen is running out of squares. ",
        "28. Bf5": "If g6, BxR, and I can save the other bishop after black retakes one of them. But Bxg6 can be possible: if f7xBg6, Rxg6+, Kf7, and try to get the most of an attack. Even if my queen is not properly placed to join it. ",
        "28... Qe7": "An idea is forming into my mind. ",
        "29. f4 f6": "As foreseen. As I told before, this move is very dangerous for black because of the white squares' weakness. ",
        "30. Rd7 Qf8 31. Bd6 Qe8": "This is a piece dance. ",
        "32. Re7 Qc6": "All it was about was to let me play e5, since my queen controls h7. ",
        "33. Be6+": "If Kf8, the ball could have gone on with Rd7+, but more precise would be e5, since black cannot take fxe because of Qf5+ and death. ",
        "33... Kh7 34. e5+ f5 35. Qxf5#": "An impressive ball of pieces, after just a weak black move after my blunder. I cannot say that it was a sacrifice, since BxRd7 would have lost the game for white, but still a nice chess tangler. I hope you enjoyed it. "
    },
    "url": "https://gameknot.com/annotation.pl/a-juicy-attack-a-ball-of-pieces-vs-queen?gm=48473",
    "gameName": "A juicy attack: a ball of pieces vs. queen.",
    "players": "damalfi  vs. darkside753 ",
    "opening": "Queen's Pawn (A41)"
}