{
    "moves": {
        "1. e4": "I was wanting a quick win, so e4 suited me better than d4 in this case.",
        "1... e5 2. Nf3 Nc6 3. Bc4 Nh6": "Black's first non-standard move. Bc5 - the Giuoco Piano or Italian Game, or Nf6, the Two Knights' Defence are the most common replies. d6 or Be7 are also playable. Nh6 is understandable, protecting f7, and is probably playable, but unusual!",
        "4. c3": "So white builds up a big centre.",
        "4... d6": "And black carries on developing",
        "5. d4": "I find black's next, Ng4, a bit strange. Black seems afraid of Bc1 x Nh6, but g6 was probably the best reply.",
        "5... Ng4 6. h3": "So just push it back",
        "6... Nf6 7. Ng5": "With of course the nasty threat of taking on f7. Be6 is met by d5, so black's reply is forced",
        "7... d5 8. exd5 Nxd5": "This is probably a mistake. The position is very similar to a Two Knight's defence, and after d5 black's best is not to recapture, but to play Na5",
        "9. Nxf7": "and now we have a version of the Fried Liver Attack! Let me quote from Wikipedia \"The Fried Liver Attack, also called the Fegatello Attack (named for an Italian idiom meaning \"dead as a piece of liver\"), is a chess opening. This colourfully named opening is a variation of the Two Knights Defence in which White sacrifices a knight for a superficially impressive attack on the enemy king. The Fried Liver has been known for many centuries, the first known game score being from a game played in Rome in 1610.[1]. The Fried Liver Attack is classified in the Encyclopaedia of Chess Openings (ECO) with the code C57.\r\n\r\nAfter usual opening moves of the Two Knights (1.e4 e5 2.Nf3 Nc6 3.Bc4 Nf6), White goes on the offensive, the game continuing 4.Ng5 d5 5.exd5 Nxd5. This latter move gives White a strong attack and is often considered to be a mistake. (Black usually plays 5...Na5 instead; other moves are 5...Nd4 and 5...b5.) White can now get a small advantage with 6.d4 (the Lolli Attack).\r\nHowever, The Fried Liver Attack involves a far more speculative knight sacrifice on f7, with the defining moves 6.Nxf7 Kxf7\"\r\nThe above mentioned Lolli Attack often leads into a delayed version of this gambit - (Quoting from \"Openings for the Club Player by Tim Harding and Leonard Barden\" 6.... Bb4  (taking away the square c3 from the white knight) 7. c3 Be7 8.Nxf7 Kxf7, 9. Qf3  Ke6 10. Qe4 Bf8 and quotes the game Barden-Weaver Adams, which white won. Compare this with this game.\r\n",
        "9... Kxf7 10. Qf3+ Ke6 11. Qe4 Qd6": "Black already has a difficult position, the twin pins of the Bc4 on the Nd5 and the Qe4 on the e5 pawn are hard to meet. Anyone care to make a suggestion as to black's best plan?",
        "12. Bf4 a6 13. Nd2 b5 14. Bb3 Be7 15. Nf3 Bf6": "Perhaps black should try g4 at some stage to divert the Bf4?",
        "16. O-O a5": "This is too slow, now white breaks through!",
        "17. Rae1 a4 18. dxe5 Nxe5 19. Bxe5 Bxe5 20. Nxe5 Bb7": "Black is lost, but this hastens his downfall. If he is going to surrender the queen, he may as well pick off the Bb3.",
        "21. Nc4+ Kd7 22. Nxd6 Kxd6 23. Qe5+ Kc5 24. Bxd5 Bxd5 25. Qxc7+": "It is a forced mate now",
        "25... Bc6 26. Re5+ Kc4 27. Qxc6+ Kd3 28. Qd5+ Kc2 29. Re2#": ""
    },
    "url": "https://gameknot.com/annotation.pl/a-king-hunt?gm=20923",
    "gameName": "A King Hunt!",
    "players": "charleshiggie (1971) vs. A. N. Other (1295)",
    "opening": "King's pawn game (C50)"
}