{
    "moves": {
        "1. e4 c5 2. Bc4 e5 3. Nf3 Nc6 4. d3 h6 5. O-O a6": "standard faire to this point, but black should begin piece development since white already has 2 active pieces, 1 passively active piece (the bB has an open line), and is already castled.",
        "6. c3 d6 7. Qc2": "white takes the opportunity to establish a presence on one of the strong lines of the board.",
        "7... Be7 8. Be3": "activates the bB, and makes way for Nbd2 without obstructing the B.",
        "8... Nf6 9. h3 Na5 10. Bb3": "white chooses the square on which the exchange will take place. if left on c4, this cripples white's center pawn structure while isolating the e4 pawn from additional pawn support for at least a move. this creates initiative and momentum loss. allowing the exchange to take place on b3, however, allows white the option of taking with the Q or a2 pawn (opening a R lane), and both maintain center pawn structure integrity.",
        "10... b5": "seeing 11....c4 which will force a trade to diminish his center pawn structure, white is compelled to counter-attack.",
        "11. a4 Nxb3 12. Qxb3 Be6": "while this move does force white to react and give black some additional center support, the line is poor the B. better is 12....Bb7, placing it on one of the strongest lines of the board. if white chooses the pawn and a-file R exchange, white ends up control of the a-file.",
        "13. Qc2 O-O 14. Nbd2 Bd7 15. a5": "white begins to shut down the Q-side of the board.",
        "15... Be6": "again, better is 15.Bc6 for reasons already discussed.",
        "16. Ne1 d5": "black sees an opportunity to push through the middle since the e5 pawn is no longer being attacked.",
        "17. d4": "white counter-attacks. if black initiates the center exchange, white can continue to close down the center with little to no real threat from black breaking through.",
        "17... exd4 18. cxd4 c4 19. e5 Nh7 20. f4 f6": "better is 20....f5. if white takes or does not take, his position is left cramped. since 21.PxP (ep) RxP 22. f5 Bc8 ...white cannot swing his Ns over to the K-side of the board through f3 or the isolated f pawn is lost; or 21.Nef3 g5 22.PxP PxP leaves black with a 2-pawn storm on white's castled K and pieces out of position to properly defend against it.",
        "21. f5": "white declines the trade to force a passed pawn through!",
        "21... Bc8 22. e6 Bb7": "the best move for the wB, albeit a little late.",
        "23. Nef3 Qc7 24. Nh2": "better is 24.h5 ...white lost time with this move which black failed to capitalize on.",
        "24... Rac8": "black prepares to push through his own pawns on the Q-side of the board.",
        "25. Bf4 Bd6": "black mistakenly offers up his only mobil B (the Q-side dark squares offer good line placement) while allowing white to force black to lose a move's time against the Q-side pawn push by making Q recapture with his Q. better is 25....Qc6 if black intends to continue with the Q-side push.",
        "26. Bxd6 Qxd6 27. Rae1 Ng5 28. Nhf3 Ne4": "if white accepts the trade, he allows the d-pawn to advance on the e-file, but as an isolated pawn.",
        "29. Nxe4 dxe4": "white apparently deems this acceptable.",
        "30. Nh4 Qg3": "better is 30.Qc6, threatening the mating move QxPg should white lose vigilance and allow his defense of the square to slip.",
        "31. Ng6 Rfe8 32. e7 Qc7": "since the e-pawn is not going anywhere, better to keep up the pressure. better is 32....e3 33.Re2 b4",
        "33. Re3": "keeps the pawn from advancing and from black's Q from showing on the K-side of the board.",
        "33... Rxe7": "better for black, instead of trading away a R at this point, is to make room for the e-Rook to move away while covering the queening square with the B from c6.",
        "34. Nxe7+": "white gladly accepts the trade...",
        "34... Qxe7 35. Rf4 Re8": "black mistakenly thinks that white will so soon even the exchanges.",
        "36. Rg4 Kh8": "wise decision movign the K off the R line.",
        "37. Reg3 Rg8": "black's only defense at this point.",
        "38. Qe2 g6": "black is better served with 38....Bd5, which continues to protect the e-pawn, prevents the d-pawn from advancing, maintains the a8-h1 line, and provides defense against white's control of the e6 square by the pawn on f5.",
        "39. fxg6 Kg7": "best use of the K at this point.",
        "40. Rh4": "white prepares for a K-side attack",
        "40... Rh8": "black has the opportunity to regain some initiative by allowing white to play the anticipated 41.Qh5 and then mustering a defense. \r\n \r\nbetter is 40....f5 (providing pawn supprt and creating a discovered attack against white's h4 R) 41.Rf4 Rf8 42.Rf3 (taking advantage of the pinned e-pawn) Qd7 (removes the pin foring white to move the f3 R) 43.Rg3 Qd6 44.Qe3 Rf6",
        "41. Rf3 f5 42. Rhf4 Bc8 43. Rf4xf5": "now is the time for white to re-even the exchanges. this time however, white is again left with positional and initiative advantages.",
        "43... Bxf5 44. Rxf5": "black cannot play 44.... KxP since....45.Qg4+ Kh7 46.Re5 Qg7 (i believe a Q-trade is black's move at this point) 47.Qf5+ Qg6 (still offering the trade) 48.Re7+ Kg8 49.Re8+ Kh7 50.QxQ+! KxQ 51.RxR, and black is down in material and position.",
        "44... Rf8 45. Re5 Qf6 46. Rxe4 Kg8 47. Rg4 Qg7 48. Qe6+": "black cannot intercede for obvious reasons.",
        "48... Kh8 49. d5": "white stalls while giving black soemthing else to think about.",
        "49... Rf6": "this move seals black's fate.",
        "50. Qe8+ Qg8": "mate is now forced. the game is done.",
        "51. g7+ Kh7 52. Qe4+ Rg6 53. Qxg6#": ""
    },
    "url": "https://gameknot.com/annotation.pl/a-lesson-on-when-and-why-to-trade?gm=23660",
    "gameName": "a lesson on when and why to trade.",
    "players": "mistindantacles (1719) vs. rpopp (1553)",
    "opening": "Sicilian defence (B20)"
}