{
    "moves": {
        "1. Nh3 d5": "Mini-tournament, I'm playing black. White picks an interesting opening. I can't even find a name for this one except in the GK DB, the Amar (Paris) Opening.",
        "2. f3 e5": "White's wasting time, so black establishes the strong center.",
        "3. Nf2 Nc6 4. e3 Bc5 5. Bb5 Bd7": "Breaking the pin.",
        "6. Bxc6 Bxc6 7. d4 exd4": "Opening the e-file.",
        "8. exd4 Qe7+ 9. Kf1 Bb5+": "Driving the king like a leaf before the wind.",
        "10. Kg1 Bxd4": "Free pawn. White cannot recapture with 11. Qxd4??? for then black wins instantly with 11. ... Qe8#.",
        "11. Na3 Ba6 12. c3 Bb6": "White counterattacks, but it doesn't take any pressure off of the white king.",
        "13. Nc2 Nf6 14. Bg5 Ng4": "Aha! Sacrificing the queen. White cannot play 15. Bxe7??? or he will lose instantly to 15. ... Bxf2#.",
        "15. fxg4 Qxg5 16. Qe1+ Kf8 17. Nd4 Re8": "Seizing the open file with a rook, and doing so with tempo as white must now save his queen.",
        "18. Qc1 Qxc1+ 19. Rxc1 c5": "There are two knights in black's way. They must move.",
        "20. Nf3 Re2": "Rook on the 7th. Mayhem will ensue.",
        "21. Rb1 Bc4 22. b3 Ba6": "The yo-yo bishop move served to expose an attack on a2 by the black rook, as well as setting up a discovered attack to gain material.",
        "23. Ra1 Rc2": "Inviting the other knight to move.",
        "24. Nd1 c4+": "Material will be won.",
        "25. Nd4 Rxc3": "The rook sacrifice is barely even a sacrifice since black will win back all the material with interest. Suddenly the knight on d5 must be feeling all alone, with no defender, and paralyzed where he stands.",
        "26. Nxc3 Bxd4+": "Forking king and knight. After 27. Kc1 27. cxb3, 28. Ke1 Bxc3+ the new fork will be king and rook. White would be better off with 28. Ne2 Bxa1 and black is a whole rook ahead. Instead, white resigned."
    },
    "url": "https://gameknot.com/annotation.pl/a-leaf-before-the-wind?gm=22914",
    "gameName": "A Leaf before the Wind",
    "players": "lemon_twist (1414) vs. blake84120 (1848)",
    "opening": "Amar gambit (A00)"
}