{
    "moves": {
        "1. d4": "Now, much of what follows will be easy to understand, but a good deal will, I think, be challenging to more advanced players as well.  Yes, there are mistakes here, but that's only to be expected.  But this game has some surprising twists in store.",
        "1... d5 2. f4": "Unusual, but not bad.  It is one way of developing a Stonewall formation (with e3 and c3 to come).  Black throws in a distraction.",
        "2... Bg4": "OK, but the bishop can be knocked about here.",
        "3. h3 Bf5 4. g4 Be4": "Easliy repulsed.  Black has spent 3 moves - what we call tempi - on this bishop out of the 4 played.  Better would have been to bring out the knights, and having the more pieces in play.  Having said that, it's not really clear that White has made the best use of the time given him by Black.  ",
        "5. Nf3": "Although this leaves the knight pinned against the rook, it is of fairly minor inconvenience to White - hardly worth the time taken to set it up, really...",
        "5... Qd6": "The purpose of this move is unclear, as it isn't easy to see what points in White's camp are sufficiently vulnerable to justify this sortie.  Possibly ...Nf6 or ...Nc6 was called for.  On the other hand Black might have contemplated exchanging on f3.  Normally you wouldn't like that, as quite a bit of time has been invested in the bishop.  There again, White would be left with a rather messed up K-side.",
        "6. Nbd2": "Blocks the protection of the pawn at f4.  Deliberate - or an oversight?  Probably 6.Nc3 was the better choice, keeping the pawn protected, whilst still threatening to exchange N for B on e4.",
        "6... Qxf4": "(!?) It is usually very risky for the Q to grab a pawn in the opening, and so it is here, as will be discovered.\r\n",
        "7. e3": "(?!) Right idea in principle, but the pawn is lacking in protection.  Instead 7.Nxe4 Qxe4  8.e3 kept the Black Q out, and White's edge in development (activity of pieces, number of pieces in play) is roughly worth the pawn deficit.",
        "7... Qxe3+": "Obvious, and quite good.  But 7...Qg3+, displacing the White King and keeping it in the centre, was also worth a look.  Sometimes there's more than one good move in a position.",
        "8. Be2 e6": "(?) Now this mistake turns out to be very serious.  An alert Black would be getting pretty concerned about what squares are available to his Queen, especially as the happens to be a White bishop staring down the diagonal that is the Queen's only escape route (c1-h6).  Probably  ...Bg6 is already indicated, to allow the Queen to retire down the e-file if required.  Black's early raids have netted two pawns.  The trick is to elude the constabulary and make off with the loot.",
        "9. Nxe4": "(!!)  Well chosen, White!  A very fine move.  In the circumstances, one might have chosen instead to unmask the battery by 9.Nc4(?)  or 9.Nb3 (?!) winning the Queen!  But the situation is not quite so simple.  After 9.Nb3, Black can bravely contain the damage by 9...Bxf3!  10.Bxe3 Bxh1.  With Rook, Knight and 2 Pawns Black will have gained more in value than the Queen lost.  It has to be admitted that White's more active pieces will keep him well in the game.  However, with the move played, White stands to gain more. Much more...",
        "9... Qxe4 10. Ng5": "Right notion, but an oversight in the execution, forgetting that the knight was pinned against the rook.  Now, here's a thing that happens a lot in this game.  Both sides are trying to play chess.  This isn't random stuff.  But in planning ahead (White is after that importunate Queen), both sides are apt to forget about what is happening immediately.  This knight move uncovers the vulnerable Rook at h1.  Note that White didn't try the desirable 10.Bd3 as it was an illegal move (the bishop is pinned against the King)!  The right move was 10.0-0! which kept alive both threats (Bd3 and Ng5) by unpinning both pieces at once.  So: 10.0-0 Qg6  11.Ne5 Qf6 (cutting his losses) 12.Rxf6 winning Queen for Rook.",
        "10... Qxh1+": "After this, Black is 'winning'.  Now, in fact he doesn't win.  So how could this move be 'winning'?  The reason is that from here, with reasonable (note that I don't say 'best') play, Black should win comfortably.  But we all know that slippery gag about the cup and the lip, don't we?  The game see-saws violently over the remainder of its course.",
        "11. Kd2": "OK, but 11.Bf1 was probably a better defence.  See next note.",
        "11... Qg2": "Again OK, in that it doesn't hurt Black's advantage, but now was an excellent moment to exchange Queens.  Why?  At this point, Black is a clear Rook and 2 Pawns ahead - a massive advantage.  Exchanging Queens would have considerably reduced the material in the board, whilst at the same time preserving Black's leading margin.  This reduction in material is called 'simplifying', a notion well worth bearing in mind.  In relative terms, this margin will have increased in value.  Not only that, it means White would have had no Queen with which to come up with some sort of counter-attack.  Not that the lack of a Queen was to deprive Black of chances later in the game...",
        "12. Qf1": "(?) Really, in view of what we have learned from my previous note, White ought not to have offered the Queen exchange, here...",
        "12... Qe4": "(??) ...and Black ought to have grabbed the opportunity with both hands.  He must  simply have forgotten about the knight on g5, but he certainly overlooked the sudden accumulation of pressure against f7.  There's some amazing things lurking in this position!",
        "13. Nxe4": "(?) So obvious, White probably didn't think twice about it.  But it's not the best - not even close!  After this White gets a useful, but moderate advantage.  Instead, he could have turned the tables more completely by 13.Qxf7+!! Kd8  14.Qxf8+!! ... (14.Nxe6 forces Black to give up the queen, but the resulting material advantage to White amounts to about 1 pawn's equivalent.  He can do better than that!)  14...Kd7   15.Nxe4 dxe4  16.Qxg7+ and the massacre isn't over just yet!",
        "13... Bb4+": "(?)  It is always useful to look around for 'in-between' moves like this (zwischenzug) , but here it merely means that Black isn't going to get the knight back after all.  13...dxe4 had to be played.  ",
        "14. Kd1": "(?) Both interpositions (14.c3 and 14.Nc3) were better.  The latter would have preserved the e4-knight.",
        "14... dxe4 15. Bb5+ Nd7": "(??) Here 15...c6 would have caused the bishop to relocate, leaving Black with a solid position.  Note that 15...Nc6? wasn't much chop, as 16.Bxc6+ bxc6 would have disrupted and weakened Black's Q-side (17.Qc4!).  In avoiding that, though, Black may have incurred worse...",
        "16. Qf4": "(!?) Instead 16.Bxd7+! Kxd7  17.Qb5+ would have forked King and the Bishop at b4.  You'd be surprised how often these little two-move sequences resulting in a destructive fork crop up in chess play.  This isn't the first we have seen in this game...",
        "16... a6": "(?) Allowing the exchange on d7 after all.  But at least Qb5+ won't be an option...",
        "17. Bxd7+": "(!) The right move, exchanging and decoying the King away from f7.",
        "17... Kxd7 18. Qxf7+": "(!) 18.Qb5+ is now unavailable, but this is not a bad alternative!",
        "18... Ne7": "(!) Relatively best.  Any King move and he gets hunted down.  Here's a possible continuation;  18...Kd6 19.Bf4+ Kd5  20.Qxc7 and mate can't be far off: 20...Nf6 (say) 21.c4+ Kxd4  22.Ke2 (to make way for the a1-rook and to cover the d3-square) 22...e3 23.Qe5+ Kxc4  24.b3#",
        "19. Bg5": "(??) This overlooks a very nasty response that should have turned the tables in favour of Black...",
        "19... Rhf8": "(!!) A fine riposte that wins the White rook on a1.  This is a rather unusual, though not uncommon, type of skewer.  Now, skewers generally occur in which an attacked piece is forced to move aside and uncover a weaker, undefended piece to be taken. Sort of a 'pin reversed'.  But here it is a vulnerable square that gets uncovered: f1.",
        "20. Qxg7 e3": "(?) Not realising the power of his previous move.  With 20...Rf1+, Black would have set up a second 'skewer', forcing the King to uncover his defenceless Rook on a1: 20...Rf1+ 21.Ke2 Rxa1, after which Black would have had slightly the better of it.",
        "21. a3 Rf2": "(?)  Black is playing aggressively, which is exactly what is called for in the circumstances.  But he needs to be more alert to what the enemy is doing.  Although less effective than a move earlier, 21...Rf1+ was still the best Black had, to stay in the game.  But after 21...Rf1+ 22.Ke2 Rxa1 23.axb4 Re8 24.Qxh7 Black would still have been in trouble.",
        "22. Ra2": "(??)  Panic??  White must have overestimated Black's chances.  Both 22.Bxe3 and 23.axb4 would have kept White on top.  Now Black wins very quickly...",
        "22... Raf8": "(?) Developing - but Black had a quick kill - mate in two, in fact:  22...e2+  23.Kc1 e1=R# (In these circumstances, I like to underpromote to mate; of course e1=Q is as much #)",
        "23. axb4": "(!) Correct.  Black has no longer a mate.  Has he a sufficient attack?  It ain't game over yet!",
        "23... e2+": "(?!) a spirited try, but too late.  Better was ...R8f7, to free up the Knight, pinned on on e7.",
        "24. Ke1": "(?!) This looks OK, but it offers Black just one tempo (based on the possibility of ...Rf1+) with which to mount a counter-attack.  See next note.  Better was 24.Kd2.",
        "24... Rf8f3": "(??) A tragedy, just when the game might have been salvageable.  The idea is right, but (as so often), overlooks an immediately lethal response.  With 24...Rf8f7 25.Qh8 Rf7f3!, White no longer can take the Knight with the Queen.  The game might have continued:  26.Bh4 Rg2(!) 27.Kd2 e1=Q+(!)  28.Kxe1 Rxh3  29.Bf2 ... (essential, as Black is threatening Ra1#)  29....Rf3(!!).  Material down, Black would have conjured up enough counterplay to give him realistic prospects of forcing a draw.  Try these bishop moves: 30.Bh4 Rh3; 30.Bg3 Rfxg3; 30.Be3 Rxe3+ 31.Kf1 Reg3; 30.Bg1 Rxg1+ 31.Ke2 Rfg3, etc.",
        "25. Qxe7+": "Deadly.",
        "25... Kc6 26. Qxe6+ Kb5 27. Qd5+ Kxb4 28. c3+": "(?!) So far, so forced.  Now instead, 28.Bd2+ would have finished the game at move 30.",
        "28... Rxc3 29. bxc3+ Kxc3 30. Qc5+ Kb3": "A fine forced mate to finish.  Very much a game of ups and downs.  Both sides were playing to ideas, but both overlooked short range tactical shots that might well have led to an earlier result to either side.",
        "31. Ra3+ Kb2 32. Qb4+ Kc2 33. Qb3#": ""
    },
    "url": "https://gameknot.com/annotation.pl/a-lesson-for-beginners?gm=33583",
    "gameName": "A lesson for beginners",
    "players": "mrmattbro (883) vs. woutstra (729)",
    "opening": "Queen's pawn game (D00)"
}