{
    "moves": {
        "1. d4 d5 2. Bf4": "This move has nothing special in it. It will be played in many lines. The concept, though, is not to push c4 (which black knows and expects), but to build a quick kingside attack. Let's see how. ",
        "2... Bf5": "A good move. Black can mimic white for a while, but I know exactly where he can't go on doing that. ",
        "3. Nf3 e6": "No mimic, whew! Much better for a nice game. ",
        "4. Nbd2": "A consecuence of the previous opening concept. Now, if black goes Bb4, c3 and that's all. Almost. ",
        "4... Nf6": "Normal and good. But black should be thinking hard in c5, his only chanche to activate his game. It is not evident, this is told by experience. ",
        "5. h3": "White assures an escape square for the dsb, avoids ideas of a piece in g4 for black, and prepares the planned g4. ",
        "5... Bd6": "Normal and good, black activates his pieces and forces white to react, which he does confidently with...",
        "6. Ne5": "This knight is very strong and black can't rid off it so easily. I know most of the ways, and I know how to react to them (of course, this won't pass a game against a strong player! :-)",
        "6... O-O": "Black castles, but he will better develop, with Nd7. If c5, e3, Nd7, white can surprise black with Nxf7 (RxN, BxB). So you can see black has already to play very defensively and unconfortably. ",
        "7. g4": "I'm not worried about Be4, I'll exchange it for my Nd2, with thanks. ",
        "7... Bg6": "\"To counter a pawn's storm with naked piece is not a good idea\". Pawns can be very sneaky, since they can eat everyting without fear to die, if it is for a good cause. ",
        "8. e3": "Necessary to be ready to bring the Q on, once the pieces are rejected. NxB is not really bad, but the game loses tension, and white will have to start thinking about the f column, so I don't like it. ",
        "8... Bxe5": "Doing something. Not bad, but foreseen. White's answer will be...",
        "9. dxe5": "Uh? Yes. It blocks my dsb in, right, but those pawns are very, very unconfortable for black. The N would like to go to...",
        "9... Ne4": "...and if I exchange it, QxQ and the game loses tension, becoming a long and technic endgame. I prefer...",
        "10. h4": "Very important, to prevent Qh4, which is not deadly, but stops my pawn's storm (if Bg3?, NxB. If white goes NxN first, it seems better, finally black will lose the lsb, catched by f3 and h5, in different order. Black has almost lost a piece. ",
        "10... h6": "...but he finds the only one. Look: I am forcing him to move his castle pawns. Good sign. ",
        "11. g5": "Normally, this move can't be done, because after h5, black is shielded. But in this position, I'll play Be2, and this will threat Bxh5, with no possible defence by black. ",
        "11... hxg5": "A mistake. Black loses a tempo, exchanging. The alternative (h5, and losing the pawn after Be2-Bxh5) was still preferable. It gives needed tempos for developement. ",
        "12. hxg5": "I know I will lose the pawn, but that is what a pawn's storm is for. Now I have a semi open column to work with. The only problem is how to get the Q to h. ",
        "12... Nc6": "NxN would have been fine. Far from the white squares, the WQ loses steam. ",
        "13. Nxe4": "If dxN, Qg4, a step from h4. ",
        "13... Bxe4": "I can't lose the rook or I'll lose the column, and I can't block it with the natural f3, since I will delay my Q's journey to h. A tempo can be all. ",
        "14. Rh2": "Black's lsb looks magnificent, but it isn't at all. By f3 and Qh5, white would have won right away. The threat is Qh5, and black must try to do something about it...",
        "14... Qe7": "...which he doesn't. g6 was a try, so I would have gone Qg4, to h4...",
        "15. Qh5 f5": "Giving the K an escape route. I have to be very careful about these escape routes, because I've lost soundly by swearing all was done. ",
        "16. g6": "This simple, elegant move solves the problem. Black, despite all its pieces and an otherwise \"almost good\" position, is lost. As you see, no evident \"sound blunder\", but against the London a few inaccuracies or passivity turns into disaster for black. Of course, I will lose games against better than me, with this same idea, so it is not so good as it seems in this game. But the equality's way it's not easy for black to find. Hope you enjoyed, thanks for comments and corrections. "
    },
    "url": "https://gameknot.com/annotation.pl/a-london-miniature?gm=56365",
    "gameName": "A London miniature",
    "players": "damalfi  vs. blitzplayer ",
    "opening": "Queen's pawn, Mason variation (D00)"
}