{
    "moves": {
        "1. d4": "  This is an enjoyable game in a mini- tourament.  An opening I don't have much experince against-Queen's pawn game.",
        "1... d5 2. c4": "Queens Gambit",
        "2... e5": "I decided not to take it and do a counter gambit",
        "3. dxe5 d4": "Do I take c4? I think not. 3. ... dxc4, 4.Qxd1,Kxd1 and my king can't castle so I decide to push to d4.",
        "4. e3 Bb4+": "I nearly went Nc6 here but decided to attack his king instead.",
        "5. Bd2 dxe3": "3 choices here, Nc6. Bxd2 or dxe3.  I go with the latter. 3 pieces now attacking his bishop, Queen, bishop and pawn. ",
        "6. Qa4+": "White counters. check and also attacking my bishop.",
        "6... Nc6": "Only move for me to save my bishop and blocking check.",
        "7. Bxb4": "White decides to take the bishop. ",
        "7... exf2+": "white took the bishop in exchange for losing good king position.",
        "8. Kxf2 Qh4+": " A couple of white pawns are unprotected ( e5 and b2) so out comes my Queen.",
        "9. g3 Qd4+": "Black loses a pawn or 2 .",
        "10. Kg2": "I feel this is a mistake by white. It gives me a free move with my Queen by delivering another check.",
        "10... Qxb2+": "In turn white losing a rook too.",
        "11. Ne2 Qxa1": "Also attacking his knight. I do need to be careful, that Queen looks cramped.",
        "12. Nbc3": "abus naturally moves that knight in the process blocking my Queens way to e5.",
        "12... Bd7": "My Queen needs some support and my knight needs freeing up. also preparing to castle. Bd7 attacks his Queen too.",
        "13. Ba3": "White retreats his bishop knowing my knight is now free to move. My concern now was the amount of limited squares available to my Queen, 2. a1 where she was and e1.",
        "13... Qe1": "I move her to e1. More scope there , not much though . Maybe a wasted move as queens can be exchanged at eiher square if white moves Qd1.",
        "14. Qd1": "abus makes that move.",
        "14... Qxd1 15. Nxd1": "exchange",
        "15... O-O-O": "Was Nxe5 better? O-O-O brings my rook to an open file when I move my bishop. I'm looking at putting my bishop on the long diagonal c6-h1.",
        "16. Nf2 Nxe5 17. Nf4 Bc6+": "also releasing my rook up the d file.",
        "18. Nd5 Nf6": "Pressure on his knight and uniting my rooks.",
        "19. Rg1 Bxd5+ 20. cxd5 Rxd5": "I win a pawn and prepare to double up my rooks.",
        "21. Bb2 Rhd8 22. Bc3": "white protects d2.",
        "22... Neg4": "attacking his knight looking for an exchange and having a knight at g4.",
        "23. Nxg4 Nxg4": "exchange made.",
        "24. Be2": "bishop attacks knight in turn releasing his rook along the back.",
        "24... Ne3+ 25. Kf3 Nf5": "the knight retreats.",
        "26. g4": "white attacks my knight.",
        "26... Ne7": "Nd4+ may have been better looking to exchange either bishop for my knight. I lose a pawn now because of that slip. ",
        "27. Bxg7 Nc6": "I reposition my knight. ",
        "28. Bc4": "White attacks both my rook and f pawn.",
        "28... Ne5+": "So I look for a bishop - knight exchange   knowing if white dare take the f pawn I can pin that bishop with Rf1.",
        "29. Bxe5 Rxe5 30. Bxf7": "I can't beleive he made that move.",
        "30... Rf8": "pinned!",
        "31. Kf4 Re7": "White resigns after unable to save his bishop and being 6 down. An enjoyable game."
    },
    "url": "https://gameknot.com/annotation.pl/a-long-came-abus?gm=22950",
    "gameName": "A long came abus",
    "players": "abus (1641) vs. wanred (1523)",
    "opening": "QGD (D08), Albin counter-gambit, Lasker trap"
}