{
    "moves": {
        "1. c4": "This open challenge turned into a tough battle. Although Alexkhine was 100 points south of my rating at the start it was pretty evenly matched. I made a few blunders however I got lucky at the end.",
        "1... g6": "I'm doing a little experimentation with the English opening at the moment to make a change from my more usual efforts",
        "2. Nc3 Bg7 3. d4 Nf6 4. e4": "Going for central control, the disadvantage for white here is that only one peice is developed where as black is already able to castle",
        "4... d6 5. f3": "I'm not entirely sure how sound this move is, my intention was to prevent something like Bg4",
        "5... O-O 6. Nge2 Nbd7": "supports e5 but blocks in the white lsb which doesn't move for the whole game",
        "7. Nf4": "This is where we depart the Gameknot database, it seems clear now that it was a mistake, Ng3 was better",
        "7... e5 8. Nfe2 c6 9. d5": "This is probably rather premature, I was looking to open the c file",
        "9... c5": "Black chooses to close the centre, If I were him I would have opened it as the black king is safe but the white one is going to take a few moves to get to safety",
        "10. Ng3": "better late than never I guess",
        "10... a6 11. Bd3": "My plan was to castle then to push the pawns on the queenside",
        "11... b6 12. Rb1": "This may also be premature however I felt my king was relatively safe for the moment",
        "12... Rb8 13. Be3 h6": "I'm not sure what this achieves apart from weakening the black king slightly",
        "14. O-O h5": "This makes blacks previous move even more of a mystery to me, why not 13 ... h5?",
        "15. f4": "This is a very poor move, I hadn't realised at the time quite how important the g5 square would be and I have now left a hole there",
        "15... Ng4": "And black takes full advantage",
        "16. Be2": "This is a complete blunder that loses a rook as we will see",
        "16... Nxe3 17. Qd2 Nxf1 18. Rxf1": "I took with the rook rather than anything else so that it could help defend my king and the f pawn",
        "18... Bh6 19. a3 Nf6 20. Rf3": "At this point I realised how much of a mess my peices were in and decided to juggle them around. I was hoping to get the rook to h3 or g3",
        "20... Ng4 21. Nf1": "This is a key move for me, it frees some room for my rook and defends the h2 pawn",
        "21... Qh4 22. Bd1": "The pressure is growing around my king and I am starting to worry. This move was partly so that my queen could look after the g pawn and the h pawn if I moved the g one. I am however also looking to get my queen out of the pin without compromising my defence. Note that the black queen is threatening both Qxh2 and Qf2, however at the moment I have enough defence on both h2 and f2. What I don't have much defence against is Bxf4",
        "22... f5": "Black is looking to open the f file for his rook and to push my rook away, however with this move he also keeps his lsb out of any action. Bxf4 looks better",
        "23. Qc2": "finally releasing the pin but at what cost?",
        "23... fxe4": "This is another key move as it allows me to open the b1-h7 diagonal for my queen. If I can get Qxg6 I may be able to get some counter play.",
        "24. Nxe4": "threatening Nxd6 which combined with Qxg6 might allow me to make some threats of my own. Note that Qxe4 here would remove some of the defence of the pawns in front of my king, It seems risky to do that unless I can make some direct threats at the same time",
        "24... Bxf4": "The pressure on my h pawn mounts further but what to do? I didn't like the look of Rh3 due to Qe1 threatening Be3+ I also didn't want to disturb my pawns too much with g3",
        "25. Neg3": "In the end I decided on this for a number of reasons, it reinforces my knight on f1, it restricts the black queen's movement and it opens a line for my queen to g6",
        "25... Bxg3": "Although this move looks appealing it is a mistake as it has opened the f file for my rook. Blacks rooks are not linked as he hasn't moved his lsb, this allows me to threaten mate",
        "26. Qxg6+": "Black resigned due to Kh1, Rxf8#.\n\nFor me this was a very enjoyable and tough battle, a few mistakes on either side and the games fortunes swung around quickly as a result.\n\nPlease feel free to comment"
    },
    "url": "https://gameknot.com/annotation.pl/a-lucky-escape?gm=33669",
    "gameName": "A lucky escape",
    "players": "elwoos (1562) vs. alexkhine (1439)",
    "opening": "English opening (A10)"
}