{
    "moves": {
        "1. e4": "Another game from a mini-tournament dedicated to the Sicilian defense. During this game (playing with the black pieces), I alternately thought I might loose, draw or win, and finally I've won the game. Feel free to correct my annotations, as I always miss a lot of good moves for both sides and I dont use a computer for the analysis. Nevertheless I hope that these annotations might be interesting especially for lower rated players.",
        "1... c5": "I won't tell you more about the opening, there are a lot of books on it and I'm still trying to understand it myself.",
        "2. Nf3": "I'll rather focuse my commentaries on the second half of this game.",
        "2... e6": "Anyway, this time I wanted to try 2. ...e6.",
        "3. d4 cxd4 4. Nxd4 Nf6 5. f3": "My opposant does not want to play 5. Nc3 because he plans 6. c4. This came as a surprise for me and I was immediately out of the book.",
        "5... d6 6. c4 Nc6": "I just try to develop my pieces.",
        "7. Be3 Be7 8. Nc3 O-O 9. Be2 a6 10. O-O Qc7 11. a3 Ne5 12. b3 Rd8": "My only \"plan\" behind these moves: My rook opposite to white's queen in case the d-file might open.",
        "13. f4 Nc6 14. b4 Bd7 15. h3": "Now I see a chance to exploit this disposition.",
        "15... Nxd4 16. Bxd4 e5 17. fxe5 dxe5 18. Be3": "Winning the pawn on h3.",
        "18... Bxh3 19. Qb3": "Only to find out that white's center is very strong and white will soon have a supported passed pawn that will largely compensate the fact that he's one pawn down.",
        "19... Bg4": "I decide to trade my white-squared bishop.",
        "20. Bf3": "White does not want to give me the tempo after 20. Bxg4 Nxg4 threatening his bishop on e3.",
        "20... Bxf3 21. gxf3": "White does not take with the rook because he plans Nd5 and then the pawn on e4 would be unprotected. But now the white king has a rather airy position. Two moves before, 19.Qc2 (instead of Qb3) might have solved this problem, but white certainly wanted to aim his queen against black's king.",
        "21... Qc8": "21. ...Rd3 fails to 22. Nd5 threatening the queen. My move to c8 allows to transpose the queen to white's kingside. ",
        "22. Nd5": "Well, this knight seems too strong to me and I trade it immediately.",
        "22... Nxd5 23. cxd5": "Now white has a supported passed pawn and at this moment, I fear to loose the game. ",
        "23... Qh3": "My only chance is a kingside attack.",
        "24. Bc5": "Hoping for 24. ... Bx5, 25. bxc5 which would be very good for white. ",
        "24... Qg3+": "But now I have the perpetual and I decide to draw the game.",
        "25. Kh1": "One move later, I already want more than a draw. My bishop should go to f4 and there is the idea: ...b6, Bxb6 ...Rd6 threatening the bishop and winning a tempo for the kingside attack (...Rg6). As usual, I'm too lazy to calculate and I confide in my intuition (which is very BAD - not to calculate, I mean).",
        "25... Bg5 26. Ra2": "Of course, this move is necessary to defend the king's position. 26. Rg1? - Qh3#",
        "26... Bf4 27. Rg2 Qh3+ 28. Kg1": "Of course, 28, Rh2 is not possible - Qxh2#.",
        "28... b6": "In the meantime, I began to realize that white is not at all forced to accept the pawn sacrifice. I guess that 27. Be3 would have saved the game for white, forcing the trade of the bishops and stopping black's kingside attack. Then, it would not be easy to defend against white's following pawn roll-up in the center. I try b6 anyway.",
        "29. Bxb6": "In my opinion, this move looses the game.",
        "29... Rd6": "Now it's too late for 30. Be3, because after ...Rg6, 31. Bxf4 fails to ...Qxg2# (and 31.Rxg6 fails to ...Qh2#).",
        "30. Bc5 Rg6": "White resigned. 31. Rff2 is followed by Qh2  (the queen cannot be taken because the rook on g2 is pinned), 32. Kf1 and after ...Qh1 , both 33. Ke2 or 33. Rg1 looses the rook. A lucky win!\nHope you enjoyed it a little. Good bye!\n"
    },
    "url": "https://gameknot.com/annotation.pl/a-lucky-win?gm=7502",
    "gameName": "A lucky win!",
    "players": "hypertroll (1641) vs. mirela22 (1693)",
    "opening": "Sicilian (B40), Anderssen variation"
}