{
    "moves": {
        "1. d4": "Hi everyone! I am playing against dmaestro in this game - do not be fooled by that low rating by his name, but remember, his optimum rating is 1730 so he is not to be underestimated.  He played very well right up until the end and a slip up cost him two pawns.  There was an interesting material imbalance.  Dmaestro had a rook + pawn against B + Knight.  Here is how the drama unfolds.  Firstly dmaestro kicks off with d4 and I decide to experiment with the Englund gambit with e5.",
        "1... e5 2. dxe5 Nc6": "2. ...... Nc6 - development.",
        "3. Nf3 Qe7 4. e4 Nxe5": "4. ........ Nxe5 - I win back my pawn.",
        "5. Be2 Nf6 6. O-O Nxf3+ 7. Bxf3": "7. Bxf3 - a knight trade.",
        "7... d6 8. Re1 Be6": "8........ Be6 - Fou Leblanc emerges.",
        "9. Nc3 Qd8 10. e5 dxe5 11. Qxd8+ Rxd8": "11. ........ Rxd8 - a queen trade but now I lose the pawn on b7.",
        "12. Bxb7 Nd7": "12. ....... Nd7 - to protect my e5 pawn.",
        "13. Bc6 Bd6": "13. ....... Bd6 - now Fou Lenoir develops, quick development is essential with my queenside pawn structure badly busted.",
        "14. Be3 a5 15. Nb5 O-O": "15. ......... 0-0 I decide to move Henry out of the pin and connect my rooks.",
        "16. Nxd6 cxd6": "16. ...... cxd6 - Fou Lenoir disappears from the board and so does a white horsie.  My queenside pawns are connected.",
        "17. Rad1 Nf6 18. Bb6 Rdb8 19. Bxa5": "19. Bxa5 - my a pawn disappears but I take the chance to grab a pawn on b2 and it is now dmaestro's turn to have his neat queenside pawn structure busted!",
        "19... Rxb2 20. Rxd6 Rxa2 21. Bc3 Rxc2": "21. ....... Rxd2 - now all the queenside pawns have vanished!",
        "22. Bxe5 Ne8 23. Be4 Rc5": "23. ..... Rc5 - attacks white's dsb.",
        "24. Rd8 Rxe5 25. Bxh7+ Kxh7 26. Rxe5 Kg8": "26. ...... Kg8 - well here is the material imbalance I talked about earlier.  The game ought to be drawn but strange things can happen.",
        "27. Rb5 Nf6 28. Rd4 Rc8": "28. ........ Rc8 - threatening # in 2 on the back rank.  Dmaestro avoids this by playing f3.",
        "29. f3 Kf8 30. g4": "30. g4 - pawn roll.",
        "30... Ng8 31. Kg2 Re8 32. Kg3 Ne7": "32. ........ Ne7 - for the next few moves there is a lot of manoeuvering but basically it is a case of Operation Joblock, this hedgehog defence can sometimes be very effective against opponents who overreach themselves and find themselves mightily spiked!",
        "33. f4 g6 34. Rc5 Rb8": "34. ...... Rb8 - while seemingly aimlessly moving my pieces around I am keeping an eye on the square f5 - if that g pawn moves and dmaestro's king stays where he is there is a peach of a knight fork on that square.",
        "35. Rc3 Rb3 36. Rd8+ Kg7 37. Rxb3 Bxb3": "37. ....... Bxb3 - rook trade.",
        "38. h4": "38. h4 - an imposing wall of pawns but appearances can be deceptive.",
        "38... Ng8 39. g5 Be6 40. Re8 Bf5": "40. ...... Bf5 - maintaining the Joblock.",
        "41. h5 gxh5 42. Kh4 Bg4": "42. ....... Bg4 - Fou Leblanc could go to g6 but that is way too passive.  Remember I am trying to cure myself of passivitis - well the best medicine here is to move Fou Leblanc to g4 as the pawn on h5 and Fou Leblanc protect each other.",
        "43. Re5 Kf8": "43. ...... Kf8 - still non-committal but now dmaestro over-reaches himself.......",
        "44. f5 Ne7": "44. ..... Ne7 - and with this move he gets duly spiked, the f5 pawn will be lost.  Dmaestro now waves the white flag.  A good start to my weekend."
    },
    "url": "https://gameknot.com/annotation.pl/a-material-imbalance-and-a-victory-for-jo?gm=22907",
    "gameName": "A Material Imbalance and a Victory for Jo!",
    "players": "dmaestro (1468) vs. jstevens1 (1769)",
    "opening": "Queen's pawn (A40), Englund gambit"
}