{
    "moves": {
        "1. d4 d5 2. Bf4 Bf5 3. Nf3 Nd7 4. h3 h6 5. g4 Be4 6. Nbd2 e6 7. e3 f5": "Interesting, well known but not much played, for a reason. ",
        "8. gxf5 exf5 9. h4": "or Rg1 at once. It is intended to prevent g5. ",
        "9... Ngf6": "This deprives white's queen of the h5 square. Avoiding g5 had this price. ",
        "10. Rg1": "Freeing my knight from the pin, and eyeing g7.",
        "10... Ng4 11. Bh3": "This black pieces are less dangerous then it seems, and I keep on threatening things. Now, of course, black has the edge, and after h5 clamps me very badly... but so does himself. It would be another game. ",
        "11... Bd6": "This black bishop is one of my best pieces, but true is that actually it is not doing much. ",
        "12. Bxd6 cxd6": "A doubled central pawn, maybe not good for me. ",
        "13. Bxg4": "...but now I can cash my pawn. Too bad I lose my second bishop. ",
        "13... fxg4 14. Rxg4 Qf6": "I want to jump with the knight with a plan, not just taking it off there. ",
        "15. Rf4 Qg6 16. Rc1": "I mantain it was better than NxB. Qg1+ looks ugly. ",
        "16... O-O-O": "This gives me an idea. But I saw it late, after I moved...",
        "17. Ke2": "I thought that after Qg1 I would have ran out of the pressure. THis kind of strange defence can work, sometimes, but I overlooked the obvious...",
        "17... Rdf8": "No choice. h5, Qxh5, Rh4 doesn't look appealing. ",
        "18. Rxf8+ Rxf8 19. c4 Bxf3+": "Ok, this was acceptable. ",
        "20. Nxf3 Qg4": "I saw this, and my defence is...",
        "21. cxd5+ Kb8 22. Qh1": "Ugly, but it somehow stops the inmediate threats. Now black has to find a way to break in. ",
        "22... Nf6 23. Rg1 Qh5 24. Rxg7 Nxd5": "This knight, in this square, is well far from threatening mine, so...",
        "25. Rd7": "I started a ball, here, shocked that I wasn't mated yet. ",
        "25... Nf6 26. Rxd6 Ne4": "Not even this worries me... can it be possible?",
        "27. Re6 Qg4 28. Rxh6": "My defence holds, against all odds, and my rook is free to fly here and there. ",
        "28... Nd2": "A good attempt, white, but...",
        "29. Kxd2 Rxf3": "A mate is in sight for white, but, very, very surprisingly...",
        "30. Qh2+": "White wins (or gets an overwhelming advantage). ",
        "30... Kc8": "Only move. ",
        "31. Rh8+": "What's the game? It will be back and forth. ",
        "31... Kd7 32. Rh7+": "...and here, white has drawn game, since black can't affort to move the king away from squares d7 or c8, or it will be mated. Don't believe me?",
        "32... Kc6": "If Ke6, Qe5#. If K in the 8 row, other than c8, Qb8#.",
        "33. Qc7+ Kb5 34. Qxb7+ Kc4 35. b3#": "Poor black. It was hard to foresee!"
    },
    "url": "https://gameknot.com/annotation.pl/a-mate-from-nowhere?gm=52967",
    "gameName": "A mate from nowhere",
    "players": "damalfi  vs. idiosyncracy ",
    "opening": "Queen's pawn, Mason variation (D00)"
}