{
    "moves": {
        "1. e4 d5 2. exd5 Nf6 3. c4": "One of the weakest answers, since it blocks lsb's action.",
        "3... e6 4. dxe6 Bxe6": "The basic Icelandic asset. ",
        "5. d4": "Another thematic second-best move. My opp. is testing my knowledges.",
        "5... Bb4+ 6. Nc3 Ne4": "...or Qe7. White will lose his d4 pawn or the exchange.",
        "7. Bd2 Qxd4": "White must defend f2.",
        "8. Nxe4": "Qe7 is another playable move here. My answer is forced: Qxb2 is just ugly.",
        "8... Qxe4+ 9. Qe2": "Here, the only thing I'll get would be his K exposed while I will be able to castle. But is more than nothing, with a stronger opponent! But it is true that, looking closely, now ...BxB+, 10. KxB, Qd4+, threatening b2, may whorth a look. ",
        "9... Qxe2+ 10. Bxe2": "Now it comes the problem: how to continue? Do I grab the centered K advantage? I decide yes, but Nc6 can be interesting, in view of 11. Bf3? (BxB+, KxB, Nd4+, exchanging the Wlsb). But he won't have fallen for it. ",
        "10... Bxd2+ 11. Kxd2": "Now what? o-o is probably right, but I wanted to be sure he won't grab so much space and action with his lsb, so I dared to play...",
        "11... c5": "...weakening b7. Now, if Bf3, Nc6, and I'll accept gladly the doubled pawns keeping the only lsb on the board. Was it a good decision?",
        "12. Nf3": "He apparently didn't see too much advantage in grabbing the diagonal, and, very \"old-schoolisly\", developed. ",
        "12... Nc6": "Now, I want to win a tempo by castling Qside and chech him. But h6 should be on my agenda.",
        "13. a3": "He, righly, protects my N's possible entryon b4. This allows me to play Na5, threatening the fork check on b2. I missed it, unfortunately. ",
        "13... O-O-O+ 14. Kc3 Rhe8": "...but now I set another treat, and I get a wonderful center occupation. ",
        "15. Bd3": "If white plays b4, I'd play Bh3. Either bxB, RxB, or Bf1 (otherwise, Bxb2 forks N and R), and I can retire the B where I like to. He is threatening h7 here, but it is doubtful he can release the B after g6, in the long run. ",
        "15... Bg4": "The idea is that if Bxh7, BxN and after g6 the B is trapped. Not so simple, though...",
        "16. Ng5": "Ouch!",
        "16... Ne5": "Protects f7, threats the B, \"forcing\"...",
        "17. Bxh7 g6": "Now, white will lose a piece, after f6... doesn't he?",
        "18. f3": "The problem here is that after my B retires, f4 and my N has to go, and f7 falls. If I defend it with Be6, NxB and, again, f4 saves the material for him. I had two choices here: Bf5 (g4, Bd3!?), or...",
        "18... Rd3+ 19. Kc2": "Now, I can save the B in f5, threatening a discovered check. But... g4, and I am committed to play double check or get out the lsb from the game. But... can I get something more from the position?",
        "19... Red8": "If fxB, I can sense a victory due to the checks and the N's future Nxc4, pressing b2 with the R. ",
        "20. Rad1": "I was right! My opponent didn't fell for it, which is very good!",
        "20... Bf5": "Now it is a different story: if g4, RxR+ and I'll win two R for a B. ",
        "21. Rxd3": "My....! Which piece to retake with is correct???? Which I am not seeing now is that the plan g4 can't be let unattended, since after gxB white can even try to crown the pawn...",
        "21... Nxd3": "Not sure!! Both Bxd3+ or Rxd3 has his ups and downs! Now, obviously...",
        "22. g4": "And here the great decision: to win the exchange (N2+, gxB, NxR), or try something very tactic with Ne1++!?  Now I can see it better... it was Kb3 the only one (or mate), Bc2+, Ka2, Rd1 and I think white is busted!",
        "22... Nf2+": "? Wrong decision. ",
        "23. gxf5 Nxh1 24. Nxf7": "! Now if I move the R, g7 and I'll lose it for the pawn!!!!",
        "24... gxf5": "Only way to get on, losing right away the exchange won, and getting a lost position. My N will be trapped, can you see it? I can't do anything. ",
        "25. Bxf5+ Kc7 26. Nxd8 Kxd8 27. Kd2": "The rest is useless... thanks for reading!",
        "27... Ke7 28. Ke2 Kf6 29. Be4": ""
    },
    "url": "https://gameknot.com/annotation.pl/a-missed-high-victory?gm=63213",
    "gameName": "A missed high-victory?",
    "players": "sunit_v_joshi (1624) vs. damafi (1490)",
    "opening": "Scandinavian (B01), Icelandic gambit"
}