{
    "moves": {
        "1. e4 d6": "My standard black response. ",
        "2. Nc3 Nf6": "in my opening, I consider this and 2...c6 interchangable, one happens and the other follows immediatly, I have no preference of which goes first",
        "3. Bc4": "surprisingly, I don't see this a lot while playing this",
        "3... c6": "so far his attack is geared at d4, I think I'd like to throw that off a little bit, and c6 is already a basic move for my game",
        "4. Nge2": "??",
        "4... d5": "Mistake? I can't push e6, it goes against the game I'm supposed to play, but I can't play Bg4 anymore, so I might as well have. the reason I did this was to keep my bishop from being useless",
        "5. exd5 cxd5 6. Bb3": "??",
        "6... e5": "I'm out of my opening and white is ahead in development",
        "7. d4": "predictable",
        "7... Bb4 8. O-O e4 9. Bg5": "again, predicted. ",
        "9... Bg4": "with my pawn on e4 I figured this would be a good time to launch this attack, plus if he takes on f6 it makes my kingside attack stronger",
        "10. Bxd5": "I made a mistake. I gave up a free pawn and notice the deadly b7. however... my response is very unorthadox. ",
        "10... Bxc3": "!!?!!",
        "11. Bxb7": "Qb6 would have been the safe response... but I thought I could make up for the lost piece in a way... watch this. ",
        "11... Bxb2 12. Rb1 Bxe2": "!?! \r\n",
        "13. Qxe2 Qxd4": "This was my goal of taking this approach... however, I'm sure you've found the downside. ",
        "14. Bxf6 Qxf6 15. Qxe4+ Be5 16. Bxa8": "I'm losing by a fare amound at this point, and my knight is in a bad bad bad spot. ",
        "16... Nd7 17. Bc6": "My concept of dealing with the bishop has cost me quite a bit, I'm now playing a minor to a rook and down a pawn. ",
        "17... Qe6": "look what happens in this position after Bxh2... if only the bishop wasn't there....",
        "18. Bxd7+ Kxd7 19. Rfd1+ Ke7 20. Qb7+ Kf6 21. Qxa7 Rc8 22. Qa4 Rc4": "I'm assuming Qa4 was to get the h4 check... kind of useless if you ask me unless preceded by f4 (and then a4 is not where you want to be. ",
        "23. Qb3": "bad for me",
        "23... Bxh2+": "Last. Ditch. Effort. and the game turning point. this is officially where my opponent loses. If he had taken it, I had a mediocre series of checks to get my pieces out of impending trouble (Rd6 Qxd6 Qxc4) My opponent assumed I had a grand master like scheme involving my two remaining decent pieces that required his king to be on h2, and thusly reacted like this...",
        "24. Kf1": "!?!?!?!?!?!?!?!\r\nJust as a note, immediatly following the game, the coach ran up to the player and began telling him that I was only bluffing through the entire game. this is partially true. ",
        "24... Qa6": "Momentum turns in my favor. he can't play Qb6+ because my response would be Rc4+",
        "25. Rd3 g5": "this was because I couldn't think of an actual move. suggestions?",
        "26. Rbd1 h6 27. Rd3d6+": "this was my opponents mistake. he had forgotten about my bishop (that he could have taken for free!)",
        "27... Bxd6 28. Rxd6+ Qxd6": "My opponent resigns. If he takes the cook I get checkmate on d1, and he doesn't want to play down a rook, apparently. "
    },
    "url": "https://gameknot.com/annotation.pl/a-most-excellent-attempted-sac?gm=42137",
    "gameName": "A Most Excellent (attempted) Sac",
    "players": "???  vs. ??? ",
    "opening": "Pirc defence (B07)"
}