{
    "moves": {
        "1. e4 d5 2. exd5 Nf6 3. Nc3 e6": "My usual Icelandic.",
        "4. dxe6 Bxe6 5. Nf3": "In my experience, not the best if I go for the Qe7 attack, but even so white can defend with accurate play. So I went for...",
        "5... Bc5": "Prepared to be rejected by d4, but keeping an eye on a strong diagonal in case white would want to anvance the d pawn to d5. The problem with c5 now is that it leaves a dangerous hole on the Qside white squares (b5 for W's N or B at some point). So I went for this one. ",
        "6. d4": "As foreseen. I grant white the possession of d4, and a farily strong pressure against it. ",
        "6... Bb6": "Ok, I lost a tempo. And that I should have played Bg5. Was I ready to exchange my dsb for the Nc3? No! I sensed that my bishop pair is my strenght here. I won't waste it for a N, unless absolutely necessary. ",
        "7. Be2": "As good as any other. Bg5 is coming - I know - but I won't spend any tempo in a profilactyc move... even a some cost. ",
        "7... c6": "Controls b5 and e5, allowing me to save my dsb in case of Na4 (Bc7). A little cramped, but holdable - I think. ",
        "8. O-O O-O": "I always say that castling is a loss of time etc. etc. I can recognize the smell of a position where black has to think it twice trying the Qside castling, as usual. Or simply I wanted to try something different from Qd6!?",
        "9. Na4": "A voice whispered: \"keep your B at all cost!\"",
        "9... Ba5": "If Nc5, I was considering Bc8 (I have to defend b7 and I don't want to exchange B's. ",
        "10. c3": "My opponent went for this other plan instead. Now, b4, Bc7, Nc5, and I am squeezed in and b7 would fall. I have to parry that. ",
        "10... Bc7": "This move anticipates white's plan, but it takes the black diagonal, preventing W's dsb to go to f4 (a good square for it, as g5).",
        "11. Bg5": "This pin will be a real pain for me. I knew I had to play with a lot of care in order to handle it. ",
        "11... Nbd7": "First step to ensure f6's integrity. I can't allow BxN, g7xB unless very sure about assessing it. It's easy to see a power on the semiopen g column, but I couldn't be sure white won't have found some counterplay based on my Kside messed pawns. Of course, here white has Ne5, and my answer would have been Qb8. A weird square for the Q, but it defends b7 and controls f4, eyeing h2... some strong point to exploit. ",
        "12. Nc5": "This clearly let me no other choice, since b7 is threatened, and I don't want NxBe6. The white's pin gets stronger, without my other N's support.",
        "12... Nxc5 13. dxc5": "The pin on my N is restored, and it is a real... (censored). I don't find the right moment for h6-g5 (a dubious manouver).",
        "13... Qe7": "Virtually forced, unless I want to allow gxf6. I wasn't sure. I smelled a danger in it. ",
        "14. b4": "It's ok, because it consolidates a nice pawn's structure, and I can't easily attack it due to Nf3 (preventing Be5). But not necessary, because I won't have gone for Qxc5, BxNf6, gxB. As white, I would have preferred Re1!",
        "14... a5": "? See: I thought that I was not in a hurry to solve the pin issue, if I could grab some initiative, delaying white in his plans (Re1). White has nothing concrete still. The price of this would have been 15. b5. Against it, I would have not exchanged, even at the cost of b6, Bb8. Not a good square, but I hoped only temporary. But I had to keep control of b5 against White's lsb.",
        "15. Qc2": "A quiet move, probably envisaging Bd3, preparing a carabine on h7. ",
        "15... axb4": "The quiet move must have a cost for my opponent. In this case, the opening of the a coumn, with my Be6 threatening a2... the downside of not having played g5. ",
        "16. cxb4": "Ok, this consolidation was not avoidable, and I must live with a3 to seal it... or not? ",
        "16... Ra3": "Never! Weird or good? I planned to support it with Rf-a8. The point is that unless white can't advance the pawn to a3, a2 will be my target. Distracting white to make anything dangerous on my kingside. In my plans, note, my Q is not required, so it is free to retake on f6 if needed. My lsb, despite his pressure on a2, is not really easy to remove from my Q's guard against W's Rooks...",
        "17. Nd4": "Here, Be5 comes to mind, but fails to NxBe6, and if BxRa1, NxRf8...  ",
        "17... Bd5": "Too bad Nf6 is deprived of his natural square: it is not going to move for some more moves anyway! I have to cope with Re1 though! ",
        "18. Nf5": "\"I can live with this\". ",
        "18... Qe4": "The idea is that White can't do BxNf6 because of QxQ, but if white starts the Q's exchange, QxQ, NxQ and black seems free from the pin at last. White can't respond with Bd3, (QxB, Ra3 supports the Q).  But all this has flaw: it misses Ne7+ after the Q's exchange, followed by NxBd4 - finally exchanging NxB the next move. Or worse.  A hell of a position for my poor skills!",
        "19. Qxe4": "It worked! A mistake from W, in my view. With it, white only \"wins\" the need to add a defender to a2, and lost his terrible pin on my kingside! ",
        "19... Nxe4 20. h4": "Nothing bad in Be6, which also blocks the e column to me. Whites chooses this moment to become \"aggressive\"!?",
        "20... Be5": "It was either this of Rf-h8. I can't just take the pawn, I have to do it cleanly. ",
        "21. Rad1 Rxa2": "...like this. Now, white can do RxB, but I don't think it was good for him. But all this STILL allows Ne7+, Kh8, NxB, cxN, Rxd5. So my plan survived only because my opponent spared me. ",
        "22. Bf3": "? Without catching the chance. So I...",
        "22... Kh8": "...considered this the best move. If Ne7 now, NxBg5, NxBd5, NxBf3+, gxB, cxNd5, Rxd5. ",
        "23. Bxe4": "Exchanging a B for a N in order to open the column and get his N to d6. I bet I would survive it, but now I'm not any sure!",
        "23... Bxe4": "? Allowing Re1, indirectly exchanging a B for a N after BxN (what else?), RxB, Bmoves. ",
        "24. Nd6": "Threatening at the same time Be5 and b7. But, for who likes homeworks, here there is one: White has another much more powerful threat here, that both my opponent and me overlooked during the game. \n",
        "24... Bc2": "?? I foolishly played this based on Rd2, Bf3, Re2, and threatening Bxb4 in return after Nxb7. Completely overlooking White's simple but elegant Nxf7+. The point is that it forks my undefended dsb because I can't take the N or I will be mated in two (Rd8+, Rf8, RxR#). Nevertheless, things are not so simple, since after Kg8 - only one - NxBe5, f6 forks white's pieces. Anyway. The only correct move for black should have been Bd5, closing the column and preserving the lsb.",
        "25. Rde1": "Not certainly BxN! Never! :-D But I was a little scared of moves like Bc3, allowing again Nxf7+, Kg8, Re7...",
        "25... f6": "I have Bd3, assuring an exchange, but I have to solve the dsb problem and still create a threat so to delay Nxb7. ",
        "26. Rxe5": "!? I'm not sure this sac was good for White. True is that it deprives me from my Bpair, but at the cost of an exchange. It's difficult to suggest a W's better. Maybe Re2, but Rf-a8, without fear of Nf7+, Kg8.",
        "26... fxe5 27. Be7": "Ok but now this has less poison in it. ",
        "27... Rf4": "Instead of defending m b7 pawn with Rb8 (a very poor square for my R), I counterattack white's pawns with a fork. You won't say that all this is not an interesting piece game...",
        "28. Nxb7": "?? I would have gone for Re1 as white, again! Anyway. Why it's a mistake?  Ra7, and a piece is won. Again, we overlooked it. A shame... :-(",
        "28... Rxb4": "The more dangerous one. ",
        "29. Nd8": "Attacking c3. And I can't threat c4. ",
        "29... Be4": "Naturally protecting the pawn with no threats to be harassed or exchanged once in d5. But this allows...",
        "30. Re1": "! Amazing, another R aligning I oversaw! This time, my opponent puts me in a trouble, since after f3, my B must move and e5 will fall. But moreover: Nf7+ here takes e5 anyway for free... and again, we didn't see it! This is the pity of blitzes...",
        "30... Bd5": "Accepting Rxe4, what else, and hoping to get something more out of the two Rs.",
        "31. Rxe5": "Here I blundered and I went Rxh4, and I resigned soon after. Better would have been...",
        "31... Rb1+ 32. Kh2": "Only one. Now, R1-b2 seems to win, but again I was very scared of things like Bd6, threatening Re8+, Bg8, Nf7#! Very elegant... ",
        "32... Raa1": "So I went for this, that assured me at least a couple of checks. You can call it Hope Chess, if you like! :-)",
        "33. Bd6": "Preparing the mate! Very good! Ok, I can simply play one of my pawns and get out of the threat, so I would have taken the tempo to start my own attack. I just have to be aware that I \"owe\" my king a pawn's move. ",
        "33... Rbh1+ 34. Kg3 Ra3+": "Not a great plan. I lost my chance to play the R's on the second rank, and now with f3 I have nothing.",
        "35. f3": "As predicted. Time to save my own K. ",
        "35... h6 36. Re8+": "Still a problem, but not deadly. ",
        "36... Kh7 37. Bf8": "After Re7 I can't defend g7. But I have my own threats.",
        "37... Ra4 38. Re7": "Targeting g7.",
        "38... Rhxh4 39. Rxg7+": "I lost another important pawn. My Rooks are actionless at the moment. ",
        "39... Kh8 40. Nf7+": "Forcing the exchange of my last beloved B! But it was still better than a tricky mate!",
        "40... Bxf7 41. Rxf7 Kg8": "I feel I had to apply this pressure, even if...",
        "42. Rf6": "...and it seems that another pawn will fall!",
        "42... Rh5": "White can exchange now with Rxh6, or Bxh6.",
        "43. Be7 Rg5+ 44. Kf2 Ra2+": "White can't allow my R to fork K and Be7, so...",
        "45. Kf1": "This way, if black takes g2, it is not a check. ",
        "45... Rgxg2": "Black takes anyway, abandoning both pawns to its fate. ",
        "46. Rxc6": "White is very happy to get a free passed pawn on c6, and here, dear reader, there is a second homework: Black moves and wins... but for an only line by white. Which one?",
        "46... Rgb2": "This move threats back rank mate with Ra1#, and the other R shields any possibility of BxRa1. With the addition of a black pawn in f7 and a white pawn in h4, the position qualified as a puzzle (for once!) and it is now a puzzle. In the game, white has just one move to do: ",
        "47. Bh4": "! The only possible shield. From here, black can proceed with",
        "47... Rbh2": "...and white must lose the B or mate. Only escape way: ",
        "48. Rg6+": "Protecting g1... will it be enough?",
        "48... Kh7": "Nope. ",
        "49. Rg4": "Defending the B. Rg1 leads to the same loss of pieces. ",
        "49... Ra1+": "For example.",
        "50. Be1": "Forced. ",
        "50... Rh1+": "and white can't play Rg1 or the resulting exchanges will leave him with no pieces against black's R. If",
        "51. Kf2": "escaping the check after the R takes is the best white can do...",
        "51... Raxe1": "And black wins. Thank you for reading, all corrections and comments will be appreciated. "
    },
    "url": "https://gameknot.com/annotation.pl/a-must-have-been-nice-ending-trap?gm=60398",
    "gameName": "A must-have-been nice ending trap",
    "players": "Player (1435) vs. damafi (1371)",
    "opening": "Scandinavian defence (B01)"
}