{
    "moves": {
        "1. d4 d5 2. Bf4 Nf6 3. Nf3 Nc6": "NOt recommended in this defence.",
        "4. e3 Bf5 5. c3 e6 6. Nbd2 Bd6 7. Ne5 Ne4 8. Qh5": "The first outburst.",
        "8... g6": "Of course. ",
        "9. Qf3": "Not Qh6, Bf8.",
        "9... Nxd2 10. Kxd2": "NO prob. My king is safe in the center right now. ",
        "10... h5": "It's ok...",
        "11. Bb5 Bxe5 12. Bxe5 Rf8": "Maybe f6 was better after all. Now it starts an interesting battle for the winning of the bishops, with a delicate equilibrium between threats that make the bishop's issue untargetable... probably I should have lost the bishop, but it was very fun to play. ",
        "13. Qf4": "Forcing into defence, but setting the f6 bishop's self trapping. ",
        "13... Rc8 14. h3": "If now f6, I will follow with g4. My real target is just to open columns for my rooks. ",
        "14... a6 15. Bxc6+ bxc6": "This makes my b pawn weak. I'm aware, but I have to attack. ",
        "16. g4 hxg4": "I still see f6 here for black. ",
        "17. hxg4 g5 18. Qg3": "Who will win the bishop?",
        "18... Bg6": "I don't have a square to retire, so I have to improvise. Fortunately, I have a lot of ways to attack. ",
        "19. f4 f6": "At this point, it seems my bishop will fall. But I wanted to experiment with...",
        "20. f5 exf5 21. Rh6 fxe5": "Qxe was easy, then I recover the bishop. But it didn't satisfied me. ",
        "22. Rxg6 f4 23. exf4": "First obstacle against the enemy's king removed. ",
        "23... exf4": "? The wrong pawn! A pity. The obvious Re1 doesn't provide the win, but... (can you see that? :-). Having black played the correct one, gxf, my answer would have been Qh3, or d3. ",
        "24. Qe1+": "To avoid mate, black has to lose the queen for a rook, as a minimum. ",
        "24... Kf7 25. Qe6#": ""
    },
    "url": "https://gameknot.com/annotation.pl/a-nice-sudden-death?gm=52328",
    "gameName": "A nice sudden death.",
    "players": "damalfi  vs.  ",
    "opening": "Queen's pawn, Mason variation (D00)"
}