{
    "moves": {
        "1. g4": "My opponent was in mood for bizarre openings. This one is one of the trickyest. Experience has taught me that best is just to avoid to create weaknesses on the affected squares, and develop with a plan. Without trying to take any advantage from white's move, that's the point. ",
        "1... Nc6 2. Bg2 e5": "No threats on g4. Just making room for my pieces, and don't falling for Nf6?, g5! at any moment. ",
        "3. c3": "? Better was c4, or any other one. He wants d4 without compromising his e pawn.",
        "3... Bc5": "You won't have it so easily. You'll spread your Q side with a pawn storm and then you'll have no good flank for your K to shield in. And I will break in the center, sooner or later. ",
        "4. e3": "Not enough to grab d4. Here, Qe7 would have been a better idea than my own.",
        "4... Nge7": "I am planning now to play d5. He will compromise his ability to defend d5 with pawns if he goes for e4.",
        "5. b4": "As predicted. Now I have to be very careful, and yes, I'll get my pieces closed in.",
        "5... Bb6 6. a4 a6": "Not a5 or b5! will be really crushing. In a blitz I wasn't completely sure I could have saved my pieces in a decent way. This was just a \"bet chess\", if you like. I \"sensed\" from my experience from reviewing dozens of similar games that the \"score\" for this kind of bindle is about 60% to 40% playable in favour of the attacking part. But this is a personal feeling. I was confident in my \"nose\", and went for it this way. ",
        "7. a5": "Maybe better was to prepare the attack, and keeping the threat of both possible pawn's advance. Now he has to follow up with c4, and this could have given me the chance to play d5 and pray. ",
        "7... Ba7": "(The bad side of this refuge is that now my Nc6 is deprived from his best developement square, a7. White wants to play c4 but he can`t because of my N. So he finds a way to support it.",
        "8. Qb3": "He plans to support g5 with his Q, and he will get to it... but I have more things to do in the meantime. White still lacks of enough firepower to \"use\" the white diagonal he owns, so I can counterattack in the center (following good principles!).",
        "8... d5": "My lsb was, purposedly, the last of my pieces to develop, since I knew it will be useful guarding b7 until I could play d5, and in order to support it, only. I don't care about the g4 pawn, at all. ",
        "9. h3": "He does, and this gives me a free tempo. I still have to face g5.",
        "9... Be6": "This can't be bad, threatening the d4 push... but still, note that I can't prevent g5 and his Q on g5 next... nasty!",
        "10. Nf3": "After white plays b5 and my N pinned, e4 will be unprotected. I wanted to move my a rook, or castle, but I have to take advantage from any given tempo in order to tighten my defences, and look for concrete white threats. If I play d4 now I will get something like c4 as an answer, self-pinning his Q but also keeping g5 in the agenda. I overlooked b5 as a good defensive move (if axb ep, Bxb6 and the a pawn holds... or it seems.",
        "10... Qd6": "This can't be bad. If c4, I can even think about Qxb5.",
        "11. d4": "I know exd4 won't give me much after exd4. I will help him to unlock his dsb, with considerable edge for him. No way.",
        "11... e4": "With this move I make BOTH his bishop almost useless (almost). I am also making of my own only active B a \"bad\" bishop. And I am also allowing white to play Ng5, threatening to exchange it for my lsb. To this, I will keep my lsb with Be7 (a better square for it now!), and the WN wil be kicked with tempo. By the way: can you say, from now, on which diagonal will it be most likely to take place a threat from white's B on black? The answer later in this same game! :-) .",
        "12. Nh2": "It's difficult to assess. After Ng5, even if black allows NxB (which is not given), black will lose his \"bad\" bishop for an active N...",
        "12... Rb8": "I have to expect b5, no more \"tricks\", I've done all that I could. I have to be profilatic and use my pieces. Before castling can take place with safety.",
        "13. b5": "Here it comes.",
        "13... axb5": "This take is not forced. If ...o-o, b6, ...cxn, axb6... and the pawn is pinned.",
        "14. Qxb5 O-O": "Now is the moment. White did take the pawn, but I have a tempo. Now, I fear h4-h5... but they are a lot of tempos. I now have f5 as the only way to activate...",
        "15. Ba3": "Answer: this diagonal. True. I forgot. Now... be cool.",
        "15... Qd7": "Q defended from B. White's next threat: f3.",
        "16. c4": "...or this. I can play here the nice Ne5, forcing the Q's exchange, and reliefing me from the crunch into I am in. Note that my e7 Night's defence is weak, and it's pinned.",
        "16... dxc4": "?? A blunder. I was lost considering Nxd4, but I couldn't see anything in it. ",
        "17. Bxe4": "In a serious game I would have shaken hands, but we were in a rated blitz, at a very low level... who knows?",
        "17... Nxd4": "The reasoning was: if he exchanges Q's and then wins the d4 N (and he \"has\" to or I'll win the a1 rook with a checkfork), I'll have Bxd4, winning another tempo on the Ra1, and with luck this will allow me a tempo to play Rf-e8, getting out of inmediate danger.",
        "18. Qh5": "White threats mate! And if I play h6, g5 will be my killer. ",
        "18... Ng6": "The best. My N is doing anything importan, and BxN just improves my chances. Of course, I'm losing a piece without apparent compensation other than a simple threat on the Ra1 white... hey, look well: I have another B and a pawn. Don't you \"see\" anything up there? Sure! BLACK is winning here, depending on white's move...",
        "19. exd4": "Oh, dear, thank you! You gave me the chance to play a fantastic mating attack from here...",
        "19... Qxd4": "Q forks R and f2. ",
        "20. Bxf8": "?? ...but I can't see any defence. Now it's a forced mate that went actually played like this (can you find improvements for both sides?)",
        "20... Qxf2+ 21. Kd1 Rd8+ 22. Kc1 Be3+ 23. Nd2 Qxd2+ 24. Kb1 Qb4+ 25. Ka2 Rd2+ 26. Bc2 Rxc2#": "...and that was how it went. So, sometimes \"creative\" moves can be helpful. If they focus on a possible weakness, even if it seems unbreakable. "
    },
    "url": "https://gameknot.com/annotation.pl/a-nice-finish?gm=62003",
    "gameName": "A nice finish",
    "players": "BM_Novrie (1370) vs. damafi (1394)",
    "opening": "Grob's attack (A00)"
}