{
    "moves": {
        "1. e4 d5 2. exd5 Nf6 3. Nc3 e6": "Icelandic gambit, on tought testing. ",
        "4. Bb5+": "Yessssss. At last. I know the answer is there, but I had to find it by myself. No database, book or time to look around. So. It is not nice, unless you don't care to play with an isolated e pawn. I wasn't prepared for that. ",
        "4... c6": "I condemn my forces to stay on guard of the c6 pawn for a long time, but will my opponent be able to take advantage of it? My other pieces (queen and dsb) will be very free to invade the board. ",
        "5. dxc6 bxc6 6. Ba4": "Ok, this bishop keeps the c pawn pinned, but... what else?",
        "6... Bc5": "I though it was better than the inmediate Qd4. Black is threatening it now. ",
        "7. Qf3": "Good. I thought that now...",
        "7... Bb7": "The bishop is currently undefended, but soon it will be. And then, c5will become a weapon in my hands. ",
        "8. Nge2 O-O 9. d4": "White plays as I would do. Not \"losing time\" with castling. I did it, and white strikes. But look: Is he threatening to pin the piece and place a rook behind it? He won't get on time, methink...",
        "9... Bxd4 10. Bg5": "Played quickly. It is supposed to be a threat? I looked hard, but I couldn't see any serious one. ON the other side, I have Qa5, making pressure. ",
        "10... Be5": "Just in case, not wanting to take more time, I played passively. ",
        "11. Ne4": "That was a decisive blunder on white's part, I'm afraid to say. But it must be said that the position is very hard to play! White let me the open way to go...",
        "11... Qa5+": "It must be calculated whether if BxN, BxB, NxB, gxN, QxN?, QxB, Qg4+, Kh8, Qf6+ and drawn by repetition. ",
        "12. Ne4c3": "And here, I acted the combination I was looking for. ",
        "12... Bxc3+ 13. Nxc3 Qxg5": "You must feel bad, as I do when this happens to me. But the game is still fun. Since I couldn't switch to \"on\" the bishop's threat (it is slow to defend), my kingside is still, amazingly, undeveloped. Will white be able to take advantage of it and compensate the material downfall?",
        "14. O-O": "Well, this for a start, leaves to me the initiative. But it is not easy to find a smooth way to untangle my kinside pieces. ",
        "14... Nd5": "To stop the queen's action against c6. Now I can happily exchange it, and transfer the future threat to d4. ",
        "15. Ne4 Qe7": "Time to be wise and calm. I can still fall into a fork or something. White's pieces are more active than mines. ",
        "16. Rad1 Nd7": "Now, it was a risk, but I wanted to get out of passivities and take the chance to unravel my position. ",
        "17. c4 Ne5": "Strong. True is that white can threat my knight, but it can takre c4, so the options are limited. ",
        "18. Qh3": "Well, Nxc4 was the simple one, but I play for fun, and to develop intuition rather than calculation. ",
        "18... Nf4": "The two knights can defend each other in a move. ",
        "19. Qb3": "My bishop, by the way, IS defended. Now I was unsure about Rb8, but I didn't like him to advance to c5 and blind my bishop. ",
        "19... c5 20. Nd6": "Not a real problem, since Rb8 was enough. But I don't like to be on the defensive, and, again, I had an intuition. ",
        "20... Ne2+ 21. Kh1 Bxg2+ 22. Kxg2 Qg5+": "Now, the only way to block my queen is with his queen, but the knight will take it. It would have been a good exchange for me. ",
        "23. Kh1": "...but now I have to prove I played well, and I wasn't sure at all about how to finish the game!",
        "23... Qh5": "Looking for Nf3 or Ng4. ",
        "24. Qe3": "I think white must have tried h3, but it is hard to say. Probably f3 would have saved him. But it is very hard to think when few seconds are left. ",
        "24... Nf3": "Now, this is really nice. Can you see?",
        "25. Kg2 Qg4+ 26. Kh1 Qh3": "The threat is still \"on\"... white has to sac the queen, but even so, he will lose in few moves. Thank you for reading! By the way: white could save himself two moves back, as the puzzle creator engine shows, but with ruinous loss of material "
    },
    "url": "https://gameknot.com/annotation.pl/a-nice-game-from-the-wild-west-with-a-nice-ending-mate?gm=51053",
    "gameName": "A nice game from the Wild West, with a nice ending mate.",
    "players": "tarupam  vs. damalfi ",
    "opening": "Scandinavian defence (B01)"
}