{
    "moves": {
        "1. e4": "Good opening, This is one of the most opening's I use myself!",
        "1... e6": "Black is playing to control up the center, this is the first move that does two things it gives the DSB a way out to attack and also the same for the Queen. Some players will play this opening to attack white and possibly get a quick check mate. ",
        "2. Qh5": "White is counter playing Black. It is not a move most players make. developing other minor pieces first would be the norm. ",
        "2... d5": "Black continues to play up the center, ignoring the Queen. Black has a plan of attack! White is making this easier for black to attack Queen side.",
        "3. exd5": "pawn takes pawn, Notice that White has only the queen out and black has yet to develop any pieces. Interesting game so far!",
        "3... exd5": "pawn takes pawn! This pawn is protected with the queen. ",
        "4. Qe5+": "+CHECK by white with the queen",
        "4... Be6": "Black blocks the check by pinning his dark squared bishop  DSB. This is a great move by black.",
        "5. Qd4": "Queen retreats, with out any other developed pieces, I think developing the LSB or the knight on king side would of been better. ",
        "5... Nf6": "Black develops the knight on the King side. One more piece out and Black could Castle king side. Getting your King in a safe place is important to avoid checks. ",
        "6. Bb5+": "This was a move I was waiting for. + by the LSB.",
        "6... c6": "Black responds with a killer move  c6! White is still under developed and really can't just come in like this and expect a quick checkmate now.",
        "7. Qa4": "This is like loading a gun, unfortunately for White  black can avoid this attack by white. ",
        "7... cxb5": "LSB is taken by pawn",
        "8. Qxb5+": "+Queen takes pawn check!",
        "8... Nc6": "knight blocks the check.",
        "9. Qxb7": "Queen continues to attack alone all by herself",
        "9... Nd4": "knight moves forward!\n",
        "10. Na3": "white develop a knight to the rim. Nc3 or Nf3 would be normally how to develop. The reason  for not moving to the rim or edge of the board is that the N reduces the spaces it covers with it's L-shape move pattern.",
        "10... Bxa3": "DSB takes the knight off the rim! ",
        "11. Rb1": "White counters the fork attempt by black Nc2.",
        "11... Bd6": "black retreats the DSB.",
        "12. c3": "white sends out the pawn to attack the knight.",
        "12... Bf5": "DSB to attack the rook!",
        "13. cxd4": "pawn takes Knight!",
        "13... Bxb1": "Bishop takes rook.",
        "14. Ne2": "Knight develops in front of the king.",
        "14... O-O": "Black castles kingside  ",
        "15. Nc3": "knight is moving again.",
        "15... Qe8+": "+Queen checks\n",
        "16. Ne2": "knight moves back to block the check.",
        "16... Bd3": "bishop to attack the knight in front of the king",
        "17. O-O": "white finally castles.",
        "17... Qxe2": "queen attacks",
        "18. h3": "h3 moves out, I think white may of wanted the g pawn out.\n",
        "18... Qxf1#": "Black queen moves to f1 for the mate!    I made this annotation for John aka thefez. A very nice mate!  This was  done after a unrated game we played. It is important to not only play your attack, but to try to see the threats against you. If any one would like to make comments for this game, you are welcome to give your advice. It is welcomed.  "
    },
    "url": "https://gameknot.com/annotation.pl/a-nice-mate?gm=53521",
    "gameName": "A nice mate!",
    "players": "met0n (1124) vs. thefez (1074)",
    "opening": "French defence (C00)"
}