{
    "moves": {
        "1. e4": "This is what passes for my opening repertoire. Not very original huh? I like this game because although I gave up a large advantage I gained early. I finished with a very pretty forced mate.",
        "1... e5 2. Nf3 d5 3. Nxe5": "I won't play exd5 because of e4, threatening my knight.",
        "3... d4": "Letting go of the e-file for the sake of an advanced d pawn.",
        "4. g3": "I want to fianchetto my white bishop.",
        "4... f6": "Of course.",
        "5. Nf3 c5": "This lets me know he doesn't have any immediate plans to lose another pawn so I might as well release my good bishop.",
        "6. d3 b6": "I'm sure I would pay dearly for delaying development if my opponent weren't also pushing pawns.",
        "7. c3 Nc6 8. Bg2 Bd6 9. O-O Nge7 10. cxd4": "Time to open things up.",
        "10... cxd4 11. b3 Ba6 12. Bb2": "Attack d4 a second time.",
        "12... Nb4": "Black almost had a good attack, he should have simply protected the d pawn.",
        "13. Bxd4": "And I didn't see what was coming.",
        "13... Bxd3": "A rook for a bishop?",
        "14. Re1": "No thanks.",
        "14... Nc2": "A rook for a bishop and a knight I'll take.",
        "15. Qxd3 Nxe1 16. Nxe1": "And I win the exchange (this game helped me recognize the superiority of a bishop and a knight against a rook in many positions)",
        "16... Bb4": "Attacking my undefended knight.",
        "17. Nc3": "stops the threat to the knight while releasing my rook. ",
        "17... O-O 18. Ne2": "Get my knight to a more useful square but I missed the fork.",
        "18... f5 19. Qc4+": "Now I see it.",
        "19... Rf7 20. Qxb4": "And I get a bishop for free.",
        "20... Nc6": "Not surprising.",
        "21. Qa4": "Now the knight can't threaten my queen for at least three moves.",
        "21... Rc8 22. Be3 Ne5 23. Nf3 Nxf3+ 24. Bxf3 Qf6": "I was afraid of an attack down the f-file and didn't recognize the purpose of that move.",
        "25. Nf4": "So I tried to shore things up a bit.",
        "25... Qxa1+": "Oops, there goes my advantage.",
        "26. Kg2": "Forced.",
        "26... Rc2": "That's when I saw my chance. If I could just free my bishop without tipping my hand to black.",
        "27. exf5": "Taking the pawn on f5 looks innocent enough.",
        "27... Rxf5": "Too bad it's mate in three because I have a chance to gain some material by forking the rooks.",
        "28. Qe8+": "One.",
        "28... Rf8": "Notice that this forced move moves the rook away from guarding the d5 square.",
        "29. Bd5+": "Two.",
        "29... Kh8": "Forced.",
        "30. Qxf8#": "Three."
    },
    "url": "https://gameknot.com/annotation.pl/a-nice-mate-in-three?gm=2135",
    "gameName": "A nice mate in three.",
    "players": "gyurkovitz (1260) vs. tabasco (1231)",
    "opening": "QP counter-gambit (elephant gambit) (C40)"
}