{
    "moves": {
        "1. e4": "Hi everyone!\n\nYet again I find myself in trouble in the middlegame.  I lose a pawn and the usual jstevens1 passivitis rot was setting in.  But was it to prove terminal or did Glenda get to stop that rot?  Well, you will have to either read on to the end or view the GA spoiler below.  My opponent kicks off with 1. e4.",
        "1... e5 2. Nf3 d6": "2. ..... d6 - Philidor's Defense.  Surprisingly I have had some pretty good results with this defense!",
        "3. h3 f5": "3. ...... f5 - I read somewhere that Andre Philidor used this move as an immediate follow up to d6 to avoid getting completely cramped.",
        "4. exf5 Bxf5": "4. ..... Bxf5 - Pawn trade - I am able to use Fou Leblanc to recapture and to have a decent pawn centre and a piece developed.",
        "5. Nc3 Nf6 6. b3 Nbd7": "6. ..... Nbd7 - over the last few moves it has been development on both sides.",
        "7. Bb2 Be7 8. g4": "8. g4 - allo, allo, allo - an attack on Fou Leblanc and the hint of a kingside pawn storm.  White looks to be planning to castle queenside.",
        "8... Be6 9. Qe2 Nd5 10. Bg2 Nf4 11. Qf1 Nxg2+ 12. Qxg2": "12. Qxg2 - N for B trade.  I now have the bishop pair.",
        "12... Nb6 13. O-O-O Qd7 14. d3 O-O-O": "14. ....... 0-0-0 - Finally Henry goes where his counterpart goes - queenside.",
        "15. Rhe1 Nd5 16. d4 Nxc3 17. Bxc3 exd4 18. Bxd4": "18. Bxd4 - uh oh!  After this plethora of exchanges I have overlooked a bishop fork on my g7 and a7 pawns.  ",
        "18... Bf6 19. Bxa7 Bc3 20. Re3 Bb4": "20. ...... Bb4 - over the last two moves I did consider b6??  Why is this move a double question mark?  Can I have your answers on a PM postcard?",
        "21. Bd4 Bd5 22. Qg3 Bxf3 23. Rxf3": "23. Rxf3 - ridding myself of one dangerous white steed at a cost to Fou Leblanc but my position still is not great.  For now though I keep my mitts off the resign button!",
        "23... Rhf8 24. Rxf8 Rxf8 25. f4 g6": "25. ..... g6 - after that rook trade I now play g6 to safeguard that beleaguered g7 footman and to relieve Glenda of that infernal duty of defending it!",
        "26. Qd3": "26. Qd3? - allows me to restore material equality.  White still appears to have an edge though.",
        "26... Rxf4 27. Bb2 Bc5 28. Qc3": "28. Qc3! Threatening a nasty check on h8 which will force Glenda to interpose as Henry is trapped on the back rank.  My h2 pawn will then be a gonner!",
        "28... Rf8 29. Qa5": "29. Qa5 - threatening to deliver mate on a8.  Also Fou Lenoir is a bit vulnerable on this square so I decide to move him with check.",
        "29... Be3+ 30. Kb1 Kb8": "30. ..... Kb8 - Henry sidesteps from Old Matey's clutches.  For now at least.",
        "31. Re1 Bb6 32. Qb4 Rf2": "32. ..... Rf2 - contemplating getting behind white's kingside pawns.",
        "33. g5 Qc6 34. c4 Kc8 35. Qc3": "35. Qc3 - again threatening Qa8+.",
        "35... Rf8 36. Qg7 Re8 37. Rxe8+ Qxe8": "37. ..... Qxe8 - rook trade.  It looks as though my h7 pawn is a gonner.  But the WK is now a little bit exposed.  Glenda and Fou Lenoir are both aware of this fact and it is handy that these two pieces can check the WK diagonally on the white and dark squares.  Maybe picking up a WP in the process.",
        "38. a3 Be3 39. Qh6 Qf7 40. Qh4 Qf5+ 41. Ka2 Qxg5": "41. ..... Qxg5 - a white kingside pawn duly does fall.  This game now looks to be heading for a draw.  I hang fire on hitting the offer draw button though because I will be conceding a Low Draw.",
        "42. Qe4": "42. Qe4 - threatening Qe8+, Qd8 then QxB.",
        "42... Kb8 43. Qe8+ Ka7 44. Qd7 Bb6 45. Qxh7 Qh5": "45. ...... Qh5 - offering a queen trade. My opponent however decided to keep the queens on.",
        "46. Qd7 Qe2": "46. ..... Qe2 - Based on the fact that the WB is now pinned by Glenda a little seed starts to germinate in my head.  I am now threatening #3.  Spot the checkmate.",
        "47. Qg7 Qc2": "47. ..... Qc2 - hoping for a zugzwang.",
        "48. Qh7": "48. Qh7?? - exactly the move I was hoping for!!",
        "48... Bd4": "48. ...... Bd4 - after this move I announced mate on the move and explain in depth that it cannot be prevented.  My opponent waved the white flag - so I did get something out of this game - wheew and double wheew!"
    },
    "url": "https://gameknot.com/annotation.pl/a-pawn-down-a-passive-position-then-what?gm=64454",
    "gameName": "A pawn down, a passive position, then what??",
    "players": "2kneo (1608) vs. jstevens1 (1775)",
    "opening": "Philidor's defence (C41)"
}