{
    "moves": {
        "1. c4": "I kick off with the always flexible English opening, obviously at this point the game could progress in many different directions, and this is one of the reasons I'm finding myself play this first move in a decent portion of my games these days. ",
        "1... c5": "Black responds by mirroring my first move, some consider this line to be rather boring however I feel this to be far from the truth, symmetrical English games can easily be full of excitement. Besides at this point the game can still progress down many different routes. The key idea behind both sides not yet committing to the centre is that often the openings can be something of a guessing game as both sides look to make several transpositions",
        "2. Nc3 Nf6 3. g3 e6": "Breaking the symmetry, these types of pawn formations can lead to dynamic interesting play since black is signalling that he intends to at some point play in the centre ",
        "4. Nf3": "I personally think this is more accurate than fianchettoing the bishop right away, this knight immediately adds control to the central dark squares and allows me to meet 4...d5 with 5.cxd5 exd5 6.d4 cxd4 7.Nxd4 instead of having to recapture with the queen and potentially lose a tempo ",
        "4... a6": "!? very interesting, according to the database, more common is ...b6 or Nc6 but at this point there really isn't any correct move, I think compared to other more mainline openings this is position is comparatively unexplored and allows each player a lot of play. the gameKnot engine marks this for the moment as the first non book move",
        "5. d4": "!? more common is apparently Bg2 which is perfectly alright, it leads back to positions that have still been seen a fair bit although not as much as something like a ruy lopez or sicillian. I chose this move because on principle blacks just made a play on the wing so it makes sense to strike in the centre, the other reason I chose this over Bg2 is because this move puts blacks idea to the test by striking earlier than white normally would it attempts to refute blacks idea.",
        "5... cxd4": "5...b5!? was another way to go and immediately leads to a complex position I did look into it a bit but with so much to analyse I think I'll leave it to the reader to come up with their own opinions of that line",
        "6. Nxd4 Qc7": "! by far the best move in my opinion. I feel like anything else allows white to keep playing for an advantage whereas with this, black signals his intention to play to win. This move is the only one that applies pressure on white by immediately threatening to win material black makes it so white needs to react ",
        "7. Bg2": "Not willing to hand black the initiative I elect to sacrifice the pawn. In any case I dint really feel like there was a satisfactory way to protect the pawn. e3 would be terrible, e4 would maybe be alright, however white wishes to fianchetto so making that harder to achieve doesn't seem to wise Qd3 is probably the best way to defend however I didn't really think my queen belonged on d3. interestingly this move brings us back into the gameKnots opening book according to the engine, I was aware that the position has still seen plenty of games in the database, however I don't have access beyond the first seven moves so I was more or less making moves based off of my personal opinion and ideas.",
        "7... Qxc4": "white offered the pawn, black has no reason not to take it.",
        "8. O-O Nc6 9. Nxc6": "Supposedly this takes us back out of book. It is a bit of a concession I admit, having sacrificed a pawn I don't wont to be trading pieces so willingly especially my centralised developed knight. Yet on the other hand moving it else ware seems like a concession in time and there isn't a good way to defend it, plus I feel as though the pawn formation black will be left with will make it hard to coordinate and activate his pieces, in particular by closing the c file I can probably gain some time making the black queen a little uncomfortable. Not that moving the knight would be bad, both Nc2 and Nf3 were also worth considering",
        "9... bxc6 10. Bf4": "! Simple but strong. I immediately place plenty of pressure on the dark squared f4-b8 diagonal this does a number of things, it stops the rook making use of b8 and more importantly I'm looking at the d6 square as I would love to stick a bishop there thus creating a bind over black and preventing him from castling. Another key point of this move is that it clears away the c1 square which is where my rook belongs so it can be more active and making life uncomfortable for the black queen. ",
        "10... d5": "Black wisely prevents any nonsense on d6",
        "11. Rc1": "strong square for the rook, I get to apply pressure against the queen and down the important c file where I'm targeting the weak c6 pawn and just as importantly the weak c5 square",
        "11... Qb4 12. a3": "Also possible is Qc2, however I felt it prudent to continue to harass the black queen. If now 12...Qxb2? 13.Na4! Qb7 (13..Qxa3?! 14.Nb6) 14.Rb1 Qa7 15.Nb6 and I'm definitely liking white",
        "12... Qb7 13. Qc2 Be7": "Preparing to castle",
        "14. Na4": "for a while it seems as though this knight is somewhat out of play, however the reality is a very different matter. The truth is that this knight does an excellent job applying pressure to the dark squares b6 and c5 whilst also performing a good role of defending b2. Plus it unmasks my queen and rook on the undefended c6 square (though I'm not actually threatening to take it just yet.",
        "14... O-O 15. e4": "?! This is the only move in the game that I think is really suspect, from a theoretical point of view it makes sense that I being the better developed side (whos also sacd material) should want to open up the position. However this causes me to give up my LSB which starts to make my position feel somewhat airy. Had I had this position again I think I would have gone with Rfd1 instead",
        "15... Nxe4": "likely best",
        "16. Bxe4 dxe4 17. Qxe4": "And now visually we can see what losing our LSB is like, it doesn't seem pretty. It's true that c6 is weak and c5 is an excellent square to make use of, however I did concern myself just a little that black may find a way to give back a pawn (either the c or e pawn) inorder to activate his LSB which could prove very strong if the position was to open up in that manner. I made sure to keep this in mind for the next part of the game as I played with the intention of keeping blacks pieces in particular the LSB from getting activated ",
        "17... Qb5": "Black vacates the b7 square evidently planning to make use of it with his LSB whilst at the same time the queen puts pressure on my Knight making it so I cant play b4 to clamp down on c5",
        "18. Rfd1": "a very important move, I take the file while I can and get ready to meet Bb7",
        "18... Bb7 19. Rd7": "! an essential move in my view this prevents c5 and continues to keep hold of the initiative. ",
        "19... Rfe8 20. Qc4": "!? this is the only move throughout the game that the gameKNot engine marks as an inaccuracy The line it does provide starting with b4 does seem to be more complicated and although I certainly had considered 20.b4 I had seen that this move lead to a lot of lines that are nearly guaranteed to be drawn and as a draw would be a good result I felt this was the best course of action.",
        "20... Bc8": "looking to get rid of the pesky rook on the seventh, however white now implements a combination that essentially guarantees a drawn endgame",
        "21. Qxb5": "or alternatively 21.Rxe3 first, I liked this better though because it closes the b file",
        "21... axb5": "cxb5 would be suicide since it opens the c file ",
        "22. Rxe7 Rxe7 23. Nb6 Bb7 24. Nxa8 Bxa8": "and now with the presences of opposite coloured bishops the ending is a clear draw. I chose to play on for a while more though simply because my opponent is stronger and has the extra material so I wait until I have 'proven the draw' before I offer one",
        "25. Rd1": "! not only are the bishops of opposite colour around, but I have the much more active pieces meaning I can't really go wrong.",
        "25... Re8": "forced",
        "26. Be3": "looking to clamp down on c5 thus shutting the black LSB out of the game",
        "26... h6 27. h4": "?! Okay this move doesn't change anything about the result or the drawishness of the position, I was thinking I'd first prevent g5 before I clamp down with Bc5 but if I got to thi position again I think I would play Bc5 just because in that case it is actually harder for black to play. Ofcourse the position is still a draw no matter what the only moves that change that would be if I lost a piece with Rd5?? Rd8?? Bg5?? or Bxh6??",
        "27... c5 28. Bxc5 Bd5 29. Rc1": "I offer the draw now since I feel I've proven that I'm not going to blunder, overall a solid game which allowed me to attain a good result."
    },
    "url": "https://gameknot.com/annotation.pl/a-pawns-worth-of-play?gm=51575",
    "gameName": "A pawns worth of play",
    "players": "thereaper1 (1940) vs. ionadowman (2101)",
    "opening": "English (A34), symmetrical variation"
}