{
    "moves": {
        "1. e4 c5 2. Nf3 Nc6 3. d4 cxd4 4. Nxd4 g6": "The Accelerated is an opening I am trying to learn.   There are a lot of variations ( like most openings that have been or are popular ), but this is one I fear the most.  If you have better ways to play this let me know please. \n",
        "5. Nxc6 bxc6 6. Qd4": "It seems that black must defend against major threats already.\n ",
        "6... Nf6 7. e5": "So there is only one move.\n",
        "7... Nd5 8. e6 f6": "Forced. I suppose the only other move is 7.  ...  Rg8 but 8. e6 x f7ch is too painful.",
        "9. c4 Qb6": "He can't take the knight because he will lose his queen and on 10. Qxb6, Nxb6 gets the knight out of trouble and after 11. e6xd7, Bxd7 gives black a nominal lead in development.",
        "10. exd7+ Bxd7 11. c5 Qc7": "The check is meaningless and helps him develop. I think black is OK here white has ways to get pressure still.\n",
        "12. Bc4": "White threatens to win a pawn and make it difficult for black to castle.\n",
        "12... e5 13. Qh4": "It is time to drive the queen out of the center, but he threatens the f6 pawn. So...\n ",
        "13... Bg7 14. O-O O-O": "The knight is pinned but it was time to get the king out of the center.\n",
        "15. Nc3 Be6 16. Bh6 Rab8": "Black's first threat! Its not much of a threat the knight is pinned ( unless it goes to f4 ).\n\n",
        "17. Bxg7 Kxg7 18. b3": "18. ..., Nxc3  19. Bxe6  doesn't look too good for black\n\n",
        "18... Qe7 19. Ne4 Nc7": "I think White's best move is 20. Nd6.  I wasn't sure about the best reply 20. ..., Nb5 was a possibility. But White is focused on f6 so I think I was lucky.\n\n ",
        "20. Bxe6 Qxe6 21. f4 Nd5": "Reinforcing the f6 square and setting up to take on f4 perhaps.\n",
        "22. fxe5 Qxe5 23. Rae1": "Setting up a nice discovery, but ...\n",
        "23... Qd4+ 24. Kh1 f5": "The knight on e5 is pinned! 25. Qf2 would hold everything together but...\n",
        "25. Rxf5": "An unfortunate blunder. On 25. ..., g6xR there might be a little compensation but ",
        "25... Rxf5": "White resigns."
    },
    "url": "https://gameknot.com/annotation.pl/a-painful-dragon?gm=62933",
    "gameName": "A Painful Dragon",
    "players": "Anon (1724) vs. Jmd1952 (1200)",
    "opening": "Sicilian (B34), accelerated fianchetto, exchange variation"
}