{
    "moves": {
        "1. Nf3": "Hi everyone!\r\n\r\nHave you ever been in a dodgy position against a lower rated player and considered trying to buy your way out of it with a draw offer in order to concede a few points to avoid the loss of many?  I certainly did in this game but guess what, my gut instinct kicked in and told me to hang fire.  I'm glad I listened to it because my opponent timed out!  Anyhow on with the action, white kicks off with 1. Nf3 the Reti Opening.",
        "1... Nf6 2. d4 g6 3. g3 Bg7 4. Bg2": "4. Bg2 - the kingside is fairly symmetrical here.",
        "4... O-O 5. O-O d6 6. Nc3 Nbd7": "6. ........ Nbd7 - development.",
        "7. Qd3 c6 8. e4 e5": "8. ......... e5 - at last I challenge the centre.  White still has a positional plus here, more pieces active.",
        "9. Bg5 Qc7": "9. ......... Qc7 - unpin.",
        "10. Rad1 exd4 11. Qxd4": "11. Qxd4 - pawn trade.",
        "11... Ne8 12. Qe3 f6": "12. ....... f6 - I try to drive off that enemy bishop but he moves to h6.",
        "13. Bh6 Ne5 14. Bxg7 Kxg7": "14. ........ Kxg7 - bishop trade.",
        "15. Ne2 Rf7 16. b3 Re7": "16. ....... Re7 - keeping an eye open for that knight on e2 - that horsie could jump onto d4 or f4 threatening to come to e6 and fork Henry and Glenda.",
        "17. Qc3 Bg4": "17. ........ Bg4 - development.",
        "18. Rd2 Rd8 19. Rfd1 Rdd7 20. Qe3 b6": "20. ........ b6 - this pawn move screens out the Wicked Witch of the West.  My knight on e8 cuts a very forlorn figure.",
        "21. h3 Nxf3+ 22. Bxf3 Bxf3 23. Qxf3": "23. Qxf3 - a trade of 2 sets of pieces does not entirely solve my spatial issues.",
        "23... Re5 24. Nf4 Rde7 25. Re1 Kh8": "25. ....... Kh8? - Maybe Kg8 was better.  I will explain more towards the end.",
        "26. c4": "26. c4 - pawn roll.",
        "26... Ng7": "26. ........ Ng7 - at last with the d6 pawn defended by Glenda (now who else?!) my horsie can improve his position.  This knight move also gives added protection to e6.",
        "27. b4 f5": "27. ........ f5 - this move triggers an exchange of pawns.",
        "28. Rde2 fxe4 29. Re2xe4 Rf7": "29. ....... Rf7!? - here I try to complicate things.  If I continue to trade on the e file I will end up with a very passive Q + Kt v Q + Kt ending.  After I played this move I worked out an interesting sequence.  This sequence was not played because it was here that black timed out.  It goes like this:-\r\n\r\n30. Rxe5 dxe5 \r\n31. Rxe5 Qxe5 \r\n32. Nxg6+ hxg6 \r\n33. Qxf7 Qe1+ \r\n34. Kh2 Qxb4 \r\n35. Qxa7 Qxc4 \r\n36. Qxb6 Qxa2 \r\n37. Qxc6 Qb1 \r\n\r\nI would prefer to be white in that final position and I would have probably have negotiated a low draw there.  Which colour would you the jury prefer to be?  I will leave it to you."
    },
    "url": "https://gameknot.com/annotation.pl/a-precarious-position?gm=23284",
    "gameName": "A Precarious Position",
    "players": "NN (1534) vs. jstevens1 (1783)",
    "opening": "Reti opening (A05)"
}