{
    "moves": {
        "1. e4": "I had white pieces and started with e4",
        "1... e5 2. Nf3 d6": "after e5, nf3, d6 we have Philidor defense. ",
        "3. Bc4 Be7": "Bc4, be7, Steinitz variation.  ",
        "4. O-O Nf6 5. d4": "I played d4, sacrificing the e pawn for quick development",
        "5... exd4 6. Nxd4 c5": "This is not the most accurate move, Nxe4 or castling could be played",
        "7. Nf3 Nc6 8. Nc3 O-O": "Both sides just developing pieces",
        "9. h3": "H3, preventing bg4.",
        "9... a6": "Black is obviously gonna play b5 and maybe then play b4. ",
        "10. Nd5": "Nd5, my knight is well placed, attacking the dsb and challenging the knight on f6. ",
        "10... Nxd5": "Black wanted to preserve the bishop",
        "11. Bxd5": "Bxd5, my bishop is in a really good position. ",
        "11... Be6": "This move makes sense, black tries exchange his bad bishop for my good bishop ",
        "12. c4": "Bxe6 would be bad, black would have a strong pawn center, thats why c4 was played. If black plays Bxd5, I would recapture with e pawn and play b3 next. ",
        "12... Rc8 13. b3 Qd7 14. Bb2": "So far everything is going according to plan, now I have the dsb aiming at his king.",
        "14... f5": "Not sure why f5 was played, certainly b5 would be better. F5 weakens his king side and pins his bishop.",
        "15. exf5 Bxd5": "black made another inaccurate move, Rxf5 should be played. This move allows me to recapture with check, gaining initiative.",
        "16. Qxd5+ Kh8 17. Ne5": "Not gonna lie, I did miss Qxf5... I saw the mating pattern for the smothered mate, but totally overlooked Qxf5.",
        "17... Qxf5": "Yep..... it happened...",
        "18. g4": "g4, this was a mistake, because black could respond with Qc2, threatening my bishop, but I was already about 4 minutes down on time, so I rushed a little bit. ",
        "18... Qf4": "Ironically black missed Qc2...",
        "19. Nd7": "...and allowed my to play nd7 attacking the rook on f8",
        "19... Rfd8 20. Nb6": "My knight is dancing around a little bit",
        "20... Rc7 21. Rae1": "Getting my rook on the beautiful open file :D",
        "21... Bf6": "My dsb is making black feeling uncomfortable...",
        "22. Re4": "I ignored the bishop and played Re4 gaining initiative on the queen",
        "22... Qg5": "Hoping to exchange queens.",
        "23. Rfe1": "Doubling rooks on e file, black has a very very very weak back rank. My dsb is almost invincible at this point, black can't capture it, because his bishop is the only piece defending the queen.",
        "23... Qxd5": "Blunder!!!! why?",
        "24. Nxd5": "Because Nxd5 forking black's rook and bishop, I'm also threatening Re8+ at the same time.",
        "24... Ne5": "Ne5 preventing the check.",
        "25. Nxc7": "I thought the rook was for free, but totally overlooked Nf3+",
        "25... Nf3+ 26. Kf1 Nxe1": "After the game I had a good look at this position again and found out that Nd2+ would be better for black, because Nd2+, Kg2 (for example), nxe4, bxf6 threatening bishop takes rook, black could recapture my bishop with his knight just in time, that would equalized the game, but he made another blunder by playing Nxe1.",
        "27. Bxf6": "Instead of recapturing the knight, I played this in between move, bxf6, threatening the rook on d8. It was here that black resigned. I hope you enjoyed the game!"
    },
    "url": "https://gameknot.com/annotation.pl/a-pretty-tough-game?gm=57854",
    "gameName": "A pretty tough game!",
    "players": "superlalulalu  vs. anonymous ",
    "opening": "Philidor (C41), Steinitz variation"
}