{
    "moves": {
        "1. d4": "So here's a game  played against stargate2 where at first i was getting completely destroyed but then managed to win the game by forcing my opponent to resign. ",
        "1... d5 2. Nf3 Nc6 3. e3 g6 4. c4": "i maybe should have declined the gambit, but i was afraid white might push the pawn to c5, gaining alot of space.",
        "4... dxc4 5. d5": "this was a odd move, i didn't really know how to respond.",
        "5... Nb4": "and of course i chose the worst possible place to move my knight to. ",
        "6. Qa4+": "wins the knight here",
        "6... Qd7 7. Qxb4 Qxd5 8. Bxc4": "and now he takes the gambit pawn back, and gains tempo at the same time.",
        "8... Qd6": "i tried to get the queens off,to get a little break and develop in peace, without my queen being chased all the time.",
        "9. Qb3 Bg7": "this was a blunder because i didn't pay attention to the pressure on f7.",
        "10. Bxf7+": "another pawn lost, and I'm getting desperate.",
        "10... Kf8 11. O-O e6": "attacking the bishop now atleast.",
        "12. Rd1": "again my queen being chased.",
        "12... Qe7 13. Qd3": "i could have taken the bishop, but I'm not sure why i didn't.",
        "13... Bf6 14. Bxg6": "losing another pawn, and was thinking of resigning here.",
        "14... hxg6": "why he sacrificed his bishop, i don't know.",
        "15. Qxg6 Rh6": "chasing the queen once myself",
        "16. Qe4 Bd7": "This was another bad move, just giving up the pawn. I don't really know what was i doing in this game.",
        "17. Qxb7 Qe8 18. Qxc7": "another pawn lost, i actually clicked resign here, but decided not to confirm it yet.",
        "18... Bg5 19. Rxd7": "bye bye bishop, here i just decided to get mated.",
        "19... Rd8": "Here i knew the rook cannot move, because of back row check, and i decided to do everything i can to get the rook to move.",
        "20. Qc5+ Be7": "This was a decent move on my behalf, because attacking the queen, and queen cannot take because 21..... qxe7, loses the queen.",
        "21. Rxe7": "Here my opponent blundered badly, he bites the apparently \"lose\" bishop trap and i was reliefed to win this game.",
        "21... Rd1+": "and here white resigns, this was a very very bad game on my behalf, but i got lucky at the end and managed to win the game with last ditch effort."
    },
    "url": "https://gameknot.com/annotation.pl/a-rise-from-the-ashes?gm=52416",
    "gameName": "A rise from the ashes.",
    "players": "stargate2 (1268) vs. vavavi (1335)",
    "opening": "Queen's pawn game, Chigorin variation (D02)"
}