{
    "moves": {
        "1. e4 c5": "start of the sicillian",
        "2. Nc3": "here i was attempting to do something around the lines of f4 or the grand prix. ",
        "2... g6": "an attempt to move Bg7",
        "3. Nf3": "a better move might have been to do f4, and hope for a pawn break later on",
        "3... Nc6 4. a3": "not sure why i did this... I believe my plan was to do Bc4, and hold my position there, in case of a6, b5",
        "4... Bg7 5. Bc4 Nf6": "he's trying to castle, as well as attacking e4",
        "6. d3": "i ended that threat, as well as opening up my black bishop",
        "6... O-O": "king into safety",
        "7. O-O": "i repeat the motion",
        "7... d6": "opening up the white bishop. I believe his plan was Bg4, followed by Nd4... I did'nt want the bishop there, and also didn't want to move the g and h pawn (to prevent attacking taht.)",
        "8. h3": "blocks him... only concern right now... Nd4",
        "8... Re8 9. Re1 e6": "I'm trying to keep an open position for me... that's how I like my games",
        "10. Bd2": "unsure why i did this, a better move might have been Be3",
        "10... d5": "finally some actino\r\ntrying to conrol some of the center",
        "11. exd5 Nxd5": "i win a pawn, but he will equalize, with better position... observe. ",
        "12. Nxd5": "following his plan",
        "12... exd5 13. Rxe8+ Qxe8 14. Bxd5 Bxb2": "smart move",
        "15. Ng5": "an attempt to set up a trap... he can c right through it. ",
        "15... Be6": "Knight  can kill the biship and then move my bishop away.... however if i killed with knight, free rook on a1...",
        "16. Bxe6 fxe6 17. Rb1": "i was willing to exchange pawns,, but if i did,l then i end up with better position. ",
        "17... Bf6": "chose not to fall for trapping his Bishop, decided to counter, yet he forgot about my Bishop on D2...",
        "18. Rxb7": "end up with better position, ",
        "18... Bxg5": "??? why? bishop for knight? while down a pawn?",
        "19. Bxg5 Rb8": "an attempt to get rid of the Rook... I agree",
        "20. Rxb8 Qxb8 21. c3": "I wanted to stop Qb2... a really pathetic defense for my part",
        "21... Qe5": "pretty good move\r\nI move my bishop, and he gets a pawn... though i did have some traps for him",
        "22. Bh6": "practically stopped King progression... Kf7??? Qf3 and free knight\r\n",
        "22... Qf5": "figured out my plant to do Qf3, possible checkmate or free knight\r\nhowever, the queen as another diagonal of whites available....",
        "23. Qa4": "can't move his knight, or checkmate",
        "23... Qd5": "trying to get out of this crummy position, and protecting f3, however i chose to go up a square...",
        "24. Qf4": "possible checkmate on f8, and if he chose to move his knight, Qb8.... but i also had other options...",
        "24... Qf5": "desperate measure, queen trade... no thanks",
        "25. Qc7": "brilliant move.... checkmate in two moves almost no matter wat.... Qf7, Qc8, Qf8, checkmate next move... or one othre way.... which is also useless",
        "25... Qe5 26. Qc8+": "tadahahahaha checkmate next move",
        "26... Kf7": "can u c it?",
        "27. Qf8#": "and thats a wrap..... thanks for watching, and look for much more coming soon"
    },
    "url": "https://gameknot.com/annotation.pl/a-rollar-coaster-game?gm=23003",
    "gameName": "a rollar coaster game",
    "players": "Probe (1223) vs. Kevin (1596)",
    "opening": "Sicilian (B23), closed"
}