{
    "moves": {
        "1. e4": "Ahh, the kings pawn. This is the most common first move that I see by white.",
        "1... e5": "...Followed by the second most common response I see.(The most common being the sicillian.)",
        "2. Nf3": "This develops the knight, as well as attacks the e5 pawn. This is sound.",
        "2... Nc6": "Develops, while defending the e5 pawn.",
        "3. Bc4": "Develops, attacks the weak f7 square, as well as allows castling. I am growing to dislike this move though, since after Nf6, ..., Na5 the white bishop must die or move to a less-active square.",
        "3... Qf6": "It is said that moving your queen out early is bad. It ironically enough costs the game, although not immidiately. It should be noted that this move also prevents Nf6.",
        "4. O-O": "Why not?",
        "4... Bc5": "A good move. Adds a fourth attacker to d4, as well as puts presure to f2, and indirectly attacks the white king.",
        "5. c3": "Prepares a queen-side pawn storm, and prevents the knight and bishop advancing to b4 and d4.",
        "5... d6": "This allows Bg4, and adds a defender to the knight and pawn.",
        "6. a4": "This threatens b4, winning blacks DSB in the long run, unless black responds immediately.",
        "6... Bg4": "Develops, while pinning the knight. However, this loses his brother,(or would it be sister?) in the process.",
        "7. b4": "The bishop is dead.",
        "7... Bb6": "I don't like this. It allows the attacker to gain a tempo, and the piece is dead anyway.",
        "8. a5": "I press the pawn.",
        "8... Bd4": "...! This is actually a brilliant move, if black played correctly. I'll explain what I mean when black moves again.",
        "9. cxd4": "I take. \"It's a won Bishop\" --I thought. This move is a mistake. Maybe even a blunder.",
        "9... exd4": "And this is where black could have turned things around. If he would have taken with the knight, then my king would be put under heavy fire.",
        "10. d3": "This defends the pawn and bishop, as well as prevents d3, following Nd4.",
        "10... a6": "...? Black needs to develop. Also, one thing I was wondering, should black castle? If he castles queen-side, he's meet by a pawn storm. If he castles king-side, He's meet by Qb3. What do you think is best here?",
        "11. Bd5": "I was worried about b5, so I moved here.",
        "11... Nxb4": "This is a mistake. Do you see why?\n",
        "12. Bxb7": "The point of this move was quite clever. The point was not to win the pawn, or to attack the a8 rook, but rather, to allow the move Qa4, winning the knight.",
        "12... Rb8": "This move looks good...it moves to the open b file, attacks an undefended piece, as well as move out of attack of the bishop. But is it best? Black ends up losing a knight because of it, so I'm not so sure...",
        "13. Qa4+": "And there's the legendary move.",
        "13... Bd7": "The only way to still allow castling.",
        "14. Qxb4": "Naturally.",
        "14... c5": "This is wrong. It allows the queen to further invade the queen-side with Qb6.",
        "15. Qb6": "Which is exactly what I do.",
        "15... Bb5": "Again, I must say this is wrong. It loses the b8 rook.",
        "16. Bc6+ Ke7": "...?! I was surprised to see this! I expected Bxc6",
        "17. Qc7+": "The white king is running out of air.",
        "17... Ke6": "This loses instantly. I would have moved to Kf8, but I think this loses too...",
        "18. Bd5#": "And Checkmate! Please rate, subscribe and leave your comments below!"
    },
    "url": "https://gameknot.com/annotation.pl/a-screwed-up-game?gm=47303",
    "gameName": "A Screwed-Up Game",
    "players": "johnsmith95 (1209) vs. saturnguitars (1231)",
    "opening": "King's pawn game (C50)"
}