{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Bb5 a6 4. Ba4 Nf6 5. O-O Be7 6. Re1 b5 7. Bb3 O-O 8. c3 d5": "8. ...d5!? The Marshall Attack!",
        "9. exd5 Nxd5 10. Nxe5 Nxe5 11. Rxe5 Bb7": "11. ...Bb7?! doesn't work properly. Better is to defend the knight with the c pawn (11. ...c6). With 12. Qf3 White bring the match in his favor. It works also 12. d4 (as in the game). In GK database only 60 times over about 1100 Marshall Attacks, at this point, Black played 11. ...Bb7. ",
        "12. d4 Re8 13. Nd2 Bf6 14. Re1": "Maybe is better to exchange the rooks (14. Rxe8+) to gain a development move. The spirit of the Marshall is to open the game and play a pawn sacrifice for mobility and development. In this game Black didn't play at 100% and White could regain time, remaining with a pawn up.\n\nAfter 14. Rxe8+ Qxe8 the Black queen in e8 needs a second move to find a better place.",
        "14... Qd7 15. Nf3 Nb6 16. Bf4 Re7": "With the obvious idea to double the rook on the e file. Maybe better is to exchange rooks (16. ...Rxe1+) or play something more active, like 16. ...Bd5 or 16. ...Nc4. The game however is still balanced, even if uncomfortable for Black.",
        "17. Qd3 Rae8 18. Bc2": "With a mate threat...",
        "18... g6": "Also 18. ...Be4 works. Is a tactic line, but doesn't ruin the castle. 18. ...Be4 19. RxBe4 RxRe4 20. Ne5 (attacking the queen) ...Bxe5 21. Qxe4 Bxf4 22. Qxf4. The material is almost balanced and White and Black can play for win.",
        "19. Rxe7 Qxe7 20. Re1": "20. Re1?? The decisive error! This move doesn't threat the Black queen, but permits the win of a piece. Do you see how?",
        "20... Qxe1+": "Yes, of course! 20. ...Qxe1+ and White escapes from mate only because the queen on d3.\n\nThe following are all forced moves.",
        "21. Nxe1 Rxe1+ 22. Qf1 Rxf1+ 23. Kxf1": "A critical moment. Now Black is winning, having a knight for a pawn lost in the opening with a sacrifice. He has to improve the position, attacking the weaknesses of White, searching for exchanges and promote a pawn... easy, right?",
        "23... Nc4": "Attacking b2...",
        "24. b3 Nd6": "Hoping for 25. Bxd6 cxd6. Black has to search simplifications, and more, with the b pawn pushed, now c3 is a strategic goal.",
        "25. g4": "Maybe the queenside is the place where White has more chances. This move gains space, but weakens the pawn structure.",
        "25... Be4": "Black search exchanges even at the cost of a pawn! 26. Bxd6 Bxc2 27. Bxc7",
        "26. Bd1 g5 27. Bg3 Be7": "Defending the knight one more time and freeing the path for the f pawn. ",
        "28. f3 Bd5": "Maybe better is 28. ...Bb1",
        "29. Be2 h6 30. h3 Kf8": "Now that the kingside is stable, Black king starts the long march towards the queenside. The first step is to defend the weak pawn structure and after try to win a pawn, helped by the bishops and the knight.",
        "31. Kf2": "I think that this was this the first time biletnikoff ask me a draw. He couldn't see progress for me. I obviously rejected.",
        "31... Ke8 32. Kg2": "Another draw offer.",
        "32... Kd7 33. Kf2 f5": "Now the c pawn is protected by the king, and Black try to separate White pawns. ",
        "34. Bd3 f4": "A decisive gain of space! The White darksquare bishop is out of the game.",
        "35. Bh2 Nb7 36. Bf5+ Be6 37. Bxe6+ Kxe6": "Now the position is even more clear, and White ask for a draw again. ",
        "38. b4": "This move helps Black. Pushing a pawn without the support of the king is not a good idea and, even more, it creates a hole for Black pieces.",
        "38... Kd5 39. Ke2 Kc4": "Now Black king reaches a very comfortable position. The only White pieces which can move are the king and a blockaded bishop.",
        "40. Kd2 a5 41. a3 axb4 42. axb4 Nd6": "Now the Black knight starts a long manoeuvre towards the squares behind the enemy lines. There is also the possibility to sacrifice a piece for two pawns. But Black play with calm.",
        "43. Bg1 c6 44. Kc2 Nc8 45. Bf2 Nb6 46. Be1 Na4 47. Bd2 Nb6 48. Be1 Nd5 49. Bd2": "Note that the White position is totally passive. He can do nothing, but wait the end.",
        "49... Bd6": "This move loses time. This is the only function of the bishop. \n\nWhat Black wants is 50. ...Ne3, 51. ...Nf1, 52. ...Nh2, 53. ...Nxf3. He doesn't want 50. BxNe3 instead, but this capture would be totally winning for Black. So this Black move it's not necessary. \n\nNote however that Black can lose times because White can only wait.",
        "50. Be1 Ne3+ 51. Kb2": "This move permits Black king to reach the kingside...",
        "51... Ng2": "...but Black is thinking about a knight move, so he doesn't consider too much 51. ...Kd3. \n\nAt this point Black changes idea. 51. ...Ng2. If White plays 52. Bf2 then 52. ...Ne3 again. White wants to see if White gets wrong.",
        "52. Bd2 Kd3": "And now it's simply over. ",
        "53. Kc1 Ne3 54. Be1 Ke2 55. Bd2 Kxf3": "And the passed pawn would be decisive. This game demonstrate how to press the opponent when there is a concrete advantage, even if not so evident. \nNote finally that the Black bishop is able to leave the board without affected the Black play!\n\nI want to thanks biletnikoff for the game and encourage everyone to play slow pressing manoeuvres when our opponent cannot do anything. "
    },
    "url": "https://gameknot.com/annotation.pl/a-slowly-press?gm=26074",
    "gameName": "A slowly press",
    "players": "biletnikoff (1598) vs. metalale (1638)",
    "opening": "Ruy Lopez (C89), Marshall counter-attack, 11...c6"
}