{
    "moves": {
        "1. d4 Nf6 2. Bf4 h6 3. Nf3 e6 4. h3": "Weak move, but not disastrous. ",
        "4... d5": "Better was c5 at once, in my opinion, taking advantage of the unmoved e2. ",
        "5. g4": "Well, I have to justify my previous move, and this is fully in the spirit of the London \"myway\". ",
        "5... Bd6 6. Ne5": "The key move of this plethora of lines. ",
        "6... O-O": "Carelessly castling into the enemy's fire. How can black omit his lack of developement on the queenside - the safest side for his king, by far...",
        "7. g5": "Eat this, then!",
        "7... hxg5": "Eaten!",
        "8. Bxg5": "Not a nice bind for black, but still not lethal. Nd7 was dued. ",
        "8... Be7": "Black plans to exchange minor pieces. But I will allow this for a price. ",
        "9. h4": "Open the h column. Will you be so kind?",
        "9... Ne4": "It seems he is. ",
        "10. e3": "Be welcomed. ",
        "10... Bxg5 11. hxg5 Qxg5": "Wow, what a nice position for the queen... and I can't move Qh5 to threat something on the h column, right? Was I so dull?",
        "12. Rh5": "No. This was the plan. And no matter if white goes...",
        "12... Qg1": "...which he did, because this just givesme tempo to...",
        "13. Qf3": "...getthe queen into the game. Now I wasn't so sure about the following, I must be sincere. But It doesn't look bad for white: strategically, the game is won: clear lines against his king are open. Only a very delicate defence can save him, and who will play a defence as black to get into this?",
        "13... Ng5 14. Qf4": "No hurry. Repositioning my queen while avoiding a forced exchange is all I need... provided I can survive the near explosion of the black queenside, with Nd7. But look: f6 (the kicking move) is not possible due to Ng6, threatening mate Rh8#. White's position is stronger move by move. ",
        "14... Nh7": "Would g6 have been a solution? I would have answered Rh6, calmly...",
        "15. Qh4": "Now this is very strong. ",
        "15... g5": "! Very smart defence by black! I hadn't see it, anyway. But I have the solution. ",
        "16. Qh3": "This is so \"zenlike\"...",
        "16... Nd7": "Too late. Black is already lost. If g4, Qh4, and if g3, Nd3, and black can't avoid a sequence similar to the game's. ",
        "17. Rxh7 Nxe5": "Nf6 has exactly the same result - a very sneaky attack!",
        "18. Rh8+ Kg7 19. Qh6#": "Once in a hundred times, you feel like Tal :-D"
    },
    "url": "https://gameknot.com/annotation.pl/a-sneacky-attack?gm=52925",
    "gameName": "A sneacky attack",
    "players": "damalfi (1790) vs.  (2100+)",
    "opening": "Queen's pawn game (A45)"
}