{
    "moves": {
        "1. d4": "Hi everyone!\r\n\r\nAfter the last match against Master Freddy at least I knew one thing!  I couldn't do much worse against him could I?  Well, if you are a fan of the eighties pop group Yazz you will know that \"The Only Way is Up, Baby .......\"\r\n",
        "1... f5": "2. ....... f5 - Well, this game, although I eventually lose it, is a bit of an improvement.  First of all, Freddy does not give me a head start, at least I think he doesn't!  He kicks off with 1. d4 and I respond with f5, the Dutch Defense.  Now the reason I decided to go Dutch is the buzzword \"Stonewall\".  I like it, because that, I feel, is the best way to deal with the Master Mater - Stonewall him!!!!!",
        "2. Nc3 d5 3. Bf4 c6 4. h4": "4. h4 - I am beginning to get accustomed to Freddy's little pawn pushes down that h file.  Watch out for that one.  The purpose of this is, if I put a pawn on g6 he will play h5, undermining that pawn chain one way or another.",
        "4... Nf6 5. e3 e6": "5. ....... e6 - and here is a Stonewall formation.  I think the downside of this though is that Fou Leblanc becomes a bad bishop.  I have an uneasy feeling of deja vu here.  I played the Dutch against Ion and I lost that game due to Fou Leblanc's severely restricted movements.",
        "6. h5": "6. h5 - discouraging g5 - see my previous note.",
        "6... Bd6 7. Qf3 Qc7": "7. ...... Qc7 - after developing Fou Lenoir to d6 to dispute the control of the h2-b8 diagonal, I decide to reinforce this control by moving Glenda to c7 and therefore a trade of dsbs will be forced.",
        "8. h6 Bxf4 9. hxg7 Rg8": "9. ...... Rg8 - I \"lose\" the g7 pawn but will get it back next move.  There is no time to realise my piece for pawn advantage because my rook on h8 is en prise.  I cannot now castle kingside and I must rack my brains as to how to clear the decks for Henry to go queenside.  I have a hunch that Freddy is gonna put his king there ........",
        "10. exf4 Rxg7 11. Nh3 Qe7 12. O-O-O": "12. 0-0-0 - ....... he does!",
        "12... Nbd7": "12 ..... Nbd7 - I now plan to follow suit but I have work to do.  Step 1, develop the knight.",
        "13. Ng5 Nf8": "13. ....... Nf8 - step 2 - clear d7 for Fou Leblanc and add protection to the weak e and h pawns after Freddy moved his knight to g5 attacking them.",
        "14. g3 Bd7": "14. ...... Bd7 - step 3 - Fou Leblanc moves to d7 clearing the way for Henry to castle queenside.  Will he be safe there?  Fingers crossed!",
        "15. Qe3": "15. Qe3 - more pressure on that weak e6 pawn.",
        "15... Qd6": "15. ....... Qd6 - moving Glenda out of the way of a possible pin should Freddy line up his heavies on the e file.",
        "16. Na4 O-O-O": "16. ......... 0-0-0 - I now put Henry on the queenside, Freddy did query after I played the move why I did not play Ne4.  I just wanted to get Henry clear of that e file.  See my previous note as to why I moved Glenda to d6.",
        "17. Nc5 Kb8": "17. ...... Kb8 - a precautionary move to protect a7, but I wonder whether I should have played Ne4 here.",
        "18. Rd3": "18. Rd3 - something tells me that I allowed Freddy a tempo here.  Jury, would you give my last move a question mark?",
        "18... Ne4 19. Rb3 Nxc5 20. dxc5": "20. dxc5 - knight trade.",
        "20... Qc7 21. Nf3": "21. Nf3 - heading for e5 perhaps?",
        "21... Bc8 22. Ra3 Ka8 23. Be2": "23. Be2 - Freddy completes his development and clears the way for a rook to come to a4.  Can I stop this, though?",
        "23... Re8 24. Ne5 Nd7 25. Kb1": "25. Kb1 - mmm, what is this king move about, is Freddy playing Cat and Mouse?",
        "25... Nxe5 26. fxe5": "26. fxe5 - knight trade - at least I do not have Freddy's horsies to contend with but that white prelate is gonna be turbulent!",
        "26... Qb8 27. Rh4 a6": "27. ...... a6 - this pawn is easier to defend on this square by a low value unit methinks!  I also want to give Freddy as little room as possible to put his heavies on that a column.",
        "28. Rb3 Qc7 29. Rb6": "29. Rb6 - a pile up on the b column now!",
        "29... Ree7 30. Ra4 Qd8 31. Qb3 Qc7": "31. ...... Qc7 - I can do little room but shuffle my heavies around, now be prepared for big action!",
        "32. Bxa6": "32. Bxa6 - first a pseudo bishop sac.",
        "32... bxa6 33. Rbxa6+ Bxa6": "33. ..... Bxa6 - forced.",
        "34. Rxa6+ Qa7": "34. ...... Qa7 - forced.",
        "35. Qb6": "35. Qb6 - a horrible move.  Rxa7 at once just gives Freddy Q+P for the 2 rooks, but this move will net the c6 pawn as well and worse give that Wicked Witch of the West total queenside control.",
        "35... Qxa6 36. Qxa6+ Kb8 37. Qxc6": "37. Qxc6 - voila!",
        "37... Rg6 38. Qd6+ Rc7": "38. ........ Rc7 - forced to avoid losing further wood.",
        "39. b4 Kb7 40. b5": "40. b5 - a deadly pawn push.  I now decide to throw in the sponge as I will have to give up my rook to avoid at least one of those queenside pawns from crowning.  The game lasts precisely 40 moves.  At least my Joblock defense prevented me from copping Old Matey, which is a step in the right direction.  Next time let us hope that I can avoid incurring any damage!"
    },
    "url": "https://gameknot.com/annotation.pl/a-step-in-the-right-direction?gm=23827",
    "gameName": "A Step In the Right Direction",
    "players": "easy19 (2228) vs. jstevens1 (1784)",
    "opening": "Dutch, Spielmann gambit (A80)"
}