{
    "moves": {
        "1. e4 c6": "Hi everyone!\n\nI am just annotating this game on behalf of Brigadecommander (Janet) and Pitroque.  Pitroque lost this game and I am just playing through how it happened.  I will now talk you through the Caro-Kann Defense.",
        "2. d4 d5": "2. ..... d5 - as with the French Defense (e6) black's second move is almost always d5.",
        "3. Nc3 dxe4 4. Nxe4 Bf5 5. Ng3": "5. Ng3 - Pitroque chooses to retreat his knight and attack the f5 bishop, but would a developing move such as e3 been better?",
        "5... Bg6 6. h4 h6": "6. ..... h6 - Janet creates a flight square for her bishop so that it can bear down on the h7-b1 diagonal.",
        "7. Nf3 Nf6 8. Ne5": "8. Ne5 - not too sure about this - I think white may have again been better served to play Be3, a developing move and to neutralise the power of Janet's light square bishop.",
        "8... Bh7 9. Bd3": "9. Bd3 - now he plays it!",
        "9... Bxd3 10. Qxd3": "10. Qxd3 - and now the bishops are traded off and the WQ is on a pretty good diagonal.",
        "10... Nbd7 11. f4": "11. f4 - white wants to support his knight on e5.",
        "11... e6 12. Bd2": "12. Bd2 - development and clearing the decks for castling either side.",
        "12... Be7 13. O-O-O O-O": "13. ..... 0-0 - as with the Myevilluck/Klauno game, both sides elect to castle on opposite wings.  We shall see who wins the race here.",
        "14. Qf3 Qc7 15. Rhe1": "15. Rhe1 - giving further support to that steed on e5.",
        "15... Nd5": "15. .... Nd5 - suddenly, activity in the black camp!",
        "16. f5 Bxh4 17. Qg4": "17. Qg4 - threatening Bxh6.",
        "17... Nxe5 18. Qxh4 Nc4 19. Bxh6 gxh6 20. Qxh6": "20. Qxh6 - here it all goes wrong because Pitroque has unfortunately left his g3 knight en prise to the BQ.  Worse, the BQ now controls the h column, preventing Pitroque from getting at least a draw by Perpetual Check.",
        "20... Qxg3 21. Kb1 Nce3": "21. ..... Nce3 - drums beat!  In come the black cavalry and white's rook on d1 is en prise.",
        "22. f6": "22. f6 - maybe Rh1 was better, at least it would have put Janet in Old Matey's shadow!",
        "22... Qg6 23. Qh4 Qxc2+": "23. ..... Qxc2+ ..... aargh and double aaargh for white, his rook on d1 is a gonner.",
        "24. Ka1 Nxd1 25. Qg4+ Qg6 26. Qxd1 Rfd8": "26. .... Rfd8 - white's attack has run out of steam and not only that, has an 8 point material deficit to contend with against such a strong Master as Janet.  White therefore gracefully resigns on the grounds of Ruinous Loss of Material.  Commiserations and good effort here, Pitroque - you got her worried!  Kind regards - Joanne"
    },
    "url": "https://gameknot.com/annotation.pl/a-strong-attack-from-pitroque-but-alas-not-quite-strong-enough?gm=48394",
    "gameName": "A strong attack from Pitroque, but alas, not quite strong enough!",
    "players": "ptitroque (1651) vs. brigadecommander (2232)",
    "opening": "Caro-Kann (B19), classical, 7...Nd7"
}