{
    "moves": {
        "1. e4": "The King's Pawn opening.",
        "1... c5": "Before I knew anything, I'd prefer a symmetrical game with ... e5, but the database thinks that the Sicilian Defense is better, and I'm always trying to learn something new anyway.",
        "2. Nc3 Nc6 3. Bc4 e6": "Blocking White's lsb, but also Black's lsb (who will interestingly survive till the endgame). Black's lsb has ways of getting out, but now if White tries to reposition his lsb, he loses tempo. (See move 7) Was 3.Bb5 better, since this gives Black an excuse to make a move he would probably make anyway?",
        "4. Nf3 Nf6 5. O-O d5": "I don't like closed positions, and I tried to grab some space while I can do it safely.",
        "6. exd5 exd5": "When you look at the board now, it seems that Black is almost ahead in terms of development, with his pawns grabbing at the centre (except that he hasn't castled yet).",
        "7. Bb5": "See what I told you about tempo?",
        "7... Bd7 8. Bxc6": "The White bishop took 3 moves only to exchange with a Knight who got there in 1 move. Tempo-wise, things are looking bad for White, though he is by no means behind.",
        "8... Bxc6 9. Re1+": "Rook on the open file.",
        "9... Be7 10. d4": "A better idea, by tempting Black to isolate his center pawn. Subsequent pressure may even win it eventually.",
        "10... O-O": "? Now if 11.dxc5, White has successfully isolated Black's pawn. Though the following ... Bxc5 yields a powerful outpost for the Black dsb, pointing at the White King, 12. Na4 can shoo him away, although taking the Knight away from the action. 11.dxc5 was possible here, I think.",
        "11. Bg5": "Pinning the Knight, pressuring the e-file.",
        "11... b6": "I decided to bolster the center and also leave out any possibility of an isolated central pawn (though it will be a pawn island, now if Black takes).",
        "12. Ne5": "Threatening to win the lsb and force at least one more exchange afterwards (by forking the Queen and dsb)",
        "12... Bb7 13. Bxf6": "I'm not sure about this one, I think exchanging a Bishop for a (pinned) Knight in an open position is not a good idea. This extinguishes White's own attack.",
        "13... Bxf6 14. Ng4": "A good idea to reposition the Knight, but the d4 pawn is hanging. This is the first major mistake by White to lose a pawn so cheaply.",
        "14... Bxd4 15. Qf3 Bxc3": "This might go against all I have been saying about Bishops and Knights, but it liquidates (good idea when you're ahead in material) and I need that d4 move soon if I am to open the long diagonal for my other Bishop.",
        "16. Qxc3 d4 17. Qg3": "Uh-oh. Not that I can see any tactical opportunities, but a forward Knight move by White seemed disconcerting at the very least.",
        "17... Qg5": "Now I pin the Knight (if he wants to keep the Queens on the board).",
        "18. Re5 Qg6 19. f4 f5": "20. f5 would mean trouble, trouble, trouble.",
        "20. Nf2": "Well there is nowhere for the Knight to go otherwise, and this takes the Queens off, bad for White. Perhaps Re1-Rc7 or Rb7 was better for White?",
        "20... Qxg3 21. hxg3 Rae8 22. Rae1": "White is trying to look offensive, but there is no short way of getting the Knight into action.",
        "22... Bc6 23. g4 g6 24. g5": "Restraining Black's lsb. White may be out of ideas at this point, perhaps.",
        "24... Rxe5 25. Rxe5 Kf7 26. Nd3 Re8 27. Rxe8 Bxe8": "Taking with the King seemed to keep His Majesty far from the action.",
        "28. Kf2 Ke6 29. Ne5": "And the Knight is finally on a powerful outpost. I was beginning to fear what might happen on the Kingside, and the Queenside, the side with my material advantage, didn't seem too promising with his Knight there.",
        "29... Kd5 30. Ke2": "I was expecting 30. Kf3 here, since that keeps my King stuck behind.",
        "30... Ke4": "Marching on and threatening the pawn. The next move is virtually forced, if 31.Nd3, 31 ... Bb5 forces White's only hope off the board.",
        "31. g3 Bb5+ 32. Kf2 c4 33. c3 dxc3 34. bxc3": "Seemingly blocking my Bishop, but only if the Knight stays there.",
        "34... a5": "My plan was to retreat the Bishop with ... Be8 and then march the pawns together.",
        "35. Nf7": "Perhaps White was already losing here, but this basically finishes the game. That Knight was restraining the Bishop and the King from there, but the useless move Nf7?? unleashes both of them. Out of ideas, for White it is game over now.",
        "35... Kd3 36. Nd6": "Trying to get back into position with tempo, but there is nowhere the Knight can go from here.",
        "36... Bc6 37. Nc8 b5 38. Nb6 Kxc3 39. Ke3 Kb2 40. a4": "A final glimmer of hope for White. if 40 ... bxa4?? 41. Nxc4+ Kc3 (to prevent a later King invasion) 42.Nxa5 and the Bishop has to move. This gives White better odds, though not much.",
        "40... c3": "Not falling for it, though, and there is no way he can stop promotion now.",
        "41. axb5 Bxb5 42. Kd4 c2 43. Nc4+ Bxc4 44. Kxc4 a4 45. Kd5 c1=Q 46. Ke6 Qe3+ 47. Kf6 Qxg3 48. Kg7 Qxf4 49. Kxh7 Qxg5 50. Kg7 Qe3 51. Kxg6 f4 52. Kg5 f3+ 53. Kg4 f2 54. Kh4 f1=Q 55. Kh5 Qf5+ 56. Kh4 Qef4#": "Final position."
    },
    "url": "https://gameknot.com/annotation.pl/a-successful-sicilian?gm=32127",
    "gameName": "A Successful Sicilian",
    "players": "fgaray (1272) vs. goflb (1161)",
    "opening": "Sicilian (B23), closed, 2...Nc6"
}