{
    "moves": {
        "1. c4": "My 3rd annotation and this was a particularly painful loss as I had a solid advantage but lost due to my tactical inferiority and a lack of confidence that I could play a game equal to an opponent 200 rating points better than me.  He starts with an English opening.  I don't know much about defending the English opening.\n\nAs always, comments/criticism is welcome.",
        "1... Nf6": "So I go with a non-committal opening move.",
        "2. Nc3 g6": "I like to fianchetto, so I think initially plan to do so here.",
        "3. Nf3 c5": "Then I decide against it and attempt a more direct assertion of my claim to the center.",
        "4. e4 d6 5. d4 cxd4": "I want to attack the center before my opponent is too entrenched there.",
        "6. Nxd4 a6": "I made this move to keep his knights out of b5.  I don't know that he planned on going there or why I thought he might, but that was my thinking all the same.",
        "7. Be2 Bg7": "There's the fianchetto.  ",
        "8. Be3 Nbd7 9. O-O O-O 10. f4 e5": "Again, I'm asserting a claim to the center.",
        "11. Nf3 Ng4": "I was hoping to take the Bishop while adding a defender to e5.",
        "12. Qd2 Nxe3": "Exchange time.",
        "13. Qxe3 exf4": "Here, I fully expected that my opponent would move his Queen away from f4 and certainly not take f4 as that would permit Qb6+ and either his Bishop or Knight would be likely to fall as well but...",
        "14. Qxf4 Qb6+ 15. Kh1 Qxb2 16. Nd5 Qxe2 17. Rae1 Qxc4": "I'm feeling good about myself as a person and as a chess player right about now.  ",
        "18. Qxd6": "Still no need to be alarmed...I can handle this.",
        "18... h6": "I realized that to chase his Q and N away, I had to get my K out of forking possibility.  I can't explain why I didn't go directly to h7.",
        "19. e5 Kh8 20. Ne7 Kh7 21. h4 Qe6": "I will happily exchange Queens.",
        "22. Qb4": "He won't.  It was around here that my opponent offered me a draw.  I didn't take it.  I believed I was ahead but more importantly, I figured I not going to learn by taking the draw.  Even in the end, I'm glad I refused it.  My opponent informed me once I refused it that he only offered it because he liked my position better.  This is when my self-doubt kicked in.  ",
        "22... b5 23. h5 Re8 24. hxg6+ fxg6 25. Nxc8 Raxc8": "I'm still feeling good about life at this point.",
        "26. Qh4 Qe7": "Ready to exchange Queens again.",
        "27. Qg3": "nope.",
        "27... Rc5 28. e6": "It's here where I begin to falter.  I start reacting to his moves rather than sitting back and formulating my plan of attack.  Wouldn't it have been nice if I'd have gone Rh5+?  ",
        "28... Nf6 29. Ne5": "I now have to stop the attack on g6.",
        "29... g5 30. Qd3+ Kg8 31. Nd7 Rc7": "Rc7???  React, react, react!  Again, why did I not sit back and begin developing a plan rather than just react.  Rc7 is bad...watch what happens.",
        "32. Nxf6+ Bxf6 33. Qg6+": "I have invited evil into my home.  This can't end well.",
        "33... Qg7": "I give away my rook.  It's not pretty to watch someone decompensate.",
        "34. Qxe8+ Kh7 35. Rf3 Re7 36. Qc6 Qg6 37. g4 Bg7 38. Qd6 Bf6": "I really can't find a way out of this.",
        "39. Qxa6 Bg7 40. Qd6 Qe8 41. Kg2 b4 42. Kf2 Bf8 43. Qd3+ Kh8 44. Qf5 Bg7 45. Rd3 Qc6 46. Rd8+ Re8 47. Rxe8+ Qxe8 48. Qf7 Qxf7+ 49. exf7 Kh7": "It would have been better to move Bf8 here and then perhaps Kg7.",
        "50. Re8": "I resign, knowing for one brief moment, I held the advantage.  And no, those aren't tears--it's just very dusty next to my computer."
    },
    "url": "https://gameknot.com/annotation.pl/a-tactical-disaster?gm=23760",
    "gameName": "A Tactical Disaster",
    "players": "justmejoe (1786) vs. untateve (1567)",
    "opening": "English opening (A16)"
}