{
    "moves": {
        "1. e4": "This is my first annotation.  It's a very fast and furious game; I'm reading Vladimir Vukovic's The Art of Attack, which was a huge influence on my play around focal points in this game.  ",
        "1... c5 2. Nc3 d6 3. f4": "The Sicilian Grandprix.",
        "3... Nf6 4. Nf3 g6 5. Bb5+": "The logic behind this move is explained in Lev Alburt's \"Chess Openings for White, Explained\".  ",
        "5... Bd7 6. Bc4": "This might look like a waste of a move, but black's bishop is better placed on c8, because now d5 is harder to get in due to the blockage of the black queen.  Therefore, black's move is worse than a waste of a move!",
        "6... Bg7 7. O-O a6": "Ineffective.",
        "8. a4": "Gives me more room on the queenside and stops the b5 advance.",
        "8... Bc6": "Forces me to make a good move.",
        "9. e5": "This pawn thrust is key to the Grandprix strategy.  f7 becomes even more of a target square than before, since I will be able to open the f-file shortly.  This leads to some crazy tactics later!",
        "9... dxe5 10. fxe5 Nd5 11. Ng5": "Takes aim at the two focal points on f7 and h7.  ",
        "11... O-O 12. Qg4": "Sacrificing a pawn!  What justifies this?  Pressure against h7 and f7.  Since next move my opponent will be forced to defend against my mating threat, f7 will become even more vulnerable.",
        "12... Bxe5": "Takes the bait.",
        "13. Qh3": "Basic threat.  Easily countered, right?",
        "13... h5 14. Rxf7": "!!!  How is it justified?",
        "14... Rxf7 15. Qe6": "I will maintain intense pressure on f7 until I not only regain all of my lost material, but gain more than I had before I started sacking.  The knight on g5 ensures the threat is great enough to stop him simply giving me back the material and equalizing.",
        "15... Bd4+": "Looking for something that's not there.  My king won't be in danger of mate unless the rook on f7 is free to move, which it never will be.",
        "16. Kh1 Qf8 17. Nxd5": "Working towards giving my c4 bishop access to the deadly a2-f7 file.",
        "17... Kg7": "Forces my next move.",
        "18. Nxf7": "My payoff is fully visible now. ",
        "18... Bd7": "If instead 18...Qxf7, then 19.Qxf7+ Kxf7 20.Nc7+, gaining a rook and securing the game.",
        "19. Ng5": "A cute little tactic.",
        "19... Bxe6 20. Nxe6+ Kg8 21. Nxf8 Kxf8 22. Nc7": "Setting up a hopeful mate on h6; I can win if he doesn't fall for it, but it would be pleasing aesthetically.  ",
        "22... Ra7 23. d3 Kg7": "Nope.  :)",
        "24. Ne6+ Kh7 25. Nxd4 cxd4 26. Bg5 Nc6 27. Rf1 b6 28. Rf7+ Kh8 29. h4": "With the last chance for a back rank mate for black gone, my opponent resigns."
    },
    "url": "https://gameknot.com/annotation.pl/a-tactical-melee?gm=49574",
    "gameName": "A Tactical Melee",
    "players": "nynaeve95 (1658) vs. hrle (1597)",
    "opening": "Sicilian (B23), closed"
}