{
    "moves": {
        "1. d4 h6": "Not a very inspiring move and usually an opponent that plays like this denotes either a beginner or someone that is strong player but who avoids opening theory. More often than not, it's usually the first case but in this game it would prove to be the latter.",
        "2. e4": "Occupying the center in accordance to chess theory.",
        "2... e6": "It looks like Black is aiming for a French defense but with an early h6.",
        "3. c4": "Trying build a strong pawn center with cxd5 in case Black plays d5.",
        "3... d5": "Which he does.",
        "4. cxd5 exd5 5. e5": "The center has been fixed now and the structure is something similar to the French but slightly better for Black because his LSB isn't hemmed in by its own pawns.",
        "5... Bb4+ 6. Nc3 Ne7 7. a3": "Trying to win the Bishop pair and strengthen my center pawn chain.",
        "7... Bxc3+ 8. bxc3 O-O": "Black has castled early and he is now poised to strike at my center.",
        "9. Rb1": "9.Bd3 doesn't stop 9...Bf5 so I played this to delay Black a little longer from developing his Bishop.",
        "9... Nbc6": "Black is no hurry to play c5, he can develop his pieces to nice, active squares without having to bust up the center first.",
        "10. Bd3": "Now that the immediate Bf5 can't be played I developed my LSB to its best possible place.",
        "10... b6": "Blunting out the Rb1, preparing for a future c5 and planning to play Bf5 on the next move.",
        "11. Qc2": "So I delay my Knights development in order to stop Bf5.",
        "11... f6": "But Black can make use of his better development and play it anyway.",
        "12. f4": "This looks risky since the f-file will be open and I will have difficulties castling but holding the center intact is much more important.",
        "12... fxe5 13. fxe5 Bf5": "Finally gets to play Bf5 and exchange my best light piece. Now after the forced Bishop swap my advantage is almost non-existent. Black has solved all the opening problems and equalized fully.",
        "14. Ne2": "Delaying castling again, which would have been possible sooner after 14.Nf3, but the best place for the Knight is f4 and that's where it's heading.",
        "14... Bxd3 15. Qxd3": "Now the white central squares are very weak and can be exploited wonderfully by Black's Knight pair.",
        "15... Qd7 16. Nf4": "Controlling the blockade of the e-pawn and closing the f-file so I can castle.",
        "16... Nd8": "As soon as I get an active piece, Black finds a piece to exchange it. The c-pawn is also free to advance now.",
        "17. O-O Ne6": "Knights are the best blockaders and my opponent no doubt knows this so he opposes my active Knight with his blockading one.",
        "18. Rb2": "Not a very inspiring move but I wanted to activate this Rook without moving the Bishop which will be used to recapture in one move on f4.",
        "18... c5": "The center is under tension again. Notice that all of my central pawns are on dark squares so my Bc1 won't be a very active piece in both the middlegame or the ensuing endgame.",
        "19. Rbf2": "Doubling Rooks and seeming creating some threats by use of the discovered attack of the Nf4.",
        "19... Nxf4": "So Black cuts the Gordian knot and prepares another blockade.",
        "20. Bxf4": "I didn't want to exchange too many pieces, especially Rooks since in a Queen ending, Black's Knight would be much better than my Bishop.",
        "20... Qe6": "Black is now ready to play c4, fixating the pawn chain so that I will end up with a bad endgame Bishop.",
        "21. Qa6": "Threatening dxc5 and putting pressure on the a7 pawn, trying to prevent Rook exchanges.",
        "21... Qc6": "Removing both threats in one move. Now I have to exchange some pieces if I'm to make any headway.",
        "22. Be3": "Renewing the threat of dxc5 and clearing the f-file.",
        "22... Rxf2 23. Bxf2": "It looks like an unnatural recapture but I wanted to reroute the Bishop to a better diagonal and also remove it from being hit by the pawn in case Black recaptures in the center. Black can't activate his Rook anyway because of dxc5.",
        "23... Ng6": "Preparing to bring the Knight to the best blockading square, e6.",
        "24. dxc5": "Here I made a small miscalculation. Now after Black takes my e-pawn I don't have anything to play for.",
        "24... Nxe5 25. Bd4": "Here I expected 25...bxc5 26.Qxc6 Nxc6 27.Bxc5 with a slightly better endgame for White. But instead, Black made the best move and kept equality on the chess board.",
        "25... Nc4": "Now 26.cxb6 isn't possible since 26...axb6 traps the Queen.",
        "26. Re1": "A pretty bland move but I was a little disappointed with the outcome of the events.",
        "26... Re8": "If I don't exchange, Black plays Ra8 and I'm left without an active plan.",
        "27. Rxe8+ Qxe8 28. h3": "Covering the back rank mate.",
        "28... bxc5 29. Bxc5": "Neither side can really win this. Black might have a small edge due to his better piece coordination but certainly not enough to create serious winning chances.",
        "29... Qe1+ 30. Kh2 Qe5+ 31. Kg1 Qxc3 32. Qe6+ Kh7 33. Qf5+ Kh8 34. Qxd5": "Two more pawns are exchanged the draw becomes more and more clear. Both sides probe a little more but nothing can be really done.",
        "34... Qe1+ 35. Kh2 Nd2 36. Qd8+ Kh7 37. Qd3+ Kg8": "After 38.g3 a5 39.Bd4 Nf1 40.Kg2 Qd2+ 41.Qxd2 Nxd2 42.a4 Nb3 43.Bc3 Nc5 44.Bxa5 Nxa4, there is nothing left to play for."
    },
    "url": "https://gameknot.com/annotation.pl/a-tense-struggle?gm=25923",
    "gameName": "A tense struggle",
    "players": "nyctalop (1893) vs. prober (1856)",
    "opening": "Queen's pawn (A40)"
}