{
    "moves": {
        "1. d4 Nf6 2. Bf4 e6 3. Nf3 c5 4. e3": "A mistake, since it allows Qb3 by black. But anyway...",
        "4... d5 5. c3": "...my opponent leaves me the chance to fix it. Now, imagine a different move order :-)",
        "5... Nc6 6. Nbd2 c4": "This choice by black means he will want to strike on my queenside. Good to know. It often works, so I have to be careful with it. Who will go first?",
        "7. h3": "Pretty a slow and passive move to begin with. But I have g4-g5 in mind. ",
        "7... b5": "He's going serious. ",
        "8. a3": "Needed to hold. ",
        "8... a5": "Really serious. Now, let's think about the danger. If I just defend, he will get the initative and I'll be crushed. ",
        "9. g4": "No risk, no gain. With some luck, I will get on time to distract him from the queenside. Another try was Ne5, but it was a well known scheme, and NxN is not so good or interesting to play with. ",
        "9... Bb7": "Defending the knight, and making useless the Ne5 plan. ",
        "10. g5": "...But Ne5 must be done in order to avoid Nh4 by black. It was \"an experiment\", for not to say a mistake. :-)",
        "10... Nd7": "Thank you black, now I have some chances against your kingside. ",
        "11. e4": "Starting from the centre. Black is in any serious danger, still.",
        "11... Be7 12. exd5": "Weakening the column while the lsb is still trapped by a pawn. ",
        "12... exd5 13. h4": "Freeing my minor pieces to the duty of defending g5... but the plan is h5 and yahoo!",
        "13... O-O": "Thank you black...",
        "14. h5": "It is not all done, here. The queen is still on d1, the bishop isn't playing (h6 is not any dangerous)... ",
        "14... Re8": "Good one, black. ",
        "15. Be2": "I'm prepared to sac this bishop since now, if necessary an emergency o-o-o, as long as I am attacking his king. This looks pretty a wild fight. ",
        "15... b4": "Well, well, getting serious. I have one move left, accepting the exhcange... enough? We'll see. ",
        "16. g6": "I can't lose this chance, period!",
        "16... fxg6 17. hxg6 h6": "Ok, step one concluded. Now, I need a sac to break the pawns. Bxh3 was enough to win? ",
        "18. Qc2": "I need more firepower. The queen could have gone to a4, but I was looking for f5 and d5.",
        "18... b3": "I should have considered Nxb3, then Qxb3, pressing d5. But it was not enough to win, I considered. ",
        "19. Qf5 Nf6 20. Nxc4": "...But now, the story is different! I was not faithful to Bxh3, but maybe the right sac is just here!",
        "20... dxc4 21. Bxc4+": "Ouch!",
        "21... Kh8 22. Ng5": "With this move, I thought everything was over. I was wrong, as I often am. ",
        "22... Bxa3+": "Better was Bc5+. d4 is the only hope for black. ",
        "23. Kd2": "Better was Kf1, but I wanted to keep the rooks free to join the fray. As you see, it was arguable. ",
        "23... Bxb2": "Now... ",
        "24. Nf7+ Kg8": "Ano now, NxQ seems to guarantee me the victory. But no, I \"have\" to be \"smarter\"... :-(",
        "25. Nxh6+ Kf8": "Now, I realized, terrified, that I had to think about Bxc3+, KxB, Qxd4+!, and my empire is shaken into death. So, incredibly...",
        "26. d5": "Was it the right move? Wow, million of volts are crisping around. I'll miss something and lose, any moment...",
        "26... Bxa1": "-7. But black's choice was not the best. Note the mating net if gxN... I remember to have seen it in tactics, somewhere... nice in an actual game... But black must counter my queen in the first place. ",
        "27. Nf7": "Now I can go for the queen, and opening the way for my rook. ",
        "27... Qb6": "Aiming to f2, but not quick enough. ",
        "28. Rh8+ Ng8 29. Bd6+ Nce7 30. Nh6#": "Quite a nice combination for a puzzle. The pinned knights are a nice theme. Help yourself! :-)"
    },
    "url": "https://gameknot.com/annotation.pl/a-thrilling-attack?gm=44526",
    "gameName": "A thrilling attack",
    "players": "damalfi  vs. jjtman ",
    "opening": "Queen's pawn game (A45)"
}