{
    "moves": {
        "1. e4": "Just as a warning, this game is 89 moves long; make sure you have something to eat!",
        "1... d6": "The pirc defense -- a defense I don't like playing against very much.",
        "2. f4": "Hoping for 2. ...e5, transposing into the King's Gambit (fischer defense) after (usually) 3. Nf3 exf4.",
        "2... Nf6": "Black sticks with his plans to play the pirc, and I oblige him.",
        "3. Nc3 g6 4. Nf3 Bg7 5. d4": "All standard so far -- this is the Austrian attack of the pirc defense, where white has a big classical center, and black will counterattack against it from the flank.",
        "5... c5": "I was expecting something tame, like 0-0, getting the king to safety.  Apparently, this is a good move, too, as it forces white to commit to what he wants to do about the center.",
        "6. dxc5": "Not the most popular decision, but even now I think it's pretty good, as it doesn't overextend like the alternatives e5 or d5 would, and it gives the white queen a little more scope.  \n\nThe drawbacks are that it gives up a center pawn for black's c-pawn and exposes the Nc3.\n\nMost common, though, is Bb5 , which leads to a different type of game.",
        "6... Qa5": "Better than dxc5 7. Qxd8 Kxd8, as this entices white to go for a free pawn with 7. cxd6? Nxe4!, with a big advantage to black.",
        "7. Bd3": "Defends against Nxe4; IMO the best move here.  One lesson I've learned (painfully) is not to try too hard to create an advantage when there is none.",
        "7... Qxc5": "A good recapture, with more central pawns to black than white.",
        "8. Qe2": "Preparing to chase the queen with Be3, while keeping options open about where to castle.",
        "8... Bg4": "An aggressive developing square, but this pretty much commits black to ceding the bishop pair to white; this will turn out to be a very big deal in the endgame!  My preference for black would be to play 0-0 here, deferring the decision on where to develop the bishop.",
        "9. Be3": "The expected follow-up.",
        "9... Qa5": "Now there's really not a lot wrong with Qa5, or with Qb4 for that matter (black has more success with Qb4 according to the game DB), but why not play Qc7?  (The answer is that Qc7 fails to 10. Nb5!, and then black must play Qa5 [albeit with check] anyway.)  In any case, Qa5 leaves the queen open to harassment with, say, Bd2, and then she'll have to move again.",
        "10. O-O": "Seemed much better and safer than 0-0-0.  I expect black to follow suit.",
        "10... O-O": "As expected.",
        "11. h3": "Now black has a decision to make; give up the bishop pair (and this is a pretty good bishop for black), or retreat it.  Note that, due to black's queen maneuvering, he's just the tiniest bit behind in development.",
        "11... Bxf3": "This exchange allows black to catch up in development, but costs him the bishop pair.",
        "12. Qxf3": "By far the best recapture, creating a nice battery down the f-file while protecting the third rank.",
        "12... Nc6": "Catching up in development, and threatening to win the bishop pair back with Nb4.",
        "13. a3": "Keeping the knight out of b4.",
        "13... Nd7": "Revealing a second attacker on the Nc3, while shifting his attentions to the queenside.",
        "14. Bd2": "Defending the Nc3, while threatening a revealed attack on the Qa5 down the road.",
        "14... Qd8": "Not sticking around for that -- although Qb6  looks to be okay as well (though the b-pawn looks totally poisonous after, say, Qb6  15. Kh1 Qxb2? 16. Rfb1!).",
        "15. Rab1": "The first new move of the game.  This frees the Nc3 to move!",
        "15... e6": "And this prevents the knight from moving to d5, while giving the queen a chute to probe the white kingside, perhaps.",
        "16. g4": "Aggressively pushing towards black's kingside.  Is this warranted?  I think so -- white has a good presence on the kingside and in the center, and black's pieces are pretty passively posted.",
        "16... Nc5": "Seeking exchanges may not be bad for black here, especially if he can remove white's bishop-pair advantage.",
        "17. f5": "Will I give up my Bd3 to keep pushing into black's kingside?  Apparently, I will!",
        "17... exf5": "It's understandable not wishing to expose his king, but I had expected Nxd3.",
        "18. exf5": "Isolating black's d-pawn and still threatening to open the kingside.",
        "18... Qb6": "?!  Now this move looks strong, threatening to win a piece because of the discovered check.  But much stronger would've been Ne5.  This allows white to embark upon a combination that will give him a small but important advantage...",
        "19. Nd5": "!  I think this is a very good tactical defense!  Either the queen must go back to d8 or black must give her up.",
        "19... Ne5": "?!  An interesting try, but the exchanging combination favors white.  I would've still preferred Qd8 here, but I confess that it's very hard to play something like that psychologically, since you just moved Qd8-Qb6 last move!",
        "20. Nxb6": "Forcing black to play Nxf3 , otherwise he loses the queen for not enough.",
        "20... Nxf3+": "Of course.  Now white heads to the endgame with a small advantage.",
        "21. Rxf3": "The best way to get out of check... take the piece!",
        "21... Bd4+": "Unexpected!  I had thought I'd see axb6, and black has to figure out what to do about his atrocious pawn structure.  But this allows white to exchange even MORE of black's pieces.",
        "22. Be3": "Basically forcing black to play Bxe3; anything else loses material.",
        "22... Bxe3+ 23. Rxe3 axb6": "And this move was necessary now, otherwise white just has a large material edge.  So take stock now -- black's pawn structure is a wreck, he has a knight to white's bishop in the endgame, and his rooks are on ineffective squares, and it's white's move.",
        "24. fxg6": "Forcing black to recapture; if instead black plays Nxd3, white has gxh7 , winning a pawn, creating a passed pawn on the h-file, with good winning chances.",
        "24... fxg6": "Gives the Rf8 more scope.",
        "25. Rf1": "Bc4  was an alternative here, but I thought this was pretty good also.",
        "25... Rxf1+": "The main alternative to this was Nxd3, but the rook   pawn endgame favors white heavily.  It's hard to argue with this move; the only downside is...",
        "26. Bxf1": "White gets to keep his bishop, and the b7 pawn for black looks very weak!",
        "26... Kf7": "Trying to get his king involved -- generally a good plan in the endgame!",
        "27. Bc4+": "Centralizing the bishop (preparing to go to d5).",
        "27... Kf6": "Marching forward; again, a risky strategy, but perhaps the best chance to hold the balance.",
        "28. Bd5": "Forcing the rook to defend the b2 pawn, otherwise b4! wins for white.",
        "28... Rb8": "More flexible than Ra2.",
        "29. Kf2": "Necessary in case black has the idea of Kg5.",
        "29... h5": "He does...",
        "30. b4": "Time to send the knight backwards; this leads to the win of the d-pawn.",
        "30... Nd7 31. Re6+ Kg5 32. Kg3": "This move is necessary to prevent black from winning a kingside pawn.",
        "32... hxg4": "Exchanging pawns is fine with me...",
        "33. hxg4": "no harm no foul.  Now, black must deal with the impending loss of the d-pawn.",
        "33... Ne5": "An interesting try -- looking to take the g-pawn in exchange for it.",
        "34. Rxd6": "Go ahead, says white!",
        "34... Rc8": "Apparently, black doesn't like the look of Nxg4 Rxb3, where the queenside pawns are very powerful for white.",
        "35. Be4": "Helping to hold the c2 pawn, while threatening Rxg6  if black plays Nxg4.",
        "35... Rc3+": "A good move, forcing the white king away from the defense of the g-pawn.  Remember your endgame principles: When you're down on material, exchange pawns, not pieces!",
        "36. Kg2": "Kf2 or Kh2 allows black to take the pawn on g4 with check.",
        "36... Rxa3": "Black correctly understands that he must get rid of white's pawns to hold the position.",
        "37. Rxb6": "And white knows his best chance of winning is with passed pawns on the queenside!",
        "37... Kxg4": "Now that the king no longer defends the g6 pawn, it's time to take it.",
        "38. Bxg6": "Obviously taking with the bishop is better than the rook!",
        "38... Kg5": "Another interesting way to play is Nxg6, where the endgame is rook   b-pawn vs. rook, but the black king may have trouble getting there in time to help out!",
        "39. Bh7": "Denying black an exchange while still defending c2.  Black now has no good way to avoid the loss of the pawn on b7.",
        "39... Nc4": "Harassing the rook, although perhaps black has already hatched his drawing scheme at this point.",
        "40. Rxb7": "With two passed pawns, I am very optimistic now.  I feel that I've maximized my slight advantage and now have good hopes of winning; can black draw?",
        "40... Kf4": "His king is certainly well-positioned!",
        "41. Rc7": "Preparing to advance the queenside pawns.",
        "41... Ne3+ 42. Kf2 Nd5": "Forking rook and pawn.",
        "43. Rc4+": "But that's easily parried.",
        "43... Ke5 44. Ke2": "I know I've got to get my king involved if I want to win!",
        "44... Ra4": "Threatening to win the b-pawn; the only way to defend it is for white to play c3.",
        "45. c3": "Of course I don't want to lose my pawn...",
        "45... Nxc3+": "! Theoretically, this gives black a draw.  After Rxc3 Rxb4, Rook   Bishop vs. Rook is a draw.",
        "46. Rxc3 Rxb4": "In practice, however, this endgame is very difficult for both sides.  Even in games on chessgames.com, the strong side wins 35% of the time; Karpov defeated Van Wely with it as recently as 2003!\n\nI have 50 moves to either exchange his rook for my bishop, win his rook outright, or mate his king -- otherwise it's a draw.",
        "47. Ke3": "So first things first -- I need a strategy.  I decide that what I have to do is force his king back to the back rank, and then, if I can do that, I should be able to either mate him or force him to drop material.  It's going to be tough because he's so well-centralized, and I only have 50 moves to do it in!",
        "47... Rh4": "And of course, if black can exchange rook for rook, or can win my bishop, it's a dead draw.  The nice part about an endgame like this in correspondence chess is that you can analyze incredibly deeply!",
        "48. Bd3": "Amazingly, the only move that prevents a draw!",
        "48... Rh3+ 49. Kd2 Rh2+ 50. Be2": "This is an important concept in this endgame (at least for me), to use the bishop to defend the king from the rook, while using my king and rook to push his king towards the back rank.\n\nWhite has to be careful of black's drawing techniques, where basically all he has to do is get the white rook off the board by whatever means necessary!",
        "50... Rh8 51. Ke3 Rh3+ 52. Bf3": "This will force the black king back to the 6th rank now...",
        "52... Rg3 53. Rc5+ Kd6 54. Rd5+ Ke6": "Note that Kc6 loses immediately to Rg5 !",
        "55. Rh5 Kf6 56. Kf4": "An important move!  Black thinks he'll be okay with Rg1, keeping the option to interpose on g6 open, but I've calculated further...",
        "56... Rg1 57. Be2": "!  This assures white of pushing black back to the 7th rank!",
        "57... Re1 58. Rh6+ Kg7": "It looks like white must abandon the idea of a rook on the 6th rank now, but there's a sequence that allows me to keep it there...",
        "59. Re6 Kf7 60. Kf5": "And now the bishop is free to move.  Bh5  is threatened now.",
        "60... Rg1 61. Ra6 Ke7 62. Bd3 Rd1 63. Be4": "Keeping with the strategy of keeping the bishop close to the king and center, but I overlooked something here...",
        "63... Rd6": "Keeping the rook adjacent to the king (i.e., king on the e-file, keep the rook on the d-file) and between his king and my rook will help him defend exquisitely!  At this point I realize I need to regroup and try again.",
        "64. Ra5 Rf6+ 65. Kg5": "The only way out of the checks.",
        "65... Rf1 66. Bf5 Rg1+ 67. Bg4 Kd6 68. Kf4 Rf1+ 69. Ke4 Re1+ 70. Kd4": "Finally, he can't check me any longer!",
        "70... Rg1": "?  Black had discovered the drawing strategy of allowing his rook to get between his king and my rook; so Rc1 was the move here; this pushes his king towards the back rank again.",
        "71. Ra6+ Ke7 72. Bf5 Rd1+ 73. Ke5 Re1+ 74. Be4 Rd1": "This time he remembered.  I figure I have to do something about this differently, since Ra7  will get me nowhere.  So I calculated a while, and came up with...",
        "75. Re6+": "!  This forces the king out of the center or towards the back; since Kd7 is met with Rh6!",
        "75... Kd8": "I thought Kf7 was more tenacious.",
        "76. Kf6": "I can't keep him on the back rank just yet, but this is progressing there...",
        "76... Rf1+ 77. Bf5 Kc7 78. Ke5 Re1+ 79. Be4 Kd7": "Otherwise he does go back to the back rank.",
        "80. Rb6": "Threatening Rb7 .  The best defense to that now appears to be Kc8.",
        "80... Kc7": "Didn't see it, or maybe he didn't want it.  Now black gets put on the back rank.",
        "81. Rb7+ Kc8": "Note that White has to guard against Rxe4 , which will allow black to take the white rook!",
        "82. Rg7 Rd1 83. Bd5 Rc1 84. Kd6": "Black's king is becoming very restricted, but he only needs to make it through move 96 for the draw...",
        "84... Kb8": "Accurate; other moves allow mate or lose material.",
        "85. Rb7+ Kc8 86. Ra7": "Threatening mate with Ra8#; black's response defends against this threat but misses the other one...",
        "86... Rb1": "??  After all his great play, this blunder costs black the game in dreadful fashion.  \n\nThe last hope was Kd8!, leading to the famous \"philidor position\" in the R B vs. R, which is a win for the strong side, but it takes something like 13 or 15 moves to do it in -- enough for black to hold on here!",
        "87. Rf7": "And there's no good defense now!  Running with 87. ...Kb8 leads to 88. Rf8  Ka7 89. Ra8  Kb6 90. Rb8 , winning the rook, and there's nowhere for the rook to move to defend against Rf8# without losing material.",
        "87... Rb6+": "As good a try as any, but easily parried.",
        "88. Bc6": "There's no hope for a stalemate, either.  The line is very simple from here...",
        "88... Kb8": "Running doesn't help for anything but a single move.",
        "89. Rf8+": "And black resigns, for it's a mate in 1 after 89. Rf8  Ka7 90. Ra8#.  This endgame almost never comes up, but it was fun to learn about it and awfully exciting to win from the strong side!\n\nTo those of you who stuck with it, thanks for your fortitude, and I hope you enjoyed it!  -Ethan"
    },
    "url": "https://gameknot.com/annotation.pl/a-titanic-endgame-fight-r-b-vs-r?gm=9626",
    "gameName": "A Titanic Endgame Fight! (R+B vs. R)",
    "players": "ethansiegel (1723) vs. clarinetref (1746)",
    "opening": "Pirc defence (B07)"
}