{
    "moves": {
        "1. e4": "This is my first annotated game. I chose this game because I felt that it really mentally exhausted me in not only trying to find the good moves, but also the very good ones. ",
        "1... e5 2. Nf3 Nc6 3. Bc4 Bc5 4. Nc3 Nf6 5. d3 O-O 6. Bg5": "So far, so good (well, at least that's what I think) in this opening. ",
        "6... d6 7. Nd5": "Darn! A mistake! If my knight on f6 is taken, no doubt I will have doubled pawns and an exposed g-file. My defences have weakened.",
        "7... Be6": "At least I can try to get rid of his centre pieces as best I can",
        "8. Bxf6 gxf6 9. c3 a5": "At this stage, I feel that my opponent is winning. I still want to get rid of that Knight on d5, and also the Bishop protecting it. ",
        "10. a3 Ne7 11. Nxe7+ Qxe7 12. b3 Bxc4 13. bxc4": "My short-term mission accomplished, but there's still the matter of centre control, with his pawns advancing",
        "13... d5": "I feel that I can't keep holding on forever, that I must relieve some pressure.  A pawn for a pawn?",
        "14. cxd5 Bxa3 15. Qb3": "AhhH!  Not a pawn for a pawn! A useful fork by the Queen",
        "15... Bc5 16. Qxb7 Rfb8 17. Qc6 Qd6 18. d4": "I must regain the pawn deficit. My focus shifts to the pawn on b3, being undefended.",
        "18... Qxc6 19. dxc6 Bd6 20. d5 Rb3": "The beginning of my mounting pressure on the pawn",
        "21. c4 Rc3 22. Nd2 Bb4": "I am now taking advantage of the fact that after the Rook moves away, the Knight will be pinned to the King. I exploit this by. . . ",
        "23. Ke2 Rc2": "A different pin on the Knight. Of importance is also the fact that the Knight will require a Rook's help to defend it. However, this exchange is actually what I need. Because. . . ",
        "24. Rhd1 Bxd2 25. Rxd2": "The Knight was the only defender of the c4 pawn. Now, I can reclaim my material disadvantage (though not my positional one) ",
        "25... Rxc4 26. Ke3 Rc3+ 27. Rd3 Rc5 28. f4": "We now commence the beginning of the end - I attempt to defend what he throws at me, he attempts to break through.",
        "28... Re8": "If 29. fxe5, I will play Rxe5 with an aim of then f5 using the pin.  ",
        "29. g4 exf4+ 30. Kxf4 Kg7 31. h4 h6": "Here comes the charges",
        "32. h5": "Blocked by a wall, but for how long? That pawn formation is starting to look menacing",
        "32... Rc4": "A pawn for a pawn? ",
        "33. Re3 Rc5": "Ok, then. But what now?",
        "34. Rea3 Ra8": "I don't want to exchange that pawn. Although I obviously did not foresee it, it plays a large role later.",
        "35. Rd1 Rd8 36. Rad3": "Here comes the battering ram - will he crash through and take my kingdom?",
        "36... Kf8 37. d6": "His pawn is now almost through, with a Rook battery bearing down. However, he failed to realise the pawn was protecting the c-6 pawn. ",
        "37... Rxc6 38. Kf5": "Better not lose that pawn either, because his King on f6 means my King is stuck on the back rank.",
        "38... Kg7 39. dxc7": "The exchanges flow, the board clears of two Rooks.",
        "39... Rxd3 40. Rxd3 Rxc7 41. Rd6": "Now it is I who lose my material advantage, unless I check with Rb5 . But I have a scheming trap in mind.",
        "41... Re7": "WIll he take the bait?",
        "42. Rxf6": "Here goes! It's all about promoting that a-pawn. If my pawn moves first, I'll promote. But also, without the Rooks, if his King goes onto the 6th rank, as is my aim, I also promote.",
        "42... Re6 43. e5": "And so, all that is left is to exchange, then walk my pawn to victory. . . ",
        "43... Rxf6+ 44. exf6+": "CHECK??? Blast!! Now he moves first, and worse, my King is stuck for mobility. Ahhhh, my failure to see ahead clearly has cost me. ",
        "44... Kf8 45. Ke4": "Well, if I can move my King far enough, I can take the f-pawn, since my h-pawn will take the g-pawn if it attempts to protect it. But how to get his King away?",
        "45... a4": "By forcing his hand. Now, he has to chase my Pawn, while his King moves to the opposite end of the board",
        "46. Kd3 a3 47. Kc2 a2 48. Kb2 a1=Q+ 49. Kxa1 Ke8 50. Kb2 Kd7": "Oh no! A horrible thought hits my head. What if he plays g5, I play hxg5, and he waltzes his h-pawn to victory? Oh wait, by not exchanging, 51.g5 Ke6, I can take the pawns.",
        "51. Kc3 Ke6 52. Kd3 Kxf6 53. Ke3 Kg5": "This is now a draw, if he defends his pawn.",
        "54. Kf3 f5 55. gxf5": "Merely the formalities now,",
        "55... Kxf5 56. Kg3 Kg5": "At this point a draw was agreed upon. Even with the h-pawn, he simply moves his King to h1 and blocks my promotion. As I wish to catch some sleep, I don't want to delay this any further. \r\n\r\nI found this game to be quite interesting, and would welcome all your comments. "
    },
    "url": "https://gameknot.com/annotation.pl/a-tight-game?gm=17438",
    "gameName": "A Tight Game",
    "players": "perovskit (1551) vs. caro-kann (1459)",
    "opening": "Giuoco Piano (C50), four knights variation"
}