{
    "moves": {
        "1. e4": "The game was long and hard it started at 8:00pm and didn't finish untill 12:30am! 4 and a half hours finishing after midnight. It was a very hard fought game. The game was quite unusual from start to finish where I went with some odd looking lines coming from the GPA. it seemed that I was looking at a good position when suddenly my opponent found a nice defence and it looked like I was destined to be slaughtered as I probably should have been in the position. How ever with some mistakes from my opponent I managed to get into a rook pawn end game where a nice little move seems to have secured the draw!",
        "1... c5 2. f4 Nc6": "Of course the best reply for black is meant to be the tal gambit which is 2...d5 I knew however that my opponent wasn't likely to know this.",
        "3. Bb5 a6 4. Bxc6": "retreating the bishop to a4 would get it trapped and moving it back would be a waste of tempo. ",
        "4... bxc6 5. Nc3 d5 6. e5": "I'm not sure if this is right, I know it's not often a move done in the GPA however it felt right in the position.",
        "6... e6 7. Nf3": "I suspect this may have been an inaccuracy as d3 would prevent black from pushing his c pawn.",
        "7... Be7": "Luckily my opponent didn't play c4.",
        "8. d3 Nh6 9. O-O": "I spent a bit of time here trying to work out weather I should do this or not. I had wanted to actually not castle at all and instead go for some aggresive pawn thrusts however I couldn't get around black playing Bh4+ ",
        "9... Nf5 10. Ne1": "?! a rather dubious move. It was meant to be a rook lift however I suspect it is a little early for that.",
        "10... h5 11. b3": "And making my last move look even more silly I change plan straight away. This move intends to make a target out of the c5 pawn. Black can't save it if I play Na4 and Ba3. Well not without using either his rook or bishop.",
        "11... a5 12. Na4 Ba6 13. Rf3": "I can't play Ba3 yet because of the fork at e3. ",
        "13... Bb5": "Unfortunalty it also means I dont have the time to make my attack on the pawn.",
        "14. Nc3 Qb6": "Prepares a discovered check.",
        "15. Rh3": "After some thought I decided that the check posed no real threat and so went on with targeting a new pawn.",
        "15... h4 16. g4": "of course black cannot take e.p because of the pin on his h8 rook. ",
        "16... Nd4": "? I really think this move was a mistke. as now the knight is effectvly trapped in the middle of the board. I'm not sure what I would have done if black had played 16...Nh6. It has already been a messy sort of game. ",
        "17. Be3": "stops him pushing is c pawn if it were on his mind as well as targets the c pawn.",
        "17... Ba6": "making an escape route for his knight since Nb1, c3 would trap it.",
        "18. Na4": "I very much wanted to play a4 here covering the knights only escpe square however I couldn't see a way around the fact that if I got my knight out of the way the c3 would be useless on account of Nxb3 forking queen and rook. So I went with this which is still a very good move, It was here or the last move where I worked out I could win atleast a pawn.",
        "18... Qa7 19. Qd2 Bb5 20. Nb2": "! I thought this would win the knight however my opponent after quite a bit of thinking came up with a soloution.",
        "20... a4": "! now I can no longer win a piece. however I can easily win a pawn if I choose. But this is I think still the best move in this position.",
        "21. c3 axb3 22. cxd4": "? A mistake or probably this deserves a ?? since black gets three pawns for the piece but more importantly a monster protected passed pawn on the 7th rank! my thinking was that I could take the piece then snaffle a coulpe of other pawns I thought that I would have enough on the a pawn to keep it under raps. Which was very wrong and probably should have lost me the game!\r\n\r\nThe simple 22.a3! Nc2 23.Nxc2 bxc2 23.Qxc2 would have left me a pawn up with a comfortable position.",
        "22... cxd4 23. Bf2 bxa2 24. Nc2": "Oly real option.",
        "24... c5 25. g5": "!? I should be assigning my resources to the taming of the passed pawn rather than going after irrelevant pawns on the other side of the board. I rationalised to myself that since black woldn't want to trade rooks on the h file my rook would have enough time to reactivate my.",
        "25... Kd7": "I was rather hoping my opponent would castle instead giving me counterplay on the h file.",
        "26. Rxh4 Rhb8 27. Rc1": "Perhaps Rh3 would have been better.",
        "27... Qa5 28. Qxa5": "?! another bad move I thought that by trading heavy pieces I was taking away blacks resources to utalise the pawn, this is of course false.",
        "28... Rxa5 29. Be1 Ra7 30. Na1": "I also spent time considering if Rh3 was worth playing.",
        "30... Ba6 31. Rc2 Bxd3": "Beter than if this had been played last move. Now black gets one extra tempo.",
        "32. Nxd3": "I also wondered if Rd2 would have worked.",
        "32... Rb1 33. Rc1 c4": "so black gets his piece back.",
        "34. Bd2 Ba3": "I thought I was about to lose here. as I could see no way to prevent Bb2",
        "35. Re1 cxd3 36. Rh3": "Now Bb2 seems to win!",
        "36... Rab7 37. Rxd3": "Still Bb2 works.",
        "37... Rxa1": "? but black makes a mistake! giving me the chance to get back into the game.",
        "38. Rxa3 Rbb1 39. Kf2": "! now I allowed myself to think I might not die so suddenly after all. although I am techically up in material the pawn still posses a danger to me.",
        "39... Kc6": "I put in some thought here and decided my best option was to exchange my bishop for blacks pawn and hope the insuing ending might be a draw. maybe instead h4 worked? ",
        "40. Rc1+ Rbxc1 41. Bxc1 Rxc1 42. Rxa2": "Now I it's pretty clear that black is much better. I however had hopes of putting up a fight. Is the position enough to win? well lets see how things progressed then make a descision at that point.",
        "42... Kc5 43. Ke2 Kc4 44. Kd2 Rf1": "I had actually thought black would have played Rh2 at the time I thought that Rf1 was actually quite clever but I can't remeber why I thought that now probably because this threatens both the f apwn and the same threats that Rh2 would have had. which is better, Rf1 or Rh1 what does the reader think? either way my next two moves would likely be the same.",
        "45. Ra4+ Kc5": "I actually wonder if Kb3!? was worth a look.",
        "46. g6": "! this was the key move to the endgame In think. I suspect and I could be very wrong but I believe that this move I was happy with in the game is what gives me good drawing chances. I needed to break up blacks pawns and this forces that. even now I am somewhat proud of this move as it's something of a positional sacrafice which is not something I manage to do often.",
        "46... fxg6": "In the game this is what I expected but I think Rxf4 would have been more acurate. either way I suspect both cases the game should be a draw with good defence from white.",
        "47. Ra6 Rxf4 48. Rxe6 Rf2+ 49. Kd3 Rxh2 50. Rxg6 Rh3+ 51. Kd2 Re3 52. e6 Kd6 53. e7+": "! This forces blacks hand and allows me to set up my fortress in which black will find it very difficult. Keep in mind it was getting quite late at this point and as the game goes on we were both getting tired and my opponent was very low on time, he came down to seconds a few times only being saved by the 30 second increment.",
        "53... Kxe7 54. Rxg7+ Kd6 55. Rh7": "! An important move ",
        "55... Ke5 56. Rh5+ Ke4 57. Rh4+ Ke5 58. Rh5+ Kd6": "so now black can't go back down that path lest it be a draw by reppition.",
        "59. Rh7": "technically Rh8 would be more accurate but I wanted to repeat the position as much as possible and this move still holds fort.",
        "59... Re4 60. Kd3 Kc5": "This will get black nowhere. As I can bring my rook to c7 and should black move his king to the queenside then a draw would result since I could create an unpassable \"fence\" where the black king cannot cross. and without the support of the king the pawns/rook combo would not be able to pomote since my rook would have plenty of waiting moves at it's disposal.",
        "61. Rc7+ Kd6 62. Rh7 Rf4 63. Rh6+ Ke5 64. Rh5+ Rf5 65. Rh4": "This is to stop the king crossing the fourth rank should my king be forced back.",
        "65... Rf3+ 66. Kd2 Rf4 67. Rh8": "This rook move once agains keeps my fortress intact since it allows me to play Re8+ before black can free the d4 square for his king.",
        "67... Rf6 68. Kd3 Rf3+ 69. Ke2": "This time I have to push the rook to stop the king coming into e4.",
        "69... Re3+": "I think that Rg3 was actually the correct move. I'm not sure if a draw would still be the case after 69...Rg3 70.Re8+",
        "70. Kd2 Ke4": "Now this situation looks familier!",
        "71. Rh4+ Ke5 72. Rh5+": "At this stage it was basically 12:30 at night and we were the only two left in the club meeting room. My opponent was short on time and I was playing for a draw. With this move I pointed out to my opponent that the position had reppeated itself three times with the same person to move and all. My opponent disagreed and we came to the descision that we would play it out and if it didn't end up as a draw then we would set up the position again and see if it was a three fold reppition. And I can say it definatly was.",
        "72... Kd6 73. Rh7": "This position has also reppeated itself three times.",
        "73... Kc5 74. Rc7+ Kb4 75. Rc8": "a waiting move, now that black has cut off contcact between his king and the rest of his army I think a draw is secured.",
        "75... Rc3 76. Rb8+ Ka3 77. Rb5": "My opponent agreed to a draw at this point. This was a very long tough battle and I am very happy with the way I played, in the endgame inpaticular, I think it is a very educational endgame and I think I played it basically correctly. Please tell me if I am mistaken on this count since I dont want to find out my enthusiasim is mispalced."
    },
    "url": "https://gameknot.com/annotation.pl/a-tough-battle?gm=41407",
    "gameName": "A tough battle",
    "players": "thereaper1 (1072) vs. opponent (1587)",
    "opening": "Sicilian (B21), Grand Prix attack"
}