{
    "moves": {
        "1. d4 d5 2. Bf4 f6 3. Nf3 g5": "An aggressive and sound continuation, even if white can do through it with appropriate moves... and more experienced players would have studied the intricacies. ",
        "4. Bg3": "It doesn't make for a sac because the e pawn still blocks the Q, basically. ",
        "4... g4": "The normal h5 would be answered by h3, but black went for the hiper-aggressive choice, that is not the best one. ",
        "5. Nh4": "Now my N is safe, and ready to go g6 if black dares to move his h pawn. ",
        "5... h5": "He did, solidifying his outpost in g4, but \"giving\" me g6 in the process, which is an almost fatal mistake. ",
        "6. Qd3": "Despite its weird position, the Q is aiming to g6, with lethal effect on black's position. Moreover, it prevents f5 by black. ",
        "6... Kd7": "Well, that's funny and tricky. Of course black had Rh6, preventing Qg6+, and standing for Ng6 - not so dangerous. But this - a \"bad\" move, makes me think a lot: I can easily find myself overrisking and falling into blunders...",
        "7. Nc3": "Developing - threatening d5, thinking in a future Nb5. Not a good plan, but Ng6 seemed pretty pointless, now. It was not, because after Rh6, Nf4 would have been very interesting, pressing e6. ",
        "7... e6": "Covering f5, too. Too bad. ",
        "8. e4": "Let's try to open the position! My superior developement will then prevail. ",
        "8... dxe4": "Hard decision: Q or R to take on e4?",
        "9. Nxe4": "Well, Nc5+, BxN, dxB+, etc, is the worst thing that can happen to me... so this can't be bad. ",
        "9... f5 10. Nc5+": "I expected the exchange, regretting I didn't take before the Ng6 - NxBf8 - train, which would have left me with good control of black's squares from g3 - e5...",
        "10... Ke8": "Sensible. Once \"defended\" the kingside, the K better comes back to leave room to the other pieces. ",
        "11. Ng6": "Late, but I decided I had to caugh this train. ",
        "11... Rh6 12. Bh4": "Yahooo!!! Too nice not to play it. ",
        "12... Ne7": "Too bad, I can't risk anymore (RxN is possible), so I have to solve the issue the best way for me. Which is it?",
        "13. Nxf8": "The N would be pinned to the Q, and I have control of the black squares. ",
        "13... Kxf8 14. Qe3": "Waiting for Rg6, Bc4, Qd6, fighting for e6, but...",
        "14... b6": "TOO BAD! My opponent blundered almost the worst possible way.",
        "15. Qxh6+ Kg8": "It's a \"manual\" situation, but it is not all that clear Nxe6 forces BxN, QxB+, Kf8... and where's the mate? So I went for the weaker...",
        "16. Bf6": "This leaves only one chance to black, but a sound one. ",
        "16... Qf8 17. Qg5+": "The more forcing move. ",
        "17... Kf7": "! ...Bc4 was now my move...",
        "18. Nd3": "...but I wento for this \"naive\" threat Ne5. ",
        "18... Nbc6": "This is the reason: black can easily defend it, so there is no attack. ",
        "19. Ne5+": "I went for it anyway. ",
        "19... Nxe5": "Which one is to take? A supported B in c6 whorts more tha the attack on c7 and the blockage an control of the black' f and g pawns?",
        "20. Bxe5": "Of course yes. ",
        "20... Nd5": "Protecting c2. c4 is tempting, but Qb4+ is very dangerous. ",
        "21. Qxh5+ Ke7 22. Qh7+ Kd8": "Maybe better was Qf2, but being down in material, black correctly tries to avoid exchanges. Concretely, his Q is still threatening Qb4+, which will be annoying for me. ",
        "23. c4": "?? And here I went distracted, and I blundered in return! This is the truth. I thought: when annotating this, I will make people believe it was a plan to win! :-). Despite the material disadvantage, my poor developement prrevents me to get more fire into the field in few tempi, so I lost my nerves and played \"desperately\". I was not so wrong...",
        "23... Qb4+ 24. Kd1 Qxb2 25. Rc1": "No check, except for...",
        "25... Nc3+ 26. Rxc3": "Forced or loses the R with check. ",
        "26... Qxc3": "Qa1+ is the only danger. ",
        "27. Qxc7+": "?? Very strong as it may seem... it's not the right move, as Bf6+ - Qe7+ and mate. I simply missed it. ",
        "27... Ke8 28. Qc6+ Bd7": "?, but the R was lost anyway. ",
        "29. Qxa8+ Ke7": "Well, a lot of options, here, but it is not easy to free the lsb, as Qa1+, taking the Rh1, is always there. Sometimes it is a good stratey (sac a R in order to get the enemy's Q far from the action). But I blundered again!",
        "30. d5": "Giving my B for free (I thought it was protected somehow). Sigh!",
        "30... Qxe5 31. dxe6": "Well, at least let's see what does he play.",
        "31... Kxe6": "It leaves me room for a Re1 threat, but Ba5+ would have been very dangerous, so I went for confidence in superior material. I was a little coward, I admit, since I blundered so badly before. ",
        "32. Qd5+ Qxd5+ 33. cxd5+ Kxd5 34. Kd2": "Now, a sensible player would have resigned. Not he. ",
        "34... Be6 35. Bd3": "? Kc3 was much better. ",
        "35... Kd4": "Do you realize? Now black is suddenly threatening Bc4, winning the B and I can't to anything with my R to avoid it... do I?",
        "36. Rc1": "Ok, now...",
        "36... Bxa2 37. Bxf5": "...making and exchange of this, as intened when playing Bd3. A strategical mistake, since now black has two excellent pawns and I don't, as you'll see soon. ",
        "37... Bd5": "! g6 leaves black so much control of Bf3... I can't allow it, but I can be very, very nasty. ",
        "38. Bxg4 Bxg2": "? Hard to see. Black's B is fatally trapped after...",
        "39. f3": "No escape, no help possible from the K. ",
        "39... Ke5 40. Rg1 Bxf3 41. Bxf3": "Now it's over. ",
        "41... Kd6 42. h4 a5 43. h5 Kc5 44. h6 Kb4 45. h7": "I though here that I was playing as a real chicken. No, no Q, I would mate him without it. ",
        "45... Kb3 46. Bd5+": "Now allowin escape via c4. ",
        "46... Ka3 47. Rb1": "Closing him in. ",
        "47... Ka4 48. Kc3": "Zugzwang! Only one forced move, and it allows...",
        "48... b5 49. Ra1#": "No B or Q required. Hope you had fun at me!"
    },
    "url": "https://gameknot.com/annotation.pl/a-trapped-bishop?gm=59383",
    "gameName": "A trapped bishop",
    "players": "damalfi  vs. jamsavage (1200)",
    "opening": "Queen's pawn, Mason variation (D00)"
}