{
    "moves": {
        "1. e4": "This was an interesting game with an interesting ending.  Started it off with the King's pawn.",
        "1... Nc6": "I don't think that I had seen anyone try this before.  I now realize that it isn't exactly rare, but it was my first time encountering it.",
        "2. Bb5": "I decide to harass his knight.  I figure he wasn't expecting this, so it would throw him off his game.",
        "2... Nf6": "He proceeds to ignore my bishop and attack the pawn.",
        "3. Bxc6": "I go for some early trading.  He can't ignore this move, seeing as I just protected my pawn.",
        "3... dxc6": "He takes my bishop while keeping his pawn structure intact.",
        "4. e5": "I naturally harass his other knight. This is possibly the most aggressive I've ever played in the first few moves.",
        "4... Ng4": "He saves his knight and attacks my pawn at the same time. Solid move.",
        "5. d4": "I go to protect my pawn.  I putting my central pawns out there, which is why I didn't play Nf3.",
        "5... e6": "This move was a mistake.  While it does open up the diagonals for his queen and bishop, he unprotects his knight, which is his only developed piece at this point.",
        "6. Qxg4": "I take the knight.  There's no way I'm passing up this chance to take a solid material advantage this early in the game, even if it does leave my queen in pretty open space.",
        "6... f5": "He harasses my queen, likely hoping to force my queen back.",
        "7. exf6 e.p.": "En passant!  I'm not sure if he was aware of that rule on his previous move, but it was nice for me either way.",
        "7... Qxf6": "He takes my unprotected pawn and gets his queen involved in a solid position.",
        "8. Bg5": "Harassing his queen.  Notice a pattern emerging here?",
        "8... Qf7": "Saves his queen, but hinders his movement for the next few moves.",
        "9. Nf3": "Getting my knight involved in the action and setting myself up for a castle.",
        "9... e5": "This was a very good move.  He attacks my pawn and queen simultaneously, and opens up the diagonals for his queen and white bishop.  If I hadn't noticed the attack on my queen, I would've been doomed.",
        "10. Nxe5": "I did notice the bishop, but I thought that he would go to protect his queen before attacking mine.  I figured that I could put my knight into a nice attacking position and try to pin him on his back few ranks, but it didn't quite work like that.  In retrospect, I probably should have played Qe4.",
        "10... Bxg4": "He takes my queen.  When I came back to this game 3 days after I had made the previous move, I had to stop and remember what I was thinking, because the last move seemed incredibly stupid.  This move also takes away any real opportunity for a queen side castle.",
        "11. Nxf7": "I take his queen.  All I could do in that situation if I wanted to stay in the game.",
        "11... Kxf7": "Here's where the early knight capture comes back.  I got a little cocky with my material advantage, and I went from up 4 to up 1 very quickly.",
        "12. O-O": "I castle to get my rook involved in the attack.",
        "12... Be2": "He goes to attack my rook, but I'm not really sure why.  I would've gotten some more pieces involved before attacking the 1st rank.",
        "13. Re1": "I protect my rook and attack his bishop, which sets up an interesting battle for the e file.",
        "13... Re8": "He protects his bishop and gets his rook involved.",
        "14. Nc3": "I get my knight involved, attack his bishop, and protect my rook.  I thought this was a really good move at the time, but he proved me wrong.",
        "14... Bb4": "This was a very good move.  He's attacking my knight but if I move it, he takes my rook.  So I had to figure something out.",
        "15. Be3": "That's something.  I protect my d file pawn and block his rook, opening up his white bishop to attack.",
        "15... Bxc3": "Now we trade knight for bishop.",
        "16. bxc3": "Finishing the trade.",
        "16... Ba6": "I'm not sure what he was going for there. I realize that he saved his bishop, but he also locked it to one diagonal for at least the next few moves.",
        "17. h4": "Here I wanted to prevent something that had burned me a couple of times in the past.  I'd leave me king on g1 and my pawns on f2, g2, and h2, then I would get careless and mated by a rook on the 1st rank.",
        "17... Re4": "He goes to attack my pawn and likely double up his rooks.  I never gave him the chance.",
        "18. Bg5": "I protect my pawn and open us up for a rook trade.",
        "18... Rxe1+": "He accepts, and I start to get an idea.",
        "19. Rxe1": "I finish the trade and realize that I can attack e7, which would put him in check and restrict his king to a few spaces in the corner.  As long as he doesn't play Re8, it will be wide open.",
        "19... Bc4": "He moves his bishop to where he should have moved it 3 moves ago.  No effect on my plan.",
        "20. Re7+": "There's the check.  I wasn't sure at this point how it would lead to a mate, but I just went for it anyway.",
        "20... Kg6": "He takes what looks like an open path, but is actually pretty restrictive.  Now I start to formulate a plan for mate, but it still seems like a long shot.",
        "21. f4": "Starting the plan.  I figured that if I got my f g and h pawns up to the 4th rank, I could force a mate with either f5 or h5.  His bishop won't interfere because it would either take too long or he would lose it.  Same deal with his rook.",
        "21... Bxa2": "I think that he was hoping to eventually promote, but I never gave him the opportunity.",
        "22. g4": "I get my third pawn up to the 4th file.  Now, almost every move will result in a mate, but he still has one out...",
        "22... Rf8": "... which he doesn't take.  He realized that I could mate with my f-pawn, but couldn't also stop the h-pawn.  If he had played h6, he could have slipped his king back into the corner, and I would've been totally lost.",
        "23. h5#": "Fortunately, he didn't, and I was able to put the finishing touch on my plan."
    },
    "url": "https://gameknot.com/annotation.pl/a-trivial-mini-tournament-game?gm=47698",
    "gameName": "A trivial mini-tournament game",
    "players": "deaconsfan21 (1121) vs. bad2dabone44 (1124)",
    "opening": "KP (B00), Nimzovich defence"
}