{
    "moves": {
        "1. d4": "A recently finished game from the 52nd GK Tournament.  My opponent was higher rated and seemed to be a move ahead of me for most of this game and its companion but eventually I got lucky.  Read on...",
        "1... d5 2. c4 e6 3. Nc3 c5": "an unexpected counter-gambit.  It has a reasonable reputation.",
        "4. cxd5 exd5 5. Nf3": "White could have given Black an IQP already but I preferred to develop first.",
        "5... Be6 6. Bf4": "developing the QB outside the pawn formation.  e3 is to follow, and then the KB.  6. Bg5 merely invites Black to develop a minor piece in response (...Be7, ...Ne7, or ...Nf6) and probably commits the B to swapping off.  I prefer to contest control of e5 and d6.",
        "6... Nc6 7. e3 a6 8. Be2 Nf6 9. O-O h6": "All standard moves so far.  This move seeks to prevent Ng5, attacking the Be6.",
        "10. Re1": "One of those difficult moments when nothing obvious offers itself up for consideration.  Black's K is still stuck in the middle so this seems more attractive than Rc1 or any pawn moves or minor piece moves.  In the ideal scenario, White's KB will move to f1 and the e-pawn will advance to e5 and Black will be under pressure.",
        "10... c4 11. b3": "immediately attacking the head of Black's pawn chain.",
        "11... Bb4": "pinning the N against the R and preparing to castle",
        "12. Qc2": "defending the N, connecting the rooks and casting an eye at h7",
        "12... Ne4 13. Nxd5": "!? jumping out of the pin, allowing Black to take my R, but in turn removing the defence of the Ne4 and threatening to fork Black's K and R.  It's not clear who benefits most from the complications.",
        "13... Bxe1 14. Nc7+ Kf8": "White wins an important strategic advantage: Black can't castle and his KR is stuck.",
        "15. Rxe1": "Better to capture this bishop and prevent 15... Bxf2+ than capture the Ra8.",
        "15... Rc8": "Black saves his R and seems to secure the material advantage.",
        "16. Nxe6+ fxe6 17. Qxe4": "but now White has a 2 pt advantage and plenty of tactical opportunities with which to follow up",
        "17... Kf7 18. Bxc4 Re8 19. Ne5+ Nxe5 20. Bxe5 Qg5": "an aggressive-looking move that actually threatens nothing",
        "21. f4 Qf5": "??",
        "22. Qxf5+": "The Queen was not really defended by the pawn, which was pinned by the B against the K"
    },
    "url": "https://gameknot.com/annotation.pl/a-unfortunate-oversight?gm=22678",
    "gameName": "A Unfortunate Oversight",
    "players": "rjacobs (1620) vs. sopaypawawa (1625)",
    "opening": "QGD (D32), Tarrasch defence"
}