{
    "moves": {
        "1. e4 e5 2. Bc4 Nf6": "All standard opening stuff - Both sides have advanced their King's Pawns, White has developed his bishop while Black has developed his knight.\n",
        "3. g4": "An unusual move, not found in the database at all! faced with something he's never seen before, what will Black do? From the advice I've seen in a few other annotations, the best thing to do is to play naturally... now, what's the position here...white made a weird pawn move....and that e-pawn's unguarded...\n",
        "3... Nxe4": "Black grabs at the opportunity to take the free pawn.... but, White has a nifty little trick that wins back the pawn immediately... I have a feeling that if Black had not taken the pawn now, White would simply continue 4.g5, where Black either has to take the pawn of undevelop his knight (but this all depends on what Black moves instead of 3...Nxe4, though it would have to be a pawn move, as far as I can see e.g. c6 or g6)\n",
        "4. Bxf7+": "Here we go! Since this position is new to the database, I'll go ahead and name it... the 'Trafalgar/D'arcy opening' (well, that was what Martin named it :D) now, in this game Black captures the bishop, but what if he doesn't? after 4...Ke7, White has a couple of options, but the one I like the best is 5.Qe2, then Black might either accept the bishop (5...Kxf6 6.Qxe4) or retreat the knight (5...Nf6 6.Bb3)  \n",
        "4... Kxf7": "Either way, Black loses his ability to castle. Now White will get the bishop back...\n",
        "5. Qf3+": "like this! Now where will Black's king go...\n",
        "5... Kg8": "? Definitely not the best square - but what about other options? Kg6 and Ke6 look dangerous for Black's knig, for sure. Ke7 isn't that good either, because Black will have to deal (in the very near future) with d4! with the threat of the king/queen skewer Bg5+. The best option for Black, then, would be returning to his original square, Ke8\n",
        "6. Qxe4": "In this position, White threatens a mate in one, and Black will need to spend an extra tempo to prevent it. What if Black had played Ke8 instead? Black's response would probably be the natural Nc6, and then what would White do? what immediately leaps to my mind, looking at this, is 7.d4, an agressive attack on the pinned pawn. One line to answer to this is 7...Bd6 8.Bf4 Qe7, which would probably lead to a mass trade-off. Also possible [bearing in mind that Black doesn't want to lose a pawn] is 7...d6 8.dxe5 dxe5 9.Nc3. [ok, just noticed Black has 7...Nxd4 8.Qxe5+ Qe7 9.Qxe7 Kxe7]  At any rate, I think White's plan should not revolve around the pawn, but on quick development and queenside castling to secure the king (Black, of course, cannot do that) Now, back to this position... Options to stop mate would be h6 or Qe7...\n",
        "6... Nc6": "?? but Black doesn't see the threat! Now the end comes swiftly...\n",
        "7. Qd5#": "checkmate! martindarcy has been experimenting with this idea for quite awhile, and this is one of his more successful tries with his 'Trafalger/D'arcy opening. Any ideas, improvements or input that anyone has on this invented opening would be welcome :)\n"
    },
    "url": "https://gameknot.com/annotation.pl/a-whole-new-opening?gm=29801",
    "gameName": "A whole new opening?",
    "players": "martindarcy (1433) vs. jerrold (1355)",
    "opening": "Bishop's opening (C24), Berlin defence"
}