{
    "moves": {
        "1. e4": "The standard Kings Pawn Game.",
        "1... e5": "The most common response, the Kings Pawn Game.  At this level, I understand it very well, my response of the Siclian, I guess, is somewhat, unusual for my rating, given that it's actually one of the hardest things to learn.  You typically see it more with Masters and GM's.",
        "2. Nf3": "Standard.",
        "2... Nf6": "Nothing wrong with this move.  It's ok, but, in my mind, better is still 2...Nc6 in this kind of position, as it could lead to other well known variations like the Ruy Lopez or Guaco Piano.  It's just that, a long time ago against Mr. Arboite, who was Jack Stockel's assistant, at the time, I played 2...Nf6 which led to problems.  For, after exchanging pawns, my K became exposed.  ",
        "3. Nc3": "A standard move.  But, because of what I noted earlier, I would've forced the exchange by taking with 3.Nxe5.  I know that, in general, one shouldn't move the same piece more then once in an opening.  But, remember, opening principles are not rules.  Instead, they're a set of guidelines to help you in the opening.  While I usually follow, this would be one of the few exceptions.  In this situation, I feel like I'd get an advantage by taking.  And, that way, if black responded with 3...Nxe4, then I'd respond with 4.Qe3 immediately gaining tempo by chasing his N away, so that I can continue developing. ",
        "3... Bd6": "Understandable, as this move develops a piece.  What I used to think, however, is that it's in the wrong spot, as I was once told, that it's generally not a good idea to put your piece on a central square since you need them to control the center.  However, I most often go by what Jack Stockel tells me.  And, he disagrees with that assessment.  That's because one time I reaches a similar position, and I was debating on if I should put my LSB on the center square.  I told what the other's told me about not blocking the center, and he said, \"There's nothing wrong with it.\"  In his opinion, you can control the center just as easily, whether a piece is on that square, or not.  In this case, however, I have to disagree him simply because black did not develop her d pawn, yet.  Now, that the bishop is there, she'll have to lose time, in order to develop her central pawn, and, as they say, \"Time is of the essence.\"  This also applies in chess.",
        "4. d4": "I really like white's response here.  Not only is it developing move, but this move does forces an exchange.  After which, black will feel a little pressure.",
        "4... exd4 5. Nxd4 O-O": "And, she handles it the right way.",
        "6. Bd3": "Now, you don't typically see this move.  Normally, the LSB does come out, as was the case, but most often Bc4 or Bc5 are played, in this position.  However, once in a blue moon this is the move.  For example, if I were playing this game, this is what I would've played, as well.  And, I've done that in my recent past games.  What I like about it is not only does it develop another piece and gets Gerhard ready to castle, but at the same time, it adds protection the e4 pawn.  In addition, as noted earlier, this choice does not compromise or put restrictions on the center since white played 4.d4.",
        "6... c5": "I like black's choice.  What I recently learned, and just by being a spectator, not by being told anything, is that this attack is actually a very common and well known variation.  This kind of position has appeared several times in my games Mr. Stockel.",
        "7. Nf5": "At first, I was wondering why chicoboy didn't play 7.Ne3 as it's the most common move.  Afterall, this also what I would've done.  However, this move is actually better then it looks, and the reason that white played this was to gain tempii.  The reason is that black has to protect her DSB.",
        "7... Be5": "! Best, in my opinion.  Another option, though, was 7...Be7 with the idea of exchanging her DSB for white's N.  But, I now see why she didn't, as I made this kind of mistake in my game against caveman1960, and I would've made the same error here.  Well, it looks like the DSB is black's weak B.  But it's actually the opposite.  As it turns out, this is her strong B, and it's even stronger then white's N.  So, she needs that piece.",
        "8. Nd5": "Since that plan won't work, white intends to exchange.  And, this time, black abides since her B is stronger.  Afterall, she doesn't need that N.",
        "8... Nxd5 9. exd5 d6": "So, black now decides to take advantage of her opportunity by continuing with development.  The only thing is that she has a little catching up to do, since white is slightly ahead in that department, given that he has one more piece out.  But, that's soon going to change as black will catch up shortly.",
        "10. Qg4": "At first, I didn't know why Gerhard played this.  White's N was protected by his LSB, so he doesn't have to worry about the loss of tempii, as everything is even.  Black was going to take with 10...Bxf5, but then white can recapture with 11.Bxf5.  However, the plan behind this is to mate black on h7 once he takes.  Will this plan work?  Stay tuned.",
        "10... Bxf5 11. Qxf5 g6": "Best, however, was to retake with 11.Bxf5, as opposed to 11.Qxf5?!.  So, as it turns out, the plan did not work.  @chicoboy: I've made this mistake before.  Having said that, the problem is that the plan is too obvious, so it can easily be driven off.  For that very reason, it's called a cheapo tactic, also known as unsound aggression since you're building an aggressive plan without creating a real problem for the opponent.  After which, you're faced with problems.  That's because black will gain tempii afterwards, which will allow her to get ahead in development.  In fact, she might complete it, whereas, you'll be continuing to develop.  This is why in one of his recent articles the World Champion, Magnus Carlson, said that cheapo tactics are not a good thing to attempt because it'll often cause you problems.  And, that's a well known chess fact, that I had to learn the hard way in some of my past games.   ",
        "12. Qh3 Nd7": "And, this is how black takes advantage of white's mistakes.  I used to think that development wasn't complete until the Q comes out, but I recently learned that once you're castled and all of the minor pieces, that's when development is complete.  So, black now has a slight edge.",
        "13. f4": "Very understandable, the idea here is for white to gain tempii in order to catch up on development.  The only problem here is that this move makes it unsafe for him to develop.  So instead, I would've developed my the DSB, right then and there, with something like 13.Be3.",
        "13... Bg7 14. O-O": "!?, Normally I would mark with a !.  But, because of his last move, better would've been to develop his DSB, and then castle Q side, believe it or not.  This move might expose white's K because his K is not completely protected since the e pawn has moved.  I know because I've done that before, and this has immediately exposed my K. ",
        "14... Nb6": "The idea here is for black to get her N off of the d file, without placing it on the rim, so that, she can get her Q out.",
        "15. c3": "? At first, I didn't understand why this was played.  But, now, it makes perfect sense.  With this move, white can develop his remaining piece, and keep his b2 pawn safe, at the same time.  However, a mistake because it loses a pawn.  Best was 15.Qf3 to protect it. ",
        "15... Nxd5 16. Qf3": "This time, what white played, is just, as good as, bringing the DSB out.  This move should gain tempii, and tempo is absolutely essential.  ",
        "16... c4": "?? However, this is what she played, and it's a blunder,  With this move white should win a free piece.  If this happens, everything changes, and white will go from a slight disadvantage to an advantage.  While, Gerhard would still be behind in development, he would be ahead in material, which is even more important.",
        "17. Bxc4": "However, white does not find the move.  Best, was 17.Qd5! as it wins a piece, as noted on above.  And, that's what I would've played.  Now, material is still even, and the circumstances regarding development are still the same.  In fact, black now gains time, once she retreats because it packs a counter attack against white's LSB.",
        "17... Nb6 18. Bb3 Rb8": "I don't know what this move accomplishes.",
        "19. Re1": "Likewise, I don't why white played this.",
        "19... a5": "Not sure, but my guess is that black moved with the idea being, that in the long term, probably near the endgame, this will become a passed pawn.",
        "20. a4": "If that's the case, white intends to prevent that from happening.",
        "20... Nd7": "I don't why black moved there.",
        "21. Be3": "And now, it happened.  White just completed his development.  With that being said, everything is even.  Too soon to tell, but in my mind, best play might lead to a draw.",
        "21... b6": "Connecting her pawns.  This is actually a good idea because it's well known that two connected pawns are often dangerous, when it becomes an endgame.  If this is what black kept in mind, then we know that she's thinking and planning ahead.",
        "22. Rad1": "Not bad, and this probably what I would've done to as it brings rooks together.  Not only that, but this move attacks black's d pawn.  This time, however, it's not the best reason since black easily protect it, without the loss of tempo.  Having said that, better might have been 22.Re2 as it would enable to double his R's on the next move.  Afterall, doubled R's are extremely dangerous.  This is actually one way that caveman1990 defeated me in our Caro Kann challenge. ",
        "22... Nc5": "As noted earlier, this move protects the d6 pawn.  In addition, it counter attacks.",
        "23. Ba2": "? But, this retreat is a mistake.  While it protects his LSB, this move loses a pawn, after 23...Nxa4, so best was 23.Bc2, keeping both his B and a pawn protected.",
        "23... Nxa4 24. Bc1": "I understand the intention here, as this move protects white's b2 pawn and keeps the c3 safe, as well.  But, I think that a better alternative was for Gerhard to bring one of his R's on the second rank.  Not only does it do the same thing, but at the same time, it keeps everything in tact because this move undevelops white's DSB.",
        "24... b5": "I don't know why black played this.",
        "25. Bb3": "In the meantime, white decides to take pressure off of the b file by attempting to force an exchange.",
        "25... Nc5": "But, black won't allow it.",
        "26. Ba2": "! To prevent black from attacking with her a pawn, white played this.  I think that it was a good choice as it prevents him from losing tempii.",
        "26... b4": "So, instead, black attempts to force an exchange.",
        "27. c4": "But, white declines it, and instead, plays this.  The goal is to get a passed pawn, with this move.  On a normal basis, I would've have exchanged, but not this time.  In that, I think that chicoboy made the right choice.  That's because, in general, you don't want to exchange, when you're behind, as it gives you less defend with.  Knowing that fact, I think that black had that in mind which is why she played 26...b4.",
        "27... b3": "So, instead, black attempts to win his LSB.",
        "28. Bb1": "But, white doesn't allow it.  ",
        "28... a4": "However, while it's not an endgame, yet, black's a pawn is already becoming very dangerous.  And, if she plays ...Ra8, that will wind up happening.  In fact, she'll then wind up with a winning advantage because that move will win material.  Having said that, with best play, black should win.",
        "29. Be3": "Well, this move redeploys black's DSB.",
        "29... Qc7": "Not sure why black played this.  But, best was 29...Ra8!! for the reasons that I outlined earlier, black would have a winning advantage due to his extra pawn.  And, that's also why it's also well known that, in general, \"Don't give things way.\"  Afterall, just one pawn is usually what makes or breaks a game, and this a perfect example.",
        "30. Bd4": "! and nearly !!  At first, I wasn't sure why but white is trying to and will exchange bishops.  However, this move is much better then it might appear.  What white calculates is about happen.  After the exchange, black attacks his e R, enabling Gerhard to double his R's.  ",
        "30... Bxd4+ 31. Rxd4 Qa5 32. Red1 a3": "? White, however, has a small problem, which he's about to deal with very easily.  That's his a pawn.  But, this time, once he exchanges, black's passed pawn is gone, ending the main threat.  In addition, this move is a mistake because once everything is said and done, white can win back a pawn.  So, in my mind, better was still 32...Ra8 for the same reason, as noted before.  Not sure, but I think that the advantage still would've been there.",
        "33. bxa3 Qxa3 34. Qc3": "But, white does not find the move, and, instead, plays this.  As it turns out, 34.Rxd6 was best, as that's the move that would've won the pawn back.",
        "34... Na4": "Instead, black hit's on white's Q.  ",
        "35. Qc1": "Normally, this counterattack would be ideal because of tempo gain, but because of black's next move, it does the opposite.  ",
        "35... b2 36. Qc2": "But, white still has some kind of plan.  What is it?  To force a draw by repetition.  But black is not going to allow it.",
        "36... Qe3+ 37. Qf2 Qc1 38. Qc2 Qe3+ 39. Qf2 Qxf2+": "The, plan, however, almost worked, and it would've, had black played 39...Qc1.   ",
        "40. Kxf2": "So, white's going to look for different opportunities.",
        "40... Nc3": "In this position, black intends to make white nervous, so that Gerhard will blunder a piece away.  However, that plan is not going, as black will find a way around it.  I know what it is, black thought that she had a successful N fork.  But, as we know, it's not so easy, and it usually doesn't work as the opponent can make one move that ends, as is this case.  That's why doesn't pay off to play move like this as most things like this, really aren't forking moves.  But, black has another plan, that's actually quite good.",
        "41. Re1 Rfd8": "Since that plan did not work, black, at last, protects has another.  She protects her d pawn.  The question becomes what is white going to do?  And, it's that kind of question that Mr. Stockel asks me, when he asks, \"Now what?  What are you going to do?\"",
        "42. Rd3": "Well, this is what he does.  The idea is to put pressure on black's N.  ",
        "42... Rb3": "This time, however, black will not be pressured.",
        "43. Ke3": "Now, that it's near an endgame, the K starts to become a powerful.  And, when it finally becomes, the K is extremely important, almost as much as, the Q, believe it or not.",
        "43... d5": "Why did black play this?  Afterall, this move is a mistake because it loses a pawn after 44.cxd5, or does it.  ",
        "44. Kd2": "! As it turns out, it doesn't, and this move is the right response and proof that your K becomes a powerful weapon in the endgame, since we're now approaching that stage.  As it turns out 43...d5 was a trap that black saw.  Had white would've lost instantly, had he played 44.cxd5??  Why?  After black recaptures with 44...Nxd5, white loses, at the very least, his d R for black's N, and probably much more.  Having that, this is best as now the K is the weapon that will prevent black from achieving her goals.  So, instead, black forces a long exchange variation, so that material wise, white doesn't lose any more.",
        "44... Nxb1+ 45. Rxb1 Rxd3+ 46. Kxd3 dxc4+ 47. Kxc4 Rc8+": "! This move is quite good.  Otherwise, white would automatically win back the pawn he lost with 48.Rxb2.",
        "48. Kd3": "However, white could've still tried to win it by playing 48.Kb3.  Would that have worked?  Probably not, as then black could respond with 48...Rb3.  However, he could still try with the idea being that after ward, he play 49.Kc3, Rc8  And, if that happened three times in a row, white would achieve his goals that he had earlier, a draw by repetition. ",
        "48... Rc1": "? Normally, this move would be ideal, extraordinarly brilliant, and, henceforth, worthy of !!.  That's because white would normally have to give up his R, in order to prevent the black's b pawn from promoting.  I know because this is how Jack Stockel has defeated me in a couple of drawish endgames.  So, this would normally be a winning move.  But, this, however, is a mistake because, in this particular position, white doesn't have to sac his R.  Instead, he can and will win back a pawn with 49.Rxb2.  And, there's nothing that black can do about that.",
        "49. Rxb2 h5": "So, black comes up with another plan.  The for connecting her remaining pawns is to keep them protected, so that one of them can promote.  Like before, normally that would work, but it won't, in this position.",
        "50. h4": "! Best, in my opinion, was 50.g3 for the exact same reason.  But, this move, is almost as good because it prevents black's h pawn from advancing any further, so that it can't promote.",
        "50... f5": "! And, white has the same idea.",
        "51. Kd4": "I'm not exactly sure why white played this.  He might, however, have been trying to use his K as a weapon, and there's nothing wrong with it.  But, in that case, 51.Kd2 would have been the best way to do that as it attacks black's R in a powerful way.  ",
        "51... Kf7": "Like before, I don't know why black this.  Perhaps, to achieve the opposition.  Either way, this is a drawn position, and if I were black, I would've went from preventing the by repetition to offering a draw.  And, if anyone offered it to me, I would've accepted the offer.",
        "52. Rb7+": "I don't know why, but, at this point, black resigned.  However, this wasn't necessary because, as noted above, it is a drawn position.  Aside from that both ivyiv, and chicoboy both played well, but there's some for black and even more for white to learn, as this particular game could've gone either way.  And, what you're about to learn, are the morals of this story.  First, remember, don't give things away, and don't leave anything en-prise.  For instance, black left her piece hanging with 16...c4.  Now, had white played 17.Qxd5!, as opposed to 17.Qxc4, chicoboy would've had a winning advantage, as he would be up two points, ahead, as opposed to, a pawn down.  And, black would've won, had she played 29...Ra8!!, as opposed to 29...Qc7 because she was a pawn ahead.  In addition, that extra pawn was the real danger.  Plus her b and a pawns were connected.  So, a R right on top of that would've won a lot of material.  Second, @chicoboy: unless your in a lost position, where you try anything to stay in and hope for counter play, so for a swindle, in general, unsound aggression is not good.  When you threaten an immediate mate, it's a good idea to ascertain that the threat is difficult to drive off, and not easy.  Basically, as difficult as, the opponent having to sac material, in order to avoid mate.  Otherwise, you will wind up with problems, once your opponent sees the threat and reacts to it.  The perfect example was 11.Qxf5!?, as once black responded, you fell behind in development, allowing black to complete it much quicker, whereas, it took you a lot longer to catch up.  Remembering these lessons will help you to become a better player."
    },
    "url": "https://gameknot.com/annotation.pl/a-white-challenge?gm=54406",
    "gameName": "A white challenge",
    "players": "chicoboy (1332) vs. ivyiv (1261)",
    "opening": "Petrov three knights game (C42)"
}