{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Bb5": "This is my favourite move in this position. I like to play Ruy Lopez rather than Giuoco Piano, Two knights defence etc.",
        "3... Bc5": "I haven't met with this reply before, 3...Nge7 or 3...a6 was usual to me. Therefore it was a new experience...",
        "4. Bxc6": "This is my usual fourth move.",
        "4... dxc6 5. d3 Nf6 6. Nxe5": "I think that I was bad there, I thought about 6.Bg5 too. But I was simply intended to the capture, because I had not much time to see many alternatives.",
        "6... Bxf2+ 7. Kxf2 Qd4+ 8. Ke1 Qxe5": "After all, the only things happened were; I lost my chance of castling and two of his pieces are near the centre. His bishop also can be easily developed, say 9...Bg4.",
        "9. Nc3 O-O 10. g3 Bg4 11. Qd2": "The queen has to be moved to the only safe square, what else to do?",
        "11... Rfe8": "The black army assembles to an attack, more correctly to an assault. It was a bit relief because the queen was in front, (not the rook). ",
        "12. Qf4": "I badly wanted to exchange the queens, and to make a safer surrounding to my king.",
        "12... Qe7": "He did not like it, he might be thinking that it was useful (as same as I thought about the black queen).",
        "13. Be3 Be6 14. Kd2 Nh5": "The knight is annoying my queen. Since I could not attack the horse from the queen and to keep some pressure on the f7 pawn, I decided to keep it on the same file.",
        "15. Qf2 Rad8": "A violent attack is nearly coming, at this point I was thinking that I was going to lose this game.",
        "16. Rhf1": "To make my power on the f-file to a higher extent, then he must allocate some more time to make his move.",
        "16... Nf6": "Sheltering my target pawn and making more power on the center. And he threatened me, with Bh3 and to collapse my centre,, I found no better option except 17.Kc1.",
        "17. Kc1 Ng4": "The horse is troubling me again ",
        "18. Qf4": "Did I do a simple mistake there, I have a doubt. In the case of 18...Nxh2 I had been thinking about to launch an attack on the h-file. I think that my best response might be 18.Qe2. ",
        "18... Nxe3": "He cut the bishop, that made me a sigh, because it was the move I hoped there in that instance.",
        "19. Qxe3 Bg4": "He is limiting the available space for my king.",
        "20. Qf4 Bh5 21. Kd2": "I needed to take the other rook too. It had not been moved yet. It was sleeping.",
        "21... c5 22. Nd5": "Here I managed to exert some pressure on his attacking structure by a simultaneous attack to the queen and to c7 pawn.",
        "22... Rxd5": "Very offensive move!! I think that it was the mistake he did to make me win in that game.",
        "23. exd5 Qe2+ 24. Kc3 b5": "Queenside pawns were rushing towards my king. A trouble was nearby coming.",
        "25. a3 a5 26. b4": "The only way I saw to prevent his next move 26...b4.",
        "26... cxb4+ 27. axb4 axb4+ 28. Qxb4 Bg6 29. Qxb5 Qe5+ 30. Kb3": "My king just got rid of the available checks.....",
        "30... c6": "An attempt to pin the queen with 31...Rb8 as I saw.",
        "31. Qxc6 Rb8+ 32. Kc4": "This was the real place where my king really became safe and sound.",
        "32... Bf5": "Another attempt to pin the queen with 33...Rc8. Wasn't it?",
        "33. Ra8": "I pinned his rook more earlier.",
        "33... h6": "He was eliminating the opportunities for a backrank mate.",
        "34. Rxf5": "I was attacking the queen and the rook at the same time, where every option was better to me than him.",
        "34... Qxf5 35. Rxb8+ Kh7 36. d6": "The d-pawn will generate another queen. So he resigned. It was an interesting game. Thank you, tarek1974."
    },
    "url": "https://gameknot.com/annotation.pl/a-win-i-did-not-hope?gm=37233",
    "gameName": "A win I did not hope",
    "players": "chrishan43168 (1449) vs. tarek1974 (1705)",
    "opening": "Ruy Lopez (C64), classical (Cordel) defence"
}