{
    "moves": {
        "1. d4 d5 2. Bf4": "My favourite. It just transposes, but I can have a better control of the lines I know best. Not well enough, as someone just showed me (but from a +2000 rating... :-). ",
        "2... e6 3. Nf3 Nc6": "I don't like black blocking his own \"c\" pawn, but a lot of people does it... under 1800, normally... ",
        "4. e3 a6 5. Nbd2": "Tempting my opponent into B or N b4. But I like this kind of developement regardless it. ",
        "5... b5": "Making the strongest (other than c5) attack black can have in this opening. Good. It will be a nice game. Now, I can defend or just ignore it and take advantage in the developement. Guess what did I choose?",
        "6. c3": "Defending, for now. Against my style. ",
        "6... Bb7": "Black gives another chance for me to do that. The key of this black setting is that I have to be very, very careful not to open the diagonal. So be careful with the exchanges in e5. On the other side, this is the key of my scheme, so...",
        "7. g4": "I'll be careful, I promise! But now I have a tempo: after Nf6, I have to prepare this move, now I have it done before. It's a risky plan: I'm giving up a safe castling. But this is fun...",
        "7... Bd6": "I would have rather thought about b4 at once. Black looks as wanting to cooling down things... or provoke an exchange in e5 so he can play d4, opening the diag. Ok. I will accept it. ",
        "8. Ne5 f6": "Black spares me of the piece exchange, and made the game much more interesting. Now I have a chance to leave the diagonal closed forever. I don't like to change plans, but it seemed that my previous plan was not so good, so...",
        "9. Nxc6 Bxc6 10. g5": "!? Probably it won't hold a serious analysis, but the idea is to open the diagonal for the queen. If fxg5, Qh5+, g6, Qxg5, with an even position. But black played...",
        "10... Bxf4 11. exf4": "Same as before, and the black's lsb is still trapped. ",
        "11... Qd6": "Attacking my weak point. As always, I try to find a counter attack even more dangerous than a defence...",
        "12. Qe2": "After Qxe6+, the bishop falls, and the rook will be threatened. No way. ",
        "12... O-O-O 13. Bh3": "This is how I like to move this bishop: attacking, not just developing. True, it's a double edged weapon. Anyway, this is not such a good move, because it just allows black...",
        "13... Bd7": "...to give a purpose to his bishop. I can't attack e6 very easily, but I have to use the pressure against it to control the game and build an attack. Now, my pawn on f4...",
        "14. Qh5": "I won't leave the initiative to black by defending the pawn. This was and adventure. ",
        "14... Qxf4 15. Nf3": "For example: if black plays 15... e5, 16. BxB+, KxB (oherwise, Qe8+), 17. Qf7+, and if Ne7, gxf6... isn't this a nice position?",
        "15... Qe4+": "Ok, come on, no problem. Just leave me space for my rooks...",
        "16. Kd2 Qg6 17. Qh4": "No I won't exchange quens. ",
        "17... Ne7": "But black is untangling himself, so it's time to take advantage of my rooks. ",
        "18. gxf6 gxf6": "Qxf6 could have been safer, but he correctly wanted to control e5 with a pawn. ",
        "19. Rhg1 Qf7 20. Rae1": "Well, he can defend, but I have all the aces. ",
        "20... Rhg8": "Good. I lacked clarity to find the winning attack, but his queen is hanging, so he can't use the f6 pawn to control e5 if it is pinned... by my queen in f4. Very dangerous, but...",
        "21. Qf4 Qh5": "Clever, unpinning the queen and treatening the bishop, but losing, as it concedes e6. This game is becoming a real tour de force. ",
        "22. Bxe6 Ng6": "Oh, my... there is no end to complications? :-D",
        "23. Qxf6": "Yeah, but doing so I'm opening the column to his rooks, too, so I am losing the knight for a start. Will I be able to save it? Let's see...",
        "23... Rgf8 24. Bxd7+ Rxd7 25. Qxa6+": "My secret weapon, the risky move I was looking for. ",
        "25... Kb8 26. Qxb5+ Kc8 27. Qa6+": "Do I have draw? Will it be wise? I have +3, I can afford the loss of the knight, but I wanted to use it into the attack. RxN, to Ne5 would work?",
        "27... Kb8 28. Re3": "Setting a nasty trick: if RxN, Re8 and forced mate!",
        "28... Rd6": "Will my insurance hold against this?",
        "29. Qb5+ Rb6": "Thank you my dear! I thought I saved the knight, but I overlooked the \"hole\" on b2. ",
        "30. Re8+ Rxe8 31. Qxe8+ Kb7": "...and now I have two pieces to save. And no checks. Very nice... :-(",
        "32. Rg3 Rxb2+ 33. Kc1 Rxf2": "Nice. Now it's my turn. And my problem is, and will forever be, that I cannot use my rook. It was a bad idea?",
        "34. Qb5+ Kc8": "And here the blunder. Should I have gone for a drawn game, or try Ne5, threatening d5 (but Qxh2 and it's mate in one...)",
        "35. Qxd5": "I forgot to play Ne5 first... :-(. Here, my opponent gave me a chance, and played...",
        "35... Qh6+": "Nothing else could have been done, since I took the pawn. Now, black thought that he will win anyway, but...",
        "36. Ng5": "I can block the check. I swear I can afford Qxh2, but now my knight can play a role, and maybe my rook would find a Re3+ move to turn the game into my favour. ",
        "36... Qxh2 37. Qa8+ Kd7 38. Qa4+ Kc8 39. Qe8+ Kb7 40. Qb5+ Kc8": "Nothing to do. I can defend from the mate (for instance with Nf3), or go for a draw. ",
        "41. Qa6+ Kd7": "Was this a mistake? Let's see...",
        "42. Qe6+ Kd8 43. Nf7+ Rxf7": "FORCED! But my rook is \"en prise\". And I cannot go RxN, because of Rf1#. Nice, isn't it?",
        "44. Qxf7 Qxg3": "The last risky move: ",
        "45. Qxh7": "He will grab my pawns, but he will lose his knight, and it will be a drawn. Let's see how black tried to get out of it. ",
        "45... Qxc3+ 46. Kb1 Qd3+ 47. Kc1": "He must not give check when taking the pawn, so I can take his knight. Now, he can't play Nf4 because of Qh4+, winning the knight on the next move. \n",
        "47... Qe3+ 48. Kc2 Qxd4": "I adviced: it is drawn. \nI would have given the game to him, because he deserved it (I blundered, anyway). But this is draw...",
        "49. Qxg6 Qc4+ 50. Kb2 Qb4+ 51. Kc2 Qa4+ 52. Kb2 Qb5+ 53. Kc2 Qc5+ 54. Kb2 Qe5+ 55. Kb3 c5 56. Qb6+ Kd7 57. a4 Qd6 58. Qb7+": "A step behind can make the difference in a king's endgame. ",
        "58... Qc7 59. Qxc7+ Kxc7 60. Kc4": "but no enough difference. ",
        "60... Kb6": "Nothing to do, it's a draw. Thank you for reading...",
        "61. a5+ Kxa5 62. Kxc5": ""
    },
    "url": "https://gameknot.com/annotation.pl/a-wild-ride-with-a-blunder?gm=51523",
    "gameName": "A wild ride with a blunder.",
    "players": "damalfi  vs. hgj1601 ",
    "opening": "Queen's pawn, Mason variation (D00)"
}