{
    "moves": {
        "1. d4": "This was my first ever over-the-board tournament game.  At this point, I had been playing on Gameknot for about 2 years and felt ready to try my hand at \"real world\" chess.  The tournament was the 4th George Washington Open held in Springfield, Virginia.  As is typical in open play, my first round Friday night game was against a relatively highly rated player.  \n\nPlaying black, I set up my board and clock and anxiously awaited the start.  When the start was announced, my opponent wasn't there!  I started my clock and waited.  He must have been stuck in traffic, as he showed up and quickly played d4.\n\nEven though I'm in my mid-thirties, I was incredibly nervous about this first tournament experience.",
        "1... Nf6": "I was happy with d4, because, at this point in my study, I was a still a little \"scared\" of e4 openings.  Nf6 was comfortable for me.",
        "2. Nf3": "Bolstering his d4 pawn and establishing control over two of the center squares.  e5 for black is now, pretty much, out of the question.",
        "2... g6": "I'm anxious to quickly castle.",
        "3. c4": "Taking advantage of the open board to advance his c pawn and establish control over a third center square.",
        "3... d6": "d5 probably would have been better.",
        "4. Nc3": "Doubling up the protection on d5.  Matching power on e4.  Advantage on d5.",
        "4... Bg7": "I'm still fond of the fianchetto, but I've come to realize that there are times to do it and times to attack the center squares more directly.  In this case, it's probably a decent move, and I've already pretty much committed to this line from 2. .. g6.",
        "5. e4": "White now dominates the center squares and has three pawns on the 4th rank.  This is a very strong opening for white.",
        "5... Bg4": "As I recall, my philosophy at the time was that trades against a higher-ranked player get me closer to a draw.  Certainly nothing necessarily wrong with this move.",
        "6. Be2": "A smart response.  This develops the board and provides extra defense.  ",
        "6... O-O": "This for me was and is a familiar position.  I need to work on recognizing whether the particular game situation warrants this position rather than relying simply on rote memory.",
        "7. h3": "This says, \"Do something or leave!\"  It seems that the earlier you do this, generally speaking, the better.  It weakens the potential short castle, but it forces a decision to capture or a retreat.",
        "7... Bxf3": "I elect to accelerate the game, avoid potential complex situations in the midgame and exchange the bishop for a knight.  I'm happy at this point, as I've weakened any potential castle.",
        "8. Bxf3": "As it happens, this allows white to bolster his position at e4.",
        "8... Nbd7": "All of black's mid-level pieces are out.",
        "9. Be3": "All of white's mid-level pieces are out.",
        "9... b6": "I think I'm trying to set up c5, but, for some reason, I don't follow up.",
        "10. Qd2": "Establishes a powerful bishop-queen line on the castle.  Also, gives white the option for a long castle, which, eventually, he exercises.",
        "10... e5": "If white captures dxe5, then I would respond with dxe5 or Nxe5.  But, white also has the option to advance and lodge a pawn firmly on my side of the board.  c5 might have been better.",
        "11. d5": "d5 seems to be the best move in this situation.  I'll have to remember to plan for that.",
        "11... h6": "Nerves got to me.  I fully recognized that the bishop and queen were stacked, and I simply blanked and thought I was protecting against that combination, when, obviously, I walked right into it.  A terrible move that changed the entire complexion of the game.  I certainly hope I'll never make this mistake again.  :-)",
        "12. Bxh6": "He seemed almost apologetic in taking the pawn.  I was embarassed, but decided to do what I can to try and fight back.",
        "12... Bxh6": "Looking back, I was already down the pawn, and there really wasn't anything to be gained from this for black.  Doing nothing would have been better.  While white could still capture, I wouldn't have to immediately deal with the queen.  But, I captured thus inviting the queen into my court.",
        "13. Qxh6": "Never a pretty sight.",
        "13... Nc5": "Trying to recollect myself, I saw the possibility for a knight fork.",
        "14. O-O-O": "He saw this thinly veiled threat and quickly long castled and eliminated any immediate threat by the knight.",
        "14... Nh7": "I guess I figured I'd have a better chance if we traded queens, so I set up the trade.",
        "15. h4": "He recognizes the plan and moves to stop it.",
        "15... g5": "I was rather proud of this little maneuver.  h5 would only contribute to the possibility of trapping his own queen, so ...",
        "16. hxg5": "... he captures.  In so doing, he's opened up the h-file to his rook.",
        "16... Qxg5+": "With the king in check, the queen trade is possible whether he takes immediately or not.",
        "17. Kc2": "He elects to make me choose to make the trade.  In doing so, he avoids having my knight advance to g5.",
        "17... Qxh6": "I take the trade.",
        "18. Rxh6": "Now, the rooks are the big boys on the board.  Unfortunately for black, white has a clear line on stacked rooks.",
        "18... f6": "I see the stacked rooks coming and try to get the king to the other side of the board.",
        "19. Bh5": "He sees this plan and wisely blocks it.",
        "19... Kg7": "I'm hoping he would move to allow me to get to f7.",
        "20. Rg6+": "He obliges.",
        "20... Kf7": "I think I'm home free ...",
        "21. Rh1": "Here comes trouble.",
        "21... Rfg8": "This seems foolish to me now.  Never trade pieces when you're behind.  I guess I was eying the pawn at g2.",
        "22. Rh6+": "This was smart as it forces me to consider losing the knight.",
        "22... Kg7": "My only move to save the knight.",
        "23. Bg4": "Stacked rooks make lots of power.",
        "23... Ng5": "I probably should have moved the rook into a support role at h8.",
        "24. Bf5": "White is slowly choking off my avenues of escape and tightening the board.",
        "24... Rgh8": "This move came too late.  Now, I'm inviting a trade.",
        "25. Rh6xh8": "White is happy to trade.  His position is better, he's up a pawn, and he's further advanced in the middle.",
        "25... Rxh8": "I had to respond to this point.",
        "26. Rxh8": "Again, white has the same decision.  Why not trade?",
        "26... Kxh8": "What's black's strategy now?  The open file is the g-file, so I probably should have been looking for ways to clog that line.  Also, I should have been aware of the weakness of the position of the a-, c- and f-file pawns.  ",
        "27. b4": "White advances and pressures the knight into action.  27. .. Nxe4, 28. N/Bxf4 Nxb4 might have been interesting.",
        "27... Nb7": "This is the only safe non-sacrificial move.",
        "28. Nb5": "A knight fork that costs me a pawn.",
        "28... a5": "This only accelerates matters in white's favor.",
        "29. a3": "White gladly sets up the trade.",
        "29... Kg7": "I have no idea why I thought it would be helpful to advance the king up the h-file.  Desperation?  I now realize that this wasn't yet a clear win for white.",
        "30. Nxc7": "White takes his pawn.",
        "30... Kh6": "The king takes a walk in the park while the empire crumbles.",
        "31. Ne8": "Another knight fork in the making.",
        "31... axb4": "Trade pawns at this point?  Why?",
        "32. axb4": "White is happy to accelerate.",
        "32... Kh5": "The jaunt continues.  Aren't the trees pretty?",
        "33. Nxf6+": "Oh, let's just give white a pawn and a check.",
        "33... Kh4": "This shows off a good endgame note.  Side-by-side pawns are a great king blocker.  They take up huge space as far as the slow king is concerned.  Even though white didn't force the issue, I walked right into a wall.",
        "34. g3#": "I really didn't have a deathwish here, but that's exactly what I did.  At this point, I certainly hadn't studied much about the endgame.  The one brightside, at least I made such goofball mistakes against a relatively highly rated player."
    },
    "url": "https://gameknot.com/annotation.pl/a48-kings-indian-east-indian-defence?gm=11140",
    "gameName": "A48: King's Indian, East Indian defence",
    "players": "Keith Melbourne (USCF 1811) vs. rpilaud (USCF unr)",
    "opening": "King's Indian (A48), East Indian defence"
}