{
    "moves": {
        "1. e4": "My preference is 1.e4, however I absolutely respect almost all other first moves.  As Black many have caused me grief.  I especially have learned to respect 1.b4 the hard way!",
        "1... e6": "A possible French or Sicilian?  Seems BOTH are at least as popular as 1...e5, though most 1.e4 players might prefer 1...e5!",
        "2. d3": "I have been scoring poorly with my Advance French lines and my Open Sicilian lines so let's go for the KIA or Closed Sicilian.  Actually I just took up the 3.d4 Sicilian stuff as White.  It has not gone well in the first few contests.  I have played the French Advance for many years and apparently Black has figured out everything.  Just comes down to the higher rated doing better....",
        "2... d5": "French versus King's Indian Attack it is!  There's some theory. but you can almost play either side without memorizing lines or checking your chess book library.  I DO have a few King's Indian Attack books, but only John Emms' \"Attacking with 1.e4\" concentrates on the French Defense move order.  As of today, 10-11-2011, I think the book is still in print.",
        "3. Nd2": "The standard KIA Knight deployment. On 3.Nc3 after 3...d4 4.Nce2 we get into the land of the Dunst Opening: 1.Nc3 d5 2.e4 d4 3.Nce2 with two extra pawn moves added.  After 4...e5 it is a standard Dunst position.",
        "3... Bd6": "Interesting.  I have not used the KIA much until recently so every game offers a new vision of the opening.  My opponent is a reasonably strong player rated around 1800.  Statisitics say he is better than me so I am respecting 3...Bd6.  I assume he might like to enforce an ...e6-e5 advance soon.  Or perhaps he is planning ...f7...f5!?  Or a Semi-Slav pawn structure (French meets Caro...yuck...too solid!).",
        "4. Qe2": "Initially (short range) this is indirect pressure on the d5 pawn mainly.  Without additional protection 5.exd5 might create issues.  Nevertheless, this is unlikely and long term I am strengthening e4 and committing to putting my Bishop on g2 or h3 since the Queen currently blocks the King's Bishop. ",
        "4... Nc6": "Now 5.exd5 can also met with 5...Nd4.  Does not seem all that good, but it is pesky.  My guess is this would be a gambit of sorts.  I do not want to fall far behind in developing pieces as my King will need four moves to castle short and three to go long.  I do not want to go long on the castle because there is not much defensive or offensive firepower for my use on my Queen side at present.",
        "5. Ngf3": "Let's stop the ...Nd4 threat and develope another piece!",
        "5... dxe4": "Black releases some central tension...",
        "6. dxe4": "Can I get in 7.e5?",
        "6... e5": "A Double King Pawn Opening type position has arisen on the board.  In my limited chess experience French players seem to rarely play an early ....e6-e5.  Viva la difference.  Je parle francais en pus en pus.  That is something to the effect of I speak a little (very little) French!  Don't fuss at me if it translate poorly.  That is exactly the point! ",
        "7. Nc4": "Well...I have to move the Knight to develop the Bishop unless I fianchetto.  So maybe I get the Bishop pair in an open position?  The Bishop is tied to the defense of e5.  I get a free pawn to munch if he moves the Bishop.  Now the open position is another story.",
        "7... Be6 8. Nxd6+": "Yep!  Bishop pair come to me.",
        "8... cxd6": "And maybe a backward pawn on an open file to pile on.  If I were my opponent I would strongly consider an immediate ...d6-d5 advance.",
        "9. c3": "What's the word...prophylaxis? In other words, keeping the Knight or any other Black piece off d4 for now.  Remember chess is dynamic.  May need to later advance the c3 pawn to stiffen the defense of another square later.",
        "9... Nge7": "This formation is similar to Black's Sveshnikov Sicilian formations and strongly suggests that ...f7-f5 now or in the near future is a good freeing move, but I still like ...d6-d5.  Perhaps a daring soul would play both pawn breaks? Which first I wonder?",
        "10. Be3": "10.Bg5 just runs into 10...f6 or 10...h6.  I would just as soon keep the Black Queen off b6 instead.  ",
        "10... O-O": "Yes... I know the Knight is usually not on e7 in the Sveshnikov.  It is better here on e7 as it helps facilitate either pawn break.",
        "11. Qc2": "Planning to attack on h7 if possible and clearing the diagonal for the Bishop.  The King's Bishop's first future square is undecided at present, but I do not seem to have enough time to fianchetto now.",
        "11... f5": "Since White can threaten h7 quickly after 11...d5 12.exd5 Nxd5 13.Ng5, perhaps now the f5 break is \"safer\"? ",
        "12. Bd3": "In light of his next move, maybe 12.exf4 is better and then 13.Bd3 follows IF he does not recapture with is Bishop.  Actually I prefer the game move.",
        "12... f4": "Geez...what a spoiler!  Good move!  Seals off my short term attacking prospects on the King side.  The exchange 12...fxe4 seems to benefit White more than Black.  I'm still behind in development and must now move the Bishop too...",
        "13. Bd2 Rc8": "It's always a cool move to put x-rays on the higher valued piece.  Why is it an x-ray?  Well...this is not direct pressure.  And if White is not paying attention the threat is invisible just like radiation.  Later the effect can be fatal however....",
        "14. Qd1": "I did notice.... Black also had the threat of ...Nb4 against the Queen, Bishop and with the Bishop's help on e6, the a2 pawn. I am beginning to suspect that the d-pawn is going to stay on d6 however. If I can only get developed that pawn sure looks tasty!",
        "14... Qe8": "Black Queen to the King side?  Could be trouble.",
        "15. Ng5": "This takes h5 back and threatens the unprotected Bishop.  Castling seems nice, but then Black will develope an initiative on the Kingside.  So...presently no time for classical chess principles!",
        "15... Ng6": "Defends e6.  Also possible were 15...Qg6 or 15...Bd7.",
        "16. Qh5": "This is why I preferred 15...Qg6 as a defensive resource.  As 15.Ng5 took h5 from Black the move 15...Qg6 keeps the White Queen from immediately occupying h5. Of course after 15...Qg6 16.Nxe6 Qxe6 17.Qh5 is possible, but lacking the Knight the White Queen has no teeth in her bite. Presently mate in one is threatened. To think all I wanted to do was castle.... ",
        "16... h6": "Simple chess fixes the threat.",
        "17. Nxe6 Qxe6 18. O-O Kh8": "Neither side seems to have much of an edge.  Of course the mate in one threat was easy to see and parry with 16...h6. I need to open the position for my Bishops and put my Rooks on good squares in the short term.  I probably need to retreat my Queen at least to e2, but then Black gets a free reign on the King side.  For Black maybe the long avoided ...d6-d5 is good now?   Well...I think it is.",
        "19. b3": "Trying to stop ...d6-d5 next move...",
        "19... Nce7": "Seems to be preparing ...d6-d5.  Had I moved my Queen back to e2 he would not have needed to make any preparations for the pawn advance.",
        "20. c4": "So I stop the last chance to play ...d6-d5 just as it seems he may finally see the plus side.  That move had been available since Black's 9th.  In other words this is the first chance I have had to stop the advance and make the backward pawn something of a problem forever....  I would still call the position equal as neither sides pieces have much scope.",
        "20... Nc6": "Of course as mentioned earlier when the c-pawn advances another hole is created on d4.  Such is the give and take of chess moves.  The idea is to get more than you give with each move!",
        "21. Bc3": "I am willing to cede d4 to a pawn, but not to a Knight.",
        "21... Nce7": "He opts out of 21...Nd4 once the Bishop arrives to threaten 22.Bxd4.  Of course after ...exd4 he would have e5 for his other Knight and my Bishop would be both threatened and semi-useless too.  He also would thereby eliminate the Bishop pair as a long term plus for me. Alternatively he might try 22...b5?!?, but this might end up favoring me. I could see the possibility of ...d6-d5 being revived in one line (23.Rac1 bxc4 24.Bxc4 d5 25.exd5 Nxd5), but he will need to first defend the g6 Knight somehow and 22...Kh7 planning 23...b4 is dangerous due to the Bishop being on the same diagonal. Of course playing 22...b5 does not require 25...d5 as a follow up move. There's a lot going on in this seemingly quiet position.",
        "22. f3": "Solid, but boring!  I was actually unhappy making the move despite feeling the position required me to freeze his f-pawn for now.  I am obviously NOT having success opening the position or placing my Rooks.\r\nAnd my Queen does not look real happy now.",
        "22... d5": "Not a good move now in my humble opinion.  Just loses the pawn and a tempo. The subsequent weaknesses probably cause the final result.  I'd probably redeploy the Knight via g8 and f6 when White's Queen is under threats and other than the backward pawn Black will be doing well.",
        "23. exd5 Nxd5": "I missed this.  Or rather I did not consider the move because the tactic seems flawed. This move is definitely costly to Black's cause.",
        "24. cxd5": "Flawed because the capturing pawn's threat to the Queen allows White to cover the loose piece before Black can pick it up with ...Rxc3.  Those brave little pawns!  And remember John Nunn's famous LPDO mnemic device (Loose Pieces Drop Off).  Fortunately the piece is not really loose.  Maybe this is what my opponent missed when he started the faulty combination beginning with 22...d5?  All I can say is \"Been there and done that many times while playing correspondence chess.\"",
        "24... Qxd5 25. Qxg6": "Mate threat restored since Black opened the position for me. My opponent resigned here as he is down a lot of material after the unfortunate combination, but he could have played on for some time after 25...Qg8.  White's options then include 26.Bc4 and 26.Bxe5.  Black might try 26...Rc6 after the latter.  Alternatively 25...Qc5+ renews the threat to win the c3 Bishop, but after 26.Kh1 Black can not stop the mate in one.  Basically averting mate will leave a lost ending of pawns against pawns and two Bishops.  An interesting game.  White was never really better.  Black made a mistake late and White was opportunistic however."
    },
    "url": "https://gameknot.com/annotation.pl/a50tangos-mini-tournament-v?gm=41082",
    "gameName": "a50tango's mini-tournament V",
    "players": "a50tango (1621) vs. cruiseylee78 (1751)",
    "opening": "French (C00), Reversed Philidor formation"
}