{
    "moves": {
        "1. c4 g6 2. Nc3 Nf6 3. g3 Bg7 4. Bg2 O-O 5. d3 d6 6. e4 c6 7. Nge2": "So really it is a english opening, with white getting a powerful grip in the center, on the light squares. The advantage of this system is that white will always have a lot of space, and has potential on the kingside with the e4 pawn. In most variations, white is planning on the kingside area. In english opening variations without e4, white is seen playing Rb1,b4,b5, and attacking the queenside. ",
        "7... a6 8. O-O b5": "Black is executing his plan of attacking the queenside right away after making the obligatory Nf6,Bg7,0-0. Although the center is techincally still dynamice in nature, it is difficult to open it up, since both sides have adequete control over it. Therefore, a flank attack is totally acceptable.",
        "9. h3 e5 10. Be3 b4 11. Nb1": "11.Na4 c5 leaves the knight in a precarious situation.",
        "11... c5 12. Nd2 Nc6 13. f4": "Here, white had a choice. He could choose the plan of 13.g4/Ng3, but that would be a bit too slow. The move 13.f4 certainly frees the g7 bishop, but the benefits given to white should not be overlooked. White's pieces, including the f rook and the e2 knight are both gaining in activity.",
        "13... exf4": "Certainly now, a move like 14.Nxf4 would lead to a balanced position without real tactical complications. However, the next move drags both players into a deep complex tactical battle.",
        "14. e5": "(?!!)A very interesting tactical idea. Now black has 3 main candidate moves. 14...dxe5 15.Bxc5 is easy. 14...Nxe5 15.gxf4 with a double attack on the rook and the knight. 14...fxe3 gives white a choice. A)15.Bxc6 and now black has a choice. A1)15...exd2 16.exf6 Bxf6 17.Bxa8 Bxh3(or 17...Bxb2 first) 18.Bg2 white has some advantage. A2)14...dxe5 15.Bxa8 exd2 gives black the advantage. He is getting many pawns for the exchange, as well as active pieces. By the way, there were more variations that needed to be calculated. I am just listing a few. Therefore, white needs to play B)15.exf6 Bxf6 16.Bxc6 Bxh3! 17.Bxa8 Qxa8 18.Ne4 Bxb2 with a advantage to black, but nothing winning. Just listing these few variations makes my head start really hurting:). And these were just the main lines that we needed to calculate! To calculate the variations properly, you really needed to slow down, during each half move, and ascertain ALL the new candidate moves for each side, keep track of the material properly, and avoid fainting at the same time, and much more! Certainly, black could have gotten an advantage with taking 14...fxe3. However, the resulting position is still complex. Maybe black missed the variation. That would be possible, considering the difficulty of the calculation here. Absolutely crazy position! However, this is just the beginning! Black now chooses to take up the complexity up another level(!) and plays a dubious, extremely complicated move. ",
        "14... Nh5": "The fourth candidate move! Now the position requires immense precision. In fact, I will not attempt to calculate many lines. I will just find the candidate moves for each side for each ply. Ready? Now white can play 15.gxf4,Bxc6, g4. After 15.gxf4, black has Bb7 only, as it is clearly the best move. But then there are not many tactics. As a last judgement, the h5 knight is misplaced. 16.Ne4 looks accurate. OK, but after 15.Bxc6, black can play 15...Bxh3,fxe3,. After 15...Bxh3, white can play 16.Bxa8 Qxa8 with complex position. Also, white can play 16.Nxf4 with also complex position. So many different moves at each ply. Actually, IM Lilov told me he spent almost half an hour calculating the variations in this position. Unfortunately, the position is very complex, and he made an oversight. ",
        "15. Bxc6 fxe3 16. g4": "(?!)A very nice interesting idea, which gets white the advantage if black does not find the right reply. Actually there are 2 replies of equal strength; black just needs to find the right idea. It is clear right now that both the rook and the knight are hanging, but the knight is trapped. So by logic, shouldn't we save the rook?",
        "16... Ra7": "(!)16...Rb8 leads to the same result. When you look at this move here, it seems so very simple to find this move for black. However, to tell the truth, it is very very difficult. There was no way for white to know that this was the key line when there were many other side variations that needed to be calculated. Some of them had multiple branching points at every half move, leading to dozens of variations. It is calculation at the highest level! By the way, most calculations an master makes in his games will never look anything close to this. There are usually few branching points in the simpler variations, so we can calcualte them easily. Now, the critical moment has passed, and black has a winning advantage. However, Nevednichy, the GM, is confused and blunders the advantage right back!",
        "17. Nf3 dxe5 18. gxh5 Bxh3": "The smoke has more or less cleared, and black has a crushing attack and 3 pawns for the piece. Now, 19.Re1 Qc8 wins for black.",
        "19. Ng3 Bxf1": "(?)Certainly not the best move. 19...e4! would have opened up decisive lines against the weak white king, and frees the bishop. The f1 rook is not going anywhere after 20.fxe4 Qd6 with a raging initiative.",
        "20. Qxf1 Rc7 21. Bd5": "And in just these few moves, the position is more or less balanced! It is still probably somewhat favorable to black, but both sides have chances. Although black has the rooks, they are not effective, since all their open files are totally blocked off! ",
        "21... Rd7 22. hxg6 hxg6 23. Qh3": "Now white is back in the game, and has a clear plan. He has more force on the kingside, so it is time to start an offensive there.",
        "23... Rxd5": "Probably the best move, showing that the d5 bishop is worth more than the rook. ",
        "24. cxd5 f5 25. d6 Kf7 26. Rf1 Rh8 27. Qg2 e2 28. Nxe2 Qf6": "Must have been in some time trouble, or his head may have been hurting here:). Also, he must have been upset that he had lost his advantage before. Probably all of those factors led him to forego a safety check of this move. Now white can win instantly.",
        "29. Ng5+": "Now black has to give up the queen to avoid mate, so white has won. An amazing game. Neither player can be blamed much; Very few chess players would be able to even find the right candidate moves in the variations."
    },
    "url": "https://gameknot.com/annotation.pl/absolutely-crazy-chess-game-between-masters-fide-ratings?gm=45450",
    "gameName": "Absolutely Crazy chess game between masters(FIDE ratings) ",
    "players": "IM Valeri Lilov (2430) vs. GM Vladislav Nevednichy (2553)",
    "opening": "English opening (A10)"
}