{
    "moves": {
        "1. e4": "This game for me is intriguing because it demonstrates how to take a common opening, the standard 4 knights and create a peculiar variation which becomes very different for the other player to anticipate.  ",
        "1... e5 2. Nf3 Nc6 3. Nc3 Nf6": "Textbook.",
        "4. Bc4": "At this point, the opening is now a variation of the four knights called the Italian variation. At the level I play it, I've seen this opening quite a few times because it has a simple objective for white that allows you to easily develop pieces. The goal is obviously put a knight on f7 and claim the rock. Black can play defense h6, or mirror it by Bf5. But this time I thought that perhaps of a different order would be fun to try.",
        "4... Nxe4": "From here white was in I suspect uncharted territory. He can easily gain material by grabbing the knight, but d5 means he will lose that material advantage on the next move. According to gameknot's DB, the other popular choices are Bf7, wherein the bishop is sac. to expose the black king or that white castles in order to put pressure on black's king. Both require a lot of knowledge about this opening which neither of use really had. ",
        "5. Nxe4 d5": "White's position is now unstable. I suspect the correct choice is to preserve the knights to harass Black's queen.  ",
        "6. Bb5": "White instead decides to save the bishop, I pick up the knight. ",
        "6... dxe4 7. Bxc6+ bxc6": "White decides to exchange his way out, which might seem like a good idea but is in fact a mistake. White has thrown away all of his developed pieces and the knight has to retreat back to g1. Nxe5 seems to be a good idea, but as we'll see results in disaster. ",
        "8. Nxe5": "Seems like a good option right? White evens out material and puts pressure on c6 pawn. However underneath the tranquil surface of the board, this move allows black to permanently seize the initiative.  ",
        "8... Qg5": "From here, the knight is lost. Maybe you can save it by d4, but c5 eliminates the defending pawn.. which is in turn defended with the black bishop. If anyone has played out that exchange, I'd love to hear how it turned out. \n\nThe real threat is Qxg2, the center pawn, and the fact that both black bishops are free to attack. ",
        "9. Nxc6": "White perhaps hopes he can ride out the storm and pick up a pawn. However, his king side is so woefully developed that he has no material to defend the coming onslaught. ",
        "9... Qxg2 10. Rf1": "White consolidates the position, but it won't help. ",
        "10... Bg4": "This move to me seems downright perfect. You could win the rock with Bh3 (or the queen eventually... Bh3, k2e, Bg4) , but this is better because it incorporates the pawn. And because that pawn on e4, white's pawn on f2 is basically nothing more than cannon fodder. ",
        "11. f3 Bxf3 12. Rxf3 exf3": "It's here where the pawn comes into it's own. By including the pawn, instead of exchanging his way into a material deficit (black's queen can easily break off the attack to bag the knight), white no has his back against the wall without much room to maneuver. ",
        "13. d4": "I think to avoid what happens next, white has to sack the queen. The idea behind this move is alright, to bring out the bishop and try to castle the king away from queen, but it doesn't matter now. ",
        "13... f2+": "There is no good option from this situation. ",
        "14. Kd2 f1=Q+": "The king has to retreat forward, meaning the white will lose his queen and face against black's two queens. Obviously the game was more or less over by this point. The only way out for white was guard the knight with pawn d4, or defend the g2 pawn from the queen, which I suspect was the only move that could have forestalled with outcome. \n\nIf I were to draw a moral from this story, it would be how a minor deviation in a well used opening can transform a game and make something normally predictable into quite a puzzle for your opponent. Granted, this probably does not work with players above 1800 but at my level it's surprisingly successful. \n\nLastly, I'd like to thank white for a good game. \n\n"
    },
    "url": "https://gameknot.com/annotation.pl/abusing-the-4-knights?gm=34404",
    "gameName": "Abusing the 4 Knights",
    "players": "Anon.  vs. big_red (1500)",
    "opening": "Four knights (C46), Italian variation"
}