{
    "moves": {
        "1. e4 c5 2. Nf3 Nc6 3. d4 cxd4 4. Nxd4 g6": "This move commits black to the Accelerated Dragon",
        "5. Be3 Bg7 6. Nc3 Nf6 7. f3": "This move indicates that white wants to play something akin to the Yugoslav Attack a very danegrous line.",
        "7... O-O 8. Qd2": "Black has saved a move by not playing d6.  So he can react in the center now.",
        "8... d5 9. exd5 Nxd5 10. Nxd5 Qxd5 11. Nxc6 Qxc6": "Black now has the only center pawn and a threat on b2. ",
        "12. O-O-O": "White is still pursuing the Yugoslav attack but the center is open and black can rake the queenside.",
        "12... Be6 13. Kb1": "White protects the pawn and gets the king out of the shadow of black queen.",
        "13... Rac8": "Fixing the white queen to guarding the pawn on c2 and starting to build an attack.",
        "14. Bd3": "Finishing his development and protecting c2.",
        "14... Rfd8": "Pinning the bishop and countering white's control of the d-file",
        "15. Bh6": "The bishop on g7 is dangerous so white wants to trade it and weaken black's king.  White may still be thinking about prying open the h-file too.  But this allows black to pull the queen to a square that limits its ability to defend the king.",
        "15... Bxh6 16. Qxh6 Rxd3": "The exchange sacrifice starts a strong attack.  17. Rxd3 allows 17. ... Qxc2 ch followed by Qxd3 so ...",
        "17. cxd3 Qc2+ 18. Ka1 Qa4": "The threat is mate on a2! If white plays 19. a3 then black responds 19. ..., Qb3 and mate is next move on a2.  So white's only move is ",
        "19. b3 Bxb3": "The threat on a2 is back on and the a pawn is pinned.  The rook on d1 is also threatened so the natural move is Rd2.  However giving the exchange back with Qd2 could be better although after 20 Qd2, Bxd1 21. Qxd1 ( On 21 Rxd1 the reply 21. ..., Rc2 threating mate and the queen is the finish. )21. ..., Qxd1 22. Rxd1, Rc2 should be a won endgame.",
        "20. Rd2 Qd4+ 21. Kb1 Ba4 22. Re1": "Black could play 22. ..., Qb4ch here followed by 22. Ka1, Qc3ch 23. Kb1, Bc2ch 24. Kc1 Qa1 mate.  This works because black cannot interpose the rook from d2 without losing the rook on e1.  But black was too fixated on getting the bishop to c2 and and so played",
        "22... Qc3 23. Qf4": "There was no way to prevent Bc2ch followed by mate as black owns the c-file.",
        "23... Bc2+": "And white resigns. 24. Rxc2 does not help since 24. .., Qxc2ch 25. Ka1, Qc3ch 26. Kb1, Qxe1ch leaves black a rook ahead.  I hope you liked the game please rate and comment.\n"
    },
    "url": "https://gameknot.com/annotation.pl/accelerated-dragon?gm=66868",
    "gameName": "Accelerated Dragon",
    "players": "Bert17 (1987) vs. jmd1952 ",
    "opening": "Sicilian (B34), accelerated fianchetto, exchange variation"
}