{
    "moves": {
        "1. e4 c5 2. Nf3 d6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 a6": "Hasta aquí todo lo habitual de una siciliana - Najdorf variante escogida por casi todo el mundo y a la espera de la sexta jugada blanca donde tiene multitud de opciones para jugar.",
        "6. Be2": "JR escoge Be2 por primera vez en nuestros enfrentamientos. Supongo que quiere cambiar Bg5¡ porque no le había dado buenos resultados contra mi.",
        "6... e5": "Después de para mi la novedosa Be2 (novedosa en el sentido de poco utilizada por JR) podía optar por e6 ó e5. Aprovechando algunos estudios de partidas de Remco (Nestorix) me decido por e5. Pienso que el centro queda bastante más bloqueado y no tengo que olvidar que juego con negras y ante un buen estratega",
        "7. Nb3 Be6 8. O-O Be7 9. f4 Qc7 10. a4 Nbd7 11. Kh1": "José Ramón disfruta de cada partida independientemente de donde esté enmarcada. Mirando la clasificación del ACPRO'S MINIT, JR tiene (tenía) posibilidades de ganar el torneo, sobre todo observando su magnifica partida en curso con Nestorix y en base a ello pensaba que arriesgaría para ganar pero no....... Simplemente disfruta con su idea y el torneo le importa un ...... Digo todo esto por que jugando con blancas está muy conservador porque esperaba Be3",
        "11... O-O 12. Be3": "Ahora?????.  Porque no f5¡ o incluso g4¡ No es batalla lo que vamos a tener.",
        "12... Rac8": "Ahora las críticas se deben volver contra mi..... Soy un 'cagueta' contra las sicilianas. No es mi medio, no estoy comodo, no domino su estructura y desemboco habitualmente en finales perdedores. Los que leais esto entendereis porque no me atreví a 12.- Bc4, b6 o incluso exf4. ",
        "13. a5 exf4": "Me decido por esta, ignorando Bc4 de nuevo porque la posición que tomara la torre blanca de la columna f, me parece poco natural e incomoda.",
        "14. Rxf4 Rfe8 15. Nd4 Ne5 16. Nf5 Bxf5": "Hasta aquí mi amigo y yo no hemos aportado nada, salvo quizá nuestros miedos.... Todo esto se ha jugado. Ahora debo ser fiel a la idea de mi jugada 13. Si la Torre no parece comoda en f4 tampoco debe estar mejor en f5.",
        "17. Rxf5 Qc6 18. Bd3 g6": "Prepara d5, libera el centro, incomoda a la Torre y deja espacio para el alfil que algún dia llegara a f6-g7.",
        "19. Rf4 d5 20. Bd4 Qd6 21. Be2": "Jr es bueno.... y si me deja Nd3 a huevo para perder calidad su razón tendrá...... supongo que el calculó lo siguiente --> Qxd3¡¡ Qxf4 --- e5 Ng4 ---- Bxg4 Qxg4 Nxd5¡¡ Qf5..... y la calidad está compensada por ataque y el centro negro está hecho añicos. Quizá podría haberlo jugado por probar, pero insisto que la siciliana no es mi mejor performance.\r\n\r\n \r\n",
        "21... Ned7 22. Qf1 Nxe4 23. Nxe4 dxe4 24. Rxe4": "Aquí debe venir el grueso del comentario. La partida parece tablas ya que se prepara una masacre como la que expongo a continuación... o quizás las blancas tenían posibilidades?"
    },
    "url": "https://gameknot.com/annotation.pl/acpros-mini-tournament?gm=99",
    "gameName": "acpro's mini-tournament",
    "players": "zoltantor (2250) vs. carlosmart (2273)",
    "opening": "Sicilian (B92), Najdorf, Opovcensky variation"
}