{
    "moves": {
        "1. c4": "Hi all! This game is all about activity, aggression, and timing--specifically, how they relate and the differences between them. Broadly: activity is the main goal of chess at all times: more activity virtually always improves your position. Activity and Aggression sometimes look and feel similar, but they are not the same thing. Activity is simply the ability to move to and control many squares. Aggression is a more violent concept--playing aggressively means making serious, concrete threats. Activity almost always leads to aggression, and occasionally aggression can be converted into beneficial activity.",
        "1... e6": "Timing comes into play in recognizing when this latter case (aggression --> activity) is possible, and when it is not. When it is, the opportunity for tactics arises. When it is not, there exists the possibility for unsound aggression--aggression that does not, in fact, increase our activity or overall winning chances. Generally speaking, the more active our pieces, the more chances we have to play aggressively. In this way, activity builds on itself to beget more activity.",
        "2. e4": "?! More common are 2.d4 or 2.Nf3. In the text, White decides to avoid the QGD-like lines and instead aim for total control of d5.",
        "2... d6": "Since ...d5 won't be possible (or at least the line is unclear after 2...d5 3.cxd5 exd5 4.exd5 Qxd5 5.Nc3), this is Black's best place for the d-pawn at the moment, where it can support ...c7-c5.",
        "3. d4": "Already, with no pieces developed on either side, White has a significant spatial advantage.",
        "3... Ne7": "I don't like this move. The Knight belongs on f6; Black should simply put it there. The text is needlessly timid.",
        "4. Nc3 Nd7": "And again. Black is perhaps preparing to play ...c5, but his Bishop belongs on d7, not his Knight. Now Black requires at least two moves to develop another piece.",
        "5. Nf3 h6": "This does nothing to contribute to the opening goals of developing pieces, controlling the center, and safeguarding the King. White was not threatening Bg5, so why defend against it? Black's consistently passive play is not doing him any favors.",
        "6. Be3 g6 7. Qd2 Bg7": "Though no captures or serious errors have been made, the computer puts White ahead by a full pawn, and I agree. White's pieces are developed to natural squares and have plenty of potential, whereas Black's only decent piece is his Bishop. Black cannot even castle because of the weak h6 pawn.",
        "8. Be2 a6 9. b4": "Since Black still can't get his King out of the center because of the weak h-pawn, White happily gobbles up some more available space and prevents ...c5, since his pieces are almost all developed to active squares and Black has no obvious response to a large-scale center/queenside expansion.",
        "9... b6": "Black hasn't moved anything past his third rank yet, and has pushed six pawns in nine moves! The specific goals of the opening are easy to identify and generalize: do that which grants you the most activity for your forces. Black is not playing to maximize activity, so his position has already become cramped.",
        "10. O-O Bb7 11. Rab1 e5": "Black certainly needs a break, but this is inaccurate, giving White the opportunity to lock out both Black Bishops with 12.d5! or simply blast apart the center with 12.dxe5. Better was 11...c5. Already it's clear how White's advantage in space and energy badly restrict the Black options.",
        "12. c5": "!? Interesting thought, rather than close Black out of the center White chooses to preserve the tension and prevent Black from playing the freeing ...c5.",
        "12... b5": "12...Nc6 was better. The text just gives White an excuse to play a move he wanted to play anyway. Note that White spent the opening maximizing piece energy, whereas Black did not--as a direct consequence, White's natural moves now feel aggressive, whereas Black's positioning gives him very little opportunity for counterplay.",
        "13. a4": "! White sacrifices a pawn to open lines and begin his attack in earnest. This move is not even hard to find: White seeks to push the queenside and increase his pieces' activity; this move half-opens a queenside file and energizes White's LSB, his least active piece.",
        "13... bxa4 14. d5": "! Of course not 14.Nxa4?! Bxe4, freeing Black's game. The passed pawn on a4 is no threat whatsoever, so White is free to ignore it and instead grab more space for his well-placed Bishops. White simply finds the best moves to increase his piece activity, and the attack flows naturally from it.",
        "14... f5": "? Black, with passive pieces and a very cramped game, tries a break, but his timing is all wrong. This is not a case where aggression can produce activity--by opening the center, he's simply exposing his King to the elements. More to the point, White was threatening 15.c6! winning a piece (and yet more queenside space!) and this does not stop it. Black would have been much better off playing 14...Nf6, threatening 15...Nxe4! 16.Nxe4 Nxd5, with three pawns for the piece and a far more comfortable position. It's worth noting that fourteen moves into the game, Black has made ten moves with pawns and only four with pieces! It's no wonder he is behind in activity.",
        "15. c6 Nxc6 16. dxc6 Bxc6 17. exf5": "Black has opened the center, but he has nothing to show for it! His Bishop now has a slightly better game, but his King is dangerously centralized (and h6 is still hanging if he castles!) and the White pieces are vastly better-placed, sitting on the spots they were first developed to.",
        "17... g5": "? 17...gxf5 was a much better bet. Black should fortify his center pawn majority and energize his forces, not push pawns willy-nilly and hand a dangerous passer to White.",
        "18. Nd5": "?! Probably inaccurate, but certainly not terrible. White thinks to slide his Rf1-c1 and increase the queenside pressure with major pieces on three half-open files, while making kingside threats to occupy Black's forces. Possibly 18.Qa2 would have been a simpler, cleaner play here, winning the a4 pawn.",
        "18... Bxd5": "18...Nf6 would have been stronger; the text trades off Black's only good piece and lifts the WQ to a devastatingly powerful outpost on d5.",
        "19. Qxd5 Nf6 20. Qc6+": "The correct move, winning a pawn after 20...Nd7 21.Qxa4 and putting tremendous pressure on a6. Black has only made one real mistake, but White has already won. Note how aggressive White's play *looks*, even though truly he is just making calm, precise moves with the goal of continuing to maximize his activity and compound his advantages.",
        "20... Ke7": "? It often feels embarrassing somehow to move a piece back to the space it just came from, but here 20...Nd7 was really the only good move. This is Black's first really terrible single mistake of the game, but now White has a tactic to win another pawn and break open the BK's last lines of defense, and Black could resign right here.",
        "21. Nxe5": "! White's first and only tactical shot of the game. Black cannot retake because of 21...dxe5?? 22.Qe6+ Kf8 23.Bc5+ and White will win the Queen and the game soon after.",
        "21... Re8": "I think 21...Qc8 was better, freeing d8 for the King to retreat and looking for a chance to eliminate the thorny White pawn at f5. Black obviously wants to slip his King to f8 and back into the corner behind his Rook, but there's no reason that White should need to allow that.",
        "22. Bc4": "Good moves continue to flow naturally from the position combined with White's goals. This Bishop was one of White's least active pieces, and he wants to prevent the BK from escaping the center. Now the Bishop is hugely active and White is suddenly threatening mate with 23.Ng6 (of course 22...dxe5?? is still not an option).",
        "22... Nd7": "?? This is only Black's second really serious mistake, but it is sufficient. He needed ...Qc8 to vacate d8 for his King. Now White has a couple of choices on how to proceed--but it's over either way. There are at least two choices for White's 23rd move; both lead to mate in five. Try to find them before continuing on.",
        "23. Qd5": "Also possible was the somewhat flashier 23.f6+! Kxf6 24.Qf3+ Kxe5 25.Bd4+ Kxd4 26.Qd5+ Kc3 27.Rfc1#, which I had looked at, but didn't see the full combination. This move was easier to find.",
        "23... Nxe5 24. Qe6+ Kf8 25. Qg8+ Ke7 26. Qxg7+ Nf7 27. Qxf7#": "I hope you find this game instructive. White never had to take risks or rely on tricks; he simply overwhelmed his opponent with consistently more-active forces, and the correct moves followed naturally. Thanks very much to rcachero for the game! Comments and ratings are appreciated; thanks for reading!"
    },
    "url": "https://gameknot.com/annotation.pl/activity-vs-aggression?gm=46083",
    "gameName": "Activity vs. Aggression",
    "players": "bwaa (1768) vs. rcachero (1634)",
    "opening": "English opening (A13)"
}