{
    "moves": {
        "1. e4 c5 2. Nf3 Nc6 3. d4": "A lot of Grandmasters are starting to avoid the Sveshnikov early on, namely on move 3. They either play the Rossolimo, 3. Bb5, or try to force Black to chose another defense with 3. Nc3.",
        "3... cxd4 4. Nxd4 Nf6 5. Nc3 e5": "It wasn't until recent times that this opening proved its worth, previously very few people would have considered weakening d5 so early on and still expect a good game.",
        "6. Ndb5": "6. Nf5 is the only other retreat worth considering, after anything else Black is already better.",
        "6... d6 7. Bg5 a6 8. Na3 b5 9. Nd5": "Slightly more popular is 9. Bxf6, but that allows more thematic plans to be adopted by Black. This is more positional and tries to conquer d5 without giving Black play on the g-file or the possibility to strike in the center with an extra f-pawn.",
        "9... Be7 10. Bxf6 Bxf6 11. c3 Ne7": "I don't like the mainline which goes like 11...0-0 12. Nc2 Bg5 13. a4 bxa4 14. Rxa4 a5 and here White has the very good move 15. Bb5, which asks Black a direct question of what to do with the Knight. A possible line goes like this 15...Ne7 16. Ncb4 Be6 17. Nxe7+ Qxe7 18. Bc6 Rac8 19. Rxa5 and although Black has some compensation for the pawn, it's not a position I'm anxious to play as Black. As White, on the other hand...",
        "12. Nxf6+": "This isn't forced, White could take the Knight instead or play Nc2 but Black has a comfortable game in each case. With this exchange, White is hoping to prove that the pawns and weak and that there aren't enough pieces left on the board for Black to generate initiative with.",
        "12... gxf6 13. Nc2": "White's problem Knight in this line and the reason why many lines are so good for Black.",
        "13... Bb7": "A direct attack on e4 and the best place to put the Bishop in this particular variation.",
        "14. a4": "Trading the central pawn for Black's b-pawn and right to castle. The main lines goes like this 14. Bd3 d5 (Black's dream move) 15. exd5 Qxd5 16. Ne3 Qe6 17. Qh5 0-0-0 with a very imbalanced position and good prospects to play for a win for both sides.",
        "14... Bxe4 15. axb5 axb5 16. Bxb5+ Kf8": "White doesn't have time to blunt the Bishop on e4 with f3, since he loses a piece after Rxa1. Castling in this position looks like a sign of madness so what else can White do to protect g2? Other than the move White played, 17. Rxa8 looks sensible. The downside is that Black wins the g-pawn by force, but that shouldn't be such a scary prospect. After 17...Qxa8 18. Ne3 Bxg2 19. Rg1 Bc6 20. Bxc6 Qxc6, White has the nice move 21. Qb3 and Black's extra pawn is a technicality.",
        "17. Ne3": "The Knight finally makes it to e3 after a long journey. Now that White has stabilized the position he's threatening to take on a8 and then do something about my overzealous Be4.",
        "17... Rxa1": "So I take the proactive step and misplace White's Queen first.",
        "18. Qxa1 Rg8": "Black's uncastled position looks much more solid that White's if he had castled now. The Bb5 isn't doing much in covering squares, so I think it's pretty sure to say that White's idea of exchanging a central pawn for a wing one wasn't very inspired. These points are proven in this line: 19. 0-0? Nf5! 20. g3 ( 20. Qa4 is the alternative, sacrificing the exchange, while 20. Nxf5 is mate in 5 for Black, 20...Rxg2+ 21. Kh1 Rxf2+ 22. Kg1 Rg2+ 23. Kh1 Rg8+ 24. Rf3 Bxf3#) Nxe3 21. fxe3 Qb6 with a nasty double attack.",
        "19. Bf1": "A sad  necessity. 19. f3 again isn't possible because of Qb6 and 19. Rg1 is just as miserable.",
        "19... d5": "It's time to strike in the center. Not only am I creating a passed pawn and getting rid of a weakness, d4 is also a genuine threat.",
        "20. Qa7": "White prevents 20...Qb6 but allows d4 instead. A tough choice to make but maybe Qb6 wasn't as powerful as the pawn advance.",
        "20... d4": "Winning the g-pawn.",
        "21. cxd4 exd4 22. Nc4 Bxg2 23. Bxg2 Rxg2": "The position has simplified and reevaluation is in order. Black is a pawn up, but it's a doubled one so that's irrelevant. The Black Rook is more active than its counterpart, also the Black King is a little safer than White's. I also have a passed central pawn which is only 3 squares away from queening. Black is threatening to centralize the Queen with Qd5 so White has to act against it.",
        "24. Nd6": "The Knight is tabu because of Qa8+ but a trap does not a good move make. White is also threatening Qxd4 but Black has a strong reply that takes care of everything.",
        "24... Rg5": "White is in real trouble now. The Rook will be very active on the 5th rank and if Black has time to venture the Knight into the attack, White's King will be in a world of pain.",
        "25. Qxd4": "It's very hard to suggest anything, since at best White loses only his Knight. After 25. f4 Ra5 26. Qxd4 Rd5, the Nd6 is lost.",
        "25... Re5+": "A nifty zwischenzug that will make sure White won't perform a surprise castle. Note that the Nd6 is pinned after the Queen took on d4.",
        "26. Kf1 Qa8": "Going for a full Rook instead of the measly Knight.",
        "27. Ne4": "A desperado move, hoping that Black will exchange Queens and White might hold on for twenty moves or so in a lost ending.",
        "27... Rxe4": "The ladies must stay on the dancing floor.",
        "28. Qd1 Nf5": "Neglected from move 11, the Knight is eager for some action.",
        "29. Rg1 Rd4 30. Qe2 Qd5": "Sweet centralization. In passing I should mention that the threat is Rd1+. White is forced to give up a lot of material if he wants to stay alive a few more moves. My opponent had had enough and resigned."
    },
    "url": "https://gameknot.com/annotation.pl/activity-vs-structure?gm=26631",
    "gameName": "Activity vs structure",
    "players": "baldvin (1880) vs. nyctalop (1960)",
    "opening": "Sicilian (B33), Pelikan, Chelyabinsk variation"
}