{
    "moves": {
        "1. e4 c5 2. Nf3 Nc6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 e5 6. Ndb5 d6 7. Bg5 a6 8. Na3 b5 9. Bxf6 gxf6 10. Nd5 f5 11. Bd3 Be6 12. c3 Bg7 13. Nxb5 axb5 14. Bxb5 Bd7 15. exf5 Nb8": "'!?'\n",
        "16. a4": "'despues de darme cuenta que mi adversario quedo sorprendido por mi mov. 13.Nxb5, y dandome cuenta que por la informacion que tengo sobre la posicion despues de negras 15. ....,Nb8 la posicion esta muy comentada a nivel magistral; opto por esta continuacion de la cual apenas hay partidas en la base de datos, considerando que no solo para mi tiene que ser dificil, sino tambien para el adversario.Se puede decir que aqui empieza la partida....'\n",
        "16... O-O 17. O-O": "'creo que es la mejor opcion para las blancas en estos momentos.'\n",
        "17... Bxf5 18. Qf3 Be6 19. Nf6+": "'entrando en una linea de dos piezas menores por torre y dos peones, pero con la particularidad de que los peones del ala de Dama blancos, aun pueden ser peligrosos.'\n",
        "19... Bxf6 20. Qxa8 Qb6 21. Qf3": "'volviendo con la Dama al centro del juego, pues en a8 no hace ya nada. Amenazando el alfil de f6. con lo cual no se pierde un tiempo del todo, ya que la Dama blanca vuelve a ganar actividad.'\n",
        "21... Bg7 22. c4": "'controlando la importante casilla de d4 y preparado para continuar con el avance del peon de la columna de a.'\n",
        "22... Qc5 23. a5": "'continuando con el avance del peon a, unica posibilidad por el momento de mantener la iniciativa, teniendo las negras que controlar dicho avance, ya que empieza a ser peligroso el mismo.'\n",
        "23... Bxc4 24. Bxc4 Qxc4 25. Qa3": "insistiendo en jugar a3,\n",
        "25... Na6 26. Rfc1 Qe6 27. Rc6": "volviendo a controlar la casilla a6\n",
        "27... Nc5 28. Rd1 Qg4 29. Rcxd6 Ne6": "abandonando el bloqueo inicial de las negras en la casilla a6.\n",
        "30. h3 Qe2 31. a6": "con este avance las negras estan en dificultades para bloquear el peon pasado.\n",
        "31... Nd4 32. Qd3 Qxb2": "no habia nada mejor\n",
        "33. a7 Qb7": "intentando de nuevo controlar el peon pasado.\n",
        "34. Qa6 Qa8": "triste opcion, el cambio de damas favorece a las blancas, ya que el peon pasado hubiera costado material a las negras.\n",
        "35. Rb1 Ne2+": "nuevo intento de dejarse capturar el caballo a cambio del ya peligroso peon pasado. Opcion que rehuso\n",
        "36. Kh1 Nc3 37. Rb7": "!!primera torre en 7 fila!! ya solo falta la otra, ademas se neutraliza la actividad de la Dama negra.\n",
        "37... Ne4": "amenazando Cc5\n",
        "38. Rc6": "con la amenaza 39. Tb8, Txb8; 40.axb8, Dxb8; 41. Tc8+ ganando\n",
        "38... Nxf2+ 39. Kg1": "abandonan, despues de jugar las blancas Tcc7, seguido de Dc4 con las amenazas sobre la casilla f7 y Tb8+ ganando Dama hace que la desventaja de material sea decisiva.\n"
    },
    "url": "https://gameknot.com/annotation.pl/aeac-5-years-mezquita-iccf?gm=26126",
    "gameName": "AEAC 5 Years - Mezquita, ICCF",
    "players": "Moreno Carretero, Carlos (2427) vs. Runting, Tim E (2442)",
    "opening": "Sicilian (B33), Sveshnikov variation"
}