{
    "moves": {
        "1. e4": "This is a mini tournament game against a player about 200 pnts above myself,  Please feel free to make any constructive comments on improvements that could be made.  e4 , my most common opening.",
        "1... Nf6": "Alekhine's defence ",
        "2. e5": "I decide to push my pawn to attack his knight rather than defend the pawn.",
        "2... Nd5 3. d4": "d4, opening up my queens bishop and protecting the advanced pawn.",
        "3... e6": "I like this position, my e5 is already cramping the fox's style and I have a open game.",
        "4. c4": "normally I would go Nf3 here but I decided to keep that black horse on the run and try to get more control of the centre.",
        "4... Nb6 5. Nc3": "time to start giving my brave pawns some support.",
        "5... Bb4": "I thought the fox would reply with that move but it does leave g2 very weak. Both his kingside knight and bishop have abandoned there sides. I need to exploit this.",
        "6. Qg4": "So I decide to attack g7 knowing if he castle's then I can bring my bishop to h6.",
        "6... h6": "maybe Bf3 might have been better, I know its a backward'sstep in development but it protects the pawn.  Or g6 maybe.",
        "7. Qxg7": "Qxg7, 1 up.  ",
        "7... Rf8": "naturally protecting his rook.",
        "8. Bxh6": "Bxh6 threatening Qxf8#!",
        "8... Qe7": "Only one possible move for black to stop checkmate.",
        "9. Nf3": "I pondered for a while. I was 2 up and queen and bishop in a good place . I did contemplate exchanging queens here( 9.Qf6, Qxf6.10. exf6) He could of course wait until I exchanged and simply moved Rg8 so I decided against that.  I wanted more support out and my king tucked away too so I moved Nf3.",
        "9... Nc6": "Black starts to develop now there is a sort of impasse on the king side.",
        "10. Bd3": "It was still bugging me if I should move Qf6?  Instead decide on bringing my other bishop into play.",
        "10... d5": "I thought this was a good move. , attacking c4 but at the same time opening d7 for his knight to move into to protect his rook and cover f3.",
        "11. exd6 e.p.": "Was this a mistake?  That was a good pawn on e5.",
        "11... cxd6 12. O-O": "castling, freeing up my knight on c3. ",
        "12... Bxc3": "Black takes action now that the knight is not pinned.  He decides to exchange and in the process double my pawns up.",
        "13. bxc3 Nd7": "Black makes that protecting move. His King does look cramped.",
        "14. Bg5": " Bg5??  should I have gone d5? attacking his knight and pawn. Ready for one of my rooks to slide to e1 attacking his queen. ",
        "14... f6": "I have to exchange now. I did think of moving Bg3+",
        "15. Qxe7+ Kxe7": "The fox now has a good wall of pawns in front of his king, I'm still 2 up but i've lost alot of my advantage.",
        "16. Bh4 b6 17. Rfe1": "Here I was pinning 2 of his pawns, e6 and f6. Could I exploit this? ",
        "17... Bb7": "Black unites his rooks and brings his bishop on the long diagonal. Things are starting to look better for black.",
        "18. d5": "Or was Bf5 better?",
        "18... Nce5 19. Nxe5": "exchange",
        "19... Nxe5 20. Rad1": "I needed to bring my other rook into the game. To protect my bishop and pawn.",
        "20... Rac8 21. dxe6": "my worry here was that I was opening the h1-a8 line for his bishop and with the g and h file wide open the fox could mount  a serious attack. Still I decided to break into his wall of pawns. In the process if he went Kxe6 his knight would be pinned.",
        "21... Kxe6": "The fox makes that move. ",
        "22. f4": "So I attack his knight.",
        "22... Rfh8": "and he in  turn attacks my bishop.",
        "23. Bg3 Ba6 24. fxe5 fxe5": "Slowly but surely the kings defenses are vanishing.",
        "25. Re4": "c4 was in danger ! so I protected it with my rook. In preparation for doubling them on the e file.",
        "25... Rcg8": "Black swithes his play to the open files.",
        "26. a4": "I wanted to advance c4 to attack d6 to take e5 protection away but first I needed b6 out of the way .",
        "26... Bb7": "Black attacks my rook but also a worry to me was g2. Bishop and a potetial rook attack.  ",
        "27. Re2": "I had to withdraw and protect g2 at the same time. ",
        "27... Bc6": "Attacking my a pawn  and tring to create a passed pawn",
        "28. a5": "I continue with my plan.",
        "28... bxa5": "He now has a fox on the run but I can now look at his kings defenses.",
        "29. c5 Rxg3": "Black decides to take the presure off of e5 by sacrificing his rook . ",
        "30. hxg3": "However all my pawns are now doubled now and black has took the sting out of my attack. Still 5 up.",
        "30... d5 31. Rde1": "doubled my rooks at last",
        "31... e4": "pawn storm. ",
        "32. Bb1 Ke5": "Black gets ever closer",
        "33. Rf2": "I need to try to get around the back some how. I needed to be careful which rook I moved. Move Rf1 and his bishop was lurking ...Bb5 winning one of my rooks.",
        "33... a4": "There goes that fox. ",
        "34. g4": "Looking to check him on f5.",
        "34... Bd7": "Black defends f5 and attacks g4. By moving the bishop there though he does take a defender awy from d5.",
        "35. c4": "So I decide against advancing g4 and opt for c4 instead attacking d5. I know I will be a pawn down in the exchange but I want that king out from behind those pesky pawns.",
        "35... Bxg4 36. cxd5 Kxd5 37. Bxe4+": "Black king is now in the open. My dilema here was do I take e4 with my rook or bishop, I went with the latter. A wrong choice I feel now. 37. Rxe4 would have been better attacking both a4 and g4. ",
        "37... Kxc5": "He was 3 pawns to 2 up in that exchange. It should have been better for me.",
        "38. Rb1": "still 4 up. So not too bad.  I did not want that fox been aided by his king so blocked that route off.",
        "38... a3": "The fox still runs. ",
        "39. Ra2": "That fox is now keeping busy 2 rooks. Not good for me.",
        "39... Re8": "Black makes his move while my rooks are stuck.",
        "40. Rxa3": "A risk.  I would not have done this if I was not 4 up but my thoughts were, better having 2 mobile rooks and no foxes to worry about in exchange for my bishop. Was this a right play?",
        "40... Rxe4 41. Rxa7": "My advantage is dwindling a little. ",
        "41... Kc6 42. Rg7": "Im thinking long and hard if I should exchange my rook for his bishop. Maybe not a good exchange.",
        "42... Kc5 43. Rc1+ Kd6 44. Rg6+ Kd5 45. Ra1 Ke5 46. Rf1": "Stopping blacks king or bishop attacking my rook and keeping his king away from mine.",
        "46... Kd4 47. Rgf6": "Uniting my rooks.",
        "47... Ke5 48. g3": "Gives my king some breathing space.",
        "48... Bh3 49. Rf1f2 Re1+": "now i'm under attack.",
        "50. Kh2": "My only move. An exchange would have meant a draw.",
        "50... Be6": "Black retreats.",
        "51. Rf6f8": "My idea here is to try and pin his bishop with Re8.",
        "51... Ra1 52. Re8 Ra6": "Blacksaw the attack. I was planning Re2 next and he would have lost his bishop but now he has it protected.",
        "53. g4": "So I decide to advance my pawn knowing that my Rook on the f file stops the king attacking it.",
        "53... Kd6 54. g5": "I have to move the pawn as he has unpinned his bishop.",
        "54... Kd7 55. Ref8": "I reunite my rooks. Boy this is tough and taking some time to work out.  Cat and mouse at the moment.",
        "55... Ra4": "Black now attacks my pawn",
        "56. Rf8f4": "I block the potential black rook move of Rg4 or Rh4+ and offer my rook up for exchange.  ",
        "56... Ra3": "Of course black does not want the exchange and trys another way through threatening Rh3+",
        "57. Rf2f3": "I block that.",
        "57... Ra2+ 58. Kg3 Ra1 59. Rf3f1": "Blocking the attack again.",
        "59... Ra3+": "Now I need to be careful!!!  Kh4 would result in disaster!  Kh4?? Rh3#!  My own pawn blocking the kings escape.",
        "60. Kh2 Ra2+ 61. Rf1f2": "and the blocking continues.",
        "61... Ra3 62. g6": "I decide to advance my pawn ahead of blocking again.",
        "62... Rh3+ 63. Kg2 Rh6 64. Rf4f6": "protecting the pawn ",
        "64... Bd5+ 65. Kg3": "again moving King to g1 would have resulted in a lost game. ",
        "65... Rh1": "Black looks to put his rook on g1 attacking King and pawn.",
        "66. Rf6f7+": "I thought about this one for a while. I may loose a rook but I would queen my pawn if he took it.  Plus If he did not go for it I would have my rook on the 7th rank.",
        "66... Ke8": "I thought this was a poor move .  His king is now trapped on the back rank.",
        "67. Rh7": "If he exchanges , I Queen.  I spot a checkmate at last. Moving my f Rook to  to b2.  Will the fox see it.",
        "67... Rg1+": "No.",
        "68. Kh4": "I moved in here  rather than to the middle of the board to stop being chased about.",
        "68... Rxg6": "The pawn falls but...",
        "69. Rb2": "The end is nigh. ",
        "69... Bg8": "Maybe R d6 would have prolonged it.",
        "70. Rb8#": "The end at last.  I nearly blew it a couple of times. Up to date my biggest scalp. A very nice game to play."
    },
    "url": "https://gameknot.com/annotation.pl/against-a-crafty-fox?gm=22947",
    "gameName": "Against a crafty fox",
    "players": "wanred (1523) vs. craftyfox (1704)",
    "opening": "Alekhine's defence (B03)"
}