{
    "moves": {
        "1. e4 c5 2. Nf3 d6 3. d4": "Hoy en día esto no se ve tan a menudo, ya que muchos jugadores prefieren optar por variantes más secundarias evitando toda la teoría (que día a día cambia)\nAlternative variation: 3. Bb5+ [Se está jugando mucho en la élite]\n",
        "3... cxd4 4. Nxd4 Nf6 5. Nc3 g6": "La variante del Dragón, que muchos evitan porque el blanco tiene una gran variedad de sistemas peligrosos, en los que directamente se va a por el rey sin importar el material que se entregue. Incluso he llegado a escuchar que está refutado, no obstante lo recomiendo para todos aquellos jugadores que busquen posiciones agudas y que quieran buscar la victoria con negras\n",
        "6. Be3 Bg7 7. f3 O-O 8. Qd2 Nc6 9. Bc4": "Alternative variation: 9. O-O-O [Es la otra línea importante en la posición, pero se suele simplificar mucho el juego] d5 10. exd5 Nxd5 11. Nxc6 bxc6 12. Bd4 [Y aquí existen varias alternativas para negras ] (12. Nxd5 [Esta captura, no entraña demasiado peligro para negras. Hay que recordar siempre, que muchas veces, cuando existen enroques opuestos, prima abrir líneas o ganar tiempos en el ataque, que el material] cxd5 13. Qxd5 Qc7 14. Qc5 [Es la principal, el blanco quiere cambiar damas ya que tiene material de más y su rey está más expuesto] (14. Qxa8 Bf5 15. Qxf8+ Kxf8 $13 [En la teoría se considera esto, juego complicado, pero diría que es más cómodo de jugar con negras]) 14... Qb7 15. Qa3 Bf5 $36 [El desarrollo y la iniciativa compensa de forma clara el peón entregado]) 12... Bxd4 (12... Nxc3 13. Qxc3 Bh6+ 14. Be3 Bxe3+ 15. Qxe3 Qb6 16. Qxe7 Be6 $44 [Nuevamente el peón es compensado por la iniciativa de las negras]) (12... e5 [Es una variante muy arriesgada, en la que normalmente el negro acaba entregando la calidad] 13. Bc5 Be6 $5 [La entrega es muy interesante, por ello la jugada más utilizada aquí es Ne4, sin aceptar el reto]) 13. Qxd4 Qb6 [Con juego equilibrado]\n",
        "9... Bd7 10. O-O-O Rc8 11. Bb3": "Profiláxis necesaria\nAlternative variation: 11. h4 [Sería un serio error] Nxd4 12. Qxd4 Ng4 $1 13. Qd2 Nxe3 14. Qxe3 Rxc4 $19\n",
        "11... Ne5 12. h4": "Esta posición es la más teórica del ataque Yugoslavo (9.Bc4), históricamente se han intentado varias jugadas, la principal es 12...h5 actualmente, y la más fuerte, pero esto se descubrió con el tiempo\n",
        "12... Nc4": "En la actualidad, esta jugada se considera dudosa, aunque parezca muy natural. La cosa está en que el caballo no estaba siendo amenazado en \"e5\", por lo que ya de entrada, parece una pérdida de tiempo. Además la torre en \"c4\", puede ser objeto de amenaza en algunas variantes\nAlternative variation: 12... h5 [Es la principal, y el duelo teórico seguiría]\n",
        "13. Bxc4 Rxc4 14. h5 Nxh5 15. g4 Nf6 16. Bh6": "Por desgracia, no pude recordar la importancia de 16.Nde2, que se jugó en el candidatos del 74 entre Karpov y Korchnoi, una partida muy famosa en su época desde la que se consideró un error el sistema de las negras\nAlternative variation: 16. Nde2 Qa5 17. Bh6 Bxh6 18. Qxh6 Rfc8 19. Rd3 [Aquí está la clave, Karpov evita todo tipo de entregas en \"c3\", además la jugada 16.Nde2 ha servido precisamente para reforzar ese punto] R4c5 20. g5 Rxg5 21. Rd5 Rxd5 22. Nxd5 Re8 23. Nef4 Bc6 24. e5 Bxd5 25. exf6 exf6 26. Qxh7+ Kf8 27. Qh8+ [1-0 Karpov,A (2700)-Kortschnoj,V (2670)/Moscow 1974/Candidates]\n",
        "16... Nxe4": "Mi rival consumió bastante tiempo (para tratarse de una partida a 5 finish) para hacer este movimiento, es el mejor con diferencia y aquí empecé a ver las complicaciones que tenía mi posición\n",
        "17. Qe3 Rxc3": "Temático y fuerte\n",
        "18. bxc3 Nf6 19. Bxg7 Kxg7 20. Qh6+ Kh8": "No sé si por azar (ya que la partida era de ritmo muy rápido), o por cálculo, acierta en el momento clave ya que 20...Kg8 perdía\nAlternative variation: 20... Kg8 21. g5 Nh5 22. Rxh5 gxh5 23. Rh1 [Y ahora la torre no podrá ir a \"g7\", por ejemplo] Qc8 24. Rxh5 Bf5 25. Nxf5 Qxf5 26. g6 $1 Qxg6 27. Rg5 $18\n",
        "21. Ne2": "Me pareció importante llevar piezas al ataque mi caballo desde aquí por el momento defiende en \"c3\" y \"amenaza\" saltar a \"f4\" desde donde participará mejor en la ofensiva\n",
        "21... Rg8 22. Nf4 Rg7 23. g5 Nh5": "No es la más precisa\nAlternative variation: 23... Ne8 [ Hubiese sido mucho mejor, la posición es muy compleja, ya que el negro tiene dos peones por la calidad y una posición muy sólida. Sin embargo su torre está atada en \"g7\" para defender \"h7\"]\n",
        "24. Nxh5 gxh5 25. Rxh5 Qa5": "Es normal que en una rápida se opte por esto, ya que parece más activo (primar actividad antes que material como antes hemos dicho).\n",
        "26. Re1 Be6 27. Rxe6": "Es mejor ceder la calidad y crear otras debilidades, que intentar conservarla, ya que las negras en ningún caso estarían peor, y tendrían una iniciativa muy molesta\nAlternative variation: 27. Re3 Qa3+ [Buena jugada, primero llevamos al rey a una casilla más activa, y después capturamos en \"a2\"] 28. Kd2 Qxa2 $15 [Ganando un tercer peón, esto lo valoré en la partida, pero me veía muy mal]\n",
        "27... fxe6 28. Qxe6 Qxc3 29. g6": "En realidad, el último momento en el que había que acertar, las tablas se firmaron rápido\n",
        "29... Qa1+ 30. Kd2 Qd4+ 31. Ke2": "Alternative variation: [Pero no] 31. Kc1 Qg1+ 32. Kb2 Qxg6 $19\n",
        "31... Qc3 32. Qf5 Qc4+ 33. Kd2 Qd4+ 34. Ke2 Qc4+ 35. Kd2 Qd4+ 36. Ke2": "Empate justo, la lección más importante que se puede aprender de esta partida, es que en las posiciones de corte dinámico, normalmente hay que darle más importancia a la iniciativa que al material\n"
    },
    "url": "https://gameknot.com/annotation.pl/ahora-ajedrez-torneo-harb-n-bratto?gm=59177",
    "gameName": "Ahora Ajedrez, torneo Harbín, Bratto",
    "players": "Sos Andreu, Eric (2362) vs. Díaz Velandia, Jose Manuel (2315)",
    "opening": "Sicilian (B78), dragon, Yugoslav attack, 10.O-O-O"
}