{
    "moves": {
        "1. c4": "The game starts with c2-c4, the English opening, a threatening move to black.",
        "1... c6": "I countered this with the c7-c6 as if d2-d3 happened I could support d7-d5 keep my share of the centre.",
        "2. d4": "Unless black goes d7-d5 it is a sticky situation, as white has control of the centre.",
        "2... d5": "d4-d5",
        "3. c5 e6": "Reinforcing d5.",
        "4. Nc3": "Nc3.",
        "4... Nf6": "Starting to develop the board.",
        "5. Nf3": "Nf3.",
        "5... b5": "Starting to advance my pawns ",
        "6. a3": "a3.",
        "6... Be7": "Reinforcing f6.",
        "7. b4": "b4, blocking the pawn on b5 to advance and threaten knight.",
        "7... a5": "a5 challenging the pawn on a5.",
        "8. Bf4": "Bishop is brought out to attack the knight on b8 making my rook take in leaving the pawn on b5 open to attack.",
        "8... Ne4": "Knight is creating a threat, Nc3 can take it or move.  Then  d5-e4 would happen attacking the knight on f3 giving black an move to develop.",
        "9. Nxe4 dxe4": "The pawn takes e4 endangering the knight.",
        "10. Nd2": "The knight retreats, leaving a isolated pawn on e4.",
        "10... Qxd4": "Queen takes the free pawn. Securing the pawn on e4 therefore next move would be e4-e3 if bxb8 then rxb8, happened.",
        "11. Bxb8": "White trades bishop for knight.",
        "11... Rxb8": "a1-b1 leaving the pawn on c5 unprotected.",
        "12. bxa5 e3": "Pawn on e3 now poses threat to knight on d2.",
        "13. fxe3 Qxe3": "An exchange of pawns.",
        "14. Nf3": "Knight moved out opening up the queen on d1.",
        "14... Qc3+": "Checking the king hoping for a move to e2, so then bishop on e7 can take the pawn on c5.",
        "15. Kf2": "What I had hoped for! (forced move)",
        "15... Bxc5+ 16. Kg3": "The king is now out in the open with the bishop on c8 presenting a threat if pawn on e6 is advanced.",
        "16... Qe3": "Queen to e3 to attack the king for g2.",
        "17. Qd3": "A queen for queen trade is offered.",
        "17... Qf2+": "The offer is declined and I stuck with the original plan.",
        "18. Kh3": "The king is corned now.",
        "18... e5+": "e6 to e5 now put the king in check with the only reasonably possibility of the pawn on g4 advancing.",
        "19. g4 h5": "This is a key move in the game, as the pawn on h5 is now attacking the pawn on g4 with the bishop on c8 backing it up. Creating a forced checkmate unless white moves queen to f5.\n\n",
        "20. Qf5 Bxf5": "The queen is exchanged for a bishop and I plan the move up the pawns on f7 and g7 to continue the checkmate and the king is still unable to move anywhere.",
        "21. gxf5 f6": "Pawn to f6 to back up when I move the pawn to g5 because of the knight.",
        "22. Rc1": "Castle creating a false threat to my bishop but if white decides to take my bishop the queen will take it back but this allows the king to move itself out.",
        "22... g5 23. fxg6 e.p.": "An unexpected en passene.",
        "23... e4": "The pawn now endangers the knight on f3.",
        "24. Nh4 Qe3+": "Check! and the castle on c1 is lost.",
        "25. Kg2 Qxc1 26. Nf5": "Knight is moved to try and stop the advance of the pawn on h5.",
        "26... Qg5+": "Another fork move!",
        "27. Ng3": "White moves to block the check.",
        "27... h4": "Now whites knight is pinned. With the pawn on h4 attacking it as well but is unable to move.",
        "28. e3": "Pawn is moved up to stop the advance of e4.",
        "28... hxg3": "Knight down.",
        "29. hxg3": "The pawn is taken back now the rook is open to attack.",
        "29... Rxh1 30. Kxh1": "Rooks are traded. ",
        "30... Qxg6": "Pawn is taken to prevent it moving up and creating any further annoyances. ",
        "31. Kg2 Bxe3": "Another pawn down.",
        "32. Be2": "Bishop now guarding a few spaces.",
        "32... Kd7": "The rook now is open to go to h8 and advance up, white resigns here as it would be a eventual checkmate, this is probably one of my best played games in a while. Thanks!"
    },
    "url": "https://gameknot.com/annotation.pl/ahoymiharties-vs-harryn123?gm=31246",
    "gameName": "ahoymiharties vs. harryn123",
    "players": "ahoymiharties (1232) vs. harryn123 (1270)",
    "opening": "English (A11), Caro-Kann defensive system"
}