{
    "moves": {
        "1. g3 Nf6": "When in doubt -> 1...Nf6",
        "2. Bg2 e6": "I decided to play for the Nf6/e6/b6 structure which is, more or less, a generally reliable all-purpose formation. If 3. e4 then I figured I could reply with 3...d5 inviting a French structure with 4.e5 Nfd7 5.d4 c5 6.c3 Nc6 7.Nf3 Qb6 8.O-O Be7 or possibly 4.exd5 exd5 with a nicely active open position.",
        "3. a3": "The a3/h3 moves are often criticised as time wasting, but a3 here is actually a very decent move to prevent the common Bb4 pin to the knight.",
        "3... d5": "Grabbing my share of the center, blunting off his bishop, and allowing for the queenside fianchetto to oppose his king's bishop.",
        "4. d4 b6 5. Bg5": "These pins can be intimidating, but the bark is often worse than the bite - Nd2 and the pin is neutralised and the bishop ready to be kicked. Perhaps Bf4 was stronger to guard e5.",
        "5... Nbd7 6. Nf3 Bd6": "Bb4 was taken away, but d6 is a great square as well for the bishop - it, the two knights, and the pawns stake their claim on the center. It will combine nicely to aim at the kingside with the parallel Bb7.",
        "7. Nbd2 h6": "By kicking first, I reserve the right to chase the bishop and castle queenside. 8.Bh4 g5, 8.Bf4 Bxf4, 8.Be3 and the e-pawn is blocked.",
        "8. Bxf6 Nxf6 9. e3": "Likely a positonal mistake - White weakens the king's protection on the King's light squares. The e-pawn often hangs back with the kingside fianchetto",
        "9... O-O 10. Bf1": "Another mistake I believe - white wastes some time redeploying his bishop. True it was blunted, but 9.O-O Bb7 and playing Ne5 or trying to get a break with c4 would have been more favourable for white.",
        "10... Bb7 11. Bd3 c5": "Time to break with c5 and gain the c-file or possibly cramp with an advance to c4.",
        "12. b3 cxd4 13. exd4 Ne4": "A great outpost for the knight to pressure white (also eyeing the weak c3). If Bxe4 then dxe4 and then 15... e3 to juggle up the kingside.",
        "14. Nb1": "I believe white made the move to guard c3 from the knight.",
        "14... Rc8": "Grabbing the semi-open file to bear down on the weak c2/c3 squares.",
        "15. Nfd2": "A mistake - leaving the weak f2 square open!",
        "15... Qf6": "Threatening mate with Qxf7, and freeing my finachetto'd bishop in an exchange.",
        "16. Nxe4": "Bxe4 was stronger as the knight on d2 was guarding more critical squares.",
        "16... dxe4 17. Bc4 e3": "Threats now abound in the king's quadrant - exf2, Bxh1...",
        "18. O-O Bf4": "A trap is laid out - if 19.gxf4 Qg6+ 20.Qg4 Qxg4#, or if 19.fxe3 Bxe3+ 20.Rf2 Qxf2#",
        "19. c3 exf2+ 20. Kxf2 Bb8+ 21. Ke1 Qg5": "An active retreat by the Queen.",
        "22. Ra2 e5": "Blast open the center to line up the rooks on the exposed king.",
        "23. Be2": "Leaves the bishop vulnerable to being pinned by a rook.",
        "23... exd4 24. cxd4": "A blunder - Qxe4 was better",
        "24... Rc1": "And the queen is lost."
    },
    "url": "https://gameknot.com/annotation.pl/aim-for-the-weak-squares?gm=47263",
    "gameName": "Aim for the weak squares",
    "players": "N.N. (1418) vs. tisamon (1670)",
    "opening": "Benko's opening (A00)"
}