{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Bb5 d6": "This was a fairly typical Ruy Lopez, but black's move here is an inaccuracy, allowing d4! and white has a push.",
        "4. d4": "This is often what I will do, when I'm playing white. Not always, however; it's not the best way to maintain tension and create a complicated position wherein one can find beautiful continuations.",
        "4... exd4": "Castling here for white is now possible, but I prefer to create a long time problem for black.",
        "5. Nxd4 Bd7": "The best move. Ne7 here is rather passive.",
        "6. Nxc6 Bxc6": "bxc6 would have been better, gaining black a useful tempo.",
        "7. Bxc6+ bxc6": "And so I have created three pawn islands for black, while I have only two; in addition, he has doubled pawns. This is definitely advantage white. Now, it's a race to develop properly, and take advantage of that, which.... admittedly I fail to do! ;)",
        "8. O-O": "White's advantage according to Fritz is more than a pawn!",
        "8... Nf6 9. Kh1": "The pawn is immune in this position, due to the knight pin that would result. So I take the time to get my king off the black bishop's dark squares. So far, so good. An immediate Re1 might have been better here.",
        "9... Be7": "Preparing to castle, and threatening now white's e pawn for real.",
        "10. f3": "Better was a developing move, as noted in another annotated game by elyhim.",
        "10... O-O": "The game is mostly equal, but I like white better.",
        "11. Be3": "Fritz wanted me to move the knight to d2. I didn't like that idea here.",
        "11... c5": "This move caught me off guard, but in retrospect I should have realized black would immediately try to wrest the initiative from me, and put his odd pawns to work in order to remove their liability. In addition, it is restricting my white bishop; so a very useful move at this point.",
        "12. Nd2": "The previous black move also caused me to move my knight very passively. Had I put the knight on c3, I thought black would immediately force pawn trades in the middle, which I felt I was not ready for.",
        "12... c6": "Preparing d5, but it's not quite ready.",
        "13. Rb1": "Simply getting my rook off that dangerous diagonal, and protecting the b pawn. Very passive, and black takes advantage of this.",
        "13... d5": "Alas for black, he needed to prepare first to prevent white's reply...",
        "14. e5": "And now the position is getting a bit difficult for white, because if I am not careful, those pawns could roll a ways. I've let them start to dominate! Not good. But I'm not quite ready to maneuver to attack.",
        "14... d4": "This is a blunder, one I did not catch while we played. It gives white a piece for the pawn. But, I didn't see it, playing too quickly in this Blitz game, I retreated the Bishop.",
        "15. Bf2": "So by not seeing this properly, I've now made a blunder, throwing away all white advantage.",
        "15... Nd5": "That knight is very well placed for the time being.",
        "16. Nc4": "I respond with this move primarily to put a stop to further black pawn advances; however, black has made better progress than he should have and as a result has an advantage.",
        "16... Bg5": "Further controlling the dark squares, although Fritz likes ...Nb6 better and considers this an inaccuracy.",
        "17. g3": "So I open up my King trying for more counter play than simply trading pawns. Fritz dislikes this move, and in general I'd agree...",
        "17... Re8": "A lot of inaccuracies in this part of the game by us both! Nb6 or f6 were both better ways for black to have better activity.",
        "18. f4": "Fortunately for me, at this point in the game, the black king wants to keep that f7 pawn on f7; in order now to protect my king, I will need to control a lot of spaces which... will put me on the defensive a long while.",
        "18... Bh6": "I think this is a positional error, unless black makes a way to get his bishop back into the action. Fritz calls this move a blunder; and indeed, it traps the bishop unless the black king's protection is intentionally fragmented.",
        "19. Qf3": "It will be critical to control this diagonal for some time. Fritz agrees.",
        "19... f6": "To my surprise, black decides to open up his king in such a way that his defensive liability could become as bad as white's. I had no active plans yet to force that pawn to open up black's kingside, but my thought was along those lines, after consolidating and coordinating my pieces some, I was then going to find a plan to do that. I don't like this move by black.",
        "20. c3": "I decide to deal with all those center pawns while I can, as it makes sense to open the position more with a more vulnerable black king.",
        "20... dxc3 21. bxc3": "White still holds the advantage; the game no longer looks so bad for white.",
        "21... fxe5 22. Nxe5": "This moves my knight to a wonderful outpost; it also threatens both c file pawns, and prevents black moving c4 as a result for the moment. After some thought, black chose to give up whichever pawn I chose, hoping a small trick would work.",
        "22... Qf6": "He tries his trick, which of course is noticed. Rxe5 is threatened.",
        "23. Bxc5": "The best move.  Unwise of black to allow occupation of the d4 square.",
        "23... a5": "And this wastes time., but now it's black feeling that he needs a bit more space!",
        "24. Bd4": "I wish to both defend the pawn, and threaten indirectly the black queen, gaining a tempo. ...c5 fails to Nd7 of course.\n",
        "24... Qe6": "Well, now the game will get interesting soon. Things are in flux. I think a bit over my next few moves, using far more of my clock than my opponent.",
        "25. a4": "This was simply not to protect a2, but to put a stop to the a file pawn advancing further, I don't wish to play to stop a lone advancing pawn. Now, my a pawn is safe enough too, anyways. For a while.",
        "25... Qh3": "Right now, despite the loose white king, black is not coordinated well for a powerful stab at the white king; this is too unsupported. The black c pawn is hanging, were I to choose to grab it. Meanwhile, I maneuver to try to regain the initiative.",
        "26. Rf2": "Fritz says this is an inaccuracy, but I felt it was necessary at this point.",
        "26... Rad8": "I can only surmise my opponent here forgot about his hanging pawn. I haven't. I've just been too busy to grab it. Rac8, protecting that pawn would have been good.",
        "27. Rb7": "This move, for example, looked far more interesting to me than grabbing that pawn, even though Fritz would rather have me grab the pawn.",
        "27... Qf5": "Black feels the growing pressure on his king, and retreats his own queen, but unnecessarily still. Since I now have g2 to escape too, I now have a choice: grab the pawn now, or move Ne7, forcing an exchange with black's bishop. Yet, I cannot foresee in the game if this will be more fruitful than grabbing that pawn, so I... grab the pawn. OOoo brave soul that I am... errr umm... ...Fritz agrees! Sometimes a pawn grab is a good thing.",
        "28. Nxc6 Rdc8": "This is where the black rook should have initially moved to, preventing this pawn grab altogether. And of course the knight goes right back...",
        "29. Ne5": "I am feeling a lot better about things, despite allowing black some room. I believe I am controlling the center better than black despite appearances; black's pieces are not coordinated well, he is obstructed and his bishop has been out of the action for a while.",
        "29... Nc7": "Because I did get away with a couple of pawns... I now can hold a winning endgame advantage with care. Black decides to move the knight rather than protect it, since he wishes to rid me of my bishop, now is the time for him to try. Right here, according to Fritz, I am nearly 6 points up, although only two pawns up material-wise.",
        "30. Kg2": "Immediately I grab the g2 square, so I can get to h3 if necessary. Fritz liked g4, but I was not willing to chance further loosening of my king position.",
        "30... Ne6": "It's too bad black has not maneuvered to try to finish off my king. I continue preparing to assault the black king first.",
        "31. Rf7": "First, let's remove a defender. The next black move is forced, essentially.",
        "31... Qb1": "The only square. Defender removed. My thoughts were not on winning the queen, but on preparing an assault!",
        "32. Qh5": "I am nearly where I want to be, with good pressure on black's kingside. Better was g4 now that black is tied up quite a bit.",
        "32... Nxd4": "Black removes some of the pressure, but... it also removes an  important defender...",
        "33. cxd4 Qe4+": "Winning the pawn. Which I had already decided I would allow.",
        "34. Kh3": "I wasn't ready to trade queens yet.",
        "34... Qxd4 35. Rf3": "The power of the e5 knight for both threatening black and controlling important squares has been growing for some time. With black's bishop STILL doing nothing, black now is essentially playing a man down. Here in this position, black is really tied down to defending his king. White's advantage may not yet be enough to win without an oversight by black... and...",
        "35... Rc2": "...there it is. Rc2?? The winning white move here is easy to spot, for those of you lower rated, take a little time and try to spot it.",
        "36. Rxg7+": "Rxg7!+ and there is no escape.",
        "36... Bxg7": "Kxg7 would have drawn out the game a lot longer.",
        "37. Qxe8+ Bf8 38. Qf7+ Kh8 39. Qxf8#": "A nice mate. To his credit, he allowed the mate to occur rather than resign at the inevitable. Hope you enjoyed it! ;)"
    },
    "url": "https://gameknot.com/annotation.pl/alas-no-plan-for-the-piece-to-sacrifice?gm=52101",
    "gameName": "Alas no plan for the piece to sacrifice...",
    "players": "Pierre99 (1200) vs. Anonymous ",
    "opening": "Ruy Lopez (C62), old Steinitz defence, Nimzovich attack"
}