{
    "moves": {
        "1. d4 d5 2. c4 e5": "The Albin Counter-Gambit, which is not quite as risky as it looks, and well worth trying against an unwary opponent.",
        "3. dxe5": "Obviously White usually accepts the pawn; offers by Black are usually not to be sniffed at!",
        "3... d4": "The point of the gambit is to post a pawn on d4, which can be difficult to dislodge - the natural-looking 4.e3 leads to a tricky position with 4...Bb4 5.Bd2 dxe3 and if White accepts the Bishop 6.Bxb4 exf2+ 7.Ke2 fxg1(N)+ and White's in trouble. Named after World Champion Lasker it's known as Lasker's trap, and though I have had players fall for it in blitz it's not happened in a proper game. Yet...",
        "4. Nf3": "Sadly, it isn't going to happen this time either, as White sensibly attacks the pawn with his Knight, developing a piece into the bargain.",
        "4... Nc6": "Sensible too, to defend and develop.",
        "5. a3": "Guarding against that Bishop check on b4. My opponent knows what he's doing.\n",
        "5... Be6": "Blocking the rather loose extra White pawn from going any further, and threatening the c-pawn.",
        "6. b3": "I have no computer analysis, but I suspect this is wrong; White can now safely play 6.e3, protecting the c-pawn and after 6...dxe3 exchanging Queens. But I think my opponent, wary of the trap, becomes unnecessarily wary of advancing the e-pawn, perhaps to his cost?",
        "6... Nge7": "Getting ready to go to g3 to double the attack on the e-pawn; since I haven't had a swift victory I'm getting nervous and I want my pawn back!",
        "7. Bb2": "Naturally doubling the attack on my little outpost. ",
        "7... Qd7": "Suddenly I realise that I can't defend this pawn adequately, and prepare to castle Q-side, to make something of the soon-to-be-open file.",
        "8. Nbd2": "White lets me off the hook, presumably going here because c3 isn't available.",
        "8... O-O-O": "That pawn is defended again. But White has rather a lot of space!",
        "9. Rc1": "Understandably seizing a file that leads to my King.",
        "9... Ng6": "Now it's White who can't defend his extra pawn.",
        "10. g3": "Still wary of playing e3 - which here might tempt me to play 10...d3 - he decides to get his Bishop out the other way.",
        "10... Ngxe5": "Allowing me to win back my pawn. But that d-pawn still looks vulnerable.",
        "11. Bg2 Bc5": "I add to its defence as White prepares to castle.",
        "12. O-O": "I've got my pawn back  and developed my pieces but so far as I can see the game is pretty level.",
        "12... Bh3": "As ever with fianchettoed Bishops I try to get rid of them.",
        "13. Nxe5": "I thought the idea of this exchange was to preserve the Bishop, allowing it to escape along the long diagonal?",
        "13... Nxe5 14. Bxh3": "Instead, White gives it up.",
        "14... Qxh3": "Which is fine with me, since now I have his King boxed in.",
        "15. b4": "This allows the Queen to come to the Q-side in an attack, but my Bishop can only really go one way -",
        "15... Be7 16. Nf3": "Now he has renewed his threat on that d-pawn. I decide to allow him to take in in favour of an attack down the h-file...",
        "16... Nxf3+ 17. exf3": "I've opened a file for the Rook, but those doubled pawns may in the end have been the cause of his downfall...",
        "17... Rhe8": "Getting my Rook to the centre. I'm not to worried about losing the pawn, but maybe I should be?",
        "18. Re1 Rd6": "I can't defend the pawn with 18...Bf6 since after 19.Rxe8 another defender has gone.",
        "19. Bxd4 Rh6": "Instead I continue with my planned attack. It's all rather woolly in my head, though; after driving the KIng out I haven't a clear strategy.",
        "20. Be3": "Sensibly blocking the file the KIng will inevitably be driven to...",
        "20... Qxh2+ 21. Kf1 Qh3+ 22. Ke2": "In my dreams was 22.Kg1 Qh1# Now the King is out, but it's hardly in the open.",
        "22... Re6": "I have to get my pieces back into play, so start by pinning the Bishop, to what end I'm not sure at this point.",
        "23. Rc3": "I can't take it, so perhaps over-cautious. But my Queen is out of the game now, and I am wary of Rh1 at some point.",
        "23... Rd8": "I start all over again, claiming a file and attacking the Queen...",
        "24. Rd3 Rxd3": "I don't really want to exchange, but my opponent, from this point on, seems determined to take us into an endgame. Maybe he's read that I am no good at endgames?!",
        "25. Qxd3 Rd6 26. Qc3 Bf6": "All I can think of is to keep the initiative.",
        "27. Qb3 Qe6": "Now at least my Queen is back in the game.",
        "28. Rd1": "here we go again with exchange offers!",
        "28... Bd4": "My last hope of trying to attack, though obviously taking the Bishop will allow White to undouble his pawns, so what exactly my attacking chances are isn't clear!",
        "29. Rd3 Bf6": "Instead I concede and allow the endgame to come...",
        "30. Rxd6 Qxd6 31. c5 Qe6": "Perhaps going to e2 would have protected the pawn without allowing an exchange, but by now I am reconciled to it...",
        "32. Qxe6+ fxe6": "I do not know my endgames, but this looks disturbingly level to me. White has those clumsy doubled pawns, true, but I have an isolated pawn that won't get very far. My strategy is to get my King up the board, and aim at b3, so I can attack the pawn chain from the rear.",
        "33. Bc1": "White sees that this pawn may be the weak link and defends it. But his Bishop is now rather stuck there; he has to prevent Bb2 or Bc3; all his pawns are on dark squares and a long way away from the King; my Q-side pawns can still be defended.",
        "33... Kd7": "Even so, my King must surely head out into no-man's-land if I am to have a chance of winning?",
        "34. f4": "Over the next few moves, I think White goes astray, wasting moves on his K-side pawns, which aren't going to achieve much, while allowing my King to march up the board...",
        "34... Kc6 35. f3 Kb5 36. g4 Kc4": "Far too late White sees where I am heading.",
        "37. Kd2": "I think he needed to get his King over here sooner.",
        "37... Kb3": "Now there's not much he can do to avoid losing a pawn.",
        "38. Kd3 Bb2 39. Bxb2": "It might have been prudent to keep the Bishop on the board; he can't prevent my winning the a-pawn anyway.",
        "39... Kxb2 40. Kc4 Kxa3 41. b5": "It's 3-2 on this side of the board...",
        "41... g6": "I prepare an advance on the other side, that will surely give me a passed pawn there too?",
        "42. f5 exf5": "I don't have much choice. Now I looked at the various possibilites following 43.gxf5 gxf5; should I head off up the h-file or win one of the pawns on c5 and b5? Can the f-pawn get to the Queening square first? And so on.",
        "43. Kd4": "But White gifts me another pawn...",
        "43... fxg4 44. fxg4 h5 45. gxh5 gxh5 46. Ke5 Kb4": "Now I will have passed pawns on both wings, and my opponent resigned. But just how even was that endgame when it started?  I have seen no analysis..."
    },
    "url": "https://gameknot.com/annotation.pl/albin-counter-gambit?gm=63579",
    "gameName": "Albin Counter-Gambit",
    "players": "perfect_spy (1312) vs. jimspellman (1737)",
    "opening": "QGD (D08), Albin counter-gambit, Alapin variation"
}