{
    "moves": {
        "1. e4": "Mais uma vez, a variante \"malvada\" da Defesa dos Dois Cavalos",
        "1... e5 2. Nf3 Nc6 3. Bc4 Nf6 4. Ng5": "Defesa dos Dois Cavalos, de novo vamos para o clássico...",
        "4... d5 5. exd5 Na5 6. Bb5+ c6 7. dxc6 bxc6 8. Qf3": "De novo! Só que agora, com um adversário bem mais forte...",
        "8... cxb5 9. Qxa8 Nb7 10. d4": "Belo lance, que busca trazer as peças brancas o quanto antes para o jogo. As negras perdem um tempo retomando o peão...",
        "10... exd4 11. O-O Be7": "Evita o xeque de torre...",
        "12. a4": "Procura abrir a coluna da torre, o que é considerado a melhor saída para as peças brancas, as negras simplesmente ignoram este lance...",
        "12... O-O 13. axb5 Bc5": "Eis o porque, a Dama Branca continua no seu desterro...",
        "14. b4 Bb6 15. Qb8": "Parece que agora a Dama Branca vai escapar... mas...",
        "15... h6": "Ataca o cavalo...",
        "16. Nf3 Nd6": "Continua mantendo a Dama Branca presa!",
        "17. Na3 Qe7": "Agora a ameça é Kd7 ganhando a Dama!",
        "18. Bf4": "Ataca o cavalo em d6, tentando escapar...",
        "18... Nfe4": "Agora, a ameça é simplesmente Bb7...",
        "19. Nd2 Bb7": "A Dama Branca está perdida, de novo!",
        "20. Nxe4 Rxb8 21. Nxd6": "A vantagem material é mais ou menos equivalente, mas a posição de algumas peças brancas é bem mais agressiva, especialmente a dupla cavalo bispo...",
        "21... Bc7": "Evita um descoberto na torre...",
        "22. Nac4": "Ataca o peão em a7, ao mesmo tempo que defende o cavalo branco em d6, que não pode ser tomado...",
        "22... Ra8": "Por se tratar de um adversário muito mais forte, o empate é proposto pelas negras, que aproveitam o susto que as Brancas levaram para ganhar mais uma boa quantidade de pontos de rating! As brancas aceitam!"
    },
    "url": "https://gameknot.com/annotation.pl/albors-mini-tournament?gm=6103",
    "gameName": "albor's mini-tournament",
    "players": "oregonchessguy (1941) vs. pj0s3 (1678)",
    "opening": "two knights defence (C58), Blackburne variation"
}