{
    "moves": {
        "1. e4": "This game is a training match with one of my teammates in the Kingslayers.  We appreciate your contributions to this annotation so we can all learn together.",
        "1... Nf6": "Alekhine's defense.  Not a personal favorite (I really like Petrov), but very playable.  I like it when I get to practice in training games too.",
        "2. e5 Nd5 3. d4 d6 4. Nf3": "Although a common play is 4. c4 instead, I prefer to get my knight into the mix first, even though it prompts the inevitable Bg4 response from Black.",
        "4... Bg4 5. Be2": "We are all book play so far with no surprises on either side.",
        "5... Bxf3": "A surprise!  I was expecting Black to play e6 instead.  This move is a mistake for Black.  Although it is uncommon to see a mistake this early, it is worth exploring why.  The threat of violence is often more potent than the actual violence itself.",
        "6. Bxf3": "I have no other choice worth considering, but now Black is in a bit of a hole because his knight is being threatened and I essentially got a free strong position for my LSB.  Knights vs bishops is a debate that many have, but a long diagonal for a bishop is never a good thing to let your opponent have.",
        "6... dxe5": "An interesting choice.  I was expecting c6, which is a much stronger move.  c6 protects the knight and gives an egress for the queen to threaten Qa5+.  This move, while giving the appearance of being strong, actually exposes Black to some serious jeopardy early on.",
        "7. c4": "And here we are.  Notice that Black's rook is in danger and will almost certainly be traded for a bishop.  With proper play Black will only go down a pawn, but positionally, White is in great shape.",
        "7... Nf4": "Looking to cash in on Nxg2+ perhaps?  Black's knight's defense fe5 is tenuous.  I think Nb6 is a better play - stronger defense on the knight and allows capture of c4.",
        "8. Bxb7": "No other course worth discussing for White",
        "8... c6": "A blunder... better to play Nd7 by far.  Perhaps hoping to equalize with Nxg2+?",
        "9. Bxf4": "Removing the threat of the knight check and that rook isn't going anywhere...",
        "9... exf4 10. Bxa8 e6": "Hoping to salvage a castle and soldier on.  Although being down a rook sucks, everyone makes mistakes and you can still get back in a game.",
        "11. O-O Be7 12. Qa4": "Although White's development is not yet complete, with the king safely castled, it's time to get that bishop out of there and back into play.  This move seeks to create a path to extract the LSB.",
        "12... O-O 13. Bxc6 Nxc6": "When you are down points, it is better to trade pawns and not pieces.  Black would have been better served to let this one go and instead take the pawn trade with Qxd4.",
        "14. Qxc6 Qxd4 15. Nc3": "We end up in a similar spot, but instead Black has one less piece to work with, making Black's job easier.  White will now seek to get rid of the doubled f-pawn and hope to trade queens.",
        "15... f3": "Seems premature as e5 would have protected it allowing for some pawn march madness.",
        "16. Rad1": "tactical tempo gain.",
        "16... Qe5": "I was expecting the queen to protect the pawn instead... This move also potentially allows for a second tempo move later with Rf1e1 as a queen check.",
        "17. Qxf3 h5": "This move doesn't seem to accomplish much, it would have been better to push the f pawn or try to get the rook into the game.",
        "18. Rfe1 Qg5": "I thought Qc5 gave more options...",
        "19. Ne4": "Getting my pieces to work for me",
        "19... Qf5": "Qa5 would have been stronger, now Black is allowing a queen trade with little effort required for White.  Remember, when you are down points, trade pawns, not pieces, as you need them to have a chance to get back into the game.",
        "20. Qxf5 exf5 21. Nd6": "Offering a trade on knight for bishop or losing another pawn.",
        "21... Bxd6 22. Rxd6 Rb8": "A blunder that I missed taking full advantage of.  Although Black has very few options at this point, Rc8 would have been better.",
        "23. b3": "Better play is c5.  Two rooks versus one makes promotion or trade pawn for rook trivial.  I set the table a little late, but eventually got there... I was focused on possibly getting my two rooks into a horizontal battery to eat the f7 pawn.",
        "23... g5 24. Re7 Kf8 25. Rxa7 Re8 26. Kf1 Kg7 27. c5": "And a wise choice to resign as the end is near.  Overall, a few mistakes for Black early led to restricted choices down the line.  Remember to trade pawns, not pieces, when you are down.  It's hard to make a comeback without power."
    },
    "url": "https://gameknot.com/annotation.pl/alekhines-defense-training-game?gm=61397",
    "gameName": "Alekhine's defense Training Game",
    "players": "evilgm (1900) vs. marvgiff (1467)",
    "opening": "Alekhine's defence (B05), modern, Flohr variation"
}