{
    "moves": {
        "1. e4": "e4 è una delle mosse più logiche per il Bianco: occupa il centro e libera lo sviluppo dell'alfiere e della Donna.\r\ninoltre poichè l'alfiere che puo' muoversi è quello in f1, e4 è anche un passo di avvicinamento all'arrocco corto.le partite che iniziano con e4 si chiamano in funzione della risposta del nero partite di Gioco Aperto (se il Nero risponde con e5) oppure partite di Gioco Semi-Aperto (se il Nero fa qualsiasi mossa diversa da e5).\r\nLe partite di Gioco Aperto sono caratterizzate da un gioco tagliente fin dalle prime mosse per cui è fondamentale completare lo sviluppo in breve tempo e tenere sotto controllo il centro per avere la meglio.\r\n",
        "1... e5": "1....e5 è la risposta più naturale ad 1.e4.\nsi oppone all'occupazione del centro e analogamente a quanto fa e4 per il Bianco, e5 libera per il Nero lo sviluppo dei pezzi Alfiere di re e Donna.\nOccupare/controllare il centro significa occupare/controllare le quattro case e4,d4,e5,d5; nella battaglia per il centro per capire chi ha la meglio si valutano queste quattro caselle.\nOsservando le 4 case centrali si puo' osservare che il pedone bianco minaccia qualsiasi pezzo del Nero che venisse a trovarsi in d5. quindi il Bianco occupa e4 e controlla d5.\nIl Nero analogamente occupa e5 e controlla d4.\nLa battaglia per il centro al momento è pari.",
        "2. Nf3": "Col cavallo in c3 il Bianco minaccia due case del centro (e5 e d4) inoltre in previsione di un futuro arrocco su lato del re, il cavallo difende la casa h2 da eventuali attacchi del Nero",
        "2... Nc6": "Con questa mossa il Nero difende il pedone e5 e tiene sotto controllo d4.\r\nQuesta sembra la risposta più logica per il Nero, comunque ci sono anche altre possibilità, ad esempio 2....d6 o 2...Nf6.\r\n\r\n",
        "3. Bb5": "3.Bb5 è la mossa che caratterizza la Partita Spagnola (o \"Rui Lopez\"). L'idea è di attaccare il difensore del pedone e5.\r\nTuttavia la minaccia del bianco è solamente ipotetica, il Nero per il momento non ha bisogno di difendere ulteriormente il pedone. Infatti se il Bianco mangerà il cavallo il Nero ha a disposizione un tatticismo per recuperare il pedone.\r\n[Ad esempio 3....a6(minacciando l'Alfiere) 4.Bxc6 (il Bianco rimuove il difensore di e5), dxc6! 5. Nxe5?, Qd4! \r\nOra la Donna attacca sia il cavallo in e5 che il pedone in e4 (che mangerebbe con scacco) ed è impossibile difendere entrambi]",
        "3... Nf6": "Un ottima mossa per il Nero. Sviluppa il cavallo in una casa perfetta (minaccia e4 e d5, difende h7) e procede verso l'arrocco.",
        "4. O-O": "Il Bianco arrocca e non si preoccupa di difendere il pedone e4.\nSe il Nero mangerà il pedone (4...Nxe4) il Bianco potrà sfruttare il vantaggio di sviluppo (il Bianco ha già arroccato il Nero no) per aprire il gioco con Re1 (minacciando il cavallo in e4) e alla mossa successiva si potrà riprendere il pedone.\nOvviamente in questo caso al Nero non mancano le contromosse.\nMa la partita è andata in un'altra direzione...",
        "4... Be7": "prepara l'arrocco",
        "5. Re1": "il Bianco sviluppa la torre sulla colonna \"e\" con un'obiettivo immediato (difendere il pedone e4) ed uno a lungo termine (controllare la colonna nel caso si apra).\r\nOra il Nero deve stare attento perchè il pedone in e5 è minacciato:in caso di 6.Bxc6, dxc6, 7.Nxe5 la risposta 7...Qd4 non funziona più perchè dopo 8.Nf3 la donna è minacciata (non può mangiare in e4 causa torre in e1) e il pedone non viene più restituito.",
        "5... O-O": "Il Nero mette il Re al sicuro (ma lascia il pedone e5 al suo destino)",
        "6. Bxc6": "il Bianco rimuove il difensore di e5.\n",
        "6... dxc6 7. Nxe5": "...e poi mangia il pedone indifeso.\nprima di arroccare il Nero avrebbe dovuto difendere il pedone e5",
        "7... Bd6": "il Nero minaccia il cavallo bianco.\r\n(non so se questa è una buona mossa; probabilmente no perchè l'alfiere viene mosso per la seconda volta e fa perdere tempo prezioso al Nero; era preferibile forse giocare 7.Re8, con l'idea di contestare la colonna \"e\" al Bianco fin da subito; inoltre da e8 la torre avrebbe minacciato insieme al cavallo f6 il pedone e5 non appena l'alfiere si fosse spostato da d7)",
        "8. Nf3": "Il cavallo torna al sicuro, inoltre poichè l'alfiere Nero si è portato in d6, ora è presente la minaccia di 9.e5! con forchetta (il pedone minaccerebbe sia il cavallo che l'alfiere)",
        "8... Bg4": "inchioda il cavallo bianco (infatti se il cavallo si muove c'è Bxd1!). questa mossa non è cattiva. solo che in questo momento con la minacca di forchetta del pedone verso e5 bisognava giocare qualcos'altro (mi viene in mente sempre Re8).",
        "9. d4": "il Bianco non vuole infierire subito (9.e5 avrebbe guadagnato un pezzo per un pedone) perchè preferisce occupare il centro con la coppia di pedoni.\r\nIn generale una coppia di pedoni in e4, d4 (o in d5,e5 dal p.d.v del Nero) sono il sogno di qualsiasi giocatore. se l'avversario non si oppone energicamente, una coppia di pedoni centrali ben sostenuta può fare danni molto gravi alle truppe nemiche.\r\nPer questo motivo il Bianco ha preferito ottenere un vantaggio strategico (occupazione del centro) ad uno materiale (e5 con guadagno di un pezzo).\r\nMa la minaccia di pedone in e5 è sempre presente...",
        "9... Qe7": "il nero non si avvede della minaccia.\r\nEra preferibile spostare uno dei due pezzi minacciati: ad esempio 9....Bb4",
        "10. e5 Bb4": "il Nero tenta di trovare compenso per la perdita del cavallo minacciando la torre bianca...",
        "11. c3": "...ma è troppo tardi. bisognava intervenire prima",
        "11... Nd5 12. cxb4 Nxb4": "il Nero ha ceduto un pezzo ma almeno si è ripreso un pedone. è una buona cosa limitare i danni.\n\nvolendo essere ancora più precisi, quando capita di subire una forchetta come 10.e5 se non c'è via d'uscita tanto vale usare il pezzo che si decide di cedere per fare più danni possibili. \nin questo caso \"più danni possibili\" era appunto riprendersi almeno un pedone, quindi il Nero ha giocato bene.\nVisto che c'era tanto valeva prendersi un pedone di quelli centrali che sono più importanti. quindi a 10.e5 era interessante rispondere 10....Bxe5. ",
        "13. a3 Nd5": "il cavallo Nero occupa una casa importante.\r\nessendo il cavallo uno di quei pezzi che ha minor gittata (rispetto all'alfiere e alla torre ad esempio), per esprimere il massimo potenziale (ovvero per minacciare più case possibili, cioè 8) è sempre bene che il cavallo sia in una posizione centrale o vicina al centro.diciamo che il cavallo è in una buona posizione quando occupa una delle case comprese nel quadrato formato da c3,f3,c6,f6. \r\nInoltre il cavallo è il pezzo più adatto per bloccare l'avanzata di un pedone. Infatti pur avendo davanti a sè il pedone d4, il cavallo grazie al suo movimento ad L è l'unico pezzo che da quella posizione può minacciare le case di possibili difensori del pedone avversario (ovvero c3 e e3).\r\nQuindi se non si sa cosa fare di un cavallo ed è disponibile una casa davanti ad un pedone avversario, può essere una buona idea piazzarlo lì! ",
        "14. Qd3": "toglie la donna da d1 liberando il cavallo in f3 dall'inchiodatura.",
        "14... Qe6": "questa mossa non è chiara. forse il Nero voleva difendere l'alfiere? o forse con la donna vuole sostenere l'alfiere per giocare 15....Bf4 con minaccia alla donna bianca?\r\nun'alternativa comunque poteva essere fare una mossa di sviluppo per merre in gioco le torri (esempio Rad8, o Rfe8) oppure fare una mossa profilattica come h6 (per togliere la casa g5 al cavallo bianco).\r\n\r\n",
        "15. Nc3": "il Bianco mette in gioco un altro pezzo e minaccia il forte cavallo nero in d5.",
        "15... a6": "prepara la spinta in b5?\r\n\r\nquesta mossa di per sè non fa danni al Nero. solo che è comunque una mossa debole (in questa posizione) perchè non è necessaria (la casa b5 era già controllata dal pedone c6).\r\nIl peccato principale di questa mossa è che aggiunge quasi nulla al gioco del Nero (è quasi come se il Nero stesse fermo) mentre il Bianco ha disposizione una mossa in più per creare iniziativa o acquisire vantaggio.\r\nIn questo caso era meglio mettere in gioco le torri, ad esempio con Rfe8, oppure con Rad8. Oppure, guardando attentamente la disposizione dei pezzi del Bianco (la donna bianca punta verso h7, il cavallo bianco da f3 può portarsi in g5 aggiungendo una minaccia ulteriore ad h7) era sicuramente importante prevenire un attacco con h6 (che rende impossibile la discesa del cavallo bianco in g5).",
        "16. Ng5": "minaccia la donna nera e il matto in h7. \ncampanello d'allarme...",
        "16... Nf4": "il Nero probabilmente non vede la minaccia di matto e prova a cambiare le donne.\r\nMa era necessario impedire il matto, ad esempio con 16...Qg6.\r\nquesta discesa del cavallo bianco in g5 spiega come a volte siano utili anche mosse profilattiche come h6.\r\nquando la donna (o un alfiere) si pongono sulla diagonale b1-h7 (o a colori invertiti b8-h2) bisogna sempre stare attenti ad una possibile minaccia di matto.",
        "17. Qxh7#": ""
    },
    "url": "https://gameknot.com/annotation.pl/allenamento?gm=32968",
    "gameName": "allenamento",
    "players": "milo974 (1676) vs. latenda (1169)",
    "opening": "Ruy Lopez (C65), Berlin defence, 4.O-O"
}