{
    "moves": {
        "1. e4 c5 2. Nf3 d6 3. Be2": "My opponent is making an unusual third move.",
        "3... Nd7": "Now have both nearly left theory.",
        "4. O-O Ngf6 5. d3 g6 6. Nc3 Bg7 7. Bd2 O-O 8. h3": "Why? Seems like a wasted tempo?",
        "8... e6": "I on my side develop in the center.",
        "9. Qc1": "White is aiming towards the h6-square, planning to try to exchange his dark-square Bishop against mine dark-square Bishop. But I don´t think that is a threat!",
        "9... a6 10. a4 b6": "i want to fianchetto my light-square Bishop at b7.",
        "11. Re1": "Moving the Rooks towards the center are often good strategy in the middlegame!",
        "11... Bb7 12. Bh6": "Now it comes. But why not earlier? Why not already in move 10? Because White commited himself to that already in move 9. No use to wait for it, the same thing when a player makes b3/b6 or g3/g6, it´s mostly best to fianchetto the actual Bishop already in the next move. No gain to wait for it!",
        "12... Qc7 13. Bxg7 Kxg7 14. Nh2": "To decentralize the Knight is mostly not a good idea. ",
        "14... d5": "d5, central breakthrough. Had prepared for this move with my last moves.",
        "15. exd5 exd5 16. Bf3 Ne5 17. b3 Nxf3+ 18. Nxf3 Rae8 19. Qb2": "White´s Queen try to be dangerous along the a1-h8-diagonal. To defend against this, Black can either move out of the pin or even better...",
        "19... d4": "d4!!!! This move both threatens the Knight at c3 and closes the a1-h8-diagonal! Good move!",
        "20. Ne2": "??? This move will end with the loss of the game! Necessary was Nce4, even if that move will lose a pawn it would have been much better for White than the text move.",
        "20... Bxf3": "Now can Black destroy the pawn shield in front of White´s King. Very bad!",
        "21. gxf3 Qd7 22. Kg2 Nd5 23. Qc1 Qf5 24. Ng1": "This move looks awkward at a first glance, but according to my analysis it was the best move.",
        "24... Nf4+ 25. Kf1 Qg5 26. Re4 Qg2+": "Now it is to late for White.",
        "27. Ke1 Qxg1+": "White loses his Knight.",
        "28. Kd2": "White gave up. It was hopeless."
    },
    "url": "https://gameknot.com/annotation.pl/allsvenskan-division-3-2018-19?gm=65572",
    "gameName": "Allsvenskan Division 3 2018-19",
    "players": "Curt Nordin (1447) vs. Fredrik Arkefeldt (1478)",
    "opening": "Sicilian (B50)"
}