{
    "moves": {
        "1. b4": "The Polish attack! Or perhaps, Sokolsky opening. Well I wasn't expecting this in this Blitz game. But there was no way I wanted that dark squared bishop looking at my kingside. After a very brief think, I decide to accept doubled pawns if white chooses to do that...",
        "1... g6 2. Bb2 Nf6 3. e4": "Supposedly the game is equal here, although black has a very slight advantage according to Fritz.",
        "3... Bg7": "And now I may end up with a knight on g7! Now obviously, a better way to have approached this odd flank opening would have been with 1. ...e5 but aside from white getting good pressure in the center, stay tuned for what follows...",
        "4. Bc4 O-O 5. e5 Ne8": "My pieces are in danger of getting rather cramped.",
        "6. Nf3 a6": "An immediate ...d5 was better. ",
        "7. a4": "Here I decide to create a little queenside action, simply to not allow white to totally restrict black.",
        "7... Nc6 8. b5 axb5 9. axb5 Rxa1 10. Bxa1 Na7": "I did not like Na5.  Perhaps Nb8 would have been better.",
        "11. Na3 b6 12. O-O c6": "Bb7 might have been a better move here. But, because of the position, if white takes the c pawn, I plan on driving up the board a bit on the queenside. And if not, then I had ideas to free up my knight and light-squared bishop. Now yes, black looks really bad, lol. But white's pieces are not that well coordinated yet, and I can't afford to let them get coordinated!",
        "13. bxc6 dxc6": "I am beginning to feel a little better about black's position now.",
        "14. Re1": "This was a slight inaccuracy by white. Better was Qe2.",
        "14... b5 15. Bb3 b4 16. Nc4 Be6": "And this gives white back the advantage, but I wanted my bishop out doing something.",
        "17. Qe2": "Better for white was Bd4 or Nd4. But his momentary failure to see this allowed me to cover it on my next move.",
        "17... Nb5 18. h3": "I think this was an inaccuracy here. It gives me one more tempo to reposition a knight to a very useful place, and with my kingside fianchettoed, there would be no lasting pin on g4. Fritz agrees.",
        "18... Nec7 19. d4 Nd5": "Now at this point of the game, both sides look rather awkward. Fritz insists the game is still even. No one has yet blundered, but a couple of small inaccuracies have been made, leading to white's dark squared bishop being rather out of the action, and black to being still cramped, although not as badly as before.",
        "20. Ng5": "I give this some thought, and decide I would not mind so much if the pawns were doubled, as it would give me the f file. I don't want the white e pawn advancing any further, especially with the way white's pieces are set up. Fritz does not like this idea, preferring that I not allow those pawns to be doubled.",
        "20... Bh6": "So, I decide to see what white really does have in mind, since my black bishop was not doing very much on g7.",
        "21. Nxe6 fxe6 22. g3": "I am not wanting to control the f4 square, but white felt he needed to make sure he did. Fritz thinks Qg4 was much better, and this is the first move Fritz really dislikes. Nor do I do what Fritz wishes; I don't want to move a knight to c3, because it allows white to find an immediate use for his one bad bishop. But after 22. ...Ndc3 23. Bxc3 bxc3, black gains dangerous piece pressure on the queenside. One line would continue 24. Rd1 Nxd4 25. Qd3 c5 26. Ne3 Kg7 and little is left for white to try; 27. f4 is too dangerous. In this blitz game, however, I did not see this.",
        "22... Rf7": "Here I am preparing a bit of a push on the f file. For some reason, white's dark squared bishop has seemingly been forgotten in that upper corner, and I am not minding that one bit. It's a pretty bad bishop right now, and would take a couple moves to undo that. But white does not see the long term value of doing so at this point.",
        "23. Qg4": "This is actually a pretty good move for white, if he chooses the right continuations later. Fortunately for me, he does not. I'll mention it in a bit.",
        "23... Rf5": "I will have time now to swing my queen over, and create a little pressure down the f file. This game is just really odd at this point.",
        "24. h4": "I believe that white is simply creating a place for his queen to go so that g pawn can move forward. The white king will be exposed, but I am still a ways from being able to take advantage of that.",
        "24... Qf8 25. f4": "And white thinks he has shut down my attack. Well... we'll see here in a bit. I have an idea, but don't know if I have time to do it. And white can easily force my rook from f5...",
        "25... Qf7": "I'd like to get my king to g7 at some point, but perhaps not quite yet. Now I'm committed to my idea; the black rook cannot escape easily... and if this wasn't Blitz, I'm pretty sure white would find the way to win a pawn...",
        "26. Ne3": "I of course am forced to exchange knights because I don't want to move my rook in this position. For some reason, white does not continue with the obvious to threaten the black rook here.",
        "26... Nxe3 27. Rxe3 Nc7": "Well, this could get rather ugly for black, since black's rook is rather trapped at the moment.",
        "28. Bc4": "Hmmm. I had not considered just that bishop move, as obvious as it is. With Bd3 on his next move, black would have to play what he had prepared before he was ready. I try one move first, to see white's intention. Can you guess black's intention yet?",
        "28... Nd5": "Rf3 here for white is dangerous for black. If Rf3, black will be hard pressed to salvage a draw. But white misses it, having decided he wants his rook to take the b pawn. So at this point, the game takes a different turn than it otherwise would have.",
        "29. Bxd5 cxd5": "I did not take with the e pawn because I did not want that diagonal open for the white queen, nor did I wish to have an unsupported backwards pawn. Nor did I want white to get in e6. And because white chose to give up that powerful white bishop, I can try my idea on my terms now if white does not move Rf3.",
        "30. Rb3": "What would you do here as black? It's likely easy to see now since there is not much else black can do here and I've given plenty of hints on what white needed to do. You stronger players will know anyways. It turns out to give black an advantage, now that the white light-squared bishop is no longer on the board.",
        "30... Bxf4": "Bxf4! So white thinks a bit here. And decides to take it on.",
        "31. gxf4 Rxf4 32. Qg3": "To keep the game from getting away from white, Qh3 was called for here. This is the game's first real blunder, and it gives black such an advantage that even in Blitz, it's not given back. After Qh3, however, black's winning chances are greatly reduced even though black still has good opportunities to draw with best moves, according to Fritz.",
        "32... Rf1+": "I missed Qf5! which would have been even better here. Well, to be honest I thought about it. But time was short, and I did not have time to think it all the way through; seeing that nothing was imminently going to threaten the black king, I decided to take the bishop.",
        "33. Kh2 Rxa1": "Qf5 was still even more devastating here, but this time I did not even consider it.",
        "34. Rxb4": "And this move seals white's fate; he does not have time to grab the pawn.",
        "34... Qf1": "Either Qf5 or Qf1 as I chose are both now devastating, and the game will end soon.",
        "35. Rb8+": "This just delays the inevitable. White has no good response.",
        "35... Kg7 36. Qg2": "Forced, because otherwise Qh1 is mate.",
        "36... Qf4+ 37. Qg3": "Kh3 also leads to a won endgame for black. This loses immediately...",
        "37... Rh1+": "Rh1!",
        "38. Kg2": "Well it was Blitz.",
        "38... Qf1#": "Things got messy in a hurry; but white not noticing a few things there including that bishop sacrifice allowed black to sneak out the point. Hope you enjoyed this one!"
    },
    "url": "https://gameknot.com/annotation.pl/almost-a-polish-attack?gm=51350",
    "gameName": "Almost a Polish attack...",
    "players": "Anonymous  vs. Pierre99 ",
    "opening": "Polish (Sokolsky) opening (A00)"
}