{
    "moves": {
        "1. Nf3 d5": "Unusual opening for me, but nothing that scares me. ",
        "2. c4": "Out of my confort zone, I played...",
        "2... d4": "...knowing that the pawn's defence won't have to be easy. ",
        "3. b4": "Oh, that's really brand new to me! Let's have fun!",
        "3... Bg4": "I assumed that Nd7 was what he was prepared for. Now I am prepared to exchange the B for the N in order to release pressure against d4, that could then be supported by e5. In the meanwhile, I'll had to stand for he attack on the white squares, which I am confident I can do provided I won't lose d4 in the process. ",
        "4. Ne5": "This knight is not actually threatening nothing but c3, and it was foreseen. ",
        "4... Bh5 5. Qa4+ c6 6. b5": "The e4 pawn is not defended after my next move, but it is not threatened, either. Even without the bishop, my defences should hold, since the N e5 will be threatened. ",
        "6... Qc7 7. bxc6 Nxc6": "No white pawns or lsb in sight to threat my knight, and his is still under threat. ",
        "8. Nxc6 bxc6": "? I should have gone for he queen's exchange, with complete equality. I was confident I could unpin the c pawn and reach a secure c5-e5 solid center. ",
        "9. Ba3": "White is pressing me hard. I'm not advised to move the e pawn and lose the castling rights. ",
        "9... Nf6": "So I develop the other minor piece, hoping for a better chance. e4 - incredibly - is not threatened yet. ",
        "10. g3": "White, correctly, gets more pressure on c6, while I am still far from c5. I hope to force him to play c5 himself, so to block his dsb's action. ",
        "10... Nd7": "Nb6 would unpin the c pawn, supporting a sure c5 from black's side. ",
        "11. Bg2": "Of course, I have to defend c6 first thing. ",
        "11... Rc8": "It holds. My \"bet\" about the absence of my lsb from the action is costing me a hard game. ",
        "12. Bh3": "? I would say, since it allows my next move. I recognize white's wise judgement in not playing c5, but on the other side the pressure on c6 was his best chance. ",
        "12... Nb6 13. Qa6": "I have to be very, very careful, now. ",
        "13... Ra8 14. c5": "Finally. But my N has squares to go. And now my e pawn is free. ",
        "14... Nd5 15. Qc4": "I was among Qe5 and e5. I'm not still sure about the best one. I went for...",
        "15... e5": "I liked to prove my opening was sound. I am prepared to play f6 and bring back my lsb. ",
        "16. Bg2": "Of course, taking revenge with d4's weakness, now without the support of another pawn. ",
        "16... Nf6": "a zen-like move. No more threat, and no more f6. I am planning around a possible e4. ",
        "17. Qa4": "Doubling the threat on c6, and I have no better response than...",
        "17... Rc8": "Kd7 is a dangerous try. ",
        "18. d3": "Finally. Ok, no more e4 for the moment, but I have a tempo. ",
        "18... Be7": "Nothing more, but if I can castle I will be really released. ",
        "19. Bh3": "We're playing cat and mouse. I can always move my rook. ",
        "19... Rb8": "I dare a little more, looking for Rb5-Ra5.",
        "20. Nd2 O-O": "First's first. It's not the moment to lose nerves. ",
        "21. Nc4": "Nd6 is not exchangeable. But is it really threatening something? Nope. ",
        "21... Rb5": "This is played so that if he moves the N, Ra5, followed by Rb8...",
        "22. Bg2": "White has no firepower on c6 while the R is interposed, and the only piece that can drive it out is the N, but if the N moves, the R is free to go to a5. ",
        "22... Bxc5": "...the pointless B move by whie overlooked this simple but stunning move. White should have played Nd6 anyway, with complicated tactics. ",
        "23. Bxc5 Rxc5": "Very elegant. The R defends the c6 pawn, and can't be easily kicked. ",
        "24. Rb1": "No problem, if I play carefully (Rb8? RxR, QxR, B/Qxc6...",
        "24... Nd5": "This N can have a good purpose: to get rid of white's lsb due to its threat Nc3. ",
        "25. Bxd5 Rxd5": "Very neatly, black has a pawn and the edge, now. ",
        "26. Rb2": "White misses some tempoes, and they will make my lsb to return to action. ",
        "26... f5": "Again daring more than the wise f6. But I need in chess you don't have to miss the chance to attack, or you be fatally attacked in return. ",
        "27. O-O": "This was Rb2's purpose. Good plan. White is playing very correctly, as far as I can see. ",
        "27... e4": "Opening lines for my R before white can react with Qb3 - with a discovered check if I move the R. ",
        "28. f3": "Nice. The correct move to defend. ",
        "28... exd3 29. exd3 f4": "I hope for g5, Be8, threatening d4 - at last!",
        "30. Kg2": "Correctly defending against fxg3. ",
        "30... fxg3": "Anyway. ",
        "31. hxg3 Rg5": "Not sure about this or Rd-f5 instead. ",
        "32. f4": "This was the moment I saved the game for. Was this a blunder or wasn't it?",
        "32... Rxf4": "Apparently, I can take on f5 since the g pawn is pinned. ",
        "33. Ne5": "...and this move just loses a piece. ",
        "33... Qxe5 34. Qb3+": "If Kh8, I'll set a trap for myself, with a weak defence. Note that Bf7 is impossible due to Qb8+, QxQ, RxQ+, and black must lose the B to avoid mate. ",
        "34... Kf8 35. Qb4+": "White is delaying his death all that he can, and I'm not sure he won't succeed. From our amatourish point of view it is a very interesting and tense game, still uncertain on move 35. ",
        "35... c5 36. Qb8+": "Finally. Now black will lose the Rf5. ",
        "36... Qxb8 37. Rxb8+ Ke7 38. Rxf4 Re5": "Black is lost. ",
        "39. Rb7+ Ke6 40. Rxa7": "Giving a pawn for a tempo, without hope. ",
        "40... Re2+ 41. Kh3 Bg6 42. Ra5 Bf5+ 43. g4 Re3+ 44. Kh4": "Playing rat'n mouse with him, all under Rxc4's threat. But it's all fireworks, I have no mate (at least as far as I can see). I have no time for h6 - or it will be mate!",
        "44... Bxd3": "Consueling prize. ",
        "45. Rxc5 h6": "I I know that Rxd4 will follow, but I want a cage around his king because I am setting a mate net. Unfortunately, white didn't see it and fall into a one-into-a-million chances I had to save this game. ",
        "46. Rxd4 g5+": "White can only play Rxg4, losing a R for two pawns. It would be still better than...",
        "47. Kh5 Rh3#": "...due to the well positioned lsb. White overlooked this not-so-common mate pattern, but in general he had me most of the time, and proved a strong opponent. "
    },
    "url": "https://gameknot.com/annotation.pl/almost-squeezed?gm=56648",
    "gameName": "Almost squeezed...",
    "players": "bobetuin  vs. damalfi ",
    "opening": "Reti (A09), advance variation"
}