{
    "moves": {
        "1. e4": "Team Match, I'm playing white and begin with the Open Game.",
        "1... e5 2. Nf3 Nc6 3. Bb5": "My oponent obliges me with the opportunity to play the Ruy Lopez. It would be rude to refuse.",
        "3... a6 4. Ba4": "The Morphy Defense with 3. ... a6.",
        "4... Nf6 5. O-O Nxe4 6. d4": "The Open Defense. I haven't seen this one yet, but at least this is one I have the reference material for. 6. d4 b5 is standard.",
        "6... b5 7. Bb3 d5 8. dxe5 Be6 9. Be3": "All main-line moves in the Open Defense.",
        "9... Bc5 10. Qe2 Qe7 11. Rd1": "Pressure builds in the center, something's gotta give soon.",
        "11... Rd8 12. Nbd2 Bxe3 13. Qxe3": "Black decides to let off a little steam.",
        "13... Nc5 14. c3": "Both players are declining to take needless exchanges. Evidently, we both like to keep things complicated.",
        "14... Bg4 15. Rde1 Ne6 16. Bc2 Bh5 17. Bf5 Bg6 18. Bxe6": "As minuscule as it is, this exchange creates a small advantage for white by inviting black to choose between 18. ... fxe6, leaving black with a backward e-pawn and an exposed king, or 18. ... Qxe6 which lets white play 19. Qc5 exploiting the hole in black's defense, pinning the king in the center and forcing black to spend energy evicting the white queen.",
        "18... fxe6 19. Nd4": "Attacking that backward pawn early, though not with enough material to win it yet.",
        "19... Nb8 20. Qh3": "19. ... Nb8 may not have been the best choice. It retreats the knight away from the action and posts it on a square where it won't do black any good. 19. ... Nxd4 might have been better, eliminating the threat to the backward pawn at e6. And with 20. Qh3 white is now getting more serious in his attack against e6. As a side note, this game will end in 22 moves and this knight will still be on b8, though it does get a chance to make a last-move sacrifice that merely delays checkmate by one move.",
        "20... Bf7 21. b4": "21. b4 serves two purposes. First, it limits the mobility of black's queen, though she's pretty much tied to defense anyway. More importantly, it defends c5, robbing black of the square and preparing to post a knight there.",
        "21... O-O 22. Nd2b3 Rde8 23. Nc5": "As advertised, though black anticipated the move and added another defender to the pawn at e6. Well, maybe it's time to get busy on the flank.",
        "23... Kh8 24. a4 c6 25. Qg4 g5 26. axb5": "White has a strong position, but at the moment his attack is going nowhere fast. Black may have been better off consolidating with 25. ... Bg8 which defends h7 and g7 and opens the f-file for the black rook. Unless I've missed something, the move as played seems reckless and doesn't seem to offer black any advantage.",
        "26... axb5 27. Ra2": "Now that white has the open a-file, it may be interesting to put both rooks on it, though the idea of getting a rook to e3 then to h3 or g3 as needed to support a kingside attack is interesting too.",
        "27... h5 28. Qh3 g4 29. Qe3": "Well, that decides it. The a-file it will be.",
        "29... Kg7 30. Rea1 Kg6 31. Ra2a7": "Black is using his king actively, rather than passively sitting back waiting to be hunted. It's kind of like bringing the goalie out of the goal box - it adds one more piece to black's arsenal. Still, his pieces are in each others' way and he's probably feeling a little cramped. White should be able to exploit that.",
        "31... Qg5 32. Ndxe6": "I have to give two thumbs up for 32. Ndxe6!!, the winning move. I almost didn't find it. It looks crazy. White has been pressuring that backward pawn on e6 since he created it with the exchange 14 moves ago. However, white lost one of the attackers when he moved his queen away from h3, and the pawn is fully protected. But I noticed that on e6, the white knight forks the black queen and rook, so I decided to analyze this crazy move to see if it could be justified. First thing, 32. ... Bxe6 33. Nxe6 Rxe6 looks bad for white, since he loses a piece for a pawn. But, then, there is always 34. (or even 33.) Rg7+! Kxg7 35. Qxg5+ and white gains material. But what about 32. ... Rxe6? 33. Nxe6 Bxe6 35. Rg7 and again white wins the black queen, and as an added bonus, breaks even on two knights for rook and pawn. Suddenly this move didn't look so crazy. Black can reply 32. ... Qxe3 exchanging queens and avoiding losing material. Except, white has a zwischenzug that invalidates that line. So, finally, the queen can run away, say with 32. ... Qf5, but then white simply wins material with 33. Nxf8. Much goodness, no badness. And I almost didn't even look at the move...",
        "32... Qxe3 33. Nxf8+": "The zwischenzug. By taking the rook with check, white wins material before retaking the black queen.",
        "33... Rxf8 34. fxe3": "OK, white gained a pawn and the exchange, but has doubled isolated e-pawns. Is it enough to win?",
        "34... d4 35. Rf1": "The first thing black did was offer white the chance to undouble those e-pawns with 35. exd4, creating 4 solid linked pawns. But, white has better attacks to make; that pawn capture can wait.",
        "35... dxc3 36. Rf6+": "Or maybe it can't wait, since black opted for a preemptive strike. But it will prove to be black's undoing.",
        "36... Kg7 37. Ne6+": "Black's king moved into position to pin his bishop, but 36. ... Kg5 was suicide - a short king hunt and black's king finally dies on h3. However, as played, black is facing another knight fork and must lose more material.",
        "37... Kg8 38. Nxf8 c2 39. Rf1": "Oho, it's going to be like that is it? Well, can't let him have his queen, that won't do.",
        "39... Bc4 40. Nh7": "OK, enough is enough. Black wants the rook he's welcome to it. White only needs the knight and one rook (and a little help from a pawn) to checkmate black. This move doesn't force the checkmate, but it is a forced checkmate if black captures with 40. ... Bxf1. See it? You can also find it as a puzzle I created from this position, number 10429.",
        "40... Bxf1 41. Nf6+": "Oops, black took the rook, checkmate is forced, though really, the outcome was already eseentially decided.",
        "41... Kf8 42. e6": "So many choices for black, including promoting his pawn, but nothing will stop 43. Rf7# except the knight sacrifice, which only delays the checkmate by one move - as predicted back on move 20."
    },
    "url": "https://gameknot.com/annotation.pl/almost-dismissed-the-winning-move?gm=23250",
    "gameName": "Almost Dismissed the Winning Move",
    "players": "blake84120 (1948) vs. yogy (1874)",
    "opening": "Ruy Lopez (C80), open, 8...Be6"
}