{
    "moves": {
        "1. e4 d5 2. exd5 Nf6 3. d4": "The recommended following for white. ",
        "3... e6": "The Icelandic gambit.",
        "4. dxe6 Bxe6": "Black is ahead in developement... just a bit, since his pieces are not aggressively placed ",
        "5. Nf3": "Normal. c4 opens me some lines for attack via the black squares and Ne4. ",
        "5... c6": "The aggressive approach Qe7, thinking in Bc4 to follow is sound, but it is easily met by Qd2 in return, and black has a blocked dsb for nothing. ",
        "6. Be2 Nbd7": "I wanted to approach the game calmly. My opponent was a 1700+ and I am not in a good shape. ",
        "7. O-O Bd6": "I am leaving plenty of room for a white's attack on the queenside, but I was confident my opponent didn't seem to go for quick attack either. ",
        "8. h3 h6": "Profilactic. But I am thinking in g4 and g5 already. ",
        "9. Re1": "Inviting me to take care of a quick castling. ",
        "9... Qc7": "Queenside, of course! From far away, black is using white's passivity to load and aim his weapons. ",
        "10. c3": "Another pawn moves, being so behind in developement... ",
        "10... O-O-O 11. Qa4 Kb8 12. b4": "Finally, white woke up and took his chance on my king. ",
        "12... Nb6 13. Qc2": "Here, I must have been sure to avoid c4 (once b4 is defended), but I know that in chess timing is it all. ",
        "13... g5 14. a4": "Now is the decisive moment. I can always escape via Nc4, so I can use another tempo for my attack. ",
        "14... g4 15. hxg4": "He thinks that he cannot allow gxN, but in fact, but in fact white's kingside is about to fall. ",
        "15... Nxg4 16. b5": "? The losing mistake, as it is not so forcing as a5, or Ne5, maybe. ",
        "16... Bh2+": "In order to open the way for the Q. ",
        "17. Kf1 Nxf2": "Anything just to bring the Q there. ",
        "18. Nxh2": "I think now that Qg6 was the best move, but I played...",
        "18... Qxh2 19. Kxf2 Rhg8": "Now it's almost thematic.",
        "20. Bf3 Bd5": "Bh3 would have been even better, maybe. White can eschange B, but then my other R will enter the fry. ",
        "21. Qd3": "Defending f3. Here, I can think about Nc4 or Bc4, but I went for the decisive move almost without thinking, just for instinct. ",
        "21... Rxg2+ 22. Bxg2": "Not to take could have been a little better, as strange as it may seem. No time to prove it, thoug. From here the mate is almost forced. ",
        "22... Qxg2+ 23. Ke3 Re8+ 24. Kf4 Qg5#": "...can you believe it? :-)"
    },
    "url": "https://gameknot.com/annotation.pl/almost-thematic-double-sacrifice?gm=59389",
    "gameName": "\"Almost thematic\" double sacrifice.",
    "players": "AtronomycalOne  vs. damalfi ",
    "opening": "Scandinavian defence (B01)"
}