{
    "moves": {
        "1. e4 c5": "Here I'm white playing the sicilian in a blitz game.",
        "2. Nf3": "Well, Nc3 could could be fine, but I have a huge preference on open lines and attack. A lot of players on gameknot do Bc4, but I don't think it's that great because there is too much counterplay after that.",
        "2... Nc6 3. d4 cxd4 4. Nxd4 e6 5. Bc4": "?! There is a lot of good possibilities with the sicilian in the opening. Most of the time, people continue with Nc3 or Nb5 here but since it's rare that I come to that line, I wanted to try Bc4. Bc4 was not the best option here since e6 blocks the way to the king and sometime there is a lot of counterplay with Na5 or a6+b5. I think however that it can be useful later in the game.",
        "5... Bb4+": "?! It give too much of counterplay and tempo for white. Ne6 would have been a better option. ",
        "6. c3": "I didn't wanted to do Nc3 because after Bxc3 bxc3, my pawn structure would have looked bad. It's true that I would have gained some open lines and the bishop but I don't think it was an enough compensation. Bd2 could have been a nice possibility giving me some nice tempo. c3 give the possibility to continue with b4 and a4 later and to secure the center.",
        "6... Bc5 7. O-O Nxd4": "? Very bad idea. Black waste again some tempo and lose the center.",
        "8. cxd4 Bb6 9. Nc3 a6": "?! Black should have done Ne7 here to be able to castle quickly.",
        "10. d5": "Trying to take profit of my greater development.",
        "10... exd5": "?! Ne7 would have been probably better.",
        "11. exd5": "Thinking about to do Re1+.",
        "11... Qf6": "?! I think d6 was mandatory here.",
        "12. d6": "!! Now black will have an hard time to continue his development.",
        "12... Bd4": "Giving the possibility to capture the d pawn and to do b5.",
        "13. Ne4": "? Nd4 and the game would have been practically over with the threat of Qxd4. Well I was thinking about something bigger.",
        "13... Qe5 14. Re1 Kf8 15. Ng5 Bxf2+": "! This sac took me by surprise, probably the only way for black to continue playing.",
        "16. Kxf2 Qc5+ 17. Re3 Qxc4 18. b3": "! Giving some accesses for my bishop.",
        "18... Qf4+": "? Very bad mistake.",
        "19. Rf3 Qh4+ 20. Kg1 Nf6 21. Qe2": "Threating Qe7+ then Qxf7#.",
        "21... Qd4+ 22. Kh1 Qxd6 23. a4": "! The queen must move to not get pinned by the bishop.",
        "23... Qd4 24. Ba3+ d6 25. Rd1": "The fun is over.",
        "25... Qxd1+ 26. Qxd1 Ke8 27. Qxd6 Ng8 28. Rxf7 h6 29. Rf8#": "Mated."
    },
    "url": "https://gameknot.com/annotation.pl/alone-on-the-battlefield?gm=54391",
    "gameName": "Alone on the battlefield",
    "players": "drchopper  vs. sabilillah ",
    "opening": "Sicilian (B32), Flohr variation"
}