{
    "moves": {
        "1. d4": "The following game illustrates the strength of the much-feared \"Flick-Knife Attack\" against the Modern Benoni. While White does not play entirely accurately in the opening, he makes no important mistakes and gradually transforms his natural positional advantage into a deadly passed pawn to score the full point. Black, meanwhile, makes no obvious mistakes in surrendering the full point! White's play lends a powerful impression.",
        "1... Nf6 2. c4 e6 3. Nc3 c5": "Allowing the pure Benoni sequence after 4.d5, a move order that has become increasingly rare in modern chess. Most would-be Benoni players prefer to enter the Nimzo-Indian or Queen's Indian after 3.Nc3, fearing the Taimanov variation featured in this game. Before moving on, I should note that even the non-Taimanov \"Modern Main Line\" (White's second-best shot against the Benoni) is extremely formidable. I fear the Benoni is inching closer and closer to refutation, but of course things are not so simple as contemporary theory suggests. Black retains irrepressible opportunities to muddy the water in all Benoni variations!\n",
        "4. d5 exd5 5. cxd5 d6 6. e4 g6": "Here is a basic Modern Benoni formation. Black will develop his \"bad\" bishop onto g7, where is exerts tremendous pressure on White's queenside. Then, Black often continues with queenside expansion via ..a6 and ..b5, with tactical play along the dark squares. Sometimes Black offers the pawn sacrifice ..b5 to open queenside lines (specifically pressuring b2) and sometimes divert the Nc3 from defense of e4 (allowing ..Nxe4). Black's main problem is space - White has most of it! The cramped nature of Black's position makes it somewhat difficult for him to develop his queenside minor pieces, especially the c8 \"problem\" bishop (d7 is best reserved for a knight, and b7 often interferes with a rook on b8). For this reason, Black often hopes for an early ..Bg4, pinning the Nf3 to the queen (and preventing the powerful White maneuver Nf3-d2-c4, a key theme as a knight on c4 places tremendous pressure on Black's d6 pawn. Indeed, so powerful is this plan that White plays an early h3 in many lines just to stop it!). White's plan is simple - use his massive space advantage to place his pieces on \"ideal\" squares and enforce the advance e4-e5, which often initiates kingside attacking possibilities. Black invariably meets this threat with tactics (really the only reason the Benoni is still playable), which make for a very exciting and double-edged game. A quick aside: a move deserving attention is 6..a6!?, which prevents White's 8th move and thereby dodges the Flick-Knife attack. In light of White's healthy plus in the Flick-Knife, this quirky move is probably worth further investigation. It would be an easy choice if not for White's speedy plan of 7.f4 g6? 8.e5! and White is crashing through.\nAlternative variation: 6... a6!?\n",
        "7. f4": "Here it is, the beginning of the fearsome Flick-Knife attack setup (aka the Taimanov Attack), which is currently close to refuting the entire Benoni system. For this reason, few top-level players allow White this setup. Instead, they only commit to the Benoni if White plays an early Nf3 (as f4, and the Flick-Knife, is now impossible). Here, however, Black's attitude is merely, \"game on!\"\n",
        "7... Bg7 8. Bb5+": "The point. This innocent-looking move causes tremendous problems for Black. White keeps Black's king in the center with tempo plotting an early e5 (in most lines).\n",
        "8... Nfd7": "Regrettably, this is probably the only move, covering e5 with the bishop but further cramping Black on the queenside. Black dearly wants to play ..Nbd7 and ..0-0 (not ..Bd7? when White plays e5 immediately with a huge position), but upon 8..Nbd7 White has 9.e5! and Black has serious issues. No less than Veselin Topalov attempted (and basically failed) to revive ..Nbd7 to theoretical equality. That the following variation is considered a \"main line\" and remains largely unclear (with a statistical bias towards White) is testimony to the Benoni's explosiveness:\nAlternative variation: 8... Nbd7 9. e5 dxe5 10. fxe5 Nh5 11. e6 Qh4  12. g3 Nxg3 13. hxg3 Qxh1 14. Be3 Bxc3  15. bxc3 a6\n",
        "9. e5": "This is actually a mistake (and virtually the only misstep White makes in this very sharp game - he plays well above his rating here (which makes sense - he's still undefeated as far as I know). This is the correct response to ..Bd7 and ..Nbd7, but not ..Nfd7. The whole point of moving the f6 knight is to cover e5 with the bishop and so prevent 9.e5. Stronger is the flexible 9.a4 (which must be played anyway to stall the ..a6 and ..b5 plan. It is the essence of flexibility that \"necessary\" moves are played as soon as possible, saving more committal moves for later when you have more information on the opponent's setup).\nAlternative variation: 9. a4 Qh4 ! 10. g3 (creating this kingside weakness is worth the tempo, as it expands Black's tactical possibilities in future positions) Qe7!? (also Qd8).\n",
        "9... O-O 10. Nf3": "Best. White cannot play 10.exd6 because Black can continue ..a6 and ..Nb6 (a popular, if temporary, square for a knight in the Benoni, hitting d5 and c4), when White's newly doubled and isolated d-pawns will both drop and his king is still in the center 2 moves from castling! The materialistic shall not prosper in the Benoni.\nAlternative variation: 10. exd6? a6 11. Be2 Nb6\n",
        "10... dxe5": "White is sacrificing a pawn, which Black basically must accept in order to get on with his development. He doesn't have enough space to fool around for too long.\n",
        "11. O-O": "Clever. After 11.fxe5?, Black's ..Nxe5 regains the pawn under favorable circumstances. Now, White gains a dangerous initiative.\n",
        "11... a6 12. Be2 b5": "The typical Benoni queenside counterplay, except without the d5 pawn Black's c5 pawn is particularly weak.\n",
        "13. fxe5": "This is much more acceptable after White has castled. The basic idea is to play 14.Be3, which is not practical so long as Black can play ..exf4 and divert this bishop.\n",
        "13... Nxe5 14. Be3 Nbd7 15. a4": "A provocative choice. After this Black probably has a small edge, but the course is not at all clear. Needless to say, the move a4 is much stronger as a preventive measure against ..b5, not as an attack on the b5 pawn! More appropriate is the maneuver Ng4-e5.\n",
        "15... b4 16. Ne4 Ng4": "This typical , logical Benoni move pressures White along the dark squares and eyes a latent fork on d3 as well as the weak point h2. Most Benoni players would play this move, I am certain. Later analysis suggests another alternative, ..Nxf3, which Black declined (despite such exchanges typically favoring the cramped Black player with a strong queenside majority) due to Bxf3, when the White bishops are quite strong. The whole idea of Black going \"pawn hunting\" (via ..Nxf3 Bxf3 Bxb2) in this position and retaining some advantage is anathema to Benoni philosophy. It reeks of silicon. After ..Nxf3, White gains a tremendous and lasting initiative whilst Black must find several only-moves just to emerge in one piece!\nAlternative variation: 16... Nxf3  17. Bxf3 Bxb2 18. Rb1 Be5 19. Nxc5 a5 20. d6\n",
        "17. Bg5": "Not just retreating, but countering with tempo!\n",
        "17... Qb6 18. a5": "A solid intermezzo. White doesn't need Black playing a future ..a5 and consolidating his queenside pawns. This seems a good opportunity to prevent this with no loss of time. The weakening of the b5 square doesn't seem so serious either (though it plays some role later, as such things often do!).\n",
        "18... Qa7": "Easily best. The g1-h7 diagonal is most threatening.\n",
        "19. Nfd2": "Very strong. White eyes c4 and reveals an attack on the g4 knight. Such multi-purpose moves are the hallmark of great defense.\n",
        "19... c4+ 20. Kh1 c3": "Black's first real mistake. The idea behind ..c3 was to attack with the doomed pawn and extract further benefits (e.g. ripping open the b or c file and activating the g7 bishop). It transpires that Black's compensation for this tempo is not complete if White continues accurately. Black is better off playing with pieces via ..Ne3 (gaining the dark-squared bishop) or the tricky ..Nde5, forcing White to expend time to pick up the c4 pawn (and thereby place a piece on an undesirable square). The issue of how to return \"dead\" material (e.g. something you cannot hold forever) is highly complex and situation-oriented. [If interested in this subject, I recommend studying the Benko gambit, which arises from a Benoni structure where White has 3 playable alternatives - 1) accept the gambit, 2) ignore the gambit, and 3) expend an extra tempo sacrificing the doomed pawn, hoping to push White's pieces offside.]\nAlternative variation: 20... Ne3 21. Bxe3 Qxe3 22. Bxc4 Qd4\n",
        "21. bxc3 bxc3 22. Bxg4 cxd2": "An alternative is 22...f5!?, with complications that seem to favor White, though there is plenty of room for either side to err. Check out the following variation:\nAlternative variation: 22... f5 23. Nc4 fxe4 24. Nd6 Qc5 25. Be6  Kh8 26. Be7 c2\n",
        "23. Bxd7": "A terrific plan. White takes the dull knight with the concrete aim of gaining Black's potent dark-squared bishop. Though this creates an opposite-colored bishop situation, White's passed d-pawn is extremely threatening and all heavy pieces remain on board. The normal\" rules do not apply.\n",
        "23... Bxd7 24. Nf6+ Bxf6 25. Bxf6 Qe3 26. Ra2 Bb5": "Here the Black bishop finally exploits the weakness on b5, with tempo. Unfortunately, it transpires that this square is not worth occupying - the d-pawn is too strong!\n",
        "27. Rg1 Rfe8 28. Qxd2 Qxd2 29. Rxd2 Bd7": "Back again! Now we have reached a positionally won ending for White. Far from being \"draw-ish\", the opposite colored bishops offer White incontestable control of the kingside dark squares! Black's king cannot move, his rooks cannot occupy the queening square d8, and Black's only hope is to blockade on the light square d7.\n",
        "30. h3": "Very practical. White is in no hurry (Black is close to zugzwang already), so he takes a tempo to safeguard his king from back rank threats and also prove a quick avenue for the king to aid in the attack via h7-g3 if Black is especially stubborn.\n",
        "30... Rab8 31. Rc1 Rec8 32. Rxc8+ Rxc8 33. Rb2 Kf8 34. Rb6 Rc1+ 35. Kh2 Bc8": "Black's only defense.\n",
        "36. Kg3": "Here comes the king. Black cannot hope to hold this position once the king invades the e-file, so the \"best\" defense is continuing ..Re1 and stopping the White king (temporarily) from aiding in the attack. Unfortunately, this fails to White's Rb8, forcing the Black rook to defend c8. Rather than a slow but sure demise, Black goes in for one last trick that loses on the spot should White find the right move.\n",
        "36... Ke8": "If Black's king can reach d7, the game will likely draw. However...\nAlternative variation: 36... Re1 37. Kf4 Re2 (37... Ke8 38. Rd6 Kf8) 38. Rb8 Rc2 39. Ke5\n",
        "37. Rd6": "The only move , threatening Rd8#. Now Black has just ..Bd7, dropping the a6 pawn and soon the game. White played a marvelous game, which demonstrates quite well the strength of White's Taimanov attack. Black need not do anything obviously wrong to succumb to White's space advantage, which he handily transforms into a deadly passed pawn. A high class struggle.\n"
    },
    "url": "https://gameknot.com/annotation.pl/amateur-benoni-series-1?gm=6413",
    "gameName": "Amateur Benoni Series #1",
    "players": "bluetiercel (1825) vs. scottyad (1925)",
    "opening": "Nimzo-Indian defence (E20)"
}