{
    "moves": {
        "1. e4": "This game features the somewhat rare 6.Bc4 setup against the Dragon. Black adopts a Najdorf-like setup that Dragadorf fans will be familiar with, and ultimately breaks through with central pressure and a ...Rxc3 combination.",
        "1... c5 2. Nf3 d6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 g6 6. Bc4": "White will meet the Dragon with a simple plan of Bc4, h3, Be3, and 0-0. With both kings tucked away on the kingside, the game takes on a more positional character (but with active piece play). If Black can take control in the center (as theory suggests he can), he can equalize. Therefore Black hopes to play ...d5 at some point.\n",
        "6... Bg7 7. O-O O-O 8. h3 a6": "One of two plans that Black can adopt against White's setup. The first is simply ..Nc6 followed by either ...Rc8/.. Bd7 or the quieter ..b6/..Bb7/..Rc8. That strategy is more in line with typical Dragon play. The text introduces a system more like the Najdorf Sicilian (in fact it looks like the previously examined Dragadorf!), planning a quick ..b5 followed by ..Nd7 and ...Bb7 with eyes on the e4 pawn and a future ...d5 advance.\n",
        "9. Be3": "It is not the right time for this move. It's more common to play 9.Bb3, anticipating Black's next move and preparing either 10.Re1 or 10.a4 with more active play. Depending on how Black continues, White's dark-squared bishop may even find a better home on g5. Such flexibility is better left preserved.\nAlternative variation: 9. Bb3 b5 10. Re1 Bb7 11. a4\n",
        "9... b5 10. Bd3": "Somewhat dubious. Much more common is the retreat 10.Bb3, a better diagonal for the bishop. On d3, the bishop does support e4, but it's scope is severely restricted by that pawn and it also blocks the queen's defense of the d-file which may allow Black a quick ...d5 in the future.\nAlternative variation: [Still, after] 10. Bb3 Bb7 11. Re1 Nbd7 [White wishes his bishop were on g5 instead of e3, as defense to the -pawn is blocked and the awkward 12.f3 is forced.]\n",
        "10... Bb7 11. a3": "Discouraging the threatened ..b5-b4 advance.\n",
        "11... Nbd7 12. Qd2 Nc5": "A very interesting decision. Black attacks the e-pawn with the concrete goal to force the weakening f3. It is worth noting that ...Nc5 is often a dubious idea in these Najdorf-like positions as it blocks off the c-file for the Black heavy pieces and doesn't really threaten anything (e.g. ...Nxd3 isn't exactly inspiring!). More common is ...Ne5, aiming at c4 and keeping the half-open c-file. Still, ...Nc5 looks quite practical given White's forced reply.\nAlternative variation: [ Another path to equality is] 12... Ne5 13. Bh6 Bxh6 14. Qxh6 d5=\nAlternative variation: [ Also worth investigation is the immediate] 12... d5 [which seems premature with the knight on d7 but after a few moves looks about equal, e.g.] 13. exd5 Nxd5 14. Nxd5 Bxd5 15. Rad1 Nb6 [and Black has an extra center pawn and no weaknesses versus White's central pressure.]\n",
        "13. f3 Rc8 14. Bh6": "Certainly this move is the point of White's setup Be3/Qd2, but after 13.f3 the dark squares around White's king look rather vulnerable. It may be wiser for White to develop his rooks before abandoning the central dark squares!\nAlternative variation: [e.g.] 14. Rad1 Qc7 [and now White can continue with the common 15. Bh6 or try his hand on the queenside dark squares via 15.Qf2!?] 15. Qf2 Rfd8 16. Nb3 Nfd7 17. Nxc5 dxc5 [ and Black's initiative and pawn structure should give him better chances.]\n",
        "14... Bxh6 15. Qxh6 e5": "! - A textbook \"Dragadorf\" thrust, exploiting the weakness of the central dark squares as Black no longer fears blocking off the a1-h8 diagonal. This move as the added bonus of opening a direct line to the White king via the g1-h7 diagonal, which Black can exploit via ..Qb6. After the text, Black has a strong initiative.\n",
        "16. Nb3 Nxb3": "Clearing the g1-a7 diagonal with tempo is surely best, but which piece to capture? Black reasons that the b3 knight is more valuable than White's bad d3 bishop, especially as . .Nxd3 allows cxd3 and blunts the thematic ...d5!\n",
        "17. cxb3 d5": "! - Black rips open the center in thematic fashion, activating his b7 bishop and creating strong pressure on e4 and d5. This is especially effective given the laziness of White's rooks and the wayward queen on h6; White's heavy pieces play no role in immediate central affairs.\n",
        "18. Rad1 Qb6+": "Cashing in that tempo!\n",
        "19. Kh1 Rfd8": "Now Black is fully mobilized in the center. Other moves are possible: \nAlternative variation: [The computer invention] 19... Nh5 20. Qg5 f6 21. Qh4 d4 22. Ne2 Qd8 [ also looks fine for Black, who has 2 active minor pieces and a protected passed pawn that ensure a lasting advantage against White's horribly-coordinated army.]\n",
        "20. h4": "Now, White's house falls down. White cannot hope to counter Black's central pressure with an errant wing pawn thrust, especially with his king on h1 and Black roaring through on the long diagonal! If White wanted to attack with the h-pawn, he should have manned up and played the Yugoslav!\nAlternative variation: [ After] 20. Qg5 [it transpires that Black's center is not so stable (hence the 19th move alternative ...Nh5!), as] d4 21. Ne2 Re8 [give Black a better position (his pieces are better placed, and his minor pieces are more active) but absolutely no attack.]\n",
        "20... dxe4 21. Bxe4 Rxd1 22. Rxd1 Rxc3": "! - Black takes on c3 not to shatter White's queenside pawns, but to straighten them out! Actually, this move isn't really a sacrifice, as White cannot keep the exchange after the text continuation. After the ensuing exchanges, Black's active queen and extra passed pawn give him a winning game.\n",
        "23. bxc3": "Alternative variation: [ The stubborn] 23. Bxb7 Rxb3 24. Be4 Nxe4 25. fxe4 Rxb2 [is also hopeless]\n",
        "23... Bxe4 24. fxe4 Nxe4 25. Kh2 Nf2": "The point. White cannot save his rook without allowing ..Ng4 , forking the queen.\n",
        "26. Qd2 Nxd1 27. Qxd1 Qf6": "Black's queen is far too active on the dark squares for the White queen to handle.\n",
        "28. Qg4 Qd6": "From this position, there is no defense. White is helpless to prevent the advance of the e-pawn.\n",
        "29. b4 e4+ 30. Kg1 e3 31. Kf1 Qd2 32. h5 Qf2#": "0-1"
    },
    "url": "https://gameknot.com/annotation.pl/amateur-dragon-series-6?gm=6596",
    "gameName": "Amateur Dragon Series #6",
    "players": "lamacuk (1713) vs. scottyad (1981)",
    "opening": "Sicilian (B70), dragon variation"
}