{
    "moves": {
        "1. e4": "I was White in this game. It shows that having hanging or isolated pawns can actually be an advantage.",
        "1... c5": "The most common response to e4.",
        "2. c3": "The most common continuation for White is Nf3 followed by d4, leading to equally imbalanced positions, but I like the move c3, which usually yeilds White a microscopic advantage.",
        "2... Nf6": "This variation has similar ideas from the Alekhine (e4 Nf6). Black wants to lure my pawns forward and then undermine them.",
        "3. e5": "If you don't want to study this opening, you can simply play 3.d3, and get a King's Indian setup, but why play passive as White?",
        "3... Nd5": "Ne4 loses to d3.",
        "4. d4": "Playing the tempting c4 is totally winning for Black, because then it's hard for my d-pawn to reach d4. I need my pawn on c3 to support d4.",
        "4... cxd4": "Black should take this pawn, because now that my pawn is already on d4, me playing c4 is a real threat.",
        "5. Nf3": "I don't need to take immediately on d4, but you can if you want to avoid the boring 5...d3 variation.",
        "5... e6": "Nc6 is the sharpest move.",
        "6. cxd4 Be7": "A weak move.\nA much better move for Black is d6. Be7 just seems pointless and unsharp.",
        "7. Nc3": "Knights before bishops, since bishops usually have a lot of available developing squares.",
        "7... Nxc3": "If Black moves the knight, then he has trouble after 8.d5.",
        "8. bxc3 d5": "If Black had played d6, then I'd still play my ninth move.",
        "9. exd6 e.p. Qxd6 10. Bd3": "This is a good diagonal for my bishop since it aims toward the kingside for when Black castles kingside. If Black decides to castle queenside, then it's suicide since there are two open files on the queenside.",
        "10... Nc6 11. O-O O-O 12. Qe2": "I didn't like Qc2, because although it's a direct threat, my queen will get harrassed when Black doubles his rooks on the c-file.",
        "12... Bd7": "Black is slightly ahead in development, but I have pawns controlling the centre. Even though my pawns are hanging  in the centre, they aren't weak.",
        "13. Rb1": "Open file.",
        "13... b6": "I thought Qc7 was better.",
        "14. h4": "Since there isn't much else to do, I begin an attack on the kingside.",
        "14... Rfe8": "This seems pointless. Black should be playing more actively with his pieces. My pieces are aimed at the kingside, while Black's are just there.",
        "15. h5": "Gaining more space.",
        "15... f5": "Blocks my bishop's diagonal, but weakens the e-pawn.",
        "16. Re1": "I'm eyeing the weak e-pawn.",
        "16... Bf6": "Adding slight pressure to my hanging pawns.",
        "17. Ne5": "I want to play Bf4.",
        "17... Bxe5": "If Nxe5 dxe5 Bxe5 Qxe5 Qxd3, which wins a pawn for Black, then I think h6 is positionally crushing despite being down a pawn. And I can also gain tempo harassing Black's queen. It's usually okay to sacrifice a small amount of material when your opponent has nothing to do.",
        "18. dxe5 Qe7 19. Qf3": "A more flexible place for my queen.",
        "19... Rac8": "Pressuring my isolated c-pawn.",
        "20. Ba6": "My bishop isn't as strong on d3 since f5 is blocking.",
        "20... Rc7 21. Qg3": "Adding more pressure to the kingside.",
        "21... Nd8": "A positional maneuver to get the knight to f7 to defend.",
        "22. Bg5": "Develops with tempo",
        "22... Qf8 23. Rbd1": "Now all my pieces are fully active, and Black is struggling to defend.",
        "23... Nf7 24. Bc1": "This stops Qa3!",
        "24... Bc8": "Attempting to free space and redevelop to b7 once I decline the trade offer.",
        "25. Bb5 Rd8": "Offering another trade.",
        "26. c4": "I don't care about trading rooks, since it'll let me activate my e-rook, and declining the trade will waste a move.",
        "26... Bb7": "If Black tries to win a pawn with a6?? then I have Ba3!",
        "27. Ba3": "It appears as though I've trapped Black's queen, but he can free up space on the back rank with his next move.",
        "27... Rxd1": "Now if try to take Black's queen, Black wins two rooks and my bishop, which combined, is worth more than his queen.",
        "28. Rxd1 Qa8": "Battery along the long diagonal.",
        "29. Bd6": "This sneaky tactic forces Black to give me a passed pawn, since if Rc8, then I have Bd7 Rxc4 Bxe6 Ra4 h6 g6 Qg5 with dangerous threats on the dark squares.",
        "29... Nxd6 30. exd6": "Although I'm not up any material yet, I think my position is crushing here since I have an advanced passed pawn, and all my pieces are much more active than Black's",
        "30... Rf7 31. Qe5": "Black will lose his e-pawn, as a result of moving his f-pawn in the opening.",
        "31... a6 32. Ba4": "Forced.",
        "32... Qd8": "Blocking the promotion square. And if Black tries to hold his pawn with Rf6, then I have d7 Qd8 Rd6.",
        "33. Qxe6": "In this position, Kf8 is Black's only move, but he will still lose since my d-pawn is on the path to promotion. But Black's cheap mate threat loses immediately, instead of suffering longer.",
        "33... Qg5": "All I have to do is block mate and Black still has no counterplay.",
        "34. g3 Qd8": "Black probably thought he could play Qxh5, but then he loses his queen to Qe8 ",
        "35. Be8": "Black resigned here...... and, yeah...... I didn't really blame him."
    },
    "url": "https://gameknot.com/annotation.pl/american-open-2006?gm=3787",
    "gameName": "American Open 2006",
    "players": "bakerbaker (1791) vs. Cau Duong Le (1925)",
    "opening": "Sicilian (B22), 2.c3, Heidenfeld variation"
}