{
    "moves": {
        "1. e4": "The opening that we played in this game was not particularly noteworthy.. ",
        "1... d6 2. d4 Nf6 3. Nc3 d5 4. e5 Ne4 5. Bd3 Nxc3 6. bxc3 Nc6": "White's line is perhaps cluttered with the two pawns on the c file, but otherwise the position is roughly equal. ",
        "7. Nf3 Bg4 8. h3 Bh5": "I was attempting to draw out white's king side pawns to disrupt his inevitable king side castle. ",
        "9. O-O": "Wisely done",
        "9... a6 10. Be3 Qd7": "With white's best developed pieces on the king side, I calculated that setting up a queen side castle would be the prudent choice. ",
        "11. c4": "Bring pressure to bear on the center... a good move. ",
        "11... dxc4 12. Bxc4 e6 13. Be2": "Be2 is the first mistake white makes. He has all that pressure lined up against that part of the board. A better move would be Bb3, then moving the queen up to the second file and sliding the rook behind it.. Or Bb3... then c4. ",
        "13... O-O-O 14. c3 f6": "At this point, I recognized that the best weapon white has is his pawns.. those need to be rolled back. ",
        "15. Nd2": "This is the 2nd important mistake made by white.. the knight protects the e5 pawn.. without it black losses material. Perhaps white was looking to move Nc4.. to re-position the piece so that it could attack my king side.  ",
        "15... Bxe2 16. Qxe2 fxe5 17. dxe5 Nxe5 18. Rfd1": "White starts to play more aggressively and puts into play a good center combination. Despite being down in material white's pieces are better developed.  ",
        "18... Qf7 19. Bg5": "This looks good.. white forces Rd5 here.. ",
        "19... Rd5 20. Ne4": "This is a slip up here, c4 is a much better move. Ne4 gives black a quick opportunity to trade away the exposed rook and make his line easier to defend. Ne4 temporarily protects blacks knight from his queen. ",
        "20... Rxd1+ 21. Rxd1 Be7": "Offering the exchange and finally freeing up the back rank. ",
        "22. Rd4": "This move I'm not sure about.. I don't see how white garner's any advantage from moving his rook out. White's queen needs to take a more offensive role, the only thing it's doing is protecting the knight when there is no piece on the board that can threaten it. I think Qe3 is a better move because it protects the bishop and at least threatens Qa7. ",
        "22... Bxg5 23. Nxg5 Qf6 24. Re4": "This is the misstep which costs white the game. Ne4 would have been better.. that threatens the queen and white needs to get his knight to the other side of the board.. as it that spot where his attack needs to go. White I suspect thought that he could win back the pawn.. Qxg5.. Rxe5.. forcing the queen to retreat and then equalizing material with Rxe6. What he didn't see however is c3 is exposed and the consequences of a highly mobile queen. ",
        "24... Qxg5 25. Rxe5 Qc1+ 26. Kh2": "White doesn't want to let go of the choke hold he has on the e6 pawn.. ",
        "26... Qxc3 27. Rxe6 Rd8 28. Re8": "Baiting Rxe8.. which leads to checkmate. ",
        "28... Qd4": "This protects the rook.. but MORE importantly sets up Qf4+",
        "29. Qe6+ Kb8 30. Re7": "White tries to equalize material without seeing the impending threat. ",
        "30... Qf4+ 31. g3": "moving the king to the back rank losses white's queen immediately. .. but the damage has already been done. ",
        "31... Qxf2+ 32. Kh1 Rd1+ 33. Qe1 Rxe1+ 34. Rxe1 Qxe1+": "White resigns on the next move. \n\nThe compelling question here is how could white have averted this attack? He needs to stop Qf4+.. Perhaps with the king.. although I would argue that all white needed to do was keep the queen on 2nd rank and move from there to attack black's exposed h and g pawns. \n\nLike to my opponent for the game.. it was a spirited contest. ",
        "35. Kg2 c5": ""
    },
    "url": "https://gameknot.com/annotation.pl/an-exciting-endgame?gm=39829",
    "gameName": "An exciting endgame",
    "players": "  vs. big_red (1503)",
    "opening": "Pirc defence (B07)"
}