{
    "moves": {
        "1. d4": "Hi everyone!\r\n\r\nRight now, I Jo Stevens, am sitting in Coach Ion's Classroom on a stool near his desk, with my back to the class with the Dunce's Cap on.  The reason for this is because I had to go pawn grabbing again - didn't I?  I really should have learned from this game with Freddy, the Headmaster - OMG, if he sees me in the corner, I had better think of hiding a few regicide manuals under my gym pants and trousers lest I get summoned to his study!, that game is: http://gameknot.com/annotation.pl/the-sodium-attack?gm=28475 in which I was punished in full for my \"greed\" although one must note that in both cases I lost or was about to lose a pawn and I thought I would regain the pawn, unfortunately I did but at a price.  One has to say, however, that the motif Ion used was similar but a little different.  Ahh well, here goes.  This is the King's Indian Thematic Tournament organised by fatcat, a member of the Master Mater's Coaching Club.  I will comment again on move 5 because although that is part of the MT setup that f4 move deserves some comment .....",
        "1... Nf6 2. c4 g6 3. Nc3 Bg7 4. e4 d6 5. f4": "5. f4 - this move has advantages and disadvantages.  It's strengths are twofold.  This pawn controls e5 and g5 and is also used to break up a fianchettoed position.  This pawn moves early on in the opening in The Bird's Opening, The Pirc Defense - Austrian Attack, The Robatsch Defense and the Sicilian Dragon/Naijdorf as well as the King's Indian 4 pawn attack.  Ok. White has an impressive pawn centre, but it can be punctured.  The drawback of the f pawn moving, however, is that it opens up the Fool's Mate Diagonal - e1-h4.  Here is how a 1650+ player came a cropper against The Dentist on that diagonal:-  http://gameknot.com/annotation.pl/fools-paradise?gm=15408.  That diagonal can be exploited in the opening.  Another diagonal that black can take advantage of is the g1-b8 diagonal after white has castled short by means of his queen or dark squared bishop.  In this case I do castle short and Ion does take advantage of this with his dsb as you will see.",
        "5... O-O 6. Nf3": "6. Nf3 - the first non-forced MT move - to develop a piece and support that pawn phalanx.",
        "6... c5 7. d5": "7. d5 - trying to create a cramp on Ion.",
        "7... e6 8. Be2 exd5 9. cxd5": "9. cxd5 - pawn trade.",
        "9... Bg4 10. O-O": "10. 0-0 - I castle long, there is another advantage about moving the f2 pawn up two squares and that is that the knight on f3 is protected by my king rook so my castled position will not be broken up should Fou Leblanc and Glenda decide to move off the d1 - h5 diagonal.",
        "10... Nbd7 11. Re1 Ne8 12. a4": "12. a4 - a recommeded move holding up a pawn roll on the queenside.  Trouble is my pawn is weak on that square and it will drop off later on.",
        "12... a6 13. Ng5 Bxe2 14. Rxe2": "14. Rxe2 - I decided to recapture with the rook.  It does have its merits in a sense that it prepares a doubling on that file but in my case it did critically weaken my back row.",
        "14... Nc7 15. e5": "15. e5 - a speculative pawn sac for aggressive play.",
        "15... dxe5 16. d6 Ne6 17. Nxe6 fxe6": "17. ....... fxe6 - knight trade - now, just observe summat, that e6 pawn, displaced from f7 opens up the f file for the black rook.  If that happens, beware, Ion now has a target, which will be apparent four moves down the line.",
        "18. Qb3 exf4 19. Qxe6+": "19. Qxe6+ - I choose an aggressive line from the database which involves an incursion right into the heart of Ion's camp with GLENDA of all pieces!  The snag is, she could become a target and could get herself trapped if she is not careful.",
        "19... Kh8 20. Nd5 Nb6 21. Nxf4": "21. Nxf4?? - here it is, here it is, this move should be given the skull and crossbones, Ion only gave it one question mark - he is being benevolent - I give it the kitchen sink.  Ion recommended in a post-match pm that I should have moved that steed to e7, really bottling him up.  If that knight gets pinned then it will be protected by the advanced pawn on d6.",
        "21... Bd4+": "21. ...... Bd4!! - here is the punishment!  Note I talked about that g1-a7 diagonal earlier on, where black can land an annoying check on a king that has castled on that side.  Here is the check.  Now how do we get out of check.  There are only two options here, block or move Henry.  1. Blocking with Rf2 drops at least the exchange and walks Henry into a pin after the resulting Bxf2+.  Option 2, Kf1 walks Henry straight into a pin on the f column.  Option 3, well, no obvious pin, but look - the knight will be pinned because Old Matey just lurves those back rows and I will certainly cop it if I move my knight after Ion pushes his pawn to g5.  Nh3 will not help as the g2 square is doubly attacked by the dsb and the rook when it lands on f1 to give check, so Rxg1 will be mate, sss-shh-ugar!",
        "22. Kh1 g5": "22. ........ g5 - natch!",
        "23. Be3": "23. Be3 - out comes Fou Lenoir, to develop and to strengthen that weak back row.",
        "23... Bxe3 24. Ng6+": "24. Ng6+ - I try and get some semblance of an attack going by opening up lines to Ion's king - sadly, the Wicked Witch of the West will ensure that Glenda cannot take full advantage of his denuded king.",
        "24... hxg6 25. Rxe3": "25. Rxe3 - glad to be rid of Ion's troublesome dsb, at least Henry can now move back to g8.  I try attacking first though.",
        "25... Qf6 26. Rh3+": "26. Rh3+ - would it have been better if Glenda had gone to that square and not the rook?  You the Inquest Jury decide!",
        "26... Kg7 27. Qxf6+": "27. Qxf6+ (virtually forced).",
        "27... Rxf6 28. Re3 Rd8 29. Re7+": "29. Re7+ - I manage to get a rook on Ion's second rank, normally a bone in the throat is a good thing, but it achieves nowt here.",
        "29... Kh6 30. Rxb7": "30. Rxb7 - I split up Ion's queenside pawns but that is all the damage my rook is able to do.  Ion does much more damage though.",
        "30... Rfxd6": "30. ..... Rfxd6 - my lovely passer drops off (tears!)",
        "31. h3": "31.  h3 - I would love to send my remaining rook up the board to join his colleague on the 7th rank.  Trouble is, that bally back row is the bane of my life in this game.  First I must either, a. Move Henry or b. Move a pawn in front of Henry.  Neither of these two necessary options contribute to me counter-attacking Ion on the 7th rank.  Look at Ion's king - now all I need is a second rook on that 7th rank and it will be Ion staring Old Matey in the face.  Before that can happen though .....",
        "31... Rd6d1+": "31. ..... Rd1+ - Ion can get in that vital tempo which can put a spoke in the wheel.  I am now forced to exchange one of my rooks.",
        "32. Rxd1 Rxd1+ 33. Kh2": "33. Kh2 - Henry tucks himself away on h2 but now that pesky extra knight of Ion's is gonna make himself felt - by swiping my a4 pawn - more tears!",
        "33... Nxa4 34. Ra7 Rd6 35. b3": "35. b3 - this pawn takes evasive action but alas, he is not long for this world either.",
        "35... Nb2 36. Rc7 Nd3 37. Rb7": "37. Rb7 - some meaningless rook play before Ion lands the coup de grace.  Ion and I agreed after the game that if only I had Glenda or the rook + Fou Lenoir, again Ion's king would have been in danger of Copping dear Old Matey!",
        "37... Rc6 38. Rb8 Nb4 39. Re8": "39. Re8 - all so funereal, Ion is about to administer the last rites.",
        "39... Rb6 40. Rc8 Nd3": "40. ...... Nd3 and goodnight from me, as I will be a knight and two pawns down (equivalent to a whole rook) and Ion has those lurvely black passers on the queenside to boot I feel it is time to draw the line, so I wave the white flag.   Ah now, time for some prep - better have a go at doing some puzzles for Coach Ion.  So, what lessons have you learned from this game?  Anyhow, hope you have had a good read - bye for now - Joanne"
    },
    "url": "https://gameknot.com/annotation.pl/an-expert-lesson-in-pin-back-row-motifs?gm=29140",
    "gameName": "An Expert Lesson in Pin/Back Row Motifs",
    "players": "jstevens1 (1789) vs. ionadowman (2099)",
    "opening": "King's Indian (E76), Four pawns attack, dynamic line"
}