{
    "moves": {
        "1. e4 c5 2. Nf3 e6 3. d4 cxd4 4. Nxd4 a6": "4. ....... a6 - this is the Kan Variation of the Sicilian Defense and it is very similar to the Naidjorf - black will try and put pressure on white down the c file by putting heavy pieces on it, starting with 5. ......... Qc7.",
        "5. Bd3 Qc7 6. O-O Nf6 7. Qe2 d6 8. c4": "8. c4 - after developing my kingside pieces quickly I decided to take the database option which suggests countering in the centre and controlling the squares d5 and b5.",
        "8... Be7 9. Nc3 Nbd7 10. f4 b6 11. Bd2": "12. Bd2 - natural, but one must be careful, two bishops lined up on one file could lead to skewer combos later on.",
        "11... O-O 12. Rae1 Bb7 13. Kh1": "13. Kh1 - avoids pin on g1 - a7 diagonal but unfortunately walks into a pin from the lsb on b7.",
        "13... Qc5 14. Nf3 Rac8": "14. ........... Rac8 - with this move, Marin takes me out of the database.  Here is where I get stumped - where do I go from here?  I look back at some of the illustrative games in the World Database and find that the move e5 was played to exchange the central pawns - white drew that game so I thought it was a reasonable plan here.  Maybe a better idea would have been to have played either Bc2 or b3 here, at least the former would have avoided what is to come.  I now have a tip for all beginners and intermediate players here - when you come to the end of the database do check to see what is covering what and then decide on what piece to move in order to improve your position, especially for overloads like this one, otherwise you will worsen it.",
        "15. e5 dxe5 16. Nxe5": "16. Nxe5? - This was the losing move.  Marin stated in a pm in response to my resignation note that I should have taken with the f pawn.  I did consider it but it would have left the f pawn an isolani so I thought that it was better to keep my pawn structure together.  Unfortunately, after Marin's next move, the irony is, that pawn is to fall anyway together with a whole lot more.",
        "16... Rfd8 17. b3": "17. b3 - to back up the c4 pawn, but a few moves too late, alas.",
        "17... Qd6": "17. ............ Qd6!! - the killer move, I will drop at least a pawn here.  On my next move (18. Rd1) I go for the line which loses the pawn, any other plausible replies such as Nxd7 lose one of the bishops to the pile up on the d file - this is a skewer.  Do note that Glenda is defending both e5 and Frere Leblanc   Frere Lenoir, Glenda the Defender is extremely put upon here!  Another plausible try is Ne4 attacking the Wicked Witch of the West but Bxe4 ensures that a piece drops on d3.",
        "18. Red1 Nxe5 19. fxe5": "Here I wave the white flag because I will initially lose a pawn and then a piece with the following analysis:-\r\n19. fxe5 Qxd3 \r\n20. Qxd3 Rxd3 \r\n21. exf6 Bxf6 \r\n22. Nb1 Rcd8 \r\n23. Rf2 Bg5 \r\n24. h3 e5  (this pawn will eventually gobble up Frere Lenoir).  Henry cannot come over to help defend Frere Lenoir because the enemy dsb will pin my rook to Henry).  With the rating differential I felt that resignation on the grounds of ruinous loss of material was justified here.\r\n"
    },
    "url": "https://gameknot.com/annotation.pl/an-expert-lesson-in-piece-overload?gm=19222",
    "gameName": "An Expert Lesson in Piece Overload",
    "players": "jstevens1 (1723) vs. marinvukusic (2125)",
    "opening": "Sicilian (B42), Kan, 5.Bd3"
}