{
    "moves": {
        "1. Nf3": "I'm going to explain the winning method of a simple position that arises from a complicated endgame. Most players know that you can't checkmate a lone king with 2 knights, but not so many players know that you can often mate with 2 knights when the losing side still has a few pawns left.\r\nI do not know how to start an annotation with an endgame position, so please ignore the first part of the game, which is just clearing off the material.",
        "1... e5 2. Nxe5 Qh4 3. Nxd7 Qxh2 4. Nxf8 Qxh1 5. Nxh7 Qxg2 6. Bxg2 Rxh7 7. Bxb7 Bf5 8. Bxa8 Bxc2 9. Qxc2 g5 10. Qxc7 g4 11. Qxa7 g3 12. Qxf7+ Rxf7 13. d4 gxf2+ 14. Kd2 f1=R 15. Kc3 Rxc1+ 16. Kb4 Rxb1 17. Kc5 Rxa1 18. Kd6 Rd1 19. Bd5 Kd8 20. Ke6 Kc7 21. a4 Rf2 22. a5 Rxe2+ 23. Kf7 Ne7 24. a6 Nec6 25. Bb3 Rxb2 26. Bxd1 Na7 27. Ke8 Kd6 28. Bb3 Rxb3 29. d5 Rb6 30. Kd8 Rc6 31. dxc6 Nbxc6+ 32. Ke8 Nb8 33. Kd8 Nd7 34. Ke8 Ke6": "Opposition is most important in knight and pawn endgames, since pawns, knights, and kings do not always have a spare move for zugswang situations, while long-range pieces can easily waste moves.\r\nIn this position, Black has the opposition. White would rather pass than move here because Black will make progress in cornering White's king. If it was Black's turn to move here, then the winning process would take a lot longer. ",
        "35. Kd8": "White is forced to head closer to the corner.\r\n2 knights vs. a pawn is usually a winning endgame if the pawn is blockaded and sufficiently far from promotion. In my experience, this type of endgame occcurs when there are few pawns left compared to the number of pieces, the losing side might sacrifice for the few pawns you have, and hope for a draw in a position like this. 2 knights usually win against more than 1 pawn if the winning side can pick off the pawns and convert to a winning 2 knights vs. pawn endgame. Rook-pawn tends to be the most common version of this endgame, since most endgames with very few pawns take place on a flank, and rook-pawn is also the easiest since the blockading knight is already close to where the king will be cornered.",
        "35... Nf6": "Black's goal here is to force White into either the a8 or a1 corner, the blockading knight will be close enough to deliver checkmate in either corner. Black will use his king and knight to force the enemy king to one of those corners, while the blockading knight restricts a few squares and you will only have to move it for the final mating maneuver. You must also be prepared to sacrifice the blockading knight in certain positions where you can use your only remaining knight to smother the enemy king behind his pawn",
        "36. Kc7 Ke7": "Mate would be impossible here (and in other endgames) if it was legal to pass a turn in chess, but since it isn't, White is forced to let Black restrict more squares. After White attacks the knight, Black will oppose White's king two horizontal squares away, and if Kxa7 then Kc7 Ka8 Nd5!! Ka7 (if a7 then Nb6#) Ne7 Ka8 Nc8 zugswang and White must let himself get mated a7 Nb6#",
        "37. Kb7": "37.Kb8 is worse since after 37...Kd8 38.Kb7, Black can seal off his escape route with 38...Nd7 while maintaining the sacrifice tactic. If 39.Kxa7, then 39...Kc8!! wins, not 39...Kc7?? because the knight is in a different spot and doesn't have the right tempos to mate. 39...Kc8 wastes a move so that White is forced to play 40.Ka8, then 41...Nb6  Ka7 Nc4 Ka8 Kc7 Ka7 (a7 Nb6#) Nd6 Ka8 Nc8 a7 Nb6# If White plays Ka8 on move 38 instead of 38.Kb7, then 38...Kc8 forces Kxa7 and Kc7 just transposes to the variation discussed last move",
        "37... Kd7 38. Kb6": "If Kb8 then Kc6 Ka8 Kb6 Kb8 Nd7  Ka8 Nb5 followed by Nc7# after White smothers himself.",
        "38... Kd6": "Now White should flee toward the a1-corner. If Kb7 then Nd7 seals off White and is similar to the variations discussed last.",
        "39. Ka5 Kc5 40. Ka4 Kc4": "When the enemy king is on the edge like this, opposition is the key to forcing him back. You usually have to chase him with your king for a few moves until he's in a position where a knight can stop him from fleeing.",
        "41. Ka3": "If Ka5 then Nd7 just seals off the escape route forcing White to the same square, so Black would gain 2 tempi since the knight needs to go to d7 anyway",
        "41... Kc3 42. Ka2": "This part requires a lot of restriction technique, because Black doesn't know which way White will flee. White doesn't have an escape path after Ka4 Nd5, so it's logical that White would play Ka2 and try to escape the other way. In a few moves I will explain the winning ideas if White's king decides to hover around a4 and a5.",
        "42... Kc2": "Black's king has effectively stopped White from escaping toward the center, so Black can now get in Nd5, which seals off the king's escape route so that Black has time to figure out how to continue from here.",
        "43. Ka3": "Definitely not Ka1, because Black's whole plan is to get White's king into a corner. Willingly placing the king in the corner will lose quickly after Nd5 Ka2 Nb5!! imprisoning White onto a1 and a2, then Black will complete the mating maneuver with Nb4 Nd4 Nb3# and the mate will occur the same move White's pawn promotes so the new queen cannot do any damage.",
        "43... Nd5 44. Ka4": "Ka2 Nb5 transposes into the mating variation discussed last",
        "44... Kc3": "This position is exactly the same as if Ka4 Nd5 had been played on move 42, White just made Black work a little by attempting to escape via b1. White will probably repeatedly play Ka4-Ka5 since after Ka3, Black makes progress with Nb6 Ka2 Nc4",
        "45. Ka5 Kc4": "The d5-knight is the only thing stopping White from escaping via b6, so the only time Black can move it is when White's king is on a4. Black needs to plan to get the d5-knight to b5, which creates a barrier (c6-c7-c8) and Black uses simple king maneuvers to force White's king to the a8 corner. White could avoid that barrier by heading toward the a1 corner, which is the longest he can survive.",
        "46. Ka4": "Now Black can move the knight, but Black shouldn't rush the Nd5-b5 plan, because the knight also needs to be in a position to keep the king cornered if it decides to escape toward b2. Black should think ahead of the king reaching a2, if Black's king was on c3 and knight on c4, then it would reach the final mating barrier of the a1 corner.",
        "46... Nb6+": "This move doesn't bring the knight any closer to reaching b5, but it restricts a4, so now if Ka3, Kc3 Ka2 Nc4 Kb1 Kd2 is the key mating position in the a1 corner explained at the end.",
        "47. Ka5": "The knight needs to reach a square that threatens to go to b5, while also preparing for White to try to escape toward b2, in which case the knight needs to be controlling a3 for the final mating barrier. Control of a3 can be reached from c4 and b5, so the key square for Black's knight is d6, which is accessible from c8.",
        "47... Nbc8 48. Ka4 Nd6": "Now if Ka5, Ndb5 Ka4 Kc3 Ka5 Kb6 Kb4 Kb7 Kc5 and White's king is restricted to a8 and b8. Once Black's king reaches Kb6, Black has two ways of mating depending on whether White's king is on a8 or b8.\r\nIf the king is on a8, then Kc7 Kxa7 Nb5  Ka8 Kc8 a7 Nc7#\r\nIf the king is on b8, then Ndb5 Ka8 Nc6 a7 Nc7",
        "49. Ka3 Kc3": "Now that Black's knight has reached the key square d6, it can control a3 from b5 or c4 depending on where White flees. If Ka4 then Ndb5 forces White into the mating barrier on a8 explained last move.",
        "50. Ka2 Nc4": "Mating in this corner takes more work since the blockading knight is further away. Once White is restricted to two squares, Black needs 4 knight moves to complete the mate. The blockading knight needs 2 moves to get to a square stalemating White's king, and the other knight needs 2 moves to deliver checkmate. The only problem is that White's pawn will only need 2 moves to promote if the blockading knight moves, so one of the 4 knight moves needs to be a check, so that mate will occur the same move the pawn promotes.",
        "51. Kb1": "If Ka1 then Kc2 Ka2 and Black can make the 4 knight moves needed for mate: (Nb5 Nc3 Nd2 Nb3) and one of those moves will have to be a check so the new queen won't have time to interfere, or if White avoids the check, the pawn still won't have enough time to promote.",
        "51... Kd2": "Ka1 Kc2 goes into the position discussed last move.",
        "52. Ka2 Kc2 53. Ka1": "The difference in this position and the mating sequence explained a couple moves ago, is that White's king is already in the corner, so Black cannot make the 4 knight moves needed to mate and have a check in-between, so the new queen has time to interfere.",
        "53... Kb3": "Black would've wanted it to be White's turn, so that the mating sequence would include a check, but in endgames where one side has control and the other is fighting for a draw, the stronger side can use lots of zugswang and waste-a-move tactics to make progress, such as in the knight-bishop checkmate, which is a simpler ending than this, since bishops can waste moves. Knights cannot waste moves, so it's up to Black's king to force White onto a square where the mating sequence can occur. Kings can waste moves if they only need to control a couple of squares, which has been demonstrated throughout this entire endgame.",
        "54. Kb1 Nb2": "Black can keep White cornered, while figuring a way to waste a move so that White will end up on a checkable square once he is restricted to 2 squares. Black can change the mating barrier to restriction of the c1 square by the knight, while wasting a move so that White's king ends up on b1 once the barrier is finished. Here if Ka1, then Nd3 Kb1 and White's king is on a checkable square for the mating maneuver.",
        "55. Kc1 Kc3 56. Kb1": "The difference in this position and the position after 51.Kb1, is that Black's knight gets a free move. You must understand tempo and opposition well to understand endgames, especially knight and pawn endgames. When Black wasted a move, the tempo of the game changed, so now Black can transpose into any of the previous variations with an extra move, so now when the barrier is complete, White will end up on a checkable square instead of the corner.",
        "56... Nd3": "Black wants the position after 57.Ka1 Kb3 58.Kb1 so that White's king is on a checkable square, and now Black can force White onto a checkable square (either b1 or a2) depending on how White continues.",
        "57. Ka2 Kb4 58. Kb1": "If Ka1 then Kb3 Kb1 is the final mating net.",
        "58... Kb3": "Compared to the position after move 54, Black's knight has gotten a free move, so now the positions after Black's move waste are 1-move different than previous positions, but still the same player to move, which is exactly what Black was aiming for.",
        "59. Ka1 Kc2": "White's king is forced onto a checkable square, so now mate can occur and Black has succeeded in winning this very complicated endgame.",
        "60. Ka2 Nb5": "The first knight move restricts any escape, and now Black only needs 3 more knight maneuvers. The knight on d3 needs to control a2, stalemating White's king, while the other knight moves twice to control a1. White's pawn won't promote in time because White needs 4 moves, one king move for when he gets cornered on a1, two pawn moves to promote, and one queen move to interfere, is one move too many",
        "61. a7 Nc1+ 62. Ka1 Nd4": "Even if this ending doesn't occur commonly in your games, I hope the concepts demonstrated will help you in other endgames. There are also more complicated versions of this endgame where White's king is centralized I may do a future annotation on.",
        "63. a8=Q Ndb3#": "Such a spectacular mate, all the work has paid off."
    },
    "url": "https://gameknot.com/annotation.pl/an-endgame-worth-knowing?gm=10293",
    "gameName": "an endgame worth knowing",
    "players": "pawn (1) vs. two knights (6)",
    "opening": "Reti opening (A04)"
}