{
    "moves": {
        "1. e4": "Hi everyone!\r\n\r\nHere is another aspect of my game that I need to improve upon as well as mounting successful mating attacks and spotting those decoys!  It is called Spot the Sacrifice.  I have come across quite a few sacrifices including queen sacrifices when doing the daily puzzles but again I need to develop it in a real game.  In this game I failed to spot an exchange sacrifice and paid the price!  In response to 1. e4 black plays e6 which is the French Defense.",
        "1... e6 2. d4 d5 3. exd5 exd5": "3. ...... exd5 - this pawn trade characterises the Exchange Variation of the French Defense.  It does have the potential to be drawish but it is not always the case.  I thought I would get some nice open free play here.  Well, I do, but only up to a point.",
        "4. Nf3 Nc6 5. Bb5 Bd6": "5. ..... Bd6 - a good square for the bishop, both sides have developed pieces and now things start to get a little interesting .....",
        "6. c4 dxc4 7. d5": "7. d5 - an attack on the pinned knight on c6 but black can get out of it.",
        "7... a6": "7. ....... a6 - like this.",
        "8. Bxc4": "8. Bxc4 - I now regain my pawn and black takes me out of the database with a queen check along the e column.",
        "8... Qe7+ 9. Qe2 Qxe2+ 10. Kxe2": "10. Kxe2.  I decided to recapture with Henry because I thought about clearing the way for my KR to come to d1 to defend the advanced d5 pawn.",
        "10... Na5 11. Bd3": "11. Bd3 - Fou Leblanc evades capture by the knight on a5.  This is a good diagonal and I would like him to stay on it but I am worried about the d5 pawn.  Later on it's gonna be the least of my worries!",
        "11... Nf6 12. Nc3": "12. Nc3 - hmm, in retrospect maybe instead of following the knights before bishops mantra it would have been better to have played Be3 followed by Nd2 and then my rooks would have a clear communication on the back row, and Henry would have been shielded on e2.  Do you the Inquest Jury agree?",
        "12... O-O 13. Rd1 Re8+ 14. Kf1": "14. Kf1.  I did consider Be3 but then I was worried about Ng5 piling up on the pinned prelate.",
        "14... Bg4 15. Be2": "15. Be2 - to break the pin, but alas one step in the wrong direction for yours truly.",
        "15... b5 16. h3 Bd7": "16. ....... Bd7.  This bishop looks innocuous on this square.  This is a perfect camouflage for black's future intent though.",
        "17. Bg5 b4 18. Bxf6 gxf6": "18. ...... gxf6 - again I cannot resist to sac B for N in order to do a pawn-busting exercise.  Alas, I must now retreat my knight to b1.  If you look at my above note at move 12 I could have avoided having to do this.",
        "19. Nb1 Nb7 20. Nbd2": "20. Nbd2?? - this is the loser.  I did not see the sacrifice coming until it hit me ..... here it comes ......",
        "20... Rxe2": "20. ....... Rxe2!! - ...... here it is!  A real crusher.  Now I must take the rook but that innocuous looking lsb on d7 is gonna deliver a crushing check on b5.",
        "21. Kxe2 Bb5+ 22. Ke1 Re8+": "22. ..... Re8+ - another crusher - the only legal move is Ne4 which also gives Henry a flight square.  Black has two pieces for the rook but that is just for starties!  The main course is still to come.",
        "23. Ne4 Rxe4+ 24. Kd2 Re2+": "24. ..... Re2+ - nasty, nasty, this is a real bone in the throat.  Not only can that rook decimate my kingside pawns but a mating net is being woven around Henry.",
        "25. Kc1 Bf4+": "25. ..... Bf4+ - yup, no peace for Henry.",
        "26. Nd2 Rxf2": "26. ..... Rxf2 - the piggish rook gorges my kingside pawns with impunity.",
        "27. Kc2": "27. Kc2 - making room for my rooks to move but Nc5 is a death knell because I must now play b3 to give Henry a flight square on b2.  My rook on a1 will fall to a skewer (Be5) next move and so I decided to wave the white flag.  Well played Chris!",
        "27... Nc5": ""
    },
    "url": "https://gameknot.com/annotation.pl/an-expert-lesson-in-sacrifices?gm=29976",
    "gameName": "An Expert Lesson in Sacrifices",
    "players": "jstevens1 (1773) vs. emtogsdia (2002)",
    "opening": "French (C01), exchange, Svenonius variation"
}