{
    "moves": {
        "1. e4": "Hi everyone!\r\n\r\nI played through an unrated game with my mentor, Ionadowman and lost.  Here I was trying out the Vienna against him as this was an old opening and one which I thought I could try out on someone else if it worked out.  Maybe the choice of opening was OK but it was perhaps some injudicious piece placement in the middle game that cost me this game.",
        "1... e5 2. Nc3": "2. Nc3 - The Vienna Game - this move was popular with Austrians in the 18th/19th century - not played very often nowadays.",
        "2... Nf6 3. f4": "3. f4 - the main line of the Vienna.",
        "3... d5 4. fxe5 Nxe4 5. Nf3 Be7 6. d4": "6. d4 - deviating from the main line a little but this move used to be popular years ago.  It does have a drawback in that white's queenside pawn structure is about to be busted by a knight exchange on c3.",
        "6... Bf5 7. Bd3 O-O 8. Qe2": "8. Qe2?! - this seemed a reasonable choice from the database.  However, thinking back it was time to break free from it.  8. Bd2 may well have been better as it would have avoided the bust up of the queenside pawns.  \r\n\r\nIon did have this to say in the Chat, however - \"I don't think there's anything wrong with the 6.d4 line. I think you have to count on Black exchanging at c3 - he doesn't particularly want to, but it's the best he's got probably. The pawn formation you get isn't really bad at all. It has its weaknesses (the isolated rook pawn, the doubled c-pawn), but it has its upaide as well. The pawns are \"doubled towards the centre\", your centre is very strong on the dark squares, and the e-pawn (in this game) remains mobile and hard to blockade effectively .\"\r\n\r\nYes, this choice may not have been fatal, and it did have it's merits, but it does not pay to make your task harder - this is the one case where following the database (I used the World Database here) is not always a good thing.\r\n\r\nSo when playing an Expert 350 points north of your rating - keep it simple!",
        "8... Nxc3 9. bxc3": "9. bxc3 - so here is the busted pawn structure.",
        "9... Bg4 10. Qf2 c5 11. O-O c4 12. Be2": "12. Be2 - Frere Leblanc dodges the pawn attack on c4 and adds support to my queen knight.  I think I have developed reasonably up to here but I now start to go wrong.  I play 13. a4 to give my queen rook more scope as I felt he would be tied to defending the a pawn.  In retrospect I think again that 13. Bd2 was the better move.",
        "12... Nc6 13. a4 Qa5": "13. ............... Qa5! - Strong move, threatening pawn on c3 and tying my pieces down to defend it.",
        "14. Bb2": "14. Bb2?! - Maybe Be2 was better here, as it could become a target, although Ion did have this to say in his post-match analysis.\r\n\r\n\"I formed the impression that early on your responded maybe too defensively to a number of casual shortrange threats - such as 14.Bb2. But that move wasn't fatal: in fact there were some lines in which you might have played Ba3, forcing the DSBs off, or maybe attacking the f8-rook. \"",
        "14... Bf5 15. Ne1": "15. Ne1?! - Ion had this to say about this move.\r\n\r\n\"But 15.Ne1 was definitely a surprise. I thought I had the better of it after that. I had anticipated something like 15.Nh4 Bxc2 with this possible continuation: 16.Nf5 Bxf5 17.Qxf5 Nxd4! 18.cxd4 Qd2 with a fork against both your bishops. Probably you would get one pawn back, but you would probably have had to rely on a more active game for at least partial compensation for the other pawn deficit. \r\n\r\nEven after 15.Ne1, though, I don't think you were out of it until 18.Qe2. That really was a mistake, though an understandable one. The only other move was 18.Qg3 (Rxf1  19.Kxf1 Rf8  20.Ke2 after which I was still tossing up whether to bring the Q back to d8 (preparing ...Bh4) or the N (preparing ...Ne6). Had your K dived back into the corner (20.Kg1) then it was definitely going to be the Q-move (20...Qd8).\"\r\n",
        "15... Be4 16. Bf3": "16. Bf3 - I decide to exchange bishops to get rid of the threat on the hind c pawn but with Ion's next move I risk opening the f file and will have really nasty consquences if I don't watch out!",
        "16... f5 17. Bxe4 fxe4 18. Qe2": "18. Qe2?? - see my note to move 15.  I did, however, expect the following:-\r\n\r\n18. Qe2 Rxf1  \r\n19. Kxf1 Rf8  \r\n20. Kg1 Bh4 \r\n21. g3 Bg5 \r\n22. Ba3 Rf7 \r\n23. Qg4 Bd2 \r\n24. Qc8  Nd8 \r\n25. Bb4 Qb6 \r\n26. a5 Qa6 \r\n27. Qxd8  Rf8 \r\n28. Qxf8#",
        "18... Rxf1+ 19. Kxf1 Rf8+ 20. Kg1 Nxe5": "20. ................ Nxe5!!! - a stunning sacrifice, taking back will open up the a7-g1 diagonal spelling danger for Henry!",
        "21. dxe5 Qb6+": "21. ...................... Qb6  - strong move but I think Ion had a stronger move in Bc5  followed by the deadening Rf2 forcing Glenda to give up her life to try and save her other half.  A possible get out clause was mentioned in the post match analysis which I will reveal next turn.",
        "22. Kh1 Rf2": "22. ................... Rf2.  After this move I throw in the sponge thinking that I must give up Glenda to save Henry.  The initial material balance would be a R N for Q&P which does not sound too bad.  But, I did analyse that black could win my knight with a series of queen and bishop checks.  However, because Ion played Qb6  and not Bc5  I had the following get out clause as Ion states as follows:-\r\n\r\n\"Thanks for the game, Joanne. Yes, I thought your bishop might have gone the wrong way. I did think though, that you might try 23.a5 Qc4 24.Ba3. I had planned 24...Rxe2 25.Bxc5 Bxc5 with 26...Bf2 to come, though if 27.g3 Rf2 might be preferable.\"\r\n\r\nSo, if 21................ Bc5 !! I would not have had the get out move a5 to play as the pawn on a5 would have been blocked by The Wicked Witch of the West.\r\n\r\nSo, here ends another lesson.  Even with a bad pawn structure try and counter-attack.  You may suffer an initial loss of material but you may stand a chance of regaining it if you keep your pieces active. \r\n\r\n\r\n"
    },
    "url": "https://gameknot.com/annotation.pl/an-expert-lesson-in-piece-placement-part-2?gm=17517",
    "gameName": "An Expert Lesson in Piece Placement - Part 2",
    "players": "jstevens1 (1698) vs. ionadowman (2047)",
    "opening": "Vienna gambit (C29), Breyer variation"
}