{
    "moves": {
        "1. e4": "Hi everyone!\r\n\r\nI thought I would be on the receiving end of the Petrov this time against my Expert buddy Dave.  Things seemed to be going OK and then my kingside pawn structure got busted.  I then went into a K & P ending and Henry then got bogged down with disastrous results.  How does it happen?  Well, here we go .....",
        "1... e5 2. Nf3 Nf6": "2. ...... Nf6 - this move starts off the Petrov's defense.",
        "3. Nxe5 d6 4. Nf3 Nxe4 5. c4": "5. c4 - all fairly standard Petrov stuff so far!",
        "5... Nc6 6. d3 Nf6 7. d4 d5 8. Nc3": "8. Nc3 - out comes my queen knight.",
        "8... Bb4 9. Bd3 O-O 10. O-O": "10. 0-0 - after some development both kings get tucked away.",
        "10... Bg4 11. Be3 Re8 12. Rc1 dxc4 13. Bxc4": "13. Bxc4 - pawn trade.",
        "13... Bh5 14. a3 Bxc3 15. bxc3": "15. bxc3 - was Rxc3 better?  Gameknot Analysis does not have anything to tell me here.  Except that my score is -0.26.\r\n\r\n \r\n \r\n",
        "15... Qd6 16. a4 Nd5 17. Bxd5 Qxd5 18. Bf4 Re7 19. Qd3": "19. Qd3 - escaping from the pin.",
        "19... Rae8 20. Rfe1": "20. Rfe1 - I do not like that doubling up of black heavies on the e column, time to get rid of 'em.",
        "20... Bxf3 21. Rxe7 Rxe7 22. Qxf3 Qxf3 23. gxf3": "23. gxf3 - so here it is, my kingside pawn structure is busted.  Gameknot Analysis gives my score in the position as -0.47.  My position has gone downhill a bit since the exchange of N for B on c3 on move 15.\r\n\r\n \r\n \r\n",
        "23... f6 24. Kf1 Kf7 25. Re1": "25. Re1 - thought I would challenge the e column.",
        "25... b6 26. Rxe7+ Nxe7": "26. ....... Nxe7 - rook trade.",
        "27. c4": "27. c4? - here comes the innaccuracy and boy it is a big 'un:- Inaccuracy: -1.00 » 27. c4 Nc6 28. Be3 Na5 29. c5 Ke6 30. Bf4 Nb3 31. Bxc7 bxc5 32. dxc5 Nxc5 33. a5 Kd5 34. Kg2 Kc4 35. Bf4\r\nBest: -0.14 » 27. Ke2 Ke6 28. c4 Nf5 29. Kd3 Kd7 30. Bd2 Nd6 31. c5 bxc5 32. dxc5 Nf5 33. Ke4 Ke6 34. Bf4 c6 35. a5\r\n\r\nHmm, in that Best Line my position does look drawish there with the ability to move Fou Lenoir freely.  My position is about to go further south.\r\n \r\n \r\n\r\n",
        "27... Nf5 28. d5 Nd6 29. Bxd6 cxd6": "29. ..... cxd6 - after this trade the computer gave my score as -1.35 so it is certainly gradually getting worse all the while.\r\n\r\n \r\n \r\n",
        "30. Ke2 Kg6 31. f4 Kh5 32. f3": "32. fe?? - mistake and as it turns out, another biggie.  Here is what the computer had to say.  Mistake: -2.37 » 32. f3 Kg6 33. Kd3 Kf5 34. a5 Kxf4 35. axb6 axb6 36. Ke2 g5 37. Kf2 h5 38. Ke2 f5 39. Kf2 g4 40. fxg4 hxg4 41. Kg2\r\nBest: -0.31 » 32. a5 Kg4 33. Kd3 Kxf4 34. Kc3 Kf3 35. axb6 axb6 36. Kb4 Kxf2 37. Kb5 Ke3 38. Kxb6 Kd4 39. Kc6 Kxc4 40. Kxd6 f5 41. Ke5\r\n\r\nAfter 41. Ke5 I still have drawing chances despite being a pawn down!",
        "32... Kg6 33. Kf2 a5 34. Kg3": "34. Kg3?! - Gameknot has flagged up another inaccuracy: -4.05 » 34. Kg3 Kf5 35. Kf2 Kxf4 36. Ke2 h5 37. Kf2 g5 38. Ke2 f5 39. Kf2 Ke5 40. Ke3 f4+ 41. Kf2 Kd4 42. h3 Kxc4 43. Ke2 Kb3 44. Kd3\r\nBest: -3.24 » 34. Kg2 Kf5 35. Kg3 g6 36. Kg2 Kxf4 37. Kf2 h5 38. Ke2 g5 39. Kf2 f5 40. Ke2 g4 41. fxg4 fxg4 42. Kf2 h4 43. Kg2 g3 44. Kh1\r\n\r\nHowever, even the best position is lost so f3 does deserve the ??",
        "34... Kf5 35. h3": "35. h3 - Gameknot said that this move was a mistake:- Mistake: -5.79 » 35. h3 h6 36. h4 h5 37. Kg2 Kxf4 38. Kf2 f5 39. Kg2 Ke3 40. f4 Kxf4 41. Kf2 Kg4 42. Ke3 f4+ 43. Ke2 Kxh4 44. Kf3 g5 45. Ke4\r\nBest: -4.28 » 35. Kf2 Kxf4 36. Ke2 g5 37. Kf2 h5 38. Ke2 f5 39. Kf2 Ke5 40. h3 Kd4 41. f4 g4 42. hxg4 hxg4 43. Ke2 Kxc4 44. Ke3 Kxd5 45. Kd3\r\n\r\nEven in the best continuation white is lost here.",
        "35... h6 36. h4 h5": "36. ....... h5 - here I am in a zugzwang.  There is no way I can avoid losing my f4 pawn for starters.  Gameknot gives my score as  -9.55 which is more than a whole queen down so the resignation is justified.  The moral and the lesson here is, if your pawn structure is busted there is even less room for innaccuracies, especially when playing against somebody of near-master strength!\r\n\r\n \r\n \r\n"
    },
    "url": "https://gameknot.com/annotation.pl/an-expert-lesson-in-pawn-structures?gm=31572",
    "gameName": "An Expert Lesson in Pawn Structures",
    "players": "jstevens1 (1842) vs. dynamic_dv (2178)",
    "opening": "Petrov (C42), Kaufmann attack"
}