{
    "moves": {
        "1. e4 b6": "1.......... b6 - this is Owen's Defense, the purpose of this move is for the black lsb to be fianchettoed on b7 hitting out at e4 and ultimately g2 and a1.  So there is a counter in the centre that way.  I am warning you guys and dolls that I will be on the wrong end of a rout here, but as Owen's Defense is not well known then I hope this game will enlighten you!",
        "2. d4 Bb7 3. Nc3 e6 4. Bd3 g6 5. Nf3 Bg7 6. O-O Ne7 7. Be3 Nbc6": "7. ........... Ncb6 - here I concentrate on developing my pieces quickly and to what I think are the best squares, but, things may be not quite what they seem.",
        "8. a3": "8. a3 - to prevent a knight incursion on b4 and to preserve my lsb - unfortunately, quite a few moves down the line I will be forced to trade this piece in for one of Paolo's knights after all.",
        "8... O-O 9. e5": "9. e5? - I think this is where my position goes down south.  I would appreciate some feedback from the floor here as to:- a. Is the question mark too harsh, i.e. could white have played better further on in the game and saved it, or b. if that is not the case then any suggestions?  They will be much appreciated.  Cheers.  Joanne",
        "9... d6 10. exd6 Qxd6 11. Be4 f5 12. Bxc6 Bxc6 13. Ne2 Bxf3": "13. ........ Bxf3 - here I am forced to allow my castled position to be broken up after the aforementioned exchange of bishop for knight.",
        "14. gxf3 f4 15. Bxf4 Rxf4 16. Nxf4 Qxf4 17. c3": "17. c3 - at long last, that wretched d pawn which was the cause of the earlier trouble is now protected.  I manage to get a R   P for the two pieces but Paolo's subsequent mating attack will be only too overwhelming.",
        "17... Nf5 18. Qe2 Nh4 19. Qxe6+ Kh8 20. Qh3": "20. Qh3?! - would, say, Rfd1 have been a better try here, allowing the WK to run for the hills?",
        "20... Nxf3+ 21. Kh1 Rf8 22. Qg3": "22. Qg3 - hoping for a queen swap but black has other ideas.",
        "22... Qe4 23. Rfg1 Nh4+ 24. Rg2 Rf3": "24. ...... Rf3 and piling on the agony!!",
        "25. Qxc7 Nxg2": "25. ......... Nxg2 - I grab a pawn, hoping I will get a back rank checkmate, but no chance here as the rook controls the f file.  I decide that as I am 4 material points down and facing a mating attack to wave the white flag here."
    },
    "url": "https://gameknot.com/annotation.pl/an-expert-lesson-in-how-not-to-play-against-owens-defense?gm=16159",
    "gameName": "An Expert Lesson in How Not to Play against Owen's Defense",
    "players": "jstevens1 (1615) vs. paolo (2149)",
    "opening": "Guatemala defence (B00)"
}