{
    "moves": {
        "1. d4 e6 2. Bf4 d5 3. Nf3 h6": "Not exactly normal, but still ok. I'll play h4, just to stop the pawn storm on my Kside, but this time I decided to try another way: normal developement, and, in the worst of cases, play Ng1.",
        "4. Nbd2 g5 5. Bg3": "Here, I expected g4, I'd have answered Ne5. But my opponent wants to punish me.",
        "5... f6": "!? I still have Ng1 for emergency. This creates an impressive pawns center for black, but weakens black's k in spite of developement. ",
        "6. e4": "I have to be aware of the Noak's ark trap for my dsb. ",
        "6... c6": "Another pawn move! I had to \"punish\" this somehow, so I dared...",
        "7. c4": "This is a questionable move. Now, Bb4 is annoying, even if eventually I will force him to exchange his dsb for my N (c5, a3...). But I'll have to take care of dxe4 too, then f4... ",
        "7... dxe4": "Well, now a sacrifice is coming. We're already in a very odd position. The Noak's ark trap will work for him, but he has to take care of my Q's check on h5, which is poisoned...",
        "8. Nxe4 f5": "Here it comes. He is sure he has won a piece, but...",
        "9. Ne5": "...he can't now play f4, or Qh5+ with a strong attack from my side. ",
        "9... g4": "My first goal, to avoid the Noak's ark trap, was reached. Now I have to save my N. Now, I see I could have played (maybe) Ng6, threatening his R. But after Rh7, my other N has to retreat, and I am not sure my Ng6 will survive. If Bh4, his Q can just move away (Qa5+) and then it's unclear if I will be able to keep my N alive. Now I see it as a possible continuation, since the retreat Ne5 is always possible. Oh, well...",
        "10. Nc3": "You don't have to sac pointlessly. I can't complain about my position. ",
        "10... Nf6": "Not a very promising move, since it gives me the chance to play...",
        "11. Bh4 Be7": "Ok, he unpins his N, but what a developement is black's?",
        "12. Ng6": "I can't think of a better purpose for my advanced N than to prevent black's castling and exchange the dsb, making his only developed piece pinned again!",
        "12... Rh7 13. Nxe7 Qxe7 14. Qb3": "This for these purposes: 1) prevent him to develop his lsb (or Qxb7), and 2) allows queenside castling in case of e5 (o-o-o, so if exd5, Rxd5). 3) Prepares pressure against the e5 pawn after c5, Bc4. ",
        "14... Nbd7 15. O-O-O Qf7 16. c5": "This prevents Nb6 and threats Bc4, followed by R(either)e1.",
        "16... b5": "Here, cxb6ep. was tempting, but it seems that just allows black to develop (Nxb6). So I gave up the Bc4 plan just to keep him unconfortable. ",
        "17. Bd3": "The idea is Re1 and threat Bxf5. ",
        "17... a5": "Obviously, black tries a countergame. As you can see, the position is already very \"juicy\", not good for a blitz! Plans like Bg3-Bd6 are nice, but I need to be quick if I don't want black to reorganize. ",
        "18. Rhe1": "If a4, I always have Qxe6+ (not Rxe6+, since after black's K moves, I have to quit my Q's protection of Re6!) ",
        "18... Nf8": "Defending e6! How to break in in few seconds? Now I see Bxf5 was possible right now, with a great edge, but I was time-pressed and I missed it. ",
        "19. Bxb5": "? I love a sac. But this was not sound. The idea was: cxB, Nxb5, and how black will defend against Nd6+? ",
        "19... Bd7": "He thinks the sac is sound! Nice!",
        "20. Bd3": "Now I go for Bxf5...",
        "20... Nd5": "He defends, somewhat blocking my reach to e6...",
        "21. Qb7": "Looking for forcing moves! Was it good? It certainly looks so!",
        "21... Rd8": "Offering the exchange in order to loosen my pressure... but NO WAY! I won't fall for that! Now I see clearly that NxN was the crushing move: NxN, cxN, BxR, KxR, c6! was winning... but I went for...",
        "22. Re5": "? This threats again Bxf5, but black had Ng6!, with threats on my R and my dsb. I'm not able to say if I'd kept the edge after this one... but he was low on time too, and played",
        "22... Rc8": "Certainly with the idea of Rc7, Qc8+, Rc8 and try a repetition. But NO WAY! :-D",
        "23. Bxf5 Rg7": "Just passive play! So I (very low on time, only seconds) played the obvious (but probably not the better)",
        "24. Nxd5": "? Now I see that Ne4! threatening Nd6, was crushing! ",
        "24... cxd5 25. Rde1": "I just can't lose this... or can I?",
        "25... Rg6": "Offering again an exchange in order to loosen my pressure. Of course, I thought: \"no way!\"",
        "26. Rxd5": "The idea was RxN. He has to take with the Q, and then... I'm not sure! This is a real tactic mess, don't you think so?",
        "26... Rf6": "Another exchange offered. This time, I think I should have accepted it: BxR, QxB, RxBd7, and if NxR, QxRc8+...",
        "27. Bxg4": "Total crazyiness, just to keep the pressure. ",
        "27... Rxf2": "Again the exchange was offered, but this time I'm sure it wasn't good to take it. ",
        "28. Rxd7": "If QxR, Bh5+ and I win: Ng6, BxN+, Kf8, QxQ.",
        "28... Qf4+": "He has found some countergame, but Re8 is dooming over black's position...",
        "29. Kb1 Rxb2+ 30. Kxb2 Qd2+": "Would I lose for a counterattack? No, but still...",
        "31. Kb1": "He could have gone now for the perpetual with Qd3+... and I would have had to find a way out. But he timed out. ",
        "31... Qd3+ 32. Kc1 Qc3+ 33. Kd1 Qd3+ 34. Kc1 Qc3+ 35. Kb1 Qd3+ 36. Kb2 Qd2+ 37. Ka3 Qc3+ 38. Qb3 Qxb3+ 39. axb3 Kxd7 40. d5": "...and I am still winning here! Thank you for whatching!"
    },
    "url": "https://gameknot.com/annotation.pl/an-exchange-no-way?gm=64320",
    "gameName": "An exchange? No way!",
    "players": "damafi (1574) vs. hitis (1581)",
    "opening": "Queen's pawn (A40)"
}