{
    "moves": {
        "1. e4 c5 2. Nf3 d6 3. d4 cxd4 4. Nxd4": "4. Nxd4 (standard Sicilian Defence)",
        "4... Nf6 5. Nc3 a6": "5. ........... a6 - this is the Naijdorf.",
        "6. Be3 Ng4": "6.     Ng4 - this unusual move leads to an undevelopment of the white dsb.",
        "7. Bc1 Nc6 8. Be2 Qb6": "8. ......... Qb6!",
        "9. Bxg4 Qxd4 10. Qxd4 Nxd4 11. Bd1": "11. Bd1 - a plethora of exchanges results in the black knight being very dominant and threatening a knight fork on c2.",
        "11... e6 12. Be3 Nc6": "12. .......... Nc6 - the knight is driven back to c6.",
        "13. a3": "13. a3 - keeps the black knight out of b4.",
        "13... b5 14. Be2 Bb7 15. Kd2": "15. Kd2?! - here I was indecisive as to where to put my king.  I thought that this was as good a way to connect the rooks than castling as the queens were off the board.  However, I was to pay for that moment of blind indecision over the next few moves.",
        "15... Be7 16. f3 O-O 17. Ke1": "17. Ke1 - the real lemon - should have played Rad1 here and corrected the error by castling by hand but losing 2 tempi.  Again, why is this move bad?  Wait and see ......",
        "17... Rac8 18. Kf2 f5 19. Rhf1": "19. Rhf1? - I think I should have initiated the pawn exchange here.",
        "19... fxe4 20. Nxe4": "20. Nxe4 - the knight must recapture as the f pawn is pinned to the white king!",
        "20... Ne5": "20. .......... Ne5!!! Very, very, nasty, a discovered attack on the c pawn and the white knight on e4 is en prise to the bishop because that wretched f3 pawn is STILL pinned to the white king.  A pawn drops.",
        "21. Kg1 Rxc2 22. Rfe1 Bxe4 23. fxe4 Rxb2": "23. ........ Rxb2 (another white pawn drops)",
        "24. Bd4 Rc2 25. Bxe5 dxe5": "25. ......... dxe5 - normally if you are behind on material you are advised to exchange pawns and not to exchange pieces.  However there is a dual purpose in this.  Black's central pawn structure is now compromised and the bishops are on opposite colours, meaning that I could try to exchange rooks if given the opportunity and increase my drawing chances.  Lighttotheright gave me no such opportunity.  Those rooks will soon be lethal!",
        "26. Bg4 Rff2 27. Bxe6+ Kh8": "27. ........... Kh8 - I have regained one of my pawns but the rooks begin their stranglehold on my second rank.  My bishop must come back to defend g2.",
        "28. Bh3 Bc5": "28. .......... Bc5 - threatening a deadly windmill/meatgrinder type of discovery here so my next move is forced.",
        "29. Kh1 g6 30. Red1 Bd4 31. Rac1 Rca2 32. Rc8+": "32. Rc2  - turns out to be nothing more than a spite check.",
        "32... Kg7 33. Rc7+ Kh6 34. Rb7": "34. Rb7 - I have vague ideas of a king hunt if my opponent is careless enough to take the a3 pawn as if one of the rooks leaves the second rank then I will push up the g pawn to g5 delivering a check to draw the king out to open country but black's next move is a killer.",
        "34... Rfe2 35. Rf1 Rxe4": "35. ........... Rxe4 - with 2 pawns down and with no hope of my plan reaching fruition as one of the moves in it would have involved moving my king rook to g1 - alas with blacks' rook unmasking a bishop battery onto that square that plan is void.  I waved the white flag."
    },
    "url": "https://gameknot.com/annotation.pl/an-expert-lesson-in-castling?gm=15629",
    "gameName": "An Expert Lesson in Castling",
    "players": "jstevens1 (1614) vs. lighttotheright (2157)",
    "opening": "Sicilian (B90), Najdorf, Byrne (English) attack"
}