{
    "moves": {
        "1. e4": "Hi everyone, I decided to join an Expert's tournament.  The player's ratings ranged from 1899 - 2430 (the 1899 player was at one time an Expert).  This is the game against the 2400  player, an International Master, and the result, well you might have guessed, another loss!  Well, you could say this is all good experience!  Read on ....",
        "1... e5 2. Nf3 Nc6 3. Bb5 a6 4. Bxc6 dxc6": "4. ......... dxe6 - this is the Ruy Lopez Exchange Variation.  I do play the Gligoric but I did bear in mind my Expert Lesson in K & P endings against Paolo (remember that annotated game all?) and this time kept one minor piece on the board, but I still lost.",
        "5. O-O f6 6. d4 exd4 7. Nxd4 c5 8. Nb3": "8. Nb3 - unlike the Paolo game the knight moves to b3 this time!  The queen trade still happens next move though.",
        "8... Qxd1 9. Rxd1 Bg4 10. f3 Be6 11. Nc3 Bd6 12. Be3 b6 13. a4 O-O-O": "13. ...........0-0-0 Right now I am concentrating on development and I tuck Henry away on the queenside.",
        "14. a5 Bxb3": "14. ........... Bxb3 - I return the compliment to white's 4th move.  It does not save me here.",
        "15. cxb3 b5 16. Nd5 Ne7 17. Rac1 Nxd5 18. Rxd5 Be5 19. Rdxc5": "19. Rdxc5 - up until here I have been using the World Database but I have been making decisions as to what I thought was best for me.  However, I overlooked this pawn capture.  I kicked myself for making such a basic oversight, but I consoled myself with the fact that about 2 or 3 Experts made the same error.  Bxb2 is out of the question due to Rxc2 !",
        "19... Rd7": "19. ......... Rd7?? - Beafyness asked me why I played that move and I responded:-\r\n\r\nTo prepare Bxb2. If an immediate Bxb2 then Rxc2 . \r\n\r\nbeefyness then said \"ok but pointless as Rc2 kills the attack, better was Rd3 attacking e3 & b3 19..Rd3 20 f4. Bd6 21 Rd5. Rxe3. Not 21 Kf2(protecting the bishop). Rxb3 22 Rc1-c2. Rb3xb2 22 Rc5xc7  Be5xc7 23 Rc2xb2 Rh8-d8 and you wrestle control of the centre column. It was my feeling at that this was the point you went on the defensive \r\n19...Rd3 20.f4 Bd6 21. Rc5-c3 Re3 22. Rxe3 Bxf4 is also good for black\r\n- so maybe the 3 other experts didn't make such a bad error, it was probably 19. Rd7? that did the damage! ",
        "20. Rc1c2 Kb7 21. Kf2 Bd6 22. Rd5 Rhd8 23. Rd4 Be5": "23. .......... Be5 - not good to exchange when you are down but I felt I just had to relieve the pressure that the two white cannons were generating.",
        "24. Rxd7 Rxd7 25. f4 Bd6 26. Ke2 Be7": "26. .......... Be7 - to avoid Frere Lenoir being pinned to my rook.",
        "27. h3 h6 28. Rd2 Rxd2+ 29. Bxd2": "29. Bxd2 - Again not a good idea to exchange when you are down but I thought my best chances were in a piece ending rather than a rook and piece ending.  Frere Lenoir and Henry try their best but as you will see it is not quite enough.",
        "29... Bd6 30. Kf3 Kc6 31. Kg4 Kd7 32. Kh5": "32. Kh5- the white king is trying to snaffle my g7 pawn, Henry must get there as quickly as he can!",
        "32... Ke8 33. Kg6 Kf8": "33. .......... Kf8 - made it, but ....",
        "34. Kf5 Kf7 35. e5 fxe5 36. fxe5": "36. fxe5 - white creates a passer.",
        "36... Be7 37. e6+ Kf8": "37. ........ Kf8 - Henry is driven back.",
        "38. Bc3 c6 39. Kg6 Bd8 40. Bxg7+ Ke8 41. Bxh6 Bxa5 42. h4 Ke7": "42. ......... Ke7 - one of the pawns must be blockaded.",
        "43. Kf5 Bb6 44. Bg5+ Ke8 45. h5 Bd4 46. h6 Bxb2": "46. ........ Bxb2 - I have the satisfaction of removing white's b pawn but it is too late, next move white plays his bishop to f6 screening out Frere Lenoir from h8.  White's bishop is backed up by his king.  There is no way I can stop white from crowning one of his passers so I waved the white flag.   Thankfully the loss was just 0.3 points.   I just hope I can put up a better show against him in my return challenge as white.  Cheers everyone!  Joanne",
        "47. Bf6": ""
    },
    "url": "https://gameknot.com/annotation.pl/an-im-experience?gm=20128",
    "gameName": "An IM Experience",
    "players": "beefyness (2421) vs. jstevens1 (1744)",
    "opening": "Ruy Lopez (C69), exchange, Gligoric variation"
}