{
    "moves": {
        "1. d4 d5": "The game opens as a Classical Queens Pawn.\n",
        "2. Nf3": "I choose an alternative to the standard 2.c4, and this move leans towards a possible QGA position where Nf3 is played, or even a Semi-Slav or Slav is possible.\n",
        "2... e6": "This move steps away from the QG flavored alternatives into a French like position for black, except Nc3 is a full French, and Nf3 differs in that it moves the fight for d5 to a fight for e5, and it provides for rapid short castling.\n",
        "3. e3": "It seemed a logical step to achieve castling rapidly, and this move also makes d4 very secure.\n",
        "3... Nf6": "I envisioned short castling for black as well, and I considered ...Ne4 which targets d2 and f2, which gave me thoughts for countering this later.\n",
        "4. Bd3": "Besides the obvious clearance for castling, this move begins the fight for ownership of e4, in which I expect a knight to drop. A followup move of either Nc3 or Nd2 is planned.\n",
        "4... Be7": "Black signals intent to castle, and this move while not aggressive as ...Bb4 does allow black to attain the goal quickly.\n",
        "5. Nbd2": "I decided on Nd2 so that the c pawn is free, and this move now provides against ...Ne4.\n",
        "5... O-O": "Black has done well, now castled the opportunity to develop a strategy is enabled.\n",
        "6. e4": "!? I decide to engage black a little early because I have good control of e4 and will be able to gain some reasonable play by pawn exchange, or positionally if the pawn is pushed to e5 where it will knock the knight off of f6. I expect a sequence of exchanges to follow which will open up the position some, and I hope to my favor due to the locked c8 bishop. I intend to use the white squares in an attack kingside, where my active bishop will be able to play a strong part.\n",
        "6... dxe4 7. Nxe4 Nxe4 8. Bxe4": "The bishop stands reasonably well and targets h7, which can be useful if coordinated with the queen.\n",
        "8... Nd7": "An interesting move where it is possible that black seeks to replace the knight at f6. The move is good because it does not block the c7 pawn, and can present an attack on the bishop, and develops a piece into the arena. A bishop check was also possible, but would seem to yield no encouraging results for black.\n",
        "9. O-O": "A necessary step before developing a strategy.\n",
        "9... Nf6 10. Bd3": "I maintain the bishop which has such a nice view of h7.\n",
        "10... Bd7": "Black continues with back rank clearance so the rooks can be tied, and the bishop can be repositioned outside the pawn chain. An alternative could have been to push ...b6 followed by ...Bb7 to put pressure on the castle by way of the knight, and to provide for a future possibility of developing a kingside attack.\n",
        "11. Ne5": "I decide to poke a stick in the nest of hornets to see what I can shake loose. The knight is not particularly invulnerable here, but it does apply some good positional control while menacing a bishop.\n",
        "11... c5": "Attacking the defender, typically a good strategy, but the offending knight is not under attack and this allows white to play a positionally developing move.\n",
        "12. Ng4": "!? An attempt to rid myself of the knight that holds h7, a pawn is sacrificed in the attempt.\n",
        "12... cxd4 13. Ne5": "I could have exchanged knights, but decide that I prefer ...Nxg4 as opposed to Nxf6, because it enables the queen access to the b1 diagonal at e4 next move. I move the knight back to e5 to give myself some time to consider some options for positional improvement.\n",
        "13... Bd6": "Black seeks to provoke an exchange of the bad bishop for a good knight.\n",
        "14. f4": "This opens some possibilities while declining Nxd7 which only improves blacks position. Now a rook lift is a possibility, and a BxN exchange will force the knight from f6, where d5 and e8 are choices which leave h7 less defended.\n",
        "14... Bc6": "Black improves the bad bishop, still enticing NxB which can irmprove the center by bringing in another pawn, perhaps creating a central thrust of pawns as a strategy.\n",
        "15. Ng4": "Giving it another try, enticing NxN to develop the queen into the kingside attack.\n",
        "15... Nxg4": "I am encouraged to see this move which enables my plans.\n",
        "16. Qxg4 e5": "Black seeks the move ...e5-e4 to shut out the bishop, and while a worthy strategy this move does leave f5 open for the white queen.\n",
        "17. fxe5": "Removes the threat and opens a bishop line.\n",
        "17... Bxe5": "A necessary recapture, but the bishop is dangling without support.\n",
        "18. Qf5": "! A double threat of QxB, and Qxh7+\n",
        "18... f6": "Black accepts the loss of a pawn to save the bishop, a tough decision, but necessary to prevent mate and to maintain the best material balance.\n",
        "19. Qxh7+ Kf7": "This is an encouraging position full of opportunities for white on the white squares.\n",
        "20. Bg6+ Ke6 21. Bf5+": "I consider this better than the simple Qxg7 which only leaves the queen in agony under the pressing attack of a rook. The text move forces the king to seek refuge in the central squares. The attack is not at a stage of realized potential, it is just building slowly, but giving chase to the king offers white some advantage.\n",
        "21... Kf7": "?! A move that seems logical to protect f7, but it encourages further pressure from white due to the white square the king resides on.\n",
        "22. Qg6+ Ke7": "The alternative (22...Kg8 23.Be6+ Kh8 24.Qh5#) is obviously bad, or (22...Kg8 23.Be6+ Rf7 24.Bxf7+ Kh8 25.Qh5#) is no better, so the king is left with one choice at e7.\n",
        "23. Re1": "!? Creating a pin, and brings another piece into the fight, the rook is well aligned on the e file where is can be used in an exchange sacrifice at e5, or used with Bf4 for further threats.\n",
        "23... Qd5": "? Black seeks to strengthen e5, but the queen takes up position on a vulnerable square, not from a piece, but from a pawn attack. The position makes it difficult to find a better move, even the alternative 23...Qd6 may hold some difficulties due to the threat of exchange sacrifice by Rxe5+ fxe5, and then a followup attack by Bg6+\n",
        "24. c4": "! Deflection to enable the exchange sacrifice.\n",
        "24... Qxc4 25. Rxe5+": "! Accepting the sacrifice by 25...fxe5 will allow Bg5+ and the activation of the a1 rook into the attack.\n",
        "25... Kd6": "Black threatens the rook with KxR, but there is a small defect in that idea.\n",
        "26. Bf4": "The position becomes more complicated as the threat of revealed attack is enabled, the rook is immune from fxe5 due to the pin of pawn to king, and the threat of mate is not far due to the lack of available squares around the king. Black should consider ...Kc7 to gain ...Kb6 in an effort to escape.\n",
        "26... b6": "?? Made with the idea of hiding the king behind the bishop at b7, but this misses a move by white that refutes this plan.\n",
        "27. Qxg7": "! The black king is completely locked and mate is a short move away. Note (27...fxe5 28.Qxe5#) is a bad choice.\n",
        "27... Rfg8": "?? Missing the mate threat.\n",
        "28. Rb5#": "A coordinated effort of four pieces completes the mate in a artistic motif, where all mating pieces are hanging, and two are under attack.\n"
    },
    "url": "https://gameknot.com/annotation.pl/an-interesting-qp-game-to-colle?gm=26090",
    "gameName": "An interesting QP Game to Colle",
    "players": "chessknave (1573) vs. Friend ",
    "opening": "Queen's pawn game (D02)"
}