{
    "moves": {
        "1. d4": "Queen's gambit?",
        "1... e5": "I think not.",
        "2. dxe5": "I've been told that in openings, most of the time it's better not to take if you don't have to, but instead to build preasure on the piece... so was this a good choice?",
        "2... Nc6": "Developing, and attacking...",
        "3. Nf3": "Developing and defending...",
        "3... Qe7": "Targeting the pawn...",
        "4. Bg5": "Development...",
        "4... Qb4+": "Naturally.",
        "5. Nc3": "I think this was a mistake. Once I take the pawn on the b file, white will have to move another piece to defend the knight, or move the knight itself...",
        "5... Qxb2": "Num.",
        "6. Nd5": "A good spot, since I can't immidiately kick his knight, along with the fork threat on the c file.",
        "6... f6": "It was now I noticed that whites king actually isn't that well protected. So I make a sacrifice, for an attack.",
        "7. Nxc7+": "He takes, forking my king and rook.",
        "7... Kd8": "If he retreats now, He'll be down a pawn when I take the knight or bishop.",
        "8. Nxa8": "Instead, he takes the inactive rook.",
        "8... fxg5": "And I get his active bishop.",
        "9. e6": "I understand his logic here, but he seems to have forgotten his defenses.",
        "9... Bb4+": "And the pain starts.",
        "10. Nd2": "Naturally.",
        "10... Nd4": "Getting another piece involved...",
        "11. Rc1": "This prevents Nxc2 forcing Qxc2 to prevent mate.",
        "11... Nxe6": "Should I have done this? or should I have tried to develop my other pieces?",
        "12. e3": "An escape route.",
        "12... Nf6": "I develop...",
        "13. Bd3": "He develops, planning to castle kingside.",
        "13... Qc3": "Now, if he castles, I'll get the knight and be up in material. **Also note that I'll eventually get the knight on a8**",
        "14. Ke2": "I would have just kept my king at e1. I guess he didn't like the pin.",
        "14... Nf4+": "And another sac!...sort of. If he takes, I'll get my material back.",
        "15. exf4": "He takes.",
        "15... Re8+": "And now the king is in check. moving to f3 or f1 leaves only 1 defender on d2, giving me the knight. Be4 achives nothing. Therefore, Ne4 seems the best.",
        "16. Ne4": "Which is exactly what he does.",
        "16... Nxe4": "Though it doesn't really matter, since I still will get the piece.",
        "17. Bxe4": "He takes...",
        "17... Rxe4+": "Blacks situation is getting bad now.",
        "18. Kf1": "What else can he do?",
        "18... Rxf4": "Num. My real intention though was to target the f2 pawn.",
        "19. g3": "Trying to kick the rook.",
        "19... Rf6": "He doesn't want to die.",
        "20. Qg4": "Trying to attack...",
        "20... d6": "Preparing to expand, while attacking the queen...",
        "21. Qxg5": "Not sure what to say to this, Can't really see any good moves for white.",
        "21... Qf3": "He resigns here. I hope you all enjoyed the game!"
    },
    "url": "https://gameknot.com/annotation.pl/an-interesting-game?gm=45641",
    "gameName": "An interesting game",
    "players": "rudidm (1398) vs. johnsmith95 (1364)",
    "opening": "Queen's pawn (A40), Englund gambit"
}