{
    "moves": {
        "1. e4": "Hi everyone!  Time for Round 2 against IM Beafyness.  Again another loss, if you want to see how it all unfolds then do read on .......",
        "1... c5 2. Nf3 d6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 a6": "5. ........ a6 - a Sicilian Naijdorf.",
        "6. Be3 e5 7. Nf3 Be7 8. Bc4 O-O 9. O-O": "9. 0-0 - I thought that my pieces were well placed here, I have a lead in development and I have just castled.  So where and oh where did it all go wrong?",
        "9... Nc6 10. Re1 Be6 11. Bb3 Rc8 12. Bxe6": "12. Bxe6?? - I think in retrospect it may be here that things start to go a little pear shape.  It is very tempting to make this capture and I got suckered into it because it doubled up black's kingside pawns.  May have been OK had a pawn been on f3 and c3 but they ain't there here!  As a result black got a good centre.  Two question marks may seem harsh but I think it is a good idea to give this doubling up idea here the skull and crossbones!",
        "12... fxe6 13. a3": "13. a3 - classic move to stop a knight incursion on b4, but that horse later finds another lush paddock to graze upon!",
        "13... h6 14. h3 d5 15. exd5 exd5": "15. ...... exd5 - Voila, un position centrale tres tres forte avec des pions noir!  Chaque tour, Beafyness va mettre son pion a d4.  Le pion attacque mon Cavalier et Frere Lenoir!  Mais Frere Lenoir est allee a d2!\r\n\r\n",
        "16. Bd2 e4 17. Nh2": "17. Nh2 - In my earlier note just thought I would practice my rather rusty school French!  I will revert back to English to say that this is a typical jstevens1 game - welcome to the land of passivity.  Pieces pushed back and there they stay until black gets an attack out of nowhere!",
        "17... Qd7 18. Ne2": "18. Ne2 - to prepare an eventual outpost on d4 after a move like c3 - but I do not get the chance to play this.",
        "18... Bc5 19. c3 Ne5": "19.  ...... Ne5 - fearing a possible knight incursion on d3 I move my knight to c1.",
        "20. Nc1 Qf5 21. Rf1": "21. Rf1 - this move is necessary as black's dsb and the Wicked Witch of the West are attacking my f pawn.  But should Glenda (my queen) have gone to e2 instead?",
        "21... Nc4 22. Qc2": "22. Qc2 - Glenda defends both b pawn and Frere Lenoir, this is the black knight's new paddock and boy does he love it!",
        "22... Qe5 23. Ne2 e3 24. Be1 exf2+ 25. Bxf2 Ne3 26. Bxe3 Qxe3+ 27. Kh1": "27. Kh1 - after Henry has evaded the Wicked Witch and some wood has been exchanged I thought the attack was fizzling out.",
        "27... Ne4": "27. ...... Ne4 - Wrong!  Here comes a new Trojan Horse, threatening a nasty check on f2.  A pair of rooks is now exchanged with check.",
        "28. Rxf8+ Rxf8 29. Ng4 Qxe2 30. Qxe2 Ng3+": "30. ........ Ng3 , ouch and double ouch.  Glenda was lured onto e2 (decoy) into the path of a royal knight fork.  I will be a whole piece down here against an International Master - far too much.  So I wave the white flag.  I try so hard not to be passive but somehow it just follows me around!\r\n\r\nJoanne"
    },
    "url": "https://gameknot.com/annotation.pl/an-im-experience-pt-2?gm=20165",
    "gameName": "An IM Experience - Pt 2",
    "players": "jstevens1 (1748) vs. beefyness (2430)",
    "opening": "Sicilian (B90), Najdorf, Byrne (English) attack"
}