{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Bb5 d6": "I originally said, \"The real point of Bb5 is the pin, right?\"  I meant that the pin undermines the pawn's defence at e5.  OK, if 3... a6, does black end up losing the e pawn as in 4.Bxc6+ bxc6 5.Nxe5?",
        "4. d4": "An attack on the pawn continues.",
        "4... Bd7 5. O-O": "In some ways this is a thinking move.  Castling was not strictly required, but it prevents surprising situations and is generally useful.  I could foresee the lines:\r\n[A] 5.d5! Nb8 6.Bxd7+ Qxd7.\r\n[B] 5.dxe5? Nxe5 and white can choose how he wants to cede the bishop-pair or choose to retreat.\r\n[C] 5.O-O exd4 6.Nxd4 and if 6... Nxd4 7.Bxd7+",
        "5... exd4 6. Nxd4 Nxd4 7. Bxd7+ Qxd7 8. Qxd4 b6 9. Bf4": "Somewhat misplaced, but I thought to discourage him castling queenside.",
        "9... O-O-O 10. c4 Nf6 11. Nc3 Nh5 12. Be3 c5 13. Qd2 g6 14. a4 Bg7 15. Nd5": "Preferring not to exchange.  (And aware of the strength of the square as a knight outpost.)",
        "15... Rhf8 16. b4": "A real blunder because I was caught looking, but without this move the game would not have been as interesting.  Ion, I believe caught looking originates from baseball where a player strikes out on the last strike without swinging.  Here I mean that I did not examine the effect of b4.  My thoughts were that his entire queen-side pawn-structure would be easy to undermine.  I did contemplate- it's a better word than analyse here-- a5.  I thought a5 would be stronger after b4, and if not for the bishop, it might have been true.  Over-preparation can be costly.",
        "16... Bxa1 17. Rxa1 Kb7 18. a5 Rda8": "If white opens the a file, he will lose control of it.",
        "19. bxc5 dxc5 20. Rb1": "Protecting a5 and attacking c5 simultaneously.",
        "20... Qc6 21. Ne7": "Not really sure what I was thinking.  I mean I wanted to remove the defender of his c pawn, but it was too much to hope that he would abandon its defence.",
        "21... Qc7 22. Nd5": "As the chess coaches like to point out, some moves are not permanent.  If they are a mistake, they can be unmade unless they are pawns.",
        "22... Qc6 23. f3": "Reinforce the vulnerability I noticed and continue to prepare an assault on c5.",
        "23... Rfd8 24. Qf2 Nf6 25. Bxc5 Nxd5 26. cxd5 Qf6 27. Bxb6": "!  Despite black's superior attackers white has regained the advantage.  This line threatens 28.Rxb6+ dropping the Black queen if Black responds 27... axb6.  I originally misread Ion's lines.  They reference 26... Qc7, but Ion, on your line 26... Qc7 27.Bxb6 axb6, I still think that 28.Rxb6+ continues to be the strongest continuation.  Black will ultimately drop the queen, it is just a matter of how.  \"29... Kc7\"? 30.Rc6! pinning the queen to the king.  \"29... Qxb6\"?  White has two alternatives, axb6 and Qxb6.",
        "27... Kc8": "Ion adds in the note to the next move line A except he mistypes 30.Bc5 as Be7+.  I decided to analyse alternative responses by black and came up with the B variations.  I cannot say that Black looks any better there.\r\n[A]29... Ke7 30.Bc5+ Rd6 forced 31.Qb7+! [B]29... Kd6 30.Qc6+ [B1] 30... Ke7 31.Bc5+ Rd6 forced 32.Bxd6+ Qxd6 33. Rb7+!  [B2] 30... Ke5 31.Bc7+ Rd6 forced 32.Qc3+! Kf4 33.Qxf6+!",
        "28. Bxa7": "Why did I shy away from Qc5+ or Qc2+?  At the time I was desperately wishing for a light-square bishop, but as the previous analysis showed I should have proceeded because Black must shed material in an awful way.  I mistakenly thought that the Black king could escape to g8 or g7, so I delayed attempting to formulate an unnecessary escape control plan.\r\n\r\nChessmaster's TheKing engine believes this an error when Qc2+ is a won game, but a \"won game\" can be an unbelievable uphill battle.  Having examined Qc5+, I cannot imagine how Qc2+ is an improvement.  I also doubt Chessmaster.  Sure it destroys me when I try to play it, but that is based on pure calculation speed.  When analyzing this game, there is a point later where its analysis is deeply flawed in a way that no decent human player would not recognize as being faulty.",
        "28... Kd7 29. Bb6": "I proceed cautiously by making the position more closed.  I have real advantages such as strong pawn formations, an advanced passed pawn, and a half-passed pawn, but his attackers are superior to my own.",
        "29... Rdc8": "I partly expected Rdb1 pinning the bishop in an attempt to win the a pawn, but this move does have its own logic.",
        "30. Qe2 Ke8 31. Kf2": "This is the mistake as the move needs preparation.  Chessmaster preferred a6.",
        "31... Qh4+": "Good move.",
        "32. Kg1": "And here is where Chessmaster's analysis is deeply flawed.  At 30 seconds a move game analysis it says, \"Leads to 32...Qf6, which does not result in any captures. Better is Kf1, leading to 32...Qxh2 33.a6 f6 34.Qa2 Qd6 35.a7 Kf7 36.Qb2 h6 37.Ra1 Kg7, which loses a pawn.\"  We learn that Chessmaster prefers captures even if the ultimate result is bad for the side under consideration.  Sure white can afford to surrender it, but why?",
        "32... Kf8 33. g3 Qh3 34. Rd1 Rc3 35. d6": "Pushing the advantage.",
        "35... Qd7": "He gives me just what I wanted.",
        "36. Qd2": "I can deliver two threats!  I had wanted to play this move, or one like it for a move or two, but I needed a situation in which the threat was subtle.  Here, he cannot respond to both.",
        "36... Rac8 37. Qh6+ Kg8 38. Bd4 f6 39. Bxc3 Rxc3": "I would say that this game highlights very well that Chessmaster can be wrong.  Well, truthfully its suggestion probably is better (and Ion's certainly is), but the move did not cost the game.  Earlier it thought that 28.Bxa7 was one too many pawns gobbled by the greedy bishop, but now the exchange of rook for bishop occurs anyway.  Humans err too, but we immediately could see earlier that there was no reason to abandon the h pawn.",
        "40. Rc1 Rxf3": "Honestly, I expected 40... Rxc1+ 41. Qxc1 Qxd6 killing White's most advanced passed pawn.",
        "41. Rc7": "I love the moments when we say, \"Hey, wait I can embarrass that defender!\"  We now enter a phase of play that I often find quite tedious which could aptly be called \"survive the checks.\"",
        "41... Rf1+ 42. Kxf1 Qb5+": "Each check requires tedious examinations to see that white is not blundering away his advantage.",
        "43. Ke1 Qb1+ 44. Kf2": "Considered playing either Rc1 or Qc1, but the next move would probably be Qxe4+, so I wanted to preserve my threat and make the capture of the e pawn a losing move.",
        "44... Qb2+ 45. Kg1 Qd4+ 46. Kg2 Qxe4+ 47. Kh3 Qf5+": "I got slightly sloppy.",
        "48. Kg2 Qe4+ 49. Kf2 Qd4+": "I have accepted that I will have to remove the immediate threat to make any progress.",
        "50. Qe3 Qb2+ 51. Kf3": "Expected resignation here.",
        "51... Qb8 52. Qe6+": "52.Qe7 fails because it exposes the white king to more checks."
    },
    "url": "https://gameknot.com/annotation.pl/an-interesting-game?gm=25116",
    "gameName": "An interesting game.",
    "players": "Jay Kuykendall (1551) vs. Akikat M. (1554)",
    "opening": "Ruy Lopez (C62), old Steinitz defence, Nimzovich attack"
}