{
    "moves": {
        "1. c4 e5": "My friend who hasn't played chess for a while decided not to play ...c5 is usual response so this was new territory for us.",
        "2. Nc3 Nc6 3. g3 b6": "g6 is more common and so I was thinking of play a Botvinnik type formation but with this I decided to look for a d4 break.",
        "4. Bg2 Bb7 5. e3": "Planning Ne2, O-O and d4",
        "5... Nf6 6. Nge2 d5": "My friend plays this to stop my d4 break. However at first I thought this was a blunder.",
        "7. cxd5 Nb4 8. Qb3": "?!",
        "8... Nd3+ 9. Kf1": "This is where the complications will begin. I expected Nc5 however blacks move is interesting.",
        "9... e4": "!? Black plays e4 protecting the knight however there are some complications: Nxe4 (Nxe5? Qxd3 is what my friend played to start with however I let him take it back) Nxe4 Bxe4 Nc5 Qc2 Bxe4 (Or Qxe4) and black is better due to a safer king however he is a pawn down but I beleive he has compensation. White's weak king and light squares as well as some troublesome development of the DSB. So maybe rather than Bxe4 white Plays Qxe3 Nf6 with pressure on the d-pawn. White can play e4 or Nc3 but not Nf4 due to g5 and kicking the Knight and dropping the d-pawn. This is probably better for white (I like Nc3) because he has two pawns for his bad king however he needs to exchange pieces and get to an endgame to make advantage of this.",
        "10. Nxe4 Nxc1 11. Nxf6+ Qxf6 12. Rxc1 O-O-O 13. Qc2": "White is pressuring the q-side threatening mate. Now Black played Rd7 to start with however Bh3 pins the rook and wins the exchange so my friend took it back.",
        "13... Bd6 14. Nd4": "Wanting to play Bb5 to kick the DSB or jump into c6.",
        "14... Ba6+": "I prefer a6 however This is ok.",
        "15. Ke1 Rhe8": "Threatening Qxd4",
        "16. Bh3+": "To start with my opponent played Kb8 then I played Nc6+ and he resigned (we were nearly out of time) however he then saw he could have played Kb7 but we were out of time so we didn't continue.",
        "16... Kb7": "However now I will try and analyse this. All comments welcome."
    },
    "url": "https://gameknot.com/annotation.pl/an-interesting-7-minutes?gm=43243",
    "gameName": "An interesting 7 minutes",
    "players": "Me  vs. My Friend ",
    "opening": "English (A25), closed system"
}