{
    "moves": {
        "1. e4": "Hi Everyone!\n\nAs my coach, Ionadowman would attest, I am an absolute tiger for punishment!  I am addicted to playing the big boys.  I guess it is because I feel there is everything to gain and little to lose so that is the upside of being the underdog.  I am playing in a MT called Jo against The Titans which consists of myself, 3 masters and 1 grandmaster!  Sadly, I did not get off to a very good start, going down like a lead balloon to a mating attack from Ken, who I have played 3 times before and lost the lot!  We both kick off with a double king pawn opening and then he gives me the King's Gambit with 2. f4 of which I accept.  Before I go any further here is the gameknot analysis. \nhttp://gameknot.com/analyze-board.pl?bd=15886592&fb=1&rnd=0.7647563132082495",
        "1... e5 2. f4 exf4 3. Nf3": "3. Nf3 - fairly standard to avoid Qh4+.",
        "3... g5 4. h4": "4. h4 - hitting at the f pawn's support.  I advance the g pawn.",
        "4... g4 5. Ne5": "5. Ne5 - I thought he might go Ng5 which is the Allgaier Gambit, sacrificing N for P in order to bring Henry out into the centre but he chooses the Kiezeritzky Gambit instead which can get really wild.",
        "5... Nf6 6. Bc4 d5": "6. ..... d5 - to block out the white lsb's attack on f7.",
        "7. exd5 Bg7 8. O-O O-O": "8. ..... 0-0 - I tuck away Henry on the kingside but alas, he is not safe there!",
        "9. d4 Nxd5 10. Bxd5 Qxd5": "10. ....... Qxd5 - a plethora of exchanges - black looks to be doing well, but appearances can be deceptive sometimes.",
        "11. Nc3 Qd8": "11. ..... Qd8 - attacking h4.",
        "12. Bxf4 Nc6 13. Nxc6 bxc6": "13. ..... bxc6 - knight trade, sadly my queenside pawns are really split and will become a target for the Wicked Witch of the West.",
        "14. Be5 Bxe5 15. dxe5 Qxh4": "15. ...... Qxh4 - Glenda grabs the h pawn.  Might as well, seeing as my queenside pawns are so shattered.  However, I overestimated Henry's safety at that point.",
        "16. Qd4 Bb7": "16. .... Bb7 - connecting the rooks but alas I should have perhaps put Fou Leblanc on e6 instead to at least keep that a1-h8 diagonal blocked to the Wicked Witch of the West.",
        "17. Rf4 h5 18. Rf5 Bc8 19. Rf6": "19. Rf6 - the f column will be swarmed by major pieces very soon.",
        "19... Be6 20. Raf1 Qg5": "20. ...... Qg5 - Glenda has to defend, but ....",
        "21. Ne4 Qg7 22. Qe3": "22. Qe3 - this move proves it will be in vain.",
        "22... Kh7": "22. ..... Kh7 - to try and stop Rh6.",
        "23. Ng3": "23. Ng3 - there is no way I can defend this pawn so I played Rg8 preparing Qg5 to lose the h pawn to trade queens out of trouble.  But Ken is not having that.",
        "23... Rfg8 24. Nf5": "24. Nf5 - the killer, there is no way I can avoid losing Glenda except by copping Old Matey.  I therefore resigned on the grounds of ruinous loss of material as per this analysis. Variation A\r\n\r\n24. Nf5 Qf8 \r\n25. Rh6+ Qxh6 \r\n26. Qxh6# \r\n\r\nVariation B\r\n\r\n24. Nf5 Qg5 \r\n25. Rh6+ Qxh6 \r\n26. Qxh6# \r\n\r\nVariation C\r\n\r\n24. Nf5 Bxf5 \r\n25. Rf1xf5 Rh8 \r\n26. Rxh5+ Kg8 \r\n27. Rg5 Qxg5 \r\n28. Qxg5+ \r\n\r\nHis mating attack was overwhelming.  Well played Ken.\r\n\r\n"
    },
    "url": "https://gameknot.com/annotation.pl/an-overwhelming-mating-attack?gm=38766",
    "gameName": "An Overwhelming Mating Attack",
    "players": "lighttotheright (2234) vs. jstevens1 (1802)",
    "opening": "KGA (C39), Kieseritsky, Rice gambit"
}