{
    "moves": {
        "1. e4": "Hi everyone!\r\n\r\nAfter my missed opportunity against the 1950+ player, Paolo, I did manage to win this one, although this time it was against a fellow Class B player.  He played the Kiezeritzky Variation of the King's Gambit accepted and fell into an inferior line.  My pieces just overwhelmed him and that did result in me winning a rook.  My opponent made me prove the win right out till he copped Old Matey.  Here is an analysis of the game:- http://gameknot.com/analyze-board.pl?bd=15157320&fb=1&rnd=0.2663012340368604",
        "1... e5 2. f4 exf4": "2. ..... fxe4 - this is the King's Gambit accepted.  White chooses to sac a pawn and build up a strong pawn centre and an attack on the BK.  But Black can defend and even counter-attack as you will see.",
        "3. Nf3 g5 4. h4 g4 5. Ne5": "5. Ne5 - this is the Kiezeritzky Variation.  An alternative is the Allgaier Gambit which is Ng5 where the knight is sacrificed for two pawns to expose the BK, in my case, my seafood-loving king, Henry!",
        "5... d6 6. Nxg4 Be7 7. h5 Bh4+": "7. ...... Bh4+ - Fou Lenoir comes into the fray.  In order to avoid displacing his king, white must retreat his knight to f2.",
        "8. Nf2 Bg3": "8. .... Bg3 - gameknot analysis does not like this move.  It was one of the recommended moves in the DB and it does form a bit of a clamp over the white position.",
        "9. d4 Nf6": "9. ...... Nf6! - this developing move has a sinister purpose.  The e4 pawn is under threat and I am also threatening Ng4 taking advantage of the pin on the f2 knight.",
        "10. Nc3 Ng4 11. Qf3": "11. Qf3 - The Wicked Witch of the West tries to defend.  Trouble is, she is worth 9 material points so alas the knight is very poorly defended.  Here gameknot analysis suggested BxN+ but I thought that NxN threatening the rook on h1 was stronger.",
        "11... Nxf2 12. Bxf4 Nxh1+ 13. Bxg3 Nxg3 14. Qxg3": "14. Qxg3 - after all this I am a R for P up.  I am very behind on development, however and Henry is looking a little draughty!  However, before attending to my queenside, Henry bravely ambles onto f8 to stop Qg7.",
        "14... Kf8 15. O-O-O Rg8": "15. ..... Rg8 - my extra rook takes control of the g file and the Witch, being of a higher unit value than the rook, must move off the g file.",
        "16. Qf4": "16. Qf4 - ah, goody, I can force a trade of queens here.  As I am still 4 points up in material, exchanging queens will be a step nearer to victory as I will have squeezed any juice of counterplay out of my opponent.",
        "16... Qg5 17. Qxg5 Rxg5 18. Nd5 Na6": "18. ...... Na6 - a developing move and a necessary one as white threatens to regain his rook.",
        "19. Bxa6 bxa6": "19. ..... bxa6 - doubled, shattered pawns, still, no matter.  That's another set of pieces off the board.  Remember, an extra rook (K + R v bare K) is enough to force checkmate in the endgame.",
        "20. Nxc7 Rb8 21. Rh1 Rxg2": "21. ....... Rxg2 - I am still 4 points up in material and have a rook on the 7th rank. This is looking really nasty for my opponent.",
        "22. Nd5 Bb7 23. Nf6 Kg7 24. e5": "24. e5 - white is not giving up, however, he is determined to get a passed pawn out of this.  However, a tactical shot forces white to trade off his remaining rook.",
        "24... Rxc2+ 25. Kxc2 Bxh1": "25. ..... Bxh1 - Like this.   Fou Leblanc swoops down on the long diagonal to read the last rites to the enemy white rook on h1.",
        "26. h6+ Kxh6 27. exd6": "27. exd6 - my opponent has got his passer but he is now a full rook down and the passer is easily contained.",
        "27... Rd8 28. d7 Bc6 29. Ng4+ Kg7 30. Ne3 Bxd7": "30. ..... Bxd7 and now the passer is rounded up.  The passer on d4 will meet the same fate should it try to advance.",
        "31. d5 h5": "31. ..... h5 - time I marched my own pawn up to Glendadom",
        "32. Kd3 h4": "32. .... h4 - onward goes the little footman.",
        "33. Ke2 h3 34. Nf1 Bb5+": "34. .... Bb5+ - forcing off the remaining minor pieces.",
        "35. Kf2 Bxf1 36. Kxf1 Rxd5 37. Kg1": "37. Kg1 - the WK tries to cut off my passed h pawn but now my rook moves in for the kill.",
        "37... Rd2 38. Kf1": "38. Kf1 - I have now worked out that it is #3 whatever white does.  I now plumb in no less than 7 sets of conditionals.  My opponent allows me to checkmate him and I gained a handy 7 points from this victory.",
        "38... h2 39. Ke1 Rxb2 40. Kd1 h1=Q#": ""
    },
    "url": "https://gameknot.com/annotation.pl/an-overwhelming-attack?gm=36364",
    "gameName": "An Overwhelming Attack",
    "players": "freestyling (1668) vs. jstevens1 (1780)",
    "opening": "KGA (C39), Kieseritsky, Kolisch defence"
}