{
    "moves": {
        "1. e4": "King pawn opening; White seizes control over the center with this strong move",
        "1... e5": "Black does the same",
        "2. Nf3": "White develops his knight while attacking my pawn.",
        "2... Nc6": "I activate mine and I protect my e pawn",
        "3. Bc4": "Italian opening; white attacks my weak f7 pawn",
        "3... Nf6": "I opt for the two knight defense. Pretty much normal so far",
        "4. Ng5": "White attacks my weak f7 pawn again, and I can't protect it properly",
        "4... Bc5": "Since I got bad results playing d4 here, I decided to play the agressive traxler variation.",
        "5. Nxf7": "? Bxf7 is better here",
        "5... Bxf2+": "I sac my bishop to bring the white king out in the open.",
        "6. Kxf2": "White accepts",
        "6... Nxe4+": "Checking the king while taking a pawn",
        "7. Ke3": "?! Now both my queen and knight are attacked, so...",
        "7... Qh4": "This move gets my queen out of the knight's attack and protects mine",
        "8. g3": "! Now I must lose a piece, as I can't protect my knight anymore",
        "8... Nxg3": "So I just sacced it to rip open white king's position",
        "9. hxg3": "white accepts",
        "9... Qd4+": "The best move here, as I keep the initiative",
        "10. Kf3": "Ke2 fails to Qxc4+ followed by Qxf7",
        "10... d5": "! Attacks the white bishop while treatening Bg4+, winning the queen",
        "11. Nxe5": "?? Although I didn't see it when I played this game, this move is met by Rf8+ (or 0-0+), which  is mate in 2 after 12. Nf7 Rxf7+ 13. Kg2 Qf2# or 13. Ke2 Qe4#",
        "11... Nxe5+": "? I give this move a question mark because I missed the mate, but it would have been less interesting.",
        "12. Kg2": "Ke2 is still met by Bg4+, winning the queen.",
        "12... Bg4": "I wonder if this was the best move. Any suggestions, readers? In any case, I develop my bishop and attack the white queen",
        "13. Qe1": "white gets his queen out of the way while pinning my knight. good move",
        "13... dxc4": "Why not? White has no Immediate threats, I restore material equality and I have a crushing positionnal advantage. Just look at white undevelopped queenside!",
        "14. Rh4": "? Pins the bishop to my queen, but nothing much else",
        "14... O-O": "!! I activate my rook into the deadly fully open f file AND I unpin my knight",
        "15. c3": "?? Loses the game in a pretty way. Nc3 is better here",
        "15... Qd5+": "!! Did you noticed that the white king is trapped in a 2x2 square box? Forced mate in 3 ",
        "16. Kh2": "?? Although every moves here loses, white has chosen the most painful way to lose",
        "16... Nf3+": "! My opponent actually resigned here at this nice royal fork, but the next moves shows how I would have finished the game",
        "17. Kg2": "The king is forced to go in the h1-a8 diagonal...",
        "17... Nxe1+": "I take his queen, with a double check",
        "18. Kh2 Nf3+": "The white king must go into the h1-a8 diagonal AGAIN!",
        "19. Kh1 Nxh4+": "I take his rook, with a discovered check",
        "20. Kg1 Qg2#": "0-1  For those who wondered, if the king tries to escape through the f file, he would have been mated quick enough by Nxh4+ Ke1 Rae8#, activating my other rook as well.\nPlease feel free to comment and rate"
    },
    "url": "https://gameknot.com/annotation.pl/an-unusual-windmill?gm=29875",
    "gameName": "An unusual windmill",
    "players": "alanmck64 (1580) vs. a_random_guy (1565)",
    "opening": "two knights defence (C57), Wilkes Barre (Traxler) variation"
}