{
    "moves": {
        "1. d4 Nf6 2. Bf4 d6 3. Nf3 Nbd7 4. Nbd2 Nh5": "White doesn't like to exchange his dsb, but I do like the open column.",
        "5. Bg3 Nxg3 6. hxg3 e5": "The counterside is black is able to play e5. ",
        "7. e4": "If he takes, I retake and nothing happens. So I get presence in the center and open the way for my lsb. ",
        "7... Be7": "I don't like this move from my opponent's part. The grip on g4 only means to exchange his dsb for my N, who'll be replaced. ",
        "8. Bc4 c6 9. Nh4": "!? The idea is threaten Nf5, pressing d6 / NxB / Nxg2+. His move is g6, but he likes his castling fortress, because on the Qside is far from become free for castling.",
        "9... b5": "No Qside castling, ok. ",
        "10. Bb3 a5 11. a4 b4": "NO problem. His own pawns are my defence. But now I \"saw\" a nice hole on c4, and I ran to occupy it without thinking. ",
        "12. Nc4 Nf6 13. Qf3": "I played this thinking that after...",
        "13... Bg4 14. Qd3": "...now I have f3, etc, kicking the B and gaining tempoes. ",
        "14... exd4": "Now, this is classic: Qxd4, c5, Qmoves... boring and... not good for me. ",
        "15. f3 Be6 16. Nf5": "It seems almost forced black exchanges one of his Bs",
        "16... O-O": "Now it is very juicy. I smell blood. ",
        "17. Qxd4": "?? I had to hold on. I \"saw\" NxB+, forcing the Q to take, following Qxd6, but I failed to see...",
        "17... d5": "The situation suddenly changes. Ne5 was probably the move.",
        "18. Nxe7+ Qxe7 19. exd5 Bxd5+": "Ups, check! I was so fool... well I can still use the tempo given by kiking the BQ. ",
        "20. Kd2 Bxc4": "It leaves me as a tangled tangler. I've fell into my own tactic-style... would I survive?",
        "21. Qxc4 Rad8+ 22. Kc1 Qe3+ 23. Kb1 c5": "Qh4, g4-g5. No time for it.",
        "24. Ka2": "R's active again. If Rd4, Qxc5. ",
        "24... Qf2": "Threatening my pawns. My opp is missing to use his N (Nd5, Ne3...) but if he moves it, he allows Qg4.",
        "25. Rh2": "Doubling the R on h whorts pawns.",
        "25... Qxg3 26. Rah1": "I still threat c5, but my intention is not to take it lightly. ",
        "26... h6": "Now: Rxh6, and Nf6 gets undefended. ",
        "27. Qxc5": "I have to use my Q. ",
        "27... Rda8 28. Qc6": "The idea is Rxh6, and if I manage to QxNf6... ",
        "28... Qe5": "Preventing it. But I have another (very bad) plan. I didn't noticed (blitz, seconds...) that b8 was defended by the Q, and I hoped to play my Q on 7th, trheatening a R, and then Bxf7+ (where RxB, QxR+).",
        "29. Qb7 Rab8": "Now I played the combination, without seeing Rg8 is defended. What a shame!",
        "30. Bxf7+ Kh7": "!? Rxa6 works? I don't think so. It's tempting. Otherwise, the initiative turns to him. It is deadly?",
        "31. Qa7 b3+ 32. cxb3": "If I take with the B, it will become an easy target, like b2. ",
        "32... Ng8": "Covering a6, just in case. ",
        "33. Bc4": "The theater is full, and the curtain up. I've spotted the combination in a second, no time to check it. ",
        "33... Rba8": "Thanks! Here it goes, and I am sure he doesn't expect it.",
        "34. Bd3+": "Rf5, QxR. But otherwise...",
        "34... Kh8 35. Rh2xh6+": "I'm pretty sure he didn't expect it. For a good player, it is easy to see. The point is Qh7# is threatened. ",
        "35... Nxh6 36. Rxh6+ Kg8 37. Bc4+": "The magic of tactics: All my major forces are threatened, but I'll give mate. A nice position for \"tactic trainer\" excercise."
    },
    "url": "https://gameknot.com/annotation.pl/an-unexpected-combination?gm=62814",
    "gameName": "An unexpected combination",
    "players": "damafi (1465) vs. chessplayerm12 (1469)",
    "opening": "Queen's pawn game (A45)"
}