{
    "moves": {
        "1. Nf3": "I adore the possibilities I have with this opening, it is really a dialogue with Black",
        "1... Nf6 2. g3 g6 3. Bg2 Bg7 4. O-O O-O": "I always heard that symmetrical play is often weak for Black, but lets see",
        "5. Nc3 d5 6. d4 c6": "Now, the fight for center control begins",
        "7. Re1 Bg4 8. Bg5": "Symmetrical game again",
        "8... Nbd7 9. Qd2": "I really want to move e4 but the bishop on g4 was a problem",
        "9... Re8 10. e4": "My plan consists on both, by making some simplifications, create some pressure in center and, by forcing Black to play under my argument reach a strong position, but it is risky",
        "10... dxe4 11. Nxe4 Nxe4 12. Rxe4 Bf5 13. Re2 Nf6 14. Rae1 e6": "? Black let me a beautiful chance to win material, but there will be a good compensation on the weakness of my castling pawn structure",
        "15. h3 Qb6 16. Bxf6 Bxf6 17. g4 Bxg4 18. hxg4 Qxb2 19. Qf4": "If attack doesn't start now the weakness of my pawns can become a problem",
        "19... Bg7 20. c4": "!Surprise",
        "20... Qb6 21. Ne5 Bxe5 22. Qxe5 Rad8": "The pressure in center was a constant from now, my pawns are in a difficult situation, but the Black rooks are a little beat passives behind the pawns",
        "23. d5 cxd5 24. cxd5 a6": "? I feel that 24. ..., Db4 was better",
        "25. Rb2 Qc5": "My bishop seems to be a good support",
        "26. Rxb7 exd5 27. Qxe8+ Rxe8 28. Rxe8+": "I'm not at all abbituate to play two rooks against a Queen, the freedom of the Queen scares me, but I have vantage on material and a strong bishop, although the pawns seems to be a problem, one af them will win",
        "28... Kg7 29. Ree7 d4 30. Rexf7+": "Who will come first?",
        "30... Kh6 31. Rfxh7+ Kg5 32. Bf3 d3 33. Rhd7 Qc1+ 34. Kg2 d2 35. Rd5+ Kh6 36. g5#": "Really nice, I guess it was unexpected, and  the fact that the pawn blocks the Queen, my pawn gives the thrust, and the bishop is in the right place at the right time was amazing"
    },
    "url": "https://gameknot.com/annotation.pl/an-unexpected-mate?gm=21011",
    "gameName": "An unexpected mate",
    "players": "chrisolve (1596) vs. lpg1963 (1641)",
    "opening": "Reti (A05), King's Indian attack"
}