{
    "moves": {
        "1. d4": "In this game I, as an exception, use the real opponent's nick, since I think that he played very well, and in fact he had a won engame when he timeoutted. I hope he will see the game, and be somewhat proud of it. He fell into a nasty trap, true, but managed very well afterwards. And \"unbalanced\" games are always interesting. ",
        "1... g6 2. Bf4 Bg7 3. Nf3 Nf6 4. Nbd2 O-O 5. e4": "All normal till here, except that black's passive game allowed me to play the two central pawns. This is not still an edge: black has no weaknesses. ",
        "5... d6 6. c3": "I could be more aggressive here, with c4. But I like the Q's opening with c3 instead of c4 just by taste. ",
        "6... Bg4 7. Bc4": "Nothing special... provided black takes care of the attack white is developing on the white squares (f7) and controls it. That's Nc6 for (if Qb3, Na5 exchanges either Q or B)! Not \"just developing\": it's preventing white's battery. ",
        "7... c6": "I'd call it a mistake: black is far too passive. c5 was to be considered... but still, Nc6 was playable. If Qb3, Na5 defends it all, even b7.",
        "8. Qb3": "Now the problem is the threat on f7 and b7 at the same time. At the same time, this unpins Nf3, which is ready to go to g5, summing to the attack. Still not a winning attack, but let's see.",
        "8... b5": "...the sharp one. Now, white has to \"demonstrate\" that he was right, but missing Ng5 - a very important tempo! - so he \"must\" go...",
        "9. Bxf7+": "...and see what arises after...",
        "9... Rxf7 10. Ng5": "I know black can defend, but this is squeezing him. The R is pinned, and against d5, NxR must be followed by KxN, exd5, with good defence by black, even losing the exchange back. ",
        "10... Qf8": "Ok, this is the problem of blitz chess: I went here, but now, what? I've not still proved white's sac was sound. NxR was just \"ok\", but nothing more. ",
        "11. h3": "Just keeping him busy. NxR I always have it, so let's see if something else arises. ",
        "11... Bd7": "Well, is either this (depriving the N of his best square) or Bc8, undeveloping! ",
        "12. e5": "I had to go on with the attack, and I hoped to found something with this move. It is probably a plain mistake, but I wanted to prevent black to unravel himself by playing d5, followed by d6 (Nxd6, BxN, QxB, Qe7, QxQ, RxQ+... (check it later!)",
        "12... Nd5": "Here I should have defended my B via Bg3, wisely. But I wanted more from the position, so I played...",
        "13. e6": "!?!?!? It seems a losing exchange, but I had in mind a trick. ",
        "13... Rxf4 14. exd7": "Now, the natural Nxd7 allows Ne6, forking Q and R. Black will have to move the Q along the column (say Qf7, the best, so to relieve the pin), and white will play NxR, recovering the lost material. It would have been the best possible outcome for B, since otherwise...",
        "14... Rxf2": "The Q can't move from the 1st rank (or d8=Q+, winning!), and Nc7 can't be played (it's pinned!). This is not good because of...",
        "15. Ne6": "...and the BQ is lost! White will win a Q for a N as the least. Check it yourself! :-). Re2+, KxR, Nf4+, NxN+, Kh8, Ne6! and black has the same exact problem!",
        "15... Nxd7": "Incredible, isn't it? This is actually black's best. ",
        "16. Nxf8 Raxf8": "Well, white is +2, but this is not a \"gimme\". From here, the game (spoiler) loses interest as I started with some silly moves, without realizing that g4 was called for (but then Bh6 was unconfortable). ",
        "17. c4": "?? This move removes the pin, but covers e3 in return. But in fact, almost loses the game!",
        "17... bxc4": "The best, as far as I can see. Bxd4 loses the N. ",
        "18. Nxc4": "?? I just blundered, thinking that if Qxc4, Rxb2 was annoying. All that proving that the c4 plan was bad from the start. This simple mistake actually loses the game for white! ",
        "18... Bxd4": "Ouch!",
        "19. O-O-O": "Desperately. ",
        "19... Nc5": "Good! Now my pin will be lost. I can go to Qg3, or Qa3. All very likely to lose to some combination over my K... except if I play again with tricks:",
        "20. Rxd4": "Sac the Q for two minor (and very active) pieces!",
        "20... Nxb3+ 21. axb3": "Now I am \"-2\" instead of +2. I felt I was left nothing to work with, and that this was a lost engame! ",
        "21... Rxg2 22. Na5": "Only resource: c6 can't move while the N is there. But there is no hope: with accurate play, black should just win... Rf-f2 is crushing for white. "
    },
    "url": "https://gameknot.com/annotation.pl/an-unusual-trick?gm=59956",
    "gameName": "An unusual trick.",
    "players": "damalfi  vs. giordani_1 ",
    "opening": "Modern defence (A40)"
}