{
    "moves": {
        "1. e4 e6 2. Nc3 d5 3. d4 c5": "The opening, a French, has given white a clear advantage on move 3. The best way to avoid these material losing moves is to use step #4: I hope you are already doing it.",
        "4. exd5 exd5 5. dxc5": "Now my move discovers an attack, and wins a pawn.",
        "5... Bxc5 6. Qxd5 Qxd5 7. Nxd5": "Although I have told you step 1 is what is my opponent threatening? Here I will ask you to change it to what is EVERYThING my opponent intends to do on the next move, if given the chance. White threatens to fork, although he is capturing a queen at the same time.",
        "7... Ne7 8. Nc7+ Kd7 9. Nxa8 Rd8 10. Bf4": "White has already a winning position. ",
        "10... Nbc6 11. O-O-O+ Ke8": "Since the major part of the game is over, I will share some very important concrete advice. Although the direct rules are less useful than general understanding, I believe these rules/principles are the MOST important in chess, and you can use them to help you find the best move in many positions.",
        "12. Nc7+ Kf8 13. Rxd8+": "Principle of Neutralization: States that we should decrease the opponent's activity if we can. Right now, white forces the knight to go back, decreasing its activity. ",
        "13... Nxd8 14. Nf3": "Principle of Greatest/Maximum Activity. We should always, if we can, make moves that increase the activity in our own position by the maximum amount possible. Therefore, moving pieces that are inactive to more active squares will help. Obviously, a ver weak piece going to a great square is the best.",
        "14... Bxf2": "Principle of material: If we can take a material, we should do it. That is a principle however, and principles tell us only moves we should put into our candidate moves, not play them immediately. For example,you could take a pawn and let your opponent destroy your position. You will put taking the pawn on the list, but after you see that it destroy's your position, you will reject it. This is not the case here, by the way. I am just stating an important fact. By the way, when considering taking material, and you arrive at a n unclear line which is not really that bad,but not so good for you, just always take the material if you are sure you analyzed correctly. Many players try to see deeper, thinknig about all sorts of things; This just confuses them and they have doubts about the position and their understanding of it. If anything is unclear, always go for your instinct: Your instinct is to play the unclear line, since you decided to look at it. If it is an unclear dubious line, then maybe you should not play it.",
        "15. Bc4 Nf5 16. Rd1": "Principle of attack: If we can increase our activity while forcing the opponent to decrease his own activity, we should really consider it.",
        "16... Nc6 17. Rf1 Bd4": "principle of fear- In positions that are messy and complicated, we should not feel scared(We will, but we should not let thaat affect our moves). Just always use your calculation and thought process in those positions, and always try to make attacks if you can. Making attacks will scare your opponent, who may blunder.",
        "18. Nxd4 Nfxd4 19. Bd6+ Kg8 20. Rxf7 Be6": "Principle of not playing the best move:)- When you are in a very bad position, it is better to play \"Hopeful Chess\" than to play the best move. Here, you can play a tricky move, hoping your opponent to make a blunder letting you back in. If he finds the best move, it does not matter. What matters is that you give him the greatest chance to slip up.",
        "21. Rf8#": "These were some very important prcincples. I hope you can try to apply them in your games and get some results with them."
    },
    "url": "https://gameknot.com/annotation.pl/analysis-training-game-with-advice?gm=45118",
    "gameName": "Analysis: Training Game with advice.",
    "players": "Me  vs. AncientBeast ",
    "opening": "French (C00), Pelikan variation"
}