{
    "moves": {
        "1. e4": " Decided to comment on this game of 2 strong openents, one of which I am currently playing. standard white opening e4",
        "1... e5": "black blocks e5 as expected",
        "2. Nf3": "I chose to view this game because it is played by strong players who can help me to learn how to play better chess. knight to f3  seems standard to put pressure on the middle ",
        "2... Nf6": "black counters with f6.",
        "3. Bc4": "bishop out to c4",
        "3... d6": "pawn to d6 seems to protect the middle pawn position of e5",
        "4. d3": "white matches pawn to d3",
        "4... Bg4": "black brings out bishop to g4  preventing whites knight to move or the queen would be open to attack.",
        "5. h3": "simple defence white brings pawn to h3 to pressure the knight.",
        "5... Bh5": "black knight retreats  to h5",
        "6. g4": "now white brings pawn to g4 to pressure the knight more and seems to have used the baseline pawns to the point of not being able to castle on the king side. Guess time will tell how this will work out.",
        "6... Bg6": "knight has now retreated back in 3 moves to g6 while white has opened up their king side. Looking at the white pawns, they seem to have a good position.",
        "7. Bg5": "white brings out the bishop to g5 to pin down blacks knight which is in front of the black queen. Seems what comes arround comes arround to now put pressure on black just as black attempted.",
        "7... Be7": "black simply brings bishop to e7 to open the black knight for movement and at same time protects the queen",
        "8. Nc3": "white brings out knight on the queen side to b3. Looks as though white will be able to castle on the queen side soon.",
        "8... Nbd7": "bishop to d7 in front of the queen. This seems  not to be a better move than to c6. I'm not sure why? Will have to see how this pans out. I might of chosen c6 to allow the space in d7 to remain open for my queen. I do like the flexibility of not having to castle so quick that you have not telegraphed your play to the openent. I do think the queen will be out and eventually make black the ability to castle on the queens side.",
        "9. Qd2": "white brings the queen to d2. While black has not committed to castling on the queen side white seems to only have this choice in order to have the best defence.",
        "9... h6": "black pressures white bishop by bringing out pawn to h6.",
        "10. Bxf6": "White takes the bishop on f6 instead of retreating to e3. I think I would have retreated and not given away my bishop for blacks knight. Will have to see how this effects this game play.",
        "10... Nxf6": "black knight moves from d7 to take the bishop on f6. Looks like a good trade by black. This also has the d7 spot open now.",
        "11. O-O-O": "white castles queenside with white queen on d2.",
        "11... h5": "black advaces pawn to h5.",
        "12. g5": "white pawn passes by blacks pawn on h5 and pressures blacks knight on f6. ",
        "12... Nh7": "black retreats the knight to h7 in front of the rook.",
        "13. h4": "white sends pawn to h4 to stop further advance of blacks pawn on h5.",
        "13... f6": "black advances pawn to f6 ",
        "14. gxf6": "white takes pawn on f6.",
        "14... Bxf6": "black takes pawn on f6 with bishop. I do not like the alignment of blacks bishops each looking towards whites king. They are blocked by white pawns on d3 and e6 and the black squared bishop is blocked by its own pawn on e5. ",
        "15. Nd5": "white brings out knight to d5.",
        "15... Rf8": "black moves rook to f8.",
        "16. Rdg1": "white moves rook to g1.",
        "16... Bf7": "black moves  white squared bishop to f7 to pressure white knight on d5. HAVE TO STOP FOR NOW WILL CONTINUE WITH THIS GAME SOON",
        "17. Nxf6+ Qxf6 18. Ng5 Nxg5 19. hxg5 Qg6 20. Bxf7+ Qxf7 21. b3 g6 22. Rgf1 O-O-O 23. Rh4 Qg7 24. Qe3 Kb8 25. Kb1 Rd7 26. f4 Rdf7 27. c3 exf4 28. Rhxf4 Rf7xf4 29. Rxf4 a6 30. Kc2 Qe7 31. d4 Re8 32. Rf6 h4 33. Rxg6 d5 34. e5 Qh7 35. Qd3 Qh5 36. Rg7 h3 37. Rh7 Qxg5 38. Rxh3 Rf8 39. Rh2 Qg1 40. Qd2 Ka7 41. Kb2 Kb6": ""
    },
    "url": "https://gameknot.com/annotation.pl/andonov_99s-mini-tournament-ii?gm=44010",
    "gameName": "andonov_99's mini-tournament II",
    "players": "janse133 (1547) vs. ruiz80 (1647)",
    "opening": "Petrov (C42), Italian variation"
}