{
    "moves": {
        "1. e4 c6 2. f4 d5 3. Nf3 dxe4 4. Ng5 Nf6 5. Bc4 e6": "I still look foward to the day I get to play the Bg4?! line in a proper game.",
        "6. Nc3 Qd4": "Blacks trying to hold on to the extra pawn. As it can't be done I suspect this is a bad move.",
        "7. Qe2 b5 8. Bb3 Bd6 9. g3": "practially forced. I suppose Rf1 was also possible. but as I plan on either castling queenside or not at all this isn't too big of a problem yet.",
        "9... O-O 10. Ngxe4 Be7 11. d3 Nbd7 12. Be3": "Blacks queen only had one square to go to so I figured this gains tempi. However I wonder if a3!? was worth a look. The point being it threatens to win the queen. Black would have to respond to the move so it might even be a tempo gaining move.",
        "12... Qb4 13. a3": "?! the queen wasn't really doing much so perhaps my time was better spent either attacking blacks kingside or castling long.",
        "13... Qa5 14. g4 Nd5 15. O-O-O": "probably better was Bd2.",
        "15... b4 16. axb4 Qxb4 17. Bd2": "Maybe that would have been a good square to keep open for my king and the time would have been better spent attack  whites castled position. On anyhand my bihops was being attcacked by the knight so maybe this is alright.",
        "17... Qb8 18. f5": "attcking",
        "18... Nc5 19. Nxc5 Bxc5 20. Ne4 Bb4 21. h4": "gambiting a pawn for the sake of opening lines to the black king. I figured that removing my g pawn would allow my rook to face the king without as many obstacles in it's path.",
        "21... exf5 22. gxf5 Bxf5 23. Rhg1 Bxd2+ 24. Rxd2": "In case I wanted to double up rooks. It also eliminates any annoying checks black might have throwing into the mix.",
        "24... Kh8": "! removing any checks and giving the king a more stable position.",
        "25. Qg2 Rg8 26. Bxd5 cxd5 27. Qg5 Bxe4 28. dxe4 dxe4 29. Rd7 Qf8 30. Qd5 f5 31. Rf7 Qd8 32. Qxf5": "I was temtped to play Qe5 during the game and looking at it now it seems that Qe5 was a much better move. But this was blitz and I didn't want to spend too much time working out if it was better or not.",
        "32... Qxh4 33. Qe5 Rae8 34. Qd4 Qh6+": "! an important inbetween move.",
        "35. Kb1 e3 36. Qxa7 e2 37. Qa5 Qe3 38. Re1 Red8 39. Rc1 Qxc1+ 40. Kxc1 Rd1#": "Maybe I missed a few things and play was far from accurate. But I thought it was interesting for a blitz game. What does the reader think?"
    },
    "url": "https://gameknot.com/annotation.pl/another-dodgey-opening?gm=41378",
    "gameName": "Another dodgey opening",
    "players": "thereaper1  vs. opponent ",
    "opening": "Caro-Kann defence (B10)"
}