{
    "moves": {
        "1. d4": "When I opened with 1.d4, Freddy offered me a couple of Marshall's more obscure gambits to explore.  I liked the look of his gambit against the Tarrasch Defence, so here we have it.  Freddy sent me the wikipedia reference too: http://en.wikipedia.org/wiki/Tarrasch_Defense#Variations, which, oddly enough, doesn't mention the Marshall Gambit.",
        "1... d5 2. c4 e6 3. Nc3 c5": "The defining feature of Tarrasch's Defence.",
        "4. cxd5": "White's most active response.  In my previous two games against the Tarrasch, I'd tried 4. e3 and 4. Nf3, losing both, so I had nothing to lose by taking the game to Freddy.",
        "4... exd5 5. e4": "Marshall's Gambit",
        "5... dxe4 6. Bb5+": "Gameknot's database is already exhausted.  This is Simon Williams's move from the World database.  Williams is one of Britain's most aggressive players.",
        "6... Bd7": "Freddy departs from the Williams game, so now we're on our own.  This move is a direct challenge to White's aggression.",
        "7. Bxd7+ Qxd7 8. d5": "Another pawn move doesn't further White's development, so seems to be sightly counter to the spirit of the gambit, but the pawn is hard to defend on d4 and capturing on e4 would expose my N to a nasty pin.  Capturing c5 would merely help Black develop his B.",
        "8... Nf6": "Black immediately develops his KN and attacks White's advanced pawn.",
        "9. Qe2": "Indirectly defending the d5 pawn by attacking the e4 pawn.",
        "9... Be7": "Black continues with sensible development.",
        "10. Bf4": "Freddy queried this, suggesting that 10. Bg5 was stronger.  I expalined that I thought it would lead quickly to a swap of Bishops.  I preferred to keep them on and was hoping for a chance to hit c7, with forking opportunities, not that I expressed such a naive thought to Freddy!",
        "10... Nxd5": "Black tidies up the centre and attacks White's B",
        "11. Nxd5": "I thought this was a better option than 11. Qxe4 Nxc3 12. bxc3, when White's c-pawn looks very vulnerable",
        "11... Qxd5": "Black dominates the centre, and now has a two pawn advantage.",
        "12. Nh3": "So White is forced to develop his knight on the edge (or could have moved his Q again to make room for it - not helpful)",
        "12... Nc6": "Whereas Black can develop his knight centrally, improving his hold on the centre.",
        "13. O-O": "At least White can castle now.",
        "13... O-O": "As can Black",
        "14. Rfe1": "White seeks to win back a pawn and contest the centre.",
        "14... f5": "So Black reinforces the dominant e-pawn.",
        "15. b3": "White prepares to centralise the QR by blocking Black's Q's attack on a2. White can't afford to give away any more pawns carelessly.",
        "15... Rad8": "Black centralises his QR first",
        "16. Rad1 Nd4": "and then rather than tamely retreating the Q from its optimal square, blocks the attack with a counter-attack by a superbly centralised knight.",
        "17. Qf1": "White opts out of the exchange, retreating the Q to a defensive square but still maintaining the defence of the Rd1.  ",
        "17... Bf6": "Black improves his B, controlling the long black diagonal, if the knight moves.  Since the knight can move with check, it isn't really pinned against the Q, if Black can exert extra control over e2 or f3 or create extra pressure on d1 by doubling his rooks.  Black has plenty of attacking options, not to mention pressing forward with his pawns.",
        "18. Be3": "That knight must be repelled.  The B also makes room for White's knight to occupy f4, attacking Black's Q.",
        "18... Rd7": "As forewarned, Black prepares to double his rooks.",
        "19. Nf4 Qf7 20. Rd2": "White also prepares doubling.",
        "20... Rfd8 21. Red1": "At this point, Freddy complimented me on my play, observing that I appeared to have learned some chess principles.",
        "21... b6 22. Kh1": "So I promptly played a sub-optimal move.  It was hard to find anything constructive, so I played a waiting move that took the King out of the N's range.  In our chat, I think Freddy suggested 22. Qc4 or 22. Ne2, both of which contest the centre.",
        "22... g5": "Black seizes the initiative with this bold pawn push in front of his king.  White is in no position to exploit any consequent weakness at the rear.  The wall of pawns is ready to roll.",
        "23. Ne2": "Now Ne2 is a meek retreat rather than a counter-attacking move.",
        "23... h6": "Black has time for this consolidating follow-up, also releasing the B from the task of defending g5.",
        "24. Nc3": "Swapping on d4 with the N looked unattractive as it would have trapped my Be3 when Black recaptured with the c-pawn.  Swapping with the B was marginally preferable but again the pawn wall would have been formidable.  By moving to c3, the N frees up White's Q slightly and escapes the advancing wall of pawns, at least for now.",
        "24... Be5": "Because White hasn't attacked anything in his position, Black has another free move to improve the position of one of his pieces, attacking h2, so I should have expected Black's follow-up...",
        "25. Nb5": "? As Freddy commented, the Q is required for the defence on f1, so inviting a swap that sends her to Outer Mongolia on b5 is daft.",
        "25... Nxb5 26. Qxb5 Qh5": "! Because of the threat of mate in one, White has no time to exploit the superior weight of numbers attacking d7.  I'd overlooked this riposte.",
        "27. g3 Bxg3": "! also unexpected.  Black jemmies open White's position.",
        "28. fxg3 Qf3+": "Black's 27th wasn't a real sac as White's B is now forked.  White's rooks look sick now.",
        "29. Kg1 Qxe3+ 30. Kg2 Rd7xd2+ 31. Rxd2 Rxd2+ 32. Kh3": "This doesn't help White prolong the game meaningfully. ",
        "32... g4+ 33. Kh4 Qg5#": "33....Rxh2++ would have done just as well."
    },
    "url": "https://gameknot.com/annotation.pl/another-lesson-from-freddy?gm=26352",
    "gameName": "Another lesson from Freddy",
    "players": "rjacobs (1530) vs. easy19 (2266)",
    "opening": "QGD (D32), Tarrasch defence, Marshall gambit"
}