{
    "moves": {
        "1. d4": "She starts conventionally.  In fact, in the recent course that I took, there's another opening I learned called the London System which starts off with 1.d4, e6 2.Nf3, d5 3.Bf4  There are other moves that go into it that, but I'm alluding to the main variations, and of course there are others that can transpose into this.  I also learned about the Colle's Franketort System from her which I've tried myself.  So, I'm not surprised to see her play this because it appears to fit her style the best.  And, Susan said, in the second course, to play the opening that you're most used to since there's no opening that automatically wins.",
        "1... d5 2. c4 e6": "Not my surprise, it's a QGD which is how respond to the QG.",
        "3. Nc3": "Susan develops right away.",
        "3... Nf6": "So does Vladimir.",
        "4. Nf3": "Continuing with her development.",
        "4... c6": "This has now transposed into the Semi Slav Defense.",
        "5. e3": "Opening up a line to develop her Bf1, which we typically see in the Colle's System.",
        "5... Nbd7": "Continuing with his development, and at the same time, this allows Vladimir to bring that a N to a better outpost.  Specifically, to b6, sooner or later.  And, if attacked, it can go to a5.  Perhaps, he might even decide to take on c4 which if it were playable now, he'd be a pawn up.",
        "6. Bd3": "Continuing with her development.  After which, Susan will exchange pawns to prevent the loss of material, as I was alluding to earlier with blacks d7, when talking about better outposts.",
        "6... dxc4 7. Bxc4 b5": "Kicking her Bc5.  My guess is that Vladimir thinks that he's gotten a space advantage.  I say that because of something that white mentioned in the London System works which involves a bad move.  But, black kicks, I believe the N because he or she feels that they've gotten tempo, as well as, a space advantage.  In reality, it becomes a blunder because of what follows.",
        "8. Be2 Bb7": "Continuing with his development.",
        "9. e4": "The intent is to kick the N.  But, I believe that Susan is also trying to trick Vladimir into playing 9...c5, after which would come 10.e5 and when the N moves, white would, I believe, mess up black's pawn structures by taking on c5  I say this because that's how I sometimes think.  It's not in terms of unsound aggression, but I recently did something like this in a team game which worked.  After losing one game by failing to ask myself if I could be mated again (which is a basic rule) since I, somehow, made the board too small to analyze by pushing the wrong button, I asked how I could change the outcome for the next team game.  Now, I made a blunder, and he could've won material.  Keeping in mind what Kenneth_fiore_3 told me towards the end of our training game, combined with, what happened on Friday with Jack Stockel where he yelled at me because of a terrible blunder, I displayed Hope Chess.  I was just hoping that my opponent would overlook a check because one of his pawn was pinned.  Despite being +1, he almost got the advantage back by threatening to win back R for N with check.  But, I was just hoping that he'd miss it by going back and forth with by repining the pawn repeatedly until we reached a draw by repetition.  Unlike with the game against Ken, it worked, so I felt that I learned a bit from my mistake on Friday.  Therefore, I'm applying a similar concept here with Susan, except that this is not Hope Chess.  But, I think that white's hoping that she can take advantage of black.",
        "9... b4": "It does not work, however, since Vladimir kicks the Knight.",
        "10. e5": "Likewise, Susan kicks his N.  And, this is already turning out to be interesting and very unusual.  In fact, like the game that I pointed out in the intro, both sides are going to promote which is going to leave us with 4 Queens on the board.",
        "10... bxc3 11. exf6 cxb2 12. fxg7 bxa1=Q 13. gxh8=Q Qb1": "I'm not sure why this was played, but my guess is that with two Queens on the same diagnol, white must have had a threat that players like me don't see.  So, black responds by moving.",
        "14. O-O": "Which allows Susan to castle.",
        "14... Qf6": "Knowing how dangerous Susan's promoted pawn is, Vladimir attempts to exchange.  To my surprise, it works.  I say that because as white, instead of 15.Qxf6, I would've played 15.Qg8 to prevent the exchange.  That's because I felt that my opponent would have no choice.  Therefore, I believe that Susan feels the same way about his Queen which is why she would accept an exchange.",
        "15. Qxf6 Nxf6 16. Ne5": "Bringing her N to a better outpost.  But, it's also because, as I learned from bhidragon, in regards to figuring the entire story that the board's telling me, it appears that Susan is attempting to organize her Queen, Be2 and the N on the K side which would leave black with an overwhelming attack.  It's also safe to infer, based on the London System course, that white's a2 is a poison pawn.  In that course, there was a variation where if you took the pawn right next to it with the Queen, as black, you'd lose your Queen, or at the very least your Rook.  And, that was so important that she reiterated that in the very last chapter.  Therefore, it must apply here because when Vladimir takes, Susan will restrengthen her Be2 against the K side.",
        "16... Qxa2 17. Bc4 Qa5": "Trying to stop an attack like that, Vladimir tries to stop that by bringing his Queen to the fifth rank.",
        "18. Qf3": "In my opinion, however, it's too little, too late since the f file is now weakened.  Forget about attack and tempo gain.  I think that we're dealing with a masked battery against black's King. ",
        "18... Be7": "I say that because of this move where Vladimir protects his Knight.  But, Susan adds more pressure with her Bc1.  In doing so, the N is now attacked twice.  There, however, is more to this story then meets the eye.  That's because when black defends again, white will, at the very least, win a pawn.",
        "19. Bg5 Qd8 20. Bxe6 fxe6": "?? As black now takes back.  Even though it's between much stronger players, and two quieries like this are not usually in place, I go by what was said on the other site.  Starting on Susan's next move, Vladimir's position is lost.  So, they're implying that this is losing blunder.  And, after white recaptures, black will also take back as Vladimir feels that he has the initiative due to being the equivalent of a pawn up.  But, what I noted here is also applicable that the masked battery against the K and added pressure was a lot for black to handle which was going to make things difficult, as is.",
        "21. Bxf6 Qxd4 22. Qh5+": "For a while, I had no idea why Vladimir resigned.  Then, I read those comments which explains it all.  There are three moves for black, as we know.  But, nothing is going to save him.  That's because he's either going to be mated or will lose his Queen without compensation.  And, this is where they also implied that 20...fxe6?? was the losing blunder.  That was because it was posted that after 21.Bxf6!, black's position was beyond saving because of the overwhelming attacks.  That makes sense to me, believe it or not because had black tried anything else, besides taking back, he's down the equivalent of a piece for pawn which is not enough against someone of this strength.  In general, it boils down to just one or two pawns which is how a GM wins, anyhow."
    },
    "url": "https://gameknot.com/annotation.pl/another-4-qs-variation?gm=61759",
    "gameName": "Another 4 Q's variation",
    "players": "Susan Polgar  vs. Vladimir Dimitrov ",
    "opening": "QGD semi-Slav (D47), Meran variation"
}