{
    "moves": {
        "1. e4": "Hi everyone!\r\n\r\nThis game was viewed as a success because although it is a draw on paper, any Expert Draw is a moral victory, at least at the moment!  The Petrov starts off as 1. e4 e5, Nf3 and then Nf6 instead of the usual Nc6.  The Petrov has been discussed a little more in my previous annotation against dtdominates in which I won.  So we pick up the action from move 5 where Dave deviated from that game with Nc3 instead of d3.",
        "1... e5 2. Nf3 Nf6 3. Nxe5 d6 4. Nf3 Nxe4 5. Nc3": "5. Nc3 - in my previous Petrov game dtdominates played 5. d3 - he went on to lose that game.  This knight move leads to a trade of knights on c3.",
        "5... Nxc3 6. dxc3": "6. dxc3 - Dave captures with the d pawn rather than the b pawn.  Dave is planning to put his queen, the Wicked Witch of the West on d5 and so this pawn recapture opens up the d file for that purpose.",
        "6... Nc6 7. Bb5 Bd7 8. O-O Be7": "8. ...... Be7 - solid development here.",
        "9. Re1 O-O": "9. ..... 0-0 - time for Henry to be tucked away on the kingside and sidestep a potentially nasty pin down the e column.  However, here comes ......",
        "10. Qd5": "10. Qd5 ...... the Wicked Witch of the West, ssss!  I think she is now planning to fly over to h5 to bear down on my h7 pawn, nasty nasty!",
        "10... a6 11. Bd3": "11. Bd3 - preparing a Q and B line-up on the b1-a7 diagonal.  Soon Henry will be in Old Matey's shadow.  That Chessic Grim Reaper's favourites are back ranks, corridors and inadequately defended pawns in front of Henry!",
        "11... Bf6": "11. ..... Bf6 - I may well be forced to play g6 to ensure that the Q and B bite on granite.  As this will make g7 weak in front of Henry, Fou Lenoir is badly needed to take the g pawn's place.  If Henry is to have a prayer against Dave then he really does need a prelate!",
        "12. h4": "12. h4 - pawn roll - is this the beginning of a kingside pawn storm?  I hope not.",
        "12... Be6 13. Qe4 g6 14. Bg5": "14. Bg5 - Dave stops Fou Lenoir from occupying g7 with a pin against Glenda.  I do decide to trade bishops.  At least the Witch will not have assistance from the dsb if the bishops are exchanged off.  Still, Glenda isn't too far away, I can see her trying to get just a little nearer to her other half very soon.",
        "14... Bxg5 15. Nxg5 Bf5": "15. ...... Bf5 - I now decided to force an exchange of lsbs to try and blunt Dave's mating attack still further.",
        "16. Qf4 Bxd3 17. cxd3 Qd7": "17. ..... Qd7 - Glenda moves off the back row to connect my rooks.  She also defends my f7 pawn should I try and exchange rooks on the e column to stop the Witch from having any assistance from the white rooks in her quest to nab Henry.",
        "18. d4 Rae8": "18. ..... Rae8 - following through with my plan mentioned in my last note.",
        "19. Ne4": "19. Ne4! - Yikes, a family fork is threatened on f6, omigod how can I avoid this??!  Aaah, yes, by playing f5.  Wheeew! This move stops the fork as the f6 square is covered by the rook on f8.",
        "19... f5 20. Ng5": "20. Ng5 - the final destination for this knight.",
        "20... Rxe1+ 21. Rxe1 Re8 22. Rxe8+ Qxe8": "22. .... Qxe8 - the rooks have been traded as planned.  Now Dave tries to undermine my castled position still further.",
        "23. h5 Nd8": "23. ...... Nd8 - to prevent knight ingress via e6 should the queens get traded off.",
        "24. hxg6 hxg6 25. Qh4": "25. Qh4 - threatening Qh7+ - Glenda is alert and moves to e7 to cover h7 and pin that pesky knight on g5 - notice that the Wicked Witch is currently undefended.",
        "25... Qe7 26. d5": "26. d5 - Dave plays this tempting move but with that pawn no longer covering e5 I can now force a queen swap to eliminate forever the threat of Qh7+.  Glenda performs a neat little zig zag on her broomstick before she trades in her life for that of the Witch.",
        "26... Qe1+ 27. Kh2 Qe5+ 28. f4 Qh8": "28. ..... Qh8 - the trade is forced because the Witch is pinned to her king!",
        "29. Qxh8+ Kxh8 30. Kg3": "30. Kg3 - Dave tries to improve the position of his king for the coming endgame.",
        "30... Kg7": "30. ..... Kg7 - Henry tries to improve his position and moves towards the central columns.  This will give him some flexibility whichever way Dave chooses his line of attack to defend adequately against it.",
        "31. Kf2 Kf6 32. Ke3 Ke7": "32. ..... Ke7 - here I decided to put the question to Dave in the form of a Draw Offer.  I thought I had done enough to keep him out.  Dave thought so too and accepted my Draw Offer.  After the acceptance of the Draw Offer I did request Computer Analysis.  Gameknot assessed the position as: Score: -0.64 which meant the position was slightly in Dave's favour so the Draw Offer was a good call.  Interestingly enough Gameknot did not flag up either side's moves in yellow - so no blunders, mistakes or even innaccuracies - this was certainly very encouraging for me!  Soon it will be my turn to play against the Petrov against Dave and it will be very interesting to see how I get on there.  Anyhow - time to bask in this latest success - cheers and bye for now - Joanne.\r\n\r\n \r\n \r\n",
        "33. b4": "Master Freddy now had this to say about the game:- It looks drawish but at such a point I never would agree to a draw - so lets play on where your opponent left on the analyze board to see if i can break this joblock...\"  So he continues the game with 33. b4. ",
        "33... Kd7 34. Nf3 Nf7": "34. ....... Nf7? - In his pm, Freddy said this move was a mistake \"Considering the end game tactics c6 would have been better then Nf7.\"  OK - I played Nf7 because I wanted to keep the white knight out of g5. ",
        "35. c4 Ke7 36. Nd4 Nd8 37. a4 Kd7 38. a5 c6 39. Nf3 Nf7 40. Nh4 Nh8 41. Kd4 Kc7 42. dxc6": "42. dxc6  - Freddy then asked \"Do you feel the presure building?\"  I think at this stage Freddy is gonna try and re-arrange my pawn structure on the queenside.  It doesn't really help that my knight has been forced to h8 to defend the pawn on g6.  This is one of the Master Mater's main Modus Operandi, to create threats on both sides of the board and ensure that only one can be dealt with!",
        "42... Kxc6 43. g3 Kd7 44. Kd5 Ke7 45. c5 dxc5 46. Kxc5": "46. Kxc5 - with the d pawn gone it is gonna be much easier for Freddy's king to go p(r)awn hunting and munching!",
        "46... Kd7 47. Kd5 Ke7 48. Nf3 Nf7 49. Ne5 Nxe5": "49. ...... Nxe5 - not sure I have anything better here but due to the position of the two kings, Freddy will have the opposition and put me in a big zugzwang.",
        "50. Kxe5 Kf7 51. Kd6": "51. Kd6 - here is an excerpt of a pm I sent to Freddy \"Ok, white wins, I cannot prevent the queenside pawns be gobbled up by your king. Here is a sample analysis. 51. Kd6 Kf6 \r\n52. Kc7 g5 \r\n53. Kxb7 gxf4 \r\n54. gxf4 Kg6 \r\n55. Kxa6 Kh5 \r\n56. b5 Kg4 \r\n57. b6 Kxf4 \r\n58. b7 Ke4 \r\n59. b8=Q \r\n\r\n\r\nWell played Freddy! "
    },
    "url": "https://gameknot.com/annotation.pl/another-success-with-the-petrov?gm=31216",
    "gameName": "Another Success with the Petrov!",
    "players": "dynamic_dv (2158) vs. jstevens1 (1825)",
    "opening": "Petrov (C42), Nimzovich attack"
}