{
    "moves": {
        "1. e4": "Standard opening.",
        "1... c6": "Normally, I would respond with the Sicilian Defense but not this time because of what I noted earlier.",
        "2. d4": "If this game was played a year or two ago, I wouldn't understand why someone would move here, as opposed to, developing another piecs.  But, now it makes perfect sense.  This is also a developing move as it opens up lines for his other bishop (in this case, his DSB.)",
        "2... d5": "So, I decide to do the same thing.  Since I don't know the continuation of the Karo Can after 1...d5, I decided to do something different and unusual.  For me, this is actually unheard of.  It's a case of copy what your opponent does in the opening.  And, by that, I'm alluding to the move.  Since he moved his d pawn, I was going to do the same thing.",
        "3. Nc3": "So, he decided to continue development.  But, this time, I am actually going to exchange my pawn with his pawn.  The reason being is that since everything is even, I enjoy going into early exchanges with much stronger opponents.  Believe it or not, this prevents me from feeling overwhelmed, and being overwhelmed has triggered a, \"Fight or Flight\" response in some of my games, causing me to move way too quickly.  Exchanging, however, actually gives me more confidence and optimism then I need.  So, I essentially get a very good game from that, on a normal basis.",
        "3... dxe4 4. Nxe4 Nf6": "So, I decide to develop my other N.  This time, however, he will just an exchange. ",
        "5. Nxf6+ exf6": "!? Better was to take back with 5...gxf3, the reason being is that this move puts a whole around my K and makes me very vulnerable to a King exposure.  So, I, \"better be careful from now on\", as someone once said.  Otherwise, black will get into a lot of trouble.",
        "6. c3": "I don't know why white played this, as opposed to, developing another piece.",
        "6... Bd6": "In the mean time, I will develop even more.  This is one of the only spots for black to develop.  The only other choice would have been ...Be7.  The only thing is that both of them block his own center since the e and f files are considered center squares.  But, in this position, it's well worth the effort, as I'm getting ready to castle.  In fact, as we're about to see, this what black will do immediately.  The reason I'm even more obsessed about this then normal is because of what I noted earlier.  Right now, my K is vulnerable, but that vulnerability will end, once I tuck the monarch away.",
        "7. Bd3": "So, he's now continuing with development.  The only thing is that, unlike black's position, my opponent could have placed his LSB on a different square.  So, just blocked his center.  Had he found a different place, away from the e or f files, there would be no comprises on whites center.",
        "7... O-O": "Meanwhile, I will waste no time castling because of what happened on black's fifth move.  So in other words, this an error.  Here's the thing, in chess one of the goals is to figure if you've made an error, and if so, it's about correcting your mistake.  In fact, this is why Jack Stockel would say, \"Try to figure out a way out of trouble.\"  This is a good example.",
        "8. Qc2": "Unless there's something I'm missing, there is nothing for white to worry about.  And, there's no way for him to win material, yet.  So, I don't know why my opponent decided to bring his Q out before everything else was developed.  Because of that, I feel that he now has a weakness which I will try to take advantage of, if possible.",
        "8... Re8+": "It starts off by putting him under pressure with this check.  At first, actually thought that this move would take away his castling rights and possibly expose his K.  Although I was incorrect, there is absolutely nothing wrong with this move.  Since I will still be able to continue developing without any compromises on my position, then there's nothing for me to be worried about.  ",
        "9. Ne2": "A good and developing way for white to get out of my check.  So, at least this didn't pressure.  Therefore, what else can I do to make him feel pressured and create the, \"Fight or Flight Syndrome\" for white?  Well, I don't know yet, but I will figure out a way to do that. ",
        "9... Bg4": "So, I decide to start by attacking his N.  That's because I kept in mind that it's already pinned by my R.  Since I'm not completely sure, my goal is to create a weakness for white in order to take advantage of it.  It starts with my attempt to make him feel stressed.  However, what I overlooked is his LSB.  This time, it's not a problem, but it prevents me from achieving my goal, at least for now. ",
        "10. h3": "Therefore, this is how he responds.",
        "10... Bh5": "But, I just find the best retreat square.  How do I know?  Well, I have studied this kind of position before with Jack Stockel where his or my B get attacked, like this and in the same way as now.",
        "11. O-O": "Meanwhile, he doesn't waste anymore to castle.  Unlike before, however, I will exchange his N for my B.  Right now, his Knight is worth more then my B because it's strong.  Since it's no longer pinned, it can do a lot of damage.  I know because I analyzed the situation and have seen this kind of position with Jack Stockel.  In fact, about two years ago, this is how I lost a game against my coach.",
        "11... Bxe2 12. Bxe2 Qe7": "After all was said done, now my goal is to win his LSB which is why I played this.  So, how did I come up with this move?  Well, I studied a game between GM's Judit Polgar and Anand.  In that game, Judit won.  One way she did this was also putting pressure on the e file.  By doing this, she prevented her opponent from castling and then some.  She did this by doubling up both of her R's and Q on the e file, with the Queen in front.  So, I sort of decided to do the same thing here using the same idea here but in a different scenario and position.  Either way, this move is going to give me an edge.  ",
        "13. Bd3": "And, this is how he responds.  Ironically, however, after this move, white resigns.  Reason: well, he probably saw something that I was trying to do.  What was that?  Well, I am trying to mate white by sacking my Q.  The idea was 13...Qe1, 14.Rxe1, Rxe1#.  BTW, I got this idea from a game between GM's Judit Polgar and Karpov.  That's because Judit actually defeated Karpov with a Q sac during the endgame.  However, black does not have a mating because my opponent and I both overlooked white's LSB.  So, 13...Qe1?? does not lead to mate.  Instead, it would be a losing blunder for black.  How?  14.Rxe1 and after 14...Rxe1, 15.Bf1.  So, black would lose the Q for a R.  Even if his LSB weren't there, white would still have a way to avoid mate, if 14.Qd1.  However, despite what I overlooked, I knew all along that my opponent could just bring his Q to d1.  So, on that ground, I thought that resignation was premature.  However, tactical_abyss disagreed with that assessment.  In it, he said, \"The open file is a tactic I employ on a regular basis,with my Rook.Your win against a much stronger opponent proves my point that certain kinds of tactics can bring down an opponent very quickly.\"  So, the moral of this story is that there are occasions where trying something that you're not used to is a key to success and a way to make progress.      "
    },
    "url": "https://gameknot.com/annotation.pl/another-carro-kann-this-time-by-me?gm=52484",
    "gameName": "Another Carro Kann-This Time by Me",
    "players": "worldtraveler (1578) vs. jkarp (1241)",
    "opening": "Caro-Kann (B15), Tartakower (Nimzovich) variation"
}