{
    "moves": {
        "1. d4": "Just a blitz game with some interest. ",
        "1... Nf6 2. Bf4 e6 3. Nf3 d5 4. Nbd2 Be7 5. e3 Nbd7 6. h3": "This is for pushing the g4 pawn. A lot of other choices are possible (c3, c4, Nb3...) and considered better. ",
        "6... O-O 7. g4": "Easy to figure out...",
        "7... c5 8. c3": "Not really necessary, since white is going to take with the e pawn. ",
        "8... c4 9. Be2": "Since my bishop will help in controlling the Nf6, there is no need to have it on d3. ",
        "9... b5": "The queenside attack. ",
        "10. a3 a5": "Ok, now note I am not necessarily castling queenside. ",
        "11. Ne5": "Time to attack the center. ",
        "11... Bb7": "Necessary, because of Nc6, exchanging the black's dsb. ",
        "12. g5": "This was Be2 for. ",
        "12... Ne4": "Well placed as it is, this black knight doesn't trhreat much, provided I...",
        "13. h4": "...defend the pawn. ",
        "13... b4": "Here goes black with his attack. ",
        "14. Nxe4 dxe4": "Black's white diagonal is blocked by his own pawn. ",
        "15. Bxc4": "And this one was hanging. ",
        "15... Bd6 16. axb4 axb4": "I though about swap rooks, but he can just retake with the bishop. But I realized now I could have won a pawn in a fancy way: ",
        "17. Nxf7 Rxf7 18. Bxd6 Rxa1 19. Qxa1 Nb6": "I didn't see after this my white bishop will be en prise. ",
        "20. Bxe6 Qxd6 21. Bxf7+ Kxf7": "Ok, two minor pieces are better than a rook, but look at the pawns...",
        "22. Qa2+ Bd5 23. Qa7+ Nd7": "Black's piede are tied to defend each other. ",
        "24. O-O": "NO point in a pawn's brainstorming anymore, nor pieces to support it. So why not? On the other side, c3xb4 is a free pawn, but I didn't like the resulting structure. ",
        "24... bxc3 25. bxc3 Kg8": "Black owns the white squares, ok, but...",
        "26. Ra1": "Not Rb1. Both useful landing places are covered.",
        "26... Qe6": "Now begins the interesting part: white wants to avoid a perpetual, or a massive pawn destruction from the black queen. ",
        "27. Qc7": "This move covers Qg4+ with Qg3, and threats to begin with the checks. ",
        "27... Bc4": "Black is looking for a perpetual or even mate net. ",
        "28. Qc8+ Kf7 29. Kh2": "If Ra7, the black queen starts with its lethal penetration. ",
        "29... Qd6+ 30. Kg2 Qe6": "Black cannot move Be6, since it will allow white a move to bring the rook into the game. ",
        "31. Kg3 Qd6+ 32. Kg2 Qe6 33. f4": "I didn't want to draw, so I took a risky decision. ",
        "33... exf3 e.p.+ 34. Kf2": "That's the point. My king is shielded behind the black's own pawn, and if...",
        "34... Qh3 35. Qxc4+": "...with check, so my advantage is now decisive. ",
        "35... Kg6 36. Ra6+ Kh5 37. Qf7+ Kxh4 38. Qf4+": "Black cannot avoid a queen's exchange here, and after it, the game is won for white. "
    },
    "url": "https://gameknot.com/annotation.pl/another-london-attack-more-or-less?gm=47683",
    "gameName": "Another London attack... more or less :-)",
    "players": "damalfi  vs. cavallaro ",
    "opening": "Queen's pawn game (A45)"
}