{
    "moves": {
        "1. e4": "Hi everyone!\n\nMy Class C opponent, Manhattan (Janis) gave me a right run for my money in this game.  He seemed to have much the better of things in the middlegame and I fell into a combo which dropped me the exchange.  However, I did manage to salvage two pawns for the exchange and after a queen trade, I found myself with a decisive central pawn push which reduced my opponent's rook to extreme passivity.  One pawn did manage to reach Glendadom.  Although the WK could remove Glenda from the board, he would have to lose his rook in the first place, leaving me a piece and a pawn (a passer at that) to the good.  My opponent waved the white flag.  Gameknot Analysis is provided here:- http://gameknot.com/analyze-board.pl?bd=15749719&rnd=0.12065503177682513",
        "1... e5 2. Bc4": "2. Bc4 - the Bishop's Opening.  This can transpose into a Vienna Game or the Guicco Piano.",
        "2... Nf6 3. Nc3 Nc6": "3. ..... Nc6 - out come the knights.",
        "4. a3 d6 5. h3 Be7": "5. ..... Be7 - and now I pave the way for castling kingside.",
        "6. d3 O-O 7. Nf3 h6 8. Be3 Re8": "8. ..... Re8 - bit stuck for a sensible plan here.",
        "9. O-O Nh7 10. Qc1 Bf8": "10. ..... Bf8 - Due to the line up of white's dsb and the Wicked Witch of the West on h6 it has become a typical jstevens1 position - passivitis is setting in fast, aaargh!",
        "11. Re1 a6 12. Nd5 Be6": "12. ...... Be6 - might as well continue to get my queenside developed.",
        "13. Nc3 Bxc4 14. dxc4": "14. dxc4 - bishop trade.  I am really glad to have got rid of white's lsb.  That pin on f7 was becoming very annoying.",
        "14... Ne7 15. Nd5 Nxd5 16. cxd5": "16. cxd5 - a knight trade which gives my opponent a fairly big edge - I am still very cramped for style here.  I try to get out of the cramp by moving my knight to f6 and immediately put the pawn on e4 under the hammer.",
        "16... Nf6 17. Bd2 Qd7 18. c4 Rac8": "18. ...... Rac8 - still passive.",
        "19. b4": "19. b4 - now white rolls his pawns down the board.",
        "19... c6 20. Qb2 cxd5 21. cxd5": "21. cxd5 - I appear to have achieved nothing by this pawn trade.  However, I have opened up a file for my QR.",
        "21... Rc7 22. Rac1 Rec8": "22. ..... Rec8 - and I double on it.",
        "23. Rxc7 Rxc7": "23. .... Rxc7 - rook trade.",
        "24. Nh2 Qc8 25. Qb1 Rc2": "25. ..... Rc2 - In trying to get out of the passivitis trap, I will soon get my rook ....... trapped.",
        "26. Be3 Nxe4": "26. .... Nxe4 - I just cannot resist a little pawn grabbing, can I?!",
        "27. Bc5": "27. Bc5 - an interference along the c column is created by the white dsb.  I completely overlooked that and either my knight or my rook will fall.  I then realised that it would be best to dump the rook for that white dsb and get two pawns for the exchange.",
        "27... Rxc5 28. bxc5 Nxc5": "28. .... Nxc5 - I am relieved to see the material count at the bottom of the board reading zero.  However, is the two pawns for the exchange gonna be enough?!  Only time will tell.",
        "29. Rc1": "29. Rc1 - pin.",
        "29... Qd7 30. Nf3 b5": "30. .... b5 - hmm, maybe I could create a passer on the queenside here.",
        "31. Nd2 Be7 32. Nb3 Qd8 33. Nxc5 dxc5": "33. .... dxc5 - this knight trade has opened up the c column to the WR.  On the plus side my c4 pawn is a passer.  On the minus side, white's d5 pawn is also a passer.  Now which one is the strongest?",
        "34. Qe4": "34. Qe4 - nice to see my opponent resorting to defending his pawn with his queen.  That is usually my perogative!",
        "34... Bd6": "34. ..... Bd6 - and just for once, Glenda delegates this task to her ecclesiastical friend, Fou Lenoir.  He defends both the e and c pawns in one go.  He may be overloaded but as he is a lower value piece than the WR it does not matter here.",
        "35. g3 c4": "35. ..... c4 - I now get some counterplay by pushing my c pawn to just 3 squares from Glendadom.",
        "36. f4 Qb6+": "36. .... Qb6+ - I thought long and hard over this move.  I decided to eschew the pawn trade as I did not want the Wicked Witch and the WR to pile up on the f column and scare the bejezus out of Henry.",
        "37. Kg2 Qd4 38. Qxd4 exd4": "38. ..... exd4 - now the queen trade has taken place, just look at those black central pawns - awesome!",
        "39. a4 d3": "39. .... d3 - even more awesome.",
        "40. axb5 axb5": "40. ..... axb5 - here I am, being conservative yet again.  I just wanted to eliminate any chance of white getting a passer on the queenside which cannot easily be rounded up in time.  I now have 3 queenside passers.",
        "41. Kf3 d2 42. Rd1": "42. Rd1 - I think this is a big mistake as Ra1 would have prolonged the game and created complications for me.  This move loses spectacularly as follows.  I now see the finish line and set up conditional moves.",
        "42... c3 43. Ke2 c2": "43. .... c2 - white must now give up his rook.",
        "44. Kxd2 cxd1=Q+": "44. ..... cxd1/Q+ - just the sight of Glenda is enough to make some of my opponents topple their king, Janis is no exception.  See that passer on b4 - that pawn will eventually reach Glendadom because if white had played on I would have put that pawn on b4 and then I would have brought Henry out into the open to hassle his kingside pawns.  The WK cannot be everywhere, so I chalk up yet another handy win.  There is one more victory I will soon be annotating.  Anyhow - I hope you will all have a nice evening and enjoy your weekend - bye for now - Joanne"
    },
    "url": "https://gameknot.com/annotation.pl/another-decisive-central-pawn-push?gm=40644",
    "gameName": "Another decisive central pawn push",
    "players": "manhattan (1504) vs. jstevens1 (1779)",
    "opening": "Bishop's opening (C24), Berlin defence"
}