{
    "moves": {
        "1. e4": "So, I start with my usual.",
        "1... e5": "Like many players, Reuben likes the KPG.  And, as you might guess, yes this will become the Ruy Lopez.",
        "2. Nf3 Nc6 3. Bb5 a6": "The most common response.  So, I answer with the main retreat square, on a4.  Obviously, I won't take his Nc6, although it did come into consideration.  The reason I don't is because tactical-abyss has said that, in the Ruy Lopez, doubled pawns are of no asset since the major pieces haven't been exchanged.  Plus, a B is worth more then a N here, so I really need my LSB.",
        "4. Ba4 d6": "I anticipated 4...b4, in which, I would've answered with 5.Bb3  This move, however, is understandable, as Reuben is getting one step closer to controlling the center by advancing the other center pawn, so that, he can bring his Bc8 into play.  In this case, it's a little nasty because it will mean pinning my Nf3.  But, before he can do this, I will castle, which is, generally, something that I like to do, anyhow.",
        "5. O-O Bg4 6. Nc3": "The pin is of no immediate concern, for if 6...Bxf3, I'll take back with my Q.  In doing so, I think my position would be a little stronger which is why Reuben doesn't take here.",
        "6... Nf6": "Instead, he continues developing.",
        "7. d3": "And, I'm preparing to complete development because the plan is to bring my Bc1 into play.  I also looked at the possibility of 7.d4, with the idea being 7...exd4 8.Nxd4, Nxd4 9.Qxd4, with a better looking position.  But, I almost overlooked one thing.  The plan would not have worked because instead of 7...exd4, black could play 7...b5, and after 8.Bb3 I'd lose a piece for a pawn after 8...exd4, 9.Nxd4, Nxd4 10.Qxd4, c5, as now, my Q must retreat which would allow 11...c4  I remember due to a Homework assignment from stalhandske (during a consultation game) where I suggested a move that would've been a blunder for the same reason.  Then, I made a similar blunder in another game, so I wasn't going to allow history to repeat itself.  The real idea is learning from your mistakes.  But, with this move, I'm still preparing to complete my development, and in the process, I get a pawn chain (which is very useful). ",
        "7... d5": "I guess that Reuben wants to exchange.  And, I'll accept.  What's important to note is that I did consider 8.Nxd5, but this would cost me a pawn, after 8...Nxd5, 9.exd5, Qxd5  Well, what's important is not to give things away, even a pawn, unless you have a good reason for doing so.  A perfect example, was my most recent loss against Jack Stockel, by making a mistake that lost a pawn, in the long run.",
        "8. exd5 Nxd5 9. h3": "But, now I go after his LSB.  I thought that I'd get tempo here, but it doesn't work that way.",
        "9... Nxc3": "That's because Reuben decides to give me that.  But, since my Nf3 is pinned, I won't take his LSB, yet.  Instead, I will force a variety of exchanges, by capturing on c6.",
        "10. Bxc6+ bxc6 11. bxc3 h5": "Trying to get an open h file.  I figured it out because I considered capturing his LSB, at once.  But, then, as usual, I asked myself why Reuben gave it away and if he blundered, or not.  I did a ton of Homework, involving both visualization and analyze the board.  By studying this, I figured out that this was not a blunder, after all.  The idea being is that I'd lost a pawn, or get mated.  The idea being is that 12.hxg3, 12...hxg3, now he has a threat against me, one way or another.  If I move, my Nf3, he can immediately play 13...Qh5, which would guarantee a mate in one with 14...Qh2#, or 14...Qh1#  And, if I give up my N, and respond with 14.Qxf3, or 14.gxf3, he'll answer with 14...Qh3, resulting in the same thing since my Nf3 is no longer around.  I remember from previous mistakes, but espeically from a loss against my OTB coach, as well as, the most recent mistake against Dave.  With Jack, he gave away a pawn with how much more offenders he had.  So, when I got greedy, he was able to trap and win my Q.  Same story with Dave, but it gets worse.  I took a pawn, and with a discovered check, he was able to get my Q.  Later on, he my K was exposed, and I couldn't castle due to a discovered check by castling Q side.  Later on, I realized what my position was like and that he, likely, had a mating sequence, forcing me to resign, in less then 15 moves.  Knowing that, since Jack accurately said that I didn't take enough time to study, this time, I was really going to do my Homework.",
        "12. Bb2": "So, I complete my development.",
        "12... Rb8": "Hitting my B.",
        "13. Bc1": "So, I protect.  13.Ba3 also came into consideration, but it wouldn't work, due to his Bf8.",
        "13... Bc5": "Likewise, Reuben completes his development.",
        "14. Re1": "So, I hit his e pawn.  But, the main reason behind this move wasn't to attack, but rather, centralize one of my R's.  The idea being is that attacking the center is a way of controlling.  The way to do this is by centralizing a Rook, as I learned in a recent annotation.",
        "14... Bd6": "And, he protects.",
        "15. d4": "In this position, the loss of a piece is no longer a concern, so I go for it, at once, by pushing d3-d4  One of the reasons being is that, despite doubled pawns, I have a solid pawn chain.  ",
        "15... Qe7": "Adding an extra defender to his e5.  The only problem is that it leaves Reuben vulnerable to a pin.  For those that are wondering, I won't use analyze the board, as much.  In fact, it temporarily stop soon, but this will be substituted for visualization which is how I also find the right moves.  And, as you might have guessed, visualizing this outside (AFK) is an equivalent to playing blindfolded chess.  For those that are wondering, I learned how to do this from GM Susan Polgar, in her video, \"My Genius Brain.\"  It shows how she does this which is by picturing chess positions in her brain.  In fact, she defeated an opponent who challenged her from visualization.  The only difference is that she can picture hundreds of positions, whereas, the max I can do is 5 or 6.  But, this is the main way, that I have surpassed a 1300 rating.",
        "16. Bf4": "With that being said, I go right after his Q.  Yes, I do keep in mind that he would not dare play 16...exf4?? since I'd take his Queen, immediately.  ",
        "16... f6": "! Best.  To think long term and protect the Q, though, I anticipated 16...g5, in which case, I'd respond with 17.Bxe5, after which I'd win a R with a discovered check.  17...Qd7 18.Bxh8+  This move, protects that.  But, given that his f file is blocked (as now he can't play ...Qh4 (even if my Nf3 weren't around), I can win a piece, at once.  BTW, right after my next move, I stop the analyze the board, at once, and switch to visualization, as noted earlier.",
        "17. hxg4 hxg4": "As expected, he takes back.",
        "18. dxe5": "Interested in how he'll respond, I answer with this move.",
        "18... gxf3": "?? I figured that Reuben would capture here.  But, this is a super blunder because not only will I take his DSB, but in the process I will, at the very least, win his Q for a R.  It's important to note that, in addition to, visulization, I also used memory techniques.  It happened years ago, but after making a mistake in a training game with ubermensch43, I made a grave mistake.  In doing so, he was able to get the same pin which, likewise, won the Q for a R.  After which, I resigned, and I did annotate that game, as it happened before reaching my lowest rating.  Although that training wasn't a good experience, the idea was and is applying what I've learned and using my towards my game, as I did here.  With that being said, the only move that would've prevented black from losing his Q was 18...Qd8, in which case, I'd play 19.Nd4 (leaving him a minor piece down.)  Still bad, but it's better then losing the Q.  But, best was 18...Qf8! (preventing ruinous loss of material.  He would be down two pawns, but not more.)  19.exd6, gxf3 20.dxc7, Rc8 21.Qxf3, or 21.gxf3",
        "19. exd6 fxg2": "?? But, with this capture, memory techniques are obsolete.  Best was 19...Qxe1+ 20.Qxe1+, and he would've had a R.  But with this move, I have a free Q, as he'll be placed in check when with my next move.  Not only that, but I will grab his g2, winning another pawn.",
        "20. Rxe7+ Kf8 21. Kxg2 g5": "?? Ok, this is where I start going back to analyze the board.  This looks good, as it appears to gain tempo.  And, normally, I would pull back, but I looked at two scenarios.  I realized that, most likely he wanted my B.  So, I am willing to sac that for a pawn.  If he grabs it, I have a mate.  It's important to note, that I remembered what I learned from GM Damios Lemos about positional sacs.  This is where you sacrifice a piece for mate or something similar that forces a win.  Preventing mate will mean the loss of a pawn.",
        "22. Bxg5": "With that being said, I take.  I also looked at other lines, such as black taking on d6.  But, if 22...cxd6?? 23.Qxd6, and I'd still mate.  If he played, for example, 23...fxg5, 24.Qf3+, Kg8 (forced) 25.Qf7#, or 25.Qg7# are both mate.  That same thing would happen if, black were to retreat his Rb8, on his 23rd move.  And, if 23...Kg8, 24.Qb8# is also mate.  Therefore, black's only option is 22...Kg8, which prevents mate.  But, I would Queen, and Reuben would, in addition, lose a R, in the process.  23.d7, Rd8 24.Re8+, Kg7 25.Rxh8, Kxh8 26.Qh5+, Kg7 27.Qe8, Rxe8 28.dxe8=Q.  ",
        "22... fxg5": "?? However, this was the first thing I looked at.  And, by playing this, he made the same mistake that I mentioned when looking at, 12.hxg4 because I will mate, at once.  As noted above, as bad as, it looks, 22...Kg8 was needed.",
        "23. Qf3+ Kg8 24. Qf7#": "One lesson to be learned is to evaluate carefully before deciding to take anything.  Asking yourself why your opponent gave it away is important.  If you just decide to grab, without analyzing, it can mean disaster we saw this on both sides.  But, the main moral is based on what shamash said.  \"It's not about how much you learn, but applying what you've learned and using them towards your game.\"  By remembering this moral, I was able to plan the variations that led to that nasty pin which won black's Queen.  And, I remembered about the positional sacs which I used to deliver this mate."
    },
    "url": "https://gameknot.com/annotation.pl/applying-what-you-learn-the-pinning-motif?gm=60249",
    "gameName": "Applying What You Learn-the Pinning Motif",
    "players": "jkarp (1347) vs. reubencpiplupyay (1320)",
    "opening": "Ruy Lopez (C72), modern Steinitz defence, 5.O-O"
}