{
    "moves": {
        "1. e4": "My usual e4.",
        "1... e6": "Unusual reply, blocks in bishop on c8.",
        "2. d4": "Occupying and controlling the centre.",
        "2... d5 3. Bd3 a6": "This doesn't do anything, better to develop.",
        "4. Bf4 c5": "Threatens my other pawn, offering a swap.",
        "5. c3": "I protect.",
        "5... Bd7 6. Nd2 Nc6": "Developing.",
        "7. Ngf3": "In a castling position. Notice that my opponent has not developed any of his kingside pieces.",
        "7... c4 8. Bc2 b5 9. O-O h6": "Again, this does nothing, should be opening up kingside pieces.",
        "10. Qe2": "I protect the pawn with my queen in order to play b3.",
        "10... Nf6": "Finally, my opponent develops his queenside knight.",
        "11. e5": "But, as it is already the middle game, the knight is vulnerable and open to threats.",
        "11... Nh7": "Nh5 is more attacking.",
        "12. b4 a5": "En passent ignored.",
        "13. a3 a4": "Two advanced pieces, this could cause trouble.",
        "14. Qd1": "Wanting to threaten the knight with Qb1.",
        "14... Be7": "Now my opponent can castle.",
        "15. Qb1": "Threatening the knight.",
        "15... Nf8 16. h3 Bg5": "I didn't understand this move, maybe wanting to expose my kingside flank after 17. Bxg5 hxg5 18. ???? g4.",
        "17. Bxg5 hxg5 18. Re1 Qe7": "Wanting to castle queenside, the kingside is dangerous with the h-pawn gone.",
        "19. Kf1 O-O-O 20. Ng1": "Wanting to play g4 to stop my opponent playing g4, I protect the h-pawn.",
        "20... g4": "But I'm too late.",
        "21. hxg4 Rh1": "My knight is pinned to my king.",
        "22. Re3": "Wanting to play Rh3.",
        "22... Qh4": "Can't play it anymore, and my opponent is threatening Qh2.",
        "23. Ndf3": "I threaten the queen and stop my opponent from playing Qh2.",
        "23... Qxg4 24. Bd1 Qe4": "Now, the mistake! My opponent said he accidently played his queen one square too far. But this is not a fatal mistake, he will be -5 down, but its possible to come back from there. One of my friends won a game when he was -14 down, although the two players weren't very good. :)\n\n1. a3 d5 2. b3 b5 3. f4 e6 4. c3 Qh4+ 5. g3 Qd8 6. g4 Bb7 7. b4 d4 8. cxd4 Qxd4 9. Nf3 Qxa1 10. e3 Qxb1 11. Bxb5+ c6 12. Ne5 cxb5 13. h4 Bxh1 14. Kf2 Na6 15. Kg1 Qe4 16. Qf1 Rc8 17. Qxb5+ Kd8 18. Qd7# 1-0\n\nIt was quite a pathetic game.\n",
        "25. Rxe4 dxe4": "My opponent is -4 down.",
        "26. Ng5": "I threaten Nxf7 Re8 Nd6+",
        "26... Ng6 27. Nxf7 Rf8": "Threatens my knight, but I can still check the king and win a pawn.",
        "28. Nd6+ Kc7 29. Nxb5+": "Free pawn, checks the king again.",
        "29... Kb6 30. Nd6": "Pawn fork.",
        "30... Nf4": "A nothing move.",
        "31. Nxc4+ Kb5 32. Nd6+ Kb6 33. Qxe4": "Another free pawn.",
        "33... Nd5 34. c4 Nc3": "Fork.",
        "35. c5+ Kc7 36. Nb5+": "I made a mistake as well, not seeing or forgetting about the knight on c3, I accidently suicide my knight.",
        "36... Nxb5": "Still +5.",
        "37. Bxa4 Nc3": "Another fork.",
        "38. Qc2": "I protect the  bishop and threaten the knight.",
        "38... Nxa4 39. Qxa4 Nxd4": "Free pawn and threatens my queen.",
        "40. Qa7+ Kc6 41. Qb6+ Kd5 42. Qd6+": "I am checking the king repeatedly.",
        "42... Ke4 43. Re1+": "Instead of taking the rook right away, I decide to check the king again.",
        "43... Kf5": "I think Kd3 would've been better.",
        "44. Qxf8+": "I capture the rook, and yet again, check the king.",
        "44... Kg6": "Now I can't check the king again!",
        "45. Qd6 Bc6 46. Qxd4": "Free knight.",
        "46... Bd5 47. Qg4+": "Check, yet again.",
        "47... Kf7": "Retreats.\n",
        "48. Ke2": "Wanting to get out my knight, I move my king out of the way of the pin and he resigns.\nJekingsr could've come back, but kind of gave up after losing his queen, so never give up.\nAs long your alive, there's always a chance, says Jack West Jr."
    },
    "url": "https://gameknot.com/annotation.pl/as-long-as-youre-alive-theres-always-a-chance?gm=44227",
    "gameName": "As Long As You're Alive, There's Always a Chance",
    "players": "strepsil999 (1432) vs. jekingsr (1325)",
    "opening": "French (C00), Schlechter variation"
}