{
    "moves": {
        "1. e4": "This annodated series on the Caro-kann defence",
        "1... c6": "The basic idea behind 1. ...c6 is to support a challenge of white's centre with ...d5 while not preventing the development of the light square bishop. ",
        "2. d4": "White plays naturally ",
        "2... d5": "The Caro-kann proper. From here white has several good chooses listed in order of popularity. 1# 3. Nc3(main line) 2# 3.e5(main line advanced varation) 3# 3. exd5( main line exchange varation)",
        "3. e5": "White opts for the Main line advanced variation. The pluses of this move is that White gains a huge pawn center that carves significant space in blacks territory. If white is allowed  to solidify his centre then he is guaranteed better endgame chances. In the end though 3. e5 is considered inferior as it is not hard for black to equalize by undermining e5 with  ...c5 and ...f6",
        "3... Nh6": "?? definately not a good move because knights belong in the center. The main line continues 3. ...Bf5! highlighting the advantage that the caro-kann has over the French ",
        "4. Bd3": "Typical caro-kann move also that prevents black from playing the good ...Bf5",
        "4... e6": "?? again a bad move that shuts in his light bishop. Still ...e6 is solid enough and creates the potently for a nice outpost for his knight on f5. Now Black's only way to develop the light bishop is ...b6 and ...Bb7",
        "5. f4": "Since black has failed to develop his pieces white can play energetically with his pawns. The main idea is to play f4-f5 or g2-g4 if black plays Nf5. ",
        "5... Nf5 6. Nf3": "Not 6. BxN exf5 when black can continue with ...Be6 with a strong defensive position. 6. Nf3 defends d4 and threatening g2-g4 kicking the black knight out of f5",
        "6... Na6": "?? moving the knight to the side of the board is rarely a good move. The b8 knight always goes to d7 in the caro-kann. The idea behind Nbd7 is that it supports a ...c5 which is black's main form of counterplay in the caro-kann. ",
        "7. c3": "supporting d4 and denying black the g4 sqaure. If 7. G4 black can counter with Ng4 checking the bishop",
        "7... h6": "?? a time waster as black has nothing to fear from the immedaite Ng5. Therefore, because white has a solid centre black needs to weaken it with 7. ...c5 with better defensive position",
        "8. O-O c5": "good move but unfortunitely d4 is well defended against any attack.",
        "9. g4": "gaining space and time as well as driving away an attack of d4. ",
        "9... Ne7 10. Qc2": "I am not too worried about black taking on d4 because 10. ...cxd4 11. cxd4 keeps my center intact and clears c3 for my other knight. ",
        "10... Ng6": "Black really is trying here but what can he do? The answer is to continue to attack d4 with 10. ...Nc6!? ",
        "11. f5 Nf4": "?? very bad as it drops the knight better is ...Ne7",
        "12. Bxf4 Be7 13. f6": "checking the bishop and blasting open the f-file. ",
        "13... gxf6 14. exf6 Bxf6 15. Ne5": "Threatening 16. Nxf7 With a massive attack on the king",
        "15... Nc7": "Black intends to meet Nxf7 with Ne8 defending the weak f6 square. ",
        "16. Nxf7 Kxf7 17. Be5": "pinning the bishop ",
        "17... Ne8 18. Bg6+ Ke7 19. dxc5": "A little tactical trick here can you see it?",
        "19... Bxe5 20. Rf7#": ""
    },
    "url": "https://gameknot.com/annotation.pl/ashleyandersons-mini-tournament-iii?gm=44024",
    "gameName": "ashleyanderson's mini-tournament III",
    "players": "elyhim (2246) vs. howie1ay (1156)",
    "opening": "Caro-Kann (B12), advance variation"
}