{
    "moves": {
        "1. e4": "As white, I open with the e pawn nearly all the time.",
        "1... d5": "I know this is the Scandinavian Defense. It has been played at the highest levels, with some success. I don't know if it's in favor now, but this much I do know: I've never respected black's first move. Because to me, he invariably has to waste a tempo in repositioning the black queen. Now the flexibility in the opening, with opportunites for transitions to me has never been worth the tempo. Since I pay little attention to variations of basic openings, I just develop normally and play the board. That's probably why I'll never be a really really good chess player. But I have beaten some really good chess players! Go figure. Anyways, I just distrust anything that to me seems not so efficient. There, diatribe all done. ;)",
        "2. exd5 Qxd5": "As white, my play is likely too passive, but I'll explain my reasons for the moves I choose.",
        "3. Nc3 Qa5": "This I have seen countless times as white, so I assume this is all book. But from this point, I have no idea what is or is not book. I've seen enough to know that black can get a kingside attack that I don't like as white, so I do something a little odd. Here is the thing for me: It's a given that black is going to reposition the queen. SO why chase it? It's going to move anyways, so I'd rather spend the extra move to do something a little odd with one of my own pieces...",
        "4. Be2": "Perhaps it's passive, but I'm going to take two moves to do something with my bishop here.",
        "4... Nf6 5. Bf3": "Not exactly the safest place for the bishop, but it does a few things I want it to do.",
        "5... c6": "I think Black must be following book moves here, because he's created as usual a place for his Queen to escape to. But from this point on, I am simply going to develop, and invite black to attack my kingside. Now, with this pawn structure, I would think black would wish to castle kingside. As I said, I don't know the book lines. But in the game, that's not what black ultimately does.",
        "6. Nge2": "Just developing. Not the best place for the knight, I know, but you'll understand what I will do in a bit.",
        "6... Bf5": "Looks like good developing move for black.",
        "7. d3": "Freeing up the dark-squared bishop, and controlling c4 and e4, for the moment. I have no plan yet, just developing and castling soon. ",
        "7... e6": "I kind of expected that. I've seen that, and ...Nd7 a number of times in this position.",
        "8. O-O": "So now the white Kingside has a nice big target painted on it.",
        "8... Nbd7": "Yeah, yeah. What is black's plan now? I am still not sure. So let's make a few moves to find out.",
        "9. Nd4": "This is a probe. The knight is heading to b3, but I want to see if black wishes to hang onto his white bishop. It's an empty threat, really. But it will tell me something. Also,  black could play an immediate Ne5 which would result in the loss of the white bishop. He probably should have done that.",
        "9... Bd6": "Wow. He's really ready to give up the white bishop. Is that in the book moves? Problem is, I don't want to take it with this knight even though it would remove some of the current pressure on white's king. Because I played passively, my pawn structure is more cramped, and for the early midgame, I want to hold onto my knights longer, especially since I've invited black to attack on the kingside. I don't need another pawn over there coming down. (Nxf5 pxf5) If black wishes to crash down on my kingside, he's going to need a bit more umphh, and I'm not going to help him do it.",
        "10. Nb3": "Well other than taking the bishop, which some of you will say I should have (fine, I know, I know) I instead put it here, because I am going to want to control d4.",
        "10... Qc7": "Now I recently played a game where my opponent ignored such a threat, and he paid for it. I won't do the same thing. ",
        "11. h3": "Black should consider a sacrifice now to open the King side up, and pressure my King. Despite my knights way on the other side of the board, I wonder if such an attack right now, which was not made, whether it would have had me scrambling the rest of the game. I'll never know now, unless one of you choose to analyze this position for black.",
        "11... O-O-O": "Looks like black will attack on the Kingside. Wow, look at all those pieces bearing down on my kingside, or about to. And the pawns will join in, with rooks behind them. RIGHT now black needs to aggressively go for it. But, he does not.",
        "12. Be3": "Ha, I don't want a7. That will just lose the bishop, and I'd say despite my knights, black could defend the loss of the pawns. But in a while, I'll sacrifice a knight against those black queenside pawns. A little analysis here would have been interesting to see if after Bxa7 b6 Bxb6 and black recaptures with the knight, if there would be anything white could do to take advantage of the lack of pawns there. Instinctively I think not; but again, I don't have a computer to do any analysis with. Anyone out there that wishes to do that, you're welcome to.",
        "12... Kb8": "So, I don't have a computer chess program to tell me if black could have just left his King safely where it was, and used this tempo to get his own attack rolling. He's been reacting, and perhaps he just doesn't have a plan. Someone said on one of their games that a bad plan is better than no plan, and that's right, especially for amateurs, because it's how we get better at it.",
        "13. Qe2": "Partially prophylactic. That rook on d8 is no longer targetting my queen indirectly after this. Remember, that's a half open file, for black. Later on tactics could have been unpleasant with my queen on d2, hence my move. Also, this allows my queen to be on a more useful diagonal and connects the rooks. I need to keep supporting the bishop too. For all of those reasons, that is why I made this move. Now, perhaps the better players would have already had a plan moves ago, but I waited to make a plan until black castled. If I learned the openings better, I'd be able to make my plans sooner. Do I really think of all this stuff while I play? Most times, yes. I seldom calculate. Yeah. I'm lazy. ;)",
        "13... Bh2+": "Okay, I don't understand black's thinking here. Why does he want my King on h1? I don't see any obvious threats right now. It's like giving me a free move, after he retreats his bishop. At this point, I don't fear his knights, and now the black bishop can't check me again. The only thing I would not like right now is is if black could crash his pawns down on the kingside with his rooks beind them. It's worth noting that black could have played Ne5 for several moves now, getting rid of my white bishop. Because he didn't, it comes back to haunt him.",
        "14. Kh1 Bd6": "That made no sense to me. Instead of it being black's turn, now it's my turn again, in this same position save the white king is on h1 instead of g1. I think this was a wasted move, especially since those kingside black pawns have a long way to go before they contribute to pressuring my kingside.",
        "15. a4": "Now at this point, my plan was to get the b pawn rolling too. And perhaps use one of those two knights to open up black's queenside. Here is a basic lesson: most chess books advocate countering in the middle or other wing, when one's opponent launches an attack on one side of the board. The reason for this is because one's counter play, and own attacking chances can cause your opponent to leave off from his attack to defend. But in this position, black doesn't do this. Instead, he tries to oppose what I will do.",
        "15... a5": "I am suspicious of this move. Perhaps black doesn't like all my pieces pointing his way; but if so, why didn't he try to trade some off earlier? You know what, and I bet you'll say the same thing: when we lose games, it's often because our opponent beats us to the punch. Now, in order for me to achieve my goal, what square do you think it is that I want to control? If you guessed b4, you're right. Because if I have b4, then further pushes will become very possible and very uncomfortable for black.",
        "16. Bd2": "Preparing for launching those pawns and knights.",
        "16... b6": "This is positionally very bad in my opinion. It loosens up black's king's safety, and black has not forseen yet that I'll let a knight jump up there regardless of the extra protection for a5.... Black ought to get rid of that white bishop in this position but instead...",
        "17. Na2": "And now I am prepared to sacrifice the knight. There are a lot of tactics involving c6 in play now. I'm not sure what black has been thinking about this all.",
        "17... h5": "Black finally begins to assault the white king, but...",
        "18. Nxa5": "He has to deal now with his kingside. ",
        "18... bxa5": "And so now it's the b pawn's turn.",
        "19. b4": "This position is looking bad for black now; white has torn open black's king pawn with his help. I think accurate defense can still save black, but it wasn't to be.",
        "19... axb4": "Now, I have a choice: knight or bishop. I wanted to keep the knight because of the forks; but at this point I thought, well, the knight will pry the position open because of the threats, and the bishop won't necessarily. Surely black would take the white knight with his black bishop, because of the danger. And I wanted that, so my rooks could harass that king sooner rather than later. But black had other ideas.",
        "20. Nxb4": "Black MUST take with the black bishop, because of the dual threat here; Nb6+ forking the queen and Nxc6 forking the rook. Ne5 fails now due to the first fork; black can only stop both by taking with the bishop. But by this point I had over five minutes, and black was under a minute on his time. He got confused trying to keep all the lines straight, and sadly, made this unfortunate move:",
        "20... Qa7": "Well he resigned after white's next move.",
        "21. Nxc6+": "And he wasn't rated that low. This is why I don't mention his name. We all blunder, it's part of the game. I blunder. More important to me here is I really wish I could have seen the bishop take, my bishop take, and then the scramble by black to defend the King as I brought my rooks into play. Would I be able to get enough material back after the knight sacrifice? Because it looks like black's king will escape to safety. I wish I had a chess computer so I could look more closely at 20. ...Bxb4. But except for the last blunder, and a few miscues, black played well. I could have made better moves too. But that's what makes chess FUN! ;) Hope you enjoyed this one."
    },
    "url": "https://gameknot.com/annotation.pl/assaulting-the-king?gm=48774",
    "gameName": "Assaulting the King",
    "players": "Pierre99 (1200) vs. Unknown (1681)",
    "opening": "Scandinavian defence, Lasker variation (B01)"
}