{
    "moves": {
        "1. e4 e5 2. Qf3 Nf6 3. Nc3 b6 4. d3 Bb7 5. Nh3": "Trying to attack the White Queen. See how many attacks all together! ",
        "5... d5 6. exd5": "Bad move ! Instead of getting another defense for e4, got rid of d5. ",
        "6... Nxd5": "Black pieces attacking.",
        "7. Nxd5 Bxd5 8. Qf5 Nd7 9. Be3 Qf6": "White Queen is getting more attacks. ",
        "10. Qg4 Be6": "Again and again, the Queen is getting attacks.",
        "11. Qa4 Bd6 12. O-O-O O-O 13. d4 exd4 14. Bxd4 Qh6+ 15. Kb1 Nc5": "Another attack !",
        "16. Qb4 a5": "Further and further black pieces, coming out and bothering the Queen. ",
        "17. Qd2 Qg6 18. Nf4 Qf5 19. Nh3 Rad8": "Some sort of discovered attack to the Queen.",
        "20. Bb5 Ne4": "More and more difficulties for the Queen.",
        "21. Qe2 Qg6 22. Nf4 Bxf4": "Bad move ! Knight was unprotected.",
        "23. g3 Nd2+": "Oh, no ! This time white king was troubled with a check.",
        "24. Rxd2": "Without cutting by the Rook, better take King away. Later can be attacked by the Bishop at d4.",
        "24... Bxd2 25. Rd1": "Getting further troubles by taking the Rook into the d file. ",
        "25... Rxd4 26. Rxd2 Rxd2 27. Qxd2 Qe4 28. Bd3 Qh1+ 29. Qc1": "That was a nice move for the moment ! Though black pieces are much smarter ! Watch out !!!  It is ideal time to play tac-tics. Have the focus on Bishop at e6.",
        "29... Bxa2+": "Sacrificed ! Hoping to get a big harvest. See, it will work or ...",
        "30. Kxa2": "Yes ! It worked and ...",
        "30... Qxc1": "Got away the white Queen and the black Queen with the Rook and company are very stronger than the white side and threatening to defeat of the white. As expected, white got resigned giving the well desired victory for the Blacks."
    },
    "url": "https://gameknot.com/annotation.pl/attacking-the-queen-in-a-blitz-chess-game?gm=36465",
    "gameName": "Attacking the Queen in a Blitz Chess game",
    "players": "Johnson  vs. Kapila ",
    "opening": "KP (C20), Napoleon's opening"
}