{
    "moves": {
        "1. e4": "The best road is the one you know, or so goes the Turkish proverb.",
        "1... e6": "The French Defense!",
        "2. d4 d5 3. Nc3": "I guess this is main line - I had been using the Advance Variation against him for quite a while now, and a change did not seem bad.",
        "3... Nf6 4. e5": "But that advances with tempo! It did not feel like overstretching, since 3. e5 has a name to it, 4. e5 should not be all that different - or that's what I thought at least.",
        "4... Nfd7 5. Nf3 c5": "Taking on c5 seemed to allow him to develop his bishop...",
        "6. Be3": "So I refuse it, and win a well-deserved question mark.",
        "6... cxd4 7. Nxd4 Nxe5": "Oops. Both center pawns gone!",
        "8. Bf4": "What was I expecting?",
        "8... Nbc6 9. Bb5": "Pin!",
        "9... Bd7": "Broken pin.",
        "10. Nxc6": "My reasoning behind this one was probably retreating to b3 or f3 would be a waste of time, so I exchanged despite being a pawn down. I don't know if that was right.",
        "10... Nxc6 11. Qe2 Bb4": "Counter-pin.",
        "12. Bd2": "Broken counter-pin!",
        "12... Nd4": "Marching on - this is bound to exchange some material, good for him while he is up by a pawn.",
        "13. Bxd7+": "Obviously.",
        "13... Qxd7 14. Qd3 Nf5 15. O-O-O": "His pieces did not seem to \"point\" at any side, and long castling gives me a rook on the central d-file - open thanks to my long gone pawns! My a2 pawn would pay the toll eventually..",
        "15... Nd6": "En route to c4 or b5 - either way his attack will build up on the Queenside.",
        "16. Rhe1": "Centralising, and threatening Qxd5, now that the e-pawn is pinned.",
        "16... O-O": "Castling, but not preventing Nxd5!",
        "17. Nxd5": "Here it comes! He has to take on d2 first now, and when he does that, I take back with the Rook, and then load a 3-piece battery on the d-file before he can defend it. I figured his pawn and knight would eventually fall, leaving me a pawn up.",
        "17... Bxd2+ 18. Rxd2 exd5 19. Qxd5": "Plan in action.",
        "19... Rad8 20. Red1 Qc7": "Side-stepping.",
        "21. Qe5": "Obviously, I have to take with the Rook(s) first.",
        "21... f6": "Pushing forward with tempo.",
        "22. Qg3": "This is where the problem arised. It was either Qf4 or Qg3, since otherwise I would lose the opportunity totally, and I retreated an extra square. Perhaps it would not matter that much, after 22. Qf4 g5, where I would still have to retreat back to g3. I decided not to give him the chance for another pawn push - especially when mine were standing where they started, so I did this. Would Qf4 have been better?",
        "22... Qc4": "Oops.That a2 pawn has to take one for the team.",
        "23. Rd2xd6": "I took the Knight anyway, since otherwise I would miss the opportunity totally (after Black's move Nf7, the Rook on d8 is defended too).",
        "23... Qxa2": "Well.. At first glance it seemed free to take on d8, but after 24. Rxd8? Qa1+ 25. Kd2 Rxd8+ 26. K-any Q/Rxd1(+) and I am down by a rook. So, instead of all that, I decided to simplify by exchanging Queens.",
        "24. Qb3+": "It seemed to simplify the position at the time. On hindsight, this was probably where the balance tipped towards him, now that my pawns are doubled. Already behind in rating and endgame skills, this move was quite suicidal.",
        "24... Qxb3 25. cxb3": "See?",
        "25... Rxd6": "Pretty much forced (retreating was worse).",
        "26. Rxd6 Re8": "Going for that 7th rank..",
        "27. Kd2": "Denied.",
        "27... Kf7 28. Rd7+": "This just allows him to simplify things even further. I'm not down, and at the time, it seemed like I would be able to get a draw. It was certainly an improvement over all the games I had previously lost to him, and I was optimistic ^_^ - but perhaps just too much.",
        "28... Re7 29. Rxe7+ Kxe7 30. Kd3 Kd6 31. Kd4": "Polyanna: I have 4 ranks, he has 3!",
        "31... f5 32. f4": "Keeping each other's Kings away.",
        "32... a5 33. Kc4": "I really did not know what to do..",
        "33... Kc6 34. g3": "Out of creativity at this point. I thought of b4, but simply a4 would have answered the problem quite plainly.",
        "34... b5+": "Checks at 17 and 34. Would it be checkmate on 51 had I not resigned?",
        "35. Kd4": "Better sideways than back, I thought, but after 35 ... Kd6 I am really left moveless. Zugzwang, anyone?",
        "35... Kd6 36. Ke3": "And now back - but the wrong side!",
        "36... Kc5 37. Kd3 Kb4": "Behind enemy lines.",
        "38. Kd4": "Still, maybe Kc2 would be better? At least it would hold on for a little longer.",
        "38... Kxb3": "In short, gg.",
        "39. Kc5 b4 40. Kb5 a4 41. h3 a3": "You can take my body, but my soul? Never! Thanks for watching!"
    },
    "url": "https://gameknot.com/annotation.pl/attacking-the-french-without-center-pawns?gm=23195",
    "gameName": "Attacking the French Without Center Pawns!",
    "players": "goflb (1464) vs. ozgun92 (1724)",
    "opening": "French (C11), Steinitz, Bradford attack"
}