{
    "moves": {
        "1. d4 Nf6 2. Nc3 d6": "In many lines d6 is not played until White e4 anticipating White e5, but I like an early d6 as it frees the LSB. In case White gets adventurous early on, I can develop a piece short or long, also if/when Nf3 I can respond with Bg4.  This may not alsways suitable or recommended but the option is there. And d6 protects the e5 square.\n",
        "3. e4 g6 4. Bg5 Bg7": "It goes without saying , move order is important.",
        "5. e5 dxe5 6. dxe5": "e file pawn exchange, what is Black's best move and where should Black put the f6 Knight?\n",
        "6... Qxd1+ 7. Rxd1": "First an exchange which still asks the same questions of Black.",
        "7... Ng4": "Black chose an advanced square, two pieces on the e5 pawn.",
        "8. Nd5": "White threatens Nc7 forking King and the a-Rook.  But that move can't be made yet. Knight is in a nice spot, at the minute a threatening pawn move will bring trouble on Black. ",
        "8... Bxe5 9. Nf3": "Black uses DSB to capture hanging pawn, and protect the c3 pawn/square.  White develops and threatens.",
        "9... Bd6 10. Bd3": "Is Bb5+ worth it? Black can protect with a Bd7, even Nd7 gives the a-Rook an escape square if it needs it.",
        "10... e6": "Looking at the position again, this may be an error.  White has five pieces developed, but wasn't going after e7.  Black wanted to castle kingside (yes, really) and wanted to kick the White Knight to allow that move.",
        "11. Bf6 Nxf6 12. Nxf6+": "Did White use the wrong piece to lose?\nOkay, White got a check out of it, King has to move stay in the middle but the Dark Squares are gorgeous.",
        "12... Ke7 13. Ne4 Bf4": "Move and threaten, Black bishop had few squares to go to, 13.Bb4+ is a dead end.",
        "14. O-O Nc6 15. Bb5 Nb4": "More move, threaten, move, threaten.\nIs there a way either side can take a more dominant grip on the game?",
        "16. g3 Bh6": "Even less squares now for the Black DSB.  But Bh6 still looks out on a few sqaures and it is almost back to g7, which would be good if the King was nearby.",
        "17. Bd3 Nxa2": "White protects the more central pawn and greedy Black gets a pawn and takes the Knight out of the game. Although the Black should now start thinking of the empty, unimportant c1 square.",
        "18. c3": "Black Knight doesn't have an escape square, it's catfood, but what dame can it do before the end.",
        "18... b6": "Whites own knights look vunerable to a fianchetto Bishop.",
        "19. Rda1 Rd8": "Some tit-for-tat at the minute",
        "20. Rfd1 Nc1": "Black Knight moves at the right time.",
        "21. Raxc1": "Was it necessary for White to capture?  \n",
        "21... Bxc1 22. Rxc1 Rxd3": "White needs to get the pieces working together.",
        "23. Ned2 Bb7": "Did White move the wrong Knight?  Predictable two pieces point down on Nf3 now.",
        "24. Ng5": "I think this may have been a panic move.",
        "24... Rxd2 25. Nxh7 Rad8": "Tide is with Black now. Pressure on empty d1 square",
        "26. h4": "An escape square.",
        "26... Rd2d1+": "The check forces the exchange.",
        "27. Rxd1 Rxd1+": "White graciously resigned."
    },
    "url": "https://gameknot.com/annotation.pl/attacking-the-square?gm=44330",
    "gameName": "Attacking the Square",
    "players": "Player A (++++) vs. Player B (++++)",
    "opening": "Queen's pawn game (A45)"
}