{
    "moves": {
        "1. d4": "As usual, I can't get away from playing d4 as my first move sometimes because I believe it's less stressful then playing e4",
        "1... Nf6 2. Nf3": "I usually play c4 here but I hoping I could get myself in a Colle system",
        "2... e6 3. c4 b6": "Seems like my opponent want to play the Queens Indian Defence, so why not right, let the game begin",
        "4. a3 d5 5. Nc3 dxc4 6. Qa4+": "After I made this move, I started to have second thoughts about it because I thought about playing e4 instead and control the center just a little bit. But after I take back the pawn on move seven I really didn't want my Queen to be chase around.",
        "6... Qd7 7. Qxc4 Ba6 8. Qb3": "This is one of many reasons why I didn't like playing Qa4  just yet",
        "8... c5 9. Be3": "This is by far the worse move I played. The fact that my e2 pawn can't get no air to move out really makes my position a little bad and gives black a slight advantage",
        "9... Ng4 10. O-O-O Nxe3 11. fxe3": "Isolated pawns on the e file is no good at all.",
        "11... c4 12. Qc2 Nc6 13. Qa4 Na5 14. Qxd7+": "The reason for taking the Queen is because had I not taken that Queen, black would've found a way to attack my pawn on e3 that is so weak right now. Second, I wanted to make my position a little bit less stressful to protect the e3 pawn as well.",
        "14... Kxd7 15. Kb1 f6 16. e4 Be7 17. e3": "At this point I didn't mind having double pawns on the e file. In fact, I like my position as this point and knew right away that I could get out of the double pawn situation. My concern before was not getting the bishop in the game. Not to fear anymore.",
        "17... Rac8 18. Be2 Bb7 19. Rhe1 Rhd8 20. d5": "With the King in front of the rook I felt like I should push my pawn up immediately and get rid of the double pawns once again.",
        "20... Bc5 21. Nd4 Bxd4 22. exd4": "You would think that I would get tired of looking at double pawns on the e file. Now there on the d file. Go figure..lol",
        "22... f5 23. dxe6+ Kxe6 24. Bf3": "You could probably see why I play Bf3 here right? And now this is what I could call a \"good game\"",
        "24... Kf7 25. e5 Bxf3 26. gxf3 Ke7": "I didn't expect my opponent to play this move. I though he was going to take over the g file by playing g5 and put a stop to my little dreams of playing f4. But I felt relax now and confident that at this point, there was no way I could lose this game, nor can I win this game so easily as well.",
        "27. f4 Nb3 28. d5": "I hope everybody enjoy the annotation that I just made. Please feel free to make comments or send me a private message however you feel like doing. From here on out I'll let you play the rest of the game out and let you decide whether I should have play the game out or was smart of me to offer a draw. Hopefully my opponent would definitely look at this game and give his point of view as well.",
        "28... Rc5 29. d6+ Ke6 30. Reg1": ""
    },
    "url": "https://gameknot.com/annotation.pl/autumn-small-tourney?gm=11423",
    "gameName": "autumn small tourney",
    "players": "bronx_best (1740) vs. troglodit (1798)",
    "opening": "Queen's pawn (A46), Torre attack"
}