{
    "moves": {
        "1. e4": "A game I was sure I would win with ease, after gaining a winning position I thought a win was going to be easy however with some determined play by my opponent the full point gradually slipped through my fingers. My opponent in this game showed a never say die attitude that just goes to show that one shouldn't give up.\r\n\r\nComputer annalysis here:\r\nhttp://gameknot.com/analyze-board.pl?bd=16703879&fb=1&rnd=0.8222061892144423",
        "1... c5 2. c4": "This kind of play is I believe not that uncommon but is definatly not to my taste. ",
        "2... Nc6": "I figured the best way to go about this is to make use of the d4 square which seems to be blacks best shot.",
        "3. Nf3 g6 4. d3": "Emphasising d4",
        "4... Bg7": "Now I have three pieces on the d4 square and the direction of the game seems to be set already.",
        "5. Nc3 d6": "I wanted to open lines for my LSB, I wasn't quite sure where it best belonged yet.",
        "6. Be2 a6": "This doesn't accomplish anything at the moment but it was designed as a waiting move, I still didnt know what I wanted to do with my LSB and even my knight, the a1-h8 diagonal looks very nice so I wasn't too sure if I wanted to cover it by developing my knight to f6. As well as that I figured blacks going to aim for queenside expansion and this prepares that.",
        "7. O-O e6": "I need to develop so I figured now was as good a time as ever, I still didnt know what I wanated to do with my LSB but it seemed to me that its optimal square was yet to be revealied so its best to just develop my knight and decide later what to do with my bishop. this move also controls d5.",
        "8. Rb1 Nge7 9. h3 O-O 10. Nh2": "At the time I thought that h3 was just a dont know what to do so how bout h3 sort of thing. It's not till after this that I realised it was probably to free the f pawn. though come to think of it the N could have simply gone to d2 instead of creating a potential target for black with h3.",
        "10... Rb8": "preparing the eventual queenside expansion.",
        "11. f4 b5 12. cxb5 axb5": "capture toward the centre.",
        "13. a3 Nd4": "finally planting the knight on its most natural square.",
        "14. Be3 Nec6 15. Nf3 Nxe2+": "Generally I prefer bishops to knights, however I think in this case this may not have been the best course of action. Perhaps b4 would have been more accurate?",
        "16. Qxe2 b4 17. axb4 Rxb4": "The pawn capture didn't seem appealing and this kept an eye on b2, prepared to potentially double up and meant the knight could continue to remain controlling d4.",
        "18. Kh1 Qb6": "Possibly risky putting my queen in line with the enemy bishop.",
        "19. e5": "offering a pawn for pressure and tactics against c5 I think",
        "19... dxe5 20. fxe5 Nxe5 21. Ne4 Nxf3": "There were a few options to take here For whatever reason I cant remember I went with this one.",
        "22. Rxf3 Rxb2": "Leaves me a pawn up.",
        "23. Rxb2 Qxb2 24. Qxb2 Bxb2 25. Nxc5 Rd8": "However there is a good chance I will be able to gain the isoloni",
        "26. Bh6 Rd5 27. Ne4 Ba6 28. Nf6+": "I had wondered if my opponent would try this. It forces me to give up the bishop pair but I think I would have done something else.",
        "28... Bxf6 29. Rxf6 Rh5 30. Be3 Bxd3 31. Rf2 Be4 32. Kh2 Rf5": "I figured the two pawns would be enough to win the oposite coloured bishop ending.",
        "33. Rd2": "Apparently my opponent agrees.",
        "33... h5": "Seizing the pace while I can.",
        "34. Rb2 Rd5 35. Bd2 Rd3 36. Bg5 Kg7 37. Bf4 Kf6 38. Bg3 Kg5 39. Rf2 f5 40. Bc7 h4 41. Bf4+ Kh5 42. Rb2 g5": "Things would get difficult if I allowed White to play Rb8 whilst my pawn was still on g6.",
        "43. Be5 f4": "Now I have blocked the white bishops access to g3. ",
        "44. Rf2 Rg3": "whites game is slowly becoming more difficult to play. the rook is confined to the 2nd rank and his bishop is having difficulty finding usefull tasks.",
        "45. Bd6 Kg6 46. Be5 Kf5 47. Bd6 Rd3 48. Bc7 f3": "I had been struggling to find the winnning plan the past few moves, I had a good position but couldnt work out how to win when my opponent kept not making mistakes. So in the end I thought I had to do something active.",
        "49. g3": "Just what I expected. It's what I would have done as well.",
        "49... e5": "This was incase my opponent played g4 it meant my king would be able to jump into f4. ",
        "50. g4+": "I was slightly surprised, I thought gxh4 was more likely.",
        "50... Kf4 51. Ba5": "Aiming for d2.",
        "51... Rd1": "?? However I must have been getting cocky and lazy because I had stopped putting any thought into the game thinking it was simply won. my opponent proved me wrong. Of course something like 51...Bc6 would leave me with a good game.",
        "52. Bd2+ Rxd2 53. Rxd2": "So now material was equal but I still thought I had winning chances at this point. As well as that this was a team macth so I was going to fight to the bitter end.",
        "53... Ke3 54. Ra2 f2": "?? Another blunder that makes this a hundred times more difficult to win if infact there exsists a win at all.",
        "55. Rxf2": "Of course If I were to take the rook it would be stalemate.",
        "55... Bf3": "Now I have my work cut out for me. ",
        "56. Rb2 e4 57. Kg1 Be2 58. Rb3+ Bd3 59. Rb2 Kf3 60. Rf2+ Kg3 61. Rf5 Kxh3 62. Rxg5 Kg3": "I had done a heap of annalysis to reach te position last move and thought I had something winvolving a pawn push, I then realised it was terrible as there was some error in the lines I had worked out. however I still thought this game was worth continuing.",
        "63. Rg7 h3 64. Rh7 Be2 65. g5 e3 66. g6 Bd3": "This had all been planned from move 62 however as soon as I did it I realised that Re7 dissolves the threats.",
        "67. Re7 h2+ 68. Kh1": "Still though I thought there was still chance for my opponent to make a mistake. A draw had been apparanet to me for a very long time now, I think since about move 55 however I kept playing on in the hopes that white would slip up.",
        "68... e2": "Of course there are many many lines that eaisly draw for white but there is still a chance that an inattentinve opponent may fall into a mate. One can dream I guess.",
        "69. g7": "Definatly the best reply, its what I would have done. It actually almost seems that this wins for white however blacks next move is the only move that draws.",
        "69... Bc4": "threatning mate. This was my last throw of the dice and I was desperatly hoping that white may play something foolish like Rxe2 or Re8 or even g8=Q (though come to think of it that would still draw after ...Bxg8 Re3+)",
        "70. Re3+": "No such luck.",
        "70... Kf2 71. Rxe2+ Kxe2": "I was very impressed with the way my opponent played this game especially his never say die attitude. I learnt a very important lesson here about not getting sloppy as there is almost always chance for your opponent to slip up and miss the chance for a win."
    },
    "url": "https://gameknot.com/annotation.pl/avid-defence?gm=42473",
    "gameName": "Avid defence",
    "players": "shahmat1 (1479) vs. thereaper1 (1617)",
    "opening": "Sicilian (B20), Gloria variation"
}