{
    "moves": {
        "1. e4 c6 2. Nc3": "Usual move is 2.d4 but with 2. Nc3 after Black 2. ... d5 White can play 3.d4 returning to the main line.\r\nOn my opinion 2.d4 is more flexible while White can choose between 3.Nc3, 3.Nd2, 3.e5  after Black's usual 2. ... d5",
        "2... d5": "Pawn on d5 is the main idea of the move 1.c6",
        "3. Qf3": "White try to make a surprise for Black or just don't what to play many moves in a well-known opening.\r\nIn fact so early move by a Queen usually is bad, but in this position, where Black made a nonactive c6 it is possible not losing much (only the White's opening advantage).\r\nPossible Black answers are:\r\na) 3. ... de (like it was in the game)\r\nb) 3. ... e6?! after 4.d4! Nf6 5. Bg5 Be7 6.e5 Nfd7 7. Bxe7 Qxe7 8. Qg3 0-0 White are good. So do they after 4. ... Nd7 5.ed cd 6.Bd3\r\nc) 3. ... d4!? very active move, was tried with success by Daniel Fridman, 1996 4.Bc4 e6 5.Nce2 Nf6 6.e5 Nfd7 7.Qe4 Nb6 8.Bb3 c5 9.c3 Bd7 10.Nf3 Bc6 11.Qg4 h5 12.Qg3 h4 13. Qh3 d3 14.Nf4 c4 and White has no space. But than 3. ... d4?! was punished by Nigel Short, 2006 4.Bc4 Nf6 5.e5 dc 6.ef ef 7.dc Nd7 8.Bf4 Bc5 9. 0-0-0 0-0 10.Qg3 Re8 11.Nf3 b5 12.Bd3 Qb6 13.Bh6... But this games where between players with 400 points rating difference, so won the strongest player, not a better opening.\r\nd)3. ... Nf6 4. e5 Nfd7 5. d4 e6 6. Nh3 Be7 7.Qg3 g6 8.Bd3 and White has space and Black has weakness.\r\n\r\nThe one thing that unite all this lines, starting 3.Qf3 that they are not used by the top rated players, only in the games with a weak opponents.\r\n\r\n",
        "3... dxe4 4. Nxe4 Nd7": "Previous moves were clear. Sometimes someone plays 4. ... Nf6 but after 5.Bc4 Nbd7 6.d4 Black have no Ne5 with exchanging the active white bishop.\r\nAfter a move in the game very active 5. Bc4 meets Ne5, Nxc4",
        "5. Bc4": "And White still go for this. The most popular is 5. d4 with the idea of protecting the e5 against the Black Knight\r\n5.d4! seems to be the main line here, but in the games with one person over 2500 ELO the result is +0-8=5 (up to 2010), but in all games Black were high rated from 200 to 500 points...",
        "5... Ne5 6. Qe2 Nxc4 7. Qxc4": "What we have after exchange: no active White bishop, White Queen made 3 moves to get in the position, Black Knight made 3 moves and was exchanged... so after completing 7th move Black doesn't lose a tempo and exchange a powerful Bishop. Not bad.",
        "7... Bf5": "So, like it was mentioned in comments (thank you for them), this move seems to be not the best one... Suggested were 7. ... Be6, 7. ... Qd5:\r\n7. ... Be6 seems to be good if 8. Qb4?! Bd5 9. f3 Qc7 10. Qc3 f5 11. Ng3 f4 12. Ne4 e5 13. b3 Nf6 and Black have a better position, but if 8. Qe2! Nf6 9. d3 Nxe4 10. de Qa5+ 11.Bd2 Qc5 12. c3 Bc4 13. Qe3 e5 White should be careful, but nothing dangerous...\r\n\r\n7. ... Qd5 exchanging Queens 8. Qxd4 cd leads to the Blacks advantage in development 9. Nc3 e6 10. Nf3 Bd7 11. d3 Bd6 12. 0-0 Ne7 13. Re1 Rc8 Black developed better, White should be careful. While trying to save queens 8. Qe2 Nf6 9. d3 Bf5 10. c4 Qe6 11. f3 Rd8 12. Bf4 b5 13. Rc1 bc - and game is more complicated while Black still have a small advantage\r\n\r\nSo, yes, 7. ... Bf5 wasn't the best move, both variations above give more for Black and allow them to play for the victory.",
        "8. Ng3": "Here is more interesting for Black - White have 2 pieces made 3 moves each on the 8th move in the game... that seems to be wrong.",
        "8... Bg6": "And that is a mistake. After 8. ... Be6! Black can fight for an advantage:\r\n9. Qb4 Bd5 10. Nf3 Bxf3 11. gf Qc7 - Black pawns are better\r\n9. Qe2 Nf6 10. d3 Bg4 11. Nf3 Qd5 position is equal but playing for Black is easier\r\n\r\n8. ... Bg6 was made probably because it is a \"Caro-Kann\" move, also Bd5 was not found so I thought the e-pawn need a space to move.",
        "9. Nf3 Nf6": "Developing move.\r\nProbably interesting was 9. ... Qd5 and on 10. Qxd5 cd Black have a good pawns  or 10.Qc3 Be4 11.Nxe4 Qxe4+ 12.Kf1 with more interesting game.",
        "10. d3 e6 11. Bg5 Be7 12. O-O O-O": "That where the moves for development, not obvious but not changing the balance.",
        "13. Ne5": "The move leading to exchanges...",
        "13... Nd5": "Possible was 13. ... Qd5! 14. Nxg6 fg! 15.Qh4 h6\r\n",
        "14. Nxg6": "After White made this move I understood that he is not against the draw. \r\n",
        "14... hxg6 15. Bxe7 Qxe7 16. c3": "The boring position. While thinking about it I understood what is the \"grandmaster's draw\"... And offered it to my opponent. ",
        "16... Nf6": "So, \"grandmasters draw\", my first one. For sure, if rating difference was big the one with a higher rating wouldn't accept the draw and possibly won, but here is not such case."
    },
    "url": "https://gameknot.com/annotation.pl/b10-caro-kann-2-nc3-and-3-qf3?gm=36611",
    "gameName": "B10 Caro-Kann. 2.Nc3 and 3.Qf3",
    "players": "locathah (2068) vs. dmitrym (2079)",
    "opening": "Caro-Kann (B10), Goldman (Spielmann) variation"
}