{
    "moves": {
        "1. e4": "King Pawn Opening to B12 Caro-Kann Advance Variation. Played against Excalibur Deluxe Talking Chess, Level 3.",
        "1... c6": "Caro-Kann",
        "2. d4 d5 3. Bd3": "Standard is Nc3, but I wanted to try an idea using the Bishop.",
        "3... Nf6": "Perhaps e6 looks better. The knight can be displaced by e4-e5 costing tempo.",
        "4. e5 Ne4": "A blunder because the knight will be trapped.",
        "5. f3 f5": "Maybe the best idea for trying to compensate for the blunder 4...Ne4 by siezing control of the center after 6.fxe4 fxe4.",
        "6. fxe4 fxe4 7. Be2 Bf5": "Trying for the best development of the Q bishop, perhaps hinting of castling to that side.",
        "8. Bg4": "With the idea of exchanging bishops with white influencing the c8-h3 diagonal, and watching g7, by the Queen.",
        "8... Bxg4 9. Qxg4 Nd7 10. e6": "Wedging black by blockading the e7 pawn on its home square to restrict black.",
        "10... Nf6": "A blunt attack on the Queen that offers no real gains.",
        "11. Qh3": "Keeping contact with e6.",
        "11... Qc7": "Developing for castling. There is 11...Qa5 for an option with 12.Nc3 a response. It isn't much of an alternate move because there is a lack of pieces to join in an attack queenside. The influence of the pawn wedge on the f8 bishop and lack of mobility for the f6 knight can be observed.",
        "12. g4": "Taking space and threatening the knight.",
        "12... O-O-O": "Castling to improve king safety.",
        "13. Ne2": "With the idea of Bc1-f4 to control the b8-h2 diagonal and keep the queen isolated from other pieces.",
        "13... h5": "No danger of 14...hxg4 because of 15.Qxh8, pin theme.",
        "14. Bf4": "Completing a small plan.",
        "14... Qb6 15. b3": "Necessary to prevent queenside incursion.",
        "15... Nxg4 16. Rg1 g6": "A serious blunder because the knight is really not defended due to the pin on the h8 rook. Better was 16...g5 17.Bxg5 Bg7 to defend the rook and restore the defender; the pawn can protect the knight.",
        "17. Rxg4": "Good move, using the tactic of eliminated defender; the pawn can not take because of the undefended rook. If 17...hxg4 then 18.Qxh8 winning a piece.",
        "17... Rg8 18. Rg5": "I weighed the value of rook to bishop and decided that the bishop was more valueable. This lead to the idea of offering an exchange sacrifice to eliminate the competition of the dark squares, the opponents bishop.",
        "18... Bh6 19. Be3": "A waiting move. In retrospect, I could have moved 19.Nd2 to develop a piece instead.",
        "19... Bxg5 20. Bxg5": "Now the bishop can be used on the b8-h2 or d8-h4 diagonals for control.",
        "20... Qc7": "A loss of time because d7 is unavailable for a next move and 21.Bf4 chases the queen.",
        "21. Bf4 Qb6 22. Be5": "Taking the bishop off the f file to prevent any exchange sacrifice ideas, using the center, maintaining control of the b8-h2 diagonal.",
        "22... Rgf8": "Rook to an open file for mobility.",
        "23. Nd2": "Developing the knight with an idea of queenside castling.",
        "23... Qa5 24. O-O-O": "Not fearing the reaper.",
        "24... Qxa2": "Not so much worry for white because the queen is a sole attacker.",
        "25. Nc3": "The knight will be used for cover at b1.",
        "25... Qa1+ 26. Ncb1 Rf2": "With the idea of 27...Rdf8 to double the rooks and to exert influence on the 7th rank.",
        "27. Qh4": "A double attack. See e7 and f2.",
        "27... e3": "One of the replies to an attack is a counter attack, which in this case looks particularly threatening. But white has an idea with focus at c7.",
        "28. Qxe7": "The threat is 29.Qc7 mate in one. Black has to keep white occupied to prevent this threat.",
        "28... exd2+": "Check to keep white busy defending.",
        "29. Rxd2 Rf1+ 30. Rd1 Rxd1+ 31. Kxd1": "The knight is indirectly safe because if 31...Qxb1 , then 32.Kd2 and the black queen can not return to the a5-d8 diagonal where needed to prevent mate.",
        "31... Qa5": "The correct move.",
        "32. Qf7": "Shifting to a new plan involving e6-e7-e8Q, or e6-e7-exd8Q.",
        "32... c5": "Sadly, the rook at d8 is imobilized. Look at d7, d6, e8, f8, g8, and h8. These are all squares where the rook will be lost if it moves. This shows the quality of the bishop at e5, and the pawn at e6, and the influence of the queen at f7.",
        "33. e7": "Knowing the rook must meet its fate. Even now, 33...Rd7 is met with 34.Qe8  Rd8 35.exd8Q  Qxd8 36.Qe6  with mate inevidable.",
        "33... b5 34. Qe6+": "Driving the king away from the center before taking the rook.",
        "34... Kb7": "The only move.",
        "35. exd8=Q Qxd8 36. Nc3": "Bringing the knight to the action instead of dxc5.",
        "36... cxd4 37. Nxd5 d3 38. cxd3": "Taking is essential because the king needs to remain on the white squares and off the c file. The black queen is on the dark squares, meaning no direct checks on a diagonal.",
        "38... Qg5": "The last chance at play, the queen leaves the king alone.",
        "39. Qd7+": "Mate in 3. Corraling the king while avoiding direct lines with the black queen.",
        "39... Ka6": "If 39...Ka8 then 40.Qc8 mate.",
        "40. Qc6+ Ka5": "Note the pieces involved in the mate. The b3 pawn, the knight, the queen, and one more piece is needed - the bishop at c7 to finish.",
        "41. Bc7#": "A fun game against my portable opponent where I was able to practice some tactics and try some ideas against an opening that I haven't really tried much with."
    },
    "url": "https://gameknot.com/annotation.pl/b12-caro-kann-against-excalibur-dtc?gm=13139",
    "gameName": "B12 Caro-Kann against Excalibur DTC",
    "players": "Chessknave  vs. Excalibur ",
    "opening": "Caro-Kann defence (B12)"
}