{
    "moves": {
        "1. e4": "In this game, black (me) obtains major control of the game with a 7 or 8 point material advantage, but, the moral of the story, never give up!  Black makes a really, really bad move at 24 and allows white to knight fork its queen.  After that, things turned decidedly in white's favor.  White does an excellent job of executing the endgame.  White starts with the popular e4.",
        "1... c5": "Black sets up the Sicilian, which is often an aggressive counter-attack.",
        "2. c3": "I've come to learn from 1800  players that this is really smart.  I still don't know exactly why, but I guess it has to do with controlling the center 4 squares.",
        "2... Nc6": "Definitely Sicilian now.",
        "3. d4": "I usually like this because it gives me (black) the option to open up a hole in white's line.",
        "3... cxd4": "Which I exercise immediately.  Obviously, white can respond with cxd4 to balance out the trade or place the queen in the middle of the board.  Some like this for white, but I think it can be a weakness as it gives black a big target and an opportunity to chase the queen and develop at the same time.",
        "4. cxd4": "White plays it safe.",
        "4... e6": "Defends against d5.",
        "5. Nf3": "According to the GK database, this is:\n1. e4 c5 2. d4 cxd4 3. c3 Nc6 4. cxd4 e6 5. Nf3\nB21: Sicilian, Smith-Morra gambit\n(I just love these opening names.)",
        "5... g6": "I liked the fianchetto here, as it puts stress on d4.",
        "6. Nc3": "Three knights in play, pretty typical.",
        "6... Bg7": "Equal pressure on d4 at this point.",
        "7. Be3": "White regains the advantage on d4.",
        "7... Nge7": "I think I'm worried about Nf6, as it might attract e5.  The problem here is that it hinders black's development opportunities.",
        "8. a3": "Probably a wasted move on white's part.  I suppose it does prevent Nb4.",
        "8... O-O": "A relatively early castle.",
        "9. Qd2": "White looks to be in better position here.",
        "9... d5": "If white elected to capture, my responses would have been ...\n10.\texd5 \tNxd5\n11.\tNxd5 \tQxd5\n12.\tBh6 \tBxh6\n13.\tQxh6 \tNxd4\n14.\tNxd4 \tQxd4",
        "10. e5": "White opts to advance, which is generally a good move in this situation.",
        "10... Nf5": "Now, Ne7 doesn't look so bad.  Puts direct pressure on the bishop and forces white to maintain support of d4.",
        "11. Bd3": "White doesn't like the look things and sets up the possibility of a bishop-knight trade, one way or the other.",
        "11... Nxe3": "Black opts to trade.",
        "12. Qxe3": "The only move that doesn't compromise the short castle.",
        "12... Qb6": "Balancing pressure on d4.",
        "13. b4": "Na5 might have been interesting, but I think white was probably looking to force the Nc6 to act.",
        "13... f6": "Never forget the f-pawn.",
        "14. exf6": "If white doesn't take, white runs the risk of setting up a queen trade.  From white's perspective, this seems strong as it weakens black's castle.",
        "14... Bxf6": "But, perhaps white missed the pressure this now places on d4.  Ne2 would be a logical response.",
        "15. O-O": "But, white short castles instead.",
        "15... Nxd4": "So, black gains a pawn here.",
        "16. Rac1": "Another suspect move.",
        "16... Nxf3+": "What I expected ...\n17.\tgxf3 \tBd4???\n18.\tQe2 \tRf4???\n19.\tNa4 \tQd8???",
        "17. gxf3": "Black is happy here with stacked pawns in the castle, so far so good.",
        "17... Bd4": "Black is even happier.  Stacked bishop and queen on f2.  Trouble for white.",
        "18. Qh6": "On the one hand, this puts pressure on the king and sets up some late-game possibilities (which, in this game, actually worked), but I wonder if this was too rash of a response to the impending black attack.  Qe2 would have been sufficient.",
        "18... Rxf3": "Black is now up 2 pawns.",
        "19. Kh1": "Why not Qd2???",
        "19... Rxd3": "Black is up 5 points now.",
        "20. Ne2": "Another wasted move.",
        "20... Bxf2": "Black goes up 6.",
        "21. Nf4": "White appears to be eying a quick mate if he can get his knight into position.  Black eventually forgets about this knight to his own detriment.",
        "21... Be3": "I thought I saw a mate opportunity ...\n22.\tRc-e1 \td4\n23.\tNxd3 \tQc6 \n24.\tRf3 \tQxf3#\nCHECKMATE !",
        "22. Rce1": "As I expected.",
        "22... d4": "Building pressure in the middle of the board.",
        "23. Rxe3": "An interesting sacrifice.  White seeks to pressure the king.",
        "23... Rxe3": "Black is up 8 points now.  At this point, I wrote myself a note:  \"this is critical, be careful not to let your king get into check.\"  For some reason, I still managed to screw this up.\n24.\tNxg6 \tQc6 \n25.\tKg1 \tRf3\n26.\tRxf3 \tQxf3\n27.\tQf8  \tQxf8\n28.\tNxf8 \tKxf8",
        "24. Nxg6": "Obviously, I need to defend against the possibility of Qf8  .",
        "24... Qc6+": "I could have advanced the bishop to d7, I could have done any number of things.  Instead, I set myself up for a knight fork possibility.\n25.\tKg1 \tRf3\n26.\tNe7  \tKf7\n27.\tNxc6 \tRxf1 \n28.\tKxf1 \tbxc6",
        "25. Kg1": "Now, black's in a world of hurt with triple pressure on f8.",
        "25... Rf3": "A desperate move.",
        "26. Ne7+": "The fork.  Ugh.",
        "26... Kf7": "Kh8 might have been better.",
        "27. Nxc6": "Now, I'm down 2 and the king is exposed.",
        "27... Rxf1+": "Normally, I wouldn't trade when behind, but I don't think another option existed at this point.",
        "28. Kxf1": "Still down two.",
        "28... bxc6": "Temporarily up one point.",
        "29. Qxh7+": "Back to even and in check.",
        "29... Kf6": "Trying to protect the center pawns.",
        "30. Qh8+": "Keeping the pressure on.",
        "30... Ke7": "Moving to the center.",
        "31. Qxd4": "But leaving a pawn open.",
        "31... Bd7": "My note to myself at this point:  \"---DO NOT LINE UP KING AND ROOK---.\"  Black is desperate.",
        "32. Qg7+": "White keeping up the pressure.",
        "32... Kd6": "Trying to get over to the right side of the board to help stop pawn promotion.",
        "33. h4": "Which leaves a nice path for the h pawn.",
        "33... a5": "Why trade when you're behind?  Bad move for black.",
        "34. Qd4+": "Pressure.",
        "34... Kc7": "Black is just further abandoning the h file.",
        "35. h5": "Perfectly logical move.",
        "35... axb4": "Desperation.",
        "36. Qxb4": "This keeps the a pawn out of the way of the c pawn.",
        "36... Be8": "Not much to be gained here, but it's an attempt to move things around.",
        "37. Qe7+": "Smart check as it prevents any immediately possibility of black getting pieces into better position.",
        "37... Bd7": "The only move for black that prevents further immediate losses.",
        "38. h6": "Logical.",
        "38... Re8": "My hopes at this point were as follows:\n39.\tQf6 \tKd6\n40.\th7 \tKc7\n41.\th8=Q \tRxh8\n42.\tQxh8 \tKd6",
        "39. Qxe8": "But white makes a smart sacrifice as I can't stop the pawn promotion.",
        "39... Bxe8": "Too late!",
        "40. h7": "Here I come, crown me!",
        "40... Kd6": "Eeek.",
        "41. h8=Q": "A masterful turn of events for white.  I'll speed things along now in the annotation.",
        "41... Bd7 42. a4 c5": "Why not get the king over to the a file?",
        "43. a5 Bc6 44. a6 Kd5 45. a7 e5 46. a8=Q": "Another smart sacrifice, since white has what he needs to finish off black.",
        "46... Bxa8 47. Qxa8+ Ke6": "Kd4 would have been better.",
        "48. Qc6+ Kf5 49. Qxc5 Ke4 50. Ke2 Kf4 51. Qd5 e4 52. Qd4 Kf5 53. Ke3": "Black makes succinct moves to isolate the pawn.",
        "53... Ke6 54. Kxe4 Ke7": "The rest is just good solid use of the queen-king tandem.  Nice comeback sf115!",
        "55. Qb6 Kd7 56. Ke5 Ke7 57. Qc7+ Ke8 58. Kf6 Kf8 59. Qb8#": "Again, well executed by white.  gg"
    },
    "url": "https://gameknot.com/annotation.pl/b21-sicilian-smith-morra-gambit?gm=10935",
    "gameName": "B21: Sicilian, Smith-Morra gambit",
    "players": "sf115 (1494) vs. rpilaud (1502)",
    "opening": "Sicilian (B22), Alapin's variation (2.c3)"
}