{
    "moves": {
        "1. d4": "I wasn't sure how Ron would begin, but this what he played.",
        "1... d5": "Of course, I'm very used to the QPO.  Ron knows me and has, likely, seen me play this.  So, my prediction was that he would play the QG which is what he did.",
        "2. c4 c6": "As noted in the second to last annotation from Charles, I once played the QGA which didn't work out.  And, the reason that I don't just play the QGD is that my Bc8 would have less mobility.  Of course, it's standard, as well, but I just don't like it, as I'd rather have as much mobility as possible.  I just feel more comfortable that way, and Charles noted that the Slav Defense was more common then the QGA or QGD, and I see why based on how I feel.",
        "3. Nc3": "Of course, this also develops, but I believe that it's the most common response to the Slav.  The reason for that is because bhidragon played this move after I played the same defense.",
        "3... Bf5": "I put some thought about how to continue developing.  I had considered 3...Nf6, which is what I normally play.  But, I decided to do something a little different as this B is well placed.  Plus, it has a nice long diagonal as it covers 10 squares.  That gives it plenty of mobility which for me is a very valid reason to bring the LSB out right away.",
        "4. Nf3": "I'm not surprised to see Ron continue developing this way.",
        "4... Nf6": "As do I.",
        "5. cxd5": "But, I was surprised to see Ron go for the exchange right away.  But, I'm glad he did, as it enables me to play ...Nc6 at a later time since it won't block the c pawn.  Something else happened, instead which I, sort of, regret now.",
        "5... Nxd5 6. e3": "As I wrongly thought that this was a blunder.  I thought that Ron just left something en-prise, which would, at the very least, allow me to win the exchange.",
        "6... Nb4": "That happened right here, and if I didn't think that way, I would've continued developing with 6...Nf6, as opposed to, move the same piece twice.  I thought that this was an exception to the guideline and almost refrained from playing this.  At first, my thinking was that ...Nc2 would be a blunder because that would allow Qxc2??  Shortly after that, I realized that he can't because it's protected by my Bf5.  Therefore, my thought process was that Ron can't protect his Ra1, no matter what.  Well, this was unsound, and not much better then a cheapo tactic.  I forgot that he can and will easily revert this threat with loss of tempo.  As I overlooked 7.e4, but that isn't so bad since I can pin.  But, my thinking, however, was flawed.   ",
        "7. e4 Bg4": "This is what made the actual move not so bad, as I enjoy pinning my opponents pieces.  I always feel that there's some kind of pressure even when it's indirect.  The reason for that is because I feel tension whenever I wind up a pin, even if it's one just like this where it's not serious.",
        "8. a3": "And, I was prepared for this attack.  It wasn't a conditional move, however, since my anticipation was that Ron would play 8.h3.  Even if, however, a move is conditional, I don't set them as such, anymore.  As I feel that setting it would be unfair to someone I know extremely well.  So, I let the move be played, but with this, I decide to exchange pieces right away.  I'd normally hold off, but I realize that if I take, Ron can't recapture with the Q because of the N fork threat that I'd carry out.  Therefore, he must double up his pawns which will be of an asset to him, especially, since they're on the K side where you'd usually castle.",
        "8... Bxf3 9. gxf3 Qa5": "I almost retreated but didn't feel like placing my on the rim where it can be later attacked.  So, I try something fancy as I keep in mind that he'll lose the exchange if he takes now.  Believe it or not, I wouldn't have even considered this, but something just like this was played against me in a somewhat similar position.",
        "10. Qb3": "Thus, Ron bring in another attacker.",
        "10... e6": "I protect again.",
        "11. Bd2": "He reattacks.  And, this chain of events of even will continue for our next move.",
        "11... b5 12. Na2 Nb8a6": "?? But, this is where I miscalculate and lose material.  I thought that everything was even.",
        "13. axb4": "That's because I had considered 13...Nxb4 because of what would happen, if Ron is to recapture with either 14.Nxb4?? or even worse for him, 14.Qxb4.  Then, I realized that the only move Ron would play would be 14.Bxb4! which isn't good for black either, even if it appears to be.  Only one variation would work, but I'd wind up even worse, especially since white would also liquidate while ahead.  The line would be 14...Bxb4+ 15.Qxb4 Qxb4+ 16.Nxb4, and black is down the equivalent to an entire R.  By, retreating, instead, I'm just down a minor piece, which still isn't good either, but it's way better then the exchange variation.",
        "13... Qd8 14. Qc3": "Ron was ready to do more damage.  At the time, I would've overlooked, but this is more then just a fork, since that would be stopped by my Q.  But, it would, rather be in 3 says.  And, if Ron is successful, he wouldn't just win a pawn but another piece.",
        "14... Qb6": "Well, I wasn't going to allow that.",
        "15. Bd3": "Completing his development.",
        "15... O-O-O": "I thought about what to do here.  It's been a very long while, over a year, since I castled long.  As I generally prefer to castle short, as per the, \"When and Where it's Safe to Castle\" thread.  So, I just go by my gut instinct, but castling short would require to get my Bf8 out, whereas, my Q side is developed.  As such, I felt that it made more sense to castle the other way, instead.",
        "16. Be3": "Threatening the masked battery on my Q.  I'd normally allow the attack, with which, I'd be ready to retreat.  And, I felt that I made the right decision, as I figured that allowing 17.d5 would force liquidation.  But, it gets worse.  If, for example, if I were to respond with 16...Be7 and then white answered with 17.d5, my response would be 17...Qc7, and white could then quick play 18.Bf4, which would cost me, 2 more pawns.  As I'd now have to retreat my Q which would allow white to later take on g7.  My only fear was liquidation, but in the original variation that I thought Ron would do, black would, instead get counterplay.  And, I possibly would've gotten a piece back, but this new variation makes things even worse for black then I, originally, anticipated.",
        "16... Qc7 17. Rc1": "Trying to win my c6 pawn, but I underestimated the situation.  The threat that I was weary of was him winning extra material, P+N with something like 19.Qxc6 with the idea now of 19...Qxc6 20.Rxc6+ where he forks and get the Na6.  ",
        "17... Nb8": "So, I stopped that threat but cannot prevent Ron's next move.",
        "18. Bxb5": "Paradoxically, I at first, was very nonchalant about this move.  As my originally thinking was, no big deal because I can take with 18...cxd6??  But, we get into what the opponent wants, as what Susan explained.  And, I realized, oh yeah, that's right I can't.  As I used to forget something like this, but 18...QxQ# would, in fact be mate which is also why Ron played 17.Rc1  One of the easy ways to determine this threat was just how quickly Ron played this move, and that was just a few second.  So, there was added pressure here.",
        "18... a6": "Therefore, I went on the offense.  My idea is to play the man, as opposed to, the board now.  That's since I'm more then a piece down, as it was a chess tip from ION.",
        "19. Ba4 Bd6": "I'm trying to figure what else I can do, in any last attempt for counterplay.  My plan was to exchange pawns with 20...e5, which would enable me to attack the Q.",
        "20. d5": "But, this move makes the attack happen just as quickly.",
        "20... Be5 21. Qb3 exd5": "This, however, is where I go into the exchange variation with pawns.  I'm questioning if, perhaps, there's still some kind of attack that would give any chance of counterplay.  Of course, the answer is no, but there's always a little hope that the opponent would go wrong and allow a swindle.  That was just like some of the other not good games that I showed which later helped me.  So, that question will always be there.",
        "22. exd5 Rxd5 23. Bxc6": "For example, I almost played 23...Nxc6??  And, I wouldn't have considered anything else were the Q not on the same diagonal as my Rd5 which would, thus, lose further lose material.",
        "23... Rd6": "That's why I attack again.",
        "24. Be4": "This is where the game chat started.  redfoxrising: So how are you doing joe?  thewrongreason: I'm doing well, and you?  redfoxrising: doing well after a long day of work doing some of the blitz attack problems   ",
        "24... Nc6 25. b5": "This is what made me decide to annotate this game.  As Ron said, \"giving me some think outside the box type moves I consider in my games. makes me look for paterns in the board that are always in the problems\"  I responded with, I was having the same thing. For me, putting up the fight is just working out my brain, at that point.  Now that you mention it, I might be annotating this game at a later point, when all is said and done.  As it goes into where chess is still helping me in life, to make a long story short.  The more I thought about it, the more I realized that it, therefore, made sense to annotate this game, more or less, right away, have it finished, ASAP.",
        "25... Na5": "?? I was lost anyway, but this is now resignable.  Best, in my opinion, was 25...Qa5+ which I didn't consider, as noted below.  I then asked myself how I could've made this kind of blunder since I forgot that when RXQ, I'm in check.  Well, this blunder was caused by getting distracted.  I know that this is something that once made Ken upset, and I had days to move.  But, even if I logged out, and then came back on a different day, that distraction would've still been there from the same comment that made me decide to annotate the game, at once.  If that didn't happen, I would've, instead, played 25...Qa5+",
        "26. Rxc7+": "I resigned here.  What I have in my game notes was what my thought process right before 25.b5 and this move, and it went into my resignation.  In addition, it's very similar to my resignation note.  What's written in the notes reads, I was lost in all variations, either way. My thinking was that if 25...axb5, I'd have 26.Bxc6 and after 26...Rxc6 27.Rxc6 Qxc6, I'd have counterplay. But, instead, white would've answered with 26.Qxb5, and I wouldn't stand a chance. The only thing that might have held off would've been 25...Qa5+. The idea behind that would be to compensate. White, however, would likely play 26.Nc3 to prevent me from taking with 26...Qxb5. But, my response would instead be 26...axb5. But, white would have 27.Qxf7, afterwhich, my likely response would be 27...Nd8, since I'm no longer pinned. But, that would allow 28.Qf5+ where the B falls. If, instead, 27...Rf6 28.Qd5 Ne7 29.Qb7+ Kd8 30.Bg5 where that half pin loses material. The reason being is that if I try to break it with something like 30...Rg6, it's mate in 2. 31.Qxe7+ Kc8 32.Qb7# So, I'm lost in all of my variations. Best would've been 25...Qa5+, but black can't hold on that much longer, either.  There's something else that went into me resigning here as I thought about playing on a little longer.  But, as with charleshiggie's past annotations, this game also had to come an end right away.  As I had to start the annotation, yesterday, so resignation was essential here.  The reason for this is because things already started coming up that had to be jotted out at once.  It didn't happen on Friday, but I would've started losing sleep yesterday which is when I resigned, if I had not started the annotation when I did.  And, that also would've started to become a problem at work as well.  It would've been a similar scenario to the lead up of when things got out of control on February 6th.  And, it started with Ron's comment, as noted on his last move.\n    "
    },
    "url": "https://gameknot.com/annotation.pl/back-with-a-vengeance?gm=67949",
    "gameName": "\"Back with a Vengeance\"",
    "players": "redfoxrising (2148) vs. thewrongreason (1319)",
    "opening": "QGD Slav defence, Alekhine variation (D10)"
}