{
    "moves": {
        "1. e4": "Hello, this is my first game back here in gameknot. I regained interest in chess and thought to give it a go. This one was an interesting one where my opponents weak back row proved to be his doom. Any comments and tips on how to improve my game are welcome.",
        "1... c5 2. Nf3 d6 3. Bc4 Nf6 4. Nc3 Nc6 5. a3 e6 6. d3": "I decided to play the sicilian defense. As this was my first game in a while i couldn't recall theoretical lines that well.",
        "6... Be7 7. Be3 O-O 8. O-O": "This is usually the point in games where it starts to differentiate from theoretical lines. Both sides have castled and developed most of their pieces.",
        "8... a6 9. Re1": "Here it became apparent that white was planning for a e5 break ",
        "9... Re8 10. Bf4 b5": "Black gains some counterplay by pushing forward in the queen side",
        "11. Nxb5": "This isn't the most uncommon sac. It gets 2 pawns for a piece and enforces the pin on the knight, not sure if this was the right approach here though",
        "11... axb5": "Black accepts",
        "12. Bxb5 Bd7 13. c3": "This move surprised me. I was sure i was facing the e5 break on the next move. Not sure what my opponent thought of here.",
        "13... Ne5": "This move forces sime simplification. Whites bishop is hitting blacks loose one and threatens to win it by playing Nxf3+ if white ignores it.",
        "14. Bxd7 Nxf3+ 15. Qxf3 Qxd7": "Power of the earlier knight sacrifice has diminished. The bishop is removed and black stands better. White has some potential past pawns on the queen side if an endgame issues.",
        "16. Rad1 Bf8": "Here i thought of placing my bishop on g7, but it turns out to be a wasted turn",
        "17. e5": "This really should have been played earlier, it has way less effect now",
        "17... dxe5 18. Bxe5": "Black has a lonely pawn at c5 which could be a potential target",
        "18... Be7": "Protecting the knight",
        "19. d4 cxd4 20. Bxd4 Qb5": "This move hits b2, threatening to dissassembly whites queen side pawn majority",
        "21. Qe2 Reb8": "More pressure",
        "22. Qxb5 Rxb5": "Queens come off, and whites pawns might prove to be useful",
        "23. c4": "This protects the pawn and hits the rook",
        "23... Rbb8 24. Be5 Rbc8 25. Rdc1 Ra4": "The queen side pawns are bound to be dropping soon",
        "26. c5": "taking the pawn straight up didn't look appealing enough so i improved my knight instead",
        "26... Nd5 27. Bd6 Bf6 28. Re2": "Protects the pawn, but disconnects the rooks.",
        "28... Ra6": "Threatening Rxd6 due to the pin on the pawn",
        "29. Rec2": "This move doesn't help to parry whats coming",
        "29... Bxb2": "Bxb2! This hits the pawn, and the rook on c1.",
        "30. Rxb2": "White didn't spot the following move abusing the disconnected rooks and weak back row",
        "30... Rxd6": "If cxd6 rxc1 mate",
        "31. c6": "Black cannot take the pawn. His backrow is weakened also by the disconnected rooks",
        "31... h6": "Calm h6 ensures blacks advantage",
        "32. Rbc2 f5 33. a4": "This move releases control of a key square",
        "33... Nb4": "This forks the rook and the pawn",
        "34. Rc2c4": "Taking the pawn here would result in an end game thats hard to win, for me atleast.",
        "34... Nd3": "Hits the rook",
        "35. Rd1 Rdxc6": "White cant move the rook due to his weak back row, and taking the knight leaves a huge advantage to black here.   0-1"
    },
    "url": "https://gameknot.com/annotation.pl/back-row-issues-capitalised?gm=61282",
    "gameName": "Back row issues capitalised",
    "players": "lichtbrenger (1551) vs. vavavi (1536)",
    "opening": "Sicilian (B50)"
}