{
    "moves": {
        "1. e4": "A min-tournament game, I am white and I begin with the Open Game.",
        "1... e5 2. Nf3 Nf6 3. d4": "Petroff's Defense, one of those that, 20-25 years ago when I played competitively was thought to be weak for black but seems much more popular now. 3. d4 is the Steinitz Variation (it's interesting how many openings have a \"Steinitz Variation\" even though few of them have any signature moves in common with each other). Something to be said for being the first world champion...",
        "3... Nxe4 4. Bd3 d5 5. Nxe5 Nd7 6. Nxd7": "All main line stuff (for the Steinitz Variation) so far.",
        "6... Bxd7 7. O-O": "To pin the black knight with 8. Re1.",
        "7... Qf6 8. Bxe4": "Black found a really sneaky way to prevent the pin. 8. Re1? loses a pawn to 8. ... Qxf2+. White just shuts it down completely by taking the knight.",
        "8... dxe4 9. Nc3 Bc6 10. Be3": "That pawn on d4 looks lonely up there, it might need some defense soon. White certainly doesn't want his queen tied to defending it. However, there seems to have been a stronger move on the board for white that I missed.",
        "10... Bd6 11. d5": "This is the move I missed before. The black LSB is the only defender of the black pawn on e5. This move blocks that defense and drives the black bishop away, not allowing black to save the bishop and simultaneously defend the pawn.",
        "11... Bd7 12. Nxe4": "White takes the pawn, but moving the knight discovers an attack from black's queen to the white pawn on b2. However, black probably should leave the pawn alone. It's a trap that will net white the exchange and a pawn.",
        "12... Qxb2 13. Bd4": "Black's queen was en prise and had to move, and the undefended white pawn seemed ripe for the plucking, a trap black should have avoided for now black's in a bit of trouble.",
        "13... Qa3 14. Bxg7": "Now black loses the rook on h8. 14. ... Rg8 is usually strong, driving away the white bishop and exposing the half-open file at white's king (15. ... Bh3 would be painful for white, and in this position, 15. ... Qh3 might have been even stronger). However, white meets that with 15. Nf6+ and wins the black rook anyway. Still, 15. ... Ke7, 16. Nxg8 Rxg8 may have been a strong continuation for black, gaining that attack on white's castle at the expense of losing the exchange (which was going to be lost no matter what black tries, so might as well get the attack out of it).",
        "14... O-O-O 15. Bxh8 Rxh8 16. Nxd6+": "Up by a pawn and the exchange, white seeks to trade material, starting by eliminating the bishop pair. Black is faced with an ugly choice here, recapture with the c-pawn and end up with three isolated pawns or recapture with the queen.",
        "16... Qxd6 17. Qd4": "Black chose to recapture with his queen, but now the white queen forks the pawn on a7 (which black's queen would have defended from a3) and the rook on h8.",
        "17... f6 18. Qxa7": "White is threatening checkmate in one, 19. Qa8#.",
        "18... Kd8 19. Rab1": "Black's reply abandons the pawn on b7. White could take it immediately, but I spotted a little trap and preferred to bait the hook to see if black would nibble. So white deliberately leaves his pawn at d5 undefended (19. Qxb7 wins a pawn but it also defends d5 which I didn't want to do just yet). Probably not white's best course of action. If black declines the trap with 19. ... b6, white loses the opportunity to gain that pawn (and in the process passing his own pawn on a2). But, black already snatched at one baited trap, so white hopes for another.",
        "19... Qxd5 20. Qa8+": "Black took the bait. 19. ... Qxd5?? either loses the black rook on h8 outright, or trades black's queen for one of white's rooks.",
        "20... Bc8 21. Rbd1": "Down by the exchange and a pawn, and about to trade queen for rook (ending up down by queen+pawn for a bishop), black resigns."
    },
    "url": "https://gameknot.com/annotation.pl/baiting-two-traps?gm=22698",
    "gameName": "Baiting two Traps",
    "players": "blake84120 (1775) vs. gharman (1541)",
    "opening": "Petrov (C43), modern attack, Trifunovic variation"
}