{
    "moves": {
        "1. e4": "Sometimes I play chess with the club at my nephew's school. Most of their players aren't good so I don't have good games with them, but one player's opening mistake let me have a very nice brilliant win. Here it is.",
        "1... e5": "Black can play c5, e6, Nf6, c6, d6 and many other moves with imbalanced strategies and ideas. I recommend c5, but e5 is Black's soundest reply since it simply matches White in the centre.",
        "2. Nf3 f6": "This is an extremely weak move. Even though it seems fine, it blocks Black's knight's best developing square, it severely weakens the kingside (which I exploit nicely), and it doesn't aid in the development of any other pieces.\r\nBetter moves are Nc6 or d6, which also defend the pawn, but develop or aid in developing instead of weakening the kingside like the ugly f6 move.",
        "3. Nxe5": "This is the only way I can take advantage of Black's weakened kingside. Other moves lead to dull, very boring, drawish positions. Although I am sacrificing a piece, Black will end up losing more than just a piece.",
        "3... fxe5": "This is a horrible blunder that immediately loses, because of the strong attack I can gain against Black's weakened king. Black's best chance was to ignore the \"free\" piece and play Qe7, forcing my knight to move, then taking my e-pawn. Black will lose tempo because his queen has been developed early, but it will only leave me with a small advantage, unlike fxe5, which leaves me with a winning advantage.",
        "4. Qh5+": "This is the first tempo in my attack.",
        "4... Ke7": "Black can play g6 instead, but I win the rook after Qxe5  and Qxh8.",
        "5. Qxe5+": "I have centralized my queen (with tempo) for my attack, and am about to gain more tempo against the king.",
        "5... Kf7 6. Bc4+": "Black's king is under heavy pressure. It was barely the third move when Black's king became exposed, and I'm already launching a successful attack.",
        "6... Kg6 7. Qf5+": "The helpless king is being pushed further to the edge.",
        "7... Kh6 8. d4+": "Just look at my attacking forces, and Black's fleeing king. Black hasn't had time to develop any of his pieces since he is constantly on the run, while I've been able to develop my attacking forces with tempo to crush Black.",
        "8... g5": "Forced.",
        "9. h4": "Black is totally lost.\r\nI'm threatening Bxg5  winning the queen, not to mention many other tactical threats. Black cannot counter them all, and will either get mated or lose massive material. If Black moves his king then it's mate in 2, and if Black plays Qe8 trying to avoid losing the queen, then it's mate in 1. Black may as well just resign here because all my tactical threats are too overwhelming.",
        "9... Be7": "Black only sees my queen winning threat, so he steps right into immediate mate. Although it's probably good he did, because it spared him the embarassment of playing on in a totally losing hopeless position down a queen.",
        "10. hxg5+": "Double check!",
        "10... Kg7 11. Qf7#": "This is what happens when you weaken your kingside, especially in double king-pawn positions."
    },
    "url": "https://gameknot.com/annotation.pl/bakerbakers-game-against-ryan-springer-age-9?gm=2912",
    "gameName": "bakerbaker's game against Ryan Springer (age 9)",
    "players": "bakerbaker (1795) vs. R. Springer (-1200)",
    "opening": "Damiano's defence (C40)"
}