{
    "moves": {
        "1. e4 c5 2. Nf3 d6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 a6 6. Bg5 e6 7. f4": "So far, standard mainline Sicilian Najdorf moves.  At this point I wondered whether to play 7...b5, the Polugaevsky Variation, but it's so long since I looked at it that I ducked out.  From memory, the main advantage of it is that it quickly gets complicated but Black avoids problems defending his Be7.  So I continued with the main line.",
        "7... Be7 8. Qf3 Qc7": "Still in the main line.  8... h6 is also played.",
        "9. O-O-O": "and now the normal move is 9...Nbd7 but for some reason I felt like varying and got myself in an awful lot of trouble ...",
        "9... Nc6": "? I don't know how bad this is objectively, with the correct follow up, but it got me in an awful lot of trouble.  My 1999 signed issue of Nunn's Chess Openings doesn't even mention it, so I suspect that it really is known to be bad.",
        "10. g4": "A standard aggressive move from White.  I now began to realise the folly of my ways as I wanted to castle queenside and to do this after fianchettoing the WSB, meaning that I was still 3 moves off castling, while White was already nearly fully developed and had plenty of opportunities to create and exploit weaknesses in Black's position.\n",
        "10... b5 11. Bxf6": "! White starts to disrupt Black's plans.",
        "11... gxf6": "I preferred this to taking with the B, which would have immediately been pushed back by the g-pawn.  I didn't want to castle kingside anyway, so the doubled pawn and hole at g7 didn't yet worry me.",
        "12. f5": "! Again White asks difficult questions.  Now my WSB is tied to the defence of e6 unless I push it forward to attack White's N.  This looked superficially attractive as it appeared to block the centre, giving me time to complete my development ...",
        "12... e5": "?   but I think this was another mistake as it gave White the lovely square d5 for his N.",
        "13. Nd5": "!  White ignores the attack on the Nd4 and counter-attacks, forking Q and B.  Black has difficulty finding a safe square for his Q, given the risks of further forks of Q and R and the need to defend B and N, preferably without having to move the K.  Now I started to lose time on the clock ...",
        "13... Qb7": "Getting in the way of the planned development of the WSB but I couldn't find a better move.",
        "14. Nxc6": "! Again, white plays energetically, forcing another Q move.",
        "14... Qxc6 15. Rd3": "! and now the threat is Rc3, followed by a knight fork of K and R from c7.",
        "15... Qb7": "I think this was the only sensible move, however horrible it was to move the Q yet again.",
        "16. g5": "?!  I think White should have continued to threaten Nc7+ by playing 16. Rc3 but this pawn move also had its attractions.  Now I had to decide whether I had time to take the offered pawn ..., which would allow 17. f6 forcing my BSB to move and further blocking my development.",
        "16... fxg5": "I decided it was preferable to play this than to allow 17. gxf6, gaining a pawn for nothing and still forcing the BSB to retreat.",
        "17. Bh3": "!?  An unexpected follow up that threatened to make the pawn advance to f6 even more devastating.  However, I think White was maybe over-complicating things slightly now, rather than cashing in his advantages.",
        "17... h5": "! A rare chance to play an active move that threatened to fork Q and B from g4.  I was now more or less resigned to not being able to complete my development normally, so just had to take whatever tactical opportunities arose.",
        "18. Qd1": "! White avoids the fork and redirects pressure to the d-file.  The threat of 19. Nxe7 followed by 20. Rxd6 now preoccupied me, not to mention the lingering threats of Rc3 and Nc7+ or f6 followed by Bxc8....",
        "18... g4": "I continue my counter-attack.  This also offers my BSB the chance to escape the attentions of the Nd5 by flitting to g5 with check.",
        "19. Bg2": "White now has his WSB on the same diagonal as my Q, which necessitates further caution...",
        "19... Bg5+": "I was starting to breathe a bit more easily now as I appeared to have a bit more room on the board ... but not for long.",
        "20. Kb1 Rh6": "?! Still preferring not to move my K, I choose to start defending my d pawn along the third rank but this is soon scotched.",
        "21. Rc3": "! The long awaited threat of Nc7+ rears its ugly head.",
        "21... Bd8": "... necessitating this ugly move, which was the only way I could see to effectively meet the threat without making my position even worse.",
        "22. Qd2": "!  I hadn't foreseen this simple response, which forced my R back home again.",
        "22... Rh8 23. Rd1": "! White completes his development  and puts further pressure on the d-file.  Black is completely discombobulated at the back, despite being a pawn up.",
        "23... Bd7": "Giving up the hope of fianchettoing, I develop the WSB as best I can.  My priority now was to try to reconfigure my pieces any way I could to get them working together better.  I didn't expect to hold on to the extra pawn but still hoped to avoid greater losses...",
        "24. Rd3": "!  Now the d pawn is surely bound to fall and White also threatens to capture on d7, d8 or both thereafter.",
        "24... Ra7": "Unable to save the d-pawn, I decide to build up the defence of d7.",
        "25. a3": "?! This quiet move surprised me.  I'd expected White to force home his advantage by moving the N, (eg with 25.Nb4 or Ne3, though this might have allowed the BSB back to g5). ",
        "25... f6": "Now I decided that the best way to coordinate my pieces was to double rooks on the a-file and maybe counter-attack if given the chance.  My K would be no worse off on f7 than on e8.  Indeed it would be safe from White's N for the foreseeable future.  My biggest fear about this move was the possibility of 26. Nxf6 followed by 27. Rxd6 and general mayhem around my K.",
        "26. Qb4": "! White takes the direct approach to attacking d6 while retaining the aforementioned options.",
        "26... Qc6": "I defend d6 from the immediate threat , though I still didn't expect to save it forever.",
        "27. Rc3": "White tries to push the Q away from its defensive duty but allows me a counter-thrust that ease the tension slightly.",
        "27... a5": "! As White's Q has nowhere useful to go, this effectively forces the Q swap, thus reducing the overall threats to Black's King and giving Black the chance to free up his position.",
        "28. Rxc6 axb4 29. Rxd6": "At last White has regained material equality but Black's position is about to become much freer, once the pressure on the d-file has been neutralised.",
        "29... Rf8": "I felt that this was the best way to defend the pawn, as the K was needed to defend the Bs at this stage.",
        "30. Nxb4": "White gains the material advantage at the expense of releasing the pressure further.",
        "30... Be7 31. Rb6": "?! I think retaining pressure on the d-file was preferable, so a simple retreat to d3 or d2 would have been better.",
        "31... Bxb4": "! At last I can get rid of the pesky N! Neither of my Bs have ever been worth as much as the N in this game.",
        "32. axb4 Ke7": "and now there is the possibility of connecting my Rs!",
        "33. Bf1": "White seeks to pick off Black's pawns but I'm not sure this was the best way to go about it.  Doubling rooks on the 6th rank looks preferable to me, followed by Bf1.",
        "33... Rfa8": "! Black counters the threat to b5 by threatening mate in 1.  Of course, this threat is easily met but at least it is a threat, virtually Black's first really aggressive move in the game and prelude to a much more coordinated phase of play.  Although half an hour behind on the clock, I now harboured hopes of scraping by with a draw.",
        "34. c3": "White creates an escape square for his K.",
        "34... Ra7a1+": "! but the check still comes as I've now seen a way of virtually forcing a draw.\n",
        "35. Kc2 Rxd1 36. Kxd1 Ra1+": "! Now the K will be tied to the defence of the B and will temporarily block its attack on b5, allowing Black's R to sweep up some of White's pawns.",
        "37. Ke2 Rb1 38. Kf2 Rxb2+": "Material is once again equal but the key issue is White's need to protect the pawns on c3 and h2 as well as the Bf1.",
        "39. Kg1": "White escapes the checks and protects f1 and h2 but this allows Black to pin the B against the K and thereby save b5 and potentially achieve a draw by repetition.",
        "39... Rb1 40. Kf2": "First repetition on its way ...",
        "40... Rb2+ 41. Kg1 Rb1": "and here I offered the draw.  The match was evenly poised, as was the position, but I think White was disappointed at having failed so far to capitalise on his advantages and couldn't quite bring himself to accept that a draw was the best option.  He did, after all, have half an hour extra on the clock ...",
        "42. Rb7": "He turned down the draw by playing this move, returning the compliment of pinning my B.",
        "42... Kd6": "unpinning the B and advancing the K in good end-game style, though White's pawns currently prevent further advancement.",
        "43. Ra7 Rc1": "The only way of defending the c pawn is to retreat his R... and I have the initiative.  Though he could content himself with allowing me to capture on c3 and attack b5 again, as capturing on c3 would release the pin of the Bf1.",
        "44. Ra6+ Ke7": "Rather than blocking the check with my B, I retreat once more to defend the f6 pawn allowing my B scope to move.",
        "45. Ra3": "Alternatively, he could have played 45. Ra7, again pinning the Bd7, which would have enabled 45. ...Rxc3 46. Bxb5, giving him a remote passed pawn.",
        "45... Bc6": "Suddenly, White is about to go a pawn down.  He can't defend both c3 and e4.",
        "46. Ra7+ Bd7": "Or can he?  This is another opportunity to draw by repetition.",
        "47. Kf2 Rc2+ 48. Be2 h4": "! I spot an opportunity to attack, based on overloading White's K.",
        "49. Ra1 g3+ 50. hxg3 hxg3+ 51. Kf1 Rxc3 52. Bg4": "I think this was played to enable Bh3 to halt the g-pawn but White's pawns are left even more vulnerable...",
        "52... Bc6 53. Re1 Rb3 54. Kg2 Rxb4 55. Bf3 Kd6 56. Kxg3 Rd4 57. Kf2 b4 58. Ke3 Kc5 59. Rc1+ Rc4 60. Rb1 Rc3+ 61. Ke2 Bb5+ 62. Kf2 b3 63. Bd1 Bc4 64. Ke1 Kd4": "The last few moves having played themselves, Black is clearly winning and White resigned."
    },
    "url": "https://gameknot.com/annotation.pl/banbury-2-v-didcot-2-oxford-district-leagueme?gm=64333",
    "gameName": "Banbury 2 v Didcot 2 - Oxford & District Leagueme",
    "players": "Chris Evans  vs. Bob Jacobs ",
    "opening": "Sicilian (B99), Najdorf, 7...Be7 main line"
}