{
    "moves": {
        "1. e4": "Hi everyone!\n\nAs you know, I enjoy challenging Experts, Masters and Grandmasters.  So does Woustra!  He has now started to challenge much higher rated players and he found me!  As I have been there and done it all, the only advice I can give to Woustra is to stick at it, even though he may well get stung for quite a few games to come.  However, those games where he gives the likes of us a run for our money \"e.g. lasting 30 or 40 moves before losing material\" will gradually start to creep in, and then eventually the odd Expert or even Master Draw.  If that happens, Woustra, do stick that result on your profile wall - that will remind you that you can hold your own with the big guns.  This game proved to be a Baptism of Fire for Woustra and lasted 20 moves and here is the computer analysis:- http://gameknot.com/analyze-board.pl?bd=18421819&rnd=0.031244238702234583",
        "1... e5": "1. ..... e5 - here we have a double king pawn opening.  Good start, Woustra.",
        "2. Nf3 Nf6": "2. ..... Nf6 - the Petrov's Defense.  Not a bad idea.  Develops a piece and counter-attacks my e4 pawn.",
        "3. Nxe5 d6": "3. ...... d6 - this is the best move.  This will drive back my knight and black will win my e4 pawn back on the next turn.  This will result (as does the French Exchange Variation) in the opening of the e column early in the game.  As the two kings are in the centre, both sides must watch out for pieces being in an absolute pin (the piece will not be able to move legally as it will expose the king to check) against their king.  These pieces will be very vulnerable to attack by pawn stabs and will therefore be lost.  Sadly, that was exactly what happened to Woustra in this game.  So, Woustra - Lesson 1 - look out for pins on the e column and pieces lined up against your king, particularly your queen.",
        "4. Nf3 Nxe4 5. d4 d5": "5. ...... d5 - a good enough move as it opens up black's light square bishop and it gives black's steed a toe-hold in the centre.  However, as in my previous note - that black knight is on the same line as his king on the open e column!",
        "6. Bd3 Bg4": "6. ..... Bg4 - this is a reasonable move, a developing move followed by a pin.  But now, I land him a counter-pin on that e column - from Glenda!",
        "7. Qe2 Bxf3": "7. ..... Bxf3?? - this move gets a double question mark because I will not recapture the bishop with Glenda.  I am quite happy for my kingside pawn structure to be busted because I will net a whole piece on that open e column.  When the g pawn recaptures it will stab at the pinned knight on the e column.  As you will see ......",
        "8. gxf3 Nc6": "8. ...... Nc6 - a good developing move and hitting out at my pawn on d4.  However, that steed is gonna get pinned and I am gonna return the compliment - on the queenside.",
        "9. Bb5": "9. Bb5 - comme ca!",
        "9... Be7": "9. ...... Be7 - black gets his pieces out very quickly.  Although the pin is now broken, I do not take the knight immediately because I know that the knight on e4 does not protect the knight on c6, so I first take the knight on c6 with check.  Again, Ion - I still cannot resist this B for N exchange!",
        "10. Bxc6+ bxc6 11. fxe4": "11. fxe4 - now I take the knight.",
        "11... O-O": "11. ..... 0-0 - black sensibly castles and now Henry and Glenda are vulnerable to a pin on the e column.  I do not wish to play 0-0 here because Henry will feel very chilly on the g column and Glenda, his other half, is a little too far away to provide him with those fur pelts and medieval stockings!",
        "12. Nc3": "12. Nc3 - I realise that my queenside is undeveloped.  I have decided to put Henry on the queenside.  I must get those pieces out fast.  Whenever I get an opponent, whatever his rating, I analyse the board as though I was playing the Master Mater.  This move defends the e4 pawn.",
        "12... dxe4 13. Be3": "13. Be3 - again I decided to continue with my development.  I decided to eschew the pawn recapture as that e pawn blocks the e column, preventing a pin on Glenda and Fou Lenoir.  Henry is now able to castle kingside.",
        "13... Bf6 14. Qc4": "14. Qc4 - my c4 pawn is twice attacked, so Glenda defends it.  I am not prepared to return a second pawn for my piece.  Glenda also hits out at the pawn on c6.",
        "14... c5 15. Qxc5": "15. Qxc5 - now a pawn drops, but not the e4 pawn.  I am now a clear piece up.  Should I go for an attack on the king, or should I go for the slow torture, exchanging down until I get into a pawn ending with my extra piece?  I end up steering a mid-course with my next move.",
        "15... a5 16. Nd5": "16. Nd5 - I think I will go for the bishop on f6.  I will let black believe that I may take the c7 pawn.  I will not, though, because my c2 pawn will be hanging on the c file should Glenda be skewered by a black rook on c8.  Although black can recapture the bishop with his queen, that is another set of pieces exchanged and my advantage will be increased still further.",
        "16... c6 17. Nxf6+ gxf6": "17. ...... gxf6?? - this move is an outright blunder because it opens up the g column, right onto the BK and I have a WR able to move onto that file and give check.  Lesson 2 - Do not expose your king to attack in this way unnecessarily.  Although black's position is still dire, being a clear piece down, Qf6 will enable him to carry on playing and attempt to get some counterplay on the h8-a1 diagonal where Henry will want to castle.  However, I do not want the BK to go to h8 and then black move his rook to g8.  No, how can I stop this?  The answer is .........",
        "18. Bh6": "18. Bh6 - deadly.  Black cannot avoid the loss of further material.  Black tries to avoid it but runs into .........",
        "18... Re8 19. Rg1+ Kh8 20. Bg7+": "20. Bg7+ ...... wait for it ......",
        "20... Kg8": "20. .... ",
        "21. Bxf6#": "21. Bxf6 MATE!! ..... Old Matey!  Amazing, Henry is still in the centre of the board but he is perfectly safe, while the castled black king perishes on the g column.  Chess is a funny game, as no doubt, you the Inquest Jury will agree."
    },
    "url": "https://gameknot.com/annotation.pl/baptism-of-fire?gm=46816",
    "gameName": "Baptism of Fire!",
    "players": "jstevens1 (1954) vs. woutstra (1139)",
    "opening": "Petrov (C42), classical attack, Chigorin variation"
}