{
    "moves": {
        "1. e4": "Hi everyone!\n\nMy buddy Gerhard/Chicoboy asked me to annotate this brevity.  His Class C opponent Dan, resigned, presumably because he thought he was gonna cop Old Matey.  However, Gameknot Analysis provided a way out for Dan, although it did state that Dan had a positional disadvantage of exactly 1 point - so, I guess there was a potential for a resignation on the grounds of ruinous loss of material x moves down the line.  So, how did all this happen?  Well, read on......",
        "1... e5 2. Nf3 Nc6 3. c3": "3. c3 - a Ponziani Opening - quite rarely seen in chess tournaments but playable.",
        "3... Nf6": "3. ..... Nf6 - development.",
        "4. d3 d6 5. h3 d5": "5. .... d5 - perhaps d5 could have been played the move before, or perhaps Gerhard wanted to see what move Dan was gonna make before he decided to play this pawn move.  This now leads to a pawn trade.",
        "6. exd5 Nxd5 7. Be2": "7. Be2 - clearing the way for castling.",
        "7... h6 8. Nbd2 Nf4 9. O-O": "9. 0-0 - very natural, but is Dan gonna castle into it?!",
        "9... g5": "9. ...... g5 - pawn storm in progress!",
        "10. Nh2 h5 11. Ne4 g4 12. hxg4 hxg4 13. Nxg4 Qh4": "13. ..... Qh4 - Dan's king is now starting to shiver betimes.  A dark, dark shadow is hanging over him.  There is only one way for King Dan to elude the Chessic Grim Reaper and it is 14. f3 which he plays.",
        "14. f3 Bxg4 15. fxg4 Qh2+": "15. ..... Qh2+ .... and here Dan waves the white flag.  So the Black Queen's bark was worse than her bite!  To Gerhard's credit, he can say that he swindled his opponent into a premature resignation.  One must remember that a premature resignation is as bad as leaving your king to cop Old Matey.  We have all been there and if and when we resign, we make the decision that seems right at the time and to the best of our knowledge.  I will therefore be contacting both players respective mentors regarding this result for their valuable input.  Anyhow, Gerhard, kudos to you - you have kept your rating in the 1300s for quite a while now and are nudging up to 1350 - keep it up!  As for you, Dan, I know only too well what you are capable of when you are at the top of your game against Class A 1800 oppo. and I can see your rating get back into the mid-1500s sooner or later ......"
    },
    "url": "https://gameknot.com/annotation.pl/bark-worse-than-bite?gm=53295",
    "gameName": "Bark worse than Bite!",
    "players": "pennsylvaniadan (1516) vs. chicoboy (1322)",
    "opening": "Ponziani (C44), Jaenisch counter-attack"
}