{
    "moves": {
        "1. e4": "From both sides of the table, Part 1. Joanne Stevens has already annotated this game, so I include her comments, and mine! Her comments are in inverted commas",
        "1... c5 2. Nf3 Nc6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 d6 6. Bg5": "The Richter-Rauzer attack against the orthodox open Sicilian defence. Probably white's strongest move here.",
        "6... Bd7": "Black need not fear BxN immediately, black has adequate compensation in the two bishops and open g file.\r\nAfter 6. Bg5 I used to have fun in quickplay games with 6.....Qa5. It isn't really any good though if white knows what to do against it.",
        "7. Qd2 Rc8 8. f4 Nxd4 9. Qxd4 Qa5": "This has all been seen before. Normally white will play 0-0-0 here. What Joanne played has been seen before, but is probably not as good as the more standard 0-0-0",
        "10. Bxf6": "\"10. Bxf6 - I decide to exchange B for N to break up black's kingside but is this another case of an inappropriate exchange.  I do end up missing Frere Lenoir later on.\" - So she seems to agree with me!",
        "10... gxf6 11. Be2 h5 12. O-O Qc5 13. Qxc5 Rxc5 14. f5": "\"Here is that game I mentioned at the beginning re Krupa Dominik (2091) vs. Bylino Oleg (2255)\r\n1. e4 c5 \r\n2. Nf3 d6 \r\n3. d4 cxd4 \r\n4. Nxd4 Nf6 \r\n5. Nc3 Nc6 \r\n6. Bg5 Bd7 \r\n7. Qd2 Nxd4 \r\n8. Qxd4 Qa5 \r\n9. f4 Rc8 \r\n10. Bxf6 gxf6 \r\n11. Be2 h5 \r\n12. O-O Qc5 \r\n13. Qxc5 Rxc5 \r\n14. Rad1 f5 \r\n15. Rd5 Bg7 \r\n16. Rxc5 Bd4  \r\n17. Kh1 dxc5 \r\n18. e5 h4 \r\n19. Bb5 Bxc3 \r\n20. Bxd7  Kxd7 \r\n21. bxc3 Rh6 \r\n22. Rb1 Kc7 \r\n23. Rb5 Ra6 \r\n24. Rxc5  Kb6 \r\n25. Rd5 Rxa2 \r\n26. Kg1 Rxc2 \r\n27. Rd7 a5 \r\n28. Rxe7 a4 \r\n29. Rxf7 a3 \r\n30. Rf8 a2 \r\n31. Ra8 Rc1  \r\n32. Kf2 a1=Q \r\n33. Rxa1 Rxa1 \r\n34. h3 Kc5 \r\n35. g4 hxg3 e.p.  \r\n36. Kxg3 Kd5 \r\n37. Kh4 Rg1 \r\n38. Kh5 Ke4 \r\n\r\nIn this game white's queenside pawn structure got busted.  I tried to avoid it but to no avail.  Here in this game white resigned on the grounds of ruinous loss of material - I would have resigned at move 33.  At least my game lasted longer!\"\r\nI was also following the same game, and happy that we were following a game where black won!",
        "14... Bh6 15. Bd3 Be3+ 16. Kh1 Bc6 17. Rab1 Re5": "e5 is a lovely square to put a black piece on. It took me some time to decide whether to put the rook or the bishop on it. Eventually I decided on the rook, and use my black squared bishop to exchange for her knight, increasing pressure on the white e pawn.",
        "18. Rfe1 Bd2 19. Re2 Bxc3": "\"20. bxc3 - but that dreaded exchange which I had been trying to avoid with my 14th move has come to pass.\"\r\nI also thought this was very good for black. White's pawns are so weak, a good example for beginners - the e pawn is backward - cannot be defended by another pawn. the c pawns are doubled and isolated and the a pawn is isolated.",
        "20. bxc3 Rg8 21. h3 e6 22. fxe6 fxe6": "\"22. ...... fxe6 - black improves his central pawn structure.\"\r\nTrue - and I was glad to see my pawn structure improve, but I am not sure there is anything better - otherwise I can just exchange on f5 and exchange rooks. Her f pawn is weak and my other rook and bishop are targetting her g pawn.",
        "23. Rg1 Ke7 24. Kh2 Ra5 25. Ra1 Rag5 26. Rg1 Rc5": "She has protected her g pawn, so I have to go after her weak queenside pawns.",
        "27. c4": "\"27. c4 - Frere Leblanc becomes a star - in more ways than one!  He is the glue that is holding my shattered queenside together.  How long will I be able to hold out though?\"\r\nIt may be defending 4 pawns, but really it is a horrible bishop. It has no mobility at all",
        "27... b6": "It is generally a good idea to put the pawns on the opposite colour to my bishop",
        "28. g3 Bb7 29. Rb1 Rgc8 30. Rb2 Ba6": "White has to lose a pawn",
        "31. Kg2 Ra5 32. Rf2 Bxc4 33. Bxc4 Rxc4": "But at least white gets rid of her bad bishop and the lost pawn was a doubled pawn. Perhaps black should not have taken it yet?",
        "34. Rf4": "As now white has an active rook.",
        "34... Rca4 35. Rh4 Ra4xa2 36. Rxa2 Rxa2 37. Rxh5 Rxc2+ 38. Kf3 Rc3+ 39. Kg4": "Perhaps Rc3  is a mistake as it just drives her king up the board to where it wants to be? What do you think dear reader?",
        "39... a5 40. Rh7+ Ke8": "White is fighting back well. White achieves 7th rank absolute, in other words the white rook is on the 7th, permanently preventing my king from advancing up the board.",
        "41. Rb7 Rb3 42. h4": "\"42. h4! - unbelieveably I am threatening mate in 5 but can black thwart my plans - he does unfortunately with my co-operation. Wanna see how? Read on.\"",
        "42... Rb4": "I stopped and had a long think at this stage. I think that there is still a lot of work to be done, and white's best bet may be to ignore my attack on the e pawn and just push the h pawn again. I didn't really like the look of lines like 43. h5 Rxe4  44. Kf3 Re1 45. Kg2 Re5 46. g4 and white still has some chances of a draw",
        "43. Kf3": "ionadowman (2043) on 03-Nov-08 commented\r\nI think Joanne went wrong at the 43rd move. The line suggested by charleshiggie in his previous comment keeps White in the fight, but I rather prefer 43.Kh5!? as also offering chances of attack: 43.Kh5 Rxe4 44.Rxb6 Kd7 (say) 45.Ra6 f5 (to bring the rook to g4) 46.Kg6!? (I dislike 46.Rxa5 Rg4 as the WK is left cut off on the h-file) ...Rg4  47.Kf6 Rxg3 48.Rxa5 f4 49.Ra7  Kc6 50.Kxe6 Rh3 51.Kf4 Rxh4 52.Kg5 Rh1 53.Kxf4 Re1 54.Ra6 . This is just a sample line, and maybe both sides could find improvements, but in this line Black's win seems as far off as ever. Note that the King's advance to h5 broadens White's scope, retaining the (albeit slender) chances of promoting the h-pawn, but creating also prospects of bringing the WK in amongst Black's centre pawn phalanx. From its adavanced position, the WK might get the opportunity tho shepherd the h-pawn home. In the position White had at that point I feel sure I would have played 43.Kh5.",
        "43... Rb5 44. g4 a4": "45. \"h5 - one move nearer to my goal, but ....\"\r\nbut black has also advanced his passed pawn....",
        "45. h5 Rb3+ 46. Kf4": "46. \"Kf4?? - ....... would Kg2 have at least drawn the game?\"\r\nI don't think so, black has to move the king over to block the passed pawn, 46. Kg2 Kf8 47. h6 Kg8 and black seems to be winning easily\r\ndmaestro (1628) on 02-Nov-08:\r\nBlack brings the king over to block the passed pawn, and retains passed pawns. White can't do anything to force the pawn to queen.\r\nionadowman (2043) on 02-Nov-08:\r\nI don't think the move played deserves the two queries - or even just one. There isn't really a whole lot to choose between the move played and 46.Kg2. Of course, White can hope Black will throw away the win by 46.Kg2 a3?? 47.h6! and there's no way to stop the h-pawn accept by a perpetual (47...Rb2  48.Kg3 Rb3  49.Kg2! - not 49.Kh4?? Rb1! - etc). But 46...Kf8 47.h6 (Ra7!?) Kg8 48.Rg7  Kh8 49.Ra7 and White's counterattack has been held to a standstill. Since 46.Ke2 don't look at all enticing, only the text move remains...",
        "46... a3 47. h6 Rh3 48. g5 Rh4+ 49. Kg3 fxg5": "\"Here I decided to wave the white flag on the grounds of ruinous loss of material, viz:- 49. Kg3 fxg5 50. Rxb6 Ke7 51. Ra6 Rxh6 52. Rxa3 Rh4 53. Re3 Kf6 \""
    },
    "url": "https://gameknot.com/annotation.pl/barmy-army-mini-tournament?gm=20723",
    "gameName": "Barmy Army Mini Tournament",
    "players": "jstevens1 (1734) vs. charleshiggie (1951)",
    "opening": "Sicilian (B58), classical"
}