{
    "moves": {
        "1. g4": "This signifies the Grob Attack, an opening with which Basman is considered an expert.  In fact, a case could be made that Basman is THE expert in this opening.\n\tNot much literature has been published on the Grob.  The most in depth book has been written by Basman, expanding on ideas of Henry Grob himself.  While I’ve never played the Grob, I have played against and been beaten by it (but then, I’m better at analyzing games than actually playing them…).  The main appeal is probably its ability to surprise your opponent.  I know I certainly was.  In amateur or speed chess, it can be an effective tool to take the game into territory with which your opponent is not familiar, but at higher levels, black will, with sound play, most likely to be able to exploit white’s lack of development and the space which has been conceded.\n\tWhile it does not hinder the development of the king’s knight, it unnecessarily weakens the f4 square, which can become a target for black.  Also, the move does nothing to release the bishops or queen, and does not stake claim to the center.  In other words, there are “better” moves for white.\n",
        "1... e5": "One of two standard responses by black, the other being 1. …d4.  I believe 1. …e5 to be superior for a few reasons.  First, it’s a solid move, attacking the center, not hindering the knights, etc, all according to classical opening theory.  Second, it directly attacks f4, the square weakened by white’s first move.  The third reason is slightly more subtle.  White plans to put a bishop on g2, which will take dead aim at d5.  By delaying moving the d-pawn to d5, black robs white’s bishop of a potential target.",
        "2. h3": "Standard Grobbish practice, or so I’ve read.  Protecting the pawn which will come under attack when black decides to move the d-pawn.  Premature prophylaxis due to a self imposed poor opening choice.  2. h3 does little for development, although moving the pawn to h3 is often desirable in many openings due to it’s preventative nature.",
        "2... d5": "With his second move, black has obtained a classic pawn center and released both bishops and the queen.  Black’s lead in development and space, while only two moves old, is significant.",
        "3. Bg2": "White’s plan is taking shape.  The light squared bishop will hopefully be a powerful sentinel stationed ominously at his post, but it’s too early to tell at this point.  White’s position is not terrible, but, again, white could have done better.  (Crafty gives black about half a pawn at this point)",
        "3... Nc6": "Black calmly continues his development.",
        "4. c4": "This is white’s first aggressive move that has practical applications.  He exerts additional pressure on d5.  He hopes to either draw black further out (if black plays the pawn to d4), or to bust up black’s powerful center by offering the c-pawn.  If black is drawn out further, he will weaken his control on the central light squares and also allow white to thrust a spike into the center by moving a pawn to e4.  If white is then further allowed to close off the center, he will have a formidable wedge on the QS.  This would diminish the power of the bishop on g2, but he still has the dark square bishop, which he can operate successfully outside the pawn wedge.",
        "4... dxc4": "Black accepts the c-pawn, confident that his lead in development and extra pawn will compensate for his giving up his powerful pawn center.",
        "5. Qa4": "A scary looking move, but one that is easily thwarted.  He effects a pin on the knight while at the same time attacking the wayward pawn on c4.  Black’s e-pawn is now undefended, but the threat is not immediate, as white is at least a tempo away from attacking the it.  Black can calmly address the issue.",
        "5... Nge7": "Preparing Ng6, which serves to develop the knight as well as protect the e-pawn.  Black seeks to remain a tempo ahead.  This move is also superior to Nf6, because there remains the threat of  6. g5, forcing the knight away.  This is pretty much the only advantage white has gained over black with his first move.",
        "6. Nf3": "Solid development, and attacks the e-pawn.",
        "6... Ng6": "Stations the knight on a decent if not ideal square, and protects the e-pawn.  Also threatens Nf4, which is weakened, and attacks the bishop on g2, on the shoulders of whom white rests many hopes.",
        "7. Nc3": "Blocking the c-pawn, which black may have sent into the defenses as a battering ram to smash up white’s KS pawn structure, which would prove more beneficial due to the fact that white’s QS structure is already suspect.  Also, this attacks the two important squares d5 and e4, which the gambit of the c-pawn has weakened for black.",
        "7... Be6": "A solid, centralizing move.  Black defends the c-pawn now that the prospect of the battering ram is put on hold.  This also fights for some of the light squares.",
        "8. h4": "Preparing to move the knight to g5, which is a good square for him, but again, harkening back to the opening, white has forced this turn of events.  Any sort of fluidity and see-where-the-game-goes has been lost, and white is forced to attack the QS, even if it’s not the best way to proceed.",
        "8... Bb4": "Injecting the bishop into the opponents KS and somewhat forcing white’s e-pawn to stay home.  The knight is the only defender of the queen, and moving the e-pawn pins it to the king.  Miles can afford to be aggressive here.",
        "9. Ng5": "Getting the knight to its best post given the position, and putting pressure on black’s light squared bishop.",
        "9... Bd7": "Calmly retreating the bishop.  The knight still eyes f7, however, white’s other pieces are not sufficiently coordinated to make this threat debilitating.",
        "10. Bd5": "White finds arguably the only other weakness (aside from f7) and places his bishop proudly on e5.  The only nuisance the bishop could feel is if the c-pawn is suddenly freed.  Given that moving the knight will unleash a discovered attack on the queen, and that the knight has a perfectly good square to which to move (d4), this scenario might not be as far off as white is hoping.  In terms of time, this does force black to take care of the ugly proposition of Nxf7, losing the exchange.",
        "10... O-O": "The threat of Nxf7 is effectively neutralized with this natural move.  Even if white were to take on f7, then after 11. Nxf7 Rxf7 12. Bxf7+ Kxf7, both of white’s best placed pieces will have been eliminated, and black still stands a pawn up.",
        "11. Qc2": "Basman retreats his queen and places her on the b1-h7 diagonal where she is much more powerful, although her pressure is indirect.  White’s attack has fizzled and he has no immediate targets with which he can threaten black.",
        "11... Bxg4": "One of the downsides of the failed attack is that the g pawn was made undefended by the h4 push.  Seeing no reason not to, Miles sends his bishop to gobble up the wayward pawn.",
        "12. Qe4": "An anemic threat at best.  Black’s light squared bishop has too many comfortable escape squares for this to be bothersome.  White’s queen is now, however, better centralized, but black’s powerful e-pawn handicaps her quite a bit.  Again, this harkens back to the opening choice; black was able to place the pawn there because white didn’t address the possibility that he would.",
        "12... Bd7": "With its mission accomplished, the bishop happily retreats.",
        "13. Nxh7": "Perhaps a desperate ploy by white, but the attack to the rook is real enough.",
        "13... Nd4": "Miles completely ignores the threat to the rook and instead begins an attack of his own.",
        "14. h5": "The intent of this move is clear, but in retrospect, as is the case with most things, the real drawback of this move can bee seen…",
        "14... Nf4": "It seems that both Basman and Miles missed the insidious Bf5! which forces the white queen of the board.  14. …Bf5! (and the queen is trapped.  If 15.  Qe3, then 15. …Nc2+ forks the king, queen, and a rook!) 15. Qxf5 Nxf5 16. hxg6 leaves black up a piece and a pawn.  The only way to save the queen is 15. Qg2, which Basman probably could have taken his chances with, but after 15. …Nf4, black’s attack is devastating.",
        "15. Nxf8": "White takes the rook, evening his chances slightly.  He now has his guns trained on the black king’s position.",
        "15... Qxf8": "Black takes back and needs to consolidate here, or at least, not allow white further into the territory.",
        "16. Kd1": "I’m not really sure the purpose of this move.  It almost seems like a waiting move to see if black weakens himself at all.",
        "16... Re8": "Miles again misses the Bf5 attack.  He brings his last big gun to the party, but it will require some maneuvering before it can be effective.",
        "17. Bxc4": "Basman snatches at the loose pawn.  Much better would have been Rg1, getting the at-this-point useless rook involved in the scuffle.",
        "17... Bc6": "A menacing looking skewer, but white has a ready reply.",
        "18. Nd5": "Of the two ways to break the skewer, this may be the more appealing one.  Either way, the interposing piece will be lost to Nxd5, and apparently Basman feels his chances of counterplay are better with the bishop rather than the knight.  In all fairness, his chances look bleak either way.  Barring a major misplay by Miles, Basman’s attack has virtually collapsed.",
        "18... Qc5": "The dagger in the heart of the white defenses.  White cannot defend both the bishop and the knight.",
        "19. d3": "Saving the bishop at least, but creating a dangerous weakness around the king, and with both knight roaming dangerously close, the weakness’s exploitability is heightened.",
        "19... Nxd5": "Getting rid of the interloper and threatening a discovered skewer on the white queen.",
        "20. Rg1": "The true last ditch attempt to attack black’s KS position, and breaking the potential skewer.  It is, I fear, too late for white however.",
        "20... Nf4": "It’s hard to give this move a “?” seeing as how it’s not a bad move, but black had a much more devastating move at his disposal:  Ba4+!  After 21. b3 Nc3+! (utilizing the weaknesses incurred by the d3 and b3 moves.  The hole at c3 is enormous) and the queen falls.  The move as it stands is by no means a blunder or even a bad move, just not the best.",
        "21. Qe3": "The only move that saves the queen.",
        "21... Ndxe2": "And black resigns.  He will lose the rook, which held all of his counter attacking chances, and the bishop will fall soon after.\n\n\nI think the lesson that can best be taken from this match is: Unsound openings are unsound for a reason.  Even in the hands of an expert in the opening, against proper play, more often than not, the strengths the opening allows the opponent will be too great to overcome.  Of course, there will be exceptions, like the Karpov-Miles match, but in order to overcome the weaknesses, it helps to play like Tony Miles!  \n"
    },
    "url": "https://gameknot.com/annotation.pl/basman-miles-manchester-1981?gm=33398",
    "gameName": "Basman-Miles, Manchester, 1981",
    "players": "Basman, Michael  vs. Miles, Anthony ",
    "opening": "Grob's attack (A00)"
}