{
    "moves": {
        "1. d4": "Queen's Gambit",
        "1... d5 2. c4": "Of course main line is to not capture pawn",
        "2... e6": "good defence, but c6 for Koro-Kahn Defence is just as solid",
        "3. a3": "This is to prevent Bb4, which is a very annoying move",
        "3... Nf6 4. Nc3": "Knight is now safe and able to hold its square on c3",
        "4... c5": "This move I do not know how to respond to, in real life Black always plays Bd6 and c5 with my pawn and there is no problem. I don't mind this move, because it's like the Gambit I played",
        "5. Bg5": "The Knight is backing up his center, so I decide to put some more pressure on it",
        "5... Nbd7": "Defending just in case",
        "6. e3": "Finally the ideal situation for me",
        "6... h6": "I really don't like this move, but since I don't know which side he will castle my Bishop will continue to pin the knight, or control the center",
        "7. Bf4": "I decided that the center needed some more control",
        "7... g5": "Now I know if he castles King Side the pawns are vulnerable",
        "8. Bg3": "Usually h4 and King's side castle become really dangerous",
        "8... Bg7": "Putting more defence for a castle but pawns are main defence and they are moved too far out",
        "9. Bd3": "Planning to put more pressure to force him to castle Queen, but he does so anyways",
        "9... O-O": "Now Queen c2 for a battery in the near future",
        "10. Nf3": "Bringing another attacker into the King side",
        "10... g4": "Moving the pawns even farther? I just easily avoided this and also moving my Knight closer to the Black King",
        "11. Ne5": "I wanted a trade so the pieces are cleared. I have so many more attackers in this position",
        "11... Qb6": "I saw the potential of his attack so I decided the only thing I could do was counter attack",
        "12. Qc2 Nh5": "Again forcing my pieces into better positions. This is just plain suicide",
        "13. Bh4": "I didn't know about this move, but I didn't want to trade because my Bishop is vital to my attack",
        "13... f6": "Again, too far out with his pawns, I just magnificently beat him now",
        "14. Ng6": "Ne7 is unpleasant, because then the rest of my attackers will rush in",
        "14... Re8": "Preventing my good move",
        "15. cxd5": "First nail in coffin. I wanted to clear some pieces so my attack could become more deadly",
        "15... exd5": "I wanted to castle but my pieces were just begging to get in the fight",
        "16. Nxd5": "Beautiful attack on Queen and because of this all his pieces need to relocate",
        "16... Qe6 17. Nc7": "Muhahaha Ultra fork",
        "17... Qc6": "Attacks my Knight, but the Queen has been deceived and Mate in 3",
        "18. Bc4+": "Mate in 2, unless he gives up rook and queen",
        "18... Kh7 19. Nf8+": "Double check, so mate in 1. See it?",
        "19... Kh8 20. Qh7#": "Time to die"
    },
    "url": "https://gameknot.com/annotation.pl/beautiful-queens-gambit?gm=26981",
    "gameName": "Beautiful Queen's Gambit",
    "players": "God24 (1053) vs. Neo675849 (917)",
    "opening": "Queen's gambit declined (D30)"
}