{
    "moves": {
        "1. d4 Nf6 2. c4 c5 3. d5 b5 4. cxb5 a6 5. e3 g6 6. Nc3 Bg7 7. Nf3 O-O": "All the game started from this position, with White to move.",
        "8. bxa6 d6 9. Bc4 Bxa6 10. Bxa6 Nxa6": "A fairly standard sequence of exchanges for this opening.",
        "11. a3 Nc7 12. O-O Qb8 13. Bd2 Nfxd5 14. Nxd5 Nxd5": "I have regained the gambit Pawn. The middlegame is even at this moment, with my spatial advantage balanced against White's passed Pawn. I have to convert my advantage into something tangible because if an end game is reached the passed Pawn becaomes a much larger advantage for White.",
        "15. Rb1 Nb6 16. b4 cxb4 17. Bxb4 Nc4": "A few manuevers leave the position slightly simplified but still balanced.",
        "18. Qb3 Rc8": "I'm trying to use the opened Q-side to my advantage by securing attacking routes.",
        "19. Nd4 d5": "To support my Knight.",
        "20. Qa2 e6": "Securing a solid Pawn chain.",
        "21. Bc3 Qa7": "Trying to eliminate the passed Pawn and secure a material advantage.",
        "22. Nb5 Qa6": "Still focusing on the QRP as I duck out of the Knight's attacking range.",
        "23. Rb3 Bxc3": "Intiating a small sequence...",
        "24. Nxc3 Nxa3": "...which finally wins the Pawn.",
        "25. Ra1 Qd3": "The tactics start to get complicated. Right now we are both trying to win each other's Knights.",
        "26. Na4 Qa6": "I have to admit that here I didn't calculate everything 10 moves ahead, simply gambling that I would emerge with an advatage after the tactical knife-fighting came to a conclusion. Sometimes you have to grab the tiger's tail and hang on for the ride.",
        "27. Rxa3 Rc4": "I'm momentarily behind in material. However, my trump card is a potential back rank mate.",
        "28. Nb2 Qxa3": "Now after the exchange of Queens, White cannot capture the Rook (29 QxQ RxQ 30 RxR??? R-B8 ch 31 N-Q1 RxN mate.)",
        "29. Qxa3 Rxa3": "Whie has to move his Rook away, and he does. ",
        "30. Rd1 Rc2": "I press the attack.",
        "31. Nd3 Rca2": "The best move here for White is P-R3, eliminating the back rank mate threat. Instead, he blunders away any hope of dragging out the game.",
        "32. Rf1 Rxd3 33. h3": "With his Knight gone, White chooses to resign here."
    },
    "url": "https://gameknot.com/annotation.pl/benko-gambit-half-accepted-mini-tournament?gm=42702",
    "gameName": "Benko gambit half-accepted mini-tournament",
    "players": "michas2007 (1312) vs. last_archimedean (1335)",
    "opening": "Benko gambit half accepted (A57)"
}