{
    "moves": {
        "1. g3": "Here it comes. On what planet is this a good opening move for White?",
        "1... d5": "e5 and d5 are the overwhelming choices and I pick this one because the pawn is defended. ",
        "2. Bg2 Nf6": "2...e5 is the most popular, but I decide to get my pieces out.",
        "3. d4": "Now I can't play e5 for a while, and I sense the dark-squared Bishop is about to come out...",
        "3... c6": "Cautious, but allows the Queen to go to b6 attacking the b-pawn if necessary.",
        "4. Bg5": "Yes, I thought so.",
        "4... Nbd7": "Probably the best way to avoid doubled pawns, since 4...e6 means the Knight is pinned.",
        "5. Bxf6": "A bit of a surprise here; White gives up his Bishop for my Knight but gains no discernable advantage...",
        "5... Nxf6": "I just get another Knight on f6.",
        "6. a3": "Even more curious. 6.Nf3 looks the natural move, but there must be many others to consider before settling on this",
        "6... Bf5": "For some reason, having played 3...c6 to allow my Queen out, when it is the natural and obvious move I shy away from it. White has been slow in developing and I want some pieces out.",
        "7. Nd2": "Again, why not 7.Nf3? And if this Knight is to come out, why here? On c6 it can't be pinned because of White's admittedly odd previous move. My opponent is throwing odd moves at me to unsettle, I suspect.",
        "7... e6": "I carry on with my own development, allowing the other Bishop out.",
        "8. b4": "I continue to be baffled. Presumably done to prevent 8...c5, something that just loses a tempo.",
        "8... Bd6": "I carry on with development.",
        "9. e3": "Since White has placed his Bishop on g7 I would have thought, once again, that 9.Nf3 was called for.",
        "9... O-O": "Development complete, my King to safety, and, as often is the case against this opponent, I come out of the opening with quite a positional advantage.",
        "10. Ne2": "So, he plans to advance his f-pawn at some point, and wants to keep the diagonal open, despite the chain of pawns it's lined up to.",
        "10... a5": "I try to open a file over on the Q-side, mainly because, as jumbled as it is, I can't find much weakness in White's position.",
        "11. c3": "White starts to create a stonewall defence.",
        "11... e5": "If I am to break out, it must be through the centre.",
        "12. Nb3": "This made me wonder if my h-pawn advance hadn't been a weakening move; it's still defended, but I don't like having to defend pawns with my Queen.",
        "12... b6": "So I give it better support.",
        "13. Nd2": "And the Knight retreats. But having created something of a weak pawn on c6, White could have opened up the game himself with 13.dxe5 Bxe5 14.Nbd4, and if I don't want to give up a Bishop for the Knight I retreat it to d7. Here I have the option of blocking the Bishop in a little with 13...e5.",
        "13... Re8": "But I'm cautious, and want something behind it.",
        "14. Nf3": "White too wants a piece too many attacking my e-pawn, when taking it and opening the game up would have been better for him.",
        "14... Be4": "I'm starting to get a grip on White's position, but 14...e4 is still a better way to do it. In retrospect, this looks a little ugly.",
        "15. O-O": "White finally consolidates his defence, though exchanging the pawn on e5 first might have been better.",
        "15... Bxf3": "I give up my awkwardly placed Bishop.",
        "16. Bxf3 e4": "And finally advance the pawn; that Bishop doesn't have too many options now.",
        "17. Bg2 Ng4": "Tempting White to advance the h-pawn and weaken his King's defence.",
        "18. Bh3": "Actually, he'd probably be happy to give up this Bishop, so attacks it.",
        "18... f5": "Building up an attack, but without a clear aim in mind.",
        "19. Nf4": "White's zig-zagged pawns create nice holes for his Knight, and this reveals an attack on my Knight that suggests its advance was very much premature.",
        "19... Qg5": "He's bound to give up that limited Bishop, and I want my Queen to be part of an attack.",
        "20. Bxg4": "He does! Although there was counterplay on the Q-side with 20.bxa5 Rxa5 21.Qb3",
        "20... fxg4": "Now those pawns around the KIng are rather hemmed in. I just need to take advantage of the half-open f-file.",
        "21. Kg2": "White is planning to open a file too, I suspect, believing the best defence is attack. But again, it could have been on the Q-side...",
        "21... Re7": "I'm not going to f8 because of the horrible fork 22.Ne6. It means my attack is going to take time to build up.",
        "22. h3": "Yes, White is opening up the h-file. I guess he thinks that because that's where the King is it's a good idea.",
        "22... gxh3+ 23. Nxh3": "He's manouvered well, opening up the file and driving my Queen away.",
        "23... Qf6": "Better to keep it on the g-file, keeping White's Queen out.",
        "24. Qg4": "Now things are looking a little dubious for me. I still feel I have a slight edge, but it's only slight.",
        "24... Rf8": "The Q-side can look after itself now. I intend to line up as many big guns on the f-file as I can.",
        "25. Nf4": "Leaving the half-open h-file for the Rooks and threatening to go to h5.",
        "25... Bxf4": "When Knights are hopping among the Queen and Rooks, best to get rid of them!",
        "26. exf4": "Even at the expense of White's rather closing off the file I was hoping to attack down.. Still, he's doubled his pawns and there's a possibility of creating a passed pawn on the e-file. Somehow.",
        "26... Qf5": "First I offer an exchange. I know my opponent likes his endgames and his Queen is more dangerous and flexible than mine.",
        "27. Qh4": "Interestingly, he declines. ",
        "27... Ref7": "I'm still lining up against a brick wall, when 27...Re6 might have posed awkward questions for the White Queen. Chaning plans midstream is often a poor idea, but so is sticking to one that is patently not going to work. But I still have three pieces in my attack, while White has only the Queen.",
        "28. Rfh1": "Until now, when the Rook joins in.",
        "28... h6": "It's invariably a pawn move I get wrong; 28...g5, though looking far more dubious, would have been better, ultimately allowing some progress on that f-file.",
        "29. Qh3 Qxh3+": "Finally I crack - the pressure gets too much.",
        "30. Rxh3": "White is going to get his Rooks on the h-file.",
        "30... Rf7f6": "That weak c-pawn is still on my mind.",
        "31. bxa5": "Now White senses advantage, and opens up a file on the Q-side, where counterplay was feasible earlier in the game.",
        "31... bxa5 32. Rb1 g5": "I hit back, and White changes plan...",
        "33. Rbh1": "He's sensing an opening on the K-side instead following this pawn advance. Undoubling his pawns with 33.f3 exf3 34.Kxf3 solves a few of his defensive problems though, and gets rid of any hopes of a passed e-pawn I might have.",
        "33... gxf4": "Opening up the King's defences.",
        "34. Rh3xh6": "Giving me my first real chance to penetrate...",
        "34... fxg3": "Instead 34. Rxh6 Rxh6 35. Rxh6 f3+ 36. Kf1 Rb8 37. Ke1 Rb1+ 38. Kd2 Rb2+ 39. Ke1 Re2+ looks good, though whether there's really anything better than perpetual checks I'm not so sure.",
        "35. Rxf6": "Maybe it's now White that's panicking, knocking out one of my Rooks before grabbing back his pawn?",
        "35... Rxf6 36. fxg3": "So, we both get our passed pawns, and my e-pawn gets its chance after all!",
        "36... Rf3": "Wicked little move, I thought, sealing the King into just a few squares, unless he escapes via h4.",
        "37. Rc1": "White's Rook, meantime, is committed to fending his loose pawns.",
        "37... Kg7": "Once my King gets in there it's all over, I thought. Surely this is a win for Black? Anyone?",
        "38. c4": "White sensibly tries to reduce the number of potential Queens...",
        "38... Rxa3": "His a-pwan was always going to be difficult to defend, so he lets it go...",
        "39. cxd5 cxd5": "In the full knowledge he can win mine fairly easily...",
        "40. Rc5": "In truth, I give it up too easily, and with it my endgame advantage. Keeping it supported with 40...Ra2+ and advancing it was the right way to go.",
        "40... Rd3": "Instead I decide two linked pawns are better than one lone pawn out on the a-file away from my King. A stupid error.",
        "41. Rxd5": "Why would White take the a-pawn when this is up for grabs? Now he has a passed pawn of his own, and this is not going to be easy.",
        "41... a4 42. Kf2": "I can't keep my Rook behind the d-pawn much longer. I declined a draw around now, though my opponent insisted 'it has draw written all over it.' But I was too aware I'd let a win slip, and continued.",
        "42... a3 43. Ra5 Kf6": "If I give up the a-pawn for White's d-pawn it probably is drawn even in my endgame-fuddled brain.",
        "44. g4": "Annoyingly, White's other passed pawn reminds me it's there.",
        "44... Kg6": "And I can't get to it!",
        "45. Ke2 Rg3": "My Rook can? Annoyingly, the two passed pawns are close enough together for the White King to scurry back and forth",
        "46. Kf2 Rh3": "I get an idea. I will set a trap, ha!",
        "47. Ke2": "It works! The trouble is, I don't know it's worked. ",
        "47... a2": "I think White must actually take the pawn for me to win the Rook with 48...Rh2+",
        "48. d5": "He pushes his pawn, fatally? I canperhaps be forgiven for missing the computer's mate in 26...",
        "48... Kg5": "But not forgiven for missing, at least  48...Rh1 49. Ra6+ Kg5 50. Rxa2 Rh2+ 51. Ke3 Rxa2 and those passed pawns are no longer a threat.",
        "49. d6+ Kxg4": "One pawn gone...",
        "50. d7 Rd3": "The other might follow?",
        "51. Rxa2 Rxd7": "Yes, we are down to one extra pawn - mine. But it doesn't do me any good...",
        "52. Ke3 Re7 53. Ra4 Kf5 54. Ra5+ Re5 55. Ra4": "Of course White doesn't exchange Rooks. Though actually, even if he had it would still have been drawn, I believe.",
        "55... Re6": "I shuffle on a little...",
        "56. Ra5+": "But bow to the inevitable. Another one that got away."
    },
    "url": "https://gameknot.com/annotation.pl/benkos-opening?gm=66090",
    "gameName": "Benko's opening",
    "players": "metcalfe (1789) vs. feathered_tiger (1713)",
    "opening": "Benko's opening (A00)"
}