{
    "moves": {
        "1. d4": "As always, comments are appreciated!\n",
        "1... Nf6 2. c4 e6 3. Nc3 c5": "We're now in the Modern Benoni.\n",
        "4. d5 exd5 5. cxd5 d6 6. e4 g6 7. f4 Bg7 8. Nf3 Qe7 9. Bb5+": "And now, a line of the Taimanov Variation (though technically that variation places Bb5+ on move 8 rather than move 9). This is one of the sharpest lines in an opening that's already known to be a very violent struggle.\n",
        "9... Nfd7": "This is (theoretically) best, though other variations are also playable. Black's Queen on e7 in this variation makes the other options stronger than they are in the main line, since when she's still on d8, White's e4-e5 is a serious threat.\n",
        "10. a4": "This is intended less to support the Bishop (which doesn't really need support and will probably be driven off soon enough anyway), and more to prevent Black from securing the b5 outpost for himself.\n",
        "10... a6 11. Bd3 O-O 12. O-O": "Black drove off the invading White Bishop, and both sides get their Kings to safety. White will try to play e4-e5 now, while Black tries to prevent it. The e5 square is the typical center of attention in this opening for both sides, and this game is no exception.\n",
        "12... Nb6": "Black creates possibilities for play on both sides of the board.\n",
        "13. Re1 Bg4": "Pinning the Knight to the Queen, to remove its support of e5.\n",
        "14. Kh1": "White is wary of nasty checks via ...Bd4, so he gets his King to a safer location.\n",
        "14... Nb8d7": "In other variations, without the White pawn on f4, Black may place a Knight on e5 to blockade the White center. The fact that the f4 pawn prevents this is part of what makes this variation so dynamic.\n",
        "15. a5": "White relinquishes some queenside control in exchange for driving the Knight back.\n",
        "15... Nc8 16. Qe2": "This is not so much intended to guard b5 as it is to threaten a6.\n",
        "16... b5": "!? This gives up a pawn, but it does free Black's position considerably.\n",
        "17. axb6 e.p. Ncxb6 18. Rxa6": "Not 18.Bxa6, which would leave the Bishop awkwardly pinned to the undefended Ra1.\n",
        "18... Rxa6 19. Bxa6 Ra8": "Black is down a pawn but he owns the a-file and has better activity on the queenside. White's central threats are still present, but counterbalanced by Black's open lines.\n",
        "20. Bb7": "?! This is very aggressive, and I don't know that I would make the same choice again if given the chance. White can now place his Bishop on c6, which is great, but it would be better to place a Knight there (supporting e5!). Of course, actually getting a Knight there is tricky business, but I think 20.Bd3 was fine here, followed by (perhaps) an elaborate Knight maneuver to c4 or c6.\n",
        "20... Ra7 21. Bc6 Nb8": "Black prepares to eliminate the invader.\n",
        "22. Nb5": "?! Oh boy. I think if I could do it over, I'd just play 22.e5 here, rather than trying to play against Black's queenside directly.\n",
        "22... Ra5": "The tactical possibilities are stacking up. White's minor pieces are dangling by an intricate web of overworked defenses.\n",
        "23. h3": "? White needed to use this move to shore up his defenses and hopefully develop his dark-squared Bishop. I like 23.Bd2 here, where ...Ra2 is met by 24.Bc3, and White is finally prepared to move on e5. The text gives Black the time he needs to make serious inroads into the White position, and finally leverage his powerful dark-squared Bishop.\n",
        "23... Bxf3": "This starts a chain reaction...\n",
        "24. gxf3": "Necessary, since if 24.Qxf3 Nxc6 25.dxc6 Rxb5. Of course, this doesn't actually do much better...\n",
        "24... Qh4": "! Black threatens to bring his Bishop to d4 with great effect now that he has a line on the White King, and the Queen also threatens the White Rook--which would have been defended now, had White played 23.Bd2--and the undefended pawn on h3!\n",
        "25. Kg2": "Also possible (better, really) was 25.Nxd6!? Qxh3+ 26.Qh2 Qxf3+ 27.Kg1 Qg4+ 28.Qg2 where material is equal but White has good chances with the center pawns.",
        "25... Nxc6": "Black starts killing off the foolish minor pieces.\n",
        "26. dxc6 Rxb5 27. Qxb5 Qxe1": "Here White should simply accept his losses and go home with 28.Qf1, hoping to develop his Bishop, push the center, and maybe somehow get a draw with his advanced c-pawn as a counter to Black's Knight.\n",
        "28. Qxb6": "?? This is the final mistake. I thought I could get away with this because I didn't see any mating possibilities for Black: e.g. 28...Bd4 29.Qd8+ Kg7 30.Qg4 Qf2+ and I didn't see a win for Black. However, I was horribly overlooking the very obvious 30...Qg1#, which is a pattern I'm really bad at noticing, and it's bitten me more than once. So this was the last chance I had to attempt a tough draw with 28.Qf1. Black actually does have a forced mate here--can you find it?\n",
        "28... Bd4": "Threatening ...Qg1#. I noticed the threat just in time.\n",
        "29. h4": "This is the only move that doesn't spell instant defeat for White (but as it turns out...)\n",
        "29... Qg1+ 30. Kh3 Bf2": "Giving White one move to try to do something. I figured I'd be fine (or at least hold a draw) after 31.Qd8+ Kg7 32.Qg5.\n",
        "31. Qd8+ Kg7 32. Qg5": "The WQ holds the g-file--for the moment. But my opponent wasn't nearly as optimistic about my chances as I was, and he found what I missed.\n",
        "32... Qh1+ 33. Kg4 Qg2#": "! And just like that, it's over. Many thanks to ptitroque for a very enjoyable game, and for teaching me a lesson about King safety! Hope you enjoyed reading it!\n"
    },
    "url": "https://gameknot.com/annotation.pl/benoni-game-4?gm=50091",
    "gameName": "Benoni: Game 4",
    "players": "bwaa (1789) vs. ptitroque (1697)",
    "opening": "Nimzo-Indian defence (E20)"
}