{
    "moves": {
        "1. d4": "Hey folks, this is the second game between my opponent and I in our exploration of the Modern Benoni. This time I have the Black pieces. The theme of the game: undefended or underdefended pawns/pieces! Enjoy!\n",
        "1... Nf6 2. c4 e6": "Black plays a few calmer moves before declaring his intentions with the key move of the opening. These are intended to, among other things, give White a chance to play Nf3 before Black plays ...c5, so that White will be unable to launch into an all-out offensive with f2-f4.\n",
        "3. Nf3": "White obliges!\n",
        "3... c5": "This is the key move of the Benoni. Black responds to White's center thrust with a direct assault from the wing.\n",
        "4. Nc3": "Standard (in the Benoni) is 4.d5. Now we're headed for a transposition.\n",
        "4... cxd4 5. Nxd4 a6 6. e4": "After the original maneuvering, we've actually arrived at a Sicilian defense!\n",
        "6... Qc7": "Black prevents e4-e5.\n",
        "7. a3 b6 8. Be3 Bb7": "Both sides develop. Black puts pressure on e4 while White occupies the center directly.\n",
        "9. f3": "Stifling the Black Bishop's diagonal.\n",
        "9... Be7 10. Bd3 d6 11. O-O O-O": "Both players quietly continue their development and get their Kings to safety.\n",
        "12. Qd2": "My opponent and I were discussing the game as we played. Around here we agreed that the position is tough: material equality; White has a strong center but no obvious way to proceed; Black's King is a bit safer and no one has any direct threats. I am not very good in such situations; my opponent confided that he doesn't feel confident with positional play either. So we'll see how both of us do!\n",
        "12... Nbd7 13. f4": "?! I don't much like this. White's e-pawn is now only defended by pieces, and Black's Bishop has much better prospects without the pawn on f3. Of course, it's also certainly a threatening play through the center. Now the question is who can make better use of White's aggression.\n",
        "13... Nc5": "Naturally, Black begins bringing more pieces to bear on the newly-weakened e4.\n",
        "14. Qc2": "The only way to hold the pawn, as far as I can see.\n",
        "14... Rac8": "Setting up a tactic to win a pawn by threatening to remove the White LSB. By my calculation, White can no longer hold on to both his weak pawns without giving something away. To me, the toughest line looks like 15.b3 Nxd3 16.Qxd3 d5, where the c-pawn is pinned to the Knight so White's best continuation is 17.e5 dxc4 18.bxc4 Ng4 and Black will win the c-pawn shortly, although the position is anything but simple.\n",
        "15. Nf3": "? See above for why I think this is inferior. White's Bd3 and Queen are overworked trying to defend all the pawns.\n",
        "15... Nxd3 16. Qxd3 Qxc4 17. Qxc4 Rxc4": "Of course White has the option to trade down further (18.Bxb6 Bxe4 etc) but that results in a powerful passed d-pawn for Black. With the Queens off the board, pawns are the name of the game.\n",
        "18. e5": "?! Trying to entice 18...dxe5 19.fxe5 where White should be able to hold.\n",
        "18... Ng4": "Threatening White's unguarded Bishop--which is also the sole defender of the f-pawn. Sound familiar?\n",
        "19. Rae1": "Not good enough; 19.Bd2 or 19.Bxb6?! Rxf4 20.exd6 Bxd6 were the only ways to avoid falling further behind.\n",
        "19... Nxe3 20. Rxe3 Rxf4 21. Ne2 Re4": "Now a full two pawns to the good, and with the Bishop pair as well, Black offers a piece trade to simplify the position.\n",
        "22. Rxe4": "Declining the trade is impossible, since the Rook is pinned to the Ne2.\n",
        "22... Bxe4 23. exd6 Bxd6": "The Black Bishops are beginning to look truly powerful.\n",
        "24. Nd2": "? Fails to a tactical trick. 24.Rc1 was better, I think.\n",
        "24... Bc5+": "! There's a pin to be had by playing ...Bd3, but it doesn't win material without this preparatory move, because 24...Bd3 25.Re1 lets White escape the pin and bring his King out of the corner.\n",
        "25. Kh1 Bd3": "Now if 26.Re1 Bf2 27.Rf1 Bh4 28.g3 Bg5 wins a Knight-- a maneuver not possible without 24...Bc5+\n",
        "26. Ng3": "Perhaps better to lose the exchange than a full Knight, but White is really done for at this point.\n",
        "26... Bxf1 27. Ngxf1 Re8": "Black prepares to march the e-pawn to the other side of the board.\n",
        "28. g3": "Getting the King out.\n",
        "28... f5 29. Nf3 e5 30. Kg2 Kf7 31. Nf1d2 e4 32. Ne1": "There's still some struggle left for White, but the end is inevitable. He'll have to give up a Knight for the e-pawn eventually.\n",
        "32... g5 33. Nc4 Kf6 34. Nc2 e3 35. Ne1 g4 36. b4": "Just delaying the inevitable.\n",
        "36... Bd4 37. Nd3 e2 38. Ne1 Kg5 39. Nd6 Re6 40. Nf7+ Kg6 41. Nd8 Re4 42. Nc6 Bc3 43. Nc2 e1=Q": "The Queen has returned!!\n",
        "44. Nxe1": "Okay, that was short-lived, but now Black has R+B against the WK essentially all on his own.\n",
        "44... Bxe1 45. Kf1 Bc3": "The Bishop on the a1-h8 diagonal is shutting the White Knight out of the action very effectively.\n",
        "46. Kf2 Kg5 47. Nd8": "Trying to buy time with 47.Nf7+ Kf6 48.Nd6 but Black has other ideas.\n",
        "47... Re7": "The WK cannot make any productive moves; pawn moves would be unadvisable for White, and the Knight has only one square...\n",
        "48. Nc6 Re8": "! White's Knight is now wholly shut down. It can jump back and forth between a7 and c6, but cannot participate in the battle on the kingside, where the Black King can now escort his pawn majority to victory.\n",
        "49. a4 f4 50. gxf4+ Kxf4": "Or 51.a5 b5.\n",
        "51. b5 axb5 52. axb5 h5 53. Kg2": "53.Na7 was a little stronger.\n",
        "53... Re2+": "Forcing the King to the back rank.\n",
        "54. Kf1 Kf3 55. Nd4+": "Momentarily preventing 55...Re1#.\n",
        "55... Bxd4 56. h3 Bf2 57. hxg4 Re1#": "And that's it! That's two games in a row that the Benoni has performed admirably for the Black pieces (even if this game technically turned into a Sicilian by the sixth move). I'll definitely be playing this one more in the future!  Many thanks to ptitroque for the great game, and thank you all for reading. Comments are appreciated, especially if you spot something I missed. Until next time!\n"
    },
    "url": "https://gameknot.com/annotation.pl/benoni-game-2?gm=49380",
    "gameName": "Benoni: Game 2",
    "players": "ptitroque (1692) vs. bwaa (1783)",
    "opening": "Blumenfeld counter-gambit (E10)"
}