{
    "moves": {
        "1. d4 Nf6 2. c4 c5": "The Benoni system",
        "3. d5 b5": "The Benko Gambit",
        "4. cxb5 a6": "..a6 is usually always played in the Benko. This gambit leads to lively play, and played correctly gives black excellent winning chances. Especially against unprepared white opponents. ",
        "5. bxa6": "Accepting black's second pawn",
        "5... g6 6. Nc3 Bxa6 7. g3": "This is an interesting system, that I had studied but not actually played against in a real game",
        "7... d6": "Normal",
        "8. Nh3": "A very interesting move. As the game develops, you will see exactly how powerful this move is. Here is an example of a top level game played using this particular line. [Event \"Vienna Millenium\"]\n[White \"Jussupow, Artur\"]\n[Black \"Topalov, Veselin\"]\n[Result \"1/2-1/2\"]\n[WhiteElo \"2665\"]\n[BlackElo \"2750\"]\n[EventDate \"1996.08.09\"]\n1. d4 Nf6 2. c4 c5 3. d5 b5 4. cxb5 a6 5. bxa6 g6 6. Nc3 Bxa6 7. g3 d6 8. Nh3\nBg7 9. Nf4 Nbd7 10. h4 h5 11. Bh3 O-O 12. Qc2 Ne5 13. O-O Qb6 14. Rb1 Bc8 15.\nBxc8 Rfxc8 16. b3 Nfg4 17. Kg2 c4 18. Ne4 Qa7 19. a3 cxb3 20. Qxb3 Nc4 21. Ng5\nNxa3 22. Qxa3 Qxa3 23. Bxa3 Rxa3 1/2-1/2\n\n",
        "8... Bg7 9. Nf4 Nbd7 10. h4": "This is the key move in this variation. I play the solid ..h5. In preparation I understood this line to be drawish, but having played against it I am quite impressed by white's options.",
        "10... h5": "Solid reply",
        "11. Bg2": "This is interesting. I needed to think about this. I expected Bh3, and tried to identify the strengths and weaknesses of the bishop being on g2. The main advantage is the overprotection of the d5 pawn, the prevention of black tactical finesses involving ..Nfe4 and a discovered attack with the bishop on g7, as well as the possibility of moving to e4 at some point to press against black's g6 pawn. The main disadvantage is the bishop being blocked for most of the game by the d5 pawn, the inability to support the move g4,  and the inability to later contest the h3-c8 light-square diagonal when black switches his bishop via c8 to the f5 square (very typical in this line, as white usually places his queen on c2).",
        "11... O-O 12. Qc2 Ne5": "Again typical. Black often locates his rooks on the a and b-files, and plays ..c4 in the benko. At this point his game comes to life, and combined with his dark-square bishop he usually wins his pawn back",
        "13. O-O Qa5": "On reflection, I'm not totally happy with this move. Yes this move and the plan that follows is typical in the systems where white plays Bh3, but I feel its not necessary here.",
        "14. b3": "Typical move to slow ..c4",
        "14... Rfb8": "Black gets ready for some fun",
        "15. Bd2": "White threatens a discovered attack on the queen",
        "15... Bc8": "Thematic. Travelling via c8 to the f5 square to contest the diagonal, threaten the white queen, and protect g6",
        "16. Ne4": "I think this position is already a little better for white",
        "16... Qa3": "The queen has to go somewhere, but this is not the correct place to support ..c4",
        "17. Bc3": "Neutralising some of black's threats that involve a knight move revealing a discovered attack from the dark-square bishop. White shows a deep understanding of the position",
        "17... Bf5": "Thematic",
        "18. Nxf6+": "Vacating e4 for the pawn to move forward",
        "18... Bxf6 19. e4": "White's position is looking solid, and black is already thinking of drawing lines",
        "19... Bg4 20. Rfb1": "Neutralising black's influence on the b file",
        "20... c4": "I thought for a long time about this move, playing through all the variations getting to the position at move 29 in the game. It looked drawable, so I returned to the board to try several waiting moves before proceeding.",
        "21. Ne2": "Excellent. White does not fear black's ..Nf3+ , but black goes over his analysis and takes account of this move for the forcing line that leads to the endgame that follows",
        "21... Rbc8": "A waiting move, hoping white will make an error",
        "22. Nd4": "Excellent move",
        "22... cxb3": "Black decides to enter the long forcing sequence, liquidating the entire position and heading for a draw",
        "23. axb3 Qxa1 24. Rxa1 Rxa1+ 25. Bxa1 Nf3+": "The knight check finesse is used",
        "26. Bxf3 Rxc2 27. Nxc2 Bxf3 28. Bxf6": "Entering the endgame, black hopes white will retain the dark-squared bishop, guaranteeing a draw for black",
        "28... Bxe4": "Hoping for 29. Bxe7 Bxd5 30. Bxd6 Bxb3 draw",
        "29. Ne3": "Correct",
        "29... exf6": "This is the position that I glanced at earlier in my analysis, and thought I could draw. Actually its lost for black due to his doubled pawns on the f-file. After either ..f5 or ..g5 by black, white merely plays f4 and the kingside is locked, leaving white to focus on his passed b-pawn",
        "30. Kf1 Bd3+": "Preparing a switch to the queenside",
        "31. Ke1 Kf8 32. Kd2": "Or even the winning 21. Nc4, blocking black's bishop",
        "32... Ba6 33. Kc3 Ke7 34. Kb4 Kd7": "Clearly lost. But black plays on hoping to trick a draw",
        "35. Ka5 Be2 36. Kb6 f5": "Ineffective, but black has little alternative",
        "37. b4 f4": "Discarding his doubled pawn, to force through a passed h-pawn",
        "38. gxf4 f6 39. b5 g5": ".",
        "40. fxg5 fxg5 41. hxg5": "Passed pawn, but the position is hopeless after 41 ..h4 42. g6 Ke8 43. Kc6 so black resigns"
    },
    "url": "https://gameknot.com/annotation.pl/benoni-benko-gambit-4-a6-5-bxa6?gm=28649",
    "gameName": "Benoni (Benko Gambit) 4.. a6 5. bxa6",
    "players": "jy85 (1748) vs. longtail99 (1877)",
    "opening": "Benko gambit accepted (A58)"
}