{
    "moves": {
        "1. d4": "This is a game which I lost in \"berbatov's mini-tournament\". I add also the Spanish comments by migchess20.",
        "1... Nf6 2. c4 g6 3. Nc3 Bg7 4. e4 d6 5. f3": "The Sämisch variation.\r\nThe f3-pawn supports the e4-pawn and the square g4, so that the black king's knight cannot go there to kick a bishop on e3.\r\nThe minus is that white's g1-knight cannot go to his favorite square f3 and the development of white's kingside is \"going to be rather clumsy.\" (J.Gallagher)",
        "5... O-O 6. Be3 Nc6 7. Nge2 e5": "migchess20: muy prematuro mover 7..e5 en esta posición.[7...a6 8.Dd2 Tb8 9.Cc1 e5 10.Cb3 exd4 11.Cxd4 Cxd4 12.Axd4 Ae6 13.Ae2 posición equilibrada] \r\n",
        "8. d5 Ne7 9. Ng3 Ne8 10. Bd3 f5 11. Bf2 fxe4": "migchess20: 11...f4 12.Cge2 Cf6 13.Db3 c6 14.Da3 Es mejor mantener una posición cerrada en la defensa india del rey",
        "12. fxe4 Nf6 13. O-O a6 14. Be3 h6": "migchess20: considero débil esta posición ya que 14....h6 debilita la protección del rey, muchos consideran que los peones que defienden al rey no deben de moverse de manera inmediata. sino en el momento adecuado. [14...Cg4 15.De2 Cxe3 16.Dxe3 Txf1  17.Txf1] \r\n",
        "15. Be2 Bd7 16. Qd2 Kh7 17. h3 Qe8": "migchess20: 17...Tf7 Es importante entrar la dama en juego y colaborar en la defensa del rey negro 18.Tf3 Dh8 19.Taf1 Taf8 20.c5 Rg8 21.b4",
        "18. Rf2 Rd8 19. Raf1 b5 20. b3 bxc4": "migchess20: 20...b4 21.Cd1 c5 22.dxc6 Cxc6 23.Ab6 Tc8 24.Dxd6 Ae6 25.c5 Cd7 26.Txf8 Axf8 27.Txf8 Cxf8 28.Axa6 Piezas negras expuestas al ataque; 20...c5 Es necesario romper el centro de peones blancos y darle movimiento a las piezas negras 21.dxc6 Axc6 22.Ab6 Ta8 23.Ac7 Cc8 24.Aa5",
        "21. bxc4 Rb8": "This forth and back looks a bit strange.",
        "22. c5 Bb5 23. Nxb5 axb5 24. c6": "24...Qc8",
        "24... Qc8 25. Qb4": "Now it looks interesting to give a knight for two pawns and getting at least two connected free pawns.\r\nThe question is whether to play a move like Qa6 before or not. It is better because it puts the queen to a more active place and raises the opportunity to get 3 connected free pawns.",
        "25... Qa6 26. a3": "Now, Nxc6 is also a possible sac, only it takes less initiative than the sac on d5.",
        "26... Nexd5": "I preferred the e-knight to the f-knight in order to postpone the opening of the f-line.",
        "27. exd5 Nxd5 28. Qb3 Nxe3 29. Rf2xf8 Nxf1": "migchess20: 29...Axf8 30.Dxe3 Dxc6 31.Ch5",
        "30. Rxb8": "? Already here Qg8# was possible.",
        "30... Nxg3": "??",
        "31. Qg8#": "migchess20: Hay momentos en el partido, que uno se duerme en la posición anterior,( a mi me ha sucedido varias veces) por eso es importante que después de cada movimiento del contrario nos preguntemos ¿ Que quiere hacer con esta jugada? observar que piezas están atacadas, que piezas están en el aire. Observar las cadenas de peones. Hay un ataque directo al rey. 1–0 \r\n"
    },
    "url": "https://gameknot.com/annotation.pl/berbatovs-mini-tournament?gm=9434",
    "gameName": "berbatov's mini-tournament",
    "players": "slardifarst (1697) vs. brulla (1616)",
    "opening": "King's Indian (E83), Saemisch, Ruban variation"
}