{
    "moves": {
        "1. e4": "One of the first lessons we learn in the game of chess is to be aware - and beware - of the weakness at f7, if you're playing Black, and f2, if you're playing White.  As a corollary, one often also seeks to obtain an attack against that weak point in the enemy position.  That is one of the reasons for castling early, but even castling is not always a secure safeguard.  Check this out.",
        "1... e5 2. Bc4": "Bishop's Opening - an old fashioned line that doesn't get much 'air time' these days.  I like it as a good alternative to the more usual (and highly 'theoretical') 2.Nf3.  Part of its motivation is to leave the f-pawn free to advance, and therefore it has certain affinities to the Vienna Opening and King's Gambit.  According to IM Bill Hartston, though, 'Black has several possibilities for creating such diversions that White has no time for P-KB4 [f4]'.  In my view, that is no especial hardship...",
        "2... Nf6": "The usual response, and my favourite when playing Black against this line.  Develops, and strikes at once against the unprotected e4-pawn.",
        "3. d3": "And this is the more usual response by White.  To be sure, it's a pawn move, but White is now able to develop rapidly.  Also possible is 3.Nc3, but that doesn't necessarily stop 3...Nxe4!? (4.Nxe4 d5! 5.Bxd5 Qxd5 when White should probably protect the knight by 6.d3, rather than move it {...Qxg2}; or 4.Bxf7ch Kxf7 5.Nxe4 d5).  Of course, White has a third option after 3.Nc3 Nxe4, and that is 4.Qh5! ... when things can get really wild and woolly.  Black should probably reply 4...Nd6 in response to the Queen sortie, defending f7 and attacking the c4-bishop at the same time.\n",
        "3... Bc5": "[!?] More usual are 3...Nc6 (developing) or 3...c6 (preparing the ...d5 break).  With this move, Black seems to be prepared to transpose into a Giuoco Pianissimo, or a line in the King's Gambit Declined: 4.Nc3 Nc6  5.f4!?  Note that 3...d5 is far too premature, opening up the position  before Black is really ready to make use of the opened lines, e.g. 3...d5(?) 4.exd5 Nxd5 5.Nf3 Nc6 9.0-0 Be7 10.Re1 ... when White bids fair to develop a dangerous initiative.  So long as White makes purposeful developing moves, Black should be wary - and chary - of opening up the centre too soon. ",
        "4. h3": "[?!]  Prophylaxis:  White wants to obviate any threats against f2 before they develop.  There are two downsides to this.  First, it really doesn't push White's development along.  The second alludes to my previous comment.  After this Black felt it reasonable to try the ...d5 break - thematic in this opening.  This wee pawn move was really unnecessary, as 4.Nf3 Ng4(?)  5.0-0 ... would have afforded sufficient protection for f2.",
        "4... d5": "[!?] I find this move very difficult to call.  Personally, I would have been more inclined to prepare ...d5 by playing ...c6 beforehand, so as to recapture with the pawn upon White's exchanging on d5: 4...c6  5.Nf3 d5  6.exd5 cxd5 and if 7.Bb5ch Bd7! gives White no time to to take the pawn on e5.  Having said that, there is no reason for a developing player not to explore the likely consequences of an early central break like this.  It doesn't give away too much.",
        "5. exd5 Nxd5 6. Qh5": "[!?]  Putting the frighteners on?  Although I would certainly have been eyeing this move, I would equally well have been trying to work out the most propitious moment for playing it.  It seems just a trifle premature here, with too little heft behind it, no real targets ahead, and prior to castling, too.  You might object that a couple of moves back, Qh5 came into serious consideration in a sideline to the text (the 'text' being the actual score - moves - of the game).  But in that case, there was a target that Black would have been more stretched to protect.  But here we are in the realm of risk-taking, and there is no harm in that, and a good deal to be learned.",
        "6... O-O": "Good defence.  The e-pawn is safe enough, as 7.Qxe5?? Re8, and Black wins the major exchange: Queen for Rook.",
        "7. Nf3": "Developing, eyeing the Black e-pawn, and the g5-square as well.",
        "7... Nf6": "[!?] A very interesting decision, to consolidate Black's position, and well-timed, too, exploiting the White Queen's location.  Possibly 7...Nc6 would have been a trifle better, but I would not criticise this move at all!  Apart from anything else, it shows flexibility of mind.",
        "8. Qh4": "The e-pawn is taboo, of course, and White wants to keep the g5-square open, if possible.",
        "8... Re8": "[?]  In my view it was too risky to reduce the protections of f7 in the light of the positions of the White's light-square bishop and king's knight.  Better, it seems to me, would have been 8...Nc6, continuing to mobilize rapidly.",
        "9. O-O": "9.Ng5 could just about have been played now!  Black would just about have had to admit a mistake and play 9...Rf8!",
        "9... e4": "[?] Bold, but in view of the unmobilised Q-side, really too soon.  It also tends to underestimate the threats against f7.  A good move here would have been 9...Be6, covering f7, and offering to exchange bishops.  Also playable were 9...Nc6 (10.Ng5 Rf8) and even 9...h6, which, for the price of a slight weakening of the K-side, keeps the knight out of g5.  After the text move, White has an edge, but the game is becoming very lively.",
        "10. Ng5": "Obvious and good.  The attack on f7 is serious enough that Black ought probably to have accepted the loss of a pawn and played 10...Be6. ",
        "10... e3": "Counter-attacking in the face of pressure is always worth considering, and you have to respect Black's willingness, here, to take the fight to the opponent.  But really, the situation on the home front was too urgent for this to be successful.  White could gain a winning advantage here simply by playing 11.Bxf7, and winning the exchange.  But...",
        "11. fxe3": "[!]  Even stronger, if anything, than Bxf7ch.  Well played.",
        "11... Bxe3+ 12. Bxe3 Rxe3 13. Nxf7": "[?!] Strong enough for a winning advantage, and in fact the game is about to come to an abrupt, premature end.  But stronger in fact was 13.Bxf7ch Kf8 (13...Kh8 14.Rxf6!) 14.Bg6!! ... (not an easy move to find, it's true, but the easier 14.Nxh7ch or even 14.Rxf6 were also both good enough to win).",
        "13... Qf8": "[??]  So far, although Black has been outfought in a good old stand-up fight, one can not point up to any real short-range oversights.  Black makes up for it now by walking into a forced mate.  Bad though the situation has become, Black was still in a position to fight on after 13...Qe7! The resulting position is complicated by White's having to worry about a possible counter-attack down the e-file, which would have meant, for instance, that a rook sacrifice at f6 might become problematic.  White could still play the attractive-looking 14.Ne5, as after 14...Be6! 15.Rxf6! gxf6 16.Qg4ch White still has a strong attack and a material edge.  But even stronger would have been 14.Ng5! Kh8! (...Kf8; Nxh7ch)  15.Nc3! ... threatening Nd5 or Ne4, and the win is not far off.    ",
        "14. Ne5+": "The decisive discovered check.  Checkmate is forced.",
        "14... Kh8": "Cutting short the agony.  The forcing sequence runs: 14...Be6  15.Bxe6ch Qf7  16.Bxf7ch Kf8  17.Qb4ch c5 18.Qxc5#.",
        "15. Ng6#": "CHECKMATE.  White had all the fun in that game, but some praise is due Black for trying to make a real stand-up fight of it.  "
    },
    "url": "https://gameknot.com/annotation.pl/beware-of-f7?gm=61631",
    "gameName": "Beware of f7!",
    "players": "raiyana6670 (1332) vs. delweiss (1461)",
    "opening": "Bishop's opening (C24), Berlin defence"
}