{
    "moves": {
        "1. d4": "My sixth game vs bigpeta.  Pete feels I erred right off by not exchanging at move 3.  The gk computer doesn't disagree but only adjusts -.12.  As I write this, I haven't analyzed the game at all and do not know exactly where the game really went wrong.  So, let's see.",
        "1... Nf6 2. Bg5": "I believe this is the first time I've played this opening, the Trompowski attack.",
        "2... h6 3. Bh4": "bigpeta commented that he feels that exchanging B for N here is best.  I didn't give that much consideration this game.  For one, I tend to want to conserve bishops.  For another, my games vs Pete are often characterized by a trade down leading to a painful endgame.  So I try to hang on to my men for a while this game.  ",
        "3... g5": "3. ...g5",
        "4. Bg3": "4. Bg3",
        "4... Bg7 5. Nc3 c5": "5. ...c5",
        "6. e3": "6. e3",
        "6... Qa5": "6. ...Qa5.  This shakes me up a bit, in a \"what evil plans does my opponent have in store\" kind of way.  After all, all of black's other queenside pieces remain in port.  This must therefore mean trouble.  ",
        "7. Qd2 cxd4": "7. ...cxd4",
        "8. exd4": "8. exd4.  This position doesn't seem bad.  But those two central pawns idling calmly on d7 and e7 look like trouble!",
        "8... Nc6": "8. ...Nc6",
        "9. Nf3 d6 10. Be2": "gk computer suggests d5 would have been best here.  Useful that white can now castle and connect rooks. +++++ looking back from a bit further along, I see that the main point of d5 is to protect that pawn from a threat that will soon arise.",
        "10... g4": "10. ...g4.  This is interesting.  The disruption to white is apparently better for black than, for example, bringing the bishop off the back rank.  Comments? ",
        "11. Nh4 O-O 12. O-O": "both sides now castled.  material is even.  computer says white is down -.72  ",
        "12... Nd5": "12. ...d5 opens p diagonal for black's dsb while bringing knight to center.",
        "13. a3": "computer shows that white sinks into a -1.4 disadvantage here and that the game never swings away from black from here on, ...suggests 13. Rd1 was best.  The pawn is lost no matter what.  This points back to 12.  Had white played d5 then, it would not be lost now. ",
        "13... Nxd4": "13. ...Nxp.",
        "14. b4": "14. b4 freeing white's Q and N.",
        "14... Nxe2+": "NxB",
        "15. Nxe2": "NxN",
        "15... Qa6 16. Nd4 e6": "16. ...e6 shuts down white's knights.",
        "17. f3": "gk computer plays out an unusual sequence beginning with Rad1 here.  Not sure I understand it.  ",
        "17... Qc4": "white N under pressure.",
        "18. Bf2": "safe for the moment.  but black now has potential to march those two central pawns forward keeping white off kilter along the way.",
        "18... gxf3": "pxp",
        "19. Nhxf3": "Nxp",
        "19... Bd7": "black finally moves the, until a few moves ago semi-developed, bishop.  Rooks to enter the game. Materially, white is down a pawn.  computer gives black a +2.12 advantage.",
        "20. Rab1 Rfc8 21. Rb2": "offense for black. defense for white. ",
        "21... Qc3": "21. ...Qc3, pushing for a Q exchange.  ",
        "22. Rb3": "22. Rb3, to avoid a reload at c8.",
        "22... Qxd2": "QxQ",
        "23. Nxd2": "NxQ.  black attacks knight and pawn.  white attacks nothing.",
        "23... Nc3": "23. ...Nc3.  what is he up to? ",
        "24. Re1 e5 25. Nd4f3": "pawn move by black pushes white to retreat.",
        "25... Ba4": "25. ...Ba4",
        "26. Rb2 Nb5": "26. ...Nb5",
        "27. Ra2": "computer suggests c4 here.  but the suggested sequence involves letting go of a rook.  my move avoids worst of double attack that would come with ...e4, ...not that it feels like a \"good\" move. ",
        "27... Rxc2": "Rxp",
        "28. Rxc2": "RxR",
        "28... Bxc2": "BxR",
        "29. Nc4 e4": "no surprise.  game has been lost for some time.  but as I had retained some men was looking forward to playing on to see what sort of artistry black had up his sleeve.  unfortunately, blundered the move after next and resigned.",
        "30. Nh4 Bd3 31. Nb2 Bxb2": "Another interesting game vs bigpeta.  Cause of loss was VERY gradual and subtle, tracing back to, it appears, non-optimal moves at 10 and 12. Another factor is Pete's skill at preventing his opponent from developing much of an offense. Exactly how he did this in this game is difficult for me to see. I don't believe it is just my poor choices noted above. So, analysts, any thoughts on how bigpeta accomplishes this aspect of his method?  Computer disliked exactly none of Pete's moves.  Looking forward to your comments.  Thank you to Pete for playing."
    },
    "url": "https://gameknot.com/annotation.pl/bigpetas-mini-tournament-i?gm=51166",
    "gameName": "bigpeta's mini-tournament I",
    "players": "hogfysshe (1819) vs. bigpeta (2091)",
    "opening": "Trompovsky attack (Ruth, Opovcensky opening) (A45)"
}