{
    "moves": {
        "1. e4 d5": "I'm in love with the Scandanavian variation you are about to see. For a white player who has never faced it, it can be very tricky to understand what is going on. Typically, white will play moves he thinks are sound when they actually deteriorate his position. Caution: This is probably an unsound opening. That is, if white plays great, black finds himself at a disadvantage. However, it is hard for white to know what to do.",
        "2. exd5 Nf6 3. c4": "Although it's hard to see, this is white's first mistake and a crucial move in this line. If white had played anything else, I would have taken the pawn at d4.",
        "3... Bg4 4. Be2 Bf5 5. h3": "h3 losses too much time in this gambit variation.",
        "5... e6": "Let's open some lines... This is called the Icelandic gambit, but I don't know why.",
        "6. dxe6 Bc5 7. exf7+ Kxf7 8. Nf3 Re8": "The whole point of letting white take on f7 is to grab even more tempo by bringing the Rook at e8 in one move instead of the normal 2 (i.e. 0-0 then Rfe8). Here we see the problem with c4. This pawn blocks white from checking with the Bishop or the Queen. If white checks with the knight at g5, I simply retreat the king at g8.",
        "9. O-O": "A great move by genoveva. White's king needs to be safe.",
        "9... Nc6 10. a3": "Important defensive move. My knight is eyeing c6-b4, then b4-c2. ",
        "10... Qd6": "My development is almost finished. Just need that aRook to come to the d-file. Look at white, he is still cramped up in the backfield. That was the deal... I'll give you two pawns.",
        "11. b4 Bd4 12. c5": "These two pawn moves are too slow. White must develop his pieces!",
        "12... Qe6": "The Queen is eyeing the Bishop. The Bishop is eyeing the Rook. ",
        "13. Nxd4": "A good move that takes care of the two previous problems, but unfortunately opens the highlands for my Knight.",
        "13... Nxd4 14. Bf3": "Some would be happy to trade a Knight for a Bishop, but that would let him develop his Queen and I am already down by two pawns. In this kind of opening, we want to create pressure not trade pieces.",
        "14... Bc2": "This is the bolt that wins the game. To save the Queen, white must move it to e1. But that leads to a huge lose of material in a line that is pretty much forced all the way. Ex: 15. Qe1 Qxe1 16. Rxe1 Rxe1+ 17 Kh2 Nxf3+ 18. g2xf3 Rexc1 and white's last Knight is about to be lost.",
        "15. Bxb7": "Let us 'change the subject'.",
        "15... Rab8 16. Bf3": "Ok, what were you saying again?",
        "16... Bxd1": "Momma's down! Now my strategy will be to exchange as much as possible.",
        "17. Bxd1 Ne2+ 18. Bxe2 Qxe2 19. Nc3 Qd3 20. Ra2 Ne4 21. Nxe4 Rxe4 22. f3 Re2 23. c6 Qg6": "Threatening mate and the first capture of a pawn since the gambits at c6. Note how my king is still at f7. As we can see the earlier move of bringing the rook at e8 directly instead of castling first did indeed save us one tempo since we never had to bring the king back to g8. At this point, my opponent resigned. I'm sure if I tried this trick on him again he wouldn't be beat a second time!"
    },
    "url": "https://gameknot.com/annotation.pl/bigpauls-mini-tournament?gm=24415",
    "gameName": "bigpaul's mini-tournament",
    "players": "genoveva (1626) vs. pancakepalace (1589)",
    "opening": "Scandinavian (B01), Icelandic gambit"
}