{
    "moves": {
        "1. c4": "Second MT game vs rjfsmith.  a close game until an ambitious exchange sequence initiated  by black shifted the game slightly to white.",
        "1... Nf6 2. Nc3 g6 3. e4 d6 4. d4 Nbd7 5. Be2 Bg7 6. Nf3": "English opening with heavy white pawn presence in the center.",
        "6... O-O 7. O-O a6 8. Qc2 Rb8 9. Bf4 Re8": "black prepares for some sort of dismantling of white's central mass.",
        "10. Rad1": "some vague pressure on black's queen.",
        "10... c5": "10. ...c5",
        "11. Bg5": "9. Bf4 had not been very smart.  This move avoids a possible B-N fork (w/...e5) and is not a bad square for the bishop.",
        "11... cxd4 12. Nxd4": "pressure on Q slightly less vague.  a case of a capture (11...cxd4) being better for the opponent than for the capturer?  comments?  also, should black have done more to open up his game by now, particularly on the queenside?  maybe ...b5 (prep'd by c6) instead of ...cxd4? (or does the game swing mainly on double-pin at 16 and the exchange at 19-21?)",
        "12... Nc5": "does not do much to improve black's mobility.  e4 attacked twice.",
        "13. Rfe1 Bd7 14. b4": "pushes N back keeping black's e-pawn pinned down. ",
        "14... Ne6 15. Nxe6 Bxe6 16. e5": "forces N to move and then two pawns will be pinned.",
        "16... Ng4": "16. ...Ng4",
        "17. exd6 Nf6 18. dxe7": "white gains a pawn.",
        "18... Qxe7 19. Qb2": "a potentially unwise move given black's influence on the two diagonals.  but...",
        "19... Bxc4": "hmm? yes, white will lose both rooks.  but the overall exchange will be Q+B for R+R+P, probably slightly favorable for white.",
        "20. Bxc4 Qxe1+ 21. Rxe1 Rxe1+ 22. Bf1": "remaining forces Q+B+B+N+5P -vs- R+R+B+N+5P.  Should be interesting.  ",
        "22... Rc8 23. Bd2": "kicks R out of white's side of the board.",
        "23... Re7 24. Qb3 Rd8 25. Be3 Ne4 26. Nxe4": "better to exchange than conserve as white's N would have been pushed around and black's might have done well on reaching d2. this was black's successful strategy in our previous game, exchange down and look to a potentially strong endgame.  slightly worried.",
        "26... Rxe4 27. g3 Kh8": "breaks pin but probably could have been better spent.  black's f pawn looking a bit weak.  on the other hand, is now free to move.",
        "28. Bg2": "strategy from here on is push the rooks around perhaps leading them to and unwise alignment while also using all the coverage of the QBB combination to limit the rooks' options.",
        "28... Re7": "alignment, but black can check his way out of trouble.  plus f1 square a potential trouble spot for white. dsb must stay put.",
        "29. Bd5": "white's play a bit aimless but threats prevent black from becoming any more organized.",
        "29... Rdd7 30. Kg2 Kg8": "now plenty of protection on f7.",
        "31. Bc5 Re5 32. Bf3": "retreat but now no ready checks for black.",
        "32... h5 33. Be3": "regroup.",
        "33... b5 34. a4 Kf8 35. Bc6 bxa4 36. Qxa4": "black can move safely only to d8 or d3 and can not save pawn.",
        "36... Rc7 37. Bf4": "black resigns.  a fun game with the opposing sides being interestingly out of balance.  Thank you to rjfsmith for another good game."
    },
    "url": "https://gameknot.com/annotation.pl/bigpetas-mini-tournament-i?gm=52047",
    "gameName": "bigpeta's mini-tournament I",
    "players": "hogfysshe (1825) vs. rjfsmith (1500)",
    "opening": "English opening (A16)"
}