{
    "moves": {
        "1. d4": "Central control.",
        "1... d5": "Likewise.",
        "2. e3": "Going for the old Stonewall.",
        "2... Nf6 3. Bd3": "As per Stonewall plan.",
        "3... c5": "That's a bit of a nuisance.  Happens quite often with this opening.  Better create a retreat square for my white squared Bishop.",
        "4. c3 Nc6 5. Nd2": "Normal Stonewall developing move in preparation for f4 and Knights on e5 and f3.",
        "5... e5": "Pete is coming full frontal..well I can't allow him to pushe4 so I must swap on e5.",
        "6. dxe5 Nxe5 7. Be2": "I want to keep my Bishop pair for the endgame so it's a bit of a toss up to stick the Bishop on c2 or e2.  I think its more useful on e2 as a Kingside attack seems a bit futile with both his knights on that side of the board and my Bishop can support a Queenside pawn advance from e2.",
        "7... Bd6 8. Ngf3": "Natural developing on both sides..Black is getting a few pieces concentrating down on my Kingside..I will have to be careful.",
        "8... O-O 9. O-O": "Both completing natural development and retreating Kings to a relatively safe position.",
        "9... Qe7 10. Re1": "Putting my rook on same file as Blacks Queen to try to make him feel a wee bit more uncomfortable.  A sort of precurser for any tactical possibilities that may arise on that file and overprotecting e3.",
        "10... Rd8": "He seems to have the same idea!..My Queen's out of there!",
        "11. Qc2": "Survival instinct..my Queen is coming straight off the d file as soon as the Black Rook hits the file.",
        "11... g6": "I don't know why black has played that..it seems to weaken the black squares around his King.",
        "12. Nxe5": "Swap off his advanced knight then I can develop mu other knight to f3 giving my black squared Bishop a bit of air.",
        "12... Qxe5 13. Nf3 Qe7 14. h3": "Don't want his pieces invading on g4.",
        "14... Bf5 15. Qd1": "Better move my Queen!...can't see much point in trading white-squared Bishops.\n\nIn hindsight maybe I should have played Bd3.",
        "15... Ne4": "blacks pieces seem to be pouring into my space...I cant play Qxd5 because Bh2+ would slice her head off!",
        "16. Nh2": "Fatal loading error!!!..didn't see Nxf2 overstretching my Monarch!",
        "16... Bxh2+": "Ouch!",
        "17. Kxh2": "Not much choice now!",
        "17... Nxf2 18. Qd2": "Qd2...Her only square!",
        "18... Qe5+": "Ouch again!..and again no choice! Kg1",
        "19. Kg1 Nxh3+": "Crap...I am absolutely falling apart at the seems now!...if I play gxh6 I get mated in short order!  There are no good moves for white to play!",
        "20. Kh1 Nf2+": "Kicking me around the park!",
        "21. Kg1 Ne4 22. Qd1": "My pieces are trussed up like a Christmas turkey!...Back we go to d1 yet again...I might as well get a season ticket!",
        "22... Rd6 23. Bf3": "gasping for air!...getting vsry desperate now!",
        "23... Qg3 24. Qe2": "Yet another shuffle of Her Majesty!...I need to get my Black squared Bishop and Queens Rook into play but I fear I am fer too late to salvage anything.",
        "24... g5": "g5...Here come Black's foot-soldiers for good measure!",
        "25. Bxe4": "Gasp Gasp.",
        "25... Bxe4 26. b3": "Help!...let me out!",
        "26... Rh6": "Tell my wife I love her.",
        "27. Qf2 Rh1+": "AAAAARRRRGGGGHHHH!!!!!!!!!!!!\nWell played Pete!  Far too good for me."
    },
    "url": "https://gameknot.com/annotation.pl/bigpetas-mini-tournament-i?gm=51082",
    "gameName": "bigpeta's mini-tournament I",
    "players": "snowman100 (1689) vs. bigpeta (2085)",
    "opening": "Queen's pawn (D00), stonewall attack"
}