{
    "moves": {
        "1. e4": "I decided to annotate this game which results in an aesthetically pleasing bind from white and an illustrative endgame.",
        "1... e5 2. Nf3 Nc6 3. Bb5 d6": "The Steinitz Defense to the Ruy Lopez. Black defends his pawn on e5 and prepares Bd7 to neutralise the pin. The plan is solid, but considered slightly passive as White gets to carry on with his development. The typical position arises after 4.d4 exd4 5.Nxd4 Bd7.",
        "4. d4 exd4 5. Nxd4 Bd7": "White enjoys the space advantage and easy piece development where Black's position is sound and without weakness. Typical followup includes 5.Nc3 or 5.O-O.",
        "6. Bxc6": "The decision was made to take the knight with the bishop. The plan is to push c4 to attain a Bind position - white will blockade the center to reinforce the space advantage to pressure black. Normally, one does not trade bishops for knights, however:\n1) In a cramped position, Black's knight may have more potential than a bishop.\n2) A longterm weakness is induced in Black's structure with the resulting pawn island.\n3) White's light-squared bishop will be \"bad\" in White's resulting pawn formation.",
        "6... bxc6 7. c4": "The Bind is set. Black can attempt to immediately break it with pushing d5 (resulting in a dull game where white retains a pawn advantage for the endgame). c5 to push the knight is ineffective due to Nc2 where white still retains excellent piece activity (or later Nf5 to trade off).",
        "7... Nf6 8. Nc3": "Not only fortifies the center, protecting e4, but holds back c5 due to the potential outpost on d5.",
        "8... Be7": "The bishop may have been more powerful/influential on g7 (where g6 also helps guard f5 from the knight)?",
        "9. O-O O-O 10. f3": "Fortifies the pawn chain and prevents action along the h3-c8 diagonal (g4 in particular).",
        "10... Rb8": "Black looks for counterplay along the b-file, however b3 fits in perfectly with White's plan.",
        "11. b3 h6": "A fairly passive move, looking to prevent a pin on the knight, where Black must try to find counterplay.",
        "12. Be3 Re8 13. Qc2": "Development for White is now nearly complete after the rooks are brought to the center. This is a beautiful position for White, with a strong pawn chain and well developed pieces. The bishop on e3 supports the center and play on either side - it is nicely active will all pawns on the opposite colour. The Queen on c2 supports the knight and action along the b1-h7 diagonal.",
        "13... a6 14. Rad1 c5": "Black tries to fight back - Nf5 trades the knight for the opposite colour bishop. It will result in a doubled pawn for White... but doubled pawns aren't always weak if: they are supported, if they open lines, if they guard important squares, or if they can be liquidated to induce weakness.",
        "15. Nf5 Bxf5 16. exf5 Qc8 17. Rfe1 c6 18. Bf4": "Not only attacks the weak pawn, but pins it to the rook, opens the e-file for the e1-rook, and can support f3-e4-e5 if Black is willing to trade.",
        "18... Qc7 19. Ne4 Nxe4 20. fxe4": "Perhaps Rxe4 could have kept open lines for the rooks?",
        "20... Rbd8 21. e5 dxe5 22. Bxe5 Qb7": "22...Bd6! 23.Bxd6 Rxe1+ 24.Rxe1 Qxd6",
        "23. f6": "A questionable move - the intent to give up a pawn to isolate Black's and regain the pawn later.",
        "23... Rxd1 24. Rxd1 Bxf6 25. Bxf6 gxf6 26. Qf2": "White will battery along the f-file aiming to gain back the f6 pawn or otherwise pull off a draw.",
        "26... Qe7 27. Rf1 Kg7": "The king/queen toggle for a bit. A draw was offered out to Black partway through but was declined. (White did not claim it the the 3-fold repetition asking Black to prove it). If instead 27.Qe5 then 28.Qxf6.",
        "28. Qg3+ Kh7 29. Qf3 Kg7": "Qxc6 I felt was losing as the queen/rook are no longer connected. ",
        "30. Qg3+ Kh7 31. Qf3 Kg7 32. Qg3+ Kf8 33. Qf3 Qe3+": "Black decides to trade off allowing White to regain the pawn.",
        "34. Qxe3 Rxe3 35. Rxf6 Re6": "Or Re1+ looking to take the pawn on b3 after 34.Kf2 Ra1 35.a4 Ra2+ 36.Kf3 Rb2. The endgame after Re6 is winning for White as long as play is careful.",
        "36. Rxe6 fxe6 37. Kf2": "Aiming to centralise the king to attack the weak e-pawn. Timing is important to ensure no weaking pawn moves are made and to force zugzwang.",
        "37... Kf7 38. Ke3 Kf6 39. Ke4 h5 40. h3": "Countering counterplay along from the h-pawn.",
        "40... e5 41. g4": "hxg4 hxg4 to pull the King to the wrong side",
        "41... h4 42. a3": "or 42.a4 a5 43.g5+ and white can still queen faster",
        "42... a5 43. a4 Ke6 44. g5 Kd6 45. g6 Ke6 46. g7 Kf7 47. Kxe5": "And White has drawn off the King for Kd6 to eat Black's pawns and win."
    },
    "url": "https://gameknot.com/annotation.pl/binding-the-steinitz-defense?gm=47068",
    "gameName": "Binding the Steinitz Defense",
    "players": "tisamon (1200) vs. maryasha (1391)",
    "opening": "Ruy Lopez (C62), old Steinitz defence, Nimzovich attack"
}