{
    "moves": {
        "1. f4": "my prefered : bird opening. It makes stranges situations and a lot of interesting opportunities.",
        "1... d5 2. c4": "this is also my prefered variation against 1. f4 - d5 if black take it, things will become hard for them !",
        "2... dxc4 3. e3": "i choose this e3 to keep a strong position in the center, more risky whould be e4, but because i had lose 2 times first whith this challenger, i prefer to keep safety",
        "3... b5": "i like this way, black are going to keep there c4 pawn...i i will try to kill it attacking to the queen side. After when i will castle, with my rooq taking the f colon, it must give some good oportunities",
        "4. b3": "one way to attack it : 4. ... - c4xb3 5.d1xc3 treats b5+ and f7 for after, and kill any black center. So black cannot reasonably take it",
        "4... Ba6": "so they gon on defending there weakless position",
        "5. bxc4": "the plan is to put my queen in a4 after",
        "5... c6": "they go on defending",
        "6. Nf3": "i have to develop some more, and maybe preparing an attack to f7...",
        "6... Nf6": "developp",
        "7. Nc3": "developp",
        "7... e6": "preparing castle",
        "8. d4": "so now the center is MINE ! i have to castle quickly",
        "8... bxc4": "black finally decided to take this bloody c4 pawn ! so i will be abble to get out my queen",
        "9. Qa4": "here i am !",
        "9... Bd6": "of course black has to castle quikly to cancel the treat a4 / e8",
        "10. Bxc4": "i have to castle also, so i",
        "10... Bxc4 11. Qxc4": "very strong white center, queen in good position whith no immediat treat possible",
        "11... O-O": "free tempo to castle for white",
        "12. O-O a5": "to get out the b8 knight and maybe to move Bb4",
        "13. Ne5": "treat c6 and hoping bishop will take it, then it opens my f colon and still and very strong pawn structure (e3-d4-e5)",
        "13... Qc7": "defends c6",
        "14. a4": "block the a4 pawn and prepare move possibility for the c1 bishop to treat the a3 f8 diagonale",
        "14... Na6": "in way to occupe the b colon and getting out his knight",
        "15. f5": "and need to open my f colon to have opportunities to attack black castle. This is risky, i know, but the game was static. Wee need movment to have oportunities",
        "15... Bxe5": "of course this was the risk, but it is not so serious, after d4xe5 if the queen take back i will take c6 with mine ! and i can go on f5xe6 ...e6xf7+!",
        "16. dxe5 Nd5 17. fxe6": "pawn attack !",
        "17... Nab4": "protecting c6 and d5. this is strong.",
        "18. exf7+": "i like this !",
        "18... Rxf7 19. Rxf7 Kxf7": "i m not sure about that : was is a black bunder or was it the better choice ? help somebody ? I whould take back with the c7 queen if i was blacks, now the black king is exposed, isnt it ?",
        "20. Nxd5": "now Nxd5 is the only choice, and then the black queen will not have the time  to take e6 treatening a1",
        "20... Nxd5 21. e6+": "in way to win the d5 knight if the king take back. If nont, i will have a very dangerous passed paw",
        "21... Kxe6": "i'm getting happy ...",
        "22. e4": "e4 !",
        "22... Qb6+ 23. Kh1": "wining time, but this is not a solution",
        "23... Qf2": "i will take the knight anyway make a chess it will give the tempo to protect my king from mate",
        "24. exd5+": "d5 !",
        "24... cxd5 25. Qc6+": "i have to be carefull i'm about to be mate ! ...",
        "25... Kf7 26. Qxd5+": "i still can be mate at any moment ! ...",
        "26... Kf6": "I would have liked to put my bishop on d4 or to put my tower on f1 (with protection of course) ! there must be a way to find something like this ! let's try\r\n",
        "27. Bg5+": "now the mate treat is over and i can chess the king with one more piece",
        "27... Kg6": "I'm too hungry, I can no longer resist to this tasty rook ! ",
        "28. Qxa8 Kxg5 29. Qxa5+": "as dessert",
        "29... Kf6 30. Qc3+": "seaching to pin the white queen",
        "30... Kf7 31. Qf3+": "this safety exchange will give me the victory with my a4 pawn protected by  the rook in a1. So Roquee resign. i had to disconnect because my boss was asking some work ... thanks for comments and advices"
    },
    "url": "https://gameknot.com/annotation.pl/bird-opening-with-some-nice-bishop-sacrifice?gm=46647",
    "gameName": "Bird opening with some nice bishop sacrifice",
    "players": "31415 (1206) vs. roquee (1446)",
    "opening": "Mujannah opening (A03)"
}