{
    "moves": {
        "1. f4 Nc6": "and dont know his plan at the moment. i diced to play carefully whith e3",
        "2. e3 e5": "gambiting : I supose he think i will take it : 3. f4xe5 c6xe5! and then i won be develop the g1 knight to defend against Qh4+. But i'm not going to take the bait !! (not today...)",
        "3. Nf3": "because anyway this f4 paw is not interesting staying there : I'm planing to castle quickly and use the f colon to attack so if he go on taking f4 it will serve me !",
        "3... exf4": "he go on ...so i will castle. and he will miss a lot of development while i will be ready to attack",
        "4. Bc4": "i hope he will play fxe3...",
        "4... Qf6": "oh ! a BIG BAD Queen !!!!!!!! isnt it agressive this one ?",
        "5. O-O": "i still hope in f4xe3... and while waiting i castle and prepare a discovery attack to the queen",
        "5... Bc5": "now it's becoming dangerous for me, but a simple d4 will solve the situation",
        "6. d4 Bb6": "now i have a tempo free",
        "7. c3": "let's be carefull, the threat is still there",
        "7... d6": "preparing to pin my f3 knight\r\n",
        "8. e4": "i diced to ignore it, was it a unconsciousness ? or maybe just an inacurate move ? I just wanted to free my c1 bishop preparing to open the f colon and attack the queen and then the f7 weakness.",
        "8... Bg4": "tha was expected, but not prepared ! ...",
        "9. Nbd2": "Not the better response i'm sure, now i'm under many threats and i fell that things ca become annoying ...",
        "9... Nxd4": "knght sacrfice ! it is not good enought cxd4 and so what ??",
        "10. cxd4 Bxd4+": "what a chess ! so what, g1 h1 and that all !",
        "11. Kh1 Bxf3": "what was the black plan ? i still wonder...",
        "12. Nxf3": "and now the d4 black bishop is in danger, the black game is confused, the black king is not safe...a disaster !",
        "12... c5": "? whith this move, he wil lose all chance to castle ...",
        "13. Qa4+ Kd8": "so now i can go on whith my little plan to use the f colon ! I think that the victory has become possible, he he he ! great pleasure !",
        "14. Nxd4 Qxd4": "i have to connect my rooks to cancel the risk d4 x a1 and to be abble to use them to attack king and queen freely, so let's eat this poor abandoned f4 paw !",
        "15. Bxf4": "now the queen has the choice between eat e4 or eat b2, but i dont care ! i will eat d6 and this will be much more dangerous discovering the king. Maybe a better move for black whould be just developing the g8 knight and freeing the h8 rook...",
        "15... Qxe4": "but the tentation was to strong !",
        "16. Bxd6": "and now the situation is becoming critical for blacks",
        "16... Qc6 17. Qd1": "you see ?",
        "17... Kc8": "i have a big choice of the way to finish it ...",
        "18. Rxf7": "this should be enought ! prepraing Bc4 e6+! or maybe just Rf7 f8+! wining the a rook ...then black lose because out of time !!! what a regret for me ! but anyway the game was lost for blacks. Black loose because, i think, there where  overconfident. A Elo rating doesnt mean that is is the maximum rate... "
    },
    "url": "https://gameknot.com/annotation.pl/bird-succes-against-strong-challenger?gm=47102",
    "gameName": "bird succes against strong challenger",
    "players": "31415 (1219) vs. sacrificeit (1607)",
    "opening": "Bird's opening (A02)"
}