{
    "moves": {
        "1. e4 e6 2. Nf3 d5": "Questionable opening move (e6) by black. \n\n\n\n",
        "3. Nc3": "Developing knight and getting ready to defend if he takes my pawn ",
        "3... dxe4 4. Nxe4": "he takes pawn and I recapture. I now have strong control of center with knights and a big lead in development, i like how this game is going thus far. d4 or developing a knight probably would have been a better move for him. ",
        "4... Be7 5. d4 Nf6 6. Ng3": "Push d4 to control center and reposition knight on kingside as he develops his knight . He will have a hard time dealing with those knights if he castles kingside which is what it seems like he will do. ",
        "6... O-O 7. Bd3 Nc6 8. c3": "He castles kingside which i think was a mistake at this point. I like my position at this point, light squared bishop is in good position, pawn chain on queen side is really limited squares for his knight and dark squared bishop ",
        "8... Re8 9. O-O": "Questionable move of rook by him, not an open file and won't be anytime soon, a pointless move if you ask me. I castle kingside, kind looks very safe and now can move rook to semi-open e file. ",
        "9... Nd5 10. Re1 Bf6 11. Nh5": "not really worried about his knight on d5 or bishop on f6, they both really have no good squares to move to. I move rook to open e file and knight to h5. Usually knight on the rim is brim but in this case I it gave me a good attacking square with possibility of bishop trade which he should definitely avoid. Nxf6..gxf6 wrecks kingside defense and Nxf6...Qxf6 followed by Bg5! wins his queen",
        "11... Be7 12. Qc2": "He smartly moves his bishop and I reposition my queen behind light squared bishop to ready for kingside attack. Bishops on long open diagonals bearing down on his king will prove very hard to defend i think. Really outplaying him up until this point",
        "12... g6 13. Ne5 Bg5": "he defends against light squared bishop with g6, I allow him to take knight on h5 if he wants, would prove very bad for him eventually I think and he knows this. I bring my other knight to e5 putting a lot of pressure on g5, possible sacrifice coming? Bishop to g5 for him accomplishes nothing for him, I have no reason to trade. Should have traded knight on e5",
        "14. Nxg6 hxg6": "I see it! Knight sacrifice will lead to very good mating chances. Attempted bishop sacrifice coming next, if he bites mate will follow ",
        "15. Bxg6 Bxc1": "he sees my plan and doesnt bite on the bishop, ....fxg6 would have been followed by Qxg6+ then mate next move. He decides to pointlessly trade bishops. No need for me to take bishop with such a strong attack, I opt to continue attacking. ",
        "16. Bxf7+ Kf8 17. Qh7": "Will he squirm away? Was the knight sacrifice a blunder. He smartly decides not take bishop which would have led to mate. Now the question is do i trade off pieces and retake a material lead or continue the attack and attempt to mate? ",
        "17... Ke7 18. Bxe6+": "Continue taking pawns with bishop and putting him in check. He now has no king side defense at all, but can I mate him? ",
        "18... Kd6": "if i move bishop he mates with Rxe1# so it seems bishop is a goner. Should I cease attack and grab his dark squared bishop? He has no defense on king but his material advantage will still prove hard to overcome if i let him slip away....and then I see the mate! ",
        "19. Ng7 Rxe6": "He finally bites on one of my attempted sacrifices. Mate next move for him if I don't take rook on e6. I have something up my sleeve though....",
        "20. Nf5#": "Nf5#! Beautiful mate involving three pieces. One of my best games and first times I successfully sacrificed a piece that lead to a mate. Hope you enjoyed my annotation. "
    },
    "url": "https://gameknot.com/annotation.pl/bishop-sacrifice-leads-to-beautiful-checkmate?gm=47871",
    "gameName": "Bishop sacrifice leads to beautiful checkmate",
    "players": "deepblue17 (1407) vs. Ulla (1633)",
    "opening": "French (C00), Wing gambit"
}