{
    "moves": {
        "1. e4": "Nothing out of the ordinary for the first few moves....",
        "1... c5": "I plump for the Sicilian, i find it pretty flexible and is probably my fav to play as black... ",
        "2. Nf3 Nc6 3. Bc4": "Standard stuff...",
        "3... e6 4. c3": "A very popular move among top flight players as well as us lowly folk....",
        "4... Nf6": "No chance of Bg4 pinning me to my Queen so i go for the old Nf6 shuffle....",
        "5. d3": "I spoke too soon it seems...",
        "5... h6": "Remedied...",
        "6. O-O Be7 7. Bf4 d6 8. Bb5": "Seizing the opportunity to pin me... ",
        "8... Qb6": "I want an instant decision as to the future of that bishop...",
        "9. Bxc6+": "And that decision is provided, I don't mind this little arrangement. At this point everything is about equal developmentally speaking and positionally. No commitments have been made as yet...",
        "9... Qxc6 10. b3": "The old pawn advance heading my way, however this move does hinder the white queen a little and if my opponent isn't planning on keeping it there why not move to b4 in 1 foul swoop? ",
        "10... e5": "So i make room for my Qbishop and also attack his. Notice how i still haven't committed to castling yet on either side, hopefully this serves as a source of a little annoyance to my opponent.....",
        "11. Be3": "Support for the d push maybe...",
        "11... Bg4": "What the hell, it is annoying...",
        "12. h3": "fair enough...",
        "12... Bh5": "I decide to try and keep the pin going for as long as i can....",
        "13. Nbd2": "And that's the end of that...",
        "13... b6": "Strengthening my pawn chain a little, whilst i still have the time..",
        "14. Qc2 O-O": "With that last pawn move obviously I had committed to a king-side castle slide....",
        "15. Rfe1 Bd8": "I wanted to line up this Bishop with h2, it wasn't doing much where it was and i felt when the big pawn exchange happens it will be a dangerous diagonal to own..",
        "16. Nh2": "Prep for a little Nf1-Ng3 jig....",
        "16... Bc7": "Mission completed....",
        "17. Ndf1": "I see...",
        "17... d5": "Now is as good a time as any to open up the centre, especially with that last knight move...",
        "18. Ng3": "Carrying on with the original plan, which is what they say you should do, distractions can cost dearly...",
        "18... Bg6": "Didn't wanna trade just yet....",
        "19. Nhf1 dxe4": "Clearing the way...",
        "20. dxe4": "Splendid....",
        "20... Nxe4": "I figure I may aswel go the whole hog, I should end up with a dangerous position if nothing else....",
        "21. Nxe4 Bxe4": "This move being the logical ending to that little sequence of play wins me another pawn and opens a direct line to the white king...",
        "22. Qb2 Bxg2": "Splitting open the kings defence and exposing him to the harsh realities of life....",
        "23. c4": "Not the move i would have played....",
        "23... Bxh3": "Now i issue multiple terminal threats.....",
        "24. Ng3": "I was flabbergasted when i logged on and saw this move, but i see why. My opponent must have anticipated Qg6+ totally missing the real threat.....",
        "24... Qg2#": "And there it is, at the time of playing i was pretty happy with this win, having gone back through it my opponent made some pretty bad choices along the way but unless i hadn't made the right choices then this game wouldn't have been such a easy win...So hey ho, i've annotated it now so it's going out!\n\nCheers."
    },
    "url": "https://gameknot.com/annotation.pl/black-attack-24-move?gm=26350",
    "gameName": "Black attack 24 move#",
    "players": "Anon  vs. daveyr18 ",
    "opening": "Sicilian defence (B30)"
}