{
    "moves": {
        "1. c4 Nf6 2. Nc3 g6 3. d4 d5 4. c5": "This move is so obscure it doesn't even have a name, at least not one that I could find. The games I could find my database peak at around 2200, so that would explain the lack of popularity. But why is this seemingly natural move \"bad\"? White is gaining space on the Q-side and puts the c-pawn out of harm's way. Well here are a few basic reasons why this move is worse than almost anything else, except for putting something en prise. White moves the same pawn a second time, so he loses the first move advantage. He also releases the center tension to his disfavor, since now Black has the straightforward plan of playing e5 and create a weak pawn on c5. There is also the other possibility of play with b6, like I did in the game and that is also just as good, if not better.",
        "4... b6": "Prompting White to exchange the c5 spearhead and open the a-file and, also, to give Black the better pawn formation. If I have the time, I'll annotate another game of mine in which White did exchange and quickly found his position to be lacking in a natural plan of action.",
        "5. b4": "White wants to keep the c5 pawn where it is but that's just not possible against precise play. The other problem with b4 is that the long dark diagonal is weakened.",
        "5... a5": "Not giving White time to stabilize the position. Now if 6.bxa4, Black responds 6...cxb5 7.dxc5 e5 and all of White's pawn on the Q-side are weak. Or if 6.cxb6, then 6...axb4 7.bxc7 Qxc7 8.Nb5 Qa5 and Black threatens both Qxb5 and b3. A possible continuation is 8.e3 Ne4 (b3+ doesn't work on account of Bd2) 9.Bd2 Bd7 and the Nb5 is a goner.",
        "6. Qa4+": "Maybe 6.Qb3 was better, but White is still in trouble after 6...axb4 7.Qxb4 Nc6 8.Qb5 Bd7 9.Qd3 Nb4 10.Qb1 Rb8. White has made one move with his Knight, four with his pawns and five with his Queen. It's no wonder his position is in shambles.",
        "6... Bd7 7. Qb3": "White misses the chance to close the Q-side with b5 but Black still gets the better game after 7...bxc5 8.dxc5 e5 9.Nf3 d4 10.Nb1 (a sad necessity) Bxc5 11.Nxe5 Ne4 and Black has a lot of threats.",
        "7... axb4": "The first step into breaking White's fragile pawn chain.",
        "8. Qxb4": "8. Nxd5 is a possibility but it's hard to judge if it's better than the text. After the forced line Nxd5 10. Qxd5 Nc6 11. dxc5 e6 12. Qc4 Ra5 13. Be3 Qf6 14. Rd1 (14. Rc1 fails to 14...Qb2) Qc3+ 15. Qxc3 bxc3 16. Rc1 Bg7 17. Bf4 Rxa2, Black c-pawn is more than enough to claim a winning advantage.\n\n",
        "8... Nc6": "Now Black gets both material and positional advantage.",
        "9. Qb2": "Now 9...Nxd4 isn't so good because White has 10. Nxd5 and he recovers a little.",
        "9... bxc5": "He won't get time to recover after this though.",
        "10. Bg5": "10. e3 was safer but Black would still be much better.",
        "10... cxd4": "Opening more lines on the Q-side. Also winning another pawn and not giving White time to start developing the K-side.",
        "11. Nb5": "11. Bxf6 was better but after 11...exf6 12.Nxd5 Be6 13. e4 Bxd5 14. exd5 Bb4+ 15. Kd1 Qxd5, Black is clearly winning.",
        "11... Ne4": "The standard reply to Bg5 in the Grunfeld.",
        "12. Nxd4": "Walking right into a deadly pin.",
        "12... Bg7 13. Be3": "Covering both of Black's threats but I can always create more.",
        "13... Rb8": "Now the Knight drops.",
        "14. Qc1": "Shifting to the back rank in shame after being pounced upon by the Black pieces.",
        "14... Nxd4": "A dream position and it's only the 14th move and I'm playing Black. I have 2 central Knights, 2 Bishops ready to strike, a Rook on an open file, a large lead in development and a chunk of material to boot. How could White go so wrong so early?",
        "15. Rb1": "It's hard to even think of a logical move for White here, the two Knights are mesmerizing  from their central position.",
        "15... Rxb1 16. Qxb1 Qa8": "The mate is in the air.",
        "17. f3 Qa5+ 18. Kd1 Ba4+ 19. Kc1 Qc3+": "Mate on the next move, so White resigned."
    },
    "url": "https://gameknot.com/annotation.pl/black-invasion?gm=26577",
    "gameName": "Black Invasion",
    "players": "nikeso (1665) vs. nyctalop (1960)",
    "opening": "English opening (A16)"
}