{
    "moves": {
        "1. Nf3 e6 2. g3 b6 3. Bg2 Bb7 4. O-O Nf6 5. d3 Be7": "black is playing an overly conservative opening...",
        "6. Nc3 O-O 7. Re1 c5 8. b3 d5": "black's last 2 moves gains him space on the board while simultaneously offering better movement options for his Q and Ns.",
        "9. d4 cxd4 10. Nxd4 Nc6 11. f3": "white makes a mistake playing f3, opening the g1-a7 line while simultaneously removing the only retreating square for the N at d4.",
        "11... Nxd4": "white cannot play 12.QxN since 12....Bc5 13.Be3 BxQ 14.BxB Re8 15.f4 e5 16.Bf2 d4 17.Ne2 leaves black with an iniative, space, and material advantages.",
        "12. Bg5 Nc6 13. g4 h6 14. Bxf6": "already a piece down, black continues to trade. better is 14.Bh4 or 14.Bc1 .... 15.Bb2. This mistaken trade makes it impossible to recover from the lost N.",
        "14... Bxf6": "The N is pinned. In retrospect,  15.Nb5 a6 16.Na3 BxR 17.QxR  ...is the least damaging.",
        "15. Qd3 Nb4": "This moves devastates white since if 16.Qd1 BxN 17.Rc1 BxR 18.QxR ....;or 16.Qb5 BxN 17.Rac1 (Rec1) a6 18.Qa4 b5 19.Qa3 BxR 20.RxB NxPc! ",
        "16. Qd2 Rc8": "black piles on the pressure.....",
        "17. a3 Nxc2": "black initiates trading that earns him an extra P in the process. the match is quickly turning into a game of attrition, which white is losing.",
        "18. Qxc2 Bxc3 19. Qb1 Bxe1 20. Qxe1 Qf6 21. b4 Rc2": "black gains space with the advanced R and with the ease with which black can compile a battery with Rfc1 or play Ba6 gives white's R the supporting cast it needs to be devastating to white's back ranks.",
        "22. h3": "white is already thinking about escape routes....",
        "22... Ba6 23. Bf1 Rfc8 24. Kh1": "white accelerates the attrition game by leading off with a B sac....",
        "24... Bxe2 25. Bxe2 Qxa1 26. Qxa1 Rc2c1+ 27. Qxc1 Rxc1+": "white trades his B, R, and Q for a P, R, and Q but still wins the trade. white is down 2 pawns (7-5), with no chance of capture from his wB, while black's R can fly about the board, gobbling up Ps...",
        "28. Kg2 Ra1 29. Kg3 Rxa3 30. b5 g5": "from here on all black has to do is keep white's K from entering the action while making him choke on black's extra pawns.",
        "31. h4 d4 32. hxg5 hxg5 33. Kf2 f6 34. Bc4 Kf7 35. Ke2 Re3+ 36. Kf2 Ke7 37. f4 Kd6 38. fxg5 fxg5 39. Bf1 e5 40. Bc4 e4 41. Bf1 Ke5 42. Bc4 Kf4 43. Be2 Rxe2+": "black eliminate white's only threatening piece, and with 2 past pawns (and a third bloacked by an unprotected pawn), white is only going through the motions.",
        "44. Kxe2 Kxg4 45. Kd2 Kf3 46. Ke1 g4 47. Kf1 d3 48. Ke1 e3 49. Kf1 d2 50. Kg1 g3 51. Kh1 d1=R#": "Q is not needed for mate."
    },
    "url": "https://gameknot.com/annotation.pl/black-gains-and-then-uses-a-sneaky-advantage?gm=23574",
    "gameName": "black gains (and then uses!) a sneaky advantage",
    "players": "thiagobarbado (1338) vs. mistindantacles (1200)",
    "opening": "Reti opening (A04)"
}