{
    "moves": {
        "1. e4 e5 2. Nf3 Nf6": "Petrov's devense, or the Russian game, has a drawish reputation, but there are attacking opportunities for both sides.\n\nThe main line follows 3. Nxe5 d6 4. N3 Nxe4 5. d4 d5, when the game resolves around black's centralized knight.",
        "3. Nc3": "3. Nc3 often transposes into the four knights game.",
        "3... d6 4. Bc4 Be7 5. d3 O-O 6. a3": "Playing a3 is often a waste of time and shouldn't be played except for a specific reason.  In this case, the loss of tempo allows black to take initiative.",
        "6... Nc6 7. O-O": "Almost symetrical, except for the placement of the king's bishop.  The bishop placement becomes critical in a few moves.",
        "7... Bg4": "Pinning the knight, which is a problem without the bishop to break the pin.",
        "8. h3": "Forces the bishop to retreat or trade.",
        "8... Bh5 9. b4": "With the kingside about to explode, b4 is another wasted move.  It does prepare for Bb2, but the long diagonal is blocked and the bishop currently protects the soon-to-be critical g5 square.\n\nBe3 is better as it protects d4.",
        "9... Nd4": "Pressuring the g3 knight.",
        "10. g4": "Breaking the pin.",
        "10... Nxg4": "Sacrificing the knight to maintain the attack and break open the king's defense.",
        "11. Nxd4": "! (Good move)\n\nThis breaks the attack and forces black to retreat.",
        "11... Nf6": "The only move that doesn't lose more material.\n\nexd4 looks good, but 12. hxg4 Bg6 (dxc3 13. gxh5!?) 13. Nd5 gives white counterplay after Qg4 or Qf3.  Especially combined with the rook moving to the open g or h file.",
        "12. f3": "!? (Interesting move)\n\nNe2 may be slightly better as this leaves the d4 knight hanging and the other pieces on the wrong side of the board.  However, Ne2 would allow Bf3, which could be annoying.",
        "12... exd4 13. Nd5": "?! (Dubious move)\n\nNe2 is better.  This allows black to trade off his knight (which is currently blocking the d8-h4 diagonal).",
        "13... Nxd5": "Trading knights opens the d8-h4 diagonal, which allows black to bring his queen into play.",
        "14. Bxd5 c6 15. Bb3 Bg5": "Taking the g5 square.",
        "16. Bb2": "? (Bad move)\n\nBxg5 is better, this removes the bishop from the game.  It'll sit on the sidelines and watch the rest of the game.  I believe the intention was to capture black's d pawn, but the pawn can be protected by either c5 or Be3.",
        "16... Be3+": "! (Good move)\n\nTaking advantage of white abandoning the c1-h6 diagonal, black's bishop will dominate the rest of the game from e3.",
        "17. Kh1 Qh4 18. Qe2 Qxh3+ 19. Qh2 Bxf3+ 20. Rxf3": "Forced.",
        "20... Qxf3+ 21. Qg2 Qxg2+": "Black simplifies down to a won endgame.  With the passed pawns on the kingside and two rooks to escort them, versus a rook and bishop (the passive bishop doesn't count), trading queens to prevent counterplay seemed a good idea.",
        "22. Kxg2 g5 23. Rf1 Kg7": "Breaking the pin on the f pawn.",
        "24. Rf3": "Threatening Rxe3, winning the bishop as the d pawn is pinned.",
        "24... Kg6": "Breaking the pin on the d pawn.",
        "25. c4": "? (Bad move)\n\nc3, contesting the d pawn, would be better.  This just blockades the white bishop and removes it from the game.",
        "25... f5 26. exf5+ Rxf5 27. Rh3 g4": "Rf2 looks interesting, but capturing the bishop is unnecessary, and pushing the passed pawns is more important.",
        "28. Rh1 Rf2+": "I don't remember why I decided to capture the bishop, but like i just mentioned, it's causing no trouble and should be left alone.  Fortunately, I remembered that before my next move.\n\nRf8, Rh8, or h5 are all better.",
        "29. Kg3": "Kg1 Raf8 would confine the king to the back rank while the pawns marched forward to crush him.",
        "29... h5 30. Kh4": "?? (Blunder)\n\nThis invites certain death.  After Rf3, the king is confined and cannot escape mate.",
        "30... Rf3": "! (Good move)\n\nTaking advantage of white's blunder.",
        "31. Rf1": "Preventing Bf2#, but Bg5# still exists, as well as...",
        "31... Rh3#": "0-1\n\nPlease feel free to message me if you have comments, questions, or find any mistakes."
    },
    "url": "https://gameknot.com/annotation.pl/black-seizes-initiative-after-white-wastes-moves?gm=5242",
    "gameName": "Black seizes initiative after white wastes moves.",
    "players": "friction009 (1311) vs. anotherminorpawn (1651)",
    "opening": "Petrov three knights game (C42)"
}