{
    "moves": {
        "1. d4 d5": "The queen's pawn used to be my favourite opening, for both black and white, but for some reason I tend to lose more (at least here on gameknot) when I play the Queen's pawn as black.  My mentality when playing this was that I was probably going to lose this, as my favourite opening as black is the sicilian.  Back then at the beginning of the game I was rated 1575.",
        "2. e3 Nc6 3. a3": "Don't know why he (I'm going to call my opponent a he for simplicity) did that.  My bishops haven't even moved yet.   Thus now I know ...Bf5 would be needless, allowing me to think slightly further ahead.",
        "3... Nf6 4. Bd3": "Not very aggressive.",
        "4... e6 5. f4": "Now he wants to attack, but unfortunately exposes his king before castling, although I cannot attack it yet.\n",
        "5... Bd6": "Best way to develop a new piece while defending.",
        "6. Nf3 O-O 7. O-O Ne4": "I didn't like the way that bishop controls so many squares and threatens a check anytime. Since my knight was useless anyway I decided to make his bishop useless too.",
        "8. Bxe4": "With the knight on e4, it is more useful than the bishop so he believes it's a worthwhile trade.",
        "8... dxe4 9. Ng5": "Uh-oh. Here comes the attack.  At least his bishop is gone, otherwise I might be in trouble.",
        "9... f5": "Completing my pawn structure while opening up space on my side of the board.",
        "10. c4": "Now he wants to cram all my pieces together...",
        "10... Be7": "The faster the knight is gone the safer I would feel.",
        "11. Nh3": "Good. Now his knight is useless and is a burden for him.",
        "11... b6": "Preventing c5 + freeing bishop.",
        "12. b4": "His pawns are REALLY irritating.  They really limit my moves, but at the same time, good/bad moves become more clear, reducing my chances of blundering because there are fewer choices.",
        "12... Bf6": "preventing d5.  I can't afford to let him cramp me in.",
        "13. Bb2 a5": "Inviting b5",
        "14. b5 Ne7 15. Nc3 Bb7 16. Rc1 Rc8 17. a4 c5": "Now I want to break open the position.",
        "18. bxc6 e.p. Rxc6": "Good. Now he has a lone pawn. But he also has two passed pawns. Sort of.",
        "19. Nb5": "I have to say that knights are the most annoying pieces on the board.  At least the queen and rooks go straightforward.",
        "19... Qd7": "Really not much I can do here.",
        "20. Qb3": "oh great. Another attack to fight off. But then, for him, if he doesn't attack then he gets attacked.",
        "20... Ba6": "I really want to get rid of the knight, especially considering how many times I lost games because of the peculiar way the knight moves.",
        "21. Nf2": "My defense here is quite solid, so currently we are at a standstill.  I think Nf2 is a wasted move, but I don't see many other moves.",
        "21... Rcc8 22. Nh1": "This move loses tempo.  ",
        "22... Bh4": "Preventing the knight from going to g3.",
        "23. Ba3 Bxb5": "I'm kind of an impatient guy and don't like standstills.",
        "24. axb5 Rc7": "Giving my knight extra protection, as well as an option to double rooks on the c file.",
        "25. g3 Bf6 26. Nf2 Rfc8 27. c5": "OK there, he is definitely getting a passed pawn. But luckily my defense is good.",
        "27... bxc5 28. Bxc5 Rb7 29. b6 Nd5": "I'm not gonna let that pawn get anywhere.",
        "30. Qa3": "I don't know why he's giving up his passed pawn. Does he think it is hopeless of making it to the end? I would have played Rb1",
        "30... a4": "At this point, I refuse to trade my own passed pawn. I want to win a pawn.",
        "31. g4": "Why he doesn't defend the pawn, I have no idea.  Maybe he overlooked something. Seems intent on cramming in my position. He had two opportunities to defend the pawn.\n",
        "31... Nxb6 32. Rcb1": "I had checked beforehand to make sure he couldn't win a piece from that pawn.  Perhaps he thought if I take the pawn then he wins a piece? Oversight?",
        "32... Rcb8 33. g5 Be7": "I had calculated all this from move ",
        "34. Bxe7 Qxe7": "I had calculated precisely these moves from move 31. g4 to this move. At this point, my position is slightly superior.",
        "35. Qa2": "He should have traded queens. This move screws up his already inferior position by losing a tempo and allowing my pawn to become even more dangerous.",
        "35... Nd5": "I was willing to trade my passed pawn for his e3 pawn.  ",
        "36. Rbe1": "Obviously he isn't very willing to trade that.  By losing that pawn, his position would be even worse.",
        "36... a3": "Now this pawn is a real big threat.",
        "37. Nd1": "?? I think this move messed him up completely.  He probably thought it prevents Rb2 as well as Nxe3. The problem with this is that it traps his own rooks, and now the e3 pawn is a terrible burden for him since he can't use his rooks to attack my passed pawn. He should have accepted the trade.",
        "37... Qb4": "Now i was getting serious about queening my pawn. 10 moves ago, I wanted to get rid of it!",
        "38. Re2 Qa5": "Setting up my queen to protect my pawn all the way until it queens. Amazingly, his knight cannot move now, while mine has so many threats!",
        "39. h4": "Why he doesn't even try to get rid of my pawn is something I don't understand.  He probably wants to surprise attack my king, and when it has nowhere to go, he checkmates. Fortunately my king is very save now.",
        "39... Rb7b3": "I was planning 40...Qa4 followed by 41...Nb4 to move my pawn forward. Actually, at this point he is almost lost already. I just haven't figured out the decisive combination yet.",
        "40. Rfe1": "The reason he is losing is that he made too many wasted moves, like this one.",
        "40... Kf7": "This move seals the game, preventing the surprise attack Qxe6+",
        "41. h5": "He just really doesn't get it! ANOTHER wasted move! Is he blind to my tactics?",
        "41... Rb3b1": "Now I have figured out the winning moves. Watch this beauty play itself out.",
        "42. Kf2": "He STILL hasn't figured out how much danger he is in. Anyhow, there was nothing he could have done at this point.",
        "42... Rxd1": "Sacrifice! Not really a sacrifice as I can get the material back next turn. Personally I think this is the best move I have ever made in my chess life to date. He DEFINITELY did not see that coming.",
        "43. Rxd1 Nc3": "A THREE -piece FORK! That's like dining equipment!",
        "44. Qa1": "The only move available.  Qc4 loses the entire rook.",
        "44... Nxe2": "Much better than Nxd1, after which white can equalize.",
        "45. Kxe2 Rb2+": "Now I win. He has only one place to move his king.",
        "46. Kf1 Qb5+": "He should really resign now.",
        "47. Kg1 Qe2": "And he resigns."
    },
    "url": "https://gameknot.com/annotation.pl/blackknight077s-mini-tournament-v?gm=36584",
    "gameName": "blackknight077's mini-tournament V",
    "players": "doconnie (1705) vs. riceant (1686)",
    "opening": "Queen's pawn (D00), stonewall attack"
}