{
    "moves": {
        "1. f4": "The Birds opening. One I come across once in a while and one that does throw me a little. However I had little to fear this time round.",
        "1... d5": "I decided upon a d5 and fight for the centre...",
        "2. Nf3": "The usual suspects start appearing..",
        "2... Nf6 3. d3 Nc6": "I did consider Nd7 but decided to put my knight on c6 instead, as Bg5 wasn't an immediate threat so I had time to play h6 if g5 needed covering.  As it turned out this was a vital decision.",
        "4. e3": "Some consider this a \"wasted\" move as this pawn will finally find it's way to e4 in many scenarios, but it does serve a purpose using e3 as a stop gap...",
        "4... Bg4": "I decided to use the pin and try and force h3 bf5 g5 so as to hinder any ideas of castling, but then this could also be considered a wasted move as the bishop will have to retreat back to d7 or c8 as h3 Bh5 g4 Bg6 losses the Bishop to f5.",
        "5. Be2": "Immediately Un-pinning the Queen.. ",
        "5... Qd7": "This move committed my bishop to the sacrifice but not before pulling out the pawns...",
        "6. O-O O-O-O": "I feel a little happier about sacrificing my bishop now that the white king has castled as the kings cover will be completely blown wide open....",
        "7. h3": "The pawn advance begins, i want maximum effect so i draw out the g pawn to....",
        "7... Bf5 8. g4": "......",
        "8... Bxg4": "Now is the time to strike!",
        "9. hxg4": "As expected, if i can pull this off it will be glorious...I feel inspired.",
        "9... Qxg4+": "Collecting the second pawn in exchange for my bishop, I also gain an enormous potential for an all out assault...",
        "10. Kh2": "Dodging the bullets...",
        "10... Qh5+": "Firing another volley and opening space for my knight if need be, one way or another i have to drought in reinforcements and quickly if i am to keep my attacking edge.....",
        "11. Kg1 h6": "In preparation for g5 and hopefully a fast route for my castle and Kings Bishop to enter the maelstrom....",
        "12. Nc3": "I guess this was an attempt to coordinate a defensive counter and develop....",
        "12... g5": "I needed to create threats and I felt this was a good plan....",
        "13. fxg5": "I don't know if this was best but I'm happy to exchange, I'm sure my opponent felt he had to keep the g file closed by any means...",
        "13... hxg5": "Now my Rook has the h file...",
        "14. Kf2": "Avoiding Qh1+...",
        "14... g4": "Keeping the tempo up and forcing the issue as much as i can, i need to keep my opponent off balance.....",
        "15. Ke1": "Opting for retreat and sacrificing the material advantage. I have positional advantage and the material one now too....",
        "15... gxf3 16. Bxf3": "I now find myself a pawn up and the white King has retreated back to the center of the board. I still have to keep up the pace....",
        "16... Qh4+ 17. Kd2": "Retreating a little more...",
        "17... d4": "This move i think was really the killing blow, such a simple but deadly move.....",
        "18. Ne4": "I hadn't planned on taking the knight had it been left on c3 after dxc3 bxc3 it wasn't such a clear win by my reckoning so i plough on ahead with my original plan...",
        "18... dxe3+ 19. Kxe3": "I knew this was a lethal attack at this point and i couldn't see a way to stop it, I really was inspired by this game....",
        "19... Bh6+": "Landing another mortal wound...and showing why the silent d4 was so deadly..",
        "20. Ke2 Nd4#": "Just beautiful, I'm very proud of this game. Playing as black, sacrificing and checkmating in 20 moves really did make me feel brilliant. This is one of those rare moments in chess when it just all went perfectly for me. This is why i play for moments of satisfaction like that. Thx for reading and plz feel free to comment."
    },
    "url": "https://gameknot.com/annotation.pl/black-win-in-20-moves-v-birds-opening-bishsac-comments-plz?gm=26334",
    "gameName": "Black win in 20 moves v Birds opening+Bishsac. Comments plz.",
    "players": "Challenger (1910) vs. daveyr18 (1983)",
    "opening": "Bird's opening (A03), Lasker variation"
}