{
    "moves": {
        "1. d3 Nf6 2. f4": "  The \"Crappian\" opening, so very well unknown by most players. Let's see where it leads (chaos and defeat if properly defended I guess)",
        "2... e6 3. e4 Bc5": "Excellent! impedes 4.Be3 and short castling. This is what happens when you don't think about the consequences of your opening flaws.",
        "4. Nf3": "With the idea of d4. A wasted time considering two movements by \"d\" pawn, but a must here.",
        "4... Nc6 5. Nc3": "So why not to go for 5.d4 then? No idea, I could have saved a time and keep on wasting moves. Not that these are losing ones, but do not help in the development. See that now black can go castling and start exerting some pressure on \"e\" column, while WK is still far away from finding a safe place.",
        "5... Ng4": "Maybe not the best yet. Castling seemed to me to be a very strong one, as mentioned before.",
        "6. d4": "Better late than never.",
        "6... Bb4 7. h3": "Now I'm thinking about short castling, but felt Ng4 was annoying there. Still h3 seems another wasted time.",
        "7... Nf6 8. Bc4": "Why here and not Bd3, I'm asking myself after this. I even knew about the threatened pawn in e4, and yet still did move B to c4. It was a real fast move, not thinking, I guess I was not really 100% focus on the game.",
        "8... Nxe4": "But now I start feeling like being in that position that the Italian opening presents white, although the pawn in e6 prevents any attack onto the castling, so black is safer. If played well, that extra pawn should not bring any trouble. And yet, I can activate my rook and start a mild attack if allowed. Let's see how this develops.",
        "9. O-O Nxc3": "Not sure if Bxc3 would have been a better move. But this starts getting similar to those Greco positions from the XVII century (well, not that similar, since e6 is really blocking my bishop's attack. Let's give it a try then.",
        "10. bxc3 Bxc3 11. d5": "It should be a losing move, but it brings a lot of pressure on black. Hope I can fish something positive out of this. At any rate, 11...Bxa1 is not (seems to me) a bad move at all.",
        "11... Na5": "Now two pieces threatened though. Attack is the only way out here (considering the position is lost if well defended, but again, a position like this in a blitz game is not that easy to defend for people like me)",
        "12. dxe6 Nxc4": "Now this is seems a grave mistake, although 12...dxe; 13.Qxd8+; KxQ 14. Ng5 might look like an annoying thing for black, it has already gained a bishop and about to get a free rook. Nothing can save white here.",
        "13. exf7+ Kf8": "\n",
        "14. Qd3": "Now, I either get the N or the B. The choice seems clear, since otherwise black will not have compensation",
        "14... Bxa1 15. Qxc4": "But this leads to a tight and rough situation for black. Can it be properly exploited? The threat is Ba3+ at some point.",
        "15... Qf6 16. Ba3+": "A must, to keep pressure up and chances to win.",
        "16... d6 17. Qxc7": "I had a quick thought about Ng5 but did not see anything clear, and, as said, it is important to move fast trying to induce a mistake on your opponent, so basically didn't hesitate. Again, Bxd6 is the threat",
        "17... Bd4+": "In the original greco setting, this wouldn't have happened. On the other hand, f4 will allow then WN next movement.",
        "18. Kh1 Bc5 19. Bxc5 dxc5 20. Ng5 h6": "Maybe Bf5 is better.",
        "21. Re1": "Since N cannot be taken",
        "21... Bf5": "But no is late.",
        "22. Qxc5+": "Mate in one!"
    },
    "url": "https://gameknot.com/annotation.pl/blitz5m-remembering-greco?gm=59896",
    "gameName": "Blitz5m remembering Greco",
    "players": "kenderfender (1882) vs. siva2013 (1777)",
    "opening": "Mieses opening (A00)"
}