{
    "moves": {
        "1. e4 c5 2. Nf3 g6 3. e5 Bg7 4. c3 e6 5. d4 cxd4 6. cxd4 Ne7": "This knows many variations... Blacks objective is controlling d5... After 7. Nc3 0-0 8. Bc4/Ne4, always d5...",
        "7. Bd3 O-O 8. O-O Nbc6 9. Be3": "White is losing momentum... Best is 9. Re1 f6 10. Nc3... Black has to postpone d5...",
        "9... f5": "Black finds a new way... We threathen f4...",
        "10. exf6 e.p.": "Best is Qd2... Black can no longer play d5, due to Nc3...",
        "10... Bxf6 11. Qd2 Nd5 12. Bh6 Rf7": "Nothing wrong with Nxd4, Nxd4, Bxd4... Bg7 is probably best...",
        "13. Ng5": "Best is Nc3... White is trying to unbalance black...",
        "13... Re7": "Easier seems Bxg5, Bxg5, Qb6! But this is blitz, see?",
        "14. Ne4 Bg7": "Of course, better is straight away Bxd4, Bg5, Qa5! But I'm a hardhead...",
        "15. Bg5": "Right...",
        "15... Bxd4": "Against better judgement, but I was getting the feeling, white was losing control... Better might be Qb6...",
        "16. Bxe7 Qxe7": "Not best for both of them. White had surely better in 16. Nbc3!, dis-engaging blacks position totally. Black had better in 16. ... Ndxe7, opening the way for d5...",
        "17. Nbc3 Nxc3 18. Nxc3 d5": "Finally... Have to admit: I've seen better positions coming out of this... But this was the fruit of barely two minutes of play! The clocks were at 6 minutes plus, each... I was expecting Re1, Qf6 (due to Nxd5)...",
        "19. Bb5": "Trickery...",
        "19... Bb6": "Better might be Bg7... But I had the feeling, I had him... Of course, white is dying for f4, and black for Bd7...",
        "20. Rae1": "There we go... 20. Na4 could well be the winning move for white... Black is totally tied up...",
        "20... Nd4": "The Black Queen firmely holds it's ground... Black poses new problems... 21. Ba4 Qh4 22. Re3 Qf4 looks good for black...",
        "21. Nxd5": "Exactly what I hoped for... White takes the bait... After Qd8!, (Nxb6, Nf3+, gxf3, Qxd2, Nxa8, Qg5+, Kh1, Qxb5), white can safely resign... I thought I had better...",
        "21... Qc5 22. Nxb6 Qxb6 23. Bc4 Nf5": "White is totally winning... After 24. Rd1 Qc7 25. Qd8+ Qxd8 26. Rxd8+ Kf7 27. Re1, I would have resigned this blitz game... With 7 minutes on the clock...",
        "24. Bxe6+ Bxe6": "This is dreadfull, of course... For some reason, it eluded white that e6 was twice covered... Thus resolving blacks bad bishop into an instant killer... I apologize in shame... Luck is always unfair, but black is far from winning... After 25. b3 Rd8 26. Qc3 black has lots to prove...",
        "25. g4": "Probably out of frustration, white produces the losing move...",
        "25... Nh4": "A quicker win presents Nd4, Re3, Rf8, Rd1, Nf3+, Rxf3, Rxf3...",
        "26. Qe3 Qxe3": "I buckled, under no time pressure, and in extacy of my luck... Better is - of course -  Bd5, gaining all...",
        "27. Rxe3 Bxg4 28. Rfe1": "Again, white is not paying attention... Correct was Rc1, with fighting chances... We are playing blitz...",
        "28... Nf3+ 29. Kg2 Nxe1+ 30. Rxe1 Bf5 31. h3 Kf7": "Robs black of Re7...",
        "32. f4 Rd8 33. Re2 Rd4": "All forcings...",
        "34. Kg3 h5": "Nothing wrong with Rd3+, Kg2, Bxh3+, Kf2, but I was \"being better\"...",
        "35. h4": "Better, first Re3...",
        "35... Rd3+ 36. Kf2 Bg4 37. Re3": "Too late, for comfort...",
        "37... Rd2+ 38. Kg3 Rxb2": "Of course, white is totally lost... But this is still a critical position... White is almost in stalemate, if he loses the rook...",
        "39. Rb3": "But this is not the way... 39. a3 was toughest...",
        "39... Rxa2": "Being romantic again... Winning is Rxb3+, axb3, a5... But this poses a nice trap...",
        "40. Rxb7+ Kf6": "This is the ending position... White had some 4 minutes left, black had 6 or so... I never heard from him again... He timed out... Coward!",
        "41. Rb3": "Apart from whites rook, and f4-f5, the position is stalemate for white... No good is 41. Rb6+, axb6, f5 (dreaded pawn), g5!, hxg5+, Kxg5, f6 (...), h4 mate... After 41. f5, gxf5, Rb3, Ra4, threathening f4, and/or Kf6-e5-e4... Now, 41. ... Be6! 42. Rb5 a5 wins easily... White has one pawn too many..."
    },
    "url": "https://gameknot.com/annotation.pl/blitzing-in-the-year-of-the-dragon?gm=43105",
    "gameName": "Blitzing in the year of the Dragon...",
    "players": "puiw (1642) vs. vonbonkisback (1946)",
    "opening": "Sicilian (B27), Hungarian variation"
}