{
    "moves": {
        "1. e4 e5 2. Nf3 f5": "?! The Latvian Gambit. I have a whole bunch of annotated games in this opening, take a look at them for the main lines. It is generally pretty unsound, but can be strong in blitz if White is not prepared!",
        "3. Nc3": "Too passive for my tastes. Better are 3.Nxe5, 3.exf5, or 3.d4.",
        "3... Nc6 4. h3": "? Put simply, this move accomplishes nothing. It doesn't make way for development; it doesn't prevent any threats, and it doesn't threaten anything. Much better was 4.d4.",
        "4... Bb4 5. Bb5 Nf6 6. Nd5": "!? Very aggressive. Black cannot win the e-pawn right off since the Bishop is hanging after 6...Nxe4? 7.Bxc6 bxc6 8.Nxb4.",
        "6... Bc5": "Now Black threatens ...Nxe4.",
        "7. Bxc6": "I don't like this, even though there's nothing obviously wrong with it. White initiates a series of trades that leaves him with only one developed piece and a hanging pawn, all while accelerating Black's development. Better was 7.d3, or even 7.d4.",
        "7... dxc6": "Anticipating 8.Nxf6+ Qxf6, Black is making ready to castle queenside, so this move is preferable to 7...bxc6.",
        "8. Nxf6+ Qxf6 9. d3 f4": "Black releases the tension in the center in preparation for castling; he must close off the White Bishop's scope. This also foreshadows the massive kingside attack that is Black's signature in this opening.",
        "10. c3 Be6": "Developing while subtly preventing 11.d4, since 11...O-O-O would pin, and subsequently win, the d-pawn.",
        "11. b4": "White kicks the Bishop anyway, but he desperately needs to be thinking about finishing his development--Black is almost done and White still only has one piece off its home square.",
        "11... Bb6 12. Qa4": "This seems to be intended to prevent 12...c5, but Black is obviously ready to castle here. Developing the Bishop or simply castling were preferable; this just wastes a tempo.",
        "12... O-O-O": "Forcing another Queen move for White, as he must now defend the backward d3 pawn.",
        "13. Qc2 g5": "With his King safely tucked away, Black begins to march on the White kingside. Black is now completely developed, whereas White still hasn't castled and is at least a move away from being able to (unless he wants to go kingside, but that looks... risky).",
        "14. Bb2 h5 15. a4": "White responds with an aggressive posture, though I think Bd2 and O-O-O would have been safer. As it is, White is threatening to trap the DSB, but Black has a preemptive response...",
        "15... g4": "Thanks to White's unconnected Rooks, Black is happy to blow the h-file open and kick the Knight back at the same time. Removing the Knight from f3 also make h4 look particularly inviting for the BQ.",
        "16. hxg4": "I think the immediate 16.Nh2 would be better, to prevent giving Black the h-file uncontested.",
        "16... hxg4 17. Rxh8 Rxh8": "Now g1 is the only reasonable place for the Knight (since 18.Nd2 runs into immediate problems after 18...Bxf2+! where if White captures, 19.Kxf2 Qh4 20.Ke2 Qg3 21.Rg1 Rh2 and there's no way to stop the g-pawn from falling as well), which is why I think Nh2 should have been played earlier.",
        "18. Ng1 Rh1 19. O-O-O": "White finally castles, now that it's literally the only way to save his Knight (though that doesn't last long...). ",
        "19... Qh4": "The Black Queen's time has come, and what an entrance she makes.",
        "20. Rf1": "White would have been better served by playing 20.d4, or maybe 20.c4 and trying to get his Bishop to somewhere useful. The text just needlessly weakens his position by removing the defense of the Rook--so now White's Knight is pinned, as well.",
        "20... g3 21. c4": "? This would have been okay last move, but it's far too late here. 21.Qe2 was worth a look, allowing 22.Nf3.",
        "21... gxf2": "White has to lose a piece to eliminate the advanced pawn now, and the f4-pawn is nearly as big a threat looming on the horizon. The Ng1 can't even move out of the way, since it's still pinned to the undefended Rook.",
        "22. Bxe5": "0-1. White eagerly snatches up the e5 pawn, only to realize that he's terribly lost anyway; his Rook and Knight are both about to fall to Black's pawn (probably after 22...Be3+) and he has no counterplay opportunities whatsoever, so he throws in the towel. Thanks to mesledarya for a fun game! Comments are much appreciated; thanks for reading!"
    },
    "url": "https://gameknot.com/annotation.pl/blitz-charge?gm=47115",
    "gameName": "Blitz: Charge!",
    "players": "mesledarya  vs. bwaa ",
    "opening": "Latvian counter-gambit (C40)"
}