{
    "moves": {
        "1. b4": "Never been able to counteract this opening properly, although I've seldom been challenged with it. Don't even know the name.",
        "1... f5": "So let's try something opposite to what we are facing. I know that short castling will be threatened by BB with such an open diagonal, and that I should aim for a string center, but let's see something different.",
        "2. Bb2 Nf6": "In case black tries to gain the b4 pawn, he will be facing problems unless knowing the opening, which as Is aid, is not my case. But maybe d6-e5 was the wise defence here. At any rate that can still be achieved after 2.Nf6.",
        "3. c4": "White doesn't think much about developing but on pressing the Q-side. it is an interesting approach, since black may have now facing multiple threats in case of long or short castling.",
        "3... b6": "This might not be the wisest continuation though. But it gives white something to think about. And remember we are playing 3min +10sec blitz here.",
        "4. Nc3": "Allows for an advance on the center. Maybe d4 was stronger?",
        "4... e5 5. a3 Bb7 6. e3": "Preparing the breakthrough at the center.",
        "6... d5": "I gave some time to this move. I wasn't feeling like playing defensive here with 6...d6, and though I could put some pressure on white. It may be too much a prey to bite. Both sides are underdeveloped but black, as said, has no strong castling to go for. Also, in case Nf6 moves, check in h5 would be annoying. Therefore, after 7.cxd5; Nxd5. 8.Qd1 (seems a wasted time, but definitively forces black to go for the long castling) forces a pawn race on opposite wings.",
        "7. Nf3": "Didn't expect this. More time consumed thinking on the next move. 7...Nbd7 will lead to the loss of the e5 pawn after the exchange on d5 (8.Nxd5 mediated)",
        "7... d4": "Pushing my luck. BK looks quite naked there. Doesn't smell very good, and now long castling seems so needed...",
        "8. exd4 exd4": "Now black doesn't seem to have a bad position here. but d4 pawn seems ill-defended, unless c5 comes to the rescue, and then, good-bye long castling (but hello! short one). 8...d4 not only puts some pressure on white, but also opens the a8-h1 diagonal for BB at b7.",
        "9. Nd5": "Interesting response. I was thinking about 9.Nb5 and what if 9...d6. Looks painful for white, although nothing troublesome so far.\n9.Nd5 puts pressure on d5, therefore the answer is either c5 or Nxd5. ",
        "9... Nxd5 10. cxd5 Qxd5 11. d3": "Not taking d4 yet. Didn't give much thought now to 11...c5. I aimed for developing my Nb8 and then castling.",
        "11... Nd7": "On the other hand, c5 could leave WB on b2 less useful.",
        "12. Be2": "Seems wise to me, although it may be an error, not sure. At any rate, the aforementioned pawn race will start soon.",
        "12... O-O-O": "This may be risky, since c7 will remain a weak spot, but nothing I cannot solve after Bd6.",
        "13. Bxd4": "Opening that painful diagonal besides recovering the pawn.",
        "13... Re8": "Maybe a wasted effort. I was aiming to put some pressure on the king, to avoid any happy leap from WN in f3 (followed by Bf3, saying a pawn for attack on my castling). Too big a plan maybe, sort of paranoid. Maybe Rg8 was stronger (and safer!)",
        "14. O-O g5": "And there I go! I was thinking about this move a couple of moves back, so obsessed with WN being pinned... that didn't realize the gift I just made.",
        "15. Bxh8": "Wooops! nope, didn't see it",
        "15... Bd6": "Ok, let's move as aggressive as possible, game is not over. Less than 2 mins for white to play calm and clear to victory.",
        "16. Bb2": "Back to safety. Considering h8 is a lovely jump point for my rook, is logic to try to conserve this bishop",
        "16... h5": "All ahead",
        "17. h3": "Not sure if this will be of help. I must admit I cannot see an easy solution to this situation for white.",
        "17... g4": "Not sure either that this is the best either. But is easier to find pushing moves for black than good defensive moves for white (at our level, I mean)",
        "18. hxg4": "This opens \"h\" file. Now the plan would be Re7 --> Rh7 if allowed.",
        "18... hxg4 19. Rc1": "Interesting. Attacking on the opposite side is a golden rule in chess. After gxf3, Bxf3 gives good chances to white (I'd say the game). Now the plan is either the mentioned Rh7 (and hopefully along the Queen) or Q to the \"h\" file. It may take too long though. Maybe Re1 would be a releasing one, better than Rc1.",
        "19... Ne5": "It threats Nxf3 (dangerous if rook is moved to g8) and also blocks the h8, allowing for the rook to move there.",
        "20. Bxe5": "Not sure if this is the best. I think black didn't have enough attack yet, and the exchange could have been postponed until 20...Rg8",
        "20... Bxe5 21. Qc2": "Not threatening , since Nf3 is pinned. Moreover, removes the Queen from a very important defensive role on f3, allowing the following combination.",
        "21... Rh8 22. d4 Bh2+ 23. Kh1 Bd6+ 24. Kg1 gxf3 25. Bxf3": "gxf3 leads to the same result. It seems is mate in 10, after trying to set up a puzzle using the gameknow engine.",
        "25... Qxf3 26. gxf3 Rg8+": "And mate in 1."
    },
    "url": "https://gameknot.com/annotation.pl/blitz-3m-persevere-even-when-loosing-a-rook?gm=59987",
    "gameName": "Blitz 3m. Persevere even when loosing a rook",
    "players": " (1880) vs. kenderfender (1882)",
    "opening": "Polish (Sokolsky) opening (A00)"
}