{
    "moves": {
        "1. d4 f5": "We had played some games previously, and our opening scheme was already set. He liked the dutch, I love the London attack. So we went for it.",
        "2. c3": "\"Too passive!\" \"Self blocking move!\". \nYes, but my plan is to attack strongly on the kingside, so I need to have the queenside completely locked. \nOf course, all this holds in a blitz game where I more or less know my opponent's way of playing. ",
        "2... g6": "...assuming the blockade of the black diagonal.",
        "3. Nf3 Bg7 4. Bf4": "The caracteristic move for white (\"my way\"). Bg5 is a waste of time, since Nf6 unpins the e pawn for black. \nMoreover, now black can have either a N or a B in g5 at any moment. He can kick them out very easily (h6), but weakening the kingside, and you know, a moment can be enough. \n",
        "4... Nf6 5. h4": "I don't care about a possible Ng4. I know that the Dutch \"must\" be attacked soon and strongly. And that if black has some weak point, it is the h column. \nThe a2-g8 diag can be easily covered with e6...",
        "5... b6": "Black takes it easily. The h4 move didn't tell him what I am thinking...",
        "6. Qb3": "I'm not doing really anything, but I must make him defend.",
        "6... e6 7. e3 Bb7 8. Be2 Nc6 9. Nbd2": "All are normal and quiet developement moves. But black, in my view, must get to o-o-o, or to attack the queenside (far from it), but he seemed to think that he is all-right, so he castled kingside. ",
        "9... O-O 10. h5": "I didn't even think about it. The other rook is coming soon. If I o-o-o first, he can suspect something... and take some countermeasure. \nYou know, this is blitz...",
        "10... Nxh5 11. Rxh5": "without thinking it twice.",
        "11... gxh5 12. O-O-O": "Enough? I don't know, really, I like to play in an \"attack or die\" fashion, when no serious prize is on the table. ",
        "12... a5": "At last black weakens up! But...",
        "13. a4 Ne7": "Just to allow BxNf3 and loosen a little the pressure. But it doesn't help. ",
        "14. Rh1 Qe8": "This move just loeses a tempo in a position where correct defence is badly needed. ",
        "15. Ng5": "Ok, so after Ng6, it was unclear how I could have won, but it would have been another game. \nOf course, after Bxg2, Bxh5 then Rg1. ",
        "15... Nd5": "Blocking the queen's action and threatening the dsb. ",
        "16. Bxh5": "Of course",
        "16... Qe7": "Of course. Now, the move that makes the game interesting. Nothing special, but still...",
        "17. Nxh7": "Black doesn't have to take the knight. \nNxBf4 is nice, and probably white loses. \nBut, if he do takes it...",
        "17... Kxh7 18. Bf7+": "Yum yum! ",
        "18... Bh6 19. Bxh6": "...and this is the second one. \nIf Rxh6+, Kg7 and \"nothing happens\"... except white loses a piece. But this way, if black takes f7 with the queen, Bxf8+, and probably wins due to Qd1, coming into the action. \n\nThe game followed some more moves, but finally white won. "
    },
    "url": "https://gameknot.com/annotation.pl/blitz-n-1-proof?gm=35398",
    "gameName": "Blitz nº1 (proof)",
    "players": "damalfi  vs. pastsia ",
    "opening": "Dutch (A80)"
}