{
    "moves": {
        "1. d4 Nf6 2. e3 d5": "A Stonewall attack by a transposition of moves. White's ideal setup is pawns on c3,d4,e3,f4. Knights on d2 and f3 and a bishop on d3.",
        "3. Nd2 e6 4. Bd3": "The whole goal of the last 2 moves is to defend e4,the weakest point in the Stonewall.",
        "4... c5 5. c3 c4": "?! A dubious move,releasing all of the tension in the center and allows White to do as he pleases.",
        "6. Bc2 Bd6 7. f4 O-O 8. Ngf3": "I've achieved the Stonewall setup without any difficulty",
        "8... Ng4": "? Another bad move,losing a pawn to the tactic...",
        "9. Bxh7+": "! Black never saw this coming",
        "9... Kh8": "9...Kxh7 10.Ng5+ followed by 11.Qxg4 ",
        "10. Ng5": "who cares about pawns? I'm hunting a bigger prize...the enemy king!",
        "10... Nxe3": "The knight is very hungry and doesn't hesitate to take the helpless pawn",
        "11. Qh5": "! The king is suffocating. One Light-Squared bishop move and he is toast",
        "11... Nxg2+": "Ok either this knight is 1.Greedy 2. Fat 3. Selfish. Pawns are getting taken left and right,but hey,that's the price of winning",
        "12. Kd1 Nxf4": "\"Pawns! Pawns! I love pawns!\" the knight said",
        "13. Qh4": "All of the sudden Black is helpless. The king orders a scrambling move to save himself. Boy I want to see what happens when the knight was disobeying the king.",
        "13... Qxg5": "The Queen gives herself away to save the King. This was the only move to prevent mate. Unfortunately for the Black King,it happens sooner than expected...",
        "14. Qxg5 Kxh7 15. Nxc4": "! Why not win another pawn? The white knight was jealous of his counterpart =)",
        "15... dxc4 16. Bxf4": "The Bishop avenges his fellow pawns' deaths.",
        "16... Bxf4 17. Qxf4": "Let's take an assesment of the position. White is up a queen to a knight,bishop and pawn. The bigger advantage to White is that he is better developed than Black. The Queen is in a strong position and the Rooks are ready to pounce on the Black King",
        "17... Nc6 18. Rg1": "An innocent looking enough move right?",
        "18... Bd7": "alas,this is too little too late",
        "19. Kd2": "The rooks can see each other and become more powerful when conncected",
        "19... Rad8": "?? The final mistake. Hard to suggest an alternative. To avoid the next move,Black should have played 19...g6 (19...Rg8?? 20.Qh4#)",
        "20. Rxg7+": "! The icing on the cake. A sac on g7 that ends the game",
        "20... Kxg7 21. Rg1+": "The other rook takes his comrade's place and brings the win home",
        "21... Kh8": "21...Kh7 22.Qh4#",
        "22. Qh6#": "Comments are very welcome. Thanks for viewing the game and my annotation."
    },
    "url": "https://gameknot.com/annotation.pl/blitz-game-dont-go-chasing-pawns-develop?gm=31875",
    "gameName": "Blitz game-Don't go chasing pawns! Develop!",
    "players": "rookie879 (1621) vs. Kingmaster Chess Board (1600)",
    "opening": "Queen's pawn game (A45)"
}