{
    "moves": {
        "1. e4 e5 2. Nf3 d5 3. exd5": "Don´t remember how to play against this one. Is going to be one of those funny chaotic opening games!",
        "3... e4 4. Ne5": "Sorth of an Alejine knight opening here",
        "4... Bd6": "I was thinking of 4...Qxd5; 5.d4",
        "5. d4 Nf6 6. Nc3": "Not just holding the pawn, but trying to activate my own pieces",
        "6... O-O 7. Bc4": "Need to do the castling asap, I think. I was also planning on delaying it and doing it on the queen´s side, but requires too many moves.",
        "7... c5": "Didn´t see this. I thought 7...Nbd7 was a good one, since there is 8...Nb6 if  change is not accepted; and if so, black has a strong attack on the king´s side.",
        "8. O-O": "Knowing that black will activate his rook after cxd, but castling seemed to be a priority here.",
        "8... cxd4 9. Qxd4 Re8 10. f4": "Only one left I think. N in e5 is centered but fixed also.",
        "10... b6": "Threats Bc5 and also wins a time to develop white B in b7. But I don´t feel like Bb7 is as active as guarding c8-h5. But gaining a time anyways.",
        "11. Be3 Bb7 12. Qd2": "I didn´t feel like giving up my pawn, but I thought it was going to be the safest move. Also I found out (After I made the move) that I had a nice attack if Bxd5.",
        "12... Bxe5": "And there we go",
        "13. fxe5 Rxe5 14. Bd4 Re8": "In case of 14...e3; 15.Qe2 gives even better chances to white after Bxf6",
        "15. Bxf6 gxf6 16. Qh6 Nd7": "Best and only one, I think. With the idea of Nf8 or Ne5 and then Ng3",
        "17. Rf4": "Threatening Rg4+",
        "17... Re5": "Didn´t see this one either; as I said, I thought there would be a N movement here, but seems to work 15.Re5",
        "18. Nxe4": "Again, 19.Rg4+ is the threat",
        "18... Qf8": "Good one! I spent most of my time here trying to find a good combination, but to no avail. I didn´t want to end up with one extra pawn only out of this nice position.",
        "19. Rg4+": "But maybe there is not much more to do. Now R is not pressing on f6 and the check seems to be a waste.",
        "19... Kh8": "Queen needs to move and if exchanged, I lose even that pawn I didn´t feel it was enough before! Tables have turned for me now. What to do, what to do?...",
        "20. Qf4": "So I tried to keep the pressure up and thought about moving 21.Ng4 in case of 20...f5, but it was a complicated situation, and did not see it clear.",
        "20... f5 21. Nf6": "But instead did this one. Seems is not as good as the other one",
        "21... fxg4": "The bad one. The great mistake my rival made in this very interesting game (from our amateur level point of view, ofc)",
        "22. Nxd7": "Now R in e5 is lost. 1-0"
    },
    "url": "https://gameknot.com/annotation.pl/blitz-5m?gm=58839",
    "gameName": "Blitz 5m",
    "players": "kenderfender (1853) vs. elja ",
    "opening": "QP counter-gambit (C40), Maroczy gambit"
}