{
    "moves": {
        "1. e4": "Hi all! Coming back from vacation and easing into work with a quick annotation over lunch. Today: lots of mistakes on both sides make for a very bloody Bishop's game. Enjoy!",
        "1... e5 2. Bc4 Nf6 3. d3 c6": "Black is being careful to avoid giving white a strong game with f2-f4.",
        "4. Bg5 d5 5. exd5": "White ensures that the board stays open for his Bishops.",
        "5... cxd5 6. Bb5+ Nc6 7. Nf3": "Having allowed Black to take a strong central presence, White now seeks to tear it down.",
        "7... Bd7 8. Nc3 Qb6": "? Not as strong as it looks. It appears at a glance that Black has guarded against White's threats and safely escaped the pin, but this actually does lose a pawn: 9.Bxf6 gxf6 10.Nxd4! where Black cannot take the Bishop after all: 10...Qxb5?? 11.Nc7+ wins the Queen.",
        "9. Bxf6 gxf6 10. a3": "? This move is meant to give an escape space to the LSB (on a2) and foreshadow a queenside attack, but it really just doesn't get much done. Best was 10.Nxd5, as I mentioned above.",
        "10... d4": "? It looks like this forces the White Bishop off the board and gains space, but it's actually quite weak. 11.Nd5 still forces ...Qd8, leaving Black in a very inactive position.",
        "11. Bxc6": "? Luckily for Black, this is blitz, and both players continue to miss the very strong Nd5 attack.",
        "11... Bxc6 12. Ne4 Qxb2": "Is this pawn poisoned? We'll have to wait to find out, but it doesn't look immediately dangerous, so Black snaps it up.",
        "13. O-O": "Getting out of the way of combos arising after ...Bxe4 and ...Qc3+.",
        "13... Be7 14. Nfd2 Bxa3": "? Loses to a simple tactic.",
        "15. Nc4": "Correct!",
        "15... Qb4 16. Rxa3": "? White spares his opponent. It seems like developing the Rook was a strong choice, but best was the simpler 16.Nxa3. The text overlooks a retaliatory tactic from Black...",
        "16... Bxe4": "! Instantly Black is back in the game. White cannot recapture, for then his other Knight would be undefended. What's worse, Black now has two direct lines to the White King.",
        "17. Rb3 Qc5 18. f3": "Closing the a8-h1 diagonal.",
        "18... Bc6 19. Re1": "White puts pressure on the center, but it's a bit empty: Black's King may run safely to the queenside now, and the e-pawn has a wealth of possible defenders. 19.Nd2 may have been stronger, looking to transfer to the kingside, or else 19.Kh1 with an eye for c2-c3.",
        "19... Rg8 20. Kf2": "?! Bold, but not necessarily wise.",
        "20... O-O-O": "Connecting the Rooks and preparing to barrel down the half-open g-file. ",
        "21. Ra3 Rg6 22. Ra5 Bb5": "?! Voluntarily pinning the Bishop. Things could get ugly if now 23.Na3 a6 24.Qb1.",
        "23. Qa1": "This accomplishes nothing.",
        "23... a6 24. g3 Re8 25. h4": "? Needless pawn-pushing is never a good plan. Better was still Na3.",
        "25... f5": "Preparing ...e5-e4, as well as giving the Rg6 a way to access the queenside if need be.",
        "26. f4": "? This lets Black right in the front door.",
        "26... e4 27. Qa3 e3+ 28. Ke2 Qc6": "Aiming at g2. Meanwhile, White's pieces have gotten bottled up where they can't possibly be of any use to his frightened King. Note that 29.Ne5 is an empty threat, easily stomped by 19...Qg2+ 20.Kd1 Qd2#",
        "29. Qa2 Qg2+ 30. Kd1 e2+": "Another fun line begins with 30...Bxc4 (threatening mate on d2) 31.Qxc4+ Kb8 32.Qb4.",
        "31. Kc1 Qf1": "This is basically a showy way of playing ...Qf2. ;-)",
        "32. Nb6+ Kb8": "? There was no reason not to take with the Rook; I just missed it (we were both rather low on time here; < 1 minute each).",
        "33. Nd7+ Bxd7 34. Kd2": "The only move.",
        "34... Rxg3": "White must now lose a Rook, or else the game. He has his choice of ways to do so: Kc1 and Rxe2 both work. But either solution must be short-lived, as he'll be down a terrific amount of material and cannot hope to come back.",
        "35. Qxf7": "Not good enough. Now Black has his choice of rather pretty finishing moves. There are at least two options.",
        "35... Qxf4#": "Black grabs the quicker one. Also possible was 36...Qxe1+ 37.Kxe1 Rg1+ [A] 38.Kd2 Rd1# [B] 38.Kf2 ...e1=Q+ 39.Kf3 Qg3#.\n\nThanks to yellowbud for a fun, hard-fought game. Not nearly perfect on either side, but that's the kind of perilous, attacking play that blitz is made of :-) Thanks to everyone for reading!"
    },
    "url": "https://gameknot.com/annotation.pl/blitz-errors-abound?gm=48198",
    "gameName": "Blitz: Errors abound!",
    "players": "yellowbud  vs. bwaa ",
    "opening": "Bishop's opening (C24), Berlin defence"
}