{
    "moves": {
        "1. d4 Nf6 2. c4 g6 3. Nc3 Bg7 4. e4 d6": "So we are aiming for a Indian defence.",
        "5. Bd3 O-O 6. Nge2": "Trying not to block f3 point. I have seen positions like the one we are playing that wither advance there with f4, or block moving f2-f3 and then focus on the queen side. I am more prone to attack the king, but this time, I will go for a slower approach.",
        "6... e5 7. d5 a5": "Didn´t think of this, was kind of a surprise, but it hampers somehow my idea to advance on the queen side. But it also seems to me that creates a weakness (that I did not exploit properly)",
        "8. O-O Nbd7 9. f3": "As I said, with this I prevent a potential ...Ng4 (threatening my bishop in e3 if moved there) and then...f5",
        "9... Nc5 10. Be3": "Did not think much of my BB in d3, since it doesn´t seem to help defending nor attacking the black king, although it does support my advance on the left flank. Maybe I should have saved it, but thought I needed to gain some moves in order to make progress. Be3 seems good enough. It does even support a more flexible attack on either side of the board.",
        "10... Nxd3 11. Qxd3 b6": "With the idea of c5 maybe? I thought so, and didn´t like it, but I did not considered that after ...c5: dxc, d column is open and e6 is a weak point to attack. Shame on me (I just saw that, during this analysis)",
        "12. a3": "To support \"b4\" and then \"c5\" advances.",
        "12... a4": "Interesting. But it may again create a weak pawn difficult to defend.",
        "13. Rfb1": "Maybe 13.Nb5 was more effective, with the idea of 14.Nec3 and Qc2, attacking a4",
        "13... Bd7 14. b4 axb3 e.p. 15. Rxb3 Nh5": "Starting the grand opening characteristic of this Indian variant.",
        "16. Nb5": "After playing this, I realized it doesn´t do much; it does defend a3 and opens the 3 line for the rook in case it needs to join the defence, but nothing else.",
        "16... f5": "Continuing with the good plan. Black now has two approaches: fxe (the game) or f4 and then moving the rest of g and h pawns to attack the king. It is a solid attack.",
        "17. Rc1": "I wanted to remove my rook from a1 since there was a future capture with the bishop in g7 (way ahead, I know, but I wanted to prevent it), and supporting a putative sacrifice (that at this point I did not see clear at all). But I should have stuck to a different plan: if not interested in defence, at least let´s create some trouble, advancing through \"a\" column. Or  else joined the defence on f1.",
        "17... fxe4 18. fxe4 g5": "Trying to support N in f4. Had the white not removed the rook from a1, now a direct Nf4 would have been possible. At this time, I felt sort of at a crossroads: either defend my king, and I had the feeling it was sort of late (I should have started a few moves back) or committing my pieces to attack the left flank. And I saw what I thought it was an interesting sacrifice. It took me more than a minute to make up my mind, but after movement 19, I replied with two quick movements trying to put some pressure on black.",
        "19. Nxc7": "And there we go. Now that I have finished the game, I´d give this a\"?\" or maybe a \"?!\", since there is an important thing: c8 is a white square, controlled by BB, and therefore, difficult to be a place where my pawn can become something bigger. But it is still interesting. Now is a brutal race, and black makes the exact (from my point of view) movements needed to beat white.",
        "19... Qxc7 20. Bxb6 Qc8": "Seems unique (or as good as) to me, allowing the advance on c.",
        "21. c5 Nf4": "Not only bringing the N to the attack, but also forces WN to be traded, and therefore the support it was giving to R in c1 is gone.",
        "22. Nxf4 exf4": "I was expecting gxf, and then black has a column opened on W castling. But this seems to be good as well, allowing BB in g7 to help with the attack.",
        "23. c6": "Had I have my Ne2, I would have thought of cxd, but now, this seems to be my only possibility to make progress. I had a good feeling though, since BB in d7 starts loosing squares, but that is only a mirage.",
        "23... Bg4": "I might have even helped my opponent with his attack. Now, not sure what to do. I was thinking on Qf1 (allowing R in b3 to defend f3) but thought that that would be a hanging man (woman) considering the threat of R in f8.",
        "24. Qb5": "So I aimed for the idea of supporting a4 advance, considering my only possibility of victory. I miscalculated the threats black has, even when I knew f3 advance would create havoc on my files. I even foresaw Qg4+ and though I could cover with WB in g3 on time, but , again, another threat comes into play: Bd4+. All this is a little ahead of us, but I wanted to show how many problems white is facing now.",
        "24... f3 25. gxf3": "A must I think (I thought). I may be wrong, but g3 leads to mate, and waiting for fxg2 cannot be much more helpful.",
        "25... Bxf3 26. Bf2": "This is what I was talking about.",
        "26... Qg4+": "And then I saw the mentioned 27...Bd4+. So I had to displace my king. At this point, I already had the feeling I had lost, either slowly (...Qg2+ or and Bxe4, etc) ) or faster, as it did happen in the game.",
        "27. Kf1 Bg2+ 28. Ke1 Rxf2": "Nice ending! The faster approach",
        "29. Rg3": "Trying to add some confusion...",
        "29... Qxe4+": "But black doesn´t fall for it (I am talking about making a wrong move, like \" a clear mate\" Qe2+??)",
        "30. Kxf2 Bd4+": "Game over. Very nice game, I enjoyed it a lot!"
    },
    "url": "https://gameknot.com/annotation.pl/blitz5m-indian?gm=59060",
    "gameName": "blitz5m  indian",
    "players": "kenderfender (1867) vs. pi1942 (1886)",
    "opening": "King's Indian (E70), Kramer system"
}