{
    "moves": {
        "1. e4 d6 2. Qh5 Nf6 3. Qxf7+ Kxf7 4. Nc3 e5": "while a normal central control move in a \"normal\"game is \na good move,it is actually a weaker move in theory for this specific game based upon blacks forced Kings position on his second rank.Black needed to retreat back to his first rank and/or move his f8 Bishop out,move his Rook & King to reposition for artificial castling for better King safety.An almost 2000 rated player should understand that losing some tempo is not a big deal as long as he is \"up\" my Q booty.But this was overlooked by my opponent.Even my move # 5.Nf3 should have induced a prewarning that I can shuttle right up to g5 to check his King along with my wide open diagonal white Bishop on f1 that can advance to check his King on c4.",
        "5. Nf3 Nc6": "has a zero effect in development and/or defense of blacks King. \n5...Nc6 only allows me to check blacks King with my white Bishop as just mentioned. \nI suppose blacks plan may have been to move Nd4,whereas my exchange capture with my Knight on f3,then blacks recapture with his e5 pawn would have placed pressure on my c3 Knight....OR if I did not capture,his plan may have been to capture my Knight on f3,thereby doubling my pawns on the f file with my recapture of blacks Knight,along with leaving an open g file which could conceivably expose my King to attack if I castle OR allow black to attack my King with his h8 Rook in a few moves. ",
        "6. Bc4+": "is the foundation of whittling my opponent piece lead down IF he falls into the trap....and he will as you will soon see. The next few moves by black from move ",
        "6... Be6": "and beyond is what I deem as a psychological classic defensive response which seems to be programmed into many players minds. 6....Be6 does protect blacks King by blocking his King check by my Bishop on c4,and under \"normal \npositional circumstances\"this would be a fine move.However,my opponent forgets that his King is already in a precarious spot....that f7 square which as I have explained in my past club,is the weakest square on the chessboard for black.In addition,if I were to capture blacks Bishop on e6(Bxe6),black must them recapture with his King,which would place his King on the 6th rank,making his Kings position even more precarious.  Then my classic trap with my f3 Knight with  \n",
        "7. Ng5+": "that creates a surprise King attack:  This will now regain 3 point values as I respond with  \n",
        "7... Kg6 8. Nxe6": "with an added bonus of threatening a black Q capture.The point all being that overconfidence in having my white Q as booty quite often creates a premature offensive posturing by my opponent while he overlooks many of the open diagonals and momentarily forgets that the probability of his King being attacked(especially on an f7 square)has increased in probability.Thus,playing defensively(like his move 6...Be6)has a reverse effect if it is defending his King on an already weak square(f7) because it permits white,more than not,to apply an effective offense to an f7 square in which black should have removed his King away from f7 right in the opening of the game.",
        "8... Qd7 9. f4 Re8 10. f5+ Kh5 11. Be2+ Kh6 12. d4+ g5 13. Bxg5#": "From move # 7 to the end,you can easily witness black NEGATIVELY tripling his King safety.  So lets take a quick snapshot analysis of the above diagram.What do you see? \nWhere does Black King rest in only 13 moves?How,why?Totally unnecessary and never forced to have Blacks King resting on square h6,which is at a horrible position resting in front of his h7 pawn and what should have been an artificial castled position or a King retreat back to his first rank.Also notice that blacks Rook on h8 never moved and is basically useless.Take additional notes to blacks hemmed in Bishop on f8 compared to my fully open Bishop pair.And finally take note that white had the capability of castling both K side and Q side to expand whites Rook(s) for additional offensive play against blacks King or many of his other pieces.All of this in only 13 moves?????Think about it. \n\nSure it is only a blitz game,but trust me,if I look deep enough into this opponents past game record,I will find similar moves that slightly mirror a game like this quick 5 minute game with exchanges that are not well thought out,non existent castling or non existent artificial castling that SHOULD have occurred,but did not,and/or Rooks that should have been moved earlier and were not and hemmed in Bishops(which is a bad trend with many 1900+players) and should have been developed with better pawn chain advancements.So blitz DOES tell a story sometimes(and many times)how an opponent will react in a long corresp game. \n\nThis was a game of psychology.I knew from massive experience that many players WILL place that Bishop in front of their King in blitz expecting me to capture it.And in theory,even exchanges when up my Q booty(or just 3 to 5 piece points),is normally par for the course with moves like...(BxB). \nBut the risks outweigh the theory in games like mine.Why?Because that \"theory\"is fine if you look around FIRST,BEFORE trying to exchange and see where your King is located and/or where it will be positioned IF I do \"exchange\" Bishops!So following normal channels of even exchange theory when up 5 points or more has flaws in it if you King is not properly placed in a good defensive spot first.And of course,this game proves much of that. "
    },
    "url": "https://gameknot.com/annotation.pl/blitz-q-sac?gm=63983",
    "gameName": "Blitz Q Sac",
    "players": "deeper_insight (2343) vs. cvttracy (1964)",
    "opening": "Pirc defence (B07)"
}