{
    "moves": {
        "1. e4": "Kramnik once said only a fool annotates Blitz games... I guess I'm a fool! But I do learn from them. I suppose the really strong players don't learn much from them, hence his comments.",
        "1... c6": "Kramnik is right about one thing: unless your mind is like a computer, analyzing long variations in Blitz is useless in the sense that blitz is inherently inaccurate to begin with, and thinking time during play limited. But I privately bet that Kramnik has analyzed at least some of his own Blitz games he's lost, just to see where he went wrong - provided it wasn't immediately apparent. It's so much fun to watch those great players play!",
        "2. d4 d5": "Caro-Kann. Which is what I usually play as black as I do here.",
        "3. Nc3 dxe4": "I always take if white doesn't advance the pawn. It makes for a boring game often enough, but as black, boring is easier to equalize... isn't it? ;)",
        "4. Nxe4 Bf5": "All book so far...",
        "5. Bd3": "This move is one I hadn't seen before, for whatever reason; normally I see Ng3 in this position.",
        "5... e6 6. Nf3 Nf6": "Fritz thinks this is the best move... I made it. Later, I didn't like it.",
        "7. Nxf6+ Qxf6": "I don't like this position. I don't like my queen being out so early, even though it appears to be perfectly safe. it just seems awkwardly placed.",
        "8. O-O Bg4 9. Be2 Qd8": "Fritz says that this is a mistake, but do I really want my queen out without my other pieces leading the way? No. No. No! I don't. Did I say no enough times??",
        "10. c4": "White has a dominating center right now, and there will be good pressure on the queenside in a moment.",
        "10... Be7 11. Qb3 Qb6": "I think black is pretty solid here; but white has more space and is putting pressure on black in a couple ways. So here I am acknowledging this by offering a queen trade with the disruption of my queenside pawns as a result in order to alleviate that pressure which I don't like. c5 is not likely because of the weak pawn it would create on d4, but I still don't like the queenside.",
        "12. h3 Bh5 13. Bf4": "Trading for black's knight is not white's main intent here; I believe it is simply white completing his development. His other choice was Be3. It may be that ...g5 could induce white to take the knight. But disrupting my kingside pawns in this fashion seemed dubious when the only compensation would be white losing the bishop pair.",
        "13... Qxb3": "This is actually a bit of a mistake on my part now; but I was really worried about all of white's pieces pointing at the queenside. Nevertheless, it gives white opportunities on the half-open a file that could be really useful  for white.",
        "14. axb3 Nd7": "With a large lead in development, white begins attacking.",
        "15. Ra5": "With tempo, even. My bishop is hanging... rather easy to see isn't it. With Rfa1, after moving the bishop, I'm not sure what progress white will make on the queenside, but I don't like it. During the game, I was fixated so much on that queenside that guess what...",
        "15... b6": "...I neglect to notice my hanging bishop. I am moving very quickly, and am too focused on that queenside! I played in my first tournament of over-the-board chess for 'National Chess day', and ended up playing someone who had a fide rating close to 2200... the tournament wasn't fide official, but his rating was and he is very well known in my area. Anyways, well into a complicated midgame I had at least a draw with winning chances had I seen a certain bishop move, but in that game too I got too focused on one part of the board. This is something I'll work on. I believe it's why many at that level get up from the board and walk around; they're not all thinking on combinations I'd bet. I'd bet they're doing it to clear their mind and when they sit back down, they see the board how it is since they have to notice the move that was made. Oh, I may annotate that game here; I think it would be fun for some of you to analyze!",
        "16. Rxh5": "So there you have it; a colossal blunder on my part to a good opponent. Most would resign here I imagine, but the game is yet young; I decide to play on... besides...",
        "16... c5 17. dxc5 Nxc5": "...that one rook is now cut off from the queenside and white never gets anything going over on the queenside the rest of the game. Interestingly enough, black's position is rather solid despite being a piece down. Notice I took on c5 with the knight and not the bishop, inviting the next few moves.",
        "18. b4": "I had hopefully anticipated all of these upcoming moves, because I wanted to create a weakness on b4. I get my wish. It's interesting that white chose to worry about that one pawn, instead of immediately pushing hard since he was a piece up. But because he did worry about that pawn, it enabled me to reposition my pieces advantageously, because his pieces are not yet working together well.",
        "18... Na4 19. b3 Nc3 20. Be5": "My opponent returns the favor of a 'colossal blunder'. He must not have noticed I would take the bishop with tempo, and had his own tunnel vision going on. Perhaps he was willing to win the two pawns for the bishop. Perhaps he was thinking I'd naturally castle here.",
        "20... Nxe2+": "But taking with tempo saves my kingside pawns, and from this point, white never recovers.",
        "21. Kh1 f6 22. Bb2": "Fortuitous how things sometimes work out. I had not planned this position out; white should not have allowed it.",
        "22... Bxb4": "Fritz thinks 22. Re1 would have been much better for white. 22 ...Nf4 would have been more accurate for black. Instead, these two moves are what we do. I grab the pawn, intending Nc3 at some point soon.",
        "23. Rh4 Rd8 24. Re4 Nc3": "Nc3 it is then. Now Fritz thinks white should take the knight, but white likes that diagonal too much to part with it.",
        "25. Rxe6+ Kf7 26. Rfe1": "I could force some rook trades, but wouldn't that be rather boring. White could try to see if I'd accept a draw here, but instead...",
        "26... Rd7 27. Re1e3": "... he tries to make something of his seemingly superior position. But he goes about it the wrong way! 27. Re3??",
        "27... Nd1": "...Nd1! Well no exclamation, but the ?? on white's move belongs; it is a losing move that white could resign with so few pieces left on the board.",
        "28. Re3e2": "Wanting to keep the rook rather than just take the loss on the exchange, white worsens the situation because...",
        "28... Nxb2": "...the knight is immune. Black has an insurmountable advantage now, err.. umm... providing I don't blunder again. I don't. ;)",
        "29. Re6e4 Nd3 30. Nd4 a5": "Solidifying the black position. I am conscious that my opponent has had a lot of success in rated games. So before pushing forward, I decide first to limit any counterplay, as much as I could anyways.",
        "31. Nf3 Bc5 32. Kh2": "White would have had to deal with Nxf2 had the king stayed on h1. Kg1 may have been better here, despite subjecting the pawn to a pin, if nothing else but to safeguard that pawn.",
        "32... Bxf2": "A pawn's a pawn. Since this one was left for the grabbing, why not. I'm sure I had better here, and Fritz indicates that to be the case. But, as Kramnik alludes too, Blitz is inherently inaccurate.",
        "33. Rc2 Bc5 34. Ree2": "It would appear white is trying to position for defense and hoping to find tactical possibilities too, but rather out of the midgame and a piece down, it's very difficult for white.",
        "34... Nb4 35. Rc1 Rhd8 36. Rb1 Bd6+": "This is an attempt to get the king on the back row and my bishop to g3. Rather transparent, white prevents that... but...",
        "37. g3": "...now the white king is more exposed. Either way, I am happy with how that turned out; whether I can take advantage of it or not, white's king will have to be careful with so many pieces still on the board.",
        "37... Bc5": "I get the bishop back out of the way for the time being. My knight is not in a rush to get to a more useful square just yet. I'd like to get rid of one of the white rooks.",
        "38. Rf1": "Threatening Ne5+, winning the exchange. Sometimes in Blitz things like that are not so easy to spot... but this time I prevent the fork.",
        "38... Rd7d1": "All I need to do as black to win is simply trade pieces; a basic premise when one is ahead especially against a good opponent.",
        "39. Ng5+": "White checks me anyways, but without a fork on the rook. hence Ng5 instead of Ne5.",
        "39... Kg6": "And because of my rook on the first rank, and white's knight enprise as well, I get another wish: simplifying further.",
        "40. Rxd1 Rxd1 41. Ne4": "I wouldn't mind parting with the bishop, but not just yet! Here's why, obviously enough to most of you: it would be at the expense of my queenside pawn structure AND the bishop is still useful for limiting the white knight, until I reposition a few things. So I decline to trade it here.",
        "41... Be7 42. Nf2 Rd7": "That was forced.",
        "43. Rb2": "For the last several moves, white has been struggling to find meaningful counterplay. With my extra piece, I have been able to thwart his efforts. I've been careful; remember, he's played a lot of rated games with a lot of success. So I carefully maneuver until my king can join more in the action. I mean, things on the queenside are static; so I have to get my king into the game, so nothing is ceded.",
        "43... Bc5 44. Ne4 Be7 45. Nf2 Kf7": "I am now willing to trade that dark-squared bishop for the knight.",
        "46. h4 Nd3 47. Rd2 Nc5": "I wanted my knight here, and thought white would move his rook back to b2. But to my surprise, he traded while down a piece. This is not advisable, even though Fritz would have done the same thing.",
        "48. Rxd7": "But white decides this helps him. I don't think so, because now the 'percentage' I'm ahead has gone up, even if the point difference remains the same.",
        "48... Nxd7 49. Nd3 Bd6": "Limiting the knight again. From here, it's academic. If you're really bored you can watch this to the end, but there's nothing really interesting to see, except for two things, an inaccuracy by me on move 59, and my choice of strategies to complete the win. Otherwise the play is rather :ahem: ...boring. But, thanks for checking this out, to whatever degree! ;)",
        "50. Kh3 Ke6": "My plan is to lock up the kingside, force concessions/material advantages on the queenside with my extra pieces, advance my king in the center and force white to defend both flanks until his position is so untenable that even he resigns. It's a pretty easy plan at this point. There may be other strategies to winning this endgame, but just looking at the board, this is what seems good to me.",
        "51. Kg2 g5 52. hxg5 fxg5": "This sequence of pawn trades was not recommended by Fritz. But it's part of my plan, and will make winning more simple. I believe white now has zero drawing chances. I like simple, when one will retain one's winning chances.",
        "53. Nc1 Nc5 54. Kf3 h5": "Now with the white knight on the back rank, it is time to push forward.",
        "55. Kf2 Ke5 56. Kf3 g4+": "Kingside locked up, until I unlock it...",
        "57. Ke3 Be7": "Now I force concessions on the queenside. There is no saving the b3 pawn. Perhaps white could have tried Ne2, Nf4, and Ng6, but it's far too slow, and white couldn't retreat quickly enough to defend.",
        "58. Ne2 Nxb3": "Here I make an inaccuracy. Another lesson for me: just because I have a good plan, it's a good idea to see if there's something better. Better was 58. ...Bg5+!, cutting off the white king from the queenside unless white wastes extra tempos to get back over there. After ...Bg5+, I could then pick off the pawn and white's king would be positioned really poorly.",
        "59. Kd3 h4": "Time to make reality the threats that white can't possibly cover.",
        "60. gxh4 Bxh4 61. Ke3 a4 62. Nc3 a3 63. Na2 Nd4 64. Nb4 g3": "And now both of these threats cannot be stopped.",
        "65. Nd3+": "Black now has a forced mate. But it's a ways out. Fritz says it will happen in 21 moves. I think a little sooner.",
        "65... Kf5 66. Nb4": "I'm no longer really pondering things; the game is over. As an aside, the black knight was immune again due to 66. KxN  followed by either ...a2 or ...g2.",
        "66... g2 67. Kxd4": "White realizes he has nothing better, so grabs the knight.",
        "67... g1=Q+": "Mate in 9, and this seems about right to me.",
        "68. Kc3": "From here, I admit to not looking for that quickest way to mate. White plays just a little longer.",
        "68... Be1+": "A queen check was Fritz's choice here, but it hardly matters.",
        "69. Kb3 Qe3+ 70. Ka4 Bxb4": "And white finally resigns, as his obvious hopes I'd blunder something away to a knight fork is no longer a possibility. I don't blame him for not resigning sooner, considering the terrible blunder of mine on move 15. Laters, everyone. ;)"
    },
    "url": "https://gameknot.com/annotation.pl/blitz-and-blunder?gm=52417",
    "gameName": "Blitz and blunder",
    "players": "anonymous (2150ish) vs. Pierre99 (1200)",
    "opening": "Caro-Kann (B18), classical variation"
}