{
    "moves": {
        "1. e4": "Like me, he starts with the King's Pawn Opening.",
        "1... e5": "I'm used to seeing this, but likewise, I'm used to this becoming the KG.  In fact, what made me interested in playing that unusual was the first one I studied from the same person.  So, it's of no surprise that he plays, and similarly, black accepts the gambit.",
        "2. f4 exf4 3. Bc4": "More common is 3.Nf3 as that's the mainline.  But, similar to what Ken emphasized, Joe will deviate from the mainlines, in part, to make his opponent feel that he has gotten advantage.  It often leads to letting your guard down and making mistakes that would cost you the game, as it did here.",
        "3... Qh4+": "This is what reversion played against me, when I, similarly, didn't play 3.Nf3.  That check lost fairly quickly, but right now, the position here is about equal, and black is the one that needs to be careful, as we're about to see.  Another problem here is that despite this check, black's Q is out early since none of his pieces are developed.  This will put him at a disadvantage, later on.",
        "4. Kf1 Bc5": "Similar to Joe, he starts developing.  But, with the Queen in a bad spot, Joe will harass kavayah1's pieces while developing which will enable him to develop further, leaving black way behind in that and center control.  So, we're already starting to see a noticeable space advantage from Joe.",
        "5. d4 Bb6 6. Nf3 Qg4 7. Bxf7+": "This is a nasty check that starts giving Joe a winning advantage as other's pointed out.  In part, it's because of black's inability to castle, which is worse then white inability to do so, as the monarch will be exposed here.  Also worth noting that black cannot take back, as Joe said.  As that would lose the Queen immediately, with the tactical motif, 8.Ne5+ since it forks in a nasty way.  So, even with best play, white is winning.",
        "7... Kf8 8. h3": "With that being said, Joe continues to harass black's Queen, which will allow him even further development.",
        "8... Qg3 9. Nc3 Kxf7": "?! Now, black take advantage to grab the piece.  In my opinion, this is another inaccuracy because at the very least, Joe will continue harassing the Queen, which would, at the very least allow him to complete his development.  Whereas, black only remains with one piece developed, leaving him with no center control.  Plus, his monarch is in rough shape where it remains exposed.",
        "10. Ne2 Nf6": "?? It's possible that this was lost, but I view as the official losing blunder from black.  My guess is that he wanted to continue with his development rather then waste it moving the Queen back.  But, that was the least of his problems, since this loses the Queen for a piece.",
        "11. Nxg3 fxg3 12. Qd3": "Which enables Joe to use his Queen as an attacking force.",
        "12... d6": "Trying to prevent Joe's next move because of what happens then.  But, it's too little too late, since something similar will happen a move later.",
        "13. e5 Nh5": "Rather then losing the N right away through an exchange, he retreats.  But, Joe has some nasty surprises for him.  ",
        "14. Qc4+ Be6": "?? Trying to harass white's Queen.  Although black was lost, this is the move that loses right away.  I'm not sure what the best move was, but Joe said that this was the biggest blunder of the entire game.  If black doesn't make any blunder, so with best, it's a mate in 9 for him because of this move.  That's based on what Komodo said.",
        "15. Ng5+ Kf8": "?? Better was 15...Kg6 as there's still a small way to go.  But, by playing this, on top of getting another piece, Joe forces an immediate mate in two.",
        "16. Qxe6 Rg8 17. Nxh7#": "I find this game to be very instructive for novices.  It comes to show the importance of some of the guidelines.  Mainly, developing your pieces, controlling the center, and getting the monarch to safety.  Black failed to do all of this by bringing his Queen out before developing, which enabled Joe to constantly harass, and later, win the Queen.  From there, it was all going downhill, until mate was forced since TA was able to use that time to build attacking forces against black's monarch with his pieces.  That became overwhelming, and eventually, led to this mate."
    },
    "url": "https://gameknot.com/annotation.pl/blitz-chess-game?gm=61908",
    "gameName": "Blitz Chess Game",
    "players": "tactical-abyss (2376) vs. kavayah1 (1564)",
    "opening": "KGA (C33), bishop's gambit, Greco variation"
}