{
    "moves": {
        "1. b3": "Hi all! Just a quick blitz from last month in an opening that doesn't get enough attention, in my opinion. This is Larsen's Opening. Enjoy!",
        "1... d5": "1...e5 is a more modern approach, but this is the classical variation. This can become a sort of reversed Indian defense with Nf3.",
        "2. Bb2 Nc6": "I think 2...Nf6 is probably better, but this is fine. I just prefer to maintain the option of playing ...c5 at some point in the near future.",
        "3. Nf3": "The points of contention are, of course, those that White's Bishop overlooks--d4 and e5.",
        "3... e6": "...e7-e5 is too difficult to play for now, so Black settles for a more passive pose and will attempt a break in the midgame.",
        "4. e3 Nf6 5. Nc3": "Now that the White Bishop is no longer pinning the g7 pawn, it's all right to close it off temporarily for the sake of development.",
        "5... Be7": "5...Bd6 was better. This Bishop threatens nothing from e7, nor are there any threats for it to defend against. If a piece, placed in a certain spot, will have to be relocated before it can be of any use, it should not be placed in that spot in the first place!",
        "6. Bb5": "The best place for White's LSB. Be2 would be too passive (like Black's ...Be7), and Bd3 blocks an important pawn.",
        "6... a6": "Asking the question, to which there is only one good answer. I think maybe ...Bd7 should have been played first to avoid disrupting Black's queenside pawns so much, but then again this will allow ...Bb7 and give Black a central cluster that might be put to good use.",
        "7. Bxc6+ bxc6 8. O-O Bb7": "With the doubled c-pawns and this Bishop move, Black is prepared to switch plans entirely. He no longer has a real need to play ...e5; he can push c5 instead.",
        "9. a4": "? I cannot think of a reason for playing this move. Surely 9.Ne5 was better.",
        "9... c5 10. Ne5": "?! Played now, this move allows Black to play 10...d4 11.exd4 cxd4 and White must retreat his Nc3 to a suboptimal spot, probably e2. Then it's up to Black to prove that he can hang on to the advanced pawn and make use of his extra space, but his position looks pretty strong.",
        "10... Bd6 11. f4": "This pawn move is of course the reasoning behind White's previous move. It strengthens his Bishop's diagonal and may open the f-file against Black's uncastled King.",
        "11... Nd7": "Black doubles up on the e5 square, as well as freeing f6 for a possible supporting pawn. If White retreats his Knight to f3, 12...e5 is inevitable, and a firestorm begins. (13.fxe5 Nxe5 14.Nxe5 Bxe5 15.Qh5!? Bf6 with a pin on the Nc3 and control of d4 for Black and huge kingside pressure for White.)",
        "12. Qh5": "? This is an outright mistake; I missed the obvious reply. 12.Ne2 was probably better, using the Bishop to defend the Knight rather than the easily-harassed Queen.",
        "12... g6": "Of course.",
        "13. Nxg6": "! Making the best of the situation, getting a pawn for the Knight and busting up Black's castle. Now White just has to prove he can do something with it.",
        "13... fxg6 14. Qh3": "Poisonous. If Black advances the e-pawn, he opens the f-file for White's artillery. On the other hand, defending the pawn with 14...Qe7 loses material: 15.Nxd5! exd5 16.Bxh8. Black can hold with 14...Qf6 or 14...Nf8, but neither of those are very enticing options.",
        "14... Nf6": "?! Right idea, I think (not defending e6), but I kind of liked the Knight on d7. On f6 it may prove a vulnerability, especially with a Rook on h8. I liked 14...d4! here, with advantageous lines for Black arising after 15.Qxe6+ Qe7 16.Qxe7+ Bxe7 17.Ne2.",
        "15. Qxe6+ Qe7": "The reason I liked 14...d4 was that it forces White to make this exchange when it comes around. Now, White is able to happily retreat his Queen, where she can continue to make threats.",
        "16. Qh3 Bc8 17. Qf3 Bg4": "..or be threatened, I suppose. This was a well-executed re-positioning of the Bishop by Black, but I don't think it needed to be done. The Bishop was strong on b7.",
        "18. Qg3 Bf5": "Aiming at the weak c-pawn as well as supporting e4 for a Knight. Unfortunately, I think this move is just too wasteful, as the threats are unimportant and it doesn't prevent White from carrying out his own plans. Black had a number of interesting options here, among them ...d4, ...O-O-O and ...g5, but the text is not good enough to prevent the combination that comes next.",
        "19. Nxd5": "! White removes the threat of ...d4 once and for all, threatens now to win the Nf6 with check, activates the Bishop with a mighty pin, and boots the BQ all at once!",
        "19... Ne4": "! This is the best response, I think. Black is still losing material, but now he can do so on his terms, and besides--it's blitz and this is the showy, aggressive move. In the heat of the game, who knows which player has calculated correctly?",
        "20. Qe1": "White avoids the outright Queen trade, because his Knight has an intermezzo available and he doesn't want to have to trade away his strong Bishop for the Black Rook, which he of course would after 20.Nxe7 Nxg3 21.hxg3 Kxe7 22.Bxh8 Rxh8.",
        "20... Qe6 21. Nxc7+": "There is only one response to the fork, and White has accomplished his goal: trading the Knight for the Rook, instead of the Bishop that actually makes the capture.",
        "21... Bxc7 22. Bxh8 Kf7 23. Be5": "Now ahead in material but lacking badly in activity, White needs to open lines so he offers a trade, and a pawn as a poisoned incentive...",
        "23... Bxe5 24. fxe5": "Now Black should play his King off the open f-file, probably g7 is best, and then follow up by constricting White's available options until he can perhaps win material back or force a draw.",
        "24... Qxe5": "?? But this is Blitz chess, and if there's one place nasty traps thrive more than anywhere else, it's here. Black takes the bait pawn, and now all White must do is close the trap.",
        "25. g4": "1-0. After the exchange, Black will have a Knight for a Rook and two pawns, and huge positional weaknesses to boot, so he understandably resigns. Many thanks to tony111 for a very fun game, and thanks to all of you for reading. Comments are appreciated!"
    },
    "url": "https://gameknot.com/annotation.pl/blitz-midgame-tactics?gm=48417",
    "gameName": "Blitz: Midgame Tactics",
    "players": "bwaa  vs. tony111 ",
    "opening": "Nimzovich-Larsen attack (A01), classical variation"
}