{
    "moves": {
        "1. c4": "Hi everyone!\n\nOperation Joblock snares another Master!  This time it is my mentor, David Patron who had a rating just 40 points south of being an IM.  David is a very strong player and he certainly deserves to get to that level.  Again, neither player did anything wrong except the fact that gameknot analysis did not like my last move and preferred h5 to Kg8.  So, I achieve my fourth Master Draw!  But how did this block out occur?  Well, we must all read on......",
        "1... e5": "1. ...... e5 - David tries me out with the English Opening by opening with 1. c4.  This opening can transpose into many other openings such as the Reti, etc.",
        "2. Nc3 Nf6 3. Nf3": "3. Nf3 - it does become a bit Reti-ish!",
        "3... Nc6": "3. ..... Nc6 - now all four knights are developed.",
        "4. e3 Bb4 5. Qc2 h6": "5. ..... h6 - the Wicked Witch of the West has plonked herself on a diagonal which could be a potential menace to Henry if he goes kingside.  I decided to play this move to prevent Ng4 and to avoid that pawn becoming a target itself.",
        "6. Be2 Bxc3 7. bxc3": "7. bxc3 - Hmm, Qxc3 would have avoided doubling up his c pawns.  This doubleton will aid my bid to seal David out later on.",
        "7... d6 8. O-O O-O": "8. ...... 0-0 - I thought I would wait until David castled before putting Henry on the same side.  David is not so likely to risk compromising his own castled position to attack mine with a pawn storm.",
        "9. d4 e4": "9. ..... e4 - an interesting conversation took place between me and David in the chat: Jo: Thanks.  Now, I really ought to block off that annoying b1-h7 diagonal and put a bit of a cramp in your position - at least for a while!  David: That's a good move Jo and the one I would have played for the reasons you have set out.  It irks me to have to withdraw my knight - for now at least.",
        "10. Nd2 Re8": "10. ..... Re8 - the conversation now continued: ..... hmm, but that pesky steed has counter-attacked my pawn.  I did agonise over which piece was the right one to defend it but I think it is good to at least put a rook on a half-open file.  I just hope I made the right choice here.  David said: I think Bf5 was very marginally the better move to support the battle for control of the centre.  But your choice was perfectly OK.  ",
        "11. h3": "11. h3 - this move gives me the chance to play Bf5.  My weakie e4 pawn is now protected three times.",
        "11... Bf5 12. Rb1": "12. Rb1 - Dave then said in the chat that he wanted to probe my defences.  After a long consideration I decided the best way to meet this move was to advance my pawn to b6.",
        "12... b6 13. Rd1 Qc8": "13. ...... Qc8 - prepares the remote possibility of a bishop sac on h3.  This doesn't happen, however.",
        "14. Nf1 Na5": "14. ..... Na5 - although it puts my knight on the rim, my knight handily stops David's a pawn from getting any further than a4.",
        "15. Ng3 Bg6": "15. .... Bg6 - preserving Fou Leblanc and keeping him on the same diagonal as the Witch.",
        "16. Bb2 c5": "16. ....... c5 - a multi-purpose move.  This move firmly seals off the queenside.  If dxc5 then dxc5 and I will have tidied up my backward pawn on the d column.",
        "17. Ba3 Qc7": "17. ...... Qc7 - Glenda acts as a foil to all the queenside pawns.  She also connects the rooks.",
        "18. Qa4 Rad8": "18. ....... Rad8 - after Dave tries to frighten me with an incursion into my pos. by the Witch, I calmly move my rook onto the d column.",
        "19. Rd2 Kh8": "19. .... Kh8 - Dave said that all he could do was try and improve his position but he did not think he would get anywhere unless I over-extended myself.  Me shuttling Henry from h8 - g8 proved I had no intention of doing this.  After playing his rook to b5 Dave told me he would settle for a draw.  I put Henry back on g8 and made my offer of which Dave kindly accepted.  Interestingly enough, Gameknot analysis stated that my last move was an inaccuracy.  So it turned out to be a very good draw offer in more ways than one.  For me it has been the tale of two buses.  After my epic draw with Freddy in 2010 I had to wait another three years for my third Draw, which was against Skorpio, now along comes the second bus - all in the space of two weeks.  In order to increase my tally of such scalps, I need to be a little more consistent.  Anyhow, David played very well and it was a good instructive game on how to defend properly.  I hope you all have a good read.  Bye for now - Joanne",
        "20. Rb5 Kg8": ""
    },
    "url": "https://gameknot.com/annotation.pl/block-out?gm=52732",
    "gameName": "BLOCK OUT!!!",
    "players": "drhpatron (2360) vs. jstevens1 (1825)",
    "opening": "English (A22), Bellon gambit"
}