{
    "moves": {
        "1. e4": "My first finished game in a full month. I've been slowing the pace down a bit, feeling a bit overloaded with all the games and working on my novels. This game began on Feb 09, 2009 and ended on Jun 12 2009, more than 4 months for 31 moves, but despite my deliberate slowing down, we played the last dozen moves in the last month. Side note: my opponent and I were similarly rated 4 months ago, but since then my rating rose a few hundred points and my opponent deliberately resigned scores of games, dropping almost 1200 rating points below his 6 month peak. Cleaning house, he called it. He did not resign this game because it was a team match - he played out all his team matches.",
        "1... e5 2. Nf3 Nc6 3. Bb5": "The Ruy Lopez, my favorite.",
        "3... a6 4. Ba4 Nf6 5. O-O": "Ordinary stuff so far. The Morphy Defense.",
        "5... b5 6. Bb3": "Black opts for The Wing Attack.",
        "6... d6 7. c3": "I think 7. Re1 is mainline here, but the move as played has the best results in the GameKnot DB and good results in the World DB so I gave it a try. This ends my book knowledge of the Ruy. Heck, at least I got through 6 moves in my head, that's about 4 more moves than I give most other openings...",
        "7... Bg4 8. d3": "According to the world DB, 7. ... Bg4 has been tried only 3 times out of 65 games in the DB, is the weakest response with the lowest rating of players who chose it and the highest win percentage for white. Feeling like I'm moving down a strong opening, I opt for 2nd best here, playing 8. d3 instead of the slightly more recommended 8. Re1. Either way, the white pawn at e4 needs some defense now that white's knight on f6 is pinned. I prefer defending pawns with other pawns, not with rooks - though in this case white's rook on f1 has nothing better to do, so I can see why either is fine, but I stick with my preference.",
        "8... Be7 9. Nbd2 O-O 10. h3": "Still following the DB, 10. h3 only gets 5 out of 61 games, but is chosen by players fully 100 rating points higher than 10. Re1 and has a better win percentage for white. As long as my opponent is following the DB, I'm happy to do the same. I know my opening knowledge is very weak, way too weak to play OTB at my current almost-expert rating. I assume if he's following the DB he's playing good moves, and if I try to wing it, I'm likely to die horribly in the opening - I'd rather learn from the experts, play their moves, and get into a viable middlegame where both players are competing skill vs. skill. Opening knowledge will gradually sink in. I hope. As for me, I go this route not only because the DB recommends it, but because it attacks. I'm like \"Old Blood N Guts\" Patton, always attacking. Defense is for pansies (not panzers - don't confuse the two).",
        "10... Bh5 11. Re1": "I finally play the recommended Re1. Not much else to do.",
        "11... Na5 12. Bc2": "Keeping the bishop pair.",
        "12... c5 13. Nf1": "Who popularizd this? Was it Fischer? Ng3 by way of f1 seems an excellent way to hunt the black bishop on h5.",
        "13... Nc6 14. Ng3": "We're still following the DB at this point, but my opponent's 13. ... Nc6 was the strongest move for white that appears in the DB. I stay with the DB myself. Besides, I like making that bishop uncormfortable. I plan to uncomfort it right off the board.",
        "14... Bg6 15. Nh4 Nd7 16. Nxg6": "The first move that isn't in the DB. From here on, we have to actually play the game. I am glad to be rid of the bishop, and to gain the bishop-pair advantage. Black gets a half-open f-file out of it.",
        "16... fxg6 17. a4": "Time to break up the wings. Also setting up the next few moves by enticing black's pawn to move from b5 to b4.",
        "17... b4 18. Bb3+": "And now for some fun. Who said \"When in doubt, always check your opponent, it might just be checkmate?\" Anyway, this check is not the point. It's a move with tempo to set up the next move. ",
        "18... Kh8 19. Bd5": "Pinning the knight.",
        "19... Rc8 20. Bc4": "Black saved his knght, but now his pawn is in danger.",
        "20... bxc3 21. bxc3 Bh4 22. Bxa6": "The pawn hangs, so I'll take it. This creates a white passed pawn on the a-file and it puts black's rook on c8 en prise. I have no worries about black playing Bxg3, now (which would be bad for black) or later; I look forward to fully opening the f-file.",
        "22... Ra8 23. Bb7": "22. Ra8? loses the exchange for black.",
        "23... Bxg3 24. fxg3 Qf6 25. Bxc6": "Black didn't save his knight, so rather than winning the exchange on a8, white gains a free knight on c6.",
        "25... Qf2+ 26. Kh2": "25. ... Qf2+ scared me a little. I had already discounted it as black not having suffient attacking material to gain an advantage here. I had worked out many combos, and white comes out just fine through all of them. But my opponent played it, which made me wonder if I had overlooked something.",
        "26... Nf6 27. Bxa8": "26. Nf6?? loses a lot more than just the exchange. Black needed to make some running room for his queen. But with the queen supported by her rook on the f-file, white couldn't trap black's queen immediately. Now that file is blocked by the black knight and black's queen is trapped. White can simply play 27. Rf1? and win the black queen for a rook (how often do I get to put a ? on winning a queen for a mere rook?). But, white can also play 27. Bxa8! and win that rook for free - if black recaptures on a8, 28. Rf1 still wins the queen. Black must save his queen, which will allow the white bishop to escape from a8 - or white can leave it there because black's queen is only safe on f2 white the black rook remains on f8.",
        "27... Nh5 28. Re3": "Black saved the queen, but white is working on trapping her again. If 28. ... Rxa8? white replies 29. Rf3 and black's queen is lost. 28. Re3 also defends the pawn on g3.",
        "28... Nf4 29. gxf4": "Black tries a desperate swindle to rescue his game with a last-second checkmate. I suppose white could have moved quickly, overlooked the weakness at g2, and continued to play his intended 29. Rf3??? trying to trap the queen. Instead, white removes the danger by capturing the knight and extending his overwhelming material advantage.",
        "29... Rxf4 30. Rf3": "The final straw. Black's queen is trapped with only one valid move, 30. ... Qh4?, to which white would respond 31 g3! forking rook and queen. The only alternative is trading off all the remaining black pieces on the board.",
        "30... Rxf3 31. Qxf3": "After the rook trade, white is going to checkmate in 1 move on f8. Black's only defense is trading queens. With even pawns, but a rook and two bishops to the good, not to mention a passed pawn on a4 that will be able to promote in 5 moves with no way for black to stop it, white's advantage is insurmountable and black resigns. "
    },
    "url": "https://gameknot.com/annotation.pl/blood-n-guts?gm=24485",
    "gameName": "Blood N Guts",
    "players": "blake84120 (1979) vs. amateurke (528)",
    "opening": "Ruy Lopez (C78), ...b5 & ...d6"
}