{
    "moves": {
        "1. e4 Nf6 2. e5 Nd5 3. d4 d6 4. Nf3 Bg4 5. Be2 c6": "This is the first time that I've tried the Flohr-Agzamov variation rather than the Kengis line (4. ... de 5. Nxe5 g6).  Black's idea is a simple and thematic one - play against the e5 pawn.  In the first instance, he will do this by exchanging on f3 and then e5.  White will have to find a plan, whilst Black's back up is a good old fashioned Kingside attack.  In the game, White suddenly finds himself lost without making any particularly bad moves, and it is for that reason I thought to annotate it.",
        "6. O-O": "6. Ng5 and 6. c4 are White's best chances for an advantage.  6. 0-0 has a poor reputation, probably because it is easy to drift, as here. ",
        "6... Bxf3 7. Bxf3 dxe5 8. dxe5 e6": "Black's position is already perfectly solid and the e5 pawn already a little lonely.",
        "9. c4": "9. a4 is interesting, trying to get the knight to c4.  9. a4 Nd7 10. Qe2 Qc7 11. Re1 and now Black can try 11. ... Bc5, 11. ... a5 or 11. ... Rd8!?  Ultimately, after Na3, Black is probably going to exchange and hope that after Rxa3 the rook is a little out of play.\nWhite obviously feels that by 9. c4 he can exchange queens, prevent Black from castling and gain some space in the centre.  Black on the other hand is happy to exchange queens, keep his king in the centre and attack those lovely pawns.",
        "9... Ne7 10. Qxd8+ Kxd8 11. Bg5": "Is this an inaccuracy?  11. Be4 Nd7 and now 12. Bf4, f4 or Rd1 are the commonest lines.  The pin means nothing to Black, as he intends to castle by hand in any event.",
        "11... Nd7 12. Rd1": "Again, it's hard to be overly critical of this move, although Re1 is probably a better bet.  White might want to try Bxe7 at some point in this line, because the dark squared bishop is in danger of becoming an extra pawn, shoring up the e5 pawn.",
        "12... Kc7": "Black breaks both pins.  Now the e5 pawn is weak, the Black king is safe and the White pawn structure is creaky.  Pretty much what I was hoping for.",
        "13. Bf4": "13. Bxe7 Bxe7 avoids immediate disaster.  Perhaps White thought that the pin on the h2-b8 diagonal would save him.",
        "13... Ng6 14. Bg3 Ndxe5": "Obviously 14. ... Ngxe5 is met by 15. Rxd7+.  Now 15. Re1 Bd6 16. c5 is met by 16. ... Nxf3+ 17. gxf3 Bxg3 when Black will seize the d-file, establish a knight on d5, gang up on the c5 pawn and push through on the queenside. \nArguably, the game is already up for White.",
        "15. Be2": "White wants to preserve his bishop pair, but that's not going to help him here.  Black's knights are strong, and for all that Black's position 5 moves ago looked cramped, White still hasn't developed his queen-side.",
        "15... Bd6": "Breaking the pin. ",
        "16. Nd2": "Given that the knight probably doesn't want to come to f3, wouldn't it be better on c3, where the d-file is still under White's nominal control?",
        "16... f5": "This stops Ne4, threatens ... f4, and gives an escape square at f7 for the knight.  The e6 pawn is weakened, but it's an extra pawn.",
        "17. h3 Rad8": "Black's development is complete, he's a pawn up and has the makings of a K-side attack.",
        "18. a3": "Stopping ... Bb4.  Black is happy to exchange to an endgame at this point.  His king will mop up White's Q-side and his pawn majority on the K-side will keep White busy on that side too.",
        "18... Nf7 19. Bxd6+ Rxd6 20. c5": "I quite like this as an idea, but I think that White's follow up is weak.  Arguably, there's not a lot else that White could do anyway.",
        "20... Rd5 21. Nf3": "This I don't like.  Surely 21. Bc4 is stronger.  I'd looked at 21. ... Rxc5 22. Bxe6 where Black is still going to have to fight for his win.  Now I grab a second pawn. ",
        "21... Rxc5 22. b4 Rd5 23. Bc4": "Too late.",
        "23... Rd6 24. Rac1": "White's moves all look sensible, but he's lost.",
        "24... Rhd8 25. Rde1 Nf8 26. Ne5": "Exchanging pieces isn't going to help, but nothing else will either.  26. b5 is the most obvious attempt to get something going, but Black can play 26. ... c5 and 27. ... b6 to stabilise the Q-side.",
        "26... Nxe5 27. Rxe5 Rd6d1+ 28. Rxd1 Rxd1+ 29. Kh2 Kd6": "As more pieces disappear, White's position becomes even less tenable.  The rest of the game plays itself.",
        "30. Ra5 a6 31. a4 Rd4 32. Be2 Rxb4 33. g4 g6": "There's no point in giving White a sniff of hope.  Now Black will play Nd7-c5 threatening Nb3, and, more attractively, b6, picking up the exchange.  Enough."
    },
    "url": "https://gameknot.com/annotation.pl/bluchers-mini-tournament-xiii?gm=26810",
    "gameName": "blucher's mini-tournament XIII",
    "players": "manujunco (1572) vs. dsb13 (1823)",
    "opening": "Alekhine's defence (B05), modern, Flohr variation"
}