{
    "moves": {
        "1. f4": "Hi everyone, here is a game between me and my buddy dmaestro.  It starts out with a Bird's Opening 1.f4 and transposes into a King's Gambit.  This has not been my most successful opening, particularly with this opponent, but, somehow I find the best opening moves and gradually get through the middle game without too many probs and end up in a drawish endgame.  I steel myself to play out the 50 move rule, but, jury, just look at my opponent's stats and see how many games he has drawn.  Nevertheless it looks to be heading that way this time, but at the end there was a twist to the tale in my favour!",
        "1... e5 2. e4 exf4": "2. ...... exf4 - the KGA accepted.",
        "3. Nf3 d6": "3. ....... d6 - dmaestro's speciality, the Fisher Defense.  I then play d4 which is what Master Chrisobee played against me in a mini-tournament many moons ago when I tried the Fisher Defense on him - I went on to lose that game.",
        "4. d4 g5 5. h4 g4 6. Ng1 Qf6": "6. ....... Qf6 - this move puts pressure on the f file.  All my pieces are at home.  This is about to change.",
        "7. Nc3 Ne7 8. Nge2": "8. Nge2 - development.",
        "8... Bh6 9. Qd2 Bd7 10. Nxf4": "10. Nxf4 - I now get my pawn back.  Black develops his knight to c6 putting pressure on d4 to which I counter with a threat to c7 with Nb5.",
        "10... Nbc6 11. Nb5 Rc8": "11....... Rc8 - evades knight fork on c7.",
        "12. d5 Ne5 13. Qf2": "13. Qf2 - contests f file and relieves pin on f4 horsie.",
        "13... c6 14. dxc6 bxc6 15. Nc3": "15. Nc3 - after a pawn swap my knight retreats to c3.",
        "15... Ne7g6 16. Nxg6 Qxf2+ 17. Kxf2 Bxc1 18. Rxc1 hxg6": "18. ....... hxg6 - after a plethora of exchanges the position has changed a lot in the space of a few moves.  Now comes an exchange of bishop for knight.",
        "19. Bd3 Nxd3+ 20. cxd3": "20. cxd3 - Voila!",
        "20... f5 21. exf5 gxf5 22. g3": "22. g3 - we are now moving towards an endgame after another pawn trade.",
        "22... O-O": "22....... 0-0 - black finally castles.",
        "23. Kg2 Rcb8 24. b3 Rfe8 25. Rce1": "25. Rce1 - this challenge of the e file now leads to a knight v bishop endgame.",
        "25... Rxe1 26. Rxe1 Re8 27. Rxe8+ Bxe8": "27. ........ Bxe8 - here is the endgame.",
        "28. Kf2 Kg7 29. Ke3": "29. Ke3 - Henry centralises himself now we are in an endgame.",
        "29... Kf6 30. Kf4 Bd7 31. a3 Bc8 32. d4 a5 33. b4": "33. b4 - over the last few moves I have been putting all my pawns on squares on the opposite colour to dmaestro's lsb.",
        "33... axb4 34. axb4": "34. axb4 - another pawn trade.",
        "34... Ba6 35. Ke3 Bc4 36. Kf4": "36. Kf4 - now follows a series of king moves - the position does not change much.",
        "36... Bd3 37. Ke3 Bc2 38. Kf4 d5": "38. ........ d5 - a pawn move.  Dmaestro has no further safe pawn moves so it looks as though we may have to play out the 50 move rule.",
        "39. Ke3 Kg6 40. Kf4 Kh5 41. Ke5": "41. Ke5 - I dare not stray from f4 - I need to avoid a f4 pawn break if Henry goes to d6 for example.",
        "41... Be4 42. Kf4 Kg6 43. Ke5 Kf7": "43. ...... Kf7 - king manouevre.",
        "44. Kf4 Ke6 45. Kg5 Bd3 46. Kf4 Kd6 47. Ke3 Ke6": "47. ....... Ke6?? - with 40 moves of the 50 move rule to play out black leaves his bishop en prise.  He realises this and resigns before I play Kxe3.  It is quite easy to fall asleep in an endgame like this.  Beware - you could be in for a very rude awakening!"
    },
    "url": "https://gameknot.com/annotation.pl/blunderfest-pt-6-bishop-left-en-prise?gm=22552",
    "gameName": "Blunderfest - Pt.6 - Bishop left en prise",
    "players": "jstevens1 (1777) vs. dmaestro (1462)",
    "opening": "Bird (A02), From gambit"
}