{
    "moves": {
        "1. e4": "Hi everyone, has anybody ever offered a draw to somebody only to analyse the game with a buddy (albeit a much higher rated buddy) and find that you may well have won some material if you had carried on playing.  Well, this was one of my worst draw offers in Gameknot history.  The only think I can say in mitigation that it was near the end of my Big Slump which happened fairly early on in my gameknot career which saw my rating go down to 1525 - I just wanted to end a losing run so I took a low draw - I was that desperate man!  Thankfully a few months later, after playing 2 months of unrated games non-stop I was on the up.  But here is the pits.",
        "1... e5 2. Nf3 Nc6 3. Bc4 h6": "3. ...... h6 - unusual response to the Guicco Piano.",
        "4. d3": "4. d3 - this becomes a sort of Guicco Piannissimo without black playing Bc5.  I did not use the database then and I played the match like an OTB tournament.",
        "4... Nf6 5. Be3 d6 6. Nbd2 Be7": "6. ...... Be7 - development.",
        "7. c3 Bd7 8. Qc2": "8. Qc2 - more development - I can now castle both sides.  I eventually go kingside.",
        "8... Qc8 9. a3 a6 10. Ba2": "10. Ba2 - wanting to keep Fou Leblanc on the a1-g8 diagonal.",
        "10... Be6 11. Bxe6 Qxe6 12. b4": "12. b4 - an expansion on the queenside after an exchange of light square bishops.",
        "12... b5 13. h3 a5 14. O-O": "14. 0-0 - at last.",
        "14... d5 15. exd5 Qxd5 16. Rfd1": "16. Rfd1 - my opponent rated 500 points south of me has a positional edge (his high time-out history has been partly responsible for his low rating) even so I found this very unnerving.  This leads to my panic draw offer later on.",
        "16... a4 17. Ne1 Qd7 18. Ndf3 Bd6 19. Rac1 Nd5": "19. ........ Nd5 - a lot of manouevering here - it looks as though neither side can make headway, but I think I would still prefer to be black.",
        "20. Qa2 Nxe3 21. fxe3 O-O 22. e4 Ne7 23. d4": "23. d4- here I offered my opponent a draw only to be told this by Ionadowman:-\r\n\r\nYour last move was a very good one indeed to attack Black's tangle of pieces in the centre. You might not have realised it, but Black's bishop was going to take some extricating! 23...exd4 lost the bishop outright after 24.e5! (Bxe5 25.Nxe5 Qf4 26.cxd4 etc). 23...Nc6 and ...Ng6 were no help owing to 24.dxe5. Black could have saved his piece only by this wriggle: 23...c6 24.dxe5 Qa7ch 25.Kh1 Bb8 (...Bc7 looks too risky after Rd7). After that 26.e6 seems to give White the initiative at least and maybe an edge as well.\r\n\r\nSo there you have it.  I was guilty of underestimating my position and mistakenly thought that my opponent had the edge - oh dear!"
    },
    "url": "https://gameknot.com/annotation.pl/blunderfest-part-3-bad-draw-offer?gm=11078",
    "gameName": "Blunderfest Part 3 - Bad Draw Offer",
    "players": "jstevens1 (1580) vs. fattouh (1003)",
    "opening": "King's pawn game (C50)"
}