{
    "moves": {
        "1. d4 d5 2. c4 e6 3. Nc3 c5": "La defensa Tarrasch frente al gambito de dama, particularmente no me gusta, pero obviamente es muy jugable.",
        "4. cxd5": "Creo que es la mejor opción, apresurarse a dejar un peón pasado o retrasado en d5; para luego socavarlo con Cc3-Ag2",
        "4... exd5 5. Nf3 Nc6 6. g3 c4": "Este avance deja el peón retrasado en d5, por lo tanto débil, pero a su vez, genera un candidato a peón pasado en la columna c, si se logra avanzar el peón b. Este plan es muy lento, a mi juicio.",
        "7. Bg2 Bb4 8. O-O Nge7": "Interesante jugada, evita Ag5, aquí busqué la posición en las bases de datos y me dí cuenta que está posición era típica. Las siguientes jugadas, hasta la 13 de las blancas, son repetición de una partida de Adorjan.",
        "9. e4 O-O 10. exd5 Nxd5 11. Bg5 f6 12. Nxd5 Qxd5 13. Be3 Bg4": "La partida mencionada siguió Df7, quitándola de los fuegos del fianchetto. La jugada realizada permite una simplificación que valué favorable a las blancas dado el peón pasado en d4.",
        "14. Ne5 Qxg2+ 15. Kxg2 Bxd1 16. Nxc6 Be2": "Jugada que pierde material, quedo con dos piezas menores a cambio de una torre; además de la ventaja posicional por el peón pasado apoyado y de que la mayoría de peones está transitoriamente detenida.",
        "17. Nxb4 Bxf1+ 18. Kxf1": "Tomé de rey para jugar Tc1 sin pérdida de tiempo, pero a la computadora le agrada más Txf1 seguido de Rf3. Creo que la jugada realizada es más lógica.",
        "18... Rac8 19. Rc1 Rfd8": "Creo que mejor era b5 o a5 seguido de b5, para iniciar un ataque de peones en el flanco dama. La próxima jugada retrasa un ataque que mi oponente, quitando atractivo a la partida, jamás inició.",
        "20. a4 Kf7 21. Kg2": "Preferí ir por g2 a ir por e2 por si necesitaba ocupar la columna e con la torre de urgencia.",
        "21... g5": "Iniciando juego en el flanco contrario.",
        "22. Kf3 Kg6": "Más consecuente con la jugada anterior, era inmediatamente h5.",
        "23. Na2": "Camino a c3, dominando mejor el centro y bloqueando c4.",
        "23... f5 24. Nc3 a6": "Mejor b6 primero, ahora restrinjo el flanco dama.",
        "25. a5 Kf6 26. d5 h6": "Mejor, me parece, h5.",
        "27. Bd4+": "Me parece importante este jaque intermedio, así permito la entrada de la torre en e5.",
        "27... Kf7 28. Bb6": "La importancia de esta jugada, además de controlar la casilla de coronación del peón pasado, es sin dudas la amenaza d6-d7 de jugar mi oponente Te8, ocupando la columna abierta.",
        "28... Rd6 29. Re1 Kf6 30. Bd4+ Kf7 31. Re5 Rf6 32. h3 g4+": "entrega un peón que no quise aceptar, no quería darle juego a las torres, aunque sin dudas, la aceptación debía ser lo mejor.",
        "33. Kg2 h5 34. h4": "Cerrando las columnas, y quedándome con la casillas e3 f4 g5 para ingresar con el rey en el territorio ajeno. La PC marca como mejor plan Ce2, pero me parecía que el caballo estaba bien ubicado en c3, y que la entrada del mismo debía ser a4.",
        "34... Rc7": "Aquí puedo jugar Te8, con amenazas en la retaguardia, sin embargo, prefiero seguir con las jugadas de rey.",
        "35. Kf1 Rc8 36. Ke2 Rc7 37. Ke3 Kg6 38. Kf4 Rd7": "Si Tc8, yo hubiese jugado Te7, amenazando Tg7+.",
        "39. Re8 Rff7 40. Re6+": "Mejor que Tg8+",
        "40... Kh7 41. Kg5": "penetración definitiva, según Fritz, las blancas poseen una ventaja mayor a 6 puntos. La amenaza es Th6 seguido de Th8++.",
        "41... Kg8 42. Re8+ Rf8": "Única.",
        "43. Rxf8+ Kxf8 44. Kxf5 Re7": "Es un error, pero a Tf7+ sigue Af6, controlando d8. y el rey blanco apoya tranquilamente el avance del peón d.",
        "45. Bc5": ""
    },
    "url": "https://gameknot.com/annotation.pl/bodejaxs-mini-tournament-i?gm=36679",
    "gameName": "bodejax's mini-tournament I",
    "players": "chizzo83 (1729) vs. bodejax (1671)",
    "opening": "QGD (D33), Tarrasch, Folkestone (Swedish) variation"
}