{
    "moves": {
        "1. e4": "The King's Pawn opening move is both popular and logical. It controls the center, opens lines for both the Queen and the Bishop, and usually leads to an open game in which tactics, rather than slow maneuvering, predominates.",
        "1... c5": "The Sicilian defense immediately stakes a claim at d4 and prepares an unbalanced challenge for control of the game.",
        "2. Nc3": "The Closed Variation looks toward the fianchetto of the King's Bishop, restraining the Black d pawn for a little while.",
        "2... g6": "Nc6 would have been in the Sicilian Defense / Closed Variation 2.Nc3 Nc6 opening line.",
        "3. g3 Bg7 4. Bg2 Nc6": "We've rejoined mainlines.  B24 Sicilian Defense / Closed Variation 2.Nc3 Nc6 3.g3 (transposed).  Playing d6 is not yet called for.\r\n\r\n\r\n",
        "5. d3 d6 6. Nge2 e5": "Botvinnik variation.",
        "7. O-O Be6": "Nge7 would have been in the Sicilian Defense / Botvinnik 5.d3 d6 6.Nge2 e5 opening line.  White is now free to play Nd5 because taking the knight forces Black to to cede the bishop pair.  After 8.Nd5, if black plays 8... Bxd5, then the probable continuation 9.exd5 Ne7 (9... Nb4 10.a3) 10. f4 Nf6 11. Bg5 Nfxd5 12. Bxd5 Qd2 (12... Nxd5 13.Bxd1) looks fine for White because White has both bishops and the light-square bishop seems to control diagonal given up by the e6 bishop.",
        "8. h3": "Because white is a tempo ahead capturing at h3 and exchanging light-squared bishops is practically impossible.  Delaying Nc6 would not expedite the battery enough because white can and will play Kh2.  After g3, black must play d6, e5, Be6, and Qd7 before white is able to play Bg2, O-O, h3/h4, Kh2.",
        "8... Qd7": "What would the consequences of 8... f5 be?  I think Nge7 is most appropriate.  It has been called for for a while.",
        "9. Kh2": "More or less forced.",
        "9... Nge7": "Black would like to play Nd4, but the reasons given for why White can play Nd5 also apply to Black's Nd4.  After 9... Nd4, 10. Nxd4 cxd4 holds no terror for White because of Nd5.  The other option is the possibility of d4 once white plays Be3 with the threat of an immediate d5, but these plans are mutually exclusive.  If black plays d4, d5, he cannot play Nd4 and vice versa.",
        "10. Be3 O-O 11. Qd2 Nd4 12. Rac1": "White seems concerned with c2, but black has no way of exploiting c2.  For example, 12. f4 Nxe2 (12... Qa4 13.b3) 13.Nxe2 when Black no longer threatens the square.",
        "12... d5": "ionadowman says, \"At move 10, 11 or 12, Black could begin a K-side pawn storm with ...f4. It's what I would consider, but it's not clear that it's any better than the moves played. In fact I rather like your ratcheting the tension with 12...d5!?\"  But playing d5 now when the black knight prevents d4 seems like it might have been a mistake.  This move practically guarantees that the center will eventually open up.",
        "13. Bh6 f6": "The bishop trade is unavoidable.  White also now has the threat 14.Nxd4! cxd4 15.Nxd5 after removing the bishop from e3.  13... f5 is actually interesting.\r\n\r\nIon adds, \"13...f6!? A very interesting moment. There's nothing wrong with the move played, but a couple of other ideas came into the picture. 13...Bxh6 was perfectly playable, followed by exchanges in the centre. The Q lacks support on h6. But more interesting was 13...Bxh3!? and if 14.Bxh3!? Nxf3  15.Kg2 Nxd2! (not ...Bxh6?) 16.Bxd7 Bxh6 17.Rh1 Kg7 with a very murky position.\"",
        "14. Bxg7 Kxg7 15. f4": "ion: \"Sometime during the 3 moves from 15 to 17 I would have exchanged knights on e2 and closed the centre by ...d4. Again, this isn't necessarily to find fault with what you did play, except to say that it is on the whole safer to have the centre closed when initiating a flank operation. But if were wanting to keep your options open, then ... fair enough!\"\r\n\r\nI actually agree, but I just didn't think about that during the game.  Black is fine if the center is firmed up, and his rooks contesting the soon to open f file suggest equality.",
        "15... Rae8": "Ion's formula is probably still called for.",
        "16. a3": "A waiting move.",
        "16... b5": "The decision to play on the wings eventually cedes the center and costs black the game.  I think Rf7 was called for.  Also slightly better is the previously mentioned Nxe2.",
        "17. Rf2": "White expects the f file to open.  Chessmaster, after the game of course (I doubt I would have lost...), suggests fxe5 for white.",
        "17... b4": "Either f5 or Rf7 seems more suitable.  Chessmaster suggests Ion's Nxe2.",
        "18. Nxd4 exd4": "I thought this move firmed up the center, but white seems to have resources to open it up later.",
        "19. Ne2": "CM prefers Nxd5.",
        "19... a5": "ion: \" White's 19.Ne2 strikes me as an inaccuracy - not a mistake, withal, but perhaps not as good as 19.Nxd5. After 19.Ne2 bxa3 20.bxa3 dxe4 21.dxe4 f5 looks pretty OK for Black. Your reply 19...a5 was OK, but less decisive.\"\r\n\r\n",
        "20. Rcf1 f5": "Stopping white's f pawn seemed a priority.",
        "21. e5": "Closes the center for now.",
        "21... Rea8": "Rb8 seems better.  iod adds: \"Instead of 21...Ra8 I would have played ...Rb8, but there's nothing much in it. Having played this one to a8, though, bringing the other rook to b8 (as you did eventually) ought to have been higher on the agenda, I feel. Having begun the fight on the Q-side, I think you needed to carry it through quickly. Having said all that, you were still on around about an even footing until the 25th move.\"",
        "22. Rb1 Nc6 23. Rff1": "A waiting move?",
        "23... Ra6": "23... bxa3?",
        "24. Bf3 Rb8": "CM:  25.axb4 axb4 26.Ra1 Rba8 27.Rxa6 Rxa6 28.Nc1 Ra1 29.Bg2 Qe7 30.Nb3 Rxf1 31.Bxf1.",
        "25. c3 b3": "Perhaps Rab6.  Ion: 25...b3?! Probably this isn't all that bad, really, but it seems more in White's than Black's interest that the Q-side be closed in this way. 25...dxc3 and Black still has a fine game. Black's still OK for the moment , but...",
        "26. cxd4 c4": "Better was Nxd4.  The opening of the c file would suit Black fine.  The eventual opening and white domination of the center was very strong.  Ion prefers cxd4: \"26...c4? was the decisive mistake, and I rather think it was the previous move that led to it. Though Black hangs on by his teeth for quite a long time, there was really no cure against the huge pawn centre White now established. The right course here was the straightforward 26...cxd4, with a roughly even game.\"",
        "27. dxc4": "Isolates Black's pawn at d5.",
        "27... dxc4": "CM says, \"Slightly better is a4.\"",
        "28. d5": "Now Black's trouble begins.  Because the queen is undefended both knight and bishop are safe for now.",
        "28... Rd8": "Ion: \"28...Ne7 was a bit of an improvement over 28...Rd8. After 28...Rd8 29.Qc3! threatening Qxc4 was decisive. But it's really the difference between a large disadvantage and a lost game...\"",
        "29. Nc3": "CM: Leads to 29...Ne7 30.Rbd1 Qc8 31.Qe3 Bg8 32.e6 Kf8 33.Qe5 Qc5 34.d6 Qxe5 35.fxe5 Bxe6 36.dxe7  Kxe7 37.Rxd8 Kxd8, which wins a queen, a rook, and a knight for a queen, a rook, and two pawns. Better is Qc3, leading to 29...Na7 30.dxe6 Qxe6 31.Nd4 Qb6 32.Rbd1 ‡Nb5 33.Nxb5 Rxd1 34.e6  Kh6 35.Rxd1 Qxb5, which wins a rook, a bishop, and a knight for a rook, a knight, and a pawn.",
        "29... Ne7 30. Rbd1": "CM: \"Disengages the pin on White's pawn at d5 and moves it behind the passed pawn at d5.\"  Despite what Chessmaster says, the pin stands.",
        "30... Bg8": "Wastes time.  Black should instead pivot the knight to contest d6.  The bishop was safe for the moment.",
        "31. Rfe1 Nc8 32. Qd4 Kh6": "Black running out of ideas doesn't like e6 , but Be6 better prevents as the consequences of Kh6 are very dangerous.",
        "33. g4": "Black is out of ideas.",
        "33... Be6": "Prevents 34. e6 which loses the Black queen as 34... Qe7 35. g5  Qxg5 36. fxg5  Kxg5.  Bishop is safe... despite that CM says:\r\n\r\nLook out. Hangs the bishop. Leads to 34.g5  Kg7 35.Qxc4 Ra7 36.dxe6 Qe7 37.Rxd8 Qxd8 38.Rd1 Qe8 39.Bc6 Qf8 40.Qxb3 Qc5, which wins a rook for a rook, a bishop, and two pawns. Much better is fxg4, leading to 34.Bxg4 Qa7 35.Qxa7 Rxa7 36.d6 Rf7 37.Kg3 Nb6 38.Be6, which wins a queen and a pawn for a queen and a pawn. This was black's key miscue in the game. Black did regain the lost ground, but later resigned.",
        "34. g5+ Kg7 35. Qf2": "Releases the long held pin on d5.\r\n\r\nCM:  Danger! Leads to 35...†B8 36.Be2 Qa7 37.Qxa7  Rxa7 38.Bxc4 Rc7 39.Ba6 Rc5 40.d6 Be6 41.Bb5 Nb6, which wins a queen and a pawn for a queen. Much better is Qxc4, leading to 35...Ra7 36.dxe6 Qe7 37.Rxd8 Qxd8 38.Rd1 Qe8 39.Bc6 Qf8 40.Nd5 Qg8 41.Bd7, which wins a rook, a bishop, and a pawn for a rook. White had a won game before this error, but it was not costly; black later resigned.",
        "35... Qc7": "White has more than enough material to defend the d pawn.  Black without any idea to improve his position decides that the trade might allow him some compensation by depriving White the central pawn duo, but this advantage is only one of many that White seems to enjoy and only further troubles black's position.  CM clearly identifies it as an error.",
        "36. dxe6 Rxe6": "36... Rxd1 should have been played first.",
        "37. Rxd8": "CM: Slightly better is Nb5.",
        "37... Qxd8 38. Rd1 Qc7": "Slightly better is Qf8.",
        "39. Qd4": "CM at this point prefers exchanges, and who would disagree?",
        "39... Nb6 40. Nd5 Nxd5": "Possibly better is Qd7.",
        "41. Bxd5 c3": "Hangs the pawn and the rook.",
        "42. Bxe6 c2 43. Rc1": "Black's last idea is unsound and fails.  Black resigns."
    },
    "url": "https://gameknot.com/annotation.pl/botvinnik-style-sicilian-white-triumphs?gm=18087",
    "gameName": "Botvinnik style Sicilian - White triumphs",
    "players": "galopard (1615) vs. mokru (1503)",
    "opening": "Sicilian (B23), closed"
}