{
    "moves": {
        "1. e4": "Book move.",
        "1... c5": "Sicilian.  Black wants a brawl.",
        "2. Bc4": "Rather an inadvisable opening, White ought to move his kinghts.",
        "2... e6": "Intended to allow the queen and bishop to get out, as well as set up for 3...d5.",
        "3. Nf3": "This move should have come one move earlier.",
        "3... d5": "Begins to attack the center.",
        "4. exd5": "White knows he will lose the pawn if he retreats the bishop and prefers to get a pawn in exchange.",
        "4... exd5": "Completes the trade.",
        "5. Bb5+": "Rather a premature attack, though the bishop is kind of in no-man's-land in the middle of the board.",
        "5... Bd7": "Either that, Nd7, or Nc6.",
        "6. Bxd7+": "White is grateful to have his bishop off the board with compensation.",
        "6... Nxd7": "Possibly not the best capture; Qxd7 is possibly preferable.  However, this move isn't bad at all.",
        "7. d4": "Some more pawn action, White wants a center presence.",
        "7... c4": "Black is making an advance here, trying to pressure White's position.",
        "8. Nc3": "White wants his other knight involved and sees the undefended center pawn,  which he can attack.",
        "8... f6": "Helps with center defense.",
        "9. Bf4": "Getting the other bishop out from the back rank.",
        "9... Ne7": "Black only just now sees the undefended pawn, which White refrained from taking with the last turn, and moves to defend it.  This makes an incredibly cramped position, the beginning of Black's troubles.",
        "10. Qe2": "An attack again on the central pawn, pinning the knight to the king.",
        "10... g5": "Attacks the bishop, a good intermezzo while Black tries to figure out what to do about his d-pawn.",
        "11. Bd6": "Gets the bishop out of harm's way and puts more pressure on Black's position.",
        "11... Qb6": "This moves the queen into a position well-suited to the game, attacking White's b-pawn and White's bishop.",
        "12. Bxe7": "The only way to save the b-pawn without losing the bishop.",
        "12... Bxe7": "Reciprocating.",
        "13. b3": "White refuses to allow the queen to attack the b-pawn.",
        "13... Qb4": "This pins the (undefended) knight to the king.",
        "14. Qd2": "This defends the knight and breaks the pin.",
        "14... O-O": "Black evidently gives up on defense of his d-pawn.",
        "15. Nxd5": "The move white has been leading up to all game. His knights are extremely strong.",
        "15... Qxd2+": "Without many strong moves, Black trades queens.",
        "16. Nxd2": "White wants to castle, saving his king for that.  Also, this one attacks the c-pawn, which, while not terribly dangerous, is annoying.",
        "16... Bd6": "This one's done to get the bishop out from the back of the formation.",
        "17. Nxc4": "Really laying it on now, this attacks the bishop as well as getting the c-pawn off the board.",
        "17... Rfe8+": "A check that either takes one of White's knights out of the fray or eliminates White's chances to castle.",
        "18. Kd1": "White is by now enamored of his knights and is all right without castling.",
        "18... Rac8": "Disaster.  A cheap attack on one of the knights, Black misses the knight fork entirely.",
        "19. Nxd6": "A great move that gets the bishop off the board and wins one of the rooks.",
        "19... Nb6": "Black wants to attack White's other knight, avoiding having to choose which rook he wants to lose.",
        "20. Nxb6": "One rook will still be there for the taking, so White has no issue trading knights.",
        "20... axb6": "No choice, really.",
        "21. Nxe8": "White picks one of the rooks.",
        "21... Rxe8": "Once again, no choice.",
        "22. Re1": "White wants Black's rook off the board.",
        "22... Rxe1+": "A mistake, losing his last piece.",
        "23. Kxe1": "And here Black resigned.  A succession of terrible moves has doomed Black in this game."
    },
    "url": "https://gameknot.com/annotation.pl/bowlder-attack-dissection?gm=38478",
    "gameName": "Bowlder Attack dissection",
    "players": "johnpbro (1052) vs. Whitehor5e (1166)",
    "opening": "Sicilian defence (B20)"
}