{
    "moves": {
        "1. c4": "Hey all! Seems like I post nothing but foolishly aggressive games these days, but at the risk of being redundant, here's another! This game opens quietly, but once both armies have taken their places on the battlefield and the first shot fired, the fighting doesn't stop until both sides are bloodied and one is soundly beaten. This game is brought to you by the phrase \"no quarter.\" Enjoy!",
        "1... e5 2. g3 Nf6 3. Bg2 c6 4. e3 d6 5. Ne2 Be6 6. b3 Be7 7. Nbc3 O-O 8. Bb2": "Fairly standard King's English. Black has built his fortress in the center; White will seek to tear it down.",
        "8... h6": "Presumably meant to stop an eventual Ne4-g5, as well as giving the N3 Knight a place to go to allow ...f5.",
        "9. h3 Nbd7 10. O-O Nh7 11. Ne4": "? As Black just set himself up to play ...f5, this move is utterly pointless and wastes two tempi.",
        "11... f5 12. Ne4c3 Nc5 13. d4": "White declares his challenge.",
        "13... exd4": "This is probably better than retreating the Knight, though if White wants to be rid of it, he can.",
        "14. Nxd4 Qd7 15. Nxe6": "!? Trading off a powerfully centralized Knight for Black's relatively passive Bishop, in an attempt to ease the pressure on h3 and establish a dominant bishop-pair.",
        "15... Qxe6 16. Qc2 Nf6 17. Rae1 g6": "The reinforcements are brought up. Black's castle will be quite exposed once White's Knight moves and unleashes the powerful Bb2, but Black still retains some hold on the center squares.",
        "18. e4": "White declares that Black's grip on e4 is insufficient and throws down the second challenge, this time backed by his heavy pieces. The horns blow, the armies rush at each other, and the war begins in earnest. There's at least one capture or check every move for the rest of the game.",
        "18... Ncxe4 19. Nxe4 fxe4 20. Bxe4": "Daring Black to engage in a mating race against the powerful White Bishops.",
        "20... Qxh3": "? Naturally, but I think incorrectly, Black accepts. He needs to gain enough tempo for ...Ng4 and ...Qh2#, while at the same time, White needs only to arrive safely on h7 for his own decisive strike. I think Black might hold with 20...Nxe4, and against White's superior mobility and awesome Bishops, a hold is what he should be looking for.",
        "21. Bxg6": "Now both players are all-in.",
        "21... Rf7": "If forced to defend, we'll sacrifice material to eliminate crucial enemy forces! Unfortunately 21...Rae8 is not sufficient, as after 22.Bxe8, the Bishop cannot be taken, or mate follows: 22...Rxe8?? 23.Qg6+ Kf8 24.Bxf6, or 22...Nxe8?? 23.Qg6+ Ng7 Qxg7#. So, this particular Rook sacrifice is a necessary step before ...Ng4, preventing Bh7+ and stopping the White Rook from rampaging down to e7...",
        "22. Rxe7": "! Or not, as the case may be. White seems all too eager to throw material at his problems, but his attack is looking more and more decisive. Will he have enough energy to finish the job?",
        "22... Ng4": "22...Rxe7 23.Bxf6 Rc7 24.Re1 is unwinnable, so go for the gold and play to steal just one more tempo!",
        "23. Bh7+ Kf8 24. Rxf7+ Ke8": "24...Kxf7 25.Qf5+ Ke7 26.Re1+ Kd8 27.Qf8+ Kc7 28.Re7+ Kb6 29.Bd4+ c5 30.Qxa8 is no better.",
        "25. Re1+ Kd8 26. Bf6+": "! White no longer needs a mating net--his enormous positional and material advantage will secure the win once Black's threat is off the table, and this move forces the Knight to trade itself in, leaving Black without an attack. (If 26...Kc8?? 27.Re8#)",
        "26... Nxf6 27. Rxf6": "1-0. Black's attack has fizzled, and he sacrificed too much to be able to keep fighting. Many thanks to aramberber for this very fun tactical game, and thanks to you for reading!"
    },
    "url": "https://gameknot.com/annotation.pl/braveheart?gm=45570",
    "gameName": "Braveheart",
    "players": "bwaa (1719) vs. aramberber (1725)",
    "opening": "English opening (A20)"
}