{
    "moves": {
        "1. e4": "Hi everyone!\n\nHere is another game in the themed Sicilian Pelikan, Bird variation MT started by Matthew (Concordborn).  This time the result goes in my favour.  Although I win a pawn in the middlegame, Matthew works it so that we end up with opposite colour bishops and he sets up a Joblock style defensive formation.  However, I keep both pairs of rooks on and my extra pawn, a passed pawn, ties his rooks down to stopping it from getting to Glendadom on a8.  However, it was very difficult for me to make headway because Fou Leblanc was also tied to the defense of my a and c pawns.  It looked to be heading for a Low Draw until Matthew walked into a pin and one little pawn push proved decisive.  Here is the gameknot analysis version.http://gameknot.com/analyze-board.pl?bd=17446461&rnd=0.9831448610802258.",
        "1... c5 2. Nf3 Nc6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 e5 6. Ndb5 d6": "6.  ...... d6 - the last move of the forced moves which run like this:- 1. e4 c5 2. Nf3 Nc6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 e5 6. Ndb5 d6.",
        "7. Bg5": "7. Bg5 - this pin is the most popular move in the World DB.  It does indirectly threaten the pawn on d6 because if BxN then black must either move his queen to f6 which will no longer defend the d6 pawn, or he will have to play gxf6 weakening his kingside.",
        "7... a6 8. Na3 b5 9. Nd5": "9. Nd5 - a usual outpost for this knight in the Sicilian which follows a standard black queenside pawn push.",
        "9... Be7 10. Bxf6 Bxf6": "10. ....... Bxf6 - B for N trade.",
        "11. c3 Bg5 12. Nc2": "12. Nc2 - my knight moves off the rim looking for better things.",
        "12... O-O 13. a4 bxa4 14. Rxa4": "14. Rxa4 - pawn trade.",
        "14... a5 15. Bc4 Ne7 16. Nce3": "16. Nc3 - bolsters d5.",
        "16... Bd7 17. Ra2 Nxd5 18. Nxd5": "18. Nxd5 - after a knight trade another white knight takes root on d5.",
        "18... g6 19. b3 Kh8 20. O-O": "20. 0-0 - Henry finally gets castled on move 20!",
        "20... a4 21. bxa4": "21. bxa4 - black gives up his a pawn, what is he up to here?  Is he planning a kingside mating attack and can I hold on to my remote isolani passer?  My questions will soon be answered.",
        "21... f5 22. exf5 Bxf5 23. Bb5": "23. Bb5 - after a pawn trade, Fou Leblanc protects the isolani.  It will take a piece trade to shift it.",
        "23... Be4 24. c4": "24. c4 - Fou Leblanc is further reinforced on this square.  If he is exchanged I will have two connected passers on the queenside.",
        "24... Bh4 25. f3 Bxd5 26. Qxd5": "26. Qxd5 - now here are the opposite colour bishops.  With the major pieces on, however, this may favour the attacking side and I suppose with the extra pawn, that is white.  Note that Glenda has now replaced my knight on d5 and she can only be shifted by the Wicked Witch of the West, who incidentally, is still on her home square!",
        "26... Qb6+": "26. ..... Qb6+ - but now she finally moves and she fixes her glare on Henry who has to take evasive action to h1.",
        "27. Kh1 Rad8 28. a5": "28. a5 - passed pawns must be pushed!",
        "28... Qa7 29. a6": "29. a6 - and again, but this is how far the pawn gets.",
        "29... Be7 30. Qb7 Rda8 31. Qxa7 Rxa7": "31. ....... Rxa7 - the queens have been exchanged and now the rooks are tied to my passer on a6.  But where do I go from here?",
        "32. Rd1": "32.Rd1 - answer, perhaps a move to d5 will help.  Yet another white piece occupies that d5 square and this is gonna prove decisive in my favour later on.",
        "32... Rc8 33. Rd5 Kg7": "33. ..... Kg7 - the BK moves to the centre of the board, but it will be to his detriment!",
        "34. Kg1": "34. Kg1 - Henry does likewise.",
        "34... Kf6 35. Kf2 h5 36. Ke3 Kf5": "36. ..... Kf5? - Here it is, the fateful king move.  Black will now drop at least another pawn due to the pawn being pinned on e5.  I now exploit this pin with f4!",
        "37. f4 g5 38. fxe5 dxe5": "38. ..... dxe5 - this d6 pawn is also pinned, albeit against a square rather than a piece or other pawn.  This square is d7 and now a bishop fork will take place on it and white will drop the exchange.  It does take place next move and Matthew considered the following exchange deficit to be ruinous and immediately waved the white flag.  That victory took me back to my highest rating 1859.  I have since topped it and my next target is to get to 1870.  If I can concentrate hard and take full advantage of any of my current opponents errors I aim to get to the dizzy heights of 1900 - in baby steps!  Anyhow, I hope you are all having a nice weekend.  Bye for now - Joanne",
        "39. Bd7+": ""
    },
    "url": "https://gameknot.com/annotation.pl/breakthrough?gm=44490",
    "gameName": "Breakthrough!",
    "players": "jstevens1 (1854) vs. concordborn (1655)",
    "opening": "Sicilian (B33), Pelikan, Chelyabinsk variation"
}