{
    "moves": {
        "1. e4": "This is my preferred opening move for White, since it opens up diagonals for my Queen and King's Bishop, while staking a claim on the centre with the pawn.",
        "1... d5": "I haven't played many chess games yet, so I was surprised to see Black respond with d5.",
        "2. exd5": "Not taking the d-pawn would allow Black to advance it further, reducing the space white has control of.",
        "2... Nf6": "Black is in no hurry to get the pawn back. He decides to further develop his pieces.",
        "3. c4": "Since I hadn't seen this opening before, I had to think awhile before coming up with this answer. I was willing to give up the d5 pawn, but since it hasn't been taken yet, I decided to make use of it to grab as much space as possible. I initially thought of 3. Nc3, but after 3. ... Nxd6 4. Nxd6 Qxd6, Black's queen has control of the centre and White has no options left to chase it away.",
        "3... c6": "I was later to learn that this opening is the Scandinavian gambit.",
        "4. Nc3": "4. dxc6 was possible, but after 4. ... Nxc6, Black would have 2 knights developed and his queen has a semi-open file. I went with Nc3 to develop my knight instead of going for the material advantage.",
        "4... cxd5": "Black decides to take back his pawn.",
        "5. d4": "I still wasn't prepared to exchange the pawns and knights yet, so I went with 5. d4 to prevent 5. ... d4.",
        "5... Nc6": "Bring his other knight into play and putting pressure on the d4 pawn, with possible Nb4 in the future.",
        "6. Nf3": "Developing my other knight.",
        "6... e6": "Extra protection for his d5 pawn, and allows the bishop at f8 to come out.",
        "7. cxd5": "I wanted to settle the situation in the centre before moving my bishops, so I was trying to decide between c5 or cxd5. However, I didn't try c5 because I didn't like the look of b6.",
        "7... Nxd5": "7. ... exd5 was possible too.",
        "8. Nxd5 Qxd5": "Exchange of knights.",
        "9. Be3": "Moving out my bishop to further defend the weak pawn at d4, with an eye on Rc1 later.",
        "9... Be7": "Getting ready to castle. 9. ... Bb4+ might have been better, since it would have developed a piece with tempo.",
        "10. Bd3": "Getting ready for a kingside attack if he castles. Also, gets the bishop out of the way so that my king can castle (I love castling).",
        "10... O-O 11. O-O Re8": "Thinking of Bf6 to attack the d4 pawn, then maybe an e5.",
        "12. Qc2": "Threatening to break open Black's defence with Bxh7+, with lots of future options for attack like Rc1 or Be4.",
        "12... h6 13. Rad1": "Supporting the d-pawn from behind with the intention of advancing it.",
        "13... Bf6": "Attacking white's lone pawn. Now there are 3 Black attackers and 2 White defenders.",
        "14. Be4": "Attacks Black's queen and knight with the bishop, while at the same time opening a path for my rook to defend the pawn.",
        "14... Qd6": "Retreating to safety while still defending the knight on c6.",
        "15. d5": "Now that his queen is no longer occupying d5, I can finally advance my pawn.",
        "15... exd5 16. Bc5": "I decided to push around Black's queen even more, although I'm not sure if this was my best move. Perhaps I should have just taken the pawn immediately.",
        "16... Qd7 17. Rxd5": "17. Bxd5 might have been safer, but I wanted to keep my bishop along the b1-h7 diagonal.",
        "17... Qe6": "Now my bishop at e4 is in danger, and Black's queen is attacking my rook at d5 as well.",
        "18. Bh7+": "The only way I could see to save both pieces.",
        "18... Kh8 19. Rfd1": "I didn't want to retreat, so I moved my other rook to form a battery. However, this opens the possibility of a backdoor mate later on, which would give me a lot of trouble.",
        "19... Bd4": "Certainly not what I was expecting! This move cuts off mutual protection between my rooks, so that my rook at d5 is in danger again. Because of the Qe1+ threat, I cannot take Black's bishop with my knight or the rook at d1. If I go with 20. R5xd4, then after ... Nxd4 21. Bxd4 Rd8 White's pieces would be locked in defence.",
        "20. Bxd4": "My rook at d5 is still safe from ... Qxd5 due to 21. Bxg7+ Kxg7 22. Rxd5. Also, now White is temporarily leading in material.",
        "20... Nb4": "Looks like Black really wants to trade his knight and bishop for my rook. However, I have other plans...",
        "21. Bxg7+": "With this move, Black's king is forced into the open. I have no qualms about 'sacrificing' a bishop that was given to me for free in the first place.",
        "21... Kxg7 22. Qc3+": "Gets my queen out of the knight fork, and counter-forks Black's king and knight. Furthermore, there's the added benefit of protecting the e1 square.",
        "22... Kxh7 23. Qxb4 b6": "Here, Black is thinking of developing his remaining bishop to b7, and planning on exchanging it with White's knight in order to blow the g file open.",
        "24. Ng5+": "This was my answer. Black is practically forced to take the knight because knight forks can't be defended against.",
        "24... hxg5 25. Rxg5": "Black's king is suddenly in danger from 26. Qh4+ Qh6 27. Rh5.",
        "25... Qh6": "The only response Black can make. Any other response leads to exchanging his queen for White's rook.",
        "26. Rdd5": "Now that Black's queen no longer threatens e1, it frees up my other rook to be more aggressive. Here, White is clearly threatening Rh5 and pinning Black's queen to the king.",
        "26... a5": "I didn't see the point of this move, as it allowed me to reposition my queen. Later, my friend said that he wanted to remove my queen's influence from the f8 square. However, I don't think that would have been a problem since my rook at g5 was already preventing his king from reaching f8. A better response might have been 26. ... f5 (separating my rooks again) 27. f4 (planning g4 then Rh5) Rg8.",
        "27. Qd2": "I only had 2 choices: Qc3 or Qd2, since my queen still has to defend the e1 square. I went with Qd2 since it would link my queen with my rooks. Now, 28. Rh5 would be even more costly for Black, with 28. ... Qxh5 29. Rxh5+ Kg7 (or Kg8) 30. Qg5+ Kf8 31. Rh8#",
        "27... Bg4": "I saw this possibility a few moves earlier. This move defends the h5 square, thereby preventing White from moving Rh5. Also, White cannot simply take Black's bishop with 28. Rxg4 because of ... Qxd2. White cannot retake the queen because e1 is no longer defended, and therefore must play 29. Rh5+ Qh6 30. Rxh6+ Kxh6 31. f4. After this exchange White would be down by a rook.\n\nHowever, I disregarded 27. ... Bg4 as a viable way to defend, because of the following move...",
        "28. h3": "h3 attacks Black's bishop, while simultaneously opening an escape route for White's king (finally! whew.) Later, my opponent would admit that when he played 27. ... Bg4, he was thinking of 28. h3 Bh5 29. g4 Bg6. However, it wasn't until he moved the bishop that he saw 29. Rxh5.",
        "28... Qe6": "Black decides to force a queen exchange by checking at e1.javascript:void(0)",
        "29. Rxg4": "I was thinking of Rh5.",
        "29... Qe1+": "I have 2 choices again. First option: 30. Kh2 Qxd2 31. Rxd2. Second option: 30. Qxe1 Rxe1+ 31. Kh2. I went with the first option since I didn't want Black's rook running amok on the first rank, but on hindsight the second option might have been better with a forced rook exchange after 31. ... Re6 32. Rh5+ Rh6 33. Rxh6+ Kxh6 or 31. ... Kh6 32. Kg3 f6 33. Kh4 Re5 34. Rxe5 fxe5.",
        "30. Kh2 Qxd2 31. Rxd2 Re6 32. Rd5": "Getting ready to bring my king out and force an exchange.",
        "32... Kh6 33. Kg3 Rg6": "Looks like Black gave up his fighting spirit.",
        "34. Rxg6+ fxg6 35. Rd6": "Attacking Black's b-pawn and pinning his g-pawn.",
        "35... b5 36. f4 a4": "A waiting move? Maybe Black hopes to break through and create a passed pawn on the queenside, but it's too late.",
        "37. f5 Rg8 38. Rxg6+": "Now Black is forced to exchange his remaining rook.",
        "38... Rxg6+ 39. fxg6 Kxg6 40. Kf4 Kf6 41. Ke4 Ke6 42. Kd4": "Black resigned here because there is no way to protect his a and b pawns while preventing White from promoting the g and h pawns."
    },
    "url": "https://gameknot.com/annotation.pl/breaking-open-defences?gm=44836",
    "gameName": "Breaking open defences",
    "players": "stefliew  vs. ??? ",
    "opening": "Scandinavian gambit (B01)"
}