{
    "moves": {
        "1. d4 d5 2. Bf4 Nf6 3. Nd2 Bf5 4. h3": "A loss of time, but the move is on the agenda anyway.",
        "4... e6 5. g4 Bg6 6. Ngf3": "...transposing into the usual lines.",
        "6... Bb4 7. c3 Bd6 8. Ne5 O-O 9. e3": "This move allows to play h4, being g4 protected. ",
        "9... Ne4": "Now black can play f6, but NxB will be good for me. ",
        "10. h4": "Very important to block Qh4. ",
        "10... Nxd2": "In many occasions, here I took with the K. I want to keep my Q on the white squares, to be able to get quickly in front of the opp. K. I didn't get a clear idea on which is better, but here I played conventionally...",
        "11. Qxd2 Bxe5 12. dxe5": "I gave up the attack on the b7 pawn. It is defendable, and I want to go for the K.",
        "12... f5": "Here, the position was so \"yummy\" that I didn't choose the right continuation. Bg5 had to come FIRST. ",
        "13. h5": "? Open the g column was very important. True he can take with the R, but there's no damage in it, since I can play then Bd6. I missed it in this game, and this was very costly. ",
        "13... Be8 14. g5": "?? Throwing away the game.",
        "14... Bc6 15. Qd4": "Now, I realize too late that I will have to manage a way to avoid the pawn's chain to be formed in front of his K. I'll have to sac a piece. Now, the bad B move allows me to occupy this central square, one-step to the Kside, with no loss of tempo dued to Nc6 or c5. Fortunately, my opponent is not a proficient attacker!",
        "15... Nd7 16. Bg3": "...the plan is Bh4-g6. A simple one, but the very one I can figure out!",
        "16... Qe8 17. Be2": "Bd6... but I have no way of forcing the opening of the white diagonal. I plan to sac it on h5!",
        "17... b6 18. h6 g6": "In order to create at least some pressure, I have to reinforce the h column. In order to do that, I have to move the Q, but I don't want him to take advantage of d5 and the discovered threaton Rh1, so...",
        "19. Rh2 Bb7": "He prepares c5, but my Q is ready to fly to the K side. But all the point is that I dont' have any break in, NOT EVEN with the B sac! And I overlooked that.",
        "20. O-O-O": "I know I'm castling into his storm, but I had the idea I could break in somehow. ",
        "20... c5 21. Qh4 a6": "? Fortunately, my op is taking the slow way. ",
        "22. Rdh1": "?? Forgetting about d4. ",
        "22... b5": "Forgetting about d4!",
        "23. Qf4": "I realize that if I want to get something out from the lsb's sac, I have to protect it with the R, not the Q. ",
        "23... c4": "?? Stopping himself from winning the game. ",
        "24. Bh5": "Well, let's see. How do I miss a N, now!",
        "24... gxh5": "First step accomplished. ",
        "25. Rh2xh5": "Now, I have to manouver in order to have the Q on the g column, or a R, even better. But...",
        "25... Qg6": "He blocks everything with this one. Now, his Q will be dued to this post, defending a lot of weak points. I have no way to break in. My dsb is almost useless, so are my R, and I am a piece under... for nothing. \"Well done, Davide!\"",
        "26. Qd4": "Preventing some nasty moves by black, but without hope.",
        "26... Rfc8": "Nc5 is coming.",
        "27. Bf4 Nc5 28. f3": "I'd be glad to have his powerful N exchanged for my useless lsb. ",
        "28... a5 29. Rh5h2": "Necessary, in order to move the other R.",
        "29... b4": "His Q can' participate into the attack, but he doesn't need it!",
        "30. Rc2 bxc3": "? Better was a4, increasing the pressure. ",
        "31. Rxc3": "I'm busted after Na4, but black can calmly prepare even more with a4.",
        "31... a4 32. Kd2": "Making R for my K. I realize that the cost for have his Q blocked is... my Rh1 can't leave his post without allowing a deadly Qh5's penetration. ",
        "32... Nd3": "Threats b2. ",
        "33. Rc2": "Allows c3+.",
        "33... Rc7": "He chooses to delay it, reinforcing the power on the c column for the killing. ",
        "34. Qb6": "Not really good, but it prevents Nb4 and threats the lsb if the R moves. Not a big deal, I know. At least, his Q is still completely blocked, while I threat e6 (how do I miss a N, again!).",
        "34... Rac8 35. Kc3": "!? This is \"the blockade game\". Now my Q can be trapped if I am not careful!",
        "35... Ba8 36. Qa5": "He can play a R on the b column, but Rb7 looks ugly. ",
        "36... Bc6": "The key of my defence is not to move any pawn, and let him find the way - if any - to break in. Of course, all this won't have held against a correct attack. We both failed in ours.",
        "37. Rh3": "Having black \"forgotten\" to play d4+, I take some measures against it, too. ",
        "37... Be8": "Black tries to free his Q.",
        "38. Qb6": "Preventing a T to go to the g column for free...",
        "38... Qf7": "? No, sir, you hurried up!",
        "39. g6 hxg6 40. h7+ Kh8 41. Bg5": "! And I win his Q. ",
        "41... d4+ 42. exd4": "? Cutting my Q's way out of troubles...",
        "42... Rc7c6 43. Bf6+ Qxf6 44. Qxc6": "I'll get the exchange from it... sigh!",
        "44... Rxc6 45. exf6 Nf4 46. Rh6": "? Better was Rg3, giving away the h pawn for Rh2+.",
        "46... Nd5+ 47. Kd2 Bf7": "Nxf6 was better. True he always has it. ",
        "48. b3": "Both my R and his B are frozen... again!",
        "48... Nc7": "I'm lost anyway, but he has very few seconds on the clock. This is a bold mistake.",
        "49. bxa4": "My pawns wil fall, but let's keep him busy!",
        "49... Ne8 50. Rc3 Nxf6 51. a5 Ne8 52. a6 Nc7 53. a7": "If the R leaves the c column, I can play Rxc5 (e5, RxNc7)",
        "53... Na8": "...preventing that, but allowing interesting possibilities for me...",
        "54. a4": "Keep him busy and force him out of the c column, even for bad.",
        "54... Rc7 55. a5 Rxa7 56. Rxc4 Re7": "He realized he can't play Rxa5 orRc8+ wins. ",
        "57. Rc8+ Re8 58. Rc5": "Protecting against d5.",
        "58... g5 59. a6": "Black is looking at the board and he can't believe it: white is fighting back!",
        "59... Kg7": "Desperado move - it was almost a zugzwang! Now it's my chance!",
        "60. h8=Q+ Rxh8 61. Rxh8 Kxh8 62. Rc8+ Kg7 63. Rxa8": "...and this is a winning endgame... for white! Incredible. I hope you enjoyed, despite the bad moves and the missed chances from both sides, the weird blockades from both sides through the game. Thanks for commenting. "
    },
    "url": "https://gameknot.com/annotation.pl/break-in-if-you-can?gm=63125",
    "gameName": "Break in, if you can!",
    "players": "damafi (1439) vs. D2Einar (1389)",
    "opening": "Queen's pawn, Mason variation (D00)"
}