{
    "moves": {
        "1. d4": "I am usually at a loss when trying to create a pawn storm.  Should it be a single mayhem-maker, or a time-consuming swarm?  This time, a swarm seemed to work.  I was proud to play this deeply into a territorial battle, against a much higher-rated opponent here. I play white, and comments most welcome!",
        "1... Nf6": "I open with my usual, but don't get the usual reply.",
        "2. c4": "I continue with my usual, regardless.",
        "2... b6 3. Bg5": "I'm stabbing in the dark here for an appropriate move that takes advantage of the space.  Is this any good?  (Comments welcome!)",
        "3... Bb7": "For the next few moves, both sides develop freely, basically ignoring each other it seems.",
        "4. Nf3 d6 5. Nc3 e6 6. e3 h6": "Contact at last.  I don't mind this bishop getting chased, and the opposing king side getting blown open in the process.",
        "7. Bh4 g5 8. Bg3 Nbd7 9. h3": "Providing an escape squre for the DSB and limiting the Nf6 simultaneously.  It was not necessary until h5 was played, but this is one of those quick blitz moves that seems to serve my clock management well.",
        "9... Qe7": "Black continues development, but this move seems very quiet.  A kingside breakthrough must be played, and time is of the essence.",
        "10. Bd3": "Of the two options available to the bishop, this one seemed better, with more scope, but it doesn't look spectacular there, does it?",
        "10... O-O-O 11. O-O": "Battle lines drawn.  Neither side has a foothold in the opposing territory, and space is roughly equal.  Which side is better? Comments?",
        "11... Kb8": "Seems like a waste of time to me.  This move can be made if the a pawn is threatened by the N or Q, but as it is this gives white the initiative.  What is best here?  I tried...",
        "12. b4": "This move, but I was stabbing in the dark.  As I said, I get the idea of a pawn storm, I just don't know how to make one work in a time-efficient way.  However, I felt that there was some time to spare here--I felt that my kingside defences were relatively resilient, and took the time to complete a full-on pawn storm.",
        "12... d5": "?  Did Black push the wrong pawn here?  This move blocks his finacetto bishop, although I suppose  12...e5 can be met by  13. d5 and the result is the same.  Perhaps 12...Nh5 followed by f5 and attempting a kingside breakthrough was a better plan for black.  As it is, this allowed...",
        "13. c5": "...and his finacetto bishop is out of the game, while my DSB is looking great, and the pawns are starting to do their job.",
        "13... Ne4": "Strong.  14. Nc3xNe4 is impossible due to 14...dxNe4 forking the B and N.  The N on c3 is hanging, so it must be protected or moved, and I must accept doubled pawns on the g file.",
        "14. Qc2": "Perhaps Nb5, with the possibility of Qa4 to follow and threats on a7, was possible?  But after a6 the N would be forced to the rim.",
        "14... Nxg3": "Black opts to double my pawns.",
        "15. fxg3": "The king side is less solid now, and the mighty DSB is off the board, but I have an open file for my rook in exchange.",
        "15... Bg7": "Black must develop, but options are limited.",
        "16. a4": "All my moments of initiative are spent advancing pawns.",
        "16... Rdc8": "A decent idea, I guess, putting the rook on the file that looks likely to open, in line with my queen.  But I am now under little pressure, and though I could afford to walk out of a potential pin on the Nc3 if necessary, so I forged ahead.",
        "17. a5": "Here it is--the sledgehammer approach to a kingside breakthrough, attacking the strong pawn twice.",
        "17... c6": "Interesting defense, creating an escape square for the K.",
        "18. axb6 axb6 19. Qa4": "Without a clear plan, I slam the queen onto the a file.",
        "19... Kc7": "Now I'm flummoxed.  How to proceed?",
        "20. b5": "I tried this.  Other options?",
        "20... Rca8": "Black tries to diffuse the situation, taking the rooks off the board.",
        "21. Qb3 Rxa1 22. Rxa1 Ra8 23. Rxa8 Bxa8 24. bxc6": "This was my try.  Was it best?",
        "24... Bxc6 25. Nb5+": "I try to create some mayhem.",
        "25... Kd8": "? Was BxN better?  I think allowing this N to advance was the losing move.",
        "26. Nd6": "This looked like a fantastically annoying outpost for the N, but in fact 26. Na7 was better, threatening both NxB and cxb",
        "26... e5": "Black fights desperately for space, but I don't think this works.",
        "27. dxe5": "Now I threaten cxb as the Nd6 is protected ",
        "27... Bxe5": "?  This drops the bishop.",
        "28. Nxe5": "The N is untouchable due to the royal fork, but in the heat of blitz, this went unnoticed.",
        "28... Qxe5 29. Nxf7+": "Black resigned.  Comments welcome!"
    },
    "url": "https://gameknot.com/annotation.pl/breaking-through-the-opposite-castle?gm=44249",
    "gameName": "Breaking through the opposite castle",
    "players": "benrous1  vs. Worthy Opponent ",
    "opening": "Queen's Indian accelerated (A50)"
}