{
    "moves": {
        "1. e4 e5 2. Nc3 Nf6 3. g3": "Paulsen's move, popularized by Mieses about this time. It is excellent against 2... Nc6 but not against blacks last move, which allows 3... d5!",
        "3... Bc5 4. Bg2 O-O 5. Nge2 d6 6. O-O Nc6 7. d3 Be6": "Looking for ... d5 which white prevents with",
        "8. Nd5": "!",
        "8... Bxd5": "Otherwise a pin at g6 becomes annoying. ",
        "9. exd5 Ne7": "Now white has the bishop pair. ",
        "10. Bg5": "!\nNot c4 which surrenders d4 to Black. And neither knight can capture due to the threat from g2 and the resulting pin from g5. ",
        "10... Nd7 11. d4 exd4": "11... Bb6 12. dxe5 dxe5? (to keep control of d4, safer would be 12... Nxe5.) \n13. d6 cxd6 14. Qxd6  - ",
        "12. Nxd4": "A nice outpost for the knight. ",
        "12... h6 13. Be3 Ne5": "Better is 13... Nf6 then if 14. c4 Qd2 followed by ... Nf5",
        "14. Qe2 Qd7 15. h3 Rae8": "Nf5 was better, exchanging to relieve Black's cramped position; this dictum was not generally known at this time however. ",
        "16. Rae1 a6": "16... Qa4 does no immediate good as the Queen could be trapped after 17. b3! Qxa2? 18. Ra1 Qb2 19. Rfb1 (or Qd2) Qc3 20. Nb5 Qb4 21. Ra4",
        "17. f4 Ne5g6 18. Qf2": "Preventing Nf5 which would be followed by NxN then BxB winning a pawn. ",
        "18... Bxd4": "Black has few options in view of the previously mentioned threat. If Qa4 then b3! and the Queen must retreat or be trapped again after Qxa2? Ra1 Qb2 Qd2!",
        "19. Bxd4 Nf5 20. Bc3 Rxe1 21. Rxe1 Re8 22. Bf3 Rxe1+ 23. Qxe1": "Lasker comes out of the opening and middle game with a decided advantage. The bishop pair and key space control give black a hard position. ",
        "23... Nfe7 24. Kg2 Qa4": "Tempting for Black but the better policy would be to mark time. ",
        "25. Qd2 Qxa2 26. Qd4 f6": "If instead 26... Nf5 27. Qe4 with two winning variations after either 27... Nge7 or 27... Nfe7 ",
        "27. Qe4 Qb1 28. h4": "with the threat of h5 ",
        "28... Kf8": "Forced.",
        "29. Bh5 f5": "Also forced. ",
        "30. Qd4": "! Not 30. Qe6 Qxc2  31. Kh3 Qe4 and all of a sudden White is playing for a draw. ",
        "30... Qxc2+ 31. Kh3 Qe4 32. Qxg7+ Ke8 33. Bxg6+ Kd7": "Not Nxg7 after which White can force a trade of Queens after 34. Qxg7  Kd7 35.Qf7  Kc1 36. Qe6  ... ",
        "34. Bxf5+ Qxf5+ 35. Qg4 Qxg4+ 36. Kxg4 Nxd5 37. Bd2 Nf6+ 38. Kf5 Ke7 39. g4 d5 40. g5 hxg5 41. fxg5 Nd7 42. g6 Kf8 43. h5 d4 44. h6 Kg8 45. h7+ Kh8 46. Ke6 Nf8+ 47. Kf7": "1-0 Black Resigns. "
    },
    "url": "https://gameknot.com/annotation.pl/breslau-1889?gm=17218",
    "gameName": "Breslau 1889",
    "players": "Lasker  vs. Lipke ",
    "opening": "Vienna (C26), Paulsen-Mieses variation"
}