{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Bb5 a6 4. Ba4 Nf6 5. d3 d6": "All book so far.",
        "6. c4 g6 7. d4 exd4 8. Nxd4 Bd7 9. Nxc6 bxc6 10. O-O Bg7 11. c5 O-O": "With both players castled, the opening is finished and the interesting part of the game begins.",
        "12. Nc3 Qe7 13. cxd6": "An interesting choice, undoubling the Black QB Pawns.",
        "13... cxd6 14. f3 d5 15. Re1 d4": "Forcing Duras' Knight to retreat.",
        "16. Ne2 c5 17. Nf4 Be6": "Pressuring the Q-side.",
        "18. b3 Rfd8 19. Nd3 Bd7": "Forcing the exchange of Bishops.",
        "20. Bxd7 Nxd7": "Uncovering his fianchettoed B, which now commands the long diagonal.",
        "21. Ba3 Rac8": "Intending to push the Q-side Pawns.",
        "22. Rc1 Bf8": "Defending the QBP, which supports the valuable passed QP.",
        "23. Qd2 Qh4": "Threatening ...B-Q3 followed by ...QxP ch.",
        "24. g3 Qh5 25. Kg2 c4": "Pressing forward.",
        "26. Nf4 Qe5": "Intiating an aggressive sequence.",
        "27. Bxf8 c3": "Now he has 2 connected passed Pawns.",
        "28. Qd3 Nxf8 29. Nd5": "Duras intends to counterattack.",
        "29... Rxd5 30. exd5 Qxd5 31. Red1": "Both players are locked in on Cohn's passed Pawns.",
        "31... Ne6 32. Qxa6": "Now Duras has 2 connected passed Pawns of his own.",
        "32... Ra8 33. Qe2 d3": "Sacrificing the Pawns in order to get his Rook on the 7th rank.",
        "34. Rxd3 Qg5 35. Qe3 Rxa2+": "The game hangs in the balance. Cohn plays for a mating attack.",
        "36. Kg1 Qh5 37. h4": "Blocking the Queen's attack route.",
        "37... Qf5 38. Rdxc3 Qh3": "Threatening ...Q-N7 mate.",
        "39. Rc3c8+": "Duras has to make forcing moves of his own. ",
        "39... Kg7": "Trying to find refuge from the checks so he has time for ... Q-N7 mate.",
        "40. Qe5+": "Continuing to check.",
        "40... f6": "Defending with tempo: an attack on the Queen.",
        "41. Rc1c7+": "Continuing the pressure.",
        "41... Kh6 42. Qe3+": "Forcing Cohn to interpose.",
        "42... g5 43. hxg5+": "The critical juncture. 43... PxP! draws the game. ",
        "43... Nxg5": "The losing move. Duras now unleashes an incredible winning combination.",
        "44. Rxh7+": "With the Knight pinned, Cohn has no choice.",
        "44... Kxh7": "Foced if he wants to preserve his Queen.",
        "45. Qe7+": "With Cohn still having a mate in 1 if Duras lets up for a moment, Duras presses the attack.",
        "45... Kg6": "One again, the only move to avoid losing the Q.",
        "46. Rg8+": "Relentlessly forcing the King into the danger zone.",
        "46... Kf5": "Now the White Pawns further restrict the K.",
        "47. Rxg5+": "This brilliant sacrifice caps Duras' remarkable winning sequence. If Cohn tries 47... PxR, 48 Q-Q7 ch wins the Q and the game. So...",
        "47... Kxg5": "...Cohn plays this move instead.",
        "48. Qg7+": "Cohn resigns. If his King moves to the KR file, 49 Q-R8 ch wins the Q. If he plays 48... K-B4, 49 Q-Q7 ch wins the Q. An incredible attacking sequence by Duras to conclude a remarkable game by both men."
    },
    "url": "https://gameknot.com/annotation.pl/brilliancy-prize-karlsbad-1911?gm=37089",
    "gameName": "Brilliancy Prize, Karlsbad 1911",
    "players": "Oldrich Duras  vs. Erich Cohn ",
    "opening": "Ruy Lopez (C77), Morphy defence, Duras variation"
}