{
    "moves": {
        "1. e4": "Just to explain the time limit - it was 40 moves in 90 minutes each, after which 30 minutes is added the first time a player runs out of time. There is also a 30 second increment per move.",
        "1... c5": "This time I couldn't really prepare as he sometimes plays 1. d4 or 1. c4.",
        "2. Nc3": "He opts for a Closed Sicilian.",
        "2... Nc6": "The most popular reply.",
        "3. g3": "Quite a common way to handle this. I am already thinking a few minutes on my reply.",
        "3... g6": "I opt for this.",
        "4. Bg2": "He completes the fianchetto.",
        "4... Bg7": "As do I.",
        "5. d3": "He continues to develop.",
        "5... e6": "More common is d6, but this is perfectly playable.",
        "6. Be3": "He attacks my c pawn.",
        "6... b6": "6... d6 planning a6 and b7-b5 is more normal, but this got him thinking!",
        "7. Nf3": "He decides to open up the game.",
        "7... Nge7": "I develop.",
        "8. d4": "And he does his central thrust. I was quite surprised here that in previous games in this position, black had simply castled. I am not sure why white can't just take twice on c5 in that case. I was also afraid of allowing d4-d5 so I took!",
        "8... cxd4": "Like so.",
        "9. Nxd4": "And he took back.",
        "9... a6": "I was afraid of him playing Nd4-b5 threatening to go to d6.",
        "10. Nxc6": "He takes.",
        "10... Nxc6": "I have to take back this way. If I take with the queen he exchanges queens and then takes on b6.",
        "11. f4": "Threatening e5 followed by Ne4.",
        "11... d6": "So I stop that.",
        "12. e5": "He advances anyway.",
        "12... d5": "And I block things up.",
        "13. Na4": "Attacking b6.",
        "13... Rb8": "Defending b6",
        "14. c4": "trying to open up the centre.",
        "14... b5": "I want to divert that c pawn.",
        "15. cxd5": "He takes.",
        "15... Nxe5": "I play this, rather than allow him a strong passed pawn on c6 if I had played 15....b x a4 16. d x c6 ",
        "16. fxe5": "And white, running low on time offered a draw which I immediately accepted. Many thanks for reading. Please leave a comment or two and rate the annotation on the star system, so I know how I am doing. Until next time dear reader!"
    },
    "url": "https://gameknot.com/annotation.pl/british-over-50s-championship-round-2?gm=63331",
    "gameName": "British Over 50s Championship Round 2",
    "players": "Donald J Mason (2129) vs. Charles Higgie (1915)",
    "opening": "Sicilian (B24), closed, Smyslov variation"
}