{
    "moves": {
        "1. d4": "Hi everyone!\r\n\r\nMy 30th game with Master Freddy and still no luck.  Freddy springs on me another unusual opening, this time called The Bronstein Gambit after he kicks off with 1. d4.",
        "1... Nf6 2. g4": "2.  ..... g4 - here is the Bronstein Gambit, looking to get a rook on g1 putting pressure on the g file should Henry castle there perhaps?",
        "2... Nxg4 3. e4": "3. e4 - Freddy now grabs the centre after I decide to accept the gambit.",
        "3... d6 4. Nf3 e5": "4. ...... e5 - I now contest the centre, looks a bit like a Philidor's Defense.",
        "5. h3 Nf6 6. Nc3": "6. Nc3 - protecting the e4 pawn.",
        "6... exd4 7. Nxd4": "7. Nxd4 - pawn trade.",
        "7... Nc6 8. Be3 g6 9. Qd3 Bg7": "9. ..... Bg7 - Fou Lenoir develops on the long a1-h8 diagonal.",
        "10. O-O-O Nxd4 11. Bxd4": "11. Bxd4 - knight trade.",
        "11... O-O 12. f4 Bd7 13. Bg2 c5": "13. ...... c5?! - this move chucks away my material advantage and gives Freddy a big edge.",
        "14. Be3": "14. Be3 - just look at that d6 pawn my friends.",
        "14... Ne8 15. a3": "15. a3 - I was expecting Bxc5 here given that the bishop on d7 is only defended once, and you will only need one guess as to just who is defending it!  Still, Freddy must have something else up his sleeve.",
        "15... Qb6": "15. ....... Qb6 - Glenda defends that c5 pawn but also puts pressure on b2.  If that c3 horsie should move away next turn ......",
        "16. e5": "16. e5 - here is another move I was dreading though, I cannot take the e5 pawn because that will be the end of Fou Leblanc on d7.  Fou Leblanc challenges his counterpart on the h1-a8 diagonal.",
        "16... Bc6 17. Nd5 Bxd5 18. Qxd5": "18. Qxd5 - a piece trade and now the Wicked Witch of the West burrows into my position.  I now protect the b7 pawn.",
        "18... Rb8 19. c3": "19. c3 - blocking off that diagonal - see my previous note.",
        "19... Nc7 20. Qxd6 Qxd6 21. exd6 Na6": "21. ...... Na6?? - Freddy has regained his pawn, now I make a wrong choice with a knight move, in hindsight e6 would have been better.  Ten moves down the line I am gonna get Freddied again!  Now how could this happen?  Henry looks safely tucked away on the kingside does he not?",
        "22. f5": "22. f5 - aha - this move changes the above perception!",
        "22... gxf5 23. Rhg1": "23. Rhg1 - what did I say earlier, my friends about a rook going to g1 bearing down that open g file?",
        "23... h5 24. Bd5 Kh7": "24. .... Kh7 - trying to unpin Fou Lenoir.",
        "25. Rg5 Rfd8 26. Rxh5+": "26. Rxh5+ - the weak h5 pawn drops off.",
        "26... Kg8 27. Bf4": "27. Bf4 - threatened discovery (d7) so I play Rd7 to stop it.",
        "27... Rd7 28. Rg1": "28. Rg1 - now another rook lands on that g file.  This time Henry unpins by going to f8.",
        "28... Kf8 29. Rh7": "29. Rh7 - nasty.",
        "29... f6": "29. .... f6 - protecting Fou Lenoir but now Freddy dons his black cap yet again and announces # in 2.  Here it comes .....",
        "30. Rh8+ Bxh8": "30. ...... Bxh8 - the only legal move.",
        "31. Rg8#": "31. ..... Rg8 MATE! - another sorry ending for the Beginner with the Class A rating."
    },
    "url": "https://gameknot.com/annotation.pl/bronstein-gambit?gm=26292",
    "gameName": "Bronstein gambit",
    "players": "easy19 (2263) vs. jstevens1 (1829)",
    "opening": "Queen's pawn (A45), Bronstein gambit"
}