{
    "moves": {
        "1. e4 c5 2. Nf3 Nc6 3. c3 g6 4. d4": "I figured he'd play this move at some point. ",
        "4... cxd4 5. cxd4": "Yes, he does have a classical center. *But* I haven't yet moved my central Pawns, so I can use them at my leisure to break it down, in Hypermodern style.",
        "5... Bg7 6. d5 Ne5": "No point in retreating when I can centralize my Knight nicely.",
        "7. Nc3 e6": "My brother saw a tactical opportunity to deprive me of the castling privilege -- but, as the Queens come off the board in the process, it will make it harder for him to exploit this with an attack. His Q will be gone and his Rooks stuck in the corners.",
        "8. dxe6 dxe6 9. Qxd8+ Kxd8 10. Bf4": "If he had played B-N5 ch, I was prepared to move my King again, but he elected this move instead. Now I seize a tactical chance to make his King remain exposed even if he does castle by breaking up his K-side Pawns.",
        "10... Nxf3+ 11. gxf3 Ne7 12. Bb5": "I can't let this B command this diagonal, so...",
        "12... a6 13. Ba4 b5": "Now he's cut off and forced to retreat.",
        "14. Bb3 Bb7 15. Rd1+": "O-O-O ch may have been better, as the K could eventually seek shelter behind the 2 Q-side Pawns.",
        "15... Ke8 16. Bc2 Rc8": "Activating *one* Rook. Both KR's are still relatively useless.",
        "17. Bd2 f5 18. Bb1 Kf7": "Now my Rooks are connected and I can activate my KR, plus my K is in as safe a position as exists on my side of the board.",
        "19. Rc1 Rhd8 20. Bg5 Bxc3+ 21. bxc3": "In return for the minor exchange, I cripple kid bro's Pawn position. With the endgame stage on us, I feel it's worth it.",
        "21... Rd7 22. O-O Rdc7": "Focusing my fire on the weakling.",
        "23. Bd2 e5 24. Rfd1 f4": "Restricting his QB's freedom of movement.",
        "25. a3 Ng8": "I was going to reposition this Knight, but my kid bro, on the defensive, decided to play for a draw...",
        "26. Ba2+ Kg7 27. Bxg8 Kxg8": "...by creating an ending with opposite-colored Bishops. ",
        "28. Rc2 a5 29. Rdc1 Rc7c4 30. Rb2 Ba6 31. Rbb1 Rc8c7 32. Kg2 g5": "Some positional maneuvers...",
        "33. Kg1 Rb7 34. h3 h5 35. Kg2 Kg7 36. Kh2 Kg6 37. Kg2": "Draw agreed. I can't see any way to force a breakthrough, as he can blockade on the dark squares and with OCB's I have no way to counter it."
    },
    "url": "https://gameknot.com/annotation.pl/brothers-game-2?gm=36137",
    "gameName": "Brothers, game 2",
    "players": "My brother  vs. Hellion ",
    "opening": "Sicilian defence (B30)"
}