{
    "moves": {
        "1. d4": "Hi everyone!\n\nIt has been quite a while since my last annotation but I have found time to annotate this game.  It was a Modern Benoni MT and in the middle game, Bwaa, who will be referred to as Bwaa because he has the same Christian name as my king, lost a pawn.  It was not very easy to make headway but, there was a sudden twist at the end.  We got into an endgame in jig time but there were enough pieces left on the board for Old Matey, the Chessic Grim Reaper to have a say in the matter.  Bwaa had put up his vacation flag to say that he had gone away for a long weekend and his queen travelled with him in his suitcase!  When they returned to the battlefield they were in for a shock for they discovered a very unwelcome intruder indeed.  I think I had better let you guys read on to find out who the intruder was and what happened next.  I will start the game after 5. ..... d6 which is the end of the themed moves.",
        "1... Nf6 2. c4 e6 3. Nc3 c5 4. d5 exd5 5. cxd5 d6 6. e4 g6": "6. ..... g6 - preparing for a kingside fianchetto.",
        "7. f4 Bg7 8. Bb5+ Nfd7": "8. ...... Nfd7 - this seems a strange move as it moves an already developed piece into a blocking position.  Here it not only blocks a check but it also blocks in Fou Leblanc.  However, it is one of the most recommended moves in the World DB so there is some deeper reason behind this.  Aha, it does open up the possibility of a queen check on h4 and the long diagonal for Fou Lenoir which may come in useful later on.",
        "9. a4 O-O": "9. ..... 0-0 - Henry is tucked away on the kingside and there is a possibility of Re8 hitting at my pawn on e4.",
        "10. Nf3 Na6 11. O-O": "11. 0-0 - hmm, I expected Bxa6.",
        "11... Nc7": "11. .... Nc7 - so as Bwaa has declined this B for N exchange my knight pops the question to his bishop.  The bishop retreats.",
        "12. Bd3 a6": "12. ..... a6 - preventing further encroachment of a white piece on b5.",
        "13. Bd2 Rb8 14. a5 b5 15. axb6 e.p. Nxb6": "15. ....... Nxb6 - so a pawn trade has taken place.  My a pawn is isolated but then so is bwaa's b2 pawn.",
        "16. Ra2 Bb7": "16. .... Bb7 - finally Fou Leblanc clears the back decks.",
        "17. Be1 Re8": "17. ...... Re8 - finally I play that rook move I mentioned earlier.",
        "18. Kh1 Kh8 19. Bh4 Qc8 20. Nb1 Nb5": "20. ..... Nb5 - after a bit of scratching around I decide to improve the position of my queen knight.  If he takes this knight with his bishop it reunites my queenside pawns.",
        "21. Qd2 Nd4": "21. ...... Nd4 - outpost.",
        "22. Na3 Qg4": "22. ..... Qg4 - out comes Glenda to probe white's defences.",
        "23. Qf2 Nxf3 24. gxf3 Qxf4": "24. ...... Qxf4 - after a knight trade, Glenda snatches a white pawn.",
        "25. Bg3": "25. Bg3 - nacht!",
        "25... Qf6 26. Bc4 Qd8": "26. .... Qd8 - not NxB, BxN making my d6 pawn an indefensible target.",
        "27. b3 Qd7 28. Re2 Rbd8": "28. ..... Rbd8 - preparing to hand over the defense of the d6 pawn to a lower value piece.  As usual Glenda has a knack of being called upon to defend vulnerable pawns, hence her title Glenda the Defender.",
        "29. Rfe1 f5": "29. ...... f5 - inviting a series of trades to relieve pressure on the e column.",
        "30. Nc2 Nxc4 31. bxc4": "31. bxc4 - after the queen knight has ceased to control c4, I now make the exchange.",
        "31... fxe4 32. Re2xe4 Rxe4 33. Rxe4": "33. Rxe4 - and so one set of rooks is now exchanged.  I now anticipate and prepare for a move such as Re6 by moving Fou Leblanc back to c8.  Now, how many people think that the WK is as safe as houses here?",
        "33... Bc8 34. Re6 Qa4": "34. ...... Qa4 - a counter-attack with hidden menace.",
        "35. Rxd6 Rxd6 36. Bxd6 Qxc4": "36. ..... Qxc4 - it looks as though Glenda is gonna snap off the passed d5 pawn on the next turn, does it not?  Well, that may be the ultimate intention but there is a darker one which bwaa overlooks as he now goes away on vacation and .......",
        "37. Qxc5": "37. ....... Qxc5?? - yup, I expect you are wondering - why two question marks for this move.  It defends his knight on c2, his pawn on d5, but, alas for bwaa, the Wicked Witch of the West has gone away on vacation with bwaa on her broomstick.  Now, on their return they are about to confront that unwelcome intruder who is ...........",
        "37... Qf1+": "37. ...... Qf1 CHEEEECK!  ...... none other than GLENDA!",
        "38. Qg1 Qxf3+": "38. ...... Qxf3+ - Glenda now bags one small item of jewellery.",
        "39. Qg2 Qd1+": "39. ...... Qd1+ - once the Witch goes to b1 there is a very tempting much bigger piece of jewellery on c2.  But wait, Glenda now sees her chance to go for the crown jewels!",
        "40. Qg1": "40. Qg1 - time to set the conditional moves, wait for it .......",
        "40... Qxd5+": "40. ...... Qxd5+ - wait for it ......",
        "41. Qg2 Qd1+": "41. ..... Qd1+ - wait for it .......",
        "42. Qg1 Bb7#": "42. ..... Bb7 MATE!! Yup, the innocuous Fou Leblanc returns to the a8-h1 diagonal to administer the last rites to King Bwaa.  The Witch is pinned to her other half and cannot block the check and therefore, despite it being an endgame, Old Matey has the final say here.  I am now playing two games with the white pieces against bwaa and I must play very well as he once got very close to becoming a Class A player himself in order to avoid him getting double revenge on me!  That's all for now folks - bye for now - Joanne"
    },
    "url": "https://gameknot.com/annotation.pl/burgled-on-vacation?gm=53898",
    "gameName": "Burgled on vacation!",
    "players": "bwaa (1723) vs. jstevens1 (1834)",
    "opening": "Nimzo-Indian defence (E20)"
}