{
    "moves": {
        "1. e4": "Hi everyone, tea break over and time for a long evening session.  Luckily I manage to overcome fatigue and drive home with 2.5 points already in the bag.",
        "1... c5 2. f4": "2. f4 - this is the Scilian Grand Prix.  I used to experiment with this against the Sicilian a lot in my OTB games.  I played it once on gameknot and was a pawn up against a 1600  player when he timed out on me.",
        "2... d6 3. Nf3 Nc6 4. d4 cxd4 5. Nxd4 Nf6 6. Nxc6 bxc6": "6. ................... bxc6 - now we have the usual exchange on c6 - as it does not have a good record in the database I have refrained from this exchange since playing on gameknot.",
        "7. Nc3 Qc7 8. Be3 g6": "8. ............ g6 - transposes into a Dragon.",
        "9. Bd3 Bg7 10. f5 O-O 11. O-O Bb7 12. Kh1": "12. Kh1 - after both sides complete their development, Henry again sidestepps the possibility of a queen forking check on b6.  Ron decides to centralise his king rook.",
        "12... Rfd8 13. Qd2 Nd7 14. fxg6 fxg6": "14. ............. fxg6 - at last the pawn formation around the black king is disturbed.",
        "15. Bc4+ Kh8 16. Bg5": "16. Bg5 - I wonder whether Rf7 was better here.",
        "16... Ne5 17. Be6 a5 18. Qe3 Ba6 19. Rf2 Ng4": "19. .................... Ng4?? - overlooks my bishop hiding on e6 and loses a piece.  At least I have taken full advantage here!",
        "20. Bxg4 Rab8 21. Rb1 Rdf8 22. Rxf8+ Rxf8 23. Bh6 e5 24. Bxg7+ Qxg7": "24. ............... Qxg7 - off come the bishops - I am trying to simplify down to a won endgame.",
        "25. Be2 Bb7 26. Kg1 d5 27. exd5 cxd5 28. Qb6": "28. Qb6 - an aggressive move for Glenda the Defender!  The a5 pawn is attacked.",
        "28... d4 29. Na4 Qf7 30. Rf1 Qd5": "30. .............. Qd5?? - threatening Old Matey on g2 but I can take the rook on f8 with check!",
        "31. Rxf8+ Kg7 32. Qf6+ Kh6 33. Bf3": "33. Bf3 - defends against the mate.",
        "33... e4 34. Qf4+ Kg7 35. Bxe4 Qxe4 36. Qxe4 Bxe4 37. Rc8": "37. Rc8 - I am now a whole rook up but my opponent refuses to wave the white flag.  Mind you, again my time management is letting me down, I have 3 moves to make before the time control and I have less than 5 minutes on my clock. It is 40 moves in an hour and a half and then 15 minutes is added on when the time control is met.  Anyone who fails to make 40 moves in an hour and a half or whose flag falls at the end of the 15 minutes added on will forfeit the game on time.",
        "37... Kf6 38. Rc4 Ke5 39. Rc5+ Kd6 40. a3 h6 41. b4 axb4 42. axb4 Bc6 43. Kf2": "43. Kf2?? - I quickly centralise my king but overlook the fact that my knight is hanging.  I only just managed to make my 40th move before my flag dropped so I have just under 15 minutes to make all my moves, hence the blunder.",
        "43... Bxa4 44. Ke2 Bc6 45. g3 Be4 46. Kd2 h5 47. c3 dxc3+ 48. Kxc3 Bf5 49. Ra5 Kc6 50. b5+ Kb6 51. Kb4 Bc8 52. Ra6+": "52. Ra6  - this simplification sacrifice will restore material equality but see my note to move 56.",
        "52... Bxa6 53. bxa6 Kxa6 54. Kc5 Kb7 55. Kd5 Kc7 56. Ke6": "56. Ke6 - and due to the fact that my king could gobble up his pawns before his could gobble up my own, Ron threw in the sponge.  I feel as though I can sleep well tonight knowing I have 2.5 points already in the can."
    },
    "url": "https://gameknot.com/annotation.pl/bury-congress-u1400-round-3?gm=17885",
    "gameName": "Bury Congress U1400, Round 3",
    "players": "Joanne Stevens (1240) vs. Ron Valence (1392)",
    "opening": "Sicilian (B21), Grand Prix attack"
}