{
    "moves": {
        "1. e4": "Hi everyone, after a subdued lunch it was time to go back for the final game, this one started out as an Advanced French.",
        "1... e6 2. d4 d5 3. e5": "3. e5 - this move, which puts a cramp on black's centre and prevents Nf6 characterises the Advanced Variation of the French Defence.  Black does get some play for this as you will see.",
        "3... c5": "3. ................... c5 - such as this move, which hits out at the d4 pawn which supports the e5 pawn.  White usually has to tie himself down to defending this pawn as I can pile up on it with Nc6.",
        "4. Bb5+ Bd7 5. Bxd7+ Qxd7": "5. ................ Qxd7 - a rather unusual variant of the Advance French as one pair of bishops is exchanged.",
        "6. c3 Nc6 7. Nf3 cxd4 8. cxd4": "8. cxd4 - this pawn exchange is quite common in the Advanced French.",
        "8... Nge7 9. O-O Ng6": "9. .............. Ng6 - must clear the line of Frere Lenoir to enable Henry to castle on the next turn.",
        "10. Nc3 Be7 11. a3 O-O": "11. ............... 0-0 - now my development is complete both players are entering the middle game.",
        "12. Be3 Rab8 13. Qd3 a6 14. Bg5 Bxg5 15. Nxg5": "15. Nxg5 - now both dsbs are exchanged.",
        "15... h6 16. Nh3 Nce7": "16. ................. Nce7 - this knight comes over to protect the kingside.",
        "17. b3 b5 18. Rfd1 f6 19. exf6 Rxf6": "19. ...................... Rxf6 - now some cramping is relieved as the e5 pawn disappears from the board.",
        "20. Qg3 Rbf8": "20. ................ Rbf8 - sidestepps the Wicked Witch's attack on the long diagonal and doubles up on the half-open f file.",
        "21. f3 Nf5 22. Qf2 Rc8 23. Rd3": "23. Rd3 - defends the knight on c3.",
        "23... Rc6 24. Na2 a5 25. Qd2 Qc7 26. Rc3": "26. Rc3 - challenges the c file and one pair of rooks is now exchanged.",
        "26... Rxc3 27. Nxc3 Nd6 28. Rc1 Qd7": "28. .................. Qd7 - defends b5 pawn.",
        "29. Ne2 Nb7 30. Qc3 Rf7 31. Qc8+ Qxc8 32. Rxc8+ Rf8 33. Rxf8+ Kxf8": "33. ................... Kxf8 - this plethora of exchanges leads myself and Lee into a double knight endgame.",
        "34. Nef4 Nxf4 35. Nxf4": "35. Nxf4 - and now it is down to a single knight ending!",
        "35... Kf7 36. Kf2 Nd8 37. Nd3 Nc6 38. Ke3 g5 39. g3 Kf6": "39. ................ Kf6 - over the last few moves we have been busily centralising our kings.",
        "40. f4 gxf4+ 41. Nxf4": "41. Nxf4 - white takes back with the knight to avoid a pawn split.  White has a pawn majority on the kingside.",
        "41... a4 42. b4 Ne7 43. Nh5+ Kg6 44. Nf4+ Kf6 45. g4 Nc6": "45. .................... Nc6 - I wonder whether Ng6 was a better move here.",
        "46. h4 Ne7 47. g5+ hxg5 48. hxg5+ Kf5": "48. ................Kf5 - if Kxg5 then Nxe6 and then my queenside pawns could fall.",
        "49. Kf3 e5 50. dxe5": "50. dxe5 - here Lee offers me a draw which I accept.  This meant that I scored 3 points out of 5 rounds.  I stayed for the presentation then drove back to Cambridge feeling satisfied with how the second day ended.  Considering that I was out-graded in all five matches 3 points out of 5 is not a bad show.  This has been my most successful congress, although I did manage 3 points out of 6 games in a 30 minutes per side rapidplay in Peterborough the following summer."
    },
    "url": "https://gameknot.com/annotation.pl/bury-congress-u1400-round-5?gm=17888",
    "gameName": "Bury Congress U1400, Round 5",
    "players": "Lee Dorrington (1296) vs. Joanne Stevens (1240)",
    "opening": "French (C02), advance, Steinitz variation"
}