{
    "moves": {
        "1. e4": "Hi everyone, this Rapidplay which took place on 17 September 1996 was the Bury St Edmund's Jamboree where each participant played 3 games of 25 minutes per side.  It was a traditional opener to the Bury League, where various teams in Cambridgeshire and Suffolk would play one another.  There would then be four against four in the Bury League but that is another story.  I won one out of my 3 games and this is the one that I won.",
        "1... e5 2. Nf3 Nc6 3. Bc4 Nf6": "3. ................. Nf6 - this is the Two Knights Defense.  Bc5 would be the Guicco Piano.",
        "4. d4": "4. d4 - and here is the Max Lange attack, challenging black's control of the centre.  This triggers off a plethora of exchanges with me getting a positional advantage.",
        "4... exd4 5. Nxd4 Bc5 6. Nxc6 dxc6 7. Qxd8+ Kxd8": "7. ................ Kxd8 - here is the end of the sequence.  I decide to back up my e pawn with f3.",
        "8. f3 Bb4+ 9. Bd2": "9. Bd2 - I answer black's check by developing a piece.  Sets up a nice little discovery here should I choose to castle long.  If BxB then NxB clearing the way for queenside castling which I think is more appropriate now that the queens are off the board.",
        "9... Bc5 10. Bxf7": "10. Bxf7 - black eschews the bishop exchange but drops a pawn.",
        "10... Rf8 11. Bc4 Re8 12. Nc3": "12. Nc3 - develops and bolsters the pinned pawn on e4.",
        "12... h5 13. O-O-O Rb8": "13. ....................... Rb8 - misses a tactical shot, ready ................. steady ........",
        "14. Be3+": "14. Be3  - GO!! - It has to be said that black could have saved his piece by interposing on d6 but he made another serious error - he blocks it with the knight and I grab the bishop - nice!",
        "14... Nd7 15. Bxc5 b6 16. Bf2 b5 17. Bh4+": "17. Bh4 !! - black must now drop a whole rook - his rook must interpose, black is almost smothered mated!!",
        "17... Re7 18. Bxe7+ Kxe7 19. Be2": "19. Be2 - the bishop must now dodge the b pawn's stab.",
        "19... b4 20. Nb1 c5 21. f4": "21. f4 - threatening to win a pawn by Bxh4.",
        "21... Nf6 22. Bf3 b3 23. cxb3": "23. cxb3 - what is doubled pawns when you are a whole rook up?",
        "23... Rb6 24. h3 g6 25. e5 Nd7 26. g4 hxg4 27. hxg4": "27. hxg4 - these pawn exchanges open up the h file and this will prove lethal to the black king.",
        "27... Rb4": "27. ................... Rb4 - tries to counter-attack by threatening my f pawn, but my king rook has other ideas.",
        "28. Rh7+ Ke6 29. Bd5#": "29. Bd5# - and now Frere Leblanc is the executioner here.  Nice to deliver mate with something other than the queen or the castle."
    },
    "url": "https://gameknot.com/annotation.pl/bury-st-edmunds-rapidplay-old-matey-strikes?gm=17943",
    "gameName": "Bury St Edmunds Rapidplay - Old Matey Strikes!",
    "players": "Joanne Stevens (1240) vs. Tony Malindine (Under 1400)",
    "opening": "Two knights defence, Keidanz variation (C55)"
}