{
    "moves": {
        "1. e4": "My name is Fred Mcgriff, and I'm a retired Baseball professional.",
        "1... c5": "Having just \"read\" The Safest Sicilian by Alexander Delchev with Semko Semkov, I am ready to bring my new knowledge to battle.  The hilarity that ensues will be my woeful regurgitation of this fine GM teaching.",
        "2. Nf3 e6": "With this move I complete the book's subtitle, \"A Black Repertoire with 1.e4 c5 2.nf3 e6\"  Now I am ready to export some pain.  I feel almost omniscient.",
        "3. c3": "Okay I remember ONE THING about c3, according to Delchev and Semkov, and that is, outright attack it!  Kill c3!!!  ",
        "3... Nf6": "I dare you to move that e pawn.  Please move the e pawn.",
        "4. e5": "oh no you didnt!",
        "4... Nd5": "my battle donkey takes a gorgeous slow-motion leap to d5, its sinewy haunches ripple majestically as it evades the deadly attack",
        "5. Bc4": "what??  did you not see the haunches?!",
        "5... a6": "must. kill. c3. at all costs.  I am a blind man with one purpose, to kill c3.  I cannot fail the friendly bulgarian GMs who have bestowed their hard-earned expertise upon me.",
        "6. Bxd5": "white is being annoyingly aggressive.  my battle donkey's proud display of majesty obviously either went unnoticed or defiantly underestimated.",
        "6... exd5": "doubled pawns, it's practically game over now for me.",
        "7. O-O": "harold and kumar",
        "7... b5": "KILL C3",
        "8. d4 b4": "KILL C3",
        "9. dxc5 Bxc5": "I have an answer for almost everything.  I am parrying brilliantly.  My bishop reigns supreme over its g1-a7 diocese.  And Meanwhile, I am inches away from killing C3!",
        "10. Qxd5": "Hmmm.  My rook... but... C3.... but my rook.... but...",
        "10... bxc3": "VICTORY IS MINE!!  C3!!",
        "11. Nxc3": "Well that was short-lived.  Now I have no idea what to do.  I have a rook about to get smashed and I no longer have anything on C3.  Thanks a lot, Delchev and Semkov.",
        "11... O-O": "I castle here.   White can have the rook, I don't care.  I don't even know what to do anymore.  Delchev and Semkov hath forsaken me.  ",
        "12. Qxa8": "It's a trap!",
        "12... Nc6": "Now the greedy fat Queen is trapped in the corner.  You fat, greedy queen.  You are so fat.  Oh my god.  Wow.  Look how fat you are. ",
        "13. Nd5": "I just have to jockey some things around here and then I can take the queen.",
        "13... Qa5 14. Be3": "White is going to lose a lot of material getting out of this mess",
        "14... Qb5 15. Bxc5 Qxc5 16. Rac1 Qxd5 17. Rxc6 dxc6": "And I'm back in business.",
        "18. b3 Rd8 19. Qa7 Bf5 20. Qe3 h6 21. Nh4 Bc8 22. f4 a5 23. f5 Re8 24. Re1 Qd8 25. g3 Qd5 26. g4 c5 27. Kf2 a4 28. Nf3 Bb7": "putting pressure on f3",
        "29. h4 f6 30. e6": "not sure what white's after here... he's got a crisis brewing by his king and chooses to advance the pawns",
        "30... g6 31. e7 Rxe7": "the pawn is no match for my rook.  rook will win that matchup 95% of the time.",
        "32. Rd1": "a trade?  sure",
        "32... Qxd1 33. Qxe7 Qxf3+": "and I'm up a clergyman.  game, set, match, check please.",
        "34. Ke1 Qe4+": "this will rule out any chance of a comeback.  shall we retire?  send us news of our victory.",
        "35. Qxe4 Bxe4 36. fxg6 Bxg6 37. bxa4 Be8 38. a5 Bb5 39. a4 Ba6 40. Kd2": "now the hilarious part is that white waited 2 days, 23 hours, and 59 minutes between each move from here on out.  which is really why i'm annotating this mess.",
        "40... Kf7 41. g5 fxg5 42. hxg5 hxg5": "at this point i had so many conditional moves set up that I didn't have to ever look at this game again, yet he *still* waits 2 days, 23 hours, and 59 minutes between moves",
        "43. Ke3 g4 44. Kf4 c4 45. Kxg4 c3 46. Kf4 c2": "seriously?  I have to spell this out?",
        "47. Ke4 c1=Q": "mornington crescent!  white mercifully resigns."
    },
    "url": "https://gameknot.com/annotation.pl/butchering-the-safest-sicilian?gm=15560",
    "gameName": "Butchering the Safest Sicilian",
    "players": "basil73 (1604) vs. fredmcgriff (1441)",
    "opening": "Sicilian defence (B40)"
}