{
    "moves": {
        "1. Nf3 d5": "Essa costuma ser a resposta mais incômoda",
        "2. g3 g6 3. Bg2 Bg7 4. O-O e6": "As pretas realizam uma série de lances passivos...",
        "5. d3 Ne7 6. Nbd2 Bd7 7. e4 c5 8. Ng5": "Essa jogada foi precipitada, já que o cavalo pode ser facilmente expulso desse posto - embora para tal as pretas tenham que estragar um pouco o seu fianchetto.",
        "8... O-O 9. Ndf3": "Eu estava consciente da possibilidade de ter que recuar o cavalo mais avançado para h3, e isso não me incomodava muito.",
        "9... Qa5 10. Bf4": "Aqui a minha ideia era preparar um avanço do cavalo para e5.",
        "10... Qb4": "Essa ameaça me deixou um pouco confuso. Meu impulso foi o de prosseguir com o meu ataque, ignorando a ameaça ao peão de b2. A ideia seria colocar um cavalo em e5, abrindo caminho para que a Dama tentasse um ataque na coluna h. Eu calculei tudo de modo muito superficial e acabei desistindo. A boa notícia é que eu controlei meus impulsos e decidi pensar antes em uma defesa, mas a má notícia é que a defesa que eu providenciei foi completamente tosca! (b3, perdendo a torre)",
        "11. b3 Bxa1": "Bye bye torre.",
        "12. Qxa1": "Como prêmio de consolação, eu estava controlando uma importante diagonal.",
        "12... Nbc6 13. Bd2": "A ideia não é atacar a dama, mas apenas posicionar o bispo nesse posto: depois que a minha dama for deslocada para f6, o bispo ocupará sua retaguarda, ameaçando mate - mas essa é uma manobra muito lenta!",
        "13... Qb5 14. Qf6 Qa6 15. Bc3": "Pronto, apesar de lenta, a manobra foi permitida pelas pretas. Mas é bem fácil evitar o mate, basta jogar d4, por exemplo.",
        "15... Qxa2": "Um erro grosseiro. Eu discordo dos programadores: um jogador 1350 não cometeria num erro desses.",
        "16. Qg7#": "Gastei menos de 7'."
    },
    "url": "https://gameknot.com/annotation.pl/09?gm=59528",
    "gameName": "#09",
    "players": "Eu (1394) vs. Shredder (1350)",
    "opening": "Reti (A07), King's Indian attack, Pachman system"
}