{
    "moves": {
        "1. d4": "My Usual Opening",
        "1... Nf6": "Black continues with indian defence",
        "2. c4": "Opens lines for queen and and attacks important d5 square",
        "2... e6": "Black could be going for Nimzo Indian defence of queen's indian defence",
        "3. g3": "Idea is to try and control d5 square and avoid indian defences",
        "3... d5": "Good Move because it attacks centre and blocks diagonal(a8-h1) where my LSB will develop",
        "4. Nf3": "Devloping,Therefore this must be good and white does not need to worry about black playing dxc4 as white can just win pawn back with Qa4+",
        "4... Be7": "Preparing kindside castling",
        "5. Bg2": "Preparing kingside castle and putting pressure on light squares ",
        "5... O-O": "Kingside development done. Now black just needs to start developing on queenside",
        "6. O-O": "Same for me",
        "6... c5": "Good move becauses it prepares Nc6 without block the diagonal a5-e8 and attack my centre",
        "7. dxc5": "The idea it to make black lose a tempo by moving his bishop again and allow me maybe to pin his knight on f6 thereby weaking his control of e4 and d5",
        "7... Bxc5 8. cxd5": "The idea is to force black to play exd5 creating an isolated pawn for me to attack.If Black plays Nxd5 his LSB will never be developed ",
        "8... Nxd5": "I think this is black positional mistake. He should have played exd5 allowing his bishop to enter the game. Nxd5 just now causes black to have an passive game",
        "9. Qc2": "Preparing to bring Rd1 and preparing to develop Nc3 and if black takes on c3 latter I will simply take with my Queen ,keeping my pawn islands together.",
        "9... Bb6": "Qc7 is possible but weaker",
        "10. Rd1": "Pinning knight",
        "10... Qe7": "Getting out of line with rook because white threaten e4",
        "11. Nc3": "Just continue with development and threating to pawn",
        "11... Nxc3": "For me better was to play 11..Nc6 and after 12.Nxd5 exd5 13.Rxd5 Be6 14.Rd1 Rac8. Even tho black would be a pawn down he will have a active bishop pair,open lines and ahead in development.",
        "12. Qxc3": "Much better than 12.bxc3 which weakens b-pawn and a-pawn",
        "12... Nc6": "Preventing me from playing 13.Ne5(which would control lots of squares)",
        "13. Bf4": "The idea is to prevent Black from developing LSB ",
        "13... Bd7": "Mistake better was 13..Rd8 fighting for control of d-file",
        "14. Bd6": "Pinning Queen and Rook",
        "14... Qe8": "Only move",
        "15. Rac1": "Stronger was 15.Bxf8. The reason played this is because it knew black will get a worst position if he try to save his rook",
        "15... Ne7": "Just as I thought,he is just now undeveloping pieces",
        "16. Qa3": "Threating to take on e7 and again forcing black to undevelop a pice",
        "16... Bd8": "Clearly Now I'm and better than the position after Bxf8.Suddenly Black's Queen, LSB, DSB,Knight and Rook on f8 are tangle up and out of the game",
        "17. Ne5": "OBring all my pieces to life.Both Rooks are very active,LSB controls a8-h1 diagonal while knight's on the important e5 square",
        "17... f6": "Trying to get some space",
        "18. Nxd7": "Forcing Queen to get in line with my Rook on d1",
        "18... Qxd7": "Forced",
        "19. Bb4": "Discovered attack on queen",
        "19... Qe8": "Again queen is stuck ",
        "20. Bxb7": "Currently all black can do is respond directly to all whites moves",
        "20... Rb8": "No over move available",
        "21. Qa6": "Not the best. Much stronger was 21.Qxa7",
        "21... Bb6": "Because of the Qa6 black's bishop now enters game again",
        "22. a4": "Trying to force his bishop back to d8",
        "22... Rf7": "Unpinning Rook and preparing to fight for d-file",
        "23. a5": "Best",
        "23... Bd8": "Back to weak weak allow me to cramp black's position again",
        "24. Qxe6": "Here I caculated a strong combination in case black plays 24..Rxb7",
        "24... Rxb7": "Not the best black should have been more careful. Better was Kh8",
        "25. Rc8": "Just tied black's pieces up again",
        "25... g6": "Preparing to move king to g7 to prevent white from checkmate on back rank",
        "26. Rdxd8": "Forcing black to trade queen for rooks",
        "26... Qxd8": "Only Move",
        "27. Rxd8+ Kg7 28. Re8": "Here I didn't know what to do, so I just played this move",
        "28... Nf5": "Placing knight on safe square",
        "29. Qb3": "Here I'm just trying to get black make a mistake",
        "29... Rfd7": "Which he does this move loses game immediatory",
        "30. Bf8+ Kh8 31. Bh6#": "Black Resigns. I think this game is a clear example that plays should not try to play passive but instead should have a look an Kasparov,Fischer and Tal games and see how they would sac even a queen just not to have a passive position."
    },
    "url": "https://gameknot.com/annotation.pl/3-everymove-explained?gm=52483",
    "gameName": "#3 Everymove Explained",
    "players": "richi007 (1793) vs. myminov (1690)",
    "opening": "Catalan (E01), closed"
}