{
    "moves": {
        "1. d4": "This is my first game annotated for the public. Please give me your comments for improvement! I chose this ame because I am a bit proud of he final combintion in Morphy-style, although my partner \"kindly\" assisted. As English is not my native language, I ask for your kind understanding in case of mistakes. I do my very best! ;)",
        "1... c5": "As a player of he \"Vulture\", I used to answer 1.d4 always with c5, which gives black in an unbalanced position good chances for counterplay.",
        "2. Nf3": "In this variant, black develops a strong center formation.\r\nThe normal answer is 2.d5 with the possible outcome 2...Nf6 3.c4 and then Black can play 3...Ne4 for the Vulture.",
        "2... cxd4 3. Nxd4 d5 4. Nc3 e5 5. Nb3 Bb4": "There it is, the black pawn center. The bishop pins the white knight and so indirectly supports the center pawn on d5.",
        "6. Bd2 Nf6 7. e3 O-O": "Black has his king's wing developed, white still trails behind.",
        "8. Be2 Bf5 9. f4": "?\r\n0-0 is to be preferred.",
        "9... exf4": "Opens up the diagonal g1-b6 which will eventually become important.",
        "10. exf4 Re8": "Attacking down the central line!",
        "11. O-O Nc6 12. Bb5 Qb6+": "Fritz suggests here 12...Bxc3 13.Bxc6 Bg4 14.Bxc3 Bxd1 15.Bxe8 Bxc2 with heavy black advantage. Here black catches a pawn.",
        "13. Kh1 Bxc3 14. Bxc6 Bxb2 15. Rb1 bxc6 16. Rxb2": "Black is a pawn ahead.",
        "16... Bg4 17. Qb1 Ne4": "Lays the base for the combination to come. ",
        "18. Ba5": "??\r\nIf white had known the basic manoevre to come, he would have played 18.Be1.",
        "18... Nf2+ 19. Kg1": "?\r\nHere the last chance was to give the rook for the knight. But, as mentioned before, he \"cooperates\".",
        "19... Nh3+": "!\r\nHere we go!",
        "20. Kh1 Qg1+ 21. Rxg1 Nf2#": "Mate.\r\nMmh, is that nice? :)"
    },
    "url": "https://gameknot.com/annotation.pl/league-division-d1-old-benoni?gm=1924",
    "gameName": "(+) League division D1: Old Benoni",
    "players": "mreckblad (1601) vs. brulla (1555)",
    "opening": "Old Benoni defence (A43)"
}