{
    "moves": {
        "1. e4": "Me and my office buddy (who is also on gameknot) played OTB and had another very good game.",
        "1... e5 2. Nf3 Nc6 3. Bc4 a6 4. d3 b5 5. Bd5 Bb7 6. Nxe5 Qf6 7. Nxf7": "At this point I thought he was in for a world of hurt. ",
        "7... g6 8. Bg5 Qxb2": "I am willing to sac this pawn for the position. ",
        "9. Nd2 Be7": "I should have went ahead and castled here, if he takes BxB then I take back with N.  I need to release my queen from guarding the a1 rook. ",
        "10. Nf3 Bxg5 11. Nf3xg5": "It's baffling that I have so much material around his king and can't do anything with it.  This irritates me. ",
        "11... Qc3+": "Now my castling is ruined.  Great job me. ",
        "12. Kf1 h6 13. Nxh8 Qxh8 14. Nf7 Qd4 15. h4": "I need to make room for what's to come...",
        "15... h5 16. Rc1 Qb2 17. c3 Nf6 18. Rc2 Qa3 19. Qe2 b4 20. g3 b3 21. Rb2": "Once again I can already see that not castling is going to keep me from moving on up and taking his bishop.",
        "21... bxa2 22. Rxa2": "So now instead of taking the bishop I have to take the dang pawn!",
        "22... Qxc3 23. Qf3 Rb8 24. Qf4 Qxd3+ 25. Kg2 Nb4 26. Qe5+ Kf8 27. Qxf6": "He has to act fast in order to keep from N-e5   and forking his queen. ",
        "27... Nxd5 28. Qh8+": "I thought about this move for a while, and with the gameknot board analyzer I may not have made it, but this was probably a mistake. ",
        "28... Kxf7 29. Qxb8 Nf4+ 30. gxf4 Qxe4+ 31. Kf1 Qxh1+ 32. Ke2 Qf3+ 33. Ke1 Qh1+ 34. Ke2 Qf3+": "he's wanting me to go onto the D file so he can go d5   and kill my rook. But I won't allow that.",
        "35. Ke1 Qe4+ 36. Re2 Qb4+": "Here he sets a simple swindle and I fall for it hook, line, and sinker. ",
        "37. Kf1 Bg2+": "trap is sprung!",
        "38. Kxg2 Qxb8": "I resign.  Good game to Ian!"
    },
    "url": "https://gameknot.com/annotation.pl/otb-in-good-position-who-is?gm=22112",
    "gameName": "(OTB) In Good Position?  WHO is?",
    "players": "CykO (1507) vs. Iansensei (1305)",
    "opening": "King's pawn game (C50)"
}