{
    "moves": {
        "1. a4": "i played chessmaster computer,  this is how i win it. I name this opening my monkey moove... i thought that i cannot match the skill of the computer, so it would be stupid to make clever mooves...the monkey moove is jst that...(tip...jst flip the board, that way it doesnt feel as if its you who call the mooves)",
        "1... d5": "a4 is worst moove to make:)",
        "2. b3": "and to defend it?",
        "2... Bf5 3. d3 e6 4. Qd2": "my aim is to make opponent waste moves....i want him to develop...and then loose developed pieces",
        "4... Nf6 5. Qg5": "my next moove is Ra3...if he take it with bishop, my queen go Qg7",
        "5... Nc6": "my monkey moove is simple....get rid of Ra1 and g2",
        "6. Ra3 h6": "there it is....a computer cannot resist such moove...so i already win one small battle....sum chessplayers refuse to take that rook...feeling sorrry for me...then i jst leave it there...by the way....my opponents rook at a8 stayed there the entire game...so why dnt get ridd of it while you can by taking his bishop that run on black diagonal?....",
        "7. Qd2": "i can push pawn to c3, eventually he will do this...note: Black seem to be well developed, white had reserved his options...the less mooves is made, the less  combinations there is for the computer to take advantage off...in normal conditions, the black bishop would provide cover for the night at c6 to penetrate whites defence...but it will change!",
        "7... Bxa3": "told you!",
        "8. Nxa3": "i do this....then push c4 later....also....where is his black bishop? and my king is on a black block....most of my pieces is on black...so was the trade fair? .........also i could have prevented him from castle-ing to kingside, by taking his bishop with my bishop.....but i want him to castle....!!!!",
        "8... O-O": "and look at that.....i even anticipated opponent to castle to the side i wanted him to...now i get rid of g2 and put rook at g1 to pin pawn g7 it leaves h6 open for attack by queen....look at my position...",
        "9. g4": "chess is also about drawing opponent into moves, one can use his pieces to slingshot yourself across the board..",
        "9... Nxg4": " told you....",
        "10. Nf3 Nge5": "and....",
        "11. Rg1": "yes! there it is....",
        "11... Nxf3+": "timing is vital...so i jst have to withstand a few moves...",
        "12. exf3 Nd4": "because he have castle more than me- im  thinking of keeping either my pawns in a chain/or his/ from preventing castles to move about board...remember...we play an opponent that can predict moves well in advance...",
        "13. Be2": "protecting f3-its not good if pieces protect pawns...",
        "13... Nxe2": "taking it with king...also protect pawns around it",
        "14. Kxe2": "my idea was never to castle, but to use the strength of the king to protect pawns, also to keep on black blocks, but at e2 the king is safe from attack, and should hold its ground.",
        "14... Bg6": "opponent realise threat",
        "15. c4": "told you i will push to c4 it will bring my knight into play! (opponent is sort of forced to take c4, else his rooks cannot penetrate pawn formation)",
        "15... dxc4": "a little divertion....my night will take care of that....and suddenly there is sum power!",
        "16. Nxc4": "by the way....the board is cluttered with pawns...a night is like a queen in these conditions...where is his knights....",
        "16... Qh4": "also....his castles have to make a way through this mess...",
        "17. Ne5": "developing...in stead of protecting....that is how you win this thng",
        "17... Qxh2": "also keep him guessing...that way it jst might keep his rooks at bay.",
        "18. Rg3 Qh5": "look at his rook at a8.....pmpl it doesnt do nothing",
        "19. Qe3": "i dnt want pawns to advance...also if he push f7..then it weaken his pawn protection",
        "19... Rfe8": "obviously preparing and protecting....but a night is dangerous thing",
        "20. Bb2": "so i want a platform to attack from!",
        "20... c6": "he is waiting for something",
        "21. Ng4": "look at f6....",
        "21... Qd5": "again....i leave oponent to feed on ....-while i attack!.....yes!!!!you can attack an empty space...even if it is protected!!! let me show you-lol",
        "22. Nf6+": "the night force oponent to take night...but then i do this!",
        "22... gxf6 23. Bxf6": "a safespot....",
        "23... Qxb3": "look at him....look at Ra8",
        "24. Qxh6": "my next moove is mate...and he knows it!",
        "24... Qxd3+": "well wot you know!",
        "25. Ke1": "if this undeveloped attack succeed....then its my game...and now you can see that he did waste a few developing mooves by those sacrifices i made early in the game",
        "25... Qb1+ 26. Kd2": "this must be the best options....cause a computer miss nothing!",
        "26... Qd3+": "i would have brought in a rook...in any case, if i made the rules i would have taken its queen with my king-THE REASON IS THAT THE PIN I FORCE UPON MY OPONENT, RENDER HIS BISHOP AT G6 POWERLESS!!!!(i can proove this....\"had i any other piece to capture the black queen at d3, then it would proove that my statement is right....my tactical moove at Rg3 leave the bishop at G6 POWERLESS!!!!- WHY SHOULD MY KING BE AN EXCEPTION!!!????....but for now i accept the stupid rule, and moove to Ke1:)",
        "27. Ke1": "he are forced to do b1, else mate!!",
        "27... Qb1+": "i think that the computer is his own nightmare...forseeing mooves so far in advance, that I believe that if he did bring out a rook, he would have mated me in no time...NOT REALIZING THAT I AM UNABLE TO SEE WOT IT SEE...:)",
        "28. Ke2 Qa2+ 29. Kf1": "i'm free!!!! i can smell victory here!",
        "29... Qa1+": "why he did that...i dnt know...i think he think that the chance of me overlooking this....",
        "30. Bxa1": "was worth the risk..",
        "30... e5": "....or... it might think that from this position, it still have a higher persentage chance to win the game!",
        "31. Rh3": "he is weak over here",
        "31... Bd3+ 32. Kg2": "i lost so many times...i was jst as surprized",
        "32... f6 33. Qxf6": "why not!",
        "33... Bh7 34. Rg3+": "grins",
        "34... Bg6 35. Rxg6+": "how can it be so easy...",
        "35... Kh7": "look at his rook at a8.....",
        "36. Qg7#": "monkey move!!! (he could have forced a draw....but then knowing the outcome of the game in advance....wot would the use of a draw be...in anycase, it is the loosing party that force a draw...knowing that he already lost the game...(and I can prove it....THE REASON WHY IT IS LOST BY THE PARTY WHO FORCE DRAW-IS THE VISION THAT HAD CHANGED BY THE PLAYER....IF YOU CAN CHANGE THE VISION OF A PERSON, THEN YOU WIN HIS MIND.....BECAUSE IT WAS HIS ORIGINAL VISION OF MATING YOU!!!-not drawing with you:)"
    },
    "url": "https://gameknot.com/annotation.pl?gm=15327",
    "gameName": "",
    "players": "fireballz  vs. chessmaster ",
    "opening": "Ware (Meadow Hay) opening (A00)"
}