{
    "moves": {
        "1. e4": "The opening for fast games and the one to use if you trust your attacking instincts. I've mated a lot of people with sharp opening play in as little as 15 moves. It has its risks, but it's also loads of fun, as long as you know to expect some losses once in a while.",
        "1... c5": "The most energetic way to fight for the initiative. Breaking symmetry from the first move, fighting for the center and not creating any targets for white, very few bad things can be said about the Sicilian.",
        "2. Nf3": "The open variation, with a lot of tactics and plenty of attacking opportunities for White and also good counter-attacking chances for Black in the endgame",
        "2... a6": "O'Kelly Sicilian, not very popular, but that doesn't mean it's not good, it packs quite a punch if you don't know how to handle it.",
        "3. c4": "The standard bind against this variation, keeping things cool in the center and under White's control.",
        "3... Nc6 4. d4": "Opening the position and seizing the center",
        "4... cxd4 5. Nxd4 e5": "The typical response in the O'Kelly.",
        "6. Nf5": "I have no idea if this is objectively any good, but it seems to offer a good game",
        "6... d6": "The natural response, opening lines and targeting the intrusive White Knight at f5",
        "7. Nc3": "Perhaps 7.Ne3 would have been wiser and more sound, keeping control of the White central squares, but I wanted to develop fast.",
        "7... Bxf5 8. exf5 Nf6": "I think the prophylactic 8..h6 would have given black a very easy game due to the weak d4 square and to his solid center.",
        "9. Bg5": "Fighting for the control of d5.",
        "9... Be7 10. Bxf6 Bxf6 11. Nd5": "The Knight has landed! It sure is easy to plan an attack with a central Knight lodged into the enemy position.",
        "11... O-O 12. Bd3": "Aiming for the Black castle and even envisioning a pawn storm on the king side.",
        "12... Nd4": "Black has a Knight of his own he can lodge in the center, but his plan is focused on the queen side. I always go for the King when I can help it.",
        "13. O-O": "Both Kings have chose their haven, but only one will come under fire.",
        "13... b5": "Trying to undermine Withe's queen side and fantasizing about removing the Knight from d5",
        "14. b3": "White secures the foothold in the center.",
        "14... Rc8 15. Qh5": "Starting to conjure threats on the Black monarch.",
        "15... bxc4 16. bxc4 e4": "A bold sacrifice meant at activating the f6 Bishop and at removing the support pawn for the Knight, the drawback of it is that it has the almost the same effects for the Black position",
        "17. Bxe4 Rxc4 18. Rac1": "Removing the Rook from the Bishop's line of fire and exchanging it for Black's active one.",
        "18... Rxc1 19. Rxc1 Re8": "Activating the second Rook but also weakening f7.",
        "20. Rc7": "This needed a few concrete lines to be calculated or else it would have just dropped a piece. The main danger for White is the back rank weakness.",
        "20... g6": "I'm not so sure this is a good move, it keeps the initiative for Black, but at a very high cost, activating the white squared Bishop with drastic effects on the security of the Black King.",
        "21. fxg6 hxg6": "White has to step back now, but he still has a lot of threats and Black can't meet them all with one move.",
        "22. Qg4": "Every White piece is aimed at the Black King. I don't see a miracle move for Black in this position.",
        "22... Nb5": "This is begging for it.",
        "23. Rxf7": "The fortress has fallen.",
        "23... Bg5": "A desperate attempt to stall the outcome for one more move.",
        "24. Rd7": "Winning at least a piece.",
        "24... Rxe4": "A blunder in a difficult position that effectively ends the game.",
        "25. Rxd8+": "1-0"
    },
    "url": "https://gameknot.com/annotation.pl?gm=8287",
    "gameName": "",
    "players": "Meleagru  vs. NN ",
    "opening": "Sicilian (B28), O'Kelly variation"
}