{
    "moves": {
        "1. Nf3 Nf6 2. g3 b5 3. Bg2 Bb7 4. O-O c5 5. d3 e6 6. Nbd2 Be7 7. Re1 Nc6 8. e4": "Valor da posição após 8. e4: +0,20.",
        "8... Ng4 9. h3 Nf6 10. h4": "Com 10. h4 o valor fica em -0,11, enquanto com o lance sugerido 10. e5 seria +0,59. Minha intenção era sustentar um Cavalo em g5.",
        "10... Ng4 11. Ng5 Bxg5": "11. A captura Bxg5 foi mal avaliada pelo Shredder, e esse primeiro erro mais sério custou mais de 0,70 para as pretas (em vez de -0,17, o valor ficou em +0,57).",
        "12. Qxg4": "12. Para o software, h4xg5 era superior, e QxN custou 0,45 para a posição das brancas (segue o equilíbrio: avaliação: +0,00).",
        "12... Bf6 13. Nf3 h5 14. Qf4 e5 15. Qe3 Qb6 16. Ng5": "16. Ng5 é mal avaliado, e as pretas chegam à sua melhor nota: -0,31, mas 16. … b4 é mal jogado, e alternamos para +0,22.",
        "16... Nd4 17. Qd2 b4 18. c3 bxc3 19. bxc3": "Erro das pretas: com 19. … BxN a posição vai a +0,97.",
        "19... Bxg5": "Erro das pretas: com 19. … BxN a posição vai a +0,97.",
        "20. Qxg5 f6": "Grave erro das pretas em 20. f6: pela primeira vez algum lado ostenta vantagem (muito!) acima de +1,00: o valor da posição vai a +5,60.",
        "21. Qg6+ Kf8 22. cxd4 cxd4 23. Ba3+ d6 24. Bh3": "Erro: a vantagem cai para +2,71. Esse lance de Bispo permite o incômodo 24. … Rh3. Contudo, as pretas optam por um outro lance muito mais fraco, entregando a partida.",
        "24... Ba6": "Após 24. … Ba6, mate em 3, começando com Be6.",
        "25. Be6 Qc7 26. Bxd6+ Qe7": "Em 27 eu não percebi que a Dama estava pregada pelo Bispo, o que significa que Qf7 é mate. Agora temos mate em 4.",
        "27. Bxe7+ Kxe7 28. Qf7+ Kd6": "As pretas abandonam: além da grande desvantagem material, temos mate em 3 e as torres pretas inativas."
    },
    "url": "https://gameknot.com/annotation.pl/06?gm=59464",
    "gameName": "#06",
    "players": "Eu (1370) vs. Shredder (1300)",
    "opening": "Reti (A05), King's Indian attack, Spassky's variation"
}