{
    "moves": {
        "1. Nf3 Nf6 2. g3 d5 3. Bg2 Bf5 4. O-O e6 5. d3 Bb4": "Esse bispo poderia dificultar os meus planos, por isso optei por expulsá-lo com o meu próprio bispo. Isso interrompeu por alguns lances o andamento mais normal do KIA, e eu gostei de não ter sido tão mecânico, parando para avaliar e sendo capaz de me desviar um pouco do meu roteiro.",
        "6. Bd2": "No KIA esse bispo às vezes fica preso, embora depois que os cavalos brancos fazem todas as manobras que devem fazer esse bispo se torna ativo. participando de ataques na ala do Rei.",
        "6... Nc6 7. Bxb4": "Eu troquei sem maiores remorsos... foi um lance seguro, recomendado pelo Shredder.",
        "7... Nxb4 8. a3": "O Shredder recomendo avançar o peão de c até o centro, ameaçando o peão de d5. Contudo, não avalia mal essa opção, de modo que a minha iniciativa de expulsar rapidamente o cavalo não mereceu maiores críticas.",
        "8... Nc6 9. Nbd2": "Agora o KIA começa a voltar ao roteiro original...",
        "9... Qd6 10. Re1": "Segue o KIA...",
        "10... e5": "(lance considerado fraco)",
        "11. e4": "Aí está!!!! Meu aguardado avanço até e4 finalmente aconteceu!",
        "11... dxe4": "Ok... a recomendação do Shredder para as pretas é mesmo trocar.",
        "12. dxe4": "Shredder preferia Ng5, mas eu não sou tão criativo assim: me contentei em retomar o peão.\nO Shredder avaliou mal esse lance, de modo que uma vantagem que poderia ser de quase +0,20 virou uma desvantagem de -0,10",
        "12... Bg4 13. h3": "Rapidamente expulsando o bispo...",
        "13... Bh5 14. g4 Bg6 15. Nc4": "Shredder defendia outras ideias (c3), mas esse cavalo funcionou bem aí, dado que as pretas trocaram damas",
        "15... Qxd1 16. Raxd1 Bxe4": "Parece que esse peão está sem defesa e pode ser capturado, mas a verdade é que essa captura deixa as peças pretas expostas a sérios ataques. Foi o primeiro erro grave cometido pelas pretas (a posição seria +0,19 se as pretas tivessem jogado 16. ... Nd7, mas o lance realizado deixou esse valor em +2,52.",
        "17. Ncxe5": "A combinação agressiva era com o OUTRO cavalo... a minha jogada permite O-O, jogada que deixaria a posição das pretas com alguma esperança.",
        "17... Nxe5": "Outro erro bem grave: +3,50",
        "18. Nxe5 Bxc2": "Alvo errado! As pretas deveriam ter jogado BxB. É como se as pretas pensassem \"eu perco uma torre mas ganho outra, por isso neutralizei o ataque\" - se bem que, na verdade, as pretas não pensam: é apenas o Shredder tentando simular os equívocos que, em tese, um jogador 1300 cometeria...",
        "19. Rd2": "Melhor seria Ng6+, mas esse contra-ataque da torre não mudou o fato de que a minha posição estava com superioridade nítida.",
        "19... Ba4": "último erro grave: o certo seria Be4, mas para salvar um bispo as pretas entregaram a partida.",
        "20. Ng6+ Ne4 21. Rxe4#": "As pretas não rocaram! Não deixa de ser mais um exemplo dos perigos de um rei centralizado - ainda mais assim, numa posição tão aberta!"
    },
    "url": "https://gameknot.com/annotation.pl/07?gm=59501",
    "gameName": "#07",
    "players": "Eu (1420) vs. Shredder (1300)",
    "opening": "Reti (A05), King's Indian attack, Spassky's variation"
}