{
    "moves": {
        "1. e4": "Fights to control d5 square and f5 square",
        "1... c5": "Sicilian defence a counter attacking defence. Pawn fights to control d4 and b4 while opening a diagonal for the queen",
        "2. Nf3": "Attacks center and develops kingside",
        "2... Nc6": "Develops and puts more pressure on d4 square",
        "3. d4": "Challenges black pawn and knight and it is recomended that black takes d4 pawn before white plays d5",
        "3... cxd4": "Opens c-file and trades c-pawn for a center d-pawn. This c-file is important latter on for blacks strategy which usually involves the control of the c-file with rooks and queen",
        "4. Nxd4": "White move knight again but move is still good because the knight is now in the center attacking lots of squares which could be useful latter ",
        "4... Nf6": "Develops,attacks and gets more control over d5 square ",
        "5. Nc3": "Best move(develops and attacks d5 square and defends e4 pawn) other move of not bad but not close to as good as Nc3",
        "5... d6": "Pawn gets control over e5 square and opens diagonal for bishop. Other move such as g6 and e6 are also good",
        "6. Bc4": "Places bishop on dangerous diagonal that attacks f7 pawn which is only defended by the king",
        "6... g6": "Black plans to control the darck squares e5 d4 with his d-pawn,dark bishop and C6 knight",
        "7. Nxc6": "Best move because it weakends black's control over dark squares and gives white attacking tactical chances",
        "7... bxc6": "Only move and opens b-file which black should place one of his rooks latter in the game",
        "8. e5": "Fischer trys to weakend blacks pawn structure and wants his opponent to move his knight twice in the opening",
        "8... dxe5": "Worst move black should have played Ng4 or Nd7 or d5 ",
        "9. Bxf7+": "Drags king away from queen and therefore black resigns",
        "9... Kxf7": "Only move ",
        "10. Qxd8": "Winning queen for bishop "
    },
    "url": "https://gameknot.com/annotation.pl/2-everymove-explained-chess-strategy-planning?gm=50821",
    "gameName": "#2 Everymove Explained(Chess Strategy/Planning)",
    "players": "Bobby Fischer (2780) vs. Unknown ",
    "opening": "Sicilian (B58), classical"
}