{
    "moves": {
        "1. e4": "This game is an example of a situation where castling is the wrong decision. White squeezes Black like a boa constrictor, but Black finds a way out and wins in a tense manner.",
        "1... e6 2. d4 d5 3. Nd2 Be7 4. Bd3 Nf6": "John Watson recommends 4....c5 here for Black, which is likely to lead to some very complicated lines. This move allows 5.e5, which removes a major defensive piece from Black's kingside.",
        "5. e5 Nfd7 6. f4 c5": "This move is normal in the French. Sometimes Black plays it to undermine/weaken the pawn on e5, but that isn't happening here because that pawn is well protected by the pawn on f4.",
        "7. c3 Nc6 8. Ndf3": "If I were White here, I probably would have pushed the pawn to f5 and launching an attack that I think Black would have a very difficult time surviving.",
        "8... f5": "Trying to physically prevent White from pushing his pawn there by moving my pawn first. Of course, he could always take en passant and keep that possibility alive...",
        "9. Ne2": "Taking en passant seems to be the better option for White here. Black's kingside is so weak, and this is more of a factor if the board is open. Black is more than happy to close up the board.",
        "9... c4": "I knew I had to find somewhere on the board to get some activity going. The center is locked up, and pushing my kingside pawns would be suicide (because my kingside is already too weak as it is.) Thus, I found the plan of trying to open up the board on the queenside.\n\nHowever, this plan has a serious defect: It's going to be very difficult for me to find a way to get my bishop on c8 into the game.",
        "10. Bc2 b5 11. Ng5 Nf8": "This move serves two purposes: It defends the weak but crucial e6 pawn, and frees up d7 as a possible escape square for my king.",
        "12. Ng1": "White has wasted two tempos moving his pawn on e2 and back to start. Of course, in a closed position like this, tempos aren't as important as they might be in other positions, but that doesn't mean they still aren't important. ",
        "12... Ng6 13. Ng1f3 b4 14. O-O": "White is correct to ignore what I'm doing on the kingside since I'm not threatening anything serious. However, I think 14.h4 would have been stronger for White, introducing the h-pawn into the attack. This is a case where castling doesn't necessarily help White. White's king was completely safe; Black is light years away from attacking it.",
        "14... a5 15. h4 h6 16. Nh3 Kd7": "The queenside doesn't look like a completely safe place for the king, but it seems safer than the kingside. ",
        "17. h5 Nh4 18. Ba4": "I still need to find a way to get my light-squared bishop involved.",
        "18... Kc7 19. Bxc6 Kxc6 20. Qa4+ Kb6": "Intending to play Bd7 to force the Queen off of the square. I played the king here so I could defend the b5 square.",
        "21. Bd2": "Now White is threatening to take the pawn on b4. Perhaps an even stronger threat for White is to take the knight on h4 first, deflecting the bishop away from the defense of my queenside, then to take the pawn on h4.",
        "21... Nxf3+ 22. gxf3": "I had been expecting White to take with the rook here instead with the idea of moving it to g3 to put pressure on my weak pawn on g7.",
        "22... Bd7 23. Qc2 Qe8": "Now we see why castling was a liability for White! White's king would be a whole lot safer on e1 right now than it is now on g1. White's rook would also still be able to defend the pawn on h5 if it were still on h1.",
        "24. b3 Qxh5": "This counterattack would have seemed very unlikely ten moves ago.",
        "25. Kh2 g5": "Black is going to push a pawn to g4 to pin, and win, the knight.",
        "26. bxc4": "The game now enters an interesting tactical phase.",
        "26... g4 27. cxd5 Qxh3+ 28. Kg1": "Well, at the very least, I have a perpetual check, but a draw is far from satisfying for Black at this point.",
        "28... Bh4": "Opening the g file by gxf3 may have been stronger here, but I played Bh4 to prevent the White king from escaping using the f2 square.",
        "29. cxb4": "I absolutely cannot ignore White's threats on the queenside.",
        "29... Rac8 30. bxa5+ Ka7 31. Qb3": "With the obvious threat of Qb6+. If Black allowed this, Qb6+ Ka8 Rb1 would force Black to take his perpetual check to avoid mate.",
        "31... Rcb8": "I just need a free move or two to finish him off. After this move, White has no threats, so it's all over.",
        "32. Qe3 gxf3 33. Rxf3": "Taking with the queen is no different.",
        "33... Rhg8+": ""
    },
    "url": "https://gameknot.com/annotation.pl/25-baseball-fans-mini-tournament?gm=27210",
    "gameName": "#25 Baseball Fans' Mini-Tournament",
    "players": "jantheog (1483) vs. kansasjayhawk (1687)",
    "opening": "French (C03), Tarrasch"
}