{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Bb5 Nf6 4. O-O Bc5": "4. .......... This is the Beverwijk Variation of the Ruy Lopez - but I wonder whether this is a good line or not in retrospect because I really do get into an awkward mess in the early part of the middle game.",
        "5. c3 O-O 6. d4 Bb6 7. Bg5 h6 8. Bh4 d6 9. a4 a5": "9. ........ a5 - all book up to here, but now the dodginess is revealed by white's next move which is the one move which has a good win ratio for white in the database.",
        "10. Bxc6 bxc6 11. dxe5 dxe5 12. Nxe5 Qxd1": "12. ........... Qxd1 - this queen exchange is forced as the black knight must get out of the pin to avoid the kingside pawns being shattered as well as the queenside ones.  I am now a pawn to the bad into the bargain, sigh!!",
        "13. Rxd1 Nxe4 14. Nxc6 g5 15. Bg3 Nxg3 16. hxg3": "16. hxg3 - they say you shouldn't exchange pieces when you are down on material, only pawns, but I have one proviso - if the exchange results in messing up your opponent's pawn structure it is certainly worth considering in my humble opinion.  White's active dsb is off the board and at least I have the bishop pair against 2 knights.",
        "16... Bb7 17. Ne7+ Kh7 18. Nd2 Rfe8 19. Nf5 Re2": "19. ............ Re2 - time to get nasty!  This rook move suddenly puts the cat among the pigeons in the white camp and look at those 2 prelates - what long diagonals they have!!",
        "20. Kh2 Rxf2 21. Nd4 Rxg2+": "21. ........ Rxg2  - all the better for mopping up white pawns - yum, yum!!",
        "22. Kh3 Bxd4 23. cxd4": "23. c x d4 - I thought long and hard about this exchange, it does knock out a defensive piece and it now breaks up white's queenside.  Can I do some serious damage before white activates his queen rook?",
        "23... Rf2 24. Nc4 Re8": "24. ........ Re8 - suddenly Old Matey is sniffing round the white king!!",
        "25. Rdf1": "25. Rf1?? - trying to exchange off or drive away the black rook but unfortunately for white the lsb on that lovely long diagonal has the final say with ........",
        "25... Bg2+": "25. ........... Bg2 !! - at the very best (for white) I will be a piece and a pawn up in the endgame, at the very worst for white, if he plays his king to g4 he will cop Old Matey in a handful of moves.  White sees this and waves the white flag."
    },
    "url": "https://gameknot.com/annotation.pl/ware-that-long-range-bishop-part-1?gm=15996",
    "gameName": "'Ware that long range Bishop - Part 1",
    "players": "rrabinow (1613) vs. jstevens1 (1612)",
    "opening": "Ruy Lopez (C65), Berlin defence, Beverwijk variation"
}