{
    "moves": {
        "1. e4": "This is my first game in this tournament, and what a way to start it! Right off the bat, it looks as if I could have already backed myself into a corner early on, but it soon  opens up into an open, action-packed game, where both sides go on the attack a number of times...",
        "1... e5 2. Nf3 Nc6 3. Bc4 Nf6 4. Ng5 Bc5": "the starting position of the Traxler Variation - to quote Freddy's take on this; \"This bold move ignores White's attack on f7 and leads to wild tactical play\"",
        "5. Bxf7+": "after a quick check on a few ongoing games, I find this is the most played here, and that the altenative Nxf7 doesn't work at all for White (it's funny how in all of Freddy's mini-tournaments that this knight fork is bad)",
        "5... Ke7": "connecting the queen and rook",
        "6. Bc4": "retreating the bishop and keeping pressure on that f7 square (here, I didn't want Bb3 because of a future doubled pawns on the b-file, and I didn't want Bd5 because of Nxd5, though as Joanne pointed out in her annotation it seems to be the most popular)",
        "6... Rf8": "Black starts to build up pressure on that f2 pawn with a discovered attack (e.g 7...Bxf2 8.Kxf2? Nxe4+!)",
        "7. Qe2": "?! this was not the best way to protect my king. Better alternatives would have been 7.0-0 or maybe even 7.f3 (though that move isn't as strong - it stops White castling)\n\n-",
        "7... Nd4": "forces the queen away from protecting f2, but at the same time blocks Black's dsb",
        "8. Qd3": "I didn't want to waste time undeveloping my queen, plus I had the idea of a possible queenside castling (thought this play, I now know, is definitely too fast for that sort of thing) ",
        "8... d6": "making room to develop Black's other bishop",
        "9. c3": "at this point, I was already starting to panic. I realised that with this move, there was nowhere that my knight could go, and my queenside wasn't looking too good. I was considering, after 9...Nc6, 10.b4, but that would most likely force Black to simply play Bxf2, and though Ne4+ isn't a possibility, it still breaks open my kingside defence (plus b4 wouldn't help much for my dsb.)  After a bit of playing around on the analyse board, however, I see another possibility...",
        "9... Nc6 10. Bd5": "the bishop attacks the knight, and the knight has no good square to retreat to. the only squares available are Nb8 (undevelopment) and Na5 (11.b4!) It seemed to me to be the only move available at the time, but maybe castling would have been a better idea. I had an idea of Qc4 to put pressure on e6, but...",
        "10... Nxd5": "?! I didn't expect Steve to exchange here - after I capture back with the pawn that c6 knight has to move. I see why this move was made a bit later...",
        "11. exd5 Bxf2+": "Black regains his lost pawn ",
        "12. Kd1": "Provides the king with a safe haven on c2 should Black try attacking again...",
        "12... Bg4+ 13. Nf3": "but in this instance, White decides to defend with the knight. This move, however, leads to an impressive counter-attack from Black which really picks up the pace of the game...",
        "13... e4": "first, a sacrifice that White has to take... ",
        "14. Qxe4+ Ne5": "preparing the attack....",
        "15. d4": "Steve isn't worried about this move, as he has something else up his sleeve...",
        "15... Rxf3": "! White's queen is doomed! Taking with the pawn is met by Bxf3+. Taking back with the queen... well, that's obvious. Moving the queen won't do either (e.g Qe2, then Re3! or Qc2, then Rxc3) the only way to (immediately) save my queen here is Kd2, which is an unflattering choice because of 16...Rd3+ 17. Kc2 Qd7, with Bf5 next move (alt. variation; 16...Rd3 17.Qxd3 Nxd3 18.Kxd3 Qd7...) I overlooked Kd2 as an option here, though, as a look at the analyse board showed me that it wasn't as bad as it seemed...",
        "16. gxf3 Bxf3+ 17. Qxf3 Nxf3 18. Rf1": "one of the two pieces will have to go...",
        "18... Kd7 19. Rxf2": "and White is now only one material point down - a pawn, a rook and two bishops for a queen, a knight and a pawn (12 points v 13 points) Now this is where this game starts to get interesting...",
        "19... Ng5 20. Bxg5": "I lure the queen away from the d8 square for...",
        "20... Qxg5 21. Rf7+": "now the c-pawn drops - Black can't defend with either Kd8 or Kc8 because of Rf8+, winning White's rook",
        "21... Ke8 22. Rxc7": "let's take a look at the position here - material is even, and each side only has one developed piece. Black has the better piece - the queen - in no-man's land on the (White's) right side of the board, and while White has a weaker piece - the rook - it restricts the mobility of all of Black's pieces (for now, Black's Queen is stuck on the g-file protecting the pawn, as if she moves; 23. Rxg7, and unless the Black Queen had moved onto the h-file, Black's rook will soon be lost",
        "22... b6": "Black saves his b-pawn from my rook",
        "23. b4": "thinking of a pawn push queenside (White has a 5-to-3 advantage)",
        "23... Kf8": "frees up Black's queen, and here I'm expecting Black to play Qxd5, and since I can't save it without weakening my pawn structure...",
        "24. a3": "I give up on it. What's interesting about this position is that my undeveloped knight suddenly has a purpose - defending the a and c pawns (White's pawn structure is half a Stonewall defence)",
        "24... Qg1+": "! I didn't see this - Black gains two passers on the g and h files (though I wouldn't have been able to stop it regardless)",
        "25. Kc2 Qxh2+ 26. Kb3": "I don't mind - I wanted my king on the third rank to stop a skewer of the king with the rook",
        "26... h5": "! the pawn pushing begins... my first fear here, though, was Qg2, which forces me to play c4 and weaken my pawn structure (e.g 26...Qg2 27.Ra2 Qxd5+ c4 Qxd4...)",
        "27. Ra2 Qg1": "! The queen now forces my rook to play defensively",
        "28. Rb2 Qd1+": "? Black shouldn't be attacking - that pawn needs to be pushed, and if Black keeps pushing it, White will have to sac a rook to stop promotion (e.g 28...h4 29.Rd7 h3 30.Rxd6 h2 31.Rxh2 Qxh2) ",
        "29. Ka2 h4": "not as potent now that White can get his rook to f2",
        "30. Rf2+ Ke8": "?! Kg8 would have been better in this position, due to...",
        "31. Rcf7": "(!) White threatens mate in two thanks to my d5 pawn (32. Rf7f8+ Ke7/Kd7 33.Rf2f7#)",
        "31... Rd8": "forced; the only move to stop mate...",
        "32. Rf7f8+": "but I rushed too quickly into this move, having seen the possibility of mate back at move 30. Now, Black can escape, and here I thought that I had no more attacks on Black...",
        "32... Kd7 33. Rf8f7+ Kc8 34. Ka1": "Ka1?? I have no idea what I was thinking here, and as Ion had pointed out to me via PM, I still had an attack with 34.Rxg7! and White keeps on the pressure",
        "34... Rd7": "I'm not ready for a rook exchange yet... (plus one rook here won't stop that passed pawn)",
        "35. Rf2f1": "so I counter with an attack on Black's queen",
        "35... Qh5 36. Rf7f5": "keeping on the pressure",
        "36... Qg6 37. Rf5f2 Kb7": "I guess this was a 'waiting move' from Black",
        "38. Rh2": "attacking the passed pawn...",
        "38... Qg5 39. Rfh1": "that cannot be defended!",
        "39... Qxd5": "nabbing that free pawn, and setting up for something that ultimately wins Black the game",
        "40. Rh2xh4 Rf7": "setting up the mate...",
        "41. Rh4h7": "nope, I don't see it, only an opportunity to nab that extra pawn...",
        "41... Ka6": "Making sure White has no counter-attacking opportunities...",
        "42. Rg1": "? And now the pawn is lost. But Black doesn't care about that pawn. Why should he...",
        "42... Rf2": "! when he has mate! Black cannot be stopped!",
        "43. Nd2": "only delaying the inevitable...",
        "43... Rxd2 44. Kb1 Qb3+ 45. Kc1 Qc2#": "and checkmate! Great game Steve! :D"
    },
    "url": "https://gameknot.com/annotation.pl/the-traxler-variation-an-exciting-game?gm=27104",
    "gameName": "- - The Traxler Variation - - an exciting game!!",
    "players": "x-machine (1181) vs. untateve (1684)",
    "opening": "two knights defence (C57), Wilkes Barre (Traxler) variation"
}