{
    "moves": {
        "1. e4": "Hi everyone!\r\n\r\nI missed a chance late on in the endgame to nail my opponent.  This was by means of a sacrifice, namely a backward pawn.  I did not consider the sacrifice because I was worried about giving my opponent a passed pawn so I completely dismissed the idea.  I should have looked a little further into it before doing this as I found out from Coach Ion in a post-match feedback.  I will start the commentary on move 6 since in this Tournament 5. Bxf7+ has been the popular move.",
        "1... e5 2. Nf3 Nc6 3. Bc4 Nf6 4. Ng5 Bc5 5. Bxf7+ Ke7 6. Bd5": "6. Bd5 - another fairly popular move keeping the bishop on the a2-g8 diagonal, although Michael does have the option of taking the bishop with his knight.",
        "6... Rf8 7. O-O Qe8 8. c3 d6 9. d4": "9. d4 - after a bit of pawn play on both sides I decided to close off the line of black's dsb.",
        "9... Bb6 10. Bxc6 bxc6": "10. ...... bxc6 - this is a recommended move in the gameknot world db - it does disrupt black's queenside pawns to compensate for giving up Fou Leblanc for the knight.",
        "11. a4 a5 12. Be3 Qg6": "12. ...... Qg6 - out comes the Wicked Witch who is eyeing up the g2 square with evil intent.",
        "13. dxe5 Bxe3 14. exf6+ Rxf6 15. fxe3": "15. fxe3 - over the last few moves a plethora of exchanges occurs and both sides now have pawn islands.  My g5 knight is about to disappear and so is one pair of rooks.  I exchange the rooks because I want to cut down on Michael's attacking power on the kingside.",
        "15... Qxg5 16. Rxf6 gxf6 17. Qe1": "17. Qe1 - my pawn on e3 is very weak so is the one on e4, but never fear, Glenda the Defender is here!  I still need to develop my queen knight though.  However, black's threats delay this as I must escape Old Matey's shadow after 17. Bh3.",
        "17... Bh3 18. Qf2": "18. Qf2 - now Glenda has two pawns to defend, luckily both of these pawns are simultaneously attacked by the Wicked Witch so at least no risk of overload, yet.",
        "18... Rg8 19. g3": "19. g3 - to defend against the threats on the g column but that lsb on h3 is a real nuisance.",
        "19... h5 20. Qf4 Qc5": "20. ....... Qc5 - black eschews trading queens and there are possible threats of Rg4 to contend with.  Still, if Michael does play it then Glenda can go to f3 to defend.",
        "21. Nd2": "21. Nd2 - at long last!",
        "21... d5 22. Qxc7+": "22. Qxc7+ - Glenda can take a free pawn with check.  I dare not play exd5?? because the Witch can recapture and simultaneously threaten the knight on d2 and mate on g2.",
        "22... Ke8 23. Re1": "23. Re1 - centralisation and helps defend the e3 pawn.",
        "23... h4 24. Qf4": "24. Qf4 - alas Glenda must revert to some defensive work.  Now the h and g pawns are traded off.",
        "24... hxg3 25. hxg3 Qb6 26. b3": "26. b3 - this pawn moves to evade capture from the witch and remains on this square for the rest of the game.",
        "26... Qc5 27. exd5 Qxc3 28. Re2": "28. Re2 - bolstering the second rank.",
        "28... Qa1+": "28. ...... Qa1+ - spent about two or three days trying to ascertain the best place for Henry to go or whether I should block the check with my knight.  I did not like Kh2 because if that black rook could safely land on the h column then that lsb could unleash a devastating discovered check.  If I took the bishop then the Wicked Witch could land on h1 with a really nasty check and then Henry would walk straight into a mating net on the f or g columns.  In the end I decided that f2 was the best place because at least the g3 pawn would be doubly defended and I then found a way to screen off the Wicked Witch's power on my back rank.",
        "29. Kf2 cxd5 30. Re1": "30. Re1 - like this.",
        "30... Qb2 31. Qd4": "31. Qd4 - time for some Witch Ejection, folks!  I offer a queen trade and my opponent accepts it.",
        "31... Qxd4 32. exd4+ Kd7 33. Rc1": "31. Rc1 - necessary to prevent Michael from dominating the c column with his rook to devastating effect.  Black now forces an exchange of rooks.",
        "33... Rc8 34. Rxc8 Kxc8 35. Ke3": "35. Ke3 - Henry centralises himself and so does the black king.",
        "35... Kd7 36. Kf4 Bg2 37. g4": "37. g4?? - this is the move that throws away the win.  I thought that the f3 pawn could be potentially dangerous and my g pawn vulnerable to capture from the black king should Henry try and win the queenside pawns.  However, a post match pm from Coach Ion told me I had missed an opportunity by not sacrificing my backward b3 pawn and found a winning line for me, viz:- \"37.b4 axb4 38.a5 Kd6 39.Kf5 Bh3+ 40.Kxf5 \r\nFrom here, I reckon Black would have had to play very well to have held the draw!\"",
        "37... Ke6 38. g5": "38. g5 - offering the exchange of pawns and a draw.  I saw that after the trade there was no way Henry could get through to the queenside.  If Henry tried to get through on the bottom half of the board, the lsb could cut him off via the b1-h7 diagonal.  If Henry tried to go over the top then the BK could cut him off by moving onto d6 or d7 hence the draw offer.  I could have played on as my opponent's rating was south of mine but as black I got canned by him in the MT and he has been on a roll lately with a draw against a certain Expert.  So I did expect him to find the correct defense.  Ah well, c'est la vie.  Time to study pawn breaks, methinks.  Anyhow, well played, Michael."
    },
    "url": "https://gameknot.com/annotation.pl/the-traxler-variation-do-not-be-afraid-to-sacrifice-my-friend?gm=29981",
    "gameName": "- - The Traxler Variation - - Do not be afraid to sacrifice, my friend!",
    "players": "jstevens1 (1773) vs. nuntar (1668)",
    "opening": "two knights defence (C57), Wilkes Barre (Traxler) variation"
}