{
    "moves": {
        "1. e4": "I'll skip over the first few moves as the game only really deters from common practice of this  opening at move nine.",
        "1... c5 2. f4 d5 3. Nf3 dxe4 4. Ng5 Nf6 5. Bc4 Bg4 6. Qxg4 Nxg4 7. Bxf7+ Kd7 8. Be6+ Kc6 9. Bxg4 h5": "And here we have the point of this game. I had shortly before playing this played another of these games where I won using this move and easy19 challenged me to this game to show me the correct way that white should respond to this move.",
        "10. Bf5": "by far the best move here. It keeps white playing actively as well as keeping the pieces in touch with each other.",
        "10... e5": "A very poor choice by me. I even new that this is a bad move in this opening but for some reason I seemed to be under the impression that having played h5 somehow changes that. God only knows why I thought that.",
        "11. Bxe4+ Kb6 12. Nf7": "At first glance it appears white is getting greedy and only seeking the fork of the queen and h rook. In reality White is only using this square as a stopping station to get to a much better square (Being e5)",
        "12... Qe7": "? again I think a poor choice of moves. For some reason I seemed to think white might play Nxh8 then I could follow up with exf4. really all this does is misplace my queen and block in my own DSB.",
        "13. Nxe5 Nc6": "it is here I began getting glimpses of how bad my position really was. I began to realised the potential of forks  knowing full well that White would play Nc3! the move I just made is still good seeking to trade off even if it cant do so yet.",
        "14. Nc3": "! as I said, black would like to play Nxc5 but because of the fork threat it is impossible.",
        "14... Rd8 15. Ng6": "white has good piece co-ordination and realises that this move takes advantage of blacks lack of piece of coordination.",
        "15... Qf6 16. f5": "cements the knight in place.",
        "16... Rd4 17. O-O": "White just has time t do everything whereas black seems to be scrambling around with no real idea of whats going on.",
        "17... Rh7": "poor move but I could not think of any better. Having played Qf6 my queen is still vulnerable to king/queen forks. I would have liked to play Rxe4 but unfortunately the rook needs to stay on the d file to guard against Nd5+",
        "18. Nxf8 Qxf8 19. d3": "White is suddenly looking very very good. I'm afraid to say it just got even worse from here. I think I probably should have taken this opportunity to rid myself of whites annoying bishop.",
        "19... Rh8 20. Be3 Rd6": "makes my earlier Rd4 just look silly. Best here was most likely Qd8.",
        "21. b4": "And this is where my opponent said in chat OK here we go... I could see I was in a heck of a lot of trouble. anyone could see white is dictating this game. and has most pieces all in position for the attack.",
        "21... Rd4 22. bxc5+ Kxc5": "Qxc5?? Na4+",
        "23. f6 gxf6 24. Rab1 a6": "Done to prevent the rook nestling in on b5.",
        "25. Ne2 Qe7 26. Rf5+ Kd6 27. Nxd4 Nxd4 28. Bxd4": "black can almost wave the white flag here. it's good practice though to play losing positions, besides black still has pieces left on the board.",
        "28... Rc8 29. Rb6+ Kd7 30. Rd5+ Ke8": "Harbouring faint hopes that white might play something like Bf3. But alas no, Freddy did not wish to lose this encounter. maybe next time :P ",
        "31. Bg6+ Kf8 32. Rxf6+ Kg8": "Perhaps he will move his rook off the file?",
        "33. Rxh5": "Next few moves are just me making futile attempts to prolong the game an extra move or two.",
        "33... Qe1+ 34. Rf1 Qxf1+ 35. Kxf1 Kf8 36. Bf6 Rc6 37. Rh8#": "A good game to play despite my absolutely atrocious playing. I believe I learned alot though and am sure if I played one of these queen sac games again I would have a much better understanding of the type of unique play these games require."
    },
    "url": "https://gameknot.com/annotation.pl/demolition-derby-investigated?gm=39488",
    "gameName": "- Demolition Derby Investigated -",
    "players": "easy19 (2254) vs. thereaper1 (1432)",
    "opening": "Sicilian (B21), Grand Prix attack"
}