{
    "moves": {
        "1. e4": "The King's Pawn Opening.",
        "1... c5": "The, \"cornerstone\" of the Sicilian Defense.  However, this defense is not going continue, and there are several lines that easy 19 wants me to play.  This is going to lead to the Queen Sacrifice.",
        "2. f4 d5 3. Nf3 dxe4 4. Ng5 Nf6 5. Bc4 Bg4 6. Qxg4 Nxg4": "After this sac, you might think that the game is won, but, \"it is not so easy\" as Mr. Stockel would say.  That fact is important to remember inside and outside of chess.  In most cases, this type of Queen Sacrifice wins the game.  However, that is not going to happen here, and it will be explained later in the game.",
        "7. Bxf7+": "!! At this point, he decides to place me in check, and it is very serious because it is no longer possible for me to castle.  Therefore, my king will be exposed in the worst way.",
        "7... Kd7": "This move is forced because it is my only option.  After this, things will get very interesting, and I will explain this concept momentarily.",
        "8. Be6+": "In this position, what am I going to do?  Well, there are only three choices, and they are: 8...Ke8, 8...Kc7, or 8...Kd7.  Either way, he can win a free piece with 9.Bxg4, but I am worried about something worse.  What is it?  That will be answered shortly, with a shocking surprise.",
        "8... Ke8": "I was worried that he was going to fork my rook and queen, with 9.Nf7.  If he did this, I would be forced to retreat my queen.  Then, 10.Nxh8, winning the rook, so I played this move because I thought that it would prevent the fork.  However, I overlooked his LSB, so he could have played 9.Nf7.  Consequently, 9...Kxf7 would be illegal due to his bishop.  At this point, I know that I am loosing because my king is completely exposed, and there is nothing that I can do about it as I cannot castle.  As a result, he will continue to check me with Bf7+, followed by Be6+.  In the meantime, I will keep playing ...Kd7, followed by ...Kd8 because I spot an advantage.  What is the advantage?  If this continues I will be able to trick him into a 3-fold repetition.  BTW, this trick was planned, when 8.Bxf7+ was played.  On the other hand, I did not think that he was going to allow this, until he played 11.Bf7+.  That is because I have tried to trick Jack Stockel into a 3 fold repetition when: I was loosing, he was trying to mate me, and he was continuing to place me in check.  ",
        "9. Bf7+ Kd7 10. Be6+ Ke8 11. Bf7+ Kd7 12. Be6+": "Mr. Stockel would say, \"Don't give up right away\", and, \"If you know that you cannot win, try to get a draw\".  Something similar happened in my game against paulr1212 because I made a lot of blunders, and some of them were serious.  For that reason, I was in a loosing position and had almost lost, but I was also able to trick him into a 3 fold repetition.  After this game was finished, I learned something from easy19.  What was it?  Fred told me that he has played this variation many times and almost always wins with this queen sac, so I was lucky that he was not paying attention to this attempted trick.  On a normal basis, he would have captured the knight with 9.Bxg4, instead of playing 9.Bf7+.  If he took my knight or rook, the game would have been lost.  "
    },
    "url": "https://gameknot.com/annotation.pl/walking-the-walk-queen-sac?gm=45035",
    "gameName": "- Walking the Walk-Queen Sac",
    "players": "easy19 (2025) vs. jkarp (1077)",
    "opening": "Sicilian (B21), Grand Prix attack"
}