{
    "moves": {
        "1. e4": "In our first game, I played Nf3. I was playing that quite a bit back then. Since then I've read that is not a good opening move against those above the rating of 1800 or so. I've been using KP for a while now and having success at my level. ",
        "1... e6": "This is the French Defense starting position. A future move for black is d5. From what I've read and experienced, this defends the a2-g8 diagonal and reduces the f7 pawn weakness. However, it also blocks the black LSB. So in a sense, moves the weakness to the back row. A better player would probably know how to exploit this weakness, but I am not yet that experienced. ",
        "2. g4": "Black will naturally want to move d5, so I'd prefer to do something else. I think moving g4 may take him out of this mindset.",
        "2... h5": "Well, it worked. Now, I'm thinking this through. If I pass the pawn, I lose it, not an option. if I take the pawn, I trade, keep him from castling king side (one of my stretch goals!) and take his rook. That said, my queen ends up in the open, that's NEVER worked out in the past. ",
        "3. h4": "So I advance the h rook, hoping he takes the pawn... which I may pick up later. I want to disturb the kingside further.",
        "3... hxg4": "He takes the pawn. While I wanted him to do this, it always concerns me when a higher level player does exactly what you expect. It probably means I missed something. ",
        "4. h5": "But I stick to my plan.",
        "4... Nh6": "This move stops the advance and protects the g4 pawn, foiling my earlier idea of \"picking it up later.\"  Knights can be so pesky. Now I'm -1. I don't like being -1. Does anyone really?",
        "5. d4": "I think the black bishop will ultimately land on b4, so I want to get my pawn in play before then. This makes my DSB happy, because he can bear down on the pesky knight. In addition, it develops the center. I am thinking perhaps the next move will put me in bishop check.",
        "5... d5": "But, black continues with his original plans as well, pausing things on the kingside.",
        "6. Bxh6": "Death to the pesky knight!",
        "6... Rxh6": "Stretch goal almost complete, black will not castle kingside! However, that DSB is bound to check me soon.",
        "7. Nc3": "Waiting on the pin. I need to castle queenside now, so think this move will get things prepared.",
        "7... Qg5": "Well, I didn't see that coming. After reviewing this for quite a while, it appears I won't be able to castle in this game at all. I don't see anyway to interpose a piece and I certainly am not castling kingside. Having the black rook and queen in this configuration really I really miss my DSB. In fact, now that I'm looking at the pawn configuration, I REALLY miss my DSB. Don't think the pesky knight was worth it. ",
        "8. Qd2": "My thought process: (1) stalhandske can do a lot more damage with a queen than I. (2) the black advanced queen is more dangerous than my queen on the back rank. (3) I'm not going to be able to castle anyway, so exchange and get the king active.",
        "8... Qxd2+": "Black believes the exchange is a good idea. I am somewhat relieved because my rook was definitely in danger.",
        "9. Kxd2": "King flexing his muscles.",
        "9... Bb4": "There's the pin I expected a few moves ago.",
        "10. a3": "I think black will take the knight and that ends up with me losing my e pawn. I would say \"I'll pick it up later\", but we'll see how that will work out later. Good news is, I think my pawns in the center will be in good shape.",
        "10... Bxc3+": "Black does what I expected, which again, gives me pause.",
        "11. bxc3": "I think the black DSB was worth more than my knight given I had already sac'd my DSB and the d5-f7 pawn chain will limit his LSB.",
        "11... dxe4": "Lost my pawn.. but this leaves black with a couple of unsupported pawns in the center. I am -2 now, which is not good, but there are two currently unsupported black pawns hanging out in the center. The other thing I notice is there is a serious pawn imbalance on my kingside. I now turn my attention to \"picking them up.\" I also not black's queenside pieces are undeveloped. ",
        "12. Ke3": "King flexes his muscles on a pawn now. I don't see how black can immediately push the king around and now he needs to move to defend the pawn. This gives me the initiative, just not sure how long I can maintain. I expect 12...f5. I have a couple of things I can play 13. Bg2 seems the most straightforward or a two move knight play e2-f4... but will have to see how black responds first. ",
        "12... f5": "Black moves as expected.",
        "13. Bc4": "Tempted to check, but I really don't want to give black reason to develop queen side. Many moves from here, I see a potential fork at c7. I know odds of actually achieving this are remote given my opponents expertise, but it was fun on the analysis board. My only advantage is he may underestimate me.",
        "13... g5": "Here comes the pawns. I know I will ultimately have to sacrifice a piece to keep black from promotion. My king is very active, borderline maniac.",
        "14. Ne2": "Positioning my knight for a suicide run. I am going to continue maniac-king for a while.",
        "14... Nd7": "Black knight moved in preparation for the castle and threatening the bishop. Not sure black has seen the crazy look in the white king's eyes yet.",
        "15. Nf4": "I would rather sacrifice at mid board then struggle in the rear flank. Just not sure this is enough.",
        "15... gxf4+": "Maniac king is loving this move. I'm only hoping I get a chance to fork his knight & rook at g5. I've never forked with a king before.",
        "16. Kxf4": "I think maybe black realizes this is no ordinary king now. Hiiiyyaaaaaaaaaaaaa!",
        "16... Nb6": "Trying to calm the white king down, black decides to mess with the bishop. The king doesn't care.",
        "17. Kg5": "Frothing at the mouth now, the king can taste the rook's fear!! Hahhahaaaaaaaaaaaa.",
        "17... Rh7": "The rook retreats, but maybe not far enough...",
        "18. Kg6": "King is moving in for the kill. I think I'll lose my bishop here, but I'm definitely taking that rook if black doesn't run.",
        "18... Rh8": "A haiku in honor of the rook: \"Black rook straight your moves, Maniac King slow but fierce, there can be but one!\"",
        "19. h6": "White pawn is quite a menace. I intend on bringing my other rook to bear soon. I will likely lose a3 as well.",
        "19... Nxc4": "Bye bishop.",
        "20. Kg7": "The rook is dead. However, the Maniac King coming out of his Jihad state, realizes there is something amiss.",
        "20... e3": "Unexpected, but no distractions now.",
        "21. Kxh8": "No turning back now. The maniac King has achieved his goal, but at what price?!?",
        "21... Kf7": "There it is... not sure there's a way out of this, but it was almost worth it.",
        "22. Rab1": "Wait, what's this?!? The queen rook in action! Check me if you will black rook. I'm now after your b pawn. Not quite full Maniac Rook yet, but just need a little time.",
        "22... Kg6": "Awwwww, and we had such big plans ahead. It is probably best to put Maniac King out of his misery anyway. However, beware, for when he rises again, he will be Zombie Maniac King!!!  Muahahaahaahaaaaaaaaaaaaaa...",
        "23. h7": "...and so it ends, but at least I achieved one of my goals.",
        "23... Bd7#": "Thanks very much stalhandske for the game. I'd like to think you were concerned when the King did his crazy-eyed-running-with-his-hands-up attack, but nevertheless I enjoyed it very much. I would appreciate any feedback anyone would like to provide."
    },
    "url": "https://gameknot.com/annotation.pl/wtw-challenge-maniac-king-lives?gm=56249",
    "gameName": "--- WtW Challenge ---  Maniac King Lives!",
    "players": "russ20124 (1409) vs. stalhandske (2189)",
    "opening": "French defence (C00)"
}