{
    "moves": {
        "1. e4": "Hi everyone.  Here is another recent game where I exploit my opponent's failure to castle.  Another key factor is my ability to develop my pieces with threats, thus not allowing him to consolidate.  I continually add pressure to the King's position, even though there is a clear way to net material.  I hope you enjoy.",
        "1... e5 2. Nf3 Nc6 3. d4": "I hate the scotch.  I have played many games over the board against strong players who have played the scotch, and it is by far the hardest white system for me to play against.",
        "3... exd4 4. Nxd4 Nf6": "Fairly standard opening principals",
        "5. Nxc6 bxc6": "Capturing towards the center has many advantages.  In this case,  it allows me to play ...d5 right away, as well as opening up a file for the rook on a8 and a diagonal for the B on c8",
        "6. Bd3 d5": "Grabbing my share of the center",
        "7. e5 Nd7": "attacking the advanced pawn",
        "8. Bf4 Bc5": "Still developing pieces.  White's dsb is tied up defending this pawn",
        "9. a3 Rb8": "Placing the Rook on an open file with a threat.",
        "10. c3": "that he misses",
        "10... Rxb2": "Here, White needs to castle...badly",
        "11. Bc1": "but instead, he chooses to drive away the pesky rook",
        "11... Qh4": "once again, developing with a big threat.  From here, it is all downhill for white.If 12.0-0, 12...Bxf2  13. Kh1 Bg3.  If 12.g3, 12...Bxf7  13.Kf8 Qh3#.  Not looking good for white. ",
        "12. Qf3 Nxe5": "12...Nxe5!!  There are no good squares for the Q to go to defend f2.  Qg3 is met by Bxf2 , and a loss of the Q.  Qf4 is bet by...",
        "13. Qf4 Nxd3+": "Nxd3 ",
        "14. Kd1 Nxf4 15. Bxb2 Qxf2": "threatening Qe2 , Kc1, Bf4#",
        "16. Nd2 Bg4+": "adding another piece to the mating game",
        "17. Kc2 Be3": "pinning the knight",
        "18. Bc1 Qe2": "preparing for Qd3",
        "19. h3 Qd3+ 20. Kb2": "which takes a defender away from the knight",
        "20... Bxd2 21. Bxd2 Qxd2+ 22. Kb3 O-O": "castling to bring the final piece into the attack",
        "23. Ra2 Rb8+ 24. Ka4 Qxa2 25. Re1 Qc4+ 26. Ka5 Qb5#": "This game was very fun to play, and I hope it was entertaining to watch.  It should serve as an example to new players to protect your K at all costs."
    },
    "url": "https://gameknot.com/annotation.pl/and-the-kitchen-sink?gm=20674",
    "gameName": "...and the kitchen sink!!",
    "players": "yesiam (1362) vs. phishbone6984 (1457)",
    "opening": "Scotch (C45), Mieses variation"
}