{
    "moves": {
        "1. Nf3": "One of the interesting aspects of playing 1.Nf3 is to transpose to Queen's pawn openings with ready antidotes to a number of thematic replies : Nimzo-Indian, Queen's Indian, Grunfeld... and here's the case for the Dutch Opening. Notice that there is no real antidotes to the Slav, Semi-Slav system or King's Indian, with the 1.Nf3 move order to enter Queen's pawn openings.",
        "1... f5": "Ready to transpose to the Dutch opening after 2.d4 , but there's something unusual waiting for Black.",
        "2. d3": "Not the Lisitsin Gambit (2.e4 fxe 3.Ng5) which is now not so dangerous, but something similar and trickier to answer, which begins with an apparently modest move 2.d3 . What I very much like about 1.Nf3 is that the opponent generally does not know how to react correctly as it depends on the mood of his opponent to decide upon creating huge complications or just playing for small positional advantages. ",
        "2... Nf6": "About every plausible moves have been tried here for Black , 2...d5 trying a stonewall without d4 is not a good idea so the flexible 3.c4 must be a good answer. 2...Nc6 encounters 3.d4 and the Queen's knight is misplaced. ",
        "3. e4": "it is really dangerous to accept the pawn after 3...fxe4 4.dxe4 Nxe4 5.Bd3, as games published show.",
        "3... d6 4. exf5": "4.e5 or 4.Nc3 were also nice tries. The game move should be the most principled one, as the following exchange of white-squared bishops and opening of the center with d4 should highly favour White with white square weaknesses for Black in the open.",
        "4... Bxf5 5. d4 Nbd7 6. Bd3 Bxd3 7. Qxd3 e5": "Now White had just to exchange pawns on e5, and playing quietly and purposefully. Black has a huge task ahead to maintain equality dynamically, as his white square weaknesses will be a permanent burden. ",
        "8. Qb5": "Perhaps a good tactical move, but a messy one strategically, it was much better  to play 8.dxe5 as told before. ",
        "8... e4": "I was shocked by this move, happily I recovered as my position is not so bad after all. My mood after this good practical, aggressive move from Black was to reach a stable and good position and refusing further complications.",
        "9. Ng5": "While playing this move, I was feeling like George Clooney waiting for his espresso : What else ? ;-)",
        "9... Qc8": "Somewhere Black must have gambited one or two pawns by playing 9...d5 consolidating the center, and taking further the initiative to launch an attack. It would have been good strategy. Here, after this move 9...Qc8, I just have the time to retreat, castle, and take a good position.",
        "10. O-O c6": "Black must play this first to entangle his pieces.",
        "11. Qe2 d5 12. f3 h6": "Also a necessary move winning time for Black to regroup but exchanging his dark squared Bishop vs my Knight.",
        "13. Ne6 Nb6 14. Nxf8 Rxf8 15. Bf4": "With the exchange of minor pieces, Black has lost the right to castle king-side, and my bishop will be perfectly nagging behind his pawn chain and near his future queen-side castle.",
        "15... Qe6 16. Nd2 O-O-O 17. Rae1 Rde8": "Each camp has calmly regroup its pieces.",
        "18. fxe4 Nxe4 19. Nxe4": "19...Qxe4 was not possible due to 20.Qg4   winning material.",
        "19... dxe4 20. b3": "Now the plan is simple for White : just push his queen-side pawns, and any opening for his heavy pieces on the castle will be deadly with the help of Bf4.",
        "20... Nd5 21. Be5": "threatening the e4 pawn.",
        "21... Nf6": "covering the e4 pawn",
        "22. b4": "Trying now to open files on the queen-side",
        "22... b5": "good defensive move !",
        "23. c3 Rf7": "Perhaps 23...Qc4 saved the day for Black but after 24.Qxc4 bxc4, his pawns are frighteningly scattered for the coming ending.",
        "24. a4 a6 25. axb5 cxb5 26. c4": "Always obsessed by opening the queen-side.",
        "26... Kb7 27. cxb5 axb5 28. Bxf6": "A small trick to eliminate a defender of Re8 when Qxb5 comes.",
        "28... Rxf6 29. Qxb5+ Kc7": "29...Qb6 was not possible due to the Re8 \"en prise\".",
        "30. Rxf6 gxf6 31. Rc1+ Kd8 32. Qb7 Qd7 33. Qb6+": "Forcing 33...Ke7 then 34.Rc7 wins the Queen and subsequently the game. So Black resigned."
    },
    "url": "https://gameknot.com/annotation.pl/1-nf3-anti-dutch-opening-setup?gm=14709",
    "gameName": "1.Nf3 anti-Dutch opening setup",
    "players": "ifuinsist (1731) vs. silberruecken (1798)",
    "opening": "Reti (A04), Lisitsin gambit deferred"
}