{
    "moves": {
        "1. e4": "we are currently playing our 12th game where my opponent broke the ice on our 10th game. with a nice checkmate, i have to say, i overlooked drastically in over confidence, after our track record with each other.",
        "1... e5": "and after that win he was able to hold me back for 45 moves as white until it came down to 1 pawn being 1 square ahead of his king. the series continues. its already brought me 2 nice annotations.\n\nthis is not our 11th game, this was about our 3rd game in the series while we were still freshly met opponents",
        "2. Bc4": "early in our series, and usually against new opponents when i play as white, i tend to stick with what we all know i like and am comfortable with, the bishops opening.",
        "2... d6": "i wasnt well accustomed to my opponents highly defensive play that he showed in our later games. Why im saving this game is it brought a nice ending sequence of a 10 move forced mate which i created a puzzle with.  and so i wanted to also save the game, before it fades away to where i cannot see it anymore, in memory of what created the puzzle",
        "3. Nc3": "i go with my more aggressive nc3 line instead of d3",
        "3... Nf6": "it was bound to be one of the knights eventually after having blocked in the DSB",
        "4. h3": "and i decide to sneak this in to prevent the LSB exit",
        "4... c6": "preparing a b5 most likely or d5",
        "5. d4": "and so i strike forward!",
        "5... Nbd7": "wow unanticpated reply.  i was expecting all kinds of exchanges in the middle. hmmm lets explore something new too then!",
        "6. f4": "f4!  i look at the position, and i dont know why but i love it for some reason. 3 pawns lined up in the middle. lets see what my opponent chooses to do now lol",
        "6... b5": "attacks my LSB.  i dont want a tempo war dancing my lsb around. ill trade for his knight!",
        "7. fxe5": "chomp! also opens the file after i castle",
        "7... dxe5": "retakes before taking the LSB hmm curious!",
        "8. dxe5": "ill still go for the trade i wanted. LSB for knight. he can have some nice double pawns",
        "8... bxc4": "and he accepts",
        "9. exf6 Nxf6 10. Qxd8+": "time to swap out queens! i had looked at a cruel line cause of my e pawn",
        "10... Kxd8 11. Bg5": "pin the knight force be7 or face a second double pawn. plus now it allows long castling for a check instead of going king side castle",
        "11... Be7": "anticipated",
        "12. O-O-O+": "check!",
        "12... Nd7": "hmm thought he would block with the LSB not the knight",
        "13. Nf3": "protect my DSB + develop last minor piece",
        "13... f6": "perfect what i was hoping he would do. instead of swapping out the DSB's. hence why i said my E pawn was cruel!",
        "14. e5": "here it comes. i think you should take the pawn my friend. but all avenues are looking rough with the pin at the moment!",
        "14... fxg5": "takes the dsb! i was hoping he would just to explore this line and it looked enjoyable!",
        "15. e6": "onwards with the plan to equalise",
        "15... Bf6": "attacks my night.i was wondering if he would send in his DSB after i take his knight",
        "16. exd7 Bxd7": "he decides to recapture, ",
        "17. Ne4": "but this allows double pressure on the g5 pawn and h6 looks like the natural reply.",
        "17... h6 18. Nc5": "but h6 loses the LSB... ouch",
        "18... Kc7": "i guess he atleast wants his rooks connected and wants to hide his king behind his closest pawns",
        "19. Rxd7+ Kb6": "forces a knight retreat",
        "20. Ne4": "time to get that DSB off the board",
        "20... Raf8": "reinforces with the Rook i look and that was either a wasted tempo or a future protection of the f pawn",
        "21. Nxf6 gxf6": "if he took with the rook i wouldve taken his g7 pawn",
        "22. Re1": "and so i take control of the other open file",
        "22... h5": "my opponent doesnt have many moves left ",
        "23. Ree7": "i stack the rooks on a very high rank",
        "23... g4": "opponent comes down.",
        "24. hxg4 hxg4 25. Ne1": "and so i protect my g pawn block a check from his Rh8 and look at the board. i can see a checkmate from here. all i got to do is move his c4 pawn",
        "25... a5": "doesnt want to lose a hanging pawn",
        "26. b3": "my attempt at budging the c pawn",
        "26... c3": "hmm passes.  ooo dangerous Rh1 is a potential lights out for me. no miss steps from here! but its too late when that c4 pawn move. my opponent only gets to play his king a maximum of 10 moves \n",
        "27. Rdb7+ Kc5 28. Nd3+": "my opponent did not last the maximum ten moves"
    },
    "url": "https://gameknot.com/annotation.pl/10-move-mating-sequence-comments-appreciated?gm=59184",
    "gameName": "10 move mating sequence. comments appreciated",
    "players": "trixstermtl (1522) vs. swordfish2020 (1406)",
    "opening": "Bishop's opening (C23)"
}