{
    "moves": {
        "1. e4": "Oh SQUEAK.\n\nDidn't deserve to win this one, had to attack my way out of trouble.",
        "1... e5 2. Nf3 Nc6 3. Bc4 h6 4. d4 exd4 5. Nxd4 Nge7": "Not convinced about that one. I didn't want to take the knight, so I was deffing, but obviously blocking development of queen and bishop.",
        "6. Qf3 f6": "Can't take the freebie cos of the mate in one.",
        "7. O-O Nxd4": "But can now ;-)",
        "8. Qd3 Nec6 9. c3 Ne6": "Quite happy to transfer the d pawn over to e",
        "10. Qg3 Qe7 11. Nd2 d6 12. Nf3 Ng5": "Again quite happy to try and move the h pawn to g and free up my rook",
        "13. Nd4 Nxd4 14. cxd4 Bd7": "I wanted to take the e pawn but I saw bad things happening with R-e1 pinning the knight, so I'm moving stuff out of the way first.",
        "15. Re1 O-O-O 16. f3 b5 17. Bd3 c6 18. b4 Re8": "This was in preparation for d5, to try and get into his back sectors.",
        "19. a4 d5 20. axb5 Qxb4 21. Ba3": "That looked very speculative at the time and I still think it was a mistake on his part. But it does lead to a good situation.... for him.",
        "21... Qxd4+": "Initially however he gets forked....",
        "22. Kh1 Qxd3": "...and loses the bishop. 7 points up, well in control...everything good....",
        "23. Bxf8 Rhxf8": "Don't mind swapping pieces with my material advantage.",
        "24. Rxa7": "And then I realise I'm in trouble.",
        "24... Ne6": "I looked at several alternatives. In the end this seemed to be the best...",
        "25. b6": "Now my opponent is making full use of my queenside weakness.",
        "25... Kd8 26. b7 Ke7 27. Rea1 dxe4": "This wasn't so much an attacking move, more trying to find a way for my queen to get back.",
        "28. h3 e3 29. Ra7a8 Qd6": "Desperation time..",
        "30. Qe1 Qd2 31. Qb1": "At this point I was ready to resign, but I thought I'd just play one more move.",
        "31... Nf4": "And how critical it turned out.",
        "32. Rxe8+ Rxe8 33. Qg1": "And with that move I start to see a glimmer of hope. ",
        "33... Rb8": "First objective of course is to stop that pawn. If that queens then I'm still in bother.",
        "34. Rb1": "Perhaps a weak move, allowing me the initiative.",
        "34... c5": "Allowing B-c3",
        "35. Rd1 Qf2 36. Qxf2 exf2 37. Rf1 Nd3": "And now the game has swung back completely. The sole threat the b2 pawn which I should be able to cope with. He can attack the knight but thats easily defensible or even sackable.",
        "38. g3": "That does him no favours.",
        "38... Bxh3": "And there he decides he has had enough. But #24 took several years off my life!"
    },
    "url": "https://gameknot.com/annotation.pl/100th-gk-tournament?gm=49122",
    "gameName": "100th GK tournament",
    "players": "puge (1356) vs. grey_panda (1476)",
    "opening": "King's pawn game (C50)"
}