{
    "moves": {
        "1. e4": "e4 open to me is the strongest move from any opponent.  d4 runs a close second choice to e4 open.  I am Black and my usual is the Caro Kann against e4....",
        "1... c6": "...and so it is my most comfortable defense against the strongest White Open: e4. ",
        "2. d4": "A strong and expected response to the seemingly diminutive first move of Caro Kann Defense.  ",
        "2... d5": "The usual thing to do here in Caro Kann...",
        "3. Nc3": "A usual thing for White to do....",
        "3... dxe4": "a usual thing for me to do...",
        "4. Nxe4": "the usual expected response to my usual.  Now comes the Caro Kann Defense to attack the knight:",
        "4... Bf5": "A usual Caro Kann maneuver--but keep in mind Caro has more options in most times to usual moves by White to deal with the diminutive Caro Kann c6 defense to e4.....",
        "5. Ng3": "My bishop is out and he needs to avoid capture.  I have to place him in a safe yet ready place for use. ",
        "5... Bg6": "Best place and the usual for Caro Kann. ",
        "6. Nf3": "This is an expected move for White to make.  In fact White has been doing the standard moves since e4 open on my favorite: The Caro Kann.  ",
        "6... e6": "I inch forward with another seemingly diminutive move....",
        "7. Be2": "Usually I would have expected White to apply pressure King Side by going after my Q Bishop.  Not the case here. However, on the surface, this seems to be a safe move for White allowing 0-0 in the next move.  This is where White, who should be on the Offensive, becomes Defensive.  White should either attack and go out in a blaze of glory or resign or play a long game against a slow Black Defense like the Ruy Lopez.  Or Giuoco Piano. Or French Defense.  I am set in my ways.  The Caro Kann can suddenly turn the tables with attack at any time. ",
        "7... Bd6": "Castling for White in a protective ensconced corner of the board is now under contemplation....",
        "8. O-O": "White castles. ",
        "8... Nd7": "Standard for Caro Kann.",
        "9. Be3": "A build up around the White King while developing. ",
        "9... Ngf6": "The other Knight coming into sequence and position with the other Knight coming across more laterally than vertically--in Caro Kann the Knights are used beyond the usual defenses.  They act in sequence like two rooks mated.  ",
        "10. c4": "White is pushing Infantry at the expense of the range of his Bishops....",
        "10... h6": "Since White is locking himself down into defense my only choice is to continue an attack.  It continues with another diminutive move common in the Caro Kann. ",
        "11. Qd2": "I don't think this is the best position for White's Queen but as long as White's own lockdown is in effect why not apply more pressure to the g3 Knight?",
        "11... Qb8": "Thusly. ",
        "12. Rac1": "With this move there is a collection of locked down pieces all together that should be scattered instead of in one place for a grenade....",
        "12... Ng4": "I launch the grenade. ",
        "13. Ne5": "I haven't taken the time to castle but another opportunity to make the most of my grenade into the pack of pieces seems irresistible. ",
        "13... Nxe3": "Thusly. ",
        "14. Nxd7": "It is really too late at this point for White to offend. ",
        "14... Nxf1": "He can have my Queen in the rear zone and I can have his with the grenade depending on his choice here. \nWhite with e4 Open (strongest White Open) is defeated with the Caro Kann Defense.  White resigns.  "
    },
    "url": "https://gameknot.com/annotation.pl/100th-gk-tournament?gm=49653",
    "gameName": "100th GK tournament",
    "players": "sark22 (1733) vs. 9422m (1927)",
    "opening": "Caro-Kann (B18), classical, Flohr variation"
}