{
    "moves": {
        "1. e4": "e4! I love the open games!!",
        "1... e5 2. Nf3 Nc6 3. Bb5": "This is the Ruy Lopez. Very old opening found in manuscripts from the middle ages. White influences the center by attacking the knight that controls d4,e5.",
        "3... f5": "I have been exploring this move, known as the Schliemann Defense. Not seen much in top level games. but it seems to have some tactics. Much like a Kings gambit reversed perhaps. Other moves possible here are: Nd4 Bird's Defense, d6 Steinitz Defense, Bc5 Cordel Defense,  Nf6 Berlin Defense, a6 Morphy Defense. \r\nI am also fond of Gambit play, and this seems to gambit a pawn. ",
        "4. Bxc6": "the Bishop takes two moves to capture the knight that has only moved once.",
        "4... dxc6 5. exf5 e4": "the isolated pawn shows its power to disrupt! A soldier on a suicide mission!",
        "6. Ne5 Nf6": "?! perhaps Bxf5 but the intruder is now immobile. This also protects the isolanti.",
        "7. Qe2 Bxf5": "capturing and covering e4.",
        "8. d3 Bd6 9. Nc4": "The knight moves again. I am two steps from finishing my development. White only has the knight and queen out.",
        "9... O-O 10. Bg5 exd3": "My development is further along, so I open up the position. Perhaps Qe2 was first called for. I have a habit of rushing things.",
        "11. cxd3 Re8 12. Ne3 Qd7 13. Bxf6 gxf6 14. O-O Bg6": "? a wasted move.",
        "15. Rd1 Re6": "preparing to double rooks on the open file.",
        "16. Nc3 Bf4 17. Na4 b6": "removing the threat of Nc5.",
        "18. Rac1 Rae8 19. Qc2 c5": "? questionable. I think Qe7 looked better.",
        "20. Qb3 Bxe3 21. fxe3 Kg7": "I did not see that the rook was pinned. argh!",
        "22. e4": "now the file that I had control over is blocked!",
        "22... Qd4+ 23. Kh1 f5 24. Rc4 Qf2 25. Qc3+ Kh6 26. Qd2+ Qxd2 27. Rxd2": "this is about equal. his knight is poorly placed on the rim, my bishop is currently bad with the kingside pawns on lite squares. if allowed Re2, then there could be a powerful passed pawn on e4.",
        "27... fxe4 28. h3": "? this allows me to get the passer.",
        "28... e3 29. Rd1 e2 30. Re1 Bxd3": "?? I did not see b5! forking the rook and knight. now I am two pawns up. The plan is to exchange the power of the passed pawn for a winning endgame.",
        "31. Rf4": "the rook prevents me from using the f file to promote the pawn.",
        "31... Kg5 32. g3 Rf6 33. Rxf6": "the first exchange",
        "33... Kxf6 34. Nc3 c6 35. Kg2 b5": "the queenside majority starts their advance.",
        "36. Kf2 b4 37. Nxe2": "now all the pieces go",
        "37... Bxe2 38. Rxe2 Rxe2+ 39. Kxe2 c4": "preventing Kd3.",
        "40. Ke3 Ke5": "I am very happy my king is in the center. Now I am able to advance the c pawn to promote, or gobble up the white pawns on the kingside if he abandons them.",
        "41. g4 a5 42. h4 c3": "my pawns are now unstoppable, he cannot cover both sides.",
        "43. bxc3 bxc3": "isolated and weak, but he is forced to give full attention.",
        "44. Kd3 c2": "To take the king even further from the main action.",
        "45. Kxc2 Kf4 46. Kd3": "if 46.Kb3 then ...c5 47.Ka4 c4! and he is distracted again.",
        "46... Kxg4 47. Kd4 Kxh4 48. Kc5 Kg3 49. Kxc6 h5": "0-1"
    },
    "url": "https://gameknot.com/annotation.pl/10222b?gm=2487",
    "gameName": "10222b",
    "players": "winstond (1355) vs. jeffegg2 (1389)",
    "opening": "Ruy Lopez (C63), Schliemann defence"
}