{
    "moves": {
        "1. d4 Nf6 2. c4 e6 3. g3": "this is called the Catalan opening, it seems passive but can become exciting with moves like Bb4+",
        "3... c5": "Black is trying to contest whites strong centre pawns.",
        "4. d5 Bd6": "this move is both good and bad, it is blocking the D-pawn but if 5.dxe6, dxe6 then white cant come down with 6.Qxd8+ causing the king to be forced to move.",
        "5. Bg2 h6 6. Nf3 O-O 7. Nc3 a6 8. Be3 b5": "in my opinion, better was the more aggressive 8...Ng4. ",
        "9. cxb5 exd5 10. Nxd5 axb5 11. Nc3 b4": "this is a blunder, the queen can take the B on d6 and although black has bxc3 to win back the piece the pawn on c3 can be recaptured and black is down a pawn.",
        "12. Nb1": "this move is not a disaster for white but wastes a lot of time.",
        "12... Na6": "this is a clear blunder, black is dropping a piece.",
        "13. Qxd6 Qa5 14. Bxh6": "this move looks nice because of gxh6, Qxf6 but black did not see b3+",
        "14... Ne4 15. Qd5 b3+": "now black sees the move but it is not of as much use.",
        "16. Bd2 Nxd2 17. Nfxd2 Rb8 18. O-O Bb7": "black sacrifices another pawn but is skewering through the Q and B.",
        "19. Qxd7 Bxg2 20. Kxg2 Rfd8": "the key to playing when behind is not being passive, which black has done. although bxa2 was probably better.",
        "21. Qf5 bxa2 22. Nc3": "black accidentally drops a piece. ",
        "22... Rxd2 23. Rxa2 Qb6 24. Rfa1 Nb4": "if this game were continued from this point by two very high rated players e.g. 2400, it would definitely be a win for white. but at 1600 level 2 pawns wont make much difference, one mistake can easily change the game.",
        "25. Ra2a8 Qb7+ 26. f3": "f3 is a game-changing mistake, instead Qe4 would have blocked the check and defended the rook on a8.",
        "26... Rxa8 27. Rxa8+ Qxa8 28. Qxc5 Nd5 29. Kh3 Nxc3 30. Qxc3 Rxe2": "this game is now certainly going blacks way.",
        "31. b4 Qd5 32. Qc8+ Kh7 33. Qg4 Qe6": "at this point white resigns. apart from a few blunders it was well played by both players."
    },
    "url": "https://gameknot.com/annotation.pl/107th-gk-tournament?gm=51353",
    "gameName": "107th GK tournament",
    "players": "japanesebeef1 (1520) vs. houstoknight (1610)",
    "opening": "Catalan opening (E00)"
}