{
    "moves": {
        "1. d4 d5 2. c4": "I start with the queen's gambit.",
        "2... dxc4 3. e3 Bf5 4. Bxc4 e6 5. Nc3 Bb4 6. Bd2 Bxc3 7. Bxc3": "White has a slight lead in development, but his DSB is bad.",
        "7... Ne7": "Why not f6?",
        "8. Nf3 Bg4 9. h3 Bxf3": "?! I'm not sure if this is a good move. It trades a bishop for a knight, loses his only active piece and allows my queen to develop.",
        "10. Qxf3 c6": "White has an edge here. I'm fully developed, have the bishop pair, (although my DSB is still miserable) and I am much more active than black.",
        "11. O-O b5": "He pushes back my bishop, but he should finish developing.",
        "12. Bb3 O-O 13. a3": "Gives my LSB an escape hole in case he pushes his a pawn.",
        "13... Nf5": "! Gets his knight more active. He still needs to develop his other knight though.",
        "14. Rfe1 Nh4": "?! It does chase my queen, but he *really* needs to finish developing. This also brings his only active piece onto the edge.",
        "15. Qg3": "? Better would have been g4. This lets him chase my queen again and move back to his earlier spot.",
        "15... g5": "? And he doesn't. He seems to want to preserve his knight's position on the rim even if it costs him his king safety. I don't see why he doesn't just play Nf5. He would have made his knight more active and chased my queen.",
        "16. f4": "! Undermining support.",
        "16... Nf5": "*Now* he moves back, after he's compromised his king safety.",
        "17. Qg4 f6": "Supporting the advanced g pawn.",
        "18. Bxe6+": "...But allowing a fork.",
        "18... Kg7 19. Qxf5": "Now black is in BIG trouble. He's down four points and my bishop and queen are hovering over his king.",
        "19... Qd6 20. d5": "Defends my LSB and clears the way for my DSB to join the attack.",
        "20... c5 21. b4": "Preventing him from chasing my DSB.",
        "21... cxb4": "?? Loses a rook to a skewer.",
        "22. axb4": "???? I don't spot it until right after I make my move.",
        "22... Qc7 23. Rac1": "I threaten a discovered attack.",
        "23... Qb6 24. Bd4 Qd6": "?? And he gives me another chance. This time, I take it.",
        "25. Bc5 Qd8 26. Bxf8+ Qxf8": "?? Blunder, now he'll lose his queen and soon will be checkmated.",
        "27. Rc7+": "!",
        "27... Kh6": "Allows instant mate. He could have drawn it out by blocking with his queen.",
        "28. Qxh7#": "Please comment and rate."
    },
    "url": "https://gameknot.com/annotation.pl/110th-gk-tournament?gm=52624",
    "gameName": "110th GK tournament",
    "players": "porcho (1106) vs. rahulfj (1285)",
    "opening": "Queen's gambit accepted (D20)"
}