{
    "moves": {
        "1. d4 d5 2. Nf3": "The King's Pawn Game. I'm varying my openings to avoid predictability, and to keep my opponents guessing.",
        "2... e6 3. Nc3": "Development is key for me - get the knights out.",
        "3... Nf6 4. h3": "Now that Black has a knight out, I decide that I need to restrain it, along with his queenside bishop.",
        "4... Bb4 5. Bd2 Bxc3 6. Bxc3": "I think this was a good trade for me - I have two developed pieces to Black's one, and all my pawns are straight.",
        "6... O-O 7. e3 Nc6 8. Bb5 Ne7": "I was hoping to distort Black's queenside by trading pieces, however, he read it. Computer analysis suggested 8... Ne4 was better, with me having to avoid queenside distortion myself.",
        "9. Bd3 c6": "Now I have a bad light-squared bishop - it can't move forward without me losing material.",
        "10. O-O b5 11. a4": "I was hoping to isolate Black's queenside rook's pawn by trading on a4, and get my rook into play...",
        "11... Ba6 12. axb5 Bxb5": "...and I have done just that. Why didn't he recapture with the pawn: 12... cxb5, by anticipating that I may be expecting to exchange bishops? Computer analysis suggested that I should have done 12. Bb4, with a view to a better attack.",
        "13. Ra5 a6": "Black has anticipated the treat of me winning a pawn.",
        "14. b3": "This move was to give the rook's starting square extra cover, should its starting file (the a-file) become open.",
        "14... Nd7 15. Nd2": "I think this my only bad move here...",
        "15... Bxd3 16. cxd3": "...as now my queenside is slightly distorted, with doubled pawns on the d-file, and an isolated knight's pawn.",
        "16... Qc7 17. Qa1": "I'm adding an extra prong to my attack on Black's isolated pawn, hoping to open up the a-file and exchange a pair of rooks should I win the pawn...",
        "17... c5 18. Rxa6 Qb7 19. Rxa8 Rxa8": "Black has squandered a pawn and a rook exchange here: after grabbing the pawn, I have also got an exchange I was seeking, to make my pawns and minor pieces more of a threat.",
        "20. Qb2": "My queen must move away from the open file, as Black's rook is controlling it, still, my own rook can contest it, being covered.",
        "20... c4": "Black has made a mistake here. Was he hoping I'd open up the b-file, to have it contested?",
        "21. dxc4": "As a result, my pawns are straight once again, and connected, with none isolated, and my pawn on b3 is now passed.",
        "21... Nb6 22. Ra1": "Now, with my rook covered, it can contest the open file. With a two pawn advantage, and a passed pawn, the other exchange will help them enormously.",
        "22... Nf5 23. Rxa8+ Qxa8": "Again, Black has allowed another rook exchange. This is allowing my pawns and minor pieces to be more of a threat, being two pawns up, one passed, and exchanging four rooks, with a material advantage is, in my opinion at least, better than exchanging a pair of queens. Computer analysis suggested that Black should have recaptured with the knight, to keep some pressure on the b-file.",
        "24. c5": "This was a very forceful move by me, Black's knight is forced to retreat, and I now have two passed pawns. Notice that I also have a four pawn chain.",
        "24... Nc8 25. b4": "I'm being bold here: with my other passed pawn covered by my queen, I can advance it in the hope of promotion.",
        "25... Nfe7 26. b5 Qa4": "Computer analysis said this was a mistake: my pawn now has a clear run where I will gain material: it is not possible for Black to save his queen and both knights.",
        "27. b6": "This now gives me a five pawn chain. How rare is that - five pawns lined up diagonally?",
        "27... Qd1+": "This was an almight blunder by Black: I'll soon have a queen advantage. Neither of his knights are near enough to check once my king moves onto h2.",
        "28. Kh2 Qa4 29. b7 Qa7 30. b8=Q Qxb8+ 31. Qxb8": "Again, I've been very forceful here, not captuing the knight has allowed me to with the queen for a pawn, and I now have a very significant advantage. ",
        "31... g6 32. Bb4": "Time to add an extra prong onto my attack, with one of Black's knights pinned, the other will be under threat once the pawn starting in front of my biship moves...",
        "32... Kg7": "...but Black has read this threat again. However, another promotion is on...",
        "33. Nf3 Nf5 34. Qxc8": "Was Black losing concentration here? Now that his knight has moved, I have captured its twin, and my task of mating is now easier.",
        "34... h6 35. c6 h5 36. Qf8+": "Now my queen can begin to get closer to the action.",
        "36... Kf6 37. Qh8+": "Has Black placed his king on h7, I could have played 37. Ng5 and mated, however, I can remove more material and mate all the same.",
        "37... Ng7 38. Bf8 Kf5 39. Qxg7": "Now that Black's knight has gone, his king is running out of squares.",
        "39... f6 40. c7 Ke4": "His king can run, but he can't hide...",
        "41. Qxg6+ f5 42. Qxe6+ Kd3 43. c8=Q": "...as not only have I swiped two of Black's pawnes, I've queened another of mine.",
        "43... h4 44. Qea6+ Ke4 45. Nd2#": "I had plenty of possibilities here, but I felt my knight deserved the honour of being the mating piece, as it had been relatively quiet. Shows that being forceful can pay off, and my original queen did most of the damage."
    },
    "url": "https://gameknot.com/annotation.pl/128th-gk-tournament?gm=59944",
    "gameName": "128th GK tournament",
    "players": "aspiemikey (1548) vs. vandoostlo (1338)",
    "opening": "Queen's pawn game (D02)"
}