{
    "moves": {
        "1. e4": "In today's episode of I annotate a game I enjoyed playing, we play a peculiar opening, I sac a piece for an attack, my opponent defends reasonably well, I wonder if I'm winning, and then rely on a mass of pawns to carry me to victory. In all seriousness this game was a lot of fun to play and I think shows one possible way to break down a fiancetto structure and also shows some mistakes not to fall into. This was a game in a GK tournament against a lower rated opponent and I really wanted to play well. Let's see what happened. ",
        "1... e6": "\"Ah, the French\" I think. ",
        "2. d4": "I don't mind playing mainline French, normally preferring the Tarrasch variations. ",
        "2... d6": "Not the french after all. This is already something of an odd move that I don't see very much. This is a Lengfellner system and seems to be good for white. It's not that this is so much of a mistake as it is just very passive. Black can play g7 and b7 and aim for some sort of hedgehog system or something similar, but giving white this nice center and easy development seems not to be such a great idea. On the other hand if you play this a lot as black you'll run into people who don't know how to break such structures down and can get an opening advantage from just general lack of knowledge on how to play against these systems. ",
        "3. Nc3": "Normal development. Nf3, c4, f4 all seem totally reasonable. Even some bishop move might be fine, if somewhat commital. I like this move or Nf3 because they are flexible. ",
        "3... g6": "With the pawns on d6 and e6 black needs to develop somehow. ",
        "4. Nf3": "The most natural square for the Knight. It seems likely black will play Nf3 or Ne7, Bg7 and O-O. I might be able to jump into g5 and really pressure this structure with this move. ",
        "4... Bg7": "Of course. ",
        "5. Be3": "A fine place for the bishop. I was currently thinking of Qd2 O-O-O and some sort of kingside attack. ",
        "5... Bd7": "This move seems slow and as Nc6 is probably coming at some point kind of tangles up black's pieces in a needless way. If I were to play black I might suggest b6 aiming for Bb7. Not how I normally play but probably fine. ",
        "6. Qd2": "Carrying out my clever (read obvious) plan. ",
        "6... Ne7": "Still passive but probably reasonably solid. I wonder if this is aiming at some f5 break after O-O. Not sure if that's good as white is clearly going queenside and so opening the kingside seems better for white but it is a plan. ",
        "7. O-O-O": "Plan achieved. ",
        "7... O-O": "This right now looks dubious to me. At least some Nc6 here develops and lets black consider going queenside as well. This is asking white to jam the h-pawn up the board. So of course I...",
        "8. Bh6": "don.t. Clever me. This move is actually fine and something I plan on playing. Bxh6 Qxh6 with N5 to follow is clearly not good for black so taking is kind of out of the question right now and the bishop is pinned to the rook so this structure isn't going anywhere. Any time white wants to they can take on g7 and rid black of his best defender. But if I were to do it again h4 h5 and g4 g5 are really asking to be played here. Not a mistake, but also not the best. Against this structure with opposite side castles always h4. Look at the dragon. Same idea. ",
        "8... f6": "This move is really as good as any. The computer gives white about a pawn up here. But it does for most moves. Even Bxh6 about a pawn. Not great but not dead either. ",
        "9. h4": "Better late than never. Taking on g7 already is also fine. ",
        "9... e5": "This is very weakening. Striking in the center is a good idea if you're being attacking in the flank to try to create some counterplay but here d5 looks better. The main reason why I like d5 so much more than e5 is because of the holes that lead straight to the king. Also Bxh6 is...ok. Not great with pieces gathering to attack, but ok. Maybe Nc6 is also fine. Nothing to panic about yet. ",
        "10. Bc4+": "Developing with tempo and forcing the king to a corner where white controls all the square around the black king. ",
        "10... Kh8": "The computer suggesting giving the d pawn to white with 10..d5 11. Nxd5 Be6 but to me that idea almost asks white to come and rip their position open with a nice easy 12. dxe5 and it looks like black is falling apart. This is not great either but perhaps white will make a mistake in the attack? so far material is equal. ",
        "11. h5": "?? oh no. This is much too hasty and gives back a lot of the advantage that white has. Why? Because now g5 closes a lot of white's pieces out of the position. Better is g4 or taking on g7 and trying to rip open the center with dxe5 and taking advantage of the pressure and development. Not a game losing mistake, but white has gone from much better to slightly better with this move. ",
        "11... g5": "Too soon. 11..Bxh6 12. Qxh6 g5 locks the queen up in the corner where she isn't so useful. White can now take on g7 and strike in the center or something similar. Trapping the opponent's queen so close to your king with no escape square seems rough but it would slow white's attack down and give black time to develop and try a counterattack or something. ",
        "12. Bxg7+": "Pretty sure this is forced. ",
        "12... Kxg7": "Of course. So how will white take advantage of being so far ahead in development with a safer king? ",
        "13. Nxg5": "!? A sweet piece sacrifice. At the time I thought this was winning by force but I didn't calculate as well as I should have. White is winning pawns for the pieces and with a weak black king is still better but this is not as good as the more solid (also more natural) dxe5. Consider the following line options. 13. dxe5 fxe5 14. Qxg5+. Clearly good for white, getting the same check in without giving up the piece. 13. dxe5 dxe6 14. Nxe5! (see how with the open d-file with a pin against the bishop the Knight sacrifice is suddenly much stronger) fxe5 15. Qxg5+ Ng6 (15..Kh8 is mate in 2. Nice little puzzle if you missed it) and then just 16. Qg3 with many pins to win. White is winning back the piece easily, will be up at least 2 pawns, open and controlled h file, pinning the bishop down the d file a bishop and knight controlling important squares around the king and getting ready to make a mating net. Other options are also 13. h6+ (flexible move stopping black playing it at some point but maybe the king is safer on h8 where Qxg5 isn't a check? hard to say.) ",
        "13... fxg5": "King into the corner and black is clearly worse. This is forced. ",
        "14. Qxg5+": "Alright. When you sac you have ask yourself what concrete things you get for the sac and weigh them against the sac. Here white has given up a knight and in return gets: 1. 2 pawns (not material equality but not so bad) 2. A free tempo (very useful in this sharp position) 3. Black has a very airy king (making his position hard to play due to tactics that might be coming. 4. more active play (also easier to make moves) (This of course would be true without the piece sacrifice and is really the reason that not sacrificing is better). \nSo white is better, and clearly has compensation for the piece. White just had a better line. ",
        "14... Kh8": "Of course not Ng6 giving back the piece + better position. Only way to try to hold on. ",
        "15. h6": "As I look over this game I wonder why it was so hard to see dxe5. It is better here also. Again pinning down the d-file seems like something to be desired. White had a tempo and used it to...allow the knight into a better square? offer a queen trade. Not my finest set of moves in a row. ",
        "15... Ng6 16. Qxd8": "Anything else and suddenly it is clear black is a piece up. Just 16. Qg6 Nc6 and white is losing. ",
        "16... Rxd8": "Of course. ",
        "17. Nd5": "With a clear threat of taking on c7 gaining back an exchange and a pawn. Taking on d5 here allows the knight into the center of the board to become a monster. it would now be a mistake. ",
        "17... Na6": "Maybe Rc8 was better? This loses some pawns and at least gives white some long term compensation other than just he extra piece activity and safer king they are currently relying on. ",
        "18. Bxa6": "So greedy me goes pawn munching. ",
        "18... bxa6 19. dxe5": "Hey look! I played. like...6 moves too late. But it's still fine here. I assumed knight would take back and I would be able to play f4 with tempo later on. Seems fine. Either way I'm still gainin the c7 pawn. ",
        "19... c6": "Well. Not gaining c7 after all. But gaining a much less good a6 pawn, or so I thought when I first saw this move. After I moved to c7 it dawned on me that this actually lets me take the d6 pawn, which is much better. This is a blunder I think. White has better (only slightly at this point) piece activity and better pawns and more pawns (technically material is equal) but this move allows for 3 connected passed pawns down the middle with rooks to back them up. taking on e5 and giving up 2 pawns for piece activity is probably the way to go. Maybe white is still better (computer seems to think white is slightly better there) but there are fighting chances. ",
        "20. Nc7 Rac8 21. exd6": "And look at the knight. Look at those pawns. This is good for white. ",
        "21... a5": "This seems to lose a tempo. This pawn doesn't matter much and black needs to unravel somehow. ",
        "22. Rhe1": "Preparing to push the pawns. ",
        "22... Nf8": "Hoping to set up a light-squared blockade. ",
        "23. e5": "Push push push. only plan. also pretty good plan. ",
        "23... Ne6": "blockade coming? ",
        "24. f4": "Nope. Gives a pawn back but win the piece back with passers to spare. I also considered taking on e6 here, but as it turns out, both are fine. 24. Nxe6 Bxe6 25. F4 with connected passer should still be enough to win. ",
        "24... Nxf4": "What is black to do? They are is trouble once again. ",
        "25. e6": "Bam! Look how bad black is all of a sudden. ",
        "25... Nxg2": "Hoping for counterplay I guess? The computer's best line here is to take on e6 and go into an finish two pawns down with a worse structure and trapped king. Seems hard. ",
        "26. exd7": "Gaining the piece back. ",
        "26... Rxd7": "The computer tells me Nxe1 is mate in 9. I knew that after 27. dxc8=Q Rxc8 28. Rxe1 I was up a piece and had a passer on the 6th rank. Which seemed good. ",
        "27. Re7": "One of the main problems that becomes clear in black's postion is that he has back rank problems. For example if Rcxc2 then Re8 is mate on the spot. This second weakness (back rank) is really the reason white is so far ahead. That and the fact that they're material up and close to queening. ",
        "27... Rcd8": "Anything better?",
        "28. Rxd7": "Ne6 is a killer here (apparently mate in 13) I just knew trading would be fine. I was looking a the back rank. ",
        "28... Rxd7": "Obviously. ",
        "29. Ne6": "The rest is somewhat uninteresting. I'll show the rest with a few comment but the pawn is too strong. The plan is just Nc5 and pawn to d7 and Re1 -> e8 and queening. Simple. hard to stop. winning. ",
        "29... Ne3 30. Nc5 Rd8 31. Rd3 Nc4 32. d7 Nb6 33. Re3": "That pawn is untouchable because of mate on back rank but also must be taken because Re8 is mate after queening on e8",
        "33... Nxd7 34. Nxd7 Kg8 35. Nf6+ Kf7 36. Ng4 Rd5 37. Ne5+": "And black resigns. They are losing another pawn (or two) giving white a passer. The pawn on h6 is still annoying and if white ever wins the h7 pawn is close to queening. This position is so hard because there really isn't counterplay. Just sit around and hope for a mistake. Thanks for reading. I really enjoying playing this game and thought I was totally winning somewhere around the sacrifice but missing dxe5 meant I really had to try. Both my opponent and I made some mistakes in the midgame but it was hard fought and I thought we both fought back as well as well could. "
    },
    "url": "https://gameknot.com/annotation.pl/144th-gk-tournament?gm=62456",
    "gameName": "144th GK tournament",
    "players": "tombulous (1859) vs. charmpitz (1700)",
    "opening": "Lengfellner system (C00)"
}