{
    "moves": {
        "1. e4": "Matus SLO 34 - 5.0 in Round #1.  I need these wins for Round #2 because horsekis is moving up.\nAccelerated dragon Maroczy bind... later shown to be completely faulty.  Yuck what a terrible position I get myself into.  I was lucky to win.",
        "1... c5 2. Nf3 g6 3. d4 cxd4 4. Nxd4 Bg7 5. c4 Nf6 6. Nc3 Nc6 7. Be3": "Can't remember why the rush to play 7.Be3 because Be2 looks better in hindsight.  Must have been worried about that N on d4.  Was it ...Nxd4 .Qxd4 Nxe4 or ...Qb6 or ...e5.  Even 7.h3 or f3 work out better than the text.  Maybe I thought I could capture Qxg4 but that leaves my d4 N unprotected (…Nxd4 9.Qd1 Nc6 and I have initiative plus saved by DSB).  Hmmmm, might be better than the mess I got into.  So 7...Ng4 is a good move.  At least after 10.O-O my R is on an open file.",
        "7... Ng4 8. Be2 Nxe3 9. fxe3 O-O 10. O-O b6 11. Nxc6": "Again, 11.Nxc6 allows his fianchetto B too much range.  Computer says black already has an advantage.  Better 11.Nf3 or Nb3 to keep control of central squares.  After the text plays out to 13.Rad1 I control 7 vs his 5 so 12.Qc2 would have been better.  I need threats.",
        "11... dxc6 12. Qxd8 Rxd8 13. Rad1": "13.Rad1 maybe this was a bad idea.  I have too many pawns hanging.  His 13…Ba6 proves this because now my LSB is protecting a pawn.",
        "13... Ba6 14. h4 Bxc3 15. bxc3": "Game note: \"15.bxc3 now there's a pretty picture\"... ending in the uglier 20.e5 lol",
        "15... Bb7 16. a3 c5 17. Bf3 Ba6 18. Be2 Rab8 19. g4 Bb7": "Game note \"19…Bb7 not too sure.  He really needs f6.\"",
        "20. e5 Rdf8 21. g5": "Game note: \"21.Rd7 would also be strong at some point but I’m finishing off my plan first.\"  Computer says I blew it because he could have played …Bc6.  Luckily he didn’t so I jumped on it by move 22.Rd7 and now I start to re-gain equality of some sort.",
        "21... Ba6 22. Rd7 Rb7 23. Rxb7 Bxb7 24. Rd1 Bc6 25. h5": "Game note: \"25.h5 I control 5 in the centre vs his 3.  And 25...Ba4 leaves me more control so I don't find that to be a good move.  Especially if he's thinking ...Bxc4.  His dark squares are weak.\"",
        "25... Ba4 26. Rd2 Bb3 27. h6": "Game note: \"So 27.h6 with R lift to come soon.  He needs to open his f-file for his R.  But how do I land the final blow?\"",
        "27... f6 28. exf6": "28.exf6 post game analysis computer shows the immediate Rd7 to be much better.  Even gxf6 followed by Rd7 is better.  Anyway, I had the idea of moving my R up so I’m oK.",
        "28... exf6 29. gxf6 Rxf6 30. Rd8+ Rf8": "Game note: \"30...Rf8 I just learned I need 1 of 2 points from this 2 game match vs colorman in order to tie for first in this 2nd round.  Sadly, I can't figure out a plan to get past the current position.  I thought advancing my R was the answer, but now what?\"",
        "31. Rd7 Rf7 32. Rd8+ Rf8 33. Rd7 Re8": "Game note: \"33…Re8 he breaks the cat and mouse.  I'm not looking for 3 move repetition just can’t figure how to move forward.\"",
        "34. Rg7+ Kh8 35. Rxa7": "Game note: \"35.Rxa7 so I’ll grab this for now.\"",
        "35... Kg8 36. Rg7+ Kf8": "Game note: \"36…Kf8 he goofed up.\"",
        "37. Rxh7 Rxe3 38. Kf2 Rxc3": "38…Rxc3 post game play through and I don’t see much value in my c3 pawn so he should have considered …Rh3 …Kg8.",
        "39. Rh8+ Kf7 40. Rb8": "40.Rb8 looking after the game and computer prefers Bf3 which I never would have considered but it’s brilliant with the potential for c4-f7 fork or 40…Bxc4 41.Rb8 and the h-pawn promotes due to his R being blocked out.",
        "40... Bxc4": "40…Bxc4? He really needed …Rh3 because my re-capture puts him in check.",
        "41. Bxc4+ Rxc4 42. h7 Rc2+ 43. Ke1": "43.Ke1 I almost blew it.  Needed to protect the h-file, but it’s a lost cause anyway I end up with the R advantage.",
        "43... Rh2 44. h8=Q Rxh8 45. Rxh8 Ke6 46. Rd8": "Game note: \"46.Rd8 cut off the board so he can’t get over to his Q-side pawns.\"",
        "46... Kf5 47. Rd6 g5 48. Rxb6 g4 49. Rb5 g3": "49…g3 the computer thinks it sees a mate in 14 lmao.  Let’s hope I can win before 14 more moves.",
        "50. Rxc5+ Kf4 51. a4 Kf3 52. Kf1": "Game note: \"52.Kf1 surely he sees it's over.\"",
        "52... g2+ 53. Kg1 Kg3 54. a5": "He resigns 1-0 and I secure at least a tie in this round of the tournament.  Getting ready for round 3!!  If I can win the other game against him I take clear first place."
    },
    "url": "https://gameknot.com/annotation.pl/157th-gk-tournament?gm=64045",
    "gameName": "157th GK tournament",
    "players": "e4newman (1589) vs. colorman (1533)",
    "opening": "Sicilian (B27), Hungarian variation"
}