{
    "moves": {
        "1. d4": "Hi, again. I annotate this game for opponent's request. I played with the black pieces and the opening was a KID, Mar del Plata variation. The first phase of the game, In the first phase of the game, I will comment on the strategic ideas that guided me and those that (I believe) guided my opponent. In the second part, it will be the variables that I have calculated and, eventually, the errors that Stockfish pointed out to me in the post-mortem analysis.",
        "1... Nf6": "My favourite option against 1 d4 and  1 c4 . The answer 1 ... d5 (if white plays 1 d4) makes me feel very uncomfortable.",
        "2. c4": "The natural move. White wants controls the d5-square and gain space in the queenside. Another main option is 2 Nf3. But it's so playable 2 Bg5 (Tropowsky) and 2 Bf4 (London accelerated). ",
        "2... g6": "I am studying the KID, thus, this move is natural. But 2 ... e6 is so common and 2 ... c5 is a very good answer",
        "3. Nc3": "My opponent plays the most natural move, controling d5 and e4.",
        "3... Bg7": "Black can play 3 ... d5 and enter in the Grunfeld defence.",
        "4. e4": "No more Grunfeld!",
        "4... O-O": "I played this order of moves, allowing 5 e5. I like when my opponent expand your center and me plays to counterstrike.",
        "5. Nf3": "My opponent doesn't enter in 5 e5 lines. If you like find a game with this line, see Letelier-Fischer game.",
        "5... d6": "Ok, we arrived to a oftenly position.",
        "6. Be2": "This is the classical variation of the KID. White has several option against the KID, but the master oftenly play this variation. I chose the Averbach line with white pieces. ",
        "6... e5": "The traditional advance against the white's pawn center. But 6 ... c5 is fine.",
        "7. O-O": "White can advance the d pawn (Petrosian variation) and take the e-pawn (exchange variation). These moves leads to different pawn structure and black must be careful with the center driving. The castle is the usual move and it s the most flexible!",
        "7... Nc6": "Black invites White to close the center. This is the Mar del Plata variation. I live in Mar del Plata... No more words, I must play it or dead!!",
        "8. d5": "Now, the pawn structure is defined. Black wants push the f pawn and open lines in the kingside and white'll want a queenside expansion and attack by the c-column. The next moves are theorical and was played about these ideas and I don't comment it. The variations are too much and I can't sum information, briefly. ",
        "8... Ne7": "The natural retreat. But I haven't bad opinion about the Nb8-a6-c5 idea. ",
        "9. Ne1": "The most common move, but 9 Nd2 is also fine. White frees your f-pawn to support the center (e4-pawn) and traslates the king knigth to the queenside, where white has space advantage. Moreover, this move avoids the (natural) Nh5 move for the black. ",
        "9... Nd7": "without 9 ...  Nh5 to free f-pawn for black, we have another alternative. Moreover, in some variations this knight can reach c5. However, the knight in c5 makes no sense with the kingside expansion.",
        "10. Nd3": "I played in this position (with white) 10 Be3 f5 11 f3 f4. It's a well known position, but I guess the move in the game is more flexible and consequent with the 9th move. ",
        "10... f5": "Black put pressure in the center",
        "11. f3": "And white support that. Nevertheless, that move isn't force. White can wait to push f3 and play in the queenside (for example 11 b4 a5 12 Ba3) where now the move f4 is an mistake, because white can play Bg4 (not allowed with the pawn in f3) and exchange your bad lsb with the d7-knight or c8 bishop. ",
        "11... f4": "With the pawn in f3, black moves the attack to the base of the pawn's chain.",
        "12. Bd2": "So natural, white must push in the queenside and white must prepares b4-c5 pawn structure.",
        "12... g5": "And black prepares the push in g4",
        "13. Rc1": "With the same idea of 12 Bd2.",
        "13... Ng6": "Regrouping the pieces",
        "14. b4 Nf6 15. c5": "White attacks is coming! ",
        "15... Rf7": "The Gligoric idea. The rook can move to g7 or h7 to attack! Obviously, after move the bishop and the pawn. Amazing and original. I recommend see Najdorf-Gligoric and Taimanov-Najdorf games! Moreover, the rook is seing the c7-pawn, the target of white attack",
        "16. b5": "After sixteen moves, I was faced with a new move for me.  This move avoids the strength of the resource a5 to break the pawn structure. But I expected 16 cxd6, opening the c-column with idea of Nb5 and Qc2.",
        "16... h5": "I continues with the kingside expansion",
        "17. c6": "I was shocked by this advanced! Yes, my queenside is cramped, but now, white close the c-column (why is the reason for that? he play Rc1 in the thirteen move). Of course, my lsb hasn't square to move. I only think in the kingside attack, but I need to be cared",
        "17... bxc6": "With this move, I closed the c-column. If white can invades the queenside, this won't be by c-column. ",
        "18. bxc6 g4": "Meanwhile, the development of the attack on the kingside is faster after the blockade of the c-column",
        "19. Rb1": "As I said, white hadn't the c-column to attack. Now they need to regroup, but they do not have where to bite. The square b7 is custidiada by the bishop and the square b8 by the rook. To be able to invade they need to spend a lot of moves!",
        "19... Bf8": "Ok, this look like a loss of time. But this move liberates the g7 (or h7) square for the rook. The g3 push here is answered by 20 h3 Bxh3 21 gxh3 and Re1 Bf1. A review of tactical variation leads to a only conclusion: black needs to coordinate the pieces",
        "20. Qe1": "I don't understand the idea of this move, but Stockfish says White is better (slighty) here. I expected 20 Re1 with idea of Bf1 or 20 Kh1. ",
        "20... Nh7": "I was calculating 20 ... g3 and if white try to close the kingside 21 h3 Bxh3 22 gxh3 Dc8 and black has a strong attack (23 Kg2 Nh4+). But 21 hxg3 fxg3 22 Qxg3 Rg7 (my idea) is answered by 23 Bh6! and white wins material. \nTherefore, I decided not to rush and reorganize my pieces; given that White is cramped on the kingside and have not attack on the queenside. My plan was occupy the dark squares of the kingside with Ng5 and Nh4. For that, I need play Be7 and Rg7 (or Rh7). Stockfish say 20 ... Bh6 is better. I never think in that move",
        "21. Qf2": "White is looking the queenside, too. But I don't like the move, the queen ahead of rook loses defensive value and  White is passive",
        "21... Ng5": "I following my regroup",
        "22. Kh1": "\nA prophylactic move",
        "22... Rg7 23. Rfg1": "Shrinking spaces to the king but, in some occasions, open the g column to attack!. Unexpectedly, my opponent gives me issues of mate in the column h. \nI think I should look for an active plan, even at the expense of quality in b7, with movements of \"cavalry\" and blocking of the pawn in a7. Anyway, i f my opponent plays 23 Rb7 I wasn't thinking in 23 ... Bxb7 24 bxc7 Rb8. I just want attack the kingside. A possible sequence is 23 Rb7 Be7 24 Nb5 Nh4 with a messy position but I think favors to black",
        "23... Be7 24. Bd1": "My opponents is playing too passive. Surely, he was waiting for the tactics and open the kingside with g3 move in good position",
        "24... Nh4": "Ok, no more g3-threat for white. Black is entering in the white position. Now, I had calculate the line 25 Qxh4 Nxf3 26 Qf2 (Qxh5 Nxd2) Nxg1 27 Kxg1 (Qxg1 h4) h4. My opponent comment about the excludes  the queen with 25 ... g3. I saw that move, but I don't see how I can trap the queen. \nEither way, the game follows another way.",
        "25. Qf1": "I don't calculate this retreat in my previous move. But now,  I can open the kingside in my favour, given the cramped position of the king! ",
        "25... g3": "White can't play 26 h3 because Nxh3 27 gxh3 g2+. The position is very hard for white, now, in human point of view. Stockfish says -0.21",
        "26. hxg3": "This move isn't  forced. White can play 26 Ne1(Stockfish) and try to support the kingside. I don't see Ne1 ",
        "26... fxg3 27. Be1": "Another passive move, attacking a easily defended pawn. The exchange Bxg5 Bxg5 frees a piece of the queen's path towards h4, where it would be lethal! ",
        "27... Nh3": "I found this idea very usseful. The knight can't be take and removes a piece of the cited diagonal. I want the f4-square for the knight and play Bh3 is strong",
        "28. Rb2": "My opponent defends the g2 pawn with the inactive rook",
        "28... Nf4": "I'm sorry for the materialistic players, but I like the active pieces. I would not dream of taking the passive g1 rook. Now, if white takes 29 Nxf4 I calculates gxf4 30 Bd2 Bf8! 31 Bxf4 Nf5! 32 Bxg3 Nxg3+ 33 Kh2 Qh4++ It's beautiful but not forced. Equally, black is winning",
        "29. Bd2": "I don't understand this move. My opponent plays Rb2 to defend g2, but, right now, interferes in the defence. \nHere, I smelled that there must be a winning combination and I intuited Bg5, but I can't find the crashing move. Stockfish gives me 29 ... Bg5 with evaluation -10. I play another line, where black is winning but not with so much advantage(in Stockfish evaluation, I like the move of the game)",
        "29... Nhxg2": "Destroying the pawn' shield",
        "30. Rxg2 Nxg2 31. Qxg2 h4": "Now, I just advance the h pawn and I create multiple threats",
        "32. Kg1 h3": "My opponents resigns here. I am grateful, he congratulated me and showed me his surprise since I did not move my pieces of the queenside (except for the knight). However, I believe that the bishop on c8 had a lazy role of importance in the tactics. I think that the plan to set the c7 pawn of Black to invade the queenside is slower than the original pawn change on d6 and open the c column. I await your comments, corrections, criticisms. I played another game with thp1, where I had \"a bit of luck\" and ended up in a draw. I will comment on it as soon as I have free time\nSorry for my English. "
    },
    "url": "https://gameknot.com/annotation.pl/174th-gk-tournament?gm=66091",
    "gameName": "174th GK tournament",
    "players": "tph1 (1854) vs. sogtulakk (1851)",
    "opening": "King's Indian (E70), 4.e4"
}