{
    "moves": {
        "1. e4": "Hi, again. My third annotation. Every game commented began with 1 e4 e5 and I played with black. I'll annotate a game with white. I helped in the annotations with Stockfish, that refutes, corrects and affirms some of the ideas. Consequently, I will comment on my own ideas and what the engine tells me",
        "1... e5 2. Nf3": "The most common reply to 1 e4 e5. ",
        "2... Nc6": "I played, as usual, 2 ... Nc6 and I invites to my opponent to play a Spanish Opening. ",
        "3. Bc4": "My rival chose the Italian Opening or Giucco Piano.  ",
        "3... Nf6": "I play, as usual, the Two Knights Defence. Now, White can play a sharp game with 4 d4 or 4 O-O or move twice the knight with 4 Ng5, where white, in the main variation, is a pawn up and black is ahead in development. However, my rival enters in a quiet variation.",
        "4. d3 Bc5": "Black, in my knowledge, can play too 4 ... d5, 4 ... d6 and 4 ... Be7. The two last variation are similar, the first leads to a definite center. I chose an active line",
        "5. O-O": "I expected 5 c3 and white enter in the giucco pianissimo variation. If I played with white, I delayed the castle and active the pieces (may be 5 Bg5 in the Canal variation), watching the black reaction. Nevertheless, in my opinion, castle is OK for white.",
        "5... d6": "Black can play the freedom move 5 ... d5 but after 6 exd5 Nxd5 7 Re1 White puts pressure in e5 and Black justifies the early castle of the White. Now, Blacks threats the pin 6 ... Bg4.",
        "6. h3": "But this move looks like a blunder. Now, Black has an attack option with the push g5-g4 and open columns against the castle. White can play sure with 6 c3 (Giucco Pianissimo) or 6 Nc3 (Four Knights Opening). Still not being decisive, it already indicates where to attack to the black.",
        "6... h6": "I wanted to play 7 ... g5 and prevents the Bg5 pìn.",
        "7. a3": "I don't understand the move. 7 c3 looks better",
        "7... g5": "Follow the plan.",
        "8. c3": "White given the d1-a4 diagonal to the queen and prepares d4 push in the center",
        "8... g4": "Stockfish disagrees with this natural move and suggest short castle.  However, I think the attack on the kingside is quick and concise",
        "9. hxg4": "Forced move.",
        "9... Bxg4 10. Nbd2": "Natural defence of the f3-knight. ",
        "10... Rg8": "Taking the column. Stockfish gives a slighty advantage to white in this position in depth 20.",
        "11. b4": "My rival takes the space in the queenside. I calculates a central reaction with 11 d4 but this move fails, right now. If the black king will remains in the center, thus d4 is a good move.",
        "11... Bb6 12. Qb3": "Unpinning the queen with tempo?? No neccesary, I can develop the queen, prepare the queenside castle and defends f7. Qd7 or Qe7? That's the question. ",
        "12... Qd7": "I chose Qd7, seing h3-g4 complex of squares and give e7 square to knight if white plays b5 in any time.",
        "13. Kh2": "Moving the king of the open column and avoids Bh3 threat. I expected 14 a4 a5 15 b5 Nb8 (Ne7 16 Bxf7+) 16 Ba3 with idea of Rad1, where White search for counter strike in the center. But this variation fails by means of 16 Bh3!.   Stockfish suggests 13 Nh4! ",
        "13... O-O-O": "A mistake. I forget my f7 pawn! Nevertheless, Black has at this point, good compensation in the line 15 Bxf7 Rg7 16 Bc4 ",
        "14. Nh4": "My opponent play the right move if you see the Stockfish evaluation, but I thinked a poor move. My feeling while I thinking the position was \"I have a winner attack in this position, I need find it\". Thus, I wanted to add pieces to the attack.",
        "14... Nh5": "However, 14 ... Be2 was better, according with Stockfish.",
        "15. Ndf3": "At this point, Stockfish says slighty advantage for black if  15 Bxf7 Rg7 16 Bxh5 and about a pawn up for the move in the game. Again, my feelings was I must winning for attack",
        "15... Rg7": "I wanted double the rooks in the column. Incidentally, I defended the f7-pawn.",
        "16. Bd2": "A good move, according to Stockfish. When I see the move, I suppose that White want play now Rg1, supporting g2 with the price of a quality (Bxf2 and Bxg1), where exchange a inactive piece (Ra1) for an attacking piece (Bb6). However, I expected the move 16 d4 exd4 17 a4 dxc3 18  a5 searching for counterattack.\n\nStockfish suggest, also, 16 Qd1.",
        "16... Rdg8": "Doubles the rooks in the column and threating Bxf3, where the queen enters in the kingside.",
        "17. Be3": "This move is a blunder, now the black attacks is in a roll",
        "17... Bxf3": "If 18 Bxb6 Rxg2+ 19 Nxg2 Rxg2+ 20 Kh1 Qh3++. Else if 18 Nxf3 Rxg2+. ",
        "18. g3": "The only move.",
        "18... Bxe3": "The best choice, according to the engine. I calculate  18 ... Nxg3 (winning too according Stockfish) but I prefers take no risks. ",
        "19. Nf5": "A strong move!! Really, Stockfish gives 19 ... Bf4 but I didn't see that! I played safe",
        "19... Bb6 20. Nxg7": "Now, I was calculating Nf4 with threat of Qh3++ but 21 Ne6 stops the attack. Again, I played safe",
        "20... Rxg7 21. a4": "Too late, my rival wants a queenside attack. I played, right now, 21 ... Nf4 but Stockfish gives 21 ... Qg4 than better. Similarly, my opponent resigns",
        "21... Nf4": "Threating 22 ... Qh3+. If white plays 22 gxf4 Rg2+ 23 Kh1 Qh3++. The only move was 22 Be6 but Nxe6 and Nf4 (again) is winning. \nI hope I have explained the annotations well. And I also hope you enjoyed the game. Comments and questions are welcome. Corrections are most welcome, even. And if they refute my analyzes, they will help me a lot"
    },
    "url": "https://gameknot.com/annotation.pl/174th-gk-tournament?gm=66060",
    "gameName": "174th GK tournament",
    "players": "barahoncito (1740) vs. sogtulakk (1835)",
    "opening": "Two knights defence (Modern bishop's opening) (C55)"
}