{
    "moves": {
        "1. e4 c5": "American Chess had reached new popularity in those days bolstered no doubt by Bobby Fischer's triumph at Reykjavik in 1972.  However, truthfully, I had toyed with game while I was in college at Purdue, but I really never played it with any compassion until I learned that it could help pass the time away in Southeast Asia.  My chess buddy there was from the Phillipines and taught me a great deal about openings and tactics.",
        "2. Nf3 d6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 a6 6. Bg5 e6 7. f4": "The poisoned pawn varaition had become rather well known by this time, still I thought maybe that that was where my opponent was heading.",
        "7... Be7": "Sorry, not this time!!  Still a slight sigh of relief, he was using a variation I was somewhat familiar with albeit from the other side of the board.",
        "8. Qf3 e5": "Opps, perhaps I spoke too soon.  More common (at least at that time) is 8. -----, Qc7 (and it was certainly most familiar to me.)",
        "9. Nf5": "Ne2 and Nb3 were also available, but I opted for something I felt was more aggressive.",
        "9... Bxf5": "9. -----, 0-0; 10. Nxe7 ch, Qxe7; 11. 0-0-0, ef (11. ----, Be6; 12. f5); 12. Nd5",
        "10. exf5 Nc6 11. O-O-O": "I generally do not castle on the Queenside but will not hestitate to do so when I believe the position warrants it.",
        "11... Qb6 12. g4 Nd4 13. Qg2": "I had intended to put my King's Bishop here when the time was right.",
        "13... Rc8 14. fxe5": "This probably was not the right move, but I wanted to open a line back to the Queenside for my g5 Bishop.  The drawback is that it also lets Black open a line to my Queenside for his dark squared Bishop.  But then, I was also hoping that I could do something on the Kingside before he did something on the Queenside. ",
        "14... dxe5 15. Bd3": "While this provides additional protection for my c2 square, it also blocks the file for my Rook at d1.",
        "15... h6": "Forcing the Bishop to do what it was going to do anyhow - withdraw to a more useful position.",
        "16. Be3": "While the pin looks attractive, providing additional support to the c3 Knight with Bd2 may have been better, but I thought I would be able to take my Queen to the d2 square.",
        "16... Ba3 17. Na4": "I felt that 17. bxa3, Rxc3 would leave me with more problems than I wanted.",
        "17... Qb4 18. Bxd4": "Exchanging off potential attacking units is sometimes the best defensive option.",
        "18... exd4": "18. -----, Qxd4?; 19. Bb5 ch   or   18. -----, Qxa4; 19. Bxe5",
        "19. Rhe1+ Kf8 20. bxa3": "My Knight really had no place to go so exchanging it for the a3 Bishop made sense to me.",
        "20... Qxa4 21. Qxb7 Qxa3+ 22. Kb1": "The d file just did not appear attractive to me at the time.  Besides I had no wish to give away a pawn.",
        "22... Qc5 23. Re5": "This move apparently came as a surprise to my opponent as he now spent a considerable amount of his clock deciding what to do.  As for myself, I was just trying to survive;  I knew that if he ever got his Rooks connected I would likely be dead meat.  I briefly considered 23. Qxa6, Nxg4 or 23. Bxa6, Qxc2 ch but I never explored these any further at the time, perhaps White has some resources available after these moves.",
        "23... Qxe5": "On 23. -----, Qc6 (or Qc7) then 24. Qb4 ch, Kg1; 25. Qxd4  or 23. -----, Qc3; 24. Re7",
        "24. Qxc8+ Ne8 25. Bxa6 Kg8 26. Bd3 Kh7 27. h4 Nf6 28. Qc4 Nd5": "28. -----, Nxg4; 29. Qxf7, Nf6; 30. Qg6 ch, Kg8; 31. Bc4 ch, Nd5; 32. f6.  And besides my King is on the Queenside. ",
        "29. f6+ g6 30. g5 h5": "30. -----, hg; 31. h5, Rb1 ch; 32. Ka1 with hg to follow  or   30. -----, Nc6 ch; 31. Ka1, Nxd1; 32. Qxf7 mate.  The text creates a box canyon which will be very important later.",
        "31. Ka1 Rb8 32. Rb1 Rxb1+ 33. Kxb1 Nc3+ 34. Kc1": "Russell now undertakes a series of checks most likely intended to help him address his time control issues - and who knows, maybe White will make a mistake.",
        "34... Qe1+ 35. Kb2 Qb1+ 36. Ka3 Qc1+ 37. Kb4 Qb2+ 38. Kc5 Qxa2": "Russell takes a pawn and defends against the mate at the same time.",
        "39. Qxa2 Nxa2 40. Kxd4": "I removed his advanced pawn from the board and regained my pawn's superiority.",
        "40... Nb4": "WHile time control is no longer an issue for Black, his position on the board is.",
        "41. Kc5": "Played to chase the Knight back from whence it came or forcing it to capture while simultaneously moving my King closer to where it needs to be.",
        "41... Nxd3+ 42. cxd3": "And the race is on!!",
        "42... Kg8": "Black may have been hoping for d4 when his King might have escaped the canyon.",
        "43. Kd6 Kf8 44. Kd7": "And Black resigns.  "
    },
    "url": "https://gameknot.com/annotation.pl/1974-washington-open?gm=10238",
    "gameName": "1974 Washington Open",
    "players": "P Michael (Unrated) vs. R Miller (1700+)",
    "opening": "Sicilian (B98), Najdorf, Browne variation"
}