{
    "moves": {
        "1. e4": "Apertura abierta",
        "1... e6": "Defensa francesa",
        "2. Nf3": "Lo ideal es mover d4",
        "2... d5": "Rompimiento clásico, atacando el poderoso peón de e4",
        "3. exd5": "Se puede hacer el cambio, y se espera un juego semiabierto donde las casillas centrales son controladas a distancia, generalmente por alfiles. En el peor de los casos, puede terminar en tablas según las probabilidades de los programas informáticos en un 50%",
        "3... exd5 4. d4": "Se elimina al poderoso peón de e4, pero permanece el peón de d4",
        "4... Nf6": "Preparando el enroque",
        "5. Nc3": "Desarrollo normal de piezas, generalmente se juega Ad3 para preparar el enroque lo antes posible",
        "5... Bb4": "De inmediato se ataca esta debilidad clavando el caballo y amenazando Ce4, y preparando el enroque corto",
        "6. Bd2": "Demasiado pasiva, era mejor Ad3",
        "6... O-O 7. Be2": "De nueva cuenta, es demasiado pasiva errores que debí aprovechar mejor",
        "7... c5": "Me parece bastante precipitada esta jugada, pienso que era mejor Af5 o Cc6\n",
        "8. dxc5": "Aqui pienso que lo mejor es enroque corto",
        "8... d4": "Mala jugada, demasiado precipitada que sólo busca \"blofear\", especular sobre supuesta ganancia territorial de casillas y desorden de piezas, generalmente es efectiva pero en partidas blitz. Un jugador experimentado en tácticas como mi rival, no iba a caer tan fácil. Es mejor tomar en c5 y jugar posicionalmente",
        "9. Ne4": "Excelente jugada, me sorprendió demasiado, fue entonces que caí en la cuenta de que no debo jugar con tácticas tan simplonas con un jugador tan experimentado como Sergio Clemente, jugador experto en tácticas",
        "9... Bxd2+": "Lo que temía, no hay opción que el cambio y todo mi supuesto ataque se vuelven cambios forzados, encaminados a unas tablas",
        "10. Nexd2": "Unica",
        "10... Nc6": "Esto fue lo que debi haber hecho en vez de c5",
        "11. a3": "Me parece que el blanco tuvo la oportunidad de tomar el control de la partida pero se perdió en jugadas profilácticas como esta que le generará casillas débiles en b3",
        "11... a5": "Una idea bastante común, se frena el supuesto avance de b4, y se deja al blanco con la casilla débil en b3",
        "12. O-O": "A la 12ava jugada, el blanco se enroca. No es malo en algunos casos, pero creo que pospuso demasiado el enroque por lo que perdió muchos tiempos y la oportunidad de continuar con el control de casillas centrales",
        "12... Bf5": "No termina de agradarme, porque se deja en el aire a un alfil pero por otro lado se aprovechan las líneas centrales abiertas para fastidiar al blanco con el avance de d4",
        "13. Nb3": "Una buena jugada, bastante sana, permite entrar al juego a la dama. Especula con su salida en d2 y conectar las torres, además de que amenaza tomar peón de d4. Pero se deja la jugada b4 pospuesta, por ende la casilla debil en b3 y el Cb3 mal posicionado ante un a4 de las negras",
        "13... Qd5": "Una jugada que no termina de gustarme, se expone un poco a la dama...pero se especula con el traslado de la misma al ala del Rey blanco",
        "14. Nbxd4": "Finalmente, ocurre. Estoy en desventaja con dos peones pero con la posibilidad de quitar a la poderosa pareja táctica de caballos.",
        "14... Bg6": "No me gusta del todo un cambio de caballo por alfil, sobre todo cuando este domina casillas centrales",
        "15. Nb3": "Cambio de damas, para simplificar el juego, cosa que me convenía ante este jugador fuertemente táctico",
        "15... Rad8": "Sólo falta una pieza negra para activación",
        "16. Qxd5 Nxd5": "Forzado, pero se amenaza captura en c2",
        "17. Bd3": "Mala jugada porque cambia un alfil bastante bueno, y deja debilidad en d3",
        "17... Bxd3 18. cxd3 Nf4": "De inmediato se ataca a la debilidad",
        "19. d4": "Calculado todo, sólo se prosiguió con una sutil amenaza para desviar el control de casillas centrales",
        "19... a4 20. Nbd2": "Es hora de atacar esa debilidad",
        "20... Ne2+ 21. Kh1 Ncxd4": "Estaba bastante interesado en cambiar su única pieza que controlaba casillas centrales",
        "22. Nxd4 Rxd4 23. Nf3 Rc4": "Sutilmente se amenaza capturar peón, inevitablemente, recuperando el peón perdido que debi capturar desde hace 10 jugadas",
        "24. Rfe1": "Tc2, y se van acabando las esperanzas del blanco",
        "24... Rc2 25. Rab1 Nf4": "sutil",
        "26. Kg1": "Mejor era Tc1",
        "26... Nd3": "Con la posibilidad de captura y ganancia de un peón",
        "27. Re7": "Admito que esta jugada no la había calculado, y en todas las variantes que seguían el blanco adquiría una ventaja si bien, no aplastante, pero sí una ligera ventaja",
        "27... b5": "Me costó mucho ver esta jugada que a simple vista parece una mala jugada, lo cierto es que se especula ya con activar la torre desusa y sacar el rey negro a pasear o esconderlo bien en g7. Aunque después de varios minutos de calculo, vi que salvaba al rey negro para colocarlo en e7 y especular con llevarlo al ala dama del blanco y capturar peón de a3. Asi mismo especulo con tomar en b6 o b7, y por rayos x en b2",
        "28. cxb6 e.p.": "Era de esperarse",
        "28... Rb8": "Finalmente se activa y ahora tengo 3 amenazas de captura",
        "29. b7": "Admito que esta la había calculado poco porque fue demasiado complejo saber si hay una ventaja o una desventaja, lo cierto es que el resultado era el mismo que si estuviese en b6, como lo había pensado en un principio",
        "29... Kf8 30. Rd7": "Forzada, protege b7",
        "30... Nc5": "Se acabaron las amenazas para el rey negro, el cual ha evitado los mates espantosos en octava fila y captura un peón blanco",
        "31. Rc7": "Forzada también, pero ahora sí, finalmente se captura el peón después de una serie de maniobras que parecían malabarismos",
        "31... Rxb7 32. Rc8+ Ke7 33. Nd4": "Bonita jugada táctica, el caballo blanco especula con la captura de el caballo negro por su torre, y si Td4, sigue Cc6+, seguido de Ca5 ganando torre por caballo, pero el negro también tiene sus propias jugadas tácticas.",
        "33... Rcxb2": "Igual, una tactica bastante bonita, y se forza el cambio de torre de b1 amenazando mate en b1 y sacrificando caballo negro...pero el blanco tiene una última carta bajo la manga",
        "34. Rc7+": "Esta otra jugada tampoco la calculé...muy bonita jugada, pero después de dejar la sorpresa decidí calcular más y en efecto no había más que igualdad, el blanco rescata una posición perdida y gana igualdad",
        "34... Rxc7 35. Rxb2 Nb3": "Otra táctica sutil pero equivocada, ahora pienso que no pasaría realmente nada con las negras, hasta sería mas sano para las blancas cambiar el caballo y adquirir una ventaja leve, luego de 35. Cxb3, 36.-ab, y Tb1 o más útil, 36.- ....Rf1!, con posibilidades de tablas pero el detalle del ajedrez es no desconcentrarse o desmoralizarse por jugadas que pareciesen buenas, y no lo son. Si el blanco hubiese tomado hubiesen sido tablas o peor, ventaja de las blancas",
        "36. Ne2": "Por suerte mi rival se desconcentró y se equivocó gravemente pues deja la casilla d1 libre y la oportunidad de seguir las riendas del juego por las negras, además de posibilidad de una pequeña táctica",
        "36... Rd7": "Ese último error, es aprovechado inmediatamente, se especula con Cc3 para seguir presionando.",
        "37. Nc3": "Tercer error, debía ser cuidadoso y calcular las siguientes jugadas de manera tal que mi rival no supiese en la trampa táctica en la que caerá. Era mejor Cg3, a pesar de 37...Td1+, 38.- Cf1, en caso de 38...Cd2, simplemente Txd2. ",
        "37... Rd3": "Desde ese momento las blancas han perdido el caballo (hago una nueva corrección, luego de Te2+, seguido de Te3...muy difícil de ver pero se logra la igualdad)",
        "38. Rc2": "Otro error, el cual consistió en dejarse llevar por la rápidez de los movimientos cuando debió jugarlos concienzudamente. ",
        "38... Nd4": "Muy bonita jugada",
        "39. Rc1": "No sirve Cd5+, por la amenaza Rd6",
        "39... Rxc3": "Simple pero sútil",
        "40. Re1+": "Si 39....Txd3, 40.- Ce2+, seguido de Cxd3 quedando con pieza de más y amenazando coronación del peón en fila a",
        "40... Kd6 41. g3": "Último craso error",
        "41... Nf3+": "Y las blancas abandonan, pero ya lo habían hecho moralmente desde varias jugadas atrás. Agradezco a Sergio, por el juego"
    },
    "url": "https://gameknot.com/annotation.pl/1st-acapulco-chess-tournament?gm=52363",
    "gameName": "1st Acapulco Chess Tournament ",
    "players": "Sergio Clemente (NR) vs. Arturo Pastor (1637)",
    "opening": "French (C00), Wing gambit"
}