{
    "moves": {
        "1. e4": "(game info on previous page).",
        "1... c5 2. d4 cxd4 3. Qxd4": "Still barely 'book' I think.  \nYou will have your own reasons for choosing this over the main openings, but I don't like this move: develops your Queen too early IMO and I can have a 'free' developing move for my Q-Side Knight.\n2. d4 was fine, but only if you are prepared to follow it up with a gambit: 2. d4 cxd4 3. c3 or Nf3.\nThe mainline WT 2nd move was Nf3, other good options include 2. Nc3 & c3 if you want to avoid heavy theory.",
        "3... Nc6 4. Qe3 Nf6 5. Nc3 d5 6. e5": "Loses material although it's not serious, my extra pawn will be doubled.  6. exd5 must be considered Nxd5 7. Nxd5 Qxd5 8. Nf3=\nComment from charleshiggie (1937):  I can't help thinking that if White wants to play this, it is better to move the queen to a4 or even d1 on move 4.\nComment from me:  Yes, what he chose was about equal in popularity on the database to 4. Qd1 however.",
        "6... d4 7. Qf4": "7. Qd2!? Nxe5 8. Bb5  Nc6 9. Ne2 and my extra pawn is vulnerable.",
        "7... dxc3 8. exf6 cxb2 9. Bxb2 Qa5+ 10. Qd2 Qxd2+ 11. Kxd2 exf6 12. a3": "?? What does this achieve? 12. Bc4 Be7\nComment from charleshiggie (1937):  Perhaps white is afraid of bishop or knight to b4? I agree 12. Bc4 seems better.\nComment from me:  You can't go wrong with a good old Rooks pawn up 1! If in doubt, Rooks pawn up 1! ;) That seems to be just about every beginners motto I come across.  ",
        "12... Be7 13. Bb5 Bd7": "I could have taken advantage more of your King's position by a more active move such as Bf5.",
        "14. Re1 a6 15. Bxc6": "?? Giving up the Bishop pair on an open board, for what?  A 'tempo'.",
        "15... Bxc6 16. Ne2 O-O-O+ 17. Bd4": "?? Loses material, but also why would you want to voluntarily pin your own piece?  \"A pinned pieces power is only imaginary\" (Nimzowitch).  The game is as good as over now.  Kc1 was best. ",
        "17... Bxa3 18. Red1 Bc5": "Re8 makes it even easier for me, not that it matters at this stage.",
        "19. Ke1": "? Kc1 was better keeping the Rooks linked and moving it away from the open central files.",
        "19... Bxd4 20. Nxd4": "? Rxd4 was forced, this either loses your Knight or your whole King!",
        "20... Rhe8+ 21. Ne2": "Kf1 is no better (21. Kf1 Bb5  22. Kg1 Rxd4 23. Rxd4 Re1#)",
        "21... Bb5 22. Rd2 Rxd2 23. Kxd2 Rxe2+ 24. Kc1 Rxf2 25. g4 Rf1+": "He resigned."
    },
    "url": "https://gameknot.com/annotation.pl/1st-england-team-training-match-vs-badge32?gm=16838",
    "gameName": "1st England Team Training Match vs badge32",
    "players": "badge32 (1292) vs. toiletduck1 (1845)",
    "opening": "Sicilian (B21), Andreaschek gambit"
}