{
    "moves": {
        "1. e4": "White strikes at the middle as early as he can. This is the most commonly played first move as White, the other popular choices being 1.d4, 1.c4 or even 1.Nf3.",
        "1... e5": "Black directly challenges white for possession of the center.",
        "2. Nf3": "White develops his knight and attack Black's newly advanced pawn.",
        "2... Nf6": "Instead of protecting his pawn, Black goes for the counterattack! This is known as the Petrov's defence, and it is quite playable.",
        "3. Nc3": "However, I decline the pawn trade and protected my pawn by bringing up my other knight.",
        "3... Nc6": "Black does the same. This is known as the four-knight opening.",
        "4. Nxe5": "!? It is generally a bad idea to trade a piece for a lesser one or a pawn unless you can get some other advantage by doing so. I wouldn't recommend this opening for low-rated players, but it can surprise your opponent. This is called the Schultze-Mueller gambit, and is also nicknamed as the \"Halloween gambit\". While it does throw some opening rules through the window across the street, White will be able to harass Black's knights with his powerful central pawns.",
        "4... Nxe5": "Black accepts the sacrifice.",
        "5. d4": "White strikes back with force!",
        "5... Nxe4": "?! Black simply decides to give back his extra knight to break White's central pawn formation. While this does reduce White's main positional advantage, it nulls Black's one: his material advantage. Better was to hold on the knight via 5...Nc6 or Ng6.",
        "6. Nxe4": "White recaptures Black's e4 knight. The e5 knight is still attacked and has to retreat.",
        "6... Ng6": "In this position, we can see the consequences of Black's 5th move. White has a pawn and knight out to Black's sole knight.",
        "7. Bd3": "Development.",
        "7... d5": "Good move by Black, it opens his LSB and threatens White's knight.",
        "8. Ng3": "Simple retreat.",
        "8... Bd6": "Black develops his bishop, just like white did. Please notice the similarities between both players' pieces.",
        "9. O-O": "White castles, threatening to put his rook onto the open e file.",
        "9... O-O": "Black does the same, albeit he does so to tuck his king into safety. The game retains its symmetry between both players. A downside of mirroring White's every move as Black is that whatever weaknesses your opponent have also apply to you. Black will never get a distinctive advantage over white by doing so. Whilst white will not have any distinctive advantage either, it is his turn to play, so he has the initiative.",
        "10. Qh5": "! White aggressively places his queen to a dangerous square on the kingside, pinning the knight to the h7 square and attacking the d pawn. Black cannot replicate this move without losing a piece. 10...Qh4?? 11.Bxg6! Bxg3 12.hxg3! 12...Qxh5 13.Bxh5 and white is up a bishop.",
        "10... Qf6": "Black moves his queen onto the battlefield, threatening my d pawn. ",
        "11. c3": "! I guess I could have taken Black's d pawn at this point, protecting my own d pawn at the same time, but I decided to play it safe and support my central pawn.",
        "11... c6": "Black does the same.",
        "12. Bg5": "White gets his other bishop out, threatening the queen at the same time. Black could not have played this move due to the fact that the white queen covers g5 whilst the black queen does not cover g4.",
        "12... Nf4": "?? Black apparently forgot that his knight was pinned to the h7 pawn!",
        "13. Qxh7#": "White obliges, finishing the game in a single strike. Overall, my opponent has played rather well for his rating, if we exclude that last move blunder, but he has to try to get some sort of advantage over his opponent and then keep it."
    },
    "url": "https://gameknot.com/annotation.pl/1st-mentoring-game?gm=52595",
    "gameName": "1st mentoring game",
    "players": "a_random_guy (1996) vs. lesplay (1188)",
    "opening": "Petrov three knights game (C42)"
}