{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Bc4 Nf6": "2 Knight's Defense begins.",
        "4. Ng5 d5 5. exd5 Na5 6. Bb5+ c6 7. dxc6 bxc6 8. Qf3": "A line I adopted a few weeks ago.",
        "8... Bb7 9. Bd3": "This move seems weird to me because it blocks the d3 pawn but I don't really have anywhere else to put it and it exercises important control over e4.",
        "9... h6 10. Ne4 c5 11. Nxf6+": "With this line I almost always trade Nf3 away on f6.  Normally I get doubled pawns which is normally always a good thing.",
        "11... Qxf6 12. Qxf6 gxf6 13. O-O": "To elminate Bxg2.  I was considering Bb5+ instead of 0-0.  If anyone has any input that would be great.",
        "13... Rg8 14. Bb5+": "Now the Bb5+ in order to exchange and begin developing my untouched queenside.",
        "14... Ke7": "No castling for black.",
        "15. f3": "f3 appeals more then g3 here.  Again feedback would be great.  I simply didn't want that pesky bishop to see into my castle.",
        "15... Nc6 16. Bxc6": "I did not want to deal with the knight on D4.  So this exchange seems good.",
        "16... Bxc6 17. d3": "Helps to hold onto e4 and frees up my darksquare bishop (which proves to be the decisive piece).",
        "17... Rb8 18. Nc3": "I wish to place the knight on the outpost e4.",
        "18... f5": "This is not favorable for my opponent.",
        "19. Rb1": "Frees up my bishop.",
        "19... Ke6": "Centralizing his king and freeing up his dark square bishop.",
        "20. Re1": "Seemed good to me until about 5 seconds after I made this move.  I have opened myself to one of those more advanced (at least to new players like myself it seems \"advanced\")tactical situations.  Now my f3 pawn is undefended.  Bxf3 would be terrible for me.  Fortunately my opponent didn't notice this weakness and continued on with development.",
        "20... Bd6 21. Re2": "To be honest I made this move so I could eventually double the rooks here.  This is a bad move though because it does nothing to prevent Bxf3.  (Which my opponent didn't see).",
        "21... f6 22. Kf2": "This should have been done a couple of moves ago.",
        "22... Rg6": "To double the rooks (and also defend h6.)",
        "23. Bd2": "Frees up my queenside rook.",
        "23... Rbg8 24. Rg1": "To run to the defense just in time.",
        "24... h5 25. g3 f4": "A blunder.  The same \"pinned-pawn\" tactic that my opponent didn't see earlier now arises.",
        "26. Bxf4": "I see it and capture.",
        "26... Kf5 27. Bd2 h4 28. Ne4": "The pawn that was hindering the devolpment of my knight to d5 is not gone.  The knight places himself in the center of everything.  Threatening Bd6 and defending g3.",
        "28... Be7 29. g4+": "Driving the king back.",
        "29... Ke6 30. Be3": "Building an attack on c5.",
        "30... f5 31. Nxc5+": "Capturing c5.",
        "31... Bxc5 32. Bxc5": "The capture of the dark square bishop ensuring I will dominate the a7-g1 diagonal (which proves decisive.",
        "32... fxg4 33. f4": "I feel this is a really good move. It prepares my counterattack in the middle.  I am not worried about the passed pawn that is about to form on the right because of my control over the a7-g1 diagonal.",
        "33... g3+ 34. hxg3 hxg3+ 35. Ke1": "Black's passed pawn is born.",
        "35... Rg8g7": "In order to defend a7 I suppose.  Black had no way to defend e5.",
        "36. Rxe5+ Kd7": "This is a poor place for the king.  I think he should have placed the king on f6.  Either way though black has his work cut out for him as I have 4 ( soon to be 5) passed pawns.",
        "37. Bxa7": "Picks up a7.",
        "37... Rh6": "Perhaps to come to h1.  ",
        "38. Rg5 Rxg5 39. fxg5 Re6+ 40. Kd2 g2 41. c4": "The queenside pawn rush begins.",
        "41... Rg6": "Black can't figure out where to put his rook.",
        "42. Be3": "My darksquare bishop dominates the board.",
        "42... Ke6 43. Kc3 Ke5 44. d4+ Ke4 45. d5": "d5!  My plan is to sacrifice bishop, pickup g2 and then begin my queenside attack.",
        "45... Kxe3 46. Rxg2 Bd7 47. c5 Ke4 48. c6 Bc8 49. Rd2": "Putting power behind the d5 pawn.",
        "49... Rd6": "I thought this move interesting as I just read the chapter on passed pawns in My System (in which the blockade is talked about.)",
        "50. Kc4 Kf5 51. Kc5 Rd8 52. d6": "Black's pieces are pushed back to the wall.",
        "52... Kxg5 53. d7 Ba6 54. c7 Rxd7 55. Rxd7 Kf4 56. Rd8": "Black resigns."
    },
    "url": "https://gameknot.com/annotation.pl/2-knights-defense?gm=39505",
    "gameName": "2 Knights Defense",
    "players": "Me (1409) vs. Nykhood (1761)",
    "opening": "two knights defence (C58), Bogolyubov variation"
}