{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Bc4 Nf6 4. Ng5 Bc5 5. Bxf7+ Ke7": "two nights game, traxler variation. this was the initial position for the tournament. I have read material saying that 5. Nxf7 is the best response for white. which personally I thought might be true, since that does not involve the bishop retreat which is a tempo lost for white. anyway this is the variation I have to play and lets play it out.",
        "6. Bb3": "bishop has several good retreat, namely d5, c4 and b3 squares. personally I think d5 leads to equalization too soon, and c4 I have never tried (though looks good since it can be used against the inevitable pin that comes with all the two nights games. but I thought that this bishop is my only attacking piece.",
        "6... Rf8 7. O-O": "forced if white does not castle then  ... Bxf2 etc",
        "7... h6 8. Nf3 Nxe4": "!? this is not a move which looks like at par with the idea of blacks opening. it leads to equalization by white. obviously except the extra pawn white was several moves (two by knight and one by bishop ) behind where blacks king movement was not loss of a tempo since it clears the black queen",
        "9. c3 d6 10. d4 exd4 11. Re1 Bf5": "this is necessary any other move looses",
        "12. cxd4 Bb4 13. Nfd2": "to free the f pawn so that I can attack the knight better",
        "13... Kd7 14. Rxe4 Bxd2 15. Rg4": "notice that now white is attacking! usually in this variation white is put into the defensive stance too soon due to the lack of development, but in this 8.. Nxe4 variation the initiative is again goes back to white. ",
        "15... Bxc1": "not BxR since that will lead to mate very fast",
        "16. Rxg7+": "I think this was  not a good move, But I was impatient to get the black bishop to keep material balance",
        "16... Kc8 17. Qxc1 Qf6": "! saves h pawn, attacks rook and the pawn really good move and shows why the rook g7 was bad",
        "18. Rg8": "what else ? since .. Bxb1 threatnes Qxf2 and will loose another pawn",
        "18... Rxg8 19. Bxg8 Nxd4 20. Nc3 Kd7 21. Bc4 Re8 22. Nd5 Qg6 23. Qf4": "?? this is the worst move I made, I should have kept the queen on the c file. the later part of the game is a very good tactical show by yellowidol.",
        "23... Re4 24. Qc1": "??",
        "24... Rh4 25. Nf4 Nf3+ 26. Kf1 Rxf4 27. Qxf4 Bd3+": ":) awesome, I always feel uneasy with white in traxler. I thought the opening line chosen by black with Nxe4 on the 8th move is not good. I could not show that. But it was a great fun since I managed to fight. \n\nI hope you enjoyed the game, If you have any suggestions please comment on the game, it will help me to learn whites side of traxler better.\n\nthank you\nhimadri"
    },
    "url": "https://gameknot.com/annotation.pl/2-knights-defense-wilkes-barre-traxler-part2-c57?gm=6056",
    "gameName": "2 Knights Defense Wilkes Barre/Traxler Part2 (C57)",
    "players": "himu (1677) vs. yellowidol (1766)",
    "opening": "two knights defence (C57), Wilkes Barre (Traxler) variation"
}