{
    "moves": {
        "1. Nf3": "Round 4 of the 2007 Alabama State Championship begins, and I've got the white pieces against an old nemesis. I'm 0-3 lifetime vs. Miles, and my attitude about this tournament starts to falter a little. I really want to finish day 1 with a 3/4 score, but this is gonna be tough. I play my new favorite, 1. Nf3.",
        "1... Nc6 2. d4 d5 3. c4": "Offering up the gambit pawn.",
        "3... Bg4": "Nf6 also popular.",
        "4. e3": "Temporarily blocking in one bishop while activating the other.",
        "4... e6": "Black gets his other bishop in the game, and I entertain ideas of trading off my DSB...........",
        "5. Nc3": ".......but development comes first.",
        "5... Nf6": "5...Bb4 6. a3 was what I was hoping for.",
        "6. cxd5": "I go ahead and nab one of his central pawns, and plan Rc1 as quick as I can.",
        "6... exd5 7. Bd2 Bd6": "Perhaps he sees Bb4 as a weak investment, and simply develops in the center.",
        "8. Bb5": "Completing development, and introducing the threat of doubling his c pawns - which fits in nicely with my plans of Rc1.",
        "8... O-O 9. O-O Ne4": "Jumping onto his natural post straight away, and preparing a cute little tactic that I failed to see.",
        "10. Nxd5": "?! Here I get all excited because I think I have won a pawn, but I am only dreaming. Obviously, I see that 10. NxN exN looks ugly - but I really should have played the awkward looking Nb1.",
        "10... Bxf3": "! Oopps....now I see what he is up to. I'm about to get forked.",
        "11. Qxf3": "?! Allowing the fork which loses the exchange. 11. gxB perhaps deserved a little more consideration.",
        "11... Nxd2 12. Nf6+": "? I go into a deep think here and come up with a truly stupid idea. As I mentioned, I've played this guy 3 times before, and each time I simply got worn down in a endgame. I've never gotten into a tactical shootout with him before. My goal here is to sack the knight to double his f pawns, then BxN to double his c pawns if I can. Then, I reason, that I can gets my rooks vertical quicker than he can to snag a few targets. This whole upcoming sequence just doesn't work out like I envision it......",
        "12... Qxf6 13. Qxf6 gxf6 14. Rfd1": "Saving the exchange.",
        "14... Ne4 15. h4": "!? Striking out on the kingside while limiting his knight.",
        "15... f5": "I can tell that we are both analyzing what happens after I play f3, but Ng3 works for black.",
        "16. f3 Nf6": "?! Black gets a little conservative, and takes a little breather to regroup. I thought for sure he would keep his knight close to my king. I now entertain the idea of a massive pawn push on the kingside if I can double his c pawns first.",
        "17. Rac1": "? Disregarding my own intentions. BxN was the plan and I ignored it. So much for the c pawn stack......",
        "17... Ne7": "Black now fully regroups, and prepares to coordinate his pieces.",
        "18. Kf2": "Thinking that  my plans were extremely suspect, I decide that the pawn push idea is gonna have to be my last shot. I prepare the g file while starting the march up the board.",
        "18... c6": "Black takes his time and starts slowly pushing me back.",
        "19. Bd3 Rfe8 20. g4": "Another long think here.....the idea is to sack open the g file play Rg1 .",
        "20... fxg4 21. fxg4 Nxg4+ 22. Kf3": "I'm brushing up against the boundary of suicidal logic here. I'm looking for ways to use my king as a totally offensive weapon, along with my great looking bishop and the g file I will surely own.",
        "22... Nf6 23. Rdg1+ Ng6": "Errrr......I hadn't really considered this well enough. What a great looking self imposed pin for black!",
        "24. e4": "!? I liked this move for white. Its shuts down d5 while threatening e5.",
        "24... Nh5": "Black of course sees this, and simply avoids it.",
        "25. e5": "Now I've got some room to work with. My king has more exposed than Mr. Nude World, but I do have some attacking chances.",
        "25... Bc7 26. Rg5": "Strong.....forces black to retreat yet again. ",
        "26... Ng7 27. h5": "Going for the all out assault on the enemy.",
        "27... Bd8": "Killing the planned attack. If I move the rook my h pawn falls.",
        "28. hxg6": "The h pawn straps on a suicide vest.",
        "28... Bxg5 29. gxh7+": "This check was given for morale purposes only........",
        "29... Kh8 30. Kg4": "Last prayer.......",
        "30... Bxc1": "Of course he saw the capture......As I hang my head in self imposed shame and ridicule, I end day one of the state championship with 2/4. So much for winning the Reserve section. But tomorrow is another day, and I convice myself that 4/6 would be a totally acceptable score. I retire to the bar, where several other chess heads are drinking heavily and analyzing games. I have a few drinks, talk about the ones \"that got away\" and try to glean something useful from all of the chess talk I hear. And then things get really interesting. A wedding reception lets out just as a baseball team and entourage enter. I'm sure that was the most ecclectic crowd that bar has ever had. Well, its off to the room and Ocean's 13 (don't bother....it was weak). See you in round 5!"
    },
    "url": "https://gameknot.com/annotation.pl/2007-alabama-state-championship-rd-4?gm=10117",
    "gameName": "2007 Alabama State Championship (rd #4)",
    "players": "Thomas G. (1419) vs. Miles M. (1616)",
    "opening": "Reti opening (A04)"
}