{
    "moves": {
        "1. e4 e6 2. d4 d5 3. Nc3 dxe4 4. Nxe4 Nd7 5. Nf3 Ngf6 6. Bg5 Be7 7. Nxf6+ Nxf6 8. c3 O-O 9. Bd3 c6": "It was hard to attach a plan to this move, but I suspect my opponent chose it because it builds a \"normal\" pawn skeleton for this sort of opening. But it also encouraged me along a positional mission: restrict the scope of black's bishops. \r\n\r\n9... b6 aiming at piece pressure on d5 and e4, seems a more natural road to equality.  \r\n",
        "10. O-O b6": "This gives me a combinational idea I was very happy with at the time (though the computer seems to scoff): plant my white-squared bishop on e4 to contest the long diagonal. \n",
        "11. Qc2 h6 12. Bh4": "While the Nf6 needs to be eliminated as a prerequisite for my Be4 plan, I was prepared to accept the loosening of k-side pawns as equivalent compensation. \n",
        "12... Bb7 13. Bxf6 Bxf6 14. Be4 Qc7": "The natural end of the Be4 combination. I am fairly pleased with my position, since 15 Rfe1 c5 16 Bxb7 Qxb7 17 dxc5 bxc5 leaves black with an isolated c-pawn and a marginally bad bishop. \n",
        "15. Rfe1": "15. Rad1 might have been slightly more appropriate, since ...c5 will likely lead to to opening of the d-file. \r\n",
        "15... Rac8 16. Rad1 Qe7": "I could not wrap my brain around this move. I thought perhaps black wanted to ensure that he could recapture on c5 with the rook, but since I wouldn't have been able to seriously harrass a Qc5, this just seems like a loss of tempo. \n",
        "17. Ne5 c5": "This opens up some combinational doors...\r\n",
        "18. Bxb7 Qxb7 19. dxc5 Rxc5": "With this inaccuracy I should win the exchange. At the board, however, my calculation efforts failed and I inflicted only minor structural damage. I think my oversights here were driven in part by my sense that Nd7-Nxf6  was my primary goal, and so I simply didn't look hard enough for the key move. \r\n19... Bxe5 20. Rxe5 bxc5 seems safest.\r\n",
        "20. Nd7 Rg5 21. Qe4": "This is good enough for a minor advantage, but no more. If only I'd looked a little harder before 20 Nd7 I would have seen 21. f4 Rf5 22. Nxf8 Kxf8 23. Rf1 which wins the exchange outright, as initially planned. \r\n",
        "21... Qxe4 22. Rxe4 Rc8 23. Nxf6+ gxf6 24. Rd7": "Too aggressive, especially considering the fact that white's king is not yet secure against back-rank threats. \n",
        "24... a5": "24... Rb5 is the threat in the wings, though I do not see it. \r\n",
        "25. Red4 Kg7": "25... Rb5 does not work here because white's rooks are connected on the d-file. \r\n",
        "26. Rb7 Rb5": "I'll give him the exclamation mark, even though it took him a couple of moves to see the light. For my part, I calculated what I considered his only two responses (...b5 and ...Rc6) very extensively, when clearly I should have double- and triple-checked that these were his *only* options. And just to be clear, I had more than an hour and a half on my clock at the time. \n",
        "27. Rd2": "The best of a bad situation--still loses a pawn!\n",
        "27... Rxc3 28. h3": "I chose h3 because I wanted to keep g3 free for a rook, in case I ever had the option of getting one there. Interestingly, 28 g3, if the rest of the game had gone on as it does, would have saved the draw by keeping my king one move closer to the center. \n",
        "28... Rc1+ 29. Kh2 Rc6 30. b3 Rf5 31. Rbd7 Rcc5 32. Rd7d3": "Desperately regrouping for defensive operations. \n",
        "32... Rcd5": "Black thought long and hard over this move, and the later course of the game would justify the effort. I pondered my response for about 20 minutes and concluded that I could successfully blockade the passed d-pawn that's about to be created. I was wrong, but it's interesting to see why. \r\n",
        "33. Rd3xd5 Rxd5 34. Rxd5 exd5 35. Kg3 f5 36. f4 Kf6 37. Kf3": "I'd calculated accurately to this point before making the exchange on move 33, counting the pawn tempi available to both sides, and ultimately deciding that I could prevent black's king from breaking through my lines. \n",
        "37... d4": "I have to give my opponent the double-exclam here because I believe this little move is the difference between a win and a draw, since he will now be able to bring his king closer to the queenside pawn skirmish and force his way through to the key square c5.\r\n\r\nAlternative variation: 37... Ke6 38. Ke3 Kd6 39. Kd4 b5 40. a3 b4! [ensuring that black can gain access to white's position via c5.] ( 40... f6 41. b4 axb4 42. axb4 h5 43. h4 [=] ) 41. a4 h5 42. Kd3 Kc5 43. h4 d4 [And now white must be very, very careful. ] 44. Kd2 f6 45. g3 [With the pawn tempi exhausted, white can keep black at bay by shuttling between d2, e2, and d3--as long as he's sure to occupy d3 at any time black threatens Ke4. For example:] 45... Kd5 46. Kd3 Kc5 47. Ke2 Kd6 48. Kd2! [maintaining the opposition. ] \r\n",
        "38. Ke2 Ke6 39. Kd3": "39. Kd2 is probably the better theoretical move, keeping the kings an odd number of ranks apart and maintaining the possibility of the opposition, but in practice it doesn't affect the result. 39... Kd5 40. Kd3 h5 41. h4 f6 42. a3 Kc5 43. g3 Kd5 44. a4 Kc5 \r\n",
        "39... Kd5 40. a3 Kc5 41. g3 h5 42. h4 f6 43. Kc2 b5 44. Kd3": "Not that it matters, but this loses more quickly than the alternatives. \n",
        "44... b4 45. a4 Kd5 46. Ke2 Ke4 47. Kd2 d3 48. Kd1 Ke3 49. Ke1 d2+ 50. Kd1 Kd3": ""
    },
    "url": "https://gameknot.com/annotation.pl/2007-northeast-open-stamford-ct?gm=9083",
    "gameName": "2007 Northeast Open, Stamford, CT",
    "players": "bucklehead  vs. EK ",
    "opening": "French (C10), Rubinstein, Capablanca line"
}