{
    "moves": {
        "1. d4 Nf6 2. c4 g6 3. Nc3 Bg7": "We play into the King's Indian defense",
        "4. e4 d6 5. Nf3 O-O 6. h3": "King's Indian makagonov.",
        "6... Nc6 7. Bd3 Re8 8. Be3 e6": "? I was expecting e5, breaking into the center...",
        "9. O-O Bd7 10. Qd2 Rf8": "? I also didn't understand this move. My opponent wasted a tempo by moving the rook back to f8. She was probably changing plans, and aiming for an f5 break later on.",
        "11. Bh6 Ne8 12. Bxg7 Nxg7": "? And yet another mistake. I was figuring Ne8 was to prepare f5. This allows me to play Qh6 with possible mate threats. Better would have been Kxg7 to block off h6.",
        "13. Qh6 Nh5": "Good defense. A not so smart move like f5 would end in Ng5 and black is in a world of hurt if not mated...",
        "14. Ng5 Nf6": "Now the f6 knight is pinned down to defending h7, so any attacks on the knight will win it.",
        "15. f4": "Preparing e5, winning the knight. This can not be avoided",
        "15... Re8": "hehe... black moved his rook from f8 to e8 to f8 to e8. This time it is all he can do to keep from getting checkmated.",
        "16. e5 Nxd4": "Might as well",
        "17. exf6 Qxf6 18. Qxh7+ Kf8 19. Nce4": "Black is being attacked left and right and can barely keep up",
        "19... Qg7": "Trading queens would stop my attack, and so black goes for it. Now, I have to decide to trade and win with my knight vs. pawn advantage, or to continue my attack with Qh4. Although trading looked tempting, I decided to continue my attack.",
        "20. Qh4 Nf5": "This is exactly what I had prepared against when playing Qh4. Her best defense would have been Re7... anyone see a 5 move combination?",
        "21. Nh7+": "check",
        "21... Kg8 22. Nef6+": "check",
        "22... Kh8 23. Bxf5": "Have to get rid of the pesky knight first...",
        "23... exf5 24. Ng5+": "or Nf8+",
        "24... Qh6 25. Qxh6#": "Checkmate. This was a very good game for me, and a nice way to finish off the tournament. I finished the tournament with 3.5/5.0, and tied for second place, unfortunately not winning anything because of a three way tie for first... My rating jumped up to 1571 after the tournament. I will try to post more of my better games as I play more tournaments. Adios!"
    },
    "url": "https://gameknot.com/annotation.pl/2012-michigan-m-x-and-class-championship-round-5?gm=42945",
    "gameName": "2012 Michigan M/X and Class Championship Round 5",
    "players": "Joshua P. (1517) vs. Joy C. (1475)",
    "opening": "King's Indian (E90), Larsen variation"
}