{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Bb5": "The ruy lopez.  ",
        "3... a6 4. Bxc6": "The exchange variation.",
        "4... dxc6 5. O-O Bg4 6. h3 h5": "The Alapin gambit.  Id never seen this line before but it looks interesting.  Black does not bother saving his bishop. White has to decide when and if to take the sacrifice.",
        "7. d3 Qf6 8. Nbd2 Ne7 9. Re1 Ng6 10. Re3 Bc5 11. Re1 Nf4 12. Nb3 Ba7 13. Bxf4 Qxf4 14. Qd2 Bxf3 15. Qxf4 exf4 16. gxf3 Ke7 17. e5 Ke6 18. d4 Rh6 19. c3 Rah8 20. Kh2 Rd8 21. Reg1 Rg6 22. Rxg6+ fxg6 23. Rg1 Kf7 24. Re1 Ke6 25. h4 c5 26. Re4 Rf8 27. Nc1 cxd4 28. cxd4 c5 29. dxc5 Bxc5 30. Nd3 b6 31. Kg2 Rd8 32. Nxf4+ Kf7 33. e6+ Kf6 34. a3 a5 35. b4 axb4 36. axb4 Be7 37. b5 Rd6": "Blacks almost in trouble but white has no killer blow. The black rook has to stay on the d file to prevent the knight check at d5.",
        "38. Rc4 Rd2 39. Rc6 Rd6 40. Rxd6 Bxd6 41. Nd5+ Kxe6 42. Nxb6 Bf4 43. Nc4 Kd5 44. Ne3+": "Bishop takes knight leads to a lost k and p ending so black will keep his bishop and white retains his knight.",
        "44... Kc5 45. b6": "A tactic.  if the king swallows the pawn indigestion follows Nd4 check and the bishop is lost.",
        "45... Bb8 46. Kf1 Kxb6 47. Nd5+ Kc5 48. Ne7": "The next few moves demonstrate the superiority of the bishop over the knight in the endgame but is not enough  to win the game for black.",
        "48... Kd6 49. Nxg6 Ke6 50. Nf8+ Ke7 51. Ng6+ Kf7 52. Nh8+ Kf6 53. Ke2 g6 54. Kd3 Kg7 55. Nxg6 Kxg6 56. Ke4 Ba7 57. f4 Bxf2 58. Kf3 Bxh4 59. f5+ Kxf5": "I was dreaming of victory.  At this point  I realised the truth.  This is the wrong bishop.  I need a light squared bishop.  Whites king can never be forced out of the corner.",
        "60. Kg2 Bd8": ""
    },
    "url": "https://gameknot.com/annotation.pl/2016-02-05-ruy-lopez-alapin-gambit?gm=60889",
    "gameName": "2016.02.05 RUY LOPEZ, ALAPIN GAMBIT",
    "players": "emphyrio1500 (1617) vs. capa1 (1750)",
    "opening": "Ruy Lopez (C69), exchange variation, Alapin gambit"
}