{
    "moves": {
        "1. d4": "Unlike with me or players that I know in person, you don't or can even predict the first move that a GM will play.  Generally speaking, it's usually 1.e4 or 1.d4  But, they can play something that you didn't expect like 1.Nc3 or something like 1.b2.",
        "1... Nf6": "This is the second most common move to 1.d4.  The most is 1...d5, but this can and does lead to other known variations.",
        "2. c4": "Like the Grunfeld Defense which I first heard about and have seen multiple in charlshiggie's annotations.",
        "2... e6": "This is a common response to white's last move.",
        "3. Nf3": "As is this.  In fact, the next few moves are familiar to me.",
        "3... d5 4. Nc3 c6": "But, this is where we start to get into unfamiliar territory, as far as, I'm concerned.  I would've played 4...dxc4 as I've seen in other games.  So, this is where as Ken put it the, \"more educational approach\" appears for me.  As there's something to be learned for a move that one hasn't seen before.  In fact, I learned plenty when I first saw and played against the Caro Kann Defense with elyhim.",
        "5. g3": "I would've taken on d5 with c4 since that's similar to what I've seen.  But, I like this fianchetto a lot by Carlsen since he's aiming for the longest diagonal of his B.  However, Ding's next move is how I would've answered, nonetheless.",
        "5... dxc4 6. Ne5": "Centralizing his N which is a good strategy for trying to gain a space advantage.  As you're closer to getting more space in the center since that's where a piece now lies.",
        "6... Nbd7": "Preparing to exchange N's.  But, Carlsen will have none of that and takes on c4, instead.",
        "7. Nxc4 b5": "That's when, Ding goes on the offense.",
        "8. Ne5": "I would've retreated on f3 to prevent a series of exchanges, as I wouldn't be ready or see a good reason for doing so.  Having said that, there was a good reason, but I don't know what it is about exchanging that benefits Carlsen here.",
        "8... Nxe5 9. dxe5 Qxd1+ 10. Kxd1": "And, I would've captured with 10.Nxd1 in order to maintain castling rights.  I don't what it is, but there's something about castling which is not as good here, as otherwise, Carlsen would've taken with his N.",
        "10... Nd5": "Keeping in mind that white can't castle, I would've reattacked with 10...Ng4.  But, there's something about Carlsen's Nc3 that's menacing for black which is why Ding tries to exchange it but Carlsen refuses with his next move.",
        "11. Ne4 Bb7": "Continuing with his development.",
        "12. Bg2": "As does Carlsen.",
        "12... c5": "Giving his Bb7 more mobility since it covers one more square now.",
        "13. Bd2": "Meanwhile, Carlsen completes his development and prepares to do something with his Ra1, attack c5 a second time which will happen on his happen on his next move.",
        "13... Be7": "Ding also completes his development here.",
        "14. Rc1 c4 15. Kc2": "Connecting his R's which is very useful.  In fact, even though it's not the same as castling because of where the K's at compared to where it remains, otherwise, this is very similar.  And, that's because it involves the same idea as that, combined with, completing development behind it.  The saying for all of this is that the R's see each other.",
        "15... O-O-O": "The same is to be said for Ding.  But, I, however, would've castled short.  Upon reviewing it, I figured out why castling long was better, and that's due to the fact that black is threatening the masked battery on Carlsen's on white's Bd2 with 16...Nb6, and pinning it with 17.Ba5 isn't much use since black could then answer with 17...Kc7.  But, Carlsen has an answer to that issue with his next move.",
        "16. Rhd1 f5": "So, Ding goes for something else, tempo, by attaching Carlsen's Ne4.  ",
        "17. Nd6+": "I would've played 17.Ng5 to not only avoid losing material but preventing an exchange.  On the other hand, upon playing this, I figured out that this exchange favors Carlsen.  White is threatening to win the exchange with 18.Nf7, so the only way out is to exchange.  From that, even though I thought the opposite, Ding's Be7 was more mobile then Carlsen's N.",
        "17... Bxd6 18. exd6 Rxd6 19. Bxd5": "Likewise, Ding's Nd5 was more active then Carlsen's Bg2.",
        "19... exd5 20. Bc3": "This is a dual purpose move, as Carlsen is further mobilizing his Rd1, whilst, attacking g7.",
        "20... Re8": "And, Ding counterattacks.  I'm not surprised to see Carlsen defend.",
        "21. e3 g5": "As does Ding.",
        "22. Rd4": "Mobilizing his other R.",
        "22... Re4": "Ding has plans to attack h2, but Carlsen was ready for that with his next move.",
        "23. Rh1 Rh6 24. h4": "I don't know why Carlsen played this since his h pawn didn't seem attacked.  At first, I thought that it was to get a passed pawn with 25.hxg5??.  And, as with Erika's annotation combined with ION's comment, I figured out that this unplayable because of 25....Rxh1.",
        "24... Kd7": "Unlike previous moves, I don't see the point behind this one as this isn't an endgame, yet.  Instead, 24...gxh4 was the only move that came into consideration for me.",
        "25. a3": "But, I do see the point behind this one, as Carlsen prevents Ding from attacking with 25...b4  This means that his B is in the best place that it can be, and I see why, as his Rd4 remains protected 3 times.",
        "25... g4": "As noted on his previous move, I would've taken on h4, but I see why Ding played this, instead, as it blocks Carlsen's g3 pawn which is generally a useful strategy from the late mid game through the endgame.  But, not being willing chance anything else, Carlsen exchanges to isolate black's f and g pawns. ",
        "26. Rxe4 fxe4 27. b4": "Stopping black's c pawn.  But, having said that, I would've answered with 27...cxb3 e.p., as opposed to, what Ding plays.  However, I do see the idea behind it, since black goes right after a3 instead.  Second, taking en-pessant isn't that effective because of 28.Kxb3.",
        "27... Ra6 28. Kb2": "I would've protected with 28.Ra1  But, I see the point because with the R's exchanged, we're now into the endgame where the K becomes a useful weapon.",
        "28... h5": "Blocking Carlsen's h pawn, for now.",
        "29. Rd1": "This is where I get into a moment of that I don't what I'd do here.  As far as, I'm concerned here, it's already a draw, and seeing what Eric posted in the game between ION and fiercequeen of, regarding the, \"Let's Give them something to talk about\", he said \"boring\", for several moves.   I start to feel the same way here, but this is where it also gets more educational as there's much to be learned, in ways that I don't realize.  I would now think that it's a draw, and wouldn't know what to do or where to go.  So, upon making this move, if I had this position, I would've offered my opponent a draw, at this point.  ",
        "29... Ke6": "But, there's a good chance that he or she would decline the offer because just when I'd think that I've seen everything and nothing else can occur something else develops, so it starts to get interesting, even if one doesn't realize it.  The reason being is because it should be a draw with best play.  But, one mistake, from either can and sometimes makes or breaks the moment, wins or loses, at that stage in the game.  In fact, I remember that happening to me once where I got board, didn't know what to do, and thus, offered a draw which Coach Stockel declined.  And, he told me why he was not accepting a draw by saying, \"You offer me a draw? I don't have to give you a draw.\"  ",
        "30. Rd2": "Then, he asked a similar question to what Ken asked me in one of our training sessions, as well as, some of my annotations, shortly afterwards.  He mentioned how things could get interesting with an example, being his next move.  Then, he asked, \"what are you going to do now?\"  Right after that, I made a mistake, and lost shortly afterwards.  With that being said, there were no blunders from either side and a draw is not far off here.",
        "30... Bc6": "Having said that, this starts to get interesting for me again because Ding's B only covered 3 squares before this move.  But, that amount is doubled with 6 covered.",
        "31. Bd4": "Something similar is to be said with Carlsen, as the B only covered 1 square, but it now covers 4.",
        "31... Be8": "With that being said, I don't see the point behind this move since it doesn't cover as much now.  But, although I normally wouldn't say that, it doesn't matter to me.  And, the only reason I'm saying is because Carlsen's last move, as well as, this move will repeat.  This will result in the same position being repeated 3 times which will end in a draw by repetition.",
        "32. Bc3 Bc6 33. Bd4 Be8 34. Bc3 Bc6": ""
    },
    "url": "https://gameknot.com/annotation.pl/2019-sinquefield-cup-playoff-game-1?gm=66903",
    "gameName": "2019 Sinquefield Cup Playoff Game 1",
    "players": "Magnus Carlsen  vs. Liren Ding ",
    "opening": "Queen's pawn game (E10)"
}