{
    "moves": {
        "1. e4 e5 2. Nf3 f6 3. Bc4 a6 4. Nh4 d6": "Esse foi o meu primeiro erro.. troca do cavalo dele pela minha torre..\r\nNa proxima jogada dele, ja sabia que iria perder a torre.. minha escolha é perde-la mas preendendo a rainha ...",
        "5. Qh5+": "Como disse , defender com o piao 7g não iria resolver o problema ... peder a torre e o cavalo , alem de deixar a rainha livre... por isso optei por mover o rei..\r\n\r\nEstava correndo atras do meu erro.\r\n",
        "5... Kd7 6. Ng6 hxg6 7. Qxh8 Nh6": "Neste momento, isolei a rainha do meu adversario ... O estrago foi amenizado.. O problema é que meu jogo esta totalmente preso também.",
        "8. O-O": "Na minha opinião, o 0-0 foi muito cedo... já definiu minha área de ataque...",
        "8... Nc6": "Com a Rainha isolada, comecei a trabalhar para pega-la e virar a vantagem dele.\r\nOutra coisa nesta joda é  para liberar minhas peças.",
        "9. d3": "Esse lance , foi para aumentar as chances deliberar a rainha ... ",
        "9... Ne7": "Meu erro... fiquei tão preocupado que a rainha branca pudesse pegar meu piao g6, que fiz o movimento do cavalo antecipadamente e fazendo meu pião f6 com uma unica desefa.. a do piao que defendia o cavalo.",
        "10. Bxh6": "Agora foi a jogaga certa.. trocar bisbo por cavalo... ",
        "10... gxh6": "E a rainha dele escapa e aumenta mais a vantagem... (Depois de tudo fiz uma outra analise variando as jogadas, se fiz tudo certo... não achei que consegueria bloquear a rainha dele).",
        "11. Qxf6 c6": "Preciso de uma saída extra para o rei.. o risco de mover para casa branca com o bispo de na área é muito alto, alem de na proxima jogada poder tirar o bisbo branco dali...  \r\n",
        "12. Be6+": "Um ataque sem muito efeito.... ou ele estava querendo propor a troca? Foi o que pensei, mas não tinha muito o que fazer... afinal ja tinha cometido dois erro, neste jogo.\r\n\r\n\r\n",
        "12... Kc7": "A escolha dele... trocar ?",
        "13. Bf7": "Em fim... Não... perdeu a oportunidade de continuar com mais peças e maior valor diminuindo as minhas chances... \r\nAcho que foi seu primeiro erro.\r\n",
        "13... g5": "Tudo bem que ameaço meu piao g6, mas com um movimento de avanço meu pião agora em g5, esta defendido.  Otima jogada... a rainha dele agora tem poucos lugares para ir...",
        "14. Nd2": "Jogada de liberar suar forças de ataque...",
        "14... b5": "Continuo avançando com os peões...  bloqueio o avanço do cavalo dele... uma jogada de duplo valor.",
        "15. Qf3": "E a rainha recua... Porque?  Não sei muito o porque, mas gostei de não ter a rainha branca perto.... ",
        "15... Bg7": "Agora eu gostei... dobrei a defesa do pião f5 e liberei espaço para rainha preta... meu novo objetivo ... chegar ao rei pelo corredor da torre do rei.",
        "16. c4": "Um boa jogada... Liberar espaço para o cavalo em b3.. mas estou defendido.. eu não vou,  prefiro o ataque dele e eu libere minha torre em a8",
        "16... Qh8": "Meu foco.. o rei.. ",
        "17. Bh5": "Ótima jogada dele... prende o avanço do peão h6 com o bispo",
        "17... Be6": "Avanço meu bispo ... nova jogada boa. Além de continuar com o foco no rei pelo corredor, liberei mais uma força de ataque a minha torre.",
        "18. Rac1": "Um jogade de defesa e ataque... 3 peças defendendo o pião que não quero, porem fica um corredor direto para meu rei... defendido apenas por um peão.. \r\nImaginei que ele viria com tudo  assim que pegar meu pião b5",
        "18... Rf8": "Continuo com meu foco... agora ataco a rainha branca... ele tem que se defender.  Ainda espero que ele pegue meu pião b5, mas vai ter que esperar ... a rainha tem prioridade",
        "19. Qe3": "Defesa e ataque...  Uma jogada esperada e muito boa... A rainha pode ataquer em a7.",
        "19... c5": "Essa jogada eu já tinha previsto... observe bem o que aconteceu... Meu jogo esta avançado com peões,  a rainha branca esta sem movimentação de ataque... eu isolei todas as entradas ao meu rei..  Agora o foco volta para o outro lado... poucas defesas e poucos ataques...",
        "20. b4": "A melhor jogada de ISMAILCHESS... Não posso tirar meu peão do lugar a rainha branca fica com o corredor livre... ",
        "20... bxc4": "Ataco !!! tenho que garantir que a torre branca não venha...  Se pegar meu peão C4, problema resolvido... uso o peão branco como defesa.\r\n\r\n",
        "21. bxc5": "Não posso tomar o peão... é minha defesa contra a rainha. Avanço o peão para d5, minha melhor opçaõ. Ele pode pegar meu pião em d5... Acho que a troca é o melhor para ele , continua com maior número de peças. ",
        "21... d5": "Aguardo a jogada... minhas chances são pequenas exd5..",
        "22. Nf3": "Ele falhou... cavalo pode atacar meu peão, mas tem defesa do bispo.",
        "22... Nc6": "Minhar melhor jogada neste jogo. Defendo o peão em e5, bloqueio o avaço do peão branco c5 para c6. O fato de desproteger a casa g6 não afeta meu jogo. Aqui meu foco mudou novamente... agora vou ter que ir pelo outro lado.",
        "23. Bg6": " Não posso avançar a rainha para h7 .. Será que ele liberou para eu avançar o peão para h5? Não acho. Outra falha dele?",
        "23... d4": "Isso sim... Apesar de estar com menos peças, o posicionamento do jogo mudou . Me sinto em vantagem estratégica.  A rainha branca só pode  recuaar , liberei o corretor do bispo branco mais um casa e ainda avança o peão para d4.",
        "24. Qd2": "Defesa.",
        "24... c3": "Ataque duplo... Rainha branca e peão em a2 e ainda dominei a casa b2. ",
        "25. Qc2 Rb8": "Novo foco... O corredor é meu.  Proteger o rei antes de tudo. Para ele é melhor propor a troca com a torre.  Mesmo em menor número agora já acho que é vantagem, pois o cavalo dele esta inutilizado no mometo.",
        "26. Qa4": "Ele tenta atacar... meu pião sem defesa.",
        "26... a5": "Bloqueio o avanço da rainha branca... meu peão é um gladiador.",
        "27. Ne1": "Retorna o cavalo para novo foco do jogo... Ele perdeu jogadas preciosas.",
        "27... Rb2": ""
    },
    "url": "https://gameknot.com/annotation.pl/297queens-mini-tournament-ii?gm=41222",
    "gameName": "297Queens mini-tournament II",
    "players": "ismailchess (1324) vs. lucchess (1635)",
    "opening": "Damiano's defence (C40)"
}