{
    "moves": {
        "1. e4": "For a couple of years now I feel(no statistic/scientific observation or calculation regarding chose of openings) I have been kind of lacking aggressive play and have been too worried and concerned about doing the theoretically basic right moves. With 1300 games played here at GK I should have more than enough experience by now... but are still in lack of theoretical knowledge due to low interest in theory(books etc), which I believe certainly will improve my play. \r\n\r\nI have recently decided to start playing more aggressive and intuitive and try to mix it with my experience and so hopefully that will help me improve my rating. Anyway I think it will be funnier to play(started to be a bit bored with my play) :-)",
        "1... e6": "French defense opening, which has a reputation for solidity and resilience, though it can result in a somewhat cramped game for Black in the early stages. Black often gains counterattacking possibilities on the queen-side while White tends to concentrate on the kingside(wikipedia.com).\r\n",
        "2. d4": "White expands his claim on the centre.",
        "2... Be7": "I have never met this 2nd move by black. To me it appears as a drawback considering fighting for control in the centre.",
        "3. f4": "I had my doubts about this one, but on the other hand I have a liking for a half-open f-file because I feel I possibly quickly get my rook into play after castling.",
        "3... b6": "fianchetto, pointing to my king-side and than maybe I have weakened my it too much for king-side castle...",
        "4. Nc3 Bb7 5. Bd3 Nf6 6. Be3 Nc6 7. a3": "I don't like the idea of having the black squared bishop entering my queen-side now that I have doubts about castle king-side",
        "7... d6 8. h3": "Why? Now I'm getting the feeling I'm too cautious again and not part of my idea of starting to play chess more aggressively and I'm quite sure I lost a tempo by doing that move. I think Nf3 would have been better...",
        "8... h6 9. Nf3 Nd7 10. Qd2": "Except for castling, both players have now lined up there pieces, ready for middle game",
        "10... Bf6 11. O-O-O": "queenside castle which often leads to a sharp game",
        "11... a6": "Black making room for the knight and open up all the lines for a rapid forward pawn assult on the white king. ",
        "12. h4": "Black still has not made a castle, but for white there is no time to wait and see whether black castle to the king- or queen-side. Funny to notice that at least the predictions of a French opening is coming true - White attacking king-side and black the queen-side",
        "12... Na7": "And now it starts, Who's the fastest one",
        "13. g4 c5 14. h5 b5": "Black's line up appear much stronger to me. Black has a lot of possibilities now. c4 will directly attack my white sq. bishop and block from effective defence of my king. Qb6 will put heavy pressure on d4 and help in controlling b-line for a possible attack on the king. I chose not to care and continue my attack",
        "15. g5 Be7": "b4 pressure is a bit lighter now, but really just moved to the a3 square. White on the other hand are about to get a strong kingside attack and black is still blocking a queenside castling by not moving the queen out of the last row",
        "16. Rdg1 Qc7 17. gxh6 gxh6 18. f5": "White is now opening the black kingside and black seems a bit paralyzed and has apparently stopped attacking white. black h-pawn is lost if not black find a quick way to occupy white with something else. I was now expecting 18...c4, would I then pulled back my white sq. bishop or continued my attack, e.g. 19. fxe6 cxd3 20. exd7  ",
        "18... exf5 19. Nd5": "the idea here was to exchange a knight for a bishop and then the f-pawn is lost",
        "19... Qd8 20. Bxh6 Nf6 21. Bg7": "Bg7! And now there is a lot of tactical chooses to make for black. \r\nWhich is the best one for black?\r\nUnfortunately I have trouble finding any good ones. This is one suggested line; 21. Bg7 fxe4 22. Bxh8 Bxd5 23. Bxf6 Qd7 24. Rg8  Bf8 25. Re1 \r\n\r\n\r\n\r\n\r\n",
        "21... Nxe4 22. Bxe4 fxe4 23. Bxh8 exf3": "As far as I can see the black queen is lost whether black did take the time to fetch a knight or not",
        "24. Rg8+ Bf8 25. Bg7": "And the rest of the game is just making the way to white victory, unless I blunder along the way",
        "25... Bxd5 26. Rxf8+ Kd7 27. Rxd8+ Rxd8 28. dxc5 Bc6 29. Qa5 Re8 30. Qxa6": "Taking that pawn is maybe a bit dubious...",
        "30... Nc8 31. Rd1 f2": "Now there is danger of black managing to promote the pawn in the e-file; Re1 Rxe1; fxe1=Q , so white need more pieces pointing at the e1 square",
        "32. Qa5 Bg2 33. Qxb5+ Kc7 34. cxd6+ Nxd6 35. Qc5+ Bc6 36. Qxd6+ Kb7 37. Qb4+ Kc7 38. Qf4+ Kb7": "Thanks for the game and Im very happy for comments!"
    },
    "url": "https://gameknot.com/annotation.pl/2nd-belgrade-open-ultrafast-games?gm=13470",
    "gameName": "2nd Belgrade open - ultrafast games",
    "players": "norjoa (1558) vs. el-rancho (1512)",
    "opening": "French defence (C00)"
}