{
    "moves": {
        "1. d4 d5 2. Bf4 Nc6 3. e3 Nf6 4. Nf3 Bf5 5. Nc3 g6 6. Nb5 e5": "Black looks to open his black bishop and break the tension.",
        "7. Nxe5 Nxe5 8. dxe5 Ne4": "Ne4?\nNh5!",
        "9. f3 Nc5 10. Qe2 Bg7 11. O-O-O O-O 12. Nd4 Qd7 13. Qb5 Na4": "Na4 avoids 13. ...Qxb5? 14. Nxb5 ... 15. Nxc7 forking Black's rook and queen pawn gaining a pawn.",
        "14. e6 Bxe6": "Who says there's no such thing as a free pawn for lunch?",
        "15. Nxe6 Qxb5": "Qxb5 is better now that Black's bishop's diagonal is clear.",
        "16. Bxb5 Nxb2 17. Rxd5 fxe6 18. Rd7 c6": "protects Black's queen bishop pawn and attacks White's light bishop.",
        "19. Be2 Rf7": "protects b7 and prepares rooks for doubling later",
        "20. Rxf7 Kxf7 21. c3 Bxc3": "Still eating at the \"All the free pawns you can eat\" seafood buffet.",
        "22. Kc2 Na4": "Com'on!  Chase me!",
        "23. Kb3 b5 24. Rd1 Ba5 25. Rd7+ Kg8 26. Bd6 c5": "Black hangs his queen's knight pawn.",
        "27. Bxb5 Nb6 28. Bc6 c4+ 29. Kc2 Nxd7 30. Bxa8 Nb6 31. Bc7 h5 32. Be4 Kf7": "protects Black's king's knight pawn and effectively hides from both White's bishops.",
        "33. h4": "The beginning of the end.  Using the Point Count, White has a point for the bishop pair and another for the off-side majority ( 2 p.c.).  Black has a point for the passed pawn, another because it is advanced and another for better king position ( 3 p.c.).  This is just the static picture, however, as h4 causes White's king's knight pawn to become backward with...",
        "33... Be1 34. Bd8 Nd5": "Bxd5 trades even material and connects two of Black's isolani.",
        "35. g4 Nxe3+ 36. Kb1 hxg4 37. fxg4 Nxg4": "In just four moves, Black has gained two pawns ( 6 p.c.) by checking the king before re-capturing.",
        "38. Bf3 Ne3 39. Bc7": "hangs White's pawn at h4.",
        "39... Bxh4 40. Be2 c3 41. Bd6 c2+ 42. Kc1 Bg5 43. Kd2 Nc4+ 44. Kxc2 Nxd6 45. a4 Bd8 46. Kb3 Bb6": "Black has a won game.  White's sole pawn is backward (-1 p.c.) and Black's bishop and pawn on the a-file are invincible since neither White's king nor light bishop can touch them.  Black is up 5 pawns ( 15 p.c.) putting Black more than 16 points in the lead.",
        "47. Kc3 e5 48. Kd3 Kf6 49. Bd1 Kf5 50. Ke2 Kf4 51. Kf1 g5 52. Kg2 g4": ""
    },
    "url": "https://gameknot.com/annotation.pl/2nd-official-great-lakes-minitournament?gm=5019",
    "gameName": "2nd Official Great Lakes minitournament",
    "players": "ettwidget (1175) vs. alng (1431)",
    "opening": "Queen's pawn, Mason variation (D00)"
}