{
    "moves": {
        "1. d4 Nf6 2. c4 d6 3. Nc3": "Book play in the Old Indian Defense.",
        "3... Nbd7 4. e4 e5 5. Nge2": "All routine.",
        "5... Be7 6. g3 O-O 7. Bg2": "Both players hasten to complete their development.",
        "7... Re8 8. O-O Bf8 9. h3": "Guarding against a potential ...N-KN5.",
        "9... exd4 10. Qxd4 Ne5 11. f4": "Since White is compelled to lose a Pawn, he seeks compensation with a strong Pawn center and a K-side attack.",
        "11... c5 12. Qf2 Nxc4 13. b3": "Forcing the Knight away from the K-side.",
        "13... Na5 14. Bb2 Nc6 15. Rad1": "Centralizing his Rook and pressuring Black's backward QP. The move also strengthens his grip on Q5, which would make a superb outpost for a Knight.",
        "15... Qa5 16. g4 Nd4 17. Nxd4": "Squelching Tchigorin's attempt at counterplay immediately.",
        "17... cxd4 18. b4 Qxb4 19. Rxd4": "Opening more lines for attack. Black's isolated QP and lagging development are crimping his game.",
        "19... Qa5 20. g5 Nd7 21. Nd5": "Seizing this powerful outpost at once. Depending on your taste in metaphors, this Knight is a rusty nail in Tchigorin's knee or a bone in his throat.",
        "21... Qd8 22. h4 Nb6 23. f5": "Forcing Tchigorin to remove the Knight, but this opens the diagonal of Cohn's QB, which aims ominously at Tchigorin's King.",
        "23... Nxd5 24. Rxd5 Bd7 25. e5": "A very powerful move. If Tchigorin now plays 25... PxP?? Cohn has 26 P-B6!! P-KN3 27 B-KR3!! and Tchigorin can resign.",
        "25... Bc6 26. e6": "26... BxR? now falls to 27 BxB PxP 28 PxP Q-K2 29 Q-Q4!!! and Tchigorin has no defense against 30 R-B7.",
        "26... fxe6 27. fxe6": "Now 27... BxR? fails to 28 Q-B7 ch K-R1 29 BxB R-K2 30 Q-B5 K-N1 31 B-K4!! and Black is defenseless.",
        "27... Qe7 28. Qf7+ Kh8 29. Rdf5": "White's powerful battery on the KB file threatens to break into Black's position decisively.",
        "29... Qxf7 30. exf7 Re2 31. Rf1f2": "Now Cohn has a promotion threat as well as mating threats.",
        "31... Rxf2 32. Rxf2 d5 33. Bd4": "Preventing Black from gaining counterplay with ...B-B4.",
        "33... h5 34. g6 Bd7 35. Re2": "THreatening 36 R-K5 followed by 37 RxP mate.",
        "35... Bd6 36. Bh3 Bb5 37. Re6": "Tchigorin resigns. If 37... B-B2, Cohn has 38 B-QB5! B-N3 39 BxB PxB 40 R-K5 forcing mate."
    },
    "url": "https://gameknot.com/annotation.pl/2nd-brilliancy-prize-game-karlsbad-1907?gm=37061",
    "gameName": "2nd Brilliancy Prize Game, Karlsbad 1907",
    "players": "Erich Cohn  vs. Mikhail Tchigorin ",
    "opening": "Old Indian (A53), Janowski variation"
}