{
    "moves": {
        "1. e4 c5 2. Nf3 e6 3. d4 cxd4 4. Nxd4 Nc6 5. Nc3 Qc7": "The Taminov Sicilian.\n",
        "6. Ndb5 Qb8 7. Be3 a6 8. Bb6": "This is one of the lines where i sacrifice my queen for 3 pieces.",
        "8... axb5 9. Nxb5 Bb4+ 10. c3 Ba5 11. Nc7+ Qxc7": "Forced, note that if 11...Kf8 12.Nxa8 Qxa8 13.Qd6+! followed by 14.Qa3 and 15.b4 will snare my bishop. I'm not so sure about 11...Ke7 though, if anyone has analysis that would be great.",
        "12. Bxc7 Bxc7 13. Bd3": "Another line is 13.Qg4.",
        "13... Nf6 14. O-O": "I'm not sure what to do here, does anyone have a possible plan? ",
        "14... d6 15. b4 e5 16. a4 Be6 17. Qe2 Ke7 18. Ra3 b6": "My position is getting uglier and uglier by the minute. I'm pretty sure i could of improved somewhere along the line, but i'm not sure where.",
        "19. Rfa1 Rhd8": "Going for a possible 20...d5.",
        "20. Bb5 Na7": "Where else? It's ugly, but its almost forced, as 20...Bd7 gets obliterated after 21.Qc4.\n",
        "21. c4 Nd7": "I couldn't find a good plan besides trying to get the knight to that newly created hole on d4 via f8 and e6 and trying to get my a7 knight back into play with Nb8, planning Nac6. I didn't like the looks of 21...Nxb5 because it gives up the A file.",
        "22. Qe3 f6 23. h3 Nf8 24. h4": "At this point i think my opponent doesn't have a plan.",
        "24... Bf7 25. f4 Ne6": "Encouraging 26.fxe5 because after i take with the D pawn, i get the D file.",
        "26. f5 Nd4 27. Ra1a2": "? This move drops a pawn.",
        "27... Naxb5 28. axb5 Rxa3": "Here i thought he had to take with the rook and then i had Nc2, but it doesn't really matter now.",
        "29. Qxa3 Bxc4 30. Qc3": "Intresting, he sacrifices a rook for a (bad) bishop and a pawn.",
        "30... Bxa2 31. Qxc7+ Rd7 32. Qxb6 Bc4 33. Qb8 Bxb5": "? Mistake on my part! I thought that after Qg8 i had Bc4, but i forgot that it was hanging. I think Nxb5 is better.",
        "34. Qg8 Bd3": "Might as well get some pawns!",
        "35. Qxg7+ Kd8 36. Qxf6+ Kc7": "Material is even now, but e4 is falling and possibly f5 will too.",
        "37. Qf8 Bxe4 38. f6 Bd5": "The bishop is very strong here, as it guards f7 and b7, and still keeps a eye on g2. Also, when my king gets off the seventh rank, it will almost be impossible to advance his passed pawns.",
        "39. Qh6 Rf7": "Blockading the pawn.",
        "40. Qc1+": "Useless move, but it is quite hard to find a plan here.",
        "40... Kd7 41. Qg5 Ke6": "Getting the f6 pawn.",
        "42. Qg8 Kxf6 43. Qd8+ Kf5": "The best move to try for a win.",
        "44. Qxd6 Ke4": "Haha, my king is in the center but he can't mate me!",
        "45. Qa6 Rb7": "Attacking the pawn, but Rg7 might be better.",
        "46. Qf1 Rg7": "Not 46...Rxb4??, as white has Qe1+!",
        "47. Kh2 Ke3": "My king is taking a nice stroll now on white territory...",
        "48. Qc1+": "Not 48.Qg1+ as 48...Ke2 wins on the spot.",
        "48... Kd3 49. Qa3+ Kc2": "White will run out of checks soon...",
        "50. Qa4+ Kd2": "No checks!",
        "51. Qa5": "Probably not the best. White cannot save a pawn here e.g. 51.g3 Nf3+ 52.Kh3 Be6+ 53.Kg2 Nxh4+, but i think giving up the H pawn is better then giving up the G pawn. ",
        "51... Bxg2": "I could not find a continuation for 51...Rxg2+ after 52.Kh3. Also, this threatens mate with the nice Nf3#",
        "52. b5+ Ke3 53. Qb6": "Stopping the threatened Nf3#, and threatening Qh6, which i almost fell for.",
        "53... Rg4 54. Qa7 Be4": "Stopping Qxh7 (not that it matters too much) and trying to weave a mating net around white's entrapped king.",
        "55. Kh3 Kf4 56. Qf7+": "Blunder, but white was pretty much lost anyway.",
        "56... Nf5": "Blocking the check and threatening mate on h4!",
        "57. Kh2 Rg2+": "Winning, as 58.Kh1 is met by 58...Rg7+.",
        "58. Kh3 Rg1": "Completing the mating net. White faces mate or the loss of his queen.",
        "59. Qa2 Rh1+ 60. Qh2+ Rxh2+ 61. Kxh2": "0-1"
    },
    "url": "https://gameknot.com/annotation.pl/3-pieces-for-a-queen?gm=40125",
    "gameName": "3 pieces for a queen",
    "players": "???  vs. Me ",
    "opening": "Sicilian (B47), Taimanov (Bastrikov) variation"
}