{
    "moves": {
        "1. e4": "Hoi Sophia!\nAls voorbereiding op de analyse van deze partij had ik even gekeken naar mijn commentaar op twee eerdere partijen en het viel mij op dat ik soms wel erg veel schreef. Ik zal proberen de commentaar hier kort en duidelijk te houden.\nVerder wil ik er op wijzen dat je voor deze partij bijna een jaar niet hebt geschaakt. Het is zeker niet erg een foutje te maken na zo'n lange afwezigheid.\nDeze partij toont aan hoe kwetsbaar een ontwikkelde dame kan zijn in de opening, maar ook hij gevaarlijk een dergelijke dame soms kan zijn. ",
        "1... e5 2. d4": "Aangezien wij de vorige zetten al eens eerder hebben besproken, zal ik hier beginnen. In schaken is het onverstandig de beslissing tot een zet te maken zonder een doel voor ogen te hebben. Het einddoel in schaken is schaakmat, maar in de opening van een partij kan dit doel nog erg ver weg en abstract lijken. Voor beginners is het daarom handig de 3 gouden openingsregels te kennen:\n\n- stukken ontwikkelen\n- pionnen in het centrum zetten\n- koning in veiligheid brengen\n\nDe zet die wit hier doet voldoet perfect aan de 3 regels. Hij zet twee pionnen in het centrum en opent erg veel lijnen voor zijn stukken, zodat deze zich snel kunnen ontwikkelen. Nadat wit hierna zijn stukken naar buiten heeft gebracht, kan hij snel rokeren (liefst koningszijde) en heeft hij een mooie positie om verder mee te gaan. Waarom is deze zet desondanks niet de populairste zet ooit?",
        "2... exd4": "De beste zet. De directe aanpak van wit zet druk op jouw centrum (de pion op e5) en zwart kan zich niet echt verloven om het te negeren. Als jij bijvoorbeeld besluit jouw pion op e5 te verdedigen door jouw paard op veld c6 te zetten, kan hij zijn pion op d4  doorschuiven waarna hij veel ruimte heeft in het centrum en jouw paard aanvalt.  ",
        "3. Qxd4": "De ontwikkeling blijkt met een prijs te komen. De dame is juist de stuk die je meestal niet te snel wilt ontwikkelen juist, omdat zij zo sterk is. Geen van beide spelers kan zich veroorloven de dame te verliezen en daarom kan zij makkelijk worden opgejaagd. ",
        "3... Be7": "?  Zwart ontwikkelt een stuk en komt en stap dichter bij rokade. Helaas is het echter fout, want er wordt een pion(g7) onverdedigd achter gelaten. Nadat de dame deze pion neemt, zou jij de dame enigszins kunnen opjagen door met de loper naar f6 te gaan. De dame zou weg moeten gaan en zwart zou een kleine ontwikkelingsvoordeel krijgen. Helaas is deze voordeeltje niet voldoende compensatie voor de verloren pion. Daar komt nog bij dat na het verliezen van de pion op g7 de zwarte koning zich iets minder op zijn gemak zal voelen.\nProbeer na elke zet niet alleen te kijken of de bewogen stuk/pion veilig staat, maar ook of er na de zet andere stukken onverdedigd achter wordt gelaten.\nIn plaats van de loper zet zou paard naar veld c6 zou een logische zet zijn geweest en de nadeel van de witte opening aantonen. Zwart ontwikkelt dan een stuk en valt de witte dame aan, waardoor wit zelf niet direct kan doorgaan met ontwikkelen.",
        "4. b3": "??  Een dubbele vraagteken hier, want wit laat niet alleen een grote kans liggen: hij geeft jou een grote kans om de voordeel te pakken. Na b2-b3 staan er twee zware, onverdedigde stukken op dezelfde diagonaal en jouw loper staat klaar om hier gebruik van te maken.",
        "4... Nc6": "? Zwart ontwikkelt een stuk en valt de dame aan. De directe Loper naar f6 zou echter sterker zijn geweest. De vroege ontwikkeling van de dame heeft de spel snel tactisch gemaakt en dus is het wat lastig om dit zonder variaties uit te leggen Na Loper e7-f6 wordt de dame aangevallen en als hij zou terugtrekken, kan jij een mooie onverdedigde toren (a1) grijpen. Wit zou dus na Le7-f6 zijn pion moeten opspelen (e4 naar e5) en wellicht was deze zet de reden waarom jij niet onmiddellijk de loper zet deed. De pion sluit niet alleen de diagonaal, maar valt de loper zelfs aan. Echter zou hierna de paardzet (Paard b8 - c6) de reddende zet zijn. De witte dame en de pion op e5 zou worden aangevallen en nadat wit zijn dame wegzet, kan jij de pion op e5 nemen. De extra pion in combinatie met de betere ontwikkeling zou wit een erg grote voordeel hebben gegeven.\nNa de zet die jij doet heeft zwart nog steeds een voordeel vanwege zijn betere ontwikkeling, maar kan wit directe materiaalverlies voorkomen. ",
        "5. Qxg7": "? Wit valt voor de valletje en gaat nu minstens zijn toren verliezen voor een pion. Beter was bijvoorbeeld terugtrekken met de dame naar e3 of d3 en als zwart zijn toren zou aanvallen met Le7-f6, zou hij zijn paard ertussen kunnen zetten (Pb8-c3). ",
        "5... Bf6": "! Goed gezien. De loper valt nu zowel de witte dame aan als de toren op a1. Wit zal één van beiden moeten verliezen.",
        "6. Qg4 Bxa1": "De buit is binnen. Hierna sta jij in materiaal opzicht gewonnen. Dit houdt in dat als je verder zou kunnen afruilen naar een eindspel jij een winnend voordeel zou hebben. Op het moment zijn er echter nog veel stukken op het bord en is de positie van jouw koning een beetje verzwakt.\nMeer dan eens heb jij aangegeven moeite te hebben met het zien van schaakmat. Wat is schaakmat? Zoals jij weet kan een koning in tegenstelling tot andere stukken niet genomen worden. Zodra een koning wordt aangevallen, is de eigenaar van de koning verplicht ervoor te zorgen dat de koning niet meer wordt aangevallen aan het einde van zijn beurt. Schaakmat is de situatie wanneer een speler zijn koning niet meer uit de aanval te halen. \nVerdedigen tegen schaakmat houdt dus in dat jij ervoor zorgt dat de koning ofwel:\n- helemaal niet aangevallen kan worden\n- vluchtvelden heeft waar hij heen kan gaan als hij wordt aangevallen\n- stukken bij zich in de buurt heeft die een aanvaller kan nemen\n- stukken bij zich in de buurt heeft die zichzelf tussen de aanvaller en de koning kan plaatsen",
        "7. Bg5": "Wit ontwikkelt snel in de hoop dat hij een aanval tegen jouw koning kan organiseren. Dit is waarschijnlijk zijn beste zet of in ieder geval zijn beste hoop.",
        "7... f6": "? De diagonaal tussen h5 en e8 is erg gevaarlijk wanneer deze open is, omdat er geen stukken zijn die zich hier tussen kan plaatsen. Als wit dus over deze diagonaal aanvalt, moet de koning wel vluchten, want er is geen stuk die hem kan helpen. Een ander probleem is dat na deze zet de zwarte loper (a1) niet meer goed kan meehelpen met de verdediging. \nJe had jouw loper terug moeten halen naar f6.",
        "8. Qh5+": "Natuurlijk de juiste zet.",
        "8... Ke7": "! Op f8 zou de zwarte koning nog minder vluchtvelden hebben en zou Loper naar c4 waarschijnlijk dodelijk zijn geweest. ",
        "9. Bc4": "De loper geeft de witte dame ondersteuning bij het aanvallen van de koning. De dame dreigt nu binnen te komen op f7. De zwarte koning heeft dan maar één vluchtveld over en zal worden opgejaagd tot de mat erop volgt. Aangezien de koning zichzelf niet kan verdedigen moet zwart er snel voor zorgen dat zijn stukken de koning kan helpen met verdedigen.",
        "9... fxg5": "? Vermoedelijk de verliezende fout. Het was noodzakelijk om met dwang er stukken bij te halen die mee kunnen helpen met de verdediging.\nBeste en wellicht enigste zet was pion van d7 naar d5. Het valt de loper aan en onderbreekt de ondersteuning van deze loper zodat wit zijn dame niet naar f7 kan spelen. Na de pionzet zou wit de pion waarschijnlijk nemen met zijn loper waarna de dreiging (Dh5 - f7+) zich herhaalt. Echter, met de pion uit de weg kan jouw andere loper zich bij de verdediging gaan bemoeien (Loper c8 - e6), waarna zwart goede kansen moet hebben de aanval af te slaan.",
        "10. Qxg5+": "Dame naar f7 was de grootste dreiging, maar wit kan dat straks alsnog spelen.",
        "10... Ke8 11. Qh5+ Kf8": "? Hierna is het direct mat, maar ook na Koning e8-e7, Dame h5-f7+, Koning e7-d6 lijkt de zwarte koning moeilijk te verdedigen",
        "12. Qf7#": ""
    },
    "url": "https://gameknot.com/annotation.pl/3-kwetsbare-dames-en-koningen?gm=51185",
    "gameName": "3. Kwetsbare dames en koningen",
    "players": "supasi (1120) vs. sophia33 (864)",
    "opening": "Centre game (C21)"
}