{
    "moves": {
        "1. d4": "This was the second of two games played for the 31th GN Tournament. ",
        "1... Nf6": "Called the Indian Defense, prevents e4, planning to eventually attack the centre by indirect means",
        "2. c4 e6": "The Nimzo-Indian Defense, opens up the dark-squared Bishop, ready to counter the possible Nc3 with Bb4, pinning the Knight",
        "3. Nc3 Bb4": "I pin the Knight, planning to eventually capture, giving him doubled pawns on the c file if he lets me",
        "4. Qc2": "Which he doesn't. Now Bxc3 is met with Qxc3, avoiding doubled pawns",
        "4... c5": "A gambit move, He is forced to capture or cxd4, hanging the pinned knight. I don't actually plan on re-capturing the pawn with my Bishop, as I would lose the Knight pin. He will be left with doubled pawns that I can eventually recapture with a development lead.",
        "5. dxc5 O-O 6. a3": "Attempting to chase the Bishop away, removing the pin",
        "6... Bxc5": "I decide to capture, regaining the lost pawn and attacking f2, a weak pawn",
        "7. Nf3 b6": "Protects my Bishop and allows developement of the White Squared Bishop, for an attack on the pawn at c4 or Knight on f3",
        "8. Bg5 h6": "Chasing the Bishop away",
        "9. Bh4 Bb7 10. e4 Be7": "I didn't like making this move, but I needed to get rid of the pin",
        "11. Rd1": "Putting pressure on d7",
        "11... Nc6 12. Be2 Qb8": "Planning to advance my pawn to limit the Rooks strength",
        "13. O-O d6 14. Rd2 g5": "The center is under white's control, and I have little play on the Queenside, so I decide to go for a kingside pawn advance, maximizing the strength of my Bishop's while limiting the usefulness of his Rooks.",
        "15. Bg3 Nh5": "Planning to capture, weakening his king and pawn formation",
        "16. Rfd1": "Though his rooks are well placed, my lone Bishop is enough to hold them off, so I can begin to bring my queen into play ",
        "16... Nxg3 17. hxg3 g4": "Continuing my advance, while gaining a tempo forcing the knight to move",
        "18. Nh2 h5 19. Nf1": "planning Ne3",
        "19... a6": "In case he decided to advance his pawns on the queenside, making it harder for him to do so. This follows an important rule, if your opponent has little counterplay on the side your attacking, make sure he can't advance on another side before continuing your attack.",
        "20. Ne3 Ne5": "Freeing the Bishop and placing the knight in a solid position, ready to advance further",
        "21. f4": "an odd move, as this fails to chase my Knight away and further weakens his king's defense",
        "21... gxf3 e.p. 22. gxf3": "While both are kings are vulnerable, he has no way to attack my King, while both my Bishops, my Queen, and my f8 Rook can be used.",
        "22... Qc7": "Targeting c4 and bringing my Queen into play",
        "23. Kg2": "To free the Bishop from it's defense of f3",
        "23... h4": "Opening up the g file, right in front of his king",
        "24. gxh4 Qc5": "Continuing to bring my Queen to the kingside, while limiting his options. If Bxh4, then Rxd6, giving him a firm hold of the centre",
        "25. Rd2d4 Ng6": "Attacking the pawn and giving my queen a path to the Kingside",
        "26. Na4 Qe5": "I am willing to give up the pawn to continue my attack the the king",
        "27. Ng4": "closing the g file and attacking my Queen",
        "27... Qh8": "So my Queen can capture on h4, putting his king under tremendous pressure",
        "28. Nxb6": "If I move my Rook, then he will be able to slow my attack, since it has no bearing on my plan, I am willing to let him have it",
        "28... Nf4+ 29. Kf2 Qxh4+ 30. Ke3 Bg5 31. Nxa8": "Too greedy, he should be worrying about his king now",
        "31... e5 32. Rd4d2 f5": "Trying to bring my Rook into play",
        "33. c5 fxe4 34. fxe4 Qg3+ 35. Bf3 Ne2+": "if Kxe2, then Qxf3 , followed by a quick mate",
        "36. Kd3 Bxe4+": "A similar situation occurs if Kxe4. Since he can't capture, his queen is left hanging",
        "37. Kc4 Bxc2 38. Bd5+": "To save the Bishop and slow me down",
        "38... Kg7 39. Rxc2": "if Rxe2, then Qxg4  wins the rook",
        "39... Rf4+ 40. Be4": "His only legal move, now Rxe4 gives the king one square to run to, d5",
        "40... Rxe4+ 41. Kd5 Qxg4": "Threatening Nc3 , and limiting the kings escape points",
        "42. Kxd6 Rf4": "Going for the win",
        "43. c6": "trying to promote the pawn and get some counterplay. The pawn never gets another chance to move",
        "43... Qc8 44. Nb6": "If Qd8 , then Nd7 saves the Rook. I am not after the Rook however.",
        "44... Rf6+ 45. Kd5 Qe6+ 46. Ke4 Ng3+": "He resigned. After Kd3(his only legal move) Rf3# The most important thing to learn from this game is to figure out which side of the board you have the most control over and focus on that side, preventing your opponent from making counterplay in the meantime."
    },
    "url": "https://gameknot.com/annotation.pl/31st-gk-tournament?gm=160",
    "gameName": "31st GK tournament",
    "players": "patagon (1860) vs. osiris_007 (1733)",
    "opening": "Nimzo-Indian (E39), classical, Pirc variation"
}