{
    "moves": {
        "1. e4": "1.e4 \"best by test\" bobby fischer.",
        "1... Nc6 2. d4": "a central thrust.",
        "2... e5": "counter attack.",
        "3. d5": "gains space at the cost of leaving weak squares in its path. The game is already set for me to try to use my space advantage to its fullest.",
        "3... Na5": "a knight on the rim is grim.",
        "4. Nf3": "striking at e5",
        "4... f6": "? be very careful when moving this f pawn. the diagonal to the king is now weak.",
        "5. Nxe5": "this knight sacrifice is justified.",
        "5... fxe5 6. Qh5+ g6 7. Qxe5+": "double attack!!!! only possible due to my space advantage. not possible if the knight were still on c6.",
        "7... Qe7 8. Qxh8 Qxe4+ 9. Be3 Qxc2 10. Nd2 Nf6": "??",
        "11. Qxf6 Be7 12. Qh8+ Bf8 13. Bh6": "threatening mate on f8",
        "13... Qf5": "5 points up,  I am more than willing to trade down to a winning endgame.",
        "14. Qxf8+ Qxf8 15. Bxf8 Kxf8 16. b4": "Oh no! the knight is dominated!",
        "16... Nc6": "I would have left the knight and let white double rook pawns.",
        "17. dxc6 dxc6 18. Bc4 Bf5 19. O-O-O": "why push my king away on g1 when the queens are gone, and I am in a trading mood. this keeps the king somewhat central and brings the rook to the center open file.",
        "19... Rd8 20. Rhe1 Re8": "just playing into my game. for black I think his only chance was to push that queenside majority while backing the push with his remaining rook and bishop.",
        "21. Rxe8+ Kxe8 22. Nf3 Be4": "??",
        "23. Re1 b5 24. Rxe4+ Kd8 25. Bg8 Kd7 26. Bxh7 Kd6 27. Bxg6 c5": "only now is the majority used. too little too late.",
        "28. bxc5+ Kxc5 29. h4 b4 30. h5 a5 31. Be8 c6 32. Nd2 Kb5 33. h6 Ka4 34. Bxc6+ Ka3 35. Nc4+ Kxa2 36. Nxa5 Ka3 37. h7 b3 38. Nxb3 Kxb3 39. Rd4 Kc3 40. Re4 Kd3 41. Kd1 Kc3 42. Ke2 Kb3 43. Kd2": ""
    },
    "url": "https://gameknot.com/annotation.pl/33rd-gk-tournament?gm=3372",
    "gameName": "33rd GK tournament",
    "players": "jeffegg2 (1389) vs. sirroyston (1209)",
    "opening": "KP (B00), Nimzovich defence"
}