{
    "moves": {
        "1. e4": "A good move to start the game. White plants a pawn in the centre whilst giving squares to both his Bishop and his Queen. Definitely one of the best possible moves at the start of the game...so good that the great man Robert J. Fischer gave it an exclamation mark!",
        "1... c5": "Of the many options open to him, Black chooses to play the Sicilian Defence - Which leads to some of the most common positions seen on a chess board. In choosing the Sicilian Defence, Black is attempting to go into a highly theoretical game.",
        "2. Bc4": "White chooses to play a closed Sicilian in an attempt to avoid some heavy theoretical lines.",
        "2... e6": "e6 is a strong move here as stops potential attacks on f7 and starts to open up some space for black to develop.",
        "3. Nc3": "Nc3 - White's aim is clear here - to develop his pieces in an ordinary fashion and to try to gain an advantage from his position.",
        "3... Nc6": "Nc6 is a strong reply to Nc3 as it is striking out at two of the main 4 central squares.",
        "4. Nf3": "White again develops his pieces.",
        "4... Nf6": "One's first impression of this position is a very dull one - but one can be easily mistaken... There are many tactical complications that can arise here with lines including d4 at some point.",
        "5. d3": "perhaps d3 is a bit passive, a more aggresive moves such as d4 might have given White more chances of gaining an advantage. There is nothing wrong with d3 however as it allows White to continue his development without any un-necessary tactical complications.",
        "5... d5": "d5!? Black immediately challenges the centre.",
        "6. exd5": "There aren't many other alternatives to exchanging here - going into alternative lines would give Black more of an advantage.\r\n",
        "6... exd5": "Black is prepared to exchange pieces here in an attempt to open up the position.",
        "7. Qe2+": "A pointless and passive check, giving Black a free tempo with Be7.",
        "7... Be7": "Black makes use of his free tempo.",
        "8. Bb5": "Bb5!? White is starting to go off on a tangent here...a move such as Bb5 does nothing to improve his position.",
        "8... O-O": "Black chooses to castle...now Black has sustained quite a strong position.",
        "9. Bxc6": "White's Bishop has moved 3 times to take a Knight which has only moved once...dubious play from White...it is generally considered best to not swap if it does NOT give you any advantages from the swap(as is the case here).",
        "9... bxc6": "Black takes...obviously. The doubled pawns are generally seen as a weakness but in some instances they can be very strong!",
        "10. Bf4": "For the first time in 3 moves White decides to make a reasonable move; developing the Bishop to f4 gives White some spacial advantages.",
        "10... Re8": "Black's threat of a discovered attack is obvious. Now we see that Qe2 is rather dubious as it can come under pressure and cost White some valuable time at a later stage (The resultant position from this game is conclusive evidence).",
        "11. O-O": "White castles dubiously!? Bd6!!",
        "11... Bd6": "!! Now black is clearly winning... White has let himself get into lots of trouble. Now we see why the Qe2 move was very poor...never make un-necessary checks that don't do anything and can potentially cause you major problems at a later stage.",
        "12. Qd2": "Surprisingly White's only move!",
        "12... Bg4": "Black is starting to command the game now - White's king-side is coming under immediate pressure.",
        "13. Nh4": "White's pieces are starting to become immobile...the h4 Knight is not doing anything! Now you know the reason for the phrase: \"A KNIGHT ON THE RIM IS DIM\"",
        "13... d4": "Black forces White's other Knight onto a bad square.",
        "14. Nd1": "You can see how much of an advantage Black now has...mainly because of the passive move of Qe2?? Qe2 has cost White dearly here; losing him time and space and eventually the game.",
        "14... Re2": "Black has now managed to develop into a totally won position...not from amazing play but because White made one silly error and allowed Black to capitalize on this.",
        "15. Qc1": "Just look at how bad White's position is now. Once more I shall emphasize how much Qe2 has cost White in this game! I urge you, if you are a beginner to look at why Qe2 is bad and to learn not to make un-necessary and passive checks such as this. When a beginner sees a check, his automatic reaction is to check! Checking doesn't necessarily do anything!!! This is a very important rule.",
        "15... Bxf4": "Black can afford to trade off pieces here in order to win a few pawns.",
        "16. Qxf4": "The Queen literally HAS to take.",
        "16... Rxc2": "Black snaps up the pawn.",
        "17. f3": "f3 is a feeble attempt to drive off the g5 Bishop as it opens up White's King furthermore.",
        "17... Be6": "Black retreats the Bishop gladly into a good,strong square.",
        "18. Rf2": "Is White trying to lose this game!? Rf2 allows Black to swap off pieces.",
        "18... Rxf2": "Black gladly exchanges the Rook.",
        "19. Nxf2": "To be fair to White though, his Knight has now become more active after the exchange.",
        "19... Nd5": "Black immediately siezes the oppurtunity to go on the attack.",
        "20. Qe4": "White's Queen moves once again! Note how many Queen moves White has made in this game! Most of these moves would have been un-required had White not foolishly chosen to play Qe2 ",
        "20... Rb8": "Black once more goes on the Pawn hunt.",
        "21. Rb1": "Rb1!! OUCH!",
        "21... Nc3": "Nc3!! 0-1 White ought to resign now.\r\n\r\nImportant Points to be learnt from this game:\r\n\r\n1.Do not jump to hasty checks which give your opponent free time and can cause you problems at a later stage.\r\n2.Always consider if checking so dubiously is good for you or if it is just a passive move and does not do anything to enhance/ improve your position.\r\n\r\nThanks, I hope you have enjoyed this game.\r\nAny comments are welcome."
    },
    "url": "https://gameknot.com/annotation.pl/33rd-gk-tournament?gm=3710",
    "gameName": "33rd GK tournament",
    "players": "cbas (1503) vs. goldaxe2006 (1695)",
    "opening": "Sicilian defence (B20)"
}