{
    "moves": {
        "1. e4": "My opponent opens with a normal move: e4.",
        "1... d5": "I have been trying the Scandinavian Defense in response to e4 lately, because it is emminently safe, and it forces my opponent to play \"on my turf.\" The downside is that it is rather unambitious and doesn't challenge white's opening initiative. At a strategic level, I am happy to trade a bunch of wood and head into an endgame even or with a small advantage. I have pretty good success in endgames, although I don't fancy myself as the next Rubenstein :)",
        "2. exd5": "The normal continuation.",
        "2... Qxd5": "And again, the main line.",
        "3. Nc3": "Developing with tempo against the queen.",
        "3... Qa5": "And here is the first choice I must make. Although it is perfectly acceptable to play the queen back to d8, I prefer the more aggressive a5 square.",
        "4. d4": "The main line, although Nf3 is playable. Also mentioned in MCO-13 (I never bothered to upgrade to 14) is 4. h3 Nf6 5. Nf3 e6 6. Bc4 without the pressure of lines that allow ...Bg4.",
        "4... Nf6": "The main line, although a game with Adolph Anderssen's 4...e5 is given in a footnote of MCO. White won in 29 moves.",
        "5. Bd2": "And here is the first variance from the main lines. Normal are Bc4 and Nf3, fighting for the center, but the text does suggest itself to the amateur, since it sets up a discovery against the queen.",
        "5... c6": "And so I must give my queen an escape square on c7, while at the same time limiting the scope of the c3-knight.",
        "6. Ne4": "And the \"trap\" springs, but to no bad effect for black.",
        "6... Qf5": "I have to eschew the c7 square in order to protect my kingside pawn structure.",
        "7. Nxf6+": "As I said in the opening, I am content to trade some pieces in the early going, and especially as his piece moved three times and took a piece that had only moved once.",
        "7... Qxf6": "The point of the queen going to f5 was to keep the pawns intact with this recapture.",
        "8. Nf3": "Continuing development with a normal move.",
        "8... Bg4": "And this is the normal square for the bishop in this opening.",
        "9. Be2": "White has chosen a very conservative development scheme, so I am pleased with the position, although I am slightly behind in development.",
        "9... Bxf3": "This wasn't an easy choice, as I like to keep the two bishops when I can, but it wasn't a hard choice either, as I get to trade more wood and his bishop is on a diagonal that is shut down by the c6-pawn. The fact that this removes the defender of the d4-pawn is good too :)",
        "10. Bxf3": "The expected recapture, although gxf3 followed by castling long did cross my mind as a possibility. I wonder if my opponent considered it?",
        "10... Qxd4": "Hard to believe the pawn is just hanging, but it is. I am glad to win a pawn, as that is usually enough to ensure a draw and give me winning chances in an endgame. I am behind in development, and my queen is exposed, so there is some danger in taking the pawn, but in the balance I thought it was safe enough.",
        "11. Bc3": "And now both his bishops have made it to the long diagonals. But the upside for me is that I get to trade queens!",
        "11... Qxd1+": "After this it will be imperative to finish development or I could face a nasty attack.",
        "12. Rxd1": "And of course he recaptures with a developing move. I really am walking a dangerously fine line here.",
        "12... Nd7": "Preparing to castle long, I am ready to play ...e6 to protect the h3-c8 diagonal and open up a line for my dark bishop to develop. I still have to figure out how to protect the g-pawn when the dark bishop leaves the back rank, but first things first.",
        "13. O-O": "Completing development, white can either play Rfe1 to pressure both central files, or double rooks on the d-file. Despite being a pawn down, white has a reasonable game. I wonder if he considered the d-pawn a gambit?",
        "13... O-O-O": "And I am trying to catch up my development as quickly as possible. If I can get caught up and force some trades, my extra pawn may start to tip the balance in my direction.",
        "14. Ba5": "Solving a problem for me. Now the g-pawn isn't attacked and the dark bishop can develop without trouble.",
        "14... Nb6": "This is a perfect situation for me. Trading a pair of rooks will get me closer to a pawn up endgame, while avoiding the rook trade cedes me the d-file. If he trades the bishop for knight, the recapture ...axb6 leaves my king a nice place on c7 to hide from white's light bishop. ",
        "15. Rxd8+": "I am happy to see the trade.",
        "15... Kxd8 16. Rd1+": "And white is quick to grab the open file with tempo against my king.",
        "16... Kc8": "Avoiding the pin that going to c7 would create. I suppose there would be ways to keep the pinned knight out of trouble later, but I think the easiest way is just to not get it pinned in the first place.",
        "17. Bg4+": "White must have a plan, and I assume this move fits into it somehow, but my first reaction was to think of Fischer's quote, \"Patzer sees check, patzer gives check.\"",
        "17... e6": "As mentioned before, this is the planned move to block that diagonal and release the dark bishop.",
        "18. b3": "Looks like white is preparing c4-c5 to attack the knight. Until I protect the d8 square, the knight is actually pinned as the only defense against Rd8#.",
        "18... Be7": "But now that d8 is protected, the knight is free to move and I have achieved a safe, pawn up position.",
        "19. Bc3": "Now that the pin is no longer a threat, the bishop attacks the weakness on g7.",
        "19... Bf6": "I am not thrilled to disrupt my pawn structure this way, but I had no other way to protect the g7-pawn.",
        "20. Bxf6": "I have mixed feelings about this. On the one hand, I am pleased to have more wood off the board as I am ahead in material. Also, this trade takes away the advantage of the two bishops that my opponent enjoyed. On the downside, the h-pawn becomes isolated and the f-pawns get doubled. This is not a good thing in an endgame. Chess is a game of trade-offs. Very rarely is a situation clearly good or bad. There are always points on each side of the equation, and the trick is to capitalize on the positives and try to diminsh the effects of the negative.",
        "20... gxf6": "With that in mind, I will try to get the rooks off and put all my pawns on dark squares. That will make my opponent's light squared bishop unable to attack my forces. Then I will use my knight to attack the dark squares that my opponent's bishop cannot defend.",
        "21. c4": "Not sure what white's plan is, but normally he would be trying to put his pawns on the opposite color from his bishop. That would allow his bishop maximum freedom of movement. By keeping his pawns on the light squares, white is restricting the movement of his own bishop.",
        "21... Rd8": "I am looking to get the rooks off, as that will give me control of the dark squares.",
        "22. Rxd8+": "And my opponent obliges.",
        "22... Kxd8 23. Bh5": "Attacking the weakness of my less-than-stellar pawn structure.",
        "23... Ke7": "But I have just enough resources to keep everything protected.",
        "24. Bf3": "Not sure what this is for, but the bishop wasn't doing anything on h5 anymore either.",
        "24... Nd7": "Getting out of the way so I can put pawns on b6 and c5. This will take some time, as the c-pawn will need protection before the b-pawn can go to b6.",
        "25. b4": "Is he going to create a pawn chain on dark squares with a3, b4, and c5? If so, it will be hard to defend, as my king is more centrally located than his. That is a big advantage in the endgame.",
        "25... Ne5": "This is a many-faceted move. By attacking both the bishop and the c-pawn I practically force him to play Be2. But the real point of this move is to protect the c-pawn so the b-pawn can move.",
        "26. Be2": "Practically forced, as c5 allows me to wreck white's pawn structure with Nxf3. But would I have really given up my knight for his bishop? No, I wouldn't have. 26. c5 would have been met by ...b6.",
        "26... b6": "And now I get it in anyway.",
        "27. a4": "Gaining space, but to what effect? As these pawns get further up the board, they get harder for the white king to protect, should the bishop get traded off, or the pawns get on dark squares.",
        "27... f5": "This is necessary so the rear f-pawn can go to the dark square f6. The long term plan is to have kingside pawns on h6, f6, e5, and f4.",
        "28. f4": "And there goes THAT plan :)\r\nBut as I said, chess is a game of trade-offs, and this move not only presents me with a difficulty (fixing my pawns on light squares), but with an opportunity as well (his f-pawn is fixed on a dark square). Which factor will be more important? It is up to the creativity of the players.",
        "28... Ng4": "Hoping to induce 29. Bxg4 fxg4, undoubling my pawns.",
        "29. h3": "But he doesn't fall for it.",
        "29... Nf6": "The knight will not stay here long, as this square is reserved for the f7-pawn. I will need to decide whether to put the knight on d7 or e4.",
        "30. Bf3": "Attacking the weak c-pawn.",
        "30... Kd6": "Protecting the pawn is not required, as ...c5 will accomplish the goal of getting all the queenside pawns on dark squares, but I wanted to keep as many pawns on the board as possible. More white pawns means more targets :)",
        "31. g4": "And now white, as he did earlier, solves a problem for me by allowing me to undouble the f-pawns.",
        "31... fxg4 32. hxg4": "Avoiding leaving his pawns isolated.",
        "32... h6": "And this pawn gets to his intended destination. As a side benefit, this pawn prevents g5, as the exchange on that square would leave my e-pawn passed.",
        "33. f5": "I flirted with the idea of pushing past and creating a passer right now, but decided that trading was better in the long run. With the trade, the h-pawn becomes passed.",
        "33... exf5 34. gxf5 Nd7": "And with the e4 square no longer available, it is pretty easy to see the knight has to go to d7. Now I am very close to achieving the goal of getting all my pawns on dark squares, after which my king can start to hunt targets.",
        "35. Bh5": "Blockading the passed h-pawn and attacking the undefended f-pawn, but I was planning to move it next anyway.",
        "35... f6": "The kingside pawns are safe, my king has an entry square at e5 to invade the enemy position, and the queenside pawns are very close to being set up also. I am feeling very confident about my chances for the full point.",
        "36. Kg2": "And he finally brings his king toward the center, but it is too little, too late.",
        "36... c5": "If he takes on c5, I will recapture with the knight to menace the a-pawn.",
        "37. b5": "But he decides to push and lock the pawns up. That is fine with me too.",
        "37... Ke5": "And my king goes hunting undefended targets.",
        "38. Bg6": "Losing the f-pawn is unacceptable for white.",
        "38... Kd4": "Another undefended target.",
        "39. Bf7": "White tries to hold the position together.",
        "39... Ne5": "But this move decides the game, as it wins white's c-pawn, which creates a passed c-pawn for black.",
        "40. Bg8": "Getting out of the way of the knight while maintaining protection of the c-pawn.",
        "40... Nxc4": "Winning the c-pawn, and the game.",
        "41. Bxc4": "Whether white takes the knight or not, the game is decided.",
        "41... Kxc4 42. Kg3": "The white king can't stop both the passed h- and c-pawns.",
        "42... Kd5": "Getting out of the way of the passer, and preparing to go to e5 if necessary to protect the f6-pawn.",
        "43. Kh4": "Blockading the h-pawn, but getting out of the \"square of the pawn\" that would allow the white king to stop the c-pawn.",
        "43... c4": "As Bobby Fischer said, \"Passed pawns must be pushed.\"",
        "44. Kh5": "Another trade-off: the h-pawn is expendable if it allows the c-pawn to promote.",
        "44... c3 45. Kg6": "One last gasp, but it is hopeless. Even if I allowed him to win both the h- and f-pawns, I could simply trade my queen for his f-pawn and my king would still pick off his a- and b-pawns for the win.",
        "45... Ke5": "But this solidifies the blockade of his f-pawn and he finally relents. 0-1"
    },
    "url": "https://gameknot.com/annotation.pl/33rd-gk-tournament?gm=8177",
    "gameName": "33rd GK tournament",
    "players": "julianhemsi (1337) vs. markpinkston (1252)",
    "opening": "Scandinavian defence, Lasker variation (B01)"
}