{
    "moves": {
        "1. d4": "black plays a very provocative opening which allows white to set up a large central pawn mass, it is debatable whether white is overextended or not. what follows is a soup of tactics, white misses an oportunity to win a piece which gives black an advantage. white immediatly sacrifices the exchange for the initiative which can be all important in crazy tactical positions; The gamble almost pays off but white buckles at the critical moment, missing the winning continuation. Whites attack keeps going but is missing the power it had, black defends well then counter attacks and quickly mates as the white attack runs out of steam. i hope you enjoy",
        "1... Nf6 2. c4 e5": "the budapest defence, white does better to immediately return the pawn and play for a solid positional edge rather than try to hold the pawn when black should be more than compensated",
        "3. dxe5 Ng4": "3...Ne4?! is not so good after 4.a3! preventing Bb4 ",
        "4. e4": "white has no interest in holding onto the pawn, prefering to gain a large centre.",
        "4... Nxe5 5. f4": "the logical continuation of white 4th move, white will try to prove the central pawns are a strength while black will argue that they are in fact a weakness that will need to be heavily defended. black will go about this by the method pioneered by Aron Nimzowitsch, Restrain Blockade Destroy!",
        "5... Ng6 6. Nf3 Bc5": "black hits the weakened d4 square",
        "7. Nc3 d6 8. Bd3 O-O": "black removes his king from the centre getting ready to start operations in the centre",
        "9. Qc2": "white develops so as to support his pawns",
        "9... Nc6": "again hitting the weak central dark squares",
        "10. Nd5 Nb4": "10...Nh4 is strong here as it aims to exchange the white knight on f3 which is much stronger than the black one on g6. ",
        "11. Nxb4": "white can't allow black to trade off the light square bishop as it is a key piece in holding together the white pawn centre",
        "11... Bxb4+ 12. Bd2 Bc5": "Black prefers to keep the dark square bishops on the board as this emphasises the dark square weaknesses",
        "13. O-O-O": "!? interesting idea, white wants to castle on opposite wings and use his more advanced pawns to help launch a kingside attack",
        "13... Bd7": "? weak move. now white has an advantage as he can force my pieces into bad positions",
        "14. b4 Bb6": "?? terrible blunder, i thought i saw a miracle save which made 15.c5 bad but i overlooked something... black has to try 14...Bf2 15.Rhf1 Bh4 when white has an advantage due to blacks badly placed pieces and thus should try to open up the position with 16.e5",
        "15. c5 dxc5 16. bxc5 Rc8": "preventing 17.cxb6 and 17...cxb6 pins the queen, therefore the king has to move",
        "17. Kb1": "?? Kb2, the move i overlooked, wins, this however loses. the point being that when the black queen takes the d3 bishop if the king is on b2 it isn't with check.",
        "17... Ba4": "! the miracle save mentioned earlier",
        "18. Qc4": "? a dubious sacrifice at best, white should settle for 18.Qxa4 Qxd3  19.Kb2 Bxc5 when black is up a pawn but white is more active",
        "18... Bxd1 19. Rxd1": "the only try for any sort of advantage",
        "19... Bxc5": "finally saving the bishop. if black can now tie up all the loose ends it will surely be an easy win from there on in",
        "20. f5": "white aims for a kingside attack as compensation for the exchange, will it be enough?",
        "20... Ne7 21. Bg5": "?! 21.f6 with Bh6 to follow seems to be a better try. The computer suggests that the quiet Bc2 is the best move for white here but it's not exactly the most natural maneuver, especially when down the exchange and a pawn.",
        "21... Bb6": "?? yet again Bb6 turns out to be an awful move. Qd6 was the correct way to secure the black bishop, now white gets a huge attack",
        "22. f6": "! good move, cracking open the black king",
        "22... gxf6 23. Bxf6 Qd7": "all white needs to do is get his queen to the kingside and black is in serious trouble",
        "24. Bc2": "?? this allows black to save the game. 24.Qc1!! was very strong, black must give up the e7 knight with 24...Qg5 or else face a huge attack",
        "24... Qc6": "! this elastic band move holds onto the extra material and consolidates the black postion",
        "25. Qb4": "?? black naturally tries to avoid trading queens but there is no good way to do it",
        "25... Qxf6": "gobbling up the free piece",
        "26. e5 Nc6": "?? yet another blunder in this game of blunders, this allows white to regain the lost rook and be down only a pawn",
        "27. Qg4+": "?? and again white misses the best continuation, it appears both sides are trying their hardest to lose! 27.Qxf8  was the correct move",
        "27... Qg7": "from here on in niether side makes any glaring cock ups and black duely converts his winning advantage",
        "28. Ng5 Nxe5 29. Qf5 Ng6": "29.Nc4! was better, you must mix counterattack with defence in the right quantities, here was an opportunity to counter",
        "30. h4 Nxh4 31. Qd3": "White needs to keep the queens on to have any chances",
        "31... Ng6 32. Rh1 Rcd8 33. Qf5 h6 34. Ne4 Qe5": "black now starts to try and force the queens off",
        "35. Nf6+ Kg7 36. Nh5+ Kh8 37. Qf1": "white has suceeded in keeping the queens on the board but now it is black who is attacking!",
        "37... Rd2 38. g3 Qc3": "the black pieces move in for the kill",
        "39. Qf5 Bd4": "its amazing how quickly things can change",
        "40. Kc1 Rd8 41. Nf4": "not 41.Qxf7?? Qxc2# but black can force mate whatever white plays here, so i suppose it doesn't really matter.",
        "41... Qa3+ 42. Kxd2 Qe3+ 43. Kd1": "and white resigns, 43....Bc3  44.Qd3 Rxd3  with 45....Qd2# to follow is the finish"
    },
    "url": "https://gameknot.com/annotation.pl/34th-gk-tournament?gm=4419",
    "gameName": "34th GK tournament",
    "players": "saccopterigio (1753) vs. kingstuart (1631)",
    "opening": "Budapest (A52), Alekhine, Abonyi variation"
}