{
    "moves": {
        "1. e4 e5 2. f4": "King's gambit, which I was unhappy to see with the black pieces.  As many of you know, playing defense is usually much more difficult than attacking...",
        "2... Bc5": "So I decline the gambit.  White doesn't dare play fxe5 now, as Qh4  wins for black.",
        "3. Nf3 d6 4. Bc4 Nc6 5. d3 Nf6 6. Nc3 Bg4": "All standard developing moves for both sides so far -- this is a standard KGD position.  My move here as black is aimed at getting that knight off the board, as it controls too much of the center here.",
        "7. h3": "More usual is Na4, eliminating the dangerous dark-square bishop, but h3 is quite playable.",
        "7... Bxf3 8. Qxf3": "A much better recapture than gxf3 positionally, but black has a nice move here...",
        "8... Nd4": "This is standard, so I can't give myself an exclam, but it hits the queen and threatens a nasty fork on c2; hence white is basically forced to retreat the queen to d1, (although he could accept the fork and attempt a counterattack with Qg3, I think that winning a pawn and some activity for the exchange isn't worth it).",
        "9. Qd1 Nd7": "This was the best move I could find in the position, threatening Qh4  and a strong attack.  This is all still stuff that's in the GK game DB, though -- nothing new yet.",
        "10. Na4": "?  Until now.  I had expected Ne2, so that Qh4  could be met with g3!  In principle, it's desirable to eliminate the dark-squared bishop, but Qh4  is very strong for black, and he simply doesn't have the time for this.",
        "10... Qh4+": "A good move -- this is why I expected Ne2.  Now, white has only three legal moves, g3 (which leads to Qxg3  and a worse situation), Kf1, which leads to all sorts of kingside mating threats and a definite loss of material after 11. Kf1 Nf5 (threatening mate with Qf2) 12. Nxc5 Ng3 , or Kd2, as played in the game.",
        "11. Kd2": "This seems like the best attempt, but it turns out to walk into mate...",
        "11... Bb4+": "!  White resigns.  Although White probably sees only 12. c3 (or Nc3) Qf2  13. Qe2 Qxe2#, there is a sprightly forced mate after 12. Ke3, which I was excited to find when I played Bb4 .  It goes 12. Ke3 Qg3  13. Qf3 exf4  14. Kxd4 c5  15. Nxc5 (or 15. Kd5 Qg5  16. Kxd6 Qe5#) dxc5  16. Kd5 Qg5  17. Kd6 Qe5#\n\nI was disappointed that my opponent didn't give me a chance to play my (I thought quite beautiful) mating combination, but it's still a wonderful demonstration how sometimes all it takes is one bad move out of the opening book to totally cook your goose!"
    },
    "url": "https://gameknot.com/annotation.pl/34th-gk-tournament?gm=4878",
    "gameName": "34th GK tournament",
    "players": "altlauf (1550) vs. ethansiegel (1830)",
    "opening": "KGD (C30), classical, Svenonius variation"
}