{
    "moves": {
        "1. e4": "My intention is to only annotate those moves and positions where a question may arise.  Al",
        "1... e5 2. Nf3 Nc6 3. Bc4 Nf6": "The Two Knights Defense.  This is a favorite of mine.  I believe that it gives Black an early opportunity to seize the initiative.  Al",
        "4. Ng5": "This is a decisive point for White.  He can play to gain a pawn by 4. Ng5, or he can play to hold the initiative with 4. e4.   Both moves are good, but the initiative is my first goal in any game.  Al",
        "4... d5 5. exd5 Na5": "Black drives the bishop from the a2-g8 diagonal.",
        "6. Bb5+ c6": "6. Bd7 is also good.\n",
        "7. dxc6 bxc6 8. Qf3 Rb8": "The pawn can be protected by Qc7 or Bd7; or a counter-attack can be made by h6.  I believe the White knight will return to f3 without disrupting the kingside pawns, and that the initiative is more likely to come to Black by getting the rook onto an open file. \n",
        "9. Bxc6+ Nxc6 10. Qxc6+ Nd7 11. d3 Be7": "The initiative has passed to Black, at a cost of two pawns.",
        "12. Nf3 O-O": "The White knight moves and the quest for a pawn have resulted in a position where white has succeeded in gaining two pawns; but at a terrible price:  All of Black's pieces are mobilized, White has four pieces still requiring development and has the White queen afield.  ",
        "13. Nc3": "Not a good move.  It develops the knight to it's natural square but allows it to be pinned, and neglects the Queen, which can come under attack by four pieces.  Withdrawing the Queen may be prudent.",
        "13... Rb4": "This allows Bb7 without blocking the rook.  At this post, the rook takes away three escape squares from the White queen, and holds the b-file.   ",
        "14. Nd5 Bb7 15. Nxe7+ Qxe7 16. Qc3": "The Queen retreats to the only available square.  The queenhunt will position Blacks' pieces for an assault on the White King.  ",
        "16... Rc8 17. Qd2": "There is no choice, the c1 bishop is blocked, locking in the a1 rook.",
        "17... e4": "Black plays to open the board for the attack.  ",
        "18. Qe2 Rxc2 19. Qe3": "Obviously, White cannot take the invading rook, but the e5 pawn remains pinned.  ",
        "19... Nf6": "Black protects the pawn a fourth time, and positions the knight to attack the black queen.",
        "20. Nd2 Nd5 21. Qxe4": "Strange as it seems, the Queen must give herself up. There is no better move.  With five marauding pieces, a protected king, and the attacking e-pawn, Black had a won game.",
        "21... Rxe4+ 22. Nxe4 Nb4": "The start of the final assault.",
        "23. O-O": "White begins his development, much too late.",
        "23... Nxd3": ""
    },
    "url": "https://gameknot.com/annotation.pl/35th-gk-tournament?gm=10604",
    "gameName": "35th GK tournament",
    "players": "avsf (1796) vs. alfredjwood (2131)",
    "opening": "two knights defence (C58), Colman variation"
}