{
    "moves": {
        "1. e4": "This is one of the more interesting games I have played here at Gameknot.  It starts from a quiet, double-king pawn opening and becomes a double-edged game with attacking possibilities for both sides.  Most of the action is created when we castle on opposite sides, leading to a bit of a race to the king.  Enjoy!",
        "1... e5 2. Nf3 Nc6 3. Nc3": "I play a variation of the four knights game with the bishop on g2.  I've had a lot of success with it here.",
        "3... Bc5 4. g3": "The typical move for white here is Nxe5, leading to Nxe5 and d4.  I've played that variation before, but I like moving the bishop to g2 better.",
        "4... Nf6": "Moving into the four knights game.",
        "5. Bg2": "The bishop on g2 seems to be hampered by my e-pawn, but later in the game, when the center opens up, the bishop could be very powerful.  Whatever disadvantage comes from the bishop's lack of mobility early is made up for later.",
        "5... d6 6. d3 h6": "I like a6 better for black here.",
        "7. O-O": "I missed Na4 here, winning bishop for knight.",
        "7... Bg4": "This pin could be uncomfortable, but it allows me to get my king to h2, which is where I want it.",
        "8. h3 Bxf3": "Be6 followed by Qd2 is a more typical response.",
        "9. Qxf3 Nd4": "I should have taken care of the pesky c5 bishop when I had the chance.",
        "10. Qd1 Qd7": "Not having his light-square bishop makes this move less powerful.",
        "11. Kh2": "The king is very safe here.  h3 is defended twice as is g3.  My g pawn will be weakened later, however.",
        "11... O-O-O": "This to me is a crucial move.  With the kings on opposite sides, the potential for full-scale onslaughts on both sides of the board emerges.  This game turns into a race; however, with my development, I'm ahead already.  Also, notice that my g2 bishop is potentially a very good piece if I can open the center.",
        "12. Be3": "The d4 knight and c5 bishop (that shouldn't still be on the board!) are black's two most active pieces.  I'm looking to trade them off and maybe crack open the center.",
        "12... a6": "I attack this pawn later.  It's probably stronger on a7 now.",
        "13. Ne2 Nxe2 14. Qxe2 Bxe3 15. fxe3": "My opponent did the trading, and I was happy to oblige. ",
        "15... Qb5 16. Rfb1": "Defending my b-pawn, and preparing a pawn storm on the queen side.",
        "16... g5": "My opponent here seems to want to storm the pawns as well; however, his queen is out of position to assist in the attack, and my attack will come too quickly.",
        "17. a4": "Beginning the attack with a gain of time.",
        "17... Qd7 18. b4": "Preparing b5.",
        "18... h5": "Here, I took a lot of time making sure that I could lock down his pawns.  If he plays h4, g4 locks him out, and if he plays g4, h4 locks him out.",
        "19. b5": "a5 for him here doesn't work because I can still advance to b6 and break open his position.",
        "19... axb5 20. axb5": "Threatening Ra8#.",
        "20... b6": "Forced.  He needs to make room.  Space becomes black's biggest problem during this attack.",
        "21. d4": "Allowing my queen into the attack and possibly opening up the center for my bishop.",
        "21... Qe6": "Trying to make room.",
        "22. d5": "Again, I'm pushing forward with tempo.  This move did lock in my bishop, but I felt that my rooks and queen would be enough.",
        "22... Qe7": "I believe that my opponent moved here to try and bring his knight back into the defense; however, this move is probably the worst blunder of the game.  Better is Qd7 followed by Rdg8, trying to spring the king.  With this move, however, my attack is able to come full force.",
        "23. Qc4": "Bringing the queen in...if he'll allow me, my plan is Qc6 and Ra8#.  At this point, I was trying to envision a number of different mates.  I knew that my position was really good, and I spent lots of time working on different mating combinations.",
        "23... Nd7": "Chessmaster has a forced mate in 6 right here: 24. Qc6 h4 25. Ra7 hxg3  26. Kxg3 Nb8 27. Qb7  Kd7 28. Qxc7  Ke8 29. Qxe7#\n\nI didn't see it, and for it to have played out in the real game, I would have had to sac my queen, which I wasn't confident enough to do.  How I finished it off was interesting as well, however.",
        "24. Qc6": "The queen is just brutal on this square.  His king needs to retreat to d8 and e7, but those squares are occupied. ",
        "24... Nb8": "Here's where I missed the forced mate.  Ra7 here wins the game.  After Nxc6, the king can't get out fast enough to escape from my rooks.  I didn't even consider Ra7 during the game.  I had planned to play Ra8 and Rb1 to finish him off.  There really isn't a way for him to escape here, so me missing mate wasn't too crucial.",
        "25. Ra8": "Preparing Ra1 and Ra7.",
        "25... Qd7": "For some reason, I still thought that I need my queen to finish the game off, so I declined the trade here.  ",
        "26. Qc4": "Ra1 or Bf1 are both far better moves here.  This is by far my worst move of the game.",
        "26... Qe7": "My opponent bails me out here.  Qe8 allows his king to escape to d7 and e7.  I think he had hopes of a draw here, but I quickly saw my mistake and put my queen back where she needed to be.",
        "27. Qc6": "This was an interesting psychological moment since the position repeated.  I think my opponent was hoping for a draw by three-fold repetition, but I figured it out at this point.",
        "27... Qd7 28. Bf1": "Preparing 28. ... Qxc6 29. bxc6 after which, I'm threatening mate with Ba6.  There's no way out.  I'll either mate him with the bishop or with my rooks.  Truth be told, Ra1 is still a better move here.",
        "28... Rdf8": "Loses the queen and leads to mate shortly after.  I think the pressure of defending finally got to him.  Qxc6 is the only acceptable move here.",
        "29. Rxb8+": "Forced to take the rook and lose the queen, and he still has mate problems.  The game was definitely over at this point.  Black resigns.\n\nThis was a fun game to play and to analyze.  I hope you enjoyed sharing it with me."
    },
    "url": "https://gameknot.com/annotation.pl/36th-gk-tournament?gm=15118",
    "gameName": "36th GK tournament",
    "players": "wingetj (1538) vs. nb68 (1594)",
    "opening": "Three knights game (C46)"
}