{
    "moves": {
        "1. e4": "This is my second game versus patak in the first round of the Advanced section of the 36th GK tournament. Unlike my other game, here I take full advantage of my opponent's toothless aggression (apologies to Chris Benoit) and lack of tactical anticipation. ",
        "1... e5 2. f4 d6": "As I will discuss in other annotations, this is not the best way to reply to 2 f4. Best is just to take the pawn. Or if you want to decline, do so with with 2... Bc5, or the counter gambit, 2 ... d5. ",
        "3. Nf3 Nf6 4. Nc3": "Defending my pawn and bringing the \"lazy knight\" into play. In the open game (i.e. 1 e4 e5) the activity of the queen's knight is often critical to a White victory. However, it is very easy to overlook its development in the midst of all the exciting kingside play common to open games, especially the King's Gambit.\n\n4 d3 is not desirable because I do not want to hem my king's bishop in. ",
        "4... Nc6": "4 ... Nc6?! Black should be developing his kingside rather than his queenside. 4 ... Be7 is correct here. Or, if he REALLY feels the need to develop his queenside first, 4... Bg4 would be preferable. He may be intending to castle queenside but frankly this strategy is just too slow. Altertnatively, taking the gambit pawn on f4 late is fine, leading to a Fischer Defense by transposition. ",
        "5. Bc4": "Aggressively targeting f7. ",
        "5... Bg4": "This pin is common in the King's Gambit, but usually nothing to be worried about. In fact, if Black takes on f3, though this takes away an important kingside attacker, it gives me a very strong position on the open f-file. And opening an attack down the open f-file onto f7 is exactly one of the points of my second move! ",
        "6. O-O": "As I said, the pin is nothing to be worried about. I patiently continue my development by castling. ",
        "6... Qd7": "6 ...Qd6?! Again Black neglects healthy development. This move accomplishes little; the better way to defend f7 is by castling!! ",
        "7. a3": "I am not sure that this is a good move, but it's prophylactic and I wanted somewhere to retreat my bishop in the event of ...Na5. But since Black isn't putting any pressure on me, I can afford to be a little slack. ",
        "7... Bh3": "7 ...Bxh3? Bluntly put, this move is just silly. \n\nBlack wastes yet ANOTHER move on... on... pointlessness! Ok, I see his point, but if he'd even ANALYSED the position at all he'd realise that his \"aggression\" has no bite. ",
        "8. Bxf7+": "8 f5 could get the job done, too -- but way too slowly. The text gets straight to the point and exploits Black's mistakes (the weakness of f7 and his silly 7th move) all at once.",
        "8... Kxf7": "All said and done, capturing with the queen would have been the lesser of two evils. Black just wastes tempi AND loses the right to castle. ",
        "9. Ng5+": "Boom! And the tactical combo is complete... ",
        "9... Ke8": "I think retreating away from the centre to g8 is to be preferred here. ",
        "10. Nxh3 Nd4": "10 ...Nd4? Black wastes yet another move when he is already down materially and positionally. He needs to get that bishop out! ",
        "11. d3": "Activating my last minor piece. ",
        "11... Be7": "Finally, Black develops his king's bishop!! But it is much too late to matter. ",
        "12. fxe5": "Against flakey anti-King's Gambit \"defenses\" like 2 ...d6 my experience has taught me that it's rarely good to make this exchange on e5 early on, if it all. But now that my development is almost complete, and especially since the exchange will give Black an isolated e-pawn, it seems appropriate. ",
        "12... dxe5": "For once a flank pawn move might have been in order: 12 ...h6 prevents my next move and makes my Knight look very awkward. ",
        "13. Ng5": "Getting that knight off the flank and back into the action. ",
        "13... h6": "Kind of pointless now, seeing as I am going home to f3 anyway. Black shouldn't be giving me INCENTIVE to attack his isolated e-pawn! ",
        "14. Nf3 Nxf3+": "14... Nxf3 ?! Black needed this knight, probably on c6, to bolster his very unstable position. ",
        "15. Qxf3 Ng4": "My opponent plays yet another pointless and only pseudo-aggressive \"attack\". ",
        "16. h3": "Bye-bye...",
        "16... Qd4+": "Futile. ",
        "17. Kh1 Rf8": "Again, more empty \"threats\". \n",
        "18. Qe2 Rxf1+": "Black is trading material while down! ",
        "19. Qxf1 Nf2+": "Yet ANOTHER empty threat. I suppose my opponent hopes I'll play 20 Kg1... but as if... The knight should just concede defeat and go home to f6. ",
        "20. Kh2": "And now the knight is actually *dead*. That's what hollow aggression gets you: a toothless loser's idiot grin. ",
        "20... Kd7 21. Qe1": "Setting up 22 Be3",
        "21... Bh4": "Not good enough, buddy. Wake up! ",
        "22. g3 Be7 23. Be3": "Ciao!!! ",
        "23... Qd6 24. Qxf2": "Ha! I even get to take on my own terms, sweet. ",
        "24... Rf8": "More toothless (as in gnaw me with your gums...) aggression. ",
        "25. Qe2 Qg6 26. Rf1 Bf6": "This actually a decent move! But it doesn't matter..... ",
        "27. Nd5": "Thankfully, Black timed out at this point. Otherwise, like the newb he is, he probably would have dragged this losing position out as long as it took for me to \"prove\" the win by checkmating him. \n\nSadly, my play with the Black pieces against this opponent was nowhere near as solid...... "
    },
    "url": "https://gameknot.com/annotation.pl/36th-gk-tournament?gm=7974",
    "gameName": "36th GK tournament",
    "players": "theorybrat (1566) vs. patak (1502)",
    "opening": "King's gambit (C30)"
}