{
    "moves": {
        "1. d4": "This is a game that shows how minor errors in the opening can cost a great deal later on.  It ends on a fairly major blunder, but that isn't the goal of this annotation.",
        "1... e6 2. c4": "Offering to transpose into the Queen's Indian",
        "2... Nf6 3. Nc3": "And we are in the main line of the Queen's Indian, ...",
        "3... Bb4": "Though not played at the highest levels, this move is acceptable as long as it played correctly",
        "4. Bd2 Bxc3 5. Bxc3 O-O 6. Nf3 c6": "Here is a mistake by Black.  Instead of developing a piece, as would seem natural, Black pushes a pawn.  To further cramp his position, Black has also occupied the natural square for the b8 knight.",
        "7. e3": "This pawn move, on the other hand, works well.  It reinforces the center and  gives the f1 bishop a developing move, clearing the way for 0-0.",
        "7... d5": "Trying to open space for the cramped knight on b8.  White will not capture because of 8. cxd5 cxd5, and then the knight has regained his natural square on c6.  Also, Black should not capture on c4 because that will allow the bishop to develop while capturing, and gaining a tempo for White.",
        "8. Ne5": "7...d5 also means that White is able to centralize his Knight, while Black has no easy means of dislodging him.",
        "8... dxc4": "As previously noted, this is a mistake because...",
        "9. Bxc4 Ne4": "Black is trying to simultaneously create an outpost for his knight and open a space to move his pawn to drive away the knight on e5,...",
        "10. O-O": "which White ignores, castling to an easily defensible King position",
        "10... Nxc3": "? Another mistake from Black.  He trades his centralized Knight for a nonactive bishop, while allowing white to strengthen his center again by placing another pawn on c3.",
        "11. bxc3 b5": "Trying to drive the light-squared bishop onto a less threatening square",
        "12. Bb3": "though White is able to maintain control of the powerful diagonal.",
        "12... a5": "Black continues to try and harass White's light-squared bishop, but with disastrous results.",
        "13. Qd3": "White seizes the tempo, and predicting 13...a4, White sets up a mate threat after 14. Bc2.\n\nAlso, look at the difference in development.  White has castled safely, connected his rooks, and is already forming mate threats.  Conversely, Black has 3 pieces on their home squares and has made 5 pawn moves in the first 12 moves of the game.  You tell me who you think is winning...",
        "13... a4": "As White was hoping for",
        "14. Bc2 f6": "And as I noted at the beginning, this is the blunder that finishes the game.  Black tries to drive the knight off of it's powerful central square, but neglects the mate",
        "15. Qxh7#": "and that's it.  \nI am convinced that barring major blunder, White should win this game in the end anyway, simply because Black is so far behind in development and his pawn structure is far to over-exposed.\nPM me if you want to tell me what I did right, wrong or otherwise, or you can leave comments, which I always read.  Thanks, JamesXC"
    },
    "url": "https://gameknot.com/annotation.pl/37th-gk-tournament?gm=8925",
    "gameName": "37th GK tournament",
    "players": "jamesxc (1457) vs. pion8 (1340)",
    "opening": "Queen's pawn (A40), Keres defence"
}