{
    "moves": {
        "1. d4": "Having been thoroughly creamed as black against gcasanova in this tournament, I was hoping for a much better result as white. I've always been more comfortable with a positional queen's pawn game.",
        "1... Nf6 2. c4 e6 3. Nc3 Bb4 4. Qc2 O-O 5. Bg5 Nc6 6. e3": "Having developed the queen's bishop, I can play e3 without hindering one of my favorite pieces' scope.",
        "6... d5 7. Nf3": "I like this position a lot as white. No need to fear dxc4, as it only costs black tempo.",
        "7... a6 8. a3 h6 9. Bh4 g5": "Black's first real mistake in my opinion. Here I actually considered Nxg5, but realized that while sort of sacrifice might work in blitz chess (and is very fun), it is not the wisest as the attack would probably not be strong enough...",
        "10. Bg3": "Black's pawn structure is still screwed up without needing to sacrifice anything. It's not just pawn structure, but which pawns. The king's perilous position will eventually be exposed. I was quite confident at this point.",
        "10... Bd6 11. c5": "Trying to lock up the queen's side so I could enjoy attacking the weakened black king...and also hoping for black's next move. Trading black bishops really helps because my white bishop has so much more power at the time, since my pawns are on black and his on white.",
        "11... Bxg3 12. hxg3": "Now my rook can apply pressure without having to move.",
        "12... Kg7": "Shucks! Well, defended, of course.",
        "13. Be2": "I was beginning to wonder whether I would be able to force issues enough on the king's side. It was taking me a few more moves than expected. A pawn storm was the plan.",
        "13... g4": "He beat me to it! This was becoming very inconvenient!",
        "14. Nd2 e5 15. dxe5 Nxe5": "Black has ruined many plans by contesting the center and breaking the lock.",
        "16. f3": "Time to just consolidate and slowly build...",
        "16... gxf3 17. gxf3": "Good. Pawn structure normalized. King has a hole at f2. Can eventually double rooks on h-file. I'm liking this more again. Just wish I hadn't had to move the Nf3 away. Plus, his knights have all the important light squares covered. Maybe this isn't so good after all.",
        "17... Ned7": "Really not sure what was best for black here, but I don't think this was it. Blocking the bishop in leads to problems. Perhaps Qe7 or Re8 would have been better.",
        "18. b4": "The only good way to protect the pawn. Using the knight is awkward and the queen is going to have more important things to do. Most of these moves are not complex, nor do they have many tactical surprises (well, not yet anyway). They are simply sound, positional moves that keep building a stronger position. When you have a good positional stand, tactics somehow seem to pop up.",
        "18... a5": "hmm... this I was not expecting and got me thinking a while. Thankfully, I had a couple days.",
        "19. Kf2": "19. bxa5? 20. Rxa5 would probably be winning for black. Don't let those rooks out for him. Make him work for it!",
        "19... Qe7": "Sound, recentralizing the queen. But now the tactics begin to kick in...",
        "20. Nb5": "I wasn't sure about this when I played it. I simply couldn't think of anything better. After I played it, I realized it was pretty good and there wasn't a lot black could do. I was expecting c6 with the reply of Nd6, making use of an excellent outpost from whence the Knight could wreak havoc. Once again, I missed black's reply. He was making what I thought was a winning position into a real battle.",
        "20... axb4 21. Nxc7": "21. axb4 Rxa1 22. Rxa1 is not really what I wanted. I still wanted to attack that black king on the h-file. Plus the afore mentioned move could lead to nasty tactics involving black queen and knights. Those pieces work very well together.",
        "21... Rxa3": "Again, I somehow overlooked this and was really beginning to sweat. How was I letting this game get away? A passed pawn 2 squares from promotion? Well, better than any alternative I guess...",
        "22. Rxa3 bxa3": "Would love to find a way to gobble up the black pawn, but realize the importance of my own c-pawn. Thus, the only good way to protect it. I could use the rook, but 1) I like it on the h-file (still want to attack that king) and 2) it probably will have to go to the a file anyway to block the pawn and eventually help capture it. So...",
        "23. Nb3 b6": "As frustrated as I was getting with black thwarting my plans and turning this into a queen-side game rather than allowing me to use my advantage on the king-side, I now realize he was pretty frustrated too in that he didn't have many productive things to do. Such is life when something like a bishop is pinned in and a rook is inactive. It limits the effectiveness of all other pieces.",
        "24. cxb6": "Now I was beginning to see some daylight and good tactical chances. Still, I didn't like the realization that the black queen was now connected to his advanced passed pawn and the knights were not too far away. I would have to be careful...",
        "24... Nxb6 25. Qc6": "It took me a while to find this move, but once I did, I was pretty sure I was going to win. I expected ...Qb4 as a response, which looks very good and had me worried. But in response, I had found a winner, which made this game seem really cool to me - a rook sacrifice. It somehow seems so much cooler to sacrifice a rook than just a pawn or minor piece. Anyway, here's the line I saw: 25. ... Qb4 26. Rxh6! Kxh6 27. Qxf6 ... and black has his choice of where he wants to be mated. A combination of white pawns and the white bishop leads to a quick mate in either case, unless black decides to sacrifice his queen for a pawn. So I was pretty confident here, but still wondering whether I had overlooked something.",
        "25... Nc4": "Hmm... could be trouble. I thought about Bxc4 dxc4 Qxc4, with a better position and pawn structure, but thought there must be something better. Of course...!",
        "26. Nxd5": "Now black is in trouble and about to lose his knight at the least. Finally, my Rook on h1 that I never wanted to move pays off. He finally is decisive...",
        "26... Nxd5": "The final losing move...at least he went down swinging.",
        "27. Qxh6+": "Kg8 Qh8#\r\nA very different sort of game, but thoroughly enjoyable. This game was all the more important, because a win meant 3 of us were going to the next round. A loss or draw meant only gcasanova was. Didn't spend a lot of time in post-analysis on this and I'm sure I missed a lot. My goal is not to give a detailed right move, wrong move, but rather just to give my thoughts on a complex situation. Overall, I think 9...g5 was the big mistake of the game. It was just too dangerous in that situation to expose the king like that. Of course, it very well could have worked, who knows? I'm sure someone will play the same move against me someday and thoroughly whoop me. Any comments on the game, I would love to hear from you.\r\nThanks for reading,\r\nJustin"
    },
    "url": "https://gameknot.com/annotation.pl/38th-gk-tournament?gm=11394",
    "gameName": "38th GK tournament",
    "players": "justinjkropf (1593) vs. gcasanova (1502)",
    "opening": "Nimzo-Indian (E32), classical, Adorjan gambit"
}