{
    "moves": {
        "1. Nc3 d5 2. d4 Be6 3. Be3 c6 4. g3 Qa5 5. Bh3 f5 6. Bd2 Na6 7. Bf4 b5 8. a3 O-O-O": "Le grand roque noir manque de protection (pions ...)",
        "9. Nf3 Re8 10. Ng5 Kd7 11. O-O h6 12. Nxe6 Kxe6 13. b4": "Les noirs ont un roi trop exposé et les blancs des menaces.",
        "13... Qb6 14. Qd3": "Menaçant 15. Dxf5#.",
        "14... g6 15. g4 Kd7": "Le roi se réserve une case de fuite : d8.",
        "16. gxf5 g5 17. f6+ Kd8 18. fxe7+ Bxe7 19. Qf5 Qb7": "19... gxf4 ??? 20. Dd7#.",
        "20. Bg3 h5 21. Bd6 g4": "Le fou n'a plus qu'une case de fuite ...",
        "22. Bxe7+ Nxe7 23. Qe6": "Les blancs ont perdu l'avantage.",
        "23... gxh3 24. Qxh3 Reg8+ 25. Kh1 Rg4 26. Rfg1 Rxd4 27. Qe3 Qb6 28. Rad1 Nf5 29. Qg5+": "Menaçant de prendre le cavalier ou la tour avec 29... Ce7 30. Dg7 ou 29... Re8 ?? 30. Dxf5.",
        "29... Ne7 30. Qg7 Rg8 31. Qxd4": "Les noirs sont tombés dans le piège.",
        "31... Nc7 32. Rxg8+ Nxg8 33. Qh8": "La simplification donne aux blancs une position gagnante.",
        "33... Qxf2": "Menace mat si la Td1 s'en va.",
        "34. Qxg8+ Ne8 35. Qg5+ Nf6 36. Qh6 h4 37. Qf8+ Kc7 38. Qc5 Ne4 39. Nxe4 Qxe2 40. Qd6+": "Il y a mat dans tous les cas sauf un ou la position ne vaut plus la peine de continuer :\n40. ... Rc8 41. Dxc6  Rb8 42. De8  Rc7 43. Df7  Rc8 44. Cd6  Rd8 45. Df8  Rc7 46. Cxb5  Dxb5 47. Dc5  Dxc5 48. bxc5 Rc6 49. c4 dxc4 50. Td6  etc.  \n40. ... Rc8 41. Dxc6  Rb8 42. De8  Rc7 43. Df7  Rc8 44. Cd6  Rb8 45. Db7#  \n40. ... Rc8 41. Dxc6  Rb8 42. De8  Rc7 43. Df7  Rd8 44. Txd5  Rc8 45. Dd7  Rb8 46. De8  Rb7 47. Cd6  Rb6 48. Db8  Rc6 49. Db7#  \n40. ... Rc8 41. Dxc6  Rb8 42. De8  Rb7 43. Cd6  Rc7 44. Dxe2 Rxd6 45. Dh5 Re6 46. Txd5 Rf6 47. Df5  Re7 48. Td7  Re8 49. Df7#  \n40. ... Rc8 41. Dxc6  Rd8 42. Txd5  Re7 43. Df6  Re8 44. Td8#  \n40. ... Rb6 41. Db8  Ra6 42. Cc5#  \n40. ... Rb7 41. Cc5  Rb6 42. Db8# \nLe reste se passe de commentaire, l'avantage blanc étant trop énorme.",
        "40... Kb7 41. Nc5+ Kb6 42. Qb8#": ""
    },
    "url": "https://gameknot.com/annotation.pl/39th-gk-tournament?gm=16428",
    "gameName": "39th GK tournament",
    "players": "villiers (1132) vs. sovlibcnst (1297)",
    "opening": "Dunst (Sleipner, Heinrichsen) opening (A00)"
}