{
    "moves": {
        "1. e4": "Hello all.  I'm annotating this loss in the hope someone can tell me where I went wrong.  So, please feel free to suggest either alternative moves or even entirely different plans...",
        "1... c5 2. Nf3 d6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 e6": "The Scheveningen.  I normally play the Najdorf, but it's good to mix things up every so often.",
        "6. Bc4 a6": "Oh - spoke too soon.  Najdorf after all ;)",
        "7. O-O b5": "Black may as well take the tempo given by White's decision not to retreat the bishop to b3 on mv 7.  All theory of course.",
        "8. Bb3 Be7 9. Qf3 Qc7": "Preparing ...Nc6; preventing e5 - for now.",
        "10. Qg3 O-O": "Castling into it, but with the 'moral protection' of theory.",
        "11. Bh6": "Crude, but it still forces Black to do something.  It is mate that's being threatened, after all.",
        "11... Ne8 12. Rad1 Bd7 13. Nf3 Nc6 14. Bf4": "This seems to be a new move (which is to say no more than that I couldn't find any games with it!).  The idea is to pressurise the d5 pawn and prepare e5, opening lines.",
        "14... b4": "A difficult decision but it felt like the right sort of move to be playing.  I had seen White's reply but decided there was nothing too horrid lurking in it.  Eventually, this move forces a relocation of the Nc3.",
        "15. e5": "(!?) Now Black has to be careful.  15...bxc3?! 16. exd6 (forking Q and B) ...Bxd6 17. Bxd6 ...Nxd6 18. Qxd6 just looked too strong for White.  Black would then have to protect his Bd7 so, after say ...Ra7, 19. bxc3 is a (doubled) pawn up.",
        "15... dxe5 16. Nxe5": "White is threatening to take the Bd7 so Black must react.  My move (...Nxe5) is the likely cause of my troubles.  The 'machine' is recommending 16...Bd6.  If I considered this at all, I suppose I rejected it on the grounds it seemed foolhardy to put another bishop as bait for the Rd1.  In fact, after 16... Bd6 it's White's turn to make a choice. The Nc3 is en prise, also the  Ne5.  17. Nxd7 ...Bxf4 18. Qf3 ... bxc3 19. Nxf8 ... Kxf8 leaves Black material up and in pretty good shape as White has to deal with the attack on h2.  So, better is 17. Rxd6! ...Qxd6 18. Ne4 ...Qe7 19. Bg5! ...f6 20. Nxd7 ...Qxd7 21. Nc5 with compensation for the White giving up the exchange (the e6 pawn is dropping for a start), but plenty of play for Black, too.  ",
        "16... Nxe5 17. Bxe5 Qb7": "White's d-file pressure and dark square Q,B battery make it difficult for Black to avoid slipping into a passive position.",
        "18. Ne2": "Finally retreating - 4 moves after it was originally attacked.",
        "18... Bb5": "(!) A good start, pinning the knight and getting off the d-file.",
        "19. Rfe1 Bxe2": "(!?) Although it feels wrong to give up the 2 bishops, the W knight will otherwise reach d4 when the Bb5 is a gonner anyway.",
        "20. Rxe2 Bf6 21. a3": "(?!) giving Black the opportunity to exchange the B-sq bishops.",
        "21... Qb5": "(?!) which he doesn't take... I didn't want to bring White's Q further into the position but actually 21...Bxe5 is probably ok for Black.",
        "22. Re4": "(!) activating the rook.",
        "22... a5 23. Qe3": "Maintaining protection of his Be5, while centralising the Queen.",
        "23... bxa3": "Perhaps I misjudged this pawn exchange.  I felt that the c-pawn would be a potential target.  However in the ending that follows this passed pawn proves a constant distraction for Black.",
        "24. bxa3 Rc8 25. a4 Qc5 26. Qxc5 Rxc5": "I confess I was fairly content at this moment (queen's off against a near 2000 rated player, with no fundamental weaknesses in my position).",
        "27. Bf4": "(!) But, being a 2000 rated player, he knows that the two bishops will be strong in the ending and takes the time to prevent the exchange of his dark squared Bishop (27.Bxf6 is obviously inferior after 27...Nxf6 -- when Black would be fine).  If White doesn't want to retreat his bishop, the other plan is 27. f4, still maintaining a clear plus. ",
        "27... Bc3": "Aiming both to secure my a-pawn and block the advance of the c-pawn.",
        "28. Rd3 Nf6": "Developing with tempo.",
        "29. Rc4": "(!) White finds a clever way to negate the tempo gain just achieved by Black by attacking the bishop on c3 twice.",
        "29... Bb4 30. c3": "White insists on dislodging the dark square bishop from its pleasant home on b4.",
        "30... Rxc4": "Perhaps I could have tried 30 ...Ba3 instead but after 31. Rxc5 ...Bxc5, Black is still in significant difficulties: he can't oppose the White rook's control of the d-file nor activate his own on b8 (which would otherwise be good) since that square is covered by the Bf4.  The other advantage of Black exchanging on c4 is that after the bishop recaptures there is a White piece blocking his own passed pawn.",
        "31. Bxc4 Bc5 32. Kf1 Bb6": "Aiming to exchange off rooks with ...Rd8. ",
        "33. Bb5 Rd8 34. Rxd8+ Bxd8": "Although the rooks coming off the board arguably just accentuates White's two Bishop advantage, it's hard to see what other plan Black should have tried - the rook was extremely passive on f8 and prevented any kind of king activity.",
        "35. c4": "At last the pawn starts its advance.",
        "35... Bb6 36. f3": "(!) Right up until this moment I was still feeling quite optimistic.  Following this move I began to realise how difficult it would be to get active.  For a start Black's knight has almost no good squares (Nh5 is the only knight move that doesn't lose material).  The second main problem is that if Black tries to get his king into the game with ...Kf8 he simply runs into Bd6  and, because the e8 square is covered by the Bb5, he will have to return from whence he came.  I think that, having seen this was the case, I proceeded with a bogus alternative plan - rather than searching for a way to prevent this tactic.",
        "36... h6": "The beginning of a convoluted plan to get the King out via g7.  However, much better seems to be ...Bc5!  (Preventing White checking on d6 as mentioned in the earlier line) which should allow Black to get his King out.  The reason I didn't play this was because I feared 37. Bd2, attacking the now undefended a-pawn.  But perhaps in this case Black just returns his bishop to b6 and continues with ...Kf8 (since White's black square bishop is no longer eyeing d6).  If I had to choose one moment where the game was lost, I'd go for not seeing...Bc5.  Now, however White prevents that possibility.",
        "37. Bd6 Bd8": "(Wanting to prevent 38. Be7 which would make the g-pawn advance impossible because of the hanging knight on f6.)",
        "38. Bc6 g5 39. c5 Kg7 40. Ke2 Ng8": "What else?",
        "41. Kd3 Ne7": "With an attack on the Bc6.  During this ending I was aware of two key strategic ideas: if Black can trade his knight for either the light or dark sq White Bishops his position will immediately improve.  Best of all would be knight for dark sq Bishop (leaving B's of opposite colour).  Hence this move, hoping against hope that the attack on the undefended light-sq Bishop would provoke 42. Bxe7(?).  No such luck.",
        "42. Bb7 f5": "At last achieving a little breathing space, but White is still firmly in control.",
        "43. Kc4 Kf6 44. Kd4": "Seeing that the obvious 44. Kb5 fails to make any progress (and also allows Black to gain more space with ...e5), the White king changes direction.  Over optimistically, I took this as a sign that White might not have a clear winning plan.",
        "44... Kf7": "Trying to tempt White into the pseudo-active move 45 .Ke5(??).  Amazingly that horrible move would allow mate in two: 45...Nc6  46. Bxf6 (forced) ...Bf6  !  (who said endgames were boring?).",
        "45. Bb8 Ke8 46. Be5": "White doesn't want to push the c-pawn just yet as that would block the Bb7's cover of the d5 sq, allowing Black a little activity with 46...Nd5",
        "46... Kd7": "Again, after getting in ...Kd7 I was beginning to feel that I might be able to save the game.  Most of White's avenues into the Black position are, or can be, covered.",
        "47. Kc4 Nc6": "(Attacking the Be5 and intending to meet 48. Kb5 with the annoying check ...Na7  when the white king has no choice but to retreat to c4).",
        "48. Bc3 Na7": "(?) But this is a mistake.  I wanted to keep the White king out of b5 but 48...Kc7 would have been a lot better.  The attack on the Bb7 would have forced either Ba8 when the Bishop is less active or Ba6 when the pawn advance to c6 is no longer supported.  Further, why put the knight on the edge of the board unnecessarily?",
        "49. g4": "(!) Finding the right way.  This excellent move forces Black either to saddle himself with an isolated e-pawn (after an exchange on g4) or - as in the game - allow an exchange of pawns on f5 which removes the pawn cover on the d5 sq; enabling White's king to get in.",
        "49... Bc7": "Attacking the pawn on h2 even though actually capturing it gives White the a5 pawn in return and therefore two past queenside pawns.  Black should probably have played ...fxg4 (keeping control of d5) and hoped for the best.",
        "50. gxf5 exf5 51. Kd5": "Now White is getting ready to play c6.",
        "51... Bxh2": "Black is strategically lost already - this merely accelerates matters.  He sould have tried 51...Ke7 instead, but after 52. h3 White will soon be piling on the pressure since Black has hardly any useful moves.",
        "52. Bxa5": "It's amazing to me that even though Black has managed to maintain material parity for 20 odd moves of the endgame, his position is nevertheless now totally lost.",
        "52... Bc7 53. Bb6 Nc8": "Totally boxed in a corner.  Capturing the Bb6 would not have changed matters: 53...Bxb6 54 cxb6 and now if ...Nc8, White just exchanges pieces, moves his King to c6 and forces promotion and then mate.  Alternatively, Black could try sacrificing his knight to mess up the white pawns with 53...Nb5 which looks interesting since the remaining bishop does not attack the queening square, but in this case White can calmly mop up the kingside pawns because Black's King can't get near to b8 anyway (and any attempt to come round the back with ...Kc5 has white playing Bc8 and advancing the b6 pawn to promotion.)",
        "54. c6+ Kd8 55. Bxc7+": "White finds the simplest way to victory.",
        "55... Kxc7 56. Bxc8": "Having avoided piece exchanges up until now, suddenly it's just pawns.",
        "56... Kxc8 57. Kd6 g4 58. a5": "The white pawns are too quick.  Black can play ...gxf3 and make a queen himself but one move later he'll be checkmated on the back rank by the new queen on a8.  Trying to slow White down with ...Kb8 doesn't help either: White plays Kd7 and queens the c-pawn instead.  Either way, mate is only a few moves away so... Black resigns: 1-0\r\n\r\nOn the one hand I was pleased to have lasted so long against a much stronger opponent and not made any outright blunders.  Equally, it's a shame to play so many moves and still end up with nothing...  Over and out -- Pikket"
    },
    "url": "https://gameknot.com/annotation.pl/41st-gk-tournament?gm=14213",
    "gameName": "41st GK tournament",
    "players": "lq26 (1989) vs. pikket (1792)",
    "opening": "Sicilian (B87), Sozin with ...a6 and ...b5"
}