{
    "moves": {
        "1. d4": "White opens Queens pawn",
        "1... d5 2. c4": "Queens Gambit, trading control of the center of the board for momentary positional advantage",
        "2... dxc4": "Accepted. Rare in these days",
        "3. e4": "Control of center of the board is complete, the king side bishop is now open to take back the material lost in the gambit",
        "3... e6 4. Nc3 Bb4 5. Bxc4 Ne7 6. Be3 O-O 7. Nf3": "This is a fairly standard opening for white. I don't have much of a clue what black is doing, but as you can see, he is under developed.",
        "7... Bxc3+ 8. bxc3": "Black decides to trade bishop for knight. This means we want to pursue an open game. Better to have fewer pawns on the table hindering our bishops. He will be wanting to close the board.",
        "8... c6 9. Bd3 Qa5 10. O-O": "Moving the queen out was foolish when the attack is so easily defended by a castle. I now have a partly open board on the left side and a back rank clear of material[with my king on the outside rather than in. This means i have developed 6 pieces and have them all in play. He only has a knight, queen and rook in play and needs to develop them fast lest i can push my material advantage.",
        "10... Qxc3 11. Ne5": "His queen comes in and I position my knight for an attack. I am going to bring it along the other side and trap his queen.",
        "11... f6 12. Nc4 e5 13. Rc1 Qb4 14. Rb1 Qc3 15. a3 b5": "With a little maneuvering i have his queen. Its going to cost me a rook and a knight. But he is undeveloped and the queen is worth that much more in an open game.",
        "16. Rc1 Qxc1 17. Qxc1 bxc4 18. Bxc4+ Kh8": "Check. He pulls his king back instead of blocking. This was a mistake but it is hard to see why right now. He should have been pushing for a trade, so that he can negate my double bishop advantage. ",
        "19. d5 cxd5 20. exd5": "Opening up the board more",
        "20... Nf5 21. Bc5 Rd8 22. Qd2": "Forming a battery to attack and push the pawn through. He really needs to get developed even it costs him material",
        "22... Nd6": "He wants to trade a knight for a bishop. Otherwise a good trade, but its going to set up a pin for mate",
        "23. Bxd6 Rxd6 24. Qb4": "Now he has to retreat his rook to d8, play kd7, or advance the h pawn if he wants to keep out of mate. There is one way to protect the rook, but he loses his knight to do it. [..d8 25. Qd8..Kc6 26, d5xc6..bf5]",
        "24... Rb6": "He does not see that line",
        "25. Qf8#": "And his lack of developing his knight, bishop, and queen side rook are what lose him the game."
    },
    "url": "https://gameknot.com/annotation.pl/43rd-gk-tournament?gm=18713",
    "gameName": "43rd GK tournament",
    "players": "goumindong (1455) vs. kapeky (1350)",
    "opening": "QGA (D20), 3.e4"
}