{
    "moves": {
        "1. e4": "Evan's Gambit",
        "1... e5 2. Nf3 Nc6 3. Bc4 Bc5 4. b4 Bxb4 5. c3 Bc5": "An incorrect reply that runs into trouble quickly.  This move allows white his plan, with tempo",
        "6. d4 Bd6": "A better retreat would have been 6...Bb6.  After such a move, white feels more pressure on his center.  Here, black blocks the d-pawns advance.  An interesting try would have been 6...exd4 where either the immediate 7. cxd4 or 7. Nxd4 Nxd4 8. cxd4 run into Bb4  where, after 7. Bd2 or 8. Bd2, the exchanges give black a simplified position to defend, with the pawn plus still well in his possession.",
        "7. O-O": "Very important to castle early in most gambits, and the Evan's is certainly not an exception.",
        "7... Nf6": "Attacks the e-pawn and prepares the black castle.",
        "8. Re1": "Defends the pawn.  Interesting alternatives would be 8. Qd3 or 8. Be3, but I decided to keep my bishop in a position where Ba3 is possible, though this variation of the Evan's clearly makes it unlikely.  Also in my mind was 8. Qb3, which is also a common theme in some Evan's games.  It could have been very powerful here, as his Light-squared bishop is trapped by the d-pawn, which is trapped by the Dark-squared bishop.",
        "8... O-O 9. Bg5": "Pins the knight.  White is trying to develop and attack.",
        "9... a6": "A terrible time-waster.  This position demands that black respond immediately to white's looming attack.  Here, instead, black imagines a counter-attack on white's bishop perhaps, but the bishop can be just as powerful from b3 or d5 as from c4.  Better would be b7 (to get the bishop into the game) or even a try at the dangerous-looking h6.",
        "10. Nh4": "At this point, I believed my position was so good, I could easily win shortly.  I open the way for my queen and I eye the f5 square for my knight as well as f-pawn storms.  Perhaps a little premature and it does block my h-pawn, but it was an attacking move, and I do like to attack, even hastily.",
        "10... exd4": "A serious blunder.  Black relieves the pressure in the center and allows my e-pawn to entertain thoughts of advance, especially with my f-pawn joining it.",
        "11. cxd4 Bb4": "Moves out of the way of the d-pawn, finally, with tempo.  ",
        "12. Re3": "12. Nd2 is possible, developing, but I am loathe to self-pin and this allows me to think about leaving my e-pawn to attack quickly with the rook on the f-, g-, or h-files",
        "12... d6": "Gets a diagonal for that miserable bishop and prevents Rh3",
        "13. a3": "Attacks the bishop.  This move is somewhat dubious, as the bishop was really no threat, except to the development of my knight.  And if we were to trade his bishop for my knight, I should be happy.",
        "13... Be6": "Here, black loses a piece. ",
        "14. axb4": "??? But I miss the way to win.  Simply 14. Bxe6 fxe6 15. axb4 wins easily for white.  Somehow, that Dark-square bishop was giving me such problems that I decided to trade my light-square bishop for it when I could have won it outright.  I think there is an important lesson in this.  Often, I (and I hope that I am not alone) get so focused on one piece or plan or idea my opponent has that I forget to watch the board.  Naturally, right after I hit submit, I saw what I missed and felt quite foolish.  A little more time thinking and I'm sure I would have seen the right move.",
        "14... Bxc4": "Black is very happy to get the piece back",
        "15. Nc3": "Here, I saw that Nxb4 gives black a pawn and considered various ways to defend it (i.e., chasing the bishop with Qc2 or Rc3 and then defending), but I decided to give up one more pawn for the attack.  This is a gambit, after all.",
        "15... Nxb4": "Black takes the pawn.  White is up development and has his pieces kingside, but often, this is not enough to win.",
        "16. Rg3": "Lining up with the black king.  White's idea is e5 dxe5 dxe5 and the knight can't move.  Interestingly, if the queen moves, the knight is undefended as after Bxf6, gxf6 is impossible by the pin.",
        "16... Re8": "Stops e5.",
        "17. Qf3": "Renews the attack on the knight.  Remember, the g-pawn, for all practical purposes, does not exist here.",
        "17... Nc2": "Misses white's idea.  Re6 was the only defense, where white retains a reasonable game despite his 2 pawn deficit.",
        "18. Bxf6 Qd7": "up a knight for two pawns, white finally gets the piece he deserves.  And, he also gets the game.",
        "19. Rxg7+ Kf8 20. Rg8+": "Straightforward.  20...Kxg7 21. Qg3  Kf8 (Kh8) 22. Qg7#.   A nice, blunder-filled game."
    },
    "url": "https://gameknot.com/annotation.pl/48th-gk-tournament?gm=18094",
    "gameName": "48th GK tournament",
    "players": "bobdoleeatsfood (1173) vs. rlongoz (1233)",
    "opening": "Evans gambit (C51), normal variation"
}