{
    "moves": {
        "1. d4": "I was lucky enough to have white again. This game is an excellent partner to the previous game. In that, I gave up bishop for knight to gain and pawn, and then I prevented him from play the freeing c6-c5 and kept the position closed, so that my knight was far better than his bishop. This game is the reverse. He gives up bishop for knight, and the open position favours my bishop over his knight.",
        "1... Nf6": "He prevents e4",
        "2. c4": "This is standard",
        "2... e6": "Showing a preference for the Nimzo-Indian or the Queen's Indian.",
        "3. Nc3": "I continue to develop.",
        "3... Bb4": "So its a Nimzo-Indian.",
        "4. e3": "This is the main line.",
        "4... O-O": "This is normal too.",
        "5. Bd3": "This is the most popular move too.",
        "5... d5": "Now we have a pawn formation similar to a Queen's Gambit declined.",
        "6. Nf3": "So I develop.",
        "6... c5": "This is thematic in this opening.",
        "7. a3": "0-0 is more common.",
        "7... Bxc3+": "He takes.",
        "8. bxc3": "I take back.",
        "8... dxc4": "He takes again.",
        "9. Bxc4": "I take back.",
        "9... Nbd7": "He develops",
        "10. O-O": "I castle.",
        "10... Qc7": "He threatens cxd4 with a discovered attack on my bishop.",
        "11. Qe2": "So I protect my bishop.",
        "11... cxd4": "This move takes us out of the opening databases. Instead b6 or e5 are normally played in this position. The problem with this move is that it is opening up the position somewhat for my two bishops. Black should be trying to keep the position closed.",
        "12. cxd4": "So I take back.",
        "12... b6": "He develops.",
        "13. Bb2": "Played partly to try and stop the freeing e6-e5.",
        "13... Bb7": "He continues to develop. Notice how now all black's pieces are on the back three ranks.",
        "14. Rac1": "Threatening discovered attacks on his queen.",
        "14... Qd6": "So the queen runs.",
        "15. Ne5": "Now if he takes the knight, I take back with the pawn and fork his queen and knight.",
        "15... Rac8": "He contests the c file.",
        "16. f3": "Preparing e3-e4 with a strong centre.",
        "16... Qb8": "So now he can take on e5.",
        "17. Nxd7": "So I exchange.",
        "17... Nxd7": "He takes back.",
        "18. e4": "And I secure this strong centre.",
        "18... Rfd8": "He continues to mobilize.",
        "19. Bb5": "I can't remember why I played this!",
        "19... Nf8": "His knight seeks better squares.",
        "20. g3": "I prepare a slow advance on the king-side.",
        "20... Qd6": "The queen comes back into the centre.",
        "21. Rce1": "My plan is to build up on the king-side. As such I don't want the exchange pieces, so I avoid rook exchanges on the c file. I plan to prevent him infiltrating on the c file by playing Bb5-d3 and then my bishops cover the infiltration squares.",
        "21... Qe7": "He starts wasting moves.",
        "22. f4": "I continue with my plan.",
        "22... Qc7": "He threatens Qc2",
        "23. Bd3": "So I prevent that.",
        "23... Nd7": "Still moving pieces backwards and forwards. I am not sure what, if anything, his plan is.",
        "24. Qh5": "So I start to probe the king-side.",
        "24... f6": "Blunting the effect of my Bb2 bishop, but making his e6 pawn weaker.",
        "25. Rec1": "So I hit his queen.",
        "25... Qb8": "Queen moves.",
        "26. Bc4": "I threaten e6 and prevent exchanges on the c file.",
        "26... Bxe4": "He takes.",
        "27. Bxe6+": "I take. Of course now Kf8?? is met by Qf7 mate!",
        "27... Kh8": "So the king has to come this way.",
        "28. f5": "I prevent his bishop protecting h7. I was now threatening Rf4, which as well as threatening his bishop is also threatening Qxh7 check! and after Kxh7, Rh4 is mate.",
        "28... Rc2": "Unfortunately he is now threatening Rg2. I could still play Rf4, but he does have a defence in g7-g5 and if I take his bishop, he takes my bishop.",
        "29. Rxc2": "So I exchange.",
        "29... Bxc2": "He takes back.",
        "30. Rc1": "I hit his bishop.",
        "30... Ba4": "Bishop runs.",
        "31. Qf7": "Black is rather tied up.",
        "31... Qb7": "He gives more protection to his knight.",
        "32. Qe7": "I hit his rook.",
        "32... Qb8": "The queen drops back.",
        "33. Qb4": "His bishop is rather short of squares.",
        "33... b5": "This seems forced.",
        "34. Qe7": "Threatening his knight again, and now his bishop no longer protects it",
        "34... b4": "So he throws a pawn to save his knight.",
        "35. Qxb4": "I take.",
        "35... Nf8": "Knight finally moves.",
        "36. Qxb8": "Queens come off",
        "36... Rxb8": "He takes back.",
        "37. Rc8": "I force the rooks off.",
        "37... Rxc8": "He takes.",
        "38. Bxc8": "I take back.",
        "38... g6": "Seeking pawn exchanges",
        "39. d5": "Passed opawns need to be pushed!",
        "39... Kg7": "King comes up.",
        "40. g4": "I re-enforce f5",
        "40... Nd7": "Knight finally gets into play.",
        "41. Bd4": "I restrict its possibilities.",
        "41... Nb6": "I was very tempted to take the knight off here, with Bd4xb6, but then I thought \"If I move my other bishop, he can't move his knight without losing his a7 pawn, and he can't move his a7 pawn without losing the knight. So, if he does nothing, I just wander over to the queen-side with my king, using the black squares and eventually take twice on b6.\"",
        "42. Be6": "So I played this instead.",
        "42... gxf5": "He takes.",
        "43. gxf5": "I take back.",
        "43... Nc4": "I knew this was losing a piece for him, but as I said, if he doesn't try something like this, my king just wanders into his position and wins.",
        "44. Bxa7": "I take.",
        "44... Nxa3": "He takes.",
        "45. d6": "This pawn can only be stopped by losing a piece.",
        "45... Nc2": "He decides to lose the bishop rather than the knight.",
        "46. d7": "So I push again.",
        "46... Bxd7": "He takes.",
        "47. Bxd7": "I take back.",
        "47... Nb4": "I just have to be careful, I need to mobilize my king without losing anything to a knight fork!",
        "48. Kf2": "So the king comes up.",
        "48... Nd3+": "He checks.",
        "49. Ke3": "King comes up.",
        "49... Ne5": "His knight takes up a good central position, threatening a knight ofrk on g4.",
        "50. Bb5": "Played so that if he does play Ng4+ after Kf4, Nxh2, Kg3 wins the knight, as the Bb5 covers f1.",
        "50... h6": "A rather random move!",
        "51. Ke4": "The king finally advances to the centre of the battlefield.",
        "51... Nf7": "Knight retreats.",
        "52. Kd5": "King moves in for the kill.",
        "52... Ng5": "Knight temporarily prevents my king getting to e6, but his knight is not secure on this square.",
        "53. Kd6": "My king heads for e7",
        "53... Nf3": "He hits my pawn.",
        "54. h3": "It advances.",
        "54... Ng5": "He hits it again.",
        "55. h4": "So I advance again.",
        "55... Nf3": "He hits again.",
        "56. h5": "Now its safe.",
        "56... Nd2": "His knight almost looks like it is trying to solve the ancient task of visiting every square on the board!",
        "57. Bd3": "I try to restrict its movements.",
        "57... Nf3": "So he comes back this way.",
        "58. Ke6": "King finally reaches e6.",
        "58... Ne5": "Knight returns to e5.",
        "59. Be2": "I restrict its movements again.",
        "59... Nc6": "Not sure what he was thinking -the position is hopeless!",
        "60. Bb6": "Black has virtually run out of moves now. next move I am going to play my Bb6 to either d4 or d8 and then win the f pawn, so black resigned.\n\nMany thanks for reading my annotation. Please leave a comment or two. Did I miss any better moves anywhere? I wouldn't be too surprised! Please rate the annotation on the start system, so that I know how I am getting on. Until next time dear reader!"
    },
    "url": "https://gameknot.com/annotation.pl/4ncl-holmes-chapel-v-bradford-dca-b?gm=57551",
    "gameName": "4NCL Holmes Chapel v Bradford DCA B",
    "players": "CharlesHiggie (ecf172) vs. Damian McCarthy (ecf165)",
    "opening": "Nimzo-Indian (E48), 4.e3 O-O, 5.Bd3 d5"
}