{
    "moves": {
        "1. e4": "I think that i'll call this game Discovered attack madness.  I had allot of fun with this game because i usually dont get to be so creative with my games.  I have noticed that they have been real strait forward lately and with this game it was very fun.",
        "1... e5 2. Qh5": "2. Qh5 made me think right away that one either he doesnt know what he is doing or two he thinks that i'm a chump.  I lost almost 200 points in one week because of time outs so with this game i was bellow 1100.  1336 being my highest rating so far.",
        "2... Nf6": "MOVE bitch! (bitch a.k.a Queen)",
        "3. Qxe5+": "thats two queen moves out of three, bad idea I think.",
        "3... Be7 4. g4": "Here i dont know why he didnt reinforce his central e pawn so that he can if he wants to use the queen for some sort of a more use full job.",
        "4... Nc6": "MOVE bitch!!",
        "5. Qc3": "again MOVE bitch!!",
        "5... Nxe4 6. Qxg7": "I cant help it.... MOVE bitch!!",
        "6... Bf6 7. Qh6 Qe7": "I want to start my attack and get ready to castle.",
        "8. Qe3 Bd4": "MOVE bitch!!",
        "9. Qd3 Nxf2+": "MOVE bitch!!!!!!",
        "10. Qe2": "Thats eight Queen moves in the first 10.  he has developed his queen and two pawns.  I know that with that he does have a good chance of spreading out my forces since they are chasing her but I unleash the power of the discovered attack with not remorse.",
        "10... Ne5 11. Bg2": "gotta protect the rook.",
        "11... Qh4 12. Nf3": "He wants to mess with my Bitch,  here take a double!!!",
        "12... Nfd3+": "very nice discovered.",
        "13. Kf1 Qf6 14. cxd3": "I trade my knight for your doubled pawns, thats cool.",
        "14... d6": "I need to castle and finish development of my pieces.",
        "15. Ke1 Bxg4 16. Qe4": "his queen and bishop are in line at my b pawn but I have an idea.",
        "16... O-O-O 17. Nxd4": "still halfway through the game I have all but one piece in the fight and he is using two.",
        "17... Rhe8": "I see so many ways of creating those discovered and he doesnt really have a big punch coming.",
        "18. Qxb7+": "o.k. saw that coming but he runs out of fuel fast.",
        "18... Kd7 19. Bc6+": "there is nothing to that check but loss.",
        "19... Nxc6+": "another discovered check!!  I love it.",
        "20. Ne2": "Take another!",
        "20... Rxe2+": "that set up yet another discovered, crazy!",
        "21. Kd1 Rxh2+": "BOW bye bye rook.",
        "22. Kc2 Rxh1": "Now I want his queen, and i figured it out!!  very exciting!!",
        "23. d4 Rb8": "right there, i think that he should have taken my rook since his queen is lost.  but I guess he didnt see what was next.  ",
        "24. Qa6": "Killer Fork!!",
        "24... Nb4+": "POW",
        "25. Kc3 Nxa6": "now I need to lant the final blow, I thought long about how to finish with a cool ending. then I found it.",
        "26. Kc2 Bd1+": "I need you back down there sir.",
        "27. Kc3 d5": "his possible moves are fading away.",
        "28. d3 Rh2 29. Na3": "I'm coming for you!!",
        "29... Rb4": "I saw a very nice rook sacrifice to end with.",
        "30. Rb1 Qc6+ 31. Nc4": "Here eat my rook,  EAT IT!!",
        "31... Rxc4+ 32. dxc4 Qxc4#": "I loved this game and I hope you enjoy it too who ever takes the time.  ROCK ON!!"
    },
    "url": "https://gameknot.com/annotation.pl/4th-white-horse-shield?gm=15610",
    "gameName": "4th White Horse Shield",
    "players": "toolmaker (1101) vs. alexchavez666 (1056)",
    "opening": "KP (C20), Patzer opening"
}