{
    "moves": {
        "1. e4 c5 2. Nf3 d6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 a6 6. Bg5": "Probably the most popular move against the Najdorf Sicilian, leading generally to the Richter-Rauzer Attack.",
        "6... e6 7. f4 Be7 8. Qf3 Qc7 9. O-O-O Nbd7 10. g4 h6 11. Bxf6 gxf6": "I'm pretty certain we're still in book so far.  White probably has the better prospects.",
        "12. h4": "Looks logical.  My book memory runs out here and I can't find my book on this variation...",
        "12... b5": "Thematic: Black looks to develop his wsb on b7 and to launch an attack on White's K down the c-file with ...Rc8 and ...b4 among other moves.  Black also has to beware of White's sacrificial opportunities with Nc3-d5 or Bxb5 or Nxb5.  When White's Q moved to f3, this inhibited ...b5 because of the potential for revealed attacks on the Ra8 and the ris of moving Black's B onto b7 if unprotected, hence 8...Qc7, which I always play automatically against Qf3 in this and similar lines.",
        "13. Bg2": "refreshing the threat of e4-e5",
        "13... Bb7 14. Qf2 Rc8 15. Rd3 Nc5": "Black's counter-attack gets going.  I've decided that castling  is more risky than leaving the K in its central position, surrounded by pawns and the central Be7",
        "16. Rg3 b4": "hoping that the N won't come to d5 in the classic positional sac (one doesn't really need to work it out: it nearly always works!) but will instead interfere with White's defence of c2",
        "17. Nce2": "as I hoped",
        "17... Nd3+": "Only after I had played this \"clever\" move did I notice that although White can't take it with his pinned pawn, he can with the R that only recently left this very square.  I was ready to resign on resumption.  Imagine my surprise when White beat me to it and resigned!  Play might continue along one of these lines: (18. Rxd3 e5 19. fxe5 (19. Nc3 exd4 20. Qxd4 bxc3 \n21. Rxc3 Qd7 22. Rg1 Rg8 23. Rxc8  Bxc8 24. f5 Rxg4 25. Bh3 Rxg1  26. Qxg1) 19. .. fxe5 ( 19. .. Qxc2  20. Nxc2) 20. Nc3 {anything to block the mating attack on c2} exd4 21. Qxd4 O-O 22. Rd2 bxc3 23. bxc3 Qxc3 24. Qxc3 Rxc3 {when Black should be able to make his extra piece count})"
    },
    "url": "https://gameknot.com/annotation.pl/51st-gk-tournament-a-surprise-ending?gm=22299",
    "gameName": "51st GK tournament - a Surprise Ending",
    "players": "panteo (1617) vs. rjacobs (1551)",
    "opening": "Sicilian (B99), Najdorf, 7...Be7 main line"
}