{
    "moves": {
        "1. e4 d5": "This time with the Scandinavian defence. My opponent's trying to bring out the queen into the centre of the board by us trading pawns...",
        "2. exd5 Qxd5": "...which is exactly what happens, moving to the Lasker variation. Although the queen controls most of the squares, sitting in the centre of the board...",
        "3. Qf3": "...I can contest the long diagonal, hoping to trade queens to bring my knight out...",
        "3... Qxf3 4. Nxf3": "...and again this is what happens. I'm ahead on development, with one piece out, while my opponent has none out.",
        "4... Bg4": "My opponent brings out his bishop to attack my knight. There is one way to ensure my pawn structure doesn't get distorted, and that my king doesn't come out his comfort zone...",
        "5. Be2": "...and this is it. If my knight does disappear, I can stay ahead on tempo, and my pawn structure stays solid...",
        "5... Bxf3 6. Bxf3": "...and again this happens. My bishop is now threatening to poison the b7-pawn...",
        "6... c6": "...but its neighbour sees to that by covering it...",
        "7. b4": "...so I bring up my QNP to threaten the QBP, and so I'm able to fianchetto bishop. I will finish the annotation later...",
        "7... e6": "...and my opponent frees up the remaining bishop to attack my stray pawn...",
        "8. b5": "...so I advance my pawn further to threaten the one on c6...",
        "8... Bc5": "...and my opponent gains some tempo by unleashing his dark-square bishop...",
        "9. Bb2": "...so I fianchetto mine onto the long diagonal, eyeing up the g7-pawn...",
        "9... Nf6": "...but again my opponent reads this move by bringing out the knight to cover...",
        "10. bxc6 Nxc6": "...so we trade pawns on c6, and as the knight comes out...",
        "11. Bxc6+ bxc6": "...I trade it for my bishop, disconnecting the remaining queenside pawns.",
        "12. d4": "Now I advance my queen's pawn to threaten the bishop...",
        "12... Bb6": "...and my opponent moves it back...",
        "13. Nd2": "...so I bring out my knight to free up my queenside rook...",
        "13... Nd5": "...but my opponent's is clearly threatening a fork on c2 (if the knight moves to b4 the a2- and c2-pawns are in trouble)...",
        "14. O-O-O": "...so I castle queenside to ensure that I don't lose my rook to the knight...",
        "14... O-O": "...and my opponent does so kingside...",
        "15. Nc4": "...so I advance my knight to threaten the bishop...",
        "15... Nf6 16. Nxb6 axb6": "...and we trade the pieces, but I have actually connected the queenside pawns...",
        "17. Kb1": "...and exposed my QRP to the rook, so I move my king closer to protect it...",
        "17... Ne4": "...but the knight is now eyeing up my pawn on f2, hoping to fork my rooks...",
        "18. Rhf1": "...so I protect the pawn with my kingside rook...",
        "18... Nd6 19. Rd3": "...and as the knight moves back, I can bring up a rook onto the third rank, hoping to exchange mine for my opponent's on a8...",
        "19... Nc4": "...but the knight reads this play, threatening the bishop...",
        "20. Rfd1": "...so I double my rooks on the d-file...",
        "20... b5": "...and as the pawn is coming at me...",
        "21. Ka1": "...I put my king in the corner to keep him close to the bishop and pawn...",
        "21... Ra4": "...and I look as though I'm in trouble here. My opponent is threatening my bishop, and now even a rook has come down to help out...",
        "22. a3": "...so I move up the pawn to allow my king more freedom...",
        "22... b4": "...but the pawn is now under attack from the knight and the pawn, and can't capture the latter, as it is keeping the king out of check from the rook...",
        "23. Ka2": "...so I move my king up to defend the pawn...",
        "23... Rb8": "...but I may be in bigger trouble here, as the other rook is threatening the b-file. I feel as though there's only one thing to do...",
        "24. Rb3": "...and that's cover with my rook. If the pawn captures on a3, the file will be open, and I'm hoping to do Rxb8 for a rank mate...",
        "24... Nxb2 25. Kxb2": "...and I use my king to complete the trade of my bishop for my opponent's knight, moving into another double-rook and pawn endgame. If I'd used the rook, my king would have been forced backwards onto his starting rank : 25. Rxb2 Rxa3+ 26. Kb1...",
        "25... bxa3+": "...and as expected I lose my a3-pawn, and my rook cannot recapture as it is keeping the king out of check...",
        "26. Ka2": "...so I move my king behind the pawn to stop its progress...",
        "26... Rxb3 27. cxb3": "...and we exchange a pair of rooks, and I used my pawn to recapture, so my king stays behind my opponent's pawn to guard the queening square. We now have a single-rook and pawn endgame, and I'm behing by a pawn, but I'm not completely lost...",
        "27... Ra8 28. Rc1": "...and now I line up the isolated pawn on c6 to attempt to get back on terms...",
        "28... Ra6": "...forcing the rook into a passive position, defending two pawns...",
        "29. b4": "...so I now advance the pawn on b4 to threaten it. I'm still hoping for a possible rank mate...",
        "29... f5": "...but my opponent reads this, by advancing a kingside pawn...",
        "30. Re1": "...so I line up the pawn that has lost its protection...",
        "30... Kf7": "...but the king moves forward to protect it, another prediction come true...",
        "31. Re3": "...so I advance my rook to line up the passed pawn on a3...",
        "31... Kf6": "...but this move surprised me. I was expecting 31... Ra4! which would have attacked my pawn on b4, forcing 32. Rb3, keeping the rook and b4-pawn in passive positions...",
        "32. Rxa3": "...so I therefore accept the troublesome pawn threatening to advance to my bottom rank, meaning that neither of us has any passed pawns, and it's level pegging once again.",
        "32... Rb6 33. Kb3": "I move my king to cover my pawn on b4, as he is the slower moving of the two bottom rank piece remaining, and he could also defend the one on d4, as there is an enemy pawn on the c-file...",
        "33... e5 34. dxe5+ Kxe5": "...but now there is only one queenside pawn remaining apiece, as I decide it's worth trading pawns, as my pawn was isolated and weak, and my opponent's was strong, as it was connected.",
        "35. Kc4": "I move my king onto the c4 square to restrict my opponent's king's movements, and to free my rook, giving it room to manoeuvre across the rank...",
        "35... Kd6 36. Rg3": "...and line up the KNP with it...",
        "36... g6": "...so it moves forward to be covered by its neighbour...",
        "37. Rh3": "...which is the next to be lined up...",
        "37... Rb7": "...so the rook retreats to cover it...",
        "38. Rd3+": "...and I decide to check with mine. I'm hoping to get a draw through threefold repetition...",
        "38... Kc7": "...and the king moves next to the rook...",
        "39. Re3": "...so mine moves to the next file, and I'm hoping to force the enemy rook off the board by checking on e7...",
        "39... Kd6": "...but my opponent reads this move...",
        "40. Rd3+": "...so I replicate this position a second time...",
        "40... Kc7": "...and my opponent does likewise to this position...",
        "41. Re3": "...and I do likewise to this position...",
        "41... Kb6": "...but my opponent moves the king to the other side of the pawn...",
        "42. Re6": "...so I threaten it with my rook. I'm hoping to advance mine to attack it, providing my opponent doesn't move the king away from the rank, as it is keeping the king out of check...",
        "42... Ra7 43. b5": "...and I do this. This may have been a bit dodgy, although 43... Ra4+ 44. Kb3 Kxb5 45. Rxc6 Kxc6 46. Kxa4 would give a pawn ending where we're still level...",
        "43... Rc7": "...but the rook moves sideways to defend the pawn...",
        "44. Rxc6+": "...and I decide to capture the pawn with my rook, as it is defended by my pawn...",
        "44... Rxc6+ 45. bxc6": "...so we can exchange the remaining rooks, giving a pawn ending...",
        "45... Kxc6": "...and my opponent recaptures, giving an even excahnge. Who's king is better placed? We both have three pawns left, on common files: f, g and h (all on the kings' side of the board, where their bishops, knights and rooks start). I thought to myself \"restrain the king, so he can't get to your pawns, and try to get yours in a position to threaten the enemy pawns\".",
        "46. Kd4": "So I move my king along the rank, so that if my opponent's king was to threaten my pawns, he would have to move the longer way round...",
        "46... Kd6": "...and he moves along the rank, too, to deny my king the quick route to threaten the pawns...",
        "47. f4": "...so I move up my bishop's pawn to blockade my opponent's pawn, and to deny the king access to the e5 square, should my own king move left...",
        "47... Ke6": "...and he moves towards the pawns to defend them...",
        "48. Ke3": "...but why did I move mine backwards, when Kc5 would have been more forceful? Maybe I was trying to defend mine, but my opponent's king could not move onto the e5 square...",
        "48... Kf6": "...but he stays within the pawns, to keep them protected...",
        "49. Kf3": "...and I do likewise to mine, but why did I not play the more forceful Kd5?",
        "49... h5": "The KRP advances two spaces...",
        "50. h4": "...so I do likewise to mine, to stop it.",
        "50... Kf7 51. Ke3": "I now decide that there's no way for the king to penetrate my pawns, so I move mine out...",
        "51... Kf6 52. Kd4": "...and I put him on the attack, to attempt to get in behind the pawns...",
        "52... Ke6 53. g3": "...but why did I advance my knight's pawn instead of playing Kc5? I didn't realise that my opponent's king couldn't move onto e5, because of my pawn on f4...",
        "53... Kd6 54. Kc4 Ke6 55. Kd4 Kd6 56. Kc4 Ke6 57. Kc5": "...but finally I see this possibility, and my king is now in a position to potentially threaten the pawns...",
        "57... Ke7 58. Kd5": "...and as the king moves backwards, mine can get a little closer to the pawns...",
        "58... Kf6 59. Kd6": "...and I move my king forwards to deny my opponent's access to the e-file...",
        "59... Kf7 60. Kd7": "...and do the same thing again. If the enemy king moves forwards (f6), I play mine to e8, if he moves backwards (f8), would I play mine to e6?",
        "60... Kf6 61. Ke8": "As my opponent's king stays close to his pawns, I move mine onto my top rank, hoping to threaten them. If my opponent plays Ke6, I play Kf8, while Kg7 would be followed by Ke7.",
        "61... Ke6 62. Kf8": "Now mine is in an excellent position to clear the enemy pawns. I my opponent plays Kf6, I play Kg8, If my opponent moves the king onto the d-file, I play Kg7, while g5 would be followed by hxg5, giving me a passed pawn.",
        "62... Kf6 63. Kg8": "Now my opponent is about to drop a pawn: if the king moves (the only options are e6 and e7), mine moves to g7, and the knight's pawn will disappear, either by Kxg6, or by f/hxg5...",
        "63... g5": "...so my opponent advances the knight's pawn onto its 4th rank...",
        "64. hxg5+": "...and I capture it with my rook's pawn, forcing the king to move, as it checks him, and now I am up by a pawn, and it is passed...",
        "64... Kg6": "...so the king moves in front, to stop its progress...",
        "65. Kh8": "...and I move my king, so I don't give away a pawn, or make an enemy one passed...",
        "65... h4": "...and as the rook's pawn advances...",
        "66. gxh4": "...my knight's pawn can force it off the board, to deprive my opponent of another queening opportunity, and to give myself another passed pawn...",
        "66... Kh5": "...and the king moves to close down the capturer...",
        "67. Kh7": "...and I move mine back to allow the protected passed pawn to move towards his protection...",
        "67... Kxh4": "...and although I lose my unprotected passed pawn...",
        "68. g6": "...my protected one is in the clear...",
        "68... Kg4 69. g7 Kxf4": "...and although I lose my other pawn...",
        "70. g8=Q": "...I am able to claim a faster queen, who can drop back to guard the f1 square, and get some help from the king to capture my opponent's last pawn, and to mate the king.",
        "70... Ke3 71. Qg2": "My queen moves back to cover the f1 square...",
        "71... Kd4": "...and as the king moves away...",
        "72. Qf3": "...she can now close the pawn down...",
        "72... Ke5 73. Kg6": "...and my king moves in to help...",
        "73... Ke6 74. Qxf5+": "...and she removes the pawn, so my king can help her close the king down...",
        "74... Ke7 75. Qf6+ Ke8 76. Qf7+ Kd8 77. Kf6 Kc8 78. Ke6 Kd8 79. Qd7#": "...and complete the mate."
    },
    "url": "https://gameknot.com/annotation.pl/60th-gk-tournament?gm=25683",
    "gameName": "60th GK tournament",
    "players": "aspiemikey (1416) vs. dgatenby (1327)",
    "opening": "Scandinavian defence, Lasker variation (B01)"
}