{
    "moves": {
        "1. c4 c5 2. g3 g6 3. Bg2 Bg7 4. Nc3 Nc6 5. e3 Nf6 6. Nge2 O-O 7. O-O d6 8. a3 Bg4": "Time wasting move no 1.",
        "9. f3 Be6 10. d3 a6 11. Rb1 Rb8 12. e4": "I'm trying to permanently occupy the D5 square with either a pawn or a knight.",
        "12... b5 13. b3 b4 14. Nd5 a5 15. a4": "Another tactic of the english opening is to trade the black bishop for the knight on F6.",
        "15... Bd7 16. Bg5 e6 17. Bxf6 Bxf6 18. Ne3": "I was happy to leave black with two cramped bishops rather than lose one of my best placed knights.",
        "18... Bd4 19. Qd2": "Black would have been better off to take the knight - rather than hold position. It is akward for me right now - but black makes a mistake...",
        "19... Qf6 20. Rbc1 Qg5": "Time wasting move number two.",
        "21. f4 Qe7 22. h3": "Another basic English opening tactic is to tuck away your king on H2.",
        "22... f5 23. exf5 Rxf5 24. Kh2 Rff8 25. Rfe1": "And so the plan is to reveal an attack on the queen with my castle. It proves to give me enough tempo to win the game. After this black is forced to react for the rest of the game.",
        "25... Nd8 26. f5 exf5 27. Nxd4 cxd4 28. Nxf5 Qf6 29. Ne7+ Kh8 30. Nd5": "And on to D5 - where we can observe to power of having an unchallenged knight.",
        "30... Qf7 31. Re7 Qf2 32. Rf1 Qxf1": "This move doesn't really need much explanation. Black knows the trouble he's in.",
        "33. Bxf1 Be6 34. Qh6 Rf7": "This was an unfortunate last minute blunder - which ends the game in a less dramatic way. I expected the knight to attack my queen by moving to F7.\n\nThen the follwing moves for mate would be:\n\n35.Nf6  -  35.Nh6\n36.Rh7++\n\nThere were many other variations, but they all ended roughly the same.",
        "35. Re8+": "Thanks."
    },
    "url": "https://gameknot.com/annotation.pl/60th-gk-tournament?gm=27138",
    "gameName": "60th GK tournament",
    "players": "e4_lunatic (1656) vs. wurmt (1802)",
    "opening": "English (A30), symmetrical variation"
}