{
    "moves": {
        "1. e4 g6": "A bit passive - allows me to get a big pawn centre. I like to play a Pirc - 1. e4 d6 2. d4 Nf6 (pretty much forcing  3. Nc3, so I can't play c4 first), although I tend to lose if white playes 4. f4",
        "2. d4 Bg7 3. c4 d6": "Necessary to play Nf6, otherwise e5 ?!",
        "4. Nc3 Nf6 5. Nf3": "The four pawns attack (5. f4) is a bit risky, so I develop.",
        "5... O-O 6. Bg5": "Putting pressure on the knight, and preparing to exchange the bishop",
        "6... Nbd7": "6. ... Bg4 is also worth considering",
        "7. Bd3 b6": "Maybe b7 is not the best square for the bishop. Preparing e5 might be better",
        "8. O-O Bb7 9. Qd2": "Planning to exchange his dark squared bishop. In these situations with black, I tend to play Re8 so that Bh8 preserves my bishop (but weakens h6)",
        "9... c5": "Allows me to block his light squared bishop",
        "10. d5 Re8 11. Bh6 e6": "Attacking my centre",
        "12. Rae1": "To support e4-e5",
        "12... exd5 13. exd5": "Opening the file",
        "13... Ne5": "Now after exchanges I get a protected passed pawn",
        "14. Nxe5 Rxe5 15. Rxe5 dxe5 16. Bxg7 Kxg7 17. Re1": "Threatening to win the pawn",
        "17... Qd6": "Not the best square for the queen. Nd7 may be better, as after f6 the pawn is well defended.",
        "18. Nb5": "Tempting, but maybe Ne4 is better, forcing the exchange of knights.",
        "18... Qb8 19. d6": "Based on a miscalculation, probably not the best move as it releases his bishop",
        "19... Qd8": " ",
        "20. Rxe5": "Now after 20. ... a6 21. Nc7 Ra7 (21. ... Rb8 is better) 22. Re7 Qxd6 23. Ne6+ Kg8 24. Qh6 I threaten mate on g7, because fxe6 opens the rook and Nh5 fails to Re8 - this is why Rb8 is better - so black has to sacrifice the queen. What I failed to notice was 1: black can capture on d6 after Nc7, and 2: after Nxa8, my rook is hanging. Maybe moving the bishop (Bc2) may be better, as the d6 pawn will be defended after a move of the knight.",
        "20... a6 21. Bxg6": "So I sacrificed the bishop. capturing it brings about the same lines (except the back rank mate doesn't work because of the rook on a8), and now my pawn is protected.",
        "21... axb5 22. Bxf7": "and after capturing the knight, black's king has no protection",
        "22... Kxf7 23. Re7+ Kg8": "Qxe7 may have been better, because this just loses to..",
        "24. Qg5+": "and checkmate next move"
    },
    "url": "https://gameknot.com/annotation.pl/65th-gk-tournament?gm=28778",
    "gameName": "65th GK tournament",
    "players": "no_genius (1461) vs. orhon (1633)",
    "opening": "Robatsch (modern) defence (B06)"
}