{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Nc3 Nf6": "Four Knights opening",
        "4. Bd3": "My opponent decides to go off the book with a very unusual and I would say weak move: it blocks the dark squared bishop and hinders Queen's mobility. The LSB does not do much here either. Both DSB and the Queen would be passive for the rest of the game. More natural would be Bc4, Bd5 or d4.",
        "4... Bc5 5. O-O O-O 6. a3 d6 7. b4": "Makes some room for the White's DSB and attacks Black's DSB.",
        "7... Bb6 8. Bb2 Nd4": "I decide to challenge the Knight Nf3, but probably it would be better to first go with Bg4.",
        "9. Nxd4 Bxd4 10. Rb1": "White prepares to move his Knight. ",
        "10... c6": "Blocking Nd5 and Nb5.",
        "11. Ne2 Bb6": "I do not want to exchange this Bishop because it is on the strong diagonal.",
        "12. c4": "A pawn push to free some space on the Queenside. ",
        "12... c5": "Not the best move, because now I am closing the a7-g1 diagonal. Better would probably be Ng4 followed by f5.",
        "13. b5": "My opponent reasonably decides not to open the diagonal for my Bishop.",
        "13... a6": "A proposal to open a-file for my rook..",
        "14. a4 Ng4": "Now that the Q-side is almost closed I finally decide to attack on the K-side. The intention is to go with f5 exf5 Bxf5.",
        "15. h3 Nh6": "I still want to play f5.",
        "16. Ng3": "Brings another defendant for the f5 square, but I still have more. What can White do instead? Probably f3 or g4?",
        "16... f5": "Here it goes.",
        "17. exf5 Bxf5 18. Nxf5 Nxf5 19. Qh5": "Threatening with Bxf5 followed by Bxh7.",
        "19... g6 20. Qe2": "The only sensible square to retreat. Another option would be Qf3, but it leaves a possibility of a discovered attack on the White Queen.",
        "20... Qd7": "I now want to start a pawn attack on the K-side, supported by two rooks.",
        "21. Be4": "White's LSB has now some space to breathe.",
        "21... Kg7": "Continuing my plan.",
        "22. d3": "Further strengthening the pawn wedge on the Q-side and freeing space to bring the DSB to defend K-side.",
        "22... Rfh8 23. Bc3": "Why not Bd1?",
        "23... h5 24. a5": "Now I see it: White wants to launch the pawn storm on the Q-side, but there is not much he can do there.",
        "24... Bd8 25. b6": "Better would be bxa6 bxa6 with a possibility of invasion on b7 or b6.",
        "25... g5 26. Bd2 Nd4": "My knight goes to the strong outpost with a tempo.",
        "27. Qd1": "The only square where the Queen still defends g4.",
        "27... g4": "Now the storm begins. hxg7 leads to opening of the h-file, wich is dangerous, and h4 is met with Bxh4 wich is no good either.",
        "28. Re1": "White wants to bring his rook to g3.",
        "28... Bh4": "Preventing h4",
        "29. Re3": "Supports the h3 pawn. I would prefer g3 in White's place.",
        "29... Raf8": "Bringing in another attacker and threatening a fork with Bxf2+.",
        "30. Be1": "Defending against the fork.",
        "30... Nf3+": "This move is, I think, the key move in the attack. If White takes with gxf3, he has the King open to the attacks through g-file and h3 pawn falls. If he takes with a rook, it falls to gxf3, but it is a correct move, because the h3 pawn will be free from attack. ",
        "31. Bxf3": "My opponent decides to take with the Bishop shielding the h3 pawn fron his own rook",
        "31... gxh3": "So the h3 pawn falls",
        "32. gxh3": "Again a mistake: better would be g3. gxh3 leaves the King exposed.",
        "32... Qxh3": "And now the King cannot escape to f1",
        "33. Bxh5": "Better would be Bg2",
        "33... Qf5 34. Bg4": "I would go with Qg4+ forcing the Queen exchange, because otherwise the White's King is still in the danger.",
        "34... Bxf2+": "Now White's King is doomed.",
        "35. Kg2": "Bxf2 is followed by Qxf2#",
        "35... Qf4": "Threatening Rh2+ Kf1 Bxe3+ Bf2 Rxf2+",
        "36. Rh3": "White does not have many options. Rf3 is met with Qxg3+ Kxf2 Rh2+ Ke3 Qd4# or Kf1 Qg2#. Qf3 leads to Rh2+ Kf1 Bxf3 Qxf4 Rxf4+ Bf2 Rxf2+.",
        "36... Rxh3 37. Bxh3 Qg3+": "The rest is forced.",
        "38. Kf1 Bd4+ 39. Ke2 Qe3#": ""
    },
    "url": "https://gameknot.com/annotation.pl/69th-gk-tournament?gm=31845",
    "gameName": "69th GK tournament",
    "players": "the_duke (1606) vs. vonzeppelin (1423)",
    "opening": "Four knights game (C46)"
}