{
    "moves": {
        "1. Nf3 d5 2. d4 Bf5": "After 1.d4 d5 2.c4 Bf5 we have the Baltic Defence, which is a radical way of black trying to solve the problem of the QB in the Queens Gambit. The idea is to play an early Bxb1, giving up the bishop for white's QN. I thought for a while about playing 3.c4; did I really want to allow 3...Bxb1? It leaves white with the two bishops, of course. I've never quite believed that they are as strong as they are made out if the beneficiary of such an exchange tries to utilise their power by simply 'opening the game up'. I've always thought that, certainly in the middle game, the player with the two bishops can benefit not so much because of the power of the pair of clerics, but because the opponent will probably struggle to defend the squares of the colour of the bishop they have given up. Usually, the player with the B and N will try to stick their pawns on the colour square of which they have no defending bishop. In this case, black would play an early e6 and c6; in a normal QGD or a Slav, they would be trying for the freeing moves e5 or c5; without the white-squared bishop that strategy MUST lead to white-square weaknesses. So a Baltic Defence-style plan must, logically, lead to a passive game.",
        "3. e3 c5": "Now this is very optimistic. If such freeing moves for black could be played as early as the third move in a major opening complex such as a reversed Queens Gambit Declined (after 'freeing' the QB with Bf5), then the advantage of the first move couldn't reasonably be considered an 'advantage'.",
        "4. dxc5 Qa5+ 5. Nc3 e6": "This has to be a mistake (see my previous note). Surely, black can't get away with something as wonderful (for the second player) as something like 6.Be2 Bxc5. I remember shaking my head at not seeing 5...Qxc5, which is a Queens Gambit Accepted in reverse; because of the extra move I'm sure that has to be good for white.",
        "6. Bb5+": "This is it! Now black has three choices, none of which are particularly appetising. 6.Bxd7 Kxd7 and black's king doesn't look particularly safe. Likewise, 6...Kd8.",
        "6... Nc6": "Probably the best option.",
        "7. Nd4 Nge7": "The KN supports its colleagues on c6 and f5, but now the black-squared bishop is blocked, delaying kingside castling. Queenside castling in such a position, because of white's advantage in development, would be dangerous.",
        "8. Bd2": "Played not so much with the idea of a discovered attack, but just simple development. 8.0-0 was fine, but it can wait a move. I fully expected my opponent to move his queen, but you never know . . .",
        "8... a6": "This is a mistake. It was essential to retreat with the queen to c7 or d8.",
        "9. Ne4": "9.Nxd5 wins a pawn, but leads to the exchange of a pair of minor pieces. This is stronger, as the knight jumps into d6 with check . . . and still a black pawn will fall.",
        "9... Qc7 10. Nd6+ Kd7": "10...Kd8 11.Nxf7+ and black loses at least the exchange (the knight might be able to wriggle out of the corner).",
        "11. Nxf7 Rg8 12. Ba4": "This is better than exchanging on c6.",
        "12... Kc8": "Black's king gets off the pin.",
        "13. Nd6+": ". . . but allows the white knight to return to d6 with tempo.",
        "13... Kb8 14. O-O": "Finally, it's time to castle. There was no way I would exchange the d6 knight for black's f5 bishop, and the a4 bishop is still a better minor piece than the c6 knight. The well-known American chess writer Jeremy Silman hammers on about minor piece 'imbalances' in a number of his books: he recommends constantly assessing your and your opponent's minor pieces. In this position, both white knights are superior to their counterparts, and white's white-squared bishop is better than its rival (which, although outside the pawn chain is hardly exerting any influence on the board). Black's other bishop is, I suppose, level with white's black-squared bishop (which is only operational on one diagonal right now). But black's bishop on f8 is a some way from being developed (it would actually love to take the d6 knight), and white's bishop on d2 would be a good minor piece on c3. All-in-all, the 'imbalances' hugely favour white. Incidentally, Silman makes the point in one of his books, that the main reason chess has remained such a great game over the centuries is because of the relative values (approx. 3 pawns each) of the bishop and the knight (which means they can be exchanged for each other during the game), and, because of that, the game lends itself to rich strategic themes involving the trading of the minor pieces in order to achieve positional advantages. He's an excellent writer (a sort of John Watson lite!). The other writer worth looking at is Jacob Aagaard (Excelling At Chess, Everyman, is his masterpiece . . . particularly good stuff about rook endings). Now, back to the game . . .",
        "14... g5": "Black is two pawns down and this pawn move looks attractive . . . maybe to be followed by g4 then h4.",
        "15. g4": ". . . but this thrust halts the pawn storm and forces the bishop to move away from the defence of the e6 pawn.",
        "15... Bg6 16. Nxe6 Qd7 17. Nd4 b5": "Black plays b5, safe in the knowledge that 18.cxb6 leaves the d6 knight hanging. The drawback, of course, is that the b5 pawn (sitting three squares in front of the black monarch) soon becomes an object of attack.",
        "18. Bb3 Ne5 19. a4 Nxg4": "19...Qxg4+ leads to a queen exchange, but black goes into a queenless middle game three pawns down, which is hopeless.",
        "20. axb5 axb5 21. Rxa8+ Kxa8 22. Qa1+": "White's last three moves are entirely logical. There is now hardly any cover in front of the black queen, especially considering that the b5 pawn is doomed.",
        "22... Qa7": "The queen comes to the defence of her consort. I spent quite a bit of time considering this position before realising that it would be rather nice to be able to drop the d4 knight into c6. The knights on d6 and c6 plus the pawn on c5 would mean that black's king was stuck on the a-file.",
        "23. Bxd5+": "This is the key move. If black recaptures 23...Nxd5 then 24.Qxa7+ Kxa7 25.Nxc6+ and mate follows next move (26.Ra1++) after either 25...Ka8 or 25...Ka6.",
        "23... Kb8 24. Qxa7+ Kxa7 25. Ra1+": "I originally was going to play 25.Bxg8, which wins a rook because if 25...Nxg8 26.Nc6+ followed by immediate mate on the a-file. That's a clear win, of course. But was there anything better? It took me about 30 minutes to find the combination (not sure I'd have worked it all out over the board, but there you go). It's quite an easy winning combination, but easy to overlook . . .",
        "25... Kb8 26. Ra8+ Kc7 27. Nd6xb5+": "This was the move that's not so easy to find, simply because it's a backward knight move, when every part of me was trying to work out a win with 27.Nd4xb5+",
        "27... Kd7 28. Be6#": "The d4 knight remains on d4 and not b5, which means e6 is protected. I was kind of surprised how quickly I won this game. Obviously I was helped by black's decision to leave his queen on a5 after 8.Bd2, black playing 17...b5, weakening the defence of the king, and, finally, 19...Nxg4, refusing the chance to exchange queens. But, in my opinion, it all started far earlier, trying to get more out of the opening than it really is feasible to expect when playing black (unless you're willing to be black in a Botvinnik Semi-Slav!)."
    },
    "url": "https://gameknot.com/annotation.pl/70th-gk-tournament?gm=32134",
    "gameName": "70th GK tournament",
    "players": "sligunner (2082) vs. denish (1753)",
    "opening": "Reti opening (A06)"
}