{
    "moves": {
        "1. e4 e5": "I had begun looking at krkofbutlers previous games and looking at how he plays, trying to establish a theme or style within his game. I saw that in most of his games, he always goes for the conventional openings on d3, e3, d4, or e4 or using Kb3 and Kf3. It was then i decided to also use a more common opening, aiming to throw a few unusal moves in as the game went on..",
        "2. Nf3 Nf6 3. d3 d5 4. Nxe5 dxe4": "Simple exchange, leaving him slightly more positionally advanced",
        "5. Nc3 Bd6 6. Nc4": "Although I didnt want to retreat the knight off e5, it would mean a more conventional Bf4, which takes the middlegame into a basic, standard route, and that as mentioned before was not my intention. It's at this point i determined to attempt to put my opponent into a position on the chessboard that he had never seen.\n\nWhile I'm no master at naming certain openings or plays, or even strategies, I could see from this point, that the game could easily take a turn, where simply setting up an attack and/or exchanging pieces was not going to get either player anywhere, forcing the situation so, that, the first to make a mistake, would be the one that loses, not the one that outsmarts the other.",
        "6... b6": "Once again, not a move a grandmaster would likely tell someone who isn't an advanced player to attack with, but it was with a long-term goal in mind. A simple b5 or Bg4 would have been too blatant for the opponent, and the goal of this match was to surprise him into over thinking, and/or making a fatal error",
        "7. dxe4": "Simple pawn take..",
        "7... Ba6 8. b3": "Nice move by white, opening up the c bishop, and allowing the f bishop to move freely as he pleases, knight being covered. Maybe not the best move, but I saw it a good choice by the opponent.",
        "8... O-O": "Castle Kingside",
        "9. e5": "When i saw this, it simply frustrated me. I'm usually a player that will play to a plan, and whilst doing so, overlook the more simple, subtle plans and fall for them. Took me a few mins but I soon found a way out of it, and also a way to equalise the material",
        "9... Bxc4": "I had a strong feeling he wouldnt use his b pawn to take me, that would make awkward positional play, plus its a free chance to develop the c bishop",
        "10. Bxc4": "Does as predicted, and the material becomes even after be5",
        "10... Bxe5": "Not only is there the threat of bc3, but also the Kingside there with the 3 pawns and Rook undeveloped, is looking very bare, so its towards that corner, I prepare for my assasult....Even if O-O was to be the next move, both Kng4, and Qd6 both start to really make the King think about the position over in the King's corner.\n\nIt was also at this point where the aforementioned \"over thinking\" came into play i would say. He is deliberating about the Bc3 fork, the Bishop and Knight combining to come together towards the King's side, and also the blatant Queen threat, and just overlooked the next move.",
        "11. Qxd8 Rxd8": "Simple Queen exchange, something a man in his position i didnt think he would go for.",
        "12. g3": "Misses the Bc3 move, probably anticipating a Kng4 move or something to that effect",
        "12... Bxc3+ 13. Kf1 Bxa1": "Game starting to look really bleak for white now. The only possible outcome in my opinion would be to attempt to trap the Black bishop on a1, therefore gaining some material in an attempt to try gain any momentum in the game.",
        "14. Kg2 Ng4": "Progression with the horse in order to begin the endgame",
        "15. Bg5": "I liked this move and was one i overlooked. It threatens both Ba1, and Rd8. f6 cannot be played because of whits bishop on c4, and even a h6 attack on the g5 bishop would still result in losing the rook..",
        "15... Bf6": "Thats when I saw this, and was pleased to do so. It is probable this was the only way out of actually going down a piece..",
        "16. f3": "Tries threatening my Knight, as for the reason, I couldnt see a strong reason for it.",
        "16... Bxg5": "Leaves the bishop open without a defender, so thats the obvious move. I was expecting to lose the Knight here, but I went with the simple theory that Bishops are better in the endgame (in theory) than Knights",
        "17. Rf1": "Setting up 18. f4 19.f7? Still obvious and simple to remove the threat, but also mistakenly forking his Rook with his King, setting me up with another free Rook with Ne3+",
        "17... Ne3+": "There is it, and it was clear from here (although highly probably earlier on) that the game was now over, and it was only a matter of time",
        "18. Kg1 Nxf1 19. Kxf1 Nc6 20. f4 Rd1+ 21. Kf2 Rd2+ 22. Kf3 Rxc2": "Up until here I thought it would be interesting just to experiment and try to remove some of the pawns, and not go for a default straight checkmate, purely out of interest",
        "23. Bb5": "Again another mistake, and my 3rd fork of the game.",
        "23... Nd4+": "Fork with the b5 bishop",
        "24. Ke3 Nxb5 25. fxg5": "Finally lose the bioshop but its altogether too late for my opponent now.",
        "25... Rxh2": "With this the opponent surrenders, avoiding further embarassment? More like not wanting to continue to suffer. A well played game, but one in which I thought I had the momentum pretty much from the get-go.\n\nAny comments or advice will be greatly appreciated :)"
    },
    "url": "https://gameknot.com/annotation.pl/76th-gk-tournament?gm=35441",
    "gameName": "76th GK tournament",
    "players": "krkofbutler (854) vs. sacul219 (1123)",
    "opening": "Petrov's defence (C42)"
}