{
    "moves": {
        "1. e4": "My usual opening",
        "1... c5": "my opponent starts with sicilian defence...this is rare for me, because most players of my rating just go with simple  e5",
        "2. f4": "Grand Prix attack, I remember as one grandmaster in TV said, that this is best option to go for tactically rich game...as my opponent is stronger than me I humbly thought that he will outplay me in quiet positinal game, so maybe this opening could give me some extra opportunity to win...",
        "2... d6": "Don't have any opinion why this move (I would be grateful if someone leaves thoughts behind this move)...I was tempted to play Bb5+ but I decided to go with developing moves",
        "3. Nc3": "another gun targeting b5",
        "3... Nc6": "he continues with regular developing move",
        "4. Bb5": "ok, so now I do it",
        "4... Bd7": "now defending knight and not allowing double pawns on c file",
        "5. e5": "here I start, I'm not sure that this move is good, but I decided that isolated pawn on c file will be very weak later. also, I'm really waiting for some comments on this move by stronger players...thanks in advance",
        "5... dxe5": "accepting my offer",
        "6. fxe5": "continuing trading",
        "6... Nxe5": "so now I'm a pawn down...another reason I agree with being pawn down is that it allows me to control f file with my rook. in past whenever I did this, for example in kings gambit openings, I had a lot of attacking opportunities.",
        "7. d3": "opening some space for my bishop",
        "7... e6 8. Nf3": "getting ready to castle and control f file with my rook",
        "8... Nc6": "he chooses to go back, not the best option it seems, since it keeps bishop binded",
        "9. O-O": "just continuing with my plan so far.",
        "9... a6 10. Bc4 b5": "he continues to chase my bishop...",
        "11. Bb3 Be7 12. Qe2": "gaining more space",
        "12... h6": "stopping my horse to approach g5",
        "13. Qf2": "threatening easy mate on f7",
        "13... Nf6 14. Qg3": "attacking g7",
        "14... g5": "my opponents both sides are weakened and his king is really restricted with space, so at this moment I decided to start attack on the kingside",
        "15. Bxg5": "couldn't find anything better,intuitively I felt that with proper and accurate defence he will be able to secure  his king...but nevertheles I went for it",
        "15... hxg5 16. Nxg5 Nd4": "this move made me think very hard, between this and previous moves there was a gap of few days and suddenly I don't know what I want to do:((  and my queenside also in trouble....",
        "17. Nge4": "I decided to open g file for my Queen.",
        "17... b4 18. Qg7": "attacking rook and eventually packing the king",
        "18... Rf8": "so now I have a chance to win a piece back for a while...",
        "19. Nxf6+ Bxf6 20. Rxf6 Nf5": "crucial point...",
        "21. Rxf5": "oooooooow, crushing move, I really feel that he overlooked this move, as I did at first glance. can not take with pawn because then AROOK will come and bring some big butthurt to black king there...and at my calculations eventually it could lead to mate there",
        "21... bxc3 22. bxc3": "must take, don't want to deal with promoted pawn later",
        "22... Qb6": "probably the best move for black, now black is safe to grab my delicious rook...hmm, so I start another attack",
        "23. Bxe6": "bringing fire to slowly dying attack",
        "23... Bxe6 24. Re1": "pinning again",
        "24... Kd7 25. Qe5 Bxf5": "I think this was mistake, before this move black somehove could survive",
        "26. Qxf5+ Kc6 27. Qf6+ Kb5 28. Rb1+": "and my opponent resigned here. Thanks for your visit, feel free to leave comments."
    },
    "url": "https://gameknot.com/annotation.pl/80th-gk-tournament?gm=38549",
    "gameName": "80th GK tournament",
    "players": "4erkez (1431) vs. softouch (1670)",
    "opening": "Sicilian (B21), Grand Prix attack"
}