{
    "moves": {
        "1. e4": "This was an interesting game, but it started with this common move.",
        "1... e5": "and a common response",
        "2. Nf3": "I like the kings knight opening.  It develops a piece as well as results in me guarding 4 critical squares, one of which is occupied by that black pawn.",
        "2... f6": "kings knight might result in a response like this, but it weakens kings side for black.  If black was worried about losing the pawn, Nc6, Qe7, or Bd6 would have done the job and developed a piece.",
        "3. d4": "probably could have just taken that pawn and pull the queen out on that weak king side, but ill get there in a bit",
        "3... d6": "and now blacks queen and bishop are virtually trapped.",
        "4. c3": "so that might be a nice place to attack from",
        "4... g5": "hmm... seems to weaken that side more ",
        "5. Bc4": "im dnoe with this pawn moving game, lets get this thing started.  I was thinking about creating a skewer with Qb3.  possibly getting his knight and rook for a bishop...",
        "5... Ne7": "but he beat me to it, and moved his first significant piece but it was only to the 2nd row.",
        "6. Bxg5": "now this may not have been the best plan, but here's my thought:  If he doesn't bite at the bishop than I take a free pawn,  If he does take it, read on...",
        "6... fxg5": "he bit",
        "7. Nxg5": "set myself up for some dinner... anyone have a fork?",
        "7... Nd5": "oh you want to take my knight?",
        "8. Qh5+": "I have different thoughts",
        "8... Kd7": "the other option resulted in checkmate",
        "9. Nf7": "Oh great a fork! let's eat!",
        "9... Qf6": "so he can take my knight...",
        "10. Nxh8": "still worth the trade.",
        "10... Qxh8": "no sweat... hey what's that horse doing outside of its corral?",
        "11. Bxd5": "i wrangled him... and now im thinking 'how do i end this thing mercifully?'  the end game has been my struggle of late.  ",
        "11... exd4": "he's going to survive for awhile on that diagonal",
        "12. cxd4": "i probably took that pawn one move too soon.  this would have been a good time to castle... I know many of you would say I should have done that a long time ago.  ",
        "12... Qxd4": "so he wants my rook, but can i keep him in check for awhile? ",
        "13. Qf7+": "yes, at this point i have a pretty good idea about this.   Look what happened to the king side!  whites strategy was disastrous",
        "13... Be7": "i figured...but my plan allows for this",
        "14. Qe6+": "ooo... move it, kingy!",
        "14... Kd8": "keeps the bishop safe",
        "15. Qg8+": "third straight check, but its gotta end soon",
        "15... Kd7": "all those checks did was move my queen into position...",
        "16. O-O": "now lets take care of this rook situation... oh yeah and keep my king safe",
        "16... Qxb2": "just as i thought, but this will benefit me more than him...",
        "17. Nc3": "bait set... ",
        "17... Qxc3": "taken! now I will pin that queen to the king... what?  their not lined up?",
        "18. Be6+": "looks like I still have some work to do.",
        "18... Kc6": "no problem.  now theyre lined up",
        "19. Rfc1": "pin.  I chose the king side rook because with Qe8 the kings only escape is the b file and queens rook is still available to strike from there.",
        "19... Qxc1+": "sacrifice.  i have to admit, i would have felt pretty hopeless if i was black at this point.",
        "20. Rxc1+": "my only move",
        "20... Kb6": "he's just on the run now",
        "21. Qxc8": "finally ended the bishops game.  I imagine him staring in the face of my queen, all the time watching this happen to his king.  Sad.",
        "21... c5": "probably would have taken that pawn next if not for this move.  So how do I end this?  im sure ive already missed a forced mate right?  ",
        "22. Rb1+": "another check, this will trap him on the a file",
        "22... Ka6": "could have extended his life a little longer with Ka5, but its inevitable now",
        "23. Qxb7+": "only one option from here",
        "23... Ka5": "thats it!  nice game...",
        "24. Qb5#": "oh yeah, now that's it.  Kind of a short game, but an interesting attack.  remember it started with that sacrificed bishop. ok, who wants to play? "
    },
    "url": "https://gameknot.com/annotation.pl/81st-gk-tournament?gm=38833",
    "gameName": "81st GK tournament",
    "players": "mastachyra (1235) vs. ethcurt (996)",
    "opening": "Damiano's defence (C40)"
}