{
    "moves": {
        "1. c4": "The result of this match wasn't much of a surprise, since my rating was over 250 points higher than my opponent. I like it solely for the checkmate that I pulled off. Apart from that I made a ridiculous error during the end of the opening stage of the game. I'll point out why I made certain moves after that point.",
        "1... e6 2. g3 c6 3. Bg2 Qf6 4. Nc3 Bc5 5. e3 Bb6 6. Nge2 Na6 7. O-O Nc5 8. d4 Na6 9. c5 Ba5 10. f4 Bxc3 11. Nxc3 h6 12. a3 Ne7 13. e4 g6 14. e5 Qg7": "At this point, I felt that my position was too dominating to lose. But I made an error in not completing the development of my pieces and instead focused on pawn territory.",
        "15. Ne4 Nf5 16. Nf6+ Ke7 17. b4 Nc7 18. Qd3 Nd5 19. Ne4 h5 20. h4 a5 21. Bd2 b6 22. Kh2 Ba6": "Such an obvious move. I simply wasn't paying attention.",
        "23. Qb1": "I put my queen here so that I could take back F1 and get it back in a threatening position. Other options would require me to have to move again to avoid one of the black knights.",
        "23... Bxf1 24. Qxf1 Nxd4 25. cxb6 a4 26. Qf2": "My plan at this point is to take advantage of the badly positioned king and take the weak D7 pawn.",
        "26... Nb3 27. Rd1": "To that end I positioned my castle on D1. It helps that I moved it here in response to attack, so its purpose wasn't too obvious.",
        "27... Rhb8 28. Be3 Nxe3 29. Qxe3 Ra6": "This is an obvious blunder.",
        "30. Qd3 Raxb6 31. Qxd7+ Kf8 32. Nf6": "This is to prevent the king from escaping behind the queen. There are many responses to this, but all of them lead to eventual checkmate.",
        "32... c5": "This avoids the following line:\n\n            \t        ...R6b7\n33.\tQd6+\t...Re7\n34.\tQd8+\t...Rxd8\n35.\tRxd8+\t...Re8\n36:   Rxe8++",
        "33. Qd8+ Rxd8 34. Rxd8+ Ke7 35. Re8#": ""
    },
    "url": "https://gameknot.com/annotation.pl/84th-gk-tournament?gm=42409",
    "gameName": "84th GK tournament",
    "players": "e4_lunatic (1704) vs. branstyjack (1439)",
    "opening": "English opening (A13)"
}