{
    "moves": {
        "1. d4 e5": "Black plays an unusual response to my first move, presumably trying to get away from the \"book\" lines.",
        "2. dxe5 d6": "Now I have a chance to cement an early material advantage without falling behind in development.",
        "3. exd6 cxd6": "The preliminaries are over...",
        "4. e4": "...and the game proper begins. With both center Pawns out of the way I can develop quickly.",
        "4... b6 5. Nc3": "Aiming at Q5. As long as I can prevent ...P-Q4 my KP will give me a space advantage in the center.",
        "5... Bb7 6. Bd3": "Adding support to the KP.",
        "6... Nf6 7. Bg5": "Developing with a pin.",
        "7... Nbd7 8. Nf3": "Preparing to castle...",
        "8... Be7 9. O-O": "...and I do.",
        "9... Qc8 10. Nd4": "Looking to centralize the Knight...",
        "10... d5 11. exd5": "..but first I have to deal with Black's Pawn thrust....",
        "11... Ne5 12. Nf3": "...and now I want to exchange and get *Black's* knight out of the center.",
        "12... Nxf3+ 13. Qxf3": "Down 2 Pawns, Black obligingly exchanges for me, bringing my Queen out without loss of time. ",
        "13... Qd8 14. Rfe1": "Pinning the B and virtually forcing Black to castle.",
        "14... O-O 15. Qh3": "With Black's K where it is, if I can just get rid of his Knight I could play QxP mate. H'mmm...",
        "15... Bc8 16. Qh4": "Black doesn't see my threat. He thinks I merely moved the Q to get it out from the Bishop's fire.",
        "16... a5": "Now mate or serious material loss is inevitable. 16... P-KR3! drives the QB and kills the mate threat.",
        "17. Bxf6": "Black can play 17... P-R3 [or 17... P-N3] stopping the mate, but after 18 BxB forking Q and R he would be hopelessly behind in material. 17... PxB still falls to 18 QxP mate. 17... R-K1 merely delays it by a move [18 QxP ch K-B1 19 Q-R8 mate.]",
        "17... Bxf6": "Not seeing the threat, he completes the exchange of minor pieces.",
        "18. Qxh7#": "The curtain falls."
    },
    "url": "https://gameknot.com/annotation.pl/87th-gk-tournament?gm=41642",
    "gameName": "87th GK tournament",
    "players": "last_archimedean (1322) vs. strangequark8 (1149)",
    "opening": "Queen's pawn (A40), Englund gambit"
}