{
    "moves": {
        "1. d4": "My opponent soon had his queen cornered after a few repeated moves with it, I pushed a pawn in a speculative hunt to the queen, but then my opponent blundered and eventually lost his queen, his uncoordinated pieces allowed me to sacrifice my queen to force a promotion in a better position and proceeded to mate his exposed king... forcing his resignation ",
        "1... Nf6 2. c4 g6 3. Nc3": "King's Indian defence, 3.Nc3 ",
        "3... c5 4. d5 d6 5. e4 Bg7 6. h3": "I have mores space and black's light squares bishop is out of play but on the other hand his dark squares bishop is in a great diagonal, I must be careful with it at all time",
        "6... Qa5 7. Bd2 Qb6": "N we were following the game Belotelov Dmitriy (RUS) - Farago Sandor (HUN), Budapest (Hungary), 1999, 1/2-1/2, but black chose to diverge from it",
        "8. Qc2": "to defend b2 and e4",
        "8... O-O 9. Nf3": "develops and adds some control to d4 and e5",
        "9... e6": "?! I have my doubts about this move, at this time, as it weakens d6, although challenges my centre, also black's dark squares arround his king are now also weaker than before e6, black needs a6 to prevent Nb5, so to sum things up black is not better after e6",
        "10. Bd3": "continues development and add another defender to e4 freeing both my knight and my queen to other tasks",
        "10... exd5 11. cxd5": "I prefer an asymmetric structure for lesser chances of drawing, My assessment of this position as equal, although I have more space, black has a great outpost on d4 in case it can be occupied, a hard task due to my pawns set-up, Black needs Na6-c7-b5-d4 to do it, also his dark squares bishop has an open diagonal almost free, but on the other hand the light squares bishop is a bit out of play, it might even became exchanged, white has some piece play, and the initiative, plus a promising e5 pawn break, a king side pawn storm, or a minority attack on the queen's wing",
        "11... Na6 12. a3": "denying black's knight the access to b4, the idea now is to play Na4 to remove the queen from the defence of the knight and then maybe Bxa6 to disrupt black's pawn structure",
        "12... Bd7": "Na4 not possible for now",
        "13. O-O Rac8 14. Be3": "pinning c5 to avoid black's temptation to push it foreword ",
        "14... Qa5": "removes the pin so maybe that push b4 was black's idea",
        "15. Qe2": "threatening to get the knight and disrupting black's pawn structure when black recaptures",
        "15... Nc7": "? blocks the queen, and allows some tactics",
        "16. b4 cxb4 17. axb4 Qxb4 18. Rxa7": "now if Qxc3 white has Bd4 attacking the queen, Queen moves to the b column, and Rb1 wins it ",
        "18... Na6": "! blocks my rook",
        "19. Na2": "to remove the knight from danger with tempo",
        "19... Qb3": "? better was Ra3 or Ra4, the played move allows white to get his f rook to the b column with tempo",
        "20. Rb1 Qa3 21. Rbxb7": "doubles rooks on the 7th rank, a promising strategic theme",
        "21... Rca8 22. Bxa6": "wining some material, black left hanging",
        "22... Rxa7 23. Rxa7": "and now threatens Bc4 wining the queen",
        "23... Ba4": "?? loses another piece",
        "24. Bb5": "the bishop is pinned so is captured by this simple tactics",
        "24... Bxb5": "?",
        "25. Qxb5": "and the queen is finally trapped",
        "25... Qxa7 26. Bxa7 Nxe4 27. Bd4": "being a piece and Q vs R up, now I'll try to exchange as many pieces as I can",
        "27... f6 28. Qd7": "to get to e7 threatening Ne4 and d6",
        "28... Kh8 29. Qe7": "now the knight is going to be exchanged anyway",
        "29... Nc5 30. Bxc5": "and I'll get the d pawn as well, and then I'll regroup my knights so they can be easily defended",
        "30... dxc5 31. Qxc5 h6 32. Nb4": "to achieve better coordination and promote my d pawn I'll regroup my pieces in the centre board",
        "32... Ra8 33. d6": "blocks the threat Bf8, due to Bf8 Nc6 Rc8 d7 Bxc5 dxc8=Q+ and the queen reappears on c8 ",
        "33... Bf8 34. Nc6": "blocks the c column and protects the promotion square, while threatening Ne7",
        "34... Ra1+": "this is just desperation as it achieves nothing... Rd1 Nd4 blocks the rook",
        "35. Kh2 Rd1 36. Nfd4": "blocks the rook of the d8 promotion square",
        "36... Rd2 37. d7": "!! and now sacrifices the queen to promote with check",
        "37... Bxc5 38. d8=Q+ Kh7 39. Qd7+": "now black can't avoid mate, it's just a question of how... my moves are Qd7+ Qe8+ (or QxBe7+ Qf8 Ne6) Ne6+ and mate can only be delayed by giving up pieces",
        "39... Kh8 40. Qe8+": "Black can:\n- block with Bf8 to lose yet another piece Qxf8+ Kh7 Ne7 h5 the most stubborn Qg8+ Kh6 Ne6 Rd8 Qg7++\n- move the king, Kg7 Ne6+ Kh7 Qf7+ Kh8 Qg7++\n- move the king, Kh7 Qf7+ Kh8 Ne6 Rd7 Qxd7 Kg8 Qe8+ Bf8 Qxf8+ Kh7 Qg7++",
        "40... Kh7 41. Qf7+ Kh8 42. Ne6": "bringing in the knight for the kill",
        "42... Bd6+": "a delaying move",
        "43. f4": "after several conditional moves, my opponent found the one I didn't cover, to turn things a little more interesting, I've now made 24 conditionals of about 40 possible one (I decided to delete a few, to test if he can find which are the ones I didn't cover now)... it will be mate soon, or will he resign?"
    },
    "url": "https://gameknot.com/annotation.pl/87th-gk-tournament?gm=41511",
    "gameName": "87th GK tournament",
    "players": "kaspanatola (1850) vs. dgrandman (1710)",
    "opening": "King's Indian defence, 3.Nc3 (E61)"
}