{
    "moves": {
        "1. e4 e5": "Decided to play Kings Pawn as opposed to the Sicilian, which is what I more commonly play.",
        "2. Nf3 Nc6": "Queen's knight (book)",
        "3. Bc4": "Queen's knight (book)",
        "3... h6": "Queen's knight (book)",
        "4. a3": "He leaves the opening book. I assume to limit the mobility of the Queen's Knight as it is the only major piece I have as yet developed.",
        "4... Nf6": "Nf6 Applies pressure to the pawn at e4.",
        "5. d3": "Removes the threat on pawn at e4.",
        "5... d5": "I decided to aggressively contend for the center. I was expecting 6. exd5, Nxd5, 7. Bxd5, Qxd5. ",
        "6. exd5 Nxd5 7. h3": "Instead of Bxd5, white plays h3. I was not sure the rational for this move, perhaps just to prevent Bg4, pinning the knight in place?",
        "7... Be6": "I instead slide the bishop behind the knight. Having the bishops at e6 and d6 is a comfortable position for me. ",
        "8. Ba2": "White's retreat to a2 allows me to comfortably develop in the center.",
        "8... Bd6": "It also has opened up the kingside castle, should I choose to.",
        "9. c4": "c4 - threatens the knight at d5. My options are: Nb6, Nf4, Nf6. I did not want to return the knight to f6 and allow white to pressure on the queenside. I avoided b6 because I really wanted to attack white's kingside and b6 would put the knight out of position. Therefore I decided on Nf4.",
        "9... Nf4 10. Bxf4": "White takes the Knight. ",
        "10... exf4": "White has forced the exchange. Material is even. At this position, I feel that the neither of us has an clear advantage. (which I am fine with when playing black, 10 moves in)",
        "11. Nc3": "White develops the queenside Knight. ",
        "11... a6": "a6 is designed to limit the Knight's mobility. I probably should have moved Bc5",
        "12. O-O O-O": "Matching Castles. I was actually hoping he would castle. I wanted to attack behind the castle and use the positioning of the bishops to my advantage.  ",
        "13. Qc2": "I'm not sure what white's plan is here. Perhaps he was thinking along the same lines and was looking to apply pressure to the castled king. ",
        "13... Qd7": "The knight on f3 was a little annoying so I moved the queen up to attempt bypass its zone of control. ",
        "14. Kh2": "Kh2?! Intersting move. This was not what I expected, but it did stop me from Bxh3 15. gxh3, Qxh3 which I was considering.",
        "14... Rad8": "Rad8?? I have no idea what my rational for this move was, probably just wanted to get it off the edge of the board. I think I should have gone Ne5 to try and force a swap with the pesky knight on f3. The good news is this rook is a lifesaver later in the match. ",
        "15. Rad1": "White responds symmetrically ",
        "15... Bf5": "Again, I probably should have played Ne5.",
        "16. Qc1": "White removes the pin on d3.",
        "16... Ne5": "Now I finally play Ne5.",
        "17. Nxe5 Bxe5": "White decided to swap. I now have a discovered check if I move the pawn. Material is again even. ",
        "18. f3": "White sees the potential and blocks the f4 pawn. ",
        "18... Qe6": "Qe6 was to allow me to pressure whites d3 pawn. ",
        "19. Nd5": "White impedes my rooks movement and removes the threat on d3. ",
        "19... c6": "My expectations: c6 should force Nb4, which I could pressure with a5 and force Nc2 and allows me to capture the pawn at d3. ",
        "20. Nxf4": "Nxf4?! Blunder. White takes the pawn but hangs the Knight.",
        "20... g5": "Pin",
        "21. g3 gxf4 22. gxf4 Bc7": "I could have moved Bg7 which protects the king from the empty file. However, I wanted to keep the pressure on the diagonal. ",
        "23. Rfg1+": "expected: forces the king into the corner. ",
        "23... Kh7 24. Rde1": "White threatens my queen. ",
        "24... Qd6": "Moves queen to safety and applies pressure to f4.",
        "25. Re5": "Threatens the bishop a f5. removes the pressure on f4. ",
        "25... Qxd3": "Qxd3?! Mistake. I thought this move to be exceedingly clever when I made it. It threatened the rook, protected my bishop and won me a pawn. I did not realize it also put my queen on the same diagonal as the king... ",
        "26. Rxf5 Qxf5": "At +4 in this position, I was thinking this was a won game. ",
        "27. Bb1": "White springs the trap. At this point I realized that 25. Qf6 was the correct move to protect the bishop and threaten the rook.\n\nI have only one option here, the rook on d8 turns out to be very helpful.",
        "27... Rd3 28. Qf1": "Qf1. White steps into the forced mate. Qf1 leads to 28...Qxf4+, Rg3 Qxg3+, Kh1 Qh2# and checkmate. White really should have taken the rook. It would have allowed white to get back into the game. ",
        "28... Qxf4+": "Comments are appreciated. "
    },
    "url": "https://gameknot.com/annotation.pl/89th-gk-tournament?gm=42826",
    "gameName": "89th GK tournament",
    "players": "rtfen (1650) vs. emf817 (1493)",
    "opening": "King's pawn game (C50)"
}