{
    "moves": {
        "1. d4 f5": "Signs of the struggle to come. My opponent is a steadfast partisan of the Dutch and never misses an opportunity to defend its honor; for my part, the Dutch is one of my absolute favorite openings to play *against*.",
        "2. Nc3": "The Veresov Dutch – while 2. Nc3 generally leads to a quiet game against most Black set-ups, against Dutch it is a sharp and ambitious line. White intends to play e4, with a sort of mirror-universe Sicilian position. Black has the option of preventing this with …d5, but that has its own dangers, as we will see.\nMy opponent knew very well that I like to play this line against the Dutch, having suffered against it several times, and so he came prepared this time…",
        "2... Nf6 3. Bg5": "To make way for e4.",
        "3... d5": "This is Black's last chance to definitively rule out e4. In doing so, however, he commits himself to weakening the light squares in his position, locking in the light-squared Bishop, and allowing doubled f-pawns.\nThe alternative …e6 allows White to take over the center right away. The famous game Ed. Lasker vs. G. A. Thomas is an excellent example of the dangers Black faces in this type of game: http://www.chessgames.com/perl/chessgame?gid=1259009",
        "4. Bxf6 exf6 5. e3": "Let's take stock of the position: Black has complete control over the e4 square as well as the Bishop pair. At the same time, White is ahead in development and has the f-pawns as a target. Black's Bishop pair is unlikely to be of much use in this closed position, but on the other hand White has blocked the c-pawn and so the usual c4 pawn break will be harder to organize than usual. White's plan, at its simplest, is to play Bd3, Qf3, and Nge2 to pressure the f-pawns, and then to further weaken them with either h3-g4 or h4-h5. This plan does not pan out so well in this game, so an example of how powerful it can be seems in order: Browne vs R. Byrne, 1977 (http://www.chessgames.com/perl/chessgame?gid=1333279) was the game that first persuaded me to give this variation a try.",
        "5... Be6 6. Bd3 Nc6": "!? An interesting deviation from the more usual …c6. There is only one other instance of this move in the DB, but it makes sense – quick development and Queenside castling. Black will support the center with piece play (…Ne7) and keep a more fluid pawn structure. In this game it worked out well for Black, as I had trouble adjusting to the changed circumstances.",
        "7. Qf3": "Continuing to pressure the pawns.",
        "7... Qd7 8. a3": "?!\nI really liked this move at the time, since it prevents …Nb4 in order to preserve my Bishop and (I thought) deprive the Knight of any future. As the Knight is headed to e7 anyway, the latter point is simply not true. As for the former, I am not sure that there is anything wrong with allowing …Nb4 and …Nxd3. The Bishop ends up being pretty pathetic for most of the game (especially in contrast to Black's Knight), and after 8. Nge2 Nb4 9. 0-0 Nxd3 10. cxd3 I have an open c-file, a possible minority attack with b4-b5 if Black plays …c6, Knights against Bishops is a closed position, and support for a potential e4 push. Black would be better off continuing 8. …Ne7 as in the game.\nIn short, with 8. a3 I weaken my Queenside to prevent a move that Black probably didn't want to make, anyway.\n",
        "8... Ne7 9. Nge2 g6 10. Nf4": "I thought for a long time about how to open up Black's Kingside. The h4-h5 plan has little force, since Black just replies …g5 and castles Queenside. 10. g4 fxg4 11. Qxf6 was tempting, but of course Black does not need to take on g4 can just play …Bg7. This move was intended to increase the pressure on Black's light squares with the hope of making g4 possible.\n",
        "10... Bf7": "! As bad as the Bishop looks, it is needed here to keep everything together. Black plays with restraint, looking to push the White forces back later.",
        "11. h3": "Again trying for g4. This is a bit of wishful thinking that should have gotten me into trouble. In reality, the Kingside will soon belong to Black, and White should have looked to the Queenside for play with h4 (to discourage …g5), Qe2, Nd1, Rc1 and c4.",
        "11... h5": "! White's forces have stayed too long on the Kingside and Black's pawn roller will force them back in disarray. This move prepares …g5 (if 11. …g5 right away, then 12. Nh5) as well as …h5, clamping down on the White Kingside.",
        "12. O-O-O": "?!\nAt this point I realized that I was in real trouble on the Kingside, and decided to at least get my King out of the way ASAP. White's problem is one of dynamics: although White appears to have the better pawn structure, Black's pawns are in fact more dangerous for one simple reason: they can move. Black's pieces, seemingly huddled in confusion on the last two ranks, are in fact well placed behind the pawns to support their advance. White's pieces, meanwhile, however far advanced they may seem, actually block White's own pawns – particularly, the Nc3 inhibits the vital pawn break c4. \n0-0-0 does nothing to solve these problems – in fact, it simply gets in the way of the Queen's escape route and causes a traffic jam for the retreating White pieces. Moreover, the King's position on c1 makes it even harder to get c4 in. \nMuch better would have been Qd1, intending to leave the King in the center, retreat the f-Knight to e2, and get on with organizing c4 and Queenside play.",
        "12... O-O-O": "?!\nBlack takes a move out to tuck away his King. Still, 12. …g5 13. Ne2 h5!, threatening to trap the Queen and forcing Ng1, would have been more direct, and Black could have already claimed an obvious advantage.",
        "13. Rhg1": "?! Stupid. I am still laboring under the mistaken assumption that I should be playing on the Kingside. White needs to resolve a major tactical problem: The Queen and the Knight both need to retreat via e2, or else one of them risks being trapped. Re2, g3, Ne2-g1, and even h4 would have all been unpleasant, but they would have addressed this vital problem. Even better would be Bb5!, allowing the Knight into d3, which I played (too late) next move.",
        "13... h4": "! Locks down the Kingside, and contains some tactical threats as well. I am now forced to conclude that I won't be getting any play on the Kingside after all.",
        "14. Bb5": "? Good idea, bad timing. \nMy plan is to get the Bishop off d3 with tempo, provoking a weakness in Black's castled position at the same time. Unfortunately, right now I don't have time for this and have to respond to the veiled tactical threat of …g5 and …Bh5 with 14. g3.",
        "14... c6 15. Ba4 Kb8": "? Black underestimates his position.\nInstead, 15. …g5! 16. Ne2 (Nd3?? Bh5 17. g4 hxg3 ep 18. Qxg3 Bxd1 +-) …Bh5 17. g4 hxg3 ep 18. Qxg3 looks excellent for Black. \nNow White has a chance to untangle on the Kingside.",
        "16. Qe2 Nc8": "! The Knight's job is done, and it recirculates to the Queenside.\nI should say that at this point my opponent lost by timeout, so I reinstated the game (seeing that he was winning and all, and hardly deserved to lose just like that), letting him know that he had missed …g5! At this point, I think he tried to hard to make something of the lost combination, rather than continuing with the sensible regrouping started by …Nc8. ",
        "17. Kb1": "Finally preparing to make some Queenside play.",
        "17... g5 18. Nd3 Bh5": "?! I think this is a waste of time, now that White can interpose with f3. \nI was very concerned about the simple plan of playing …Nb6 and …Nc4, which would basically shut down my Queenside play before it started. This move came as a big relief to me: the fact that Black would move his Bishop off of f7, where it supports …Nc4 so well, meant that he probably hadn't seen that plan.\nMy opponent probably meant to make something of the half-open e-file once I unsupport the e-pawn with f3, but as we see in the game, that doesn't work too well for him.",
        "19. f3 b6": "? Now this is a serious mistake.\nBlack has been outplaying White for most of this game so far and, though he has missed some chances, he would still have a real advantage after 19. …Nb6/d6 20. Bb3 Nc4, where White has no play and Black can search for a breakthrough at his leisure. There is no good way to get control of c4 back – if Bxc4 dxc4 the pawn becomes almost as annoying as the Knight (and invincible after …Bf7), while the pawn on a3 (dammit, 8. a3!!!!!!!) drops with check in case of b3 or b4. \nAfter 20. …Nc4, I had actually planned to play 21. b3 Nxa3+ 22. Ka2 as a pawn sacrifice, choosing to go down in complications instead of being slowly crushed.\n\nOne of Black's biggest problems in this game is under-appreciating the strengths of his position. It's easy to miss chances for advantage if you assume they aren't there!\n",
        "20. Ka2": "? A lazy move.\nI had some hazy idea of playing b4, Rb1 and Nc4, but to be honest I just didn't want to go to the trouble of figuring out a plan and hoped my opponent would hand me something to use. NOT a good frame of mind to be in!\n\nI'd say that this temptation to drift without a plan is White's biggest problem throughout this game, and an important lesson for me to learn.",
        "20... Re8 21. Qd2 Rh7": "A creative way to activate the Rook, but doubling on the e-file is not as useful as it seems - the e-pawn is easy to defend for now, and Black would be better served by Nd6-c4.",
        "22. Rge1": "Anticipating ...Rhe7, which was indicated by Black's last. I noted that b4 would then no longer be covered, and I wanted to be ready to take full advantage.",
        "22... Rhe7": "? ...Bd6 should have come first, maintaining a guard on b4.\n(Yes, ...Bxb4 would give up the Bishop pair, but in this closed position the Knights are clearly more useful, especially when they hit at a6 and c6.)",
        "23. Nb4": "! Taking advantage of the temporary obstruction of Black's DSB to gain a lot of activity very quickly.",
        "23... b5": "Or  ...Rd6 24. Na6+ (24. N[either]xd5? b5!) Kb7 25. Qd3, and the Knight will be a bone in Black's throat, though at least it can't get to c5. ",
        "24. Na6+ Ka8": "The King now takes up residence in the corner for the rest of the game.",
        "25. Bb3": "I looked at Nxb5!? cxb5 26. Bxb5, getting a Rook and two pawns for two pieces (...Qxb5?? 27. Nc7+)\nI also looked at variations where after 26. ...Q[somewhere] I didn't take the Rook, though I could find nothing concrete, and at 25. Bxb5 cxb5 26. Nxb5, which seemed inferior. 25. Nc5 is tempting but ultimately after ...Qc7 26. Bb3 Ra7 27. Nd3, (Na6?! Qb7 28. Nb4 Bxb4 =/+) which seems =, possibly +/=, I have reduced my own tactical possibilities, though this line was perfectly playable. \n\nAs far as I can tell, 25. Nxb5!? should give White a better position, but it is a complicated position where I had trouble finding a plan and so I chickened out. Perhaps other players with time (or an engine) on their hands would care to add their own analysis? -- especially my opponent, of course.\n",
        "25... Re7e6": "No c5 for you!",
        "26. Ka1": "?\nAt this point I was excited to discover the line 26. Nxd5!! cxd5 27. Bxd5+ Qxd5 28. Nc7+, which seemed to win by force... except, of course, that 27. ...Qxd5 comes with check, and therefore Nc7+ is quite illegal. Cursing my 20. Ka3, which turned Nxd5 from !! to ??, I then completely refused to learn the obvious lesson about making pointless King moves and proceeded to \"fix\" my mistake by making it all over again. \nInstead of vainly hoping that I'd get the chance to play 27. Nxd5, I should have made the best of my King's position to begin play on the a-file with a4, Ra1 and only then Kb1 if necessary. ",
        "26... Nb6": "!\nNow my opponent find the Nb6-c4 plan, ruining my swindle at the same time.",
        "27. a4": "As noted before, this move -- which is now necessary to create play -- has much more force with the King off the back rank.",
        "27... Nc4 28. Bxc4 bxc4": "...dxc5?! 29. axb5 cxb5 30. d5! and White has a big initiative.",
        "29. Na2": "!?\nI WILL control b4! Again, striving for active play at all times. More passive play, such as 29. Nc5?! Bxc5 30. dxc5 would soon leave the game totally under Black's control. Black has a strong pawn roller on the center and Queenside, if it can just get moving.",
        "29... f4": "?\nRight idea, bad timing. ...Qb7 30. N[either]b4 Bxb4 31. Nxb4 and now White's attacking chances are much reduced.\nBlack does not have to allow White such dynamic possibilities as in the game. With a little patience, he could have slowly forced the White pieces back and then played ...f5 at his leisure. This is not the same as defensive or passive play because it actively and aggressively limits White's play so as to add strength to one's own attack. ",
        "30. e4": "! Sacrificing a pawn for the initiative to counter Black's (otherwise irresistible) attack.",
        "30... dxe4 31. Qa5": "Threatening Nc7+. 31. d5 would have transposed.",
        "31... Re6e7": "Or ...Bd6 32. d5 Re5 \n(...cxd5? 33. Qxd5+ Qb7 34. Qxc4 and now the threat is Rxd6 and Nc7+ so either ...Bb8 35. Nc5 +-, or ...Bc8 35. Qxe6! Rxe6 36. Rd8+ Qb8 37. Rxb8#, or else ...Qd7 35. Nc5.)\n(...R6d7 33. dxc6 Qxc6 34. Nab4 seems promising for White, though Black is not yet lost.)\n33. Nab4 and Black seems to be holding and posing threats of his own, though White still has a promising position.",
        "32. d5": "! The center breaks wide open and chaos breaks loose!",
        "32... Qd8": "!? I had analyzed ...cxd5, exf3 and e3 all as winning for White. I had not even considered this move, to my opponent's credit! \nBlack now puts up a tenacious defense but unfortunately the position is already very dangerous.\n32. ...cxd5 33. Rxd5 Qc8 (or else Nc7+) 34. Red1 and the threat of Rd8 is decisive.\n32. ...exf3 33. dxc6 Qc8 34. Rxe7 Rxe7 35. c7 \n32. ...e3 33. cxd5 Qc8 (Qxc6 34. Rd8+ Kb7 35. N2b4) 34. c7",
        "33. Qc5": "! Preserving the initiative.",
        "33... Qc8": "Again, an unexpected move. Other moves are no good:\n33. ...cxd5 34. Qc6+ Rb7 35. Rxd5 and White will start collecting all of Black's pawns.\n33. ...Re5?? 34. Qc6#\n33. ...Qd7 34. dxc6",
        "34. Qxc4 exf3": "Black's counterplay is just a step too late.",
        "35. Rxe7 Rxe7": "Awkward but forced: 35. ...Bxe7 36. d6 Bd8 37. d7",
        "36. dxc6 Bf7": "More practical chances would be offered by counterattack with ...fxg2. Then 37. Qd5!, (threatening c7#) Rc7 (...Re5 Qxg2 is no help) 38. Nxc7+ Qxc7 39. Qd8+ wins. ",
        "37. Qb5 Be8": "Black has managed to organize some defense, but has become totally passive in the process, so that White can finish things off at his leisure. After ...fxg2 38. c7! threatening both Qc6# and Rd8.",
        "38. Na2b4": "There is fianlly time to bring up reinforcements and make luft (at a2) at once. Black is hogtied. Just about all the possibilities run into mating nets: ...fxg2 Qd5; ...Bf7 c7 ->Rd8, Qc6+, etc.",
        "38... Re5": "Black allows a quick and pretty finish.",
        "39. Nc7+": "!\nYes, Rd8 wins as well, but the exclam is for style.\n...Qxc7 40. Rd8+ Qxd8 41. Qb7# is so much nicer.\n\nAn interesting beginning, a muddled middlegame and a stirring finale."
    },
    "url": "https://gameknot.com/annotation.pl/r-challenge-from-j-b-beaubeaux?gm=30194",
    "gameName": "[R] Challenge from j-b-beaubeaux",
    "players": "jestey1 (1855) vs. j-b-beaubeaux (1655)",
    "opening": "Dutch, Spielmann gambit (A80)"
}