{
    "moves": {
        "1. e4 c5 2. Nf3 d6 3. d4 cxd4 4. Nxd4": "I have been annotating games for fun but this is an annotation for the learning experience of others. A normal Sicilian opening. I played this because the Sicilian nearly always gives a result.I had planned on playing Najdorf because I like the positions.",
        "4... Nc6": "Here was a mistake. I played this in a couple of games where I had meant to play Nf6.",
        "5. Bb5 Bd7 6. Nc3 Nf6 7. O-O a6": "I planned on multiple captures involving the knights and bishops to end up Qb6 attacking the f-pawn. I like the queen on b3,b6,g3,g6 These I find are good squares for the queen",
        "8. Bxc6 Bxc6 9. Re1": "!? Nxc6 bxc6 means this move is not needed",
        "9... g6 10. f4": "I would have preferred Bg5 followed by f4 because I wouldn't castle Queen side because of the half open c-file my Queen is on",
        "10... Bg7 11. Nxc6 bxc6": "Finally the multiple captures have taken place so I can play Qb6+",
        "12. Qe2 Qb6+ 13. Kh1": "Not  Qe3 Qxe3 Bxe3 which I think would be better because his e and f pawns are cramping me and also because my minor pieces are stuck in a corner they aren't in the best places to attack and my only real threat is Rb8 controlling the half open b-file which can easily be defended with b3 and also e5 dxe5 fxe5 causes knight to move + with Rook on e-file defends the pawn if the Bishop on e3 moves.",
        "13... O-O": "Completes my King side defence and also compounds the fact that Qe3 Qxe3 Bxe3 would have been better than Kh1",
        "14. f5 e6 15. fxe6 fxe6": "Gives me control of the half open f-file I would have preferred e5 dxe5 fxe5 Nh5 which puts my Knight onto the corner",
        "16. Be3 Qxb2 17. Qd3 Ng4 18. Nd1": "?? Na4 would have been better because this allows Qxa1 loses the rook\n\n18.Na4 also stops ... Qc3 Qxc3 Bxc3 which forks both rooks\n\n",
        "18... Qxa1 19. Qxd6 Nxe3 20. Qxe6+": "?? This means the Knight just took the Bishop for free with any capture of the knight resulting in checkmate. This also means if black wants to survive and play h3 black gets 2 free minor pieces and is up by 10",
        "20... Kh8 21. h3 Nxd1 22. Qc4 Nf2+": "!! 23.Kh2 Be5+ 24. Kh1 Qxe1# or 24.Kg1 Qxe1 25. Qf1 Nxh3+ means queen is lost and goes down by even more. 24.g3 loses the rook and so once again the points is in such a bad position its not worth it.\n\nLessons to learn\n\n1.) Make sure if back rank mate is a possibility don't move pieces that can stop it\nThis may seem like common sense but 20.Qxe6+?? may have seen like an OK move but because of the threat of back rank it turned out to cost white the game.(Although he was already down by 4 points)\n2.) When facing attacks on rooks on the a1-h8 and h1-a8 diagonals always make sure you can protect these\n3.) b3,b6,g3,g6 are generally good squares for the queen as they force the opposition to be on guard for a possible mate and also means they can quickly hope onto the a1-h8 and h1-a8 diagonals"
    },
    "url": "https://gameknot.com/annotation.pl/r-lets-play-chess?gm=37947",
    "gameName": "[R] Let's play chess",
    "players": "rael31 (1481) vs. thedessertfox (>1200)",
    "opening": "Sicilian (B54)"
}