{
    "moves": {
        "1. e4": "For a detailed description of the first three moves (and Whites fourth move), see the annotation of Part I of this series!",
        "1... e6 2. b3 d5 3. Bb2 dxe4 4. Nc3 f5": "The standard theory move here is the logical 4... Nf6. I don't know if the pawn double-step (that obviously is primarily done to keep the won pawn) here is sound, as it kind of contradicts elementary opening rules, namely that you shouldn't make too many pawn moves but instead develop your pieces quickly in the first stage of the game! This is especially essential when you accepted a gambit and therefore sacrificed development and initiative for material. Note that White already has two minor pieces developed, one of them being a bishop sitting on a mighty long diagonal, while Blacks fellows are all lazy in the back-camp so far. So my guess is that 4... Nf6 is better, but I have to check out what the literature (Thomas Johansson - The Fascinating Reti Gambit) says about this line sometimes in future, I don't own this book yet.",
        "5. d3": "Challenging Blacks strong pawn centre, threatening to win the pawn back. ",
        "5... exd3": "Black does me a great favour and takes, and now I can develop another minor piece in the next move. Note that the opponent only made pawn moves so far, in the first five moves! Maybe 5... Nf6 would have been better, leading to the possible continuation (not computer-checked yet): 6. dxe4 Qxd1+ 7. Rxd1 fxe4 8. Bb5+ Bd7 9. Bxd7+ Nbxd7 10. Rd4 Bc5 11. Rc4 0-0 12. Nh3, with attacking chances for both sides.",
        "6. Bxd3": "Three pieces out versus zero. Blacks troops are still sleeping (or celebrating, because of the won pawn).",
        "6... Nc6": "Finally, Black starts to develop.",
        "7. Qe2": "A logical move, since it prepares to castle queen-side (which is done most of the time in the Reti gambit -- the rook has an excellent place on the open d-file, where the opponents queen is sitting) and it also threatens Bxf5, winning the pawn back and leaving Black with an ugly isolated pawn.",
        "7... Nd4": "I remember that I kind of overlooked this move that attacks my queen. But well, since the opponent moved his horse twice (breaking another opening rule), it also doesn't hurt for me to move my lady another time, regarding development.",
        "8. Qd2": "8. Qe3 would have been worth considering, probably. I'm not sure what I was afraid of.",
        "8... Bb4": "Develops another piece and pins my knight. It looks quite dangerous, considering that queen and king are in the target line of his evil bishop, but on the other hand, it isn't too easy to exploit that.",
        "9. O-O-O": "White has almost finished development now, only one piece needs to move to have nice position with connected rooks. Note that Black still needs at least four moves to accomplish the same.",
        "9... Nf6": "Black is ready to castle king-side now and can place this knight on the strong square d5, where the pressure on my knight on c3 would increase.",
        "10. Nge2": "The last missing piece gets out and challenges Blacks horse in the centre! At the time playing I avoided 10. Nf3 because if Black decided to take, 10... Nxf3 gxf3 would have corrupted my pawn structure. But now I realise, that the open g-file could have been very useful then, considering Black probably castled king-side so maybe it would have been worth it! Anyway, this way it was also not bad, as we will see soon.",
        "10... Nxe2+": "I guess it would have been wiser for Black to get his king to a safe place, instead of helping White by freeing the queen from the pin comfortably and remove clutter from the powerful d-file, empowering the rook. For example, 10... 0-0, 11. Bxf5 exf5 (... Nxf5? Qxd8, Rxd8 Rxd8+, winning the Exchange), 12. Qxd4 (or the more dangerous Nxd4), with an about equal position.",
        "11. Qxe2": "Still a pawn down, White clearly enjoys the superior position now. The immediate threat is Bxf5, winning the pawn back and simultaneously attacking the queen.",
        "11... Qe7": "Blacks queen decides to go out of the firing line.",
        "12. Rhe1": "Increasing the pressure on the half-open e-file and renewing the threat Bxf5.",
        "12... O-O": "Finally, also Blacks king gets to a safe place -- at least for some time. Note that the idea of attacking the knight on c3 another time, thinking that it can't move because the rook on e1 is exposed then and one could win the Exchange, fails and leads to the loss of a piece: 12... Nd4 13. Nxd5 exd5 (the queen was attacked!) 14. Qxe7+ Bxe7 (now the bishop is back again, and pinned) 15. Ba3! and the bishop is history.",
        "13. Bxf5": "Yes, this still works, the bishop waited a long time for his move! Material is even now again.",
        "13... Bxc3": "? Weakens my queen-side but loses the pair of bishops and throws away a piece that was quite active.",
        "14. Bxc3 Qa3+": "Okay, this is what he had in mind -- unpinning the pawn on e6 with check, trying to punish the bishop on f5 for using a simple tactical trick before. Good idea (that I overlooked), but it doesn't work.",
        "15. Bb2": "Of course I have to keep the queen occupied. The at first sight more logical 15. Kb1?? would lose a piece, 15... exf5.",
        "15... Qxa2": "Yes, it costs a pawn. The queen looks dangerous here on this square, so close to my king, but in fact she isn't doing any harm at all.",
        "16. Bxe6+": "I get the pawn back immediately in the centre.",
        "16... Kh8": "My guess is that 16... Bxe6, trading the undeveloped bishop against my very active one and connecting rooks, would have been stronger.",
        "17. Bc4": "This way I decide to keep my strong piece.",
        "17... Bg4": "I was glad at that point that my f2-pawn still exists.",
        "18. f3 Bh5 19. Qe7": "All hail to the 7th rank! Threatens Rd7 (threatens mate on g7 in turn) the next move; if ... Nxd7??, then Qxg7#. Notice the huge impact the mighty bishop on b2 has in this position!",
        "19... Qa5": "?? The final blunder that loses the game. Looks good as it defends the c7 and tries to get the queen back into the game. However, it enables White to play a devastating...",
        "20. Re5": "... double attack! Note that Rd7 was probably still a playable option, though one has to be careful not to leave the rook on e1 undefended that is eyed by Blacks queen now! However, this way, involving simple tactics, seemed to be more safe and simple (and, lust but not least, fun!) to me.",
        "20... Rfe8": "A last straw, hoping that I apply the wrong move order.",
        "21. Qxe8+": "Of course, 21. Rxa5?? Rxe7 would not have won anything.",
        "21... Nxe8": "I have no idea why he didn't take with the rook, which seems to be much more natural to me, compared to take a step back to the first rank with the horse, leaving the bishop undefended.",
        "22. Rxa5": "White is a whole rook ahead now in material.",
        "22... Nd6": "...",
        "23. Rxh5": "Small gifts will best maintain friendship (\"Kleine Geschenke erhalten die Freunschaft\", as we say in German). Black wisely decided to resign at this point. This is another game which shows how powerful and fun to play the Reti gambit can be. I'm pretty sure my opponent has lots of experience with the French defence and has played hundreds of games with it with the standard theory (following the normal 2. d4 d5), and if I played the, let's say, advance variation (3. e5), like I did in earlier times, he probably would have played much stronger and killed me. However, with this nice anti-French gambit, I could nicely squeeze out an advantage right from the beginning and improve it more and more with quite simple moves. Feel free to comment!"
    },
    "url": "https://gameknot.com/annotation.pl/tournament-experiences-with-the-reti-gambit-part-ii?gm=43780",
    "gameName": "[Tournament] Experiences with the Reti Gambit, Part II",
    "players": "Sebastian Falbesoner (1610) vs. Johann Flanitzer (1745)",
    "opening": "French (C00), Reti (Spielmann) variation"
}