{
    "moves": {
        "1. e4": "Good move.  Seizes central territory while opening d1-h5 diagonal for the queen and the f1-a6 diagonal for the bishop.",
        "1... Nf6": "Advanced strategy - for advanced players.  The idea is to tempt white into harassing the knight by pushing his pawns far out into the center.  These pawns, Black hopes, will later be weakened due to their advanced positions, and the squares around them will be weakened too.  As a beginning player, try to keep your pawns tight and compact.  Advance the e and d pawns (the king and queen pawns), but, as a general rule, the remaining pawns should not be moved unless necessary, or if their movement is part of a concrete tactical shot, or a concrete strategic idea.",
        "2. e5": "White advances the pawn.  A good move only if he knows what he is doing and if he is confident that by advancing the pawn, he can build a strong center that is defensible.   Remember that unnecessary pawn moves waste time.  Chess time must be used to get the pieces out of their starting position, centralized and ready to take part in the action.",
        "2... d6": "A bad blunder!  Black gives up his Knight!  Remember, a pawn is worth one \"point\".  A knight and bishop are both equal to three points; a rook is equal to five points and a queen is equal to nine points.  GameKnot calculates the point value for you.",
        "3. exf6": "Obvious.",
        "3... gxf6": "The best option.  As a general rule, capture with pawns toward the center, not away from it.  This move also opens the g file for his rook and it gives the f8 bishop some immediate squares to mobilize to.",
        "4. Bc4": "White immediately targets the f7 square - the Achilles heel of any chess position (f2 for white) because it has only one defender:  the king!  This move is tactically not the best simply because Black could advance his d pawn thus pushing the Bishop away (and gaining time).  Other options for Black are to mobilize his c8 bishop to e6, thus countering the white Bishop, or he could go for a compact pawn structure by advancing the e-pawn one square, to e6 thus blunting the white Bishop's scope.",
        "4... Nc6": "Not a bad move - Black gets a piece off the first rank (finally).",
        "5. Nf3": "Good move- gets a piece out and prepares for king side castling.  But does White really want to put his King one the firing line of that half open g-file?  Good thing for him that queen-side castling is still an option, but that will take more time as none of his queenside pieces have developed as of yet.  This is the type of concern that allows us to see the how important the time element of chess is, and how important it is to get the pieces out and get the king into a safe haven.",
        "5... a6": "An aimless move.  Was black worried about the knight being pinned by the Bishop?  If he was worried about this, his worries were groundless.  It would take another move by the white bishop to move to b5 which is a waste of time.  Also, the knight does not defend anything, so why would white want to pin it in the first place?  Black should have gotten another piece off the back rank - any undeveloped piece move would have been a good move.",
        "6. O-O": "Good move, but he needs to be wary about that open g-file.  white should definitely think about plans to transfer his c1 bishop over to the king side, and place it on g3 so as to protect his king further from the g-file battery.  It's not a concern yet, but it could be troubling later, if Black chooses to operate there.",
        "6... Ne5": "Black moves a developed piece twice while his other pieces sit back and watch.  Is he planning to win this war with one piece?",
        "7. Nxe5": "White captures the knight.  There are other options than this, and considering that white's entire queenside is undeveloped, this may not have been the best move.  For example 7. d3 would have protected the Bishop while opening the tomb of the c1 Bishop.  If white captures the c6 knight, then Black can simply recapture with Queen, thus developing that piece to an active position.  But perhaps White simply wanted to keep his light squared Bishop from being exchanged for the knight.",
        "7... fxe5": "This is a pawn captured towards the center, which is good, but in this case, capturing with the d pawn would have opened the scope of the Queen for Black.",
        "8. d4": "Great move!  Open the game up and get that other Bishop into play!",
        "8... b5": "What???  Why?  ",
        "9. Bd5": "Obvious.  Punish Black for causing a sickness within his own light color square complex and force him to make an awkward rook move.",
        "9... Bd7": "Black needed to preserve his rook.  Because of this move he loses the exchange:  Rook minus Bishop equals two pawns.  This is decisive in most chess games.",
        "10. Qf3": "White now not only reiterates his attack on the rook, he also threatens the \"Achilles Heel\" - f7.  A strike by the queen at f7 in this position means checkmate.",
        "10... e6": "Great move!  He saw the threat and parries the checkmate threat.",
        "11. Bxa8": "Good move - win the two points and get on with the job.",
        "11... d5": "what?  why not take the Bishop with the queen?  At least get something back for the rook!  Oh well.  Black is now down 5 points as opposed to two points.",
        "12. Qc3": "Uh...maybe not.  Why didn't White move his bishop to b7, or at least capture the d5 pawn in self sacrifice?  ",
        "12... Qc8": "How many chances does Black need to see that the Bishop is right there?  That's three points!",
        "13. Bc6": "Ok.  So now white gets his Bishop out, with the help of his queen.",
        "13... exd4": "Another pawn move?  This only opens the lines for White's assault.  Remember that White's king is castled, Black's is still sitting in the center, like a sitting duck.",
        "14. Qxd4": "Natural move.",
        "14... e5": "Another pawn move?  And this one has no support from his fellow pawns, or from his pieces.  Not only that, it opens the e-file which is the direct road to his own king.  This pawn was a traitor!!!",
        "15. Qxe5+": "Check!",
        "15... Kd8": "Run away!  Run away!    ",
        "16. Bg5+": "Check!  Finally that other Bishop gets some face time with its colleagues.  ",
        "16... Be7": "basically the only move - and it is over - checkmate is next...",
        "17. Qxh8+": "well...maybe not.  White gets the \"five points\" for the h1 rook, but he could have simply checkmated on e7.",
        "17... Be8": "Only move.",
        "18. Qxe8#": "And that's all folks!  As a summary, both players need to get their pieces out quicker.  White needs to consider harmonious development of his pieces and he needs to consider king position as an important factor in the game.  That is, it may have been wiser for him to get the queenside pieces out and castle queenside.  A stronger player would have gone for a mating attack on the g-file.  Black needs to focus on the point value of the pieces and he needs focus on not making so many unnecessary pawn moves.  Try to get through each game without losing one pawn (or piece) and try to not move any pawn except for the d and e-pawns.  Also, try to get in the habit of moving each piece only once in the first ten or twelve moves.  And make castling a priority!  If Black does these things, he will begin improving immediately.\r\n\r\nHope you enjoyed my annotations.\r\n\r\nBledd71"
    },
    "url": "https://gameknot.com/annotation.pl/a-beginners-chess-encounter?gm=12240",
    "gameName": "A Beginners' Chess Encounter",
    "players": "sirlaiwei (1122) vs. devanjn (1200)",
    "opening": "Alekhine's defence (B02), Mokele Mbembe (Buecker) variation"
}