{
    "moves": {
        "1. d4 Nf6 2. c4 c5 3. d5 b5": "One of my favourites",
        "4. cxb5 a6 5. bxa6 g6": "This is the most accurate move order for black since white can go for a specific set up involving b3 and g3 that solves many problems early if black captures the pawn immediately. I think the point with this move order is that if white goes for the set up, the black LSB may prove to be more useful on the c8-h3 diagonal.",
        "6. Nf3 Bxa6": "I'm not sure that this was correct, I think it would have been more accurate to delay the capture further until white had played Nc3. As it is, this sort of defeats the purpose of playing... G6 first.",
        "7. g3 d6": "Just to avoid any pawn sacrifices that may occur.",
        "8. Bg2 Bg7 9. O-O Nbd7 10. Nc3 O-O 11. Re1 Ng4": "A thematic idea in the benko gambit.the knight reroutes so that he can have extra control over e5 and he can then look to play there and have a pair of knights exchanged, but since white has moved the rook away from f1 I figured I would leave my knight where he is, until he gets kicked away, since quite often the pressure against f2 can come in useful and whilst the knight is here my bishop has a clear diagonal.",
        "12. Qc2 Qa5": "Sometimes I come to b6, but this is a more common square for my queen and I figured I should probably aim to stay within established norms.",
        "13. Bd2": "Indirectly hitting my queen and also connecting the rooks and adding protection to the knight. I was not worried about it though, since I had already decided there are no useful discovered attacks against my queen.",
        "13... Rfb8 14. b3": "This weakens the long diagonal, I think if I were white I would have first played h3 and only then look to get a timely b3 in.",
        "14... c4": "!? Getting in this pawn advance is one of blacks key ideas in this opening, usually it's purpose involves getting a knight to the d3 which isn't the case here since white has still not moved the e pawn. However this advance often has dynamic purposes and sometimes aims to free the c5 square for the pieces. I couldn't help but feeling this was too soon, but every line I looked at seemed promising, so I just played it. The purpose is to get the queen to c5 which hits f2 and by initiating contact between the pawns I'm sure to induce a weakness, also I'm now hitting d5",
        "15. Rab1": "White gets his rook out of the pin, however black now gets a brief burst of initive",
        "15... Qc5": "Starting with this attack against f2",
        "16. Ne4": "During the game I thought this would lead to all sorts of trouble for white, however it turns out to probably be best. ",
        "16... cxb3": "I thought this would be decisive, I didn't put much calculation to it though, thinking my passed pawn was just going to be strong, and he'll, it 'looked strong' incidentally I never even considered ...Qxd5 which was probably best.",
        "17. Nxc5 bxc2 18. Rxb8+": "I thought about ways I could sac a piece to make something of my pawn, but I couldn't find anything that worked which meant that it turns out black is simply slightly worse since I have to make my knight bad and white will get back the pawn without trouble.",
        "18... Nxb8 19. Nxa6 Rxa6 20. Rc1 Rxa2 21. Ne1": "I probably should have started to play for a draw now, but I decided to still try to win, so I though for a while and decided the best way to mix things up was to use the tempo white spend regaining the pawn, to reposition my g knight, that is susceptible to attacks by the white LSB",
        "21... Ne5": "Heading for c4",
        "22. Nxc2": "The better recapture to be running with. White is a little better here.",
        "22... Nc4 23. Bg5 Bb2 24. Rb1 f6": "My pieces are a little tied up, but everything is hanging together.",
        "25. Nb4": "?! This was a miscalculation on my opponents part, he thought that he could respond to 25...Ra4 with 26.Nd3 however that losses to 26... Fxg5 27.Nxb2 Rb4 winning material. Best would have been Bc1",
        "25... Ra4": "I was hoping that white would fool for 26.Bd2?? Now since ...Nxd2 27.Rxb2 Ra1+ wins a piece however even though white has two pieces enprise, there is still a defence, one that keeps whites edge.",
        "26. Nc6": "I had been hoping white would miss this.",
        "26... fxg5 27. Nxb8 g4": "Cramping whites king and pawns, and also preventing the bishop coming into play via h3 where it will eye the e6 square. I also could have exchanged bishops now with ...Nd2 but the exchange would only have favoured white, this is a better move.",
        "28. Nc6 Kf7 29. h3 h5": "I want to keep a pawn on g4",
        "30. hxg4 hxg4 31. Be4 Ra1": "Finally realising that I have no winning chances whatsoever I decide I have to exchange rooks and play to draw.",
        "32. Rxa1 Bxa1 33. Bd3 Ne5 34. Bb5": "Ba6 seems better looking to redeploy to c8 where the bishop would hit e6 and g4",
        "34... Kf6": "I would have liked to get in ...e6 but that just drops a pawn. ",
        "35. Ba6 Bc3 36. Bc8 Bb2 37. Nxe5 Kxe5": "And now we agreed on a draw since its an opposite coloured bishop ending, thus shouldn't be too difficult to hold."
    },
    "url": "https://gameknot.com/annotation.pl/a-benko-gambit?gm=47411",
    "gameName": "A Benko gambit",
    "players": "Opponent (1552) vs. Me  (1413)",
    "opening": "Benko gambit accepted (A58)"
}