{
    "moves": {
        "1. e4 c5": "Sicilian ... I didn't expect this. I thought I'd stick to my usual development moves where Black moved e5 ... I know it isn't a good idea    ",
        "2. Nf3 d6 3. Bc4": "In retrospect d4 would have been better",
        "3... Nc6 4. d3": "I decide to open my other bishop",
        "4... e6 5. Nc3 Nf6 6. Bg5": "The knight is pinned",
        "6... Be7 7. h3": "I didn't want to exchange the knight unless my foe forced me too. So I decided to move h3 as then my foe's white bishop can't pin my knight in the future .. But now I think it was a bad move",
        "7... h6 8. Bxf6 Bxf6 9. O-O a6": "My foe wants to capture the queen side ",
        "10. a4 Rb8 11. Rb1": "This suits me the I can move Ne2 followed by d4",
        "11... b6": "My opponent does this to develop his bishop. ",
        "12. Ne2 b5": "Due to that move my opponent has a change of plans and settles for b5. This is a mistake of my opponent throughout the game. He goes moves down due to such tactics",
        "13. axb5 axb5 14. Bb3 O-O 15. c3": "c3 attacking for the center and making space for my bishop",
        "15... Re8 16. d4 c4 17. Bc2": "Both me and my opponent think that the game looks pretty jammed ",
        "17... Ra8": "Black decides to conquer the \"a\" row however in doing so he goes another move down. He has no game plan another reason why I end up winning  ",
        "18. b4": "Fearing Na5 an intrusion into my base",
        "18... Bb7": "Black develops his bishop",
        "19. Re1": "By this I can take the center (d5) without pawn support",
        "19... d5": "I don' t think this is a good move ",
        "20. e5 Be7 21. Nh2": "I fear f6 so I decide to make space for f4",
        "21... Nb8": "Black decides to maneuver his knight and ring it out on his king side ... again wasting moves ",
        "22. f4": "I reinforce my capture ",
        "22... Nd7 23. Ng3 f5 24. Qh5 Bh4 25. Re3 Nf8": "My foe wants to develop his knight by the king side  ..... If I have to act it must be now blacks position is pathetic ",
        "26. Bxf5": "Now the fun starts ... If exf then Nxf5 Be7 Nxh6 Qxh6 And then a mate would eventually follow by Rg3 . However if Bxg3 then .....",
        "26... Bxg3 27. Rxg3 exf5 28. Qxh6 Re7": "Not my preferred way to defend  ",
        "29. Qh5 Bc8 30. Nf3": "I decide to get my knight into offense ",
        "30... Ne6 31. Ng5": "But I then got a better idea ... The exchange would favor me",
        "31... Nxg5 32. fxg5 f4 33. g6": "Qh7  Kf8 Qh8  ",
        "33... Rea7 34. Qh7+ Kf8 35. Rf1": "The pin",
        "35... Ra7a1": "Just as I had hoped ",
        "36. Qh8+ Ke7 37. Qxg7+ Ke6 38. Qf7#": ""
    },
    "url": "https://gameknot.com/annotation.pl/a-beautiful-middlegame?gm=9258",
    "gameName": "A beautiful middlegame",
    "players": "Anant (--) vs. Shushank (--)",
    "opening": "Sicilian (B50)"
}