{
    "moves": {
        "1. f4": "The most recent game between my friend Jo and myself was instructive and worth annotating. Jo started with a Bird's opening. ",
        "1... e5": "White's strategy is to dominate the Kingside. Black responds with the sharp reply 1...e5!?, From's Gambit, named for the Danish chess player Martin Severin From (1828–1895), thus sacrificing a pawn to exploit White's weakened Kingside before White can develop adequately.",
        "2. fxe5": "Besides taking the pawn, White can play the safer e4, transposing into a Kings Gambit with equal chances. ",
        "2... Nc6": "A more obscure, modern move order. The idea is to defer ...d6 and develop instead, hoping to transpose to better variations. After the normal 2...d6 3.exd6 Bxd6, White must play 4.Nf3, avoiding 4.Nc3?? Qh4+ 5.g3 Qxg3+ 5.hxg3 Bxg3 checkmate. Black has two main alternatives: 4...g5 to drive away White's knight, and 4...Nf6, threatening 5...Ng4 and 6...Nxh2! Emanuel Lasker introduced 4...g5 in the game Bird–Lasker, Newcastle on Tyne, 1892, so it is known as \"Lasker's Variation\". Today, current thinking is that 4...g5?! is more dubious; a quiet response considered favorable for White is 5.d4 g4 6.Ne5! (6.Ng5? leads to a dubious piece sacrifice) Bxe5 7.dxe5 Qxd1+ 8.Kxd1 Nc6 9.Nc3! Be6 (9...Nxe5?! 10.Bf4 f6 11.Nd5 Kd8 12.Nxf6!) 10.Bf4 0-0-0+ 11.Ke1 Nge7 12.e3 Ng6 13.Bg5 Rdf8 14.Bf6 Rhg8 15.Be2 Ngxe5 16.Rf1 with a slight plus for White. The sharper 5.g3 g4 6.Nh4 also seems favorable for White, after 6...Ne7 7.d4 Ng6 8.Nxg6 hxg6 9.Qd3 Nc6 (9...Rh5 10.Bg2; 9...Na6 10.c3) 10.c3 (10.Nc3? Nxd4! 11.Qxd4?? Bg3+ wins White's queen) Bf5 (10...Qe7 11.Bg2! Bd7 12.Nd2 0-0-0 13.Ne4! favored White in Taylor–Becerra Rivero, Minneapolis 2005) 11.e4 Qe7 12.Bg2 0-0-0 13.Be3. At this point, White seems to have an advantage in all lines, although play remains extremely sharp, e.g. 13...Rde8 14.Nd2; 13...Rxh2 14.Rxh2 Bxg3+ 15.Kd1 Bxh2 16.exf5! Re8 17.fxg6! Qxe3 18.Qxe3 Rxe3 19.gxf7; or 13...Bd7 (threatening 13...Rxh2!) 14.Bf2!",
        "3. Nf3": "Logically consistent. But with this move order, probably better is 3.Nc3! Nxe5 4.e4 intending 5.d4, rather than 3.Nf3?!, and then after g5!? or d6!? when Black has the kind of position they are playing for. ",
        "3... g5": "The GK computer considers this move weak compared with ...d6: (Inaccuracy: -0.92 » … g5 4. h3 d6 5. d4 dxe5 6. d5 Nb4 7. Nc3 g4 8. hxg4 Ne7 9. Bh6 Bxh6 10. Rxh6 Nbxd5 11. Nxd5 Qxd5 12. Qxd5 Nxd5 13. Nxe5; Best: -0.34 » … d6 4. exd6 Bxd6 5. Nc3 Nf6 6. e3 Bg4 7. Bc4 O-O 8. O-O Ne5 9. Be2 Qd7 10. Nxe5 Bxe5 11. Bxg4)",
        "4. d4": "?! But this move justifies Black's plan. ",
        "4... g4 5. Ng5": "Jo does not like the more passive retreat to g1.",
        "5... d5": "The most aggressive response, exploiting the position of White's knight which has to be careful to avoid being trapped.",
        "6. exd6 e.p. Qxd6": "Again, Black chooses the most aggressive response. ",
        "7. c3": "Defends d4. ",
        "7... Qg6": "Black continues the aggressive play. The N is now threatened.",
        "8. Qd3": "Hoping for a Q trade and to allow the N to retreat. The GK computer considers this weak compared with d5: (Inaccuracy: -0.45 » 8. Qd3 Qxd3 9. exd3 h6 10. Ne4 f5 11. Nc5 Nf6 12. Na3 b6 13. Na4 Be6 14. Bf4 O-O-O 15. Nc4 Nd5 16. Bg3; Best: -1.10 » 8. d5 Bh6 9. dxc6 Bxg5 10. Bxg5 Qxg5 11. Nd2 bxc6 12. Ne4 Qb5 13. Qc2 Be6 14. e3 Qb6 15. O-O-O Qxe3+ 16. Kb1)",
        "8... Bf5": "Prevents the Q trade. ",
        "9. e4": "Best alternative.",
        "9... Bd7 10. d5 Ne5": "Black has a slight edge at this point. ",
        "11. Qg3": "? This move is a serious error, giving a clear, winning advantage to Black. The GK computer prefers Qd4, which is what I had expected. (Mistake: +2.04 » 11. Qg3 Bd6 12. Bf4 Qf6 13. Nd2 Nf3+ 14. Ngxf3 Bxf4 15. Qf2 gxf3 16. Nxf3 Nh6 17. Qd4 Qxd4 18. cxd4 O-O-O 19. Ne5 Ba4\nBest: +0.77 » 11. Qd4 Bg7 12. Qc5 c6 13. dxc6 Qxc6 14. Qxc6 Bxc6 15. Na3 h6 16. Nb5 Kd7 17. Nxf7 Nxf7 18. Bc4}. ",
        "11... Bd6": "Of course. An immediate threat is to win the White Q with ...Nf3+. Also the White N is trapped and can be attacked by pawns.",
        "12. Bf4 f6": "!? I decided to play this move rather than Qf6 because I wanted to keep pressure on e4. ",
        "13. Ne6": "Jo realizes she is in trouble and attempts to complicate. But this accelerates the loss. Better was development, such as Nd2 first as the GK computer suggests: (Mistake: +1.65 » 13. Ne6 Qxe4+ 14. Be2 Qxd5 15. Bxe5 Qxe5 16. Qxe5 fxe5 17. Bc4 Nf6 18. O-O Bxe6 19. Bxe6 Bc5+ 20. Kh1 Rf8 21. Rf5 Bd6; Best: -1.02 » 13. Nd2 O-O-O 14. Ne6 Bxe6 15. dxe6 Ne7 16. O-O-O Qg8 17. Qe3 Kb8 18. Bc4 Nxc4 19. Nxc4 Qxe6 20. Nxd6 cxd6)",
        "13... Qxe4+ 14. Qe3 Qxd5": "Here Black has only a pawn advantage but has an overwhelming positional and developmental advantage.",
        "15. Ng7+": "? While this protects the N and prevents Black from castling, it really doesn't help and accelerates the loss with what is essentially a spite check. After this blunder, White is truly lost. THe GK computer suggests Bxe5 instead. (Mistake: +4.52 » 15. Ng7+ Kf8 16. Qd4 Qf7 17. Nd2 Kxg7 18. Ne4 Re8 19. Nxd6 cxd6 20. Kd1 Nc6 21. Qxd6 Bf5 22. Kd2 Nge7; Best: +1.62 » 15. Bxe5 Qxe6 16. Bd4 Qxe3+ 17. Bxe3 Ne7 18. Nd2 Nf5 19. Bf2 g3 20. hxg3 Nxg3 21. Rh4 Nxf1 22. Re4+ Be5 23. Nxf1)",
        "15... Kf7": "Now the white N is en prise, the White K and Q are on the same file, and White is hopelessly behind in development. But the GK computer considers this an error in that Kf8 would have been even stronger. (Mistake: +3.18 » … Kf7 16. Qd4 Qxd4 17. cxd4 Nf3+ 18. gxf3 Bxf4 19. Nh5 Bc1 20. Nd2 Re8+ 21. Be2 Bxb2 22. Rb1 Bc3 23. Rf1 gxf3 24. Rxf3; Best: +4.52 » … Kf8 16. Qd4 Qf7 17. Nd2 Kxg7 18. Ne4 Re8 19. Nxd6 cxd6 20. Kd1 Nc6 21. Qxd6 Bf5 22. Kd2 Nge7)\n",
        "16. Nh5": "?? The final blunder. Saves the N but now the weakness on the e file becomes fatal. GK computer suggests Qd4 instead: (Blunder: +9.30 » 16. Nh5 Re8 17. Nd2 Nd3+ 18. Bxd3 Rxe3+ 19. Bxe3 Qxd3 20. Bxa7 Qb5 21. Ng3 Qxb2 22. Rd1 Bxg3+ 23. hxg3 Qxc3 24. Kf2 Qb2 25. Rhe1 Qxa2: Best: +3.30 » 16. Qd4 Qxd4 17. cxd4 Nf3+ 18. gxf3 Bxf4 19. Nh5 Bc1 20. Nd2 Re8+ 21. Be2 Bxb2 22. Rb1 Bc3 23. Rf1 gxf3 24. Rxf3.",
        "16... Re8": "Now Jo waves the white flag. White faces horrific material losses or checkmate. As Jo said: \"I can safely say here that I am on the wrong end of an annihilation. I am now resigning our game on the grounds of ruinous loss of material. If I try and save Glenda (by dodging your knight) who will be pinned against Henry next move then I see you have a forced mate as follows:- Here is the forced mate. 17. Qg3 Nd3+ 18. Kd2 Nxf4+ 19. Kc1 Ne2+ 20. Kc2 Bf5+ 21. Qd3 Qxd3+ 22. Kb3 Qb5#\" Even the line given by the GK computer: 17. Nd2 Nd3+ 18. Bxd3 Rxe3+ 19. Bxe3 Qxd3 20. Bxa7 Qb5 21. Ng3 Qxb2 22. Rd1 Bxg3+ 23. hxg3 Qxc3 24. Kf2 Qb2 25. Rhe1 Qxa2, leaves White annihilated. But I'm sure Jo will extract revenge in future games."
    },
    "url": "https://gameknot.com/annotation.pl/a-bird-in-hand?gm=40933",
    "gameName": "A Bird in Hand",
    "players": "jstevens1 (1771) vs. dmaestro (1574)",
    "opening": "Bird (A02), From gambit, Lasker variation"
}