{
    "moves": {
        "1. f4": "Hi everyone!\r\n\r\nI have just read a thread on one of the general forums about the Bird's Opening.  This prompted me to annotate one of my mini-tournament games.  This one ended in a draw but what happened in between may be of interest.  So, white kicks off with 1. f4, this move characterises the Bird's Opening.",
        "1... d5 2. Nf3 Nf6 3. e3 g6 4. Be2 Bg7": "4. ...... Bg7 - development",
        "5. O-O O-O 6. Nc3 c5": "6. ...... c5 - I make space for myself on the queenside - later on this is where the action will be.",
        "7. d4 b6 8. dxc5 bxc5": "8......... bxc5 - pawn trade.",
        "9. Qd2 Bb7 10. Ne5 e6 11. Rd1 Nc6": "11. ...... Nc6 - I get around to developing my queen knight and put a question to the knight on e5.  He exchanges.",
        "12. Nxc6 Bxc6 13. Bf3 Qc7": "13. ..... Qc7 - this move clears the decks and connects the rooks.  Can I do anything with this lead in development though?",
        "14. Qe2 Rfd8 15. Bd2 Rab8": "15. ....... Rab8 - a good idea to put a rook on a half open file I think.",
        "16. Rab1": "16. Rab1 - both rooks oppose each other.",
        "16... c4 17. b3 cxb3 18. axb3": "18. axb3 - pawn trade.",
        "18... Rba8 19. Na2 a5 20. Nc3 Rdb8": "20. ........ Rdb8 - both black rooks make use of those open and half open lines.",
        "21. Qd3 Qb6 22. Be1 Qc7 23. e4": "23. e4 - this move triggers off a series of trades.",
        "23... dxe4 24. Nxe4 Bxe4 25. Bxe4 Nxe4 26. Qxe4 Qc5+": "26. ....... Qc5+ - a lot of wood has been cleared from the board over the last few moves.  Now Glenda makes her presence felt.",
        "27. Bf2 Qb4": "27. ....... Qb4 - offering a queen trade but white evades it.",
        "28. c4": "28. c4?! - not sure about this move though, it makes the b3 pawn backward and this pawn will net me half a point later on.",
        "28... Rbd8 29. Rdc1 Rab8 30. Rc2": "30. Rc2?! - I think this move helps to ensure the draw for me.  I now take advantage of the fact that the b3 pawn is pinned to the b1 rook.  I now have the opportunity of swapping off my a pawn isolani.",
        "30... a4 31. Be1": "31. Be1 - this move starts off a threefold repetition.",
        "31... Qc5+ 32. Bf2 Qb4": "32. ...... Qb4 - let's do this dance again!",
        "33. Be1 Qc5+": "33. ...... Qc5+ - this game occurred just before a change in the threefold repetition procedure.  Gameknot asked me whether I wanted the game drawn.  I clicked on the yes button because my opponent's rating was north of my own, so I was content with the draw game.",
        "34. Bf2 Qb4": ""
    },
    "url": "https://gameknot.com/annotation.pl/a-bird-in-the-hand?gm=23580",
    "gameName": "A Bird in the Hand!",
    "players": "grandad22000 (1823) vs. jstevens1 (1781)",
    "opening": "Bird's opening (A03), Lasker variation"
}