{
    "moves": {
        "1. e4": "The four move mate or Scholars mate is something that can be seen quite often in primary age tournaments. However once we learn how to defend against it we realise that black can actually gain  development from it. So one would think it would not be tried between two Danish internationals, well in this game white tries it five times in the first nine moves! read on to find out how he actually ends up with a good position.",
        "1... e5 2. Nc3 Nf6 3. Bc4 Nxe4": "Now if 4.Nxe4 black regains his piece with a pawn fork by 4...d5",
        "4. Qh5": "White chooses instead to threaten mate on the weak f7 square.",
        "4... Nd6 5. Bb3 Nc6 6. Nb5": "threatens mate with Nxd6+ followed by Qxf7#",
        "6... g6 7. Qf3": "with the same threat of Nxd6+",
        "7... Nf5": "? It has since been shown that black gains a good development advantage with 7...f5! 8.Qd5, Qf6 9.Nxc7+, Kd8 10.Nxa8, b6",
        "8. Qd5": "more attacks on the f7 pawn!",
        "8... Nh6 9. d4": "For the fifth time white threatens mate. Bxh6 followed by Qxf7!\r\n\r\nThis time black can't escape without loss of material ",
        "9... d6 10. Bxh6 Be6": "blocks the threat and forces the white queen to get out of Blacks face.",
        "11. Qf3 Bxb3 12. Bxf8 Ba4 13. Bg7 Rg8 14. Bf6 Qd7 15. Na3 Nxd4 16. Qh3": "The dust has settled and white now has an extra knight for 2 pawns. Black seeks to pocket more pawns for compensation. ",
        "16... Qxh3 17. Nxh3 Nxc2+": "instead of Bxc2? Rc1!",
        "18. Nxc2 Bxc2 19. Rc1 Be4 20. Ng5": "! Strong, brining all his pieces toward blacks camp.",
        "20... Bxg2": "? A very big mistake, Bc6 was essential to prevent the rook from invading the seventh rank. Understandably Black wants another pawn. He expects Rg1 giving him enough time to play Bc6. Black never expected white to simply let him have the rook.",
        "21. Rxc7": "!",
        "21... Bxh1 22. Nxf7": "? after this move white still has a massive advantage but he missed a nice combination with 22.Re7+!, Kd8 (...Kf8, Nxh7#) 23.Nxf7+, Kc8 24.Nxd6+, Kb8 (...Kd8 25. Rxh7 with discovered mate) 25.Bxe5+-",
        "22... Bd5": "Done to prevent 23.Nd6+, Kf8 24.Rf7#",
        "23. Nxd6+ Kf8 24. Bg5": "even stronger was Be7+",
        "24... Rh8": "White is threatening Bh6+ so the king needs an escape square.",
        "25. Bh6+ Kg8 26. Rg7+ Kf8 27. Rxb7+": "And we have a very nice windmill going.",
        "27... Kg8 28. Rg7+ Kf8 29. Rxa7+ Kg8 30. Rxa8+": "One might ask why the heck white just exchanged his destructive seesawing rook for a passive rook that is yet to even move? well read on.",
        "30... Bxa8": "Taking a look at the position we can see that with the rooks off the board black is helpless because a kind of 'prison' has been set up for the black king and rook. the white Knight and bishop are the prison guards  and since both pieces are on light squares whites only active piece (His LSB) is completely useless to do anything about it. The only thing whit needs to watch out for is stalemate if Black tried to sacrifice all his pawns and pieces. White can win this by promoting but he finds a more pleasing way to win this.",
        "31. Kd2": "He intends to march his king to e7 thereby taking over the knights role as prison guard and freeing him to delver checkmate.",
        "31... Bc6 32. Kc3 e4 33. Kd4": "notice how the king sticks to dark squares.",
        "33... g5 34. Kc5": "personally I don't see white doesn't take the quicker route of e5, f6 e7.",
        "34... Ba8": "I would have kept my bishop where it was and instead moved a pawn forward. not that it really matters at this stage.",
        "35. Kb6 g4 36. Kc7 g3 37. hxg3": "Not fxg3?? which clears the path for the e pawn.",
        "37... e3 38. fxe3 Bc6 39. Kd8": "Not Kxc6?? which would be a draw because of stalemate.",
        "39... Ba8 40. Ke7": "With the new prison guard in position the knight is free to deliver checkmate on f6 which can be reached via e4 or e8.",
        "40... Bc6": "c6 is the only square the black bishop can stop mate on both e4 and e8. Any pawn move wins it for white now. ",
        "41. a3": "Black is in \"zungzwang\" His bishop has no choice but to vacate c6.",
        "41... Be8 42. Ne4 Bc6 43. Nf6#": "An amazing and beautiful finish to an unusual game."
    },
    "url": "https://gameknot.com/annotation.pl/a-brilliant-game-with-a-great-ending?gm=39487",
    "gameName": "a brilliant game! with a great ending",
    "players": "A.Kupferstich  vs. J.Andreassen ",
    "opening": "Vienna (C27), `Frankenstein-Dracula' variation"
}