{
    "moves": {
        "1. d4 d5 2. c4 dxc4 3. e3 e5": "Black does not fall for the famous trap 3...b5 4. a4 c6 5. axb5 cxb5 6. Qf3 winning a piece.",
        "4. Bxc4 Bb4+ 5. Nc3 Bxc3+": "This is unnecessary until White plays a3, if he does at all, and even then Black should consider keeping two bishops for the time being.",
        "6. bxc3 exd4": "This pawn exchange is inadvisable as it effectively concedes control of the center to White. Perhaps 6...Nd7 was better.",
        "7. cxd4": "Black has done everything White can hope for out of the opening, giving him two central pawns vs. zero, the two bishops, and a slight lead in development.",
        "7... Qd6": "Threatens Qb4+ but loses a pawn. Black should have considered 7...Nf6",
        "8. Qb3": "Hitting b7 and f7. On a second look I suppose Black can play 8... Nh6, but either way, he's disadvantaged himself with 7... Qd6.",
        "8... Be6 9. Bxe6 Qxe6 10. Qxb7 Qc6": "Even down a pawn, Black has to offer the exchange of queens to avoid losing the rook.",
        "11. Qc8+": "Exchanging queens wins, of course, but more slowly. This move gives Black a lot of ways to go wrong, which he does.",
        "11... Ke7": "Only legal move.",
        "12. Ba3+ Kf6": "Only move that doesn't lose the queen. [Edited thanks to comment from haile1996]",
        "13. Qd8+ Kg6": "The wrong square--Ke6 is probably best--as 14. Nf3 is now a double threat (Nxe5+ and Qg5#). Even if the king went to e6, 14. Nf3 Qc3+ 15. Ke2 Qxa3 is bad for Black due to 16. d5+ Kf5 17. Qg5+ Ke4 18. Qe5#",
        "14. Nf3 Qf6": "14...f6 stops both threats. This move technically does as well, but still allows the Knight check on e5. 14...f6 also has the benefit of threatening to trap the White Queen with 15...Nd7. Had it been played, White's Queen probably has to immediately plot an escape via f8.",
        "15. Ne5+ Kf5": "Again the wrong square for the king. 15...Kh5 (16. g4+ Kh6) was the only move that survives for any length of time. If 15...Kh6 then 16. Ng4+ and if 15...Kg5 then 16. h4+ Kh5 17. g4+ Kh6 18. g5+. As it is, Black is now fresh out of chances. ",
        "16. g4+ Ke4": "If 16... Kg5 then 17. h4+ Kh6 18. g5+ and if 16...Ke6 then 17. d5+ Kxe5 18. Bb2+",
        "17. f3+ Kxe3": "The only other legal move is 17...Qxf3.",
        "18. Bc1#": "The bishop did some efficient work in this game. If there are lessons here, I would say: remember the importance of development (ending a game with rooks on their original squares is one thing, but Black never even moved a knight), avoid cheap tricks that don't improve your position (such as Black's 7...Qd6), and always have a good reason when exchanging (Black's 5th and 6th moves were more helpful for White than Black)."
    },
    "url": "https://gameknot.com/annotation.pl/a-brief-game?gm=47982",
    "gameName": "A Brief Game",
    "players": "hscer (1200) vs. Black (1372)",
    "opening": "Queen's gambit accepted (D20)"
}