{
    "moves": {
        "1. e4": "\n",
        "1... d5 2. exd5": "[%clk 0:05:07]\n",
        "2... Nf6 3. d4": "Here, theory says Nxd4, but I don't like c4 etc.",
        "3... e6": "Icelandic, a little inferior, but I know it.",
        "4. dxe6": "Not the best move. White will have a better game by developing, instead. ",
        "4... Bxe6": "Two developed pieces against a single (but strong) central pawn. Let's see!",
        "5. Nf3 c6": "I know, but I just don't know how to play this without this move. It can be delayed, though.",
        "6. Be2": "Assuring castling. Not very aggressive. ",
        "6... Qa5+": "Not with the dsb. Bb5+, c3, Ba5, heading to c7... is just too slow. ",
        "7. Bd2 Bb4 8. c3": "now I have a tempo on b2, soon.",
        "8... Bd6": "This is the best square for my dsb in this opening. ",
        "9. O-O": "Still passive. I feared b4, c4 and a full pawn storm. I can always castle kingside.",
        "9... Qb6": "Threatening b2. A silly move, since it is easily defendable with Qc2. ",
        "10. b3": "It's ok. But black is starting to lead the game. White can play b4 later, but Nb1... has no square for some move on!",
        "10... Nbd7": "Developing, in order to castle Qside... if white lets me. ",
        "11. c4": "Obviously. I play a lot against those two pawns, and normally, with care, I get out of it. ",
        "11... Qc7": "Hitting h2, but I know I won't get it. ",
        "12. h3": "A little help for me. White pawns are nearer. If Nc3 (say), Ng4 and white has to defend. Nothing too bad, but, as often with this scheme, a tense and nice game, with the \"who'll get in faster\" factor that I love.",
        "12... h6": "Slow, but necessary. h5 at once just concede g5 for white's N or B...",
        "13. Re1": "The right moment for a risk: ",
        "13... O-O-O": "...just walking into enemy's field, but leaving my own pawnstorm set (g5, g4...).",
        "14. Nc3": "White, following principles, develops without a real scope instead of d5 at once. Who can assess it?",
        "14... g5": "No time to lose. Now g4 is the shadow of a threat. Let's see if white defends or goes for the attack. ",
        "15. c5": "I think this is the wrong pawn. White won't have time to play b4-b5.",
        "15... Bf4": "Losing my best attacking piece? Yes, but g4 doesn't work (after cxB, my Q is threatened).",
        "16. Bxf4": "Which one to retake with? g pawn or Q? ",
        "16... Qxf4": "The reason was: after this move, black still has g4 as a threat. After gxf, my Q is kind of cut off the attack, and g2 seems defendable. Moreover: white will be worried by my Q, and will lose the c5 pawn. ",
        "17. Bf1": "This defends g2, and allow Ne2, kicking my Q. But it allows...",
        "17... Nxc5": "I'd say \"sacced pawn recovered, cleanly\". ",
        "18. Ne2": "As predicted. No problem. ",
        "18... Qc7": "It looks not bad for black: white failed to open my K's position, and I am very near to open his.",
        "19. Qc2": "Now I thought about g4, and I wasn't sure it will work. True is that after gxNf3, my position becomes stronger, while QxN or dxN are not serious threats (but for Qxa6 by white, if QxN is played). ",
        "19... g4": "Now or never. I see white is a little passive, and I'll go on with my favourite play: attacking the castled K.",
        "20. hxg4": "Now, I swear my opponent thought I was about to sac the Nc5, but no. g4 is almost a goner, I don't have to lose a N for it. ",
        "20... Nce4": "Still, not the best: Bxg4, and if white takes the N, BxNf3 would be very strong, as gxB, Rg1+, Ng3, and then I just have to push the h pawn. In a quick view, of course. We were both with short time. ",
        "21. g5": "? Thank you white! ",
        "21... hxg5": "g4 threat renewed, and now the h file is open!",
        "22. g3": "Only move to stop me. Now, g4 is a mistake, since after Nh5, I'll have to sac the exchange to continue... probably winning, but risky!",
        "22... Rh5": "Better is to double R. Bg4 (not Ng4 or QxN) was probably best. ",
        "23. Bg2": "Defending h1 and reorganizing his pieces. ",
        "23... Bf5": "Treatening Nxg3. (If ever white moves his Ne2, I'll play instantly Nxg3)",
        "24. Qd1 Ng4": "I plan Nh2 at some point. Again I sensed g4 was too \"simple\" to be good, but probably I was wrong. ",
        "25. Kf1": "? If not for the Ne2, I'll play Nxg3, no doubt.",
        "25... Rdh8": "d5 is no longer a target. This is. Now, after f6, I'm ready for Qh7 at some point.",
        "26. Qc1": "[%clk 0:00:07] My opponent had only 7 seconds left. \n",
        "26... Nh2+": "[%clk 0:00:44] I have a little more time. This seemed proper, in order to get rid of Nf3, just to start. If white d5, I'll ignore it. \n",
        "27. Kg1": "[%clk 0:00:09] ? ...but white has almost no moves.\n",
        "27... f6": "Defending g5 and opening the way for my Q.",
        "28. Nc3": "[%clk 0:00:12] Finally! White couldn't use his pieces, but this is probably the losing move. Without ever thinking, I was happy to play...\n",
        "28... Nxg3": "[0:00:19] Sure white has some counterattack, but I'll take with check...\n",
        "29. fxg3": "Thank you white, again! I'm doing on a 3 minutes blitz against a +200!",
        "29... Qxg3": "This means: \"all black pieces are pointing at a naked white K...\" While white's are almost useless. With 2 or 3 moves, white will crush my K, but until then...",
        "30. Re7": "The first of the neeeded moves. Now Nd5 is kind of a threat. ",
        "30... Nxf3+": "[%clk 0:00:26] I recover seconds... I don't want to lose by time!\n",
        "31. Kf1": "Juicy!",
        "31... Bd3+": "Just wonderful. ",
        "32. Ne2": "Forced. Now it's easy: does Nh2+ win?",
        "32... Rh5h1+": "This is better.",
        "33. Bxh1 Rxh1#": "Weak game by white, but I think I found the way to exploit it. Hope you enjoyed! So late at night, I'm sure wrong on some assessement! "
    },
    "url": "https://gameknot.com/annotation.pl/a-careless-1600-op?gm=61876",
    "gameName": "A careless 1600+ op!",
    "players": "mmccall (1638) vs. damafi (1439)",
    "opening": "Scandinavian defence (B01)"
}