{
    "moves": {
        "1. d4 d5 2. Bf4 f6": "A very difficult (if not plainly wrong) line by black. But in this case...",
        "3. Nf3": "I let him proceed, and see what happens. White can do a little better with e6, opening at right the queen's way to h5+. ",
        "3... h5": "Interesting, trying to trap the bishop. And you know what? I'll let him! ",
        "4. e3": "? Much better was Qd3 or Bd3 at once. ",
        "4... g5": "Ok, it was a blitz. Sometimes you play in disadvantage just to see what happens. Most of the times you lose. But not always. Of course, \"don't try it with well rated players\" :-)",
        "5. Nxg5 fxg5 6. Bxg5": "Black needs care to handle his material advantage but horrible position. A good player would play something like Qd6, unpinning the pawn, and if Bf4, Qg6 reverts the threat on white. ",
        "6... Bg4": "? Horrible move, that makes clear black didn't see the hole in g6. With Bf5, I would be in real trouble. ",
        "7. Qd3": "At once. The queen will be much more powerful up there. But maybe it was a mistake. Anyway, tempoes are my priority in this kind of position. Black can't avoid the nasty check. ",
        "7... Nf6": "So he develops. The alternative was ugly: Be6 (to aswer Bc7 if Qg6+), but this would have left black horribly cramped!",
        "8. Qg6+ Kd7": "Ok, now what? What is the most attacking move I can do? Not threatening the black bishop, for sure: after Be6, I'll be standing where I am now, and black has Rg8. ",
        "9. Bd3": "\"? But it leaves the dsb en prise after Rg8, Qc7 (the only spot left)!\". Yes, but...\n",
        "9... Rg8": "Better for black was Qe8, mainly to provide the black king of another square, and forcing white to go Bf5+, e6, QxQ (virtually forced), KxQ or NxQ and the white attack vanishes. ",
        "10. Bf5+ e6": "Better than BxB because it would have returned the white queen of useful squares. ",
        "11. Qf7+": "Look at this unusual position: the white bishop is \"en prise\", by TWO pieces at the same time. Still, white has a great attack. The threat is BxNf6, threatening the black queen and making the R undefended. Can black defend with Qe7? Of course. And white has nothing to do but retire or exchange his lsb, and the game is -1 for me, with a piece less, and in a harmless position for black. But this requires a lot of \"cold blood\". ",
        "11... Kc6": "? This can have a good idea behind: moving the king to the other side, where I am more or less absent, maybe he can pass the storm. But better players than me will find funny, I hope, to check the lines. White has two escape routes, winning: BxNf6, QxNf6, and of course he can throw in Qxe6 first. But even this wonderful Qxe6 was enough to save and probably win the game, despite the piece less, I wasn't satisfied. ",
        "12. Bxf6": "Always threatening. ",
        "12... Bxf5": "?? Losing blunder. Black was overwhelmed by the complexity of the game, and overlooked the threated queen. Black could have given a look to Rg7, QxR, BxQ, BxQ, e6xB, but again white has Qxe6+ in the middle. Not now, of course. But it doesn't matter anymore. Nevertheless, the game is still interesting. ",
        "13. Bxd8 Bb4+": "Developing with tempo. But...",
        "14. c3": "? I take my tempo back. Of course, Nd2 worked exactly as well and probably better than this. ",
        "14... Rf8": "Here I was the one to overlook Qxc7, with mate in few moves: Kb5 (forced), a4+, Ka6 (forced), cxBb4, and I don't see how black can avoid b5#. Anyway. I missed it. ",
        "15. Qxh5 Bd6": "Well, after my blunder, even if I am +9, the situation is completely reverted. Black pieces will become active, while the rest of my forces are completely undeveloped and it will take some tempoes to disclose them. If I castle short, I'll have the two bishop's battery, soon supported by the rooks, against my king. I didn't like it at all. ",
        "16. Bh4": "Well, a bishop is a bishop. ",
        "16... Nd7": "Beginning with a threat on the h column. I wasn't able to correctly handle this, and I played: ",
        "17. Bg3 Nf6": "A choice. Black has plenty of mobility here, much more than I have. A good lesson for me. ",
        "18. Qd1": "Of course, this doesn't mean I'm lost. Even if this looks weird, my queen has no future in e2. I don't see a free way to develop quickly, so I will go on with my queen. The white's square weakness must be exploited. This is what I look for by playing games like these: look for the \"not so apparent\" way to attack. ",
        "18... Be7": "Questionable, but I understand: black doesn't want to exchange his good pieces. Of course, b5  was not saving him in the long term. ",
        "19. Qa4+ b5": "Oh, yes, now: fine, but...",
        "20. Qa6+ Kd7 21. Qxb5+ Kd8": "Better than c6, Qb7+ and Qc7#.",
        "22. Qb7": "Maybe not the best, but look: I'm effectively playing with a queen and a bishop against a good number of enemy's pieces. The game is still interesting. ",
        "22... Rc8": "The only and good move. Now I can take another pawn, but... this is not what I want. ",
        "23. Na3": "Time to call the cavalry :-) If BxN, it only opens the way for my rook. ",
        "23... Bxa3": "Black felt he could not stand the knight's attack. ",
        "24. bxa3 Ne4": "...and saw a threat on c3. I would be glad if he takes it! Ha can also exchange my dsb. ",
        "25. Bh4+": "So this is the way. ",
        "25... Kd7": "Here I harass the black king again... ",
        "26. Qb5+ c6": "Funny: exactly the same than before. Except that now, Qb7 just leaves black Rc7. ",
        "27. Qa6": "If Rc7, Rb1. ",
        "27... Nxc3": "I can't go Rb1 now, but I can go...",
        "28. Rc1": "Now I'm sure I'll win, at last. ",
        "28... Nb5": "Protecting a7, ok, but...",
        "29. Rxc6": "Losing the exchange, but making my material superiority more active. ",
        "29... Rxc6 30. Qxb5": "Pinning the rook. This was the key point, other wise Rc1+ and I lose a rook for free. I would win all the same, but this was the good sight I had some moves before. ",
        "30... Rfc8 31. O-O": "Ok, now I can do this confidently. ",
        "31... Kd6": "Black tries to unpin the rook, but this just leaves me...",
        "32. Bg3+ Ke7 33. Qb7+": "Now I can, and it is over. ",
        "33... Kf6": "Black could have resisted a little more with Kd8. But white has the nice Bd6+, RxB, QxR+.",
        "34. Be5+ Kg5 35. Qg7+ Bg6 36. f4+ Kf5 37. Qf6+ Ke4 38. Qxg6+ Kxe3 39. Rf3+ Kd2 40. Qd3+ Kc1": "Hard to die...",
        "41. Rf1+ Kb2 42. Qb3#": "A funny travel of the black king all over the board... I know it is not a great game, I just hope you to find it funny. "
    },
    "url": "https://gameknot.com/annotation.pl/a-central-mess?gm=52645",
    "gameName": "A central mess",
    "players": "damalfi  vs. snel ",
    "opening": "Queen's pawn, Mason variation (D00)"
}