{
    "moves": {
        "1. d4": "I annotated this game to force myself to review it and to (hopefully) improve as a player.  There are errors on both sides in game play and I am certain that there are errors in the annotation. Comments and constructive criticism are welcome.",
        "1... Nf6": "Developing the Knight and exerting pressure on the center without committing to a central pawn structure. ",
        "2. Nf3 e6": "Black opens a line for the King's Bishop and exerts control over d5.",
        "3. e3": "White chooses the Yusupov-Rubinstein system. I know very little about Queen's Pawn openings (why am I annotating this game?), but this seems to be fairly passive. The pawn on d4 is not in need of support and now, how will the Bishop on c1 be developed? ",
        "3... b6": "Aiming to fianchetto the Queen's Bishop to exert pressure on the long diagonal and to increase control of d5 and e4 in the center.",
        "4. Nbd2": "Playing the Knight to d2 rather than c3 allows the c-pawn to be pushed to c4 to fight for control over the d5 square or to c3 to support the d4 pawn. This Knight also helps White to control the important c4 and e4 squares.  The Knight on d2 blocks the c1 Bishop, but it wasn't going anywhere anyway.",
        "4... Bb7": "Developing the Bishop, aiming to exert pressure on the center with the minor pieces.",
        "5. Bc4": "This is a deviation from theory. Bd3 is normal, aiming at h7 and fighting for control of e4. At c4, the Bishop is subject to harassment from Black's advancing Queenside pawns. Perhaps White was trying to provoke d5 which would severely restrict the scope of the Bishop on b7.",
        "5... c5": "Attacking White's center, offering to exchange a c-pawn for one of White's central pawns.",
        "6. O-O": " ",
        "6... cxd4": "Another option here would be d5, pushing back the Bishop and equalizing in the center.",
        "7. exd4 Be7": "Developing the King's Bishop, preparing to castle.",
        "8. Ne5": "This move is a puzzle. White still has not developed his Queen's Bishop and the Knight, although temporarily centrally located, can be easily driven off before any threats develop. Perhaps white was hoping to provoke some sort of overreaction to this seemingly aggressive move.",
        "8... O-O 9. Bb5": "This move is also a puzzle to me. White seems to have wasted the last two moves, not losing any material, but losing time. This is the second piece that White has moved twice during the opening phase of the game, breaking one of the cardinal rules of chess.",
        "9... Qc7": "Developing the Queen to c7, exerting pressure along the c-file and the b8-h2 diagonal. Black has continued developing normally, ignoring White's premature advance of the Bishop and Knight.",
        "10. Re1": "Developing the Rook on the half-open e-file.",
        "10... d6": "Time to start gaining space with tempo by kicking the Knight.",
        "11. Nd3": "The Knight is probably better placed at f3 where it aids in the King's defense and does not obstruct White's other pieces.",
        "11... Nbd7": "Developing the Knight. Nc6 was also an option, locating the Knight more centrally, but I chose to not obstruct the scope of the Queen or the Bishop by placing it on d7. Note, however, that the Queen's protection of the Bishop on e7 is now obstructed. This could come into play with a pin of the Knight on f6 by the c1 Bishop or an advance of the central pawns.  Perhaps Nc6 would have been a better choice.",
        "12. c3 a6": "Gaing more space with tempo due to the poor placement of white's Bishop.",
        "13. Ba4 b5 14. Bc2 e5": "Black has finished developing (except for the Rooks- perhaps best placed on c8 and e8) so I decide that it is time to counter in the center and to attempt to gain control of the board.",
        "15. Nb3": "White opens a line for his bishop and prepares to retake with the Knight after exd4.",
        "15... e4": "Rather than liquidating the center, black gains a significant space advantage and restricts the movement of the White pieces.",
        "16. Nf4 d5": "White's Queen Bishop has now lost its influence over much of the a8-h1 diagonal, but Black's compensation in central control and space is more than adequate. The squares weakened by Black's central advance (c5 and e5) are well covered by the Knight and Bishop on d7 and e7.",
        "17. Bd2 Bd6": "Attacking the Knight and aiming for the pawn on h2.",
        "18. g3": "The light squares aroung White's King are now significantly weakened. This is  particularly true because White's light colored Bishop is cut off on the Queenside.",
        "18... a5": "Time to gain more space and push the Knight back.",
        "19. Ng2 a4 20. Nc1": "White's game is beginning to get cramped.",
        "20... Rfe8": "Developing the Rook.",
        "21. a3 Nb6": "The c4 square is now the ideal outpost for my Knight. ",
        "22. Bg5": "Threatening Bxf6, gxf6 with a wrecked pawn structure and an exposed Black King. Countering with Nb6-d7 would reverse my plans for that Knight and the Bishop would be in the way of the rook at e7.",
        "22... Nfd7": "Moving the Knight out of harm's way. The Black King seems exposed, but White has no real threat (that I can see).",
        "23. Ra2": "This must be a mistake. The pawn on b2 will need to be defended after the Knight moves to c4. However, the Rook looks misplaced here and is irrelevant for the rest of the game.",
        "23... Nc4": "The Knight is powerful at c4. It paralyzes White's Queenside.",
        "24. Qg4": "Starting an attack. Black's King seems lonely with almost all of his support over on the Queenside.",
        "24... Bc8": "Threatening White's Queen with a potential uncovered attack and moving the Bishop to an open diagonal.",
        "25. Bh6 Bf8": "Ending the attack. Fortunately, White cannot easily bring additional pieces to bear as his forces are scattered and isolated.",
        "26. Bf4 Qc6 27. Qe2": "Removing the Queen from the potential uncovered attack.",
        "27... Nf6": "Opening the diagonal for Black's Bishop to advance to take advantage of the weak light squares around White's King.",
        "28. Ne3": "White forces the exchange of Black's best placed piece.",
        "28... Nxe3 29. Qxe3": "What to do now? Black has the advantage (in my opinion), but with my Knight no longer on c4, much of the Queenside bind seems to have evaporated and is threatening to unravel.",
        "29... Nd7": "I decide to move the other Knight to c4. It will be a slow process, but my opponent seem to have no clear plan and no easy way to free his position.",
        "30. Kh1": "Preparing to push the f-pawn?",
        "30... Nb6 31. Qe2": "Grabbing control over the d1-h5 diagonal one move before I could grab it with my Bishop.",
        "31... Nc4": "The second Knight moves to the c4 square. Now I can breath a sigh of relief. This Knight will be more difficult for White to dislodge.",
        "32. Bg5": "This is a mistake. It allows my Queen to come over to g6, attacking the Bishop and gaining control over the d1-h5 diagonal.",
        "32... Qg6 33. Bf4 Bg4": "Now the White Queen's only option is retreat.",
        "34. Qf1": "Whit's position is cramped and his pieces are uncoordinated. Still, material is even.",
        "34... Bd6": "Trying to eliminate White's most active piece and a crucial defender of d2 and e3. ",
        "35. Be3": "Black avoids the trade, but allows the attack to continue by retreating. I think that White would have been better to trade Bishops. This would have forced Black to choose between either recapting on d6 and allowing White to partially untangle his position, or ignoring the Bishop capture and launching an all-out do-or-die attack on the White King.",
        "35... Qh5": "Pinning the h2 pawn.",
        "36. Kg1 f5 37. Bd1": "White tries to reduce Black's control of the light colored squares around his King by trading Bishops. In addition to the tactical considerations, it is generally good strategy for the player with a cramped position to trade pieces to reduce congestion.",
        "37... f4 38. Bxf4": "Probably better is gxf4, but this still leaves White in bad shape.",
        "38... Bxf4 39. Bxg4 Qxg4": "Black is now up a Bishop for a pawn in addition to having a positional advantage. ",
        "40. h3 Qg5 41. h4 Qg4 42. Qe2 Qxe2": "This is probably not the best move. Black's Queen is more active and better positioned to attack with coordinated support. However, I felt that this was a won game for Black and chose to simplify.",
        "43. Nxe2 Bd2 44. Rea1": "The rook is out of harms way here, but is not doing very much.",
        "44... Ref8 45. Rb1": "The Rook finds the correct square one move too late.",
        "45... Rf3 46. h5": "This move seems to indicate that White is out of options and is waiting for the end to arrive.",
        "46... Raf8 47. Raa1 Rf3xf2 48. Nf4 Be3 49. Nxd5 Rf8f3 50. b4 Rxg3+ 51. Kh1 Rh3+ 52. Kg1 Rd2+ 53. Nxe3 Nxe3": "And White resigns as the Rook will mate on g2. Thanks to my opponent. "
    },
    "url": "https://gameknot.com/annotation.pl/a-chess-game?gm=13102",
    "gameName": "A Chess Game",
    "players": "taycon (1870) vs. kg07 (1915)",
    "opening": "Queen's pawn (A46), Yusupov-Rubinstein system"
}