{
    "moves": {
        "1. e4 d6 2. d4 Nf6 3. Nc3 c6 4. Nf3 Bg4 5. Be2": "Fingerslip.",
        "5... d5 6. Be3 Nxe4 7. Nxe4 dxe4 8. Ne5 Bxe2 9. Qxe2 Qa5+ 10. c3 Nd7 11. f4 Nxe5 12. fxe5 c5 13. O-O cxd4 14. Bxd4 Qd5 15. Rae1 O-O-O 16. a3 Qb3 17. Bxa7": "Grabbing a pawn and allowing for Black to ...",
        "17... b6": "Trap the bishop.",
        "18. Qa6+": "Bring the Queen in to protect the bishop and put the king on the run.  I've yielded the second rank (hanging pawn on b3) but is there enough attack potential to create a mating net?  Black's buried dark square bishop help's White's cause.",
        "18... Kc7 19. Rxe4 Qxb2 20. Rc4+ Kd7 21. Rd1+ Ke6": "And now the king is on the run.  White's queen and bishop are stuck behind black's b6 pawn, and White's queen is stuck behind White's a3 and c3 pawns.  Unfortunately for White, Black's queen also protects his b6 pawn.",
        "22. Rc6+": "Trying to drive the Black king closer to White's camp.",
        "22... Kxe5": "Perhaps better is ...Rd6. After 23. Rcxd6+ exd6, Black's bishop has a little more breathing room.  Though the line could continue with 24. Re1+ and if 24...Kd7 then 25. Qb7+ makes things interesting.",
        "23. Rxd8": "This move gives Black a tempo to counter.",
        "23... Qc1+ 24. Kf2 Qf4+ 25. Ke2 Qe4+ 26. Kd2 Qxc6": "And Black wins back the rook and has brought his queen out.  Now how can White take advantage?  His bishop is pinned (as is Black's) and his king is exposed (though not quite as bad as Black's).  White can bring his queen into the action again pretty quickly.  The real advantage for White is his rook is on an open file while Black's rook is trapped and useless.",
        "27. Qe2+ Kf5 28. g4+": "Supported by the queen on e2.",
        "28... Kg5 29. h4+": "Sacrificing the pawn to draw the Black king farther from his queen and to the edge of the board.",
        "29... Kxh4 30. Qh2+ Kxg4 31. Rd4+ Kf3 32. Qh3+": "Bringing the Black king into White's camp (or what is left of it)!",
        "32... Kf2 33. Rf4+": "If 33...Qf3 then 34. Qxf3+ wins.",
        "33... Kg1 34. Qf1+ Kh2 35. Qf2+": "If 35...Qg2 then 36. Rh4++.",
        "35... Kh3 36. Qh4+ Kg2 37. Qg4+ Kh1 38. Qh3+ Kg1 39. Rf1#": "And the Black king is mated as his queen watches with a wide open spectacular view!"
    },
    "url": "https://gameknot.com/annotation.pl/a-checkmate-with-a-view?gm=57495",
    "gameName": "A Checkmate With A View",
    "players": "John (1694) vs. Nook (Hard)",
    "opening": "Pirc (B07), Ufimtsev-Pytel variation"
}