{
    "moves": {
        "1. e4": "please leave comments!",
        "1... e6 2. d4 d5 3. Nc3": "this is considered to be white's most dangerous continuation. 3.Nd2 is also strong.",
        "3... Nf6 4. Bg5 Be7": "We are entering the Classical Variation of the French Defense. 4...Bb4 is the MacCutcheon variation.",
        "5. e5 Nfd7 6. Bxe7 Qxe7 7. f4 a6 8. Nf3 c5 9. dxc5 Nxc5": "We are now out of book. The main continuations are 9...Qxc5 or 9...Nc6(the c pawn is doomed no matter what.) This continuation is considered very slightly inaccurate by theory.",
        "10. Qd2": "My plan is to castle 0-0-0, predicting that black will castle 0-0. In that case, my pawn storm on the kingside will likely come first. If black decides to castle 0-0-0, his king will be exposed and easier to attack.",
        "10... Nc6 11. O-O-O Bd7 12. f5": "A strong move to undermine the black center. Taking on f5 will be a positional victory for white, as the black center is heavily weakened.",
        "12... O-O-O": "The black king is weak on the queenside. I should advance my pieces to attack over there.",
        "13. Qf4": "My queen takes an advanced post, where it will play an important role in an attack on the queenside once some lines open up. ",
        "13... f6": "(?!) a dubious move. White has a tactic to win a pawn and enter an unclear position. The weak position of the black king is crucial in the following tactics.",
        "14. exf6 Qxf6": "Now the tactic becomes a little more obvious.The black king has no available squares. One safe check that cannot be blocked will lead to mate. ",
        "15. Rxd5": "(!?)a very interesting move. The middlegame is more complicated, and both sides will have to be very careful to avoid tactics. The first point is 15...exd5?? 16.Nxd5 and white wins a lot of material.\nHowever, black seems to have plenty of resources, and white must be careful each turn. @eden8: After your line 15...exd5?? 16.Nxd5 Ne5, white just chops off the queen with 17.Nxf6",
        "15... Qf8 16. Kb1": "the king slides to a completely safe spot. Black has no threats. Here, 16.Bc4 is also seemingly acceptable.",
        "16... Qe7": "The black queen could have came here in one move. Now white needs to get the remaining force into the game.",
        "17. Bc4": "After these few turns, the rook is still hanging but immune to capture.",
        "17... Rhf8 18. Re1": "All of white's force is out on the field, and black's position is steadily growing more critical. Notice that the rook is still immune to capture because of the black king.",
        "18... g6 19. g4": "everything is under control on the kingside. Black's counterplay has been suppressed.",
        "19... b5": "(?) A bad move, once again due to the vulnerable position of the king. White's next move totally shocks black.",
        "20. Bxb5": "(!) The reason for the exclamation mark was the nice tactical combination for this pseudo-sacrifice. The bishop is immune, like the rook. NOW STOP!!!!! and see if you can find the tactic that I that I had prepared. Tiktiktiktiktik.... After you find the solution, you can flip to MOVE 25, and see if you were right. Anyways, the move completely destroys the black king's cover.",
        "20... Nb8": "The bishop is immune(see move 25 for why) just like the rook. The black king is in a critical position, and white is now simply winning. Black is cut down to this defense.",
        "21. Qe5": "continuing with the initiative. I threaten to take the knight.",
        "21... Nb7 22. Na4": "Now look at the position. White is attacking with 4 pieces, which is usually not enough if black has all these pieces in the area. However, the pawn cover is down, and the threats being generated are very strong.",
        "22... Nd6 23. Rxd6 Bxb5 24. Rxe6 Qc7": "Now I find a simple way to simplify into a won endgame. ",
        "25. Re7": "*Now for the solution to the question on move 20: 20...axb5?\n21.Nxb5 Na6 22.Nd6+ Kc7 23.f6! 23...Rxf6 24.Ne8++ when white wins a lot of material",
        "25... Rd7 26. Re8+ Rxe8 27. Qxe8+ Kb7 28. Qe4+ Kc8 29. Nc3": "The position is now crystal clear. White is 3 pawns up, and black's weak king gives him a lot of headaches.",
        "29... Bc6 30. Qe3 gxf5 31. gxf5 Bxf3 32. Qxf3 Nc6 33. Re6": "I still have a nice initiative, and I use it to make more threats to the enemy.",
        "33... Rd6 34. Rxd6 Qxd6 35. f6": "my short term plan is to simply create a sort of \"2nd weakness. The passed f pawn is a dangerous threat which must be stopped, but black needs to safeguard his king as well. ",
        "35... Ne5 36. Qa8+ Kd7 37. Qa7+": "Just as I said, the black king is very exposed.",
        "37... Ke6 38. Qxh7 Kxf6": "Losing the queen, but white would have won easily anyways. ",
        "39. Ne4+": "black resigns. One of the best games I have played."
    },
    "url": "https://gameknot.com/annotation.pl/a-dangerous-french-game?gm=33804",
    "gameName": "A dangerous french game...",
    "players": "Me (----) vs. dragonlore (1789)",
    "opening": "French (C14), classical, Steinitz variation"
}