{
    "moves": {
        "1. Nf3": "Oh joy an opening I wasn't familiar with. I kept calm and thought it trough. Either he's gonna play d4 or fianchetto. In both cases I want to play d5. Either to go into some strange queen pawn opening, the opening I'm most familiar with ( d4 d5 is my openingrepertoire as white ), or I make his white Bishop a tiny bit less powerful, by blocking that diagonal.",
        "1... d5": "Please for the love of .... just play d4 so I can actually go into theory lines I'm familiar with.",
        "2. g3": "Guess we're leaping in the unknown, oh joy. Well Bishop g2 will follow, that much I'm sure of.",
        "2... Nf6 3. Bg2 Nc6": "Perhaps I should have waited with bringing my knight out. Maybe Bishop f5 and then Knight from b8 to d7 would have been better. No point in thinking about it now, my opponent is  over 1750 elo, it'd surprise me if he didn't know the theory behind both knight moves.",
        "4. O-O Bf5 5. d3": "Preparing to bring his bishop out and planning e4.",
        "5... e6": "I was told afterwards by my opponent that this move might already be a tiny error. e5 is more aggressive and takes more central control, I'll soon notice why e5 was better.",
        "6. Nbd2": "His position is something I'd expect to see from black, not something from white. The e4 square is being targeted once again and he's preparing to eventually bring his knight to b3 I suppose.",
        "6... Bc5": "If I had played e5 then theory suggests d6 would have been a better square. Well I'm not following the main lines anyway. I figured I'd prevent a shove of the f2 pawn in the future. This might be a mistake since Knight b3 might follow, costing me a tempo, but I figured he'd lost the tempo when playing knight d2 anyway.",
        "7. c3": "And here the fun starts, oh jeebus christ. d4 is obvious, but it'd make my bishop a rather funny looking piece. I didn't feel like my bishop would do well on d6 so I decide to play it differently.",
        "7... e5": "And for this reason I should have played e5 immediately. So this kind of BS isn't in his plans to begin with.",
        "8. Nxe5": "I'll be painfully honest here, I didn't see this combination when I played e5. What looks like losing a knight, is actually opening the centre. ",
        "8... Nxe5 9. d4": "Now there're 3 options. Option A, take the pawn with my bishop and win back the material, option B, move my knight to d7 or option C: move my bishop to d6, he takes, i take back. I didn't really consider option B and option C didn't feel right. I can't really tell you why, it just felt wrong. Perhaps because I valued my Knight so much. I know bishops are usually better in an endgame, but I felt like I needed the knight to prevent losing the centre.",
        "9... Bxd4 10. cxd4 Nc6 11. Nf3": "This move surprised me, I was expecting Knight b3. Maybe because he wants to make his knight an attacking piece when I castle.",
        "11... O-O 12. a3": "??? I didn't understand this move. I guess he wants to do a minority attack on the queen side, but with 2 pawns and no minor pieces? Maybe he wanted to prevent Knight b4 followed by Knight c2, I guess that must be it. Since then I'd get a nasty attack going after he moves his Rook. I wonder if he could have prevented that combination if he didn't immediately play a3.",
        "12... Re8": "Taking control of the semi-open file.",
        "13. Bg5": "He hopes I'm not going to take action and tie my queen to my knight. Sorry friend, I've ignored bishops like these a tad too often in the past, I know how it'd end.",
        "13... h6 14. Bf4": "He's provoking me to play g5. I thought about it, but it weakens my king's safety too much. His bishop is eyeing down on c7.",
        "14... Qe7": "Putting pressure on e2. I'll deal with the threat of Bxc7 later.",
        "15. Re1": "Subtle, but it works.",
        "15... Nh5": "Getting that bishop to the other side of the board. ",
        "16. Bd2": "Here I felt for the first time that I was ahead, Maybe I should have played Nf6 in the hope he'd play Bishop f5 once more and then go for a draw by repetition. But there's no fun in that, if you're up versus a titan then escaping with your life is good, but imagine if you actually kill said titan. BAM you're a local hero. ( Not really, but you get my point. We got this far, might as well continue it. )",
        "16... Be4": "I want to prevent e4 and potentially in the future take his Bishop on g2. This move meets both requirements.",
        "17. Bc3": "The pawn on d4 hangs if I were to take the knight on f3. I had no intention on doing so, but I understand why he played it for sure. One pawn means the world to players of our level. Not only does it crush the opponents moral, but it also makes a statement. I'm going for your head mate, be prepared.",
        "17... Nf6": "My knight was looking silly and I had the feeling Ne5 would be coming. Later it turned out that my opponent never calculated Ke5 at all, didn't even consider it. Me preparing for Ne5 is probably what cost me the game. It all goes downhill from here.",
        "18. Rc1 Nd7": "Preparing for Ne5.  Getting my knight away from the king side will soon prove lethal.",
        "19. Bh3": "He wants to regain some space, he's also tempting me to take his knight, but I didn't feel like giving him the bishop pair.",
        "19... Nb6": "I wanted to get my knight on c4. Not sure why, probably because it looked amazing, but looking back at it now, yes a knight on c4 is cool and all, but it doesn't really accomplish much.",
        "20. Nd2": "Well shait.",
        "20... Qf6": "I question myself why I didn't just move my bishop to a square like g6 or h7. Soon I'll find out that that was probably better.",
        "21. Nxe4": "It suddenly occurred to me that taking dxe4 is followed by d5. Looking back at it now, I would have had the defence of Ne5 if that had followed. I didn't consider it back then since it'd pin my knight to my queen.",
        "21... Rxe4 22. Bg2 Re6": "This move is a mistake. It may not seem like it, but Re7 was miles better. The reason being e4. He doesn't miss this beauty of a move.",
        "23. e4": "Now I'm bound to lose material if he gets his e4 pawn on d5. I opted to play for trickery. Maybe not the brightest choice versus someone of his caliber. Another option would have been Re7, he takes, I recapture. And the material is once again dead even, however enabling the d4 pawn will get quite a bit easier. He'd play something like Qb3, force my knight back to b6, start pushing his pawns on the d line and eventually he'll get of an attack with his bishop on my queen. That's far too complex to play against a superior opponent. ",
        "23... Rae8": "Now he can't take my pawn, I knew e5 would follow, but I figured it'd be alright. At this point I realized I had to play for a draw rather then a win.",
        "24. e5 Qe7": "One of the only squares that saves my queen some potential in the future, or so I thought...",
        "25. f4": "If the Fide ever releases a dictionary then this move is the picture you'd see when you search for unpleasant and cramped position.\n\nI misplayed 1-2 moves rather drastically and this is the result. Guess we're bunking up boys!",
        "25... f5": "The only move that prevents f5, which is a game over. Him taking en passant doesn't help and is actually beneficial to me. I offered him a draw offer here. He respectfully declined stating that there was still a lot of chess to play here. I figured maybe he'd take the draw since he didn't realise how to break through this structure. It'll take him about 10 more moves to figure it out, but eventually he will.",
        "26. Qc2": "Attacking my f5 pawn.",
        "26... Rf8": "As long as my Rook on e6 stays there it'll be alright. His bishop on c3 is also still immobile. ",
        "27. Qb3": "attacking more stuff. Moving my Queen would have been best, but I wanted to try and get to a repetition.",
        "27... Rd8 28. Re2 g5": "I doubt if this was the best move, but he'd start a similar plan soon. I'd rather try and take the initiative.",
        "29. Rf2 g4": "Here I thought I had the draw. He could force his h pawn, but that doesn't leave much room for his pieces to get trough. Especially if I put my king on he 7th or 6th rank. Or so I thought...",
        "30. Bf1 Kg7 31. Qc2 Kg6 32. Bd3 Qf7 33. h3": "And here the pain begins. You can probably guess how it continues.",
        "33... h5": "Please just push that h-pawn.",
        "34. hxg4": "No such luck eh? my position is in fact miles worse then I imagined at this point. You'll see why.",
        "34... hxg4 35. Rh2 Rde8 36. Bxf5+ Qxf5 37. Rh6+": "And I resigned here. Black gets a minor piece and a rook for his queen and pawn, but the white queen is in the middle of my structure and I don't see black defending threats like e6 and f5 anytime soon. The game had already lasted for nearly 4 hours and I'd rather spend dinner with my family then trying to win a hopeless battle."
    },
    "url": "https://gameknot.com/annotation.pl/a-david-vs-goliath-situation-1800-elo-vs-unranked?gm=57744",
    "gameName": "A David vs Goliath situation ( 1800 elo vs unranked )",
    "players": "Roger Van Decraen (1780) vs. Jeremy Goris (Unranked)",
    "opening": "Reti (A07), King's Indian attack, Yugoslav variation"
}