{
    "moves": {
        "1. e4": "Hi everyone!\r\n\r\nAfter inflicting a pawn stab which stole Steve's knight and 10 rating points off him, I had to hand them back after this game which was the Traxler Mini Tournament.  I drew with Steve with the white pieces - in fact I never got round to annotating that particular game - I really must rectify this - but I was not so lucky here.  I thought my joblock fortress was really watertight but Steve managed to ensure that it sprung a leak somewhere!  So, how did this happen?  Well, after the forced moves, 4. .... Bc5 we pick up the action on move 5.",
        "1... e5 2. Nf3 Nc6 3. Bc4 Nf6 4. Ng5 Bc5 5. d4": "5. d4 - an unusual twist, usually it has been Bd5 or Bb3 here.",
        "5... d5": "5. ....... d5 - this pawn move triggers off a series of trades.",
        "6. Bxd5 Nxd5 7. dxc5 Ndb4 8. a3": "8. a3 - after an exchange of bishops Steve puts the question to my knight on b4.  Before I move it comes a queen trade.",
        "8... Qxd1+ 9. Kxd1 Na6 10. Be3": "10. Be3 - development.",
        "10... Bg4+ 11. f3 O-O-O+": "11. ......... 0-0-0+ - I respond in kind, getting my pieces out with tempo......",
        "12. Kc1 Bh5": "13. ...... Bh5 - ...... before retreating Fou Leblanc to h5.",
        "13. b4": "13. b4 - pawn roll.",
        "13... Nab8 14. Nc3 h6 15. Nh3": "15. Nh3 - I try and get some counterplay in by driving back Steve's knight on the kingside.",
        "15... Ne7 16. Nf2 f6": "16. ...... f6 - lending support to my pawn on e5.",
        "17. Kb2 a6 18. a4 Bf7 19. b5": "19. b5 - Just like Old Man River those queenside pawns just keep on rolling, they keep on rolling, they keep on rolling along!",
        "19... Rhf8 20. Nd3 a5": "20. ...... a5 - an attempt to stop that rolling nonsense.",
        "21. Rhd1 Rfe8 22. Bd2 Nd7": "22. ...... Nd7 - I attempt to move my knight to a better square before he is completely boxed in on b8.",
        "23. Ne2 b6 24. c6 Nf8": "24. ..... Nf8 - luckily my knight has an escape square on f8.",
        "25. Kb1 Ne6": "25. ...... Ne6 - I try and find a better square for my f8 knight.",
        "26. g3 Nd4 27. Nxd4 Rxd4": "27. ........ Rxd4 - a knight trade and then an attempt to contest the d column.  This plan did ensure that I held out for a long, long time.",
        "28. Be3 Rdd8 29. Bc1 Ng6 30. Bb2 Nf8": "30. ..... Nf8 - Steve doesn't seem to be making much progress and as his rating was close to my own I decided to offer a draw here - no takers however - this decision of Steve's proved to be correct, sigh and double sigh!",
        "31. Rd2 Ne6 32. Bc3 Nd4 33. Bxd4 Rxd4": "33. ..... Rxd4 - another pair of minor pieces have been traded and I still contest that d column.",
        "34. Kb2 Red8 35. Ka3 Bc4 36. Rad1 Bf7 37. Re1 Bc4": "37. ...... Bc4 - trying to maintain the status quo.",
        "38. Re3 Rd4d6 39. Rd1 Rd6d4 40. f4": "40. f4 - this pawn break will spell the beginning of the end for me, this is how Steve managed to find the ammo to dynamite the Joblock.",
        "40... exf4 41. gxf4": "41. ...... gxf4 and then I reply g5 - this attempt to completely fracture Steve's kingside backfires on me big time.",
        "41... g5 42. f5 Re8 43. Nf2 Rxd1 44. Nxd1": "44. Nxd1 - one pair of rooks is traded off.",
        "44... h5 45. Nf2 Re7 46. Kb2 Bf7 47. Kc3": "47. Kc3 - the start of a decisive king walk.",
        "47... Kd8 48. Kd4 Ke8 49. Rh3 Kf8 50. Nd3 Re8 51. e5": "51. e5 - another decisive pawn break, this exchange is virtually forced.",
        "51... fxe5+ 52. Nxe5": "52. Nxe5 - oh dear, in comes Steve's horsie.  I check him on d1 but this does not stop Steve's horsie in his gallop because here comes a cross check!",
        "52... Rd8+ 53. Nd7+ Kg8": "53. .... Kg8 - was Kg7 an improvement?  - Maybe because I am about to drop another pawn ........",
        "54. Rg3": "54. Rg3 ..... I now lose another pawn and with a passer on the f column and a potential one on the h column, not to mention white's advanced pawns on the queenside spells a very gloomy outlook - it's just soooo depressing to continue so I decided to write this one off - well played Steve - Joanne!"
    },
    "url": "https://gameknot.com/annotation.pl/a-day-of-ups-and-downs-part-1?gm=29416",
    "gameName": "A Day of Ups and Downs Part 1",
    "players": "untateve (1754) vs. jstevens1 (1772)",
    "opening": "two knights defence (C57), Wilkes Barre (Traxler) variation"
}