{
    "moves": {
        "1. d4 d5": "I am currently a fan of the Dutch Stonewall against 1. d4, but I've found many anti-Dutch variations annoying, for example the Staunton gambit, so now I transpose via QGD - Semi Slav - Stonewall.",
        "2. c4 e6 3. Nc3": "Should White have proceeded with 3. cxd5!? Black can simply recapture with a nice Rubenstein pawn structure.",
        "3... c6 4. Nf3": "This was White's only chance to keep Black out of the Dutch (should they know I want to play it or just should they play the variation themselves). 4. e4 keeps the game a Semi-Slav, but is perfectly fine for Black after 4...dxc4.",
        "4... f5": "And finally my Stonewall is constructed. Now against cxd5 I respond with cxd5 (or exd5!? if I'm looking for a risky game for a fast win). White's next moves demonstrate a complete lack of understanding of the Stonewall position.",
        "5. Qc2": "Perhaps 5. Bg5, 5. Bf4, or 5. g3 are superior. It is unclear where the queen belongs at the moment and White is still two steps away from castling.",
        "5... Nf6 6. e3": "A slight bit dubious. Hemming in the DSB is only thematic when the queenside knight is still on b1 and the queen is on d1, that way Ba3 can be organized with b3 and if Qe7 then Bb2 and Qc1. Here it just seems like White's DSB is simply inferior.",
        "6... Bd6 7. b3 O-O": "And I have finished my obvious developing moves. Next I must decide whether I want to continue to develop towards the center or towards one of the sides of the board. ",
        "8. Bb2": "The only decent square for the DSB, but once again White should consider trying to castle with 8. Bd3 or 8. Be2. Castling queenside is risky since all 3 B to D pawns have moved and Black can exploit the king rather quickly.",
        "8... a6": "Playing for 9...b5, a thematic attack to open the c-file, which is better since it is where the queen currently lies (as well as a pin-able knight). Also discourages cxd5 as Nb5 is no longer an option afterwards.",
        "9. a4": "Stopping b5 but I think White is overstretching. The b4 hole is hard to deal with, and the multitude of pawn breaks makes castling queenside impossible (or at least poorly advised). ",
        "9... Qe7": "Developing the queen to a natural location as well as preventing 10. Ba3. Although the 2-Tempo bishop would be technically a good trade for the 1-Tempo bishop, I want to keep my DSB with my pawn structure as it is, especially since his structure is weak on the queenside dark squares. Stockfish recommends 9...a5, but as it doesn't threaten anything immediately and makes a future b5 push harder, I opted against it. I already have plenty of control of b4, and want to respond to cxd5 with cxd5.",
        "10. Ne5": "First technical mistake of the game. White loses his opening advantage with this dubious move. The knight move is a prime example of over-stretching: White should be focused on castling and finishing his development. This move makes the knight a weakness, and even if he should retreat the knight later I will have gained a few tempos on his knight moves and have a better grip on future e5 maneuvers. ",
        "10... Nbd7": "The obvious reply. Putting scrutiny on the knight on e5 while developing to a completely natural square.",
        "11. Ne2": "Horribly dubious. White neglects all opening principles with this (and the last) move: don't move a piece twice in the opening, don't retreat unless there is a clear advantage, etc. White once again has left his king 2 moves from castling to safety, and this time it's too late.",
        "11... Bb4+": "When your opponent plays odd moves or passively, you must find a swift tactical blow. In this case, Black's development is complete aside from the LSB and the a8 rook, so it is here where you must calculate how to punish White's play. This is the critical position where you must spend time to calculate: I spent about 10-15 minutes ensuring that I had found the best move. In this case, the weakness on b4, specifically the a5-e1 diagonal comes back to haunt White. Now he must tread carefully in order to not be crushed quickly. Stockfish eval (-1.1) Depth 23",
        "12. Bc3": "White should have considered 12. Nc3, allowing the pawn to drop on e5 with hopes that the DSB will become active on the diagonal after Bd3 and 0-0. 12. Bc3 is equally bad, but leaves Black with some nice positional trump cards even with correct play.",
        "12... Nxe5 13. dxe5 Ne4 14. f3": "Here White needed to avoid creating more weaknesses, and although this move does so it is still difficult to recommend anything better. If White does not force the knight to move it is unclear how he will finish his development, let alone save the e5 pawn.",
        "14... Nxc3": "Snagging the bishop-pair and a pawn.",
        "15. Nxc3 Qc5": "The punishing move. Here I target all 3 of White's weaknesses: the e5 pawn, the e3 pawn (thanks to 14. f3), and the c3 knight (indirectly). As they say, loose pieces drop off, and one of those will drop off on the next move.",
        "16. Qd3": "Allowing Qxe3 would be horrible, so either Qd3 or Qd2 is necessary.",
        "16... dxc4 17. bxc4": "Not falling for 17. Qxc4? Bxc3+ where White can resign with a clear conscience.",
        "17... Qxe5": "An improper pawn grab. 17...Qa5 was superior, threatening Rd8 followed by Qxe5 where the e3 pawn is falling off soon after. However this move does have its perks. Black will be able to secure a space advantage and beautiful center, all the while keeping White's queenside under question. White is still much worse here.",
        "18. Rc1": "Forced. 18. Kd2 is just terrible.",
        "18... Qa5 19. Be2 Rd8 20. Qc2 Qc5": "And now e3 comes under scrutiny again. Instead of taking on c3 and a4 (20...Bxc3 21. Qxc3 Qxa4) where it is unclear whether Black can do anything with the extra pawn as White can calmly castle kingside and apply pressure to the A and B pawns (Benko gambit-esque).",
        "21. Kf2 e5": "Creativity at full power: 21. e5! Although it may seem like a natural move to simply develop the LSB to e6 and connect the rooks, there is a deeper, more devious purpose to this push: 22...Qxe3! is now being threatened, after which Black wins decisively even if the king retreats: \n\n[Dummy move 22. a5] 22...Qxe3 (23. Kxe3?? Bc5#)(23. Kf1 Rd2!-+) 23. Ke1 - and black can proceed with several plans: 23...b5 to open the queenside, 23...e4 to open the center, 23...Be6 to develop and threaten c4, etc. It's all losing for White.",
        "22. Rhd1": "My opponent played this move quite quickly: maybe a natural developing move, maybe a response to my threat on e3. Either way it stops 22...Qxe3, so I will assume that my opponent was aware of my intentions.",
        "22... Be6": "Unfortunately, I must go with Plan B: develop normally and win from a superior position.",
        "23. Bd3": "Dubious, but why?!",
        "23... g6": "Dubious myself?! I calculated the correct continuation, and still kick myself over missing it: 23...e4! [24. fxe4 f4! 25. Qe2 fxe3+ (-+) and the queen cannot recapture or it will be won via deflection: 26. Qxe3? Rf8+ 27. Ke2 Bg4+]. 23. g6 does not lose any advantage but does not gain anything either. It actually probably slows down any potential kingside play in the future. Either way, you learn from your mistakes.",
        "24. Qe2": "Logical move to defend e3 to allow the White king to flee to safety.",
        "24... Qe7": "A useful centralizing move. Allows the queen access to any side of the board and prepares to double rooks more effectively.",
        "25. Kg1": "Necessary. 25...Bc5 can now be met with Kh1.",
        "25... Bc5": "Played anyways. The bishop cannot be kicked from c5 and the weakness on e3 will not be going anywhere without creating further weaknesses.",
        "26. Kh1 Rd7": "Calmly doubling rooks. When it is unclear how to continue the attack, many lower-rated players lash out, but experts and masters just improve their position. All of White's pieces are optimally developed, and there is no clear plan for White to do anything to attack. I'll just simply improve my last piece and begin the vice-grip.",
        "27. e4": "Like I said about lower-rated players, White lashes out, violating many rules (keep pawns on the opposite color as your bishop, advancing pawns creates weaknesses that cannot be repaired, etc.) and allowing Black to complete his vice-grip faster.",
        "27... f4": "Now Black has a space advantage in the center and on the kingside. The LSB can support g5-g4 or h5-h4-h3, or itself go to h3 should the g2-pawn move. Be3 is now a powerful idea to increase my grip on the d-file. White is now in, cue the music, dire straits. ",
        "28. g3": "And another mistake of lashing out. g3 does nothing realistically to help White, but it creates targets for Black to exploit.",
        "28... Be3": "An important tempo-gainer to allow gxf4 to be met with Bxf4, as well as to emphasize the weakness of the dark squares in White's position.",
        "29. Rcb1 Rad8": "And calmly finishing development. White, now facing threats on the queenside, kingside, and down the center, attempts to simplify, but it is too late.",
        "30. Bc2": "30. Bc2? loses on the spot. Black needs not capture on d1.",
        "30... Rd7d2": "And a piece is lost, thanks to the Bishop on e3. And as if losing a piece wasn't bad enough, the lasting grip on the White king is easily losing. Stockfish eval (-8.3)",
        "31. Qe1": "Wanting to avoid any unnecessary simplification. At least he follow the rule that when down, try not to trade: it leaves more winning chances.",
        "31... Rxc2": "Winning the piece. Now 32...Bh3 is threatened.",
        "32. Rxd8+": "And as quickly as White follows the rules, he breaks them again: lashing out to simplify. Perhaps he thought he would win the pawn on b7, but after 32...Qxd8 33. Rxb7?? Rc1 crushes all hope. Frankly the position is already resignable.",
        "32... Qxd8 33. Rd1": "Now seeing the refutation to the pawn-grab, White futily attempts to gain a tempo on Black's queen, in lieu of any actual threats. \n\nI never know why players like to play these kinds of positions out, it seems absolutely hopeless and no fun at all. It frankly is disrespectful to a degree (at least OTB) as it is basically saying that your opponent's time is not valuable and that you think they could mess up a position this winning (Stockfish eval -16.5). At class C or below maybe it would be acceptable, but certainly not in the Expert section.",
        "33... Qa5": "Forcing simplification. Slightly better was 33...Qg5, but not by much.",
        "34. Nb1": "Stockfish recommends Ne2 instead, but it's all losing now.",
        "34... Qxe1+": "I had foreseen the winning combination, so I played it quickly and without mercy.",
        "35. Rxe1 Bh3 36. Rg1 Bxg1": "An inaccuracy, a mistake or blunder even. Slowing down would have helped me see 36...Bg2+! mating by force (37. Rxg2 Rc1+ 38. Rg1 Rxg1#), but to be fair this wins quickly as well.",
        "37. Kxg1 Rc1+": "And my opponent resigned, finally facing the inevitability of their loss. An informative game of how to play high-precision chess against a strong but inaccurate opponent. Hope you got something out of this game, and thanks for reading!"
    },
    "url": "https://gameknot.com/annotation.pl/a-dubious-dutch-stonewall?gm=59285",
    "gameName": "A Dubious Dutch Stonewall",
    "players": "Anonymous (1907) vs. CheapShotFail (1914)",
    "opening": "QGD (D31), semi-Slav, Noteboom variation"
}