{
    "moves": {
        "1. d4": "My standard opening.",
        "1... Nf6": "Most common.",
        "2. c4 e5": "Hmm....",
        "3. dxe5 Ng4 4. e4": "I could have hung onto it, but I sensed that this is one of those gambits where black usually gets his pawn back. I could be wrong though.",
        "4... Nxe5 5. Bf4 Qf6 6. Bxe5 Qxe5 7. Nc3 Bc5 8. Nf3 Qh5 9. Be2 Qg6 10. O-O": "And we're left with a rather interesting position. My development is superior and I have better central control, but he has the potential for a quick attack...",
        "10... d6": "Threatening Bh3",
        "11. Rc1": "? Not good.",
        "11... Bh3 12. Nh4 Qg5 13. Kh1": "I thought this was best. I end up down a pawn and there's a clear breach in my king's wall of pawns, but at least I'm only down a pawn.",
        "13... Qxh4 14. gxh3 Qxh3": "Things are looking pretty bad for white now...",
        "15. Bg4 Qh6 16. Rc2 d5": "Hm... I'm not sure I like this, it allows my to connect my pawns.",
        "17. cxd5": "I think this capture was best.",
        "17... Bd6": "Oh... So that's why the sacrificed a pawn. Well I don't think this is worth it. Although it does allow him to regain his pawn.",
        "18. f4 g6": "? He should have taken my pawn. Now I have an imposing wall of pawns aimed at him.",
        "19. e5": "I press my advantage.",
        "19... Bc5": "And... Force him into a more active square. But that doesn't really matter now as I have the initiative. His queen, once a danger is now out of place and incapable of helping defend. My queen offers support to the d file.",
        "20. e6": "Trying to force open a file.",
        "20... fxe6 21. Bxe6": "I had to think about it, but I thought this was best.",
        "21... Bd6 22. Rcf2 Na6 23. Re1": "He *could* take my pawn but I wouldn't...",
        "23... Qh4": "This is good... Brings his queen into a more active position and offers defense to e7.",
        "24. Bf5+": "Doesn't do that much.",
        "24... Kf7 25. Be6+ Kf8 26. Qd4": "Threatening Qxh8. ",
        "26... Ke7 27. Bg8+": "This time, the bishop blocks the rook's defense. Actually, he can't retake my rook because then he'd be a mating net.",
        "27... Kf8 28. Qxh8 Qxf2": "?? Blunder that loses the game.",
        "29. Be6+": "Nothing he can do now.",
        "29... Ke7 30. Qg7+ Ke8 31. Qf7+ Kd8 32. Qd7#": "Good game Jimrocks22!"
    },
    "url": "https://gameknot.com/annotation.pl/a-fun-game?gm=52093",
    "gameName": "A fun game.",
    "players": "porcho (1175) vs. jimrocks22 (1256)",
    "opening": "Budapest (A52), Alekhine, Abonyi variation"
}