{
    "moves": {
        "1. d4 d6 2. c4 c5 3. d5 g6": "Looks like we're heading for a benoni/benko...",
        "4. Nc3 Bg7 5. e4 Bxc3+": "A mistake. This leaves the black squares of g7/h6/f6 very weak - all the moreso given that it is there that the black monarch will probably end up residing.",
        "6. bxc3 Qa5 7. Qb3": "A bit unecessary. The queen would have been better placed on c2 or d3. I wanted to avoid Bd2, as there are many other tempting squares for him.",
        "7... Nf6 8. Bd3 Qc7": "Admitting perhaps that 6...Qa5 was an error, but black would have been better developing.",
        "9. h3": "Another inaccuracy, this time on my part. I was wondering where black would put his pieces, so played this to limit the scope of black's ls bishop. Bh6 was more precise, and black immediately seizes his reprieve.",
        "9... O-O 10. Bh6 Re8": "Whilst planning is more a strategic concept, black now has various mating patterns on the dark squares to think about. Given that there isn't much scope for the rooks in this position, I would have been inclined to let the exchange go for that monster on h6.",
        "11. Nf3 Nbd7 12. O-O a6": "Trying to kick start queenside counterplay, but this has less bite thanks to the lack of blacks ds bishop glaring ominously down the diagonal.",
        "13. Rab1": "Again unnecessary. Black's queenside expansion could have been more effectively limited by 13. a4 (which I eventually play anyway). Rae1 was better, playing in my own theatre of action on the kingside and in the centre.",
        "13... e6": "A standard pawn break, but black's only chances are on the queenside, and opening the e-file doesn't help.",
        "14. Nd2": "Preparing f4, and trying to relocate the knight.",
        "14... exd5 15. cxd5 b6": "Not good. ...b5 at some point is black's only real active option, thus Rb8 or Nf8 followed by Bd7 was preferable. If the idea is to develop the ls bishop on b7, then it will be a very unhappy bishop, blocked by the strongpoint on d5.",
        "16. c4": "Further clamping down on the queenside. I almost played Nc4 (targeting d6) before realising that after 16...b5; 17.Nd2 c4 white loses a piece.",
        "16... Ne5": "A nice spot, but it can be kicked away easily.",
        "17. Bc2": "The bishop is important in holding my pawn wedge together. I didn't want to block the e-file for my rook which is headed that way.",
        "17... Rb8": "Finally!",
        "18. f4": "Back you go!",
        "18... Ned7 19. a4": "No more pawn breaks here!",
        "19... Rb7": "There isn't much else for black, other than to wait for the axe to fall. On the bright side, I was using up far more time than necessary trying to work out a plan to break through!",
        "20. Rbe1": "Eyeing the e5 break, a key strategic goal for white in these sorts of positions.",
        "20... Kh8": "Waiting...",
        "21. Qc3": "Unneeded - and if I wanted my queen on the long diagonal, Qb2 would have been better, as it still keeps an eye on black's q-side pawns.",
        "21... Kg8 22. g4": "Given that the centre is solid, I can get away with advancing the kingside pawns. It has the added benefit on pushing black back on the back rank. There is of course the tactical threat that has lingered from move 10 - g5 followed by Bd1 (after Nh5) makes g7 look extremely vulnerable.",
        "22... Re7": "Making room for the knight.",
        "23. Rf2": "Preparing to double rooks on the only open file to force through e5.",
        "23... b5": "Black makes his bid for freedom.",
        "24. Rfe2": "I ignore it, as opening up the queenside by 24. axb5 axb5; 25. cxb5 Rxb5 does nothing for white.",
        "24... b4": "I wouldn't have thought closing the position would do any good, given that I can simply blockade the pawn, but bxa/c4 doesn't look great either.",
        "25. Qb2": "Keeping my queen on the dark squares.",
        "25... Ne8": "Black pre-empts g5.",
        "26. e5": "At last! Now the attack (should) come crashing through. ",
        "26... dxe5": "Not much else, but this does lose a piece. If black does nothing, then I will just push on with e6, followed by f5 blowing open the kingside.",
        "27. fxe5 Nxe5": "Preventing the pawn fork d6 at a cost.",
        "28. Re2xe5 Qd6": "Right. Now \"all\" I have to do is convert the extra piece. Well, as we all know, there's nothing harder than winning a won game - unfortunately I'm now going to prove it.",
        "29. Re5xe7 Rxe7 30. Rxe7 Qxe7 31. Nf3": "My original idea was for this knight to go to e4, but that allows Qe1 allowing perpetual.",
        "31... f6": "Finally trying to put an end to the g7 problem.",
        "32. Qb3": "Time trouble sets in. I'm not sure what I was trying to do here, but I think I was angling for a queen trade with Qe3 whilst attacking c5.",
        "32... Nd6": "Ouch. Knights are the best blockaders, so I try to get rid of it.",
        "33. Bf4 Nf7": "Black of course is just as eager to keep it, and certainly doesn't want to exchange pieces when a bishop down.",
        "34. Qd3": "Can't quite remember what this was doing. Adding weight to push d6 I think, but as seen previously, it isn't that hard to blockade it.",
        "34... Kg7": "Taking advantage of my clock problems. I had just under 2 mins, my opponent had 4. Here he waits for me to do all the work, as he should.",
        "35. d6": "Frantic. But it does have one major drawback. ",
        "35... Qd7": "Naturally.",
        "36. Qd5": "Wasting a tempo. I'm soon forced to retreat. ",
        "36... Bb7": "The point. The advance to d6 has finally allowed black's bishop into the game.",
        "37. Qd3 Qc6": "I get that sinking feeling. Have I blown it again? No...not yet.",
        "38. Bd1 g5": "Playing for a mistake.",
        "39. Bg3": "Moving off the diagonal would have lost the d6 pawn.",
        "39... Ne5": "Taking advantage of the pin on the f3 knight to the mate on g2 or infiltration on h1. At least I can get another pair of minor pieces off the board.",
        "40. Bxe5": "40. Nxe5 Qg2#",
        "40... fxe5 41. d7": "Going for gold.",
        "41... e4": "Damn. After 42. d8Q exd3; 43. Qxd3 it looks like a draw.",
        "42. Qd2": "My last throw of the dice with 40 seconds left. The idea is to try and force the black king onto the back rank where d8Q will be check, or exchange off queens (after Qxg5+ Qg6 for example) negating the threat on the long diagonal.",
        "42... exf3": "42...e3 was also possible, but then Qb2+ followed by d8Q rescues white as the knight on f3 still blocks the diagonal on which black's hope rests.",
        "43. Qxg5+": "As said previously, black wants to avoid a queen exchange or moving onto his 1st rank. Which leaves only one option...",
        "43... Kf7 44. d8=N+": "! The final flourish. d8Q allows 44...f2+; 45. Kxf2 Qg2+ etc with perpetual.\r\nAll comments and analysis are welcome, and thanks for taking a look through!"
    },
    "url": "https://gameknot.com/annotation.pl/a-fun-blitz-game?gm=29730",
    "gameName": "A fun blitz game",
    "players": "nickf001 (1882) vs. Anon ",
    "opening": "Old Indian defence (A41)"
}