{
    "moves": {
        "1. d4 d5 2. Bf4 e6 3. Nf3 Ne7": "Less common than Nf6, and difficult for me to assess. The BN in g6 will make my attack change accordingly, which I am not used to. ",
        "4. g4": "...so why lose time? :-) I know \"principles\", but I try to be quicker than my opponent, and don't allow for a relaxed developement. ",
        "4... Ng6 5. Bg3": "I can now play h4, and threat h5, making this N a sad retreater. ",
        "5... Be7": "Not enough to counter h4, so black must have taken the B to a more useful square. When facing a rated player, one tends to be \"prudent\" and wise. In this case, this is fatally wrong, because it deprives the N from his escape square. The B in b4+ would have had a scope, and Ne7 was good for B.  ",
        "6. h4 Bxh4": "An unsound sac. In a timed game, it would have been nice to explore things like Bxc7, at some point of the exchange, but I didn't see much of a future in this. ",
        "7. Nxh4 Nxh4 8. Bxh4": "Naive? Rxh4 didn't appeal to me on account of Qg5 afterwards. Not sure. ",
        "8... Qd7": "Better would have been Qd6! Look the difference between Qb4+ and Qb5... and it blocks his own pieces, of course. ",
        "9. Qd3": "indirecdtly threatening h7, and blocking Qb5. More aggressive than e3. Probably stronger was Qd2, threatening Qg5. But this means allowing black Q a counterattack on the queenside. ",
        "9... e5": "Black threatens g4. I don't want to lose it, because it means opening black lines for developement. ",
        "10. Bh3": "Developing and threatening, but at the cost of leaving black the center. ",
        "10... e4": "Much better than exd, of course. ",
        "11. Qe3": "Now I threat Qg5, but it is not all that dangerous now. I am accepting...",
        "11... Qb5": "I became a little scared about b3 - Qb4+, but I was wrong. after c3 the BQ's incursion would have lost power. ",
        "12. Qc3": "? Qa3 prevented black to castle, and allowed for Nc3, kicking the Q. ",
        "12... c6": "This move I wouldn't recommend. Nc6 was plain developement, but good. Note that black has an undefended B on c8, which means that I can play g5 \"for free\". But I couldn't find a good plan after g5. I am not sure now if I could have got more from it, but I am still unable to get my Q into the attack. ",
        "13. Na3": "I only wanted to castle, defend b3 and get the Q to g3.",
        "13... Qb6": "Back on the black squares, it has now more defensive chances. ",
        "14. Bg3": "? Not necessary, but I wanted to prevent Qc7.",
        "14... O-O": "? It defends Bc8, right, but... just into the fire!",
        "15. Bd6": "Not really strong, but I had to make room for the Q on g3 after o-o-o.",
        "15... Re8": "Ok. e3 has been gloaming over the position all the time, but it lost strenght when the BQ went to the Qside. I refused to play the natural e3 not to close in my Q from the Kside. ",
        "16. O-O-O": "I complete the manouver to free my Q from b2's defence. Rh1 awaits...",
        "16... Qd8": "Still neglecting piece's developement, probably thinking he is opening the way for a pawn's storm. ",
        "17. Qg3": "This is now correct, piling attackes to the BK. ",
        "17... Nd7": "Too late? a5-b5 could have been a plan, heading for b4... Now, this N must go to f8, guarding h7.",
        "18. c4": "?! g5 would have been simpler and better, but I decided I had to took advantage of the cramped black pieces before they could organize (Nf8, Be6...)",
        "18... Nb6": "No Nf6-h5, nor Nf8! Good.",
        "19. c5 Nc4": "This gives me the chance to \"use\" my dead Na3 for something... I wouldn't let it escape...",
        "20. Nxc4 dxc4": "...even at the price of a threatening pawn and the opening of the Queenside to the BQ. Maybe Kb1, preventing Qa5's threat... ",
        "21. d5": "...but I decided not to leave him any breath.",
        "21... cxd5 22. Rxd5": "Accepting Be6?! But I thought that opening lines would have favoured me. In fact, this was not true, and I had to suffer from the Blsb's power for the rest of the game!",
        "22... Qa5": "Black goes this way first.",
        "23. Kb1 Be6": "The problem is that until now, if c3, Qxc3, and the situation is easy. Now, I am aware that if c3 I'm dead because of Qxa2+... ",
        "24. Rh5": "... but decided to play this anyway. Now it was to him to calculate in advance if c3, Qxc3, and the subsequent checks would have decided the game for him... or just let him with a dangerous attack on h7.",
        "24... b6": "Sensible: the idea is opening the b column and press b2. Black thinks c3, Qxc3 is not good enough for him. Please think on the correct white's answer... before white's blunder. ",
        "25. cxb6": "?? c6! was ten times stronger! I can see it clearly, now. Q is threatened by the supported Rh5, and if f5, gxf5. ",
        "25... Qxb6": "I have to play at the edge (wasn't I piece up?), and I am aware of a powerful attack that is about to happen to my exposed king. ",
        "26. Qc3": "?! I was so concentrated on h7 that I simply forgot about this B. I just thought I had to cover b2 and avoid c3. Which was probably not so unwise! But Bc5-Bd4 could have been a try. I thought that my Q looking at g7 would have been definitory after my R had free action on the h column... very soon.",
        "26... Qxd6": "After this unforced and unfortunate mistake, things look just different...but I have an attack going on. Can you see the right move here?",
        "27. Rg5": "?? Not this, certainly! (g5 at once wasnt' completely decisive, after BxB, R5xBh3 (otherwise Qd1+ and black forces the Q's exchange), but can you see the right move?) I decided to create a weakness by forcing pawn's movement, but without looking at the consecuences. This ugly move just allows...",
        "27... g6": "Now I can't penetrate! Deserved... :-( I still won't tell you the move white should consider at any time. It should be so obvious...)",
        "28. Rh5": "In desperation, I decided to play for it all the same. If gxR I hoped the g column would have allowed for tactics.",
        "28... Qf4": "Black decided not to take the bite, and went on with a different attack. I can't assess it, but it has two effects: attacking g4, and allowing f6 - which block's my Q's action. In addition, it attacks f2. Now, which of these factors are important, and are they enough to parry white's threats?",
        "29. Rh4": "Defending the pawn, and inviting g5, after which Rh6 and if Bxg5, BxB wins. ",
        "29... f6": "Closing the acces to my Q, but creating a deadly weakness. Now, g5 is not bad, because QxR, Qxf6, and black is lost. But I found another move... can you see it?",
        "30. Bg2": "This was. Making blak move he pawns was just bad strategy. This move was much stronger before, when h7 was undefendable. Now it is good, but too late. Of course black can't take g4. ",
        "30... Re7": "Covered, by now Ra1 is vulnerable to Rh8+, and now I have my other shot.",
        "31. g5": "If Qxg5, Bxe4, Rf8, f4 and my pressure should be crushing.",
        "31... Qxf2": "I don't care about pawns... ",
        "32. gxf6": "Of course I don't want to exchange the Q's!",
        "32... Rf7": "But again, the attack is not well planned, since black has this move. I miss a gear to win, even if the position smells like tactics everywhere.",
        "33. Bxe4": "Can you see, dear reader, what is threatening this B (and it is not Ra8...)?",
        "33... Rd8": "!! Very good defence. My threat was Bxg6, and black can't take it because of Rh8#. But if I play it now, Rd1+. I have to play RxR, and after it, hxB is possible...",
        "34. a3": "...so I open a square for my K to avoid any chech, based on the fact that black is so effectively tied that I have time for that.",
        "34... Qxe2": "Now the Rd1+ is supported, but I...",
        "35. Ka2": "...just make it no check. If Rd2, I could go Bxg7 (I assumed!)",
        "35... Bd5": "Pinning my B? High tension game!",
        "36. Bxg6": "I had to go for it, it was now or never!",
        "36... Bxh1 37. Bxf7+ Kxf7": "...and now, resisting the temptation of go simply RxB, I tried to see something more. Of course...",
        "38. Rxh7+": "Snatching a very important pawn if the engame is reached. ",
        "38... Kg6": "Of course I thought about Rg7+, and if Kh5, Qh3#, but what if Kf5? I had Qh3+, but I'd lost f6, this couldn't I allow!",
        "39. Rxh1 Qd3": "Rd2 was more forcing, but black is already heading for a Q's excange and f6's liquidation. That would be a hard win for white. I had to look again for something more. What should be white's \"target\"? Which will be the winning point? If I am right, I will tell you later. ",
        "40. Rg1+": "And here, the magic carrousel begins. Can you see the mate from here? I'm not sure it is forced, but it seems so. Look...",
        "40... Kf7 41. Rg7+ Ke6 42. Re7+ Kf5": "The mistake, but I'm not sure Kd5 would have lead to a forced mate. Probably yes... but this loses right now. It was the chanche I looked for: to bring into the game my Q with check, avoiding the drawish Q's exchange. This was the purpose of the carrousel. ",
        "43. Qe5+ Kg6": "Better was Kg4.",
        "44. Rg7+ Kh6 45. Qg5#": "Despite almost even forces, white had just the look for winning based on one single tempo. Note: black has mate in two from the moment my Q goes, so I'm forced to check. Bringing the Q into the attack with check was my ONLY WAY OUT! Even without the R, black had a perpetual. I hope you enjoyed it, despite the poor play. "
    },
    "url": "https://gameknot.com/annotation.pl/a-fun-final-carrousel?gm=60120",
    "gameName": "A fun final carrousel",
    "players": "damalfi  vs. mute player ",
    "opening": "Queen's pawn, Mason variation (D00)"
}