{
    "moves": {
        "1. e4": "This game was played here on GK to allow annotation and improvement. Sorry  its not a classic game between too GMs. No need to vote as its not meant to be a thing of beauty and proses.",
        "1... e5 2. Bc4": "Bishop's Opening",
        "2... Nf6 3. Nf3 Nxe4": "Why not! Wanted to see what white would do and his true nature. Usually this is not a good idea due to 4....Nxe5 and pressure is exerted early on blacks achilles heel, the f7 square.",
        "4. Nc3": "Guess white isn't a Go for the throat type of guy as he didn't play Nxe5.",
        "4... Nc6": "I'll leave the knight hanging at e4 due to the fork of d5 after the knight is captured by the c knight. This is a common tactic to know if you play the Bishop's Opening, Guico Piano or the Italian game.",
        "5. Nxe4 d5 6. Bd3": "Probable the best move. Qe2, Nc3, Bxd5 or any other move have shown little promise in other games.",
        "6... dxe4 7. Bxe4 Bd6": "Reinforcing the center pawn and preparing to castle.",
        "8. O-O O-O 9. Re1": "Grabbing the half open file.",
        "9... Ne7": "Time for some tactics. The knight here supports the f5 advance.",
        "10. c3": "Preparing for d4. Why not, the knight is no longer around and c3 is its best early development square.",
        "10... f5": "Has to address this move before he can play d4.",
        "11. Bc2 e4": "and now this advance puts a different twist on the possible d4 advance. Again he has to move the knight first.",
        "12. Bb3+": "He found an inbetween move or \"intermezzio\" I believe its called in Italian.",
        "12... Kh8 13. Nd4 Ng6": "Developing her more as she isn't needed in the center.",
        "14. Re3": "Creating \"LUFT\" as the germans call it. Getting the rook out so as to slide sideways after.",
        "14... Nf4": "Taking away the h3 square from white and looking at the juicy d3 square for the Knight later maybe.",
        "15. Bc4": "During our game I mentioned that at move 11 the bishop might have gone here. Its a better x-ray square as the f1 to a6 diagonal is open and better than the d1 to a4 diagonal. Better real estate. So white has wasted tempo or time getting to this square.",
        "15... a6": "Taking away the b5 square from either piece.",
        "16. b4": "Gaining space on the queens side.",
        "16... Bxb4": "But he did.t see this tactic. Now if pawn takes at b4, the knight is lost at d4. Thus a pawns gain by black either way.",
        "17. f3": "Seeing the exchange now, white decides to contend the center.",
        "17... Bc5": "As pxp gets white what he wants, black will mix it up with Bc5 preventing the knight from moving by way of a pin on the rook.  Bd6 was also good but this gives white something to think about.",
        "18. fxe4 fxe4": "Now if white does Rxp, then Qg5 is strong for black as it puts all his forces aimed at the white king and an overwhelming attack follows.",
        "19. Rg3": "Trying for a counter offense.",
        "19... Bxd4+ 20. Kh1": "If pxB then Qxp and check, andQxR after the king moves.",
        "20... Bf2": "Why not as the bishop is guarded after black moves the knight. This makes the rook move to the only good square g5. ",
        "21. Rxg7": "During the game I referred to this as a Tal sacrifice. Looks speculative, and mentioned to white that it might work if he can be very aggressive on attack after.",
        "21... Kxg7": "Lets make white prove it will succeed.",
        "22. Ba3": "Good, getting another piece into the fray.",
        "22... c5": "Blocking",
        "23. Qc2": "Trying to pick off the hanging pawn.",
        "23... b5": "White can't afford to lose another piece so he moves the bishop.",
        "24. Bb3": "Black could play c4 trapping the bishop but would lose the rook to uncovering. ",
        "24... Bb7": "This defends the e pawn and puts the bishop on a better diagonal if the e pawn was to move.",
        "25. Rf1": "Getting the rook involved.",
        "25... e3 26. h3": "He didn't address the g2 attack. But what else is there as his queen and two bishops are busy elsewhere. Rg1 still gets the g2 pawn and an open king.",
        "26... Bxg2+ 27. Kh2 Qh4": "Now Black threatens mate at either h3 or g3. If RxB then Qh3, Kg1, Qh1mate.\r\n.\r\nThe game was interesting after the sac. of the rook. Blacks pieces where better placed for the attack. In hind sight the luft of the rook was probable too early and subjected it to harassment. "
    },
    "url": "https://gameknot.com/annotation.pl/a-game-for-improvement?gm=4828",
    "gameName": "A Game for improvement.",
    "players": "R (1546) vs. A (2151)",
    "opening": "Bishop's opening (C24), Berlin defence"
}