{
    "moves": {
        "1. e4": "Hi everyone!\n\nMy buddy ab15 and I talked a bit about this game and felt that there were quite a few twists and turns to it - games like this are very much annotation fodder methinks.  I attach Gameknot Analysis here so that you can all follow the game. http://gameknot.com/analyze-board.pl?bd=17128894&rnd=0.7754117956706019",
        "1... e5 2. Nf3 Nc6 3. d4": "3. d4 - this game is called the Scotch Game.  The first time I played this opening on Gameknot was my first game against an Expert - my coach, Ionadowman.  That game, which I lost was called Battle of the Wings which went like this .....http://gameknot.com/annotation.pl/challenge-from-jstevens1-battle-of-the-wings?gm=10633",
        "3... exd4 4. Nxd4 Nf6": "4. ..... Nf6 - black eschews a knight trade on d4 - he does not wish to bring the WQ out onto a central square which is difficult to assail.",
        "5. Nc3": "5. Nc3 - development and defense of e4.",
        "5... Bb4 6. Nxc6 bxc6": "6. ....... bxc6 - a knight trade which shatters black's queenside.  Can white take full advantage though?  Only time will tell.",
        "7. Bd3 O-O 8. O-O Re8 9. Bg5": "9. Bg5 - pin.",
        "9... h6 10. Bh4 Be7": "10.  ....... Be7 - pin-breaker.",
        "11. e5": "11. e5 - and just in the nick of time too!",
        "11... Nd5 12. Bxe7 Rxe7 13. Nxd5 cxd5": "13. ..... cxd5 - and now we have a plethora of exchanges.  Black is still left with a fractured queenside despite these exchanges and now white must defend his pawn on e5.",
        "14. Re1 d6 15. exd6 Qxd6": "15. Qxd6 - and now this pawn trade does tidy up black's queenside a bit.  On the minus side black has an isolated a pawn but on the plus side an open b file?  Which is better, only time will tell.  White now connects his rooks by moving his queen to f3.",
        "16. Qf3 Be6 17. Rad1 Qd7 18. c4": "18. c4 - look out black, look out, your queen is on the same file as a WR and there is a bishop itching to lump a check on h7 if you play PXP??  I also forgot to mention that there is a black rook hanging on a8 to the WQ should white miss this check, so the d5 pawn is doubly pinned!",
        "18... Bg4": "18. ...... Bg4 - black avoids this by a counter-attack on the WQ.  In fact this queen is skewered to the QR.",
        "19. Rxe7 Bxf3 20. Rxd7 Bxd1 21. Rxc7": "21. Rxc7 - after this tactical stouche white is a pawn up but black has something up his sleeve .....",
        "21... Re8": "21. .... Re8 - by conjouring up that chessic Grim Reaper, Old Matey.  Old Matey just lurves those back rows and corridors.  Black must also watch out for Old Matey however because a WB covers the b1 - h7 diagonal cutting off the BK's escape.",
        "22. h3 dxc4 23. Bxc4": "23. Bxc4 - black gets rid of his isolated QP by trading it off with white's c pawn.  He still remains a pawn down and his a pawn is very weak.  He must do something special or he is toast.",
        "23... Bh5 24. Rxa7 Re1+ 25. Kh2 Rc1 26. b3 Rc2": "26. ..... Rc2 - black decided to give white a dose of his own medicine - a bone in the throat.",
        "27. f3 Kf8 28. a4 Rb2 29. Kg3 f5 30. a5": "30. a5 - white looks as though he is winning hands down but he will be on the losing side.  It will be interesting to see just how he loses from here.",
        "30... g5": "30. ...... g5 - black tries a pawn roll.  Maybe the WK looks a little vulnerable.",
        "31. a6": "31. a6 - white just cannot wait to crown his pawn.  It is this that will be his undoing.  He finds his king caught in a Noah's Ark trap and a black pawn now forces his king to h2 where the g2 pawn will be pinned.",
        "31... f4+ 32. Kh2 Bxf3": "32.  ..... Bxf3 - black takes advantage of the pin on g2 to win a pawn back.  Now black threatens Rxg2+.",
        "33. Bf1 Be4 34. Rc7 Rxb3 35. a7": "35. a7 - nacht.",
        "35... Ra3 36. Rc8+ Kg7 37. Rc7+ Kf6 38. Rd7 Ra2 39. Rd6+ Ke5 40. Rxh6": "40. Rxh6 - white is now a pawn up again but black can now take advantage yet again of the white g2 pawn being pinned.  Black can advance his f pawn.",
        "40... f3 41. Re6+ Kd4": "41. ..... Kd4 - if KxR?? then Bc4+ winning back the BR.  This will mean that black will have to give up his bishop to avoid a crowning on a8.",
        "42. Rd6+ Kc5 43. Re6 fxg2": "43. .... fxg2 - oooh this is looking nasty for white.  A deadly discovered check is threatened.",
        "44. Ba6 Ra1 45. Re5+ Kb6 46. Rxg5 Rh1+": "46. ..... Rh1+ - white's only move is Kg3 which will allow the pawn to crown on g1 with check.  White therefore resigns on the grounds of ruinous loss of material.  Black's rating is now 1682 and he will hopefully get to 1700.  Well played black."
    },
    "url": "https://gameknot.com/annotation.pl/a-game-of-twists-and-turns?gm=45149",
    "gameName": "A game of twists and turns",
    "players": "NN (1682) vs. ab15 (1647)",
    "opening": "Scotch (C45), Schmidt variation"
}