{
    "moves": {
        "1. e4": "here i began another game in high hopes and an aim to win",
        "1... b6": "but i also wanted to do something different to my usual e4, so i decided to try and play something like the 'modern' opening",
        "2. Nc3": "still playing the developing moves",
        "2... e6": "here i am, only moving my pawns to the 6th row!",
        "3. Bc4": "white played the very common Bc4",
        "3... Nf6": "but now it is time for other pieces apart from pawns to advance",
        "4. d3": "but white prefers pawns",
        "4... d5": "i'm now in a more agressive mood",
        "5. exd5": "a very likely move (other option is to play something like e5?)",
        "5... exd5": "not going to stay a pawn down",
        "6. Qe2+": "white wants an early check to keep this game rolling",
        "6... Be7": "probably my best option apart from Be6",
        "7. Bb5+": "still checking!",
        "7... c6": "i play my pawn pushing again",
        "8. Ba4": "that has forced that all to powerful bishop back where it belongs (somewhere useless)",
        "8... O-O": "i take the oppurtunity to play rook out",
        "9. Nf3": "still developing",
        "9... Re8": "now i am in the hope of getting that queen which could mean trouble for white, unless it does something about it soon!",
        "10. Be3": "ah- he blocks!",
        "10... Bc5": "but that wasn't that good a move after all",
        "11. O-O": "that is one of the possible ways to escape the pin that is possible",
        "11... d4": "but that still doesn't prevent me playing that ",
        "12. Nxd4": "but i wasn't to forget that, though i still come out better from that swap off",
        "12... Bxd4": "what else could you expect there?",
        "13. Qf3": "now he is after my pawns!",
        "13... Bg4": "but it is my oppurtunity make use of more pieces and get into the attack!",
        "14. Qf4": "that has atleast got the queen from threatening my pawn as it was previously",
        "14... Be5": "but i desperately want that queen ",
        "15. Qc4": "okay- he still wants the pawn!",
        "15... b5": "but that was a total mistake- i love pushing pawns!",
        "16. Nxb5": "a decent move",
        "16... cxb5": "but i'm now further in the lead",
        "17. Bxb5": "pressure on my rook now",
        "17... Nbd7": "lets play more defensive now and take the oppurtunity to play that knight out",
        "18. Bg5": "going for a mighty pin which could disrupt my position!",
        "18... Be6": "but i'm in serious need of that queen to be thrashing my oponent properly! ",
        "19. Rfe1": "what? ",
        "19... Bxc4": "a blunder? or was it a big trick",
        "20. Bxc4": "atleast i got what i wanted though i lost my rather altruistic bishop",
        "20... Bxb2": "now i'm after those rooks",
        "21. Rab1": "but white won't have it!",
        "21... Bc3": "double attack on that rook!",
        "22. Rxe8+": "escaping that trauma with that rook swap off!",
        "22... Qxe8": "queen takes",
        "23. Kf1": "why? back rank mate prevention?",
        "23... Rb8": "but i want the other rook as well",
        "24. Rb3": "why ever would white play that",
        "24... Qe1#": "the inevitable and on white's part rather unsuspected CHECKMATE! Yay for me!"
    },
    "url": "https://gameknot.com/annotation.pl/a-game-i-enjoyed-winning?gm=40463",
    "gameName": "a game i enjoyed winning",
    "players": "laughin_lachie (1459) vs. sayv (1480)",
    "opening": "Owen defence (B00)"
}