{
    "moves": {
        "1. e4 e5 2. Nc3 Bc5 3. Nf3 Qf6 4. Bc4 Qf4 5. d4": "Moving my porn to d4 means white will come out on top no matter what black does.",
        "5... Qxc1": "? this was not a good move on blacks behalf for it was possible to save his Queen.",
        "6. Rxc1": "Then of course white take blacks Queen with his rook.",
        "6... exd4": "Then starts a battle for the center of the board.",
        "7. Nxd4": "But black finishes it and retreats.",
        "7... Bb4 8. Qf3": "White then gets into a position to attack... ",
        "8... Nc6": "...and is undetected by black.",
        "9. Qxf7+": "So whites queen moves forward and checks the Queen while being protected by Bishop c4.",
        "9... Kd8": "Black is forced to move in to a corner.",
        "10. Ne6+": "White again attacks...",
        "10... dxe6": "...and it is blacks only option to take whites knight.",
        "11. Rd1+": "White attacks from a different angle leaving black even fewer options.",
        "11... Nd4 12. Rxd4+ Bd6": "After these turn of events black has no chose but to block the rook with Bishop d6.",
        "13. Nb5": "So white attacks the last deffending piece...",
        "13... Nh6": "...but is slowed from and attack from blacks knight h6.",
        "14. Qxg7": "So white to counter attack this moves to attack both blacks Rook and Knight.",
        "14... e5": "Black ignoring this statment pushes forward his porn to attack whites Rook.",
        "15. Qxh8+": "So white takes blacks Rook and places his king in check.",
        "15... Ke7 16. Rd5 Be6": "Black moves his bishop to e6 leaving his rook open to be taken by the Queen.",
        "17. Qxa8 Bxd5 18. Bxd5": "So with black losing hope he tries a forthless attempt to check the king...",
        "18... Bb4+ 19. Ke2": "...Alowing white to move out his king freeing his rook to a certain extent.",
        "19... Ng4 20. Rd1 Bc5 21. Qg8": "White pulls his Queen out from the corner of the board. ",
        "21... Nxf2 22. Qxh7+": "White goes in once again for the attack...",
        "22... Kf6": "...and black moves away turning the rest of the game in to a cat chases mouse scenario.",
        "23. Qf5+ Ke7 24. Qf7+ Kd8 25. Be6+ Nxd1 26. Qd7#": "White ends the game after backing black on to the back of the board."
    },
    "url": "https://gameknot.com/annotation.pl/a-game-i-played-with-my-dad-that-i-recorded?gm=35612",
    "gameName": "A game I played with my Dad that I recorded",
    "players": "Me  vs. My Dad ",
    "opening": "Vienna game (C25)"
}