{
    "moves": {
        "1. Nf3 Nf6 2. g3 b6 3. Bg2 Bb7 4. O-O e6 5. d3 d5 6. Nbd2 Be7 7. b3 c5 8. Bb2 Nc6 9. e4 dxe4 10. dxe4 O-O 11. Re1 Qc7 12. h4": "It’s psychologically very strange to play someone who has almost forfeited a game by showing up nearly an hour late. On the one hand you feel a lot of pressure to win, because you almost werewinning. On the other hand, there is no way to directly convert that clock advantage into a chess advantage.\n\nAs for Mike, he said that his intention was to “play a dozen moves and offer him a draw.” And in fact, that’s what he did. Wang, to his very great credit, refused the offer. If he was going to win the club championship, he was going to do it by beating the five-time champion, not by taking a draw offer before the fighting really began. But this, too, might have put some pressure on Wang; when you turn down a draw, you then feel as if you have to justify doing so.",
        "12... Rfd8 13. e5 Nd5 14. a3 b5 15. Bf1": "! Mike liked this repositioning of the bishop and I do, too.",
        "15... a6 16. Bd3 Nb6 17. Qe2 Rab8": "Mike says that Wang took so long on his last two moves that they were almost even on time! The position indeed looks very dangerous for Black, as all of his pieces are in a clump on the queenside, while his kingside is defended only by a solitary bishop. When Mike showed this game at his chess party last week, I think that everyone who hadn’t seen it expected that it would end with a powerful kingside attack for White.\nBut that’s not what happened. Somehow or other the young upstart managed to distract White’s attention from the kingside. It starts with a very nice positional pawn sacrifice.",
        "18. Qe4 g6 19. Qg4 c4": "! When you see moves like this, you know you’re not dealing with just any ordinary 15-year-old. With 19. … c4, Black is trying to take control over the narrative, to make it be about his pieces and not Mike’s. If Mike accepts the pawn with 20. bc, then Black gets terrific compensation after 20. … Na4 21. Bd4 Nxd4 22. Nxd4 bc 23. Nxc4 Nc3! Already Black has a serious threat to sacrifice the exchange on d4 and play … Qc6, threatening mate on the long diagonal. Though White can defend this, he is forced to retreat, and the position will become one where Black’s pieces control the board and dictate the action.\nSo Mike turns down the offer and tries to keep the initiative on side. But his young opponent will not be denied.",
        "20. Be4 b4": "! Great Stuff.",
        "21. axb4 Bxb4": "Threatening ... c3.",
        "22. c3 Bf8 23. h5 Bg7 24. hxg6 hxg6 25. b4": "! On one hand, this move is easy to understand. White wants to keep the queenside closed, because that is where Black’s pieces are massed. But on the other hand, Mike is giving away a pawn. In reality he had committed himself to sacrificing the e5-pawn as soon as he played 22. c3.\nMike’s comment on this move at the chess party was totally characteristic of him. Why did he play this move? “I’m winning the endgame!” he said.\n\nOn the one hand, this is totally nuts. Black has lots of chances after this to equalize or even stand better. On the other hand, it’s so Mike. Remember the Mike Splane question: “How am I going to win this game?” He asks it in almost every game, whether his position is better or worse. Here, how he is going to win the game is very simple. He’s going to win Black’s two weak queenside pawns, at c4 and a6, and then he’s going to run his connected passers to paydirt.\nThe deeper lesson here is that the “objective evaluation” or “computer evaluation” doesn’t always matter in a contest between humans. If you have a plan and your opponent doesn’t, you’re winning.\nAlso it doesn’t hurt to have a ghost named George helping you!",
        "25... Nxe5 26. Nxe5 Bxe5 27. Nf3 Bg7": "?! My immediate reaction, when Mike showed us this game, was that this was an inaccuracy. Black should play 27. … Bf6. We have all been conditioned by experience to put the bishop on g7, because we have seen so many thousands of fianchettoed bishops. By contrast, the bishop on f6 looks a little bit loose and strange. But you have to play the concrete position in front of you. The point of 27. … Bf6 is to throw a monkey wrench into White’s plans on the kingside. If 28. Ng5 Black can play 28. … Bxg5 29. Qxg5 Bxe4 30. Rxe4 Rd5 31. Qh6 Rh5 with advantage, according to Rybka.",
        "28. Ng5 Bxe4 29. Rxe4": "! As Mike said, he would be thrilled if Black forked the queen and rook! After 29. … f5? 30. Qh4 fe (or 30. … Bf6 31. Rxe6) 31. Qh7+ Kf8 32. Nxe6+ wins.\nThis is the point at which, if I were playing Black, I would say “Oh-oh.” There are so many weak spots in Black’s position, and they all seem to have pawns on them: a6, c4, e6, f7, g6. Black could play 29. … Ra8, but it’s a cheerless defensive move. Rybka likes 29. … Bf6 best in spite of the loss of tempo, but Black is scarcely likely to play that after turning it down a move earlier. I think that the move Wang chose is right on principle. He’s a pawn up, and he has an opportunity to give the pawn back to create more activity for his pieces.",
        "29... Nd5": "! I’m so impressed with Wang’s play, even though he lost this game. By the way, if you’re counting, this is the third positional pawn sacrifice of the game. Players rated 2000 and below should really pay attention to this game, because this is the sort of move that class-A players and below almost never play. Of course, class-A players are perfectly able to play pawn sacrifices, but only when they can calculate their way to the end. Here it’s not calculation but positional judgement that says, “I’m going to suffer if I don’t give back the pawn.”",
        "30. Rxc4 Qe5 31. Re4 Nf6": "At Mike’s chess party some people thought that 31. … Qf5 was a better try, but actually it’s worse. After 32. Qh4 (You didn’t really think White would settle for the queen trade, did you?) Nf6 33. Rf4 or 32. Qh4 Nxc3 33. Bxc3 Bxc3 34. Rf4 Black will have his work cut out for him to salvage a draw.",
        "32. Rxe5 Nxg4 33. Re2 Rdc8": "?! No one at the chess party made any comment at all about this move — like 27. … Bg7, it’s the sort of automatic move that doesn’t raise any red flags. I mean, what could be more natural than putting both rooks Benko Gambit-style on the files where White has “hanging pawns”?\n\nIt was only when the computer voiced its strong preference for 33. … Rb6! that I started looking more carefully at this move. With 33. … Rc8 you are taking a rook that is already in a perfect, active position and spending a tempo to move it to a less active position. That might sound surprising to you because the rook looks active on c8. But you have to consider the concrete position. White’s plan is to move his knight to e4 and then c5, and at that point Black’s so-called active rook will be biting on granite. Anyway, in general, you should always question how “active” a rook really is when it’s in front of a passed pawn. Repeat after me: rooks belong behind passed pawns.\nA line that really shows the difference between 33. … Rb6 and 33. … Rc8 arises if White tries to play the same way he did in the game: 33. … Rb6 34. Ne4 Ne5 35. Nc5 Nc4! For 13 moves the bishop on b2 has been the secret Achilles’ heel in White’s position, and now it starts to hurt. White cannot grab the pawn with 36. Rxa6?? because he loses a whole bishop after 36. … Rd1+ 37. Kg2 Rxa6 38. Nxa6 Rb1. Now you see why a rook behind the passed pawn is better than a pseudo-active rook in front of it!",
        "34. Ne4 Rc6 35. Nc5 Ra8": "After playing actively for so long, Black has finally been forced into passive defense. Kudos to Mike (and his ghostly companion) for having the foresight to see that this would happen! However, objectively, Black is not lost yet.",
        "36. f4 Nf6 37. c4 a5 38. Bd4": "At the party, Mike thought this was a mistake and he should have played 38. Bc3, winning. However, the computer shows that is not correct. After 38. Bc3 Ng4 (also possible in the game) 39. Bxg7 Kxg7 40. R2a2 it looks for a moment as if White is going to win the a-pawn outright, but after the simple sidestep 40. … Rb8! White’s pawns collapse. Better would be something like 40. Ne4 Rxc4 41. ba, but I completely agree with Rybka that Black should be able to defend this.",
        "38... Rd8": "Of course, 38. … Ng4 would draw as in the previous note.",
        "39. b5": "And here, after playing excellent chess for so many moves, the 15-year-old wunderkind finally cracks.  Here Black could have drawn the game and won the club championship with 39. … Nd5!\nPerhaps he didn’t play this move because everything is en prise, but the threat of … Bxd4+ and … Bxa1 is so huge that White is forced into liquidating material. After 39. … Nd5 40. Bxg7 Rxc5 41. B moves Rxc4 Black should be able to draw. The knight on d5 is such a rock, and it keeps White from advancing his passed b-pawn. Note also that if White is careless, he could screw up. For instance, 39. … Nd5 40. Bf2? Rxc4 41. Bxc4 Bxa1 42. cd Rxd5 43. Rc2?? Rxc5! and Black wins.\nOr maybe Wang simply thought he was winning after the move he played,",
        "39... Rxc5": "??",
        "40. Bxc5 Nd7": "? Here 40. … Ne4 would put up a better fight, but White is still winning after 41. Rxe4 Bxa1 42. Bf2. The connected passers are too much.",
        "41. Rd1": "Did Wang really overlook this simple pin? I guess he must have. After this it’s hopeless for Black, and the game concluded ",
        "41... Rc8 42. Rxd7 Rxc5 43. b6 Rxc4 44. b7 Rb4 45. Rd8+": "Black resigns.  Although the end was a little bit disappointing, especially for young Mr. Wang, the rest of the game was really outstanding, master-level chess. The student should pay special attention to the positional pawn sacrifices and to the Mike Splane question: How am I going to win this game? Also, there are some good lessons about automatic moves — before you play moves like 27. … Bg7 and 33. … Rdc8, ask yourself what your pieces are doing on those squares."
    },
    "url": "https://gameknot.com/annotation.pl/a-ghost-named-george?gm=63773",
    "gameName": "\"A Ghost Named George\"",
    "players": "Mike Splane  vs. Henry Wang ",
    "opening": "Reti (A05), King's Indian attack, Spassky's variation"
}