{
    "moves": {
        "1. e3": "White signals their intention from the start: to be as passive as possible. ",
        "1... d5 2. d3 e5": "Faced with such timid play from White, Black shrugs and decides to play a black version of the KP, with glee!",
        "3. Ne2 Nc6 4. Ng3 Nf6 5. Be2 Bd6 6. b3 O-O": "Castling sees Black's development almost complete: his lcb still needs to be activated but otherwise the centre has been taken and reinforced. White, in turn, has looked like an army preparing for a siege instead of a battle. None the less, though passive, they have set up for castling and have activated a pair of pieces. With Bb2 available after the castle, they are by no means out of the game. But, if the middle game is all about little threats which build until a player has a gained a clear objective to attack (Euwe), it is hard to see from whence White's little threats will come. ",
        "7. a3": "A waste of a move and more waste of tempo by White, O-O or Bb2 were probably the better options here. Now, Black has tempo and Black has the centre. The question is, of course, what to do with it! I felt a strong temptation to rattle White's cages with e or d4 but needlessly dissolving the centre would just mean Black would have to develop all over again. Instead, in anticipation of the kingside castle, Black is better to wheel its pieces towards the kingside, where it will build pressure, whilst retaining its centre dominance to keep White bottled up. ",
        "7... Ne7": "Much is written about bishop pairs, but give me a pair of knights working in tandem any day! Here, I could well have both bishop and knight pairs bringing fire to bear on the centre-kingside of the board, with 8...Be6-9...Ng6 or 8...Ng6-9...Be6 looming. With such distractions, White will be so occupied that they shouldn't ever have time to mount a flanking threat on the queenside; which seems White's only possible avenue of attack.",
        "8. O-O": "The belated castle and now Black is spoilt for choices. Ng6, Be6 or, out of nowhere, the c6 movement. I found it so hard to choose I started annotating this game for a more thorough appreciation of the state of play. Here I am and still deliberating! But better to be spoilt for choice between several good moves than the converse! Looking at this position, there is an attraction to connecting those hanging central pawns to their brethren. But the big factor here for Black is time. They have plenty of it. 9c4 is White's only real immediate threat.",
        "8... Ng6 9. Nd2": "White appears to be bringing its own knights over to the kingside to counter Black, whilst also guarding against Black advances on the d or e squares. Which Black, of course, has no intention of making. Curious that White has played a very similar game before and lost with an unwise series of exchanges on the kingside that let Black's Q and rooks come into play. Assuming White is attempting to replay this game but using sounder strategy, we'll presume we won't be invited to waltz into the precious kingside so openly this time.  At this stage, then, just like in our complimentary game as White, our opponent's Qside is beginning to look rather vulnerable (Bb2 could change that a little). Here the centre may become the screen not just for kingside but queenside attacks as well, building those little threats that Euwe wrote about until White just has too much territory to cover. Here the c6 movement will anchor our hanging d pawn in order to help accomplish this plan. Be6 may become delayed for b5 as Black's 10th move. ",
        "9... c6 10. Bb2": "Analysis shows 10...b5 breaks down with 11 c4. Black is forced to open up a file when, due to their superior pawn structure, this is exactly what they don't want. 10..Be6 must occur on schedule with the b5 movement later. I wasn't completely convinced of 10...Be6 so took some time off, came back to this game with fresh eyes, looked at other options and came back to Be6 as the best. ",
        "10... Be6": "Black has a fully developed centre and space for their Q to get off the back rank, with a6 as the next likely to begin movement up the Qside. White, on the other hand, has built a rather impressive fortress. But chess is not one side seeking to assault a prepared position;  this is two armies in the field with no salients, motes, palisades, curtain walls or turrets to give one side an advantage over another. No, only piece coordination, including mobility, can win the day on an open battlefield and White's cramped position will turn from stronghold to sepulchre swiftly if they don't get moving! ",
        "11. c4": "White gets moving...",
        "11... a6": "As does Black. Qside is about to get rolling, if White captures on d5 the Bishop will recapture then move back to the inevitable e4 and White's c file advance will mean little. It will be interesting, then, to see White's next move. ",
        "12. d4": "Unexpected. Sometimes an opponent's unexpected move is due to an oversight in one's own calculations and leads to disaster. Otherwise, it's because the opponent has made a mistake. This, I think, belongs to the latter. White was better served to continue Qside mobilisation; they have blocked their own dcb's control of a long diagonal and have allowed sudden unlooked for construction of a dominant pawn chain for Black. In every line I run through, both after a couple of whites and after a couple of reds, the best move here seems to be the e pawn gliding past White's d pawn over-extension to facilitate sudden and absolute trouble for White on the kingside! Just like in our complimentary game, the Qside roll will have to wait. In the complimentary game it was postponed for defensive aggression (if that makes sense) designed to undo the opponent's strength stemming from control of a diagonal. Here White has undone their own strength! Allons-ay! ",
        "12... e4 13. b4": "White is mobilising qside as is necessary, I'm trying to find that trouble I found for White on the kingside when annotating a couple of moves earlier! Drunken illusion or drunken insight not sure which it was but I can't see impending doom for White on the kside which means back to matching Black on the qside unless inspiration strikes again. Perhaps if I have another drink.....",
        "13... Qd7": "The queenside way appears to be shut and there is no dope move on the kside I can see. What I do see is the opponent's bishop and queen again sharing a diagonal just as in the complimentary game. If action is to be about the kside with a stymied qside, then addressing that is a priority. With the Q having not moved as of yet, seems a nice time to set up Bg4 and the resulting deconstruction of White's position. If White decides to push the c pawn, Bxg3 can also deconstruct White's position. If pushing the b pawn, axb5 opens a file and the bishop recapture as a reply to exd5 was already explained as beneficial to Black. Overall, then, with White lacking any good moves (save perhaps Bh5, which Qd7 prepares for), it is the best time for Black to manoeuvre instead of trying to create something from nothing. ",
        "14. c5": "White pushes the pawn so Bxg3. ",
        "14... Bxg3 15. hxg3 Bg4": "Deconstructs White's diagonal but also tempts an error, if 15Bxg4 Nxg4 then 16. f3?? Nxe3!! wins 3 in material. Of course, White is probably too good to make such a blunder but if not, well, there are worse spots for Black's knight than g4. If White does not respond with 16 Bxg4 then Black can, if it wishes, press the issue though it may wish to keep the bishop in its threatening position and the pin on White's bishop.  ",
        "16. a4": "I'm pretty sure I said earlier that the qside is more or less stymied, so this pawn movement is largely ignored, with the choice to build pressure kside as was my stated intention. Since Black has decided to keep its bishop holding position, reinforcements arrive on the kside...",
        "16... Qf5 17. Nb3": "Clearly White doesn't agree with my synopsis of the qside. It is trying to create pressure over there, whilst Black is trying to force things on the kside. Who will break through first? We'll soon find out! :)",
        "17... Qh5": "Manoeuvering on the kside but also escalating pressure on that diagonal I ever so wish to deconstruct. ",
        "18. f3 exf3": "19 gxf3 Be6 and, well, didn't really get to deconstruct the diagonal but have instead lured the king's defenders all forward, which can have negative ramifications for White in the late middle or endgame. \n\nIF, instead 19 Bxf3 then time to think music. 19...Qh5 threatens the weakest part of a pawn chain; the base. That's my lead line for the bishop recapture but I haven't really thought about it much as I think the pawn recapture is far more likely.",
        "19. gxf3": "Suddenly an idea pops into my head. 19...Bh3?! Crazy, tumultuous lines such as: \n19.\tgxf3\tBh3\n20.\tRf2\tNh4\n21.\tg4\tNxg4\n22.\tfxg4\tNf3+\n23.\tBxf3\tQh4\n24.\tQf1\tQg3+\n25.\tQg2\tBxg2\n26.\tBxg2\tQxe3\n\nspring forth, all powered by White's need to avoid the mating nets set up by bishop and Queen breaking through on the kside. Huge risk for Black, akin to a sudden cavalry charge on a prepared infantry, but huge reward. Tempting, tempting, tempting. ",
        "19... Bh3": "In our complimentary game, the opponent has shown a poor ability to deal with the heat being turned up. Gives me confidence that White will not navigate the coming storm safely. GERONIMO!",
        "20. Rf2": "Okay, seems we have a ball game here. Lots and lots of lines, some involving fantastic saccing play (coupled with perhaps some imprecise play from White) open up. Nh4??! calls to me, but is it the voice of destiny, or merely a siren's song? Definitely need to take a step back and analyse fully and deeply....or deeply and fully....or just fully.....ere I move! ",
        "20... Qg5": "Fantastic lines aside, I decide to settle for White dropping a pawn. ",
        "21. g4 h5 22. f4 Qh4 23. Qe1": "Did I say a pawn? Now White must sac a rook or be mated. As predicted at the 19th move annotation, White has failed to handle the pressure. ",
        "23... Qg3+ 24. Kh1 Ne4 25. Rh2 Qxe3 26. Rxh3": "Ooopsies. When I said White must sac its rook, I didn't mean it must do so haphazardly. 26 Bf1 should have been the move there.",
        "26... Qxh3+ 27. Kg1 Nh4 28. Bf1": "Ooopsies again. Now Bf1 is a monumental blunder. Overall, once battle is joined, White has shown itself to be utterly feckless. ",
        "28... Nf3#": "All over. That army wasn't rugged at all! "
    },
    "url": "https://gameknot.com/annotation.pl/a-glimpse-into-the-mind-of-tipsy?gm=59782",
    "gameName": "A glimpse into the mind of Tipsy!",
    "players": "rugged_army (1592) vs. tipsyjourneyman (1598)",
    "opening": "Van't Kruijs opening (A00)"
}