{
    "moves": {
        "1. e4 e5 2. d4 exd4 3. c3 dxc3 4. Bc4 cxb2 5. Bxb2": "Another good Danish gambit game! I tend to love this postition because of all the possible tactical lines that can be created from it. Thats the beauty of the Danish gambit accepted.",
        "5... Bb4+": "Black develeops a piece while also giving check.",
        "6. Nc3": "Blocking the check and also developing the knight.",
        "6... Qf6": "Generally,the queen should not be developed too early. Anyway, this violation of general principle does come with the simple threat of BxN .",
        "7. Nge2": "Defending against BxN  and also clearing the way for a kingside castle while developing the knight as well!",
        "7... Nh6": "f6 was the ideal square for this knight. But f6 is occupied by Her Majesty the black queen. So, my opponent develops the knight on the edge. Perhaps Ne7 was better.",
        "8. O-O": "Getting my king to safety was my first priority which is now achieved.",
        "8... Bd6": "Blocks the d-pawn. Also violates the generality that suggests not to move the same piece twice during the opening. But it does protect c7 and also aims at h2.",
        "9. f4": "With the simple threat of e5. But this move was the pivotal point where I weakened my king position. Now black starts attacking!",
        "9... Ng4": "The knight is planted into my kingside. \r\n",
        "10. Rf3": "This, in my view, is my most significant mistake. But I didn't see a better move. I leave the analysis to my readers.\r\n",
        "10... Bc5+": "This wins material! But its still difficult to achieve checkmate.\r\n",
        "11. Kh1 Qh4": "From here the queen targets both h2 and f2. \r\n",
        "12. h3": "Defending against the threat of Qxh2#.\r\n",
        "12... Nf2+": "The material winning shot.\r\n",
        "13. Rxf2 Bxf2": "Although I did lose the exchange, I was quite glad that the attack was over. Now, I get to go on the aggressive!\r\n",
        "14. Nd5": "With the threat of Nxc7  which wins the rook.\r\n",
        "14... Kd8": "This seems to save the rook, but it loses the game. In my view, this is the losing move. Simply Bb6 may prove better in the long run. But even that leads to an attack thats difficult to refute. Nevertheless, it is better than Kd8.\r\n",
        "15. Bxg7": "This is a very strong move which threatens both the rook and Bf6  which wins the mighty black queen.\r\n",
        "15... Qh5": "Getting the queen out of harms way.\r\n",
        "16. Bxh8": "Here I got greedy! I think that Bf6  followed by Nxc7  and then perhaps Qd6  or BxR is better.\r\n",
        "16... Bb6": "Defending against Nxc7  which is otherwise quite inevitable after the king is forced to e8 by Bf6 .\r\n",
        "17. Bf6+ Ke8 18. Ne7": "Seeing no better try for advantage. Again the analysis is left for the readers.\r\n",
        "18... Nc6 19. Nf5": "Trading the knights decreases the intensity of my attack. Now the threat is Ng7  winning the queen.\r\n",
        "19... Kf8": "What else? Desperate times call for desperate measures!\r\n",
        "20. Qd5": "Meet my old friend centralization! besides taking an aim at f7 (to whose defense the black queen is tied up!), this move of mine has a hidden objective. If you havent seen it, this is a good time to stop and take a good look at the position.\r\n",
        "20... d6 21. Bg7+": "Now my tactic strikes with full force! This check forces the king to either g8 or e8. At both these squares the knight can give a check after which the black queen is won by the white queen's discovered attack! (If g8 then, Ne7  and if e8 then, Nxd6 ). So, of course, my opponent resigned.\r\nNow that, was a real attacking game!\r\n"
    },
    "url": "https://gameknot.com/annotation.pl/a-good-attacking-game?gm=20333",
    "gameName": "A Good Attacking Game!",
    "players": "chess_nepal8 (1576) vs. knight01 (1803)",
    "opening": "Danish gambit (C21), Collijn defence"
}