{
    "moves": {
        "1. d4": "Thus begins my FIRST EVER team match! My team, the Knights Who Say Ni!, are playing against Team Checkmate.",
        "1... d5 2. c4": "Queen's Gambit...my favourite opening.",
        "2... dxc4 3. e4": "3.Nf3 is the more flexible and quieter move; 3.e4 tends to be sharper.",
        "3... Nf6 4. e5": "The good thing about 3.e4: if Black develops a piece, White is often able to push his central pawns with tempo.",
        "4... Nd5 5. Bxc4 e6 6. Nc3 Bb4 7. Bd2 Nc6": "Rapid development for both sides ensues; however I am not convinced that Black can shrug off the disadvantage that my powerful central pawns give him.",
        "8. Nf3 Nxc3 9. Bxc3 Bxc3+ 10. bxc3": "Feel free. A series of exchanges gives me my c-pawn again, and bolsters my central pawns.",
        "10... O-O 11. O-O a6 12. Bd3": "The reason for this move? In GM Yasser Seirawan's \"Winning Chess Combinations\" I had just discovered a chapter on the brilliant \"Classical Bishop Sacrifice\" which you are about to see. This stylish attacking motif captured my imagination, and I resolved to use this attack as soon as possible. This is about to be my first attempt at using it.",
        "12... b5 13. h4": "The Classical Bishop Sacrifice attack runs Bxh7 Kxh7 Ng5 . 13.h4 prevents ...Qxg5. h4 also comes in to the attack after ...Kg6.",
        "13... Bb7 14. Bxh7+": "One!",
        "14... Kxh7": "As Seirawan so nicely puts it, it's a case of \"damned if you do, damned if you don't\". On the one hand, Black will be left a pawn down after 14.Kh8, and White retains a good attacking possibility...on the other, White's crushing attack starts after Kxh7.",
        "15. Ng5+": "Two!",
        "15... Kg8 16. Qh5": "Three! Isn't it amazing how quickly the attacking pieces leap into position with this attack! Suddenly, checkmate is forced - this is why ...Kg8 is considered inferior to ...Kg6. But then, Black is in big trouble anyway.",
        "16... Re8": "Escaping the checkmate in 1, but this allows a picturesque checkmate in 5.",
        "17. Qxf7+ Kh8 18. Qh5+ Kg8 19. Qh7+ Kf8 20. Qh8+ Ke7 21. Qxg7#": "A very neat and stylish win. Remind me to use this attack more often :-)."
    },
    "url": "https://gameknot.com/annotation.pl/a-good-start-to-team-matches?gm=21682",
    "gameName": "A good start to Team matches!",
    "players": "fatcat2 (1383) vs. oj_sympson (1385)",
    "opening": "QGA (D20), 3.e4"
}