{
    "moves": {
        "1. c4": "My usual 1. Nf3 has been replaced by this more flexible move in this game.  The main reason for the change is that I can reach many of my well studied openings by transposition and at the same time can avoid the Classical Kings Indian, which has built up a ton of theory.  Not only that, but by playing either the Saemisch or the Hungarian Attack (as in this game) I am able to generate a kingside attack with the white pieces.  Enjoy!",
        "1... Nf6": "Black responds with a flexible move of his own.",
        "2. Nc3": "Keeping my options open with the king's knight, but also preparing an anti-Grunfeld move order.",
        "2... g6": "Black is heading for the KID or the Grunfeld.",
        "3. e4": "Here is another benefit to this move order is that it stops your opponents well studied Grunfeld!!",
        "3... d6": "White now has the choice of lines.",
        "4. d4 Bg7 5. Nge2": "The main move of the Hungarian attack.  The knight will go to g3 to protect the e-pawn and white will launch the h-pawn.",
        "5... O-O 6. Ng3 e5": "6...c5 is also good and leads to different types of opening positions.",
        "7. d5": "White wants to keep the center closed so as to play on the kingside.",
        "7... a5": "Black moves to stifle white's queenside ambitions, however, the blow will come from the other wing.",
        "8. h4 h5": "Stopping the h-pawn in its tracks, but creating a weakness on the g5-square which white now exploits with...",
        "9. Bg5 Na6": "Intending to bring the knight to c5, however, this will not provide any counterplay as the e-pawn is already doubly protected.  The better plan is to attack the white center with ...c6 or to play ...Qe8 followed by ...Nh7.",
        "10. Be2": "Taking aim at the h5-pawn for a typical Hungarian tactic.",
        "10... Nc5 11. Bxh5": "White will now either win a pawn or ramp up pressure on the pinned piece with Nxh5 and Qf3.",
        "11... gxh5 12. Nxh5 Nxh5": "Tantamount to resignation.",
        "13. Bxd8 Nf4 14. Bxc7 Nxg2+ 15. Kf1 Nf4 16. Bxd6": "Black resigns.  Not a very flashy ending, but an interesting idea in an under-rated blitz opening."
    },
    "url": "https://gameknot.com/annotation.pl/a-great-blitz-weapon-against-the-kid?gm=27479",
    "gameName": "A great blitz weapon against the KID",
    "players": "Mybookrunsdeep (2050) vs. Shoemaker (1986)",
    "opening": "English opening (A16)"
}