{
    "moves": {
        "1. d4 Nf6 2. d5": "Bold.",
        "2... d6": "Halting the pawn's advance.",
        "3. Nc3 g6": "Usually I do the Queen's Indian Defense when white does e4, but this time I'm going to operate for the King's Indian instead due to present circumstances (meaning e5).",
        "4. e4": "Building a center and protecting the pawn.",
        "4... Bg7 5. Bg5 c6 6. Bxf6 Bxf6 7. Qd3 O-O 8. O-O-O cxd5": "Time to challenge the center, I'm thinking.",
        "9. Nxd5 Bg7 10. Qc4 Nc6 11. h3": "? White needs to develop.",
        "11... Bd7 12. g4": "Again, white should be developing.",
        "12... Rc8": "Now my setup is really powerful.",
        "13. Qd3 e6": "Kicking the knight so that it won't have the opportunity to fork my king and rook on d7 when I need to move my queen.",
        "14. Nf4": "On first glance, my position is good because I'm fully developed and have a lot of firepower ready against white's king. White, by contrast, is undeveloped and doesn't seem to know what's coming.",
        "14... Nb4": "The beginning of a great attack. Now white has to worry about both his c and b pawns due to my knight, rook, and DSB. I'm also offering my d-pawn as bait because if white leaves his king without its protection, he's going from being seriously in danger to sealing his fate.",
        "15. Qxd6": "...bye, white!",
        "15... Rxc2+ 16. Kb1 Rxb2+ 17. Ka1": "Here I can do a windmill if I wanted to. What I didn't realize is that I also could have checkmated white here with ...Nc2#. Dang. That would have been pretty. In the moment I was looking for the fastest mate and actually missed it to choose this one instead:",
        "17... Rxa2+": "Obliterating the pawn so white has no protection.",
        "18. Kb1 Rb2+": "Now if white does Kc1, I do Qc8 and I assume checkmate will follow closely. However, white opts for:",
        "19. Ka1": "Making my life easier.",
        "19... Qa5#": ""
    },
    "url": "https://gameknot.com/annotation.pl/a-great-attack?gm=54918",
    "gameName": "A Great Attack",
    "players": "opponent (1251) vs. cazador2 ",
    "opening": "Queen's pawn game (A45)"
}