{
    "moves": {
        "1. e4": "Hello everybody!!! I'm annotating this game bacause i liked it very much...It was from a tournament i'm still playing! So it started with e4.",
        "1... c5": "I used to play e5 but now i'm playing my favourite Sicilian defence...",
        "2. d4": "He choosed that variation playing d4. Not bad but i think Nf3 would be better...",
        "2... cxd4": "I took the pawn...",
        "3. Qxd4": "And he took it with his queen...",
        "3... Nc6": "That seems logical...I actually never played this variation before, expept playing it in blitz games...",
        "4. Qe3": "He played that move but i think Qd1 would be more safe for his queen...",
        "4... Nf6": "I opened the other knight...",
        "5. Nc3": "That move seems good..",
        "5... e6": "I think this is the greatest move to play...What do  you think?",
        "6. Bd2": "Better would be Nf3 i guess...",
        "6... d5": "And now i was between that move and Be7....My thought was to attack and play more aggresive than playing Be7 which seems more pathetic (i know it is a good move too)...",
        "7. e5": "And now he made the first mistake....e5 showed me i took the right decision before...he might ignored the threat that was coming from d4....",
        "7... d4": "d4! That was a good move that will give an advantage early in the game being with a knight up for the rest...",
        "8. Qg5": "He's protecting his queen for sure!",
        "8... dxc3": "And i took his knight...",
        "9. Bxc3": "He took the pawn...Now he wants my knight but i know if i'm gonna play logicaly i won't find some trouble...",
        "9... h6": "So i played h6 which i think was the best move to do...",
        "10. Qg3": "He had to protect his queen..",
        "10... Nd5": "And i move my knight in a safe place...",
        "11. O-O-O": "That looks good...i was expecting something like this as his king's side seems still disorganized!",
        "11... Qc7": "Looks good..",
        "12. Bb5": "I wanted to exchange our pieces but firstly wanted to play a6 which seems more defencing...He might moving his bishop away...",
        "12... a6": "So a6",
        "13. Bxc6+": "And he accepted the exchange of pieces...",
        "13... Qxc6": "I took that bishop...",
        "14. Ne2": "He played with his knight that move...What do you think? I knew he's goona move then in d4 square...",
        "14... b5": "b5 looks fine to me...Now i cant move the black bishop to e7 as his queen is pushing the g7 square...",
        "15. Nd4": "I knew he's gonna play that move...",
        "15... Qc4": "And i though that would be the greatest reply...",
        "16. b3": "That was his second big mistake..I really don't have any problem to exchange our queens, plus i would be up two pieces...",
        "16... Qxc3": "So i took the bishop with no fear understanding that this game could be mine with two more pieces...",
        "17. Qxc3": "He accepted of course the exchange..",
        "17... Nxc3": "and my brave knight took his queen and now was threatening both his rook and the a2 pawn...",
        "18. Rd2": "That was his third and biggest mistake...He simply ignored the checkmate that will come...Playing that move he just blocked his King and maked him die as soon as possible!!!!!!",
        "18... Ba3#": "And checkmate with my bishop that during the whole game was sleeping piecefully....That was the game! I hope you like it!!!! Wait for your comments and your rating and please if it's something to ask write it down or sent me a message....I also have to notice in my game that i did not play 0-0 in the whole game, something that is rare for me playing as black...Thanks for reading my annotation..."
    },
    "url": "https://gameknot.com/annotation.pl/a-great-game-playing-the-great-sicilian?gm=38239",
    "gameName": "A great game playing the great Sicilian!!!!!",
    "players": "starkkev (1416) vs. mariodag (1616)",
    "opening": "Sicilian (B21), Andreaschek gambit"
}