{
    "moves": {
        "1. e4 e6 2. d4": "Since his first move didn't challenge the center, I pushed ahead to continue gaining a strong center.\r\n",
        "2... d5 3. Nc3 Bb4 4. Bd2 dxe4 5. Nxe4": "After Knight takes e4 I expect him to exchange dark square bishops, but instead...\n",
        "5... Qxd4": "Wins the hanging pawn but exposes Black's queen with only one minor piece developed.\n",
        "6. Bd3": "I develop my Bishop, and avoid a potential Queen trade in the near future.\n",
        "6... Bxd2+ 7. Qxd2 Qxb2": "Black takes the unprotected b2 pawn.  Honestly I missed that move, but I like my overall position here much better than Black's, and I want to take advantage of his over-extended queen and lack of development.\n",
        "8. Qd1": "Protecting both the rook and c2 pawn.\n",
        "8... Ne7 9. Nf3 Qb4+ 10. c3": "The c3 push is protected by the knight on e4, and I'm preparing to castle kingside.\n",
        "10... Qa5": "A passive move on Black's part, and giving the queen little to do since once I castle kingside she won't be threatening my king any longer.\n",
        "11. O-O O-O 12. Nfg5": "I mount my attack on Black's king.  My knight on g5 is protected by my knight on e4.\n",
        "12... Nbc6": "He finally decides to continue developing, but a little too late.\n",
        "13. Qh5": "I'm threatening queen takes h7 mate.\n",
        "13... h6": "An defensive move to the queen takes h7 threat.  However, now the h7 square is opened up, and my bishop on d3 has a bead on it...\n",
        "14. Nf6+": "Continuing the attack and breaking open his kingside defense.\n",
        "14... gxf6 15. Qxh6": "Both the bishop on d3 and the knight on g5 protect the h7 square for queen to h7 checkmate.  He can't deal with both in one move...\n",
        "15... Ne5 16. Qh7#": "I gave up a bishop, knight, and three pawns and he only lost a bishop and two pawns.  But I was able to develop more pieces and have a strong jump in tempo.\r\n"
    },
    "url": "https://gameknot.com/annotation.pl/a-knight-in-black?gm=33223",
    "gameName": "A Knight in Black",
    "players": "John  vs. Nook (Hard) ",
    "opening": "French (C15), Winawer, fingerslip variation"
}