{
    "moves": {
        "1. g3 e5": "I'm not familiar with this opening, so I just play a classical style.  I can't see any reason for black to prefer one center pawn over the other.  d5 seems to be marginally the more popular response, as it turns out. \n",
        "2. Bg2 Nf6 3. e4 Nc6 4. d3 d5 5. Bg5": "This is probably the most sensible way to develop that bishop at this point, and it's one of the moves that really established the character of the game... \n",
        "5... d4": "...because it allows this pawn advance to lock up the center pretty rigidly.  White's going to have to look for opportunities to make his finachettoed light-square bishop effective.  \n",
        "6. Bxf6 Qxf6": "Black's pretty happy with the exchange, as it leaves his queen in a nice place, with no minor pieces likely to threaten it in the short term. \n",
        "7. Nf3": "At this point, things felt fairly equal to me (playing as black), but it seemed like the one advantage that was up for grabs was queenside space.  A lot of lines I tried ended with white dominating that space, so... \n",
        "7... Bb4+": "...this check looks kind of pointless, since it can be blocked (and indeed counterproductive, since white's pawns are going to advance while I retreat my bishop)... \n",
        "8. c3 Bc5 9. b4 Nxb4 10. cxb4 Bxb4+": "...but the point was to exchange the knight for a better claim on the space.  At this point, you can read the shape of the rest of the game:  white's going to be trying to loosen up his pieces and form them into an attack force, and black will just (1) ward off any threats as they come and (2) advance a pawn whenever possible.  The feasibility of (1) is the key question, of course.  I reckoned that white's inactive bishop on g2 meant that the actual active material was still pretty even. \n\nI simply haven't got enough experience to decide if this was a really sound plan or not; perhaps readers will weigh in.  The computer strongly dislikes it, but the hoped-for advantage is a rather far-off one.",
        "11. Kf1": "I was expecting 11. Nbd2.  I'm not sure what the motivation for Kf1 was, but white's king's rook probably would have argued against it. \n",
        "11... Qe7": "This was a flat-out mistake.  White could now take the e-pawn safely, 12. Nxe5 and free his own e-pawn to advance.  If white recaptures with 12...Qxe5, then 13.Qa4+ regains the material with increased mobility for white, too.  Black could have ruled out the pesky check by simply  11...O-O.\n",
        "12. a3 Bd6 13. Nh4 Bd7": "Black's just clearing out the back rank so that the rooks can move freely and back up pawns as needed. \n",
        "14. Nf5 Qf6 15. g4": "White's steadily building up pressure on the kingside... \n",
        "15... O-O 16. Nd2": "...and swinging another piece that direction. \n",
        "16... b5": "If 16..c5, which was my initial thought, then white has the option to bring his knight to c4, which seemed troublesome.  b5, at least, limits that. \n",
        "17. Nf3 a5": "The Plan: push a pawn whenever possible. \n",
        "18. h4 Rab8 19. h5 Bxf5": "There was just too much attacking force building up near my king, so this exchange damps it down again.  In general, since I'm trying to win with pawns, I don't have many objections to exchanging off pieces. \n",
        "20. gxf5": "The computer doesn't seem to indicate any strong advantage to capturing with the e-pawn or the g-pawn, but I would have been strongly inclined, as white, to get that e-pawn off of my bishop's diagonal. \n",
        "20... h6 21. Qd2 a4 22. Rb1 Bxa3": "I'm not sure if that pawn was an oversight, or if it was a calculated loss.  I had to think quite a bit about whether I should grab it, or whether that would just cost me time.  It seems like 22. Qb1 would have put a watcher on the b-pawn without abandoning white's own a-pawn.\n",
        "23. Qa5 c6 24. Qc7 Rfe8 25. Nh2": "This looked like a strangely backward move at first glance, but it makes sense: the black queen is trying to do several jobs at the moment, and maneuvering the knight to g4 where it can harass her is natural. \n",
        "25... Qd6": "In fact, I didn't want to hassle with staving that off, so another damping exchange is offered... \n",
        "26. Qxd6": "...and accepted. \n",
        "26... Bxd6": "This is convenient since I needed to get that bishop out of the way to let the a-pawn advance anyway. \n",
        "27. Ke2": "White's KR says \"YES!\" \n",
        "27... a3": "The Plan. \n",
        "28. Rhc1 b4 29. Rxc6 a2": "Losing the c-pawn and even the bishop was going to be acceptable if I could drive home Little Pawn A and/or Little Pawn B.  At this point, as far as I can tell, white can only stop that at the cost of a rook. \n",
        "30. Ra1 b3 31. Rxa2 bxa2 32. Ra6 Rb2+ 33. Kf3 Bb4": "...maneuvering to get the bishop aimed at the queening square. \n",
        "34. Ng4 Bc3 35. f6 Rd2": "Clearing the way for the bishop; also, threatening the pawn on d3 (which would clear a path forward for the black d-pawn). \n",
        "36. fxg7 Kxg7 37. Nxh6 a1=Q 38. Nf5+": "The cost of all that is that black's king has just about buggerall left in the way of defense, and white still has dangerous pieces about. \n",
        "38... Kf8 39. Rh6": "Threatening Rh8# if black isn't alert!  Given the situation, it makes sense to allow black every possibility to hang himself through carelessness.   This reminds me of 32... Ne4 in Reshevsky vs Najdorf (http://www.chessgames.com/perl/chessgame?gid=1101450), a game I enjoyed playing through recently. \n",
        "39... Kg8 40. Nd6 Qe1": "The computer says this is mate in 7.  I didn't realize that at the time, but I knew it was mate if white took the rook - the mating sequence beginning with QxP is all forced moves. \n",
        "41. Nxe8 Qxf2+": "...and indeed. \n",
        "42. Kg4 Qf4+ 43. Kh3 Rxd3+ 44. Bf3 Rxf3+ 45. Kg2 Qg4+ 46. Kh2 Rh3#": "That was an excellent, hard-fought battle, with a lot more tension than the breezy comments made in comfortable hindsight would indicate.  Games where white and black have differing plans and are racing to advance their own while thwarting the other are always fascinating. \n"
    },
    "url": "https://gameknot.com/annotation.pl/a-knight-for-two-pawns-same-as-in-town?gm=40769",
    "gameName": "A Knight for Two Pawns (same as in town)",
    "players": "quinnbag (1274) vs. jsiehler (1477)",
    "opening": "Benko's opening (A00), reversed Alekhine"
}