{
    "moves": {
        "1. e4 e5 2. Nf3 f5": "Marks the beginning of the Lavitan Gambit. This is totally new ground for me, meaning that my opponent (who calls this gambit his favourite) definatly has an edge ",
        "3. Nxe5": "Better than exf5, which allows White a solid centre after 3...d6",
        "3... Qf6": "basic chess rules state that the queen should not come out too early, but it makes sense here - both protecting the f-pawn and chasing away the knight. Besides, I was just relying on the database at this point (though I guess there must be some refutation to 3...Bd6, which does not appear on the DB) ",
        "4. d4": "solidifying the centre",
        "4... d6": "Black really doesn't want the knight on such a powerful square, so he chases the knight away (I don't really like these moves - it makes Black look weak with the pawns all over the place)",
        "5. Nc4 fxe4": "making my f-pawn a centre pawn, and regaining material equality - why not?",
        "6. Ne3": "?! Preventing Black solidifying the centre with 6...d5, but White's knight has already ended up moving four times out of White's six moves (the point of the Latvian?) I would have preferred Nc3, which achieves the same objective with another piece developed",
        "6... Nc6": "?! maybe Ne7 was better, once again allowing d5? I considered it, but dismissed it due to the fact that it seemed to cramp Black's style...",
        "7. Bb5": "But if Nge7 had been played, c6 would be forced here, as 7...Nc6? 8.d5! I'm not sure whether that's a good thing or a bad thing",
        "7... Bd7": "A forced move, but I like it all the same, opening up queenside castling for Black...",
        "8. Nd5": "! not for long though. Black is forced to undevelop his queen to prevent Nxc7+",
        "8... Qd8 9. Qe2": "threatening to take the e4 pawn....",
        "9... a6": "? but this isn't the best way to handle it, I don't think. I looked at, and feared Nxc4, but that actually kept material equality (10.Qxe4+ Nce7 11.Qxd4 Bxb5)",
        "10. Qxe4+ Nce7": "I moved this knight to provoke....",
        "11. Bxd7+ Qxd7": "the bishop trade - usually not recommended, since Black is down in material, but it allows for castling for Black",
        "12. O-O": "speaking of castling...",
        "12... O-O-O": "Black does the same, and the king retreats to the other side of the board. Development is just about even, but White has the advantage, as he has more space to work with",
        "13. Bg5": "dashing my hopes of 13...Nxd5 14.Qxd5 Re8, grabbing the open file",
        "13... h6": "putting the question to the bishop, who decides to initiate a fairly large trade (I have no idea whether White wanted to trade in the first place -.likely, as White is up in material)",
        "14. Bxe7 Bxe7 15. Nxe7+ Nxe7": "now the pressure on Black has abated, and now he can focus on more important matters...",
        "16. c4": "...such as getting some breathing space for his pieces! White controls more of the board, and this plus the material advantage puts White at an advantage...",
        "16... Rhe8": "?! but maybe 16.c4 was a move left unpunished? I think better here would have been 16...d5, which would (partially) open up the d-file, which has my queen and rook. This was also why I moved the h-rook instead of the d-rook. This move can't be bad though - with the threat of the discovered attack...",
        "17. Qc2": "White retreats his queen...",
        "17... Nc6": "thus giving the e-file to Black. I realise that White can force my knight to move again with his next move...",
        "18. d5": "but the alternative, Nf5, didn't really make sense to me, as the knight had no purpose on that side of the board (I've heard that having too many pieces on one side of the board is supposed to be a bad thing, but why would white focus its attention to a measly two pawns on the kingside, especially when they pose no threat? well, maybe for the passed pawns, but it's too early for that)",
        "18... Nd4": "maybe not the best knight move, though I'm not sure what is",
        "19. Qd3": "forcing my knight to move once again (I'm thinking to myself here, 'goddamn en passant!'",
        "19... Nf5": "forced, and as I've already said I don't like the position of my knight",
        "20. Nc3 g5": "more of a waiting move than anything",
        "21. b3": "White now has a pawn chain on the side where all the action is! (and considering that's where Black's king is, that's bad for him!)",
        "21... h5": "!? not a waiting move anymore - Black hopes to weaken the defence around the king",
        "22. Ne4": "White doesn't want this...",
        "22... Qe7": "?! Defending the pawn, as well as switching the queen-rook action to the e-file, but maybe g4 would have been a better idea",
        "23. f3": "! pawn advancement? what pawn advancement? (once again proving that my knight does not belong on that square) ",
        "23... Ref8": "offering defence in view of that...",
        "24. Rae1": "The last of White's pieces get into the action, with the threat of a discovered attack to boot!",
        "24... Rde8": "Black has been a little slow with his gameplay over the last couple of moves, but in view of White's next move, Black should have moved his queen here...",
        "25. Ng3": "! a three-way fork on the queen, the knight and the h-pawn - Black can't save then all! There is a way, though, for Black to cut his losses....",
        "25... Qxe1": "!? Trading two rooks for a queen, and getting a rook behind enemy lines",
        "26. Rxe1 Rxe1+ 27. Kf2 Ra1 28. Nxf5": "expected....",
        "28... Rxa2+": "and expected. Black comes out of this another pawn down, but now he has an attack, whereas there isn't any clear attack on Black's king",
        "29. Kg3": "Black could force this if White retreated to the a-file with Ra1+, then Ra2+, where White wouldn't want to accept a draw",
        "29... h4+ 30. Kh3": "White's king proves to be pretty safe on that square",
        "30... Re8": "looking at Re2",
        "31. Qd4": "!? I still want to play Re2, but moving my rook allows for 32.Qh8+ Kd7 33.Qg7+, with Qxg5 next move",
        "31... Kb8": "avoiding the threat",
        "32. c5": "allowing cxd6 would weaken my kingside - I don't want that",
        "32... dxc5 33. Qxc5 Ree2": "and now my rook finally reaches its desired goal!",
        "34. d6": "once again, the pawn must be dealt with immediatly",
        "34... cxd6 35. Qxd6+ Ka7 36. Qc5+ Kb8": "I wondered whether White would play for a draw here...",
        "37. Nd6": "nope! White threatens mate with 38.Qc8+ Ka7 39.Qxb7#",
        "37... Rac2": "it doesn't really matter which rook moves to do this...",
        "38. Qxg5": "but the g-pawn is a gonor! the h-pawn, fortunately, isn't threatened yet because of Rxg2, which will allow Black to get rid of White's g and h pawns, with a passed pawn as well! ",
        "38... b5": "at this point, I saw my queenside majority, I saw Rxg2... but I also saw White's f-pawn, which was a passed pawn. Since it would promote first, I couldn't launch an attack...yet",
        "39. Qd8+ Ka7": "the check didn't bother me, as my king was headed for b6 anyway",
        "40. Qg8": "moving back to the defence of the g2 pawn",
        "40... Kb6": "stopes Nxb5 after a5",
        "41. Nf5": "the knight moves to dispose of another one of Black's pawns... but blocks the passed pawn - this is the opportunity Black was looking for!",
        "41... Rexg2": "White's next move is forced, if White doesn't want any further material loss (also a strange mirror image of what happened earlier in the game",
        "42. Qxg2 Rxg2 43. Kxg2": "and now it's time for the endgame - White's passed f-pawn verses Black's (soon-to-be) passed a-pawn. If both sides concentrated only on the pawns, Black would promote first, but then there's the matter of White's knight... ",
        "43... a5 44. Kf2 a4 45. bxa4 bxa4 46. Ne3 a3 47. Nc2 a2 48. Na1": "as such. If Black wants to win, he'll have to come over himself to get rid of the knight...",
        "48... Kb5": "But this lets White's pawn promote first. Black could try to cut off the f-pawn instead, but that wouldn't work either, because Black would soon have no other moves but to move his king and the f-pawn along with the White king would easily promote ",
        "49. f4 Kb4 50. f5 Kc3 51. f6 Kb2 52. f7 Kxa1 53. f8=Q Kb1 54. Qa3": "! White wants the exchange... ",
        "54... a1=Q 55. Qxa1+ Kxa1 56. h3": "because White's king is closer to the h-file. The h-pawn will fall, and all Black can do now is hope for a draw",
        "56... Kb2 57. Kf3 Kc3 58. Kg4 Kd4 59. Kxh4 Ke5 60. Kg5": "I was expecting Kg3, slowly advancing the h-pawn while defending with the king, but it turns out that this is much more effective",
        "60... Ke6 61. Kg6 Ke7 62. Kg7 Ke6 63. h4 Kf5 64. h5 Kg5": "and Black resigns, as White's pawn cannot be stopped"
    },
    "url": "https://gameknot.com/annotation.pl/a-latvian-gambit-game?gm=27780",
    "gameName": "A Latvian Gambit game",
    "players": "kleos (1552) vs. x-machine (1272)",
    "opening": "Latvian (C40), Nimzovich variation"
}