{
    "moves": {
        "1. e4": "Hi everyone, this is my first annotation, so don't be too critical. This game is a good example on the use of knights, and I hope you enjoy the game!\nHe opens with the King's pawn, nothing unusual.",
        "1... e5": "I respond with the standard e5. I am aiming to achieve the bishop's gambit, with e4, d4 and c3.",
        "2. Qh5": "Now he plays a rather unusual opening, but I protect the e5 pawn with my knight. My next move is to pressure him and force him to retreat.",
        "2... Nc6 3. Bc4": "Now that I confirm that he intends to carry out the 4 move checkmate, I need to prevent it, while putting his Queen under pressure. I can now pressure with the pawn, because the e5 pawn is protected. His only option becomes the retreat, but I suspect that he will move Qf3, to restore his 4 move checkmate.",
        "3... g6 4. Qf3": "He then retreats to the classical 4 move checkmate position: Qf3. In order to continue development, I play Ng6, which also blocks the checkmate.",
        "4... Nf6 5. g4": "It becomes obvious that he intends to pressure my knight with the pawn. Since my knight is figuratively pinned, I decide to pressure his Queen, to weaken his position, and also free my knight. The best way to do this is to play Nd4.",
        "5... Nd4": "Nd4 has another purpose: it prepares the knight fork between the King and the Rook. He has to move his Queen across to protect it.",
        "6. Qc3": "At this point, he's gotten himself in loads of trouble. He has not only abandoned his position, but he has also given me the ideal move of Ne4, which pressures his Queen again. His better move would have been Qd3, with protects the pawn at e4, and the knight's fork.",
        "6... Nxe4": "But because he opened that door for me, there's nothing he can do now but retreat. I am developing my pieces and putting his Queen under pressure. \n",
        "7. Qd3": "If he wants to prevent the knight's fork, this is his only option. I can now set up an attacking position, while preserving my attacking positions on his Queen. This paves the way for bigger and better things",
        "7... Nc5": "Now here is where I begin to overrun his position. I move to Nc5, pressuring his Queen, again. You'll see why this is important in a second, but for now he's dug himself a hole.",
        "8. Qc3": "This move is the worst yet. I can now prepare a four move checkmate alternative (square f2) with the knight and Queen, as you'll see in the next moves. Ne4 again will set up this offense position, attack his Queen, and the two knights also prevent his Queen from stopping the attack.",
        "8... Qf6": "Pulling my Queen out prematurely may appear to be an amateur move, but it has various purposes. For one, I can perform the 4 move checkmate in an alternative fashion within 2 moves: my knight moving to Ne4 (pressuring his Queen at the same time) and my Queen attacking f2. But it also distracts the opponent.",
        "9. b3": "Here he moves at random, with no apparent purpose. He might have had the intention of playing Bb2, but his ignorance costs him on the next move.",
        "9... Ne4": "He is now under attack, with very little options. But Ne4 also provides the 4 move checkmate position I mentioned. He now only has 2 options: Qd3 or Qh3. He cannot move Qe3, because then my knight can then move Nc2, forking the Queen and the King. Also, Qf3 is off limits for obvious reasons: my knight can attack that square. Ideally, Qd3 prevents the checkmate, because once I attack, his Queen attacks the f1 square, where my Queen could deliver checkmate.",
        "10. Qd3": "He makes the right decision this time, and now I can attack.",
        "10... Qxf2+": "Here is where I split his defence in half. He only has 1 option, and that is to move Kd1. He is virtually trapped. Now I can attack h1 and capture the rook effortlessly, while also pinning his knight. That is what my next move becomes.\n",
        "11. Kd1": "Now, as I mentioned, it would be possible to deliver checkmate if not for his Queen protecting f1.",
        "11... Qg2": "There is nothing for white to do. Capturing the knight on e4 would result in the capture of his Queen, and he cannot move Qf3 to protect his rook because my knight is still there. He is trapped.",
        "12. Nc3": "THis may seem to be a smart move, trying to weaken my position, but he has given me far too many options, most of them involving my knight.",
        "12... Nf2+": "Here is where I put a fork in him, literally :). I move Nf2, forking his Queen and his King. His only move is to return to e1, where he has now lost his Queen, and exchanged it for a knight. ",
        "13. Ke1": "As I said, this was his only option.",
        "13... Nxd3+": "The capture of his Queen has broken his defence down completely. If he does not use his bishop to capture my Knight, he is allowing me to fork his a1 rook and his King. But the logical move is to capture Bxd3. Even so, his h1 rook is still left unguarded for my Queen to capture.\nAt this point the opponent resigns because he is down by 16 points in material value, with his rook is still endangered. It is a no win situation for the opponent.\n\nThis is a good example on how to use your knights, although some of the higher ranked players could probably show me 8 different ways to deliver checkmate in this situation.\n\n\n"
    },
    "url": "https://gameknot.com/annotation.pl/a-lesson-on-the-use-of-knights?gm=31635",
    "gameName": "A Lesson On the Use of Knights",
    "players": "????? (1426) vs. soccer14 (1279)",
    "opening": "KP (C20), Patzer opening"
}