{
    "moves": {
        "1. e4": "A team match, I'm playing white in this game.",
        "1... e6 2. d4": "The French Defense, so I go main line.",
        "2... d5 3. Nc3 c6 4. Nf3": "3. ... c6 is not listed as one of the common replies for black, so now I'm off in uncharted waters.",
        "4... dxe4 5. Nxe4 Nf6 6. Nxf6+": "Well, it was either this or go for the pin.",
        "6... gxf6 7. Be3 Bg7 8. Qd2 Nd7 9. O-O-O": "Just developing.",
        "9... Nb6 10. Bh6 Nc4 11. Bxc4": "10. ... Nc4 was obviously a blunder by black. Evidently, he completely overlooked white's bishop on f1. I worried for a moment that it was a sacrifice of some kind, but seeing no refutation, I take the knight.",
        "11... Bxh6 12. Qxh6": "Black is down a piece, so it doesn't seem to his advantage to trade material. However, either way, he could not avoid trading bishops since his bishop on g7 had nowhere to hide from white's bishop on h6.",
        "12... b5 13. Bd3 Bd7 14. Qg7": "White could have played 14. Bxh7, but then the bishop would have been pinned. Instead, it seemed safer to simply ask the black rook to step away from h8.",
        "14... Rf8 15. Bxh7": "15. Bxh7 may have been handled better with simply 15. Qxh7, leaving the bishop on a safe and active square. It becomes a problem quickly, and I should have anticipated the problem better.",
        "15... Qe7 16. Rhe1 O-O-O 17. Nh4": "Aiming for f5, since the pawn on e6 is pinned. This is the move that makes 15. Bxh7 problematic. While white's 15th move is not necessarily bad, 17. Nh4 sets white up to lose material.",
        "17... Qd6 18. Qxf6 Rfh8 19. Qxf7": "Black has skewered the white bishop to the white knight. Gobbling the pawn and defending the bishop seems natural, but it's probably not the best course of action now.",
        "19... Rdf8 20. Qg7 Qf4+ 21. Re3": "Black had forked the white king and the knight on h4. The king could move, but instead, white advances the rook and prepares to place it on an open file, in front of its own pawns.",
        "21... Qxh4 22. Rf3": "At first glance, black seems to have 22. ... Rxf3 to ruin the white pawns after 23. gxf3 Qxh2. But that move loses for black, for whit's response is 23. Qxh8 and then 24 gxf3, getting two rooks for one.",
        "22... Rfd8 23. Rf7": "The rook on the 7th defends the white bishop on h7 and threatens the black bishop on d7 (though white only wins a pawn with that set of exchanges).",
        "23... Rhe8 24. h3": "Saving the a3 pawn. Despite that loaded 7th rank, black seems well enough protected that white doesn't see any immediate attacking opportunities.",
        "24... Reh8 25. Re1": "White brings his other rook into the battle. The threat is simply 26. Rxe6 and if black replies 26. ... Bxe6??? then white will mate with 27. Rc7+ Kb8 28. Qc7+ Ka8 29. Rxa7#.",
        "25... Rxh7 26. Qxh7": "Black gave away another piece, well, the exchange anyway. I'm not sure what 25. ... Rxh7? was meant to accomplish, but all it does is lose the exchange, and white is still threatening 27. Rxe6. Behind by the exchange and 3 pawns, black resigned instead of playing on. It was a relatively quiet game, punctuated by careless losses of material on both sides. No powerful winning combos, no speculative sacrifices. Just a little less carelessness on the white side of the board."
    },
    "url": "https://gameknot.com/annotation.pl/a-little-less-carelessness?gm=22989",
    "gameName": "A Little Less Carelessness",
    "players": "blake84120 (1874) vs. stetienne1888 (1653)",
    "opening": "French (C10), Paulsen variation"
}