{
    "moves": {
        "1. e4 e5": "A mini tournament within my team, the Cynical Cynics, for players 1600 - 2000. I'm playing black. My opponent opens with 1. e4 and I'm feeling adventurous, so I give him the Open Game, my favorite as white, so today I'll play against it instead.",
        "2. Nf3 Nc6 3. d4 exd4": "The Scotch. I don't know much about it, but I think it's old enough that general opening principles should handle it well enough. With a little guidance from the DB.",
        "4. Nxd4 Bb4+": "Developing with a little tempo seems like a good idea. ",
        "5. c3 Bc5": "A false threat. I have no desire to capture on d4 and allow white to gain a stronger center. But it was the favored move in the DB, and I agree. 5. ... Ba5 strands the bishop on the edge of the board awaiting white to play a pawn to b4 and chase the bishop further. 5. ... Bd6 is out of the question. 5. ... Be7 just cramps up the black pieces. . 5. ... Bf8 is just silly. So false threat it is, though I considered 5. ... Nxd4 for a moment, then discarded it.",
        "6. Be3 Bb6": "White threatens to win the black bishop with 7. Nxc6. It must move or be defended, or the knight must be captured. This is the lesser of evils. I'm beginning to doubt that 4. ... Bb4+ was half as good as I thought it was. This line is in the DB and according to the DB, it plays very well for black, but I'm thinking the DB has had a little too much Scotch... I would say white has the better of things right now.",
        "7. Nxc6 bxc6": "Now white has played right into black's hands. Well, not exactly, but 7. Nxc6 was the move that most favored black, according to the DB, and white chose it. Now we trade some minor pieces.",
        "8. Bxb6 axb6 9. Bd3 Ne7": "Not 9. ... Nf6 allowing white to chase black's knight around while grabbing more of the center with his pawns.",
        "10. O-O O-O 11. Nd2 Ng6 12. Nf3 d6": "Controlling e5 and opening a line for the black bishop.",
        "13. Qc2 Re8": "Black has two half-open files and a rook on each of them.",
        "14. a3 Nf4 15. Rfe1 Bg4": "Exchanging on f3 would make a mess of white's kingside.",
        "16. Nd4 Qg5": "White is threatening the pawn on c6 and black leaves it hanging; he has bigger ideas. Note that now three black pieces are bearing down on white's king and white has no pieces in the immediate area for defense.",
        "17. Re3 Bd1": "Evidently white failed to anticipate 17. ... Bd1!. Black is now threatening checkmate on g2 and white must respond, leaving his queen en prise. However, 17. Re3? does reduce the damage; here black only gains a bishop after the queen exchange. Most other moves would have cost white his queen. Best was probably 17. f3 to lock out the bishop and allow the white queen to defend g2.",
        "18. Rg3 Bxc2": "18. ... Qxg3 is not as good, only winning the exchange after 19. hxg3 Bxc2 20. Bxc2.",
        "19. Rxg5 Bxd3 20. Nf5 Bxe4": "White chose to attack with 20. Nf5? when he could have defended his e4 pawn with 20. f3. Now black simply takes the e4 pawn. It looks like white can recapture on g7, but this will only lose material for white.",
        "21. Nxg7 Re5": "21. Nxg7? costs white material. Now white cannot squirm out of it with 22. Rxe5 dxe5 for now the white knight has no escape. ",
        "22. Nf5+ Kf8": "White tried to escape a different way, but it won't work. His knight is under attack by two black pieces and it is pinned so it cannot move.",
        "23. g4 h6": "23. g4 saves the knight, but now the white rook is trapped with no escape.",
        "24. Rg7 Bxf5": "The rook is only defended by the knight, a defender that is easily removed.",
        "25. Rxf7+ Kxf7 26. gxf5 Rae8": "Now black has a decisive material lead and, with this move, threatens checkmate with 27. ... Re1#. I looked pretty hard at Rg1+ but I couldn't see a quick checkmate, so I decided to go with a sure thing. Really though, it's all pretty much a sure thing for black at this point.",
        "27. Kf1 Nd3": "White's pawn on f5 is hanging, and free for the taking, but it isn't going anywhere - black's king will see to that. So black hunts more material. 27. Nd3! forks the pawn on b2 and the empty e1 square and allows black to exchange rooks, depriving white of his only remaining piece. White could try 28. Ra2, saving his rook and his pawn, but then 28. ... Rg8 forces 29. Ra1 to prevent checkmate, allowing 29. ... Nxb2. White has no good options.",
        "28. b3 Re5e1+ 29. Rxe1 Rxe1+": "After exchanging rooks, white is left with nothing. He has no pawns he can promote, and black has a rook and a knight which, combined with the approaching black king, will easily force a checkmate in just a handful of moves. Accordingly, white resigns."
    },
    "url": "https://gameknot.com/annotation.pl/a-little-too-much-scotch?gm=24581",
    "gameName": "A Little Too Much Scotch",
    "players": "tojje (1656) vs. blake84120 (1985)",
    "opening": "Scotch game (C45)"
}