{
    "moves": {
        "1. d4": "Hi everyone!\n\nThis is my longest game, albeit by just one move (surpassing that epic draw against the Master Mater), this time against a fellow Class B player.  Out of a QP opening I went into the middlegame and my position seemed fairly passive yet again.  However, a late pawn push eventually proved decisive in my favour.  My opponent allowed me to retain one of my promoted pawns and played the game out to mate.  Gameknot analysis is provided as follows:- http://gameknot.com/analyze-board.pl?bd=15585965&rnd=0.366394555896965",
        "1... d5 2. Nf3 Nf6 3. Bf4": "3. Bf4 - this is actually a themed MT which covers the Mason's Opening.",
        "3... c5 4. c3 Qb6 5. Qb3": "5. Qb3 - offering a queen trade of which the database suggests it is best to decline.",
        "5... c4 6. Qc2 Nc6 7. Nbd2 Bg4": "7. ...... Bg4 - development.",
        "8. h3 Bh5 9. Ne5 Nxe5 10. Bxe5": "10. Bxe5 - knight trade.",
        "10... Qc6 11. e3 Bg6 12. Qd1 Nd7 13. Bg3": "13. Bg3 - avoiding N for B trade.",
        "13... e6 14. Be2 Bd6 15. Bxd6 Qxd6": "15. ...... Qxd6 - after Fou Lenoir emerges a trade of dsbs follows and I am now ready to castle.",
        "16. b3 cxb3 17. axb3": "17. axb3 - pawn trade - I then decided to tuck Henry away on the kingside.",
        "17... O-O 18. O-O": "18. 0-0 - and white follows suite.",
        "18... a6 19. c4 dxc4 20. bxc4": "20. bxc4 - another pawn trade.  White now has a very strong pawn centre - how on earth does he lose from here?  Read on.",
        "20... b6 21. Bf3 Ra7 22. Qb3 a5": "22. ..... a5 - however, I do have a passer on the queenside and passed pawns must be pushed!",
        "23. Be4 Bxe4 24. Nxe4": "24. Nxe4 - bishop trade.",
        "24... Qc7 25. Qb5 h6 26. Rfc1 Rc8 27. Rab1 f5": "27. ..... f5 - after the build up of a lot of pressure on the b and c columns I decide to start a kingside pawn push with this move.",
        "28. Ng3 Qc6 29. Qb3": "29. Qb3 - white declines a queen trade and the Wicked Witch of the West lines up on the a2-g1 diagonal, of which Henry is sitting on!",
        "29... Rac7 30. Ne2 Qd6 31. Nf4 g5": "31. ..... g5 - another pawn push - must be careful though, it is still the middlegame and Henry is getting rather draughty - time for those Medieval Stockings, Glenda!",
        "32. Nd3 Kf8 33. Rc2 Qe7": "33. ...... Qe7 - but Glenda decides to snuggle up to him instead, aaah!",
        "34. Rbc1 h5 35. Qb2 g4": "35. ...... g4 - the pawn push carries on and now follows a pawn trade.",
        "36. hxg4 hxg4 37. d5 e5 38. Kf1 Kf7": "38. ..... Kf7 - Henry makes room for a black rook to land on the h column.",
        "39. Rc2c3 Rh8 40. Ke2 Rh2": "40. ..... Rh2 - suddenly, a black attack from nowhere.",
        "41. g3 f4 42. gxf4 exf4 43. Nxf4": "43. Nxf4 - a pawn sac but this does open white up a bit and I try to take full advantage of the rook pin on the f2 pawn.",
        "43... g3": "43. ...... g3 - like this.",
        "44. Rf1 Qh4": "44. .... qh4 - and here comes Glenda!",
        "45. Qb1 Qg4+ 46. Kd2 gxf2": "46. ..... gxf2 - I now recover my pawn deficit.",
        "47. Qe4 Nc5": "47. ..... Nc5 - and now my passively placed knight moves to an active square and menaces the Wicked Witch of the West.",
        "48. Qe5 Re7 49. Ne6 Rg2 50. Qf4+ Qxf4": "50. ..... Qxf4 - queen trade, but it does prove advantageous to me.",
        "51. Nxf4 Ne4+": "51. ..... Ne4+ - in between move which puts pressure on white.",
        "52. Kd3 Rg3 53. Ra3 Nd6 54. Ke2 Nxc4": "54. .... Nxc4 - the f2 pawn is doomed but at least I will trade it off for white's c4 pawn, breaking up white's queenside pawns.  In fact white has no queenside pawns, only the two centre pawns are standing and that will not be for long either!",
        "55. Kxf2 Rgxe3 56. Rxe3 Nxe3 57. Rb1 Nc4": "57. ..... Nc4 - now that the dust has settled I am a pawn up and white only has his passed d4 pawn, but white still has a strong knight so he is still in the game.",
        "58. Kg3 Rb7 59. Rh1 Kf6 60. Rh6+ Ke5": "60. ...... Ke5 - Henry makes for the queenside where the two passers are.",
        "61. Re6+ Kd4 62. Re1 a4": "62. ..... a4 - my a pawn, standing on a5 for many moves makes one tentative step towards Glendadom.",
        "63. Rd1+ Kc5 64. Ne6+ Kd6": "64. ..... Kd6 - Henry deftly avoids the annoying checks from white's rook and knight by hiding behind the white pawn on d5.  Sometimes enemy pawns can be very useful shields for kings as the enemy cannot capture their own pawns!",
        "65. Ng5 Ne3 66. Rd3 Nxd5": "66. .... Nxd5 - I do take off the d5 pawn and now white has nothing to promote.  Meanwhile I am now a clear two pawns up and determined to make it count.",
        "67. Ra3 b5 68. Ne4+ Kc6": "68. .... Kc6 - a point worth mentioning here.  If you do not want your king to be checked by a knight, move him two squares diagonally from it.  You could also put the king one square adjacent but NOT diagonally adjacent to the knight.  It will take a few moves for the knight to manouevre itself to check your king.",
        "69. Kf3 Ra7 70. Ke2 b4": "70. .... b4 - the two black pawnies now get involved in a race to Glendadom.",
        "71. Ra1 b3 72. Kd2 a3": "72. .... a3 - neck and neck!",
        "73. Kd1 b2 74. Rb1 a2": "74. .... a2 - white must now give up ruinous amounts of material to avoid dealing with Glenda.",
        "75. Kc2 axb1=Q+ 76. Kxb1 Rb7 77. Nd2": "77. Nd2 - trying to stop my remaining pawn from crowning but even if he does, a rook is sufficient to force checkmate.",
        "77... Nc3+ 78. Kc2 b1=Q+ 79. Kxc3": "79.  Kxc3 - interesting, he keeps the knight on the board but allows Glenda to breathe.  She will give him cause to regret this.",
        "79... Qb2+ 80. Kd3 Rd7+ 81. Ke4 Qxd2": "81. .... Qxd2 - white is left with just his king.  Now I must avoid the wrong kind of mate!",
        "82. Ke5 Qd4+ 83. Kf5 Kd5": "83. .... Kd5 - Henry helps in the driving back process.  The WK will be driven to the h column.",
        "84. Kg6 Ke5 85. Kg5 Qf4+": "85. .... Qf4+ - closer and closer.",
        "86. Kh5 Qg3 87. Kh6 Kf6": "87. ...... Kf6 - Henry plays his part well.  White was hoping for Qg4 stalemate.  Not a chance.  White now cops old Matey next move.  Both Glenda and the rook have a bit of a stand-off about who will deliver the Coup De Grace.  Henry plays referee and commands that it is the rook's turn for this royal honour.  Whew, what a marathon!  Hope you have had a good read.  Bye for now - Joanne",
        "88. Kh5 Rh7#": ""
    },
    "url": "https://gameknot.com/annotation.pl/a-long-drawn-out-victory?gm=39987",
    "gameName": "A long, drawn out ....... victory!",
    "players": "dragons3000 (1659) vs. jstevens1 (1779)",
    "opening": "Queen's bishop game (D02)"
}