{
    "moves": {
        "1. e4": "Hi everyone,\r\n\r\nThis is my second game with another Master buddy whose name is Jeff - the first was a bit of a disaster.  http://gameknot.com/analyze-board.pl?bd=12471496&fb=1&rnd=0.36667961087623424.  As you could see from that analysis we played by the book for the best part of the game and when we came out of it, boy did you see those howlers on my part!  Well, in this game the improvement was that:- 1. We came out of the book on move 10.  2.  Computer Analysis only flagged up two of my moves as an innaccuracy and a mistake respectively.  The innaccuracy was on Move 14 and the mistake was on move 43, the move before I waved the white flag.  3.  The game lasted longer, so I suppose it was better.  I started off with a 3 knights opening, i.e. a double king pawn opening with 3 of the knights emerging. ",
        "1... e5 2. Nf3 Nc6 3. Nc3": "3. Nc3 - this move characterises the 3 knights opening.",
        "3... Nf6 4. Bb5": "4. Bb5 - a delayed Ruy Lopez. ",
        "4... Nd4 5. Ba4 Bc5": "5. ..... Bc5 - here Jeff sacrifices a pawn for speedy development.",
        "6. Nxe5": "6. Nxe5 - I decided to accept the sac, after all a pawn is a pawn.",
        "6... O-O 7. Nd3 Bb6 8. e5 Ne8 9. Nd5": "9. Nd5 - this is recommended in the World DB but it does violate opening principles of moving the same piece twice.",
        "9... d6 10. exd6": "10. exd6 - here I decided to consolidate my 1 pawn advantage but in retrospect it would have been better to have played Nxb6 before trading pawns.  That dsb is gonna be a major thorn in my side for the rest of the game.",
        "10... Qxd6 11. Ne3": "11. Ne3 - NxB would have been bad here as it would have allowed a nasty queen check on e7 or e6 forcing Henry to move to f1 and forfeit castling rights, so I decided to block the e column by backing off my horsie.",
        "11... Bf5 12. Nxf5": "12. Nxf5 - I traded my knight for the other bishop.  Note that Qe7+ or Qe6+ are now bad - reason, the knight can go back to e3 and block and black will have lost a piece.  So Jeff recaptures with the knight and I decided to tuck Henry away on the kingside.",
        "12... Nxf5 13. O-O Nf6 14. Ne1": "14. Ne1 - here is the innaccuracy:-  -0.46 » 14. Ne1 Qf4 15. Qf3 Qxa4 16. Qxf5 Rfe8 17. Nf3 Re2 18. Ng5 Rae8 19. Kh1 Qc6 20. Rb1 Bd4\r\nBest: +0.16 » 14. Kh1 c6 15. b4 Bc7 16. f4 a5 17. Bb2 axb4 18. Be5 Qe7 19. Bb3 Rfe8 20. Re1 Bb6\r\n\r\nI guess that Kf1 would have probably have been a good idea at this point, at least the f2 pawn will have no longer been pinned against Henry by that wretched dsb on b6.",
        "14... Qf4 15. Qf3": "15. Qf3 - there are a lot of black pieces buzzing around Henry.  I see Fou Leblanc is hanging on a4.  Qf3 does not lose a piece however because if the Wicked Witch of the West snaps up Fou Leblanc then the knight on f5 is hanging.  Glenda duly swipes it.",
        "15... Qxa4 16. Qxf5 Rad8 17. d3": "17. d3 - time to open up a line for Fou Lenoir.",
        "17... Rfe8 18. Qf3 c6": "18. ...... c6 - to prevent Qxb7.",
        "19. Bg5": "19. Bg5- at last Fou Lenoir leaves the back rank.  However, my rooks are not connected because of that knight on e1.  That was no doubt why the computer did not like Ne1.",
        "19... Re6 20. Qd1 Rde8": "20. ...... Rde8 - ominous pile up on the e column.",
        "21. b3 Qa3 22. Qc1 Qd6": "22. ..... Qd6 - declining the exchange of queens.",
        "23. Nf3 Re6e2 24. Bh4": "24. Bh4 - Jeff considered this move was a mistake.  Here are his comments \"Well you were playing really well up until move 24 when you played Bh4. Instead taking my bishop would have been a good move. Bishop takes knight, queen takes bishop and c3 to strenghen the centre. Also on the 26th move when you played Rd2, Rf1 would have been slightly better\".  Here the computer increased Jeff's advantage from 0.37 - 0.44.",
        "24... Nd5 25. Rd1 Nc3 26. Rd2 g5": "26. ..... g5 - an attempt to distract Fou Lenoir from the defense of the f2 pawn.",
        "27. Bg3 Qh6 28. Kf1 g4 29. Rxe2 Qxc1+ 30. Rxc1 Nxe2 31. Re1": "31. Re1 - here I drop Fou Lenoir for two pawns.  Sadly these little footmen are no match for that wretched dsb on b6. ",
        "31... gxf3 32. gxf3 Nxg3+ 33. fxg3 Rxe1+ 34. Kxe1": "34. Kxe1 - Jeff trades rooks and now I find myself in an endgame with 2 pawns against that awful bishop.",
        "34... f5 35. c3": "35. c3 - an attempt to try and close off the a7-g1 diagonal but it is to no avail.",
        "35... c5 36. a3 Kf7 37. b4 Ke6": "37. ...... Ke6 - this king is coming into play with deadly effect.",
        "38. Ke2 Kd5 39. f4 c4": "39. ..... c4 - a brilliant move which scotches the idea of Henry moving to f3 without me losing the d3 pawn to devastating effect.",
        "40. d4": "40. d4 - that diagonal I mentioned in a previous note has been blocked by a white pawn at last.  Alas it avails me naught because Jeff's king is poised to eat pawns after moving to e4.",
        "40... Ke4 41. a4 Bd8 42. a5": "42. a5 - a little bit of thrashing around before I finally end up in a zugzwang.",
        "42... h5 43. h4": "43. h4? - Here is what the computer had to say about this move:- Mistake: -7.97 » 43. h4 a6 44. Kd2 Kf3 45. d5 Be7 46. Ke1 Kxg3 47. Ke2 Kxf4 48. Kf2 Bxh4+ 49. Kf1 Ke5 50. d6 Kxd6 51. Ke2 f4 52. Kf3 Ke5 53. Kg2\r\nBest: -5.44 » 43. Kd2 h4 44. gxh4 Bxh4 45. Ke2 Kxf4 46. b5 Ke4 47. a6 b6 48. Kd2 f4 49. Ke2 f3+ 50. Kd2 Bf6 51. Ke1 Be7 52. h3 Kd3 53. Kf2\r\n\r\nHmm, 43. ....... h4?  Why cannot the black king move to f3?",
        "43... a6": "43. ...... a6 - after this little pawn move I finally wave the white flag as I will not be able to avoid losing further material.  The computer gave the game as 8.29 in Jeff's favour so the resignation was justified.  Hope you have had a good read!  Bye for now - Joanne"
    },
    "url": "https://gameknot.com/annotation.pl/a-marginal-improvement?gm=31422",
    "gameName": "A Marginal Improvement",
    "players": "jstevens1 (1824) vs. southview (2314)",
    "opening": "Four knights (C48), Rubinstein counter-gambit"
}