{
    "moves": {
        "1. e4": "Hello everyone, \nthis is a game where I have been able, for the first time, to checkmate my opponent on the first row.\nKing' pawn opening",
        "1... e5 2. Nf3 Nf6": "Petrov defence. I always found that taking the pawn result in a good position for white",
        "3. Nxe5 d6 4. Nf3 Nxe4 5. d4": "Taking space in the center. No need to drive his knight just yet.",
        "5... d5 6. Bd3": "Putting a little pressure on the knight and opening up for castling.",
        "6... Bf5 7. O-O Bd6 8. c4": "With that move I aim to weaken the knight. If he grabs my c pawn, then  9. Bxe4, Bxe4, 10. Re1 pinning his bishop and resulting in an unconfortable position for black.",
        "8... c6": "Wisely reinforcing his d pawn.",
        "9. Qc2": "More pressure on the knight.",
        "9... O-O 10. Nc3 Re8": "Finally a second defender. He's also taking the open file.",
        "11. Re1": "Same for me.",
        "11... Bb4": "Now that was a move that had me thinking for a while. Finally arrived at the conclusion that the exchange would be at my advantage after the exchange of my C pawn with his D pawn, resulting in an isolated pawn for black.",
        "12. Bf4": "Activating the piece.",
        "12... Na6": "I have absolutely no clue as to why he did that move. Nd7 would have made more sense, even though that would  have had weakened the defense of d5.",
        "13. cxd5": "Finally decided to open up the game a bit (I always have been aggressive).",
        "13... cxd5 14. Ne5 f6": "I think Bd6 would have been better.",
        "15. Nf3": "Back where I started but now his king's position is weakened.",
        "15... Rc8": "Picking another open file and pinnig my knight.",
        "16. Bd2": "Going back to defend. He now has a strong attack on my queen side, where I have been a little careless.",
        "16... Qb6": "More pressure on the queen side.",
        "17. a3": "Trying to force the exchange right away and diffuse the tension.",
        "17... Kh8": "Strong move. Hiding his king and going up a pawn after axb4.",
        "18. axb4 Nxb4": "His knight finally proves useful.",
        "19. Qd1": "Realized when I studied the game afterwards that Qb8 would have been better, effectively defending d6.",
        "19... Nxc3 20. Rxe8+": "Getting rid of material.",
        "20... Rxe8 21. bxc3 Nxd3": "After all that, I find myself a pawn down and pinned down a little. But the momentum is about to swing. ",
        "22. Nh4": "Threatening his bishop and keeping an eye on his king's defence.",
        "22... Bd7 23. Qh5": "Threatening d5 and his rook if ever the bishop moves away. And of course pressuring the king side.",
        "23... Bc6": "Bc6? Now black's bishop is glued on c6 in order to defender d5 and the rook. What's more, it's blocking the way of his queen if he wanted to bring it back on the king side. Qd6 would have been better. I think he kept his queen queen side in an attempt to, at one point, catch me unawares and checkmate me on the first row.",
        "24. Qf7": "My queen is now right in his position while his is stuck on the other side of the board.",
        "24... a6 25. Nf5": "Threatening Qxg7#.",
        "25... Rg8": "Forced",
        "26. Nd6": "Just wanting to get my knight on f7.",
        "26... Qa7": "Last second attempt at bringing his queen in play but too late.",
        "27. Qe7": "Threatening mate.",
        "27... h6": "Only possible move (aside from h5).",
        "28. Bxh6": "Blasting through. ",
        "28... gxh6 29. Qxf6+": "And now the hunt begin. Only the rook stand in my way. I probably missed a few opportunities of ending this more quickly but the result is quite fun. Enjoy.",
        "29... Rg7 30. Qxh6+ Kg8 31. Qe6+ Kh8 32. Nf7+ Kh7 33. Qh3+ Kg6 34. Nh8+ Kf6 35. Qh6+ Kf5 36. Qxg7 Qb8 37. Qg6+ Kf4 38. g3+ Kf3 39. Qf5+ Ke2 40. Ra2+ Kd1 41. Qxd3+ Ke1 42. Ra1#": "Oh yes! A checkmate on e1! While this was not a great game by a long shot, ponctuated by mistakes on both sides, I think I have been able to take the most out of what my opponent gave me, even though I had problems anticipating a couple of his moves. So, hope you like it, and comments are appreciated."
    },
    "url": "https://gameknot.com/annotation.pl/a-mate-by-white-on-the-first-row?gm=26063",
    "gameName": "A mate by white on the first row!",
    "players": "hub7077 (1549) vs. gaia_etsi_re (1587)",
    "opening": "Petrov (C42), classical attack, Chigorin variation"
}