{
    "moves": {
        "1. e4 c5": "1. ......... c5 - Chrisobee decides to test me out on my skills against the Sicilian Defence - this turns out to be the Dragon Variation.  Unfortunately I fail big time - what is so disappointing is that I do not even get in h4 when trying to get in the classic h pawn, Q   KR mating attack down the h file before Chrisobee gets in his mating attack.  Here goes.",
        "2. Nf3 d6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 g6": "5. ......... g6 - the Dragon Variation as stated in my previous note.",
        "6. Be3 Bg7 7. f3 Nbd7 8. Qd2 a6 9. Bc4": "9. Bc4 - the last few moves have been the standard Yugoslav attack against the Dragon Variation.",
        "9... b5 10. Bb3 Bb7 11. Bh6 Bxh6 12. Qxh6 Qb6 13. Qd2": "13. Qd2?! - in hindsight this may have been the move to start the downhill slide, was Nde2 better?",
        "13... O-O 14. Nd5 Nxd5 15. Bxd5 Bxd5 16. exd5 Nf6": "16. ........ Nf6 - defends the kingside castled position after a plethora of exchanges on d5.",
        "17. Ne2 Rac8 18. O-O-O": "18. 0-0-0 - did I castle queenside at the wrong moment?  Would kingside castling have been any better?",
        "18... Rc4": "18. ........... Rc4 - the start of black's deadly mating attack.",
        "19. Kb1": "19. Kb1 - in retrospect would h4 have been better here?",
        "19... Rfc8 20. c3 Rc8c5 21. Qg5": "21. Qg5 - ensuring proper protection of the white isolani on d5 and at the same time thinking of trying to renew my own mating attack but black has other ideas.",
        "21... b4 22. Ka1 Ra5 23. Rd2": "23. Rd2 - rook protects second rank but is it enough?  Later on black says no!",
        "23... b3 24. a3": "24. a3 - forced - this keeps the position closed for a while but black is not to be denied.",
        "24... Qc5 25. Nc1": "25. Nc1 - counterattack!  I see that I cannot adequately defend my d pawn so I decide to attack the black b pawn and threaten a knight fork.  But Chrisobee decides to LEND me a rook on his own terms with Rxc3.",
        "25... Rxc3 26. bxc3": "26. bxc3 - I decide to accept the offering wondering what poison Chris has laced it with.  When I did my board analysis I could not see a forced mate.  I knew I would have to give up my knight by blocking the queen check on a2 but I was expecting Chris to take the knight with his pawn, this would at least close off the a file, giving me time to organise a defense, but instead of taking the knight, he takes my d pawn.",
        "26... Qxa3+ 27. Na2 Nxd5 28. Qg3": "28. Qg3 - retreating my queen out of a nasty discovery and preparing to put the queen on f2 to help defend a2, but Chris takes on a2 with his queen and announces mate!  I played things through on analyse the board.  I could not see the mate but I could see a sequence where my h1 rook would drop.  I therefore resigned on move 29 on the grounds of ruinous loss of material.  Afterwards in response to my resignation note Chris explained that after 31 Kc1 then Rc2  is mate !!   I hope you have all enjoyed this particular lesson.",
        "28... Qxa2+": ""
    },
    "url": "https://gameknot.com/annotation.pl/a-master-lesson-in-mating-attacks-amp-sacs?gm=16588",
    "gameName": "A Master Lesson in Mating Attacks & Sacs!",
    "players": "jstevens1 (1675) vs. chrisobee (2317)",
    "opening": "Sicilian (B75), dragon, Yugoslav attack"
}