{
    "moves": {
        "1. Nf3": "I've gotta confess, I was not feeling too good about seeing this.  I haven't faced 1. Nf3 before, and so I figured my best option was to just do some safe, kingside developing for awhile and wait for white to make a commitment.",
        "1... Nf6 2. g3": "no commitment yet, so I'm content to think about Nf6, g6, Bg7, and 0-0, and go from there.",
        "2... g6 3. Bg2": "Still no reason to think otherwise...",
        "3... Bg7 4. O-O O-O 5. d3": "At this point, I said to myself that if he's not going to make a bid for the center, then *I will*. ",
        "5... d5": "For better or worse, I'm staking my claim.",
        "6. Re1 c5": "And this seemed a logical follow-up.  If he's going to give me a space advantage, I'll gladly take it.",
        "7. Nbd2": "Was he planning Nb3?  After all, my c-pawn is defenseless with my dark-squared bishop on g7.",
        "7... Nc6": "Still, simple development seems best.",
        "8. c3": "Really giving me a free big center.  (Sound like an internet giveaway!)",
        "8... e5": "So here we are -- and I don't know if he's going to strike back with e4 or let me have the center.",
        "9. e4": "I like this move!  Things look very even and there's a lot of tension now.",
        "9... d4": "Gives him c4 as a knight outpost, but gives me a space advantage and blocks in his Bg2.  (Also blocks in my Bg7...)",
        "10. Nc4": "As expected, and threatening to win the e5 pawn.",
        "10... Bg4": "A nice tactical defense of the e-pawn, as the pin on the knight is strong.",
        "11. h3": "and so white decides it must be broken.",
        "11... Bxf3": "Practically forced, as Bh5 get embarrassed by g4, and any other move surrenders the e-pawn.",
        "12. Qxf3 b5": "And now this boots the knight, giving black his space advantage after all!  (It's a nice feeling to set a goal and succeed!)",
        "13. Nd2": "I was feeling good with a space advantage here, even though I didn't have the 2 bishops, and so I got a little careless.",
        "13... Bh6": "Black's bishop didn't look like it had much scope, so I prepared to exchange bishops when the knight moves.",
        "14. Qd1": "There was, apparently, nothing for the queen on the kingside except to block in white's own f-pawn.",
        "14... Rc8": "with the idea of an eventual c5, gaining even more space.",
        "15. Kh2 Qd7": "...and as I made this move, I thought \"now just look out for h4 and Bh3,\" and wasn't prepared when white played...",
        "16. Nb3": "Threatening Nxc5 and Bxh6.  Of course, I *forgot* about the Bc1.  Yes, yes I did.  I'm rated over 1700 and I remembered pinning the knight, but forgot about the bishop when the knight moved.  And so logically, I played...",
        "16... c4": "?  This loses the exchange and a pawn, as white demonstrates.",
        "17. Bxh6 cxb3 18. Bxf8 Kxf8 19. axb3": "And now white has a large advantage.  I would say white has a won game here, and just needs to avoid a blunder to convert this into a full point.\n\nAt this juncture, I was pretty disillusioned, and needed to come up with a plan.",
        "19... Ne7": "Building up pressure on the c-pawn was the best I could come up with.",
        "20. Qd2": "Qg5 would be dreadful right now!",
        "20... Nc6": "I realized I needed to defend e5 in the event of Qg5, and was mad at myself for wasting a move.",
        "21. Qg5": "The knight's gotta move.",
        "21... Ng8": "Hoping to regroup with Ne7.",
        "22. Qd2": "running before black plays f6.",
        "22... Nge7 23. f4": "white is threatening to blow open the center with devastation for black after exf4.",
        "23... f6": "necessary to keep lines closed.",
        "24. Ref1": "Uncomfortable for black's king, no doubt.",
        "24... Kg7": "I felt that this was forced.",
        "25. h4": "Now this tactic I saw -- allowing the skewer of Bh3 would be bad news for black.",
        "25... Qd6": "I had to keep my pieces active.",
        "26. Bh3": "And now the rook's got to move, too.",
        "26... Rc7": "This keeps up some pressure on the c-pawn, which I figured was my only chance for counterplay.  With white's pieces scattered and cramped, he can't maneuver as easily as I can, so my material disadvantage isn't as dreadful as it would seem on a more open board.",
        "27. f5": "But white's coming after me, and threatening to blow the game open.  I figured I had to try and strike back, and hope to get lucky.\n\nBoy, anyone who's read my annotated games must notice this is a recurring theme!",
        "27... b4": "I can't even give this more than a \"?!\", because after 28. c4, black has nothing to play against.",
        "28. g4": "? for white, and a chance at life for me!  Notice that the last 4 white moves have left white's king quite exposed...",
        "28... bxc3": "Not giving anyone a second chance to play c4.",
        "29. bxc3 dxc3 30. Qa2": "I was hoping white would be scared to play Qxc3 because of the discovered attack from the rook, but in hindsight, I think he should have.",
        "30... Nd4": "I may be down the exchange, but having more space and the passed c3 pawn gave me a tremendous amount of hope...",
        "31. Rfc1": "?  This leaves white's king without defenders, and so I knew it was time to go for broke.  After a day or so of calculating variations, I decided to go for it...",
        "31... Nf3+": "And it's pretty clear that Qxd3 is unavoidable.",
        "32. Kg3": "Aggressive, but this steps into danger.  Kg2 looked safer to me.",
        "32... Qxd3": "A quiet but dangerous move, threatening a lot of things.",
        "33. Bf1": "This was a nice try, I thought, to force the queen to move.",
        "33... Qxe4": "And now I've regained material equality.  I feel like a swindler already.",
        "34. Qg2": "?  White appears to be threatening to win black's knight, but black has an amazing shot, that amazingly, I found...",
        "34... Nxf5+": "!  Do you know how hard it is to fight to regain material equality and then, upon doing it, to *immediately* sacrifice a piece?  I thought white would play Kh3, and have to contend with N5xh4, threatening the queen, and a possible mate in the corner.",
        "35. gxf5": "?  But this allows black to win easily.",
        "35... Qf4+": "!  An easy move that maybe doesn't deserve an exclam, but White has to choose between Kh3 Qxh4# and Kf2, losing the queen.",
        "36. Kf2": "Better to lose the queen than get mated...",
        "36... Nxh4+": "ouch.",
        "37. Kg1 Nxg2": "And just like that, the tables have turned.",
        "38. Bxg2 Qxf5": "And at this point, I think the prospect of having to contend with four connected passed pawns was too much for white, and he resigned.\n\nThis was a good game, and as long as mistakes are possible, victory is possible.  Hope you enjoyed it!\n\nEthan"
    },
    "url": "https://gameknot.com/annotation.pl/a-marshall-swindle?gm=9372",
    "gameName": "A Marshall Swindle!",
    "players": "clarinetref (1746) vs. ethansiegel (1723)",
    "opening": "Reti (A05), King's Indian attack"
}