{
    "moves": {
        "1. e4 c5": "Sicilian, of course!",
        "2. Nf3 Nc6 3. d4 cxd4 4. Nxd4 d6 5. Nc3 Nf6 6. Bg5 a6": "A prelude to a queenside attack. My opponent is someone who likes to play actively, and long castling seems like the thing he'd want to do later on.",
        "7. Qd2 Bd7": "Enabling b5 and freeing up c8 for my rook",
        "8. Bxf6 gxf6": "This may not look like a good move, as it makes castling impossible for black. On the other hand, attacking the center may prove challenging for white with 4 pawns covering the king.",
        "9. O-O-O": "This is pretty early for castling. On the one hand, the rook is now involved in attacking the d-file, on the other hand, the d6 pawn is in no direct danger. White seems to be building a strong assault, though.",
        "9... Rc8": "The pieces are set for a direct attack for black as well. Whoever has the fastest attack will prevail.",
        "10. Nf5": "Perhaps this move is not the best one. the e7 seems like a weak point, but for the time being, I don't see any effective way to attack this pawn. Sacrificing the knight on e7 results in the black bishop defending the d6 pawn, which is not really helping. Nd5 is also no longer possible for white due to e6. I personally favour f4, threatening e5 to break open the center, though I did not check this with a chess engine.",
        "10... b5": "Black presses the attack.",
        "11. Nh6": "This is already the decisive error, I think. The knight is attacking the f7 pawn, but I don't see a fast way to attack that pawn again. Qd5 isn't a viable option because of Be6, making the bishop more active while winning a tempo in the process.",
        "11... b4": "I think this is the quickest way for attacking, since the white knight can't effectively attack the black position.",
        "12. Ne2": "Another option is 12. Na4 Qa5 13. b3 Nd4 14. Qxd4 Bxh6+ 15. Kb1 Bxa4 16. bxa4 Qxa4 and black wins a pawn, while still having active play against white's king. After Nd5, the game would continue the same way it did right now.",
        "12... Qa5": "Attacking the a2 pawn. Right now, white is losing a pawn.",
        "13. Kb1": "But now, the loss will be an entire piece. The alternative was 13. a3 bxa3 14. Qxa5 (14. bxa3? Qxa3 15. Kb1 Rb8+ 16. Qb4 Rxb4 mate) axb2+ 17. Kxb2 Nxa5 and black wins a pawn.",
        "13... b3": "It's all over now. Black threatens Qxa2 and must prevent that at all cost.",
        "14. Qxa5": "Other alternatives: 14. axb3 Nb4! 15. Qxb4 (Moving the queen away leads to 15. ... Qa2+ Kc1 16. Rxc2 mate. Any other move leads to 15. ... Qa2+ 16. Kc1 Qa1 mate.) Qxb4 and black is a queen against a piece up.\n14. cxb3 Qxd2 15. Rxd2 Bxh6 and black is a piece up.\n14. a3 bxc2+ 15. Kxc2(15. Qxc2 Bxh6) Qxd2+ and the knight on h6 hangs.",
        "14... bxc2+": "And white surrenders because of 15. Kxc2 Nxa5+ 16. (any move) Bxh6 and black is a piece up or 15. Kc1 cxd1Q+ 16. Kxd1 Nxa5 and white is a rook up"
    },
    "url": "https://gameknot.com/annotation.pl/a-miniature-in-the-sicilian?gm=31634",
    "gameName": "A miniature in the sicilian",
    "players": "J.D. (1548) vs. bewxdarkone (1783)",
    "opening": "Sicilian (B32), Flohr variation"
}