{
    "moves": {
        "1. e4 a6": "Maroczy plays a most unusual response to Forgacs' opening thrust.",
        "2. d4 e6": "Maroczy plays a delayed French defense.",
        "3. f4 d5 4. e5 c5 5. c3 b5": "Maroczy intends to apply pressure to Forgacs' pawn chain and break it.",
        "6. Bd3 Nc6 7. Nf3 Bd7 8. Be3 Nh6": "Both players begin developing their pieces after the flurry of initial Pawn moves.",
        "9. dxc5 b4 10. Nd4 Qa5": "Trying to pressure Forgacs' Q-side, where Maroczy has a spatial edge. Forgacs' play should lie on the K-side with this Pawn formation.",
        "11. a3 bxc3 12. Nxc6 cxb2+ 13. Nxa5 bxa1=Q": "Maroczy has accomplished his triplet of achievements. Now it is Forgacs' turn.",
        "14. c6 Bc8": "The only square.",
        "15. Qa4 Nf5": "Countering the threat of discovered check with an attack on the B.",
        "16. Ba7 Bxa3": "Seizing the loose pawn and creating a passed QRP.",
        "17. c7+ Bd7": "Threatening Forgacs' Q. but the Hungarian master is unafraid.",
        "18. Bb8 Bxa4": "Setting up what's almost like an exchange of Queens, except that instead of both Queens being captured, the taken Queen reincarnates.",
        "19. c8=Q+ Ke7": "Forced.",
        "20. Qb7+ Kf8": "Allowing the B to interpose if Forgacs' Q checks on the 8th rank.",
        "21. Qxa8 Bb4+": "Now that both sides have finished their remarkable achievements, Maroczy plays to swarm Forgacs' position for the win.",
        "22. Kf1 g5": "Making air for his King.",
        "23. Bc7+ Kg7": "Placing his King in a safe haven, and allowing him to launch the final attack.",
        "24. Qxa6 Qb2": "Looking for a \"skewer\" to win the Rook.",
        "25. Bb6 Qc1+": "The winning move.",
        "26. Kf2 Qxh1": "With decisive material gain.",
        "27. Bf1 Qxh2": "Forgacs resigns."
    },
    "url": "https://gameknot.com/annotation.pl/a-most-unusual-game?gm=36885",
    "gameName": "A most unusual game!",
    "players": "Leo \"Forgacs\" Fleischmann  vs. Geza Maroczy ",
    "opening": "St. George (Baker) defence (B00)"
}