{
    "moves": {
        "1. e4 d5 2. exd5 Qxd5 3. Nc3 Qe5+ 4. Nge2 c6 5. d4 Qa5 6. Bd2 Bf5": "All normal so far. Normally, white declines to go for the discovered queencheck, since he realizes it is almost pointless (the queen has to go to c7 anyway).",
        "7. Ne4": "This time, white goes for it. It is not particularly bad, either.",
        "7... Qc7 8. Ne4c3": "THIS is bad. The knight must go to g3 in order to make black lose a tempo defending the bishop (or more likely, retiring it to g6). ",
        "8... e6": "Now black has an extra tempo for developement, and its game should be easy the least. By the way: I have a \"lot\" of experience with this opening for black, and I know very good players will beat it, or at least make great pressure over me for all the game through. So I don't recommend it, it is just my personal challenge...",
        "9. Ng3": "The other knight goes to g3. It is was not particularly interesting to avoid this, black has to develop as quick as possible anyway. ",
        "9... Bg6": "In this opening, e6 is your rock. If it falls, black has a strong chanche to lose. So, f7 \"cannot\" be moved, and you have to look all the time for sacrifices on e6, and play consecuently. The other move black should be aware of is e5, taking advantage of the bad position of the black king. It is a tough game for black. ",
        "10. Be2": "I would have been more aggressive, being white, but this move points to a future Bf3, and I can't criticize it. A good move for white in this scheme is f4, looking ahead for f5. This is real poison, too...",
        "10... Nf6": "Bd6 is in the agenda, but white doesn't threat to have his dsb fighting for the diagonal... yet. ",
        "11. O-O": "Ok! Now the hidden threats of black's game, helped with the extra tempo I had in the opening, make me possible to turn the cards.",
        "11... h5": "Having \"lost time\" with the apparently good Be6 move, I wouldn't have been able to play this. This is why they say \"Kids, Knights first :-)",
        "12. h3": "Smelling the danger, white goes \"profilacticly\"... (no, I've never heard it either), but this move is weaker than h4. This is because black's most powerful weapon would be to open the h column for the rook, even at the cost of a sac like Ng4. To be kept in the \"what if\" agenda. And, of course, because white has to keep in mind at any next move the consecuences of h4 from black. ",
        "12... Bd6": "Black has \"pressure\" but not a definite way to go on, so I develop, adding more pressure (the best way), threatening BxN and then Qxg3. Not a real danger for white, anyway, but still white has to take it into account. The mate threat on h2 if the h column gets opens holds, for the known Bg1+(disc) pattern. ",
        "13. f4": "Very good,,, but not now! This defends the diagonal and threatens f5, ok. But The problem is that if black plays the card of h4 now, this knigh has no places to go but h1...  I think that Qe1 was a better way to avoid the exchange. Plus, it sets a piece on the e column and now white does threatens f5... if black doesn't play h4 first.",
        "13... Nbd7": "But black didn' see it :-) Black is still trying to find a sac onm white's position, but thinks that it must wait, and that if an attack is to be buildt, it would be better to have the king shielded. ",
        "14. Bf3": "And this is a nice trap. After moving the Nd7, if black goes Bxf4, BxB, QxB, Bxc6+!, and black loses the bishop. \"Timeus Danae et donem ferenter\" (more or less).",
        "14... O-O-O 15. Nge4": "Returning the tempoes to white... I play passively, and he obviously goes on. Usually, at this point white goes something like a4, and normally they get pressure but if black plays with care white can't break in. ",
        "15... Bxf4": "Doing so, the discovered royal fork won't be possible. ",
        "16. Bxf4 Qxf4 17. Nxf6 Nxf6": "The queen has a good place to go... d4. Incidentally, a white pawn is in there, so... why not? Chase me...",
        "18. Bxc6": "No, white, is it not check, it won't work, because I have a check in return...",
        "18... Qxd4+ 19. Qxd4 Rxd4 20. Bf3": "...and yes, he saved the bishop, so it was a weird exchange. It's ok. I still have a pawn more, so my option 16. Bxf4 seem to have passed the test. But now, a completely different stage of the game begins. ",
        "20... Rhd8": "Now, we have a lot of pieces and an open board. A scary situation, where a fork can happen all the time. Very hard for me on blitz... Now, to take the c2 pawn with the bishop requires a VBT, Very Big Think, since it seems I would lose it after Rc1 since it is pinned. Very dangerous. ",
        "21. Nb5 Ra4": "I left the other rook guarding the d column. ",
        "22. b3 Ra5": "All the subsequent moves will be made in order to \"save the rook\". I know I can, I'm not worried. But I'm not attacking anymore. ",
        "23. c4 a6 24. Nc3 Rd3": "My turn. Let's see what can I get. ",
        "25. Ne2 Re5 26. Ng3 Rd2": "At this point, I confess I was lost. I couldn't analyze well now, and surely not on a blitz. ",
        "27. Rfd1 Rxd1+ 28. Rxd1 h4": "Finally!!! But far too late.",
        "29. Ne2": "I cannot see a trick, a combination... nothing. ",
        "29... Ne4": "White wouldn't exchage his bishop, and this knight can go to g3... maybe something it taking shape... but I cannot see it clearly, yet. ",
        "30. Nf4 Bf5": "Be aware: my rook is squeezed, and if white sees Nd3, I have to find out if a desperate measure like Nc3 works. I should have seen all this before, and taken care of the rook earlier. ",
        "31. a4": "b4 was better, to deprive the rook of any square. But is uncertain I could have found a compensation. ",
        "31... Rc5 32. Nh5 g6 33. Ng7 Ng3": "The shadow of something related to a mate made me lose the bishop. ",
        "34. Nxf5 Nxf5": "...why to weaken my wornderful passed pawns?",
        "35. Rc1": "Ok, so Ng3 was a loss of tempo, I admit it!",
        "35... a5": "Solidifying this side. My rook will fly when it wants, not because of b4. Moreover, I threat now Nd5, and the bishop is uneasy since it has to take care of e2. ",
        "36. Re1 Nd4": "Now, the knight \"forks\" the bishop and the pawn. ",
        "37. Re4": "The definitive blunder. Bc1 was the only indicated move. Now, it is a decision: exchange the bishop, then defend h4 with g5?",
        "37... Nxb3": "I went for this one instead, in love with the knight's power...",
        "38. Rxh4 Nd2": "Be2, right?",
        "39. Rh8+": "Surprise! Engames with a lot of pieces are difficult. Of course, the target is f7!",
        "39... Kc7 40. Rh7 Nxf3+ 41. gxf3 Rf5 42. Kg2": "A pawn is all I got after 42 moves!",
        "42... b6 43. Kg3 Kc6": "Trying to unbalance the situation.",
        "44. Rh8 Kc5 45. Rc8+ Kb4 46. h4 Kxa4 47. Rb8 Rc5 48. Rxb6 Rxc4 49. Rb7 f5 50. Rb6 e5 51. Rxg6 f4+ 52. Kg4 e4 53. fxe4 Rxe4 54. h5 Kb3 55. h6 f3+ 56. Kxf3 Rh4 57. Rb6+ Ka3 58. Kg3 Rh5 59. Kg4 Rh2 60. Ra6 a4 61. Kg3 Rh1 62. Kg2 Rh5 63. Kg3 Kb3 64. Kg4 Rh2 65. Rb6+ Ka2 66. Kg3 Rh5 67. Kg4 Rh1 68. Kg5 a3 69. Kg6 Rg1+ 70. Kh7 Ka1 71. Kh8 a2 72. h7 Rh1 73. Kg8 Rxh7 74. Kxh7": ""
    },
    "url": "https://gameknot.com/annotation.pl/a-most-interesting-game?gm=45235",
    "gameName": "A most interesting game",
    "players": "ibrodsky  vs. damalfi ",
    "opening": "Scandinavian defence, Lasker variation (B01)"
}