{
    "moves": {
        "1. e4 e5": "Again with the king's pawn game. This is my first choice opening as black, as my queen and kingside bishop both have freedom.",
        "2. Nf3 Nc6": "Moving to the king's pawn game. We are level on development, and my king's pawn is defended by my own knight.",
        "3. Bb5": "Moving to the Ruy Lopez Spanish opening. My knight is now under attack, and my pawn is about to lose some protection...",
        "3... Qf6": "...so I bring out my queen to the 3rd rank to defend my knight, and should I drop the latter, I can still keep a reasonable pawn structure...",
        "4. Bxc6 Qxc6": "...and this is exactly what happens. My queen is eyeing up the c2-pawn, should the enemy queen drop her guard, although she may end up getting caged in...",
        "5. O-O": "...but he castles kingside, and I'm debating as to whether or not I should play Qxd4 and capture the pawn...",
        "5... Qxe4": "...and I decide it's worth it, as the e-file is not yet open...",
        "6. Nxe5 Qd5": "...but although the knight recaptures, I dare not capture it, as Re1 would be the response, causing me to drop my queen for a rook. However, she guards f7, should the enemy queen advance to h5...",
        "7. d3": "...but I have nothing to fear from the dark-square bishop, just yet, as both the king and queen are on light squares...",
        "7... d6": "...so I threaten the knight, and free up my light-square bishop...",
        "8. c4 Qc5": "...but as the queen comes under attack from a pawn, I must move her out of harm's way...",
        "9. Qf3 dxe5": "...and as he fails to move his knight, I accept it. With the queen out of her initial position, I could have used mine, as Re1 would have been met with an instant rank mate: Qxe1#.",
        "10. Re1": "The rook does indeed come out, but it is not yet threatening to take my pawn on e5, as my queen is defending it, but it needs some cover for Bf4...",
        "10... f6": "...and this is it. All four kingside pawns are now connected and covered...",
        "11. Be3 Qb4": "...and the bishop does indeed come out, so now I target the pawn on b2, and the rook on e1, hoping to win either of the two, with latter resulting in a possible mate...",
        "12. b3 Qxe1#": "...but to my great surprise, I end up with the rook, and mating. I sure gave him a nasty surprise!"
    },
    "url": "https://gameknot.com/annotation.pl/a-nasty-surprise?gm=25699",
    "gameName": "A Nasty Surprise",
    "players": "maxillo (1338) vs. aspiemikey (1416)",
    "opening": "Ruy Lopez (Spanish opening) (C60)"
}