{
    "moves": {
        "1. d4 Nf6 2. c4 e5": "The Budapest, my choice for testing. ",
        "3. dxe5 Ng4 4. e4": "The \"intelligent\" answer. First time I face it. ",
        "4... Nxe5 5. f4 Ng6": "I wasn't afraid of this, but probably it would have been better not to take the pawn. But I don't know enough to feel safe after f4 if I didn't take e5.",
        "6. Be3 Bb4+": "Typical. ",
        "7. Nd2": "Good, now the white queen cannot go to d5. ",
        "7... Qe7 8. Bd3": "Nice \"hole\" in white's position. How to exploit it? d5 and white cannot retake with the e pawn... but unfortunately, he has another on c4. I think b5, to deflect this pawn, must be considered. It opens the big diag for my lsb. I overlooked it during the game. ",
        "8... O-O 9. Ngf3 d6": "I didn't want to lose my dsb, but I \"had\" to open the way for my other minor pieces. b6 would have been fine. ",
        "10. O-O Bg4": "My opponent didn't harass my dsb... good, but it will came later. Now, I want him to move his pawns. ",
        "11. Qc2": "Neither of my pins is working, now. Welll...",
        "11... Nd7": "I cannot find a way to penetrate, but he has not launched the e5 attack, still.",
        "12. h3 Bxf3 13. Nxf3": "Unavoidable, because I put my knight in d2. But this had a purpose. ",
        "13... Bc5": "To preserve my pawn chains, depriving him of his bishop's pair, that can be a very powerful weapon. ",
        "14. Rae1": "White overlooked the obvious",
        "14... Bxe3+ 15. Rxe3 Nxf4": "losing a very important pawn. Now I will exchange his other bishop, and white's attacking chances will almost vanish.",
        "16. Nd4 Nxd3 17. Qxd3 Ne5": "And this extra tempo, even better. I didn't play Nc5 because it can be easily kicked there with b4. ",
        "18. Qe2 g6": "To prevent Nf5, or Qh5. It looks weird but, hey, he has not a dsb. ",
        "19. b3": "Solidifying. I have a pawn, but it looks difficult to get a victory. ",
        "19... a6": "Planning the only expansion I can possibly have: b5. ",
        "20. Nc2 b5": "It was a mistake. I should have prepared it properly, with Qd7 or something. The basic idea is if cxb, winning the exchange, Rxa2 compensates. But it was too quick a calculation. ",
        "21. Nb4 c6": "To avoid Nd5. Tension is quickly increasing again!",
        "22. Rd1": "I didn't realize d5, threatening the knight. Difficult to say if it is good or bad. ",
        "22... a5 23. Nd3": "The idea is that I can recover the pawn in c5, but...",
        "23... bxc4 24. Nxe5 dxe5 25. Qxc4": "Hm. Now my position is worse, with three separated pawns and no piece coordination. ",
        "25... Qc7 26. Qc5 a4": "It is very, very difficult to play a game like this. Every movement can be the last. I made a couple of such movement, an more will do. ",
        "27. b4": "Now, this is nice and interesting. Look. ",
        "27... Rfb8": "Why not? NO inmediate threat is on the kingside. And now I win some tempoes. ",
        "28. a3 Rb5 29. Qc3 c5": "And now I expand. My weak pawn has become in a couple of moves a fierce lion. ",
        "30. bxc5": "White should have kept the tension with Rc1. I cannot take the pawn since it is pinned to my queen. ",
        "30... Rxc5": "That helps me. ",
        "31. Qd2 Qb6": "Preparing a tactic if white is careless. ",
        "32. Kh1 Rac8": "I didn't know exactly what to play, I confess, and this seemed solid. ",
        "33. Rf3": "Now I have to take seriously the white threat on f7, of course. ",
        "33... Rc5c7": "This is \"seriously\". ",
        "34. Rdf1 Rf8": "Even if it doesn't need it, I know that on the long term my rook will begin to f8. ",
        "35. Rf3f6 Rc6 36. Rf6f3": "White takes care of a possible Qb3, freeing my a pawn. ",
        "36... Kg7 37. Qd5": "Now, white is getting very annoying, all of a sudden. Was I careless?",
        "37... Re6 38. Qd7": "Another hard choice. ",
        "38... Qd6": "I couldn't see any better on a blitz. I lost my a pawn, and now white has arguments to win. ",
        "39. Rf3xf7+": "but he prefers to do this. Of course!",
        "39... Rxf7 40. Rxf7+ Kh6 41. Rxh7+ Kg5 42. h4+ Kg4": "Ok, white, you have won. But now? ",
        "43. Qxa4": "Ah, \"collateral damage\", of course. :-)",
        "43... Rf6 44. Kh2": "Again, is very easy to commit mistakes, here. And humiliating :-)))",
        "44... Qd2": "Threatening Rf2 and Qf4+ and a perpetual. ",
        "45. Qd7+ Qxd7 46. Rxd7": "And this is the moment for a fine manouvre, I think. ",
        "46... Kf4": "I go to free my own pawn, to keep winning chances. I don't take the h pawn, nor put my rook on a6 inmediately. ",
        "47. a4": "Go, go, I have things to do right now. ",
        "47... Kxe4 48. a5 Ra6": "Now white cannot defend his pawn! This was the idea. Of course, he hits the other one. ",
        "49. Rg7 Kf5 50. Kg3 Rxa5 51. Rf7+ Ke6": "I don't want to let him tempos.",
        "52. Rf2 Ra4": "Better than Ra3+, of course. I don't want his king to pass. ",
        "53. Kh3 e4": "White is preparing g4, but I take my chance to advance. ",
        "54. Re2 Ke5 55. Kg4": "Now, my plan: ",
        "55... e3+ 56. Kg5": "uh-oh, I have two lost pawns, isn't it?",
        "56... Kd4 57. Kxg6 Kd3": "...but now, the least, I recover the pawn... or much more. ",
        "58. Rxe3+": "Very interesting! White realized that he was lost, so opted for an unbalanced endgame, sure about his two pawns. ",
        "58... Kxe3 59. h5 Rg4+ 60. Kf7 Rh4 61. Kg6 Kf4": "I have assured a draw. I think I can't win this, really. ",
        "62. h6 Rxh6+": "Retourning the courtesy, and setting draw game. ",
        "63. Kxh6 Kg3 64. Kg5 Kxg2": ""
    },
    "url": "https://gameknot.com/annotation.pl/a-nice-draw?gm=48534",
    "gameName": "A nice draw",
    "players": "GKPlayer (2000) vs. damalfi ",
    "opening": "Budapest (A52), Alekhine, Abonyi variation"
}