{
    "moves": {
        "1. e4 d5 2. exd5": "Less and less I find e5, that is not a bad move, despite what may seem. ",
        "2... Nf6 3. Bc4": "This must be still theory, but I can't study any chess nor I have access to the database anymore, so I can't see what was played before. A pity. Now, the normal e6 (the Icelandic gambit itself) doesn't work since after the exchange my e pawn will stand pitifully isolated in the center, against a well developed white open e column... of course not!",
        "3... Nxd5": "It can't be bad. My queen will stand out in the center, but she has a lot of room to fly on, some threat and a well-known plan Qa5-Qc7. ",
        "4. Bxd5 Qxd5 5. f3": "Nf3 is more dangerous because of Bg4 at once, scrambling white's kingside. This is sensible, but I overlooked a fun and dangerous trick based on Bg4!, and if fxB, Qxg2. Now, this fails to Qf3, and I lost my bishop for nothing. So it was better to overlook it! :-) ",
        "5... e5": "This deprived my queen from e4+, that must be considered. Even Qg5 (threatening g2 again) was playable, and probably better. But I sensed that the fight for the center was important, and that my dsb was ready to pin the black knight on c3 after (if ever) d3. The Qe4+ is naive and pointless. ",
        "6. Nc3 Qa5": "The second step for the queen's path to c7. Now, white has to think a little about how to develop, since moving the d pawn pins the knight. White can do well about this, but he will give tempo to black to...",
        "7. a3": "Note that black can't play b4, or Bxb4, since after axB, QxR, devastating white. I can even think about Bb4 now, but it has no point while the knight is defended by the two pawns. White would move the Ra1 and that will mean to retire or exchange (which I didn't want to). So bad plan. ",
        "7... c6": "The right time for this move. Even if it seem to slow down my developement, it provides a safe square for the queen (she will be soon effectively kicked away), and stops any white's ideas of jumps with the knight soon after. My pieces, then, will develop in total harmony. ",
        "8. d3": "Accepting Bg4 because of Bd2 solves all problems for white. Again, the threat is better than the execution. Up to now, I have white \"controlled\". He can't do much apart of the forseeable moves. Can you see the psychological advantage? (or maybe I am wrong, and black is worse! What do you think?)",
        "8... Be6": "Normally, I have this bishop on f4, but now it was biting on granite, so no point. I'll wait for white to castle or to kick my queen, and fight for the black diagonal. ",
        "9. Bd2": "White choosed for kicking the queen (Ne2 and o-o was the other option, maybe preferable. The bishop's place is e3, making it difficult for black to occupy the black diagonal (g1-a7) with Bc5. Black's pawn in e4, will stay defended at least once at all times, and every black move strenghten black's position (Nd7, Bc5, f6, and black can even castle either sides. BUT maybe this won't sustain an expert opinion. I think white can threaten black on the kingside and try to force black playing defensively based on Qe2 - f4. A very interesting game will spread. ",
        "9... Qc7": "!? This is necessary, since if Bc4 inmediately, b4 forks B and Q. No countertrick. If Qb6 (occupying the diagonal), white had Na5, and my queen must choose Qa6, threatening the knight and avoiding c3 (that makes the N defended by the Q), because of Qxd3. But white can dare to play c4!?, with an interesting position. ",
        "10. Nge2": "? This is a mistake. White must have taken the tempo to occupy the diagonal, with Be3, now that Bb4 is not a threat anymore. This contains black's game. This way, white leaves black free to develop the more annoying way. ",
        "10... Bc5": "White can't castle. Of course, my bishop is not secure, but when it will be exchanged by the white knight, my Queen will take its place, with the same function. White can't play d4, and I can castle on an empty kingside. ",
        "11. b4 Bb6": "If a4, a6... ",
        "12. Na4 Nd7": "I just take the tempo to develop! I don't want to retake the bishop with the kinight. The pressure on the diagonal is most important because it maked difficult for white to develop coherently and attackingly. White has just one very powerful resource... can you see it?",
        "13. c4": "! This leaves d3 unprotected, so I can think about Qd6, Bf3 (defending d3 and preparing d4...), but it didn't convinced me (if I can say so in English). Now, c5 is playable, but after b5!, the diagonal is blocked for me and again, Qd6 seems not strong enough. ",
        "13... a6": "So I went for this one. I'll take the challenge. Go on, block the diagonal. I'll have b5. ",
        "14. c5 Ba7": "Provided b5 is not playable, this blocks me but also blocks white. Ok, he can castle. Me too.",
        "15. Be3": "! Now! This really stunned me. Very good. Now, I can accept and castle, and become the attacked, or I can be coherent with my plan, and go on fighting for the black diagonal. ",
        "15... O-O": "I was somewhat a chicken, now. This is not bad, of course, but concedes white the initiative. ",
        "16. O-O": "That he, sensibly, \"throws away\". A more aggressive approack would have been d4 at once, before black could bring his rooks in to defend it. But it was a bit risky with a higher - rated opponent. ",
        "16... b5": "I have to be brave, now or never. A plethora of exchanges will follow, and I'll have to be very careful for tricks, but I can't just go Rd8 and wait for white's Qc2, Rd1, etc.",
        "17. cxb6 e.p.": "I'm not sure this was the best choice, but the truth is that even if blacks finally plays the Qxb6+, this is not a real concern for white. ",
        "17... Nxb6": "The almost useless knight first. It opens my d column. ",
        "18. Nxb6": "Not sure about this. Probably, Nc5 would have been better, even if it is pinned. After Ka1, is doubtful black will have an easy game. ",
        "18... Bxb6": "Yes, running out of the unfortunate bishop!",
        "19. d4": "!? Ha ha, white finally played for this one! But now, the situation is different. ",
        "19... Rfd8": "! This is really nasty, since white, by unpinning the queen, allows black to play exd4, and the good move became an awful one. ",
        "20. Kh1": "Now, I think that I have to solve the tension, because I don't have a good way to further exploit the double pin. White has now d5!?, and if Rxd5, BxB, threatening my queen in return and solving the pin problem. But if black goes BxB in the first place, white can't take the black B in return due to the pin on the WQ... So I had no real hurry to resolve the tension. This was my first mistake. The second was that I overlooked Bc4! After the exchange, white has lost a defender of d4 and it will fall. ",
        "20... Rd7": "? Thinking that white has no easy way to reinforce d4 (the Q must be the last piece to retake, or white will lose material). ",
        "21. Qc2": "?? The blunder that loses the game. White had to go for f4!, opening some lines on the kingside. It was a \"forced\" counterattack. Black could only exchange on d4 before, but now he wins a piece. ",
        "21... exd4": "Caught the moment! Now or never! This is very nasty, because d3's fork follows. On the counterattack by white, I can see no inmediate threat on c6 (my Queen is not involved in the d4 fight), but I must be aware white will have Rc1. Maybe I won't be able to play Ra-d8.",
        "22. Bxd4": "? ...but it was useless to play Bf2, because of d3, forking Q and N. White lost a piece. But I would have run of the knight, with Bf2 nevertheless. d3, BxB, QxB, WQmoves, black takes the N d3xNe2, and white reatkes the pawn with the queen. I think white is sligtly better placed than in the text, but anyway... In return, it was a pity, but I didn't dare to play RxN instead, betting for the bishop's pair power. It would have been more elegant and sporting. ",
        "22... Bxd4 23. Nxd4 Rxd4": "...but this has the advantage to control c4, making any attack on the c column very difficult for white. Who, in the fry, lost a piece!",
        "24. h3": "Controlling the white squares to oppose the bishop, but leaving holes on the dark squares. I'll exploit that  very nicely if I can control the second row. Wiht a bishop plus, it must not be difficult. ",
        "24... Rad8 25. Rfd1": "Well, I didn't want to think too much at this point, and exchanged all I could before white can make some countergame. I hope you enjoyed the opening and the fight in the midgame. Now, the game is won for black, but it is still of some interest to see HOW I win it, because to have the advantage is not enough if you don't know how to exploit it. ",
        "25... Rd4xd1+ 26. Rxd1 Rxd1+ 27. Qxd1": "Black can easily fall on a back rank mate, but hey, I'm not a novice! :-)",
        "27... g6": "I regarded as a priority to avoid the back rank mate threat, that means, to free my queen to move away. True, it leave holes on the black squares, ok, but on the other side, if I played h6, I would have left the white diagonal undefended, since Bf5 is unsupported. In order to win this game, I have to exchange the queens and all the pawns I can. If I get a passer on a or c, I'll win for sure. Because see: the other threat I can build is based on Qg3-f2 or g5 and Bf1. This will threat mate. Now, can black reach this position without leaving white 1) possibility to defend g2 with the Q on the second row and 2) without letting her snatch some pawns in the process? No case. ",
        "28. a4": "That's ok... what else can white do?",
        "28... Kg7": "...inviting once for all...",
        "29. Qd4+ f6": "I can afford g4, and this will leave f3 as a target. ",
        "30. Qc5": "White, wisely, didn't go for it. He was playing really well, except for the Q move. ",
        "30... Kf7": "? Making again my queen free to move away, with the king controlling e7 and f8, but overlooking the simple...",
        "31. b5 axb5 32. axb5": "My pawn is pinned to the queen. I'm very ashamed. Now I have to get out of a second real trouble. My compliments to white!",
        "32... Bd5 33. b6": "White sees that with bxc6, QxC6, the game will lose any interest. And we play blitz to enjoy. So, white choosed for a desperate move, hoping to surprise me. And I could well have lost my nerves... could I lose or draw this? Now, now, now... let's se... wonderful. Caissa didn't betrayed me. White has no pawn to threat the bishop, and all I must care is that he can't queen. He will have to play Qa7 to threaten me, and I must exchange by force, and then, the promotion square will be white, and I will have the tempo to play d5, defending it. White played well, but with correct play from my part, he is doomed. ",
        "33... Qb7": "No check's round here, due to my previous Kf7 (it deserves a restrospective !)",
        "34. Qa5": "White goes for it. After the exchange, I will have to lose a lot of tempoes taking the pawn with the king, but guess what: I have a passer. ",
        "34... Ke7": "? White could have gone for a check's round, here, causing me another think about how to force his threat Qa8!",
        "35. Qa7": "White spares me. He probably thinks that he can take some revenge with his king while I am going to and from the pawn. ",
        "35... Qxa7 36. bxa7 c5 37. Kg1": "...but look: it is not easy for the white king to reach some target! I have the tempo I need to go for the pawn. And mine will win the game. ",
        "37... Kd7 38. Kf2 Kc7 39. Ke3 Kb7 40. g4 Kxa7 41. f4 Kb7 42. h4 Kc6 43. f5 gxf5 44. gxf5": "The pawns are blocked. On a black square, true, but the white king will fall to the c pawn sooner. ",
        "44... Kb5": "My opponent, sensibly, resigned. A very enjoyable game, where he made me sweep a lot to win. The win is not always the good meter for a good player. "
    },
    "url": "https://gameknot.com/annotation.pl/a-nice-fight-for-a-diagonal?gm=55600",
    "gameName": "A nice fight for a diagonal",
    "players": "piter949 (1600+?) vs. damalfi (1800)",
    "opening": "Scandinavian defence (B01)"
}