{
    "moves": {
        "1. d4 Nf6": "What can I say? I am a fan of my Indian systems.",
        "2. c4 e6 3. Nc3 Bb4": "I particularly like the Nimzo-Indian Defense for Black. I have spent time studying over-the-board games for many years and Indian systems make for a more dynamic game for both sides.",
        "4. e3 c5": "I believe this variation is known as the Hübner Variation, but I could be wrong. Someone pleas e confirm whether this is correct or not.",
        "5. Nf3 O-O": "Quickly goes to the main line at this point.",
        "6. Bd3 d5 7. O-O cxd4 8. exd4 dxc4 9. Bxc4 b6 10. Qe2 Bb7 11. Bg5 Bxc3 12. bxc3": "Usually white's pawn structure is weakened at this point by doubling or tripling. Like I said though, this opening is quite interesting in where it leads.",
        "12... Nbd7 13. Nd2 Qc7 14. Rac1 Nd5 15. Bxd5 Bxd5 16. c4 Bb7 17. Rc3 h6": "I thought this was a weak response on my part but the board is completely even at this point...interesting.",
        "18. Bh4 Qc6": "Applying pressure on g2, easily defended by several options.",
        "19. Rg3 Qd6": "Trying to find a weakness in white's development, but this was difficult.",
        "20. Qg4": "This is why I worried about my h6 move earlier. In case of this kind of attack, I don't have any protection for it after g6 until later in the game.",
        "20... g6": "But nothing attacking it now so this is black's move of choice.",
        "21. Re1 Rfe8 22. Rge3 Qb4 23. Rd3 Rac8 24. Qf4": "! - a solid response. This attacks the f-line pawn and the weakened h6 pawn. I considered several options here: 1) defending with the queen - Qf8, preventing further attacks on that line, but I think I lose tempo 2) g5?? - while this option may look appealing, after 24) ... g5 25) Bxg5! hxg5 26) Qxg5+! Kf8 27) Rh3 f6 28) Qg4 ... I'm not really liking this for black. The kingside is completely destroyed, which leaves me with a losing position. This leads to another option which I eventually chose...",
        "24... Kg7": "The King protects both pawns and is defended enough to move here so I didn't feel as uncomfortable with it. I looked at every possible outcome that I could as my time was running low (2 min per move doesn't leave me much time to think) Of the 2 minutes, I used 1 min 58 seconds coming up with this response.",
        "25. Rh3": "White continues to try to apply pressure to a weak pawn",
        "25... Reh8": "But this is why I liked my King move best! a defender to the rescue!",
        "26. Rb3": "Leading white to go try his luck elsewhere.",
        "26... Qa5 27. Qe3 Qh5": "With all the attacks neutralized, figured this is a good time to attack. Though mine isn't as strong at the moment...",
        "28. Bg3 Qg5": "I like games where I can make my opponent play without his queen. Though had white taken I probably would be at high risk for a drawish position, possibly losing later without it as I don't currently have any sort of attack for the kingside due to the weak side bishop defending that area pretty well.",
        "29. Qc3 Kh7 30. Qb2 Rhe8 31. Ra3 a6 32. Rae3 Qf6 33. a4 Bc6 34. a5 bxa5": "Was my best option I thought. Pushing the pawn certainly doesn't help me.",
        "35. Bd6 a4": "Defend by advancing! I love it.",
        "36. Rg3 Nf8 37. c5 Nd7 38. Rc1 Qf5 39. Nc4 Qd5 40. Ne3 Qe4 41. Qd2 g5 42. Ng4 Qg6 43. f4 f5 44. Ne5 Nxe5": "A forced trade here.",
        "45. Bxe5": "After this I offered a draw, to which my opponent decided no.",
        "45... g4 46. Qa2 h5 47. Rgc3 h4 48. Rb1 Reg8 49. Rb6": "! - An interesting position. Was thinking white would give up the rook and attack the weakened pawns.",
        "49... h3": "going here I was thinking Rxa6 would follow then I'd go hxg2. Leading to Rg3 Rgf8 h3 Rf7 Rxc6 Rxc6 (the sacrifice I foresaw earlier).",
        "50. g3": "Was quite surprised to see this, but seeing how the game was going, I guess I shouldn't be.",
        "50... a5 51. Kf2 Qe8 52. Bd6 Qd7 53. Rc1 Rcb8": "?! - I was looking at 2 decisions here. If White took with bishop, Qxd4+! Ke2 Bf3+ Kf1 Qe3 Rc2 Bg2+ Rxg2 Qc1+ Kf2 Qxc5+ giving me an edge in attacking. The other option isn't as strong, but leaves me up a pawn: Rxb8 Rxb8 d5 Bxd5! Qa1 Rg8 Qf6 Rg6 Qh4+ Rh6 Qe7+ Qxe7 Bxe7 and playing an endgame scenario from here.",
        "54. Be5": "? - would never have thought to see this move...interesting. Kind of ruins both plans now.",
        "54... Rb7 55. Ke3 Rc8 56. Kd2 Bd5 57. Qb2 Kg6 58. Rxb7 Bxb7": "Here I got offered a draw, to which I declined.",
        "59. Qa2 Kh7 60. Bd6 Bd5 61. Qb2 Kg8 62. Rc3 Bb3 63. Kc1 Qb7": "Finally I have a good enough position where I have a plan!",
        "64. Kb1 Qe4+": "First check of the game lol",
        "65. Ka1 Qxd4": "So far so good.",
        "66. Rc2": "Now he wants my queen lol",
        "66... Qd5": "...But I got other plans for it",
        "67. Rc1 Kf7 68. Qf2": "? - Interesting that he let me advance the pawn. I was thinking of sacrificing the queen, gaining a rook and retaking the queen later, but this seemed like a more feasible end game.",
        "68... a3": "Better safe than sorry.",
        "69. Qe1": "?? - Wow a horrible blunder and I immediately recognized the mate in 4 from here. I know the pawn looks free but a horrible mistake in such a great game.",
        "69... Qg2 70. Qxe6+ Bxe6 71. Rc2 Qxc2 72. Be5 Qa2#": "How unfortunate such a great game got ruined for 2 reasons: 1 - use of a computer program by my opponent (he admitted to me privately after our 2nd game) and 2 - this horrible, preventable mate. Must've turned the program off or something glitched in it lol"
    },
    "url": "https://gameknot.com/annotation.pl/a-non-gameknot-online-chess-game?gm=50421",
    "gameName": "A non-Gameknot Online Chess game",
    "players": "Igor (1912) vs. Myself (2003)",
    "opening": "Nimzo-Indian (E41), 4.e3 c5"
}