{
    "moves": {
        "1. d4 b6 2. e4 Bb7 3. d5 Nf6": "I've never seen this opening before, I'm still experimenting with \"finned\" bishops. later in the game, my LSB becomes my best weapon, and ends up winning me the game.",
        "4. f3 e5": "White makes a pawn chain, and defends his e pawn. Black strengthens his center.",
        "5. Bg5 Be7 6. Bxf6 Bxf6": "White trades his DSB for a knight, and GKA says black is up by 2/3 of a point.",
        "7. g3 O-O 8. h4": "white attacks the king-side, limiting the DSBs movement. GKA says black is up by 1 point. ",
        "8... Qe7 9. c3": "according to GKA, the game's first inaccuracy(black is +1.25). White is completely underdeveloped, and his pawn structure is less than perfect. Black is several moves ahead, and has solid pawn structure. ",
        "9... Na6 10. Bxa6 Bxa6": "White has traded both bishops for knights. White's king is in the open, and black's is tucked away. ",
        "11. a4 Rab8 12. b4 c5 13. b5 Bb7 14. c4 a5": "Several moves later, black is still +1.25. The only change is a pawn wall, and black has moved hid rook.",
        "15. Qd2 h5 16. Nc3 d6 17. Nge2 Bc8": "White has finally devolved something, and the pawn wall has grown a few spaces. black is +0.92",
        "18. f4": "Another inaccuracy by white, opening a hole in the wall here will cost him.",
        "18... Bg4 19. Ng1": "First blunder. Here, white should have advanced his pawn, not waist a tempo avoiding a trade.",
        "19... Rfe8": "Instead of taking the pawn, and capitalizing on the blunder Black blunders away his huge positional advantage. (from +5.77 to +1.29)",
        "20. f5 g5": "Black makes a mistake here, restricting his mobility.",
        "21. Nge2": "White makes a mistake, allowing Black to gain a tempo. ",
        "21... gxh4 22. Qh6": "Black responded correctly to white's mistake, but white makes another one. (here black could pick up a pawn putting him at +3.27 through Bg5)",
        "22... Qf8": "Black makes a MAJOR blunder, that could lose him a bishop. ",
        "23. Qxf6": "White responds correctly to the blunder.",
        "23... Qg7 24. Qxg7+ Kxg7 25. gxh4 f6 26. Rg1 Reg8 27. O-O-O Kh6 28. Rd2 Rg7 29. Kb2 Rbg8 30. Ka3": "Black fights a three point deficit, but here white makes the mistake of putting his king on the sideline. ",
        "30... Bh3": "Black makes an inaccuracy. (it seemed like it wouldn't hurt to much, but GKA says it loses me 1/2 a point)",
        "31. Rxg7 Rxg7 32. Rc2": "Rooks are exchanged, then white makes a mistake, better would have been attacking the bishop. ",
        "32... Rg4 33. Rc1": "White makes ANOTHER mistake. Now black is ready to invade, and only down 1.14 points.",
        "33... Rxh4 34. Rh1 Kg5 35. Rg1+": "Black has taken his pawn, creating an outside passed pawn. GKA says that this, along with with an inaccuracy from white, evens the game up. ",
        "35... Bg4 36. Rg2": "Black an white both make an inaccuracy (according to GKA).",
        "36... Rh1 37. Ng3 Bf3 38. Nxh1+": "White makes a mistake, and gives black a major positional advantage. (Black is +0.9) ",
        "38... Bxg2 39. Nf2 h4": "Black increases his positional lead to +1. Following this move, white panics, and make a mistake followed by two blunders. Black get's excited by the blunders, and does on fully capitalize on them.",
        "40. Ne2 h3": "White moves his knight to help defend, instead of activating his king. Black gets ready to promote. (GKA prefers Bf1, as it gains an advantage in fewer moves. but that is just \"win more\")",
        "41. Ng3 Kh4": "Both mistakes just effect the margin of victory.",
        "42. Ngh1": "This last blunder effectively destroys White's game. (black is +12.2, even with a material deficit)",
        "42... Bxh1 43. Nxh1": "Black exchanges his final peace for a knight, and the ability to promote a queen. (Black is +14.6)\nYou can see what I mean by black's most powerful weapon, the LSB trades himself for two knights. This soldier evens the point values, and allows the noble black king to vanquish the cowardly white king. ",
        "43... h2 44. Kb2 Kh3": "In two or three moves, white will lose his last peace, and Black will tear down white's half of the wall.",
        "45. Kc2": "White realizes that he is lost, and resigns. \nThis game is interesting to me, a pawn fence is formed half way through the game and makes an activated king MUCH more valuable than one who sits on his throne. This game is full of mistakes, but it still describes the importance of using your king. "
    },
    "url": "https://gameknot.com/annotation.pl/a-pawn-fence?gm=39794",
    "gameName": "A Pawn Fence",
    "players": "jimmag52 (1191) vs. kingzach (1141)",
    "opening": "Queen's pawn (A40), English defence"
}