{
    "moves": {
        "1. e4": "Hi everyone!\n\nAfter founding my new club I ended up playing a few games with my fellow Runners (Experts), one of those was Torsten.  I acquainted him with Operation Joblock - I gave him no opportunities of ingress and even put his queenside under a bit of pressure which was enough to prompt him to hit the Offer Draw button - and to result in an equally prompt acceptance - 4 rating points gladly gained there!  So how did all this happen?  Please read the comment in the annotation.",
        "1... e6 2. d4 d5 3. exd5 exd5": "3. ...... exd5 - as a result of this pawn trade we are in a spacious opening called The Exchange Variation of the French Defense which is slightly favourable to black in the World and the Gameknot Database but I think that white can still get a good game here.",
        "4. Nf3 Nf6": "4. ..... Nf6 - this is more like a Petrov's Defense after both e pawns have disappeared off the board.",
        "5. Bd3 c5 6. O-O": "6. 0-0 - Henry is tucked away on the kingside and I am thinking about a rook check on e1 which I execute on the following move.",
        "6... c4 7. Re1+ Be7 8. Bf1 Nc6 9. b3": "9. b3 - undermining the pawn crimp that Torsten has imposed on me.",
        "9... cxb3 10. axb3": "10. axb3 - this opens up the a column and now I inflict an isolani - as a little exercise for the Walkers - spot the isolani!",
        "10... O-O 11. Ne5": "11. Ne5 - as it will take a few moves for Torsten to attack my knight, I can quite safely put him on e5 as my d pawn is defended by Glenda - now when is she not defending pawns!?!",
        "11... h6 12. Ba3 Bxa3 13. Nxa3": "13. Nxa3 - bishop trade.  For the moment my knight looks dim on the rim but I will find a way of making him very useful indeed - never fear!",
        "13... Re8 14. Bb5": "14. Bb5 - pin.",
        "14... Qc7 15. Nxc6 bxc6 16. Rxe8+ Nxe8 17. Bd3": "17. Bd3 - we are now well into the middlegame after that plethora of exchanges.  Torsten exchanges one isolani for another - again, Walkers - do play Spot the Isolani!  That weakie may well become a target later on when pieces get traded off.",
        "17... Nf6 18. b4 g6 19. f3 Nh5 20. c3": "20. c3 - over the last few moves I have been planning to get my knight back into touch and the first square in mind for that steed is c2.  However, I decided to move my pawn to f3 to block up the d1 - h4 diagonal for Torsten's lsb.  Fou Leblanc dissuades his counterpart from controlling the a6-f1 diagonal and the b1-h7 diagonal.  I will see to it that this barbarian will not get through the gate!",
        "20... Nf4 21. Bf1": "21. Bf1 - Fou Leblanc is driven back and I must choose which diagonal I must allow Torsten's lsb to control.  I thought the b1-h7 diagonal was the lesser of the two evils and at least Fou Leblanc guards g2 against a potential front-on attack from the Wicked Witch of the West (enemy queen) et al!",
        "21... Kg7 22. Nc2 h5 23. Ne3": "23. Ne3 - that's better, at least my knight controls more squares on e3 than on a3!",
        "23... Bd7 24. Qd2 h4 25. Ra5": "25. Ra5 - in the absence of a black dsb I can put pressure on c6 with impunity by moving my rook to c5 if I can only get rid of black's nuisance knight on f4.  Never mind, where there's a will, there's a way!",
        "25... Re8 26. Nd1": "26. Nd1 - step 1.",
        "26... f6 27. Nb2": "27. Nb2 - step 2.",
        "27... g5 28. Nd3": "28. Nd3 - step 3 and now black trades off his knight and I get Fou Leblanc right back to where I wanted him.",
        "28... Nxd3 29. Bxd3 Re7 30. Rc5": "30. Rc5 - with that little problem of the black knight resolved and my bishop handily placed on d3 I now execute my plan to give Torsten two isolanis to defend by means of milking the pin of the c6 pawn.",
        "30... Be8 31. b5 Qd6": "31. .... Qd6 and DRAW OFFER!  Torsten did not like the fact that his queenside pawn structure was gonna get busted and so offered me a draw.  Gameknot Analysis assessed our position as fairly even so it was a good offer and a good acceptance.  This draw game immediately resulted in another one - this time a draw offer from Janet's bro, Battlefleet which I gladly accepted and it bumped my rating back north of 1950.  Well, brethren - I hope you have a good read because there will be more annotations from whence that came!  Kind regards - Joanne"
    },
    "url": "https://gameknot.com/annotation.pl/a-pleasant-surprise?gm=47887",
    "gameName": "A Pleasant Surprise!",
    "players": "jstevens1 (1949) vs. stalhandske (2097)",
    "opening": "French (C01), exchange, Svenonius variation"
}