{
    "moves": {
        "1. e4": "Solid & reliable opening.",
        "1... Nc6": "Leading with horsey rather than prawn :-)",
        "2. d4": "White follows usual rule - if centre space is available, grab it.",
        "2... d5": "I play a standard response with .. d5",
        "3. e5": "Pawn pushes up rather than taking...still well within normal theory...",
        "3... f6": "Now I'm feigning to play wing-theory by getting the white e pawn out of the game. This is not my real plan however.....",
        "4. Bd3": "White plays an aggressive move to threaten the queen check (Qh5). I could play g6 to block it, but I am looking for white to play the check so I play along with the terrible-looking pawn-grab instead. This allows white to develop the 'winning' position.",
        "4... Nxd4": "OK Knight takes pawn looks suicidal and breaks all the rules, but bear with me....",
        "5. Qh5+": "White plays the book move and puts me in check with a nasty bishop threat to come.",
        "5... g6": "I block with the pawn, well aware that white will now take the pawn.",
        "6. Bxg6+": "Sure enough white plays the obvious and apparently powerful move. Black would probably be advised to get the king out of there but I believe in my analysis and play the suicidal-looking move.....",
        "6... hxg6": "Allowing white to nab my rook....",
        "7. Qxh8": "The situation for black now looks grim but I believe this is a potentially winning situation. I go straight into counter-attack with.....",
        "7... Nxc2+": "Forking the rook.",
        "8. Kd1": "White plays the natural move. Black might be tempted to nab the rook but I think this would be a mistake, so I leave the knight hanging and play a strange-looking move instead.",
        "8... Qd7": "My plan here is to let the white king take my knight in order to bring it into range of my attack. Putting my queen on d2 allows me to develop quickly.",
        "9. Kxc2": "Sure enough white takes the knight.",
        "9... Qg4": "It might seem better to play Qf5+ but my analysis shows that this is non-optimum. Putting my queen on g4 serves two purposes - firstly she is now ready to swing into action in the attack and secondly she is watching the g6 pawn which, after white takes on g8, is a natural target for the white queen.",
        "10. Qxg8": "Sure enough white takes, probably sensing no great danger at this point. Now it is time to bring my bishop into the counter-attack...",
        "10... Bf5+": "White has several options but analysis indicates they all lead to a similar outcome.",
        "11. Kd2": "Kd2 is a reasonable choice from the available options....certainly not the worst.",
        "11... O-O-O": "Castling might seem to reduce attacking tempo but not so. Firstly it means I no longer need to worry about the white queen and secondly it brings my rook into the action. It also delivers the obvious threat on the white queen which demands an immediate response from white.",
        "12. Qh7": "White spots the threat and moves his queen to safety.",
        "12... Qg5+": "I deliver this check to force the king to either come more into the open or retreat to d1.",
        "13. Kd1": "White retreats which is the best response. ",
        "13... Qxg2": "I now move my queen so that white's rook is at my mercy.",
        "14. Ne2": "White plays a good response but the rook is dead-meat.",
        "14... Qxh1+": "I take-off the rook ",
        "15. Kd2": "White plays the forced move.",
        "15... Qf1": "Not an obvious move but it has advantages. It threatens f2, keeps the threat on c1 & e2 and blocks the retreat of white king to the 1 rank.",
        "16. Qh4": "White now brings his queen back into a position where it can help in the defence. This is actually a mistake - much better to have played Nc3 I think....",
        "16... d4": "Now it is time to play my master-strategy. This pawn is the key to exploiting my position and turning the position into a decisive one.",
        "17. Qf4": "Not sure about this move from white - but it allows me to play a rather nice tactical sacrifice.",
        "17... Bh6": "White must take or accept the loss of the queen.",
        "18. Qxh6": "So white takes as indicated...",
        "18... d3": "I push the passed pawn and the danger is now apparent. White should accept the loss of the Knight and play Kc3 - but whatever white does at this point I think black has a decisive advantage and should go on to win quite easily despite the material deficit.",
        "19. Ng3": "White plays the knight fork which looks OK but will lead to problems quickly....",
        "19... Qxf2+": "Queen starts the battery",
        "20. Kc3": "White plays the best available move I think.....",
        "20... Qc2+": "But that pesky pawn gives the Queen the chance to get up close and personal.....",
        "21. Kb4": "White is now up to the armpits in the brown stuff......",
        "21... Rd4+": "Bringing the rook into the attack seems the thing to do at this point....I can now smell mate.\r\nWhite has no game from here. Mate seems inevitable. At this point in the real game white resigned. There are several possible continuations but my analysis shows white with no chance.\r\nKb5 .. Qc6  Ka5 forced .. Ra4 mate\r\nKa3 .. Ra4 mate\r\nKa5 .. Qc5 mate\r\n",
        "22. Ka5 Qc5#": ""
    },
    "url": "https://gameknot.com/annotation.pl/a-possible-refutation?gm=54198",
    "gameName": "A possible refutation....",
    "players": "fondrak (1832) vs. bikerman (1963)",
    "opening": "KP (B00), Nimzovich defence, Marshall gambit"
}