{
    "moves": {
        "1. e4": "Hi everyone!  I thought I would talk about a recent game I won in the Barmy Army Tournament.  Looking at the rating differential you would think it should be a piece of cake for me.  I was aware of my opponent's optimum rating, however - 1330.  Looking back through his profile he has an impressive array of wins over 1400  opposition and even a 1500  player.  In those games he either delivered checkmate or his opponents resigned on the grounds of ruinous loss of material.  His playing strength is therefore very similar to The Dentist - remember him, anyone?  Well, I did manage to beat NN in 18 moves - Glenda struck again, but there was a stage in the game where I took 2 days to come back with a move for the want of a plan.  I hope you have a good read as this is all about an unusual opening.",
        "1... e5 2. Nf3 Nc6 3. c3": "3. c3 - this move is the Ponziani Opening, this opening is very rarely played at Master Level and is not that well known.  This move is intended to support d4, get dsb out onto e3 and then queen knight onto d2.",
        "3... Nf6 4. h3": "4. h3 - unusual continuation - probably to take me out of the database.  I did see in the database, however that somebody had played a3 and the suggested continuation was Nxe4 with at least equality for black and then I could get to see what my opponent's endgame play was like!  It didn't quite work out that way though!",
        "4... Nxe4 5. d3": "5. d3? - this is where white starts to go wrong.  He blunders a pawn.  5. Qe2 then d3 must be played to regain the pawn.",
        "5... Nf6 6. Be2 Be7 7. Qb3 O-O 8. O-O d6": "8. ....... d6 - after losing that pawn, white continues to develop sensibly and his queen exerts some pressure on b3 - on the b7 pawn and the f7 pawn is pinned.  My move opens up the diagonal for Frere Leblanc who bears down on h3 with the possibility of a bishop sac on h3 to open up the white king.",
        "9. g4 Rb8": "9. ....... Rb8 - after white's loosening g4 I decide to back up my b7 pawn to enable a possible bishop sac on g4 - white advances his pawn further to g5 with his next move.",
        "10. g5 Nh5 11. h4 g6": "11. ...... g6 - not sure I like this move but it does support my knight on h5 which controls g3 - this will become a deciding factor later on.  Over the next two moves we have some sensible development from white but in between that Frere Leblanc goes to g4 first to enable Glenda to deposit herself on d7 and then later on he will go to h3 to menace the f1 rook and then Glenda will land a nasty check on g4.  So how does this all materialise?  Read on .....",
        "12. Be3 Bg4 13. Nbd2 Qd7 14. Ne4": "14. Ne4 - to protect g3 but after my reply Bh3 white is faced with a horrible choice, ruinous loss of material or copping Old Matey.",
        "14... Bh3 15. Rfd1 Qg4+": "15. ........ Qg4  - after the rook duly moves out of the way ....... here comes Glenda!!",
        "16. Ng3": "16. Ng3 - blocks out Glenda but not for long.  My h5 knight comes into play taking off white's knight and threatening a deadly Nxe2 double check.",
        "16... Nxg3 17. fxg3": "17. fxg3 - the pawn takes allowing mate in two.",
        "17... Qxg3+ 18. Kh1 Qg2#": "18. .......... Qg2# - which Glenda duly delivers!  I know I often use her in a defensive role and she is not called Glenda the Defender for nothing, but underestimate her at your peril - she has struck quite a few times since my return from Devon in early September!"
    },
    "url": "https://gameknot.com/annotation.pl/a-ponziani-opening?gm=19546",
    "gameName": "A Ponziani Opening",
    "players": "NN (1215) vs. jstevens1 (1738)",
    "opening": "Ponziani (C44), Jaenisch counter-attack"
}