{
    "moves": {
        "1. d4 d5 2. c4 dxc4": "Queen's Pawn gambit - the programmed starting move",
        "3. Nc3": "As White, I would have played e4, but this works too (and of course, one move later...)",
        "3... Nf6": "I respond with developing my own knight",
        "4. e4": "now the pawn moves, and White threatens to win the pawn back. White already has a strong centre here",
        "4... e5": "hoping for 5. dxe5 Nf4 with the chance to retake the pawn and destroy White's centre control",
        "5. Nf3": "White brings out his other knight...",
        "5... Bg4": "so I pin it. Checking the GK database after this game, only one other game on it has been played like this so far, and Black won that game (though I'm not entirely sure if this is the best move)",
        "6. Be2": "breaks the pin",
        "6... Nc6": "more development. Looks innocent enough...",
        "7. Be3": "I'm not too sure about this move from White either...",
        "7... Nb4": "This ought to be a bad move (you shouldn't move the same piece twice during the opening) but that knight is going to help a bit later. But first, some exchanges!",
        "8. Bxc4": "White decides to finally take the pawn (I don't know why he didn't do this earlier)",
        "8... exd4": "exchange #1",
        "9. Bxd4 Bxf3": "exchange #2",
        "10. gxf3 Qxd4": "and thanks to my Black knight, Black is now up a piece - 11. Qxd4 loses to 11...Nc2+, then 12...Nxd4, then next move Black castles queenside. This puts White (who has to deal with not being able to castle and a rook on the open d-file) in a bad position",
        "11. Qb3": "White sees the threat and moves his queen, but I think Qa4+ would have been better here",
        "11... O-O-O": "Black's control of the d-file is now obvious here",
        "12. O-O": "the best move, I think...",
        "12... Bc5": "my original idea here was just to put pressure on the f2 pawn...",
        "13. Qd1": "? but this move leads to some further exchanges",
        "13... Qxf2+ 14. Rxf2": "exchange #3...",
        "14... Rxd1+ 15. Rxd1": "But Black has just lost his lead... hasn't he?",
        "15... Rd8": "I need this trade for my plan..",
        "16. Rxd8+": "exchange #4",
        "16... Kxd8": "now here's where White could have (partially) saved himself... the rook pin is a real danger, and White should have used this move to break that pin... (it's also interesting to note that Black has not developed any of his non-centre pawns)",
        "17. Bxf7": "? Nope, White goes for material greed instead",
        "17... Nd3": "and now White's rook is officially screwed!",
        "18. Kf1": "too little, too late",
        "18... Nxf2 19. e5": "only one safe place for Black's knight to go...",
        "19... Nd7 20. e6": "this is where it gets interesting - white has a potentially powerful counter-attack with his passed pawn",
        "20... Ne5": "I'm looking to capture the f3 pawn, but Black should watch out for... ",
        "21. Nd5": "with this move, Black's bishop is  burdened with the protection of the knight at f2 and the prevention of pawn promotion(Nf6 better?)",
        "21... Nxf3": "i ignore it for now, but I shouldn't have! White simply needs to move 22. b4! And Black loses the f2 knight",
        "22. a3": "White seems to forget that the d5 knight already covers that square",
        "22... Nxh2+ 23. Kg2 Nhg4": "now the knights cover each other....",
        "24. b4": "too little, too late.... again",
        "24... Bd6": "and Black provides extra force to the left side. Black should work on the left side of the board - that's where all its power lies",
        "25. Bh5": "looks like a powerful threat....",
        "25... c6": "but I counterattack, finally moving one of my non-centre pawns",
        "26. Bxg4 Nxg4": "exchange - for White, this is bad!",
        "27. Kf3 h5": "have to be careful here, for both sides",
        "28. Nf4": "White's in dangerous waters...",
        "28... Ne5+": "White nneds to be extremely careful of a king fork here....",
        "29. Ke4": "he is, and moves to a safe position....",
        "29... h4": "but now a pawn heading to promotion! White has a so many things to look out for here!",
        "30. Ke3": "? with hopes to stop the promotion, but....",
        "30... Nc4+": "king fork! (I keep using this phrase, it seems - I love this attack!)",
        "31. Kf2": "huh? White gives up on his knight to stop promotion - but at f4, promotion is still preventable (though g5! from Black would be good)",
        "31... Bxf4": "and here, White finally resigned - a great game, in my humble opinion! *motions to pre-game comment*"
    },
    "url": "https://gameknot.com/annotation.pl/a-powerful-counter-attack?gm=26426",
    "gameName": "A powerful counter-attack?",
    "players": "bugs_bobby (1006) vs. x-machine (1152)",
    "opening": "Queen's gambit accepted (D20)"
}