{
    "moves": {
        "1. e4": "My first learning game, rated as 1150 as a fairly new player.",
        "1... e5 2. Nf3 Nc6 3. Bb5": "White opens with Ruy Lopez, and I open with the Berlin Defence.",
        "3... Nf6 4. O-O": "I note that White castles early in the game.",
        "4... Bc5": "I develop my bishop and place it on a diagonal with the white king.  I am getting ready to castle.",
        "5. c3": "I first saw whites pawn push as preventing me from pushing my knight forward, or for a d4 pawn push to attack the center.",
        "5... O-O 6. d4": "White follows up with d4 attacking my bishop and pawn on e5.",
        "6... exd4": "I thought it was best to take otherwise I would lose the exchange.",
        "7. cxd4 Bb6": "Moved my bishop to safety.",
        "8. e5 Nd5 9. a4": "White pushes pawn to a4 and at this point each side was about equal.",
        "9... h6": "Blunder number 1.  I thought h6 helped block certain threats I was anticipating.  However....on the other side of the board white had other ideas...",
        "10. Bxc6 dxc6": "I'm not sure if I used the right pawn to take here.  My thoughts at the time were that it keeps the pawns grouped together and opens up my bishop.  However the weakness is that I have no center pawns and white has two.",
        "11. a5": "This is why my earlier move h6 was a blunder.  Instead I should have pushed my a7 pawn to a5 to protect my bishop that has now become trapped!",
        "11... Bxa5 12. Rxa5 f6": "Here, I see an opportunity to attack the pawn and bring my queen in to the game.",
        "13. exf6 Qxf6 14. Ne5": "Whites knight on e5 is very problematic, and I have lost my dark square bishop and have no center pawns to attack with.   I now miss my d7 pawn!",
        "14... Bf5": "I attack an unprotected knight and develop my bishop.  I think a much better move would have been to attack the rook on a5, following up with attacking whites central pawn - I was planning to do this after developing the bishop but white had something else in mind and I lost the opportunity.",
        "15. Nc3": "I'm down in material and an exchange of knights would worsen my situation from this position.",
        "15... Ne7": "I think a better move would have been to attack the rook and central pawn by pushing my pawns up.",
        "16. Qb3+": "Check - another issue with losing my central pawn!  Additionally, if I attacked the Rook earlier with my b7 pawn I would have prevented the queen fork!  I didn't attack the rook because I thought it could too easily get out of trouble, and pushing the pawn up one square seemed insignificant at the time.  Whilst I was keeping at eye out for whites queen I was expecting it to come across to my kings side...not the other way!",
        "16... Kh7 17. Qxb7": "Now I have lost my b7 pawn I no longer have a good opportunity to attack whites central pawn.",
        "17... Rfc8 18. Re1 Ng6": "Here I moved the Knight to g6 hoping white may exchange.  My strategy was to get my Queen on g6 and then my Bishop on h3 threatening white King.",
        "19. Qxc6": "This messed up my plan...",
        "19... Be6": "Blunder no. 2!  I really should have swapped Queens...I was determined to stick to my strategy without reassessing the situation.",
        "20. Nxg6 Rce8": "I can't take the Knight without further losses, so instead I move Rook to e6 which protects my Bishop and Queen",
        "21. Ne5 Qe7": "Considered Rook to f8, but this is too obvious and easily countered by white.  Instead I protect my pawn.",
        "22. Qe4+ Kg8": "I moved the King to g8.  Moving to h8 would be a problem for my Queen if white moved the Knight to g6 creating a fork.",
        "23. Bxh6": "White can afford to sacrifice the Bishop, however I decide not to take it as my Pawn is offering my King some protection.",
        "23... Qf6 24. Bxg7 Kxg7 25. Re3 Reg8": "Moved my Rook to g8 to offer some attack after check...",
        "26. Rg3+ Kf8": "The computer analysis of King to h8 shows a better outcome, with f8 I leave my rook on a8 unprotected.",
        "27. Qxa8+ Ke7 28. Rxg8 Qh6 29. Qd8#": "Things I learned from this game:\n\n1) Pawns!!!  They are more powerful than I've given them credit for, and I need to consider my opponent's pawn pushes more carefully.\n\n2) Make sure major pieces don't become trapped.\n\n3) Consider all the pieces, and don't get too analytical over just a selection of pieces or else things easily get missed.\n\n4) If you see an opportunity - don't delay.\n\n5) Think more carefully about the placement of my pawns when taking - not just for the next move but for the latter stages of the game.\n\n6) If opponent's move doesn't appear to have a purpose, then stop and consider it more carefully."
    },
    "url": "https://gameknot.com/annotation.pl/a-practice-game?gm=51885",
    "gameName": "A Practice Game",
    "players": "darknite13 (2071) vs. pauljr72 (1190)",
    "opening": "Ruy Lopez (C65), Berlin defence, Beverwijk variation"
}