{
    "moves": {
        "1. e4": "This annotation is mainly because a puzzling position in the end. My opponent resigned. I tried to create a puzzle from this position, but it halted as \"too many possible variations\". It was a nice mate in 13 moves that for a moment I thought it would really \"work\". And maybe it does... but I'll need a program to check it for sure. GK's puzzle engine is a good tool to check a position, but it stops too quickly for some complex positions. \n",
        "1... d5 2. exd5 Nf6 3. Nc3 e6": "The game went a normal Icelandic gambit, with white having played the good Nc3, instead of c4. ",
        "4. dxe6 Bxe6 5. d4 Bb4": "With the idea to exchange and try to attack c3 with Ne4. No genius plan, either. ",
        "6. Bd2 Qe7": "This is a thematic move in the Icelandic. The white bishop can discover a check going to g4, but white has easy defence. ",
        "7. Be2": "...or Ne2. True is that for white won't be easy to develop on the kingside. ",
        "7... O-O": "Maybe slow, but I couldn't see any quicker way to attack. So, I choosed to consolidate my superior developement castling soon. A rook in e8 will be wonderful...",
        "8. Nf3 c5": "I am more developed, so this will add freedom and space. White is under control, but it won't last forever.",
        "9. dxc5 Bxc5 10. O-O": "I wasn't able to find a way to prevent white from castling. ",
        "10... Rd8": "But in return I make it even more difficult for white to develop. The disadvantage of not having moved any of the c and f pawns, and have left the bishops \"in\". ",
        "11. Nb5 Nc6": "The more I develop, the better. ",
        "12. Qc1": "Good move from white, and logical, too. ",
        "12... a6": "Just to see white's ambitions with that knight. ",
        "13. Nc3 Rd7": "Just without a clear plan, I kept building pressure in the center. ",
        "14. Ng5": "My bhisops have turned to lethal weapons (thank to the pawn's clearance), so it is not wise to exchange them. ",
        "14... Bf5 15. Na4": "Interesting try by white: if Qxb, NxB. But then, Qxd5 wins a full piece. I didn't see it in the game, and played...",
        "15... Ba7": "Thinking that my bishop is doing a great job controlling the knight and pinning f7. ",
        "16. Bc4": "A threat. White is starting to untangle. ",
        "16... Ne5": "I would have left this knight for d4, but this is the only sensible move. ",
        "17. Bb3": "I expected Re1, with a powerful pressure. ",
        "17... Rad8 18. Bf4": "Ok, I have to be precise in this...",
        "18... h6": "Assuming that the Ne5 can be soon lost, I treatened his. ",
        "19. Bxe5": "It is obvious that the best piece to take it bak is QxB, but I sensed something about having the queen in the center, exposed to white's rook...",
        "19... hxg5 20. Bxf6": "This helps me a lot. White should have kept his bishop's pair aiming at my king. Re1 was called for. ",
        "20... Qxf6": "From this square my queen is X-raying f2, that I plan to conquer. ",
        "21. Qe1": "Adding a defence to f2 and freeing - or at least trying to do - the other rook. White left his advantage escape. ",
        "21... Rd7d2": "Deadly. ",
        "22. Qb1": "B2 was not the right pawn to defend...",
        "22... Bxf2+ 23. Kh1 Be4": "And my opponent resigned here. It is interesting to note that a winning move for black is Qf3 (if gxQ, Bxf3#). Aside fromt that, my bet is that from here black has a forced mate. Not so evident for the puzzle engine, but it stopped before proving it is not. What do you think? :-)"
    },
    "url": "https://gameknot.com/annotation.pl/a-puzzling-mate?gm=49083",
    "gameName": "A puzzling mate",
    "players": "janacek  vs. damalfi ",
    "opening": "Scandinavian defence (B01)"
}