{
    "moves": {
        "1. d4": "I am playing this game with the delightful Zhanna. I am over 1000 grading points above her. I delibrately let her have my queen early on, to give her a chance. Unfortunately little by little she lets me get back into the game.\r\n",
        "1... d5": "So we start conventionally.",
        "2. Nf3": "This is good development.",
        "2... Nf6": "I copy her.",
        "3. e3": "This is a good developing move too, although c2-c4 is more usual.",
        "3... e6": "I continue to copy.",
        "4. Bb5+": "This is not a good move. After the correct reply from black, c7-c6 white has to move the bishop again.",
        "4... Qd7": "So I offer the queen.",
        "5. Bxd7+": "She takes it.",
        "5... Bxd7": "I take back.",
        "6. b3": "And she develops.",
        "6... Bd6": "So do I.",
        "7. Nbd2": "This is not a bad square for the knight.",
        "7... O-O": "I castle.",
        "8. c3": "This move doesn't fit in well with 6. b3. Better was Bb2.",
        "8... Bb5": "I stop her from castling 0-0 as my bishop attacks f8.",
        "9. a4": "So she hits my bishop.",
        "9... Ba6": "So I drop back.",
        "10. Nh4": "This move doesn't achieve much. I think it would be better to continue with the plan of attacking my Ba6, with b3-b4 with the threat of b4-b5 winning my bishop and if, say c7-c6 then Qd1-b3 renewing the threat of b4-b5. If I then play Bd3, she has c3-c4.",
        "10... Nbd7": "I continue to develop.",
        "11. c4": "This is a good move, preparing 0-0. Although it eventually loses a pawn, it is worthwhile losing a pawn in this position, if it also involves improving development and exchanging pieces (which it does). White is so far up, she can afford the odd pawn here and there, as long as she is careful.",
        "11... dxc4": "I take.",
        "12. bxc4": "She takes back.",
        "12... Bb4": "This move threatens Ba6xc4 as her Nd2 is now pinned.",
        "13. O-O": "So she castles while she can.",
        "13... Bxd2": "I take the knight.",
        "14. Bxd2": "She takes back.",
        "14... Bxc4": "I take the pawn, attacking her rook.",
        "15. Re1": "And she moves the attacked rook.",
        "15... Ne4": "I advance my knight.",
        "16. Bb4": "She moves her attacked bishop, although I was in two minds whether or not I would take it anyway.",
        "16... Rfe8": "and I move my attacked rook.",
        "17. Qf3": "I don't think this is a very good move. Although it attacks my Ne4, after I protect it with Bd5, I am threatening discovered attacks on her queen, by moving my Ne4. Qc2 looked stronger to me.",
        "17... Bd5": "So I protect.",
        "18. Rac1": "She develops her rook to a sensible square, attacking my pawn on c7.",
        "18... c6": "I protect it by moving it forward.",
        "19. Qf4": "Post Match Computer Analysis (PMCA) says this is a mistake. I was thinking that maybe in some variations I can play g7-g5, attacking both her queen and knight. g7-g5 immediately though can be met with Qc7 attacking my knight, so I decide to protect my knight first, with my rook.",
        "19... Rad8": "PMCA says that this is also a mistake, and gives c5 as a better move for black. I am not convinced.",
        "20. f3": "This is a good move, attacking my knight.",
        "20... Nef6": "So I retreat it.",
        "21. Ba5": "Attacking my rook.",
        "21... b6": "I block the attack.",
        "22. Bb4": "The bishop drops back again.",
        "22... h6": "I am preparing g7-g5 again!",
        "23. e4": "But she responds with this excellent attack.",
        "23... Bb3": "So I attack her a pawn.",
        "24. a5": "She moves it.",
        "24... Ba4": "and I protect c6 again.",
        "25. Rxc6": "This is a dreadful move, just throwing away a rook for no reason. PMCA prefers 25. Qg3, although I like Qc2 hitting a2.",
        "25... Bxc6": "So I take. White is still winning, she is one point up, and has a lovely strong pawn centre.",
        "26. d5": "White opens up the position. This could have led to a wining attack.",
        "26... exd5": "So I take.",
        "27. e5": "She advances. If she had played e4-e5 earlier, my knight could have moved to the lovely square of d5, but now I have a pawn on that square, my knight has to retreat.",
        "27... Nh7": "So I retreat.",
        "28. Nf5": "Her knight moves into a dangerous attacking position, threatening Ne7 check, which also attacks the Bc6.",
        "28... Nc5": "So I block the bishop's diagonal, so that Ne2 check can just be met with Re8xe7.",
        "29. Nxh6+": "This mistake throws away white's advantage. 29. Qg4 Ng5 30. f4 Nge6 31. Nxh6+ Kf8 32. Nf5 Kg8 33. Ra1 Bd7 34. Nd6 bxa5 35. Nxe8 axb4 36. Nf6+ Kf8 37. Nxd5 is a winning line for white according to PMCA.\r\n \r\n",
        "29... gxh6": "So I take back. PMCA says it is level now.",
        "30. Qg4+": "She throws in a check.",
        "30... Kh8": "My king finds sanctuary in the corner.",
        "31. e6": "This is another blunder, just losing a pawn. White is slightly better now. PMCA gives 31. axb6 axb6 32. Qd4 Ne6 33. Qxb6 Rc8 34. Rc1 Bd7 35. Rxc8 Rxc8 36. Bd2 Kg7 37. Qb7 Nc7 38. Kf2, with a very slight edge to white.",
        "31... Nxe6": "Black is better than white now.",
        "32. Bc3+": "This doesn't help much.",
        "32... d4": "I defend the check by attacking his bishop.",
        "33. Re5": "This is a mistake too. Simply retreating the bishop to b2 was best.",
        "33... dxc3": "So I take the bishop. ",
        "34. Kf2": "It is hard to see what this achieves.",
        "34... Rd2+": "So I throw in a check.",
        "35. Kg3": "Oh no! she moves the king to the wrong square!",
        "35... Rg8": "Now she is losing her queen.",
        "36. Qxg8+": "So she takes my rook",
        "36... Kxg8": "I take back. ",
        "37. axb6": "She takes.",
        "37... axb6": "I take back. ",
        "38. Re3": "Rook attacks pawn, a good move",
        "38... c2": "Pawn advances.",
        "39. Rc3": "She stops my pawn from queening. The rest is very easy for white, so I will play through it without comment.",
        "39... Ba4 40. Rc4 b5 41. Rc8+ Kg7 42. h4 Rd1 43. f4 c1=Q 44. Re8 Qxf4+ 45. Kh3 Rh1#": "Many thanks for reading. Please leave a comment or two and rate my annotation on the star system. Until next time dear reader!"
    },
    "url": "https://gameknot.com/annotation.pl/a-queen-is-not-enough?gm=56390",
    "gameName": "A Queen is not enough",
    "players": "zhannetka-84 (939) vs. charleshiggie (2016)",
    "opening": "Queen's pawn game (D05)"
}