{
    "moves": {
        "1. d4 d5 2. Bf4 f5 3. Nf3 e6 4. Nbd2": "This is a hard set for me to break. ",
        "4... Be7 5. g3": "This must be a mistake. I try to control the black B and open a possible nice square for my lsb. ",
        "5... g5": "I can play Be5, etc, but I tried",
        "6. Be3": "\"Tempting\" black into f4, in order to make me open the g file. I hoped I could make it good for me. ",
        "6... c6": "Weak, weak move. Black has to press on my kingside.",
        "7. h4": "Crazy strike: I don't want to passively wait, and if he is passive, let's \"wake up\" him.",
        "7... g4 8. Ng5": "?? Blunder. I lose the N after h6. I realized it just a second too late. ",
        "8... Nf6": "?? He didn't! Still I can't save the N in one move...",
        "9. Bf4": "If h6, Be5, pinning the N to the R. ",
        "9... Bd7 10. Be5 O-O": "Preventing it. It's getting very dark...",
        "11. f3": "Desperado attempt to activate something!",
        "11... h6": "He did see it, finally. I couldn't figure out a better compensation, so I took the pawn. I think now it was a bad idea. ",
        "12. Nxe6 Bxe6 13. e3 Nbd7 14. Be2 gxf3 15. Nxf3 Bf7 16. Bf4": "Reorganizing. He didn't want to take my B, and I like it. ",
        "16... Ng4 17. Qd3": "I know e6 will be my headache. ",
        "17... Bh5 18. O-O-O": "?? Desperate, I overlooked the typical fork!",
        "18... Qe8": "?? He too!",
        "19. Rdf1 Bd8 20. Qb3": "I plan c4...",
        "20... Bb6 21. c4 Ndf6 22. cxd5 Nxd5 23. Bc4 Qe4 24. Kd2 Kh7 25. Ng5+ hxg5 26. hxg5 Kg6 27. Be2 Rae8 28. Bf3 Qe6 29. Bxg4 fxg4 30. Rxh5 Kxh5 31. Rh1+ Kg6 32. Rh6+ Kf7 33. Rxe6 Rxe6 34. Qd3 Nxf4 35. gxf4 Rh8 36. Qf5+ Ke7 37. g6 Rh2+ 38. Kd3 g3 39. Qf7+ Kd6 40. Qf8+ Kd7 41. g7 Re8 42. Qf7+ Re7 43. Qf5+ Kc7 44. g8=Q g2 45. Qfc8+ Kd6 46. Qg6+ Kd5 47. Qcf5+": ""
    },
    "url": "https://gameknot.com/annotation.pl/a-queen-and-pawns?gm=62837",
    "gameName": "A Queen and pawns",
    "players": "damafi (1467) vs. chicagoblackie (1451)",
    "opening": "Queen's pawn, Mason variation (D00)"
}