{
    "moves": {
        "1. Nf3": "The Reti generally is a quiet opening, but soon this will turn into something completely different...",
        "1... Nf6 2. g3 c5 3. c4": "White transposes this into a symmetrical English.",
        "3... d5": "This is already a step towards a somewhat more tactical game, the centre will be opened soon. I like to play this variation against the English.",
        "4. Qb3": "?! At the time I thought this should still be theory, but in over 1,5 million games at 365chess.com, this position has never occurred before. Quite a rarity after only 4 White moves. I guess the aim is to attack the centre immediately and prevent Black's bishop from developing on the c8-h3 diagonal.",
        "4... Nc6 5. cxd5 Nxd5": "Here Fritz (my computer program) prefers to play 5...Qxd5. I thought White could play 6.Qc2?? and then chase my queen with Nc3 or Bg2, but that fails to 6...Nd4! and if 7.Qd1? Qe4! the mate threat(!) on f3 and fork threat on c2 are just too much to handle for White (here we already see the game sharpening). So instead of 6.Qc2?? White has to retreat to d1 or exchange queens, which results in a slightly better queenless middlegame for Black due to his extra space. Of course I missed this, but my move is not bad.",
        "6. Bg2 Nb6": "Black's knight was under pressure and I didn't like to block in my light-squared bishop with 6...e6.",
        "7. Ng5": "!? I had not expected this move. This is a flat-out mating threat on f7, like a scholar's mate. However, I don't like it very much. This knight will have to waste time retreating later on.",
        "7... c4": "Again, not wanting to play 7...e6.",
        "8. Qf3": "? This is just a bad move. Black will surely not fall for this after he has seen it last move. The queen will be chased away easily from here.",
        "8... Ne5": "?! Very natural, defending the mate and chasing the queen at the same time... But not quite best. After 8...f6 9.Ne4 Nd4 10.Qc3 e5 and ...f5 Black has an overwhelming centre.",
        "9. Qc3 Qc7": "?! Again not a very good move. I was not willing to weaken my light-squared diagonals, but 9...f6 defends my knight, solidifies my centre and chases White's knight at the same time, so that's the best move here.",
        "10. d4": "! I had missed that I couldn't take en passant due to my hanging queen.",
        "10... Nc6 11. O-O": "I had rather expected (and feared) 11.d5!, which is indeed a very strong move, but White tucks his king away first.",
        "11... Bf5": "?! Developing, but probably 11...f6 was still preferable.",
        "12. Nd2": "And here again, 12.d5 could have been played.",
        "12... Rd8": "Unable to defend c4, I choose to counter-attack.",
        "13. e4": "? Loses a pawn due to a tactic.",
        "13... Nxd4": "! White can't take my bishop due to the royal fork on e2.",
        "14. Re1 Bg6": "Fritz prefers 14...Bg4, but I liked this diagonal to keep pressuring White's centre.",
        "15. b3": "Attacking my strong pawn on c4. I'm still not able to take due to the undefended queens facing each other, of course.",
        "15... Nb5": "Enabling ...cxb3 and stopping White from taking on c4 immediately, but missing The possibility of a move repetition for White.",
        "16. Qb4": "?! White misses it too, or didn't want it. After 16.Qa5 I have no better than retreating to d4, since 16...Qc5?? is strongly met by 17.a4!.",
        "16... Qe5": "? I see a possibility to win material, and grab it. Unfortunately, the position is far too sharp to go after a rook which is doing nothing on a1. 16...Nd4 is better. I'm threatening a family fork on c2, so 17.Qc3 is forced when I can play 17...Qe5. I think I missed that after 18.Qb2 the knight on g5 is hanging.",
        "17. Nxc4": "! White finds the correct move in this razor-sharp position.",
        "17... Nxc4": "I thought White's knight was too dangerous to stay alive, but I should have taken on a1. I feared 18.Nxb6?! axb6? 19.Qxb5+, but I missed 18...a6!. Fritz gives a long variation which results in a better endgame for Black: 19.Bf1 Qf6 20.Bxb5+ axb5 21.Qxb5+ Qc6 22.Qxc6+ bxc6 and I'm an exchange up. So instead of 18.Nxb6?! White should play 18.Qxb5+, when I can hold with 18...Nd7. Then White has lots of compensation for his exchange due to his activity, but it's not clear whether it's enough.",
        "18. bxc4 Nd6": "? Unfortunately, this is the losing move. I should have played 18...Nd4. I didn't like the look of 19.Bf4 when I thought I had to play 19...Qf6 20.e5 Qa6, and White is just too active. But 19...Ne2+! is a nice counter. White can't take the knight as his rook on a1 would be hanging, so I can exchange the dangerous bishop and win a pawn. Also not as good was 18...Nc3, because White still has a positional advantage due to his better coordinated pieces and Black's undeveloped kingside.",
        "19. Bf4 Qd4": "Looks dangerous, but it's the only move to at least stay in the game. 19...Qf6?? loses a piece to 20.e5.",
        "20. Bxd6": "Better was 20.Rad1! as 20...Qb6? fails to 21.Qa4+ Qc6 22.Qxc6+ bxc6 23.e5! and White wins a piece due to the threats on c6, but this is enough for the win too.",
        "20... Qxd6 21. Qxb7 Rd7 22. Qd5": "? This gives away a big part of White's advantage. Strong was 22.e5! because 22...Rxb7 23.exd6 is winning for White. Black must keep defending e7, but 23...Rd7 loses an exchange to 24.Bc6.",
        "22... Qf6": "?? However, I miss my last chance to stay in the game. I should have defended the b5 square with 22...Qa6 or 22...Qb6. Here I can't really exchange queens because White's centre pawns would be far too strong, but this is even worse.",
        "23. Qb5": "! I won't be able to defend my rook on d7, there are just too many pieces able to attack it.",
        "23... Qb6 24. Qa4 e5": "So I can reply to 25.Rad1 with 25...Bd6.",
        "25. Bh3": "But this bishop can also attack the rook. I can resign here.",
        "25... f5 26. exf5 Bc5 27. Rxe5+": "And Black resigned this very enjjoyable game. Both sides made mistakes, but White showed he was better in handling a very sharp position. I hope you enjoyed looking over this game, it sure was a pleasure to play it, even though it was my first loss to a lower rated player in a rated OTB game. Thank you for reading and commenting, see you next time!"
    },
    "url": "https://gameknot.com/annotation.pl/a-razor-sharp-fight?gm=49445",
    "gameName": "A razor-sharp fight",
    "players": "White Player (1520) vs. l-d-j (1525)",
    "opening": "Reti (A05), King's Indian attack, Spassky's variation"
}