{
    "moves": {
        "1. e4 d5 2. exd5 Nf6 3. Nc3 e6 4. dxe6 Bxe6": "Basic Icelandic set, with Nc3 from white (good, better than c4. d4 is also good.)",
        "5. d3": "Passive but solid. White can develop the lsb via g2. ",
        "5... Qe7": "This is the \"strong\" line. It threats a discovered check, grabbing something from white. For the least, a2. But if white now plays Nf3, Bg4+, and white will have to accept BxNf3, doubling and isolating his pawns. In general, it seems that black gets some activity in return of his awakward Q's position. Black's game will be aimed at a \"sensible\" dsb's developement, via g7, h6, or following the Q after some Qb4, Bd6 or c5. Black also has to put on the agende c6 (not Nc6), since white's sole developed N is potentially threatening a c7 fork. ",
        "6. Be2": "Qe2 is still better, but the truth is that if white doesn't make any mistake, he will get the better play. ",
        "6... Bg4": "? Meaningless, now. Nd5, heading for Bd5, was a weak idea, but an idea at least. ",
        "7. f3": "The only good thing I got in return is this almost forced black move, that removes white the natural N's square, making his position a little cramped. White, of course, doesnt play Nf3 because of BxN, gxN, but I am not sure that, as white, I would not have gone for it. The semiopen g column may be useful. ",
        "7... Bh5": "Inviting g4, further weakening the kingside. And I \"have\" to keep pressure on f3. White can return me the tempo and play f4, freeing himself. On the other side, with this move I just let go any Qh4+ idea. This is strong if my N (or another minor piece) can take g3 afterwards. In order to accomplish that, my ideal N's square would be... h5, which is taken by the B. And e4 is too well guarded to even think about it. Still: the said attack is stoppable by white. ",
        "8. Bg5": "Ok, no problem. The N is not going anywhere (mind: I didn't realize that white is threatening Nd5, now, since my other N is pinned)",
        "8... Nbd7": "?? Defending and developing. But very, very bad. This move allows a stunning Nd5 by white. c7 is also threatened. Qd6 seems to save the day. White has to play NxNf6, NxN or gxN. Maybe playable, but scaring. ",
        "9. Qd2": "Granting queenside castling and supporting the dsb. Losing the chance to play c4, forcing me to exchange or retire the B (g6, BxB, NxB seems a bad idea). After c4, all white's developement's promlems will vanish, and he will take a deserved revenge. On the other side, a queenside castling means a target for me. Qb4 was already an option one move before, and it still is. ",
        "9... c6": "Don't lose temper. First the first. No Nd5, and c7 as a flight square for my Q or B. Besides, I have some control of the center. White can freely play d4, in order to activate his lsb. All this requires at least c6 as a defender of d5 and b5. Still, I lost the chance to play Qb4, and that will cost me a lot in the near future. ",
        "10. O-O-O": "I won't say it will be easy, but I know where to go. Unfortunately, Qb4 is not forcing now. I also noticed the potentially dangerous position of the Wroyals, but his dsb is on the way. ",
        "10... h6": "I know, I'm not freeing my dsb. But maybe later...",
        "11. Bxf6": "The dsb had in c2 a secure and good square to land if I go for the kicking line (g5...), so there is no scope in giving it in exchange of the almost inactive Nd7. ",
        "11... gxf6": "...but I observed that after Nf6, my N had few places to go, and was kickable after some g4-f4-g5 sort of attack, so I said myself that 1) I will castle queenside, 2) This will bring me closer to a future h5, Bh6, which will be a good way to \"rehabilitate\" my weak opening. Note that if after Nc6, g4, Nxg4, fxN, Bxg4 would have been possible, and only in this case, I would have taken with the N on c6. But if I take on c6 thinking in jumping to d5 asap... this invites NxN, cxNd5, which could be potentially good for an attack via the c column and the weak a and b pawns, with few pieces coming in to help. In all this process, I forgot to consider another obvious factor latent in the position: my own royal pieces's vulnerable position. ",
        "12. g4 Bg6": "White can try f4 now, but f5 would counter it perfectly. ",
        "13. Re1": "\"Red alert, red alert...\" I was so excited about the sac idea just came to my mind, that I forgot the danger. Here, obviously, o-o-o is the option, and after, say, Bd1, my Q will start her flight in order to free the dsb. ",
        "13... h5": "Threatening Bh6 without looking at the rest of the board. But now: let's analyze the two royal pins that are about to happen. Black's Bh6 can easily be countered by just ONE move: f4. This will do. But mind: only because of that pawn. White's threat is worse: the only thing I can do not to lose the Q after Bd1 is Nd5. Now, if he tries to kick my N, he will win it with a pawn, d4, or f4. f4! Well, after f4xN, I will be free to play Bh6 and complete the royal pin! But after d4, I have o-o-o, and the WQ becomes target of my R if dxN... BUT: the tempoes white uses to take my N are enough for me to castle and get out or the royal pin. If f4 is not playable, MY pin is unstoppable. Got it?",
        "14. Bf1": "The alternative was f4 at once, but it didn't work because it would have given me tempo to castle and run out of the pin, OR even Nd5, and if fxN, BxQ+, where white would have had only two minor pieces for the Q.  ",
        "14... Ne5": "I thought it was practically forced, but I was wrong. If Bh6 now, 15. f4, o-o-o, 16. Kb1, Qd6 or Qf5, and white still can't take the N, who can save itself. ",
        "15. f4": "? White should have used the other pawn. This would he had done if he would have been aware of the danger hanging of his RP. On the other side, f5 is also a threat, forcing me to Bh7, allowing gxh5. Here, still, Bh6 seemed to be the move, but if Bh6, g5, and after fxg5, my pin threat is gone for a critical tempo! But again: if white takes the N, I will have Bh6. The position is tactically far more complex than my weak annotation. ",
        "15... O-O-O": "This move also makes possible things like Nc4, RxQ, NxQ, Re1, NxB, RxN (all practically forced, I believe), that black can crown with hxg4!! which makes white's position a lot worse. ",
        "16. fxe5": "?? White didn't calculate the power of the counterpin and the importance of the f4 pawn as the only shield. Now he will pay for it. ",
        "16... Bh6": "Now, g5 won't help. ",
        "17. exf6": "Diverting my Q from the e column, but it is a very bad move. It's hard to see some move for white, but Bh3 has at least some chances: BxQ+, KxB, (and black has one tempo to stop) gxh5+(disc., from Bh3), Kb8, hxBg6, and black is a little embarassed, since RxBh3 is just losing after NxR, and the white's f pawn can become dangerous.",
        "17... Qxf6": "Now, white should consider that the only defence of Bf1 is Re1, so he can't use it to shield the royal pin and limit the loss to an exchange... and this is the main reason for Bh3 instead of the central exchange plan. ",
        "18. Re3": "Still, Bh3 was a better \"desperate try\". ",
        "18... Qxf1+": "My opponent resigned here. I tried to imagine the lines after this, and hey: consier that black is still -1. He will win an exchange on Re3, ok, but... what else? ",
        "19. Nd1": "It seems the most reasonable defence. The sac 19.... Bxd3, 20. fxB, Rxd3!?, falls to 21. RxRd3, BxQ+, 22. RxB, protecting g2. Of course, the simple BxRd3, 20. QxB (threatening an annoying Qxa7 - Qa8+ - Qa5+ perpetual or worse... is not the solution, but for the forcing line Qg2!, threatening QxR. Now, if 21. Qf3, black gets a solid edge after Qxg5! (everything is protected and if QxQ, black gets his pawns joined again, with a plus of pressure on h2). BUT if white goes 21. Nf2 instead, it is not clear how black will win. ",
        "19... Bxe3 20. Qxe3 Qg2 21. Nf2 hxg4": "Here. A solid +2 pawn's advantage and a cramped position for white is all I need. ",
        "22. Qxa7 Qf1+ 23. Nd1 Qf4+ 24. Qe3 Qxe3+ 25. Nxe3 g3": "The real win must happens around here, with the strenght of my black pawn. A very long sequence, which my opponent should have played."
    },
    "url": "https://gameknot.com/annotation.pl/a-rare-double-royal-pin?gm=59433",
    "gameName": "A rare double royal pin.",
    "players": "1. move  vs. damalfi ",
    "opening": "Scandinavian defence (B01)"
}