{
    "moves": {
        "1. Nc3": "An unusual opening move, but the game soon transposes to a Caro-Kann. ",
        "1... d5 2. d4 c6 3. e4 dxe4 4. Nxe4 Nd7": "This is the opening Kasparov played against Deep Blue in the last game of their match. However, this game deviates from that one with the next move.",
        "5. c4 Ngf6 6. Nc3 e6 7. Bg5 Be7 8. Nf3 O-O 9. Qd2": "Each side has been carrying out development for the last few moves.",
        "9... b6": "I wanted to fianchetto my light square bishop and then play c5 to open up the diagonal for it.",
        "10. O-O-O Bb7 11. Bd3 c5 12. d5": "White threatens to block off my bishop, so I feel I need to exchange this annoying pawn off.",
        "12... exd5 13. cxd5": "White is again blocking my bishop.",
        "13... Nxd5": "Unfortunately, this move allows white to mount an attack upon my king.",
        "14. Nxd5 Bxd5 15. Bxh7+": "This move reveals an attack on my light square bishop.",
        "15... Kxh7 16. Qxd5 Bxg5+ 17. Nxg5+": "Material is even, but my king is under attack.",
        "17... Kg8 18. Qf5": "Threatening Qh7#.",
        "18... g6": "Blocking the path to h7.",
        "19. Qg4": "I thought that here white might have been thinking to attack along the h file. ",
        "19... Nf6": "So, I played this move to defend that area and offer a trade of queens (thereby slowing down white's attack).",
        "20. Rxd8": "White throws away the attack and the position becomes even again. Houdini 1.5a shows how the attack could have been conducted: 20.Qf3 Nd7  21.Ne4 f5  22.Qg3 Qe8  23.Ng5 Nf6  24.Re1 Qb5  25.Ne6 Qc4+  26.Kb1 Qg4  27.Qxg4 fxg4 28. Nxf8 and white wins a rook, losing a knight.",
        "20... Nxg4 21. Rxf8+ Rxf8": "With the exchange of material, my king feels much safer.",
        "22. f3 Nf6": "Probably retreating to f2 would have been better.",
        "23. Re1 Re8": "This prevents intrusion of the  7th rank.",
        "24. Rd1 Re5 25. Nh3 Rd5": "I probably could have accomplished more with other moves, but I wanted to keep trading in order to make things simpler.",
        "26. Nf4 Rxd1+ 27. Kxd1 Kg7 28. Kd2": "Each side begins to bring their king in to the center.",
        "28... g5 29. Nd3 Nd5 30. h3 f5 31. g3 Kf6 32. a3 a5 33. b3 f4": "Each side has been mostly advancing pawns.",
        "34. g4": "Now white has a backward pawn on h3. Perhaps gxf4 would have been better.",
        "34... Ne3": "My knight is heading for h4, where it will attack the pawn on f3.",
        "35. Kc3": "In the meanwhile, white heads over to attack my queenside pawns.",
        "35... Ng2 36. Kc4 Nh4 37. Ne1": "Now white's knight is pinned down.",
        "37... Ke5 38. Kb5": "A mistake. Houdini 1.5a recommends a4. Now black's king could come down and take the knight.",
        "38... Kd4 39. Kxb6 Kc3 40. Kxa5 Kxb3": "Here black could have played Kd2 instead, taking white's knight on the next move. However, the ending would have been difficult to play well, with each side having a queen.",
        "41. a4": "This position is perfectly equal, according to Houdini 1.5a. This game probably should have been drawn. ",
        "41... c4 42. Kb5 c3 43. a5 Nxf3": "If white takes the knight, the c pawn can advance, or so it seems. Actually, taking the knight probably would have lead to a draw.",
        "44. Nd3": "This move lost white the game. If 44.Nxf3 c2  45.Nd4+ Kc3  46.Nxc2 Kxc2  47.a6 f2  48.a8Q f1Q+ and the game is a draw as black's queen can keep checking white's king.",
        "44... Nd4+ 45. Kb6": "Another big mistake; Kc5 would have been better. However, black should still have won (though it would have taken much longer).",
        "45... Kc4": "Now black's king can box out white's king.",
        "46. Nc1": "Ne5+ would have prolonged things.",
        "46... f3 47. a6 Nb5": "Trying to stop white's pawn.",
        "48. Nd3 c2": "Taking the knight would also have won.",
        "49. Ne5+ Kb4 50. Nd3+ Kc4 51. Ne5+": "White has been harassing my king with his knight. I realize the game will end in a draw by repetition unless I step away from my knight.",
        "51... Kd5": "Now the knights leave the board.",
        "52. Kxb5 Kxe5": "It is now mate in 10 (with white getting mated) with optimal play from both sides.",
        "53. a7 f2": "White resigns as either black will promote first (if white plays something like Kb6), or black will promote with check on f1. Either way, white never gets a queen that can be used. It is checkmate in 9 with optimal play from both sides. Thanks for reading!\n\n(This was classified as a \"rapid\" game on Gameknot, so it was a bit slower than blitz)."
    },
    "url": "https://gameknot.com/annotation.pl/a-real-time-game?gm=43605",
    "gameName": "A real-time Game",
    "players": "slobodan83  vs. millsmess ",
    "opening": "Dunst (Sleipner, Heinrichsen) opening (A00)"
}