{
    "moves": {
        "1. d4 Nf6 2. Bf4 e6 3. Nf3 c5": "My own recommendation against myself.",
        "4. c3": "I play this because I don't want to handle the pressure on b2 after ...Qb6.",
        "4... Nc6": "Taking the pawn instead is good.",
        "5. e3": "Fortress buildt. Now, let's see how to attack. He has to do something with his d pawn.",
        "5... Be7 6. h3": "...or Nd7, \"waiting\" another move for him to castle. I invite him to do so this way.",
        "6... O-O 7. g4": "...with this in mind, of course. ",
        "7... d5": "Just transposition. ",
        "8. Bb5": "This is a new try for me. I intended to exchange the lsb and play on the Qside. A bad plan.",
        "8... Qb6": "...and now I can remember why! The game is lost for me. If BxN, Qxb2.",
        "9. Bxc6 bxc6": "?? Thinking that b2 is posoned, which ISN'T.",
        "10. b3": "Bad structure, always losing, but a temporary relief. Qc7 is also good.",
        "10... cxd4 11. exd4": "Never discover the black diagonal to black. ",
        "11... Ba6": "Ahhhh... a very famous bindle. Now it will be very hard to castle. ",
        "12. Qc2": "I know he will play the R on the c file, but I have a faint plan.",
        "12... c5 13. Be3": "This. Black now decides. I won't take, and he doesn't want to. With many tactics involved.",
        "13... Rac8 14. Nbd2": "Getting step by step to c5, my only chance of survival.",
        "14... Rfe8": "Another wasted tempo for black. ",
        "15. c4": "Now, this is a shot in the dark. I sensed I could benefit from the exchanges or at least make the game so complex to provoke mistakes.",
        "15... dxc4 16. bxc4": "I need the N for the protection of the white diagonal on h1, now open. ",
        "16... cxd4": "...and c4 holds.",
        "17. Bxd4": "I need a guardian for e5.",
        "17... Qc6": "Very good. Now I can't use one of my N or Rs will be lost with check.",
        "18. O-O": "I prefer to lose the c pawn. ",
        "18... Bxc4": "I missed here a \"glorious\" move: Ne4, forking B and Q. ",
        "19. Rfc1": "Now the Blsb is threatened, and exchanges will come.",
        "19... Bd5": "I can't allow the mate nets to be formed anymore, or I won't have any chance.",
        "20. Qxc6 Rxc6 21. Rxc6": "I know it's no good to exchange pieces when under, but I needed to unravel the position somehow. Probably a bad assessement here.",
        "21... Bxc6 22. Ne5 Bd5": "Now, not Bxa7?, Ra8, followed by Rxa2.",
        "23. Nb3": "This way my N are active, and it will be hard for him to preserve the B pair.",
        "23... a6": "? a4, threatening a5, was better (if Nxa5, Ra8).",
        "24. Rc1 h6": "Preventing g5 and/or a back rank mate.",
        "25. Nc6": "Time to provoke some B exchanges. The B pair is too strong. But this was very risky.",
        "25... Ba3": "...not Rc8?? NxB+.",
        "26. Rc3": "? Useless move. ",
        "26... Ne4 27. Rc2": "I'm defenseless. If he plays the K, I'm resourceless against Rc8.",
        "27... Kh7 28. Ne5": "Just strugging.",
        "28... f6 29. Nd3": "I hope in e5: it will close the position and maybe I can defend all with my K's help.",
        "29... Rb8": "Threatens b3. It will solve the B pair issue...",
        "30. Ndc5": "? Nf4 is much better. Kind of forces the exchange or black's dsb, the dangerous one.",
        "30... Nd6 31. Nxa6": "? very unsafe. Nd7-Nb6 could have been an idea. The point is to force out of the board black's lsb.",
        "31... Rf8": "Black tries an f break! Unfortunately, I can't do more than...",
        "32. Bc5": "Probably a mistake. True is that the B pair is gone, and I still can hold on my a pawn, with care.",
        "32... Bxc5 33. Rxc5": "My R must be free. Now, no much danger derives from N and B on my semiopened K.",
        "33... Ne4 34. Rc7": "Not with a concrete plan, but the most active square anyway.",
        "34... Ra8": "I lose a pawn, it seems.",
        "35. Nb4": "He loses the other B.",
        "35... Bxb3": "Probably the best.",
        "36. axb3 Rb8": "...winning another pawn. Now, he has a strong attack on f2 which I wouldn't be able to defend... but it was only a game, wasn't it?",
        "37. Nc6 Rxb3 38. Nd4": "He can save from the fork, though.",
        "38... Rb6 39. f3": "Just a desperado move",
        "39... Ng5 40. Kg2 Rb2+ 41. Kg3": "I think I'm into a mate net, but I'll let my opponent to show it.",
        "41... Rd2 42. h4": "Sob, my N has to leave. But the doubled pawn that will result from this will help me a bit.",
        "42... Rxd4 43. hxg5 hxg5": "Ok, now I am under two, but... black has to be a very tecnical player to win, if I play accuraately.",
        "44. Re7 e5 45. Re6": "If g6, Re7+ and we start a well-known dance.",
        "45... Kg6 46. Kf2 Rd3 47. Re7": "He can't move pawns. This is the key.",
        "47... Kh6 48. Re6 Kg6 49. Re7 Rd6 50. Re8": "He can advance pawns, but it will just provide my R more space to harass him.",
        "50... Kf7 51. Ra8 Re6 52. Ra4": "to e5, fxe. A losing endgame, but... please prove it.",
        "52... g6 53. Ra7+ Re7 54. Ra4 f5 55. Ke3 Kf6 56. Ra6+ Re6 57. Ra8 Rc6 58. Ra3": "Rc3+ and the backing of my K should not be allowed lightly. I can accept fxg4, since the two black pawns will be the weakest ones.",
        "58... Ke6 59. Kd3": "...Rc1, Ra4+...",
        "59... Kd5 60. Ra5+ Rc5 61. Ra6": "Now g6 is under threat.",
        "61... Rc6 62. Ra5+ Kd6 63. Rb5": "Just waiting.",
        "63... Ke6 64. Rb8 Rd6+ 65. Ke3 f4+": "Now, Ke4, in order to counter black's advance... right? :-D",
        "66. Ke2": "If Ke, Rd4#. Be aware, beginners! :-)",
        "66... Kd5 67. Kd3": "This is another story.",
        "67... Kc5+ 68. Ke4": "Now I will grab a pawn. Can you tell for sure if there is a mate net somewhere for white?",
        "68... Rd4+": "This mistake probably costed black the game. Re6 was the only reasonable option.",
        "69. Kxe5 Rd3 70. Rc8+": "A square farther can't be bad.",
        "70... Kb6": "There, I will take two pawns instead of one. Ke4, defending, was a drawish option.",
        "71. Rg8": "He can't defend it.",
        "71... Rxf3 72. Rxg6+ Kc5 73. Rxg5": "I thought I assured the split here, but in fact I am now winning. I can defend my pawn, and he can't defend his!",
        "73... Rf1 74. Ke4+ Kc4 75. Rf5 Re1+ 76. Kxf4 Rf1+ 77. Ke5 Rg1 78. g5 Kc5 79. Ke6+ Kc6 80. Rf6 Kc7 81. g6 Kd8 82. Rf8+ Kc7 83. Rf7+ Kd8 84. g7 Rg6+": "? Only hope for white is to harass white's K with checks from a safe distance. Re8+ was the only way for surviving.",
        "85. Kf5 Rg1 86. Rf8+": "...and black resigned. I didn't deserve this one, but 86 fighting moves are not easy to find in blitzes. Most of the time I was in a hurry."
    },
    "url": "https://gameknot.com/annotation.pl/a-resilient-come-back-from-death?gm=62004",
    "gameName": "A resilient come back from death",
    "players": "damafi (1394) vs. LeBeastly (1552)",
    "opening": "Queen's pawn game (A45)"
}