{
    "moves": {
        "1. e4 c6": "I've been playing the Caro-Kann more often these days. It's not uncommon to derive claustrophobic positions from this opening but I enjoy its solidity. ",
        "2. f4": "2. f4 ?! \nQuite honestly, this was a twist for me. I am reminded of horrible experiences against the Grand Prix Attack in the Sicilian. I was also somewhat relieved when I remembered the difficulties White had in playing the King's Gambit.  ",
        "2... d5": "With nothing to fear, I decide to carry out my original plan to occupy the centre and mobilize pieces.",
        "3. e5 Nh6": "I figured the Knight on the flank bolsters support against an early pawn storm while not impeding the dark-squared Bishop along the a3-f8 diagonal.",
        "4. Nf3": "Finally White decides to develop. The loss of tempi may hurt him.",
        "4... Bg4 5. d4 e6 6. Be2 c5": "At this point, it seems that my opponent has done nothing substantial to slow my development.",
        "7. O-O Nc6 8. Bb5 Nf5 9. Qd3 Bxf3": "This capture crumbles White's centre. My true target is the d4-pawn and the a6-g1 line.",
        "10. gxf3 Nfxd4": "Down goes the pawn. The bonus prize here included the doubled pawns on the f-file which are easily stopped and an open g-file to the King. The pawns on f4 and e5 will be useful in restricting White's dark-squared Bishop's mobility.",
        "11. Ba4 Be7": "A pin becomes useless if there is nothing behind the pinned piece. Therefore it is wise to move my King away.",
        "12. c3": "Prepares a repositioning of the light-squared Bishop and counterplay against O-O along c2-h7 and the g-file.",
        "12... Nf5": "Unfortunately, the loss of tempi has indeed hurt White. ",
        "13. Bxc6+": "Perhaps a move made in frustration or an attempt to repay the favour of doubling his pawns, my opponent chooses to double mine.",
        "13... bxc6 14. Qa6 O-O": "White no longer has any minor pieces developed or significant presence in the middle. There are multiple lines toward White's King which can be exploited over time. I do not mind giving up the c6 pawn to the Queen.",
        "15. Qe2": "Seeing no advantage in sacking the pawn, the Queen repositions. My line to his King is also his line to mine. At this point, I expected some attempt at removing my Knight (Nb3-c2-e3 or the like) and activation of the Bishop and Rook against my King. I was unclear of how to press against his King now. ",
        "15... c4": "I choose to open up the b6-g1 diagonal. I still have options along d8-h4 and the beautifully brutish \"ram pawns right down the middle 'til he chokes and promote\" idea.",
        "16. Kh1": "White makes his plans clear now.",
        "16... Bc5 17. Qg2 Qh4": "I use BOTH diagonals. The Queen adds pressure to the King while adding additional defense against mate on g7 if somehow both my Knight and Bishop were incapacitated.",
        "18. Bd2": "Here begins an attempt at stepwise removal of my offending pieces and development of the a-Rook.",
        "18... Qh6 19. Be1": "Leaves the f4-pawn en prise for development tempo. But...",
        "19... Ne3": "The fork does not allow that luxury. ",
        "20. Qe2 Nxf1 21. Qxf1 Qxf4 22. Na3 Qxe5 23. Bf2 Bxf2 24. Qxf2": "All my minor pieces have been removed. White has gained considerable luft now that there is no direct attack possible at the moment. However, he is down a Rook and all 8 of my pawns remain.",
        "24... Rfb8": "I grab the semi-open file, placing pressure on the b-file, a1 and c3. The g7-pawn remains untouchable.",
        "25. Rg1": "A mantra I was taught years ago (and apparently also learnt by my opponent): Better to play with a bad plan than none at all. ",
        "25... Rb6": "Prevents capture of a7 and allows doubling the Rooks on the b-file.",
        "26. Qg2 Rab8 27. Nb1": "White realizes the tide has risen along the Queenside and he will soon be covered.",
        "27... g6": "Protects the King and allows my Queen to get off a1-h8 if necessary.",
        "28. h3 Rb6xb2": "I entertained the idea of forming Alekhine's Gun but it was best to threaten mate immediately.",
        "29. Nd2 Qxc3 30. Rd1 Qc2": "They can't all be saved now.",
        "31. Qe2 c3": "White resigns."
    },
    "url": "https://gameknot.com/annotation.pl/a-rising-tide?gm=32870",
    "gameName": "A Rising Tide",
    "players": "rafferty (1345) vs. tonnerre (1200)",
    "opening": "Caro-Kann defence (B10)"
}