{
    "moves": {
        "1. d4": "Usually I prefer to play against 1.e4 when I need to play for the win, but since my results in the Sicilian were not very good at the time (2 days before this game was played: http://gameknot.com/annotation.pl?gm=10144) this was a welcome change.\n",
        "1... d5": "When I first started playing tournament chess I decided to pick aggressive counterattacking defences against both 1.e4 (Sicilian) and 1.d4 (Benoni). Unfortunately, it didn't take me long to realize that against theoretically prepared strong players (most strong MKs, FIDE masters and above) Benoni is very sensitive and I got crushed repeatedly. Since I was always slightly lazy when it comes to learning theory, I gradually switched to Queen's Gambit Declined as my primary defense to 1.d4.\n",
        "2. c4 e6 3. Nc3 Nf6 4. cxd5": "Exchange variation of Queen's Gambit Declined - historically very popular and quite effective. White usually castles short and then goes for minority attack on the queenside, but there are other relevant options (discussed at move 8).\n",
        "4... exd5 5. Bg5 Be7 6. e3": "This is a good move now that the Bishop is developed, but the move order is especially interesting. At the first glance it seems that the most natural move is 6.Nf3, but actually 6.e3 is better because it is slightly more flexible regarding later development. Also it is interesting to note that this move order prevents Black from easily playing Bf5 (6.e3, Bf5; 7.Bf6, Bf6; 8.Qb3 vs. 6.Nf3, c6; 7.e3, Bf5=).\n",
        "6... O-O 7. Bd3 c6 8. Qc2": "Another flexible move. White can now pursue 3 different plans: 1) Nf3 and 0-0 with minority attack on the queenside (central play is also possible although not as typical) 2) Nf3 and 0-0-0 followed by kingside activity (h3, g4) and 3) Nge2 with 0-0 and later attempt to play f3-e4 with full pawn center\n",
        "8... h6": "This move is a matter of personal preference. Valid options are also 8...Nbd7 (the main line), 8...Na6!? and 8...g6. I didn't like the last two because they seemed positionally dangerous in the long term, and I didn't want to define the Nb8 yet (keeping on option of Na6 for later).\n",
        "9. Bh4 Re8": "So far both players played natural moves, except that White did not develop Ng1 - that left him with 2 valid options (to play it on f3 or e2). \n",
        "10. Nge2": "White's main plan is now obvious (f3 and then e4 in order to achieve full pawn center). *** Alternative option was to return to the main line with 10.Nf3, Nbd7; 11.0-0, where 11...Ne4 is known to lead to an equal game. This would be a good psychological choice for White - I wanted to play for a win so I would probably try to complicate things eventually :)\n",
        "10... a5": "! Since before this game I have never played against or analyzed 10.Nge2 and my opponent played first 10 moves instantly (always a reason to be careful!), I decided to employ my favourite method in such cases - play something that is positionally sound but is likely out of theoretical mainlines. This move is a good choice because: 1) it stops any ideas of minority attack on the queenside (a major strategic plan in Exchange variation) 2) in unlikely event White castles on the queenside, the attack is already on the way (11.0-0-0, Na6! and Black has a slight edge) 3) it gives Black an option to play Na6 without fear of Ba6 (with doubled isolated pawns on a file) *** It turned out I was correct - this move is not recorded in my databases at all, I only found 10...Ne4 and 10...b6 (with the same idea of allowing Na6 -> Nc7 without fear of Ba6).\n",
        "11. O-O": "After 10 minutes of thinking (which made me pretty happy, since I knew that now we are both in uncharted waters) White decided to play principally and follow the main plan in the position.\n",
        "11... Nbd7": "I decided to transfer the Knight to f8 in order to reinforce the kingside and allow it access to e6 without getting it in the way of other pieces. After 11...Na6; 12.a3, Nc7 the Knight blocks the a5-d8 diagonal for the Queen while it practically must go to e6 next. That is not a bad plan but I wanted to have more flexibility and in any case forcing White to play a useful move (12.a3) is not really beneficial - it is much better to let him find a good move on his own.\n",
        "12. f3": "?! This is certainly principled, but objectively not the best plan. Black has enough time to set up a good defensive position with a lot of pressure against the d4-e4 pawn center, so White should be patient and manoeuvre for a while before trying to open the game (h3, Rfe1, Bg3 etc.)\n",
        "12... Nf8": "Black's basic setup is now complete. It might be interesting to note that Nf8 allows Black an extra defensive option in the case of future e4-e5, and that is to play the Nf6 to h7 instead of d5.\n",
        "13. e4": "?! Interesting psychological moment - this move is almost 'mandatory' here (otherwise White would have to admit that 12.f3 was premature), but I have to note that calm moves like 13.Rae1, 13.Bg3 or 13.Na4 are objectively a better choice. *** While I was first annotating this game a few months ago, I happened to find myself in this exact position here on GameKnot! So I decided to postpone publishing the annotation until the relevant game is finished. In that game miljac played 13.Na4, which after 13...Ne6; 14.Rac1, b5 eventually ended in a 58-move draw.\n",
        "13... dxe4 14. fxe4": "This move marks the end of the opening. Both players have executed their respective plans and now it is time to evaluate the results. *** At the first glance, White's pawn center together with the open f file looks really threatening, but a closer look reveals that it is in fact very vulnerable to pressure. The Knight on e2 is misplaced and should ideally be on f3, where it has greater control of the center and does not block e file for the Rooks. Another problem is that (if White advances the e pawn) the center might get permanently blockaded and later turned into a liability requiring constant defense. Objective assessment of the position (verified by analysis) is surprising - Black has slight advantage if he plays accurately!\n",
        "14... Bg4": "!? I played this without much thinking. The idea is to maximize pressure on the pawn center before forcing things with future Ne6. Although 14...Bg4 is practically not a bad move, much better alternative is direct 14...Ne6! when 15.d5 (15.Bf2, Ng4 with advantage for Black), Nc5; 16.Rad1 is slightly better for Black.\n",
        "15. Bf2": "White decided to avoid tactics based around the vulnerable position of Bh4 (variation 15.Rad1, Be2; 16.Be2, Ne4!; 17.Be7, Qe7 demonstrates the point) while reinforcing the defense of his centre. Unfortunate side-effect of this move is that the f file is now blocked. Solid alternative is 15.e5, Nd5; 16.Be7, Re7; 17.Nd5, Qd5; 18.Rf4 with approximate equality.\n",
        "15... Qd7": "? Good general idea, very bad move order. The plan was to pile up even more pressure on the center with Rad8 before finally playing Ne6, but this is a huge waste of time. Correct move is simple 15...Ne6, which gives comfortable equality after 16.Rad1, Qd7; 17.e5, Nd5=\n",
        "16. Nf4": "? White had 2 great choices here: 1) direct 16.e5, Nd5; 17.Nd5, Qd5; 18.Be3 with advantage (due to a wasted move by Black) or 2) simple and calm 16. Be3, also with slight edge. It is worth noting that 16.d5 is tempting but I correctly calculated that it doesn't give any advantage after 16...Ng6 (even 16...cd5!?; 17.Bb5, Qc7 is playable). This is probably the reason White played 16.Nf4. --- lighttotheright suggested 16.h3, which after correct 16...Be2; 17.Be2, Ne6 also results in a small advantage for White, but if Black makes a mistake with 16...Bh5?; 17.e5, Nd5? (17...Be2; 18.Be2, Nd5 and White has just a small edge); 18.Nxd5, cxd5; 19.Nf4, Bg6; 20.Nxg6, Nxg6; 21. Bf5!, Qb5; 22.e6! White has the pair of Bishops and initiative against the Black King - probably a best case scenario in this variation",
        "16... Nh5": "White now threatens 17.d5 so Black needs to exchange Nf4 immediately with one of his Knights. Since Nf8 is safe and has a good future on e6 while Nf6 is constantly threatened by e5 the choice is simple. It is important to note that White doesn't have a good alternative to 17.Nh5 so there is no risk in playing Knight to the edge of the board.\n",
        "17. Nce2": "? A bad move, after which Black has the edge and the initiative. I only considered two options: 1) 17.Nh5, Bh5; 18.Be3, Rad8 with equality (but a complex fight ahead) and 2) 17.Nfe2 where I had prepared 17...Ne6! with active play (I noticed that 17...Nf6; 18.e5 gives White the advantage as previously noted). White most likely overestimated his position here (otherwise he would go for equality with 17.Nh5).\n",
        "17... Nxf4 18. Nxf4 Bg5": "! At this point I felt that I have great practical chances to win the game. The position is obviously far from winning, but from this point on Black has the objective advantage and his game is much easier to play (a huge factor in an OTB game). Interesting fact: only 5 moves after its creation the mighty-looking pawn center has turned into a huge target. This is pretty typical and happens often if the side with the center does not quickly convert it into a more tangible advantage.\r\n",
        "19. Be3": "?? Allows Black to destroy the pawn center and win a pawn, thereby gaining a huge advantage rather easily. The only good option here was 19.Ne2, when 19...Ne6; 20.Qc3, Red8 (or 20...Rad8) gives Black a lasting advantage but the fight is far from over.\r\n",
        "19... Ne6": "Finally, the Knight enters the battle (better late than never!).\n",
        "20. d5": "Only viable alternative is 20.Qc3, but after 20...Bf4; 21.Bf4, Nd4 it doesn't make much difference.\n",
        "20... Bxf4": "Here I briefly considered 20...Nf4; 21.Bf4, cd5; 22.Bg5, hg5 but soon decided that there is no need to allow the doubling of the pawns. This way White does get a pair of Bishops but the Knight on e6 is extremely strong.\n",
        "21. Bxf4 cxd5 22. exd5 Qxd5": "The game is still objectively not lost for White, but saving it requires a precise sequence of moves. Black has material advantage and a great tactical position (open lines for Rooks, vulnerable position of White Queen and both Bishops, open a7-g1 diagonal). That makes White's task really difficult.\n",
        "23. Be4": "?? This move finally loses the game, but it is not easy to find the correct variation in the forest of tactical possibilities. Analysis reveals the best continuation: 23.Be3! (23.Bg3 is also playable) 23...Nd4! (23...Rac8; 24.Bh7!, Kh8; 25.Qe4, Qe4; 26.Be4 and White has good chances to draw); 24.Qf2, Nf3; 25.gf3, Qd3; 26.fg4, Qe3; 27.Qe3 and Rook ending should be drawable with best play. --- White's real mistake here was that he played 23.Be4 after only 12 minutes of thinking, with 33 minutes still left on the clock (!). With the bonus time increment of 30 seconds per move and in a position such as this, a player should really spend almost all of his time to find the correct plan. One bad move and time on the clock will become irrelevant in any case.\r\n",
        "23... Qd4+": "Keeps the tempi in Black's hands, allowing for activation of the last inactive piece. Time remaining: 52 minutes\n",
        "24. Kh1 Rac8 25. Bh7+": "? There was no salvation at this point, but more resilient option was 25.Qd3, Rcd8; 26.Bh7, Kh8; 27.Qg3!?, Nf4; 28.Qg4, Kh7 and Black pieces penetrate the 2nd rank.\n",
        "25... Kh8 26. Qe4": "26.Qd3, Qb2; 27.Qg3, Nf4; 28.Qg4, Nd5 doesn't help either.\n",
        "26... Qxe4": "I took some time here to check if there is a forced win in the position. The task is not objectively difficult (all White moves are forced), but nevertheless I think some less experienced players would be tempted to quickly play obvious but weaker 26...Qb2? or 26...Rc4?!\n",
        "27. Bxe4 Rc4 28. Rae1 Nxf4 29. Rxf4 Be2": "Although several moves win here (due to pins on both Rooks), I think this one is the prettiest :)\n",
        "30. Bc6": "The last try, with a slim hope of 30...bc6??; 31.Rc4. *** Time remaining: 20 minutes (too much leftover time that should have been spent finding the escape on move 23)\n",
        "30... Rxc6": "White resigned. --- I hope you enjoyed the game. There are a few interesting practical learning points to be noted: 1. During an OTB game, if you suspect that you entered your opponent's preparation - try to find a SOLID plan/move that is not likely to be a mainline. (Even when you do not know every nuance of the variation you are playing, positional logic can help in finding a good plan during the game. Perfect plans can wait for the post-game analysis!) 2. Classical pawn center should be used dynamically and quickly converted into some other type of advantage (space, initiative, material). If that is not possible, the center very often becomes a target for pressure and turns out to be a liability which needs to be constantly defended. 3. When things get critical (the result of the game is in the balance), slow down and use your time wisely. Playing fast will spare you the time trouble but will often cost you positionally. --- Thank you for looking over this game, I can answer any questions on private. Regards, Marin Vukusic \r\n"
    },
    "url": "https://gameknot.com/annotation.pl/a-short-fight-against-the-classical-pawn-center?gm=17618",
    "gameName": "A short fight against the classical pawn center",
    "players": "White player (2035) vs. marinvukusic (2144)",
    "opening": "QGD (D35), exchange, chameleon variation"
}