{
    "moves": {
        "1. d4 d5 2. Nc3": "this is a mirror of the most popular opening today. 1e4...2Nf3 are probably the most common moves to start a game",
        "2... c6": "You almost never see this, though I don't know why. it's not a BAD move, it's just not all that good. the only downside is Nc6 is no longer a playable move\r\n",
        "3. g3": "fiancetto ",
        "3... Qd6": "This is the beginning of blacks kingside attack. He sees the potential super castle with Bg2, Nf3. ",
        "4. Bg2": "I play along with black for awhile.",
        "4... Nf6": "Ng4 is an amazing spot for black in a kingside attack, because it is almost always unguarded.",
        "5. Nf3 Ng4": "this is where the game gets fun.",
        "6. Bf4 Qf6": "ok...",
        "7. Bg5": "continuing my queen attack. that knight is very useful on f3. ",
        "7... Qf5 8. Bh3 h5 9. Qd2 f6 10. e4 dxe4 11. Nh4": "ok. have you ever had one of those moments where you stop and think \"How the HECK did that happen?!\" ",
        "11... Qe6 12. d5": "the queen is getting more and more caged in every second.",
        "12... Qe5 13. Bf4": "The queen has nowhere to run, so the only hope is to counter-attack, which is hard to do when your as underdeveloped as black is.",
        "13... e3 14. fxe3 Qf5": "how could I miss this?!?!\r\ndon't say it. I missed it, life goes on. \r\nJust.... don't say it. ",
        "15. e4 Qd7 16. Ng6": "this is a nice fork.",
        "16... Rh7 17. O-O-O": "all that buildup for a kingside attack and I castle queen-side offensively\r\nIf I wasn't me I wouldn't like me very much.",
        "17... e5": "it was tempting to take on that side with en passent, but I like dxc6 better.",
        "18. dxc6 Qxc6 19. Qd8+": "the first check of the game. that's pretty sad",
        "19... Kf7 20. Qxf8+ Kxg6 21. Nd5 Nf2": "a fork? oh no, oh, wait. never mind, carry on.",
        "22. Ne7#": "this is one of the most cramped games I've played in awhile on white. and definitly the one of the better checkmates. \r\nquestions/comments?"
    },
    "url": "https://gameknot.com/annotation.pl/a-shot-in-the-dark?gm=35743",
    "gameName": "A shot in the dark",
    "players": "ME (1177) vs. Enemy (1200)",
    "opening": "Queen's pawn (D00), Chigorin variation"
}