{
    "moves": {
        "1. e4": "\"1.e4 is best by test\" Robert James Fischer once proclaimed. I bet the dissenting view is substantial.",
        "1... c5 2. Nf3 Nc6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 d6 6. Bg5": "The Richter-Rauzer variation in the Sicilian Defence, a pet favourite.",
        "6... e6 7. Qd2 a6 8. O-O-O h6": "All standard fare;  kicking the Bishop and asking The Question. ",
        "9. Bf4": "Some notable players, ex-world Champion Anatoli Karpov and Dutch GM, Jan Timman, at some time in their career preferred rather 9.Be3 here, though Karpov has played 9.Bf4 in a rapid tournament.",
        "9... Bd7": "White chops wood if Black plays:-\r\n\r\n9...e5\r\n\r\nwith 10.Nxc6 bxc6, 11.Bxe5",
        "10. Nxc6 Bxc6 11. Qe1": "A standard move in this line; protecting the e-pawn and uncovering the d1 Rook onto the d-file/Black's Queen.",
        "11... Be7": "At this juncture, Black usually plays 11...Qc7 or ... Qa5\r\n. Black's 11...Be7, to complete development w/ ASAP,  seems to have appeared first in the 1970's. The earliest referenced game I could find was Makarichev vs Szabo, Amsterdam 1975 which ended in a quick 19-move draw.   Be7 became fashionable in the 1980's onwards, with notable 'super' Grandmasters Tukmakov, Balashov, Timman, Ivanchuk  and Shirov using it for Black.\r\n White's threatened pawn push next (12.e5) is no real threat, a viewpoint held by Black.",
        "12. e5": "e5 then! After doing some home work studying + searching a few GM games (ficgames.com for one), I reckoned that resultant  play might make for a interesting fight, with danger lurking for both colours, if not tactical, at least positionally for the endgame.",
        "12... Nh5": " A little \"forced\" continuation now results with the next few moves, to reach a position what the Russian chess players call a \"tibiya,\" or starting position for consideration.",
        "13. Be3": "Didn't want to block the d-file, nor this bishop to be exchanged for a relative inactive knight if I moved it to g3.\r\n\r\nIf instead... \r\n13.exd6 Nxf4, \r\n14.dxe7 Qxe7, \r\n15.Qe3 Nd5,  \r\n... I see zero advantages for White",
        "13... Qc7": "Black removes the Queen from the d-file.",
        "14. Be2": "White is eyeing to smash Black's pawn structure on his king side...",
        "14... g6": "Forced. As said, White's intention is to re-arrange Black's pawn structure on the king side by swiping the 'Tight Knight' off the battlefield. Or so the theory goes...But  I want to get off the beaten track  ASAP, as all here has been played before numerous times.  Now that the 'tabiya' is reached,  the question is: do I exchange my bishop for his edged Knight and double-up his pawns as per current praxis? Resultant games I discovered show Black has enough counter play with an open g-file + the doubled h-pawns (after 15.Bxh5) might even be useful to march down the h-file to entice an attack there. I stumbled on an interesting move, the idea which *promises* to be quite diabolical, with a White Queen possibly raking the board all the way to b7 with latent threats. But such Faustian pacts/ideas, as always, need something in return... ",
        "15. g4": "Here it is! White is certainly spicing it up with an exchange sacricife on offer! First played, AFAIK, by the American grandmaster Michael Rohde against GM Roman Dzindzischville in the 1989 USA Championship. Black then declined the exchange sacrifice, playing rather 15...Ng7 and play ended in a draw. Studying the 1989 game, I was not convinced by White's play, so... ",
        "15... Bxh1": "...it came as no surprise when my opponent accepted the enticing carrot at h1. I found 1 game, where the German GM, Eric Lobron, playing as Black, accepted the Rook exchange sacrifice and won against his 2450 Elo-rated opponent. Not a good omen for White's chances then ..?",
        "16. Qxh1 Ng7": "So far it has been played before. White now, against GM Lobron, played Qe4 (if my memory serves correctly) and eventually Black consolidated and won with his material advantage.\r\n\r\nWhat else to play? Is there a way to prevent Black castling into safety (to either side) to consolidate his advantage in material...? ",
        "17. exd6": "First then to get rid of my endangered e-pawn. Attack the Queen and thus keeping the initiative.",
        "17... Bxd6 18. Bb5+": "Ta-daaa. To be honest, Bb5+ suggests itself, if you are desperate to get off the beaten play track. Since I'm in effect 2 pawns down, it's worth the try to:- \r\n\r\n(1) either get a pawn on my deficit immediately back WITH check (...axb5, Nxb5, Queen moves and Nxd6+ with no castling rights for Black, and further pressure on b7 with Knight (and Queen on h1), or ... \r\n\r\n(2) Black's King moves, the lesser of the 2 \"evils.\" ",
        "18... Kf8": "Black chooses the lesser of the 2 uncomfortable choices. Note that ...Ke7 entices White to nail his colours to the mast with the emphatic 19. Rxd6! sacrifice and with lines ...\r\n\r\n19...Qxd6, 20.Qxb7+ and \r\n19...Kxd6, 20.Qe4 a5 (threat 21.Qb4+), 21.Bf4+\r\n\r\nthe King/fox hunt is on. 19.Rxd6!? Would have been my reply also on 18...Kd8.",
        "19. Rxd6": "A speculative sacrifice, at best. Since I already 'pawned' my 1 Rook, why not go the full Monty.\r\n I decided after  many hours looking at alternatives,  this sacrifice might_just_work. As to the tactical soundness of it, it's anyone's guess. I *do* get to play with some extra White minor pieces, as Black's rooks and g7 knight will take time to get into the act, plus Black has a relative unsecured Monarch. ",
        "19... Qxd6": "If instead 19...axb5 20.Nxb5 Qa5, 21.Qxb7 Qxa2, the move 22.Rd7 should suffice to keep the initiative (at -1 pawn invested) as my king can escape the Black Queen checks.",
        "20. Ne4": "White's immediate threat is harassing the Queen and preparing 21.Bc5+.",
        "20... Qd8": "20...Qe5 fails to 21.f4 Qxb5, 22.Bc5+  -- 20...Qe7, 21.Bc5 axb5, 22.Bxe7+ Kxe7 and White, despite offering 2 Rooks = Queen, keeps all the winning chances with 23.Qe1 (eyeing b4+ or the c3/c7+ squares).",
        "21. Bc5+": "Side-by-side, thy Arch Bishops banish Papa below the St. Peters Basilica's dusty, dark corridors...",
        "21... Kg8 22. Bb6": "If now 22...Qc8,  23.Bd7 Qc4 24.b3 Qb4, 25.Bc5 and Black is toast. However, since Black is taking time to play his moves, my keen opponent has yet to step off the tight rope spun for him. And I am running out of ideas to force Regicide or to undress the Black Queen, given she's no Lady of the Night and about to part with her clothes so easily. Or willingly. As long as Black keeps an eye on the f6 square, he's safe. Note that the bishop is immune due to follow-ups Nf6+ & Nd7+ ",
        "22... Qe7 23. Bc5": "Shameless shuffling, but the devil is calling in his agreement and I'm running out of ideas to deal decisively with the issue at hand: A stubborn Black Queen keeping his eye on f6 by \"fawning all over the place\", as one Allied commander (in)famously accused his own British tank commanders' in the World War II (operation \"CRUSADER\" battles) and his tank commanders' run-around in the North African desert, instead of engaging Erwin Rommel's Deutsche Afrika Korps in 1941. But I digress ....",
        "23... Qh4 24. Bd4 Nf5": "Black returns a bad investment and creates a possible square (g7) for his King to move to given his confinement. No guesses, instead, why ...Ne8 'aint no gr8 for the Dark Forces.",
        "25. gxf5 Rd8 26. Be5": "Here I miscalculated, as I intended White to get some investment return with Bxh8, only to realize that Black nails me via  26...Qf4+!, 27.Kb1 Qxe4 and the stake finds a dying White heart. So, I was left with Be5, which saves the 'Arch and keeps an eye on the f4 square, but there seems to be no clear winning continuation for White now as the line 26.Nf6+ Kf8! 27.Nd7+ Rxd7, 28.Bxd7 Qxd4 29.fxe6 Qxf2 loses,  given the White Queen cannot leave the back rank successfully without being either mated, or the exchange of Queens, leaving me the exchange down in a clearly lost endgame. ",
        "26... axb5": "At last! Black guillotine's the Monk that stole the King's crown yonders ago.",
        "27. fxg6": "Vainly hoping now for 27...f5 when 28.g7 Rh7, 29.Nf6+ Kxg7 30.Qxb7+ (at last!) fries Black charcoal.",
        "27... fxg6": "You've heard the Magician's rabbit trick out of his TopHat before...  ;-)  Here both White's 28.Bxh8/Bf6 allows the Black Magician not to get bored in showing us on reply ...Qf4+ followed by ...Qxe4 as a way to laugh the tears away....   ",
        "28. Qf3 Rf8": "Black saves himself by returning almost all his material garnered earlier. Bastiche! Missed this completely.",
        "29. Nf6+": "And Black is, now,  not going to oblige and thus unleash my lady-in-waiting Queen with 29...Kg7, here -- hope spring eternal -- as it loses to this fantasy White variation 30.Qxb7+ Rf7, 31.Nh7+! Kg8, 32.Qc8+ Rf8, 33.Qxf8 Kxh7, 34.Qxh8 Mate. :-(  Nor is Black going to oblige with 29...Kf7, as my Damsel wants to unleash her original cupcake recipe thus: 30.Qxb7 MATE.    ",
        "29... Rxf6": "Only way to save the Black Monarch it seems. \"Return to sender\" all goods offered before ...",
        "30. Bxf6 Qxh2": "Looks can be deceiving. This is not a wasted Queen move grabbing a lowly pawn! Black aims to force a draw...",
        "31. Bxh8": "Of course I want my invested goods back...",
        "31... Qg1+": "There goes the last rays of hope for White to win this battle...",
        "32. Kd2 Kxh8": "Black's extra pawn is now meaningless, as white can force a perpetual check, given the position is objectively a DRAW.",
        "33. Qf8+": "And so, a DRAW about to be forced via 3x repetition soon...   ",
        "33... Kh7 34. Qf7+ Kh8 35. Qf8+": "1/2--1/2. An epic to-and-froing that could have gone either way. I thank my opponent for some sharp play and as well as *not* getting to show his rabbit party trick! ;-)"
    },
    "url": "https://gameknot.com/annotation.pl/a-sicilian-playing-the-sicilian-defence?gm=44850",
    "gameName": "A Sicilian playing the Sicilian Defence ... ",
    "players": "winecape (1906) vs. trinacria (1899)",
    "opening": "Sicilian (B58), classical"
}