{
    "moves": {
        "1. c4": "I'm a fairly flexible player who will play a variety of starting moves, so it makes sense to play a flexible opening",
        "1... c5 2. g3 Nc6 3. Bg2 Nf6 4. Nf3 e6": "so its not going to be an ultra symmetrical english where both sides have a kingside fianchetto and neither sides commit their centre pawns until the otherside has shown their hand. Obviously this is fine for black, he intends to play in the centre by preparing ...d5",
        "5. Nc3": "so that I can respond to 5...d5 with 6.cxd exd 7.d4 and try to play against an isolated queen pawn",
        "5... d6": "black avoids this and plays a flexible move that leaves options open, although white can now look at d6 as being a potential weakness by playing d4 followed by e4 and clamping down on the d5 square so as to apply pressure to d6",
        "6. O-O": "possibly a slight innaccuracy in move order, I was thinking that I should castle before opening the centre however its not as though the centre is going to be blown open and even if it were, white can always castle at the drop of a hat. instead playing d4 immediatly suggests itself, the problem with castling first is that it leaves black with more options. For example black could now play ...e5 to clamp down on the d4 square and enter a common enough set up. this isnt paticularly concerning for white but weather 6...e5 is good or bad for black doesnt matter, the point is that its better to play in a way that restricts your opponents options thus d4 immediatly should be preffered",
        "6... a6": "ok this prevents possible Nb5 ideas, especially since the queen may wish to develop to c7, as well as preparing a later ...b5 break which may be needed to challenge the white centre ",
        "7. d4 cxd4": "black cant really allow white to get in d5 ",
        "8. Nxd4 Qc7 9. e4": "gaining a space advantage and preventing black from getting in d5. Now white can makes plans based on a space advantage as well as plans based on targeting the weakened d6 pawn. Now white has a simmiler structure and play to that which is achieved in a Maroczy bind with pawns on both e4 and c4",
        "9... Be7 10. Nc2": "Be3 is another way to go, but to be honest I prefer this approach, sticking by the saying the the side with a space advantage should avoid exchanges. The knight can even be quite useful on c2 where in some cases it might play a role in watching over b4 and later down the track it might be able to redeploy to e3 if black ever plays e5",
        "10... b6 11. Qe2": "I dont actually think this is the best move available, but white has such a good solid edge in this instance that there arent really alot of bad moves to be made in the position. The thing is that blacks lack of space leaves him with no real counterplay white can take all the time he wants to calmly prepare moves like f4, b3, Qe2, Be3/a3 then followed up with doubling up on the d file and applying pressure against d6. Here I played Qe2 so that I could clear the way for a rook to come to the d file quickly whilst it also overprotects c4 and e4 plus it xrays the b5 square which makes it extremly difficult for black to effect any useful pawn break. Other moves like b3 or Be3 were also worth considering but I wasnt entirely sure if I wanted my bishop on e3 or a3 yet",
        "11... Bb7 12. b3 O-O 13. Be3": "I chose to develop to e3 because in the short term I can look to put pressure against the b6 pawn by following up with Na4.",
        "13... Rad8": "Unfortunatly for black white has a solid grip over d5 and I dont think black is going to find any way to get in ...d5 so it may have been better to keep the rook on a8 where it might have been able to assit with potential queenside operations since if black is going to find any kind of play at all it would have to be on the queenside, even if it is useful to put a rook on d8, its better to use the f rook since black might want to use the c file at some point. To be fair it is difficult in this sort of position to come up with a viable plan for the blackside, but if I were to have a go I would probably try making something happen on the queenside by considering moves that try to take advantage of the loose knight on c3 plans like Na7 with b6-b5 or Nc6-e5 followed again by a b6-b5 break even ideas like Rfc8 are worth considering if they attempt counterplay Nd7 is another possiblity that comes to mind, it would protect  b6 and also allow the bishop to come to c6 which seems like a better place than passivly sitting on e7. I think probably Na7 or Nd7 are blacks best shots here the problem is that these plans require alot of tempi to implement and in that time the whole dynamics of the position could very easily have changed",
        "14. Na4": "With the threat of a squer this seemed too good to resist, but looking back I'm not sure it gains a whole lot after black responds with Nd7. F4 was proberly a better move gaining more space and depriving black use of the e5 square or maybe Rad1 was also a better move",
        "14... Qb8": "?? Nd7 was forced. After Nd7 white has a slight edge but its only that, a slight edge black could then still cause white alot of headaches.",
        "15. Bxb6": "Now with the loss of the b pawn black will find it a whole lot harder to dig up counter play",
        "15... Rd7": "Seems natural to attempt to double up on the d file, but its unlikely black will be allowed to get in d5 so the rook might have been better on c8. But then perhaps the idea is to try hold everything together and leave it up to white to find a winning plan, afterall blacks position although cramped, is still quite solid. it might not be that easy to find a breakthrough",
        "16. Nc3 Ne5 17. Rad1": "whenever pieces are left undefended there is the possibility that there are tactics to be found. I had been thinking of getting my bishop to a3 and so played this so that I could play Be3 and resopond to a knight attacking it by simply dropping back to c1 (then on to a3) and not have to be dissrupting the communications between my rooks. As it is this is simply a mistake because by leaving my bishop hanging out to dry black can now play 17...Nxe4! or Bxe4",
        "17... Ng6": "fortunatly black missed it ...Nxe4 was the way to go",
        "18. Be3 h5": "This wont lead to much, but black is looking for counterplay and its easy to understand lashing out like this. I'm not sure what to suggest for black, maybe something like ...a5 with Ba6 to follow is one way to go, or maybe instead black can still try making use of the c file with Rc8",
        "19. Bc1": "The main move to consider is probably f4 I felt that it couldnt be prevented and since there are no threats and black has no real counterplay, I can organise my pieces however I want well taking as much time as I want to do so. ",
        "19... h4 20. Rd4": "Still f4 is probably the move to play, however I still think it cant be prevented and in the mean time I'm happy to double up or poetentially even tripple on the d file, bring my bishop to a3 maybe look at brining my knight to e3 and applying plenty of pressure against d6. Somewhere in that lot of moves f4 would probably be considered as well. The reason I played here is because I wanted to goad black into playing the positional blunder of ...e5? which would leave a hole on d5 which could be well made use of by Ne3 as well as that my rook cant be hit by a knight from this square and if black does play ...e5 then his knight would also lose access to e5 ",
        "20... hxg3 21. hxg3 e5": "? this move is a mistake and is basically commiting positional suicide. Black wasnt thinking about the consequences and only made the move for a silly one move attack against my rook when really it accomplished nothing except to worsen blacks position. At this point white should have a big plus, probably it is just a matter of technique now ",
        "22. Rd3": "After this move I think black realised that ...e5 had been a poor move",
        "22... Rfd8 23. Rfd1 Bc8 24. Ba3": "Of course I was only concerned about applying more pressure to d6 but a quick pause mught have made me realise that Bh3 was worth considering. the point is that blacks LSB is his only piece that is kind of good whereas my LSB is my only piece that isnt that good. so exchanging my good bishop for his bad bishop usually is a good idea, in this case the backward d pawn and subsequent hole on d5 make Bh3 all the more appealing  ",
        "24... Rb7 25. Ne3": "whites complete domination of d5 is really quite picturesque. White can still afford to spend loads of time placing the pieces on their ideal squares since black has no counterplay whatsoever. ",
        "25... d5": "either a complete miscalulation or misguided pawn sacrafice. this simply loses a pawn whilst gaining no compenation for the deal, white still retains the advantages except now I have another extra pawn. ...Ne8 seems to be the best try at holding the position together from there maybe black can try to play Be6 and Rbd7 and try to hold on or maybe black can try to get in f5 with something like Nf8 with g6/f5 and possibly even N-g8-e6-d4 in any case I think still shouldnt have too much difficulty winning though, possibly white would first look to exchange bishops with Kh2 and Bh3 then either plant a knight on d5 and seek an attack somewhere or apply more pressure to d6 by playing to f5 with the knight",
        "26. Bxe7 Nxe7 27. Ncxd5 Nexd5": "forced",
        "28. Nxd5 Nxd5 29. exd5": "from move 27 onward pretty much any capture would do for white, I chose this one because I have two protected passed pawns",
        "29... Bf5 30. Re3 Re7 31. c5": "getting the passers rolling and also attacking the loose pawn on a6",
        "31... Qb5": "the game is lost anyway but maybe black should have tried to keep queens on",
        "32. Qxb5 axb5 33. f4 e4 34. Rd4 Rb8": "seems sort of trappy possibly hoping I'd play Bxe4?? but if black wants to put up the most resistance then piece activity is very important, Ra8 was probably a better try",
        "35. Kf2": "Now Bxe4 is threatened since after ...Rbe8 my king can come in to f3",
        "35... b4 36. Bxe4 Rbe8 37. Kf3 g6 38. g4 Bc8 39. d6 Bxg4+ 40. Kxg4 f5+ 41. Kf3 fxe4+ 42. Rdxe4 Re7xe4 43. Rxe4 Kf7 44. Rxe8 Kxe8 45. c6": "Anyway hope you enjoyed going through the game, I know I enjoyed playing it. Its these sort of games that I find the most fun to be on the winning side of. I thought this was an excellent example of how to not allow counterplay and playing calmly by simply getting your pieces to good squares and not rushing to make things happen."
    },
    "url": "https://gameknot.com/annotation.pl/a-slow-death?gm=49247",
    "gameName": "a  slow death",
    "players": "James Watson (1502) vs. club player (1239)",
    "opening": "English (A30), symmetrical variation"
}