{
    "moves": {
        "1. d4": "We shall entitle this \"How Black Lost\" a lesson in pawns, knights, and bishops.\n\nI am annotating this game to highlight the effect that ignoring bishop/knight imbalances can have on a game. I felt the game was played fairly solidly on Whites side and that all the advantages he gained were mainly black not pursuing a coherent strategy with respect to the structure as defined above. ",
        "1... d5 2. c4 dxc4 3. e4": "Queens Gambit Accepted",
        "3... Nf6": "!? This seemed odd to me, though looking at the world games it seems not too terrible a choice if you play it right. Assuming this is a good move, Black ought to be hedging development of his pawns for a closed board.\n\nThis seems dangerous to me, since you give white the ability to secure space which he can then use to grind you down over time.",
        "4. e5 Nd5": "Pushing the knight into a little \"nest\", which gives him center control. However, he has no post for his knight and the white pawn structure is taking space away from his ability to maneuver.",
        "5. Bxc4 Nc6 6. Nf3 Bg4": "Pretty standard development from here. White protects its pawns, black moves to attack whites knights because the game, from here, looks to be closed. I.E. strategy is to attack the opponents closed pieces with your open pieces to create an imbalance between your pieces that are stronger when closed and his pieces which are stronger when open.\n\nThe line that usually follows is 7. Nc3..e6. Which gives the d knight a post and makes it harder for white to open up the center of the board when black decides to trade his bishop for a knight forcing the imbalance.\n\nThat never happens.",
        "7. Nc3 Nxc3 8. bxc3": "Instead, Black trades knights on c3. Which is disastrous. Not only has he given up the center of the board, but he is undeveloped, and Whites pawn structure(that cascade thing which i can't remember the name of) makes his white bishop even stronger.\n\nBlacks white bishop is already constrained and is about to be constrained even farther. As handy as it is to develop the other bishop, Black is developing this bishop into a position it can make little use of. It only has one square it can move into. Despite the black cascade, whites black bishop has many more options and a much larger sphere of influence\n\nThe game, which should have been about black hammering home a post on d5 is now about White owning the queen side of the board.",
        "8... e6": "The move that loses the game.",
        "9. Qa4": "White owns the queen side and pushes the attack",
        "9... Be7 10. Ba6 Rb8": "The smart thing to do here was trade the bishop for the knight, the pawn, keeping the king in the center of the board partially open, and the rook undeveloped. Yes, that is how bad it can get when you play against your strengths.\n\nThis would have weakened whites ability to attack on the queen side, now with only one strong piece. And would have let black open up the board with some more pawn sacrifices and play on his then 2 bishop advantage. ",
        "11. Bxb7 O-O 12. Bxc6 f6 13. O-O fxe5 14. Nxe5": "Oh god its all falling apart. Black opening up the board gives white a post for his knight on e5 which can fork the rooks by playing to d7",
        "14... Bf5": "!? I haven't the foggiest. Defending against a knight sacrifice on g6(which would make attacking the queen easier, but white doesn't have any material over there or anything that can be moved. It also attacks b1, preventing white from taking the b file. But white can't take the b file until it does something with his back rank bishop",
        "15. Nd7 Bd6 16. Ba3": "No need to take the rook, I can do that at any time. Better to just wait it out and make my threats even nastier. Now, white sees the attack that black is going to play. His bishops are strong over there, but it won't be enough to get past the advantage already gleaned.",
        "16... Bxh2+ 17. Kxh2 Qh4+ 18. Kg1 Bd3 19. Bxf8 Rb2 20. Ne5 Bxf1": "Black was hoping white blundered here and took with the king, which would have resulted in a checkmate. But in the end, black simply doesn't have enough material to overcome what white had already built up. An advantage gained because black didn't play a strategy that reflected the imbalances in pawns, knights, and bishops.",
        "21. Rxf1 Kxf8 22. Qa3+": "Black resigns, out of material and out of options."
    },
    "url": "https://gameknot.com/annotation.pl/a-small-tournament?gm=18769",
    "gameName": "A small tournament",
    "players": "goumindong (1421) vs. tjallen (1567)",
    "opening": "QGA (D20), 3.e4"
}