{
    "moves": {
        "1. e4 c5 2. b3": "Hmmmm, this isn't the common continuation in the sicilian... More common is Nf3, Nc3 or even Bc4\n",
        "2... Nc6 3. Bb2 Nf6": "Normal development so far... The game is still looking pretty even\n",
        "4. e5 Nd5 5. Bc4 Nc7": "I played Nc7 and not Nb6 because I had plans for an a6, b5 expansion",
        "6. Qf3 e6 7. Ne2": "Since f3 is blocked, the Knight moves to its second best developing square. This move also prepares castling\n",
        "7... a6 8. a3": "This moves loses time for white me thinks",
        "8... b5": "Its typical to play for a queenside expansion in the sicilian",
        "9. Bd3 Be7 10. Be4 Bb7": "While my opponent plays for cheapos, I continue developing. Though my knight is pinned, it wouldn't be going anywhere in the nearest future",
        "11. d3 O-O 12. Nd2 Rb8": "Ok I must confess, I wasn't too comfortable with the knight pinned",
        "13. h4": "Just when I thought white's position was ripe to castle kingside, he decides to castle queenside(or maybe not castle at all) and pawn storm my castled king",
        "13... Re8 14. g4": "Oh no, I need to find some form of counter-play if I want to win this game\n",
        "14... f6": "It was around this move I began to panic. If I was going to play f6, I should I left my rook on f8. I could have won the pawn on h4 but that just losses time and open lines to my king",
        "15. Ng3 fxe5": "Yum, free pawn\n",
        "16. g5": "Oops, my opponent traps his LSB",
        "16... d5": "Yes! I get a bishop for my troubles. Notice I also have an intimidating pawn centre. Immediately I played d5, I saw Bxh7+ could be dangerous for black if not handled carefully",
        "17. Bxh7+": "The best way to lose the bishop\n",
        "17... Kxh7": "I forgot to mention that my opponent and I had just 60seconds to make a move each. I delibrated kf8 for a long while but that just let's the bishop escape. Yeah, I know I'm greedy but if the bishop turns out to be poisoned, then my king would die with the comforting feeling of taking an enemy bishop with him",
        "18. Qh5+ Kg8 19. g6": "Solid play from my opponent. Here, he threatens mate in two",
        "19... Bf6": "But fortunately for me, I find a way out of the mate\n",
        "20. Qh7+ Kf8 21. Nh5": "Again solid play from my opponent as he continues to pressurize me. I noticed that if I could somehow get my rook to h8, I would trap his queen but to do that, I would have to play Ke7 which would become very exposed after Nxf6 Kxf6(the only way to recapture since the g-pawn would be pinned). Even though, I'm not so sure having my king on f6 would be that bad as the f-file is still closed to the white rooks.",
        "21... Nd4 22. O-O-O": "My opponent castles and gets ready to bring his other rook over to the kingside",
        "22... a5": "Now that my opponent has castled to the queenside where majority of my pieces are, I try to pawn storm his castled position also\n",
        "23. f4": "But my opponent just keeps knocking on the door looking for an opening somehow. Surely I can't allow the f-file to open so I play... ",
        "23... e4": "....",
        "24. dxe4 dxe4 25. Nxe4": "? Was this a piece sacrifice or my opponent just blundered his knight??",
        "25... Bxe4": "Whatever the answer, I'm taking the knight",
        "26. Nxf6": "Perhaps frustrated, my opponent decides to give me breathing room by exchanging",
        "26... Qxf6 27. Rh2": "??? A horrible blunder from my opponent after all his good play. He should have just sacrificed the exchange and play Qh5",
        "27... Qxg6": "???? And here, I return the favour. Bxg6 should have won the queen!!",
        "28. Qxg6 Bxg6 29. h5 Bxc2": "Probably not a good move but who cares! I get to win a pawn and the exchange which automatically simplifies to a won end game for me\n",
        "30. Bxd4": "Oh oh, I hadn't anticipated this  counter. I expected Rxc2, Nxc2 Kxc2",
        "30... Bxd1 31. Bxc5+ Kg8 32. Kxd1 e5": "This was played with the intention of fully opening the board for my rooks to operate on. If he dosent trade, I would have a passed pawn\n",
        "33. fxe5 Rxe5 34. Bf2": "This was an absolute mistake as it allows me to trade rooks.",
        "34... Rd8+ 35. Kc1 Re2 36. h6": "A pawn sac to open up lines to my king???",
        "36... gxh6 37. Rg2+": "Now this is a horrible mistake that with best play would lose the exchange for white. Best was Bg3 even though I get to trade rooks. This is exactly why Bf2 was a mistake\n",
        "37... Kh7 38. Bb6 Rxg2 39. Bxc7": "Now I could win the bishop with Rc1 but I spotted something better",
        "39... Rf8": "I threaten mate in one!\n",
        "40. Bxa5 Rf1+ 41. Be1 Rxe1#": "And the game comes to an end, hope you enjoyed. "
    },
    "url": "https://gameknot.com/annotation.pl/a-solid-defence-always-win-the-day?gm=61748",
    "gameName": "A solid defence always win the day",
    "players": "NN (1563) vs. blackrook11 (1578)",
    "opening": "Sicilian defence (B20)"
}