{
    "moves": {
        "1. e4 c5 2. Nf3 Nc6 3. d4 cxd4 4. Nxd4": "An interesting variation of the Sicilian.",
        "4... Nf6 5. Nc3 d6 6. Bc4": "Both sides concentrate on quick development.",
        "6... e6 7. Be3 Be7 8. Qe2 O-O": "Black castles, removing his King from the white Queen's line of fire.",
        "9. Bb3 Qc7 10. O-O-O": "White completes his own development and commences trying to build up an attack.",
        "10... a6 11. Rhg1 b5": "With the Kings on opposite flanks, both players push forward. It's now a matter of who gets there \"fustest with the mostest.\"",
        "12. g4 b4 13. Nxc6 Qxc6 14. Nd5": "White makes a sacrifice to open lines and generate a fast attack.",
        "14... exd5 15. g5 dxe4": "Bl;ack tries to break the attack with a counter-sacrifice.",
        "16. gxf6 Bxf6 17. Bd5 Qa4": "At the time this game was played, it was thought that Black stood well here. If White tries 18 BxR?, the counter is 18...B-K3! Now White is in trouble, i.e. 19 BxP? BxPch! or 19 B-Q4 BxB! 20 RxB QxRP with a violent attack.",
        "18. Qh5": "Ostapenko has other ideas.",
        "18... Be6": "Forced. 18... P-N3 falls to 19 RxPch! RPxR 20 QxPch B-N2 21 B-Q4!",
        "19. Rxg7+": "This sacrifice wins the game for White. Black could have resigned here, but he didn't.",
        "19... Bxg7 20. Rg1": "Black's position is hopeless. If he tries 20... QR-B1, White has 21 RxBch!! KxR 22 B-Q4ch! P-B3 23 Q-N5ch! and Black can resign. [23... K-R1 BxPch wins both Rooks., and 23...K-B2 24 QxPch K-K1 25 QxBch K-Q1 26 B-N6ch R-B2 27 QxPch K-K1 28 Q-K5ch doesn't help.]",
        "20... Rfc8 21. Rxg7+ Kxg7": "If ...K-B1, 22 RxPch forces mate.",
        "22. Qh6+ Kg8 23. Bxe4": "Kills Black's mating threat. Black has no good options here. 23 ...RxPch falls to 24 BxR R-QB1 25 QxPch K-B1 26 Q-R8ch K-K2 27 B-N5ch K-Q2 28 QxRch!! and the Black Queen falls. 23 ...QxPch is helpless against 24 BxQ B-B4 25 B-Q4 RxBch 26 K-Q1 P-B3 27 QxBP!! and wins. Black's best move is 23 ...R-B4!!, but even this is refuted by 24 BxPch! K-R1 25 B-B5ch K-N1 26 B-Q4 R-K4 27 BxR PxB 28 Q-R7ch K-B1 29 BxB PxB 30 Q-R8ch!! winning the Rook and leaving Black in a hopeless position, as the ending is lost for him.",
        "23... b3 24. Bxh7+ Kh8 25. Bf5+ Kg8 26. Qh7+ Kf8": "Chasing Black's King all over the board...",
        "27. Bh6+ Ke8 28. Qg8+ Ke7 29. Bg5+": "The hunt is merciless.",
        "29... Kd7 30. Qxf7+ Kc6 31. Bxe6": "White has gained back most of his material. Black is helpless against the Bishops. For instance, if Black tries 31 ...QxP White has 32 Q-Q7ch K-N3 33 B-K3ch K-R4 34 B-Q2ch K-N3 35 QxPch R-B3 36 B-K3ch K-N2 37 Q-Q7ch R-B2 38 B-Q5ch K-N1 39 Q-Q8ch R-B1 40 Q-N6 mate. 31 ...R-B2 fails against 32 B-Q5ch!! K-N3 33 B-K3ch R-B4 34 Q-N7ch K-R4 35 B-Q2ch!!! winning. White's Bishops are simply murderous.",
        "31... Kb6 32. Be3+ Ka5 33. Bxc8 Rxc8": "Material is even, but White has two deadly passed Pawns on the K-side.",
        "34. Qf5+ Rc5 35. Bxc5": "Black could easily resign here, but he drags out the inevitable.",
        "35... Qb5": "If ...PxRP, White has 36 P-N4ch! K-N4 37 Q-Q7ch in reserve.",
        "36. Bb4+ Kxb4 37. a3+ Kc4 38. Qxb5+": "The final blow. White will win the Black QNP and win with his K-side passers.",
        "38... axb5 39. cxb3+ Kd3 40. Kd1": "Jarchev throws in the towel."
    },
    "url": "https://gameknot.com/annotation.pl/a-sparkling-attack?gm=28984",
    "gameName": "A sparkling attack",
    "players": "Ostapenko  vs. Jarchev ",
    "opening": "Sicilian (B58), classical"
}