{
    "moves": {
        "1. d4": "This was a friendly game I played recently at my club against one of the main organisers.",
        "1... Nf6 2. c4 c5": "Aiming for the Benko, (3.d5 b5). Unfortunately, my opponent did not feel like allowing this, and after this I made a hash of the opening.",
        "3. Nf3 e6": "Planning a later ...d5.",
        "4. g3 Nc6 5. d5": "This is the problem with my play: I have failed to adequately hold the centre. I was not keen to play 5...Ne7 due to 6.dxe6, when my position becomes very difficult to play.",
        "5... exd5 6. cxd5 Nb4": "6...Ne7 7.Nc3 seems good for white.",
        "7. Nc3 b6": "Here, I decided to attempt a hypermodern strategy, by fianchettoing on both sides, playing ...d6, and gaining a position which looked as though it shold hold the draw.",
        "8. e4 Bb7 9. a3 Na6": "I planned to move the a6 knight to c7, to restrict black's control of b5.",
        "10. e5 Qe7": "I wanted to avoid an exchange on h6, so this looked sensible. White has a clear advantage here, but I hoped to show that the pawns were overextended.",
        "11. Bh3": "Threatening d6, which wins the knight, since the queen must move off the e-file, removing the pin.",
        "11... d6": "An effort to close up the centre.",
        "12. e6": "This is a mistake that may well have cost white the win. In the post mortem, we concluded that 12.0-0 gave white a clear win; after 12...dxe5 13.Nxe5, black would be unable to take the knight due to 14.Re1.",
        "12... Nc7": "Applying pressure to d5 and e6, the key squares of this battle.",
        "13. Bg5 Ncxd5": "This wins at least a pawn, although it was based on a miscalculation: I had expected 14.Nxd5 Bxd5 15.Qxd5 Nxd5 16.Bxe7 Nxe7 17.exf7+ Kxf7, when black cannot castle but has an extra pawn and white is in no position to start forcing matters: 18.Bg2 Kf6 19.0-0 looks best.",
        "14. Nxd5 Bxd5 15. Bxf6": "Oh dear. I hadn't anticipated this. Fortunately, I had a brainwave:",
        "15... Qb7": "This is an excellent move, rescuing the d5 bishop while creating a double attack on the f6 bishop and the f3 knight to win a pawn... or so it seems. There is, in fact, a highly complex variation following 16.Bg2 gxf6 17.exf7+, when my investigation suggests white is winning:\r\na) 17...Kxf7?? 18.Ng5+ fxg5 19.Bxd5+ wins black's queen.\r\nb) 17...Qxf7?! 18.Ng5 is very complex and at time of writing my mind is too hazy to go into it without a board to move the peices on, but again white looks to at least recover the material.\r\nc) 17...Bxf7 18.Nh4 wins the exchange due to the skewer along the long diagonal.",
        "16. exf7+ Kxf7 17. O-O": "This is a serious mistake, since it costs white a whole peice. From here, black is simply consolidating and capitalising.",
        "17... Bxf3": "The threat on the queen gives black time to get the bishop as well.",
        "18. Qd3 gxf6": "I did not like the look of 18...Kxf6?! 19.Qf5+ Ke7 Rfe1+ or 19...Kg8, where the king as trapped in a potentially very dangerous place.",
        "19. Rfe1 Re8": "It makes sense to exchange material.",
        "20. Rxe8 Kxe8 21. Re1+ Kf7 22. Qf5": "Attacking e6. I could not see anything after  this, so I formed a plan and began carrying it out. In this case, the plan was to push a pawn to h4, and open up the white king's defenses.",
        "22... h5 23. Re3 Bd5 24. Rd3 Be4": "These moves do not require comment, but I like to have a picture of the board at least every three moves in online annotations.",
        "25. Qe6+ Kg7 26. Re3": "Again, the bishop is threatened.",
        "26... d5 27. f3 Bg6 28. Bg2": "Now I planned to try to make the most of my passed d-pawn.",
        "28... d4 29. Re1": "I had expected 29.f4, but this is much the same.",
        "29... Qc7 30. f4 c4 31. Bc6": "I failed to spot why my opponent played this move until it was too late; fortunately, I still had a large advantage. 31...Bf7 looks best.",
        "31... Rh7": "Planning ...Kh6.",
        "32. Qxc4": "Whoops! There goes one pawn.",
        "32... Kh6": "The other has a tactical defense: 33.Qxd4?? Bc5.",
        "33. Qc1": "Threatening f5+, winning back the bishop thanks to the threat of Be4+ after Kxg6.",
        "33... f5": "I did spot this however, and with about three minutes remaining on his clock (I had five) my opponent resigned."
    },
    "url": "https://gameknot.com/annotation.pl/a-stroke-of-luck?gm=25759",
    "gameName": "A stroke of luck",
    "players": "???  vs. Pearson ",
    "opening": "Benoni defence (A56)"
}