{
    "moves": {
        "1. d4 c5": "i tried gambit to conquer the centre",
        "2. d5": "he declined the gambit",
        "2... d6 3. c4 Nf6 4. Nc3": "i dont like his pawn at d5. i was thinking of something to get rid of it. this pawn is now big headache for me.",
        "4... e6 5. e4 exd5 6. cxd5": "now his 2 connected pawns in the centre. my opponent plays smart. ",
        "6... Be7": "preparing for castle",
        "7. Nf3 O-O 8. Be2 Bg4": "thought of developing my bishop by attacking, not a threat at all. but this opens a weakness. my pawn at b7 is undefended now.",
        "9. O-O a6 10. h3 Bd7": "very bad move. i was retreating. but Bd7 was bad because it blocks only block for my knight at b8 to develop. a big mistake.",
        "11. e5": "good attack. see, if i capture dxe5 then he would advance his pawn at d5 to d6. smart opponent. ",
        "11... Ne8": "so retreated my knight to safety.",
        "12. Re1": "rook conquers the half open file.",
        "12... dxe5": "now i could capture his pawn. ",
        "13. Nxe5 Nd6": "i moved the knight to d6 to block the movement of pawn.",
        "14. Qc2": "a good move. his queen moved to a better position aiming at castle pawn. i.e pawn at h7. see, he could make a battery by moving LSB to d3. ",
        "14... Qc8": "i made a battery before him. but computer analysis says it was not my best move. computer suggests LSB to f5 threatening his queen.",
        "15. Bf3": "he makes support to most advanced pawn at d5. very good tactics. prevention is better than cure. defend an non threatened piece beforehand. ",
        "15... Bf6 16. Nxd7": "he is exhanging my bishop with his knight. i have 2 option. capture his knight by my queen or with my knight at b8. which is better? ",
        "16... Qxd7": "i chose to capture it with queen. a bad move. i should have captured it with knight at b8. so i could develop my undeveloped knight. just see the my opponent pawn at d5 is too strong threat for me. that is why all GMs say conquer the centre. i never experienced such strong threat in my previous games. so i learned how just one pawn made to suffer occupying the centre. ",
        "17. Bd2": "he developed his DSB",
        "17... b5": "i started queen side attack. but this opened a potential discovered attack. when a pawn is moved what opportunity it gives to th opponent. my rook at a8 is at potential discovered attack by his LSB at f3. so when he moves his central pawn it becomes a discovered attack. i didnt notice this at all. i failed my game just because of 2 factors. 1. his strong pawn at centre. 2 a potential discovered attack by moving his pawn when he could. ",
        "18. Ne4 Nxe4 19. Bxe4": "knights were exchanged also, a battery is formed.  i have to defend it.",
        "19... g6": "i moved my pawn to defend threat of his battery",
        "20. Be3": "he simply threatens my undefended pawn at c5.",
        "20... c4": "i moved to safety. ",
        "21. Rad1": "he moved his rook to half open file supporting his pawn. a good tactics.  \n\n",
        "21... Qd6": "i cannot allow his pawn to move any further.",
        "22. b3": "he attacked my pawn chain. a good tactics. ",
        "22... c3": "ofcourse,i didnt want to exchange my most advanced pawn. so i moved further one square.",
        "23. g3": "i didnt think much while playing why he moved this pawn. but he did that for a purpose. his plan was to threaten my queen by his DSB at f4. such a good opponent i am playing with. my best move here is to defend it with DSB to e5. i didnt see his plan at all. so definitely i didnt defend it. ",
        "23... Rc8": "i gave additional support to my most advanced pawn. ",
        "24. Bf4": "he attacked my queen. ",
        "24... Be5": "very late to defend it. i didnt this to defend it but was a blunder or a mistake. ",
        "25. Bxe5": "he captured my DSB. i couldnt capture it back because if i did. i give much advatage. how? suppose i capture it back with my queen. then my queen is under potential discovered attack. he could then move his LSB to capture my castle pawn at g6 and later h7. so he could destroy my castle. ",
        "25... Qe7": "only option is to move to safety. but i did a big blunder. can you see it? \n\nif he move his pawn it would threaten my queen also it would threaten my rook at a8. double attack he could do. so my choice of square to move to safety was so poor. a big blunder.",
        "26. Bf4": "he moved his DSB to safety. also he didnt see my blunder. ",
        "26... Qf6": "just thought to give additional support to my most advanced pawn. ",
        "27. Be3": "he moved his DSB to e3 with a purpose. a good move. can u see it?",
        "27... Nd7": "only now i could develop my knight",
        "28. d6": "a dicovered attack.",
        "28... b4": "only now i see the discovered attack. poor me. i understood i cant save it. so i gave additional support to my most advanced pawn.",
        "29. Bxa8": "he exchanged his bishop for my rook.",
        "29... Rxa8 30. h4 Rc8": "giving more support to my most advanced pawn.",
        "31. Bg5": "he threatened my queen",
        "31... Qf3": "i moved my queen to saftey also supporting my pawn.",
        "32. Re3 Qg4 33. Rde1 Qh3 34. Qe4 c2 35. Rd3 c1=Q 36. Rxc1 Rxc1+ 37. Bxc1 Nf6 38. Qg2 Qf5 39. Qf3 Qe6 40. Qe3 Qh3 41. Rd4 Ng4 42. Rxg4 Qxg4": "managed to bring his material advantage just to a bishop difference. ",
        "43. Qd2": "he gave support to his most advanced pawn.",
        "43... a5": "a big blunder. i should have tried to block his pawn from advancing. so i lost the game.\n",
        "44. d7": ""
    },
    "url": "https://gameknot.com/annotation.pl/a-strong-central-control?gm=60131",
    "gameName": "a strong central control",
    "players": "simonv45 (1606) vs. rock-onn (1505)",
    "opening": "Old Benoni defence (A43)"
}