{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Bc4 Bc5 4. b4 Bxb4 5. c3 Ba5 6. d4": "all book moves for the Evans - Black accepts, White drives the bishop back and then stakes a claim to the centre\n",
        "6... exd4": "from what I've seen, Black is safer when he doesn't take the pawn here. White isn't worried about his pawns, and will continue with rapid development in the hopes of getting a quick and strong attack on Black's position\n",
        "7. O-O": "usual...\n",
        "7... Bxc3": "?! Not so usual - Black usually takes with the pawn. It is good news for White though - checking the Database, White gets more wins out of this position\n",
        "8. Nxc3": "obviously forced, else Black wins the rook on a1\n",
        "8... dxc3 9. Qb3": "immediately applying pressure on the f7 square\n",
        "9... Qe7": "Black chooses to defend with the queen. If he chose to defend with Qf6, I would have played 10.Bg5 Qg6 11.Rfe1 followed by 12.e5\n",
        "10. Ba3": "In this line, however, Bg5 doesn't seem to get far after f6 (though perhaps it creates a weakness that White can exploit) so White places the bishop on an equally aggressive diagonal to harass Black\n",
        "10... d6": "This move seems natural enough... but there's a catch; Black likes to play, in the Evans Gambit, Na5, that helps to relieve some of the pressure on the f7 square. However, now Na5 can be met with Qa4+, forcing the knight to retreat back to c6 [well, ok, the queen isn't targeting f7 anymore, but he could pressure it again later on if he wishes to] Another option for Black here would have been Qf3\n",
        "11. Rfe1": "giving support to the e-pawn - perhaps a pawn push may be in order...\n",
        "11... Qf6": "wait, NOW he plays Qf3? actually, there is a good reason behind this - a pawn push to e5 could create all sorts of problems for Black - for one, d6 would be pinned to the queen, so it can't be taken. Secondly, White would threaten exd6, which attacks the pinned queen. This move seems to solve that problem - the queen moves out of a dangerous pin, keeps f7 covered and inhibits a pawn push to e5 (three defenders vs two attackers). However...\n",
        "12. e5": "at first glance, this looks like a mistake - Hasn't White just given up his pawn? As I mentioned earlier, Black has more defence on the e5 square than White has attacking the e5 square\n",
        "12... dxe5": "Black doesn't see any problens with taking it...\n",
        "13. Nxe5": "What?! White gives up a pawn, and now he gives up a whole piece? True, the knight will be pinned but White will need more than one move to exploit that [f4 straight away, and White has just given away another pawn], by which time the pin can be broken with Ne7 or Be6...so what is White up to?\n",
        "13... Nxe5": "now Black is six points up! [I wondered - very briefly - whether Black could get away with 13...Qxe5 14.Rxe5+ Nxe5 15.Qxc3 Nxc3 16.Qxc4... but in this line, White is a lot better in terms of space and development, despite being a pawn down...] If he had seen what would have unfolded after this, he may have considered Ne7 or Be6, which would have saved Black from the pressure that follows...\n",
        "14. Bxf7+": "surprise! :) The f7 square wasn't as strong as Black had hoped!\n",
        "14... Kd8": "The bishop was immune to both the knight (who was pinned) and the queen (14...Qxf7 15.Rxe5+ [and the king is forced away from the protection of the queen - the best way to cut the losses is;] ...Qe7 16.Bxe7 Nxe7 17.Qxc3 [and White is up two points]) Therefore, Black has to move his king. 14...Kd7?? 15.Qd5+! Qd6 16.Bxd6 cxd6 17.Rxe5 puts White with a piece up and a winning position (the passed c3 pawn can be rounded up easily) In view of all that, this move was forced\n",
        "15. Rad1+": "Bringing in my last piece with tempo\n",
        "15... Bd7": "forced once again (Nd7?? Re8#) It seems that Black has slowed White's attack - the only way that White can continue the attack now is Rxd7 [not true, actually.. I'll explain next post], and White wouldn't want to try that, being so far back in material, surely? He would have to be crazy to do so!\n",
        "16. Rxd7+": "'well, it's a good thing I AM crazy or else this probably wouldn't work!' [Actually, there was a much more surer way in this position to secure an advantage in this position..16.Qxb7! Rc8 17.Rxb7 Kxb7 18.Qd5+ Qd6 19.Be6+ - White gets his material back, as well as ENORMOUS pressure on Black! The only thing White would have to watch out for is the passed pawn on c3, but still he'd definitely have the upper hand]\n",
        "16... Kxd7": "Besides, I couldn't resist this sac, and still saw that I could really pressure Black here!\n",
        "17. Qd5+ Kc8": "Forced [I looked through lines involving Qd6, but after Be6+ I still saw tremendous attacking opportunities]\n",
        "18. Be6+": "okay, I'll be honest... when I played this move, I somehow saw that Kb8 would fall to Qd8# [missing the queen on f6] and that Black would be forced to play Qxe6... but still, I thought White had good chances...\n",
        "18... Kb8 19. Rxe5": "...so I pressed on with my attack. Although White is four material points down, he has all his active pieces in very aggressive positions (the dark-square bishop being a sniper) whereas Black has only a queen, and the rook on a1 doesn't seem to be going anywhere soon!\n",
        "19... Ne7": "I was counting on this move (and it seems that it's best - with the tempo attack on the queen, Black gets time to consolidate his forces and drive White out) and had planned Bxe7... which may be sound, I thought at first... but there's a problem -20. Bxe7 Qxe7 21.Bf5 [forced to stop c2], but then Black has Qd6!, and because of the threat of a back row mate, a queen trade is forced and White is out of attacking options... and moving the queen away may allow Black time to consolidate his forces... so how to do this? \n",
        "20. Bg8": "!! (for style, at least :P) Black's back rank has serious issues right now, and neither of Black's en prise pieces can be taken - Nxd5, Re8 and mate next move - same goes for Nxg8. Rxg8 simply loses material after Qxg8, and the queen is still immune because of the back row problem, then ...Nc8, Re8 turns up the pressure on Black. I think Black might actually get away with 20...Qxe5 21.Qxe5 Rxg8 Qxe7... which makes it even in material (though not for long - the c3 pawn gets rounded up easily enough) though does it hold any advantages for Black? I don't know... I'll leave it to the reader to decide on that :) (this move also traps the other rook and takes it out of the acrtion)\n",
        "20... Qb6": "at any rate, I figured that Black had found a surprise reserve in his position - White faces mate on the next move, and White doesn't have a forced mate in his position, so he has to deal with that threat - but first...\n",
        "21. Qd8+": "I want to get this in before Black does anything to stop it\n",
        "21... Nc8 22. g3": "to stop the back row mate threat... and right now, White threatens a mate of his own... but Black does have a good move that can stop that...\n",
        "22... c2": "?? Not this move though - White now has a forced mate in 8 [I've made a puzzle on that one actually - you can check my profile page on that :)] and after White's next move, Black resigns. 22...c5 would have been the move to keep Black in the game (but not 22...c6?? 23.Bd6+ Qc7 24.Bxc7#) but White can still attack with 23. Qf8 c2 24.Re8 [I wouldn't be interested in the pawn on c5 - I'm on the attack!] and Black has two options 1) Qc7, at which White would play Bc1, followed by Bf4 and 2) Kc7, and I'm not sure if there's a good attack after that... maybe it would turn out to be a draw...\n",
        "23. Re8": "but at any rate, White has a forced mate and Black resigns - a highly enjoyable game for me :)\n"
    },
    "url": "https://gameknot.com/annotation.pl/a-successful-evans-gambit?gm=31323",
    "gameName": "A successful Evans Gambit",
    "players": "x-machine (1520) vs. bodejax (1636)",
    "opening": "Evans gambit (C52), compromised defence"
}