{
    "moves": {
        "1. e4": "My stock opening move, I always strive to dominate the centre at every opportunity in the opening phases of any game.. ",
        "1... h6": "Hmmm, an unusual reply, this actually serves it's purpose and knocks me off balance as you will see as the game progresses....",
        "2. d4": "I grab the centre with both hands!",
        "2... a6": "Hmmm, Now I really feel slightly perturbed, I'm guessing this is a tried and tested opening which my opponent is used to playing and has had results with, else why?",
        "3. Be3": "Supporting and developing...",
        "3... b6": "I sense a pincer movement developing..",
        "4. c3": "Opening up space for my queen along the d1 a4 diagonal, I often use this route as a means to develop my Queen...",
        "4... g6": "...",
        "5. Nd2": "More development...",
        "5... Bb7 6. Qc2 Bg7": "Can you sense a pattern emerging? ",
        "7. Ngf3": "I think I am beginning to realize what I am in for should I castle so I decide to put off making that choice for now and keep my opponent guessing for a few more moves..",
        "7... e6": "Is my opponent about to strike out with d5?",
        "8. Be2 Qe7": "..No",
        "9. O-O": "I decide to plump for 0-0 I just went with my gut in the end, it wasn't based on any strategic calculation, either way I was sure I knew what was coming and just hoped I could keep juggling enough to weather the storm...",
        "9... g5": "Here we go, the pawns begin a slow march toward my king and all I can do is prepare the best I can...",
        "10. Nc4": "Aiming to free up my Bishop on e2...",
        "10... d6 11. Nfd2": "....",
        "11... h5": "Nice reply...",
        "12. f3": "I decide to weaken my last line of defence in favour of giving my king a little breathing room...",
        "12... Bh6 13. h3": "Anticipating the inevitable .. g4..",
        "13... Nd7": "Bringing his final pieces into play allows me a little time...",
        "14. a4": "...to play this move..",
        "14... g4": "here we go...",
        "15. fxg4": "Taking with the h-pawn was not an option.",
        "15... hxg4 16. Bxg4": "....",
        "16... Ngf6 17. Be2": "I wanted to keep the f-file open for my rook, I knew I would have some defending to do here but I also saw some opportunities to attack should I be given time to do so..",
        "17... d5": "Now he begins to open up the centre and apply pressure along the a8 h1 diagonal!",
        "18. Bxh6": "I decide to get some pieces off the board and simplify the game as much as I can, if I adopt a passive stance I don't see me lasting long...",
        "18... Rxh6 19. e5 dxc4 20. exf6 Nxf6 21. Bxc4": "I took stock here and found myself a pawn up but also facing lethal threats and a real test of my defensive play was coming up...",
        "21... Ng4": "A nice sac should I decide to accept. ",
        "22. Rae1": "I really didn't fancy hxg4 Qh4! at all so I played this, shutting the door on the neat fork Ne3..",
        "22... Qh4": "He plays it anyway, I really am on the ropes here I can't allow Qg3, this is def com 5!",
        "23. Qd3": "Defending the terminal threat for now..",
        "23... O-O-O": "I understand that swinging his remaining Rook into play could certainly prove to be the killing blow, but...",
        "24. Bxa6": "It also allows this! Now I can relieve a little pressure by disposing of the strong Bishop..",
        "24... Bxa6": "Not sure if this would have been my reply but I'm happy enough...",
        "25. Qxa6+": "Buying a precious tempo!",
        "25... Kb8 26. Nf3": "Attacking the Queen and also defending h2...",
        "26... Qg3 27. a5": "Instantly aiming to open up the black kings defences and maybe create threats of my own, I can't let my opponent gain control again!",
        "27... e5 28. axb6": "This move took me some time to play, I really did think about many options at this point...",
        "28... Rxb6": "I pretty much expected this response, But it drew the castle away from my king and this was the idea, I really was beginning to think I could turn this one around at this point..",
        "29. Qa3": "Maybe Qc4 was better but I didn't want to allow Rxb2....",
        "29... exd4 30. Rea1": "Now I start to turn the screw the other way!",
        "30... Kc8 31. hxg4": "That Knight had remained on that square for far to long and was punished for out staying his welcome...",
        "31... Qxg4 32. Ne5": "A really nice move I thought, Attacking the Queen, attacking f7 and also blocking the kings escape route on d7!",
        "32... Qg7 33. Qc5": "I couldn't decide between this or Rxf7, in retrospect the latter is probably the better move but I didn't want to make the same mistake my opponent had made and overstretch my resources, although this probably wouldn't have been the case given my material advantage....",
        "33... Rg8": "Threatening mate!",
        "34. Qd5": "Happy to trade 2 for 1..",
        "34... f6": "At this point I had seen a mating sequence and played it through the conditional moves screen, I tend to do this as then I don't forget what I am going to play next when I come back  2 days later!",
        "35. Ra8+": "The trigger is pulled and black is teetering on the brink of defeat after failing to execute his own attempt at a winning attack...",
        "35... Rb8": "The only move available....",
        "36. Qe6+": "Black resigns in anticipation of ... Kb7. 38 Qa6# or ... Kd8. 37 Rxb8# The queen sac only prolongs it. I enjoyed this game very much, both players had a chance to attack and I'm not sure if it was overall  a better attack or better defence that won this game?\n\n"
    },
    "url": "https://gameknot.com/annotation.pl/a-swift-reposte-team-gk-team-match-i-c-ds?gm=30270",
    "gameName": "A swift reposte. Team GK Team Match I.C.D's",
    "players": "daveyr18 (1589) vs. grimmsbrother (1485)",
    "opening": "Carr's defence (B00)"
}