{
    "moves": {
        "1. d4": "Hi everyone!  Just when you thought you had forgotten all about me and thought you had all escaped Old Matey's clutches ...... Well, here I'm back!  I have just completed Elyhim/Terrence's Modern Benoni MT and at least I managed to complete it with a win and come 6th.  For a long time I did not look like winning, but at the last moment there was a twist to the tale.  So, how did this all happen?  Well, read on ........",
        "1... Nf6": "1. ..... Nf6 - the first two moves of the thematic tournament.",
        "2. c4 e6 3. Nc3 c5 4. d5 exd5 5. cxd5": "5. c x d5 - pawn trade.",
        "5... d6 6. Nf3 g6 7. e4 Bg7": "7. ...... Bg7 - Putting pressure on the a1-h8 diagonal.",
        "8. h3": "8. h3 - hardly threatening mate here!",
        "8... O-O": "8. ..... 0-0 - and indeed, yet again King Bwaa looks as safe as houses.",
        "9. Bd3 a6 10. a4": "10. a4 - trying to discourage b5.",
        "10... Re8 11. O-O": "11. 0-0 - Henry wisely removes himself from the e column.  Incidentally, as before, my opponent's Christian name is Henry, but because he shares the same name as my king, he will be known as Bwaa throughout the game.",
        "11... Nbd7 12. Bf4": "12. Bf4 - Fou Lenoir eyes up the pawn on d6.",
        "12... Qe7": "12. ..... Qe7 - and the Wicked Witch of the West defends it.",
        "13. Re1": "13. Re1 - defends the e4 pawn and shares the same file as the Witch.  As for Glenda, at the moment she looks as though she couldn't hurt a fly, could she?",
        "13... Nh5 14. Bh2": "14. Bh2 - at leas this move avoids Fou Lenoir being forcibly exchanged by Bwaa's knight.  He still exerts some pressure on the d6 pawn.",
        "14... Ne5 15. Be2": "15. Be2 - and I do not want Fou Leblanc traded off either!",
        "15... Nxf3+ 16. Bxf3": "16. Bxf3 - Knight trade - there is now another defender of the e4 pawn.",
        "16... Qg5 17. Bxh5 gxh5": "17. ..... gxh5 - Fou Leblanc does now trade himself off for a black steed.  However, he messes up Bwaa's kingside pawn structure.  With both queens on the board anything could happen.  Yet the Witch is far more aggressively placed than Glenda!",
        "18. Re3": "18. Re3 - I suppose I could have played Bxd6 here, but then Bwaa could have played BxN and then my queenside pawns could end up being shattered.  This rook move does have some ideas of moving to g3 however.",
        "18... Qh6 19. Qf3 Bd4 20. Qg3+ Kh8 21. Rd3": "21. Rd3 - only move to evade the Spanish Inquisition from Bwaa's dsb and to prevent that B for N trade I mentioned in my previous note.",
        "21... Be5 22. Qf3": "22. Qf3 - now Glenda must take evasive action.",
        "22... Qg6 23. Bxe5+ Rxe5": "23. ...... Rxe5 - bishop trade.",
        "24. Kh1 Bd7 25. Re3 Rae8 26. Rae1": "26. Rae1 - protecting my vulnerable e4 pawn.",
        "26... b5 27. axb5 axb5 28. Nb1 f5": "28. ....... f5 - this move triggers off a plethora of exchanges.",
        "29. exf5 Bxf5 30. Re3xe5 Rxe5 31. Rxe5 dxe5 32. d6": "32. d6?! - it looks as though I am hanging my knight out to dry, doesn't it?  However, if BxN?? then Glenda gives check on f8.  The Witch is forced to retreat and block the check.  Glenda then gives her life for the Witch and then my passer moves serenely to d7 and King Bwaa is too far away to prevent Henry and Glenda from having a tearful reunion.  If QxP then Glenda turns Bwaa's lsb into dust!",
        "32... Kg7 33. Qb7+": "33. Qb7+ - Glenda tries to be a nuisance but it looks as though King Bwaa can get to safety on h6 sigh and double sigh.  However, he moves his king somewhere else!",
        "33... Kf6": "33. ..... Kf6?? - Yup.  This move looks OK but unfortunately for King Bwaa, it allows Glenda to deliver a Swallow's Tail ..........",
        "34. Qe7#": "34. Qe7#  ......... MATE!!"
    },
    "url": "https://gameknot.com/annotation.pl/a-swallows-tale?gm=55202",
    "gameName": "A Swallow's Tale",
    "players": "jstevens1 (1829) vs. bwaa (1761)",
    "opening": "Nimzo-Indian defence (E20)"
}