{
    "moves": {
        "1. e4": "A 5:00 blitz game in which I found an opponent well-matched to my own (modest) abilities. It seemed a pretty even battle most of the way, including almost exactly equal clocks throughout. I have the black pieces.",
        "1... e5 2. Nf3 Nc6 3. d3": "I'm not used to seeing this.  Wondering if my opponent's relatively low rating was deceptive or not.",
        "3... g6": "With the time white provided me, I decided to tuck the king away.",
        "4. c3 Bg7 5. Bd2 Nf6 6. Be2 O-O 7. O-O": "But my opponent played all these moves quickly, looking as if he were playing a line quite familiar to him, and I started wondering if I would be getting in trouble soon.",
        "7... d6 8. Qc1": "He prepares to rob me of my defensive fianchetto bishop.  Not seeing an easy way of stopping this, I decided to let it happen.",
        "8... b6": "Made in a bit of haste, without much of a plan.",
        "9. Bh6": "There it is.",
        "9... Bxh6": "A mistake by me, giving him tempo.  Why not develop somewhere else and let him take, recapture with the king, and prevent the white queen's coming infiltration on h6?  Vagaries of speed chess.",
        "10. Qxh6": "Now Ng6 looks nasty, although that square is defended and it would take him a while to kick my Knight off f6.  Still, I didn't like the look of it.",
        "10... Ng4": "Kicks the queen, defends g6 with my queen, but this is easily dealt with.",
        "11. Qd2 Kg7": "Now I get the idea of using the king to the queen out of h6.",
        "12. h3": "I considered my favorite sac: h5 in response to this, opening a file for my rook.  But it looked like it would take quite a while for me to get my queen to that side of the board, and my opponent seemed to be playing a solid game and would punish me for such reckless play.",
        "12... Nf6": "So back I went.",
        "13. Qg5": "Not sure what this is doing here, but I started feeling that I wasn't very well defended.",
        "13... Be6": "Was the fianchetto better?",
        "14. Nh4": "I didn't know where white is going with this.  Nowhere, it turns out.",
        "14... h6": "Probably not best, weakening my king.",
        "15. Qd2 Rh8": "I felt the need to bolster the h6 pawn.",
        "16. Nf3": "The knight goes back where it came from, and white is rather tangled. I had been considering d5, but I think this would have opened things up in a way that benefited white more than me.",
        "16... Qd7": "Considering sacking the bishop for two pawns and opening the king.",
        "17. Kh2": "White puts the kabosh on that idea.",
        "17... Nh5": "I'm short on ideas, and want to maintain time parity in such a close game with so many pieces on the board, so I tried this, aiming at f4.",
        "18. Nh4": "Back goes the knight again.  White has given me some valuable tempi, and I should have been able to accomplish more.  As it is, my development seems only marginally better.  These past few moves have gone rather slowly for both of us.",
        "18... Nf4 19. g4": "Looks bad to me.  g3 was no better, as it gave me the h pawn with an attack on the f1 rook, so 20. gxN Bxf1 21. Bxf1 leaves material equal but the white King rather exposed.",
        "19... d5": "Without other ideas, I decided this was a good try.",
        "20. Rg1": "Aims at my King, but is this going to open any time soon?",
        "20... dxe4 21. Na3": "White needs development, but this move looks wasted.  Now his queen is hanging and he can't recapture on e4.  But I couldn't see a way of taking advantage of the hanging queen, so after quite a bit of thought I decided on the following combination:",
        "21... Nxe2 22. Qxe2 exd3 23. Qe3": "Now I want to protect my pawn before he pins my queen to it with a rook.  e5-e6 would be nice, so I tried to prepare that.",
        "23... Bd5": "Blunder--hangs my d pawn.  I believe Qd5 was needed here instead.",
        "24. Rad1": "But he missed it, so I was able to connect the pawns.",
        "24... e4 25. f3 Rae8": "Naturally",
        "26. f4": "Looks bad, but by this point white is probably busted anyway.",
        "26... a6": "Further tying up the white position, but I probably should have taken the hanging a-pawn.  I was very low on time at this point.",
        "27. Nc2": "Blunder--we're both practically out of time.",
        "27... Na5": "Following up white's blunder with one of my own, I missed the hanging Knight.",
        "28. b3 c5": "Hanging Knight!?",
        "29. Ne1": "Oh well.",
        "29... Nxb3": "A decent way to trade in some of my material advantage, gaining tempo and another passer.",
        "30. axb3 Bxb3 31. Rd2 a5": "Push that passer.",
        "32. Neg2": "White is completely hamstrung, and his heavy pieces are committed to blockading my central pawns.",
        "32... a4 33. Ra1 Rea8": "Hangs my e pawn, but we had only seconds left.",
        "34. Rb2": "prevents an immediate a3",
        "34... Rhe8": "I notice my hanging pawn.",
        "35. g5": "A try at counterplay.",
        "35... h5": "Shutting the king side down.",
        "36. f5 Qd6+ 37. Kh1 c4 38. f6+ Kg8 39. Nf4 a3 40. Rd2 Bc2 41. Nhg2 a2 42. Qe1 Ra3": "To be followed by Rea8, Ra3b3, Rb1, and all is over.  White went down on time here; I had about 8 seconds left.  Thanks for reading!"
    },
    "url": "https://gameknot.com/annotation.pl/a-tight-fight?gm=51559",
    "gameName": "A tight fight",
    "players": "Well-matched opponent  vs. benrous1 ",
    "opening": "King's pawn game (C44)"
}