{
    "moves": {
        "1. d4": "This game is a very clear demonstration of why the loss of a king's fianchettoed bishop can have such a weakening effect, and it also demonstrates the power of a very sudden change in direction of attack.",
        "1... d5 2. c4 c6": "Slav defense to the Queen's gambit. With the gambit 2. c4 white attempts to remove the defending pawn at d5 by temping it with the gambit, in order to make way for the white e-file pawn's advancement that will secure the centre. With 2...c6, black prevents this, and keeps open the option of readily developing the white-squared bishop on the c8-h3 diagonal.",
        "3. Nf3 Nf6 4. Nc3 g6": "Schlechter variation of this opening. The fianchettoed bishop in front of black's king in this variant has less effect than in some other openings, because white can often establish a strong line of pawns on the g1-a7 diagonal, which partially restricts the squares it could control. Black must endeavor to undermine the central white pawns.",
        "5. Bf4 Bg7 6. e3": "Black can double white's pawns here by attacking the newly-developed bishop with the king-side knight and pawns, but it carries the risk of weakening the pawns in front of the black king, so black castles instead...",
        "6... O-O 7. h3": "This move defends the f3 knight from being pinned by ...Bg4 and restricts movement of the black knight at f6, and also allows the retreat of white's black-squared bishop to h2, should it be attacked (by, say, Nh5). Playing white, I wanted to preserve this bishop as it has a nice row of  pawns from f2 to d4 to slide along later in the game. However, the move 7. h3 is a bit slow and it risks a later bishop sacrifice (...Bxh3) attack from black.",
        "7... Bf5 8. Bd3": "more common is 8. Qb3 - probably a sharper response to 7...Bf5",
        "8... Bxd3": "black feels compelled to take here because to move the Bishop backwards again would be a loss of tempo and there is no good alternative spot for the bishop anyway - it would restrict the movement of other pieces at e6 or d7.",
        "9. Qxd3 Nh5": "Black is obviously niggled by the forward and aggressive looking bishop at f4, so tries to shift it.",
        "10. Bh2": "The bishop retreats to a sneaky spot, leaving the knight in a very blocked location, but it does give the fianchettoed bishop at g7 the diagonal it likes to patrol.",
        "10... e6 11. c5": "With 11. c5, white's black-squared bishop has plenty of backed-up movement for later in the game...",
        "11... b6": "Black tries to spoil this",
        "12. b4 b5 13. O-O a5": "now begins a tactical early mid-game where black spots an opening and goes for it down the a-file",
        "14. a3 Na6 15. Qd2": "by 15. Qd2, white prevents his queen from being attacked by the knight after the pawn exchange and simultaneously defends the b4 pawn in a manner that might allow white to gain a strong passed-pawn in a few moves time...",
        "15... axb4": "black has (temporary) power of the b4 square, so takes the pawn...",
        "16. axb4 Nxb4 17. Nxb5": "White completes the exchange of pawns, and by doing it this way, white allows the possibility of gaining a strong passed pawn at c5, because if black now allows the knights to be exchanged by 17...cxb5 18. Qxb4, black will have trouble defending his isolated pawn at b5, and at the same time have to contend with the forward and defended passed white pawn at c5.",
        "17... Na6": "so he goes back instead...",
        "18. Nd6": "....giving white the tempo to move the knight to a very aggressive outpost (backed up by the handy bishop at h2)",
        "18... Nf6": "Black's out-of-the-way knight has a long journey back to try to shift white's proud d6 knight...",
        "19. Rfc1": "Here, white prepares to defend a later advance of a pawn down the c file, because the black pawn blocking the c file at c6 is \"backward\" and could be a point of weakness for black.",
        "19... Ne8 20. Nb7": "White chooses to move the forward knight rather than allow the exchange, because it leaves the black pieces a bit cluttered and restricted on the back rank.",
        "20... Qd7 21. Rab1 Nec7 22. Ne5": "It takes a couple of moves for black to reorganise, and white begins to advance and put pressure on the backward c5 pawn, and hassle the queen (no one likes their queen to be forced to move). White might play Rb6, later, making c6 increasingly hard to defend...",
        "22... Bxe5": "so black takes the bait ....the fishing worked. Feeling too much pressure mounting at c6, black exchanges out a crucial defender - his fianchettoed bishop. Here is an extremely relevant quote from wikipedia!...\n\n\"One of the major benefits of the fianchetto is that it often allows the fianchettoed bishop to become more active. Because the bishop is placed on a long diagonal (either h1-a8 or a1-h8), it controls a lot of squares and can become a powerful offensive weapon. However, a fianchettoed position also presents some opportunities for the opposing player: if the fianchettoed bishop can be exchanged, the squares the bishop was formerly protecting will become weak and can form the basis of an attack (particularly if the fianchetto was performed on the king-side). Therefore, exchanging the fianchettoed bishop should not be done lightly, especially if the enemy bishop of the same colour is still on the board.\"\n\nno kidding...",
        "23. Bxe5 Nb5": "black advances his knights, which are bound to be powerful together in the a to c files, and at the same time reveals an attack on the white knight.",
        "24. Nd6 Nac7 25. Nxb5 Nxb5": "the exchanges continue, and black is satisfied that his knight has an outpost",
        "26. Bf6": "26. Bf6  Ouch. The white bishop is now a deadly superpower and is going to be hard to shift, even though it is undefended. Black might have prevented this by an earlier ...f6, or better still, not exchanging out the black-squared bishop.",
        "26... Na3": "26...Na3? Black continues tactically down the a-file, oblivious to what is about to happen...",
        "27. e4": "27. e4! Game over.\nIgnoring the plight of a number of white's pieces, this small pawn push opens up the board for a very rapid assault by the white queen (Qh6 and Qh7#) (As far as I can see, white can force checkmate from now...I'd be interested to know if anyone can find an escape for black's king?). Interestingly, if black still had a knight at b5, then this position would be partially defendable, by playing 27...Nc7 then 28...Ne8. However, black would lose his queen in its current position, because after 27...Nc7, the pin 28. Rb7 (with the aim to take the knight) wins the black queen, because black must again urgently move the knight to e8 the very next move to avoid instant checkmate.",
        "27... Qd8": "Black desperately tempts white to a feast of his queen, to remove the white bishop, which appears to have infinite value, now that the knight at a3 is too far away to defend.",
        "28. e5": "...but the offer is correctly ignored",
        "28... Qxf6": "The forward white bishop is clearly more powerful than black's queen, so black desperately tries to remove the threat",
        "29. exf6": "Now the pawn takes the place of the bishop, and black's position is not improved. Here is a very interesting variant sequence that I think would allow black to play on for as long as possible from the current position, but it still gives white a lovely forced checkmate!\n\n29...Kh8 30. Qh6 Rg8 31. Rb7 Raf8 32. Ra1 Nb5 33. Ra8! (taking advantage of the fact that black cannot afford to move his rooks at all, because if 33...Rxa8, then 34. Rxf7... 35. Rxh7#). All moves from now result in obvious checkmates for white.\n\nCan you find a longer surviving sequence for black?",
        "29... g5": "black resigns. 1-0. \nIn our other game, bigjim systematically wiped me off the board, so I was lucky to find 27. e4! in this game to leave it at 1-1.\n\nFinally, it is interesting to think that if this game was played over the board, I would have had to take care to prevent my eyes from being seen by my opponent while I was looking at the black king's side of the board before these moves!",
        "30. Qxg5+": ""
    },
    "url": "https://gameknot.com/annotation.pl/a-tiny-little-move?gm=7947",
    "gameName": "a TINY LITTLE move",
    "players": "igd13 (1653) vs. bigjim (1758)",
    "opening": "QGD Slav (D15), Schlechter variation"
}