{
    "moves": {
        "1. e4": "As always, don't hesitate to contact me if you spot any logical or orthographic errors.",
        "1... c5 2. c4": "White's choice is a tad unusual, but sound. It's called the Gloria variation.\nNormally, White plays 2. Nf3 or 2. Nc3 to remain flexible, but this works too.",
        "2... Nc6": "Black already aims to control the outpost on d4 for his Knight.\nVariations like this (with Stonewall formations normally) rely heavily on the weak points in the center for Knights to occupy. Often those points are on d4 and d5.",
        "3. d3": "White has decided not to challenge the center right away, and leave Black to continue aiming pieces at the hole on d4. Maybe White should have played Nf3 first to threaten d4 and make an active threat to the center, but that could just be a matter of personal preference. This way White opts for a quieter positional game.",
        "3... g6": "Black intends to put his Bishop on g2, where it can control d4 from a distance.",
        "4. Nc3": "White is playing thematically here, by controlling d5. If Black ever moves his e-pawn so that it can't boot the Knight off of d5 (if it moved there), then he could have serious problems.",
        "4... Nf6": "Black prefers to defend d5 rather than add more force to d4.",
        "5. Be2": "This move feels out of place to me for six reasons:\n1. It doesn't control either d4 or d5, or stop one of Black's pieces from controlling d4 or d5. It doesn't play to what the board demands here. The idea behind this kind of position is to play with Knights and to get them on to key support points, and this does nothing to further than plan.\n2. It doesn't control anything new. The Queen already controlled all of the squares the Bishop is attacking. It's even worse that there's nothing to be gained by reinforcing that diagonal.\n3. It blocks the Queen.\n4. It would be better on g2 where it would add support to d5.\n5. It breaks the basic rule (that is very important right now) to develop Knights before Bishops.\n6. It wastes a perfectly good tempo that could be used to do something productive.",
        "5... Bg7": "Controlling d4 through the Knight.",
        "6. Be3": "Finally, White contests Black's grip on d4.",
        "6... Nd4 7. Nf3": "White seems to have the idea now. He's applying all the pressure he can to d4.",
        "7... Ng4": "Black decides that d5 is now of secondary importance, and that it would be better to get that Bishop off of e3, and adds support to the Knight via the Bishop on g7.",
        "8. O-O": "This leaves Black with an interesting choice: Does he keep building pressure in the center or does he trade it all off?\nBlack decides that it looks better to leave White with a huge pawn island in the center that will provide lots of targets.",
        "8... Nxe3 9. fxe3 Nxe2+ 10. Qxe2 Bxc3 11. bxc3": "There's the island. Now we can see that the pawns on c3 and e3 are going to be weak, and that the Knight will be much worse than the Bishop in two or three moves. If Black can rally attacks around those target points, then he should be able to win at least a pawn.",
        "11... d6": "Black unblocks his poor Bishop.",
        "12. d4": "Here Black has two options:\nA. He can leave the pawn and allow White to open up the d-file to place his Rooks there before Black is done developing.\nOR\nB. He can capture the pawn and fix one of White's weaknesses and then exploit the other.",
        "12... cxd4": "Black chooses to fix and exploit.",
        "13. exd4": "I think it would have been better for White to take with the pawn on c3 because the pawn on e3 is harder for Black to get at. It only takes one move for the Black Queen to attack c3, and she attacks a2 at the same time.",
        "13... Bg4": "Black makes the White Knight useless.",
        "14. Qf2": "White immediately breaks the pin.",
        "14... Bxf3": "Now that the pin is broken, Black figures that his game will be easier if he trades pieces.",
        "15. Qxf3": "Black must defend f7 or lose the pawn and allow White to invade, so he castles.",
        "15... O-O": "This protects the King and the pawn, and allows the Rook flexibility to join the fray as is pleases. Black's main idea now is to attack the doubled pawns on the c-file and then dominate the c-file.",
        "16. Rab1": "White puts his Rook on a good square. It attacks Black's pawn on b7 and therefore develops with tempo. It also allows the Rook some flexibility to defend the pawn on c4.",
        "16... b6": "Unfortunately, Black has to block his Queen's access to a5, which makes her a very depressed piece there on the back rank.",
        "17. Qg3": "This move feels a little pointless to me, except that it clears the way for Rf4 and then Rh4, which are a major part of White's attacking idea. ",
        "17... Rc8": "Black's attack begins.",
        "18. Rb4": "White defends his pawn valiantly.",
        "18... a5": "Black wants to chase the Rook to a4, where his Queen can attack it with tempo.",
        "19. Rb5": "White decides to leave the pawn. He also gets access to a very nice looking rank. So he hasn't given up the pawn without compensation. ",
        "19... Qc7": "Black decides to add some more pressure, since he has time.",
        "20. Rf4": "Now a trap has appeared. If 20. ...Qxc4 21. Rxb6 e5! 22. dxe5 Qc5 !",
        "20... Qxc4 21. Rh5": "White sees the trap and clears that diagonal. Black must now be a little careful. White has a powerful attack brewing, so before Black can continue his attack he must be sure that he is safe.",
        "21... Kh8": "I think that 21. ...Qxc3 was better because it basically ruins White's whole attack.",
        "22. Rh6 Qxc3 23. Qh4": "This couldn't have happened with the Rook still on h5 (thus Black should not have moved the King, but rather he should have taken the pawn first). Luckily, Black has a tactical idea that wins (and even if it didn't, it would allow him to defend).",
        "23... Qxd4+ 24. Kf1": "If 24. Kh1 Rc1 .",
        "24... Rc1+": "Black is very lucky that this tactic arrived on the scene, because without it he would have had to defend against the attack on the h-file.",
        "25. Ke2": "White's lack of defense is becoming readily apparent. That's his only move.",
        "25... Qb2+": "Now if 26. Kd3 Rc3  27. Kd4 Qb4  28. Kd5 Rc5# or 26. Ke3 Rc3  27. Kd4 Qb4  28. Kd5 Rc5#",
        "26. Kf3": "Again, this is White's only move (his other two options lose by force).",
        "26... Rc3+": "Forcing White to take his only option again!",
        "27. Kg4": "White's King has finally found some comrades to defend him.",
        "27... Qxg2+": "Black delivers the crushing blow.\nThe only way White can defend is to sacrifice his Queen, and so he resigned.\nThis was an exciting game all the way through. Even though it started very closed and positional, the end of the game was completely driven by tactics.\nWhite had a major attack, and Black's win ended up coming from a freak tactical sequence. This was a beautiful ending.\n0-1"
    },
    "url": "https://gameknot.com/annotation.pl/a-tourny-to-annotate?gm=15548",
    "gameName": "A Tourny To Annotate!",
    "players": "brightnight (1264) vs. tigerzrul88 (1485)",
    "opening": "Sicilian (B20), Gloria variation"
}