{
    "moves": {
        "1. e4": "This game comes from a mini-tournament that I created.\nThe positions that came out of the games between tag1153 and I were all very interesting, and I will be annotating both of our games.\nI hope to annotate games from this tournament that don't involve me, so watch for them!\n\nAnd as always, if you see any errors, in logic or in spelling, don't hesitate to contact me!",
        "1... c6 2. d4 d5": "The Caro-Kann defense.\n\n",
        "3. Nc3 dxe4 4. Nxe4 Bf5 5. Nc3": "Here White has played a small inaccuracy. The proper move is 5. Ng3, which attacks the Bishop and ensures that Black can't powerfully establish his Bishop on f5 with e6. ",
        "5... e6": "Black's Bishops are now ready to criss-cross White's position with pins. White should seriously consider playing a3 to cut down Black's dark-squared Bishop's scope.",
        "6. Nf3 Bb4": "There's the first pin.",
        "7. Bd2 Nd7": "This Knight is surprisingly strong here. It's not going to lead any mating attacks right away, but it controls the center and allows Black to play ...c5 or ...e5 later. Coupled with a Knight on f6, Black has a strong grip on the center.",
        "8. Bc4": "A truly pathetic move for the Bishop. All this does is clear the way for White to castle. So far, Black is doing a good job of nurturing his advantage into something larger. Black is slowly placing a stranglehold on the center, and leaving White cramped. Black can play ...b5 whenever he wants, or even Nb6, which adds support to the future idea of blockading the d-pawn.",
        "8... Ngf6 9. a3": "White needs to gain space and get rid of the pin. If he waits around much longer, Black will start taking aim at his favorite targets and White will have to keep making less than satisfactory moves like Bc4.",
        "9... Bxc3": "I think it would have been better for Black to play 9. ...Ba5, and if 10. b4 Bb6. This way Black keeps tension in the center, and can continue to nurture his small advantage (at 9. a3 Fritz estimates Black's advantage as about 1/10 of a pawn but after ...Bxc3 at 0).",
        "10. Bxc3 O-O": "The tension is suddenly gone from the center. White can finally take a short breath.",
        "11. O-O c5": "There's the push to c5 that I was talking about earlier. However, now that the tension's out of the center, it feels kind of empty.",
        "12. h3": "All this does is protect against the pin on the Knight, but there are better ways of dealing with this once it arrives. Better was 12. dxc5.",
        "12... Ne4 13. Be1": "This is getting a bit out of hand. White is making odd moves all over the place. This on was just to hold on to his precious Bishop pair. Of course, there's no point in ruining your position to save an intangible advantage like that.",
        "13... a6 14. Nh4": "White just loses a piece after 14. ...Qxh4 15. f3 Ng3. The worst bit is that it seems to stem from his obsession with Bishops.",
        "14... Nd6": "Black misses it, maybe now White will get his act together.",
        "15. Ba2": "The Bishop fever seems to have White hopelessly trapped.",
        "15... Qxh4 16. dxc5 Bxc2": "Black finds a way to even up the score. However, after the Queen recaptures the Bishop, if White can reorganize his Bishops, he will be much better than Black.",
        "17. Qxc2 Nf5 18. b4": "White attempts to clear some space for his Bishops to roam.",
        "18... Nd4": "Black's Knight takes advantage of a great square in the White camp. If Black can play e5, this Knight could be detrimental. White will want to try and trade a Bishop for this Knight.",
        "19. Qd3": "White prepares the Bishop trade, unfortunately, he didn't see Black's idea of ...Ne5! making the Black Knights even better.",
        "19... Ne5 20. f3": "20. f4 is tempting but White will have lost the f-pawn after Bxh4.",
        "20... Qf4": "Black removes the tension from himself and places it firmly on White.",
        "21. Bd2": "In an attempt to return the pressure, White stumbled into losing a piece! From here, the game goes downhill fast, so I'll finish by saying that these positions were interesting, but the moral of the story is to not get Bishop obsessed, or to make stupid blunders.",
        "21... Nxd3 22. Bxf4 Nxf4 23. Rfd1 Nfe2+ 24. Kf2 Rfd8 25. Bc4 Nc3 26. Rd3 Ncb5 27. a4 Nc7 28. Rad1 Nc6 29. b5 axb5 30. axb5 Rxd3 31. Rxd3 Ne5 32. Rd7": "0-1"
    },
    "url": "https://gameknot.com/annotation.pl/a-tourny-to-annotate?gm=15470",
    "gameName": "A Tourny To Annotate!",
    "players": "tigerzrul88 (1459) vs. tag1153 (1467)",
    "opening": "Caro-Kann (B18), classical variation"
}