{
    "moves": {
        "1. d4 Nf6 2. c4 e5": "This is the Budapest Defence (or Budapest Gambit, as it is also known). It was discovered in 1916 by Szigmond Barasz, a strong Hungarian master, and gained (chess)world fame a few years later by featuring in two Black wins against Rubinstein, regarded as possibly the strongest tournament player in the world at the time.\n\nIn February 1924 Hans Kmoch, a famous theoretician and chess critic, wrote this obituary on the defence:\n\"A counterattack that surfaced a few years ago, and quickly faded away. The sacrifice of a pawn or piece for an advantageous position proved too much of a handicap for almost any player. Even for someone as gifted as Lasker, who should find such a method ideal, it unmasked itself as illogical, inopportune and unfavorable.\"\n\nSemmering, March 1926, Kmoch - Reti:\n1.d4 Nf6 2.c4 e5 3.dxe5 Ng4 4.e4 Nxe5 5.f4 Nec6 6.a3 a5 7.Be3 Na6 8.Nf3 \nBc5 9.Qd2 d6 10.Nc3 O-O 11.Bd3 Bxe3 12.Qxe3 Nc5 13.O-O Re8 14.Bc2 a4 15.\nRae1 f6 16.Qf2 Bg4 17.Nd4 Qd7 18.Nxc6 bxc6 19.f5 Bh5 20.Qh4 Bf7 21.Rf3 Re5\n22.Ree3 Bxc4 23.Rh3 h6 24.Reg3 Kf8 25.Rg6 Rae8 26.Rhg3 Qxf5 27.Rxf6+ Qxf6 \n28.Rf3 R8e6 29.Nxa4 Nxa4 30.Bxa4 Rxe4 31.Rxf6+ Rxf6 32.g4 Be2! 0-1\n",
        "3. dxe5 Ng4": "Black is sacrificing a pawn (and, possibly, his own kingside structure) in return for development, lines, and the dissolution of White's center.",
        "4. Bf4": "The Rubinstein line. Possibly White's best attempt at a refutation of the Budapest. Black commonly plays either the stolid 4...Nc6, with something approaching equality, or goes for razor-sharp and occasionally rather wild complications with the outlandish 4...g5!?",
        "4... g5": "Opinions differ as to whether this move is correct and playable or pure harakiri. But Kmoch is right about one thing: with this move, Black has burned his bridges. If he succeeds in this attack, he will probably win; if not, he will almost certainly loose. Draw is an outlandish result now!",
        "5. Bg3": "White has to decide what to do with his bishop now. The game move is the stronger option; on 5.Bd2 Black can play 5...Nxe5 with a good game.",
        "5... Bg7": "This exposes the real point of the gambit: Black gains control of the powerful long diagonal and threatens the imminent recapture of the sacrificed pawn. The whole idea behind 2.e5 is not, as could otherwise be supposed, to quickly develop the bishop. But simply to break up White's pawn center and force him to defend the ensuing wreckage.",
        "6. Nf3": "Attacking with the h-pawn straight away would be premature: 6.h4 Nxe5 7.e3 g4 is quite ok for Black. On f3 the knight is well posted to take part in the action.",
        "6... Nc6": "A line first proposed by István Abonyi, another strong Hungarian master who did significant work analyzing and promoting this opening.\nOn the face of it, White's position isn't so good here: the e-pawn is doomed, and with it much of his center influence, and the bishop on g7 exerts a monstrous influence on the game. But if you take a closer look at Black's position, there is cause for concern there as well. Primarily there is the question: where do I place the king, longer-term? Will it be safe to castle short? Will I even be able to wait with castling until I can castle long? These are the undecided questions which will likely decide the fate of the game - unless White stumbles in the opening.",
        "7. h4": "And this is the critical line. White attempts to spike Black's K-side initiative, rob him of his space advantage there and get rid of the sheltering g-pawn. While Black is focused on gaining lines and influence in the center. The e-pawn is doomed, but the fate of the g-pawn hangs in balance. While the g-pawn is alive, Black will likely have the advantage. With the g-pawn gone, he will have sacrificed his king-side structure along with the pawn; a much more dubious sacrifice in the longer term. Many players will thus prefer the more quiet, long-term advantages of 4...Nc6 instead.",
        "7... Ngxe5 8. Nxe5 Nxe5 9. Bxe5 Bxe5": "So far, so good. Black has regained the sacrificed material, has uncontested control of the long diagonal, is ahead in development, and has acute, tactical threats. Against this weighs the irreparable damage to his kingside structure. As long as he can keep the initiative, he will probably be fine. But how will White respond?",
        "10. Qd2": "It is difficult to find an improvement for White here. On 10.Nc3 Black would likely capture the knight, saddling White with an isolated, doubled pawn. And of course, the b2 pawn has to be protected or the Rook will fall after Bxb2.",
        "10... g4": "The only move. Leaving the pawn on g5, or capturing the h-pawn, leaves Black's K-side in shambles and virtually guarantees White good play. But with the g-pawn advanced like this, Black keeps up the pressure against White's K-side while gaining valuable space.",
        "11. Nc3": "Or 11.f4 Bg7 12.e4 d6 13.f5 Qe7 and Black has good play against White's weaknesses.\nOn 11.f3 Black would respond 11...Bg3+ 12.Kd1 d6 with advantage.",
        "11... Qf6": "There are many good things to say about this move: it adds real strength to Black's pressure on the long diagonal, it mobilizes a powerful piece, and it summons the specter of direct threats against f2. Additionally, it helps prepare Black castling long.\nIn contrast to this, I rather misliked Black's position after 11...f5 12.e4 d6 13.Bd3 Qf6 as White has the powerful 14.Nb5! A theme also available to White after 11...d6 12.0-0-0 Qf6.\nI did however, for some time, consider lines after 11...c6!?. But after 12.0-0-0 Qf6 13.Ne4 Qf5 14.Nd6+ Bxd6 15.Qxd6 Qe6 16.Qxe6 dxe6 Black is behind in development and will be lucky to claim equality.",
        "12. Rc1": "This is somewhat passive. I had expected 12.Nd5 with approximately equal play after 12...Qd6 13.f4 (unclear is 13.0-0-0!? c6 14.Nc3 Qxd2+ 15.Rxd2 Bxc3 16.bxc3 with eg. 16...b6 17.e4 Ba6 18.h5 0-0-0 and I think White may be slightly better) 13...gxf3 14.exf3 Bg3+ 15.Kd1 c6 16.Ne3 Qxd2+ 17.Kxd2 d6.\n",
        "12... g3": "!? And Black is forcing a potentially dangerous rupture of White's kingside.",
        "13. Ne4": "I thought at the time that 13.f3 was a no-go. However, it turns out to be surprisingly hard to take advantage of what ought to be a drastic weakening of White's kingside. The problem: White is ahead in piece development. Thus eg. 13.f3 Bf4 14.e3 Qe5 15.Ne4! and Black has nothing to show for his troubles as 15...Bxe3 16.Qxe3 f5 17.Bd3 fxe4 18.Bxe4 does not even give Black equality.",
        "13... gxf2+": "I am rather proud of this little trick, and I am pretty sure White had overlooked this. The queen is endangered, but ... White has to react to the check and cannot take the queen. And meanwhile that intrepid, little pawn is wreaking havoc on his structure!",
        "14. Nxf2 Bxb2": "Netting Black a pawn. But the material is rather inconsequential here; what's important is Black's total control of the long diagonal - and the glaring weakness of c3, which White *has* to keep under guard in order to avoid all kinds of fatalities now.",
        "15. Rc2 Ba1": "An unreal - and amazingly strong - parking spot for the bishop!\nMuch worse is 15... Bd4 as 16.e3 forces the bishop away and winning White an important tempo.\nHowever, also good is 15...Bd5 16.Ne4! (not 16.Ng4?! Bg3+ 17.Kd1 Qf4 and Black is actually better) 16...Qg6!? with good play. Eg.: 17.Nc5 b6 18.Qe3 f6 19.Nd3 0-0",
        "16. g3": "I had expected 16.Ne4 after which 16...Qe5 17.Qe3 Bd4 18.Qf3 d5! (with the idea Bc8-f5) gives Black a clear advantage.\nNor do more quiet alternatives, like 16.e4 or 16.Ng4, afford Black any problems. Eg.: 16.Ng4 Qe6 17.Qe3 d6 18.Qxe6+ Bxe6 with good play for Black.\nThe game move, though it helps to develop the bishop, turns out to be a dangerous weakening of White's king side. With the g-pawn advanced like this. White's King has no real safety anywhere on the board any more.",
        "16... d6": "I am not totally convinced this was best. But trying to fianchetto the bishop to b7 would do nothing but bring about an exchange, so I reason that it has to get out this way. And also, if b7 falls then the b-file will open and that could well prove very dangerous for White.",
        "17. Bg2 Bf5": "To be completely honest, this move was partly a miscalculation. I had overlooked the real strength behind White's rather obvious reply to my 18th move: 19.Qd3! The problem: I have no real way of reinforcing the bishop, which means I either have to retreat to f6 (wasting time and blocking the g-file) or capture on e4.",
        "18. Be4": "Before playing these moves I had taken a good, long move on the critical alternative: 18.Bxb7 Rb8 19.Bc6+ Kd8 20.Be4. Black is a pawn down here, but the open b-file is more than enough compensation: 20...Rb1+ 21.Rc1 Bc3! and White is lost.\nIt is worth noting that White cannot castle his way out of his current problems: 18.0-0 0-0-0 19.Ne4 Qd4+ and White has nothing to show for the pawn. Eg.: 20.Qxd4 Bxd4 21.Kh2 Bg6.",
        "18... Rg8 19. Qd3": "Quite strong! The point here is that Black is virtually forced to either block the g-file or lose the bishop pair. After 19...Bxe4?! 20.Qxe4+ Qe5 21.Qxh7 Qxg3 22.Qd3 Black's advantage is hard to see.\n\nLess good is 19.Bxf5 Qxf5 20.Qe3+ Be5 and White's troubles are hardless less than in the game line.\n\nThe greedy 19.Bxb7 Rb7 20.Bc60 Kd8 still gives Black a mortally dangerous open b-file for a measly pawn, and White has no real defence against it. Eg.: 21.Rc1 Bb2 22,Rd1 Bc3 and White is lost. Or 21.Be4 Rb1+ and 22.Nd1 fails to the prosaic 22...Bxe4.",
        "19... Bg6 20. O-O": "GK prefers the line 20.c5 d5 21.Qxd5 Bc3+ 22.Kf1c6 23.Qd6 Rd8 where White has regained the pawn but is still clearly the worse due to Black's powerful bishop pair and much healthier pawn structure.\n\nPersonally I was more concerned about 20.h5?! where I needed to make sure White couldn't force a win with his h- and g-pawns. But Black turns out to be all right however, after 20...Bxe4 21.Qxe4+ Be5 (21...Qe5 may be even better) 22.Qxh7 0-0-0 23.g4 Bg3 24.e3 Rxg4.\n\n20.Bxg6 Qxg6 21.Qxg6 fxg6 leaves Black with a slight but clear advantage due White's pawn weaknesses.\n",
        "20... Bh5": "Regroups the bishop and effectively blockades the g-pawn, pawing the way for direct mating attacks on White's king. For instance, 21.Bf3 leads to a straight mate after 21...Rxg3+ 22.Kh2 Qxh4+ 23.Nh3 Qxh3++.\n",
        "21. Kh2": "A fatal mistake in a difficult position. After 21.Bxh7 Rg7 22.Ne4 White might have been able to hold (eg. 22...Qd4+ 23.Kh1 O-O-O with Black advantage, but White's position is not impossible any more).",
        "21... Be5": "And White resigned. There is no defence.\n\nA. 22.Bxb7 Rxg3 23.Qxg3 Qxh4+ 23.Nh3 (23.Bc6+ Ke7 24.Qe4 Rg4+ 25.Qxe5+ Qxe5+ 26.Kh1 Rxh4+ 27.Kg2 Qh2++) 23...Qxg3+ 24.Kh1 Qh2++\n\nB. 22.Bxh7 Rxg3 23.Qe4 Rg4+ 24.Qxe5+ Qxe5+ etc.\n\nC. 22.Ng4 Qxf1 23.Nxe5 dxe5 and Black is a full rook ahead and is still threatening mate."
    },
    "url": "https://gameknot.com/annotation.pl/a-trojan-bishop?gm=55075",
    "gameName": "A Trojan Bishop",
    "players": "fletch666 (1727) vs. rmannstaedt (1799)",
    "opening": "Budapest (A52), Rubinstein variation"
}