{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Bc4 Bc5 4. Nc3 Nf6 5. d3 O-O 6. Bg5 h6 7. Bh4 Be7": "Ok, until this point the games has been pretty straight forward in the opening. However, with the bishop retreating to e7 I receive a development advantage which I failed to capitalize on.",
        "8. Qd2 d6 9. O-O-O a6 10. h3 b5 11. Bb3 Nxe4": "This move was totally unexpected, but as I was trying to time pressure her its not surprising that I missed this.",
        "12. Nxe4 Bxh4 13. Bd5 Bd7 14. Qc3 Nd4 15. Nxd4 exd4 16. Qxd4": "After losing the pawn, I decided that taking back on h4 would be losing too much of my development, so I went for the pin by playing Bd5. Now after he defended the knight on c3 with Bd2, it seems logical to play Qc3 to apply pressure to the pin. However, that I can gather from the computer analysis tells me that this gives black too much of a space advantage as he is able to now launch his c & d pawns forward forcing my pieces back for defense.",
        "16... c6 17. Bb3 d5 18. Nc5 Bf6 19. Qe3 Re8 20. Qf3 a5 21. a4 bxa4 22. Bxa4 Qb6 23. d4 Bg5+": "At this point I am feeling very nervous about how thigs are turning out. I did find a nice knight outpost on c5 but having to play a4 and open up the queenside for his rook and queen had me really concerned. Instead of Bxa4 I could have played the better Nxa4 stopping the Queen from coming in to b6, but I was resistant to moving my knight from the outpost I had found for it. This decision should have cost me a pawn after Qc6, 23.d4, Bxd4. This seems like a logical progression, but my opponent plays Bg5+?? giving me a chance to save myself from this predicament!!! No doubt this mistake can be traced to the amount of time my opponent had on the clock, since she had already used 75 minutes of her 120.",
        "24. Kb1 Rab8 25. b3 Be6 26. Rhe1 Re7 27. Qg3 Rbe8 28. Qd6": "Ok, so I was able to throw down some defenses by making my pawn shield a little more solid and then by activating my second rook to give me some more options. When my opponent played Re7 I started to ask myself what my opponent's plan was? She cant move to b7,and the only alternative is that she wants to play Rbe8 and go for a new attack on the e-file. I then noticed the lovely square d6 and how nice it would be if I could get a piece in there... my queen perhaps. I played Qg3 pretty quickly as I was no longer in any real danger, and if I was incorrect in my assumptions it wouldn't hurt me to play this move. Happily, my opponent reacted as planned and I took advantage of the weak square.",
        "28... Bxh3 29. Rxe7 Bxe7 30. Qxc6 Qxc6 31. Bxc6 Rc8 32. Bb7 Rb8 33. gxh3 Bxc5 34. dxc5 Rxb7 35. Rxd5 Rb5": "Sooo, I don't know what my opponent was thinking when she played Bxh3. Maybe she missed that I can simply take back on e7 eliminating all counter play on her part and leaving me free to take c6. Regardless, I was able to quickly trade down material with my opponents help when she played Bxc5 which is a mistake. I think she wanted to make the position less complicated so she wouldn't miss something because she had less than 15 mins left on the clock at this time. She just wanted to get to the 40 move mark and get the additional 30 mins added to her clock. Unfortunately for her, this left me with a rather simple endgame to play.",
        "36. Ka2 Kf8 37. c4 Rb8 38. Ka3 Ke7 39. Ka4 g5 40. c6 Ra8 41. Rxa5 Rxa5+ 42. Kxa5": "I knew that I had to get my king into the action so I started to advance it, but then I got carried away with the move c4 for some reason. Its not the most accurate ending, but as I heard from a NM friend of mine, \"It doesn't matter how you win an endgame, just as long as you are comfortable knowing what to do.\" So I may not have played the most accurate moves, but I felt pretty comfortable here. I got my king into play a little faster than my opponent, and was able to threaten and win the a5 pawn, and when my opponent traded rooks on a5 it was like putting the icing on the cake. There was no way I could lose this now.",
        "42... Kd8 43. Kb6 Kc8 44. c7 h5 45. Kc6": "Now after she played Kc8 I thought I might have to run over and stop the pawns on the kingside before I got over run by her majority, I didn't see a clear way for me to quickly promote to finish her off. As it turns out I didn't need too. 44. c7, h5 And I caught my breath. I saw a possible mate that I could play given that she didn't promote and ruin things. I spent a good long 20 mins making sure things would work as planned, I didn't want to lose because I missed some tricky sacrifice or pawn maneuvering. But in the end I figured that I would promote just before she could promote with check. Why did she not play gxh3 when she could have? Probably she was just tired and wanted to play a move contrary to what I expected, but neither move mattered since I had the pawn mate on b7. With the king trapped, there was nothing she could do.",
        "45... h4 46. b4 g4 47. b5 g3 48. b6 g2 49. b7#": "I was pretty hyped as can be imagined after beating someone a hundred points higher rated than yourself, and on top of that knowing that you came back from a losing position. Little did I know how similar some of my later games would be.\n\nIf you like this game please check out some of my other games, and please share your comments!"
    },
    "url": "https://gameknot.com/annotation.pl/a-trip-for-500?gm=66890",
    "gameName": "A Trip for $500",
    "players": "Me (1484 USCF) vs. Cassandra Rosha (1572 USCF)",
    "opening": "Giuoco Piano (C50), four knights variation"
}