{
    "moves": {
        "1. e4 e5 2. Bc4 Nc6 3. a3 Nf6 4. d3": "Nothing out of the ordinary as far as I can tell. Not an aggressive personality though.",
        "4... Be7 5. Nf3 O-O 6. Nc3 d6": "I think a Philidor-type defense still has potential for intrigue.",
        "7. Bd2 Qe8 8. h3 Nd8 9. O-O Be6": "I'm not a fan of Bishop exchanges but I do want control of e6/d5 and the freedom to make an f5 push.",
        "10. Ba2": "Probably a wasted move. At least the exchange does not damage his pawn structure.",
        "10... Bxa2 11. Nxa2 c6 12. Nb4 Nd7": "Not entirely sure why I did not chase his Knight from b4 using a5.",
        "13. Qc1 f5": "I probably should have played a5 before the f5 break.",
        "14. exf5 Rxf5 15. Na2 Nb6 16. Nc3 Ne6 17. Qe1 Qg6": "Threatening Rxf3 without consequences.",
        "18. Kh2 Bg5 19. Nxg5 Nxg5 20. f4 exf4 21. Rxf4 Rxf4 22. Bxf4 Ne6": "A huge blunder on my part. I meant to play Nf7.",
        "23. Bxd6 Re8": "My centre has collapsed.",
        "24. Bg3 Nd4 25. Qf2 Nf5 26. Bc7 Nd5 27. Nxd5 cxd5": "Believe it or not, this weak isolani becomes critical for my win later. At this particular moment it annoyed me to no end.",
        "28. Rf1 Ne3 29. Rg1 Qh5 30. g4 Qg6 31. d4 Qc6 32. Be5": "All White's pieces are elusive and no trap can be set. This forces the exchange.",
        "32... Qxc2 33. Qxc2 Nxc2 34. Rc1 Ne3 35. Rc7 Nc4 36. Rxg7+ Kf8 37. Rg5 Nxb2 38. Rf5+ Ke7 39. Rh5 Nc4": "I cannot win this pawn-grabbing contest.",
        "40. Rxh7+ Ke6 41. Rxb7 Nxa3 42. Rxa7 Nc4": "I am down even further in material. I am tentatively compensated by having a foothold in the middle and by cleaning up the Queenside. This simplifies the struggle by having the war waged only on the Kingside front.",
        "43. Ra6+ Kf7 44. Ra7+ Ke6 45. Bg3 Rg8 46. Ra1 Nd2": "A last ditch attempt to fork the King and d4 pawn.",
        "47. Re1+ Kd7 48. Kg2": "No chance of getting the Rook either.",
        "48... Ne4 49. Be5 Rf8 50. Rf1 Rg8": "Avoiding all exchanges where possible.",
        "51. Rf5 Ke6 52. Rh5 Rg6 53. Rh8 Kf7 54. Rd8 Ke6 55. Kf3 Ng5+ 56. Kg3": "Draw offered. Draw declined. (I was not surprised. It was a desperate plea).",
        "56... Ne4+ 57. Kf4 Rh6 58. Rh8": "White's plan is simple enough. Force exchanges then promote one of the extra pawns. I on the other hand need to keep his troops spread too thinly to consolidate an attack.",
        "58... Rg6 59. h4 Nf2 60. g5": "This is hopeless for me.",
        "60... Nd3+": "Removing the Bishop gets me the one pawn out of two back and buys some space along g7 and h8. Not much really but every extra move counts.",
        "61. Kg4 Nxe5+ 62. dxe5 Kxe5 63. h5": "I am not sure this is the strongest move for White.",
        "63... Rd6 64. h6": "I expected to have been checked instead.",
        "64... Ke6 65. Re8+": "Why not h7 instead? It becomes clear that even with a strong middle game, my opponent has faulty endgame execution. Only the endgame REALLY matters. ",
        "65... Kf7 66. Re1": "He still does not play h7. White will pay dearly for this foolishness.",
        "66... Kg6 67. Rh1 Kh7 68. Kh5 d4": "We have a runner here folks",
        "69. Rg1 d3 70. g6+ Kg8": "Rook-supported pawns are powerful battering rams.",
        "71. Rd1 d2 72. Kg5 Rd3 73. Kf6 Rf3+ 74. Ke6 Rg3 75. Kf5 Rd3 76. Kf6 Rd6+ 77. Kg5 Rd3 78. Kf4 Rd6 79. Kf5": "Draw offered once more. Declined once more.",
        "79... Rd3 80. Ke4 Rd6 81. Kf5 Rd3 82. Ra1": "This move loses it all. White expects to checkmate by with 83. Ra8+ Rd8 84. Rxd8# (or at least press g or h-pawns forward) but neglects Black's promotion supports Rd8.",
        "82... d1=Q": "The harsh penalty for cockiness."
    },
    "url": "https://gameknot.com/annotation.pl/a-twice-declined-draw-becomes-a-win?gm=33068",
    "gameName": "A Twice Declined Draw Becomes A Win",
    "players": "rbrinkma  vs. tonnerre ",
    "opening": "Bishop's opening (C23)"
}