{
    "moves": {
        "1. e4 c5": "This was the starting position. The Sicilian often makes for very great and exciting games. Usually White gets a lead in development and chances of attack on the King's side while Black has counterplay on the queen's side and on the open c-file.",
        "2. Nf3 d6 3. d4": "Open Sicilian. In this opening the motifs I mentioned are shown very clearly.",
        "3... cxd4 4. Nxd4": "After this exchange, Black has an open c file and two central pawns (white only has one), but White can develop faster and more easily.",
        "4... Nf6 5. Nc3 g6": "The first time I deviate from the most-played moves in the database. Usually 5...a6 is played here, which is called the Najdorf. 5...g6, as played in the game, is the Dragon variation. This is a very sharp opening with chances for both sides. Black is planning to play ...Bg7, ...O-O, ...Rc8, ...Qa5 and push the pawns on the queenside (in this game we don't see Black pushing his pawns) and his attack often involves a Rook sac on c3 after it has moved to c8. White has ideas of an attack on the position of the Black King (which will be on g8), for example with Be3, Bc4 (or Be2 as in this game), Qd2, O-O-O and push the pawns on the kingside. I like to play this as both sides.",
        "6. Bg5": "!? A rare response from White, usually considered quite harmless. 6.Be3 is the book move.",
        "6... Bg7": "This Bishop will become a monster later on.",
        "7. Qd2 Nc6 8. Be2": "?! White misses something.",
        "8... O-O": "?! And so does Black. He could have played 8...Nxe4 9.Nxc6 Nxd2 10.Nxd8 Bxc3 11.bxc3, as pointed out by the GK analysis as well as Fritz on my computer. This gives him a slight advantage.",
        "9. h4": "White starts his attack on the kingside.",
        "9... Nxd4": "Black exchanges as he can later gain a tempo with a discovered attack on the Queen. Moreover the Knight on d4 was strong.",
        "10. Qxd4 h6": "Chasing the Bishop away.",
        "11. Be3": "?! Better was 11.Bd2 because Black has a way to gain the Bishop pair now.",
        "11... h5": "!? But Black wants to stop the pawn march on the king's side first. However, the immediate 11.Ng4 was better. White has to move the Queen (12.Qd3) and then Black can exchange on e3 gaining the bishop pair in a fairly open position.",
        "12. O-O-O": "?! Obviously White doesn't care about the Bishop pair and continues his plan (as mentioned on move 5).",
        "12... Ng4": "But now Black does take advantage of that.",
        "13. Qd3 Nxe3 14. Qxe3 Be6": "The immediate 14...Qa5 was better as the Knight has to remain on c3 to protect a2. Now it can jump to d5 with a slight advantage for White according to Fritz.",
        "15. f3": "?! However, White doesn't take advantage of that.",
        "15... Qa5 16. a3": "Freeing the Knight from the defence of a2.",
        "16... Rac8": "Fritz likes 16...Bxc3 17.Qxc3 Qxc3 18.bxc3 but I didn't want to exchange those strong pieces of mine.",
        "17. Nd5 Qa4": "?! This is my only real oversight of the game. I was planning to exchange on d5 and play ...Qa4 and thought the move order didn't matter because ...Qa4 would threaten mate. However, I missed something important...",
        "18. Rd2": "? Fortunately for me, my opponent misses this too. With 18.Nxe7+ Kh7 19.Nxc8 Rxc8 he would have won an exchange and a pawn. Black clearly has compensation, but will this be enough? The GK analysis gives White +1 while Fritz says it's an equal position.",
        "18... Bxd5 19. exd5 Rc7": "Missing the beautiful 19...Bc3!! 20.Rd1 (20.bxc3? Qxa3+ 21.Kb1 Rc5! and White has to sac his queen to avoid mate)... Didn't I say something about sacs on c3?",
        "20. g4": "? The king has to get off the c file!",
        "20... Rfc8 21. Bd1": "? Again there's a sacrifice possibility on c3...",
        "21... Qc4": "? And again I miss it. 21...Rc3!! was winning because 22.bxc3? fails to 22...Qxa3+ 23.Kb1 Bxc3 and White has to sac his queen to avoid mate.",
        "22. gxh5": "?? This was the last chance for White to stay in the game. He had to play 22.Kb1 to avoid Black's next move.",
        "22... Qa2": "! I didn't even consier taking back on h5, and indeed that would have led to disaster: 22...gxh5?? 23.Rg1 an Qh6 will follow with, suddenly, a crushig attack for White! Now it's Black who strikes first, and finally the fianchetto Bishop on g7 shows its strength.",
        "23. Rg2": "? Now White loses the Rook by force. 23.Rd4 was hite's \"best\" option but that's just sacrificing an exchange to try to stop Black's attack. 23.Rd3?? wouldn't help either: 23...Bxb2+! 24.Kd2 Bc1+ wins the Queen.",
        "23... Qxb2+ 24. Kd2 Rc7xc2+": "! The winning sac.",
        "25. Bxc2": "? It's mate in 4 now, but declining wouldn't help either because White just wins the rook (and forces mate in 8 according to Fritz, but of course I didn't see that).",
        "25... Rxc2+": "I didn't see the forced mate in 4 (25...Rxc2+ 26.Kd3 Qb3+ 27.Ke4 Qa4+ 28.Kd3 Qc4#) but what I did see was that I could reach a won ending with 25...Rxc2+ 26.Kd3 Qb3+ 27.Ke4 Qxe3+ 28.Kxe3 Rxg2 And I'm a piece and a pawn up. I don't know what Wite saw but he resigned and I won the game. I was very proud of this win over a higher rated opponent!"
    },
    "url": "https://gameknot.com/annotation.pl/a-typical-sicilian-dragon-attack?gm=35379",
    "gameName": "A typical Sicilian Dragon attack",
    "players": "metalac (1590) vs. l-d-j (1430)",
    "opening": "Sicilian (B70), dragon variation"
}