{
    "moves": {
        "1. e4 c5 2. c3 g6": "I have become quite fond of the accelerated dragon so this move suits me just fine.",
        "3. Nf3 Nc6 4. Bb5": "Normally I would have played Bg7 before Nc6 so this move is interesting. ",
        "4... Bg7": "but I figure if white wants to give up his bishop then thats fine with me, I'll just continue to develop normally.",
        "5. O-O a6": "I decided to put the question to the bishop, is he willing to give it up and give me the bishop pair, the semi open b file and a nice centre? if not then this move still prepares the queen side storm that I tend to play for with these set ups. and I would normally play this move anyway so the bishop to move is a bonus.",
        "6. Ba4 b5": "So a storm it is.",
        "7. Bc2 d6 8. h3 Nf6": "I had left this knight untill now because I didn't want to block my DSB diagonal. However it needs to be developed and I didn't want to play e6 untill I was sure where my LSB belonged.",
        "9. Re1 O-O": "So now I have basically completed my development and all thats left is to decide what my game plan should be.",
        "10. d3 Nd7": "I figured all my play was on the queen side so I should bring my pieces over there, but this move just looks wrong. Maybe Re8 was slightly more accurate.",
        "11. Nbd2 a5": "More pushing on the quuenside.\r\n\r\nTime on the clock white 45:00 black 55:00",
        "12. Nf1": "redeploying the knight to some better squares.",
        "12... b4": "More pushing and threatens bxc",
        "13. Bd2 Qb6": "?! The idea was bring everything over to the queenside. In retrospect this was a rather dubious move that accomplishes nothing. ",
        "14. Ne3": "eyes the two nice squares. c4 and d5.",
        "14... e6": "covers d5",
        "15. Nc4 Qc7 16. Bf4": "Placing the bishop on the same diagonal as my queen and puts two attackers on d6. So maybe Qc7 was also a bad square for my queen.",
        "16... Nde5": "Being such a low rated and poor player does have some advantages. Namely the fact that against stronger opponents I can use a draw as a threat plus a draw becomes a good result. This move was designed to iniate mass trades and if I get doubled pawns on the e file I will play f5.",
        "17. Ncxe5 Nxe5 18. Nxe5 Bxe5 19. Bd2": "It seems white wants to keep bishops on.",
        "19... Rb8 20. Bh6 Rd8 21. d4": "That d pawn thrust has been waiting for a while. now seems about the right time as it makes a nice thrust at the centre. \r\n\r\nTime on the clock white 31:00 black 48:00",
        "21... cxd4": "This was actually a miscalculation on my part. I thought I could win a pawn by taking d4 with my bishop but I overlooked the fact that after Qxd4 there would be a mate threat on g7. Still though I'm not certain that this exchange is too bad, it does give white a good centre however I'm not sure what my other options would have been. Maybe Bg7.",
        "22. cxd4 Bg7 23. Bxg7 Kxg7 24. Bb3 Ba6": "It was a toss up between this square and b7 I thought this diagonal was probably best.",
        "25. Rc1 Qb6 26. Qd2 Rbc8": "Contesting the open file.",
        "27. Rcd1": "It seems that white doesn't want to trade. However it does mean that I get full control of the c file.",
        "27... Bc4": "looking for more trades. And if I get to take on b3 then white will have double isolated b pawns. ",
        "28. Ba4": "trying to bait me. Of course Bxa2?? losses to b3.",
        "28... Bb5 29. Bb3 Bc4": "I would have been happy with a reppition.\r\n\r\n\r\nTime on the clock white 13:40 black 45:00",
        "30. Re3 d5": "Well somebody had to advance a pawn sooner or later. This can also make whites d pawn weak.",
        "31. e5 Rc7": "The point is to double up on the c file. Probably Rd7 was the correct rook move though.",
        "32. Rf3": "The point is to play Qf4 and start attacking my king. ",
        "32... Qb5": "threatens the fork at e2 I overlooked the fact however that Qf4 also threatens to win a rook with Qf6+ forking the king and unprotected d rook.",
        "33. Qf4 Rdc8 34. h4": "! starting to attack my king. I tired to workout if I had enough time to play Be2 however after ...Be2 then white just plays Qf6+ Kg8 h5 threatning h6 and unstoppable mate. Maybe I could have tried ...Kf8 then however I wasn't up to testing it out.",
        "34... h5 35. Qf6+ Kh7": "Maybe g8 was a better square for the king. ",
        "36. Rd2": "I'm not completly sure what this move was all about possibly it was designed to prevent a rook trade if the Bishops were traded off allowing the c file to be opened again.",
        "36... Bxb3": "! I waited until now when I think it is most effective to trade off. White either has to take back with his rook and spend time swinging it back to the kingside or else accept doubled pawns.",
        "37. axb3": "I couldn't say which recapture was best, on one hand this leaves white with weak pawns. However on the other hand the rook capture would allow a few possiblities like ...Rc2 or maybe even ...a4.",
        "37... Rc7c1+": "?! Probably a bad move. At the time I reasoned to myself that this would threaten ...Qf1 which when I think about it isn't really a threat at all. \r\n\r\nBegginer sees check begginer takes check I suppose.",
        "38. Kh2 Rf8": "? Looses a pawn I just didn't realise at the time.",
        "39. Qe7 Qe8": "The best move, means my position isn't too bad even though I will be a pawn down.\r\n\r\nTime on the clock white 10:12 black 36:00",
        "40. Qxe8 Rxe8 41. Rxf7+ Kh6 42. Ra7 Ra1 43. Rc2 g5": "Necessary in prevent all sorts of trouble when White plays R2c7.",
        "44. hxg5+": "I might have played Kh3 instead if I was white.\r\n\r\nTime on the clock white 6:30 black 35:00",
        "44... Kxg5 45. Rf7": "keeping my king locked in. R2c7 was also worth a look.",
        "45... Rd1 46. Rcc7 Rxd4 47. g3": "covering more squares around my king.",
        "47... h4": "Probably not good. ",
        "48. gxh4+": "I think Rg7+ would have been better. This has the feel of letting me off the hook.",
        "48... Rxh4+ 49. Kg2 Rf4": "I spent quite a bit of time working out what would happen after 50.Rg7+ I came to the conclusion that this was safe. \r\n\r\ntime on the clock: white 1:42 black 30:00",
        "50. Rxf4": "Rg7+ was probably still better even Re7 was worth looking into.",
        "50... Kxf4 51. Ra7 Rg8+": "An inbetween move that was probably just helping white bring his king to where he wanted it.",
        "52. Kf1 Kxe5 53. Rxa5 Kd4": "? ...Rb8! held on to the pawn. I was actually going to play that in the game but for some reason played this instead.  ",
        "54. Rb5 Kd3 55. Rxb4 Kc2 56. Rb6": "Time on the clock White 3:40 Black 29:00",
        "56... e5 57. Ke2 d4 58. Rd6 Kxb3 59. f4": "secures the draw I think. \r\n\r\nTime on the clock white 1:23 black 28:00",
        "59... exf4 60. Rxd4": "I couldn't see anyway to win so I offered a draw here. Overall I was very pleased with this game. I didn't make any game losing blunders, possibly I might have missed a win but then so did white. And I think I played well and probably a bit better then my rating would suggest so I was happy."
    },
    "url": "https://gameknot.com/annotation.pl/a-very-pleasing-draw?gm=41050",
    "gameName": "A very pleasing draw",
    "players": "opponent (1790) vs. thereaper1 (1072)",
    "opening": "Sicilian (B22), Alapin's variation (2.c3)"
}