{
    "moves": {
        "1. d4 Nf6 2. e3": "White avoids c4, which allows me to play my Budapest. This move always left me with uninteresting choices (f5, b6, c5 - this last one very interesting, but again into very well-studied openings. ",
        "2... d6": "e6 was a good alternative, but with this one I wanted to keep alive the \"Budapest concept\". ",
        "3. a3 e5": "This is the \"Budapest\" choice, followed by the next...",
        "4. dxe5 Ng4": "...and we have the N defended, while white can't bring out the dsb to support the e5 pawn. On the other side, obviously white can take exd, and black has plenty of choices.",
        "5. exd6 Qf6": "...but I wanted to scare my opponent with a sudden mate threat. ",
        "6. Nf3": "So nothing happened, I just sac a pawn in an \"Icelandic mood\". It's all to see if it was worthwile. For the moment, I am \"looking\" to b2. ",
        "6... Bxd6 7. Nc3 O-O": "? On the other side, if I have given up the center, it's my fault. So I have to cope with it. ",
        "8. Ne4 Qg6": "Nothing spectacular. ",
        "9. Nxd6": "Losing my good B, and then exchanging Q would be the death of the game. ",
        "9... cxd6": "Isolated, but it keeps some control of the center, specially e5. ",
        "10. h3": "Here, my attacking spirit would have gone for Qh5, but I just wanted to calm down. ",
        "10... Ne5": "If he exchanges, I sole my isolani problem. ",
        "11. Bd2 Nbc6": "Simple mobilization. ",
        "12. Bc3": "No real threat. ",
        "12... Bf5": "? Premature. NxN ought to be played first. ",
        "13. Nh4": "The exchange route gives me an exchange down, so, sadly...",
        "13... Qf6": "I've never been so careless with my B before. I will lose the second one...",
        "14. g3": "Well, thank you, white! It provides me a nice hole in f3 to exploit. ",
        "14... Be4 15. Rh2 g5": "...and now white must submit to a fork or lose the N. ",
        "16. Ng2 Nf3+ 17. Ke2": "Here, plenty of possibilities. if Nc6-e5, everything holds. But black has the nasty Bf3 to play. So, the N has to jump away with check (otherwise, BxQ). Very nice was: Nf3-d5+. BxN (or the WQ is lost). Nc6xN+, but after QxN, there was nothing I could see. So I went for the \"amazing\"...",
        "17... Ng1+ 18. Kd2": "White should have accepted Bf3+, because he was threatening my Q too. By chosing this move, allows my Q to came in. ",
        "18... Qxf2+ 19. Kc1": "...and here, the truth has to be said, I couldn't see any win. Material is even, both sides has difficulties with his kings, both have weak points... I suddenly realized that my problem was how to get out of this with some edge at all!",
        "19... Bf3": "Not wise. White can answer Be1. Qxg3 was a little better, or Nf3. ",
        "20. Qe1": "...or this. ",
        "20... Qxe1+": "Well, not even a pawn from my courage!",
        "21. Bxe1 Ne2+": "...just in time to escape his fate!",
        "22. Bxe2 Bxe2 23. Nf4": "My pieces mobilize more easily than his, but my last B...",
        "23... gxf4 24. Rxe2 f3": "...let's try to get some more \"spice\" from the game. ",
        "25. Rf2 Ne5": "hehe...",
        "26. Bc3 f6": "...hehe... The pawn is defended!",
        "27. Bxe5 fxe5 28. e4": "Well, this was just out of my calculations. Now, how to proceed? ",
        "28... Rae8": "The idea is to press with this R on the g and h pawns. ",
        "29. c4 Re6 30. Kc2 Rh6 31. h4 Rg6 32. Rg1 Rg4": "The idea is to bring the other R to h and threat Rxh4. ",
        "33. Kd3 b6": "...but let's secure this first. It was a mistake, actually. I can afforg c5 by white. ",
        "34. Rgf1": "White sacs a pawn. ",
        "34... Rxg3 35. Ke3": "...for this one. But he will lose another one. ",
        "35... Rh3 36. Rf2xf3 Rfxf3+ 37. Rxf3 Rxh4": "All this for just ONE PAWN?!?!?!? But now, the endgame is interesting, and, in theory, won for black. But... how to get to it?",
        "38. b4 Kg7 39. Kd3 Rh1": "The R behind enemy's K and pawns, so to attack when needed, and leaving space for the h pawn to run to promotion. This will keep white busy, and I'll use it to grab some more pawn and win with the last one. ",
        "40. c5 bxc5 41. bxc5 dxc5 42. Kc4": "Here, I can defend the pawn, but then his K will take my e5 pawn, and...",
        "42... h5": "\"Passed pawns must be pushed\". ",
        "43. Kxc5 h4 44. Kd5 h3 45. Kxe5 h2 46. Rh3": "He can't promote his pawn, because he has to take the king off the e file, and when it does, my R will check him. ",
        "46... Kg6 47. Ke6 Kg5 48. e5 Kg4": "My K will defend my pawn. We'll be on a drawish position!",
        "49. Rh8 Kg3 50. Ke7 Re1": "White will lose his R for my pawn. ",
        "51. Rg8+": "Only one. ",
        "51... Kh3": "Just to play a little for the time. ",
        "52. Rh8+ Kg2 53. Rg8+ Kf3": "The next check, I will hide on the e column, and White will lose the R. ",
        "54. Rh8": "White goes for sac and revenge. ",
        "54... h1=Q 55. Rxh1 Rxh1 56. e6": "I decided I won't even bother to stop him. I will win because I will take his last remaining pawn before he can take mine. His K will end on the e8 square, and my pawn will be out of his reach. ",
        "56... Ke3 57. Kd7 Kd3 58. e7 Re1 59. e8=Q Rxe8 60. Kxe8 a5": "White is out of reach. A game won for the smallest of the advantages after a fireworked midgame. Happy New Year to all!",
        "61. Kd7 Kc3 62. Kc6 a4 63. Kb5 Kb3": ""
    },
    "url": "https://gameknot.com/annotation.pl/a-very-long-game-won-for-the-smallest-edge?gm=57394",
    "gameName": "A very long game, won for the smallest edge...",
    "players": "aspentom  vs. damalfi ",
    "opening": "Queen's pawn game (A45)"
}