{
    "moves": {
        "1. Nc3": "I like this move because it's not very well known and it has almost the exact same motives as 1. e4. This move develops a piece and attacks two central squares, albeit it does not open lines for pieces. I play this move when I want to play aggressively because I can't hope to play this move after 1. e4 when I am allured into playing 2. Nf3.",
        "1... e5": "This is the move I wanted. It is perfectly playable as it does the same things as White's e4, but it's on Black's side. I wanted to play the Vienna Gambit this game, so my next move was played accordingly.",
        "2. e4": "This move prevents any further advances of the e5 pawn, blocks access to 2. ...d5, and opens lines for my bishop and queen if it should be necessary. I also have the standard Vienna Gambit position. My next move will be f4 regardless of most reasonable enemy moves.",
        "2... Nf6": "This move attacks the white e4 pawn and develops a piece. I personally prefer 2. ...Nc6 as it frees up the f7 pawn that might make a difference in the game. ",
        "3. f4": "This move tears open the center with a side pawn in exchange for a weakened king-side. This is an aggressive move, but it's not as aggressive as the King's Gambit. The goal of this is to make a long-term queen-side attack or a short-term king-side attack. There are so many lines to this opening and the King's Gambit that there are thousands of books made for the opening in question, but nobody I know has analyzed both of these openings.",
        "3... exf4": "This is accepting the gambit. Black hopes to remain up a pawn the entire game but sacrifices his center-pawn. Other decline variations are possible including 2. ...d6 (not very good) 2. ...d5 (may be good), and 2. ...Nc6.",
        "4. Nf3": "I play this move because it is like the King's Gambit. In that opening Black cannot play Qh4+, but this move right now prevents moving the pawn to g5 in order to protect the pawn. Alternative variations include d3, d4 or Bc4.",
        "4... Qe7": "This move was likely played to undermine the e4 pawn. I do not recommend it as it blocks the bishop from moving and does not make any attempt to develop pieces.",
        "5. e5": "I didn't want to move my queen to e2 because it would block the bishop. I also didn't want to play d3 as it would block the bishop as well,and I also wanted to play d4 later in the game. I played e5 to attack the knight. Black still has the pin on my king.",
        "5... d6": "Black wants to further undermine the e-pawn. Nc6 would have also worked, but this gives a line for the bishop to pin the knight and queen.",
        "6. Qe2": "If I had played d4, a pawn exchange would have left me in an uncertain position. By that I mean I wouldn't have been confident in my play at that point. This move alleviates the pin, and will also offer a queen exchange should I capture on d6.",
        "6... Nc6": "This was a mistake. Black forgot about his knight on f6 because he became too entranced with my e-pawn. At least he got it out of the way! A better move would have been possibly Nd7, Ng5, or dxe5, but certainly not this.",
        "7. exf6": "I capture the Trojan Horse and the Greeks are left without hope. I am up the exchange, and it will be difficult for Black to retaliate at this point.",
        "7... gxf6": "I would have traded queens first and then recaptured. This would have reduced some tension on the board and would have created a more open position where my knights would not have done as well. Either way, the pawns would be detrimental.",
        "8. Nd5": "I attack with my knight to produce a quadruple fork. The best move at this point is to trade queens.",
        "8... Qe6": "After this move, Black resigned because of 9. Nxc7+ forcing Black to lose the queen. Personally, I thought that this was a good game to become reacquainted to the opening. Beginners may learn from this game a stable offensive opening and to not make simple mistakes. Advanced players may have had some exposure to the opening after this game. Thanks for your time and I hope you enjoyed this annotation!"
    },
    "url": "https://gameknot.com/annotation.pl/a-vienna-knight?gm=42776",
    "gameName": "A Vienna Knight?",
    "players": "suppressor (1443) vs. mailman3001 (1267)",
    "opening": "Dunst (Sleipner,Heinrichsen) opening (A00)"
}