{
    "moves": {
        "1. e4": "I always play this as White, because I like open games and many books give this as the best opening move for beginners.\n",
        "1... e5 2. Nf3 Nc6 3. d4": "My pet opening: the Scotch. This leads to very open positions as Black is more or less forced to trade off a pair of central pawns.\n",
        "3... exd4": "Other options are weaker. 3...d6?! will leave Black without the option to castle: 4.dxe5 dxe5 5.Qxd8+ Kxd8 (5...Nxd8? 6.Nxe5 loses a pawn); 3...f6? weakens the pawn structure on the kingside; 3...Nf6?! gives white the opportunity of 4.d5, chasing the knight away from c6; and 3...d5?! also gives White the opportunity to take away Black's castling possibility: 4.Nxe5 Nxe5 5.dxe5 dxe4 6.Qxd8+ Kxd8.\n",
        "4. Nxd4": "White can also choose between two gambits, which I'm not familiar with: 4.Bc4 (the Scotch gambit) and 4.c3 (the Goering gambit).\n",
        "4... Nxd4": "?! From this moment on, I started to relax a bit as I knew I had an advantage. This move trades off Black's only developed piece. Many beginners think this is a good move as it forces the queen to come to the centre of the board, but in this case that is not a weakness at all. The queen can't easily be chased away and she keeps an eye on g7 (and a7). The same happens in the Sicilian after 1.e4 c5 2.Nf3 Nc6 3.d4 cxd4 4.Nxd4 Nxd4?! 5.Qxd4. The main line of the Scotch is 4...Bc5, with 4...Nf6 as another playable possibility.\n",
        "5. Qxd4 d6": "Probably best, stopping e5.\n",
        "6. Be3": "I was already expecting ...c5 to come in sooner or later and was planning to retreat the queen to d2 if ...c5 was played. So I got the bishop out to prevent it from being blocked in if my queen would retreat to d2. However, most sources recommend 6.Nc3 here, to keep options open regarding the placement of the dark-squared bishop.\n",
        "6... c5": "?! My expectations (and hopes) came true! Black wants to chase away the queen from the middle of the board, but he weakens his pawn on d6 severely and also gives White full control of d5. From this moment on, my play was focused on the weakness of the d6 pawn.\n",
        "7. Qd2": "I want to keep my queen on the half-open d file. I'm also planning to castle long.\n",
        "7... Nf6 8. Nc3 a6 9. O-O-O": "\"A very good opening\", says my coach. And indeed, White already looks better here.\n",
        "9... Be7 10. Be2 Bd7": "?! A little passive. Better would have been 10...O-O.\n",
        "11. Bf3 Rb8": "I don't understand this move, which was played without much thinking, if I remember correctly. Maybe he feared 12.e5 (which is not necessary because he can simply play 12...dxe5 13.Bxb7) or wanted to prepare b5 (which is not necessary either, because that move is already prepared by 8...a6 and 10...Bd7). If anyone does understand this move, please leave a comment.\n",
        "12. Bf4": "! Now the weakness of the d6 pawn is visible: it's attacked three times and defended once.\n",
        "12... Bg4 13. Bxg4": "I already could have won the pawn, but I didn't want to get doubled pawns and an isolated h-pawn after the exchange of light-squared bishops on f3.\n",
        "13... Nxg4 14. f3": "Chasing the knight and again establishing e4. However, the computer likes 14.Qe2 better. 14...Qc8 is forced, afterwhich I can take on d6 (14...Nf6? is not goodbecause of 15.e5! and the knight has to retreat again because the d6 pawn is pinned to the queen and can't take on e5).",
        "14... Nf6": "Maybe Black could play 14...Ne5, temporarily stopping me from taking on d6.\n",
        "15. Bxd6": "And there goes the weak pawn. From my opponent's reaction I could conclude that he already expected this.\n",
        "15... O-O": "? Losing the exchange. Best is 15...Bxd6 16.Qxd6 Qxd6 17.Rxd6 (other moves would lead to either losing material or putting black in a very defensive position).\n",
        "16. Bxb8": "Now I also had a psychological advantage as my opponent couldn't stand losing (at least not in this game). He started to play very fast. After thegame I heard him say that he would have had at least a draw if he hadn't blundered the exchange (a strange comment as he was already a pawn down before he made that blunder).\n",
        "16... Qxb8 17. g3 Rd8 18. Qe3 b5 19. Rxd8+": "If you're up in material, it's usually good to exchange.\r\n",
        "19... Qxd8 20. Rd1 Qc7 21. Nd5": "Again to exchange pieces, but here maybe 21.e5! would have been better. After 21...Nh5?? he loses the knight because of 22.g4, after 21...Nd7?! I play 22.Nd5 forking queen and bishop (the following move would have been 22...Qd8 after which I can still exchange minor pieces) so he has to retreat the knight to e8 where it's completely out of play.\n",
        "21... Nxd5 22. exd5": "Now I have a passed pawn which is protected by a rook.\n",
        "22... h6": "A prophylactic move: defending against possible mating threats on the back rank.\n",
        "23. f4 Bf6 24. d6": "Very strong would have been 24.Qe8+! Kh7 25.d6 Qa5 26.Qxf7 and the d-pawn can't be stopped properly.\n",
        "24... Qd7 25. Qxc5": "And Black resigned. I threaten Qc7, which can only be stopped by 25...Bd8. I wonder if he saw this defence. Probably he was fed up with this game and with chess altogether (it was the last round of a 6-round Swiss). I think this game showed very well how a weak backward pawn can be used as a target, because it can only be defended by pieces. Thanks for reading. I hope you enjoyed the annotation. If you want to see more of my annotated games, just click on my username and you'll find another one. Any comments are welcome.\n"
    },
    "url": "https://gameknot.com/annotation.pl/a-weak-backward-pawn?gm=32788",
    "gameName": "A weak backward pawn",
    "players": "l-d-j (1225) vs. Black Player (1449)",
    "opening": "Scotch (C45), Ghulam Kassim variation"
}