{
    "moves": {
        "1. Nf3": "Hi guys. Here's a game i played against a player called marunui. so white kicked off with nf3",
        "1... Nf6 2. d3 d5 3. e3 Bg4 4. Be2 Nc6 5. Nfd2 Bxe2 6. Qxe2 e6 7. d4 a6 8. f3 Bb4 9. c3 Bd6 10. e4 dxe4 11. Nxe4 Nxe4 12. Qxe4 O-O": "Here white has a nice central control, but black has many open lines for an attack.",
        "13. Kf2": "this was an odd move, why couldn't he have castled?",
        "13... Re8 14. g3 e5 15. d5 Ne7": "This move offered some chances to harass the white queen.",
        "16. c4 f5 17. Qh4 Bc5+": "though ill throw in a check here, it cant hurt me.",
        "18. Be3 Bxe3+ 19. Kxe3 f4+": "This appeared to be losing a pawn, but it isn't. Because if 20.gxf. exf+  21. qxf4 will be followed by nxd5 double check and a fork on the queen. and if 21.kxf4 nf6+ forking king and queen.",
        "20. Ke2 b5": "white cant take because black would win a pawn with 21. cxb  axb. 22. ... nxd5",
        "21. b3 Qb8 22. g4 bxc4 23. bxc4 h6": "i guess here i could have played ng6 kicking the queen but i didn't, and decided to go for an insufficient way to kick the queen.",
        "24. Nd2": "white brings his knight in to the, a wise move.",
        "24... Qb6": "threatening 25...qe3+",
        "25. Qf2 c5": "here i didn't want to exchange queens off, because i felt i had a decent advantage here.",
        "26. Rhb1 Qc7 27. Ne4 Rec8": "White threatened nxc5 so i had to defend and though this was a logical move...",
        "28. d6": "But i overlooked this move.",
        "28... Qa7 29. a4": "Here white really should have taken the knight, because it would prove to be lethal",
        "29... Nc6 30. Kd2": "Getting out of any nd4 checks.",
        "30... Nd4": "nd4 is still played, its a nice square for the knight to be on",
        "31. Nc3 Qd7 32. Nd5": "Here white let me take the passed pawn, because hes threatening nb6 forking the rooks.",
        "32... Qxd6 33. a5": "but it wasn't played??",
        "33... Rce8": "There's still a fork on c7 if the queen leaves it unguarded",
        "34. Rb6 Qf8": "And it happens now",
        "35. Nc7 e4": "Here I'm threatening e3 winning the queen",
        "36. Kd1 e3": "Another tempo gain and my pawns getting dangerous now.",
        "37. Qg2 e2+ 38. Kd2 Qe7": "Here whites best move is nd5",
        "39. Nxe8": "A Horrific blunder which leads to a forced mate in two.",
        "39... Qe3+": "and here white resigned, because the only legal move is ke1 followed by nc2#. Hope you enjoyed he annotation:)"
    },
    "url": "https://gameknot.com/annotation.pl/a-weird-game?gm=52606",
    "gameName": "a weird game",
    "players": "marunui (1379) vs. vavavi (1349)",
    "opening": "Reti opening (A05)"
}