{
    "moves": {
        "1. d4 d5 2. Nf3 c6 3. c3 Nd7 4. Bf4 b6": "Weak, maybe. The fianchetto is a slow plan for the black's lsb, but it is coherent.",
        "5. e3 Ngf6 6. h3 Nh5 7. Bh2 e6": "The discovered threat against the black knight is ok, but not enough for me...",
        "8. Bd3 Be7 9. Nbd2 O-O 10. Qc2": "well, if he leaves me, I develop attacking.",
        "10... Bb7": "Just an oversight by him.",
        "11. Bxh7+ Kh8": "provided g6 traps my bishop, and Bxg6, fxB, Qxg6, Nmoves and it's ok for me, but not decisive, I tried a crazy sac (it was an over the board blitz)",
        "12. Bg6 fxg6 13. Qxg6": "As wrong sac, since the knight retires and nothing happens.",
        "13... Nhf6 14. Ne5 Nxe5 15. dxe5 Nh7": "Now, Qxd6 is tricky, but I have my 3 pawns for the piece. But no attack anymore. ",
        "16. f4": "Consolidating for o-o-o and bring more firepower to the lines. ",
        "16... Kg8 17. O-O-O": "Now I can play Ne4. But I was lost, anyway. c5...",
        "17... Qe8": "Well, this threats with a queen exchange that leaves me with a long, long game...",
        "18. Qxe6+": "So why don't try the crazy way? ",
        "18... Rf7": "If Qf7, Qd8, but it was not that strong. ",
        "19. g4": "Another \"crazy\" attack move, just looking for something (f6 fork, for instance)",
        "19... Bc8": "UUUUUPPPSSSS, right!",
        "20. Qg6": "Rf8 and it forces queen's exchange, and my attack vanishes.",
        "20... Nf8": "Nice. ",
        "21. Qh5": "My queen is trapped. ",
        "21... Qd8 22. Nf3": "Aiming at nothing, overlooking the danger. ",
        "22... g6": "touché!",
        "23. Qh6 Rh7 24. Qxh7+ Kxh7": "Minus 4. Wonderful. Time to consolidate.",
        "25. g5": "Maybe better was h4, and if Bxh4, g5 or Bg1. ",
        "25... c5": "Strong, threatening the diagonal fork. ",
        "26. h4": "Just a stupid move: Bg4, and I cannot avoid exchanges and losing. ",
        "26... Bb7": "A little help by my opponent. ",
        "27. e4": "jeje...",
        "27... Ne6": "By moving the queen, I would have be driven into defensive mood... and losing. ",
        "28. h5": "Yahoooooooo!",
        "28... gxh5 29. Bg3 Qe8 30. exd5": "Well, now Rd8, since I cannot advance the pawn without losing a Night...",
        "30... Ng7": "Attack produces fear. A very unpolite way to win at chess (don't try it with computers). ",
        "31. Nh4": "I have to stop Nf5, and try to clear the white diagonal as soon as possible. ",
        "31... Qd7 32. Rhf1": "Probably better Rg1, or e6 at once. ",
        "32... Nf5 33. e6": "Black could have played returning the queen, with Nxbg3, exQ, NxR...",
        "33... Qd6 34. g6+": "May as well try the trick.",
        "34... Kg8 35. Nxf5": "Piece returned, and material balance almost restored. But what a pawn's line!",
        "35... Qc7": "Forgive them, Father, since they don't know what they are doing...",
        "36. d6": "and resigned. Incredibly enough, I won this one..."
    },
    "url": "https://gameknot.com/annotation.pl/a-wild-banzai-attack?gm=38859",
    "gameName": "A wild banzai attack",
    "players": "damalfi  vs. picklepuss ",
    "opening": "Queen's pawn game (D02)"
}