{
    "moves": {
        "1. e4": "Hi everyone!  At Leslie's request, I am annotating an unrated game in which Les has been playing with his mentor, Etienne.  Etienne, who is in my group, is also being mentored by David Patron.  Anyhow, the opening starts off with wild and woolly opening.  Unfortunately for Les it does not work out, but I am sure we will all learn from what happened after the pseudo-sacrifice on f7.  We start off with a double king pawn opening which is 1. e4 e5.",
        "1... e5 2. Nf3 Nc6 3. Bc4 Nf6": "3. ...... Nf6 - the two knights defense.  This will transpose into the Three Knights Opening on the next turn.",
        "4. Nc3 Nxe4 5. Bxf7+ Kxf7": "5. ...... Kxf7 - Etienne accepts the sacrifice.  However, Les can actually recover the loss by playing Nxe4 on the next turn.",
        "6. Nxe4 d5 7. Neg5+": "7. Neg5+ - Les goes for Etienne's exposed king.  Unfortunately for him, there are not enough pieces developed to put King Etienne into Old Matey's shadow.",
        "7... Kg8": "7. ...... Kg8 - sanctuary.  It does however, block in the KR.  Can Les cash in on this?  We shall see.",
        "8. d3 h6 9. Nh3": "9. Nh3 - forced retreat.",
        "9... Bg4": "9. ...... Bg4 - pin.",
        "10. Qd2": "10. Qd2 - risks BxN busting up white's kingside.  However, because King Les (WK) is still in the centre, maybe an open g file will be beneficial to white because King Etienne (BK) is right on it!",
        "10... Qf6 11. Nhg1": "11. Nhg1 - now Les must prevent the trade off to avoid losing a pawn to Qxf3.",
        "11... Bd6 12. h3": "12. h3 - trying to drive off the lsb.",
        "12... Bd7 13. Qe2 Re8": "13. ..... Re8 - placing a black rook on the same file as King Les and his better half.  Les must watch out for a possible pin down the e column.",
        "14. Kd1": "14. Kd1 - evades pin but now white cannot castle.",
        "14... e4 15. dxe4 Rxe4 16. Be3": "16. Be3 - development but it puts white's dsb into a pin and leaves the b2 pawn en prise to the BQ.",
        "16... Qxb2 17. Rc1 Ba3": "17. ..... Ba3 - eschews taking the pawn on a2.  If the white dsb ever moves off the c1-h6 diagonal or gets taken then King Les will cop Old Matey instantly.",
        "18. Qd2 Kh7": "18. ..... Kh7 - clears a space for the black KR to come to an open file.",
        "19. Ne2": "19. Ne2 - a deck clearing move.",
        "19... Nb4": "19. ..... Nb4 - threatening Nxa2 which gangs up on the hapless rook on c1.",
        "20. Ng3 Rxe3 21. fxe3": "21. fxe3 - an exchange sac on Etienne's part, but the fireworks haven't ended.",
        "21... Qxc1+ 22. Qxc1 Bxc1 23. Kxc1 Nxa2+": "23. ...... Nxa2+ - the point.  After this plethora of blood letting, Etienne ends up two pawns to the good.",
        "24. Kd2 Rf8 25. Ke2 Nc3+": "25. .... Ne4+ - now Etienne harries King Les with knight checks.",
        "26. Kd2 Ne4+ 27. Nxe4 dxe4 28. Ne5": "28. Ne5 - this could allow Etienne to win a further pawn by Rf2+.  However, Etienne has a different idea.",
        "28... Ba4 29. Ra1 b5": "29. ....... b5.  Here Les hit the resign button - he resigned on the grounds of ruinous loss of material.  He is already two pawns down and the white pawns on the second rank are likely to drop off in very short order.  A valiant performance from Les - keep trying.  Kind regards - Joanne"
    },
    "url": "https://gameknot.com/annotation.pl/a-wild-wild-opening?gm=54179",
    "gameName": "A wild, wild, opening!",
    "players": "lesplay (1182) vs. a_random_guy (2002)",
    "opening": "Two knights defence (C55)"
}