{
    "moves": {
        "1. d4 d5 2. c4": "Because this is a themed mini-tournament, the game starts here.",
        "2... e5": "The Albin counter-gambit. I've never seen it before, so I was mostly playing moves that \"felt\" right.",
        "3. dxe5 d4 4. Nf3 Nc6 5. g3": "A fianchetto seemed to be the right thing to do here.",
        "5... Be6 6. Nbd2": "I think maybe I should have played b3 instead. This move blocks in my bishop.",
        "6... Qd7": "If I were him, I might have played Bb4, pinning my knight and increasing pressure on the c pawn.",
        "7. Bg2": "This bishop on g2 comes in very handy later.",
        "7... O-O-O": "Again, I might have played Bb4.",
        "8. O-O h6": "Maybe he was thinking about a pawn storm attacking my king?",
        "9. a3": "Preparing a pawn storm of my own.",
        "9... Nge7": "Development, but it blocks in his bishop.",
        "10. b4": "I launch the pawn storm.",
        "10... Nf5": "According to the Gameknot computer, this move was the first inaccuracy of the game.",
        "11. b5": "I advance.",
        "11... Na5 12. Qa4 b6 13. Nb3": "I planned on removing his knight and resuming my attack, but the GK computer tells me that this is an inaccuracy. After black plays Bxc4, my attack is diffused.",
        "13... Nxb3": "Luckily for me he doesn't find the move. In fact, I might call this a mistake because of what follows.",
        "14. Qxa7": "He can't take my rook or it's mate in one. Interestingly, the computer calls this a mistake, that black should play c6. What the computer doesn't know is I would be perfectly happy with a draw by perpetual check against an opponent this strong.",
        "14... Qe8": "He had to either move his queen or play c6, and as I said earlier that allows a draw.",
        "15. Ng5": "! He can't take the knight or I'll play Qb7+, Kd7, Bc6+, winning his queen.",
        "15... Bd5": "The analysis suggests Na5 instead of this.",
        "16. cxd5": "! Had I taken with the bishop, he could have played Rxd5, and then after I retook played Nxa1. Instead, this keeps the attack alive.",
        "16... Nd6": "The final mistake, allowing mate in 5. I suppose he was hoping that I would take his knight with the pawn?",
        "17. Bh3+": "! There is now a forced mate, and my opponent resigns. I was very happy to get this win against such a high rated opponent! If you liked this annotation, please leave a comment or two and rate it on the star system."
    },
    "url": "https://gameknot.com/annotation.pl/a-win-against-a-higher-rated-opponent?gm=60103",
    "gameName": "A win against a higher rated opponent",
    "players": "blenderboy (1383) vs. vadim_tziganasj (1597)",
    "opening": "QGD (D09), Albin counter-gambit, 5.g3"
}