{
    "moves": {
        "1. e4 c5 2. Nf3 g6": "The Accelerated Dragon.  I use this because I hate seeing the Yugoslav in the regular Dragon.  In the Acc. Dragon, you can play d5 and create enough central counterplay to discourage the Yugoslav.",
        "3. d4 cxd4 4. Qxd4": "An unusual variation that I'd never played against before.  ",
        "4... Nf6 5. e5 Nc6": "A useful in between move that will allow my f6 knight a better spot than he has now, or would if the white queen didn't have to move.",
        "6. Qe3": "I looked it up after the game, and Qa4 is mainline.",
        "6... Ng4 7. Qe4 d6": "Threatening to win tempo with ...Bf5.",
        "8. exd6 Bf5": "THIS in between move doesn't work (or, at least, shouldn't have).  White can play 9.dxe7 and will be better in the resulting game.  However, Kim misses this move.",
        "9. Qe2 Qxd6 10. h3 Nge5": "Inviting a pin.  Would he take the bait?",
        "11. Bf4 Qb4+": "A triple fork.",
        "12. Bd2 Nxf3+ 13. Qxf3": "Now it's fine for black to take the pawn on b2 because, if white tries the fork 14.Bc3 black simply checks with the queen and then blocks with the f-pawn.",
        "13... Qxb2 14. Bc3 Qc1+ 15. Qd1 Qxd1+": "I'm fine with simplifying when I'm up, even if it's not by much.",
        "16. Kxd1 f6 17. Bb5 Bh6": "My bishops hone in, effectively cutting the board in half.",
        "18. Na3 Rc8": "Threating in some lines to make a discovered attack against the c3 bishop.",
        "19. Ba4": "Stopping my gain of tempo, ..a6, from being very effective.  ",
        "19... a6 20. Rb1 b5 21. Nxb5 axb5 22. Bxb5 O-O": "The poor white king is about to become the victim of a full blown attack, carried out by pretty much all of black's pieces.",
        "23. Ba4 Rfd8+ 24. Ke2 Nd4+ 25. Bxd4 Rxd4 26. Bb3+ Kg7 27. Rb2": "This may look like it saves the pawn, but it doesn't.",
        "27... Bxc2": "I he takes, I will get the bishop back and keep the extra pawn.  For example: 28.Bxc2 Rd2+, or 28.Rxc2 Rxc2+ 29.Bxc2 Rd2+.",
        "28. g3 Rd2+ 29. Kf3": "This allows Be4+.  Ke1 is slightly better.",
        "29... Be4+ 30. Kxe4 Rxb2 31. f4 Rc5 32. Kd4 Ra5 33. Re1 Rd2+ 34. Kc3 Rd7 35. Re6 Kf8 36. Rb6": "White's last chance.  He's hoping for 37.Rb8+ Kg7 38.Rg8#.  ",
        "36... Ra8": "And white resigned soon thereafter."
    },
    "url": "https://gameknot.com/annotation.pl/accelerating-the-dragon?gm=35830",
    "gameName": "Accelerating the Dragon",
    "players": "Kim Barney (1600) vs. Matt Boren (1388)",
    "opening": "Sicilian (B27), Hungarian variation"
}