{
    "moves": {
        "1. e4": "This game comes from a tournament that I hosted based around the Accelerated Dragon. So I'll start after move 6 where the position was set.\n\nAs always any logical or spelling errors should be reported to me so I can fix them.",
        "1... c5 2. Nf3 g6 3. d4 cxd4 4. Nxd4 Nc6 5. Nc3 Bg7 6. Be3 Nf6": "Ok, so here we are, this is a typical Accelerated Dragon set up.\nWhite has a few ideas here. He can play the main line with 7. Bc4, he can play for an extremely sharp game with 7.Nxc6, he can transpose into the Classical Variation with 7. Be2, or he can strengthen e4 with 7. f3.\n\nWhite chose to play 7. Nxc6.",
        "7. Nxc6": "In order to understand why people play this move we have to look at what it does.\nOn d4 the White Knight controls some squares, but Black's pieces have very little interest in them. However, it serves as a target for Black's more tactical ideas like ...Ng4 and ...Nxe4. So really at this point the White Knight kind of exists in a limbo between good and bad, and the way that the game shapes up really determines its status.\nNow, Black's Knight on c6 facilitates these tactical ideas, and blocks the pawn on e4's advance to e5. White would really like to play e5 and then f4 to start his kingside pawns rolling towards Black's eventual castle.\nSo basically, after taking the Knight on c6, White should plan to play e5 and drive Black's Knight on to an awkward square and launch his pawn storm.",
        "7... bxc6": "This is the established way to capture here. I'm not quite sure why, but I think it's because Black's main idea is to castle into his strong castle, and so if he recaptured with the d-pawn, after White takes his Queen, Black can no longer castle.",
        "8. Qf3": "White has missed his key idea! This doesn't appear to be a bad move, but it feels like an awkward square for the Queen. The best move would have been e5, but even if White didn't know that, then Qd2 is good and fairly thematic in Dragon positions. However, this develops the Queen to a pointless square where she's not making any real threats.",
        "8... O-O": "Black simply continues his developmental scheme. He is not afraid of White's position.",
        "9. Ne2": "This is another awkward move. It puts the Knight in the Bishop's way and doesn't control any new squares. In fact, it  controls less squares than before and removes a defender from the pawn on e4.",
        "9... Ba6": "Black takes advantage of his chance to develop his Bishop.\nThis move may look pretty strange, but it's thematic in this variation of the Accelerated Dragon. It often has the power to force White to castle queenside, straight into the scope of Black's Rook on a8, it just needs to move to b8.",
        "10. Rd1": "This was the third awkward move in a row. It seems odd to me that White would want to place his Rook there without moving his King out of the way by castling. White would have had to deal with the open b-file, but then his King could breathe a little bit. Here, everything steps on everything else's toes, and we can already see a checkmate threat appearing along the a5-e1 diagonal.",
        "10... Rb8": "The idea behind this move was to develop the Rook and to force b3. By forcing White to play b3 Black is removing defense from c3 which happens to lie along the a5-e1 diagonal and could block Black's mating ideas later.",
        "11. b3": "The dark squares around White's King are becoming much weaker now.",
        "11... d5": "Black wants to clear the Knight out of the way of his Bishop on g7 so that it can help raid the dark squares.",
        "12. exd5 Nxd5": "Now if 13. c4 Qa5  14. Bd2 Nb4 threatening mate via ...Nc2.",
        "13. Bxa7": "White is just attempting to create some counter play here. However, he is once again weakening the dark squares around his King.",
        "13... Qa5+": "Black decides it's time to launch his attack.",
        "14. c3": "This is really the only choice as blocking with anything else loses a significant amount of material.",
        "14... Nxc3": "This is threatening all sorts of discovered attacks, and it looks like most of them lead to mate.",
        "15. Rd2": "White is forced to block the threatened discoveries, which means that he gives Black a free tempo.",
        "15... Rxb3": "As we'll see, Black is only temporarily sacrificing the Rook here. It opens up a1 for the Black Queen to invade and take advantage of the fact that White's pieces are so uncoordinated.",
        "16. axb3 Qa1+": "Now White has to give back a Rook and a Knight to have any hopes of survival!\nIf 17. Rd1 Qxd1#.",
        "17. Nc1": "There goes the Knight, which allows the White Queen to defend d1.",
        "17... Qxc1+": "Now the Rook is forced to d1.",
        "18. Rd1": "After Black recaptures the Rook he will be ahead in material.",
        "18... Nxd1": "Now if 19. Qxd1, the effect of Black's Bishops can really be felt when 19. ...Bc3 is mate. The look crazy and random, but really they're serving to constrict White's position.",
        "19. Bxa6": "White tries to eliminate the power of the Black Bishops but it's too late. According to Fritz it's mate in two or less for every move but Qxf7 , for which it's mate in three.\nI leave you to finish the last two moves on your own as they are both forced.\nHowever, I want to say that this was a really exciting game, and that if you start to see weaknesses (like the dark square weakness in this game) around your opponent's King you should try your best to exploit them, and reciprocally, if you see weaknesses developing around your own King you should try your best to patch them up or stop your opponent from exploiting them.",
        "19... Nc3+ 20. Qd1 Qxd1#": "0-1"
    },
    "url": "https://gameknot.com/annotation.pl/accelerated-dragon-2?gm=15740",
    "gameName": "Accelerated Dragon 2",
    "players": "djuska (1373) vs. tigerzrul88 (1567)",
    "opening": "Sicilian (B27), Hungarian variation"
}