{
    "moves": {
        "1. d4 Nf6 2. c4 c5 3. d5 e6 4. Nc3 exd5 5. cxd5 d6 6. e4 g6 7. f3": "Playing f3 forces the game to going toward quieter lines that are less dangerous. The disadvantage is that White has a problem developing his king's knight. ",
        "7... Bg7 8. Bg5": "played to provoke a weakness on the side that black intends to castle on",
        "8... h6 9. Be3 a6 10. a4": "I have played this type of game many times as black and  I know that it is never a good idea to allow b7-b5 unchallenged",
        "10... Nbd7": "This is a great square for the knight, however now black is going to have trouble developing his bishop",
        "11. Nh3": "this move takes advantage of the fact that black has played Nbd7. I intend to play Nf2 to support my natural weakness on d3",
        "11... Ne5 12. Nf2": "supporting d3 and g4",
        "12... O-O 13. Be2": "preparing for kingside castling",
        "13... Qb6": "The point I think of this move is to attack b2 which is currently undefended. However, b2 is easily defended and the Queen is in a vulnerable position on b6",
        "14. Qd2": "defending b2 and creating a battering ram along the c1-h6 diagonal. ",
        "14... Bd7 15. a5": "and this is why Qb6 is such a bad move. now the queen will have no good squares to be on. ",
        "15... Qb3 16. O-O Rfe8 17. Qc1": "side steping any business with Nc4",
        "17... Nc4 18. Bxh6 Rac8 19. Bxg7 Kxg7 20. Ra2 Nxd5 21. Bxc4": "This knight is the most dangerous of the two",
        "21... Qxc4 22. Nxd5 Qxa2": "The rook was off limits Black needed to control the c file and not allow white to take control of the dark squares",
        "23. Qc3+ Re5 24. f4 f6 25. Nxf6 Kxf6 26. fxe5+ Ke7 27. exd6+ Kxd6 28. Nd3": "black is completely sunk",
        "28... Be6 29. Qe5+ Ke7 30. Qg7+ Kd6 31. Qxb7 Bd7 32. e5+ Ke7 33. Nf4 Qg8 34. Nd5+": ""
    },
    "url": "https://gameknot.com/annotation.pl/acpros-benoni-tournament?gm=18934",
    "gameName": "acpro's benoni tournament",
    "players": "elyhim (2025) vs. valeriuzaharia (1965)",
    "opening": "Benoni (A66), pawn storm variation"
}