{
    "moves": {
        "1. e4 e6 2. d4 d5 3. e5 c5": "I like playing the advanced french though this is the first time I have played this line where I advance my c5 pawn.",
        "4. c3 Nc6 5. Nf3 Qb6": "Basic advance french setup.",
        "6. a3 f6": "This is a new idea I started trying out.  I like it.",
        "7. Bd3 fxe5 8. dxe5 c4": "Advancing the C5 pawn.",
        "9. Bc2 Nh6": "In order to bring my knight to f7.  My thinking is that if it is taken then I get the g and f files for my rooks.  I will also get some queenside pawns with my Qb6.",
        "10. O-O Nf7 11. Qe2 g6": "In order to add pressure on e5.",
        "12. Ba4 Bg7 13. Be3 Qc7": "More pressure.",
        "14. Bd4 O-O 15. Re1 Bd7": "I now feel pretty safe.  I have a good position but am unsure of where to go!",
        "16. Bc2": "So I set about creating a passed pawn.",
        "16... a5 17. Nbd2 b5": "My opponent is unsure of what to do I think.",
        "18. Nf1 Nxd4": "Nxd4.  I consider this move to be good because I am taking away a pawn from guarding b4.  If white recaptures with the knight then I get the e5 pawn.",
        "19. cxd4 b4": "I continue with my plan.",
        "20. axb4 axb4 21. Rxa8 Rxa8 22. h4 b3": "Starting my final pawn push.",
        "23. Bb1 c3 24. bxc3 Qxc3 25. Ne3 Ra1": "At this point my opponent was running out of time (under 1 minute left).",
        "26. Qd2": "I didn't see a way to avoid the queen exchange.",
        "26... Qxd2 27. Nxd2 Ba4": "Rushing my pieces over to the passed pawn.",
        "28. Rc1 Bf8 29. Rc8 Kg7 30. Kh2 Bb4": "Driving off the knight (threatening Rxb1).",
        "31. Nxb3": "The knight sacrifices himself for the pawn.",
        "31... Rxb1": "I took the bishop because ...Bxb3 would be answered Rb8.  This actually wouldn't be that bad but I was getting short on time myself so just did some hasty calculations and went with it!",
        "32. Nc5 Bxc5 33. Rxc5": "This simplifies my material advantage.",
        "33... Rb2": "Unsure of how to proceed I just put my rook on the seventh rank.  Normally a good thing.  I think I would have rather put it directly on b7.",
        "34. Kg3 Rb7 35. Nxd5": "Nxd5!  My opponent wishes to create 2 powerful linked, passed pawns at the expense of his knight.",
        "35... exd5 36. Rxd5 Rb3+": "I don't want this king anywhere near his pawns.",
        "37. f3 Bc6 38. Rc5 Bd7": "Setting up a \"remote\" blockade of sorts on e6 and e5.",
        "39. Kf4 h6": "Preparing g5!",
        "40. d5 Rb4+": "Driving the king back and securing the e5 pawn.",
        "41. Kg3 Nxe5": "White resigns."
    },
    "url": "https://gameknot.com/annotation.pl/advance-french?gm=39506",
    "gameName": "Advance French",
    "players": "Chebob (Unknown) vs. Me (1423)",
    "opening": "French (C02), advance, Milner-Barry gambit"
}