{
    "moves": {
        "1. d4 Nf6 2. c4 g6": "Commencing the king's indian defense.  Various move orders with the moves d6, g6, Bg6 are not crucial.",
        "3. Nc3": "The first two pawn moves solidify the center for white directly, while blacks bishop on g7 will indirectly attack the center and black will also look to play d6, and then e5 to counterattack whites center.  Nc6 enables white to play e4 while developing a piece.",
        "3... Bg7 4. e4 d6 5. Nf3": "Developing another piece, so far the game matches all the book moves in the king's indian defense.",
        "5... O-O 6. Be2": "Looking to castle.",
        "6... Nbd7": "This move is a key move for black in the king's indian as it looks to support ...e5 and can also go to b6 when it would attack whites c-pawn.",
        "7. O-O e5 8. d5": "Most players keep the center tension by not advancing to d5.  This was my mistake locking in the pawn chain.  Here both sides will look to attack in the direction in where their pawn chains are pointing (white on the queenside, black on the kingside).",
        "8... c6": "Not the best move for black, this makes blacks d-pawn very weak and black is concentrating on attacking whites pawn chain on the wrong side.  Better is Nf8 followed by f5 and f4",
        "9. Ne1": "White could have played dxc6 bxc6 and then look to attack the weak pawn on d6, but I decided keep the pawn chain and continue with the normal strategy behind the kings indian defense - queenside pawn rush.",
        "9... Nc5": "In looking at my opponents past games once he played the kings indian, I found out that he preferred this move with a double attack on the pawn on e4.  In the game that he played it beforehand, white did not play Ne1 and instead his knight on f3 blocked white from playing f3 to support the pawn on e4 and strengthen the pawn chain.",
        "10. f3 cxd5": "Black is still focusing on the wrong side of the board",
        "11. cxd5": "Capturing with the e-pawn would ruin the pawn chain and give black the ability to play e4 at some point, Nxd5 would put the the knight in great position but after black answers with Nxd5, continuing the pawn chain would be inevitable with cxd5.",
        "11... a6": "A move that must be made somepoint to prevent Nb5 which would attack the weak pawn on d6.",
        "12. Nd3": "Looking to get rid of the knight on c5 and open the c-file for rooks.  ",
        "12... Qb6": "Black chooses not to take by playing Qb6 and aiming for ...Nxd3 creating an undiscovered check.",
        "13. Be3": "Black cannot move or capture with the knight on c5 because it is pinned to the queen.  If black keeps his queen there white is threatening b4! winning the knight on c5",
        "13... Qc7": "Black retreats.",
        "14. Nxc5": "White looks to take advantage of blacks broken-up pawn chain by capturing.",
        "14... dxc5 15. Na4": "Now blacks position starts to fall.  Na4 has a double threat on c5 and both of whites bishops are active.  The c-file is also open for whites rooks.  Lastly, look at blacks pieces...they are all very inactive besides the Queen which is soon to be threatened.",
        "15... b6": "Defending the pawn on c5 but continuing to open up weaknesses on the queenside.",
        "16. Rc1": "White threatens to play b4! winning the c5 after black's queen retreats away from whites rook on c1.",
        "16... Qd6 17. b4": "Keeping the same plan as if black plays cxb4, white has two pieces attacking b6 and also controls the c-file with the rook on c1.  ",
        "17... Rd8": "Black is lost.  Still not playing on the kingside like he should be, black looks to get another piece in the battle however this move does nothing.",
        "18. bxc5": "Winning a pawn for white and getting ready to open up blacks position.",
        "18... bxc5": "Black really does not have many other moves to play here.",
        "19. Bxc5": "Black only has three safe squares for his queen to move to...Qd7, Qc7, and Qb8 all three face problems.  Qb8 is answered by Rb1, where black would have to move to Qc7 or block with Bb7.  If black blocks with Bb7 white will simply play Qb3 threatening capture on b7. and black will end up being trapped in the corner.  This might have been the best option because Qc7 leads to 20. Bb6! winning blacks rook, and Qd7 leads to 20. Nb6 winning blacks rook.",
        "19... Qd7 20. Nb6": "There's the powerful fork winning the rook on a8.",
        "20... Qb7 21. Nxa8 Qxa8": "Now blacks queen is pushed all the way in the corner and blacks pieces are all very inactive.  While white is enjoying space advantage, active development, and a lead on material.",
        "22. a4": "I could have shifted some pieces around right away to continue the attack, but I felt that 23. a5 would give a perfect outpost for my bishop on b6 and would constrict blacks space.",
        "22... a5": "Black stops this plan but now white has a potential outpost on b5 for its pieces.",
        "23. Rb1": "Controlling the open b-file",
        "23... Ba6": "looking to do something with his pieces as they have been idle all game long however, a trade only works to whites advantage as he is ahead in material.",
        "24. Rb6": "I choose not to take as Qxa6 would give blacks queen a better position and the chance to move to c4.  This move forces blacks light-squared to move back losing even more tempo, or trade off the board.",
        "24... Bxe2 25. Qxe2 Rc8": "Trying to get some kind of attack and fend off whites pieces.",
        "26. Qb5": "Move prevents Nd7 even though white could have answered with 26. Ra6 Qb8 and then the bishop can flee.  25...Nd7 (this variation) is much better than what black played though.",
        "26... Ne8 27. Ra6": "Looking to fight black's queen off the board.",
        "27... Qb8 28. Rb1": "Qxb8 loses control of the open b-file.  Rxa5 is also good but this capture of this pawn is inevitable, might as well keep the attack up by threatening Qxb8 Rxb8 29. Rxb8",
        "28... Qxb5 29. Rxb5": "Getting all pieces into battle and preparing to capture a5 to make way for the advancing of whites a-pawn and d-pawn.",
        "29... Nc7": "Mistake by white?  Black now forked whites rooks",
        "30. Rc6": "Problem solved.  Now blacks rook is pinned to the knight as it is the only piece defending it and blacks knight is pinned to c7 because Rxc8+ would win a piece.",
        "30... Bf8 31. Bxf8": "happy to trade off and prepare for the endgame.",
        "31... Kxf8 32. Rxa5": "I must say i missed 32. d6! Nxb5 33. Rxc8+ Ke7 34. axb5 winning a rook.  Or black can sit back and lose the knight.",
        "32... Ke7 33. Ra7": "Now two pieces attacking blacks knight.",
        "33... Kd7": "Black is forced to defend the knight.",
        "34. Rb7": "Now white is preparing to advance the a-pawn as black's pieces are all pinned to one another.  White also has the option of playing d7 which would win a piece.  One continuation to unpin the knight would be 34. Kd8 but either way white could always play 35. R6xc7 Rxc7 36. Rxc7 Kxc7 37. a5 where black would not be able to stop both the a-pawn and the d-pawn from queening.  Here my opponent resigned and besides a couple misses towards the end, white has played a great game in the King's Indian.  Thoughts and comments would be greatly appreciated."
    },
    "url": "https://gameknot.com/annotation.pl/advachess-iv?gm=28661",
    "gameName": "Advachess IV",
    "players": "jwb5400 (1600) vs. oudeis (1483)",
    "opening": "King's Indian (E91), 6.Be2"
}