{
    "moves": {
        "1. d4": "This game is one of my favorites for several reasons.  The first is the fact that I found my longest forced mating line to date (March 2008) in this game, an 18-ply forced mate at move 14 (which ended up being only 9 ply in practice, but the game was over, regardless).  The second is the quick way my attack springs into action in response to several subtle (and not so subtle) errors by my opponent.  The third is due to a fundamental aspect of the game; my opponent's defense crumbles rapidly for positional reasons, mostly due to self-inflicted weaknesses in his pawn-chain.  \r\n\r\nPawn maintenance is increasingly my dominant consideration during play, although I still have pawn chains implode from time to time.\r\n\r\nThe primary lesson to take from this game is one of pawn-structure management. Changes in your pawn structure are not to be made lightly - an entire chain of pawns imploding upon itself\r\nis an ugly sight (I've had this happen to me more often than I care to recall) - and even successful changes mean a long term shift in the positional requirements of future play.  Pawn structure maintenance is increasingly my dominant consideration during play, although I am still pretty pitiful at it. As a general rule of thumb, you should probably ponder over pawn moves at least twice as long as you ponder over a piece move. On another note, let go ahead and disclose to you that I didn't exactly outshine my opponent in pawn play this game - mine leaves quite a lot to be desired, and I probably would have been sunk had my opponent not made a few critical errors.\r\n\r\nAnother lesson to take is one about development. Asymmetrical development can be a weapon - learn how to capitalize on your advantages and use spare tempo to control the pace of the game!\r\n\r\nAll analysis in this annotation have been confirmed (and corrected, where necessary) with Crafty 20.14w32, the multi-threaded version of the Crafty Engine.",
        "1... d5 2. c4 dxc4 3. e4": "The queens gambit is my preferred opening as white, although I'm far from proficient in it.  What little know, I learned from Chris Ward's \"Play the Queens Gambit\" (Everyman).  This is his suggestion for the QGA (ECO:D20).\n",
        "3... e6": "Ward awards this move a \"?!\", for being black's most passive option. I certainly agree that it's passive, although probably not unsound.",
        "4. Nc3 Nc6 5. Nf3 f6": "5 ...f6?!\n\nThis begins the self-inflicted pawn weaknesses, starting with the already weak f-pawn\n\n5 ...Bb4\n5 ...Nf6\n\nboth of which continue normal development, would have been fine.",
        "6. Bxc4 Nge7 7. O-O": "Crafty likes 7. d5 better (although 0-0 is the second choice), followed by\n7 ...exd5 \n8. exd5 Ne5 \n9. Nxe5 fxe5 \n10.Qh5  Ng6 \n11. Bd3 Qf6\n\netc, leading to a wide open tactical battle on the king-side.\n",
        "7... g6 8. Nh4": "8. Nh4?\n\nA mistake on my part. 7 ...g6 called for the immediate 8. d5!, blowing open the center, whereas Nh4? gives up the d4 pawn. My opponent has developed only two pieces to my three, and both of his bishops are hemmed in by pieces, requiring at least three moves to castle to the queenside (the king-side being dubious because of its altered pawn structure). Note the bottleneck that the knight on e7 causes - its choking the mobility out of both the queen on d8 and the bishop on f8.  \n\nIf you see a major log-jam like this in your opponent's camp, always look  for the truly nasty option: pin the piece in place so that the jam cannot be immediately resolved. Your opponent will be tearing his hair out in frustration by the end-game.",
        "8... f5": "8. ...f5?!\nInstead\n8. ...Nxd4!\nnetting a pawn and destroying my center.",
        "9. d5": "Inaccurate, but not necessarily bad. Unfortunately, I fail to take my own advice I outlined above, and don't respond to 8. ...f5 with 9. Bg5!, which would throw a serious spanner in black's future development.\r\n\r\nCrafty also likes Bf4 and exf5 over this move.",
        "9... fxe4": "9. ...fxe4?\n\nOf course this move is a blunder, because it gives up the knight on c6. 9. ...Ne5 or was certainly better, and 9. ...Nxd5 would unjam black's pieces quite nicely.\n\nA larger point, however, is the fact that white's king-side pawns are now critically weakened.  The h5-h8 diagonal is a wonderful avenue to attack, and it is often worth sacrificing a piece in order to achieve access to these squares, especially when you have a lead in development. ",
        "10. dxc6 bxc6": "Black's pawn structure goes from simply bad to complete structural collapse in 3-ply's time.  Black now has two sets of doubled pawns and 4 pawn islands.\n\nThe better option was 10. ...Nxc6, keeping the pawn structure somewhat intact.\n",
        "11. Bg5": "This move heaps more misery onto black's position. Black's dark-bishop can be developed to g7, but the light-bishop is going to need some time before it becomes active; any square it goes to needs at least one pawn moved.",
        "11... Bd7": "Poor. Now black's king is entombed behind his own pieces, with no pawn protection to help defend.\n\nBetter was 11 ...Qxd1, putting black at a heavy disadvantage, but would have taken much of the sting out of white's building attack.",
        "12. Nxe4": "The tsunami mounts; the knight is headed towards the hole at f6, or the hole at c5.  \nCrafty agrees this is the strongest move.\n",
        "12... h6": "11. h6??\n\nThis tiny little pawn move seals black's fate. White has four developed and attacking pieces, whereas black has only one piece developed beyond its original square - where it does more harm blocking his own development than any defensive good! Moreover, it further weakens the only stable black pawns on the board.  White's pieces can now flood into the black camp, unopposed by any pesky defensive pawns, while the black pieces are unable to coordinate because of a lack of space.\n",
        "13. Nxg6": "6. Nxg6!\n\nThis is the strongest reply to 11. ...h6, beginning a powerful attack. \nLook at the holes in black's position, created by to many pawn moves, where my knights have found quite comfortable homes: g6, f6, e5, and c5 are all currently undefended, and my knights have easy access to all of these squares. This is, in fact, just the type of attack knights love to work in, nimbly leaping around defenders who constantly trip over each other, while the bishop on c4 keeps pressure on the isolated e-pawn.\n\nBlack's best here is to give up his queen to stall the attack by a few moves.\n13. Nxg6 Nxg6\n14. Bxd8 Kxd8\n15. Bxe6 Ne5\n16. f4 (etc)\nalthough this is also a hopeless line.\n",
        "13... Rg8": "13. ...Rg8??\n\nI admit this looks superficially tempting, but this is the move that loses the game for black, leading to forced mate.\n",
        "14. Nf6+": "Looking at the position, I was convinced that there had to be a forced mate for white. After several hours of staring at the analysis board, I finally found it - an 18-ply (9-move) mating line. To date, this is the longest forced mate I have found during play.\n\n14. Nf6+  Kf7\n15. Ne5  Kg7\n16. Qh5 Kh8\n17. Bxh6 Qe8\n18. Nf7  Qxf7\n19. Qxf7   Rg7\n20. Bxg7  Bxg7\n21. Qh5  Bh6\n22. Qxh6\n",
        "14... Kf7 15. Ne5+ Kg7 16. Qh5": "16. Qh5!\nThis was the kicker, and the hardest move to decide on during analysis. The placement of the queen here seals the deal; most lines now end in mate.",
        "16... hxg5": "Only other option was 16. ...Kh8, which merely postpones mate for 7 moves.\n16. ...hxg5 does make the final mate much prettier than ...Kh8, however.",
        "17. Qh7+ Kxf6 18. Ng4#": "An unusually ascetically pleasing mate. \n\nThree general rules of thumb: \nDon't move too many pawns during the opening, or you're likely to face a massive attack.\n \nAways consider pawn moves VERY carefully - little pawn moves have huge long term positional, strategic, and tactical ramifications. \n\nUse pawns to deny enemy knights forward positions; use pawns (carefully!) as a prophylactic against knight attacks.  There are few things worse than one (or god forbid two!) knights operating behind your pawn structure, and the more pawn moves you make, the more inroads into your position you open.\n\nThe most important piece of hard-won chess knowledge I've gained thus far is this: always set up a pawn structure you are comfortable with (open or closed) in the first few moves, then develop around this structure. I'm progressively favoring more conservative pawn structures that will defend themselves - the French Defense has become my favorite opening to play as black, since black's pawns require little attention or maintenance. "
    },
    "url": "https://gameknot.com/annotation.pl/afghanistan-1983-http-gameknot-com?gm=14593",
    "gameName": "Afghanistan 1983, http://gameknot.com/",
    "players": "elegy (924) vs. ishadower (1200)",
    "opening": "QGA (D20), 3.e4"
}