{
    "moves": {
        "1. Nf3": "Hi everyone!\n\nThis is the first of two games when I get into a reasonable position with a Master and an Expert and then I end up overplaying my hand.  In this game, Dave apparently walks into a knight fork, but he then showed me that things are not always what they seem.  Dave hit me with an even bigger stinger from the Wicked Witch of the West.  How does this happen?  Well, it is a case of looking at the Gameknot Analysis http://gameknot.com/analyze-board.pl?bd=17205702&fb=1&rnd=0.547893998411963 and the commentary below.  The game starts with the Reti Opening which provides a lot of flexibility to white.",
        "1... c5 2. c4 Nc6": "2. ..... Nc6 - this game has transposed into a Symmetrical English.  I now decided to develop a piece and prepare e5, of which I play next move.",
        "3. Nc3 e5 4. g3 g6 5. Bg2 Bg7": "5. .... Bg7 - both sides fianchetto their kingside bishops.",
        "6. a3 Nge7 7. O-O d6 8. b4 e4 9. Ne1": "9. Ne1 - I should be feeling happy here as I have driven Dave's knight back on the rim and I should have got Henry to safety here as part of the deadly combo that Dave springs later on me does involve Henry.",
        "9... f5 10. Bb2 Be6": "10. ..... Be6 - in hindsight this move should have waited because Fou Leblanc is hanging.  Loose pieces can become a target for combos.",
        "11. d3 exd3 12. exd3": "12. exd3 - Dave solidifies his pawn structure on the queenside.",
        "12... Rb8": "12. ..... Rb8?! Dave gave the following comments to this move.  12 ..... 0-0 was probably better 13 Bf7 may be worth a look 14 Nec6 is probably better and Bxb2 on move 15 gave you better chances.",
        "13. Qd2 Nd4": "13. ...... Nd4 - threatening a knight fork ....",
        "14. Nb5": "14. Nb5! - ..... of which Dave ignores ....",
        "14... Nb3": "14. ...... Nb3?? I execute the fork anyway only to fall into .....",
        "15. Qe2": "15. Qe2!! - now two of my pieces are en prise.  As a little exercise, can you see which two?  Remember LPDO!",
        "15... a6": "15. .... a6 - putting one of Dave's pieces en prise but it doesn't wash.",
        "16. Bxg7 Rg8 17. Rb1": "17. Rb1 - after this move there are just too many black pieces en prise and not enough white!  After a final tot up I saw that there was no way I could avoid being a piece light so I decided there and then to wave the white flag."
    },
    "url": "https://gameknot.com/annotation.pl/ah-dave-anything-i-can-do-you-can-do-better?gm=43091",
    "gameName": "Ah Dave ..... Anything I can do - you can do better!",
    "players": "daverundle (2393) vs. jstevens1 (1799)",
    "opening": "Reti opening (A04)"
}