{
    "moves": {
        "1. e4": "Starting with well-known e5.",
        "1... Nf6": "Alekhine's defence...  Black plays the move in order to entice white's pawns forward so that it weakens white's position and makes targets for black to attack (hypermodern).",
        "2. e5": "White usually starts attacking as soon as he sees Nf6. ",
        "2... Nd5": "Clearly, there are few moves better than this one.\r\n\r\nBeginners tend to play 2...Ne4, which is weak to 3.d4, cutting off all escapes, or 3.d3, gaining plural tempi.\r\n\r\nNevertheless, this move is solid.",
        "3. c4": "White continues the attack.",
        "3... Nb6 4. d4": "White has advanced two central pawns and a flank pawn, with a strong central position. However, white has not developed any minor pieces, and the position may be vulnerable.",
        "4... d6": "Black plans to dissolve white's strong center.",
        "5. exd6 exd6": "5. ... cxd5, in a way, makes more sense with two central against the opponent's one. Personal play style dictates which is chosen.",
        "6. Nf3": "White has developed a minor piece, but now its black's move, with initiative. ",
        "6... Be7 7. Bd3 O-O": "Black castles first, signifying his speed.",
        "8. O-O Bg4": "Black pins the knight, and the d4 pawn is no longer protected.",
        "9. h3": "White drives the invader away.",
        "9... Bh5": "Black decides to continue the pin rather than retreat to e6 or d7.",
        "10. b3": "White decides to place his black-squared bishop in fianchetto, indirectly eyeing the enemy king position from far away.",
        "10... Nc6": "Black decides to attack the unprotected pawn.",
        "11. Bb2": "The bishop is now in fianchetto and guards the pawn.",
        "11... Bf6": "Another attacker develops, and the Bishop is on a more effective square than on e7. Notice how black countered the fianchetto with a bishop on the same diagonal.",
        "12. Be2": "The bishop moves here to stop the pin and provides the queen and the knight as protectors to d4.",
        "12... Re8": "Black takes the e-file while its open.",
        "13. Re1": "White neutralizes black's attack as well.",
        "13... Bxf3": "Although trading a knight for a bishop in a semi-open position is usually bad, this move wins a pawn for black, forcing two of the d4 pawn protectors away.",
        "14. Bxf3 Rxe1+": "More trades...",
        "15. Qxe1 Nxd4": "Black does win a pawn, and white's bishops look weaker than before. The knight can move somewhere else to unveil an attack on white's fianchettoed bishop, can regain the knight:bishop ratio, and can fork the queen and rook.",
        "16. Bxd4 Bxd4 17. Nc3 c6": "It's time for black to get his knight to a more effective square; this move appears to make black's pawn majority more secure. Also, it neutralizes white's other long range bishop.",
        "18. Rd1": "That bishop is menacing white down the long diagonal, with control of the a1 square (indirectly) and the pawn chain on white squares; white needs to deter it.",
        "18... Bxc3": "? Black decides to trade a strong bishop for a lame knight. A bad move. Black's play deteriorates from this point on.",
        "19. Qxc3 Qe7": "Black's position doesn't seem as dominant as before; white may be down a pawn, but can equalise with ease.",
        "20. Qd4": "Threatening 21. Qxd6, winning a pawn.",
        "20... Rd8": "Defending the pawn, although 20. ... d5 would've been simpler.",
        "21. c5": "If 21. ... dxc6, then 22. Qxd8 , with either the loss of the rook or checkmate. However, the knight is attacked, and will now have to move to an inferior square on the back rank to defend the pawn. It will seem as if the knight doesn't exist, giving white a material advantage even when down a pawn.",
        "21... Nc8 22. b4": "When you have more space than your opponent, prove it!",
        "22... d5": "Black is out of trouble... for now... He now has a passed pawn due to the slight edge in material.",
        "23. a4": "White continues to push forward.",
        "23... f6": "Black really is only showing that he has nothing to do... 23. ... Qc7 would be better, allowing the knight to move to a better square.",
        "24. b5": "White decides to put tension in the opposing pawn chains.",
        "24... Qe5": "Black offers a trade of queens.",
        "25. bxc6": "Thus begins a series of trades.",
        "25... Qxd4 26. Rxd4 bxc6 27. Rb4": "White immediately springs into action, threatening 28. Rb7 with decisive control of the seventh or eighth rank.",
        "27... f5": "?? A move that is not considering possible danger... Black really should've played Rd7, probably followed by Ne7, to better his position. Black still has potential if he plays correctly. ",
        "28. Rb8": "The knight is pinned.",
        "28... Kf8": "? A mistake, where moving from the danger rank is more preferable (f7). However, it is a step in the right direction; the King needs to get to c7 to get rid of that rook!",
        "29. Be2": "Now threatening 29. Ba6, winning the knight.",
        "29... Ke8": "Black will be able to defend the knight via d7, but he will still have problems.",
        "30. Ra8": "Now white is attacking a pawn as well.",
        "30... d4": "? Black should worry about his pawn's later (this one is not in danger at all) and move his King toward c7. This move only slows him down!",
        "31. Bd3": "The bishop blocks any possible forward pawn movement, also attacking the pawn on f5.",
        "31... g6": "This move makes sense (it protects the f5 pawn), as to lose his material advantage is to lose the game. If only black didn't waste moves earlier! His King really should be on c7.",
        "32. Kf1": "Now white begins dominance with the white king.",
        "32... h5": "It's only a matter of time for white's king to reach the other side... Black is pretty much waiting to respond to the attack at that time, when he has wasted so much moves.",
        "33. Ke1 Ne7": "?? Black finally does something, although this loses a pawn (and essentially the game). If his king was strategically placed at c7 or b7, white would of lost his rook if he left it there(see its mobility in the current position?), and the bishop would have to stop guarding the pawn ( to prevent Kb7 if Rb8 wasn't played), which could of been promoted with the rook support. What if...\r\n\r\n33. ... Kd7, 34. Rb8, Kc7 35. Rb2, c5. Black would be far better, as the knight could then be moved to protect the passed pawn with drawing, if not winning, potential. If for move 34 white moves his king again (??), moves would follow as such: 34. ... Kc7, 35. Ba6 (to prevent Kb7, saving rook), d3!, with black probably winning, as the king would have to block the pawn on d2, white's pieces tied off ( the rook completely unmovable save the bad exchange Rxc8, with black either deploying the king or rook (not both; one needs to protect the knight). Nevertheless, black has lost his game.",
        "34. Rxa7": "White's a-pawn is now classified as a passed pawn. Black should not have let this move come.",
        "34... Rd5": "Black's game cannot be won, as his knight is completely useless (see how it can't even move closer to the center?). The rest of the game is white using his superior piece placement to promote the pawn.",
        "35. Ra5 f4 36. Bc4 Rg5 37. Kf1 Kf8 38. Ra8+": "White begins harassing the king, and black is soon to realize the trouble of his postion.",
        "38... Kg7 39. Re8 Kf6 40. Rf8+ Ke5 41. a5": "White continues pawn-pushing to victory.\r\n\r\nThis postion appears slightly comical; black's king, rook, and knight are all immobile.",
        "41... d3": "Black is helpless to the passed pawn.",
        "42. a6 f3": "This is the last chance. If White ignores Black's threats (43. a7?? d2!), Black may have hopes. However, with simple capture, white keeps his game easy.",
        "43. Rxf3": "Now if 43. ... d2, then 44. Ke2 eliminates drawing chances. Black needs to play Nc8 then Na7, temporarily stalling the enemy.",
        "43... Kd4": "?? Bad move. Now the promotion is inevitable.",
        "44. a7 Kxc4 45. a8=Q Rxc5": "Black does his best to recuperate under the heavy material disadvantage.",
        "46. Qa4+ Kd5 47. Rxd3+ Ke6 48. Qe4+ Re5 49. Qc4+ Kf6 50. Rd6+ Kf5": "This move lets white force a king and rook fork. (leading to 52. f4 )",
        "51. g4+ Kg5 52. f4+": "Checkmate was to come eventually anyway, so black resigned at this point.\r\n\r\n1-0"
    },
    "url": "https://gameknot.com/annotation.pl/alekhines-defence-and-loss-of-strategy?gm=5231",
    "gameName": "Alekhine's Defence and Loss of Strategy",
    "players": "boydakar (1646) vs. immmmm (1701)",
    "opening": "Alekhine's defence (B02), Steiner variation"
}