{
    "moves": {
        "1. e4 e5": "At the start of this game my opponent was undefeated on GameKnot.",
        "2. Nf3 Nc6 3. d4 exd4 4. Bc4": "The Scotch Gambit.  Here Black has two main moves, transposing into known systems: 1) 4...Nf6 Two Knights Defense, and 2) 4...Bc5 Giuoco Piano.  All other moves are weaker.",
        "4... Bb4+": "The Bishop check nets a pawn, but Black must tread softly on thin ice in order to achieve a tenable position, as there are several possible ways for White to obtain a clear advantage.  The counterattacking Two Knights Defense and solid Giuoco Piano offer Black a much better game.",
        "5. c3 dxc3": "Here 6.O-O is possible, since 6...cxb2 7.Bxb2 gives White the ominous-looking Horwitz Bishops in a Danish Gambit position.  I prefer 6.bxc3 as it only gambits one pawn and forces Black to do something with his b4 Bishop.",
        "6. bxc3": "Black now has several continuations:\n1) 6...Bf8? undevelops the Bishop.  That can't be good.\n2) 6...Be7?? loses material after 7.Qd5 Nh6 8.Bxh6 O-O followed by retreating the Bishop.\n3) 6...Bd6? blocks in Black's own pieces.\n4) 6...Bc5? allows White a clear advantage after 7.Bxf7  Kxf7 8.Qd5  followed by Qxc5, and Black cannot castle.\n5) 6...Ba5 is the only real try, but White gets a strong position after 7.O-O.\n6) 6...Qf6 is an interesting try, but White can force matters with 7.Bg5 Bxc3  8.Kf1! Bxa1 9.Bxf6 Bxf6 10.e5! Bd8 (leaving e7 open for a Knight) 11.Qd5 Nh6.  Although Black is ahead in material with a position that's somewhat difficult to attack, White does enjoy the Queen, better development, and control of the center.  White is slightly better.  I had Fritz 10 play both sides of this position and White eventually won with an accurately-played kingside attack.",
        "6... Bd6": "This move can hardly be recommended, as it interferes with natural development.",
        "7. O-O": "Here the routine 7...Nf6?? drops material after 8.e5 Nxe5 9.Nxe5 Bxe5 10.Re1 and 11.f4.  This convenient tactic is made possible by the poor placement of Black's dark-squared Bishop.",
        "7... Nge7": "A question mark.  The Black Queen is suffocating behind her pieces.  A better try would be 7...Qf6 and then ...Nge7 (similar to the main line of The Scotch Game), since Black is OK after 8.Bg5 Qg6.  Now White gets a powerful initiative!",
        "8. Ng5": "Without a Knight on f6, it's much easier for White to attack the kingside.  Here 8...O-O?? walks into 9.Qh5 h6 10.Nxf7 and huge material losses are inevitable [10...Qe8 leads to checkmate after 11.Nxh6  Kh8 (or 11...Kh7) 12.Nf7  Kg8 13.Qh8#].  Black's next move is forced.",
        "8... Ne5 9. Bb3": "Here Black can try 9...O-O, but White still has strong play after 10.Qh5 h6 11.f4 Ng6 12.Bxf7  Rxf7 13.Nxf7 Kxf7 14.f5!",
        "9... h6 10. f4": "Exclam!  The counter hit on the Black Knight, which forces open the f-file, is the key idea behind White's Ng5 on Move 8.",
        "10... Bc5+ 11. Kh1 hxg5 12. fxe5": "Now the pressure increases on f7.",
        "12... O-O": "Black can take his chances in the center with 12...d5 13.exd5 Ng6 14.Qe2 Qe7, but it might get kind of scary for him after 15.e6!",
        "13. Qh5 Qe8": "Not 13...g6?? because of 14.Qh6 and Black's dark squares are toast.",
        "14. Bxg5 d5": "Black is forced to sac a pawn in order to free his position, since White is threatening 15.Rf4 Ng6 16.Qxg6 winning outright.  Although White is still much better after the obvious 15.exd5, Black can utilize the f5 square and try to reorganize in front of White's advanced pawn center.  Instead White finds a very strong positional move which ties Black up like a pretzel.",
        "15. Rf6": "Alekhine's Block!!  \"The 6th Rank is intimidating.  A piece placed on it brings fear and panic into the enemy's army.\" - S. Tartakower\r\n\r\nThe Rook is immune to capture, since 15...gxf6?? loses to 16.Bxf6 Ng6 17.Qh6 and mate next move.",
        "15... a5": "Attempting to bump the light-squared Bishop off the a2-g8 diagonal with ...a4 and preparing a possible Rook lift to a6.  It's interesting to note that neither player really wants to release tension in the center.  If Black plays ...dxe4 the pin on f7 becomes a problem, whereas exd5 allows Black access to f5.",
        "16. a4": "It's important to keep the light-squared Bishop aiming at f7.",
        "16... Be6": "Defending f7, d5, and the a2-g8 diagonal.",
        "17. Nd2": "Preparing to double Rooks on the f-file.  White also has ideas of bringing the Knight to e4, hitting f6.  Black cannot attempt to swap Bishops with 17...dxe4?? because of 18.Rxe6 fxe6 19.Bxe6  and Black is getting crushed.",
        "17... Qc8": "Threatening to harass the White Queen with ...Bg4.",
        "18. h3 Ng6": "Striking at e5, but losing control of d5.  Now it's actually favorable for White to snap on d5, creating a mobile pawn center.",
        "19. exd5 Bf5": "Stopping Ne4.",
        "20. Rf1": "The last White piece joins the kingside attack with tempo!",
        "20... Bd3 21. d6": "Exclam!  The diagonal is re-opened for business as White offers the exchange for a winning combination.",
        "21... Bxf1": "Black doesn't have much choice.  White was threatening 22.Rxg6 Bxg6 23.Qxg6 followed by checkmate in a few moves.",
        "22. Rxg6 Bxg2+": "The desperado doesn't change anything; Rxg7  is unstoppable.",
        "23. Kxg2 Qf5": "Black threatens mate in two, but hangs his Queen!",
        "24. Rxg7+ Kxg7 25. Bf6+": "1-0\r\n\r\nEven if Black wanted to play on without a Queen, it's still forced mate in five after 25...Qxf6 26.exf6  Kxf6 27.Ne4  Kg7 28.Qg5  Kh7 29.Nf6  Kh8 30.Qh6#."
    },
    "url": "https://gameknot.com/annotation.pl/alekhines-block?gm=420",
    "gameName": "Alekhine's Block",
    "players": "escrimador (1727) vs. magermans (1772)",
    "opening": "Scotch gambit (C44)"
}