{
    "moves": {
        "1. e4 Nf6 2. e5 Nd5 3. d4 d6 4. Nf3": "The main line here is 4 . . . Bg4.",
        "4... dxe5 5. Nxe5 Nd7": "This is an alignment of knights that turns up fairly often in Alekhine's, but here it allows White to upset the apple cart with a sac on f7.  The problem for Black is that if White plays for a win the Black king ends up as the target in a shooting gallery where choosing the best move for Black is difficult, even counter-intuitive, while White's attack almost plays itself.  The key positional features are intense pressure down the c and e files and the weakness of the h1-a8 and h3-c8 diagonals.",
        "6. Nxf7": "I played this with the butterflies you get when you try something for the first time.",
        "6... Kxf7 7. Qh5+": "Things might go better for Black if he could play 7 . . . g6, but he can't since White simply clips the knight on d5 and comes out with a clear advantage:  7 . . . g6 8 Qxe5+ e6 9 Qf3+ Qf6 10 Nd2.  Black's a pawn down with a busted pawn structure.\r\n\r\nEven worse is 7 . . . Kf6 8 Qxd5 e6 9 Qg5+ Kf7 10 Qxd8 Bb4+ 11 c3 Rxd8 12 cxb4.  And worst of all is 7 . . . Kg8 8 Qxd5+ e6 9 Qxe6#.",
        "7... Ke6": "This position occurs often enough to make it worth studying.  An early example was a Fischer-Larsen \"free\" game at Santa Monica in 1966.  Fischer won after 8 Qg4+ Kf7 9 Qh5+ Ke6 10 Qg4+ Kd6? 11 c4 N7f6 12 Qg3+.  Larsen could have taken a draw by repetition, and that's one of the main options here.  The Black king simply wobbles back and forth between e6 and f7.  It doesn't matter whether White's queen checks from e2, g4 or h3.  In all the games I could find with those three moves after Fischer-Larsen, this wobble between e6 and f7 produced a draw.",
        "8. g3": "But White doesn't have to check, and if White doesn't check, Black doesn't get to wobble.  In addition to 8 g3 White has tried 8 c4 N5f6 9 d5+ Kd6 10 Qf7 Ne5 11 Bf4 c5 12 Nc3 a6 which brings us to a parting of the ways:  13 0-0-0? or 13 b4!?.\r\n\r\nDe Firmian tried 13 0-0-0? against Rhode in the 1989 U. S. Championship but got blown up by 13 . . . g6 14 Bxe5+ Kxe5 15 d6 Bh6+ 16 Kc2 Qe8.  This disaster was repeated in Rozentalis-Sokolov (Bern 1992) and Rublevsky-Hauchard (Akham 1992).  Enders-Teschke (Neubrandenburg 1998) tried to improve the line with 16 f4+ Bxf4+ 17 Kb1 and survived the opening, losing in 54 moves.  And finally there was Ivanukh-Shpagin (Kharkov Matskevich Memorial 2009) where we have 16 Kb1 Rf8 17 Re1+ (17 . . . Qxe7!?) Kxd6 18 Rd1+ Kc7 19 Rxd8 Rxf7, 0-1.  True, Smistik-Vyskocil (Brno Trade 2004) produced a draw, but only because Vyskocil failed to find the best answer to 16 Kc2, playing 16 . . . Qf8?! instead of the stronger 16 . . . Qe8.  Finally, de Firmian gives 13 0-0-0 g6 14 Re1 Bh6 \"winning,\" so apparently 14 Re1 isn't the answer, either.\r\n\r\n13 b4! presents Black with the problem of how to keep White from peeling the cover off his king.  According to de Firmian (citing Keres) 13 . . . cxb4 14 c5+ Kxc5 14 Na4+ Kd6 16 Nb2 gives White an advantage.  And he finds fault with 13 . . . b6 14 Rb1 g6 15 bxc5+ bxc5 16 Rb7!.  Defending the c pawn with the queen doesn't appear optimal, either:  13 . . . Qc7 14 Na4!? cxb4 15 c5+ Kd7 16 Qe6+ with an edge for White.  Instead, de Firmian recommends 13  . . . Qb6! 14 Rc1 Qxb4 15 Bd3 (unclear).\r\n\r\nMy problem with the 8 c4 line was exactly this lack of clarity.  The position after 13 0-0-0 obviously favors Black unless and until a major improvement is found for White.  So the best White seemed able to hope for is a precarious balance between his initiative and Black's extra piece in the 13 b4 line.  But is it?\r\n\r\nAfter 13 b4! Qb6 14 Rc1 Qxb4 15 Bd3 White is one move away from bringing his last heavy piece to bear.  Black, on the other hand, has a knight pinned on e5 and defended only by his king.  His queen has been diverted to b4, and his rooks and dark-square bishop are out of play.  And it turns out he has no adequate move because the White bishop on f4 can't be deflected, breaking the absolute pin on the Black knight:  15 . . . g5 16 Bg3 h5 17 0-0 h4 18 Bxe5+ Kxe5 19 f4+ and we've reached the stage where Black has only three possible moves, one (19 . . . Kd4) leading to a forced mate.\r\n\r\nThe verdict:  8 c4 is not only playable, but it's Black who needs to find an improvement as long as White sticks to the 13 b4! line.",
        "8... g6": "This may be the losing move, leading to a forced variation that's clearly in White's favor.\r\n\r\nFluvia Poyatos-Aloma Vidal (Andorra 2008) was a win for Black after 8 . . . N7f6 9 Bh3+ Kd6 10 Qe5+ Kc6 11 Bg2!? b5 12 a4 b4, but a closer look suggests White has at least compensation for the knight.  The key is the pin on the h1-a8 diagonal, so White rejected the exchange of bishops on c8 in favor of pressure against the knight on d4 (11 Bg2!?).  Black can temporarily prevent c4 with 11 . . . b5, but that exposes the undefended rook on a8.  The game continued 13 c4 bxc3 14 bxc3 Ba6 and it's clear Black's in trouble; but White slipped with 15 Nd2? (15 c4! Bxc4 16 Nd2 Ba6 17 Ba3 with an advantage) e6  16 c4 Bb4? (It's essential to defend the pawn on e6, so 16 . . . Qe8 =, or even 16 . . . Qd6).  White now missed a win with 17 Qxe6+, and lost after 17 Ba3 Bxa3 18 Qxe6+ Qd6 19 cxd5+ Kb6 20 Rxa3?? Rae8 21 a5+ Kb7, 0-1.\r\n\r\nThe most popular continuation appears to be 8 . . . b5 9 a4 c6 (9 . . . b4!?).  Yemelin-Popov (St. Petersburg 2005) continued 10 Bh3+ Kd6 11 Nc3 b4 12 Nxd5?! (12 Bf4+!) cxd5 13 c4? when White had frittered away his advantage and Black went on to win.  In Ernst-Komarov (Dortmund 1992) White had a slight edge after 10 axb5 g6 11 Qe2+ Kf7 12 bxc6 and won in 60 moves.",
        "9. Bh3+": "The game position was reached in Berelovich-Neverov (Golden Cleopatra 1999) that also continued 9 Bh3+ Kd6 10 Qe2.  We've already seen the potential weakness along the h1-a8 diagonal, but the exchange of Black's d and f pawns has left gaping holes on e5 and e6, and this game quickly becomes a fight for control of the e5 square.",
        "9... Kd6": "Black is once again forced to leave his king in the center, since fleeing to f6 or f7 once again drops the knight and leaves the king exposed. ",
        "10. Qe2": "The obvious threat is 11 Qe6#.",
        "10... e5": "Best, blocking the e file and preventing Bf4+.  Neverov played the weaker 10 . . . N7b6 11 Bf4+ Kc6 12 a4 a6 13 Bg2 e6, a sequence in which all of Black's moves are forced and White's appear to be best, giving White a solid, probably winning, advantage.  Then came 14 Be5 (14 c4!?) Bd6 15 Bxh8?!  Here, winning the exchange is not best; the thematic 15 a5 is the killer, threatening to undermine the knight on d5 by winning the knight on b6.  If the b6 knight retreats it blocks d7, leaving the Black king without a move, and 15 . . . Rf8 16 0-0 Kd7 17 axb6 should also be fatal.  But after 15 Bxh8 Black, instead of being crushed held on and escaped with a draw.  10 . . . c6 11 c4 Qa5+ 12 Bd2 Qa6 13 cxd5 is only slightly better than 10 . . . N7b6, and 10 . . . N7f6 11 Bf4+ e5 12 Bxe5+ appears to be much worse.\r\n\r\n",
        "11. c4": "The only move that holds the initiative.  Black has several problems:  his exposed king, the pressure on e5, the weakness of the h1-a8 and h3-c8 diagonals, and his entangled minor pieces on d5, d7 and c8.  That effectively rules out undermining e5 with 11 Bxd7, since if the focus shifts to the long white diagonal the Bishop will be priceless and Black's congestion won't be easily relieved.  The same goes for 11 Nc3 Nxc3, since Black gets to exchange off a potential target for a potent attacker, perhaps leaving him with a very slight edge after 12 gxc3 Qf6.  11 Na3 avoids the exchange but leads to very little after, say, 11 . . . c6 12 c4 12 Nb4 13 dxe5+ Kc7.   Finally, passive moves such as 11 Bg2 exd4 12 0-0 and 11 0-0 exd4 12 c4 appear to lead to equality after Black returns the piece.",
        "11... Bg7": "The knight should be returned, but 11 . . . c5 12 cxd5 cxd4 13 Nd2 Nc5 14 Bg2 Kc7 is probably the best way to do it because it allows Black to exchange the c pawn on d4 instead of the e pawn, which continues to prevent Bf4+.  It's hard for Black to find the right path because untangling his pieces and defending e5 are such high priorities.  For instance, 11 . . . Bg7 defends e5 and even threatens counter play down the e file with 12 . . .Re8 and 13 . . . cxd4; but it also allows the bishop check on f4.",
        "12. cxd5": "It's also possible to secure the White king by something along the lines of 12 0-0 Re8 13 cxd5 exd4 14 Bf4+ Ne5 15 Bxc8 Rxc8 16 Nd2.  I went with 12 cxd5 because the counter play based on 12 . . . Re8 is an illusion, thwarted by the weakness of e5 and the check with Bf4 the moment Black plays exd4.  The White knight will follow the bishop, coming from b1-c3-e4 with check, blocking the e file.",
        "12... Re8": "This is a mistake because it does nothing to untangle Black's minor pieces and counter the pressure from the White bishop on h3.  Black should have tried 12 . . . Nb6 13 Bxc8 Qxc8 14 Nc3 Qf5.",
        "13. Nc3 exd4": "There's no turning back.  Slightly worse are attempts to spirit the king away to g8 or open a bolt-hole with 13 . . . c6.",
        "14. Bf4+ Re5": "The dismal fate of the rook underscores the fact that Black's e-file counter play was a mirage.  Unfortunately for the rook, this is easily the best move Black has:  14 . . . Kc5 leads to a forced mate after 15 b4+ Kxb4 16 Be6 Rxe6 17 dxe6 d3 18 Qb2+; 14 . . . Ne5 fails against 15 Ne4+ Ke7 16 Bg5+; and 14 . . . Be5 is undone by 15 Nb5+ Ke7 16 Bxd7 Bxd7 17 Bxe5 Kf8 18 Nxc7.",
        "15. Ne4+": "Once again, the timid 15 0-0 isn't even an option, but 15 Bxe5+ is also very strong.  My thinking through all of this was to push the initiative as hard as possible while stifling any chance of counter play.  Black now has only two moves, each of them bad.",
        "15... Ke7": "This seems the better try.  15 . . . Kxd5 gets crushed by 16 Bxe5 Nxe5 17 0-0-0 d3 18 Rxd3+ Nxd3 19 Qxd3+ Bd4 (the alternatives are 19 . . . Kc6 20 Qc4+ Kb6 21 Qb4+ Kc6 22 Qc5# and 19 . . . Ke5 20 f4#) 20 Qb3+ when 20 . . . Kxe4 and 20 . . . Ke5 lead to forced mates, and 20  . . . Kc6 21 Qc4+ holds out no hope at all.",
        "16. Bxd7": "Objectively strongest, but 16 0-0, securing the king and bringing the rook into play was a viable option.  The straightforward 16 Bxe5 was also winning for White.  The added umph from 16 Bxd7 is the weakening of e5 and giving access to c5 to the White knight.",
        "16... Kxd7": "This is hard to understand.  Black can't save himself, but 16 . . . Qxd7 17 Bxe5 Bxe5 18 f4 Qxd5 19 Nf2 Qa5+ 20 Kd1 puts up a lot more fight.",
        "17. Bxe5": "17 Nc5+ gets to the same place.",
        "17... Bxe5 18. Nc5+": "The game's as good as over.  Black's only the exchange down, but he still can't untangle his pieces.  For instance, after 18 . . . Kd6 the Black bishop will still be tied to c8 in view of the threat of Nxb7+.  White, on the other hand, needs only a few moves to bring his rooks into the attack against the exposed Black king.",
        "18... Kd6 19. Rc1": "The first rook joins the fray.",
        "19... c6 20. O-O": "The second rook is on its way.",
        "20... Qf8": "Not the most accurate, but it hardly matters.",
        "21. Rfe1 Qf5": "White trudges onward looking for the clearest path to the win.  The plan isn't hard to find:  eliminate his single weakness (the p at d5) and attack a piece Black can't defend (the bishop on e5).  Objectively, this may not be the strongest continuation (22 Qc4 or even 22 f4), but clarity is sometimes more important than theoretical strength.",
        "22. dxc6": "Stage one.",
        "22... bxc6 23. Nd3": "Stage two.",
        "23... Bf6": "We arrive at another spot where theory and clarity collide.  Given omniscience, I'd have played 24 Qe8! instead of 24 Rc5!?",
        "24. Rc5": "However, clarity is eminently practical.  ",
        "24... Bd7 25. Rxf5 Bxf5 26. Qf3 Rd8 27. Qf4+ Kd7 28. Nc5+": "Black can't escape mate:  29 . . . Kc8 30 Na6+ Kb7 31 Qc7+ Kxa6 32 Qxc6+ Ka5 33 Rc1 Be7 34 Qc7+.  "
    },
    "url": "https://gameknot.com/annotation.pl/alekhines-defence?gm=34217",
    "gameName": "Alekhine's Defence",
    "players": "eddieleggs (2152) vs. darthlio (1975)",
    "opening": "Alekhine's defence (B04), modern, Larsen variation"
}