{
    "moves": {
        "1. e4 c5": "Again with the Sicilian. I'm trying to work out my dislike of this defense, so I keep masochistically playing it. Not that it's bad; quite the contrary. It's just a personal thing I guess. Side note: why have I played black in 67% of my games?",
        "2. d4 cxd4 3. Qxd4 Nc6": "Center Game, and not white's best line. So far on GK I have played 12 games as black and seen this opening (at least the first 3 moves) by white twice. I now gain a tempo developing a knight that attacks the white queen.",
        "4. Qd1 Nf6": "After white retreated all the way home, I've now developed two pieces to her none, and our control of the center seems fairly even.",
        "5. Bc4 Nxe4": "Left the e4 pawn hanging. I feared an opening trap of some kind, but the only one I see can be easily refuted.",
        "6. Qd5 Nd6": "White played what I expected and I played my only move that saves the knight and avoids instant checkmate.",
        "7. Na3 Nb4": "Hoping white will keep up her attack on f7 by playing 7. Qh5, allowing me to win a pawn and the exchange with 7. ... Nxc4, 8 Nxc4 Nxc2 . Hope chess? Maybe, but white had demonstrated an eagerness to hit me at f7 so I thought it reasonable to expect she might continue. Even so, attacking the queen with the eventual threat of Nxc2  still seems a worthy move no matter how white responds.",
        "8. Qc5 Nxc4": "Now white cannot capture by 9. Nxc4? because of 9. ... Nxc2 . ",
        "9. Qxc4 e5": "Defends my knight and advances into the center.",
        "10. Nf3 Nc6": "I considered several dfenses of the pawn, but f3 limits my queen's freedom and weakens my kingside castle, d3 loses my knight by removing the bishop's protection, Bd6 blocks my d-pawn and seems a precarious perch for the bishop with no ready defenders save for my queen, and Qe2 blocks my bishop. Qf3 might have been OK, but white would gain a tempo with Bg5. So, I retreat the knight to a safer square, but it still feels like a retreat.",
        "11. Ng5 d5": "See? I knew white had a singular atraction to my pawn at f7. It's easy enough to shut out the white queen now, with a gain of tempo and a more imposing center.",
        "12. Qh4 Be7": "White voluntarily pinned her queen behind her knight. My bishop move removes white's option to play Nf3 and clears the way for me to castle, though I'm not yet sure that castling king-side is safe (obviously not right away, with Qxh7  , so first I would deal with that, then figure out if castling is safe).",
        "13. f4 Bxg5": "Dangit, I don't want that pawn sitting there unmolested, nor do I want to break up my center just yet, not when white offered me a passed pawn.",
        "14. fxg5 Bf5": "Mmmmm, passed pawns, the stuff of fortune and fame. My bishop move is designed to strand the knight on a3 to defense, even if only momentarily, but more importantly, I cover h7 and g6 too.",
        "15. O-O Be4": "Maybe Bg6 would be safer, but this central poisition is unassailable for now and puts pressure on white's kingside while still holding down white's knight and covring my own kingside pawns.",
        "16. Qh5 O-O": "Again with the f7? White is single-minded in her assault on f7. But, now castling is safe, and the pawn at f7 is snug as a rug with that rook backing him up.",
        "17. Qg4 Nd4": "Not sure what white was trying for with Qg4. Seeing no more threats, I press forward and go pawn hunting. I expect 18. c3 to save the pawn for good, after which I plan to play 18. ... Ne6.",
        "18. h4 Nxc2": "Aha, now I see. White's plan is to get more pawns into her assault, so her prvious move 17. Qg4 was to get out of the way. But she left a hanging pawn, leaving me up by two pawns and with a pair of adjacent passed pawns in the center, and now white must play Nxc2 or lose at least the exchange.",
        "19. Nxc2 Bxc2 20. g6 Bxg6": "White's plan was well-intended, but she overlooked the fact that I have kept my bishop on this very diagonal since my 14th move for just this reason (thought I thought it was a prevention, not a cure).",
        "21. Bg5 Qb6+": "I could block by 21. ... f6 but my king is bottled up tight, so I figured why not claim one more pawn, since I haven't yet had my fill.",
        "22. Rf2 Rac8 23. Qe2 Rc2": "Hehe, white forgot about the long diagonal on her 20th move, might she forget about it again? After she gets her queen to safety, I have my rook and my queen bearing down on her pinned rook at f2. This limits the options for the queen. If white does retreat the queen, say by 24. Qf1 then I am quite willing to liquidate with 24. ... Qxf8  25. Qxf8 Rxf8, 26. Kxf8, leaving us each with one rook and one bishop, but black has the three pawn lead and those adjacent passed pawns in the center.",
        "24. Bd2 Rxb2": "Free pawns. White's 24. Bd2 prevented the liquidation, but also left the b2 pawn hanging. Now white's bishop is pinned to the queen, and her rook is pinned to the king, but I don't see any good way to immediately exploit that. I am considering advancing the e-pawn going for the fork on e6, but white could then just play Qxe6, which allows me to follow through with my liquidation plans, but at the cost of a pawn.",
        "25. Kh2 Qd4": "To pressure the bishop - it's well defended, but it is pinned and pressure is good. I'm seeing some interesting combinations that involve liquidating a few white pieces, and with my material advantage and two eager center pawns itching for promotion, I would love to liquidate. Very much.",
        "26. Rd1 Qxh4+": "White threatened a discover attack that didn't really change much. If I allowed 27. Be3 I could simply respond with Rxe2, 28. Bxd4 Rxf2, 29. Bxf2 and I've accomplished the better half of my liquidation plans. But I might have better, so I try something different.",
        "27. Kg1 f6": "Defending my center.",
        "28. g3 Qxg3+": "I think the tragic loss of all her pawn personnel has driven white a little stir-crazy. 28. g3 just feeds me more pawns. It's like an all-you-can-eat pawn buffet. I'm already stuffed! I can't recall ever playing a game in which either side had a 6-pawn lead (all pawns, the bigger pieces are dead even).",
        "29. Rg2 Qh4": "My cunning plan is 30 ... Bh5, working on my liquidation efforts and winning the exchange in the process.",
        "30. Rg4 Bh5": "But white offered me something better. Now 31. Rxh4 Bxe2 and now white cannot save the rook at d1 and the bishop at d2, except for 32. Bc3 Bxd1, 33. Bxb2 and I have accomplished the lion's share of my liquidation.",
        "31. Rxg7+ Kxg7": "White has no followup, so I'll take the sacrifice.",
        "32. Qg2+ Qg4": "And now we trade queens. This kind of liquidation, the kind where I gain material, is my favorite kind.",
        "33. Qxg4+ Bxg4 34. Rc1 Rxd2": "Oops, had to move the bishop first, it was en prise.",
        "35. Rc7+ Rf7": "And now white's had enough."
    },
    "url": "https://gameknot.com/annotation.pl/all-you-can-eat-pawn-buffet?gm=21009",
    "gameName": "All You Can Eat Pawn Buffet",
    "players": "braeburn (1188) vs. blake84120 (1414)",
    "opening": "Sicilian (B21), Andreaschek gambit"
}