{
    "moves": {
        "1. e4 c5": "I never play the sicilian. It is too studied, too played. I don't study, so... \nAnyway: I am a little tired of the Scandinavian. I know that my system can be beaten, so it's time to explore new sets. ",
        "2. Nc3": "A self-blocking move, but this is my opinion. I know it is perfectly playable.\nI like to leave the c pawn free, it's a free center-controlling outpost. ",
        "2... e6 3. f4": "It gets interesting! The f pawn is delicate. From my \"advanced c pawn\" perspective it is not easy to attack. My lsb fianchettoed would be ok, but then I am supposed to castle kingside... leaving him facilities to attack it. And queenside castling doesn't sound good. So the game looks interesting at once. ",
        "3... d5": "If he exchanges, his king gets a little exposed, not mine. I think about d5, of course.",
        "4. e5": "Getting a good \"squeezing outpost\" on the center, but leaving wide open my play on the great light diagonal! \nAnd trhowing away the possible f5. Kingside gets somewhat \"blocked\", unless he plays, in the future, g4 (hmmmm!)",
        "4... a6": "Necessary. If d5 at once, the knight jumps \"looking at d6, a place I don't want it to get. The black's dsb has a good spot in b5, I don't want to leave holes so early in my position. ",
        "5. Nf3": "If d5, Ne4, aiming to d6. \nI have the \"problem\" to develop my kingside, as always in the scheme I am playing. \nBut, since I plan to fiachetto the lsb... why don't go for a pawn storm on the queenside and starting worrying him? \nI want to take advantage of the uneasy position of the knight c3.",
        "5... b5": "Now, once I have covered the white squares a4 and b5, I can push d4! and the knight has to retire. Ok, it is not a great plan, since he can retire it and use it for a kingside attack. But he has to go for it, and I will have time to defend or go ahead with my attack. ",
        "6. d4": "Veeeerrry tempting: c4! Then Bd7 (he blocked the diagonal for my fianchetto), and b4! What a lot of space!\n\nOk, now think a moment: not a single piece developed. I recall a game someone won without moving a single piece, only pawns... but hey, stay calm. \n\ncxd keeps the possibility of a clearance of the white diagonal. But I will be seeing too many white pieces around... so I decided to play the thematic (but not in this order)...",
        "6... Qb6": "Now he cannot take (Bxc4 is good for me, since Na4 is not possible) and I threat to take it then Bc4. So he must play...",
        "7. Be3": "I am not worried (as thematic in this scheme), since he cannot easily put another piece attacking c5. \nEven starting with a sicilian, I am playing in a kind of familiar scheme (Scandinavian with 2. e5). I don't like my white bishop is inside (I like this position with the bishop in f5, even if it get exchanged with the white knight).\nBut It looks good, specially because white seems too in a hurry to attack the kingside. ",
        "7... Bd7": "Going on with my b4 plan!",
        "8. dxc5": "The best, trying to exchange dsbs and loosen my only attack line (besides b4)",
        "8... Bxc5 9. Bxc5 Qxc5": "Now the developement is equal :-)",
        "10. Qd4": "If I exchange, it won't be equal. No, sir, I don't like to exchange my only active piece leaving two nice knights to you (even if one will retire soon)",
        "10... Qc7": "Looking to a5. ",
        "11. a3": "AAAAAHHHHH, he DID consider b4! Ok, I like this. We understand each other. \nOk. \nI had directly Qa4, or the normal Ne7. \nI don't know exactly why, I played the \"other\" normal one. ",
        "11... Nc6": "I thought: since there is no b4, there is no use to leave the bishop covering b5-a4, so it is better to develop with tempo before I get really behind.\nOk, but his queen can go to...",
        "12. Qc5": "...creating tension. Hmmm... what is this crazy queen doing there? I cannot throw it away so easily... I should have though about it before. \nOn the other side: am I in danger? Of what? A sac in b5, maybe...?",
        "12... Nge7 13. Bxb5": "Oh, yes! A sac! Wonderful!\nWith the lsb OUTSIDE, this sac is dangerous, but not now. Oh, yes, he wants me to take it to have his knight in b5, then d6... it LOOKS strong, indeed.",
        "13... axb5 14. Nxb5 Qa5+": "...but I had this move in my sleeve. \nIf b4, Nxb4, since he cannot take because the a column is still mine... \nShould he have castled before, that would have been another story :-)))",
        "15. c3": "I was SO tempted by Rb8... But Nd6+, Kf8 is not wise to allow. ",
        "15... O-O": "NOw, the knight in d6 (if he can reach it), is not so frightening. \nI was SURE he would have played o-o. \nProbably I would have had, then, Nxe5 (threatening to recover the piece with Bxb5, no matter white threat on Ne7, because of BxRf8... I don't know, I don't have time to look it). But he surprised me. ",
        "16. Kd2": "... ?\nWhy? Anyway, this move was the key to his defeat. The king is exposed, there, allowing me a good countergame.",
        "16... Rab8 17. a4 Rfc8": "What nice rooks...",
        "18. Qd6": "Time to start thinking in \"back sac\". \nAfter moves like RxNb5, or Nf5, the supposed aggressives Qxd7 or axb5 make white lose (sorry, no time to show it). But passive defence seem enough for white to survive with advantage.\nThe wise one would have been Rb7, of course, holding the position. ",
        "18... Nf5": "What the hell, let's have fun and go for it... these are my last games for a good while, so...",
        "19. Qxd7": "The aggressive move. I'm sure he didn't expect the next!",
        "19... Ncd4": "What? Am I throwing away my pieces? \nYou see: he cannot take it with the pawn since it is pinned, and he cannot with the knight, since Rxb2+ is very dangerous for him, since Qxc3 follows, with devastating effects. ",
        "20. Nfxd4 Nxd4": "Same story as before, as predicted. I am a little proud of having seen it before.",
        "21. Ra3": "AAAAAAHHHHHH.... ok, now he understood. Well. \nNow what? -2 in material... hmmmm...\nRc7, if he NxR, Rxb2+. It it still \"mortal\"? Hm..... not sure.\nWell, it was brilliant, but now what?\nThe funny thing: I fight to be the one who sacrifice. I cannot leave my opponent to sac, my honour will suffer :-D (joking, of course)",
        "21... Nxb5": "Sgniff... all my attak dreams are almost over...",
        "22. axb5 Qb6": "He sure expected Qxb5... but then, I had no tricks anymore but a slow death by pawns intoxication... no no, I don't like it.",
        "23. Ra7": "Fans of mine: don't worry, everything is under control. \nI MUST take some advantage of this exposed king!\nNo, I won't play the \"normal\" Rf8, in order to prevent Qxf7+. Tempoes are VERY precious.",
        "23... Qf2+ 24. Kd3 Qxf4": "Covering f7. And I can take e5, if I want.\n\nBut now, he will become a real threat with b6 (I cannot take it!)",
        "25. Re1": "Qc4+ is pointless... goodlooking but pointless.",
        "25... Rcd8": "The key is in advancing the d pawn. It must be, at least (glups!).",
        "26. Qc6": "I MUST take some advantage of the fact his queen is exposed to my roooks... but how? Maybe Rb-c8. My two rooks will be well placed to go d4 etc. Yes, yes, maybe is there something...\n\nNow wait! What happens if he plays Rc7? Wow, I cannot chase that queen as I want forever, after all. \n\nHmmm.... hm... (I really spent a lot of time before I realized that if he did, I will win material with Qc4+ because after QxQ, dxQ+ (!), K moves and RxR...)\n\nNice, so I can play it. Let's go!",
        "26... Rbc8": "If it goes to b7, I d4! Just to scare him a little. \n",
        "27. Rc7": "I cannot believe. He fell into this trap. I'm really SORRY!\nI wanted to go on with this game! I wanted to see how it would have ended!\n\nI'm sorry for you, SadLad, you deserved more! ",
        "27... Qc4+": "He realized, and very honorously he resigned. "
    },
    "url": "https://gameknot.com/annotation.pl/almost-a-sicilian-won-by-blunder?gm=32151",
    "gameName": "\"Almost a sicilian\". Won by blunder.",
    "players": "sad1lad (1731) vs. damalfi (1748)",
    "opening": "Sicilian (B23), closed, Korchnoi variation"
}