{
    "moves": {
        "1. e4 c5": "Team match, started Feb 9, ended May 7. I'm playing black and I go with the much more familiar Sicilian.",
        "2. Nf3 d6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 a6": "Najdorf.",
        "6. Bg5 e6 7. Bc4 Be7 8. Qf3 Qa5": "This feels like a weird move. But it puts the white bishop, way over on g5, en prise, and it pins the white knight on c3, too.",
        "9. O-O Qc5": "White castled, leaving his bishop en prise for black to take at his leisure. I think I may have overlooked the free bishop here - who expects such a thing, when it's been four or five days since I last saw this board? Instead, black attacks the other white bishop and the white knight on d4, effectively forking three pieces.",
        "10. Qd3 b5": "White defends the LSB, still leaving the DSB en prise. I think I missed the free piece a second time, but as long as black keeps attacking, white doesn't have time to save everything. Although, right now, 11. Bxb4+ looks like it holds onto most of white's material.",
        "11. Bb3 Qxg5": "Finally... Sheeesh!",
        "12. Nf3 Qc5 13. Rad1 Bb7 14. a3 Nc6": "Just developing now.",
        "15. Ng5 Ne5": "Attacking white's queen.",
        "16. Qh3 Nc4": "Practically forcing white to exchange, favorable to black with his material lead. But the move exposes a discovered attack against the knight on g5.",
        "17. Bxc4 bxc4": "Take the bishop, or take the knight? Not sure which was preferable here, but both players forgot about g5 once this game, maybe it could happen again?",
        "18. Nxe6 fxe6": "Gotta give 18. Nxe6? a question mark, trading a knight for a pawn. The reply is obvious, recapturing with the f-pawn, but the fact that the pawn is now perfectly safe on e6, despite being en prise by white's queen, is not immediately obvious.",
        "19. Qxe6 Bc8": "And 19. Qxe6?? gets two question marks, and black is quick to demonstrate why. Always have a way out. White's queen forgets this rule and sells herself cheap, for the price of a bishop+pawn (20. Rxd6? looks like a way to gain an extra pawn out of the queen's death, but after 20. ... Bxe6 21. Rxe6 Kf7, the rook has nowhere to run and must give up the exchange). So white has to settle for just the pawns already captured on e6, trading queen+knight for bishop+two pawns. Instead, white resigns. Almost 13 weeks to play a 19 move game. I've only been with GameKnot for 6 months, and I'm still not used to playing at this pace."
    },
    "url": "https://gameknot.com/annotation.pl/always-have-a-way-out?gm=23725",
    "gameName": "Always Have a Way Out",
    "players": "amateurke (1535) vs. blake84120 (1977)",
    "opening": "Sicilian (B95), Najdorf, 6...e6"
}