{
    "moves": {
        "1. e4": "This is my first gameknot game against someone rated 1800 , in my very first mini-tournament.",
        "1... e5 2. Nc3": "I've been playing the Vienna Gambit as white, with a lot of success, since people\nplay exf4, which gives white a great position (lots of development for the pawn).",
        "2... Bc5": "Minor disappointment.",
        "3. Bc4 Nf6 4. d3 Nc6 5. f4": "My idea here is to expand on the kingside, drive the knight away, and attack with both\nbishops, queen, and maybe the rook.",
        "5... d6 6. f5 Na5 7. Qf3": "Maybe this isn't the greatest plan, since without that light-square bishop, the kingside\nattack isn't looking as great.",
        "7... Nxc4 8. dxc4 c6 9. g4": "Going for the kingside attack anyway!",
        "9... g6 10. g5 Nh5 11. Nge2": "Now everything is still defended adequately, as black doesn't have a breakthrough for white's\nextended kingside.  My idea is Ng3, opening the h-file for attack.",
        "11... a6": "?  Too slow, maybe.",
        "12. Ng3 Nxg3 13. hxg3 b5 14. b3": "Why do this?  White has doubled pawns already, do I want a second set?  Well, here, I think\nI do.  Doubled pawns can be weak in the endgame, but this opens a line for the other\nrook to attack!",
        "14... bxc4 15. bxc4 Bd4": "Pins the knight, which is defended by the queen. BxN, QxB, PxP, PxP, BxP is good for\nblack, so I defend the f5 pawn again.",
        "16. g4 Qa5": "Menacing and pinning the knight, but this is easily met by...",
        "17. Bd2": "Bd2, where the queen must move again in view of moves like Ne2.  Qa5 may not have\nbeen good, since it allowed white to develop a piece, losing a tempo for black.",
        "17... Qc7 18. Rb1": "Grabbing the open file, and freeing the knight to move.",
        "18... Bb7": "There is nowhere good for the bishop to go, but this works out poorly, as the queen is\ntied to the Bb7's defense.",
        "19. Rh3": "Here we go with the plan -- double on the h-file and demolish the kingside.  Many responses\nfor black look inadequate, such as f6 and 0-0.",
        "19... O-O-O": "This also works out poorly; maybe Kd2 was better?",
        "20. Qh1": "The h7 pawn is a goner.",
        "20... d5": "Black's got to counterattack to have a chance.",
        "21. Rxh7 Rxh7 22. Qxh7 gxf5": "?  This allows a combination by white.  However, if black had allowed fxg6, that looks\nunpleasant too.",
        "23. Qxf5+": "Better than exf5 or gxf5.",
        "23... Kb8": "Stepping into the pin by the rook.",
        "24. Ne2": "If I can get the e5 pawn to take on d4, Bf4 is crushing.",
        "24... dxc4": "Well, it doesn't look like there's anything better.",
        "25. Nxd4 exd4": "??????  Definitely the losing move.  Bf4 is more than black can stand.",
        "26. Bf4 Rd6": "Now Bxd6 Qxd6 Qxf7 Qg3  gives black drawing chances, but there's no good response to...",
        "27. Qe5": "Qe5, winning the rook outright, and hence the game.",
        "27... Rd7": "Hoping for Qxc7, but it is not to be...",
        "28. Qe8+": "The Queen is lost, and black resigns."
    },
    "url": "https://gameknot.com/annotation.pl/alygallys-mini-tournament?gm=44",
    "gameName": "alygally's mini-tournament",
    "players": "ethansiegel (1740) vs. alygally (1802)",
    "opening": "Vienna game (C25)"
}