{
    "moves": {
        "1. e4": "This is my favorite game from the first round of my first mini-tournament at GameKnot.  My rating is substantially higher now.  I always play 1. e4 as my first move, and this game is no exception...",
        "1... c5": "He chooses the sicilian defense, which I'm comfortable playing against.",
        "2. Nf3 d6": "Sicilian dragon.  I play the yugoslav attack against this (old variation) if I can -- I'm a firm believer that you should have one favorite line and study it well, and should play to your strengths.",
        "3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 g6": "I prefer playing against 5. ... g6 as opposed to the Najdorf, 5. ... a6, so I was happy to see this.",
        "6. Be3 Bg7 7. f3": "Standard book opening thus far.  7. f3 is the defining move of the Yugoslav attack.  Alternatives include Be2, Qd2, Bc4, and the very aggressive f4.",
        "7... O-O 8. Qd2 Nc6 9. O-O-O": "9. 0-0-0 is an older move and is currently out-of-fashion at top level, as most players prefer 9. Bc4 to prevent d5 as a black response.",
        "9... d5": "As expected -- however, in my experience, this is roughly equal, and perhaps still (slightly) advantageous for white.",
        "10. exd5": "Let the exchanges begin...",
        "10... Nxd5 11. Nxc6": "Better than Nxd5.",
        "11... bxc6 12. Bd4": "Better than 12. Bh6, which can be met by a capture on c3.  Also playable is Nxd5, but I like the idea of exchanging these bishops first.",
        "12... Bxd4 13. Qxd4": "This appears to be the critical moment for black -- he has an isolated pawn and development is roughly equal, but the Nd5 is attacked three times and defended only twice.  Nxc3 fails to Qxd8.  What will black do?",
        "13... Qb6": "Offering a queen exchange.  Perhaps Qc7 or even e6 (trying to hang on to the knight) is worth considering.  At this point I realize my opponent is probably following the game DB, which is a bad idea IMO...",
        "14. Nxd5": "Winning a pawn.",
        "14... cxd5": "Forced, as Qxd4 is met by Nxe7 , with a big advantage to white.",
        "15. Qxd5": "A critical moment in the game.  I decide it is safe to take the pawn, and black will be without sufficient compensation.  Black will have active pieces as compensation for the pawn, but white's material is worth more, as his position is good too!  This game is far from over.  (By the way, the game DB at this point said two games played, one win for black and one draw.  Don't listen to the game DB -- assess things yourself!)",
        "15... Be6": "A bishop move was necessary to prevent Qxa8.  Had black played 13. ... Qc7, Qxa8 would be met by Bf5!, where white loses the queen due to the mate threat on c2.",
        "16. Qb5": "Offering to exchange to a pawn-up endgame...",
        "16... Qe3+ 17. Kb1 Rab8": "Has black enough for his pawn?  He's got some pressure for it now...",
        "18. Qa5": "A sufficient move in a difficult position.  White has many counterstrikes of his own, protects the e1 square, denies black activity on the fifth rank and prevents Qb6 with this move.",
        "18... Rfc8": "Increasing the pressure...",
        "19. Bd3": "Getting the bishop off the back rank, defending c2, and (most importantly) connecting the rooks.",
        "19... Rb6": "Threatening to double rooks...",
        "20. Rhe1": "Of course not 20. Qxa7? Rxb2  winning the queen.",
        "20... Qf4 21. Qxa7": "This is okay now, although perhaps Qa3 was safer (see the next note).",
        "21... Rcb8": "A weak attempt at an attack -- I had found the sacrifice Rxb2 , where after 22. Kxb2 Rb8 , black has mating threats, for example, 23. Ka1 Qd4#, 23. Ka3 Qb4#, 23. Kc3 Qb4#. White must find the very difficult return-sacrifice 23. Bb5! to be able to defend sufficiently.",
        "22. b3": "Easily blunting black's threats.",
        "22... Rb6b7 23. Qe3": "Offering a queen exchange.  This move is alright, but black has an answer...",
        "23... Qa4": "Oh no!  I saw ... Qxh2 24. Rh1 winning for white, but this move is much better for black.  With four pieces attacking b3 and only two defending, white has to defend accurately against mate!",
        "24. Be4": "A good move that should allow white to hold on.  Black could win the queen and all of white's kingside pawns by forcing exchanges on b3, but with no support in the endgame, the two rooks and bishop will overpower the lone queen.",
        "24... Rb7b4": "A weak move to remove the threat on the Rb7, as Ra7 was more threatening.",
        "25. Qc3": "Another good defensive move, which also grabs control of the long diagonal.",
        "25... Rc8 26. Qb2": "Staying on the long diagonal, and adding the threat of bxa4.",
        "26... Qa7 27. Rd2": "Disallowing Qf2 and threatening Re-d1 and Rd8 .",
        "27... Qb8 28. Red1 h5": "If white can entice either the Rc8 or the Qb8 away from the defense of the d8 square, Rd8 still leads to mate.  h5 accomplishes nothing, and it appears that black is playing without a plan, hoping for white to slip.",
        "29. Bc6 Bf5": "Rxc6 is impossible due to 30. Rd8  Qxd8 31. Rxd8 Kh7 32. Qh7#",
        "30. Bd7": "Forcing an exchange, bringing white closer to a won endgame.",
        "30... Bxd7 31. Rd2xd7 e6": "e6??  A very bad move.  Black now has no good defense against the coming white counterattack.  Remember white's 25th put the queen on the long diagonal?  This comes back to haunt black now...",
        "32. Qf6": "Threatening Qxf7  leading to mate, and also threatening Rd8 , leading to a Queen vs. Rook ending for white.",
        "32... Rf8": "Defends against the first threat, but there is no defense against Rd8.",
        "33. Rd7d8": "Black resigns.  Black is helpless to prevent white from exchanging two rooks for rook and queen."
    },
    "url": "https://gameknot.com/annotation.pl/alygallys-mini-tournament?gm=317",
    "gameName": "alygally's mini-tournament",
    "players": "ethansiegel (1589) vs. silhouet2003 (1678)",
    "opening": "Sicilian (B76), dragon, Yugoslav attack, Rauser variation"
}