{
    "moves": {
        "1. e4 c5 2. Nf3 Nc6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 g6": "A tricky move order. Black doesn't let White continue with certain attacking structures (e.g. the feared 9.0-0-0 Rauzer) because he threatens an early ..d7-d5 (discussed in a later note). This move order is often neglected in the Dragon because of the nagging possibility of 6.Nxc6! bxc6 7.e5; in that line, White immediately pressures Black's negligence in the center, even at the cost of strengthening Black's pawn structure. Black tends to score poorly in that line, hence the early ..d6 (preventing this idea entirely).\n",
        "6. Be3": "White is content to play normally for now. He will not try to refute Black's central negligence.\nAlternative variation: 6. Nxc6 bxc6 7. e5\n",
        "6... Bg7 7. Bc4": "The best move. The big idea of Black's Accelerated Dragon setup is to play ..d7-d5. This sounds harmless enough, but the normal Dragon move order plays an initial ..d6, which would lose a tempo vs. the Accelerated move order if 1) ..d7-d5 is desirable and 2) White cannot stop an early ..d7-d5. Thus White's move Bc4 is flexible (the game may still transpose into a normal Bc4 Rauzer) and restrains Black's hoped-for..d5 advance. Now, Black has nothing better than to revert to a normal Dragon with 7..d6 (though there are other lines involving ..0-0 and ..a5 in the Accelerated spirit).\n",
        "7... d6 8. f3 O-O 9. Qd2": "The game has transposed into a 9.Bc4 Rauzer.\n",
        "9... Re8": "What is this? This move is completely misguided. The rook has no pressing duties on e8 (..e5 is silly, blocking in the ..g7 bishop, and the e7 pawn is not exactly weak at the moment) . ..Re8 also removes a piece from the defense of the f7 square, which is certainly more important than e7 (and free! Black's rook was already there!). Black's move loses a crucial tempo in a very sharp variation...he will have problems continuing \"normally.\"\n",
        "10. O-O-O a6": "It seems Black wants to play ..b5 as soon as possible, but his pieces are worryingly underdeveloped and it's not clear that ..b5 is all that powerful at this point. He should continue ..Bd7 and ..Ne5\n",
        "11. g4": "One plan. White also can choose the more popular h4-h5 plan.\n",
        "11... h5": "This move  is strong against h4, when is closes lines on the kingside. It is super-weak against g4 for the opposite reason - now White can easily open lines to the Black king. Already, Black is lost. It is instructive to note the defensive spirit of Black's play (the dubious prophylactic ..Re8, the sluggish preparatory ..a6, and now the blunderous ...h5). Fear of White's attacking possibilities pervades Black's play, to his doom. In the Dragon (specifically these Rauzer lines), the key word is counter-attack. White's attack is naturally strong, and to some degree indefensible. Black's best plan is then to attack White's king, not spend several tempi \"defending.\" Moves like ..Qa5, ...Bd7, ..Rac8, and ..Ne5 ought to be on the board, not this mishmash. Black would have fared much better if he had simply continued with his own attacking plan!\n",
        "12. Nxc6": "I've criticized this move before in other games, but here circumstances are different. As in the earlier note, Nxc6 is justified against the Dragon as long as White can follow up with e5 (Nxc6 removes a key defender of e5). Here, White uses this idea to kick off the f6 knight and rip open kingside lines.\n",
        "12... bxc6 13. e5 Nh7 14. gxh5 Bf5 15. hxg6 Bxg6 16. h4 dxe5 17. Qg2": "Trading queens helps the defender, but Black should know better than to expect White to comply. White's queen now enters the kingside attack with tempo.\n",
        "17... Qc7 18. Qxg6": "The f7 pawn is pinned, and White wins a piece. It is interesting to note that White can play many moves here (h5, Rdg1) and still be in a 100% crushing position. The point being that Black cannot hope to \"defend\" such positions, lost material or not, as White has so many resources at his disposal. Again, counterattack should be Black's only plan in this variation. Here, it never gets off the ground.\n",
        "18... e6 19. Qg2 f5 20. Bh6 Nf8 21. Rhg1 Re7 22. h5": "It is true that White wins after mass exchanges on g7, but he does not need to settle for a piece-up endgame when he can extract further concessions (and possibly mate!)\n",
        "22... Kh8 23. Bg5 Rd7 24. Rxd7 Nxd7 25. h6 Bf6 26. Bxe6 Rf8 27. Bxd7 Bxg5+ 28. Qxg5 Qxd7 29. Qg7+": "In just a few moves, White has taken the whole house! The point? Don't be too quick to settle for liquidation   an easy advantage when you may have even better results continuing your attack!\n"
    },
    "url": "https://gameknot.com/annotation.pl/amateur-dragon-series-3?gm=6382",
    "gameName": "Amateur Dragon Series #3",
    "players": "scottyad (1917) vs. grietje (1680)",
    "opening": "Sicilian (B33), Pelikan (Lasker/Sveshnikov) variation"
}