{
    "moves": {
        "1. e4": "This quick game never really gets off the ground due to White's \"eccentric-at-all-cost\" philosophy, but it's a fair introduction to a relatively new Dragon system that has been receiving attention at all levels (including the notoriously Dragon-averse 2600  crowd!)",
        "1... c5 2. Nf3 d6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 g6 6. Be3 a6": "Introducing the \"Dragadorf\" (or Naja-Dragon), which for a time seemed as silly as its namesake. Black's early ...a6 suggests that he will continue ...b5  and attack along the b-file, a powerful plan both as a minority attack or simple mating attack. For a long time, however, top players considered this setup simply too slow to meet White's most aggressive option, the Yugoslav. In a sense it still is, but as we'll see Black has some concrete ideas that justify his play - at least for now!\n",
        "7. f3 b5": "A provocative idea, and entering \"Accelerated Dragadorf\" territory, which just means that Black will play for speed (often eschewing ..Bg7 and ..0-0 in the process!). This move also robs White of the useful move Bc4, which has pestered the Dragadorf more than the 0-0-0 Yugoslav, and prepares ..Bb7 (hitting the key d5 square).\n",
        "8. Qd2": "Continuing in Yugoslav style. This isn't so bad, but much attention has been focused on 8.a4(!), challenging Black on \"his\" part of the board while he is still under-developed.\nAlternative variation: 8. a4 b4 9. Nd5 Nxd5 10. exd5 Bb7\n",
        "8... Bb7": "Now we reach another \"point\" of this Accelerated system....White's clear and powerful plan of Bh6 and exchanging the Dragon bishop is not so useful with the bishop on f8! Indeed, in many lines Black doesn't intend to play ..Bg7 or . ..0-0 at all. In fact, he often plays ..h5 or ...h6 instead, preventing the idea altogether.\n",
        "9. Bd3": "A bit strange, but basically a good move. It is true that White has major problems with \"normal\" development, as c4 is no longer available and the looming ...b5-b4 will most likely force Nd5 Nxd5 exd5 when a White pawn on d5 makes Be2 somewhat less attractive. This move usefully eyes h7 in the event of h4-h5. It also allows Nce2 without blocking in the f1 bishop, a useful plan in some lines.\n",
        "9... Nbd7 10. O-O": "The beginning of a bad plan. White's pieces are aggressively placed and the simple 10.0-0-0 ensures a fierce fight. Castling kingside is awkward, but White may intend a4 and queenside play, which will challenge Black nonetheless. It is worth noting that a4 and the fight for queenside squares is the only justification for this move.\n",
        "10... Bg7": "Abandoning the \"Accelerated\" plan in view of White's new setup, point being that Bh6 is not so worrying without a mating attack and Black's h8 rook ought to see some action.\nAlternative variation: 10... Ne5 11. a4 b4 12. Nce2 Rb8\n",
        "11. g4": "This move is rather ridiculous. Initiating a kingside pawn storm now with the king on g1 is a poor choice. It's not so much that White's king is in danger (he is protected by considerable space, and Black cannot retaliate successfully with ..h5, though the a7-g1 diagonal is worrisome), but that White's rooks are horribly uncoordinated. Flaunting the traditional Yugoslav setup is not really an option!\nAlternative variation: [Of course White's best (and only!) plan is to play for queenside squares via 11.a4] 11. a4 b4 12. Nce2 a5 13. Bb5 O-O 14. Nc6 Bxc6 15. Bxc6 Rc8 16. Bb5 Qc7 [with a positional struggle]\n",
        "11... Ne5": "Also fair is 11...h6, which is more concretely a \"Dragadorf\" move, intending to keep the king on e8 and protect the h6 square with pieces (thereby preventing Bh6, White's main kingside idea).\n",
        "12. Kf2": "Out of one trap and into another! White sidesteps the a7-g1 diagonal and prepares to develop his rooks, but now he introduces tactics on e4 and g4 (note how powerful a knight fork on e4 would be). Also, this idea is simply slow....another reason why 0-0 and kingside pawn storms don't mesh in the Dragadorf!\nAlternative variation: [The typical] 12. Bh6 [falls flat to] Bxh6 13. Qxh6 Qb6 [ when Black has taken over the board by exploiting the a7-g1 pin, e.g.] 14. Nce2 Nxd3 15. cxd3 e5 [and Black is winning.]\n",
        "12... O-O": "OK, 12...h6 is more in the spirit of things but in more practical terms I felt White would overextend himself with Bh6? at some point, which 12...0-0 encourages.",
        "13. h4": "No good, but White is bent on a kingside train wreck.\n",
        "13... d5": "A terrific (and rather obvious) move, highlighting White's precarious king-queen position and also the weakness of the d4 knight (who is hanging in many lines after ...dxe4 and a few knight captures on g4 with check!). Yet another triumph of the old principle of central counterattacking against hasty wing play. White is actually lost now.\n",
        "14. Bh6": "Told you so! In this case White's plan of Bh6 and g5 neglects the hanging d4 knight and exposed White position.\n",
        "14... Bxh6 15. g5": "Alternative variation: 15. Qxh6 Nfxg4 \n",
        "15... dxe4": "Here, White resigned as Black's threats are overwhelming. I was rather amused that Black's plan of speedy queenside invasion never transpired, and instead Black's central play and 2 bishops won the day. The game might have continued:\n",
        "16. Be2": "Alternative variation: 16. gxh6 Qxd4  17. Ke2 exd3 \nAlternative variation: 16. Bxe4 Nc4 17. Qd3 Nxe4  18. Nxe4 Bg7\n",
        "16... Qb6 17. Nxe4 Nxe4+ 18. fxe4 Bg7": "And Black is up one piece and will soon embarrass the d4 knight as well. I hope you'll consider adding 6...a6!? to your Dragon repertoire. If you have any experience in this system, or simply questions, shoot me a pm. And I'll add that my \"Dragon Sicilian Thematic\" is just starting up (starting at 5...g6) and open to all interested players...just ask for an invite. Cheers."
    },
    "url": "https://gameknot.com/annotation.pl/amateur-dragon-series-5?gm=6537",
    "gameName": "Amateur Dragon Series #5",
    "players": "madcapsb (1831) vs. scottyad (1940)",
    "opening": "Sicilian (B72), dragon, 6.Be3"
}