{
    "moves": {
        "1. e4 e5": "Team Match. Having played an awful lot of Sicilian Defense lately, I decide to take a break and try the Open Game, letting my opponent pick the opening. Probably unwise, but I felt like I needed a break from Sicily. ",
        "2. Nf3 Nc6 3. Bb5 a6": "My Ruy Lopez. The opening I prefer when I'm white, but now the shoe's on the other foot. I fear I'm about to find out the hard way why I like this opening so much as white. I respond with the Morphy Defense.",
        "4. Bxc6 dxc6": "The Exchange Variation. I don't favor this myself, so let's see where it will lead.",
        "5. O-O Qd6": "5. 0-0 is sometimes called the Barendregt Variation (what is it called the rest of the time?). 5. ... Qd6 is considered the sharpest line and prepares to castle queenside.",
        "6. Na3 b5": "The best move for black in the World DB, it prevents the white knight from playing to c4, forking queen and e5 pawn.",
        "7. c3 Bg4": "White prepares to push his pawn to d4 and also makes a hole for his knight on a3. Black pins the other knight to its queen.",
        "8. Nc2 Qd3": "We're quickly running out of DB games. This move was played once, by Ulrich Zenker (2282) as black vs. Stefan Pruefer (2202) and is the only one of the 3 moves in the DB with a favorable outcome for black. It puts quite a bit of pressure on the knight on f3, threatening to ruin the white kingside pawn structure without trading queens. However, 8. ... Qf3 threatens the same pawn structure and is harder for white to thwart effectively. Other alternatives that look appealing were 8. ... c5 and 8. ... Nf6. Still, I like to be aggressive, and Mr. Zenker did all right with this move, so I went with it.",
        "9. Ne3 Bxf3 10. Qxf3 Nf6": "The black bishop was en prise, and black's plans of pawn structure damage were thwarted by the knight on e3, so the bishop must either retreat (losing tempo) or attack. And now black develops with a threat against e5. Actually, at the time, I thought this was quite clever, since white has no way to save the pawn.",
        "11. Qg3 Nd7": "White found a great response. Initially, I considered 11. ... Qxe4 but I chickened out. In retrospect, this may be where this game took a turn for the worse. After 12. ... Bd6 the position looks secure enough and the queen looks safe enough, and black could castle to either side as he sees fit. And I would have been a pawn up. But that e4 pawn looks poisonous. I can't put my finger on it. I don't like my king and queen on the same open file, even when I have a pawn on the file. Further, if white could drive away the black queen, then black's e5 pawn would fall. Two reasons to be wary, though I couldn't see any way for white to exploit either of them. Still, my hackles raised, I avoided the pawn for reasons unseen.",
        "12. a4 Qxe4": "A move ago, with my e5 pawn lacking support, Qxe4 looked dangerous. Now it looks much more appealing. White's threat on b5 is not yet worriesome; it offers black a chance to undouble his c-pawns if white exchanges.",
        "13. axb5 cxb5 14. d4 Qg6": "I was feeling pretty good about this game right about now. A pawn ahead and a solid position. Let's try to exchange the big guns and win the endgame.",
        "15. Qf3 e4": "The black rook on a8 was en prise, and 15. ... e4 saves the rook and establishes a 4-3 kingside pawn majority.",
        "16. Qh3 Qe6": "16. ... Qe6?! was a weak move by black. 17. Qxe6 fxe6 accomplishes part of my goal of exchanging the big guns, but at a horrible cost to black's pawn structure. Still, I think it would be worth it. In retrospect, I think I would do something differently next time. Maybe 0-0-0.",
        "17. Qg3 c5": "Attacking white's center.",
        "18. f3 cxd4 19. cxd4 Nf6 20. fxe4 Nxe4": "This seemed quite equitable to me at the time. White's queenside pawns are ruined and black still has a 3-2 kingside pawn advantage. White does gain a passed pawn in the center, but it is easily attacked.",
        "21. Qf3 g6": "21. Qf3! is powerful. It pins black's knight on e5 and it puts a lot of pressure on black's pawn on f7, tying black's queen to defend two different directions - always a danger. Even worse, black's backward pawn on a6 is also in danger, though it is adequately defended, but black is defending it with a queen and a rook, two pieces that should have better things to do. Black's plan is to play 22. ... f5 to defend the knight and eliminate most of white's threat down the f-file.",
        "22. d5 Qe7 23. Re1 O-O-O": "White gives black no time for his own plans, first attacking the queen then then knight. However, with one attacker removed from f7, the king isn't needed to defend that pawn anymore. This was probably black's losing move, however. The idea was to get the king off of the open e-file before white's rook can skewer the queen to the king. This frees up black's queen and knight to move again, rather than being stuck in defensive mode. It also puts pressure on white's d-pawn. Unfortunately, these advantages are gained at the cost of the now defenseless a6 pawn, a cost I felt black could afford, since I was ahead by a pawn. But now I'm not so sure this was the right plan. I think black would have been better off sticking with 23. ... f5.",
        "24. Rxa6 Kb7 25. Ra5 Kb6": "White wants a second pawn, and black's queen is too busy defending her knight to do much about it. 25. ... Nd6 might have worked out OK, as might 25. ... Qe8. But I chose a plan that combined attack with defense. It turns out that 25. ... Kb6?? loses a deadly amount of material, but I never saw it coming. Kudos to white for finding the amazing combination that is to follow.",
        "26. Nc2 Kxa5": "26. Nc2! is an amazing move. So quiet, yet so powerful. White leaves his rook on a5 hanging, free for black to gobble it up. Sure, white gains black's knight on e4, so black only wins the exchange, but there seems no other threat. So I looked deeper. No way my opponent gave up the exchange for nothing. The knight on c2 attacks b4 and keeps the black king from using that as an escape route against the checks to come. I quickly realize that white is about to win black's queen and knight for the cost of two rooks, and that I have no way out of it. Not taking the rook on a5 is worse than taking it.",
        "27. Be3 Ka6": "White threatened mate in 2 with Ra1+, so black's king must retreat in order to escape to b7.",
        "28. Ra1+ Kb7 29. Ra7+ Kc8": "Nothing else for it, black's queen must die.",
        "30. Rxe7 Bxe7 31. Qxe4 Rd7": "And now the material has been exchanged and black's bishop was en prise. White doesn't have enough material to force a won endgame. I'm hoping to stick it out for a draw, beginning with doubling the rooks on the d-file. Again, I miss a killer response by white.",
        "32. d6": "Final position. White's pawn threatens the black bishop. Black can capture that pawn in two different ways, or retreat the bishop. Any retreat is met with 33. Qa8#. 32. ... Rxd6? is met with 33. Qa8+ and 34. Qxh8. And 32. Bxd6 is met with 33. Qa8+ Bb8 34. Qc6+ Rc7 35. Qa6+ Kd1 36. Qf6+ (any) 37. Qxh8. No matter what black does, he loses at least a rook. Time for black to resign. An excellent win for white. Well played."
    },
    "url": "https://gameknot.com/annotation.pl/amazing-sacrifice?gm=25425",
    "gameName": "Amazing Sacrifice",
    "players": "irwannapitupulu (1983) vs. blake84120 (2033)",
    "opening": "Ruy Lopez (C69), exchange, Bronstein variation"
}