{
    "moves": {
        "1. e4": "Most common first move, i hope the better one.",
        "1... e5": "He answers symetrically with a hope to have same rights over center.",
        "2. Nf3": "Develops a piece and attacks to opposition's pawn.",
        "2... Nc6": "Defends his pawn and develops a piece too.",
        "3. Bc4": "I like placing the bishop to c4.Maybe it is because of i don't like to spend effort to learn Ruy Lopez theory.",
        "3... Nf6": "Develops other knight and makes pressure on my pawn.",
        "4. O-O": "O-O!?  This move provokes to capture the centre pawn.And you realize how a mistake he does by capturing pawn.",
        "4... Nxe4 5. Re1": "Re1!?. A good move i think and put an exclaimation  because if he moves his knight away,he would lose his pawn and i will be better as position.",
        "5... f5": "He tries to keep the knight on the center therefore.But he weakenes the kingside by f5?!.I can easily make knight move away from there by d3.",
        "6. d3 Nc5 7. Nxe5": "I have replaced the opposition knight and got the pawn back.",
        "7... Ke7": "he plays this move coz he doesnt want to exchange the bishops due to this line above:\n\n7...Nxe5 8.Rxe5  Be7 9.Bg5! and the loss of his bishop.However he could not see the biggest danger.",
        "8. Nxc6+": "Double check!! He has lost his quuen.He can't move his queen because the  rook checked too. ",
        "8... Kf6 9. Nxd8": "He lost at the begining due to a wrong move.Other moves are more much or more less related to the strength of the player.",
        "9... d6 10. Nf7": "Maybe a shorter line that leads to mate can be possible; i hope you will discuss about it.",
        "10... Rg8 11. Qe2 g5 12. Bxg5+ Rxg5 13. Nxg5 Bd7 14. Nxh7+ Kg6 15. Bg8 Kg7 16. Qh5 Kxg8 17. Qg6+ Bg7 18. Nf6+ Kh8 19. Qh7#": ""
    },
    "url": "https://gameknot.com/annotation.pl/ambush?gm=18046",
    "gameName": "Ambush",
    "players": "lapsekili (1116) vs. fireball000eddie (1338)",
    "opening": "Giuoco piano (C55), Rosentreter variation"
}