{
    "moves": {
        "1. e4 d6": "The game opens with a novelty for me; the Pirc Defence\n",
        "2. d4": "A natural move to me, taking control of the centre.\n",
        "2... Nf6 3. Nc3 g6 4. Bf4 Bg7": "It's clear from the opening moves that Black is playing hypermodernly. White has more control of the centre but Black will be looking for counterattacking opportunities\n",
        "5. Qd2": "With the idea of a future Bh6 to get rid of the fianchettoed bishop\n",
        "5... c6": "taking it slow, but safe...\n",
        "6. O-O-O": "By the look of it, this may become a case of opposite side castling\n",
        "6... Qa5": "Black makes the first aggressive move of the game. The a2 pawn, of course, is defended, but the c3 knight may end up overloaded e.g. 7...Nxe4! 8.Nxe4 Qxa2 9.[Q move] Qa1+ 10.Kd2 Qxb2 - advantage to Black [an alternate variation to this line is 9.Nc3 Qa1+ 10.Nb1 Be6, and White is feeling the cramp!] I used this trick in another game of mine with successful long-term results\n",
        "7. Bd3": "Stops any idea of Nxe4, but this is also the most logical move for the bishop anyway\n",
        "7... Nbd7": "The best place to put the knight - perhaps it will head to b6 later on?\n",
        "8. Bh6": "Now's a good a time as any - time to remove the bishop!\n",
        "8... Bxh6": "Black could have also castled, and frankly I can't see anything wrong with it. With this move, Black will never be able to castle kingside, and the limited mobility of the c8 bishop will mean that it will take awhile before he can castle queenside as well - a small victory for White.\n",
        "9. Qxh6 b5": "I like this move - not only does it open up a path for the bishop, it also threatens 10...b4!, driving away the only defender of the a2 pawn\n",
        "10. Kb1": "neutralising the threat.\n",
        "10... Nb6": "Sure enough, the knight comes to b6, only now it doesn't block the advanced b-pawn. Things are actually looking pretty good for me...\n",
        "11. e5": "! and now it's looking even better for White. This is a similar idea to Black's b5 in that it drives away a defender of a pawn - h2. The other defender, the rook, will be dealt with very shortly...\n",
        "11... dxe5 12. dxe5 Nfd5 13. Nxd5": "White doesn't want doubled pawns (which would also cripple the defence around the king) so he exchanges the knights.\n",
        "13... Nxd5": "White can now win a pawn... but he also needs to note the potential pressure that could build up on a2 (the knight can jump to b4) Because of that, it made me think a little about my next move (14.a3 might work...)\n",
        "14. Qg7": "In the end, I decided that it was safe to grab the pawn. The rook only has one place to go...\n",
        "14... Rf8 15. Qxh7": "...and White gets his pawn. Hopefully, he may be able to use the queen to pressurise Black even more... in fact, he already has an idea of how to do that...\n",
        "15... Be6": "And I guess that Black had not seen it (though this is further pressure on a2)\n",
        "16. Bxg6": "! This sac, should White accept it, strips the defence of the king while also creating a pair of connected passed pawns on the g and h files. Now this is where the game starts to get interesting...\n",
        "16... fxg6 17. Qxg6+ Kd7": "This move is forced to avoid losing material. Catastrophic would have been 17...Bf7?? 18.Qxc6!! Kd8 19.Qxa8+, with ruinous material loss. This is what White had hoped for - the Black king could be pretty vulnerable in the centre of the board, and White will look to exploit that\n",
        "18. Nf3": "! White brings his last piece into the action with a threat; now either Nd4 or Ng5 presses his advantage further after the bishop moves with e6+; a potentially dangerous pawn indeed! [especially Nd4, which would win White the pawn on c6]\n",
        "18... Rfg8": "! Driving the queen away - she won't be able to stay with Black's connected rooks on the case!\n",
        "19. Qh6": "! White wants the queen to escape on her own terms! Of course the rook is going to attack the queen again... [also, if the queen escapes now Black can take on g2]\n",
        "19... Rgh8 20. Qe3": "and the queen now entertains ideas of Qc5, a pretty good outpost for the queen [the knight cannot capture the queen because of the pin on the king. However, there's a catch...\n",
        "20... Kc7": "If I play Qc5 now, simply Qb6! can force off the queens, and that is why I didn't play it... but I think not playing it was a mistake on my part. I could turn the exchange to my advantage (for example, b4, Qxc5, bxc5 would get another powerful pawn on another good outpost - would it be a good idea? reader comments welcome) and since material is even, there's no desperate need for a quick attack. White should be perfectly happy with his advantage of the passed pawns\n",
        "21. Qe4": "? Qc5 was certainly better than this move! It isn't entirely obvious at first glance, but White has now lost a pawn...\n",
        "21... Qxa2+": "! Oh man.... now where have I seen THIS before? [here's a hint ;) http://gameknot.com/annotation.pl/an-unsuccessful-evans-gambit?gm=31930]\n",
        "22. Kxa2": "There's no point trying to avoid the exchange - 22.Kc1? Qa1+ 23.Kd2 Qxb2 is even worse!\n",
        "22... Nc3+": "The double check surely is a powerful thing...\n",
        "23. Ka1 Nxe4 24. Rhe1": "?! A dubious move, to say the least - this loses another pawn - but my reasoning was that White could get sufficient piece activity. If Rf1, White would need at least three moves to free up his position - h3, Nd4, f3 [though Nd4 does give White a tempo...]\n",
        "24... Nxf2 25. Rd2 Ng4 26. Nd4": "White plans to chase the knight some more, but first a zwischenzug; Black needs to save his bishop\n",
        "26... Bd7 27. h3 Nh6": "this was White's envisioned position - the Black knight is out of action on h6, and White has a strong piece presence in the centre... he still has some chances in this game!\n",
        "28. e6": "! The pawn on e6 can also be a force to be reckoned with! Now Black is forced to disconnect his rooks\n",
        "28... Be8": "Better than the alternative 28...Bc8?, where the bishop has nowhere to go\n",
        "29. g4": "White recognises the power of his connected passed pawns, and he intends to use them!\n",
        "29... Rd8": "Black manoeuvres his rook to get in the action...\n",
        "30. Red1": "...and White spots a trick! If Black was to not move his rook next turn, then Nxb5! moves White from two points down to one point up! [31.Nxd5+ cxb5 32.Rxd8]\n",
        "30... Rd6": "hmmm... I guess Black must have been planning that all along. Does that make Red1 a wasted move? At any rate, White spots another trick.....\n",
        "31. g5": "which begins with driving away the knight... but I already see a refutation to this plan after I played this move, which is undoubtedly Black's original plan; 31...c5!! The exchange doesn't look too appealing; 32.gxh6 cxd4 33.Rxd4 Rxd4 34.Rxd4 Rxh6 , and either the e pawn or h pawn drops off. The other alternative is 32.Nb3, but then 32...Nf5 foils White's plans [I can't see anything better than this anyway]\n",
        "31... Ng8": "Fortunately Black did not see this, and plays into my hands\n",
        "32. Rf1": "Phase 1... (note that Rf2?? is impossible because of c5!, which wins the pinned knight. Now, White can retreat the knight to b3, which defends the d2 rook)\n",
        "32... c5": "Now Black plays c5, though it wasn't as effective as it could have been\n",
        "33. Rf8": "! [maybe even !!] One of my better moves on GK :) This has the effect of pinning the knight to the rook... but the rook is also pinned to the defence of the knight! This effectively puts Black a piece down, which is advantageous to me. The way I see it, the only piece that can bring defence to the knight is the other rook...\n",
        "33... Rxd4": "...and Black was kind enough to exchange it away for me :) The resulting exchanges also gets rid of the e8 bishop [but even if Black decided to preserve his rook - say, with a move like cxd4 - could Black have used his other rook to defend the knight? e.g. Rd5 would have been met with Rg2]\n",
        "34. Rxd4 cxd4 35. Rxe8 Kd6": "And now the Black king moves to get rid of one of White's pawns...\n",
        "36. g6": "! While White moves to get rid of Black's bishop. White will play g7 next move, the rook is driven away and the knight will be captured\n",
        "36... Rxh3": "Black sees this too, and allows the capture one move early\n",
        "37. Rxg8 Rg3": "! stopping any hope of the g-pawn promoting\n",
        "38. Rb8": "Not 38.Ra7? Rxg5 39.Rxg7 Kxe6 40.Ra5 Rg5, and Black maintains a one point advantage, which can make all the difference in an endgame\n",
        "38... Rxg6 39. Rxb5 Rxe6 40. Ra5": "Now, there's no way for Black to defend a6...\n",
        "40... Re2": "First of all, however, White needs to answer to this move\n",
        "41. Kb1": "logical enough; the king will do no good in the corner of the board\n",
        "41... e5": "! Both sides have one passed pawn that needs to be pushed, and Black has a head start! Black will be playing for the win here, while White will be happy with a draw\n",
        "42. Rxa7 e4 43. Ra8 e3 44. Re8": "White's rook is the only thing that can stop promotion right now. Black's plan ought to be Rh2, e2, Rh1+, e1=Q, and white is forced to give up his rook. White, however, has a plan to deal with this threat...\n",
        "44... Kd5": "... but first needs to deal with a possible king intrusion.\n",
        "45. b3": "This ought to do it!\n",
        "45... Rd2": "Black moves his rook...\n",
        "46. Kc1": "! This is the move that secures a draw for White. If the e-pawn advances, the rook falls...\n",
        "46... Rh2": "...and even if the e-pawn advances now, Kd2 will be enough to prevent promotion\n",
        "47. Kd1": "Bringing the king out for further defence...\n",
        "47... Rh1+ 48. Ke2": "Now, I believe, a draw is fully confirmed for White\n",
        "48... Rc1 49. Rc8 Rh1 50. Rd8+": "White's rooks start the checks that cannot be stopped - because of White's two pawns and his king, the Black king has nowhere to hide behind. If the king tries to attack the rook, the rook will in turn target that d4 pawn, making it awkward for Black \n",
        "50... Ke4 51. Re8+ Kd5": "Here, Black offered the draw and I gladly accepted - a satisfying result for me :)\n"
    },
    "url": "https://gameknot.com/annotation.pl/an-almost-expert-draw?gm=32112",
    "gameName": "An (almost) Expert Draw",
    "players": "x-machine (1481) vs. superpom (1796)",
    "opening": "Pirc defence (B07)"
}