{
    "moves": {
        "1. d4 e6 2. Bf4 d5 3. Nf3 h6 4. g4 c5 5. c3 Qb6 6. Qc2": "Or Qb3, wiser an higher levels.",
        "6... Nc6 7. e3": "Needed. ",
        "7... Nf6": "I am still undeveloped, but I have to be consistent with my play. If I just defend the pawn, I'm losing time. Rg8 was the only serious alternative. ",
        "8. g5": "Accepting the dsb's exchange. ",
        "8... Ne4": "but black goes for blocking the diagonal. A weapon black has in this opening ",
        "9. g6": "Daring more. If black takes the pawn, I will remove the knight one way or another, and then Qxg6 would be very strong. ",
        "9... Nd8": "Black interestingly defends. ",
        "10. Ne5": "Pressing the attack while I can. I'm not developed, but black isn't either!",
        "10... Qc7": "if f6, I would have accepted to lose a pawn to open the king. In sight of this, black double covers f7. He sees that no check are available for my knight, so he thinks that his queen is safe even self-skewing.",
        "11. gxf7+ Nxf7 12. Ng6": "But it was not right. I have this move. ",
        "12... Qd7": "Unfortunate square, but black doesn't want to have the queen not covering f7... but this is not the problem anymore...",
        "13. f3": "This is the \"problem\". And not to take the exchange. ",
        "13... Neg5 14. Nxh8 Nxh8 15. Bxg5 hxg5": "Now I have the exchange and a very weak pawn structure by black. True, I can't give the Qg3 check, but I can still...",
        "16. Qh7 Nf7 17. Qh5": "Or Qg6. I dreamed with my lsb on g6, but it never happened. ",
        "17... cxd4 18. exd4 Qd6": "Black has to untangle himself. I know his objective is f4, but I have my queen covering f3. ",
        "19. Bd3 Qf4": "Unfortunately, e3 is weak. ",
        "20. Ke2": "This seems to be the only  move, and I played it as if I had forseen it from the beginning. Black has no way to bring pieces into the attack in a short time. ",
        "20... e5": "...or does he? ",
        "21. Rg1": "Cool blood. I think I can afford e5, and I will just let it happen. I'm more worried about exd4, so I thought I was smart playing...",
        "21... Be7 22. Rg4": "?? This. I am just returning the exchange for nothing. ",
        "22... Qf6": "My opponent didn't realize it either... what a shame for both of us. ",
        "23. Rg3 Qf4": "...but now we are again in the position that would have been if I played 22. Rg3. But now I have the tempo. A good lesson about how to waste tempos... by both sides! :-) ",
        "24. Nd2": "Now, into the logic way of developing, guarding e4. Black can't still really get away of his bind of the queenside in an active way, so he prefers to attack. ",
        "24... e4": "Much better was exd4. Now it was completely safe. Of course, I have then Bg6, so... it's an interesting position for tactics. ",
        "25. fxe4 dxe4 26. Bxe4": "Now white has an edge, despite of his exposed king. Look what's coming. ",
        "26... Kd8": "Black is facing a very unusual positioin, and fails to grab the threat. But it was easy to overcome one of the many white's threats. ",
        "27. Rf1 Qd6 28. Qxf7 Qa6+ 29. Bd3": "I'd like the bishop where it was, but I can afford this. ",
        "29... Qe6+": "...or so I thought. Now I have to exchange queens or retire it to f3 or f2. Bleah. My fault. Let's go on. ",
        "30. Ne4": "We'll exchange queens, but I will have a tempo and a threat. ",
        "30... Qxf7 31. Rxf7": "...on g7. Black can't defend it by Bf6. ",
        "31... Be6 32. Rxg7": "My rook can easily become trapped. Is always a tought fight, very interesting. ",
        "32... Kd7": "Black at last frees his rook safely, but look at the material...",
        "33. Nf6+ Kd6 34. Ng4 Bxa2 35. c4": "I block white's bishop. ",
        "35... Bb3 36. c5+": ",,,but the real target was this. ",
        "36... Kd7 37. Ne5+": "Bf5+, K8, and I cannot check it with Rg8+ because of the bishop. So I have to look for something more. ",
        "37... Ke6 38. Rf3": "Setting a mate like net, very likely to problem's one... but my opponent timeoutted here... a pity. "
    },
    "url": "https://gameknot.com/annotation.pl/an-almost-problem-like-position?gm=50944",
    "gameName": "An almost problem-like position",
    "players": "damalfi  vs. renatohenc ",
    "opening": "Queen's pawn (A40)"
}