{
    "moves": {
        "1. e4 e5 2. Nf3 Nf6": "My usual Petroff, though earlier in my career I preferred 2...Nc6 and I have also played the Marshall Gambit of the Scandinavian (1.e4 d5 2.exd5 Nf6) and even some Sicilian dragons.",
        "3. Bc4": "!? I don't see this often. It can lead to the Boden-Kieseritzky gambit (3...Nxe4 4.Nc3) of which I know very little. Note that after 3...Nxe4 4.Nxe5?! d5 is good for Black, but it's a tricky line. I didn't want to end up in all this stuff so instead I decided, after a short think, to play 3...Nc6, transposing into the Two knights which I have played earlier when I still preferred 2...Nc6.",
        "3... Nc6 4. Ng5": "The critical test of the line, but I was happy to see it. There are some alternatives: the quiet 4.d3, 4.d4 (about which I know little, I should study that) and 4.Nc3?! but that runs into the fork trick: 4...Nxe4! 5.Nxe4 d5 winning back the piece with good play for Black.",
        "4... d5": "Almost forced to block the attack on f7, but 4...Bc5!? is another very tricky line, called the Traxler. I know there are some mini-tournaments played with this opening, but I didn't participate in one of them and I don't know the opening so well so I decided to stick to the main line which I know pretty well.",
        "5. exd5 Na5": "Better than 5...Nxd5? when White gets a strong initiative with 6.d4 (which was my preference when I played the 4.Ng5 line as White) or a wild attack with 6.Nxf7!?. It might be playable for Black, but you have to defend very, very accurately. My move is the main line, but there are some alternatives: 5...b5 and 5...Nd4, both leading to very complex positions. You should study those very carefully before trying them out.",
        "6. Bb5+ c6": "This makes it a gambit. Black can also play 6...Bd7, which is a quieter line. Black will eventually be able to round up the d5 pawn, so he won't be a pawn down, but White gets a good game. In this line it is Black who has all the fun and attacking chances, though the compensation for the pawn is not trivial at first sight.",
        "7. dxc6 bxc6 8. Be2": "Another line is 8.Qf3, but I don't know much about that variation. This is the main line, but he needed some time to think so I knew he was out of his opening theory.",
        "8... h6 9. Nf3 e4": "White's pieces are chased around while Black can develop their game. This is still the main line of the 4.Ng5 variation, all moves ffrom 4.Ng5 on are the most frequently played ones.",
        "10. Ne5 Bd6": "Another developing move with tempo. You can see now that the plan for Black will be to attack on the kingside and/or in the center.",
        "11. Nc4": "?! This is a deviation from the main line. I don't think it's a good move, because Black can exchange his only weak piece (the knight on a5) for a knight which was controlling quite a lot of the central squares. In the 365chess.com database it has good stats for Black.",
        "11... Nxc4": "Although you usually don't want to exchange pieces when you're a pawn down, I thought that this move was justified because I exchange off a passive piece for an active one. Most people who had been in this position before me agreed with this assessment, this is the most played move in the position.",
        "12. Bxc4 Qc7": "More common is 12...O-O but this is fine as well. The h2 pawn is not attacked yet, because after (say) 13.Nc3 Bxh2? runs into 14.g3 winning the bishop, but if White wants to castle short he has to remove the attack on the h2 pawn first.",
        "13. g3": "?! this blocks the attack on the h2 pawn, but it turns out to be a bad move, since I exploit the weakness of the light squares on the kingside later on in the game. 13.h3 is preferable.",
        "13... O-O 14. Nc3": "White develops, but the Black pieces are better coordinated for attack and he is ahead in development. Whitestill has to make three moves to achieve the opening goals (castling, playing the b or d pawn and then developing the c1 bishop) while Black only needs one move (a developing move of the c8 bishop). Black has a good game.",
        "14... Re8 15. O-O": "Maybe not the safest place for the king, but castling queenside takes a lot of time.",
        "15... Bg4": "!? I had planned the next sequence. I wanted to 'undevelop' one of White's pieces before getting to h3, which is the square on which the bishop is best placed.",
        "16. Be2": "Note that 16.Qe1? is impossible due to 16...Bh3 winning the exchange, so it was either this or 16.Ne2.",
        "16... Bh3": "As said before, this was the square I wanted to place my bishop on. It takes advantage of the weakness of the light squares around the White king.",
        "17. Re1 Bc5": "?! Now that the rook has moved, f2 becomes weak. However, 17...Qb6 was probably a more accurate way to take advantage of that. After 18.Na4 (necessary to prevent 18...Bc5 when White cannot defend f2 anymore) I could play 18...Qd4 and then 19.c3 would weaken the d3 square and I could follow up with 19...Qd5 which would give me a strong attack on the kingside. I think this is a typical mistake for a rapid game: I was also thinking of 17...Qb6 but I was not sure which of the two was more accurate. After analyzing at home with my computer I saw 17...Qb6 was better.",
        "18. d3": "? This move loses. 18.Na4 was necessary to prevent the coming attack on f2. I would probably have played 18...Bd4 and after 19.c3 you can see why 17...Qb6 was more accurate last move. In this variation I have to play 19...Bb6 after which White can gain the bishop pair with 20.Nxb6 Qxb6 or 20...axb6. Moreover, I can't take advantage of the d3 square so easily because my queen is not on the d file yet.",
        "18... Qb6": "Probably this was the moment when my opponent realized how weak f2 was. He can't do anything to defend it except for giving up the exchange with 19.Rf1 Bxf1 20.Qxf1 (which is probably relatively best in this position).",
        "19. Na4": "? A logical move, but it's Desperation. As I mentioned earlier, 19.Rf1 was best.",
        "19... Bxf2+ 20. Kh1 Qa5": "! Obviously I couldn't take on e1 yet (probably what my opponent was hoping for?), since the queen was attacked, but with this tempo attack on the knight I win the exchange anyway.",
        "21. Nc3 Bxe1 22. Qxe1 exd3": "Opening more attack lines and pinning the bishop. White is completely lost here: all his pieces are pinned, undeveloped or tied down to defence, not to mention he's an exchange down.",
        "23. cxd3 Nd5": "Wanting to force an exchange of knights so I can play ...Qd5+ with inevitable mate. Now we can see how the weakness of the light squares around White's king plays a role.",
        "24. Bd2": "? White had to sacrifice a pawn with 24.b4 if he wanted to prolong the game, but the end result is already clear. I also had some 7 minutes left on my clock, so time was not an issue.",
        "24... Nxc3 25. Bxc3": "? A blunder in the absolute sense of the word, since it runs into a mate in three, but there was no alternative but to resign, really.",
        "25... Qd5+": "Mate on g2 is inevitable and can only be prolonged by interposing with the bishop on f3 (25...Qd5+26.Bf3 Qxf3+ 27.Kg1 Qg2#), so White resigned. I think this game shows how quickly it can go wrong for White in the Two knights. All his problems were mainly caused by one bad move, 18.d3?. I think the Two knights is a fun opening to play for Black and I enjoy to play it from time to time, especially this line. By the way, I finished on 4/7 in the rapid tournament (under 1650 section) after a 0/2 start, so I was pretty satisfied with the end result. I hope you enjoyed the annotation. As always, feel free to leave some comments."
    },
    "url": "https://gameknot.com/annotation.pl/an-attack-in-the-two-knights?gm=44737",
    "gameName": "An attack in the Two knights",
    "players": "White player (1414) vs. l-d-j (1387)",
    "opening": "Petrov (C42), Italian variation"
}