{
    "moves": {
        "1. e4 c5": "This is a team match. I choose the Sicilian Defense.",
        "2. Nf3 d6 3. d4 cxd4": "3. d4 makes this the Chekhover variation.",
        "4. Nxd4 Nf6": "Now this is the Prins (Moscow) variation.",
        "5. Nc3 g6": "And after recycling variations like last week's aluminum, I end up at the Dragon variation, which I like if for no other reason than because I like dragons.",
        "6. Be3 Bg7 7. f3 O-O": "7. f3 is known as the Yugoslav attack.",
        "8. Qd2 d5": "8. Qd2 is the Rauser variation of the Yugoslav attack. All by the book so far.",
        "9. exd5 Nxd5": "Exchanging in the center.",
        "10. Nxd5 Qxd5 11. O-O-O Qxa2": "White deviates from the main line (11. c4). The move as played leaves the pawn hanging at a2. Everything in my home camp seems safe, so I pounce. I can't help but notice that now the white knight is pinned by the black bishop at g7 - if white moves it, black checkmates on b2.",
        "12. c3 Bxd4": "White found the move to stop the checkmate and unpin the knight. He was two moves away from a knight on c7 winning the trapped black rook on a8. Besides, a pawn ahead means it's time to think about liquidating the opponent's pieces. I regret the loss of my bishop with his strong pressure on the center and on b2, but there are no pawns in the center to threaten and white's queenside pawns seem safe from a bishop, so the tradeoff doesn't seem too unfavorable.",
        "13. Bxd4 Nc6 14. Bc5 Bf5": "My king pawn, still on his home square after 13 moves, is en prise. But I am far from wanting to save it; I want to attack instead. The move as played threatens Qb1  .",
        "15. Bd3 Na5": "Leaving the king pawn en prise again, now I threaten a 3-way fork on b3, threatening white's king, queen, and the bishop on c5.",
        "16. Kc2 Bxd3+": "Too many attacks to choose from. I agonized over the options for a long time. 16. ... Qb3 seems to be met safely by 17. Kb1 and I'm out of attacks. 16. ... Nc4 forks the white queen and checkmate on b2, but 17. Qc1 seems to solve both problems adequately. 16. ... Nb3 forks the queen and the bishop on c5, but white answers with 17. Qe3 and again I seem to run out of steam. Maybe one of these lines has something decisive that I missed, but in-game I decided to go a different way. Does anyone see anything better?",
        "17. Qxd3 Nc4": "Threatens checkmate on b2. I am expecting Rb1 to prevent the mate, after which one continuation might be 18. ... Rfd8 19. Qe4 Rd2  20. Kc1 Rxb2 21. Rxb2 Qxb2  22. Kd1 Qd2# (not forced, but I don't think white has much in the way of squirming out of it that doesn't cost him more material, or leave him with multiple exchanges toward a losing endgame down by at least 2 pawns).",
        "18. Ba3 Nxa3+": "White's move (18. Ba3?) wasn't the defense I had expected. The bishop is guarded by a pinned pawn, so it isn't really guarded at all. Now white loses his bishop and the b2 pawn is soon to follow. White has had enough."
    },
    "url": "https://gameknot.com/annotation.pl/an-agony-of-options?gm=21562",
    "gameName": "An Agony of Options",
    "players": "wkand (1478) vs. blake84120 (1504)",
    "opening": "Sicilian (B76), dragon, Yugoslav attack, Rauser variation"
}