{
    "moves": {
        "1. e4 e5": "The game starts with a classical King pawns opening.\n",
        "2. Nf3 Nc6": "Typically this position leads to a Spanish opening, and sometimes an Italian opening.\n",
        "3. Bc4": "Leading towards an Italian opening.\n",
        "3... Bc5": "Now I am presented with the choice of standard Italian or for a more challenging version, the Evans Gambit, a favorite of mine.\n",
        "4. b4": "I want to improve my skills by playing the Evans which offers a lot of positional and strategic challenges.\n",
        "4... Bxb4": "The challenge is accepted.\n",
        "5. c3 Be7": "There are a few typical responses (5...Ba5) maintains a pin on c3, but allows Qb3 with pressure on f7. (5...Bc5)  loses tempo after d2-d4, but does allow ...Na5. And finally the text move, which is considered the strongest response and allows ...Na5 to prevent an early attack on f7.\n",
        "6. d4 Na5": "!? More usual is ...exd4, but the text move has some benefits of creating an off balance situation for white who now has to consider what to do about the attack on the bishop.\n",
        "7. Bxf7+": "!? Not a guarantee of a win by any means, but this certainly creates a disruption for black who is encouraged to recapture with the king, a move which loses tempo by another check on the next move. This move was played in the adventurous spirit of the opening.\n",
        "7... Kxf7 8. Nxe5+ Kf8": "This looks better than keeping the king in the open.\n",
        "9. Qh5": "?! I continue the attack, but with some reservations that this move may be a little soon. I had considered Nd2 or 0-0 as good alternatives.\n",
        "9... Qe8": "Stops the threat of Qf7#\n",
        "10. Qf3+": "I know the queen has to retreat from future persecution, and do so with a parting check.\n",
        "10... Nf6": "Sensible because it offers the king the g7 square to break the pin.\n",
        "11. O-O": "Activates the rook.\n",
        "11... d6": "This move was expected, and it does some good things like kick menacing knight and activates the bishop with a future threat of ...Bg4\n",
        "12. Nd3": "The only healthy square for the knight.\n",
        "12... Bg4": "! The computer cracks out a good move which forces the decision to lose the pin or keep a piece.\n",
        "13. Qf4": "!? I decide to play on in a risky manner. Hiarcs9 calls my move questionable and attaches a ?, but I have a plan and am not going to let something minor like losing a piece to get in the way.\n",
        "13... Be2": "Choices, choices. Save a rook? Save a knight?\n",
        "14. e5": "!? Neither! Playing for maximum attacking potential. Its high risk, but at this point I am comitted.\n",
        "14... dxe5": "An immediate ...Bxf1 was also possible. The text move only enacts a sub plot that was going to be played anyways.\n",
        "15. dxe5": "Still maintaining a threat of attack (not just to the knight).\n",
        "15... Bxd3": "?! I consider this move to be lesser than ...Bxf1 because the rook seems to be more of a threat in the ensuing moves. Hiarcs9 confirms my analysis.\n",
        "16. Re1": "!? Adding what could be another pin after exf6.\n",
        "16... Bd6": "! A nice move which stops exf6.\n",
        "17. Bd2": "A dual purpose move which strengthens the rook and clears another piece off the back rank, a much needed move.\n",
        "17... Qd7": "This breaks the pin, but relinquishes the bishop in the process.\n",
        "18. Qf3": "!? I have a fork, so decide to enable exf6 because it appears to be a better choice. The text move also attacks the loose bishop while maintaining the pin on f6.\n",
        "18... Bc5": "Enabling protection for the bishop on d3 and setting up for ...Bxb1!\n",
        "19. exf6": "!? The question is asked, what is better to attack or to make the d2 bishop safe? I choose a high risk alternative because I can achieve a nice attack on the king and because losing the d2 bishop is not as bad as it would look due to the positional gains that white achieves.\n",
        "19... Bxb1": "Black asks the question, take a bishop or save a bishop? Hiarcs9 considers this move a blunder, rates it ??. Considering the result, this may be so, but on the short view the computer was likely thinking tactical swindle to gain a bishop at d2. This move alone does not seem to lose the game in my opinion, but when it is coupled with the later ...Qxa2, then it becomes a disaster for black.\n",
        "20. Raxb1": "I consider this choice the better as it ties the rooks, dispatches one of the most active pieces for black, and enables a nice counter move after black takes the bishop at d2. Although the counter move is not seen immediately, it is saved for just the right moment, then played. Hiarcs9 considers the position equal, but I feel it is more +/- due to a superior position for white.\n",
        "20... Qxd2": "The text move does not even get a change in rating by Hiarcs9 seems to confirm my previous analysis that white was better, and now is even more so, even though it is not obvious.\n",
        "21. fxg7+": "Shifting the action to the other side of the board, puts the king into motion. Expecting ...Kxg7 even though not forced.\n",
        "21... Kxg7 22. Qg4+": "Beginning a small king hunt.\n",
        "22... Kf8 23. Qf5+": "A square selected because of the check and because it gains the active dangerous bishop and creates another threat against the knight afterwards, and because there is no blocking this check.\n",
        "23... Kg8": "Hiarcs9 considers ...Kg7 better. I evaluate it to give white just a slight edge, so it is certainly better than the text move. (23... Kg7 24. Qxc5 Rhf8 25. Qe5+ Kg8 26. Re2 Qd6 27. Qxa5) +/=\n",
        "24. Qxc5": "It became obvious that the bishop needed to go because it was enabling the threat of ...Qxf2+ and it was taking squares away from the attack I was generating. Hiarcs9 sees the position as +/- and maybe I am overestimating, but it looks like ++/- to me.\n",
        "24... Nc6": "Considered a blunder and marked as ?? by Hiarcs9. Undoubtedly because of the next move.\n",
        "25. Rbd1": "! A very good move that forces the queen off the powerful d file and enables some strategic ideas that achieve a nice attack against the king, namely the move Rd7.\n",
        "25... Qxa2": "?! Gaining a pawn but losing control of the position. The move has one redeeming factor in that it prevents check on the a2-g8 diagonal.\n",
        "26. Qg5+": "Taking advantage of the free square by a chasing check. And the rest is a matter of technique. Just had to say that for the fun of it.\n",
        "26... Kf8 27. Rd7": "! The follow up to the prior Rbd1 move. This move enables the mating complex.\n",
        "27... Qxf2+": "?? The computer loses its mind. This alternative is bad (27...Qg8 28.Qf6+ Qf7 29.Qxf7#), but (27...Qf7 28.Rxf7 Kxf7) gives black chances.\n",
        "28. Kxf2 Ne7 29. Rdxe7 c6 30. Qg7#": "Win because black made some weak moves, did not pick the best alternatives, and because of a reasonable application of strategy by white, taking advantage of inferior moves by black.\n"
    },
    "url": "https://gameknot.com/annotation.pl/an-evans-gambit-man-vs-computer-m30?gm=23953",
    "gameName": "An Evans Gambit Man vs Computer M30",
    "players": "ChessKnave  vs. Computer - FA030 ",
    "opening": "Evans gambit (C51), Cordel variation"
}