{
    "moves": {
        "1. c4": "-/-> d5\n",
        "1... c5 2. Nf3": "-/-> e5\n",
        "2... Nf6": "--> d5\n",
        "3. Nc3": "--> d5\n",
        "3... Nc6": "-->e5\n",
        "4. d4": "!? Activating the position, opens.\n",
        "4... cxd4 5. Nxd4": "+/== White has just a little better position.\n",
        "5... e6": "--> d5\n",
        "6. Bf4": "!? Taking the fight to c7.\n",
        "6... d5": "?! Short-sighted, missing the Nc7 theme, but perhaps with hopes of a queen trade to reduce the build up of forces, ...Nxd4 looks better.\n",
        "7. Ndb5": "! +/-  ^ Nc7+ fork to gain a rook.\n",
        "7... Ke7": "I am not sure if there is a better way to handle the threat than the text move. An alternate line is lesser, (7...e5 8.cd ef4 9.dc6 Qd1+ 10.Rd1 Rb8 (10...bc? 11.Nc7+ !) Na7)\n",
        "8. cxd5": "Tearing down the walls, not letting the opportunity slip away.\n",
        "8... Nxd5 9. Nxd5+": "Maintains the bishop by this exchange.\n",
        "9... Qxd5 10. Qa4": "!? Trying to stir up some good counterplay, this move saves the knight, avoids a queen trade, enables Nc7!\n",
        "10... Kd8": "?? Walks into a terrible skewer.\n",
        "11. Rd1": "++/-\n",
        "11... Bb4+": "An attempt to distract in hopes of saving the queen.\n",
        "12. Bd2": "Refutes the check.\n",
        "12... Bc5": "Avoids the loss of the bishop, but it may have been better to just move the queen due to the impending threat of moving bishop.\n",
        "13. Bc3": "! Prevents ...Bb4+ and also avoids (13.Bb4? Qxd1+ 14.Qxd1 Bxb4) losing the bishop needlessly.\n",
        "13... Nd4": "An attempt to save the queen loses material.\n",
        "14. Bxd4": "! Not 14.Nxd4 because it keeps Nc7! in reserve.\n",
        "14... Bxd4": "?? The very last chance to save the queen is lost.\n",
        "15. Rxd4 Bd7": "? Better is Qxd4\n",
        "16. Rxd5 exd5 17. Qb3": "!? There is strategy here of attaining Qg3 for a double attack.\n",
        "17... Be6": "A weak threat.\n",
        "18. Qg3": "! Qc7+ and Qxg7 are threatened.\n",
        "18... Ke7 19. Qd6+": "Gaining tempo, else 19.Qxg7 ? loses tempo to 19...Rg8\n",
        "19... Kf6 20. e3": "It was becoming apparent that this move was needed to activate more pieces.\n",
        "20... Rhd8": "Expected.\n",
        "21. Qf4+": "Gains a tempo to offset the loss of tempo from the recent attack.\n",
        "21... Kg6": "?! I have some reservations about this move due to the proximity to attack.\n",
        "22. Bd3+": "An obvious move, develops, attacks.\n",
        "22... f5": "Necessary to avoid echanging bishops.\n",
        "23. Nc7": "! Finally the tactic is applied to c7 where this time it snares a rook and bishop in the fork.\n",
        "23... Kf7": "Perhaps the best move to try and hold the position together.\n",
        "24. Nxa8": "The choice between R and B was not made for material reasons. I liked the idea of reducing the best coordination of the black pieces, and this move appears to offer more than 24.Nxe6 due to the bishop at e6 being bad vs the d3 bishop being good, plus it allows the queen to obtain c7 which is positionally favorable.\n",
        "24... Rxa8 25. Qc7+ Kg8 26. h4": "?! This is one of those decisions where I could have simply just taken the safe route with 0-0, but I wanted to have more fun with the position. In retrospect I may have won sooner with 0-0.\n",
        "26... Rc8 27. Qxb7 Rc1+ 28. Ke2": "The rook sacrifice is not so bad because the black rook becomes trapped on the 8th.\n",
        "28... Rxh1 29. Qe7": "This threatens mate in one with 30.Qe8#\n",
        "29... g6": "Forced.\n",
        "30. Qxe6+": "So the exchange sacrifice gains a favorable position.\n",
        "30... Kg7 31. Bb5": "The idea is to simply bring the bishop into play and coordinate a mating pattern with the queen.\n",
        "31... h5": "The option of (31...Rxh4?? Qe7+) loses of course, so the h4 pawn is indirectly protected.\n",
        "32. Be8 Rg1 33. Qf7+": "The text move seems the shortest route to mate.\n",
        "33... Kh8 34. g3": "Prevents the rook from being a distraction.\n",
        "34... Ra1": "Maybe ...Rb7 for a quick check, but then again it does not matter much at this point.\n",
        "35. Qxg6 Rxa2 36. Qf6+ Kh7 37. Bg6+ Kg8 38. Qf7+ Kh8 39. Qh7#": "An interesting game where I am trying some ideas in the English. Probably ground already tread by others, but I need to learn it myself and I am not familiar with this opening much. I think there were some weak choices by the computer which allowed me to gain some quality positional gains which gave me a base for some strong tactics. Using a combination of strategy and tactics I was able to prevail, even though the finish mate felt clumsy.\n"
    },
    "url": "https://gameknot.com/annotation.pl/an-english-with-4-d4-plus-some-strategy-and-tactics?gm=25658",
    "gameName": "An English with 4.d4 plus some strategy and tactics",
    "players": "ChessKnave  vs. Computer - FH002 ",
    "opening": "English (A30), symmetrical, hedgehog system"
}