{
    "moves": {
        "1. e4": "Hi everyone,\r\n\r\nSadly my unbeaten run in the 1700-1800 mini-tournament came to an end with this game.  Strangely I managed to draw my game with Paul playing him as black.  This opening turns out to be a Latvian.  I seem to get into a very good position, but, I \"win\" the b pawn.  This I think led to me losing the game, but you the jury may think otherwise.  Anyhow, on with the game which starts of with 1. e4.",
        "1... e5 2. Nf3 f5": "2. ...... f5 - this move is played a lot by Latvian players so the opening gets its name.  This move hits out at the e4 pawn.",
        "3. Nxe5": "3. Nxe5 - the most popular and recommended response.",
        "3... Qf6 4. d4 d6": "4. ...... d6 - the knight on e5 is now attacked and must move.  I choose c4.",
        "5. Nc4 fxe4 6. Nc3": "6. Nc3 - development.",
        "6... Qg6 7. Ne3 Nf6 8. Bd2 c6 9. Be2": "9. Be2 - I now pave the way for kingside castling.",
        "9... Be7 10. O-O O-O 11. f3 exf3 12. Bxf3": "12. Bxf3 - pawn trade.",
        "12... Nbd7 13. Be1": "13. Be1 - the first step towards perdition.  Fou Lenoir creates an obstruction on the back rank which will be fatal later on.",
        "13... c5 14. dxc5 dxc5": "14. ....... dxc5 - pawn trade.",
        "15. Ncd5 Nxd5 16. Bxd5+ Kh8": "16. ....... Kh8 - the black king now moves into the corner after a check from Fou Leblanc.  Now comes a rook trade.",
        "17. Rxf8+ Nxf8 18. Qf3": "18. Qf3?! - I think now would have been the time for Bg3.  I could not resist ganging up on that b7 pawn.",
        "18... Ne6 19. Bxb7": "19. Bxb7?? - you would not believe this but this is the losing move.  I think I would have been far better off conceding the bishop pair here and exchanged Fou Leblanc for the knight and then played Bg3.",
        "19... Nd4 20. Qe4 Bxb7 21. Qxb7": "21. Qxb7 - the bishop trade wins a pawn but takes Glenda away from Henry, although it must be said that black's back row is also a little vulnerable.",
        "21... Re8 22. c3": "22. c3?? - Bg3 I think had to be played here and I would have had to have bit the bullet and ceded up the c pawn, but at least I would have been still alive!",
        "22... Ne2+ 23. Kh1 Bd6 24. Nf1": "24. Nf1 - this seemed to be the best move at the time as the knight was en prise.",
        "24... Rf8 25. Ng3 Qh6": "25. ...... Qh6!! - this move threatens Qxh2# should I take the knight on e2.  This knight makes the castled position into a death trap!",
        "26. Qxa7": "26. Qxa7 - I will now need to lose a piece to avoid instant death.  I get as much as I can for the piece.",
        "26... Nxg3+ 27. Bxg3 Bxg3 28. h3": "28. h3 - forced to prevent mate on h2.",
        "28... Bd6": "28. ....... Bd6 - Qa4 would have been the best move here but then black could play Rf4 and then the Wicked Witch would play Qh4 followed by Qg3 threatening mate again on g2.  I would have had to have ceded Glenda for the black bishop on e6 to have prevented the mate.  So I resigned on the grounds of ruinous loss of material.  This I think may be a salutary lesson against pawn grabbing and then holding onto the material when the chips are down.  Do this and you really will go down!  Do you the jury agree?"
    },
    "url": "https://gameknot.com/annotation.pl/an-extremely-poisonous-pawn?gm=23797",
    "gameName": "An extremely poisonous pawn!",
    "players": "jstevens1 (1785) vs. iceberge (1824)",
    "opening": "Latvian (C40), Nimzovich variation"
}