{
    "moves": {
        "1. e4": "Hi everyone!\r\n\r\nThis game was played nearly two years ago against my mentor, Ionadowman.  It has only been now that I could bring myself to annotate it as I was the victim here.  Some mistakes stay in the memory for a long time.  I had almost forgotten that game until my buddy Bob Jacobs lost big material in a recent game (which I will be annotating shortly as The Perils of Giving a Check) against me because he was lulled into a false sense of security by giving a check - it therefore revived the painful memories and I thought that some catharsis was necessary to try and get this loss out of my system once and for all.  One constructive way of doing this is to put this annotation into the Knights Coaching Project Forum because I feel it will be a useful learning tool for the guys who are taking part in Master Freddy's minefield of a Knights Coaching Project Mini-tournament.  Anyhow, the game becomes a Four Knights Game.   We start with the move 1. e4 which is a common starter among players and especially recommended to beginners because it opens lines for the WB on c1 - also to the WQ who can get to h5 - although Master Freddy played the Patzer Opening against me, regicide manuals do not recommend it to beginners!",
        "1... e5 2. Nf3 Nc6 3. Nc3 Nf6": "3. ..... Nf6 - this follows the opening principles of knights before bishops.  All four knights are in play so this is called The Four Knights Opening.",
        "4. d4": "4. d4 - this is called The Scotch Variation of the Four Knights Opening.  It is very much like the Scotch Opening but in that one only one pair of knights are developed.  I decided to take on d4.",
        "4... exd4 5. Nd5": "5. Nd5 - Ion does not recapture with Nxd4 - Qxd4?? is scuicidal because the WQ who in this instance I call the Wicked Witch of the West (enemy queen and very wicked she can be!) will drop to the black knight placed on c6.  This move is called The Belgrade Gambit - possibly because it was popular in that particular country!",
        "5... Be7": "5. ..... Be7 - this developing move is in accordance with my style, it develops a piece and prepares castling.  You, the Inquest Jury - feel free to study the immediate play of 6. Nxe4 or Nxd5 by using the database.",
        "6. Bc4 O-O 7. O-O": "7. 0-0 - both sides tuck their kings away on the kingside.  I now open up the diagonal for my lsb (named Fou Leblanc) by playing d6.  This move holds back e5 and now follows a plethora of exchanges.",
        "7... d6 8. Nxd4 Nxd4 9. Qxd4 Nxd5 10. Bxd5": "10. Bxd5 - a lot of dust has been cleared.  The Wicked Witch is now in a very active position indeed placed on d4, she hits at g7 for starters.  Glenda (my queen) by contrast is still on her home square.  She is sometimes known as Glenda the Defender because of her usually defensive role, but look out, that is not always the case!",
        "10... Bf6 11. Qd3": "11. Qd3 - Fou Lenoir (my dark square bishop) forces the Witch to retreat - she chooses d3 which indirectly hits at h7, with a lsb on the board I must watch out for Old Matey (checkmate) on h7.",
        "11... c6 12. Bb3": "11. c6 - this move drives back the lsb.  Let's see if I can use this to gain better piece placement here.",
        "12... Re8 13. c3 Be6": "13. ...... Be6 - hoping for a trade off but Ion lines his bishop up on c2 - see my previous note.",
        "14. Bc2 g6": "14. ..... g6 - a precaution against such a line up and indeed it is necessary to prevent Fou Lenoir being lost to Ion's pawn plonking himself on e5.  You wouldn't think this move would be possible would you?  It is when your opponent finds himself in Old Matey's shadow (threatened with mate) and has no holding checks available to escape from the discovered attack.",
        "15. Bf4 d5": "15. ..... d5 - this pawn is doubly attacked so it advances.",
        "16. Rfe1 dxe4 17. Qxd8 Raxd8": "17. ...... Rxd8 - queen trade - I like this trade because it enables me to centralise my QR which now occupies the open d column.  Rooks do belong on open and half-open files.",
        "18. Rxe4 Bd5 19. Rxe8+ Rxe8": "19. ...... Rxe8 - rook trade.  It looks like a nice peaceful ending, does it not?  Things can change dramatically though.",
        "20. Be3 a6 21. a4 Kf8 22. a5 Be4": "22. ..... Be4 - after a few pawn moves I get carried away with trying to swap off - sometimes it is a good thing, in this case it is a very bad thing.  First comes the decoy 23. Bh6+.",
        "23. Bh6+ Bg7": "23. ..... Bg7 - If I move Henry my king to e7 then I lose Fou Leblanc outright to Bxe4 so I play this move.  Now Henry is decoyed from the BR on e8 by Bxg7+.  Henry must recapture and now Ion plays the deadening Re1 putting Fou Leblanc in a pin.  I have 3 options, I can lose Fou Leblanc, I can drop the exchange or I can wave the white flag (resign) on the grounds of ruinous loss of material.  I chose Option 3.  If you, the Inquest Jury (dear readers) have any comments on an alternative plan to 22. ...... Be4 please feel free to comment.  Hope you have had a good read - bye for now - Joanne",
        "24. Bxg7+ Kxg7 25. Re1": ""
    },
    "url": "https://gameknot.com/annotation.pl/an-expert-lesson-in-pins-and-deflections?gm=28110",
    "gameName": "An Expert Lesson in Pins and Deflections",
    "players": "ionadowman (2036) vs. jstevens1 (1586)",
    "opening": "Four knights (C47), Belgrade gambit"
}