{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Bc4": "!? Not seen very often anymore but I have been enjoying the two knights and Evan's gambit. My opponent also plays the open Lopez and I didn't have much theory behind me in that opening.",
        "3... Nf6": "!? Many consider this very hard to defend in OTB play.",
        "4. Ng5 d5 5. exd5 Na5": "Main line. Nxd5 is a mistake after d4 white has a strong attack: See http://gameknot.com/annotation.pl/lolli-not-so-tasty?gm=42992 or Nxf7 the fried liver attack",
        "6. Bb5+ c6 7. dxc6 bxc6 8. Ba4": "? My opponent missed this and I got away with it. Theory is the much better Be2.",
        "8... Bc5": "Better was h6 and if Nf3? e4 Ne5 (No better is Nh4 g5 and it drops)  (Ng1 must be played and black then plays Bg4 with pressure on white) Bd6 (wins the knight because) f4?? Bg4!! Wins the queen! So Nh3 is the move when Bg4 f3 Bxh3 gxh3 cripples White's kingside with an interesting game in progress.",
        "9. Qf3": "I played this rather than O-O because after Bg4 the queen is more active on the third rank than on e1. Note after Bg4 I now play Qc3! with multiple threats.",
        "9... O-O 10. O-O": "Rather than take the pawn and lose time I castle. ",
        "10... Bg4 11. Qg3": "I wanted to keep c3 free for now.",
        "11... Re8 12. d3": "Planning Be3 and if Bxe3 fxe3",
        "12... Rb8": "To keep my bishop on c1",
        "13. Nc3 Bf5": "This surprised me",
        "14. Qf3 Bg4 15. Qg3 Bf5 16. Qf3": "I offer my opponent a draw without offering him a draw if that makes sense. After Bg4 Qg3 is draw by 3 fold repetition. ",
        "16... Qd7": "He declines although he later told me he probably should have taken it. Now I have",
        "17. Nce4 Nxe4 18. Nxe4 Bxe4 19. dxe4": "Simplifies and I am a pawn up with two bishops. I captured with pawn so I could move queen",
        "19... Rb4": "?!",
        "20. b3 Rb6": "After making the weird Rb4 he now blocks of the a retreat square for the bishop",
        "21. a3": "I know threaten the fork b4",
        "21... Bd6": "Qd4 doesn't work after Be3",
        "22. Rd1": "Pinning the bishop which later becomes a tactical threat",
        "22... Qc7 23. b4 Nb7 24. Bb3": "I should have played c4 first but now I have the threat Qxf7+ Qxf7 Bxf7 Rxd6. If the Knight moves away",
        "24... a5": "!?",
        "25. bxa5 Nxa5": "? Drops the pawn after a5 I expected Ra6",
        "26. Qxf7+ Qxf7 27. Bxf7+ Kxf7 28. Rxd6": "Although I am two pawns up with a B v N advantage I have poor development and black has centralised K ",
        "28... Ke7 29. Rd3": "I should have gone back to d1",
        "29... Reb8 30. Bg5+": "I develop my Bishop whilst allowing my rook to come back to the first rank to defend",
        "30... Ke6 31. Rdd1 Rb6b2 32. Bd2 Nc4 33. Bb4": "Trapping the rook wanting to force an exchange via Rxc2 Rdc1 Rxc1 Rxc1 allowing me to get the c-pawn and have an outside passer",
        "33... Rb5": "Wanting to play b5",
        "34. Rdc1": "I get to paasive maybe c3 was the way to go followed by marching the a-pawn",
        "34... Rb8": "Because b5 Bc3 wins the exchange",
        "35. Kf1 Nd6 36. f3": "Looking to swap flanks. Maybe Bxd6 Kxd6 a4 is better",
        "36... Nb5 37. Kg1": "?",
        "37... Nd4 38. Kf1": "I offer a draw as Rxc2 Rxc2 Nxc2 Eventually leads to swapping off the minor pieces and Q-Side pawns with a 4 v 3 Rook ending which is a draw. Comments welcome please help me find a better line to the one played"
    },
    "url": "https://gameknot.com/annotation.pl/an-expert-draw?gm=43912",
    "gameName": "An expert draw",
    "players": "Me (1638) vs. Opponent (2049)",
    "opening": "two knights defence (C58), Bogolyubov variation"
}