{
    "moves": {
        "1. Nf3": "Hi everyone!\r\n\r\nYou may all recall me saying a few months ago that to exchange down into a pure K & P ending a pawn down was scuicide.  Well, my buddy Jim Friar (a very strong expert who has an optimum rating of 2092 and has a victory against an International Master stamped on his Gameknot chessic CV) made me eat some of my words!  Towards the end you will see that Jim deliberately exchanged down into such an ending and won!  How, well you will just have to read on!  I start off with the Reti Opening, 1. Nf3.",
        "1... c5 2. c4 Nc6 3. Nc3": "3. Nc3 - out come the cavalry!",
        "3... g6 4. e3 Bg7 5. d4": "5. d4 - pawn break.",
        "5... d6 6. Be2 e6 7. O-O Nge7": "7. ......... Nge7 - after I castled Jim prepares to castle himself with this move.  Everything has been so far so quiet do you agree?  Well, it is all about to change!",
        "8. dxc5": "8. dxc5 - first a pawn trade.",
        "8... dxc5 9. Qxd8+ Nxd8": "9. ......... Nxd8 - now a queen trade.",
        "10. Ne4 b6 11. Rb1 O-O": "11. ........ 0-0 - Jim now castles.",
        "12. b3 Bb7 13. Ned2": "13. Nde2 - takes evasive action.",
        "13... e5 14. Bb2": "14. Bb2 - Fou Lenoir finally emerges from his pit.",
        "14... Nec6 15. a3 Ne6 16. Rfd1": "16. Rfd1 - preparing a trade of heavies on the d file.",
        "16... Rad8 17. Nf1 e4 18. Rxd8 Rxd8 19. Ne1": "19. Ne1 - more evasive action.  Jim now starts a kingside pawn roll with f5.",
        "19... f5 20. Bxg7 Kxg7": "20. ......... Kxg7 - bishop trade.",
        "21. Rd1 Ne5 22. Rxd8 Nxd8": "22. ......... Nxd8 - a rook trade.",
        "23. Nd2 g5 24. Nb1 Ndf7 25. Nc3": "25. Nc3 - feeling that I have a reasonable position I decided to offer a draw here.  Jim wanted to play on because he felt it was still too early in the game.   As it turned out my position did go south from here, although it was exactly 20 moves later that I was to wave the white flag.  Looking at the position now I see that black does have a slight edge due to the placement of his knight on e5.  Still, if you don't ask, you don't get.",
        "25... g4 26. Kf1 h5": "26. ...... h5 - the pawn roll continues.",
        "27. Nb5": "27. Nb5 - I now try to improve the position of my minor pieces.",
        "27... a5 28. g3": "28. g3 - trying to hold up the pawn roll but would h3 have been an improvement?",
        "28... Bc6 29. Ng2": "29. Ng2 - would Nc7 have been better here?  I wanted to put my knight on f5 and he does get there but it doesn't help in the end.",
        "29... Bxb5 30. cxb5": "30. cxb5 - B for N trade.",
        "30... Nd6 31. Nf4 c4": "31. ........ c4! - unexpected as it will momentarily draw my pawns together, but there is an idea behind this.  Look at those two black horsies.",
        "32. bxc4 Nexc4": "32. .......... Nexc4 - pawn trade.",
        "33. Nxh5+ Kf7": "33. ........ Kf7 - a centralisation of the BK - vital for the endgame.",
        "34. Nf4 Nxa3 35. Nd5": "35. Nd5 - hitting out at the black b6 pawn.",
        "35... Nac4 36. Ke1": "36. Ke1 - worried about the remote passer I decide to move Henry towards the kingside.",
        "36... Ke6 37. Nc3": "37. Nc3 - defends b5 pawn.",
        "37... Ne5 38. Kd1 Nd3 39. Bxd3 exd3": "39. ......... exd3 - B for N trade.",
        "40. Kd2 Ne4+ 41. Kxd3 Nxc3": "41. ....... Nxc3 - I expected Nxf2 which might have led to a draw but although this move makes me a pawn up in a K & P ending it wins!  Now, here are 2 factors that influence things here.  1. Jim has a remote passer on the a column.  2. My kingside pawns are backward so there is no way of me forcing a passer on the kingside. 3. Jim's king can quite easily infiltrate the light squares and so the kingside pawns become sitting ducks.  Henry tries to prevent this infiltration but to no avail.",
        "42. Kxc3 Ke5 43. Kd3 Kd5 44. Kc3": "44. Kc3 - I am in Zugzwang!",
        "44... Ke4 45. Kc4 Kf3": "45. ........ Kf3.  Here I resign on the grounds of ruinous loss of material.  I will now give you some analysis and you will see why:- Variation A 46. Kd5 a4 47. Kc4 Kxf2 48. Kb4 Kg2 49. Kxa4 Kxh2 50. Kb4 Kxg3 51. Kc4 Kf2 52. Kd5 g3 53. Kc6 g2 54. Kxb6 g1=Q Variation B 46. Kd5 a4 47. Kc6 a3 48. Kxb6 a2 49. Kc7 a1=Q 50. b6 Qe5+.\r\n\r\nAll in all an instructive game I feel.  Do you the jury agree?"
    },
    "url": "https://gameknot.com/annotation.pl/an-exception-to-the-rule?gm=24210",
    "gameName": "An Exception to the Rule",
    "players": "jstevens1 (1781) vs. therealjimfriar (2007)",
    "opening": "Reti opening (A04)"
}