{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6": "The typical first two moves for me. As I play more games, the Ruy Lopez is becoming a bit less common than before.",
        "3. Bc4": "Pretty good control of the centre for white.",
        "3... d6": "Is this OK? I don't play Nf6 right away in case White does Ng5.",
        "4. h3": "I understand that white was trying to prevent Bg4, but this seems like a bit of a wasted move.",
        "4... Nf6": "I decided that I should just develop my knight, even if it does allow Ng5.",
        "5. Ng5": "As expected.",
        "5... Be6": "I didn't want to block any of my bishops with my queen to defend f7, but 6. Bxe6 fxe6 seems like it weakens my kingside a bit.",
        "6. Bb5": "Threatening to double my pawns.",
        "6... a6": "I decide to threaten the bishop, because Bxc6 opens up the b-file for my rook.",
        "7. Bxc6+ bxc6": "I now have an open file and good control of the centre.",
        "8. O-O Qd7": "I line up for a bishop sacrifice on h3, but the knight of g5 must move first to ensure success.",
        "9. c3": "Why this move?",
        "9... h6": "I apply the pressure onto the g5 knight so I can strike at h3.",
        "10. d4": "?? I don't know why this move was done. It just seems to give away a knight.",
        "10... hxg5 11. f3": "With rook, bishop and queen all pointed at h3, as well as this weakening move, a successful sacrifice may be easier than I thought!",
        "11... Bxh3": "My sacrifice begins.",
        "12. gxh3 Qxh3": "I think I have successfully weakened white's kingside.",
        "13. Kf2": "Avoiding Qg3#.",
        "13... Qh2+": "Chasing the king.",
        "14. Ke1": "White's king is now on its original square, with no living pieces effectively developed.",
        "14... exd4": "I decide to take the pawn.",
        "15. cxd4 Rb8": "Exploiting the open b-file.",
        "16. b3 d5": "Asking for an exchange.",
        "17. e5 Nh5": "I'm trying to bring my knight closer to the action.",
        "18. Bxg5": "Taking the pawn.",
        "18... Nf4": "Forcing the exchange.",
        "19. Bxf4 Qxf4 20. Nc3 Bb4": "Pinning the knight.",
        "21. Qd3 Bxc3+": "I decide to take anyway.",
        "22. Qxc3 Rb6": "Defending c6.",
        "23. Rd1 Rh2": "Cutting off all of the king's escape squares.",
        "24. a4": "?? I guess white thought that I was trying to get his a-pawn. However, this allows a mate in two.",
        "24... Qg3+": "Check.",
        "25. Rf2": "The only legal move.",
        "25... Qxf2#": "Checkmate! Feel free to comment and give lots of constructive criticism, for this was my 100th game and I wish for the next 100 to be better than the first!"
    },
    "url": "https://gameknot.com/annotation.pl/an-important-milestone?gm=58076",
    "gameName": "An important milestone",
    "players": "seblou (1246) vs. reubencpiplupyay (1273)",
    "opening": "King's pawn game (C50)"
}