{
    "moves": {
        "1. e4": "my fav opening and covers all the classics, control of middle, opening for kings side bishop",
        "1... c6": "Should you always start off with a plan, even right from the start? I've never been sure about this and in fact I don't see how it would be possible. Surely, for at least the first few moves, things are dictated by what your opponent does. Okay then, here's the plan. Somehow I'm going to win, but the downside is that so far I have no idea how this will be done. I got a little bored by e5 as a response to e4, so I'm experimenting along the c file. I have used c5 a few times but I think here, I will have a look at c6. Both of which are with the idea of taking a chunk out of the centre if possible.",
        "2. d4": "no threats so why not take more of the middle! in these games have found it hard to maintain these two pawns but it's worth it.",
        "2... d5": "I would have played 2.d4 too, so no complaints so far. I feel my next has to be 2.d5 otherwise I would be giving away far too much of the centre. I'm thinking now that c6 is not the best response to 1.e4 . I have refined the plan slightly. What I'm going to do is watch my opponents early moves carefully to see if I can spot any stray moves which might give me a chance to seize the initiative. So you see, already the plan is taking shape.",
        "3. Nc3": "piece development and protection for e pawn. i think this is better than f3 which after dxe4 fxe4 leaves my king a little too exposed this early.",
        "3... dxe4": "Remembering a piece of advice I was given some time ago. \"In the opening, taking the offered piece is the strongest move\". So that's what I've done here. I guess it would be good if I understood why, but I don't. I guess it forces him to recapture, so does that then give me the tempo? Is that why it should be done?\n(Suddenly remembers that it would be a good idea to actually make the move instead of just talking about it). ",
        "4. Nxe4": "capture back pawn. have the feeling the N on e4 will be chased away soon enough but it's a solid enough middle for the moment.",
        "4... Nd7": "Already I have gone off of the 1.c6 idea. I think I need to do a lot more work before i try it again, if ever. He now has a good position in the centre which is just what I was hoping to avoid.\nI have been looking around here for a decent move and I would like to play d5 to try to get a foothold on the centre and also prepare the way for some movement in my king side pieces. However, I feel that before I can do that, 4Nd7 has to be played. Note the way this neatly boxes in my light bishop. I will have to try to sort that problem out as we go along.",
        "5. Bc4": "first off there is no immediate threat on either my pawn or knight so i'm happy to leave them hanging in the very short term since there are a few options for backing them up. you playing f5 would be a hassle since i'd have to waste a move retreating my N. i'm keen to castle kingside asap so i need to get my king side pieces active. my options are Nf3, Bd3 or Bc4. i'm usually quite aggressive so i'll play 5. Bc4 which can be followed up with the threat of 6. Qf3 7. Qxf7#. there is no d pawn to threaten my B on c4 and if you play 5... b5 i can retreat with 6. Bb3 and still have the pressure on f7, always a weak square for black",
        "5... Ngf6": "Before calling it a day yesterday, i had a long look at this game and tried to predict the next few best moves for both sides. The little sequence I came up with was 5. Nf3 Nf6 6. Ng3 e6 7. Bd3 c5.\nHowever, this morning I am faced with Bc4, which Mat at least mentioned in his comment. This I reckon, is another point against early plans. How can you possibly predict what your opponent will consider to be the next best move? Anyway, I think sticking with 5. nf6 is still an okay move. It connects my knights which might be useful. It doesn't immediately help with the f7 weakness but I still think I can deal with that by 6. e6 if he decides to go down that route. 6. e6 also opens a line for my dark bishop and prepares the way for king side castling, which I would like to do asap given the way this game seems to be heading. I don't think there is any value in trying to chase the bishop away just yet. It would only waste time which I should be spending on development. Looking around the board, I can't see any other moves I like better, so I'm going to stick with 5. Ngf6",
        "6. f3": "Nf6 presents an immediate threat on my unguarded N at e4 so i have to deal with it. retreating it seems a waste of development opportunity and goes against the classic don't move the same piece twice in the opening. i think either f3 or Qe2 is viable. normally i hate defending a minor piece with the queen so i might defend with f3. an exchange of N's, 6... Nxe4 7. fxe4 is in my favor i think since it gives strong pawns in the center and after a king side castle an open f rank for the rook can be quite powerful.",
        "6... Nxe4": "I take your point about the attacking possibilities for the rook along the f file but I also think that the open f file creates a weakness in the kings defences. Always assuming that you go for king side castling. It is true that your position in the centre would look solid and my lack of development worries me. Having said that though, I think it has to be done so my choice is 6.Nxe4.",
        "7. fxe4": "pretty much forced to get back the material, nothing else gains more in the immedidate move. the pressure is now on to get the knight out for the king side castle. i think 8.Nf3 is a better choice than 8.Ne2 since it keeps the N close. 8.Qf3 is also a possibility threatening 9.Qxf7# but it seems any black development move next will stop it. no matter what i need to be careful since all my pieces on the 4th rank are effectively hanging at the moment. i expect something like 7..e6 from black next to open up the bishop and queen and help f7",
        "7... e5": "Well, white is expecting 7.e6 which is a move i had been wanting to play and spoke about before. I think in the current position 7.e5 would be better. It still opens the diagonal that I wanted for my bishop and a possibility of the queen giving check on h4 and white would then have to further weaken the king side defences to counter it. In my view, the threat to f7 is no longer immediate now that the knight is out of the way. It really has to be either e5 or e6 but which one? Okay, e5 it will be. I'm not going too make any predictions yet about the next few moves as I feel that there are just too many possibilities here.",
        "8. Qf3": "already i'm reconsidering whether taking with the f pawn and leaving my f file open was a good idea...\n\ni need to defend the d pawn and can do so in a number of ways. ( it's already protected by the queen but i always find allocating the queen to pawn protection at any time of the game is a bad idea. the only time this seems ok is if the exchange, in this case exd4 Qxd4 is guaranteed soon and would put the queen in a good position, and i think neither is the case here) c3, Be3, Ne2 or Nf3 would all develop a piece with an extra defender on d4 but i'm going for something a bit more agressive, defence by threat, Qf3.\n  \nif the threat is ignored\n8... exd4 9. Qxf7#\n\nif the mate is directly blocked\n8... Nf6 9. dxe5 wins the knight (i think)  \n\n8... f6 9. dxe5 fxe5 10. Qf7#\n8... f6 9. dxe5 Nxe5 (more likely) 10. Qh5+ will cause a ruckus.\n\nlots of interesting lines coming out of this one, including the ones i missed that will no doubt win the queen for black ;P",
        "8... Nf6": "My apologies for the delay, been away for a few days. I enjoyed the break but was horrified to get back to this game and see the enormous threat to my f7 square. Of course, this must be dealt with before I can think about too much else. I think my two most realistic options are 8. f6 or 8. Nf6. I read White's comment about Nf6 losing the knight but I think I may be able to get around this with a counter threat to his queen. (assuming 9. d x e5 Bg4 or even 9.Qe7). Also, f6 would mean moving one of my king defending pawns, (assuming I get a chance to castle king side at some point), and I prefer not to move the pawn just yet. After another look around to make sure I'm not missing anything else, I have come down in favour of 9. Nf6 as I'm now getting more confident that I can hang on to said knight.",
        "9. Bg5": "i didn't pick the counter threat of Bg4 and it's more than just a threat on the queen! for a moment i was thinking it could be avoided by playing 9. dxe5 Bg4 10. Qf4 but the threat changes from against the queen to against the king after 10... Qd1+. i also need to consider the additional pressure the black queen puts on d4 now the N has moved. i'm not sure how to keep d4? 9. c3 exd4 10. cxd4 Qxd4 doesn't look nice for white. 9. Bg5, a pin on the queen, looks interesting as by NOT taking with the d pawn i don't allow the open d file as well as exposing my R as a defender for d1.\n\nif 9. Bg5 exd4 10. e5 threatens the N again.\nif 9. Bg5 Bg4 10. Qf2 exd4 11. e5 and we're back to the threatened N. \nif 9. Bg5 h6. 10. Bh4 g5 11. Bg3 the pin is gone but the king side pawns are all over the place.\nif 9. Bg5 Be7 i think that 10. Bxf7 would be very interesting! since 10... Kxf7 pins the N to king\n",
        "9... Qxd4": "So many possibilities. I had a long look at 9.exd4, however, I have a feeling black might castle long and this would leave the d4 pawn needing to find protection from somewhere. I have decided that, to me at least, 9. Qxd4 looks the stronger move. After that, I'm fairly sure that white will play 10. Bxf6 to which I would reply Q xc4 which leaves me just one pawn down. If this scenario is followed, then I have just one unprotected pawn on e5 and I don't see how to defend it just yet. Also, I'm pleased to still have a bishop pair even though they are not in the game too much just yet. They also both currently have nice open diagonals to work along. If once again my little scenario is followed, if I were white, I would then choose 0-0-0 and this is the move that worries me a lot because it would then give the white rook control of the now open d file.\n"
    },
    "url": "https://gameknot.com/annotation.pl/an-open-unrated-game?gm=23307",
    "gameName": "An open unrated game",
    "players": "matpalm (1334) vs. aandersen (1154)",
    "opening": "Caro-Kann (B17), Steinitz variation"
}