{
    "moves": {
        "1. d4": "The first move is d4, which controls c5 and e5.",
        "1... d5": "Black counters, preventing e4 unless white wants to play a gambit.",
        "2. c3": "This is not as agressive as c4 or e4, but white gets a solid center and takes black out of the opening books.",
        "2... Bf5": "Probably not the best move in the position.  Black is not quite sure where the bishop is best placed, and b7 is weak.  Those two points are the reason behind my next move.",
        "3. g4": "This appears to be my invention, as I have not been able to find it on any databases.  Black will most likely take the pawn, and will lose a tempo.",
        "3... Bxg4": "There is no reason why black should decline the pawn.  In some cases, white can simply get a better form of the gambit.  For example: 3...Bd7 4.Bf4 Bxg4 and white is a tempo ahead of the regular line. ",
        "4. Bh3": "White now tries to exchange the light squared bishops, making the b7 square even weaker. ",
        "4... Bh5": "This is a strange move, as black, up a pawn, would like to trade down.  On the plus side, the e pawn is pinned and the g1 knight is dicouraged from moving to f3.",
        "5. Qb3": "Attacking the weak b7 pawn.  Bf4 might be better, as the two white bishops are ready to attack on the queenside.",
        "5... b6": "Pretty much forced unless black wants to lose a lot of material.  Now white should play Bf4 and wait for black to make a mistake.  For example: 6.Bf4 c5?? 7.Bxb8! Qxb8 8.Qb5+ Kd8 9.Qd7# ",
        "6. Qb5+": "But this move is weak, as black can win tempi because of the premature queen attack.  Bf4 is better.",
        "6... c6": "Now the white queen loses a tempo.",
        "7. Qa4": "Trying to keep the queen on the a4-e8 diagonal.",
        "7... b5": "This move is not great, as the pawn structure is weakened and c5 becomes an outpost for a knight.",
        "8. Qb3": "The queen retreats and continues to put pressure on the b5 and d5 pawns.",
        "8... e6": "Black now plans to develop the dark square bishop.  Nf6 might have been better, as it controls the e4 square.",
        "9. Bf4": "The bishop develops to f4 and eyes the b8 knight.  Now the b1 knight can come to d2 and support an e4 push. ",
        "9... Nf6": "The knight comes out to f6 and guards the e4 square.",
        "10. Bg5": "This probably wasn't the best move, as it loses a tempo.  Better is Nd2.",
        "10... h6": "Be7 is slightly better, but h6 is just fine.",
        "11. Bh4": "Bf4 might have been a bit better.",
        "11... Be7": "Now black blocks up the h4-d8 diagonal.  The white bishops are barely doing anything.",
        "12. Nd2": "The plan might be Bxf6 and e4.",
        "12... O-O": "Black castles, but he probably should do something about the c6 pawn first. ",
        "13. f3": "Adding another attacker to the e4 square.  Bxf6 might have been better, although it gives black the bishop pair.",
        "13... a5": "Not good, as black's pawn structure gets even worse.  Now a4 here for white really would have caused problems for black.",
        "14. e4": "Too early.  Instead, white should play a4 to halt black's queenside play.",
        "14... a4": "This is why white should have played a4.  The white queen is forced even farther back.  Note, however, that black's pawn structure is very weak.",
        "15. Qc2": "Now white runs into problems along the g6-b1 diagonal.",
        "15... Bg6": "Pinning the e4 pawn and causing lots of problems for white.",
        "16. Qd1": "Here 16...exd5 17.fxe5 Nxe5 18.Nxe5 Bxe5 wins another pawn for black, but opens up the position for an attack for white.",
        "16... c5": "Black seeks to destroy the white center.  Now the b8 knight can come to c6.",
        "17. e5": "The f6 knight is driven off to the side of the board.",
        "17... Nh5": "The black knight can now come to f4 and white's king is starting to get a bit nervous.",
        "18. Bf2": "Better might be Bxe7 or Bg3.  White is in big trouble.",
        "18... Nf4": "White is extremely cramped, as Ne2 fails to Nxh3.",
        "19. Bf1": "White's king has no moves.  It looks like white might be the victim of a composition type mate.",
        "19... Bh4": "White has big king trouble.  If Bxh4 then Qxh4#",
        "20. Bxb5": "Grabbing a pawn.  White's king will have to find shelter.",
        "20... Bxf2+": "Although this looks good, Bd3 is better.  ",
        "21. Kxf2": "Now the white king embarks on a journey.",
        "21... Qh4+": "The obvious and good check.",
        "22. Ke3": "Ke1 is also okay, although it won't be pleasant for white.",
        "22... cxd4+": "A mistake, as it allows white to put a rook on the c file for some breathing room.",
        "23. cxd4": "White is still is trouble, though.",
        "23... Ng2+": "Forcing white's reply.",
        "24. Ke2": "Now black will win white's d4 pawn.  There might be a possiblity of trapping black's knight on g2.",
        "24... Qxd4": "Black wins a pawn.",
        "25. Qf1": "Possible is 25...Bd3+ 26.Bxd3 Nf4+ 27.Kd1 Qxd3 trying to exchange queens.",
        "25... Qe3+": "A different check that probably is just as good as Bd3+",
        "26. Kd1": "Now black should play Nf4 and Bd3.",
        "26... Qg5": "The threat is Ne3+",
        "27. f4": "Breaking up the Ne3+ threat.",
        "27... Qg4+": "Allowing white to get his bishop back into the game.",
        "28. Be2": "White manages to keep the position together.",
        "28... Ne3+": "If white plays Kc1 then Rc8+ wins a piece for a pawn.  A line might be: 29.Kc1 Rc8+ 30.Nc4 dxc4. ",
        "29. Ke1": "So white is forced to play Ke1. ",
        "29... Qh4+": "Black has a tactic that will win a rook.",
        "30. Qf2": "Here black can win a rook 30...Nc2+ 31.Kf1 Qxf2+ 32.Kxf2 Nxa1. ",
        "30... Qxf2+": "But black misses the tactic and white is only a pawn down.",
        "31. Kxf2": "Now white can finally develop his pieces.",
        "31... d4": "Black protects the e3 knight.",
        "32. Ngf3": "White threatens the d4 pawn.",
        "32... Rd8": "White has a removing the defender tactic that wins a pawn.",
        "33. Nxd4": "The e3 knight is without a defender.",
        "33... Rxd4": "Black takes on d4 and white will take on e3.",
        "34. Kxe3": "Now material is equal and white is slightly ahead in development.",
        "34... Re4+": "A serious blunder.  Now white has an easy win.",
        "35. Nxe4": "The rook is hanging.",
        "35... Nc6": "But black is determined to make it a fight.  Bxe4 Kxe4 leaves no hope for black.",
        "36. a3": "White should instead take the c file with Rac1.",
        "36... Rb8": "The b pawn is backward and weak.",
        "37. Rab1": "White protects the b pawn.",
        "37... Rb3+": "Now black has a little compensation, but not nearly enough for a rook.",
        "38. Bd3": "Patiently defending.",
        "38... Ne7": "The knight is heading to d5 or f5 for a check.",
        "39. Nc5": "Attacking the b3 rook and trying to trade off bishops.",
        "39... Nf5+": "Bxf5 is illegal because of the pin by the b3 rook.",
        "40. Kd2": "White is still attacking black's b3 rook.",
        "40... Rb8": "Black retreats the rook and keeps an eye on the b pawn.",
        "41. Nxa4": "White wins a pawn.",
        "41... Rd8": "Black is trying to set up something along the d file and g6-b1 diagonal.",
        "42. Nc5": "Adding a defender to the d3 bishop and clearing the way for the a pawn to advance.",
        "42... Rd5": "Attacking the knight.",
        "43. b4": "Defending the knight and pushing the b pawn closer to promotion.",
        "43... Rd4": "Attacking the f4 pawn and keeping the pin on the d3 bishop.",
        "44. Rhf1": "Defending the f4 pawn.",
        "44... h5": "Wasting a move.  Black should develop the king by Kf8 and Ke7.",
        "45. Kc3": "Threatening another removing the defender tactic. ",
        "45... h4": "Another blunder.  Black misses the tactic.",
        "46. Bxf5": "White wins material.  For example: 46...Bxf5 47.Kxd4 Bxb1 48.Rxb1 winning.  Black resigned here.\r\nAlthough I only won because of my opponent's mistakes, I felt that I got a decent position out of the opening and only got into a bad position in the middlegame.\r\nThat's all for now, although I have another win with this opening that I will annotate soon.  Thanks for reading and please comment!  "
    },
    "url": "https://gameknot.com/annotation.pl/an-opening-idea-2?gm=43761",
    "gameName": "An Opening Idea (2)",
    "players": "lcampop (1446) vs. mbavio (1322)",
    "opening": "Queen's pawn game (D00)"
}