{
    "moves": {
        "1. e4": "The most well known first move for White, but not the best.",
        "1... c5": "Sicilian, Black's best opening in response to 1.e4.",
        "2. Bc4": "This isn't book, therefore this isn't his best move. It isn't a mistake because the game is right now premature.",
        "2... Nc6": "Probably to prevent e5, chasing away the Knight from f6 if it did happen.",
        "3. Nf3": "White's goal is to put pressure on e4. As of now, the game is now taking shape and mistakes are becoming more visible.",
        "3... d6": "Not bad; Black will probably be prone to light square weaknesses later in the game, but for right now, this move is okay. It allows the g8 Knight to develop to f6 with ease if 4.d4 isn't played and it prepares the Bishop to go to d7.",
        "4. Nc3": "4.d4 is another possibility as it is equally effective as this move.",
        "4... Nf6": "Basic Kingside developement required for castling.",
        "5. d4": "This is very problematic move for Black as developed pieces can be easily attacked in one move. 5...Bd7 is a good idea here, but I'm sure that there are other moves that can be played.",
        "5... cxd4": "Not the best idea as it may cause Black to lose the center. ",
        "6. Nxd4": "At this point, I would like to see if Black can play 6...Bd7.",
        "6... g6": "I'm not a big fan of this move either. However, White's Knight looks like it has no other choice but to go back to f3.",
        "7. Bb5": "?! Black can simply play d5, breaking up White's center",
        "7... Bd7": "Continuing with development isn't bad either, but in this position, Black must handle his pieces like priceless glass.",
        "8. Nd5": "8...Nxd5 is critical right now unless I am missing another move.",
        "8... Nxd5": "Like it or not, 8...Nxd5 was played.",
        "9. exd5": "Perhaps 9.exd5 Nxd4 10.Bxd7+ (White loses after 10.Qxd4 Bxb5) Qxd7 11.Qxd5.",
        "9... a6": "Black is asking White to take an extra piece, which is why this move is the first critical mistake.",
        "10. Nxc6": "If played correctly, Black will be down a pawn.",
        "10... Bxc6": "So far, so good (not really for Black however).",
        "11. dxc6": "Now, 11...axb5 (anything else loses eventually) 12.cxb7 Ra7.",
        "11... Rb8": "This is the losing blunder to the devastating and destructive c7+, a discovered check that loses a Queen. In the end, Black will be undoubtfully losing.",
        "12. c7+": "There is no saving Black from disaster: 12.c7+ axb5 13.cxd8=Q+ Rxd8 and Black is 8 points down, even if 13...Kxd8. Black resigns with an obliterated Queenside and many critical threats in the next 5-10 moves. Black had two chances to save his pices. The first chance could have prevented point loss and the second could have prevented the whole game from collapsing for Black. Use your opportunities wisely, especially since they come and go quickly. 9...a6, even though it loses a point, was something for Black to have thought about. It's a fragile move, but it doesn't mean that it doesn't do anything, it means that there can be other purposes for each move that were not recently identified. A position is strong if constructed of logic; a weak position is constructed of everything else."
    },
    "url": "https://gameknot.com/annotation.pl/an-outright-error?gm=44285",
    "gameName": "An Outright Error",
    "players": "checking4fun (1128) vs. loslo (1110)",
    "opening": "Sicilian defence (B20)"
}