{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Bc4 Bc5 4. b4 Bxb4 5. c3": "All mainline Evans Gambit, and my moves up to 6.d4 all triggered conditional moves from Freddy, as if he somehow knew my preference for the Evans Gambit :P\n",
        "5... Be7": "A variation of the usual 5...Ba5, but it is playable. The only problem that may occur from that is that the queen can't come out to defend the critical f7 square... how to answer that problem?\n",
        "6. d4": "[The standard d4 break in the Evans Gambit]\n",
        "6... Na5": "! Simple - get rid of the bishop as soon as possible! Although to do that...\n",
        "7. Nxe5": "Black gambits a pawn in return, and White is allowed to keep his two centre pawns\n",
        "7... Nxc4 8. Nxc4 b5": "This move takes both players out of the database (though for me, it doesn't matter that much since Gameknot restricts DB access past the eighth move) There is a logical idea behind this - the fianchetto of the bishop on b7 with an extra tempo on White's knight\n",
        "9. Ne5": "The most active position for the knight\n",
        "9... Nf6": "I fully expected Freddy to try and chase my knight away here, at which point I would have replied Nd3\n",
        "10. O-O": "Unfortunately I can't seem to do anything to stop Freddy castling...\n",
        "10... Bb7": "The pawn was undefended, but right now Nxe4?? runs into Qf3! where Black loses the knight as he defends against the mate threat on f7 (Nf6, Qxa8) Now, Black has two pieces attacking e4 and White has none defending it. Now, before I go on allow me to summarise the Evans Gambit link in my profile. It mentions two interesting ideas with Evans Gambit players; 1) White must be aggressive and 2) White would do well to stop Black from castling. Is there an aggressive move that stops Black from castling? \n",
        "11. Nxf7": "!? Why, yes there is! :) I'm pretty sure that most of you are sitting there, scratching your heads and wondering how I could even consider sacrificing a piece against the Master Mater, but I had looked through this line many times and found it to be perfectly sound (to me). Allow me to explain that a little more; 1) I can get two pawns for the knight, and a one point material defect, to me, isn't losing at all. (In fact, that is a result of a normal Evans Gambit) 2) The only other move that saves the pawn is f3, which is a defensive move that also blocks the queen's scope to kingside...\n",
        "11... Kxf7 12. Qb3+ Kf8 13. e5": "3) White gets in quite a few moves that forces Black to react, meaning that White is doing the attacking...\n",
        "13... Nd5 14. Qxb5": "4) It seemed to me here that White's pawns on c3, d4 and e5 were strong enough to act as compensation for the lost point (and the base pawn, c3, is well supported by the knight)\n",
        "14... Rb8": "White has had his attack, and now Freddy sets up a counter-attack - 15...Nxc3! 16.Nxc3 Bxg2, and Bxf1 once the queen moves. Not only would this put Freddy up two points, this would also eradicate a load of material off the board - White can't allow that. Bc6 was another option here, but my reply would have been the same...\n",
        "15. Qd3": "Avoiding the exchange, and also making sure that no other tactics involving the c3 pawn can be pulled off by Black\n",
        "15... Qe8": "Freddy now has ideas of getting his queen into the action...\n",
        "16. f4": "here I had guessed (correctly) that Black's queen would go to g6, and I played f4, looking to play f5... [though perhaps 16.Qf5+ might have been better? e.g. 16...Qf7 17.Qxd7]\n",
        "16... Qg6": "though I'll take a break here as well to explain my thinking in the position. When I played 16.f4, I looked through lines where the Black Queen retreated down the g-file after f5; 17.f5 Qg4 18.h3 Qh5 19.g4 looks good (in case of 18...Qh4, either Kh2, intending g3 would to, or Bd2, intending Be1 would do) After Freddy played this move, I saw that the queen could go to c6 - these late discovering of moves happen to me quite often. Even worse though - this happens to me sometimes too... \n",
        "17. f5": "? is not to see the move until it is played - though it wasn't because of rushed moves, because I spent a long time on this one. White doesn't want to exchange material (another thing mentioned in the link on my profile) and he reckons that he can weather the storm after Qc6 [A stupid idea anyway? I'll let the readers decide on that] However, 17.Qxg6 hxg6 18.g3 would have been best for White, as Freddy has a nifty little trick that not only forces off the queens...\n",
        "17... Qxg2+": "! It also pick up a pawn!\n",
        "18. Kxg2 Nf4+": "double check - The rook cannot take the knight\n",
        "19. Kg1 Nxd3": "This was a heavy blow, and to me, White is already fighting to stay in the game. I didn't consider myself lost here yet - I was still pinning my hopes on my pawn structure - but I didn't like my position at all!\n",
        "20. Be3": "Avoiding Nxc1 - trading down material only benefits Black\n",
        "20... Kf7": "stopping White from playing f6, which was indeed what I was planning!\n",
        "21. Nd2": "White is just bringing out his pieces... He would like the knight to get to e4... if it wasn't for that meddling bishop! (and that pesky d3 knight, which prevent Rf4, then Ne4... sure, it could result in further exchanging but the lsb is powerful enough here to be worth it)\n",
        "21... Rhf8": "*sighs* now Kg8 and Freddy has castled by hand.. drat! (doesn't really matter now anyway, White doesn't have a lot of firepower on the king)\n",
        "22. h3": "Still focused on playing f6, White notices another problem arising from it - 22.f6? gxf6 23.gxf6?? Rg8+! and mates. This move allows White the h2 square to escape to\n",
        "22... Ba8": "allowing the rook full access to the b-file...\n",
        "23. Kh2": "?? I don't remember why I made this move, but I do know that I failed to realise the significance of Black's last move - Rab1 was forced here, I think. After this move, I completely lose control of the game, like trying to hold water in your hands.\n",
        "23... Rb2": "! It also walks straight into a pin! The rest of the annotation is taken directly from my mind as I played through the rest of the game\n",
        "24. Rfb1": "'okay, must get that rook out...\n",
        "24... Rc2": "'okay, it's staying but at least I have the b-file... and Rb7 is good if I can get rid of that bishop...' [when I'm two points down like this, my main aim is usually to get a pawn to make it -1, which is more manageable for me] \n",
        "25. c4": "'I'm not gonna let Freddy get another pawn out of this....'\n",
        "25... c5": "'wait a moment... oh snap, he won another pawn! the bishop can't recapture!'\n",
        "26. d5": "'If I take on c5, Freddy takes on e5 and then either c4 or c5 falls... oh well, advanced pawns are goooood....'\n",
        "26... Nxe5": "'So much for a stable pawn structure....'\n",
        "27. Kg3": "'okay, pin broken... but Black can still pick up the c4 pawn... not good...\n",
        "27... Bd6": "'wait a moment - there's a discovered attack... but now I can pin the knight to the bishop!'\n",
        "28. Bf4": "'That has to mean something!'\n",
        "28... Rc3+": "'okay, a check from the rook...'\n",
        "29. Kh2": "'?? It means nothing.... absolutely noth-'\n",
        "29... Ng4+": "'! What the-\n",
        "30. hxg4 Bxf4+": "'Oh! Ah, dammit!'.\n",
        "31. Kg2": "'and now... I'm gonna be six points down... against the Master Mater...'\n",
        "31... Bxd2": "'maybe I still have a chance!' \n",
        "32. Rbd1": "'C'mon Freddy - that c4 pawn is looking very tasty right now!'\n",
        "32... Bg5": "'wait a moment... hey, I made Freddy retreat! woohoo!'\n",
        "33. Rab1": "'and now I have the b-file again! Things are looking up!' [as you have probably worked out by now, I've been stripped of all rational thought in regards to this game :P]\n",
        "33... Re8": "'pffft... the e-file's nothing'\n",
        "34. Rb3": "'There's no need to move the rook, Freddy...'\n",
        "34... Rxc4": "'........' At this point, I finally had enough and resigned at this point. This is my third attempt against Freddy, and though I was busted at only the 23rd move, (in my eyes, at least) this lasted better than my first two games against him in the Traxler mini-tournament. I am currently set up for two more games against him in a stonewall mini-tournament, (which was meant for members of the Knights Of Honour club, but Freddy was kind enough to fill me in an extra slot) so I'll see what I can do with those chances :)\n"
    },
    "url": "https://gameknot.com/annotation.pl/an-unsuccessful-evans-gambit?gm=31930",
    "gameName": "An UNsuccessful Evans Gambit",
    "players": "x-machine (1497) vs. easy19 (2222)",
    "opening": "Evans gambit (C51), Cordel variation"
}