{
    "moves": {
        "1. c4 g6 2. d4 Bg7 3. e4": "White opens with the English and Black plays a slow response. Seeing it as an opportunity White charges out of the opening book and into the center.  \n",
        "3... d6 4. f3 c5": "Already both players begin to slip. White really should keep f3 open for the knight. Having both knight and bishop aimed at f2 is a bit cramped; of course 5. Bf3 leaves the d-pawn undefended. On the other hand, Black would be better attacking with e5 supported by his bishop. Here White can capture because 5. dxc5 Bxb2 6. Bxb2 gains the long diagonal and 5. dxc5 dxc5 6. Qxd8+ dislocates Black's king.  \n",
        "5. Be3": "A questionable move. If 5....cxd4, then White should have a fair game; but by abandoning the b-pawn, White invites 5....Nc6! Black gets a leg up in the struggle for central control, and White cannot kick the knight away because 6. d5 Bxb2 now wins the rook. \n",
        "5... Qb6 6. Ne2": "Black eyes the b-pawn, but comes at it directly rather than exploiting it. White tries to defend the center, but Black can still take control of d4 with Nc6. White quickly runs out of defenders. \n",
        "6... Qxb2 7. Nd2": "7. Nbc3 might be slightly better for White, but also makes the knights a bit redundant. 7. Nd2 aims at keeping the knight's more efficient with the hope of trapping or kicking Black's queen later, and of course defending White's rook for the moment. It also prepares Nb3, defending d4 if needed.   \n",
        "7... cxd4 8. Rb1": "A small zwischenzug removes one defender of d4. The material lost seems to be worth the defense of the center; but the game is still a bit favorable for Black.  \n",
        "8... Qxa2 9. Nxd4": "9. Bxd4 might be better here, attempting a more permanent end to the bishop perched on g7: Either an exchange or 9. Bxd4 e4 10. Bc3? leaving the Black bishop cut off. However, two pawns down, White is not looking to trade material and the knight is a less favorable exchange for Black's bishop. \n",
        "9... Nc6 10. Nd2b3": "White's unusual defense continues, adding two defenders to d4. 10. Nxc6 may have been slightly better, reliving the tension at d4 and giving White time to castle. \n",
        "10... Nf6": "This is a serious blunder for Black! And at last White has a chance to get back some lost material, though the combination is somewhat elusive. 11. Ra1! Qb2 12. Nxc6 and Black cannot retake the knight because 12....bxc6 13. Bd4 will win Black's queen. Since White's been looking to trap the queen he should have caught this opportunity to exploit it… \n",
        "11. Bd3": "...But alas, one serious blunder deserves another.   \n",
        "11... Qxg2 12. Rf1": "White's king catches a breeze as the Black queen goes by. Pale in the face he pulls his rook to safety, which renders Castling impossible. Black should have an easy game now. \n",
        "12... Qxh2 13. Nb5": "Four pawns down White tries for a counter attack. Of course, Black has a few ways to stop the fork, and White may have done better to play Nxc6, aiming to relieve some pressure. Of course the fork is hardly the plan, and White is looking for lines like 13.... Rb8 14. Nxa7 Nxa7 15. Bxa7 Ra8 16. Ra1; peeling off the a-pawn which could become a dangerous passer. But truth be told, Black is perfectly safe after castling. \n",
        "13... Bd7": "Yet in the fury the blitz, Black doesn't defend against the fork at all, and White jumps at the opportunity to gain some lost material. The game is essentially even. \n",
        "14. Nc7+ Kd8 15. Nxa8 Bh3": "Now Black gets to try an attack of his own. White can save his rook with Rf2 or Rg1; but after 16. Rg1 Kd7 Black will win the knight outright. Instead White goes for Rf2, hoping for the pin 16. Rf2 Qg3 17. Nb6 axb6 18. Bxb6+ Kd7 19. Ra1; which removes the passed a-pawn and controls the empty file. \n",
        "16. Rf2 Qg1+": "Black doesn't go for it, and instead skewers White's queen. 17. Bf1 Bxf1 18.Kd2 may be tempting initially, but after 18.... Bh6! 19.Qxf1 Bxe3+ 20.Kxe3 Qg5+ White finds he can no longer gain the a-pawn for his cornered knight. \n",
        "17. Ke2 Qxd1+ 18. Kxd1 Kd7 19. Bf1": "After trading queen's, Black takes a shot at his hostage. White's former plan, 19. Nb6 axb6 20. Bxb6 Ra8 now gives Black control of the a-file, so White's attention turns to the roaming bishop. Here White had a position and failed to capitalize on it. 19. Rh2 is much better with lines like 19. Rh2 Be6 20. Nd4 Rxe8 21. Nxe6. Black cannot afford to play 20....Nxd4  because 21. Rxb7+ Kc8 (Kc6 is mate) 22. Rc7+ Kd8 23.Bxd4 wins Black's knight while saving White's own.  \n",
        "19... Bxf1 20. Rxf1": "White misses a minor zwischenzug, 20. Nb6+ axb6 21. Rxf1. If Black responses with Kc7 White will at least have time to claim the a-file; if Ra8 then White will at least win an extra pawn. Instead, the game slowly dwindles back into Black's control.   \n",
        "20... Rxa8 21. c5 a5": "Black now pushing the a-pawn as expected, but 21....d5 22. exd5 Nxd5 might have been a bit better, isolating White's f-pawn and attacking the bishop. \n",
        "22. cxd6 exd6": "A first step to breaking away Black's king-side pawn majority. The a-pawn is not a terrible threat at the moment; White will be able to defend at the last moment, but will require committing a piece. Best to try and make something happen while the pieces are free.   \n",
        "23. Ke2 a4 24. Nd4": "White connects his rooks, allowing the possibly of capturing the a-pawn after promotion (when Black hits a2 White will play Rc1 or Rd1 to enable this), and thus avoiding a lengthy commitment. Meanwhile, king knight and bishop will fight for center, though a bit overwhelmed. However, Black cannot defend the b-pawn with his king because 24.... Kc7 25. Nb5+ Kd7 26. Nd4 repeats the position in order to avoid sacrificing the d-pawn. Hence 24.... Nd8 seems necessary and the central fight becomes a balanced match.  \n",
        "24... a3": "But, when Black hangs the b-pawn the plan changes. White's b-rook will go on the attack and (hopefully after Nxd4+ Bxd4) White's bishop and f-rook will defend a1. Getting his bishop on the long the diagonal will be critical for White's success. \n",
        "25. Rxb7+ Kc8": "Indirectly defends the knight on c6, but Black takes another hit to his king-side. Here 25....Ke8 26. Nxc6 Nd7? gives up some material but controls the long-diagonal and through it a1. Ultimately White would have given up a rook for bishop in order to stop the promotion. \n",
        "26. Rxf7 Nxd4+": "At this point time pressure has really sunk in. Black makes an aggressive check, but surrenders the coveted long-diagonal. 26....Ra7 27. Rxa7 Nxa7 is recommended but not much better. Either way the promotion is becoming less feasible. \n",
        "27. Bxd4 Nxe4": "Black aims to reclaim the diagonal with a sacrifice, but fails to assess the position of White's rooks; Or perhaps he was expecting 28. Bxg6 Ng3+, trying to destroy the spare rook. In any case, White caught the combination here. \n",
        "28. fxe4 Bxd4": "Abandoning the defense of f8 and enabling White's rooks to take complete control of the board. It begins with the skewering of Black's rook.  \n",
        "29. Rf7f8+ Kb7 30. Rf1f7+": "Pushing Black's king away White will win the rook and stop the a-pawn. Black may defend it, but it could never move to a2. \n",
        "30... Kc6 31. Rxa8 a2": "Black has lost, but could have held on a little longer with Bb2 or Bc5. Of course, unable to defend a2 the a-pawn would never advance anyway, so at this point it isn't going to matter much. \n",
        "32. Rxa2 h5 33. Rc2+ Bc5": "Moving one's last piece into a pin seems hardly advisable. White could have followed with 35. Rh7; it is I think a little quicker, but low on time White plays simple.\n",
        "34. Rf6": "White pins the d-pawn, crippling the bishop's defender. If Black does not move his king 35. Rxc5+ Kxc5 36. Ke3 g5 37. Rh6 h4 38. Rh5 g4 39. Rxh4 g3 39. Rg4 leads to a routine KR&K endgame. It is perhaps not the quickest, but White will waste no time calculating. If Black moves the king 35. Rxg7 isolates the h-pawn and 36.Kf3 defends the e-pawn blocking d5. White should win easily from the light squares. Black resigns.\n"
    },
    "url": "https://gameknot.com/annotation.pl/an-unorthodox-blitz?gm=51077",
    "gameName": "An Unorthodox Blitz",
    "players": "sirissac (~1500) vs. NN (~1600)",
    "opening": "English opening (A10)"
}