{
    "moves": {
        "1. e4": "Freddy hoped to teach me a lesson in my favourite Najdorf, so naturally I obliged.",
        "1... c5 2. Nf3 d6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 a6 6. Bg5 e6 7. f4 b5": "?! Not because its a dubious move in itself but because this is just about the sharpest opening in the whole Sicilian Labyrinth (Polugaevsky's term), so it was hardly wise of me to try it against The Big Bad Wolf!  This is the Polugaevsky Variation of the Najdorf Variation of the Sicilian Defence.  A more sober response would have been 7....Be7",
        "8. e5 dxe5 9. fxe5": "The N is pinned against the Q and doomed, so Black has to counter-attack on the Q-side.",
        "9... Qc7": "Preparing to support ... Nc6 and .. Bb7",
        "10. Bxb5+": "! With the N already virtually in the bag, White can afford to invest this Bishop in the attack, destroying Black's Q-side pawn structure and enabling him to castle quickly.",
        "10... axb5": "Black has little choice but to take the B",
        "11. exf6 Qe5+": "Black forks White's B and K, so it looks like he will equalise apart from those poor pawns.",
        "12. Qe2 Qxg5": "an alternative was to take the Nd4 and this might have helped prevent White's other N from wreaking havoc with Nb5-c7 but I preferred to take the B with the prospect of capturing the f6 pawn without disrupting my K-side pawns.",
        "13. Ndxb5 Ra5": "avoiding the fork from c7 and preparing to attack the Nb5 with the B, either from a6 or from d7",
        "14. O-O": "Tucking the K away to relative safety and defending the pawn on f6",
        "14... Bc5+": "taking the opportunity to develop with tempo but cutting off the Q's attack on b5",
        "15. Kh1 Na6": "I can't remember what the motivation for this was but it seems inconsistent with 13...Ra5 and a worse way of developing this N than ...Nc6",
        "16. Ne4": "! not only attacking the Q and B but adding to the defence of the f6 pawn ",
        "16... Qh6": "Thanks to 15...Na6, the Q no longer needs to defend the Bc5, so maybe that was the motivation!",
        "17. Nbd6+": "White finds another way to wreak havoc with his Ns",
        "17... Bxd6": "That's one of them gone, at the cost of my bishop pair.",
        "18. Nxd6+ Kd7": "and that's my right to castle forfeited",
        "19. fxg7": "!  Black can't recapture with 19. ... Qxg7 because of 20. Rxf7 , winning the Q",
        "19... Rg8 20. Rad1": "now threatening all sorts of mayhem with discovered checks, the N going to either f5, f7, c4 or b7, depending on how Black reacts",
        "20... Rd5": "solving that particular puzzle but Black's pawns get even worse as a result",
        "21. Rxd5 exd5 22. Qb5+": "Now Her Majesty weighs in",
        "22... Ke6": "Not 22...Kxd6 because 23. Qb6 would win Black's Q",
        "23. Nxc8": "restoring that threat while nabbing the B",
        "23... Qxg7": "sidestepping that threat and making a feeble counter-attack - Mate in 1!",
        "24. Qc6+ Ke5": "the one square available",
        "25. Qd6+ Ke4 26. Qf4#": "and that's that!  A brilliant attack by Freddy."
    },
    "url": "https://gameknot.com/annotation.pl/an-unwise-attempt-to-meet-the-big-bad-wolf-head-on?gm=21864",
    "gameName": "An unwise attempt to meet the Big Bad Wolf Head On!",
    "players": "easy19 (2224) vs. rjacobs (1542)",
    "opening": "Sicilian (B96), Najdorf, Polugayevsky, Simagin variation"
}