{
    "moves": {
        "1. d4": "Constructive and instructive comments are welcome on this game. I'm a pretty inexperienced chess player seeking to improve his game, and I was grateful that my opponent didn't simply cancel this blitz game after he saw my rating. I've removed black's name for protection from the disgrace of losing against such a low-rated player, though I do believe we both had a good game :)\n\nNow for my comments on the game:\nI've heard queen pawn games are good when your opponent is better than you, because it's less easy to attain a distinct advantage right away.",
        "1... Nf6": "Looks like one of the Indian defenses.",
        "2. Nf3 g6": "King's Indian. I don't know how to respond to this. ",
        "3. Nc3": "I don't know if this is a good response...it's not the GK opening book.",
        "3... Bg7 4. e3": "Cuts off my DSB, but protects the pawn that's stopping the fianchettoed bishop, and opens my LSB.",
        "4... O-O 5. Bd3 c6": "This move is a mystery to me. It does cut off my knight, and protects d5. Replicating our moves in the GK database reveals that to what I have access to, this move isn't done once.",
        "6. O-O": "My whole opening is really unsure and tentative. I'm extremely afraid of making some kind of mistake that my opponent would be able to take advantage of.",
        "6... d6 7. e4": "Don't know how advisable this is. It seems to work. At this point I had no idea what to do, so I thought, why not transpose to a classical development?",
        "7... Nbd7 8. Be3": "Classical vs. hypermodern. I paused in my thinking for a moment to just appreciate the dichotomy.",
        "8... Nb6 9. b3": "Again, didn't know what to do, so I cut off his knight. I'm aware that this creates a weakness for my knight and rook.",
        "9... Bg4": "This whole time my opponent hasn't wanted any center pawn skirmish. Perhaps he didn't see any benefit to doing this. I sure didn't!",
        "10. Be2": "Cautious, passive, and defensive moves. I'm still freaking out at this point that I'm even playing an 1825 rating.",
        "10... Qc7 11. Bf4": "Pinning the pawn against the queen.",
        "11... Bxf3": "Trying to create a weakness in my pawn defense?",
        "12. Bxf3 e5": "My d pawn is weak, so even though a trade will force my bishop back, I think it's the best option.",
        "13. dxe5 dxe5 14. Be3": "I'm actually okay with this situation, except for the weakness that the fianchettoed bishop is pointing at. However, at the moment, the bishop is blocked pretty well, and my defensive position doesn't look too bad to me.",
        "14... Rfd8 15. Qc1": "It's here finally that I begin to think of an attack. I'm not sure what my opponent is going to do, but I decided to start getting power on the kingside and challenge that bishop.",
        "15... Rd7": "Preparing to double the rooks.",
        "16. Bh6": "I want to eliminate the threat of that bishop.",
        "16... Rad8 17. Qg5": "Linking rooks without the queen there seemed a good idea. Plus, pressure is increasing on the kingside. Since my opponent has decided not to take, I will wait until I need to or a favorable opportunity arises.",
        "17... Nc8": "Not sure what to think about this move.",
        "18. Ne2": "My plan is to just keep on getting pieces over to the kingside. I'm aiming for g3 for my knight.\n",
        "18... Nd6 19. Ng3": "Achieves two purposes: defends my e pawn and lends support to the kingside pressure.",
        "19... Re8 20. Nf5": "If he takes with his pawn, I checkmate him.",
        "20... Nxf5 21. exf5": "Trying to continue building pressure. Again, if he takes, he dies.",
        "21... e4 22. Be2 Re5 23. g4": "A risky move. I'm now committing to blowing my kingside cover, contemplating trying to get my rooks to the kingside, and continue building pressure. If I can simply overwhelm his defense and break through...",
        "23... Qd8 24. h4": "My maneuverability is severely limited right now, but it doesn't cause me much alarm.",
        "24... Ne8": "This changes the dynamic of the game. He needed to do something to disrupt my advance. ",
        "25. Qxd8 Rxd8": "I liked this exchange combo because it gives me initiative.",
        "26. Bg5 f6 27. Bf4 Re7 28. fxg6": "Trying to open up his pawn formation a little more. Perhaps this wasn't the best move, since it allows him the chance to connect some pawns, but it seemed like an okay decision.",
        "28... hxg6 29. Kg2": "Making room for the rooks to swing around and also activating my king.",
        "29... f5 30. Rad1": "Bg5 instead? Not sure if it would be successful.",
        "30... Red7 31. Rxd7": "Trying to keep initiative and maintain my advantage, which I believe my bishop pair gives me.",
        "31... Rxd7 32. gxf5 gxf5": "He's maintained his connected pawns, but his king doesn't have them for cover anymore. At this point I'm simply attacking with the goal of trying to get those two pawns.",
        "33. Bh5 Nf6": "Facilitates the move I wanted to do anyway...",
        "34. Bg6": "Bxf5 would be a capture with tempo.",
        "34... Nd5 35. Bg5": "Again, actually facilitates my plan. If I would have been able to leave that DSB at f4, his rook could have potentially pinned my two bishops after Bxf5.",
        "35... Nc3": "? This is where my opponent begins to slip up enough for a noticeable advantage for me. Even if going for my pawns is a good decision, which I'm not sure if it is at this point, wouldn't b4 have been a better place?",
        "36. Bxf5 Nxa2": "? So intent on getting rid of those pawns, he didn't notice the attack on his rook.",
        "37. Bxd7": "My opponent resigned."
    },
    "url": "https://gameknot.com/annotation.pl/an-unforseen-win?gm=48826",
    "gameName": "An Unforseen Win",
    "players": "cazador2 (1369) vs. ???? (1825)",
    "opening": "King's Indian (A48), East Indian defence"
}