{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Bc4": "A typical Giuoco Piano maybe?  Something I am fairly familiar with.  \n",
        "3... h6": "I am sure this move will be useful later in the game but now it ignores the center so\n",
        "4. d4": "If  4.  ..., d6  then 5. d4xe5, d6xe5,  6. Qd1xQd8 will win a pawn  or 5.  d4xe5, Nxe5, 6.  Nxe5, d6xNe5, 7. Qd1xQd8, Kxd8,\nBxf7 also wins a pawn.   If 4.  ..., f6  then 5. d4xe5, f6xe5, ( or Nxe5 ) 6. Nxe5,  Nxe5, 7. Qh5ch wins the Knight back.  There are other trys but only 4. Qe7 can be used to protect the pawn and blocking the bishop at f8 is not desirable, so \n",
        "4... exd4 5. Nxd4": "Black takes centralizing the Knight.",
        "5... Nf6 6. Nc3 Be7": "Some fairly typical developing moves.  White could get the two bishops with 7. Nf5, O-O, 8. Nxe7 but this leaves black well developed with threats on the e4 pawn.   \n",
        "7. O-O O-O 8. Nf5": "Now Nf5 starts to eye the h6 pawn.  8,  ..., d6 is probably best.\n",
        "8... Bc5": "Preserving the two bishops but Bb4 would have been better",
        "9. Qf3": "White wants to attack the h6 pawn but some preparation is needed.  White is thinking of Qg3 and perhaps even Qg6 as possibilties.   Black still needs to play d6 and exchange the knight.\n",
        "9... Kh7": "Protecting h6 is a natural thought.  The question is does this really protect it?\n",
        "10. Nxh6": "This move is possible because the bishop on c5 is loose.  On 10. ..., g7xN, 11. Qf5ch followed with Qxc5 leaves white a pawn up and black with a broken king position.  \n",
        "10... Ne5 11. Qf5+": "Trying to complicate and take the knight later doesn't work.  Retreating the king to h8 lets white capture the knight on e5 and if the bishop on c5 retreats to d6 and threatens the queen then Qg5 waiting to capture the pawn on h6 will leave him two pawns with an open king to attack.  The imperative of check means the other options are either 11. ..., g6 or Ng6.   Blocking the check with the pawn loses the knight on e5 without being able to capture the white knight on h6 so\n",
        "11... Ng6": "White can take the bishop of c5 and try to get the endgame as soon possible but if the knight on h6 is going to fall it has one move left.\n",
        "12. Nxf7": "This threatens the queen on 12. ..., Rxf7,  13. Bxf7  the knight on g6 is pinned and can't be protected.  The queen must go to e7 to protect the bishop but  on  12. ..., Qe7, 13. Ng5ch, Kh8, 14. Qh3ch leads to mate or  12. ..., Qe7, 13. Ng5ch, Kh6, 14. Ne6ch, Kh7,  15. Nxc5 still wins the bishop and keeps two pawns.   Black resigns.\n"
    },
    "url": "https://gameknot.com/annotation.pl/an-unexpected-miniature?gm=63208",
    "gameName": "An Unexpected Miniature",
    "players": "jmd1952 (1200) vs. Anon (2098)",
    "opening": "King's pawn game (C50)"
}