{
    "moves": {
        "1. d4": "Magnus Carlsen has described this game as \"A Game for the Ages\". Watch the world champion sacrifice a rook and demolish World number 2 Levon Aronian in just 23 moves.\n\nMy annotations begin where the action begins i.e. on Move 11. \n",
        "1... d5 2. c4 c6 3. Nf3 Nf6 4. Nc3 e6 5. e3 Nbd7 6. Bd3 dxc4": "Capturing the white pawn before the white bishop has been moved to d3 results in a loss of tempi for black. Now Aronian has to capture on c4 with his Bishop. And Anand will, in his next move, promptly drive it back to d3 again thereby gaining a tempo.",
        "7. Bxc4 b5 8. Bd3 Bd6 9. O-O O-O 10. Qc2 Bb7 11. a3 Rc8": "OK Folks! this is where the action begins.\n\nYou see, while Anand’s rook move is not new in this position, it is less common than the move 10. … a6. This move is very natural. Black’s main goal in these sorts of double queen pawn openings is to play his pawn to c5 under favorable circumstances. This move frees his position and gets rid of a weak, backward pawn. The problem with playing the pawn to c5 directly is that the pawn on b5 is then left without protection. So moving the pawn to a6 first, to protect the pawn on b5, makes a lot of sense.\n\n",
        "12. Ng5": "This is where Anand's home preparation lasted till. From his home preparation he knew the fundamental idea that 12. Ng5 is unsound for white when black has played 11.... Rc8 instead of playing  11.... a6 first. However, Anand still had to see the game till the very end from here. He thought for a full one and a half hours before he made his next move.\n\nUsually in this situation, after black's usual move of 11. ... a3, white’s knight move makes a lot of sense. Of course, black can play the tactical shot 11. … Bxh2+ 12. Kxh2 Ng4+, and after white gets out of check black will win back the piece with 13. … Qxg5. The general feeling, though, is that white’s two bishops and better coordination give him a strong position.\n\nThe significance of this game is that Anand showed why white’s Ng5 idea is a bit dubious after Rc8. Black did not go for the tactical shot, nor did he worry about the weak h-pawn, nor did he worry about a weakness on b5. He simply played 12. … c5 right away. The line-up of the black rook on c8 with the white queen on c2 gives black a lot of tactical possibilities. White replied with 13. Nxh7, grabbing a pawn and threatening the rook on f8. Anand then played 13. … Ng4, leading to this position: ",
        "12... c5 13. Nxh7 Ng4": "Suddenly black has quite the attack. Both of his bishops are pointed ominously at white’s king, and black’s knight on g4 is soon to be joined by the queen arriving on h4. That’s a lot of firepower. \n\n\n",
        "14. f4": "White played 14. f4. This closes the black bishop’s path to h2. Sadly, white closes one diagonal only by opening another. Anand will later pounced on this new diagonal as you will see. ",
        "14... cxd4 15. exd4": "OK, you're playing black. What move would you play here?",
        "15... Bc5": "!!\n\nIt is for this move that the game has been dubbed \"Anand's Immortal\" by chess commentators. I wonder How many players, even grandmasters, would have found this move over the board?!\n\nNotice how Anand's bishop now occupies the same diagonal that Aronian had vacated when he had moved 14.f4 a move ago.",
        "16. Be2": "Can’t white just take black’s bishop with his pawn? Well, yes. But it won’t go well for him. Black will reply with Nxc5, and suddenly white has all sorts of problems. Black is threatening both to win back the piece by taking the white bishop on d3, and also to play Qd4+. taking advantage of the diagonal opened by white when he moved his pawn to f4. The tactics get very messy to calculate, but suffice it to say that black is doing very well indeed.\n\nSo white tried 16. Be2 here, with the idea of chasing back the black knight on g4. If black were actually forced to retreat now, this would be a good move. Sadly for white, Anand has another trick up his sleeve. \n\n\nOK, again, you're playing black. What would be your next move?",
        "16... Nde5": "!!\nAnand played 16. … Nde5!! (That’s right! Two double exclam moves in a row!!)\n\nLet’s take stock. Black’s bishop on c5, his knight on e5, and his rook on f8 are all under attack. If the knight on e5 moves, then the knight on g4 will be hanging. But white is the one in big trouble!\n\nCalculating all the variations would lengthen this post beyond decency, so let’s just look at how things went.",
        "17. Bxg4 Bxd4+ 18. Kh1 Nxg4 19. Nxf8": "We have reached a critical moment. White is up a full rook, but he is still facing a strong attack. It looks like black could now play the crushing move Qh4. He must resist the temptation to do so, however, since white would then get the last laugh by playing Qh7+. Black would be forced to exchange queens, after which his attack is kaput and white will just be up an exchange. \n\n",
        "19... f5": "!!\nThe third double exclam move in the same game ! Anand played 19. … f5!!. A quiet move this time. He simply shuts down the diagonal leading from c4 to h7. Now he really is threatening to play Qh4, after which white will run out of time before finding a reasonable defense.\n\nThese quiet moves are always the hardest to find. After the game Anand remarked that he felt proud of himself for having found 19. ... f5 over the board.\n",
        "20. Ng6 Qf6 21. h3 Qxg6 22. Qe2 Qh5 23. Qd3": "Aronian played his Queen to d3 to protect his pawn on h3.\n\n(The g2 pawn is pinned by the Black bishop on b7)",
        "23... Be3": "!! \nThe fourth double exclam move in the same game. This move cuts off the Aronian's Queen from defending his pawn on h3. And Aronian resigned here.....What a finish by Anand ! \n\nA masterful game by Anand, one of the most underrated world champions ever. Actually he is probably among the top 8 chess players of all time. See this link: http://en.wikipedia.org/wiki/Comparison_of_top_chess_players_throughout_history\n\nThanks for watching the Game. I'd appreciate your comments.."
    },
    "url": "https://gameknot.com/annotation.pl/anands-immortal?gm=48628",
    "gameName": "Anand's Immortal",
    "players": "Levon Aronian (2825) vs. Viswanathan Anand (2772)",
    "opening": "QGD Slav (D15), 4.Nc3"
}