{
    "moves": {
        "1. f3": "Please remember if you comment on this one, to make mistakes in the heat of battle is understandable. To make overly derogatory remarks is not about the play isn't. Feel free to make constructive criticisms or to make derogatory remarks on the annotating ;-)",
        "1... e6": "A cautious beginning, but I have summat in mind to try out this game.",
        "2. Kf2": "Yes its that old abdi-catalan again, purists look away now. Zep has a way of finding holes in things so I wanted to see how he fared against this one...",
        "2... Bc5+ 3. e3 a6 4. d4 Bb4": "I think this move was dubious, it wastes half a tempo whilst being easily refuted. However...I'll leave it to others to explore better options...",
        "5. c4 c5": "I felt this move hamstrung the bishop and led essentially to a forced sequence on blacks part.",
        "6. a3 Ba5 7. dxc5 Nc6 8. b4 Bc7": "Now I'm happy with the pawn structure on that side. In addition I have the bonus that blacks development has been pushed back.",
        "9. Bb2": "I've been reading a book (yes I do on occasion) Greatest Games of The Masters. I even understand a little. A couple of the points they make is about holding things in reserve and fianchetting bishops (which I think I just did?) I'm not overly good at that, I tend to be way too direct!",
        "9... f6 10. f4": "Here I'd got it into my mind to try a Philidorean approach, chuck the pawns at 'em!",
        "10... Kf7 11. Nf3 h6 12. g4 b6 13. cxb6 Bxb6 14. c5 Bc7": "This turns out to be an important, but fortunately not critical move.",
        "15. h4 Nge7 16. Nc3": "No idea where he is going, just moving into the space behind the pawns..",
        "16... g6 17. Bd3 e5": "That move disturbed me. I'd been making pretty patterns and I could see my pawn screen disintegrating..",
        "18. Bc4+": "When in doubt...prevaricate",
        "18... Kf8 19. Kg3": "And procrastinate. And that move nearly cost me the match",
        "19... h5 20. g5 exf4+ 21. exf4 fxg5 22. hxg5 Nf5+": "This is where I start to get nervous...The f pawn is gone...",
        "23. Kf2 Bxf4 24. Nd5": "And when under pressure counter attack. There was the vague hope he'd forget about the rook.",
        "24... Bg3+": "Of course he may just try and upset me :-(",
        "25. Kg2 Rg8 26. Nf6": "Protects the g pawn whilst still attacking",
        "26... Rg7 27. Nxh5": "Now this looked like ever such a clever move when I did it. Slight snag though....",
        "27... Rh7": "ideally I'd like to return the knight to f6, but I've just become aware of a rather big hole at e3...",
        "28. Qd2": "Rather a knight than a queen....",
        "28... Ra7": "Curious move, one that probably cost black the game...",
        "29. Nf6 Rxh1 30. Rxh1": "I'm quite happy with the exchange of rooks cos I'm now thinking about h8",
        "30... Kg7": "On reflection I could have replied to this with r-h7, that also leads to an interesting little spell I have a feeling. Didn't see it at the time but as another once said the results the same so 'better' is a moot point",
        "31. Nxd7+ Be5": "Blacks king is going nowhere, so he has to resort to throwing pieces into harms way",
        "32. Nfxe5 Qc7 33. Nxc6+": "Now black has a choice. He can sac the knight...or he can sac the queen...neither of which prolongs it very far. As I said I tend to be way too direct most of the time so to finish off with the pieces so well co-ordinated was very pleasing ;-)"
    },
    "url": "https://gameknot.com/annotation.pl/and-sometimes-mooses-get-indigestion?gm=21197",
    "gameName": "And sometimes Mooses get indigestion ;-)",
    "players": "greyrabbit (1522) vs. zep5686 (1365)",
    "opening": "Gedult's opening (A00)"
}