{
    "moves": {
        "1. e4": "I start with my usual e4.",
        "1... d5 2. exd5 Nf6": "Scandinavian defence.",
        "3. Nf3": "Here the usual is d4 or c4, but I go for simple development.",
        "3... Nxd5": "Getting material back.",
        "4. Bc4 e6 5. Nc3 c6": "I think this move is unnecessary, because d5 knight is already well protected, and there is no way I can attack it. Also it blocks b8 knight.",
        "6. O-O Be7 7. d4": "I choose d4 rather than d3, because I didn't want to block my white bishop. The point was opening the c1-h6 diagonal.",
        "7... O-O 8. Nxd5": "I was taught that centralized knight is very strong, so I removed him.",
        "8... exd5": "Here I think better is cxd5, keeping the center strong.",
        "9. Bd3 Bg4 10. Re1 Nd7 11. h3": "Every time my knight on f3 is pinned, that makes me nervous. So its time to chase that bishop away.",
        "11... Bh5": "Of course Bh5, keeping the pin alive. I wont play g4, because it would opened my King too much.",
        "12. Bf4": "I don't think this is the best move. It do nothing other than occupying h2-b8 diagonal. What do you thing dear reader?",
        "12... Bf6 13. c3": "Here I was thinking to play Bd6, 13. ....Re8, 14. Rxe8 Qxe8 15. c4. But then I would leave g5 square and give away the only open file. So I just protect my hanging d4 pawn. Then I saw something!",
        "13... Re8": "Challenging e file.",
        "14. Bxh7+": "! I saw this sacrifice. If 14. ...Kxh7 then 15. Ng5+ Bxg5 16. Qxh5+ Kg8 17. Bxg5, and the black Queen must move. If the King moves either to h8 or f8, I get a pawn, but the must important, I bust open his King defence.",
        "14... Kxh7 15. Ng5+": "Now I get a bishop back, I'm a pawn up, my Queen comes into action and I think I have a great advantage.",
        "15... Kg6": "? Mistake, he should leave the bishop and move his King back on the 8 rank. There is mate in 4. Do you see it?",
        "16. Qd3+ Kh6 17. Nxf7#": "The only thing in this game I was focus on is to get rid of the pin and at the end I came up with this beautiful mate. Thank you for reading this and I hope you enjoy this annotation. Also thanks to my opponent, for this game."
    },
    "url": "https://gameknot.com/annotation.pl/annoying-bishop?gm=44222",
    "gameName": "Annoying bishop",
    "players": "stojanc (1612) vs. bobbob78 (1514)",
    "opening": "Scandinavian defence (B01)"
}