{
    "moves": {
        "1. e4 e6 2. d4 d5 3. Nc3 Nf6": "A quiet beginning to a game full of fireworks.",
        "4. Bg5 Be7 5. e5": "The action begins now.",
        "5... Ne4 6. Bxe7 Qxe7": "Already Black has cleared the way for King-side castling... although he doesn't actually do it for a while.",
        "7. Nxe4 dxe4 8. Qe2": "Spielmann now threatens to win the advanced Black Pawn, and he makes way for Queen-side castling.",
        "8... Nd7 9. O-O-O": "Games where the players castle on opposite wings can lead to tremendous fireworks -- as is the case here.",
        "9... f5 10. exf6 e.p. Nxf6": "Black declares that he will attack as well.",
        "11. g3 O-O 12. Bg2": "Applying further pressure to the advanced Pawn.",
        "12... e5 13. Bxe4": "Spielmann thinks he will be up a Pawn after the exchanges...",
        "13... Nxe4 14. Qxe4 Rxf2": "...but Black has other ideas!",
        "15. Nf3 Qf7 16. Ng5": "Attacking Black's Queen...",
        "16... Bf5": "...and Black counters aggressively. No passive retreat for him!",
        "17. Qxb7": "Spielmann thinks this move wins for him. What he didn't see is that 17 QxNP??? can be countered with 17... RxPch! 18 K-N1 [forced] R-B8 dbl ch!!! with a devastating attack. A tremendous rarity to have such an attacking master as Spielmann miss a simple, crushing combination for his opponent.",
        "17... Rxc2+ 18. Kb1 Rc1+": "His opponent didn't miss the opportunity. Spielmann's King is now doomed.",
        "19. Kxc1 Qc4+": "The King-hunt is on.",
        "20. Kd2 Qd3+ 21. Ke1 Qe3+": "Preparing for the final blow, the unstoppable move ...R-KB1. Spielmann can do nothing about this.",
        "22. Kf1 Rf8": "Black threatens 23...B-R6 mate, and if Spielmann tries 23 Q-N3 ch, 23... B-K3 dis ch! is decisive. So Spielmann throws in the towel. A tremendous attacking game by Black."
    },
    "url": "https://gameknot.com/annotation.pl/another-grandmaster-falls?gm=30302",
    "gameName": "Another grandmaster falls",
    "players": "Rudolph Spielmann (GM) vs. Amateur ",
    "opening": "French (C13), classical, Tartakower variation"
}