{
    "moves": {
        "1. e3": "\"Oh great,\" I thought, \"out of theory already\" My strategy for any time I face an uncommon opening like this,I just follow opening principles (Develop pieces,Get king to Safety,Knights before Bishops,etc.)",
        "1... e5": "I just treat this like any king's pawn opening and thrust my pawn to e5,accepting the invitation to the center by White",
        "2. b3": "At the time,this move shocked me but now it makes sense. The e3 pawn is blocking the Bishop,so why not give it a chance for prosperity?",
        "2... Nf6 3. c4": "another move that I quite didn't get at the time. White stakes claim to the d5 square for his valiant knight. If I'm correct I think this is a position that is similar to that of the Nimzowitsch-Larsen opening. (1.b3)",
        "3... Nc6": "Staying true to my plan",
        "4. Bb2 Be7": "This looks like an awkward square for the Bishop but I could not find a place for it that had a purpose. I just want to castle",
        "5. Nc3 O-O 6. Qb1": "!? A move that also stunned me. I knew he had a purpose of moving it there but can a 1500 really figure it out? I know I couldn't",
        "6... d6": "Let's just ignore that and go on with my plan",
        "7. Nf3 Bg4 8. a3": "A move that supports a possible b4 with queenside expansion",
        "8... Bxf3": "?! A move I was very happy to make. Let's give him doubled pawns weakening his castling position when he castles kingside! However,this move is wrong because Freddy had no intention of castling whatsoever. Also,the open g-file will be a great spot to start attacking my king on.",
        "9. gxf3 Qd7": "At this point of time,I was very happy of the position I got out of the Opening. Black is devloped,castled and connected his rooks. White on the other hand had doubled pawns an awkward queen on b1 and no really safe place to castle. Boy was I wrong",
        "10. Qc2": "From my point of view it looked like Whit! was looking lost right now. Of course,when your opponent is Master quality,you're usually the one confused!",
        "10... a6": "defending against a possible b4-b5 by this and ...Na7 if necessary",
        "11. Nd5": "The White knight completes his journey to d5...",
        "11... Nxd5": "Only to be captured on d5",
        "12. cxd5": "However! Black's knight will get kicked back into an unactive spot.\r\n\r\nComputer: Gives Freddy a slight advantage here",
        "12... Nb8": "Looking for a rerouting to d7",
        "13. d4": "White finally gets his strike back in the center\r\n\r\nComputer: Gives 13.Bd3 as best followed by 13...f5 with a +/-",
        "13... exd4": "? This gives the bishop on b2 the open diagonal. This bishop will point to g7 and the rook can hop over to g1 and make the Black King less comfortable",
        "14. Bxd4": "Now,5 moves after I was very comfortable with my position,I feel like I'm losing the battle",
        "14... c6": "Trying to get something going",
        "15. Rg1": "Computer: Gives 15.Bc4 c5 16.Bb2 as better although I don't see the huge difference",
        "15... f6": "?? The losing move! 15...g6 was necessary to survive. Still after 16.f4, White still has a slight advantage\r\n\r\nComputer: Agrees with me...for once!",
        "16. Bd3": "! So subtle,but yet so powerful! White has every piece except the king and the rook on a1 pointing toward my king! At this point I knew an attack was imminent",
        "16... h6": "This move looks bad because it further weakens the light squares in front of the King. But nothing else would save Black now",
        "17. Bh7+ Kh8": "17...Kg7 18.Qg6#",
        "18. Rxg7": "!! The finishing blow!\r\n\r\n",
        "18... a5": " Shortening the game. 18...Kg7 was best but I think after 19.Qg6+ Kh8 20.Qxh6 followed by 21. Bg6+ will win anyway\r\n\r\nComputer: 19.Qg6+ Kh8 20.Qxh6 Rf7 21.Bf5+ Kg8 22. O-O-O Rg7 23. Be6+ does the tricl",
        "19. Qg6": "At this point,Freddy announced a mate in 7",
        "19... Na6": "Just end the misery!",
        "20. Bg8 Rfxg8 21. Rh7#": "Well,I was expecting this,but I was still disheartened after the game was finished. Never before have I been absolutely manhandled and beaten like this. I will probably send Freddy a rematch sometime in the future,having not learned from my previous mistake of challenging him in the first place =)"
    },
    "url": "https://gameknot.com/annotation.pl/another-blowout-of-another-lower-rated-player?gm=32116",
    "gameName": "Another blowout of another lower rated player",
    "players": "easy19 (2205) vs. rookie879 (1516)",
    "opening": "Amsterdam attack (A00)"
}