{
    "moves": {
        "1. e4": "This is considered the main opening for the majority of GMs as White stakes out his claim to the centre.",
        "1... e5": "Black meets White's centralization of a pawn with one of his own",
        "2. Nf3": "A common move attacking the e5-pawn and d4-square",
        "2... Nc6": "The best way to protect the e5-pawn",
        "3. Nc3": "White opts to develop both knights before his bishops",
        "3... Nf6": "The Four Knights Opening theory has changed a lot in the hundred years or so since the Four Knights was considered something of a \"main line.\"  ",
        "4. Bb5": "This is the Spanish Four Knights while 4.Bc4 is the Italian Four Knights and 4.d4 is the Scotch Four Knights.\r\n\r\n",
        "4... Bc5 5. O-O": "White castles to get his King into safety.",
        "5... O-O": "Black does likewise.",
        "6. Nxe5": "White plays the center \"fork trick\" to unbalance the position, e.g.6...Nxe5 7.d4 Bd6 8.dxe5 Bxe5.\n\n",
        "6... Re8": "But Morphy continues with his philosophy that development is paramount  Rather than permit the \"fork trick\" 6...Nxe5 7.d4, Black sacrifices a Pawn for rapid development.",
        "7. Nxc6": "!?Paulsen doesn't want to retreat to f3 thus giving the material back, this would have been much safer. This proves to be a big mistake.",
        "7... dxc6": "Morphy recaptures with a threat and also half-opens the d-file.",
        "8. Bc4": "The bishop should move all the way to e2 immediately, this just waists time.",
        "8... b5": "Here Morphy picks up a tempo by forcing the bishop to move again.",
        "9. Be2": "The seemingly more logical 9.Bb3 fails to 9...Bg4 10.Qe1 [or 10.Ne2 Rxe4 winning the pinned Knight] 10...b4, and if 11.Na4 Rxe4 traps the White Queen.",
        "9... Nxe4": "Morphy regains his pawn. with a better position than it would have been if it had been recaptured on move seven.",
        "10. Nxe4": "White exchanges.",
        "10... Rxe4 11. Bf3": "Skewer!\n\n",
        "11... Re6": "Black has a very weak pawn structure, it is true, but thanks to the \"ugly\" ...b5, he forced the White Bishop to a less effective square, which allows Morphy to post his Rook at e6, where it is well-placed for a lift to the King side. Perhaps Paulsen should have played 12.Bg4 followed by 13.Bxc8? But look at what else Morphy has: his Queenside pieces will develop quickly no matter what White does (although 12.c3 was a terrible lemon). The Queen will go to h4, the Bishop to d7, and the QR will double up on the King file. All of his pieces will stand ready for any action in the center or King side.\r\n",
        "12. c3": "?White wants to play d4 with the support of c3, but it is a mistake as Morphy's next move paralyzes White's forces,it is just a horrible move. White is saying \"Hey why don't you plonk your Queen on d3 and completely tie up all my pieces...!\". Sure enough, Morphy obliges: \"Why yes if you insist! I'm very grateful.\"\n\n",
        "12... Qd3": "!!is a beautiful and stunning example of prophylaxis. Since Morphy has control over the e file, it is almost impossible to shoo the black queen away without losing significant tempo or material. But if the queen doesn't leave, Paulsen won't be able to develop. In the end, Paulsen advances many of his queenside pawns, trying to free his pieces, but he loses considerable tempo. By the time he unlocks the bind, it is already too late to save the king from Morphy's final assault. ",
        "13. b4": "White works to gain space on the queenside",
        "13... Bb6": "But unlike what Paulsen did when this happen to him Moprhy retreats it to an aggressive square which still has attacking intentions.",
        "14. a4": "White wants to  open the a-file to exploit.",
        "14... bxa4": "Morphy obliges, he quite rightfully doesn't see anything dabgerous about White's presense on the a-file.",
        "15. Qxa4 Bd7": "!Black threatens 16...c5 attacking the white queen.",
        "16. Ra2": "White prepares to exchange queens on c2 if Black plays 16...c5",
        "16... Rae8": "!Morphy completes his development first.  Threatens mate with 17...Qxf1 . White's reply defends against this sacrifice, but allows another, which Paulsen can hardly be blamed for missing. Relatively best was 17.Qd1",
        "17. Qa6": "White tries to exchange queens anyway in order to free his position. Morphy took twelve minutes over his next move, probably to assure himself that the following combination was sound and that he had a forced win in every variation. Relatively best was 17.Qd1\n",
        "17... Qxf3": "!!!!!!!!With all of Black's army developed, Morphy plays an incredible queen sacrifice that rips open White's castled king's position like a can of tuna variation Morphy's pieces then begin their march on the enemy monarch",
        "18. gxf3": "Morphy took 12 minutes to decide on 17...Qxf3, an unusually long time for him. Paulsen, a notoriously slow player, thought for over an hour before capturing the Queen.",
        "18... Rg6+": "Forces the king into the corner",
        "19. Kh1 Bh3": "Neither White's queen nor his other rook can come to the aid of their king as Black's bishop drives away the f1-rook.\r\n\r\n",
        "20. Rd1": "Black threatened 20...Bg2  21.Kg1 Bxf3  , and 20.Rg1 fails to 20...Rxg1  21.Kxg1 Re1 . The key line, which Paulsen probably missed at move 17, is 20.Qd3 [hoping to return the Queen with 20...Qxg6] 20...f5!, and White is helpless.",
        "20... Bg2+": "Black harasses the king in order to snag a few pawns and open more lines of attack for his pieces.\r\n\r\n",
        "21. Kg1 Bxf3+ 22. Kf1 Bg2+": "The \"quiet\" 22...Rg2! would have won more quickly:  23.Qd3 Rxf2  24.Kg1 Rg2  25.Kh1 Rg1",
        "23. Kg1 Bh3+ 24. Kh1 Bxf2": "Black now threatens 25...Bg2# mate",
        "25. Qf1": "Absolutely forced.",
        "25... Bxf1 26. Rxf1 Re2 27. Ra1 Rh6 28. d4 Be3": "0-1 Paulsen Resigns because of 29.Bxe3 R6xh2  30.Kg1 Reg2 mate, as he is helpless to stop it.This shows Morphy was always was a big one for development( just look at all the other games by Morphy I have annotated.!). Perhaps the first chess player to stress the need to develop before you attack... He just simply annihilated all the competition in his time. I believe that he was the greatest player of all time, his genius goes along with Capablanca, Alekhine, Fischer, and Tal. I hope you liked this game. I'm happy for positive and negative feedback aslong as its constructive criticism!.\r\nThanks\r\nTom\r\n"
    },
    "url": "https://gameknot.com/annotation.pl/another-morphy-classic?gm=6420",
    "gameName": "Another Morphy Classic!",
    "players": "Louis Paulsen (?) vs. Paul Morphy (?)",
    "opening": "Four knights (C48), Bardeleben variation"
}