{
    "moves": {
        "1. d4 e6 2. Bf4 Nc6": "A move I would not play as black, since the c pawn's mobility is very important, IMO. But it's a matter of taste. Black has to be aware he will have to solve lsb's developement. ",
        "3. Nf3 d5 4. Nbd2 Nf6 5. h3": "The \"oh, i's a waste of tempo\" move...",
        "5... Bd6 6. Ne5": "The normal reply. Black can't play the natural NxN because of the fork on the next move (dxe5). BUT, having \"lost a tempo\" with h3 instead of e2, black can now answer Nh5, threatening the B in return, which can hide on h2, allowing black to escape the fork. ",
        "6... O-O 7. e3": "Let's imagine we played the same moves in the \"right\" order: this is a pretty common position on the London. ",
        "7... Ne7": "Interesting, black wants Ng6. I should have played Bd3, with the idea of BxNg6, and mantain my central presence. But fxB would have opened the f file for his rook, so it was not really so good. These are the well-known ups and down of this scheme. ",
        "8. Bh2 c5 9. c3": "Not really forced, but black's countergame on the black squares can easily become dangerous. ",
        "9... c4": "Blocked in, right. Now, it's my turn. ",
        "10. f4": "This was my way to counter Ng6. I'm aware the whole line is not really good for white, but black is not doing the more aggressive moves. Black should aim to play f6, kicking my N, but it implies moves like Ne4 (NxN, dxN), etc. In playing this, I'm aware I'm blinding my dsb, and I will have to take care of it later. ",
        "10... Nf5": "Threatening e3. ",
        "11. Qf3": "A very odd square for the queen, blocking my own Nd2. But right now I don't need any N there: Nd2 is there to stop Ne4, that's all. ",
        "11... Nd7": "Preparing f6, and threatening Nh4 or Qh4+. I played weakly the opening, and now I am in a very delicate situation. A wrong move more, and I won't be forgiven. ",
        "12. g3": "Self-blinding my dsb even more. Now, my \"hope\" is e4. ",
        "12... f6": "As foreseen, black finally kicks me, but there is no problem. ",
        "13. Nxd7": "I know I'm helping him to develop, but the alternative, Ng4, didnt' look very appealing to me, but I'm not sure. ",
        "13... Bxd7": "Now, I have the initiative, and I can't lose the chance. It's now or never!",
        "14. e4": "...not g4 (Nh4). This move was prepared, in a way, since Qf3 and g3, and is the first time I had to play it in a game.  ",
        "14... Ne7": "As you can see, it came it was a strong move. ",
        "15. exd5": "I though that this kind of forces black to take with the e pawn. This would leave me tempo to o-o-o, and with Bg2 I held a pressure on d5 that would have been a good holder for black. ",
        "15... Nxd5": "Black went for this instead, and it is not so bad because of the c pawn, but because it solves at once my developement problems. Nevertheless, black has a pretty obvious plan behind it that I didn't see at the moment. ",
        "16. Bxc4": "Taking with the N seemed good, because it threats the Nd6, but that would have been very \"naive\", since the threat was easily met by black, while I won't have put in action my last minor piece. This position is good for me also because it kind of pins the e6 pawn (my saying is \"developement for developement's sake is ok but not good\". In this case, the B goes to a good square, not to - say - e2. It must be said that this same bishop, on g2, was very well placed too, but 1) I will castle queenside, so Bxb7 was not a good threat for me to make, and 2) hey, this is aiming where the BK is! You wont't prefer the other side of the board as a target! :-). Of course, since I am a bad player (specially on blitz!) I didn't see next black's move. ",
        "16... Bc6": "...well, so I fell into an old trap. I will lose an exchange or more, here. If I move the Q, it will be attacked by the N - no place to go. And if I move the Rh1, the next N move to b4 will force me to play Qd1 to avoid Nc2+, forking the R. What to do?",
        "17. Qe2": "My Q will take with check, giving me the needed tempo to save the R. If Nxf4, Bxe6+, and then black should NOT take NxB, but Kh8, and I still have Q and R threatened at the same time. Nothing really difficult to see, but we were on blitz. ",
        "17... Qd7": "Black could have played inmediately Re8. ",
        "18. O-O-O": "I was granted with the needed tempo to save my R, and I thought that this move solved two problems in one move, so it was better than simply Rg1 or similar. Now, Nxf4 or Nxc3 don't work anymore, since white will get B and N for the R. ",
        "18... Rae8": "Incredibly enough, we reached this position where black has a good positional edge for the pawn... except for the e6's weakness. ",
        "19. Ne4": "Rh-e1 was slow, since my Q has no good attacking place to move in, so I preferred to try to get more pressure on e6 (by a minor piece!). This move almost ensures me to exchange his dsb, reducing a little the positional disadvantage.",
        "19... Nc7": "If Nb6, Bb3. Black is not reinforcing e6, since it opens the way for my lsb. ",
        "20. Nc5": "...and this was my plan. NOT to take e6 (he can defend), but to exchange his dsb. This was the tricky way I found to cope with the BxRa1 threat, but of course it was not necessary, and better would have been to play Rh-e1 at once. But you have to use your advantages, or you'll lose them. My next task will be to make my own dsb active again, but I couldn't find the right moment to do this yet. ",
        "20... Bxc5": "I'd say a mistake...",
        "21. dxc5": "The BQ is threatened again. And now I'm happy wiht my position.",
        "21... Qe7": "Right, threatening c5 and the Rh1. Can I play f5 at once, taking advantage of the pinned e6?  On a timed game, all this would be accurately calculated, but on blitz... you just try to figure out all by instinct. ",
        "22. Rhe1": "...Rd6 would have been the strong move, but I had to save the other R...",
        "22... Qxc5": "...so no Rd6 anymore. This was thre right moment to put my dsb into the action again, with Bg1, but I just could not give up my pressure on e6. f5 was not possible due to Qxf5, so...",
        "23. g4 Nd5": "Well, it looks like I won't be able to use e6, after all. And this N is really annoying. ",
        "24. Bxd5": "What the hell. I rid off my bishop pair, but also of one of his best pieces. ",
        "24... exd5 25. Bg1": "Always trying to surprise my opponent. I'm not sure the exchange would favour me, but I'm aiming to a7...",
        "25... Rxe2": "He went for it. ",
        "26. Bxc5 Rxe1 27. Rxe1 Re8": "Oh, another exchange (Ra8 would have saved the pawn). ",
        "28. Rxe8+ Bxe8 29. Bxa7": "Now I have the slightest advantage of a pawn's majority on the queenside. Will it be enough? ",
        "29... f5": "g5 was probably the right move, but I went for...",
        "30. Kd2": "...trying to reinforce my positional advantage. But in doing so, I know I'm sacrifying a pawn - in the long term. ",
        "30... fxg4 31. hxg4": "As predicted, my pawns are ok, and if Bd7, g5. ",
        "31... Bd7 32. f5": "Probably bad, but if I force him to play Bc6, his B will be kind of neutralyzed. ",
        "32... Kf7 33. Ke3 h5": "Nice, I should have seen it. I can play Kf, to retake with it, but then g6 and I lose a pawn for nothing. ",
        "34. gxh5 Bxf5": "Ok. No problem. I'm still +1 and his g pawns promotes on dark square (g1). I have to be very careful not to leave the big diag. ",
        "35. Kd4 Ke6 36. Kc5 Bg4": "It will be an exchange, then...",
        "37. Kb6 Bxh5 38. Kxb7 Bf3 39. Bd4": "...preventing the discovered check (I could have moved the K too, but I didn't like Kc7 or Kb6 - again).",
        "39... g5": "As long as my B is there, there will be no prob. ",
        "40. a4": "Race on. How can black save it?",
        "40... Kd6 41. a5 Be2": "Black will have to lose the bishop, for sure, but will it be enough to win? Sure. ",
        "42. a6 Bb5": "Black will take my queen making my king go to a8. ",
        "43. a7 g4": "Now, black wanted to fool me... well, I'll fool him: ",
        "44. Be5+": ":-) If KxB, my pawn promotes and his is too far. ",
        "44... Kd7 45. a8=Q Bc6+ 46. Kb8 Bxa8 47. Kxa8 Kc6 48. Ka7 Kc5 49. b3": "A simple move like that is full of sadism...",
        "49... Kc6 50. Ka6": "It's a matter of time. "
    },
    "url": "https://gameknot.com/annotation.pl/another-london-study?gm=56839",
    "gameName": "Another London study",
    "players": "damalfi  vs. 1800+ ",
    "opening": "Queen's pawn (A40)"
}