{
    "moves": {
        "1. e4": "E4 is always my preferred opening.",
        "1... c5 2. Nf3 Nc6 3. Be2": "This move is not very aggressive. I play it because there is no where else to really play it because of where I will put my pawns. I don't like fianchettoing the white bishop in this position at all.",
        "3... g6": "In my last annotated game, Blake78613 was kind enough to comment on some of it, and made the observation that black often fianchettoe's depending on if white moves c4 in the Sicilian. Here, I haven't moved my C pawn yet, and my opponent is already moving g6, probably because of my bishop move. Interesting. I am tempted to move c3 and d4 now, to see how play goes. But I need to explore that more fully against lower rated players first, to see how it feels. So I develop as I am wont to when I play against the Sicilian, and plan c4...",
        "4. d3 Nf6 5. O-O Bg7 6. c4": "C4. Now Blake also said that taking too long as white in this position here can be problematic. But because black has fianchettoed, it would appear I have plenty of time for getting ready to assault the black king. He also said that black should really move e6, probably before attempting to open things up with d5. Perhaps my opponent did not realize this.",
        "6... d6": "This move prompts me to move my king.",
        "7. Kh1": "Reason being, since I am playing (placing my pawns) on the white squares (although later I'll be playing some on the dark squares), I'd rather lose my white squared bishop than the knight, providing the game doesn't really open wide up later. This gives me the option of advancing the f pawn without any tactics occuring on the g1-a7 diagonal; and also if the bishop comes to g4, it allows me to move Ng1, serving three purposes: getting out of the way of the f pawn, and threatening the bishop on g4 while protecting my own bishop, and if retaking, again keeping the d4 square somewhat contested.",
        "7... O-O 8. a3": "My queen will go to c2; this will avoid an annoying attack, because I want my queen on c2!!",
        "8... a6 9. Qc2 Bg4": "And there is that black bishop on g4.",
        "10. Ng1": "Now here I've played against players who move Nd4 in this position. Here however, black does not.",
        "10... Bxe2 11. Nxe2": "Okay, this is the position that I wanted. I am sure black can play more challenging, but when I am playing against the Sicilian, I like this position for white. Black really should consider e6 here, I'm thinking.",
        "11... Qd7": "I am not so sure that is the best square for the black queen.",
        "12. Nbc3 Ng4": "Well I had planned on advancing my f pawn. This doesn't seem to do much.",
        "13. f3 Nge5 14. Nd5": "Before I kick the black knight on e5 away, I get in this in-between move, threatening Nb6. It forces black to take a tempo to prevent that.",
        "14... Qd8": "It would seem black had ideas of playing down the queenside, and this delays him some. As things turn out, he never gets going over there now.",
        "15. f4": "I don't want that black Knight on e5.",
        "15... Ng4": "Nor do I want it on g4. Although d5 is a great place for my knight, I can get my other one there if I really wanted to, so I decide to use the knight rather than the h pawn, because with the f pawn advance, my king's defense is already a little loose. Besides, ...e6 would immediately kick my knight away anyways.",
        "16. Ne3 Nxe3 17. Bxe3": "This also serves my purpose, allowing me to bring my bishop to e3.",
        "17... e5": "I don't like this black move in this position. I think e6 is better. I don't understand his intention; in this position the f5 square is more critical. Or so I think.",
        "18. f5": "And you just know my opponent does not want to take with the g pawn at all, and e6 may have prevented me moving f5. This is my first real bind on black's position, and the rest of the pressure against the black king will come about because of this pawn.",
        "18... Qh4": "This is rather optimistic. Who can join the Black queen to assist? And it won't protect h6 at all, after a rook lift.",
        "19. Qd2": "First, getting my queen behind my bishop.",
        "19... h6": "Black's bishop is not very good rightnow, and overall black is very passive. His pawns don't look all that good to me around his king. Perhaps he expected me to take on g6, but I have no desire to trade pieces in a position I felt was better for white.",
        "20. Rf3": "The rook lift. The queen will soon retreat, and will have accomplished nothing other than helping white to prepare his attack.",
        "20... Nd4": "Now the threat is Nb3, as well as hitting the rook.",
        "21. Rh3": "However, moving the rook to menace black's queen gives me the time to deal with the knight.",
        "21... Qf6": "Well I had hopes to use that knight, but now I have to trade it against d4. If I don't, I rather think black will if I counter Nb3 potential. I'd rather have his pawns doubled, so...",
        "22. Nxd4": "The bishop is moving on the next turn anyways.",
        "22... cxd4": "I really like white's position now.",
        "23. Bxh6 Bxh6 24. Qxh6 Qg7": "I had other ways of trying to broach the black kingside, but I did not want to take too much time, because I thought black might be able to muster a defense. I was rather pleased to find my next move.",
        "25. f6": "f6! It will ultimately win two pawns, and put white into a won endgame. Black cannot take it, because of mate on h7. So off go the queens, but I know at this point I have won, it's just a matter of execution now.",
        "25... Qxh6 26. Rxh6": "And Black's king is trapped. ",
        "26... Rfe8": "Black knows what is coming. Or so I thought.",
        "27. Rf1": "And here I make a pretty good mistake. g4 would have been much better. If g4 Re6, then g5 ensures the black king's doom after white's second rook lift. Black's other try against g4 would be ...g5; in that case, white has Rf1, followed by Rf5 and mate. Black can delay matters a bit, but g4 would have sealed things. Play continued...",
        "27... Re6 28. Rf3": "Now having missed g4 in the game, when I played Rf3 in this position, I full expected ...Rxf6 Rxf6 Kg7 Rxg6+ fxg6 Rxd6, and white is up 7 pawns to black's five, and has a won endgame with a little care. Oh how much better was g4! But for some reason my opponent got fixated on the rooks that could double up on the h file (And I would if black did not take the pawn on this turn, as black would lose immediately) and mistakenly moved his king to f8, into a rather basic mate.",
        "28... Kf8 29. Rh8#": "Another fun game. Hope you enjoyed it!"
    },
    "url": "https://gameknot.com/annotation.pl/another-sicilian-of-a-sorts?gm=49300",
    "gameName": "Another Sicilian of a sorts",
    "players": "Pierre99 (1200) vs. Anonymous (1877)",
    "opening": "Sicilian defence (B30)"
}