{
    "moves": {
        "1. e4 c5 2. Nf3 Nf6 3. Nc3": "To prevent d5.",
        "3... Nc6 4. d4 cxd4 5. Nxd4 Nxd4": "I don't think this is good, because it brings my queen into the centre",
        "6. Qxd4 b6": "the b6, e6, Bc5 plan is a bit slow",
        "7. Bc4 e6 8. Bg5 Bc5 9. Qd2 h6 10. Bh4": "Bxf6 and O-O-O might have been better, but I didn't want to give up the bishop pair",
        "10... g5 11. Bg3 Bb7 12. f3 d5 13. exd5 exd5 14. O-O-O": "This sacrifice is probably bad - and maybe Be2 and O-O-O is better - but I think it's about the only way to get an advantage. And it looked interesting!",
        "14... dxc4": "Refusing the peice just loses a pawn",
        "15. Rhe1+ Be7": "Forced, because Kf8 loses a rook.",
        "16. Bd6": "Keeping the pressure",
        "16... Ng8 17. Rxe7+ Nxe7 18. Re1": "black loses a piece...",
        "18... O-O 19. Rxe7 Re8": "... but there was no need to lose this one",
        "20. Rxb7": "Two pieces beat a rook",
        "20... Qf6 21. Ne4": "Attacking the queen and defending the bishop, so Rad8 is nothing to fear",
        "21... Qe6 22. Qc3": "Noticing the knight fork on f6",
        "22... Kh7": "Rad8 may be better, because then black has the defence 22. Nf6+? Qxf6! 23.Qxf6 Re1# ",
        "23. Qf6 Qxf6": "Kg8 may be better, to defend f7.",
        "24. Nxf6+ Kg6 25. Nxe8 Rxe8 26. Kd2": "A blunder, losing the bishop to the pin on Rd8. There is nothing wrong with Re7, or c3 to activate the king without losing material. Fortunately I was able to win the endgame without the extra piece.",
        "26... Rd8 27. Rxa7": "Kc3 might be better practically, although if black takes the bishop it makes no difference. I just took the pawn and hoped for the best!",
        "27... Rxd6+ 28. Kc3 b5 29. Rb7": "Attacking the pawn from behind",
        "29... Rd5 30. Kb4 Rd2 31. Rxb5 Rxc2 32. Kc5 c3 33. bxc3": "Not wanting to give black a passed pawn!",
        "33... Rxc3+ 34. Kb4 Rc2 35. a4": "Ignoring the threat to my kingside pawns, to push my passed pawn",
        "35... Rxg2 36. a5 Rxh2 37. a6 Rb2+ 38. Kc5 Ra2 39. Kb6 Ra3": "the f pawn is unimportant. Black should probably sacrifice the rook (while he can), and hope his pawns beat my rook",
        "40. a7 h5": "Rxa7 ?! is still probably the best chance - it may even win",
        "41. Ra5 Rb3+ 42. Ka6": "Now the pawn promotes, and I win",
        "42... h4 43. a8=Q h3 44. f4": "Opening the diagonal to h1, and setting up a rook check on g5",
        "44... h2 45. Rxg5+ Kf6 46. Qc6+ Ke7 47. Re5+ Kf8": "47. ... Kd8 48. Re8#",
        "48. Qe8+ Kg7 49. Rg5+ Kf6": "49. ... Kh7 50. Qg8 Kh6 51. Qg7#, 49. ... Kh6 50. Qh8#",
        "50. Qe5#": ""
    },
    "url": "https://gameknot.com/annotation.pl/another-fics-game-rated-standard?gm=29386",
    "gameName": "Another fics game (rated standard)",
    "players": "athorist (1632P) vs. cornelisaj (1616)",
    "opening": "Sicilian (B29), Nimzovich-Rubinstein variation"
}