{
    "moves": {
        "1. d4": "Qp opening, an opening which i am now starting to get accustomed to, as it seems to be in vogue right now...",
        "1... c5": "So, i decide to play actively and aggressively...d4 could be played along with several others, i think this is a good test of whites opening move, as, if accepted i stand to dominate the center of the board, which is where i prefer to be, at the top of the hill firing down!",
        "2. dxc5": "He accepts....",
        "2... Nc6": "This i find is a active enough follow up, blockading the pawn and developing at the same time, d6 or b6 can be played soon enough..",
        "3. c3": "In prep for b4..",
        "3... e5": "I decided to open my KB up and let him breath a little..",
        "4. b4": "So far pretty much by the book....",
        "4... b6": "Not sure if this may have been a little too early...?",
        "5. e3 bxc5": "Otherwise why play b6?",
        "6. bxc5 Bxc5 7. g3 Nf6 8. Bg2 e4": "I decided to deaden the g2 bishops scope, and hinder whites development, although it is no real biggie, just had great nuisance value i felt....",
        "9. Ne2 O-O 10. O-O": "Now with our kings safely tucked away, battle can commence!",
        "10... d5": "Creating space to move around in, and also tightening my vice like grip on the center of the board and of course strengthening e4..",
        "11. a4": "Always a move not to be faulted in this type of game..",
        "11... Re8": "I wanted to get my rook onto a decent file so that if i needed to call on him i could easily get him into the battle field.",
        "12. Ba3": "Also it avoids this pin....",
        "12... Qb6": "getting my queen into play on a potentially dangerous diagonal...",
        "13. Bxc5 Qxc5 14. Nf4 Ba6": "Now my rooks are linked up and at full strength..",
        "15. Re1 Rad8": "Backing up my 2 important and strong pawns....",
        "16. Qc2 Ne5": "This move in retrospect i think was a mistake, better was maybe Nb3...",
        "17. Nd2 Nfg4": "trying to close in on the king, i still wish I'd have played Nb3 though, although i think I'm definitely in a better position, spatially and tactically...",
        "18. Nb3": "This where i star t2 get unstuck a little",
        "18... Qd6": "protecting against Nc5 which was my main concern, didn't fancy having to run my bish around avoiding pot shots...",
        "19. Nd4": "A nice spot for the knight",
        "19... Qf6 20. Qd1 Nxf2": "I felt this sac was ok, not to sure of it's soundness in hindsight, but i knew it would cause potential chaos and we would both have to play accurately to convert our own wins, and sacking is so much fun! Especially when they turn out to be good..",
        "21. Kxf2 g5": "Immediately regaining my piece at the cost of a pawn and opening up my king to potential attacks down the g file, although i felt i could weather any immediate storm so i felt i had time to keep my momentum going... ",
        "22. Kg1 gxf4 23. exf4 Qb6": "This was a mistake, Nd3 or Ng4 were probably both better..",
        "24. fxe5 Rdc8": "Hoping to smash through via the c-file..",
        "25. Re3 Rxe5": "getting a pawn 4 the piece, and getting my rook into the open with more options regarding attacking options..",
        "26. Qg4+ Kh8": "Nicely side stepped, my C8 rook is also safe...",
        "27. Qf4": "This could get nasty, I'm starting to lose the initiative and I need 2 think fast....",
        "27... f6 28. h4 Rxc3": "This was a gamble, which luckily paid off...",
        "29. Rxc3 Qxd4+ 30. Re3": "Qe4 was better, stops me dead really...but...",
        "30... Qxa1+": "At last i have my piece back and the initiative, this game has been a close run thing so far, each riposte met and equalled",
        "31. Kh2 Re8": "I felt this was a prudent move, didn't fancy leaving my King without any protection at all...notice f6 is still safe for this move...",
        "32. Qc7 Qxa4": "Picking off the stragglers..",
        "33. Qf7 Qc6 34. h5 Rg8 35. Qxa7 h6": "Stopping 36.h6 was a must i felt..",
        "36. Qf7": "Back she comes..",
        "36... Bc8": "maybe Bc4 was a good alternative here...",
        "37. Ra3 Be6": "But this was my reasoning behind Bc8...",
        "38. Qxf6+": "Not missed, just felt ok about it, although i was a tad concerned don't get me wrong, i just thought i could weather enough to get my attack going again..",
        "38... Rg7 39. Qxh6+ Rh7 40. Qf6+ Rg7 41. Ra7": "This is getting worrying now, i need to be real careful...",
        "41... Bd7": "Blocking off the rooks line of fire...",
        "42. Qf8+ Rg8 43. Qe7 Rg7": "I felt i had to keep the threats going or my opponent would have enough time to mount a deadly blow..",
        "44. Qe5": "Pinning me again..",
        "44... Qe6": "I decide to bite the bullet and offer the queen exchange, with my central pawns i felt i had a good chance of converting the win, but by no means was it a forgone conclusion...",
        "45. Qd4": "But he doesn't accept the offer....",
        "45... e3": "I decide to push that pawn, \"passed pawns are meant to be pushed.\" (Capablanca)",
        "46. Bxd5": "This greedy move signs the death warrant, and i execute it in earnest haste....",
        "46... Qh3+ 47. Kg1": "Forced...",
        "47... Qxg3+ 48. Kf1": "Kh1 Qh3+, doomed either way..",
        "48... Qf2#": "And there we have it, off with his head! A good game i felt, it had it all, mistakes, sacs and accuracy at times. Thanks for reading, please post comments.\n\nCheers Rich."
    },
    "url": "https://gameknot.com/annotation.pl/another-interseting-otb-game-comments-plz?gm=23299",
    "gameName": "Another interseting otb game, comments plz",
    "players": "Anon  vs. daveyr18 ",
    "opening": "Old Benoni defence (A43)"
}