{
    "moves": {
        "1. d4": "Hi everyone!\n\nI am now playing my return match in Charles Higgie's themed MT against Expert Thebutz.  This game was started straight after my win against him with the black pieces.  An exchange sac occurs again in this game but who is the giver and who is the receiver of it?  Will I make it Expert Victory No.5?  We shall see.  This themed MT starts with 1. d4.",
        "1... Nf6 2. c4 e6 3. Nf3": "3. Nf3 - transposing this opening into a Reti.",
        "3... c5 4. d5 exd5 5. cxd5": "5. cxd5 - pawn trade.",
        "5... d6 6. e4": "6.e4 - It looks as though I am leaving my e4 pawn en prise.  However if black takes it he walks his knight into a pin along the e column.",
        "6... g6 7. h3 Bg7 8. Nc3": "9. Nc3 - a developing move which backs up the e pawn.  This pawn will be vulnerable to attack for the duration of the game but will never be taken.",
        "8... a6 9. Bd3 b5 10. O-O c4 11. Bc2 O-O 12. a3": "12. a3 - preventing b4.",
        "12... Nbd7 13. Bf4": "13. Bf4 - suddenly putting pressure on black's backward QP.",
        "13... Qb6 14. Qd2 Nh5 15. Bh6 Re8 16. Bxg7 Kxg7": "16. ….. Kg7 - bishop trade - and now King Butz is looking rather exposed!",
        "17. Kh1 Bb7 18. g4": "18. g4 - despite castling on the same side I cannot resist the thought of initiating another mating attack!  This moves stabs at the h5 knight.",
        "18... Nhf6 19. Qf4": "19. Qf4 - here comes Glenda!",
        "19... a5 20. Ne2": "20. Ne2 - Sir Lollabout moves towards the kingside to evade pawn menace and to assist in storming the black kingside position.",
        "20... Ne5 21. Nxe5 Rxe5": "21. …… Rxe5 - knight trade.",
        "22. Ng3 Rae8": "22. ….. Rae8 - black counter-attacks by putting pressure on my e4 pawn but now I further advance my g pawn.  Note if the black knight goes back to h5 it will be immediately traded off.",
        "23. g5 Nd7 24. Qh4": "24. Qh4 - further in!",
        "24... f6 25. Qh6+": "25. Qh6+ - Glenda being on this square has usually spelt doom and gloom for my opponents.  Can she do the biz here?  We shall see.",
        "25... Kg8 26. f4": "26. f4 - another pawn push!",
        "26... Re5e7 27. gxf6 Nxf6 28. Nf5": "28. Nf5 - what's this?  A knight sac?  If black accepts then he must be prepared for a nasty check on g1.",
        "28... Rd7 29. Rfg1": "29. Rg1 - now the g6 pawn is pinned.",
        "29... Qc7": "29. ….. Qc7 - rather passive.  Qf2 would have been more of a nuisance.",
        "30. Rxg6+": "30. Rxg6+ - here comes the exchange sac.  At first it looks like a straightforward rook sacrifice but I firstly pick up two pawns for the rook and the knight will fall two moves later.",
        "30... hxg6 31. Qxg6+ Rg7 32. Qxf6 Rf8": "32. …… Rf8 - trying to chase Glenda away but he has reckoned without ……..",
        "33. Nh6+": "33. Nh6+!! - this move brings about instant resignation as his f8 rook is doomed for starters.  But that is not all.  GA has flagged up a forced #6 for yours truly.  Yup, it is my Fifth Expert Victory and the second time an Expert has resigned on the grounds of unavoidable mate - you wouldn't believe that a player with a tendency of passivitis would do this to an Expert would you - heady, just heady!"
    },
    "url": "https://gameknot.com/annotation.pl/another-exchange-sac?gm=66253",
    "gameName": "Another Exchange Sac!",
    "players": "jotheblackqueen (1893) vs. thebutz (2060)",
    "opening": "Blumenfeld counter-gambit (E10)"
}