{
    "moves": {
        "1. d4": "Hi everyone!\n\nThis is now my 500th annotation.  I am up against a Class A player in my Sneaky Knights v King of the Castle team game.  A fairly close game was played but an exchange down into a pure K&P ending led to one player losing a pawn and that sort of ending usually means only one thing - an eventual zugzwang.  But which player met that fate?  Well, you will have to read on.",
        "1... d5 2. c4 dxc4": "2. ….. dxc4 - QGA accepted.",
        "3. Nf3 Nf6": "3. …. Nf6 - development.",
        "4. e3 e6 5. Bxc4": "5. Bxc4 - gambit pawn regained.",
        "5... c5 6. O-O a6 7. dxc5 Qxd1 8. Rxd1": "8. Rxd1 - queen trade.",
        "8... Bxc5 9. Be2 Nc6 10. a3 O-O": "10. ….. 0-0 - even with the queens off the board I still feel it is best to put Henry on the kingside, especially with a white rook bearing down on the d column.",
        "11. b4 Be7 12. Bb2 Rd8 13. Rxd8+ Bxd8": "13. ….. Bxd8 - rook trade.  At least I am well shot of that d1 rook but I must do something about my ecclesiastical twins Fou Leblanc and Fou Lenoir on the back row as they are obstructing my remaining rook of getting into the game.  Thankfully white still needs to complete his queenside development so I do have a little time to resolve this issue.",
        "14. Nbd2 b5 15. Rc1 Bb7": "15. ….. Bb7 - first part of mission accomplished. ",
        "16. Nb3 Be7": "16. …. Be7 - part 2 accomplished - at least my rook has a clear line on the back row.",
        "17. Nbd4 Rc8": "17. ….. Rc8 - this move triggers off a plethora of exchanges.",
        "18. Nxc6 Rxc6 19. Rxc6 Bxc6 20. Ne5 Bb7": "20. …… Bb7 - dodge attack and then think about what to do next.",
        "21. Nd3 Nd7 22. Bd4 f6 23. Bg4": "23. Bg4 - putting pressure on e6 but Henry now goes to its aid.",
        "23... Kf7 24. Nc5": "24. Nc5 - I anticipated this move but I am not afraid because it can now be traded off.",
        "24... Nxc5 25. Bxc5 f5": "25. …… f5 - preparing an exchange of bishops on c5 but I do not want Henry tied down to e6.  White should have played Bxe7 and after Kxe7 retreated his bishop, this would have led to a draw methinks but now white retreats his attacked bishop first (Be2?) and now I can initiate a bishop trade and white's passed c pawn is now a target for Henry to zero in on.",
        "26. Be2 Bxc5 27. bxc5 Bd5": "27. ……. Bd5 - allowing Henry plenty of room to attack the c pawn from the front.",
        "28. Bd3 Ke7 29. f3 Kd7": "29. …… Kd7 - closer and closer!",
        "30. e4 fxe4 31. fxe4 Bc4 32. Bxc4 bxc4": "32. …… bxc4 - bishop trade.  This messes up my queenside pawns but white's are also very pickable.  Big breakfast for Henry!",
        "33. Kf1 Kc6 34. Ke2 Kxc5": "34. ….. Kxc5 - yum!  That c pawn has now fallen and I now need to get white into a zugzwang in order to move in for the kill.",
        "35. Ke3 e5": "35. ….. e5 - blocking off King Bondi from f4.",
        "36. g3 g5 37. g4 h6 38. h3": "38. h3 - white will soon run out of safe moves!",
        "38... a5": "38. ….. a5 - after this move my opponent said the word \"zug\" in the chat.  I wrote back 'fraid so! He then waved the white flag.  9.2 rating points in the bag - a big step towards 1850 - nice!"
    },
    "url": "https://gameknot.com/annotation.pl/another-zugzwang?gm=65494",
    "gameName": "Another Zugzwang!",
    "players": "bondi (1801) vs. jstevens1 (1823)",
    "opening": "QGA (D27), classical, 6...a6"
}