{
    "moves": {
        "1. h3 e5": "1. ..... e5 - conventional development.  Charlotte's first move is not the best but it is playable.",
        "2. a3 d5": "2. .... d5 - after a second flank pawn move by Charlotte I decided to control the centre of the board.",
        "3. b3 Nf6": "3. .... Nf6 - after another pawn move from Charlotte I decided that I would develop my knight.",
        "4. Nf3": "4. Nf3 - at least Charlotte now knows without prompting that a knight moves in an l shape.",
        "4... Nc6 5. Nc3": "5. Nc3 - both sides bring out our remaining knights.",
        "5... a6": "5. ...... a6 - I am preparing d4 and hoping to swindle Charlotte into losing her knight!",
        "6. a4 d4 7. a5": "5. a5 - Charlotte does not notice that her knight on c3 is en prise and I now take full advantage.  ",
        "7... dxc3 8. dxc3": "8. dxc3 - naturally Charlotte gets a pawn back for the piece.  Now I decided to trade queens here as I am ahead on material.",
        "8... Qxd1+ 9. Kxd1 Bf5": "9. ..... Bf5 - after the queen trade I am planning to put Henry away on the queenside.",
        "10. Bd2": "10. Bd2 - Charlotte anticipates that she might be subject to castle fire along the d column, so she decided to develop her bishop.",
        "10... O-O-O 11. Rb1 Bc5": "11. ..... Bc5 - I could have played Nxa5 here but I decided to clear the decks.  At least two of Charlotte's pawns are now en prise.",
        "12. h4 Bxf2": "12. ..... Bxf2 - I take on f2 and I now have a dastardly plan which will unveil itself in the next few moves.",
        "13. h5 Ng4 14. c4 Ba7": "14. ..... Ba7 - an innocuous looking move but it involves a square clearance for my knight to come into f2 with check.",
        "15. c5": "15. c5?? - blocks the diagonal of Fou Lenoir but she overlooks the fork on f2.",
        "15... Nf2+ 16. Kc1 Nxh1 17. h6 gxh6": "17. ..... gxh6 - and now, Charlotte being the equivalent of a whole queen to the bad, now waves the white flag.  Better luck next time, Charlotte!"
    },
    "url": "https://gameknot.com/annotation.pl/another-game-with-charlotte?gm=52422",
    "gameName": "Another game with Charlotte",
    "players": "Charlotte Rowena Stevens (Unr) vs. Joanne Rowena Stevens (1200)",
    "opening": "Global opening (A00)"
}