{
    "moves": {
        "1. d4": "Arash starts with the queen's pawn opening.",
        "1... d5": "Queens pawn game.",
        "2. c4": "Queens pawn gambit. A rather safe gambit, in my opinion.",
        "2... e6": "I respond with the Queen's gambit declined. I'll also be honest with you here: I don't know anything about openings beyond this move. From here out I'm going with my best judgement.",
        "3. a3": "My guess is he played this to prevent Bb4.",
        "3... Nf6": "\"Develop the least developed piece to the best possible square\"",
        "4. Nc3": "He develops his knight as well.",
        "4... Nc6": "I develop my second knight.",
        "5. Nf3": "Knights royal!",
        "5... Be7": "I do this to castle, as well as defend against Bg5.",
        "6. Bf4": "I'm pretty sure this is a good move...",
        "6... Nh5": "Knight: Go away or die.",
        "7. cxd5": "Or trade off first...",
        "7... exd5": "I was very happy to do this move because, until now, my LSB was completely trapped. I think the trade favored me...",
        "8. Be5": "He's trying to invade, but I think this is pointless, and a wast of time. After I press the f pawn, not only will white's DSB be forced to die, but whites f6 knight won't be able to go to e5 or g5. ",
        "8... f6": "Naturally, I push.",
        "9. Bg3": "He retreats...",
        "9... Nxg3": "And I trade an inactive knight for an active bishop.",
        "10. hxg3": "Gotta take back with something...",
        "10... O-O": "King safety.",
        "11. e4": "He attacks the center.",
        "11... dxe4": "I'm not sure if this is the best move...there's alot of variations here. Reguardless, this is what I went with. What do you think of it?",
        "12. Nxe4": "Material is still equal... but when I look at this, white seems to have a bit of an advantage.",
        "12... Bg4": "Trying to get the bishop involved.",
        "13. d5": "Pressing the pawn, forcing me to move the knight.",
        "13... Ne5": "I can't let it die, and this looks like a good square.",
        "14. Be2": "A good move.",
        "14... Nxf3+": "\"When pieces make contact, it is generally not a good idea to trade off, but instead, build pressure on the pieces\" ...yeah, I didn't do that. Probably shouldn't have traded...",
        "15. gxf3": "He takes with the pawn, forcing me to move my bishop.",
        "15... Bf5": "I don't like this square, but I didn't like most of the other squares either.",
        "16. Qb3": "Attacking the b7 square, while indirectly attacking my king (Which I didn't see).",
        "16... Qc8": "I go to defend the b7 square.",
        "17. d6+": "And there it is. The move that killed me.",
        "17... Be6": "Trying to stay alive",
        "18. Bc4": "And the game ends here. Feel free to comment."
    },
    "url": "https://gameknot.com/annotation.pl/another-chess-game?gm=46846",
    "gameName": "Another chess game",
    "players": "arash1981 (1587) vs. johnsmith95 (1270)",
    "opening": "Queen's gambit declined (D30)"
}