{
    "moves": {
        "1. g3": "The Barcza opening is a very flexible one allowing many defensive setups for black.  Some possibilities include; the Kings Indian Attack, the Sicilian, the Catalan, and the Reti.  The point, with this move white proudly states, \"I know stuff.\"  Yes, but how much stuff does he know?  : )",
        "1... e5 2. Bg2 Bc5 3. Nc3 Qf6": ": ) These two move (Bishop and Queen) make me smile every time.  I can remember learning Fisher's mate a long time ago in a far off place...",
        "4. Ne4 Qb6 5. Nxc5 Qxc5 6. e4 Nf6 7. Ne2 Qc6 8. O-O Nxe4": "Not suggested.  8... d6 or castles were far better.",
        "9. d3 Nc5": "Blunder.  ",
        "10. Bxc6 bxc6 11. f4 exf4 12. b4": "The bishop prefers to control the center from afar.",
        "12... Na4 13. c4 Nb6 14. Bb2": "White doesn't mind tossing a pawn away for a more open position and control over the center dark squares.",
        "14... d5 15. Nxf4 O-O 16. Nh5": "That kingside is begging for a knight to gallop through.",
        "16... dxc4 17. Nf6+": "17. Nf6+!!  Taking on c4 would deserve ?! in light of this move.  This move wins the game.  Most variations lead to check mate from here in less than ten moves.",
        "17... gxf6": "If 17... Kh8 then 18. Qh5, h6  19. Ne8!, f6  20. Rxf6!, Rxf6 (20... Rxe8 21. Rxh6+, Kg8  22. Qxe8# or 20... gxf6  21. Qxh6+, Kg8  22. Qg7#) 21. Bxf6, Kg8 (21... gxf6 22. Qxh6, Kg8  23. Qg7#) 22. Qg6, Kf8  23. Qxg7+, Kxe8  24. Qe7#.  17... gxf6 causes a need for white to find a star move later.",
        "18. Rxf6 Nb8d7": "18... Nd5 was the only try, though, still losing.  After which 19. Qh5, c3 (and now the star move) 20. Bxc3!!, Nxc3  21. Rh6 and any move made by black doesn't stop checkmate.  For instance 21... Kg7  22. Rxh7+, Kf6  23. Re1, Be6 (black can prolong the game with a knight imposition, but only by one move since the rook will snap it off)  24. Qh4+, Kf5 (It doesn't matter where the king goes, 24... Kg6  25. Rh6+ with mate next move.)  25. Rh5+, Kg6  26. Qg5#.",
        "19. Qh5": "More forceful would have been 19. Qg4+, Kh8  20. Rxf7+, Nf6 (or c3) 21. Qg7#.",
        "19... Nxf6 20. Bxf6": "20. Qg5+ was one move faster thanks to 20... Bf5, but then 21. Qh6 with mate next move.",
        "20... Nd7 21. Qg5#": ""
    },
    "url": "https://gameknot.com/annotation.pl/anyone-for-tea?gm=23713",
    "gameName": "Anyone for tea?",
    "players": "jahdragon (1200) vs. debninho (1123)",
    "opening": "Benko's opening (A00), reversed Alekhine"
}