{
    "moves": {
        "1. e4": ".La difesa Robatsch, nota anche come difesa moderna (ma da non confondere con la difesa moderna - Averbakh), è un'apertura degli scacchi caratterizzata dalle mosse:\n1.e4 g6\n2.d4 Ag7\n\nPregio e difetto di questa apertura è la estrema varietà e mutevolezza (anche nel nome). Prende il nome dallo scacchista austriaco Karl Robatsch.\n\nPresenta alcune analogie con la difesa Pirc, ma, a differenza di questa, il cavallo g8 non viene subito sviluppato in f6, anzi molto spesso entra in gioco da h6 o da e7, proprio per non chiudere la diagonale dell'Ag7. Di regola il Bianco occupa tutto il centro con i pedoni, avanzando a volte anche il pedone f2 in f4. Il Nero deve reagire energicamente per non essere soffocato. Per molto tempo la difesa moderna è stata considerata una difesa irregolare e solo nella seconda metà del XX secolo è stata studiata estesamente e giocata a tutti i livelli: il contributo più significativo alla sua diffusione è stata opera di alcuni fortissimi GM inglesi.\n\nVarianti\n\nAlcune linee di gioco sono:\n3.Cc3 c6 4.f4 d5 5.e5 h5 (variante Gurgenidze)\n3.Cc3 d6 4.Cf3 c6 5.Ae2 Cd7 6.0-0 Dc7 7.a4 Cgf6 8.Ae3 0-0 9.Dd2 a5 10.h3 Cb6 11.Tfe1 Ad7 (variante Suttles)\n3.Cf3 d6 4.c3 Cd7 5.Ae2 e6 6.0-0 Ce7 (variante dell'ippopotamo)\n3.f4 (variante 3 pedoni \n.\n.\n\nHo trovato una annotazione di Alekhine che, commentando la Partita Lasker-Capablanca, a proposito di 1. ... g6, ha scritto \"Secondo i fondamenti teorici attuali, questa mossa non può essere considerata del tutto valida, in quanto il nero si vincola ad una particolare posizione senza essere in alcun modo in grado di ostacolare lo sviluppo centrale dell'avversario...\"\nAi giorni nostri 1... g6 (chiamata difesa Moderna) è ritenuta un'apertura del tutto accettabile.\nCon 1. ... g6, il nero diversamente da quanto prospettato da Alekhine, non rinuncia alla possibilità di giocare al centro; attende invece che sia il bianco a compromettersi per primo centralmente. Normalmente il contro gioco del nero prevede sia ... c5 sia ... e5, benchè in alcune linee il nero giochi ... d5.\nNella difesa moderna il nero dispone di più strategie. Questa libertà aggiuntiva implica per il nero un'ulteriore responsabilità; quella di condurre l'azione centrale in modo tempestivo e opportuno.\nSe il nero indugia eccessivamente permettendo al bianco di consolidare la sua mossa sul entro, allora incorrerà nella difficoltà menzionata da Alekhine, ossia quella di non riuscire in nessun modo a contrarstare il centro bianco.\n(Fonte: John Nunn - Capire gli scacchi mossa dopo mossa) ",
        "1... g6": "Grazie per l'esposizione e per le riflessioni. (e grazie anche a Piero per l'intervento). Hai dato un'idea della flessibilità e varietà di soluzioni di questa apertura, che mi attrae al punto di volerla condividere con voi. Curioso che l'ampia carrellata di varianti proposta da Klaus non includa una mossa che trovo interessante: Ch3, dopo h4, con presa di possesso delle caselle f4 e g5 e preparazione ad un attacco sul lato di re. Tale attacco può essere un diversivo; una delle caratteristiche di questa difesa è quella di consentire al nero un rapido cambiamento di fronte, mediante mosse come b5-b4 e la mobilità della regina dopo c6 ed e6.\nPer chi vuole approfondire, a me è piaciuto questo video: youtu.be. (In inglese)\nKlaus, cominciamo con la Robatsch, dunque 1. e4 g6. Se prosegui con d4, io muovo Ag7.",
        "2. d4": ".",
        "2... Bg7": ".",
        "3. Nc3": ".Devo scegliere se occupare la casa c3 con il pedone o il cavallo. Giocando c3 si rinforza la casa d4 e si riduce l'attività dell'alfiere g7, ma si limita decisamente l'attività del cavallo b1, pertanto penso che questa mossa naturale sia la migliore al momento.\nOra mi aspetto il classico d6 per preparare c5 o e5. ",
        "3... c6": ".Fin qui tutto secondo standard. Ora però propongo una piccola variante, c6, che chiamerei \"variante Norwood\" dal nome del GM autore del video che vi ho proposto. Tale mossa mi piace perché consente sia l'opposizione al centro del bianco tramite d5, sia un futuro attacco dal lato di donna con b5. È nello spirito della difesa Robatsch, che privilegia gli attacchi sulle colonne laterali, e il controllo più che il possesso delle caselle chiave. Mi aspetto f4 da parte di Klaus, alla quale risponderei con d5, ma non escludo una più tranquilla mossa di sviluppo, o la ficcante Ac4. ",
        "4. f4": ".La mossa logica dopo la 4ª mossa del nero era Cf3. Ma questa la posso fare anche dopo quando, dopo Ch6 sposterà il suo alfiere campochiaro in g4.\nPe5 spegne, al momento, le velleità dell'alfiere camposcuro in g7 che è un po' il punto di forza di quest'apertura.\nHo trovato un commento su quest'apertura che rispecchia un po' le mie intenzioni (logicamente non sono così erudito da conoscere a menadito tutte le aperture e per questo cerco anch'io fonti che mi aiutino nell'analisi delle posizioni  )\n\"In questa partita il Nero opta per la chiusura del centro e mette su un vero e proprio \"catenaccio\" difensivo. Il Bianco con pazienza adotta una strategia di lento soffocamento prevenendo le possibilità di controgioco del Nero e cercando di guadagnare spazio sul lato di Donna, per poi lanciare l'attacco decisivo sul lato opposto.\" ",
        "4... d5": ".",
        "5. e5": ".",
        "5... h5": ".Io ci provo io io io!! Secondo me stai già pensando ad un attacco basato su g4 e f5   in effetti questa variante della Robatsch consente sia al nero che al bianco di attaccare sulle colonne laterali, una volta bloccato il centro. A centro bloccato, il gioco diventa lento, strategico, e basato sul controllo delle caselle piuttosto che sul possesso. Perciò ci sta bene una mossa come h5, che prende possesso della casa g4, e prepara Ch6, Cf5 e Ag4. Quanto all'Ag7, ora è inattivo, ma dopo Ag4 ed e6, sfruttando lo \"slow chess\", si porterà in e7. Tutto questo Klaus permettendo   mi aspetto Cf3 o Ae3. ",
        "6. Nf3": ".\nCf3 o Ad3 sono ambedue buone mosse, ma poiché la prima e la più usata, mi fido di coloro che hanno fatto esperienza più di me  \n\nh5 giocata da Stefano è una mossa contemplata e consigliata nell'apertura che stiamo giocando. Fino a quando non l'avrò capita un po' meglio, non rischio colpi di testa... a quello ci pensa Stefano  \nD'altronde negli scacchi, o si forza l'avversario all'errore (ma in questo caso il fattore tempo, causa primaria, gioca poco a favore di qualcuno di noi in quanto non ci sono orologi) o si aspetta l'errore. Appunto...\nPenso che per il nero al momento sia importante sviluppare l'apertura per permettere al proprio Re di arroccare. Anche Af5 non sarebbe male, per bilanciare un po' il possesso del centro senza spostare e5 che bloccherebbe il gioco dell'alfiere nero.\nAmbedue le mosse si equivalono. Vediamo cosa decide Stefano. ",
        "6... Nh6": ".Rispondo con un'altra mossa tipica di questa apertura, che incrementa il controllo sulle caselle f5 e g4, e ribadisce il principio che il nero farà una subdola partita da rampicante sulle colonne a e h. Al ritorno di Klaus abbronzato, mi aspetto un'altra normale mossa di sviluppo tipo Ae3, e a quel punto penso che agiterò un po' le acque.\nQuanto alle note di Klaus, ci sono varianti dell'apertura che non prevedono l'arrocco per il nero: infatti l'arrocco ha il difetto di spostare le torri dalla loro posizione di vasi per rampicanti...  . Af5 è interessante ma voglio ancora qualche mossa prima di decidere dove è meglio che vada l'alfiere. ",
        "7. Be3": ".Come previsto da Stefano, gioco Ae3 che è una mossa contemplata nell'apertura e, con questa posizione sulla scacchiera, la più corretta.\nOra voglio vedere se Stefano indugia a bloccare la conquista del centro da parte dei miei pezzi.\nMi aspetto l'arrocco corto o, ancor meglio, una scalata nella verticali di lato tipo a5. Anche Db6 non sarebbe male, ma obiettivamente, anche se mette sotto stress il mio lato di donna, mi impensierisce poco in quanto con Tb1 la cosa è risolta. ",
        "7... Qb6": ".La casella e3 non è una buona destinazione per l'alfiere, perché io non muoverò certo g5 o c5 per liberarlo. Mi aspetto che in futuro si sposti in f2.\nQuanto a me, è ora di far vedere la specialità della Robatsch: i cambi di lato. Comincio con Db6: una toccata sul lato di donna, che può essere facilmente parata con Ca4 o con Tb1, ma la mia regina è molto mobile, e lo sarà ancora di più dopo e6.\nTra le due mosse del bianco non so quale preferire: Ca4 guadagna un tempo che perderà quando giocherò b5, Tb1 è tranquilla ma distoglie la torre bianca dalla colonna del rampicante 😉 ",
        "8. Rb1": "Ero indeciso tra Tb1 e Pb2. Ora Stefano inizierà l'atteso logoramento ai fianchi. pa5 potrebbe essere una possibilità, se prima non decide per l'arrocco. Anche Ag4, prontamente contrastato da il mio Ae2 potrebbe essere una continuazione interessante. \nNon sono un esperto di questa apertura e pertanto mi affido all'istinto e ad una elaborazione, più semplificata possibile, della situazione sulla scacchiera. Obiettivamente sono un po' privo di idee che potrebbero aiutarmi a sfondare le posizioni del nero, ma, come al solito, giocherò contenendo le sue velleità che, a mio parere, giocando sui fianchi, cercherà di destabilizzare la mia formazione al momento così così   (non sono soddisfatto)\n",
        "8... Bg4": ".Ho esaminato una possibilità interessante, Cg4. La variante è:\n8. ... Cg4\n9. Dd2 (per non rovinare l'arrocco) Cxe3\n10. Dxe3\ne a questo punto con Af4 costringo la regina bianca a muovere per la terza volta, mentre con Ag4 preludo a un apparentemente inevitabile impedonamento del bianco sulla colonna f (per salvare il pedone d4, mentre Ce2 perde il pedone a2). Davvero versatile la Robatsch!\n\nPer lo scopo di questa partita, però, preferisco rimanere sul tracciato classico. Perciò gioco la rampicante mossa di sviluppo Ag4, alla quale il bianco risponderà con Ae2 per liberare la regina dal 'pin' \n.\nMi correggo anch'io\n10. Dxe3 Ag4\n11. Ae2 evita l'impedonamento ",
        "9. h3": "Stranamente non ho mai avuto paura delle impedonature. La cosa però, al momento, grazie alla mia solerte Donna, non è ancora in vista.\nAvrei potuto giocare Ae2 e successivamente h3, ma ho l'impressione di perdere tempo. Gioco subito h3 per allontanare l'Alfiere in f5 o obbligarlo, come penso sarà  , allo scambio con il mio cavallino.\nLa mossa che mi infastidisce maggiormente è la possibile Cf5. Una posizione decisamente di predominanza per il nero che farà retrpcedere il mio Alfiere campo-scuro.\nForse qualcuno penserà che logica ci sia di giocare una partita dove i due avversari si comunicano le loro idee. Ricordo che stiamo solo cercando di far comprendere quali idee sobillino la mente di uno scacchista prima di muovere e che tutto questo epistolario è intentato solo a coinvolgere e, nel possibile, insegnare a qualche interessato i rudimenti principali di un'apertura e il conseguente medio-gioco. ",
        "9... Bxf3": "Giustissima annotazione di Klaus, e io aggiungo: non fatevi remore a chiedere spiegazioni o a dare suggerimenti. Questa partita è soprattutto vostra. E poi magari mi evitate una delle mie cavolate!  \n\nHo esaminato l'ardita Cf5 subito, ma non si va oltre a un cambio nell'ordine naturale delle mosse. Se avessi di fronte un giocatore inesperto potrei provarla per vedere se il mio avversario, messo sotto pressione, commette un errore. Ma naturalmente non è il caso   e allora gioco subito AxCf3, che sarà seguita da DxAf3 e da Cf5.\n\nPresumo che poi Klaus metterà al sicuro l'alfiere in f2, ma effettivamente il mio cavallo in f5 è in una posizione dominante. Il pedone d4 non è in pericolo, per ora; la variante:\n\n11. Af2 Cxd4\n12. Dd3 c5\n13. Axd4 cxd4\n14. Ce2 Db4+\n15. c3 dxc3\n15. bxc3\n\nmantiene a stento il pedone guadagnato, a costo di pericolosissimi attacchi del bianco sulle colonne b e d. Pedone dunque avvelenato, ma senz'altro sotto pressione. E regina bianca tutta spostata sul lato di re...   E infine una situazione, a mio parere, fluida e tranquilla dalle parti del nero, con la possibilità di completare lo sviluppo con e6, Cd7, e qualche sorpresa. .",
        "10. Qxf3": "Tutte mosse sensate e logiche che mostrano come questa apertura sia accativante per il nero. Effettivamente l'azione logorante ai fianchi, come presto succederà anche nel lato di donna, appaga le pretese del nero di far stagnare il gioco centrale a favore di logoranti incursioni laterali.\nCf5, come prospettato, è una mossa molto incisiva.\nNon devo lasciare l'iniziativa a Stefano che, a quanto pare, conosce bene questa apertura che, sinceraente, io non ho mai usato, optando per la similare Pirc.\nLe mosse prospettate da Stefano:\n\n10. Dxf3 Cf5\n11. Af2 Cxd4\n12. Dd3 c5 mi vanno benissimo.\nsolo che a questo punto gioco 13. b4! .",
        "10... Nf5": ".",
        "11. Bf2": "\n",
        "11... e6": "In effetti io non avevo intenzione di giocare 11. ... Cxd4, mossa che trovo prematura e strategicamente pericolosa. Difatti tu, oltre a Ce2 da non trascurare, potresti giocare, dopo b4 e c5, Cxd5 riguadagnando il pedone in tutta tranquillità. Perciò se mai prima giocherei e6. La variante l'ho presentata per scopo didattico, infatti ha sollevato un certo interesse 😉\n\nSono d'accordo con la sequenza di mosse fino a 11. Af2. Adesso ci rifletto un attimo, poi ti scrivo la mia mossa 11. .\n.\nPreferisco continuare lo sviluppo, consolidare la struttura dei pedoni, preparare Af8 che mi consentirà di spostare l'alfiere sui due lati. Come detto in precedenza, sarà una partita strategica e posizionale. Il cavallo in f5, in tal senso, controlla più che minacciare.\n\nOra Klaus si trova, secondo me, in seri dubbi: Ad3 è una buona mossa di sviluppo e minaccia il mio wondercavallo, ma toglie la casella d3 alla regina, e allora potrei davvero decidere di prendere il pedone d4; Ce2 permette l'ottima mossa c3, ma allontana un altro difensore dal lato di donna; Ca4 perde inutilmente un tempo dopo Db4+; g4 finisce con scambio di torri e regina bianca in castigo in h1... nelle partite posizionali, si dedica molta energia a minare il possibile gioco dell'avversario. ",
        "12. b4": ".Un buon insegnamento negli scacchi è quello di far si che le convinzioni del proprio avversario comincino a traballare per qualche insicurezza. La parola minare, come ben tutti sapiamo, in questo caso vuole infatti significare rendere insicura la struttura che l'avversario si era proposto di creare per rendere incisivo un suo attacco in un certo lato, generalmente dove si trova il re o il più debole, della scacchiera.\nHo l'impressione che Stefano stia cercando di fuorviarmi, tipo Quinto Fabio Massimo Verrucoso detto il Temporeggiatore, con continue, ma non incisive minacce nel lato di Re, mentre nel lato di donna cerca di creare una solida base per iniziare da questo lato la vera battaglia. Forse mi sbaglio, ma non voglio lasciarmi sorprendere troppo.\nMuovo b4. Stefano cercherà di rinforzare la diagonale nella quale è andata a piazzarsi il mio pedone arretrando il suo Alfiere in f8, ma io insisterò nella mia idea di far demordere la sua iniziativa obbligando la sua donna ad andarsene dalla verticale b muovendo il mio cavallo in a4.\nA questo punto molte velleità si spegneranno ",
        "12... Bf8": "Un buon insegnamento negli scacchi è quello di far si che le convinzioni del proprio avversario comincino a traballare per qualche insicurezza. La parola minare, come ben tutti sapiamo, in questo caso vuole infatti significare rendere insicura la struttura che l'avversario si era proposto di creare per rendere incisivo un suo attacco in un certo lato, generalmente dove si trova il re o il più debole, della scacchiera.\nHo l'impressione che Stefano stia cercando di fuorviarmi, tipo Quinto Fabio Massimo Verrucoso detto il Temporeggiatore, con continue, ma non incisive minacce nel lato di Re, mentre nel lato di donna cerca di creare una solida base per iniziare da questo lato la vera battaglia. Forse mi sbaglio, ma non voglio lasciarmi sorprendere troppo.\nMuovo b4. Stefano cercherà di rinforzare la diagonale nella quale è andata a piazzarsi il mio pedone arretrando il suo Alfiere in f8, ma io insisterò nella mia idea di far demordere la sua iniziativa obbligando la sua donna ad andarsene dalla verticale b muovendo il mio cavallo in a4.\nA questo punto molte velleità si spegneranno .",
        "13. Na4": "Un buon insegnamento negli scacchi è quello di far si che le convinzioni del proprio avversario comincino a traballare per qualche insicurezza. La parola minare, come ben tutti sapiamo, in questo caso vuole infatti significare rendere insicura la struttura che l'avversario si era proposto di creare per rendere incisivo un suo attacco in un certo lato, generalmente dove si trova il re o il più debole, della scacchiera.\nHo l'impressione che Stefano stia cercando di fuorviarmi, tipo Quinto Fabio Massimo Verrucoso detto il Temporeggiatore, con continue, ma non incisive minacce nel lato di Re, mentre nel lato di donna cerca di creare una solida base per iniziare da questo lato la vera battaglia. Forse mi sbaglio, ma non voglio lasciarmi sorprendere troppo.\nMuovo b4. Stefano cercherà di rinforzare la diagonale nella quale è andata a piazzarsi il mio pedone arretrando il suo Alfiere in f8, ma io insisterò nella mia idea di far demordere la sua iniziativa obbligando la sua donna ad andarsene dalla verticale b muovendo il mio cavallo in a4.\nA questo punto molte velleità si spegneranno .",
        "13... Qc7": ".",
        "14. g4": ".",
        "14... hxg4": "In questa situazione, mi trovo ad un bivio strategico importante. Da una parte c'è un sentiero tranquillo, dall'altra una mulattiera tra i dirupi. Il sentiero tranquillo corrisponde alla mossa Cg7: il cavallo torna indietro solo temporaneamente, perché potrà tornare in f5, sia che il bianco muova g5, che g4xh5 (a cui seguirebbe Txh5). Se invece il bianco non prende ne avanza con il pedone g4, allora mi si crea qualche imbarazzo (ad esempio Ad3). h5xg4 porta allo scambio di torri menzionato in seguito, con il cavallo posizionato un po' peggio.\nLa strada impervia è quella tracciata da Klaus come sconveniente per il nero. In realtà il giudizio di Klaus mi lascia perplesso; infatti dopo lo scambio di torri seguito da Dxh1 Ch6, supponendo che il bianco voglia aprirsi subito la colonna h con g5 seguito da Cf5, ecco che la donna è libera di scorrazzare per la colonna h, ma... a fare che? Il re nero potrebbe essere minacciato solo dall'intervento a supporto della torre, o dell’alfiere camposcuro, che sono molto laboriosi; la regina da sola non può fare granché, perché io non ho intenzione di arroccare; il mio alfiere è bloccato, ma la regina Bianca è lontanissima dall'azione, e nel cambio ci guadagno. Al bianco conviene, quasi quasi, Dh3, per posizionarsi sulla riga libera, ma se la regina dovesse intervenire sul lato di donna, il pedone g è in presa. Meglio allora Dh4, che però non minaccia nulla.\nIo ho deciso: strada impervia. 14. g4 hxg4 15. hxg4 Txh1 16. Dxh1 Ch6.",
        "15. hxg4": ".",
        "15... Rxh1": ".",
        "16. Qxh1": ".",
        "16... Nh6": ".",
        "17. Be2": "Poiché sappiamo tutti che il numero delle partite in 40 mosse che si possono inventare è stato calcolato essere pari a 25 moltiplicato 10 elevato alla centoquindicesima, il che è di gran lunga superiore al numero di elettroni che popolano l’universo: 10 elevato alla settantanovesima, avevo solo l'imbarazzo della scelta di cosa muovere...  \nNaturalmente scherzo   Rispetto il modo di vedere del mio avversario e forse ha ragione.\nOra l'unico problema, considerata la calma sulla scacchiera è quello di difendere il Pg dall'attacco del cavallo. Ho deciso di difenderlo con l'alfiere. La mia donna al momento mi va bene dove stà.\nOra aspetto che Stefano si decida a muove un pedone sul lato di donna. E' da un po' che l'aspetto questa mossa, già promessa per tener fede allo spirito di questa apertura. Resta ancora valida anche Ca6.\nLasciamoci sorprendere  \n.",
        "17... a5": "Prima di tutto, complimenti al matematico che ha fatto questo calcolo, mi piacerebbe stringergli la mano. Sei stato tu, Klaus?\n\nOra che tocca a me, vedo che nel mio universo ci sono solo tre elettroni: a5, b5 e Ca6. Siccome voglio fare tutte e tre queste mosse, non resta che scegliere l'ordine, in modo che Klaus non me le possa impedire. O in modo che io stesso non me le impedisca; Ca6 impedisce a5, per esempio. Ci sono altre due mosse più sottili: b6 e Cd7. Soprattutto quest'ultima mi può tornare utile, seguite il mio ragionamento. Dopo b5, il cavallo bianco potrebbe andare in c5, rendendo possibile uno scambio di cavalli in a6 o in d7. Siccome il mio cavallo mi sembra più cruciale di quello di Klaus, per la mia manovra di attacco, non voglio questo scambio.\nPerciò comincerei con a5, quale seguirebbe prevedibilmente a3 (b4xa5 manco a parlarne, c3 taglia la strada del ritorno al cavallo); poi seguirebbe Cd7, in modo da poter muovere Cb6 se il bianco muove Cd5 senza rischiare lo scambio, e poi poter spostare il cavallo in c4, casella dalla quale non può essere sloggiato se non sacrificando l'alfiere buono. Queste mosse di cavallo, avverranno prima o dopo b7-b5, a seconda dei casi.\n\nAvevo detto b4xa5 manco a parlarne? Guardate questa variante:\n\n… a5\nbxa5 Dxa5+\nCc3 Ab4\nDxh6 Axc3+\nRf1 Dxa2\nDh8+ Rd7\nAh4 (a 1 dal matto!) Dxb1+\n\nE il nero da’ scacco finché l’alfiere non torna in a5, unica mossa che salva il nero dal matto. Ma con una torre di vantaggio. \n.",
        "18. b5": "No, in internet. Sono un appassionato comunque dei grandi numeri. Un esempio: lo conosci il volume dell'universo in Km³ ? (dati del 12.06.2017, ore 14:00) 234'215'710'900'992'000 circa. Se pensi che il suo raggio si espande di circa 300.000 km al secondo, nel frattempo è cresciuto ancora un po'  \nTorniamo comunque alla nostra partita.\nTutto è solo questione di prospettive. Come vedi dalla mia risposta, tutto è relativo  \nAvevo tre possibili risposte; b5 (che ho giocata) g5 e Cc5.\nPenso che Stefano abbia preso in considerazione la mia prima possibilità molto poco. Ora in risposta a questa mossa che, penso, lo aiuterà a meditare un pochino  , ha tre diverse possibili risposte:\n\n► 1ª Possibilità\n18. b5 cxb5\n19. Axb5+ Cc6\n20. Df3 0-0-0\n\n►2ª Possibilità (comporta la perdita di un pezzo)\n18. b5 Cxg4\n19. b6 De7\n20 Axg4 Da3\n\n►3ª Possibilità (forse è la peggiore)\n18. b5 Cd7\n19. b6 Db8\n20. Rd2 Cf6\n\nPenso che sceglierà la prima..  \nInsegnamento: Si dice che la miglior difesa è l'attacco, ma ricordiamoci di Krojanty  .",
        "18... cxb5": "No, in internet. Sono un appassionato comunque dei grandi numeri. Un esempio: lo conosci il volume dell'universo in Km³ ? (dati del 12.06.2017, ore 14:00) 234'215'710'900'992'000 circa. Se pensi che il suo raggio si espande di circa 300.000 km al secondo, nel frattempo è cresciuto ancora un po'  \nTorniamo comunque alla nostra partita.\nTutto è solo questione di prospettive. Come vedi dalla mia risposta, tutto è relativo  \nAvevo tre possibili risposte; b5 (che ho giocata) g5 e Cc5.\nPenso che Stefano abbia preso in considerazione la mia prima possibilità molto poco. Ora in risposta a questa mossa che, penso, lo aiuterà a meditare un pochino  , ha tre diverse possibili risposte:\n\n► 1ª Possibilità\n18. b5 cxb5\n19. Axb5+ Cc6\n20. Df3 0-0-0\n\n►2ª Possibilità (comporta la perdita di un pezzo)\n18. b5 Cxg4\n19. b6 De7\n20 Axg4 Da3\n\n►3ª Possibilità (forse è la peggiore)\n18. b5 Cd7\n19. b6 Db8\n20. Rd2 Cf6\n\nPenso che sceglierà la prima..  \nInsegnamento: Si dice che la miglior difesa è l'attacco, ma ricordiamoci di Krojanty  \n.",
        "19. Bxb5+": "Insegnamento: Si dice che la miglior difesa è l'attacco, ma ricordiamoci di Krojanty.\n\nLa carica di Krojanty o battaglia di Krojanty è stata una carica di cavalleria polacca durante la campagna di Polonia operata da parte delle truppe naziste impegnate nell'occupazione del territorio polacco, nella seconda guerra mondiale. La campagna (1º settembre 1939 – 5 ottobre 1939) è culminata con la resa delle ultime forze polacche, al termine della quale, dopo circa quattro settimane di combattimenti, ebbe inizio la seconda guerra mondiale. il 1º settembre a Krojanty il 18º reggimento di Ulani carica di sorpresa e disperde elementi del 76º reggimento di fanteria appartenente alla 20ª divisione motorizzata delle forze naziste.\nCavalleria polacca durante la battaglia del fiume Bzura\n\nDurante l'invasione la cavalleria polacca effettuò un totale di 16 cariche nel tentativo di arrestare l'avanzata tedesca; qui i nazisti poterono sperimentare e mettere appunto la moderna tecnologia offerta dai carri armati, dagli aerei e dalle radiocomunicazioni, allo scopo di creare una nuova modalità di guerra caratterizzata dall'uso combinato di nuove forze di attacco. La campagna del 1939 rappresenta l'esempio dell'efficacia dell'informazione mediatica utilizzata per svolgere la propaganda riguardo l'efficienza delle proprie forze, oltre che allo scopo di screditare la capacità difensiva del nemico. Essa difatti fu il primo esempio del un nuovo metodo di condurre la guerra, per la quale gli strateghi di Berlino coniarono il termine \"Blitzkrieg\", (guerra lampo), dove le forze tedesche tentarono di annientare con azioni fulminee, l'esercito poco addestrato e male organizzato nemico. \n-----------------------------------------------------\n.\n18. b5 cxb5\n19. Axb5+ Cc6\n20. Df3 Rd8\n\nquesta era la continuazione proposta da Stefano, che, a suo dire, considerava la più logica e che accetto considerato che, dopo queste mosse, a mio avviso, si potrebbe considerare questa partita conclusa tanto è palese il vantaggio del bianco, molto difficile da recuperare.\n\nLa mia mossa è:\n\n21. c4 e così facciamo traballare il centro del nero e metto pressione sul Re appostato in d8. Nemmeno la prossima Ab4+ con successiva 22. Rd1 scalfisce il mio vantaggio. Forse una esame approfondito di Stefano mi darà ragione, o no  ? ",
        "19... Nc6": ".",
        "20. Qf3": ".",
        "20... Kd8": ".",
        "21. c4": ".",
        "21... Nb4": "Non riesco a vedere il colossale vantaggio del bianco :/ d'altra parte, in queste situazioni, si vedono quei settecento punticini di differenza tra me e Klaus: nella capacità di analisi strategica. Vabbè, se vado incontro al disastro, lo farò da scacchista vero, o meglio, come quel capitano della cavalleria polacca che affrontò a sciabolate un panzer. Per la cronaca fece una brutta fine, ma salvò l'onore.\n\nMi aspettavo, peraltro, la manovra di Klaus per destabilizzare il centro, bloccato praticamente dall'inizio della partita. Ad ogni manovra verso il centro, però, può corrispondere una insidia sui lati; E questo il concetto base della Robatsch. Pertanto non gioco Ab4+, che avrebbe solo l'effetto di mettere il re bianco dove vuole già andare, cioè in d1 (per consentire Tc1 senza timori). Gioco Cb4; mi sembra una buona mossa, mette in presa il pedone a2, e consente la risposta Cxd5 a cxd5, mettendo il cavallo nero a fare il pedone supplente per tenere bloccato il centro, ma in una posizione insidiosa per il bianco, con il pedone f4 in presa. cxd5 mi sembra la risposta più logica da parte del bianco; De2, l'unica altra mossa che difende entrambi i pedoni a2 e c4, entrambi insidiati, non va affatto bene per il bianco, chi rischia fortemente di perdere il pedone g4. c5 porta a Cxa2, ma dopo Cb6 e Ta7 I pericoli per il nero mi sembrano finiti.\n\nSuccessivamente, mi aspetto tentativi del bianco di giocare Tc1 per attaccare sulla colonna c (previ Rd1 e Ae3), ma sono pronto a contrastarli. .",
        "22. Kf1": "Sposto il mio Re per anticipare le cattive intenzioni del cavallino che, a quanto pare, ha voglia di galoppare, ma solo per divertimento. Se proprio aveva voglia di trottare, sarebbe stato meglio se andava a brucare in a7.\nForse Stefano ha ragione sul mio eccessivo ottimismo. Mi scuso per aver venduto l'orso prima di averlo nel sacco (lo diceva anche Trapattoni  ). Logicamente sono molto ottimista sulla mia attuale situazione sulla scacchiera. Resto convinto del ritardo del nero nel contrastare l'attacco al centro. Ora il Re nero deve cercare di togliersi dalla diagonale della sua Donna. L'alfiere in f2 pazientemente aspetta di balzare in b6, logicamente prima il Pd4 deve spostarsi.\n\nA questo punto è facile notare, secondo il mio modesto giudizio, che l'arrocco lungo, che mi sembrava di aver prospettato alcune mosse fa, arebbe sicuramente aiutato Stefano.\n\nOra aspetto la mossa che avrebbe dovuto fare prima:\n\n22. ... Rc8\n\nLogicamente sposterò il mio pedone ariete in c5 e il cavallo tornerà in c6 (un tempo perso?) La sentenza ai posteri  .",
        "22... b6": "I pericoli menzionati da Klaus si concretizzano se il suo pedone d4 si sposta, dunque è mio interesse:\n- non prendere con d5xc4, pena aprire la diagonale h1-a8 per la donna (brrrr) o la diagonale g1-a7 per l'alfiere (doppio brrrr)\n- lasciare il mio cavallo in b4, in modo che se il bianco fa c4xd5, allora Cxd5 e 'pedone supplente' (e mia regina su colonna libera)\n- contrastare l'avanzata del pedone c.\nPerciò muovo b7-b6, e se la risposta è c5, allora scambio bxc e cxd (presumo) e poi Tb8 che mette in presa l'alfiere in b5 e protegge b6 dall'altro alfiere. .",
        "23. a3": ".Una mossa non contemplata da Stefano. Semplice semplice  \nIl cavallino ha molto posto dove trottare. Non so esattamente quale sarâ la prossima mossa del nero. Ma qualsiasi essa sia, mi porterà ad aumentare il mio vantaggio. Voglio comunque farmi sorprendere dalle decisioni di Stefano ",
        "23... Nc2": "Acc.... questa mossa non l'avevo proprio considerata. E nonostante l'understatement di Klaus, è decisiva. Per salvare la posizione, dovrò sacrificare, secondo i miei calcoli, l'alfiere per un pedone. (E mi andrebbe già di lusso). Visti i chiari di luna, gioco Cc2, e comincio a pensare alla prossima partita didattica. Siciliana Najdorf con English Attack? .",
        "24. cxd5": "Consideriamo la situazione... leggermente brutta (per non usare altri eufemismi) per Stefano.\nL'attuale posizione sulla scacchiera denota chiaramente che il gioco del nero è completamente bloccato. Ora Stefano, se vuole continuare a giocare (cosa che mi auguro faccia per appagare i sadici  ) deve limitare i danni bloccando la diagonale della mia regina con la sua spostando Db7. La mossa exd5, come lampante, costerebbe al nero la Torre (Dxe5+ e successivo DxTa8). Logicamente ora la mia armata non può fermarsi e continuerò`con Ah4+ che costerà un altro pedone al nero. Insomma, per il nero vedo... nero  .",
        "24... Qb7": "ì, Klaus, l'unica mossa che mi mantiene in vita è Db7. Ad Ah4+, rispondo Ae7. \n.",
        "25. Bc6": "Ho studiato tutte le mie possibilità di gioco e possibili continuazioni.\n\n25. Ac6 Ce3+\n26. Axe3 (una mossa per ritardare quanto il fato ha già deciso  )\n\n25. Ah4+ Ae7\n26. AxAe7 DxAe7\n27. d6!\n\n25. Ac6 Da6+\n26. Rg1 e poi?\n\nInsomma, sinceramente, vale la pena continuare? Se si, muovo Ac6. .\n\n-------------------------------\nCommento di Stefano\n-------------------------------\nSono andato un pochino più avanti con 25. Ac6 Da6+ 26. Rg1 Tb8 e non mi pare che, dopo d6, ci sia il modo ragionevole di impedire che il pedone d vada a regina, con matto in poche mosse.\n\nPerciò, stretta di mano e personale soddisfazione nel vedere Klaus felice per la vittoria, e nel constatare che stavolta ho perso strategicamente, senza commettere marchiani errori. Un passo avanti.\n\nSe tornassi indietro... giocherei b5 prima di a5.\n\nSotto con la prossima! Siciliana Najdorf, la \"Cadillac\" delle aperture  \n---------------------------------\nCommento di Klaus\n---------------------------------\nSperavo che la partita durasse più a lungo, ma qualche mossa innovativa di Stefano ha accorciato le gambe alla partita.\n\nPoiché, come è stato detto in precedenza, lo scopo finale di questi threads non è quello di vincere o perdere una partita, ma di interessare i più a scopo di insegnamento, penso che dovremmo in seguito evitare, almeno per la prima parte della partita, mosse non contemplate nella normale apertura.\n\nSpero che i più abbiano capito come la partita Moderna-Robatch, pur portando come fine il logoramento ai lati della formazione bianca, sia facilmente contrastabile se il bianco blocca le iniziative del nero e mantiene solido il centro.\n\nCertamente, se l'avessi giocata contro un GM o latri ossi duri, non sarei riuscito ad arrivare al finale giocato e, probabilmente mi avrebbe fatto fare la fine del topo, ma questa è un'altra storia  \n\nInsegnamento: giochiamo aperture semplici se ci sentiamo più sicuri.\n"
    },
    "url": "https://gameknot.com/annotation.pl/apertura-moderna-variante-robatch-partita-didattica-ihs?gm=63403",
    "gameName": "Apertura Moderna / Variante Robatch (Partita didattica IHS)",
    "players": "Skorpio47 (Klaus)  vs. jrcmancer (Stefano) ",
    "opening": "Robatsch defence (B06), Gurgenidze variation"
}