{
    "moves": {
        "1. d4": "Friedrich Saemisch (Charlottenburg, 20 settembre 1896 – Berlino, 16 agosto 1975), è stato uno scacchista tedesco.\n\nPur essendo stato un forte giocatore, vincitore di numerosi tornei, Friedrich Sämisch è noto soprattutto per aver dato il suo nome a due importanti varianti di apertura:\nAlla difesa est indiana: 1. d4 Cf6 2. c4 g6 3. Cc3 Ag7 4. e4 d6 5. f3\nAlla difesa Nimzowitsch: 1. d4 Cf6 2. c4 e6 3. Cc3 Ab4. 4. a3\n\nNel 1950 fu uno dei 27 giocatori che la FIDE nominò Grande maestro quando il titolo venne ufficialmente creato.\n\nNel torneo di Carlsbad del 1929 non ottenne una buona classifica, ma vinse il premio di bellezza per la partita contro Grünfeld. Nello stesso torneo vinse anche con José Raúl Capablanca. Il grande cubano fece una svista in apertura e perse un pezzo, ma anziché abbandonare, come avviene in questo caso nelle partite di alto livello, tentò di resistere. Lo svantaggio si dimostrò troppo grande anche per un giocatore della sua classe. Questa sconfitta costò a Capablanca il primo posto nel torneo (si classificò pari secondo a mezzo punto da Aaron Nimzowitsch).\n\nNoi in questo forum cercheremo di scrutare più a fondo la variante della difesa est indiana\n\n1. d4 Cf6\n2. c4 g6\n3. Cc3 Ag7\n4. e4 d6\n5. f3 (Il bianco consolida la struttura dei pedoni centrali, riservandosi di rispondere alla spinta del nero in e5 o c5 con la spinta in d5, assicurandosi una forte catena pedoni sulle case bianche. In questa variante, usualmente, il bianco arrocca lungo; contrariamente al normale sviluppo strategico della partita con arrocchi eterogenei e centro bloccato, qui il bianco e il nero possono condure l’attacco e il contrattacco anche sugli stessi settori sul quale arroccato il proprio Re. (fonte Porreca)\n5. … O-O (Si può giocare anche subito 5. … e5, dato che in caso di 6. dxe, dxe; 7. Dxd8+ Rxd8; 8. Ag5 c6 ecc. il bainco non ottiene nulla.) \nCome scritto anche sulle informazioni di Gknot, scopriamo che dopo questa posizione, esistono diverse possibilità (sottovarianti)\n6. e5 King's Indian (E85), Saemisch, variante ortodossa\n6. b6 King's Indian (E82), Saemisch, double fianchetto variation\n6. c6 King's Indian (E81), Saemisch, Byrne variation\n\nAbbiamo un amico, Stefano (ircmancer) che è molto interessato a questa variante dell’est-indiana. Per lui, ed altri interessati apro questo forum sperando di fare cosa gradita.\n\nA questo punto, continuando dalla 6° mossa del bianco Stefano ed io continuiamo questa partita cercando di seguire una sequenza di mosse più consona possibile alla variante Saemisch e commentando di volta in volta le mosse che giocheremo. ",
        "1... Nf6": ".",
        "2. c4": ".",
        "2... g6": ".",
        "3. Nc3": ".",
        "3... Bg7": ".",
        "4. e4": ".",
        "4... d6": ".",
        "5. f3": ".",
        "5... O-O": ".",
        "6. Bg5": ".",
        "6... c5": "Non ho un gioco irruento, pertanto cerco di non uscire molto dagli schemi dell' est-indiana.\nD'altronde questa mossa è stata giocata da Kasparov e, per certi campioni, ho il massimo del rispetto anche se, in verità, ero tentato di giocare subito h6 per fermare le brutte intenzioni del cavallo di donna.\nMi aspetto d5 da parte del mio avversario che non penso sia intenzionato ad abbattere il centro che si è costruito.\n",
        "7. Nge2": "Mmmm... sono molto indeciso, tra due mosse.\n- 7. d5, prevista da Klaus, blocca il centro, lasciandomi tempi per attaccare dal lato di re, ma lascia anche la diagonale libera per l'alfiere di re del nero, e mi impedisce la futura mossa Cd5, importante per far spostare il Cf6, baluardo difensivo del lato di re del nero.\n- 7. Cge2, che in caso 7. ... cxd4 8. Cxd4 lascia il centro aperto, ma con i cavalli bianchi in posizione più aggressiva. Inoltre la diagonale è meno accessibile e Cd5 possibile.\nUna nota per Klaus: secondo me 6. ... h6 è pericolosa, una volta che il bianco è tornato in e3 con l'alfiere e ha messo la donna in d2...\n\nBeh, intanto ci ho pensato:\n\n7. Cge2\n",
        "7... Qb6": "Mi ero preparato un commento per d5 del bianco, ma ho dovuto gettare tutto. ",
        "8. Qd2": "Oh... mi dispiace, Klaus, ma credo che l'imprevedibilità sia una delle tante qualità che, in equilibrio, creano lo scacchista 😊 Spero che renda interessante questa partita di studio!\n\nKlaus dimostra coraggio (altra qualità importante), con Db6 crea pressione e diversivo sul lato di donna, e mi mette in pensiero per il mio progetto di arroccare lungo, e per la possibile pressione su d4. In compenso, allontana la regina dal lato di re.\nInoltre, c'è il pedone al sarin in b2, sacrificandolo, allontanerei ulteriormente la regina nera dall'azione, ma direi addio all'arrocco lungo.\nPotrei mettermi a caccia della regina con Ch4, e alla fine della variante avrei i cavalli in buona posizione sul lato di donna, ma vorrebbe dire posporre l'attacco dal lato opposto. In generale, cerco sempre di stare nel piano originale, a meno di un'ottima occasione.\n\nIn sunto, mi accontento del leggero vantaggio di avere la regina nera allontanata temporaneamente, tolgo il vetriolo da b2, e proseguo con il piano originale, preparandomi all'eventuale bufera su d4:\n\n8. Qd2 \n",
        "8... cxd4": "on devi preoccuparti Stefano. Anzi, apprezzo moltissimo l'imprevedibilità e la fantasia dei miei avversari. Vedi ad esempio le mie partite con Aurelio, (jrcapatosta), un giocatore che, grazie a queste sue capacità non sono ancora riuscito a battere  \nDevo riconoscere che queste attitudini non brillano nel mio curriculum. Il mio gioco, anche se sufficientemente preciso, il mio amico-insegnante di scacchi Paco, lo definisce \"schifosamente matematico\", manca di quel tocco di fantasia in grado di vincere una partita per merito e non, come mi succede spesso, per gli errori del mio avversario.\nDopo questa piccola confessione, proseguiamo con la nostra partita.\nPenso che dopo aver posizionato la mia Donna in b6, posso permettermi di cercare di indebolire il tuo centro. I pedoni in linea sono estremamente ostici da abbattere, meglio farlo subito.\nPenso che prima di occuparti del pedone in d4, andrai a eliminare il mio cavallo in f6 per proseguire cercando di minacciare la mia donna con il tuo cavallo (Cd5). Sono comunque supposizioni.\nConsidero la mia struttura, dopo le suindicate mosse un po' più solida di quella di Stefano. Tutto dipenderà dal suo arrocco, probabilmente lungo. Lasciamoci sorprendere  \n",
        "9. Nxd4": "Ho esaminato attentamente la 'variante Klaus', e in sostanza si finisce con pedoni doppiati in colonna f e un pedone isolato in d... una buona struttura (per il bianco 😄) nel finale, con il re nelle catacombe, e il re nel finale deve essere in prima linea come Harold nella battaglia di Hastings (wikipediatelo per vedere com'è andata a finire...).\nEppure non mi convince, non saprei che piano adottare nel frattempo (l'attacco dal lato di re non va, con tre pedoni contro quattro) e non mi piace, oltre che essere poco salutare, aspettare e scambiare.\nPreferisco stare sul semplice. Dopo Cxd4, mi aspetto Cf6, e portando il cavallo in b3 potrò, Klaus permettendo, fare il sospirato arrocco lungo e iniziare l'attacco dal lato di re. La posizione dei cavalli è simile a quella che si raggiunge nell'English Attack della Najdorf: sembrano fuori dai giochi, ma in due balzi...\n\n9. Cxd4 \n",
        "9... Nxe4": "Mi lascio contagiare dalla voglia di innovazioni. Forzo il gioco e vediamo come va a finire.\nLa combinazione è lunga e tutto dipende dalle intenzioni del mio avversario. Gioco Cxe4. \nPresumo che la continuazione sarà la seguente. Oltre non voglio rischiare di buttarmi nell'analisi.\n\n09. ... Cxe4\n10. fxCe4 DxCd4\n11. Axe7 Te8\n12. Dxd4 Axd4\n13. Axd6 Axc3+\n14. bxc3\n\nDopo questa combinazione, se va in porto, come potrete tutti notare se la visualizzate sulla vostra scacchiera, la struttura del bianco è molto \"bucherellata\" e mi trovo, anche se materialmente con un pedone in meno, avantaggiato nella struttura del gioco. Prima comunque vediamo come risponde Stefano. ",
        "10. fxe4": "o esaminato furiosamente la situazione e le varianti 🤔🤔🤔 e sono giunto alle seguenti conclusioni:\n- la 'variante Klaus' è brutta brutta per me, il nero recupera il pedone (Txe4) nella mossa successiva, e poi mi trovo pedoni doppiati e isolati in colonna c... praticamente carne da torre.\n- mi è sembrato di intravedere una soluzione che mi permetterebbe di evitare i pedoni doppiati, ma le varianti possibili sono tante... meglio giocare una mossa alla volta. Comunque la butto giù per reciprocità: fxe4 Dxd4; Axe7 Te8; Axd6 Dxd2+; Rxd2 Axc3+; Rxc3 Txe4\n- per adesso devo prendere il maledetto cavallo kamikaze, e lo faccio perché se prendessi con il cavallo rischierei che Te8 me lo inchiodasse al re e poi il nero gioca f5...\n\ndunque per ora:\n10. fxe4 \n",
        "10... Qxd4": "Seguo le indicazioni scritte nella nota della mia 9. mossa.\n\nAl momento non voglio uscire dallo schema prefisso. Con leggero sadismo noto che ho scompaginato i piani iniziali di Stefano. Generalmente esco poco dalle mosse di base di un'apertura, ma questa volta, a quanto pare, cambiarle si è volto a mio favore.\n\nPer vincere non bisogna giocare solo bene, in questo modo tutte le partite finirebbero patte, ma indurre l'avversario ad un errore o uno sbandamento della struttura e profittarne.\nLogicamente con Stefano non siamo ancora arrivati a questo punto.\n\nUna valutazione complessiva, al momento, concede al nero quel leggerissimo vantaggio che questa apertura da. Il bianco, ha si costruito un centro ampio ma solido sostenuto dal Pf3, ma il nero ha la possibilità di sfruttare il leggero ritardo di sviluppo causato dalle molte spinte di pedoni del bianco.\n\n",
        "11. Bxe7": "Apprezzabile l'understatement di Klaus 😄 In realtà ha spazzato via i miei piani come l'asteroide di Chikxulub ha cancellato i dinosauri. Ma come in ogni battaglia, anche negli scacchi ogni piano non resiste un istante all'impatto con il nemico. Perciò, proseguiamo...\nAnalizzando e analizzando, sono giunto alla conclusione che:\n- è meglio mettere pedoni in cascina attaccando quelli centrali con l'alfiere\n- ci sono varie opzioni, c'è il mio cavallo che può attaccare in modo pericoloso, c'è il remoto sogno dell'arrocco che migliorerebbe tantissimo la mia posizione; ma tutte le varianti finiscono con materiale pari. Devo cercare solo di evitare i pedoni doppiati.\n\nPerciò...\n\n11. Axe7\n\n",
        "11... Re8": "Effettivamente era la mossa che mi aspettavo. Penso che a questo punto il sogno di arroccare del bianco sia andato a frantumarsi come la cometa sulla tanguska.\nLa prossima sequenza di mosse, (12. Axd6 DxDd2 13. RxDd2 b6 14. Cd5 Td4 o Cc6 ecc.) giocata in un modo o nell'altro non cambierà il conseguimento di una una posizione di pura parità sulla scacchiera.\nIl bianco si troverà con un pedone in più ma isolato che probabilmente sarà la prossima vittima della mia torre. L'impossibilità di arroccare e pertanto una leggera perdita di tempo per quanto riguarda la messa in sicurezza del proprio Re.\nSe invece vorrà catturare la mia donna con la sua rischierà di trovarsi con i pedoni in \"d\" doppiati.\nInsomma non mi lamento  ",
        "12. Bxd6": " Hai ragione, il mio pedone d è esposto come un fante russo davanti alle mitragliatrici della Wehrmacht (appropriate le metafore astrofisiche e belliche). Difendo l'avamposto o \"dasvidanie\"? E' il mio busillis per le prossime mosse. Conto su alcuni fatti:\n- la possibilità di difendere il pedone d e sviluppare i pezzi contemporaneamente;\n- l'ala di regina del nero ancora non sviluppata;\n- il mio re che, se andrà come tutto fa credere in d2, darà i vantaggi dell'arrocco (torri connesse e libere) con una sola mossa persa;\n- alcune combinazioni futuribili interessanti;\nper conquistare un lieve vantaggio strategico. \"Rodina!\" \n",
        "12... Qxd2+": "Cc6 da parte del nero? E' un possibilità, ma in questo caso darei al Bianco la possibilità di arroccare cosa che, anche se di poco conto, preferisco non dare.\nRipeto, la mossa Cc6 non fa una grinza, e pertanto puoi tranquillamente valorizzare di molto la metafora   Infatti il proseguimento delle mosse (DxD, AxD, 0-0-0, AxC, bXA) produrrebbe due pedoni bianchi in linea a tutto vantaggio per il nero,\nPreferisco però, come dicevo prima, giocare\n\n12. ... DxDd2\n13. RxDd2 b6\n\naggiungo questa mossa che penso, a meno che Stefano non voglia suicidarsi, è costretto a fare. Inserisco anche la mai risposta.\nLa situazione sulla scacchiera è ancora molto equilibrata e le posizioni di tutti i pezzi, a mio vedere sono abbastanza libere di entrare in azione. L'unico fuori posto è il Re bianco, ma questo era il fine che perseguivo.\n\n",
        "13. Kxd2": ".",
        "13... b6": ".\n",
        "14. Bd3": "Klaus, se tu avessi fatto Cc6, io non avrei fatto DxD, ma 0-0-0, aspettando sempre e comunque che la donna la prendessi tu, oppure Ad3, cambiando completamente i giochi.\nUna curiosità: come tua 12ma mossa mi aspettavo f5 e non DxD, ti avrebbe fatto recuperare il pedone (seppur isolato a sua volta… ma passato!), avrebbe sì scoperto il tuo re, ma lo scambio di donne era imminente e dunque il pericolo relativo.\n\nOkay per le mosse da te indicate, naturalmente:\n12. … DxD\n13. RxD b6\n\nSoon molto indeciso tra due mosse, Te1 e Ad3. Le voglio fare entrambe, si tratta solo di decidere quale fare prima. L’altra torre, nei miei piani, andrà a controllare la colonna f.\nDeciso: sviluppo l’alfiere in una casella sì difensiva, ma centrale, copro il re, difendo il pedone e, liberando (a tempo debito) il cavallo, e le due torri possono correre.\n\n14. Ad3 ",
        "14... Nc6": "Beh. Se qualcuno non sbaglia o non fa una svista, tutte le partite finirebbero patte  \nComunque la mia decisione di non recuperare il pedone di svantaggio è che considero il pedone bianco in d al momento inoffensivo ed ho l'impressione, che quanto prima il potenziale sulla scacchiera tornerà in parità.\nSi dice che l'erba del vicino è sempre più verde, ma in quest'occasione, non vedo alcuna differenza nel colore. Il bianco, nella sua struttura dei giochi attuale, secondo il mio modo di giocare è troppo aperto e leggermente soffocato dai propri pezzi che, pur possedendo posizioni abbastanza forti, sono impossibilitati a muovere senza indebolire la formazione.\nIo non sto molto meglio, ma, dopo la mossa di cavallo, la mia formazione risulta consolidata e rende la casa e5 meno forte per il bianco. ",
        "15. Rae1": "Sono d'accordo con Klaus, il cavallo in c6 è molto attivo, può raggiungere posti interessanti, e soprattutto può far fuori, senza che io possa far molto praticamente per impedirlo, il mio alfiere chiaro (analizzare per credere), dunque per evitare guai peggiori sviluppo la mia torre e mi preparo a difendermi. D'altra parte c'è chi dice che il 'bad bishop' (come si dice in italiano?) vale meno di un cavallo nel centropartita... la mossa della torre serve anche per toglierle di dosso il mirino telescopico dell'alfiere nero. E poi sostiene lo spavaldo pedone e.\nHo analizzato anche l'opzione \"pedone b2 al curaro\" (è sempre lui!), ovvero Cb5 o Cd5, ma non porta da nessuna parte.\nChe cosa mi aspetto? Ce5 o Td8, ma Klaus mi ha già sorpreso più volte.\n\n15. Te1 \n",
        "15... Be6": "Nuovamente scelgo una mossa che non hai prospettato  , anche se, sinceramente, considerate le sue possibili conseguenze, è pienamente plausibile.\nContrariamente a Stefano cerco sempre di non aprire troppo il mio gioco ma di controllare quello dell'avversario a distanza.\nEffettivamente potevo muovere anche Ce5 o altre mosse, ma al momento, preferisco costruire una buona difesa nel modo sopraindicato.\nSe osservate bene la ragione di Ae6 e le conseguenze di una sua incursione, dopo una mossa di torre, vi accorgerete che la mossa non è per nulla di poco valore.\nOra vediamo la risposta di Stefano. Af4? \n",
        "16. b3": "Ho studiato a lungo la variante \"folle\", ovvero Cb5, proponendo uno scambio torre per pedone + alfiere, lasciando però a Klaus una posizione finale molto favorevole, con il mio cavallo in castigo e tutti i pezzi neri in centro e pronti all'attacco: chissà come sarebbe finita. Probabilmente molto male per me  \n\nLa mossa che mi prospetta Klaus non mi piace, perché significherebbe abbandonare con l'alfiere una posizione dove controlla caselle utili alle torri e al cavallo neri. L'attacco Ah6+ seguito da Cd4+ si limiterebbe a spostare il mio re in caselle sicure, dove già dovrebbe stare se mi fosse stato permesso l'arrocco   . Preferisco consolidare la difesa con b3, che para la minaccia Thd8 o Ted8 seguita da Axc4 dopo aver spostato il mio alfiere da d6 (era questa l'incursione, Klaus?)\n\n16. b3 \n",
        "16... Bh6+": "Chissà perché, ma considero la tua mossa un (piccolo) errore.\nIl mio consiglio di Af4 era un celato avviso alla mia prossima mossa che, oltre a portare scacco al tuo re, mi fa guadagnare il dominio della diagonale h6-c1. Considerati i pochi pezzi che possono intromettersi, è un chiodino (di garofano) che potrebbe infastidirti  \nDopo la mia prossima mossa di minaccia al tuo Ad6 con Td8, il tuo alfiere dovrà per forza andarsene, ma non potrà più rifugiarsi in g3 perché probabilmente forzerei lo scambio che, a mio parere, volge a mio favore, ma in a3 posto dal quale non è un minaccia per nessuno.\n\nRicapitolando:\n16. ... Ah6+\n17. Rc2 (penso sia la mossa migliore. Non consiglio Rd1  )\n17. ... Ted8\n\n",
        "17. Kc2": ".\n",
        "17... Red8": ".\n",
        "18. e5": "Sono d'accordo sulla prosecuzione:\n\n16. ... Ah6+\n17. Rc2 Ted8\n\nAg3 è fuori questione per via di Cb4+ che guadagna l'alfiere e sbanca. Scartata anche Cb5, che finisce con il mio cavallo intrappolato in e6. Ci sarebbe la variante \"giudiziosa\", Aa3 (l'alfiere tornerebbe utile una volta spostato in b2). Ma io sono uno scacchista scapestrato, e gioco la rischiosa e5. Analizzando, c'è la possibilità di mantenere o meno il pedone di vantaggio, con una posizione leggermente migliore; naturalmente, c'è anche la possibilità di uno sfacelo  \n\nChe cosa mi aspetto? Interessante è Cd4+, seguita da Cf5. Oppure f6, seguita da... una carneficina  \n",
        "18... Rxd6": "Penso che Antonio abbia visto giusto. e5 è stato un grosso errore. Logicamente per parequarmi al tuo modo di gioco, faccio anch'io una mossa che non hai contemplato.\n\n18. ... Txd6, ................mi aspetto il logico\n19. exTd6, ..................ora apriamo le stalle  \n19. ... Cb4+ ................qui mi aspetto anche il più che logico\n20. Rb1 (con Rb2 ci rimetti la torre per il mio cavallo) CxAd3\n\nse non sei d'accordo su queste mosse, scrivimi quelle che preferisci giocare.\nPenso che a questo punto tu debba cercare di scompaginare il mio schieramento eliminando con la tua torre il mio alfiere in e6. Questo pezzo rischia di causarti ancora più danni se me lo lasci spostare in f5. Non trovi?\nCerto è che a questo punto la situazione non è delle più rosee per il bianco. Un finale di torre e cavallo contro torre, cavallo ed alfiere non è delle più auspicabili.\n\n",
        "19. exd6": ".\n",
        "19... Nb4+": ".\n",
        "20. Kb1": ".\n",
        "20... Nxd3": ".\n",
        "21. Rxe6": "Sono d'accordo con Klaus per quanto riguarda le mosse successive e l'analisi. Credo che in questa situazione ci sia una lezione importante per tutti gli scacchisti all'ascolto. Difatti, io nella mia analisi, di cui vi ho messo a parte, non ho nemmeno contemplato la possibilità del sacrificio di torre. Nel mettermi nei panni dell'avversario, ho pensato come un ELO 1750. Io normalmente non faccio mosse così brillanti. Per contemplarla, avrei dovuto pensare come un ELO 2000   Perciò, per crescere, pensate in grande! (e imparate dalle sconfitte   )\n\nDopo:\n18. ... Txd6\n19. exT Cb4+\n20. Rb1 Cxd3\n\nsorprendo Klaus facendo... quello che suggerisce   ovvero:\n\n21. Txf6\n\nPenso di avere concrete speranze di recuperare un pedone, e di far valere la minaccia del mio pedone passato. Ma non è molto. ",
        "21... fxe6": "Logicamente prendo di pedone (fxTe6). Ora mi aspetto che Stefano, che tralasciando l'avventata mossa 18. e5   ha giocato egregiamente, vada ad insidiare il mio cavallo con la sua torre.\n\nTralasciando di pensare al prossimo risultato della partita, vorrei spendere poche parole su questo modo di postare le mosse in bella vista di tutti coloro che, interessati ad una specifica apertura o per capire quali ragionamenti scorrono sulla testa di altri giocatori, si inseriscono nel forum dando ognuno la propria opinione.\n\nHo cercato altre volte di piantare questo germe di interesse, senza un eccessivo successo. Questa volta però ho l'impressione che stiamo andando verso la giusta direzione.\nConsidero Stefano un ottimo partner di scacchiera. Mi piace il suo modo di giocare e il modo di esporre le sue teorie.\n\nRipeto che il risultato non ha alcun valore. L'importante è il modo di esporre il gioco e cercare di attizzare il maggior interesse e consenso possibile.\n\nChiunque può intervenire nel forum della partita dicendo la propria e non deve assolutamente farsi restio a dare la propria opinione o proposta pensando che la stessa possa sembrare debole o priva di interesse; al contrario. E' ben spiegando le illogicità che alla fine si riesce a costruire un ragionamento logico. Pertanto dite la vostra sia ora che nelle prossime partite dove cercheremo di studiare altre aperture o varianti.\n\n",
        "22. Rd1": "Ti ringrazio, Klaus, per l'apprezzamento e per i complimenti. Anch'io penso che non conti il risultato, quando si impara qualcosa, si vince sempre. E penso che tu sia un ottimo istruttore.\n\nVenderò caro l'ermellino, in questa partita, che però ha dato già i suoi utili messaggi. La variante Sämisch, tutta d'attacco e contro la quale occorre un incisivo contrattacco. La necessità di pensare con la testa e con il livello dell'avversario. Tante metafore belliche e astrofisiche  \n\nE' arrivata l'ora dei riservisti... Td1. Mi aspetto Cf2, poi potrei fare Te1 e recuperare il pedone, se tutto va bene. Cf4 sembra buona per il nero ma non lo è, provare per credere.\n\n22. Td1 \n",
        "22... Nf2": "Il mio cavallino, come da Stefano supposto, va in f2.\n\nUn consiglio disinteressato, Te1 da parte del bianco sarebbe un nuovo grave errore.\nInfatti dopo:\n\n22. Td1 Cf2\n23. Te1 Ag2\n24. Tf1 Axc3\n25. Txf2 Td8 ",
        "23. Rf1": ".",
        "23... Bd2": ".",
        "24. Nb5": ".",
        "24... Ne4": ".",
        "25. Kc2": "Penso di parlare a nome di tutti, dicendo che abbiamo pensato che fossi giustamente indaffarato con il nuovo torneo, pertanto non hai nulla di che scusarti   . Anzi, grazie per l'impegno che profondi.\n\nMi ero riproposto di fare Te1? Accidenti. Questo è uno dei nemici dello scacchista, si chiama “calo di motivazione”. In pratica quando si pensa di stare perdendo la partita, la si è già persa, E la qualità delle mosse va di conseguenza. Da non confondere con il “calo di concentrazione” che avviene quando si pensa di aver vinto. In tutt’e due i casi, il disastro è dietro l'angolo.\nHo esaminato la sciagurata 23. Te1 sotto un altro punto di vista, la possibilità di sacrificare il cavallo per un tempo, per poter permettere dopo Txe6 l'avanzata del pedone d, c'è un certo pericolo per il nero ma la semplice contromossa di spostare il re in colonna f rende tutto inutile.\nDunque, Tf1. Klaus a questo punto gioca Ad2. A me non conviene lo scambio di cavalli, perché poche mosse più tardi Klaus si ritrova il pedone in e5 e l'alfiere in d4, che si difendono l’un l'altro, in una configurazione che amo (quando riesco a farla) ma odio affrontare, e per giunta in Piazza Duomo. No no, 24. Cb5 Ce4, come giustamente suggerito da Klaus.\nA questo punto, sono indeciso tra due mosse. Cc7 porta ad uno scambio di pedoni, poi il mio cavallo deve tornare indietro sui suoi zoccoli perché da e6 non c'è dove andare. Più interessante mi sembra Rc2, che porta il re in mezzo all'arena, dove dovrebbe stare nel finale. Inoltre si potrebbe creare una situazione interessante e caotica dopo Td1. Siccome sono sotto di materiale, il caos dovrebbe essere mio amico. Mi aspetto Td8 con il nero che propone lo scambio di pedoni.\n\n23. Tf1 Ad2\n24. Cb5 Ce4\n25. Rc2 ",
        "25... Rd8": "Ora è il momento di ragionarci su e proporre un bello scambio di pedoni. Regalo il pedone a7 per eliminare quello in d6. Penso che Stefano forse accetterà. Altra possibilità è Td1. Ma dopo a6 il pedone d6 sarebbe egualmente cancellato dalla scacchiera.\nSiamo ad un momento del gioco che generalmente gioca a vantaggio di chi è in vantaggio. Infatti il bianco, privo di un pezzo, si trova a dover difendere la propria formazione delegando ai propri pezzi troppi compiti. In un finale un alfiere in grado di scorrazzare libero diventa una mina vagante.\nIo personalmente opterei per lo scambio di pedoni. Un piccola speranza di far avanzare i propri pedoni sul lato di donna, tre contro uno, potrebbe riaccendere le tenui speranze del bianco.\nComunque vediamo cosa decide (l'imprevedibile ) Stefano.\n\n",
        "26. Nxa7": "Sì, Klaus ha ragione, Td1 non mi conviene perché, pur garantendo lo scambio di pedoni dopo:\n\n26. Td1 a6\n27. Cc7 Txd6\n28. Cxa6\n\nNon mi consente una mossa brillante (almeno mi pare così, spero che la mia non sia la solita fanfaronata   ), ovvero:\n\n26. Cxa7 Txd6\n27. Cc8!\n\n, E la torre non può difendere il pedone b6 con Tc6 per via di Ce7+ . A questo punto potrei avere tre pedoni passati e legati (wow) con la mia torre dietro: un'ottima prospettiva.\n\nL'alternativa per il nero è:\n\n26. … Cxd6\n27. Cc6\n(il mio re non può prendere subito l'alfiere per via di Cb5+ che guadagna il cavallo)\n27. … Ta8\n28. Rxd2 Txa2+\n29. Re muove Txg2\n\nCon guadagno di un tempo in cambio del pedone, per difendere il pedone h. Direi molto migliore per il Nero, anche se cala il sipario sulle scorribande del suo alfiere.\n\nComunque vediamo cosa succede:\n\n26. Cxa7 ",
        "26... Rxd6": "Mi piacciono le divagazioni di Stefano. Certe rispecchiano un certo ottimismo  .\nIo purtroppo sono molto più essenziale. Generalmente non mi discosto molto dalla linea o combinazione che mi sono prefissata. Pertanto, come programmato in precedenza, togliamo dalla scacchiera il pedone bianco che, in quella posizione, anche se solo soletto, mi infastidiva... la visuale  \nSono curioso di vedere quale delle molteplici continuazioni contemplate, verrà giocata. Un consiglio lo posso dare comunque a cuor leggero. Dimentica 27. Cc8!\n",
        "27. Nc8": "Orpo! Questa è veramente una sorpresa 🤔 Mi sono scervellato per un'ora per scoprire la variante assassina con cui Klaus mi distruggerà dopo 27. Cc8. Niente da fare, non l'ho trovata. O sono un pollo nell'analizzare le posizioni (possibile, coccodè!) o la variante è brillantissima. In questo secondo caso, anche a costo di perdere, la voglio vedere! Inoltre, non avendo trovato nessun pericolo pratico nella posizione, onestà intellettuale e curiosità chiedono a gran voce che io prosegua sulla mia linea, coerentemente coi miei ragionamenti; non sarebbe bello cambiare mossa per un ragionamento che non è mio. Se sarà la fine, spero che sia spettacolare come l'incendio dello Hindenburg.\nE poi... ho già pronta una nuova proposta per una seconda partita di studio 😄\nHasta siempre Comandante!\n\n27. Cc8 ",
        "27... Rd8": "Non c'è alcuna variante assassina, solo che, contrariamente a quanto fatto fino ad ora, mi piace scoprire live il tuo metodo di ragionamento sulle prossime mosse.\nFino a Td8, che minaccia il tuo cavallo, il gioco non cambia molto. Interessante è ora vedere se preferisci la qualità o la quantità. Non voglio influenzarti con i miei punti di vista. Forse li riprenderò dopo la tua prossima mossa che voglio scoprire.\nDopo che l'avrai fatta continueremo a discutere  \n",
        "28. Ne7+": "Ora l’ho vista, la mossa per cui Klaus mi aveva sconsigliato 27. Cc8. Dopo Td8:\n\n28. Cxb6 Aa5\n29. Ca3 Td2+\n\nriguadagna il pedone e:\n\n30. Rb2 Txg2\n31. h4 Th2\n32. Tf4 Cd2+\n\nsalva in extremis l’altro pedone ma mettendo il bianco in una brutta situazione. I pedoni passati ci sono ma la torre nera è dietro, e questo non va bene.\n\nSviluppiamo l'alternativa proposta da Salvatore:\n\n28. Ce7+ Rg7\n29. Cc6 Td6\n30. Ce5 Ac3\n31. Cd3 para la minaccia Td2+\n\nIn alternativa:\n\n31. Tf7+ Rg8\n32. Td7 obbliga il nero allo scambio di torri.\n\n, perché:\n\n32. … Td2+\n33. Txd2 Axd2\n34. Rd3 guadagna il cavallo o l'alfiere\n\nPerciò:\n\n32. … Txd7\n33. Cxd7 Aa5\n34. Rd3\n\ne il mio re fa quello che a me piace tanto nel finale: si butta in centro a corona bassa   inoltre il mio cavallo è In settima, e non è poco. Penso di avere qualche speranza.\n\nMa le variabili sono tante, perciò una mossa per volta:\n\n28. Ce7+\n\nUna nota teorica: penso che anche conoscendo le conseguenze di Cxb6, avrei fatto ugualmente Cc8; penso che sia utile mettere sempre sotto pressione l'avversario, perlomeno quando non è un mostro sacro come Klaus  \n\n",
        "28... Kg7": "Effettivamente hai fatto la mossa che speravo, almeno nel tuo interesse, facessi. Ora, anche se chiaramente in vantaggio, l'incontro può continuare più bilanciato. Catturare il pedone b6 sarebbe stata l'inizio della fine  \n\nLe prossime mosse sono come telefonate: Cc6 ( che minaccia la mia torre) Td6 che minaccia a sua volta il cavallo) e Ce5, seguito da Ac3 (che fa correre ulteriormente questo povero cavallino).\n\nLa partita a questo punto si sta preparando per un finale chiaramente in vantaggio per il nero, ma nella quale il bianco può continuare a difendersi almeno fino a quando le armate non cominceranno a diradarsi. Allora quel punto chi sarà in vantaggio di materiale probabilmente avrà la meglio. Da non sottovalutare però la spinta sul lato di Re del biaco con 3 pedoni contro uno... ",
        "29. Nc6": ".\n",
        "29... Rd6": ".\n",
        "30. Ne5": "Sono d'accordo sullo sviluppo delle prossime mosse:\n\n28. Cc6 Td6\n29. Ce5 Ac3\n\nPassiamo perciò alla mossa 30. Lasciando da parte per il momento le scacchiere iperboliche di Antonio 😄 la scelta ricade su due mosse: Cd3 e Cf3. Entrambe impediscono Td2+, ma la seconda ostacola la colonna libera f per la torre. Inoltre, la prima mette il cavallo nei pressi del re e del famoso trio di pedoni. Dunque:\n\n30. Cd3\n\nChe cosa mi aspetto... sinceramente non so. È una fase di bonaccia. Forse Td4, per dare supporto al cavallo? Forse spinta dei pedoni g e h? \n",
        "30... Bc3": ".\n",
        "31. Nd3": ".\n",
        "31... Bd4": "La fase di bonaccia continua.\nOra è il momento di costruire lo schieramento per un finale nel quale, il mio alfiere in più in più deve diventare basilare per la vittoria.\nMi aspetto ora a3. Stefano dever cominciare a far valere la superiorità numerica (relativa) dei pedoni sul lato di donna (non su quello di Re come avevo erroneamente scritto). \n",
        "32. a3": "Sì, in effetti a3 è l'unica mossa che segua un piano. Ho valutato la possibilità di rompere le scatole al cavallo nero con la torre, ma temo che servirebbe solo a portarlo in c3 o c5, dove probabilmente intende andare, e a distrarre la mia torre dal compito di tenere il re nero fuori dai giochi.\nChe cosa mi aspetto? Cc3 o Cc5 per ora non servono, e si possono fare dopo. e5? O una spinta dei pedoni g e h? Tanto per alzare il Fön su questa calma piatta. ",
        "32... Nf6": "Poichè penso che Stefano, oltre alla spinta dei pedoni nelle fasce esterne, abbia la possibilità di un piccolo raid di disturbo con la sua torre, dopo lo spostamento del cavallo (azione improbabile ma sempre possibile) in e5, blocco subito le velleità interponendo il mio cavallo sulla verticale f.\nAl momento c'è solo l'attesa che il bianco apra qualche breccia per far valere la mia superiorità materiale sulla scacchiera, cosa che, nolente o dolente, dovrà fare  \nMi aspetto h3 o b4. Le armate stanno per scontrarsi? ",
        "33. b4": "Poichè penso che Stefano, oltre alla spinta dei pedoni nelle fasce esterne, abbia la possibilità di un piccolo raid di disturbo con la sua torre, dopo lo spostamento del cavallo (azione improbabile ma sempre possibile) in e5, blocco subito le velleità interponendo il mio cavallo sulla verticale f.\nAl momento c'è solo l'attesa che il bianco apra qualche breccia per far valere la mia superiorità materiale sulla scacchiera, cosa che, nolente o dolente, dovrà fare  \nMi aspetto h3 o b4. Le armate stanno per scontrarsi? \n",
        "33... e5": "Mi aspettavo h3. Comunque la musica non cambia di molto. Ora Stefano inizierà l'attacco sul lato di donna con i pedoni. Sono pronto  \nA cosa miro? Spostare il Re nel lato di donna e impedire la mobilità dei pezzi bianchi. Almeno spero  \n\n",
        "34. Kb3": "Prima di iniziare l'attacco coi pedoni, sposto il re dalla colonna c, per evitare il 'pin' (come si dice in italiano?):\n\n34. c5 bxc5\n35. bxc5 Tc6\n\nChe cosa mi aspetto? Rf7, oppure Tc6 che mi farebbe cambiare completamente i piani. ",
        "34... Kf7": "Continua lo spostamento, lento ma sicuro, del mio Re.\nSevo spostare il mio Monarca sul lato dove Srefano è un po' più forte per dare manforte alla mia armata. Seguo lo schema paventato anche da Stefano... fino a quando non lo so  ",
        "35. c5": "Miro ad avere due pedoni passati e affiancati, via la probabile combinazione:\n35. ... bxc\n36. Cxc5\nNon credo che Klaus sacrifichi l'alfiere per staccare i due pedoni. Piuttosto credo che punterà sul pedone passato e.\n\t",
        "35... bxc5": "Ora aspetto\n\n36. Cxc5, AxCc5\n37. bxc5 Td3+\n\nHo studiato la serie di mosse prossime. La mia torre è intenzionata a eliminare i pedoni in g e h, mentre il mio pedone in e diventare una minaccia incombente.\nSe ti va bene fino alla mia mossa 37, puoi continuare proponendo la 38. Hai visto giusto. Anche perché i due pedoni in a e b non mi incutono quel gran timore  ",
        "36. Nxc5": ".",
        "36... Bxc5": ".",
        "37. bxc5": ".",
        "37... Rd3+": ".",
        "38. Kb4": "da diekonige:  ...se a un certo punto ci farete gustare l'avvicinarsi del matchpoint no comment? Cioè intendo, è previsto così? In generale trovo questa attività che state svolgendo interessantissima. \n\nNon temere, Salvatore, il momento del match point è vicino, ormai i miei piani, se se ne può parlare in tal senso, contemplano la \"carica contro le mitragliatrici\" o poco più. E sappi che io e Klaus abbiamo già in mente altre battaglie, pardon partite di studio per voi 😉\n\nConfermo le mosse da te pronosticate, Klaus, fino alla 37, poi muovo 38. Rb4, per tenere il mio re vicino ai pedoni e impedire alla torre avversaria di mettersi alle loro spalle. La mia sola speranza è che Klaus sia sufficientemente distratto dai suoi piani, da consentirmi, dopo Tc1, di lanciare il pedone c verso le trincee nemiche. Mi aspetto Re7. ",
        "38... Ke6": "Diciamo che la situazione di Stefano non è così rosea. Rb4 secondo me, studiando le prossime mosse (da 10 a 15), è una mossa debole. Ok non compromette quello che lo è già, ma forse intravvedo una perdita inutile di tempo che mi aiuta a incentivare la mia formazione d'attacco. Rb2 o Ra2, sempre secondo me, era migliore.\nSposto il mio Re in posizioni ottimali. Non dimentichiamo che, una volta uscite di scena le Donne (come spesso nella vita  ) i Re diventano i pezzi più forti. \nOra mi aspetto Te1 per bloccare il mio pedone sfascia trincee. Ma una torre obbligata a controllare un unico pedone non cade in depressione?  \n---------------------------------------------------------------------------------------\nCommento di Stefano: Ciao a tutti. Mi fa piacere avere la riprova che eravate in tanti a seguirci, e che abbiate apprezzato i nostri commenti mossa per mossa. Sono d'accordo con voi sul fatto che questa partita ha ormai detto tutto, sia come risultato che come didattica. Perciò, se anche Klaus è d'accordo, la possiamo interrompere qui. È stato un onore per me!\nE visto che ci state prendendo gusto, ho una nuova proposta. Una partita basata sulla 'modern defence' o 'Robatsch defence', in cui la prima mossa è 1. e4 g6, e Klaus stavolta tiene il bianco. Penso che sia interessante e divertente. Ma vorrei sentire cosa ne pensate su questo thread prima di aprire il nuovo. "
    },
    "url": "https://gameknot.com/annotation.pl/apertura-est-indiana-s-misch?gm=63411",
    "gameName": "Apertura Est-Indiana Sämisch",
    "players": "Ircmancer (Stefano)  vs. Skorpio47 (Klaus) ",
    "opening": "King's Indian (E81), Saemisch, 5...O-O"
}