{
    "moves": {
        "1. e4 c5": "Not to my surprise, he plays the Siclian.",
        "2. Nf3 d6 3. d4 Nf6": "I anticipated 3...cxd4, and then I would've continued the open variation.  4.Nxd4, Nf6 5.Nc3, a6  ",
        "4. Nc3": "Now, I could've played 4.dxc5, with the idea being that after 4...dxc5 5.Qxd1+, Kxd1, so black would lose his right to castle.  But, I realize that after 4...dxc5, he can quick play 5.Nxe4, and I would not like my position.  The reason is that grabbing the center pawn means better control of the center, which is something that you don't want to do.  That's because of the fact that center control is important, so without risking my center, I was going to protect e4, one way or another.  Of course, we are going to transpose into the same line, as what you'd see with 4.dxc5, when he does take.",
        "4... cxd4 5. Nxd4 a6 6. Bg5": "Since I'm very used to this, and the fact that white is threatening to mess up black's pawn structures, I decide to play this.  The idea being is that, espeically in this position, doubled pawns is something that you don't want.",
        "6... Bd7": "?! Black fails to meet that threat.  Best was 6...e5, not only allowing black to retake with the Q, should I take, but preventing me from playing ...Bxf6, as the N's attacked.  Plus, it allows black to catch up on his center control.  The idea being is that I must defend my N and lose tempo, while he gains tempo gain.  But, with this inaccuracy, I will take advantage of my opportunity to exchange and mess up his pawn structure.  Not only that, but I gain needed tempo, in the process, to complete development and castle, at once.  ",
        "7. Bxf6 exf6 8. Bd3 Be7": "Although this develops, he is left with a bad B, which was part of my plan behind exchanging on f6.",
        "9. O-O d5": "? With the idea being to give him a better place for his DSB, so that it's no longer a bad bishop.  The only problem is that this move loses a pawn.  Better was 9...Nc6, developing another piece, or castling at once with 9...0-0.",
        "10. Nxd5 Bc5": "His plan is to gain time to bring out another piece, and/or castle.",
        "11. Nb3": "So, given that I'm up a pawn, it's not overgeneralizing, so now is the time to do the kind of thing that you'd see a GM.  Since he attacked my N with his DSB, so now, I reattack black's DSB.  Yes, that's what you see, and I have also seen examples in some of charleshiggies annotations that one someone attacks one of his pieces, he reattacks.  But, there was a short term plan as well.  In addition, this hinders further development from black, since now, Ron, must protect it.",
        "11... b6": "I would've retreated the DSB, if I were black.  The idea being is that I can't take.  What to keep in mind is that I'm up so given that, liquidating pieces is to my benefit, so with it, I will take on c5.  Had he retreated, however, this would, as we know, not have been possible. ",
        "12. Nxc5 bxc5 13. Re1": "As I learned from tactical-abyss in a previous snapshot analysis thread, one of controlling the center is to attack it.  So, by placing the R on the center square, that is attacking the opponents center.",
        "13... O-O": "! A good choice, as K safety is important.  In fact, I studied a very instructive annotation by alex_ratchkov, involving a GM game.  And, although his opponent had an advantage, due to being up a pawn, the reason why Paul Morphy won was because his opponent failed to castle.  Instead, he got greedy and tried to win another pawn, by taking on c6, which sealed his fate.",
        "14. e5": "Bearing in mind that he can't win that pawn, so I continue advancing.  The plan here is to get a passed pawn.",
        "14... Re8": "But, once he played  this, I knew that it would not be possible to do it.",
        "15. exf6": "So, I take it knowing that I'm still ahead, and now, in order to prevent the loss of another of a pawn, black would have to ruin pawn structures around, bearing in mind that due to my N, he can't take with the Q.  Ruining the pawn structures means that his K will, eventually, become exposed.  That's not absolute but this is the plan, if he finds the right move.  It's of no cheapo tactic, but there's a small amount of Hope Chess, but only because of what I learned from Damios that, in chess, you want to come up with a threat that is difficult to drive off.  And, opening up those pawn structures is, indeed, a threat.  So, with that, my plan was 15...gxf6 16.Rxe8+, Bxe8 17.Qf3, or 17.Be4 to allow 18.Nxf6 with a combo because if 18...Qxf6, then I capture on a6, winning a R for a N.  ",
        "15... g6": "Not exactly sure why he played this.  My guess was to open up.  But, best was 15...gxf6, and if I am able to play Qf3, through the variations that I mentioned earlier, he could protect his R with Bc6 and gain tempo.  But, this move, however, loses another pawn.  Plus, I will continue liquidating pieces.",
        "16. Rxe8+ Bxe8 17. Be4": "As noted earlier, I had a tough time deciding between this and 17.Qf3  The reason I played is because I felt that 17.Qf3 was a little unsound.  Sure, if he took my N, I could take back.  And, it is good to exchange, but this was, in my opinion, a little of an exception.  That's because my N is the one that I don't want him to take, as I feel that I can pose more threats with it.  Therefore, the only other option would be the loss of tempo by exchanging.  But, with the B there, it is another story, for if I took back, the threats would be more immeidate and harder to drive off, I felt.  But, the plan is not to exchange here, however, but rather, to put pressure against his longest diagonol due to how many squares my B now covers, which is about which is about 9 squares.  And, I also keep in mind that black still hasn't completed his development, so I know that I have threats, based on other games I've studied and one I've coached where the other player loses by not completing his or her development.  And, that is starting to happen here as the position is starting to become similar.",
        "17... Nc6": "?? Developing another piece, but it is too little, too late because of what I'm about to do.  Best was 17...Kf8 to prevent what I'm about to do, which is not only liquidate pieces, but at the same time, win his R for my N and pawn, in addition to what I've won.",
        "18. Ne7+ Nxe7 19. Bxa8": "I had a hard time deciding between 19.fxe7 or 19.Qxe7.  I likely would've played 19.fxe7 because, after the exchange, he can pick win back another pawn after 19...Qxe7, which would give a small amount of compensation.  But, just when I almost, I found this move which is better for the obvious reason, so as the saying goes, \"when you think you've found a good move, look for something better.\"",
        "19... Qxa8": "19...Qxd1, doesn't help as I recapture.  With this move, I will grab his other N.  And, with it, I will now have a passed pawn which will prove to be a killer.",
        "20. fxe7 Qb7": "To prevent my pawn from advancing further.",
        "21. Qd8": "But, it's too late, unfortunately.  Bear in mind that I'm just now starting to think about the game with charleshiggie.  The idea that black must lose his LSB to prevent me from promoting which is something that I kept in, after I grabbed his N.  Plus, I know how charles and Janet both promoted, as it started with a capture, similar to this.",
        "21... Qxb2": "The logic is that black might as well take.  I hate to say it, but there's no good moves left, so capturing gives him a pawn back, temporarly.",
        "22. Qxe8+": "I was going to play this, one or another, but I quickly figured out that even giving up his B, I can still promote with this check.  The thing is that I thought it would take much longer, but this more and more where that instructive game settles right since there are going to be three.  Now, given that I'm ahead and will have the Q, it will very difficult to impossible for black to compensate.  The reason I don't say absolutely impossible, is that sometimes there is counterplay, and against all odds, you can get a stalemate.  But, I do calculate ahead to how he might do so if I make mistakes, and prevent that, at all costs since it's about capitalizing on your advantages.",
        "22... Kg7 23. Qf8+": "Knowing that his last move was directly forced, I dump in another check with my pawn.",
        "23... Kf6 24. Re1": "To be honest, I would've promoted at once here.  But, in this case, I knew that doing so wouldn't just allow him to get back a R, but it would be mate.  In other words, if 24...e8=Q??, 25.Qa1#  The reason I say it is that I wasn't far from missing this threat, which would be bad as I throw away a win.  However, I remembered this same mistake in another game, and by promoting, with an advantage, like this, he was able to force the win, due to a mate in one that I overlooked.  So, knowing the mistake I made there, prevented me from making it here.  The idea is, as a mentor and other have told me, you're supposed to learn from your mistakes so that it doesn't reoccur.  Yes, that's how you become a better chess player.",
        "24... Qb4": "Still wants to create a threat.  Now, is the time to be unsound and attempt a cheapo tactic since it's lost.  So, the idea was to mate me.  It is a very good attempt, but I will promote, one way or another.",
        "25. e8=Q": "I had a very tough time deciding between this and 25.Qxf7, and after 25...Kxf7 26.e8=Q+  I did have in mind that after 26.e8=Q+, 26...Kf6 (forced) 27.Qe6+ which I thought was mate but had another look to realize that he could escape with something like 27...Kg5  I also forgot, temporarly, that my R is behind the passed pawn, where it's supposed to be.  So, why not promote.  Last but not least, however, this is where that game between charleshiggie and brigadecommander really settled in.  I remembered that promotion, and realized that, unlike that game, Ron would not be able to compensate or promote.  Therefore, we weren't going to have 4 Q's.  Plus, unlike there, where one Q on each side was taken very quickly, he could not recapture, at all.  So, being that I have more material and now have an extra Q, it is a forced win, which I decide to take advantage of.",
        "25... Qc4": "?? I don't know why he played this, but with this move, I will mate him immediately.  One way or another, it's mate, but better was 25...Kf5, but either way, it's still mate in 3  26.Qe5+, Kg4 (forced) 27.h3+, Kh4 (forced) 28.Qh6#",
        "26. Qe5#": "Overall, this was a fun and enjoyable.  But, black went wrong by failing to complete development because I was able to swarm in, take advantage, and deliver a devastating attack with his undeveloped pieces, especially since it allowed me to get an unstoppable passed pawn.  So, what applies especially applies here is something that I mentioned in the annotation involving the last person that I coached which other coaches, as well as, GM's emphasize.  \"Openings must be used with the greatest care.  What you do in the opening will affect you in the midgame; what you do in the midgame will affect you in the endgame; what you do in the endgame will affect the final results\"  In addition, as noted in the intro, it's not always about quantity, but rather, quality.  Therefore, it's not about learning, as much as, you can; but rather retaining and what you've learned and using them for your games.  For that, I would, as usual, like to thank charleshiggie for his instructive annotations and being a good teacher, as well as, Ron for this good game, at Chicoboy's Legacy Club. "
    },
    "url": "https://gameknot.com/annotation.pl/applying-what-youve-learned?gm=59717",
    "gameName": "Applying what you've Learned",
    "players": "jkarp (1282) vs. redfox17 (1431)",
    "opening": "Sicilian, Chekhover variation (B53)"
}