{
    "moves": {
        "1. e4": "Like me, this is also Ted's favorite.",
        "1... c5": "So, I answer with my usual.",
        "2. Nf3 d6 3. Bc4": "Even after 2...d6, this is often what he plays.  So, I figure out what to do.  I'm too experienced for this, so he'd never do it.  But, just to be a little comfortable and try something different, I'm pretending that he's attempting the SM.  It absolutely isn't so, but if I don't think of something, this could lead to mistake, similar to what happened when I did not play well and lost against one of my students.",
        "3... e6": "With that being said, I decide to cut his diagonal.",
        "4. d4": "What I anticipated since ...d4 is followed right after.",
        "4... d5": "Therefore, instead of taking, which is what you most often, I deviate from the mainlines by hitting his Bishop.  But, it's not one move attack for the thrills of it.  Instead, although it's a different piece, I'm still thinking about what GM Susan Polgar said about the French.  I think it works here since you often exchange.",
        "5. Bb5+": "But, instead of taking, Ted decides to deliver a check.",
        "5... Nd7": "Although I don't like cramping my position, as noted in another annotation, I'm basing this move on what archduke_piccolo has previously told me.  He said that in the Siclian, when white plays Bb5+, the best move is ...Nd7.",
        "6. Nc3": "Meanwhile, he continues with his development.",
        "6... b6": "Getting a pawn chain.  But, better, however, was 6...a6 to gain tempo.  The reason I didn't play this was because cplusplus11 gave me advice not to do those one move attacks just because you can.  In this case, I think it would've worked because white must struggle to save a piece.  Even if 6...a6, 7.Be2, dxe4 8.Nxe4, black has 8...f5 and now white's Ne4 is attacked in many ways.  There are only two ways to save the N, but both options result in further loss of tempo.",
        "7. Ne5": "Trying to take advantage of his pin.  But, it won't work because if he takes and I take back, it's an even exchange.  In other words, I won't lose anything and am, therefore, not going to be taken off guard.",
        "7... Ngf6": "With that being said, I continue with my development.",
        "8. Bg5": "And, he pins my other N.  Now, we're starting to run into some problems because both pieces are tied down which often causes trouble.",
        "8... Be7": "So, I answer, this time, by breaking the pawn with further development.",
        "9. Nc6": "I'm not surprised to see Ted hitting my Queen which does, one way or another, force my next move.",
        "9... Qc7 10. e5": "And, in doing so, Ted takes advantage of that.  At first, I thought that this won a piece.  Although it's very rare, once in a while, I forget important facts.  One of them being that my pin was broken.  So, I defend.  Obviously, I don't like the best move since it prevents me from castling.  But, there's no choice as anything loses a piece.  And, it's important to note that I directly kept in mind what bhidragon told me about seeing the overall picture.  That's because, if I were hyperfocused on castling, I'd move elsewhere and lose the N, in return.  So, I go by what the story that the board is revealing, being black's Nf6 is attacked in many directions, which only leaves one option to defend with which means not castling.",
        "10... Ng8": "That's because Ted will exchange like crazy.  And, the only way to prevent the loss of material is to take back with my monarch.  Afterwhich, he will castle, however.",
        "11. Nxe7 Nxe7 12. Bxe7 Kxe7 13. O-O Rd8": "So, I'm trying to compensate by doing the equivalent of castling which is bring the Rook on the other side, and then, move the King back, as taught by Jack Stockel.",
        "14. dxc5": "Before I get the chance, Ted takes which forces me to recapture in order to avoid the loss of a pawn.",
        "14... Nxc5 15. b4": "Then, he attacks my N.",
        "15... a6": "So, I reattack.",
        "16. Be2": "Not to my surprise, Ted retreats, probably realizing that this is an open position, given that it involved the KPO which makes the Bishop worth more.  That's why, when he went after my N, I was going to go after his Bishop.  So, after retreating, I come up with a plan of exchanging material.  It's really early, but I'm already starting to think about and calculate the endgame.  It's as though, I was visualizing it because, while not exact, the end turns to have an important similarity to what I'm thinking here.  And, that thought is based on a passed end game with the same opponent.",
        "16... Qxe5 17. bxc5 Qxc3 18. cxb6 Rb8": "So, I go after his pawn.",
        "19. Qd3": "And, he wants to exchange Queens.  Well, I accept, because in doing so, I get a pawn.  That's what's really going through my mind, but, believe it or not (way in the back of my mind), although the same technique isn't there, I'm just starting to calculate the B+M mate idea.  The main reason, however, is the win of material.",
        "19... Qxd3 20. Bxd3 Rxb6 21. Rab1": "I'm not sure why, but Ted wants to exchange Rooks.  I accept do to being ahead.  However, this whole attitude came before TA's lesson on Queen exchanges.  Exchanging because you can should not be done, although, at the time, I thought that it was generally a good idea to do so as it changes the dynamic's of the game, as I once learned.  However, he outlined that against players who are not as strong, it becomes beneficial since stronger players have things in mind which applicable here.",
        "21... Rxb1 22. Rxb1 f5": "Breaking through.  Although we're not there yet, my plan is to get a passed pawn.  So,  what needs to be done, though is a pawn advances, then the e pawn advances two squares.  Therefore, it's an f5-e4, that follows up with ...d3, and you keep using that chain until pawns can be exchanged.  That's because exchanging like that, often leaves you with a passed pawn since no pawns can be in front of, or to the side of, the opposing pawn.  That is the idea, though.",
        "23. Rb8": "Ted thinks that he has pinned my Bishop.  But, what he doesn't know is that if I move by Bishop, and he takes, I'd recapture since I'm not going to move my Rd8 for a while.",
        "23... Kd7": "But, I have a better idea, since we're starting to approach the endgame.  So, I bring my monarch into action to defend the Bishop since we're at the phase where the K becomes a weapon.",
        "24. Ra8": "Going after my a6.",
        "24... Bb7": "?! So, I counterattack.  However, this is a perfect example of where the one move attacks don't work since he is going to pin my monarch, afterwhich, I wind up in trouble.",
        "25. Ra7": "Stopping the attack and, as noted, pinning my B.",
        "25... Kc7": "? So, the plan is to break the pin since the idea was 26...Kb8.  But, with this move, he is going to get back a pawn.",
        "26. Bxa6 Kb6": "So, I attack in a different way since this appears to win a piece.  This is a case where I was just starting to get overly confident.  As noted, in reality, they don't tell who's winning or losing.  Instead, you must figure it out for yourself.  The problem was that, in a game or two against Jack Stockel, I assumed to be winning and thought that one move did it, when in reality, that's what lost.  The difference is that I know Ted, but it doesn't make right, especially here since he will win a pawn.  Now, I calculated the capture but overlooked that I'm in check when he takes.  And, now that we're near or even in the endgame, this mistake should be costly.  In fact, it could lose since all it takes an extra pawn, at this point.",
        "27. Rxb7+ Kxa6 28. Rxg7 h5": "Given that I'm now a pawn ahead, this is where I start thinking way ahead.  And, that is by thinking about how the Bishop and Knight work together to deliver that mate, and math is, very much included, as well.  I ask myself if it can be applied here and do Homework based on what had to be done to pass the course.  There are a couple of ways to do things.  This this requires a lot of thinking and what also comes to mind is what was needed to pass College Algebra with Trigonometry.  So, I start by thinking about what needs to be done to put pressure on white's position.  It starts by advancing the pawn, and the short term plan does work.  That's because (although it's generally not said), I tricked him into playing 29.h3  It's part of Psychology because I wanted to make him worry that the h5 would become overpowering, so that, when he stops it, my monarch is brought right into action.  That's because one thing you need with the N and B is, obviously, the monarch.  And, as noted before, I'm applying the same concept.",
        "29. h4 Kb5 30. Rh7": "Trying to win a pawn.",
        "30... Rc8": "So, I have a plan which is that, if he takes, I'll take back.  However, he places me in check.",
        "31. Rb7+ Kc4": "So, now I feel more comfortable about my position, believe it or not.  I'm not going for opposition since it can't be talked with his pawns obstructing the monarch.  Therefore, my aim is to centralize the K.  Yes, during any phase of the game, but especially, at a disadvantage, you want to bring the King towards the center.   And, another reason for playing is that, it will give me a passed pawn since I'm coming up with ways to get his c2.  I'm not implying that it is a passer, but it's going to happen, sooner then later. ",
        "32. Re7": "Trying to get another pawn.",
        "32... Rc6": "So, I protect, this time.",
        "33. Rh7": "Ted still wants to grab a pawn.  With no way of defending, I come up with another plan to avoid losing another pawn, as then, it would, pretty much, be lost.  So, even though I'm thinking of the Bishop and Knight, other factors needed to be considered here to like defending.  In other words, I'm not ignoring the only ways to save the position, either since it's also based on, as noted, the story that the board is revealing (the overall picture.)",
        "33... Kc3": "So, the idea is, like before, that if he takes, I'll recapture.  This time, however, it happens.  And, in the process, unlike before, I will have a passed pawn.  In addition, that will be where those concepts apply since the passer will work with the Rook to Queen.",
        "34. Rxh5 Kxc2 35. f4": "Stopping my f5 pawn.  It's a good choice because, I was eventually going to advance after moving the f pawn.  That's because you use that pawn chains for the passed pawns.  In other words, that's where they work.",
        "35... Kb2": "Therefore, I go after his passed pawn. ",
        "36. a4": "Which he protects for now.",
        "36... d4": "So, bearing in mind that I now have a passed",
        "37. Kf1": "Which he tries to stop.",
        "37... Ra6": "But, it's too little, too late.",
        "38. Rh6": "And, after this move, I will, gladly, exchange pawns with Ted since it appears that I've got it worked to the system.  ",
        "38... Rxa4 39. Rxe6 d3": "As the saying goes, \"Passed pawns must be pushed.\"",
        "40. Re1": "Trying to stop it.  If I didn't know how to handle this, he would get a draw.  Why do I say that now?  It's because of the second most difficult Homework assignment I've done.  This is the one where I don't remember the exact position.  But, ...Re1 was the solution.  It had to do with promoting the pawn, and after which, white would force the stalemate.  Sadly, that GM missed it.  With that assignment, however, means that I know something and what Ted's thinking.  It's allow the promotion.  A variation like 40...e2, 41.Ke2, dxe1=Q 42.Kxe1, after which, he would likely get the stalemate which would be the same way that ...Re1 forces the draw.",
        "40... Rxf4+": "But, since I'm too familiar with that technique, I prevent that from happening by capturing and placing him in check.  This way, the monarch must move away from his Re1, and after he gets out, I'll take another pawn.  That will leave him without counterplay.",
        "41. Kg1 Rxh4 42. Rd1": "Wanting to stop the promotion.",
        "42... Rd4": "But, remembering what Jack Stockel, Susan Polgar, and archduke_piccolo told me, I also put a stop to that by bringing my Rook behind the passed pawn (which is where it belongs.)",
        "43. Rd2+": "Placing me in check.  But, I know the strategy, that is based on how I failed the course for the last several.  I think that Ted's hoping I'll answer with 43...Kb1, or 43...Ka1, and then he'd answer with 44.Rd1, and after playing the same move, he'd respond again 44.Rd2+  This way, the position would repeat itself, until we have a draw by repetition.",
        "43... Kc1": "Well, knowing where I went wrong there, I also stop this.  Now, another option was 43...Kb3 (which I considered.)  But, I wanted to add the overwhelming amount pressure against him because with this tempo gain, the pawn is going to promote at once, with now way to stop it.  That's because his Rook must go away from my d3 which is what I'm going to promote.  In another words, a promotion is unstoppable, at this point.",
        "44. Rf2 d2": "One reason being (which I calculated and kept in mind) is that stopping the passed pawn means losing the Rook which he doesn't want.  So, I gave Ted another pawn which he captures.  And, when he takes, I'll promote.",
        "45. Rxf5 d1=Q+": "Now unlike with N+B (which requires 3) there was only two steps here.  Generally speaking like the other lesson it's about forming a triangle, after which the last step is the hardest.  But, in this case, while the first and last are the same, the opposite is true (as the last is the easiest.)  Getting to this point was so hard that, it was, as though, I had gotten into an argument.  I say that because, similar to a feaud, I had just as bad of a headache after this game.  It's unusual with just one game, unless there difficult, like this.  But, in this case, I had to take the level of gear up to it's max of 10 (which is almost impossibly hard) to figure this out.  But, now, I have an obtuse or isosoles triangle (going back to trigonometry.  And, remember SohCahToa.    Well, we have a cotagent, since it's adjacent over opposite with the Queen being next to the monarch and opposite of that is the Rook.  And, now I use that triangle and all that I've learned to force a mate since it is to follow.  ",
        "46. Kh2 Rh4+": "Taking advantage of that.  Worth noting that I'm doing a little twist to this thinking about transformations.  In the other mate, it's not mentioned, but it was trigonometry.  But, on top of the triangle (that I mentioned) I calculate a lot of Algebraic Transformations in my games.  So, what happened here is that I didn't do anything on the Y axis, but I shifted my Rook across the X axis up by 4 units forcing his to come down the X axis by 1 unit and the Y axis by 1 unit.",
        "47. Kg3 Qg4+": "Calculating that I'm going to win his Rook, after forcing his next move.",
        "48. Kf2 Qxf5+": "Now, he has three choices to get out of check, but all of them lead to mate.  And, here's the conditional move.  If, Ted answers with 49.Kg1, or 49.Ke1, I will automatically respond with 49...Qc2, to allow 50...Rd4, as afterwards, 51....Rd1# would follow, which is mate.",
        "49. Kg3": "?? But, when he plays this, however, I mate, at once.",
        "49... Qf4#": ""
    },
    "url": "https://gameknot.com/annotation.pl/applying-what-youve-learned-n-b-mate?gm=61195",
    "gameName": "Applying What You've Learned-N+B Mate",
    "players": "Ted  vs. Joe (1353)",
    "opening": "Sicilian (B50)"
}