{
    "moves": {
        "1. e4": "This is a game I played shortly after starting to read through Vladimir Vukovic's \"The Art of the Attack in Chess\"; specifically, the section on the attack on the king stuck in the centre.   The ideas in the book helped me to a quick win in this game.",
        "1... e6 2. Nf3": "d4 is the most common here.   I find 2. Nf3 usually indicates a weaker player unfamiliar with the French.   It's also a sign that the French exchange is on the way.",
        "2... d5 3. exd5": "And as expected, the dreaded exchange variation.",
        "3... exd5 4. d4 Nf6 5. Nc3": "I don't think this is the strongest; it blocks the c-pawn advance.   The main line is Bd3.",
        "5... Be7 6. Bf4": "Bg5 puts more pressure on black's position - trying to undermine the d-pawn and restrict black's pieces that little bit more by virtue of the x-ray onto black's queen.",
        "6... O-O 7. Be2": "7. Nb5 is a threat easily dealt with - ... Bb4+   8. c3 Ba5 and c7 is covered while white falls behind in development; a subsequent a6 will kick the knight to an awkward square.   If instead 8. Bd2 to block the check, a lot of white's pressure is gone.",
        "7... Bf5 8. Bd3": "I think this is unnecessary for white; he may be better advised to castle now and challenge the bishop on his next move.   This may be with the bias of hindsight though!",
        "8... Bxd3 9. Qxd3 c6": "If 9. ... Nd7, 10. Qb5 looks strong for white as the b and d pawns are hanging.   Though black may be ok after 10. ... Nb6, in which case, this move may just be too slow.   The d-pawn is stronger than usual because white isn't threatening to remove the knight at f6 (as he would have been with the bishop on g5)",
        "10. Ne5 Nbd7 11. Qg3": "? This is an error from white, who won't get another chance at castling.   My task now is to try take advantage of the uncastled king while I can.",
        "11... Nh5 12. Qe3 Nxf4 13. Qxf4 Nxe5": "Swapping off often doesn't favour the attacking player, but here, I need to clear lines to the king.",
        "14. Qxe5": "If instead 14. PxN, d4 followed by Bb4+ should cause white some problems.",
        "14... Bd6 15. Qf5": "The e-file has been successfully opened.",
        "15... Re8+ 16. Ne2 Qe7": "?!   Not the right plan, computer analysis reckons.   Instead, Re4 means the rook heads the battery, not the more valuable queen.   A triple attack down the e-file is also formed quicker - Qe7 and Re8 are following; in the game, my rook had to go via d6 and e6, wasting an extra move.",
        "17. Qd3 Bf4": "Preventing Kd2 while also freeing d6 for the a-rook to join the battle.",
        "18. g3 Bh6 19. f4 Rad8 20. Kd2 Rd6 21. Rhe1": "? Qf3 was better here; if I can get Re3 in, white's queen will be cut off from the defence of the knight.   The computer gives as the best line 21. Qf3 Re6   22. Rae1 Re3   23. Qf2 Qe4   24. Qf1 Kf8   25. h3 (don't really understand those last three moves) RxP!   26. NxR Qxd4+   27. Kc1 BxP+   28. Kb1 BxN, when black has three pawns for the exchange and a reasonably active position.",
        "21... Re6 22. a3": "??   White needs to make room for his queen.   Better would be 22. Kd1 when, after 22. ... Re3   23. Qd2 Qh3, black is going to start winning material while white is still trying to extract his pieces.",
        "22... Re3": "White's queen must leave the a6-c1 diagonal, and as a result, the knight at a minimum will fall (computer analysis recommends 23. g4).   White resigned here.   A salutary lesson to take care of your king!"
    },
    "url": "https://gameknot.com/annotation.pl/attack-on-the-uncastled-king?gm=43257",
    "gameName": "Attack on the uncastled king",
    "players": "l3issi (1356) vs. cdeburca (1615)",
    "opening": "French (C00), Wing gambit"
}