{
    "moves": {
        "1. d4": "I played this game at my local chessclub. My opponent needed a win for promotion and actually I thought I was lost allready since I'd had only four hours of decent sleep the previous night! ",
        "1... Nf6 2. c4 g6": "With the kingside fianchetto black aims his bishop on the central squares e5 and d4, where the pressure on d4 can soon be increased by playing   ...e5 or ...c5.",
        "3. Nc3": "Forcing black to make a commitment, as to wether to play the Gruenfeld, or to play 3..Bg7, allowing white to play the move e4, wich would stop the Gruenfeld.",
        "3... Bg7": "3..d5 would have entered the Gruenfeld defence.",
        "4. e4": "The King's Indian defence is a very tricky opening wich can lead to some nice chances for black when handled improperly by white. This is often based on the strength of the bishop along the diagonal.",
        "4... d6": "It's not easy for white to find the right defence against black's setup, mostly because this opening has so many variations, wich can only be compared to the Sicilian defence.",
        "5. Nf3": "5.f3 is also very common, planning on castling queenside and using the kingside pawns for the attack. At the post-mortem my opponent told me he always plays 5.f3 when playing white in this opening. ",
        "5... O-O": "The most common continuation.",
        "6. Be2": "Straight from the book.",
        "6... c5": "...e5 is played more often.",
        "7. d5": "The 'best' move here.",
        "7... Nfd7": " ?! Black is not wasting time and wants to play ...f5 as soon as possible and open the c-file for attacking chances. Still, 7...e6 would have been much stronger.",
        "8. Bd2": "8. O-O was also playable, but eventually I decided to develop my bishop first and avoid the doubled pawns after 8....Bxc3 9.bxc3.",
        "8... f5": "As expected.",
        "9. Qc1": "? I must admit this is a strange move and this shows I was rather tired. I was looking for something like 10.Bh6 Bxh6 11.Qxh6. Better would have been simply 9.exf5 ",
        "9... Ne5": "Black must move the knight on d7 again in order to develop his bishop.",
        "10. O-O": "I now think 10.Nxe5 followed by 11.exf5 would have been stronger, but I was looking to complicate things a little.",
        "10... fxe4 11. Nxe4 Bf5 12. Neg5": "With the treat of a possible fork on e6.",
        "12... Nbd7": "My opponent spent 15 minutes before making this move! I then spent quite some time myself before making my next move since I immediately saw he was either trying to provoke 13.Nh4 or he had just missed it and now 'just' developed his knight.",
        "13. Nh4": "I decided to go for it...",
        "13... Bd3": "!?This came as an unpleasant surprise to me..I had completely missed this move, wich leads to a nice combination!",
        "14. Ne6": "Black must still move his queen first.",
        "14... Qb6": "And does so very effectively!",
        "15. Nxf8 Bxe2": "The point of 13...Bd3: 16.Re1 Nd3! wins for black.",
        "16. Nxd7 Nxd7": "These moves are almost forced...",
        "17. Qe1": "? Here I missed a win, because after 17.Re1!? Bxb2 18.Qb1 Bxa1 19.Qxa1 Bxc4 20.Bh6! black is lost! ",
        "17... Bxf1 18. Qe6+": "Much stronger than 18.Qxf1. White can now regain some initiative. Somehow the previous moves of my opponent served as a wake up call for me, since I slowly felt my position slip away..",
        "18... Kh8 19. Rxf1 Ne5": "? 19...Qxb2 20.Bc1 Qf6 21.Qxd7 Qxh4 22.Qxb7 Rf8 is ok for black, with a more or less equal position.",
        "20. Bc3": "Finally, the bishop becomes more active. Let the attack begin!",
        "20... Qc7": "?? A blunder in a bad position. Black should have tried 20...Nxc4 21.Bxg7  Kxg7 22.Qxe7  Kg8 though white is still better.",
        "21. Re1": "The rook is on its way to h3! ",
        "21... Re8": "? 21...Qc8 was the best move here I think. Blacks play is becoming increasingly more passive.",
        "22. Re3": "Here I was trying to provoke 22....Nxc4?? 23.Nxg6 ! followed by 24.Rh3  and mate follows.",
        "22... Rf8": "?? A fatal blunder from my opponent! 22...Qc8 would have saved him as we'll see after my next move..",
        "23. Bxe5": "Taking away the defender of g6!",
        "23... dxe5": "23...Bxe5 24.Nxg6  hxg6 25.Qxg6! ( not 25.Rh3  Kg7 )\n threatening mate with Rh3 , 25...Qc8! 26.Kf1!! and black is also lost. \n( again not 26.Rh3 ? Qxh3! 27.gxh3 Rg8 and black comes out a bishop ahead. )  \n\nRegarding the note at move 22: if black had played 22...Qc8 then after 23.Bxe5 Bxe5! 24.Nxg6 ? hxg6 25.Qxg6 the position is uncertain. I tried analysing some lines but the postion is full of pitfalls. Here is one line I liked: after 25.Qxg6 \n25...Rf8 26.Kf1! Rxf2 ? 27.Kxf2 Bd4 28.Ke2 Bxe3 29.Kxe3\n\nThis was all hard to see and I doubt I would not have played 23.Bxe5 and 24.Nxg6  because it was simply to deep to calculate for me at that time...",
        "24. Nxg6+": "And so after waiting patiently for ten moves, the knight on h4 makes his \nthird move of the game and my opponent simply resigned because of:\n24...hxg6 25.Rh3  Bh6 26.Rxh6  Kg7 27.Qxg6 mate.\n\nNeedless to say, that night I had some sweet dreams ;)\nHope you enjoyed,\n\nSarasani\n\nPS. If you have suggestions or corrections please message me!"
    },
    "url": "https://gameknot.com/annotation.pl/attack-e61-kings-indian-defence-3-nc3?gm=4155",
    "gameName": "Attack! E61 King's Indian defence, 3.Nc3",
    "players": "Sarasani (-) vs. Umashankar (1412)",
    "opening": "King's Indian (E91), 6.Be2"
}