{
    "moves": {
        "1. e4 e5": "Usual.",
        "2. Nf3": "So far, average.",
        "2... Nc6": "I was expecting something harsh or unusual (3.d4 for example), but it didn't happen.",
        "3. Nc3": "I'll perform my best opening, the Four Knights.",
        "3... Nf6 4. Bb5": "To prevvent pawn loss, I may have to play 4...d6",
        "4... d6": "Which is exactly what I play.",
        "5. O-O": "Reasonable.",
        "5... Bd7": "Keep your eyes on the g4 square.",
        "6. d3": "I think that White is aiming for 7.Bg5.",
        "6... Nd4": "I thrust my Knight into the center. Here, White can't take the Knight: 7.Nxd4 exd4 forcing the loss of two points.",
        "7. Bc4": "White retreats the Bishop, seeing the attack.",
        "7... Be6": "I could have played White's worst Knight-mare, but I delayed it accidentally. Now, White can simply play 8.h3.",
        "8. Nd5": "Good or bad? I will answer that below.",
        "8... Bg4": "This is the right responce and White's 8th move could have been thought over longer.",
        "9. Bg5": "Probably trying to panic me into doing something else.",
        "9... Be7": "This seems to be critical for White.",
        "10. Bb3": "That Bishop is not worth taking.",
        "10... Nxd5": "This is an attempt to halt White's activity in the center and helps indirectly with the lethal pin.",
        "11. Bxe7": "The best possible move.",
        "11... Qxe7 12. Bxd5": "I'm going to chase the Bishop...just once.",
        "12... c6 13. Bb3": "I'm still not taking it.",
        "13... O-O": "I dindn't know which way to Castle, but here, I'm faced with a pin to what can be a helpful pawn.",
        "14. Kh1": "That's right, White. Flee.",
        "14... Qf6": "The time is right.",
        "15. Rg1": "White couldn't do much of anything to protect himself from the next moves I will be playing.",
        "15... Nxf3": "That was a free Knight.",
        "16. c3": "I don't know why White played this move.",
        "16... Nxh2": "!? If taken, it becomes one move mate.Also, the Queen is attacked. However, this move is not ! because it promotes weaknesses that can be used against me.",
        "17. Qd2": "Believe it or not, I might want to place my Knight back on f3.",
        "17... Qh4": "The end is near, ...or is it?",
        "18. g3": "The game is perhaps won with 18...Bf3+ 19.Rg2 Qh3.",
        "18... Bf3+": "So far, so good.",
        "19. Rg2": "Forced.",
        "19... Bxg2+": "Instead, I got greedy and the game lasts longer than it could have lasted.",
        "20. Kxg2": "Now, the risk is losing the two remaining pieces in the attack.",
        "20... Qh5": "Actually, I will stil ensure that the pieces will survive. I just have to figure out how.",
        "21. Bd1": "Now, the Knight is officially lost.",
        "21... Ng4": "Right now, Black's worst possible move is 22.f3. Decide when you shouldn't attack.",
        "22. Bf3": "I'm looking at 22...f5.",
        "22... f5": "The idea is to bring my Rooks.",
        "23. Rh1": "This is almost pure bad news for Black. The only way that Black could continue with an attack is to carry it out on the h-file. This is no longer possible.",
        "23... Qg6": "However, I won't let go of the Knight.",
        "24. Kg1": "I can visualize White teasing me... just for a little bit.",
        "24... f4": "I believe that 25.Qe2 makes this move wasted. 24...h6 is better.",
        "25. Qd1": "That move has the same purpose as the expected 25.Qe2.",
        "25... h5": "I have now weakened my pawn structure... for a lazy Knight?! That's almost perposterous! I should just move it to f6 instead.",
        "26. Qb3+": "Well, it isn't really beneficial for White to win a free pawn after all.",
        "26... Rf7": "Why am I aiming to double up my Rooks.",
        "27. d4": "There's still opportunity. I will explain this also.",
        "27... fxg3": "Okay.",
        "28. fxg3": "All I have to do now is 28...Kh7.",
        "28... Kh7": "Add to that, I need to double up Rooks. The problem with this move is that unless the Bishop is taken, the Knight is indirectly pinned to my doom.",
        "29. Qd1": "This makes matters much worse!",
        "29... Raf8": "Also playable is the daring 29...Rd5!?. It's probably worth avoiding if it can't be played out correctly.",
        "30. Bg2": "Fork (when I can)!",
        "30... Kh6": "First, this.",
        "31. Bh3": "Apparently, White won't give up trying to rip open my h-file and turn the tides in his favor.",
        "31... Nf2": "Better was 31...Ne3, threatening 32...Qxg3 with mate to follow. It might look like this: 31...Ne3 32.Qe2 Qg3+ 33.Bg2 Rf8+ with mate next move.",
        "32. Qd2+": "If I am forced, I will go to h7 all over again.",
        "32... Kh7 33. Bf5": "My Queen isn't pinned. At the most, White will get an additional point. I actually, in the game, almost lost the Queen because I didn't see the move that gets me out.",
        "33... Rf7xf5": "Don't worry though, I figured that out.",
        "34. exf5": "White loses, starting now.",
        "34... Qxg3+": "I can now take that bothersome Rook and get away safely.",
        "35. Kf1": "If it is meaningful to me, I guess it's okay.",
        "35... Nxh1": "I take the Rook.",
        "36. Qc2": "To me, it seems unusual, but wise to play 36...g6",
        "36... e4": "Or try to drive the Queen away from the pawn by force. The f5 pawn is lost and the Barrier between my attacking forces and White's almost helpless King is completely broken.",
        "37. Ke2": "Sure, I'll do a Queen trade.",
        "37... Qf2+ 38. Kd1": "The game is permenantly lost for White.",
        "38... Qxc2+": "What's better that sacrificing a Queen for a Queen to gain another Queen besides for checkmate.",
        "39. Kxc2 Rxf5": "King, 7 pawns, Knight, and Rook vs. King and 4 pawns. All I have to be cautious about is White's pawns promoting, which would only happen if I was only stuck on my own plan.",
        "40. Kd2": "How about Rf3 followed by Ng3 with the promotion of the h-pawn.",
        "40... d5": "First, I'm going to create prolonged problems for White. Then, I will create a mini version of the plan.",
        "41. Ke1": "I know exactly where I want the King: on the back rank. 41...Rf2! Isolates the King from helping his pawns at the expense of a rook and a Knight. However, I'll promote my h-pawn. ",
        "41... h4": "I may as well stick with a less complex plan once again.",
        "42. Ke2": "Now, 42...Rf3 Isolates the King, doesn't lose material, and helps the Pawn promote!",
        "42... h3": "I still go simple. I can't get any simpler than this.",
        "43. b3": "43...b5 stops White's pawns dead in their tracks temporarily, but I will just... keep... pushing... the pawn.",
        "43... h2": "I will reroute the Knight to g3 or f2, but I think g3 is the better square.",
        "44. c4": "Don't care! Sorry, White.",
        "44... Ng3+": "The end is coming up.",
        "45. Ke3 Rf3+": "Now, the King is stuck on the first and second ranks.",
        "46. Kd2": "Forced.",
        "46... h1=Q": "Finally, promotion and a mate in two.",
        "47. cxd5": "I won't worry. It is too late.",
        "47... Qg2+": "This is the end.",
        "48. Ke1": "Anywhere in the back rank is fine so pick the most comfortable spot.",
        "48... Rf1#": "In this game, I performed a risky move and didn't play it right. Then, I wound up in a serious predicament. Be careful about risky moves that you play in your chess games. Your position can only handle so much pressure from it. Here's a golden rule: When faced with a challenge, look for a way, but not a way out."
    },
    "url": "https://gameknot.com/annotation.pl/attack-vs-time?gm=45105",
    "gameName": "Attack vs. Time",
    "players": "Kyle (1543) vs. me (970)",
    "opening": "Four knights (C48), Spanish variation"
}