{
    "moves": {
        "1. d4": "Now I've played many games, but few of them are really worth annotating. Conditions on games to be of interest are that there should not exist big mistakes. The game should be of a strategical value and the outcome should be seen as the result of the confrontation of two plans not as the result of single moves.\nThe theme of this game is attack. Pure attack. As you will see, both players are trying to push pawn into the opponent king side. Two factors determined the winner : density of attacking pieces and quality of deployment. I will explain later. Fortunately I was the winner in this match.",
        "1... Nf6 2. Bg5 Ne4 3. Bf4": "The same as my previous annotated game. There is no Potato opening here. It's all predefined as the tournament was started with a thematic position.",
        "3... d6 4. Qd3": "Attacks Ne4. It also attracts the opponent to try the Bf5-pin, something I hoped for : 4..Bf5 5.f3 Ng3 6.e4 Nxh1 7. exf5 then easily the knight at knight at h1 could be taken (g3, Bg2).",
        "4... Nf6": "He retreated.",
        "5. e4": "Time to translate that into a development advantage.",
        "5... g6 6. f3": "When I play this move, then it is often that I'm planning a long castle and a pawn storm against the opponent king side.",
        "6... Bg7 7. Nd2 O-O 8. O-O-O": "Now each played has finished the development stage and achieved castle for his king. Time to put a paper and write down a strategy.",
        "8... Re8": "This was really the serious trigger for h4 and the start of the whites attack. From the blacks position I would have chosen Nh5 or Nc6 or why not Bd7.\nRe8, from my point of view does not achieve something concret. If blacks are hoping for pushing e5, then this remains weak : If 9...e5 10. dxe5 dxe5 11.Qxd8 Rxd8 12.Bxe5 wins a pawn !",
        "9. h4 a6": "I believe my opponent noted the weak e5 and planned to wage a pawn storm like my plan by defending and preparing b5. \n\nAfter 9.h4 blacks should forget about Nh5. thus Bg7 does not get the chance to make e5 possible.\nIf 9...Nh5 10.Bh2! e5 11.g4! followed by dxe, QxQ and Bxe wins a pawn.",
        "10. Be2": "A development move.",
        "10... b5": "My expectation were true.  Now its a like a race.",
        "11. g4 c5 12. d5": " This one of three moves I considered as strategically good in this game.\nHere is the decision to close the center.\nOf course I had to make some calculation of how far the blacks pawns can reach and how successfully blacks can make it to engage the other major pieces into an attack.\nBg7 is static : it is blocked by Nf6 which is itself somehow blocked. Re8 is passive. Q and Ra8 active, while Bc8 and Nb8 really suffer from c6.\nFor this reaosn I played d5. Whites pieces have the chanc to be deployed in a perfect formation so to succeed an attack against the blacks king. The attack should also be rapid in order to benefit from the fact that I can engage all my pieces which are concentrated in the king-side while some of my enemy pieces would make it slowly to enter defense.",
        "12... c4 13. Qe3 a5 14. h5 e5 15. Bg5": "I also considered Bh6. But this can result into a loss of time since the exchange is not forced and  blacks can simply move the bishop to h8. Then I will have to retreat my bishop so as to enable pieces advancement.",
        "15... Nbd7": "Blacks understood that whites attack is more rapid than theirs.",
        "16. hxg6 fxg6 17. Nh3 Rf8": "Are blacks paving the way for Qe8 ? If yes, then the whites attack must have worked some psychological effect.",
        "18. Nf2": "I didn't want to exchange with any piece at this moment : it's useless. Pieces attack formation should be improved. This is the factor of quality.",
        "18... a4": "Blacks are perceiving time for their attack.",
        "19. Rh2": "Now the factor of quantity or density as I said in the first annotation text. My rook Rd1 along with the sleeping Nd2 are out of the battle. They should be brought in.",
        "19... Rf7 20. Rdh1 Qb6": "When this move was made I feared that my attack could be impossible. This is not true. The queen is not playing a big role. One should count on the remaining pieces.",
        "21. Qxb6 Nxb6 22. f4": "The attack should be careful now. Blacks defense is strong. The bishop c8 is not passive, moreover it suffices for the Ra8 to be placed at a7 in order to count for the defense.",
        "22... Nbd7 23. f5 gxf5 24. gxf5": "Now the g-rank is open.",
        "24... a3 25. b3": "My aim is to close this part of the chessboard.",
        "25... c3 26. Nf1": "If placed at f3 then it would block Be2.",
        "26... b4 27. Ne3": "This is the best choice. There is no hope and no advantage in shifting the attack to the left side :\nIf Nd3 : Ba6. and blacks is all hoping for chances to exchange pieces and weakening my attack abilities.",
        "27... Ba6 28. Bf3": "Also one of the strategically good moves. This move protects e4, leaves Ba6 passive along with the expected Nc5.",
        "28... Bf8": "Preparing Rg7 ?",
        "29. Nfg4": "Threatening \n30.Nxf6+ Nxf6 31.Bxf6 Rxf6 32.Rxh7.\nThus blacks will be playing Ra7 to defend h7.",
        "29... Ra7 30. Nh6+ Bxh6 31. Bxh6": "Blacks king is in a closed position.",
        "31... Nf8": "I thought blacks were planning Ne8 in hope to strengthen the king's defense, then hope for some mobility with the bishop and rook a7.",
        "32. Rg1+ Kh8 33. Rhg2 Bb5 34. Bh5": "The winning move.\n(If Nxh6 then Rg8#)\n",
        "34... Ng6 35. fxg6 hxg6 36. Bxg6 Rfb7 37. Rf2 Nh7 38. Bxh7 Kxh7 39. Nf5 Rbf7 40. Rh2 Kh8 41. Bg7+ Kg8 42. Rh8#": "The end of the story."
    },
    "url": "https://gameknot.com/annotation.pl/attack-plan?gm=23712",
    "gameName": "Attack Plan",
    "players": "potatosoftware (1556) vs. articulator (1501)",
    "opening": "Trompovsky attack (Ruth, Opovcensky opening) (A45)"
}