{
    "moves": {
        "1. e4": "Here is a game where development helped me take over the board. In order to keep things clear, I am playing as white. I will soon enter it into the KOH game of the month contest. Let me know what you think.",
        "1... h5 2. d4 f6 3. c4 a5": "He has given me time to take control of the middle of the board. Although it is not recommended to move 3 pawns in a row, because it wastes tempo, these move helped me dominate the middle of the board.",
        "4. Nf3 Nc6 5. Be3 e5 6. Nc3 Nge7 7. Bd3": "At this point all of my minor pieces are developed, and I seem to be in total control of e4, e5, d4, d5. I've also got many options with the bishops, as well as my knights.",
        "7... exd4": "He takes, and I take back with the bishop.",
        "8. Bxd4 d6 9. h3": "Now that I have control of the board, I can begin to make small movements to better my position. My King is in no danger whatsoever, so why rush to castle?",
        "9... Rh6": "This move seems amateurish, and the prevention of castling is key in the middle game.....especially since he has lost his kingside castling.",
        "10. O-O": "Castling to protect the King.",
        "10... g5 11. Be3": "I think he planned on playing g4, but now that move would free up my bishop to take his rook.",
        "11... Ne5 12. Nxe5": "Why not take? I've got control of the board, and plenty of attacking possibilities.",
        "12... dxe5 13. a4 Qd7 14. Re1": "Once again, trivial moves to try to improve my position before attacking. All these trivial moves pay off at the end.",
        "14... Ra6": "Once again, he has now prevented castling. He cannot castle either way, and he must play the remainder of the game with his king unprotected. This becomes death for him later...",
        "15. b3 Rd6": "Here there is more pressure on the bishop at d3. So to prevent the loss of the bishop, and of control of the game I block with the knight.",
        "16. Nd5 Nxd5 17. exd5 f5": "This move opens up channels for attack. I see many moves which can put me up in material. Right now the material is split, but not for long....",
        "18. Bxg5": "His rook is forced to move. The natural thing to do is move and provide attack on the dangerous piece.",
        "18... Rhg6": "Here he does as expected...",
        "19. Rxe5+": "Now I have forced his King out of hiding. This is a reson why him moving his rooks to h6 and a6 kills him.",
        "19... Kf7": "Now, he had several options here other than that. He could have played Re6, but my d5 pawn, which I established in the 2nd move, now prevents him from doing that without losing the rook. He could also move his Queen to protect (Qe7, but my bishop and my rook both attack that square.) Finally, his best move would have been be7 other than the move he took. He would have exchanged bishop for bishop, rook for Queen. Not ideal but...............Also, I have bxf5 available, splitting the Queen and rook. That would have screwed everything up anyways.",
        "20. Bxf5": "Here it goes, his whole defense is split and he is forced to decide between the rook and the Queen. His Queen is currently trapped, all avenues of escape covered. His only option to save the Queen is to block with the rook. (Rge6)",
        "20... Rge6 21. Qxh5+": "Now moving the rook has opened up another hole in his defense. It occured to me that I could have done this earlier, before playing bxf5, but I wanted to make sure to keep him on the run, and not give him a free move. Pinning the rook and having his Queen trapped would have been great, but I needed to keep my advantage. My queen, both bishops, and a rook are now bearing down on the unprotected King. His options with the King are g7, g8. g8 is not favorable, because bxe6 then splits it and the Queen, while capturing a free rook. My choice here would be kg7.\n\n\nNow he could also move Rg6, but that would mean abandoning his Queen, and it's a little early for heroics.",
        "21... Kg8 22. Bxe6+": "As I said, Kg8 opened up another stream of attacks for me.",
        "22... Rxe6 23. Rxe6": "Now I take, in order to bear down on the 6th rank. Now I can eventually move it to the 7th rank, pin the king and deliver checkmate with the Queen.",
        "23... Qh7": "Here he proposes to exchange the Queens. I am up 11 points in material, so the one thing I should be trying to do is simplify. But there is yet one more avenue of attack.",
        "24. Rg6+": "Here he has 3 options. Kh8, Qg7 or bg7. \n\nKh8 allows me to play bf6+, which pins the King. He then is forced to play bg7. When I take that bishop, his king moves g8, and when I back up with bishop, his King has nowhere to go and it's a checkmate. No win on that move for him. He must try the other two...\n\nQg7 is just plain wrong, because you sacrifice the Queen for nothing. That leaves bg7 It is the only move that does not sacrifice a piece. He ends up picking this option.",
        "24... Bg7 25. Bh6": "Now I block the exchange and put pressure on the pinned bishop. It's most likely the bishop bishop, Queen rook exchange from earlier.",
        "25... Qxg6": "He gets fed up and exchanges Queen for Rook. The game is pretty much lost at this point.",
        "26. Qxg6": "At this point I am 15 points ahead in material value...game over....",
        "26... Kf8": "Obviously I plan to take the bishop.",
        "27. Qxg7+": "...",
        "27... Ke8": "...",
        "28. Re1+": "I have him pinned on the 8th rank, and I will just keep forcing him down the line until my queen can come and checkmate.",
        "28... Be6": "Had he moved Kd8, my Queen could have come over, and Qe7 was a checkmate. This is his only move to prolong the game.",
        "29. Rxe6+ Kd8": "...",
        "30. Qe7+": "...",
        "30... Kc8": "....",
        "31. Qe8#": "Now the traditional pinned king under the pawns checkmate. This game has been my best in a while, and the development and attack by white (me) seemed very good to me. Thanks, and make sure to leave your opinion...:) Let me know where I could have done even better."
    },
    "url": "https://gameknot.com/annotation.pl/attacking-possibilities-koh-gotm-entry?gm=32654",
    "gameName": "Attacking Possibilities - KOH GOTM Entry",
    "players": "soccer14 (1256) vs. ??????? (1300)",
    "opening": "King's pawn opening (B00)"
}