{
    "moves": {
        "1. e4": "Hi everyone!\r\n\r\nHere is my situation.  I normally have less than 20 games on my active games list but after I came back from my Cornish holiday I found I had 27.  How did that happen?  Well, firstly, I took part in another mini-tournament which involved some buddies who I had not played with for quite a while, so I thought, why not?  Then my team captain gave me some team games, well it is about time I played some for my team as I had not played team games for quite a while.  Then a couple of people reinstated their timed out games and I thought it was unsportsmanlike to refuse.  So it all added up - and found myself with 15-20 new games.  I found myself relying on the database more than ever, so much so that it was a complete blur of black and white bars and facts and figures.  Sadly I became more focussed on that than on the actual position and so I felt on auto-pilot.  I chose a bad option and paid dearly for it.  Anyhow, on with the game.  This opening starts off as a double king pawn opening and turns into the Ruy Lopez.",
        "1... e5 2. Nf3 Nc6 3. Bb5": "3. Bb5 - This move is the Ruy Lopez/Spanish Torture.",
        "3... a6 4. Ba4 Nf6": "4. ...... Nf6 - the most popular response to Bb5.",
        "5. O-O Be7": "5. ..... 0-0 - This starts off the Closed Ruy Lopez.  Funnily enough in another game against an Expert I decided to try the Open Lopez which is Nxe4.  That game is in progress so I may annotate that one at its conclusion, but here I choose the conservative Be7.",
        "6. Re1": "6. Re1 - prevents Nxe4 for good.",
        "6... b5 7. Bb3 Na5": "7. ...... Na5?? - Dave gave this move 2 question marks in his post match pm to me.  This move was played in the World DB and had a black bar against it.  It should have a skull and cross bones painted on it!  Still, I suppose it has some merit.  It busts up white's queenside pawn structure slightly and black has the bishop pair.  But is this sufficient compo for the pawn minus?",
        "8. Nxe5 Nxb3 9. axb3 Bb7 10. d3 d5": "10. ...... d5 - now following the Gameknot DB.  This move is the best of the bad rubbish according to the bars.",
        "11. exd5 Qxd5": "11. ...... Qxd5 - threatens mate on g2 but this is easily parried.",
        "12. Nf3 Kf8": "12. ..... Kf8 - I didn't feel too comfortable with this king move but the expert who played it managed to draw the game.",
        "13. Bf4 Qd7 14. Nc3": "14. Nc3 - Dave deviates from the database at this move playing Nc3 instead of Nd2.  This throws me off the beaten track and into open play.",
        "14... Bb4": "14. ...... Bb4 - a pin, but not a very effective one as you will see.",
        "15. d4 Nd5 16. Nxd5": "16. Nxd5 - I did not expect him to take the knight in response to the pin/pile up but he does.",
        "16... Bxe1": "16. ....... Bxe1?? - should have cut my losses with B or Qxd5 retaining the bishop pair.  Now that horsie is gonna give me knightmares.",
        "17. Nxc7": "17. Nxc7 - a worthy intermezzo.",
        "17... Bxf2+": "17. ........ Bxf2+ - Fou Lenoir tries to sell his life as dearly as possible.  This is called a desperado and boy that matches my mood perfectly here!",
        "18. Kxf2 Ra7 19. d5": "19. d5 - that d pawn is gonna be a major menace soon.",
        "19... Bc8 20. d6": "20. d6 - Veni, Vidi, Vici says that humble foot soldier, and poor Glenda is reduced to blocking him!",
        "20... Qf5 21. Qd4": "21. Qd4 - defending his bishop and menacing my a7 rook.  Glenda now gives Dave a spite check.",
        "21... Qxc2+ 22. Kg1 Rb7 23. d7": "23. d7 - after my rook took evasive action this little pawn move sealed mine and poor Fou Leblanc's doom so I waved the white flag.  The fact that I drew against Dave just a few days back makes this performance look even more pathetic than it was."
    },
    "url": "https://gameknot.com/annotation.pl/auto-pilot-part-1?gm=26562",
    "gameName": "Auto Pilot - Part 1",
    "players": "dynamic_dv (2062) vs. jstevens1 (1830)",
    "opening": "Ruy Lopez (C88), closed"
}