{
    "moves": {
        "1. d4 Nf6 2. c4 e6 3. Nc3 Bb4 4. e3 d5 5. a3 Bxc3+ 6. bxc3 c5 7. cxd5 exd5": "Today we all know that due to Black's premature definition of the pawn structure in the centre White has the better opportunities to gain the initiative. But in those days both opponents were wandering in 'terra incognita' - the routes that were to develop in the Nimzo-Indian Defence were just being formed.",
        "8. Bd3 O-O 9. Ne2 b6 10. O-O Ba6": "\u0004\r\nBy all chess standards that dominated the minds of the chess players in the 20s and 30s Black has absolutely nothing to complain about. Good pawn structure, easy development, no weaknesses. White isn't even threatening any immediate action. However, Botvinnik felt correctly that a possibility of a central advance e3-e4-e5 (after the preparatory f3) could lead to a violent attack on the kingside. Hard to believe? Well, at least you are thinking on the same lines as the great Cuban champion.",
        "11. Bxa6": "Subsequent experience has shown that one should prefer 11.f3 immediately working on the critical break in the centre. The White queen has to go to d3 anyway, and the black knight doesn't get a new option.",
        "11... Nxa6 12. Bb2": "Pioneers are doomed to making mistakes. The wrong move order always damages a deep strategical plan. \r\n[12.Qd3 was necessary]",
        "12... Qd7 13. a4": "Forced. Now \r\n[13.Qd3  was not good because of Qa4! sealing White's queenside.}",
        "13... Rfe8": "Capablanca misses the moment to seize the initiative [ 13...cxd4 14.cxd4 rfc8 followed by 15.-- Rc4 16.--Ra8 and White has to forget about active plans in the centre and switch to defensive lines instead.",
        "14. Qd3 c4": "This serious positional mistake has a clear historical background. The 50-year-old Capablanca in his long chess career never dealt with hidden dynamic factors. His unique intuition and rich experience didn't send any danger signals here. Instead he counted on using his opponent's light squares with the long manoeuvre Na6-b8-c6-a5-b3. Capablanca simply underestimated the explosive power of White's position.",
        "15. Qc2 Nb8 16. Rae1 Nc6 17. Ng3 Na5": "[If 17...Ne4 then 18.Nh1! and White's plan works out anyway, e.g. f5 19.f3 Nd6 20.Ba3 g6 21.Ng3 and after the inevitable e3-e4 the weakened position of the Black king is a source of permanent trouble.",
        "18. f3 Nb3": "Both sides are quite persistent. The a4-pawn is lost, but the long-awaited central advance is also ready.",
        "19. e4 Qxa4": "This miserable pawn has played an important role as bait for the tiger!",
        "20. e5 Nd7 21. Qf2": "Otherwise the isolated knight is able to come back into the game extremely effectively after Nb3-c5! Now Black has to take his opponent's threats more seriously - the white knight is heading for f5 and d6, and the advancing f-pawn could be a battering ram that will crack open the black castle. But Capablanca cannot be frightened by these shadows on the horizon. The stubborn proponent of economy was famous for an astonishing ability to defend his king with a minimum of resources while his main army was gaining advantage elsewhere.",
        "21... g6 22. f4 f5": "Forcing the opening of the e-file and an exchange of rooks.",
        "23. exf6 e.p. Nxf6 24. f5": "Getting closer to the black king.",
        "24... Rxe1 25. Rxe1 Re8": "Using a tactical trick to protect the knight on f6: 26.fxg6... (variation). Capablanca was reducing White's attacking potential, however, from now on he had no choice but to join the club of chess masterpieces. Unfortunately he was sitting on the wrong side of the board! In case of [25...Rf8 26. Qf4 White's attack is also unstoppable, e.g. Qa2 27.fxg6! Qxb2 ( 27...hxg6 28.Qg5) 28.g7! Kxg7 29.Nf5+ Kh8 30.Qd6 Rf7 ( 30...Kg8 31. Qg3+) 31.Qxf6+ mating.]",
        "26. Re6": "[26fxg6 hxg6 27.Rxe8+ Nxe8]",
        "26... Rxe6": "Now instead of being consumed in the flame of the attack the modes f-pawn is making a dream career. The appearance of this powerful ally for the white queen was impossible to avoid:[26...Kg7 27.Rxf6! Kxf6 28.fxg6+ Kxg6 ( 28... Ke7 29. Qf7+ Kd8 30. g7) 29.Qf5+ Kg7 30.Nh5+ Kh6 31.h4! Rg8 32.g4 Qc6 33.Ba3! with mate to follow.]",
        "27. fxe6 Kg7 28. Qf4 Qe8": "The queen must return.\r\n[28...Qa2? 29.Nf5 with mate in five.]",
        "29. Qe5 Qe7": "Attack and defence have reached a faltering parity, each side needs reserves to decide an epic battle in its favour. The question is whose minor piece from the forgotten flank is faster? Black's knight is going to use the same route Ncb3-a5-c6, but what about the sleeping white bishop?",
        "30. Ba3 Qxa3 31. Nh5+ gxh5 32. Qg5+ Kf8 33. Qxf6+ Kg8 34. e7": "Nach 34.Qf7+ Kh8 35.with the white king escaping to h3 was also enough, but hurrying e7 could spoil everything:\r\n(35.e7? Qc1+ 36. Kf2 Qd2+ 37.Kg3 Qg5+ 38.Kf3 Nxd4+! 39.cxd4 Qg4+ with perpetual check.)]",
        "34... Qc1+ 35. Kf2 Qc2+ 36. Kg3 Qd3+ 37. Kh4 Qe4+ 38. Kxh5 Qe2+ 39. Kh4 Qe4+ 40. g4": "The sad knight on b3 is left as a silent reproach for Black's stragegical miscalculation in the early middlegame.",
        "40... Qe1+ 41. Kh5": "and Capablanca's resignation, in my opinion, symbolized the end of an heroic era of chess titans, dominating the field with their natural genius. Since this historic moment the professional touch has played a more and more important role as an integral part of chess, the path to ultimate success."
    },
    "url": "https://gameknot.com/annotation.pl/avro-holland-kasparov?gm=25534",
    "gameName": "AVRO Holland [ Kasparov]",
    "players": "Botvinnik  vs. Capablanca ",
    "opening": "Nimzo-Indian (E40), 4.e3"
}