{
    "moves": {
        "1. e4": "This is a game between my Dad and me to prepare for the 4th George Washington Open, June 15-17, 2007.  I think we agreed to a gentlemanly draw in the end, though I probably deserved to lose.  I open with e4.  At that time, e4 was scary territory for me (and still is to some extent).  e4 tends to lead to a wide-open game, which is exciting but also nerve-wracking.",
        "1... c5": "Looks like the Sicilian.",
        "2. Nf3": "This particular opening sets up for an early castle and uses bishop pressure on the king.  Based on the GK database, this opening appears to do well against the Sicilian.",
        "2... Nc6": "Pretty standard, but this favors white at this point.",
        "3. Bb5": "Here's the bishop pressure.",
        "3... Qc7": "a6 might be better here except that it allows for the possibility of stacked pawns, which isn't always a disadvantage, depending on how it's played.",
        "4. Bxc6": "Absolutely no pressure to capture here.  Yet, somewhat surprisingly, according to the GK database, this capture still favors white.",
        "4... Qxc6": "Stacking pawns is usually not good, so this makes sense.",
        "5. d3": "One can immediately castle or develop at this point.",
        "5... e6": "The GK database suggests Nf6 here, which Dad does in the next move.",
        "6. O-O": "A relatively early castle.",
        "6... Nf6": "At this point, there were only 4 games in the GK database with a slight advantage to white.",
        "7. Bg5": "I'm not sure what I was pressuring, but I guess this doesn't hurt and it forces black to consider the possibility of stacked pawns if nothing is done to back it up.",
        "7... Be7": "I think this is the best response to such an attack.",
        "8. c4": "I've since come to learn that leaving d3 in this position is considered weak, particularly when the queen is forced to defend.  Nb-d2 might have been better.  On the other hand, it blocks up the middle.",
        "8... h6": "I tend to do this myself.  Why invite trouble from the bishop?  This weakens the castle, but it's almost a necessity at some point.",
        "9. Be3": "Retreat with pressure on c5.",
        "9... b6": "A good response to the bishop pressure.",
        "10. Nc3": "Developing move.  Now all mid-level pieces are out and the back rank is set up with some flexibility.",
        "10... O-O": "With the open queenside, a short castle seems to make sense.",
        "11. e5": "But, right away, this allows me to begin pressuring the castle.",
        "11... Nh7": "With the possibility of pawn counterattacks and no good targets for black's pawns, this is probably black's only move.  Definite advantage to white at this point.",
        "12. Rb1": "Probably a wasted move on my part.  I used to do this out of habit, but have since learned it shouldn't be done without reason.  Although this sets up a b-file attack, in this case, such attack isn't really ripe.  This essentially gives black a chance to defend himself.",
        "12... f6": "I don't think I would have moved this way.  I'll have to ask Pop what he was thinking here.",
        "13. exf6": "Given the opportunity to further weaken the castle, I take it, even at the expense of one of the center pawns.",
        "13... Bxf6": "Pressures Nc3, possibility of stacked pawns.",
        "14. Ne4": "Now, Rb1 at 12 looks pretty smart.",
        "14... Be7": "Escaping the capture.",
        "15. Ne5": "Harassing the queen whenever possible, particularly when the queen can't develop.",
        "15... Qc7": "Probably, the only decent move for the queen here (Qb7 blocks the bishop).",
        "16. Ng6": "I'm targeting the bishop and taking what I'm given.",
        "16... Rf7": "With white's bishop on white out of the picture, why not Rf5?",
        "17. Nxe7+": "This wasn't necessary yet, but it advances the pace of the game.",
        "17... Rxe7": "And opens up the f-file.",
        "18. Qf3": "Which is wisely occupied.",
        "18... Rf7": "But, the queen is temporarily vulnerable.",
        "19. Nf6+": "Surprise!  The rook in the corner is left unprotected.",
        "19... Nxf6": "Would Rxf6 have been better?",
        "20. Qxa8": "The only disadvantage to white is the threat of getting the queen trapped.",
        "20... d5": "Black sets up the queen trap.",
        "21. Bf4": "A trade that puts black in check looks good ...",
        "21... Qd7": "... but I have to wonder if (21. .. Qxf4, 22. Qxc8  Rf8) would have been better?",
        "22. Qb8": "Getting the queen and bishop to work together.",
        "22... Ng4": "Getting the rook and knight to work together.",
        "23. Bc7": "I can't say I had a clear strategy, though this game was played four months ago.  I think I'm just having fun now.",
        "23... Rf8": "Would Qe8 have been better?  Qe8 would have set up the possibility for Qf8 and some serious pressure on the f2 pawn.",
        "24. Qxa7": "Picking off pawns.",
        "24... Qc6": "Defensive move.",
        "25. h3": "This is a wasted move.  I clearly had Bxb6 or Qxb6.",
        "25... Nf6": "Probably the only reasonable move.",
        "26. Bxb6": "Delayed Bxb6.",
        "26... Bb7": "I didn't see what was coming.",
        "27. f3": "Wasted move again.  Bxc5 was wide open.",
        "27... Ra8": "Hello!  A great counter-attack by black.  White wasted too many moves.",
        "28. Qxa8+": "No other real option.",
        "28... Bxa8": "Back to even, two rooks versus a queen, plus black has an extra center pawn.",
        "29. Ba5": "I'm still reeling at this point.  Just trying to regroup.",
        "29... d4": "A good consolidation of power in the middle.",
        "30. Bd8": "I probably shouldn't be looking for trades, but apparently I was.  Be1 might have been better.",
        "30... Nd7": "Black avoids the trade.",
        "31. a3": "Trying to get as many pieces into black squares as possible.",
        "31... Qd6": "At this stage, it is often a good idea to pin the king in his castle.",
        "32. Rfe1": "Controlling the e-file, but, with the benefit of hindsight, f4 might have been better (or even Kf2?).",
        "32... Qg3": "The queen pin.  Now, the castle pawns can't easily be advanced.  White's bishop is badly out of position.",
        "33. Ref1": "Defending against Bxf3.",
        "33... Ne5": "Here comes trouble.",
        "34. Bc7": "I probably thought this was a decent move as you'd think it stops the knight, but ...",
        "34... Nxf3+": "I managed to forget about what placing the king into check does to the situation.  You can't ignore any possibility!",
        "35. Rxf3": "The only move available.",
        "35... Qxc7": "Black takes a pawn advantage.",
        "36. Rf2": "Avoiding the bishop.",
        "36... Qg3": "Queen pin again.",
        "37. Rd1": "Defensive move.  The bishop prevents Rf3.  Re2 or Re1 were other possibilities, as there was some potential for a rook placing the king into check and stealing the bishop.",
        "37... Bc6": "It was getting late, and I accepted Dad's gentlemanly draw, but I think black had the advantage.  I probably would have played Rd1-f1 next.  Eventually, black would start advancing his pawns.  Another option for white would be Rf2-f1 and trying to push the a-file pawn.  Good comeback Dad!"
    },
    "url": "https://gameknot.com/annotation.pl/b30-sicilian-nimzovich-rossolimo-attack-without-d6?gm=11135",
    "gameName": "B30: Sicilian, Nimzovich-Rossolimo attack (without ...d6)",
    "players": "rpilaud (1474) vs. billpill51 (1578)",
    "opening": "Sicilian (B30), Nimzovich-Rossolimo attack (without ...d6)"
}