{
    "moves": {
        "1. f4": "This was a good game.  A lot of moves made to allow for me to disguise my next move and then a capture may be on the cards. -",
        "1... d5": "White went with f4 Bird's Opening and black chose d5.",
        "2. h3": "White continued to move on the kingside with h3.",
        "2... f5": "Black now decided to lock white's f4 pawn in place with f5.",
        "3. Nf3": "White's next move was Nf6 staking claims to squares e5 and g5.",
        "3... Nc6": "Black went with Nc6.",
        "4. e3": "White pushed pawn to e3 protecting his pawn at f4.",
        "4... e6": "Black also protected his centre pawns with e6.",
        "5. Bb5": "Now white pins the knight at c3 with Bb5.",
        "5... Bd7": "Black brings his bishop to d7 ready to capture white's LB if it captures the knight.",
        "6. Nc3": "White develops his knight to c3.",
        "6... a6": "White pushes a pawn to a6 and is attacking white's LB.",
        "7. Bxc6": "White captures the knight at c3.",
        "7... Bxc6": "Black recaptures the LB with his LB.",
        "8. Ne5": "White now attacks the LB with Ne5 whilst protected by the pawn at f4.  This is a great square in the centre of the board and is attacking f7.",
        "8... Bd7 9. O-O": "Black retreats his LB back to d7 and the knight on e5 is still able to capture but would be recaptured so decides to sit in wait.  White decides to castle instead.  ",
        "9... Bc5": "Black brings his DB to c5 and is looking at the diagonal to the king on g1.  There is a pawn on the diagonal and not much else.",
        "10. d4": "White decides to attack the DB with pawn to d4.",
        "10... Be7": "So black retreats his DB back to e7.",
        "11. a4": "White decides to move pawn to a4 taking control of the b5 square whilst protected by the knight at c3 and the rook at a1.",
        "11... Nf6": "Black now develops his knight to f6 and is preparing to castle.",
        "12. b3": "White pushes pawn to b3 and is allowing his DB some air.  Black's DB is ready for action.",
        "12... b6": "Black is now pushing down the b file with pawn to b6.",
        "13. Ba3": "White decides to exchange DB's with the move Ba3 opposite black's DB at e6.",
        "13... Bxa3 14. Rxa3": "Black captures the DB and white recaptures with his a1 rook.",
        "14... Qe7 15. Ra1": "Black moves his queen to e6 and is attacking the rook which retreats to a1.",
        "15... h6": "Black is now pushing a pawn to stake a claim to the g5 square which is also protected by white's f4 pawn.  Black may be preparing to push his g pawn to g5.",
        "16. Ng6": "White decides to block the g7 pawn with Ng6.  This move also attacks the queen at e7.",
        "16... Qd8": "Black retreats his queen to d8 and it looks like black will not be castling!!  At least not short castling anyway.",
        "17. b4 Rg8 18. Rb1": "White moves pawn to b4 followed by black moving his h8 rook to g8.  White also moves his a1 rook over to b1 to protect his b4 pawn.",
        "18... b5 19. a5": "The queenside becomes locked up by black pawn to b5 and white moves pawn to a5.  It looks like the action will be happening on the kingside.",
        "19... Kf7 20. Ne5+": "Black decides the knight has been at g6 for too long as moves his king to f7 and white moves his knight to e5 and is now checking the king.",
        "20... Ke7 21. Nd3": "The knight moved down to d3 and was looking to relocate.  It seemed there were some choices of squares as white's pawns were nicely placed on b4, d4, f4 obligingly.",
        "21... g5 22. Nc5": "However as white had moved his knight from g6 black was able to move his pawn down to g5.  White relocated his knight to c5 now attacking the pawn at d7.",
        "22... Bc6 23. Ne2 gxf4 24. Nxf4": "Black moved his LB to c6.  White moved his c3 knight to e2 to protect the f4 pawn.  As expected the g5 pawn captured the f4 pawn and was recaptured by the e2 knight.",
        "24... Bd7": "White now moves his LB to d7 to protect the pawn at e6 which is now under threat by both knights.",
        "25. Qe1": "White moves queen to e1 and is looking to access the h4 square and pin the knight at f6.",
        "25... Be8": "Black now moves his LB again to e8 and is looking at the h5 square.  But this is protected by the knight at f4.",
        "26. Qc3": "But instead of moving queen to h4 white decides to move the queen to c3.  This is useful as should the c5 knight find another square to occupy this would leave the queen with access to the king on c5.",
        "26... c6": "Black pushes pawn to c6.",
        "27. Ncxe6": "White moves his c5 knight to e6 and this is being protected by the knight at f4.",
        "27... Qd7": "Black moves his queen to d7.",
        "28. Nc5": "White now decides to attack the queen with Nc5.",
        "28... Qd8": "White retreats the queen to d8.",
        "29. Rbe1": "White now moves rook to e1 opposite the king on e7.",
        "29... Ne4": "Black moves his knight to e4 and is attacking the queen at c3.",
        "30. Qd3": "White moves queen to d3 and should the knight move would be able to capture the pawn at f5.  However the knight cannot be captured as there are two pawns protecting it.",
        "30... Rg3 31. Rf3": "Black moves his g8 took to g3 and white reciprocates with f1 rook to f3.  ",
        "31... Rg5 32. h4": "Black retreats his rook to g5 and white moves pawn to h4 and is attacking the rook at g5.",
        "32... Rg4 33. Re2 Kd6 34. Nb7+": "After white moves e1 rook to e2 to protect the g2 pawn, black moves his king to d6 to allow the queen access to the pawn on h4.  However now white checks the king with Nb7 and has the black queen in a fork.",
        "34... Kd7 35. Nxd8 Rxd8": "The king moves out of check, black captures the queen and the knight is recaptured by the rook.  It looks like white should be in the driving seat from hereon.  Lets see if white can finish the game and not lose the advantage.",
        "36. Re1": "White moves his rook down to e1 possibly looking to allow the queen access to e2 and f1 to get in on the attack on black.  Or help to protect the king as needed.",
        "36... Rxh4": "Black takes the pawn at h4 with the rook.",
        "37. Nh3": "White restricts the rook with Nh3 and has the rook at f3 protecting it.",
        "37... Bg6": "Black brings LB to g6 trying to prevent white from getting his pieces out to create an attack on the king.",
        "38. Rf4 Rg4": "White moves his rook to f4 attacking the rook at h4 protected by the pawn at e3, and nlack moves rook to g4.",
        "39. Qd1": "White moves queen to d1 and is now attacking the rook at g4.",
        "39... Bh5 40. Qd3": "Black moves LB to h5 protecting the rook again and white moves queen to d3.  A better move might have been rook to e2 as if black had decided to capture the pawn at g2 black's rook could have been recaptured.  However black would have captured white's queen with the bishop at h5.",
        "40... Ke6 41. Re2": "Black moves king to e6 and white brings rook to e2.",
        "41... Rdg8": "Now black brings his other rook to g8 and the rooks are doubled on the g file.",
        "42. Rf3": "White moves rook to f3.",
        "42... Rg4g7": "Black moves his g4 rook up to g7 to allow the LB to capture the rook at f3.",
        "43. Nf4+": "White moves his knight to f4 and checks the king with a fork on the LB.",
        "43... Kd6 44. Nxh5": "The king moves out of check and black's LB is captured.",
        "44... Rg7g5 45. Rh3": "The game continues with black moving his rook to g5 now attacking the knight at h5.  White moves his rook over to h3 to protect the knight.",
        "45... Ke6 46. Nf4+ Kf6 47. Rxh6+": "The king moves to e6 and the knight again checks the king.  The king moves out of check and white captures the pawn at h6 and is checking the king again.",
        "47... Kf7 48. Rxc6": "The king moves out of check and white now captures pawn at c6.",
        "48... Ra8 49. Qb3": "Black wishes to protect his pawn at a6 and moves his rook over to a8.  White moves his queen to b3 and is attacking the pawn at d5 which is all that stands between the black king.",
        "49... Ng3 50. Rc7+": "Black moves his knight to g3 and is attacking the rook at e2.  White checks the king with rook to c8.",
        "50... Kf6 51. Qd3": "The black king moves to f6 and white moves queen to d3 to protect the rook at e2 which is under threat of capture by the knight at g3.",
        "51... Nxe2+ 52. Qxe2 Rg3 53. Nh5+": "The knight captures and the queen recaptures on e2.  Black moves rook to g3 and white moves knight to h5 and is now checking the king and forking the rook.",
        "53... Ke6 54. Nxg3 Rg8 55. Qh5 Kf6 56. Qxf5#": "Following the capture of the rook white's queen moves to h5 and king moves to f6 (the king had to move somewhere) as this is the only piece that could be moved.  White's queen checkmates the king with capture of the pawn at f5 assisted by the knight at g3."
    },
    "url": "https://gameknot.com/annotation.pl/babalues-mini-tournament-xxxi?gm=63266",
    "gameName": "babalue's mini-tournament XXXI",
    "players": "milly64 (1030) vs. kirby76 (1208)",
    "opening": "Bird's opening (A03)"
}