{
    "moves": {
        "1. e4": "Hi everyone!\n\nI looked at this little brevity from jkarp, who managed to reach 1200 today - although he has dropped back I think he is on an upward curve.  However, the Master Mater has still shown his opponents that no king is ever safe against him and if they do not watch out they are gonna get Freddied! Sadly King Joe met this fate after less than 15 moves.  Master Freddy is truly back with a vengeance!",
        "1... d5": "2. ..... d5 - Freddy plays the Centre Counter or Scandinavian Defense.  The BQ will end up being chased around the board but beware - she may well find a nice little niche - as she does in the hands of a player like Freddy, sigh and double sigh!",
        "2. exd5 Nf6": "2. .... Nf6 - Freddy decided to develop a piece rather than immediately recapture on d5.",
        "3. Nc3 Nxd5 4. Nxd5 Qxd5": "4. .... Qxd5 - and here is Freddy's queen, slap, bam in the middle of the board and at the moment, she cannot easily be assailed.",
        "5. Nf3 Nc6 6. Bd3": "6. Bd3 - not sure that blocking in your dsb is a good idea here.  Joe - you need to get your pieces on to decent squares pretty quick or Freddy will dominate you big time!",
        "6... g5 7. O-O g4": "7. ..... g4 - now here is something to expect from Freddy.  He is a bit like The Dentist in that he lurves pushing those g and h pawns.  However, Freddy somehow seems to know just when the time is right to do it!",
        "8. Nh4 Bd7 9. b3": "9. b3 - preparing c4 to chase back the BQ perhaps?",
        "9... Bg7 10. Ba3 Bf6": "10. ..... Bf6 - Freddy can be a right sadist - if material hangs he doesn't always take it at once - in this case he forks two pieces, the hapless knight on h4 and the rook on a1.  The knight on h4 cannot be saved.",
        "11. Rb1 Bxh4 12. Qe2 Nd4": "12. .... Nd4 - in they come, in they come!",
        "13. Qe3 Bc6": "13. .... Bc6 - nasty, nasty.  Joe has no way of preventing Old Matey without having to give up heavy material.  He goes for the quick death and Freddy commits regicide on the next move.  Well, I am down to play him in a best of two in my Welcome MT Part 3.  I just hope I can do enough to avoid letting him 'ave 'me 'enry and making me a right damsel in distress, but we shall see!",
        "14. c4 Qxg2#": ""
    },
    "url": "https://gameknot.com/annotation.pl/back-with-a-vengeance?gm=47986",
    "gameName": "Back with a vengeance!",
    "players": "jkarp (1192) vs. easy19 (2001)",
    "opening": "Scandinavian defence (B01)"
}