{
    "moves": {
        "1. e4": "This is where Bobby Fisher would say, \"Best by Test\".  For a long time, I have been wondering what, \"Best by Test\" meant.  Liam1260 and expert inadowman gave a very good opinion of that statement.  Bobby Fisher tested this opening and determined that it is best, and that is what he means when he says, \"Best by Test\".  According to Jack Stockel, 1.e4 is still the strongest opening, and that is why it is also the most common.  However, he has also told me that other openings are quite playable, as long as, they are studied by masters and grandmasters.",
        "1... c5": "This was Bobby Fisher's favorite defense.  He opened with the Sicilian defense against a Russian player. I do not know what his name was, but he was also a grandmaster.  This is how Bobby Fisher defeated that player, in a long game.  For that reason, Bobby Fisher would also say, \"Best by Test\", for this opening.    \r\n",
        "2. d4": "He probably wanted to respond with the Open Sicilian, but it is a little early for this move.  If wanted the Open Variation, he should have played 2.Nf3, followed by 3.d4.",
        "2... d6": "However, I am going to continue with my defense.",
        "3. Qf3": "? This violates General Opening Principles because he brought his queen out too early.  However, I am not going to drive it away.  As I had mentioned in my last annotation, it can be harmful, if you become obsessed with chasing pieces.  For that reason, I am going to continue with my defense.  In addition, he has left his d4 pawn unprotected.  Therefore, I am going to win a free pawn, after 3...cxd4.",
        "3... cxd4 4. Bc4": "? I don't know why he played this.",
        "4... Nf6": "I made this move for development.  However, it is not the proper continuation of the Siclian Defense.  Therefore, 4...a6 would have been best.  ",
        "5. Bg5": "?! Why did he attack my knight?  He probably did this to use a, \"Scare Tactic\".  However, that is not going to overwhelm me because my knight is not pinned.  Therefore, he is not going to accomplish anything, if he wants to make me nervous.  ",
        "5... Bg4": "?! In the meantime, I decide to attack his queen, but what is my goal?  Well, I am attacking with two pieces.  Therefore, I will win a free pawn with my knight, if he does not retreat carefully.  BTW, I am not attempting tempo, but I am trying to win free material.  However, this does not guarantee victory, and it is a waste of time.  That will be explained shortly.",
        "6. Qb3": "!! He retreats wisely.  In fact, this was his best move, and I will explain it shortly.",
        "6... Nc6": "?? On a normal basis, I would this two exclamation points because I originally thought that he was threatening my rook.  However, I would still be able to protect it with this move, if Qxb7 was played.  On the other hand, this turns out to be a major blunder because he is going to place me in a very serious check, after 7.Bxf7+.  Therefore, I am going to loose my chance to castle, so my king will remain exposed throughout the entire.  In the past, I have lost several chess games, from this type of mistake.  That is why, 6...e6 would have been my best move.    ",
        "7. Bxf7+ Kd7 8. Qxb7+": "!! At this point, he takes advantage by deciding to place me in another serious check.  Why is this serious?  It is because he has won another free pawn, due to this check.  ",
        "8... Qc7": "This is forced.  I originally thought that I could protect, with my king, but that would be illegal.  Therefore, this is my only move.  Right now, things are looking very bad for black because he will win a free rook, after 9.Qxa8.  As a result, I will 6 points behind, instead of a point ahead.",
        "9. Qxa8 Qa5+": "!! Before he does any more damage I decide to place him in check.  This might look like a nuisance and a waste of time, but it is quite.  What is the significance of this move?  That will be answered shortly.",
        "10. c3": "This gets him out of check, but I am now going to win his DSB, after 10...Qxg5 due to my last move.  ",
        "10... Qxg5 11. Qb7+": "It might look serious because 11...Kd8 will be forced, but this is a nuisance check because I am protected by my knights and LSB.  On a normal basis, you would think that the game is almost lost for black.  However, white has made a serious game that will cost him the game.  That will be explained momentarily.     ",
        "11... Kd8 12. Qxc6": "?? He played this to win a free piece, but, \"almost anything is better than this move\", as chesskingdom64 would say.  In fact, \"this looses immediately\", as Mr. Stockel would say.  It turns out to be a deflective sacrifice because I now have an inevitable mating move.  Therefore, I will mate him in one, with 12...Qc1#.  That is, btw, why it is called Back Rank Mate.  Afterall, I am going to mate him, on the back rank.\r\n",
        "12... Qc1#": "In the past, chesskingdom64 has said that, \"What you do in the opening will affect you in the midgame; what you do in the midgame will affect you in the endgame; what you do in the endgame will the final results\".  Jack Stockel strongly agrees with this assessment.  He has said that it is very hard to catchup, if your opening is weak.  However, there are also times where you can play and/or end well, despite a weak opening.  That was shown, in this game.  IM i-have-arrived emphasized that in my thread about opening games.  Having said that, I would like to thank i-have-arrived for making this point.  By doing this, he has helped to make this annotation possible."
    },
    "url": "https://gameknot.com/annotation.pl/back-rank-mate?gm=44924",
    "gameName": "Back Rank Mate",
    "players": "slongstaff (1037) vs. jkarp (1069)",
    "opening": "Sicilian (B21), Smith-Morra gambit"
}