{
    "moves": {
        "1. e4": "Here's an interesting win from one of 4 games I've just finished against this opponent (two league, two tournament).  We finished 2-2 and this was the jammiest win:-)",
        "1... e5 2. Nf3 Nc6 3. Bb5 a6 4. Ba4 Bc5": "An interesting variation wherein Black's dsb adopts a more aggressive posture than in the Morphy Defence (4. ...Nf6, 5....d6, 6....Be7), aiming at White's vulnerable f2 square",
        "5. O-O Nf6 6. d3": "I adopt a conservative approach, supporting the e4 pawn with my d-pawn rather than with Re1, which leaves f2 poorly defended.  This approach makes White's normally slow Spanish Torture even slower.",
        "6... h6": "Presumably to prevent Bg5, a common enough prophylactic move in the Spanish.",
        "7. c3": "Creating an escape square for my lsb and preparing an eventual d4",
        "7... b5": "Standard approach to pushing White's B back and enabling development of Black's lsb to b7",
        "8. Bb3": "As usual, I don't retreat my B all the way until I have to.  From b3 this B repays the compliment by attacking f7.",
        "8... d6": "Creating other options for Black's lsb and freeing the Nc6 of its defensive duty in respect of e5.",
        "9. h3": "To prevent the annoying 9...Bg4 and create a hole for the K",
        "9... Be6": "Offering to exchange Bishops at the expense of doubled pawns in front of his K.  Such doubled pawns shouldn't be too weakening though because of the mobile d pawn and the resultant half-open f-file.",
        "10. Bxe6": "I decided to accept the exchange as I couldn't see much future for my lsb after 10. Bc2 and I didn't want to allow him to exchange on b3.",
        "10... fxe6 11. Re1": "Preparing to push the d-pawn, support the option of Be3 and create space for a potential knight manoeuvre Nbd2-f1-g3",
        "11... O-O 12. Nbd2 Nh5": "Interesting... It creates an opportunity for White to reveal an attack on h5 by moving his knight.  Exactly how to take advantage of this exercised my mind for a while.  As we shall see, I miscalculated.  I can't take advantage of the opportunity immediately because moving my knight also allows ...Bxf2+, now that Black's R occupies the f-file.",
        "13. Nb3": "Further preparation for d4",
        "13... Bb6 14. d4 exd4 15. Nfxd4": "Now I thought I could do it but ...",
        "15... Nxd4 16. Qxh5": "?  Missing the response.  I should have played 16. Nxd4",
        "16... Nc2": "winning the exchange",
        "17. Be3 Nxa1 18. Nxa1": "Now, objectively, White must be losing, the exchange down with no compensatory assets, especailly after Black's next move.",
        "18... Bxe3": "Exchanging down to accentuate the material advantage.",
        "19. Rxe3 d5 20. exd5 Qxd5": "Offering to exchange Queens with the same motivation",
        "21. Qg4": "White clings to a last chance: to deliver a mating attack on g7; also keeping d1 covered to avoid the fork of K and N and attacking e6 simultaneously.",
        "21... e5 22. Nc2": "White's least mobile piece seeks to join the party",
        "22... Rf4": "Black harries the Q",
        "23. Qg6": "allowing the check on d1 but still defending the N on c2 and maintaining pressure on g7.  I'm aiming for Rg3 next, followed by Ne3 and Nf5",
        "23... e4 24. Nd4": "As the defence of c2 had been cut off, I had to change my plan slightly",
        "24... c5 25. Ne6": "forking the R on f4 and the pawn on g7",
        "25... Rf7": "Black deals easily enough with those threats ...",
        "26. Rg3": "as planned ...",
        "26... Raa7": "Black has plenty enough defensive resources, it seems",
        "27. Qxh6": "exploiting the pin",
        "27... Rae7": "threatening the N",
        "28. Nf4": "in turn, threatening Black's Q and aiming for g6",
        "28... Qe5 29. Ng6": "Now the pawn on g7 is no longer pinned but Black's Q and Ne7 are forked and mate is threatened on h8",
        "29... Rf6": "a curious response ...",
        "30. Qh8+ Kf7 31. Nxe5+ Rxe5 32. Qxg7+ Ke6 33. Rg6": "and Black had had enough"
    },
    "url": "https://gameknot.com/annotation.pl/back-from-the-dead?gm=23783",
    "gameName": "Back from the dead",
    "players": "rjacobs (1518) vs. yasur (1486)",
    "opening": "Ruy Lopez (C70), Classical defence deferred"
}