{
    "moves": {
        "1. e4": "This was an interesting game, where my opponent made one noticeable mistake, which- I am proud to say- I was able to capitalize on.  The main story in Batman: The Dark Knight is the Joker wants to kill Batman, so to I want to eliminate the Dark Knights (coincidentally, not planned).",
        "1... e5 2. Nf3 Nc6 3. Bb5": "Ruy Lopez",
        "3... Nf6 4. O-O Bc5": "Pretty straight forward still.",
        "5. c3 O-O 6. d4": "I decided to go ahead and test the center.",
        "6... exd4 7. cxd4 Bb6 8. e5 Nd5 9. Bc4 Nce7": "I think Nde7 would have been better here.",
        "10. Bg5": "Now he has some serious defending to do and will wind up a pawn down.",
        "10... c6": "There were other options here, but I don't know that the results would change, possibly Nb4.",
        "11. Qb3": "I felt this was a good in order to continue pressure on the center as well as create a line toward blacks king.",
        "11... d6": "This works to my advantage and I gain a pawn.",
        "12. Bxd5": "He must take with the pawn or lose the Queen.",
        "12... cxd5 13. Bxe7 Qxe7 14. Qxd5": "Now I am up a pawn, although he does have two bishops versus my knights.",
        "14... Be6 15. exd6": "exd6, this was the important move in my opinion.  I'm volunteering to trade queens in order to advance my pawn.  After I made this move though, I discovered it may have been a mistake because of Bxd5, pxe7, Re8, Re1, Be6, etc.",
        "15... Qd7": "He didn't accept.",
        "16. Qe5": "I could've offered another trade with Ne5, but I didn't like the prospects from that trade, except that I could've taken another piece off of the board.  Maybe I should have.",
        "16... f6 17. Qf4 Rac8 18. Nc3 Rcd8": "I think this move should've been played before.  Why Rac8 and not Rad8?",
        "19. d5 Bf7 20. Nd4 Bxd4": "I offered the Knight, and he accepts.  It gains a pawn back for him, but it allows me to stack for my attack.",
        "21. Qxd4 Qxd6 22. Rad1": "Stacking begins.  He should do the same, but the threat of my Knight scared him away I guess so he moves...",
        "22... a6": "a6",
        "23. Rd3": "Operation Stack Attack, by the way anyone ever had a Stack Attack from Wendy's?  Delicious.  It used to be the Double Stack, but now it's Stack Attack.  Good Value though.  I have officially coined a fast food phrase for Chess, so send all royalties to ralbama1.",
        "23... Rfe8 24. Rfd1 Qe7": "This was the losing move.  My opponent joked after my next move, \"just wanted to make sure you were paying attention.\"  Well I was.",
        "25. h3 Qd6": "This is where he made the joke.  Too late, I can now begin \"Operation Sacrifice Knight to win Queen with Rook\" or for those who have seen the latest Batman movie.  \"Operation Harvey Dent.\"",
        "26. Ne4": "Two Face Harvey.",
        "26... Qxd5": "Danger.",
        "27. Nxf6+ gxf6 28. Qg4+": "And I have the queen or I have both rooks.",
        "28... Kf8": "He wants the rooks, and I don't blame him.",
        "29. Rd3xd5 Bxd5 30. Qf5 Bc6": "He's lost by now.",
        "31. Qxf6+ Kg8 32. Rxd8 Rxd8 33. Qxd8+ Kg7 34. g4 Kg6 35. f4": "And resignation.  Anyway, good game, and Stack Attack with White Knight Harvey Dent was the winning combo."
    },
    "url": "https://gameknot.com/annotation.pl/batman-the-dark-knight-spoiler?gm=17573",
    "gameName": "Batman: The Dark Knight Spoiler",
    "players": "ralbama1 (1561) vs. GK NN (1542)",
    "opening": "Ruy Lopez (C65), Berlin defence, Beverwijk variation"
}