{
    "moves": {
        "1. c4 Nf6": "The most flexible reply to white's initial move. With this move black invites white to repent from his evil ways and transpose to a d4 Indian opening. Many white players may comply if black presents them with enough evidence that the Indian opening black has in mind is neither the Gruenfeld or the Benoni/Benko.  ",
        "2. Nc3 g6 3. e4 d6 4. g3": "Black has kept his part of the deal by adopting a King's Indian setup, and here white could transpose directly to the King's Indian with 4. d4. Instead white insists on pushing for an English opening... something he will soon come to regret. ",
        "4... Bg7 5. Bg2 O-O 6. Nge2": "This move reveals white's intentions. White could have (and maybe should have!) transposed to a King's Indian with 6. d4, but instead he is planning to play the Botvinnik system of the English opening, which involves developing this knight to e2 and then play d3. ",
        "6... c5": "Best. The Botvinnik system is intended to face a King's Indian setup where black instead plays 6...e5, and white can obtain very good results with it. Instead, the move chosen by black gives white a much tougher time . Black clearly had access to a good database!",
        "7. d3": "And here we have it, the Botvinnik system. On a first impression it seems that white has been smoking something he shouldn't have. He has locked up his g2 bishop behind his own pawns, has developed his King's knight to a less forceful position than f3, and now, on top of that, he has made a horrible hole in d4 for his opponent to exploit. But there's method to this madness. The idea of the Botvinnik setup is that, in exchange for all this, the center is now completely locked. Since black cannot hit back in the center with this setup, white intends to begin simultaneous offensives in the two flanks.  His plan is that he will be able to get to the black king and/or penetrate the queenside before black can take advantage of white's weaknesses. Against unprepared opposition, this plan very often gives excellent results. My opponent, however, was not in this category...",
        "7... Nc6 8. O-O a6 9. h3": "A move worth playing in the Botvinnik setup, since the pin that comes with Bg4 will distract white from his intended goals. ",
        "9... Rb8 10. a4 Nd7": "All the previous moves are book moves; white makes the final preparations for the flank offensives, while black decides he will first counter-strike in the queenside. The battle on all fronts has begun!",
        "11. Kh1": "One more move in preparation for what's to come. Alternatively white can begin the offensive in the Queenside with 11. Rb1 Nd4 12. b4 cxb4 13. Rxb4; instead 11. Kh1 anticipates that white will be playing f4 very soon. This is an important move because once white plays f4 and the battle is in full swing, disaster will often result if white's king is caught with his pants down with a check along the g1-a7 diagonal.",
        "11... f5": "And here black decides to innovate with what I consider an excellent move. The correct plan when playing against the Botvinnik setup is to fight fire with fire, that is, to begin offensives in both flanks. The alternative is to delay the kingside offensive for a bit with 11... Nd4 12. f4 e6 13. Rb1 f5. I must admit I was already beging to feel uneasy at this point... ",
        "12. f4 fxe4 13. dxe4 Nb6 14. Be3": "Black cannot play 14... Nxc4?? because of 15. Qd5 , winning the knight. However, on a hindsight it would probably have been better to play 14. b3, with the intention of developing the dark-squared bishop via b2 and not leaving the a1-h8 diagonal under control of black's dark squared bishop. As we will soon see, in the following moves black's bishop becomes a formidable weapon on account of its unchallenged control of this diagonal. ",
        "14... Kh8 15. b3 Be6 16. Rc1": "Already white is beginning to regret his decision in move 14. Black's dark-squared bishop has started to put enormous pressure on the a1-h8 diagonal, and white decides he better get his rook out of the bishop's scope as soon as possible. This is no small thing. With this move he not only gives up on a potential queenside offensive: now that the rook has left a1 black will begin a queenside offensive himself!",
        "16... Nd7": "Excellent move: black wastes no time and prepares to take over the queenside with b5. My sense is that, at the very least, black has now fully equalized.  ",
        "17. Nd5 b5 18. axb5 axb5 19. Rb1": "After 15. cxb5? Rxb5 white's b3 pawn would become a permanent target for black's rooks. White has become aware that black is about to seize the initiative in the queenside and deploys his rook to prevent invasion via the b-file. Still, black will now create a weak pawn for him in c4 that will be under serious pressure from his light-squared bishop in e6.",
        "19... bxc4 20. bxc4 Nb4": "Black's position is already superb at this point. From here on he can just take his time and prepare to double his major pieces on the b or a files; white can do nothing to prevent this since black's dark-squared bishop controls the a1 and b2 squares that white would need to occupy with his rook in order to prevent an eventual invasion of his queenside.",
        "21. g4": "Mostly just a bluff; white threatens 21. f5, but this threat can easily be taken care of with 21... Bg8 which is what black plays. After 21... Bg8, white can't really advance his f-pawn any further, because doing so will provide black's d7 knight with a perfect outpost in e5.",
        "21... Bg8 22. Qd2 Qa5": "An excellent move, with which black starts to take complete control of the queenside; white can't play 23. Nxe7, since his position will simply collapse after 23... Bxc4, with both black bishops now having full scope on the queenside. Black's position is phenomenal. I submitted this game to post-mortem analysis in Fritz 10, and it considered that black had made the very best moves since move 12!",
        "23. Rfc1": "With this move white gives up on a possible kingside attack, but there's little else to recommend, since white will simply be demolished if black ever gets to play Bxc4. ",
        "23... Rf7": "And just when black is in complete control of the game, a terrible blunder. With this move, black's light-squared bishop (which was exerting enormous indirect pressure on white's weak c-pawn) is suddenly left out of the game, and on top of that, black's rooks are suddenly left disconnected. Fritz recommends 23... Nb6!. White of course cannot then play 24. Nxe7? since he will not survive after 24... Bxc4!. But even more so, he cannot play 24. Nxb4? either, since 24...Nxc4! 25. Qd3 Rxb4 will simply kill him because of the massive onslaught in the queenside. White thus would have no choice other than 24. Bf1, which reduces him to critical passivity. It's almost unfair that, after the text move, black's excellent position simply collapses. ",
        "24. Nec3": "Fritz noted that here I missed a much stronger option, 24. Nxb4! Rxb4 25. e5, where the threat of 26. e6 forces black to lose material. ",
        "24... Nxd5 25. Nxd5": "Forced but forceful. Maybe black was expecting white to play 25. exd5?? putting and end to the vulnerability of his c4 pawn and winning both more space and a strong control of the crucial e6 square, but white would then lose a piece after 25... Bxc3 26. Qxc3 Qxc3 27. Rxc3 Rxb1 (or even 25... Rxb1 26. Rxb1 Bxc3). Once again all this is due to the fact that black's dark-squared bishop is stronger in this position than any other piece except the queen! But after 25. Nxd5 black's once overwheliming pressure is suddenly entirely dispelled since he is forced to change his active major pieces.",
        "25... Qxd2 26. Bxd2 Rxb1": "White will now be in control of the b-file (which black has controlled throughout the game), but there was nothing black could do to prevent this, since 26...Rf8? 29. Nxe7, or 26... Bf6 27. Rxb8 Nxb8 28. Rb1. The disastrous consequences of disconnecting his rooks with 23. Rf7? can be plainly seen at this point, where the tables have turned completely and white is now in control of the queen-side. ",
        "27. Rxb1 Bf6": "Black's position is miserable, with all his pieces suddenly pushed against the edge of the board and having to wait for white to invade with Rb7. In anticipation of 28. Rb7 and the pressure the white rook will exert against his e7 pawn, black gets his bishop out of the jam into a position where it can support this pawn, and at the same time tempts white to relieve the pressure in exchange for the bishop pair with 28. Nxf6(?). But 27... Bf6? is a serious mistake, as it allows white to win material in an already critical position. Fritz recommends 27... h6, but I actually think that 27... e5, clearing the e-pawn from its vulnerable square and giving black some space to breath, was much better.",
        "28. Rb7 e6": "Black fails to see that the primary target of 28. Rb7 is not really the e-pawn. The only alternative was 28... Nf8, although after 29. g5 Bd4 30. Nxe7 Rg7 31. Rc7 black would be fighting an uphill battle for a draw. Now, with the text move, white wins a piece. ",
        "29. Nxf6 Nxf6 30. Rxf7 Bxf7 31. Bc3": "This is how black loses a piece; if 31... Kg7 then 32. g5, or if 31... e5 then 32. fxe5 Ne8 33. e6 , winning black's bishop with the discovered check. It is a cruel irony indeed that black had complete control of the a1-h8 diagonal throughout all of the game but loses as soon as white takes over it. Black resigns."
    },
    "url": "https://gameknot.com/annotation.pl/battle-on-all-fronts?gm=12008",
    "gameName": "Battle on all fronts",
    "players": "rogubravo (1677) vs. lm3ut (1649)",
    "opening": "English opening (A16)"
}