{
    "moves": {
        "1. d4": "White opens with the Queen's pawn opening. My favorite with White as well",
        "1... d5": "I'm a strict believer that 1...d5 is better than the popular 1...Nf6",
        "2. c4": "Queen's Gambit. The most logical following of the first move",
        "2... e6": "Queen's gambit declined. I like playing this from both sides",
        "3. Nc3 Nf6 4. e3": "It probably isn't best to lock the bishop in this position as it belongs on g5.",
        "4... Bb4": "Black pins the Knight. I felt that I don't need to stick my bishop on e7 as White has no intentions of placing the Bishop on g5.",
        "5. Bd2": "Only place for the Bishop",
        "5... O-O 6. Nf3 b6": "I like to Fianchetto the Bishop in the QGD.",
        "7. Be2": "I put the Bishop on d3 but it's a matter of preference. I just feel that White hasn't really challenged Black with this opening",
        "7... Bb7 8. O-O Nbd7": "? The Knight can certainly be placed on d7 but not in this situation",
        "9. Qc2": "? A mistake in return. White misses 9. Nxd5! 9...Nxd5 is forced (9...Bxd2 10. Nxf6+ followed by 11. Qxd2) 10. cxd5 Bxd2 11.dxe6 Bxe3 12. exf7+ Rxf7 13. fxe3 wins a pawn",
        "9... Bxc3 10. Bxc3 Ne4": "The Knight goes to its most active post",
        "11. b3 Ndf6": "Backing up his fellow comrade",
        "12. Bb2 Rc8": "I feel Black has least equalized here.",
        "13. Bd3": "Challenging the Knight and going where it probably should've gone on move 7",
        "13... dxc4": "Opening up some lines for my Bishop on b7",
        "14. bxc4 c5": "Theoretical break for the Black side. ",
        "15. Nd2": "The Knight must now be moved",
        "15... Nxd2 16. Qxd2 Re8": "Prepping for a future 16...e5",
        "17. Rfe1 cxd4 18. exd4": "White now has \"hanging pawns\" on c4 and d4. These pawns are certainly not bad but White should not trade down because their weakness will be exposed",
        "18... Qd6": "Connecting the rooks. 18...Qxd4? would allow 19. Bxh7+!",
        "19. a4": "White threatens 20. a5 which would open a line for his rook and give Black an isolated pawn on the Queenside",
        "19... a5": "I need not worry about the outpost on b5 because White does not have a Knight",
        "20. Ba3 Qd7 21. Rab1": "White wants to trade which is favorable for Black. This will expose the hanging pawns a little more",
        "21... Qxa4 22. Rxb6 Qxa3 23. Rxb7 Red8": "Centralizing the other rook and giving it something to look forward to. Notice how both my rooks are aimed at the pawns.",
        "24. Rbb1 Qd6": "The Queen steps back and now 25...Qxd6 becomes a legitimate threat",
        "25. Red1": "Still wanting to use the same trap",
        "25... Kh8": "Finally getting rid of the annoying Bxh7+ nonsense",
        "26. Qxa5": "Black should not worry because he will win back the d4 pawn",
        "26... Rca8": "Attacking the queen with tempo",
        "27. c5": "?! White now isolates the d4 pawn AND trades down, further exposing it. This changes the tide of the game",
        "27... Rxa5 28. cxd6 Rd5": "White still has a trap! 28...Rxd6?? 29. Rb8+ with mate to follow",
        "29. Bc4 Rd5xd6 30. Rb7 Kg8": "That d4 pawn sticks his tounge out and says \"Na-na-na-boo-boo you can't take me!\" which still aggravates Black. The King defends the f7 pawn from attack",
        "31. f3 g6": "Finally! No more traps can be set by White. The d4 pawn's triumphant teasing will end",
        "32. Kf2 Rd6xd4 33. Rxd4 Rxd4": "This is far from a winning endgame but Black has all the winning chances",
        "34. Be2 Kg7 35. Ke3 Ra4": "I don't want the king to make it past the 3rd rank",
        "36. g4": "? Honestly it's hard to suggest an alternative but this makes Black's life so much easier",
        "36... Nd5+": "Kicking the King back",
        "37. Kf2 Ra2": "Pin! White must respond to the threat of 38...Nc3, winning the Bishop",
        "38. Kf1 Ne3+": "38...Nc3 or Nf4 would be simpler",
        "39. Kf2": "39. Ke1 Nc2+ followed by 40...Nd4 will still win a pawn",
        "39... Nd1+ 40. Ke1 Nc3": "White is now forced to move the Bishop",
        "41. Bc4 Rxh2": "Black can probably win this endgame if he used good technique",
        "42. Bxe6": "?? This allows...",
        "42... Re2+": "Winning the Bishop. White resigns"
    },
    "url": "https://gameknot.com/annotation.pl/battle-of-the-young-guns?gm=39982",
    "gameName": "Battle of the Young Guns",
    "players": "sonata296 (1569) vs. rookie879 (1510)",
    "opening": "QGD (D35), 3...Nf6"
}