{
    "moves": {
        "1. e3 e5 2. e4": "INCREDIBLE! White is Black! It's the reverse Michael Jackson Opening.\nJúpiter makes an incredible naughty move, making Baco start thinking about racism.",
        "2... Qf6": "There it is! The queen is Wonderfull! The game now has transposed to a very wide known variation of \"the Greco Way of life Defense\". ",
        "3. f4 exf4": "Jupiter for a moment got scared and started seeing nothing but shadows. But soon he understood the position was not bad at all for him, as he played the following move ",
        "4. d4": "Baco is know throwing beer on some girls t-shirts while he has fun with his majestic and dog-like Staff that he uses to make the girls happier with his magical powers. \"The game seems won for me\", says baco while he performs acts of disputable reputation on his new met friends.",
        "4... Qh4+": "Jupíter is now thinking about the new fragrance for men from Axe. Buy it. buy it buy it.\n\nOk, some guys paid me to do this one, so its ok, im the smart one.",
        "5. g3": "WTC (if you are over eighteen you should know that WTC means \"What The Crapt\" without the t). Jupiter was running wild one the board!",
        "5... fxg3 6. h3": "Our party-boy Baco was now feeling very tired, mainly because he was also naked and drunk while covered in diferent liquids of diferent origins. So he thought the game was one for him and thought there was nothing jupiter could do.",
        "6... g2+": "Pain. Suffering. In the clash of titans, it seems that jupiter is dead. Lets pray for a miracle.",
        "7. Kd2 gxh1=Q": "\"Give me a queen, and i will kill you three kings\", said once a person who says vague things. Baco knew it was necessary to keep the queens for his personal use after the game. The bohemian gods would not let the hard-fighting queens over the board to spend the night alone after things were done. ",
        "8. Be2": "So in this move Jupiter sees Bacos main weakness: his hoes. He prepares than an attack that would hardly harm anyone.",
        "8... Na6": "This move makes the game crazy. Black is winning the game after understanding many socially relevant things about the usage of deformed bacons as ways to become friends with your neighboors cat.",
        "9. Nf3": "Jupiter is mad and angry. Baco was twisting the nature of the situation with his mischiveous ways, but now he played the move that was later on considered the most brave move in the history of chess.",
        "9... h6": "Baco was trully in panic; someone was gonna bang his hoes. He had put that little pawn in the h6 square in order to get sober acording to the most lucid analysys.",
        "10. Nxh4": "Bang. Bang. The knight got his hoes. One of them at least.\nBaco is desperate, he cannot accept the fact that he can´t have a menage a trois anymore, because using any of the remaining peaces would sound really awkward.",
        "10... Qxd1+": "Baco decides he is gonna count on his five fingers tonight. Exchange is necessary to keep the advantage.",
        "11. Kxd1 Nf6": "this move was made out of pressure. black thought he should do something active",
        "12. e5 Ne4 13. Be3 d6 14. Bd3 Ng3 15. Nc3 dxe5 16. dxe5": "The game keeps going, Baco misses his hoes.",
        "16... Be7 17. Nf5 Nxf5 18. Bxf5 g6 19. Bg4 h5 20. Bf3 Bd7 21. Ke2": "OMG. Júpiter is running wild.",
        "21... Bb4": "exchanges are good! he thinks.",
        "22. Nd5 Bc5 23. Bxc5 Nxc5 24. Nxc7+ Kd8 25. Nxa8": "Baco was defeated. Jupiters persistance and knowledge about baco's psicology and how much he was drunk saved him the day.",
        "25... Kc8": "im gonna take that naughty knight and punish him for being naughty, thought baco as he expressed his most disturbing fantasy's on a public anottation.",
        "26. Rd1 Kb8 27. b4": "baco thinks for 45 minutes here.he plays the following line",
        "27... Kxa8 28. bxc5 Bb5+ 29. Ke3": "now baco has a headache, he drank too much and the situation is unclear. especially about his stomach.",
        "29... Re8": "Im gonna kill your bloddy pawns, says baco in a fury roar.",
        "30. c3 Rxe5+ 31. Kf4 Rxc5": "Now Jupiter cashes in the prize for his persistance and luck for playing against a drunk sexholic who was worshipped for some reason nobody will ever fully understand. Baco's flaw of character seems to be the biggest flaw in here.",
        "32. Rd8+": "Baco resigns, the game now is a living proof of the blunders some fanfarronistics friends have made when playing against each other in the skys of ancient greece.",
        "32... Rc8": ""
    },
    "url": "https://gameknot.com/annotation.pl/battle-between-gods?gm=27469",
    "gameName": "Battle between gods",
    "players": "Jupiter (4) vs. Baco (-1)",
    "opening": "Amsterdam attack (A00)"
}