{
    "moves": {
        "1. e4 c5 2. Nc3 Nc6 3. g3 g6 4. Bg2 Bg7 5. d3": "Closing the Sicilian. Back in the days before I became almost exclusively an English player as White, I loved playing the the Closed Sicilian.",
        "5... Nf6 6. h3": "More challenging (and more book) immediately is 6. f4, swallowing up a ton of space on the K-side and setting the table for the stereotyped strategies to follow, with White playing a positional game based on space control and a K-side build-up as Black tries vigorously to break White in the center and on the Q-side, even if it's at the cost of a little material. Playing cautiously in the Closed means Black will often drift into a cramped and passive position; tactical energy and nerves of ice are called for, and Black must be willing to risk an attack by White to get his fair share of the position.",
        "6... d6 7. Be3 Bd7 8. Nge2": "White builds his position in the classical way for this opening.",
        "8... O-O 9. Qd2 Ne8": "I consistently borrow this idea from the Kings Indian when I play the English as White (especially in my pet Nimzovich-Flohr variation), and in the Closed Sicilian as Black. Here, the steed is heading for c7 (or c2 in the English) where it will buttress the center and stand poised to assist in a Q-side counter-attack.",
        "10. Bh6 Qc8": "One good h-file sortie deserves another. The text dissuades White from castling right away. As we'll see, it dissuades him from castling toward his KR at all ...and White always wants to castle on the K-side in the Closed variation because Black's counter-attack always roars up the Q-side.",
        "11. Nd5 e6 12. Bxg7 Kxg7 13. Qc3+ f6 14. Ndf4 b5": "Here we go! This is the point at which I had to make the decision that would color the rest of my game: play energetically, or passively? ...There's only one answer for me.",
        "15. h4 b4": "White could have played pawn to a3 on his last move, and probably should have. Too late now!",
        "16. Qd2 Nc7 17. h5 g5 18. h6+": "! Nice! White means to have h5 for his Knight, with pressure on Black's K-side.",
        "18... Kf7": "!? I was forseeing a need to run my King to the other side of the board. 18. ...Kh8 just set off my \"spider-sense\" a little too much, although it's probably fine strategically.",
        "19. Nh5 Ne8 20. f4 g4": "No credit for anything else. 20. ...gf4 opens the floodgates for White after either Nf4 or, even better, gf4.",
        "21. e5 dxe5 22. fxe5 Nxe5": "! Black looks hard at the position and decides the roll of the dice is justified. This Exchange sac is a deliberate positional sacrifice: Black will gain a tempo by reattacking White's KR, and the huge hole at f3 beckons the Black Knight like a lover. The timing of everything in Black's game from now on must be Swiss-accurate.",
        "23. Bxa8 Qxa8 24. O-O-O Bc6": "Forcing the Rook to move now.",
        "25. Rhf1 Nf3 26. Qf4 f5": "Black walks a razor's edge, but for the moment everything is holding. White has to *prove* he can win this.",
        "27. d4 c4 28. d5": "White speculates a pawn in the hope of ripping open a center file for his attack.",
        "28... Bxd5 29. Nd4 Be4": "Black is threatening to add his a-pawn to the storm glowering on the Q-side's horizon.",
        "30. Ng7 e5": "! Driving White's Queen from pillar to post!",
        "31. Qe3 Nxg7": "! Not 31. ...ed4??, giving White the open lines he desperately needs. But the text once more forces Black to stand at the edge and look into the Abyss. ...Remember what I said about needing nerves of ice?",
        "32. hxg7 Rd8 33. Nxf3 Rxd1+": "...Remember what I said about needing nerves of ice?",
        "34. Rxd1 gxf3": "Now Black has a pawn within Queening distance - *if* he can survive White's attack!",
        "35. Rd7+ Kg6 36. Rxa7 Qc8": "To stop Ra6+.",
        "37. Qb6+ Kg5 38. Rc7 Qd8 39. Qe6 Bd5 40. Qxe5 b3": "! Black continues to play for more than a draw! It's amazing that White can't find a way to convert his advanced g-pawn.",
        "41. axb3 cxb3 42. Qf4+ Kg6 43. c3 Bf7": "The text sets the stage for the capture of Whit's threat on g7; but there's a devious positional trap lurking within the obvious intent.",
        "44. Qe5": "?! He missed it.",
        "44... Qd3": "Black threatens mate on the move. Now White has to force a trade of Queens, weave his own mating attack, or lose outright. ----- Water123 says here that White can force mate by playing 45. g8=Q!, and he's absolutely right. Both players in the game missed it, probably because it's not the easiest mate to spot when you have under a minute on your clock; but it's there, forced every inch of the way. The full sequence goes 45. g8+Q! Bg8  46. Rg7 Kh5 (Kh6 is mate after 47. Qf6 Kh5  48. Qg5)  47. g4! Kh4  48. Qh2 mate.",
        "45. Rc6+ Kh5 46. g4+ Kg5": "This move is safe. White has no time for 47. Qe7 Kg4  48. Qf7 Qc2 mate!",
        "47. g8=Q+": "White realizes he just won't be able to promote his pawn, so he jettisons it.",
        "47... Bxg8 48. Qf6+ Kf4": "! Slippery as an eel!",
        "49. Qh6+ Kg3": "! Excuse me ... slipperier than an eel!",
        "50. Qd6+ Qxd6 51. Rxd6 f2 52. Rd1 Kg2 53. gxf5 f1=Q 54. Rxf1 Kxf1 55. Kd2": "It won't help. Black's cleric is on the perfect diagonal: it holds *everything.*",
        "55... h5 56. Ke3 Kg2 57. Kf4 h4": "Black will get a new Queen, so White resigned. *THAT* was a fun game, boys and girls!"
    },
    "url": "https://gameknot.com/annotation.pl/batter-up-closed-sicilian-blitz-game?gm=45288",
    "gameName": "Batter Up! -- Closed Sicilian (Blitz Game)",
    "players": "bob-cat (1992) vs. Avocet (1200)",
    "opening": "Sicilian (B24), closed, Smyslov variation"
}