{
    "moves": {
        "1. e4": "So begins Round 3 of the Battle of the Annotators, phishbone6984 vs fatcat2.",
        "1... Nf6": "I play Alekhine's Defence, a daring choice for me as I gave it up some months ago. Black attempts to entice White's pawns forward and weaken them while doing so. I chose the French Defence in Round 2, and I wanted a change, so I went for this defence.",
        "2. e5 Nd5": "The only feasible square for the knight. After 2...Ne4? it is being kicked around the board.",
        "3. c4": "This is generally considered inferior to 3.d4, as consolidating White's pawn formation is preferred to attacking Black's knight once again. Often 3.d4 d6 and THEN 4.c4 as White's central pawn formation has been strengthened.",
        "3... Nb6 4. d4 d6": "A common move in Alekhine's Defence, challenging White's advanced e-pawn.",
        "5. f4": "This position has more or less transposed into the Four Pawns Attack of Alekhine's Defence, after 3.d4 d6 4.c4 Nb6 5.f4. White is trying to maintain his e-pawn in the centre.",
        "5... dxe5 6. fxe5 Nc6": "Black proceeds with his plan. The White's hopefully over-extended central pawns can now be undermined by cunning long-range bombardment from Black's knights.",
        "7. Be3": "White starts committing pieces to his pawns' defence - all part of Black's plan, of course :-).",
        "7... Bf5": "Perhaps 7...Be6, attacking White's impertinent c-pawn, would have been stronger, but I decided against it as it has less freedom on e6 and blocks Black's e-pawn.",
        "8. Nc3 e6 9. a3": "Restraining Black's dark-squared bishop.",
        "9... Be7 10. Bd3 Bg5": "This was the last move in GameKnot's database. \"From now on,\" I told myself grimly,\"I'm on my own.\" But I saw some interesting opportunities after the light-squared bishops are exchanged off and I might be able to pick off White's c-pawn.",
        "11. Bxg5 Qxg5 12. Bxf5": "Here I considered 12...Qxg2, but I decided against it in favour of the less risky option.",
        "12... exf5": "Off go all the bishops.",
        "13. Nf3": "Curses! He has spotted my cunning plan!",
        "13... Qxg2 14. Rg1 Qxb2": "I can still pick off pawns where I can though.",
        "15. Nb5 O-O-O 16. c5": "Loses him another pawn.",
        "16... Qxb5 17. cxb6 Qxb6 18. Rxg7 Rd7 19. d5 Na5 20. Ng5 Qg1+ 21. Ke2 Qxh2+": "I thought of simplifying by exchanging queens, but decided in favour of the extra pawn. Besides, if I had exchanged queens, the following fork would not have happened.",
        "22. Ke1 Qxe5+": "Faced with the loss of the rook as well as four pawns, White resigns. It's 2-1 to me, phishbone6984...better luck next time..."
    },
    "url": "https://gameknot.com/annotation.pl/battle-of-the-annotators-rd-3?gm=20957",
    "gameName": "Battle of the Annotators Rd. 3",
    "players": "phishbone6984 (1343) vs. fatcat2 (1376)",
    "opening": "Alekhine's defence (B02), Steiner variation"
}