{
    "moves": {
        "1. e4": "\"A logical and sound move to start the game, grabbing central space and opening lines for quick developement of the Bf1 and queen. Other pawn pushes with no real drawbacks include 1. d4 and 1. c4. And for our hypermodern players, there is always 1. Nf3, controlling the center with pieces and not commiting to a set pawn structure. \"\nMorphy one and only true love, his confidence never wavered with the best move \"best by Test\" Bobby Fischer. ",
        "1... e5": "This is so White can't create a huge pawn centre unnopposed.",
        "2. Nf3": "Developing a knight to its best square, attacking the pawn, \ncontrolling two center squares.",
        "2... Nc6": "The best move to defend. Also attacks two squares and develops \na piece.",
        "3. Bc4": "The Italian game. An old opening that is now thought to be rather dull and boring. Black now has two main options here 3....Bc5 the Giuoco Piano or 3... Nf6 The Two Knight's Defence. The Italian game can evolve into the romantic Evans Gambit if 3...Bc5 then 4. b4!?",
        "3... Bc5": "The Guicco Piano. This is less agressive than the Two Knight's defence. Moprhy now has the chance to play his and my fave as I have already mentioned, the Evan's Gambit 4.b4!?",
        "4. b4": "This the move that signals the beginning of the Evans.  White sacrifices a pawn for center control and a kingside Initiative with a quick attack on the Black king which will hopefully end in mate. Most  gambits like these give White an early initiative, however  if Black can defend accurately, he stands better in the ensuing endgame, with plenty of chances for a win. When people tell me this I simply reply \" I don't give a crap, I don't plan letting Black get into an endgame position anyway. Lol.\"",
        "4... Bxb4": "It is often said that the way to refute a gambit is to accept it. Black grabs a pawn so as to have the option of uploading it in a later stage in the game in order to neutralize whites resulting initiative. This is atleast what Black  is meant to try and do!",
        "5. c3": "This is the plan of giving away the b4 pawn to gain tempo by forcing black to move his bishop repetitively while he gains  momentum in the centre. ",
        "5... Bc5": "Retreating to a powerful square that won't be his for long because of the oncoming 6.d4! Better would have been 5... Ba5",
        "6. d4": "Grabbing the pawn center, unleashing the dark squared bishop, and attacking the c5 bishop all with one move. Remember the best moves accomplish multiple goals or hit multiple targets",
        "6... exd4": "An exchange in the centre.",
        "7. cxd4 Bb6": "Keeping the pressure on the d-pawn. However it is obvios that White has the edge in this positiion.",
        "8. O-O": "Castliing is not only a defensive move, but also an offensive move. Notice that now the f rook is in the game, and surely will be moving to the powerful and \nopen e-file soon.",
        "8... Na5": "Moving the knight to an inferior square where it no longer attacks the center.",
        "9. Bd3": "Not wanting to trade that good bishop for that half-knight stranded passively on the side of the board where it will find it hard to affect the game.",
        "9... d5": "With the bishop gone, black is able to challenge white's awesome pawn center. Not a bad idea although flawed because it gives Paul the opportunity to open the e-file.",
        "10. exd5": "Luring the queen out early. Not good for Paul's Dad!",
        "10... Qxd5": "Bringing the queen out early is very dangerous, because white can attack it with his developing pieces, there are no other options though if he wants to regain the material deficit.",
        "11. Ba3": "Developing the bishop to a powerful square where it will prevent black from castling, pressure the critical squares around the king, and pin the king to the middle of the board,, sometimes in the Evan's Gambit Black play the pawn move d7-d8 but oh woops Blacks excanged all his central pawns while his King is stuck in the centre.",
        "11... Be6": "White finds it necessary to block the critical e-file since it is obvious white rook will be coming to town with R-e1.",
        "12. Nc3": "! White develops with a threat!",
        "12... Qd7": "Black does not go all the way back because he hopes to castle queenside since castling kingside is out of the question because of the a3 bishop.",
        "13. d5": "A pawn sacrifice which clears the e-file for an attack on the king.",
        "13... Bxd5": "Black accepts the 'free' pawn.",
        "14. Nxd5": "White wants to trade this bishop off because it is black's critical defender.",
        "14... Qxd5 15. Bb5+": "! A piece sacrifice, typical Morphy! The reason for this move is to clear the d-file for white's queen so the king can't run out of the center.",
        "15... Qxb5": "Notice that black had no other option without losing the queen. Do you see why?",
        "16. Re1+": "Finally the file grabbing move!",
        "16... Ne7": "Another file grabbing move. ",
        "17. Rb1 Qa6 18. Rxe7+": "Here comes the powerful blow....",
        "18... Kf8 19. Qd5": "Threatening checkmate.",
        "19... Qc4": "Paul's Uncle is now  clinging onto straws.",
        "20. Rxf7+ Kg8 21. Rf8#": "CHECK AND MATE! This shows Morphy was always was a big one for development( just look at all the other games by Morphy I have annotated.!). Perhaps the first chess player to stress the need to develop before you attack... He just simply annihilated all the competition in his time. I believe that he was the greatest player of all time, his genius goes along with Capablanca, Alekhine, Fischer, and Tal. I hope you liked this game. I hope you liked this game. I'm happy for positive and negative feedback aslong as its constructive criticism! and feel free to leave comments. One thing I would like you to do is before you rate this game please think honestly and think how I can improve on it and leave comments and PM me with them. Don't just give one and a half stars and not tell me why leave a comment or PM.\nThanks\nTom\n"
    },
    "url": "https://gameknot.com/annotation.pl/beaten-by-your-son-how-embarrasing?gm=7240",
    "gameName": "Beaten by your son \"HOW EMBARRASING!\"",
    "players": "Paul Morphy  vs. Alonzo morphy ",
    "opening": "Evans gambit (C51), normal variation"
}