{
    "moves": {
        "1. e4 e5 2. f4": "King's Gambit...\n",
        "2... exf4": "Accepted\n",
        "3. Nf3 d6 4. Nc3 Be7": "Normal development so far, but Buck's influence on the d8-h4 diagonal and the g3 square means that Bh4+ is threatened.\n",
        "5. Bc4": "!? Does Ohman not see that? Actually, this isn't unusual in the King's Gambit - 1.e4 e5 2.f4 exf4 3.Bc4!? - this position is more of a variation of that opening, with Black giving check with the bishop and a White knight on f3\n",
        "5... Bh4+ 6. g3": "A strange gambit which seems to serve only to expose Ohman's king - I'm fairly certain that no-one reading this annotation would have seen this move. 6.Kf1 and 6.Nxh4 are alternatives\n",
        "6... fxg3 7. O-O": "That pawn gambit I mentioned is nothing compared to this move - castling is meant to PROTECT the king, and yet this manoeuvre exposes the king completely! Surely this is beginner's play? \n",
        "7... gxh2+": "And now a pawn excha-\n",
        "8. Kh1": "no?? no takers?\n",
        "8... Bg3": "So let's recap on what White has achieved in the past three moves. He gave up a pawn so that his kingside could be exposed. He then castled INTO his kingside where there were no pawns to defend him. Now, he has allowed Buck to secure a very dangerous pawn on h2 (Nxh2, Qh4! causes complications for White) What kind of rating would you give a player who does this? Actually, Ohman couldn't care less about that. What he's interested in is the semi-open f-file...\n",
        "9. Bxf7+": "...and the pressure on f7!\n",
        "9... Kxf7": "Buck accepts the gambited bishop...\n",
        "10. Ne5+": "...but is subjected to a double check!\n",
        "10... Ke6": "Bringing the king out into the open like this seems very suspect, but like I said I'm not seriously analysing this game - perhaps Ke7 was better here [Ke8, Qh5+] and perhaps later in the game there was a move that would have saved Black and given him the advantage, but if that had happened this game wouldn't have been nearly as entertaining!\n",
        "11. Qg4+": "Let's just watch as Buck's king feasts on the knight...\n",
        "11... Kxe5 12. d4+": "...and the pawn...\n",
        "12... Kxd4 13. Be3+": "...and the bishop...\n",
        "13... Kxe3 14. Rad1": "...and now Ohman sacs his queen! Surely a player who throws away material like this ought to be merely a beginner? :P Actually, of course, Black is busted, and next move Ohman may have the pleasant choices of Qf3#, Rf3#, Rd3#, Nd5#, Qe2# - five different mating threats from all of White's remaining four pieces! Black's seven pieces, on the other hand, are doing nothing!\n",
        "14... Bxg4": "Might as well - four mating threats averted, but Ohman only needs one! :)\n",
        "15. Rd3#": "Beautiful... just beautiful. That's all I have to say about this game! If you didn't enjoy this game, then I have a very skilled psychiatrist that I can hook you up with!\n"
    },
    "url": "https://gameknot.com/annotation.pl/beginners-luck?gm=34453",
    "gameName": "Beginner's luck?",
    "players": "H Ohman (?) vs. G Buck (?)",
    "opening": "KGA (C34), Fischer defence"
}