{
    "moves": {
        "1. e4 c5 2. Nf3 d6 3. Bb5+ Nc6 4. O-O Bd7 5. Nc3 Nf6 6. Re1 e6 7. d4": "I expected a closed sicilian. ",
        "7... cxd4 8. Nxd4 Be7 9. Nxc6": "Releasing the tention immediately. This likely leads to a tame sicilian. But one where black is cramped and I actually was longing for a tactical game against my lower rated opponent.",
        "9... bxc6": "Regarding my previous comment, I may should have played ...Bxc6 to be less cramped. Still I wanted to keep as much pieces on the board as possible avoiding drawish tendencies. Now I have a solid center without need to spend time on ...a6.",
        "10. Ba4 O-O 11. Bb3": "I regard this a waste of time and would have let the bishop on d7 bound to it's mundane task to keep an eye on c6. I was expecting a kingside attack by f4, g4, g5 etc.",
        "11... Qc7": "A somewhat tame move but I guess a neccessity because my knight will be under attack soon and the bishop on e7 is in doubled duty of defending Nf6 and Pd6.",
        "12. Qd3": "Yes, a good square for the queen. My opponent plays this as a positional game alltogether. Quite in alliance with his 9th move. The goal seems to increase pressure on my d-pawn forcing it to move thereby making e5 possible.",
        "12... Rab8": "I am not that happy with this move anymore. There is an open file so I seize it, was my motiv. The b-pawn could become a target in the long run.",
        "13. h3": "So white doesn't want to abandon the idea of a kingside pawn storm completely. By 12. Qd3 a possible g4 lacks support.",
        "13... Rfd8": "Further backing of the d-pawn.",
        "14. Bg5": "Finally some pressure against my knight. I have been under way more pressure with black in sicilian positions, so I thought the game to be level right now already.",
        "14... h6 15. Bh4 c5": "This is to give my light squared bishop a good post on c6 and it bounds the queen to the protection of c4.",
        "16. Rad1 a5": "I got lured into positional thinking, ...completely dreaming. Though strategically desireable, this blunderes away my d-pawn.",
        "17. Bxf6 Bxf6": "With the h-pawn on h6 I did not want to take back with my g-pawn. ",
        "18. Qxd6 Qxd6": "My blunder has had another negative side effect: Being down in material I wanted to steer the game into drawish channels as soon as possible. Exchanging queens seemed to fit the bill. But now I see 18. ...Da7, 19. Qg3 a4, 20. Bc4 Rxb2 was a better option. I was afraid of the aggressive image of white given after 21. e5 Be7 and then 22. Ne4!",
        "19. Rxd6 Be5": "Please leave and don't play f4.",
        "20. Ra6": "He naturally goes for my pawns.",
        "20... c4": "Luckily I can go for his as well. After b2 falls, c2 will be next.",
        "21. Bxc4 Rxb2": "The point is white needs to spend a tempo on saving is attacked knight.",
        "22. Ne2 a4": "One of the pawns on c2 and a2 is doomed anyway. So I invest a tempo to save my a-pawn. A draw is within reach.",
        "23. Rd1": "This seemingly terrifying pin had to be checked beforehand, of course. (Note that Ra7 would be lethal.)",
        "23... Rc8": "But my play does work for the attackable bishop on c4, plus his second rank is more vulnerable than mine.",
        "24. Bd3": "He reacts reasonable.",
        "24... Rxa2": "So material is even again. I often complain about the phenomenon in chess that you can seemingly gain an advantage in the early middlegame that turns out to be a disadvantage some tens of moves later. (And I will do so in my next annotations ;) But this is one of the few times I was in favour of this curiosity: All of a sudden my pieces are somewhat more active than his.",
        "25. f4": "The obvious move.",
        "25... Bb2": "The not so obvious reply. My idea here is to keep control over a1 in order to exchange rooks.",
        "26. Kh2": "With the pieces in a nearly funny kind of stalemate it's time for king moves positioning for the endgame.",
        "26... Kf8": "Sneaking towards e7. Frankly I wasn't seeing something better than to fortify my weak center squares on my second rank.",
        "27. Ra7": "He had access over my second rank since a couple of moves but now decides to eventually seize the control. Maybe my king move was drawing his attention?",
        "27... Be8": "Everything else looked too dangerous to me with the rook on d1 eyeing through his bishop.",
        "28. Ba6": "Time to get active again ending the hibernate.",
        "28... Rb8": "The only square. And not a bad one. I was having visions of doubled rooks on the second rank myself.",
        "29. Bc4": "That vision might have occured to him as well. So he forces my rook off that rank.",
        "29... Ra3": "Actually I was prepared to swap rooks along the way (...Ra1), but with the bishop off d3 I checked another path. Maybe he doesn't notice? After Bd3 there is no future for the rook on a3 and I would have exchanged it on a1 in the long run whatsoever.",
        "30. Rb1": "Luckily he didn't notice. I can boldly place my rook to an unexpected square. His move looks natural, but it was mandatory to prevent...",
        "30... Re3": "This looks to be a vulnerable square for the rook. But all my variations on my chess board confirmed me it was save, so I thought. I figured white can't approach the rook with the king for a nasty tactic.",
        "31. Bd3": "Very naturally locking the rook and defending the pawn. White lusts for my rook.",
        "31... Rb4": "This move allows ...a3 which would not have been possible otherwise: ...a3 fails to Rxa3 with the rook on b8.",
        "32. Ra8": "Immediately seizing the opportunity to pin my bishop along the eighth rank. I guess this is best.",
        "32... a3": "Mission accomplished! (Yeah, this has a bad sound, I know.) My rook on b4 is free to move.",
        "33. Kg1": "I came home, checked GameKnot and spotted this a terrible blunder within 3 seconds. The rook can only be approached by g3, Kg2 and finally Kf2. This could only be countered by giving the rook for bishop and pawn: ...Rexe4, Bxe4, ...Rxe4.\n\nThe white king must not set foot on dark squares for the 'discovered attack' set up by the Bb2 and Rb4 against the undefended Rook on b1. This is beginner's level.",
        "33... Rxe2": "I simply win a piece.  I could not help but to inform my opponent about the basic 'discovered attack' pattern. I thought he took it quite well and actually expected the game to be over, but was...",
        "34. Bxe2": "...totally surprised that he insisted in going on.",
        "34... Bd4+": "Check with the rook en prise.",
        "35. Kh2 Rxb1 36. Rxa3": "I guess, by winning this bothersome pawn and having a passed pawn on his own he still sensed some chances.",
        "36... Re1 37. Bg4": "Puzzled. I can only explain this further present of a pawn that he was getting tired of making solid but passive moves. This is equal to resignation.",
        "37... Rxe4 38. c4": "So he is putting all his hopes on his passed pawn and measures tempo over material. Alas this doesn't work here.",
        "38... Rxf4": "Since the passed pawn is too little supported I can savely take all material offered.",
        "39. Ra5": "Well, the rook belongs behind the passed pawn.",
        "39... Bf2 40. g3": "I guess, he has morally given up and this is just a hasty blunder.",
        "40... Rxc4 41. Kg2 Rc2": "Regardless of his totally lost position he clinges on hoping for a miracle. My annotations could end here but there is a funny aftermath to this.",
        "42. Bd1": "This is a further and last blunder that looses another pawn. And again by disobeying the rules of 'discovered attack'. This superficial move is counterattacked by...",
        "42... Rd2": "Now it was mandatory to get his rook off the dark squares. But my opponent misses this yet again and decides he can save his pawn by...",
        "43. g4": "Now the rook is lost, of course. ",
        "43... Bb6+": "Seeing him making the same mistake of unrecognizing the pattern of discovered attack more than once, I couldn't help but ask him whether he knows about this tactic. The answer was to resign the game and a message in my message box trying to insult me in my language. It literally says: \"Your comment show that you a prick\". I found that funnny. Needless to mention I am ignored now."
    },
    "url": "https://gameknot.com/annotation.pl/beginners-course-in-discovered-attack-and-politeness?gm=37316",
    "gameName": "Beginner's course in discovered attack... and politeness",
    "players": "BLANKED  vs. Cpt.Blackbeard (1850)",
    "opening": "Sicilian (B51), Canal-Sokolsky (Nimzovich-Rossolimo, Moscow) attack"
}