{
    "moves": {
        "1. c4": "1. c4  English opening\n\nI like it because of all the transposition possibilities. Since Sicilian is my game, reversed Sicilian with 1. ... e5 is even more so with an extra move.",
        "1... Nf6": "id=Chrisobee plays Nf6, which is flexible without going into Reversed Sicilian.  It's a good response and I play it myself sometimes.",
        "2. d4": "This is a standard response to Nf6.  I'm not afraid to play a Queen's Gambit game if necessary.  In fact, sometimes I prefer it.  I guess it depends upon my mood.",
        "2... c5": "This is an interesting but good reply.  This transposes the game a third time into a possible Benoni.  In fact, Benko's Gambit is sometimes thought of as a Benoni.  But really, Benko's Gambit is truly a separate kind of animal that deserves respect on its own.  \n\nI generally don't play it as Black, because it is difficult to win against proper play.  Playing it for drawing purposes is OK.  \n\nYet, it is a very tricky opening.  It has great surprise value against the unprepared. Computers often make mistakes when analyzing these games.",
        "3. d5": "I've studied extensively with the Benoni - learning pawn structure, secrets, and levers.  Some people cannot stand it because of the closed nature of the positions.  You have to know strategy a little better to do well in this opening.\n\nTo continue with the Benoni, play 3. ... e6.",
        "3... b5": "This is a fourth transposition (into the Benko Gambit), and it has only been three moves.  That kind of aggressive manipulation is often attempted by both sides when strong players meet. It's a normal characteristic of the game.\n\n****\n\nThe main idea here is for Black to sacrifice his a and b pawns to open up the files for his rooks.",
        "4. cxb5": "It is dangerous to not accept the pawn.  Take it every time in this position.  \n\nAt least that is my advice.  Some authorities claim  4. Nf3 is possible.  I don't buy it.  I've tried it and have been burned big time.  \n\n****\n\nAlon Greenfeld Vs. Judit Polgar 1989 (0-1).  Alon played 4. Nf3 instead, and Judit Polgar won. ",
        "4... a6": "Offering the second pawn may seem weird in an unfamiliar position, but 4. ... a6 is considered the only real way to safely handle the Benko as Black. ",
        "5. bxa6": "A strong alternative for White would be to play 5. b6 instead.  Such a move avoids the complications that taking the extra pawn creates.  I find that this alternative is unnecessary as long as you are sufficiently familiar with the main line and the subsequent variations from it.  If 5. b6, then Black can choose between Qxb6 or e6.\n\n****\n\nIt is strongly advised for Black to wait to retake the second pawn after 5. bxa6. For Black, the sacrifice is done to gain position and speed in development.  \n\n****\n\nAt first glance, Black could retake with his rook on a8, with his knight on b8, his bishop in c8, or with his queen after a tactical finesse (Qa5+ followed by Qxa6).  Experience suggests that the only good retake is with the Bishop.  But like I said before, Black should develop first.  There is no hurry in this position.",
        "5... g6": "5. ... g6 is considered best play.  \n\n****\n\nI've noticed, however, that play can continue the same by taking the a6 pawn instead with the Bishop.  But by playing g6 before retaking, an unfamiliar white player is more likely to move something that will get him into trouble.  \n\n****\n\nSince many players are unfamiliar with the particulars of this opening, 5. ...g6 is a good strategic move.  Tactically, the two lines are equivalent.  ",
        "6. Nc3": "Black has already gained tempo for the sacrifice of the pawn.  Apparently pawn positions later in the game tend to favor Black too.  So White must play accurately.  Development is priority. \n\nThus 6. Nc3 is sound.  A rare alternative is 6. g3; it is also playable. ",
        "6... Bxa6": "Black has open lines for an attack. \n\n****\n\nHe has the potential for a devastatingly powerful lever with e6 later in the game.  An eventual c4 pawn is golden if Black can safely reach d3 with his Knight.  He can potentially do this with a knight on d7 and moving it through a vacated square on c5. Together these features can be a winning positional strategy for Black.  It's is easier said than done.  White can usually give Black back material to prevent this. However, often greed gets the better of players.  \n\n****\n\nThese are not the only ideas for Black.  He could move his f6 knight to either b5 or a4 to create a double attack with his fianchettoed bishop at g7 upon the important c3 White knight.  And/or (depending upon circumstances) the b8 knight could move through d7 and maneuver to either b4 or c4 to attack the White b pawn.  If Black can somehow succeed in gaining back the lost material by capturing either the White a or b pawn, then Black should immediately trade down into an endgame.  The likely pawn structure should significantly favor Black.\n\n****\n\nTiming is extremely important in the Benko.  If things are coordinated just right, White suddenly finds himself in a positional zugzwang.  No matter what he does, his position continually deteriorates.  \n\nBut if Black does not time his movement properly, then he will be the one in trouble instead.",
        "7. e4": "This may seem strange, but this is considered best by many authorities.  It's called the King's Walk Variation.  Grandmaster practitioners of the Benko's Gambit play this variation often enough to attest to its viability.\n\n****\n\nMajor alternatives include, 7. Nf3 or 7. g3.",
        "7... Bxf1": "It turns out that the loss of ability to castle is not a true loss at all.  You will understand this in just a couple of more moves.",
        "8. Kxf1": "The moves d6 and Bg7 are standard ones that White should know are coming soon.  These will give White enough time to fix his King-side problem.",
        "8... d6": "By trading the bishops, Black has relinquished one of his opening compensations for the pawn.  The light squared Black bishop no longer provides pressure along the a6-f1 diagonal. Yet at the same time, White will likely have weak control over the white squares.  The only way Black can exploit this weakness is through potentially awkward movements with his knights.\n\n****\n\nThe battle for c4 and subsequent control of d3 will have to be fought by Black's knights or major pieces.  This is likely to lessen the pressure along the a and b files.  This may give White enough wiggle room to at least force a draw and perhaps launch a counter-attack upon Black's King position. ",
        "9. Nf3": "First, the development of the other knight is prudent.  Now White will work on releasing his trapped rook.",
        "9... Bg7": "Meanwhile, Black can do nothing more than normal development.",
        "10. g3": "It turns out that Black has made the Bishop exchange for naught.  White is clearly about to catch up with Black in development.",
        "10... O-O": "Black's Rook will still need further development.",
        "11. Kg2": "...while White can now do the same.  The Bishop exchange on f1 did no real damage to White.",
        "11... Nbd7": "Black still has the initiative, but is minus the pawn.",
        "12. Re1": "Why not?  An e4-e5 advance is natural. If the Black pawn on c5 is eventually to be taken, then White has to get rid of its support on d6.  Also, an open e file would be advantages for the white rook on e1.  \n\n****\n\nBlack's main strategy is to capture either the a or b pawns to even the material.",
        "12... Qa5": "Good move!  This helps support c5 while adding pressure along the open files.  \n\nBut perhaps Qc7 for control of the e5 square was better.",
        "13. h3": "I mentioned before that timing is important in this opening. This move prevents Ng4, where by it would provide extra support to the e5 square. More importantly 13. h3 forces Black to commit to a plan of action.  And the move also helps subdue White's weak white square problem.  \n\n****\n\nBlack's knight on d7 currently blocks the knight on f6's preferred route of attack.  After e5, Black will not want to take.  If he does both Black's c and e pawns will be very weak.  If he does not take, then the e file is opened up for the White rook.\n\n****\n\nIt is difficult for White to time things without knowing what Black's plan of action is.  But here it should be obvious that some form of additional pressure along the b file is coming.  13. h3 pretty much forces Black's hand to do so.  This gives White more maneuverability in the center of the board.",
        "13... Rfb8": "Pressure along the a and b files is quite common in the Benko Gambit.",
        "14. e5": "This is a breakout move.  White will concentrate upon controlling the center.  The last thing he wants to be is distracted because of the pressure along the a and b files.  Isolating the c pawn is priority.  Those unfamiliar with the position often don't understand this.\n\n****\n\nWith 14. e5 in this position, the game will likely become at least a draw under best play.",
        "14... dxe5": "The combination to follow is advantages to White because it gives his rook a lift and adds pressure to the e7 pawn.  This combination subdues two dangers that Black threatened, at the same time - the e6 lever and the potential for a black knight outpost on d3.",
        "15. Nxe5": "It does not totally eliminate the threats.  It only lessens the potential effect. ",
        "15... Nxe5": "Now this exchange subdues other potential strategic threats by Black.  It does not eliminated them.",
        "16. Rxe5": "Obviously, the rook will soon be forced to move again because of the bishop on g7.",
        "16... Rb7": "As the e7 pawn should not move at this time, it must be defended.  ",
        "17. Qf3": "This sets up potential skewers, adds pressure to Black's King, and supports the white knight on c3 so that b3 becomes possible in the future.  This would allow the remaining white Bishop to develop. \n\n**** \n\nIt should be noted that one of the strategies for White is to eventually play b3 followed by a4 and then take advantage of the outpost of b5 with his knight.  The danger in this plan is that the x-ray attack upon both the c3 knight and the rook on a1 by Black's bishop at g7.  So if White intends to try this, he must coordinate these maneuvers carefully.",
        "17... Ne8": "This was expected.  Black does not want a potential second break, and he wants to maneuver his knight into a better position while opening up the diagonal for his bishop.  Despite the enormous firepower that Black has on the Queen-side, he still needs additional support from his knight and bishop to launch a successful attack.",
        "18. Re2": "This maintains the rook lift and protects important squares along the a and b files.  Over protection allows flexibility in movement of any pieces involved.  More mobility means better chances.",
        "18... Nd6": "This supports an advance to c4, but it may be time consuming to try to take advantage of an outpost on d3.  Black cannot do everything he wants at the same time.",
        "19. Bf4": "This makes it difficult for black to maneuver his knight for any real advantage. If the knight moves, then the bishop on f4 supports the advance of the d pawn. \n\n**** \n\nSome people would consider this a tactical mistake because in allows Black to gain a pawn.  In reality, the pawn structure is no longer optimal for Black to gain a winning advantage by regaining the pawn.  It is a very subtle finesse. \n\n**** \n\nThe more usual move is 19. Ne4; but, I wanted to change things up a bit and did not want to necessarily directly exchange pieces, unless it led to a more likely drawn position.  ",
        "19... Rxb2": "White has enough resources to handle things here, despite the pressure upon c3.  Black has weak points at c5 and e7.  This should be more than enough to compensate for giving back the material.",
        "20. Rxb2": "This combination only gives back a single pawn to Black.  Granted, the taking of the pawn had to be part of Black's strategy; but here, it is not nearly as effective as it is normally thought to be. \n\n****\n\nThis resulting pawn structure is different than the usual favorable formation for Black in the Benko's Gambit in a couple of crucial ways.  First, Black's c passed pawn is not supported by another pawn.  It is just as isolated as my 'a' pawn.  That makes it vulnerable to attack.  Second, I have an advanced d pawn that can now operate as a crucial lever for White against Black!   The move d6 could easily serve as another break for White.",
        "20... Bxc3": "At first glance, it may look like White is in a bit of trouble.  But...",
        "21. Rab1": "It is only a drawn out exchange of the minor pieces and rooks.  Black is following the idea that once the recovery of the pawn occurs, then it is time to exchange down into an endgame. He is probably looking for a favorable Queen exchange to seal a fleeting advantage in that phase of the game. ",
        "21... Bxb2": "When the white rook takes the bishop, it will guard a2.",
        "22. Rxb2": "Ironically, fewer pieces on the board makes it more probable that a draw will happen.  The critical point is illustrated by awkward position of the isolated pawns. \n\n**** \n\nThe last thing White wants to do is exchange the bishop for the knight on d6, while it is on d6.  That would allow the e7 pawn to support the c5 point and then White's d pawn looks weak. As is, it is relatively strong.\n\n****\n\nNote that after the exchange, Black has fewer pieces to deal with the center thrust by White's d pawn.  Fewer pieces on the board actually increase the power of this particular pawn.  Black's strategy is going to have to shift to prevent that thrust.  As is, the knight is already doing exactly that.  But this in of itself leaves Black crippled when it comes to continuing a viable attack.",
        "22... c4": "This attacks d pawn and somewhat ties down the white Queen.\n\n****\n\nNow that the outpost on d3 is available, I need to prevent its occupation by the knight.  I was looking at an advantages way to exchange my Bishop with the Knight in a more favorable circumstance.   As is, such an exchange would shut-down my advanced lever. \n\n****\n\nSince I knew he would eventually move the knight, I had to think well ahead.",
        "23. Bd2": "Creating a few nuisance threats allows me to maneuver into a better position.",
        "23... Qc5": "This move allows white another nuisance play.",
        "24. Bb4": "This creates a series of threats again while establishing my own outpost on b4.  Notice how the position of the Bishop also prevents an advance by the c pawn. My intention was to manipulate so that my rook could be used for a purpose other than guarding the a2 pawn.",
        "24... Qb5": "At this point, I'm beginning to feel a slight advantage in favor of White.  I had some control over the initiative.  But I don't think it is quite enough to win the game.  I would be happy with a draw.",
        "25. a3": "This frees up my rook for other plans of action.",
        "25... Qb7": "I don't like the x-ray attack on my King.  I need to respond early to this.  It could potentially cause White a great deal of grief later in the game.",
        "26. Kh2": "Moving to relative safety. This is more of a strategic move than anything else...to respond to a potential tactical threat.",
        "26... h5": "26. h5? I was surprised by this move.  This weakens the g6, g5, and h6 squares.  It could open up a strong attack for White against the Black King.  White's Queen is already along the attacking side of the board near a position to take advantage.  I thought that building an attack upon White's isolated d pawn or supporting the c pawn for potential further advancement would be more productive.\n\n****\n\nComputer analysis suggests that 26. ... h6 would be OK.  Frankly, I would not make that move either - although it does make more sense than h5.  26. ... h6 would have created a pawn duo with the g6 pawn and theoretically given Black more options.  But it too would have weakened the g6 square.  \n\n****\n\nMaking such a move is usually a sign that you cannot think of anything better to do.  In this case, I was thinking about what I might be missing.  After all, id=Chrisobee is a higher rated player than me.",
        "27. Re2": "I decide to add pressure to one of Black's weak points...to see what will happen.",
        "27... Rc8": "He ignores the pressure and creates his own threat of advancing the pawn.  This should have been his previous move, in my humble opinion.  Here, Rd8 might have been more productive because the d pawn is somewhat vulnerable.  Such a weakness in White's position would have been more obvious if my King were still on g2.\n\n****\n\nBut 27. ... Rc8 was OK.  ",
        "28. Bc3": "This stops Black's plan, dead in its tracks!  It also creates more pressure upon the Black King.  I wasn't sure how I could break through on the King-side; but creating strategic threats is often the first step in realizing a tactical plan to do so.",
        "28... Nb5": "Nb5 only creates a nuisance threat with little actual bite.  But it did limit my available moves for my bishop.  Bb4 was now impossible because of the fork at d4. \n\n****\n\n29. a4 might have been an alternative to my next move, but after the exchange on c3 my pawn on d5 would be free to take.  I didn't like the prospect of defending against a pawn advance with my Queen.  Nor did I like the exposure of my f2 weakness while playing defense. Such a combination of moves might suddenly make 26. ... h5 look good.  ",
        "29. Be5": "This was the only sensible move.",
        "29... Nc7": "OK.  I'm pretty safe right now. I need to create additional threats.  Multiple threats at the same time could lead to an advantage. \n\n****\n\nMy only significant worry is still the d5 pawn.  It is being attacked twice.",
        "30. Rd2": "I plan to eventually push my d pawn.  This move covers the piece twice (simple math suggests this move is needed), while potentially supporting its advance. ",
        "30... f6": "This is a complete surprise! He decides to use his f pawn as a lever now that the e6 lever is questionable at best.  30. f6 seriously weakens the g6 square a second time.  It looks like a successful attack upon his king is now possible if I can find it.\n\n****\n\nA quick Computer analysis after the game suggests 31. Qe4 fxe5?? 32. Qxg5+ and Black is in deep serious trouble.\n\n****\n\nI took my time to study this position and soon realized that after 31. Qe4...Black does not have to take the bishop!!  In fact, by not taking he seems to gain an advantage!  31. Qe4 Kg7 32. Bb2 e6.  And now my Bishop's movement is restricted and my d5 pawn cannot move.  My Queen would be exposed.  33. Qe3 e5!  At the very least, the initiative would have been handed to Black \"on a silver platter\".  So I didn't play 31. Qe4.  I assumed this was id=Chrisobee's finesse.\n\n****\n\nAlthough 30. ... f6 looked like a good move during the game, further analysis would have revealed that 34. d6 Nd5 35. Qe4 Rc5 36. f4!! Qf7 37. fxe5 c3 38. Bxc3! Nxc3. and now white has a clear advantage because of the advanced passed pawn that is supported. 39. Qb4 Rd5 40. Qxc3 fxe5.  And Black's prospects look bleak.  But I didn't see this.  I was looking for a reason why id=Chrisobee would play 30. ... f6.  Once I thought I had found it, I quit searching. \n\n****\n \nNow that is tricky.  After the game, my computer analysis suggested that I should have played Qe4.  If 31. Qe4 fxe5?? 32. Qxg6+ But this is clearly wrong.  He won't take my bishop.  If I continue to play this line, then suddenly fortunes reverse very quickly. I just didn't look far enough.",
        "31. Bxc7": "I can force the draw easily in this position by exchanging the minor pieces.  ",
        "31... Rxc7": "Now it may look like White is in trouble, but I noticed a little finesse move.",
        "32. d6": "I sacrifice my Queen for the forced draw.  The smallest mistake on Black's part here, means white wins the game fairly easily.  Black must take the Queen to maintain the draw.",
        "32... Qxf3": "id=Chrisobee realizes this and quickly offers me the draw.\n\n****\n\nI was extremely happy with this result, despite finding a win later when I did the deep computer analysis - with human help, of course!  I did the best I could in this game.\n\n****\n\nCan you do your best and find the line or variations that force the draw?  Without computer help, of course!  \n\n****\n\nSend me your solutions or refutations, if you so feel inclined to do so.  At the very least, I will know some other people out there are reading this and hopefully benefiting from my annotation.  It helps psychologically to get some sort of feedback. \n\n**** My thanks to Jstevens1 for suggesting that I ask this question at the end."
    },
    "url": "https://gameknot.com/annotation.pl/benkos-gambit?gm=22645",
    "gameName": "Benko's Gambit ",
    "players": "lighttotheright (2186) vs. chrisobee (2237)",
    "opening": "English, 1...Nf6 (Anglo-Indian defense) (A15)"
}