{
    "moves": {
        "1. d4": "Hello and welcome to the next game in the Benoni Defense series between ptitroque and I. After being soundly drawn in the first game where I had the White pieces, I'm on the lookout for similar traps this time around. I'll skim over the beginning, since I've covered it before, and because there's a lot to cover in this game.",
        "1... Nf6 2. c4 c5 3. d5 e6 4. Nc3 exd5 5. cxd5 d6": "All standard so far.",
        "6. e4 g6 7. f4 Bg7 8. Bb5+": "Identical to Game 1 Still. This is the very sharp \"flick-knife\" attack. The safest response is considered to be 8...Nfd7, which is what my opponent played in our first game.",
        "8... Bd7": "!? And we're practically out of the database right here, down from a couple thousand games to about 30. According to the literature I've seen, White now \"should\" win material with 9.e5, but the path to that outcome is far from clear.",
        "9. e5 dxe5 10. fxe5": "White now has an imposing center--but it's also very overextended, and his development is lagging.",
        "10... Nh5": "My opponent said that he'd also looked at playing 10...O-O?! and sacrificing the Knight, which really gets quite wild. I agree with his assessment, though, that White should be able to hold on long enough to make his material advantage in that line felt, though.",
        "11. Nf3": "I looked for quite a bit at 11.g4?! At first glance, it seems like the obvious move to make, but things are always much more complicated than they appear. Just as an example, one line (of very many) that I looked at goes: 11.g4?! Qh4+! 12.Kf1 Ng3+ 13.hxg3 Qxh1 14.e6 O-O 15.exd7. I chose the text move instead because I wanted to hold onto my center pawns if possible, and because now I have the opportunity to play g2-g4 without worrying about ...Qh4+. It's not obvious now, but this Knight will actually play a critical role in White's defenses for the rest of the entire game.",
        "11... O-O": "Black wisely gets the hell out of the center.",
        "12. Bxd7": "Necessary, now that the Bishop is no longer pinned.",
        "12... Nxd7": "I like 12...Qxd7 better, because it defends g4...",
        "13. g4": "!? I thought long and hard about this move (again). I finally decided that I can make Black give up some material, albeit at significant risk to my King. With this move, I threw away any chance of a quiet game. Hold on to your hats, because things are about to get wild.",
        "13... Re8": "The Knight can't be saved, but White's center will fall to pay for it.",
        "14. gxh5": "Take a good long look at every position here: the tactical possibilities are nightmarish. Here I considered, rather than taking the Knight, things like 14.Bg5?! f6 15.e6!? which essentially leads to a position where half the pieces on the board are hanging, all at once. I couldn't begin to calculate it fully, so I went with the \"simple\" move you see here.",
        "14... Nxe5": "Of course. Now White has to fear ...Nxf3++, and 15.Nxe5 doesn't help at all.",
        "15. Kf1": "Forcing Black to spend a tempo if he wants to get his Knight off the file.",
        "15... Qf6": "So Black pins the Knight, of course, which is now barely defensible at all, yet responsible for covering four critical squares: h4, g5, e5, and d4.",
        "16. Kg2": "Somewhat strangely, this is probably the safest the White King has been for several moves. Let's take stock of the situation briefly.\n\nWhite is up a Knight for a pawn (two pawns soon). He also has a passed isolani on the fifth rank.\n\nBlack, for his part, has superior development, more active pieces in general, and a nasty-looking attack on the exposed White King. This, folks, is anyone's game.",
        "16... gxh5": "This is a sort of ugly move, but probably necessary, as I (as White) was really hoping for a chance to play h5-h6. The text also opens the g-file for possible use by both players against the others' King.",
        "17. Rg1 Qg6+": "So naturally both players get on the g-file immediately. Black just has to be careful of the possible pins and get his King to h8 as soon as possible.",
        "18. Kh1": "The White King has finally reached \"safety\"!",
        "18... Ng4": "Nasty! Not only does this threaten mate on f2, but White's \"obvious\" response loses nearly as quickly: 19.h3?? Nf2+! 20.Kh2 Nxd1 21.Rxg6 hxg6. Besides that, there's still the huge question of when the Black Bishop will spring forward to e5 or d4 to join in the attack. White's Nf3 remains the stalwart defender of those squares.",
        "19. Qf1": "White negates the threats on f2 for now, meaning Black has to get his Queen out of the line of fire.",
        "19... Qf6 20. Bg5": "Twenty moves in, White's Queen Bishop finally steps outside, freeing the Rook (in theory, anyway).",
        "20... Qb6": "Black switches flanks, hitting the b-pawn and lining up along the a7-g1 diagonal as well.",
        "21. Qg2": "White piles up on the g-file in preparation for an assault via h2-h3, while defending b2.",
        "21... c4": "Had we been playing over-the-board, one of us surely would have made a terrible misstep by now. Every move was made by both players with such anxiety, punctuated in our chat log. This \"quiet\" move, for instance, lets the Queen see through to the kingside on the a7-g1 diagonal, threatening the devastating ...Nf2+! where White must give up his Queen to prevent the smothered mate.",
        "22. Raf1": "White gets his Rook out of the corner and applies some indirect pressure to the f7 pawn, all while reinforcing the defense of f2. But now, his g1 Rook is smothered, and he must beware Black's Bishop, which could win an exchange if the Nf3 lets down its guard of d4.",
        "22... Kh8": "I'm frankly impressed that Black managed to get away with waiting this long to play this move.",
        "23. Bc1": "! I am still particularly happy with this move, which is really an advance disguised as a retreat. From c1, the Bishop still commands a great view of Black's castle, and additionally it frees the WQ from her defense of b2, AND frees the g5 square for a White Knight. Now White's threats have come back online viz. h2-h3, pushing the Black Knight out of the way. At the time, I was expecting 23...Rg8, which forfeits the f-pawn but makes for a good contest along the g-file, and seems to me to lead to a draw.",
        "23... Re7": "!? Black told me he thought that 23...Rg8 looked somewhat drawish as well, but wanted more than that, and I don't blame him in this crazy game. The text is an attempt to hold f7 and the e-file at the same time. I wrote extensive notes to myself while analyzing this position, trying to see if Black still has a defense against 24.h3. As it turns out, he does- I encourage you to look for a good line for Black after 24.h3 before you scroll down.",
        "24. h3": "Obviously the Knight can't simply move, or Black gets mated, so instead, complications are in order. The best line I found goes something like this: 24...f5! 25.hxg4 fxg4!? 26.Ng5?! Bd4 27.Nf7+ Kg7 28.Bh6+ Kg8 where Black looks like he might be okay with threats against many White pieces and THREE kingside passers.",
        "24... Bd4": "? I think allowing White to eliminate this Bishop is a mistake. That said, it's still not clear-cut, but all the lines I found that looked okay for Black hinged on driving away the Nf3 before playing ...Bd4.",
        "25. Nxd4": "White's bravest cavalry regiment willingly throws down his life defending one of his critical squares.",
        "25... Qxd4 26. hxg4 Rg8": "Here's the big difference between 24...f5! and 24...Bd4? -- Black no longer has the initiative in this line, and is forced to try to stave off White's attacks instead of making his own. ",
        "27. Rf4 Qd3 28. Rd1 Qg6": "Now the g-pawn is pinned to the White Queen, but White has no real reason to take on h5 anyway--he has more pressing business in the center. As long as he prevents Black from storming down the kingside with three connected passers, he should be fine.",
        "29. Re4": "Forcing a trade (if the Rook shifts off the e-file, White can simply play g4-g5 and then Bf4 and d5-d6.",
        "29... Rxe4 30. Nxe4 hxg4 31. Be3": "Threatening Bd4+.",
        "31... Qh5+ 32. Qh2": "White would be thrilled with a Queen trade at this point. Black only played 31...Qh5+ to draw the WQ off the h1-e4 diagonal, but by now, White simply has too many resources.",
        "32... Qf5": "32...Qxh2+ was better. Now it's all over.",
        "33. Bd4+ Rg7": "33...f6 34.Bxf6+ Qxf6 35.Nxf6 Kg7 doesn't quite lead to instant mate, but obviously it's over.",
        "34. Qb8+": "1-0. Mate in one and Black resigns after a grueling, back-and-forth struggle. If anyone out there has the time to offer some insights into the midgame positions, I'd be honored to hear your thoughts. Many thanks to ptitroque for a truly excellent game!"
    },
    "url": "https://gameknot.com/annotation.pl/benoni-game-3?gm=49384",
    "gameName": "Benoni: Game 3",
    "players": "bwaa (1790) vs. ptitroque (1697)",
    "opening": "Benoni (A67), Taimanov variation"
}