{
    "moves": {
        "1. d4": "This game is is titled \"The last march of the Pawns.\" The cool thing about this game is that at one point goes up a rook in material. However yet it is he who ends up in the mating net. ",
        "1... e6 2. e4 c5 3. c4 cxd4": "With this move black eliminates one of white center pawns and gains a small initiative against the white queen",
        "4. Qxd4 Nc6 5. Qd1": "I played the queen back to her orginal square because at this point I was not sure which diagonal she would be best on. Also I wanted to keep my bishop lines clear and free. AT this point my goal is to setup a typical mazanony bind in the centre.",
        "5... Nf6 6. Nc3": "defending the e4 pawn and developing my knight to a central square.",
        "6... Bb4": "a pin in the spirit of the mizo-Indian defense. Black is trying to create pressure on e4. ",
        "7. Nge2": "This is weaker than Qc2 because it lets black take e4 with very little consequence. ",
        "7... Nxe4 8. Qc2 Qh4": "Defending e4 and threatening mate on f2.",
        "9. Be3": "defends the f3 and develops another peice",
        "9... Ne5": "trying to win the hanging pawn on c4",
        "10. g3": "ignoring the capture on c4 and checking the queen. Right now black's center is very weak. ",
        "10... Nxc3": "This helps white by freeing his position. Also this trade is a bad trade for black because he is giving up his good knight for a inferior one and allowing white to place his other knight on superior square. Nf3  would have been very tough for white to defend",
        "11. Nxc3 Bxc3+ 12. Qxc3 Qe4": "Black wins the rook but he will have to waste valuable time getting his queen back in the game. In contrast white is almost completely mobilized and Black has not even castle yet. Black also has the problem of his light bishop being stuck on it original square. In conclusion white is doing better here and has more than enough compensation for the rook",
        "13. O-O-O Qxh1 14. Qxe5": "Black is positionally bankrupt. ",
        "14... O-O 15. Bd3 Qf3 16. Bc5 d6": "this is a wasted move better is the immediate Re8",
        "17. Bxd6 Rd8": "The point of d6 is that white can not move the bishop because of the threat of Rxd3 winning the bishop.",
        "18. Qe4": "The exchange of queens is favorable for white. This removes the last active piece for black",
        "18... Qh5": "black can not afford to give up his queen so is forced to make another positional consession",
        "19. Qe2 Qxh2 20. Be5": "My bishops are well placed and dominating the board",
        "20... Qh6+": "A bad move that dooms the queen",
        "21. f4": "!! now the queen is locked is a virtual prison",
        "21... f5": "another bad move that creates a weakness on e6 that will be very difficult to defend",
        "22. Bc2 Rd7 23. Qf3 Qg6 24. Rxd7 Bxd7 25. Qxb7 Qe8 26. Ba4": "the bishop is pinned on d7 because of the mate on g7",
        "26... Rd8": "defending the weak d7 square. Black is completely tied down to defense",
        "27. b4": "with black tied down to the defense of d7 there is no way he can stop the last march of the pawns",
        "27... Qf7": "seeking a more active square for the queen",
        "28. Qc7 Qe7 29. Bc6": "The pawn move c5? would be met with 29. ...Kf7 30. Qxa7 Bxa4! and the game is drawn",
        "29... Kf7 30. Bd6": "preventing black from penatrating into the queenside.",
        "30... Qe8 31. Qxa7 Kg6 32. Be5": "reestablishing the pin on d7. However white could ahve also played Bxd7 but sometimes it is better to keep the threat hanging over their head. ",
        "32... h6 33. Bf3": "white can not play a4 because now his king is safe after 33. ...Bxc6",
        "33... Kh7 34. c5": "threatening to play c3",
        "34... Qf8": "Defends against c3",
        "35. a4 Bc8 36. Kc2": "As lasker taught us. The king is your most powerful piece in the endgame. As a rule try and be the first one to the center.",
        "36... Bd7 37. b5": "limiting the scope of the bishop and threatening c6 with massive force. In the endgame I play very logical and methodical",
        "37... Bc8 38. c6": "a small blunder that allows black to create some small counter play. Better was Qc7 ",
        "38... Kg6 39. Bc3 e5 40. Bxe5 Qg8 41. Kc3 Qf8 42. Be2": "A better idea for white is to force the exchange of queens with Qxg7  with the pawns so far advanced win would have an easy win",
        "42... Qa3+ 43. Kc2 Qa2+ 44. Bb2 Rg8 45. Qd4 Be6 46. Bd3 Kh5 47. c7 Qb3+ 48. Kc1 Kg4 49. b6": "white has nothing in trying to push the mate. Instead I go for the sure win which is promoting the pawn",
        "49... Rc8": "with the rook on c8 it is now mate.",
        "50. Qxg7+ Kh3 51. Qd4 Rg8 52. Be2 Ra8 53. Bf1+ Kg4 54. Bb5 Bd5 55. Be2+ Kxg3 56. Qg1+ Kh3 57. Bf1+ Kh4 58. Bf6+ Kh5 59. Be2+ Bf3 60. Qh1+": "Black finally realizes that his fate was decided 14 moves ago. "
    },
    "url": "https://gameknot.com/annotation.pl/benoni?gm=13740",
    "gameName": "Benoni",
    "players": "elyhim (1961) vs. sinus (1982)",
    "opening": "Queen's pawn (A40)"
}