{
    "moves": {
        "1. e4 c6 2. c4": "c4 here is known as the English variation of the Caro-Kann. Not as popular as d4 but I know caveman plays the Kann and I have little chance trying to play popular book lines against him.",
        "2... d5 3. cxd5 cxd5 4. exd5": "Basic Kann English Exchange, not as much theory available on this variation as others but that was the idea.",
        "4... Nf6 5. Bb5+": "Bb5+, an aggressive approach, Nc3 is the more \"book\" play here. ",
        "5... Nbd7 6. Nc3 a6 7. Be2 b5 8. Nf3 Bb7 9. O-O": "Simple castle here, continuing my development. Perhaps a bit premature, plays like Qb3 or d4 were also playable but at this point I saw no need to rush.",
        "9... Nxd5 10. d4 e6 11. Re1": "Re1?! I wanted a4 here and it was probably correct but I was to concerned about 11. a4 b4?!. Obviously now a simple 12. Nxd5 and I would have been fine but I don't generally like to trade early on.",
        "11... Be7 12. Ne5": "I believe this cost white winning chances. Obviously offering up a trade for black's weak knight on d7 and eventually leading to the queen exchange and busted pawn structure that you will see for white in the next few moves. The intention was actually to strengthen my pawn structure kingside by moving the isolated d pawn to e file and after black castled launching a kingside attack. All of whites pieces are aimed that direction and ready to go just a simple miscalculation. Should have played 12. Nxd5 Bxd5 13. Ne5... and continued with the same idea and I think I would have been ok.",
        "12... Nxe5 13. dxe5 Nxc3 14. Qxd8+ Bxd8 15. bxc3": "There you have it, busted pawn structure and no queen. Against an opponent as strong as caveman this endgame looked rough.",
        "15... Ba5 16. Bb2 O-O 17. Rad1": "Rad1?!, So far I've made some questionable rook plays this game. Obviously trying to grab the open file but black obviously has Bd5 attacking the Apawn I just abandoned in the corner. Just lost a tempo.....",
        "17... Bd5 18. Ba3": "...Ba3??, not just a tempo a pawn. I should have played 18. Rda1 and swallowed my pride with an embarrassing back and forth but I decided to try and be tricky and playing against high rated opponents I've found they're not easily tricked. Was thinking maybe 18. Ba3 Rfwherever 19. Bb4 Bxb4 20. cxb4...still down a pawn but a much more playable position. Still no need to sugarcoat it, bad move 18. Rda1 should have been played.",
        "18... Bxc3": "Black taking advantage of the mistake Bxc3...free pawn as we move toward the endgame could be crushing for white. If you want to analyze it further you could go back to when the pawn structure was weakened and the c pawn and a pawn were left hanging causing the need for white to play defensively in this situation. If the structure was solid there would be more opportunity to play for open files and such.",
        "19. Bxf8 Bxe1 20. Bd6 Bc3 21. a3 f6 22. f4 Rc8": "Black claims the only open file on the board further strengthening their hold on the game. A nice play, white probably should have played 22. Rdc1 with the same idea but black is just a step ahead at this point.",
        "23. Kf2 fxe5": "fxe5?! I thought black let me slide here. Much better was Bb3 and that's what I was expecting but this move relieved a lot of tension for the moment instead of piling on the pressure. Bb3 obviously threatens my rook, white needs to keep the rook on the d file to prevent Bd4 check opening up the c file completely with tempo. But after 23. ....Bb3 24. Rd3?! Bc2 the file is opened anyway, possible pins on the e2 bishop, winning the a3 pawn, even mating threats are possible if white doesn't play it right.",
        "24. fxe5 Ba5 25. Kg3": "I took a lot of time with this move. I felt there several possibilities. 25. Bd3 was the other option. K or B have to be moved because Rc2 would come with a nasty pin. I played 25. Kg3 with the hope of 25...Rc3+ 26. Rd3 giving me the possibility to remove black's powerful rook from the game.",
        "25... Rc3+ 26. Rd3 Bc4 27. Rxc3": "With that, mission accomplished. I got the rook off the board, was it perfectly played probably not. Was it the perfect plan, probably not. Baby steps for white.",
        "27... Bxc3 28. Kf2": "Simple idea here. If I take the bishop he has a passer up the c file after 28. Bxc4 bxc4 and my kings in the corner. If I play my king over to protect the bishop after 28. Kf2(Kf3) Bxe2 29. Kxe2, black has no passer and I've moved my king to center of the board. Black still has a 2 on 1 pawn majority queenside but baby steps for white.",
        "28... Bxe2 29. Kxe2": "Baby steps",
        "29... a5 30. Kd3 Be1 31. g4 h5": "I questioned this pawn sack by black at first, thinking for the past several moves Kf7 should be played not understanding what this sacrifice accomplished. It turned out to be a very clever way to get the king into the game and start a run up that side of the board.",
        "32. gxh5 Kh7": "What's black's play?",
        "33. Bf8": "After 32....Kf8 the idea of the sack is clear and it turns out to be a very short term sacrifice. The king will eventually capture the h5 pawn without resistance. I spent a lot of time studying this position and found this little move 33. Bf8. It indirectly protects the h5 pawn for the moment due to the fact that if Kxh5 is ever played then Bxg7 will follow. Also note that the g7 pawn cannot be pushed because of the h5 pawn and in this position the white king is dominating the black bishop not allowing it to protect.",
        "33... Kh6 34. Kc2 Bf2 35. Kb3 Bd4 36. Bd6": "After a little dance the h5 pawn falls but white manages to improve position by holding onto it for a few moves. ",
        "36... Kxh5 37. Bc7 g5": "Black goes all out for the kingside here giving up the a5 pawn. Black will soon have two passed pawns with the king running with them. White might as well resign here right?",
        "38. Bxa5 Bxe5 39. Kb4 Bd6+": "I didn't calculate this into any my lines leading to the end when it was played so I thought I might be in trouble. I think a simple Bxh2 may have been better. Would it have changed the outcome? Probably not.",
        "40. Kxb5 Bxa3 41. h3 Kh4 42. Bd8 Bb2 43. Kc5 Kh5": "At this point with black retreating I think I've pulled off a save. 43. Kxh3 would lead to a draw after 43....Bxg5, eventually sacking the bishop for the last pawn.",
        "44. Kd6 e5 45. Bf6 Kh4 46. Ke6 e4": "46. e4!?....At first I thought I had been given a gift but this turns out to be another one of caveman's clever little tricks.",
        "47. Bxb2": "I have to play the obvious move here Bxb2. I did however take a lot of time because I know it can't be that simple.",
        "47... e3 48. Kf5": "Here Kf5 keeping it simple. Bd4 is also playable after 48. Bd4 e2 49. Bf2+, controlling the e1 queening square and holding. I chose to force the king to stay on the g5 pawn or lose it. If 48...e2 a simple 49. Bc3 will control the e1 square, the g5 pawn can't advance due to the h3 pawn controlling g4.",
        "48... e2 49. Bc3 Kh5": "49. Kh5??? and white accepts the draw. I had been so fixed on getting the draw that I was glad when it was finally offered and without a second look accepted. Problem is 49. Kh5 turns out to be the biggest blunder of the game. 49....Be1!! 50. Kh6 51. Kg4 Kg6 52. Kf3(Bd2 Bc3)....at that point it doesn't matter the black king is sealed off the e pawn will fall, followed by the g pawn, and white wins easily. It didn't happen that way however but a good lesson."
    },
    "url": "https://gameknot.com/annotation.pl/berettastorm-v-caveman1960-ii?gm=54320",
    "gameName": "berettastorm v. caveman1960 II",
    "players": "berettastorm (1548) vs. caveman1960 (1888)",
    "opening": "Caro-Kann (B10), anti-anti-Caro-Kann defence"
}