{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Bb5 Nf6 4. O-O Nxe4 5. d4 Nd6 6. Bxc6 dxc6 7. dxe5 Nf5": "This is where we start.  redfoxrising: Our turn move 8.\nAre we making a discussion thread or discussing in this thread?  8. QxQ is my suggested vote as Black will take with King.\n\nthen follow with development, This game moves us into a quick end game.\n9. Nc3 is the quickest way to develop.\n\nBlack has both Bishops open to move, Black has King in middle of the board and is prevented from castling.  supersparksky: Like the previous game we shall just use the one thread\nI agree 8.Qxd8 is the way to go followed by 8....Kxd8 9.Nc3.......  thewrongreason: Yes, I'll also vote for 8.Qxd8+ to take away Janet's right to castle.",
        "8. Qxd8+ Kxd8": "thewrongreason: I'll probably vote for 9.Rd1+ here, but I don't if it's the best.  nambam: vote Rd1. npt happy without bishop pair in open game  redfoxrising: i'll support Rd1 but agree with nambam about the Bishop pair in our open game",
        "9. Rd1+ Ke8": "thewrongreason: To be honest, I have no idea what to do here. My thinking would be to continue developing as I don't see a really bad move right now. And, with that, I'll vote for 10.Nc3.  nambam: i like c4,another pawn having a say in the centre  thewrongreason: I learned something, Morgan. You said that c4 did something in the center. I thought that something like this only happened in QPO which is why you generally wouldn't play Nc3 or ...Nc6 before moving the c pawn. And, here, we started with the KPG. Now, I know that even in the KPO the c pawn is, sometimes, important for the same reason of center control. Well, in that case, especially seeing that ION hasn't commented yet, I'll change my vote to 10.c4  redfoxrising: I'll go with c4 as my suggested vote at this time\nI like both of the moves suggested and also b3 to prep for finchetto of the long DSB diagonal.\nmove order c4 after to play Nc3. This is more a plan than anything...\n\nI'll go with c4 as my suggested vote at this time\n\n\nfollowed by my plan above of development\nI see BC getting both of her B's on the e-file Be7 and Be6. I think our imbalance of her have the stronger B's will have to be fought off with our development of our lone B and the N to Nc3 then to Ne4 keeping our 2 N protecting each other...  supersparsky: I feel we are grossly underdeveloped and should start off with 10.Nc3  redfoxrising: i agree\nlets play 10. Nc3 next   thewrongreason: Then, I'm with 10.Nc3 as well.",
        "10. Nc3 Be7": "thewrongreason: I'm at a loss here. I'd like to finish development. And, I would've voted for 11.Bf4 or 11.Bg5, but, for some reason, I don't feel comfortable with either candidate move. Therefore, I'll vote for 11.Re1 to centralize one of the R's.  supersparksky: 11.h3\nis my favoured continuation.  thewrongreason: I'll change my vote to 11.h3 then.  redfoxrising: 11. h3 will be my vote",
        "11. h3 Nh4": "thewrongreason: I generally don't like exchanging, but I also how that a N can become dangerous when it gets too far down. And, I don't trust Janet's Nh4. As such, 12.Nxh4 is my vote.  nambam: I think we must play NxN,otherwise janet can disrupt our kingside, then get our other nite over poste haste, as i foresee a nasty attack via the h file",
        "12. Nxh4 Bxh4": "thewrongreason: Will log off right after this. I like 13.g3 but am worried that this might expose the monarch. So, I'll vote for 13.Bf4 where our development is complete. My other reasoning is that should something happen with one Janet's c pawns, we'll be threatening what ION calls the masked battery on c7.  supersparksky: Be3 I feel our DSB is better placed on e3, that is my suggestion.  redfoxrising: I'll also vote for Be3.  thewrongreason: I'm glad you said this Dave, as I was torn between that vote and what you're suggesting. So, besides my original vote and what I considered, the only other candidate move that I took into consideration was 13.Be3. So, I'll change my vote to that.  nambam: yep! Be3 for me. get some artillery over to king side. ",
        "13. Be3 Be7": "thewrongreason: I don't know what to do, but I'll vote for 14.Rd4 as my goal is to double up on one file.  redfoxrising: I'll vote for same idea 14.Rd2 instead with idea of Rd1 to follow  nambam: my vote is for 14.Ne2 bolster up the king side. there are the horwitz bishops glaring down at our king side pawns, which need a defending nite like a mad dog needs shooting. I suspect janet may be toying with the idea of castling long and going for broke down the H file.  supersparksky: Black has lost castling rights as she has moved her King twice!\nI will go along with doubling rooks on the open D file and agree with redfox that Rd2 should be played",
        "14. Rd2": "nambam: i think we may regret not defending against the impending attack.",
        "14... h5": "thewrongreason: This time, I'll vote for 15.Ne4 because of what Morgan posted a move prior.  supersparksky: 15. Rad1 or Ne2.... it doesn't really matter which way round we play them.  nambam: yes Rad1 or Ne2,. i wouldn't play Ne4 Dave, as it too open to attack by Bishop. E2 much safer. 15 Rad1 for me  thewrongreason: So, I'll also vote for 15.Rad1. For me, it's about doubling up on one file. I think I'm just too much in that habbit for the wrong reason as well with Jack. So, independent of that, we're centralizing the other R which is what I like about the whole thing. As that now goes with elyhim told me, several years back in one of his annotations.",
        "15. Rad1 Bf5": "nambam: I THINK WE should play 16. Ne2. I think we should fortify the king side,and try to shift the wsb after playing pf4.  redfoxrising: Absolutely 16. Ne2 needs to be rerouted as N moved to another open square like Na4 is not as good because pb6 by Black would stop our N and we would lose tempo.  ",
        "16. Ne2": "Forgetting that we just move and it's Janet move, I wrote: The only reason I question Morgan's assessment is that I went with it on the previous move. But, Dave advised against it. Having said that, I'll also vote for 16.Ne2, unless Dave thinks that we should play somethingelse.",
        "16... Rd8": "thewrongreason: Unless someone thinks otherwise, I'll vote for 17.Bd4 so that we're not forced to exchange.  redfoxrising: I say go ahead with 17.Rxd8 followed by...\n18. exd8 18. c4 ",
        "17. Rd2xd8+ Bxd8": "thewrongreason: I don't know if this works, but I'm thinking in terms of attacking with 18.Ng3 to get our N to a more active square. Then again, I don't know if that square is better since the wrong coach told me that. So, if that doesn't work, I'd be thinking about 18.Bd4 which threatens the masked battery on the g7 pawn.  mo-one: 18. t4\nIf white is the wicked East, it appears to me that we have a pawn on e5 that has climbed the wall and is on the verge of escaping. How might we stop that? Might I suggest 18. f4 to threaten harm to that pawn?  nambam: i think our king side i safe enough for now, and as our c pawn is under attack, i vote for 18, pc4.  supersparksky: 18.Rd7 is my choice!  Correction! sorry to confuse I meant to type 18.Rd2... Obviously Rd7 is suicide!\n",
        "18. Rd2 b6": "thewrongreason: I'm going to vote for 19.Nd4, as it forks her Bf5 and c6 pawn. Of course, Janet can get out of that, but I think there's is a good strategy once she plays something like 19...Be4 or 19...Bd7  supersparksky: 19.f3 is my choice\nlets get something moving!  thewrongreason: Let's go with it Dave since I like the idea of mobility. And with it, I'll change my vote to 19.f3  redfoxrising: 19. f3 is my vote  ",
        "19. f3 h4": "thewrongreason: Unless Dave thinks differently, I'm going to base this vote on what changed my mind on the last move. So, I'm going with the mobility factor, and I'm thinking in terms of a solid pawn chain. Now, to say the very least with how little I know, I don't if it'll work. But, assuming that this is good for white, I'll vote for 20.g4, as I'm also thinking about gain of tempo.  redfoxrising: 20.g4 is my vote  supersparksky: I don't like 20.g4. after 20...hxg3 e.p. we are in all sorts of trouble!\nI feel 20.c4 is our best move.  thewrongreason: I forgot that there was a pawn right next to it. And, with that, I also don't like the en-pessant capture that comes with it. As there was one time, where keeping in mind but hoping that Carl would miss the opportunity to capture en-pessant, I made a move. Once he took en-pessant, however, I was lost. And, with it, I'll change my vote to 20.c4 ",
        "20. c4 c5": "thewrongreason: I'm thinking along the lines of 21.Nf4 since I don't like where our N is placed, at the moment.  redfoxrising: I think a simpler move should be 21.b3 Our e5 pawn is also hanging but not a threat yet. b3 will strengthen our pawn chain.  thewrongreason: I missed the pawn chain which really is not go. Without going into details, I'm learning about how little you have to miss for it to be problematic later on. Having said that, I agree with your thinking Ron. Therefore, unless Dave thinks we should do somethingelse, I'll change my vote to 21.b3.  supersparksky: I feel we should play 21.Nc3 first.  redfoxrising: lets play 21. Nc3 as suggested",
        "21. Nc3 Rh5": "thewrongreason: I'm thinking in terms of 22.Nd5 here, as my idea would be trying to stop her R with 23.Nf4  supersparksky: I feel it is time for b3\n22.b3 is my suggestion!  thewrongreason: And, Ron mentioned this a move earlier for the pawn chain. With that, I'll change my vote to 22.b3.  redfoxrising: 22. b3\nI was thinking of this move earlier as Joe said and now that we have played Nc3 first as Dave suggested. I'm in favor of 22.b3  nambam: yes, b3. needs to be played,but i think pf4 is more urgent. I do not like our position,our pawns are a mess,and we can be attacked on either side.",
        "22. b3 c6": "thewrongreason: I have no idea. If it weren't for the en-pessant, I'd vote on 23.g4, as we'd have an effective fork. Having said, while it's prone to change, I'll vote for 23.f4 since that would connect our e5 pawn, giving us a pawn chain. However, that's just a very small picture, and there might very well be something bigger that I'm missing in all of this.  redfoxrising: Move 23. Kf2 time to get our King in the game. Our e5 pawn will needs protection and Joe's suggestion of f4 was also considered. I'm good with both choices, but Kf2 is my favored suggested vote.",
        "23. Kf2 Bc7": "supersparksky: 24.f4 is the obvious move now.  thewrongreason: That'll be my vote then, 27.f4.  redfoxrising:\n24.\nyes f4",
        "24. f4 Ke7": "thewrongreason: I think that this is a similar scenario to what we had on our 23rd move. Having said that, I'll vote for 25.Kf3 My idea behind this is to try to get our monarch into the action since we're nearing the endgame.  redfoxrising: 25. Kf3 for reasons mentioned.",
        "25. Kf3 Rh6": "thewrongreason: I don't know what'll work now, by my choice for a candidate move would be 26.Ne4 to limit the amount of squares, mobility, for Janet's Bf5.  supersparksky: I suggest N advance to e4 26.Ne4...  thewrongreason: Then, that's my official vote. 26.Ne4  redfoxrising: I will go with 26. Ne4 I had been looking at this and further moves, and I believe we will have quite a bit of moves unless she exchanges her LSB then we are both very draw-ish. We will have to see what happens. ",
        "26. Ne4 a5": "thewrongreason: I'm now thinking in terms of 27.g4 My thinking is that if Janet answers with 27...hxg3 e.p., we can recapture with our monarch which is why I voted for Kf3 a little earlier in the game.  supersparksky: A waiting move now I think 27.Re2.\n27.g4 would be a blunder i.e. 27.g4..hxg3 e.p. if 28.Kxg3..Bxe4 and we lose a Knight or 28.Nxg3.Rxh3.  thewrongreason: 27.Re2 sounds great to me, so I'll change my vote to that.  redfoxrising: Re2\nI made a post why and went into other moves I must not of posted it!\nnerveless 27. Re2 my suggested vote too!",
        "27. Re2 Rh8": "thewrongreason: This position is even more complex then I could've imagined which is how things get in chess. With that, I'll vote for 28.a3 here.  redfoxrising: 28. Bd2 complexity at it's best, the game of chess! This is a better diagonal for our lone B.\nShe has both B's",
        "28. Bd2 Bg6": "supersparksky: we need to play29.Ke3\nin order to prevent the skewer on the H/D diagonal.  redfoxrising: i agree 29. Ke3",
        "29. Ke3 Ke6": "supersparksky: 30.Ng5+ I think!  thewrongreason: I agree, and 25.Ng5+ is my vote.  redfoxrising: 30. Ng5+ expecting BC to play Kf5 31.Nf3\nI vote for both votes 30 and 31",
        "30. Ng5+ Kf5 31. Nf3 Ke6": "redfoxrising: 32.Be1 gives us 2 pieces attacking h4 pawn  thewrongreason: I see why, so 32.Be1 is also my vote, unless Dave thinks of something better.",
        "32. Be1 Bd8": "thewrongreason: Janet defended again, so my idea of a good time would be to put pressure on the same pawn. With that, I'll vote for 33.g3, or 33.g4. My thinking is that whether she does a regular capture or takes en-pessant, I'd find 34.Bxg3 a good response. However, my vote is prone to change, of course.  redfoxrising: 33. Rd2 looking to check and start trading down.  thewrongreason: I see what you're saying and like that idea even better. So, then it's about if Dave likes the idea. But, unless he thinks otherwise, I'll change my vote to 33.Rd2.  supersparksky: As I see it the safe way is Rd2 but I would like to try something different. i.e. 33.Ng5+ and see what she does!  redfoxrising: lets go with 33.Ng5+",
        "33. Ng5+ Bxg5": "thewrongreason: The only move that seems sensible is 34.fxg5. So, that is my vote.",
        "34. fxg5 Rd8": "supersparksky: Lets swap with 35.Rd2  redfoxrising: ok with Rd2",
        "35. Rd2 Rxd2": "redfoxrising: 36. KxR\n2 ways to take KxR or BxR She will be able to take our hanging e pawn\nI tend to like KxR then Bxp is on same diagonal\nI'm thinking to ask for a draw after the 2 moves.\nI'm not sure who will win, If we are stronger, she will accept a draw.\n\nIf declined it might be that she knows she is stronger.\nif she asks us for the draw I would suggest accepting.\nHopefully Joe could do an annotation.\nI'm willing to play on another 5 moves if necessary.\nThere is a lesson to been learned prior to exchanging our N for her B.\n\nThe Bishop pair is very strong once the Q's come off. Exchanging the R's.\nShe has a LSB vs our DSB I'm looking at our pawn chain on white and her dark\nsquared pawns.  supersparksky: @ Red\nYou are correct with 36.Kxd2 otherwise we cannot defend our Q/side against her lsb attack.\nThe game has been very drawish for a while now, that is why I tried to see how desperate she was to keep the Bishop pair.\nI concur and will do as you suggest Ron.",
        "36. Kxd2 Kxe5": "brigadecommander: This is a 'Bishops of Opposite color ending. Unless i, or you guys, make mistakes,It is an easy draw for Black. Which is why i chose this variation. As Black,against very strong opposition i need a safe clear cut variation to secure a half point.The Top players in the world use it for this very reason.They place there winning chances when playing white. I would suggest adopting this opening when faced with powerful players.\n\nAnyway i am willing to draw at this point. But by all means play on if you wish. It's a learning experience to be sure.  thewrongreason: We could play on, but there was a different game that I studied in the New York Post about Opposite Colored Bishops. And, that annotation was copied and pasted, as there was a miscalculation that lost. But, I don't think there'll be any here. As such, I'll vote to offer a draw, but I'm interested in what Dave thinks. Sometimes, when I think it's drawn, it's not.  redfoxrising: I'm for drawing\nI'm for drawing and I will study this game. This has been an interesting game and I want to try this game in the future as BC suggests. I do play 2200+ players and trying this will make it a way to draw, and a draw is a win for me in my mind.",
        "37. Bxh4": "supersparksky: White plays 37.Bxh4 with draw offer.  awaiting Blacks reply  brigadecommander: OK a draw it is....\nyou guys played an excellent game. Don't feel bad that you did not win. I believe that all of you together play stronger then i do. But that's why i played the Berlin. If played correctly, It is virtually impervious to aggression. Well played guys.  "
    },
    "url": "https://gameknot.com/annotation.pl/berlin-defense-v-roy-lopez-consultation-game?gm=68147",
    "gameName": "Berlin Defense v Roy Lopez-Consultation Game",
    "players": "supersparksky (2427) vs. brigadecommander (2465)",
    "opening": "Ruy Lopez (C67), open Berlin defence, l'Hermet variation"
}