{
    "moves": {
        "1. e4 e5 2. Nf3 d6 3. d4 Nd7 4. Bc4": "This time Pawnbandit chooses the strongest line against the Hanham Phillidor.",
        "4... c6 5. Ng5 Nh6": "Necessary.",
        "6. Qh5": "!? Stronger was 0-0, leading to lines favoring White.",
        "6... Qe7": "The best reply.",
        "7. Be3 exd4": "Now is the time to exchange the pawn.",
        "8. Bxd4 Ne5 9. Bxe5 dxe5 10. Nc3": "White still hopes for a brute force attack, but Black has defensive resources.",
        "10... g6 11. Qh4 f6 12. Nf3 Be6": "Black wants to exchange off the bishop.",
        "13. Bxe6 Qxe6 14. O-O-O Nf7 15. Rd3 Bd6": "At this point, Black decides it is safer to 0-0-0 and block the pressure on the d file.",
        "16. Rhd1 O-O-O 17. Nd2 Be7 18. Nb3 f5": "Now is the time to advance the pawns with threat on the Queen.",
        "19. Qg3 f4 20. Qf3 g5 21. Na4 b6": "Since the light square bishop has been traded off, Black is more concerned with preventing the Ns from mounting a strong attack.",
        "22. Qe2 Kb7 23. Qd2 Rxd3 24. Qxd3 Rd8 25. Qe2 Rxd1+ 26. Qxd1 g4": "After the exchanges, Black wants to continue the expansion on the side opposite the Kings.",
        "27. Qd3 h5 28. c4 Ng5 29. c5": "This plan is flawed because Black can advance the pawn and impede the attack.",
        "29... b5 30. Nc3 h4 31. Nxb5": "Pawnbandit rightly did not want to sit back and play defensively. I was not expecting the move and had not properly prepared to counter it.",
        "31... cxb5 32. Qxb5+ Kc8 33. c6 Bd6": " Better was Qd6. ",
        "34. Kd2": "The critical position. White should have played Qa6+, Kd8 (otherwise mate) QxP. This error gives Black time to consolidate. Today, Pawnbandit would have been all over Black instead.",
        "34... Qe7 35. Qa6+ Kd8 36. a3 Nxe4+ 37. Ke1 Nc5": "Now Black can neutralize the attack.",
        "38. Qa5+ Qc7": "White has nothing to show for the piece, and resigns. "
    },
    "url": "https://gameknot.com/annotation.pl/better-with-practice-2?gm=32577",
    "gameName": "Better with Practice 2",
    "players": "pawnbandit (1500) vs. dmaestro (1545)",
    "opening": "Philidor (C41), Hanham, Berger variation"
}