{
    "moves": {
        "1. e4": "This game features a typical closed Roy Lopez variation. For white(jstevens) everything goes well until she falls prey to the dragons tail attack. What is the dragon's tail attack you ask? Play through and find out.  ",
        "1... e5 2. Nf3 Nc6": "I am not normally a Spanish game player but since it is what jsteven1 is familiar with I thought I give it a go. ",
        "3. Bb5 Nf6": "normal is ...a6 followed by ...b5 but 3. ...Nf6 makes more sense from a positional stand point. The problem of a the immediate ...a6 and ...b5 is that black is behind in development. Making the prospects of anything good happening from the rapid pawn push minimal. The other issue is that after the ill timed pawn push black will have to add over extended pawns to his list of negatives.  The idea behind the 3. ...Nf6 plan is that black tolerates the pressure on c6 in order to defend e5 with a quick d6",
        "4. Nc3": "Ugh I hate the Four knight variation which leads to dull positions. However, this is a bit of a slow move that allows black to take control of the direction and feel of the game. ",
        "4... Nd4": "!? a highly active move that puts the question on the bishop in a different way. If white plays 5. Nxd4 exd4 wins the e pawn. ",
        "5. Ba4": " There are two schools of thought on where to retreat the bishop?. One is that the Bishop is stronger on the b3-f7 diagonal where it can hit at black's critical weak spot. The draw back however, is that black can gain space at the expense of bishops retreat. Black can also force the exchange for the bishop after the retreat. The second school of thought is to retreat to d3 or e2. This idea is more positional in nature because for the time being the bishop will suffer with limited mobility. On the upside black can not force the exchange meaning that white can keep his bishop if he wants to. ",
        "5... c6": "preparing to play ...b5 or ...d5",
        "6. Nxe5": "a good move the undermines the support of the d4 knight",
        "6... d6": "forced as black can not allow the knight to stand on e5 where it hits the critical weak spot of f7",
        "7. Nd3": "?! even thought this move scores well in the Game DB I do not like it because it hinders the development of white's center and queen side pieces. Better is 7. Nf3 not fearing the exchange on f3. However, there is something even more important going on here the critical issue for white is his LSB. Sitting all by itself on a4 is begging to be attacked. The objective is not to capture it but to gain space and time against it. ",
        "7... b5": "and so the mighty dragon sweeps his tail at the lowly bishop. The head of the dragon is the d4 knight and the base of his tail is d6 and the tip is a7. Watch how the dragon's tail sweeps the white pieces to the edge of the board.",
        "8. Bb3 a5": "the poor bishop is going to get whipped into submission",
        "9. a3": "forced or white losses his bishop.",
        "9... d5": "Forcing white to advance the pawn to e5 where is in danger of capture. 9. ...a4 is also playable 10. Ba2 d5(forced) 11. e5 Nh5 12. 0-0 Qg5 with the storm clouds building up for white. ",
        "10. e5": "10. exd5? is worse 10. ...Bd6 11. dxc6 Bf5 12. 0-0 0-0 and white is positionally bankrupt. ",
        "10... Ne4 11. O-O": "11. Nxe4? is bad because 11. ...dxe4 12. Nf4 a4 13. Ba2 Qh4 14. g3 Qe7 winning the exchange. ",
        "11... Qg5 12. Nxe4": "better is 12. Nxd4 cxd5 13.Bxd5 Bg4 14.f3 Bc5 15.Nxc5 Bh3 16.g4 Nxc5 17.Bxa8= \n ",
        "12... dxe4 13. Ne1 a4 14. d3": "a great counter attack move that buys white time to handle the defence",
        "14... Qxe5 15. Ba2": "the mighty black dragon has unleashed his tail and white pieces has scattered in fear. ",
        "15... Bd6": "The threat is Qh2++",
        "16. f4": "?? white defends the mate threat with a bold over the top move. That allows the mighty Black dragon to bring on fire and brimstone to the kings fortress. ",
        "16... exf3 e.p.": "Fire breath #1 the Qh2++ is renewed",
        "17. Nxf3 Nxf3+": "Fire Breath #2 Qh2++ is renewed",
        "18. Qxf3 Qxh2+": "Breath #3 the left wall has fallen",
        "19. Kf2 O-O": "The white king's men gather around him as the dragon is circling around and is about to smash through the castle gates. ",
        "20. Be3 Qh4+": "unfortunately the LSB will not be coming to the aid of his king because he is being held prisoner by the dragon's tail. ",
        "21. g3 Qh2+ 22. Ke1 Bh3 23. Rh1 Bxg3+ 24. Kd1 Bg4": "0-1 for black"
    },
    "url": "https://gameknot.com/annotation.pl/beware-of-the-dragons-tail?gm=40941",
    "gameName": "Beware of the Dragon's tail",
    "players": "jstevens1 (1770) vs. elyhim (2232)",
    "opening": "Ruy Lopez (C65), Berlin defence"
}