{
    "moves": {
        "1. Nf3": "The Reti opening, white attacks two central squares on the first move",
        "1... d5": "Standard reply, since e5 is attacked by the knight. Also hits e4",
        "2. d4": "Occupying the center with a pawn",
        "2... Nf6": "Developpement, hitting the e4 square again",
        "3. c4": "Attacks my d pawn",
        "3... e6": "The Reti opening has shifted into some sort of a Queen Gambit Declined (QGD)",
        "4. Bg5": "Developping, pinning my knight. Good move",
        "4... Nbd7": "Here I was looking for a Cambridge Spring Setup, which is 1. d4 d5  2. c4 e6  3. Nc3 Nf6  4. Bg5 Nbd2  5. Nf3 c6  6. e3 Qa5, with equal chances from both sides",
        "5. cxd5": "Takes my pawn",
        "5... exd5": "I take his in return",
        "6. e3": "Supporting the d4 pawn, while freeing the white squared bishop. Good move",
        "6... c6": "Cambridge Spring book move",
        "7. Be2": "Develops the bishop, prepares to castle",
        "7... Qa5+": "Still following my plan",
        "8. Nbd2": "Blocks the check, and develops the Knight.",
        "8... Bb4": "Putting pressure on the d2 Knight.",
        "9. Bxf6": "? Gives away the bishop pair for nothing much",
        "9... Nxf6": "Obviously",
        "10. O-O": "Castling Kingside and breaking the pin on the d2 knight",
        "10... Bg4": "Developping a piece while attacking white's knight",
        "11. a3": "Putting the question to the bishop",
        "11... Bxd2": "Probably not best, but I was hoping for 12. Qxd2 Qxd2  13. Nxd2 Bxe2, winning a piece",
        "12. Nxd2": "He didn't fell for the trap though. Here I thought about castling, because I saw that 13. Bxg4 Nxg4  14. Qxg4 Qxd2 would have been good to me, but then I saw that castling was met by b4, which wins a piece for white.",
        "12... Bxe2": "So I decided to capture first",
        "13. Qxe2": "Obviously",
        "13... O-O": "Better late than never",
        "14. b4": "Attacks my queen while expanding on the queenside",
        "14... Qc7": "Retreating on a good square, hitting the h2 pawn",
        "15. Rac1": "Puts his rook onto the same file of my queen",
        "15... Rfe8": "Just developping",
        "16. b5": "attacks my c pawn, which is pinned",
        "16... Rab8": "Anticipating the opening of the b file",
        "17. bxc6": "? This move helps black here",
        "17... bxc6": "That is why; I am now occupying the b file",
        "18. Rcb1": "Contests the b file",
        "18... Qa5": "attacks the a pawn",
        "19. Qd3": "Protects the a pawn",
        "19... h6": "A pure waiting move, creates a emergency square for my king. I had no obvious breakthrough, so I had to wait. This move happens to be VERY useful",
        "20. Rxb8": "? gives away the b file",
        "20... Rxb8": "Obviously",
        "21. e4": "Now I understand; He shifted my rook away to break through the center.",
        "21... dxe4": "I saw that after the mass exchange, I could take his a pawn and create a passed pawn!",
        "22. Nxe4": "Following his plan",
        "22... Nxe4": "Exchanging material",
        "23. Qxe4": "Restoring material balance",
        "23... Qxa3": "takes his a pawn...",
        "24. Qxc6": "But he takes my c pawn, and create his own passed d pawn.",
        "24... a5": "Pushes the passed pawn",
        "25. d5": "White does the same thing",
        "25... Rd8": "Stopping the d pawn, since white would have won the race",
        "26. Rd1": "? Drop the d pawn",
        "26... Qb3": "! Forking the rook and the d pawn. The rook cannot move off the back rank, because Qb1 is mate in a few turns. Furthermore, his queen can't protect the his rook and his pawn at the same time",
        "27. Re1": "? Moves the rook out of the line of fire, but it may not be the best move",
        "27... Rxd5": "Taking the pawn, and setting up a deadly trap. I wonder if Qxd5 was safer though...",
        "28. Qe8+": "? This moves seem to win a pawn, but...",
        "28... Kh7": "forced, it is not a mate because of my ''waiting move''",
        "29. Qxf7": "?? Immediately loses the game. Can you find the winning move for black?",
        "29... Re5": "!! BAM! This is a great double sacrifice which wins the game. White resigned here. 30. Rxe5 is met by Qd1 (or Qb1) with mate next turn, and 30. Qxb3 is met by Rxe1 mate. Any other moves simply loses the queen, with a hopeless endgame. This tactic has been possible due to the weakness of white's back rank. Feel free to comment and rate."
    },
    "url": "https://gameknot.com/annotation.pl/beware-the-back-rank-mate?gm=29084",
    "gameName": "Beware the back rank mate!",
    "players": "almeljack (1586) vs. a_random_guy (1588)",
    "opening": "Reti opening (A06)"
}