{
    "moves": {
        "1. e4": "Here's a Scotch Gambit I played against recently.  I don't ever play 1...e5, but in order to learn about more chess positions, I decided to join some different thematic tournaments.  If you are looking for an interesting, dynamic approach for White, I highly recommend that you study the Scotch Gambit.",
        "1... e5 2. Nf3 Nc6 3. d4 exd4 4. Bc4": "Ta-da!  Main line Scotch runs 4. Nxd4.  This move gives Black several opportunities to hang himself with his own rope.  4...Bb4 ?! is one such move, when 5. c3! dc 6. bc! and Black is already in trouble.",
        "4... Nf6": "Transposing into a Two Knights Defense, Chigorin's favorite.  Some times referred to as Chigorin's counter-attack, this opening provides both sides with sharp tactical play as well as the opportunity for positional play.  All around an opening every one should study for a better grasp on chess.",
        "5. O-O": "A more direct approach is 5. e5, when Black has the options 5...Ng4 or the stronger 5...d5! as 6. exf6?! and 6. ed gives Black an advantage.",
        "5... Nxe4": "Black decides to grab the center pawn majority as an imbalance.",
        "6. Re1 d5 7. Bxd5": "7. Bb5 Bb4 8. Bg5 Qd6 9. Nbd2 Bxd2! gives Black a clear advantage.",
        "7... Qxd5": "Black now has the two bishops as an imbalance as well, which can turn into a serious advantage in such an open position.",
        "8. Nc3": "Regaining his piece due to the pins on the e- and d-files.",
        "8... Qa5": "The immediate 8...Qh5 is also possible.",
        "9. Nxe4 Be6 10. Bd2": "10. Neg5 0-0-0! 11. Nxe6 fxe6 12. Rxe6 Bd6 sees Black giving up the two bishops and the pawn back for a lead in development and better endgame chances due to his more aggresively placed pieces and extra center pawn.",
        "10... Qh5 11. Bg5 Bd6": "Voluntarily giving up the two bishops to secure the e5- and c5-squares.",
        "12. Nxd6+ cxd6 13. Bf4 Qc5 14. Ng5 O-O 15. Ne4 Qb6 16. Bxd6": "White regains material equality, but Black's pieces can come to active squares faster than White's.  The rooks have natural homes on d8 and c8, with White under pressure.",
        "16... Rfd8 17. b3": "Not necessary.  17. Ba3 or 17. Qd2 are better alternatives.",
        "17... Rac8": "Black is fully mobilized with a slight plus.",
        "18. Rc1": "This allows a tactical sequence in which Black gets the bishop against knight imbalance for the endgame, and the isolated pawn is not a weakness as it is well defended once the White dark-squared bishop is eliminated.",
        "18... Nb4 19. Bxb4 Qxb4 20. Ng5": "Black has a clear advantage here.  Better was 20. Qd3, however after 20...Qa5 followed by ...Bf5, White is under strong pressure.",
        "20... Bf5 21. Qh5": "A futile attempt to break out.",
        "21... Bg6 22. Qe2 Rxc2": "Here White timed out, but Black is winning.  After 23.  Rxc2 Bxc2 and the Bishop is immune due to the attack on the e1 rook.  Thanks to my opponent."
    },
    "url": "https://gameknot.com/annotation.pl/biggies-scotch-gambit-tournament?gm=2181",
    "gameName": "biggie's Scotch gambit tournament",
    "players": "mrphelps (1876) vs. mybookrunsdeep (1940)",
    "opening": "Scotch gambit (C44), Dubois-Reti defence"
}