{
    "moves": {
        "1. c4 Nf6 2. Nc3 e5 3. g3": "Bremen variation\n",
        "3... Bb4 4. Bg2 O-O 5. Nf3 Bxc3 6. bxc3 e4 7. Nd4 c5 8. Nc2 d5 9. cxd5 Qxd5 10. O-O Qh5 11. f3 exf3 12. exf3 Nc6 13. Ne3 Rd8": "Better is Bd7 to connect the Rs\n",
        "14. f4 Bg4 15. Nxg4 Nxg4 16. h3 Nf6 17. Rb1 Qg6 18. Rxb7": "I dont normally approve of this kind of pawn pinching but in this case it removes the Ns defender\n",
        "18... Qxg3 19. Qe1 Qxe1 20. Rxe1 Rac8 21. Rb5 Nd7": "Black's position is becoming cramped as he has to respond with defensive moves to whites attacks\n",
        "22. Kh2 Rc7 23. d3": "defending the isolated f-pawn. Better was Kg3 which would also release the LSB from guard duty\n",
        "23... a6 24. Rb3 h6": "preventing a back rank mate\n",
        "25. Ra3 Ndb8 26. Be3": "Better was Ra4 giving the option of Rae4 lining the RS up on the e-file\n",
        "26... Re7 27. Be4 c4 28. Bc5 Re6 29. dxc4 a5 30. Kg3 f5 31. Bb6 fxe4 32. Bxd8 Nxd8 33. Rxa5 Nbc6 34. Rb5 g6": "Presumably to stop f5 but it creates so many weaknesses. Better was Re7\n",
        "35. a4 Nf7 36. c5 g5 37. a5 gxf4+ 38. Kxf4 Nfe5 39. Ra1": "building a Q-side attack\n",
        "39... Ng6+ 40. Ke3 Nge7 41. c4 Nc8": "Better to attack with Nf5+\n",
        "42. Rb7 Re5 43. Rc7 Nc8a7": "And the Ns reach a mutual protection position where they will remain locked for the rest of the game. Effectively out of play \n",
        "44. Rg1+": "threatening to get both Rs on the 7th rank and threaten mate\n",
        "44... Kf8 45. Rg6 Rxc5 46. Rxh6 Kg8 47. a6 Rxc4 48. h4": "Analysis engines suggest Rhxc6 here which just shows the weakness of engines when it comes to subtle positional moves. The engine move leads to Rhxc6 RxR Rxa7 and white has traded a R for 2 Ns. With passed pawns on each side of the board it looks good BUT they are on the edge of the board so black only has to capture one and then the K can force a draw against the other one.\n",
        "48... Ra4 49. Rg6+": "Now the Rs manouvre for a mate\n",
        "49... Kf8 50. Rf6+ Ke8 51. Rh6 Ra3+ 52. Kxe4 Ra4+ 53. Kd3 Ra3+ 54. Kc2 Rf3": "The game is lost but this move speeds up the end. Better was Kd8 threatening the R.\n",
        "55. Rh8+ Rf8 56. Rxf8+ Kxf8 57. Kd2": "Note not Kd3 as this would allow Nb4+ freeing the Ns to join the fight.\n",
        "57... Kg8 58. Ke3 Kh8 59. h5": ""
    },
    "url": "https://gameknot.com/annotation.pl/bigpetas-mini-tournament-i-http-gameknot-com?gm=51537",
    "gameName": "bigpeta's mini-tournament I, http://gameknot.com/",
    "players": "bigpeta (2119) vs. ionadowman (2101)",
    "opening": "English opening (A16)"
}