{
    "moves": {
        "1. d4": "Claim on central squares",
        "1... Nf6 2. c4": "Grabbing some more control over central space.",
        "2... g6 3. Nc3": "Still strengthening grip on centre.",
        "3... Bg7": "Blacks Bishop eyes up the long diagonal.",
        "4. e4": "Going for the broad centre, trying to keep control of more space than Black.  Central pawns now controlling b5 through to f5.",
        "4... d6": "Opening line for white squared Bishop, creating retreat square for knight on f6 and preparing central pawn thrust.",
        "5. f4": "This is probably overstepping a little, I should develop some pieces first, but I think the potentially weak e1-h4 diagonal is OK as I can rapidly develop my Kings Knight and Bishop and castle before he can start much trouble on the Kingside and I want the f file open for my rook.  ",
        "5... O-O 6. e5": "Carry on with my plan of extreme space-grabbing!..Have to be a bit careful though my kingside is getting very exposed.  I feel reasonably confident in getting castled in time because his Queen is not  quite ready to come off the leash yet.",
        "6... Nfd7 7. Nf3": "Nf3...White naturally develops another piece to add even more focus on the now quite formidable looking centre.  Because of Whites space advantage his Bishops and Queen can develop easily compared to blacks restricted options.  ",
        "7... a6 8. Bd3": "I'm not sure what black is up to....I guess he's either wanting to prevent my knight from coming to b5 but I can't do much with it even if I put it there it would only be posturing.  He can't be preparing b5 because he hasn't got enough backup.  I really don't know what he is planning because it doesn't seem to help his development...Oh well I will carry on developing in the centre with Bd3, preparing to castle.",
        "8... Nc6 9. a3": "I don't want his knight coming to b4 so my move is simple...a3.  It also prepares b4 to grab even more space.  However, I don't want to delay castling too much longer.  ",
        "9... Rb8 10. d5": "Better push d5 sharpish... he is concentrating too much fire power on e5.",
        "10... Na5": "MMM. I could pick up the knight here.. But at what cost?\nIf I play 11.b4 he will probably play 11....dxe5 and after 12.fxe5..Nxe5 Bxe5 I have time to protect my Bishop because his knight is trapped and I can pick it up later, if he takes on c4 with his knight at any time during this combination I just take his Knight with my Bishop and nothing changes.\nI think whichever way he goes I win the knight for two pawns.  Ok I will play b4",
        "11. b4 dxe5 12. bxa5": "I'm committed now so I must carry on with winning material although my position could be better.",
        "12... exf4 13. Qc2": "Must protect my knight.  He can't easily defend the pawn on f4, I think can pick it up.",
        "13... Nc5 14. Bxf4": "Carry on grabbing and work towards an endgame.",
        "14... c6": "That's strange...his rook is left en pris....is it a trap?...no I think it must just be an error.  ",
        "15. Bxb8": "Well obviously I will pick up the rook while it's going.  If he plays Na4 he gets a nasty pin with his Bishop aiming at my rook on a1 but I can just bring my Bishop back to e5 diffusing that.",
        "15... Bg4": "I better bring my Bishop back to e5 pronto! before his knight gets to a4 or it will be too late.",
        "16. Be5 f6 17. Bd4": "I think I had better keep my Bishop on the a1-h8 diagonal while his Bishop's potential pin of my knight against my rook on a1 remains in the background.  Also by threatening his knight it forces him to make a strategic decision.  He isn't going to be too keen to swap off bits being so much material down and if he moves the knight my Bishop can plop very comfortably in to b6 where it is going to be such a nuisance cramping his Queenside.",
        "17... Nxd3+": "Blacks options are limited but I don't think he should be swapping pieces off now.  I suppose it allows him to pick up the pawn on a5 immediately though.",
        "18. Qxd3 Qxa5 19. O-O": "Better castle sooner rather than later..I'm feeling a little exposed.",
        "19... Rd8 20. Qe3": "Threatening Qxe7 and Bb6.  "
    },
    "url": "https://gameknot.com/annotation.pl/bigpetas-mini-tournament-i?gm=50199",
    "gameName": "bigpeta's mini-tournament I",
    "players": "snowman100 (1642) vs. rjfsmith (1505)",
    "opening": "King's Indian (E76), Four pawns attack, dynamic line"
}