{
    "moves": {
        "1. e4": "A Big Peta Students club Mini-Tournament game.  Excellent defending by black and a few mistakes by white led to a long close game.  Wanting to gauge my assessment, I requested computer analysis -after- completing the annotation.  ",
        "1... d6": "1. ...d6, apparently the Pirc defense.  I have never played it or played against it.  ",
        "2. d4": "2. d4 gives white some space to work with early and hinders black by controlling his fourth rank.  Perhaps a disadvantage of the Pirc?",
        "2... g6": "2. ...g6 lays some groundwork to challenge the center.",
        "3. Nc3 Bg7 4. f4": "4. f4.  I come to like and regret this move equally, the main downside being that several squares (e4, g3, g4, and f3) are weakened.  Benefits similar to d4.",
        "4... f6": "4. f6.  A strange move by black.  Seems to put delays on the N and B getting in to play.  Probably setting up e5?  If white develops an advantage, it may be traceable to 1. ...d6 and 4. ...f6. [computer agrees, prefers 4. ...Nf6.  computer does not mind 1. ...d6] ",
        "5. Nf3 Nc6": "5. ...Nc6.  Following a lot of early pawn moves on both sides, minor pieces are getting in to the game.",
        "6. Be3 e5": "6. ...e5 as expected.  An exchange here favors black, so...",
        "7. Qd2": "White plays 7. Qd2 preparing to castle.  Black also passes on a capture, and plays...",
        "7... Bg4": "7. ...Bg4, clearing off some of his back rank.  Still an edge in development for white.",
        "8. Be2 f5": "8. ...f5.  Hmm, it's getting crowded.  All pieces and all pawns still on the board.  Still unhappy with the prospects of an exchange...",
        "9. d5": "...white keeps things a bit closed in the center while opening up some diagonals with several pieces pointing toward where black may be intending to castle.",
        "9... Nce7": "...and forcing the knight to move. [computer prefers 9. ...Bxf3]",
        "10. O-O-O": "10. O-O-O adds a rook to the pressure on the center, ...perhaps useful if thing open up.  Black's king and queen are starting to look like targets.  Perhaps an idea around which to build a plan (the plan to this point having been to take advantage of the space advantage gained with those early pawn moves by placing my pieces to greatest advantage).  Other than the B on g4, I'm reasonably happy with the position here.",
        "10... fxe4": "10. ...fxe4, the first capture of the game.",
        "11. Nxe4": "11. NxP.",
        "11... Bxf3": "11. ...Bxf3.  B for N probably favors white, ...",
        "12. Bxf3": "...and white still has one knight that can go to g5, which is a stepping stone to e6.",
        "12... Qd7": "12. ...Qd7.  The queen and king are both still potential targets.  And now I'm thinking it might also be useful to prevent black from castling, thereby delaying his rooks getting into the game while also keeping his king from getting to a safe location.",
        "13. Ng5": "13. Ng5 as mentioned.  Bishop on g7 under some pressure.",
        "13... Bh6": "Black plays 13. ...Bh6.",
        "14. Ne6": "14. Ne6 prevents castling. [computer suggests 14. fxe5].  Now g4 looks like a very good square for a bishop.  But black manages to put some brakes on white's plans...",
        "14... Nf5": "14. ...Nf5.",
        "15. Bf2": "I conserve my B and keep the pressure on black's queenside.",
        "15... Ng7": "Aha! Black may feel the knight on e6 has overstayed. A very good move.",
        "16. Qb4": "16. Qb4 opening up a new set of possibilities.  The queen and king being aligned is certainly of interest.",
        "16... Nxe6": "16. NxN.  Hey! I was enjoying that spot!  Looking on the bright side, perhaps this opens up the center where some of my pieces are pointed.  Hmm, black does have some strong pawns...",
        "17. dxe6": "17. dxe6",
        "17... Bxf4+": "BxP with check puts off dealing with the attack on the queen.  I'm down a pawn.",
        "18. Kb1": "sidestep.",
        "18... Qxe6": "18. ...Qxe6.  Now here I make a mistake, or rather I misevaluate. To capture with Q or B? Hmm, I am picturing capturing the b-pawn pawn and then also the c-pawn, overlooking that the Q defends c8 (meaning the R can live there).  This is a significant oversight as capturing that c-pawn is key to my plan and keeping it is key to a strong defensive position for black. ",
        "19. Qxb7": "19. Qxb7.  ",
        "19... Rc8": "19. Rc8.  Drat!, ...as discussed.  White still has greater mobility and also has a safer king.  Well, in addition to being strong in general, those three pawns will provide some safety for the black king.",
        "20. g3": "20. g3 prepares to bring my second rook across.",
        "20... Bg5": "20. ...Bg5",
        "21. Bd5": "If white can just knock the queen off that diagonal, he can capture the rook.",
        "21... Qf5": "21. ...Qf5",
        "22. Rhf1": "22. Rhf1 setting up a discovered attack on the queen. [computer calls this a blunder and suggests 22. g4.  not sure I follow.  why not then 22. ...Qxg4?  comments?]",
        "22... Ne7": "Oof! This move by black kills white's offense.  Interestingly, it is its coverage of c8 that is the most exasperating.  For example, the queen can now recapture on g5! Very inconvenient for white.  This knight move makes it impossible to find a combination where white comes out ahead.  Aargh!",
        "23. Bxa7": "Captures pawn (equalizing pawn lost at 17) and attacks queen.",
        "23... Qd7": "23. Qd7.  A taunting move, that blasted knight insuring that the alignment of Q & K can not be exploited!!!  Excellent strong defensive position by black!!!",
        "24. Bf7+": "24. Bf7+.  Unfortunately, I know this isn't really going to go anywhere.  But I did want to conserve the B and the alternate, 24. Rf7, did not seem as good.",
        "24... Kd8 25. Bc5": "Black's best move in response to this is the move he plays!...",
        "25... Qc6": "25. ...Qc6. [computer suggests 25. ...Nc6].  The game is even in terms of material and black has gained some potential mobility.  I ALMOST played the interesting 25.\tBc5\tQc6 26.\tBxd6\tQxb7 27.\tBxe5+\tNd5 28.\tBxd5\tQb5 29.\tBxh8 here,\tbut I didn't have the nerve to leave black with his queen and me without mine.  Instead played...",
        "26. Qxc6": "the frustrating QxQ!!! [computer suggests 26. Qb4 and shows white's advantage deteriorating]",
        "26... Nxc6": "recaptures 26. ...NxQ.",
        "27. Bd5": "Recognizing the strength of his pawns, black does not take the bait (does not play dxc5)...",
        "27... Ne7": "and puts that infernal knight back on e7!!!!!!",
        "28. Be6": "28. Be6 protects the bishop.",
        "28... Rb8 29. Bxd6": "That's it!  White takes drastic measures and trades the B for two pawns.  Somewhat nervy this far along. [computer really dislikes this move and call the game even, white having had an advantage for the last 25 moves!]",
        "29... cxd6 30. Rxd6+": "30. RxP. The game is turning in to an epic.",
        "30... Ke8 31. Bf7+": "31. Bf7+",
        "31... Kf8": "31. ...Kf8 gives white some interesting tactical options.  BUT...",
        "32. h4": "This is an error. [computer calls it minor].  I had thought I could play Bxg6+ or h4 in any order (my target is the knight, pushing the bishop aside is required). But I missed black's response which reveals Bxg6 had to be played first.  I believe this mistake causes the game to extend longer than if I had made the correct move.",
        "32... Nf5": "Ugh! The knight is now safe and two of white's pieces are now under attack!  ",
        "33. Bxg6": "Solution: another exchange of a bishop for two pawns!  Yikes!",
        "33... hxg6 34. Rxg6": "Ok, one more pawn to go.  Knight can not be saved.",
        "34... Bh6": "34. Bh6 [computer dislikes this move and returns advantage to white.  suggested line seems odd to me]",
        "35. Rxf5+": "RxN, with sights on the final pawn (white has apparently forgotten the object of the game).  This capture makes up for the bishop exchanges, B+B for P+P+P+P+N.",
        "35... Ke7 36. Rxe5+": "A complete set.  This is only the second time I've collected all of an opponent's pawns.  Black is plenty dangerous with his R+R+B vs my R+R+pawns. ",
        "36... Kf7": "36. ...Kf7. leads toward another mistake by white.  Keep an eye on b2.",
        "37. h5": "Preferable to Rge6 (which endangers b2) or Ree6 (which is uninteresting).  So I AM paying attention to b2!",
        "37... Bg7": "37. ...Bg7 [computer strongly prefers ...Rbg8]",
        "38. Rf5+": "38. Rf5+ and black must play ...Kg8 or lose the B.  ",
        "38... Kg8": "I've often thought of this strange situation.  That bishop is pinned and so CAN NOT go to b2!!!!  And yet...",
        "39. Rfg5": "had I been thinking, I would have protected the b-pawn.  Another mistake. [computer does not dislike this move]",
        "39... Rxb2+": "A strange property of chess that a pinned piece still provides support to other pieces and still cuts off access to the opposing king.  This is the first time I've been tripped up like this.   Perhaps the game will end in a draw.   [computer actually slightly increases advantage to white here, though offers no alternative for black]",
        "40. Kc1 Rxa2 41. Rg6xg7+": "RxB and white regains an edge, though with far fewer pawns than he should have.",
        "41... Kf8 42. Kd2 Rxh5": "42. ...Rxh5, another excellent move by black. On the other hand, it relieves white from having to do too much thinking.",
        "43. Rxh5": "RxR",
        "43... Kxg7": "QxR and black creates a situation where white will have plenty of chances to blunder in to a draw.",
        "44. Re5": "White however plays a decent endgame.",
        "44... Kf6 45. Re3 Kf5 46. Kd3 Kg4 47. c4 Ra4 48. Kd4 Ra8 49. c5": "I've never been in a situation where I played out the Lucena position in a game.  However, I have studied and practiced it a little.  Several of the remaining moves borrow from techniques related to this study.  For example, if I am going to push the rook to where it is no longer dangerous, the pawn needs to be on c5, not c4.  I was nervous I wouldn't be able to pull the needed points out of my memory.  See http://www.youtube.com/watch?v=UXtT0StMqKQ for more info.  VERY useful!  And should be reviewed and practiced a few times a year.",
        "49... Rd8+ 50. Kc4 Rc8 51. Kb5": "51. Kb5",
        "51... Rb8+ 52. Kc6": "Moves 52 through 54 are similar to the \"bridge\" technique used when playing from the Lucena position, except in reverse.",
        "52... Rc8+ 53. Kb6 Rb8+ 54. Kc7": "Displaces the rook.",
        "54... Rb1 55. c6 Rc1 56. Rd3": "I believe I could have played Kb7 or Kd7 here.  But I think I had to create a shelter on d or B or black could continue to harass my K from my home rank.  Forces him to a flank.",
        "56... Rh1 57. Kc8 Rh8+ 58. Kb7 Rh7+ 59. c7": "black resigns.  Quite a game!  [all in all, computer notes problems with white 10 times and with black 12 times].  Thank you to The Snowman for playing.  Comments welcome."
    },
    "url": "https://gameknot.com/annotation.pl/bigpetas-mini-tournament-i?gm=50648",
    "gameName": "bigpeta's mini-tournament I",
    "players": "hogfysshe (1826) vs. snowman100 (1618)",
    "opening": "Pirc defence (B07)"
}