{
    "moves": {
        "1. c4": "Staking claim on centre.",
        "1... d5": "1. c4..... d5\nBlack challenges whites claim on centre.\n",
        "2. cxd5": "Whips it off to drag black queen out in open and subject to attack and opens up useful C file for rook later.",
        "2... Qxd5": "2.cxd5...Qxd5\nKeeping material balance (maybe 2...Nf6 is better as it develops a piece and still picks up the pawn next move?....If he plays Nc3 defending the d pawn I simply take with the knight and if he plays NxN I recapture with my Queen.   Although I suppose if I did play 2... Nf6 the White Queen goes to A4 with interposing check making his d pawn defendable by Qb3 after black plays Bd7 or Nd7...and if I interpose the check with Qd7 he can simply exchange Queens and then defend the d pawn with Nc3.  So no I don't think 2....Nf6 is any good after all).",
        "3. Nc3": "Of course he wants to push my Queen away from the centre.",
        "3... Qd8": "3. Original square seems as good as any its just going to get kicked around the park anywhere else.  Probably lost a tempo now?",
        "4. Nf3": "White effortlessly develops another piece.",
        "4... g6": "Can't see any way to contest the centre safely.  Need to get my pieces to reasonable squares..g7 looks a safe haven for my black squared bishop it can exert considerable pressure on the centre from there.    4....Nc6 is met by d4 followed possibly by e3 or even e4.  My whole queenside is feeling vulnerable. I really need to get my king castled and away from the horrible a4e8 diagonal.      Yes I think g6 is a decent move.",
        "5. e4": "Commanding more space in the centre and opening lines for white squared bishop.",
        "5... Bg7": "Carrying on with my development plan.  Beginning to feel uncomfortable about whites probable d4 then e5.  If white plays d4 I think I will play f6 to prepare for playing e5 to try and get some centre play.  Although blocking effective range of my black squared bishop it stops an absolute steamroller for whites central connected pawns.  If he plays e5 straight away I don't really know how to respond, again I guess I would have to play a quick f6 to exchange off his e pawn before it becomes even more rampant!  It could leave me with an underdeveloped isolated King pawn also moving my f pawn  also hands white a lot of initiative with his white squared bishop on the c4f7 diagonal if his bishop moves to c4 making it difficult for me to castle kingside.   White would definately be better but I can't see any other plan to challenge his central dominance.  Maybe c6 is a better measure against whites almost inevitable e4 or maybe I could even play Nc6.  No, c6 seems safer I think this looks the better option.",
        "6. d4": "e4..I thought that was coming.  White has free run of the centre, not so good for me, I think I will carry on with my plan and play c6 and if he pushes the e pawn I'll exchange pawns and try to put pressure on his d pawn.  If he pushes e5 I can play e6 and I will have a great outpost at d5 for my kings knight after first playing it to e7..",
        "6... c6": "Carrying on with my plan.",
        "7. Be2": "Be7...He wants to castle quickly and maybe bring his rook to e1 to support a pawn push and have an indirect attack against my king.  It is uncomfortable...I really need to get the king safe very quickly.",
        "7... Nf6": "I need to castle.  I  want to develop my knight before he pushes e5...I think my knight will be OK on f6.  If white pushes e4, I can play Nd5 where it will be fine and if he swaps knights I can take back with either my Queen or my c Pawn.  If he plays Bg4 I have a safe retreat for the knight on d7.  OK Nf6 seems safe enough....Yes I will play Nf6.",
        "8. O-O O-O": "As per plan.",
        "9. h3": "I wasn't expecting that.  I don't think white would attempt a kingside pawn storm without the centre being locked.  I guess its a just prophylactic move to restrict effectiveness of my bishop which could prove annoying on g4.  That makes me think whites knight is valuable to him perhaps to support an eventual central pawn thrust.    No...I think I'm ok with that because my knight would be very comfortable blockading on d5 if he pushes the e pawn.\nI want to develop my white squared bishop and queens knight but all my own bits on that side are congesting each other, I have to get the bishop on the long diagonal so I will play b6 (b5 would leave me with a backward c pawn.",
        "9... b6 10. Be3": "Be3..White is building up masses of potential energy around the centre. ",
        "10... Bb7": " I need my white squared bishop to concentrate on the centre it is only a matter of time before white meaks a break there...he may get his rooks behind the central pawns first so I will just carry on developing as planned with Bb7.",
        "11. Re1": "Rd1.  Whites development is easy and natural. Another supporting move for a central thrust.  I am very worried by this I am going to get steamrollered I can't develop my pieces fast enough  Oh well white is going to have a very easy game if I try to continue developing and let him chose when to thrust in the centre.  Also I am at the stage where I cannot really develop further without cramping my own position.  I could play Na6 or Nd2 to prepare c4 or the quiet move Rd8 but I think it is all too slow.  I think I quickly have to take radical action and shake it up a bit even if it means the loss of a pawn but with some acrobatics it looks like I might just get away with even material even though my position may end up a little worse. ",
        "11... c5": "I am very worried about",
        "12. d5": "Here comes the pawn push..white is really invading my home space now.",
        "12... Nxe4": "If I have calculated OK, I play Nxe4 and I should end up with three pawns for the piece.  In the circumstances I would be happy with this because it will smash whites pawn centre and could even favour me if I can reach an end game with a mobile intact pawn chain on the Queens wing.  I hope I haven't missed an intervening move.  I think 13.Nxe4 is pretty much forced, then I play 14...Bxb2 threatening the rook so Rb1 is also pretty much forced and then I take the pawn on d5 threatening his unprotected knight on e4.  The ball is then in whites court as to whether he trades his central knight for my bishop.  If he tries to interpose after 14.Bxe4 with Nxc5, I can play Bc3 threatening his rook on d1 and I win material.     I don't really want to lose my black squared Bishop, but I have to make some sort of compromise or I will get squashed very quickly....Ok I will play Nxe4,",
        "13. Nxe4 Bxb2 14. Rb1 Bxd5 15. Rxb2": "OK he has decided to swap off my dark squared bishop.  Pity it was a strong piece and now my dark squares are very weak around my king.  I must now take the knight one4 to level the material.",
        "15... Bxe4 16. Rd2": "Rd2.  White is taking control of the open file, I must try to contest it as much as possible.  If I play Qc7 and then develop my knight whites rook can penetrate at d7 so I think I must play Qc8 followed by Rd8.",
        "16... Qc8 17. Bh6": "Ouch!...There is no effective defence against Qa1 (and if necessary, Nxe5) and Bc4.  Caught in a crossfire hurricane..nice one Pete!"
    },
    "url": "https://gameknot.com/annotation.pl/bigpetas-mini-tournament-i?gm=50057",
    "gameName": "bigpeta's mini-tournament I",
    "players": "bigpeta (2080) vs. snowman100 (1578)",
    "opening": "English opening (A10)"
}