{
    "moves": {
        "1. e4": "MOVE BY MOVE ANNOTATION: This is a move by move annotation and the outcome is unknown at this time. My mini-tournament trying to sort out the Ruy Lopez. With no offense to my opponent, but the guy is a renowned snail and is on my ignore list where snails wind up. Not sure when this will wrap up but lets get on with it. The opening is set up to move three. E5.",
        "1... e5": "E4.",
        "2. Nf3": "Knight to F3. Seems like 9 out of 10 times at GK people with move pawn to D6 now (the Philidor Defense?), followed by the boring bishop to G4, then trading off a knight for bishop about 5 moves into the game. I really deplore that  line and wanted to explore something else. ",
        "2... Nc6": "Knight to C6.",
        "3. Bb5": "Bishop to B5, setting up the Ruy Lopez and demanding a response from black (me). ",
        "3... a6": "I read that this called the Morphy response. I don't know. It is direct and agrresive and forces white to do something. I would do bishop to A4 and eventually to B3. ",
        "4. Bxc6": "Most people do this exchange variation. Though pawns get doubled it does not hurt black all that much. But is still that \"trade a bishop for a knight\" strategy that leads to more boring games I think. ",
        "4... dxc6": "I have found that using this pawn is better than using the B7 pawn to capture the pesky bishop. White here will usually capture the pawn, but it lead to a attack from the black queen where material is recaptured. ",
        "5. Nxe5": "The slightly hasty pawn capture. ",
        "5... Qd4": "I found out about this on YouTube actually. ",
        "6. Ng4": "The usual response here is knight back to F3, queen takes pawn and then a queen trade off with white losing castling rights. His move to G4 takes us out of the database six moves into the game. ",
        "6... Qxe4+": "I can see he is trying to avoid the queen trade off. ",
        "7. Ne3": "This not too bad. The pawn on G2 is protected, though I often do not seize that pawn as it can just free up the rook later in the game. It is considered a poisoned pawn in some situations (like the B2 pawn) and should be seized with caution. But I will take it if the situation benefits me.  ",
        "7... Bc5": "I do not know if I like this move really. I do not analyze moves too long and play too many games to think clearly (between GK and another site I am a member at I have 60 to 70 games going on simultaneously). If I spend one minute on a move it is the exception. Not the same with my opponent (though I do not think snails spend days and days analyzing moves. They drag out a game hoping for a time out or resignation from their burned out opponent).  It does not seem to be a terrible move but I have a bad feeling and am waiting, and will have to wait another 3 or 4 days for Mr. Slingsnail, with anxiety to see what he will do. ",
        "8. f3 Qe6 9. Qe2 Bxe3 10. Qxe3 Qxe3+": "Okay, this all seems like it could end up into an interesting game. But what happens is I just cannot take this snail's super slow pace and I resign the game and add him to my ignore list. It just went on too long from the last time I added a note to this one. I sent him a sarcastic congratulatory note and to my surprise he actually had this game analyzed! Why would he need to do that but he must have been fascinated with something. I was not. An average game wherein my gimpish opponent waited until the last hour or two to make his moves. Too boring and dull and I am not addicted to the almighty \"rating pints\" and freed myself from the burden. Again, congratulations o' slithering one. "
    },
    "url": "https://gameknot.com/annotation.pl/bills-mt-x-ruy-lopez-the-rabbit-vs-the-snail-and-the-snail-wears-the-rabbit-out?gm=54299",
    "gameName": "Bill's MT X - Ruy Lopez - The Rabbit vs The Snail (and the snail wears the rabbit out)",
    "players": "slingblade56 (1384) vs. zhudan (1369)",
    "opening": "Ruy Lopez (C68), exchange, Alekhine variation"
}