{
    "moves": {
        "1. f4": "my preferred bird opening, that explain the tittle ....",
        "1... d5 2. c4": "\"Mujannah opening\" not easy to assume but it often make the surprise",
        "2... c6 3. d4 Bf5 4. Nf3 Nf6": "this is the problem m with this variation : e4 is weak",
        "5. Nc3": "in case of exchange, i will loose anyway the occupation of e4",
        "5... dxc4 6. e3": "in order to retake 4, but black will play B5",
        "6... b5 7. a4": "risking B5 B4",
        "7... b4": "was the  best answer, so my knight is in trouble but i can retake c4 again. so i plan to bring my c3 knight to the king side in order to attack black castle for after",
        "8. Ne2 Qa5 9. Ng3": "and repulse the black lsb",
        "9... Be6": "ok but i have a big problem on queen side and my bishops are blocked",
        "10. Be2": "to castle",
        "10... g6": "preparing fianchetto",
        "11. O-O Bg7": "preparing castle",
        "12. Bd2": "preventing b3, this was a mistake met with c3 !",
        "12... c3 13. bxc3 bxc3": "so  i  have to retreat and live there a black pawn in line 3, this smell burnt...",
        "14. Be1": "the real problem of that is that now E3 is not protected and i risk a knight fork ",
        "14... Nd5": "i should saw it, but i didn't and this was my big loosing blunder. But continuing the game i return the situation and finish mating him, would you believe it ? ",
        "15. Ne5": "??? maybe just something like Qc1 was enough to refute the fork threat",
        "15... Nxe3 16. Qd3": "loosing a rook ! at this time i tough the game was lost : normally with strong opponent it s very rare to recover from such a loss",
        "16... Nxf1 17. Bxf1 O-O 18. Bxc3": "one good thing in all that is that I can finally retake this bloody C3 pawn !",
        "18... Qc7": "now blacks are missing plan because instead of my big blunder, i had resist. this is the opportunity to retake the initiative or, at least, the prepare some terrible plan ",
        "19. Be2": "in order to  put it on f3 to threat c6...a1. very long plan but my chance is that he anticipate it and give me another better opportunity to break his castle ",
        "19... Bd5": "you see,now i can advance the f4 paw in order to attack the castle and i have 2 bishop and 2 knight well situated...",
        "20. f5 Nd7": "i wont leave the black knight come into the game, so i will exchange and then  go on breaking the castle",
        "21. Nxd7 Qxd7 22. fxg6 hxg6": "i tought fx6 could be better for him, opening the f colon. He has a rook more so he could exchange rooks with me and get a leading situation",
        "23. Rf1": "now my situation is quite good",
        "23... Rac8": "preparing a push on queen side / center",
        "24. Bd1": "preparing a attack on h7 after sacrifice knight...",
        "24... Qb7 25. Bc2": "attack is ready. I tough he  will anticipate it, but not !",
        "25... Be6": "so sacrifice will come on h5",
        "26. Nh5 Rfd8": "bad time for blacks",
        "27. Nxg7 Kxg7 28. d5+": "the threat with his rook to my queen will me give time and opportunity to place my queen on the good start square",
        "28... Kg8 29. Qd4": "threatening mate on h8",
        "29... f6": "but this d4 was also my \"starting square\" to go to h4 when necessary",
        "30. Bxg6": "easy pawn and preparing mate",
        "30... Rxd5": "this threat on my queen is just giving me time to go on my h4 destination",
        "31. Qh4": " ",
        "31... Qb6+": "chess  for nothing",
        "32. Kh1": " ",
        "32... Kg7": "would you play something better to avoid the mate ??",
        "33. Qh7+": "end coming",
        "33... Kf8 34. Qh6+": "searching the  good combination",
        "34... Kg8 35. Qh7+ Kf8 36. Qh8+": "wining move",
        "36... Bg8 37. Qh6#": "MATE !!! who had believe that it would be possible with a rook lost in middle game ? "
    },
    "url": "https://gameknot.com/annotation.pl/birding-the-dozy-bird?gm=47886",
    "gameName": "Birding the dozy-bird !...",
    "players": "31415 (1346) vs. dozy-bird (1691)",
    "opening": "Mujannah opening (A03)"
}