{
    "moves": {
        "1. d4": "A very interesting end game. The Bishop and Knight Mate is the most difficult of the so-called \"elementary\" mates and there is nothing elementary about them for a beginner player.... or even a more experienced one. It is a very rare ending but it is a very useful to learn how to do this, otherwise the game will sure to be thrown into a draw either due to 50 move rule, or a stalemate. This would be off course unfortunate because it is a won game, but one must know exactly what to do. I will deal with this more in detail toward the end but for right now lets begin: ",
        "1... d5": "I am dealing clearly with a superior player so my strategy in such matches is always the same: MUST TAKE RISKS or else I won't stand a chance. (I will probably lose either way, but if I take a risk I have at least a remote chance of surprising my opponent and create an interesting game).",
        "2. c4": "In all of my wins against 1800  players (berbatov was ranked over 1800 at the time we started), it always happened in the same way: Develop a board \"feature\" and then take advantage of it. You will see what I mean by that in the coming moves.",
        "2... c6 3. cxd5 cxd5": "So far standard opening. I was going for a Slav defense since that seems to be a less played game around here, and it takes some people by surprise. Exchange variation.",
        "4. Nc3 Nc6": "Not fully familiar with this development but again, I am willing to take chances against berbatov.",
        "5. Nf3 g6 6. Qb3 e6 7. Bg5": "Awkward move for me. I did not like it, but there it was and I had to deal with it. I took my time to play my next move.",
        "7... f6": "I was forced to ruin my king side protection for the castling. The bishop position was so dangerous, that I felt I had no option.",
        "8. Bf4 Bg7 9. e3": "After this move, I started feeling better about that development. Fianchetto in place, his dark bishop squeezed, my castling options still alive.",
        "9... a6": "Passive, but against a stronger players, I put more emphasis on developing than attacking. I really don't want his Nb5.",
        "10. a3 Nge7": "Preparing to castle.",
        "11. Bd3": "berbatov developing further. Again, something I noticed a higher ranked players tend to do. More emphasis on a development. It usually creates a richer and more complex game, with greater number of possibilities. That makes sense considering that a higher number of strong pieces are involved in the game.",
        "11... e5": "I am starting to exploit the Bishop's position, and I am pushing my pawns. Pawn game is in general not a good strategy against a stronger player, but that Bishop was asking for it. In addition I get to push my pawn in the center. ",
        "12. dxe5 fxe5 13. Bg5": "Darn, I knew that that Bishop will be a pest.",
        "13... e4": "I really wanted to gain some center control and some piece advantage. I sacrificed my King's protection to do this, and I knew this. I was willing to take that chance. Note that he has a lot of heavy artillery pointed in the direction of my King's area. ",
        "14. Bxe4 dxe4 15. Nxe4": "I am a pawn up, but my King seems naked. I am sure berbatov was fine with this. I am a bit underdeveloped to boot.",
        "15... Qa5+": "Here I gain a tempo move. I figured I gained a pawn advantage, but he had position on me. If I could gain a tempo move, maybe I make up for the position disadvantage and perhaps retain my piece advantage.",
        "16. Ned2 Qb5 17. Qxb5 axb5": "This was another result of Qb5 I was aiming for. I wanted to develop a \"feature\", namely an early a-file opening. And this is the formula I have followed in the past against superior opponents. Now my job is not to let that feature go to waste, and hopefully take advantage of it. I might end up sacrificing few pieces on the way, but I need to be on a look out to maximize this a-file opening. This now becomes my sole focus.",
        "18. O-O-O": "berbatov didn't seem to be concerned with the a-file threat.... I wonder why, because now my mission is starting to crystallize.",
        "18... b4": "You see where I am going with this.",
        "19. Nc4": "I didn't like this move. It was threatening my King with Nd6. Also, his rook is poised to strike since d-file is clear. I had to abandon my attack temporarily and castle immediately.",
        "19... O-O 20. Nb6": "I sure didn't like this move. However, I was fully committed to the \"feature\" developed. Note that I have Bg7 poised to support the b-pawn advancement. Furthermore, the Rf8 was also ready to connect with the Ra8 as soon Bc8 moves away. Meanwhile, I had to deal with Nb6. After a long time thinking I decided to go for a sacrifice and the next 7 moves were calculated in advance. I surprised even myself with this sequence. (I am usually not this creative but this idea of taking advantage of a feature developed tends to open all sorts of secret doors).",
        "20... bxa3": "I go for it!",
        "21. Nxa8 axb2+": "Check. Kb1 would not be the best move. Can you see why?",
        "22. Kd2 Bf5": "That's why. This would force Ka2 and then RxNa8  ... not a good development for white. So really Kd2 is the only viable option.",
        "23. Nb6": "He saves the Knight, but ....",
        "23... Rd8+ 24. Ke2 Rxd1 25. Rxd1 b1=Q 26. Rxb1 Bxb1": "And now I come out of that exchange ahead with the b-pawn poised to Queen.",
        "27. Nd2 Ba2 28. f3 h6 29. Bh4 g5 30. Bf2": "I am pushing my pawns while cramping his Bishop.",
        "30... Nd5": "I needed to free the b-file for the pawn.",
        "31. Nxd5 Bxd5 32. e4 Ba2": "Positioning the bishop to protect the b-pawn queening.",
        "33. g3 b5 34. f4 Bc3 35. e5": "Not too concerned with his e-pawn as my trusty Nc6 is there ready to stop that advance if needed. Besides, my b-pawn seems much better supported than his e-pawn. If this was a race, I put my money on my b-pawn.",
        "35... b4 36. Ne4 Ba1": "That pawn is going home, right?",
        "37. fxg5 hxg5 38. Nxg5 Nxe5 39. Ne4 b3": "Almost there.",
        "40. Nd2": "I really didn't want to end up with some \"crazy\" Bishop, Knight or Bishop, Bishop end game, and I was willing to sacrifice whatever it takes so that I can queen my b-pawn. I wasn't even sure that the game can be finished with Bishop, Knight or Bishop, Bishop.",
        "40... Bc3": "I had to attack the Nd2.",
        "41. Ne4": "He is just making all of my plans very difficult. ",
        "41... Ba1 42. Nd2": "Ok, different approach now:",
        "42... Ng4 43. Bg1 Bg7 44. h3 Nh6": "Well that didn't help.",
        "45. g4 b2 46. Kd3": "I am starting to realize I will not be able to avoid the dreaded B-K or B-B end game.",
        "46... b1=Q+ 47. Nxb1 Bxb1+": "I have a significant piece advantage, but I am still unsure I can finish this. Once I clear his pawns I will be  6 on him and still might not end up being able to finish. This is when I started to research the BB and BK end game.",
        "48. Ke3 Be5 49. Kf3 Kg7 50. Be3 Nf7 51. h4 Kf6 52. Bf4 Bxf4 53. Kxf4": "Great! I ended up with BK end game, which turns out to be the hardest one. Even BB, although still not easy, is easier than BK.",
        "53... Ne5": "At this point my next goal is to eliminate the pawns first.",
        "54. g5+ Ke6 55. h5 Nd7 56. g6 Kf6 57. Kg4 Ne5+ 58. Kf4 Bf5 59. g7 Bh7 60. h6": "It got pretty hairy as those pawns got pretty close to queening, but it was really a formality. It was going to happen one way or another. However, don't think that I didn't spend hours thinking carefully through each move making sure I don't make a mistake. ",
        "60... Nf7 61. g8=Q Bxg8 62. Ke4 Nxh6": "And finally, here we are. I asked berbatov here to play till the end as I planned to annotate this ending. He graciously obliged. He himself was curious how to finish this as he wasn't sure it can be done either.",
        "63. Kd4": "Basically, idea has to do with something called DELETANG TRIANGLES. You use the ideas of these triangle to get a sense of a board control and a King control with these 3 black pieces. I recommend you look it up.",
        "63... Ng4": "However, the first goal is to take over the center of the board. Take over the e,d, 4,5 central square and then work from there.",
        "64. Ke4 Bh7+ 65. Kf4 Ne5 66. Ke3 Nc6 67. Kf4 Ke6 68. Kf3 Ke5": "My King has finally arrived at the central 4 square area.",
        "69. Ke3 Bf5 70. Kf3 Nb4 71. Kg2 Kf4": "Now try to corner with the King. The Bishop and Knight are serving as a support. As a white you should stay away from a lower rings (lowest ring being h8-a8-a1-h1, the second one would be g7-b7-b2-g2, etc). Berbatov doesn't seem to care so much about making my job harder so at times he drops the to the lower ring without being forced to.",
        "72. Kf2 Bg4 73. Ke1": "The moment he drops the ring, I try to keep him at that ring.",
        "73... Ke3": "So my King goes a lower level trying to pin him at the lowest ring.",
        "74. Kf1 Bh3+ 75. Kg1 Kf3": "Note it is essential that once you get the King on the lowest ring you are to push him into a corner with the color of your bishop. My bishop is a light bishop, so that the only corner I can mate him is the white corner.",
        "76. Kh2 Bf5 77. Kh1 Nd3 78. Kh2 Nf4 79. Kg1 Bd3 80. Kh1 Kg3": "Remember this position. It is essential to end in this position because any other one can easily force a stalemate. The way I tried to remember it, is I visualized his King in the corner, my King right above him but to the side, the knight \"touching diagonally\" my King. The bishop is used to time his King into that corner accordingly as to deliver the final blow. You'll see now what I mean:",
        "81. Kg1 Nh3+": "His king can move to only 1 spot: Kh1.",
        "82. Kh1 Be4#": "The end. I tried to explain as much as I can, but still I encourage you to do some researching of your own as I don't think my explanation is adequate to get this procedure fully down. It actually takes some practice, and I am sure I could have explained a bit more what roles Bishop and Knight play.... Lets leave that as a homework :)"
    },
    "url": "https://gameknot.com/annotation.pl/bishop-knight-end-game-mate-rare-interesting-tough?gm=18074",
    "gameName": "Bishop - Knight end game Mate! Rare/Interesting/Tough!",
    "players": "berbatov (1793) vs. e-motion (1616)",
    "opening": "QGD Slav defence (D10), exchange variation"
}