{
    "moves": {
        "1. e4": "As you will also peer on throughout the game, we have been picking up several messages from the Chess Mailroom about which piece is better, Bishops or Knights. After many nights of disastrous fighting, the answer has sneakily turned up in this game, but please don't comment or give the answer away now, otherwise...\n\n",
        "1... c5": "Gold starts with the Sicilian Defence. This defence gives best results for Black but if Fevil plays properly, then he stands a chance. \n\nPersonally, nowadays I do not usually play 1. ... e5 as after 2. Nf3 Nc6 3. d4!? leaves me in confusion facing the Scotch Opening (as you will see on the next slide and on my annotation after my next annotation, 'The Brick Wall'). The only correct move would've been 3. ... exd4 but after 4. c3 things get awkward. \n\nOpening with 1. c5 can get Black several options to attack and counterattack. ",
        "2. d4": "!? Fevil plays a Gambit for control in the centre. Most juniors might think: \"How absurd for a grandmaster,\" since after 2. ... cxd4 3. Qxd4 White gets an early queen, that can be easily chased away with such things like 3. ... Nf6! etc. \n\nThe reason is, after 2. ... cxd4 White follows with 3. c3! and as I said, things get in a muddle then. A national game went: 1. e4 c5 2. d4!? cxd4?! 3. c3! dxc3!? 4. Bc4 cxb2? 5. Bxb2 5 ... e5 6. Bxf7+! Kxf7 7. Nf3 Nc6?? 8. Ng5+ Ke8 9. Nc3 Bb4 10. Qb3 Bxc3+!? 11. Bxc3 d5!? 12. exd5 Nf6 13. O-O Nxd5 14. Bxe5!? Nxe5? 15. Rfe1! Qxg5 16. Qxd5 Bf5?? 17. Rxe5+! Kf8 18. Rxf5+! Qxf5 19. Qxf5+! Ke8 20. Re1+ Kd8 21. Qf7!! Rb7?? 21. Qe7+ Kc8 22. Rc1# 1-0\n\nI would personally play 2. ... d6! defending the c-pawn and controlling the centre, without risking the pawn. \n\n",
        "2... d6": "As I said, 2. ... d6! is strong as it defends the c-pawn and allows open lines for Black's LSB, and it also controls the centre. The only snag is that Gold's DSB is blocked, but can be opened up at anytime with g6. \n\nAt this time, both players have got a share of the centre, but that's for now. What about later? Who will get all the land, and who'll be squeezed in to his castles? Only one way to find out, read on!",
        "3. d5": "Fevil lunges into the centre. Gold lunges into a pot of boiling water. His knight has lost his potential home. \"The d-pawn must be removed!\"",
        "3... Nf6": "Black attacks the e-pawn and eyes the d-pawn suspiciously. ",
        "4. Bb5+": "White swoops in with a nasty check. Since 4. ... Nc6 fails to 5. dxc6 and 4. ... Nfd7 fails in developing terms, the only answer seems to be 4. ... Bd7 or 4. ... Nbd7.",
        "4... Nbd7": "The knight gets himself out of the tangle into an even bigger tangle. Now, the knight is stuck, and so is Black's LSB.  And if the bishop takes the knight with check, then: \"Here we go with all the fuss and quarrels about Bishops vs. Knights.",
        "5. Nc3": "Theoretically, this seems to be a good move in developing terms. The negative point is that White is ignoring the fact of 5. ... a6! which forces the Bishop back, which cannot seem so serious, can it? The thing that holds the debate is that after 6. Bc4?! b5! the bishop must retreat, which fails in developing terms. But, more of the less, White should not play the innocent 6. Bxd7+? as White would have swapped of one of his best-placed pieces for a knight which hasn't yet opened his eyes.   ",
        "5... a6": "Black tackles the bishop. Will it retreat, or take the knight? And which way?\n\n6. Ba4?? is blundered, as after 6. ... b5! the bishop will have to retreat to b3, following 7. Bb3 c4! which nets the bishop.",
        "6. Bc4": "?! The bishop does retreat down the long diagonal to a difficult square. A bishop on c4 can threaten f7 when the d5-pawn has been cleared off. Using tactical ideas (and opinions), the bishop could've been there on move 2. Has it been delayed?\n\n0002 C4\nDelayed until 0006. We apologise.\nRan by Bishop. Formed of 5 coaches.\n\nThere's another reason too, that it is pretty dubious. Look what happens next...",
        "6... Ne5": "On move 3, the knight was stuck. Now, on move 6, the knight's already in the pluck. What's the time? Lunch-time!",
        "7. Be2": "The bishop retreats is forced to retreat unless White wants doubled pawns (ignoring the fact of 7. Qe2). What a waste. So much for a grandmaster!",
        "7... g6": "Now for a bit of developing and describing. Look at this...\n\nThe knight on c3 is the only one out and about for white, but he's staring at his own pawns. The bishop on e2 has fallen off the sofa, and all the rest of the pieces are still sleeping in bed, waiting for the alarm clock to ring on move 10 (with the exception of the d & e-pawns, who've set off yesterday for late 'knight' hunting. Don't worry, it's just a joke)\n\nFor Black, the bishop on f8 is just about to come out, and so is the bishop on c8! That leaves just the major pieces snoozing, though. They're the wrinklies, but Gold's a winner!",
        "8. Nf3": "The other knight's alarm clock's gone of early, so he jumps off his bed. The only thing is, it's a very dubious move...",
        "8... Nxf3+": "Gold sharpens his lance and sets off the white alarm clock early. Trouble is, it only wakes up the bishop snoozing on the floor. ",
        "9. Bxf3": "The bishop is now in front of the castle wall. A bad place to sleep, but the bishop is very tired, so... ",
        "9... Bg7": "Zzzzzzzzzzzzzzzzz. The black bishop jumps off his bed, in front of the castle, but behind the separated wall, while the white bishop snoozes. Wait, what's that noise? Tick, tick, tick...",
        "10. Bg5": "D-ding! D-ding! D-ding! D-ding! The alarm clock finally rings, and White's last minor piece gets developed, into a central attack. Fevil must be feeling very happy! ",
        "10... O-O": "Black's king has shuffled into safety. Gold's in a good position but THWACK! He's forgot something! His LSB is still doing backflips in his swimming pool, located in the hall of Black's queenside castle. Time to get a towel...",
        "11. Bxf6": "And now White starts the chase. This is where it gets complicated. \"Oh no! Here we go again!\" with the fuss about bishops and knights. Black's best choice is to capture with his Dragon Bishop, as after 11... exf6 Black gets doubled pawns, which might be good to open up the e-file, but still, they aren't a nice sight! ",
        "11... Bxf6": "And now the position looks equal. White hasn't castled, but Black hasn't got his LSB out yet, and both bishops opposite each other are on ridiculous squares. Sadly, for Gold, it's white's move. ",
        "12. O-O": "White's king finally leaps into his safe castle, but will it be safe from Black's attacking minor and major pieces?",
        "12... Bg7": "Black retreats his Dragon Bishop to it's normal square, and into safety, protecting all the pieces and squares around it. But now Gold is a couple of tempos down, and needs to clean up his act!",
        "13. Qd2": "White gives his queen a little push and connects his rooks, ready for the so-called \"Middlegame\". ",
        "13... b5": "Black is looking at 14. ... Bb7  or 14. b4! The knight senses this but where does he move?",
        "14. Nb1": "?? Right back to its starting place! Much better was 14. Ne2 or 14. h3!? The knight now blocks the rooks from connecting. Knighty-knight knight.  \n\nThe other reason why this move is a ?? not a single ? is that after 14. ... Bxb2! White's rook is left trapped and Black wins a Rook and a pawn for a bishop. Fevil must be drunk! He ust be blind!",
        "14... Bxb2": "This is getting frightening for Fevil! Even though Gold has still has a LSB in the changing room, Black shall simply be a rook up at least! So does Fevil stand a chance?",
        "15. g3": "White makes a little hole for White's LSB to fit into. Trouble is, this doesn't help with the Rook Rummage! Better was 15. Nc3 protecting the Rook but losing the exchange. Fevil must really be drunk!",
        "15... Bxa1": "Bye Bye Rook. Your friend on f1 must be crying to death!",
        "16. Nc3": "The rook's friend takes revenge, and if 16. ... Bxc3 then... Here we go again with Bishops vs. Knights. Escape Bishop!",
        "16... Bb2": "The bishop dodges the catapult does it dodge the next one?",
        "17. Rb1": "The Rook is certain to get revenge! \"Where are you going to go next?",
        "17... Ba3": "The bishop belongs at g7 when the queens are still on the board. I mean, it might get stuck on the rim forever in this game!",
        "18. Rb3": "The Rook sends another bowl of fire towards the bishop, but does the bishop dodge it this time, and how?",
        "18... Bb4": "?! The bishop doesn't dodge but has some water handy if the catapult hits him, and sends white a present. A pin! What's next? A fork? A knife? A spoon?",
        "19. a3": "Black's poor bishop is being chased around like mad. There's only one place to go...",
        "19... Ba5": "The bishop should be safe here as there are no more catapults for the rooks or arrows for the pawn, and there is a row of pawns to protect him. Also, anything attacks the bishop, it can simply move down inside the queenside castle, where everything is safe and sound, and where he can swim and mess around with his friend, Black's LSB.",
        "20. Bg2": "The white bishop jumps into his kingside castle, his \"fianchetto\" square, defending his king. He's come for another rest, and it's only move 20! Golly, he must be tired!",
        "20... c4": "Gold marches down to attack the rook, and the poor rook finds that there is no place for him to attack, so sadly, he leaves for home, guarding the back rank.",
        "21. Rb1": "The Rook retreats back to his bed. What a waste of time, Rookie! Hopefully, he can get out sooner or later, without his friend, for a change.",
        "21... Bb6": "The bishop is setting off for g7 again, but will it overcome the difficulties? Now that he has released the pin on the knight, White's pieces may get active again, though another present has been sent. Can you see which one?",
        "22. Ne2": "And NOW the knight moves to e2. Why couldn't it have been their on move fourteen. That would save a Rook's life! And what's the point now? What's the matter with Fevil's pieces? Are they listening to him?\n\n0014 E2\nDelayed until 0022. Due to signal failure. We apologise.\nRan by Knight. Formed of 4 coaches.\n\nOh, and by the way, the other present the bishop sent was another PIN, the one pinning the f2-pawn to the king! ",
        "22... Bg4": "Finally, Gold let's his LSB out into the game. It's a bit late, isn't it? Despite this fact, Black still needs to do some developing, centralize his rooks, and get his queen into the game, without missing transporting the bishop back to g7! That's a lot in one step, isn't it? But now, if the Black Bishop takes the knight...",
        "23. Nf4": "...Then it's back to the fuss about Bishops vs. Knights. But that's the title of this annotation, isn't it? And I still haven't told you who wins yet!\n\nFevil launches his knight off to f4. He probably likes Knights better than bishops, then?\n\n",
        "23... e5": "Black sends off Pawn Power (made from original flavoured development) to chase away the knight and hopes to get his queen into the game and centralize his rooks and get his Bishop back to g7 through the castles. That's another lot in one step, eh?",
        "24. h3": "And here we go again with the fuss of the  \"YOU KNOW WHAT!\" . Should Gold retreat, or take the knight? It's up to him...",
        "24... Bd7": "Gold keeps his LSB and the knight is still under attack, and White's kingside is starting to rot. Anyway, Gold seems to like Bishops better than Knights...",
        "25. Ne2": "White's knight hops back to e2. White is spending too much time wasting time, and all these pawn moves aren't that bad for Gold, they just help him develop!",
        "25... Qf6": "Black hopes to capture the pinned f-pawn with check. This is the first castle attack for Black!\n\nNow, let's stop for a development break. It look like White is behind in development, as no pieces have got past the second rank, and they have not yet been centralized. I'M TALKING ABOUT YOU, B1 ROOK! + They have no plan yet.\n\nBlack should centralize his rooks and probably get his LSB into the game a bit further. ",
        "26. Nc3": "White's knight moves for the eighth time in this game, but here, there is a point for the move. This move allows the queen to defend the pawn, but there is a saying in chess which reads: Always defend with the weakest available piece. So where does that leave White? ",
        "26... Rfe8": "Black centralizes his rook, ready to make another great attack when the e-file is open. On second thoughts, the bishop is actually good on b6, as now the Black Queen is defending the king.  ",
        "27. Rd1": "White aims to centralize a rook as well, ready to defend an opposing attack from Black.",
        "27... Rad8": "Another Rook goes into the pan of attacking. Hey, where's the vegetable oil?",
        "28. h4": "?! White marches ahead with his pawns. Trouble is, they are on the kingside, but anyway, Black has still not got enough pieces to attack, though, or has he? ",
        "28... h5": "?! This is a bit risky, as the White queen is aiming down the c1-h6 diagonal...",
        "29. Qh6": "?? White leaves his f-pawn to be taken and aims to attack Black. But it's not just the f-pawn White's going to lose...",
        "29... Bxf2+": "There is also another saying in chess that goes: Always take a pawn/piece with the weakest available piece, unless the stronger piece can do more damage. Here, it is also because 29. ... Qxf2+ may leave the Black king under attack. ",
        "30. Kh1": "?! Better was 30. Kh2 defending the g-pawn. Anyway, it has to go now...",
        "30... Bxg3": "Now White has no way to defend the h-pawn (31. Qg5 Qxg5 32. hxg5 Bh4 nets the pawn), and again, this goes...",
        "31. Ne2": "Attacking the bishop does not help, as Black has a choice between 31. ... Bxh4 or 31. ... Qxh4+",
        "31... Qxh4+": "Gold claims that in this case he took with the queen because a) it was check and b) he could do a lot of wonga!",
        "32. Kg1": "This move is forced, and, if you are a little kid, after 32. Bh3 Black replies with 32. ... Qxh3+ winning a piece! How fascinating! ",
        "32... Bf2+": "Black is simply giving a barrage of checks to try to threaten mate. ",
        "33. Kf1": "And again, if you are a small kiddy, I suggest you find all the possible moves White could have made after 32. ... Bf2+.",
        "33... Bb6": "Ka-blam! Black is threatening 34. ... Qf2# which ends the game for White. Can you find any way to stop it?",
        "34. Nd4": "White gives up the knight to stop mate as after 34. Bxd4 White replies with 35. Qd2 defending the threat. Which piece is Gold going to take with, the bishop or the pawn?",
        "34... exd4": "Black threatens to open up the e-file for the Rooks to attack. Make sure that at least one piece guards the back rank when the queen is at h6 as if a Rook gets down to the back...",
        "35. Qd2": "It would be mate. Well, not now, as the queen's gone back...",
        "35... c3": "Gold pushes a pawn forward to attack the queen! Even pawns can get to the third/sixth rank in the Middlegame!",
        "36. Qe1": "White threatens to get rid of the powerful queen, leaving him with no fierce attack. But will White exchange?",
        "36... Qf4+": "Gold does not bother with the exchange of queens, but carries on the threat. Fevil is very unhappy. ",
        "37. Qf2": "And White threatens to exchange again, but does that put him off?",
        "37... Qxf2+": "Unfortunately, it does. \"Too much sugar\" complains Andrew Gold. But this move does have it's positive effects...",
        "38. Kxf2": "Once again, small kids, find all the possible moves White could make after 37. ... Qxf2+ (All right, I've done this three times. The answer is that there is no other moves to make!)",
        "38... d3+": "Black wins a pawn and threatens to promote to a queen. What a waste of exchanging queens, Fevil. ",
        "39. Ke1": "Kids, how many squares could the king move to after 38. ... d3+ (And the answer is not just one!)?",
        "39... dxc2": "Black threatens to promote by taking the rook. There is only one answer to stop promotion...",
        "40. Rc1": "...And poor Gold finds he has no way to protect the pawn. Poor Pawn.",
        "40... b4": "So he creates another passed pawn. If White takes, Black replies with 41. ... Ba4! followed by 42. ... Be3! promoting the pawn. ",
        "41. Rxc2": "White sees the trick and doesn't take the b-pawn, but smoothers butter on the c2 pawn, ready for c3-pawn trifle. But that doesn't work...",
        "41... Ba4": "Now the diagonal has cleared, and Gold threatens the rook, and to promote the pawn. ",
        "42. Ra2": "This move is forced unless Fevil wants to lose quickly.",
        "42... c2": "There is no way White can stop it unless he plays...",
        "43. Kd2": "! This stops the promotion of the pawn but it doesn't work that well...",
        "43... b3": "!! Gold makes another passed pawn. One of these two will queen, or will they?",
        "44. Rb2": "?? This move is terrible as if anything attacks it, the rook will be trapped. Can you find the killer move?",
        "44... Bd4": "!! And the poor white rook finds it cannot move anyway without being captured, so it sacrifices itself for a pawn. What a beautiful net ...",
        "45. Rxc2": "Bye Bye Pawn, and Bye Bye Rook...",
        "45... bxc2": "Can White stop the pawn from promotion? Well, he could at least try....",
        "46. Kc1": "This move is forced to stop promotion, but you can guess what is coming up next, can't you?",
        "46... Be3+": "! The white king finds he cannot stop the pawn from promoting...",
        "47. Kb2": "... And how many squares could the king go to after ... Oh, I think you already know the joke. ",
        "47... c1=Q+": "And Gold promotes his pawn into a queen, threatening mate. \"Hi Mr White King! I've just been born, so can you please shuffle up to a2 please so I can checkmate you shortly afterwards?\"",
        "48. Ka2": "\"So you can what...?\"",
        "48... Rdb8": "And out of all the 48 moves so far, Black final gets a rook into the game. White is helpless. There are so many ways of mating, Fevil waits impatiently for the game to finish with a sad checkmate...",
        "49. e5": "White hopes he can delay the mate by sacrificing a pawn. ",
        "49... Rxe5": "? And Black accepts it! He must want to delay it by a move! At least he gets his other rook out...",
        "50. Bf3": "And finally the Bishop moves, but this doesn't actually help... ",
        "50... Bb3#": "Black finishes off the fifty-move game with a spectacular checkmate made by a bishop, and 25 points up! Sorry Fevil, but that was such a spectacular one...\n\nOh, that reminds me. Who won, Bishops or Knights? The answer was that \"In closed positions, Knights are better, but in most positions, and most endgame positions, BISHOPS ARE BETTER!\"\n\nSo where does that leave us? To say goodbye. I hope you've enjoyed reading my annotation, and I'll leave to see you next time.\n\nThanks \n@oodle"
    },
    "url": "https://gameknot.com/annotation.pl/bishops-vs-knights?gm=49461",
    "gameName": "Bishops vs. Knights",
    "players": "John Fevil (2575) vs. Andrew Gold (2625)",
    "opening": "Sicilian (B21), Smith-Morra gambit"
}