{
    "moves": {
        "1. d4": "At the moment I prefer to play against d4 then e4 because I am in the proccess of 'booking up' on the petroff defense.",
        "1... Nf6 2. c4 c5 3. d5 e6": "My two big choices here are either 3... b5 or e6 (as I did play), b5 being the benko and e6 being the benoni. I personally opt for the benoni because I feel I have more opening knowledge on the benoni but the benko I still perfectly reasonable.",
        "4. Nc3 exd5 5. cxd5 d6": "This is all very standard.",
        "6. e4 Be7": "6... g6 followed by Bg7 is the norm here but I decide to play Be7 which I would say is probably worse because this bishop now has no future whilst on g7 it controls a large part of the centre.",
        "7. Bd3": "Most people play Nf3 here but Bd3 is still good.",
        "7... Nbd7 8. Nf3": "As expected.",
        "8... Ne5": "This is an interesting move. At first this is very weakening because after 9.Nxe5 dxe5 white will have a nice outpost on d5 which good come into good use later but it turns out that this pawn may of cost him the match.",
        "9. Nxe5 dxe5 10. O-O Bd6 11. Bg5": "Here 11.Bb5+ would have been slightly better but is nothing that spectacular.",
        "11... O-O": "At long last I castle!",
        "12. f4": "Looks good at first with the intention of the eventual pawn push to e5! but really just gives black a chance to push the strong bishop on g5 away.",
        "12... h6": "The correct move.",
        "13. fxe5 Bxe5": "White has know gone from a great postition equal to a pawn up to equal.",
        "14. Bf4 Bxf4": "Bd4+ would have kept the tempo up.",
        "15. Rxf4 a6": "This is a complete inaccuracy, White has a much more favourable position after 16. e5 Nd7 17. Qe2. ",
        "16. a4": "Black was let off the hook as it happens.",
        "16... Qd6 17. Qf3": "Here I spend 45 minutes contemplating this move, can you see why? I was looking at a couple of variations including 17...Nh5 or B/Ng4. If Nh5 then white can just proceed with e5 or Rh4 (both of these are acceptable). I thought that the must surely be some way of me trapping his rook but even the computer says not.",
        "17... Bg4": "Giving my undeveloped bishop a lovely outpost on the g5 square.",
        "18. Rxg4": "He falls into my trap, Qe3 would of probably been a better choice.",
        "18... Nxg4 19. Qxg4 c4": "This forces a loss of a piece. If 20.Bxc4 then Qc5+ wins it and if Be2 then Qb6 wins the b2 pawn which forks the knight and rook.",
        "20. Bxc4": "He realises his mistake and figures this must be the way of losing it with most compensation.",
        "20... Qc5+": "Qxb6 is just as good but I don't want to waste any more time if I don't need to.",
        "21. Kh1 Qxc4 22. Qf5 Qb4 23. Qf2 Qd6 24. Qf5 b5": "An ambitious move which looks good OTB but if he had time to think about it e5 would of been more then enough compensation for the exchange.",
        "25. a5 f6": "Swapping off would be beneficial for me.",
        "26. Ne2 Qe5 27. Rf1 Rac8": "I don't want to take a risk with such little time so just go with what looks standard.",
        "28. Qxe5": "Nf4 would have been a better choice here.",
        "28... fxe5 29. Rxf8+ Kxf8": "Now he may aswell just resign, the rook can easily swipe up all of the pawns whilst the knight is virtually powerless.",
        "30. Nc3": "This makes matters worse for himself.",
        "30... b4 31. Ne2 Rc2 32. Ng1 Rxb2 33. g3 Ra2 34. Nf3 b3 35. Nxe5 b2": "This game shows how in time trouble all it takes is one mistake, the slightest inaccuracy may determine whether you have a won or lost endgame!"
    },
    "url": "https://gameknot.com/annotation.pl/blackpool-chess-congress-round-3?gm=43723",
    "gameName": "Blackpool Chess Congress - Round 3",
    "players": "Tim Hilton (146) vs. James Friar (153)",
    "opening": "Benoni (A65), 6.e4"
}