{
    "moves": {
        "1. e4": "I will try to annotate this game for you, my friend mario62. It's my first time and I don't think I have enough knowledge to properly analyze a game, but never mind....",
        "1... c5 2. f4": "This is the initial position of the mini-tournament",
        "2... d5 3. e5 Nc6 4. c3 Bf5 5. d3": "I project d5-d4 to open the game, but not yet...",
        "5... e6": "...this protect my d pawn and gives a path to develope my king side pieces",
        "6. h3": "I think, this is where you, my friend, lost the game. I think you wanted to make pressure on my white sqared bishop from the beginning, but the king cannot be defended from a qween diagonal attack anymore. I didn't understood this at the moment, and...",
        "6... d4": "...maybe i would have moved 6. ... Qh4+, otherwise, but in the end i think 6. ... d4 was the right move as it gave me more control on the center, either if 7. cxd4 (since my night become very dangerous with 7. ... Nxd4) either if not (since the d pawn itself is in a strong position)",
        "7. g4": "(Surprise!) This is what, i think, you had in mind from 6. h3, and, beleave me, I had not seen it yet! But...\r\n\r\n1) The path 7. ... Bg6 8. f5, which I think was the attack you wanted to do, opens dengerously the king side when you have not moved a piece yet. It will be terribly hard to do qween side castle and you will have to let your king in the front line. \r\n2) Above all, instead, I can defend my bishop, checking your king with the qween!",
        "7... Qh4+": "... and castling chances are over",
        "8. Kd2": "I agree. the only other possibility was 8. Ke2, which leads to a rock+pawn for bishop at least.",
        "8... dxc3+": "I need to clear the center, where the king is. d file now is a good place for a rock.",
        "9. Kxc3 Bg6": "No problem for my white squared bishop as I said, it is well defended by my e pawn.",
        "10. Nf3": "(Surprise!) Good move. It gives you tempo and leads you to a better position. I am scared about my Qween!",
        "10... Qd8": "I have thought a lot about this move. Maybe 10. ... Qg3 was good too... I wantet a Rock in d8, not the Qween. But I don't want to let my qween all alone in the enemy field. Qe7 is not good for me, since it is in e7 where my dark squared bishop and king side night have to pass to complete my opening.",
        "11. Bd2": "You are trying to take your king home... ",
        "11... Nge7": "I need to complete my opening to do my final attack.",
        "12. Kc2 Nd5 13. Nc3 Ncb4+ 14. Kb1": "Maybe Kc1 was better, since d3 in pinned this way. But maybe not so better... :)",
        "14... c4": "I don't see many chances for you. I am attacking with a bishop, two connected nights, the qween and (in a move) a rock. I can easily castle king side to connect the rocks and obtain help from all my pieces. You have your rocks out of the game yet (one almost definitively), and the bishops trapped by your pawns. It's time to attack.",
        "15. Nxd5 Qxd5 16. Bxb4 Bxb4": "I have 2 bishop vs a bishop and a knight. This is a very good thing in open games! Now I can castle and connect my two Rocks.",
        "17. Be2": "I have 3 pieces which attack d3. 2 of them gives me a double attack checking your king. The third become a well defended passed pawn in the 6th line! You have only two pieces which can defend d3, maybe you had to pay more attention to this.",
        "17... cxd3": "I thought I had still time to caste. But...",
        "18. Qa4+": "(Surprise!) I dind't see this. I can't defend my black squared bishop, but luckyly (as I absolutely didn't see it before...) I can save my castle chances and don't risk to loose the possibility to use my king side rock in the attack.",
        "18... b5 19. Qb3": "(Surprise!) Good move! Infact, after 19. Qxb4 I can play 19. ... d2 mate in 2!!",
        "19... dxe2+": "I saw I can sacrifice my qween and check mate in some moves, so I don't want to exchange Qweens.\r\n\r\n",
        "20. f5 exf5": "Here Is the sacrifice!",
        "21. a3": "Right! This gives you some more time. Otherwise:\r\n21. Qxd4 fxg4+!\r\n22. Kc1 Rc8+\r\n23. Q? RxQ?#...",
        "21... Qxb3 22. axb4 Rd8": "Check mate is inevitable...",
        "23. Ra3 Rd1+ 24. Rxd1 exd1=R#": ""
    },
    "url": "https://gameknot.com/annotation.pl/black-stallion-mini-tournament-xx?gm=23518",
    "gameName": "BLACK STALLION Mini Tournament XX",
    "players": "mario62 (1266) vs. karbone (1630)",
    "opening": "Sicilian (B21), Grand Prix attack"
}