{
    "moves": {
        "1. e4": "The opening is boring until I make a mistake.",
        "1... e5 2. Bc4 Nf6 3. Nc3 Bc5 4. d3 h6 5. f4": "Here comes the mistake...",
        "5... Ng4": "Not paying enough attention, my knight commits suicide.",
        "6. Qxg4": "The Queen begins and attack, backed by the developed white bishop.",
        "6... g6": "I'm forced to defend g7.",
        "7. fxe5": "White's pawn continues his march.",
        "7... d6": "I confront the pawn and uncover an attack on White's Queen.",
        "8. Qf3": "His retreat opens a checkmate threat on f7.",
        "8... O-O": "I castle to protect the pawn and guard the King.",
        "9. Bxh6": "White takes a free pawn, attacking the rook that I cannot move, but this is where I turn the game around for a fairly quick checkmate.",
        "9... Qh4+": "Knowing that I can't defend the rook, I put White in check and position myself to capture the menacing bishop.",
        "10. g3": "With no way to save the bishop. White puts a pawn in the way.",
        "10... Qxh6": "Some pressure is taken off of my king, and the rook is saved.",
        "11. Nd5": "Seeing no need to protect his king any further, White begins a new attack that I cannot stop.",
        "11... Nc6": "I choose to counter attack and simultaneously leave my rook room to escape the knight's predictable next move.",
        "12. Nxc7": "White ignores my advance, and takes the pawn.  The beginning of the end.",
        "12... Nd4": "My knight safely moves to put his queen in check while positioning itself to fork the king and rook unless his queen defends pawn c2.",
        "13. Qd1": "With few available options, White's queen goes back home, allowing my Queen to come in to attack.",
        "13... Qe3+": "White can either surrender his queen to my knight or walk into checkmate by putting his knight in the way.",
        "14. Ne2": "Unable to part with his Queen, he makes his second to last move.",
        "14... Nf3+": "Now the king has nowhere to go but f1.",
        "15. Kf1": "I could end the game by moving the Queen to f2 or bringing my white bishop down to h3, which I found to be more interesting.",
        "15... Bh3#": "Somehow, the game I should have lost turned around in my favor.   I've won even though I only captured one of his pieces and lost a knight and three pawns."
    },
    "url": "https://gameknot.com/annotation.pl/blacks-quick-comeback?gm=17711",
    "gameName": "Black's quick comeback",
    "players": "- white (1370) vs. antonino-c (1444)",
    "opening": "Bishop's opening (C24), Berlin defence"
}