{
    "moves": {
        "1. e4 e5 2. Nf3 d6 3. d4 Qe7": "  Not sure this is a regular movement here, seemed not too good to me, but... I couldn´t find a countermeasure to it.",
        "4. Nc3 c6": "To avoid having 5.Bg5 and 6.Nd5",
        "5. Bc4": "I must admit I was feeling overconfident, and started to pay not much attention to black´s development, but on the other hand didn´t think much about my own, and thought developing pieces would give me an upper hand at the end of the opening.\nMaybe 5.Bg5 would have yielded a better defense here, and opens the possibility of a long castling.",
        "5... a6": "Another movement that slows development , in my thought. There must be many better and aggressive alternatives for white here instead of the castling I did, like Ng5, but , again, I didn´t think much of it, I just wanted to finish the opening and not waste too much time in preemptive attacks.",
        "6. O-O Nf6 7. dxe5": "But I found myself without an idea of what to do. Exchanging pawns did not enhanced white´s position. Again, Ng5 and then f4 (if possible) seemed more adequate.",
        "7... dxe5 8. h3 g5": "Didn´t even think much on whether taking or not taking the pawn. I just felt shocked and it was that feeling that made me feel like my position was inferior, much worse than what it was in reality. I tried to look for a counterattack , but then, I found nothing; it seemed that black´s King is safe enough to focus on attack and I don´t have much left. It is one of those occasions when you feel like not accepting the gambit, because there must be a good reason not to (opening the column, etc) and yet, it is more than doable (after a light post-game analysis from my side)",
        "9. Re1": "Weak weak movement. How about 9.Nh3. It seems better if defense is the plan here (not to talk about, as previously mentioned, Nxg5, which is much better)",
        "9... g4": "And here comes hell",
        "10. hxg4 Bxg4 11. Be3": "Another movement that is not that active, but the shock was still freezing my mind. I was thinking of a counterattack on my Queen´s side, but always having the feeling it was for nothing, and blacks attack is unstoppable.",
        "11... Nbd7 12. a4": "TRying some sort of counterattack, not sure what to do.",
        "12... Rg8": "And here comes hell",
        "13. Be2": "Not many ideas left, and enclosing the queen, but threats in f3-g2 are too dangerous.",
        "13... h6": "I guess that it was to provide N in f3 a jump point to reach g5, but it seems to me that it gives white a respite. O-O-O seemed more threatening, but I may be wrong.",
        "14. Qd2 Bh5 15. Bxh6": "Taking h6 was not a happy moment for me, but I was running out of time, and thought I could at least activate my queen somehow. Of course, black now the 8th line completely open. a very interesting sacrifice.",
        "15... Bxh6 16. Qxh6 O-O-O 17. Qe3": "Aiming for a7 and moving the queen to a safer position.",
        "17... Kb8": "HEre is when I spent most of my little time I had left. I thought about Ng5!? and or Bxc6, looking at least for a draw position, but nothing clear came to me, so I tried a slower but safer approach.",
        "18. Ra3 Qe6": "I was paying no attention to black´s attack here, aiming for a grand finale with a sacrifice, and  thus didn´t see the incoming attack, thinking Queen´s move was a waste of time (I was thinking about doubling rooks on g), but...",
        "19. Bxa6 Qg4": "..I thought I was lost. THreats in g2 and also Qxf3 seem way too much. Now, under a minute of time left, I found some sort of defense.",
        "20. Nh4": "!\nGives some time for me to find a drawing position",
        "20... Qxh4 21. Rb3 c5": "Nice defense! I had no clear end for this game, but it was thrilling and beautiful!",
        "22. Rxb7+ Ka8": "Kc8 leads to the same position unless or else draw",
        "23. Nb5": "Threatening Nc7++. I was thinking inc ase of black 23...Rf8, what to do, what to do...24. Ra7+ with 25.Bxf8 doesn´t seem to compensate. I need to bring the queen into the fight there, but how?",
        "23... Qg4": "Unfortunately (I think the game was now at it´s most interesting stage) my rival did not see the mate, but it was an amazing player and aggressive, glad to enjoyed these minutes with him. We even tried a new game, in which he kicked my a..s much more easily.\n\n Hope you guys have enjoyed this one!"
    },
    "url": "https://gameknot.com/annotation.pl/blitz-5m?gm=58647",
    "gameName": "blitz 5m",
    "players": "kenderfender (1853) vs. cdeuce2u (1448)",
    "opening": "Philidor's defence (C41)"
}