{
    "moves": {
        "1. e4 e5 2. Nf3 Nf6 3. Nxe5 d6 4. Nf3 Nxe4 5. Nc3": "Really, not much to be said here. I think most would prefer this dynamic move ahead of the duller 5.d4, which is more common, and results more of a slower game, due to the static centre.",
        "5... Nxc3 6. dxc3 Be7 7. Be3 Be6 8. Qd2 Nc6": "My opponent has come up with a creative idea, that is at least not mentioned in the theory books of this line. He intends to castle on the long side, and therefore avoids my attack against the kingside.",
        "9. O-O-O Qd7 10. Bb5 a6 11. Be2 O-O-O 12. Kb1": "Simply consolidating the castling position. By the way, here is a nice little tip about castling: \"Castling Queenside, on average, is slightly better than castling on the kingside. The reason is that activity is the idea of a chess game. By castling long, the rook is activated immediately, since usually the d pawn is advanced. Most cases, the f pawn is not advanced, and it takes extra turn to move the rook to a central file. Many can say that Kb1 takes a tempo too. However, it is not always obligatory, while moving the rook to central file is almost always obligatory.",
        "12... Bf6 13. Nd4 Nxd4 14. Bxd4 Qa4": "This move is probably a mistake, because it allows me to create weaknesses by taking the f6 bishop.",
        "15. b3 Qa5 16. Bf3": "Instead of taking immediately, I simply activate by bishop to better diagonal. The position is equal, and I am satisfied with a draw vs the opponent. I also want to keep it simple, since he has 430, and I am 4.",
        "16... Rhe8 17. Bxf6 gxf6 18. Rhe1": "White can now focus his attention to the weak target on f6. The white army is very active, but the position is rather quiet.",
        "18... Bf5 19. Kb2 Re5": "This move turns out to be quite a bad one, despite that it looks good. It has a tactical flaw. Now I can take advantage of it and win material. 20.Rxe5, and now the d pawn is pinned, while the taking with the queen lets 21.Re1, getting the file.",
        "20. Rxe5 fxe5 21. Qg5": "black intended to continue his idea, but spent way too little time here. If he had looked at this position a bit longer, he would have noticed he is losing decisive material.",
        "21... Bg6": "This move lets me a second option. If a move like 21...Bd7 22.Bxb7+ wins decisively. Now I choose to take the pawns as advantage, since I feel I can march my own pawns up the board.",
        "22. Bg4+ f5 23. Bxf5+ Bxf5 24. Qxf5+ Kb8 25. Qxh7": "And indeed, white is winning the game. Unfortunately, the calculations and the checking took too much time(and I had to pick up the phone as well), and now have 59 seconds upon the clock. If there was even a small increment, I would be winning easily. Now it is not so certain.",
        "25... Qc5 26. Rd2 Qc6 27. g4 Qf3 28. g5": "My first mistake in time pressure. Now 28...Qf4 wins a pawn. However, my opponent is also playing very fast, and trying to imbalance the game.",
        "28... Qg2 29. g6 Ka7 30. h4": "I am going to need a second pawn to help my g pawn.",
        "30... e4 31. h5 e3": "Just kept pushing the h pawn up, completely missing the opponent's idea. However, I have a forced win here.",
        "32. fxe3 Qxd2 33. g7 Qg2 34. h6 a5 35. Qh8": "This is the clincher, now h7 is coming up, with 2 white queens. I knew I was lost here, due to my 4 seconds.",
        "35... Rxh8 36. gxh8=Q Qh3 37. Qg7 Qxe3 38. h7 a4 39. h8=Q a3+": "I lost on time. It was a good game though. And there was only one real mistake one my part in  the blitz game, on move 28. But although I lost, I was still very happy about the game as a whole. Really, the only thing you should focus on is the quality of the chess game you played, not the result. If you lose, but played very well, that means you are imporving. If you play badly, and win, sooner or later you will not get so lucky. In this game, the players were stronger than the average opponent. There was really only one mistake made by both sides. Black's only real mistake was letting go of the material(the doubled pawns can be overlooked, since they were difficult to attack, and in blitz, opening lines for your pieces and ignoring structure more or less is a good idea.), and my mistake I mentioned already. His mistake was a bigger one, and I won the position, but lost the game. "
    },
    "url": "https://gameknot.com/annotation.pl/blitzkreig?gm=45425",
    "gameName": "Blitzkreig. ",
    "players": "Me (1893) vs. Opponent(CM) (2042)",
    "opening": "Petrov (C42), Nimzovich attack"
}