{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Bc4 Bc5 4. d3": "The very quiet game",
        "4... Nf6": "This is (unless I am mistaken) the two knights defense where white can and does move his knight to g5 to threaten a fork. After which, black usually castles to avoid the fork and defend the f pawn.",
        "5. Ng5": "What did I tell you?",
        "5... O-O 6. Nxf7": "?! I feel this is an inaccuracy. Two minor pieces are usually better than a rook and a pawn, as is shown in this game as my minor pieces mill around his king.",
        "6... Rxf7 7. Bxf7+ Kxf7 8. O-O d5": "So I played this move to gain more central control and prepare to develop my LSB.",
        "9. exd5 Qxd5": "I felt this was better than the knight recapture as this develops my queen. ",
        "10. c3": "Prepping b4 to chase my bishop.",
        "10... Bg4 11. Qd2 Nh5": "Here I started seeing possibilities of if I could move my knight closer, some king of sacrifice to draw his king out.",
        "12. b4 Bb6 13. a4": "He's trying to trap my bishop.",
        "13... a6 14. c4": "Chase, chase, chase, chase, he chases all my pieces around.",
        "14... Qd4": "Kachunk. My queen settles into a solid position. (Whenever I put a piece in a good position like that, I always think of a sound like 'kachunk'",
        "15. Bb2": "Eh... not a great square for long!",
        "15... Qf4": "His king is under serious pressure, and I didn't want to trade queens, but I didn't see any other move that I liked.",
        "16. Qxf4+ exf4": "Taking with the knight would have brought it off the rim, but this un-isolates my pawn.",
        "17. a5 Bd4 18. Bxd4 Nxd4": "Black is clearly better. He has much superior piece activity (his rook is abysmal though, but no worse than white's.) ",
        "19. Na3": "White *finally* completes his development",
        "19... Ne2+": "! This is a pretty nice move I think, even though it's a little obvious.",
        "20. Kh1 f3": "If he oh so foolishly takes my pawn, then Bxf3# cleans up the game.",
        "21. h3": "Nope, sigh",
        "21... fxg2+": "I took a *long* time on this move.",
        "22. Kxg2 Nef4+": "Better might have been moving the knight on h5, as that would take it off the rim.",
        "23. Kh2 Bxh3": "I took a long time there too, trying to figure out which piece I should take with. I settles with the bishop because the king is on a black square and this attacks the rook. It also confines the king to only two remaining squares.",
        "24. Nc2": "Trying to get some defenders over, but overlooks the threat to his rook.",
        "24... g5": "I overlook it too.",
        "25. Ne3": "He does it again!",
        "25... Rg8": "Me too!",
        "26. f3": ":X",
        "26... g4": ":X!",
        "27. fxg4 Bxf1": "Finally!",
        "28. Nxf1": "? better would have been the rook. This looses the pawn.",
        "28... Rxg4 29. Ne3": "This is quite good, prevents me from moving my rook to g2, and attacks it.",
        "29... Rh4+ 30. Kg1 Nxd3 31. Rd1 Nhf4": "This adds defense.",
        "32. Rf1": "! pins my knight.",
        "32... Rh3 33. Nd5 Ke6": "?? I was trying to get my king involved, but I think this was a pretty bad blunder, as it allows him to win my knight.",
        "34. Nxf4+ Nxf4 35. Rxf4": "Well, I'm only ahead by a pawn, but maybe I can still manage a win.",
        "35... Ke5": "After all, my king is much more active.",
        "36. Rf7 h5 37. Rxc7 Rg3+ 38. Kh2 h4 39. Rxb7": "I offered a draw. He accepted. I think except for my blunder that I played pretty well."
    },
    "url": "https://gameknot.com/annotation.pl/blitz-game?gm=50844",
    "gameName": "Blitz game",
    "players": "porcho (1043) vs. richardgordon (1221)",
    "opening": "Giuoco Pianissimo (C50)"
}