{
    "moves": {
        "1. d4": "I won this game, so for the sake of balance, the previous game where I lost as white (may annotate later, but probably not worth it - I was trying to play against philidor's defence, but forgot that the line I usually play is 3. d4 exd4 4. Qxd4 Nc6 5. Bb5 Bd7 6. Bxc6 Bxc6 7. c4, played c4 much too early and ended up losing my queen to a knight-fork)\n1. e4 e5 2. Nf3 d6 3. c4 Nf6 4. Nc3 Be7 5. Be2 O-O 6. d3 c5 7. Bd2 h6 8. Rc1 Nc6 9. h3 Nd4 10. Bf1 Be6 11. Nh2 a6 12. g4 Nh7 13. f4 exf4 14. Bxf4 Ng5 15. h4 Nh7 16. h5 Bh4+ 17. Kd2 Bg5 18. Bxg5 Qxg5+ 19. Ke1 Qe3+ 20. Ne2 Ng5 21. Qd2 Ngf3+ 22. Nxf3 Nxf3+ 0-1",
        "1... Nf6": "Blitz games are great for experimenting (the previous game was a failed experiment), so I play a kings indian. That and the Sicilian are probably my favourite openings for black (other than the Benko, which I don't really know enough about to play it properly, and the KI is simpler). The basic idea is lock the centre, play f7-f5 and get an attack on white's king.",
        "2. c3 d6 3. Bf4 g6 4. Nf3 Bg7 5. e3": "his moves are weird (to me - why not 2. c4), but putting the pawns on dark squares and his d-s bishop out of the pawn chain is a reasonable plan",
        "5... O-O 6. Bd3": "h3 would fit better with his plan, denying me g4 and preparing to retreat the bishop to h2.",
        "6... Nh5 7. Bg3": "probably best, but hxg3 is better than fxg3 because of the attack on the h-file - this possibility could make Nxg3 a mistake, but screw it, its only Blitz!",
        "7... Nxg3 8. fxg3 f5": "securing e4",
        "9. O-O e5 10. dxe5 dxe5 11. Bc4+ Kh8 12. Nbd2 e4": "The pawn on e3 is looking pretty weak now",
        "13. Nd4 c5": "denying him the outpost on d4",
        "14. Ne6": "can't allow him to stay there, so I capture",
        "14... Bxe6 15. Bxe6 b5 16. Bb3 c4": "and this possiblity is one reason why I took his knight. Bishops (who are the same colour as most of your pawns), who needs em?",
        "17. Bc2 Na6 18. Qe2 Nc5 19. Rad1 Nd3": "So this is what I was thinking about. The capure is pretty much forced (or b2 needs to be defended, and I can probably win [citation needed]), so I'll end up with a protected passed pawn, as well as a pawn structure and bishop that together control most of the board. Nimzowitsch would be proud!",
        "20. Bxd3 cxd3": "this capture is probably better, after exd3 the c4 pawn could be weak. But then I'd be able to attack the e3 pawn from the front, so its possible this weakness wouldn't matter. Maybe I just wanted a chain of 6 pawns - it looks impressive!",
        "21. Qf2 Qc7 22. Nb3 a5 23. Nd4 b4": "So, how to deal with the knight on d4? b5-b4 is probably best. I'd be lying if I said I saw the fork on e6 (perhaps to avenge the death of white's other knight?), so never even considering covering e6, but the exchange sacrifice is probably good - possibly better after Ne6 would be Nxg7, capturing my strong bishop, but white would still have a lot of weak pawns (he needs to defend c3), and black would still have the connected passed pawn on d3.",
        "24. Ne6 Qe7": "An unintended exchange sacrifice that probably wins",
        "25. Nxf8 Qxf8": "Qxf8 to support f5-f4 if I want to, the rook and bishop are both well placed",
        "26. c4": "Probably best",
        "26... a4": "preventing b3 - or making it cost a lot",
        "27. b3 axb3 28. axb3 Ra3 29. Rdb1 Qc5 30. Qf4 Be5": "Playing to capure on e3, and I'll have connected passed pawns",
        "31. Qg5 Kg7": "because the queen will be forced to move after h7-h6, Rf-e1 may be best",
        "32. Rfd1 h6 33. Qd8": "The queen looks dangerous here, but I can escape perpetual check by putting my king on h7 and the bishop on g7",
        "33... Qxe3+": "What I've been playing for. I'm almost certainly winning",
        "34. Kh1": "It looks like a back-rank mate could be possible",
        "34... Bc3": "controling the queening square (after d3-d2), e1",
        "35. Qe7+ Kg8": "My king may need to get to h7",
        "36. c5 d2 37. Qe6+ Kh7 38. Qc4 Ra5": "Giving up on a back rank mate ( without the queen protecting b3, 1. ... Rxb3 2. Rxb3 Qe1!!) - as the passed pawn would promote to quickly. Instead, I have Rc5, either capturing the pawn or winning it.",
        "39. c6 Rc5": "White's counterplay is pretty much over now. The rest is probably just technique",
        "40. Qf7+ Bg7": "Avoiding perpetual check",
        "41. c7 Qc3": "Capturing the pawn just in time.",
        "42. Qd7 Rxc7": "Sacrificing the pawn on d2, to force the exchange of queens - I'm still better because white only had one candidate passed pawn, I have d2, e4 and even f5 is 'half-passed'.",
        "43. Qxd2 Qxd2 44. Rxd2 Bc3 45. Re2 Kg7": "The plan is to just advance the pawns and king",
        "46. Rd1 Be5": "Freeing c3 for my rook",
        "47. Red2 Kf6": "Stopping any checks (or even the threat of a snap checkmate)",
        "48. Kg1": "My pieces are a lot more active - his king only now moves from h1!",
        "48... Rc3": "Making a rook passive.",
        "49. Rb1 g5 50. Kf1 f4": "To support the advance e4-e3",
        "51. gxf4 gxf4 52. Rf2 e3 53. Rf3 Kf5": "There isn't much white can do (unless you can suggest something), so I take my time to ensure the win.",
        "54. Ke2 Rc2+": "Not letting his king become active (although there wasn't much it could do, keeping him boxed in seems good)",
        "55. Kf1 Ke4 56. Rh3 e2+ 57. Ke1 Bc3+ 58. Rxc3": "Forced",
        "58... bxc3 59. b4 Kd3 60. b5 Rb2": "And white resigned, although he fought hard. If it looks like I'm being harsh on white, remember the game in the comment at the start where he kicks my arse."
    },
    "url": "https://gameknot.com/annotation.pl/blitz-game-no3-who-is-this-nezhmetdinov-person-anyway?gm=28182",
    "gameName": "Blitz game no3: who is this Nezhmetdinov person anyway?",
    "players": "anacarmen  vs. no_genius ",
    "opening": "Queen's pawn game (A45)"
}