{
    "moves": {
        "1. d4 Nf6": "I wanted to play Gruenfeld",
        "2. e3": "I had seen this before he wanted to play a stonewall formation",
        "2... g6": "I continue on as normal",
        "3. g3 Bg7 4. c3": "It appears he wants a very big stonewall",
        "4... d5": "I gain some central control and I want e4 as a outpost for my knight",
        "5. c4": "Interesting loss of tempo",
        "5... O-O 6. c5": "Increases his pawn chain. No developing moves so far",
        "6... b6": "I look to break his chain",
        "7. b4": "Seven moves still no development",
        "7... Bg4 8. Be2": "Finally some development but it was forced",
        "8... Bxe2 9. Nxe2": "He develops his first piece that won't be captured immediately",
        "9... Na6": "I look to hit the base of his pawn chain",
        "10. a3 bxc5 11. bxc5": "Now there is an open b-file to play with",
        "11... Re8": "I plan on hitting the d4 pawn with e5 and he can't take the b-file for a while yet",
        "12. Qd3 e5 13. Qxa6": "I didn't see this",
        "13... exd4 14. exd4 Qe7": "I may be a whole minor piece down but his king is in a awkward position",
        "15. Be3 Ng4": "I can win a pawn here",
        "16. Qd3 Nxe3 17. Qxe3 Qxe3 18. fxe3 Rxe3": "I know not to exchange when down but his Knight is pinned",
        "19. Nd2 Bxd4": "Attacking the rook and now my deficit is 1",
        "20. Rb1 Rae8": "Threatening to win back my lost piece + gain a two point advantage",
        "21. Nf3 Re3xe2+ 22. Kd1 Bxc5": "Now I have a three pawn advantage",
        "23. Re1 Re2xe1+ 24. Nxe1": "He makes my game a lot simpler",
        "24... Bxa3 25. Rb7": "He looks to attack my unmoved pawns. The rook is very powerful on the seventh rank",
        "25... c5": "Connected passed pawns are stronger than Isolated ones",
        "26. Rxa7": "Natural",
        "26... Bb4": "If I can trade pieces I will win",
        "27. Nd3 f5": "I don't mind Splitting my passed pawns If it means the ending is simpler because I will still win due to my pawn majority",
        "28. Nxb4 cxb4 29. Ra5": "He looks to get rid of my d-pawn but I preferred Rb7 winning the b-pawn",
        "29... Re5": "Centralizing my rook can't be bad although it does pin the d-pawn",
        "30. Kc2 h5": "I also have a K-Side pawn majority to use",
        "31. Kb3 g5 32. Kxb4 h4 33. gxh4 gxh4": "Now I have  a passed f-pawn that after f4 and Rf5 I can protect my d-pawn and push my f-pawn",
        "34. Kc5": "? He loses all chance of drawing",
        "34... d4+": "Now he must play kb4 to trade rooks and I can Queen",
        "35. Kb4 Rxa5 36. Kxa5 d3 37. Kb4 d2 38. Kc3 d1=Q": "I will now win comfortably",
        "39. Kc4 Qf1+ 40. Kd4 Qf2+ 41. Ke5 Qxh2+": "I free my H-pawn",
        "42. Kxf5 Qe2": "I look to trap the King in a common K and Q ending I don't mind about the pawn. It will make the ending easier if its not there",
        "43. Kg5 Qf3 44. Kxh4 Kf7 45. Kg5 Ke6 46. Kh4 Qg2 47. Kh5 Kf6": "Better was Kf5 which checkmates a move earlier",
        "48. Kh4 Kf5 49. Kh5 Qg5#": "And there we go. An interesting game where I managed to win back a piece and win with a pawn majority"
    },
    "url": "https://gameknot.com/annotation.pl/blitz-game?gm=38520",
    "gameName": "Blitz game",
    "players": "blackassboy  vs. thedessertfox ",
    "opening": "Queen's pawn game (A45)"
}