{
    "moves": {
        "1. e4 c5 2. d3": "Weak response against Sicilian, but liked to try something different. That is the fun on a blitz game! (although the movement is not very active...hence not much fun for white it announces)",
        "2... Nc6 3. g3": "3.Nc3 seemed the adequate defense to prevent d5.",
        "3... d5 4. Bg2 d4": "Strong pawn in d4. But 4...dxe5 seemed more interesting. Yes, the fianchetto now is open, but it takes too many times for white to develop to safety.",
        "5. Ne2": "Helping in f5 when opening there",
        "5... e5": "Closing the center. Very strong for black, that has plenty of room to develop.",
        "6. O-O Nf6": "Seems to be following regular development rules, but I think black has to have in mind f5 and hence, maybe 6...Bd6: 7...Ne7 with the possibility of f6 seemed more interesting. Not sure of this quick analysis though.",
        "7. c4": "Trying to secure the center somehow. Black doesn´t want to lose the pawn in d4, so I was just trying to set a defense for the incoming attack on the queenside. Maybe an unnecessary and risky movement, since white needs and wants to focus on the Kingside, the only area where it can develop some trouble for black.",
        "7... Be6": "A just movement. No need to look for a quick castling yet, I think.",
        "8. h3": "Avoiding Ng4 and also setting the prelude for the ultimate advance on the BK (after castling)",
        "8... Be7 9. f4": "White has a poor development on his left flank and it will take time for those Nb1 and Bc1 to do something else that stay and watch, but on the other hand, the rest of the pieces are ready to collaborate for the assault on the BK side.",
        "9... O-O": "Not sure of black needed to do this, although it seems perfectly normal. The pawn advance on the castling now seems too strong and dangerous. And yet, white doesn´t seem to have enough firepower to support the assault.",
        "10. f5": "A very straight movement. The plan is very clear, but the tactic to make it successful is not so easy to find.",
        "10... Bd7 11. g4 g6": "Maybe the worst mistake for black´s in the whole game. Weakening the defense was not only unnecessary, but risky and may be giving white the chance to complete the assault.",
        "12. g5 Ne8 13. f6 Bd6": "Now then, how to proceed. Trying to mate in g7 seems to be ineffective here. But maybe in WQ can move to h6 and from there hold black pieces while advancing pawn in h and supported by the rook, the victory seems feasible.",
        "14. Qe1 Kh8": "Allowing hte rook to defend g7 while bring back to defense BB by placing it on f8.",
        "15. a3": "Not sure what to do and thought that N in c6 was a pain in case of Nb4, which would tie my N in a3. Instead , I want that N released and joining the attack. It may be a waste of time, but couldn´t find out how else to proceed now (not enough time for the plan of Qh6, pawn in ha advance supported by rook mentioned before)",
        "15... Qc8 16. Qh4": "It defends h3 and at the same time helps me making a decision. Now that I see it, maybe Qg3 was more effective, for the plan would be then Kf2 and then Rh1. In case of black trying h5, I was thinking about Ng3 and then sac in h5 to enter then with the queen.",
        "16... Rg8 17. Nd2": "Bringing in more firepower. Now different sacs are possible thanks to this little jumper.",
        "17... a5": "Black seems to be in a sort of zuzgwang. Has to try a counter attack on queen side",
        "18. Nf3 Nc7 19. Nh2 b5": "No trouble here for white as far as keeps calm",
        "20. b3 bxc4 21. bxc4 Re8": "Rook is released from service, since Bf8 seems to cover the situation nicely.",
        "22. Ng4": "This is a bluff, but at the same time, after Nh6 there is a threat in f7 (covered easily by black, hence the bluff) Black should not take on g4, since it will open that column for the rook to assist.",
        "22... Bxg4": "But it does (hoping to find 23.Qxg4?  ?)",
        "23. hxg4 Bf8 24. Kf2": "The plan is very clear, as mentioned before.",
        "24... a4 25. Rh1 h6": "That sacrifice seem to be the only defense for black; even losing one pawn seem to be alright in such a tight situation. But there is a surprise against that idea.",
        "26. Bd2": "White doesn´t need to take the pawn!",
        "26... Ne6 27. Qxh6+": "And here we go. It is mate in 4!",
        "27... Bxh6 28. Rxh6+ Kg8 29. Rah1": "Great ending for an interesting game."
    },
    "url": "https://gameknot.com/annotation.pl/blitz5m-queen-sac?gm=58989",
    "gameName": "blitz5m  Queen sac",
    "players": "kenderfender (1853) vs. dwilliams48 (1200)",
    "opening": "Sicilian defence (B20)"
}