{
    "moves": {
        "1. e4 e5 2. Nf3 f5": "The Latvian Gambit is of course my go-to opening in blitz.",
        "3. Nxe5 Nc6": "?! Standard is 3...Qf6.",
        "4. Nxc6 dxc6 5. e5": "Standard, and strong.",
        "5... Qd4": "The GK world database only includes one game with this line, but I far prefer it to the alternatives. Black prevents White from freeing himself with d2-d4, at least for now.",
        "6. Qe2 Be6": "Blocking the advance of the pawn and preparing to castle.",
        "7. c3 Qd7 8. d4": "It could not be avoided forever.",
        "8... O-O-O": "Black has a slight edge in development thanks to White's misplaced Queen.",
        "9. Bg5 Re8 10. Nd2 h6 11. Be3": "This is the only move that doesn't hang the Bishop.",
        "11... g5": "Black is looking for space and a kingside attack.",
        "12. f4 gxf4 13. Bxf4 Be7": "13...Ne7 was probably better, to clear g8 for a Rook.",
        "14. Nf3": "White continues to prevent Black's DSB from getting into the game. White is probably a bit better here, though his piece placement is less than optimal.",
        "14... Qd5 15. Qc2": "Finally letting the LSB out--necessary if White ever wants to castle, since his queenside would look pretty weak after trying to shore up a2 against the Black LSB.",
        "15... c5": "In anticipation of Bd3: Black doesn't have many options for defending the f-pawn, but if he can open a line for his dark-squared Bishop, he could free e7 for his Knight.",
        "16. Bd3 cxd4": "Blasting a hole in the pawn chain. An interesting continuation (that White doesn't choose) might go 17.Bxf5 dxc3 18.bxc3 (18.Qxc3?? hangs the Bishop) Bc5.",
        "17. cxd4": "Instead, White opens the c-file against the BK and avoids isolating his e-pawn.",
        "17... Bb4+ 18. Kf2": "I'm not too sure how I feel about this move. On the one hand, White is anticipating the coming endgame by keeping his King centralized. It also is the least disruptive to White's current plans. On the other hand, it's not the endgame *yet* by any means, so Black might be able to make some tactical opportunities against the exposed, centralized King. In the game, I was expecting 18.Bd2.",
        "18... Ne7": "This heroic Knight finally leaves his home square, after being locked in by pawns all game.",
        "19. a3 Ba5": "Black is headed for b6, to line up on the WK.",
        "20. Rac1 Bb6 21. Qc4": "White defends his d-pawn and offers a trade--which Black must not take, as it would reduce quickly to a winning endgame for White. So Black's next move is forced--there's only one way to avoid the trade without giving away the LSB.",
        "21... Qd7 22. Qc3 Ng6 23. g3 Bd5": "Black threatens 24...Bxf3 25.Kxf3 Bxd4.",
        "24. Be3 f4": "?! Black sacrifices a second pawn to open roads to the WK.",
        "25. gxf4 Bxf3": "? This hangs a piece; plain and simple: the heroic Black Knight is undefended!",
        "26. Kxf3": "? Best was 26.Bxg6, where White is up a clean piece. By this time, though, time pressure is really starting to play a role.",
        "26... Qh3+": "Can this attack actually succeed? The WK is exposed, but Black has few attackers.",
        "27. Ke2": "? This is a subtle mistake, but I think 27.Kf2 was actually much safer, even though the followup for Black (...Nh4) looks a bit dangerous. The text, though, lets Black wage a more powerful attack than it appears at first.",
        "27... Qg2+": "Of course. White's response is equally obvious, but what follows is more dangerous than it appears. Of course White can't move his King out of the way, as that loses a Rook and pawn for free (28.Ke1 Qxh1+ etc).",
        "28. Bf2": "Now the Knight can join the attack: what looks like Black simply winning back a pawn turns out to be much more...",
        "28... Nxf4+": "0-1. Here White resigned, which is surprising at first glance and truly may be a bit premature, but a winning combination does exist if Black can find it. White has four possible moves--but it turns out that none of them help. If 29.Kd2, Black gains the Bishop with 29...Qxf2+. Any move to the back rank (Kd1 or Ke1) drops the Rh1; again with check. So what's wrong with Ke3? I've added a possible continuation for fun. Many thanks for an exciting game, barner11!",
        "29. Ke3 Rxe5+": "! Once again taking advantage of the pin on the d-pawn. Additionally, this move *looks* like it sacrifices the valiant Knight, but in reality the noble steed is as safe as can be: 30.Kxf4?? Qg5+ 31.Kf3 Rf8+ 32.Bf5 Rfxf5#. So retreat is the only option.",
        "30. Kd2 Qxf2+": "Now Black is a clear Knight to the good, and still has the initiative and a strong attack...",
        "31. Kd1": "The only real option.",
        "31... Re3": "I'll end the line here, with the move I was thinking I would play. Black is a Knight ahead and he'll soon win more material (e.g. 32.Bf5+ Kd8 33.Qd2 Qf3+ 34.Kc2 Re2; all other lines work out about the same). Thanks for reading! If you see a way out for White that I've missed after 28...Nxf4+, do let me know!"
    },
    "url": "https://gameknot.com/annotation.pl/blitz-comeback?gm=48736",
    "gameName": "Blitz: Comeback",
    "players": "barner11  vs. bwaa ",
    "opening": "Latvian (C40), Fraser defence"
}