{
    "moves": {
        "1. e4 e5 2. Nf3 d6 3. d4": "White is looking for an early exchange.",
        "3... exd4 4. Nxd4 Be7 5. Nc3 Nf6 6. Bd3 O-O 7. O-O c5": "Develop a pawn and chase the knight away.",
        "8. Nde2 Be6 9. b3 a6 10. Bb2 Nc6 11. f4": "White's latest moves show an intent to take control over as much of the board as possible early in the game.",
        "11... b5 12. Ng3 Nb4 13. Be2 Nc6 14. f5 Bc8 15. Nd5": "This move frees up the bishop on b2 and makes a double attack on the f6 knight.",
        "15... Nxd5": "If the knight is doomed, it will go down fighting.",
        "16. exd5 Ne5": "Move knight to block white's bishop on the main diagonal.",
        "17. c4": "White advances a pawn to disrupt my queenside pawn structure.",
        "17... b4": "Instead of exchanging, I just push past the pawn to maintain the pawn line.",
        "18. Bh5 Bf6 19. Qd2 Bg5": "Move bishop out to threaten the queen.",
        "20. Qe2 Re8": "Move rook to where I can make a discovered attack on the queen by moving the knight.",
        "21. Ne4": "That move removes the option for a discovered rook attack on the queen and also threatens the bishop.",
        "21... Bf6 22. Rae1 Bd7 23. Qc2": "The pawn on d6 was unprotected for a move, but apparently white didn't see it. Or had other plans.",
        "23... Qb8 24. g4 a5 25. g5 Bd8 26. f6 g6 27. Bd1 Bf5 28. Qg2 Bc7 29. Rxf5": "Exchange rook for bishop? It does disrupt the king's defense, and allows white to pick off the f6 pawn.",
        "29... gxf5 30. Ng3 Nd3": "Knight jumps to an unprotected square behind enemy lines and forking rook and bishop.",
        "31. Rxe8+ Qxe8": "The rook exchange was white's best response to the knight fork. The rook would have been lost anyway, so it might as well take out an enemy rook with it.",
        "32. Bf3 Qe1+": "Now the queen comes behind enemy lines.",
        "33. Nf1": "This is white's best move. If white blocked with the queen (Qf1), then after a queen exchange the bishop on b2 would have been left unprotected.",
        "33... Nxb2 34. Qxb2 Qh4": "The intent here is to take out the g5 pawn with either queen or rook.",
        "35. Qg2 Kh8": "Move king aside to allow rook to align itself with white's queen and king.",
        "36. Qg3": "White prefers a queen exchange instead. The exchange would leave white's pawn on g5 unprotected, but would also allow white to pick off my pawns on f5 and f7 with the bishop or knight.",
        "36... Qd4+": "So I decided against the queen exchange.",
        "37. Kg2": "With white's king on g2, I could push the pawn on a5 to open up the a column and bring my rook behind enemy lines as well. However, that would take a couple of moves to play out and it would give white tempo. As long as I have tempo, I might as well use it.",
        "37... Qb2+ 38. Qf2 Qe5 39. Ng3 Rg8": "At last I can move the rook into place!",
        "40. h4 h6 41. Bh5": "White wants to take out the pawn on f7, and prevent the rook from checking the white king.",
        "41... hxg5": "But before white takes out f7, I want to disrupt the white's kingside pawn defense.",
        "42. Bxf7 Rf8": "Now the rook can threaten the bishop and the pawn on f6.",
        "43. Bg6 Rxf6": "Rook takes out pawn and threatens bishop.",
        "44. Bxf5": "Bishop moves to where two of its own can protect it ...",
        "44... gxh4": "So I threaten one of the bishop's protectors. If white moves the knight, the rook can take the bishop. White who is already down 3 points opts to resign instead."
    },
    "url": "https://gameknot.com/annotation.pl/blitz-game?gm=39954",
    "gameName": "Blitz Game",
    "players": "zargi (1744) vs. rich_sposato (1587)",
    "opening": "Philidor (C41), exchange variation"
}