{
    "moves": {
        "1. e4": "Joe starts off with his usual opening.",
        "1... Nc6": "This is a common move and could transpose into the Spanish Opening were it to go like 2.Bb5 Nf6 (for example) 3.Nc3.  But, Joe has other ideas.",
        "2. Qh5": "Which is why he brings it out before developing his pieces.  With that being said, Dwayn's next move doesn't surprise me as he is trying to punish Joe for bringing the Q out early.  But, white has no problems with that as the plan is to sac the Q for P.",
        "2... Nf6 3. Qxf7+": "As now, Dwayne's weakest pawn is removed from the chess board.  Despite starting off with a big advantage, he must be careful.  A mistake, can and does with a lot all of their advantage.  And, even with extra time, after sacking a Q for pawn like, the opponents often let their guard down and lose quickly.",
        "3... Kxf7 4. d3": "As now, Joe has a nice pawn chain and is opening up a line for his Bc1 which can be very dangerous.",
        "4... e5": "Thinking that his K is ok, Dwayne opens up a line for his Bf8.",
        "5. c3": "I think that Joe's idea is to exchange the d pawns.  He also might be trying to increase his handicap with Dwayne, seeing that the K is left in a vulnerable position.  That's why I would've played 4...Ke8, as black.",
        "5... d5": "But, Dwayne wants to exchange the pawn to prevent Joe from further advancing his e pawn.",
        "6. Nd2": "And, by doing this, Joe adds an attacker, in this variation.  As it is guarding the e4 square.  Of course, that does not stop Dwayne from exchanging.",
        "6... dxe4 7. dxe4 b6": "In my opinion, this is inaccurate.  There was a line that was already open for Dwayne's Bc8, so why fianchetto.  In addition, the K is still in a bad position which, as he notes, that's what will, ultimately, cost black the game.",
        "8. Ngf3": "As now, Joe continues with his development.",
        "8... Bb7": "While Dwayne develops his LSB.  But, it's too little, too late.  It would've been better to do this since it was open on the other side.  For example, he could've played something like 8...Be6.  But, at this point, he really had to worry about is K.  And, Dwayne's only chance to stay in the game was 8...Ke8 where it is not as exposed.  By playing this, black is now busted starting with white's next move.  Since the exposure will be too much for black.",
        "9. Bc4+ Kg6 10. Nh4+ Kh5 11. h3": "Given that Joe exposed the K worse, he is opening up a column for his R.  But, the real reason behind this move is that this will help white to deliver a checkmate that is alluming, as we'll see towards the end of this game.",
        "11... Nxe4": "As Joe gave up this pawn for what's coming.  It's true that black is now the equivalent to a Q up without anything in return.  But, Joe will soon have a checkmate.",
        "12. Nxe4 Qxh4": "Thus, the reason behind the sac is that Joe now has a forced mate in 4, as is shown here.",
        "13. Bf7+ g6 14. g4+ Qxg4 15. Nf6+ Kh4 16. hxg4#": "And, this is where 11.h3! helped white to deliver the mate.  That's because Joe saw this discovered check, to which, there was no way out.  But, Dwayne's decisive mistake was leaving his K exposed.  So, it was by not playing ...Ke8 or ...Kg8.  I think that ...Ke8 would've been better, as that's where the K started.  And, despite black's weakest pawn being removed from the board, he could've still connected the Rook and King.  Of course, it would take longer then castling, but it is still possible to do so, as I have.  And, then, he would be just fine.  By leaving his K open, however, it was over, at once.  With that being said, Joe stressed something important.  And, what he said is the moral of the story.  In it he said, \"See where my opponents K ends up?Never allow yourself to do this.Don't try to play fun games with me.It won't work.It won't be \"me\"committing suicide with my Q sac,it will be you!Again,I am bent on serious destruction of your game and as serious as breathing air to live.Do not think for a picosecond that I am joking or not trying to play serious just because I sac my Q or other pieces!That is to help you out to survive with my handicap Q move!I am being merciful to you!Take advantage of that!Don't like it?Then leave the game on move #3 and never look back,don't continue to play!Playing dumb on purpose with no real plan of trying to win in a serious fashion like this guy with his K shuttling will only make me throw you in that lava pit faster!And then it will be \"me\"looking down on your skeleton as i'm drinking that cool martini and smiling at you!Don't allow that to happen...kill me!I want you too!Then that will make me proud of you!\" \n"
    },
    "url": "https://gameknot.com/annotation.pl/blitz-q-sac?gm=63136",
    "gameName": "Blitz Q Sac",
    "players": "deeper_insight (2300+) vs. 8pawns (1433)",
    "opening": "KP (B00), Nimzovich defence"
}