{
    "moves": {
        "1. d4": "This is my first annotation. I chose this game because I was losing at some point but I didn't give up and in the end I managed to make my opponent resign. Victory is sweeter when you work hard for it and the opponent has a higher rating :)",
        "1... d5 2. c4 c6": "The Slav Defense.",
        "3. Nc3 Nf6 4. Nf3 dxc4": "Slav Accepted. I take an undefended pawn, but in fact I don't have great hopes of holding on to mine on c4.",
        "5. Ne5": "White should have played 5. a4 first (the Alapin Variation) in order to prevent me from defending the c4 pawn with b5.",
        "5... b5": "I am able to protect my extra pawn, after all, but the c6 pawn supporting the other two is only defended by my undeveloped knight. I would like to get rid of the white knight on e5.",
        "6. e3": "What I see is that wkhlt is increasing pressure on my c4 pawn. What I fail to see is that he also opens the way for his queen.",
        "6... Nd5": "I wouldn't mind a knight exchange. Also, I can move f6 to threaten his other knight.",
        "7. Qf3": "His queen threatens a mate at f7 and would also have c3 in her range, if it weren't for my knight.",
        "7... f6": "What I had been planning to do. It prevents the mate but gets me into more trouble.",
        "8. Qh5+ g6": "Forced.",
        "9. Nxg6": "I could have perhaps avoided losing the rook with Rg8, but in blitz chess I had less time to think than I have now, writing these comments. I was desperate to avoid a discovered check, so I chose to take his knight.",
        "9... hxg6 10. Qxh8 Bf5": "One more mistake on my part. Thinking I'm placing the bishop on a good square and defending my g6 pawn, I give him the opportunity to fork my bishop and knight.",
        "11. e4 Nxc3 12. exf5 Ne4": "After all, I only lost a pawn because of the careless bishop move. But as a consequence he almost got his promoted!",
        "13. Bh6": "He's putting pressure on my already shattered kingside.",
        "13... Qa5+": "Counter-attack! After gambiting his c pawn, exchanging his knight on c3 and attacking with his queen and dark-squared bishop, his king is rather unprotected. I'm also making room for castling queenside.",
        "14. Ke2 Nd7": "I protect my bishop and prepare to castle.",
        "15. Bxf8": "His dark-squared bishop was the only thing preventing my queen from going to d2. He chooses to exchange it though, probably hoping to promote his pawn.",
        "15... Nxf8 16. fxg6 Qd2+": "And here she goes! Pushing wkhlt's king into the murky waters in the middle of the board.",
        "17. Kf3 Ng5+ 18. Kg4 Qxd4+ 19. f4 O-O-O": "I won a pawn in the process, but now I cannot check any more. I hurry to move my king to safety.",
        "20. g7 Nfe6": "I threaten check with Qxf4 and hope that I'll be able to somehow go on checking him, even after he promotes his pawn. Taking a second look at it now, I'm wondering what I could have possibly done after 21. g8=Q Qxf4+ 22. Kh5, except taking his second queen with my rook...",
        "21. g3": "He decides to try and prevent me from checking, even though that means losing the possibility to promote.",
        "21... Nxg7": "I'll rather sacrifice my knight than my rook...",
        "22. Qxg7 Qe4": "My queen is multitasking again: protecting the e7 pawn and threatening both a check on f3 and the rook on h1. His f4 pawn is still pinned and cannot therefore take my knight. However, my overall situation is far from pleasant...",
        "23. Bh3": "Would Rg1 have been better?",
        "23... Nxh3 24. Kxh3 Qe6+": "I go on checking and hope the situation will somehow fix itself.",
        "25. Qg4": "He wants to force a queen exchange. With a rook up, victory will be easy...",
        "25... Rh8+": "But he forgot to take this into account! This check forces the white king to g2 and the queen will be left up for grabs! Such a reversal of fortunes is too much for my opponent and he instantly resigns. As for myself, this unexpected victory fills me with joy and I proceed to annotate the game."
    },
    "url": "https://gameknot.com/annotation.pl/blitz-chess-comeback?gm=42720",
    "gameName": "Blitz Chess comeback",
    "players": "wkhlt (1742) vs. dumiac (1589)",
    "opening": "QGD Slav defence, Alekhine variation (D10)"
}