{
    "moves": {
        "1. e4 c5 2. Nc3": " Sicilian defence, closed variant, instead of the more common Nf3.",
        "2... a6": "A delay in development that is not required so early in the game. Nc6 is the regular line. From now on, we both move fast, but not according to the known (to me) lines. It will be a good and sad example on \"how not to take advantage of a delayed development.",
        "3. d3": "Trying to follow the classic lines. But maybe, after 2...a6, this is also very slow and a stronger continuation, like Nf3 and then d4, is required. No a good tactician, so I cannot assure what it is the best here.",
        "3... e6": "Aiming for a breakthrough on d5.",
        "4. g3": " If the diagonal opens, The Bishop on g2 can be a very strong piece here.",
        "4... Nc6 5. Bg2 Be7 6. f4": "Another break in the theory. Considering the slow development, I thought a pawn push might be useful, before moving Nf3.",
        "6... d6 7. Nf3 Nf6 8. O-O Qc7": "Instead of castling, which is interesting. Black has still the possibility to do the long or the short castling, leaving white to decide to either attack on King's or Queen's flank. I was not sure what to do here, so I opted for a, I think, slow move, but safe.",
        "9. Kh1": "I've had problems in the past with the a7-diagonal, so I thought it wouldn't hurt much here. But, as I said, I felt it is slow, and also allows black for a nice attack on my castling if pawn on h file advances fast enough.",
        "9... Bd7": " Now clearly black seems to go for the long castling, which I think it is a wise decision, considering how weak is not the white defence on the White King.",
        "10. a3": "Preparing to advance on that flank, but without a clear plan, which, as it will turn out, not a good idea.",
        "10... O-O-O 11. Rb1 h6": "Pawn race.",
        "12. b4 cxb4 13. axb4 b5": "Now the advance is blocked, but leaves a6 weak. How to exploit it before black advance on g and h become dangerous? Also notice that after (and I saw it starting from the next move) 13...Nxb4, 14.Rxb4, Qxc3, black is one pawn up. It may be risky though, but is something to consider.",
        "14. d4": "Yep, it was now when I saw the threat on c3, not before this move.",
        "14... d5": "Putting pressure on b4 and also opening the center.",
        "15. e5 Nh7": "Now this may not be the best place for the Knight. It will remain there for most (all?) of the game.",
        "16. Qd3": "Eventually protecting Nc3, but also leaving the b4 undefended (and no, I did not see it either, although after 16. Na2, white position doesn't look good at all)",
        "16... Nxb4 17. Rxb4": "Trying to find something amidst chaos. Hope there is compensation for this, and considering it is a blitz game, it is worth trying.",
        "17... Bxb4 18. Na2 Ba5": "Maybe Be7 is stronger, controlling both sides of the board",
        "19. Ba3": "Now WB is more active, but also allows 19...Qc4 forcing the exchange, which is not good for white. Had been black moved his DSB to e7, white could have advanced with Nd7, preventing Qc4, so maybe Ba5 is not bad at all.",
        "19... Bb6": "Now this seems to be mistake to me. Qc4 and things get simpler and easier.",
        "20. Nd2 Kb7": "Maybe trying to open the 8th rank for the rook to help in the defence.",
        "21. Bd6 Qc8 22. Nb4 f6": "Black trying to counterattack, which is an interesting idea, on the f file. Taking on f6 is not an option for white, since it activates BN after Nxf6.",
        "23. Ra1": "More pressure, but couldn't find the way to breakthrough.",
        "23... a5 24. Na2": "WN seem to be more restricted as time passes, while black seem to be fairly protected.",
        "24... Bc6": "In case of 25...fxe5, dxe5, black opens that diagonal and clears the field off smoke.",
        "25. Nc3 Qd7": "Defending b4. Black rooks should be moved to a or c (and maybe also to the f one after opening there) ranks and make them do their job",
        "26. Nb3": "Attacking but to no avail. Either Ra8 or the one played not he game saves any trouble created.",
        "26... a4 27. Nc1 Nf8": "Blocking the connected rooks and offering not much of action. But also removes the threat on a7, allowing the rook on h8 to maybe support an advance on g rank.",
        "28. Bf1": "Gaining a pawn, but I was not considering it seriously, since the queen exchange made me feel like holding the weak side of the board.",
        "28... fxe5 29. fxe5": "Opening the f rank at last. Now black has to relocate the Knight on f8, which make the previous move a wasted one. But there is an alternative black is going to try.",
        "29... Qf7 30. Nxa4": "With the idea that after 30...bxa4, 31.Qa6 ++. I had to spend a lot of time considering the effects of Ra8. Thank god, Nf8 is blocking the connection between rooks. But white has also to keep an eye on f1, since black is threatening a mate there if the WQ moves away from the defence.",
        "30... Qf2": "Now this I did not expect. It seems risky. Rxd6 was an interesting alternative.",
        "31. Nb3": "Ensuring a knight will be placed at c5 and also defending d4 and f1 with the rook.",
        "31... g5": "Black will have to move slow here. Maybe h5 was stronger, but the idea of g5 is to activate the rook on the 7th rank.",
        "32. Nac5+ Kc8 33. Na5": "I wasn't sure how good was this, since I was happy with my position so far and I didn't want to trade my N on c5, but I had to do something active and this seems to be good enough. Threatens the BB on c6 and if retired to e8, Nab7 looks great.",
        "33... Bxa5 34. Rxa5": "Removing the rook from the defence on f1 I felt, but it is ok, it threats Ra6 (which I did not see clearly during the game, so it is not that ok then)",
        "34... Rh7": "Not preventing the aforementioned 35.Ra6 with 35...Bb7 because 36.Qxb5 wins the day (and agin I did not see it)",
        "35. Ra1": "So I moved to a safer place.And I thought about doing next Qa3.",
        "35... Rf7": "I thought black was trying something like Qf3+ and exchange on the next move, but I was wrong. ",
        "36. Bh3": "With the idea to both attack on e6 (which I had seen before, but Qf7 prevented anything there, and now the rook blocks that defending point) and also threats to trap the Queen on the F rank if allowed, with Rf1",
        "36... Rf3": "But I had not seen this. And when I was almost ready to retreat to d1, I found...",
        "37. Qxb5": "A bright sacrifice that wins the game, threatening to take on c6 and also...",
        "37... Bxb5 38. Ra8#": "Checkmate. It was a fun game with, again, plenty of mistakes from both sides, but very entertaining."
    },
    "url": "https://gameknot.com/annotation.pl/blitz-with-interesting-ending?gm=61758",
    "gameName": "blitz with interesting ending",
    "players": "Kenderfender (1886) vs.  (1200)",
    "opening": "Sicilian (B23), closed"
}