{
    "moves": {
        "1. Nf3 Nf6 2. d4 d5 3. Bf4 Bf5 4. c3 c6": "Definitely am not copying him on purpose as black, these are just the moves I naturally play.",
        "5. Qb3 Qd7": "? b6 would have been a better choice because of what follows",
        "6. Ne5 Qc8 7. Nd2 Nbd7 8. e4": "White opens up the center to harness his lead in development but will it prove worthwhile especially since it appears to make him lose a pawn?",
        "8... Nxe5 9. dxe5 Nxe4 10. Nxe4 Bxe4 11. f3 Bg6": "I am up a pawn, but at what cost? My bishops are not well placed at all. g6 is now unavailable for Bg7. Even though white does not have any clear attacks yet, he is positionally superior. Time will tell if the pawn was worth it. ",
        "12. c4 e6": "I like this move as it solidifies black's position.",
        "13. Be2 Bc5": "Castling? I don't think so. ",
        "14. Rc1": "There are two pawns between c1 and c8, how strong could this potential pin turn out? Even though my position is looking somewhat safe, I only have potential weaknesses and no pressure points against white except preventing him from castling.",
        "14... b6": "This loses a pawn.",
        "15. cxd5 exd5 16. Qa4 O-O 17. b4 b5": "? this gives white more initiative. ",
        "18. Bxb5": "! aggressive! I like it! My queenside is starting to feel the fire and I may lose all the queenside pawns! ",
        "18... Bf2+": "Maye I blew things out of proportion at this time but often in blitz matches you must do crazy things to keep your opponent off balance as he has little time to regain his composure.",
        "19. Kxf2 Qf5 20. Bxc6 Rac8 21. Bd7": "Ouch. Good move. I should have seen that.",
        "21... Qxf4 22. Rxc8": "If I recall correctly I was thinking on my opponent's time at this point as my own clock was low. Right now I have very little going for me! I am down an entire rook (as well as a pawn) with a non active bishop. I only have a stab at his king with my queen. Maybe it will pay off",
        "22... Qd4+ 23. Kg3 Qxe5+ 24. Kg4": "He goes for the win. I can draw if he stays on the 1 and 2nd rank.",
        "24... h5+ 25. Kh3 Bf5+": "The only way to continue the attack. At this point I am fighting for a draw and white is fighting for a win since he is up. ",
        "26. Kh4 Qf4+ 27. g4": "Forced.",
        "27... g5+": "The only way to stay in the game. I have to keep checking him or quickly lose.",
        "28. Kxh5 Bg6+ 29. Kh6 Qf6": "At last, a non-check move for white. 30. ... Qh8+ 31. Kxg5 and I lose. ",
        "30. Rc6": "Looking for a way to ease the pressure, white goes in for a sacrifice on the next move. Interestingly enough I really don't have an immediate way to checkmate him. ",
        "30... Qxf3 31. Rxg6+": "Not forced. Kxg5 is playable after Qh3+. I like 31. h4 as it gives white a shot at checkmate.",
        "31... fxg6 32. Be6+ Kh8 33. Qd7": "Going in for the checkmate. Looks like it is time for my final assault. Final because if it fails I lose immediately. ",
        "33... Qh3+": "The only feasible move.",
        "34. Kxg6 Qd3+ 35. Bf5 Rg8+": "! I can cause problems now thanks to my rook! Keep in mind we were in time trouble at this point and so this was quite a saving move.",
        "36. Kf6 Qd4+ 37. Ke6 Qb6+ 38. Qd6": "38. Ke7 and Kf7 fail to 38. ... Rg7+. 38. Kd5 ends with 38. ... Rd8. 38. Ke5 seems to be white's only real option. It is not surprising that neither of us saw this though. 20 second increments may seem like a lot but when you are in a pressured game the time disappears quickly.",
        "38... Re8+ 39. Kxd5 Rd8 40. Qxd8+ Qxd8+": "White is still up a pawn but positionally he is dead meat.",
        "41. Ke4": "?? This only speeds up the process",
        "41... Qa8+": "0-1"
    },
    "url": "https://gameknot.com/annotation.pl/blitz-match?gm=30692",
    "gameName": "Blitz match",
    "players": "barbarianzeus (1710) vs. coolistdude (1704)",
    "opening": "Reti opening (A05)"
}