{
    "moves": {
        "1. d4 Nf6 2. c4 g6 3. b4": "Not a classic Indian defense. No idea why I did it, but thought it was going to be fun, and that´s why we are here, aren´t we!?",
        "3... a5": "And the fun commences!",
        "4. Bb2": "This was the idea, after all. No need for that pawn when you can load your bishop against K castling (future)",
        "4... axb4 5. Nf3 d6 6. Nbd2": "With the idea to support e4 and also bringing it closer to the King´s side.",
        "6... Bg7 7. e4 O-O": "All most logical, now the idea for black would be to attack on his queen´s (obviously, with that extra pawn and the whole column open) while wrestling on his king´s",
        "8. Bd3": "White´s, on the other side is basically betting on attacking on the castling and holding both his left wing and the center (considering even maintaining the king there)",
        "8... c5": "Consolidates the superiority on the queen´s side but also fixes somehow the center and opens the a1-h8 highway for white to attack.",
        "9. d5 Bg4 10. h3": "Maybe uneeded, considering  next move, but I thought I was gaining one time (which in the end was not that useful at all). Maybe Qc2 woould have yielded better results.",
        "10... Bd7 11. h4": "As I said, it seems for white to have gained one time, but now B can return to his post and defend, along with Nf6 the h5 spot. Didn´t like what I had, I was stalling somehow.",
        "11... Bg4": "As I said. Now black has most of his castling holding together and should start focusing on developing his queen´s side.",
        "12. Qc2": "With the idea to remove B in g4 using Nh2 and advancing pawns on that side.",
        "12... Bh6": "As mentioned before, I thought black would be developing his pieces and attacking on my queen´s side, but instead it came out with an interesting counterattack I did not predict at all. And in a blitz game that might be half a game won.",
        "13. Nh2": "Sticking to my plan.",
        "13... Qa5": "Now the queen comes to the first line. Didn´t see (or at least the whole chain of movements) the next 14...b3, and as I liked my N in d3, I did not consider to defend with Nb3. I think I was wrong.",
        "14. f3": "I continued with the attack. I had confidence that after ...b3 I could recover the pawn without major loss, since B in g4 is now threatened.",
        "14... b3": "...but then I saw (or thought) that if 15.axb3, then Bxd2+ I was going to exchange my rooks for the queen (which is not that bad at all, considering I keep my Bb2 and the queen, and also the threat in g4 -which didn´t seem clear during the game-) and felt like not doing it.",
        "15. Qc3": "So I thought about defending better, which is a mistake, but a safer approach (at least at that time)",
        "15... Qxc3": "Now again, since Bg5 is threatened, black cannot either gain the \"sacrificed\" pawn by bxa2.",
        "16. Bxc3 Bxd2+": "This makes things easier, since now both rooks will be connected. Now 17.Bxd2? would be a grave mistake, because of Rxa2",
        "17. Kxd2 Bd7 18. axb3": "and my pawn is back. Both BBb8 and WBh2 seem to be ill-positioned. A run for a better place will take place, but white´s rooks seem to have the upperhand on a-column, and the pair of bishops might be more efficient here if I can attack on f5.",
        "18... Rxa1": "If 18...Na6, then 19.Ra2",
        "19. Rxa1 Na6": "Closing the couln, but keeping the N diplaced from the center",
        "20. Nf1 Nh5 21. Ke3": "To cover 21...Nf4",
        "21... Ra8": "with the idea of ...Nc7, but then that knight seem to be far away from the action.",
        "22. g4 Ng7 23. Ng3": "I was thinking on weakening black´s by advancing onto f5, as I said, but first I have to hold g4, and that will require time.",
        "23... Nc7 24. g5": "Didn´t like it very much, since I lose a supporting pawn for f5, but it also prevents black´s ...f5",
        "24... Rxa1 25. Bxa1 Na6 26. e5": "frees space for Bd3 and also for B holding a1-h8",
        "26... Nb4": "Now we have to be careful with the potential check on c2.",
        "27. Be4": "To avoid an undesired exchange",
        "27... Nf5+ 28. Nxf5 Bxf5 29. Bxf5 gxf5": "Now here comes the most interesting thing: black´s doubled pawn in f-column would not be so weak if supported by d6 and the danger in c2 persists, which may look like a gained time for black.",
        "30. exd6": "But no, since that pawn can reach  d8 without being stopped in case of Nc2+. Therefore, the weakened black pawns will now have to face white´s king and WB seems to be stronger than BN.",
        "30... exd6 31. Bf6": "Now the threat is Be7. Kf8 seems to be a must here.",
        "31... Nc2+ 32. Kd2": "Giving time for white to attack on d6",
        "32... Nb4 33. Be7 f6": "Interesting sacrifice! Activates BK. In case now of 34.gxf6, white weakens his chain of pawns. I rather keep on  attacking d6, which will make Wd5 a strong pawn (and also we have to consider that d8 is a black square and can therefore be dominated by WB)",
        "34. Bxd6 Na6 35. gxf6": "Yes,  maybe I should have advanced the king, but this seemd to be ok as well. The rest of the game is just about playing with the extra times white has because of his gained pawns, even when I did not played well there, moving the bishop instead of bringing the king forward.",
        "35... Kf7 36. Be7 b6 37. Ke3 Nb8 38. Kf4": "f5 cannot be defended, since 38...Ng6 follows 39.h5+ and then pawn in f6 will crown.",
        "38... Nd7 39. Kxf5 h6 40. h5": "blocking g6 for black. Now WK has to move either to e5 or e6 to support his pawns or finish black´s on c and b",
        "40... Nb8 41. Bd8": "...and God knows why I did not move the king. Wasted time.",
        "41... Nd7 42. d6": "blocking my plan B. another wasted time. f4 would have been easier.",
        "42... Ke8 43. Be7 Kf7 44. f4": "But eventually, material superiority has this advantages and my previous mistake can be amended.",
        "44... Nb8 45. Ke5 Nd7+ 46. Kd5 Nb8 47. f5 Ke8 48. Ke6": "End of story. I was fun, and again, considering it was a blitz game, it was not that bad at all!"
    },
    "url": "https://gameknot.com/annotation.pl/blitz5m-fun?gm=58865",
    "gameName": "blitz5m fun",
    "players": "kenderfender (1853) vs. thegreek1 (1966)",
    "opening": "King's Indian defence (E60)"
}