{
    "moves": {
        "1. e4 d5 2. e5": "I always move to e5 by force.",
        "2... e6": "e6 blocks the c8 bishop moving on to the diagonal. ",
        "3. Nc3 Nd7": "Normal structure but the knight blocks the black bishop even more",
        "4. d4": "I can make that, can't I?",
        "4... Ne7": "?? It reamins leaving the king, queen and the other two bishops stuck. One check could easily do it. Bb4 would have been a whole lot better",
        "5. Nf3": "Developing",
        "5... h5": "Hmmm...",
        "6. Bd3": "Preparing to castle",
        "6... g5": "??",
        "7. Bxg5": "Bxg5 also pins the knight on e7.",
        "7... Rh7": "Oops, you've made a terrible mistake!! A very easy-looking blunder...",
        "8. Bxh7": "A tool for not looking properly",
        "8... f5": "Not too good looking!",
        "9. exf6 e.p.": "Takes en passant! I could be wealthy now!!",
        "9... Nf5": "Black has made a serious mistake which involves losing his queen. ",
        "10. f7+": "See what I mean?",
        "10... Kxf7 11. Bxd8": "And white remains a queen and rook ahead, and including pawns, 15 points ahed. White will easily win after that pawn sacrifice.",
        "11... Bb4": "But now the bishop pins my knight. I don't want to end up with a doubled pawn....",
        "12. Qd2": "....so I move Qd2",
        "12... b6 13. a3": "Aha, to chase the bishop away.",
        "13... Ba6": "Oh.",
        "14. Bxc7": "Mmmf. The bishop on b4 is under attack.",
        "14... Be7": "And the bishop returns.",
        "15. Ne5+": "Good.",
        "15... Nxe5 16. dxe5": "Just as I expected.",
        "16... b5": "Now my bishop can move! So Rc8 will be no help at all for Black!",
        "17. Qd3": "Chasing the knight away.",
        "17... b4": "So..?",
        "18. Nb5": "Lookin' good.",
        "18... Rg8": "I don't think a rook for a bishop in this situation might be a very good idea.",
        "19. a4 Ng7": "Good thing the knight's popped away and even better, he's blocked the rook, so at least I can do waht I planned.",
        "20. Qg6+": "Qg6+",
        "20... Kf8 21. Nxa7": "Knight's on the rim are dim, but I just wanted to resit trying. Anyway, I'm 17 points up.",
        "21... Rh8": "And the knight couldn't move because Qxg8 was checkmate, so much better from now on",
        "22. Nc6": "Attacking the bishop.",
        "22... Bh4": "So he moves, but not to a very good square though",
        "23. Bd6+": "Here's what I mean.",
        "23... Be7 24. Bxe7#": "Easy as a pie and the game is won, with me being 20 points up."
    },
    "url": "https://gameknot.com/annotation.pl/blocking-the-king?gm=43226",
    "gameName": "Blocking the king",
    "players": "Oodle  vs. Clafont666 ",
    "opening": "Scandinavian (centre counter) defence (B01)"
}