{
    "moves": {
        "1. e4": "It's a real pleasure when in blitz you come to face a rated opponent! He was about 2000, a honour to face him! The game went more interesting than usual. ",
        "1... d5": "How I dare? :-)",
        "2. exd5 Nf6 3. Nf3 e6": "How I dare? True is that this is my \"to-be-explored\" line. ",
        "4. dxe6 Bxe6 5. Be2": "Black has a tempo to develop. A little edge, provided he can control white's center. For this, black has o-o-o... Now, the \"strong\" line is Qe7 (self blocking the dsb, to be freed later), but with the B already on e2, this is no good for black. So I went for another line: ",
        "5... Bc5": "This may seem bad, but black develops his dsb and, with proper care, he will find a good square in c7. White can do d4, of course, and I will go b6. I can't prevent white to play d4, so I will accept it. ",
        "6. O-O c6": "Now you say: \"why not Nc6?\" I answer: White has a ready-made attack after it, with 7. Bb5, Ne5, Re1... I will get myself defending. This move controls it all, even after Nc3. ",
        "7. d4 Bb6": "As foreseen. White can harass my B with c4-c5, but I would have Bc7 as desired. BUT this move leaves white the chanche to occupy f4 with his DSB, and this is to be avoided by Black, if possible. ",
        "8. c3": "Passive! A passive move \"must\" be \"refuted\": that means: I have to use the tempo to attack, an attack that won't be possible after the \"active\" white move he didn't play. And I felt that this was...",
        "8... Qd6": "This weird move aims to create a battery after Bc7. I will have to get in Bg4 in order to exchange the N to make it a real threat, and white still has c4.c5 to disrupt it. But my Q will land on d7, with nice ideas of a sac on the white castled king. By provoking c4-c5, black obtains a secure dominion of d5, and this is not all that bad. c4-Bc7-c5-Qd7 would be the sequence. The important thing is with this move I prevent Bc4, while with the alternative option (o-o, Nd7), I allow it. ",
        "9. Bg5": "White went for another idea: to shield the battery with the B in g3. Very clever?",
        "9... Nbd7": "Passive! But white's B comes first to g3. I develop, preparing QScastling. ",
        "10. Nbd2": "This N can jump to c4, causing the loss of my B pair. ",
        "10... Bc7": "Too many threats. I set my battery, blocking Nf3. But I was expecting c4, forcing me to go Qe7 or to adventure me in the sand of Qb4!?, with great danger of being trapped. ",
        "11. Bh4": "White goes on with his plan. I can castle QS and accept Bg3 and the subsequent exchange, or I can be more aggressive. ",
        "11... Nh5": "This N will take the B if Bg3, leading at least to a B pair for me (the opened f column is a worry, though). Otherwise, this N will go to f4, ready to take the lsb. No matter the discovered threat he has, since Nf3 can only go to e5, but in that case I'm not forced to play NxN, and I can spend the tempo for Nf4. Of course, leaving f6 has a counterside...",
        "12. Ne4 Qf4": "I was shaking: Q trapped Q with a rated player is ashaming! Was it? The critical line is 13. g3, QxNe4, 14. Bd3, Qd5, (Qg4 leads to 15. h3!, Qxh3, 16. Ng5,\n\n (Diagram 1) \n\nwhere black loses the Q (Qg4, 17. c3, and the Q is trapped. Similar if Bg4, 17. c3).). Retaking after 14. Bd3, Qd5, 15. c4, Qa5 (only move), \n\n (Diagram 2) \n\ntaking advantage of the discovered attack on the Nh5, where NxBe6 will be deadly for black. ----- The quick way to use the g5 square for white was at the beginning of this line, directly 13. Ne4-g5, \n\nwhere black will have to play someting as weird as Bg4, with a very intrincate position...\n\n (Diagram 3) \n\n in which white can't play 14. Ne5, because of NxN, 15. dxNe5, BxBe2!, and Bh4 is hanging. White will lose a piece, even after Bg3 (NxB, hxB, BxQ, gxQ, Bc2 and black is up a b pair for a N and a pawn...",
        "13. Bg3": "White went for the non-sac way. ",
        "13... Nxg3 14. Nxg3": "The good thing is that white didn't go for the sac again, with 14. fxg3, QxN, 15. Ng5!",
        "14... O-O-O": "Time for castling opposite side! This is a freeing move for black as long as th WQ is on his home square.",
        "15. a4": "White starts an attack, but it is slow, and it will leave me some tempos to do some harm. How?",
        "15... Nc5": "Not exactly sure. Ne5 provokes the exchange line I don't want. ",
        "16. a5": "I don't have to lose any tempo if not forced to, so no a6. My lsb should go to exchange the Nf3, but at this time I can see it would be difficult to make it work (I have to use both g and h pawns to make it dangerous... too slow!)",
        "16... Bb3": "This assures me no b4 by white.",
        "17. Qd2": "Now I had all sort of moves, but I blundered! * Edit: Let's see: If I exchange Q, I will have both B and N under threat! I have to retreat the Q, but where? Qd6 allows dxN, QxQ, NxQ, RxN, with a good position for black. But Qd6, Ng5  is dangerous too. Qc6 was accurate, and if Nh5, Ne4. I can save the N by Na4, and if QxQ, BxQ and b2 is threatened. But I blundered!",
        "17... Ne4": "?? ",
        "18. Qxf4": "AAAghhh! No NxN+, so I will lose a piece for nothing! It was so easy to play QxQ! * Edit: QxQ? NxQ, and black will lose a piece too!",
        "18... Bxf4 19. Nxe4": "So here I am. I lost for a blunder after a reasonably well played opening, where I got the initiative for a pawn, but now... resign? Never resign! ",
        "19... f6": "First thing: control the N jumps. An inmediate Re8 just leads to Bd3, and nothing happens. ",
        "20. a6": "Ah, the pawn. Ok. ",
        "20... b6": "This can be dangerous, but white has to penetrate first with his R, and this seems very far away. ",
        "21. Ra3 Bc2": "Now that f7 is not targeteable, my B is free to move around. ",
        "22. Ng3 h5": "The last straw of an attack.",
        "23. Bd1 Bg6": "Useless was Bd3, Re1, I just help him. ",
        "24. Bb3 h4": "More threatening would have been Re8 first, but Re1 and the exchange didn't seem a good option for me. ",
        "25. Ne2 Bd6": "Tempo recovered on the R. ",
        "26. Raa1 Rde8": "Now I have the WN as a shield against the exchange, and if he wants to keep it there, I will pressure him a lot. In other words: the N has no good squared to go to. ",
        "27. Bd1": "Cutting R's connection... hmmm... where can I go to?",
        "27... Bd3": "Pressuring from a safe spot, of course!",
        "28. Re1 h3": "This will cause the g pawn to move one way or another, and the other N will be harassed!",
        "29. g3 Be4": "Even more accurate was Bg6-Bh5, but I feared white could have found something in the midwhile. ",
        "30. Nc1": "? Look at this beauty: can you see why it is a fatal mistake, and white loses a clean piece here? ",
        "30... Bxf3 31. Rxe8+ Rxe8": "...and white CAN'T take BxB or Re1#! This is good for tactics...",
        "32. Nd3": "Now I'm not forced to exchange the B. I have the pair!",
        "32... Be4": "Still playing with N's uneasy position. My aim is to prevent the w pawns to move. The material is still -1 for me, so it's not any \"gimme\"!",
        "33. Nb4": "Targeting c6. After f3, I will have to exchange my lsb by force, unless I go BxN. This will leave his pawns very scrambled, but I will lose the B pair... but let's remember white has Bg4+, grabbing the dearest h3 pawn!",
        "33... f5": "I hoped to prevent it for now. ",
        "34. Bh5": "?! Well, not sure about it!",
        "34... Re7": "Better was d6, and if white doesn't go Bc7, g6. But if he does...",
        "35. Re1": "It seems that my only chanche to preserve my B is Bg2. But without R in the game, the back rank mate threat is useless. ",
        "35... Kc7": "I protect c6, waiting for him to come. What else? BxNg4 instead was accurate here, and the last chance to play it for a balanced engame. ",
        "36. f3": "I already lost the chance to play BxNb4 and scramble his pawns. After 36... BxN, 37. cxBe4, my dsb is lost! See it by yourself...",
        "36... Bd5": "The isolated pawn will be ok, I hope. ",
        "37. Rxe7+ Bxe7 38. Nxd5+ cxd5": "In the hindsight, I must have gone for BxNb4. My pawns are weaker now. ",
        "39. Bg6 f4": "Better to save it or make him doubled!",
        "40. gxf4 Bd6": "A way to c1 and the other vulnerable chain. ",
        "41. Bf5 Bxf4 42. Bxh3 Bc1 43. b3 Bb2 44. c4 Bxd4+": "Well, this may seem hopeless, but let's see how can white force my pawn out of g7. ",
        "45. Kg2 dxc4 46. bxc4 Kd6 47. Bf5 Kc5": "I can force his B to c8 to defend a6.",
        "48. Be6 Kb4 49. f4 Ka5 50. Bc8 b5": "Freeing the way for my K. ",
        "51. cxb5 Kxb5 52. f5 Bf6": "White will have to force the win. Can he?",
        "53. Kf3 Be5 54. h3 Bf6 55. Kg4 Kc5 56. h4 Kd5 57. h5 Ke5 58. Kf3 Bg5 59. Kg4 Bh6": "I think he can't! I survived, after a blunder and a heavy endgame mistake. I hope you enjoyed the midgame combination, and the heavy power of black's h pawn."
    },
    "url": "https://gameknot.com/annotation.pl/blunders-1-1-drawn?gm=59797",
    "gameName": "Blunders 1-1=drawn :-)",
    "players": "EncounterWith  vs. damalfi ",
    "opening": "Scandinavian defence (B01)"
}