{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Bb5 Nf6 4. d3 d6 5. Nc3 Bg4 6. Bg5 a6 7. Bxc6+ bxc6 8. h3 Be6 9. d4": "The opening was blitzed, and is very boring. Some perks for my side are his doubled pawn, and my center development.",
        "9... exd4 10. Nxd4 c5 11. Nxe6 fxe6 12. O-O": "So far I have been playing pretty correct moves, and my position is favorable over black's currently.",
        "12... Be7 13. Re1 e5": "His first mistake. This allows me to take control of the board after the minor exchange on f6 with the move Qd5. A very strong square for my queen, which infiltrates enemy territory.",
        "14. Bxf6 Bxf6 15. Qd5 Rb8 16. b3 Rb6": "This is a move which seems to stop Qc6+ followed by capturing a free pawn on a6. However, this move is useless due to Na4! Slightly better is Qc4 followed by putting the knight into the center on d5.",
        "17. Na4 Rb8 18. Qc6+ Qd7 19. Qxa6 O-O": "I follow through with my plan, and I snatch up the first free piece of the game. My opponent  wisely runs his king to safety.",
        "20. Rad1 Bh4 21. Re2 Qf7 22. Rf1": "I got really scared of his attack here, and so I just played it safe and moved Rf1. I knew that there had to be a better method of defense, but my psychologically I needed to play Rf1 to make myself at ease.",
        "22... Rba8 23. Qc6 Rae8": "Better here was 23...Kh8 which prevents my next move Qd5, pinning the queen to the king and happily squelching any counter play he has. Again, Qd5 is not the best move, but I needed to play it to be comfortable in my winning position.",
        "24. Qd5 Re6 25. Nc3 c6": "I get my knight closer to the battle zone, and this is where my opponents time trouble starts to show. He plays 25...c6 I have no idea what prompted this move, except that he might be trying to free up his rook and queen. This fails, because I can just return the queen to her pin duty after taking the pawn.",
        "26. Qxc6 Rg6 27. Qd5 Qxd5 28. Nxd5 Rf3 29. Ne7+": "And here we go! This is my first of two major blunders in this game. I was keeping my opponent under time pressure, and so I didn't take the time to see if this square was protected by anything. My opponent probably kept his bishop inactive for this very reason, because as soon as I had played 29.Ne7+ he blitzed Bxe7 as if he had expected it.",
        "29... Bxe7": "At this point I had a hard think. I knew my position was bad now, and I needed to make the position as complicated as possible so my opponent would not have the time to calculate. I also took stock that his rooks are well away from my passed pawn on a2, and I might be able to swing my rooks over and shove my queenside pawns up the board!",
        "30. Kh2 Rf7 31. a4 Bg5 32. Ra1 Ra7 33. c3": "Forward the pawns! I didn't like pushing the lone a-pawn up the board, so I brought him some company.",
        "33... Bd8 34. b4 Bb6": "This is a mistake, since after 35.a5, my opponent is forced to withdraw again, essentially wasting his move.",
        "35. a5 cxb4 36. cxb4": "I feel so ashamed of myself right now! At the time I thought that xb4 was a great move since I could not take on b6 due to Rxa1. But what I missed here was after 36...Rxa1 I have a7! and black has no pieces on promotion prevention! As it is, I will have an extremely hard time pushing those pawns up the board since reinforcements arrived to blockade me.",
        "36... Bd4 37. Ra3 Re6 38. b5 Re8 39. Rea2 Rea8": "I can no longer push my pawns forward. b6 results in Bxb6! and a6 results in something to the effect of Bb6, stopping all future progress of the pawns together. a6 is the best move here, but I want to give my time pressured opponent something to worry about. Right how he had under 2 minutes left on his clock, and I had over 25!",
        "40. Kg3 Rb8 41. b6 Bxb6 42. axb6 Rxa3+ 43. Rxa3 Rxb6 44. Ra7": "Now I have evened the position, and pinned his king to the back rank, unless h6 then Kh7.",
        "44... Rb4 45. f3": "Here I decided not to notate further, since I wanted to apply even more time pressure, and I was sure that I was winning even though it is really a draw still. I will do my best to recall the moves he might have played, and get to a later endgame position.",
        "45... g6 46. Kg4 Rb8 47. Kg5 Rd8 48. Kf6 Rf8+ 49. Ke6": "It was in a position roughly the same as this that my opponent flagged, but in this kind of position there can only be one outcome. White will win this, it's just a matter of time.\nSo, I got my second flag in my USCF career, and my second win in the 10th SCC Extravaganza! After these two shorter games come the longer 90 minute games with more time to think, so stay tuned for Rd. 3, and a thrilling attack on a castled king!"
    },
    "url": "https://gameknot.com/annotation.pl/blunders-and-recoveries-rd-2?gm=63797",
    "gameName": "Blunders and Recoveries Rd. 2",
    "players": "Myself (1550 USCF) vs. Opponent (1200 USCF)",
    "opening": "Ruy Lopez (C65), Berlin defence, Anderssen variation"
}