{
    "moves": {
        "1. d4": "Hi everyone!\r\n\r\nIt is my turn to make a blunder, in fact this game turns into a right comedy of errors on both sides so maybe a draw at the end was a fair result!\r\n\r\nJoanne",
        "1... d5 2. Bf4": "2. Bf4 - Trompowsky - an aggressive move in a d4 pawn opening and this has netted GM Julian Hodgson quite a few victims.",
        "2... Nf6 3. Nf3 c5 4. e3 Qb6 5. Qc1": "5. Qc1 - protects b2 pawn.",
        "5... Nc6 6. c4 e6 7. Nc3 a6": "7. ....... a6 - necessary prophylaxis here, a knight incursion on b5 with the enemy bishop controlling c7 will be very nasty.",
        "8. cxd5 exd5 9. Be2 Be7": "9. ......... Be7 - there seemed to be a chance to win a pawn on d4.  I did analyse the position and found that Glenda could get herself trapped so I decided not to risk it and continue developing.",
        "10. Qd2 cxd4 11. Nxd4 Nxd4 12. exd4 Bd7": "12. ....... Bd7 - some wood has been cleared from the board and next move both sides castle kingside.",
        "13. O-O O-O 14. a3 Bf5 15. Rfe1 Rfe8 16. Rac1 Rac8": "16. ........ Rac8 - battle for control of e file and c file.",
        "17. Bf3 Be6 18. Be5 Qd8": "18. ....... Qd8 - a sad retreat for Glenda.  In the light of what was to come maybe she would have been better on d7.",
        "19. h3 h6 20. g4": "20. g4 - pawn storm.",
        "20... Nh7 21. Nxd5 Bxd5": "21. ........ Bxd5?? - this move should have conceded 12 rating points.  I should have played Rxc1 first.  Now white initiates the exchange and emerges a pawn up.  This is the first of the comedy of errors though.",
        "22. Rxc8 Qxc8 23. Bxd5 Qd7": "23. ........ Qd7 - I am trying to compose myself after that pawn loss.  Worse I have also conceded the bishop pair and don't those white prelates look powerful.  Luckily my gut instinct says Play On, look for positives - well, I can only try.",
        "24. Bc4 Ng5": "24. ........ Ng5 - threatens h3 pawn and a knight fork on f3, white spots it though.",
        "25. Re3 Qc6": "25. Qc6 - must keep the pressure on, the threat of Nf3+ is renewed.",
        "26. Qc3 Rc8": "26. ....... Rc8 - now I cannot play Nf3+ I try and create pressure somewhere else with Rc8.  The white lsb is pinned.",
        "27. b3 Bxa3": "27. ....... Bxa3?? - this is blunder no.2!  27. ....... b5!! should have won a piece.",
        "28. d5 Qg6 29. d6": "29. d6 - I also forgot to mention earlier on that the white d pawn was passed, now it becomes a menace!",
        "29... Rd8 30. b4 Qb1+ 31. Kg2 Bxb4": "31. ..... Bxb4 - saving the bishop but look, g7 is twice attacked and only once defended.  White should have buried me with a move like Qd4, but ......",
        "32. Bd3": "32. Bd3? - not the best move.  Now I have the chance to get rid of the Wicked Witch at the cost of Glenda but this means that I remain a pawn up and Henry can breathe more easily!",
        "32... Bxc3 33. Bxb1 Bxe5 34. Rxe5 Ne6": "34. ..... Ne6 - the pawn on d6 cannot be taken because if I do then Henry will certainly be taken, by Old Matey dropping onto e8 - beware of the long range white lsb controlling h7!  This knight move prepares the possibility of the capture on d6.",
        "35. Be4 Rxd6": "35. ....... Rxd6 - I decide to remove the d pawn - I did analyse the board and thought that I could not hold onto both my queenside pawns.  As a result I offered my opponent a draw.  Ion, however thought that I could have held onto my a pawn and gradually nursed it up the board, so let's throw in a Bad Draw Offer folks!  I lost 1.9 rating points as a result of the low draw, but maybe after the way I played I was very lucky the loss wasn't 11.9!"
    },
    "url": "https://gameknot.com/annotation.pl/blunderfest-pt-4-overlooking-in-between-move?gm=22518",
    "gameName": "Blunderfest Pt. 4 - Overlooking In-Between Move",
    "players": "reeceharvey (1706) vs. jstevens1 (1777)",
    "opening": "Queen's pawn, Mason variation (D00)"
}