{
    "moves": {
        "1. d4": "So here is a game i played with a player called emaus",
        "1... Nf6 2. c3": "this was rather odd move. A bit passive IMO",
        "2... d5 3. b4": "another surprising pawn move. i was expecting something like nf3",
        "3... Bf5 4. Nf3 g6 5. Nh4": "he moved the knight twice just to harass my bishop, but it can simply drop back.",
        "5... Be6 6. g3 Bg7 7. Bg2 O-O 8. a4": "a rather fierce attack on the queen side, but i thought i could manage.",
        "8... c6 9. Bf4 Nbd7 10. a5 a6 11. O-O Bg4": "i know, a third move with the bishop, but its nicely placed pinning the pawn, but its also very provocative",
        "12. h3": "And the provocation worked",
        "12... Be6 13. Ra4": "odd move, leaves the rook awkwardly placed",
        "13... b5 14. Ra3 Nh5 15. Be3 Ndf6 16. Bg5 Qd7": "threatening bxh3",
        "17. Kh2 h6 18. Be3 Ne4 19. Nd2 Nhf6 20. f3": "f3?? Blunder! leaves the knight trappable",
        "20... Nxd2 21. Qxd2 g5": "The knight trapped and black wins material",
        "22. Kg1": "another odd move",
        "22... gxh4 23. gxh4": "here i maybe could have played bxg3, but i thought placing the knight on an active square would be better",
        "23... Nh5": "With the active square i mean the f4 square or the g3 square.",
        "24. Bf2 Qd6": "or maybe not? Well as it shows later in the game, the knight plays an important role",
        "25. e3 Kh8 26. f4": "Here he just pushes the pawns for a reason I'm unaware, while i get my attack ready and rolling",
        "26... Rfg8 27. Qd3 Nf6 28. Rc1 h5": "Here i wanted to take one more move, to get an active square for my bishop",
        "29. Kh2": "defends the h3 pawn, and preventing me from pinning the bishop",
        "29... Bh6 30. Bg3 Rg7": "preparing to double rooks. Whites position is really passive here and he seems just to be waiting for a squash",
        "31. Rf1 Rag8 32. Rf3": "defends the g bishop, but also blocks the bishop from covering the e4 square.",
        "32... Ne4": "and its made use of now",
        "33. Ra2 Nxg3": "this just wins a piece, and there was nothing he could have done",
        "34. Rd2": "another pointless move",
        "34... Ne4 35. Re2 Bf5": "not really threatening anything hug, but just a scary looking move",
        "36. Qd1": "Again my opponent blunders and leaves the e3 pawn for taking with a fork",
        "36... Nxc3 37. Qb3": "another blunder, the rook is hanging",
        "37... Nxe2 38. Rf2 Bxf4+": "Here he cant really take the knight, because it would be answered by. 39.exf4  rxg2 (which forces white to take the rook or to be mated) and after 40 rxg2 qxf4 leads to a forced mate.",
        "39. Kh1 Qg6": "adding more pressure to the bishop on g2",
        "40. Rxe2": "this just loses game for good, because black has a really nice move here.",
        "40... Qxg2+": "Qxg2! This forces white to play 41,rxg2 which would be followed by 41... rxg2 with a forced mate in one. Here my opponent resigned."
    },
    "url": "https://gameknot.com/annotation.pl/blunderful-game-with-a-queen-sac-from-black?gm=52921",
    "gameName": "Blunderful game, with a queen sac from black",
    "players": "emaus (1402) vs. vavavi (1393)",
    "opening": "Queen's pawn game (A45)"
}