{
    "moves": {
        "1. e4 e5 2. Nf3 Nf6 3. Nc3 Nc6 4. Bc4 Nxe4": "Ever since I learned of this line of the four knights, I was in enthralled by it! Knowing I can sacrifice a piece and get it back easily, along with getting a better position over white. Sounds like a win-win to me!",
        "5. Nxe4 d5 6. Bxd5 Qxd5 7. Nc3 Qa5": "Standard stuff for this opening. Already I'm feeling good about the position, since I have played this line very frequently I feel comfortable about the position. My queen is out a bit early, but it will be safe over on a5 for a while.",
        "8. d3 Bg4 9. h3 Bh5 10. g4 Bg6": "It seems to me like 10. g4 was a bit of an over extension. She is improving my bishop rather than limiting its space. Even though I lost the knight pin, I feel my bishop has found a long term home on g6.",
        "11. Bd2 Bb4 12. a3 Bxc3 13. Bxc3 Qd5 14. Qe2 O-O-O": "Castling queenside gets my king safe, activates my rook, and makes the move Rhe8 readily available.",
        "15. O-O f6 16. b4": "She starts her big push towards my king, but she didn't calculate on my retaliating in the same way. Where her attack takes a while to formulate, mine can erupt instantaneously!",
        "16... h5 17. Nh4 Bf7 18. Nf5": "Her new knight location is only slightly annoying, it does not hinder my movements hardly at all. In fact, the knight on f5 can be more easily pinned to a queen which will be forced to g4.",
        "18... hxg4 19. Qxg4 Be6 20. Qe4": "I didn't see this coming, but it makes no immediate threats, and I can snatch up that pawn on h3 like the pawn-grabby player I am!",
        "20... Rxh3 21. Ne3 Qxe4": "The computer indicates that this is a mistake, and the proper moves are Qd7 or d6. I hate moves like this because they are so passive! Can somebody please explain to me why Qd7 is better than what I have in store for her with Rdh8 threats?",
        "22. dxe4 Rdh8 23. Kg2 Rh3h2+ 24. Kf3 Nd4+": "I force the minor trade and advance my pawn! It is a forced trade since 25. Kg3 meets R8h3#. I have a system of checks worked out so as to win material once that knight on e3 is forced away by the pawn.",
        "25. Bxd4 exd4 26. Nf5 g6 27. Nxd4 Rh8h3+ 28. Ke2 Bc4+": "Now that the knight is removed, it is safe to play my fine skewer tactic.",
        "29. Kd2 Bxf1 30. Rxf1 Rxa3": "A rook for a knight up, I decide to continue with my pawn-grabby habits.",
        "31. Nb5 Ra4 32. c3 Ra2+ 33. Ke3 Rh3+ 34. f3": "You might be able to tell that I don't really know what I am doing here. I had no idea what I was supposed to be doing except waiting for a tactic to present itself or something. So I just shuffled my pieces around, hopping for a blunder.",
        "34... a6 35. Nd4 Ra3": "I figure the king can only defend one of the two back pawns at a time, and if he has to defend the c3 pawn, I may be able to run my g and f-pawns up the board.",
        "36. Kd3 g5 37. Kd2 Ra2+": "This keeps the king on the third rank where I want him, and also protects the potential important square g2.",
        "38. Ke3 g4 39. Kf4": "This is a nice blunder for me, which allows me to run my pawn up the board to the end unhindered by a king! A better move was Ne2 to bring another defender in, but this position was lost already, so making it worse is not the end of the world",
        "39... g3 40. Rg1 g2": "The end of the world was two moves later. After 40...g2 she resigned, seeing that she had to sac here remaining rook to stop the encroaching pawn. At the termination of the game I had more than double the time on my opponents clock, as is normally my custom.\n\nIf you like obscure sacrifices, and close pawn endgames, keep an eye out for my next tournament game Rd. 4!"
    },
    "url": "https://gameknot.com/annotation.pl/blunders-and-recoveries-rd-3?gm=63798",
    "gameName": "Blunders and Recoveries Rd. 3",
    "players": "Opponent (1500 USCF) vs. Myself (1550 USCF)",
    "opening": "Petrov three knights game (C42)"
}