{
    "moves": {
        "1. f3": "Hi everyone!\r\n\r\nI think this is my second worst game I have played against Master Freddy.  I played like my OTB rating here.  My OTB rating is still 1200.  If you see what happened from the middlegame onwards you will see why.  Freddy opens with the Gedault Opening, 1. f3.",
        "1... e5": "1. ...... e5 - the most common response to this pawn move.",
        "2. Nc3": "2.  Nc3 - aha, Freddy does not follow up with the Fried Fox, Pork Chop Opening, which is 2. Kf2.  This knight move of Freddy's to c3 transposes into his favourite opening which is the Dunst!",
        "2... Nf6 3. d4 exd4 4. Qxd4 Nc6": "4. ....... Nc6 - and this becomes like the Centre Game but with the e pawn on e2 and not e4.  I decide to develop a piece.  Freddy chooses to tuck his queen, that Wicked Witch of the West onto f2.  You will see why as the game develops.",
        "5. Qf2 Bb4": "5. ..... Bb4 - pins the knight on c3 and develops a piece.  I am now wondering whether the move Be7, although more passive would have been more circumspect here.  For starters it defends the knight on f6.",
        "6. Bd2 d6 7. O-O-O Qe7": "7. ........ Qe7.  I start to clear the decks so that I can choose whether to castle kingside or queenside.  I would prefer to castle queenside, same side as Freddy this time, but there is the possibility of Freddy putting a knight on d5.  Freddy prepares for it by playing e4.  This move makes Nd5 a very strong move because if there is an exchange of knights on d5, the e pawn will recapture, threaten the c6 knight and open up the possibility of a rook pin on the e column.  Henry and Glenda are really sitting ducks there!",
        "8. e4 Bxc3": "8. ........ Bxc3 - so I avoid this possibility by making a concession.  Fou Lenoir gives up his life for that knight but now Freddy's dsb goes to c3.  That dsb's control of the a1-h8 diagonal will open up the possibility of a combo against the f6 knight later on.",
        "9. Bxc3 b6": "9. ...... b6 - prepares a fianchetto of Fou Leblanc on b7.",
        "10. Bb5 Bb7 11. Ne2 O-O-O": "11. .......... 0-0-0? - I feel that I have enough breathing space to make this move.  I think in hindsight I should have prepared this by moving my rook to g8 first.",
        "12. Ng3": "12. Ng3 - I thought he was going to move his knight to f5 or h5 threatening to invade, which prompted the blunder, g6??",
        "12... g6": "12. ..... g6?? - the rot sets in as early as the 12th move.  Incredibly this is the only time such a thing has happened in my game against Freddy, me being lost in just a dozen moves!!!  Now here comes the combo.  Admittedly it takes four moves before the devastation becomes apparent, but at my level I should have seen it coming.",
        "13. Bxc6 Bxc6": "13. ........ Bxc6 - this knight trade accomplishes two things.  1.  The Witch can now come to d4.  2.  Fou Leblanc is lured onto a square where he is hanging.",
        "14. Qd4 Nd7": "14. ...... Nd7 - naturally I move my knight out of the way as Qxh8 results in the loss of 2 rooks for the Witch for me.  But Fou Leblanc is hanging and now Freddy exploits this.",
        "15. Qc4 Bb7": "15. ...... Bb7 - I now have the grim choice.  Lose Fou Leblanc or the exchange.  I choose to save Fou Leblanc.",
        "16. Bxh8 Rxh8 17. Ne2 f6": "17. ...... f6 - after the horse has bolted, the stable door shuts.",
        "18. Nc3 Ne5 19. Qd4 Qd7": "19. ....... Qd7 - In retrospect Rd8 should have been played here.  Guess I was in a state of shock over what happened a few moves back.  It is so easy to be in this state after something so awful.  When this happens it is quite possible that more mistakes can be made.  So is the case here.",
        "20. f4 c5": "20. ........ c5?? - if I had played my rook to d8 this move would have been OK, but it drops a further pawn.",
        "21. Qxd6 Qxd6 22. Rxd6 Ng4": "22.......... Ng4 - trying to make the best of a rotten job.",
        "23. h3 Nf2 24. Re1": "24. Re1 - Freddy defends his e pawn.",
        "24... Re8 25. Rxf6 Nxe4 26. Rf7": "26. Rf7 - a real bone in my throat.",
        "26... Nd6": "26. ....... Nd6 - I now decide to get my knight out of a pin but this results in a trade of my remaining rook.",
        "27. Rxe8+ Nxe8 28. g4": "28. g4 - pawn roll.",
        "28... h5": "28. ...... h5 - my h pawn is lost if he remains where he is, might as well trade it if I can.",
        "29. Re7 Nc7 30. f5 gxf5 31. gxh5": "31.  gxh5 - the trade occurs and there is a pawn race.  Freddy wins it.  He decided to underpromote to a rook and Henry met an all too familiar fate on move 35.\r\n\r\nI am determined to stay positive.  Since this debacle I have been doing some homework on Freddy in order to try to put an end to this losing run (if I finally win or draw against him then I can mentally consign these losses to a bottomless dark pit and just count the win or draw!).  I have already annotated two games of his, one already released and am about to release another - and done one of his puzzles.  I will do some more tonight, but now it is time for me to do some Saturday morning housework.\r\n\r\nEnjoy your weekend everybody!\r\n\r\nCheers and bye for now.\r\n\r\nJoanne",
        "31... f4 32. h6 f3 33. h7 f2 34. h8=R+ Ne8 35. Rhxe8#": ""
    },
    "url": "https://gameknot.com/annotation.pl/blunderfest-pt-9-a-horror-show?gm=23649",
    "gameName": "Blunderfest Pt. 9 - A horror show!",
    "players": "easy19 (2220) vs. jstevens1 (1779)",
    "opening": "Hammerschlag (Fried fox/Pork chop opening) (A00)"
}