{
    "moves": {
        "1. e4 c5 2. Ne2 d6": "I was glad, with this reply. I was slayed twice now, after 2. ... Nf6, 3. Nbc3... I still have to work on that... Could Paul Keres be wrong?",
        "3. d4": "Had I been a true hero, I would have played 3. Nbc3 Nf6 4. d4, but I was cured for a while...",
        "3... cxd4 4. Nxd4 Nf6": "So we're back at the straight Sicilian. Here comes Nimzowitsch... 4. ... g6, is still an option, here... This place, is were we learn the true ropes...",
        "5. Nc3 a6": "Overprotective, I would say...",
        "6. Bc4": "6. Be2 g6 7. 0-0 Bg7 didn't appeal to me...",
        "6... e6": "I was fearing 6. ... b5 7. Bb3 b4, so I was relieved...",
        "7. O-O": "7. a4 (against b5) Qc7...",
        "7... Be7": "Another relief. 7. ... b5 8. Bd3 e5 9. Nf3 b4 10. Ne2, loses a lot of tempo...",
        "8. Qf3": "The best, I could think of... Black has to clear up his development...",
        "8... O-O 9. Bb3 Nc6 10. Be3 Bd7 11. Rfd1": "Probably not best. I disliked 11. Rad1 Qc7 12. Rfe1 Ne5 13. Qg3... 11. Nxc6 leads to nothing...",
        "11... Ne5": "At least, 11. ... Nxd4 12. Rxd4, doesn't work for black...",
        "12. Qh3 Rc8 13. Bf4": "I decided to reject 13. a3 Rxc3! 14. bxc3 Nxe4, for obvious reasons...",
        "13... Neg4": "Now, Rxc3 is met by Qxc3...",
        "14. Be3": "14. Bc1 d5 (or Qa5) did not strike my fancy...",
        "14... Qa5": "Completing development, and threatening Rxc3... The position is dead equal... Was I proud? Yes...",
        "15. Nde2": "15. Bd2 is playing backwards, I hate that...",
        "15... Nxe3 16. Qxe3 Qe5 17. Rd4 Bc6 18. Rad1": "Prince Vlad - poses as a vampire - was not pleased, at this stage... His Unholy-Ness had reached nothing against mere me, 100 points below Him... He was urging for my blood...",
        "18... Nd7": "My best guess was 18. ... b5 19. a3 a5! 20. Nf4... 18. ... Nd7 is relentless, and best...",
        "19. f4": "Probably the last opportunity, to stir up some dust... 19. ... Qh5 seems fine for black, with a dead equal position...",
        "19... Qc5 20. Rd4d3 e5 21. g3": "Of course, all else fails...",
        "21... Rfe8 22. Kg2 Qxe3": "Who am I, to call this inaccurate? This was the least of my fears...",
        "23. Rxe3 Nf6 24. Kf3 b5": "Maybe 24. ... Kf8 25. h3 h6...",
        "25. a3 a5 26. Rd2 b4 27. axb4 axb4 28. Nd5 Bxd5 29. Bxd5 Nxd5 30. exd5 f5": "Plausible. I still think, Kf8 diminishes drawing chances for white...",
        "31. Rb3": "No fear for e4+, Kg2... 31. fxe5 Bg5! looked bad...",
        "31... Rcb8": "31. ... Rc4 32. c3 etc. is dead draw, and probably better for white...",
        "32. c3": "Maybe not best. I did not see much, in 32. h3 g5/Bf6, nor 32. g4 fxg4+ 33. Kxg4 Bf6...",
        "32... bxc3 33. Rxb8 Rxb8 34. bxc3 Kf7": "34. ... e4+ 35. Ke3 Bd8 36. Ra2 Bb6+ 37. Nd4, also closes a draw...",
        "35. g4": "Now it is draw, or die for black... 35. ... fxg4 36. Kxg4, is very unclear for black...",
        "35... g6": "Draw offer from black accepted... White has nothing, but so does black... To me, this draw meant a lot..."
    },
    "url": "https://gameknot.com/annotation.pl/bobby-fischer-memorial-open-tournament-1950-2150?gm=42082",
    "gameName": "Bobby Fischer Memorial, Open Tournament 1950 - 2150",
    "players": "vonbonk (1952) vs. princevlad (2045)",
    "opening": "Sicilian (B20), Keres variation (2.Ne2)"
}