{
    "moves": {
        "1. Nf3": "(*Back one for intro*)Only a GM playing at this level considers this move normal. Most of us patzers try to stake pawns in the center right away......",
        "1... Nf6": "Repaid in kind. It is noted that with the black pieces, RJF tried to castle kingside early, and this move aids that idea, as well as exerting influence in the middle.",
        "2. c4": "Going for a quick queenside expansion right away. I guess the d and e pawns haven't quite learned to walk yet....",
        "2... g6": "And the plan of RJF is obvious. Bishop to g7 and castling are next....no surprise there.",
        "3. Nc3": "Simple development.",
        "3... Bg7 4. d4": "Finally!",
        "4... O-O 5. Bf4": "More developing, getting the dark squared bishop outside a potential pawn chain.",
        "5... d5": "RJF finally stakes a claim in the center.",
        "6. Qb3": "I see moves like this when I play stronger players myself. I can only assume the intent is to tie down black's light squared bishop in a protective role, while protecting the c pawn and getting an early line aimed towards black's king.",
        "6... dxc4 7. Qxc4 c6": "I guess this is why I will never break 1600. This move makes little sense to me. Black's Nb8 has just lost a potential home.",
        "8. e4": "And it appears that Byrne owns the center.",
        "8... Nbd7": "And now RJF blocks in his light squared bishop. I wonder if he really knows how to play this game;)",
        "9. Rd1": "Strong....rook to half open file, and protecting the d pawn.",
        "9... Nb6": "And here come the pain....I guess Fischer DOES know a little something about this game!",
        "10. Qc5": "I like Qd3 better........",
        "10... Bg4": "Last piece developed, with a nice little pin to boot.........",
        "11. Bg5": "? Mistake....Be2 was far better as it would break the pin.",
        "11... Na4": "!! The white queen now has some serious issues.",
        "12. Qa3 Nxc3 13. bxc3 Nxe4": "! This turns out to be a key move in the game. That knight is righteous and will soon cause serious upheaval in white's defenses.....",
        "14. Bxe7": "Practically forced......",
        "14... Qb6 15. Bc4": "Byrne now entertains the idea of getting his knight to e5 or g5.",
        "15... Nxc3": "! Weakening the d pawn, and seeing play down the e file. If white takes, then the Be7 is pinned against the king next move.",
        "16. Bc5": "White counters, attacking the black queen.",
        "16... Rfe8+ 17. Kf1": "17. Kd2 loses either the Bc5 by 17...Ne4  or loses a rook for a knight by 17...Nb1  18. RxN QxR .",
        "17... Be6": "!! Stopping any idea of a sac on f7, and seeing that after a queen sac, black can take c4 with check!",
        "18. Bxb6 Bxc4+": "As Emeril would say......\"BAM!!!\". Can you see what black's knight is thinking?",
        "19. Kg1 Ne2+": "And the \"swinging door\" opens.",
        "20. Kf1 Nxd4+": "And closes.....",
        "21. Kg1 Ne2+": "And opens.....",
        "22. Kf1 Nc3+": "And closes....",
        "23. Kg1 axb6": "Gaining the bishop while attacking the queen.........",
        "24. Qb4 Ra4": "! Preserving the strength of black's light squared bishop.",
        "25. Qxb6 Nxd1": "Notice the position. Black has 5 pieces working collectively, while white has a a lonely queen attacking nothing of value, a knight tied down protecting e1, and a rook who has put a \"Do not disturb\" sign on his door......",
        "26. h3": "A last chance effort to free the rook is coming.....",
        "26... Rxa2": "Grabbing yet another pawn for free if the king budges.",
        "27. Kh2 Nxf2 28. Re1": "I have no idea why white would instigate a trade here. I guess he is trying to find a way to coax out the Bg7 and attempt a 3 move repetition.",
        "28... Rxe1 29. Qd8+ Bf8": "RJF ain't having it!!!!!!!!!!!!",
        "30. Nxe1 Bd5": "! Another great move. It points the bishop towards white's king while blocking the white queen from retreating back down the d file to defend.",
        "31. Nf3 Ne4": "Not willing to give up the Bd5 under any circumstance.",
        "32. Qb8": "Why not? Maybe Bobby will have a heart attack and lose all touch with reality.",
        "32... b5": "Anybody else notice that besides having an AWESOME attack underway, he also has two connected passed pawns?",
        "33. h4": "Kind of pointless...........",
        "33... h5 34. Ne5": "This move was made due to lack of options.......",
        "34... Kg7": "Putting the white knight at least  three moves away from delivering a check, while freeing the dark squared bishop. Great patience by Fischer.",
        "35. Kg1 Bc5+": "Byrne's inner vocabulary was probably insulting to Fischer's mother.....",
        "36. Kf1 Ng3+": "And father.......",
        "37. Ke1 Bb4+": "And siblings....",
        "38. Kd1 Bb3+": "And extended family....",
        "39. Kc1 Ne2+": "And dog.....",
        "40. Kb1 Nc3+": "And the guy who cut Bobby's suits.......",
        "41. Kc1 Rc2#": "And there you have it. An absolute masterpiece of attack. I've never seen a game like it. That guy sure could (can?) play. I hope you have enjoyed the game, and I welcome any feedback you may have.\r\nBest regards - tag1153"
    },
    "url": "https://gameknot.com/annotation.pl/bobby-fischers-game-of-the-century?gm=256",
    "gameName": "Bobby Fischer's \"Game of the Century\"",
    "players": "Donald Byrne  vs. Bobby Fischer ",
    "opening": "Reti opening (A05)"
}