{
    "moves": {
        "1. e4": "A very instructive game I played in a thematic tournament. My last game against Zauberer was a clear defeat...",
        "1... d6": "The Pirc opening. A strong defense with a little drawback : the bishop f6 is blocked by the black pawns. But gives very good chances for defensive players",
        "2. d4": "take the center...",
        "2... c5": "Not the main line. In the \"classical Pirc\", black will play Nf6,g7,Bg7 and O-O.\r\n",
        "3. dxc5 Qa5+": "Zauberer tries to destroy my center...",
        "4. Nc3 Qxc5": "Now, Zauberer has a better center than me, but his queen may be too early on game...",
        "5. Be3": "Move it !",
        "5... Qa5 6. Nf3 Nf6 7. Nd2": "with the idea of chasing the queen. Black's development is slow",
        "7... Nc6 8. Nc4": "And move your queen again !",
        "8... Qd8 9. Bd3 g6": "With the idea of fiancetto. I hate fiancetto, so...",
        "10. Qd2": "Line up the bishop ant the queen to fight against the...",
        "10... Bg7": "...fiancetto...",
        "11. Bh6": "like this !",
        "11... O-O 12. Bxg7 Kxg7 13. O-O Be6": "Now, the developpement is finished. Time to try some combinations.",
        "14. a3": "A prophylactic move. Prevents Nb4, which could be annoying.",
        "14... Nd4 15. Nd5": "Fritz says it's a bad move. It's true, but I had an idea...and didn't have Fritz to help me during the game ;-)\r\n",
        "15... Nxd5 16. exd5 Bxd5": "Here was my idea...attract the bishop in e4, take the knight with check and regain the bishop. This gains a piece. So...",
        "17. Be4": "Attract the bishop in e4\r\n",
        "17... Bxe4": "done...",
        "18. Qxd4+": "Take the knight with check !",
        "18... f6": "What else ?",
        "19. Qxe4": "Take back the bishop and win a piece ! I won a piece against a pawn !!",
        "19... d5": "ooops. A lesson to retain ! when you calculate combinations, never stop until you come in a safe position. With this fork, Zauberer regains his piece ",
        "20. Qe2 dxc4 21. Qxc4": "Material equality !\r\nNow, time to look at the endgame. Zauberer has a pawn majority at king side and I've got one at queenside. For the strong players of my club, it's sufficient to win the game. I wanted to try it...",
        "21... Rc8 22. Qb3 Qc7 23. c3": "stops the offensife on my pawn...now, let's center our troops...",
        "23... Rfd8 24. Rfd1": "I wanted to exchange the pieces to enter in a pawn ending.",
        "24... b6 25. Rxd8 Rxd8 26. Rd1 Rxd1+ 27. Qxd1": "Now, how to exchange the queens ?",
        "27... Qd6": "Like this !!! Thanks, Zauberer !!!!!!",
        "28. Qxd6 exd6": "Now, let's look at the position. We enter a pawn ending.  King side : 3 VS 3 : draw. Queen side : 3 VS 2, better for me. Center : a lone black pawn. The weak point of the black structure is clearly this one. So is my plan : destroy it !!!",
        "29. Kf1": "Kings go to battle.",
        "29... Kf7 30. Ke2 Ke6 31. Kd3 f5 32. f4": "With this move, I lock the king side. If you can, don't let adverse pawns take too much space...\r\nThe f4 and f5 pawns will block the kings, especially the black kings.\r\nBlacks cannot take the opposing by playing Kd5, because of c4.\r\n",
        "32... b5": "Prevents c4 ? Not, because the king protects this case.",
        "33. c4 bxc4+": "what else ?",
        "34. Kxc4": "andtake the opposing.  Black cannot play Ke5, so cannot control d4. So, if black play d5, white play Kd4 and the position is far better for them.",
        "34... h6": "Prepares g5. Have to counter it...",
        "35. g3": "like this for example.",
        "35... g5": "gxf is not dangerous, because of gxf (see later). So I won't move.\r\n",
        "36. b4": "Pushing the candidate pawn.",
        "36... a6 37. a4": "blocked position for blacks at queenside. ",
        "37... gxf4": "Counterplay at king's side ? ",
        "38. gxf4": "not really...",
        "38... h5 39. h4": "Now, this side is locked. Black king cannot unlock it. \r\nBlack don't have any good move. d5 loses because of Kc5 zugzwang.\r\na5 loses as we will see.\r\nAny king move loses (for example Kd7 Kd5 and white either make a passed pawn on the a or b files, or black stops the pawn in a or b rank, and loses the d6 and f5 pawns...)",
        "39... a5": "bxa wins. Black can stop the 2 passed pawns (can reach c8 before white make a queen), but white king goes hunting the other blacks pawns.\r\n\r\n",
        "40. b5": "I thought this one was easier...\r\n\r\nZugzwang !\r\n",
        "40... d5+": "The last attempt.",
        "41. Kc5": "Another zugzwang because black king cannot join e5.\r\nBlack king cannot save the pawn, and resigned here.\r\n\r\nA possible continuation :\r\n          d4\r\nKxd4  Kd6\r\nKc4    Kc7\r\nKc5 (taking the opposition, now it's a fondamental endgame position)\r\n         Kb7\r\nKd6 (b6 doesn't help, beware of stalemates...)\r\nand now white take the f5 and h5 pawns. Victory is only a matter of time.\r\n\r\n\r\n This was a very instructing game for me. Hope you'll enjoy it\r\n\r\n"
    },
    "url": "https://gameknot.com/annotation.pl/bobdoleeatsfoods-mini-tournament?gm=11054",
    "gameName": "bobdoleeatsfood's mini-tournament",
    "players": "paulhuxe (1438) vs. zauberer (1661)",
    "opening": "Pirc defence (B07)"
}