{
    "moves": {
        "1. d4 Nf6": "The most flexible move. I can play d5 in another move or a indian defense",
        "2. Nf3": "This move do not shows the cards. White can plays c4 later",
        "2... b6": "Playing a queen indian-style",
        "3. e3 Bb7 4. Bd3 e6 5. O-O Be7 6. c3": "Now, the white`s structure is similar to a Colle system. Togheter, if white plays e4, take adventage. I can allows this move, but was a mistake. Ne4 or d5 are better.",
        "6... O-O 7. Nbd2 d6": "Now, d5.",
        "8. Qe2 Nbd7 9. e4": "White are a good central position, with initiative and possible attack in kingside.",
        "9... c5": "I need space, but e5, stopping the white e pawn,  are better.",
        "10. Re1 Rc8": "To take the c-column in case of cxd4. But me do not take that idea. ",
        "11. Nf1 Qc7 12. Bf4 e5": "A bad move, with idea to opening the center and put the f-rook en d8, I gives to my opponent the f5-square and weak the d5.. White has a clear adventage",
        "13. dxe5 dxe5 14. Bg3 Nh5": "Ne3 are inevitable. Thus, I will have the pair of bishops",
        "15. Rad1 Nxg3 16. Nxg3 Rfd8 17. Nf5 Bf6 18. Bc4 Nf8 19. g4": "White weakness the kingside in a try to attack. A bad strategy. He must play Bd5, the outpost, with total control of the position, Now, I have the outpost f4",
        "19... Ng6 20. g5 Be7 21. Bxf7+": "A sacrifice without another piece to attack. Best are Bd5. Now I take material adventage.",
        "21... Kxf7 22. Qc4+ Kf8 23. Qe6": "Now, I will enchange material, to reduce the attack and approveach the pair of bishops",
        "23... Rxd1 24. Rxd1 Rd8 25. Rxd8+ Bxd8": "A big mistake, better is Qxd8, threating Qd1+ and Bc8.",
        "26. Nd6 Bc6": "Only move, but sufficient",
        "27. Nxe5 Nxe5 28. Qxe5 Qe7 29. Qf5+ Kg8 30. e5": "Best is 30 h4 Bd7 31 Qf4",
        "30... Qxg5+ 31. Qxg5 Bxg5 32. Nc8 Kf7 33. Nxa7": "Now, the knigth are out of the game, and the last chance to not lost is  34 c4 35 Nb5, allows the exchange.",
        "33... Bd7 34. b4 cxb4 35. cxb4 b5": ""
    },
    "url": "https://gameknot.com/annotation.pl/bodejaxs-mini-tournament-i?gm=37410",
    "gameName": "bodejax's mini-tournament I",
    "players": "paladin316 (1563) vs. chizzo83 (1764)",
    "opening": "Queen's Indian defence (A47)"
}