{
    "moves": {
        "1. d4 Nf6 2. c4 e6 3. Nc3 Bb4 4. a3": "Defensa Nimzoindia, variante Samisch, las blancas quieren la pareja de alfiles y no les molesta que se les doblen los peones en la columna c.",
        "4... Bxc3+ 5. bxc3 c5": "Colocando mis peones en casillas oscuras. Putting my pawn in dark squares,",
        "6. e3 O-O 7. Nf3 d5": "Un error, claramente convenía d6 y De7, para jugar e5. A mistake, better is d6-Qe7 with idea e5.",
        "8. Bd3 Nc6 9. O-O Qe7 10. a4 b6 11. Ba3": "Las blancas están mejor, presionan la posición negra con los alfiles y amenazan abrir el centro con Dc2-Cd2-e4, donde lograrían un fuerte ataque. White has adventage, putting pressure in black´s position with both bishop and threat open the center with Qc2-Nd2-e4.",
        "11... Bb7 12. Qc2 Rfc8": "Atacando el debilitado flanco dama blanco, y por rayos X a la dama. Ataccking the weak queenside and the queen.",
        "13. cxd5 exd5 14. Rfe1": "No es necesario, la torre podría apoyar un futuro avance del peón f. Not necessary, the rook may be support f-pawn advance",
        "14... Ne4": "Block e4.",
        "15. Nd2": "Realizado con un tiempo de menos, esta jugada no surge tanto efecto. Aunque me sentí perdido, luego encontré la próxima jugada, tomando la iniciativa. With a lesstime, this move isn´t effect. I was felling lost, but later I find the nex move. I take the iniciative",
        "15... Nb4 16. cxb4 cxb4 17. Qb1 bxa3 18. Bxe4 dxe4 19. Qb3 Rc7": "Las blancas necesitan invertir tiempo en recobrar el peón, dejando las torres descolocadas, tiempo que aprovecho para doblar las torres en la columna c y colocar el alfil en d5, ejerciendo un bloqueo sobre el peón pasado; los peones a y b son candidatos a peon pasado y deberán ser neutralizado. Las blancas tienen problemas de coordinación. White needs moves to gain the pawn, and the rook will be in a3, a bad position. This time is approach to double rooks in c-column and put in d5 the bishop, blocking the past pawn",
        "20. Qxa3 Qxa3 21. Rxa3 Rc2": "Un nuevo tiempo ganado. A new time",
        "22. Nf1 Rac8 23. Raa1 Bd5 24. Ng3 g6": "Nueva fase del plan, movilizar el flanco rey, a fin de reducir el contrajuego blanco. New phase, to movilize the kingside, to reduce the counterstrike.",
        "25. h4 Rc8c6 26. h5 Kg7 27. hxg6 hxg6 28. Ne2 g5 29. Ng3 Kg6 30. Nf1 f5 31. Reb1 a6": "buen movimiento, se tiende una celada y de paso, se amenaza b5, creando un peón pasado móvil. Las blancas deben presionar el peón ahora débil de b6. Good move, this give a threat and try b5.",
        "32. Rb4 f4 33. Rab1 Kh5": "Complementario, no hay jauqes en la 6 fila. Complementary, no checks in 6-rank.",
        "34. Rb4xb6 Rxb6 35. Rxb6 Rc1": "AHora, las blancas pierden pieza. Now, white lost a piece.",
        "36. Rb4 a5 37. Rb2 Bc4 38. exf4 gxf4 39. Kh2 Rxf1 40. d5 e3": "this pawn will be promotionated or changed for the rook. White resign"
    },
    "url": "https://gameknot.com/annotation.pl/bodejaxs-mini-tournament-i?gm=37175",
    "gameName": "bodejax's mini-tournament I",
    "players": "imacasio (1721) vs. chizzo83 (1750)",
    "opening": "Nimzo-Indian (E26), Saemisch variation"
}