{
    "moves": {
        "1. e4 e5 2. Bc4 Nf6 3. Nf3": "This is the last move of the gambit.\n",
        "3... Nc6": "This is the best response to the gambit that I have seen so far. Black declines Nxe4 and instead calmly develops and maintains control instead of losing development time by chasing a pawn and exchanging a knight after many moves.\n",
        "4. c3": "!? Playing against d4, takes away ...Bc5 or ...Bb4 and it leaves room for the c4 bishop to escape a knight attack. Its not aggresive, it does offer e4 with the idea of attempting to gain an edge in development.\n",
        "4... Nxe4 5. O-O d5": "White has to suffer this move in an attempt to obtain a long term positional advantage.\n",
        "6. Bb3 Be7": "Black continues development with plans for 0-0.\n",
        "7. d4": "Just breaking up the center to reduce the pawn presence.\n",
        "7... exd4 8. cxd4": "Suffering an isolated pawn, but black almost has the same because of the knight on c6. The pawn is not under serious attack, and plans for white are to keep black busy defending pieces so to keep the d4 pawn out of immediate consideration.\n",
        "8... O-O 9. Ne1": "With the idea of f3 to push back the knight.\n",
        "9... Be6": "Just a developing move, does not give white any problems. White is suffering from some serious developmental issues, but the plan is to attack, expand, develop for a positional attack.\n",
        "10. Kh1": "Prevents a pin on the f pawn in the future - in the event of losing d4. Just a precaution. Perhaps unecessary, but I felt it was wise.\n",
        "10... Nb4": "?! Its not a good move because the knight can be chased back losing tempo. Although it has to take a number and wait while I chase the e4 knight.\n",
        "11. f3 Nd6 12. Nc3": "Catching up a little on development because the knight at b4 is no great worry. It will be chased away.\n",
        "12... Nc4": "Not an encouraging formation of knights from whites perspective, but they will be chased back to less useful positions while white consolidates pieces.\n",
        "13. a3 Nc6 14. Bc2": "Eyeing h7.\n",
        "14... Bg5": "Jabbing at the queen to either bring the black queen in after an exchange of bishops, or to be able to gain e4 after white pushes f3-f4.\n",
        "15. f4": "I decide this pawn can gain some positional pluses so decide to push it.\n",
        "15... Be7 16. f5 Bc8 17. b3": "Chasing the other knight back.\n",
        "17... Nb6 18. Qh5": "?! A risky decision which is not altogether certain in its prospects. Sacrificing a pawn to attempt an attack.\n",
        "18... Nxd4 19. Bd3": "Need to keep the bishop for the attack, so another pawn is sacrificed.\n",
        "19... Nxb3 20. f6": "?! Still playing with fire.\n",
        "20... g6 21. fxe7 Qxe7 22. Bg5": "?! Trying an idea.\n",
        "22... Qxe1": "?? I believe that ...f6 is better and should keep black perfectly safe. The very knight that was captured was preventing the a1 rook from participating, so this move seems wrong, especially since the a1 rook is under fire.\n",
        "23. Raxe1 gxh5": "From a strictly material point of view black is much better, but white has some positional pressures that can be played. There is no assurance that white can gain advantage, but there are some chances.\n",
        "24. Bh6": "No so much an attack on the rook as it is to keep the king anchored.\n",
        "24... Rd8 25. Rf3": "?! With the idea of doubling rooks on the f file, with the option to try a piece swindle after ...Bg4. A better move could be Rf6, which may encourage a knight attack, but it will keep the h6 bishop safe from a rook attack.\n",
        "25... Bg4 26. Rg3": "This would actually work if the h6 bishop was not hanging.\n",
        "26... Rd6 27. Bf4": "The game gets interesting as me and the computer attack - parry - counter attack.\n",
        "27... Rc6 28. Bb1": "Adds protection to the knight and enables h3 to try and get the bishop. Unfortunately black has a nice move in reserve which prevents this from happening.\n",
        "28... Nd4": "Black is trying to get the rook with ...Nf5, but the bishop will be attacked before this takes place forcing black to make a challenging move.\n",
        "29. h3 Re6": "! Why not trade material. Black has a nice material advantage. The forced exchange gives black time to counter attack the rook forcing a retreat from the pin applied to the bishop.\n",
        "30. Rxe6 Nxe6": "The recapture with attack forces white  to save a piece and so is unable to gain the bishop. Its a nice move that also prevents Bg5 to prevent ...h4.\n",
        "31. Bh6": "Playing the only positional advantage I have, again.\n",
        "31... d4": "Black has a lot of positional pluses and white is forced to tap dance in the minefield.\n",
        "32. Ne4 f5 33. Nf2": "Keeping the d4 pawn in mind.\n",
        "33... h4": "And finally black breaks the pin to free the bishop.\n",
        "34. Rd3": "Maybe not an awesome move, but it keeps the rook out of knight attacks.\n",
        "34... Be2": "Trading blows.\n",
        "35. Rd2 Bc4 36. Bxf5": "White scores a pawn, but is still in an akward position.\n",
        "36... Rd8": "Prevents BxN followed by RxP with an attack on the bishop.\n",
        "37. Nd3": "Trying to gain a better position for the knight. BxN fails to BxN+ followed by RxB.\n",
        "37... Rd7": "Not certain about the reasoning to this move.\n",
        "38. Ne5 Rd6 39. Nf3": "Threatens h4, adds pressure to d4.\n",
        "39... Nc5": "Enables an attack on the bishop.\n",
        "40. Bg5": "Saves the bishop, attacks h4 by bishop.\n",
        "40... Nb3": "Thrust.\n",
        "41. Rd1": "Parry.\n",
        "41... Be2": "Skewered a little.\n",
        "42. Re1": "Counter attack.\n",
        "42... Bxf3": "Maybe helps white a little.\n",
        "43. gxf3": "Now both bishops can anchor on a pawn if needed.\n",
        "43... Kf7 44. Bxh7": "I decide to cash in on a pawn while the chance is fresh. The h4 pawn can wait.\n",
        "44... Nc4": "Black focuses on trying to make clearance for the d4 pawn, but leaves a weakness behind on the 7th rank.\n",
        "45. Re7+": "! Forcing the king back and lining up for a pawn feeding frenzy.\n",
        "45... Kf8 46. Rxc7 Rc6": "A simple challenge, but it does not prevent wholesale pawn demolition.\n",
        "47. Rxb7": "White has managed to regain a material balance, many moves later, but has a bit of a threat by way of a promoted d4 pawn.\n",
        "47... Nc5": "?? Black is not maintaining a good grip on pawns and drops one more. ..a7 is better. The reasoning for the move is probably to push ...d3 to force the loss of a bishop to stop the promotion.\n",
        "48. Rxa7": "There are still some difficulties, but white is gaining advantage.\n",
        "48... Ne5": "Heading for the king.\n",
        "49. f4": "Just adding protection for the pawn and bishop before a swarm of knights descends on the king.\n",
        "49... Nf3 50. Be7+": "Keeps the rook in place until the knight moves away.\n",
        "50... Ke8 51. f5": "Bringing my own threat of promoted pawn up the board.\n",
        "51... Nd7": "! Nice. Black cuts off protection to the bishop.\n",
        "52. Bb4": "Maintaining some coverage on the d file.\n",
        "52... Rc1+": "So begins a little king hunt.\n",
        "53. Kg2 Nfe5": "Safety for the knight, but also takes away a square from the king.\n",
        "54. Kf2": "Essential, the king must obtain a good escape route.\n",
        "54... Nd3+": "Back to the hunt.\n",
        "55. Kf3": "Its not a great looking move, but it has the advantage of allowing the king to obtain a good square after ...Ne5+\n",
        "55... Nd7e5+ 56. Ke4": "Threatens the pawn.\n",
        "56... Nxb4": "? Black takes away the double bishop advantage, but loses some essential control of the board. Not the best move.\n",
        "57. axb4": "Another pawn is ready to run up the board and promote. The question is, who will get there first?\n",
        "57... Re1+ 58. Kd5": "The pawn is immune. (58.Kxd4 ?? Nc6+ !)\n",
        "58... Nf3": "Diverting to attack the bishop because it prevents the pawn from gaining the last rank.\n",
        "59. Kc6": "Trying to obtain a square free from attacks so a pawn can then be pushed to advantage.\n",
        "59... Ng5": "A simple attack on the bishop, but then there is the h3 pawn which is more valuable.\n",
        "60. Bg6+": "Safety and attack.\n",
        "60... Kf8 61. b5 Ne4": "?? Blocks the bishop line to d3. Better was Nxh3 ! to promote the h4 pawn.\n",
        "62. Kd7": "Preventing a rook check while trying not to walk into a fork of king and anything else.\n",
        "62... Kg7 63. Ke6+": "Trying to gain tempo so the b pawn can be pushed. The following moves are my feeble attempt to gain a better position for this purpose.\n",
        "63... Kf8 64. Ra8+ Kg7 65. Ra7+ Kf8 66. Rf7+ Kg8 67. Ra7 Kf8 68. Kd5 Nc3+ 69. Kc6 Re7": "Not a bad try. Eliminate the rooks and the bishop will have to be sacrificed to stop the d4 pawn from promoting. But there is some danger because of the b5 pawn and because a trade of rooks is not forced.\n",
        "70. Ra8+ Kg7 71. b6": "White has a good position. The king is safe from checks and the pawn is able to gain another step. White has the lead in pawn promotion and black will not gain much by sacrificing the rook to prevent promotion.\n",
        "71... Rf7": "?? The computer loses is perspective and the rook is lost. The losing move which gives the game to white. I can not recommend a better move.\n",
        "72. Bxf7": "And the rest is a matter of technique.\n",
        "72... d3 73. Bb3": "The gamble does not pay off because the bishop will stop the pawn.\n",
        "73... d2": "The game is technically won by white, but is played on to its conclusion.\n",
        "74. b7 d1=Q 75. Bxd1 Nxd1 76. b8=Q Kf6 77. Ra5": "Stops the king from passing the 5th rank, because of the combination of queen and rook lines and pawn, all white has to do is push the f pawn to completely lock out the 5th rank.\n",
        "77... Kg7 78. Qd6 Nc3 79. Ra7+ Kg8 80. Qb8#": "A very tough game now that the computer is playing on a higher level. Now I really have to think and counter some strong moves that the computer is throwing at my position. I tried a new idea in this game in response to (3...Nc6) I played (4.c3) with ideas of breaking up the center. Pawns were sacrificed and I played on with strategic plans riding on a 4 pawn deficit! I had a very difficult time attempting to obtain my strategic plans and had to create new ones as the game progressed.\n"
    },
    "url": "https://gameknot.com/annotation.pl/boden-kieseritsky-gambit-2-knights-m80?gm=24047",
    "gameName": "Boden-Kieseritsky Gambit 2 Knights M80",
    "players": "ChessKnave  vs. Computer - FH001 ",
    "opening": "Bishop's opening (C24), Berlin defence"
}