{
    "moves": {
        "1. e4": "Hi everyone - nice just to write about a win for a change.  I was playing against a guy called Andy who had a similar rating to myself.  Andy played very well but somehow I managed to get a rook onto his second rank and that piggish rook made slop of one of his pawns and eventually more and more material dropped, until I was able to crown my a pawn.  Andy resigned on the grounds of ruinous loss of material but Freddy, who looked at this game said I had a mate in 3 - more on that later.  Anyhow - I face the Sicilian and I play an unusual 3rd move, Bc4 instead of the standard pawn exchange on d4.",
        "1... c5 2. Nf3 d6 3. Bc4": "3. Bc4 - voila!",
        "3... Nf6 4. Qe2 Nc6 5. c3": "5. c3 - transposes into a c3 Sicilian.",
        "5... g6 6. O-O Bg7 7. h3 O-O 8. Bb3 e5 9. Rd1 h6 10. d3 Kh7 11. Be3": "11. Be3 - the wood now starts to come off the back row.",
        "11... b6 12. Nbd2 Ne7 13. d4": "13. d4 - a pawn break - will this be to my advantage?  I analyse it and it looked good at the end so I decided to go for it.",
        "13... cxd4 14. cxd4 Nd7 15. dxe5 dxe5 16. Rac1": "16. Rac1 - my queen rook goes over to commandeer the open c file.  A little stuck for ideas beyond that, however my opponent helps me out here.",
        "16... g5 17. Nh2 Ng6 18. Ndf1 Qe7 19. Ng3": "19. Ng3 - eyeing up a knight outpost on f5 or h5, preferably f5 because Glenda may want to bag h5 so that she can get close to the enemy king!",
        "19... Bb7 20. Rc7": "20. Rc7 - after black's plausible Bb7 putting pressure on e4 I decide to take the opportunity to invade the 7th rank with my rook.  This is called a \"Bone in the throat\", hence the title of this game.  With my opponent it really does choke him!",
        "20... Bc8 21. Ba4 Rd8 22. Bc6 Rb8 23. Rxa7": "23. Rxa7 - the Bone in the throat then the pin on the d7 knight has finally reaped results - I have won a pawn on a7 and black's b pawn is very weak.  Can I capitalise further?",
        "23... Ngf8 24. Bxd7 Rxd7 25. Rdxd7 Bxd7 26. Qh5": "26. Qh5 - that plethora of exchanges has not helped black very much.  Now his lsb is pinned and he remains a pawn down.  Now Glenda moves to h5 and I try a mating attack.",
        "26... f6 27. Nf5 Qe8 28. Qxe8 Rxe8 29. Nxg7 Kxg7 30. Bxb6": "30. Bxb6 - the mating attack does not materialise but I was quite happy to exchange queens and my knight for his dsb because I was a pawn up.  Now I increase my material advantage and I have two lovely passers on a2 and b2.  I now try and push them up the board - my next move is 31. b4.",
        "30... Kg8 31. b4 Bb5 32. Ng4": "31. Ng4 - more ebony is about to drop off.  Black defends his e pawn but I am still able to snap off the h6 pawn with check - as his king is confined to the edge of the board he will not be able to attack my knight after the capture, so I will be able to take on h6 and then move Fou Lenoir out of the black rook's path.",
        "32... Re6 33. Nxh6+ Kh8 34. Bc5 Ng6 35. Nf5 Nf4 36. a4": "36. a4 - passers must be pushed.",
        "36... Ne2+ 37. Kh2 Bd3 38. f3 Re8 39. Nd6 Re6 40. a5 f5 41. exf5 Rf6 42. g4 Nf4 43. a6": "43. a6 - closer and closer to Glendadom does my white pawn move.  However, I feel very cold all of a sudden, see a dark shadow and something stinks - what could that be but Old Matey!  Yes, even with 4 points up in material and with a passer certain to crown I could end up being crowned if I am not careful.  For if the h pawn goes Henry could be vulnerable to a corridor mate along the h file.  His horsie will go to e2 and his bishop to f1 cutting off Henry's escape.",
        "43... Bf1 44. Ra8+ Kh7 45. a7 Ne2": "45. .......... Ne2.  The net closes in around Henry.",
        "46. Rb8 Rh6 47. Rh8+": "47. Rh8  - but Andy is not going to have Henry, that is King Freddy's priviledge! spectacularly foiled by this check.  The black king can take my rook but will fall to a knight fork from Henry's steed when he moves to f7 giving check.  Nothing can stop Her Glendaness now!",
        "47... Kxh8 48. Nf7+ Kh7 49. Nxh6 Kxh6 50. a8=Q": "50. a8/Q - A teriffic fanfare greets the arrival of Glenda.  Black now resigns on the grounds of ruinous loss of material, but guess what ........ King Freddy spotted a mate in 3 and got me to check it out.  I did and I may make a puzzle of it so watch this space!!"
    },
    "url": "https://gameknot.com/annotation.pl/bone-in-the-throat?gm=21770",
    "gameName": "Bone in the throat!",
    "players": "jstevens1 (1764) vs. ralbama1 (1617)",
    "opening": "Sicilian (B50)"
}