{
    "moves": {
        "1. d4": "I haven't annotated a game in the botvinnik since my first three annotations, so while this will be similiar to the game Van Wely-Smeets (as these game are the same until move 19).  The botvinnik may be analyzed to death, but to the uninitiated, such as I (though I'll do my best), it's wonderously absurd in it's tactical spectrum.  I'll start annotating at move 7.",
        "1... d5 2. c4 c6 3. Nf3 Nf6 4. Nc3 e6 5. Bg5 dxc4 6. e4 b5 7. e5 h6": "And we enter the world of the botvinnik.",
        "8. Bh4 g5 9. Nxg5": "White could play 9.Bg3, but what fun would that be?",
        "9... hxg5 10. Bxg5": "So white is regaining the piece.",
        "10... Nbd7 11. exf6": "An alternative is 11.g3 which frequently transposes after 11... Bb7 12.exf6 but black could try 11... Rg8 there attacking the pinning piece, after 12.h4 Rxg5 13.hxg5 black has broken the pin but white can seriously damage black's kingside after 13... Nd5 14.g6! fxg6 15.Qg4 Qe7 when white can play Bg2-e4 building pressure or just take on g6.  With white in this opening Kramnik has favored that line, but I think most white players prefer to not give black that option.",
        "11... Bb7": "Regaining the pawn on f6 would walk into a pin, why do that?",
        "12. g3": "This may look like it opens the a8-h1 diagonal for black but white can shut it down with d5, and where else will the f1 bishop go?  e2 looks weak and then there's still a weakness on the long light squared diagonal, the one on g2.",
        "12... c5": "Black attacks the rook.",
        "13. d5": "White temporarily shuts down the diagonal and will at the right moment blast the game open with dxe6.",
        "13... Qb6": "This the main move but both Qc7 and Qa5 have been played.  This move seems logical as e6 is given extra defense, but the others have clear purposes to, Qc7-e5 is a possibility and Qa5 pins the c3 knight while all of them prepare to castle queenside.  note that 13...exd5? loses to 14.Qe2  black cannot allow tactics around king in the center.",
        "14. Bg2 O-O-O 15. O-O": "Opposite side castling, almost always dangerous, and in this position black has two half open files against white's king white his queenside pawns are potentially over-extended.  Note that black is the one who has sacrificed a pawn here.",
        "15... b4 16. Rb1": "The older move is 16.Na4.  I plan to annotate some games with that move as well.",
        "16... Qa6": "The queen must sidestep the rook.  If 16... bxc3? 17.bxc3 attacks the black queen and after 17... Qa6 18.Rxb7! Qxb7 19.dxe6 and we see white explode the game open while attacking the black queen on the long diagonal.  This opening is extremely tactical, it's almost always based on finding the right way to open the position.",
        "17. dxe6": "White opens the game anyway.",
        "17... Bxg2 18. e7": "And the absurdity is now full blown, white gives up the g2 bishop AND the f1 rook in order to stick a pawn on e7.",
        "18... Bxf1 19. Qd5": "Threatening a dangerous attack with Qa8  with Bf4 and exd8=Q  in the air.",
        "19... Bxe7": "This is where this game diverges from Van Wely-Smeets.  In that game black tried to stop a potential Bf4 with 19... Bh6.",
        "20. fxe7 Bd3": "Retreats the bishop from danger while attacking the white rook.  Kramnik had played Rdg8 against Kasparov and was quite bad after 21.Ne4 Rg6 (defending d6) 22.Qa8  Nb8 23.Bf4 and white soon has a winning advantage, in fact fritz showed the win after 23... Qb7 24.Qxb7  Kxb7 25.Kxf1 Kc6 26.Rd1 Nd7 27.Nd6!",
        "21. Ne4": "There's no need to worry about material, white brings another piece towards the black king.  Note that white only manages a draw in this game so perhaps white needs something better earlier in the variation with 19... Bxe7.  Maybe he must try 19.Kxf1 which keeps some threats and stops the Bd3 ideas.",
        "21... Bxb1": "Now white goes all out for the kill but he does not have quite enough.",
        "22. Nd6+ Kc7 23. Bf4": "! This makes black's defense difficult due to the double check of Ne8.  After 24.Ne8  (if it was white's move here):\n\na) 24... Kb6 25.Qd6 Ka5 26.dxe8=Q  is easily winning or 25... Kb5 26.Nc7  or 24... Kb7 25.Qc7  Ka8 26.exd8=Q \n\nb) 24... Kc8 25.Qa8  instantly would end the game.",
        "23... Kb6": "! Black avoids that potential check, though I'd be scared to have my king so far out.",
        "24. Nxc4+ Kb5": "And the king is drawn forward, but white simply doesn't have enough to win it.",
        "25. Nd6+ Kb6 26. exd8=B+": "Tossing in a check, but it's doesn't win the game.",
        "26... Rxd8 27. Nc4+ Kb5 28. Nd6+ Kb6 29. Nc4+": "So here they drew, but were there any alternatives, what about 29.a4 but after 29... bxa3 30.Nxc4  Qxc4! 31.Qxc4 a2 and the strong pawn makes the position un-win-able for white.  So what about an earlier a4?  28.a4  and both takebacks are interesting:\n\n28... Kxa4 29.b3 Kxb3 and there are discoveries but black has great pawns for stopping checks, and he should be fine.\n\n28... Qxa4 29.Nd6  Ka5 (29... Kb6 30.Qb7  mates) and again I doubt that white's got more than a perpetual.\n\nI hope you enjoyed this lively game that seems to draw doubt upon the move 19.Qd5.  It's a great theoretical dispute, and I wish more players played the botvinnik so that we could see more of these kinds of developments.  Perhaps I'll annotate a game with 19.Kxf1 next or with 16.Na4.  If you have comments I'd love to hear them."
    },
    "url": "https://gameknot.com/annotation.pl/botvinnik-game-4-underpromotions-are-always-fun?gm=13137",
    "gameName": "Botvinnik Game #4: Underpromotions are always fun",
    "players": "GM Topalov (?) vs. GM Kramnik (?)",
    "opening": "QGD Slav (D15), 4.Nc3"
}