{
    "moves": {
        "1. e4 c5 2. Nf3 d6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 a6 6. Bc4 e6 7. Bb3 b5": "A well-known position. Bobby Fischer scored many fine wins with White using this set-up.",
        "8. f4": "But this is a bit unusual. White avoids the main lines but retains the chance of introducing complications.",
        "8... Bb7": "Almost certainly best: The bishop takes to the powerful diagonal. I've had this position as White quite a few times and never lost - honest. If you like a position - or are interested in it - then the chances are that you'll play reasonably well in it.\r\n\r\nThings can turn nasty quite quickly- which is good if you like tactical chess. Consider what can follow  the provocative 8...b4 -\r\n\r\nKraiouchkine - Yanayt [2081 v 2287]; USA; 2009]  continued 8...b4 9.Na4 Nxe4 10. O-O d5 11.f5  Be7 12.fxe6 fxe6 13.Nxe6 Bxe6 14.Qh5+ g6 15.Qe5 Kd7 16.Bxd5 and White won quickly.\r\n\r\nThe same basic tactics were seen in Malik - Luch [2240 v 2364]; Czech Rep' 2004] 8...b4 9.Na4 Nxe4 10.O-O Bb7 11.f5 e5 12.Ne6 fxe6 13.Qh5 Kd7 14.fxe6+ Kc8 15.Be3 which ended as a draw. These disruptive sacrifices can be very difficult to defend against.",
        "9. e5": "This has surprised some opponents in tournament chess: since the b7 bishop is now permitted to slice right across the entire board. Yet Black must be careful here.",
        "9... Nfd7": "Normally, Black simply plays 9...dxe5 and only after after 10.fxe5 does he retreat the knight with hopes of capturing the e-pawn at some later point.\r\nI considered castling here in the hope that, once Black trades pawns in the centre, the game would transpose back to the more usual continuation. \r\n\r\nAfter 10.O-O dxe5 11.fxe5 White is eyeing the two squares, e6 and f7. A rook sac on f7 can occur in some lines and can lead to great complications.",
        "10. Be3": "In the end I decided to simply shore up the black diagonal and await developments.",
        "10... dxe5 11. fxe5 Bxg2": " As suspected - up to no good. Well, it was invited. Things could  get very interesting. \r\n\r\nI have my doubts if White can afford to play 12.Kd2 [hoping for ...Bxh1 13.Qxh1 with some compensation] because Black might instead play 12...b4 13.Na4 Nxe5 and Black is surely better.\r\n\r\nIn any event, the text move 12.Rg1 must be better: It introduces another piece into the mix without the need for further speculation.",
        "12. Rg1 Qh4+": "The check is tempting and isn't actually bad. Unfortunately, it is Black's follow-up cause the check to 'bounce'. White soon cashes in.",
        "13. Kd2 Qxh2": "[?] It's a pity Black continued this way: my opponent told me after the game that he had made a note to himself NOT to touch that pawn - but then came back later and did the very opposite.\r\n\r\nNominally, Black will have plenty of pawns for the piece he is about to lose. But material is no longer the problem. I think best - and probably what Black would have played nine times out of ten - was simply 13...Bb7. \r\n\r\nAfter the likely continuation 14.Qe2 b4 15.Na4 Nxe5 16.Nb6 Ra7 17.Rad1 I quite like White's attacking potential - but it is hardly yet a 'won game'.",
        "14. Qe2 b4 15. Na4 Qxe5 16. Qxg2 Ra7": "White has tremendous firepower at his disposal. He can at once play 17.Nxe6 and gain the exchange. \r\n\r\nNevertheless, he is greedy on behalf of the a1 rook who doesn't want to be the only piece left out of the action.\r\nBut where best to put the rook? ",
        "17. Rae1": "In fact the decision is a bit of a 'no-brainer': In lines up against that pawn on e6 - and the queen on the same file.",
        "17... Nc5 18. Nxe6": "This thematic move has been on the cards from the start. Sometimes it is the light squared bishop that is given up on e6 in order to plant the knight there with all its tricks still up its sleeve.",
        "18... Nxb3+ 19. axb3 Rd7+ 20. Bd4": "Not hard to find: There is no need for the White king to budge an inch.",
        "20... Qd6 21. Nxf8+": "Black sportingly resigns at the right moment. \r\n\r\nThe enemy pieces will soon be swarming around the the king like a cloud of angry hornets: 21...Kd8 22.Qg5 Kc7 [...Kc8 23.Re8+] 23.Qa5+ and so on."
    },
    "url": "https://gameknot.com/annotation.pl/bounced-check?gm=27547",
    "gameName": "Bounced check",
    "players": "jackdaw1 (1690) vs. openmindedpanda (1611)",
    "opening": "Sicilian (B90), Najdorf, Lipnitzky attack"
}