{
    "moves": {
        "1. d4": "I've picked this for annotation because I found it quite an intriguing example of how a game can turn on one move - it's not intended a a technical analysis, just my thoughts and observations. The title of it is nothing more than a reflection of the rivalry I share with my mate, Blackbaron. Although Blackbaron and myself average out at similar ratings, he always seems to be significantly ahead of me in games won.",
        "1... Nf6": "I always feel there's a certain amount of psychology in our opening play - no two openings in our game history are ever the same.........",
        "2. c4 e6 3. Nf3 d5": "......this one turns out to be just a standard Queen's pawn opening",
        "4. c5": "Keeping things tight for now",
        "4... b6": "Not the expected move from black here. Looks like an attempt to free up the black-diagonal bishop rather than a fiancetto for the white-diagonal bishop. ",
        "5. cxb6": "Accepting the swap starts to make black look weak on the Queenside",
        "5... axb6 6. a3": "Keeping the bishop's options limited",
        "6... Bd6 7. e3": "Need to start developing here - looking for a Queenside attack.",
        "7... O-O 8. Nc3 c5": "Castling Kingside enables this aggressive attacking move, but black's Queenside does look vulnerable.",
        "9. dxc5 bxc5 10. Be2": "A bit too negative I now think - Bb5 may have been a better attacking move at this point.",
        "10... Qc7": "Lining up a Queen-bishop combo - may mean a kingside castle for me is rather risky",
        "11. h3": "Preventing the knight from attacking h2 and f2 - should make castling a bit more comfortable.",
        "11... Nc6 12. O-O": "I am very under-developed at this point. Black has control of the centre and the ominous Queen-bishop line-up means I need to keep the knight on f3 in place.",
        "12... Ba6 13. Bxa6 Rxa6 14. Nb5 Qb8 15. Nxd6 Qxd6": "Still struggling to develop - the previously vulnerable looking queenside is now turning into a bit of an onslaught",
        "16. Qe2 Rb6 17. Rb1": "My past few moves have been nothing more than unsuccessful attempts at chasing away one or two of black's pieces and trying to carve out some kind of opening.......",
        "17... c4": ".....but it's still a very uncomfortable claustrophobic game as black continues to advance.",
        "18. Bd2 Rfb8 19. Bc3": "Adding defence to b2 which is becoming an important position, and also a very optimistic attack on the diagonal.....",
        "19... Ne4 20. Bd4 Nxd4": ".....quickly removed by The Baron in this exchange. ",
        "21. Nxd4": "However, it seems Baron has another trick planned!",
        "21... Nc3": "Forked! How did I miss that? Even if I take the knight with the pawn I'll still end up a rook down due to black's rook combo",
        "22. Qc2": "Electing not to take the knight to at least try and retain a better position",
        "22... Nxb1 23. Rxb1 g6": "So two points down, not many options to attack available, things are not looking good.",
        "24. a4 Ra8": "Really on the backfoot now as Blackbaron starts to move in for the kill....",
        "25. Nb5": "......when in doubt attack the queen",
        "25... Qd7 26. b3": "I try and stick to the rule of not swapping when down on points....",
        "26... cxb3 27. Qxb3": "....but at least here it gives a bit of room for manouvre. And lines up my queen and rook",
        "27... Rc8 28. a5": "Just trying to advance a little",
        "28... Ra6 29. Qb4 Rc4 30. Qa3": "Pegged back but trying to keep the pawn defended",
        "30... Qd8": "Now with black having two pieces attacking the pawn, the natural response would be Ra1. But this would then tie up my two remaining major pieces, and probably result in a pawn-fight on the kingside. As I would only have a knight to backup the pawns and Blackbaron would have a rook, it's a fight I'd lose.",
        "31. Nd4": "So I elect to sac the pawn and free up the b file",
        "31... Qxa5": "A Queen-swap would be great for black here - not so for me. But it appears in going forward a gap has been left in defence....",
        "32. Rb8+": "Speculative check....",
        "32... Kg7 33. Qf8+": "And in just two moves the whole momentum of the game reverses...",
        "33... Kf6": "I'm 3 points down now - black has 3 major pieces ready to attack my king. All I can do now is go for repetitive checks and hope.",
        "34. Qh8+ Ke7 35. Qf8+": "After a lot of analysis I decided on this as the move that limits black's options the most. Any other check would have allowed an escape to d6.",
        "35... Kf6": "Kd7 might have been better for black. With both the queen and a rook attacking c7, continuous checks might have been more difficult.",
        "36. Qh8+": "So I repeat the check from move 34. And at this point would have gladly accepted a threefold repetition draw.",
        "36... Kg5": "Moving into dangerous territory now - black's pawn structure is very weak on the black diagonals. If I can get a good pawn structure then I have a chance. But doing so could also leave me facing certain defeat should I fail to check black at any point.",
        "37. f4+ Kh6": "The only safe move for black. Kh5 would have resulted in Qxh7#",
        "38. Qf8+ Kh5 39. Qh8": "Now I knew I could get away with one check-free move, thanks to the g2 pawn",
        "39... Qe1+": "As expected",
        "40. Kh2 Kh6": "Again the only move that would prevent mate.",
        "41. Rg8": "This was the winning move - Blackbaron could not safely check me on his next move, so I knew this was game over.",
        "41... Ra1 42. Qg7+ Kh5 43. Qxh7#": "And Graeme sportingly allows me to play the final move in one of my most hard-fought victories ever. Cheers mate, I'm sure I'll pay for that win with many more defeats in the future."
    },
    "url": "https://gameknot.com/annotation.pl/boxing-day-revenge?gm=12717",
    "gameName": "Boxing Day Revenge",
    "players": "nemesis1010 (1444) vs. blackbaron (1459)",
    "opening": "Queen's pawn game (E10)"
}