{
    "moves": {
        "1. d4": "Hi all! Here is a casual OTB game against a friend of mine. As you can see, I am White, and I open with my usual Queen Pawn.",
        "1... d6": "I know, it's too early to jump to conclusions, but I already know that my opponent is about to play his new favourite opening - the Hippopotamus Defence, a very solid, flexible and sometimes aggressive hypermodern system. He made this discovery in a recent Daily Telegraph (UK) chess column by Malcolm Pein, entitled \"Try the Hippo on for Size\". He has already scored 2 victories over me with this opening. However, I believe I have found an effective way to test the Hippo to its fullest extent.",
        "2. e4": "Occupying the centre.",
        "2... b6": "The Hippopotamus is a very restrained opening, advancing pawns to a6, b6, d6, e6, g6 and h6, fianchettoing both bishops and developing the knights to d7 and e7. Black reserves the option to castle on either side, and has the possibility of leaping into the attack on either side when White commits himself by castling.",
        "3. d5 g6 4. c4 Nd7 5. f4": "THIS is my plan, developing as much of a central squeeze as I possibly can by forming a pawn formation just like that in the Four Pawns Attack of Alekhine's Defence. My own, personal maxim is that :::--- the greatest test for a Hypermodern opening is playing against Classical play.",
        "5... Bg7": "Fianchettoing the bishop. I don't like the powerful line it has against my b2-pawn and a1-rook, so...",
        "6. Nc3": "...I block the aforesaid line. The only problem is that Black can now clog up my pawnstructure with 6...Bxc3 7.bxc3.",
        "6... Bxc3+ 7. bxc3 Bb7": "I now believe that Black will have to castle queenside, as without the kingside fianchettoed bishop his kingside is dangerously exposed. ",
        "8. Nf3": "Reinforcing my weaker control on the dark squares. With regard to the light squares, my pawns occupy them and Black's bishop is banging his head on granite...or is it concrete?",
        "8... e6": "With a possible central pawn exchange, I hope to undouble my c-pawns.",
        "9. g3": "Aiming the develop the bishop on its most active square: h3.",
        "9... exd5 10. cxd5 Ne7": "The other knight is developed, however Black's control of all the centre is dangerously weak, thanks to my powerful pawns and his lack of a dark-squared bishop, which would have struck straight through my position.",
        "11. c4 c6 12. Bb2": "Fianchettoing the bishop with tempo.",
        "12... O-O": "(?) Black's main long-term error. One of the main ideas in the Hippopotamus is to reserve the option for a long time to castle on either side, and, quite apart from that, Black has castled right into a thunderstorm. How could anyone believe that the kingside, with my bishop raking through it, and no dark-squared bishop to cover the holes, is safe?",
        "13. Qd4": "So I set out to darken the clouds. Only one move (13...f6) saves my opponent from instant checkmate or material loss.",
        "13... f6 14. g4": "Setting off a PAWN STORM: if I can shift Black's f-pawn, his king will become a sitting duck.",
        "14... Kf7": "Rightly deciding that things were getting to hot for him on the kingside, Black decides to \"uncastle\" and flee back into the centre.",
        "15. h4": "I have a couple of free tempi while Black shuffles his king around. A perfect chance to bring more units into the attack. The tidal wave of pawns is about to drown Black's position.",
        "15... Ke8 16. h5": "I judged that this was the correct pawn break, better than 16.g5, and certainly superior to 16.f5. If 16...gxh5, 17.Rxh5 and my rook charges into the attack. If he ignores the pawn exchange threat, 17.hxg6 and if 17...Nxg6 18.Rxh7 and if 17...hxg6 18.Rh7 - in short, there's only one move that stops my rook from charging into the action...",
        "16... g5": "...that one. But that loses a pawn, and the kingside is completely cracked open.",
        "17. fxg5 fxg5 18. Nxg5": "The knight is threatening 19.Ne6, forking queen and rook, 19.Nxh7, and of course the queen can come charging in.",
        "18... c5": "Provocative. The queen must either retreat (?) or dive straight into the action:",
        "19. Qg7": "My inherent risky nature forbids a quick retreat. I checked all lines, err, quite thoroughly, and I saw no chance for the queen to be trapped.",
        "19... Rg8 20. Qh6 Nc8": "(??) Loses the rook on g8, and weakens overall position even more.",
        "21. Qe6+": "A fork, claiming Black's rook, unless Black particularly wants to be checkmated with 21...Kf8 22.Qf7#.",
        "21... Qe7 22. Qxg8+ Nf8 23. Nxh7": "At this point, my opponent triumphantly exclaimed, \"YOU'VE MADE A MISTAKE!!!\". He then went on to explain that 23.Ne6 would have clinched the game for me, while the text allowed him to equalise. Would I like to take that back, he asked? I said no straight off - I would never ever be able to claim a win in the game if I did, and, plus, I had examined the \"mistake\" and I had my own opinion about that...",
        "23... Qxe4+ 24. Be2 Qxh1+ 25. Kd2": "Definitely a \"MISTAKE\" but my opponent's, not mine. That queen cannot possibly get back to defend the knight, and so, my attack can now press home.",
        "25... Ne7": "(??) Loses the queen...if I had been in a mood to take it. I was prepared to ignore that for the moment, and use it as a fallback if my attack should slow.",
        "26. Nf6+": "A neat Zwischenzug (in-between-move) which is the only way White can immediately claim BOTH Black knights.",
        "26... Kd8 27. Qxf8+ Kc7 28. Qxe7+ Kb8": "Retreating into a corner. Now I just need to manoeuvre my queen and knight into a checkmating position...and did I mention my fallback of just taking the Black queen?",
        "29. Qd8+ Bc8 30. Qxd6+ Kb7 31. Qc6+ Kb8": "I could see no way of pressing my attack home. Then I had a brainwave...albeit a pretty simple one...bring in another piece!",
        "32. Be5#": "The Coup De Grace. I hope you all enjoyed looking at this game!"
    },
    "url": "https://gameknot.com/annotation.pl/breaking-the-hippos-back?gm=23039",
    "gameName": "Breaking the Hippo's Back",
    "players": "fatcat2 (58) vs. Friend (-)",
    "opening": "Queen's Pawn (A41)"
}