{
    "moves": {
        "1. b3": "Larsen scored some fine victories with this opening named Nimzowitsch-Larsen attack.",
        "1... e5": "White allows Black to occupy the centre which is hyper-modern opening.",
        "2. Bb2": "White starts his attack against Black's centre.",
        "2... Nc6 3. c4": "Theory suggests 3. e3 d5 followed by 4. Bb5 pinning the knight. ",
        "3... Nf6 4. Nf3": "4. Nf3 probably inviting the e5 pawn to advance to e4.",
        "4... e4 5. Nd4 Bc5": "Black's is ahead in development and is ready to castle.",
        "6. Nxc6 dxc6": "White saddles Black with doubled pawns on c-file. Now the e-pawn will be attacked. A typical hyper modern opening. White exchanged his developed knight and is behind in development.",
        "7. e3 Bf5 8. Qc2 Qe7": "The play revolves around the e4 pawn.",
        "9. Be2": "9. d4 would have captured the centre for White.",
        "9... O-O-O": "Black castles on the queen side to avoid an attack by the long range White bishop on b2. ",
        "10. f4": "White's opening strategy seems to be clear. His bishop on b2 is being supported by a strong pawn chain. Black cannot capture the f-pawn by en passant as the bishop is on f4.",
        "10... Ng4": "Black attacks the f2 square with his knight. Looks like a typical amateur play but Spassky was the World champion in 1970.",
        "11. g3 h5": "Black starts his attack.",
        "12. h3": "White tries to drive away the pesky knight.",
        "12... h4": "!! Black offers the knight. Spassky has devised a brilliant maneuvre to take advantage of the White king in the centre.",
        "13. hxg4": "Larsen, an aggressive player himself, spent 45 minutes before accepting the knight and probably could not see the maneuver planned by Spassky. ",
        "13... hxg3 14. Rg1 Rh1": "!!! This is the move which won the brilliancy prize. A second piece being offered. Can we see any attack after this?",
        "15. Rxh1 g2": "A tiny pawn is sufficient to bring White's game down.",
        "16. Rf1": "Larsen hopes for gxf1 but Spassky did not sac 2 pieces for nothing. 16. Rg1 may have been better but Larsen must have lost his cool by Spassky's audacious sacrifices.",
        "16... Qh4+ 17. Kd1 gxf1=Q+": "Larsen resigns as White is mated in 3 moves. Can we see the mate at least now? It is amazing that Larsen, a top flight grandmaster playing on top board, for World team should have collapsed in his own opening. So it is Ok if we lose our games in similar fashion, eh? "
    },
    "url": "https://gameknot.com/annotation.pl/brilliancy-prize?gm=34213",
    "gameName": "Brilliancy prize",
    "players": "Bent Larsen  vs. Boris Spassky ",
    "opening": "Nimzovich-Larsen attack (A01), modern variation"
}