{
    "moves": {
        "1. d4": "Reminder of the time limit - 40 moves in 90 minutes, plus 30 minutes if your time runs out before then, plus 30 second increment.",
        "1... Nf6": "Again I was late for the start - 18 minutes this time - because of road works on the A41 near Chester.",
        "2. c4": "So it starts conventionally enough.",
        "2... c5": "I was expecting this.",
        "3. d5": "I reply with the main line, heading for the Benoni group of openings. https://en.wikipedia.org/wiki/Benoni_Defense",
        "3... b5": "A slight surprise, as he had played e7-e5 earlier in the tournament. I did see he had played this, the Benko Gambit, before. https://en.wikipedia.org/wiki/Benko_Gambit",
        "4. f3": "Modern practice is to decline the gambit although this may not be the best way of declining it.",
        "4... e6": "He develops.",
        "5. e4": "This is the natural move.",
        "5... bxc4": "He takes.",
        "6. Bxc4": "Having lost time in arriving late, I played this quickly. My opponent pointed out afterwards that 6. Nc3 is more common.",
        "6... exd5": "He takes.",
        "7. exd5": "I recapture.",
        "7... d6": "He blocks the pawn.",
        "8. Nc3": "Normal development.",
        "8... Be7": "In many lines of the Benko the Bf8 goes to g7, but in this position I can throw in a queen check on e2 if he tries that.",
        "9. Nge2": "Normal development.",
        "9... O-O": "He castles.",
        "10. O-O": "I castle. Gouret, Thierry (2300) vs. Le Bourhis, Dominique (2050)  continued with O-O\n10.\tNg3\tRe8\n11.\tO-O\ta6\n12.\ta4\tNbd7\n13.\tRe1\tNe5 which I think is better than what he played. The Gameknot game wwgia (1745) vs. hbking (2023) continued with Nbd7\n11.\tNg3\tNe5\n12.\tb3\tQa5\n13.\tBb2\tNxc4\n14.\tbxc4\tBa6 which I think is also better.",
        "10... Na6": "Ganging up on the d pawn.",
        "11. Ng3": "The natural square for the knight. I can also gang up on his d pawn with a knight to e4 and bishop to f4. On this square I am also restricting the development of his Bc8. I think white is doing OK here.",
        "11... Nc7": "Continuing with his plan.",
        "12. Re1": "Again, the natural place to put the rook.",
        "12... a6": "Presumably to prevent my knight from going to b5 and maybe preparing to put his knight on b5 in some variations.",
        "13. Qd3": "Threat - Nf5.",
        "13... g6": "A somewhat drastic way of preventing Nf5. Black weakens his dark squares significantly. I should just play Bh6 here and double rooks on the e file and white is doing fine, or maybe Bg5, but....",
        "14. Rxe7": "I thought I was winning back enough material.",
        "14... Qxe7": "He takes back.",
        "15. Bg5": "With a horrible threat of Ne4.",
        "15... Qe5": "The only move.",
        "16. f4": "I protect my bishop and attack his queen.",
        "16... Qd4+": "When I sacrificed on e7 I considered 15...Qe5 and thought that 16. f4 won. I hadn't seen this queen check.",
        "17. Qxd4": "So I take.",
        "17... cxd4": "He takes back.",
        "18. Bxf6": "I take his knight.",
        "18... dxc3": "He takes my knight.",
        "19. Bxc3": "I take back. A pawn for the exchange is not really enough, although converting it can be a problem.",
        "19... Bb7": "This is a mistake. He should have played f5, keeping my knight out of his position.",
        "20. Ne4": "Now if he takes on d4 I have a fork on f6 winning a piece. Plus 21. Nf6+ is a nasty threat.",
        "20... Ne8": "He protects d6 and f6.",
        "21. Bb3": "With the idea of Rd1 and Bh4 attacking his knight with is protecting d6.",
        "21... f5": "Hitting my knight.",
        "22. Ng5": "Knight advances.",
        "22... h6": "hits the knight again.",
        "23. Ne6": "Knight jumps in again.",
        "23... Rf7": "And his rook is sort of developed along the rank.",
        "24. Bb4": "Attacking d6, again with the plan of Ba4 and Rd1, but it is too slow.",
        "24... a5": "I hadn't expected this, but it looks good.",
        "25. Ba3": "Bishop retreats.",
        "25... a4": "He advances again.",
        "26. Bc4": "I have to keep on the d pawn.",
        "26... Ba6": "being material up, he wants to exchange pieces.",
        "27. Bxa6": "I take.",
        "27... Rxa6": "He recaptures.",
        "28. Rc1": "I seize the c file, threatening Rc8",
        "28... Ra8": "So he stops this.",
        "29. Rc6": "I offered a draw here, he declined.",
        "29... Rd7": "He protects d6.",
        "30. Kf2": "I start to develop my king.",
        "30... Ra5": "He attacks d5.",
        "31. Rc8": "Attacking the knight.",
        "31... Kf7": "He protects.",
        "32. Nd8+": "I check.",
        "32... Kf8": "Not 32..... Ke7?? 33. Nc6+ winning! Now if I check again on e6 he just moves his king to e7 and I have run out of checks.",
        "33. Nc6": "So I played this.",
        "33... Rxd5": "He takes.",
        "34. Ra8": "I attack the a pawn.",
        "34... Rc7": "He hits my knight.",
        "35. Nb4": "I hit his rook.",
        "35... Rd2+": "He checks.",
        "36. Ke3": "Another mistake by me. Simply Kf3, I am picking up his a pawn, and I am still in the game. This is the losing mistake.",
        "36... Rxg2": "He takes.",
        "37. Nd5": "I hit his rook.",
        "37... Rd7": "He defends d6. Now when I played Ke3 I though that 38. Nf6 won. 38....Re7 is forced. I thought that after 39. Kf3 I was threatening both the rook on g2 and the pawn on d6, but he has Rd2 saving the rook and protecting d6.",
        "38. Nc7": "So I tried this, with a similar threat. If 38....Rxc7 39. Bxd6+ although even there he has Rd7 winning.",
        "38... Re7+": "But he chose this way to win.",
        "39. Kd3": "I stop his Rg2 from protecting the d pawn.",
        "39... Kf7": "But this simple move wins easily.",
        "40. Nd5": "I hit his rook.",
        "40... Re4": "I am just the exchange and a pawn down. I played it out, but really it is hopeless now. Further comment is unnecessary.",
        "41. Ra7+ Ke6 42. Nc3 Rxf4 43. Nxa4 Rxh2 44. Nc3 Rh3+ 45. Kc2 Rc4 46. Kb3 Rc6 47. Bb4 f4 48. Ka4 Nc7 49. Ne2 Ke5 50. Ra5+ Ke4 51. Bd2 Rc4+ 52. b4 Rc2": "He threatens mate on a2 and my bishop, so I resigned. Many thanks for reading please leave a comment or two and rate it on the star system to let me know how I am doing with my annotations. Until next time dear reader!"
    },
    "url": "https://gameknot.com/annotation.pl/british-over-50s-round-6?gm=63356",
    "gameName": "British Over 50s Round 6",
    "players": "Charles L Higgie (1918) vs. Gareth Morris (2062)",
    "opening": "Benko gambit (A57)"
}