{
    "moves": {
        "1. c4": "So he started with The English.",
        "1... e5": "I decided to play a Closed Sicilian reversed.",
        "2. Nc3": "Normal development.",
        "2... Nc6": "Me too.",
        "3. Nf3": "The natural square for the knight.",
        "3... f5": "A more aggressive move than Nf6.",
        "4. d4": "He rightly challenges my pawn centre.",
        "4... e4": "So I advance.",
        "5. Ng5": "He advances the knight.",
        "5... Be7": "I hit the knight.",
        "6. h4": "He protects.",
        "6... h6": "I go after the h pawn. This plan is over-ambitious. Probably simple development with Nf6 was best.",
        "7. Nh3": "The only square for the knight.",
        "7... Bxh4": "The logical follow-up to my last move, but probably a mistake. My computer likes the bizarre looking 7....Rh7 here.",
        "8. e3": "As well as helping his development, this threatens a rather nasty check on h5.",
        "8... g6": "So I stop that.",
        "9. Nf4": "Now he threatens the pawn on g6.",
        "9... Kf7": "So I protect it. My computer now likes 10. g4 d6 11.\tgxf5\tBxf5 12. Qb3 Na5 13. Qa4 Nc6 14. Qb3 with a draw!",
        "10. c5": "But this move looks stronger, with a terrible threat of Bf1-c4+.",
        "10... Bg5": "This is a tactical mistake. OK stop and find the best continuation for white!",
        "11. Bc4+": "The first move is rather obvious.",
        "11... Kg7": "The king stays on the g pawn. Find white's best now!",
        "12. Nxg6": "Did you find it? if Kxg6 13. Qh5+ and white mates black with 14. Qf7.",
        "12... Na5": "I played this, hoping to get the two bishops as compensation for losing the pawn back. In fact it contains a tactical error. Again, what would you play as white?",
        "13. Bxg8": "White should have played 13.\tNxh8\tNxc4 14. Nf7 Kxf7 15. Qb3, getting a knight back to remain an exchange up. Thankfully he didn't go for that.",
        "13... Rxg8": "So I save the exchange.",
        "14. Nf4": "And his knight retreats.",
        "14... d6": "I try to open up the position for my two bishops, and also complete by queen side development.",
        "15. b4": "He hits the knight.",
        "15... Nc6": "The knight retreats.",
        "16. Qb3": "He protects the b4 pawn. OK, find black's best move now.",
        "16... Bxf4": "I exchange.",
        "17. exf4": "He takes back.",
        "17... Nxd4": "But now his d4 pawn drops.",
        "18. Qd1": "The queen retreats.",
        "18... dxc5": "I open up the d file, so now the knight on d4 is protected twice - by both the pawn on c5 and my queen on d8.",
        "19. bxc5": "He takes back.",
        "19... b6": "I want him to exchange on b6 for two reasons. I will take back with the a pawn, to open the a file for my rook on a8 and also I hope to play c7-c5 to protect d4.",
        "20. cxb6": "He obliges.",
        "20... axb6": "I take back.",
        "21. Bb2": "He has nasty threats along the a1-h8 diagonal.",
        "21... Kh7": "I move my king off that diagonal.",
        "22. Qh5": "But now he threatens Qxh6 mate! My computer prefers 27.Nc3xe4! instead, which seems to win back the pawn, although it is extraordinarily complicated and there are some lovely lines, for instance 22. Nxe4 Rxg2 23. Rxh6+! Kxh6 24. Bg7+ followed by 25. Qxd8 I think then black can pick up the other white rook with Rg8+ and Rxa1, but then the white queen can force perpetual check - but I am not sure at all, there may be improvements for either side.",
        "22... Nc2+": "Played after a long think. I want to force his king to f8, so I can check on a6 with my bishop and then maybe block the d file with my bishop to d3 if necessary.",
        "23. Kf1": "Of course not 23.\tKe2 Qd3#\n",
        "23... Ba6+": "So the check comes in.",
        "24. Kg1": "King runs again.",
        "24... Qf8": "And my queen protects h6 and f5.",
        "25. Rc1": "He hits my knight.",
        "25... Bd3": "I protect it.",
        "26. Nd5": "Now his knight comes in with the threat of a horrible check on f6.",
        "26... Rg6": "So I protect it.",
        "27. Nxc7": "He takes a pawn and attacks my rook.",
        "27... Rxa2": "And I get my pawn back and attack his bishop.",
        "28. Be5": "He moves his bishop to a safer square. OK, stop and work out black's best move.",
        "28... Ne3": "Did you find it? Of course, if he takes the knight I mate him on g2 with my rook. I am also threatening Rxg2 mate anyway.",
        "29. g3": "So he prevents that. OK work out black's best move now.",
        "29... Rxg3+": "Did you get it? Of course, if he takes my rook, my other rook goes to g2 with mate again.",
        "30. Kh2": "So he plays the only other move.",
        "30... Rg2+": "I check him again, to get my rook off prise.",
        "31. Kh3": "Forced!",
        "31... Raxf2": "and now I am about to win his queen with Rf3+",
        "32. Ne6": "but he plays this, so if I win his queen, he wins mine with check! I also need to block Rc1-c7+ which is very nasty.",
        "32... Qe7": "So I block that.",
        "33. Rc7": "Rook comes in anyway.",
        "33... Qxc7": "I take.",
        "34. Nxc7": "He takes back.",
        "34... Rf3+": "I throw in that check.",
        "35. Kh4": "he moves his king.",
        "35... Rg4+": "I play the other check",
        "36. Qxg4": "He is forced to take.",
        "36... fxg4": "And, with two clear pawns down, and all by pieces still on active squares, my opponent throws in the towel. We won the match 3-2, winning the top three boards, and losing the bottom three, as expected.\n\nMany thanks for reading, please comment and rate this on the star system. Until next time dear reader!"
    },
    "url": "https://gameknot.com/annotation.pl/buckley-mold-v-malpas-whitchurch?gm=60580",
    "gameName": "Buckley - Mold v Malpas & Whitchurch",
    "players": "Dave Aldridge (ECF143) vs. Charles L Higgie (ECF 177)",
    "opening": "English (A27), three knights system"
}