{
    "moves": {
        "1. d4": "I've been exploring some Gambit's lately and playing them in blitz games here and on ICC, not sure about the advisability of playing them during a longer time constraint as that gives the opponent enough time to respond with the best move, catch up in development, and hold advantage until the endgame. This game was played on Gameknot. ",
        "1... Nf6 2. c4 e5 3. dxe5": "I think that my opponent was not extremely familiar with the Budapest as he spent a lot of time in almost all subsequent moves. ",
        "3... Ng4": "3... Ne4 is also an interesting move. With Ng4 black intends to regain the pawn, but Ne4 intends fierce battle.",
        "4. Nf3 Bc5": "A clear threat on f2. 5. e3 is pretty much forced and the black bishop has a harder time getting developed. In addition to speeding his development with the gambit black also inhibits White's development. ",
        "5. e3 Nc6": "White cannot save the e5 pawn, the only try Qd5 fails to Qe7. ",
        "6. Qd5 Qe7 7. Nc3 Ngxe5 8. Nxe5 Nxe5 9. Nb5 Bb6 10. f4 c6 11. Qxe5 Qxe5 12. fxe5 cxb5 13. cxb5": "Down a pawn but white is doubled. Black will also regain the pawn as white cannot protect both e3 and e5 before black castles and plays Re8. ",
        "13... O-O 14. Bc4 Re8 15. Ke2 Rxe5 16. Bd2": "Only now is the bishop being developed. ",
        "16... d5": "I expected Bd3 which I would answer with Bg4  followed by either Rf5  or Re8 intending the pawn on e3. ",
        "17. Bc3": "This was the only move played by my opponent that was played quickly. They were running low on time and it was merely an oversight. ",
        "17... Rxe3+": "White's position is wrecked as they did not castle, and they are destined to lose the Bishop on c4 as well. White resigns. "
    },
    "url": "https://gameknot.com/annotation.pl/budapest-against-higher-rated?gm=16222",
    "gameName": "Budapest against higher rated",
    "players": "Porti (1847) vs. Concordborn (1466)",
    "opening": "Budapest (A52), Adler variation"
}