{
    "moves": {
        "1. d4 Nf6": "OK, really, my sixth straight annotated game as black. At least this time I'm not playing the Sicilian again. Somethiing fresh, the Indian system for a change.",
        "2. Nf3 c5": "I'm not sure where white is going with this opening. Generally speaking, 2. c4 seems unanimously recommended after 1. ... nf6. Perhapes white is aiming for a Colle system. Black's response, 2. ... c5 steers into Benoni waters.",
        "3. Nc3 cxd4": "White could have played 3. c4 to transpose into the Englsh, or 3. d5 to continue with the standard Benoni lines. 3. Nc3 is not found in any of my references, so here we're deviating already from any reference I know, though the GK DB still has some advice.",
        "4. Nxd4 Nc6 5. e4 d6": "I am way out of my league here, running blindly through this opening. This move seems to come from the GK DB, but if I were choosing on my own, I might have gone with 5. e5, or even played that a move earlier when white wouldn't have had 5. Nxc6 in response to 4. ... e5. But, there's probably some trap or other valid reason why the line black is playing is better, though I admit I don't see it myself. I've just about forced myself into a \"small center\" and restricted play, but then, that can be a common result of the Indian openings.",
        "6. Bg5 Qb6": "Forking the knight on d4 and the pawn on b2. The natural 7. Nxc6? seems playable but it loses material for white after 7. ... Qxb2 with the threat of 8. ... Qxc3+ gaining a tempo with the check and ending up a pawn ahead.",
        "7. Nb3 e6 8. Be2 Be7 9. Qd2 O-O": "Just ordinary developing moves. Or so I thought. I completely missed white's next moves. Nothing like throwing away a pawn right in the opening. Let's just call this a gambit...",
        "10. Bxf6 Bxf6 11. Qxd6 Rd8 12. Qg3 a5 13. a4 Be5 14. Qh3 Nb4": "So far, my sneaky gambit has gained me a bit of an attack, and has driven the white queen to the far edge of the board.",
        "15. Rc1 Bf4": "And now I regain the lost pawn and equalize material. ",
        "16. O-O e5": "Oho, white prefers to lose the exchange rather than lose a pawn. But first, a zwischenzug, gaining a stronger presence in the center with a tempo by discovering an attack against white's queen.",
        "17. Qf3 Qh6": "I originally played this for the wrong reason. The threat of mate on h2 forces white to respond, leaving the white rook on c1 en prise. But in my head, moving too quickly, I thought this would gain the rook, thinking black would play 18. ... Bxc1 and white couldn't reply 19. Rxc1 because of 19. ... Qxc1. Somehow, I dismissed the white knight on b3 entirely in my too-hasty analysis of the position. Fortunately for me, this oversight didn't cost black the opportunity to win the exchange as originally planned.",
        "18. g3 Bxc1 19. Rxc1 Be6": "Threatening to remove the knight, the only defender of the white rook on c1, allowing black's queen to capture that rook. Tough choices for white. Moving the rook loses the pawn the rook is defending. But he has little choice.",
        "20. Rb1 Nxc2": "Black has regained his \"gambit\" pawn and is ahead by the exchange. Not bad for blundering through this opening like a bull in a china shop. Now the white knight on b3 is en prise.",
        "21. Nc5 Nd4": "White forked the black bishop on e6 an the pawn on b7. The bishop is safe enough, white won't even double black's pawns with that capture, but the black pawn might need some saving. But first, let's chase white's queen around and see about exchanging a little material.",
        "22. Qh1 Nxe2+": "Wow, Qh1? seems a bit extreme, maybe even extreme enough for a question mark. Not much she can do from way back there. If white had a crystal ball, he might have kept the queen a little more centralized, say with 22. Qd3. Sure, that gives black a possible discovered attack, but I don't see that black can do any damage with it.",
        "23. Nxe2 Bg4": "Let's hang onto this bishop for a while. Besides, black is being tricky.",
        "24. Nc3 Qb6": "Saving the pawn on b7 and threatening the knight on c5. Let's see, where will white go? A4 is busy, and so is e4. d3, b3, a6, d7, and e6 are are all just suicide. That leaves b7, still suicide, but at least trading for a pawn. The best move the knight has. So since it can't move, let's look for defenders. Only one, and 25. b4 is handled nicely by 25. ... axb4 putting both white knights en prise, and even though it then allows the knight on c5 to safely retreat to b3, black then simply plays 26. ... bxc3 and has gained knight and pawn. So, white's best option is really 25. Nxb7, losing knight for pawn and ending up behind in material by the margin of rook for pawn. If only white's queen were just a little more centralized, she might come to the rescue.",
        "25. h3 Bc8": "Rather than save the knight, white proposes an exchange. However, black has just one move that saves the bishop and still leaves the white knight in the same dire straits. Rather than play on with his material deficit, white chooses to resign."
    },
    "url": "https://gameknot.com/annotation.pl/bull-in-a-china-shop?gm=23643",
    "gameName": "Bull in a China Shop",
    "players": "centerctrl (1841) vs. blake84120 (1967)",
    "opening": "Queen's pawn game (A46)"
}