{
    "moves": {
        "1. d4 Nf6 2. c4 e6 3. Nf3 b6": "From this position, I have seen the Stockfish and Houdini chess engines alternately recommend 4. a3 and 4. Nc3. Oddly enough, the computer programs don't always recommend the same move here, maybe because they consider both moves to be about the same. However, Stockfish on a really deep 31 ply search evaluates a3 as the best with a score of 0.14 pawns, g3 second with a score of 0.11 pawns, and Nc3 (and Bf4) third with just a score of 0.05 pawns.\n",
        "4. g3 Bb4+": "4... Bb7 5. Bg2 Be7  is only barely favorable to white.\n",
        "5. Nbd2": "According to Grandmaster Williams, this move is becoming popular, and I admire how positional it is, but the computers don't like it because they think that the game is equal. Instead. the computers think Bd2 gives White a tiny advantage.\n\nAlternative variation: 5. Bd2 Bxd2+ 6. Qxd2 and now if Ne4? chases the queen where it wants to go. 7. Qc2 Bb7 8. Bg2 with a slight advantage for white.\n",
        "5... Bb7 6. Bg2 O-O 7. O-O": "Now 7... a5 8. b3 is equal.",
        "7... Be7": "\n",
        "8. d5": "According to the computer, this gambit favors black slightly, but it does give white some interesting counter play. According to a video by Williams, this type of gambit is more common with the knight on c3.\n\nAlternative variation: 8. b3 d5 9. Bb2 iis only miniscule better for white.\n",
        "8... exd5 9. Nh4 g6 10. cxd5": "Now 10... Bxd5 11. e4 Bc6 12. e5 Nd5 (12... Ne8! slightly favors black.) 13. Nc4 Nb4 14. Bh6 is miniscule better for white.\n",
        "10... Nxd5 11. Ne4": "Prepares to meet Bxh4 12. gxh4 Qxh4 with 13. Bg5.\n\nAlternative variation: 11. Nc4  lets white equalize despite being a pawn down. c6 (11... Bxh4 is losing. 12. gxh4 Qxh4 13. Bxd5 Bxd5 14. Qxd5 c6 15. Qd3) 12. e4 b5 13. exd5 bxc4 14. Bh6 Re8 15. Nf3 cxd5 16. Ne5\n",
        "11... Re8": "If instead 11... Bxh4 12. gxh4 Qxh4 13. Bg5 Qh5?! ( 13... Qg4 is better.) 14. Qxd5 (14. Qd2 is slightly better.) 14... Bxd5 15. Nf6+ Kh8 16. Nxh5 Bxg2 17. Bf6+ Kg8 18. Kxg2 gxh5 19. Rac1 which is barely favorable to white.\n\nAlternative variation: 11... Na6 and black is clearly better. After 12. b3 Bxh4? lets white back into the game. 13. gxh4 Qxh4 14. Bg5 Qg4 [Equal.] ( 14... Qh5? 15. Qxd5 and white is winning.)\n",
        "12. b4": "This is an unsound gambit. \nAlternative variation: 12. f4 Bxh4 13. gxh4 Qxh4 14. Qd4 c5 15. Qf2 Qxf2+ 16. Kxf2 Na6 17. Nd6 Bc6 18. Nxe8 Rxe8 and the endgame favors black.\n",
        "12... Bxh4": "Now best is 12... Nxb4  GM Williams said that he wasn't afraid of this move, but it appears that after this white is losing. 13. Bb2 Bxe4 14. Bxe4 N8c6",
        "13. gxh4 Qxh4": "Here  14. Bg5 is not the best. Qg4.  Then 15. Qxd5?? fails tactically Qxg2+ 16. Kxg2 Bxd5 17. f3 Bxe4 18. fxe4 Rxe4",
        "14. Qd4": "\n",
        "14... Rxe4 15. Qxe4 Qxe4 16. Bxe4 Na6": "Inaccurate.\n\nThe strangely tactical 16... Bc6 17. b5 Nc3 18. bxc6 Nxe4 is closer to equality.",
        "17. a3 Re8 18. Bf3 c6 19. Bxd5": "The idea is to leave black with a weakness in the center, that could work well in the endgame.\n\nThe prefered computer line is 19. Rd1 f5 20. Bb2\n",
        "19... cxd5 20. Bf4": "White is intent on stopping that knight from getting back into the game. He thinks incorrectly that Rxe2 21. Rfe1 will favor him.\n\n20. Re1 Nc7 21. Bb2 and white maintains a small edge.\n",
        "20... f6": "Instead 20... Rxe2 21. Rfe1 Re6 is equal.\n",
        "21. Rac1": "White can do slightly better with Rfe1. Now the game is technically equal.\n",
        "21... g5": "Best is 21... Rxe2 22. Rfe1 and now Re4 is just a little favorable for white.  Otherwise 22. ... Rxe1+ 23. Rxe1 Kf7 24. Bd6 is better for white. Bc6 25. Re7+ Kg8 26. Kg2 d4+? 27. Kf1 Bb5+ 28. Ke1 and white is winning.",
        "22. Be3": "The bishop has done its job on f4, so now it can save the e pawn.\n",
        "22... Bc6 23. Bd4 Kf7 24. e3 Nc7": "Trying to activate the knight.  Walks into a pin.\n",
        "25. a4 b5 26. a5": "The only good choice here.\n",
        "26... a6 27. f4 g4 28. f5 Re4": "It makes no sense to bury the rook here. Rc8 is better.\n",
        "29. Rf2": "White's plan is to breakthrough with Rfc2 and Rxc6.\n",
        "29... h5": "Re8 is a little better.\n",
        "30. Rfc2 Ne8": "Ke7 is a little better.\n",
        "31. Rc2xc6 dxc6 32. Rxc6 Re7 33. Rxa6 Rc7 34. Bc5": "By all means prevent black from getting counter play.\n",
        "34... Ng7": "The knight tries to get back into the game.\n",
        "35. Rb6 Nxf5 36. a6 Ne7 37. Rxb5": "You know that white is winning with those two connected passed paws on the kingside.\n",
        "37... Nc6 38. Rb6": "Now best is 38... h4 39. Rb7 Rxb7 40. axb7 Nb8 41. Ba7 Nd7  42. b8=Q [ b5 is a good alternative.] Nxb8 43. Bxb8 which takes a little longer to die.\n",
        "38... Ke8 39. b5 Ne5": "Instead 39... Nd8 40. Bd4 Kd7 41. Rxf6 puts up minuscule more resistance. ",
        "40. a7": "Now Rxa7 41. Rb8+ (Of course not 41. Re6+ Kf7)\n"
    },
    "url": "https://gameknot.com/annotation.pl/bunrattcy-chess-tournament?gm=60907",
    "gameName": "bunrattcy chess tournament, ?",
    "players": "GM Simon Williams  vs. GM Peter Wells ",
    "opening": "Queen's Indian (E15), 4.g3"
}