{
    "moves": {
        "1. d4": "ottawars requested an in-team match for training purposes.  This annotation is the review of the game.",
        "1... d5 2. c4 e6 3. Nc3 Nf6 4. cxd5": "Queen's Gambit Declined (D35), exchange variation",
        "4... exd5 5. Bg5": "To put pressure on the knight and pin against the queen.",
        "5... Be7": "Best response.",
        "6. e3": "to continue development and prepare for a kingside castle.",
        "6... O-O 7. Bd3 Nbd7": "Still book at this point.",
        "8. Nge2": "Preparing the castle.",
        "8... b6 9. O-O Bb7 10. Qc2": "to threaten the h7 pawn.",
        "10... Rc8": "an alternate move, perhaps better, would be h6, to chase away my pesky bishop.",
        "11. Rad1": "Rather than bring over my rook to d1, going aggressive with the knight to b5 would likely yield a pawn to white, on either a7 or c7, whichever black decided to give up.  Sadly I did not see this move.",
        "11... c5": "Natural development.",
        "12. dxc5 bxc5 13. Bf5": "Putting some more pressure on black with the double bishop threat, effectively pinning the knight against the rook.",
        "13... h6": "Too little too late.",
        "14. Bxf6 Bxf6": "The idea here is that if Nxf6, then I can take his rook with my bishop.  One of the things that I am still working on in my own game is not dismissing ideas that initially seem bad without fully exploring them.  If Nxf6 instead, then \n\n15.\tBxc8\tQxc8\n\nand you're only down a rook for a bishop.  Not great, but better than being down a whole piece.",
        "15. Nxd5": "Adding pressure and winning a pawn.",
        "15... Bxd5": "This move is a real mistake, because it allows a more serious pin.  \n\n\n15.\t...\tNb6\n16.\tBxc8\tNxc8\n17.\tNef4\t\n\nis a better sequence, as you lose less material.",
        "16. Rxd5 Rc7": "To protect the knight a little longer.",
        "17. Rxd7": "Blunder on white's part.  Instead the proper move is Rfd1, to continue the 3-way pin and win the knight.  Instead of a piece, I settle for a pawn.  tsk tsk.",
        "17... Rxd7 18. Bxd7 Qxd7 19. Qxc5 Rd8": "I was expecting Bxb2.",
        "20. Nc3 Rc8 21. Qa5 Qb7 22. Qb5 Rb8": "Probably not in black's interest to allow a queen trade at this time.",
        "23. Qxb7 Rxb7 24. Na4 Rc7 25. g3": "to free up my rook for defense.",
        "25... Rc2 26. Rb1 Kf8": "Not certain what black was planning on at this point, perhaps bringing his king across the board?",
        "27. a3 Ke8 28. b4": "To get rid of the bishop on the pawn issue and allow my rook freedom to move around.",
        "28... Ra2": "still going after the pawns, looking for any chance to re-equalize.",
        "29. Rb3": "Only possible because of 25. g3",
        "29... Be7 30. Nc5 a5 31. Nd3": "This move was a mistake as it would allow \n31.\t...\ta4\n32.\tRc3\tBf6\n33.\tRc8+\tKe7\n34.\tNc5\tRxa3\n\nthe better move was Ne4",
        "31... axb4": "Luckily for white, black played this move instead.",
        "32. axb4": "unblocked pawn spells trouble for black.",
        "32... Ra4 33. Kg2": "what progresses from here is the slow pawn march of death for black.",
        "33... Bd6 34. h4 h5 35. Kf3 g6 36. g4 hxg4+ 37. Kxg4 Be7 38. f4 Kf8 39. h5 gxh5+ 40. Kxh5 Kg7 41. Kg4 f6 42. Kf5 Kf7 43. e4 Bd6 44. e5 fxe5 45. fxe5 Be7 46. b5 Ra8": "now there are 2 passed pawns marching deeper into Black's territory and unless white makes a mistake, it will spell game over soon.",
        "47. e6+ Kg7 48. b6 Bd6 49. Ne5": "And here it is, black's great chance.  This move was ill advised and I have no excuse.  No matter how good your opponent, they will make mistakes eventually.  Always stay in the game to see if you can equalize.  Only resign when it is inevitable.",
        "49... Ra5": "The great pin, forcing my rook to get into the game of defense.",
        "50. Rg3+": "This move is ultimately a mistake, b/c it can encourage black to get a free move of his king over towards that remaining pawn.",
        "50... Kf8 51. Re3 Rb5": "It would have been better to bring black's king down to e7.  Instead by abdicating this position, black has allowed white's king to block him out.  Not a good idea.",
        "52. Kf6 Bxe5+": "This exchange is a major blunder on black's part and when combined with the failure to move the king up is ultimately what cost black the game.",
        "53. Rxe5 Rxb6 54. Rc5": "Threatening Rc8#",
        "54... Rb8 55. Rh5": "Again threatening Rh#",
        "55... Kg8 56. Rg5+": "Threatening a rook giveaway if Kf8",
        "56... Kh7": "Now the end is in sight.",
        "57. e7 Rb6+ 58. Kf7 Kh6 59. Rg1": "I should have promoted to the queen here, and ended up my king/queen vs his king, but for some reason I liked rook/king vs king better...",
        "59... Rb7 60. Kf8": "Both sides made mistakes.  More careful planning can lead to better end results for both sides."
    },
    "url": "https://gameknot.com/annotation.pl/burninators-training-match?gm=44454",
    "gameName": "Burninators Training match",
    "players": "evilgm (1746) vs. ottawars (1490)",
    "opening": "QGD (D35), exchange, chameleon variation"
}