{
    "moves": {
        "1. e4": "Hi everyone, I would like to tell you about my best ever Chess Congress.  I played in the U1400 section in the Bury St Edmunds Congress, England.  There were 5 rounds and these lasted two days.  As it was well within driving distance I did not have an overnight stay in Bury.  This is the first of the five games.  Hope you enjoy.  Joanne",
        "1... c5 2. Nf3 d6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 g6": "5. ............... g6 - the start of the Sicilian Dragon.",
        "6. Bd3 Bg7 7. Be3 O-O 8. O-O Nc6 9. Nxc6 bxc6": "9. .................... bxc6 - I often used to exchange knights here - this has brought me mixed results as you will see in my other two games in this congress with the Sicilian.",
        "10. Kh1": "10. Kh1 - Henry sidestepps any queen checks on b6 should Frere Lenoir move off the g1 - a7 diagonal.",
        "10... Ng4 11. Bd2 Bd4": "11. .................... Bd4 - ganging up on the f2 pawn, eh?  Nasty, nasty.",
        "12. Qe1": "12. Qe1 - enter, Glenda the Defender!  Now what's in her in-tray today?  Defend f2 pawn!",
        "12... Qb6": "12. ............ Qb6 - sssss!  The Wicked Witch of the West appears on b6 and she is piling up on the f pawn and attacking my b2 pawn.  My next move Nd1 appears to defend both.",
        "13. Nd1 Be6 14. c3 Be5 15. f4": "15. f4 - screens off the enemy dsb's line to h2 and it retreats to g7.",
        "15... Bg7 16. Be3 Nxe3 17. Qxe3 Qc7": "17. ............. Qc7 - refusing to trade queens - black still thinks he has an attack.",
        "18. Rf2 f5 19. exf5 Bxf5 20. Bxf5 Rxf5": "20. ............... Rxf5 - a plethora of exchanges have taken place on f5 relieving the pressure on my position.",
        "21. Qc1 Bh6 22. g3 d5 23. Ne3": "23. Ne3 - activating my knight and attacking the black rook on f5.",
        "23... Rh5 24. Ng4 Bg7": "24. .............. Bg7 - wants to preserve his dsb.",
        "25. Kg1 Rf8 26. Qc2 c5 27. Rd1 d4 28. cxd4 c4": "28. .................. c4 - the pawn on d4 cannot be taken because the c pawn is pinned to the Wicked Witch on c7.",
        "29. Ne3 Rc8 30. Rfd2 Qb6 31. Nxc4": "31. Nxc4 - the black c pawn drops.",
        "31... Qe6 32. b3 Rd5 33. Qb1": "33. Qb1 - Glenda releases my knight from the pin by the black rook on c8.",
        "33... Rcd8 34. Ne5 Qb6 35. Qa1 Rxe5 36. fxe5 Bxe5 37. Kf1": "37. Kf1 - after an interesting exchange sacrifice Henry moves out of the pin so I am now threatening to take on e5.",
        "37... Bf6 38. Ke1": "38. Ke1 - after black's dsb retreats to f6 Henry moves to e1 to bolster the rooks on the d file.",
        "38... Qb4 39. a3 Qxb3 40. Qb1 Qxa3 41. Qa2+ Qxa2 42. Rxa2": "42. Rxa2 - here I give back a couple of pawns to simplify down to an endgame.  I am getting short of time on my clock.  I have made it to the time control but I have only the minimum time left, 15 minutes.  I think I have sped up a bit since then but I used to get into time trouble a lot in my early games.",
        "42... Bxd4 43. Rxa7": "43. Rxa7 - this capture is feasible because the dsb is pinned to the black rook.  I would therefore remain the exchange for a pawn up.",
        "43... Bc3+ 44. Ke2 Rxd1 45. Kxd1": "45. Kxd1 - simplifies further but my clock is ticking down.",
        "45... Bf6 46. Ke2 h5 47. Kd3 g5 48. h3 Kf7 49. g4 hxg4": "49. hxg4 - here, as I had less than 10 minutes left on my clock I accepted my opponent's offer of a draw.  Given that my opponent's rating was more than 100 points in front of me this was not a bad start.  Over the next two games it gets better."
    },
    "url": "https://gameknot.com/annotation.pl/bury-congress-u1400-round-1?gm=17883",
    "gameName": "Bury Congress U1400, Round 1",
    "players": "Joanne Stevens (1240) vs. Joseph Schutz (1392)",
    "opening": "Sicilian (B70), dragon variation"
}