{
    "moves": {
        "1. e4": "Hi everyone!\n\nMany years ago I played an OTB game for Cambridge City Chess Club against Brandon, King's Gambit Chess Club.  It was a home match.  I had played Kevin in a few previous matches, one where I was in an ending of opposite colour bishops and I lost because I overlooked a removal of the guard combo, another where I learned my lesson and did not fall for that trick twice and went on to draw.  Here the opposite bishop scenario did not occur and the position appeared to be even right to the endgame where he made one slip up and it cost him dear.  Here is how it all happened ....",
        "1... d5": "1. ..... d5 - it all started with the Scandinavian (Centre Counter) Defense which is quite playable although the Wicked Witch of the West can get chased around quite a bit!",
        "2. exd5 Qxd5 3. Nc3": "3. Nc3 - Like this.",
        "3... Qa5 4. d4 c6 5. Bd2": "5. Bd2 - Fou Lenoir prepares a fairly standard battery against the Witch.",
        "5... Nf6 6. Nf3": "6. Nf3 - development.",
        "6... Bg4 7. Be2": "7. Be2 - development and pin-breaker.",
        "7... Nbd7 8. Ne4": "8. Ne4 - battery unmasked and hoping for NxN, BxQ - but Kevin does not fall for it.",
        "8... Qc7 9. Nxf6+ Nxf6": "9. ..... Nxf6 - knight trade.",
        "10. Ne5 Bxe2 11. Qxe2": "11. Qxe2 - bishop trade.",
        "11... e6 12. c3 Bd6 13. Bf4": "13. Bf4 - a lotta tension along the h2-b8 diagonal.",
        "13... O-O-O 14. Bg3 h5 15. Nf3": "15. Nf3 - this move leads to a trade of dsbs.",
        "15... Bxg3 16. hxg3 Qa5 17. Qc2 Nd7 18. Qb3": "18. Qb3 - 18 moves and I still haven't castled and the queens are on the board, tut, tut Jo!  Mind you - the BK did not castle until move 13 and Henry seems safe enough.  However, I make my final decision of where I want Henry to be next move.",
        "18... e5 19. O-O-O": "19. 0-0-0 - Queenside.",
        "19... e4 20. Nd2 Qg5": "20. ...... Qg5 - pin.",
        "21. Kb1 Qf5 22. Qc2": "22. Qc2 - this move appears to lose a pawn but it does not as you will soon see.",
        "22... Qxf2 23. Nxe4": "23. Nxe4 - the f pawn is traded for black's e pawn.  This knight move also defends the pawn on g3 and the pawn on g2 is defended X-ray fashion by Glenda!  So this puts the question to the Wicked Witch of the West.  Trade herself off for Glenda or get out of my pos!",
        "23... Qxc2+ 24. Kxc2": "24. Kxc2 - Kevin trades her off and this trade helps me because it brings Henry closer to the centre for the endgame.",
        "24... Kc7 25. Ng5 Rdf8 26. Rde1": "26. Rde1 - Because the rook on f8 is momentarily tied to defending the f7 pawn I decided to bag the open e file with my rook.",
        "26... Kd6 27. Rhf1": "27. Rhf1 - pile on.",
        "27... Nf6 28. Kd3": "28. Kd3 - Henry moves even closer to the centre.",
        "28... h4 29. gxh4 Rxh4": "29. ...... Rxh4 - pawn trade.",
        "30. Ne4+ Nxe4 31. Rxe4 Rxe4 32. Kxe4": "32. Kxe4 - what a plethora of exchanges - we are now down to a rook ending.",
        "32... Re8+ 33. Kd3 f6 34. Kd2": "34. Kd2 - preparing Re1.",
        "34... Re4 35. Rf3 Rg4 36. Rf2": "36. Rf2 - what a load of ballyooo with the rooks.  It looks as if we might draw by repetition.  Kevin breaks the sequence but he will live to regret it!",
        "36... Re4 37. Rf3 Ke7 38. Re3": "38. Re3 - we now go into a K & P ending.",
        "38... Rxe3 39. Kxe3 Ke6 40. a4 Kf5 41. Kf3 g5 42. g4+": "42. g4+ - the BK is driven back.",
        "42... Ke6 43. c4 f5 44. b4": "44. b4 - suddenly we have a wall of white pawns on the queenside!",
        "44... b6 45. d5+ cxd5 46. cxd5+ Kxd5 47. gxf5": "47. gxf5 - I come out of that little stouche with material even and both sides have a passed pawn on the kingside.  Alas for Kevin, Henry is closer to the g5 pawn than the BK.",
        "47... Ke5 48. Kg4 Kf6": "48. ..... Kf6 - forced if he wants to avoid letting that f pawn march on to Glendadom.",
        "49. a5 b5": "49. .... b5?? - this is the move which is gonna cost black the game.  I now play a6 and put Kevin in a zugzwang.  Kevin must now move his king away from the protection of the g5 pawn and Henry wastes no time in devouring his favourite seafood two moves down the line.",
        "50. a6 Ke7 51. Kxg5 Kf7 52. f6": "52. f6 - my passer must be pushed.",
        "52... Kg8 53. Kg6 Kf8 54. f7": "57. f7 - my pawn is only one square away from Glendadom and Kevin's only move is Ke7.  Henry will move to g7 next move and this will enable Glenda to appear in a puff of smoke.  First on her to-do list will be to keep the BK confined to the kingside and then Henry will be close by to aid her when it comes to driving the BK to the edge of the board to administer that kiss of death.  I hope you have had a good read - kind regards - Joanne"
    },
    "url": "https://gameknot.com/annotation.pl/bury-league-match-an-endgame-study?gm=48260",
    "gameName": "Bury League Match - An Endgame Study",
    "players": "Jo Stevens (1240) vs. Kevin Allsop (1344)",
    "opening": "Scandinavian defence, Lasker variation (B01)"
}