{
    "moves": {
        "1. e4 e6": "Defensa Francesa, claro.",
        "2. d4 d5 3. exd5 exd5": "Variante del cambio, me gusta.",
        "4. Nf3 Bd6 5. Bd3 Ne7 6. Be3 O-O": "Estupendo, ahora sólo me falta Af5 y Cc6.",
        "7. Nc3": "Vaya, ya no valen ni Af5 ni Cc6.",
        "7... c6": "Tras mucho pensar opté por lo más \"natural\" aunque hay opciones mucho mejores, lo sé.",
        "8. O-O Bf5": "Ahora sí.",
        "9. Bxf5 Nxf5 10. Bg5 f6": "¡Fuera bicho!",
        "11. Bd2 Nd7": "Si no se puede por c6 habrá que ir por d7 (y luego a f8)",
        "12. Re1": "Vaya, tendría que haber jugado yo Te8 antes...",
        "12... Rf7": "Una jugada rara. No me gustaba la idea de que cambiar torres en e8 y acabar con mi dama en la columna abierta (aunque eso no tenía nada de malo, la verdad) y además con ésta podía hacer Cf8, Dd7 y doblar torres en e, ésa era mi idea.",
        "13. Qe2 Nf8": "Sigo mi idea.",
        "14. Qd3 Qd7": "Y sigo con ella, que además me sirve para proteger el caballo. Ahora el blanco me parece que tiene poco que hacer salvo quizá intentar doblar torres, parece bastante maniatado, pero...",
        "15. Ne2": "Hum, no me gustaría nada 16. Af4 así que...",
        "15... Ng6": "Evita Af4 pero era mucho mejor g5, que sirve para lo mismo, y entonces sí Cg6 con buenas perspectivas de ataque.",
        "16. b3": "Vaya, quiere hacer c4 para liberarse un poco.",
        "16... Bc7": "Y yo defiendo d5 dos veces y me doy la posibilidad de formar \"la máquina\".",
        "17. c4": "Aquí está.",
        "17... Re7": "Y se me ocurre la peor jugada posible... Ahora el alfil tiene un objetivo y se puede liberar. Era mucho mejor y servía para lo mismo Te8.",
        "18. cxd5": "Lo esperado.",
        "18... cxd5": "No me gustó retomar de dama por Cc3.",
        "19. Bb4": "¡Ahí lo tienes!",
        "19... Nd6": "Me autoclavo pero no vi nada mejor, además el caballo está mejor ahí.",
        "20. Rac1": "Incómoda, pero aparentemente está todo protegido.",
        "20... Re6": "Me desclavo. (No valía directamente en la jugada anterior porque perdía el caballo).",
        "21. Nc3": "Ayayay. ¿Ahora qué? Bueno, quito el caballo y en paz ¿no?",
        "21... Nf7": "¡Pero ahí no! Muchísimo mejor y casi que ganadora directamente era Ce4. Por qué no la vi se escapa a mi comprensión...",
        "22. Rxe6 Qxe6 23. Nxd5": "Hala, peón perdido y alfil atacado (aunque su caballo también lo está). Eso debería haberme dado la idea de 23...Axh2+ 24 Rxh2 Dxd5 y recuperaba el peón con mejor posición, pero no lo vi. Lo que aparecía recurrentemente en mi cabeza era Cf4, pero no valía directamente...",
        "23... Bf4": "Así que pensé ésta. Es bastante conceptual después de todo y si mi rival pica el anzuelo y cambia piezas, que es bastante lógico, pues mejor aún: me gano calidad.",
        "24. Nxf4": "Y picó...",
        "24... Nxf4": "Gracias. Ahora amenazo dama y jaque doble ganando la torre.",
        "25. d5": "Buena idea pero sigue valiendo el jaque y hasta De8 e incluso Dg4.",
        "25... Ne2+": "Yo a lo mío.",
        "26. Kf1 Nxc1 27. dxe6 Nxd3 28. exf7+ Kxf7": "Bueno, mira por dónde al final he quedado ganado. Ahora a ganar.",
        "29. Bc3 Rc8": "A fastidiar y a llevar la torre arriba.",
        "30. Bd4 a6": "Primero a dejar de preocuparme por los peones.",
        "31. a4 Rc1+": "Y ahora a activar la torre. Mala jugada, era mucho mejor y lógica Tc7.",
        "32. Ke2 Nc5": "O cambiamos pieza o me gano un peón.",
        "33. Kd2": "¡Mejor aún! Ahora las dos cosas.",
        "33... Nxb3+ 34. Kd3 Nxd4 35. Kxd4 Ra1": "Y un peón más de regalo.",
        "36. g3 Rxa4+": "Ya está todo hecho. Esperaba una rendición en cualquier momento pero mi rival quiso jugar hasta el final.",
        "37. Ke3 Rc4 38. Nd2 Rc8 39. Nb3": "La puntilla final...",
        "39... Rc3+ 40. Kd2 Rxb3 41. Kc2 Rb6 42. f4 a5 43. h4 a4 44. g4 a3 45. g5 a2 46. gxf6 Kxf6 47. h5 a1=Q 48. Kd2 Qa3 49. Kd1 Rb2 50. Kc1 Qa1#": "Y así terminó mi primera victoria frente a un rival con Elo (hasta ahora sólo había conseguido tres tablas frente a rivales con 1400). Por supuesto, las variantes buenas me las dio el GM Alfredo Giaccio en nuestra clase de ayer."
    },
    "url": "https://gameknot.com/annotation.pl/campeonato-regional-de-murcia-por-equipos-de-club-2-divisi-n-c-a-lorca-alblanca-vs-casa-ajedrez-murcia-b-lorca?gm=56557",
    "gameName": "Campeonato Regional de Murcia por Equipos de Club. 2ª División. C.A. Lorca Alblanca vs Casa Ajedrez Murcia B, Lorca",
    "players": "José Carlos Rico Carretero (1310) vs. Julián Martínez Molina ",
    "opening": "French (C01), exchange, Svenonius variation"
}