{
    "moves": {
        "1. e4 Nf6": "!! Una sorpresa de impresión. Ya que Alin nunca ha jugado la defensa Alekhine en torneos, tampoco recuerdo partidas amistosas en donde haya ocupado esa defensa. Pero esto habla de la preparación que llevo para el match. Ya que en las partidas anteriores en donde Alejandro ha llevado blancas generalmente ponóa a Alin contra las cuerdas, ya que Alin prefiria plantear la Defensa Pirc, en contra del 1. e4 de Alejandro, y siempre quedaba con posición inferior el negro. Asó que se entiende que quisiera cambiar en este match.",
        "2. e5 Nd5 3. d4 d6": "Siguiendo el camino conocido de la Alekhine. ",
        "4. exd6": "Un desliz teorico, pero nada grave, generalmente se prefiere el ataque al caballo de d5, para que no este mucho tiempo ahí parado, obstaculizando en algunos casos el desarrollo blanco. Además para que dejarlo ahí pareciendo un trofeo. Las secuencias dentro de lo que podemos llamar normal son:\r\n4.-c4,Cb6\r\n5.-f4\r\ny también la que se considera más segura\r\n4.-Ac4, Cb6\r\n5.-Ab3,g6\r\ny en otros caminos más posicionales la continuación del mismo Alekhine\r\n4.-c4, Cb6\r\n5.-Cf3, \r\n\r\n",
        "4... cxd6": "Esta captura es un tanto errónea, ya que las negras quedan con minoría en el ala de dama, en donde se supone que el blanco en un final de reyes y peones logran crear un peón pasado en el ala de dama y ganan.\r\nPero como decía el gran Steinitz, los Dioses han puesto el medio juego antes del final.\r\nLo cierto es que 4.- ...exd6 es más seguro",
        "5. Nf3": "Un error de novato, lo correcto es c4 ganando espacio y espabilando al caballo negro. Después tranquilamente jugamos Ae2, con la defensa indirecta del peón c4 por el jaque de dama en a4.\r\nSiempre en este sistema defensivo hay que tomar en cuenta que la idea estratégica del negro es atacar el centro de peones blanco, y para eso regalaron tiempos moviendo al caballo. Pero si el blanco no juega de forma activa se queda el blanco sin desarrollo de piezas y menos con centro fuerte.\r\nLas odeas estratégicas repito, son:\r\nBLANCO: Crear un centro de peones fuerte, si es móvil es mucho mejor.\r\nNEGRO: Permitir que el blanco controle el centro del tablero, para después atacarlo por medio de las jugadas ...c5, ...Cc6, ...e6 seguido de ...d5.\r\n",
        "5... Bg4": "Entra en las jugadas llamadas simples y normales. Aunque si se quiere jugar para mantener al caballo en d5, sería preferible jugar en este momento ...g6, seguido de ...Ag7; controlando la diagonal a1-h8. Apesar de la presencia del alfil negro en g4, practicamente el caballo de f3 es incomible, por que debilitaría gravemente la posición negra en el ala de dama. Por ejemplo la diagonal de h1-a8 ya es muy débil hay no haber peón en la columna c. Es por eso que resulta la jugada ...Ag4 una pérdida de tiempo, cini se cimprobará adelante en los comentarios a la partida. ",
        "6. Be2": "Sigue el camino conocido, pero; vuelve a ser mejor la jugada intermedia c4 para espantar al caballo negro de d5. Es el que acabó matando a la dama blanca. \r\n5.-c4, Cb6\r\n6.-Ae2, Axf3?\r\n7.-Axf3, Cxc4??\r\n8.-Da4+, Cc6\r\n9.-Dxc4, ganando pieza\r\nEn esta variante vemos la necesidad de mantener al alfil negro de g4, no se podrá cambiar por el caballo, lo cual represento la jugada ...Ag4 un error bastante cuestionable.",
        "6... Nc6 7. O-O": "Protección del rey, necesaria para comenzar el ataque.",
        "7... Qb6": "Un error serio que debería costar la partida, o por lo menos entrega las riendas de la partida a las blancas. La posición en la defensa Alekhine para el negro se vuelve complicada precisamente por errores de este tipo. Las negras deben ser cuidadosas al desarrollar las piezas, la dama negra no cumple ninguna labor de apoyo en la casilla b6, sino al contrario, la quita al caballo esa importante casilla de retirada.",
        "8. Re1 e6": "Este movimiento ya representa un error serio, por que el alfil no podra regresar a defender a su rey. La variante correcta aqui es:\r\n9.-c4, Cf6\r\n10.-d5, Ce7\r\n11.-Da4+, Cd7\r\nCon posición complicada pero en donde el blanco lleva las riendas de la partida.",
        "9. h3 Bh5 10. c3 Be7 11. Bg5 Qxb2 12. Nbd2 Nxc3 13. Nc4 Nxd1 14. Nxb2 Nxb2 15. Rab1 Bxf3 16. Bxf3 Bxg5 17. Rxb2 O-O 18. Rxb7 Nxd4 19. Be4 d5 20. Bd3 a5 21. Rd1 Bf6 22. a4 Rfb8 23. Ba6 Rxb7 24. Bxb7 Rb8": "Esta clase de errores, si debo comentarlos, aqui ganaba otra pieza, mediante Ta7, obligando a Ac8, después el rey negro camina hasta d6 se juega entonces Cb4, Tc7 y se gana el alfil intruso.",
        "25. Ba6 Rb4 26. Rc1": "La última esperanza. Vale la pena aún creer en los reyes magos.",
        "26... g6 27. Rc8+ Kg7 28. Bb5 Be5 29. g3 Nxb5 30. axb5 Rxb5": "Se rinden las blancas."
    },
    "url": "https://gameknot.com/annotation.pl/campeonato-juvenil-nuevo-laredo-2010?gm=31416",
    "gameName": "Campeonato Juvenil Nuevo Laredo 2010",
    "players": "Alejandro I. Trejo Castro (1023) vs. Alin Martínez Hernández (1048)",
    "opening": "Alekhine's defence (B03)"
}