{
    "moves": {
        "1. d4": "Mi clásico d4 para jugar el Gambito de Dama",
        "1... d5": "Bien, nada raro.",
        "2. c4 e6 3. Nc3 Nf6 4. Bg5 Be7 5. e3": "Estupendo, hasta aquí todo bien, todo según mi teoría.",
        "5... Nbd7 6. Bd3": "Jugada 6 y ya la he cagado. Mi teoría dice que aquí he de jugar 6. cxd5 para no perder un tiempo con el alfil si ahora mi rival jugara 6... dxc5. Pero, por mucho que he repasado en las últimas semanas que cuando el alfil malo está fuera de la cadena de peones hay que comer en d5 para no perder tiempo con el alfil bueno a la hora de la verdad ni lo dudé... y lo hice mal.",
        "6... O-O 7. Nge2 b6 8. O-O": "Otra buena oportunidad de hacer 8. cxd5 desaprovechada, sobre todo ahora que está claro que serviría para molestar al alfil que va a ir a b7",
        "8... Bb7 9. Rb1": "Esta jugada encaja con el plan original (¡si hubiera comido en d5!) del ataque de las minorías pero, claro, como me he saltado la teoría ahora no vale para nada y es malísima...",
        "9... c5 10. cxd5": "Ahora sí que recordé que con los peones negros en c5 y d5 había que comer en d5 sí o sí",
        "10... exd5 11. Qc2": "Ahora se imponía haber comido en c5 y así tener un plan claro: atacar los peones colgantes en c5 y d5. Yo en cambio me dediqué a gastar 10 minutazos del reloj intentando decidir dónde poner mi dama. En d2 no me gustaba por 11. Ce4 así que Dc2 que hice. Nada más presionar el reloj me recorrió un sudor frío al ver que con c4 me atrapaban mi alfil bueno... o eso pensé yo. Respiré hondo y vi que valía Af5 y ¡hasta Axh7+ ganando un peón!",
        "11... Qc7": "Mi rival no se dio cuenta así que...",
        "12. Bxh7+": "¡Toma ya! peón ganado. Si 12... Cxh7 13 Axe7",
        "12... Kh8": "Vale, me vuelvo a f5 y en paz.",
        "13. Bf5 Bd6": "Con peón de más... ¡a cambiar piezas!",
        "14. Bf4": "Pero es muy mala idea. Mejor hubiera sido h3 y problema resuelto...",
        "14... Bxf4 15. Nxf4": "¿Estupendo, no? Pues no... véase lo que sigue.",
        "15... cxd4 16. exd4 Qxf4": "Ahora está claro que había que haber jugado 14. exf4 pero es que ni lo pensé... ¿Ahora qué? Pues estoy perdido, sin más.",
        "17. Rbd1": "Prácticamente obligada",
        "17... Rad8": "Esta jugada no me dice nada así que...",
        "18. Rfe1": "Habrá que ocupar la columna abierta ¿no?",
        "18... Rdc8": "¿Cómo?",
        "19. Qd3": "Bueno, mejor quitar la dama por si acaso...",
        "19... Rcd8": "¡¿Otra vez?!",
        "20. Re3": "Pues a la tercera fila se ha dicho",
        "20... Kg8 21. Rh3": "Aunque el rey se haya ido siempre es bueno quitarle casillas de escape",
        "21... Rfe8": "Y él se da un escape... Ahora es más difícil el mate, jo...",
        "22. Ne2": "Sigamos sumando piezas al flanco de rey, no hay otra...",
        "22... Qd6": "Vale",
        "23. Re1": "A la columna abierta que siempre puede ser útil (y en esta ocasión lo será, y mucho)",
        "23... Qb4 24. Bh7+": "Antes de proteger el peón b un jaquecito para acercar al rey a la columna abierta y darme la posibilidad de dar luego jaque con la torre en h8",
        "24... Kf8 25. Qb1": "Ahora sí, protejo b2",
        "25... Ba6": "Uy, aquí ya me empezó a dar miedo la cosa. ¿Como salir de ésta? 26. Ad3 parece evidente pero tras cambiar alfiles b2 cae igualmente así que mejor dar b2 y conservar el alfil... quién sabe...",
        "26. Qd1 Qxb2 27. Bd3": "Ahora sí me gustó porque se me ocurrió que tras cambiar alfiles Th8+ y Re7 sería peligroso...",
        "27... Qxa2": "Y después de esto aún más... Ahora la dama está a tiro de jaque descubierto si el rey va a e7. ¡Probémoslo!",
        "28. Rh8+": "Ven a e7, rey, ven a e7... (28... Cc8 hubiera sido un corte de rollo pero con 29.Ah7 se seguía presionando bastante ¿no?)",
        "28... Ke7": "¡Y vino! ¡Ya eres mío! Redoble de tamborrr...",
        "29. Nc3+": "¡Tachán! ¡Me gano la dama y la partida!",
        "29... Kd6 30. Nxa2": "Ole",
        "30... Rxe1+ 31. Qxe1 Rxh8 32. Bxa6": "Y después de estos bonitos cambios el resultado no puede ser más favorable. Lástima que me quedaran 12 minutos en el reloj y a él 68... Todavía había que sufrir...",
        "32... Re8 33. Qb4+": "Un jaque para evitar el mate...",
        "33... Kc7 34. Kf1": "Y listo",
        "34... Rh8": "¿En serio?",
        "35. Qc3+": "Otro jaque al canto (soñaba con que se fuera a la esquina y se metiera en red de mate)",
        "35... Kd6": "Pero no cayó...",
        "36. h3 Ne4 37. Qb4+ Kc7 38. Nc3": "A cambiar piezas, que me conviene",
        "38... Re8 39. Nxe4 Rxe4": "¡Una menos!",
        "40. Qc3+ Kd6 41. f3": "A ver adónde vas ahora...",
        "41... Rh4": "Sigue atacando d4 que es imperativo que no caiga pero de momento está bien protegido aunque sería recomendable quitar a la dama de tan prosaica misión...",
        "42. Bc8": "Antes hay que intentar activar al alfil (no me parece ahora el mejor modo pero en agobios de tiempo es lo que se me ocurrió)",
        "42... Nf6 43. Bf5 g6 44. Bb1": "Lo esperado. ¡Un minuto y medio me quedaba en el reloj aquí! tenía el corazón a mil pero al menos ya tenía un plan: acercar el rey al centro y liberar la dama.",
        "44... Rf4 45. Ke2 Ke6": "¿Eso encierra la torre, no?",
        "46. g3": "Pues sí. Aquí mi rival me ofreció tablas que, lógicamente, rechacé",
        "46... Rf5 47. Bxf5+ gxf5": "Se acabó la cosa. Ahora tenía tres minutos en el reloj y podía jugar la dama a placer...",
        "48. Qe3+": "Jaque y...",
        "48... Kd7 49. Qe5": "Se acabó. Mi rival se rindió, caía todo. Bien que se lo agradecí. Una partida lamentable con final feliz pero... el jaque descubierto es bonito ¿eh?"
    },
    "url": "https://gameknot.com/annotation.pl/campeonato-regional-de-murcia-por-equipos-de-club-2-divisi-n-club-ajedrez-lorca-c-a-lorca-rivas-seguros-vs-c-a-lorca-mes-n-lorquino-c?gm=60133",
    "gameName": "Campeonato Regional de Murcia por Equipos de Club. 2» Divisi—n, Club Ajedrez Lorca. C.A. Lorca Rivas Seguros vs C.A. Lorca Mes—n Lorquino C",
    "players": "Juli‡n Mart’nez Molina (1297) vs. Josie Esteban Rosero Pilozo ",
    "opening": "QGD (D53), Lasker variation"
}