{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Bc4 Bc5 4. d3 Nf6 5. Nc3 d6 6. Bg5 h6 7. Bxf6 Qxf6 8. Nd5 Qd8": "The starting position for all the games.",
        "9. c3 Ne7 10. d4": "The point of the variation: if Black now exchanges Pawns, White is left with an \"ideal center\".",
        "10... Nxd5 11. dxc5 Nf4 12. g3 Ne6 13. cxd6": "If Black now replies PxP I can use the half open Q file to pressure the backward QP.",
        "13... Qxd6 14. Qxd6": "A Queen exchange first.",
        "14... cxd6 15. O-O-O": "With the Queens gone, I'm not afraid to leave my King in a relatively open area.",
        "15... Ke7 16. Rhe1": "Securely guarding the KP.",
        "16... Rd8 17. Bb3": "I don't want my B to remain loose, plus I add protection to the QR in case of a potential future exchange.",
        "17... b5 18. Kb1": "The struggle for a tempo. Neither side can do a whole lot that is productive, and I start thinking in terms of a draw.",
        "18... Bb7 19. Bc2": "Adding a guard to the KP.",
        "19... Rac8 20. h4": "Preventing a potential K-side surge. To use a Niemzowitschian phrase, i'm reducing the game's dynamism.",
        "20... a5 21. Nd2": "Clearing a space, eventually, for my KB pawn to secure the K pawn.",
        "21... f6 22. Nf1": "Opening the line back up to keep the pressure on the Q pawn.",
        "22... Rc4 23. Re3": "Guarding the KB3 square...",
        "23... Rdc8 24. f3": "...so that I can finally secure my KP solidly.",
        "24... b4 25. Rdd3": "Starting to wind the game down.",
        "25... Nc5 26. Rd1": "Discretion is the only part of valor here.",
        "26... bxc3 27. Rxc3": "Offering to drain more energy out of the game...",
        "27... Rxc3 28. bxc3": "...with this Rook exchange.",
        "28... Ba6 29. Ka1": "Moving off the open file.",
        "29... Nd7 30. Bd3": "Draw agreed. After 30...BxB 31 RxB the QBP is guarded and the Rook and Knight ending offers no real winning chances to either side."
    },
    "url": "https://gameknot.com/annotation.pl/canal-variation-mini-tournament-ii?gm=46851",
    "gameName": "Canal Variation mini-tournament II",
    "players": "last_archimedean (1365) vs. arbtree (1644)",
    "opening": "Giuoco Pianissimo (C50), Canal variation"
}