{
    "moves": {
        "1. d4 d5 2. c4 Nf6 3. Nc3 Nc6": "? not the best move because in the D-pawn games Black's main counter play is found in c7-c5. Now in black has to move his knight again in order to play c7-c5. Also the knight most natural developing square is d7 where it can watch over c5 and e5. \n\nIf you look at the position and think for a moment you will natural see that playing ...e6 comes to mind because it supports and strengthens the D-pawn and activates the dark bishop. Conversely if you think about ...Nc6 you get the sense it must feel awkward and cramping. ",
        "4. Nf3 g6": "!? this is a good move but one that I can not recommend for ashleyanderson because his skill level does not suit the skill needed in order to fianchettoing the bishop effectively. You will win alot more games by keeping things simple and capitalizing on your opponents mistakes with moves like ..Bg4 followed by ...e6 or ...e6 followed up with ...Bb4 are ideal",
        "5. e3": "This is move is similar to ashleyandersons g6 move in that it requires skill in order to be effective. It main disadvantage is that it locks in the dark bishop which is not good. However, because I have played similar positions in the past I know that the opening and control of the c file is critical to success. So developing my pieces on the queen side is my objective. I plan to develop my bishop to a3, b2 or d2 depending on how the game turns out",
        "5... Be6": "? This supports the d5 pawn but is not a good opening move because it hinders the development of the center king pawn and the kings bishop. As a rule if you play g6 then Bg7 should immediately follow. \nAlso black had nothing to fear from the capture of the d5 pawn. \n\nIn this case black can use the formula for knowing if a piece/space is under a serious threat of being captured. The formula is as follows\n\nSimply ask 1. How many pieces do I have attacking the square 2. How many pieces does my opponent have defending the square. If the answer is you have more pieces attacking then you will win the exchange. \n\nFor i.e\nWhite has 2 pieces attacking d5 while...\n\nBlack has 2 pieces defending d5\n\nTherefore after 5. ...Bg7 6. Cxd5? Nxd5 7. Nxd5 Qxd5 black is equal and white gains very little from the exchange.",
        "6. a3": "This prevents ...Nb4 and prepares for Bd3 or Qc2.",
        "6... h6": "?? a major waste of time that leads to a lot of trouble for black. As a rule you should never move the pawns in front of the castled kings or the side that you intend to castle toward\n\ngood alternative moves would have been. 6. ...dxc4(this is best cause it releases pressure in the centre) or 6. ...Bg7",
        "7. Bd3": "developing a piece to maximize influence over the centre squares and put pressure on the weakened g6 point. ",
        "7... Bg7": "a good move that follows the 2 simple rules outlined in the introduction. ",
        "8. cxd5": "with my nicely centered pieces and greater control of the center I am ready to attack in the center. This why I recommend that ashleyanderson not play the fainchetto openning because one has to take care that the centre remains neutral(and this requires a lot of chess intuition to know). Ashleyanderson should focus more in the future moves that control the centre directly. ",
        "8... Bxd5": "Ashleyanderson was doing ok until this point. Understandably it is difficult to answer the question, \"Do I capture with the knight or the bishop?\" When most of the pieces are on the board the answer is almost always with the knight! During the opening phase you use the knight to capture back toward the center. Bishops are usually long term assets that work best in the endgame. So trading them off in the opening is never a good plan. \n\nThink of it this way\n\nKNIGHTS as short term assets that are more useful with lots of pawns and pieces on the board. So they are one of your strongest pieces early in the game. So use them early\n\nBISHOPS are long term assets that increase in power the pawns and pieces are removed off the board. So just like fine wine your bishops get mature with age. So hold onto them!",
        "9. e4": "Lesson learned!! I hope:\n\nIf it is early in the game capture back with the knight not the bishop. ",
        "9... Be6": "During the game Ashleyanderson said \"not really sure what I am doing, I felt like I was trying to get pieces in play but now am being forced to pull back. any thoughts?\"\n\nThis unfortunate predicament is a result of poor development of the bishop, capturing back with the wrong piece, and unnecessary pawn moves.  Instead of 5...Be6 i would recommend ...Bg4 as the ideal developing square for the bishop. ",
        "10. d5": "\r\nA cruel move that is played without mercy. However, chess does not favor the merciful. ",
        "10... Ng4": "never hang a piece! as distasteful as it was playing 10. ...Nxd5 it was the best. But I do not fault Ashleyanderson for not wanting to play it! ",
        "11. dxe6 fxe6": "with the doubled pawns in front of the king black is seriously cramped. Also you can by comparing the pawn structures determine who is fairing better. White has two connected pawn chains. vs Black's three pawn islands. \n\nOne of the simplest ways to win a game quickly is to create pawn weaknesses are the enemy king because they create open lines to the king or create endgame targets. There are several varieties: isolated, doubled, too advanced and blockaided. see how many pawn weaknesses you can discover in for both white and black. ",
        "12. O-O": "before you attack make sure your own king is safe! ",
        "12... Qd6": "remember to develop your pieces to squares where they can not be attacked Qd7 would be fine",
        "13. Nb5 Qc5": "Qd7 was a must to prevent the fork",
        "14. Nxc7+": "I know I know I am so cruel!",
        "14... Kd7 15. Nxa8 Rxa8 16. Bc4+": "my attack is very strong because I followed the 2 simple rules in the introduction. This is positional play at its best. Against a well coordinated team there is no defense. ",
        "16... Nd4 17. Nxd4 Bxd4": "please notice that most of the pieces have been traded off the board. Notice how powerful the bishops are. Now notice the little wimpy horse hanging out to dry all by himself!",
        "18. Be3 Qxc4 19. Rc1 Nxe3": "good job Ashleyanderson in managing to get a return for that wimpy knight",
        "20. fxe3 Qb5 21. Qxd4+": "here my pawn weakness can be tolerated because the advantage of the open lines to the king are better. Also black has nothing to attack them with anyway so they are fine. ",
        "21... Ke8 22. Qh8+ Kd7 23. Rfd1+": "black resigns"
    },
    "url": "https://gameknot.com/annotation.pl/canadain-bacon-mini-tournament-i?gm=31228",
    "gameName": "Canadain Bacon mini-tournament I",
    "players": "elyhim (2030) vs. ashleyanderson (1085)",
    "opening": "QGD (D06), Marshall defence"
}