{
    "moves": {
        "1. c4": "I have been experimenting with the English system in resent games. I like it because it requires very little opening memorization and it is very flexible. Meaning that it can be played against just about anything. ",
        "1... e5 2. g3 Bc5 3. Bg2 Nf6 4. Nc3": "one of the things that make the English a difficult system to play is the subtle strategies at play. ",
        "4... d6 5. Nf3 Be6": "not a typical move for black but none the less it does cause me grief. It is a good move because it develops a piece with tempo. ",
        "6. Qb3": "??\nThis move is bad. I played it because it threatens Qxb7 but playing Qxb7so early is rarely a good move in most positions. The reason why Qxb7 is almost always bad is because Black can place his rook on the b-file forcing the white queen to the edge of the board where it can possibly be trapped or taken out of play. As a result If white does decide to play Qxb7 then extremely accurate play is required to gain a plus from the extra pawn\n\nAlso the idea of 6. d3 is fine for black\n\n6...h6 7.d4 exd4 8.Nxd4 Bxd4 9.Qxd4 Nc6 10.Qh4 0-0 11.0-0 Bf5 12.b3 Re8 13.Bb2 Ne4 14.Qxd8 Raxd8 15.Nd5 Nc5 16.Rfe1 Rd7 17.Rad1 =  \n\nPerhaps the idea 6. d4!? exd4 7. Nxd4=/+ and the game is only slightly better of white because of his control over the center and space ",
        "6... Nbd7 7. d3 O-O 8. Qc2": "This proves that Qb3 was a bad move. Black has a slight edge now because he has a lead in development and better attacking chances. \n\nMy thoughts about Qc2 were to play a2 followed by b4.",
        "8... Ng4": "Whoa horsie!!\n\nBlack must think he has something here but if he continues on his present course he will find himself biting on granite. It is way to early in the game for these kind of tactics",
        "9. O-O": "the f2 square is well defended now",
        "9... f5": "!?\nBlack is coming quick and furious and has no justification for the weakness created on g5. \n\n...h6 is better to keep the knight out of g5. ",
        "10. Ng5": "Surprise! \n\nI am sure Hansbro saw this but I think he underestimated the importance of his light bishop being gone. ",
        "10... Bf7": "Avoids the fork on d3",
        "11. Nxf7 Kxf7 12. Bxb7": "With his counterpart gone this bishop becomes a terror of destruction",
        "12... Kg8 13. Bd5+": "The question for me was \"What to do with the Bishop?\"\n\nMy original intention was to play BxR but after Hansbro played ...Kg8 I smelt a trap. So I decided to play a in between move in order to give myself time to think about it. \n\nThe problem of 13. BxR is that at this point white's control of the light squares is critical to the defense of the king. ",
        "13... Kh8 14. Bxa8": "In the end I decide to play BxR and I'll be dammed the consequences. ",
        "14... Qxa8 15. Nd5 Ndf6 16. b4 Bd4 17. Bb2 Nxd5 18. cxd5 Bxb2 19. Qxb2 Qxd5": "White is better now because of the major weakness of c7. ",
        "20. Rac1": "attacking the soft spot in black's position. ",
        "20... f4": "?\r\nWow give black credit for trying but he is going to lose his teeth on granite. ",
        "21. Rxc7 fxg3": "Black has thrown a hale Marie  and hopes white will do something stupid",
        "22. hxg3": "Black has nothing and is now a minor piece behind. White has an active rook and potential for a queen side pawn storm",
        "22... Qe6 23. Rxa7": "?? wow this is a real Homer Simpson moment. If I recall I made this move in the middle of a boring business meeting and my lack of concentration cost me dearly.\n\nQc1 would be winning\n\n\n ",
        "23... Qh6": "Mate in 3 good job Hansbro"
    },
    "url": "https://gameknot.com/annotation.pl/canadain-bacon-mini-tournament-i?gm=32238",
    "gameName": "Canadain Bacon mini-tournament I",
    "players": "elyhim (2071) vs. hansbro (1822)",
    "opening": "English opening (A20)"
}