{
    "moves": {
        "1. e4 c5 2. Nf3 d6 3. d4 cxd4 4. Nxd4 Nf6": "The Sicilian Defense, Fischer's favorite counter to P-K4.",
        "5. Nc3 a6 6. Bg5 e6 7. f4 Be7": "All book play.",
        "8. Qf3 Qc7 9. O-O-O Nbd7 10. g4 b5": "Gligorich's K-side aims are countered by Fischer's ambitions on the Q side.",
        "11. Bxf6 gxf6 12. f5 Ne5": "Fischer seizes the opportunity to plant his Knight on a central outpost.",
        "13. Qh3 O-O": "With the players castled on opposite wings. they can both attack with abandon.",
        "14. Nce2 Kh8 15. Nf4": "Now Gligorich plants his own Knight on a strong outpost.",
        "15... Rg8 16. Rg1 d5": "16... Q-N2 was the more solid but less active alternative.",
        "17. fxe6 dxe4 18. Nd5 Qc5": "Both sides have chances. 19 N-B5 QxR 20 N(B5)xB BxP 21 NxR BxP leads to wild complications.",
        "19. Nxe7": "Gligorich avoids the wild complications and settles for winning back the minor exchange.",
        "19... Qxe7 20. Nf5 Qxe6 21. Qh6 Bd7": "Preventing 22 R-Q8!",
        "22. Rd6 Nxg4 23. Rxg4": "Avoiding 23 RxQ? NxQ! winning a piece outright.",
        "23... Qxf5": "24 R-B4 holds the draw. Instead, Gligorich blunders.",
        "24. Rxg8+": "Handing Fischer an opportunity to win. 24... KxR! is the winning move.",
        "24... Rxg8": "Now Gligorich again has good drawing chances.",
        "25. Rxf6 Qd5 26. Rd6 Qf5 27. Rf6": "Here Fischer could play for a draw by threefold repetition [27...Q-Q4 28 R-Q6 Q-KB4 29 R-KB6 Q-Q4]. Instead, he tries for a win.",
        "27... Qg5+ 28. Qxg5 Rxg5 29. Rxf7 Bg4 30. Kd2 Bf3": "A draw could easily have been agreed, as material is even and Black's advantage of the lone passed Pawn is not enough to force a win. But Fischer and Gligorich play on.",
        "31. Ke3 Rg1 32. Bh3 Re1+ 33. Kf4 Bd1": "Fischer attempts to squeeze out a win that isn't there.",
        "34. Ke5 e3 35. Bf5 Rg1 36. Rxh7+ Kg8 37. Rc7": "Now it is Gligorich who has the material advantage! Fischer can still hold the draw with 37...P-K7.",
        "37... Bg4 38. Bxg4 Rxg4": "The position simplifies a little more.",
        "39. Rc3 e2 40. Re3 Rg2": "With the conclusion of 40 moves, both players were relieved of any time-pressure. ",
        "41. Kd4 e1=Q 42. Rxe1 Rxc2 43. Rb1": "Setting a trap: 43...RxRP? 44 K-B5! invading the Q-side decisively.",
        "43... Kf7": "Fischer doesn't fall for it. He tries to centralize his King.",
        "44. a3 Ke6 45. b3 Rxh2": "Fischer vaporizes the passed KRP now that it is safe to do so.",
        "46. Kc5 Kd7 47. Kb6": "Gligorich threatens to massacre Fischer's Q-side Pawns.",
        "47... Ra2 48. Kxa6 Rxa3+": "49 KxP is now answered by 49...K-B2 with an easy draw,",
        "49. Kb7 Kd6 50. Kb6 Kd7 51. b4 Rh3 52. Rc1": "52...R-R4 holds the draw [53 R-B5 RxR 54 KxR K-B2 55 KxP K-N2 with the Opposition.]",
        "52... Rh8": "A terrible blunder by Fischer, allowing Gligorich a chance to seize the win. 53 R-B7 ch!! wins, as Fischer's King can no longer get in front of the Pawn.",
        "53. Kxb5": "Gligorich fails to seize the chance. Now Fischer takes the opportunity to draw the game.",
        "53... Rb8+ 54. Ka4 Ra8+": "Now the draw plays out.",
        "55. Kb3 Rc8 56. Rxc8 Kxc8 57. Kc4 Kb8": "Drawn. Fischer holds the distant Opposition."
    },
    "url": "https://gameknot.com/annotation.pl/candidates-tournament-1959?gm=31503",
    "gameName": "Candidates' Tournament, 1959",
    "players": "Svetozar Gligorich (GM) vs. Bobby Fischer (GM)",
    "opening": "Sicilian (B99), Najdorf, 7...Be7 main line"
}