{
    "moves": {
        "1. d4 Nf6 2. Bg5": "This move came as a huge surprise for me. I did expected from Carlsen to escape from the main theoretical paths , but not in such brutal way! Trompovsky is rare guest in the top level. I can recall the only game with this opening system in the history of the matches for the world championship. Anand won with it the last game from the match against Karpov in Lausanne 1998 \n",
        "2... d5": "Karjakin goes for the most principle line - It is not big secret that he is perfectly prepared in the opening stage.I prefer to play here (2... e6 avoiding doubled pawns on f6 and after 3. e4 h6 4. Bxf6 Qxf6 5. c3 white has emerged with full centre control but black bishop pair may serve as a good weapon for achieving balanced chances in the middlegame.) \n",
        "3. e3 c5 4. Bxf6 gxf6": "According to the theoreticians this is the best black reaction to Trompovsky \n",
        "5. dxc5": "This is the main theoretical flow, but nevertheless is not easy to explain the point behind white's play - to exchange just for nothing his important dark squared bishops, following by leaving black full control in the center. Obviously Black is going to return the pawn easily. I think white lies his hopes on retaining attacking chances against black king - as the king side pawn shelter is already compromised it might be difficult for black to find safe place for it. \n",
        "5... Nc6": "(5... e6 was black choice in the game Carlsen,M - Kramnik,V Tal Memorial Moscow 2013 and after 6. Nf3 Nd7 7. c4 dxc4 8. c6 Carlsen won in 72 moves) \n",
        "6. Bb5": "Novelty on move 6!! It might be thoroughly prepared by Carlsen and his team and amazingly he got the chance to use it already in the first game The most recent top game Caruana - Giri followed (6. c3 e6 7. b4 a5 8. Qb3 Caruana,F -Giri,A London ENG 2015 and white tried to defend his extra pawn by all means) (6. Nc3 e6 7. Na4 Bxc5 8. Nxc5 Qa5+ 9. Qd2 Qxc5 10. Nf3 e5 and black was fine in Ivanisevic - Wojtasek Berlin 2015) \n",
        "6... e6": "6... e6 Karjakin tough for some 20 minutes here and he opts for the safest solution - taking back the pawn on c5 (6... Qa5+ 7. Nc3 a6 Would have been the most chalenging continuation, It is going to be analysed in details by his team.) \n",
        "7. c4": "This is the right decision. Of course Carlsen is challenging black center control (7. b4 is not good here 7... a5 8. c3 Bd7 and black is on top) \n",
        "7... dxc4": "again the safest option. More interesting was (7... a6 8. Bxc6+ (8. Ba4 dxc4 9. Bxc6+ (9. Nd2 Bd7) 9... bxc6 10. Nd2 Qd5) 8... bxc6 9. Qa4 Rb8 10. Nf3 Rg8 11. O-O Rxb2 12. Nbd2 But it is too dangerous to try such continuations without previous analysis) ",
        "8. Nd2": "(8. Qxd8+ Kxd8 9. Nd2 Bxc5 Carlsen is avoiding the queen swap Endgame should be at least slightly better for black) \n",
        "8... Bxc5": "In my opinion black position is safe enough. Karjakin looks very confident for the moment \n",
        "9. Ngf3": "(9.Qh5 Qd5)",
        "9... O-O": "Karjakin is not afraid to castle kingside - obviously he consider that white has not sufficient attacking potential. \n",
        "10. O-O Na5": "Logical continuation - black shows he is happy with further simplifications. But I see no danger for black after any of the other normal developing moves like (10... c3 or) (10... Kh8 or) (10... Bd7) \n",
        "11. Rc1 Be7 12. Qc2": "(In case of the immediate 12. Nxc4 black has strong resourse 12... a6 for example 13. Qxd8 Bxd8 14. Nd6 axb5 15. Rxc8 Rxc8 16. Nxc8 f5 17. b3 Bf6 18. Nd6 b4 with equality) \n",
        "12... Bd7 13. Bxd7 Qxd7 14. Qc3": "With this move Carlsen shows his intentions that he is looking for more than a comfortable draw He is threatening the knight on a5 and in the same time rise the tension against the black king -suddently Ne4 looks rather unpleasant to meet Obviously the endgame after (14. Nxc4 Rac8 15. Rfd1 Qc7 16. Na3 Qxc2 17. Nxc2 Rfd8 only black can play for a win because his bishop is supreme to white knight when remaining pawns are on both wings) \n",
        "14... Qd5": "Karjaking spent about 8 minutes in finding the best defense (in case of 14... b6 15. Ne4 (15. Nxc4 Rac8 16. Qd2 is only equal) 15... e5 16. Rfd1 Qe6 17. Ng3 Rfd8 18. Nh4 Bf8 19. Nhf5 White probably has sufficient compensation for a missing pawn but hardly more than that) \n",
        "15. Nxc4": "There is no more ideas to try and Carlsen goes for seemingly drawish endgame. Still nothing is yet decided as with white is playing the greatest ever endgame master in chess history \n",
        "15... Nxc4 16. Qxc4 Qxc4 17. Rxc4 Rfc8 18. Rfc1 Rxc4 19. Rxc4 Rd8": "with idea to follow up with Rd7",
        "20. g3 Rd7 21. Kf1 f5 22. Ke2": "(22.Ne5 Rd5)",
        "22... Bf6": "Well known endgame principle is that bishop is better piece than the knight when pawns are on both wings. But in such positions although black bishop has great mobility he is in fact staring in empty space and has low attacking potential. Another important point is that white rook controls the more important open file -as at some point it can be activated ( Rc8-b8) \n",
        "23. b3 Kf8 24. h3 h6": "(is better for black to avoid 24... h5 as after 25. h4 his pawn on h5 might be an object for attack ( Ne1-g2-f4)) \n",
        "25. Ne1": "white knight goes in quest for probing the weakness somwhere ( d3-c5), or (d3-f4-h5) ",
        "25... Ke7": " black is in a hurry to exchange rooks ( Kd8, Rc7 ) \n",
        "26. Nd3": " I expect from Karjakin the modest Kd8. In case of the more active 26...Kd6 white has some tricks after 27 g4 as for example 27..fg4? 28 Nc5 is winning \n",
        "26... Kd8 27. f4": "Now after 27...Rc7 the rooks will be exchanged Seems like the draw is becoming inevitable \n",
        "27... h5": " it is matter of technique here. After white pushed f4 his king cannot attack the pawn on h5 so black can safely play this move avoiding any ideas connected with g4. There was of course not much for white after the immediate rook swap (27... Rc7 28. Rxc7 Kxc7 29. g4 fxg4 30. hxg4 Kd6) \n",
        "28. a4 Rd5": "(28... Rc7 is now wrong 29. Rxc7 Kxc7 30. Ne5 Bxe5 31. fxe5 Kc6 32. Kf3 Kc5 33. Kf4 and white is winning 33... Kb4 34. e4 fxe4 35. h4 Kxb3 36. g4 hxg4 37. Kxe4 Kxa4 38. h5) \n",
        "29. Nc5 b6 30. Na6 Be7 31. Nb8 a5 32. Nc6+ Ke8 33. Ne5 Bc5": "Finally black achieved a fortress with blocking the queen side I see no way for white to break in \n",
        "34. Rc3 Ke7 35. Rd3 Rxd3 36. Kxd3 f6 37. Nc6+ Kd6 38. Nd4 Kd5 39. Nb5 Kc6 40. Nd4+ Kd6 41. Nb5+ Kd7 42. Nd4 Kd6": "In this first game the champion Carlsen was white. Once again he showed his playing style and as in the previous two championship matches with Anand he avoids direct theoretical duel (or at least in the beginning) prefers not to disturb excessively the dynamic balance and to take risk for the time being. Trompovski system that Carlsen chose for today's first game has a reputation as a sharp and interesting sequel which however is considered insufficient to obtain debut advantage. Undoubtedly Carlsen and his team payed special attention in white pieces preparation and have developed new and unexplored positions where Karjakin should not have deep theoretical knowledge and will feel uncomfortably. However, the surprise today did not lead to the desired result. Karjakin showed good preparation and a few precise moves (9..0-0 10 ... Na5 and 14..Dd5) did not allow any complications and got comfortable draw in the endgame "
    },
    "url": "https://gameknot.com/annotation.pl/carlson-karjakin-world-champion-2016-round-01?gm=62170",
    "gameName": "\"Carlson-Karjakin World Champion 2016 round 01\"",
    "players": "GM Carlsen  vs. GM Karjakin ",
    "opening": "Trompovsky attack (Ruth, Opovcensky opening) (A45)"
}