{
    "moves": {
        "1. e4 c6 2. g3": "This is really odd.  I like playing the caro kann because it is really solid and actually affords black a lot of aggressive attacking positions (contrary to popular belief).  Normally when I see some try to play anything but the actual main lines I generally assume they aren't very prepared to face the CK!",
        "2... d5 3. Bg2 dxe4": "All too happy to exchange the pawn and get my knight out with tempo.",
        "4. Bxe4 Nf6 5. Bg2 Bg4": "I like this better than Bf4.  I am trying to lure Nf3 as whites knight on f3 is almost always better than my LSB in a lot of Caro Kann positions.",
        "6. f3": "This is a bad move.  It unnecessarily opens up white's king side.",
        "6... Bh5 7. Ne2": "I think Nh3 might have been better.  Either way the pawn on f3 is not promising for white.",
        "7... e6 8. O-O Bg6": "I am taking time with development as white's handling of the opening is completely passive and non-threatening.",
        "9. Kh1": "Probably because he didn't want to see any checks on the g1-a7 diagonal. ",
        "9... h6": "To prevent any uncomfortable Nf4 or pawn bum rushes on my LSB.",
        "10. Nbc3": "I really don't like this move.  I'm sure it's ok but white is basically showing that he doesn't care about establishing a pawn center in the middle of the board.",
        "10... Bd6 11. d3": "Planning to put a knight on e4.  ",
        "11... Nbd7": "Finishing up development.",
        "12. Nf4 Bh7 13. Be3 O-O": "Development completed.  Let's start the party!",
        "14. Bh3": "Not really sure what the point of this is.  I think since white can't initiate a pawn break at all he is looking for play with his pieces.  Though there really is nothing for him to attack yet.",
        "14... Re8": "Preparing e5.",
        "15. Qc1": "Again, no idea what white is doing.",
        "15... Qc7 16. Ne4": "This looks like a solid move.  That square should be occupied by a knight.",
        "16... e5": "Starting to attack the center.",
        "17. Nxd6 Qxd6": "White trades his best piece.",
        "18. Ne2 Nd5": "I like this move.  I am preparing f7-f5.  White can't challenge my knight with c4 as the d3 pawn would become extremely weak.",
        "19. Bf2 Rad8": "Putting the other rook on the half-open d-file.",
        "20. a3": "White was probably considering c4 but didn't want ...Nb4 as a response.",
        "20... f5": "Claiming more space on the king side and getting ready for Nd5-f6 in case of c4.",
        "21. Nc3": "White offers doubled-c pawns.",
        "21... Nd7f6": "Preparing e4.",
        "22. Re1 Nxc3 23. bxc3": "Doubling white's c pawns.",
        "23... e4": "Initiating the pawn break.  White's king is pretty much completely exposed.",
        "24. dxe4 fxe4 25. f4": "White attempts to keep his king side somewhat secure at the expense of black gaining an extremely strong passed pawn. Aron would be so proud!",
        "25... Qd5": "The beginning of a tactical onslaught.  This obviously threatens a discovered check however I am planning on bringing the queen over to the h file.",
        "26. Bg2 Qh5": "This creates a number of uncomfortable problems for white.",
        "27. Re3": "White has to prepare for black to play Ng4.  I think he should have played something like Bg1. ",
        "27... Ng4": "Threatens mate on h2.",
        "28. Qg1": "Again, white could have played Bg1 here, (unless I'm missing something).  This is playable though uncomfortable for white as all of his pieces are tied to defense.",
        "28... Rd2": "Now threatening Nxf2.  Here white should have played Be1.",
        "29. Rf1": "Instead he plays Rf1.  This is a tactical oversight.",
        "29... Rxf2 30. Rxf2": "In order not to lose the queen white leaves the Rook on e3 hanging.",
        "30... Nxe3 31. Re2": "White loses his mind and the game.",
        "31... Qxe2": "White resigns."
    },
    "url": "https://gameknot.com/annotation.pl/caro-kann-attack?gm=59400",
    "gameName": "Caro Kann Attack",
    "players": "Me (1800) vs. TonyJordan (1752)",
    "opening": "Caro-Kann defence (B10)"
}