{
    "moves": {
        "1. e4": "This game was part of a Caro-Kann thematic mini, in which (in all my games as white) I practised the aggressive Advance Variation. In this particular game my opponent played the opening well, and I had to sacrifice two pawns to get an attack going. This led to some tactical complications,   eventually transposing to a winning endgame.",
        "1... c6": "The opening position for the mini.",
        "2. d4 d5 3. e5": "The Advance Variation",
        "3... Bf5 4. Nc3 Qb6": "A cautious and flexible defence. The main alternative, 4...e6, leads to wild complications early on after the \"Bayonnet Attack\", 5.g4.",
        "5. Bd3": "Thematic: white trades his good bishop, relying on the superior positioning of his queen. ",
        "5... Bxd3": "Black can try to win a pawn by 5 ...Qxd4, but usually ends up just getting his queen chased around.",
        "6. Qxd3 e6 7. Nge2 Nd7 8. O-O Ne7 9. a4 a6": "A strong move, as many of white's attacking options here involve Nb5-d6. ",
        "10. Qh3": "A standard posting for the queen, pressuring the white squares on the kingside. So far we are following Kotronias-Tukmakov, though black's next move deviates.",
        "10... c5 11. a5": "The black queen, by contrast, is chased to a less active position.",
        "11... Qc7": "Qd8 is more usual, but the black queen seems OK here too.",
        "12. Nd1": "White switches strategy, preparing to open the centre with 13.c4. This knight is shut out from the action for some time, though it emerges strongly in the endgame. I had an uncomfortable feeling of always needing an extra tempo to bring it to an active position, and not having one.",
        "12... Nc6 13. c4": "Planning ultimately to scythe through black's pawn centre with e6.",
        "13... dxc4 14. d5 exd5 15. e6": "The pawn reaches e6. Is it worth the two sacrificed pawns? Well white won, but there were probably improvements for black. I was banking on the principle that black was behind in development with his king in the centre, so forcing the centre open like this should be correct.",
        "15... Nf6 16. Nf4 Bd6 17. exf7+ Qxf7 18. Re1+": "One important plank in white's plan to stop black castling.",
        "18... Ne5 19. Ne6": "And that was the other one, with f4 to follow.",
        "19... Qg6": "Black has some counter-threats of his own, with the pin on the g-pawn and, in some variations, the threat of a back-row mate.",
        "20. Bf4": "White has to press on before black blocks the support for the Nd6.",
        "20... Ne4": "I actually thought 20 ...Ng4 was a strong move here, with unclear complications in which I had to be careful. After the present move I was reasonably confident that the simplifications would work to my advantage.",
        "21. Bxe5 Bxe5 22. f3 Ng5": "A miscalculation, enabling me to simplify with gain of material.",
        "23. Nxg5 Qxg5 24. Qe6+": "This was the point, which I suspect black had overlooked.",
        "24... Qe7": "Transposing into a losing endgame, but white's queen is too powerful to leave on the board.",
        "25. Qxe5": "to make sure of the d5 pawn, taking the sting out of the powerful cluster of black pawns.",
        "25... Qxe5 26. Rxe5+ Kd7 27. Rxd5+ Kc6 28. Nc3": "The knight re-emerges, holding the white position together.",
        "28... Rhe8": "I think that this was a mistake, and that black should have challenged for the d-file. The exchange of a pair of rooks might have increased his drawing chances. Allowing white to double rooks was dangerous given black's exposed king.",
        "29. Rad1 Re7": "To meet the threat of Rd7 followed by R1d6#",
        "30. Ne4": "The threat now is Rxc5#. Black can counter it, but the knight is nicely posted here.",
        "30... b5 31. axb6 e.p. Kxb6 32. Nxc5": "Not 32.Rxc5? Rxe4!",
        "32... Rae8 33. Ne4": "The knight moves back to its outpost, blocking the e-file.",
        "33... h6": "Possibly intending to undermine the f-pawn with a ...g5 thrust.",
        "34. Rc5 Rc7 35. Rd6+ Kb7 36. Rxc7+": "I would normally be reluctant to transpose into a single rooks ending, but the resulting tactics offered to bring the game to a swift conclusion.",
        "36... Kxc7 37. Rxa6 Rb8 38. Ra7+ Kd8": "...Kc6 might have been slightly better, with the possibility of supporting the c-pawn; the king will now be cut off on the back rank.",
        "39. Rxg7 Rxb2 40. Rh7 Rb3 41. Rxh6 c3 42. Rc6 Rb1+ 43. Kf2 Rb2+ 44. Ke3 c2": "....Rxg2 was the only chance to reduce the material deficit slightly.",
        "45. Kd2 c1=Q+ 46. Kxc1": "I thought my opponent might resign at this point, as that pawn was his last whiff of counterplay. However he decides to play on, as he is entitled to do. He starts, naturally, by clawing back one of the white pawns.",
        "46... Rxg2 47. Rc2": "Releasing the black king, but with the aim of driving the rook to an unfavourable position.",
        "47... Rg1+ 48. Kd2 Rh1": "The rook is  behind the pawn, but very short of space. My strategy will be to keep it there, and push the other pawn instead.",
        "49. Ke3 Ke7 50. Rg2": "Not fully consistent, but i wanted to occupy this file before black did.",
        "50... Ke6 51. Kf4": "In this position black resigned (1-0). Neither his king nor his rook seems to have any good move to stop white advancing his pawns."
    },
    "url": "https://gameknot.com/annotation.pl/caro-kann-tournament?gm=9864",
    "gameName": "Caro-Kann Tournament",
    "players": "orangutan (1740) vs. caimig (1682)",
    "opening": "Caro-Kann (B12), advance, Short variation"
}