{
    "moves": {
        "1. e4 c6 2. d4 d5 3. Nc3 dxe4 4. Nxe4 Nd7": "My favoraite way to play caro-kann defence. When played right this move is almost unbeatable",
        "5. Ng5": "The most aggressive line made famous by Zatiev and Karpov. In my opinion, white should play Bc4 before playing Ng5. \r\n\r\nThe point of Ng5 is that it punishes black for playing the haste ...h6",
        "5... Ngf6": "I have no problem with leaving the knight on g5.",
        "6. Bd3": "The bishop can be developed here or to c4 with good chances for white",
        "6... e6": "free the dark bishop and increases control of d5",
        "7. Ng1f3 h6": "!? a premature move that leads to difficult play for black. Normal is 7. ...Bd6 followed by 8. ...h6",
        "8. Nxe6": "a great scarifice that really mucks up blacks pawn structure and creates serious weaknesses along the light squares in front of the king",
        "8... fxe6": "8. .Qe7 is bad because of \r\n\r\n9. 0-0 fxe6 10. Bg6+ Kd8 11. Bf4! and White is dominating",
        "9. Bg6+": "this move is why ...h6 without proper preparation is a bad move",
        "9... Ke7": "Ugh I am packed in here like a can of sardines. \r\n\r\n",
        "10. O-O": "White has a dangerous attack for the knight sacrifice. Although it remains to be seen if it is enough to win. I think Black is ok what do you think?\r\n\r\n10. Bf4! gives black the most problems to solve as far as I can see black's best defence is \r\n\r\n10. ...Nd5 11. Bg3 Qa5+ 12. c3 Kd8 13. 0-0 Ne7 ",
        "10... Qc7": "developing the queen to her natural square and creating breathing room for the king to escape. This also prevents white from playing Bf4",
        "11. Re1 Kd8": "At first glance it looks like Black has hung the e6 pawn. However, the pawn is poisoned. If white plays\r\n\r\n12. Rxe6 then 12. ...Bd6! 13. Re1 Nf8! and black has driven off the attack",
        "12. c4": "12. Qe2 is also a good move for white if white does play it then\r\n\r\n12. ...Bd6! and black is ok",
        "12... Bb4": "This is better than 12. ...Bd6 because it denys White Queen use of the e2 square. If white tries:\r\n\r\n13. Re3 then 13. ...Nf8 14. Bd3 b2 and black on the verge of attacking\r\n\r\n",
        "13. Re2 Rf8": "This move is more active than Nf8 which is also playable. ",
        "14. c5": "a good move that cuts off the dark bishop",
        "14... Ba5": "preparing to save the bishop via c7",
        "15. a3 Qb8": "anticipating B4",
        "16. Rxe6": "if white is going to take the pawn then this is the time to do it. However, Black is slowly increasing the influence of his peices. Notice that Black has almost completed his development while White has half his army still on their orginal squares. \r\n\r\nIf I were white I would play 16. b4 instead to grab a lion share of the space on the queen side",
        "16... Nd5": "! a great move that creates room and attacking lines",
        "17. b4 Bc7": "Black is very cramped but very solid",
        "18. Re1": "tis a shame White has only two active peices. ",
        "18... a6": "an in between move to discourage white from playing b5",
        "19. Qe2 Nd7f6": "Increasing the influence of the knight but has the weakness of releasing control of e5. \r\n\r\nanother alternative is 19. ...Bf4 20. a4 Bxc1 21. Raxc1 Qf4 with a slight edge to white",
        "20. Ne5": "I think I might regret moving my knight to f6",
        "20... Be6 21. Nxc6+": "A good move that considerably weakens black defence plus it allows white to break through along the e file",
        "21... bxc6 22. Qxe6": "White is looking really good here is black done for?",
        "22... Qc8": "No he is not! Black forces the exchange or retreat of the queen and gains the draw. ",
        "23. Qe2": "White says no thank you but ....\r\n\r\nanother alternative for white is 23. g3 Qxe6 24. Rxe6 a5= ",
        "23... Qg4": "Black says I insist...\r\n\r\nImproves the positon of the queen and seizes initative",
        "24. Qd3 Ne7": "Ok! Ok! I will let you live but your bishop is mine",
        "25. Be4 Nxe4": "Munch! Finally that pesky bishop is gone",
        "26. Rxe4 Qg6": "a weak pin on the rook",
        "27. Qe2 Re8": "preparing for Nd5 and adds a defender to the e7 sqaure",
        "28. Bd2 Nd5": "The critcal point in the game. ",
        "29. Re1": "?? the game blunder. White had to play 29. Rxe8+ Qxe8 30. Qg4 for a draw",
        "29... Qxe4 30. Qxe4 Rxe4": "I told you that the exchange of Queens was forced",
        "31. Rxe4": "I am sure white thought to himself \"Ha Ha I got you now\"",
        "31... a5": "!! this wins because the white rook is blockaided behind his pawns",
        "32. b5 cxb5": "the rest of the game is elementary",
        "33. g3 b4 34. axb4 axb4 35. Kg2 b3 36. Re1 Ra4 37. Be3 Ra2 38. Kf3 b2": "and white resigns"
    },
    "url": "https://gameknot.com/annotation.pl/caro-kann-defense-b12?gm=29135",
    "gameName": "Caro-Kann Defense (B12)",
    "players": "freeman8201 (1812) vs. elyhim (1922)",
    "opening": "Caro-Kann (B17), Steinitz variation"
}