{
    "moves": {
        "1. e4 c6 2. d4 d5 3. e5 Bf5": "The usual set up for the Caro Kann Advance Variation. 3...e6 leaves black cramped.",
        "4. Nc3 e6": "4.Nf3 is strong also and leads to both sides fighting for the c file.  4. Nc3 announces a king side pawn attack on the black's light bishop.",
        "5. g4 Bg6 6. h4 h6": "6...h5 is also common and maybe a bit sharper. I am looking to get my c pawn rolling rather than open it up  just yet.",
        "7. f4": "Weakening his King side, which would come back to haunt him at the end of the game.",
        "7... c5 8. Bb5+ Nc6 9. Nf3 a6 10. Bd3": "10. BxN? leaves my light squared bishop quite strong, but he has now given me a tempo.",
        "10... cxd4": "With his king side pawns advanced I am not planning to castle king side, so I can live with retaking on g6 with my pawn if he exchanges bishops.",
        "11. Nxd4 Bxd3 12. Qxd3 Bb4": "My development is lagging and I need to get the bishop out before i can get out my N on g8. Exchanging on d4 leaves white's Q on d4, preventing my bishop from getting to b4, which would continue to doom my g8 knight.",
        "13. Nxc6 bxc6 14. Be3 c5": "Building my space advantage and threatening d4, a pawn fork!",
        "15. a3 Bxc3+": "White can't retake with the Queen due to the d4 fork, and now his queen side pawns are in bad shape.  White is able to get some strong play down the b file, but eventually must abandon it to protect his K side.",
        "16. bxc3 c4 17. Qd4 Ne7": "We now have a B vs. N game, and white's B will find it difficult to move around because of his pawns.",
        "18. a4 h5": "The doubled pawns on c file mean there is no future for my N on that side of the board. 18...h5! will lead to a permanent homes for my N on f4 and h5 in particular and some fixed white pawns as targets.",
        "19. g5": "19. gxh?? Nf5! with 4 pawn islands white would have had trouble protecting all those pawns, but now I have f4 as a powerful post and white's bishop is very \"bad.\"",
        "19... Nf5 20. Qb6 Qxb6 21. Bxb6 Ng3": "To prevent castling so that I can contest the b file.",
        "22. Rh3 Nf5 23. a5 f6": "White's rook will need to stay on the h file to defend his pawn. I am trying to open the f file for my rook. I don't want to castle because I need my K to protect my e pawn and be available to stop penetration of his rook down the b file.",
        "24. Bd4": "White recognizes now that my N is the better piece and hopes I will exchange it for his bad bishop (and undouble his pawns as well).",
        "24... fxg5 25. fxg5 Rb8 26. Bb6 Ne7 27. Ke2 Ng6": "Having g6 available to my N was crucial throughout the endgame. If his rook penetrates on the b file, my N can stay on f4 and protect g7, otherwise my K and Rook are tied down to its defense. ",
        "28. Kd2": "Avoiding a the King Rook fork  -- Nf4.",
        "28... Rf8": "I now have the f file and the stronger minor piece. White works in the next sequence to create a passed pawn to offset my advantage.",
        "29. Rhh1 Rb7": "29...Nxe5? 30. Bd4 and my g pawn falls. Rb7gives me flexibility to double on either the f or b files and keeps his B \"bad.\"",
        "30. Bd4 Rf4 31. Rab1 Rff7": "I can't afford to give up the b file because my a pawn will fall and probably my e pawn, too, and that would lose the game.",
        "32. Rb6 Rxb6 33. axb6 Rb7 34. Ke3 Kd7 35. Ra1 Nxh4 36. Ke2": "Avoiding Nf5 , forking King and Bishop and taking the  b pawn shortly after. I have avoided occupying g6 with my pawn because it allows my N to use it but also to protect it from f5.  On g6 it is more vulnerable to white's rook.",
        "36... Rb8": "A key move. I might even award myself a !  His far advanced, protected passed pawn looks bad for me, but my h pawn is equally dangerous.  I'm preparing to get my rook behind it, which will force him to abandon his a pawn.  Then my strong knight will begin to exert winning pressure.",
        "37. Rxa6 Nf5 38. Bf2": "38. Ra7 loses it's sting because the knight has g7 protected.",
        "38... h4": "Making a run for it will draw his rook back to his king side.  I held my breath through this whole next sequence! Leaving the pawn on g6, protected by the N, was essential.",
        "39. Kf3 h3 40. Ra1 h2 41. Kg2 Rh8 42. Rh1 Nh4+": "Taking my N is not helpful because my rook and king break through and combine to create another passed pawn.  I worked out many sequences here, and they seemed favorable to me.\r\nIf he took the pawn with his K, then we would exchange rooks on the h1 square, leaving his K even further from the center. He was smart to avoid that.",
        "43. Kg3 Ng6": "Again the value of leaving the g pawn at home -- extra room for my knight.",
        "44. Bd4 Ne7 45. Rxh2 Rxh2 46. Kxh2 Kc6 47. Kg3 Nc8": "???   47...g6 was winning! His b pawn is a fixed target that will eventually fall. And he cannot defend his 4 isolated pawns with two pieces. 47...Nc8?? allowed a draw, although white resigned.",
        "48. g6 Nxb6 49. Be3": "Exchanging allows d4! and my king eats a white pawn or two.",
        "49... Nc8 50. Bg5 Kd7 51. Bf6 Ne7 52. Bxg7": "White resigned as Nf5 forks the King and B.  But white would still have been able to draw (or even win!): I have to trade my N for the passed pawn (if my N roams I can't stop the passed pawn and protect my e pawn), as my e6 pawn is weak and I can't get my K around behind white's pawns."
    },
    "url": "https://gameknot.com/annotation.pl/caro-kann-advance-variation?gm=17461",
    "gameName": "Caro Kann Advance Variation",
    "players": "chual (1606) vs. johnd7 (1605)",
    "opening": "Caro-Kann (B12), advance, Short variation"
}