{
    "moves": {
        "1. Nc3": "Hi everyone, I just do not learn, I do not learn.  This time I castled on the queenside at precisely the wrong moment and got eaten alive by Master Freddy.   **Ah, Freddy, kittens have 9 lives as well as cats and I may well be back again Freddy, but now I lick my wounds as I contemplate the bite behind the Dunst Opening which transposes into a Sicilian Richter Rauzer attack to devastating effect.  I follow a line in the World DB that is favourable to the Expert that played it, but, aha, I was playing a Master.  Here is how I got ........... Mastered!\r\n\r\n**N.B.  My reference to kittens in this annotation relates to an article I wrote in the General Forums many moons ago regarding life on the Expert's playing field where I envisaged myself as a little white furry kitten that had strayed onto safari land where the big cats such as lions, tigers and hornets lurk, not to mention the blazing hot sun beamed out by lightotheright!  Not surprisingly I get a cattermauling!",
        "1... c5 2. e4 Nc6 3. Nf3 d6 4. d4 cxd4 5. Nxd4 Nf6": "5. ........... Nf6 - I choose Nf6 from the database because it is a developing move and bolsters d5.",
        "6. Bg5 e6 7. Qd2 a6 8. O-O-O": "8. 0-0-0 - I think this is where it all transposes into the Richter-Rauzer.  Maybe b5 is a good move here, but the most popular move in the db suggests Bd7 played by many an Expert and Master, so Bd7 it is.",
        "8... Bd7 9. f3 Be7 10. h4 h6": "10. ........... h6 - the dsb is driven back to e3.",
        "11. Be3 Qc7 12. g4 Ne5": "12. .......... Ne5 - puts pressure on f3.",
        "13. Rg1 Nc4 14. Bxc4 Qxc4 15. g5 hxg5 16. hxg5 Nh5": "16. ......... Nh5 - still in the database but this knight is gonna be dim on the rim.",
        "17. g6 f6": "17. ......... f6?! - this move was played by Chaves, Jorge A… (2130) v Maia, Marco Aur… (2165) and he went on to win the game, viz:-\r\n\r\n17. g6 f6 \r\n18. f4 b5 \r\n19. f5 b4 \r\n20. fxe6 bxc3 \r\n21. exd7  Kxd7 \r\n22. Qxc3 Qxc3 \r\n23. bxc3 Rac8 \r\n24. Rd3 Rc5 \r\n25. Nb3 Re5 \r\n26. Rd5 Rxd5 \r\n27. exd5 Rc8 \r\n28. Kb2 Rc4 \r\n29. Nd4 Rc5 \r\n30. Nc6 Rxd5 \r\n31. Nb8  Ke6 \r\n32. Nxa6 Rb5  \r\n33. Nb4 d5 \r\n34. a4 Rb7 \r\n35. Kb3 f5 \r\n36. a5 f4 \r\n37. Bd4 Bf6 \r\n38. a6 Rb8 \r\n39. a7 Ra8 \r\n40. Bb6 Ng3 \r\n41. Na6 Be5 \r\n42. Re1 Ne4 \r\n43. Nc5  Kf5 \r\n44. c4 Nd2  \r\n45. Kb4 Nxc4 \r\n46. Kb5 Bd4 \r\n47. Rd1 Nxb6 \r\n48. Rxd4 Nc8 \r\n49. Rxd5  Kxg6 \r\n50. Rd7 Rxa7 \r\n51. Rd8 Ne7 \r\n52. Rd6  Kf5 \r\n53. Nd3 Rb7  \r\n54. Kc4 g5 \r\n55. Rd8 Rc7  \r\n56. Kb3 Rb7  \r\n57. Kc4 Rc7  \r\n58. Kb3 f3 \r\n59. Rf8  Ke4 \r\n60. Rf4  gxf4 \r\n\r\nBut Freddy deviated with 18. Rh1 and because the knight was pinned to the rook on h1 I decided to castle queenside and Freddy said that it wasn't a very good move.  Here comes the punishment ..........\r\n ",
        "18. Rgh1 O-O-O 19. Nf5 exf5": "19. ........... exf5 - one interloping steed is captured, but it is the other one that causes mega probs.  Knight forkies on Henry and Glenda are threatened for starties!",
        "20. Nd5 Kb8": "20. ......... Kb8 - Henry evades a royal knight fork on b6, but ......",
        "21. Qf2 Qxa2 22. Ba7+ Kc8 23. Nxe7+": "23. Nxe7  ........... but I end up in Old Matey's Shadow and there is no way out but to wave the white flag.  Henry can only go to c7 where the Witch will nab him on b6 and turn him into dust.  What awesome stuff, Freddy - well played.  Joanne"
    },
    "url": "https://gameknot.com/annotation.pl/castling-into-it-again?gm=20916",
    "gameName": "Castling Into It Again!",
    "players": "easy19 (2267) vs. jstevens1 (1759)",
    "opening": "Novosibirsk opening (A00)"
}