{
    "moves": {
        "1. d4 d5 2. c4 dxc4 3. Nf3 b5": "These attempts to hang onto the pawn rarely end well.\n",
        "4. a4 c6 5. axb5": "My experience has been that sometimes white has to worry about Qa5+, so it is better to open the A file first.",
        "5... cxb5 6. b3": "Black who has no developed pieces can stay in the game with Nf6 or e6.\n\n6... e6 7. bxc4 bxc4 8. e3 Nf6 9. Bxc4 Be7",
        "6... cxb3": "\n",
        "7. e3": "Or Qxb3.  \n\nHere black can survive with 7... b4 8. Ne5 with a pretty good game for white. Nf6 9. Bc4 Be6 (9... e6 10. Qf3  Is crushing.) 10. Bxe6 fxe6 11. Qxb3",
        "7... a6 8. Bxb5+ Bd7": "Now 9. Bc4 has some problems where black can play Nc6 and threaten Na5 with a possible Bb5 to follow.",
        "9. Bxd7+ Nxd7 10. Qxb3": "Black's position is so bad that he is already losing, but he should probably play e6 or Nf6 and try to complete his development.\n",
        "10... Rb8 11. Qa4": "I like this move because I think that it is putting the most pressure on black.  The computer thinks that anywhere on the A file is fine and that Qc2 is good also.\n",
        "11... Qc8": "Again black neglects his development.  He is clearly losing now.\n\nIt should be obvious that the black queen on c8 will eventually be a target.  ",
        "12. Bd2": "O-O and Ba3 are just as good.\n",
        "12... Ngf6 13. O-O Rb6": "Black completely neglects his development.  His position is on the verge of collapse.\n\n13... e6 14. Rc1 Qb7 15. Na3 Be7 16. Rab1 Qa8 17. Rxb8+ Qxb8 18. Ne5 Qb7 19. Nac4 O-O 20. Nc6 Bd8 21. Bb4 Re8 22. Nd6\n",
        "14. Rc1 Qb7": "On this square the queen will come under attack.  14. ... Qa8 is better.\n",
        "15. Ba5": "Black should play Nd5 and just give up the exchange.\n",
        "15... Rd6": "Here White could play Rc7 or he could play ...\n",
        "16. Nbd2": "Na3, Ra2 and Rc7 are also good.\n",
        "16... Nd5": "\n",
        "17. Rab1": "Nc4 and Ne5 are also playable.\n",
        "17... Qa8": "Now White can win with either 18. Nc4, 18. Ne4, 18. Ne5 or 18. Bc7.",
        "18. Ne4": "Here 18. ... f5 prevents mate.\nIf 18. ... Re6  19. Nc5 Nf6  20. Ne5 Rd6  21. Ncxd7 Nxd7  2. Rc7 is a killer.  \n",
        "18... Rh6 19. Ne5": "Black resigns.  There is no preventing checkmate.  The black queen is not in a position to prevent Qxd7 without either getting captured or allowing Rc8 mate.  If any of the other pieces protect d7 then they get captured as well.  For example ...\n",
        "19... Rc6 20. Rxc6 e6": "Now Rxa6 or the very pretty alternative of 21. Rc8+ Qxc8 22. Rb8! Be7 23. Qxd7+",
        "21. Rxa6 Qc8 22. Ra8 Be7 23. Rxc8+": "Or 23. Qxd7+",
        "23... Bd8 24. Rxd8+": " Or 24. Qxd7+\n"
    },
    "url": "https://gameknot.com/annotation.pl/casual-game-http-www-itsyourturn-com?gm=59508",
    "gameName": "Casual Game, http://www.itsyourturn.com",
    "players": "John Coffey, Chess Player at Lar  vs. yadis ",
    "opening": "QGA (D21), Ericson variation"
}