{
    "moves": {
        "1. e4": "Hi everyone!\n\nAfter suffering Henry being buried alive, after a dogged rear-guard draw against Dynamic Dave, I think it is time for you to see Yours Truly go on the attack for a change.  This is my most recent game and it ended with my opponent's king getting trapped in the centre and then subsequently copping Old Matey.  So how did this happen?  Well, after my standard 1. e4, JJ plays a favourite defense of the Master Mater.  He really does lurve playing 1. ..... Nf6 in response to e4.  It is a very good defense, even though black's knight does get chased about a bit - don't knock it!",
        "1... Nf6 2. e5": "2. e5 - standard pawn stab.",
        "2... Nd5 3. d4 d6 4. Nf3": "4. Nf3 - development and a decent pawn centre, can I keep it though?",
        "4... Bg4 5. Be2": "5. Be2 - pin breaker.",
        "5... g6 6. Ng5 Bh6": "6. ..... Bh6?? - JJ's first big error.  This is gonna drop him a piece as you will see on the next turn.",
        "7. Bxg4 O-O": "7. ..... 0-0 - black decided to keep his king upright and to castle kingside.  Has he castled into it though?  His position is a little weak and I can find a way to exploit this right now.",
        "8. Ne6 fxe6": "8. ..... fxe6 - nacht but ......",
        "9. Bxe6+": "9. Bxe6+ - two black pieces are now en prise and JJ cannot save both.",
        "9... Kh8 10. Bxh6": "10. Bxh6 - I choose to take the bishop because now JJ's KR is under the hammer, not to mention a knight on d5.  I must win big material, I must.",
        "10... Nb6 11. Bxf8 Qxf8": "11. .... Qxf8 - JJ saves his knight but he is now down a whole rook and a pawn.  Over the next few moves, I complete my development so that I can put myself in a position to go for the jugular.",
        "12. O-O Nc6 13. exd6 cxd6 14. d5": "14. d5 - I do neglect my queenside development but I do greatly desire that Glenda lands on the a1-h8 diagonal, right where JJ's king is!",
        "14... Ne5 15. b3": "15. b3 - prophylaxis here.  I do not want either black knight to jump on a4 or c4.  When I move my own knight I will favour d2 as I may want to complete the pawn chain on the a2-g8 diagonal to prevent any counterplay type ingress on the c column by JJ's remaining rook or that Wicked Witch of the West.",
        "15... Qh6": "15. .... Qh6 - hmm, I expected JJ to try and challenge that a1-h8 diagonal while he had the chance!",
        "16. f4 Ned7 17. Qd4+": "17. Qd4+ - now Glenda does hop on to that diagonal.  I did again expect the Witch to move onto g7 to block her attack but no, a knight blocks that diagonal.",
        "17... Nf6 18. Nd2": "18. Nd2 - clearing the decks and heading for e4 to pile up upon the pinned knight on f6.",
        "18... Kg7 19. Ne4 Kf8": "19. ..... Kf8 - this move is gonna be suicidal, just you wait for it!",
        "20. Nxf6": "20. Nxf6 - wait for it!",
        "20... exf6 21. Qxf6+": "21. Qxf6+ - wait for it ......",
        "21... Ke8 22. Rae1": "22. Rae1 - NOW! - my final piece comes out to play and the black king is feeling very cold, and the sky is getting really dark above him.  There is no way he can stop the Chessic Grim Reaper wield his scythe, so on the next turn .......",
        "22... Rd8": "22. .... Rd8 - down comes .......",
        "23. Bc8#": "23. Bc8 MATE!! - .... Old Matey!  Although JJ did castle early doors, the weaknesses around his king and the lack of a piece and later on a whole rook proved too much and JJ eventually ended up being driven back to the centre and nailed there!  I hope you all have a good read and are enjoying your weekend.  Kind regards - Joanne"
    },
    "url": "https://gameknot.com/annotation.pl/caught-in-the-centre?gm=49813",
    "gameName": "Caught in the Centre!",
    "players": "jstevens1 (1915) vs. king-nothing (1367)",
    "opening": "Alekhine's defence (B05), modern, Flohr variation"
}