{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Bb5 a6": "3. ........... a6 - the most popular way of meeting the Ruy Lopez.",
        "4. Ba4": "4. ........... Ba4 - unlike Paolo in \"An Expert Lesson in K & P Endings\" my opponent does not opt for the Exchange Variation.  He decides to retreat his bishop to a4.  This is thought to be stronger than the Exchange Variation as Lighttotheright explained in my Paolo game.",
        "4... Nf6": "4. ......... Nf6 - develops a piece and hits at e4.",
        "5. O-O Be7 6. Re1 b5 7. Bb3 d6": "7. ............ d6 (a solid move - supports e5 and opens the diagonal of the lsb).",
        "8. c3 O-O 9. h3 Bb7": "9. ......... Bb7 - both sides continue to develop.",
        "10. d4 Re8 11. Nbd2 Bf8 12. a4 h6": "12. ........ h6 - stops an enemy knight or bishop going to g5.",
        "13. Bc2 exd4 14. cxd4 Nb4 15. Bb1 c5": "15 .......... c5 - black tries to expand on the queenside.",
        "16. d5 Nd7 17. Nf1 Nb6": "17. ........... Nb6 - all book moves up to here.",
        "18. axb5 axb5 19. Rxa8 Qxa8 20. Bd2 Qa5": "20 ......... Qa5?! - looks the best option in the database as a 1700  player drew against a 2000  player with the blacks after playing this move.  The other option Na6 loses according to the database.  In fact, in hindsight, Na6 seems a better option.  My queen could have been transported back to the kingside to have faced the oncoming mating attack - instead I would have needed to teleport her - not possible in chess.  So this will make my later f5 push which may have made sense with Na6 but not in conjunction with this move an absolute, utter disaster.",
        "21. b3 f5": "21 ............ f5?? - the losing blunder here.  My plan was to break up white's kingside pawns, leaving me with an overwhelming pawn majority on the queenside.  The e pawn would have been diverted from protecting d5, enabling my bishop to take the white pawn on d5 and threaten the pawn on b3.  But 22. Nh4!!! prevents this plan from getting off the ground.",
        "22. Nh4 fxe4 23. Bxe4 Re7": "23. ...... Re7 (defends g7 and threatens Bxd4 - I do take on d4 eventually but it will be much to my detriment!)",
        "24. Ng6 Rf7 25. Nxf8 Rxf8 26. Qg4 Nb6xd5 27. Qe6+": "27. Qe6  ......... The killer - I cannot avoid losing a piece for a pawn and on analysis after seeing the resulting position I decided not to continue the game, especially as my opponent is a 2300  strong MASTER!!"
    },
    "url": "https://gameknot.com/annotation.pl/caught-offside?gm=15746",
    "gameName": "Caught offside",
    "players": "chrisobee (2304) vs. jstevens1 (1614)",
    "opening": "Ruy Lopez (C88), closed, Leonhardt variation"
}