{
    "moves": {
        "1. e4": "Threats of discovered attacks/pins/self pins/royal forks----All these in one game? Pawn promotion, my pawns only in front of the opponents king!! For those who wish to enjoy a lesson of a game and learn while playing this one out, to never get to over confident.... After asking my opponent(during the middle of the game) if I may annotate this,(due to the unusual amount of threats and counter threats!) his defensive play went beyond to a point which I felt I was going to loose! Only thing bad about this game is I failed to end it in a classical type manner and missed many winning opportunities that could have ended it swiftly. Hoping the lessons in it and about it help us all. thekingni............",
        "1... e5 2. f4 exf4 3. Nf3": "This position was the stipulation of the thematic mini-tournament which cavalcanti conceived. The King's gambit accepted or also known as the King's Knight's gambit.",
        "3... Be7": "This is \"book\" according to the computer analysis. I, do not know much about it....my play is from common sense and out of my admiration of the earliest masters. Capablanca and the like.\n",
        "4. Bc4": "Still book but let me say that my opponent seems to want an accelerated development. So then I consider here and now that my opening shall become closed and attempt to neutralize all range of movement which his pieces may initially acquire.",
        "4... d6": "So now the reasoning begins and the book gets chucked out the window........so says the analytic computer(not me!) The e7 bishop is set to assist only with my king side pawn majority, the move played therefor establishes the queen side bishop to be the most mobile!",
        "5. d4": "My opponent chooses the exact thought which I expressed earlier....development, development, development. He builds a strong central and strategical position which I will attempt to dismiss.",
        "5... g5": "His king knight is now limited to 2 out of 8 possible moves and begins the advance of the majority.",
        "6. O-O": "Staying in theme and protecting the king to the side which I should have difficulties projecting my own pieces.",
        "6... Nd7": "Attempting three things... 1. developing.  2. central governance. 3. future attempt at restriction of the bishops range.",
        "7. Nc3": "Good developing move, perhaps planning central expansion.",
        "7... Nb6": "Tho most would refrain from moving pieces twice so early in the game due to getting behind in development, I set the standard of my opening to be a restrictive one(to the opponent) and will adhere to that goal. In addition to deeming the opening theme a failure if I deviate from my intentions.",
        "8. Bb3": "Was attacked and now is in a cramped position.",
        "8... Bg4": "More so a need for developing while toying with 0-0-0 in the future, plus enjoying some spacial benefits.",
        "9. h3": "Oops, his theme changed first! Now his wishes may be in the restriction of my space!",
        "9... Bh5": "I'll keep the pin and reduce his central dominance.",
        "10. Qe1": "So much for the pin, but where is his opening theme? Shifted from rapid development to a quick attempt to control e5? Hey, I'm not a master, but please stick to your guns as much as possible, at best to lessen the confusion of the upcoming middle game.",
        "10... c6": "This was done at this time to benefit the center and to lessen range that the knight may utilize.",
        "11. e5": "Here comes the new shift from deployment to central aggression.",
        "11... d5": "In keeping with my continuous blockade theme and making the queen side like a BP oil slick! Needing removal and repositioning.",
        "12. g3": "This is where I saw the chance to rid myself of a doubled pawn and seek compensation for the weaknesses in whites king side.",
        "12... fxg3": "So take it I did!",
        "13. Qxg3": "The move allowed time to return to the attack of center and develop, plus g5 is suspect.",
        "13... Nh6": "I kinda played this in a panic....not really analyzing the potential pin rook to g8 may present and finally taking my first step from playing the Python, to troop movement, but figured that it had to be near the area of transition to the middle game so why not do it!",
        "14. Kh1": "Computer analysis stated this as a mistake and that the best move should have been Nxg5 which was some of my earlier fear(the pawn on h3 would help support the knight till the queen departed winning a pawn!) Felt it but did little to research it!",
        "14... Nf5": "Since the queen will not attack less she whither, my men begin to flourish some.",
        "15. Qf2": "So here a repositioning to be ahead of whites necessary repositioning of those conjunctive clogged right side mess. A real tempo saver so to speak.",
        "15... Bg6 16. Ne2": "Trying to untangle the bangle.",
        "16... h5": "A hilarious pawn majority.",
        "17. c3": "Now opening the bishop to join the best spaces.",
        "17... Ng7": "Two things 1. keeping range diminishing the priority 2. hoping to expand the Bishops range to begin at e4.",
        "18. h4": "A free pawn?",
        "18... gxh4": "OK. I know....Dpawns, but maybe they can work.\n",
        "19. Nf4": "So now the plan was to expand his pieces range which was taken from him offering the pawn for the plan.",
        "19... Be4": "Pinned!",
        "20. Kh2": "Unpinned!",
        "20... Nf5": "Freedom!!!!! Good position, just the range of all pieces should tilt the edge to black.",
        "21. e6": "I can only hope that my opponent remarks/comments on this because I was not able to clearly see the intent fully of this move.",
        "21... fxe6": "I took it realizing that the knight could be driven back into a self pin.",
        "22. Nxe6 Qd6+ 23. Nf4 Nd7": "This move is to offset the lack of the knight to be willing to participate.",
        "24. Bc2": "Well, and to replace the Bishop if necessary.",
        "24... Nf6 25. Ne5": "Also helps to prevent a royal fork from Nf6-g5+",
        "25... Ng4+": "This move removes the doubled pawns and reacquires the pin.",
        "26. Nxg4 hxg4 27. Kg1": "Unpins himself.",
        "27... g3": "Attacks the queen and surrounds the king.",
        "28. Qe2 h3": "Want ultimately to act like I'm his pawns but enough of that!.... I just need to open this side up and use the theory that space and time have to offer.",
        "29. Bxe4 dxe4 30. Qxe4 h2+ 31. Kh1 g2+ 32. Kxg2 h1=Q+ 33. Rxh1 Rxh1": "Neat, take me with the king and get royal forked.",
        "34. Qxf5 Qh6 35. Qg6+": "Here is the move I missed and my opponent crept gradually back into the game",
        "35... Qxg6+ 36. Nxg6 Rd1": "rook to a7 was best",
        "37. Nxe7": "Can't take back or  the discovered attack B-g5+ wins the rook",
        "37... Kd7 38. Nf5 Rg8+ 39. Ng3 Re8 40. Kf2 Ree1 41. Ne2 Reh1 42. b3 Ke6 43. a4 Rh2+ 44. Kf3 Rf1+ 45. Ke3 Rh3+ 46. Kd2 Kf5 47. Bb2 Rf2 48. Re1 Ke4 49. Bc1 Rhh2 50. Kd1 Kf3 51. Nf4 Rfc2 52. Re3+ Kxf4 53. Re2+ Rxc1+": ""
    },
    "url": "https://gameknot.com/annotation.pl/cavalcantis-mini-tournament-xv?gm=37842",
    "gameName": "cavalcanti's mini-tournament XV",
    "players": "hippoinamarsh (1669) vs. thekingni (1748)",
    "opening": "KGA (C35), Cunningham, Bertin gambit"
}