{
    "moves": {
        "1. Nf3 d5 2. d4 Nf6 3. e3 g6 4. b3 Bg7 5. Bb2 Nc6": "As White, I've been experimenting with this Zukertort setup.",
        "6. a3": "To prevent the N from coming to b4.",
        "6... O-O 7. Be2 Bg4 8. Nbd2 a6 9. O-O": "I think the position here is fairly even.  White may be very slightly better because the c-pawn is not obstructed.",
        "9... Bxf3 10. Nxf3": "I was surprised that Black voluntarily swapped B for N.",
        "10... Ne4 11. Rc1 b5": "This doesn't really stop c4, so I'm not sure of Black's intention here.",
        "12. c4 dxc4 13. bxc4 bxc4 14. Bxc4 Na5 15. Bd3": "I think Black's position is now slightly worse after decentralizing the Queenside N.",
        "15... Nf6 16. Qc2 c6 17. Rfd1 Qb6 18. Bc3 Nd5 19. Bxa5 Qxa5 20. Qc5 Qxc5 21. Rxc5": "White can now double Rs.",
        "21... e6 22. Rxc6": "Free pawn.  Not sure why Black allowed this.",
        "22... a5 23. g3": "The K needs space.",
        "23... Rfb8 24. a4 Rb4 25. Bb5": "This blocks the b-file and makes it difficult for Black to coordinate Rs.",
        "25... Ne7 26. Rcc1 Nd5 27. Rd2 Rb3 28. Rdc2 Nb4 29. Rd2 h6 30. Kg2 g5 31. Ne1 Rd8 32. Rdd1": "Otherwise e5 is uncomfortable.",
        "32... Na2 33. Rca1 Nc3 34. Rd3 e5 35. Bc4 e4 36. Bxb3 exd3 37. Nxd3": "White comes out of the R trade with another pawn.  Now the d-pawn is a passer.",
        "37... h5 38. Rc1 Ne4 39. Rc7 h4": "Black opts to play aggressively, but this will cost another pawn.",
        "40. Rxf7 Kh8 41. gxh4 gxh4 42. Rf4": "This fork causes additional problems for Black.",
        "42... h3+ 43. Kxh3 Ng5+ 44. Kg2 Bh6": "Now White is ahead four pawns.  The endgame is easily won, but exchanges will need to be made to reduce complications.",
        "45. Rh4 Kg7 46. Ne5": "Threatening f5.  If the Black N goes somewhere safe, RxN, KxR, and Nf7+ follow.",
        "46... Rb8 47. Bc4 Nh7 48. Rg4+ Ng5": "This is a mistake.  Black essentially pins the N in a position where it can be exploited.",
        "49. h4 Kh8 50. hxg5 Bf8 51. Ng6+": "This allows further simplification.",
        "51... Kg7 52. Nxf8 Rxf8": "White now has the original four pawns plus a minor piece.",
        "53. Re4 Kg6 54. Re5": "Even with the R, there is no way for Black to stop all of the pawns.",
        "54... Kg7 55. Rxa5 Kh7 56. Bd3+ Kg7 57. Ra7+": "This check forces the K to the back row.",
        "57... Kg8 58. Be4 Kh8 59. Ra8": "This moves forces the exchange of Rs.  After this, White can simply promote a pawn.  Black resigned shortly.",
        "59... Rxa8": ""
    },
    "url": "https://gameknot.com/annotation.pl/cedricparkers-mini-tournament-ii?gm=62471",
    "gameName": "cedricparker's mini-tournament II",
    "players": "mmoody95 (1837) vs. xixa01 (1700)",
    "opening": "Reti opening (A06)"
}