{
    "moves": {
        "1. e4 e6 2. Nf3 c5 3. Bc4 a6 4. O-O b5": "Black gains a tempo here because of the position of White's B.",
        "5. Be2 Bb7 6. d3 Nf6 7. Bg5 Be7 8. Nbd2 d6 9. b3 Nbd7 10. a3 O-O 11. Rc1": "Both Black and White are fully developed.  Now the maneuvering begins.",
        "11... h6 12. Bh4 Re8 13. c4 b4": "If Black plays bxc4, he will isolate his a-pawn and also give White's N a nice spot on c4.",
        "14. axb4 cxb4 15. h3 Nc5": "Now Black is the one who gets the good square.",
        "16. Bg3 e5 17. Nh4": "The Nh4 is loose.  It is protected once (B), but attacked twice (B+Q).  Right now those pieces are shielded, but they can be unleased.",
        "17... Nfxe4": "Black wins a pawn with a discovered attack on the N.",
        "18. dxe4 Bxh4 19. Bh2 Nxe4": "Now a second pawn falls.",
        "20. Nxe4 Bxe4 21. Bf3 Bxf3 22. Qxf3 Be7": "Black is now two pawns to the good.  Black's d-pawn is backward and a target, but White's B is not a very good piece right now.",
        "23. Rfe1 Qc7 24. Kh1 Rac8 25. Re4 f6 26. Qf5 Bf8 27. Rg4 Qf7 28. Rd1 Rc5 29. Rh4 e4": "Discovered attack on the Q.",
        "30. Qf4 g5": "Followed by a pawn fork.",
        "31. Qg3 Kh7": "Now the Rh4 has no safe squares.",
        "32. Rg4 h5 33. Rh4 gxh4 34. Qxh4": "Now Black is up considerable material--at the cost of an exposed K.",
        "34... Re6 35. Re1 Qg6 36. f3": "exf6 might have been better.  It doesn't lead to the loss of the exposed Re3.  If exf6 and White plays Rxe3, Qxg2# is satisfactory!",
        "36... e3 37. g4 Kg7 38. Bg1 Rce5 39. f4": "Now White's K is also exposed and the f4 pawn is loose.",
        "39... Qe4+ 40. Kh2 Qxf4+ 41. Kg2 hxg4 42. Qg3 Qxg3+": "It's to Black's advantage to trade.",
        "43. Kxg3 gxh3 44. Kf4 Kg6 45. Kg4 Rg5+ 46. Kxh3": "This mistake is fatal.  White's K is now trapped against the edge of the board.",
        "46... Re7": "White resigned in view of the unstoppable Rh7# coming next."
    },
    "url": "https://gameknot.com/annotation.pl/cedricparkers-mini-tournament-ii?gm=62757",
    "gameName": "cedricparker's mini-tournament II",
    "players": "doublel (1512) vs. mmoody95 (1834)",
    "opening": "French defence (C00)"
}