{
    "moves": {
        "1. Nf3": "Recently a friend uncovered in his basement an old chess club magazine which had been gathering dust for a good twenty years. It contained my  first game in the Belgian inter-club competition. The game itself also originated in a basement, so truly a case of \"Cellar Chess\"! The cause of this unusual playing venue was an administrative oversight: Our club (KGSRL) was at that time the largest club of Belgium and brought 13 teams to the inter-club competition. The request to have only half of the teams play at home on any competition day was not taken into account in the schedule and so some 130 players came together in the clubhouse when we played home. The teams in first division played upstairs and the teams from the lowest echelons had to play in the cellar... Best of were the guys playing in 4th division: they got to play in the bar.  \r\n",
        "1... d5 2. d4": "In those days I opened virtually only with 1. d2-d4. Against a relatively strong opponent (rated 1928 ELO KBSB, when I was still unrated) I did not want to deviate from the familiar path, so back to the queen's pawn opening.  \n",
        "2... Nf6 3. c4 g6 4. cxd5 Nxd5 5. e4": "This resembles the Grünfeld defence, except that white has developed Nf3 instead of Nc3, so black can not  exchange knights here  \n",
        "5... Nf6": "5... Nb6 seems somewhat better: The knight on f6 shields direct pressure from Bg7 and forms a target for the advance e4-e5  \n",
        "6. Nc3 Bg7 7. Be3": "Played to support d4 and also with the idea of continuing with Qd2 and Bh6 in order to exchange the strong bishop on g7  \n",
        "7... O-O 8. Qd2 Re8": "This does not look very useful. c7-c5 seems a better way to attack the white center than preparing for e7-e5. May be black moved the rook so that Bh6 could be countered by Bh8.   At the chess-club we had lessons by a master and this game got reviewed there - which is also why this game made it into the club magazine by the way. The master - Bernard de Bruycker - suggested 8... Ng4 for black.   White can then continue with for instance 9. Bf4 and 10. h3 but I was probably lucky black did not play this: I had completely overlooked that reply during the game, and so the move would have come as a shock and been very unsettling. At that time I resolved that I would very quickly scan all legal moves of my opponent before playing my move, but it is something I have not been able to stick too in practice... :-)  \r\n",
        "9. Bc4": "Black's previous move has made this bishop move even stronger. Covering f7 with 9... e7-e6 does not seem in line with 8... Re8 \n",
        "9... c6": "Controlling d5 and preparing a queen side expansion with b5  \n",
        "10. Bh6": "There is no reason to deviate from the plan: eliminate the strong bishop and weaken the black castle. \n",
        "10... Nbd7": "Better was to expand immediately on the queen side with 10... b5. The knight move is weak and white could have won a pawn with 11. Bxf7 Kxf7 12. Ng5 Kg8 13. Ne6 Qb6/Qa5 14. Nxg7 Rd8 15. Ne6 Re8 16. Bf4 threatening Nc7.  \n",
        "11. Bxg7": "White is focused on his plan and misses the tactical opportunity offered. Another factor contributing to the oversight may have been that I used to play quick in the opening in order to avoid time trouble - something I was susceptible to. Even though - if my memory serves me right - that year was one of the last that the first time control was still the ancient 40/150.  No wonder we got home late back then... it was not always the 'après échecs'  \r\n",
        "11... Kxg7 12. Ng5": "Pressuring f7 to induce e7-e6, a move which blocks black's bishop and weakens f6. Note that black can not defend with 12... Rf8 because of 13. Bxf7 Rxf7 14. Ne6 forking king and queen.  \n",
        "12... e6 13. e5": "White stops a later e6-e5 and attempts to get control over the weak squares d6 and f6.  \n",
        "13... Nd5 14. O-O-O": "White is going for the black castle, so he gets his king out of the way and involves the rook on a1. May be this is too straightforward as it immediately gives black a target on the queen's side. 14. h4 seems like a less committal alternative.  \n",
        "14... Nxc3": "Uncovers the white king, but gives d4 some support in return.  \n",
        "15. bxc3 b5 16. Bb3": "The idea of Bb3 was to keep out of the way of the white rooks which will attack the black castle and to give the white king some cover. But in view of a7-a5-a4 this seems like a tempo loss.  \n",
        "16... Nb6": "16... a5 and 17... a4 was another idea. Also 16... c5 to undermine e5 seems valid.  \n",
        "17. Ne4": "This knight stops 17... f7-f6 and eyes the d6 square.  \n",
        "17... Bd7": "17... Bd7 frees space on the back rank but the move does not seem to fit in a specific plan. 17... a5 or 17... Nc4 would continue the attack on the white king. If white exchanges Bxc4 after 17... Nc4 the black rooks get an open b-file towards the white monarch.  \r\n",
        "18. h4": "Now white's attack gains momentum. \n",
        "18... Rh8": "Black thinks more about defense than about furthering his own counterattack.\n",
        "19. h5 Qe7": "Black connects his rooks, useful when the h-line would be opened. Also the queen could join in the attack on the white king with Qa3+  \n",
        "20. h6+": "White keeps the h-file closed and gets control over a weak square near the black king who is forced to lock his own rook up.  \n",
        "20... Kf8 21. Nd6": "Blocks the access of the black queen to a3. White contemplated 21. Nc5 since then the white knight could not so easily be challenged by the black one, but decided that the d6 square was juicier as it is closer to the black king.\n",
        "21... Nc8": "Black is trying to reduce the pressure. \n",
        "22. Qf4": "The white pieces are concentrating on the black king.\n",
        "22... Be8": "Puts an extra defender on the weakness f7 but removes one from e6. Black should probably immediately have exchanged the knights instead of postponing this until his next move. \n",
        "23. Rh3": "A rooklift to train more forces on the black king. \n",
        "23... Nxd6": "A fatal mistake. 23... f7-f5 was possible since white can not take en-passant: Nd6 is attacked twice. White's attack would have been slowed down, needing g2-g4. Now however e6 gets uncovered and becomes a new target. As a result black's position collapses quickly.  \n",
        "24. exd6 Qd7 25. Re1": "The rook takes aim at e6 and there is nothing black can do about it - his pieces lack mobility.\r\n",
        "25... Rd8 26. Rxe6 a5": "This leads to checkmate in three but the alternatives were not pleasant either. Only giving up a lot of material postpones immediate loss. It is also too late for f7-f5 as white can play around the obstacle:  26... f5 27. Qe5 Rg8 28. Rxe8+ Rxe8 29. Qf6+ Qf7 30. Qxf7# \n",
        "27. Qf6 Rg8 28. Rf3": "White misses a pretty mate in two with 28. Qe7+ Qxe7 29. dxe7#  \n",
        "28... a4 29. Re7": "Again misses the pretty conclusion 29. Qe7+ and 30. dxe7#  \n",
        "29... axb3 30. Qxf7+": "This time the queen sacrifice was easy to see, checkmate next move 30. Bxf7 31. Rxf7#. Notice the unusual grouping of pieces around the black king after 31. Rxf7#: All pieces except the white king have gathered around him.  "
    },
    "url": "https://gameknot.com/annotation.pl/cellar-chess?gm=22549",
    "gameName": "Cellar Chess",
    "players": "algol  vs. black ",
    "opening": "Reti opening (A06)"
}