{
    "moves": {
        "1. e4": "A long game, with many edged to edged situations.",
        "1... e5 2. d4": "center game",
        "2... exd4": "most usual answer",
        "3. c3": "gambit",
        "3... dxc3": "accepted",
        "4. Nxc3": "I like this line for white has really fine possibilities of attack due to the many open lines and diagonals in exchange of his pawn",
        "4... Bb4": "main line",
        "5. Bc4": "White will probably get an isolated pawn in exchange of a strong attack",
        "5... Bxc3+": "black opts for the trade",
        "6. bxc3 Nc6 7. Nf3": "developping",
        "7... d6": "To free the LSB",
        "8. O-O Bg4 9. Qb3": "Fork attack on b7 and f7",
        "9... Na5": "Probably a mistake. Black neglects the attack on f7",
        "10. Bxf7+": "Now material is equal, White is ahead in developpement, has a better control of the center but the white queen, the LSB and the f knight are Under menace and, important for the game end, black's pawn structure is far better.",
        "10... Kf8": "For the moment black is forced to move the king.",
        "11. Qa4": "White proposes to trade his LSB against black's a knight.",
        "11... Bxf3": "But black chooses to trade on the kingside to weaken the white king",
        "12. gxf3 Kxf7 13. Qxa5": "Now, the first trading sequence is fisnished, the market is over. Both Kings are unsafe, material is equal, white is better on the center and more developped (having therefore more attacking possibilities) but his pawn structure is a disaster.",
        "13... h6": "To prevent 14. Bg5",
        "14. Qd5+": "Fork attack between king and b7",
        "14... Kf8": "The king has to retreat",
        "15. Qxb7": "Black pawn structure is not as good now",
        "15... Ne7": "Black develops",
        "16. Rd1": "to take control of the semi open file",
        "16... Ng6": "Progressing toward the white king. A queen with a faithfull knight on her side can give dangerous attacking possibilities if the opposite king is weak, which is the case.",
        "17. Rd5": "Rook on open file and open line : as mobile as possible. Another candidate move was Be3 to menace a 7 but the bishop has to stay on the c1 h6 diagonal to prevent Qg5",
        "17... Ne5": "Aiming at f3 and preventing 18. Rf5+",
        "18. f4": "to advance a pawn, toward the black king and enable Rf5",
        "18... Nf3+": "I judged that this move was not that dangerous, for the knight alone cannot do much arm.",
        "19. Kg2": "19. ... Qg5+ is impossible, so that this move seemed ok",
        "19... Nh4+ 20. Kf1": "Now the knight cannot carry on annoying the white king.",
        "20... Rb8": "To take control of the open file...",
        "21. Qxa7": "... at the price of one pawn. ",
        "21... Ra8": "21. ... Rb6 might have been better (to prepare 22. ... Qb8)",
        "22. Qd4": "Aiming at the black king.",
        "22... Nf3": "Fork attack between h pawn and queen",
        "23. Rf5+ Kg8": "Otherwise 24. Qxg7 and black is in trouble",
        "24. Qd5+": "The queen is now safe",
        "24... Kh7": "forced move",
        "25. Rh5": "To protect the h pawn. If 25. ... g6 26. Qf7+ and prepare a trap for the knight",
        "25... Rf8": "Preventing 26. Qf5 ",
        "26. Rh3": "The knight has little possibilities",
        "26... Nh4": "Only move",
        "27. Qh5": "The knight is trapped",
        "27... Nf5 28. exf5": "the white pawn structure is a disaster but white is now well ahead in material and has a threat on the black king (menacing 29. Qg6+)",
        "28... Ra5": "The f5 pawn is condemned",
        "29. Qg6+": "At least if 29 Rxf5 the queen is not Under menace but it achieves little otherwise",
        "29... Kh8 30. Bb2": "Bishop on the big diagonal. It also enable the a rook to enter in the battlefield",
        "30... Rf6": "I oversaw this move.",
        "31. Qg4": "Still aiming at g7, protecting the f4 pawn and permiting the h rook to go on tour anywere on line 3.",
        "31... Raxf5 32. Rh4": "The trade on f4 is no problem for white, for it would exchange 2 rooks against one pawn and the queen, letting white ahead in material.",
        "32... Qb8": "So that black opts for something else, preventing 33. c4",
        "33. Rb1": "enabling 33. c4",
        "33... Qb5+": "Black counterattacks and can be dangerous for his 3 hight pièces are well connected and all aiming at the king.",
        "34. Qe2": "White's looking for a trade...",
        "34... Qd5": "... which black avoids",
        "35. f3": "To make space for the king and enable Rg4 or Qe4",
        "35... Rf5xf4": "Black takes one pawn",
        "36. Rxf4": "With 3 pawns advance the trade is still ok for white.",
        "36... Rxf4 37. Rd1": "White is well ahead but cramped. his king is unsafe, the DSB and the a pawn are unprotected. One false move can lead to a disaster. I spent a lot of time thinking about each move untill the end of the game.",
        "37... Rxf3+": "White loses one pawn more",
        "38. Ke1": "The plan is to send the white king on the left side where it would get some protection more.",
        "38... Qh5": "attacking the h pawn...",
        "39. Rd2": "... which white doesn't want to lose (else black will have 2 passed pawns on g and h lines)",
        "39... Qg4": "menacing 40. ... Qg1+ 41. Qf1 (forced move) Qxf1+ mate",
        "40. Qe8+": "diversion",
        "40... Kh7": "No choice",
        "41. Re2": "enabling the white king to flee on d2",
        "41... Qg1+": "white has only one move",
        "42. Kd2": "one pace toward the left wing",
        "42... Qg5+ 43. Kc2": "another pace toward the left wing : the pawns will protect his majesty and, as a fair king, he'll protect his subjects in reward.",
        "43... d5": "A good move, I believe. it doen't seem dangerous at first sight but black controls the important e4 square",
        "44. Qe7": "The queen is in situation to defend the left wing, menaces c7 and White proposes a trade ",
        "44... Qg6+": "... which black wisely refuses",
        "45. Kb3": "No other place (if 45. Kb1 or 45. Kc1, 45. ... Rf1+ 46. Re1 Qg1 and white loses a rook.",
        "45... Qb6+ 46. Qb4": "\"Rally to my white plumet\" said Henri IV of France. Now the white pièces are grouped around the king. and will be harder to attack. But the white rook is still unprotected ",
        "46... Qc6": "Black carries on attacking but less dangerously now.",
        "47. a4": "So that white can advance a bit.",
        "47... Rf6": "All the black pièces are protected.",
        "48. Qb5": "White wants to trade",
        "48... Qd6": "Black again refuses",
        "49. Ba3": "White's plan is to progress with whole army on the left wing to promote a pawn or force black to exchange.",
        "49... Qf4": "Black tries to attack the white army by the rear",
        "50. Qxd5": "The annoying black soldier meet his doom.",
        "50... Rf5": "Queen Under attack",
        "51. Qe4": "As usual when in difficulty, white proposes a trade... and pin the rook",
        "51... Qf1": "Menacing a rear attack",
        "52. a5": "I judged that the danger was not that big (the black rook is pinned)  and that the progression could carry on.",
        "52... Kg8": "To unpin the rook",
        "53. Qc4+": "No mating attack was possible so long that the queen and the rook were on the same file, so that I have to find another tactic. The rook is protected.",
        "53... Kh7": "if 53. ... Rf7, rhe rook would have been pinned again.",
        "54. a6": "Only 2 more steps",
        "54... Qd1+": "The rear attack Iwhite feared but I'm ready for it",
        "55. Kb2 Ra5": "I had overseen this move and felt suddenly unsecure",
        "56. Qe4+": "The queen is back again on the same file than the rook.",
        "56... Kg8 57. Rf2": "Mate menace. Black has only one available move to counter it without loosing a piece straight ahead (I believe)...",
        "57... Qd7": "?? Black should have plaid 57. ... Rb5+ 58. Kc2 Rb8. Maybe there are other solutions but I cannot find them.",
        "58. Rf8#": "White finally manages to give the mate but black fought very well in the second half of the game, always threatening white despite his late in material."
    },
    "url": "https://gameknot.com/annotation.pl/center-game-w?gm=51198",
    "gameName": "center game (W)",
    "players": "ptitroque (1757) vs. kwaster (1730)",
    "opening": "Danish gambit (C21), Collijn defence"
}