{
    "moves": {
        "1. b3": "Larsen's Opening. It is named after the Danish grandmaster Bent Larsen. ",
        "1... e5": "A common reply.",
        "2. Bb2": "White attacks the e pawn.",
        "2... Nc6": "Black defends.",
        "3. e3": "Usually this it to preparing to play Bb5 to exchange on c6, thus removing the defender of e5, but white has other ideas in this game.",
        "3... Nf6": "Black develops.",
        "4. Nf3": "So does white.",
        "4... e4": "Black advances.",
        "5. Nd4": "Knight has to move.",
        "5... Nxd4": "Black takes.",
        "6. Bxd4": "White takes back.",
        "6... c5": "Black hits the bishop.",
        "7. Bb2": "Bishop retreats.",
        "7... Be7": "Black develops.",
        "8. d4": "This move already takes me out of my opening databases. 8. c4 is the only move I can find in the position on my opening databases.",
        "8... O-O": "Black completes his King-side development.",
        "9. Be2": "White prepares to castle maybe?",
        "9... b6": "Black prepares to develop the white squared bishop.",
        "10. d5": "White gains space in the centre. There is also the threat of d5-d6 winning the bishop, hence black's next.",
        "10... Re8": "To give space to his bishop on f8.",
        "11. c4": "White has no quite a nice pawn phalanx. ",
        "11... Bb7": "I don't like this move. The bishop seems doomed to be passive here. I think I'd be tempted to play d6 here, and develop the bishop to d7 to help prepare b6-b5, or to f5, maybe followed by Nf6-d7-e5-d3, where it will be supported by the pawn which is backed up by the Bf5. Black seems to be just developing without a concrete plan..",
        "12. Nc3": "White starts to build up on the e4 pawn.",
        "12... a6": "Presumably played to prevent Nc3-b5.",
        "13. Qc2": "White is now attacking e4 twice, it is defended only once.",
        "13... Bf8": "This opens the e file for the Re8, meaning the e4 pawn is now protected twice. d6 may have been a more active square for it though.",
        "14. g4": "Rather wildly hitting out on the king-side. I can't help thinking it shouldn't work, but it does.",
        "14... h6": "This looks like a dreadful move, in some respects, helping white open up files on the king-side. However, if say d7-d6 creating d7 as a flight square for the knight, or Kh8, creating g8 as a flight square, after 15. g4-g5 and the knight runs, white captures on e4 with the knight, which also protects his pawn on g5. So I am not sure black had anything better. ",
        "15. h4": "Renewing the threat of driving the knight away followed by taking on e4.",
        "15... Qe7": "So black wisely protects e4 again.",
        "16. O-O-O": "Preparing to bring his other rook across to the king-side.",
        "16... d6": "Preparing to give his knight a flight square in d7. I tend to prefer Kh7, to meet g4-g5 with Ng8, trying to keep the files closed on the king-side.",
        "17. g5": "So here comes the king-side pawns.",
        "17... hxg5": "Black takes, but I think it may be slightly less dangerous to move the knight to stop the h file being opened. If white takes on h6, maybe black, instead of recapturing immediately with the pawn, can play g7-g6 and recapture on h6 with the bishop. Presumably white can continue the attack then with h4-h5 and maybe black can again try to keep the files closed with g6-g5 and maybe if black wants to go in for all this, it is best to retreat the knight to h7 so that it ends up supporting the pawn on g5. It is still advantage white - it is he that is doing the attacking, but black is still in the game. Where opening the h file gives more winning possibilities to white.",
        "18. hxg5": "So white takes back.",
        "18... Nd7": "The black knight runs, as planned. OK find white's best move now!",
        "19. Nxe4": "Did you find it? Why doesn't this throw a knight for pawn away?",
        "19... g6": "Because, if 19. Qxe4 then Be2-d3 and if the black queen moves, say, back to e7, then white has Bh7 check. King is forced to go to h8. Then white can play Bg8+!! King takes the bishop on g8 and then white plays Qh7 mate. However if black doesn't take the knight, white threatens to play 20. Nf6+ and if black captures with pawn or queen white has Qc2-h7 mate, so black would have to capture with his knight, covering h7. But then white simply recaptures with the pawn, threatening Qc2-h7 mate again, and also threatening the black queen. To stop all this, black closes the b1-h7 diagonal. But it is a case of out of the frying pan into the fire! What does white play now?",
        "20. Rh8#": "Did you spot that? Notice how vulnerable the black king has become with the open h file. By closing one diagonal to white's pieces, black accidentally opens up another to deadly effect! But black's position is hopeless after 19. Nxe4, for instance if 19....f5 which blocks the b1-h7 diagonal, and gives the black king an escape square on f7, but after gxf6 e.p. Qxe4 21. Bd3 black hasn't got any decent square for his queen. Moving to the g file merely allows Rd1-g1 moving the rook to a better square, into the attack. And after Qf3 22. Bh7+ moving the king to f7 allows Qg6 mate and Kh8 allows Be4 discovering check and winning the black queen.\n\nMany thanks for reading! I hope you enjoyed the game! Please leave a comment or two to let me know how I am doing and rate the annotation on the star system. Until next time dear reader!"
    },
    "url": "https://gameknot.com/annotation.pl/central-pa-open-1976?gm=62180",
    "gameName": "Central PA Open 1976 ",
    "players": "kenneth_fiore_3 (1655) vs. Donald E Songy (1290)",
    "opening": "Nimzovich-Larsen attack (A01), modern variation"
}