{
    "moves": {
        "1. e4 e5 2. d4": "Center game",
        "2... exd4": "gambit accepted",
        "3. Nf3 Nc6 4. c3": "Usually I take but I wanted to try another variation.",
        "4... dxc3": "Trading",
        "5. Nxc3": "White has a big hole on the queen side but 3 pieces out against one for black",
        "5... Nf6 6. Bc4": "Developing",
        "6... Bc5 7. e5 Ng4 8. Bxf7+": "If 8. Kxf7 9. Ng5+ ... 10. Qxg4 with great menace on black's kingside and the black king cannot castle ",
        "8... Kf8": "Black doen't dare to  take",
        "9. Bg5 Bxf2+": "White othesaw this move",
        "10. Kd2": "Only choice not to block the h rook",
        "10... Be3+": "Black is right to trade and stop white's dangerous attack",
        "11. Bxe3": "B",
        "11... Nxe3 12. Kxe3 Kxf7": "Now both kings are unsafe, black is one pawn ahead.",
        "13. Qd5+": "Blunder. White still try to attack to keep the initiative but Rf1 would have been better because black would have to move his king anyway wether during  the 13th move or the 14th and wether on e7 or e8. white would occupate the open file, by playing Ng5, menacing 15. Qd5 and 16. Qf7+#.",
        "13... Ke8 14. Rhf1": "Should have been done on the 13th move (the queen could have come on h5)",
        "14... Qe7 15. Ke4": "defensive move",
        "15... d6": "blocking the center",
        "16. Nb5 Kd8 17. Nbd4 Nxe5 18. Nxe5 Qxe5+ 19. Qxe5 dxe5": "Long trading sequence after which black is better (in this situation a bishop  is better than a knight and black is one pawn ahead)",
        "20. Nf3 b6 21. Rad1+ Ke7 22. Kxe5 Bb7 23. g3 Rae8 24. Ng5 Rhf8 25. Rfe1 Rf6 26. Kd4+ Kd7 27. Kc3+ Rd6 28. Rxd6+ cxd6 29. Rxe8 Kxe8 30. Nxh7": "White has regained his pawn but having a knight is a drawback. Furthermore it's too far away from the center. White's pawn are better but black's passed pawn will conctitute a serious menace, obliging white to use at least one piece to prevent his promotion.",
        "30... Ke7 31. Kd4": "White tries to bring his king on the center.",
        "31... Ke6 32. Ke3": "To prevent the black king to attack the two pawns on the right wing.",
        "32... Kf5 33. Nf8 Bc6 34. a3 Kf6": "It seems a mistake",
        "35. h4 a6 36. Kf4 Kf7 37. Nh7 d5 38. Ke5 Ke7 39. g4 Bb7 40. h5 Kd7 41. g5 Ke7 42. Nf6": "Blunder, white oversaw the 46st move. b3 would have been better for white would have been blocked but could hope for the draw.",
        "42... gxf6+ 43. gxf6+ Kf7 44. h6 Kg6 45. Ke6 d4 46. Ke7 Bd5 47. b4 d3 48. f7 Bxf7": ""
    },
    "url": "https://gameknot.com/annotation.pl/center-game-l?gm=49230",
    "gameName": "center game (L)",
    "players": "ptitroque (1658) vs. j_tavares (1537)",
    "opening": "Centre game, Kieseritsky variation (C21)"
}