{
    "moves": {
        "1. d4 Nf6 2. c4 e6 3. Nc3 d5 4. e3 Bb4": "This is generally considered inaccurate and should be met with 5. Qa4+ Nc6 which blocks off black's c pawn but I did not take advantage",
        "5. a3": "A mistake on my part but certainly not game ending",
        "5... Be7 6. Nf3": "I think 6. Bd3 is better here because it doesn't allow the game continuation",
        "6... Ne4 7. Nxe4 dxe4": "Giving white a strong center but also forcing away the Knight, generally cramping the position, and restricting the light squared Bishop making a castle difficult",
        "8. Nd2 f5": "A very strong pawn chain that will be difficult to dislodge",
        "9. Nb3": "Yet another knight move. I think 9. g3 setting up the fianchetto and the castle is much better",
        "9... b6 10. g3 a5": "Threatening a4 pushing my knight back to d2",
        "11. a4 Bb4+ 12. Bd2 Bxd2+ 13. Qxd2 O-O 14. Bg2 Nc6": "Black wants that Knight in the b4 slot where it will be all but impossible to dislodge and there is little White can do about it",
        "15. c5": "15. 0-0 is far better here",
        "15... Qd5 16. Qc3": "Still not castling for reasons I cannot explain",
        "16... Ba6": "Now I'll never castle kingside and when the Knight comes to b4 it is very powerful which basically prevents a queenside castle",
        "17. Bf1": "My light squared Bishop is trapped in any case so I thought trading it off was ok but it leaves my Rook trapped",
        "17... Bxf1 18. Rxf1 g5 19. Rc1 Nb4": "This is such a great spot for the Knight and White is helpless to prevent it",
        "20. Qc4": "Hoping for a Queen trade giving me time to free my Rooks with Kd2 eventually",
        "20... Nd3+": "I overlooked this nice little fork and the game quickly degenerates after this",
        "21. Kd2 Nxc1 22. Rxc1": "My rook is free at least",
        "22... Rfb8 23. Qc2": "I'm reluctant to trade Queens when down an exchange but I think 23. Qxd5 exd5 is better although it leaves Black lots of room to operate and eventually the Rook pair should prove the difference",
        "23... bxc5 24. Nxc5 Qa2": "Huge pressure now on the b pawn and white can never bring enough pieces to relieve it",
        "25. Rb1 Rb4 26. Kc1": "This move loses the game immediately. Better is 26. b3 Qxc2 27. Kxc2",
        "26... Rc4 27. Nb3": "Thinking perhaps I could trap the Queen although this is hopeless",
        "27... Qxb3": "I resigned at this point. Best perhaps is 28. Qxc4 Qxc4+ 29. Kd1 Rb1 and I will have to trade off my last piece soon enough. This game is an excellent lesson in not delaying a castle for too long. If I had taken advantage of several opportunities to get my King to safety this would have been a much better game for me.",
        "28. Qxc4 Qxc4+ 29. Kd1": ""
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-deadfish28?gm=29125",
    "gameName": "Challenge from deadfish28",
    "players": "tomlib (1449) vs. deadfish28 (1502)",
    "opening": "Nimzo-Indian defence (E20)"
}