{
    "moves": {
        "1. e4 e5 2. Nf3 f6": "...f6 is almost always bad, as it weakens the light squares on the vulnerable kingside. Standard moves to protect the pawn would be ...Nc6 (most common), ...d6 (Philidor's Defense), or ...Nf6 (Petrov Defense).",
        "3. d4": "A vigorous response that looks to open lines for attack.",
        "3... c6": "Probably playing for the trap:\r\n4. dxe5 fxe5\r\n5. Nxe5? Qa5 \r\nwinning the knight.\r\nBut, black really needs to play legitimate moves instead of setting obvious traps.",
        "4. Be3": "Developing, so I can't say too much bad about it, but the bishop looks a little odd on that square.",
        "4... Qa5+": "The queen should usually not be the first piece developed. What was it Fischer said? \"Patzer sees check. Patzer gives check.\"",
        "5. Nbd2": "Interesting choice of squares for the knight. If white is planning to leave c3 open for the pawn, he should just play c3 right away. The only other explanation for not playing Nc3 is that white wants to leave c4 as a possibilty. I guess that is a thought, but I still like Nc3 better.",
        "5... d5": "It is the right of the better developed side to open lines and attack, so this move is a positional blunder. Black would be better to keep the position closed and try to catch up in development.",
        "6. exd5 cxd5 7. dxe5": "These last two captures were correct for white, as he is more developed and opening lines will facilitate the attack on the black king.",
        "7... f5": "Not sure why black refuses to recapture the e5 pawn. He is going to be down a pawn either way and this keeps the position slightly more closed, but two moves ago he was trying to open the position, so it probably isn't fear of opening the position further.",
        "8. Bd3": "Developing with an attack on a weak point and preparing to castle. Nice play!",
        "8... Nh6": "An awkward way to protect f5, but at least black has decided to develop a piece. The knight is probably better placed on e7, but perhaps black is saving that square for the f8 bishop.",
        "9. O-O": "Positionally, this game is almost over. White has a huge lead in development, is up a pawn, and black's king is still trapped in the center.",
        "9... Bc5": "A reasonable looking move by black. This prepares castling to safeguard the king, and offers to trade off one of white's attackers. But looks can be deceiving, and this is actually bad, as white shows with his next.",
        "10. Nb3": "Attacking the queen, while putting a second attacker on the c5 bishop, this move wins a piece.",
        "10... Qc7 11. Nxc5": "An interesting way to capture. Although, at this point, any move by white will win, I think taking with the bishop is better here. The main reason is that it would inhibit castling by covering the f8 square. But perhaps white was anticipating Bxh6 after black castles to break up the remaining pawn cover of the king.",
        "11... Ng4": "Moving a piece a second time when there are still pieces waiting to be developed is a violation of opening principles, and this is therefore a bad move. It does attempt to remove the defender of the c5 knight, so that if white overlooks this transparent threat, black could theoretically win a piece with ...Nxe3 followed by ...Qxc5. But white has numerous ways to defend this \"threat\", such as Nb3, Qd2, Qe2, or even Bd4. Notice that black is attacking the e5 pawn twice and it is only defended once, so black can win that pawn, but if I were white I would sacrifice it and play Nb3 looking for a sequence like:\r\n12. Nb3 Nxe5\r\n13. Nxe5 Qxe5\r\n14. Re1\r\nand the black queen is going to have trouble finding a safe place to get out of the discovered check. For example, 14...Qc7 loses to 15. Bf4 .",
        "12. Bd4": "Avoiding the trade and protecting the e5 pawn.",
        "12... Nc6": "And now black develops with an attack on a defender of the e5 pawn, renewing the threat to win it. Again I would sacrifice it, looking for a sequence like:\r\n13. Nb3 Nxd4\r\n14. Nbxd4 Nxe5\r\n15. Nxe5 Qxe5\r\n16. Re1\r\nwinning the queen.",
        "13. Ne6": "But instead, white blunders the knight! Argh!!",
        "13... Bxe6 14. c3": "This protects the d4 bishop, but turns that bishop into a mere pawn in the chain. Maybe something like Bc3 presents itself, with the idea of Nd4.",
        "14... O-O": "Black is continuing to improve his position, although white is probably still better with his passed e pawn.",
        "15. Ng5": "Looking to trade off the blockader of the passed pawn?",
        "15... Qe7": "Protecting the bishop.",
        "16. Nxe6 Qxe6 17. Qe2": "Connecting the rooks and protecting the e5 pawn.",
        "17... b5": "Dropping the pawn is bad. Black's best is something like:\r\n17...Ngxe5\r\n18. Bxe5 Qxe5\r\n19. Qxe5 Nxe5\r\n20. Bc2\r\nwhen material is even, but white is better due to the superior minor piece and black's isolated d pawn.",
        "18. Bxb5 Nxd4 19. cxd4 f4": "Is black trying to induce f3, when he can plant the knight on the e3 outpost? I don't see any other reason for this move.",
        "20. Qf3": "Eyeing the d5 pawn, which is a weakness of black's position.",
        "20... Ne3": "Blundering the knight to fxe3.",
        "21. Qe2": "White refuses to accept the gift and offers his opponent a chance to win the exchange with ...Nxf1! Argh!!",
        "21... Ng4": "And black returns the favor by not accepting white's gift of material! Double Argh!!",
        "22. Qf3": "Repeating the position. Maybe to see if black will again offer the knight? Maybe white has seen his error?",
        "22... Rab8": "At least black will not repeat his mistake and x-rays the b2 pawn.",
        "23. a4": "This is a safe and good way to stifle black's attempted counterplay on the queenside. Notice that if black tries ...Rb6 planning ...a6, white can gain the tempo needed to protect the b pawn with Be2, putting a second attacker on the knight. After black either moves or protects the knight, white plays b3 so the queen can protect the pawn. Eventually, white can convert this 2-1 majority into a passed pawn that, together with the passed e pawn will put tremendous pressure on the black defenders.",
        "23... Rb6": "Black seems unaware that his planned ...a6 will not work.",
        "24. Rac1": "Except that white doesn't play Be2, so all bets are off. Now, I like the idea of putting a rook on an open file, but timing is important, and this move had to be delayed until the b pawn was out of danger.",
        "24... a6": "Since white has allowed the bishop to be attacked, black attacks it.",
        "25. Rc6": "A blunder that loses a pawn. White was expecting:\r\n25. Rc6 Rxc6\r\n26. Bxc6 Qxc6\r\n27. Qxg4 Qxa4\r\n28. Qe6  Kh8\r\n29. Qxd5\r\nand white is still up 2 pawns.\r\nBut black can improve on that line with 26...Nxh2, when black ends up winning the h pawn:\r\n27. Kxh2 Qxc6.\r\nOf course, as we shall see, white doesn't find 27. Kxh2 and ends up losing his queen for a piece.",
        "25... Rxc6 26. Bxc6 Nxh2": "And black finds the best move.",
        "27. Bxd5": "At first blush, this appears to pin and win the black queen. But appearances can be deceiving, and tactics must be calculated precisely, not just guessed at. The knight removes the defender of the bishop with check, and this gives black the tempo he needs to save his lady.",
        "27... Nxf3+ 28. Bxf3": "Better than recapturing on f3 with the pawn, as then the bishop falls to the queen.",
        "28... g5": "Protecting the f pawn to activate the f8 rook.",
        "29. d5": "White loses the thread of the game completely and gives away one of his connected passed pawns.",
        "29... Qxe5": "Accepting the gift and eyeing the b pawn.",
        "30. Rd1": "Ignoring the threat to the b pawn, white puts a rook behind his passer. Normally the best strategy, but here it is just too little, too late.",
        "30... Qxb2": "Accepting another gift and destroying white's 2-1 queenside majority. After this, white can resign with a clean conscience.",
        "31. d6": "Desperation, as the pawn has no chance to queen, but if white is to play on, he must move something.",
        "31... Qc2": "Threatening the a pawn, which would give black a passer, and taking the c6 square away from the bishop. Nice move!",
        "32. d7": "Ignoring the threat to the a pawn in order to advance the passer.",
        "32... Rd8": "But black successfully blockades the passer and can win it at his leisure.",
        "33. Bg4": "Protecting the pawn to allow the rook to head for e8, but this is too slow and black will have plenty of time to counter. For example, ...Qc7 puts a second attacker on the d pawn and freezes both white pieces in their tracks.",
        "33... f3": "But this is unexpected. Perhaps black was hoping white would blunder with:\r\n34. gxf3 Qxd1 \r\nbut really I have no explanation for this move.",
        "34. Bxf3": "Avoiding the blunder.",
        "34... Qf5": "And now the reason for 33...f3 is clear. It was a deflection sacrifice to allow the black queen the f5 square. But really, 33...Qc7 would have been better.",
        "35. Bd5+": "This is worse than just a wasted tempo, it actually helps his opponent. The bishop has to get to c6 to protect the pawn, and by checking first, the black king gets a free move to get activated.",
        "35... Kf8": "Taking the tempo gift to get closer to the action around white's passer.",
        "36. Bc6": "Forced, to get a second defender on the passer, but now ...Qe6 will force the bishop to abandon its protection and the passer will fall.",
        "36... h5": "But black doesn't find ...Qe6. Is he thinking of a pawn storm to destroy the pawn wall in front of the white king?",
        "37. Rd5": "White has to move something, but this still allows black to consolidate his won position with:\r\n37...Qe6\r\n38. Bb7 Rxd7\r\n39. Rxd7 Qxd7\r\n40. Bxa6 Qd1 \r\nwinning the a pawn, after which the queen will dominate the bishop.",
        "37... Qb1+": "But instead, black gives a check. What does he have in mind? I don't know, but I am anxious to find out.",
        "38. Kh2 g4": "Uh, this was the big follow up to 37...Qb1 ? I guess I still don't see the point of this line. Except that it sets a trap for white if he should take the h pawn.",
        "39. Rxh5": "And white partakes of the forbidden fruit! After the double attack of ...Qg6, white has the choices of:\r\nA) 40. Rh8  Ke7\r\n41. Rxd8 Kxd8\r\nand the King wins the d pawn after the white bishop moves\r\nB) 40. Rc5 trying to protect the bishop\r\n40...Qd6  forking the rook",
        "39... Ke7": "But black misses that and continues to play with his king.",
        "40. Re5+": "White's best chance to cause some confusion.",
        "40... Kd6": "This king maneuver is totally unnecessary, but black is so far ahead that he can win with almost any sequence. And this turns out to be a winning sequence. Long, slow, messy, but winning.",
        "41. Re8": "The best try.",
        "41... Rxd7": "And black finally makes a good move.",
        "42. Bxd7": "Even though it leaves him with a losing Q vs. R ending, this does win material, and is the best white has.",
        "42... Kxd7 43. Rg8": "Might as well attack something, but this allows black a nice move.",
        "43... Qb4": "Which he doesn't find. The text defends the g pawn and attacks the a pawn, but misses ...Qh7  forking the rook. In a Q vs. R ending it is very difficult for the rook to stay active and avoid getting forked at the same time.",
        "44. Kg3": "Threatening to win the pawn.",
        "44... Qxa4": "And again missing a fork to win the rook with ...Qb3 .",
        "45. Rxg4": "Can't blame white for trying to put up resistance, especially since black doesn't appear to be looking for a way to win.",
        "45... Qa3+": "What is black's plan now? He must be wanting to push his passed a pawn, but then why did he leave the queen blocking the a file? ...Qb3  would have cleared the pawn's path with the tempo gain of a check.",
        "46. f3 a5 47. Rd4+": "Again, \"Patzer sees check...\". Is there a point to this move? If white wants to queen one of his pawns, he will need to cut the black king off, so Re4 would accomplish that and after Kf4, the g pawn could get moving. This move just lets the black king take a free move.",
        "47... Kc6 48. Kf4 Kc5 49. Re4": "And now the position we should have been at, but white has lost a tempo.",
        "49... Qb3": "And black figures out his pawn can't walk through the queen and gets out of the way. Another lost tempo, so I guess we are even.",
        "50. g4 a4": "And the race is on. Since black will queen first, white must be very careful where his pieces are.",
        "51. g5 a3 52. g6 a2 53. Re5+": "An interesting intermezzo that gives black a chance to go wrong. After:\r\n53...Qd5\r\n54. Rxd5  Kxd5\r\n55. g7 a1=Q\r\n56. g8=Q \r\nit is white who queens with check and black will have to be careful to hold the draw.",
        "53... Qd5": "As white hoped.",
        "54. g7": "And this transposing of moves ruins the game. By letting the exchange happen on e5, white lets black queen with check.",
        "54... Qxe5+ 55. Kxe5 a1=Q+": "And the g pawn is skewered, losing the game for white. 0-1"
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-shawnjay?gm=475",
    "gameName": "Challenge from shawnjay",
    "players": "shawnjay (1164) vs. mariner249er (1079)",
    "opening": "Damiano's defence (C40)"
}