{
    "moves": {
        "1. b3": "Nimzovich-Larsen attack (A01). \n\nJim West once wrote about 1.b3 and the idea of using systems playable for Black that, with colors reversed and extra tempo, become favorable to White. This is the first such game in which I explored this theme since reading about it on Mr. West's blog sometime last year. \n\nhttp://tinyurl.com/JimWest\nhttp://tinyurl.com/Fischer-1b3-games\n\n\n",
        "1... e5 2. Bb2 Nc6 3. c4": "Prepares to transpose to an Open Sicilian colors reversed after a pawn exchange on d5. The move 3. e3 is more common. Knowledge of the various Anti-Sicilian lines will give useful ideas to both players.\n\nhttp://tinyurl.com/JSilmanAntiSicilians\n",
        "3... Nf6": "Stops the creation of a Maroczy bind pawn structure by White, which would have otherwise been an option.",
        "4. e3 d5": "Offering the d-pawn. Interestingly, most of Jim West's own games feature Black playing d6 instead of d5.",
        "5. cxd5": "Accepted.",
        "5... Nxd5": "An Open Sicilian position via transposition but with colors reversed. The move 5...Qxd5 can be seen in Fischer-Tukmakov, Buenos Aires 1970, and in a small handful of games here on Gameknot.",
        "6. a3 Bd6 7. Qc2": "The Gameknot database has two common paths from here: 7.d3 0-0 8.Nf3 and 7.Qc2 0-0 8.Nf3. When comparing the Gameknot and World databases, it is hard to determine which path is better. Whether or not the Queen is better on c2 or another square is something I haven't determined yet.",
        "7... O-O 8. d3": "White has constructed a Hedgehog-like pawn wall on the third row. ",
        "8... Qe7": "Interesting to consider would be 8..Qf6. It appears twice in the databases; one draw (World) and one win for Black (Gameknot). ",
        "9. Nd2": "The more common move is Nf3 and I'm not certain why I held off on playing it in favor of Nd2.",
        "9... f5": "An interesting idea, one which I had not expected. If you switch to the World Database, Black appears to score pretty well with it.",
        "10. Ngf3 Bd7 11. Be2": "White is now prepared to castle. The question is which side if any is better at this point.",
        "11... Rae8 12. O-O Rf6 13. Kh1": "I had earlier planned on trying out the idea of a g-pawn thrust with my rooks behind it but should have reconsidered it upon seeing 9..f5 and 12.Rf6. The move 13.Kh1 to prepare this attack was kind of a waste as I never followed up this idea. The game Fischer-Andersson, Siegen 1970 featured this attack plan and is discussed in Jim West's article. Imagine my surprise when Black's own g-pawn came out at me 4 moves later.",
        "13... Rh6": "In another game where White's King was still on g1, Black played Rg6 here.",
        "14. e4": "My exact reasoning for choosing e4 as a pawn break I don't remember. If Black takes with the f-pawn he will end up with an isolated e-pawn after the exchange but I don't know if I had things worked out that far at this point. Had I still planned on the g-pawn thrust, getting rid of Black's f-pawn would have helped. As it was I didn't return to the idea because of the d7 Bishop and where Black's d5 Knight ended up.",
        "14... Nf4": "An aggressive move, keeping the Knight near White's Kingside and threatening the currently undefended e2 Bishop. The squares b6 and f6 are less useful or get in the way of the Queen and e8 Rook.",
        "15. Nc4": "I develop my Knight to c4, letting the Queen defend the e2 Bishop. This is an excellent square for the Knight and though it does attack e5, my actual intention is to get the Bishop pair by trading it on d6 when I get the chance.",
        "15... fxe4": "Black defends the e5 square sufficiently to not be worried about a direct exchange but d4 could create complications. Black accepts an isolated pawn to maintain his center and counter the threat of d4.",
        "16. dxe4 g5": "I was not expecting this move and I thought for a long time about how to deal with it. The ultimate goal is to drive away the Knight on f3 by playing g4. It wasn't until later I realized that it would also allow Qh4 for a Checkmate threat. Had I played Rg1 earlier like I had planned, playing g4 myself could have been an option, though it would have left Black's f4 Knight in the pocket.",
        "17. Nxd6": "My response instead was to continue my plan of Nxd6 and follow up with Bc4  and position the Queen on d2. The e-pawn would be pinned should Black play Kh8 or Kg8 and with my Queen sitting on the c1-h6 diagonal I would be able to take Black's Knight because of the pin and threaten Black's Rook should g4 be pushed. I felt at the time that this threat would be sufficient to deter Black from following his plan.",
        "17... cxd6": "Of the two choices, Qxd6 and cxd6, the later is best as otherwise I could have taken the g5 pawn for free with my Knight had Qxd6 been played. Bringing the c-pawn to d6 also supports the e5 pawn. Though there is a hole on d5, White's remaining Knight is at least four moves away from taking advantage of it.",
        "18. Bc4+": "Continuing my plan, the e2 bishop takes up position on the now vacant c4 square away from the threat of Black's f4 Knight to give check. The Bishop pair is not to be underestimated. All of White's play now focuses on the e5 pin and the effect of the raking Bishops.",
        "18... Kh8": "Black has three king moves (Kh8, Kg7, and Kf8) and the move Be6 blocking check. Blocking with d5, though guarded by the f4 Knight, is not an option as it would have opened the center after White takes on d5. Black would have to sacrifice the Knight to move the King to avoid d6  which wins the Queen.\n\nOf the King moves, the h8 square is best, even though it allows the pin. This move would seem most intuitive if Black had planned an eventual Kh8 anyway. \n\nThe move Be6 deserves some thought though considering what the pin on the e5 pawn allowed to happen later. The sequence 18..Be6 19.Bxe6 Nxe6 20. Qd2 Nf4 shows that Black could have maintained the protection of the g-pawn and allowed the exchange had that been a concern.",
        "19. Qd2 g4": "I had this position sketched out on a piece of paper during a long and boring lecture class in an auditorium with uncomfortable chairs. I stared at it for a long time wondering what I had missed before realizing that Qh4 would become possible after a move like Ng1, and that h3 would be insufficient to stop checkmate along the h-file.",
        "20. Nxe5": "After much thought I decided to try and exploit the pin along the the a1-h8 diagonal and 'sacrifice' my Knight on e5 to recreate an isolated e-pawn for Black. Should Black play 20...Qh4 now to threaten checkmate in one move, I will be able to checkmate first with 21.Ng6#. ",
        "20... dxe5": "Rather then allow the c6 Knight to become pinned on e5, this is the better choice.",
        "21. Qxf4": "Using my earlier idea, I now regain the material lost plus a pawn, threaten the h6 Rook and cover the h2 pawn, temporarily defusing the Qh4 checkmate threat.",
        "21... Rf8": "Perhaps thinking to drive away my Queen to make way for the Qh4 checkmate threat, Black makes an unfortunate blunder. Had the h6 Rook been guarded, I would have parked my Queen on g3 to give myself some time to come up with another plan.",
        "22. Qxh6 Rf6 23. Qg5": "I had planned for Rf6 and chose 23.Qg5, 'pinning' the Rook to Black's Queen and threatening checkmate on g8. Moving the Rook to cover g8 is fatal for Black. The moves after 23...Rf8 lose to 24.Qxe7 Nxe7 25.Bxe5  Rf6 26.Bxf6#. Similarly, 23. Rg6 loses to 24.Qxe7 Nxe7 25.Bxe5  Rg7 26.Rad1 and the threat of backrank checkmate or further material loss. \n\nBest play for Black comes from 23...Qf8, guarding g8 and maintaining control of the f-file, with play continuing 24.Bxe5 Nxe5 25.Qxe5 and perhaps following a sequence not unlike 25..h6 26.Rad1 Bc6 27.Rd6 Kg7 28.Rfd1. Guarding g8 with 23...Qd8 allows the d7 Bishop to be pinned later with Rad1 which is undesirable for Black. If there was a central theme to this game, it would be about the tactical use of pins and the importance of the Bishops pair."
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-yttrio-part-2?gm=18798",
    "gameName": "Challenge from yttrio Part 2",
    "players": "geiss83 (1463) vs. yttrio (1889)",
    "opening": "Nimzovich-Larsen attack (A01), modern variation"
}