{
    "moves": {
        "1. e4 e5 2. Qf3": "?! There is no reason to bring the queen out so early, as there are no threats and no weaknesses in black's position.  Also, it can allow black to advance his pieces while pushing your queen back as is seen in the game, and finally it takes away the best square for the knight, inhibiting your own development.",
        "2... Nf6 3. d3 Nc6 4. c3": "stopping Nd4, for now...  and now black takes charge in the center",
        "4... d5 5. h3": "the only use of h3 is preventing Bg4, and white uses up a move to stop black from developing to that square even though Be6 is fine.  So white has not really inhibited black from developing, and this move highlights white's faulty opening setup, swinging at ghosts.",
        "5... d4 6. Ne2": "Notice how unhappy the f1 bishop is, while white is busy trying to hold everything together.",
        "6... h6": "similarly, h6 is unnecessary, as Bg5 is easily countered with Be7",
        "7. Ng3 dxc3 8. Nxc3": "although normally a good developing move, d4 is now ripe for the taking",
        "8... Nd4": "centralizing the knight while kicking back the queen to whence it came",
        "9. Qd1 Bc5 10. Be3": "solid, now white has the option of using the c-file for his rook",
        "10... c6": "a decent \"all-purpose\" move, restricting the knight on c3, opening the diagonal for the queen, and making a rook on the c-file slightly less effective.",
        "11. Na4": "premature, Be2 followed by castling would have been better, since white would be happy to trade his poor bishop on e2 for black's excellent knight on d4",
        "11... Bb4+ 12. Bd2 Bxd2+ 13. Qxd2 b5": "?! black has returned the favor by weakening the c6 and c5 squares, and now both sides have a backwards pawn firmly blockaded by a knight",
        "14. Nc5 Qd6 15. b4": "Rc1 was preferred, as this allows black to create a bit of tension with 15...a5",
        "15... O-O": "15...a5 would create the desired pressure sooner",
        "16. Be2": "Rc1 would have been better, stopping 16...a5 from being as effective",
        "16... a5": "! challenging the defense of the knight.  With the b-pawn still on b2, and with the rook on c1, white would not feel so uncomfortable now",
        "17. O-O axb4 18. Rac1": "better late than never, but now a2 is very weak",
        "18... Be6 19. Qxb4 Rxa2": "black's pieces have become very active, and now enjoys having the knight on c5 somewhat pinned, since white does not want to trade queens and wind up in a losing endgame",
        "20. Bd1": "the bishop was already a rather terrible piece, and it would have been better to allow a trade of black's excellent knight for white's unhappy bishop with Rfe1, and then, if necessary, retreat the bishop to f1 to hold on to d3",
        "20... Rfa8 21. Bh5": "??  Allows black to either win a piece or the exchange, as is seen in the game",
        "21... Nxh5 22. Nxh5 Ne2+ 23. Kh1 Nxc1 24. Rxc1 Rxf2 25. Kg1 Rfa2": "Raa2 would have made more sense, with doubled rooks on the 7th(2nd) rank, black could exert his power indiscriminately",
        "26. Qc3 Qd4+": "time to simplify into a winning endgame",
        "27. Qxd4 exd4 28. Nf4 Ra2a1": "trading off any potentially annoying pieces in a winning endgame is usually a good idea",
        "29. Rxa1 Rxa1+": "black plays the finish pretty accurately and the rest requires no comment",
        "30. Kh2 b4 31. Ne2 b3 32. Nxd4 b2 33. Ncb3 Bxb3 34. Nxb3 Rd1": "Most of white's problems stemmed from the misplayed opening, which eventually allowed black a nice outpost on d4, total control of the a-file, and ultimately a winning endgame.  Don't bring out the queen too early!  Concentrate on minor piece deployment, and only when you get a feel for how the position is developing should you engage the queen.  "
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-larry___?gm=11187",
    "gameName": "Challenge from larry___",
    "players": "larry___ (1415) vs. alpaica (1531)",
    "opening": "KP (C20), Napoleon's opening"
}