{
    "moves": {
        "1. c4": "English opening.  White generally responds Pe5 or Nf6.",
        "1... e5": "Pe5.  White does well with Nc3 or maybe Pg3.",
        "2. e4": "For some reason black seems to do better when white plays this, though it looks perfectly fine to me.",
        "2... Qf6": "Black opts for a quick checkmate.  White should expect Bc5.  Not that this move must be defended against just yet.  But Nf3 should defend against that just fine.",
        "3. d3": "...this move too works, though white's pawns may get doubled by BxBe3 (in a couple of moves).",
        "3... Bc5": "Yes, black is eying QxPf2#.  White knows better than to fall for such cheap theatrics.",
        "4. Nf3": "The knight!  Excellent.  This is rule 2:  Can I prevent force mate?  (In this case, checkmate equals force mate in one).",
        "4... d6 5. Bg5 Qg6 6. Nc3 Bg4 7. Be2": "Mm, here the queen was already defending Nf3.  Black wants this knight because it is the only piece defending Bg5.  BxNf3, BnBf3, QxBg5 for free.  Always a shame to drop 3 points before the tenth move.",
        "7... Bxf2+": "The bishop for pawn was not a good idea.  Black does not gain sufficient advantage pulling the white king into the field.  But black still has a free bishop after the bishop/knight trade.",
        "8. Kxf2 h6": "Completely wrong.  This bishop was free.  And easy.  ",
        "9. Nd5": ":)  White will ignore the bishop threat in exchange for a rook.",
        "9... hxg5": "Remarkable.  NxPc7+ nets white a cheap rook.",
        "10. h3": "This is no longer a hollow threat given that the queen is covering white's h rook.",
        "10... Be6 11. a4": "?  No.  Black can easily prevent the loss of Ra1 with BxNd5.",
        "11... c6": "That wasn't it.  Although black saves a pawn, it still costs a rook.  Na6 would be the proper way to stop white's knight aggression.",
        "12. Nc7+": "Finally!  I thought this day would never come.",
        "12... Kd7 13. Nxa8": "Tasty.  Even if white loses the knight, 5 points is more than 3 points.",
        "13... Na6": "Here I'm thinking Qb3.  Black may respond with Pb6, and white does NxPb6 just to get something for the beast.",
        "14. Nb6+": "While white doubles black's pawns, the pawn trade would have been better.",
        "14... axb6 15. a5 b5 16. cxb5 cxb5 17. b4": "Not so great.  Now this pawn is in the way.  Pd4 releases the fury of Be2 upon Pb5.  Plus, what prevents NxPb4?  It's like throwing the pawn's life away for naught.",
        "17... Nf6 18. g4 Nxb4 19. a6": "Mm, PxPa6 is protected by Nb4.  White pitches this pawn into the fire for nothing.",
        "19... bxa6 20. d4 Qxe4 21. Rb1": "Black can defend with Nfd5.",
        "21... Nfd5 22. dxe5 Qe3+": "You know what would have been brilliant for black?  Nc3.  Nc3 forks the queen and rook.  RxNb4, NxQd1+, BxNd1.  Black loses both knights (6 points) for the white queen (9 points).  Probably a good deal.  But that move is still available after the king moves.",
        "23. Kg2 Nf4+ 24. Kf1": "Kg3 might have been better.  Here RxPh3.  RxR, NxR, and white must fret about Qg1#.\n",
        "24... Nxh3": "Now white must quake over Qf2#.  But Ke1 or Kg2 and Nf2 forks white's queen and rook.  White loses a rook and queen for a rook and knight.",
        "25. Rxb4": "Nope.  You know what would have been slightly better?  QxPd6+.  That would buy a move.  RxNh3 would probably have to follow.  Maybe Qd4 to encourage black to trade queens.  It would also prevent the Nf2 fork.",
        "25... Qf2#": ""
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-mrp800?gm=57589",
    "gameName": "Challenge from mrp800",
    "players": "mrp800 (935) vs. ssweetie05 (864)",
    "opening": "English opening (A20)"
}