{
    "moves": {
        "1. c4 Nf6 2. d4 g6 3. Nc3 Bg7 4. Nf3 O-O 5. e4 d6 6. h3 e5 7. d5 a5 8. b3 Na6 9. a3 Qe8 10. b4 axb4 11. axb4 Bd7 12. Ba3 Nh5 13. c5 f5 14. Bc4 Nf6": "14. .. Nf4 is more obvious and probably better",
        "15. Ng5 fxe4 16. Ne6 Bxe6 17. dxe6 Qe7 18. g4": "18. I hardly considered this, must be a critical position because soon black is in trouble but here I was still happily taking pawns on c5, thinking I could shore things up with c6 and be fine",
        "18... dxc5": "18. Too simply play c6 if white recaptures and black should be winning or at least without problems but..",
        "19. g5 Nh5": "19. Here I began to calculate and realized there were some problems because after Nd5 there is a Nxc7/Qd8 threat that wins the house",
        "20. Nd5 Qxg5 21. e7 Rf7": "So on move 18 dxc5, here at first I was shocked to find 22 h4 for white. The black queen cannot stay on the diagonal to d8, which would make Nxc7 winning.\n22 h4 Qg2!? 23 Rf1! and there is simply nothing black is threatening or can do against Nxc7. \n\nThen I found Qf5! and the mate threat stops and immediate Nxc7, giving black enough time and a decent position. So I went for this variation after all happily",
        "22. b5": "But I missed this one, white should be winning here, black can still put up a fight by sacrificing a piece for some pawns but it should be enough.\nI had a good long think here and played e3 because I think white has only one really good reply and possibly the others aren't that good, getting black back in the game. So its at least giving white a tough choice in this complicated position",
        "22... e3": "Black has to act otherwise Nxc7 is game over",
        "23. Bxc5": "I think a mistake, not sure if its losing, wild position, but the follow up seems pretty convincing.\n\n23 Nxe3! is I think the strongest move for white.\nIt should continue 23 Nxe3 Qxe7 24 bxa6 Rxa6 or something, with pawns and open king for the piece and the exchange",
        "23... Qh4": "Pretty strong, not giving white and time for Bxe3 or Nxc7",
        "24. Qe2": "Now the queen is of the d-line so no more Qd8 tricks",
        "24... exf2+ 25. Bxf2 Rxf2 26. Nf6+": "I think Qxf2 and Qxc4 should also be losing for white.",
        "26... Kh8 27. O-O-O Bxf6 28. Rd8+ Rxd8 29. exd8=Q+ Bxd8 30. Qxe5+ Qf6 31. Qe8+ Kg7": ""
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-jlmeyo?gm=43596",
    "gameName": "Challenge from jlmeyo",
    "players": "jlmeyo (1621) vs. monkeymind (1703)",
    "opening": "English, 1...Nf6 (Anglo-Indian defense) (A15)"
}