{
    "moves": {
        "1. c4 Nf6 2. Nc3 g6 3. Nf3 Bg7 4. d4 e6 5. e4 d6": "my favorite opening, i think",
        "6. Bg5": "i don't do that usually. I guess i was pointing for a draw",
        "6... h6 7. Bd2 Nc6 8. d5 Ne7 9. Bd3 e5 10. h3 c6 11. O-O Bd7 12. a3 Qc7 13. Rc1 c5 14. b4 b6 15. Be3 O-O 16. Qd2 Kh7 17. Rc2 Nfg8 18. Rb1 Nc8 19. Rcb2 Nge7": "until then, if he had offered me the draw, i think i would have accepted.",
        "20. Nh4 f5 21. f4": "after i played this i really thought: \"did i make a mistake?\" I wanted to open the space to his king. Most of his pieces were looking to my queen size or were blocked: see the two knights! But on the other way, i was exposing my pieces to the pawns ant the black bishop on g7.",
        "21... cxb4 22. axb4 exf4": "here is the black bishop and my queen is overcharged.",
        "23. exf5": "so i decided to bet on the loss of my black bishop in exchange of the attack on g6.",
        "23... Bxf5": "but he refused",
        "24. Nxf5 fxe3 25. Nxe3": "and so... no benefits... as it seems...",
        "25... a6 26. Rc2 h5 27. Ne4": "but, as you left me most of my pieces, they will attack on your king side",
        "27... Bh6 28. Qe1 Qd7 29. Rf2 Rxf2 30. Qxf2 Ng8 31. g4 hxg4 32. Nxg4": "And now I have a powerful attack. I thought I had the lead here",
        "32... Qg7": "necessary",
        "33. Rf1 Rb8 34. Ngf6+ Nxf6 35. Qxf6": "i really hesitated the 34-35 moves, but I haven't found the clue. Then I realized my main attack had to be a diversion for a fight on queen side.",
        "35... Rb7": "this amazed me",
        "36. Qxg7+": "why not Kxd6? because \n35.\tQxf6\tRb7\n36.\tNxd6\tNxd6\n37.\tQxd6\tQd4+ and the bishop falls",
        "36... Kxg7 37. c5": "and here is my attack on queen side",
        "37... Be3+ 38. Kg2 bxc5 39. bxc5 Bxc5": "i had preferred to keep my knight here, if he had taken with the pawn, but still haven't seen wrong ",
        "40. Nxc5 dxc5 41. Bxa6 Rc7 42. Kg3": "and now i made a terrible mistake... somewhere here. I am very sad because i had a strong attack, at least to force the draw... And now I lose.",
        "42... Nd6 43. Rf4": "this is the worst!!!!",
        "43... c4": "because of this of course. Anyway, pangli defended correctly, and I am not sure i had a true attack, conclusive, etc. I should have proponed the draw two moves sooner",
        "44. Rf1 Ra7 45. Bxc4": "45.\tRa1\tNe4+\n46.\tKf4\tNc5",
        "45... Nxc4 46. Rc1 Nd6 47. Kf4 Rd7 48. Ke5 Kf7 49. Rf1+ Nf5 50. h4 Re7+ 51. Kf4 Kg7 52. h5 gxh5 53. Kg5 Ne3 54. Rh1 Re5+ 55. Kf4 Kf6 56. d6 Nd5+ 57. Kg3 Ke6": "well done, pal"
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-pangli5?gm=31657",
    "gameName": "Challenge from pangli5",
    "players": "thitho (1714) vs. pangli5 (1755)",
    "opening": "English opening (A16)"
}