{
    "moves": {
        "1. e3": "The second game between me and brianmahagio - he beat me last time so I'm out for payback here.",
        "1... e5 2. Bc4": "Trying to get him with 4 move checkmate, probably not going to work... but worth a shot.",
        "2... d5": "Already foiled, but both of these pawns out like this leaving the king open probably not too good either.",
        "3. Bb3 Bc5 4. Qf3": "Still trying on 4 move checkmate... probably a mistake in retrospect.",
        "4... Nf6 5. Nc3": "Knights come into play.",
        "5... Bg4 6. Qg3 Qd6": "Moves his queen out... not too sure what he's trying to do with that.",
        "7. Nb5": "Threaten the queen - disrupt whatever it is he's doing.",
        "7... Qe7 8. c3 Nh5": "Again, trying to assail my queen.",
        "9. Qxg4": "But the bishop is no longer protected so that happens.",
        "9... Nf6 10. Qxg7": "Moving my queen right into his ranks. Can take the rook, but he can save it and threaten queen at same time\n",
        "10... c6": "Not the best move, but trying to threaten knight here",
        "11. Qxh8+": "But a knight is worth a rook, - also, he's in check which buys me time to save the knight",
        "11... Kd7 12. Nf3": "But I decide to move this knight out instead, so I can castle.",
        "12... cxb5": "He takes the knight. Big suprise.",
        "13. O-O e4": "Threatening my other knight",
        "14. Ng5 a5": "Opening up a path for the rook -  cant move knight else Queen would take the rook.",
        "15. d4": "Force his bishop to move - also deadlocking centre pawns.",
        "15... Bd6 16. f3": "Trying to coax him into takingpawn, so rook can move out to take knight - while being protected by queen",
        "16... a4": "Doesn't take it... threatens bishop instead.\n",
        "17. Bc2 b6": "No idea what he was trying to do there.",
        "18. fxe4": "Path opened for rook.",
        "18... dxe4 19. Rxf6": "Knight taken - rook now operating from a central position - good position to trap king later.",
        "19... Nc6": "Moves his knight... exposing queen to rook, but I dont notice this...",
        "20. Nxf7": "instead moving my knight to take a pawn...",
        "20... Rxh8": "he takes my queen. A big mistake on my part.",
        "21. Rf5": "Moving rook since it is no longer protected from queen.",
        "21... Qe8 22. Bd2": "Allowing other rook out\n",
        "22... Ne7": "Threatening rook",
        "23. Rf2 Rf8 24. Raf1": "Both rooks on same file... preparing for further aggressive moves.",
        "24... h5": "I think he was trying to expose my castled king by forcing me to take a pawn. I saw this coming and pressed to attack to prevent him from capatilising on this.",
        "25. c4 h4 26. cxb5 Kc8": "A foolish move...",
        "27. Nxd6+": "...because now I fork his king and queen. He must move the king so...",
        "27... Kd7 28. Nxe8": "...I take his queen. At which point he resigned, which was probably for the best. I had a substantial material advantage and coul of easily moved to trap the king with the 2 rooks, or promoted a pawn to queen and done it with that."
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-drcolossus?gm=2618",
    "gameName": "Challenge from drcolossus",
    "players": "drcolossus (1276) vs. brianmahagio (1246)",
    "opening": "Amsterdam attack (A00)"
}