{
    "moves": {
        "1. e4 e5 2. f4 exf4 3. Nf3 Nf6 4. e5 Ne4 5. d4 d5": "il aurait peut être fallu protéger f4",
        "6. Bxf4 b6 7. Nc3": "Là belle connerie de ma part... j'ai même pas trop de raison d'amener là la cavalerie, c'est juste quej'aime bien avoir les cavaliers dans le centre en début de partie...",
        "7... Bb4 8. a3": "Alors là c'est pire, j'aurais du jouer Bd2",
        "8... Nxc3 9. Qd3 Ba6": "Merde ma dame! le salop!",
        "10. Qe3 c5": "Attention! Si ton fou est protégé par le cavalier en b8, si je mange axb4, ma tour menace le cavalier! En plus je menace aussi bxc2. Bref c'est la fête.",
        "11. Bxa6 Nxa6 12. axb4 cxd4 13. Nxd4 Ne4 14. Rxa6": "Ce qui devait arriver est arrivé...",
        "14... Qc7": "Ah la poufiasse veut jouer aussi!",
        "15. Qb3": "Je protege mon pion et menace d5",
        "15... Qc4": "ok, tu veux un échange? j'ai l'impression d'avoir l'avantage, j'accepte l'échange",
        "16. Qxc4 dxc4 17. e6": "j'avais repéré c7 qui faisait une fourchette si je plaçais mon cavalier là, et j'avais envie d'affaiblir un éventuel petit roque.",
        "17... fxe6 18. Nxe6 c3 19. Nc7+": "Ma fourchette, je m'offre une tour.",
        "19... Kf7 20. Nxa8 Rxa8 21. b3": "Là, je vais pas te laisser ton pion aller au bout quand même!",
        "21... g5 22. Be3 g4 23. O-O+ Ke7 24. Bxb6": "Au début je comptais jouer Bd4, et puis j'ai vu ça.",
        "24... Nd2 25. Bc5+": "Je garde en échec histoire de voir ce que je peux faire avec mes 3 pièces",
        "25... Ke8": "Et là tu m'offres un cadeau.",
        "26. Rf8+ Kd7 27. Rxa8 h5 28. Rd6+ Ke7 29. Rxa7+ Kf8": "e8 m'aurait fait chier quand même... Mais bon, la partie était pliée.",
        "30. Rd8#": "Bien joué le début de partie Padre!"
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-matt_s?gm=7110",
    "gameName": "Challenge from matt_s",
    "players": "matt_s (1200) vs. adrien_d (1200)",
    "opening": "KGA (C34), Schallop defence"
}