{
    "moves": {
        "1. e4": "Sycil--here are my thoughts on what I thought were turning points in our game.  Please comment if you like.",
        "1... e6 2. d4 d5 3. Nc3 Nf6 4. e5": "Seeing this opportunity to bully early, I thought I would try to suffocate black by taking over as much territory as possible. ",
        "4... Nfd7 5. h4": "This seemed an interesting way of trying to box black in.  As black's queen's bishop is blockaded by forced night move 4...Nfd7, castling queenside is a lengthy process.  Here I try to make a kingside castle unattractive as well...",
        "5... c5": "...but unwittingly give black strong counterplay.  From this early position, the fascinating aspect of this game is established:  black advancing on files a-d, white advancing on e-g.  The momentum of the game seems to rotate counter-clockwise around the center.",
        "6. Be3 Qb6 7. b3": "As sycilmathai points out, white misses an opportunity to advance the knight here.  7.Na4 Qa5  8.c3 b4? 9. Nxc5 has the effect of furthering the interesting left-right asymmetry of the position.",
        "7... cxd4 8. Bxd4 Qc7 9. f4": "Need to protect the e pawn, and all too happy to continue my march on black's kingside.",
        "9... Bb4": "Far from being constrained as I had hoped, here black is able to turn the tables with two highly effective moves, which develop and threaten.",
        "10. Qd3": "An inaccuracy?  White needs to deal with the pinned, double-attacked knight; castling out of the pin still seems attractive, providing more firepower to the hoped-for (and unrealised) kingside breakthrough.  But 10. Qf3 seems to accomplish the same and more, focussing white's queen on the king side, where I want to push, while providing an open lane for the LSB.",
        "10... Nc6": "Black has sucessfully taken initiative and  will hold it for the remainder of the game, with the exception of one or two moves.  By expending energy on pawn moves early, white has ceded momentum, and is largely unable to shift focus to the kingside.",
        "11. Nge2": "Effectively covers c3 and d4 which both need it.  However, blocks in the LSB, which remains impotent late into the game.",
        "11... Nxd4 12. Qxd4": "Forced.",
        "12... Qa5 13. O-O-O": "Sketch!  But 13...Bxc3 14. Nxc3 Nc5? with a possibility of sacking on b3 seems to be black's only quick way of taking advantage of the weak castle, and I feel confident that I can still run a hurry-up offense on the king side.",
        "13... b6": "Black's one concession of initiative...",
        "14. g4": "...allows for white to further its advance.  But here shows perennial problem for benrous.  After the insipriation of 5.h4, white has now expended three moves on kingside pawns without yet succeeding in threatening a single of black's pieces.  With 14. g4 white threatens f5 next and an effective kingside breakthrough, but the threat is too slow-moving to maintain initiative.  Perhaps if 10. Qf3 instead of d3, white would have had the opportuity for 14. f5 and a sustained attack.  I still fail to do what I have seen done so effectively, namely the advancing of a SINGLE pawn as a thorn in the king side.  In this game, MANY pawns are shown to be cumbersome.",
        "14... Ba6": "The weakening of black's pawn on e6 makes my mouth water for f5, but I continue to be forced to react to black's mounting threats.  15...bxe2 16. Nxe2 Bc5 with the threat of 17...Qxa2 was scary.",
        "15. Rh3": "This move looks strange, and marks is the beginning of a fatal period of ineffective circling in my own territory (multiple rook and bishop moves follow).  Was 15. Kb1 better?  Still passive, but  protects the a pawn and allows the lame LSB slightly more room.",
        "15... Rc8 16. Kb1": "The stranglehold tightens; white's attack is completely dormant.",
        "16... Bxe2 17. Nxe2 O-O": "17...0-0!  Black correctly calculates the ineffectiveness of white's attack, and boldly castles into the oncoming pawns.",
        "18. f5": "Mistimed.  More pieces needed to be involved in the kingside breakthrough, especially after black's excellent castle.  As played, the long-awaited pawn push does little other more than open a file for black's rook and suicide white's e pawn.  Here benrous shows his beginner's tendency to remain attached to a preconceived gameplan rather than staying awake to the constant flux of the game.\n\nGiven white's poor positioning, especially the blocked-in LSB and the weak castle which requires rook and knight to stay protective of the weak c3 square, it is hard to find a better move in this position--a \"quiet\" move seems called for.",
        "18... Qc5": "And black seals the deal by threatening c2 and forcing the queen trade.",
        "19. Qxc5": "Forced.  White cannot allow 19...Qxc2 .  19. Qd3 Nxe5 and threatening the white queen is a crushing attack.  The only other option, 19. Rc1, may have been marginally better, but in either case black succeeds in trading queens.",
        "19... Bxc5 20. fxe6": "The second time white has had initiative since 5. h4.  Unable to protect the e pawn, white presses on with a doomed strategy.",
        "20... fxe6 21. Bg2": "Pathetic.  21. Ne4 would have be nice but first the bishop must be moved to its only available square.",
        "21... Nxe5 22. Rhh1": "Terrible.  At least 22. g5 would have saved the pawn.  It is hard to remember what I was trying to accomplish, but I do remember calculating that material could be equalized.",
        "22... Nxg4 23. Bh3": "At last the bishop is in commission....",
        "23... h5": "...sort of.",
        "24. Nd4 Rf2 25. Nxe6 Ba3": "Black now exploits the weakness of white's castle.",
        "26. Nd4": "Serves the double purpose of protecting c2 and pinning black's knight.",
        "26... a6 27. Rhg1 Bc5 28. Bxg4 hxg4 29. Rxg4 Bxd4 30. Rgxd4 Rcxc2 31. Ra4 a5 32. Rxd5 Rce2 33. Rd1": "White has equalized material but is completely hogtied.  I considered myself lost in this position.",
        "33... Rfh2 34. Rc1 Kh7": "Considered resignation at this point.  With my king blockaded on the first rank and my rook pinned to the a file, I saw no way of stopping black's push.",
        "35. Rc6": "Completely ineffective--a waiting move.  Doesn't even brush back the tempo of the advance of the black king.",
        "35... Rh1+ 36. Rc1 Rxc1+ 37. Kxc1 Kh6 38. a3 Kh5 39. b4": "??  I considered the h pawn lost, and thought this the only viable move, even though I anticipated the pinning 39. Re4.  I just played on hoping for a blunder.\n\nIndeed, 39. Rd4 leads to all sorts of variations that look at least superficially closer to a draw.  In the end my losing mentality seems to have done me in.",
        "39... Re4 40. Kc2 Kxh4 41. Kb3 g5 42. bxa5 Rxa4 43. Kxa4 bxa5": ""
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-sycilmathai?gm=15083",
    "gameName": "Challenge from sycilmathai",
    "players": "benrous (1200) vs. sycilmathai (1443)",
    "opening": "French (C11), Steinitz, Bradford attack"
}