{
    "moves": {
        "1. e4 c5 2. d3 Nc6 3. c3": "Well, I never played a game like this one (I mean the opening).",
        "3... Nf6 4. Bg5": "Bg5? f4 was a lot better.",
        "4... e6 5. Nf3 d5 6. Nbd2 Be7 7. e5 Nh5": "Nh5? Bad mistake...",
        "8. g4 Bxg5": "The only possibility was this, I think.",
        "9. h4 Bxd2+ 10. Qxd2 Nf6 11. exf6 Qxf6 12. Bg2 O-O 13. O-O-O": "He could make O-O. But the King stay a little discovered both.",
        "13... d4 14. g5 Qe7 15. c4 Nb4 16. Qf4": "Qf4? Na2 .",
        "16... Nxa2+ 17. Kb1 Nb4 18. Ne5 f6 19. gxf6 Rxf6 20. Qg3 a5": "I see the possibility to discover White's King more.",
        "21. Be4 g6 22. h5": "h5!",
        "22... g5": "ehm....Maybe it wasn't the best move for me.",
        "23. Qxg5+ Kf8 24. Rhg1 Ke8 25. Qg8+ Rf8 26. Qg5": "Qg5?! Why to look for an exchange while he's attacking?",
        "26... Qxg5 27. Rxg5 h6 28. Rg6 a4": "I watched f2 but in this moment it's a little too dangerous.",
        "29. Kc1 a3 30. Kd2": "Kd2?? Maybe he thinks a1 is covered by the R but was b:a3 better?",
        "30... a2 31. Ra1 Rxf2+": "Yeah, it was a little too dangerous but this is a  .",
        "32. Ke1 Nc2+": "Nc2 !",
        "33. Kxf2 Nxa1 34. Rg8+ Ke7 35. Rg7+ Kf6": "Kf6!! Probably !! is too much, but in this way he loses the R or the N.",
        "36. Rg6+ Kxe5 37. Bg2": "Maybe in his mind there's Bh3, but there's no problem in that way...",
        "37... Nc2 38. Rxh6 a1=Q": "This is the result of a bad-played middlegame.",
        "39. Rg6 Qe1+ 40. Kf3 Qe3+ 41. Kg4 Qf4+ 42. Kh3 Qf5+ 43. Rg4 Qxh5+": " s to take the pawn that was a very little danger, anyway.",
        "44. Kg3 Kd6": "Kd6 to avoid  s.",
        "45. b4": "hahaha he tries!",
        "45... Nxb4": "but he didn't see the N.",
        "46. Kf4": "Kf4? Of course there were better solutions. This is a mate in 2 for who wants to make a puzzle.",
        "46... Qe5+": "But he resigns in this moment. Ehm....if he didn't make those mistakes, I don't know if I would survived!\r\nAnyway, tell me bad moves I omited in this annotation. Thanks for reading, BYE!"
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-fortune42?gm=19098",
    "gameName": "Challenge from fortune42",
    "players": "fortune42 (987) vs. andy94 (1408)",
    "opening": "Sicilian defence (B20)"
}