{
    "moves": {
        "1. d4 d5 2. Nf3 Nc6 3. c4 Bg4 4. e3 e5": "This leads to some sharp lines in this game. ",
        "5. cxd5": "The correct response. Because this weakens blacks centre. As well, it checks the knight and forces black to lose tempo in recapturing with the Queen.",
        "5... Qxd5 6. Nc3": "Gaining a tempo by attacking the queen and develops another piece. ",
        "6... Bb4": "pins the knight against the king. ",
        "7. Bd2": "breaks the pin and threatens to capture the queen. This forces the exchange and gives white the positional plus of the bishop pair. ",
        "7... Bxc3 8. bxc3": "This is stronger than Bxc3 as it increases the mobility of my pawn chain and threatens to take complete control of the centre via c4. ",
        "8... e4": "Hin-sight being 20/20 black should  have just continued his development. This central attack is too early. He violates open principles like develop your pieces before you start an attack. White easily repeals Black's attack because of his superior position and mobility. E4 looks dangerous but it is premature as it allows me to grab an iron grip on the centre. Plus the pawn for now is weak because black can only defend it with a piece. \n\nBlack best move in my opinion is to complete his development with 8. ...Nf6. I would have replied with Be2 preparing for the exchange on c3.",
        "9. c4": "In this game I gain massive central pawn structure and space advantage. Black's 8. ...E4 is already looking dubious.",
        "9... Qd6 10. h3": "forcing black to clarify the position. Here black can create a permanent weakness in White's pawn structure with the exchange on c3 with semi equality. The advantages of the exchange from White's perspective is that I can use the open file to create an attack on g7 as Black has exchanged his dark bishop. This makes the defense of g7 difficult. ",
        "10... Qh6": "Here black prevents the immediate capture of the bishop because of the pin on the rook. However I have a plan that is banking on the fact that white will capture the rook. But before I can do that I must prepare for it. ",
        "11. d5": "This move is a strong replay because black is running out of room. From here on in black will suffer from a weak king in the centre and lack of development. After the upcoming exchange I will have a massive attack against the king that makes up for the lost rook. Black's pieces are hopelessly discontacted and tripping over each other. Furthermore, Black will have to waste precious more time because his queen will be out of position after it captures the rook.  \r\n\r\nBlack's best defense is 11. ...exc3 12. gxc3 13. Bh5. Black maintains the balance. ",
        "11... Ne5": "Black fail to play the best. 11. ...exc3 was a must.\n\nNce7 is too passive. After 12. Qa4  and Rb1 Black is in serious trouble. ",
        "12. hxg4": "My threat is Qa4 with a dangerous attack against the king.",
        "12... Nd3+": "This meets the threat of Qa4  and forces white to capture with the bishop. Which allows black to take the rook with check, saving tempo. Therefore white will not have time to play Qa4  If Black plays 12. ...Nf3  then White has the following reply. \n\n13. gxf3 Qxh1 14. Qa4 ! Kd8(not 14. ...Kf8? 15. Qb4  Ne7 16. Qxb7 Re8 {16. ...Rc8? 17. Bb4 Re8 18. Qxc7 and white wins outright!) 15. Rb1!(the b pawn falls) b6 16. C5 and Black's queen side is destroyed. \n\nthis analysis hold true for Nce7 as well. ",
        "13. Bxd3 Qxh1+ 14. Bf1": "All of whites pieces have been developed and enjoy complete mobility. Black however has had all his developed pieces removed. ",
        "14... exf3 15. Qxf3": "notice after the exchange how black only has one piece in play. The queen is totally out of play. Whereas, White has plenty of room and mobility. white has no weak spots. Contrastingly Black has four weak pawns(g7,f7,c7 and b7) and his kings is exposed in the centre. Black has nothing for his material advantage.",
        "15... Qh6": "If Black plays 15. ...Nf6 then....\n\n16. G5 Nd7 17. Qe4  Kd8(Kf8 is met with 18. Bb4 ) 18. d6! Kc8(18. ...cxd6 is met with Ba5 ) 19. dxc7 and Black is defenseless. ",
        "16. Rb1": "Attacking the weak b7 square. ",
        "16... Rb8": "16. ...b6 is met with force by 17. d6",
        "17. e4": "discovery check on the queen. As well the strength and scope of my bishop is increased.",
        "17... Qf6": "Black offers the exchange of queens, I think not!",
        "18. Bf4": "This makes d6 impossible to stop now. Although White is technically behind in material I am really positionally ahead by a Knight and rook. The only piece that black has active is his queen!",
        "18... Qe7": "defends c7",
        "19. d6": "The nail in the coffin. White regains the pawn and his advantage becomes even more real. ",
        "19... cxd6 20. c5": "regaining the pawn because the pawn is pinned against the rook.",
        "20... Qe6 21. Bxd6": "destroys any hope that black has of whisking his king to safety via castling king side ",
        "21... Qxa2 22. Bb5+": "The mating net has been set. ",
        "22... Kd8 23. Rd1 Qa5+ 24. Rd2 Qxb5": "This speeds the end. ",
        "25. Qxf7": "Black has a few spite check and then it is over. "
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-elyhim?gm=10358",
    "gameName": "Challenge from elyhim",
    "players": "elyhim (1754) vs. stryke (1916)",
    "opening": "Queen's pawn game, Chigorin variation (D02)"
}