{
    "moves": {
        "1. d4": "This game was not pretty equal. I was  at least 200 points rating lower than my opponent and he won the first easily.\r\nI was surprised he agreed for a rematch, because i was not strong enough.\r\n(but there was a reason behind!)\r\nLet's go with d4, my favorite 1st move.",
        "1... Nf6 2. Nc3 d5 3. Bg5": "Most of my games begin like that.\r\nMy computer chessgame tells me this is not so good, but i like it.\r\nI must say i often have trouble in classic games, but in blitz with short time,\r\nit surprises opponents, and i win many games that include this opening.\r\n\r\nOne more detail: we both play very fast; even if it is a 2 days per move game, the maximum is 3 minutes between 2 moves (both addicted to the game that night!).",
        "3... c6 4. e3": "It closes the road back for my bishop, but it puts pressure, threaten the Queen if e7-e6, may force opponent to move h&g pawns.",
        "4... Nbd7": "often seen defense.",
        "5. Nf3": "Many times, i have trouble with Bd3 or Nge2, so in front of a high player, i try Nf3.",
        "5... Qb6": "If b3, c3 is pretty threatened; if Rb1 i cannot play O-O-O later (i want to keep the possibility at the moment). So i decide not to develop and defend with the Q.",
        "6. Qc1 e6 7. a3": "Maybe another mistake, but i dont want Bb4 because my K is in the middle and my other N cannot be easily on e2 to defend.",
        "7... Be7": "still developing, whites are pretty sad.",
        "8. Be2": "I think i have to play O-O. I dont think Bd3 would be better, if e5, and Nd7 moving, B can threaten my N moving on g4.",
        "8... h6": "Often what i want beacause i want to break Blacks' O-O.",
        "9. Bh4 Bd6 10. Bg3": "No need to attack N anymore. I think h line opening is good for me at the moment but maybe i should have played O-O.",
        "10... Bxg3 11. hxg3 e5": "here come the classic problems with my opening: centre is attacked, and i can hardly resist.",
        "12. Nxe5": "I want to forbid e4, would be powerful pressure. I wanted to play dXe5 but I was afraid of a 2 N attack opening Bc8 attacks, and allowing d4. Im so bad positioned here that i want to take off the board pieces. ",
        "12... Nxe5 13. dxe5": "2 N out.",
        "13... Ng4": "I think f2pawn is my best defense and dont want the N to put pressure on it. I also want to keep my e5 pawn alive few moves; and still want to take out material.",
        "14. Bxg4 Bxg4 15. O-O": "Was a hard decision. I thought i wouldn't be alive so long: the Blacks have a strong B, pawns can come on K's side, d4 can be played at any moment, he can castle; and my Ra1, Q and N do not play at all.",
        "15... O-O-O": "1st happy surprise: If O-O, i thought i had no way to attack. Blacks must think the RR will help fgh pawns to come. But Whites can wake up because RQN are on the right side of the board and can try something.",
        "16. b4": "Let's try to be faster than Blacks in the attack.",
        "16... g5": "b4... and g5 answer.",
        "17. Na4": "Many reasons for that move: let c2 pawn come in the game, attack the Q with tempo, to move then on c5... and Blacks cannot move to attack, because of threatened Q.",
        "17... Qc7 18. Nc5 Qxe5": "e5 pawn finally out. But it allows another won tempo with Nd3 frightening again the Q.",
        "19. Nd3 Qc3": "The Q comes inside but does not seem so embarassing.",
        "20. Rb1": "planning to destroy Black K's pawns-wall.",
        "20... Be2": "Instead of playingnew pieces, blacks play again with Bishop. I was happy the blacks'rooks still out of the game.",
        "21. Re1 Bxd3": "My 2nd happy surprise of the game: i can take out the B and my K is in a pretty safe place. Another piece out that wont attack anymore.",
        "22. cxd3 Qxd3": "Happy(again). Whites thank the Blacks because they prefer a pawn instead of taking out the Qs. My 3 bullets-weapon can be used now: RRQ are watching the lonely Black K, moreover with half-opened c line.",
        "23. b5 Kc7 24. bxc6 bxc6": "Now, c line is opened.",
        "25. Rd1": "Time to make the 2nd rook come in the game.",
        "25... Qe4": "Now the blacks will always go back to their part of the board.",
        "26. Rd4": "again...",
        "26... Qe7 27. Rb5": "1 move i like because i think it was hard to find (maybe a best one exists, but i dont know it at the day of annotation). Of course, c pawn cannot move (K behind), and now i can double RQ on c line, i can take d pawn and we would have 5 each.",
        "27... a6 28. Rc5": "c6 will not last long...",
        "28... Qe6": "trying to defend",
        "29. Qc3": "the Q is watching a5 square and h8.",
        "29... Kd7": "K doesnt want to be a target and try to go to hide behind f pawn.",
        "30. e4": "why not opening the center now?",
        "30... Ke8": "still running, but c pawn is now dead.",
        "31. Rxc6 Qe5": "Q on e5 to forbid Rd4 to move.",
        "32. Rc5": "The pressure on d5... and Q behind.",
        "32... Kf8": "K managed to leave Queen's side: if he had played O-O, he would have never faced so big trouble and Whites would have lost.",
        "33. Qb4": "I played fast to threat the K behind the R, but it meant nothing because the K can hide, and my Q will have to move again.",
        "33... Kg7 34. exd5": "Cannot attack K, so the Whites decide to be the master of the centre of the board.",
        "34... Rdb8": "Hehe, bad Q move before, now that's time for Blacks to move their rooks, and most of all, allow Rh8 to come in the game.",
        "35. Qd2": "Q helps again the d pawn and the Rd4",
        "35... Rhe8": "The Blacks double on e line , control b line, white K pretty threatened now, Whites cannot make another mistake now.",
        "36. Rc3": "Whites think the danger is not so big, so they want to allow d pawn to go on, so they move Rc5",
        "36... Rb1+": "Blacks try to come back in the game",
        "37. Kh2": "the only move. Then, g4 seems deadful, but Rd4 forbids it.",
        "37... Qe1": "Blacks play too fast and dont think enough: without Qs on board, the Whites are too strong with d pawn.",
        "38. Qxe1 Rexe1": "Rh2 is mate. But g3, and White K is again in a safe place.",
        "39. g4 Re7": "Without Q, Blacks rooks cannot attack and come back to defend.",
        "40. d6 Rd7 41. Rc6": "Threatening a pawn.",
        "41... a5 42. Rd5 Kf6": "No way for a5 pawn, Blacks decide to play with K now.",
        "43. Rxa5 Rd1": "d6 is dead, but a3 wins the game.",
        "44. Raa6 Ke6 45. Kg3": "the K will come in the game to eat greedy the f g h pawns.",
        "45... Rd3+ 46. f3 Rd7xd6": "This is the end for Blacks: without rooks, a3 is really THE winner of the game.",
        "47. Rcxd6+ Rxd6 48. Rxd6+ Kxd6": "If the black king goes to a3, white king wins on fgh lines; if the black K keeps defending, a3 becomes a Queen.\r\nMany people, nearly everyone, would resign now (or before), but the game will go on till the end.\r\nThe reason: Blacks' player wanted to become a 1800 rating player; he did not want to think, he just wanted to play fast vs lower opponents and win quick victories.\r\nThe lesson: if a higher player does not respect you, use the mistakes because he will make 1... or many.\r\nWhy i annotated the game: to show it to any internet player, because i am proud to beat that kind of stronger player that do not respect the lower opponent.\r\nThe jokes: he asked a draw, then put a postponment for many days, and we played it 2-3minutes/move, then it was 45hours/move.\r\n\r\nI hope you do not think that game was boring. Bye all!",
        "49. Kf2 Kc6 50. Ke3 Kb5 51. Ke4 Ka4 52. Ke5 Kxa3 53. Kf6 Kb3 54. Kxf7 Kc4 55. Kg6 Kd5 56. Kxh6 Ke6 57. Kxg5 Kf7 58. Kf5 Kg7 59. Ke6 Kf8 60. f4 Ke8 61. f5 Kf8 62. g5 Ke8 63. g6 Kf8 64. f6 Ke8 65. g7 Kd8 66. f7 Kc7 67. f8=Q Kc6 68. Qb4 Kc7 69. g8=Q Kc6 70. Qc8#": "(Finally, he had to lose all the games he did not want to go on: and now he's again lower than 1800  ;) ---> rating on gameknot may be a joke!)"
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-jerofpara?gm=31183",
    "gameName": "Challenge from jerofpara",
    "players": "jerofpara (1567) vs. jwg1977 (1770)",
    "opening": "Queen's pawn game (A45)"
}