{
    "moves": {
        "1. e4 c5 2. Bc4": "The most common here is 2.Nf3. It is not obvious where the bishop should go yet so it is better delayed.\n",
        "2... e6": "Planning to advance in the centre with tempo by d7-d5\n",
        "3. e5": "I guess you wanted to prevent me from carrying out my plan. There is a danger that the pawn ends up weak here though (or you will have to weaken your position by f2-f4 to protect it, when after I play d7-d6 or f7-f6 and you exchange, your pawn structure is not very good with worse central foothold and a weakened kingside)\n",
        "3... Nc6 4. Nf3 d5": "Here I considered attacking the pawn with 4.-Qc7 and it might have been a better option. After you protect it with 5.Qe2 I might even play 5.-g5 with the idea to exchange my flank pawn to your centre pawn after either 5.Nxg5 Qxe5 or 6.h3 Bg7\n",
        "5. exd6 e.p.": "e.  p.\n",
        "5... Bxd6 6. O-O Nf6 7. Qe2 O-O 8. d3 h6": "g5 was a natural development square for your bishop, so I am trying to embarass it a little\n",
        "9. Nc3 a6": "In the Sicilian defense Black often gains queenside space like this,\n",
        "10. a3": "Understandable that you are nervous about your bishop. Preventing my queenside expansion for now by a4 was maybe a better option, then you could later play Ne4 without having to worry about me getting to play b7-b5 and c5-c4.\n",
        "10... b5 11. Bb3": "It's more logical to drop the bishop all the way back to a2 now that you made a \"loophole\"\n",
        "11... Bb7": "Black has some advantage here. I have natural moves to improve my position like Re8, e5, Nd4, Rc8, Qc7 while it's difficult to figure out what to do next as White.\n",
        "12. Be3 e5": "Planning Nc6-d4 when after the exchange Be3xd4 e5xd4 both my bishops would point quite menacingly at White's kingside. I might also prepare Nd4 by Rf8-e8.\n",
        "13. Bd5": "This almost loses material by force. Your best was probably 13.Nd2 planning to get a knight on the e4-square.\n",
        "13... Nxd5 14. Nxd5 Nd4 15. Bxd4 exd4 16. Qe4": "Now you lose the knight since after Bxd5 you cannot recapture by Qe4xd5 because the discovered attack Bd6xh2+ wins the queen. Only chance was 16.c4, even though after something like 16.-dxc3e.p. 17.Nxc3 Re8 18.Qd1 (cannot allow Bb7xf3 destroying the king's shelter) Qd7 black's bishops are much stronger than the knights in an open position like this and the d-pawn is weak as well.\n",
        "16... Bxd5 17. Qf5 g6 18. Qh3 Kg7 19. Rae1 Be6": "Trying to force you to exchange queens. You're right to keep them on in a situation as hopeless as this, since with such a big material advantage it would be too easy to win the endgame if you allowed the exchange of Queens by Qh4.\n",
        "20. g4 Qd7 21. Ne5 Bxe5 22. Rxe5 Bxg4 23. Qg3 Rac8 24. Rfe1 Be6 25. Rh5": "You do a pretty good job of trying to muddy the waters here but my material proves too much with a little accuracy\n",
        "25... Rfe8 26. Re4 Bf5 27. Rf4 Re1+ 28. Kg2 Kh7": "Protecting the f5-bishop by unpinning the g-pawn.\n",
        "29. Rhh4 g5 30. Qxg5 Qd5+": "This trick allowed me to play g5 on the previous move. I win the queen now.\n",
        "31. f3 Bh3+ 32. Kxh3 Qxg5 33. Rxf7+ Kh8 34. Rff4 Rg1 35. Rfg4 Rxg4 36. fxg4 Re8 37. Rh5 Re3+ 38. Kg2 Qxg4+": "Hope my commentary was useful. :)\n"
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-baba-yaga-http-gameknot-com?gm=22856",
    "gameName": "Challenge from baba-yaga, http://gameknot.com/",
    "players": "zagor71 (1405) vs. baba-yaga (2193)",
    "opening": "Sicilian defence (B20)"
}