{
    "moves": {
        "1. e4": "This game features one of the sharpest lines in the Najdorf/English Attack.  Black chooses the continuation 8...h6, where, as Finnish IM Tapani Sammaluvo puts it, Black burns his boats behind him.  His king will never castle, at least not on the kingside, however, his pieces can develop freely and White is unable to stop Black's freeing d5 break.  White's pieces develop quickly also and the play becomes razor sharp.",
        "1... c5 2. Nf3 d6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 a6": "The Najdorf proper.",
        "6. f3": "The modern move order.",
        "6... e6": "Black prepares a Scheveningen setup, where he has considerable counterchances despite White's lead in development and space.  Black has one more center pawn than White so is the only side with the reasonable expectation of a center break.  Black can attempt to exploit this early f3, with an immediate 6...Qb6 or 6...b5.",
        "7. Be3 b5": "Wasting no time in attacking the Queenside.",
        "8. g4": "The correct move order, as if Black wants to play lines where he stations a knight on b6, he has to play the unnatural ...Nfd7, as 8...Nbd7?! is met with 9. g5, which sidelines the knight.",
        "8... h6": "The super-sharp main line.  A major battle is about to erupt.",
        "9. Qd2 b4": "9...Nbd7 is more popular and solid.  This move is recommended by GM John Emms.",
        "10. Na4": "10. Nce2 is the conservative approach, but nothing about this game so far has been conservative and far be it for me to be the party pooper!!",
        "10... Nbd7 11. O-O-O Ne5": "A deviation from main line theory.  11...d5!? is unrefuted at the highest levels of play according to IM Tapani Sammaluvo in his book on the English Attack, 2004.  This move however, does have its master level adherents.",
        "12. Qxb4": "My turn to deviate.  The line recommended by GM Bezgodov is 12. a3 Rb8 14 ab Qxb4 15. Qxb4 Rxb4 16. h3 d5 , where Sammaluvo chimes in and gives 17. c3 Rb8 18. f4, followed by e5 gives White an advantage.",
        "12... Bd7": "Trying to exploit the placement of the a4-knight, as the White queen can become trapped on the queenside.",
        "13. Nc3": "Exclam.  The White queen has nowhere to go, but I had just read David Lemoir's book on knight sacrifices on the queenside in the sicilian and had a special treat prepared for my opponent.",
        "13... Qc7": "13...d5 or 13...Rb8 are alternatives, however, I will spare readers the analysis of all the lines that I have written in my private play book.",
        "14. Qb3": "Protecting d5.",
        "14... d5": "Very nice move!!  Black achieves his break and is looking good.",
        "15. exd5 Rb8": "Trapping the queen, this is probably the most testing move.",
        "16. Ncb5": "This passive sacrifice allows me to rip open the Black king position and rain holy fire and damnation on his majesty.",
        "16... axb5 17. dxe6 fxe6 18. Nxe6 Qc6": "18...Bxe6 19. Qxe6  Qe7 20. Qxe7  Bxe7 21. Bf4! Nfd7 22. Re1 Bd6 23. f4 and White wins his piece back and has a 3-to-1 majority on the queenside, and a won endgame.",
        "19. Nd4": "Gaining a tempo.",
        "19... Qa6 20. Bf4": "The first pin.",
        "20... Bd6 21. Re1": "The second pin.",
        "21... Qa5": "I thought this was a clever move.  Black still loses the piece, but my opponent is very resourceful.",
        "22. Bd3": "Aiming at the weak g6-square.",
        "22... b4": "Discovering a defender on the pinned piece, but there is a nice tactical shot which causes the Black position to collapse.",
        "23. Nc6": "Here I win back my material and retain the attack.  Black is objectively lost.",
        "23... Bxc6 24. Qe6+ Be7 25. Rxe5": "Regaining the piece with a huge advantage.",
        "25... Qc7 26. Bg6+ Kd8 27. Rd1+ Bd7 28. Qxe7+": "Here black resigns as 28...Kc8 is met with 29. Rc5, winning the queen.  "
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-sicilian_monster?gm=1437",
    "gameName": "Challenge from sicilian_monster",
    "players": "mybookrunsdeep (1932) vs. sicilian_monster (1838)",
    "opening": "Sicilian (B90), Najdorf"
}