{
    "moves": {
        "1. e4": "Bryitis is new to Chess, so go easy on him.",
        "1... Nf6": "I had to look up this opening, the Scandinavian defense.",
        "2. e5 d5": "Oops!",
        "3. exf6": "I was thinking about taking the pawn by en passant just for shits, but I thought better of it.",
        "3... gxf6": "I think exf6 may have been better, to keep the king's pawn row intact for casting.",
        "4. d4": "With this pawn structure I can see a black pawn on e5 being a big problem for me, so I immediately start discouraging that notion.",
        "4... Nc6 5. Nf3": "More fighting over the e5 square.",
        "5... Bg7 6. Bb5": "Kindof an odd Queenside Ruy Lopez now. Strange.",
        "6... Qd6": "I don't know what he's planning with his queen here. Still to early to move the queen out without a good reason, in my opinion.",
        "7. O-O": "I'm not quite sure what he intends to do with that Queen so I'm not taking any chances.",
        "7... a6 8. Ba4 Qb4": "Is this what he was planning? To take the Bishop?",
        "9. Nc3": "If so, it's a pretty easy defense.",
        "9... b5": "This one comes with a question mark or two. The undefended d5 pawn needs to be dealt with first. Also I'm not quite sure what this move hopes to accomplish, as it wrecks the queenside pawn structure, and the Bishop has an escape square on b3.",
        "10. Nxd5": "At this point, Black will be hard pressed not to lose at least a rook.",
        "10... Bg4": "Oops!",
        "11. Nxb4 Nxb4 12. Bb3": "I'm actually happy with this diagonal, I love how it puts pressure on the f7 pawn.",
        "12... Rd8": "Black's plan is obvious: Attack the d4 pawn.",
        "13. Bf4": "I'm hoping this attack on the c7 pawn distracts him from my real goal. (His King, obviously.)",
        "13... f5": "I was waiting at any time for him to push e5, at which point I would Qe2, preventing him from capturing with the pinned pawn. f5 however opens up a reveal on my d4 pawn from his Bishop, a pawn that I don't care about anymore.",
        "14. Qe2 Nd5 15. Bxd5": "I'm all too happy to trade with a comfortable lead on material.",
        "15... Rxd5 16. Bg5 c5": "He mistakenly thought that the rules allow a player to castle out of check, so he wasn't concerned with the e7 threat. Oops!",
        "17. Qxe7#": "Good game."
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-bryitis?gm=25335",
    "gameName": "Challenge from bryitis",
    "players": "bsvino2 (1200) vs. bryitis (1200)",
    "opening": "Alekhine's defence (B02), Mokele Mbembe (Buecker) variation"
}