{
    "moves": {
        "1. d4": "Standard opening for me at present, happy to play the QP, BDG or Stonewall",
        "1... Nf6 2. Nc3": "Looking to transpo into the BDG after d5",
        "2... d5 3. e4 dxe4 4. f3": "Standard BDG setup ",
        "4... exf3 5. Nxf3": "I find this is the quieter way of playing the BDG, have seen some interesting games with Qxf3 instead",
        "5... Bg4": "h3 is again a book move, however in hindsight against this opponent I do not want to give the the pawn headstart and let him blow open my king cover",
        "6. h3": "I believe I will start trying some alternatives to this h3 move.\n\nOptions:\nBd3 is a good developing move and allows the short castle\nBg5 is also an attacking developing move\n\n\n",
        "6... Bh5 7. g4": "This is the position I did not want to be in, played a similar game recently where I managed to win from here but I feel too exposed",
        "7... Bg6 8. Ne5": "Probably one of my better moves as he cannot bump me off without threatening his bishop, expecting Nc6",
        "8... e6": "I was surprised to see e6 here, can only assume he wanted to open up the dark bishop",
        "9. Bg2": "I contemplated carrying through with one of my earlier thoughts of taking the bishop with Nxg6 but felt that the knight was causing more trouble where it was at present, although the Nc6 or Bd6 would put pressure on it.\n\nChose to play Bg2 to attack the unprotected pawn at b7",
        "9... c6 10. O-O": "Trying to get the king to safety 'of sorts'",
        "10... Bd6": "He is putting more pressure on the e5 sqaure and has double protection on the e4 and d5 squares",
        "11. Bf4 Bxe5 12. Bxe5": "Still down a pawn but feel like I am ahead in development at this stage which is the sacrifice of the BDG gambit",
        "12... Nbd7 13. Bxf6": "I took the knight here, as I did not want to have Nxe5 dxe5 Qxd1 and heading towards an endgame, a better option could have been Bh2 keeping the diagonal open for h2-b8",
        "13... Nxf6 14. Ne2 Qb6": "Pinning the pawn at d4 and threatening Qxb2",
        "15. b3": "Taking away the threat to b2",
        "15... O-O-O 16. c3": "Increasing support to d4",
        "16... e5 17. Kh2 exd4 18. cxd4 h5 19. g5 Qc7+ 20. Kg1 Ne4 21. Nf4": "That bishop on g6 is starting to haunt me now, protecting some valuable squares!",
        "21... Qb6 22. Nxg6": "Trying to take some pressure off the center, not realising that Martin had a double attack on the d4 square",
        "22... Rxd4 23. Qxd4": "I couldn't see a better option here but the GK computer post game analysis said I could play \n\nBest: -4.45 » 23. Ne7+ Kb8 24. Qe1 Rd1+ 25. Kh2 Rxe1 26. Raxe1 Qc7+ 27. Kg1 Qxe7 28. Rxe4 Qc5+ 29. Kh2 Rf8 30. h4 Qd6+ 31. Kh1 c5 32. a3 Kc7",
        "23... Qxd4+ 24. Kh2 fxg6": "Just a matter of time now",
        "25. Rad1 Qe5+ 26. Kg1 Nc3 27. Rde1 Ne2+": ""
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-ipsissimus?gm=58270",
    "gameName": "Challenge from ipsissimus",
    "players": "immortalpawn (1460) vs. ipsissimus (2407)",
    "opening": "Queen's pawn game (A45)"
}