{
    "moves": {
        "1. e4 c5 2. Nf3 d6": "Sicilian defence",
        "3. d4": "I guess I thought being aggressive would mean I dictate the game. Being white I wanted to use that tempo advantage to stop you running rings around me. It didn't work! From now on I'll save this aggressive style for lower rated players I think.",
        "3... Nf6 4. Nc3 cxd4 5. Nxd4": "After the exchange on d4 I feel I am in quite a good position here. Nice centre control, and both bishops free to move whereas one of yours is blocked in.",
        "5... Nc6 6. Bc4": "Preparing to castle early.",
        "6... Bd7 7. Bg5": "Looking back this move makes no sense to me. I suppose I was just thinking lets get all the minor pieces developed.",
        "7... Qa5": "Good  move from you, pinning the knight down and threatening the bishop. I think maybe you were hoping for the upcoming exchange on f6, giving you the bishop pair. Since this game, I've found out that in grandmaster play trading a bishop for a knight isn't seen as a good move. Here though, I'm sure I thought that the bishop and knight were worth exactly the same.",
        "8. Bxf6 gxf6": "Well at least you have the doubled up pawns here. I never got the chance to take advantage though!",
        "9. O-O": "Finally I castle. My king is quite safe (for now).",
        "9... Qc5": "Forcing me to do something about the double threat to my knight on d4, as well as my bishop on c4.",
        "10. Nxc6": "The exchange is all I saw here. It benefits you though as with the knight on d4 gone your queen is looking quite menacing to my f2 pawn and the king it's defending.",
        "10... bxc6 11. b3": "Trying to keep the bishop where it is to maintain at least some centre ground. But maybe retreating the bishop to d3 or e2 would have been better.",
        "11... h5": "Starting an attack down the kingside which would eventually be my downfall.",
        "12. Na4": "This move is awful from me. Instead of moving the knight towards the kingside to help out against your upcoming onslaught, i decide to put it on the rim of the board on the queenside! My thinking must have been just to get your queen away from the centre but this is really a poor move, the knight is now useless for the rest of the game.",
        "12... Qa5 13. a3": "I'm preoccupied with trying to force a retreat from your queen. I guess I was thinking pawn to b4 after moving the knight on a4 out of the way, but this is a lot of effort to go to just to get your queen back a couple of squares.",
        "13... h4": "The queenside attack continues.....",
        "14. h3": "I try to prevent your pawn advancing any further down the board. But this move has weakened my king safety. In fact, even a bishop sacrifice from you here (Bxh3) may not be the worst idea because it leaves my king wide open to attack.",
        "14... Rd8 15. Qf3": "Decided to bring my queen into the game",
        "15... Qh5": "I think I should have accepted to exchange of queens here. Would mean you wouldn't be able to castle.",
        "16. Rad1 Qxf3 17. gxf3": "Yeah here's the other reason why I should have done the exchange first. Now the king is mightily exposed.",
        "17... Bh6 18. Nc3": "I'm noticing the danger of the kingside now, but too little too late, that knight should never have been on a4 to start with.",
        "18... Bxh3": "Only one thing I can do here to save material",
        "19. Rfe1 Rg8+ 20. Kh2 Bg2 21. Reg1 Bf4#": "Good game. Short game, but good game!"
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-cadavre-opa?gm=39935",
    "gameName": "Challenge from cadavre-opa-",
    "players": "ortoncountry (1398) vs. cadavre-opa- (2193)",
    "opening": "Sicilian, Chekhover variation (B53)"
}