{
    "moves": {
        "1. d4": "I'm playing Thomas G, a fellow Alabama Chess Federation reserve player.  He's a catastrophically underrated player both OTB and on gameknot and the most shining example of adult ADHD I've ever seen.  ...meaning he'd destroy me every game we play here if it weren't for the fact that I'm really just one in a simul of 10 or 20 he's playing with very little time per board.  Don't let the nearly 400 point rating difference fool you, this guy is every bit my match.  Come to think of it, I think he's up on me in casual blitz games something like 2 to 1 (IHOP, Montgomery, February 2007 -- I did *not* expect to get demolished like that, Tom.)",
        "1... Nf6 2. c4": "BTW, I've played e4 almost exclusively for 27 years now.  Suddenly, I got the urge to play d4.  Also tried it OTB.  I did better than I thought.  But I'm not going to do any of the bicycle-with-training-wheels systems (colle, torre)...  I'm going for... er.  Hell I don't even know what to call this.  Sigh.",
        "2... e6 3. Nc3 Bb4": "Ah, It's a Nimzo-Indian thingy.  Ha!  I used to play this (badly) as black, so I may be able to remember how I used to get thrashed.",
        "4. Qc2": "The word Sammich comes to mind, but I really don't know the exact variation.",
        "4... d5 5. e3 O-O 6. Nf3 c5 7. a3 Bxc3+ 8. bxc3 b6": "So some long-diagonal pressure is coming.  I can't quite decide whether I have chances to blockade the d-pawn or not, if after cxd exd, but I know I can snag some space if Nx",
        "9. cxd5 Nxd5": "Ok, space it is.",
        "10. Bd3": "Develop first with tempo...",
        "10... g6 11. e4": "Then space.",
        "11... Nc7": "I should mention that this struck me as a very bad idea, and while I didn't make a specific plan to demonstrate that it was, play demonstrates that regardless of my intention.  That knight never gets another chance to do something useful in this game.",
        "12. e5": "If white were to move, Be4 Nd5 c4 and the either the knight or the rook is won, but he's not going to look at me and say 'pass', sadly.  So I'll get Bb7, threatening to double on f, and I can counterpunch...",
        "12... Bb7 13. Bh6": "...counterpunch with Bh6, which gives me a positional finesse... Re8 Bg5, something with the queen, Nh4, protecting g2.",
        "13... Re8 14. Bg5 Qc8 15. Nh4": "And visions of sacrifices are dancing before me.  Black's now unusually off-balance and surprisingly constrained. ",
        "15... Nc6": "I thought this was wonderfully annoying and very smart.  I had some thought of, after Nxg6, if declined, Ne7 or some such.  That isn't quite an option anymore.  ",
        "16. Nxg6": "I talked this over afterwards with a local soon-to-be expert and he and I felt quite sure that there was a forced mate in there.  Apparently not.  Shredder gives: If hxN, Bxg6, black declines to take back -- Qd7 and black gets to stay alive, apparently.  Black has to be extremely careful, but It's not a totally winning sac for white unless the second piece is accepted.  Ain't that a kick in the pants!",
        "16... cxd4": "I didn't get this, but he's trying to make room for his knight to snag e5 (possibly allowing for a general easing of the central constraint after I retreat my knight.  I have my eyes on the prize though, and it escapes my calculation entirely.",
        "17. Nf4 Nxe5": "And I realize that I can't have the prize just yet.  Man, I really wanted that pawn there.",
        "18. Bxh7+": "I have to press what advantage I have and strip the king of defense if I can.",
        "18... Kf8": "I thought perhaps Kg7.  I was so convinced that this was coming that I was certain, after the game, that it had.  Actually, I still can't quite process the position -- possibly because Kg7 came later.  I've been dealing with alot of perceptual ghosts in my OTB play recently...  Very frustrating.  Thankfully, this one is historical!",
        "19. cxd4": "My thinking is that I'd like to do, if Ng6, Nxg6 fx Qx -- an unanswerable position.",
        "19... Bxg2": "Which I didn't think about, but I felt it was not on point.  I decided to ignore.",
        "20. dxe5": "And I am not quite sure if I'm a genius or an idiot.  Even though he didn't play Ng6, I still can.  And I already know it cannot be answered by fx because Qxg6 and nothing in the universe can stop Bh6.  But what the hell am I going to do if Kg7?",
        "20... Bxh1 21. Ng6+ Kg7": "Jeze Louise.  (Babylon 5 fans will recognize this instantly:) Ok, so you're in a burning building on the 7th floor.  the flames are coming in from the hall and you're about to roast, so you jump out the window and try to figure out what to do next.  So, one step at a time, I have to play Bf6, tempo and permanent control of that corner of the board.",
        "22. Bf6+ Kh6": "Naturally if Kxh7 Nf8 and it's all over.  I didn't quite know yet how to proceed now that the king was taking a walk alone.  I was tempted to put this away for the night.  I know damn well there's a win in here, but it isn't a direct sequence of forcing moves.  Then I remembered that if 21... gx Qxg6, I wasn't looking at a total forcing series of moves there either and I was just fine.  So if I can find a similarly unanswerable position, -- somewhere to park the queen while waiting safely for my turn...",
        "23. Qd2+ Kxh7 24. Qg5": "Snug like a bug...  In this position, I'm thinking Q->h5->h8#, having forgotten that the knight can generate tempi too.",
        "24... Bf3": "But thankfully, my opponent encourages me to look all my pieces, so I can have what I think is a much prettier mate -- and one very thematic to play in this game.  White attacked on white squares and then switched to dominate the black, and we have a color themed mate with the added bonus of a very nice knight sac.",
        "25. Nf8+ Rxf8": "Forced.",
        "26. Qg7#": "And Tom was gracious enough to let me play this out.  It's very gracious, in my opinion, to let your opponent play out a groovy idea.  Thanks, Tom!"
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-tag1153?gm=7532",
    "gameName": "Challenge from tag1153",
    "players": "mbingham (1739) vs. tag1153 (1350)",
    "opening": "Nimzo-Indian (E34), classical, Noa variation"
}