{
    "moves": {
        "1. e4": "I like to open with 1. e4 as white.  It stakes out central space and opens a line for my light squared bishop and queen to develop.  ",
        "1... e6": "The French defense is quite unfamiliar to me even though it is one I should know.",
        "2. Nf3": "My first mistake already.  I fail to recognize what needs to be done against the French defense.  What is black up to?  What should white be doing?  White had an opportunity to build a large center (pawns on d4 and e4) and should have done so.  I am so used to other openings where 2. Nf3 is appropriate that I honestly played it without really thinking the position through.  What I should have considered is black's intention of attacking the e4 square.  Watch my lack of options in the next moves.",
        "2... d5": "This is the reason 2. Nf3 is not what I should have played.  Now I can not play 3. d4 gaining central space since it drops the e-pawn.  Defending the e-pawn with 3. d3 is very passive for white as it blocks in the light squared bishop....the logic behind 1. e4 is to open that diagonal so it is counterproductive to close it unless that is the only option.  I didn't like 3. Nc3 to defend the e-pawn because of 3...d4 can remove the defender.  As it turns out, I don't think 3. Nc3 is too bad here.  If black does push the d-pawn with 3....d4 4. Nb5 gets the attacked knight to safety (for the moment) and attacks the d4 square a 2nd time (both knights hit the square) and is only defended by the queen.  This pawn for black may prove to be overextended later in the game and the pressure on white's e4 pawn is gone.  ",
        "3. exd5": "I make a bad choice here (2 poor moves out of 3 already).  Why is it so bad?  Consider black's position after the recapture 3...exd5.  Black has central space and open lines for both of its bishops to develop to.  Before white captured on d5 with 3. exd5, black had a problem to solve....how to develop the light squared bishop?  White just fixed that problem for black with 3. exd5.",
        "3... exd5": "Black has already at least equalized.  ",
        "4. d4": "During the game I didn't realize how badly I played on moves 2 and 3.  It's only now looking back that I see it.  Good lesson for me.  Remember, white should strive to build a large center and do everything possible to maintain it in the opening if black allows.",
        "4... Bd6": "Black fights for the e5 square and develops a piece (all thoughts on the center and development in the opening).  ",
        "5. Bd3": "White does the same.  Develop and fight for the e4 square.",
        "5... Nf6": "Black develops, supports the d5 point, controls the e4 square a 2nd time, and makes room to castle short.",
        "6. O-O O-O": "Kings to safety and rooks closer to the center for both sides.  In perfectly symmetric positions such as these, it is white that gets to strike first due to the privilege of the first move.  ",
        "7. c4": "I decided to push the c-pawn out two squares before developing my queenside pieces.  If I play 7. Nc3 my c-pawn is immobilized and my opponent can pin my f3 knight with 7. Bg4.  I feel like 7. c4 gives me flexibility in development.",
        "7... dxc4 8. Bxc4": "This keeps material even and pins the f7 pawn.  My d-pawn is isolated (no friendly pawns on adjacent files) and on a half open file of my opponent.  I will need to generate activity and avoid minor piece exchanges (this is what the owner of an isolated pawn should be thinking) or move 7. c4 will prove to be incorrect.  ",
        "8... Nc6": "Develops and hits the central dark squares e5 and d4.  ",
        "9. Nc3": "I considered 9. Bg5 pinning the f6 knight but did not want minor piece exchanges with an isolated pawn.  9....h6 puts the question to my bishop which I do not wish to part with so 9. Bg5 does not seem best here.  9.  Nbd2 immobilizes my dark squared bishop so Nc3 seems like the way to go.  Develop a minor piece and fight for the central light squares d5 and e4.",
        "9... Re8": "This proves to be too tempting for me during the game.  I had a battle going on in my brain after my opponent made this move.  My grounded fundamental chess mind said \"finish development before going on any adventures\" my fighting spirit said \"the f7 square is exposed\".  Chess author Jeremy Silman calls it the mindless king hunter....that is what I became at this moment in the game.  ",
        "10. Ng5": "During the game, I loved this move.  I felt my opponent would respond with 10...Be6 and I could exchange knight for bishop with 11. Nxe6...of course that gives black an isolated e-pawn because 11...fxe6 is the only possible recapture (11....Rxe6 12. d5! forks knight and rook).  ",
        "10... Re7": "I did not see this coming but I still thought I was in great shape.  During the game my sense of danger about Bh2+ was constantly in the back of my mind.  The black queen has an x-ray attack along the d-file....that is something I missed all the time when I was working my way up through the rating levels (especially with rooks).  An x-ray attack (my understanding of it anyway) is when a linear piece's influence is being blocked by another piece (the linear piece sees right through the blocking piece, hence x-ray).....once that blocking piece moves, the linear piece's attack reigns down on the opponent position.  This is especially dangerous when the blocking piece can deliver check on that move.  ",
        "11. Re1": "I thought 10....Re7 was a mistake due to 11. Re1.  Black was still going to have to interpose the bishop to block my attack on the f7 square (so I thought).",
        "11... Bg4": "I missed this move!!!  Why I missed it I have no idea.  Maybe because I thought f3 would block the light squared bishop (and attack it at the same time forcing it to move).  What I failed to consider was once it steps back to Bh5 it now protects the f7 square!!!",
        "12. f3 Bh5": "Ugh.  My foolishly optimistic attack on black's f7 square is stopped.  That would be fine if my pieces were well placed.  Here comes the advice I have read at least twenty times in various chess improvement books (but fail to listen to way too often).  \"No cheap tricks!!!.  Assume your opponent will find the best move to defend the position.  Only choose plans that improve your position, not ones that rely on your opponent to make a mistake.\"  So, are my pieces well placed at this point?  NO!!! My king is unsafe (the f2 pawn no longer blocks the g2-a7 diagonal and does not defend the g3 or e3 squares anymore), my bishop on c4 is hanging (undefended), my knight on g5 is into enemy territory and only one decent escape square (2 if you count the h3 square but that is a terrible location for a knight to go to), my d-pawn is hanging (it is technically undefended at the moment since my queen is tied to the defense of my e1 rook) and my dark squared bishop is undeveloped.  That is a lot of problems to solve so this was a terrible opening for white and amazing for black.  During the game I knew my position was quite bad because I was able to identify all of those problems.  My next move attempts to solve two of the problems but fails terribly.",
        "13. Be3": "I thought developing the bishop was the way to go here.  It defended the d4 pawn, developed the bishop, and allowed my queen to move since the other rook could now defend the e1 rook.  I felt good about it.  ",
        "13... Rxe3": "My heart sank when I saw this move.  What a beautiful tactic (decoy) my opponent came up with.  I never considered this in my analysis.  Another important piece of chess advice to learn here.  Before considering possible moves (candidate moves) calculate ALL possible checks and captures the opponent can make.  Even if the check or capture looks ridiculous, calculate the lines anyway. It is possible that a tactic called a decoy is being used......decoy is dragging a piece to a square that will result in mate or bigger losses than were sacrificed.  ",
        "14. Rxe3": "Do you see it now?  Black sacrificed the exchange (rook with a trading value of 5 pawns for a bishop trading value of 3 pawns) to decoy my rook onto a square that will lead to worse losses for me 14....Bf4 attacks both the rook and the knight.  That would be fine if the rook could safely move to a square that defends the hanging knight but the e5 square belongs to black. Obviously the knight can not move anywhere that will defend the rook.  There is one option that might look promising at first....15. Nxf7 would at least take a pawn down with the knight since the knight attacks the queen from there however remember another major problem of my position from earlier.  My king is unsafe!!!  Black can respond to 15. Nxf7 with 15...Bxe3!! ignoring the attack on the queen since white is forced to move the king out of check.    ",
        "14... Bf4": "I deserved this for violating important opening chess principles and underestimating the defensive resourcefulness of my opponent.  ",
        "15. Re1 Bxg5": "This does not appear quite as bad as it really is to some players so let me explain a little.  White is down a pawn if you count the trading value of pieces so that seems troublesome but not completely lost as I think this position really is.  The true trading value of knights and bishops is really closer to 3.25 rather than 3 but players don't learn this until a little further into their chess development.  The bishop pair (one player has both bishops and the other does not) makes the combined trading value of the bishops closer to 7 (3.5 each).  Therefore, the reality of this position is worse than down 1 pawn.....it is much closer to down 2 pawns maybe even more due to other factors.  My king is forever less safe than black's, my isolated d-pawn will eventually fall since black has more pieces that can attack it than I have to defend it, and black has no central pawns to limit the mobility of his bishops.  My position is full of dark squared holes which black's knights will eventually exploit. ",
        "16. d5": "Now I am in desperation mode so I try to rid myself of one weakness.",
        "16... Ne7 17. Qe2": "My plan here was to actually improve my pieces for once while using real threats to do so.  That is how one should play chess.  17. Qe2 attacks the e7 knight for a 2nd time.  Black hangs the knight if 17....Nexd5.  Why?  Because of black's weak back rank.  Let's look at the line.  17....Nexd5 18. Nxd5 Nxd5 19. Bxd5....it looks like black will be up a pawn but wait....if 19....Qxd5 20. Qe8+ Rxe8 21. Rxe8#.  The result is the same if 17....Nfxe5.  Black has a couple of reasonable defenses left...Ne8, Nd7, Nc8, or Kf8.  What is wrong with 17...Nf5?  The pawn fork 18. g4.  My guess is 17....Nc8 even though it looks scary for a second.  Back rank mate is covered by the f6 knight though and black's next play is Nd6 blockading the d-pawn and covering the e8 square a 2nd time.  Black will easily reorganize and white's temporary initiative will be easily solved.  I could have played on for a while hoping for a blunder from my opponent but I prefer getting to sharing and hopefully helping the team.    "
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-jeich-http-gameknot-com?gm=54784",
    "gameName": "Challenge from jeich, http://gameknot.com/",
    "players": "jeich (1780) vs. pcm1858 (1882)",
    "opening": "French (C00), Wing gambit"
}