{
    "moves": {
        "1. e4": "Esta fue mi Primera victoria como jugador en Gameknot, aunque llena de errores, es algo significativa para mi. Veamos...\nTodo empezo muy bien, salida del peon del rey.",
        "1... e5 2. Bc4": "a la amenaza del peon de f7 conteste atacando el peon de e4",
        "2... Nf6": "aqui ataco su peon de centro",
        "3. d3 h6": "una jugada criticable pero solo defendia la posicion de mi caballo",
        "4. h3 Nc6": "evito el avance del peon a d4",
        "5. c3": "interesante jugada! procura el avance del peon a d4 y ademas activa su dama en el otro flanco",
        "5... Bc5": "controlo la diagonal para atacar el peon de f2 y asi evito el avance a d4",
        "6. Be3": "un ataque significativo!!! ataca el arfil negro y proteje el peon debil de f2",
        "6... a6": "Esta es la peor jugada que se pudo ocurrir¿¿ aqui se entrega limpio el arfil negro.",
        "7. d4": "Pero despues de esa mala jugada siguio otra peor¿¿ viene el intercambio!! que sin importar el resultado salen ganando las negras fruto que pudieron haber tenido 3ptos menos",
        "7... exd4 8. cxd4 Bb4+": "jaque importante asi se salva el arfil",
        "9. Nc3 Bxc3+": "jugada que debilita totalmente el flanco de la dama blanca",
        "10. bxc3": "aqui las blancas obstentan mejor posicion y calidad si termina aqui las negras pierden, veamos como sigue:",
        "10... d5 11. exd5 Nxd5 12. Bxd5 Qxd5": "las blancas entraron en un intercambio desfavorable porque activo la dama negra y su arfil. aqui la calidad y la posicion variaron en solo dos jugadas.",
        "13. f3": "muy bien!! proteje g2 y la torre ademas de menos movimiento para la dama.",
        "13... O-O": "enroque discutible: ademas de proteger el rey busca clavar el arfil de e3",
        "14. Ne2": "sale el caballo un poco tarde¿ veamos:",
        "14... Bf5": "controlar diagonales es el fin de los arfiles acercandose el final",
        "15. Nf4": "Mala jugada¿¿ se debio enroscar con ese ataque facil de evadir por la dama que ahora busca evitar el enrosque.",
        "15... Qc4": "asi se controlan las posiciones.",
        "16. Bd2": "el arfil proteje el peon debil de c3 pero por ahora esta fuera de combate",
        "16... Rae8+": "la jugada Tae1 puede ser criticable, pudo ser Tfe1",
        "17. Kf2": "las negras logran su cometido evitar el enrosque. Asi casi nos acercamos al final.",
        "17... g5": "mala jugada¿¿ se debio evitar el movimiento del caballo a h5",
        "18. Nh5": "Peligro en la cueva negra, las blancas tratan de recuperar terreno perdido, aunque un caballo solo no puede",
        "18... Re6": "movimiento para evitar el jaque y tambien e total control de la columna e",
        "19. Re1": "Jugada de doble filo!¿ las blancas desesperadas por el control de la columna e proponen el intercambio. las negras ven la perdida de su posicion favorable y deciden no entrar al derramamiento de sangre; por lo que idealizan una jugada estrategica la cual llevan a cabo: evitar el jaque con el caballo de h5. veamos",
        "19... Kh7 20. Rxe6": "las blancas entraron en un camino dificil... sin posicion favorable y calidad dividida no se entra en ese tipo de contienda.¿¿",
        "20... Bxe6 21. Nf6+": "mala jugada¿¿¿ jaque con nada de efecto y a la vez activa al rey en el umbral de final de juego",
        "21... Kg6": "aqui solo le queda a las blancas mantener vivo el caballo, no deben entregarlo, asi le cueste tiempo",
        "22. Ne4 f5": "las negras ven su debilidad y van tras él.",
        "23. Nc5 Nxd4": "ahora si!! las negras proponen un cambio de caballos, solo con el fin de despejar su dama y poder llegar al rey enemigo por lo que el peon d4 estorbaba y de paso se elimina el caballo blanco errante. veamos",
        "24. cxd4 Qxd4+": "todo sigue segun lo planeado...",
        "25. Kg3 Qxc5": "se produjo el intercambio... todo despejado para las negras que ahora ganan dos peones.",
        "26. Rc1": "desesperacion.¿¿ se debio activar la dama blanca",
        "26... Qe5+ 27. Kf2 g4": "con este movimiento entramos a una final de damas.",
        "28. f4": "ultimos indicios de ataques blancos...",
        "28... Qe4": "la dama negra no deja su control de la columna e",
        "29. h4": "movimientos equivocados¿¿ solo los peones protejen al rey blanco",
        "29... Rd8": "control en la columna d, las negras deben evitar algun tipo de intercambio, solo los favorables.",
        "30. h5+": "jugada sin sentido¿¿",
        "30... Kxh5 31. Qh1+": "continuan¿¿",
        "31... Kg6 32. Qh4": "jugada pesima¿¿ pero la ultima... mate en dos!!",
        "32... Rxd2+ 33. Kg3 Qxg2#": "un mate ordinario para tan buen medio juego."
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-sweetpealola1?gm=34094",
    "gameName": "Challenge from sweetpealola1",
    "players": "sweetpealola1 (1245) vs. jbobadilla (1029)",
    "opening": "Bishop's opening (C24), Berlin defence"
}