{
    "moves": {
        "1. e4": "theinnergame was nice enough to take me under his wing for a game and point out a few of my flaws.  Please feel free to comment on any of the moves and let me (or theinnergame) know where we may have gone wrong.",
        "1... d5 2. exd5 Qxd5 3. Nc3": "3. Nc3 develops the Knight, helps to control the center and gains tempo by attacking the Black queen.",
        "3... Qd6 4. d4": "4. d4. Gaining space/control in the center and clearing a path for my dark squared bishop. Other reasonable options would be 4. Nf3 (developing and controlling the center, 1 move closer to kingside castle) and 4. Bc4 (for the same reasons as Nf3)",
        "4... Nf6": "(theinnergame) Stopping Ne4 and attempting to block qh5 if Bc4 is played also clearing back rank to castle",
        "5. Nf3": "5. Nf3, controlling the e5 square.",
        "5... a6 6. Be2 b5 7. Be3": "6...b5  prevents me from gaining any real attack on f7 but I had no plans to do so anyway. Black is now able to fianchetto the light squared bishop, placing it on an EXCELLENT diagonal directed at my kingside. I rather like Black's position with the exception of Black not having any central space. I'm second guessing my plan to castle kingside due to the bishop coming to b7 and Black's knight and queen both being able to reach that area very quickly. 7. Be3 strengthens my center and gets me closer to the option of castling queenside.\n\n\n(theinnergame) b5 is not just preventing an attack on f7;it's a ready made attack if you castle queenside.",
        "7... Bb7 8. O-O": "The king gets out of the center of the board and now White's rook can enter the open e-file.  ",
        "8... e6 9. Ne5": "When looking at this position the one thing I keep saying to myself is that I want to get rid of Black's light squared bishop. It seems to be Black's best minor piece and is FAR superior to my light squared bishop. Putting my light squared bishop on f3 would solve the problem, Black's bishop won't be able to move away due to being pinned to the a8 rook. To make that happen I need to move my f3 Knight to a different square. e5 looks good to me, it is central and I can't see any tactics for Black that would exploit the knight on this square.",
        "9... Nbd7 10. Bf3 c6 11. Bf4": "Now that Black's light squared bishop is safe (yet inactive) white must worry about the knight on e5. Attacked twice but only defended once. I can either defend it again, move it to safety or exchange it for a Black piece. Bf4 defends the knight a second time and gives the potential for a discovered attack against the Black queen but the bishop will be undefended. I don't see any good squares to move the knight to safety. I don't want to exchange my knight for Black's d7 knight because my knight is on a better square and trading pieces will help to relieve the cramp on Black's position. Bf4 seems like my best bet.",
        "11... Nxe5": "(theinnergame) although your knight gained a tempo on c3 attacking my queen in the opening it now seems awkward to me.",
        "12. dxe5": "The question is should White take back with the pawn or the bishop?  12. dxe5  ...Qxd1  13.  Raxd1 and the black knight on f6 must find a new (less active?) home.   If 12. Bxe5  then the Black queen finds a new home.  b4?  d7?  d8?  e7 defending the knight?  I prefer taking with the pawn.",
        "12... Qxd1 13. Raxd1 Nd5 14. Nxd5 cxd5 15. Be3 Rc8 16. Rd2 Bc5 17. Re1 O-O 18. a3 Bxe3 19. Rxe3 Rc7 20. b4": "20. b4, stopping Black's queenside pawns.  Black is going to double his rooks on the c-file but While will have adequate time to move the white rooks onto the c-file and bring the king into the game.",
        "20... Rfc8 21. Bd1": "21. Bd1 relieves my d2 rook of guard duty and allows him to find employment on the 3rd rank. The downside is now my bishop is completely passive.",
        "21... Rc7c4": "(theinnergame) Increasing the scope of my rook because I'm looking at the h7- b1 diagonal for my bishop.d4 may be a possibility or rook e4 allowing the bishop to come to d5.I'm on the attack so I want to sustain tension and try to leave you cramped ,in order to bring my king into play.",
        "22. Kf1 d4 23. Red3 Kf8 24. Rd3xd4": "I think I see a chance to go up a pawn.  24. Rxd4.  Black will most likely avoid trading rooks as that will only make my pawn advantage even more valuable.  I'm looking but I don't see any tactics that hurt White after 24. Rxd4",
        "24... Rxd4 25. Rxd4 Bd5 26. g4 Rc3 27. Ke1 Rxa3 28. Rd3 Rxd3 29. cxd3 Ke8 30. Kd2 Kd7 31. Kc3 Kc6 32. h4 Kb6 33. f4 a5": "(theinnergame) you played g4 early on which I thought was a mistake.All I had to do was play g5 and it would have stopped three pawns!",
        "34. bxa5+ Kxa5 35. Kb2 Kb4 36. f5 Kc5 37. Bb3 Bxb3 38. Kxb3 Kd5 39. f6 g6 40. Kb4 Kxe5": "(theinnergame) I think taking with the a rook on move 13 was the mistake that has cost the game.This left the queenside pawns to fend for themselves.\n\n\nI'm amazed that he can trace my poor situation here all the way back to my 13th move.  ",
        "41. Kxb5": "I'm not even sure if I have drawing chances right now. I can't analyze that far ahead so I'll play on the best I can...",
        "41... Kxf6 42. Kc5 Ke5 43. g5 f5 44. gxf6 e.p. Kxf6 45. Kd4 Kf5 46. Ke3 Kg4": ""
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-theinnergame?gm=12796",
    "gameName": "Challenge from theinnergame",
    "players": "mjeffries (1401) vs. theinnergame (1694)",
    "opening": "Scandinavian (B01), Pytel-Wade variation"
}