{
    "moves": {
        "1. e4": "The was one of a set of 6 games I played simultaneously with gm4u on Gameknot. He is someone I have played in over-the-board games. We had a couple of friendly games at a local pub. We won the first one, and I managed to draw the second, and I got the impression he was slightly better than me.",
        "1... c5": "So I reply with my usual, the Sicilian Defence.",
        "2. c4": "This is unusual, but not unheard of.",
        "2... Nc6": "White has been left with a \"hole\" on d4, which cannot be protected by pawns. This move makes d2-d4 by white less likely.",
        "3. Nc3": "He develops his knight.",
        "3... g6": "I am planning Bf8-g7, to further discourage d2-d4",
        "4. g3": "He decides to develop his bishop in the same way.",
        "4... Bg7": "So I complete the maneuver started.",
        "5. Bg2": "And so does he.",
        "5... d6": "Once again I pick from the opening database the most popular move for black.",
        "6. h3": "He prevents my bishop from coming out to g4. This is quite a common move in the Closed Sicilian.",
        "6... e6": "On the Gameknot world opening database that I was using, Nf6 is more usual. However there were some white wins against it, while there were none against e6. I also wanted to prevent him from playing d2-d4. I also already had thoughts of playing d6-d5 myself.",
        "7. Nge2": "He develops his knight as to not block the diagonal for his bishop on g2.",
        "7... Nge7": "And I do a similar move with my knight.",
        "8. d3": "He continues to develop.",
        "8... O-O": "I castle.",
        "9. O-O": "So does he.",
        "9... Rb8": "I am still following the Gameknot World Opening database. Rb8 is the most popular more, and also doesn't score any loses.",
        "10. Rb1": "He copies me.",
        "10... a6": "I continue to follow the database. There are 3 games on it with this position, all black wins, although I find it hard to believe that there is anything intrinsically better with the black position. ",
        "11. a4": "On the database, we are down to one game now, Maksimov, Igor (2139) vs. Yudin, Ivan (2080).",
        "11... Nd4": "As played in that game. ",
        "12. Nxd4": "Ditto.",
        "12... cxd4": "Ditto.",
        "13. Ne2": "Ditto (although I don't think my opponent knew it!)",
        "13... d5": "Ditto. PMCA - Post-match computer analysis (http://gameknot.com/analyze-board.pl?bd=21713007&fb=1&rnd=0.18365272297523916) gives this as a mistake and suggests b5 14. cxb5 axb5 15. Ra1 bxa4 16. Qxa4 Rb6 17. Bg5 h6 18. Bd2 Rxb2 19. Ba5 Qe8 20. Nxd4 Bd7 21. Qc4  as best for both sides.",
        "14. cxd5": "And this is the parting of the ways. In the aforementioned game, white took with the e pawn. ",
        "14... exd5": "So I take back.",
        "15. Bf4": "He hits the rook, as in Maksimov, Igor (2139) vs. Yudin, Ivan (2080).",
        "15... Ra8": "Virtually forced.",
        "16. Qb3": "So I am thinking for myself now. This aggressive queen move looks good, but the queen may be vulnerable to attacks from my pieces.",
        "16... dxe4": "So I undouble my pawns.",
        "17. dxe4": "I thought maybe he may take back with the bishop, increasing pressure on b7.",
        "17... Nc6": "So I improve the position of my knight. I was thinking that maybe Nc6-a5 may be playable at some stage. ",
        "18. Rfd1": "So more pressure on my passed d pawn.",
        "18... g5": "I hit his bishop.",
        "19. Bc1": "He goes all the way back, although PMCA gives  19. Be3 Re8 20. Rbc1 Be6 21. Qxb7 Na5 22. Qb4 Rb8 23. Qa3 Bf8 24. Rxd4 Bxa3 25. Rxd8 Rexd8 26. bxa3 as better.",
        "19... Be6": "So I hit his queen. It is surely too risky for the white queen to take the b pawn?",
        "20. Qxb7": "But he takes!",
        "20... d3": "With threats of 21....d3xe2, 22. Rxd8 e2-e3=queen check, winning for black.",
        "21. Nc3": "So he moves his knight. ",
        "21... Bxc3": "This is a mistake. I only looked at 22. bxc3 R-b8 winning the exchange (and the game) for black. PMCA says Na5 22. Qb4 Bb3 23. Rxd3 Qxd3 24. Qxa5 Bxc3 25. bxc3 Qxb1 26. Qxg5+ Kh8 27. Qf6+ Kg8 28. Qg5+ is better. ",
        "22. Qxc6": "But he takes this instead!",
        "22... Bb3": "Luckily I have this.",
        "23. Qxc3": "Moving his rook to f1 loses to d3-d2, so he takes here.",
        "23... Bxd1": "I take his rook.",
        "24. Bxg5": "He takes my pawn.",
        "24... Qxg5": "I take his bishop.",
        "25. Rxd1": "He takes my bishop. We have managed to reach roughly level material, with him having two pawns for the exchange.",
        "25... Rfd8": "So I protect my pawn.",
        "26. Rxd3": "He takes.",
        "26... Rxd3": "I take",
        "27. Qxd3": "He takes back.",
        "27... Qc1+": "I throw in the check. ",
        "28. Bf1": "Bishop back - I rather expected a king move.",
        "28... Qxb2": "I take the pawn.",
        "29. Qd5": "He hits my rook.",
        "29... Rb8": "So I move it.",
        "30. Bc4": "He gangs up on my f pawn.",
        "30... Qf6": "So my queen comes back.",
        "31. e5": "He hits my queen.",
        "31... Qg6": "I have to watch the f pawn of course.",
        "32. Kg2": "He puts his king to a safer square.",
        "32... Kg7": "I thought I was doing the same, but....",
        "33. e6": "He now comes up with this.",
        "33... fxe6": "I take innocently.",
        "34. Qe5+": "and he plays this fork.",
        "34... Kh6": "King moves.",
        "35. Qxb8": "The rook goes.",
        "35... Qe4+": "But his bishop is a gonna too. We are going into a queen and pawn  endgame where he is a pawn up. Interestingly, after 29.....Bxc3? PMCA doesn't suggest any improvements for either side, from move 29 to the end of the game. So although I didn't see some of the tactics, maybe there wasn't anything better for me...",
        "36. Kh2": "So his king moves.",
        "36... Qxc4": "His bishop goes.",
        "37. Qb2": "With a clever sacrifice. If 37....Qxa4?? 38. Qf6+ Kh5 39. g4 wins for white. But I didn't fall for that....",
        "37... Kg6": "So I centralise my king. There are not any major worries now. I just have to be careful, not to allow a queen exchange, nor to lose any pawns.",
        "38. a5": "He now moves the a pawn to a safer square.",
        "38... h5": "I want to exchange pawns if I can. I played this, with a view of perhaps playing h5-h4 or exchanging if he plays g3-g4 at some stage.",
        "39. Qb6": "He keeps the pressure on my pawns.",
        "39... Kf5": "I move my king up",
        "40. Qb7": "I am not sure why he played that",
        "40... Qe2": "My queen takes up an ideal square, protecting all three pawns and threatening Qxf2 with check.",
        "41. Kg1": "So he protects the pawn.",
        "41... Ke5": "I move my king over.",
        "42. Qc7+": "He throws in a check.",
        "42... Kd5": "King moves again.",
        "43. Qd8+": "Another check.",
        "43... Ke4": "Another king move.",
        "44. Qb6": "Hitting the pawns again.",
        "44... Ke5": "King protects.",
        "45. f4+": "Pawn check now.",
        "45... Kf6": "King moves.",
        "46. Qd8+": "Queen check.",
        "46... Kf7": "King moves again. Draw agreed. Many thanks for reading this. Please rate this annotation on the star system, and leave a comment or two. Until next time dear reader!"
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-charleshiggie?gm=55797",
    "gameName": "Challenge from charleshiggie",
    "players": "gm4u (1748) vs. charleshiggie (2034)",
    "opening": "Sicilian (B20), Gloria variation"
}