{
    "moves": {
        "1. e4": "This game is an example of how vulnerable can black's king be in case of queen-side castling in Caro-Kann defence. Hope you like it :)",
        "1... c6": "First few book moves will be left without any comments.",
        "2. d4 d5 3. Nc3 dxe4 4. Nxe4 Bf5 5. Ng3 Bg6 6. Nf3 Nd7 7. c4 e6 8. a3": "8. a3  prevents 8. ... Bb4   and prepares b4.",
        "8... Qc7": "Typical move for black. Prepares queen-side castle.",
        "9. Be2": "Same for white, preparing for king-side castling.",
        "9... Ngf6 10. O-O O-O-O 11. b4": "11. b4  starts the attack on black's position.",
        "11... c5": "11. ... c5  with intention of bxc5 or dxc5 followed by 12. ... Nxc5  threatening white's queen.",
        "12. Qb3": "Bait not taken. Black's troubles start from now on. After 12. ... cxb4 13. axb4  the 'a' line is open for white.",
        "12... cxd4": "Black plays cxd4 instead.",
        "13. Nxd4": "The knight threatens 14. Nb5. Black should play 14 ... a6.",
        "13... Bd6": "13. ... Bd6? is a big mistake. Black's queen will be forced to move to the '8' line to protect the a7 pawn.",
        "14. Nb5": "White knight attacks.",
        "14... Qb8": "Black's queen in retreat.",
        "15. Be3": "15. Be3  increases pressure on a7 pawn and frees the '1' line for white's rooks.",
        "15... Nb6": "15. ... Nb6? is another mistake. This leads to an interesting pin.",
        "16. c5": "It looks like black can get out of the pin without any loss of material. However, position count's in chess too!",
        "16... Bxg3": "Obvious move, hoping for white killing the bishop and black playing 17. ... Nd5 with good chances.",
        "17. cxb6": "17. cxb6!  White gives away the h2 pawn, but gains superb chances in a direct king attack since the 'c' and 'd' lines are now open.",
        "17... Bxh2+ 18. Kh1 a6": "Black is in all kinds of trouble and decides to get rid of the knight.",
        "19. Qc4+": "This starts the attack.",
        "19... Kd7": "Black's king on the run.",
        "20. Rfd1+": "The rooks come into play.",
        "20... Ke7": "Still running.",
        "21. Bc5+": "Black cannot play 21. ... Bd6 because of 22. Rxd6 Rxd6 23. Bxd6  pinning the queen.",
        "21... Ke8": "Last spot for the king.",
        "22. Rxd8+": "White can now take the rook since the second black's rook is blocked in the corner.",
        "22... Qxd8 23. Rd1": "Pushes the second rook into play.",
        "23... Nd5": "Blocks the path.",
        "24. Kxh2": "Takes the unguarded bishop.",
        "24... axb5": "Regains material.",
        "25. Qxb5+": "Now we're even in material, but what about position?",
        "25... Qd7": "The only move.",
        "26. Qa5": "Prepares 26. Bb5.",
        "26... Qc8": "The only move.",
        "27. Bb5+": "The attack is in it's final stages.",
        "27... Kd8": "Again, the only move.",
        "28. Rc1": "This threatens 29. Be7   with queentake.",
        "28... Qb8+": "Which move is it? Yes, the only one ;)",
        "29. Kh1": "White's king in check.",
        "29... h5": "Black has few options left. This move cannot bring anything into the game.",
        "30. Qa7": "30. Qa7! Black has to exchenge the queens, leaving a pawn close to promotion.",
        "30... Qxa7": "Exchanging.",
        "31. bxa7": "The a7 pawn looks strong, but can black's rook come into play to stop it?",
        "31... Kc7": "Black thinks he's regained control. White cannot promote the pawn. Double check with the bishop doesn't improve anything for white. Material is even. Has white spoiled the game by making to many exchanges???",
        "32. Bf8+": "32. Bf8 !! Game over! The promotion is now a fact and after 32. ... Kb6 33. a8Q  the mate on a5 is unstoppable."
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-rjastrz?gm=6610",
    "gameName": "Challenge from rjastrz",
    "players": "rjastrz (1698) vs. plo1 (1691)",
    "opening": "Caro-Kann (B18), classical, Flohr variation"
}