{
    "moves": {
        "1. e4": "Filipiniana challenged me to a second game where Filipiniana is white this time.  I accept and she makes the most popular opening move on Gameknot.com - King's pawn opening. // Filipiniana hinamon ako sa isang pangalawang laro kung saan Filipiniana ay puti oras na ito. Tinatanggap ko siya at gumagawa ng mga pinaka-popular na ilipat ang pagbubukas sa Gameknot.com - nakasangla pagbubukas ng Hari.",
        "1... d5": "Scandinavian defense is the response. // Scandinavian pagtatanggol ay ang tugon.",
        "2. Nc3 d4 3. Nd5 e6 4. Nf4": "This is where filipiniana started losing the tempo. // Ito ay kung saan filipiniana nagsimula mawala ang tempo.",
        "4... e5 5. Nd5 f5 6. Bb5+": "Filipiniana places me into check w/ seemingly no regard for consequences. // Filipiniana naglalagay sa akin sa check w / tila walang pagsasaalang-alang para sa mga kahihinatnan.",
        "6... c6 7. Bc4 cxd5 8. Bb5+": "Check #2 // Suriin ang # 2",
        "8... Nc6 9. exd5 Qxd5 10. Bf1": "Tempo is working for me big time as I cover a lot of territory! // Tempo ay gumagana para sa akin malaki oras bilang ko masakop ng maraming teritoryo!",
        "10... Nb4 11. Qh5+": "Check #3 by Filipiniana.  Here I must quote IM Jeremy Silman in \"The Complete Book of Chess Strategy.\"  On page 5 he writes, \"A typical beginner's mistake centers around the Queen: In general, don't move her too early!  Because of the Queen's enormous value, she is vulnerable to tempo-gaining attacks by lesser enemy units.\" // Suriin ang # 3 sa pamamagitan ng Filipiniana. Narito dapat kong sipiin IM Jeremy Silman sa \"Ang Kumpletuhin Book ng Chess Strategy.\" Sa pahina 5 nagsusulat siya, \"centers pagkakamali Ang isang tipikal na nagsisimula sa paligid ng Queen:! Sa pangkalahatan, huwag ilipat ang kanyang mga masyadong maagang Dahil sa napakalaking halaga ng Reyna, siya ay mahina sa tempo-nakakakuha ng pag-atake sa pamamagitan ng mas mababang mga yunit ng kaaway.\"",
        "11... Kd8": "Looking to take rook, I did not want to move to g6 and make Filipiniana's Queen retreat and threaten my Knight's pending attack. // Naghahanap gumawa ng titimbog, hindi ko nais upang lumipat sa g6 at gumawa ng Queen retreat Filipiniana at takutin nakabinbing pag-atake ang aking Knight ni.",
        "12. d3 Nxc2+": "How I enjoy the Knight's ability to take valuable pieces! // Paano ang mga bisita ko ang kakayahan Knight upang tumagal mahalagang piraso!",
        "13. Kd2 Nxa1 14. b3 Qa5+ 15. Kd1 Qxa2 16. Qg5+": "Filipiniana's 4th time to check me. // Ika-4 na oras Filipiniana upang suriin sa akin.",
        "16... Ne7 17. Qd2 Qxb3+ 18. Ke1 Nc2+ 19. Ke2 Be6 20. Qa5+": "Check #5 // Suriin ang # 5",
        "20... b6 21. Qxe5 Nb4 22. Qxd4+": "Check # 6 // Suriin ang # 6",
        "22... Ned5 23. Bg5+": "Check # 7.  Filipiniana seems to want to check at all costs! // Suriin ang # 7. Filipiniana mukhang gusto mong tingnan sa lahat ng mga gastos!",
        "23... Be7 24. Bd2 Bc5 25. Qe5 Re8 26. Bg5+": "Check # 8 // Suriin # 8",
        "26... Nf6 27. Bxf6+": "Check #9 and I don't understand this sacrifice. // Suriin ang # 9 at hindi ko maintindihan ang sakripisyo.",
        "27... gxf6 28. Qxf6+": "Check #10 // Lagyan ng tsek # 10",
        "28... Kc8": "I didn't want Filipiniana to check me on the next move. // Hindi ko gusto Filipiniana upang suriin sa akin sa susunod na paglipat.",
        "29. Qh6 Bd5+": "One of my favorite moves in the game! // Isa sa aking mga paboritong gumagalaw sa laro!",
        "30. Kd2 Qc2#": "Okay, I guess this would be my favorite since it sealed the deal!  Thank you Filipiniana for playing.  If you can understand English check out my greatest passion (way above chess) in a video I made: http://youtu.be/VveJszRovmA  // Okay, hulaan ko ito ay magiging aking mga paboritong dahil ito ay selyadong ang deal! Salamat sa iyo para sa Filipiniana paglalaro. Kung maaari mong maunawaan Ingles tingnan ang aking pinakamalaking simbuyo ng damdamin (paraan sa itaas chess) sa isang video na aking ginawa: http://youtu.be/VveJszRovmA"
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-filipiniana?gm=51174",
    "gameName": "Challenge from filipiniana",
    "players": "filipiniana (877) vs. tulsatallguy (1200)",
    "opening": "Scandinavian (centre counter) defence (B01)"
}