{
    "moves": {
        "1. Nf3": "Essa é minha partida preferida!\nEstou jogando de pretas, por isso, se no seu computador o tabuleiro estiver com as peças brancas na parte de baixo, sugiro que inverta o tabuleiro, para visualizar melhor (sob o ponto de vista das pretas).",
        "1... d5 2. d4 Nf6 3. h3": "h3: Um lance passivo demais das brancas. Nessa hora, já comecei a pensar: vou tomar a iniciativa...",
        "3... e6": "e6: o objetivo é jogar, em seguida, c5, pra trocar meu peão de ala por um peão de centro das brancas (faço isso sempre que posso, pois dominar o centro do tabuleiro com peões é essencial)",
        "4. Bf4 c5 5. e3": "e3: tudo bem que esse lance abre caminho para o bispo branco de f1, mas acaba satisfazendo a vontade das pretas (isso é, trocar um peão de ala - no caso, c5 - por um peão central das brancas - no caso, e3)",
        "5... Nc6": "Aqui, eu deveria ter primeiro trocado o peão (cxd4), antes de liberar meu cavalo, pois agora as brancas podem jogar, por exemplo, c3, defendendo o peão de d4 com mais um peão, o que estragaria o plano das pretas de trocar um peão de flanco por um branco de centro...",
        "6. Bb5": "...mas, em vez de c3, as brancas preferiram esse lance bobo (Bb5).\nEsse lance (Bb5) é uma perda de tempo, porque obrigará as brancas a fazer jogadas defensivas, movendo a mesma peça mais de uma vez, enquanto as pretas partirão para o ataque, desenvolvendo suas peças.",
        "6... Qa5+": "Taí porque o lance anterior das brancas foi \"bobo\": A rainha preta dá cheque ao rei e, ao mesmo tempo, ataca o bispo em b5.",
        "7. Nc3": "Esse é o único lance das brancas que, ao mesmo tempo, defende o rei e o bispo de b5.",
        "7... Ne4": "A ideia, obviamente, é atacar o defensor do bispo, no caso, o cavalo em c3. As brancas não podem mover o cavalo (porque não podem expor o Rei ao cheque da Rainha).\nE não adiantaria, por exemplo, jogar Qd3 pra defender o cavalo, porque senão as pretas jogariam c4, atacando a dama branca. Por isso, as brancas não tiveram opção, a não ser trocar o bispo ameaçado pelo cavalo em c6, como farão a seguir...",
        "8. Bxc6+ bxc6 9. Qd3": "Péssimo lance das brancas. Elas estavam tentando evitar a troca de cavalos e a perda do peão b2, que seria tomado pela rainha preta após 9 ... Nxc3 - 10 bxc3 Qxc3.\nMelhor para as brancas teria sido rocar e \"aceitar\" a perda do peão, um prejuízo que sairia \"mais barato\" do que o que acabou acontecendo depois...",
        "9... Ba6": "Como eu disse, o lance anterior das brancas foi péssimo... por causa dessa resposta!\nO bispo preto se transforma num verdadeiro monstro, dominando a diagonal a6-f1, sufocando as peças brancas e impedindo o roque das brancas por um bom tempo...",
        "10. Qd1": "A única casa segura da rainha branca é a casa de origem... O jogo das brancas começa a se restringir, ficando absolutamente encolhido. O bispo preto de a6, agora, impede o roque branco, pois ataca a casa f1. E as brancas não têm mais o bispo de casas brancas para combater o bispo das pretas. É esse tipo de posição que faz com que um bispo valha mais até do que uma torre (esse conceito é muito importante no xadrez: o valor de cada peça varia de acordo com sua mobilidade e sua influência no tabuleiro)",
        "10... Nxc3": "O lance óbvio, ameaçando ganhar um peão após uma eventual troca de cavalos...",
        "11. bxc3": "Em vez de bxNc3, talvez o melhor teria sido Qd2... talvez...",
        "11... Qxc3+": "Agora, além de ganhar o peão, a rainha dá cheque ameaçando a torre de a1.",
        "12. Nd2": "Obviamente, se as brancas tivessem jogado Qd2, perderiam a torre de a1.",
        "12... cxd4": "Pra ganhar mais um peão... ",
        "13. exd4 Qxd4": "E além de ganhar mais um peão, ameaçar o bispo em f4...",
        "14. Be3": "Ao final do jogo, ficará evidente que esse lance de bispo vai custar caro para as brancas (tirando o bispo do domínio da diagonal h2-b8)... Por causa desse lance das brancas, eu percebi uma possibilidade de mate bastante interessante (verão mais adiante).\nMelhor teria sido, para as brancas, defender o bispo com g3, por exemplo, apesar de g3 ser uma defesa mais passiva do que atacar a rainha com fizeram as brancas... Esse é um exemplo de que nem sempre ameaçar as peças adversárias é a melhor opção.",
        "14... Qc3": "Nesse lance, dei início ao meu plano. Faltava colocar apenas mais uma peça em jogo...",
        "15. Rb1": "Com Rb1, o plano das brancas é, claramente, jogar a torre em b3, afugentando a dama preta, pra desafogar um pouco a situação. Eu precisava evitar isso, pois para meu plano dar certo, eu precisava que minha rainha ficasse onde está...",
        "15... Bc4": "... Então, usei o bispo pra matar o plano das brancas, cobrindo a casa b3 e, de quebra, ameaçando o peão de a2. O cavalo não pode tomar o bispo por estar cravado - e o rei não pode se mover para libertar o cavalo, porque o bispo domina as casas e2 e f1!",
        "16. a4": "Pelo jeito, as brancas pensaram que a maior ameaça das pretas era tomar o peão de a2; por isso, moveram-no para defendê-lo, em vez de voltar a torre para a1. Provavelmente, as brancas ficaram com raiva de ter que voltar a rainha no início, e por isso recusaram-se a voltar a torre...",
        "16... Bd6": "Eis, aqui, o lance que parece inofensivo, mas que na verdade esconde uma ameaça fatal para as brancas. A propósito, aqui é que fica evidente o erro de posicionamento do bispo branco - que não deveria ter abandonado essa diagonal h2-b8, como já disse.\n\nNessa posição, poucos lances poderiam evitar uma derrota imediata das brancas, como por exemplo:\n\n17. Qf3 (que resultaria na queda do peão c2, formando um final de peões que levaria a uma vitória fácil para as pretas) ou\n17. Rb3 (sacrificando a torre branca em troca do meu incômodo bispo preto, o que de qualquer forma me daria também uma vantagem decisiva no fim de jogo).\n\nO melhor lance para as brancas, ao meu ver, seria 17.Qg4, mas as brancas provavelmente não viram nada bom nisso, e preferiram evitar a perda do peão a2 jogando a4.",
        "17. h4": "...Mas as brancas não viram a ameaça, e não jogaram nem Qg4, nem Qf3 e nem Rb3.\nImpedidas de fazer o roque, a intenção das brancas com o lance 17. h4 era, claramente, de colocar a torre em h3 para tentar afugentar a rainha preta...\n\nSó que agora, já era tarde demais: As pretas dão mate em dois lances.\nVocê consegue enxergar a sequência de mate?...",
        "17... Qxe3+": "Pow!!!!! Um sacrifício soberbo de dama para alguém tão capivara como eu!",
        "18. fxe3": "Obviamente, não serviria 18 Qe2, porque 18 ... QxQe2 seria mate...",
        "18... Bg3#": "... só que as pretas não perceberam que meu par de bispos era ainda mais poderoso do que minha rainha!\n\nEsse exemplo, apesar de longe de ser uma partida bem jogada (pois desde a abertura ambos os jogadores cometeram vários deslizes), ilustra alguns conceitos importantes do xadrez, como por exemplo a importância de se ter um conhecimento mínimo da abertura (o que, nesse caso, nenhum dos dois jogadores tinha), e também o conceito do desenvolvimento - ou seja, a necessidade de se desenvolver rapidamente as peças menores (cavalos e bispos) e rocar o mais cedo possível (regras desrespeitadas pelas brancas quando elas jogaram h3, por exemplo). Aqui, você pode me perguntar: se o roque é tão importante, porque as pretas não rocaram? Simples: porque não precisaram, pois as brancas, ao decidir não rocar, se colocaram em uma posição vulnerável, sendo obrigadas a se defender - e as pretas não desperdiçaram tempo e atacaram com todas as suas forças. E, obviamente, enquanto as pretas estavam atacando, seu rei não corria perigo.\nO jogo mostra, também, quão poderosa é a rainha (como as pretas mostraram no início) e o quão vulnerável é a rainha (quando precisa fugir das peças menores, como foi o lamentável caso da rainha branca)."
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-vedat?gm=54946",
    "gameName": "Challenge from vedat",
    "players": "vedat (1064) vs. cruzeirense (1644)",
    "opening": "Reti opening (A06)"
}