{
    "moves": {
        "1. Nf3": "Russ, a relative beginner, asked me to play him and annotate the game for him, to help him see where he went wrong. I am happy to help him.",
        "1... d5": "So this is the Reti opening",
        "2. d4": "This transposes bak into mainline queen's pawn opening.",
        "2... Nf6": "I opt for symmetry",
        "3. g3": "And this is leading it back more towards the Reti it started out. c2-c4 would lead to the Queen's Gambit.",
        "3... c6": "His bishop is heading for g2 and this blocks its action",
        "4. Bg2": "so he completes the manoeuvre",
        "4... Bf5": "I decide to develop, possibly following up with e7-e6 and my Bc8 is developed outside my pawn chain.",
        "5. h3": "Post match computer analysis (PMCA) doesn't give this as an error, but I would. Why not simply 0-0 immediately?",
        "5... Qc8": "So I play this to stop 0-0. I play the queen to c8 rather than d7, so it cannot be attacked by Nf3-e5",
        "6. O-O": "but he plays it anyway. It just gives up a pawn.",
        "6... Bxh3": "So I take",
        "7. Ng5": "He attacks my bishop",
        "7... Bxg2": "So I take",
        "8. Kxg2": "He takes back",
        "8... Qf5": "I attack the knight. Now it is my queen I want to develop outside the pawn chain.",
        "9. f4": "He protects the knight",
        "9... e6": "I open up a diagonal for my bishop.",
        "10. b3": "He prepares to develop his. PMCA says Qd1-d3 is best, to challenge my powerful queen. It then gives Nbd7 11. Nc3 h6 12. Qxf5 exf5 13. Rh1 Bb4 14. Bd2 O-O 15. Nf3 Rfe8 16. Ne5 Nxe5 17. dxe5 as best for both sides. I'm not sure why it gives this, rather than either side exchanging queens and weakening the opponent's pawn formation.",
        "10... Nbd7": "I get my other knight into play",
        "11. a4": "I really don't understand this move, he needs to be developing his queen side pieces pronto.",
        "11... Be7": "The bishop is played here, with thoughts of supporting king side pawn advances such as g7-g5 and/or h7-h5-h4",
        "12. e3": "He solidifies his pawn formation, but againhe should be developing. I want to play my knight into e4, but I don't want him playing Ng5xf3 so I hit his knight first",
        "12... h6": "Like this",
        "13. Nf3": "Knight retreats",
        "13... Ne4": "Mine advances ",
        "14. Ne5": "So does his, but the difference is I can easily drive his back. PMCA gives it as a mistake and favors 14. Ba3 Bxa3 15. Rxa3 Qg4 16. Qe1 h5 17. Rh1 O-O-O 18. Nbd2 Qf5 19. a5 Ndf6 20. a6 Rd7 21. Nxe4 Nxe4 22. axb7+ Rxb7 but black still has a big advantage\r\n \r\n",
        "14... f6": "So I hit the knight. PMCA says this is a mistake and gives  Nxe5 15. fxe5 Qg6 16. Qf3 O-O 17. Qf4 f6 18. Ba3 fxe5 19. Qxe5 Rxf1 20. Kxf1 Qf7+ 21. Qf4 Nxg3+ 22. Kg2 Qxf4 23. exf4\r\n \r\n",
        "15. Nxd7": "So he takes",
        "15... Kxd7": "I take back. My king is quite safe in the center of the board, as the centre is closed and unlikely to be opened quickly.",
        "16. g4": "This is a dreadful move, opening up his king side position. PMCA gives  16. c4 h5 17. Nd2 h4 18. g4 Qg6 19. cxd5 cxd5 20. Nxe4 Qxe4+ 21. Kh3 f5 22. Qf3 Qxf3+ 23. Rxf3 fxg4+ 24. Kxg4, but i think white needs to be developing his queen side pieces.\r\n \r\n",
        "16... Qg6": "So my queen retreats.",
        "17. Rg1": "A necessary re-enforcement of the g4 pawn.",
        "17... h5": "Now he has problems defending g4 and he can hardly advance it, it will be lost.",
        "18. Kf3": "Bringing the king up, and into more trouble. Kf1 was best.",
        "18... hxg4+": "So I take.",
        "19. Rxg4": "This natural recapture is a mistake and should have led to a mate in 7 starting with Rh2. I miss the mate, but finish him off quickly. Just accepting that he is 2 pawns down with Kg2 was relatively best.",
        "19... Qh5": "I completely missed Rh2, the line I did look at was Rh3+ 20. Kg2 Rg3+ 21. Rxg3 Qxg3 winning, but Qh5 seemed to be winning too.\r\n",
        "20. Qg1": "So he gives his rook greater protection",
        "20... f5": "But it is pinned and lost",
        "21. Ke2": "So the king starts to run",
        "21... fxg4": "I take the rook",
        "22. Kd3": "King runs again",
        "22... g3": "Pawn advances. This pawn will win the game.",
        "23. Ba3": "Finally he develops a queen side piece.",
        "23... Qf3": "I advance to help the g pawn advance",
        "24. Nd2": "He finally develops his knight!",
        "24... Nxd2": "So I take",
        "25. Kxd2": "He takes back",
        "25... g2": "I advance",
        "26. Kc1": "King tries to run",
        "26... Rh1": "This wins, although I missed a mate in 10, -  Bxa3+ 27. Kb1 Rh1 28. Ka2 Rxg1 29. Rxg1 Qxe3 30. Rxg2 Qc3 31. Rxg7+ Kd6 32. Rd7+ Kxd7 33. Kxa3 Qa1+ 34. Kb4 b6 35. c4 a5#\r\n \r\n",
        "27. Qxh1": "Kb2 holds out for longer, but his position is hopeless",
        "27... gxh1=Q+": "2 queens are better than one!",
        "28. Kb2": "He makes one last move, but it is mate soon!\r\n\r\nMany thanks for reading this annotation. Please rate the annotation on the star system and leave a comment to let me know how I am doing, until next time dear reader!"
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-charleshiggie?gm=51184",
    "gameName": "Challenge from charleshiggie",
    "players": "russ20124 (1173) vs. charleshiggie (2046)",
    "opening": "Reti opening (A06)"
}