{
    "moves": {
        "1. e4": "I always favour 1.e4 as my opening, because I have little experience in 1.d4.",
        "1... e6": "1.e6 is common enough so that I know the main line for this, the French.",
        "2. d4": "Following the main line of the French.",
        "2... c5": "This move hit me like a bullet. I have never seen this move in play before. What I see way more often is 2...d5.",
        "3. Nf3": "Although the d pawn was already protected, I protected it again with a knight while developing.\n",
        "3... Qa5+": "The queen comes out with check, so I have to get out of it.",
        "4. Bd2": "I block the check with the bishop, which attacks the offending queen.",
        "4... Qb6": "The queen moves back and attacks the b pawn",
        "5. Be3": "A mistake. Correct is Bc3, defending the b pawn.",
        "5... Qxb2": "Black snaps at this opportunity to take my b pawn which I had missed. With this move, black attacks my rook in the corner.",
        "6. Nbd2": "This was the only real way to get out of trouble because moving the knight to c3 would lose the knight...with check!",
        "6... Qc3": "Black plays a move that keeps pressure on me to keep everything defended.",
        "7. Bc4": "I am continuing development while black falls behind. I have developed all my minor pieces and ready to castle, while black only has his queen out.",
        "7... Qa5": "Another queen move. Black should have been developing a longtime ago.",
        "8. O-O": "I castle kingside and feel safe because the black queen will need time to get to my king, time that black needs to use developing his pieces.",
        "8... g6": "This move prepares to fianchetto black's bishop which is currently being traped by the c5 pawn.",
        "9. Rb1": "One of the advantages I get with black taking my b2 pawn is I get the half open b file whereas black doesn't have any files to work with his rooks.",
        "9... cxd4": "Black trades his flank pawn with my center pawn while opening the 5th rank for his queen. However, I will maintain my center control because, as stated before, I have the lead in development.",
        "10. Bxd4": "I take back with my bishop, and also force black to play f6, because 10...e5 fails to 11. Bxe5, 10...Nf6 fails to 11. Bxf6 and 10...Bg7 fails to 11.Bxg7.",
        "10... f6": "The expected move. The pawn is protected by the knight on g8.",
        "11. e5": "At this point I have high hopes of nabbing the rook on h8 and play 11.e5 to open up the long diagonal.",
        "11... f5": "Good move. If black takes, then bishop takes back and I win material.",
        "12. Qe2": "I put my queen on the same line as the king on e8 with hopes of a discovered attack on the king.",
        "12... d5": "A big mistake. Do you remember en passant? I take the d pawn unleashing a discovered attack on the rook by my bishop followed by winning it. Notice at move 12, black has only moved his queen and pawns. Not a very good way to start a chess game and it cost black.",
        "13. exd6 e.p.": "After this move, black , loses material. He will lose at least a rook.",
        "13... Bxd6": "Black starts developing, finally, but it is too late. Loss of a rook is inevitable, so, in desperation, grabs a pawn to soften the material deficit.",
        "14. Bxh8": "Now, I am free to nab the rook that I have been hoping to catch. Notice that my lead in development allowed me to win the rook.",
        "14... Nc6": "Black tries in vain to catch up in developing, but he doesn't see that the e6 pawn is under-defended.",
        "15. Bxe6": "I gain back the pawn I lost early on and threatening discovered check. The knight on g8 is also hanging. ",
        "15... Nce7": "A mistake which allows a further material deficit. Better was the other knight to e7.",
        "16. Bxg8": "I can capture on g8 without problem because when I capture, I unleash my queen to pin the defender of the knight, allowing the free capture.",
        "16... Kd8": "Black breaks the pin and now threatens my bishop. I have to move my light bishop...or do I?",
        "17. Bf6": "I move my DARK squared bishop and pin the knight which was attacking my bishop. I add another attacker to the knight and hope to diminish blacks forces by adding pin after pin after pin.",
        "17... Ke8": "This move does no good because the king walks into another pin by the queen so the bishop is in no danger.",
        "18. Bxe7": "Up material, you trade pieces and that's what I am doing here.",
        "18... Bxe7": "Black takes back and now the bishop is pinned.",
        "19. Rfe1": "Building pressure on the bishop.",
        "19... Qd8": "To prevent further material loss, black protects the pinned bishop.",
        "20. Qe5": "Advanding the queen forward so it can be more potent.",
        "20... Kf8": "King attacks my bishop so I have to move it or defend it.",
        "21. Qh8": "I defend the bishop with the queen and set up a discovered check.",
        "21... Ke8": "If the king stayed where it was, it would be checkmate in one move.",
        "22. Be6+": "A discovered check. There is only one reply.",
        "22... Bf8": "Forced move. But now I win even more material.",
        "23. Bxc8+": "Snagging the bishop. Black can't take because of a discovered check by the rook on e1.",
        "23... Qe7": "This looks like a blunder but this is the best way to stave off mate. 23...Kf7 loses to 24. Rxb7+.",
        "24. Rxe7+": "Winning the queen for the rook.",
        "24... Kxe7": "Black takes back.",
        "25. Re1+": "Now I bring my other rook in play and force mate in at most 4 moves.",
        "25... Kf7": "Oops! This is the quickest way to lose.",
        "26. Ng5#": "The knight comes into play and finishes off black with mate."
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-pandabear11?gm=50359",
    "gameName": "Challenge from pandabear11",
    "players": "pandabear11 (1200) vs. rollowa (1602)",
    "opening": "French defence (C00)"
}