{
    "moves": {
        "1. e4": "Nothing surprising here.",
        "1... e5": "Nor do I try anything fancy.  Until I have more experience I will go with the tried and true.",
        "2. Qf3": "When I see the Queen come out early, especially before all other pieces, I expect a good game for me.  I also expect he is about to attempt a trap at F7.",
        "2... Nf6": "Meanwhile I stay on the usual track, block white's queen's view of F7 and attack his pawn.",
        "3. Bc4": "Bishop's Opening (24).  He brings out the second half of his maneuver.  No doubt he's hoping I get greedy and go after his king pawn.",
        "3... Bc5": "I go after F2 and clear the way for O-O.",
        "4. d3": "Now he protects the king pawn.",
        "4... d6": "... as do I.",
        "5. Nc3 Bg4": "I develop a bishop and attack his queen in the process.",
        "6. Qg3 O-O 7. h3 Bh5 8. Bd5": "Finds a nice home on a center square and threatens to take my rook.",
        "8... Nc6 9. Bh6": "Threatens checkmate.  I don't like letting him this close to victory.",
        "9... Bg6 10. Bg5": "Another nice move, at the very least threatens to pull my king defense apart by exchanging pieces.",
        "10... Nd4": "Expecting a queen castle I push my knight to d4 with many attack possibilities.  If he doesn't castle I go to c2 forking his rook.",
        "11. O-O-O Bb4": "I go after one of the knights defending e2 and plan, at the very least to pull apart the king's defensive wall.",
        "12. a3": "Tries to drive away my bishop but...",
        "12... Bxc3": "I always intended to destroy the knight.",
        "13. bxc3 Nb5 14. Bxb7": "Can't resist a free pawn, I guess but it opens up b-file for me.",
        "14... Rb8 15. Bc6 Nxc3": "A free pawn for me and an excellent position against the king.",
        "16. Re1 Rb6": "Mounting my b-file attack while forcing him to save his bishop.",
        "17. Bd5": "He's back where he started with only a pawn for his trouble while I have a pawn and excellently placed rook and knight.  Better move would have been a4 adding a protecting line for the king.",
        "17... Qb8": "Power surge coming!",
        "18. Kd2 Ncxd5 19. exd5": "This exchange, I believe, came out in my favor.  He lost his bishop and (eventually) pawn occupying center squares while my knight moved in on this precious real estate.",
        "19... Rb1": "An exchange of rooks gives my queen free reign on white's first two ranks.",
        "20. Ne2": "He declines the exchange.",
        "20... Rb2": "I like this move because the pawn is pinned and now the queen can get to b3 if need be.",
        "21. Rec1": "To defend an attack on c2?",
        "21... e4": "Sets up a forking opportunity if he takes my pawn.",
        "22. d4": "Only reason he advanced I can think of is he didn't like a pawn in his king's face.",
        "22... e3+": "I attack hoping he takes it with the pawn that he will block off the queen.  Ultimately I want to get to d3 with my queen with the help of my bishop and rook.",
        "23. Qxe3": "He goes with the queen",
        "23... Re8": "About the only way I see at this point he can save himself is to sacrifice his queen at some point.  Otherwise the king is going down.",
        "24. Qc3": "Queen tries to interpose but there are ways around it.  The queen's stregth is also its weakness.",
        "24... Qb5": "Now my queen is poised for the death blow.",
        "25. Rhe1": "A real mistake, in my view, since the horse is not really threatened and now his king's backside is boxed in.",
        "25... Nxd5": "Time to drive away the queen.  Only one way to go, back the way he came.",
        "26. Qf3 Re3": "This is a sweet move.  Either his queen dies and he dies in two moves or he saves his queen and dies in one.  ",
        "27. fxe3 Qd3#": ""
    },
    "url": "https://gameknot.com/annotation.pl/challenge?gm=15972",
    "gameName": "Challenge",
    "players": "titosailing (1313) vs. honeybrook (1372)",
    "opening": "KP (C20), Napoleon's opening"
}