{
    "moves": {
        "1. e4": "annotations by sf115.  I'm proud of this game because I convincingly beat someone rated over 350 above me.",
        "1... e5 2. Nf3 Nc6 3. d4 exd4 4. Nxd4 Ne5": "a unusual variation of the scotch.  Probably bad",
        "5. Nc3 Nf6 6. Bg5 Bc5 7. f4 Ng6 8. e5": "A bit messy for black.  Perhaps 8. Nf5 is better",
        "8... h6": "The only way to save the piece",
        "9. exf6 hxg5 10. fxg7 Rg8 11. fxg5 Qxg5 12. Qe2+ Kd8": "12...Ne7 was better.  After that black could take the pawn on g7 and try to castle queenside.  White would still have a big advantage.",
        "13. Nf3 Qh6 14. Qd2": "Not the best move.  After 14...Re8  15. Be2 Be3  White's big advantage has dis-appeared.  Thankfully for me though black didn't play this.",
        "14... Qxd2+ 15. Nxd2 Re8+": "Not a great move.  15...Bd4 would put more pressure on white and it would be about equal.  The pawn on g7 can now be used as a decoy",
        "16. Be2 Bd4 17. g8=Q": "17. Rf1 would have been much better.  After 17...Bxg7 18. Rxf7 Re7 white has an advantage.",
        "17... Rxg8 18. O-O-O f5 19. Rhf1 d6 20. Nb5": "not great",
        "20... Be3 21. Kb1 a6 22. Nc4": "good counter attack",
        "22... Bg5": "This is bad because it loses controll of the d4 square.  White gets the advantage again",
        "23. Nd4 f4 24. Bf3 Bd7": "This blunders a pawn.  Probably the decisive mistake.",
        "25. Bxb7 Ra7 26. Bc6 Bg4 27. Rde1": "All the white pieces are very active",
        "27... Ne7 28. a3 Bd7": "black wants to swap off.  Better if 28...Bf6",
        "29. Bxd7 Kxd7 30. g3 Bf6": "Another pawn blundered.  The game is lost for black completely now",
        "31. Rxf4 Bxd4 32. Rxd4 Nc6 33. Rdd1 Raa8 34. Ne5+": "A clever swap off using a pin.",
        "34... Nxe5 35. Rxe5 Raf8 36. Re2": "Defending all the white pawns",
        "36... Rf5 37. Rh1 Rf3 38. Ka2 Rf5 39. Rg2 Rh5 40. h4": "A wrong move 40. g4 is better",
        "40... Rg4 41. c3 c5 42. Rf1": "White looks for play elsewhere",
        "42... Kc6": "43...Rxf4 doesn't draw.  43...Rxf4 44. gxh4 Rxg2 45. Rh1 Rg6 46. h5 Rh6 47. b4 white has a winning advantage.",
        "43. Kb3 Kb5 44. Rf6 d5 45. Re2": "White realises that he can sacrifice his kingside pawns for an attack.  If 45...Rxg3 46. a4  Ka5 47. Ree6 with mate to follow.",
        "45... a5 46. a4+": "Another clever pawn sacrifice",
        "46... Rxa4 47. Ree6 c4+ 48. Kc2 Ra2 49. Kb1": "This wins a rook so black resigned.  A good game\r\nAny Questions can be asked in private to sf115"
    },
    "url": "https://gameknot.com/annotation.pl/challenge-3?gm=11110",
    "gameName": "Challenge 3",
    "players": "sf115 (1501) vs. iddish (1866)",
    "opening": "Scotch game (C45)"
}