{
    "moves": {
        "1. d3": "I've done this annotation to try to work out what went wrong in this game for me (black), any comments would be appreciated",
        "1... d5 2. Nf3 c5": "I chose this move as it seemed an interesting option, white seems fairly passive to me and this seemed to help me gain the initiative",
        "3. Na3": "This move takes us out of the Gameknot database. Generally speaking it's not a good position for any knight to be on the edge of a board, in this case the knight seems to be doing nothing",
        "3... Nf6": "Normal development. Looking to castle on the kings side, this move also helps discourage Bg5 a little",
        "4. e3": "Another fairly passive move, white's bishops now have little scope for movement. I am expecting g3 followed by Bg2 at some point",
        "4... Nc6": "Standard development, starting to think about the possibility of Qa5 and what if anything I might gain from it",
        "5. Bd2": "White appears to be looking to castle queen side",
        "5... e5": "Lays a stronger claim on the centre, I also prefer this to e6 which restricts my lsb too much",
        "6. Ng5": "An early attack by white, this also opens the diagonal to h5 for the white queen",
        "6... Bg4 7. f3": "This is a poor move from white for a number of reasons. Firstly it pushes my bishop to h5  where I wanted it anyway, secondly it weakens the kingside pawn structure if white castles on that side. Finally it restricts the movement of the g5 knight, it's only safe spot is now h3\n\nBetter was Be2 ",
        "7... Bh5 8. g4": "weakens the white pawn structure even further ",
        "8... Bg6": "White has forced my bishop into a better position, I am happy with it here, if needed h6 can create a safe hole for it and push the white knight to the side of the board",
        "9. Rg1": "I cannot see the point of this move, it seems to achieve nothing, better would be something like Qe2 to allow white to castle, however with the benefit of hindsight white made good use of this position with his rook",
        "9... h6": "This move may be a bit premature at the time I wasn't clear which side I would prefer to castle on and this was an attempt to make the kings side a safer option, would I have been better with Be7  or Bd6 or to move my queen, say to b6?",
        "10. Nh3": "white now has both knights stuck at the edge of the board",
        "10... Bd6": "With hindsight e7 would be a much better place for this bishop.",
        "11. e4 Qd7": "I am now ready to castle on either side, whites previous move doesn't worry me unduly, I would be happy with exd5 Nxd5. Looking at it now, Qb6 seems better",
        "12. exd5 Ne7": "I cannot recall why I did this and it still doesn't seem any better than Nxd5",
        "13. c4": "I think white does the right thing with this move.",
        "13... Nc8": "heading to b6",
        "14. g5 hxg5": "I now have a nice half open file for my h rook and the possibility of exchanging the rook for knight and bishop should I choose",
        "15. Nxg5 Rxh2": "I like my rook here, it keeps the white king locked in place. All I need now is my dsb or my queen to be brought into action on the e1-h4 diagonal. Note that whites g1 rook has now become more important as it protects the knight.",
        "16. Nb5 Be7": "Looking at h4 i just need to shift that white knight",
        "17. Bc3 Nh7": "More pressure on the knight",
        "18. Bxe5": "Threatens my h rook and also threatens Nc7 forking rook and king",
        "18... Rxb2": "This is a major error which luckily white does not notice",
        "19. f4": "further support for the knight. White now has good control over the centre and plenty of space. ",
        "19... f6 20. Bc7 fxg5 21. Qf3": "gives the white king an escape square should I get my dsb to h4",
        "21... a6 22. Nd6+ Nxd6 23. Bxd6 Bxd6": "Better would be Qxd6 my bishop is now back where I don't really want it",
        "24. fxg5": "White takes advantage",
        "24... O-O-O": "Trying to get my king safe but this is a big mistake as we will see",
        "25. Bh3": "I had completely missed this pin",
        "25... Re8+": "The best form of defence is attack, I was hoping rather optimistically that white would give me a chance to save my queen",
        "26. Kd1 Rh2": "My plan here was to force him to take my queen and to try to regain some material in compensation",
        "27. Bxd7+ Kxd7 28. Rb1": "White hasn't seen my threat or chooses to ignore it",
        "28... Bh5": "Pinning the white queen however white has an escape with Rg4",
        "29. Rxb7+ Kc8 30. Rg4": "I figure a rook for a bishop is better than nothing",
        "30... Bxg4 31. Qxg4+": "At least we are equal again on points if nothing else, I still have plenty of pieces to attack (or defend) with",
        "31... Kxb7": "I now have both his rooks for my queen which I consider still gives me chances in the game",
        "32. Qd7+": "Another move I missed. I'm in big trouble now but I'm not clear how white can finish me off yet",
        "32... Kb6": "Attempting to preserve the rook but I think this is the killer mistake Ka8 or Kb8 may be better",
        "33. Qxd6+ Ka5": "would Ka7 be better? White now has a passed pawn, and has almost certainly won the game",
        "34. Qxc5+": "Nicely maintaining the pressure",
        "34... Ka4": "forced",
        "35. Qc6+ Kb4": "Looking to get my king to c3 there I thought I would be able to weave through the white pawns ",
        "36. Qxe8 Kc3 37. Qe5+ Kxd3": "still maintaining a vain hope that he will let me mate him with Rh1",
        "38. Qxh2": "Now black is completely lost. I didn't resign simply so that I could make some comments on how my opponent might have killed me off quicker",
        "38... Nxg5 39. Qd2+ Kxc4 40. Qxg5 a5 41. d6 Kc3 42. Qxa5+ Kb2": "Looking for stalemate my king is heading to a1 but I need him to take my g pawn first. Maybe should have attempted to get a draw by repitition",
        "43. Qa4 Kb1 44. Qb3+ Ka1 45. Kc1 g5 46. Qb1#": "thanks for reading"
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-elwoos?gm=24409",
    "gameName": "Challenge from elwoos",
    "players": "freakb (1166) vs. elwoos (1518)",
    "opening": "Mieses opening (A00)"
}