{
    "moves": {
        "1. e4 d5": "My usual. ",
        "2. exd5": "Sensible answer. ",
        "2... Nf6": "Surprising move number one of the Budapest. Instead of retaking, black poses white a little dilemma. ",
        "3. d4": "White chooses the so-called wisest answer: ignore the pawn and develop. ",
        "3... e6": "This is the Icelandic. Black, instead of retake the pawn, sacrifices one instead, for a quick developement. ",
        "4. Nf3": "White doesn't take the bite. Here, a lot of little tactics can be performed by white starting with Bb5+, and after black blocks the check, dxe6 forces black to open the f column. ",
        "4... exd5": "After Nxd5, c4 is strong and makes white win a tempo. ",
        "5. Nc3": "Instead of c4. This knight is dangerous on b5 in some circunstances. ",
        "5... Bb4": "Here, black has some material to work with: Ne4 is now possible, and Qe7+ supports the bishop and controls the e column. Nevertheless, black has to be very careful about his dsb's future. ",
        "6. Bg5": "White returns the compliment. ",
        "6... c6": "This move kind of delays my developement, but it opens the way for my dsb to c7, guards b5 from B or N, frees my Nf6 from the defence of d6 (once Nf3 is unpinned)... ",
        "7. Qe2+": "White takes the initiative, returning me my own plan. No panic. ",
        "7... Be6": "This bishop can be attackable by: the f pawn (no, because it is blocked), Nc5 or Nf4 (none of them is likely to reach those squares any soon, or White's lsb, after h4 and Bh3. I have plenty of time to act before that. ",
        "8. Bd2": "White unpins his knight, preventing my Ne4. ",
        "8... c5": "I made a clumpsy attempt to move the game on. I knew I left a hole in b5, but after Qb5+, I would have to choose among Qd7, and the more intriguing Nf-d7, since after Qxb7, Ndb6 blocks the white queen very badly. ",
        "9. dxc5": "Of course not Bxc5, since after Qb5+ I'll lose the bishop. \nI considered here Qa5 to be a good move. \n\nSome lines I explored:\n\n9.\t...\t\tQa5. If white goes \n10.\tNb5\t\tBxd2+\n11.\tQxBd2\tQd2+ and here, white must think about how to retake, since\n12.\tNxd2\t\tKd7, and black has compensation for the pawn, and is about to press hard on white's N and Pawn. On the other side, if\n12.\tKxd2, trying to save a tempo for castling, \n12.\t\t\tNe4+, forcing white to defend f2 with the king, and threatening c5.  \nAgain, after Kd7 and a6, black's asset improves drastically. For example:\n13.\tKe3\t\tKd7\n14.\tb4\t\ta6\n15.\tNd4\t\tNc6 etc, with a decent game. \n\nOr:\n9.\t...\t\tQa5\n10.\tNd4!\t\tKd7, with a lot of ways for white to proceed. \n\nOther possible black moves are:\n\nQe7 (10. Qb5+, Qd7...)\nNc6\nd4!? (10. Ne4 looks good, because it defends c5 and if... 10. ..., NxN 11. QxN, and black is free to play Bxc5, since after 12. Qxb7?, Bd4, 13. Qb5+, Nd7, 14. Ne5?, Qe7...",
        "9... Qa5": "Now I would have played another one. I just did not see all. ",
        "10. Qb5+": "The position is already very complicated, with possible tactics melées like this one: \n\nExchange queen or not to exchange?\n\nSac or not the b2 pawn. \n\n10.\te2-b5+\te6-d7\n11.\tf3-e5\tb4-c3\n12.\te5-d7\tc3-d2+\n13.\te1-d1\ta5-b5\n14.\td7-f6+\tg7-f6\n15.\tf1-b5+\tb8-c6\n16.\td1-d2\t\n\nor this\n10.\te2-b5+\ta5-b5\n11.\tc3-b5\tb4-d2+\n12.\tf3-d2\te8-d7\n13.\tb5-d6\td7-c6\n14.\td2-b3\ta7-a6\n15.\tb3-d4+\tc6-c5\n16.\td4-e6+\tf7-e6\n17.\td6-b7+\tc5-c6\n18.\tb7-a5+\tc6-b6\n19.\tb2-b4\tb8-c6\n20.\ta5-c6\tb6-c6\n\nor \n\n10.\te2-b5+\tb8-d7\n11.\tb5-b7\ta8-b8\n12.\tb7-a6\ta5-a6\n13.\tf1-a6\td7-c5\n14.\tc3-b5\tc5-a6\n15.\td2-b4\ta6-b4\n16.\tb5-c7+\te8-d7\n17.\tc7-e6\tb4-c2+\n18.\te1-d2\tc2-a1\n19.\te6-c5+\td7-c6\n20.\tc5-d3\tf6-e4+\n21.\td2-e2\th8-e8\n22.\th1-a1\te4-c5+\n23.\te2-d2\tc5-d3\n24.\td2-d3\tb8-b2\n\nand the one I like most: \n\n10.\te2-b5+\tb8-d7\n11.\tb5-b7\ta8-b8\n12.\tb7-c6\ta5-c5\n13.\tc6-a6\tf6-e4\n14.\tc3-e4\td5-e4\n15.\td2-b4\tb8-b4\n16.\tf3-d2\te4-e3\n17.\td2-b3\t",
        "10... Nbd7": "I went for this one, after a lot of complex lines, full of tricks, tactics of all kind. A melée. Strangely enough, despite the hole on the white diagonal, black seems to find compensation for b7 if white takes. \n\nWith cold mind, I can see that Nc6 was much better. This one was in the hope that white would take b7. \nI actually wanted to provoke white to get into c6. ",
        "11. Qxa5": "My reasoning must have been right. White didn't want to play my game, and went for simplification. I don't know if he wants to exploit Nb5, but this allows BxB+, and either ways white takes it,  black can shield and even treat something on the e column, one castled. ",
        "11... Bxa5": "Practically forced.",
        "12. Bb5": "White went for the simplification, being right to losen the tension. ",
        "12... O-O": "Ok, I could Castle and I am threatening c5. Not much for a pawn. ",
        "13. a3": "Nice way to protect the pawn, and tempting me to play BxN in order to recover c5. I didn't want to lose my bishop's pair, but this was the useless bishop's pair I could have seen ever. ",
        "13... a6 14. Bxd7": "Thank you white. Now my bishop's pair will gain in strenght. But this allows white to give the perfect structure to his pawns, and the game is too \"cold\" for me to get something from the position. I sacrificed a pawn for nothing, essentially. This happens to me when playing the Icelandic in a serious game. ",
        "14... Bxd7": "No use in threatening the pawn abandoning the guard of d5. From now on, the game is just useless. ",
        "15. O-O": "White can play b4 whenever he wants. ",
        "15... h6": "Bc7 would have been wiser, but I waited to b4. ",
        "16. b4 Bc7 17. Rfe1 Rfe8 18. Rxe8+ Rxe8": "18.\te1-e8+\ta8-e8\n19.\ta3-a4\tb7-b5\n20.\ta4-b5\ta6-b5\n21.\ta1-a6\te8-e6\n22.\ta6-a7\te6-c6\n23.\tf3-e5\tc7-e5\n24.\tc3-d5\tf6-d5\n25.\ta7-d7\td5-f6\n26.\td7-e7\te5-c7\n27.\td2-c3\tf6-d5\n28.\te7-e8+\tg8-h7\n29.\tc3-d2\tc6-a6\n30.\te8-e1\ta6-a4\n31.\tc2-c3\ta4-a2\n32.\te1-d1\tc7-e5\n",
        "19. Re1 b5": "I was trying here to block the huge white majority, hoping that the c pawn, alone, wouldn't have advanced very soon. But later...",
        "20. h3": "20.\th2-h3\ta6-a5\n21.\te1-e8+\td7-e8\n22.\tf3-d4\ta5-b4\n23.\ta3-b4\tf6-e4\n24.\tc3-d5\tc7-e5\n25.\tc5-c6\te4-d2\n26.\tc6-c7\te8-d7\n27.\td5-e7+\tg8-f8\n28.\tc7-c8+\td7-c8\n29.\te7-c8\te5-d4\n\nBecause the other way to proceed doesn't work: \n20.\th2-h3\td7-f5\n21.\te1-e8+\tf6-e8\n22.\tc3-d5\tf5-c2\n23.\td5-c7\te8-c7\n\nFinally, I discovered an \"innocent\" move that can be a very important \"finesse\". Black apparently loses a tempo, but it is not clear for white how to attack. ",
        "20... Kf8": "Assuming I am not overlooking some attack from white, this move actually reinforces my d5 pawn. Because: \n1) It allows my rook to move, by covering e7. \n2) It allows my king to retake the rook in case it is exchanged by white. Otherwise, I must do it with my lsb, because my knight is dued to the defence of d5. This makes me lose a lot of tempoes. Without rooks on the board, my king is better placed near to the action, and, moreover...\n3) It allows my lsb to move to f5, from where it threats heavily c2, not easy to defend. \nI assume white would try to attack with the g pawn (g4, g5), but I am confident I'll be able to handle that with my own threats. ",
        "21. Rxe8+ Kxe8 22. Nd4": "23.\tc5-c6\te5-d4\n24.\tc6-d7+\te8-d7\n",
        "22... Be5": "Trying to make some use of my bishops. I am welcoming c6...",
        "23. Be3 Kd8": "Bringing my king into the defence of the c column, overlooking...",
        "24. f4 Bxd4": "I can go Bc7, and I have no idea if this could have been better. ",
        "25. Bxd4": "The weakness of d5 crushes me. That's all the story!",
        "25... Be6": "Freeing my knight. I accept BxN.",
        "26. g4": "Normal. ",
        "26... Ne4": "Last attempt: to create some unbalance and a free pawn. But useless. ",
        "27. Nxe4 dxe4 28. Bxg7 h5": "aiming to h3, and trying to separate his pawn. ",
        "29. f5": "I expected this...",
        "29... Bd7": "...controlling c6. ",
        "30. Kf2": "30.\tg1-f2\td8-c7\n31.\tf2-g3\tc7-c6\n32.\tg4-h5\td7-f5\n33.\tg3-f4\tf5-h7\n34.\tf4-g5\te4-e3\n35.\tg7-c3\tf7-f5\n36.\tg5-h6\tf5-f4\n37.\th6-h7\tf4-f3\n38.\th7-g6\tf3-f2\n39.\th5-h6\t\n\nBut...\n\n30.\tg1-f2\td8-e7\n31.\tf5-f6+\te7-e6\n32.\tg4-h5\te6-f5\n33.\th5-h6\tf5-g6\n34.\th3-h4\td7-g4\n35.\tf2-g3\tg4-e2\n36.\tg3-f4\te2-f3\n37.\tc5-c6\t\n\nIt doesn't look good even in this way:\n\n30.\tg1-f2\td8-e7\n31.\tf5-f6+\te7-e6\n32.\tg4-h5\te6-d5\n33.\th5-h6\td7-f5\n34.\tf2-e3\td5-c6\n35.\te3-d4\tc6-c7\n36.\tg7-f8\tc7-c6\n37.\tf8-d6\tf5-h7\n38.\tc2-c4\n\nNor this: \n\n30.\tg1-f2\td8-e7\n31.\tf2-e3\tf7-f6\n32.\te3-e4\td7-c6+\n33.\te4-e3\tc6-g2\n34.\tg4-h5\tg2-h3\n35.\te3-f4\th3-g2\n36.\th5-h6\te7-f7\n37.\tf4-e3\tg2-d5\n38.\te3-d4\td5-a2\n39.\tc2-c4\tb5-c4\n40.\tc5-c6\tc4-c3\n41.\td4-c3\ta2-b1\n42.\ta3-a4\tb1-f5\n43.\tb4-b5\ta6-b5\n44.\ta4-b5\n\nCareful with...\n30.\tg1-f2\th5-g4\n31.\th3-g4\td8-e7\n32.\tg7-h6\te7-f6\n33.\tf2-e3\td7-c6\n34.\te3-f4\tc6-d5\n35.\tg4-g5+\tf6-e7\n36.\tf5-f6+\te7-e6\n37.\tg5-g6\tf7-g6\n38.\th6-g5\te6-f7\n39.\tf4-e5\td5-b7\n40.\te5-d6\t",
        "30... hxg4": "No use in delaying more this move. My bishop will have to defend e4, so no counterplay on the h3 pawn. ",
        "31. hxg4 Ke7": "It was very nice to dream on f6, from where my king can take a round and block the g pawn. ",
        "32. Ke3 Bc6": "As foreseen. White has to do a little work to win. ",
        "33. g5 Kd7": "No other interesting moves I can see. ",
        "34. Bd4": "! The winning move. ",
        "34... Ke7 35. Kf4 Bb7 36. g6": "No hope at all. ",
        "36... fxg6 37. fxg6 Bc6": "? The blunder. I should have gone Kf8, to occupy g8 with the king. But white then will win with the queenside pawns. ",
        "38. Kg5 Ke6 39. Kh6 Ke7 40. g7 Bd5 41. Kh7": ""
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-damalfi?gm=56052",
    "gameName": "Challenge from damalfi",
    "players": "isaiah11 (1765) vs. damalfi (1805)",
    "opening": "Scandinavian defence (B01)"
}