{
    "moves": {
        "1. Nf3": "I am not sure what this opening is called.  I know that the Dunst starts off with 1.Nc3, but I believe that this is the Reti opening.",
        "1... d5": "I am not surprised to see Sasha play this move.  Of course, 1...e5? isn't going to work.  But, I would've played 1...Nc6 to allow 2...e5 since the pawn would be protected.",
        "2. d4": "On the other hand, I also would've played this to stop black's d pawn from advancing further.",
        "2... Nf6": "Continuing with her development.",
        "3. c4": "Since Joann played d4, even though it's the second and not the first move, we follow the same idea that you see in 1.d4 openings, which I mentioned to one of my students.  Essentially, we need the c pawn and, therefore, don't want it blocked since it's like a center pawn.  So, this move allows Joann to safely play 4.Nc3 without the blockage.",
        "3... e6": "Opening up a line for her Be7.  So, while it might not look like it, this move also develops not to mention a nice pawn chain from black.",
        "4. Nc3": "As noted earlier, this was the plan behind 3.c4.",
        "4... c6": "I don't know why Sasha played this, as this appears to limit her mobility, if black is to play a later ...Bd7  Instead of covering 3 squares, the B would only cover 1, which for me, is enough of a reason to refrain from playing, unless this was Semi Slav in response to the QG as this isn't.  With that being said, I would've pinned, at once, with 4...Bb4 and would not even be afraid of 5.a3, as then I'd calmly answer with 5...Bd6 given that the d pawn isn't blocked.",
        "5. e3": "Opening up a line for her Bf1.  But, I would've played 5.c5 first to give the Bf1 more mobility as it would cover more squares.",
        "5... Nbd7": "Continuing with her development.",
        "6. Qc2": "I don't know why Joann played this since her development is completed.  In addition, I don't see an immediate attack or capture.  If I did, it would make sense, but there's got to be something that I'm not seeing.  As I would've played 6.Bd3 to enable castling short.",
        "6... Bd6": "Which is exactly what Sasha has in mind.",
        "7. Bd3": "But, Joann is getting that idea, as well.  I guess there's something going with both B+Q.  I just don't know what it is but am interested to find out.",
        "7... dxc4": "Meanwhile, Sasha decides that it's time to exchange pawns.  There's something about it that benefits black, but I'm not sure what it is.",
        "8. Bxc4 b5": "And, Sasha goes right on the attack.",
        "9. Bd3 Bb7": "Completing her fianchetto and development.  This will really increase her mobility.  That is, if Sasha exchanges with a later ...c5.",
        "10. Ne4": "Centralizing her N and preparing to exchanging which Sasha accepts.",
        "10... Nxe4 11. Bxe4 f5": "And, Sasha goes back on the attack.  But, this will cost her a pawn.  Instead, I would've retreated with 11...Bd3  But, taking note of this, I'm sure that Sasha planned on this sac.  In fact, the reason why is because it will tie down Joann's LSB when all is said and done.  So, what I'm learning is where you don't want to be too passive.  In a different annotation one of my students, I believe, was too passive just like how I was just now.  And, that costed her the game.",
        "12. Bxc6 Rc8": "As now, the Bishop is tied down.  But, Joann has a way around it.  In fact, I would've had a difficult time finding white's next move.  But, it wouldn't have been overlooked, though, since I learned about the significance about intermediate checks from GM Susan Polgar.",
        "13. Bxd7+ Qxd7 14. Qd1 O-O": "Meanwhile, Sasha wastes no time in getting her K to safety, or as Coach Stockel puts it, \"going home\".",
        "15. O-O": "Neither does Joann.",
        "15... a5": "This move will Sasha to get a nice pawn chain on her next move.",
        "16. Bd2": "And, Joann attacks it.  Had it not been for this move, Sasha, more then likely, would've played 16...b4  But, protecting this pawn comes first.",
        "16... a4 17. Ne1": "In addition, Sasha threatened to exchange N for B, but Joann refused, as would I.  The only time I wouldn't is if I was up, at least, an entire piece after what happened last Friday against Jack Stockel.",
        "17... b4": "Seeing that the pawn is protected now, Sasha advances it.",
        "18. Nc2": "This Knight manoeuvre is a very useful strategy.  This confirms my instinct since I was thinking about a possibility like this, so it shows that the N is stronger here then it was on f3.",
        "18... Qc6": "Meanwhile, Sasha attacks it again since it's only defended once.",
        "19. Ne1": "I would've defended again with 19.Rc1, but I guess there's something about it that's not as good.  With that being said, I like this move a lot.",
        "19... Ba6": "And, Sasha goes right after the Rf1.",
        "20. Rc1": "So, Joann counterattacks.  I have done this kind of thing when faced with an attacked piece where I go after something worth even more.",
        "20... Qb5": "However, Sasha had a trick up her sleeve since mate is now threatened, with which, Joann stops the threat.",
        "21. Nf3 Rxc1": "And, Sasha decides to exchange R's.  I don't see the point because of what Joann can do.",
        "22. Qxc1": "As I would've answered with 22.Bxc1  But, I see why Joann didn't play that since it appears to leave the Queen out of play.  On the other hand, since there's not other defenders, this will allow Sasha to attack again.  And, there's a nice tactic affiliated with it since Sasha will win material here.",
        "22... Rc8 23. Qd1 Qxf1+ 24. Qxf1 Bxf1 25. Kxf1": "And, that is the equivalent of two pawn.  But, it's about to get even more difficult for white, as we're about to see.",
        "25... Rc2": "As Sasha is targeting the a and b pawns.  Coach Stockel did something like this to take advantage of a mistake I made by not looking out for the Knight, and letting pawns be isolated.  He got the Rook involved and just started attacking my pawns.  ",
        "26. b3": "But, Joann defends by attacking the pawn.",
        "26... a3": "And, Sasha also defends.",
        "27. Ke2": "Getting the K in action which is a good strategy during endgames.  However, Sasha, as planned is going to pick up the a pawn.  In doing so, she will also have an unstoppable passed pawn.  It's also worth noting that before this game, I studied a similar position with Jack.  As my pawn was attacked, so I blocked to protect and try to prevent a passed pawn, similar to here.  But, Mr. Stockel showed me that with a R right in front it can promote which happened in that game, with which I resigned.  At a later time, I applied what I learned against either Carl or Tom Walsh in a tournament and won knowing that a passed pawn like that can still move with the R.  That's why, although it's not over yet, this is when I figured out that black is clearly winning.",
        "27... Rxa2 28. Kd3": "Joann is doing what she can to hang in by advancing the K again.  I'm also familiar with this since in an endgame, you want to bring the K up.  Unfortunately, it's too little too late because of Sasha's next move.  As this is where she's going to sac her R for B for a passed pawn which she got by taking on a2.",
        "28... Rxd2+ 29. Kxd2 a2": "The idea behind this is that Sasha has a passed pawn that can't be stopped.  Therefore, Joan resigned since that pawn is going to promote.  Believe this position is not much different from what I had with Tom Walsh when I gave up my R.  The idea is that not only should passed pawns be pushed, but when you have an interference with one of your pieces, then is the time to give it up for something like this, an unstoppable passed pawn."
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-jstevens1?gm=64775",
    "gameName": "Challenge from jstevens1",
    "players": "jstevens1 (1821) vs. clashofpawns (2306)",
    "opening": "Reti opening (A06)"
}