{
    "moves": {
        "1. c4": "Mon adversaire commence probablement à me surprendre en jouant c4. En effet, ce coup permet de sortir la dame en a4 sans que je fasse ...b5, et dans le cas suivant cela aurait donné 2.Dxb5 et j'aurais eu une pénalité d'un point.",
        "1... e5": "Je libère mon fou noir afin d'attaquer le roi adverse qui se trouve sur une case noire.",
        "2. e3": "Deuxième protection pour le pion, en plus de la sortie du fou.",
        "2... Bb4": "Cloue le pion dame, sans autre effet particulier que de faire perdre un temps, car au coup suivant 3.a3, mon fou doit reculer et donc me fait perdre un temps.",
        "3. g3": "Libère son fou blanc tout en faisant une défense croisée, il aurait pu jouer 3.a3 en me faisant perdre du temps.",
        "3... Ne7": "Je prépare un petit roque (que je ne ferai pas pendant la partie) et j'essaie de ne pas trop exhiber mon cavalier.",
        "4. a3": "Comme il n'a aucune menace pour le moment, il veut me faire perdre du temps.",
        "4... Bd6": "Obligé, car le déplacement en c5 offrait une perte de temps supplémentaire avec 5.b4 qui est protégé et la retraite en a5 fournissait une perte de temps avec le même coup.",
        "5. f4": "Menace le pion roi.",
        "5... f6": "Protection \"pyramidale\".",
        "6. Qh5+": "Mauvais coup car perte de temps, car il faudra rentrer la dame avec 6....g6 !",
        "6... g6": "Les blancs doivent encore bouger la dame.",
        "7. Qf3": "Judicieux, car 7.Dg4 offrait une menace supplémentaire avec le pion de la tour : 7....h5 !",
        "7... Nec6": "Mauvais coup, les pions et la dame l'empêchent de se déplacer.",
        "8. Bh3": "Un coup plutôt calme ...",
        "8... Rf8": "Le mouvement de la tour qui brise le petit roque.",
        "9. b4": "Coup assez inattendu.",
        "9... a5": "Le pion est protégé par la tour et le cavalier.",
        "10. d4": "Marée de pions !",
        "10... e4": "Mauvais coup, le pion est sans protection.",
        "11. Qxe4+": "Logique.",
        "11... Ne7": "Rassemblement de pièces autour du roi.",
        "12. c5": "Très bon coup, car il menace le fou et l'arsenal de pions et la dame l'empêchent de partir.",
        "12... f5": "Menace la dame, et empêche le fou de se faire prendre, sinon le déséquilibre est trop important.",
        "13. Qd3": "Obligé.",
        "13... Ra6": "Assez inutile, protège encore plus le fou.",
        "14. Nf3": "Les blancs veulent maintenant paralyser le camp adverse. Mais ils pouvaient prendre le fou avec un meilleur avantage.",
        "14... Nd5": "Bon coup, car permet aux pièces de se déplacer.",
        "15. Ng5": "Menace le pion et, au coup suivant, la tour.",
        "15... Qe7": "Empêche le cavalier de prendre le pion.",
        "16. cxd6": "Le cavalier ne pouvant plus bouger, le pion prend le fou.",
        "16... Qxd6": "Réaction immédiate.",
        "17. Ke2": "Mouvement du roi incompréhensible.",
        "17... h6": "Menace le cavalier.",
        "18. Qb3": "Mauvais coup, le cavalier étant protégé par la dame.",
        "18... Rc6": "Menace le fou blanc.",
        "19. Nh7": "Menace la tour.",
        "19... Rf7": "Met le cavalier en zugzwang.",
        "20. b5": "Menace la tour.",
        "20... Rb6": "Logique.",
        "21. Nd2": "Les blancs se resserrent en défense.",
        "21... Rxh7": "Permet d'égaliser.",
        "22. Nc4": "Menace la dame et la tour. Bon coup.",
        "22... Qe6": "Le cavalier ne pouvant pas être pris, j'éloigne la dame.",
        "23. g4": "Attaque le pion en f5 mais ne fait pas 23. Cxb6 qui lui aurait laissé un avantage de  2.",
        "23... fxg4": "Le pion reste toujours protégé dans la diagonale de la dame. Le coup 24.Fg2 semble le plus adapté car il menace le cavalier, mais ...",
        "24. Nxb6": "... Il préfère prendre la tour et ainsi se sacrifier pour rien ! Un très mauvais coup.",
        "24... cxb6": "Coup douteux, car forme une rangée de pions doublés.",
        "25. Kd3": "Zugzwang pour les blancs !",
        "25... Nb4+": "Est protégé par le pion et fait échec.",
        "26. Ke2": "Le tournant du match.",
        "26... Re7": "J'ai tout d'abord fait ce mouvement pour faire un mat en prenant le pion e3 mais je me suis rendu compte plus tard que la tour empêchait l'échange des dames, même si le pion d7 était ailleurs.",
        "27. Qb2": "Se dégage de la ligne de mire de la dame noire.",
        "27... Qc4+": "Depuis ce coup, les noirs feront toujours échec.",
        "28. Kd2": "Le recul en f2 semblait plus approprié.",
        "28... Qd3+": "La dame est protégée par le cavalier.",
        "29. Ke1": "Forcé.",
        "29... Rxe3+": "Un coup extrêmement ... nul. En effet, 30. Fxe3 prend la tour et empêche les noirs de mater. Les blancs durent être décontenancés ou jouer trop vite, mais ils jouèrent 30. Rf2??.\r\nPlus tard, je me rendis compte que je m'étais inintentionnellement appuyé sur les erreurs de mon adversaire.",
        "30. Kf2": "Le fou a été totalement oublié. Le mouvement 30.Fxe3 garantissait un rétablissement des blancs. Très mauvais coup.",
        "30... Rf3+": "Protégé par la dame et le pion.",
        "31. Kg2": "Obligé. Et c'est maintenant qu'une petite pièce insignifiante va aider au mat ...",
        "31... gxh3+": "Un excellent coup qui coupe la retraite du roi.",
        "32. Kg1": "Obligé.",
        "32... Qf1#": "Et le superbe mat final. Le roi ne peut pas prendre la dame en f1 car la tour la protège. Et le roi ne peut pas aller ni en f2 à cause de la tour et de la dame, ni en g2 où il est attendu avec la dame et le pion."
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-frederickrose?gm=11157",
    "gameName": "Challenge from frederickrose",
    "players": "frederickrose (881) vs. villiers (887)",
    "opening": "English opening (A20)"
}