{
    "moves": {
        "1. Nf3 Nf6 2. c4 Nc6 3. d4 e6 4. a3": "Nc3 developing a piece or e3 developing the Bishop would be better.\n",
        "4... d6 5. Nc3 g6 6. g3 Bg7 7. Bg2 O-O 8. O-O d5 9. cxd5 exd5 10. Bg5 h6 11. Bf4 Ne4 12. Qd3": "Not a good move.  Opening the Queen to attack with no compelling reason.  Bf5 discovered attack.  Enemy Bishop with a line down the center.  two knights around the center.  Asking for trouble.   I would have preferred Ne5.\n ",
        "12... g5": "The attack on the Bishop.  Safest bet would have been Be3 or Bc1.  Bd2 allows the Knight to trade.",
        "13. Be5": "Now the Bishop is lost.",
        "13... f6": "No place left to go that is safe.",
        "14. Bxc7": "Best move.  At least you gained some material.\n",
        "14... Qd7": "No need to take the Bishop right away.",
        "15. Be5": "Better to develop your Knights.  For instance, the Knight at f3 has no place to move that can begin a threat.  Better to move it to d2 so it can back in the fight.  The Knight at c3 could break up Black's position somewhat with the trade Nxe4(NxN).",
        "15... Nxc3 16. Qxc3 Qe7 17. Bxf6": "Good idea, take another pawn",
        "17... Qxf6 18. Ne5": "Not a bad move in itself.  But, it does set up a trade and when you are down a piece you don't want trades if you can avoid them.",
        "18... Nxe5 19. Bxd5+": "?? Now that Knight was free.",
        "19... Nf7 20. e3 h5 21. Bb3 Bh3 22. Bd5 Rac8 23. Qa5 Rc2 24. f4 Bxf1 25. Bb3": "Bad move, now the Bishop and the pawn are lost also.",
        "25... Rxb2 26. Rxf1 Rxb3 27. Qd5 Rxe3 28. Rf2 Qxd4": "Again, when you are behind in material, don't trade unless you have too.\n",
        "29. Qxd4 Re1+ 30. Kg2 Bxd4 31. Rd2 Rg1+ 32. Kf3 Ne5+ 33. Ke4 Re1+": "Here I can announce a mate in 7.  See what squares the King can move to.\nonly d4(B) or d5. So K takes B.",
        "34. Kxd4 Nf3+": "Now the King only has d3,d5 or the c column at c3,c4 and c5\n",
        "35. Kc3": "King moves to c3 to try to protect and hide behind the Rook. ",
        "35... Re3+": "mate in 5.  King can move to c2,c4 of the b column 2 or 4",
        "36. Kc4": "King tries to stay in the center of the board.",
        "36... Rc8+": "Now the only moves for the King are b4 and b5.  Mate in 4.",
        "37. Kd5": "Now trapped in the d column.  ",
        "37... Rd8+": "Move him to the C column Mate in 3  The only squares open are c4 and c5.",
        "38. Kc5 Nxd2": "Mate in 2. ",
        "39. h3 Rc3+ 40. Kb5 Rd5+ 41. Kb4 Rc4#": ""
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-acudata?gm=36914",
    "gameName": "Challenge from acudata",
    "players": "grege79 (1356) vs. acudata (2434)",
    "opening": "Reti opening (A05)"
}