{
    "moves": {
        "1. d4 Nf6 2. c4 e6 3. Nc3 c5 4. d5 exd5 5. cxd5 d6 6. e4": "Benoni - Thematic game.",
        "6... g6 7. Nf3": "main line",
        "7... Bg7 8. Bb5+": "the most agressive line.",
        "8... Nbd7": "The best move is supposed to be N. Black perfectly  knows it but wants to try something else.",
        "9. e5": "Not at all considered as the best move but white also want to experiment.",
        "9... dxe5": "logical",
        "10. Nxe5": "Black cannot take back",
        "10... O-O 11. Nf3": "to  prevent Re8 pinning the knight.",
        "11... a6": "Black counters",
        "12. Be2": "12. d3 is another candidate move but 12. .. Re8 would have been anoying",
        "12... Nb6": "To devellop and attack the d pawn. ",
        "13. h3": "White cannot  protect the d pawn, 9. e5 was definitely a mistake,  so that 13. h3 to prevent 13. ... Bg4 or 13. ... Ng4",
        "13... Nbxd5": "Taking the poor isolated white pawn (and settling a knight on he center). Black has a material advantage and his position is better. Things are going bad for white.",
        "14. O-O": "Defense first and preparing a counter attack as soon as possible.",
        "14... Nxc3": "Of course black carries on attacking ",
        "15. bxc3": "\"music...\" Werstern movie  : the two champs face each other... \"music again\"",
        "15... Ne4": "A rider comes around",
        "16. Bd2": "to link the a rook and the queen ",
        "16... Nxc3": "Black takes.",
        "17. Bxc3 Bxc3": "Black is now 2 pawns ahead but his pièces are not develops so that white's plan is to attack quickly.",
        "18. Rc1": "Counter attack but with 2 pawns late, white has a bad game, not to speak of the 2 black bishops",
        "18... Qa5 19. Qb3": "White's pla is to attack f7 with all th available material and obtain a good trading sequence.",
        "19... Bg7": "The black raider goes back in his lair",
        "20. Rfe1 Qc7 21. Bc4": "Aiming at f7",
        "21... b5": "Attacking and advancing the pawns",
        "22. Bd5": "Black will have to play a defensive move",
        "22... Rb8 23. Ng5": "f7 is still the goal",
        "23... c4 24. Qb4": "to menace 25. Nf7 Rxf7 26. Re8+  Rf8 27. Qxf8+ mate",
        "24... Bb7": "Black sees the danger and plays the proper move",
        "25. Bxf7+": "Now white has little choice, for there is no  good place for the LSB. So that i initiate a trading sequence",
        "25... Rxf7 26. Nxf7 Qxf7": "At least the black king is weakened but white is still two points late in material.",
        "27. a4": "Minority attack. If 27. ...  bxa4 28.Qxa4 and black has 2 isolated pawns ",
        "27... Qd5": "Mate menace",
        "28. f3": "Only move",
        "28... Bf8": "Menacing the queen, black is on attack again",
        "29. Qa5": "Still covering the a5 e1 diagonal",
        "29... Qg5": "To prepare 30. ... Bf3",
        "30. Ref1": "Protection move.",
        "30... Bc5+": "Black's attack is getting dangerous",
        "31. Kh1 Rf8": "This move is less effective than it first seems because white is not forced to take with the f pawn, so that",
        "32. Rcd1": "Setting the rook on the open file to prepare a counter attack",
        "32... Qe3": "The main danger is not the attack on f3 but the pawns on the queenside",
        "33. axb5": "One less. White takes the initiative again",
        "33... c3": "Two more squares but white has still heavy material. ",
        "34. Rde1": "Menacing the queen which has little good spots to go",
        "34... Qd3 35. bxa6": "Material equality. Black's c pawn is only two squares away from promotion but white has a frk attack between the 2 bishops",
        "35... Bxa6 36. Qxc5": "Now white has material advantage. The only problem is the c pawn (but it's a big problem)",
        "36... Rc8": "Very good move. White is in serious touble for I cannot prevent black to play c2. The sacrifice of the black knight was a good one.",
        "37. Qe7": "The only possible move, I believe. If black plays anything else than 37. ... c2, white has a possible counterattack by Rd1 etc... If black plays c2, white has still a possibility, which is...",
        "37... c2": "Black plays c2",
        "38. Qe6+": "Draw  because white can give perpetual check."
    },
    "url": "https://gameknot.com/annotation.pl/challenge-benoni-5?gm=50713",
    "gameName": "Challenge: Benoni 5",
    "players": "ptitroque (1746) vs. bwaa (1742)",
    "opening": "Nimzo-Indian defence (E20)"
}