{
    "moves": {
        "1. e4": "Hey guys. This has been my 4th game against my coach, dan. And I have a feeling I might have this one in the bag. Of course, I'm only on move 35, so lots could still change. But I like how even of a challenge he is for me. Hope this one's my best",
        "1... e5 2. Nc3 d6 3. Bb5+ c6": "This is my favorite form without the knights. It might look weird, but it helps later",
        "4. Ba4 g6 5. d4": "Capturing would get his queen to the action, and attack my rook. So I try another alternative-Be7",
        "5... Be7": "Now most of you would think, then g6 is a wasted move. I completely agree with you",
        "6. d5": "he pins me, but nothing serious",
        "6... Bd7 7. Be3": "Here I try a tricky combination of moves, hoping for the best out of this position-",
        "7... cxd5": "C6xD5",
        "8. exd5": "E4xD5",
        "8... Bxa4": "BxA4",
        "9. Nxa4": "Nxa4, following up with Qa5+, getting into the action",
        "9... Qa5+": "now he has 2 options here-C3, or nc3. I say best is nc3, but he tries an alternative",
        "10. c3": "Tricky- a protecter for the knight",
        "10... Nf6": "hello, anyone forgot a pawn?......................................................................yeah\r\n",
        "11. b4": "He still leaves a helpless little pawn for me to kill",
        "11... Qxd5 12. Qxd5": "I want your opinions on this- which side do you think is better after nxd5? I say black. It's area is way more secure. And better for castling",
        "12... Nxd5 13. Bh6 Nf4": "I wanted to give him some bait to get off h6. I wanted to castle",
        "14. Bxf4 exf4": "leaving a partly open file to take advantage of after I castle",
        "15. Nf3 O-O 16. O-O": "Line-in-line rooks will help me in this kind of a position, especially when he can pin me on the open file, so i need backup by moving my knight",
        "16... Nd7 17. Rfe1 Bf6": "pinning the pawn, or atleast freezing the knight will help\r\n",
        "18. Rad1 Be5": "here I was planning NxE5, NxE5, RxD6, F3, G2xF3, NxF3, KF1, NxE1",
        "19. Nxe5 Nxe5": "things have went well so far...",
        "20. Rxd6": "but not for long. I had dropped a pawn along the way",
        "20... Rfe8 21. h4": "?",
        "21... f3": "no matter the outcome here, the trade favored black",
        "22. g3": "MAN!",
        "22... Nc4": "There I was puting on a seccond attack, Hoping he would move his D6 rook instead. Oh, yes. He played it. But safe- Rdd1",
        "23. Rdd1 Rxe1+ 24. Rxe1": "Iv'e come into alot of even games against this guy. But I end up losing them all because I'm not the best at endgame. It's even again. I hope I can pull something off-",
        "24... h5 25. Re4 b5 26. Nc5 Rd8 27. Re1 Kf8": "I had a game against the same guy just 3 weeks ago were it came down to a rook and knight vs. a rook and knight. I lost, but it was all because of his well played rook. Why not make the same mistake again-",
        "28. Kh2 Re8": "now here I obviously made a terrible mistake. I was afraid of him having a rook so I just wanted to trade them off. He probably could have responded nd7+, and that would ruin everything. I suppose coach just went easy on me",
        "29. Rg1 Re2 30. g4 Rxf2+": "Advantage!",
        "31. Kg3 Rg2+ 32. Rxg2 fxg2": "Rooks are gone- MISSION ACCOMPLISHED",
        "33. Kxg2 Ne3+ 34. Kf3 Nxg4 35. a4 bxa4": "Now is where I left off. I'm a pawn ahead. Who do you think will win?",
        "36. Nxa4 Ke7 37. Ke4 g5 38. hxg5": "I tried trapping his pawn so I could also go for promotion. That plan failed after an upcoming move that cost me the game- f6",
        "38... h4 39. Kf3 h3 40. Kg3 h2 41. Kg2 Ke6": "I was planning to get his pawn, but he senced me off to a different plan after HE went for promotion",
        "42. c4 Kd6 43. c5+ Kc6 44. Nc3 f6": "Here came the losing move- F6. I knew the instant from move 45 it was a dead game",
        "45. g6 f5 46. g7 Nh6 47. Kxh2 f4 48. Kg2 a5 49. bxa5 Kxc5": "my plan here was way off topic. But with 2 threats of promotion, I came from a good game to a bad game.",
        "50. Kf3 Kc6 51. a6 Kb6 52. a7 Kxa7 53. Kxf4": "here  I was about to resighn. My hopes were lost even at only -1 points. This position was everything",
        "53... Kb7 54. Kg5 Nf7+": "A HUGE screw up. Ng8 is MUCH better. Little mistakes like that in this type of a position mean everything. Now, after Kg6 I will probably resighn- lose my 4th game against him",
        "55. Kg6": ""
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-posthuma?gm=23599",
    "gameName": "Challenge from posthuma",
    "players": "dpmcd (1460) vs. posthuma (1200)",
    "opening": "Vienna game (C25)"
}