{
    "moves": {
        "1. e4": "I know this game is not an impressive one, but I'm showing someone who is new at the game what NOT TO DO in the opening. Said that, I proceed.\r\n\r\nHe starts with Kings pawn.",
        "1... e5": "I reply with kings pawn too.",
        "2. d4": "He wants to offer a pawns exchange or to have a strong center after d5 if I ignore his pawn. Personally, I think this is a bad idea, since, he'll have to play immediate queen capture or will have to fight tougher to recapture the pawn later. And for those who don't know why queen can't be brought out before other pieces have developed, just continue viewing the game.",
        "2... exd4": "So, I take it...",
        "3. Qxd4": "Queen capture, the guy doesn't believe in delayed recaptures with minor pieces, or in the troubles his queen could get into by developing too early...",
        "3... Nc6": "Development of knight and attacking the queen.",
        "4. Qd5": "Keeps the queen near, guess he is planning an attack.",
        "4... Nf6": "Okay, let's keep the development and forcing him to play defensive.",
        "5. Bg5": "Nice pinning.",
        "5... Be7": "Now my knight is pinned... But developing my bishop while also opening way for castling looks the best here for me. It also counterpins my knight, so now he has his queen en-prise again.",
        "6. Bxf6": "He takes it, of course. He would have regretted not doing so.",
        "6... Bxf6": "I recapture, my bishop ends up challenging his b-pawn, so, again, he's got to lose tempo in defense.",
        "7. Bc4": "Looks like he's determined to put me in trouble. He's menacing mate in f7.",
        "7... O-O": "Ah, I just castle, my king is safe. Now, where were we? Ah yes, threatening his b-pawn... You'll defend it?",
        "8. Nf3": "No! He totally forgot his b pawn... this is bad for him... maybe he'll bring up more power against my f7 square, but I can neutralize it and after I do, he'll be in so much trouble.",
        "8... Bxb2": "Well, b-pawn is gone, and nothing can help that rock now.",
        "9. Ng5": "Trying to gang up on f7... Now there's 3 attackers and 2 defenders... I'm losing there...",
        "9... Qf6": "Well, that's it, now I'm good. 3 defenders... If exchanges take place, I'll lose my queen and rock against his queen, bishop and knight, so, pretty welcome. He can't push the e-pawn. I'd immediately capture it with Queen giving him a check. He either moves his king or exchanges queens, and this will be over much faster.",
        "10. h4": "I guess he wants to keep his grip on my castle there.",
        "10... h6": "I try to encourage him to start exchanging or to back off completely.",
        "11. g3": "He ignored it! Of course he would. If I capture his knight with the pawn, he recaptures puting my queen en-prise, and leaving a totally open h-file where he could add all his remaining forces to trap my king in a castled position where I have not much way to escape. My own defending pieces would be my tomb. So no, not worth the \"free knight\".",
        "11... d6": "I'd rather open up way for my c-bishop so he can come to defend the g8-a2 diagonal when the time comes.",
        "12. f4": "He definitely wants to secure his grip, while also trying to limit my pieces movility.",
        "12... Nb4": "I see a nice combination, I'm getting rid of that queen once and for all. My knight here is puting his queen en prise and also menacing a fork at c2.",
        "13. e5": "He's going for the queen exchanges.",
        "13... dxe5": "I take it to keep the initiative of the attack. His queen is en-prise, not mine.",
        "14. fxe5": "He captures, now again there is both queens en-prise. At this position, I could easily win the pawn with the Bishop, but then he would lift up c pawn to protect his rock. I would capture it with bishop, check. He captures with knight, I could capture with queen check, but then he just would lift up his king and his rocks would be connected. My queen couldn't go for the rock anymore and I'd have to cope up with 3 pieces of his still over my f7 weak position... so no. Exchanges would happen now and still I would win the pawn.",
        "14... Nxd5": "I capture with knight. This way, he's forced to capture my queen first, or be in serious disadvantage. And he only can capture it with the pawn. And after he does, my knight will both come off his bishop range and capture the pawn.",
        "15. exf6": "His only good choice.",
        "15... Nxf6": "And the only one I had to keep the material advantage... at this point, I'm 2 pawns ahead, but my bishop is still having his rock, so, I'll have an easy endgame once I start exchanging all I can.",
        "16. O-O": "He castles, trying to give his king a little safety that has come a bit too late. Besides, he's aiming to keep his grip in f7. I have to balance it.",
        "16... hxg5": "So, I get rid of the future menace over f7. If he captures the pawn, I send my knight to e4 for a pawns fork. I bet he's more worried about losing a whole rock with nothing in return, so my guesses at this point is he'll move his knight.",
        "17. Nd2": "My guesses correct. He connects his rocks.",
        "17... Bxa1": "I finally do what I prepared since 10 moves ago. Not for free, but still a material advantage.",
        "18. Rxa1": "He recaps.",
        "18... gxh4": "I go for the pawn.",
        "19. gxh4": "He recaps.",
        "19... Bf5": "I threaten another pawn.",
        "20. c3": "He saves it.",
        "20... c6": "I prepare for stoping his remaining pawns and pushing back his remaining pieces.",
        "21. Rf1": "Aims for my unguarded bishop.",
        "21... Be6": "I try to force exchanges.",
        "22. Bxe6": "He takes it.",
        "22... fxe6": "Recapture.",
        "23. Kg2": "He needs to get his king to a better position, for it has turned practically into an endgame.",
        "23... Nd5": "I do 3 things in this movement.\r\n\r\n1. I menace rocks exchange, that would leave his king practically alone against my rock.\r\n\r\n2. If he doesn't exchanges, his king will be confined to h and g files.\r\n\r\n3. My knight forks his c-bishop and e3, which is dangerous for him, coz my knght would fork his king and rock, a rock already attacked, so he'd lose his rock for nothing.",
        "24. Rxf8+": "He could have better tried to protect c pawn from c1 with his rock, but he exchanges to avoid my rocks to line-up in the f-file.",
        "24... Rxf8": "I recapture with the rock, his king is confined to h and g files.",
        "25. c4": "Tries to menace my knight.",
        "25... Ne3+": "A fork over his king and pawn.This will inmovilize his knight while I add pressure on the pawn with my rock also.",
        "26. Kg3": "Not there! That will let me play knight to f1, forking his king and knight. He'll have to exchange knights, his only chance to defend.",
        "26... Nf1+": "Check!",
        "27. Nxf1": "Capture.",
        "27... Rxf1": "Capture, and this has now turned into a Rock + King vs King mating sequence.",
        "28. Kg4": "Tries to make some oposition.",
        "28... Kh7": "I bring my king into action.",
        "29. a4": "Losing tempo.",
        "29... Kh6": "I bring my king closer.",
        "30. c5": "Losing tempo.",
        "30... e5": "preparing to play Rf4",
        "31. a5": "He knew what was coming, he puts his pawn off danger.",
        "31... Rf4+": "Check!",
        "32. Kg3": "Backs off.",
        "32... Kh5": "Gang up against his pawn.",
        "33. a6": "Desperate effort.",
        "33... bxa6": "No more to move but king for him after this capture.",
        "34. Kh3": "King thinks he can defend the pawn.",
        "34... Rxh4+": "Rock proves him wrong.",
        "35. Kg3": "King trying to escape now.",
        "35... Rf4": "Rock won't allow it.",
        "36. Kh3": "King ready to be sent back.",
        "36... Rf3+": "Check!",
        "37. Kg2": "King wants my rock.",
        "37... Kg4": "I guard it.",
        "38. Kh1": "Desperate moves not to be mated.",
        "38... Rf2": "Rock secures the king to g1 and h1.",
        "39. Kg1": "King's almost last try.",
        "39... Kg3": "Mate in 1.",
        "40. Kh1": "Nowhere else to go... There was also a resign button, you know?",
        "40... Rf1#": "Mate.\r\n\r\nThe moral? If you're going to bring out all you can to mate your enemy, make sure you DO mate the enemy and you don't leave holes in ur position in the meantime, coz if you don't mate the enemy, he'll turn the game on you faster than you'll be able to castle."
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-meer81?gm=41893",
    "gameName": "Challenge from meer81",
    "players": "zman87 (1215) vs. meer81 (1582)",
    "opening": "Centre game (C22)"
}