{
    "moves": {
        "1. e4 e6 2. e5": "Steinitz attack..I play this to gain some space ",
        "2... g6": "g6 with the intention the fianchetto the bishop and attack my advanced pawn",
        "3. d4": "d4 to protect the pawn after the intended bg7 and further gain space.",
        "3... Bg7 4. Nf3": "bg7 came anyway even though the diagonal is blunted by the pawns and i just developed my knight ",
        "4... Ne7": "Ed developed his knight as well with thoughts of coming to either d5 or f5 in the future ",
        "5. Bd3": "bishop d3 to develop and put a bishop on a good diagonal ....I anticipated kingside castling since his queenside pieces are undeveloped.",
        "5... O-O": "Surely enough he castled kingside.perhaps a move like d6 or nc6 (to potentially castle queenside after getting the light square bishop out somehow )although perhaps a bit slow..",
        "6. Ng5": "ng5 ...i was already had thoughts about sacking it here...I noticed the king might be vulnerable to attack especially if the H file opens ...I thought it was important to get rid of the h7 pawn",
        "6... f6": "f6 to try to chase knight away.",
        "7. exf6 Bxf6 8. Nxh7": "After the exchanges I go for it and make my unsound sack with hopes of a bright game.",
        "8... Kxh7 9. h4": "I push h4 immediately to try to open the h file as soon as possible for my rook and possibly form a battery with my queen...the 2 bishops already support my attack so I dont need to move them anywhere ",
        "9... Kg7": "Ed moves his king off the file.",
        "10. h5": "h5 to open the file up hopefully..",
        "10... Rh8": "rh8 so I cannot take on g6 as that would loose rook and queen..",
        "11. Qg4": "Qg4 where i was hoping to put pressure on g6 and also have my queen on the g file where i thought it might be usefull..",
        "11... Qe8": "Qe8 to strengthen the g6....",
        "12. Nd2": "After long thinking I knew I needed to bring move pieces to the attack....I already intended to bring the the knight to either e4 or f3 ...it temporary blunts my dark square bishop but if nc3 then d5 and i could no longer maneuver it to a good square quickly.",
        "12... d6": "d6 getting ready to push e5 with an attack on my queen...",
        "13. h6+": "h6+ and i was hoping that the pawn would either turn into a dangerous passed pawn or at least create a pivit square on g7 at some point for my pieces..it also cuts off squares for the king to run to..",
        "13... Rxh6": "ed takes the pawn offering a rook exchange which i decided to take because if say rg1 then rh4 threatning my queen with tempo and also the d4 pawn at least...I had to be fast with my attack",
        "14. Rxh6 Kxh6 15. Ne4+": "ne4+ with a discovered attack....finally my 2 bishops come into the attack and all the piece except the rook are participating in the attack",
        "15... Kg7": "Kg7 moving the king to safety and off the seemingly dangerous h file.however I win a pawn back with the following tactic.",
        "16. Nxf6 Kxf6 17. Bg5+ Kg7 18. Bxe7 Qxe7": "now the knight is no longer protecting g6 and i can take it.",
        "19. Qxg6+ Kf8 20. O-O-O": "I castle because I realize that I need to bring my last arch piece to action as soon as possible...I plan to swing my rook on h1 as fast as ed allows me to.",
        "20... Qf7": "I anticipated that he would offer me a queen exchange and had thoughts in mind for this.",
        "21. Qh6+ Qg7": "Ed offers a queen exchange again but after queen h4 he cant offer me any more exchanges...",
        "22. Qh4 Nc6": "Ed develops his knight and immediately I can bring my rook on h1...I am not worried much about the d4 pawn any more as trying to protect it would loose tempo and I cannot afford this.",
        "23. Rh1 Ne7": "instead of taking the pawn he plays ne7 in an attempt to bring another piece to defend the kingside.",
        "24. Qf4+": "Qf4 check..if king d8 rh7 looks very dangerous ",
        "24... Qf7 25. Rh8+ Ng8": "ed blocks my rook check with the knight which pins it to the king.this was almost certainly a mistake that allowed me to take advantage.",
        "26. Qh4": "queen h4 threatning things like bishop h7 and queen d8 ..ed doesnt deal with the threats at hand and plays e5 to open the bishop diagonal ",
        "26... e5": "I was considering bishop h7 at first which wins a knight but then i came up with a crushing move.",
        "27. Qd8+": "If queen e8 to block the check rxn , best move is to take the rook back from my calculations and then queen takes queen.",
        "27... Kg7": "instead kg7 which leads to a mate in 1.",
        "28. Rh7#": ""
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-ngghjo?gm=34258",
    "gameName": "Challenge from ngghjo",
    "players": "ngghjo (1200) vs. edwardtarte (1363)",
    "opening": "French (C00), Steinitz attack"
}