{
    "moves": {
        "1. d4": "I'm relatively new to GameKnot (love it!), and am playing what I know best.  The Stonewall Attack.",
        "1... e6 2. e3": "White strives to set up a pawn formation at c3, d4, e3 and f4.  He is glad that Black has chosen to close off the c8 Bishop from the c8-h3 diagonal.",
        "2... b6": "Black immediately seeks to solve the problem of the \"problem Bishop.\"",
        "3. Bd3": "White develops the Bishop to its usual post in the Stonewall.  He realizes that the probable B-b7 would thwart his usual plan of playing f4 before developing the g8 Knight.  ",
        "3... Bb7 4. Nf3": "So White accepts the fact that Black is developing slowly, and feels he can take an extra move in getting the Knight to e5 and f2-f4.",
        "4... Nf6 5. O-O": "Safe and sound.  White has embraced good opening principles:  rapid development, control of the center, and King safety.  Black is behind in all three categories.  ",
        "5... c5": "This peripheral pawn thrust usually comes after d7-d5, and gives thought to the (weak) c5-c4, attacking the Bishop.  ",
        "6. c3": "This defensive move is in keeping with the Stonewall objectives, and provides a retreat square for the Bishop.  If Black plays PxP, White will retake with the e pawn, thus opening the diagonal for the c1 Bishop.",
        "6... d5": "Black's sequence is incorrect, and this move is bad because it blocks the Bishop on b7.  It makes White's game much easier.",
        "7. Nbd2": "White takes time to double defend e4.",
        "7... Bd6": "Black wakes up to the fact that he needs to develop and get castled.",
        "8. Ne5": "I didn't want to see BxN, doubling my pawns, but it would have forced Black to delay completing his development even further, so it was a calculated risk.",
        "8... Nc6 9. f4": "Now White breathes a sign of relief.  He has achieved his desired set-up.  It feels great to be in a position where you feel at home at.  That's what I like about the Stonewall.  With a lot of openings, the opponent dictates too much of the action.  (Which is why I play the Scandinavian....to achieve positions that I'm comfortable in.)",
        "9... cxd4": "Black relieves the central pressure, to his own disadvantage.",
        "10. exd4": "Opens the c1 h6 diagonal.",
        "10... h6": "Black should castle!  Pawn moves in front of the King weaken the position.  Now, White has a targets.  ",
        "11. Ndf3": "White would like to keep a Knight at e5.",
        "11... a5": "This was an irrelevant move that weakened the Q side pawn.  ",
        "12. Bb5": "You see what happens when you don't castle?  The Knight is pinned to the uncastled King, and White is threatening NxN, ... Bx9, BxB check and the gain of the exchange (Rook for Bishop).",
        "12... Ne4": "I'm not sure what Black was thinking.  The only moves were Rc8 or Qc8 or Q c7.",
        "13. Nxc6": "Takes the pinned Knight with a brutal threat.  The loss of the piece and exchange are now forced.  Unless Black errs.",
        "13... Qd7": "Black errs.",
        "14. Na7": "and Black resigned."
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-uraniun?gm=24676",
    "gameName": "Challenge from uraniun",
    "players": "halfairchild (1621) vs. uraniun (1441)",
    "opening": "Queen's pawn (A40)"
}