{
    "moves": {
        "1. d4 Nf6 2. e3 g6": "Jsprung prepares his pawn structure right away so I Castle fast to attack the Center",
        "3. h3 Bg7 4. Bd3 d5": "Nature Says Bishop on d3 must play d5 to not transpose this with e4 to a Kingside attack(30 moves later)",
        "5. c4 Nbd7": "Now on cxd5 Cxd5 e4, the g7 Bishop will have something to do!",
        "6. c5": "This game is Pawn against developement, closing the position was not bad move I have to prove theory is right",
        "6... e5": "Is the natural move his King have 2 moves andopen the way for both Bishops",
        "7. Nc3 O-O 8. b4": "I would play dxe5, if not Cge2 For now there is nothing bad aparently on not developing because I am stuck on C8.",
        "8... exd4 9. exd4 Re8+ 10. Nge2 a5": "Here I was looking for space so the logical would have been b5, any ways he´s move had no sense",
        "11. Ba3 axb4": "I doubt it very much this way white activates his bishop but white neede to much moves to advance and my rook had it purpose, compare rooks now.",
        "12. Bxb4 Nf8": "Its precise to finish developing bishop and from this positio I can attack the d4 square and the c5 spot",
        "13. O-O c6": "Treatens b5 and loosing my weak spot!",
        "14. a4 Ne4": "I here doubt the strengh of the move but the alternative f3 made an intresting spot on e3",
        "15. Nxe4": "The logical Choice",
        "15... dxe4 16. Bc4 Be6 17. Bxe6": "Better would be Qb3",
        "17... Nxe6 18. Bc3": "I dont see alternative",
        "18... Qd7 19. Qd2": "How about Qb3 Nxd4? Bxd4! Bxd4 Rad1",
        "19... Red8 20. Rfd1 Nxc5": "This is Excelent, Obvious ths is what Jsprun did not see, the game was intended for this from 12...Nf8!, White safes the Rook with Qc2,Nd3,f3 and takes the initiative for the pawn!",
        "21. dxc5 Qxd2 22. Rxd2 Rxd2 23. Bxd2 Bxa1": "Here is a clear advantage and enough to win!!\r\nI comented on this Jusprung because I was not sure till dxc5 what would had been the outcome of the game, well played till that move."
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-jsupreme?gm=16247",
    "gameName": "Challenge from jsupreme",
    "players": "jsupreme (1523) vs. germu (1714)",
    "opening": "Queen's pawn game (A45)"
}