{
    "moves": {
        "1. e4": "This is the second game I played against humour.  In the first game, as white, I squandered an excellent position, accidentally got caught in a fork, and still would have salvaged a draw if I'd been just a tad more precise with my king.  Anyway, I wanted revenge!  So here's the second game.\n\nGood, e4.  I'm most familiar with these systems.",
        "1... d5": "I usually play the Sicilian or the King's Pawn game as a response to e4, but I figured my opponent is likely very familiar with those.  So I decided to play the center-counter (Scandinavian) defense as a kind of psychological juke, to get him out of a comfort zone.",
        "2. e5": "?! Definitely not what I expected-- White's usual response is 2. exd5, which Black replies with either Qxd5 or Nf6 (the Marshall Gambit, which I prefer).  Maybe Black was also trying for a psychological ploy?",
        "2... c5": "A good follow-up to d5, fighting for the center.",
        "3. d4 Nc6 4. Bb5 Bf5": "My plan was to follow up Bf5 with e3, which creates a French Defense-esque setup, with the important difference of having the light-squared bishop outside the pawn chain.  As White, I <i>hate</i> playing against the French, and I would never consciously choose to play it as Black, but the position of the bishop definitely has potential...",
        "5. Ne2": "?! White's line of thought is pretty easy to follow here, I'm sure he intended to follow up with Ng3, attacking the bishop, which I can simply retreat to g6.  Nf3 would probably have been better in the long run.",
        "5... e6 6. Nbc3": "Continued development.",
        "6... c4": "It was at this point that my strategy for this game clicked into place.  I would use the pawn chain on the light squares, coupled with my light-squared bishop, to control the middle of the board, and eventually either force open files, or perhaps create a passed pawn on the queenside.  (As a bonus, I've trapped and forced the eventual exchange of White's own light-squared bishop!)",
        "7. Ng3": "As expected.",
        "7... Bg6": "I'll need this guy later.",
        "8. a3": "? I don't know if this is to prepare b4, or to prevent Nb4... I can't do Nb4 anyway because of the pin.  ",
        "8... Qc7": "I would rather not have doubled pawns on the c-file.",
        "9. O-O a6": "Forcing the exchange.",
        "10. Bxc6+ Qxc6 11. Bg5": "?! Not sure what White was aiming at ... maybe hoping for f6?",
        "11... Be7": "While I do have the bishop-pair, that doesn't seem to be as big an advantage in this game as it might be in a more open game.  Plus, my dark-squared bishop is the \"bad bishop\" here, while White's DSB is his \"good bishop\", so I think an exchange would be good.  One problem... if White declines (with Bd2 or Be3, perhaps), my undeveloped knight would have no decent prospects, which could turn into a weakness...",
        "12. Bxe7": "?  Lucky for me, White wants simplification, and I happily oblige.",
        "12... Nxe7": "Nf5 could get rid of that pesky knight.",
        "13. Qd2 Nf5 14. Nce2 Rc8": "I had an idea that this file might be opened very soon, though in hindsight, I'm not exactly sure how.  More to the point would have been Rb8, or perhaps b5.",
        "15. c3": "Not likely that the file will be opened now.",
        "15... Qb6": "?!  I think my main idea behind this move was to stop b3 and put pressure on d4.  But... b3 becomes possible again after Rab1, and d4 is not currently weak.  And now the advance of my b-pawn is blocked.",
        "16. Nf4": "?  White, however, misses the point, and lunges for the bishop.",
        "16... Nxg3": "!  White must recapture if he wants to stay even in material (17. Nxg6 Nxf8!, winning either a rook or the queen!)",
        "17. fxg3": "? White was justifiably reluctant to open up the back door to an attack on his king, but fxg6 has problems too.  White's d-pawn is now pinned, and he now has no chance of putting any pressure whatsoever on the e-file.",
        "17... Be4": "White's pawn capture allowed this bishop move.  He's going to have a hell of a time dislodging it without giving up material.",
        "18. Nh5 Rg8": "... g6 would have weakened the dark squares, and I don't want White's queen nosing around there.  Given my defense on the queenside, not being able to castle doesn't bother me terribly.",
        "19. Qf2": "Aiming at f7.  ",
        "19... Rc7": "But the threat is easily met.",
        "20. g4": "Controlling f5, but I sense the ulterior motive is to get the knight back to g3 to harass my bishop.",
        "20... Qa5": "Gotta clear out for the b-pawn.  b4 doesn't worry me, as I can simply play ... cxb4 e.p.",
        "21. Ng3": "This harassment doesn't have much of a point...",
        "21... Bd3": "... when I have useful squares to move to.",
        "22. Rfe1": "I don't know if White should have considered an exchange sacrifice at this point to get rid of the bishop... in any case, Rfd1 might have been better.",
        "22... b5": "One of these files WILL open up.",
        "23. Ne2": "Aiming at f4?  Perhaps inviting exchange?  (yeah, right!).  I'm tired of having my bishop harassed, so...",
        "23... g5": "!?  I really liked this move at the time, and I don't think White saw it coming.  Yes, it does weaken my kingside, but it also prevents Nf4 and restricts the knight's movement for the time being.  In hindsight, White's knight could eventually maneuver around to f6, which would be quite problematic.",
        "24. Nc1": "?  But ONCE AGAIN, he lunges for the carrot-on-a-stick... I mean bishop.",
        "24... Be4 25. Re2": "Bolstering the guard along the second rank, but depriving White's knight of a useful square.  f1 was probably better, as was e3.",
        "25... Qb6": "A much better spot for the queen, should help control whatever files are opened.",
        "26. Qf6": "Damn, that f6 square is weak!  Lucky for me, White can't do much with it, since the rook is misplaced, and the knight is essentially confined to the back rank.",
        "26... a5": "The Jaws of Life start to get to work on the a and b-files...",
        "27. Qh6": "A move that would be much more useful if the rook was on e3 (... Rh3 Rh8 Qxg5 and a fine game for White.)",
        "27... Ra7": "I'm almost certain it's going to be the a-file.",
        "28. Qh3": "And what now for her majesty?",
        "28... b4": "Ah, I get it, defending the c-pawn.  Still, kinda clumsy.  In any case, file opening is inevitable.",
        "29. axb4": "It IS the a-file!  Yay!  I can now force the exchange of rooks, and take control of the open file with the queen!",
        "29... axb4 30. Rxa7 Qxa7 31. Qe3": "?  Not wanting isolated, doubled pawns (after cxb4) is understandable.  But is the alternative really better?",
        "31... b3": "\"And if you don't looove me nowww, you will neverr love me again, I can STIILLL hear you say-ing, you would NEVER break the chain...\"  Whoops, sorry.  But that was the first thing I thought of.",
        "32. h3 Qa1": "Pinning the knight.",
        "33. Rf2 Bc2": "!  And now, there's nothing White can do to prevent the loss of the b-pawn.",
        "34. Kh2": "Stepping out of the pin.",
        "34... Qxb2": "Not only do I win the b-pawn, I create a passed pawn a mere two ranks from queening!\n",
        "35. Qf3": "Again aiming at f7.",
        "35... Rf8": "I felt this was better than Rg7.",
        "36. Qe3 h6": "Guarding the g5 pawn while keeping the rook on f8.",
        "37. Qe1 Qa1": "?!  In hindsight, Qb1 was probably more accurate.  My questionable move allows White to do this...",
        "38. Rxc2": "?! White finally gives up the exchange, but he does make gains... the passed pawn is now blocked from queening (which would not have been the case if I'd played Qb1), and the Black queen is now effectively sealed off in the corner of the board, while White's queen has a fair range of motion.  My main concern is that White will sacrifice the knight to score a check, and-- if I'm not careful-- gobble my entire pawn chain.",
        "38... bxc2 39. Qd2 Qb2 40. Kg3": "?  Not sure of the point of this move.",
        "40... f6": "I wanted to add a defender to g5.",
        "41. h4": "If I don't capture, White will probably play 42. exf6 Rxf6 43. hxg5 hxg5 44. Qxg5, with good prospects for checking...",
        "41... gxh4+": "... but thanks to White's earlier king move, I can capture with gain of time!",
        "42. Kxh4 fxe5": "With White having to waste a move with his king, I can capture and open the file.",
        "43. dxe5": "?? The nail in the coffin.  Qxh6 was far better.",
        "43... Rf1": "!  Now Qxh6 is worthless.",
        "44. Qxh6": "But he plays it anyway, and promptly resigns.  Sweet revenge is mine!  I hope you all enjoyed the game... thanks to humour for agreeing to \"humour\" me (*groan*, I know) with a second game!"
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-wakefire?gm=19316",
    "gameName": "Challenge from wakefire",
    "players": "humour (1478) vs. wakefire (1532)",
    "opening": "Scandinavian (centre counter) defence (B01)"
}