{
    "moves": {
        "1. e4 e5 2. Nf3 Nf6": "Et dårlig trekk siden du har førstetrekk fremover. Jeg tror dette setter et press på deg for å beskytte e4-bonden, samtidig som jeg ikke ser resultatet av dette trekket og videre dårlig trekk ved at jeg ikke får castlet.\r\n\r\nBedre ville trekket som jeg tok neste gang 2...d6 eller 2...Sc6 (tror trekket 2...De7 ville stengt for Løper og dermed vært et dårlig trekk, men ikke dårligere enn 2...Sf6",
        "3. Nxe5 d6": "Nok et dårlig trekk. 3...Le6 eller 3...De7 hadde vært bedre.",
        "4. Nxf7 Kxf7": "Her må jeg som sagt gi opp castling, samtidig som jeg også ikke får utviklet løper pågrunn av det dårlige trekket 3...d6",
        "5. d4 d5": "Her er jeg allerede innestengt og prøver å åpne opp e-raden. Bedre hadde nok 5...c6 eller 5...Sc6 vært?",
        "6. e5 Ne4": "Jeg blir presset av bonden på e5. Velger å plassere meg sentralt, med dekning av bonde på d5.",
        "7. Qf3+ Ke8": "Dette presser meg til å bruke et trekk ved å flytte kongen tilbake til opprinnelig posisjon. Og dermed bruker jeg opp tid til utvikling.",
        "8. Bd3 Nc6 9. c3 Qe7 10. Bxe4 dxe4 11. Qxe4 Qe6 12. O-O Be7 13. Re1 Nd8": "Her ser jeg en pin så flytter vekk for å unngå. 13.Sa5 et bedre trekk?",
        "14. d5 Qf5 15. Nd2 Nf7 16. Nf3 g5 17. e6 Nd6 18. Qd4 c5": "Bedre ville nok 18.Lf6?",
        "19. Qxh8+": "Løper hadde da sperret at tårnet ble tatt.",
        "19... Qf8 20. Qxh7": "Og der en bonde.",
        "20... g4": "Her føler jeg at det blir innesperret så prøver å sette press på Springer. Ser ikke at neste trekk gir sjakk.",
        "21. Qh5+ Kd8 22. Qxg4 b5 23. Bg5 Bb7": "Burde nok heller konsentrert meg om andre ting? selv om Løper er låst på c8.",
        "24. Bxe7+ Qxe7": "Her burde nok Kongen heller tatt Løper for å skape enn sammenheng mellom Dronning og Løper som kunne presset din Dronning",
        "25. Rad1 Kc7": "Jeg må da bruke dette trekket for å få Tårnet i spill, samtidig som jeg åpner opp for en mulig pin på d6.",
        "26. h4 Rh8": "Her så jeg rett og slett ikke Springer som har kontroll på bonden på h-fila. Jeg tenker mest angrep istedet for å prøve å komme meg ut av det. Posisjonen er vel allerede her så kjørt at jeg er dømt til å tape?",
        "27. Re5 Bxd5": "Ofring av løper som uansett er låst, som egentlig bare gjør alt værre.",
        "28. Rdxd5 Qe8": "Først her skapes kontakten som kunne vært skapt 4 trekk før.",
        "29. Rdxc5+ Kb6 30. Qd4": "Og her kommer nådestøtet.",
        "30... Qd8 31. Rcxb5+ Kc7 32. Qc5#": "Altfor fort ved at jeg blir altfor offensivt. Prøver på for mye og bruker ikke nok tid på å analysere hvordan brettet er. Altfor lette nybegynnerfeil. Hva synes du?"
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-fretless?gm=27432",
    "gameName": "Challenge from fretless",
    "players": "fretless (1804) vs. kenttm (1249)",
    "opening": "Petrov (C42), Cochrane gambit"
}