{
    "moves": {
        "1. e4": "Typical move for a reason. This move controls the centre and gets the queen and bishop ready for action.",
        "1... a5": "I don't see how this helps with development. Does anyone know?",
        "2. d4 h5": "Again, not a developing move.",
        "3. Nf3": "I have heard that it is a bad idea to do Nc3 after d4. Why?",
        "3... Na6": "Knights are almost always best when pointing towards the centre.",
        "4. Bc4": "I decide to target the f-pawn.",
        "4... Nh6": "At this point, one would say that white is much more able to launch an attack, though white would be unwise to attack without much support.",
        "5. O-O": "I castle, putting my king into a safer position (which is generally the aim of castling).",
        "5... g6 6. Bg5": "Is this OK, or is Bf4 better?",
        "6... b5": "? Free pawn.",
        "7. Bxb5 Rb8": "Skewering my bishop to b2.",
        "8. Nc3": "Is this the best move?",
        "8... f6": "As I feared after pressing 'Submit' on move 6.",
        "9. Bxh6": "Aiming for liquidation, but is this a bad move, because it trades a bishop for a badly placed knight and allows the DSB a more active role in the game?",
        "9... Rxh6": "Better would be Bxh6.",
        "10. e5": "Trying to give my knight on f3 attacking space.",
        "10... Bg7 11. e6": "Is this OK? dxe6 is illegal, as d7 is pinned.",
        "11... c6 12. exd7+": "Check. My bishop still has time to move.",
        "12... Qxd7 13. Bc4": "Bxa6 is probably better, due to Rxb2.",
        "13... h4": "Why this move?",
        "14. h3": "? I had an irrational fear of a pawn storm, which is why I did this.",
        "14... Rh5": "?? Loses a knight, as you will see.",
        "15. Qd3": "Black resigned here, facing either Bxa6 (winning the knight) or Qxg6+ (forking the king and rook). Feel free to comment and offer constructive criticism, and I hope that you learned something! 😄"
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-reubencpiplupyay?gm=57730",
    "gameName": "Challenge from reubencpiplupyay",
    "players": "reubencpiplupyay (1205) vs. purplepony (1339)",
    "opening": "Corn stalk defence (B00)"
}