{
    "moves": {
        "1. d4 Nf6 2. c4 e6": "White's queen pawn opening was met with black Kingside knight. With a potentially varied opening leading to many lines I enjoy to play. ",
        "3. Nf3": "I decided to encourage the opening away from my favoured Nimzo-indian defence so I could explore a lesser played line, the Bogo-Indian defense.",
        "3... b6": "With pawn to Queen's Knight 3 it seems Black had other plans and I settled into a relatively straight forward Queen's Indian.",
        "4. a3": "Liking the more active queen-side play in opening I decided to take the game into the Petrosian System. This avoids many problem early on with black pinning the queen-side knight. ",
        "4... Ba6": "I had a little suprise from black - having expected the completion of the fianchetto on the queen-side I took some time to explore this position. ",
        "5. Qc2": "With only three columns describing Ba6 in Batsford's I concluded that the best move was to use my queen early to cover black's early queen-side attack.",
        "5... c5": "Black's c5 was a direct challenge, seeking to break up white's developing central superiority of the centre.",
        "6. d5": "I carefully checked ahead playing out the next few moves. The exchange looked to be a little more dangerous to me so I decided to see if black would miss a trick.",
        "6... exd5": "As expected black went for the exchange.",
        "7. cxd5": "White responded, now would black attempt to steal the pawn?",
        "7... Be7": "No, black was clearly aware of the danger of Qa4  which would have won black's knight. I now had to support my advanced pawn, the main reason for taking this line was to create an advanced pawn to hamper black's play.",
        "8. Nc3": "Pawn is now covered...",
        "8... O-O": "Black completes king-side development and white is poised to launch an attack. This position offers a great deal of possibilities with the support of the queen and Queen-side bishop along two diagonals the knights could attack black's king.",
        "9. e4": "I decided to build my attack at the expense of castling early, staking out the centre and supporting my advanced pawn I play e4, revealing the attack on black's queen-side bishop.",
        "9... d6": "Did black miss the revealed attack? Either way d6 stop's my pawn advancing to cause more problems. ",
        "10. Bxa6": "I have to exchange bishops the advantage of taking out such well placed piece and side-lining black's q-side knight can't be missed.",
        "10... Nxa6": "Black recapture's.",
        "11. Ne2": "I now saw a great opportunity to sow some confusion in my opponent. At this point my rooks are not available to lend support to my central pawns and I need my knights in such a position that I can cover my rooks.",
        "11... Qd7": "Black completes development with the queen moving down to link the rooks. Not a bad move but with my central pawn's on white squares I feel black's development advantage was at the cost of being able to defend against those two central pawns.",
        "12. Ng3": "Black now has three pieces pointing to my king-side. Time to mount my own defence but also line my knights up to cover my rooks in a few moves time.",
        "12... Rac8": "So far black has played well but not shown much aggresion. Here again black plays a much more defensive move and I can't help but think that Qb5 would have made for a much more active game on black's part.",
        "13. Be3": "Nearing the end of white's development I decide to place my queen-side bishop behind my advance pawn's in a safe position where it can still lend support to a king-side attack.",
        "13... Nc7": "Black begins a series of moves trying to locate his knights to defend his king. Still Qb5 might have been better?",
        "14. O-O": "Looking back I feel this was a solid start to the game. Black had been hampered by the two advanced pawns and white, having completed it's development is poised to take advantage.",
        "14... Rfd8": "I think black would have been better placing the rook on the e-file ready to attack my backward pawn, covered by two knights and the queen it would be in a great position.",
        "15. Ne1": "Now it's time to move my knights into position to support my attack up the centre/king-side.",
        "15... Nce8": "Black links his knight's a strong move, but I don't like thier position much! Again black is not attacking enough and I can't help but think that if black does nothing to get his pieces into more active positions that the game is going to be short. Ng4 would have given black some space here!",
        "16. f3": "With Ng4 a possible threat to my king-side attack I decide to close the door. f3 should seal it, and I can now take my time.",
        "16... Qc7": "With this move I feel black is still entertaining the thought of pushing up his c-pawn under the support of just his rook and queen. I'd be looking to mobilise the knights, get them down the board, getting one of e5 would really help!",
        "17. Rc1": "On the off-chance black decides to push his c-pawn I'd better have something covering my queen.",
        "17... Nd7": "Ah, the knights are finally moving, perhaps black has spotted that he could get a knight on e5?",
        "18. Nf5": "Well he's left the bishop en-prise.",
        "18... Nf8": "Ouch, that does not look good! Bf6 would have been much better.",
        "19. Nd3": "Seeing both of black's knight in such awkward positions I take a good look at the board and conclude I could mount an offensive to the queen-side and still keep black bottled-up. ",
        "19... Ng6": "This is OK, black really needs to find space!",
        "20. Qe2": "Got my queen poised to attack the corner...",
        "20... Nf6": "I'm really thought black would spot the danger here and move his queen to d7. With the rook attacking the queen b4 is open for my knight!!!",
        "21. Nb4": "Bang, and I now have access to c6, slamming a knight right into the middle of black's defence.",
        "21... Ne5": "Black finally reaches the centre with a knight but by now I've got most moves covered.",
        "22. Qa6": "Black hasn't moved his queen so I can keep my knight on b4 and play my queen into the corner, seeking to attack the rooks and lend support to my knights and bishop.",
        "22... Rcb8": "What was that? Is black aware of my knight on b4? I've now got a three-way fork lined up... Counter attacks for black are fast running out.",
        "23. f4": "The one last defender is forced out.",
        "23... Neg4": "Black counter's but I'm already poised to take equivalent material.",
        "24. Nc6": "In comes the knight to c6, but has black noted the position of my other knight?",
        "24... Nxe3": "There goes my bishop...",
        "25. Nfxe7+": "And there goes your's, check!",
        "25... Kh8": "It's getting pretty horrible for black now the only consolation is that black has finally broken though to the other side of the board.",
        "26. Rfe1": "With my knights locked in place I need to cover my e-pawn and kick that knight back into it's own half.",
        "26... Neg4": "Back it goes... ",
        "27. Nf5": "Wouldn't it be nice to get those pawns in the centre a little more advanced? Nf5 makes a little room and gives me access to g6...",
        "27... Qc8": "Black fails to kick my knight out and looks to diffuse my attack. Do I exchange...",
        "28. Qd3": "No, I want to force my pawn right up the centre.",
        "28... Re8": "Black attacks my backward pawn on e realising the threat of having three pawns attacking up the centre of the board, but takes cover off the only pawn stopping me from doing it...",
        "29. Nxd6": "Bang goes the pawn and I've a Q-R fork as a bonus!",
        "29... Qd7": "My knight is attacked and black must be thinking it's about time white took his rooks...",
        "30. e5": "No, marching pawns are a far greater threat...",
        "30... Ng8": "Black saves his knight placing it on the better of the two available squares.",
        "31. b4": "Why b5? Well I want to open up the c-file to give my rooks a clear line to the 8th.",
        "31... cxb4": "Bait taken and my rook now supports the knight on c6 and I can move the d-pawn up...",
        "32. axb4": "Might as well recapture, who knows a pawn on b5 would be good.",
        "32... Ne7": "Ah is black finally getting aggressive?",
        "33. Nxb8": "Time to take out a rook and open up the line for my rook on the c-file.",
        "33... Rxb8": "Black no doubt took some small consolation in relieving me of one of my knights here.",
        "34. Nxf7+": "A little cheeky, but I really wanted to open up the centre to get those pawns marching. Grabbing the pawn and check was a bonus.",
        "34... Kg8": "Black's only move, where shall I put my knight, g5 looks good.",
        "35. d6": "Better still, attack black's knight, and no I wasn't planning loosing my queen here... Kxf6 would be followed by a right royal pawn-fork e6!!!",
        "35... Ng6": "Black moves his knight, which wasn't really in danger.",
        "36. Ng5": "And now my knight comes down to g5 ready to allow my pawns to advance.",
        "36... a5": "Is this a last act of desperation? Black's king is now under threat as can be seen in the next move. Pawn's poised to reach the 8th, rooks and queen in support and a Knight waiting to the side covering f7.",
        "37. Rc7": "Rook on the 7th, Queen attacked, it's only a matter of formality now.",
        "37... Qd8": "Qe8 would have helped by keeping cover on f7, the one place next to the black-king I can force mate. Black so deperately needs to cover this square.",
        "38. Qc4+": "And here is why!",
        "38... Kh8": "Knight fork to win the queen for nothing and remove the last hope of any kind of defence for the king.",
        "39. Nf7+": "Ouch.",
        "39... Kg8": "Here it comes...",
        "40. Nxd8+": "Wallop. The king has to move back to h8 as f8 is mate with the queen.",
        "40... Kh8": "But mate is imminent. I just need to get the queen up there safely.",
        "41. Nf7+": "There's a really nicce mate here involving a queen sacrifice, though given the amount of material taken so far I'd hardly call it that. The rook then comes in and the Knight, the star of the game gets to make the checkmate.\r\n42. ... Kg8 43. Nh6   (Kf8 is mate Qf6#) kh8 44. Qg8  Rxg8 45. Nf7#"
    },
    "url": "https://gameknot.com/annotation.pl/challenge-2?gm=16777",
    "gameName": "Challenge 2",
    "players": "tinkofsharn (1936) vs. sf115 (1613)",
    "opening": "Queen's Indian (E12), Petrosian system"
}