{
    "moves": {
        "1. Nc3 h6": "It's allright for Joe to play this, as we saw in that lecture.  But, it will cause damage if the opponent doesn't develop.  In fact, TA as a moral to his Q sac said something that if they played foolish (which he means) undeveloping moves like him, there will be consequences.",
        "2. Nb1 a6": "This also doesn't develop either which I would've done as black.",
        "3. Nf3 d6": "But, this is where he starts developing since this is a center pawn which opens up a line for his Bc8.",
        "4. Ng1 c6": "I have no idea why black played this, though.",
        "5. Nc3 Nf6": "Now, we see some action as black is bringing a piece into play.",
        "6. Nb1 g5": "Fianchettoing his B as it will be on the longest flank for his next move.  As black, though, I would've played 6...g6 but for the same reason.  So, I don't see anything wrong with this move.",
        "7. Nf3 Bg7 8. Ng1 Nbd7": "?! Developing his other N.  But, this leaves black with a cramped position, as now, he'll be forced to waist time in order to develop his Bc8.  As black, I would've developed that first, and then, played this.",
        "9. Na3 b5 10. Nb1 Bb7 11. d3": "And, with that tempo loss, this is where Joe starts his development as it's a center pawn needed for central control.",
        "11... c5": "I'm not sure why black played this.",
        "12. e3": "But, Joe open a line for his other Bishop.",
        "12... Qc7": "Preparing to castle long, which he will on his next move.  But, as black, I would've castled short, at once.",
        "13. Nf3": "Developing his N but leaving it there, at once.",
        "13... O-O-O 14. Be2": "Continuing with his development.",
        "14... d5": "I guess, black wants to exchange center pawns.",
        "15. a4": "But, Joe will have none of that.  For one thing, TA has mentioned that one of the ways he wins in those Q sac blitz is with the semi open files.  Where you exchange wing pawns to leave a path for the Rook.  Those are things which his opponents overlook.  So, this move is a perfect example as that's what Joe is attempting.",
        "15... b4": "This opponent, however, did not overlook as he stopped it with this move.",
        "16. c3": "Threatening to exchange, but before black allows it, he'll stop Joe's a pawn from advancing any further.",
        "16... a5 17. cxb4 cxb4 18. Nd4": "Bringing his N to a better outpost.",
        "18... e5": "Which is his opponent attacks.",
        "19. Nb5": "But, this was the real plan behind Joe playing 18.Nd4, as now, black must protect his Q.  After which, Joe will continue with his development.",
        "19... Qb6 20. Nd2 Kb8": "I'm not sure why black played this, but Joe will waste no time in bringing his Nd2 to a better outpost.  As it is right now, white's position is a little cramped since his Bc1 is locked in.  But, that will change with white's next move.",
        "21. Nb3 Nc5": "Threatening to exchange N's which Joe abides by.  With that being said, though, I think that this was an inaccuracy because black's Nd7 appears more active then Joe's Nb3.  If he declined, though, I'd see the point.  But, I'm basing the opinion combined with what Joe does on GM Susan Polgar's answer to my question in regards to exchanges.",
        "22. Nxc5 Qxc5 23. d4": "Threatening an exchange, for once he does, white will have better control of the center, despite not being castled or completely developed.  So, I think that black is already starting to become overly confident, as we saw at the intro of this annotation.",
        "23... exd4 24. exd4 Qe7 25. O-O": "As the gain enables Joe to castle.",
        "25... Ne4": "I'm not sure why black played this, but it'll enable Joe to complete his development, at once.",
        "26. Bg4 Qf6": "My guess is that black was intending to put pressure on Joe's K side.",
        "27. Be3": "But, Joe stops that with this move.",
        "27... h5": "Attacking the Bishop which is of no concern to Joe.  And, I'd feel the same were I white here.",
        "28. Bf3": "So, Joe threatens to exchange N for B.",
        "28... g4": "?! Maybe to gain time.  But, in my books this is where black starts to go wrong as Joe will be able exchange.  The idea being is that he has allowed Joe to exchange black's N for his B.  Of more significance is that black's Ne4 is much more active then white's Bf3.  So, I feel that black is setting himself up for disaster.  The Be3, however, were more active.   Therefore, I believe that much better would've been 28...Ng5  Either it's N for B, but Joe would've been forced to exchange his more active B, though.",
        "29. Bxe4 dxe4 30. Qc1": "As now, Joe's got some nasty threats against black.  One threat would start off immediately with 31.Qc7+ and after he gets out of check, then another threat could come with d5.  Or the reverse could happen where Joe plays 31.d5, and then Qc7+ etc.",
        "30... Rdc8": "So, black stops that threat with this move.  But, there's another threat that cannot be stopped, starting with 31.Bf4+",
        "31. Bf4+ Ka8 32. Nc7+ Ka7 33. d5": "As now, we're talking about a passed pawn which would, eventually, promote.  but, bigger is what comes being 34.Be3+, 34.Nb5+ which happens later, or 34.Qe3+ as is played the next move.  Either way, I think it's safe to say that black is lost with best play.",
        "33... Rhd8 34. Qe3+ Qb6 35. Nb5+ Ka6 36. Qe2": "Since a nasty discovered with 37.Nd6+ is threatened, as, at the very least, black would win a Rook for Bishop with that N fork.  And, this is why I also feel that black went wrong by allowing Joe to exchange the active Knight, for his passive Bishop, similar to what Susan also outlined.  With that being said, just like with my training game against Kenneth_fiore_3 the position has become impossible to defend.  ",
        "36... Rc5": "At least, black is going to get a pawn, but it's not enough compensation to save the position.",
        "37. Rac1": "That's because black will take, and after that white will knab the Rook.  ",
        "37... Bxd5 38. Rxc5": "After which, black resigns.  That's because it's a free Rook, for if black takes back with 38...Qxc5?? then it's mate after 39.Nc7+ with a double check.  After that, white plays 40.Qa6# which is mate.  "
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-tactical_abyss?gm=61583",
    "gameName": "Challenge from tactical_abyss",
    "players": "tactical_abyss (2460) vs. basmaniac (1732)",
    "opening": "Dunst (Sleipner, Heinrichsen) opening (A00)"
}