{
    "moves": {
        "1. d4": "This is an interesting game. My opponent plays the opening fine. I am just getting to the end of my opening database line, when he makes a mistake. The first move of the combination is not original. Although he has an equal position after 12 moves, mistakes on move 13, 14, 16 and 17 lead to a hopeless position. My opponent resigns rather than prolonging the agony. ",
        "1... d5": "So he keeps the position symmetrical, at least for now.",
        "2. c4": "The Queen's Gambit. https://en.wikipedia.org/wiki/Queen's_Gambit",
        "2... dxc4": "Queen's Gambit Accepted. https://en.wikipedia.org/wiki/Queen%27s_Gambit_Accepted",
        "3. e3": "This variation quickly regains the pawn for white.",
        "3... Nf6": "Sensible development. ",
        "4. Bxc4": "I regain the pawn.",
        "4... e6": "He blocks the diagonal for my Bishop.",
        "5. Nf3": "I prepare to castle.",
        "5... c5": "This is thematic, striking at the centre. ",
        "6. O-O": "I carry out my plan.",
        "6... Nc6": "This is again often played in this variation.",
        "7. Qe2": "According to the Gameknot World Opening database, this is the most common move in the variation. White prepares to temporarily sacrifice a pawn. ",
        "7... Be7": "He doesn't take. The pawn sacrifice line is instead 7....cxd4 8. Rd1",
        "8. Rd1": "My rook comes across anyway.",
        "8... O-O": "And he castles.",
        "9. Nc3": "My other knight eventually comes out.",
        "9... a6": "Preparing a queen-side advance.",
        "10. dxc5": "I take, discovering an attack on his queen.",
        "10... Qc7": "So he moves his queen.",
        "11. a3": "I am still following the opening database.",
        "11... Bxc5": "He regains the pawn.",
        "12. b4": "I attack the bishop.",
        "12... Bd6": "The Bishop retreats. ",
        "13. Bb2": "I finally develop my last minor piece. ",
        "13... b5": "This is a mistake. This same mistake was made in Colin, Vincent (2396) vs. Mercier, Jean Loup (2056). It seems to me that this move just drops a pawn, and although black can regain it, white has an initiative. However, Gameknot post-match analysis surprisingly doesn't give it as a mistake. Anyway, stop and find white's best move now.",
        "14. Bxb5": "Did you find it. This is as played in Colin, Vincent (2396) vs. Mercier, Jean Loup (2056), which continued with Ne5 15. Bd3 Nxd3 16. Rxd3 Bb7 17. h3 Rad8 18. Rc1\tQb8 19. e4\tNh5 20. Rdd1 Nf4 21. Qe3 Ng6 22.\tNe2\tQa8 23. Rd4 Ne5 1-0\nGameknot computer reckons Ne5 15. Rac1 Nxf3+ 16. Qxf3 Bxh2+ 17. Kh1 Bb7 18. Nd5 Bxd5 19. Rxd5 Nxd5 20. Rxc7 Bxc7 21. Bd3 Rfd8 22. Qe4 g6 is the best continuation for both sides.",
        "14... axb5": "My opponent follows a different path. I am thinking for myself now!",
        "15. Nxb5": "So I decide to regain the sacrificed material.",
        "15... Bxh2+": "With this move, black at least gets a pawn for the bishop. If he did the obvious move, which is to move his attacked queen, he is simply a pawn down.",
        "16. Nxh2": "So I recapture the bishop.",
        "16... Ba6": "This is a losing mistake. Gameknot reckons best for black is  Qe7 17. Qf3 Nd5 18. e4 Nf6 19. Rac1 Ra6 20. Bxf6 Qxf6 21. Qxf6 gxf6 22. Nc7 Rb6 23. Ng4 Kg7 with advantage to white. OK stop and find black's best move.",
        "17. Bxf6": "Did you find it? The problem for black is that 17.... Bxb5 is met with 18. Qg4! with a mating attack, as 18.....g6 is met with 19. Qg5 (threat 20. Qh6 and 21. Qg7 mate). 19....Ne7 seems black's best in order to meet 20. Qh6 with Nf5, but then g4 renews white's threats and black's position is resign-able.\nGameknot gives black's best defence as  Ne5 18. Nxc7 Bxe2 19. Bxe5 Rxa3 20. Rxa3 Bxd1 21. Bc3 g6 22. Ra2 Bb3 23. Ng4 Rd8 24. Ra7 Kf8 25. Kh2 but still with a huge advantage to white.\nMy opponent goes down another path.\n",
        "17... gxf6": "The problem with this move is that it allows a queen check, which means I can take his queen without losing my own.",
        "18. Qg4+": "I check.",
        "18... Kh8": "Forced!",
        "19. Nxc7": "His queen has been lost and his position is hopeless. He resigned. Many thanks for reading. Please leave a comment or two and rate the annotation on the star system, to let me know how I am getting on. Until next time dear reader!"
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-charleshiggie?gm=62793",
    "gameName": "Challenge from charleshiggie",
    "players": "charleshiggie (2035) vs. anandi (1667)",
    "opening": "Queen's gambit accepted (D20)"
}