{
    "moves": {
        "1. e4 e6 2. d4 c5": "I've been experimenting with this Franco-Benoni setup.  I don't always get good positions, but the games are often interesting and novel.",
        "3. Nf3 cxd4 4. Nxd4 Nc6": "Now the opening has turned into a kind of Sicilian.",
        "5. Nc3 a6 6. Be3 h6": "This move, while perhaps not the best, preserves a square for the N temporarily.  Also possible is g6, intending to fianchetto the B.  I've also tried Qc7 and don't like the positions coming from that.",
        "7. Qd2 Nf6 8. f3": "White buttresses the center and prepares to castle long.  White's intention is simple: a kingside attack.",
        "8... Be7 9. O-O-O O-O 10. g4 Nxd4 11. Bxd4 d5 12. e5 Nd7": "White, I think, has the better position here.  Black's K is not well protected and White has a headstart on the opposite side attacks.",
        "13. Kb1": "This move may have been unnecessary.  It gives Black a tempo to use to start the queenside attack.",
        "13... Bc5 14. h4 Bxd4 15. Qxd4 b5 16. f4 Qb6": "Black offers to trade Qs, with the hope that it will blunt White's attack.",
        "17. Qd2 Bb7": "Black gained another tempo when White declined to exchange Qs.",
        "18. Bg2 a5 19. h5 a4 20. Ne2": "White's retreat gives Black another tempo.",
        "20... b4 21. Nd4": "This is a good square for the N.  I think White's position is still better.",
        "21... Ba6 22. Rh3 Rfc8": "Black is trying to improve pieces as much as possible before beginning the attack.",
        "23. Nf3": "I think this was a mistake.  With the N on d4, it covered the sensitive b3 square.  Now it doesn't--and it also blocks the R from covering it.",
        "23... b3": "Black has to attack this square immediately.",
        "24. c3 bxa2+ 25. Kxa2": "Now Black has two open files to work with--and all of their pieces on the queenside.",
        "25... Bc4+ 26. Ka1 Nc5": "Threatening Nb3, forking the K and Q.",
        "27. Nd4 Nb3+": "Anyway!  This combination will be fatal for White.",
        "28. Nxb3 axb3+ 29. Kb1 Qa5": "Checkmate is inevitable with the open a file.",
        "30. Kc1 Qa1#": "I think Black was lucky to have their attack hit first, helped by the Nf3 mistake.  If White had been able to stymie Black's attack, White has the better opportunity to win.  This was my second game against Tamakun.  Both were tense, well-played games where I had to rely on counterpunching because my worthy opponent built a better position."
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-tamakun?gm=63311",
    "gameName": "Challenge from tamakun",
    "players": "tamakun (1727) vs. mmoody95 (1853)",
    "opening": "French defence (C00)"
}