{
    "moves": {
        "1. Nf3": "Annotation updated July 22, 2010.\n\nThis was a non rated game for tutoring purposes, between myself, Scott Miller (faithfulltrav) and my new friend Ajay (grey_sparrow).\n\nSo, Ajay, I want to start by letting you know a little about where I am coming from when I tutor chess, my favorite game. First I want to say, there are varying ideologies and styles of play. I for one am a fairly aggressive, very calculating player. I am a much stronger tactical player than I am strategic. For the difference, imagine a general in a war. He may say to his men \"OK, there are 10,000 of us. I want 9,000 men to lay in wait at the top of this hill. The other 1,000 of you go make like you are attacking the enemy town down below. When they come out after you, flee to the cave at the bottom of the hill. Then the 9,000 at the top attack them. That is strategy. It is an overall plan. Then the general may say, \"When you engage in hand to hand combat, use the long swords, as you can strike from a greater distance. Keep your daggers ready though.\" That is a tactic, not a strategy. Strategies give general direction, tactics are more specific.\n\nSo in our game, for example, my strategy in the middle game was to force you to trade off your DSB, then infiltrate the dark squares near your king and form a mating net around him. That's strategy, my basic game plan. Tactics are putting my bishop on g5 to chase your queen away, my knight on f6 to check your king, and when you trade my knight off, taking back with the pawn to attack your g7 square, ect. So tactics are the processes used to apply the strategy. \n\nA more strategic player may look at one of my comments and say, \"Ajay, this guys is leading you wrong.\" It's not that I'm leading you wrong, but that I can only lead based on my own style. A strategic player will lead differently than a tactical player. A passive player will give different advise from an aggressive player. That's not to say anything bad about passive chess players, as I've met passive players who I could not beat. I had a friend in college named Pablo. He'd sit back, making very passive moves. He'd set up a very solid position you can't break through and if you slip up, then all of a sudden he'd get aggressive!\n\nSo when taking advise, (from me or anyone else) take it all in from as many sources as possible, then make a rational decision for yourself, based on your own style and abilities, what is for you.",
        "1... d6 2. d4 Nf6 3. e3 g6 4. Bd3 Nc6 5. c3 Bg7 6. O-O O-O 7. Nbd2": "This opening is the Colle System, where white sets up his pawns in this pyramid shape, temporarily blocking in his DSB, while he prepares to gain a strong attack with e4. It is an unique opening in that it can be played almost regardless of black's moves.",
        "7... Re8 8. e4 e6": "So Ajay, I have not noted any of your moves up to this point because I felt all of your moves were very solid! You are playing something like the Kings Indian Defense (KID). I say \"something like\", because the knight usually goes on d7, not c6 in this defense, and a pawn needs to be pushed to e5 or c5. But the knight move I think is O.K. I personally see no real problems with the knight on c6. In the KID though, you need to push the pawn to e5 or c5, (in this case e5, because the knight blocks c5). Otherwise you may find yourself somewhat restricted. There is more than sufficient support for e5, while the pawn on e6 blocks in your Queen side bishop. Another reason you should play e5 is that I am playing the Colle system. My pawn center needs to be confronted. You later moved your knight so that you can move the c-pawn, but I will speak on that later.",
        "9. Re1": "Preparing for the push to e5.",
        "9... Na5": "Ajay, this is in my humble opinion, your 1st serious mistake.\n\nThere are principles in chess, just as in life, which if you violate, you risk serious consequences. Examples of these principles are: 1. develop your pieces as quickly as possible. 2. Avoid double pawns. 3. Don't keep your king in the center. Castle instead. 4. And many more!!!\n\nTwo such principles are: 1. Develop toward the center and 2. Avoid moving the same piece over and over again in the opening. In the initial moves of the game, focus primarily on the 4 central squares d4, d5, e4 and e5 and secondarily on the squares immediately surrounding those squares. Each piece and central pawn should either occupy or control one or more of these squares. One of the reasons for this is that when you move a knight to a5, for example, it will take the knight longer to get some where else you need him to be. He would have been beneficial to you in defending your king in this game. If he were on c3 where you had him, it would take less moves to get him to the kingside. A knight on c6 controls 7 dark squares in the area. A knight on a5 only controls 4.\n\nYou obviously moved the knight so you could play c5, and you probably planned on putting the knight back afterwards. So, if you put it back on your 12th move, that would make 3 knight moves in the 1st 12 moves of the game. That means 25% of your moves have been made by one piece (3 out of 12). That's not a good deal when you are needing to get all of the pieces in to play quickly!\n\nIf you really needed your pawn on c5 and your knight on c6, you'd have saved time by playing c4, then Nc3 which takes only 2 moves. Moving your knight to c6, then to a4, then pawn to c4, then Knight back to c6 take 4 moves. It may seem unimportant, but one of the most important principles in the opening is quick development of all pieces. Among strong players, there is a constant battle to gain even a small lead in development.\n\nThere's a term in chess called \"tempo\". That is the term to describe how far behind or ahead you are in development. A tempo is measured by 1 move. The following paragraphs, I copy and pasted from wikipedia.org.\n\n\"Gaining tempo may be achieved, for example, by developing a piece while delivering check, though here too, if the check can be countered by the development of a piece, the net result may be nil. If the check can be blocked by a useful pawn move which also drives the checking piece away, the check may even lose a tempo.\n\nIn general, making moves with gain of tempo is desirable. A player is said to have the initiative if they are able to keep making moves which force their opponent to respond in a particular way or limit their responses. The player with the initiative has greater choice of moves and can to some extent control the direction the game takes, though this advantage is only relative, and may not be worth very much (having a slight initiative when a rook down, for example, may be worthless)....\"",
        "10. Qc2 c5 11. e5 dxe5 12. dxe5 Ng4": "When considering moving a piece to a certain square, ask yourself, \"Can this piece be chased if I go here? If it is chased away, where can it go? When it goes to that 2nd spot can it be chased? If so, where can it go?\" and so on... So this knight, in moving to g4, started a frantic escape attempt which ended with him throwing himself on the sword. He was sitting on h6, being attacked and no where to go. The better option instead of 12. ... Ng4 would have been Nd7, where he attacks the e5 pawn. You could then quietly develop an attack on that pawn by Qc7 and Nc6.",
        "13. h3": "The chase begins!",
        "13... Nh6 14. Ne4 c4 15. Be2 Nf5 16. Bg5": "This is the beginning of my plan to infiltrate your king side. In order for my plan to work, I need you to trade off your DSB. Will you help me please? :-P",
        "16... Qc7 17. g4": "One last chance to save the knight. When I attack here, you could move him to e7. It's not as good as d7 would have been before though, but at least you keep the knight.",
        "17... Nh6": "So, a knight on a black square can only move to white squares, and vice-versa. So at a glance, you can see this knight only has 4 white squares he connects to. Each of these squares is either attacked by me or occupied by you. So you should have seen before moving to this square that it makes your knight an easy prey. If I chose to, I could have won the knight by playing Qc1, then BxN. This would contradict my plan though because you can trade off bishops, and I need my DSB for the infiltration of your dark squares. The plan I chose wins the knight, gets rid of your bishop and keeps my bishop on the board.",
        "18. Nf6+ Bxf6 19. exf6 Nxg4": "Also Ajay, you if you can make your opponent move one piece repeatedly, you gain the initiative. You have moved this knight 6 times: 2. Nf6, 12. Ng4, 13. Nh6, 15. Nf5, 17. Nh6, 19. Nxg4. That's nearly one third of your moves made by one piece! Read again the annotation on your 9th move.\n\nSo you've moved one knight 3 times and the other 6 times. This hinders your ability to develop your pieces.",
        "20. hxg4 e5 21. Nh4": "Every principle has some exceptions. I told you earlier about not putting your knights on the side of the board. Let me relate it to a real life situation (as I frequently do. You'll notice that's how I teach). There are governmental laws made for our benefit, some of which can save our lives if we abide by them; not driving through a red light for example. Yet, imagine if you have an injured loved one in critical condition. There is no ambulance in your town, so you have to drive them a half hour to the hospital. You come to a red light at an intersection where there are no buildings around, only open fields. So you can see far in all directions, and you know there are no cars coming. Will you stop at the light? Some people would speed through, some may slow down. I don't think anyone in their right mind would come to a complete stop and look both ways before continuing, the way the law says to do. When a person is on the border line between life and death, every second counts. So, the consequences of stopping can be far more grievous than driving through. When considering a move that violates the laws of sound chess, evaluate whether the benefits of such a move outweigh the drawbacks. If they do, go for it. Over time you will learn when it's O.K. to violate a principle. In the case of my knight on h4, I knew when I put it on f5 (sacrifice) the knight would threaten Nh6 mate, (after I get my bishop on g7). So you would have to take, thus opening more lines of attack for me. Therefore, it is worth violating the principle.",
        "21... e4 22. Kg2": "This move was to get a rook on the h-file, to enhance the attack on the king.",
        "22... Re5 23. Bh6 Be6 24. Reh1": "The plan I had at this point never materialized. I was looking the the following sequence of moves, white pieces only: Bg7, to lock the king in; Nf5 threatening mate; RxP threatening Rh8 mate. If you take the rook, the other rook comes in, Rh1+. When you move to g8, Rh8 mate! It was okay that my plan did not work, because I had a good position, a strong attack and a material lead. If one plan does not work out, so long as your making good moves, another one will materialize. As nuntar said in his comment on my annotation (Move 17), \"Ah, but it's good to be flexible and notice occasions when a plan can profitably be abandoned for a better one!\"",
        "24... Bd5 25. Bg7 e3+ 26. f3 Rg5": "I saw the threat to take the pawn with check, but I knew where I would put my king for relative safety, so I was not concerned.  I actually saw it when your rook was on e5, and I used the conditional moves system for the following scenarios: \n25.Bg7e3+\t26.f3 \nConditional Moves set 1\n26 …\tRg5\n27. Nf5\tRxg4+ \n28. Kf1\th5 \n29. Ne7+\tKh7 \n30. Rxh5#\nConditional Moves set 2\n…\tRg5\n27. Nf5\tgxf5 \n28. Rxh7\tKxh7 \n29. Rh1+\tKg6 \n30. Rh6#\nConditional Moves set 3\n26. … \tRg5 \n27. Nf5\tgxf5 \n28. Rxh7\tRxg4+ \n29. Kf1\tKxh7 \n30. Qxf5+\tKg8 \n31. Qxg4\nConditional Moves set 4\n26. … Rg5 \n27. Nf5 gxf5 \n28. Rxh7 Kxh7 \n29. Rh1+ Kg8 \n30. Rh8#. ",
        "27. Nf5": "Threatening 28. Nh6 mate!",
        "27... Rxg4+": "Postponing the mate with a check.\n",
        "28. Kf1 gxf5": "Now I wanted to play 29. RxP, threatening 30. Rh8#. You could play 29. ... KxR 30. QxP+ Rg6 to keep me from taking the rook back, 31. Qh5+ Kg8 32. Qh8 #.\n\nI felt it would not work though because, 29. RxP deserts the back rank. You'd have 29. ... Rg1+ 30. KxR (forced) Qg3+ 31. Kf1 Qf2 #.\n\nWhat I had not looked at is the following line: 29.\tRxh7\tRg1+\n30.\tKxg1 Qg3+\n31.\tKh1 Bxf3+\n32.\tBxf3 Qxf3+\n33.\tQg2 Qxg2+\n34.\tKxg2 Kxh7\n35. Rh1+ Kh8\n36. Rh8#.",
        "29. Qxf5 Be6": "While it is true I made a triple threat with QxP, If you had played Rg6 to save the rook and rook pawn, I would not have taken the bishop. If I have option to take a piece or force a mate, I'll mate, of course. Look at this one: 29. ... Rg6 30. Rxh7 Kxh7 31. Qh5+ Kg8 32. Qh8#. Also, if you had attempted a counter attack, 29. ... Rg6 30. Rxh7 Rg1+ 31. Kxg1 Qg3+ 32. Kh1 Bxf3+ 33. Bxf3. ",
        "30. Qxh7#": "One of the most important principles in the game is to see what is and is not protected. You did not see that the rook pawn was attacked by the rook and queen.\n\nAjay, It's been a pleasure!\n\nThanks and God Bless,\nScott"
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-grey_sparrow?gm=32659",
    "gameName": "Challenge from grey_sparrow",
    "players": "faithfulltrav (1746) vs. grey_sparrow (1176)",
    "opening": "Reti opening (A04)"
}