{
    "moves": {
        "1. e4": "Hey Ben\nLike my other annotation, these observations are cursory, but my honest assessment so far.  Kind\nof a good practice as it helps uproot weaknesses in my own play.  ",
        "1... e6 2. d4 d5 3. Nc3 Nf6 4. e5 Nfd7 5. h4": "Not sure of white's play (found on google a line called the \"MacCutcheon, Grigoriev Variation\", eco C12\nthat has h4), but a first definitely for me.  At this point, it became clear that White would have to castle\nqueenside, but knowing Mr.Rous' affinity for the early attack, had to be ready for anything.  ",
        "5... c5": "continuing with the point of the French Defense.  C5.  Now the center starts a sorta lopsided character,\nand a good chance for Black to equalize.  ",
        "6. Be3 Qb6": "is a standard yet aggressive move by Black.  Invites White to develop his Jumper (as they say in the \nNetherlands) to A4 and protecting it by c3- in the event Black checks with Qa5.  ",
        "7. b3": "solid defense of b2, but ruins the queenside castle structure.  ",
        "7... cxd4": "Obviously my aim is to launch an attack on e5, after shuttling my queen to c7.  ",
        "8. Bxd4 Qc7 9. f4": "f4.  Love/hate this move by White in the French.  Extremely aggressive and a great way to get retribution\nfor Blacks c5.  Am positive you considered Nb5, but most certainly f4 is much better in the long run.  ",
        "9... Bb4": "Now Black has gone further than just equalizing in the opening- an attack has ensued and exposed \nthe dangers of spending a move (5.h4) that doesn't develop a minor piece or aids castling.   ",
        "10. Qd3": "N",
        "10... Nc6": "Should have considered Nc5 as well.  If I could have had a outpost on e4 that would have been awesome!  If you took with the bishop, then I could have developed my white bishop (the problem bishop in the French) and Rook more easier.  ",
        "11. Nge2 Nxd4 12. Qxd4 Qa5": "?? a positional blunder by Black.  Gives up the c file, for what?  A possible pawn push by White to a3- \n\nBetter is Bc5, with tempo btw, and getting the White queen off the dark squares.  ",
        "13. O-O-O b6": "Further boxes in the Queen- and relies to heavily on some attack on the c file after bringing the rook \nover to c8.  Sometimes my plans take too long- good ideas but chess demands efficiency.  Better would \nhave been to protect the bishop on b4 with a5.  Then b6, Rc8, etc.  My queen now is passive and \nreduced to a defender.  ",
        "14. g4": "Kasparov is a genius with pawns- esp with kingside attacks, and your attack is well timed here.  Didn't see it coming and wasn't happy\nwith the fact that even with a nice castle I'd still have to answer to those oncoming pawns very soon. ",
        "14... Ba6": "Not sure about where and when to castle.  Very late for me, but also considered keeping my king stationed as is since castling on either side would expose it to latent weaknesses on both sides.  ",
        "15. Rh3 Rc8 16. Kb1": "good idea by white to remove any possible pin threats later in the game, but IMHO, too passive.  Better was\nto continue with the pawn attack.  Maybe you were also interested in protecting a2.  ",
        "16... Bxe2 17. Nxe2 O-O 18. f5 Qc5": "Liquidating seems to be a good idea now.  Glad that you decided to accept. Could have afforded \nboth your rooks and queen on my kingside with that pawn march.  ",
        "19. Qxc5 Bxc5 20. fxe6 fxe6 21. Bg2 Nxe5": "an oversight by White?  Giving up a central pawn is becoming a worse and worse idea the\nmore I play chess.  If anything, one on the flank would be sacrifice to save the center.  ",
        "22. Rhh1": "better was g5.  Another pawn for free?  Chomp Chomp.  Every game we've played seems to \nnever deal with a material advantage- and that you gave or sacrificed two pawns seemed highly\nsuspicious.  At this point, neither of us have enough open lines or pieces to launch a \nconvincing attack so it seemed good for me to accept.",
        "22... Nxg4 23. Bh3 h5 24. Nd4 Rf2": "In exchange for giving a pawn back, it seemed like the attack on your king would be enough \ncompensation.  Should have figured you would meticulously equalize material again anyways.  ",
        "25. Nxe6 Ba3 26. Nd4 a6 27. Rhg1 Bc5 28. Bxg4 hxg4 29. Rxg4 Bxd4 30. Rgxd4 Rcxc2 31. Ra4": "Extremely great play by White.  Thought that my rooks on the \"7th\" rank would give victory, but \nthat isn't always the case- though it usually is.  Here there is a double attack on my pawns, but \nvery risky for White to leave his King stranded like this with my Rook bombs lurking around the \ncorner.  ",
        "31... a5 32. Rxd5 Rce2 33. Rd1 Rfh2": "Now it seemed like a victory and not a draw might happen for me.  An interesting \"pin\" i have \non your d file rook.  Of course, if you leave that post the game is over.  So with my king\nhopping up the h file and an ability by my e file rook to protect b6 if necessary- all that leaves\nmy g pawn in very good shape.  ",
        "34. Rc1 Kh7 35. Rc6 Rh1+": "oh no you don't......",
        "36. Rc1 Rxc1+ 37. Kxc1 Kh6 38. a3 Kh5 39. b4": "quite frankly, this seems to be the game winning blunder.  More care should have been done to\nopen up the lines for your rook.  Maybe bringing it over to the c or d file first.  Nevertheless, time wasn't\non your side now with my king already developed and keeping your king quarantined on the first rank.\nAs you may know, but a gently reminder, developing your king is the first priority when the endgame\nensues.  Better may have been the plan:  39.Rd4- and if Rooks are eventually traded on g4 then you\nwould still have time to bring your king over and block any queening possibilities.  You probably knew\nthough if you did this, I might have abandoned that  g pawn and ran over to the b file to gobble \nup your pawns.  ",
        "39... Re4": "Nevertheless, this pin was allowed.  Gives Black total control of the game and your H pawn now becomes\na P.O.W.  \n\n",
        "40. Kc2 Kxh4 41. Kb3 g5 42. bxa5": "probably your only choice at this point.  In some deep computer analysis maybe there were some \nslight possibilities to sac your rook with 42.Rxb5?!.  Some interesting scenarios exist.  ",
        "42... Rxa4 43. Kxa4 bxa5": "A tough game for the both of us.  If we ever play live one day, I'll bring my laptop so Fritz can\nanalyze the game.  Really great to play you- know that I say that too much, but it's\nalways a pleasure.  "
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-sycilmathai?gm=14886",
    "gameName": "Challenge from sycilmathai",
    "players": "benrous (1200) vs. sycilmathai (1443)",
    "opening": "French (C11), Steinitz, Bradford attack"
}