{
    "moves": {
        "1. e4 Nf6 2. e5 Nd5 3. Nc3 c6 4. Nf3 e6 5. d3 Bc5": "Pinning the knight with 5...Bb4, moving the bishop just one more square would be better here.  The bishop would be protected by the Knight on d5.",
        "6. a3 f5": "sort of a useless pawn movement here.  That pawn is probably best kept to set up the wall for your king to castle behind.  It may have been better to just castle at this point",
        "7. exf6 e.p.": "This is the en passant I was talking about.  Because you passed my pawn with your pawn moving the optional 2 spaces on its first move, my pawn can take yours even though it is not diagonally in front of it.  ",
        "7... Qxf6": "Good strong move.  One thing to look at here is that both your queen side knight and bishop are trapped.  The knight can get out, but in a very bad position (knights are very ineffective on the edges of the board).  During the opening (first 10 moves or so), pawns are best moved to get out of the way so that the real pieces can be developed.",
        "8. d4 Bxd4": "Better would have been to retreat the bishop here. You traded a bishop for a pawn, never a good exchange.  My pawn is protected by my knight and queen, you are only attacking with your bishop and queen.  This may seem equal, but if you take first, you need superior numbers to come out equal.",
        "9. Nxd4 e5": "Pretty good here, especially if you have your sights on freeing up that knight and bishop with pawn to d7 to follow.",
        "10. Nf3 e4": "Oops, pushed your luck with the pawn a bit too far.  It is unprotected and the attack on my knight is only for show.  Better would have been 10...d6, freeing up both your queen side knight and bishop.",
        "11. Nxe4 Qg6": "Better, I think would have been 11...Qe7.  This puts your queen in a much more defensible spot and pins my Knight on the e file.",
        "12. Bd3": "Now your queen is in real trouble.  When I move my knight to d6 it will uncover the bishop attacking your queen.",
        "12... O-O": "Great move.  Now my knight can't put you in check while uncovering the bishop attacking your queen.  This also put your rook on the half open f-file.  Also, it is almost always best to castle.  Much harder to attack a king in a corner.  A king left in the middle is just waiting to die.",
        "13. Neg5 Re8+": "Another good move, Rooks are very strong on open files, and this is with the bonus of putting me in check.",
        "14. Be3 Nxe3 15. fxe3 Qd6": "At this point, I am just playing with more pieces than you.  Your queen side bishop and knight haven't moved at all.  All the pawns you spent time moving are gone.\nSee here that my knight and bishop are attacking the same square on h7.  That is the square that needs to be defended.  Here you just opened up your queen to be taken after 16.Bxh7+. But the real problem is that I am attacking with 3 pieces and my queen, you only have your queen and rook doing the work.",
        "16. Bxh7+ Kh8 17. Qxd6 Rxe3+": "At this point I realize I never castled, but you never put enough pressure to make it necessary.  \nSee here that you put me in check, but you only have the rook to attack with.  I am attacking with 2 knights, a bishop and a queen.  Also see that the bishop next to your king is supported by the knight, who is supported by the other knight, who is supported by a pawn.",
        "18. Kf2 Re8 19. Rhe1": "From here it is pretty academic, I just have too many attackers, and you have almost nothing to defend with.  All your pieces are on your first rank.",
        "19... Rd8 20. Qe7 Rg8 21. Bxg8 d5 22. Bh7 Nd7 23. Qe8+ Nf8 24. Qxf8#": "I hope this helps you some.  I joined a team on gameknot.  Their main purpose is to teach chess.  I played an instructional game against a guy who has a 2300 rating.  Needless to say he whipped my ass, but he also explained what my mistakes were and annotated a game like this for me."
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-romanus?gm=31049",
    "gameName": "Challenge from romanus",
    "players": "romanus (1305) vs. mechelle (843)",
    "opening": "Alekhine's defence (B02), Saemisch attack"
}