{
    "moves": {
        "1. d4": "I decided to challenge an old friend from years ago, whom I had apparently never actually played in a game until now, all because I noticed we were both online at the same time for the first time in a while. This was the second game we played; nuntar beat me in the first game with a superior endgame. This time it was my turn to best him in the endgame.",
        "1... Nf6 2. c4 c5": "I decide to change things up a bit from the normal line of e6, because I know from his annotations that his book knowledge is very strong.",
        "3. d5 d6 4. Nc3 Bf5 5. f3 e5": "I decide in a sudden stroke of inspiration, to play a closed game, Petrosian-style. Something tells me his open game skills are superior to mine. My plan is to do what I can to maneuver my way into a pawn advantage by the 30th move or so.",
        "6. e4": "He accepts! In the event of en passant capture I'd have enjoyed the semi-open game we'd have played, but it's always nice when a plan comes together.",
        "6... Bg6 7. Be3 Be7 8. Bd3 a6": "The blockade is now complete. His knight is pinned in and his dark square bishop can't control much outside of g5, which won't help him much for now. I'm also mostly pinned in, but I don't care. Let's see who blinks first.",
        "9. Nge2 O-O": "I thought about castling later, since my king is not in danger, but decided it was best to just castle since there was nothing else immediate to do. Besides, my attack will be on this side of the board, and I plan to use the f-file as my primary lane of attack, which is why castling is my best move here.",
        "10. O-O Nbd7 11. f4 h6": "Creating an escape square. I might need it for the bishop, king, or knight.",
        "12. fxe5 Nxe5": "My plan is to harass his bishops. Hopefully this will produce a small advantage I can exploit. Meanwhile I must be mindful of his e-pawn, without my own e-pawn I can't let it past me.",
        "13. Ng3": "A good post for his knight, controlling that important f5 square. However, it weakens his knight on c3, and I have my eye on that b-pawn of his, to give my queen something to do, and to force nuntar to play solid defense to defend his light squared bishop. I know I can have his dark-squared bishop because there's nowhere to go outside of f4, which would block his rook from controlling the file.",
        "13... Nfg4 14. Qd2 Nxe3 15. Qxe3 Qb6": "Here I'm not looking to attack his pawn, I'm looking to attack his knight. If he moves the pawn forward, I play Qa5. If he defends the knight with Rc1 then Bg5 wins the rook by attacking the queen. Right now his queen is the only piece defending that light squared bishop, and I don't want to give him a tempo to reset.",
        "16. b3 Qa5 17. Nce2": "Now his queen is smothered even more. Excellent. I decide against Bg5, which wouldn't do much of anything interesting, and go ahead and move the rook to the file it needs to occupy.",
        "17... Rae8 18. Nf4 Bg5 19. Qe2 Qc3": "Right now I am the master of the dark squares. I put more pressure on the light squared bishop. If his knight decides to capture my light squared bishop, it opens the f-file, which benefits me, and does nothing to counter my control of the dark squares.",
        "20. Rad1 Bh4": "All of a sudden I realize: This is the knight I should be threatening! Sometimes I just randomly see things I probably should have seen earlier. His other knight isn't hurting me much, this knight is preventing me from pushing f5. By doubling his kingside pawns it will give me a favorable endgame. There is no good escape for this knight, moving it to h1 would be a good defensive move but that's not all that obvious of a move. The queen is tied to the defense of the bishop.",
        "21. Qc2 Qd4+": "I'm not interested in exchanging queens, I want the f-file open and his pawns doubled, and his knight no longer harassing f5. So far this game is a good illustration of why controlling squares is useful.",
        "22. Kh1 Bxg3 23. Nxg6 fxg6": "The f-file is open and his king is in the corner. Excellent. But, my main goal here is to win that e-pawn I was wary of earlier, and with it, control of the center, and of the game itself.",
        "24. hxg3 Nxd3 25. Rxf8+ Kxf8": "The key to controlling the center. If the rook captures then White probably has a little advantage with his queenside pawn structure.",
        "26. Qxd3 Qxd3 27. Rxd3 Rxe4 28. Kg1 b5": "This is the winning move, and the key to the earlier sequence. With my rook controlling the 5th rank White is in trouble.",
        "29. cxb5 axb5 30. Kf2 Ke7": "Now it's just a matter of solid play and avoiding mistakes. Mistakes like allowing White's a pawn to advance to the end of the board.",
        "31. Re3 Re5": "The name of the game here is zugzwang over the d5 pawn if he decides to capture the rook. Being a pawn up really helps my case.",
        "32. Rxe5+": "And he goes for it. Must. Concentrate.",
        "32... dxe5 33. Ke3 Kd6 34. Ke4 h5": "bam. Now White must move the queenside pawns.",
        "35. a4 c4": "And here I have won the game. By not allowing an a pawn ambush, my material advantage and especially those doubled Kingside pawns ensure my victory.",
        "36. a5 cxb3 37. Kd3": "White admits defeat. Now it's just execution.",
        "37... Kxd5 38. Kc3 Kc5 39. Kxb3 e4": "The passed pawns are unstoppable. Once I'm able to push b4 to get to the a pawn, the game is over.",
        "40. Kc2 b4": "White Resigns."
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-chessssss?gm=68837",
    "gameName": "Challenge from chessssss",
    "players": "nuntar (1694) vs. chessssss (1592)",
    "opening": "Benoni defence, Hromodka system (A56)"
}