{
    "moves": {
        "1. e4": "1. e4 is the most popular first move in chess.  It siezes space in the center and opens lines for the queen and bishop.  Space and Development are two of the primary elements of chess.",
        "1... c5": "The Sicilian defense.  1. ...c5 seeks to prevent White from establishing a center pawn duo (on d4 and e4), while avoiding the symmetry established after 1. ...e5.",
        "2. Nf3": "Developing and centralizing.  The knight benefits more than any other piece from centralization.",
        "2... g6": "The hyper accelerated dragon.  Black intends to fight for control over the dark center squares.  The bishop on f1 will take up its perch on g7 and fight from a distance.",
        "3. c3": "A straitforward way to counter act Black's plan.",
        "3... Bg7": "Continuing to develop.",
        "4. Bc4": "4. d4 cxd4 5. cxd4 d5 is another way to continue.",
        "4... e6": "Now, black wants to play d5 and force the bishop to move again.  Notice that while 3. c3 helps to fight for the d4 square, it hampers white's ability to control d5, by denying the night on b1 access to c3.",
        "5. O-O": "Quickly completing the king side development.  White is now ready for action in the center.",
        "5... Ne7": "Reinforcing the thruust d7-d5, and preparing to castle.",
        "6. d3": "6. d4 is still the principled continuation.",
        "6... d5": "Black is ready with a center advance that also hits the bishop on c4.",
        "7. exd5": "This will leave black with an advantage in space.  7. Bb5  is another alternative.",
        "7... exd5": "Recapturing and forcing the bishop's hand.",
        "8. Bb3": "8. Bb5  Nbc6 does not stop black's development, but after 8. Bb3 black catches up in development and retains a spatial advantage.  This is too much to allow after so few moves.  If white had played 6. d4 instead of 6. d3, the game would be level.",
        "8... O-O": "Both sides have completed their kingside development, but the pawns on c5 and d5 compared to the ones on c3 and d3 confer a spatial advantage to black.",
        "9. Re1": "Moving the rook to the only open file.",
        "9... Nbc6": "Black seeks to complete his development.",
        "10. Bg5": "If the pin could be maintained it would be very annoying, but it is not hard for black to neutalize it.",
        "10... h6": "Putting the question to the bishop.  Retreat or exchange?",
        "11. Bh4": "White retreats, but the pin is not a problem.",
        "11... Be6": "Completing the development of the minor pieces, and blocking the e-file.",
        "12. Ba4": "This is the third time the bishop has moved.  White is falling behing in the element of time.",
        "12... Rc8": "Black wants to preserve is pawn structure in case white chooses to capture.",
        "13. Bxc6": "The fourth move of a piece that is exchanged for one that has moved only once.  Now, black's spatial advantage is combined with an edge in development or time.",
        "13... Rxc6": "Restoring material equality.",
        "14. d4": "This restablishes spatial equality in the center, but the moves d3 and d4 waste a tempo.  Notice the white pieces on a1 and b1 have not moved even once.",
        "14... c4": "Black converts the spatial advantage in the center to the wing.",
        "15. b3": "White wants to challenge the queenside expansion before it gets too far along.",
        "15... Re8": "Or 15. ...b5.  Black is not worried about a capture on c4, because the rook would recapture.  Then white would be saddled with a backward's pawn on c3.",
        "16. Bg3": "The 3rd move of this bishop.",
        "16... Nf5": "Black would love to play with 2 bishops versus 2 knights.",
        "17. Be5": "It is important for white to eliminate one of the bishops.",
        "17... b5": "Black continues to expand on the queenside.",
        "18. Bxg7": "This helps white by exchanging the bishops, but it took white alot of time to accomplish.  The pieces on a1 and b1 still have not been developed.",
        "18... Kxg7": "Reestablishing material equality.",
        "19. Ne5": "Occupying the center with tempo due to the attack on the rook on c6.",
        "19... Rb6": "Black is going to play b4-b5 at some point, so is happy to position the rook along the b-file.",
        "20. Nd2": "20 moves into the game, the knight finally moves.",
        "20... a5": "Continuing the theme of queenside expansion.",
        "21. Rb1": "Anticipating the opening of the b-file.",
        "21... Qd6": "Black activates his last piece with an eye towards invading at a3.",
        "22. Qc2": "White activates his final piece as well.  Both sides have completed their development.  2 sets of minor pieces have been exchanged.  Black's edge in space allows his remaining pieces to be increase their activity more easily.",
        "22... Reb8": "Their is no penetration squares along the e-file, so black doubles along the b-file in preperation for activity there.  Notice that white cannot match this activity due to his lack of space.",
        "23. Rb2": "White is attempting to double as well.",
        "23... cxb3": "The time has come to strike.",
        "24. Rxb3": "24. axb3 is better, but black plays b5-b4 in any case.",
        "24... b4": "The final break at last.",
        "25. c4": "Relatively best would've been 25. Re-b1.  Now, white loses material.",
        "25... Nxd4": "Forking the rook and queen.",
        "26. Qd1": "White is lost.",
        "26... Nxb3": "Establishing a winnning material superiority.",
        "27. axb3 Qc5": "The rest is consolidation and then prosecuting the victory.",
        "28. cxd5 Qxd5 29. Qa1": "Crossing one's fingers and hoping, but their is a tactical problem.",
        "29... Qxd2": "Black can ignore the discovered check and wins another piece.",
        "30. Nf3+": "Discovered check is a powerful tactic, but it does not work in this instance.",
        "30... Qc3": "This may have been what white missed.",
        "31. Qxc3+": "The game is hopeless for white at this point.",
        "31... bxc3 32. Nd4 Bxb3 33. Rc1 Bc4": "Exploiting the back rank threat.",
        "34. h3": "If 34. Rxc3 Rb1  leads to mate.",
        "34... Rb6b1": "Forcing the exchange of rooks.",
        "35. Rxb1 Rxb1+ 36. Kh2 Bd3": "Now, the knight must be sacrificed as well.  0-1.  This game illustrates how to convert advantage in space.  White found himself behind in development and with less space.  His attempts to exchange pieces cost more time, and he was not able to match the activity of the black piece swhen the final break game."
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-yellowlab?gm=13685",
    "gameName": "Challenge from yellowlab",
    "players": "jonny1988 (1244) vs. yellowlab (1810)",
    "opening": "Sicilian (B27), Hungarian variation"
}