{
    "moves": {
        "1. d4": "Most popular move at the highest levels of chess and thought to preserve more of a lasting advantage for white than 1. e4, but in all honesty, these two moves are equally fine.",
        "1... d5": "Classical response that claims the center directly (as opposed to moves like 1...Nf6, which has a rationale of its own: attacking the center from afar).",
        "2. c4": "The super popular Queen's Gambit, much sounder and more popular than the King's Gambit.",
        "2... dxc4": "Accepted.  White will regain the pawn shortly, or black will have to make terrible positional concessions.",
        "3. Nf3": "White, in no hurry to take back the c4-pawn, develops the knight.",
        "3... Nc6": "?!  Nf6 blocks the important c-pawn and attacks a pawn that is adequately defended. 3...Nf6 develops a piece and looks good.  3...b5 looks to keep the pawn, but gives white a lead in development and hurts black's pawn structure.  Finally, 3...e6 is a more classical move that looks to give back the pawn and set up a solid position while white uses precious tempi to take the pawn.",
        "4. Nc3": "This is the main line.  Black, correctly, makes no show of wanting to keep the pawn, so white takes his time.  This develops the knight to the right square and attacks the center.  4. e4 is a good alternative.",
        "4... Nf6": "This is the right move.  Black obeys the saying \"Knights before Bishops\".  Black takes the center and has not fallen behind in development.",
        "5. e4": "Finally, white decides it's time to get his pawn back.  White has the \"ideal\" center, but black has a solid position and will do well to attack white after preparing.",
        "5... e6": "This is a good move.  5...g7!? is an alternative, where after 6. d5, black can try to keep the pawn by 6...Na5 or play 6...Nb4?!, were white can't play 7. a3? because of 7...Nd3! giving the pawn back very favorably.  After 7. Bxc4, the black knight looks offside at b4 and it is unclear how black will respond to the threat of 8. a3, pushing the knight to the rim.",
        "6. Bxc4": "Takes the pawn.",
        "6... Bb4": "Pinning the white knight, but 6...Be7 might have been more solid.  This move is OK, but the pin will be broken soon.",
        "7. Qd3": "I think this is also book.  A viable alternative is 7. O-O.  This move is not a bad early queen move because black cannot exploit it's position (at least not immediately) and it is a centralization.    Note that the b4-square is covered by black's bishop, so the knight can't jump in, which is the way black usually tries to exploit white's queen position.",
        "7... O-O": "This move is fine.  The king is safer kingside than queenside because of the half-open c-file.  Black cannot stay in the center for too long since white may consider opening lines to black's king by d5.",
        "8. O-O": "White is safe and has broken the pin.",
        "8... Bxc3": "Black could have waited for white to try a3, but if the white knight moves away (Ne2, for example), the black bishop looks silly.",
        "9. bxc3": "Obviously strengthening white's center, and taking the b4-square from the knight.",
        "9... Na5": "?!  Black should develop and needs to strike back at white's center.  9...Ne7 deserved consideration.",
        "10. Bb5": "?! I thought long and hard about which move to play.  I know all the books (and GMs) would punish black's last move by developing or, at least, relinquishing the bishop, which has moved once, for black's knight, which has moved 3 times.  I still don't know what the best move would be, but the principles discourage this bishop maneuver, so I hope commentors can help me out.  In any event, here's what I see: I keep black's knight on the rim; I keep the two bishops slight edge; but, currently, the only thing my bishop is doing is stopping Nc6; even worse, it will take me two moves to get back into the action.  ",
        "10... c6": "?  With this move and black's next, white gains a significant edge.  This plan helps white, and doesn't solve black's problems.  10...b6, planning Nb7 to get back into the game, and Bb7, which is a move I advocated as early as move 5.  However, best seems to be 10...Bd7, exchanging white's bishop off and giving the c6 square back to the knight.  Black even threatens c5 at some point, because dxc5 destroys white's center and gives him two awful doubled, isolated pawns.",
        "11. Ba4": "White should thank black for the help.",
        "11... b5": "? ",
        "12. Bc2": "The obvious (and good) square for the bishop.  White threatens a tactic that emerged in the game and exerts good kingside pressure besides.",
        "12... Qb6": "The only try was 12...g6, but that looks bleak after 13. Bg5, where white has excellently placed pieces, space, a safe king, and pressure on the black king; or, put simply, a big positional plus.",
        "13. e5": "Black ends up a knight down after 13...g6, but it is the only hope at this point.",
        "13... Nd5": "? A last mistake, but the game was already very bad for black.",
        "14. Qxh7#": "The end."
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-bobdoleeatsfood?gm=24543",
    "gameName": "Challenge from bobdoleeatsfood",
    "players": "bobdoleeatsfood (1608) vs. aspiemikey (1331)",
    "opening": "QGA (D21), 3.Nf3"
}