{
    "moves": {
        "1. h4": "지형 안녕~ 어줍잖게 comment를 좀 달아보려고 해. 도움이 될거라고 믿어 :)\n\n체스에서 처음 목표에는 크게 3가지가 있어~ \n1. piece development - 피스들을 빨리 꺼내는 거야. 나잇은 꺼내기가 쉽지만, 비숍이랑 룩은 처음 상태로는 움직일 수 없지~ 그래서 폰을 움직일 필요가 있어. \n2. 공간 장악하기? 중앙을 컨트롤하는 게 중요해~ 여기서 완전 중앙은 d4 d5 e4 e5 이렇게 네 개이지만, 그 주변을 둘러싼 칸들도 중요하고. 그래서 처음에 d/e폰을 움직이는 게 일반적이고, 이걸 또 피스들로 뒷받침해주는 거지~ \n3. King safety - 킹은 가운데에 그대로 있으면 공격 타겟이 되니까, 캐슬링으로 옮기는거.. 물론 캐슬링을 안 하는게 더 안전한 경우도 있지만, 많지는 않아.\n\n그래서 1.h4는 가장자리에 있는 폰을 옮기는 건데, 1/3에는 도움이 안 되고 2에는 도움이 되는 듯.. 하지만 보통 킹 쪽에 있는 룩은 어차피 캐슬링한 다음에 자유로워지니까 굳이 h폰을 올릴 필요는 없지~",
        "1... d5": "그러니까 난 바로 d폰을 올림~",
        "2. d4": "응 그니깐 지형도 이렇게 중앙 폰을 올리고~",
        "2... c5": "이건 자주 보이는 패턴인데, c폰을 올려서 지형 d폰을 공격하는 거야~ 지형 입장에서 이건 먹어도 되고 안 먹어도 되지만, 굳이 지금 먹을 필요는 없어. 왜냐하면 dxc5를 하면 (x는 잡아먹는거야~ d에 있는 폰이 c5를 잡아먹으니까 dxc5야) 나는 결국 나중에 이 폰을 되찾을 수 있거든~ 그니까 이럴 때는 Nf3를 하면 나잇으로 d폰을 보호하면서 피스도 꺼내는 셈이 되니까, 보통은 그런게 좋아~ ",
        "3. dxc5": "물론 먹는 것도 나쁜 방법은 아니고~ 나는 나중에 e6으로 폰을 움직이고 f8에 있는 비숍으로 저걸 먹으려고 하는 게 기본적인 plan이야. 그 때 지형은 굳이 저걸 지키려고 할 필요가 없고 (어차피 하나를 먼저 먹었으니까).",
        "3... Nc6": "나잇을 꺼냅니다~",
        "4. e3": "f1 비숍을 꺼내려는 거겠지?",
        "4... Nf6": "또다른 나잇을 꺼냅니다~",
        "5. Bb5": "! 좋은 수야~ 나는 저 나잇을 지금 이대로 움직일 수가 없게 되잖아? (움직이면 킹이 체크에 걸리니까) 이런 식으로 못 움직이게 하는걸 pin이라고 하는데. 비숍은 나잇에 pin을 걸어두기에 좋음~ 그럼 나는 저 나잇을 움직이려면 일단 c8에 있는 비숍을 d7로 옮겨야겠지~",
        "5... a6": "그러니까 빨리 저 비숍을 쫓아버리고 싶은거지 ㅋㅋ",
        "6. Bd3": "나쁘지 않아~ 그치만 e2로 가도 괜찮았을 거야.",
        "6... e6": "이제 c5 폰을 되찾으려고 하는거지~",
        "7. Nc3": "! 이것도 좋은 수야. 굳이 지키려고 할 필요가 없이, 피스를 꺼내는 거지.",
        "7... Bxc5": "폰을 되찾으면서 비숍을 develop 시키고~",
        "8. Be2": "음~ 이건 약간 낭비같아! 왜냐면 지금 저 비숍을 3번 움직였잖아~ 같은 피스를 너무 많이 움직이는 건 별로 안 좋아. 차라리 Nf3으로 나잇을 꺼내는게 어땠을까~",
        "8... b5 9. Bf1 O-O 10. g3 d4 11. Bg2 Bb7 12. Nf3 Qb6 13. Ne2 dxe3 14. O-O exf2+ 15. Kh2 Rad8 16. Qe1 Ne4 17. Ne5 Nxg3 18. Kxg3 Nxe5 19. Qc3 Bxg2 20. Qxe5 Bd6 21. Qf4 Bxf4+ 22. Kxf4 Bxf1 23. Ng3 Qd4+ 24. Kg5 f6+ 25. Kh5 Qd1+ 26. Ne2 Bxe2#": ""
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-waterboat?gm=35077",
    "gameName": "Challenge from waterboat",
    "players": "beatleiced (1200) vs. waterboat (1200)",
    "opening": "Anti-Borg (Desprez) opening (A00)"
}