{
    "moves": {
        "1. d4 d5 2. c4 c5": "The classical Symmetrical Defense of the Queen's Gambit Declined. Generally white plays 3. cxd5 and black should not reply 3. ... Qxd5. 4.Nf3 cxd4 5.Nc3 Qa5 6.Nxd4 or 5...Qd8 6.Qxd4 Qxd4 7.Nxd4 gives White a big lead in development. The full article at Wikipedia is here: http://en.wikipedia.org/wiki/Symmetrical_Defense",
        "3. e3": "I've had some success with an early e3 even though it traps my dark squared Bishop for a bit",
        "3... Nc6 4. Nf3 Nf6 5. Nc3 Bf5 6. Bd3": "Fairly normal development through this point except 5. ... Bf5 which comes into play momentarily",
        "6... Bg4": "This second move with the Bishop pins my Knight but I thought might be a slight loss of time. I'm not sure 6. ... Bxd3 7. Qxd3 is any better as white light squared Bishop is usually a good piece in this type of game. I thought Black should have placed the Bishop on this square with the initial move",
        "7. h3 dxc4 8. Bxc4": "This exchange gains back a bit of tempi for black",
        "8... Bh5 9. Qb3": "9. Qb3 does open the possibility of 9. ... Bxf3 10. gxf3 wrecking white's King side but the threat of 11. Bxf7+ or 11. Qxb7 both must be dealt with in the aftermath",
        "9... e6 10. Ne5": "This prevents the destruction of my Kingside defenses and places the Knight in a strong position, one which is not as easily dislodged as might be imagined as 10. ... Nxe5 11. dxe5 Nd7 12. Qxb7",
        "10... a6": "Preventing 11. Bb5 pinning the Knight against the King although I was not really thinking about this because I didn't anticipate being able to prevent a shortside castle for black.",
        "11. Nxc6": "I thought this Knight was eventually doomed to exchange and decided to take the iniative and create doubled pawns for my opponent",
        "11... bxc6 12. O-O Rb8": "This move seems to lock my Bishop to the c1 square to defend the b pawn for the foreseeable future",
        "13. Qa4 cxd4": "I imagine expecting 14. exd4 Qxd4 winning a pawn but I find a nice zwischenzug (http://en.wikipedia.org/wiki/In_between_move) move that really opened the game for me. I'm always happy to find such moves as I think they are often the sign of a stronger player.",
        "14. Qxc6+ Ke7": "I thought 14. ... Nd7 15. exd4 better for Black. Also possible is 14. ... Qd7 15. Qxd7 Nxd7 16. exd4",
        "15. b3": "Here is my Knight sacrifice although it is for so short an interval before the recapture and gain of material I'm hesitant to call it a sacrifice",
        "15... dxc3": "Taking the piece and essentially giving me the win. 15. ... Nd7 16. exd4 or 15. ... Qd7 16. Qxd7 Kxd7 17. exd4 both save the game although results in the loss of a pawn",
        "16. Ba3+ Qd6": "The only move",
        "17. Bxd6+ Kd8 18. Bxb8 Nd7": "This gives the King the f6 square for eventual escape otherwise my Bishop pair swoop in for a mate after Bxa6",
        "19. Bc7+ Ke7 20. Bd6+ Kf6 21. Bxf8 Nxf8": "21. ... Rxf8 22. Qxd7 picking up more material",
        "22. g4": "Driving the Bishop off protection of the d1 square allowing my Rooks into the game",
        "22... Bg6 23. f4": "Removing more escape squares",
        "23... h6 24. Qe8": "Pinning the Knight from returning to the game but also threatening 25. Qd8#",
        "24... Be4": "Gaining the King an escape square at g6",
        "25. h4": "Hoping for a pawn mate but it never worked out",
        "25... g6": "Allowing Kg7 as an escape",
        "26. Qd8+ Kg7 27. Qd4+ e5": "27. ... Kg8 28. Qxe4 prolongs the game a bit",
        "28. Qxe5+ f6": "28. Kd8 prolongs things again",
        "29. Qe7#": "I was happy with my play in this game. I saw a nice zwischenzug move and then set up a trap both of which allowed me to take control of the game. "
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-tomlib?gm=28998",
    "gameName": "Challenge from tomlib",
    "players": "tomlib (1497) vs. thearrtofnoise (1395)",
    "opening": "QGD (D06), symmetrical (Austrian) defence"
}