{
    "moves": {
        "1. e4 c5 2. Bc4 e6 3. Nf3 Nc6 4. d4 cxd4 5. Nxd4 Nf6 6. Nxc6 bxc6 7. Nc3 Bb4 8. O-O Bxc3 9. bxc3 Nxe4 10. Qd4 Nf6 11. Ba3": "Interesting on hindsight just how terrible a blunder 9. ..., Nxe4 was for me. It should have been O-O (which I had thought about) but I incorrectly felt my king was safe.",
        "11... Qa5": "According to the post-game analysis by the fruit engine, I really should have played 11. ...,d5. I remembered considering it, but somehow tossed it out.",
        "12. Bd6": "Ouch. This is a lesson I will probably never forget. From this point on, I was just desperately trying to dig myself out and dislodg that bishop on the d6 square.",
        "12... Nh5 13. Be2 f6 14. Bxh5+ Qxh5": "I had a tiny chance for an attack here, but either my opponent noticed it or he got out of it without knowing. The plan was 15 ..., Qg6 16. ..., Bb7 and finally 17. ..., c5 winning the queen if it had stayed.",
        "15. Rfe1 Qg6 16. Qd3": "No such luck, it seems. And the queen exchange at this point was not to my favor, so I decided to ease my king to a safer place.",
        "16... Kf7 17. c4 Ba6": "I had wanted to push the a pawn out first, but figured I'd rather have the rook cover my pawn than the bishop.",
        "18. Rad1 Qxd3": "At this point, I decided enough was enough ... he was slowly getting pieces into play and I was still trapped. Trading the queen off (he'd pretty much have to take with the pawn) would buy me some time to try and unlock my e pawn and have my rook get to that file to eventually try and dislodge the bishop.",
        "19. cxd3 Rac8": "The idea was to push the c pawn, but this could easily be countered.",
        "20. c5": "like so.",
        "20... Rhe8": "Hence plan B (actually, should have been plan A on hindsight).",
        "21. d4 Bc4": "There were three aims to this move. Threaten his a pawn, free my a pawn and potentially block his d pawn if I am forced to do so.",
        "22. a4 a5": "Had to block it, although again on hindsight, it might have been better to block at a6 instead of a5. a6 limits my c rook's movements rather severely though ... that might have been one of my considerations when I made the decision.",
        "23. Rdb1": "Nasty nasty move ... he threatens to push into my \"inner sanctum\" (more like hellhole, hehe). The obvious target was my pawn at d7 and there was no way for me to deny him the b file.",
        "23... g5": "I figured I had time to free my king. The sequence I had to consider (to ensure this was safe): 24. Rb7, Red8 25. Bc7, Re8. The bishop and rook block each other from effective attack.",
        "24. h3 Rca8": "I think I did this to buy me a 2nd defensive position from a7, it also gives my e rook some freedom to move queenside if needed.",
        "25. Rec1 Ba6": "I had to consider Bd5 and Ba2 but settled on Ba6 to deny him the b7 attack square. Also buys my a rook a possible chance to get out onto the b file through Ra7 to Rb7. I was not too concerned at this point if he doubled his rooks on the b file.\n",
        "26. g3 h5": "I had to build a defensive structure against a possibly dangerous advancing pawn wave on the king side. This also buys me more legroom for the king and rook.",
        "27. Bc7": "He wants my a pawn, at this point, I'm not too worried. He cannot take it without losing his bishop or his own a pawn (which he'd be loathe to do).",
        "27... e5": "finally mounted enough protective pieces to allow this to happen (his rooks were finally gone and he had no short-term threats on me).",
        "28. dxe5 fxe5 29. Rce1 e4": "No choice, e5 was not a tenable position and e4 could be defended by Bd3.",
        "30. Rbd1": "Back to the d7 pawn and other potential defense penetrations king side. Could also allow him Rd4 to double the attack on the e4 pawn. Left me with only 1 reasonable choice, imho.",
        "30... Bd3": "Blocks off the attack on the d7 pawn and prevents Rd4.",
        "31. f3": "He's threatening to undo the only protection my bishop has.",
        "31... Re7": "I cannot do much about fxe4, so I have to anticipate the layered attack on d7.",
        "32. fxe4 Bxe4 33. Bd6": "Again, his bishop gets in the way of the rook attack, so I wasn't too worried.",
        "33... Re6 34. Bc7 Bd5": "I chose 33 ..., Re6 as opposed to Re8 precisely so I can have a more solid structure like this while also allowing for an eventual Bb3 which could potentially force his d rook into a corner, like he has my poor a rook. The rook exchange offered is actually to my disadvantage since he has an active rook vs my active bishop.",
        "35. Rxe6 dxe6": "I took the chance to break my d pawn free from getting uselessly tied up and constantly under attack.",
        "36. Rf1+ Kg6 37. Be5 Bb3": "Again, I calculated I had time. Rf5 (would have been a game breaker) was prevented thanks to my trusty e pawn. Meanwhile, Rf6 is not a big deal as Kh7 prevents his rook from getting to the rear of my pawns. At the same time, I had an opportunity to trade off the e pass pawn for an a pass pawn.",
        "38. Rf6+ Kh7 39. h4 g4": "I wasn't sure if going for the pawn exchange would have been better. I saw some threats during the game, but I do not seem to remember them now.",
        "40. Bf4": "He *really* wants that h pawn.",
        "40... Kg7": "I decided to trade rooks at this point. Notice if he tried to attack the h pawn, 41 Rh6, Rh8 would leave his rook nowhere to go.",
        "41. Rh6 Rh8 42. Rxh8 Kxh8 43. Bc7 Bxa4": "I offered the draw. Opposite colored bishops, one pass pawn in the middle of the board that promotes on a square controlled by his bishop just did not seem like good chances for a win on my part.\n\nStill, I had expected a loss after that disastrous start for me."
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-warrior16win?gm=20782",
    "gameName": "Challenge from warrior16win",
    "players": "warrior16win (1200) vs. cheewai (1662)",
    "opening": "Sicilian defence (B20)"
}