{
    "moves": {
        "1. e4": "Natural, expecting sicilian from khalil",
        "1... c5": "yep",
        "2. Bc4": "i went with this move with the intention of clearing the middle of the board because i know he likes pawn center control",
        "2... e6 3. Nf3": "just setting up a means to challenge the center again, not sure what hes going to do",
        "3... Nc6": "standard defense",
        "4. Qe2 Nd4": "didnt think he was going to push it, but the next few moves are obv",
        "5. Nxd4 cxd4": "at this point i was happy, khalil is good with knights, i think getting one off the board is in my favor in the long run",
        "6. O-O": "not alot of real options here, so prepare for a long battle and make it clear which side im working with",
        "6... e5": "now he is setting up center",
        "7. a3": "this was a fast played move, and not really in my favor, but in hindsight i was probably trying to protect the side I have to play on",
        "7... Nf6": "now hes setting up, and its clear his next few moves are going to get alot of pieces into action, when evaluating, figure him to look at different pieces for every next move, no single attacks now that my king is protected, also, i failed to open up the middle, so I must also set up, anticipate his set up to put the bishop into play soon",
        "8. d3": "when i made this move, i was planning on challenging his knight, i was willing to let the pawns control the bishops at this point and my standing knight may be the advantage",
        "8... Be7": "hes not doing anything with that knight now, there is no protection on my king side, so i need to set up more, since I can run with free bishops I give it a shot",
        "9. f4 d6": "and of course he protects the pawn center, i need to free up paths to get my pieces off the queen side, so i make the trade",
        "10. fxe5 dxe5 11. Bg5": "and back to the original plan",
        "11... Qb6": "now im thinking hard for the first time, star this move for further discussion, i originally thought he wanted to put his king on the queen side, or force me to keep the d4 pawn at bay, i was originally planning to snub out the queen side by advancing all my pawns slowly and taking his knight at the first possible instance, my queen side is strong at the current time, and both my bishops are able to engage the king side when he castles, original plan was b4, expecting 12. b4, Bg4, 13. Qf2, O-O, 14. c3, trade queens and decent queen side position, but I knew he wouldnt let the queen trade happen so early, and I didnt spend enough time figuring out the alternatives, instead I tried to push his queen around by asking him to give up the center one way or another expecting 12. c3, dxc3, 13. Be3, queen to move.  Obv I didnt put alot of thought into it past this point, and didnt see the next move basically ruining my plan",
        "12. c3 dxc3+ 13. Be3 Bc5": "I should have seen this coming, and how hard my bishop is in trouble.  At this point I think I may have just lost the game, and im scrambling to recover from the mistake.  If i dont move my queen and try to relieve pressure elsewhere, 14. ..., Bg4 and then im boned.  Qf2 (my original plan) is foolish, he takes my bishop and im still rocked, and if I try pressure elsewhere with h3 or the even worse b4, he still wins the bishop, only move is to take his bishop, and try to solidify position later",
        "14. Bxc5 Qxc5+": "I didnt think about it at the time, but his queen is no longer pressuring me to hold b2.  I thought about this move for a while, and when I realized that, I was pretty happy with the outcome, and decided I would just take the loss of b2 in stride as it would improve my position queen side again when he takes the extra pawn, grats khalil",
        "15. Kh1 cxb2 16. Qxb2": "my queen is now in a strong defensive position, there is signifigcantly reduced pressure on my king because once again blacks pieces have no pending attack, time for him to defend and activate pieces for end game",
        "16... O-O": "this is sort of obv, thinking from his side, i dont know of any way for him to prepare a safe attack either, this was a setup move, now i need to take this opportunity to get the rest of my pieces into play, and i have the easy decision Nc3 preparing Nd5 for later in the game when he gives up defense of it from his knight.  If wanted to move Rf5 as well, but his current position is holding the bisop off the king side, but that would force points trade for the next few moves leaving me in a spot i didnt think I could recover from",
        "17. Nc3 Ng4": "This is a fairly obv mistake unless he expects me move my rook or queen off defense of f2.  The most important factor is that he is opened up an all out attack for me on f7.  Secondly he freed my knight to own d5, which I was planning for long term position.  Noticing that f2 is in no real danger (after a long thought), I went ahead with my plan to take the center board.",
        "18. Nd5 Qd6": "I think right here he also noticed f2 was a lost cause since I didnt bite, and was now trying to protect the pawn at e5 since I had 18. ..., Qe5, 19. ..., Qc7 adding lots of pressure to his undeveloped pieces, though that isnt fully thought out.  Either way, it is a defensive play which left me in one of those spots thinking about future moves, and decided to figure out an attack.  I thought about removing his knight with h3, forcing retreat and giving me the chance to take control of space, but I decided I had enough space and could attack the knight whenever I wanted to, so I positioned for a long sequence attack.",
        "19. Rac1": "Rac1! imo.  My next move is obv Nc7 with no even trade posibility for black, he is on full defense.",
        "19... a6": "a6! also.  He recognized my attack, and how little he could do against it, this protects my eventual retreat to b5.  The attack is now is full steam however, and mate opportunities a many should he believe my next move is hanging the knight.  a6 showed that he recognized it, but the advantage is significant, proceed as planned.  Only one move that looks to avoid catasptrophe, Rb8.",
        "20. Nc7 Ra7": "I think this was a mistake, Rb8 looks far better and would have kept his rook in play.",
        "21. Qa2": "The attack is now in full swing.",
        "21... Nh6 22. Qf2": "Queen trade is his best move here most likely.  Anything else and he allows me to catch up in material.",
        "22... Qxc7 23. Qxa7 Ng4": "?",
        "24. Be6": ""
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-fody?gm=15389",
    "gameName": "Challenge from fody",
    "players": "fody (1153) vs. theninthpawn (1485)",
    "opening": "Sicilian defence (B20)"
}