{
    "moves": {
        "1. e4": "Here starts the great match (the 4th one, but still) between me, and Utku, or goflb, as his nick goes.",
        "1... c5 2. c3": "Denying the Sicilian Defence's more aggressive variants is both unexpected, and little known by many players, so here it goes.",
        "2... Nf6 3. e5 Nd5 4. d4 cxd4 5. cxd4 Nc6 6. f4 d6 7. Nf3 Bg4 8. Nc3": "A blunder by white, trying to attack when not everything is defended.",
        "8... dxe5": "And here starts the punishing period of it.",
        "9. fxe5 e6": "An unexpected defence maneuver that lets me defend more, but I choose unwisely, and try to break the pin...",
        "10. Be2 Bb4": "Another pin, this time more deadly.",
        "11. Bd2": "Trying to break it, but is no use.",
        "11... Bxf3 12. Bxf3": "Have to take it back with bishop if I'm to stay in the game...",
        "12... Qh4+ 13. g3 Qxd4 14. Nxd5": "I'm trying to play with a single lost pawn here.",
        "14... Qxe5+": "But he gets greedy, and wasted the match with a single blunder. Ouch.",
        "15. Kf2": "The knight is un-takeable, for the pin by rook on queen is deadly.",
        "15... Bc5+ 16. Ne3": "Oops, the knight has escaped, now black has little chance, or does he?",
        "16... O-O-O 17. Bxc6": "A pin most unwanted costs white a queen, but with attack on it's back too.",
        "17... Bxe3+ 18. Bxe3": "Brave sacrifice of the queen, as the king will be in too bad of a position to be defended, with the h8 rook sitting still.",
        "18... Rxd1 19. Bxb7+": "Getting a pawn and destroying the pawn structure, and the defense.",
        "19... Kxb7 20. Raxd1": "Wrong rook, but still...",
        "20... Qxb2+": "Greed hurts, he's leaving his queen even more open to the attacks by rooks, and leaving his queen in crossfire.",
        "21. Kf3": "Uncheckable place that doesn't block the rooks, perfect.",
        "21... Kc7": "Biggest blunder in the match, unfixable too, ...Ka8 would play longer, and possibly win too.",
        "22. Rdc1+": "Punishment delivered before too late, black loses a queen or a rook.",
        "22... Kd7 23. Rhd1+ Ke7 24. Rc7+": "And here comes the deadly maneuver, the killing blow.",
        "24... Kf6 25. Bd4+": "Check, and queen is dead."
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-ozgun92?gm=23549",
    "gameName": "Challenge from ozgun92",
    "players": "ozgun92 (1735) vs. goflb (1492)",
    "opening": "Sicilian (B22), 2.c3, Heidenfeld variation"
}