{
    "moves": {
        "1. Nf3": "After a heavy defeat its hard to face ones demons but if we wish to improve face them we must. So two weeks after the game has finished I finally have got round to annotating it for the Walk the walk thread.",
        "1... Nf6 2. d4 d5 3. c4 e6 4. Nc3 Be7": "Having been an avid follower of the brigadecommander- stalhandske matches I expected 4.....c5 here with the Semi-Tarrasch Defence to the Queens Gambit Declined.",
        "5. Bf4 O-O 6. e3 b6": "Both 6....c5 and 6....Nbd7 seem more popular here but the move played is in keeping with stalhandske's style. A little bit non mainstream with plenty of potential for piece activity. \nStill in the opening book ECO reference D37",
        "7. Rc1": "&.cxd and 7.Bd3 are also popular here. ",
        "7... Bb7 8. cxd5": "Clarifying the situation with the pawn centre. 8.Bd3 may have been better.",
        "8... Nxd5": "Keeping the h1/a8 diagonal open and better than 8....exd",
        "9. Nxd5": "Played so that I didn't have to retreat the Bishop on f4",
        "9... Qxd5 10. a3": "10.Rxc7 Bb4 11.Nd2 Na6 doesn't give white much.",
        "10... Nd7": "I'm out of my book now so my loss in only another 9 moves is particularly galling as in this position white looks to have equality at the least. Though I think my esteemed opponent would be happy with his position due to his piece activity.",
        "11. Bc4": "11.Qa4 may have been much better here and after the game I found in the GK database a game played with this move. When I played 11.Bc4 I saw the Qa4 ch and wasn't too unhappy about the Q exchange. Interestingly both the GameKnot engine and Houdini 2 give my move as imprecise going from a +0.20 to a -0.10",
        "11... Qa5+ 12. Qd2": "12.Nd2 was also possible as 12....Bxg2 13.Rg1 Bb7 14.Bh6 Bf6 and now the move I missed 15.Bxg7. Having missed this I played 12.Qd2",
        "12... Qxd2+ 13. Kxd2": "13.Nxd2 was an option and may have been preferable. I didn't play it because of 13.....Bxg2 but like the previous note Bxg2 is weak.",
        "13... c5": "Thematic attacking the centre and threatening whites somewhat exposed king.",
        "14. dxc5": "An error due to worrying about getting an isolated pawn. GK -0.69 Houdini2 -0.37. 14.Ke2 should have been played with a position close to equality e.g. 14.Ke2 cxd 15.Rhd1(the intermezzo I missed) Rad8 16.exd with a position close to equality.",
        "14... Nxc5 15. b4": "Played to get rid of the weak pawn on b2 though again Ke2 getting the King of the exposed D-file was better.",
        "15... Ne4+ 16. Ke2 a5": "Black now attacks whites now weak pawn on b4. I now wish I had left it on b2.",
        "17. bxa5": "A blunder.-1.88 GK.-1.06 Houdini2. Both give 17Rhd1 as better though I still lose the pawn.",
        "17... Rxa5 18. Ne5": "A blunder that loses a piece.  Though with white about to drop his remaining Q-side pawn then having to face blacks Q-side passer it probably shortened my misery.",
        "18... g5 19. Bg3 Nxg3+": "Zip to four and probably my worst performance against stalhandske. Food for thought and back to the drawing board. But once again well played by my opponent."
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-stalhandske?gm=55584",
    "gameName": "Challenge from stalhandske",
    "players": "caveman1960 (1893) vs. stalhandske (2149)",
    "opening": "Reti opening (A05)"
}