{
    "moves": {
        "1. e4": "This is my first time at annotating a game. \r\n\r\nHaving played this in june i will not be able to remember why i made certain moves but i will have a fair idea of what it will  lead to!\r\n\r\nSo we start with the kings pawn opening!",
        "1... e6": "My response. French Defense",
        "2. c3": "Attempting to bring his queen into the game ",
        "2... g6": "g6! Probably thinking along the lines of a fianchetto.",
        "3. d4": "Taking control of the centre.",
        "3... f5": "Applying pressure on the e4 square",
        "4. e5": "Avoiding losing material",
        "4... Bg7": "...and finishing the fianchetto which should have probably been done on the previous move",
        "5. Bd3": "Strengthing the centre",
        "5... b6": "And again another fianchetto, attempting to gain control of the centre via the fianchettos",
        "6. Nf3 Bb7 7. Be3 Ne7": "Preparing for d5 to attack the bishop on e3",
        "8. Nbd2 Nd5 9. Qe2 Nxe3": "I swap material. I always feel that bishops fair better in open games and knights on closed and tight games as most people do. (i think anyway) \r\n\r\nSo with my bishops on the fianchetto i dont want his opposing bishops to counteract this.",
        "10. Qxe3 Na6": "Should have moved to c6",
        "11. Nb3 Qe7 12. Be2 c5 13. Rd1 c4": "Dont know why i did this",
        "14. Bxc4 Be4": "Or this",
        "15. Bxa6 Bc2 16. Ra1 Be4 17. Be2 Bxf3": "This time i take the knight, hoping for gxBf3",
        "18. Qxf3": "One can only hope",
        "18... O-O": "I castle and have both rooks lined up",
        "19. Ba6": "Notice how well my opponents pawn structure is, he can pass freely without hinder due to his bishop on the white squares",
        "19... Bh6 20. O-O": "He castles and looks very strong at the moment, his king is well defended and is a knight and a pawn up",
        "20... d5": "Trying to gain control of the e file",
        "21. Nc1": "He denies the en passant capture",
        "21... Qe8 22. Qg3 Qa4": "Trying to attack his bishop and the c2 square which is his weak point in the pawn structure cause it can lead to the capture of b2",
        "23. Qh3": "He attacks my bishop",
        "23... Bd2": "And i move it to safety, i cant afford to lose any more material",
        "24. Qd3 Bh6 25. f4": "Strengthing the e5 pawn",
        "25... g5 26. Qh3 Qc2": "Sacrificing the bishop to attack his pawn structure",
        "27. Nb3 Qxb2 28. Qxh6 g4 29. Qg5+ Kh8 30. Qe7 Rae8 31. Qxa7 Qxc3 32. Qxb6": "Remember how i wanted to attack from the sides, i think this plan failed :)",
        "32... Qe3+ 33. Kh1 Rfg8 34. Nc5 Rg6": "Protecting the e6 pawn, and leading to rook to the h file to put pressure on his king",
        "35. g3": "To protect his pawn on h2",
        "35... Rh6 36. Rfg1 Rh3 37. Nxe6 Rg8 38. Ng5": "Attacking the rook",
        "38... Rxg5": "Removing the threat and attempting my first rook sacrifice",
        "39. Qd8+": "He denies it, and i protect my king with it",
        "39... Rg8 40. Qxd5 Rg5 41. Bf1 Rg6 42. Bxh3": "My first sacrifice, and now i need to get his queen of the a diagonal for my sacrifices to count",
        "42... Re6": "My second rook sacrifice",
        "43. Qxe6 gxh3": "I have mate in two now, his last hope now is to move back on to the a diagonal but the lure of more material must have won my opponent over",
        "44. Qxf5 Qf3+ 45. Rg2": "His only move",
        "45... Qxg2#": "I think my main point of this game was to show you that everyone makes mistakes but if you keep fighting and making good moves you can still win. As i said this is my first annotated game so any input will be greatly appreciated.\r\n\r\nI would like to thank my good friend mel-lo on a good game!"
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-mel-lo?gm=10188",
    "gameName": "Challenge from mel-lo",
    "players": "mel-lo (1185) vs. jonny1988 (1109)",
    "opening": "French defence (C00)"
}