{
    "moves": {
        "1. d4": "I played as Black in this unrated game against one of my teammates whom I found to be a strong 1700  player.  In the game, Black plays an interesting 9th move which defines a good portion of the game.  Late in the game, Black blunders away a winning position and with a second blunder loses the chance to draw.  The credit really goes to White though who played a nearly flawless game.",
        "1... Nf6 2. c4 e6 3. Nc3 Bb4 4. e3 c5 5. Nf3 O-O 6. Bd3 d5": "Up to this point we have stayed within the common lines of the Nimzo-Indian.",
        "7. cxd5": "More usual is 7. 0-0 getting the king to safety.  This move seems to retain some initiative though.",
        "7... cxd4": "7. ... exd5 is more common and probably better",
        "8. Nxd4 Nxd5 9. Qc2": "A nice move adding a defender to the knight and attacking h7",
        "9... f5": "f5!? This, to me, is one of the defining moves of the game, intended to shut down the attack along the b1-h7 diagonal.  Yet, as my opponent pointed out to me after the game, g6 was probably objectively better as this weakens the a2-g8 diagonal which becomes a thorn in my side.",
        "10. O-O": "Breaking the pin on the c3 knight and forcing Black to decide whether to make the exchange there or not.",
        "10... Nxc3 11. bxc3": "I decide to isolate White's queenside pawns while I have the chance.",
        "11... Ba5 12. e4 Qc7": "Getting wood off the back row needs to be Black's priority at this point, and this also attacks the c3 pawn.",
        "13. Bb2": "Defending the pawn and getting the bishop on the long diagonal where it will eventually exert more influence",
        "13... Nc6 14. exf5 Nxd4": "More or less forced to keep from falling behind a pawn, but now the isolated c pawn will become a dangerous passed pawn",
        "15. cxd4 Qxc2 16. Bxc2 exf5": "The first round is over with White clearly ahead, having two well placed bishops and a passed, albeit isolated, pawn.  Also Black's weakened a2-g8 diagonal is now vulnerable",
        "17. Rfd1": "Now time to manuever for position.  White sets up a pushing rook behind his passed pawn, nearly always a good idea.",
        "17... Bd7": "Here I made the decision to try to get my bishops to optimum locations as I thought the diagonals would probably be what would win or lose the game from this point.\r\nIdeally, I would like to blockade the passed pawn with my dark squared bishop on d6 and get my light squared bishop to b5.",
        "18. d5 Bb4 19. Bb3": "I think white should have advanced the pawn again, cramping Black's position even more, especially since this allows 19 ... Bd6.  However, that is the perfect diagonal for White's light squared bishop.",
        "19... Bd6 20. Rac1 a5": "Trying to open up some room for my pieces and create counter-play on the queen side.  Gaining tempo by attacking the bishops was in my mind.",
        "21. a4": "Good, but it only delays the assault",
        "21... b5 22. axb5 Bxb5": "This is the diagonal I had planned for my light squared bishop back on move 17 as it keeps the white king locked up and can become dangerous to White's rooks.",
        "23. Rc3 a4 24. Ba2 a3 25. Bc1": "? This is the only seriously questionable move by White that I see in the game, allowing the following tactic and moving the dark-squared bishop off of its best diagonal.  25. Ba1 looks stronger.",
        "25... Be2": "Winning the exchange, but at a high positional price.  I think this is still the best move though.",
        "26. Rd2 Bb4 27. d6+": "9 ... f5 comes back to haunt Black now as the pawn advances with check, forcing the black king far out of the action",
        "27... Kh8 28. Rc7 Bxd2 29. Bxd2 Rac8": "Forcing the Rook exchange because of the threat of Rc2",
        "30. Bc3": "This gets the light squared bishop back onto its best diagonal.  White correctly declines the temptation to initiate the rook exchange and keep his passed pawn with a dark queening square (opposite of Black's bishop), as the succeeding threats of a back row mate would cause White much trouble and probably loss of material.",
        "30... Rxc7 31. dxc7 Ba6 32. f4 h6": "Trying to get that Black king into the game before it is too late",
        "33. Be5": "Defending the c pawn and locking down much of Black's position",
        "33... Bb7 34. Kf2 Kh7": "Both kings head out hoping to lead their mighty armies to victory",
        "35. g3 Re8": "The rook does not seem to have many present opportunities to exert influence even on the a file, so zigzagging to e8-e7-d7 seems to be its best choice.",
        "36. Ke3 g5 37. h4 Bc8": "This looks to be a wasted move.  Breaking up the king side for the Black king to invade with gxh4 looks better",
        "38. Kd4 Re7": "This move is necessary for Black's breakthrough to succeed but it should have been made last move.",
        "39. Kc5 gxh4 40. gxh4 Kg6": "Black is now set up to break the king through and have queening threats on both sides of the board.  This looks like a winning position here.",
        "41. Bc4": "Setting up a nice tactical trap",
        "41... Kh5": "??? Black blunders into the trap and hurts his position badly, much better was Rd7.",
        "42. Be2+ Kg6 43. h5+ Kf7": "And the Black king is reduced to tears of frustration as it can now be of no real use",
        "44. Bc4+ Ke8 45. Bb5+": "White offered a draw here and I declined, feeling Black still had enough play to win.",
        "45... Kf8 46. Bc4": "White correctly declines winning the rook with Bd6 as Black would queen.",
        "46... Re8": "?? I am pretty sure Black could have won here with the immediate \r\n46 ... Rxe5  followed by 47. fxe5 Ke7.",
        "47. Kb6 Rxe5": "??? A move too late!! Now blundering away the game, White will still queen second, but with check tempo to win.\r\n",
        "48. fxe5 f4 49. Ka7 f3 50. Kb8 f2 51. Kxc8 a2 52. Kd7 a1=Q 53. c8=Q+ Kg7 54. Qg8#": "And the end to a great game and nice win by brmichael.\r\nPlease leave comments and star rating. \r\nI will try to answer any questions and alert you by message after doing so.\r\nSame with comments if it is warranted."
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-jboyette36?gm=18488",
    "gameName": "Challenge from jboyette36",
    "players": "brmichael (1697) vs. jboyette36 (1793)",
    "opening": "Nimzo-Indian (E41), 4.e3 c5"
}