{
    "moves": {
        "1. Nf3 c5 2. d4 e6 3. e4 Nc6 4. Be3 Nf6 5. dxc5": "Mauvais jeux, puisque Kxe4 et mon pion en c5 est attaqué par 2 pièces et seul le fou le protège.",
        "5... Nxe4 6. Bd3 Nxc5 7. Bb5 Ne4 8. O-O Qa5 9. c4": "a4 n'était pas mauvais, mais j'ai opté pour c4 pour laisser plus de place à ma reine.",
        "9... a6 10. Bxc6": "J'ai opté pour l'échange plutôt que Ba4.  Je craignais les échanges si le pion avancait en b5, l'échange de pion aurait libéré la ligne a reine-tour pour les noirs.",
        "10... bxc6 11. Qd4": "Simple coup pour faire bouger le cavalier noir.  Ce dernier m'empêche de sortir mon cavalier en c3 ou d2.",
        "11... d5 12. Ne5": "Ce coup me permet d'attaquer le pion en c6.  De plus si dxc4, la ligne d est ouverte pour ma reine, ce qui n'est pas mauvais.",
        "12... Bc5": "Ce coup des noirs n'était pas prévu et me force à ramener la reine.",
        "13. Qd1 Bxe3": "L'échange de fou expose le roi blanc.  J'aurais du jouer Qd3 plutôt que Qd1.",
        "14. fxe3 Qc5 15. Nxf7": "Ici j'ai pris une chance, j'espérais que les noirs bouge simplement la tour.  Le coup Rxf7 aurait probablement été meilleur puisque le roque n'aurait pas été possible.",
        "15... O-O 16. Qf3": "Je dois absolument protéger mon cavalier",
        "16... Ng5 17. Qh5 Qxe3+ 18. Kh1 Rxf7 19. Nc3": "J'aimais mieux sortir mon cavalier.  Si l'échange de tour se fait, je garde le controle sur la ligne f et espère surprendre les noirs avec Qe8 pour le mat.",
        "19... Rxf1+": "L'échange se fait comme prévu.",
        "20. Rxf1 Bd7": "Malheureusement les noirs ont vu le jeu.",
        "21. h4": "J'essaie de faire fuir le cavalier pour descendre Qf7.",
        "21... Ne4": "Je décide de ne pas descendre la reine, je crains Kg3 qui me couterait ma tour.  Je procède donc à l'échange de cavalier.",
        "22. Nxe4 Be8 23. Qg4 Qxe4": "À partir de là, il est clair que les noirs veulent provoquer l'échange de reine.  Cette partie est terminé pour les blancs.",
        "24. Qg3 dxc4 25. Qd6 Bg6 26. Qe7 Re8 27. Qg5 Bf5 28. h5 Qg4": ""
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-dragoneye?gm=11911",
    "gameName": "Challenge from dragoneye",
    "players": "dragoneye (1397) vs. enculeurdemouche (1701)",
    "opening": "Reti opening (A04)"
}