{
    "moves": {
        "1. e4 c5 2. Nf3 d6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 g6 6. Bd3": "Bd3 I feel this is a departure from standard Siclian play - would have expected Be3 - Yugoslav attack",
        "6... Bg7": "continuing with standard Dragon\r\n",
        "7. O-O O-O 8. Nd5": "Nd5 somewhat of a surprise - not part of the white response to the dragon that I expected",
        "8... Nxd5": "With the white bishop blocking the queen, should win a knight",
        "9. exd5 Bxd4 10. Be3 Bf6": "missed an opportunity, could had done Bxb2",
        "11. Bh6 Re8 12. Re1 Bxb2": "if Rb1, then Bc3",
        "13. Bb5 Bd7": "don't want to trade rooks \r\n",
        "14. Bxd7 Nxd7": "gets the knight out",
        "15. Rb1": "up 4, content with trading Bishop for a Bishop - gets the qN developed\r\n\r\n",
        "15... Bc3 16. Re3 Qc8": "don't like the queen defending both a bishop and a pawn, want to do b6 asap\r\n",
        "17. Rb3 Bf6 18. Reh3 Nc5": "I feel that Nc4 is a good outpost - N can't be chased by a pawn, also forces a move by white\r\n",
        "19. Rb4 b6": "somewhat of a timid move - probably better moves available - was locked into freeing up the Q but b6 wasn't required\r\n",
        "20. Rf3 Qd7": "Wanted to get Q off the back rank",
        "21. Rbf4": "Rf4 causes me great consternation.  While Rxf6 is unprofitable for White, it does create pressure I could do without.   I feel that the next move is pivotal toward the outcome of the game, lots of bloody scenarios but I am ahead.  In the upcoming exchanges, I feel I will lose a pawn but will still be ahead\r\n\r\n",
        "21... g5": "Will probably lose a pawn but seems to be lessor of evils\r\n",
        "22. Rf4f5 Ne4": "get some more defense for the g pawn",
        "23. Qd4": "somewhat of a surprise - is this a blunder? - expected Qe1 - pressures the Knight but Queen is safe",
        "23... Bxd4": "will take the Queen",
        "24. Rf5xf7": "losing a pawn for a queen - will take that exchange.  While doubled rooks spook me, especially with the bishop on h6, I see this as a threat I can survive.  Rf8 would be a disaster for me.",
        "24... Qb5": "Qb1# first move I am not in check",
        "25. Rg7+": "Rg7+?  Is this another blunder. Did not see Bxg7 at first.  Was thinking Kh8 but Bxg7 looks better. This has been a very good dragon bishop - captured a pawn, Queen, and about to capture a Rook while only giving up a pawn",
        "25... Bxg7": "If he recaptures Bxg7,  Qb1#checkmate, if h3, not sure if Bxh6 or Be5 to cut off king escape\r\nWhite resigns"
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-royalguy?gm=32409",
    "gameName": "Challenge from royalguy",
    "players": "royalguy (1240) vs. justnkase42 (1472)",
    "opening": "Sicilian (B70), dragon variation"
}