{
    "moves": {
        "1. d4 d5": "I don't play a lot of queen's openings, so here's a chance for me to learn them.",
        "2. c4 e6 3. Nc3 Nf6 4. Bg5": "Oh, pinning my knight.",
        "4... Be7 5. Nf3 h6 6. Bxf6 Bxf6 7. e3 Nc6 8. cxd5 exd5 9. Bb5": "Oh, I see, pinning my other knight.",
        "9... O-O 10. O-O Bd7 11. Nxd5": "Oops. I'd left that pawn for free. Can't say I had any grand plan in mind for that.",
        "11... a6 12. Bc4 Na5": "If I can dislodge the bishop then his knight is undefended",
        "13. b3 Bg4": "Move my own white bishop out of the way so my queen has a good look at his d5 knight.",
        "14. h3 Nxc4 15. bxc4 Be6 16. Qb3 b5 17. Nxf6+": "I'm actually pleased he played this move, as it brings my queen around to the king side while his queen is playing amongst the pawns.",
        "17... Qxf6 18. d5 Bxh3": "His g2 pawn is busy defending his knight",
        "19. gxh3 Qxf3 20. Kh2 Rfe8": "With the g column opened up time to bring my rooks into the game.",
        "21. Qc2 Re4": "I'm planning Rh4 then Qh3...",
        "22. Rfg1": "He sees it and can get his rook in the way.",
        "22... Rxc4": "freebie",
        "23. Qb2": "Attack on my g7 pawn",
        "23... g6 24. Rg3 Qf5": "Lining up to put my rook on c2.  I wonder if he see it?",
        "25. Rag1 Rc2 26. Qb3": "I thought about just charging in with my queen here, but ultimately it works out badly for my rook on c2. Need more troopers.",
        "26... Rd8 27. d6": "He has 2 rooks lining up my g6 pawn, and my f7 pawn is pinned onto the king. Thankfully, when I take his pawn my rook is backing up that g6 square.",
        "27... Rxd6 28. Rg1g2 Rxf2": "I feel like +3 is a good enough position to start trading things out.",
        "29. Rxf2 Qxf2+ 30. Rg2 Qf5 31. Qc3 c5 32. Rg4 b4": "go away",
        "33. Qb2 Re6 34. Rf4 Qe5": "Rook is pinned and I'm lining up another free pawn.",
        "35. Qxe5": "He had to take it really.",
        "35... Rxe5 36. e4 c4 37. Kg3 c3": "End game, running for the finish line."
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-aleks1?gm=53888",
    "gameName": "Challenge from aleks1",
    "players": "aleks1 (1534) vs. jongy10 (1590)",
    "opening": "QGD (D53), 4.Bg5 Be7"
}