{
    "moves": {
        "1. e4": "King pawn opening and here we go",
        "1... e5": "Standard play from here until, well, I'll just stop you when we get there",
        "2. Nf3 Nf6 3. Nc3 Nc6 4. Bb5 d6": "A kind of transposed Ruy Lopez.  This structure is very solid for black, though the self-pin may seem a little dangerous and can in many lines prove to be fatal if black isn't careful.",
        "5. d4": "Bold play not dissimilar to the Center game",
        "5... exd4": "Why not? Seems to give the best chances for wresting the initiative.  plus the center pawns were rather imposing",
        "6. Nxd4": "That pin's starting to feel pretty threatening..",
        "6... Bd7": "best defence",
        "7. Nxc6 Bxc6 8. Bxc6+ bxc6": "I'll take doubled pawns for increased center control",
        "9. O-O Be7 10. Be3": "Good development on both sides so far",
        "10... O-O 11. f4": "Good push by white.  Gains central and kingside space and gathers steam for a possible kingside attack",
        "11... Rb8": "? bleah--squanders the pawn, but ends up gaining a slight intiative and two half-open files.  Nevertheless, this is clearly a blunder",
        "12. b3 Qd7": "The real blunder, as last move the bishop could not take my pawn because I could take the b-pawn",
        "13. Bxa7": "! takes it--and why not?",
        "13... Rb7": "Gain of tempo ",
        "14. Be3 Ng4": "Loving that awkwardly placed bishop",
        "15. f5": "?? Blunders the material WAY back",
        "15... Nxe3": "Thanks ;)",
        "16. Qd2 Nxf1": "The more the merrier",
        "17. Rxf1 Bf6 18. Ne2 Re8 19. Ng3": "Trying desperately for some kingside play, though it may have been relatively best to try to make the g and h pawns have some effect on the game, as the knight proved unable to deliver the fatal blow",
        "19... Rb5": "Trying to get that rook to the kingside, somehow",
        "20. Nh5 Be5 21. Rf3": "Looks to be a frightening storm on my king! Eep!",
        "21... g6": "Strangely best to avoid all the Kingside pressure",
        "22. f6": "Good move! that pawn will prove to be a bone in my throat.  If gxh5, Qg5  Kf8 (Ke8) Qg7#",
        "22... Bxh2+": "!!!! the move that wins the game for black, and ties up all the loose ends",
        "23. Kxh2 Rxh5+": "The rook is now free to take the knight with check, not allowing the king to escape, and keeping the kingside pawn structure intact.",
        "24. Kg1": "About as god as there is.",
        "24... Rxe4 25. Rf1": "it's over and white's just draggin his feet to the resignation box",
        "25... Rf5": "i had thought after making this move that Qh6 here would lead to a loss!! image that after the game had been all mine to win! But my opponent pointed out in post-game analysis that 26. Qh6 leads to 26...Rxf1  27. Kxf1 Qf5  28. Kh1 and either the immediate or the delayed Qxf6 and Re1 , leading to a win by outright mountains of material.  Good play by my opponent (mostly) and thanks for the fun game to him!",
        "26. Rxf5 Qxf5": ""
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-bobdoleeatsfood?gm=10547",
    "gameName": "Challenge from bobdoleeatsfood",
    "players": "tree_of_thorns (1455) vs. bobdoleeatsfood (1438)",
    "opening": "Petrov three knights game (C42)"
}