{
    "moves": {
        "1. e4 Nc6": "Right away, my opponent goes away from the Classical lines.",
        "2. d4 d5 3. Nc3 Nf6 4. e5": "All book so far, but I have attained a central advantage.",
        "4... Bg4": "No fear from my opponent. They may not have mastery of the game, but they possess fighting spirit and will to win. If one has that, with enough practice the tactical skills will come.",
        "5. Be2 Bxe2 6. Ngxe2 Ng4": "Rather than retreat, my opponent advances.",
        "7. Nf4 Nxf2": "A risky sacrifice. It does expose my King, but I don't think Black has a good enough development to exploit this.",
        "8. Kxf2 e6 9. Rf1 Bb4": "Black must play aggressively, having sacrificed a piece.",
        "10. Nce2 f6": "Too passive. 10...Q-R5 ch seems in order. If I'm allowed to consolidate, my material advantage will win for me.",
        "11. exf6 gxf6": "11... QxP, pinning the Knight, would be better. Even with that move, I don't think Black's attacking chances are worth the sacrificed material, but the move actually made allows me to drive the B and get my King to safety.",
        "12. c3 Bd6 13. Kg1": "Now that Black's attack has dissipated, I look to swap down and win with my material advantage.",
        "13... Qe7 14. Qd3 O-O-O 15. Ng3": "I'm intending to move the Knight on KB4, so I block the Bishop's diagonal with my other Knight first.",
        "15... Qf7 16. Nfh5": "Double-attack on the Black KBP. The more I can increase my material advantage, the better.",
        "16... Ne7 17. Nxf6": "I gain the Pawn and now threaten a discovered attack on the Queen.",
        "17... Nf5": "Blocking the discovery and cutting the protection to my Knight on KB6.",
        "18. Nxf5 exf5 19. Qxf5+": "The exchange of Knights simplified the game and I gained another Pawn into the bargain.",
        "19... Rd7": "A tactical blunder. Now I can get rid of the Queens and win an Exchange.",
        "20. Qxd7+ Qxd7": "Forced.",
        "21. Nxd7 Kxd7": "The rest is easy.",
        "22. Bf4 h5 23. Bxd6 Kxd6": "With the Bishops gone, it's just a matter of time.",
        "24. Rae1 Rh7 25. Rf6+ Kd7 26. Ref1 Ke7 27. Rf6f5 c6 28. Re5+": "Black resigns. "
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-kreop?gm=33565",
    "gameName": "Challenge from kreop",
    "players": "thehellion (1355) vs. kreop (1142)",
    "opening": "KP (B00), Nimzovich defence, Bogolyubov variation"
}