{
    "moves": {
        "1. e4": "This is a game between me (tomwhufc) and my good friend maarten. The opening is the sicilian in wich black blocks the centre with a kind of stonewall formation.",
        "1... c5 2. Nc3": "At this point I was planning on using the Grand Prix attack ( 2...d6 3. f4 Nc6 4. Nf3 .) As you will see black has other plans.",
        "2... e5": "This move clamps the d4 square. This seems at first sight to be a very strong move challenging for the centre. However there is now a possible outpost for my knight on d5, uncontested by any pawns on adjacent files. ",
        "3. Bc4": "This develops a piece, prepares to castle kingside and attacks the centre aswell as the f7 pawn. ",
        "3... Nf6": "Also develops a piece and prepares to castle kingside.",
        "4. Nf3": "This develops a piece, prepares castling kingside and attacks the pawn on e5. This is a decent move but better would have been the flexible 4.Ne2",
        "4... d6": "This solidifies  the pawns on c5 and e5. It creates a backwards pawn although black doesn't have any other choice. ",
        "5. h3": "This move may seem premature to some people although it is a crucial move because it  hinders the development of blacks lightsquared bishop.",
        "5... h6": "I feel black could have delayed this move as the development of my dark squared bishop was impossible at the time.",
        "6. d3": "This opens space for my bishop to be developed. As you can see Blacks central pawns do not complement the dark squared bishop as far as development is concerned, this is because they are  on the dark squares blocking decent development. I knew this would happen after he played his pawns to c5,d6 and e5. This also explains why I played 5.h3 which also hindered the dark squared bishops development. At this point Black effectively has two bad bishops. My (white's) position however is much better. My lightsquared bishop is outside my pawn chained and developed. Both my knights are in play, I am about to castle kingside and move my dark squared bishop to e3. I have the a small edge.",
        "6... Nc6": "This develops a piece and threatend ... Nd4 wich would have given him a very powerful piece in my territory.",
        "7. Ne2": "! This may seem a  backwards move but I planned to play c3 attacking d4 stopping the threat of ...Nd4. It also was meant to prepare d4 and if the worst came to the worst I could shift it to g3.",
        "7... Na5": "I think this was a good logical move. It threatens the bishop that hinders blacks lightsquared bishop's development. It attakcs the defender.",
        "8. Nd2": "This is another backwards move? It disobeys the opening principle of never moving apiece twice in the opening. But the alternatives were not to my liking. I could have played 8.Bb3 Nxb3 9.axb3. This would have left me with a powerful semi-open file but would have left me with doubled pawns.  I do not favour positions wich leave me with damaged pawn structure. Another option was to ignore the threat and castle kingside. Of course that would be a bad move bcause after 8. 0-0 Nxc4 dxc4 my position would be worse of than if i had played 8.Bb3 because I would have had doubled pawns without the semi-open file! This kind of justifies my decision to play 8.Nd2 even though  8.Bb3 is strategically better it is not to my style.",
        "8... Nxc4 9. Nxc4 Be7": "I was surprised by this move because I thought  ...Be6 was better.",
        "10. Be3": "I strengthen my hold on the d4 square.",
        "10... b5": "This is a rather common move in the sicilian and as in this case is normally decent.",
        "11. Nd2": "I retreated again but this time the move is not so bad because my darksquared bishop has already been developed.",
        "11... Qa5": "?! I am not certain why maarten played this move. It pins my knight but puts his queen in danger of attack from my minor pieces and pawns.",
        "12. c3": "I lift the pin on the knight and prepare d4",
        "12... Ba6": "? I try not to use question marks but his move is awful. Black has done well to remove the defender and open up the e6 square for his light squared bishop but he doesn't use it.",
        "13. O-O": "I castled kinsgide here. Looking back on this move I think that if I had realised the way the game was going I  should have waited and castled queenside. However this is not a bad move it is decent enough.",
        "13... b4": "This move attacks my hold on the d4 square and attacks my pawn on d3. ",
        "14. Qc2": "This defends the d3 pawn and I was still thinking of the possible d4 break but this was somewhat deluded on my part! The immediate c4 seems a much better move.",
        "14... Qb5": "This move thwarts my original plan of playing d4. I had no other option I had to completely close the centre with...",
        "15. c4": "As you can see the queenside is almost completely blocked. This means any attacking actions will be on the kingside of the board and I was smart enough to castle kingside!(sarcasm) I should have waited and seen what way the game was going before castling. However castling kingside is a sufficent move.",
        "15... Qc6 16. b3": "?? Completely blocking off the queenside.  There are three better options here. 1. A much better move may hav been 16. a3 because of 16...bxa3 17. bxa3 18.Rf-b1. This would have been a lot better because my king would have been a lot safer and I could have attacked the queenside without endangering my kingside as you will see my kingside is soon under attack in this game. 17. f4! which opens the centre and leaves the possibility of couterplay on the queenside. 3. Ng3 with the plan of putting it on f5 with a powerful position. Basically I played one of the worst possible moves here.(within reason)",
        "16... O-O": "?? THis completely contradicts everything I have said about king safety. There is no excuse for this move. The queenside is almost completely blocked off, maarten should have delayed castling until he had completely blocked of the queenside then castled queenside and pawn stormed the kingside.",
        "17. f4": "?! A dubious move. I overlooked 17. a3 bxa3 18. Rxa3. This would put me in a good position because I could double up rooks on a-file and put my queen there aswell creating a powerful cannon.",
        "17... exf4 18. Nxf4 g5": "This begins the start of a pawn storm. It threatened my knight but that is irrelevant becasue I was going to move my knight to d5 anyway.",
        "19. Nd5 Nxd5 20. exd5 Qd7": "BLacks starts moving his pieces into places where they can provide kingside play.",
        "21. g4": "? This weakens my kingside. Better would have been 21.d4 or Ne4 (a fantastic central square.)",
        "21... Bc8 22. Rf3": "?! I am not sure whu I made this move. It was probably because I was deluded enough to think that I would have a chance to double my rooks on the f-file and attack.",
        "22... f5": "! This is a good move. If 23. gxf5 Rxg5 24. Rxg5 Qxg5 my king would have been a dead man walking.",
        "23. Raf1": "?! I am still deluded enough to think i was supporting the rook when in fact I was actually cutting off its points of retreaat! 23. Kh1 is better because if 23...f4   24. Bg1 leaving my rook with a place to retreat to.",
        "23... f4": "My only option is...",
        "24. Bf2": "? Even though this is forced I still give this a question mark because I shouldn't have got my self into this position.Now my rook is immobile and I am effectively a major piece down! I think I deserve a round of applause for being able to muck my position up so badly.",
        "24... Qe8 25. d4": "My only hope here was to check mate him down the a1-h8 diagonal.",
        "25... h5": "! This is a very good move. If 25...cxd5 26. bd5 I would have a chance to counter attack and salvage my position.",
        "26. dxc5": "This is the beginning of my combination.",
        "26... hxg4 27. hxg4 Bxg4 28. cxd6": "Here I offered to sacrifice my rook temporarily in return for two bishops. It was a last ditch effort!",
        "28... Bxf3": "??????????????????Yes!! He accepted I could salvage my position and even possibly checkmate him while he was off his gaurd. Better would have been declining the sacrfice e.g. 28...Bd8 29. d7 Qxd7 30. Qg6   (if 30....  Kh8 white will win with the better position after 31. Bd4  .)  Qg7  31 Qxg7  Kxg7 32. Bd4  and the position is equal.",
        "29. dxe7": "Now the queen has to take...",
        "29... Qxe7 30. Nxf3": "And I am a pawn up!",
        "30... g4": "This attacks the knight and at first sight seems a good move. But have you seen what maarten missed. He has let me back into the game....",
        "31. Qg6+": "! This has put me back into the game and threatens mate along the a1-h8 diagonal.",
        "31... Kh8": "???????????????? This loses the game. Better would have been 31.... Qg7 which would have kept his king alive. However I would have exchanged queens and taken advantage of my massive queenside majority.",
        "32. Bd4+": "Maaarten finally realises the fatal consequences of his mistakes. He realises he had me by the throat and concentrated on ripping my throat off while I kicked him in the balls and killed him when he was distraught from his unsuccesful attack.  The moral of this game is that you are in the gravest danger when you are in the middle of a powerful attack. I would like to say thankyou to my good friend Maaarten for a fantastic game. If you find any mistakes in this anotations or any missed sub variations please PM me. Thanks for the advice from  raskerino on this annotation."
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-tomwhufc?gm=4274",
    "gameName": "Challenge from tomwhufc",
    "players": "tomwhufc (1525) vs. maaarten (1335)",
    "opening": "Sicilian (B23), closed"
}