{
    "moves": {
        "1. d4 c6 2. e3 d5 3. Bd3 Nf6 4. Nd2": "The knight chooses d2 so that I can still play c3 and complete the stonewall.",
        "4... Bg4": "Ah.  This is where my stonewall is going to have to deviate from the plan.  If he had played any other move then I could have continued with f4 and c3 - now I have to block the threat to my queen. \nI play Ng3 which not only gets it pinned but also blocks my f pawn. I'm satisfied that at least it's a developing move and that I can remove the pin later.  We'll see how things work out...",
        "5. Ngf3 Qd6": "Threatening my h2.  He still hasn't developed his queen's knight of dark squared bishop.",
        "6. c3": "This adds another pawn to my stonewall and gives my white bishop an escape route. It also gives my queen somewhere to go to remove the pin of my knight.",
        "6... b5": "I just realised the threat if he played e5 while my knight is pinned.  Time to chase away his bishop.",
        "7. h3": "shoo",
        "7... Be6 8. Nb3": "I don't want him playing c5 and threatening either dcx4 or c4.",
        "8... Nbd7": "This shows the problem with having my knights in front of my pawns. Both my knights would love to move forward (Ne5 and Nc5), except my d pawn can't defend both of them adequately.  I guess I should have played b4 last turn instead.",
        "9. O-O": "I'm starting to regret playing 8. Nb3, because it has also weakened my dominance of e4 where his knight will be jumping to soon.  I'm tempted to bring my knight back even though it costs time.",
        "9... h6 10. Nbd2": "I suspect he will soon play g5 and fianchetto his black bishop, since at the moment it's not doing anything.  Much like my own black bishop to be fair...",
        "10... a5 11. a3 c5": "A 'free' pawn?",
        "12. Bxb5 c4": "Bishop's escape route is blocked, but hopefully he can still get to c2 via a4.  Meanwhile, my knight can advance since his knight is pinned.",
        "13. Ne5 Rb8 14. Ba4": "Run away!",
        "14... g6 15. f4": "It looks like I've finally completed my Stonewall :)",
        "15... Nh5 16. f5": "His white bishop is completely boxed in.  If he captures the pawn with gxf5 then he will lose his knight to Qxh5.  If he takes the pawn with Bf5 then I am tempted to trade my rook with 17. Rxf5 gxf5 18. Qxh5.\nAn alternative for him here might be to play for time by running around with the knight, eg, Ng3.",
        "16... gxf5 17. Qxh5 Rg8 18. Rxf5": "Offering to sacrifice my rook. But if he takes it, then my queen is going to gobble up his pieces like a hungry hungry hippo.",
        "18... Kd8": "He has removed the pin on his knight, but my knight is only one move away from a royal fork. However, I expect he will trade out these knights, so I'm going to play the fork now and remove his white bishop and a pawn.",
        "19. Nxf7+ Bxf7 20. Qxf7": "He might choose to counterattack now by playing Qg3.  I will play Qxd5 in response which backs up my pawn on g2 and threatens checkmate of my own.",
        "20... Rg7 21. Qxd5 e6 22. Qxa5+ Ke7": "I looked at this position for a long time because I noticed that if I bring my knight forward with Ne4 or Nxc4 and attack his queen, his queen only has 1 square to escape to in either case.  In the first case she can escape to Qb6 offering to exchange queens, which I do not want (I'm many pieces up, but 2 of them aren't even playing). In the second case she escapes to Qg3, threatening checkmate.\nInstead, I choose to play it safe here and bring my rook back to defend his counter attack.",
        "23. Rf2 Qg3": "This was bound to happen eventually.  With my rook there I can't see an immediate threat, but I do need to be extra careful.",
        "24. Ne4": "The queen doesn't have many squares to go to, none of which are on the h2-b8 diagonal that I expect to be using soon. The pawn on h3 can be taken since my g2 pawn will be pinned.",
        "24... Qg6 25. Qc7": "Now he has to defend against 26. Qxd7#.  I think his best move might be bring the queen back to defend with Qe8.",
        "25... Rd8 26. Qd6+": "Game Over.\n26. Qd6+ Ke8 27. Rxf8#",
        "26... Ke8 27. Rxf8#": "Alternative ending is 27. Qxf8#\n\nI think the game was fairly even up until turn 15 where he moved his knight to h5.  I was perhaps a bit too dogged with my Stonewall Attack opening.  Now that I've got it out of my system I probably won't play it again for a while."
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-jongy10?gm=54177",
    "gameName": "Challenge from jongy10",
    "players": "jongy10 (1613) vs. clogs (1200)",
    "opening": "Queen's pawn (A40)"
}