{
    "moves": {
        "1. d4": "Routine Openings For These Games With Tom And I",
        "1... d5": "Black Counters for middle position.",
        "2. e3": "white bishop and you could say queen which has more options now",
        "2... Nc6": "Black then moves for center position for next move",
        "3. Nd2": "whites move in this position to help possible e4",
        "3... e5": "Black move to take control of center",
        "4. dxe5": "white takes with pond ",
        "4... Nxe5": "black removes pond and gains control",
        "5. Ngf3": "white to force trade or back up knight",
        "5... Bd6": "bishop looked surprisingly good",
        "6. c4": "white to open up a row for the queen",
        "6... Nf6": "black counters with horse to protect pond in center position",
        "7. cxd5": "white forces a trade with black to open up center board",
        "7... Nxd5": "black takes and still has center position",
        "8. Nxe5": "white forces another trade with a black centered position piece",
        "8... Bxe5": "black takes and regains center control",
        "9. Nf3": "white persistant in moving black from center",
        "9... Qd6": "black moves queen up to backup bishop and possible check and attack at whites front row.",
        "10. Nd4": "white to protect front line ",
        "10... Qf6": "black begins the trap",
        "11. Be2": "white prepares to castle ",
        "11... O-O": "black beats him to the castle! :)",
        "12. O-O": "white follows expecting to protect and proceed for the end game!",
        "12... Qh4": "black sees glory of a check mate in site!",
        "13. Nf3": "I believe white looks to have an advantage in moving horse to f3 rather than using g3",
        "13... Qh5": "blacks trap is in effect look do you see it?",
        "14. Qxd5": "white makes a great lookin move to move ahead a horse but it wasnt to free ",
        "14... Bxh2+": "blacks bishop settles with a check and queen is for blacks discretion. \r\nwhite resigns"
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-tomwhufc?gm=11398",
    "gameName": "Challenge from tomwhufc",
    "players": "tomwhufc (1499) vs. chessder (1359)",
    "opening": "Queen's pawn (D00), stonewall attack"
}