{
    "moves": {
        "1. e4": "This is a game that I (bishop18) played when I was 14. What's interesting about it is that it looked as if I was getting attacked and in deep trouble for most of the game, but then I suddenly whipped up an attack out of nowhere to checkmate black.",
        "1... e5 2. Nf3 f6 3. Bc4": "The standard line is 3. Nxe5 fxe5 4. Qh5 , but since I never played that line before, I felt that it was too risky, and instead developed normally. ",
        "3... Ne7 4. d4": "Attempting to take over the center.",
        "4... d5": "I admit I didn't see this response. A good one it is, since it has a forced reply.",
        "5. exd5": "No choice.",
        "5... e4": "Attacking my knight, with the hope of kicking it off f3 and putting it somewhere useless.",
        "6. Nfd2": "Best reply is this one, but it blocks my bishop.",
        "6... Nxd5 7. Bxd5 Qxd5 8. Nb3": "Now, my knight is on a better square, protecting my central pawn. My c1 bishop is free to develop again, and so are my other pieces.",
        "8... e3": "A discovered attack on the g2 pawn, as well as an attack on f2.",
        "9. O-O": "Best defensive reply. It solves both problems",
        "9... exf2+": "Attempting to weaken my king's safety.",
        "10. Rxf2 b6": "Black's bishop now can fianchetto itself, or go the other way. It is very mobile now, and has a lot of attacking potential.",
        "11. Nc3 Qc6 12. Qe1+ Be7 13. Re2": "Now that I have the initiative again, I tried to make this counterattack. However, it wasn't as successful as I hoped. The bishop was well protected.",
        "13... Qd7 14. Bf4 Nc6": "A good counterattacking move. The d4 pawn is attacked twice now, and defended only once. The e7 bishop is protected too, so black's king can castle (no longer needed as a defender)",
        "15. Rd1 O-O 16. a3": "Prevents the black knight or bishop from moving to b4.",
        "16... Ba6 17. Re3 Rae8": "A better move would have been Rfe8, and then move the a-rook to d8, attacking my central pawn.",
        "18. Qf2 g5 19. Bg3 Bc4": "Attacking the defennder of the d-pawn",
        "20. Ree1": "Uncovering the queen's defense.",
        "20... Red8 21. d5": "Finally I concluded that the d-pawn was too big of a defensive burden and I decided to get rid of it. Because of the pawn, I was in an entirely defensive position as a result of my efforts to protect it.",
        "21... Bxb3 22. dxc6 Qxc6 23. cxb3 Bc5": "I was outraged. How could I have missed such a simple tactic?",
        "24. Re3": "Blocking the attack.",
        "24... Rxd1+ 25. Nxd1 Bxe3 26. Nxe3 Qc1+ 27. Nf1": "If I blocked with the queen, the b2 pawn would be unprotected, and would fall.",
        "27... h5 28. h3": "Giving my bishop an escape square.",
        "28... h4 29. Bh2 Qa1": "I never understood this move. It is a mistake because I win a pawn (the c-pawn is unprotected).\r\n\r\nEvery move your opponent makes leaves something behind, and when you are attacking or counterattacking, you need to find your opponents weaknesses and act on them.",
        "30. Bxc7 Rc8 31. Bh2 Kg7": "Protecting the f-pawn; that's what 30. ...Rc8 left behind, the defence of the f-pawn.",
        "32. Bd6": "My bishop was awful and useless on h2, so I plan to move onto a better square (c3) via h2-d6-b4-c3.",
        "32... Qd1 33. Bb4 Rc2 34. Qf3 Qd4+ 35. Kh2 Qxb2 36. Qb7+": "I was very unhappy at this point. I was heavily attacked, with black's queen and rook in good position to both win material and hunt my king.  After spending a long time thinking, I decided to play this move, checking black's king. I might manage to checkmate (which I did) and even if I didn't, I would get a draw by perpetual check.",
        "36... Kg6 37. Qe4+": "Another check.",
        "37... Kh6": "It's mate in 2; can you see it?",
        "38. Bf8+ Kh5 39. Qh7#": "And finally, I save myself from a losing position.  I was shocked; I was losing for most of the game and most of the time I doubted I would draw, let alone win. \r\n\r\nThis game is an example of not giving up, attacking ruthlessly, and defending intelligently."
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-bishop18?gm=18193",
    "gameName": "Challenge from bishop18",
    "players": "bishop18 (1200) vs. deebee2 (1279)",
    "opening": "Damiano's defence (C40)"
}