{
    "moves": {
        "1. e4": "This was an unrated game against beloved Joanne, and it was played by me with the idea to find a new way to go out of the overplayed lines of 1.e4. I used to play the Scandinavian, with a scheme very useful... against average players. Unfortunately, I noticed good players will crush me, so I wanted to use this unrated game to try different outcomes, knowing a loss wouldn't affect my rating. ",
        "1... Na6": "This is a weird reply. It offers white the challenge: it gives me a nasty doubled pawn on the a column, but lose the white bishop in the process, and opening the b column to my rook. A fair exchange? It was seldom played by good players, but it was sometimes. Black doesn't score well with it. But I wanted to give it a try. ",
        "2. d4": "Rejecting the exchange for now, and getting full control of the center. ",
        "2... c6": "Sooner or later, this move should be played. it opens the diagonal for the queen, and provides the knight a good square, c7. ",
        "3. c3": "White is not developing pieces, but there is no hurry, since black will lose a lot of tempoes developing. Note that Nf6 is not good to e5. \nWhite seems to have hurry to defend the black squares, probably a wise strategy. Qa5+, Bd2, Ng5 is not a good option just now, but maybe it can be in the future. \nAnyway, as white I would have been more aggressive: c4!? or just d5!?. Or to develop pieces, quickly: Be3, threatening BxN, bxB, Qa4 followed by d5 is an early break-in plan. I thought I could survive it, but probably not withouth losing and edge. ",
        "3... d6": "Another option was 3. d5, but I din't like the closed position after 4. e5. With this move, I fight for the control of e5, crucial for an easier developement of my N in f6 - which I don't like much. My plan is already to develop the dsb in g7, yes, against white's chain, but also preventing it to go further, and aiming to play c4 or e5 (d5 doesn't blocks the dark diagonal since after the exchange f6xd5, white either takes with the pawn, freeing my e to be sacrificed at the right moment in order to open the diagonal to my bishop. \nOf course, this way (f6xd5) white has the chance to check on the white diagonal, and it is not sure I won't have lost something in the process of coping with it. Qa4 is a strong attack for white, once the f6 pawn is removed. \nThis is the reason I didn't play e5, nor I plan to do it, until I ensure the white squares. And it is not easy due to the knight in a3. \nAnother option was to play Nc7, but I am not so passive.",
        "4. Nf3": "Piece developing. It gives me Bg4, but only if I want to exchange it with the knight f3, since I cannot allow it to be pushed to g6, or my dsb won't have his place to develop. So, I choosed to leave the bishop where it is, and go on with my developement plan. ",
        "4... g6": "Logical. Note both sides has almost no developement in move 4.!\nWhite has the center and much more space. Strategically, white is up. ",
        "5. Be3": "The good spot for the bishop (Bf4!?). And it is now clear white has no intention to accept the BxN plan. ",
        "5... Bg7": "So go on. Now I will block my bishop with the knight if I want to get it out quickly, but it's ok. e6-Kd7 is also possible, but it looks so passive... :-)",
        "6. Nbd2": "White is spotting no danger on the black diagonal, so correctly develops. c4 is a good uncontested outpost... not clear what for, exactly, but anyway, I didn' like it. My control of black squares compensates the loss of the center. white has to think very hard to play d5 now, until (s)he doesn't take care of a possible Bxc3 in the future. ",
        "6... b5": "I thought: let's contest some of the space white has... and decide myself that BxN is not something I have to worry about anymore. Moreover: b4 is a threat. Of course it causes more problems and weaknesses. I trusted that My lsb would be enugh to cope with this. I was wrong. ",
        "7. Be2": "Preparing castling, and just make me think how can I take advantage from this tempo. I decided not to playing games anymore, and to get serious. I have to develop, my dreams of a daring coverage of the black diagonal must be postponed, I \"had\" to develop. The plan e6 - Ne7 was not completely bad, though, just slow. ",
        "7... Nf6": "Forcing white's knight to be there to be the guardian of the e4 pawn, but of course leaving white e5, but I have Nd4 as a resource to use, if necessary. Of course, white will be \"in control\" of the game, but it's normal, it's white. ",
        "8. d5": "When I saw it, I was sure I will lose. f6 is weak. And now white has Nd4!, with all kinds of threats, with Bxb5 as a catastrophe. \nMy thinking is: be calm. Don't get nervous. Be Zen. Absorb the attack aiming to avoid overreacting, and probably you'll get out of this. What are the concrete threats? So I looked at Rb8, Qa4, o-o (a wise one, but I tend to delay castling until the very last moment, since I am obssessed in getting tempoes to consolidate my position. Castling, don't forget it, is a good defensive move, but gives the opponent a full tempo to act undisturbed developing and attacking. I will play it only as the last choice. \n\nA fancy lines, among many others (I have to write them in \"human\" notation, but I have no time to do that just now): \n\na6-c5\n9.\tf3-d4\tf6-e4\n10.\td4-c6\td8-b6\n11.\tb2-b4\te4-c3\n12.\tb4-c5\tc3-d1\n13.\tc5-b6\tg7-a1\n14.\te2-b5\td1-e3\n15.\tc6-a5+\tc8-d7\n16.\tb6-b7\ta8-b8\n17.\tb5-d7+\te8-d7\n18.\tf2-e3\ta1-c3\n19.\ta5-c6\tb8-b7\n20.\te1-e2",
        "8... Nc5": "Ah... but in threatening f6, white left a good square for my knight, too, and opened again the spectre of the Bxc3 sac. Now, I am attacking a central pawn, much more important (?) than the f6 one. The real problem is not to have a pawn in f6, but 1) to lose b4, and 2) have a knight on c6 - this is really annoyant. \nTactic exploded just the previous move. In order to play this with reasonable confidence of not being crushed stupidly, I had a \"hard thinking\". ",
        "9. dxc6": "The good thing of having a pawn in f6 is I don't have a knight over there. Good. Now, I can defend b5 (a6) and hold for the rain to come. \nQb6, defending b5 and threatening f6, was impossible due to b4, winning a piece. But weakening c3... I am an aggressive player. \n\nAnother line, just for fun:\n\nf6-e4\n10.\tNxe4, Nxe4\n11.\tBxb5,\tQa5\n12.\tQa4,\tBxc3+\n13.\tb2xB,\tQxc3+\n14.\tKe2,\tQb2+\n15.\tKd3,\tQc3+\n16.\tKxe4 (attraction sac),\tf7-f5+\n17.\tKd5,\te7-e6+\n18.\tKd6,\to-o\n19.\t(and if white doesn' react, e.g. h2-h3,\tRd8+\n20.\tKc7,\tQg7+\n21.\tKd8,\tBa6#\n\nA nice king walk into mate... But probably white can play better. And this is the danger: if he does, and comes out of this, he will win!",
        "9... Nfxe4": "Leaving b5 to the lsb! Oh, my God, I like danger. \nOk, I have Qb6. But it is just waiting for the death. I need counterplay, and this way I thought I got it.  ",
        "10. Nxe4": "For fun, I don't exchange if not completely necessary. As white, I would have ensured b5 first, then let's see. \nThe truth is now white threatens Bxg5, then Qa4, threatening the knight... but was it such a bid deal? \nMaybe Bd3 (after the knight exchange) was better. I either exchange or close the diagonal, and white should manage to play Nd4 or e5, at the right moment, to defend any threat on the f6 pawn from black. \n\n\nc5-e4\n11.\te2-b5\td8-a5\n12.\td1-d5\te4-c3\n13.\tc6-c7+\tc3-b5+\n14.\te1-e2\ta5-a6\n15.\td5-a8\tb5-c7+\n\n\nc5-e4\n11.\te2-b5\td8-a5\n12.\ta2-a4\ta7-a6\n13.\tf3-d4\te8-g8\n14.\tb2-b4\ta5-c7\n15.\tb5-d3\te4-c3\n16.\td1-c2\tc3-d5\n17.\te3-d2\t",
        "10... Nxe4": "What else? Oh, yes, Qa5. It allows BxN, and my force is reduced in white's advantage. I think BxN was a sad necessity for white even in the previous moves. ",
        "11. Bxb5": "Here, the wise one is castling, of course, and accept I lost a pawn. \nI cannot accept this so plainly. But I think I am almost lost, anyway. ",
        "11... Qa5": "Ok, so no castling. If c7+... what? Kf8 and my rook is blocked in but I'll take care of this during the tempoes white uses to castle and activate his rook. \nI don't fear b4, after the bishop is protected, because I would have Bxc3, and the black queen can retire confidently to c7 while the minor piece dancing over white's king/rook. ",
        "12. Qa4": "I wonder what white thought here. If attacking, don't exchange pieces. \nWas white \"scared\" of the threats on the black diagonal, and wanted just to loosen the pressure? But was (s)he sure I would have accepted the exchange?\nAnyway: even accepting the exchange would have given me a good edge after Nxc3. With the help or my lsb I will force the black king to the 1st row, then chop the white rook. \nDid Joanne see this?\nTo protect the knight was a must. Qb3 was another possibility, or a4 - the one I mostly was worried about. Remember white has two pieces solidly defending d2, so, while the white rook is protected by the queen, a possible BxR QxB, threatening Rh8, would have given some compensation for the rook, making the line playable. \nBut the good one, I think, was Bd4. \nAnd I would have given Qd5 a look, either. \nDid Joanne?\nI know she is not an aggressive player, but I think this was a good opportunity for her to try (it was an unrated game, remember).\n",
        "12... Bxc3+": "I was sure QxQ first was good tactics for me, but I wanted to get the most of the game, and explore more complcations. Note I cannot play here Nxc3, since my queen is hanging. Playing the bishop, I'm giving out my bishop fork (that's why I consider this a \"crazy\" move), but wait... a queen and a knight can do miracles, if well placed against an exposed king. With the quick help of the bishop, that wisely kept patiently in his place so to came out with a good purpose, and not just \"for developing\". ",
        "13. bxc3": "Trusting that his king would be safe. Did Joanne see I had at least a drawn here? ",
        "13... Qxc3+ 14. Ke2 Qb2+": "Threatening Nc3 forking king and queen. Wicked, isn't it? I've seen this. White's problem is the a1 rook... and c7+ doesn't give white a good enough compensation. My knight is hanging, and white threats Bd4, but I am checking...",
        "15. Kd3": "I thought here about a typical attraction: Qc3+, KxN, and... no mate. A lot of checks, but no mate. I started to sweat. A sac is good... unless the storm goes over and I just stay a piece down... gulp!\nFortunately, the inspiration (followed by lot of analysis), came to me. \n\n\nb2-c3+\n16.\td3-e2\tc3-b2+\n17.\te2-d3\te4-c5+\n18.\te3-c5\tc8-f5+\n19.\td3-c4\td6-d5+\n20.\tc4-d5\ta8-d8+\n21.\td5-c4\tf5-d3#\n\n2-c3+\n16.\td3-e4\tc8-f5+\n17.\te4-d5\te7-e6+\n18.\td5-d6\te8-c8+\n19.\td6-e7\th8-e8+\n20.\te7-f7\te8-e7+\n21.\tf7-e7\tc3-g7#\n\nc8-f5\n16.\te3-d4\te4-f2+\n17.\td3-e3\tf2-g4+\n18.\te3-f4\te7-e5+\n19.\tf3-e5\td6-e5+\n20.\td4-e5\tb2-f2+\n21.\tf4-g5\th7-h6#",
        "15... Bf5": "Was it or not wiser for white to play BxNc5 earlier? Yes. But it was very hard to spot it some moves before. \nNow is a mate threat, or a fork threat... white should have lost the rook, tempting me to lose a tempo and a queen playing Qxh1 too, winning precious tempoes to build his attack on my king. \nIn fact, I would have gone for a repetition checks here, for a draw. Probably. ",
        "16. c7+": "Did Bd4 have saved white? It gives e3 to the king, so after Nxf2++, Ke3, Ng4+, Kf4, d5+, Kg3... I'm not sure, but it doesn't look good for white. \nNow, if he manages to save from mate, he's still a piece above, and has a pawn in the 7th row. So maybe it was better. \nThis move is not good or bad. ",
        "16... Kf8": "What else?",
        "17. Bh6+": "...but this IS bad. The dsb is somewhat protecting the black diag f2-a7, maybe it is not enough, but it shall be there. Bd4 was the move, I think. ",
        "17... Kg8": "Now, Qd4 would be a good way out of it, if black accepts the exchange (being one move from mate). But it would be my turn checking, so: Nxc2++, Ke3, Ng4+, then NxB the least. No way. ",
        "18. Ke3 Qxf2+": "...loses the queen by a fork, if not mate. So Joanne gave up. \n\nAs a trainer (I am not), I would say: \"even if you don't want to be aggressive, think that the opponent can be. Give a look futher to \"tricky\" moves, think about any possible sac from your opponent. Think he is a kamikaze. Care about \"banzai\" attacks, crazy ones... and get mad! :-)\".\n\nAnother one? :-)"
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-jstevens1?gm=36386",
    "gameName": "Challenge from jstevens1",
    "players": "jstevens1 (1773) vs. damalfi (1775)",
    "opening": "Lemming defence (B00)"
}