{
    "moves": {
        "1. e4 c5": "E4 my favorite opening move. c5 attacks d4 & Nf3 protects  ",
        "2. Nf3 Nc6": "Nc6 adding more pressure to d4. Not too worried about that at this time so I will develop Bc4 aiming at f7",
        "3. Bc4 e6": "e6 opens diagonals for the Q & B. I think it's best to castle now.",
        "4. O-O Bd6": "Bd6 aims at h2 protected by K & N. It is time to get back to protect d4 with c3 keeping the N at bay",
        "5. c3 h6": "Not too sure why h6 and not developing the N preparing for castling",
        "6. d4": "With 3 pieces covering d4 against 2 pieces it is a good time to play d4 opening the c1 h6 diagonal ",
        "6... Nf6 7. d5": "Nf6 attacks e4, but d5 pushes the N backwards. ed is met with ed and opens the e file",
        "7... exd5 8. exd5 Ne7 9. Nbd2": "With black reversing his N I develop mine Nd2",
        "9... a6": "a6 preparing to drive the B away. Not in any danger, I move Re1 to controls the e file. ",
        "10. Re1 O-O 11. Ne4": "Black castles and Ne4 attacks the B & N. Not wanting to lose the Bishop or N x N opening the King's defense, Black's N x N and R takes N ",
        "11... Nxe4 12. Rxe4 b5": "b5 attacks the B which reverses to b3",
        "13. Bb3 c4": "c4 joins the attack and Bishop settles on c2",
        "14. Bc2 Ng6": "Ng6 clears the file for a fight so I strengthen the rear with Re1",
        "15. Re1 Ne5": "Ne5 is a mistake, it loses a piece to White and maybe the game also. N xN",
        "16. Nxe5 Qc7": "Qc7 doubles the attack on h2 hence N retreats to f3 to protect h2",
        "17. Nf3 Bb7 18. Be4": "Bb7 eyes the p at d5 so the Bishop protects at e4",
        "18... f5 19. Bc2": "f5 forces the Bishop to c2",
        "19... Rf6 20. Be3": "Not too sure of black's plan with the Rf6, I finally develop the Bishop at e3 ",
        "20... f4": "The f4 attack on the Bishop could be another mistake, it blocks the double attack on h2. the Bishop then attacks the R at f6 by going to d4.",
        "21. Bd4 Rf7": "The R retreats leaving Pawn at d5 unprotected and having control of e5 decided to trade Bishops",
        "22. Be5 Bxe5 23. Rxe5": "B x B R x B instead of N x B keeping P fixed at f4",
        "23... Qc5": "Qc5 focus on f2 could have driven the Q with d6 but have to protect  Nf3 so B is added to defend d5",
        "24. Be4 Raf8 25. d6": "With Rooks doubled protecting f4 I decided to attack Q with R and B with B pushing p d6",
        "25... Qc8 26. Bxb7 Qxb7": "Q retreats to c8  B X B got rid of the attacker of Nf3",
        "27. Qe2 Qb8": "Qe2 makes room for rear R move & supports Re5",
        "28. Rd1": "Qb8 attacks d6 & Rd1 protects",
        "28... Rf7f6 29. Red5": "Rf6 double attack d6 & Re5 to d5 secures d6",
        "29... Re8 30. Qc2": "Re8 attacks Q and is moved to control b1-h7 diagonal on c2 ",
        "30... Rfe6 31. h3": "Rf6-e6 doubles on the e file preparing to attack Q. It seems I need an escape for the K with h3",
        "31... Re6e2 32. Rd1d2": "Re2 is met with Rd1- d2",
        "32... Re2e4": "R retreats e4 supporting pf4",
        "33. Qd1": "R blocks diagonal Q is on so Qd1guards Nf3 & falls behind the Rook pair",
        "33... Re8e6": "Not sure what Re8 - e6 can do but with a piece up it seems a good time to begin trading pieces - Rd4",
        "34. Rd5d4": "Not sure ",
        "34... Qb7": "Qb2 double protect e4 but as I said it's trading time R x R Q x R",
        "35. Rxe4 Qxe4 36. Rd4": "Rd4 attacks Q",
        "36... Qb7": "Q retreats to b7",
        "37. Rxf4": "R x f4",
        "37... Rg6": "Rg6 is met with Rg4 for the trade.",
        "38. Rg4 Re6 39. Qd4": "Re6 avoids the trade & Qd4 threatens checkmate",
        "39... g5 40. h4": "g5 blocks checkmate & h4 is played to weaken g5",
        "40... Rg6": "Rg6 is played to support g5 but is driven away with h5",
        "41. h5 Re6": "Re6 is met with Nh4 ",
        "42. Nh4 Qc8 43. Ng6 Qe8": "With the pawn pinned Q e8 doubles for attack on K. Ng6 is brought forward in the attack",
        "44. Ne7+": "Ne7 + Kh7 Qd5 prepares check K with Qf5",
        "44... Kh7 45. Qd5 Qf7": "Qf7 can be met with Qf5 forcing the Q exchange but prefer pinning Rook with Re4 ",
        "46. Re4 Qf6": "Qf6 R x R continues the exchange",
        "47. Rxe6": "If Q x R    Q x Q and pd7 head for promotion.",
        "47... dxe6 48. Qb7": "If de Qb7",
        "48... Qf7": "Qf7 trying to defend the K  Qe4+",
        "49. Qe4+": "The K has two squares to go now. If Kg7 then  Qg6+ Q x Q    N x Q",
        "49... Kg7 50. Qg6+ Qxg6 51. Nxg6": ""
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-efc8?gm=45853",
    "gameName": "Challenge from efc8",
    "players": "efc8 (1395) vs. stealth-invader (1428)",
    "opening": "Sicilian defence (B30)"
}