{
    "moves": {
        "1. d4 c5 2. c4 Nf6 3. d5 b5": "Its a Benko gambit!",
        "4. Bg5": "4. Bg5 is a rare line.  Usually the bishop comes out later.  The main line is 4. cxb, a6 when white can choose to take a second pawn or push to b6.  The push is best in my opinion with white gaining the center and finding dynamic play with kingside attacks offsetting black's queenside hold.  In fact, there are many games where black doesn't find an active plan and resorts to defense.",
        "4... d6 5. h3": "I've never seen this move and I don't think it leads to much.  5. cxb or even e3 make more sense.",
        "5... Nbd7 6. Nf3 g6 7. Nc3 b4 8. Na4": "8. Nb1 holds a better future for the knight allowing Nd2 and support of the e4 advance.",
        "8... Bg7 9. e3 Nb6 10. Bd3 Bd7 11. Nxb6 axb6 12. O-O h6 13. Bxf6 Bxf6 14. Qc2 Ra5 15. Rfe1 O-O 16. b3": "Instead, 16. a3, bxa 17. Rxa, RxR 18. bxR, Qa8 19. Qb3, Qa5, ect. or 16. Nd2, Qc7 17. f4 and g4 with a normal kingside expansion.  The first line is better due to the white infiltration in the black camp on the queenside, while the second will cause an all or nothing situation for white.  The semi-open a-file coupled with the bishop on f6 become a big deal in this game and I think white needed to open lines for his own major pieces with 16. a3.",
        "16... Qc7": "16... Qc7 is better than Bxa1.  Firstly, the bishop is a way more powerful piece than the simple defender.  Secondly, with the bishop gone the black king feels a bit airy.  Sacs on g6 become a real threat.  For example:  16... Bxa1  17. Rxa1, and now f5 should be played, although, g4 followed by Nh4 may give black headaches.  If 17... Re8, then 18. Bxg6 with white having both drawing and winning chances.  Taking on a1 gives white the initiative.  Who wants to give up a positional grip to be attacked!  After black provides protection for his king with the queen on f8 or g7, then Bxa1 makes sense.",
        "17. h4 Rfa8 18. Rab1 Ra5xa2 19. Qd1 Qb8 20. h5 g5 21. Bc2 Bg4 22. Qd3 Bg7 23. e4": "23. Nxg5, hxN 24. h6, Rxc2 doesn't work.  Better than e4 would have been 23. Nd2 preparing to launch some pawns forward.",
        "23... Bxh5 24. Re3 Bxf3": "24... Bxf3!!  This move makes it possible for black to blockade the powerful queen and bishop and remove a potential attacker while preparing pressure against the weak f2 square.  ",
        "25. Rxf3 Be5 26. Rh3 Qf8": "26... Qf8! is a good move.  She wasn't doing much on the back rank and trippling on the a-file is useless.  On g7 the queen can defend and reinforce the positional grip for black.",
        "27. Bd1 Qg7 28. Rh5": "28. g3 held very little promise.  The push f4 takes a ton of preparation and black can neutralize whites efforts by trading pieces on the back rank.  Maybe a better plan was to sit tight with 28. Rf3.  28. Bh5 with hopes of blockading on the white squares leads to 28... Bf4 and the \"pigs\" are let out of there pen to play on the second rank with Rd2 and Raa2.",
        "28... Bd4": "With the bishop on d4, white's king feels a breeze beginning to blow on f2.",
        "29. Be2 Qf6 30. Rf1 Ra2a1 31. Qg3 Rxf1+ 32. Bxf1 Ra2 33. Qf3": "33. Qf3??  Unfortunately black conquers f2 no matter what but this loses a piece.",
        "33... Rxf2 34. Qxf6 Rxf6+ 35. Kh1 Rxf1+ 36. Kh2 Be5+ 37. Kh3 Rh1+ 38. Kg4 Rxh5": "Trading rooks leads to an easily won endgame.  No further comments needed.",
        "39. Kxh5 Kg7 40. Kg4 Kg6 41. g3 h5+ 42. Kh3 f5 43. exf5+ Kxf5 44. Kg2 Kg4 45. Kh2 Bxg3+ 46. Kg2 h4 47. Kg1 Kf3 48. Kh1 h3 49. Kg1 g4 50. Kh1 Bf4 51. Kg1 g3 52. Kh1 g2+ 53. Kg1 h2#": ""
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-jahdragon?gm=23461",
    "gameName": "Challenge from jahdragon",
    "players": "rathburn (1461) vs. jahdragon (1200)",
    "opening": "Old Benoni defence (A43)"
}