{
    "moves": {
        "1. e4": "I already had one game played against woody17, a long game that ended in a tough loss. But the first game was so competitive, even though I ended up on the wrong side of the ledger, that we decided to play again. This game shows that if you play mistake-free, you can get a result even against someone ranked 200 points higher...",
        "1... e5 2. Nf3 Nc6 3. Bb5": "When I'm not doing unusual openings as White, I'm partial to the Ruy Lopez.",
        "3... Nd4 4. Nxd4 exd4": "The exchange means Black will have to defend his advanced Pawn at d5. It could easily fall, but if it doesn't, it will cramp White's Queen-side development.",
        "5. O-O Bc5 6. d3": "Solidifying the center...for both players. But I felt I had to open the diagonal for my Queen Bishop, and it also blocks a future advance of Black's d-pawn.",
        "6... a6 7. Bc4 b5": "Black clearly has Queen-side ambitions.",
        "8. Bb3 d6 9. a3": "Creates a retreat for the Bishop, if necessary. A future advance of the b-pawn to freeze Black's Queen-side ambitions is also set up.",
        "9... Nf6 10. Bg5 O-O": "Both players just need to complete their Queen-side development, and the middle-game can begin.",
        "11. Nd2 h6 12. Bh4 g5": "Black weakens his King's defenses, but eliminates the pin on his Knight.",
        "13. Bg3 Bg4 14. f3 Bh5 15. Qe2": "White's development is now complete. Neither side has done much, although Black has a slight spatial advantage.",
        "15... Re8 16. Kh1 Bg6": "Black is focusing on White's e-pawn, but it's well guarded. Both players need to move their pieces to the King-side if they wish to attack.",
        "17. Rae1 Nh5 18. Ba2": "White intends Nb3, trying to remove Black's dark-squared Bishop.",
        "18... Bb6": "Black prevents this.",
        "19. Qd1 Nxg3+ 20. hxg3": "Black wins the minor exchange and weakens the defenses of White's King. However, getting pieces over to the h-file to launch an attack will not be easy, given the congestion on that side of the board.",
        "20... c6 21. b4": "Black's Queen-side prospects are cut off.",
        "21... c5 22. Nb1 Qc7": "Black is positioning the Queen for a diagonal attack on White's King-side.",
        "23. f4": "White strengthens the diagonal.",
        "23... gxf4 24. gxf4": "The exchange has opened up an avenue for Black's Queen to attack, but also created more flight squares for White's King and undoubled the Pawns.",
        "24... Qe7 25. Bd5": "Centralizing the Bishop, though with no real threats. It does make Black have to move his Queen Rook out of the line of fire.",
        "25... Rac8 26. Nd2": "Focus on guarding the e-pawn.",
        "26... Qh4+": "As expected. But Black can't get more than his Queen into the attack, rendering it less effective.",
        "27. Kg1 Bh5 28. Nf3 Qxf4": "He does win a Pawn.",
        "29. Nd2": "A tactical interlude. Black is given the opportunity to exchange Queens.",
        "29... Qxf1+ 30. Rxf1": "Black removes one of White's Rooks.",
        "30... Bxd1 31. Bxf7+": "White wins back the Pawn. After all the tactics are played out, material will be even.",
        "31... Kg7 32. Bxe8": "Black will end up ahead a minor exchange, but in the endgame, that's a difficult advantage to exploit.",
        "32... Rxe8 33. Rxd1 Bd8": "With Black having a dark-squared Bishop, White can minimize the effectiveness of the piece by placing his own pieces on white squares.",
        "34. Rf1 Rf8 35. Rxf8 Kxf8": "The Rooks come off, and the maneuvering begins. A long endgame will ensue.",
        "36. Nb1 a5 37. bxa5 Bxa5": "A pair of Pawns go. White has only one Pawn left on a black square.",
        "38. Kf2 Kf7 39. Kf3 Kf6": "The Kings move towards the battleground.",
        "40. Kf4 Bc7 41. Kg4 Kg6": "If White can exchange off his a-pawn, he can form an impenetrable barrier on the white squares.",
        "42. Kf3 Kg5 43. Nd2 Ba5 44. Nb1 b4": "This gives White his opportunity. Now if neither side blunders, a draw will result.",
        "45. axb4 Bxb4": "Notice that since every single White piece is on a white square, Black's bishop is essentially useless as an attacking piece.",
        "46. Kg3 Be1+ 47. Kf3 h5 48. Ke2 Ba5 49. Kf3": "White clearly is content with a draw. Black has no way to force a win, although he could try exchanging his Bishop for White's Knight and attempting to win in the King and Pawn endgame.",
        "49... Be1 50. Ke2": "White offers a draw...",
        "50... Bg3 51. Kf3 h4 52. Nd2 Bf4 53. Nf1 Be5 54. Nd2 Bh2 55. Nc4 Bg3 56. Nb2": "This time, Black accepts. A well-played game by both sides, and a deserved result."
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-woody17?gm=26971",
    "gameName": "Challenge from woody17",
    "players": "thehellion (1266) vs. woody17 (1440)",
    "opening": "Ruy Lopez (C61), Bird's defence, Paulsen variation"
}