{
    "moves": {
        "1. e4": "Usual Opening",
        "1... Nf6": "Threatening.",
        "2. e5": "Challenging",
        "2... e6": "not sure, maybe just wanted to get his queen out. Loses the knight as a result",
        "3. exf6": "takes...",
        "3... Qxf6": "The Queen comes out",
        "4. f3": "Prevents a Scholars Mate, which might have been the aim.",
        "4... g6": "allowing the bishop through either way, but makes an attack up the black diag very tempting...",
        "5. Nc3": "Knight blocks the queen taking the rook when I B3",
        "5... Bh6": "Bishop developed.",
        "6. b3": "now I get the bishop to threaten",
        "6... O-O": "but he castles...",
        "7. Bb2": "nonetheless, I go for it...",
        "7... b6 8. Na4": "If he hadn't castled, I would have been guaranteed a high-value piece. now I'm just threatening the queen...\nNote the knight moving and guarding in one...",
        "8... Bb7": "However, he didn't see the bishop, and so...",
        "9. Bxf6": "I get his queen at no Loss!",
        "9... Bc6": "Bishop threatening the knight, a very roundabout route",
        "10. Nh3": "Developing and giving the potential to castle...",
        "10... Bg7": "Forcing me to exchange or lose the rook..",
        "11. Bxg7": "So I do...",
        "11... Kxg7 12. Bd3": "Ready to castle...",
        "12... f5 13. O-O": "There we go.",
        "13... Na6": "again, the 'Passive' Bishop gets a kill",
        "14. Bxa6": "no covering pieces means the bishop is free",
        "14... Rae8 15. c4 e5 16. Bb5 a6": "Piece Exchange: I'm ahead and so am perfectly willing.",
        "17. Bxc6 dxc6 18. c5": "and again...",
        "18... bxc5 19. Nxc5 e4 20. f4": "If I took, he would have taken me with the pawn, then if the knight takes then I lose out to the castle. therefore, I move to safety.",
        "20... e3": "and he continues",
        "21. Ng5 e2": "Honestly Didn't expect that move. A Brilliant move, I think.",
        "22. Qe1 Re7": "no Idea... specially since he could have got the rook in exchange for a pawn.",
        "23. Nce6+": "The start of the rampage. Here, I get a Rook",
        "23... Kf6": "in exchange for nothing?",
        "24. Nxf8 c5 25. Ngxh7+": "Check, and guarded by the other knight",
        "25... Kf7 26. Ne6": "White Moves his knight, seemingly making a Mistake and leaving it unguarded",
        "26... Rxe6": "Black Accepts the offering",
        "27. Ng5+": "and the other Knight gets the rook!",
        "27... Kf6": "but the king guards just as well...",
        "28. Nxe6 Kxe6": "I made a chess puzzle from this point onwards.",
        "29. Qxe2+": "saving the rook",
        "29... Kf6 30. Rae1 a5": "my guess is he thought I would go to E6, leaving him safe from checkmate...",
        "31. Qe7#": "but I have a different plan!"
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-big_bo?gm=17537",
    "gameName": "Challenge from big_bo",
    "players": "big_bo (1019) vs. sithlord101 (1143)",
    "opening": "Alekhine's defence (B02), Mokele Mbembe (Buecker) variation"
}