{
    "moves": {
        "1. d4 Nf6 2. Nf3 g6": "Seting up the King Indian's Defense. ",
        "3. h3 Bg7 4. d5 d6 5. Qd4 O-O": "This is the defensive setup for the King's Indian",
        "6. Qh4 Nbd7 7. g4 Ne5": "Continuing to develop within the King's Indian while responding to the White Queen's position",
        "8. g5 Nxf3+ 9. exf3": "If you notice, you will see that white hasn't castled yet and that his kingside pawn structure is completely destroyed. This opens up quite a few lines for my pieces",
        "9... Nh5 10. Nd2 e6 11. dxe6 Bxe6": "All my pieces are developed and cooperate in a good way. My king is protected within the ideal King Indian setup and I can start preparing my attack",
        "12. b3 Bxa1": "Crucial mistake for white. By not paying attention, white let me take one of his rook. The game is getting better and better for black.However, black still need to pay attention as the small slip can cost the game",
        "13. Bd3 Bc3 14. O-O Bxd2 15. Bxd2 f6 16. Re1 Bf7 17. gxf6 Qxf6": "Because I was a Rook ahead, I wanted here to exchange queens and move closer to an endgame.Didn't work out that well. \r\nIn spite of losing a rook, white plays well and as you will see, causes me a few problems",
        "18. Bg5 Qg7 19. a4 h6 20. Be7 g5 21. Qb4 Rfe8 22. Qxb7 Rab8 23. Qxc7 Nf4 24. Bb5 Rec8 25. Qxd6": "White is now ahead by 3 pawns, which is more or less a good compensation for the rook.White's overall position is still more or less in danger,but overall, white is causing me a few problems on the queen side. ",
        "25... Rb6 26. Qd7 Rbb8 27. Bd6 Rcd8 28. Qe7 Nxh3+ 29. Kh2 g4 30. Bxb8 Rxb8 31. Qxa7 Rf8 32. Re3 Nxf2 33. f4 h5 34. Re5 h4 35. Rg5 g3+": "The beginning of the end for white",
        "36. Kg1 Nh3+ 37. Kg2 Nxg5 38. fxg5 Bd5+ 39. Kh3 Qxa7 40. Kxh4 g2 41. c4 g1=Q 42. cxd5 Qh7#": ""
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-lovechiefs?gm=12702",
    "gameName": "Challenge from lovechiefs",
    "players": "jflynn (1187) vs. lovechiefs (1200)",
    "opening": "King's Indian (A48), East Indian defence"
}