{
    "moves": {
        "1. e4 c6": "The Caro-Kann, a safe but passive opening ",
        "2. d4 d5 3. e5": "This is the advance variation which aims to reduce blacks space and slowly crush him.",
        "3... Bf5 4. Nf3 e6 5. Be2 Nd7 6. O-O": "All standard developing moves which gives white a small advantage.",
        "6... c5": "an attempt to break open the centre.  Simular the lines in the advance french but a tempo down.",
        "7. c3": "supporting the centre is an acceptable way to play it.  Other good moves include 7. Nbd2 and the strange looking 7. c4!?",
        "7... c4": "?! Although gaining space, it is probably not the best move as the pawn chain can be broken and it neglects development.  Developing moves such as 7...Be7 are better.",
        "8. Be3": "I tried to get my bishiop into the game before I played Nd2 followed by b3.  Maybe I should have playe 8. Nbd2 before developing the Bc1",
        "8... h6": "A total waste of a move.  What is that achieving? Develop!!",
        "9. Nbd2": "continuing my plan of gaining space on the Q-side",
        "9... Ne7": "Finally, developing the Ng1.  White is ahead on development and has an advantage.",
        "10. b3": "opening up the Q-side.",
        "10... b5": "better than 10...cxb3 11. axb3 followed by 12. c4 when white controls the Q-side and the centre.",
        "11. a4": "trying to exchange the weak a-pawn.",
        "11... bxa4 12. Rxa4": "Better is 12. bxc4 picking up the c-pawn and the a pawn.\r\n\r\nHowever, even with that slight inaccuracy, black has an issolated a-pawn, is behind in development, hasn't castled and controls less space than white.  Having said that he is still in the game but needs to get his act together quite quickly!",
        "12... Nc6": "? This blunders the pawn and doesn't get massive compensation (if any).",
        "13. bxc4 Nb6": "Blacks appears to get more into the game, a pawn down having not castled in an open position.  Sound dangerous?",
        "14. Ra1 dxc4": "Black swaps off pawns, leaving a more open position having not castled.",
        "15. Nxc4": "My plan here was to swap knights, capture the weak a-pawn and promote the c-pawn to victory.",
        "15... Nd5": "Aims to swap the N for Be3.  I'm not worried about it because the N would have made 4 moves but the Be3 has made only one.  I tried to get my c-pawn protected by a rook",
        "16. Qa4": "activates the Q, thretning the undefended Nc6",
        "16... Qc7": "Not the strongest way of defending it.  The pin is still on.  Better is 16...Qd7 when the pin is more or less broken",
        "17. Rfc1": "All my pieces are developed and are active, blacks aren't.",
        "17... Be7": "?? This ignores the pin on the Nc6 and blunders the piece (or more if black blunders)",
        "18. Na5": "This makes use of the pin and at least wins the piece.  At this point, I was expecting 18...Nxe3 19. fxe3 0-0 where white has a massive advantage.",
        "18... Qxa5": "???",
        "19. Qxc6+": "Black's only moves are 19...Kf8 and 19...Kd8 when white has a plesant choice between winning both of black's rooks and winning the Qa5.  So Black resigned.\r\n\r\nAny comments and questions can be sent to sf115"
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-sf115?gm=14920",
    "gameName": "Challenge from sf115",
    "players": "sf115 (1573) vs. tag1153 (1437)",
    "opening": "Caro-Kann (B12), advance, Short variation"
}