{
    "moves": {
        "1. e4": "This game is one I thought I played fairly well. It is good to have luck on your side also. Kings Opening. I am especially weak playing as black. Partially because the guy that got me into playing chess always let me start the games as white. I played probably 300 games as white before I ever played a game as black. Feel free to comment or point out a move I missed or even how lucky I was this game.",
        "1... e5 2. Nf3 Nc6 3. Bc4 Bc5 4. b4 Bxb4": "Evans Gambit accepted. All move up to this point are text book moves. ",
        "5. c3 Bc5 6. d4 exd4 7. O-O d6 8. cxd4 Bb6 9. d5": "Ulvestad variation. Still all fairly text book moves. But we are close to getting this game rolling. ",
        "9... Na5 10. Bb2 Ne7": "Paulsen variation. Now we roll right into the game play. ",
        "11. Bd3 Bg4": "I thought I would go ahead and come out of the gate a little aggresive. I knew I had to jump on gcah2006, to many times allowing the better player to be aggresive I get into trouble fairly quickly. ",
        "12. Nbd2 Qd7": "This move stops 13. h3. Which would be followed by blacks 13. Bxh3, and opening up the h & g files for a direct attack on the King. ",
        "13. Qc2 a6 14. Rac1": "White is stacking up on the c file which is starting to make me a little uncomfortable.",
        "14... Rc8": "This move was intended to protect c file and provoke 15. Bxg7 opening g file for an attack. ",
        "15. Bxg7": "It worked. I feel this move helped me gain a tempo (maybe not I'm faily new to this game). ",
        "15... Rg8": "This is exactly what I wanted here. Whites major pieces are stacked on the queen side and I now have a direct attack to the king. ",
        "16. Qb2 Bxf3": "An exchange I have to do to get my queen involved in the attack. ",
        "17. Nxf3": "This move is the one that sealed the deal. I think gxf3 would have been the better move. ",
        "17... Qg4 18. g3": "h3 would have definitely been stronger here. Regardless White's bishop on g7 is as good as gone. ",
        "18... Rxg7 19. h3": "Now it's over. ",
        "19... Qxg3+": "That's pretty much it. gcah2006 spanked me on our next game. It's crazy how just a couple of bad moves critically changes the game. Thank you Gavin for the game. "
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-team-member?gm=40178",
    "gameName": "Challenge from Team Member",
    "players": "gcah2006 (1673) vs. ricktaylor (1402)",
    "opening": "Evans gambit (C51), Paulsen variation"
}