{
    "moves": {
        "1. e4 e5 2. Nf3": "King's knight opening (C40) ",
        "2... b6": "Ut ur öppningsboken. 2...Nc6 är vanligast med 46-39 till vit.",
        "3. Nc3 Bb7": "+1,10 och ett bra utgångsläge om jag hade slagit Nxe5",
        "4. d4": "+0,63 och svarts bästa drag är exd5.",
        "4... Nf6": "+0,94 och bäst hade varit att slå med Nxe5, men jag ville säkra centern genom att avancera d-bonden.",
        "5. d5": "+0,24 och svart kan lätt koppla grepp genom att pinna med Bb4. ",
        "5... Bd6": "+0,57 och bäst för svart hade varit att pinna med 5...Bb4.",
        "6. Be2": "+0,30 och jag förbereder rockad.",
        "6... c6": "+0,52 och jag hade varit mer strategisk om jag planerat att pinna svarts S på f6.",
        "7. dxc6": "+0,31 och här gör svart bäst i att slå dxc6.",
        "7... Bxc6": "+5,51 och svart hänger sin L.",
        "8. Qxd6": "+5,76 och jag blockerar även svarts rockad.",
        "8... Nxe4": "+7,87 och jag vill rensa upp i centern. Ser att min D kan lösa uppgiften.",
        "9. Qxe5+": "+7,05 och min D är urstark i sitt centrala läge.",
        "9... Kf8": "+9,20 och svarts S och L hänger löst.",
        "10. Nxe4": "+9,41 och svart borde hejda min D genom ex.vis en utväxling.",
        "10... Bxe4": "+9,42 och min D kan fortsätta att rensa bort material för svart.",
        "11. Qxe4": "+9,43 och läget är lugnt nog för att göra rockad snart",
        "11... Nc6 12. O-O Ne7": "+10,39 och jag funderar på att mobilisera min mörka L på ett lämpligt sätt.",
        "13. b3": "+9,46 och jag har två diagonaler att välja på.",
        "13... f6": "+12,96 och samtliga drag är till min fördel.",
        "14. Ba3": "+14,42 och det bästa draget i den här positionen. Stärker offensiven mot svarts K och han riskerar en löpargaffel på e7.",
        "14... Kf7": "+29,04 och jag hade lätt kunnat tvinga tillbaka svarts K till f8 genom att spela Bc4+, för att sedan gaffla hans D. Men Jag vill få fart på mina torn i det här läget.",
        "15. Rad1": "+17,61 och jag är redo att påbörja avslutet på partit.",
        "15... Re8": "+25,66 och jag har några alternativ. Det ser trångt ut nere i svarts Kungsbo och jag ser att man kan pressa ner hans K till bakre raden.",
        "16. Bc4+": "Idel mattlägen, och jag väntar mig d5 eller Nd5 som parering från svart.",
        "16... Kf8": "+Matt i 2, men jag observerade inte läget fullt så noggrant. Min L på a3 pinnar svarts S och det hade kunnat utnyttjas med Qd5 och sedan matt på f7.",
        "17. Qxh7": "Det här ger snart en nådastöt det också.",
        "17... d6 18. Qh8+ Ng8 19. Qxg8+ Ke7 20. Qf7#": "Matt i 20 drag är inget dumt resultat."
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-alexxis?gm=42842",
    "gameName": "Challenge from alexxis",
    "players": "highlandt (1200) vs. alexxis (1170)",
    "opening": "King's knight opening (C40)"
}