{
    "moves": {
        "1. Nf3": "This was a Gameknot game I played.",
        "1... d5 2. g3 c5 3. Bg2 Nc6 4. d4": "She turns it into a reversed Grünfeld Defence\nhttps://en.wikipedia.org/wiki/Gr%C3%BCnfeld_Defence\nI would have preferred a reversed King's Indian Defence \nhttps://en.wikipedia.org/wiki/King%27s_Indian_Defence ",
        "4... Nf6 5. O-O e6": "I am playing one of the quieter ways of handling it.",
        "6. c4": "I suspect we are both using opening databases.",
        "6... dxc4 7. dxc5 Qa5": "I thought I may give her more problems with the queens on.",
        "8. Qc2 Bxc5 9. Qxc4": "so we both have recaptured the pawns.",
        "9... O-O": "We are coming to the end of the opening databases, and Gameknot post-match computer seems to think we both start making mistakes...",
        "10. e4": "This seems a reasonable move, seizing territory, but Gameknot computer  prefers 10. Bd2 ",
        "10... e5": "and this seems reasonable, stopping the pawn from advancing again, but Gameknot computer prefers … b6 ",
        "11. Nc3": "And here the Gameknot computer likes 11. Bd2",
        "11... Be6": "I didn't think I had any advantage here, and the Gameknot computer agrees.",
        "12. Qe2 Rfd8 13. Bg5 Bg4 14. Bxf6": "I wasn't too afraid of my pawns being doubled - I felt on an open board like this, the bishops are better than knights and the doubled pawns give an element of central control. In particular e5 is protected by a pawn now.",
        "14... gxf6 15. Nd5": "This is a good move, forcing me to defend.",
        "15... Kg7": "Like so. I now have a threat of Nd4. ",
        "16. Qe1": "Which she neatly side-steps.\n",
        "16... Qxe1": "So I take the queens off. ",
        "17. Rfxe1": "She takes back.",
        "17... Rac8": "I centralise the other rook, wondering how on earth I'm going to win this....",
        "18. Rec1 Nd4": "I advance my knight.",
        "19. Nxd4": "She takes.",
        "19... Bxd4": "I take back.",
        "20. Nc3": "And this retreat is the start of her problems, after the exchange she is left with weak isolated pawns on the queen-side and my rook can penetrate to the second rank. Clear advantage to black now.\nI would guess she was afraid that 20. Rab1 would lose a pawn, as I could exchange rooks and take on b2, but then her rook goes to the 7th rank and is very active - she would have had enough compensation for the pawn.",
        "20... Bxc3": "So I take.",
        "21. bxc3": "She takes back.",
        "21... Rd2": "I invade.",
        "22. Rab1": "She counter-attacks b7",
        "22... b6": "So I deal with that threat.",
        "23. a4": "Presumably trying to exchange off weak queen-side pawns.",
        "23... Ra2": "So I attack it.",
        "24. f3": "She hits my bishop.",
        "24... Bd7": "I attack the pawn again.",
        "25. a5": "She pushes again.",
        "25... Rxa5": "I take. I am a clear pawn up, but not only that my pieces are in dominating positions.",
        "26. f4": "Trying to exchange pawns, or close down the king side - restrict my bishop in some way.",
        "26... Kf8": "I decide to centralise my king. ",
        "27. Rcd1": "She attacks my rook.",
        "27... Ke7": "Gameknot computer doesn't like move and prefers Bg4 attacking his rook. Fritz likes Bg4 or Rc7.",
        "28. Rbc1": "And it doesn't like this move either. The reason was white could now do some exchanging - rook takes bishop, king takes back, then bishop check on h3 and white wins the exchange back. Normally when material down, a side wants to exchange pawns but not pieces, but this position is an exception. White's bishop is a bad bishop, blocked in by the pawn on e4. We will see later exactly how bad it becomes..",
        "28... Rac5": "Black piles up on c3.",
        "29. Rd3": "White defends.",
        "29... b5": "Threat - b4 winning another pawn. ",
        "30. Rcd1": "Threatening the bishop.",
        "30... Bg4": "White counter-attacks.",
        "31. Ra1 Rc8c7 32. h3 Bc8 33. Ra3 a6": "White is still in the game. the Bc8 has limited scope.",
        "34. f5": "And even less now.",
        "34... Rd7 35. Re3 Rd1+ 36. Bf1 Bb7 37. Kf2 Rc8 38. h4 Rcd8 39. Kg1": "This is a dreadful move, allowing black to obtain an overwhelming position.",
        "39... Rd8d2": "No neither white king nor white bishop can move.",
        "40. g4": "This is a slight error. better c4 immediately.",
        "40... h6": "To stop any more advances of the king side pawns. ",
        "41. Rb3": "Again, c4 immediately was called for. ",
        "41... Kd6": "This is a mistake. Better was Rc1 or Rc2 to prevent c4.",
        "42. c4": "so the break comes.",
        "42... Bc6": "I break the pin on the b file.",
        "43. Rba3 Kc5 44. Rxa6 bxc4 45. Ra7": "This is another mistake. White hasn't got the time to be chasing after the king side pawns. Best was Rc3.",
        "45... Kd4 46. Rg3 c3": "This pawn is coming!",
        "47. Rc7": "Computer thinks Rxc3 is better, but it is academic, this position is lost. I am not sure there is any need to comment on the rest.",
        "47... c2 48. Rxc6 c1=Q 49. Rxc1 Rxc1 50. Rg2 Rdd1 51. Rf2 Kxe4 52. Kg2 Rdxf1 53. Rxf1 Rxf1 54. Kxf1 Kf3 55. Kg1 Kxg4 56. Kg2 Kxh4 57. Kf3 Kg5 58. Ke4 Kg4": "and white, about to lose the last pawn throws in the sponge.\n\nMany thanks for reading. Please leave a comment or two and rate the annotation on the star system. Until next time dear reader!"
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-snehagupta?gm=61942",
    "gameName": "Challenge from snehagupta",
    "players": "snehagupta (1490) vs. charleshiggie (2039)",
    "opening": "Reti (A08), King's Indian attack, French variation"
}