{
    "moves": {
        "1. e4": "This was a close tactical game involving the Advance Variation of the Caro Kann. Although it was decided by a mistake, it is of some interest for me to analyse some of the departures from theory in the late opening and the complicated position that arose in the middle game.",
        "1... c6 2. d4 d5 3. e5": "The Caro Advance.",
        "3... Bf5": "Black gets his bishop outside his pawn skeleton - the main point in playing the Caro Kann.",
        "4. Nc3": "Preparing to go into to the aggressive Bayonnet Variation after 4 ...e6, 5. g4!? A quieter alternative, quite popular nowadays, is Short's 4. Nf3.",
        "4... Qb6": "The main alternative to 4. ...e6. Black opts to steer the game into other channels.",
        "5. Bd3 Bxd3 6. Qxd3 e6 7. Nge2": "The usual deployment for the KN, though it has its pros and cons.",
        "7... Ne7 8. O-O Nd7 9. a4": "Aiming to gain a little space on the queenside at the expense of the black queen.",
        "9... a6": "An important move, given that black plans ...c5. A white knight landing on b5 would be very problematic.",
        "10. Qh3": "Again a thematic move in this variation. The queen exerts pressure on the kingside and especially e6.",
        "10... Nf5": "The optimal posting for the knight - the question is whether it is premature.",
        "11. a5 Qc7": "This seems to be a popular move, though the theory I know says ...Qd8. The present move gives good support to the centre, but excludes the option of challenging the white queen on h4.",
        "12. g4": "Theory, as far as I know, has Nd1 at this point, preparing to break open the centre with c4. I won with that in another annotated game (vs caimig), but was a bit unconvinced by it, and opted for this aggressive lunge instead. Strategically the idea is similar, to take advantage of black's slow and slightly cramped development.",
        "12... Ne7 13. Be3": "Preparing to meet black's counter-attack in the centre. I am relying on this bishop to hold things together while I prepare to advance the f-pawn.",
        "13... c5": "The thematic counter-attack.",
        "14. f4 cxd4 15. Nxd4": "Putting pressure on f5 and e6.",
        "15... Nc6": "Preparing to exchange off the white knight as well as threatening the a-pawn.",
        "16. f5 Nxd4": "Black decides that the knight has to go.",
        "17. Bxd4 Bc5 18. Ne2": "Now the other knight will come to d4, where it in turn holds the white position together.",
        "18... Bxd4+ 19. Nxd4 Qxe5": "My plan here was to attack the e-file. First however I have to protect the knight.",
        "20. Rad1 O-O": "Getting the king out of the way, though surprisingly it is not as safe there as it looks.",
        "21. Rfe1 Qf6": "Black takes the f-file as compensation, anticipating the exchange of f-pawns.",
        "22. fxe6 fxe6 23. Nxe6 Qf2+": "This turns out to be not as dangerous as it looks. ",
        "24. Kh1 Rf3 25. Qh5 Nf6 26. Qg5": "A naive-looking attempt which proves surprisingly difficult to stop.",
        "26... g6 27. Qh6 Ne8 28. Ng5 Re3": "Black miscalculates here. On the other hand ...Rf7 is impossible, and ...Nf6 lets the rook through to e7.",
        "29. Qxh7+ Kf8 30. Ref1": "And 0-1."
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-ppr3?gm=13314",
    "gameName": "Challenge from ppr3",
    "players": "orangutan (1694) vs. ppr3 (1775)",
    "opening": "Caro-Kann (B12), advance, Short variation"
}