{
    "moves": {
        "1. Nf3": "King's Indian Attack",
        "1... d5": "Black could have transposed by Nf6",
        "2. d4": "King's Indian Attack with possibliity of Queen Gambit/Grunfeld Reverse",
        "2... e6": "Good supporting move and opening lines for Black's Kingside Bishop",
        "3. c4": "White is offering a gambit",
        "3... dxc4": "Blacks accepts the gambit which is Queen's Gambit/Accepted line c4 dxc4",
        "4. e3": "Varation. 4..b5 5.a4 c6 6.b3 Nf6 7.axb5 cxb5 8.bxc4 Nc6 9.cxb5",
        "4... b5": "Black supports is flanking attack",
        "5. b3": "Var. 5..cxb3 6.Bxb5 c6 7.Bc4 Bb4  8.Nbd2 Bc3 9.Rb1 bxa2 10.Bxa2 Ba6 11.Ba3\r\nWhite attacking c4 and trying to open the C file",
        "5... Nf6": "Developing move for Black",
        "6. bxc4": "Threaten black pawn at b5. White wins a pawn. Material is even.",
        "6... b4": "Moves to safety and creates a passed pawn.",
        "7. Bd3": "a good developing move and takes hold of b1-h7.",
        "7... c5": "supports b4 and threatens d4",
        "8. O-O": "Moves King to safety",
        "8... Bd6": "Bishop supports c5 and attacks h2",
        "9. e4": "pushing e pawn and strenghtening the center and creating space.",
        "9... O-O": "Move Black King to safety. Better is e5 leads to the exchange which wins a knight and a pawn for a bishop and a pawn.",
        "10. e5": "a good tactical move Forking Black Bishop and Knight",
        "10... Be7": "Better is Bd7  which leads to exchange 11.exd6 Qxd6 12.dxc5 Qc7 13.a3 Na6 14.Be3 b3 wins a pawn for a bishop and a pawn.",
        "11. exf6": "Threatens Black's Bishop at e7",
        "11... Bxf6": "Temporarly pins white pawn at d4",
        "12. Be4": "Counter attack and threatens Black's Rook at a8.",
        "12... Bxd4": "Black replies with its own attack of Rook at a1. Better is Nc6, which leads to 13.Bxc6 Rb8 14.Bf4 Rb615.Be4 cxd4 16.Qd3 Bb7 17. Bxh7  Kh8 wins a pawn for a knight and a pawn.",
        "13. Nxd4": "White protect Rook at a1",
        "13... Qxd4": "Pins white pawn at f2 and triple forks c4,e4 and Rook at a1.",
        "14. Qxd4": "Whites only response removes pin at f2 and releases the triple fork and threatens c5",
        "14... cxd4": "Creates a passed pawn on d4",
        "15. Bxa8": "White wins a Queen, Rook, Bishop and Knight for A Queen, Knight and two pawns.",
        "15... Ba6": "Pins pawn at c4 to Rook.",
        "16. Bf4": "Slighty better is Rd1",
        "16... Re8": "Slighty better is e5 which supports d4 and threatened Bishop at f5",
        "17. Nd2": "Protects pawn at c4",
        "17... Nd7": "Slighty better is Rc8",
        "18. Bc6": "Moves Bishop to safety and pins black's knight to rook",
        "18... Rc8": "Better is Rd8",
        "19. Rac1": "Much better is Bxd7 which is error but not fatal for white",
        "19... Rxc6": "removes the threat on Knight and wins a bishop.",
        "20. Rfe1": "Releases the pin at c4",
        "20... Rc5": "Better is f6 which wins apawn for a pawn",
        "21. Ne4": "Better is Bd6 which wins a pawn",
        "21... Rf5": "Slighty better is Ra5 which attacks isolated pawn at a2.",
        "22. g3": "Better is Rc7",
        "22... e5": "Better is Ra5 which leads to exchange and wins a rook and a pawn for a rook and a pawn",
        "23. Nd6": "Attacks f7 and e8 and threatens black rook at f5",
        "23... Rh5": "Black moves rook to safety and attacks h2",
        "24. Bd2": "Moves bishop to safety and attack b4",
        "24... f5": "pushing the pawn",
        "25. Bxb4": "Isolates black's pawn at a7 and wins a pawn",
        "25... e4": "black pushing pawns forward",
        "26. f3": "white offering a exchange to open either e or f file.",
        "26... Ne5": "Black is setting up a forking check by capturing f3",
        "27. Kg2": "white counters with king g2 stopping check but creates Nd3 forking both rooks. Better is fxe4. Allows Nf3 ",
        "27... exf3+": "Isolates pawn at d4 and Better is Nxf3 which threatens Rook at e1",
        "28. Kf2": "Ouch!!! hangs pawn at h2. Better is Kh1 which wins a rook, knight and two pawns for a rook",
        "28... Nd3+": "Hangs pawn at f3. Better is Rxh2  which wins a rook and a pawn for a rook.",
        "29. Kxf3": "Kxf3 threatens mate at e8",
        "29... Nxc1": "Black moves into a forced mate. Better is g6. Error by black which allowed mating combination",
        "30. Re8#": "White mates and wins."
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-swingmaster68?gm=1043",
    "gameName": "Challenge from swingmaster68",
    "players": "swingmaster68 (1927) vs. ylelkes (1187)",
    "opening": "Reti opening (A06)"
}