{
    "moves": {
        "1. Nf3": "stony and I have played a number of games, with each of us pounding the other sometimes and each making mistakes, though I take the cake on that one.  Here, I had to get away from e4, sicilian, ruy lop stuff and try to get him.  Reti seemed like a good choice.  KodiakJack got me thinking about it.",
        "1... d5 2. d4 Nc6 3. Nc3 g6 4. Bg5 Nf6 5. e3 Bg7": "so far, so good.  decent opening moves, getting the pieces out there.  now, the question of whether to take.  After playing the Tromp, it seems that there are benefits from exchanging here, but losing the dark-sq B is risky.  I hold my breath...",
        "6. Bxf6": "and go for the it.  It's not as good when he can ( and will ) take with the B.  Part of the allure of such a move is to ruin pawn structure.  he doesn't fall for easy stuff.",
        "6... Bxf6 7. Bb5": "Again, just making a piece immobile is a slight advantage, but any decent player will deal with this directly..",
        "7... Bd7": "like this, say.  castling also works, but does screw up the pawn skeleton",
        "8. Nxd5": "that was free. the B cut off Q protection.",
        "8... O-O": "Most of my games now see me castling later.  I have some embarrassing times when castling early leads to onslaught and no one likes that",
        "9. Nxf6+": "The forcing nature of this move is to Andy Soltis' liking and of course the messing up of the pawn struct.  moving the king is not really an option",
        "9... exf6 10. O-O": "Now, castle.  KodiakJack said around moves 10-12.  and I trust him.",
        "10... a6": "it depends on what mood I'm in...do I take or run?  with a slight point advantage, one can argue that killing the N is ok, but then a potential endgame with B vs. N is not really good for N.  run away, run away!",
        "11. Bc4 b5": "yeah, yeah..",
        "12. Bd5": "again, immobilising a piece is a viable option",
        "12... Rb8": "he doesn't let me get away with much",
        "13. Qe2": "Time to move the Q.  2B says to connect the rooks.  another person I trust",
        "13... f5": "eliminates a target pawn, though it does create a hole...",
        "14. Ne5": "for the N",
        "14... Nxe5 15. dxe5": "Now, I'm the one with the suffering pawn structure.",
        "15... Re8 16. f4": "I really fight to stay a point up",
        "16... b4 17. Qxa6": "special today; free pawns",
        "17... Bb5": "this is not my favorite point about mr. spider.  he comes up with a beautiful tactical move that forces several issues simulaneously.  I'm not hip enough to see the best way out.  Again, I hear soltis with his forcing moves and try to at least keep control...",
        "18. Bxf7+": "about the most forcing kind of move there is",
        "18... Kxf7": "course I saw this, and what follows.  a really good question I ask myself, is why do I play it anyway?  Well, didn't a master say that when all else is lost, wait and hope and pray that your opponent makes a blunder?",
        "19. Qf6+ Qxf6 20. exf6 Bxf1": "hmm, no blunder.  dang",
        "21. Rxf1": "this at least activates the R, though my advantage is gone in every respect.",
        "21... Kxf6 22. Rd1": "grab the file",
        "22... c5 23. Kf2 Rba8 24. Rd6+": "spite check?!",
        "24... Ke7 25. Rd5 Rec8 26. Re5+ Kd6 27. Ke2 Rxa2 28. Kf3 Rxb2 29. g4 Rxc2": "pawn munching.  this really prevents any risk of passers",
        "30. gxf5 gxf5 31. Rxf5 Rxh2 32. Ke4 b3": "so he has a passed pawn and i have no hope to get to it.  both Ks stand well, I'm in bad shape materially, positionally and everything-ally.",
        "33. Rd5+ Kc6 34. f5 b2 35. Ke5 b1=Q 36. Rd6+": "yet, it's just not right to give up.  again a forcing move and I, too have a passer, though with little real hope",
        "36... Kb5 37. Ke6 Rh6+ 38. f6 Qe4+ 39. Kd7 Qe8#": "Nice mate, as my friend marty would say.  One really beautiful move turned everything around.  way to go, stonyspider"
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-stonyspider?gm=28773",
    "gameName": "Challenge from stonyspider",
    "players": "roan99 (1315) vs. stonyspider (1252)",
    "opening": "Reti opening (A06)"
}