{
    "moves": {
        "1. a3 c5": "So Raymond starts developing by treating this, as though, it were the Sicilian Defense.",
        "2. b3 Nc6": "Not surprisingly, Raymond continues with his development.",
        "3. c3 Qc7": "I am, however, surprised to see Raymond bring his Queen out before continuing with his development.",
        "4. d3 Nf6": "This move, however, doesn't surprise me.",
        "5. e3 d5": "Advancing a center pawn.  Black's aim is to, obviously, control the center.",
        "6. f3 Bf5": "It's obvious.  The reason for bringing his Q out early is so that he has the option to castle long or short.  Personally, after 4...Nf6, I would've advanced the e pawn or fianchettoe'd K side.  Which would be followed by bringing my Bf8 into play and then castling short.",
        "7. g3 e6": "Getting a pawn chain.  After what I learned from Susan Polgar, although completely different, it reminds me of the London System where white plays d4, followed by Nf3, and then, Bf4.",
        "8. Nh3": "Despite it being on the rim, this is where Joe starts developing.",
        "8... Be7": "Completing his development.",
        "9. Nf2": "Getting his N to a better outpost.",
        "9... Bd6": "Now, Raymond's development is complete and has the option on which side to castle.",
        "10. f4": "I'm not sure why Joe played this, but it's interesting.  As white, I would've attacked with 10.g4, but it's an interesting position.",
        "10... Qa5": "Pinning the c pawn.",
        "11. Bg2": "Which Joe breaks by continuing with his development.",
        "11... d4": "?? Going for an exchange which Joe accepts since Raymond's Nc6 is more active, anyway.  This, however, is a blunder because of what's about to occur.  Instead, I would've played 11...g4 to prevent what's about to occur.",
        "12. Bxc6+ bxc6 13. e4": "This is where Joe goes on the attack.",
        "13... Bg6": "So, Raymond defends but is going to lose a piece because of Joe's next move which forks. ",
        "14. e5 dxc3": "Trying to prevent that, Raymond captures and gets a pawn.  His plan is to fork and promote with the passed pawn.",
        "15. Qc2": "But, Joe stops that with this move.  After which, Raymond has to decide which piece to give up.  After careful consideration, he gives up his B which since it appears less active then his Nf6.  Better, however, would be to give up his N as Raymond would get another pawn, in return, which would reduce the damage.  By defending the N, black will get nothing else in return, once white takes.",
        "15... Nd5 16. exd6 Rd8": "Centralizing his Rook with the idea being to win back a pawn.",
        "17. Ne4": "Joe's thought is that if Raymond takes, he'll exchange.  So, white's goal is that since his Bg6 has to be more active then his Nd5.",
        "17... f5": "But, like with my game against Ken, Raymond refuses by attacking the N.",
        "18. Nexc3": "After which, Joe takes.",
        "18... Rxd6": "And, Raymond takes back, as now, white's passed pawn is gone but remains a piece for pawn up.  Afterwhich, both sides castle short.",
        "19. O-O O-O 20. Na4": "Targeting the pawn.  Either way, that pawn cannot be protected since both are doubled.  This is significant because in the course with Susan, she explained that doubled pawns become a problem in a situation like this.  That is, where they're doubled and you can't undouble, as it later allows an attack which would be unavoidable.  After that, one of those pawns is gone, and you're left with problems which is happening here.",
        "20... Bh5 21. Nxc5 Qb6": "I don't see the point of this move since Raymond isn't going to win back a pawn or piece.",
        "22. Bb2": "Meanwhile, Joe continues with his development.",
        "22... Ne3": "Not to my surprise, Raymond attacks the Queen.",
        "23. Qc3": "Which Joe protects, and has a threat against Raymond which is nasty.  And, I studied a similar example in the course that I took which will prove to be overwhelming.",
        "23... Qc7 24. Re1": "As now, Raymond faces pressure, even after protecting his Ne3.",
        "24... Nd5 25. Qe5": "It would appear that the pressure was over since Joe's Queen was attacked, but at the very least, that is, with three attackers against one defender, Raymond will, at best, lose another pawn.",
        "25... Qf7": "?? But, with this move, he is going to lose his Rook.  And, this is where I consider it to be a lost position for black.  And, with that being said, I more then likely, would resign here because black does not have enough compensation or counterplay.",
        "26. Qxd6 Qe7": "Going for a Queen exchange, which Joe is more then happy to accept since he's far ahead.  And, after he liquidates, white is going to win, yet, another pawn.",
        "27. Qxe7 Nxe7 28. Nxe6 Rf7": "Protecting his Rook, but it does not matter because of Joe's next move.",
        "29. Ng5": "As now, with too many attackers, Joe will either get a Rook for N and then a pawn or a free piece, being his Ne7.  But, a Rook for N and then a pawn is also the equivalent to another piece for free.  Raymond plays, what he believes to be the best move.  But, the reality, however, is that there are no good moves that we'll keep him safe.  And, forget about more then likely because I would've resigned by white's 28th move, as this is where I'd feel that there's nothing left to learn.",
        "29... h6 30. Nxf7 Kxf7 31. Bxg7 Nc8": "Preventing white from taking the N, but Joe will now nab h6.",
        "32. Bxh6 Kf6": "Now, I'm going into something that Ken mentioned in our training game.  Not Hope Chess, necessarily, but something very similar and with the same idea.  Raymond is hoping that Joe will make an error which would allow a swindle of either a win, but more then likely a draw (stalemate I believe) in a lost position.  But, likewise, once Joe has the advantage, he does not give it back.",
        "33. Nd2": "Bringing his last piece into play.  Be it note, however, that development isn't much of an issue anymore since it's the endgame.  In other words, the idea isn't to develop for the same rules.  The idea behind connecting the Rooks is to organize and use both of them to deliver a checkmate against Raymond which is, eventually, going to happen.",
        "33... Kf7": "Afraid of this, Raymond pulls back.",
        "34. Rac1": "But, it's too little, too late.  ",
        "34... Ne7": "Protecting his c6.",
        "35. Nc4": "But, as implied above, Joe has other ideas.",
        "35... Ng8": "Still hoping for counterplay, Raymond tries to win back a piece.",
        "36. Nd6+": "Which Joe allows but will get a pawn in return, after Raymond gets out of check.  However, black thinks that he'll win back material which is part of white's plan because it's well known, that when you have a winning advantage, it's common to give something back.  That's because when the opponent takes, it makes it much easier for you.  Another good example happened in my most recent game against pagmatic68 where I coached him, which was after the KID.  But, I gave him back a Rook for my Bishop, as then, I was going to promote a pawn, once and for all.  When Mike saw that, he resigned.  However, it really doesn't as then will come a doubled check.  After which, white will get black's Nh6 leaving Raymond another pawn down.",
        "36... Kf6 37. Rxc6 Nxh6 38. Ne8+ Kf7 39. Rxh6 Bg6": "Protecting his B for now.",
        "40. g4": "So, Joe gives Raymond a pawn.  Once Raymond takes, Joe will win the last piece since black's LSB will be trapped.  And, one idea as I learned in that course to win material is by trapping which will happen here.",
        "40... fxg4 41. f5 Bxf5": "Not realizing that, Raymond takes thinking that he's saved his B.  But, Joe is going to fork, after which, there's no way out.  Once white takes that piece, mate is forced, with no way around it.",
        "42. Nd6+ Kg7 43. Nxf5+ Kf7 44. Re7+ Kg8 45. Rg7+ Kf8 46. Rh8#": "I think that the overall lesson to be learned from this game is on top of not getting overly confident, \"Don't give things away\" as Jack Stockel emphasizes.  Raymond started off with the initative when Joe didn't develop right away.  But, he lost that advantage early by overlooking the fork between his Knight and Bishop.  After which, things were going to go downhill, from then on."
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-tactical_abyss?gm=61736",
    "gameName": "Challenge from tactical_abyss",
    "players": "tactical_abyss (2377) vs. raymoz (1219)",
    "opening": "Anderssen's opening (A00)"
}