{
    "moves": {
        "1. e4": "normal ke4",
        "1... e5": "mirror",
        "2. Nc3": "pretty standard move, stops pawn moving to d5.  Protecion for e4 pawn",
        "2... c5": "Allows movement of b8 knight without trapping c7 pawn. ",
        "3. Nf3": "Again standard defence with attack on e5 pawn",
        "3... Nc6": "Protects e5 plus other bonus of reinforcing d4. possible movement of knight to d5 now maybe",
        "4. Bc4": "no. Bishop c4. Attacking f7 pawn with added benefit of taking control of the centre of the board.",
        "4... h6": "I will leave bishop at the moment and advance h7-h6 this will prevent a move to g5 with f3 knight and also stop c1 bishop coming down any time soon andallow me to freely move knight out onto f6.",
        "5. a3": "there's that move to allow the bishop an extra escape route. d3 is next i think. if this is the case then i'm gonna try and get my queen on a5 though this will probably make him castle",
        "5... Nf6": "extra defence first though and reinforces d5. i soon hope to get queen pawn here ",
        "6. d3": "ah yes thought so. do i move queen now i wonder. i imagine this is to free bishop and strengthen pawns. hopefully now i have prevented his bishop from doing too much harm for now. The only problem now of course his bishop is going to d2 so queen might have to wait.",
        "6... d6": "ok. I'm making play for d5 here and hopefully take control of the centre. looking to somehow get queen ona5 bishop c8-e6 then npawn on d5. Only drawback is he could do bishop for bishop leaving me with a weakened defence. i'm going to try and look at a way to defend e6 with another piece now though moves obviously dependent on opposition",
        "7. Nd5": "ok. I did see this move. hoped he wouldn't so should have expected it. i think this is to win d5. don't think it is to attack knight as it is guarded by queen. I suppose there is a threat of the fork with queen and rook but i don't see a threat yet. probably mainly an attack e7 and c7 restricting my movement and blocking my pawn movement too. (git)",
        "7... Be6": "well bishops where i wanted it but not much use now for my plan. I'm hoping this give him something to think about. This will prevent a move to b5 with bishop ( though not a lot of use in that move ) i want his knight away from here. cant take it yet as he has pawn on it. i think bishop d2 or castle",
        "8. Nxf6+": "well was wrong about knight but at least i haveh6 pawn to protect against bishop attack. Only thing to do here now is queen. not sure of intentions at this point",
        "8... Qxf6": "remove knight. ... is he planning d3 pawn move. this might explain knight move....or is he thinking of a move down his right with his queen",
        "9. Bd2": "Interesting move. Queenside castle ? Otherwise unsure what is happening here unless maybe protecting the diagonal ready for a push",
        "9... Qd8": "retreat queen back. Not ready to bring this into play quite yet. Still looking for d5",
        "10. Bxe6": "knew about this earlier. this is to open me up ",
        "10... fxe6": "of course",
        "11. h3": "is this ready for castle",
        "11... d5": "got d5 but a bit too late now",
        "12. Nh2": "aah this has cleared things up now. I assume this is to attack king with queen...in a bit of trouble now i'm going to have to....",
        "12... Rg8": "....protect pawn to stop check ( as this will stop castle )",
        "13. Ng4": "more pressure he may even sacrifice his knight for a positional advantage.",
        "13... Qd7": "going to try and castle queen side..Thankyou g7 pawn under presssure here. hoping to get away. ",
        "14. Bxh6": "Trying to get me to take him hey. if i fell for this it would mean fork....Nice try.",
        "14... Qf7": "protect fork and trying to enhance position",
        "15. Bd2": "retreat to stop me taking bishop",
        "15... O-O-O": "got my castle at last",
        "16. b4": "i think here he is trying to get me to take this pawn so he can take my pawn which will be on b4. This will give him a clear run down the board attacking a7 pawn with rook. I think the next move would to push his pawn ( which would now be on b4) down to threaten knight on c6, forcing me to move it then bring rook down and capture a7 pawn opening up my defence.",
        "16... b5": "stop pawn progressing. tempt him into taking then i'll take with bishop. This will help remove the threat of an attack down this side",
        "17. bxc5": "he took.....",
        "17... Bxc5": "so did i",
        "18. O-O": "5remove the threat of my queen coming down to f2",
        "18... Rgh8": "just positioning here for an attack down h line.",
        "19. Be3": "i assume this is just to remove my bishop and help releave some pressure from arround the f2 square",
        "19... d4": "defends my bishop makes him move his. ",
        "20. Bg5": "moves away from my pawn and threatens my rook. i think this is more just moving the bishop than a planned attack",
        "20... Rd7": "move rook out of way. want to try and move queen and pawn now and look at getting rook on h line queen on g or h. looking at trying to apply pressre at the moment and see if i can force away through",
        "21. Qb1": "attacking b5 pawn preparing his attack down this side. I cant see too much danger here.....",
        "21... a6": "..... I'll back up my pawn with pawn then he'll move a3- a4 perhaps ",
        "22. Qb3": "i 'm thinking this is to attack e6 ? Not to sure about this....maybe this is going to be reinforced with his rook ??",
        "22... Rb7": "i'll back it up i think",
        "23. c4": "well thats stopped an attack on e6 so i think this is to take b5 a3-a4 next ?well at the minute it is looking as though he still wants to attack down this side of the board for checkmate",
        "23... Rh5": "i'll ignore this at the moment i still want to move my pawn up and get queen and rook over to h/g side",
        "24. Bd2 Be7 25. cxb5 Rxb5 26. Qc4 Kd7 27. Rab1 Rxb1 28. Rxb1 Qf8 29. Rb7+ Ke8 30. Qxc6+ Kf7 31. Bb4 Kg8 32. Qxe6+ Kh7 33. Rxe7 Qf4 34. Nf6+ Kh8 35. Re8#": ""
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-dardon?gm=18837",
    "gameName": "Challenge from dardon",
    "players": "willikizz (1462) vs. dardon (1298)",
    "opening": "Vienna game (C25)"
}