{
    "moves": {
        "1. d4": "I am annotating this for two friends from Oswestry, who were playing each other on Gameknot.",
        "1... Nf6 2. c4 e6 3. Nc3": "So it starts very conventionally. Now d7-d5 would lead to the Orthodox Line of the Queen's Gambit Declined. \nhttps://en.wikipedia.org/wiki/Queen%27s_Gambit_Declined\nOr Bf8-b4 is the Nimzo-Indian Defence https://en.wikipedia.org/wiki/Nimzo-Indian_Defence",
        "3... c5": "This is quite playable too. Now 4. d4-d5 leads to Benoni systems.",
        "4. Nf3": "But white doesn't go for that.",
        "4... cxd4": "And Black prevents the pawn advance.",
        "5. Qxd4": "I personally think this is the wrong way to recapture, as it allows black to develop the Nb8 with an attack on the white queen, gaining time.",
        "5... Nc6": "Like this. I think this looks a bit like an English opening now.",
        "6. Qd1": "The queen returns to base, but Qf4 or Qh4 could well have been considered too.",
        "6... d5": "Black advances in the centre, gaining space.",
        "7. cxd5": "White takes.",
        "7... exd5": "Black takes back.",
        "8. Bg5": "This is a mistake. White has to prevent further advance of the d pawn with e3.",
        "8... d4": "This gives black an advantage.",
        "9. Bxf6": "White reduces the black fire-power.",
        "9... Qxf6": "The correct way to recapture, as to not compromise the king side pawns.",
        "10. Ne4": "10. Nb5 was played instead in paulatica (1537) vs. fromluxembourg (1915), but white also lost. I don't think 10. Nb5 is an improvement.",
        "10... Bb4+": "Black correctly develops with tempo",
        "11. Nfd2": "White blocks.",
        "11... Qe5": "Threatening the knight as the other knight is pinned.",
        "12. a3": "White hits the Bishop.",
        "12... Bxd2+": "So black exchanges.",
        "13. Nxd2": "White has to take this way, or he loses the knight on e4.",
        "13... O-O": "Black correctly continues to develop.",
        "14. g3": "White prepares to fianchetto the white squared bishop.",
        "14... d3": "Another good attacking move, which gives white problems...",
        "15. b4": "Which white doesn't meet in the best way. 15. e3 was better threatening to take the pawn on d3 with his bishop.",
        "15... Nd4": "Black moves his knight into an attacking square.",
        "16. e3": "But now this is too late. Rc1 was needed to save his queen.",
        "16... Nc2+": "It is all over now.",
        "17. Qxc2": "The queen is going to go.",
        "17... dxc2": "And it is gone.",
        "18. Rc1": "White could have probably spared us these last moves.",
        "18... Qb2": "Another great attacking move, winning move material.",
        "19. Rxc2": "So white takes.",
        "19... Qxc2": "Black takes back.",
        "20. Bg2": "White tries to develop.",
        "20... Rd8": "Now if the knight moves, Rd8 is mate. Faced with yet more material loss, white wisely resigned.\nI thought this is extremely well played by black!\nMany thanks for reading, please rate it on the star system, and leave a comment or two to let me know how I am doing. Until next time dear reader!"
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-knight_nite?gm=61991",
    "gameName": "Challenge from knight_nite",
    "players": "vectevs (1673) vs. knight_nite (1330)",
    "opening": "Nimzo-Indian defence (E20)"
}