{
    "moves": {
        "1. d4": "I started this game, so I have only myself to blame for being whacked in fine style. :-)",
        "1... f5": "The Dutch Defence, quite common although 1...Nf6 and 1...d5 are both more usual.",
        "2. c4 Nf6 3. Nc3 e6 4. Nf3": "This is all main line theory.",
        "4... Bb4 5. Bd2 b6 6. e3 Bb7 7. Bd3 O-O": "The game has moved into a typical queen pawn setup.",
        "8. O-O d6 9. d5": "I always like to advance pawns into my opponent's side of the board, but experience has taught me always to make sure my pawn formation is well backed-up first. As e4 is being attacked by an enemy pawn, I'm not so sure this is the case.",
        "9... Bxc3 10. Bxc3 exd5 11. cxd5": "I should have seen that this loses a pawn.",
        "11... Ne4": "A \"zwischenzug\" or in-between-move - these are always hard to spot, but this one isn't too bad at all.",
        "12. Bxe4 fxe4 13. Nd2 Bxd5 14. Nb3 Qg5": "White's king is in a spot of bother. That pawn on e4 and semi-open f-file are recipes for disaster.",
        "15. g3": "Blocking any attack lines down the g-file for the moment. The problem is that this weakens h3, which would be a great square for Black's queen, and if the e4-pawn were to disappear this lets Black's bishop stab right into White's kingside. A big weakness in White's position is that the f-pawn cannot move or he e-pawn will be captured, normally or by en passant if necessary.",
        "15... Nd7 16. h4": "I am sure now that this was positionally an extremely weak move. In fact, after doing a move much like that in a similar position under the watchful eye of an IM, I was told I had \"no understanding whatsoever of positional chess\" and was a \"rubbish positional player\". I hope this was an exaggeration. But even I can see that this move leaves the king's position at the mercy of Black's queen.",
        "16... Qf5 17. Qe2 Qh3": "Yep. I could see that one coming, as I had created a massive weak spot on h3. I didn't bother trying to defend it, though maybe I would have been OK after 17.Kg2 Be6 18.Rh1.",
        "18. Nd4 Ne5": "Obviously, I don't want Black to put his knight on f3, forcing me to give up my queen. So instead I played the move that, I could see, would lead to my position being torn apart. Was that any better?",
        "19. f4 exf3 e.p. 20. Nxf3 Nxf3+ 21. Rxf3 Rxf3": "This could really hurt. White is pretty well doomed, and Black is crushing him mercilessly. :-(",
        "22. Qg2 Rxg3": "Obviously, checkmate follows soon after."
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-fatcat2?gm=19979",
    "gameName": "Challenge from fatcat2",
    "players": "fatcat2 (1368) vs. adamraoof (1950)",
    "opening": "Dutch with c4 & Nc3 (A85)"
}