{
    "moves": {
        "1. e4": "While I can't completely remember the game chat, what I remember the most in my training games with white was telling Sue that 1.e4  In it, I told her that the way to remember is what Bobby Fischer has said which is, \"Best by Test.\"  So, when you think of that phrase, remember, 1.e4  She did an excellent job remembering that.  Now, @knightrider62: another lesson to learn, as vesper plays it and you see it a lot is that 1.d4 is also common.  Some people also refer to that as best by test.  But, the reason that 1.e4 is better to learn is that the common lines do not require as much complications, so it's easier to remember.  As key technique, as I learned from Susan Polgar is that the one thing you don't want to do with openings is to memorize them.  So, after that lesson, I replied and told Susan that I agreed.  That, for example, I had to do that with the Siclian Defense as he made me practice the Open Variation until I memorized that by heart, and it took a lot longer and was much more complicated.  And, this was before my rating reached 900.",
        "1... e5 2. Nf3": "I am already impressed with Sue.  Not only has she improved, but she also remembered this line without needing to memorize anything, which is a plus.  All I said was that after 1...e5, 2.Nf3 was the most common response as it can lead to things like the Ruy Lopez or two Knights Defense.  In part, because 2.Nf3, starts developing very early, and as we know, one of the important things; even when exceptions to guidelines do occur is that, you want to develop your pieces, control the center, and get the K to safety.  This is such an important moral because, even GM's have lost by failing to do that. ",
        "2... Nf6": "Now, I also told Sue that interesting things could happen here.  For example, if 2...Nc3, we could get into the well known Ruy Lopez with 3.Bb5 or the Guaco Piano with 3.Bc4.  But, she played this against me, and I told her it was fine as there are still plenty of variations, and it still develops.  She also remembered that.",
        "3. Nc3": "In that game, she was black and I was white, that was the second.  The first, was me as black and her as white.  In both instances this move was played, and I told her that it was solid for the same reason.",
        "3... Nc6": "This was also played in both our games, and I told her that now, we have the Four Knights Openings since it involves the e pawn and both Knights.",
        "4. d4": "This is also well known because now we go into the exchange variation.",
        "4... Nxd4": "? But, this is a mistake.  @vesper2: Better was 4...exd4  Then would come 5.Nxd4, Nxd4 6.Qxd4, and it's still even.  Yes, this is a time where you'd deviate and bring the Q out early to avoid the loss of a piece for a pawn.  In fact, that line has been played in several of my games against Jack Stockel.  ",
        "5. Nxd4": "?? On the other hand, this is a blunder.  The reason being is that white could've won a pawn.  But, now black can win a piece, in return.  With that being said, @knightrider62: Better was 5.Nxe5, no you might think that it doesn't win a pawn because of 5...Nxe4??, but due to your N on c3 it would be a blunder, as now, you'd win a piece in return with 6.Nxe4.  The reason why this is a blunder, however, is that black can win your N for his e pawn, as we're about to see.",
        "5... Bb4": "?? Waisting no time at all, black pins the N.  It looks good, but @vesper2: when you think you see a good move, look for something better.  With that being said, best was 5...exd4 6.Qxd4, and you would've won back a piece for a pawn, and things would be level.  But, with this move, it's no longer possible.  So, you will wind up behind, when all is said and done.",
        "6. Nf5": "! That's because white sees the threat.  Well done, Sue!",
        "6... Nxe4": "However, black get does gets a pawn back since the N is pinned.  ",
        "7. Bd2": "! But, white breaks a nasty pin.  In our training session I told her that bringing the B out like this is the most common way to break the pin.  The reason why you don't break it with the pawn is that then you'd wind up with doubled pawn, after ...BXN, followed by PXN, which you often don't want, and it usually happens around the K which would destroy the pawn structures around it.  In this position, however, he could still double up her pawns, but I am proud that Sue remembers what I've taught her.  Yes, as you might guess, it makes the teacher very proud.  And, this pin happened to be quite bad as black was threatening to win another pawn.  So, white found a way out.",
        "7... g6": "Very understandable, as the plan is the gain of tempo.  But, as noted, black could still double her pawns.  With that being said, @vesper2: Best was 7...Nxc3 8.Bxc3, Bxc3 9.bxc3 and white's pawn structures are weakened.  And, being that the DSB is a bad bishop, and her good bishop isn't developed, yet, it would be very difficult to compensate for this.",
        "8. Ng3": "Making what I mentioned earlier impossible because now if 8...Bxc3, white can answer with 9.Nxe4, and if then 9...Bxd2, white can respond with 10.Qxd2 or 10.Nxd2 and remain ahead with a very solid pawn structure.",
        "8... f5": "? Yes, it does protect black from the loss of a piece.  However, Sue is going to win another pawn, though.  With that being said, @vesper2: Better was 8...Nd6, better was 8...Nf6, as now, you wouldn't lose anything else.",
        "9. Ngxe4 fxe4 10. Nxe4 a5": "Adding protection to his DSB.  But, @vesper2: In this position, it's better to retreat.  The reason being is that white can now force an exchange.  Might not seem bad since it's even, but the problem is that your behind which becomes liquidation.  Liquidation=an exchange when behind, and it's not so bad with pawns.  However, the last thing you want to do is exchange pieces when down because this will give you less to defend with, in the endgame.  That's why it's well known that many players will go for liquidation when ahead, and several players have won.  In fact, I lost two games by making mistakes that resulted in liquidation when behind.",
        "11. a3": "Putting pressure on the B.  But, in this position, I would've played 11.Bxb4, for the reason outlined above.",
        "11... Bxd2+": "?! @vesper2: For that very same reason, this was not a good choice.  Better would've been to retreat it. ",
        "12. Qxd2 d5": "Trying to get immediate compensation.  I know because back in the day, this is the kind of thing I used to do after losing material.",
        "13. Ng3": "But, white doesn't allow it.",
        "13... Rf8": "Putting pressure on the f file.  But, @vesper2: I would've played 13.0-0 here because K safety is very important.  The idea in the openings are to develop your pieces, control the center, and get the K to safety.  Getting the K to safety=castling.",
        "14. O-O-O": "With that being said, Sue follows advice that I've previously given her and does that.  Usually, though, castling K side is better so that pawn structures aren't open around the K which leave the monarch safer.  But, in this position, there's nothing wrong with the move played as the monarch is very well protected.",
        "14... h5": "This time, I have no idea why Gus played this.  But, I would have developed my final piece here.",
        "15. h4": "! For white, however, it is a different story and Sue made the right choice.  The idea was to prevent to the immediate 15...h5  And, this is the time where one must deviate.  If she brought her LSB out, and black played 15...h5, her N would have no good squares, except for Ne2.  Therefore, 16.Ne2 would be the only option.  But, this time, it would be crammed.  And, by crammed, I mean that there would no other outposts.  Despite being ahead, this is certainly a way to go wrong.  For example, I went wrong against a much stronger player by allowing him to attack my N in such a way that it was forced to go back to the second rank, without any other outpost.  That soon led to this happening with my other N.  Right after being forced to cram both N's, things went downhill, but that is where I went wrong.  In other words, that was what sealed my fate, in the long run. ",
        "15... c5": "Why does he continue pushing pawns, when the time could be used to develop his remaining piece?",
        "16. Qc3": "? This exploits a weakness that black just created for himself due to this, potential fork.  However, it is a mistake as black can win back a pawn.  Unlike before, I am not sure what the best move was.  ",
        "16... Qd6": "Very understandable as this protects both pawns.  But, @vesper2: Best was 16...d4 as you'd gain tempo, in return because if the Q moves anywhere but d2, you have 17...Rxf2  With needed time, there just might be a way to compensate on something.  When behind, one thing you want to do is get that needed time.",
        "17. f3": "To protect her f pawn.",
        "17... d4": "But, now he plays this.  However, this would've been better a move earlier, as now, white can and will protect, without the loss of time.",
        "18. Qc4": "Not exactly sure why she played this, but I would've played 18.Bb5+ to expose black's K and leave it vulnerable.  In this case, an exposed K can make a big difference.",
        "18... Be6": "? Trying to gain time with this move.  And, I understand it quite well.",
        "19. Qd3": "But, the last move was a mistake because white is the one that gains time since black must protect g6.  And, after that, white will go right after his Q and should win another pawn from there.",
        "19... Rg8 20. Ne4 Qd5 21. Qb5+": "If this were the B, it'd be understandable and would, indirectly lose time after exchanging B's.  But, by checking with the Q, black gets time because of his next move.  However, tempo gain is of little to no benefit for black due to his position.",
        "21... Bd7 22. Qd3": "Adding protection to her N, and putting pressure right on the center.  However, @knightrider62: Best was, believe it or not, 22.Qxc5 as this would've won another pawn.  You might be thinking that if I did, he'd win the Q with 22...Qxc5, but you would then be able to respond with 23.Nxc5, which not only wins something but becomes liquidation afterwards, since Q's would be exchanges.  And, when behind, the main thing one does not want is to have his or her Q exchanged since it's the most valuable piece.",
        "22... b5": "?? I am not sure why black played this, but my guess is to get a pawn chain which is generally a good strategy.  But, this is an outright blunder, as white now has an opportunity to get a family fork and win his Q.  @vesper2: Better was 22...Qe6 or 22...Ra6",
        "23. Kb1": "I am also not sure why white played this, but best was 23.Nf6+ for the reasons outlined before.",
        "23... b4": "?? With the idea of messing up her pawn structures around the K.  However, white is not going to overlook 24.Nf6+   @vesper2: For that reason and what I mentioned above, best was, still, to bring the Q to e6 or the R to a6.",
        "24. Nf6+ Kf7 25. Nxd7": "With the idea to liquidate.  But, @knightrider62: an important lesson to learn is when you think you've found a good move, look for something better.  That is well known.  With that being said, best was 25.Nxd5!  Afterall, why liquidate, when you can win his Q for free?",
        "25... Qxd7 26. Be2": "Developing her remaining piece.  The only issue is that the remaining piece is her bad bishop since her pawns block it in, but Sue is ahead which compensates for that.",
        "26... Ke7": "I am not sure why he moved here, but I would've played 26...Ke8 to give the K some protection.  As now, he might wind up in bigger trouble.",
        "27. Qc4": "It starts with this move as there is pressure on the c pawn.  This doesn't just threaten to win a pawn, but if white did this, black would have isolated pawns which is also ominous, since we're nearing the endgame.  In general, you don't want isolated pawns in the endgames, as pawn structures and pawn chains play a big role then.",
        "27... Qc7": "So, black protects.",
        "28. f4": "In this position, seeing what she plays next, Sue is trying to get a passed pawn.  The idea being that if 28...exf4 (to prevent this) 29.Bd3, with the idea of placing black in check on e1, during the move after.  And, if black doesn't capture which happens, then white brings the R behind the pawn, adding protection.  And, if nothing happens, the strategy would be to get a passer which could be quite dangerous.  My strategy would simply be the nasty check on e1, and from there, I'd look for a mating sequence.  For example, black would lose material after 28...exf4, 29.Bf3, Ra7 30.Rhe1+, Kf8 31.Bd5, Rg7 32.Qb5, and black must give up his Q to avoid mate.",
        "28... Rg7": "I am not sure why black played since he is not going to double up with 28...Rag8.",
        "29. Rdf1": "? But, as noted above, it's evident that white wants a passed pawn.  The only problem is that with his e pawn that isn't possible.  It doesn't appear that this will become possible with his Q, but you never know, as things can change.  A perfect example of this happened in a game against Jack Stockel, approximately two years ago.  It was a time where things were level, and no one won anything for a while.  Plus, we were nearing the endgame.  So, I offered Jack a draw.  But, he declined, in it asking me why.  And, I told him the reason which is what I stated.  Then, he said that I had to play it out first.  That's because as he directly told me me, \"Anything can happen, as we know.\"  Well, as it turned out, I blundered in the very win and wound up losing.  The reason being is that with mistake from my side, I resigned as he had an unstoppable passed pawn.  And, it was before I learned that just because things were level, doesn't mean that it's even.  In this case, it was that, but Jack had a slight advantage due to a very small inaccuracy I made, early on.  So, what it boils down to is don't count eggs, before they hatch.  However, this is a mistake because black wins back a pawn.  For that reason, @knightrider62: Best was 29.Qb3, and now if he takes with 29...bxa3, you can take back without allowing a nasty threat by black with 30.Qxa3  ",
        "29... bxa3 30. Ka2": "! While it might not seem so, this is the right choice by white.  In this position, black was threatening 30...Qb7 or 30...Rb8, and with his a3 pawn, mate becomes a big threat.  And, if 30.bxa3, black would still have the threat.  For example, 30...bxa3 31.bxa3, Rb8+ 32.Kc1, Qb3 33.Qa2, Ke8 Or, 32.Ka1, Qb6 33.Qa2, Ke8  If, however, 32.Ka2, black plays 32...Qb6. so no matter how you look at it, there are threats on b2 that white had to be careful about.",
        "30... Rb8": "But, this is no longer a threat, for now.",
        "31. fxe5": "?? The wrong capture as the threat is back.  It's different but powerful, as black threatens a passed which would Q, and then would end up behind.  For example, 31...axb2 32.Rb1, Qb6, with an overwhelming amount of pressure against the R on b1.  Something like that happened in a game against Mr. Stockel.",
        "31... Qxe5": "Although black recaptures, I would've played 31...axb2, for the reason outlined above.",
        "32. Bd3": "Adding protection to her Q.",
        "32... Rb4": "?? Putting pressure on her Q.  I am not sure what the best move here was, but this should lose material.",
        "33. Qa6": "But, white finds a way out.  However, @knightrider62: Best was to pin his Q with 33.Re1  And, after 33...Rxc4, 34.Rxe5+ not only have you liquidated, but you win his R as this will allow 35.Bxc4 when he gets out of check.",
        "33... Qd5+": "Preventing the nasty pin that I mentioned.",
        "34. Ka1": "Although, black will regain the other pawn and level back, this is still the best.  That's because if, instead, 34.b3?? black would mate very quickly, 34...Qxb3+. 35.Ka1 (forced), Qxb2#",
        "34... axb2+ 35. Kb1": "Like the line I gave, this is still forced, but now, there is no mate in sight.",
        "35... Rf7": "! Best.  Although white wins a pawn without compensation, she was threatening to win the g7 R starting with 36.Qf6+, but this eliminates that possibility.  ",
        "36. Rfe1+": "I like this move a lot, but @knightrider62: Best was 36.Qa7+, and black winds up in serious trouble, when he gets out of check.  For example, 36.Qa7+, Ka8, and now 39.Re1+, and how can black save the game.",
        "36... Kf8 37. Bxg6": "As noted earlier, even after 35...Rf7, white was still going to win that pawn.",
        "37... Kg7": "?? Trying to win the B, but this is a blunder, as now, white is going to win a R for B.  @vesper2: You had to retreat the R, so that it would no longer be in harm's way.",
        "38. Bxf7 Kxf7": "?? In addition, \"To take is a mistake.\"  Sure, he does get a B in return, but with this move, white can and will mate.  @vesper2: Therefore, 38...Kf8 was needed, as anything would've mated sooner.  That's because the K is confined to the seventh and eighth ranks, which is also a very bad sign.  So, the only other option, aside from taking, or ...Kf8 was 38...Kh8, but then, white would immediately play 39.Qh6#  But, on f8, despite the loss of a R without compensation, your K is better protected.  So, you would've lasted even longer.  The important thing to learn, as cplusplus11 points out is, \"You need to be aware of all threats, checks, and captures.\"  This is a perfect, as you overlooked the mate that is going to come.",
        "39. Rhf1+ Kg7 40. Qf6+ Kg8 41. Qf8+ Kh7 42. Re7+ Kg6 43. Qf6#": "Overall, this was an interesting game, but the morals to learn is that K safety is important.  For example, Sue did this, but Gus did not.  That gave Sue an advantage.  Also when you think you've found a good move, look for something better.  For example, after getting a powerful family, white exchanged N for B.  But, she could've won his Q.  And, she also could've pinned won the R, by pinning in the Q.  Likewise, on the 31st move, black could put an overwhelming amount pressure against white, had he played ...axb2+  And, despite being ahead, this might have allowed black to pull a swindle and win the game.  In addition, while 5...Bb4 appeared good, black could've equalized and might not have wounded up in trouble, had he responded with 5...exd4   Also being aware of all the threats is very important.  For instance, in the last few moves, black made a similar mistake, that I made, not that long ago.  And, yes charleshiggie annotated a similar game.  Instead of running back to f8 with his K, black got greedy and immediately retook.  Doing that allowed white to deliver this checkmate.  @knightrider62 and vesper2: Remembering this information will help you make further improvement and at a quicker speed.  I had to remember this to become, as good as, I am, today."
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-knightrider62?gm=59744",
    "gameName": "Challenge from knightrider62",
    "players": "knightrider62 (933) vs. vesper2 (898)",
    "opening": "Petrov three knights game (C42)"
}