{
    "moves": {
        "1. e4": "I have been asked for recommendations on what opening to play.  This is the one, however, that I suggest because it's the most common.  The way to remember is the phrase, \"Best by Test.\"",
        "1... e5 2. Nf3 Nc6 3. Bc4": "There is nothing wrong with this move, it's called the Guaco, Piano.  But, knightrider62 asked me very good question later on, when we played, what opening should I study.  The answer is the Ruy Lopez because that's not only common and an easy variation, but GM's really analyze it, and as we know, Jack advises me to study openings that are played by Masters and GM's.  Having said all of that, 3.Bb5 is slightly more favorable, as that's the Ruy Lopez.",
        "3... Bc5 4. Nc3 Nf6 5. O-O": "! Correct, in general, the idea is to castle in the beginning as that's how you bring the K safety.  And, K safety is essential.",
        "5... O-O 6. Re1 d6 7. d3 Bg4 8. Be3": "?! This is an inaccuracy because of what black does next.  Note: That, for the most part what the computer analysis says is exactly what black winds up playing.  But, according to the same analysis, best was 8.h3 with the idea of 8...Bxf3 9.Qxf3, Nd4 10.Qd1, Nd7 11.a4, Qh4 12.Be3, Nb6 13.Ba2, Rab8 14.Qd2, Kh8 15.Kh1  However, I disagree with this assessment.  Despite the inaccuracy, I really don't fault white for playing, and I know why she did it.  The being to complete development.  Having said that, best, in my opinion was 8.Bg5! not only pinning the Q, but also completing in the process, as well.  ",
        "8... Nd4 9. Bd5": "?! I think that white's main goal, here was to nab the pawn right near the R.  But, @knightrider62: First, there are way for black to prevent you from taking that pawn.  And, what's important is to ask what you're opponent can do and not assume well, if I play this, then that will happen.  Chess is a lot more complicated then that.  This is why my coach says, \"Start Thinking\".  By this, he means, don't assume anything.  Instead, analyze and access the position to see what your opponent can do.  Second, winning a pawn in that general area will often cause problems for you.  Yes, you'd win a pawn, but black has ways to attack, and sometimes, win a piece.  Now, according to the analysis this is an inaccuracy because of black's next move, but I disagree.  I was making a point, but I don't give it as an inaccuracy.  And, while it doesn't appear so, this really is an inaccuracy because after ...BXN, normally I'd respond with Qxf3, but that would be an outright blunder to due d N, as it would lose a Q.  So, now the only other option is to take back with g pawn, which opens the K up very early, and makes the K susceptible to exposure.  While there's no weakness, yet, there's a strong weakness, because when it's opened like that, things later on, can go in there, and attack it.  For that very reason, I have to agree that best was 9.Bxd4 with the idea that after 9...Bxd4, 10.h3, Bxf3 11.Qxf3, c6 12.Reb1, Kh8 13.Ne2, Be5 14.Bb3, Qa5 15.Rf1, Qd2 16.Kh1, Rac8, and white is much safer.  The idea is to really analyze and figure out how and why a certain move loses material.  A lot of times, it doesn't appear so, but there are things behind which is why the threat is there. ",
        "9... Bxf3 10. gxf3 c6 11. Bc4 d5 12. exd5 cxd5 13. Bb3": "? The idea is to get a good outpost for the B.  According to the computer analysis this is a mistake because of how black responds.  Normally, I would disagree and only call it an inaccuracy because it leaves doubled pawns away from the center which is something that you do not want.  However, that's certainly better then doubled around the K or right in the center.  The reason I must agree, however, with the computer is that white will lose another pawn.  Best move might have lost one pawn, but what she played will lose two.  Having said that, the best move was, as it mentions is 13.Bb5  13...a6 14.Ba4, b5 15.f4, bxa4 16.fxe3, Nd7 17.Nxa4, Ba7 18.c3, Nf5 19.Bxa7, Qg5+ 20.Kh1, Rxa7 21.Qf3 ",
        "13... Nxb3 14. axb3 d4 15. Bg5 dxc3 16. bxc3 Qd6 17. Rb1 Nd5 18. Qd2 Qg6 19. c4": "?! I understand exactly why she played this.  Right now, white is under a lot of pressure, and black's advantages are slowly increasing.  So, white is doing anything for counter play.  The computer analysis gives this as a mistake because of black does.  Well, I disagree with it, but I do give it as an inaccuracy, however, for the same reason.  In it, best was 19.Kh1 with the idea being 19...Qf5 20.Rg1, Qxf3+ 21.Rg2, Rfe8 22.c4, Nf4 23.Bxf4, Qxf4 24.Qxe4, exf4 25.Rbg1, g6 26.h4, Kf8   ",
        "19... Bb4 20. Qe2": "?? I understand exactly why white played this.  Normally, it's a very solid move with the idea being the Q in front of a R in the center.  The idea is to attack the center as that's also how you control it.  And, I've seen fine examples from GM's. For example, GM Judit Polgar win against Anand right before he became a world champion.  It was in her book, \"Victory over Anand.\"  This, however, is a mistake according to the analysis.  But, in my mind, unlike before, it's more then a mistake.  I view as a blunder because it gives away a free piece.  That's right, this move leaves that DSB en-prise, plus it's going to allow black to win a R for a B.  So, black now has a much stronger advantage.  Best was 20.Qc1  20...Nc3 would come after that  21.Kh1, Nxb1 22.Rg1, Nc3 23.Bh6, gxh6 24.Qxh6, Bc5 25.Bxg6+, fxg6 26.Qh3, Bd4 27.Qg3, Kg7 28.c5, Rf7   Although white would still lose a piece, the damage would not be as severe as he'd be down 5 points, as opposed to, 7.  ",
        "20... Qxg5+ 21. Kh1 Nf4 22. Qf1 Bxe1 23. Rxe1 Qh5 24. c5": "?? The idea was to get a passed pawn.  I like the intention because passed pawns are generally dangerous and ugly.  However, white can and does prevent the that.  Even if he brought one of those R's to c8 the idea would work, and that's what I mean when I talk about bringing that R in front of a pawn like that, to stop the opponent from getting a passed pawn.  But, what white plays is far worse, and it is going to lose a Q for a N, which is why this move is a blunder.  In fact, this is was the plan behind 23...Qh5 which is why it's also important to think and plan ahead.  I'm going by the anlaysis reveals as I agree.  The best move here was 24.Re3 to prevent.  And, this time, I do not completely agree with what the anlaysis said because the line they gave also loses a Q.  There would've been ways to protect it had white played that.  ",
        "24... Qxf3+ 25. Kg1 Nh3+ 26. Qxh3 Qxh3 27. Rxe5": "?? I also understand what happened here.  Since black has a winning advantage, white's going to do what she can to compensate.  However, while black had a winning advantage, this move loses immediately for white.  Now, with best from knightrider, black has a mate in 7.  27...Rae8 28.Re3, Rxe3 29.fxe3, Qxe3+ 30.Kg2, Qf4 31.c6, Re8 32.Kh3, Re2 33.cxb7, Rxh2#  Instead, best would've been 27.Re3 as now 27...Qg4+ 28.Kf1, Rac8 29.c4, Qd1+ 30.Kg2, Qxb3 31.Kg3, Rfd8 32.d4, Qxc4 33.dxe5, Rxc5 34.Kf3, Qf1 and while black has an overwhelming advantage, there are still no immediate mate threats with this. ",
        "27... Rae8 28. Rd5": "?? A blunder which will lead to an immediate.  Sure, it was still mate, but it would've been in 7 moves, had white played 28.Re3 because white's R prevents R from delivering right on the back rank.  But, with this move, black has an immediate mate in one which he does take advantage of.",
        "28... Re1#": "Overall, this was a very enjoyable game.  And, white played extremely well where.  But, the main moral is always plan ahead and ask what your opponent is planning to do.  Does a certain move lose material, result in mate.  If the answer is yes, then it is better not to play that move.  That's the reason that why is the most common question.  It's because you don't know if a move is good or not, unless you know what makes it so.  This is also why it's important to be a spectator of your own game, as easy19 puts it and look at everything, not just one or two moves.  @knightrider62: You have gotten better as after this game, we played each other, and I was very impressed at your performance.  If you can remember this lesson, you're play will improve tremendously."
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-geniusacamel?gm=56358",
    "gameName": "Challenge from geniusacamel",
    "players": "knightrider62 (858) vs. geniusacamel (2271)",
    "opening": "Giuoco Piano (C50), four knights variation"
}