{
    "moves": {
        "1. e4": "1. e4 - let's keep it simple - JS.",
        "1... e5": "1....... e5 (and ID replies in kind).",
        "2. Nf3 Nc6 3. d4": "3.  I decide to play the Scotch Opening - Kasparov has played this - must be good!! - JS",
        "3... exd4 4. Nxd4 Bc5": "4.  .... The knight is twice attacked, so .......",
        "5. Be3": "5. Be3 - I try not to move the same piece twice.  Be3 develops a piece and the knight is defended twice.",
        "5... Qf6": "5. ........ Qf6 (\"I have to keep this pressure on, I have to keep this pressure on!!\" - quoted from Spandau Ballet by the way).  The knight is attacked once more, so.....",
        "6. c3": "I defend it again with a pawn - 6. c3! - Now what's next Ion?",
        "6... Nge7": "6. ....... Ng-e7 (develops a piece and prepares castling).",
        "7. Be2": "7. Be2 - now I return the complement.",
        "7... d5": "7. ........ d5 (hello, hello, hello - should I capture the pawn?).  No, thinks I because if I do he will take with the e7 knight and put my bishop under pressure, which is supporting my nicely positioned knight.  I have to move the same piece twice to back up the e pawn so I play ........",
        "8. Bf3": "8. Bf3.  Now let's see what happens ......",
        "8... dxe4": "8. ...... dxe4 (now follows a plethora of exchanges over the next few moves leaving me with an IQP, grr and double grr - not good against a player nearly 500 points north of my rating!)",
        "9. Bxe4 Bxd4 10. Bxd4 Nxd4 11. Qxd4 Qxd4 12. cxd4 c6": "12. ...... c6 (what's this, an outpost for the knight on d5 I suppose).  This could be the plan if Ion plays Be6.  How do I prevent this, I know, by playing ........",
        "13. Nc3": "13. Nc3! (a developing move and it challenges control of the d5 square).  I have now come through the opening unscathed and in fact I now have a slight development lead!  So far, so very good!",
        "13... Be6": "13. ........ Be6 (catches up with development) and so, what do I do here?  Castle queenside!!",
        "14. O-O-O": "14. 0-0-0!  Good move because it completes my development, connects the rooks and backs up the d pawn instantly.  With the queens off the board I think my king is better placed nearer the centre than on the kingside.",
        "14... Rd8": "14. ....... Rd8 (attacks the d pawn but I got the defense tempo in first - but will it do any good?).",
        "15. Rd2": "15.  I prepare to double rooks.  The white king is a good defender of the rooks and helps me keep control of the vital open d file.",
        "15... O-O": "15. ..... 0-0 (so Ion finally castles and he too is fully developed).  I then follow through with my plan.",
        "16. Rhd1": "16. Rh-d1 (I now have control of the d file, but for how long?).  Ion replies with Nd5 and we have another plethora of exchanges leading to a double rook ending).",
        "16... Nd5 17. Nxd5 Bxd5 18. Bxd5 Rxd5 19. Re1": "19. Re1! - Good move.  What do you think I am up to here? I have one obvious threat and one very dark, hidden one which may bring my opponent and his Oh so snug as a bug King a very rude awakening if his bullying rooks gang up on my poor little d pawn, gobble it up and he fails to create a luft!  I will leave any reader to guess what dastardly plans are afoot here!!!",
        "19... Rd7": "19....  But Ion stops this little game by retreating his rook to d7.  What shall I do next?",
        "20. Re3": "20. Re3 (I try another idea - how about destabilising Ion's queen pawn structure in order to facilitate exchanging d for c pawn?).  I now look at the number of moves played and gosh, I have survived the first 20 moves without losing material and am in an endgame!).  At least I have achieved something here and nobody, not even Ion can take this away from me!  Can I keep this up until Move 30? If so this can be an even greater achievement!",
        "20... f6": "20. ........ f6 (creates luft for his king).",
        "21. Ra3": "21.  Ra3 (maybe I could induce this pawn to advance, or better still the b pawn - this will at least leave his c pawn backward so this may compensate for my IQP).",
        "21... Ra8": "21. ...... Ra8 (Ion decides to leave his pawn structure as it is, but it has made his rook passive, wow!!).  So ......",
        "22. Re3": "22. Re3 (I sieze control of the e file).",
        "22... Kf7": "22. ....... Ion activates his king with Kf7 and this prevents any ideas of doubling rooks on the e file (I have no wish to abandon my d pawn though).",
        "23. Rh3": "23.  I nibble at his h pawn with Rh3.",
        "23... h6": "23. ....... h6 (I can imagine Ion thinking - \"Not on your nelly!\")",
        "24. Kc2": "24.  Kc2 (the start of a bad plan)",
        "24... f5": "24. .....  f5 (Ion starts a roll down the kingside and I back my rook off to e3, he responds by attacking my rook with f4 and I maintain control of the e file with Rf4, he backs his f pawn up with g5 and I bolster my rook with f3).  There now follows an exchange of one pair of rooks and we are now in a rook and pawn ending by move 28).  Only two more moves to move 30.  Can I keep material even?  We'll see.",
        "25. Re3 f4 26. Re4 g5 27. f3 Re8 28. Rxe8 Kxe8 29. Kc3": "29.  Kc3? (the king bolsters the d pawn).  But I think this is where I start to go wrong.  I have a nasty feeling that I would have been much better off playing Re2  followed by Kc3 if he does anything other than play Re7.  If he exchanges the final pair of rooks I may have been OK in the King and Pawn ending.",
        "29... Re7": "29. ...... Re7 and Ion grabs the e file just as I  feared!  This game has a bit of a parallel to the one I had with bolle1 (the other 2000  rated player).  I was all right until move 29 with him!!!",
        "30. Kc4": "30. Kc4 (I now try to exchange off my IQP.  Ion obligingly falls in with my plans.  He plays his king to f7 - I think that he wants to reinforce his kingside pawns with it.  I play my pawn up to a4 to stop him playing b5 .  Ion now penetrates my position with Re1 (horrible!!!) and so I might as well swap off the pawns as planned.  I do this and we are now on move 33 with black to move.  I get past move 30 without losing material but I think that my position is going downhill but I could have still saved it if I had backed off my king instead of going for the queenside pawns).",
        "30... Kf7 31. a4 Re1 32. d5 cxd5+ 33. Kxd5 Ra1": "33.  ...... Ra1 (Ion attacks my a pawn so I defend with 34. b3).  Ion moves his king to f6.  I should have then played my king back to d4 and then my h pawn up to h3.  If Ion checked with Rc1 then I could play my king to b4, if then a4  I would then play Ka3 and if Ra1 , Kb2).  Had I done all this, I would have most probably earned half a point and 9 rating points, big kudos!).  In hindsight, however, it is 20/20 vision!",
        "34. b3 Kf6 35. Kd6": "35. Kd6 ?? (or whatever punctuation you would like to add!).  I couldn't resist those queenside pawns.  I found out during the post-mortem with Ion that I did exactly what he wanted me to do!  This plan is far too slow as the next few moves will show.",
        "35... Rb1 36. Rd3 Rb2 37. g3 Rxh2 38. g4 h5 39. gxh5 Rxh5 40. Kc7 Rh3 41. Kxb7 g4 42. Kxa7 Rxf3": "42. ...... Rxf3! - here I threw in the sponge.\r\n\r\nI made the resignation decision based on the following - although material is even I felt that he would win the race.  For a starters I could not exchange rooks as his f pawn would crown long before my a and b pawns could and they would get cleaned up fast!\r\n\r\nSo what if I don't exchange rooks.  My rook is skewered against my b pawn.  The only way I can save both is to play 43. Rd6   Ke5, 44. Rb6  g3, 45. Rb5   Kd4  46. Rb4   Kc3 (the checks run out!), 47. Kb7 g2, 48. a5 g1/Q.  So that line loses, can we try another?\r\n\r\nThere is, but....\r\n\r\n43. 43.Rd1 Rxb3 44.a5 g3 45.a6 g2 ... \r\nNow White can't play 46.Kb7, not while Black's rook occupies the b-file, and Black would like to see this state of affairs continue, preventing the pawn's promotion. {Typical case of dead wood at the top stymying young talent... ;-)}. Meanwhile, ...f3 is threatened. Can White cover the king's attempt to clear the b-line? 46.Rd6ch Kf4 47.Rb6 g1=Q leaves the White rook pinned, with a quick mate to follow.\r\n\r\nThere is a stalemate try that doesn't quite work: 43.Rd1 Rxb3 44.a5 g3 45.a6 g2 46.Ka8 f3 47.a7 f2 48.Rb1.  Now, 48...Rxb1 is stalemate, and Black can't promote either (e.g. 48...g1=Q 49.Rxg1 g1=Q stalemate). What to do? Simply: 48...Ra3 49.Kb8 g1=Q wins. \r\nThere was a possibility in this ending that I would have to give up the rook for your a-pawn (the b-pawn having disappeared in the meantime), and my pawn pair, having reached the 6th rank could not be prevented from promoting. \r\n\r\nSo, resignation justified.  Never mind, good game!"
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-jstevens1-battle-of-the-wings?gm=10633",
    "gameName": "Challenge from jstevens1 - Battle of the Wings!",
    "players": "jstevens1 (1564) vs. ionadowman (2024)",
    "opening": "Scotch (C45), Blackburne attack"
}