{
    "moves": {
        "1. e4": "This game is with a former student of mine--he has great over the board play, where we usually have pretty even games-- the gift of analysis gives me an edge in computer chess, however.   Planning my standard Venetian opening.",
        "1... e5 2. Nc3 Bb4 3. Nf3": "With the aggressive Bb4, feeling I want to get another piece in play before brining out my own bishop-- usually I do Bc4 my third move.",
        "3... Nf6 4. Nxe5 Bxc3 5. dxc3 Qe7 6. Nd3 Nxe4 7. Qe2 Nc6 8. Bf4": "bishop out, so I can castle, also threatening c7 pawn.",
        "8... d5 9. f3 Nf6": "queen is pinned, so I get the pawn after all.",
        "10. Bxc7 Qxe2+ 11. Bxe2 O-O 12. O-O-O Re8": "One of my chess mentors suggested I make sure to bring my non-castled rook into play sooner.  This gives a nice excuse.",
        "13. Rhe1 Re7 14. Bf4 Bf5 15. g4 Bg6 16. g5": "Continuing to push my pawns and force the attack.",
        "16... Nd7 17. Rd2": "anticipating a battery forming, getting another guard on my bishop",
        "17... Rae8 18. Bg3 Bxd3 19. cxd3 d4 20. c4 a6 21. Kd1": "Getting one more guard on the e2 square.",
        "21... Nc5": "fork, trying to take care of the rook and/or knight.",
        "22. Bd6 Nxd3": "I needed to do some calculations here, and judged the knight capture with the rook would be the most profitable.",
        "23. Rxd3 Rd7 24. Ba3 b5 25. cxb5 axb5 26. b4 Re3 27. Kd2": "I don't mind a rook trade, but do not like the revealed check black would get",
        "27... Rde7 28. Rxe3 Rxe3": "Feeling the need to get my rook behind black's pawns and start picking them off, so set up a bishop knight trade here",
        "29. Rc1 Rxa3 30. Rxc6 Rxa2+ 31. Kd3 g6": "smart black avoids the backrank",
        "32. Rb6": "starting my pawn snacking",
        "32... Kg7 33. Rxb5 Ra3+": "another snack.",
        "34. Kxd4 h6 35. gxh6+ Kxh6 36. h4 f6 37. h5": "I though would be the most effective move here, clearing out the attack to h5 after f4",
        "37... gxh5 38. f4 h4": "mistake,  Rh3 might have been slightly better, perhaps?",
        "39. Rh5+ Kg6 40. Rxh4 Kf5 41. Bd3+": "I like this sequence of checks.",
        "41... Ke6 42. f5+ Kd6 43. Re4": "Played this to get the king out into the open, and start sending him toward the edge",
        "43... Ra4 44. Re6+": "this was a fun combination-- if king goes to d7, trying to stay in the center, I get Bb5!, if Kc7, I can march my king to c5, protecting my pawn.",
        "44... Kd7": "Bb5+ it is..",
        "45. Bb5+ Kc7 46. Bxa4 Kb7 47. Rc6": "Trying to get the fastest checkmate here..  not sure if I found it.",
        "47... Kb8 48. Kc5 Kb7 49. Kb5 Ka7 50. Rc7+ Ka8 51. Kb6 Kb8 52. b5 Ka8 53. Rc8#": ""
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-smallfry425?gm=54625",
    "gameName": "Challenge from smallfry425",
    "players": "rollowa (1604) vs. smallfry425 (1312)",
    "opening": "Vienna (C25), Zhuravlev countergambit"
}