{
    "moves": {
        "1. d4 e6 2. f4": "The Colle/Stonewall attack — rare at the pro level, but very popular among attack-happy amateurs. ",
        "2... b6": "? It seems like Black played this move automatically, just because that's what he always plays. Flexibility is important! Here, by playing d4 and f4, White has voluntarily handed Black the central light squares — especially e4. Black should have grabbed those squares immediately with either ...Nf6 or ...d5.\nAlthough the idea of weak and strong color complexes is a pretty advanced one, I think most players at the 1500 level would still see d5/Nf6 because they stop White from building a huge center. This is where it becomes so important to always be thinking flexibly and not playing on autopilot, even as early as move 2.",
        "3. Nf3": "?! White has his/her own autopilot going here — s/he is so intent on playing the Stonewall that not even the dominating central position brought on by e4! is enough to tempt him/her away from it. Thus, we head back into normal Stonewall lines.",
        "3... Bb7 4. e3 Nf6 5. Bd3 Nc6 6. c3": "This is the essence of the Colle/Stonewall — White sets up bulwarks on d4 and f4 which keep e5 in a vicegrip while leaving d5 and e4 entirely under Black's control. White will castle, play Ne5, and play for an all-out attack on h7 with moves such as g4-g5, Rf3-h3, Qh5, and Bxh7+ frequently playing their parts. White hopes that the blocked-up center will make it hard for Black to get pieces over to the defence. This kind of attack can be devastating against the unsuspecting Black player, who may underestimate White's offensive capabilities.Of course, if White is not able to make the attack work, then the Queenside pieces will be useless and the light squares will be desperately weak, leading to a very real danger of having zero play. ",
        "6... Ng4": "? It is hard to see what the point of this move is.\nBlack should again take the e4-square under control with ...d5, followed by developing with …Be7. As …Ng4  neither controls e4 (in fact, it actively weakens Black's control of that square) nor develops a new pieces, it should not have even been under consideration.\n\nThe best explanation I can find is that Black wanted to play …f5, which is admittedly a very useful move — it controls e4, blocks the Bd3, and rules out a future f5 from White — but this should not have been a realistic goal. White has several ways to rule out …f5 (even if, in the game, White did not decide to do so).\n",
        "7. O-O": "? Autopilot. Chess is about thinking, people! Yes, even during the opening, there is a lot to think about.\nHere, Black has a) declared his intention to play …f5, which would be very annoying to White, b) moved his Knight a second time, onto a vulnerable square, and c) completely given up control of e4. Playing 0-0 shows a blissful disregard for those crucial elements of the position.\nAlthough I can't see any way to exploit the discovered attack on the Knight to win material, we can use it to win time and/or space: either 7. Ng5 Nf6 8. e4 or 7. Ne5 Ngxe5 fxe5 would leave White with a very nice position. In fact, simply playing e4 right away and leaving the discovered attack for another time may be even better. In any case, White would have built a big center, ruled out or discouraged …f5, and proven …Ng4 to be a waste of time.",
        "7... f5": "! Taking advantage of this opportunity with both hands.\n\nNow, White is going to have an awfully hard time getting any sort of attack going, since the Bishop can't get to h7 and the Queen can't get to h5. Meanwhile, Black's pieces are beginning to point menacingly towards the Black King. \n\nThis is a perfect example of how, if you do not punish your opponents' mistakes right away, they may end up doing a pretty convincing impression of good moves! White could have had a clear advantage last turn, but now the initiative is shifting over to Black.",
        "8. Qe2": "This is a step in the right direction for White — the Queen supports a future e4 (which is even more important a move than before, now that there's that barrier on f5 to break down) while allowing Nbd2 without dropping the e-pawn.",
        "8... h6": "? After a strong, purposeful move, Black falters. Sure, …g5 must have seemed a tempting plan. With the King still in the center and 4 pieces undeveloped, however, a pawn storm is a bit unrealistic. …Be7 followed by castling was indicated. In the case of h3, Black is happy to play …Nf6 and add more control to e4.",
        "9. Ne5": "? Hasty. White could have played e4 here, to open the center to devastating effect. Instead, White is trading off one of only three pieces that are doing anything, in exchange for a Knight who had no hope of otherwise participating in the game for a long time to come. (The action is all in the center and on the Kingside, and the Nc6 has no easy way to get there — all it does is block the Bb7.)",
        "9... Ncxe5": "! The correct Knight to trade, even if it does involve a sacrifice.",
        "10. fxe5 Qh4": "! Bold and uncompromising! As long as White has decided to allow a Knight to g4, might as well give it some company.\nBlack is now starting to really play with a plan.",
        "11. h3": "Not great, but what else could White play? g3 might have actually been safer — even though White's light squares look awful, there is no obvious way to break through.",
        "11... h5": "! That's more like it! Now Black is playing with a purpose, and the attack comes from seemingly out of nowhere. Note that, while Black's DSB and QR do not play, every one of White's Queenside pieces might as well be decoration.",
        "12. Nd2 d6": "Well-intentioned — Black is trying to open new lines of attack in the center while making square for the DSB. I think that either …Nh6 followed by …g5-g4, or else …0-0-0 with the same sacrifices as in the game would be more accurate, however.",
        "13. e4": "?! The idea is great — an attack on the wing should be met by a counterattack in the center. White should further his/her development with the tempo-gaining Nf3 first, though — right now, the Queen is the only piece that is at all set up to attack in the center.\n\nNote that White correctly refrains from hxg4, since after …hxg4, there would be no defense to Black's attack down the h-file.",
        "13... dxe5": "Consistent, breaking down White's center. Given that both players have neglected their own development and central play so blatantly during the opening, Black is actually able to play this line-opening move with an uncastled King and get away with it — but please, don't try this at home, folks!",
        "14. Nf3": "At last! This move was just begging to be played.",
        "14... Qf6": "A sensible retreat, holding the center.",
        "15. Bg5 Qg6 16. exf5 exf5 17. hxg4": "?? Nope, this move is still bad. \nInstead, Nxe5 Qxg5 18. Nxg4+ (White could go after the Rook with Ng6+, but that seems risky; of course Nf3+ fails to …Qe7) …Qe7 Ne5 keeps a slight edge for White.",
        "17... e4": "! Even better than hxg4, since it reduces White's counterplay.",
        "18. Bc2": "? Now is no time to get timid. Ne5! (e.g. …Qxg5 19. Bb5+ intending Rxf5) would have kept an initiative for White.",
        "18... hxg4 19. Qb5+": "? Not to the point. Ne5! was still the best.",
        "19... c6 20. Qe5+ Kd7 21. Bf4 gxf3": "! Brave, though Black had little choice. Of course, Qc7+ is not as threatening as it may seem, since White has to deal with the mate threat and has no time to grab the Bishop.",
        "22. Kf2": "?? This doesn't actually deal with the mate threat, however. Either g3 or Rf2 would have kept the game going. Then …Bd6 is practically forced, and we'll exchange off into a very favorable endgame for Black.",
        "22... Qxg2+": "Ke1/e3 leads to …Qe2 mate.\n\nAlthough the opening had some glaring innacuracies, the middlegame more than made up for it with some exciting back-and-forth play."
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-matsloch?gm=38567",
    "gameName": "Challenge from matsloch",
    "players": "matsloch (1500) vs. kmccrate541 (1527)",
    "opening": "Queen's pawn (A40)"
}