{
    "moves": {
        "1. d4": "1. d4 is the second most popular opening move in chess.  It occupies one center square (d4) and attacks another (e5).  Controlling the center is one of chess's prime directives.  The move also opens a line for the development of the bishop on c1.  It slightly improves the queen's mobility as well, and in chess, mobility is power.",
        "1... d5": "1. ...d5 has all of the virtues of 1. d4.  Notice that while 1. d4 attacks both e5 and c5, the d-pawn can never be used to fight for c4 or e4.  1. ...d5 strikes at both those squares.",
        "2. Bf4": "2. Bf4 is a finesse move.  White is planning on playing the London system, but avoids the move order 2. Nf3, 3. Bf4 for a reason that will become clearer later.  The bishop move seeks to increase white's control over the e5 square.",
        "2... Nf6": "Perfectly consistent.  The knight develops towards the center with an eye on the e4 square.",
        "3. e3": "The pawn chain f2, e3, d4 can be established without penalty because the bishop has been developed outside the chain.  If the bishop had remained on c1, its mobility would've been severely degraded, and mobility is power!",
        "3... e6": "Notice how the same move has different consequences.  The scope of the bishop on c8 is now significantly limited.  The move does shore up control over d5 and opens a line for the bishop on f8. The move makes one bishop happy, and one bishop sad.",
        "4. Nd2": "The move order is very important.  White wants to continue to develop pieces, but seeks to delay the standard Nf3.  The reason is that white wants to make as many \"normal\" moves as possible, while preventing Nh5 by black.  Nh5 might not be a serious threat, but White wishes to limit black's options as much as possible.",
        "4... Nc6": "The drawback of this move is serious.  It blocks the c-pawn.  The c-pawn will be needed in the fight for the center.  Although it is a developing move towards the center (which is usually a good thing) the minuses outweigh the pluses.",
        "5. c3": "This is the characteristic pawn structure of the London system.  The dark squared bishop is developed outside of the pawn chain and the pawns are placed on dark squares.  The light square bishop has a natural home on d3, and the knight on g1 will move to f3 followed by kingside castling.",
        "5... e5": "This is a mistake.  It costs black in two of the basic elements in chess.  The pawn could've gone to e5 in one move, so playing e6 and then e5 costs black in the element of time.  Each move is precious and none should be wasted.  It also costs black in the element of material.  A pawn is lost for no apparent compensation.  A move such as 5. ...Bd6 or 5. ...Be7 would've been preferred.",
        "6. dxe5": "Capturing with the pawn is the right way to go.  It forces black to use another move to save the knight on f6.",
        "6... Ng4": "Threatening to reestablish material equilibrium by capturing on e5.  white, however, has a natural developing move, which prevents the recapture.",
        "7. Ngf3": "This is where the knight was going to go in any case.  It now has the added virtue of guarding the pawn.",
        "7... Bc5": "The attempt to win the pawn with 7. ...Qe7 fails to 8. Bb5.  After 7. ...Bc5, however, the knight on g4 is running out of safe havens.",
        "8. h3": "White attacks the knight whose only safe square is on h6.  White would then take it with the bishop and ruin black's kingside pawn formation.",
        "8... Nxf2": "Black decides to attack instead.  Black is not well developed enough to prosecute an attack at the cost of a piece.  White's material advantage is already approaching a decisive one.",
        "9. Kxf2": "White is now up a piece.  White's king safety has been slightly compromised, but not enough to justify the loss of material.  Notice that white still has three pieces developed to black's two.  A big edge in development can justify a loss of a piece, but that is not the case here.",
        "9... b6": "Black does not have time for slow developing moves.  The move also weakens the a4-e8 diagonal.  A better try would be 9. ...f6.  After 10. exf6 Qxf6 black would be threatening 11. ...Qxf4 (white's e-pawn is pinned).",
        "10. Bb5": "White takes advantage of the weakened diagonal by moving the bishop on to it.",
        "10... Bd7": "Probably safest, but it makes 9. ...b6 a waste of time.  Time is precious in chess and ought never to be wasted.",
        "11. Qa4": "White increases the pressure along the diagonal.  The threat is to win another piece by capturing on c6.",
        "11... a5": "A threat that black ignores.  Black needed to play 11. ...Ne7 or 11. ...Nb8.",
        "12. Bxc6": "White is now up a second piece, which is an overwhelming material superiority.",
        "12... Ra7": "This move takes the rook out of the bishop's attack, but the rook has no future here.  Notice how limited the rook's mobility is, and remember that mobility is power!",
        "13. Nd4": "White wants to bring another piece into the action.  When ahead in pieces trade them, because each trade increases the extent of the material advantage.",
        "13... Qh4+": "A check which is easily parried, but it is difficult to suggest any improvement for black.",
        "14. g3": "The white king is in no danger.",
        "14... Qe7": "The queen must return or the bishop on d7 would've been lost.",
        "15. Nf5": "White takes advantage of the pin on the bishop on d7 to attack the queen again.",
        "15... Qf8": "Although this move quards the g-pawn it deprives the d7 bishop of a defender.  This results in the loss of still more material.",
        "16. Bxd7+": "This is starting to get serious.",
        "16... Kd8": "The only move.",
        "17. Bg5+": "The black king comes under more pressure.",
        "17... f6": "The only try.  17. ...Be7 loses the house to 18. Bxe7 .",
        "18. exf6": "Trying to pry open more lines to attack the king with.",
        "18... gxf6": "Again, the only try.",
        "19. Bh6": "If white cannot attack the king, attacking the queen is a good alternative.",
        "19... Qf7 20. Bg7": "20.  Bc6 is probably better, but white was looking for a quicker win.",
        "20... Qxd7": "20. ...Rg8 was the only way to avoid the loss of more material.",
        "21. Bxf6+": "This is an intermediate move.  An intermediate move is one that you make prior to making a capture that you were going to make anyway.  White was going to take the black queen, but why not pick up another pawn first?",
        "21... Kc8": "And black resigned in the face of 22. Qxd7  Kxd7 23. Bxh8, when as the Bork would say, \"Resistence is futile.\"  There were two problems for black in this game: time and material.  Sometimes chess can be a matter of counting.  Count how many times a piece is attacked and count how many times a piece is defended.  A move such as black's 9.  ...b6 left the knight on c6 undefended.  Only make such moves, if you know the piece is safe."
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-yellowlab?gm=10567",
    "gameName": "Challenge from yellowlab",
    "players": "yellowlab (1813) vs. camelotqueen (1108)",
    "opening": "Queen's pawn, Mason variation (D00)"
}