{
    "moves": {
        "1. e4": "Hi everyone. This is shena gupta from India. I am a chess leaner and prefer to play relatively fast. I am black in this game. Please give your valuable feedback for my improvement.  ",
        "1... c5": "Sicilian defense is my favorite as a black pieces.   ",
        "2. Bc4": "It seems he want to develop fast and take advantage. My best response is e6 but i would rather prefer the followup move kc6.",
        "2... Nc6 3. Nf3": "He repay as usual",
        "3... f6": "The rather week pawn at f7 pushed forward to f6 for blocking white knight move at g5 and e5 both because after the development i need my c6 knight at d4. This is the move which decide the game also. I know very well a GM level player easily humiliate me for my f6 move but my this opponent easily overlooked and make a surprise move.",
        "4. Bxg8": "BAMM!!!.........What about casting king side? At this stage i got irritated by opponent and then take time to re plan my game. Since i smell the danger of white queen at h5 which is natural due to f6 advancement. after thinking i decided to take the bishop  ",
        "4... Rxg8 5. d3": "this is simple development move and also a safe place for white knight at f3. since knight at f3 want to clear the path for launching the white queen at h5. i have so many other option but i decide to go with an experiment and instead of development decide to stop the white queen. ",
        "5... g5": "At first sight it seems a reasonably week move to me but i have plan for next three move so i decided to stick with the plan",
        "6. Nfd2": "As expected move.",
        "6... g4": "And now the rook at g8 give me immense pleasure with g4 support.   ",
        "7. h3": "As expected move and i also have as expected answer",
        "7... d6": "Developing + supporting move ",
        "8. hxg4": "He takes and so i take with bishop and kept his queen in a bit dangerous position.",
        "8... Bxg4 9. f3": "He block with pawn and i am bit relax with this. ",
        "9... Be6": "I retreat my white squire bishop in defending position. ",
        "10. Rxh7": "I do not expect this move rather.  ",
        "10... Rxg2": "i repay the same with g2 capture. I know the next plan of my opponent. ",
        "11. f4": "Yes it is. This move also prevent my c6 knight to e5 which i want to make next move for adding more pieces in attacking process. ",
        "11... Bg4": "And i answered with bishop at g4. Thanks again my rook at g file. ",
        "12. Nf3": "And this move decided that i got his queen. and i just move my rook on g-file for a check.  ",
        "12... Rg1+ 13. Nxg1": "forced move",
        "13... Bxd1": "and i am so delighted to take this. Still i know that the game is not finished. ",
        "14. Kxd1 Qd7": "So, at last i decided to send the king in safe zone and move queen to d7, which is not the best move as i pinned the e7 pawn against white rook at h7. D7 is also because i look the opportunity to push my queen at g4 with a check and take the full night. ",
        "15. f5": "he block as expected by forwarding his pawn at f5.",
        "15... O-O-O": "This move for king safety. ",
        "16. Nc3": "He finally develop his another knight. ",
        "16... Nd4": "Knight at d4 from c6 as i want to clear the path for queen at b6 in next two move. ",
        "17. Bf4": "He finished development with last piece but unable to castle......",
        "17... Qc6": "According to my plan i move my queen at c6.",
        "18. Kd2": " this is a well logical move. As i guess he want to connect his rook and other pieces for a hostile attack.  ",
        "18... e6": "This move is for clearing the path for bishop. ",
        "19. fxe6": "He takes",
        "19... Nxe6": "So i take",
        "20. Bh2": "He want to save his pieces for a fruitful attacking combination. ",
        "20... Ng5": "This move of knight is another interesting move of the game and forces rook to retreat. BUT WHERE THAT IS THE QUESTION!!! ",
        "21. Rh4": "when i saw this move....i move my queen at b6 without wasting a single moment. ",
        "21... Qb6 22. b3": "as he overlooked again a danger check",
        "22... c4": "best move at this moment and as expected he overlooked and takes",
        "23. bxc4 Qf2+": "Checked",
        "24. Nce2 Qxh4": "with this rook i did my job and the rest is just formality.........................i rest my annotation here. Please give me you valuable feedback",
        "25. Bf4 Bg7 26. Bxg5 Qxg5+ 27. Ke1 Qh4+ 28. Kd1 f5 29. Rb1 fxe4 30. dxe4 Qxe4 31. a3 Qxc4 32. Rb3 Qd5+ 33. Kc1 Bh6+ 34. Kb1 Qd1+ 35. Ka2 Bg7 36. c3 Rf8 37. Rb1 Qd2+ 38. Rb2 Qe3 39. Rc2 Rf1 40. c4 Ra1#": ""
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-velislavgp?gm=61717",
    "gameName": "Challenge from velislavgp",
    "players": "velislavgp (1512) vs. snehagupta (1572)",
    "opening": "Sicilian defence (B20)"
}