{
    "moves": {
        "1. e4": "The rematch between fatcat2 and phishbone6984. I am after revenge after really messing up in my first game against phishbone.",
        "1... e6": "The French Defence, a solid opening for Black. Black's position appears cramped and slow in many positions resulting from the French Defence, but it is tremendously hard to assault.",
        "2. d4": "The main line. If White can place two temporarily unchallenged pawns in the centre, why not do so?",
        "2... d5": "The vast majority of French Defence games end up here. Occasionally White might play 2.Nf3, but I think that this is a weak option.",
        "3. Nd2": "The Tarrasch Variation of the French Defence. The Winawer Variation 3.Nc3 Bb4 leads to the knight being pinned: the Tarrasch avoids this after 3.Nd2 Bb4 4.c3. Other possible variations from this point include the slow, blunt and often drawn Exchange Variation 3.exd5 exd5, and the Advance Variation 3.e5, possibly slightly premature but played very commonly.",
        "3... Nf6 4. e5": "The most usual move. Very similar to the Advance Variation, but played with tempo as Black's knight has to move.",
        "4... Nfd7 5. Bd3 c5": "A typical French Defence move for assaulting White's powerful extended pawn centre.",
        "6. c3": "The most common response. White is not going to allow his d-pawn to go, as the e-pawn will probably follow it.",
        "6... Nc6 7. Ngf3 Be7 8. O-O a5": "Another move common in such lines of the French Defence, restraining White's queenside pawns.",
        "9. a4 O-O 10. h3": "?! This looks to me like a complete waste of a move. I can't see that White gains anything from it, and it creates a weakness in his kingside.",
        "10... f6": "Trying to get White's cramping e-pawn off, and opening a file for my f-rook.",
        "11. exf6 Bxf6 12. dxc5 Nxc5": "As my opponent told me, he could no longer defend the d-pawn enough.",
        "13. Bc2 e5": "Black has two pawns in the centre, White has none.",
        "14. Nb3 Nxb3 15. Bxb3 Be6 16. Re1 e4": "Pushing my central pawn advantage and using it to in turn cramp White's position.",
        "17. Nd4 Nxd4 18. cxd4 Qd6": "Aha! I have a cunning plan (to quote Baldrick)! I can manoeuvre my dark-squared bishop behind my queen and make use of my open f-file to...smash into White's kingside!",
        "19. Be3 Bd8 20. Rc1 Bc7": "Proceeding with my Cunning Plan.",
        "21. Kf1 Qh2": "Well, it rather spoils the fun if his king isn't there any more...but I still have an excellent attack going on.",
        "22. Rc5 Bf4 23. Bxf4 Qxf4": "I had a dim idea that capturing with the rook would probably have been better...never mind, capturing with queen is perfectly playable...",
        "24. Re2 Qh2 25. Rec2": "I'm not sure quite what White is playing at. Far from defending his kingside, he appears to be preparing for an assault on the queenside!? Time to show him what's what.",
        "25... Qh1+ 26. Ke2 Rxf2+": "White resigned, as Ke3 or Kxf2 lose him the queen...and probably a lot more. Very well played, phishbone6984; Merry Christmas, and a Happy New Year! The score is 1-1...it isn't over yet..."
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-phishbone6984?gm=20859",
    "gameName": "Challenge from phishbone6984",
    "players": "phishbone6984 (1378) vs. fatcat2 (1391)",
    "opening": "French (C05), Tarrasch, closed variation"
}