{
    "moves": {
        "1. b4": "oh crud another odd opening. huh. his idea is to fiancetto the bishop to b2 and with a possible c4, b5 to cramp my queenside.",
        "1... c6": "this slows down b5. ",
        "2. Bb2": "yep",
        "2... Qb6": "an early queen attack. now c4 is difficult.",
        "3. a3": "defending the pawn.",
        "3... a5": "attacking that pesky b4 pawn again.",
        "4. c3": "just another brick in the wall.",
        "4... d5": "the b4 pawn is also pinned, so I overprotect another light square. by stopping c4 the bishop looks awkward here.",
        "5. e3": "gaining a share of the center, and contesting my queenside.",
        "5... e5": "the pawn center, although still dynamic is temporary.",
        "6. Qh5": "vis a vis. the queen rushes in. I will have to see what fritz thinks of this move.",
        "6... e4": "this gains space, and does not tie up my pieces in the defence of the e5 square.\r\nI don't fear a check on e5 as the queen is all alone. I have robbed the kings knight of his favorite square. I am looking at c4! now by white in order to bring the Bishop into the attack.",
        "7. Qe5+": "hmmm a little forward aren't we?",
        "7... Be6": "blocking with the bishop. and also keeping an eye on the c4 square.",
        "8. c4": "ahhh, now he sees. oh what to do.",
        "8... Nd7": "how about ignoring it with an intermezzo? Developing with tempo. Get thee away evil white queen!!!",
        "9. c5": "ohhh tradesees? ok. when behind in space, trade pieces!!!",
        "9... Nxe5 10. cxb6 Nd7": "that pawn on b6 looks like a good a target as any. Two pawn islands vs one, and ahead in development. I like those odds. I did consider Nd3! that also looked interesting",
        "11. Bd4 axb4": "freedom for the rook.",
        "12. a4": "white wisely preserves the structure.",
        "12... Ra5": "lets keep that pawn out of the fun. I still want that morsel on b6!",
        "13. Be2": "the only place for his good bishop. my pawn chain is very cramping to white.",
        "13... Ngf6": "have to develope the knight first. the plan is Bc5, but not before guarding g7.",
        "14. d3": "white strikes to open up the position, black has just too much space in the center.",
        "14... Bc5": "my pieces are hungry! hehe.",
        "15. Bxf6 Nxf6 16. d4": "I only need to get my rook out and my development is complete. white has 4 at home. plus I am two points material up. ",
        "16... Bxb6": "mmmm yummy!",
        "17. Bd1": "and has to waste a move to get the knight to the queenside where all his chances lie. notice how limited his \"good\" bishop is?",
        "17... O-O 18. Ne2 Rfa8": "a new target.",
        "19. Bb3 Bd7": "targeting a4.",
        "20. O-O c5": "target aquired. and just in time. the rook is preparing c8.",
        "21. dxc5 Bxc5 22. Ra2": "on Rc8 b6.",
        "22... Bxa4 23. Bxa4 Ra5xa4 24. Rb2 Ra4a2": "the rook is pinned, I need only exchange to a winning endgame. the outside passed pawn should win.",
        "25. Rxa2 Rxa2 26. Nd4 Bxd4 27. exd4 b3 28. Nc3": "I think the knight should have kept his post as a blockader. but perhaps he was lost none the less.",
        "28... Rc2": "here I looked at Nb1. I think that was best as the knight is an excellent blockader. 29. Nb1 b2 30.g3 Rc1 31.h4 and all I can do is exchange rooks.",
        "29. Na4 b2 30. Nxb2 Rxb2 31. h3": "luft!",
        "31... Ne8": "g6 and Kg7 would shield the king, but I wish to activate the king as much as possible. checks are annoying, but my knight can defend well.",
        "32. Ra1 f5 33. Ra8 Kf8 34. Rd8 Rb5 35. h4 Ke7 36. Ra8 Nd6 37. h5 h6 38. Ra3 Rb4 39. Rg3 Kf7": "of course not Kf6?? and I cannot defend both g7 and the knight.",
        "40. Rg6 Ne8": "there is no safe square on the 6th rank for his rook.",
        "41. g4": "I was looking at Nf6 here trapping the rook. but decided to go with swapping on g4. the rook is still out of play here and none of his pawns are connected. g4 was just too strong looking.",
        "41... fxg4 42. Rxg4 Rxd4 43. Rf4+ Ke6 44. Rf8 Nf6": "I love my little knight. much better than a drunkard here.",
        "45. Rb8 Rb4 46. Kg2 Kf5": "I want to take the h pawn now. but want my knight to defend d5 and g8.",
        "47. Rf8 Kg5 48. Kg3 Nxh5+": "with tempo!",
        "49. Kg2 d4 50. Rd8 d3 51. Rd5+ Kg6 52. Kh3": "ack! thou moveth to quickly!!! ?????",
        "52... Nf4+": "game over."
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-wstriggles?gm=1868",
    "gameName": "Challenge from wstriggles",
    "players": "wstriggles (1451) vs. jeffegg2 (1412)",
    "opening": "Polish (A00), Outflank variation"
}