{
    "moves": {
        "1. e4": "Solohawk and I have played many times, and although he can play several openings, he tends to play more e4 than anything else. I used to answer e4 with Petrov's Defense, but more recently have played ...e5.",
        "1... e5": "There is a good chance we will end up in a Ruy Lopez, but he is capable of playing several other choices as well.",
        "2. Nf3 Nc6 3. Bb5": "And a Ruy it is.",
        "3... a6": "I always play Morphy's 3...a6, but of course, it is not required.",
        "4. Ba4": "The only move listed in MCO-13, but I believe I have seen analysis that shows 4. Bc4 is playable. I am too poor to afford an MCO-14 :)",
        "4... Nf6": "The main line, although I have played the Accelerated Counterthrust Variation with 4...b5. Also playable is the Modern Steinitz Defense with 4...d6.",
        "5. d3": "This is a very timid move that surrenders any hope of keeping the opening white initiative. The main line is 5. O-O.",
        "5... b5": "It is probably better to attack white's center with 5...d5, but I wasn't sure I liked the line:\r\n5...d5\r\n6. exd5 Qxd5 (...Nxd5 will drop the e pawn after the trade on c6)\r\n7. Bxc6  bxc6\r\n8. Nc3\r\nThe text forces white's bishop onto a nice diagonal, but I will try to deal with that shortly.",
        "6. Bb3 d5": "Better late than never. In an e4 opening, black's goal is to get in ...d5 without it conceding anything to white. I believe with this move black has achieved equality.",
        "7. Bg5": "Creating complicating tactics, but with Solohawk I will always try to trade queens and head for an endgame.",
        "7... dxe4": "And so I hope for 8. dxe4 when I can trade the queens off.",
        "8. Bxf6": "I assume this is an attempt to decoy my queen, as recapturing with the pawn will break up my kingside.",
        "8... gxf6": "But that is a price I am willing to pay in order to get the queens off.",
        "9. O-O": "Neglecting the fact that his knight was en prise.",
        "9... exf3": "So I am happy to win a piece.",
        "10. Qxf3": "Threatening a nasty fork with Qxc6 .",
        "10... Bg7": "Which I totally overlook because I am so anxious to get castled.",
        "11. Nc3": "But then he fails to pull the trigger on his threat.",
        "11... Bb7": "And I finally realize the danger and deal with it. The second reason for this move it to play 12...Na5 with a discovery on the queen that will allow me to trade off white's bishop.",
        "12. a4": "A curious move that seems out of place. I think centralizing the rooks was probably a better choice.",
        "12... Na5": "And I am able to complete my plan to get rid of his light squared bishop.",
        "13. Bd5 Bxd5 14. Nxd5 O-O": "I feel much better with my king out of the center. Although my pawn structure is far from perfect, I am up a piece and feel the game is won.",
        "15. Nb4": "I have no explanation for this move. Again I think centralizing the rooks is better.",
        "15... c5": "Trying to gain space. The knight has few squares to go to. At a2 it is out of play, at d5 is wastes two tempii going back to the square it just came from, and at c6 I will trade it off, as I am up material.",
        "16. Nc6": "And white allows the trade of pieces.",
        "16... Nxc6": "Which I gladly accept.",
        "17. Qxc6 Qc8": "And now I need to protect the c pawn as well as try to get the queens off.",
        "18. Qe4": "Of course he doesn't want to trade the queens, so he leaves his queen centralized for further maneuvers.",
        "18... f5": "I am trying to open the long diagonal so my bishop will have some scope. Of course the fact that his rook is still on a1 makes this even more enticing.",
        "19. Qe2": "A reasonable square; trying to keep the queen as centralized as possible.",
        "19... Qe6": "Preparing ...e4 to complete the plan of bringing my bishop to life.",
        "20. a5": "No explanation for this move.",
        "20... Rac8": "Now that the a file will remain closed there is no reason to leave a rook on it, so I reposition to support the push ...c4.",
        "21. b3": "And white defends the c4 square, but in the process opens the long diagonal for my bishop.",
        "21... e4": "And I take advantage of the discovered attack on the rook to get in the pawn push.",
        "22. Rae1": "I think I would have preferred Rad1, because after black's next move the rook ends up there anyway, and the text gives black a tempo to invade with the bishop.",
        "22... Bc3 23. Red1 exd3": "Always looking to trade the queens.",
        "24. Qxe6": "And he finally obliges.",
        "24... fxe6": "This also straightens out my pawns for the endgame.",
        "25. Rxd3": "Gaining tempo against the bishop to double rooks on the d file.",
        "25... b4": "I was tempted to play 25...Bxa5, but after 26. Ra1, white wins back the a pawn and I wanted to keep the lines closed for the time being.",
        "26. Rd6": "A double attack on the a and e pawns.",
        "26... Rfe8": "I choose to protect the e pawn, as after 27. Rxa6, I can either win back the a pawn or force a trade of rooks with 27...Ra8.",
        "27. Rxa6 Rca8 28. Rd6 Rxa5": "And that is the way it plays out.",
        "29. Rc6": "It is hard to find a plan for white here, but I think doubling on the d file was probably necessary to make any kind of progress.",
        "29... Kf7": "Protecting the e pawn to free the rook. Also activating the king as we are approaching the endgame.",
        "30. h4": "White has no useful moves, but if he isn't to resign, he must play something.",
        "30... Rd8": "And now black has control of both open files on the board. White should not have allowed this.",
        "31. Rc7+ Kg6": "Keeping everything protected while advancing.",
        "32. f3": "Probably to prepare g4.",
        "32... Rd2": "And black invades on the open file to attack the base of white's pawn chain.",
        "33. g4": "Ignoring the threat to c2, white attempts to find counterplay on the kingside.",
        "33... h5": "33...fxg4\r\n34. fxg4\r\nwould leave the e pawn isolated, give white a 2-1 majority, and open the f file for white's rook. The text does give white a protected passed g pawn, but it is on a dark square and I can sacrifice my bishop for it if necessary. To me, that is the lesser of the evils.",
        "34. g5": "And white achieves the protected passed pawn, but will he be able to break the blockade so it can advance?",
        "34... Rd4": "Rather than take the inconsequential c pawn I attack the vulnerable protector of the passer.",
        "35. Rc8": "Don't know what the point of this is. I think white's best chance is 35. f4, but after 35...Bd2 it is hard to find a good plan for white.",
        "35... Rxh4": "Undermining the passed pawn.",
        "36. Rd1": "Putting the rook on an open file, but it is too little, too late.",
        "36... Bd4+": "Blocking the file and protecting the c pawn so the rook on a5 is freed to move.",
        "37. Kg2": "Getting closer to the expected action on the kingside.",
        "37... Ra1": "Forcing a rook trade, as moving the rook along the d file allows ...Rg1#.",
        "38. Rxa1 Bxa1 39. Rc6": "I don't know why white doesn't take the c pawn here.",
        "39... Bd4": "And now it is protected.",
        "40. Rxe6+": "So white takes the e pawn instead.",
        "40... Kxg5": "And now I have to focus on advancing my own passed pawn.",
        "41. Kg3": "Don't know what this is for.",
        "41... f4+": "And the blunder that turns a win into a draw. I should have played 41...Rh1, but now the rook is trapped.",
        "42. Kg2": "And from here, white can draw by using his rook to cut off black's king from the queenside pawns. For example, moving the rook between d1 and d3 makes it impossible for black to make progress. White's pawns guard all the light entry squares and the only way for the bishop to block the d file from white's rook is to put it on d4. But d4 is the only dark square black's king can use to invade the queenside. Notice that white's king is perfectly placed on a light square so that it is safe from both black's rook and bishop.",
        "42... Kf5": "Nevertheless I play on, as Solohawk may not realize he has a drawing method.",
        "43. Re1 Be3": "Trying to build a bridge so my king can get to the queenside.",
        "44. Rf1": "Wrong way. As discussed earlier, correct is Rd1.",
        "44... Ke5": "Trying to get to d4 and c3.",
        "45. Re1": "The last chance to draw. Now my king can invade the queenside.",
        "45... Kd4 46. Ra1 Kc3": "Now the queenside pawns will fall.",
        "47. Ra2 Bc1": "Heading for b2 to block the protection of the c pawn.",
        "48. Kf2": "White was in zugzwang, as a rook move would drop the c pawn.",
        "48... Rh2+": "But now my rook is freed and the c pawn will fall anyway.",
        "49. Ke1 Rxc2 50. Ra1": "Of course trading the rooks is tantamount to resigning, but white has no drawing chances anymore.",
        "50... Kxb3": "And black's connected passers will be quickly decisive.",
        "51. Ra8 Kc3": "Making way for the b pawn to advance, so white resigns. 0-1"
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-markpinkston?gm=1447",
    "gameName": "Challenge from markpinkston",
    "players": "solohawk6_9 (1259) vs. markpinkston (1388)",
    "opening": "Ruy Lopez (C77), Anderssen variation"
}