{
    "moves": {
        "1. e4 d5": "The Scandinavian Defence, sometimes called Centre Counter Defence (ECO B01). It is one of the oldest known openings, first recorded in a poem in year 1475 as being played between Francesco di Castellvi and Narciso Vinyoles in Valencia, Spain. \n \nI have stayed clear of it for quite some years, but recently the opening has again become a favourite of mine while facing 1.e4 with the Black pieces. After all, I am Scandinavian myself. :)",
        "2. e5": "!? Rather uncommon, but seen at club-level once in a while. The more hands-on 2.exd5 is considered the main line of the Scandinavian Defence, and better. Another aggressive option for White is to transpose the opening into the Blackmar-Diemer Gambit with 2.d4. In my opinion, other moves than these two are not as playable. \n \nOf course the game is still in the early stages, and could change into very different positions, such as the French or Sicilian Defence.",
        "2... Nc6": "Attacking while developing - winning a tempo early on is always good for Black.",
        "3. Nc3": "?? Developing while defending can be equally good: hence 3.Nf3 is quite a lot better - and the solid albeit quiet 3.d4 is probably best. Instead, White's choice in this game defends nothing, attacks nothing - and actually develops nothing either. Quite the opposite, as the future of the game will tell.",
        "3... d4": "I immediately try to benefit from White's poor third move. I gain some terrain, and what is sometimes called a \"half tempo\". I think that 3.- Nxe5 is good enough, for example: 4.Nf3 Nc6 5.Bb5 e6 6.Ne5 Bd7 etc (Flauss-Henseler, 0-1). However, the text move ensures that I can seize the initiative.",
        "4. Nb5": "?! Still not attack, nor defence - instead, it's an invitation. Keeping the Knight in the centre with 4.Ne4 would be better. Because of 4.- Qd5 Black would then still have the upper hand, but the hand wouldn't be a fist...",
        "4... a6": "Attacking the Knight, while defending against a future B-b5.",
        "5. Na3": "The only move. After five moves White has only developed two pieces, and of those two the Knight is hopelessly out-of-bounds. In Swedish it's called a \"kantspringare\", in German \"Randspringer\"; literally meaning 'Knight on the edge'. The words are derived from \"kant\"/\"Rand\" meaning 'edge' or 'fringe', and \"springare\"/\"Springer\", an old Germanic word for \"horse of a mounted soldier\". (Despite the resemblance, the Swedish word \"springa\" ('to run') and German \"Springen\" ('to jump') are not closely related to the chess term.)",
        "5... Nxe5": "I can finally take one of my opponents centre pawns, and since I have a well developed d-pawn smack in the middle of the board that is easy to defend, White will have a hard time regaining the initiative. After the conclusion of move five White has developed one piece but lost a pawn, and while winning that pawn Black has developed three pieces - a decisive advantage. It now becomes clear that 2.exd5 would have been better than 2.e4. In analogy with that, a rule of thumb could be that it is almost always best to immediately strike a pawn given in gambits or gambit-like positions. The longer one waits, the bigger the risk of losing the pawn without compensation. Or, as the first World Chess Champion Wilhelm Steinitz put it: \"The refutation of a sacrifice frequently consists in its acceptance\".",
        "6. Nf3 Bg4": "Developing while pinning an opponents piece is almost as good as developing using a direct attack...",
        "7. d3": "7.Be2 is probably better, since it releases the pin on the Knight, and prepares for a kingside castling.",
        "7... Bxf3": "My plan is to open up Blacks kingside, making castling short a hazardous business. It would suite me better if my opponent made a queenside castling, since then my advanced pawn on the d-file would assist in a future attack on the King's position.",
        "8. Qd2": "?? \"Finita la musica.\" The move 8.gxf3 is absolutely necessary; instead, this spells disaster. I would like to point out that I don't think that Black is nearly as bad a player as this position might suggest - it is all more or less the result of one single, very bad move: 3.Nc3, which opened up the board for me to develop my pieces while suppressing the development of my opponent's.",
        "8... e6": "In order to make way for my dark-squared Bishop. I'm not afraid of 9.gxf3. That  would win back the lost piece for White, but then lose the Queen for a Knight; for example 9.- Nxf3  10.Kd1 Nxd2 11.Bxd2.",
        "9. Be2": "To late.",
        "9... Bxg2": "I actually have no plan to stay up front with my light-squared Bishop, since I figure I need to develop the rest of my pieces first, rather than only use the few ones already out there. However, I see no harm in seizing a pawn before retiring...",
        "10. Rg1 Bc6": "May be not the best move, but it is consistent with my style of play in this game. For instance, 10.- Bd5 11.c4 dxc3 e.p. 12.Qxc3 Nc6 would take away much of my initiative, and suddenly White would be better developed. I would still have the better position, being one Knight and two pawns up, but I feel that 10.- Bc6 is more on the spot.",
        "11. Nc4 Nxc4 12. dxc4 g6": "Again, technically speaking probably not the best move I could have made. However, being one Knight and a few pawns ahead I prefer a slow and solid development followed by a (more or less) certain win, instead of trying to win in a \"fancy manner\". Consequently I must shelter my g-pawn from Whites Rook before I can use my kingside Bishop.",
        "13. Qf4": "13.Dd3 is a lot better, opening up the c1-h6 diagonal for Whites dark-squared Bishop. Also, the Queen is very vulnerable on that very same diagonal...",
        "13... Bd6": "Again, attacking while developing...",
        "14. Qxd4": "?? Curtains - this loses the Queen. The better 14.Qg5 would have provided some CPR.",
        "14... Bb4+ 15. c3": "This move \"converts\" the doubled pawns on the c-file into more aggressive doubled pawns on the b-file. That's a good thing, however White is no longer in any position to be aggressive. Again, a quote by Steinitz comes to mind: \"When you have an advantage, you are obliged to attack; otherwise you are endangered to lose the advantage. [...] Only the player with the initiative has the right to attack\" (or he will end up even worse). \n \nIn the game at hand 15.Qd2 Bxd2  16.Bxd2 is better: it still loses the Queen, but at least it develops the Bishop.",
        "15... Qxd4 16. cxb4 Nf6 17. b5": "Again, only the player with the initiative should attack. White has no counterplay, and should direct all energy into finding a defensive strategy rather than offensive.",
        "17... Ne4": "Consequently, since I have the initiative I do not have to bother to defend my Bishop.",
        "18. Rg4": "?? I'm sorry to sound like a broken record, but White is in no place to attack. This sacrifices the f-pawn and the light-squared Bishop, which doesn't help. \n18.Rg2 or 18.Rf1 is way better.",
        "18... Qxf2+ 19. Kd1": "Only move.",
        "19... O-O-O+": "Actually a simple 19.- Rd8  has the exact same effect, but checking the opponent while castling often has a stronger psychological impact.",
        "20. Kc2 Qxe2+ 21. Kb1": "?? Leads to mate in the next move. 21.Kb3 Rd3  22.Ka4 etc. would win some time, but not much.",
        "21... Qd3#": ""
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-chess242?gm=20133",
    "gameName": "Challenge from chess242",
    "players": "chess242 (1228) vs. refute (1200)",
    "opening": "Scandinavian (centre counter) defence (B01)"
}