{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Bb5 a6 4. Bxc6 dxc6 5. O-O Qd6": "This opening it the Ruy Lopez, exchange, Bronstein variation.\r\nFrom now on, this is unknown territory for me. I only use the chess data base after the game (just to have more fun on the game, not that I am against it when someone does), so here I have to start looking what to do. I thought of doing an attack on her e-pawn, by playing d4.",
        "6. d4 exd4": "She takes my d-pawn, here I was thinking to take with my queen, so I could, after a trade put my knight on d4 and play the other knight to c3, which looks a little bit familiar.\r\nTaking the pawn with the knight is also possible of course, but it just didn't feel so good to me at the time. I see now in the data base that it is the most played move...",
        "7. Qxd4 Qxd4 8. Nxd4 Bd7 9. Nc3": "In the \"world data base\", 9. Be3 is played more, in the \"GK data base\" 9. Nc3....",
        "9... O-O-O 10. Re1": "Here, 10. Be3 is the move to play according to both data bases, I did this move a few tempi later. 10. Re1 is not played in the data base, I played it to support my e-pawn.",
        "10... Bb4": "A good, logical move. What do I do know? Play the B to e3, let her take the knight and take back with my b-pawn and then play my rook to b1? Nope, took an option on Bd2, to avoid pawns on the same line.",
        "11. Bd2 Ne7": "I think she didn't play 11... Nf6 to avoid 12. e5.",
        "12. a3": "Take or get lost!",
        "12... Bc5": "Yep, logical, time to move my B to e3. Hurry!",
        "13. Be3": "That is more like it.",
        "13... Bb6": "Put her B save and let it have a fine view and wait to attack",
        "14. Na4": "Going after her black squared danger, taking my knight is not good according to me. The only option is Ba7, I think.",
        "14... Kb8": "But here she played her king, which I don't understand, because she gets after the trade a weak pawn on b6 (which she can fix by playing b5), but what is more, her king isn't protected as it should be, I thought.\r\nThe puter analysis gave this line: 14... Kb8 15. Nxb6 cxb6 16. Nf3 c5 17. Ng5 Be6 18. Bf4+ Kc8 19. Be5 Rhg8 20. Nxe6 fxe6 21. Rad1 g5 22. Bf6 Rd7 \r\nand as best line: 14... Ba7 15. Nf3 Bxe3 16. Rxe3 Ng6 17. Nc5 Rhe8 18. Rb3 b6 19. Nxa6 Rxe4 20. Ng5 Ra4 21. Nb4 c5 22. Nd5 \r\n",
        "15. Nxb6 cxb6": "Here I have the advantage!",
        "16. b4": "Here I go off the best line. The comp gave 16. Nf6 and I lose the advantage again.",
        "16... c5 17. Nb3": "Didn't want to give her the chance to get rid of her double pawns.",
        "17... Rdc8": "She makes a mistake and there is my advantage again!!\r\nThe analysis says: 17... Rc8 18. bxc5 b5 19. Rad1 Bg4 20. Rd6 Nc6 21. f3 Be6 22. Red1 Rhe8 23. Bf4 Ka8 24. Kf2 Rcd8 \r\n\r\nor 17... Rc8 18. bxc5 b5 19. Rad1 Be6 20. Nd4 Bc4 21. Bf4+ Ka8 22. Bd6 Rhe8 23. Bxe7 Rxe7 24. Nf5 Re5 25. Nxg7 a5 26. Rd7 Rexc5 \r\n\r\nWhat she should have played: 17... c4 18. Nd4 b5 19. Nf3 Be6 20. Ng5 Nc6 21. Rad1 Kc8 22. Kh1 Kc7 23. Bf4+ Kb6 24. Bd6 Rd7 25. Bc5+ Kc7 \r\n",
        "18. bxc5 b5 19. a4": "Mistake: the line given here is: 19. a4 bxa4 20. Na5 Ng6 21. Nc4 Bc6 22. Nd6 Rc7 23. Ra3 Rd8 24. Rb1 Ne5 25. Bd4 Re7 \r\nor: 19. a4 bxa4 20. Na5 Ng6 21. Reb1 Bb5 22. c4 Bc6 23. Nxc6+ Rxc6 24. Rxa4 Rd8 25. f4 Ka8 26. Kf2 Rc7 27. Ra2 Rcd7 \r\n\r\nWhat I should have done is already described after black's 17th move.",
        "19... bxa4 20. Na5 b5": "20... Ng6, as explained in white's 19th move.\r\nPlaying 20... b5 gave me a big advantage: 20... b5 21. cxb6 e.p. Ng6 22. c4 Rhe8 23. Red1 Bc6 24. f3 f5 25. Kf2 fxe4 26. Nxc6+ Rxc6 27. Rxa4 exf3 28. Kxf3 \r\n",
        "21. cxb6 e.p. Rxc2": "Now, what I saw was that I was going to win a quality here, follow this game until move 28 to see how.",
        "22. Bf4+ Ka8 23. b7+ Ka7 24. Rab1": "There is a fault in my calculation, says GK: 24. Rab1 Bb5 25. Be3+ Kb8 26. Rec1 Rxc1+ 27. Rxc1 Rd8 28. Bg5 f6 29. Bf4+ Ka7 30. b8=Q+ Rxb8 31. Rc7+ Ka8 32. Rxe7 Rd8 \r\nor: 24. Rab1 Bb5 25. Rec1 Re2 26. b8=Q+ Rxb8 27. Rc7+ Ka8 28. Rxe7 Re8 29. Rxe8+ Bxe8 30. Rb8+ Ka7 31. Rb7+ Ka8 32. f3 Bb5 33. Rxf7 Re1+ 34. Kf2 Re2+ 35. Kg3\r\n\r\nThis is better indeed: 24. Rec1 Rxc1+ 25. Rxc1 Ng6 26. Bd6 Kb6 27. b8=Q+ Rxb8 28. Rb1+ Bb5 29. Bxb8 a3 30. Nc4+ Kb7 31. Nxa3 Kxb8 32. Nxb5 axb5 33. Rxb5+ Kc7 \r\n",
        "24... Bb5 25. Bd6": "Oh, and another mistake, should have done as described in white's 24th move:\r\nThis move turns my advantage downhill quite a bit: 25. Bd6 Nc6 26. Rec1 Rxc1+ 27. Rxc1 Nxa5 28. Rc8 Nxb7 29. Bb8+ Kb6 30. Rxh8 a3 31. Rxh7 a2 32. Be5 Nc5 33. Rxg7 Nxe4 34. Rxf7 \r\n",
        "25... Nc6 26. Nxc6+": "My advantage is completely gone now, but at the time, I thought I was doing very good!!",
        "26... Rxc6 27. b8=Q+ Rxb8 28. Bxb8+ Kxb8 29. Rbd1 Kc7 30. Rdc1": "There we are: Rc1, a bit too late!!",
        "30... Rxc1 31. Rxc1+ Kb6 32. f4": "Try to get my attack with my plus pawn going. The problem later in the game is that her bishop is a real pain in the...., well it stood in the way to get a pawn promoted!!",
        "32... Ka5 33. Kf2": "Time for Henry to take part of the game, about time!!",
        "33... a3": "Oh, she tries to promote too, panic panic!!",
        "34. Ke3 Kb4 35. Kd2": "I wanted to use Henry to support my pawns, but needed him too to avoid promoting. What to do?????",
        "35... Ba4": "This is a mistake: 35... Ba4 36. Ra1 Bb3 37. Kd3 a2 38. g4 f6 39. h4 Be6 40. f5 Bb3 41. Kd4 Bc4 42. e5 fxe5+ 43. Kxe5 Kb3 I could try to trade the rook with the bishop, taken by both Henry's.\r\nShe could have taken the advantage by 35... a2 36. Kc2 Ka3 37. Re1 Ba4+ 38. Kc3 Bc6 39. e5 Bxg2 40. Rg1 g6 41. Ra1 h5 42. h4 Be4 43. Kd4 Bb1 \r\n",
        "36. Ra1": "Fear of promotion, try to block it, I didn't dare to move my king to my pawns again, otherwise her ol' man could come after my rook.",
        "36... f6 37. Kc1 Bb3 38. g4 h6 39. h4 a5 40. Kd2 a2 41. g5": "Not good, because of 41. g5 Kc4 42. gxf6 gxf6 43. e5 fxe5 44. fxe5 Kd4 45. Kc1 Kxe5 46. Kb2 a4 47. Re1+ Kd4 48. Ka1 Kc4 49. Re7 and she has the advantage!!\r\n\r\nBetter is: 41. Kd3 Be6 42. Kc2 a4 43. e5 fxe5 44. fxe5 a3 45. g5 hxg5 46. hxg5 g6 47. Kd3 Kb3 48. Kd4 Kb2",
        "41... hxg5 42. hxg5 a4": "Gives the advantage back to me 42... a4 43. gxf6 gxf6 44. e5 fxe5 45. fxe5 Be6 46. Rc1 a3 47. Rg1 Kc4 48. Ke3 Kc3 49. Ke4 Bb3 50. Kf4 Kb2 51. Rg2+ Kc3 52. Rg3+ Kd4 \r\n\r\nBetter was: 42... a4 43. gxf6 gxf6 44. e5 fxe545. fxe5 Be6 46. Rc1 a3 47. Rg1 Kc4 48. Ke3 Kc3 49. Ke4 Bb3 50. Kf4 Kb2 51. Rg2+ Kc3 52. Rg3+ Kd4 \r\n\r\nAnd then she offered a draw which I accepted. Thanks for the games Joanne, it was one with opportunity's from both sides, mistakes from both sides and also brilliant moves from both sides!!"
    },
    "url": "https://gameknot.com/annotation.pl/chance-to-play-the-uk-number-1-player-beefyness?gm=31716",
    "gameName": "Chance to play the UK Number 1 player Beefyness",
    "players": "doji (1564) vs. jstevens1 (1836)",
    "opening": "Ruy Lopez (C69), exchange, Bronstein variation"
}