{
    "moves": {
        "1. d4": "Jeremy starts off with his usual.",
        "1... Nf6": "I know Charles style of play.  And, he enjoys playing the Grunfeld Defense.  In fact, a lot of his annotations that I've studied involves that.",
        "2. Bg5": "So, Jeremy gets aggressive.  The idea being is that, in general, passive play does not work against a strong opponent.  Although, Jeremy's rating is higher, I don't blame for not taking chances.  And, that's due to the fact that Charles was able to outplay Janet in a game that I annotated about a month ago.",
        "2... Ne4": "So, Charles returns the favor by attacking Jeremy's Bishop.",
        "3. Bf4 c5": "As now, Charles intends to exchange pawns.  At first, I wasn't sure why since Jeremy's pawn isn't in the center.  However, the purpose is to leave black with doubled pawns.  As two bad pawns, in many cases, can be close to as bad as losing a pawn which is something that GM Susan Polgar implied.  As she said that pawn structures are, in general, very important.",
        "4. Nf3": "Therefore, Jeremy refuses to give in by continuing with his development.",
        "4... d5": "And, Charles breaks through in the center.",
        "5. e3": "As does Jeremy.",
        "5... Qb6": "And, Charles is now threatening white's b2 pawn, as well as, the Rook.",
        "6. Nc3": "And, Jeremy puts a stop to that.  Even though it's not a London System, what I studied there from Susan Polgar is very applicable here because with the move played, it would now be a mistake for Charles to take on b2.  As now, Jeremy would have 7.Na4, and this would be followed by 8.Ra1 leaving the Queen virtually trapped.  That is a very well known fact.  Therefore, with that danger, Charles decides to exchange Knights.",
        "6... Nxc3 7. bxc3 e6": "And, Charles responds with this pawn chain which is important with this position since they are right in the center.",
        "8. Rb1": "Meanwhile, Jeremy attacks the Queen, nonetheless.",
        "8... Qa5": "So, Charles counterattacks.",
        "9. Bb5+": "But, then comes this nasty check since it is on the same file as Jeremy's Rb1.",
        "9... Nc6": "So, Charles blocks it temporarily by interposing with his Knight.",
        "10. Ne5": "And, Jeremy threatens to exchange.  In my opinion, it would be the right choice to accept it here because of what follows later.",
        "10... Qxc3+": "But, Charles has other ideas since he took the pawn, instead.  It appeared to be a free pawn.  However, I believe that this is the losing move because of what's to follow.  And, I only say that because of the misfortune with Jack Stockel in my first game with Tom Walsh on Friday, during the tournament.  So, it was the game before my very last annotation, in which Jack Stockel yelled at Tom and I which had negative affects on our play during the second game.  The mistake that should've lost was taking a pawn.  Sure, I was up a Queen for a minor piece or two.  But, then I took the doubled.  The problem was my N being pinned against my Queen with two of his Rooks.  I was very lucky that Tom overlooked it, but had he doubled up on one file, I would've lost the N, and would have to hand back my Queen to avoid mate.  From then on, I would be in a lost position.  Well I believe that more or less could be said here since these two pawns are weak.  And, is combined Jeremy's Ne5 and Bb5 becoming the killers for this game.",
        "11. Kf1": "And, Jeremy does what you typically see with a more experienced player.  And, it is something that was noted in the KOH forum which I posted, even dating back to when I was a beginner.  It's called refusing to castle.  As on the higher levels, there are times when not castling can win.  With what else unfolds, it is safe to say that it is the case here.",
        "11... cxd4": "Not liking what Jeremy played, Charles responds by taking another pawn.",
        "12. Rb3": "However, Jeremy responds by attacking the Queen.",
        "12... Qc5 13. exd4": "Which allows Jeremy to win back a pawn by attacking again.",
        "13... Qd6 14. Nxc6": "Although seemingly easy to deal with, this is where the position becomes impossible for Charles to defend because of what's about to happen.  And, that is why I believe that it would've been better to exchange Knights on move 10.  As it turns out, the same piece is launching a devastating attack.",
        "14... Qxf4 15. Ne5+": "And, that is due to this discovered check.  With it, Charles resigned.  At first, I was wondering why.  But, it turns out that, black is going to lose a piece without compensation.  At best, it'll be the Bishop.  He also might wind up losing the Rook.  But, against a strong player, not always, but usually, after losing a piece, you don't stand a chance.  Keeping that in mind, Charles, just like any other strong player wouldn't want to deal with that situation. "
    },
    "url": "https://gameknot.com/annotation.pl/charleshiggies-christmas-new-year-tournament-2016?gm=62601",
    "gameName": "charleshiggie's Christmas/New Year Tournament 2016",
    "players": "teardrop34 (2166) vs. charleshiggie (2071)",
    "opening": "Trompovsky attack (Ruth, Opovcensky opening) (A45)"
}