{
    "moves": {
        "1. e4": "I wasn't sure how Charles was going to open.  As I've also seen him play the Queens Pawn Opening (1.d4), as well as, the English which is just like the Sicilian Defense but in reverse (so 1.c5).  But, once he played this, I was ready to answer with the Sicilian Defense.",
        "1... c5 2. Nf3 d6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 a6 6. Bg5": "This is all standard and what I'm most used to.",
        "6... e5": "Trying to take Charles off guard a little, I play this.  The entire idea behind this move is tempo gain.",
        "7. Nf5 Bxf5": "Better was 7...Be7 to continue developing and breaking the pin that he has against my Nf6.  The entire idea behind tempo gain was to develop my DSB and castle.  I thought that exchanging gained more since Charles is forced to take back.  But, this didn't gain anything.  In addition, this happened before the lesson with GM Susan Polgar about not exchanging unless there is a definite advantage.  So, I misunderstood a part of that message where Susan said that, in general, exchange N for B.  In a later lesson, she said that you sometimes also need the B, and thus, don't exchange so quickly.  And, that was when I had that chess dream as training from the lord.  He went over the same thing that Kenneth_fiore_3 told me.  So, what Ken said in our first lesson was spot on as that was, in reality, how I was thinking until those important lessons.  With that being said, I believe that this exchange is going to benefit Charles, as my B stronger then Charles N.",
        "8. exf5 Be7": "This is where I break the pin and prepare to castle, at once.",
        "9. Bc4": "Charles also has development and castling on his mind.  With that being said, we both castle, at once.",
        "9... O-O 10. O-O Nc6": "I was thinking very hard about what to do to avoid exchanging.  There was no way around it here, so I decided to complete my development.  But, better would've been to develop with 10...Nbd7  And, when he plays 11.Bxf6, I can recapture with the other N, ultimately, making it stronger.  By playing this, however, the exchange weakens my position.  As now, I'm losing some control of my center.",
        "11. Bxf6 Bxf6 12. Nd5": "I first, I thought that Charles was trying to exchanging.  But, then I asked myself why he'd do that being his N is stronger then his Bc4, in this position.  I also, at first, didn't see the point, being that 13.Nb6?? is unplayable because of my Q.  However, the real reason behind this move is because of what I play next.  After which, the N is not attacked, so he doesn't have to worry about me taking off his stronger N.",
        "12... e4": "It might look I'm trying to get a passed pawn.  But, the real behind playing this move is due to the N moving since I'm now threatening to win a pawn.",
        "13. c3": "Not surprisingly, Charles puts a stop to that.",
        "13... Ne7": "?? I go after his f5 pawn, as a result.  But, this is a terrible move.  As it is going to expose my K, and I'm going to lose a pawn.  That's because when Charles exchanges, I'll have to recapture with the pawn supporting the K.  Had I refrained from playing this, he would not have captured being that I would take back with the Q.  But, with this interference, I can't use the Q any longer.  So, despite material being even, this gives Charles an advantage.",
        "14. Nxf6+ gxf6 15. Qg4+": "As, not surprisingly, this move follows.  But, what's worse is that I'm going to lose a pawn.  As I can't recapture since Charles takes with the Q.",
        "15... Kh8 16. Qxe4 Nc6": "Knowing what I've done, I try to fix some of the damage by moving the N back out to where I placed it 6 moves earlier.  In addition, I'm preparing to attack Charle's Q, sooner or later.",
        "17. Rad1": "Centralizing his R.",
        "17... b5": "? I considered attacking his Q with 17...Re8.  However, that would've been the only reason for playing that.  But, I would not know what to do afterwards.  What I overlooked was the exchange.  As the idea was to attack Charles B, and force his retreat.  But, without it's protection, I overlooked that he'll take my N.  I then thought that this was just inconvenient, as I've allowed something that I did not desire which was an exchange here.  Shortly after, I thought that it was just the worst being a burden.  But, it's not.  As this is a mistake, being that Charles will win another pawn after exchanging.  So, much better would've been 17...Re8, afterall.",
        "18. Qxc6 bxc4 19. Qxc4 Qe7": "Being that 19...Rc8? is unplayable due to my a pawn, I come up with a new plan being to mobilize my Q.  The reason being is to allow an attack against his Q.   Even though he attacks my Q first, this was very well worth it to me because of what unfolds.",
        "20. Rfe1 Qd7 21. Rd5 Rfc8": "And, that's being this move which is what I noted.  And, what's important to note is that my a pawn is still protected.",
        "22. Qd4": "What I overlooked is that the attack allows Charles to threaten another pawn.",
        "22... Rce8": "? As now, I threaten to exchange which is significant as I threaten mate, afterwards.  I knew that Charles wasn't going to allow that.  But, rather then attack the Q, this would've been better on the last move, as now, it would be very difficult to drive off what unfolds.  The only way to prevent me from winning back material would be 23.Rxe8+ and after 23...Rxe8, Charles must advance his h, g, or f pawn to prevent mate.  In return, that would compromise his position a little, and I would not have lost material.  But, this move gives him another pawn, as he will take on f6 with check.",
        "23. Qxf6+ Kg8 24. Re3": "Right now, it looks like Charles had prevented the threat that I noted earlier.",
        "24... Rab8": "? But, I go right after his b pawn with the idea of threatening mate afterwards.  What I did not know is that Charles does not have a problem.  And, what I'm thinking is what's about to unfold which will prove disaster.  For starters, if I'm to prevent that, I'm gonna have to give up another pawn.  Much better would've been 24...Rxe3 which also threatens mate.  But, after 35.fxe3, all I could hope for is that white blunders and allows a stalemate.  ",
        "25. Rxd6 Rxb2": "?? I, deliberately, left my Q en-prise and took his b pawn, immediately.  This is because I did some studies with GM's Judit and Susan Polgar.  They involved back ranks that were weak in a similar way.  And, the HW question involved giving up the Q with the idea that if the opponent takes, it's mate, similar to this.  In the aftermath, I looked at reversion's game against dipole_moment.  There was a very similar threat but not including a Q sac.  Instead, reversion played 26...Qxe5, but had he recaptured with the R (26...Rxe5), dipole_moment would've had a mate in 4, involving the back rank, as well.  So, I thought that it would work here being that if he takes here, it's mate in 3.  However, I knew that Charles would see this threat.  However, I thought it would be very difficult for him drive it off without losing his Q, but I was wrong.  As it turns out, I overlooked the intermediate checks that are about to follow.  Instead, much better would've still been threatening mate and trying for a stalemate with 25...Rxe3.  Surely, Charles wouldn't have allowed it, but it would've been difficult for white to be able to avoid the draw.  In other words, it would've been difficult for him to win.  However, this move makes it easy.  The reason being is that I'm going to lose my Q with the intermediate checks, afterall.",
        "26. Rg3+ Kf8 27. Qh6+ Ke7 28. Re3+ Kd8 29. Rxd7+ Kxd7 30. Rd3+ Kc7 31. Qd6+ Kb7 32. Qd7+ Kb6 33. Rd6+ Ka5": "I would have resigned after 29.Rxd7!  But, I still had the back rank threat.",
        "34. g4": "Not surprisingly, Charles, stopped it here.",
        "34... Ree2": "So, I come out with one last threat.",
        "35. Qxf7": "This is one of the moves that I had anticipated.",
        "35... Rexf2": "So, I continue with Hope Chess in my last attempt.  But, it's in 2 phases.  The first plan was moving the f rook to c2. In other words 36...Rfc2. The idea behind this would be to allow 37...Rc1+ which is a forced mate as 38.Rd1 is forced, and then comes 38...Rxd1#   I knew that this wasn't going to work.  So, I analyzed a second variation which would result in a draw by repetition. This would involve preventing 36...Rfc2 with 36.Rd1 After which, I'd play 36...Rxh2  As then, I thought 37.Kf1 to prevent the checks. But, I would, however, answer with 37...Rbe2 followed by 38...Ref2 After that, though, I'd check starting with 39...Rhg2+, forcing 40.Kh1 and then 40...Rgh2+, 41.Kg1 And, that position would repeat itself until Charles and I have reached a draw by repetition.  Unlike the other plan, I thought that this one was going.  In other words, I thought that I'd be able to force a draw.",
        "36. Qd5+": "That was, until this move.  Afterwhich, I realized that all of my hopes, that I mentioned earlier are gone.  At first, I thought that I could get out of this mess with 36...Ka4, but then 37.Rxa6# is checkmate.  Therefore, interposing with 36...Rb5 is forced.  And, after 37.Qxb5+, I'm forced to recapture.  No matter which way I take back, Charles would answer with 38.Kxf7.  The end result is that I'm left with only my K and 2 bad pawns (isolated pawns) against 5 pawns (2 of which are passed pawns) against his R.  So, I resigned here."
    },
    "url": "https://gameknot.com/annotation.pl/charleshiggies-christmas-new-year-tournament-2016?gm=63282",
    "gameName": "charleshiggie's Christmas/New Year Tournament 2016",
    "players": "charleshiggie (2033) vs. jkarp (1304)",
    "opening": "Sicilian (B94), Najdorf, 6.Bg5"
}