{
    "moves": {
        "1. e4": "So, I start off with my usual.",
        "1... c5": "Since he knows my style of play, I am not surprised to see this played.  And, in fact, we stick with the mainlines until the fifth move.",
        "2. Nf3 d6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 g6": "But, this is where it differs since 5...a6 is generally played.  ",
        "6. Bd3": "With that I considered, 6.Bb5+ but don't know what that would accomplish after 6...Bd7 or 6...Nbd7 since one of those was his suggestion in Wizard Chess which I annotated.  And, I say that because of what happened against the computer where I played the Sicilian, but after 2...d6, 3.Bb5+ was immediately played, and I had a hard time knowing what to do to get out of check.  But, ION knew which means that he'd have a very good answer were I to do that to him.  Therefore, bearing that the d pawn is gone, this was played to connect my c and e pawns, as well as continuing the development to bring me one step closer to castling.",
        "6... Bg7": "And, ION responds by completing his fianchetto.  But, it gets interesting here as both of us castle.",
        "7. O-O O-O 8. Re1": "I also considered 8.Bg5, but it's not pinned.  More importantly, though, is that I'm thinking along a long plan.  And, that's the potential for my e4 pawn to become a passer which is why I decided to centralize my Rook.  Might not happen, but what if this worked?  Then, I'd have a Rook behind a passed pawn which is very useful in the endgame, and that is what I'm picturing here.",
        "8... Nc6": "Meanwhile, ION continues developing by attacking my N.",
        "9. Nf3": "So, I defend.",
        "9... a6": "And, ION plays the same move that's normally played on the fifth move of the Sicilian.  It didn't transpose, but I still put it under a very similar category because it's, as though, we were in a transposition since at a later time, black often fianchettos the DSB, right before completing the fianchetto with ...Bg7 which is also what happened here.",
        "10. Bg5": "Meanwhile, I complete my development, at once, as does ION.",
        "10... Be6 11. Qd2": "Not knowing what else to do, I decide to connect my Rooks, as per Ken's suggestion in a different game, when I made another unwise choice to exchange for the same reason.  And, he suggested bringing the Rooks together.",
        "11... Rc8": "I guess this was played to put pressure on my Nc3.",
        "12. Ne2": "Starting to feel it, I pull back, with the idea of bringing my N to a stronger square.  By that, I'm alluding to 13.Nf4",
        "12... b5": "But, nothing stops ION from connecting his pawns.",
        "13. Nf4 Ng4": "ION is trying to win a pawn.",
        "14. Nxe6": "But, with the opportunity, I decided to exchange right here.  And, the reason being was to mess up his pawn structures near the King because of what I learned from GM Susan Polgar.  And, in fact, Ken mentioned something similar in a couple of my annotations.  So, I felt that exchanging was wise here.",
        "14... fxe6 15. Be2": "? But, I overlooked what's coming here.  Yes, I followed Ken's suggestion about mobility, but I went overboard here as my assessment was wrong, in this position.  Since I overlooked that my b2 pawn is still hanging, and not to the Queen, in which, there might be a way to trap it.  Best would've been 15.Rab1, but this move loses a pawn.",
        "15... Bxb2 16. Rad1": "Given that my Rook was also en-prise, I decided to protect by centralizing it and hoping that, by doing it, the center is under complete control.  By, my assessment it is, because my Q and LSB are also in the center.",
        "16... Bg7": "I am not why this was played.",
        "17. h3": "But, nothing stops me from attacking the N.",
        "17... Nge5 18. Nh2": "To avoid more exchanges, I pull back.",
        "18... Nc4": "But, with my Queen attacked, I felt that the only option was to exchange here.  However, I completely overlooked 19.Qc1 because my primary focus was keeping the Queen in the center and right in front of the Rook.",
        "19. Bxc4 bxc4 20. Ng4": "With that, I felt that it was important to get my N out of the corner and onto a more active square.",
        "20... c3": "I was a little surprised that ION attacked my Queen, but I guess the model is expecting to be surprised.  With that, I'm ok moving it elsewhere.",
        "21. Qe2 h5": "As now, ION's going at it by attacking my N.",
        "22. Ne3": "So, I protect.",
        "22... Qa5": "I was only worried about my a2 pawn, but that was the wrong way to think.",
        "23. Rda1": "?? That's because, I overlooked that my Bg5 is on the same line.  Therefore, this is the losing move.  And, it also turns out that ION could not have taken my a pawn, as he pointed out.  In it, he said, \"Now that is a pity: you were doing so well up to here. The a-pawn wasn't really threatened. After 23...Qxa2 24.Ra1 Qb2 25.Reb1 ... the queen would have been trapped!\"",
        "23... Qxg5": "Against someonelse, I might have stayed and hoped for a stalemate.  But, I knew that I didn't stand a chance against ION.  Plus, I also felt that there was nothing else to learn, so I resigned, under that circumstance as per what reversion and I discussed in Reversion's Open Fire."
    },
    "url": "https://gameknot.com/annotation.pl/charleshiggies-christmas-new-year-tournament-2016?gm=62705",
    "gameName": "charleshiggie's Christmas/New Year Tournament 2016",
    "players": "jkarp (1296) vs. archduke_piccolo (2120)",
    "opening": "Sicilian (B70), dragon variation"
}