{
    "moves": {
        "1. e4": "Today on \"I annotate a game\" I wanted to start a little series. I have recently been playing around with the Evan's gambit and am trying to learn it properly. As part of this process I thought that I would annotate my games, good or bad, win or lose, and show you my thought process as it evolves. As it turns out this game was a great one to start on as I got a great position and went in for a crushing attack and was better very quickly. Doesn't always work out this way, but this game was nice. ",
        "1... e5 2. Nf3 Nc6 3. Bc4 Bc5": "If black plays instead Nf6 I've also been playing around with the Max Lange attack, a very similar opening in a lot of ways. ",
        "4. b4": "Signifying the Evan's Gambit. The idea behind this attack and many similar opening gambits is to sacrifice a pawn for active counterplay on some part of the board, relying on compensation for the pawn. What is the compensation here? White intends to castle quickly, get the rooks in the middle and somehow keep black's king in the middle to attack. Alternatively there is often a strong attack against the f7 pawn if black castles with the bishop on c8 undeveloped. So white is playing against passive pieces and a slightly airy king. Lets see how this one goes. ",
        "4... Bxb4": "The most critical lines of a gambit are ones where the sacrifice is accepted. It is not considered a good idea to take with the knight, and on move 5.. we will explain this further.  Suffice to say if you are going to take, bishop is best. If you wish to decline, Bb6 is fine, and if I play game in that line I'll also annotate to see what we can learn about that position. Enough to say it is also a reasonable alternative. ",
        "5. c3": "Pushing the bishop back with tempo. ",
        "5... Ba5": "You might wonder why not Bc5 and the position is very similar to the earlier position on move 3 but white has given up a pawn. Not so. If 5..Bc5 then 6. d4 exd4 7. cxd4 and white has a very strong center and easy development. Black's pieces are awkward and has a lot of problems to overcome. This whole idea is why taking with the knight on the previous move doesn't really work. White still just plays c3 here, and d4 next, with a nice center, easy development and soon will look for a strong attack. 5..Ba5 aims to stop all that because if d4 then the c3 pawn is pinned to the king and can't retake, making that strong center. Which white player would try that.",
        "6. d4": "[?!]Apparently I would. Don't get me wrong, the c pawn is pinned to the king and can't retake. So this is now a three(!) pawn sacrifice if black wants it. The best way to play here would be O-O and only then to play d4. d4 is playable to be sure, but white has give away enough pawns that they now MUST get an attack going or the material advantage will be decisive. Some line like 6. O-O d6 7. d4 and black has many options that don't include giving white the massive center. ",
        "6... exd4": "Again, taking is the best way to refute a gambit. What might white be planning. ",
        "7. O-O": "White calmly castles. This must be the best move in the position, but white has given away three pawns for active play. Is this worth it? Maybe. Probably not at the Grandmaster level, but this does see play at almost all other levels of chess. ",
        "7... Bxc3": "Black accepts the gambit'ed pawn again, but gives up the potentially powerful bishop on a5. I think dxc3 is a better try because in this line the rook quickly comes to e1 aiming at the king, but with the bishop on a5 that is not always possible. ",
        "8. Nxc3": "White take a bishop that has moved now 4 times in the opening with a piece that has moved once. That is how to get ahead in development...even at the cost of pawns. ",
        "8... dxc3": "Clearly, though the pawn on c3 is probably falling. ",
        "9. Qb3": "With pressure against f7. This move is common to many possible lines in the Evan's gambit, and is an idea to be looking out for. ",
        "9... Qe7": "Protecting the f7 pawn. Nh6 fails to Bxh6 and f7 is falling. Qf6 and then e5. Nothing here is decisive for white, but all of them give white great attacking chances. ",
        "10. Ba3": "Developing a piece with tempo. ",
        "10... d6": "Seems forced. Qf6 is just like it was the previous move but now white has an extra piece developed. Now maybe black can develop the bishop on c8. ",
        "11. e5": "Taking advantage of the pin on the d6 pawn and that the black queen is guarding f7. I was somewhat temped by Re8 here as well, but that just seemed too slow to me. Note that that pawn on c3 has been hanging for a white now but white really cannot afford to take it because it gives black the tempo they need to consolidate. ",
        "11... Na5": "This move surprised me. I though Qd7 or Be6 were better tries here, with this move looking like a bit of a waste. If something like 12. Qxc3 Nxc4 13. Qxc4 then white has traded a piece for whites very powerful attacking piece. Can you see the move that keeps white's attacking going strong. ",
        "12. Qb5+": "Of course. Obvious maybe, but powerful. Black must go bad to c6 or lose a piece. Black has 4 pieces that still have not moved from their starting positions and white only has 1. Black really needs very precise play from here even to have a chance of holding. I will note the computer has liked white's position for a number of moves yet but this is the one where it's best variations start giving up material for active piece play, which is normally how I determine that one side is actually properly ahead. Of course white has to play well to take advantage, and nothing is easy, but this is a very nice position. ",
        "12... Nc6": "Force or black is losing the knight. ",
        "13. exd6": "As I look over this position the computer prefers the other move I was considering. 13. Rfe1. One problem that I have with these positions is that sometimes I overplay the position and do something too quickly. This is not a mistake, as white still has a great advantage, but just continuing to build pressure is often the better way to play. In my opinion knowing when to win back material and when to continue to build pressure in strong positions is one of the hardest skills to learn in chess. Here I went for this because I saw a forcing line where I thought I was winning and wasn't sure if black had counterplay if I waited. So I didn't wait. Fine, but not strictly speaking correct. ",
        "13... cxd6": "If any other move either rook to e1 with check is winning on the spot. If you leave the queen there of course you just take it. Just for example 13.. Qf6 14. Rfe1+ Ke8 (14..Kf8 and mate in 9) 15. Bd5 (another very strong slow play sort of move) and white is breaking through with rook coming to the d-file and the black king without room to move. There are some nice moves white has to find, but it looks very dangerous. ",
        "14. Rfe1": "Now Rfe1. Still very strong here, but not quite as strong as the previous move. ",
        "14... a6": "I thought black had to play Be6 to try to hold everything together. I was looking at Nd4 (engine tells me this is better but not winning) or Bd5(engine tells me white is much better) or maybe just taking on e6 and trying to deflect the black queen away and taking on b7 (this is apparently winning, but I hadn't seen the line yet. For your enjoyment: 14..Be6 15. Bxe6 fxe6 16. Bxd6! (the move I hadn't yet seen) Qxd6 17. Qxb7 Rook moves somewhere 18. Qxg7 and white is winning the house. \n\nInstead black played this and is giving up the queen. I think if black wanted to try this they can probably resign. Perhaps this is a reasonable try though to trade the queen for some breathing space and hope for a blunder by white. ",
        "15. Rxe7+": "How bad is this postition for black? you might ask. Well it's so bad that the computer suggests the best possible move for white does NOT EVEN involve taking the queen with check. No human is ever doing that...at least I am not. This is winning. Apparently Qb3 is winning harder. ",
        "15... Ngxe7": "Maybe black can even castle this game...that would be a surprise. ",
        "16. Qb3": "And white is up the queen. This game is done. ",
        "16... Bd7": "Black should castle here if they want to have a shot to create some fortress. ",
        "17. Bxf7+": "Look at move 9. Same battery that started it finishes black off. ",
        "17... Kd8 18. Qb6+ Kc8 19. Bxd6": "And dead. I hope this game was as enjoyable for you as it was for me. A little trip down the Evan's gambit. I have some other games in this line I will be showing to you all soon, so if this is a thing you are interested in come and look in a while to see. This one went very well for white and I was winning as soon as move 11, an opening win. Even still I could have played more precisely and I am trying to get a feel of when slowplaying is good and when I need to go in for the kill. Thanks for reading and hopefully we can keep learning together. "
    },
    "url": "https://gameknot.com/annotation.pl/charleshiggies-christmas-new-year-tournament-2016?gm=62485",
    "gameName": "charleshiggie's Christmas/New Year Tournament 2016",
    "players": "tombulous (1860) vs. vectevs (1637)",
    "opening": "Evans gambit (C52), compromised defence"
}