{
    "moves": {
        "1. e4": "I have already annotated how I lost a won position against this same opponent. So in the return match, I was out for blood!",
        "1... c5": "So I played the Sicilian Defence, which usually offers both sides winning chances.",
        "2. Nc3": "More common is Nf3. Nc6 is usually followed by a king's side fianchetto (g3 and Bg2) and a gradual build up on the king side.",
        "2... Nc6 3. Nf3 d6 4. d4": "But now he has transposed back into main lines.",
        "4... cxd4 5. Nxd4 Nf6": "The standard position in the Open Sicilian",
        "6. Bb5": "But this is a bit unusual. 6. Bg5 is the most common move, followed by Bc4 and then Be2.",
        "6... Bd7": "I play the most common reply",
        "7. O-O g6": "This move seemed to score highly on the databases",
        "8. Re1 Bg7 9. Nf3": "To me the white set-up is a little tame.",
        "9... O-O 10. Nd5": "As played in Karklins, Andrew (2355) vs. Serper, Grigory (2535)  (which ended in a draw)",
        "10... Bg4 11. Bg5": "In Karklins, Andrew (2355) vs. Serper, Grigory (2535)  11..... e6 was played. Maybe I should have followed it.....",
        "11... Bxf3 12. Qxf3 Nd4 13. Qd3 Nxd5 14. exd5 Qb6 15. Ba4 Qxb2 16. Bd2 Nf5 17. c3 Rfd8 18. Rab1 Qa3 19. Bb3 h5 20. h3 h4 21. Bc4 b6 22. Rb3 Qc5 23. Bb5": "I think this is where I had a major miscalculation. Simply Qc7 or maybe Qc8 (eyeing my weak white squares and maybe preparing a6 and/or e6 and I have a very sound position. An extra pawn, my errant queen has withdrawn from enemy territory. Instead I try and block the e file, but my queen is soon in trouble.",
        "23... Be5 24. Bc6 Rab8 25. Re4": "and now there is a real danger that my queen will get caught without any squares to move to.",
        "25... Rdc8 26. Rc4 Rxc6": "Of course white could now take my queen, but I would have rook, bishop and pawn for it, and every chance of saving the game. White correctly takes the exchange instead.",
        "27. dxc6 Qa5 28. a4 e6 29. Bf4 Qd5 30. Qxd5 exd5 31. Rcb4 Rc8 32. Bxe5 dxe5 33. Rb4b5": "I was thinking I may be able to save this position - a pawn for the exchange is not too bad.....",
        "33... Ne7": "But 34. a5 is a clever stroke. Of course, if bxa5 \r\n35. Rb8 Rxb8 \r\n36. Rxb8+ Kg7 \r\n37. c7 wins for white.\r\n",
        "34. a5 Rxc6 35. axb6 axb6 36. Rb5xb6 Rc5 37. Rb6b7 Nf5 38. Rb7b5": "I would like to keep rooks on, but I have to exchange or I just lose the d pawn",
        "38... Rxb5 39. Rxb5 Ne7": "and once again he finds the best move! This move wins a pawn, but leaves 3 vs 3 on the kings side. There is still work to be done!",
        "40. c4 dxc4 41. Rxe5 Nf5 42. Rc5 Kg7": "Of course, if Nd6, just Rc6",
        "43. Rxc4 g5 44. Kf1 Kg6 45. Ke2 f6 46. f4 Ne7 47. fxg5 fxg5 48. Kf3 Nf5 49. Rb4 Kh5 50. Rb6 Nd4+ 51. Ke3 Nf5+ 52. Ke4 Ng3+ 53. Ke5 Ne2 54. Rb5 Kg6 55. Rb6+": "Of course, my king has to stay with the pawns - even if I find myself in a mating net!",
        "55... Kh5 56. Kf6 Nc3": "Please let me play Nd5 check! or why not play Rd6 to stop the check, so I can play Ne4 check instead!",
        "57. Rb8 Ne4+ 58. Kg7 g4 59. Rb5+": "Unfortunately I have only one move out of check",
        "59... Ng5 60. Kf6": "and now he wins the rook and the game. So dear reader, what is your view? Obviously I made a big mistake in not bringing my queen to safety, but did I make other mistakes? Was I right to surrender the 2 bishops in an open position? Was it correct to go pawn grabbing with my queen? Over to you!"
    },
    "url": "https://gameknot.com/annotation.pl/charleshiggies-mini-tournament?gm=25257",
    "gameName": "charleshiggie's mini-tournament",
    "players": "righa (1856) vs. charleshiggie (1915)",
    "opening": "Sicilian (B23), closed, 2...Nc6"
}