{
    "moves": {
        "1. d4": "When I ventured e4 against Joanne, I \"only\" drew, so, playing for a win, I opened d4.",
        "1... d5": "She doesn't play the same openings every time, so it was no surprise that she deviated from Nf6 which she played, and lost, against me.",
        "2. c4": "So I played the Queen's Gambit, offering a temporary sacrifice of a pawn.",
        "2... dxc4": "Which is Cambrudge-based Candidate Expert accepted. It is quite sound to accept it - what is normally bad for Black is to accept it and then try and hang on to the extra pawn.",
        "3. e4": "I pick a sharp variation, which scores well for white (40%)",
        "3... e5": "And she picks the most-played variation. If I now take on e5, she can exchange queens on d1 and then play Be6 protecting her pawn on c4. I think that would be good for Black, so I elect for another option.",
        "4. Nf3": "This is the most played move, and scores quite highly (39%)",
        "4... exd4": "Again, taking on d4 is by far the most popular option, according to the Gameknot World opening database.",
        "5. Bxc4": "White recaptures one of his pawns. Again, the most popular continuation.",
        "5... Bb4+": "Black again continues with the most popular move, but I was quite happy. In the database I was using, White scores 41% compared to 22% for Black and 36% draws.",
        "6. Nbd2": "So I continue with the tried and tested way.",
        "6... Nc6": "As does my opponent.",
        "7. O-O": "I ignore the other option, a3, all the 3 games in the database went to Black wins.",
        "7... Nf6": "This is the most common move again.",
        "8. Qb3": "This move was questioned by the after-game computer analysis, which suggested e5 as better. Certainly e5 is more commonly played at this point, but Qb3 has scored well in practice.",
        "8... Qe7": "This move is also questioned by the computer, but it is the only one in the opening database. Computer suggested O-O 8. e5 Ng4 9. Re1 Be7 10. e6 fxe6 11. Bxe6+ Kh8 12. Bxg4 Bxg4 13. Qxb7 Qd7 14. b3 Be6 as better, although I am not convinced!\r\n",
        "9. e5": "This advance scores well on the opening database - White wins both the games on the world database, while the alternative, a3 only scores one draw.",
        "9... Nd7": "Aha, a break from the databases! Ng4 is normally played, although White won both the games on the world database, on the Gameknot database, it is one win and one loss. So now I had a good think. Could I take advantage of the knight being on d7 rather than g4? 10. e6 fxe6 11. Bxe6 Nc5 wouldn't be so clever, white is losing material. But there must be something based on e6. Hang on, what if I play Bxf7 first?\r\n",
        "10. Bxf7+": "So here we go.",
        "10... Qxf7": "Black is forced to take.",
        "11. e6": "White now forks knight and queen. Black's king is going to be stuck in the centre. Ideally Black would like to exchange queens to reduce White's attacking force. However Qg8, with the idea of exchanging on the b3-g8 diagonal doesn't work, as white takes the knight on d7 with check, and then after black has dealt with the check, he can prevent the exchange of queens. Basically white has made the minor concession of giving up a bishop for a knight in an open position, but in return has the balck king wandering round the centre of the board, and there is the lovely open e file to use. Overall white has better prospects.",
        "11... Qg6": "So black moves her queen to a more active square than g8. From g6 she may be able to muster up some sort of king side attack, with Bh3 threatening Qxg2 mate. I have to be careful.",
        "12. exd7+": "So I recapture my sacrificed material.",
        "12... Bxd7": "Black recaptures with the Bishop \"threatening\" to castle queen side.",
        "13. Re1+": "So I develop with gain of time. Black can sacrifice a couple of pawns here to get the king to safety, - Be7 14. Qxb7 O-O 15. Qxc7 - in which case Black instead of having the disadvantage of having a king wandering round the centre of the board, instead has the disadvantage of being a pawn down.\r\n",
        "13... Kd8": "So Black opts instead to keep wandering.",
        "14. a3": "White needs to complete his development, but I can't move my Bc1 while I have a knight on d2 and I can't move my knight on d2 while the black bishop has it pinned against my rook on e1. So the best solution seems to attack the bishop.",
        "14... Bxd2": "Again, black had a choice. Instead of giving up the good bishop for a relatively inactive knight, she could have retreated the bishop - but at the cost of losing the b7 pawn to Qxb7. Black prefer to keep material equilibrium.",
        "15. Bxd2": "I was quite happy with this position, although the computer afterwards only gave me +0.45 here.",
        "15... Kc8": "Black has to protect the b pawn, but maybe it would have been better to play b6. In general the defending side should try and avoid pawn moves on the flank he or she is defending, but here there are opposite coloured bishops, and generally, all other things being equal, black needs to put pawns on black squares to enhance the scope of her bishop and limit the scope of white's.  Also maybe black could put her king on b7 and allow her Ra8 to develop along the back rank.",
        "16. Bf4": "So white continues to develop. Black is going to find it hard to develop the Ra8 to any meaningful square. If she could exchange the positions of her king and Ra8 she would have a fine position.",
        "16... Rf8": "Developing with gain of time. However I wonder if maybe Re8 was better, not allowing white uncontested control of the e file, and, in some variations, exchanging one of the powerful white rooks.",
        "17. Ne5": "White attacks the black queen.",
        "17... Nxe5": "So black exchanges knights.",
        "18. Bxe5": "White doesn't have to recapture with the bishop, even though it was attacked by the rook on f8, as 18. Rxe5 Rxf4 19. Qg8+ wins for white. However it was nice to attack the pawn on d4.\r\n",
        "18... Bc6": "Black threatens mate on g3.",
        "19. Bg3": "Which white easily parries and also opens up the e file again for the rook.",
        "19... d3": "Black hope to get play with her one big asset, her passed d pawn. Although the computer doesn't critiize this move, I can't help thinking Re8 was better, rather than to allow white uncontested control of the e file.",
        "20. Re7": "So let's threaten the c pawn!",
        "20... Bd7": "The computer criticizes this move, and suggests Kd8 20. Re3 Kd7 21. Rxd3+ Kc8 22. Rad1 a5 23. Qc3 Qf7 24. f3 Ba4 25. Bd6 Bxd1 26. Bxf8 Qxf8 27. Rxd1, although I can't really see why white has to retreat the rook on move 20, rather than just take the pawn on c7, or play something like Ra-e1. I think there are other improvements too, and white doesn't seem to have much advantage at the end of this line!\r\nWith the game continuation, black bishop looks a bit silly, moving back and forward between c6 and d7.\r\n",
        "21. Rc1": "And now white threatens c7 again, for another direction.",
        "21... c6": "This loses, it is mate in 5 now. Computer recommends  Qb6 21. Rxc7+ Qxc7 22. Bxc7 Kxc7 23. Qc3+ Kd6 24. Qe5+ Kc6 25. b4 Rf5 26. b5+ Kb6 27. Qd4+ Ka5 28. Rxd7 Rxb5 29. Qc3+ Kb6 30. Qxd3 although white is clearly winning here.",
        "22. Rxd7": "The winning sacrifice. White threatens Qxb7 mate. Other defences, such as Rb8, b6 or b5 also lead to mate just as quickly - see http://gameknot.com/chess-puzzle.pl?pz=30122",
        "22... Kxd7": "So black may as well take.",
        "23. Qxb7+": "but now the black king is dreadfully exposed.",
        "23... Ke6": "Retreating doesn't help. If Ke8, Re1 or Kd8 Qc7. The game is up!",
        "24. Rxc6+": "You may be forgiven for thinking I was going out to win her queen, but I had a bigger fish to fry!",
        "24... Kf5": "So the king keeps running.",
        "25. Qb5+": "And now it is mate next move. Black resigned. I hope you liked the game. Please leave a comment or two and please don't forget to rate my annotation!"
    },
    "url": "https://gameknot.com/annotation.pl/charleshiggies-mini-tournament-ix?gm=34373",
    "gameName": "charleshiggie's mini-tournament IX",
    "players": "charleshiggie (2094) vs. jstevens1 (1798)",
    "opening": "QGA (D20), 3.e4"
}