{
    "moves": {
        "1. a4": "I am the inventor of a chess variant you can play on judochess.com \nJudo Chess is chess without turns! Pieces traverse the board over time rather than jumping immediately to their destination. Once a piece moves, there is a short delay before the piece can move again.",
        "1... a5 2. b4 b5 3. c4 c5 4. d4 d5 5. e4 e5 6. f4 f5 7. g4 g5 8. h4 h5 9. dxe5 dxe4": "going for a queen trade, since judochess skills are more useful in the endgame",
        "10. Qxd8+ Kxd8 11. cxb5": "captures away from the center",
        "11... axb4": "captures towards the center",
        "12. gxf5": "Instead of answering symmetrically with gxf4",
        "12... g4": "I make passed pawn",
        "13. f6": "White is up a pawn",
        "13... Nh6 14. Bg2 Bf5 15. Nd2": "aiming to win my isolated pawn",
        "15... Nd7 16. Bxe4 Rc8": "I am a little more solid, despite being down material. Judochess is a very positional game, so I often value position over material. ",
        "17. Bxf5 Nxf5": "looking at d4 outpost",
        "18. Nc4": "moves to c4-outpost",
        "18... Nd4": "moves to d4-outpost and threatens Nc2+",
        "19. Kd1": "stops Nc2+",
        "19... Kc7": "clearing d-file",
        "20. Bb2": "aiming to remove posted knight",
        "20... Bh6": "attacking pawn that was weakened by bishop movement",
        "21. Bxd4": "removing outpost",
        "21... cxd4": "this opens the c-file to knight",
        "22. Ne2": "attacking isolated pawn while defending own backward pawn",
        "22... d3": "attacks defender while moving safety",
        "23. Nd4": "idea of forking if i take f4",
        "23... Bxf4": "but my rook attacks c4,",
        "24. Ne6+": "after my king moves",
        "24... Kb8 25. Nd6": "so white moves to safety instead of capturing bishop",
        "25... Bxe5": "but now I attack a1-rook",
        "26. Nxc8 Bxa1": "and material is even",
        "27. Nd6": "moving to safety",
        "27... Nxf6": "winning a pawn",
        "28. Kd2": "attacking bishop",
        "28... Be5": "attacking knight",
        "29. Nf7": "attacking bishop",
        "29... Bc3+": "moving to safety while checking",
        "30. Kxd3": "material is even",
        "30... Re8": "centralize with tempo",
        "31. Nc5 Re1": "I decided to go for rook trade, since bishops tend to be stronger than knights in positions with pawns on both sides of the board.",
        "32. Rxe1 Bxe1": "attacking h4",
        "33. Ne5 Bxh4 34. Na6+": "but White wins b4 in exchange for h4",
        "34... Ka8": "I decided to stay where the pawns can promote, but later thought it would have been better to have the king more centralized, since the bishop can play against the passed pawns while helping own pawns, one of the key superior traits of bishops in these types of endgames, applicable in both regular and judo chess.",
        "35. Nxb4": "points are even, but the bishop is a long-range piece, so should be considered more valuable",
        "35... g3 36. Nc2": "I was expecting Ke2, stopping Bf2",
        "36... g2 37. Nf3 Bf2": "winning a piece",
        "38. Ke2": "It may have been better to try to win more decisively, since I was not 100% sure if I could convert the extra piece or not.",
        "38... g1=Q 39. Nxg1 Bxg1": "as long as I don't allow White to win the pawn for free, I should win. I am aiming to force White to trade the knight for the pawn, and then mate with bishop and knight",
        "40. Ne1 Bb6 41. Nf3 Ne4 42. Kf1 Kb7": "here is where I thought Ka8 might have been a mistake earlier",
        "43. Kg2 Bd8": "guarding square in front of pawn. It's a draw if king captures h-pawn, so I am taking all precautions necessary to stop this",
        "44. Ne5 Ng5": "aiming to control f4, so that way I have created a barrier f4, g4, h4. I call this \"Major Simulation\" when minor pieces create a solid barrier that resembles squares controlled by a major piece.",
        "45. Ng6 Ne6": "White can try infiltrating barrier on e5, but that puts king far from h-pawn",
        "46. Kh3": "so White stayed close to pawn instead",
        "46... Kb6 47. Ne5": "Ka5 seems to passive, so I went for centralization, valuing position over material",
        "47... Kc5 48. Nf7": "attacking defender of h4, intending Kh4 with a draw",
        "48... Bf6": "keeping control of h4",
        "49. Nh6 Ng7": "adding a direct defender to h5, the bishop is an indirect defender",
        "50. Ng4": "?? The entire goal of this endgame is to force white to trade the knight for pawn, but here he is voluntarily allowing it !!",
        "50... hxg4+ 51. Kxg4 Kb4": "This is a all standard stuff for the inventor the greatest chess variant on the planet. This endgame occurs frequently in Judo Chess, but is harder in regular chess, since I cannot move the pieces simultaneously.",
        "52. b6": "bishop can control b8 promotion square",
        "52... Kxa4 53. Kf4 Bd8 54. b7 Bc7+ 55. Kg5": "then my king aims for b7",
        "55... Ne6+ 56. Kf5 Nc5 57. b8=Q Bxb8 58. Kf6": "White's king gets more time in the center in regular chess, because I cannot improve all my pieces at once. I start with the king while other pieces must remain patient.",
        "58... Kb5 59. Kf5 Kc4 60. Kf6 Kd5": "centralizing king complete",
        "61. Kf5 Be5 62. Kg6": "In Judo Chess, I would be able to play Ke6 and Bf6 simultaneously, which further pushes White's king back.\n",
        "62... Nd3": "Another big difference from Judo Chess is that I must mate in the corner that is the same color as the bishop, due to the stalemate rule. If passing was legal, then mate would be possible in any corner. I didn't immediately improve my king, since I must seal off White's king from the \"wrong\" corner with the knight",
        "63. Kf5 Nf2": "now I will improve king",
        "64. Kg6 Ke6 65. Kg5 Bd6": "waste move",
        "66. Kg6 Be7": "progress",
        "67. Kg7 Ne4": "improve knight now that king and bishop are more optimal",
        "68. Kg6 Ng3 69. Kg7 Nh5+ 70. Kg6 Nf4+": "4 knight moves in a row",
        "71. Kg7": "but now time to improve other pieces",
        "71... Ba3": "waste move",
        "72. Kg8 Kf6": "progress",
        "73. Kh7 Bf8": "the final stage",
        "74. Kg8 Ke7": "defending bishop, White's king cannot get out of g8, h8, h7 squares",
        "75. Kh8 Kf7": "If bishop is on g5 and Black to move, then Ng6+ Kh7 Nf8+ Kh8 Bf6#",
        "76. Kh7": "In Judo Chess, Bg7 followed by Ne6-Ng5 is very simple, but in regular chess there is a stalemate rule",
        "76... Ne6 77. Kh8 Bg7+": "So the knight mate must come immediately after the bishop check",
        "78. Kh7 Ng5#": "mate with bishop and knight is possible on any size board as long as there is a corner the same color as bishop. In Judo Chess or chess with passing, it is mate on any size board in any-colored corner."
    },
    "url": "https://gameknot.com/annotation.pl/checkmate-with-bishop-and-knight?gm=64742",
    "gameName": "Checkmate With Bishop and Knight",
    "players": "norwegian_warior (1680) vs. hexchess (1825)",
    "opening": "Ware (Meadow Hay) opening (A00)"
}