{
    "moves": {
        "1. e4": "This was played in the National League - 4NCL, Division 3 North, Pool D.",
        "1... c5": "A Sicilian.",
        "2. Nc3": "He opts for a closed variation.",
        "2... Nc6": "Keeping my options open...",
        "3. Bb5": "Signalling that he is playing a Grand Prix attack sort of set-up. I think I should have played Nd4 here attacking the Bishop. It was played out of habit - I normally I meet this move after 2. Nf3 and if Nd4 white can exchange knights.",
        "3... e6": "This is what I played, as I play it in the variation 1. e4 c5 2. Nf3 Nc6 3. Bb5.",
        "4. f4": "White missed the chance to play Bxc6, with a good game.",
        "4... Nge7": "This is fine for black now.",
        "5. Nf3": "The normal developing move.",
        "5... a6": "The logical follow-up to my previous moves.",
        "6. Bxc6": "He takes.",
        "6... Nxc6": "I take back.",
        "7. O-O": "The usual place to put his king in this variation.",
        "7... d6": "I see that 7...Be7 is more usual",
        "8. d3": "He prepares to develop Bc1.",
        "8... g6": "Be7 is more common, but this seems playable.",
        "9. Ne2": "I think white is planning on putting his pawns on black squares, c3 and d4, to give his Bc1 more scope and to restrict the movements of my Bg7. It is not a bad plan, although Qe1 seems to be the only move for white in my opening database.",
        "9... Bg7": "The usual square for this bishop",
        "10. c3": "Continuing with his plan.",
        "10... f5": "Played to stop white from playing f4-f5, and also, by attacking e4, making it harder for him to play d3-d4.",
        "11. Ng3": "So he protects e4 again.",
        "11... O-O": "I finally castle.",
        "12. exf5": "He takes.",
        "12... exf5": "I take back.",
        "13. Re1": "He grabs the open file.",
        "13... Qb6": "Making d3-d4 harder, and also, by attacking b2, making it harder for him to develop his Bc1.",
        "14. Ng5": "Threatening Ne6, exchanging off his knight for one of my bishops. My bishops are better than his knights, as it is an open position.",
        "14... Bf6": "Now Ne6 is simply met by Re8.",
        "15. Nf3": "So the knight simply retreats, with loss of time.",
        "15... Bd7": "I at last develop my Bc8 and connect my rooks.",
        "16. Rb1": "Preparing to develop his Bc1. I miss a tactic here, I could have simply played Bxc3! If he takes my bishop, I take his rook.",
        "16... Rae8": "Instead I just developed.",
        "17. Bd2": "And he finally develops his Bc1.",
        "17... Rxe1+": "I take.",
        "18. Bxe1": "he takes back.",
        "18... Be6": "I hit a2. I am trying to keep his occupied, to prevent him from playing d3-d4.",
        "19. b3": "He simply has everything protected now, and putting another pawn on a white square increases his potential for his black squared bishop.",
        "19... Kg7": "Played to give my Be6 a retreat square on g8, should he play Ng5 again. Computer prefers Re8.",
        "20. Ne2": "Going back to the d3-d4 idea.",
        "20... Bd5": "by threatening to take on f3, I delay d3-d4.",
        "21. Bf2": "But he puts another piece on d4.",
        "21... Re8": "I miss yet another opportunity. I should have taken on f3 to weaken his king-side pawns.",
        "22. Ne1": "And now it is too late!",
        "22... Re7": "I develop the plan of bringing the queen back and doubling on the e file. Computer prefers Qa5 and I tend to think that is what I should have played.",
        "23. Nc2": "Yet another support for d3-d4. Computer prefers c3-c4 followed by b3-b4.",
        "23... Qd8": "I carry on with my plan, but again, the computer doesn't like this move.",
        "24. c4": "I wasn't expecting this, it is a good move, driving my bishop from its powerful post.",
        "24... Bf7": "So the bishop retreats.",
        "25. d4": "And he at last advances.",
        "25... Qe8": "I threaten his knight.",
        "26. Kf1": "King protects the knight.",
        "26... g5": "With the threat of Bh5. I think this is a mistake. My computer thinks the advantage now switches from black to white with this move. Computer prefers d6-d5 and I now agree - it blows the centre open for my two bishops. It is just a move I didn't consider at the board.",
        "27. Qd3": "This seems a strong reply, although computer prefers Ng3.",
        "27... b6": "I simply protect c5 again. Compute prefers g5xf4. ",
        "28. d5": "Gaining a tempo attacking my knight, putting another pawn on a white square, and now because the position is blocked it is no longer clear that my bishops are better than his knights. I think this is getting grim for black.",
        "28... Nd8": "Probably the best square for it.",
        "29. Re1": "White contests the e file.",
        "29... Bg6": "But that gives me a chance to protect f5.",
        "30. Qg3": "Attacking g5 again.",
        "30... g4": "Rather blocking everything up. Computer likes Nf7 here.",
        "31. h3": "Threatening to take on g4",
        "31... h5": "So I protect, with a threat of h5-h4.",
        "32. h4": "And he blocks it up again. ",
        "32... b5": "So I try to open the position on the queen-side.",
        "33. Qd3": "His queen comes back over.",
        "33... bxc4": "I take.",
        "34. bxc4": "He takes back. Computer now gives black an microscopic edge.",
        "34... Qa4": "I try to attack on the queen-side.",
        "35. Nc3": "He protects and attacks my queen.",
        "35... Qa5": "Queen drops back.",
        "36. Rxe7+": "He takes my rook.",
        "36... Bxe7": "He takes back.",
        "37. Be1": "In some variations now he is threatening to move Nc3 and have a discovered attack on my queen.",
        "37... Bf6": "I return to take control of this lovely long diagonal.",
        "38. g3": "He stabilises his king-side pawn formation. if 38. Ne4, with a discovered attack on my queen, simply fxe4 and I am attacking his queen too!",
        "38... Nf7": "I am brinign my knight to h6 to free my Bf6.",
        "39. a3": "Played so he can move his Nc3 without losing his a2 pawn.",
        "39... Nh6": "I complete my plan.",
        "40. Qd2": "Not sure why he played this.",
        "40... Be8": "Carrying on with my plan to mobilise my white squared bishop.",
        "41. Qe3": "Now he is attacking my Be8 and threatening Ne4, so my move is virtually forced.",
        "41... Qd8": "Which is this.",
        "42. Qd2": "And now drawn on white's suggestion. One of my team mates thought black is winning this. Computer does give a slight advantage to black, but I think it is hard to convert to a win, if white plays properly. As our team had already won the match, I accepted.\n\nMany thanks for reading, please rate this annotation on the star system, and leave a comment or two to let me know how I am doing!"
    },
    "url": "https://gameknot.com/annotation.pl/cheddleton-3-v-holmes-chapel-4ncl?gm=61301",
    "gameName": "Cheddleton 3 v Holmes Chapel, 4NCL",
    "players": "Roger Edwards (1757) vs. Charles L Higgie (1869)",
    "opening": "Sicilian (B23), closed, 2...Nc6"
}