{
    "moves": {
        "1. e4": "Yet another game from the Chelyabinsk Variation tournament",
        "1... c5 2. Nf3 Nc6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 e5": "Tournament starting position",
        "6. Nf5": "I'm not sure of the point of this move, it doesn't really achieve much though the knight can prove an annoyance",
        "6... d6": "This is probably a mistake as it blocks the dsb in. though it does open a line for the lsb",
        "7. Ng3": "Further protection on the e pawn but this move seems uneccessary at this time",
        "7... d5": "Loses a tempo",
        "8. Bg5": "This helps to protect white's e pawn by pinning my knight",
        "8... Nd4": "This knight should be hard to shift and threatens c2 which means that for now the queen is on guard duty",
        "9. exd5": "gives white a passed pawn that could be useful later",
        "9... g6": "preparing to fianchetto the bishop.",
        "10. Nge4": "Pressuring the knight further but more importantly taking more control over the central area. Given that white still has an lsb to develop this move could probably have waited as it is forcing me to do what I wanted anyway",
        "10... Bg7 11. Bb5+": "Trying to prevent castling",
        "11... Bd7": "This looks like a mistake as I could lose material here if not careful",
        "12. Nd6+": "Forces the king to move which will mean that my dsb and h8 rook will take some time to extricate",
        "12... Kf8 13. Nxb7 Qb6": "Trying to avoid  13 .. Bxb5 14. Nxb5 which gives white the potential for some string linked rooks and perhaps even pawn promotion",
        "14. Bxd7 Nxd7": "That passed pawn is still a threat but for now not too much of one, I can regain material by taking the b7 knight first",
        "15. Na4": "This is a mistake as it allows me to prevent him castling and perhaps start some threats of my own. The knight on a4 is poorly placed",
        "15... Qb5 16. c3": "Finally he can force that knight away...",
        "16... Re8": "or can he?\r\n",
        "17. cxd4 exd4+ 18. Kd2 Qxb7": "I can't help feeling that I could have made more of this position but can't see quite how. Forcing the black king into the open can't be bad. So in the end I went for possibly the most feeble move, though it did at least regain material",
        "19. b3": "this move looks like a mistake to me as it offers d3 threatening his rook. If I can ensure the safety of the pawn there then my position is looking a little stronger",
        "19... Qxd5 20. Qg4": "Protects the g pawn as well as the bishop",
        "20... Nf6 21. Bxf6": "I'm happy to exchange as it allows my h rook a chance to get out",
        "21... Bxf6 22. Rac1 Qg5+": "Looking to exchange the rook for my bishop with 23 Qxg5, Bxg5   24. Kd3,Bxc1",
        "23. Qxg5 Bxg5+ 24. Kd3 Bxc1 25. Rxc1": "I have to decide now what to do with my passed pawn. ",
        "25... Kg7": "The temptation of all those pawns on the 2nd row proved too much. I figure that although  white has 2 pawns and his knight on the queens side that I can use my newly linked rooks to look after that side",
        "26. Kxd4": "And he allows me to take full advantage. There was little need to take that pawn immediately",
        "26... Re2": "Now I can either gain a pawn advantage on the kingside or even up on the queens side.\r\n\r\nAt this point white resigned, perhaps a little prematurely\r\n\r\nThanks for reading"
    },
    "url": "https://gameknot.com/annotation.pl/chelyabinsk-variation?gm=20717",
    "gameName": "Chelyabinsk Variation'",
    "players": "mujja (1503) vs. elwoos (1589)",
    "opening": "Sicilian (B33), Pelikan (Lasker/Sveshnikov) variation"
}