{
    "moves": {
        "1. e4 c5": "Started off with my normal opening as black with the c5 pawn.",
        "2. Ne2 Nc6 3. g3 g6 4. Bg2 Bg7 5. Nbc3 d6": "Still in the development phase with no real threat from either side.",
        "6. Nd5": "Knight here seems a little aggressive this early in the game especially when other pieces need to be developed.",
        "6... b5": "Accidental move by me due to a computer malfunction.",
        "7. a3": "I suppose to prevent the b4 move.",
        "7... Bb7 8. O-O a6 9. d3": "Still developing pieces.",
        "9... e6": "Decide its time to get rid of the knight.",
        "10. Ndf4 Nge7 11. c3": "I predict an attack in the centre from the queen pawn.",
        "11... d5": "But i attack first which may not be such a great move but with 2 minutes on the clock i didnt have time to think as i would normally have",
        "12. Qc2 O-O 13. Bh3": "Bishop move did seem slightly pointless as i think it would have been more useful on the square it was on. I may have played the queen pawn instead if i were him but i havent checked the outcome thoroughly.",
        "13... e5": "i decide to grab more of the centre. Nxd5 may have weakened my attack slightly.",
        "14. Ng2": "Ng2 instead seems a passive move which blocks his bishop out.",
        "14... d4": "i grab more of the centre for myself.",
        "15. Bd2 Bc8": "i try to get rid of the bishop to allow my rook the file expecting that he will take it\n",
        "16. g4": "g4 seems a very weak move at the time. Blocking his bishop in whilst weakening the pawn structure around the king",
        "16... h5": " i try to trick him to take the pawn not expecting he will take it.",
        "17. gxh5": "Surprisingly he takes !! not sure if its a trap but i decide to take the bishop. Bare in mind that the pawn was the first piece to be taken. ",
        "17... Bxh3": "Thank you.",
        "18. h6": "Decides to push the pawn to attack bishop and cause problems in my defense",
        "18... Bh8 19. Ng3 Bxg2 20. Kxg2 Kh7": "I move the king here to stop pawn advancement ( not that he could) and to also allow the knight to attack the pawn",
        "21. Rfg1": "Not too sure what this was for",
        "21... Ng8 22. h4": "I expect he wants to free up the file for his rooks. ",
        "22... Qxh4": "I take. I know this probably isnt the best move but with less than a minute on the clock i was trying to reach an endgame by getting rid of the pieces.",
        "23. Rgh1": "as expected\n",
        "23... Qg4 24. f3 Qe6 25. Rae1": "50 seconds on my clock versus 1 minute and 50 seconds\n",
        "25... dxc3": "I take hoping that he wont take with queen or bishop",
        "26. bxc3": "he kindly complies.",
        "26... f5": "trying to get rid of pieces",
        "27. Bg5 Bf6": "Bishop swap?\n",
        "28. Bxf6 Qxf6": "Thank you",
        "29. Qe2 f4 30. Nf5": "Blunder again!!!\n",
        "30... gxf5 31. exf5 Qxf5": "Now im six points ahead but drastically behind on time",
        "32. Qe4": "pins the queen\n",
        "32... Qxe4 33. Rxe4 Rae8": "i defend the pawn to allow my knight freedom to roam around. Free range knights are better after all apparently.",
        "34. Rh5 Nxh6": "taking pieces left right and centre. hmmm maybe not so much for left",
        "35. d4": "he wants a swap",
        "35... exd4": "i probably should have taken with the c pawn but taking into account i had less than 15 seconds im suprised i didnt take it with the knight",
        "36. Rxe8 Rxe8": "still swapping",
        "37. cxd4 Re2+": "probably not the best but i knew if he did kf1 i would do nxd4 and alls good",
        "38. Kh3": "surprisingly he goes to trap himself",
        "38... Nxd4": "i continue to take the pawn with an 8 point lead but under 10 seconds left",
        "39. Rxc5": "he pawn grabs",
        "39... Nxf3": "as do i but theres something coming at him (like a dark horse)",
        "40. Rc7+": "goes for a check",
        "40... Kg8 41. Ra7": "threatens the pawn oh no!!!",
        "41... Rh2#": "But its checkmate. With 6 seconds remaining i manage to pull off a win. \nThanks for reading"
    },
    "url": "https://gameknot.com/annotation.pl/chess-game?gm=56617",
    "gameName": "Chess game",
    "players": "???  vs. ??? ",
    "opening": "Sicilian (B20), Keres variation (2.Ne2)"
}