{
    "moves": {
        "1. e4": "Normal",
        "1... c5": "The sharp sicilian defense begins.",
        "2. a3": "2.a3? At first I looked at this move and thought it was a time wasting move so",
        "2... e6": "I just play naturally. Although the pawn push a3 looks innocuous, it's actually part of a deeper plan.",
        "3. b4": "Here is the gambit. White sacrifices his b pawn to be able to play c3 and d4 striking the centre. This is similiar to an evans gambit.",
        "3... cxb4": "I accept it as it's really the only option.",
        "4. axb4 Bxb4": "Lures my bishop to b4 to be able to play c3",
        "5. c3 Be7": "A passive square but probably the best.",
        "6. d4": "Hitting the centre. White has open lines for easy development. I will have trouble.",
        "6... d6": "Holds the e5 square and makes way for the LSB.",
        "7. f4": "White pushes another pawn. ",
        "7... Nf6": "Natural development.",
        "8. Nf3 Nc6 9. e5 Nd7": "Capturing would result in an massive pawn centre.",
        "10. Ba3": "Puts more pressure on the centre.",
        "10... O-O": "Here I make a blunder. I lose my bishop. I obviously didn't see it. A rather silly mistake.",
        "11. exd6": "The bishop is won regardless.",
        "11... Bh4+": "Thorwing one last pointless check before the bishop dies.",
        "12. g3 Bxg3+ 13. hxg3": "Rather dubious. White now has an open H file to work with. I would have to somehow find a way to rip open the centre and attack along the e file.",
        "13... Nf6": "Protecting the h7 square but also another blunder. I will lose the exchange now.",
        "14. d7": "Attacks the rook and bishop.",
        "14... Bxd7 15. Bxf8 Qxf8": "All I have is 2 pawns for a rook now. This position was resignable but I still decided to paly on as I had a clock advantage. I had around 2 minutes and my opponent had about 50 seconds.",
        "16. Bd3": "Pressurising the h7 square even further.",
        "16... Rc8 17. Qc2": "now 3 attackers vs 2 defenders.",
        "17... h6": "Simple!. I just move my pawn. NOw white must push his g pawn.",
        "18. Nbd2": "Bringing another piece into the attack. I have around 1:50 my opponent has around 40 seconds.",
        "18... Ne7": "Rerouting my knight to a mroe defensive square and uncovering a pin.",
        "19. O-O-O": "Although rather dubious probably better than Rxa7.",
        "19... Rc7": "Trying to double up",
        "20. Ng5": "A nice tactic here. I don't find it very dangerous though because it could end up as a perpetual.",
        "20... hxg5": "\nI regain a knight for my lost pawns.",
        "21. fxg5": "Removes a defender of the h7 square",
        "21... Nfd5": "Pressurising the c3 square.",
        "22. Bh7+": "This is crushing. My opponent had about 1 second and I had about 1 minute. I would've respectfully resigned here but I was desperated to win on time.",
        "22... Kh8 23. Bg8+": "Here I respectfully resign. 23.... Kxg8 is forced and then 24. Qh7 is mate. A nice little modified wing gambit played by white. I need some new lines to counter this gambit."
    },
    "url": "https://gameknot.com/annotation.pl/chess-game?gm=41376",
    "gameName": "Chess game",
    "players": "w  vs. b ",
    "opening": "Sicilian defence (B20)"
}