{
    "moves": {
        "1. e4": "This is my first annotation, so be gentle with me. This was a blitz game I played on Gameknot. All of the analysis was done by myself without engines or anything so please let me know anything that was missed as I'm sure I didn't catch everything. Thank you for reading!",
        "1... c5 2. Bc4": "This is not terribly common in the Sicilian, as e6 essentially negates it.",
        "2... e6": "Regardless of the bishop I like playing e6. It allows for my bishop to come to c5 if an exchange occurs and it allows for d5 to be played in one move.",
        "3. Nc3 Nc6 4. Nf3 g6": "I was dubious about this, and retrospectively I think it was not a good move, for a number of reasons. Firstly, it weakens the dark squares on my kingside, which becomes supremely relevant. Secondly, it is intended to allow me to fiancetto my dark squared bishop, which weakens c5.",
        "5. d3 Bg7 6. O-O Nge7": "Developing, but with d5 in mind.",
        "7. Bg5": "Taking advantage of my dark square weaknesses.",
        "7... O-O 8. h3": "A waiting move perhaps?",
        "8... Nd4": "I had been eyeing d4 as an outpost, and this felt a touch premature to me, but I wanted to take it before pushing pawns on my queenside.",
        "9. Nb5": "This was ideal for me, he removed both defenders of d5 with this move, after the exchange.",
        "9... Nxb5 10. Bxb5 d5": "Sure enough, but perhaps a little too eager. Bxb2 was rejected but I wanted control of the center, and after my bishop got chased away my opponent would have the initiative. ",
        "11. Rb1 a6": "Qb6 was toyed with here, the idea being that after 12. Ba4 Bxb2 but my bishop would be pinned to my queen and it would likely be lost. Instead it seemed like the time to push pawns.",
        "12. Ba4 b5 13. Bb3 Bb7": "I didn't do c4 because after 14. dxc4 dxc4 15. Qxd8 Rxd8 16. Bxe7 cxb3 and the material is equal but the position is apparently stronger for white. ",
        "14. a4": "Trying to bust up my pawns and free his bishop from impending doom, also allowing him to escape to a2.",
        "14... Rc8": "The exchange on b5 is not worrisome. Rc6 serves to defend c5.",
        "15. exd5 exd5 16. axb5 axb5": "My pawn chain has been shortened, but it does little to free his bishop.",
        "17. Re1 Re8 18. Ne5 f6": "Here my opponent blundered, allowing my to fork his bishop and knight.",
        "19. Nxg6": "It comes at a price however, as my kingside is busted up a little.",
        "19... hxg6": "I opted to capture the knight because capturing the bishop would allow him to trade knights, giving him the initiative. Debatable reasoning, but whatever.",
        "20. Bh4 Nf5": "This move was made to eliminate his bishop pair. As his dark squared bishop has no where to run.",
        "21. Qg4 Nxh4 22. Qxh4 Kf7": "Defending the weak g-pawn and allowing my rook to come to h8.",
        "23. f4": "Presumably the intent was to challenge the pawns defending my king. However, it exposes the white king a little.",
        "23... Rh8": "Challenging the h file. At this point vague ideas of using the diagonal a8-h1 diagonal and the h file to attack his king. ",
        "24. Qg3 Qb6": "Threatening c4+ winning the bishop. Putting more pressure on the white king.",
        "25. Kh1": "Preventing the check. At this point I saw the opportunity to put a lot of pressure on my opponents king. ",
        "25... c4 26. dxc4": "26. Ba2 was stronger. It essentially produces the same result without exposing the g2 pawn to being pinned by the bishop just yet.",
        "26... dxc4 27. Ba2 Rxh3+": "Taking advantage of the pinned pawn. ",
        "28. Qxh3 Rh8": "Pinning the queen to the king, forcing the exchange.",
        "29. Qxh8 Bxh8": "I was very proud of this attack, starting with Qb6, ending with the exchange for the queen. It since occurred to me that two rooks for a queen and a pawn is exactly equal, but when I smelled her majesty's blood in the water I couldn't help myself. Anyways, blacks position seems substantially stronger here.",
        "30. b3 Qc6": "Eyeing mate on g2, the idea being to tie up one of his rooks. If 31. Re2, the Bishop is vulnerable to a pin (tying up two pieces), after 31. ...Qa6 32. Ra1 if 32. Rb2, white loses the bishop after 32. ...f5. If 31. Rg1 Qd5 32. Kh2 (at risk of Qh5#) Qh5+ 33. Kg3 f5 34. Rbd4 Qg4+ 35. Kf2 Qxf4+ 36. Ke2 Bd4 37. Rxd4 Qxd4 winning the exchange (and shortly thereafter the game). ",
        "31. Re2": "My opponent opts for the best move, at this point it occurred to me that his rooks could be doubled against my king. But it seemed an unlikely move, there did not seem to be any mates and it would come at the price of his kings tenuous safety and his g pawn. Retrospectively, his bishop is absolutely useless where it is, and his attack could draw the game.",
        "31... Qa6": "Retrospectively I would regard the whole idea of attacking the bishop as a mistake. It gave my opponent too much counterplay and took my queen out of the action.",
        "32. Rbe1": "At this point he is apparently hanging his bishop on a2, yet if taken without regard material is equalized and position is weakened after 32... Qxa2 33. Re7 Kg8 34. Rxb7 Qa8 35. Re7",
        "32... Bxg2+": "Checking the king and winning a pawn, allowing for Qxa2 without the threat of the fork. This tactic made me a little nervous, taking my queen so far away from the defense simply to win a pawn, but after a cursory (this was a blitz game) examination of the position it seemed he did not have the resources to checkmate my king, despite the evident precariousness (although after the fact I found the game could have been drawn, so I was quite correct to be hesitant). ",
        "33. Kxg2 Qxa2 34. Re2e7+ Kg8 35. Re7e8+ Kh7 36. Re1e7+": "?? This move loses the game. If 36. Rh1+ the game could have been drawn with neither player having the resources to win the game without getting perpetual checked. ",
        "36... Bg7": "36... Kh6 was out of the question, because of 37. Rxh8#. At this point, seeing no continuations for his attack, my opponent resigned."
    },
    "url": "https://gameknot.com/annotation.pl/chess-game?gm=47464",
    "gameName": "Chess game",
    "players": "samuelmccormick4  vs. ilr2001 ",
    "opening": "Sicilian defence (B20)"
}