{
    "moves": {
        "1. e4 c5 2. d4": "I would've played 2.Nf3 because that's what I'm most used to as I like the open variation.  But, I'm very used to the Morra Gambit, as I have played against this, even against ION.",
        "2... cxd4": "Of course, black accepts because it is a gambit, so it wins a pawn.  But, seeing that she gave, and sometimes you benefit from a combination which is the sac of material to get an advantage, it'll be interesting to see what Susan has in mind.",
        "3. c3": "She wants to exchange, which black will accept.  I think the idea is so that she can play Nc3 as c3 is blocked off by the d pawn.  So, white wants to eliminate that obstacle.",
        "3... dxc3": "I'm not surprised that black accepts.",
        "4. Nxc3": "So, my instincts were correct.  That idea behind the exchange was to enable white to play Nc3.",
        "4... Nc6": "Black has similar ideas with the idea of developing the N.",
        "5. Bc4": "Understandable, but I would've gotten aggressive with 5.Bb5",
        "5... e6": "I don't know why she played this, as opposed to, 5...e5 as that's what I would've played.  But, unlike in your games, sometimes, you don't know why a GM made a move, which is part of theory, and thus, also a way to learn, as it's then up to you to figure out why that move was played.",
        "6. Nf3": "Not surprisingly, she's getting ready to castle.",
        "6... a6": "I believe, to prevent the annoying 7.Bb5",
        "7. O-O": "But, my instincts were spot on, as this was white's plan with her last move.  So, I'm not surprised, and I'm pretty sure that even if, black didn't play 6...a6 she would've played this.  Now, there's something say about that, which is why I find ...a6 questionable, as well as, other moves.  White already has a noticeable lead in development and her K is safe.  Let's count, Susan only needs to bring out one more piece before development is complete.  Whereas, Sirko has only developed one piece and hasn't castled, yet.  Therefore, white should have a noticeable advantage, but anything can happen in a GM game.  And, it's too soon to conclude anything because as everyone pointed, there are, in general, exceptions and one cannot stuck on development.  With that being said, things are already starting to become interesting.",
        "7... d6": "The problem here, I don't know if general or not, but they say you shouldn't do this, is that black is cramming in her DSB.  This is similar in most QP games, when you bring the c N early, in the fact that, you are blocking off the c pawn.  Well, something similar, with what I mentioned, could be said here.  With that, I think that white has a bigger advantage then, even, a move earlier.",
        "8. Bf4": "Completing development.",
        "8... Be7": "But, as noted, her DSB is crammed.",
        "9. Qe2": "Now, her R's are connected which is also something you'd want to do.",
        "9... Na5": "Trying to win the her LSB.  I heard of this happening with novices, and I always thought it was only with them.  But, after playing through, at least one possible variation, in almost every GM annotation, I realize that this is also common with GM's, as well.  That you attack a piece, and I figured out the idea.  It's really to gain tempo since time is, perhaps, one of the most important things, as damalfi has previously noted.",
        "10. Bd3 Nf6": "Developing and preparing to castle.  So, there was, afterall, more to this story then meets the eye.  In other words, it was, afterall, too soon to conclude that anyone had the advantage, so I'm glad that I inferred, as opposed to, conclude, as I would've been wrong.",
        "11. Rfd1": "I'm not exactly sure why Susan played this.  Probably to add pressure on the d file with the B, since the LSB is protected.  I would've, however, played 11.Rfe1 because the idea, which I recently learned, is that GM's often put the R directly behind the Q, and the idea being is to add more pressure and, sometimes, create threats that have, at times, proved to be overwhelming.",
        "11... e5": "As noted earlier, to gain tempo.",
        "12. Bg5 Be6": "And, the reason, as I now see, was to develop another piece, whilst, achieving a strong bishop pair.",
        "13. Nxe5": "Ok, there must be a plan here, but I'm not exactly sure what it is.  But, Susan does make the combination with this sac.  However, whatever the plan is, it must be good because in a previous lesson, she implied that GM's will often sac for a beautiful combination.  And, as she recently said in the course I'm taking, \"making a beautiful sacrifice of material like this is every chess players dream come true.\"  That is especially true for GM's, though. \n",
        "13... dxe5 14. Bxf6": "Offering another sac.",
        "14... O-O": "But, now that black castled, it is safe to conclude that 14...gxf5?? would've lost immediately.  And, seeing what black did, we now know that the K would've become exposed, had she played that, with no way out of it.  With that being said, black made the right choice.  However, black will lose an important pawn, in return, as it is right in the center.",
        "15. Bxe5 Bf6": "I don't know why Sirko wants to liquidate pieces, as she is down a pawn.  With that being said, I'm not surprised that white accepts.",
        "16. Bxf6 Qxf6 17. e5": "And, as noted, I'm also not surprised with this move, either.  Not to mention that I studied one of those variations in a GM game.   I remember, it was by my favorite annotator, in the game between Carlson and Topalov where I variation that involved a move like this was mentioned.",
        "17... Qg5 18. Qe4": "Now, Susan, in one of her books I had an a solution on forks mentioned about a mate threat, just like this.  And, it's not unsound, as Susan would not never make a threat, if it involved unsound aggression.  Instead, the threat is very difficult to drive off, and when black does so, while I'm not exactly sure how, it will negatively affect her position even more.  With that being said, I think it's pretty safe to infer that white is winning.  However, I'm not concluding and is, by no means, a fact, but rather, an opinion based on what I've studied from this teacher.",
        "18... Qh6 19. Rac1": "I believe the idea is adding pressure to the c file.  ",
        "19... Nc6": "I do not know why she played this.  Personally, I would've played 19...Rac8 with the plan being to put pressure on the N.",
        "20. Bb1": "But, this move makes sense, as now, the R can move up the ranks which would prove to be powerful.  In this particular position, I'm not sure exactly how, but it would become dangerous, sooner or later.  At least, in my opinon.  And, if I'm right, then playing this makes perfect sense to me.",
        "20... Rfd8": "The same thing could also be said with black.  In my opinion, this is what black wants, but Susan won't allow it as she doesn't exchange.  In this position, I would've just for the purposes of liquidation where you exchange pieces while ahead.  But, the thing is, that GM's have mind of their own, and I don't know exactly how they think.  This will change in the next lesson with Susan as I will explore the minds of GM's based on how they think which is something I've been wondering for a while.",
        "21. Ne2": "I don't know why she played this.",
        "21... Rac8": "To add a defender to her N.  I know because I've heard of this, and whenever you play a move like this, where another piece or pawn covers the same square like this, you're, in reality, adding a defender.",
        "22. Nf4": "Putting pressure on the LSB.",
        "22... Bg4": "Not surprisingly, black won't allow it as liquidating isn't an option.  And, she makes an attack of her own, against one of the R's.  This is also typical for what I've, personally, seen in GM games.  That, when the player attacks, the opponent reattacks.  In addition, this was mentioned in variations that I've played through.",
        "23. Rd6": "Also typical for the reason mentioned above.",
        "23... f6": "Wants to exchange pawns.",
        "24. Qd5+": "But, white has ideas of her own.",
        "24... Kf8 25. Rcxc6": "Now, she sacs N for R.  One could view it as a blunder, but when it's a GM, it's anything but a mistake.  GM's like to make those combinations and sac material, as it often wins.  That is, either by mate, but more often, is that they compensate, and when they do, it's the opponent that winds up losing material, instead.",
        "25... Rxd6 26. Qxd6+ Ke8": "And, it's almost what I mentioned.  But, when I talked about losing more material, I meant that the opponent winds up further behind.  That, however, does not happen here.  But, there is so much liquidation, and black is just as far behind, that when, all is said and done, black will, virtually, have nothing left.  Therefore, with what's about to happen, it's safe to conclude that white has a won position, at this point.",
        "27. Rxc8+ Bxc8 28. Ne2": "Yep, and black resigns here.  Personally, I would not have, but what I know is that players like me should not give up hope because there might be a second chance, if the opponent doesn't find the right move.  That's why the idea is, \"Don't give up right away.\"  Which was kind of that same idea, as to, what I noted in my last annotation.  But, the really strong players, however, will often resign after being a piece down as there's generally, no chance of compensation since they're up against the strongest players, such as, this opponent. "
    },
    "url": "https://gameknot.com/annotation.pl/chess-game?gm=59279",
    "gameName": "Chess game",
    "players": "GM Susan Polgar  vs. Sirko ",
    "opening": "Sicilian (B21), Smith-Morra gambit, Chicago defence"
}