{
    "moves": {
        "1. e4 c6": "I've decided I want to play the Caro-Kann defence because I see the masters play it and I like the sort of game it leads up to... lots of maneouvring and such. I'm afraid it's one of those ones where you have to get the timing just right for things to work though. A lot of the openings are like that nowadays. Another opening I like for Black, retorting 1. e4 is 1. ... d6, the Pirc defense, often followed by 2. ... Nf6 3. ... g6 4. ... Bg7 5. ... 0-0. I like it because up to that point it's hard to make a mistake. But from then on things get more complex. That's why I'm sticking to Caro-Kann.",
        "2. d4": "Believe it or not, some people actually play 2. c4 here instead. And it's actually a very formidable opening, in my opinion. Leads to 2. ... d5 3. exd5 cxd5 4. cxd5 Nf6 5. Nc3 Nxd5 6. Nf3 and White has a very good game. 2. c4 is called the anti-Caro-Kann defence and 2. ... d5 is called the anti-anti-Caro-Kann defence, believe it or not! If you don't, google it! Go ahead! Pretty ridiculous really. But I can see where they're coming from. Instead, a better response to 3. exd5 is 3. ... Nf6 4. d4 cxd5 5. Nc3 g6 and Black has got a more playable game.",
        "2... d5 3. e5": "The advance variation. I do not like this for Black. I don't know why, I just don't like the sort of game it brings about. I like more 3. Nc3 dxe4 4. Nxe4 Nd7, leading to a more interesting game, in my own opinion.\n\n3. f3 is interesting as well, to say the least. Leads to 3. ... e6 4. Be3 Nf6 5. e5 Nfd7 and White has a lot of space. Also Black's c8 Bishop is hemmed in. 3. f3 is the Tarkatower fantasy variation.",
        "3... Bf5": "I quite like the look of 3. ... c5 here. Leads to 4. dxc5 Nc6 5. Bb5 e6 6. Be3 Nge7 7. c3 Bd7. Mind you, 6. Qg4 is deadly. Leads to 6. ... h5 7. Bxc6+ bxc6 8. Qa4 and black is in trouuuuuble. So maybe 3. ... c5 isn't that great after all. Depends how smart White is. :)",
        "4. c3": "(!?) This move surprised me a bit. Is this a normal variation? Because I haven't encountered it before. I guess it transposes later on, but I usually expect something like 4. Bd3. But I reckon the best thing to do if you don't know the opening is to do what you'd usually do in the regular opening. If what he does doesn't hamper that, of course.",
        "4... e6 5. Bd3": "(?!) Better is Be3 or Be2. 5. Bd3 gets rid of White's crucial white squared bishop, which is waay better than my own.",
        "5... Bxd3": "I'm happy to trade this off.",
        "6. Qxd3 Nd7": "Maybe 6. ... Qb6 was better. That would immobilise White's bishop for a little while, and point at d4. Maybe even 6. ... c5. Very aggressive. 7. Nf3 Nc6 8. 0-0 Qb6 9. a3! cxd4 10. cxd4 Nge7 and White has the advantage again. So maybe not. 9. a3! stops the knight from moving to b4, and gaining tempo from threatening the Queen. I thought that was a genius move, too, by the way.",
        "7. Qg3": "(?!)",
        "7... c5 8. Ne2": "(!?) This is better than Nf3, in my opinion. White anticipates that I'm going to castle kingside, so he/she can push his f-pawn on the attack anytime he/she likes.",
        "8... Ne7 9. Bg5 Qb6 10. b3 h6": "(!?) I sacrifice my pawn, albeit unwittingly, for a major mobility boost.",
        "11. Bxe7 Bxe7 12. Qxg7": "A specific type of the Poisoned Pawn variation? Not so sure.",
        "12... O-O-O": "(!?) I again sacrifice a pawn to make for better of my rooks onto the h and g-files. However, my kingside is very loose, and at risk.",
        "13. Qxf7": "(?!) Not very sure if gaining an extra pawn is best in this situation, but I guess it's all he's got.",
        "13... Bg5 14. O-O": "(?) Castling right into where my rooks will aim.",
        "14... Rdf8 15. Qg6": "(?!) Better is 15. Qh5, I'd think.",
        "15... Rhg8": "I gain tempo by threatening the Queen, and putting my rook on the semi-open g-file.",
        "16. Qd3 Qd8": "I prepare to bring my Queen onto the Kingside.",
        "17. dxc5 Nxc5 18. Qb5 Ne4": "All my pieces are developing onto the Kingside. We know how this is going to end, right? ... or do we?",
        "19. Nd4": "(!?) Developing towards my king, but sacrificing the key square f4 in the process.",
        "19... Bf4": "(!??????????) I'm really not sure if this is the right move. My brain fails me. But I sacrifice material for a possible mate... somewhere along the line.",
        "20. Nxe6 Qh4": "Threatening Qxh2#.",
        "21. g3 Bxg3": "(!?) Again I sacrifice material for the win. But do I have a choice?",
        "22. fxg3 Rxg3+": "(?!) Yet more material. I'm starting to wonder whether this will pay off or not.",
        "23. hxg3 Qxg3+ 24. Kh1 Rxf1+": "(??) Misses a crucial mate with 24. ... Qh3+ Kg1 25. Rg8+. From here things spiral downhill.",
        "25. Qxf1 Nf2+ 26. Qxf2 Qxf2 27. Na3": "(?!)",
        "27... Qb2": "Forking the Na3 and Ra1.",
        "28. Rd1 Qxa3 29. Rxd5 Qe7": "(??) 29. ... Qc1+ is better. 29. .... Qe7 leads to an exchange with me having the worse pawn structure. With 29. ... Qc1+, I can check until I fork one of those pieces above. It should happen, either that or a draw. But that's better than the loss I suffered.",
        "30. Rd8+ Qxd8 31. Nxd8 Kxd8 32. Kh2 Ke7 33. Kh3": "Holding onto the e-pawn would only lead me to push the h-pawn.",
        "33... Ke6 34. Kh4 Kxe5 35. Kh5 Ke4": "(?) Here I should have played 35. ... b5. Even earlier might be better, but I wanted to be sure I had the e-pawn under my belt. 35. ... b5 prevents a4 or c4 pawn moves, because I'll just trade it in and gobble up the isolated pawn.",
        "36. Kxh6 Kd3": "(?) Again, 36. ... b5 is better.",
        "37. c4 Kc2 38. Kg6 b6": "Only now do I catch on.",
        "39. Kf6 Kb2 40. Ke6 Kxa2 41. b4 Kb3": "(??) I blunder. 41. ... a5 is better. After 42. c5 axb4 and at least we'll both queen on the same move. Almost certainly a draw.",
        "42. c5 Kxb4": "(??) Another blunder. Better was 42. ... bxc5 43. bxc5 a5 44. c6 a4 45. c7 a3 46. c8Q a2 and it's a classic endgame where he can't take my pawn away from me, because I just hide behind it. Do your own research on this one.",
        "43. c6": "Black resigns. Not sure if I should have. Can I still win here? I think I might. Ah well, it was a blitz game. But thanks for watching, I lost, but I had a missed mate there, so if it wasn't a blitz game, I might have won. Anyway, thanks for watching and take care. Cheers.\n\n-thatbennyguy"
    },
    "url": "https://gameknot.com/annotation.pl/chess-game?gm=32795",
    "gameName": "Chess game",
    "players": "supadestroya (1200) vs. thatbennyguy (1200)",
    "opening": "Caro-Kann (B12), advance, Short variation"
}