{
    "moves": {
        "1. d4 d5 2. c4 Nf6": "QGD (D06), Marshall defence",
        "3. cxd5 Qxd5 4. Nf3 Bg4 5. Nc3 Qc4": "Här lämnar svart QGD (D06), Marshall defence. Qh5 hade varit i den linjen.",
        "6. e3": "Här hade jag förvisso en gaffel med S på e5 mellan hans D och L, men jag väljer ett mer långsiktigt drag med e3. Mina möjligheter att göra rockad bibehålls lättare då.",
        "6... Qb4 7. Bd2 Qxb2": "Svart förlorar tempo genom att göra futtiga drag i följd med sin D.",
        "8. Rb1": "Förmodligen hoppas svart på en utväxling av D inom kort, men det blir endast D-förlust p g a min S parering.",
        "8... Qa3 9. Rxb7": "Här missade jag S-pareringen på b5 med hans D-förlust, men det kommer nya kombinationer.",
        "9... e6": "Finemang, gaffeln på b5 kvarstår. Siktar sedan mot c7 och gafflar svarts K och T. Parerar han med D på a6 så har jag L på f1 som slår hårt. Slår han min bonde a2, så gafflar jag ändå på c7 och tar hans T.",
        "10. Nb5": "Parerar han med Qe7 så gafflar jag på c7 ändå. Den utväxlingen ger mig hans D mot mitt T, om jag täcker med D på b3.",
        "10... Nd5": "Trevligt. Då tar vi hans D redan nu istället.",
        "11. Nxa3 Bxa3": "En snabb blick, och jag ser en en damgaffel som dessutom involverar svarts K.",
        "12. Qa4+": "Taktiskt snygg.",
        "12... c6 13. Qxa3": "Som det har utvecklat sig kan man nästan hoppa över mittspelet och gå direkt på slutspel. Skit samma om hon/han slår min S på f3 och sabbar mitt försvar. Eftersom jag leder så pass stort materiellt är det inte lika viktigt.\n\n*Svart gav sig här."
    },
    "url": "https://gameknot.com/annotation.pl/chessimpsons-58?gm=29101",
    "gameName": "Chessimpsons 58",
    "players": "chekof (1247) vs. chicks93 (1156)",
    "opening": "QGD (D06), Marshall defence"
}