{
    "moves": {
        "1. d4": "youll see this opening in my other annotated game\r\nIt is NOT pretty, I lose some minors due to carelessness",
        "1... b6": "fiancetto? ok",
        "2. e3 Bb7 3. c4 e6 4. Nf3 g6": "DOUBLE FIANCETTO!!?!",
        "5. Nbd2 Bg7 6. Qe2 h5": "!?!?!?!?!?!?!?!?!?!?!?",
        "7. Ne4": "I admit this was a mistake, I drop a free minor. never do this move. ",
        "7... Bxe4 8. Ne5 Nc6 9. d5": "heres the other free minor",
        "9... Nxe5 10. dxe6 fxe6": "always take with the outer pawn",
        "11. c5": "I sac'd the poor pawn to unclog the diagnol of nowhere",
        "11... bxc5 12. Qb5 Rb8": "!?!?!?!? free pawn, anyways",
        "13. Qxc5 Bf8": "!!!!!!!!!!!!!!!!!!???????????????????? this person't turn to be careless, i guess. two free pawns in a row.",
        "14. Qxa7 Nd3+ 15. Bxd3 Bxd3 16. Qd4": "this is a lovely fork, where i redeem myself. note that I'm exactly a rook's worth of points down at this point",
        "16... Bb4+": "prolonging the inevitable ",
        "17. Bd2": "should he take?",
        "17... Bf5": "he made 2 mistakes: one is the b bishop and the other is...",
        "18. Qxh8": "... this.",
        "18... Ke7 19. Bxb4+": "i honestly did not see the rook, if this plan wasn't thought out as well as it was, this would have worried me",
        "19... Rxb4 20. Qh7+ Ke8": "mistake #.... i lost count",
        "21. Qxg8+ Ke7": "i wanted to trade queens, kind of. the bishop scared me a little in a battle of otherwise rooks. ",
        "22. Qg7+ Ke8": "?",
        "23. Qc3 Qb8 24. Qh8+ Ke7": "this is where i was most tempted to trade. oh well, should've when you could've (skillet)",
        "25. Qh7+ Kd6": "vicious cycle broken",
        "26. Qg7": "should've moved there in the first place. make a mental note if you find yourself in this EXACT spot",
        "26... Rxb2": "saw this coming, didn't think it was a threat. moving on. (now that i see the bishop, i see the potential danger)",
        "27. Rd1+ Kc6 28. Qxd7+ Kc5": "can you find the way to take the rook for free? ",
        "29. Qd4+ Kc6 30. Qd7+": "this was unnecessary please ignore this for the rook puzzle.",
        "30... Kc5 31. Qd4+ Kc6 32. Rc1+": "you can almost hear the burn.",
        "32... Kb7 33. Qxb2+ Kc8": "if I was going to trade, I would have done it now. but i didn't, instead i got a free queen in 3 moves: watch (can you see it?)",
        "34. Qh8+ Kd7": "he moved there to prevent the deadly king-queen rook pin, it was a good move.",
        "35. Rd1+": "another non required move, but just to drive my point home",
        "35... Ke7 36. Qxb8": "Resignation. White wins this game, an unavoidable attack on c7 would force the king into hiding behind is precious e pawn. I would castle and hit him with the triangle attack of queen rook rook"
    },
    "url": "https://gameknot.com/annotation.pl/chess-game?gm=35065",
    "gameName": "Chess game",
    "players": "???  vs. ??? ",
    "opening": "Queen's pawn (A40), English defence"
}