{
    "moves": {
        "1. d4": "1.d4 seemed my best choice against a much stronger opponent, avoiding the highly tactical versions of the more open e4.",
        "1... d5 2. Nf3 Nf6 3. g3 e6": "Game knot openings database gives this as one of the poorer choices for black.",
        "4. Bg2 Be7 5. O-O O-O": "A quiet opening which suited me fine.",
        "6. Nbd2": "Apparently not the best choice for white.",
        "6... Nbd7 7. c3 b6 8. Qc2": "Aiming at e5.",
        "8... Ba6 9. Re1 Rc8 10. e4 dxe4 11. Nxe4 Nxe4 12. Qxe4 c5": "I was hoping for 12....Nf6 so I could play 13.Qc6, but black is alive to this.",
        "13. Be3": "Developing and supporting d4.",
        "13... Nf6 14. Qc2 Bb7 15. Rad1": "QR develops",
        "15... Be4": "Black continues to drive white's queen and claims the centre with his magnificent bishop.",
        "16. Qc1 Qc7 17. dxc5 Qb7 18. Nh4": "Black is threatening to win the night so it has to move and protect the bishop on g2. ",
        "18... Bxc5 19. Bd4": "I don't want to take on c5 and develop black's rook.",
        "19... Bxd4 20. Rxd4 Bd5": "Black decides not to \"blink first\" and exchange the white bishops.",
        "21. Qd2 h6 22. c4": "Claiming d4.",
        "22... Bc6 23. b3 Nh7": "If black gets the N to g5, I'm in all kinds of trouble.",
        "24. f4": "So I feel forced to play f4, leaving my king rather exposed.",
        "24... Nf6 25. Rd1 b5 26. h3": "I need to avoid the possible pin on d4.",
        "26... bxc4 27. bxc4": "Maintaining control of the d-file",
        "27... Ne4 28. Qe3 f5": "Black confessed afterwards that f5 was a poor decision.",
        "29. Ng6": "I need to take advantage of this to release my position.",
        "29... Rfe8 30. Ne5 Ba4": "Time control reached. I have 3mins left and black 20mins; we add 15mins to finish the game.",
        "31. Bxe4 fxe4 32. Rd1d2 Qb1+ 33. Kg2 Bc2 34. Rd4d7": "This looks like an opportunity not to be missed!",
        "34... Kh7": "With the view to play Rg8 to protect possible double attack on g7. So this is the key position. What should white do next? Take some time to think about it, ....but I only have 10 minutes left!",
        "35. Rxg7+": "Surely this is a straight-forward win, after I check again and double R & Q on the 7th rank?",
        "35... Kxg7 36. Qxa7+ Kh8 37. Rd7": "A blunder!",
        "37... e3": "I had missed this move completely. h7 is now well defended and black threatens mate in return.",
        "38. Nf7+": "Nothing else to do.",
        "38... Kh7 39. Ng5+ Kg8 40. Rg7+ Kh8": "And now if I play 41. Nf7 I lose another rook, so in Zeitnot I play 41.g4? in more hope than expectation.\nIn fact Nf7ch was the best move and white can then at least hold a draw.\ne.g.  41...KxR, 42.Ng5ch  Kg7, 43. Qf7ch Kh8, 44.Qf6ch, Kg7 45.Qf7ch etc.",
        "41. g4 Be4+ 42. Nxe4 Qxe4+ 43. Kg3 e2": "White resigns.\nSo here's the puzzle for you....how should white have played the game to force mate from move 35?"
    },
    "url": "https://gameknot.com/annotation.pl/chess-game?gm=62269",
    "gameName": "Chess game",
    "players": "EB (ECF156) vs. RW (ECF198)",
    "opening": "Queen's pawn game (D02)"
}