{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Bc4 Bc5 4. b4": "Primera vez que juego un Gambito Evans de negras.",
        "4... Bxb4 5. c3 Be7": "Variante bastante sólida, la conocía de una partida Kasparov-Anand",
        "6. d4 Na5 7. Bd3": "No conocía esta movida.",
        "7... exd4": "También d6 se ha jugado.",
        "8. cxd4 d5 9. e5 Bb4+ 10. Nbd2 Ne7 11. Qc2 Nac6 12. Rb1 h6 13. O-O O-O 14. Nb3 a5": "Buena movida, creo que después de esto, la partida queda más o menos parejas aunque objetivamente con más chances para las negras.",
        "15. a3 a4 16. Nc5 Bxc5 17. Qxc5 b6 18. Qc2 Ba6 19. Bxa6 Rxa6 20. Bd2 Qd7 21. Rfc1 Rc8 22. Qd3 Raa8 23. h3 Nd8 24. Nh4 g5": "Jugada precipitada ya que me encontraba con menos de 10 minutos en el reloj.",
        "25. Nf3 Qe6 26. Nh2 Qg6 27. Qf3 h5 28. g4 h4 29. Qf6 Qxf6 30. exf6 Ng6 31. Bxg5": "Luego de unas cuantas escaramuzas y un juego más o menos correcto de ambos, se reestablece la igualdad de materia, pero las negras quedan activas.",
        "31... Ne6 32. Nf3 c5": "Buena movida, pensé que me daría el triunfo, ya que calculé la variante que ganaba pieza, pero no en qué condiciones.",
        "33. Rxb6 cxd4 34. Rd6 Rc3": "Con esta movida pensé que ganaba la partida.",
        "35. Rxc3 dxc3 36. Rxd5 Nxg5 37. Rxg5 Rc8 38. Nd4 c2 39. Nxc2 Rxc2 40. f4 Rc4 41. f5 Rc5 42. Kf2": "Aquí ya es tablas, los peones fueron más peligrosos de lo que pensé.",
        "42... Rc6 43. fxg6 Rxf6+ 44. Ke3 fxg6 45. Ra5 Rf1 46. Rxa4 Kg7 47. g5 Rg1 48. Rg4 Ra1 49. Ra4 Rg1 50. Ra7+ Kf8 51. Ra8+ Kg7 52. Ra7+ Kf8 53. Ra8+ Kg7 54. Kf4 Rg3 55. Ra7+ Kf8 56. Ra8+ Kg7 57. Ra7+ Kf8 58. Ke5 Rxg5+ 59. Kf6 Rf5+ 60. Kxg6 Rf3 61. Kh5 Rxh3 62. Kg4 Rh1 63. a4 Ke8 64. a5 Kd8 65. a6 Kc8 66. Rh7 Kb8 67. Rxh4 Rxh4+ 68. Kxh4 Ka7 69. Kg4 Kxa6": "Una buena partida por ambos bandos, con pocos errores y muy luchada"
    },
    "url": "https://gameknot.com/annotation.pl/chess-game?gm=55925",
    "gameName": "Chess game",
    "players": "Abarca, Nicolás  vs. Pérez, Matías ",
    "opening": "Evans gambit (C51), Cordel variation"
}