{
    "moves": {
        "1. e4": "Rapid chess time control 5 min+10 seconds per move as black. Please keep in mind as rapid games don't often yield themselves to perfection. \n\nMove 1- Book opening pawn E4",
        "1... c5": "c5. I opened Book Sicilian defense c5",
        "2. Nf3": "Book NF3",
        "2... d6": "Book d6",
        "3. Bc4": "Book Bc4 it appears white is playing the Italian game opening putting pressure on the weak f6 square. ",
        "3... e6": "e6. I chose to play e6 to prevent kf6-combination attack and to also open diagonal for future bishop development. ",
        "4. Nc3": "kc3. White plays book Nc6 development threatening the d5 and b5 squares respectively. ",
        "4... a6": "book a6. This move is in preparation to develop Nc6 without having to worry about being the king being pinned by Bb5 should white choose. Also preparing to force the white bishop to retreat off the positionally valuable long diagonal facing my weak f7 pawn. ",
        "5. d4": "d4. White plays book d4- thrust to the center in attempt to take the center of the board. ",
        "5... b5": "I played b5 to attack the white bishop and force him off the valuable long diagonal. This also prepares me to develop bishop b7 to attack white square g2 expecting white to castle king side. ",
        "6. Be2": "White retreats bishop to e2 fearing being kicked again if my response would be c4 as opposed to cxd4. Other options lead the white bishop to a trap if b3 and nulls all previous development and prohibits king side castling if f1",
        "6... cxd4": "cxd4. I chose cxd4 to disrupt whites strong central position and to potentially open new future attack lanes specifically placing the black queen on either b6 or c7 if the opportunity presents itself.  ",
        "7. Qxd4": "Qxd4.This move I feel was a mistake and set the president for the failures of white in this game. I believe that white wanted to start out on an aggressive footing. Taking d4 with the queen technically stymies the development of the black bishop ex: if Be7 then QxG7 - BF6. I may be one pawn down material but I would have no viable place to castle and it would be a loosing game . Other reasons for this move I believe is to add pressure to the weak pawn on d6 by future castling and preparing to move rd1. This would become a liability to me and would make development difficult. ",
        "7... Nc6": "Nc6. Simple development move that fulfills multiple purposes e6 d4 b4 and a5 are now controlled by black and now while is forced to retreat the queen back to a square that is not a grave threat to the future of blacks king side safety g7.  Most importantly this simple move has shifted the initiative from white to black which is especially not good when white is trying to aggressively take position. ",
        "8. Qd2": "Qd2. Queen moves back to d2 still hoping to overpower the weak pawn on the d file in the future. This square also allows the white queen to get into action with my king side if an opportunity presents itself. All in all probably the best possible response to the threat of my knight. ",
        "8... Nf6": "Nf6. Simple development move kf6 attempting to prepare for castling and wanting to take further control of the wavering white center. ",
        "9. O-O": "O-O While castles king side The obvious choice for white who wants to get king side safety along with the ability to move rd6 in the future should it prove viable. ",
        "9... Be7": "Be7. Simple development move enabling king side castling and preventing a potential pin that may hamper future development. ",
        "10. Qg5": "Qg5. Knowing that I will not play kxe4 white plays aggressive move Qg5 threatening blacks weak spot square g7. This also puts the queen in a prime place to attack once castling happens by controlling the g file whilst hoping in the future to play Bh6 for an extreme threat to black. ",
        "10... O-O": "O-O. the only good move on the board. Playing g6 would protect this vulnerable pawn but the response would be Qh6. This would cut off the king on the diagonal  and prevent  castling whilst making a much weaker position overall. ",
        "11. Qe3": "Qe3. In over his head white pulls his queen back to a square that is against the strategy I believe white wanted to use. While Qg3 may have been a good way to maintain the strategy it would be a grave error. If Qg3- e4 (Bh6 threatening mate in one) Black then plays sneaky move Kh5 filling a multipurpose of attacking the while queen and protecting the square g5 that the white queen is threatening mate on.  The white queen would be trapped and it would be a certain win for black.  Moving anywhere else diminishes the move already made and will result in a positional loss. ",
        "11... Ng4": "Ng4. coining the phrase bullying the queen black attacks this strong yet ironically extremely weak piece in order to gain initiative and to dissuade her from pursuing her potentially dangerous attack. Black hopes and believes given the aggressive play style of white that the response will be Qf4 as this will result in a net position gain for black. ",
        "12. Qf4": "Qf4. Unwilling to give up the relentless attack The white queen returns to a safe square on the kings side threatening d6 and f7 and the knight on g4. ",
        "12... e5": "e5. Black's response is a multifaceted one.The queen is attacked by a defended pawn while the knight is benefited by a discovered defense from the blacks white bishop on c8",
        "13. Qd2": "Qd2. Deciding to finally give up on the futile attack and to focus yet again on the recently weakened d6 square the white queen wisely retreats back to d2. ",
        "13... h6": "h6. this move is a in between move designed to facilitate an attack on the queen bishop pair and to prevent Nf5. ",
        "14. Qd5": "Qd5. seeing opportunity to attack white yet again brings the queen forward to attack unsupported. he is pinning an undefended rook and threatening an undefended knight on C6. Nd5 would have been better threatening capture of the bishop on e7 and thus making the pawn on d6 even weaker. This is one of the more costly mistakes of the game. ",
        "14... Bb7": "Bb7. move to protect the knight and break the pin off the rook Bb7 also x-rays onto weak white pawn on e4. ",
        "15. h3": "h3. Wishing the black knight gone white kicks him back. ",
        "15... Nf6": "Nf6 obvious move kicking the queen out of her place yet again and preventing future powerful Nd5. ",
        "16. Qb3": "Qb3. unwilling to abandon the attack again queen pulls back to b3 to maintain attack on f7 square. ",
        "16... Na5": "Na5. following the game theme black harasses the queen further opening attack lanes on e4 and hoping to trap the queen. ",
        "17. Qa3": "Qa3. The only safe move, any other move would result in the loss in of the queen. ",
        "17... d5": "d4. discovered attack on the queen by the black bishop causing a very nice *almost foolproof queen trap*",
        "18. b4": "b3. a non ideal situation white is forced to move his pawn forward to block the discovered attack by the black bishop. This move also has the virtue of attacking the black knight. ",
        "18... Nc4": "Nc4. Following suit yet again black attacks queen on a3. ",
        "19. Bxc4": "Bxc4. Not wanting to yield a valuable square for blacks knight to sit on and not wanting to loose any material white trades his bishop for the black knight. ",
        "19... dxc4": "dxc4. Pawn retakes opening up attack on e4. This ends the queen attack. She is isolated and essentially useless the rest of the game. A huge disadvantage for white. ",
        "20. Nxe5": "Nxe5. choosing aggression over defense white captures the free pawn on e5. ",
        "20... Nxe4": "Nxe4. not wanting to loose the powerful white squared bishop attacking the increasingly vulnerable white king black responds with Nxe4",
        "21. Nxe4": "Nxe4. Noting the powerful central position of the black knight white opts to exchange. ",
        "21... Bxe4": "Bxe4. Exchange completed attack on g2 maintained. ",
        "22. c3": "c3. sensing a future discovery against the rook on a1 white plays this in between move to protect the rook from future Bf6. This however is not a good move as it puts the queen in a position that is even more useless and hard to get out of. ",
        "22... Bf6": "Bf6. Wishing to remove the black knight bishop challenges. ",
        "23. Bf4": "Bf4. White wisely protects knight. while finishing his own development. ",
        "23... Qc7": "Qc7. This non intuitive move at first glance appears to be a grave mistake. it leaves a rook hanging from white response kg6. In looking at the end of the game this plays out to be the best move in the game that opens a truly brutal attack that either ends in checkmate or a crippling material deficit for white. ",
        "24. Ng6": "Nf6. Seeing the opportunity for free material white plays move Nf6 opening the black queen to discovered attack from the bishop and threatening the rook. ",
        "24... Qb7": "Qb7. This move prepares to attack the vulnerable king side square g2 for the killing blow. ",
        "25. Nxf8": "Nxf8. Shrugging off the attack on g5 the knight decides to capture the rook. A mistake e3 f3 would have disrupted the attack and would have ended in a one pawn loss for white only. ",
        "25... Bxg2": "Bxg2. This move attacks the rook on f1 but also threatens a pull through for the queen later on. At this point white can still bow out for a one point material disadvantage but the damage to the position is irreparable. ",
        "26. Nh7": "Nh7. assuming the knight to be lost white plays Nh7 forcing a response in order to give white an opportunity to withdraw from his position.  playing Nd6 looks like a favorable square except that the response Bh4 which would put additional pressure on whites position where any attempt to save the rook would  lead to checkmate. ",
        "26... Kxh7": "Kxh7. This knight is a freebee piece. Knowing that if he isn't taken Kxf6+ would be the result. The knight is taken because any attempt to early force a checkmate can be thwarted by f3 and this would result in a material loss. ",
        "27. Rfe1": "Re1. Not wishing to loose the rook and maintain a material advantage white deigns to move his rook to safer ground. This unfortunately turns out to be a serious error and will cost him the game. ",
        "27... Bh1": "Bh1. Move in preparation for Qg2++. ",
        "28. Kf1": "Kf1. King retreating to avoid checkmate. ",
        "28... Qg2+": "Qg2+. This getting the queen into the action forcing the king from safety to danger. ",
        "29. Ke2": "Ke2. The only safe square for the White king to move. ",
        "29... Qf3+": "Qf2+. Queen follows up attack. ",
        "30. Kd2": "Ke2. King moving hoping to get cover in the relative safe queen side of the board. ",
        "30... Qxf4+": "Qxf4+. Queen spots free piece while maintaining check initiative obtaining positional advantage now matched by material advantage.  ",
        "31. Kc2": "Kc2. King continues his retreat hoping to be left along long enough to seek safety. ",
        "31... Qxf2+": "Qxf2. A full minor peace material advantage and no relief for the white king ",
        "32. Kd1": "Kd2 Mate (3). White moves back to D2 in order to stop the rook on e1 from being captured and mate being forced. at this point the game is resigned by white. The mistakes in this game on whites part were made mostly in over aggressiveness and failure to support the white queen. She was pushed to a part of the board where she was not utilized for a full 15 moves while with each push more and more of the board is ceded to black.  The few chances for legitimate attack for white were forfeited by misusing the strongest parts of the queens power and having the weakness of the queen thoroughly exploited by black. It is important to note that while the queen is incredibly powerful she is also incredibly weak while all pieces (opposing queens excepted can if supported force a queen from her position. It is for this reason it is unwise to bring her out unless fully supported. For curiosity's sake I included the mate sequence. ",
        "32... Rd8+": "rd8=",
        "33. Kc1": "Kc1",
        "33... Qxe1+": "Qxe1+",
        "34. Kc2": "Kc2",
        "34... Rd2#": "rd2#"
    },
    "url": "https://gameknot.com/annotation.pl/chess-game?gm=50559",
    "gameName": "Chess game",
    "players": "???  vs. ??? ",
    "opening": "Sicilian (B50)"
}