{
    "moves": {
        "1. d4": "De brancas jogo invariavelmente d4, me sinto mais segura do que e4!",
        "1... Nf6 2. Nf3 e6 3. g3 b5": "Não conhecia muito bem esta variante e avaliei que ela não é a melhor. Resolvi continuar com Bg2 fianquetando o bispo e preparando meu roque!",
        "4. Bg2 Bb7": "Temendo a expansão na ala da dama resolvi  jogar a3",
        "5. a3 a6": "Pelo menos meu adversário está pagando para ver!",
        "6. O-O": "Meu jogo flui naturalmente com lances naturais de desenvolvimento, nada que indique o uso de informações privilegiadas!",
        "6... Be7": "Tinha três  opções: Bf4, Cbd2 e Cc3, não gosto da terceira mas como não poderia fazer c4 o natural optei por ele(Cc3)",
        "7. Nc3 O-O": "Retardo um pouco o bispo, pois com o centro móvel espero utilizá-lo em b2. A jogada da dama é segura e apoia e4",
        "8. Qd3 d5": "Após d5 fechando a diagonal branca a casa e5 convida o bispo a f4",
        "9. Bf4 Nc6 10. Rfe1": "É notório que e4 é o lance de ruptura, por isso as torres devem ficar onde as colunas serão abertas!!",
        "10... Nh5": "Retirando o cavalo da luta central e me fazendo ganhar um tempo",
        "11. Bd2": "O bispo retorna e a dama está livre, imagine se a dama estivesse em d1",
        "11... Nf6": "Pensei em jogar Bf4 e avaliar qual o plano de meu adversário, mas como tenho lances interessantes, resolvo estabilizar a ala da dama!",
        "12. b4 h6": "Jogada defensiva afinal minhas peças apontam para roque de rcm06!",
        "13. e4": "O lance esperado, não posso mais esperar!!",
        "13... dxe4 14. Nxe4 Nxe4 15. Rxe4": "No meu cálculo essa posição da torre exposta ao lance do cavalo atacando a dama em b4 ou e5 me fez perder algum tempo!!",
        "15... Qd5 16. Rae1": "Trazendo a última peça ao campo de luta!! Acredito ter uma pequena vantagem, quando olho as torres de meu adversário, equivalente a três tempos!!",
        "16... Rad8": "Segundo meu professor de xadrez a todo momento tenho que olhar no campo adversário as peças soltas(sem defesa) e também se minhas peças estão defendidas, isso pode me valer mais alguns tempos!!",
        "17. Bc3": "Liberando a dama da clausura e melhorando a posição do bispo, meu oponente faz o mesmo com seu bispo!!",
        "17... Bf6 18. Rf4": "Deixa a dama preta sob mira e evita g4",
        "18... Qh5": "Minhas peças solicitam um plano de ataque, tenho g4 e dama não tem uma casa confortável",
        "19. g4 Qg6": "Bem o peão de e6 paga um preço será meu alvo",
        "20. Qxg6 fxg6": "A ameaça as vezes é melhor que a execução!!",
        "21. Rfe4": "O bispo corre em defesa do peão de e6",
        "21... Bc8": "tenho três peças adversárias sem defesa!!",
        "22. h4": "Almejando mais espaço e ameaçando g4!",
        "22... Be7 23. g5 Rf7": "Preparando-se para dobrar as torres e fazer pressão sobre f3 e f2",
        "24. Re1e3": "Defendendo f3, e diminuindo o campo de manobra adversário!",
        "24... Rdf8": "Fazendo valer a ameça gxh6",
        "25. Bd2": "e dando a torre opções de ataque na horizontal\n",
        "25... hxg5": "Resolvida a ruptura",
        "26. hxg5": "Vamos aos planos derradeiros",
        "26... Bd6": "Esse lance sempre me causou preocupação pois defende c7 e bispo age de forma crítica na diagonal c8-h2, joguei Td3 me antecipando a Bf4",
        "27. Rd3": "E também preparando d5",
        "27... Bb7": "Não pude deixar de tomar em e6, avaliei as saídas do cavalo e não vi grandes problemas!!",
        "28. Rxe6 Nd8 29. Ree3 Rf7f5 30. c3": "Um peão de vantagem e trocas por acontecer, defendi quem poderia ficar solto",
        "30... Bf4": "Iniciando o confronto",
        "31. Re2": "As trocas a bem de uma ordem causam os mesmos estragos",
        "31... Bxf3": "Penso que meu adversário não avaliou corretamente  a resposta natural Txf3 e se deixou levar somente por Bxf3 - Bxd2 # 32 Te x d2  Txf3 # 33 Txf3 Txf3  com uma peça a mais e uma posição ganhadora ",
        "32. Rxf3 Bxd2": "Bem Txf5 e o preto não tem vantagem",
        "33. Rxf5 Rxf5 34. Rxd2 Rxg5": "Tenho um bispo contra um cavalo e uma estrutura de peões em melhor estado. A posição é simples, penso, vou ocupar a coluna aberta (e) com a torre, passar o rei para a ala da dama, manter o cavalo na defesa passiva dos peões das casas brancas!! Meu adversário elogia meu jogo e envenena perguntando se não tenho um motor!!",
        "35. Kf1": "Liberando o bispo e caminhando com o rei para o centro e ala da dama!",
        "35... Kf8 36. Rd3": "Talvez cortar o rei fosse melhor! Se tivesse um motor saberia!!",
        "36... Nf7": "O cavalo vai a d6 e provavelmente a c4, resolvo tomar o peão oferecido e deixar as peças(cavalo e bispo) um tanto paralizadas. Foi uma difícil decisão!!",
        "37. Bb7 Nd6 38. Bxa6": "Se cavalo for a c4 jogo a4!",
        "38... Ke7 39. Re3+": "Sinto ter deixado o rei passar!!",
        "39... Kd7 40. Re5": "Se consigo trocar as torres fico bem, rcm06 não facilita!!",
        "40... Rf5 41. Rc5": "Não pretendo trocar desfazendo os peões dobrados, continuo a pressionar",
        "41... Rh5": "Trocar  e aparecer um peão passado nem pensar!!",
        "42. d5": "Ameaçando Bxb4",
        "42... c6": "Olha as coisas melhorando!",
        "43. dxc6+": "Peão passado  na 6ª é sempre bom!",
        "43... Kc7 44. Kg2": "Vamos a caça!!",
        "44... Rf5 45. f3 Rh5 46. Kf2 Rf5": "Meu adversário repete lances, enquanto caminho com o objetivo de trocar ou meu bispo pelo cavalo ou três peões pelo bispo!!",
        "47. Ke2": "Tentando evitar o xeque em c4!",
        "47... Rh5 48. Kd3 Rf5 49. f4": "Se 49...- Txf4  50 Bxb5",
        "49... Rh5 50. Kd4": "O rei avança",
        "50... Nf5+ 51. Ke4 Rh3": "A torre sai da sexta para a terceira horizontal",
        "52. Kd5": "Se deixar chegarei no paraíso!!",
        "52... Rd3+ 53. Ke6": "Ajudando não vale",
        "53... Re3+ 54. Kf7 Nd6+ 55. Kxg7 Kb6": "Nova decisão: manter o bispo ou os peões, como matematicamente B< = B  e  P >= P,B,C,T e D!! ",
        "56. Bxb5 Nxb5 57. Kxg6": "Temos 5 peões pelo cavalo!! Acredito que vou precisar de um motor!!!!!!!"
    },
    "url": "https://gameknot.com/annotation.pl/chess-game?gm=48778",
    "gameName": "Chess game",
    "players": "Natália Jéssica  vs. rcm06 ",
    "opening": "Queen's pawn (A46), Torre attack"
}