{
    "moves": {
        "1. e4 c5 2. Nf3 d6 3. d4 cxd4 4. Qxd4 Nc6 5. Bb5 Bd7": "Bishop d7 is a waste of one tempo, but, in view of winning the White Bishop, I thought maybe it is worth it.",
        "6. Bxc6": "I have bad memories of taking back with the c pawn which is a tempting move to make: opening b file, creating a majority in the center after c5, etc. So I played Bxc6.",
        "6... Bxc6 7. Nc3": "White is ahead in development, and I was hesitating between e6 and e5. After the game, my opponent told me that e6 is the best theoretical reply, and during the game I also knew that e6 was better, especially that it controls d5 against Nd5 and keeps my Bc6 alive (for \"whom\" I've spent 1 tempi)\nBut knowing the player I was playing against, I did not accept giving two tempis of development gap. \nSo I've played e5 with tempi, contradicting the previous plan I've made with Bd7.",
        "7... e5 8. Qd3": "My opponent was playing instantly and looking around not paying attention to the board. ANd that made me more nervous.",
        "8... h6": "The second contradiction. Also according to my opponent, this was wrong. But fears of Bg5, followed by 0-0-0, Bxf6 then taking the pawn at d6 convinced my mind to abandon development and restrict my opponent.",
        "9. Be3 Nf6": "White was two more pieces ahead in development.",
        "10. O-O-O Ng4": "Despite the dangerous development gap (Now at +3 pieces),  I thought White can't do anything: h6 secures a lot of things, Bf8 defends my weak d6, and White cannot move his Be3 away. So let's take the Bishop pair.",
        "11. Nb5": "this was a shocking move. I was expecting Rhf1, opening the f file.\nWhite ran toward d6. And I discovered that I can't take on b5 without some fire.",
        "11... Nxe3 12. fxe3": "And here I sank into minutes of thought, where I've accepted to give a pawn and secure safety for the king.",
        "12... Be7 13. Nxd6+ Bxd6 14. Qxd6 Qxd6 15. Rxd6 O-O 16. Nxe5 Bxe4": "Even though White is a pawn up, d3 was weak and my Bishop was incredibly good. My opponent tried hard luring me to take on g2, and I refused, then went against my queen side pawns, and in the mean time I've won the d3 pawn, then put a rook behind his king and in a technically drawn game I managed to pull out a shocking win in round one."
    },
    "url": "https://gameknot.com/annotation.pl/chess-game-http-gameknot-com?gm=65942",
    "gameName": "Chess game, http://gameknot.com/",
    "players": "???  vs. ??? ",
    "opening": "Sicilian (B53), Chekhover, Zaitsev variation"
}