{
    "moves": {
        "1. d4 f5 2. g3 d5 3. Bg2 e6 4. c4 c6 5. Nf3 Bd6 6. Qc2 Nf6 7. O-O O-O 8. Nc3 g6": "An interesting idea, not one I have seen before in a stonewall structure.  It could well be better to simply play 8...Nbd7 at once, as the black rook is soon forced off the f-file.",
        "9. Bh6 Re8": "While the white pawn stays on c4, black can not contemplate the e5 break.",
        "10. Rfd1 Nbd7 11. Rac1": "It soon becomes apparent that this rook is better placed on B1, and that this move simply loses time.",
        "11... Ne4 12. c5 Bf8 13. Bxf8 Rxf8 14. e3": "This move is important, so as to slow down any f5-f4 ideas from Black.",
        "14... g5 15. b4 g4 16. Ne5": "I think this is a mistake, as the pawn that is about to recapture on e5 will become hard to defend.  Nh4 is possible, but 16.Ne1 looks best, as it can work it's way to the f4 square.",
        "16... Nxe5 17. dxe5 Nxc3": "Here 17...Ng5 is worth a thought.",
        "18. Qxc3 h5 19. a4 h4 20. b5": "I had planned to anticipate the hxg3 maneuver from black by walking my king to e2, and double my rooks on the h-file.  The move played is a serious mistake, as it allows the white position to become severely overextended and highlights the weakness of the advanced white pawns.  20.Kf1! is much better, because when the white pawn is on b4, black has no way to open the queenside so the white king will be perfectly safe in the centre.",
        "20... hxg3 21. hxg3 Qc7 22. Qd4 Rf7 23. Qf4 Rg7 24. Kf1 Bd7 25. Rcb1 cxb5 26. axb5 Qxc5 27. Qb4 Qxb4 28. Rxb4 Rc8 29. Kg1 b6 30. Bf1 Rc5 31. Ra1 Be8 32. Kg2 Rgc7 33. Rbb1 Kf8": "For several moves white has had a dismal position, there are no active plans that he can undertake whatsoever. ",
        "34. Rb4 Ke7 35. Rbb1 Kd8 36. Ra6 Kc8 37. Raa1 Kb8 38. Ra2": "38.Rb2 is the correct rook to place on the second rank, as it can not be pestered by the black bishop.",
        "38... Rh7 39. Be2 Bg6 40. Rh1 f4": "??.  Both players quite remarkably missed the simple 41.Bxg4!, which leaves the outcome of the game totally unclear.  ",
        "41. gxf4 Be4+": "The rook on h1 is hanging."
    },
    "url": "https://gameknot.com/annotation.pl/chess-game?gm=29192",
    "gameName": "Chess game",
    "players": "Michael D'Arcy (1193) vs. Howard Duggan (1489)",
    "opening": "Dutch defence (A81)"
}