{
    "moves": {
        "1. Nf3 Nf6 2. d4 c5": "White to play.",
        "3. c4": "Although 3. d5 is technically better, it leads to the Benoni which is complicated, so White chooses to transpose to the English Opening.",
        "3... cxd4 4. Nxd4 Nc6 5. Nc3 g6": "What is the best move?\n",
        "6. e4": "White chooses the Maroczy Bind.  This transposes to the Accelerated Dragon, where this formation is sometimes seen.\n\nThe advantage to White is that if Black doesn't know how to handle it properly, White will maintain a big edge.",
        "6... d6 7. f3 Bg7 8. Be3 O-O 9. Be2": "Now White is only slightly better after 9... Nd7 10. Qd2 Qa5 11. O-O Nxd4 12. Bxd4 Bxd4+ 13. Qxd4 Qb6 14. Qxb6 Nxb6.\n",
        "9... a6": "Instead Black is having difficulty here.\n\n",
        "10. O-O Bd7 11. Qd2 Qb6": "A blunder.\n\nBetter is 11... Re8 12. b3 Nxd4 13. Bxd4 Rc8.\n",
        "12. Ne6": "With a discovered attack on the queen.",
        "12... Qa5 13. Nxf8": "This should be winning for White, but he manages to screw it later.",
        "13... Kxf8 14. a3": "Hoping to harass the Black Queen.",
        "14... Qc7 15. b4 Ne5": "White has a critical decision to make here.",
        "16. Nd5": "And fails.\n\nWhite missed the tactics that follow after 16. Rac1.  Then if 16... Nxc4? 17. Bxc4 Qxc4 18. Nd5 with potential knight forks.  If 18... Qb5 19. Nc7 with a fork or 18... Qb3 19. Rc3 Qa4 20. Nb6 with a fork.\n",
        "16... Nxd5 17. cxd5 Nc4 18. Bxc4 Bxa1 19. Rxa1 Qxc4 20. Rc1": "Although the material has equalized, White still has a strong advantage.",
        "20... Qb3 21. Bd4": "Which accomplishes nothing.\n\nAfter 21. Rc7 Ke8 22. Qc1 Qa4 23. h4 Qb5 24. Bf2 Kd8 25. Rc2 Rc8 26. Rxc8+ Bxc8 27. Qh6 White has a technically winning game.\n",
        "21... f6 22. Rc7 Rd8": "A mistake.\n\nBlack is equal after  22... Rc8 23. Rxc8+ Bxc8.   White should not fall for 23. Rxd7?? Qb1+ 24. Kf2 Rc2.\n",
        "23. Rxb7": "This runs into problems.\n\nWhite needs to play 23. h4 to give his king room to escape. Then if 23... Ke8 24. Kh2 Rc8 25. Rxc8+ Bxc8 26. Qc1 Bd7 27. Qh6 Bc8 (27... Kd8 28. Qf8+) 28. Qxh7 Qc2 (28... Kd7 29. Bxf6) (28... Kf8 29. Qh8+) 29. Qg8+ Kd7 30. Bb6 with a winning position.\n",
        "23... Qxa3": "A blunder.\n\nThe game is roughly equal after 23... Qb1+ 24. Kf2 Rc8 25. Qh6+ Ke8 26. Kg3.\n",
        "24. Bb6": "This has to be winning.  For example 24... Rc8 25. Rxd7 and after either 25... Qa1+ or 25... Rc1+ then 26. Kf2 is fine.",
        "24... Qa1+ 25. Kf2": "Black needs to allow 25... Rc8 26. Rxd7.",
        "25... Ke8": "This will prove to be much worse.",
        "26. Bxd8 Kxd8": "This looks natural, but it is fatal.  \n\nWhat is the best move for White?\n",
        "27. Qc2": "This movie is a simple penetration into c7, but Stockfish 8 had a hard time seeing it.",
        "27... Qd4+ 28. Kf1": "White returns all of Black's blunders with a huge blunder of his own, missing the win with 28. Kg3 Ke8 29. Qc7 Kf7 30. Qxd7 Qe5+ 31. f4 Qc3+ 32. Kh4 Qe1+ 33. Kh3!\n",
        "28... Bb5+": "Needless to say, I overlooked this move.",
        "29. Ke1 Qg1+ 30. Kd2": "Black to play and draw.",
        "30... Qd4+": "Black has a perpetual check.",
        "31. Kc1 Qa1+": "Now no help would be 32. Qb1 Qc3+ when the best White has is 33. Qc2.  Otherwise the move 33. Kd1 actually loses after 33... Bc4!  threatening 34. ... Qe3! and 35... Bb3+.  White has an interesting response with 34. e5!! where the aforementioned plan fails after 34... Qe3? 35. Qc2 Bb3?? 36. Rc8+ Kd7 37. e6+ winning.  So instead Black would play 34... Qd4+!! 35. Kc1 Qe3+ 36. Kb2 Qxe5+! 37. Kc1 Kc8! and the rook does not have a safe square to move to.  If instead 37. Ka3 Bxd5 and White has the same problem.  If 37. Kc2 Bd3+!  If 35. Ke1? Qe3+ 36. Kd1 Be2+ wins.",
        "32. Kd2 Qd4+ 33. Kc1 Qa1+ 34. Kd2 Qd4+ 35. Kc1": "Draw by repetition."
    },
    "url": "https://gameknot.com/annotation.pl/chess-com-uscf-online-rated-tournament?gm=64662",
    "gameName": "chess.com USCF Online rated tournament.",
    "players": "john2001plus (1875) vs. skuhl99 (1458)",
    "opening": "Reti opening (A05)"
}