{
    "moves": {
        "1. Nf3": "As Joe mentioned, brettbevans favorite first move is the Reti Opening.  In fact, Joe said, \"Brett here loves the Reti opening.Hypermodern is ok in long corresp games and so is fianchetto's,but I would not suggest that style of play in fast 5 minute games.Why?Because the concepts of delay and proper buildup is \"engineered\" for long corresp games or 40/2 OTB games.But in 3 to 5 minute blitz games,it is much better to play more aggressively with immediate central control,fast dark/light square control and moving out your major pieces without delay,especially if your playing a 2500+ monster.....like me!Fianchetto and hypermodern play makes me STRONGER,not weaker and should be avoided in senior master blitz play.This is simply one secret revealed that most players will not fathom.Experience and statistics will bear out what I am saying here,but very few blitz players have the \"stats\" I do. \n",
        "1... Nf6 2. g3 d5 3. Bg2 c6 4. O-O Bf5 5. d3 e6 6. Nbd2 h6 7. b3 Be7 8. Bb2 O-O 9. Qe1": "Normally, I'd annotate more because my belief is that the more you annotate, the better.  But, because of what Joe outlined, it's not needed as there's no thought process that goes into this.  Another reason was for chess terms, when I didn't understand.  Slowly but surely, I'm doing less of that since the idea is seeing the big picture and what the board is telling me.  Well, what's mentioned shows that there's no big story, yet.  The other reason for annotating more is once I feel that we've moved passed book and now going by what I'm thinking and trying to access the opponents thought process.  But, at a much stronger given that there hasn't been any deviation, there's nothing to keep about.  The idea is staying in book against a Senior Master.  Therefore, I'm basing things on what Joe said for this annotation.  Therefore, it continues with, \"Moves 1 through 9 are in book.My central dominance is already apparent at this juncture,white sq control,my Bishops have much more open control than white,especially with his blocked in g2 Bishop.\"",
        "9... Nbd7": "This, however, is where I start annotating more because Joe doesn't mention anything else until a mistake.  I like this move because, not only is Joe continuing with his development, but he can bring his Nd7 into a better spot. ",
        "10. e4": "Gaining tempo because, after brettbevans exchanges pawns, he'll gain tempo since Joe is forced to protect his Bf5.  Sure, I'm thinking of chess bits and wisdoms, but there's no big story, yet.  In other words, the board does not indicate anything major, yet.",
        "10... dxe4 11. dxe4 Bh7 12. Qe2": "Mobilizing his Queen.",
        "12... Qc7": "And, Joe has the same idea in mind.",
        "13. Rfe1": "Centralizing his Rook which is generally considered a good idea.  Not only that, but it's directly behind the Queen which plays a more powerful role.",
        "13... Rfd8": "Joe also centralizes his Rook.",
        "14. Nc4": "?? This is where everything with a big story and a lot of what the board tells us.  That's because Joe implied that this is the losing blunder.  In it, he said, \"Move #14 begins Brett's downfall.Removal of his central post e pawn by capture and no return on his side,is \"pre\" fatal.\"  Therefore, I would've answered with 14.Ne5 to prevent that because white does not lose a pawn 15.Nxe5.",
        "14... Nxe4 15. Nce5": "Centralizing his Knight with the idea of compensating for the lost pawn.",
        "15... Bf6": "But, Joe  answers with counterattack against brettbevans Ne5.",
        "16. Nxd7": "But, white takes, anyway.  You might as well because Joe would liquidate, one way or another.  In fact, no matter what white does he cannot get himself out of trouble because of what's coming.  ",
        "16... Bxb2 17. Rab1 Nc3": "That's because I was thinking of 17.Rd1, but the next move would be the same.  And, now, white is, officially, busted.  In it, Joe said, \"Move #17 is the \"fork of death\"(Q-R fork).At this point,the game is definitely over and brett knows it but plays on a few more moves to hope for a miracle.That \"miracle\"will never surface.....well,not against me....unless the internet disconnects me!Not this time!\"",
        "18. Nf6+ gxf6 19. Qc4 Nxb1 20. Rxb1 Ba3 21. b4 a5 22. Qb3 axb4": "When annotating games like this, I go by what Joe outlines which is the reason for doing anymore.  And, what he outlined is the moral of this story.  In it, TA said, \"Reinforced pawn capture on the a and b edgefile(B+P),clenches the win.No mate necessary!Game over!Opponent resigns and quickly leaves the arena,voluntarily disconnecting. \n\nAgain brett is a fine player,but my constructive opinon(not destructive opinion)is that brett enjoys blitz and probably defeats many blitz opponents south of 2100(like I do)but needs additional blitz training that he lacks when confronted by a hyper severe electrical storm like me....and he has no proper grounding in blitz theory,which is \"different\"than long corresp. game play theory.No brag on my part,just fact....FYI.\"\n"
    },
    "url": "https://gameknot.com/annotation.pl/chess-game-for-real-this-time?gm=60762",
    "gameName": "Chess Game-\"For Real This Time\"",
    "players": "brettbevans (2411) vs. tactical-abyss (2372)",
    "opening": "Reti (A05), King's Indian attack, Spassky's variation"
}