{
    "moves": {
        "1. e4 c6": "Copyright 1991, John Richard Coffey.\n\nThe Caro-Kann Defense.\n\nWhite to play.",
        "2. d4": "There is an alternative two knights variation, which is 2. Nc3 d5 3. Nf3 which can get tricky after \n3... dxe4 4. Nxe4 Bf5 5. Ng3 Bg6 6. h4 h6 7. Ne5 Bh7 8. Qh5 g6 9. Qf3 f6 (9... Nf6 10. Qb3 Nd5 11. Qxb7 is winning) 10. Bc4 e6 11. Qg4 fxe5 12. Qxe6+ Ne7 13. Qf7+ Kd7 14. Qe6+ Ke8 15. Qxe5 Bg8 16. Qxh8.\n\n",
        "2... d5 3. Nc3 dxe4 4. Nxe4 Nd7": "This knight move prepares to play Ng8-f6 without a risk of doubling pawns. It is more common to see Ng8-f6, but after Ne4xf6+, Black's pawns get doubled. Black would either play e7xf6 keeping his pawn\nchain intact, or instead g7xf6 so that he can have a semi-open file to attack on the kingside, but at the cost of isolating his rook pawn.",
        "5. c3": "This pawn move is probably premature, but White is waiting to put his knight on f3 until Black commits his bishop on c8 to a square.  Thus he avoids having his knight pinned to f3 that might eventually want to go to e5 or g5. I don't like c2-c4 as much because White may then have to go to extra effort to keep his d4 pawn safe. Although a pawn on c4 would exert more control on the\ncenter, White has the option of playing c3-c4 later. The c3-c4 maneuver might be useful later if Black tries to put a knight on d5.",
        "5... Ngf6 6. Nxf6+": "It is either take or move the knight.  Defending the knight with Bf1-d3 Nf6xe4, Bd3xe4 Nd7-f6, Be4-d3 doesn't seem too bad, but White may want to wait to commit his bishop to another square besides d3. \n\nWhat is wrong with Ne4-g3? I don't know.",
        "6... Nxf6 7. Bc4": "This is book according to BCO2. But in view of what happened in this game, the bishop would have been instead just as well off on d3.",
        "7... e6": "Black's first mistake is that he should not block his queen bishop on c8.",
        "8. Nf3": "Now the knight can come to f3 without being pinned by the c8 bishop.",
        "8... Bd6": "Black developes, but is somewhat cramp.",
        "9. Bg5": "Pinning the knight makes even more sense after Black's bishop has gone to d6.",
        "9... h6": "Only accomplishes creating a weakness in the Black kingside. If Black castles kingside, White might use the h6 pawn as a target in a kingside attack. There are some good examples of this in the book \"Logical Chess Move by Move\".",
        "10. Bh4": "Trading the bishop for the knight would only ease Black's crampedness.",
        "10... g5": "Black cannot hope to castle kingside after opening up the kingside so much.",
        "11. Bg3": "Retreat.",
        "11... Bxg3": "This is a serious mistake, as it opens a file for the White rook on h1.",
        "12. hxg3": "Now White isn't planning to castle kingside either because he has a very strong rook on h1 that is working against a \"backward\" Black pawn on h6. A pawn is said to be \"backward\" when it can't be defended by other pawns.",
        "12... Nd5": "Necessary, as White was threatening Nf3xg5 which Black can't be take with h6xg5 because of Rh1xh8+.",
        "13. Ne5": "White's knight can't be driven from this post by f7-f6 without endangering the Black king to Qd1-h5+.",
        "13... Qf6": "Black is having a hard time putting his pieces on good squares.",
        "14. Qh5": "Concentrating on the weak \"backward\" f7 and h6 pawns.",
        "14... Nb6": "Forces White to do what he would have done anyway! Instead of moving this piece for the third time he should make preparations to castle.",
        "15. Bd3": "White's threat is to play Ne5xf7!  Then Black couldn't respond with Qf6xf7?? because of Bd3-g6! pinning the Black queen to the King. Notice that none of Black's other pieces can come to the defense of the f7 pawn. If Black were to play Rh8-f8, then the h6 pawn would drop.",
        "15... Na4": "Notice that Black is moving his knight too many times.",
        "16. O-O-O": "Castling helps activate the rooks.",
        "16... Qxf2": "Greed. Black needs desperately to complete his development. It is rarely a good idea to attack when you are behind in development. This shows that the computer has a complete disregard for the safety of its King. I doubt that a human Master would have made the same mistake.",
        "17. Rd2": "Necessary to prevent Qf2xb2 mate.",
        "17... Qf6": "Retreat. What should White do now?",
        "18. Rf1": "Might as well add another piece to the attack! This is better than Ne5xf7 as White is going to win the pawn anyway.\n\n Consider Black dead now.",
        "18... Qe7": "No good place to go.\n\nWhich way should White take the f7 pawn?  I have asked many students this question, and I get many different answers.",
        "19. Rxf7": "This is the best way to capture the pawn as it threatens the queen while it threatens discovered check from the queen on h5 by moving the rook.",
        "19... Qd6": "Mate in 2.",
        "20. Rd7+": "Also Rf7-f8+ instead forces mate.",
        "20... Kf8": "Take the queen?",
        "21. Qf7#": "No.  Checkmate is better."
    },
    "url": "https://gameknot.com/annotation.pl/chess-game?gm=63518",
    "gameName": "Chess game",
    "players": "John Coffey (2000) vs. Fidelity Mach III (2265)",
    "opening": "Caro-Kann (B17), Steinitz variation"
}