{
    "moves": {
        "1. e4 e5 2. f4 exf4": "King's gambit accepted\n",
        "3. Bc4": "The bishop's gambit.   White intends for as much attack as possible.\n",
        "3... Nc6 4. d4": "Still opening up the center; helping develop the bishop.  Better is Nf3\n",
        "4... Bb4+": "??\n",
        "5. c3": "and the obvious push backwards\n",
        "5... Bd6 6. Nf3": "Developing the knight and putting pressure on e5...also prevents Qh4 \n",
        "6... f6": "?? a poor move...   an attempt to prevent e5\n",
        "7. O-O": "Safeguarding the king and putting the rook on the empty file for a hopeful attack.    it's funny too, i seem to mostly use castling as an attacking move in my games. \"castling is an attacking move\"\r\n",
        "7... Na5": "Pushing the bishop off of the dangerous diaganol\n",
        "8. Bd3 g5": "an attempt to keep an attack on white, but black's pieces are poorly developed and soon exposed\n",
        "9. Nxg5": "White hopes to crush the king's side and end the game quickly\n",
        "9... fxg5": "accepts the sacrifice\n",
        "10. Qh5+": "and white leads into the attack\n",
        "10... Kf8": "Ke7 and white plays e5; winning the bishop\n",
        "11. e5": "white must remove the pawn duo\n",
        "11... Be7 12. Bxf4": "white continually sacrifices pieces to keep the pressure on black and to keep the poorly placed pieces on poorly kept squares\n",
        "12... gxf4": "and black accepts again\n",
        "13. Rxf4+": "the obvious recapture\n",
        "13... Bf6 14. Nd2": "here white attempts to bring the knight into play and also create a battery on the f file\n",
        "14... d5": "black tries to refute the knight, but cannot stop the following moves\n",
        "15. Rxf6+": "again\r\n",
        "15... Nxf6": "with the only recapture available\n",
        "16. Rf1": "white wins back a piece and brings in more attack\n",
        "16... Qe7 17. Rxf6+": "white wastes no time\n",
        "17... Kg8 18. b4": "white wants to play Bc4\n",
        "18... Nc6": "the only square available  Nc4 loses to Nxc4 dx4 and Bxc4 !\n",
        "19. Ne4": "again white brings more pieces into the fray.  also as previously stated, dxe4 loses to Bc4 !\n",
        "19... Bd7": "an attempt to allow the a rook into play and perhaps an attempt to drive back the white queen\n",
        "20. Ng5 Be8": "attempts to push back the white queen and release pressure, but it is too late\n",
        "21. Qh4 a6": "?   a6 prevents b5?  \n",
        "22. Ne6": "white puts the knight into an even more dangerous place.  with the obvious attack of Qg5 \n",
        "22... Bg6": "the only way to prevent the attack...\n",
        "23. Qg5": "but white continues the same plan causing the bishop to be pinned.  Black also must be weary of Rxg6 \n",
        "23... Qxe6": "black merely stalls out the game\n",
        "24. Rxe6 Rf8": "Black has no remaining hope and resigns  25. Rxg6  hxg6 26. Qxg6#  or  25. Rg6  Kf7 26. Qf6  Ke8 27. Qe6  Kd8 28. Rg7 and black loses much material and is mated soon after\n"
    },
    "url": "https://gameknot.com/annotation.pl/chess?gm=20971",
    "gameName": "Chess",
    "players": "JackiesPrince (1659) vs. ??? (1200)",
    "opening": "KGA (C33), bishop's gambit, Maurian defence"
}