{
    "moves": {
        "1. e4 e5 2. Ne2 Nc6 3. Ng3 Bc5 4. Bc4 Nf6 5. O-O O-O 6. h3 d6 7. d3 Be6 8. Nd2": "He's trying to trade light sq bishops on his terms; replacing it with the knight on c4.  I won't agree to it.",
        "8... a6 9. a3 b5 10. Bb3": "A better deal for black on the trade but still not good enough.  Why allow his knight to advance on the trade?\n",
        "10... a5 11. c4": "12.  ..., a4 would have been better for white, I think.  ",
        "11... a4 12. Ba2 b4 13. axb4 Nxb4": "Hot square for the black knight, attacking the d3 pawn and his bishop is fenced in.",
        "14. Bb1 c6 15. Rxa4 Qb6": "He got the pawn but then he gives up the file.  It will prove to be costly.  ",
        "16. Rxa8 Rxa8 17. Nb3": " ",
        "17... h6 18. Nxc5": "Good idea for white abating the battery on the power diagonal but he leaves behind the a1 square.",
        "18... Qxc5 19. Be3 Qa5 20. Bd2 c5 21. Ne2 Qd8 22. Nc3 Ra1 23. Nb5": "A powerful pin on white's back rank...but why didn't he play 23. Qf3, ...?",
        "23... Nxd3": "Now I can transition the queenside skirmish to an attack on the kingside.",
        "24. Bc3 Nf4 25. Na3": "I think white was too preoccupied trying to trap my rook on a1 at the expense of allowing a strong attack of minor pieces.",
        "25... Nxe4 26. Qb3 Ne2+": "This move causes some big problems for white; strengthens the pin on white's light sq bishop and gains a tempo to get the two monster knights in position.  ",
        "27. Kh2 Ng5 28. Rd1": "costing another tempo to weaken the pin...",
        "28... Rxb1": "Dumping the passive rook for the bishop pointing at black's kingside and deflecting white's rook onto a useless square.",
        "29. Rxb1 Qa8 30. Nb5": "??  instead of simply trying to trade down my attack  i.e., 30. Bd2, ...   getting his bishop off of that useless diagonal!!",
        "30... Nf4": "The knights are fully poised to strike...",
        "31. f3 Nxf3+": "If 32. gxf3 then black has an unstoppable attack  with the queen and the two minor pieces being that there is nothing available which with white to defend. Play would continue  32. ..., Qxf3  33. Qc2, Qxh3+ 34. Kg1, Qg3+ 35. Kh1, Bxc4 36. Nc7 (preventing mate), Qh3+ 37. Qh2 Qf3+ 38. Kg1, Nh3+ winning white's Queen.  ",
        "32. Kh1 Nxg2 33. Kxg2 Nd2+": "White resigns."
    },
    "url": "https://gameknot.com/annotation.pl/chess-game?gm=62363",
    "gameName": "Chess game",
    "players": "Focker  vs. rasant ",
    "opening": "Alapin's opening (C20)"
}