{
    "moves": {
        "1. d4 Nf6 2. c4 g6 3. Nc3 Bg7 4. g3 O-O": "(TH) All book so far. This was the final round of the \"A\" final of the Olympiad, and with the Soviet Union leading Hungary by a slim 1/2 point entering the round, draws wouldn't do. The Russians had to play to win. Bear this in mind as the game progresses.",
        "5. Bg2 d6 6. Nf3 Nc6 7. O-O Bg4": "(VK) At the Olympiad at Lugano in 1968 Ciocaltea played against me 7... P-QR3 8 P-KR3 R-N1 9 B-K3 P-QN4 but lost without a struggle. This time he follows a different path.",
        "8. d5 Na5": "(VK) It is well known that after 8... BxN 9 PxB White has a clear advantage.",
        "9. b3 c5": "(VK) Of course Black cannot play 9... NxQP 10 NxN BxR 11 B-Q2 (or 11 B-R6) with advantage to White. But 9... P-B3 is interesting.",
        "10. Bb2 a6 11. Nd2 Rb8 12. Qc2 b5 13. Rfe1": "(VK) Even more energetic was 13 QR-K1.",
        "13... Qc7 14. Nd1 Rb7": "(VK) The right move was 14... P-K4. By playing the rook to N2 Black loses the possibility of active play in the center and finds himself in a difficult position.",
        "15. Bc3 Rfb8 16. f4 bxc4 17. bxc4 Ne8 18. Nf2 Bd7 19. Nd3 Ra7": "(VK) Black's Rooks can acheive nothing on the QN file as White's minor pieces control all points of entry.",
        "20. Bxg7": "(VK) After 20 P-K4 I thought 20... B-Q5 ch followed by 21... P-K4 would be unpleasant.",
        "20... Nxg7 21. Qc3": "(VK) But now 21 P-K4 was worth considering.",
        "21... Nb7": "(VK) Better was 21... N-B4 22 P-K3 N-QN2, slowing down White's attack as it is no easy task to dislodge the Knight from KB4.",
        "22. e4 Qa5 23. Qb2 Raa8": "(VK) This Rook has taken 4 moves to return to its original square. This proves that Black's opening strategy must have been wrong!",
        "24. Nb3 Qd8": "(VK) The Queen would have been badly placed on R5, but better was 24... Q-B2.",
        "25. Qc3 a5 26. a4": "(VK) A critical move. White reduces Black's counterplay on the Q side at the price of putting this Pawn on a square where it is weak.",
        "26... Qc7": "(VK) After 26... Q-K1 27 P-K5 BxP 28 N-Q2 N-B4 29 N-K4 White loses a Pawn but gets very powerful play in the center of the board.",
        "27. Nd2 Nd8 28. h3": "(VK) Black is cramped and cannot undertake anything active on either side of the board. White has no quick way of realizing his advantage. At the board I thought at first that it would be best to exchange a pair of Rooks and the prepare for the advance P-K5 supported by minor pieces. Another plan, recommented by Tigran Petrosian, is worth considering: B-B3, B-Q1, B-B2, N-KB1, N-K3 followed by either P-K5 or P-B5.\r\n\r\nBut in the heat of the last round I opted for an energetic (and premature!) advance in the center and on the K side. \r\n\r\nIt is worth mentioning that after 28 B-B3 (threatening 29 P-N4) 28... P-R4, 29 P-B5 really would have been strong.\r\n\r\n(TH) Here is where the having to play to win comes in. If this match had been in any earlier round, Korchnoi would undoubtedly have played a slower but sure win by constriction strategy, with his enormous advantage in space.",
        "28... h5 29. f5 gxf5 30. e5 Ra7 31. Nf4 Rab7": "(VK) A mistake. After 31... PxP 32 RxP Q-Q3 it would be very difficult for White to penetrate Black's defenses and his own position would be rather precarious.",
        "32. e6 fxe6": "(VK) This time 32... B-K1 was best. Now White's attack is irresistible.",
        "33. dxe6 Bc6 34. Bd5 Rb7b2 35. Ref1 Qb7": "(VK) The final mistake. 35... B-K1 was necessary.",
        "36. Nxh5 Nxh5 37. Rxf5 Nf6 38. Rg5+ Kh8": "(VK) If 38... K-R2, 39 Q-Q3 ch. Or if 38.. K-B1, 39 R-KB1 RxN 40 RxN ch PxR 41 QxBP ch Q-KB2 (41... N-B2 42 Q-N7 ch) 42 P-K7 ch and mates.",
        "39. Rf1 Rxd2 40. Qxd2": "(VK) Better than 40 RxN Q-N8 ch 41 R-B1 dis ch R-Q5 and Black is still fighting.\r\n\r\n(TH) Ciocaltea resigned here. Korchnoi's win helped the Russian team score 3 out of a possible 4 points in the final round, while Hungary was held to a 2-2 draw by West Germany and finished 1 1/2 points back, in 2nd place."
    },
    "url": "https://gameknot.com/annotation.pl/chess-olympiad-final-group-a-skopje-1972?gm=38849",
    "gameName": "Chess Olympiad (Final Group A), Skopje 1972",
    "players": "Viktor Korchnoi (Soviet Union) vs. Victor Ciocaltea (Rumania)",
    "opening": "King's Indian (E61), Smyslov system"
}