{
    "moves": {
        "1. d4": "I start conventionally",
        "1... Nf6": "This is also very commonly played.",
        "2. c4": "Planning Nc3 and e4",
        "2... e6": "Another commonly played move in this position.",
        "3. Nc3": "Planning e2-e4",
        "3... Bb4": "This pin prevents e2-e4. This is the Nimzo-Indian Defence.",
        "4. e3": "And I play the main line.",
        "4... c5": "A usual way of striking back in the centre.",
        "5. Bd3": "I continue my development.",
        "5... d5": "Although this has been played in this position, I think that by playing this move this early, black reveals his hand too early. White need now not be afraid of Bb4xNc3 doubling his pawns, as the pawns can always be undoubled by c4xd5 now. I tend to think Nc6 or 0-0 is better - they are certainly more commonly played - but the results are not massively better.",
        "6. Nf3": "So now I can develop this knight here, rather than to e2, which is where I would have been tempted to play it if he had played a different 5th move. ",
        "6... cxd4": "Again, slightly unusual - Nc6 or 0-0 are more common - but perfectly playable.",
        "7. exd4": "I did consider Qa4check instead, but nothing comes of it.",
        "7... Qa5": "Again, slightly unusual. This move is not on the Gameknot opening database of world games, but is on the database of Gameknot games. My opponent said afterwards that he had successfully played this move in the past.",
        "8. Bd2": "I found out afterwards that in jcweibel (1749) vs. georgiaflag (1922) white just castled, black snatched the pawn with BxNc3, bxBc3, Qxc3 and white went on to win. I am not convinced white really has enough compensation though.",
        "8... Bd7": "Now Bd7 is not in my opening databases. I thought the idea was to exchange pawns on c4 and then put is Bishop on c6 where it has a lovely diagonal. I decide to exchange it off. ",
        "9. Ne5": "With this move.",
        "9... Nc6": "He challenges my knight.",
        "10. Nxd7": "I take his bishop.",
        "10... Kxd7": "He decides to keep his Knight on f6 active by recapturing this way. It is fine, as long as black can keep the centre closed. ",
        "11. O-O": "So I get safely castled, hoping to open up the centre. ",
        "11... dxc4": "I think this is a poor follow up to his previous move. With his king in the centre he needs to try and keep the centre closed, not opening it up further.",
        "12. Bxc4": "So I take back.",
        "12... Rhd8": "This move is useful in some variations, but does have the drawback of preventing the retreat of his queen, as we shall see.",
        "13. a3": "I was now studying this position, and thinking, well, he must exchange on c3, when he surprised me with",
        "13... Be7": "As David said afterwards \"Not one of my best moves!\"",
        "14. Nd5": "Discovering an attack on his queen, which now has no squares.",
        "14... exd5": "So he takes my knight.",
        "15. Bxa5": "I take his queen.",
        "15... Nxa5": "He takes my bishop.",
        "16. Qa4+": "I throw in a check.",
        "16... Nc6": "He decides to keep his knight - for now.",
        "17. Bb5": "I am going to target c6",
        "17... a6": "He hits my bishop.",
        "18. Bxc6+": "So I take.",
        "18... bxc6": "He takes back.",
        "19. Rac1": "Hitting c6",
        "19... Rdc8": "He protects.",
        "20. Rc2": "I get ready double rooks on the file. There is no adequate defence. For instance if a5 21. Rfc1 Ra6 22. b4 and white wins easily.\r\n",
        "20... Ne4": "This is as good as anything.",
        "21. Rfc1": "And he resigns. For example, Bg5 22. Rxc6 Bxc1 23. Rxa6+ Ke7 24. Rxa8 and white's queen side pawns will be hard to stop. Many thanks for reading, please leave a comment and rate this annotation on the star system. Until next time dear reader!\r\n",
        "21... Bg5 22. Rc2xc6 Bxc1 23. Rxa6+ Ke7 24. Rxa8": ""
    },
    "url": "https://gameknot.com/annotation.pl/chester-4-v-malpas-whitchurch?gm=56344",
    "gameName": "Chester 4 v Malpas & Whitchurch",
    "players": "Charles Lowick Higgie (ECF172) vs. David I Hulme (ECF 157)",
    "opening": "Nimzo-Indian (E41), e3, Huebner variation"
}