{
    "moves": {
        "1. e4": "HI guys, my fifth annotation here, this is me against logogalaxy. I did pretty bad on this one, because I am not used to this kind of chess, and I don't use my time wisely. Just letting you know. Let's figure out what happens.",
        "1... e6": "My standard opening",
        "2. Be2": "I guess to prepare for castling and to somewhat develop a piece.",
        "2... b6 3. Bf3": "I believe he wanted to take chances of me not placing my bishop in time AND that I wouldn't use my knight or bishop to protect my rook.(kind of a big chance.",
        "3... Bb7": "Natural",
        "4. d3": "Protect e4 pawn and mobilize his black bishop.",
        "4... Nf6": "Not to take e4, but to get ready for castling.",
        "5. Bd2": "He expects me to check with bishop, which I would have, so good for him.",
        "5... Na6": "I didn't want my rook to be alone.",
        "6. Bg5": "An attempt for something.",
        "6... Be7": "Just making an excuse to move my bishop.",
        "7. Bxf6": "Take",
        "7... Bxf6": "Natural",
        "8. Nc3": "to protect his rook.",
        "8... O-O": "What I planned on for long time.",
        "9. Nge2": "I believe he is getting ready for castling.",
        "9... h6": "For more protection of king.",
        "10. O-O": "Expected.",
        "10... c5": "I don't know. comment please.",
        "11. Ng3": "Better position for both queen and knight",
        "11... Bh4": "In order to free the queen.",
        "12. Nge2": "Not such a good position, but okay.",
        "12... Qg5": "I am up to something.... I think.",
        "13. a3": "Time waste.",
        "13... e5": "I guess I am doing the same.",
        "14. Kh1": "Maybe that position looks better.",
        "14... Nc7": "For better position of knight.",
        "15. Ng1": "This is just for future planning on his part.",
        "15... Ne6": "This move came in handy after a little.",
        "16. g3": "Almost dooming my bishop.",
        "16... Nf4": "But I decided to doom my pretty worthless looking knight.",
        "17. gxf4 exf4 18. Nh3": "Attack on the queen.",
        "18... Qg6": "Natural",
        "19. Rg1": "Again?",
        "19... Qe6": "Glenda flees.",
        "20. Bg4": "And focourse, again.",
        "20... f5": "But not this time. I won't flee. Notice he cannot take with his pawn because of my white bishop.",
        "21. Bf3": "natural",
        "21... fxe4": "Now I am attacking both the bishop and the knight. If he takes with a pawn, I would get a free knight.If he attacks with a knight, I still get a free knight. If his bishop tries to flee, I would simply push f pawn which would eventually lead to checkmate. If he takes with the bishop, I will take the bishop, He will take my bishop, and I will still get a free knight. I am perched here for now, but let's see what goes on as we proceed.",
        "22. Bg4": "I believe this is a fatal mistake for white.He sould have taken the pawn with his pawn, for he has more number of units focusing on my e4 pawn. However, he played that move, obviously to treaten my queen.",
        "22... exd3+": "The thing is, logogalaxy, I can do this.",
        "23. f3": "Defending the king and supporting the bishop at the same time.",
        "23... Qe3": "Noticing that he will check me with his bishop if I don't move my queen, I flee to e3.",
        "24. Qxd3": "Queen takes.",
        "24... h5": "Did not consider that the pawn wasn't supported.",
        "25. Bxh5": "Natural.",
        "25... Qxd3": "I couldn't figure out what to do, so I took the queen.",
        "26. cxd3": "Natural.",
        "26... Rf5": "Attak on bishop.",
        "27. Bg4": "Natural.",
        "27... Rf7": "This way, he would not be able to take d7 pawn, and I can defend my bishop by pushing the pawn.",
        "28. Ne2": "trying to take the pawn on f4.",
        "28... Re8": "I didn't know his plan, so I just threatened his knight.",
        "29. Nc3": "I think he should have took the pawn.",
        "29... Re3": "Threatening f3 pawn.",
        "30. Kg2": "Natural.",
        "30... Rxd3": "Trying to make up for my loss.",
        "31. Rgd1": "Not really sure about that. Comment please.",
        "31... Re3": "I am still in position to attack f3 when necessary.",
        "32. Nd5": "Um... Blah?",
        "32... Re2+": "I am wondering How he would counter back."
    },
    "url": "https://gameknot.com/annotation.pl/chess-game-2?gm=30273",
    "gameName": "Chess game 2",
    "players": "logogalaxy (1400) vs. cleanswide (1371)",
    "opening": "French defence (C00)"
}