{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Nc3 Nf6": "four knights game, all good so far, should be a quiet game.",
        "4. d3": "hhhmmmm maybe he should have developed the bishop then do this move.",
        "4... h6": "not the best move, but i really want my bishop to come out to aim against f2, and i don't want to be pinned. ",
        "5. Nd5": "wasn't expecting this. ",
        "5... Nxd5 6. exd5 Ne7 7. Nxe5 Nxd5 8. Qf3": "obviously trying for Qf7++",
        "8... Nf6": "a more talented player would have actually been able to comment on the last few exchanges, but i am a lowly player and don't really know what to make of it. \r\n\r\nactually h6 turned out ok, because his bishop can't put anymore pressure on my knight. but in truth there really is no threat for anyone. so far not a lot has happened in this game, just check out both our development. ",
        "9. g3 Bc5 10. Bh3": "he should have gone be3, it would have been good back at move 9 too.  if i had traded now, he would own the e file, plus his queen wouldn't be there to make it awkward for his bishop to move out. considering how we were only mucking around i probably would have. ",
        "10... b5": "! \r\ni did this actually just to block his knight from moving back. But exposing the rook is an old trick, the qeen becomes quickly trapped. i wouldn't be surprised if he doesn't blink an eyelid; having the rook just lie there openly, it's GOT to be a trap. Bobby Fischer had this happen to him once but he got out of it. ",
        "11. O-O": "hhmmmm maybe he knows about this, oh well kicking his knight is what i'm after anyway",
        "11... O-O": "even better. now the rook is in a position to attack the queen if it goes there (a8). Also, can't leave my king on an open file like that.\r\n\r\n",
        "12. Qxa8": "! \r\nhe took the bait.",
        "12... c6": "trapped. now queen goes up, bishop goes up, to reveal the rook.\r\n\r\nright now if he had gone nXc6, dXc6, QXc6 then he would have gotten out of it without losing too much. following that, i would have gone bXf2+ to simplify, rXf2, bXh3. ",
        "13. b3 Qb6": "moments now till the rook attacks the queen. i should be careful, his knight has a fork, and Qc7 would have been perfectly good, better even, but at the time i wanted to line up against his king.",
        "14. Bxd7": "! \r\nhe panics, he ends up worse off this way. ",
        "14... Bxd7 15. Qxf8+": "it had to happen eventually. though the fork still looms ominously.",
        "15... Kxf8 16. Re1": "! \r\nit's over. ",
        "16... Bxf2+": ""
    },
    "url": "https://gameknot.com/annotation.pl/chess-game?gm=25781",
    "gameName": "Chess game",
    "players": "???  vs. ??? ",
    "opening": "Four knights game (C46)"
}