{
    "moves": {
        "1. e4": "King's Pawn Opening.\r\n\r\nSeeks control of d5/f5 and opens diags for Q and KB.",
        "1... e5": "Black does the same, beckoning an open game. Anything other than 1. ... e5 beckons what is called a \"semi-open\" game.",
        "2. f4": "King's Gambit.\r\n\r\nWhite sacrifices a pawn to gain advantage of the centre with a later d4, and wants to aim at the square f7, usually by placing Bishop on c4. I do this in the game.",
        "2... exf4": "King's Gambit Accepted.\r\n\r\nBlack usually accepts the gambit. Also possible is 2. ... d5 3. exd5 e4 4. d3 exd3, and either of 5. Bxd3 or 5. Qxd3. I prefer Qxd3.",
        "3. Bc4": "Bishop's Gambit.\r\n\r\nI prefer playing this opening rather than the usual 3. Nf3 simply because I like feeling like a classical player. Anyone knows that the most beautiful games come from this opening. I'm a real kingside attacker also, so this really suits my style of play.",
        "3... Bc5": "(?) Not a good move, allows me to grab the centre.\r\n\r\nHe could have gone 3. ... Qh4+ right away, and after 4. Kf1, White gains a tempo with 5. Nf3. This is enough to sacrifice castling the King, and usually tends for sharper more tactical lines, as seen in this game.\r\n\r\nAlso possible is 4. ... Nf6, to which I reply 5. Nc3, to defend the e4 pawn.",
        "4. Nf3": "(?) Preventing 4. ... Qh4. Better was 4. d4, straight away, as Black can now retort 4. ... Nf6, and he has corrected his position.",
        "4... d6": "(?) Not a good move, allows me to take the centre with",
        "5. d4": ", and now Black has lost his f4 pawn also. This is no longer a gambit, but a considerably advantageous position for White. A lot of the results of a game can be predicted by the beginning, if both players are quite competent.",
        "5... Bb4+": "(?) Also loses a tempo, after",
        "6. c3": "Strengthens d4 and stops the check by the Bb4, also gains a tempo.",
        "6... Ba5": "Black has moved his Bishop three times in the opening.",
        "7. Bxf4": "I get my pawn back, and put my bishop on a fair square.",
        "7... Nf6": "Threatens e4.",
        "8. Nbd2 O-O 9. O-O Bg4": "He probably should have done this earlier.",
        "10. b4": "I threaten the Bishop, preparing for my next move.",
        "10... Bb6 11. Qb3": "I didn't want my Queen to be in front of my b-pawn. However, I realise that the Bishop was more useless on a5 anyway.",
        "11... Nc6 12. Kh1": "Trying to get d4 out of the pin on the a7-g1 angle so I can play 13. d5.",
        "12... Bxf3 13. Rxf3": "13. Nxf3 Nxe4. My rook can now maneouvre to g3 or h3 quite nicely.",
        "13... Bxd4": "(!) Black spots a tactical threat. I decided it was better the bishop would not stay on d4.",
        "14. cxd4 Nxd4 15. Qd3 Nxf3 16. Nxf3 a6": "Wanting to play 17. ... b5, I suppose.",
        "17. a4": "My answer is no.",
        "17... Re8": "Threatening 17. ... R/Nxe4",
        "18. Bg5": "Pinning the Nf6 to the spot. Note: both of my bishops are performing pins on pieces.",
        "18... h6 19. Rf1": "(!) A brave sacrifice. Right now I am hoping I can pull through on this one.",
        "19... hxg5 20. Nxg5": "Threatening 21. Bxf7+, forking Rook and King.",
        "20... Re7 21. Qh3": "(!) I silently move my Queen to the h-file, and notice that none of my minor or major pieces are not involved in the fight. Even though I'm 3 points down, Black's rook is idle on a8, his Queen is still on d8, his Knight can't move because I threaten 22. Bxf7+, his Re7 can't move because of the same threat.\r\n\r\nAs I said, the King's Gambit usually focusses on the square f7 near the king and this is no exception.",
        "21... Qf8": "(??)",
        "22. Rxf6": "(!) Forced mate.",
        "22... gxf6 23. Qh7#": "Thanks for watching my annotation. Hope this illustrated to you the power of the pieces. Hope to see you next time! Thanks for watching!"
    },
    "url": "https://gameknot.com/annotation.pl/chess-game?gm=33092",
    "gameName": "Chess game",
    "players": "bjon083 (1200) vs. rbrinkma (1200)",
    "opening": "KGA (C33), bishop's gambit"
}