{
    "moves": {
        "1. b4 d6 2. d4 Nf6 3. Nf3": "The White opening relies on the quick development of the Queen side pieces, so this move is not quite right (I did not know it at the time.) Bb2 is more accurate.",
        "3... Nbd7": "This is the Old Indian. It is not very threatening to White, but it is very safe, it is hard for White to break through.",
        "4. e3 e5": "The Old Indian is not a hypermodern like the other Indian Defenses. It is simple to play. The positions are easier to analyze, and that is why I chose to use it. My friend Sunshine94558 (on gameknott) has played this against me when she played Black, and I do not like to play against it.",
        "5. dxe5 dxe5": "With all of his pawn moves, white has given away a bit of his edge in development.",
        "6. c3": "Now , this is a mistake. Black's Bishop belongs on b2, and he should have played this to c4. The Knight on b1 has nowhere to go that is helpful, and he has now just blocked the development of his c1 Bishop. He is moving pawns and neglecting his development. He is also no closer to castling.",
        "6... e4": "I decide that I want to get more space in the center. This makes him move the Knight again, keeps his pawn on e3, which blocks the c1 Bishop, and he does not have time to develop any more pieces.",
        "7. Nd4 c6": "This is part of the Old Indian, but it is not, if you know what I mean. You see, my pawn is supposed to be on e5, and it isn't. The Old Indian has one real strategy problem...It has a traffic jam in the middle becuase the pawns block the pieces. I do not have that problem because my opponent took on e5 and because I was able to play e4. But I still need to control the center and I need to control b5, so this is a good move. It also let's my put my Queen somewhere safe.",
        "8. Be2 Qc7 9. Qd2": "I used a lot of time on my clock trying to understand why my opponent played this move. When you play in tournaments, you have a clock, and you only have so much time, but you must try to understand your opponent's move before you can find your own move. But I could not figure out this move, and I think it is another waste of time.",
        "9... Be7": "Developing this Bishop to e7 was tough. It is normal for it to go here in the Old Indian, but it looks good to create a battery with Bd6.The problem for me is, that I want to develop my Bishop, but no matter where he goes, he can be traded for White's Knight.",
        "10. Nf5": "White continues to move the same piece over and over in the opening. I could not believe his rating was over 1800.",
        "10... Ne5 11. Nxe7 Qxe7 12. O-O Bg4": "I spent a lot of time on this turn too. Should I castle to get my King safe? Well, I thought that I am ahead in development, and he has the Bishop pair, but I could get rid of the Bishop pair, and then I would really show how far ahead I am in development too.",
        "13. Bxg4 Rd8": "I made this move before taking the Bishop, because I thought I could take the Bishop any time. But my coach says I was trying to show off how clever I am. He said it is not necessary for me to make this move first.",
        "14. Qc2 Nexg4 15. h3 Ne5": "Okay, now the trades are over and we can evaluate the position. He has no pieces developed. Only his Queen. I have the d file and all my minor pieces out. My knight on e5 is the best minor piece on the board and I can castle any time I want. But what is more important is that there is a hole in White's position. It is on d3. My coach told me that he learned from Kasparov that Knights are as strong as Rooks on the 6th or 3rd Rank. So, you should put it there when you can without your opponent able to trade it away easily or when your opponent can't chase it away with a pawn.",
        "16. Nd2 Nd3": "If I knew how to put an \"!\" on my move I would. I added my Queen to bodyguard the pawn on e4. My Knight Block's his Queen and now almost all of the Black squares on White's first two ranks are unsafe for his pieces.",
        "17. Bb2": "He just wants me to trade my good knight away for his yucky Bishop. but I am not going to do it.",
        "17... O-O": "My King is safe now.",
        "18. Rfd1": "You might ask why he did not try to open up his Bishop with c4? But that would allow me to take a pawn on b4 and attack his Queen at the same time.",
        "18... Rd7 19. a3 Qe5 20. Nc4": "This is part of a long re-post of this Knight. I have to say, I had no idea where this Knight would finally end up, but he was able to make it better by eventually getting it to d4. However, this is such a slow plan that it allows me to set up my attack on the king.",
        "20... Qf5 21. Na5 c5 22. Nb3 c4 23. Nd4 Qg6 24. Rd2 Rd5 25. Rad1": "Again...White is still trying to find a way to deal with the Knight on d3. It has completely bottled up 4 pieces.",
        "25... Rg5": "Suddenly my King side attack is more than just a \"Boo\". Now it is getting to be very serious. ",
        "26. g3 Nd5": "This is my way of making my pieces better. I saw that it was possible for White to put his Knight on f4 in a couple of moves, and this is my way of stopping it. Now we can evaluate the position again. White is only defending. He has no pieces, to coordinate an attack with. The Knight can not put together a serious attack by himself. Black's two Knights have effectively tied up 4 of Whites pieces. Black has put the major pieces in prime attacking position.",
        "27. Ne2": "White is trying to find a better post for the Knight than d4, but I think he is so tied up now that there would appear to be no chance for him unless I blunder.",
        "27... Rh5 28. Kh2 Rxh3+": "This is my brilliant tactic. He can't take the Rook because of Nxf2+, Kg2, Nxe3+!, Kxf2, Nxc2, Rxc2, e3+ and White would lose a Rook, 2 pawns and the Queen for the Rook and both Knights.",
        "29. Kg2 Qh5 30. Rd2xd3": "White finally gives up. He knows he can't survive with that Knight there. He is willing to give up the Rook now, but I have other plans.",
        "30... Rh2+ 31. Kf1 Qf3": "With many mating threats hanging in the air.",
        "32. Ng1 Qg2+ 33. Ke1 Qxg1+ 34. Kd2 Qxf2+": "And mate on the next move, so White resigned. The point of this review is to show the power of a knight on the 6th or 3rd rank. There they become especially powerful pieces and they can completely disrupt the coordination of your opponents pieces. Also, one should understand the fact that one can survive not knowing an opening if they play for fast and active development. At my level and below, it is more important to be a better middle-game and endgame player than an opening expert. I hope you enjoyed my game."
    },
    "url": "https://gameknot.com/annotation.pl/chess-game?gm=46608",
    "gameName": "Chess game",
    "players": "???  vs. ??? ",
    "opening": "Polish (Sokolsky) opening (A00)"
}