{
    "moves": {
        "1. e4": "I started normally, expecting another boring beginning.",
        "1... e6": "His move was very different to any I had expected, so I was getting ready for a fun and intersting game!",
        "2. d4": "As we are usually taaught, I took the oppurtunity to take control of the center of the board.",
        "2... d5": "He challenged me to a pawn swap but I didn't really want to let him get his queen out there so quickly. Now I had to think of a way to avoid this happening.",
        "3. e5": "I ended up doing this, which proved to be very helpful for later. At that moment I was thinking that by doing that I had managed to prevent urgo from getting his knight easily to f6.",
        "3... Bd7": "Now urgo was trying to advance his bishop, I decided that wanted to castle  on the queen's side, so I was deciding on either advancing my knight or bishop.",
        "4. Be3": "Obviously, I chose bishop, as I didn't want his bishop pinning my knight if I were to move it to c3 and I didn't want to move my knight to d2, as that would trap my bishop.",
        "4... Nc6": "I guess urgo was simply advancing his pieces to get himself into a good position.",
        "5. Nf3": "I decided that I may aswell advance my knight to give me more power around the center of the board.",
        "5... f6": "When he did that, realised he wanted me to take his pawn so that he would be able to advance his knight.",
        "6. Bf4": "To avoid taking his pawn I developed the pawn's protection by adding a bishop, which would be quite useful in the exchange.",
        "6... g5": "When he did that, I noticed an oppurtunity to get a pawn up on him, unless he wanted to be checkmated.",
        "7. Nxg5": "I took the pawn because I had realised that if he took my knight, I would have a three move forced checkmate.",
        "7... fxg5": "Unfortunately, urgo didn't realise that and fell for my trap. Now the fun began!",
        "8. Qh5+": "His only option was to move his king forwards.",
        "8... Ke7": "Now I was happy that I had earlier moved my pawn to e5 as his king wouldn't have been able to escape down their now.",
        "9. Bxg5+": "I continued with my plan.",
        "9... Nf6": "Helplessly, realising his mistake, urgo did the only move possible, preparing for the inevitable.",
        "10. Bxf6#": "In just 9 moves I had beaten urgo, which is probably my quickest win!!"
    },
    "url": "https://gameknot.com/annotation.pl/chess-game?gm=38368",
    "gameName": "Chess game",
    "players": "???  vs. ??? ",
    "opening": "French (C02), advance variation"
}