{
    "moves": {
        "1. c4": "English opening to start off.",
        "1... e5": "a proper response taking control of f4 and d4. An effective move in response to the English opening.  If the opponent does not do anything to stop the pawn from moving forward, a good offense will be more difficult.",
        "2. Nc3": "bringing out the knight stops the pawn from moving and also adds extra support to d5. notice the pawns at c4 may be used as an assist for the knight later on in the game.\r\n",
        "2... f5": "Kings gambit in response.  Black really wants that e pawn to reach e4.",
        "3. Nf3": "A basic rule in chess is that you develope pieces before moving into an attack.  You'll find out that if you don't and your opponent knows what he is doing, you'll run out of pieces before you can checkmate.  Typically you want to develope your knights before bishops.  Here the knight at f3 can attack the pawn at e5 but respectfully the pawn can attack the knight.  But the knight can move to d4 and attack f pawn.  Black would have to scramble another pawn out there and by turn 4 have no power pieces developed. Black only has two pawns out and we dont want to lose tempo to empty threats.  So we develope pieces.",
        "3... Nc6": "Knight to c6 to protect e pawn.",
        "4. d4": "d4 looks risky by losing a center pawn, but in truth it will end well for white.  There will be an even trade but white's queen will be developed.",
        "4... exd4": "The trade begins",
        "5. Nxd4 Nxd4 6. Qxd4": "Now white has two power pieces developed and a pawn while black only has one unprotected pawn.  ",
        "6... d6": "letting the bishop out while keeping white from getting a central pawn. ",
        "7. Bf4": "Dark bishop developed.  Black pawn is stuck and also limiting black's light bishop movement. ",
        "7... Nf6": "black finaly begins to develope but white is already ahead in tempo.",
        "8. e3": "freeing up the bishop.\r\nOne thing I have recently learned is that you don't want to waist your pawns in movement.  Only move forward two spaces if you have to or if it is an obvious move.",
        "8... Be6": "bishop comes out as far as he can to play.\r\n",
        "9. Be2": "Notice no mirror move this time.  Mirror moves dont work when your not the last one to move.  ",
        "9... Be7": "Bishop stack and out into play as best it can.\r\n",
        "10. O-O": "Well we're done developing. It's time to king-side castle and enter into mid-game.",
        "10... c5": "He apparently doesn't want my Queen there.  Where's the best place to move it?  ",
        "11. Qd2": "d2 is the best option.  The queen takes influence over the e1-a5 file.  The rooks control the back row and the move is mindful not to block the bishops.",
        "11... Qd7": "The queen was the last power piece for black to develope. He does not want to give up the queen's influence on the d file because White's queen has great counter influence. Black hasn't castled yet either which is not good for black.  But it is still uncertain whether he should castle king or queen side.  Both options looks risky because black has moved both c and f pawn into play.  See now why it's a better idea to use your pawns wisely and not to try to devoure the board?  It is better to trade power piece for power piece instead of have an opponent take a pawn and then trade power pieces.  In chess, every little pawn counts (even if it's used as a diversion)",
        "12. Rad1": "the move puts pressure on the d file but what black doesn't know is that it is more of a replacement for the queen's influence on the d file so she can move freely.",
        "12... Rd8": "black sees the heightened influence and counters it respectfully. \r\n",
        "13. Nd5": "Now this move doesn't look like a good idea at first glance (for some it might be overlooked )\r\nbut the knight is wonderfully gaurded there and fulfils what the English opening was meant for.  any trade here would end up in white having control of the center and up a power piece. ",
        "13... Ne4": "Black sees white's move and thinks, \"Hey I can do the same thing.  But what he doesn't realize is that he is only making empty threats and asking the queen to move when we have been planning to move here all along.",
        "14. Qa5": "from this position we can take a nice little pawn.",
        "14... g5": "Wow, looks at all those pawns out there.  Things are getting messy.  ....I wonder...what was the bishop going to do anyway?",
        "15. Nc7+": "with c7 gaurded by the queen and the knight deep in the homeland of black, the threat to the bishop looks measly.  Plus the move forces the black king to move and say goodbye to castling.",
        "15... Kf8": "King moves",
        "16. Be5": "now this move is nice.  Because black thought his pawn was protecting squares.  But now we realize that if it is moved, white's queen will be captured.  So bishop e5 to threaten a rook into an awkward position is the best option.",
        "16... Rg8": "and he moves into awkwardness.",
        "17. f3": "it's time to show black that his knight is not welcome.  Trouble is...there is little he can go",
        "17... Bf7": "Now...you may ask why black moved the bishop to f7 square instead of preserving his knight.  Truth is, he saw a fork which would bring white up a rook. See?  take a look.  Instead of the bishop move envision BK knight to f6.  White knight takes e6+ black must take it with his queen or move the king.  The  bestion option is to move the queen and take the knight now at e6, which leaves the rook unprotected.  The queen takes the rook and checks.  So this move that black has done instead gaurds e6 and prevents all of that from happening.",
        "18. fxe4": "fair trade don't you think?",
        "18... Qc6": "black sees a weak h1-a8 file and takes advantage of it.",
        "19. Bc3": "the bishop moves because it was introuble.  Moving the blk queen activated the d pawn.  c3 is the only long-term safe place.",
        "19... Qxe4": "Who didn't see that comming?",
        "20. Bd3": "pressure on the queen.  Get it out of the center.",
        "20... Qxe3+": "oh no!?  The queen has driven deeper in and taken a pawn! and has checked white! ",
        "21. Kh1": "Just move out of the way...Blk is just grabbing for whatever he can...ummm what's protecting the queen?",
        "21... b6": "gah we've been blocked off from the knight and the queen is in trouble..\r\nbut wait...remember that time we treatened the a pawn and forgot about it for a while?  time to take it.",
        "22. Qxa7": "ouch",
        "22... g4": "now his power pieces are trapped and not helping his pawns.  Looks like blk wants a pass pawn.",
        "23. Rxf5": "mm we didn't need two rooks back there anyway.",
        "23... Rd7": "Hm is he planning to trap the knight?",
        "24. Rxf7+": "The only piece that can develope here and take the rook is the king.  Better take the rook king but you're not quite sure you want to. (Man...why is white giving me a rook??) ",
        "24... Kxf7": "ok he'll take it",
        "25. Rf1+": "oh, in check..and trapped...there's only one way out of it without loosing many pieces needlessly...trade queen for rook?",
        "25... Qf3 26. gxf3": "shockingly he forgot about the pawn..",
        "26... g3": "well I guess it's time to try to get the queen back",
        "27. Re1": "wait...didn't we just say that there is a pass pawn comming at us and its gaurded by a rook?\r\nwe can start moving to put pressure on the pawns along 6.",
        "27... g2+": "as expected ",
        "28. Kg1": "just ram it",
        "28... Rc8": "well black gave up on the pawn ide and decided he wants a kinght instead....should have kept the rook there though..",
        "29. Qxb6": "grab a pawn and let him have it",
        "29... Rdxc7 30. Bxh7": "All the black pieces are on queen-side.  white pieces are on King side.  Time to move in for the kill.",
        "30... Rc7c6": "yeah we were getting her out this turn anyway.",
        "31. Qb3 Bh4": "black wants a rook we're not using.  But more so...a queen",
        "32. Qc2": "bringing back the queen to the other side of the board.",
        "32... Bf2+": "seriosly...",
        "33. Kxg2": "just take unwanted rook, balck..",
        "33... Bxe1 34. Qg6+": "Time to finish this.",
        "34... Ke7 35. Qg7+ Kd8 36. Bf6+ Ke8 37. Bg6#": "and that's game."
    },
    "url": "https://gameknot.com/annotation.pl/chess-game?gm=25800",
    "gameName": "Chess game",
    "players": "???  vs. ??? ",
    "opening": "English opening (A21)"
}