{
    "moves": {
        "1. e4": "My customary 1. e4 opening.",
        "1... e5 2. Nf3 Nc6 3. Bb5": "The Ruy Lopez is my default play in this sequence.  Though I admit my knowledge of its theory is a little weak, I've played it a number of times.  It tends to produce a ragged queenside pawn structure at this level which helps to compensate for the tempi White loses while his bishop is hunted by Black pawns.  It usually ends up on b3, which isn't a bad spot for it anyway.",
        "3... Nf6": "The Berlin Defence.  It has a solid reputation.",
        "4. Nc3": "The game transposes to the Four Knights Game. 4. d3 or 4. d4 are also options here, as is 4. 0-0, but I feel that 4. Nc3 is equally as useful at this point.",
        "4... a6": "Black moves to drive the White bishop away.",
        "5. Ba4 b5 6. Bb3 b4": "Attacks the knight, and although the pawn is far extended it isn't necessarily over-ambitious.",
        "7. Nd5": "However, the white knight is reasonably comfortable here for the time being.  He may not stay that way long, however, if Black opts to develop the queenside pawns.",
        "7... Nxe4": "Black's attacks have won him a pawn, but at the same time his developent is slowed down and only going to get worse.",
        "8. d3 Nc5": "Another attack on White's bishop, who can find no peace.  Perhaps he should have become a monk instead.",
        "9. O-O": "The bishop is basically stuck.  Bc4 Na5 and White is in much the same position, facing a trade that leaves his pawns doubled, and so gives up on the bishop in favour of protecting his king.",
        "9... Nxb3 10. axb3 Bb7": "Appears to be setting up attacks on both the knights, especially the hard to defend (thanks to the b4 pawn and en passant) d5 knight.",
        "11. Bd2": "?  Not sure about this.  Perhaps threatening the pawn in case the c6 knight moves to allow the Black lsb to attack, perhaps threatening to play Qe1 and kick off a fight on b4 before Black wants it.  It's tough to find a good home for this bishop here (a fianchetto would have been nice, given the opportunity).  Perhaps Re1 or Qe1 then Bf4 would be better.",
        "11... a5": "Supports the endangered pawn.",
        "12. Qe2": "Brings the queen into the fight, and that lonely pawn needs friends soon.  e2 over e1 as it allows a rook to develop.  e2 also might allow something else, if White spots the danger.",
        "12... d6": "The pawn gets a friend.",
        "13. d4": "The e5 pawn is of course pinned by the queen.",
        "13... Ba6": "A skewer.  White must sacrifice a rook for his queen.",
        "14. Qe3 Bxf1 15. Rxf1 f6": "Black is trying, I think, to build a strong pawn centre.",
        "16. Qd3": "Planning Qb5, after which Black plays Qd7 and White responds Qb7, with Black having major trouble.",
        "16... Ne7 17. Qc4": "White now threatens Nxc7+ with more danger for black.  White's threats are coming one at a time.  Ideally, he would like to build more danger up before unleashing multiple threats at once, but he has very low piece activity here: his f3 knight would need to go via h4 to get anywhere and even then he wouldn't be able to do a lot unless the black knight is moved or removed.  Black's pawns dominate White's bishop and White's remaining rook is in a very defensive position.  Although Black has limited activity himself, he looks defensively sound.  Overall, to me, the position looks quite drawish, though of course at this level either side could blunder easily.",
        "17... Nxd5 18. Qxd5": "This exchange forces off one of White's better pieces and lessens the massive cramp around Black's dsb.",
        "18... exd4": "? Opening up the file on the king, who cannot castle unless/until the White queen is dislodged, for a pawn that will be easily reclaimed, also allowing White to claim a better position for his knight.  Perhaps Ra6 to prepare c6 was better.",
        "19. Re1+": "The rook has an unexpected opportunity to get involved.",
        "19... Be7 20. Nxd4": "The knight can wreak havoc from either c6 or f5 - this seems like a good square for him.",
        "20... Qd7": "?? This can only be an oversight.  Black's sturdy defense is at the expense of mobility, and perhaps the desperate search for activity has caused him to mistakenly advance his queen.  As before, I prefer Ra6 to prepare c6.",
        "21. Qxa8+": "There may have been other choices here - 21. Nf5 looks good.\r\nA: Black moved neither King nor Queen: 22. Rxe7 Qxe7+ 23. Nxe7 Kxe7, and White is left with a +1 material advantage that should work out ok.\r\nB: 21. ... Qxf5 22. Qxf5  White has a Queen where Black has a pawn and a rook.  Both sides have some material, but again White should do ok.\r\nC: 21. ... Kf8 22. Rxe7 Qxe7 23. Nxe7 Kxe7, and again White has a +1 material advantage he would try to turn into something more concrete.\r\nD: 21. ... Kd8 22. Qxa8 Qc8 23. Qxc8+ Kxc8 24. Rxe7 White finishes here with +5 material, his knight and bishop against one black pawn, and he can pick up that pawn at g7 immediately.  White has a decisive advantage here.\r\nE: 21. ... 0-0-0 A tempting option that protects the rook - at the expense of 22 Qa8#\r\n\r\nThe disadvantages of these moves are not that great, but they are better hidden than the biggest disadvantages of the text move.  Overall, the immediate material grab is probably just as valuable if not more so, making this both the most obvious and best move.",
        "21... Qd8": "The only reasonable defence.",
        "22. Qd5": "White declines a Queen trade in favour of a retun to the pressure attack of before.  22. Qxd8 Kxd8 23. Nc6 - 24. Nxe7 offers a material advantage to White, although not quite as much as the best defence against the moves that follow.  It doesn't really seem to matter what White does here: the dropped rook has robbed Black of a vital defender and it matters only if he will force White to push his advantage to the end or will instead break early.",
        "22... c5": "The knight will have to move, but he wanted to do that anyway.  I really think Black is out of ideas.",
        "23. Nf5": "Nc6 was also an option, and plays out very similarly to this move.  The point is of course to pressure the bishop.",
        "23... g6": "? Black offers no defence.  Although he is certainly lost anyway.",
        "24. Rxe7+ Kf8": "Qxe7 was slightly better, though Black's rook seems unlikely to triumph over the Bishop and Queen.",
        "25. Qf7#": ""
    },
    "url": "https://gameknot.com/annotation.pl/chess-game?gm=43482",
    "gameName": "Chess game",
    "players": "Jokeslayer (1821P) vs. Anonymous (1412)",
    "opening": "Ruy Lopez (C65), Berlin defence"
}