{
    "moves": {
        "1. e4": "1.e4 - The game starts with a very uncommon move by white.",
        "1... e5": "Black is confused and decides to copy whites move.",
        "2. d4": "White puts a quick end to blacks hopes of copying evey move and plays 2.d4, preventing the symmetric response, because in case black would play d5 now, white can simply take the pawn on e5 pinning black´s d5 pawn to black´s queen.",
        "2... exd4": "So black simply decided to take the pawn here...",
        "3. Qxd4": "But he missed, that white had the simple, still genious move Qxd4. In that way white succeded in tying down black´s bishop to the defense of his g7-pawn, black´s rook to the denfense of the a7-pawn and black´s bishop, queen and king !!! to the defense of the d7-pawn...an awesome move!!!!",
        "3... Nc6": "Black decided to move one of his view pieces which can still move and attacks the queen.",
        "4. Qd5": "But the white queen didn´t get intimidated by that. She simply approaches the black knight....and the black king!!",
        "4... Nf6": "Black tries to catch the queen again with his other knight.",
        "5. Qf5": "But it´s hopeless....",
        "5... d6 6. Qb5 a6 7. Qg5": "White´s queen just goes back and forth, back and forth provoking an over-extansion of black´s pieces. And black doesn´t see the trap!!!!",
        "7... h6 8. Qf4": "Here white missed something. He should have played 8.Qxg7, what would have resulted in the the trade of black´s pawn against white´s queen. Well, white would have lost the exchange, but would have had more than enough compensation, because of black´s weak pawn-structure. (isolated f and h pwans)",
        "8... g5 9. Qe3 Bg7 10. Qc3 O-O 11. Qc4 Be6 12. Qa4 Nd7": "Black becomes aware of the fact, that his defense has been weakened too much and retreats with his knight to add protection to the b8-square.",
        "13. Nf3": "But too late...white´s attack had just started.",
        "13... b5": "Nice try by black...Unfortunately he missed, that his a6-pawn is pinned to his rook and therefore can´t defend the b5-pawn.",
        "14. Bxb5 axb5": "Black is in a bad psychological state. So he simply decides to take on b5 and sacrifice his rook. Or maybe he thought the queen is worth more than the rook. Lots of beginning players actually do think the so, but recent scientific research has proven, that this is nothing but a myth. The queen might be able to move diagonally, but that´s not really an advantage for a couple reasons:\r\n1. If you don´t pay attention the queen is way more likely than the rook to stalemate your opponents king in the endgame.\r\n2. The queen starts the game very close to the center of the field, where she can get under fire very easily. But the rooks start at the corner of the board where they can easily attack both flanks of your opponent´s army.\r\n3. Last but not least the rook-pair has proven very strong in lots of chess games. Unfortunately it´s usually not possible to have a queen-pair early in the game.",
        "15. Qxa8": "For the reasons mentioned above, white traded his queen against black´s rook and is up the exchange.",
        "15... Qxa8 16. Nxg5": "Here white got rid of blacks pawns, which are potential rooks in the endgame. Since a knight can never become a rook in the endgame, white decided to trade it off, too.",
        "16... hxg5 17. Bxg5": "White won 2 (potentional) rooks for only 1 knight.",
        "17... Bxb2": "The first time in the game that white missed something. ",
        "18. O-O": "Now it´s all about saving king Charles!!",
        "18... Bxa1 19. Nd2": "White opens a discovered attack on black´s bishop, while the knight is heading towards balck´s king. It´s only 4 moves away from delivering check now.",
        "19... Qxa2": "A very loose move. Black becomes greedy and takes on a2. The move might have won a pawn, but also weakened black´s back rank.",
        "20. e5 Bxe5 21. Ne4 Qxc2 22. Ng3 Bc4 23. Nh1": "Black now starts to mess arround, because he doesn´t see any concrete plan, while white builds up his defense structure.",
        "23... Bxh2+": "Black couldn´t take the pressure anymore and decided to sacrivice his bishop.",
        "24. Kxh2 Qh7+ 25. Kg1": "The pressure on black´s king might seem overwhelming, but in my oppinion black´s still fine and might be able to draw this game.",
        "25... Bxf1 26. Kxf1 Qxh1+": "It´s just black´s moves from now on, that ruined his game.",
        "27. Ke2 Re8+ 28. Be3": "Centralizing the bishop, while black´s queen is stuck in the corner.",
        "28... Nd4+ 29. Kd3 Qd1+ 30. Kc3 Ne2+": "I hope you can see that black might be up in material, but his pieces are barely activated. Most of them hanging arround on the rim of the board. White instead had already finished the developpment of his pieces, which are placed very central.",
        "31. Kb4": "Attacking the pawn on b5. Actually I still think black might have won this game at that point, but he simply didn´t think about bringing his king into the game, which is a crucial misstake in the endgame.\r\n",
        "31... c5+ 32. Kxb5 Rb8+ 33. Kc6": "The white king has made his way into the core of blacks army and is now forking blacks pawn and knight. Facing this threat, black has no other choice but accepting the draw offer made by white.\r\n\r\nA very deep game with revolutionary ideas by both players. I hope you enjoyed!"
    },
    "url": "https://gameknot.com/annotation.pl/chess-game?gm=37055",
    "gameName": "Chess game",
    "players": "buyongxie  vs. jonkerjan ",
    "opening": "Centre game (C22)"
}