{
    "moves": {
        "1. d4": "\nWhite Kingdom begins its march across the mountain, stopping to rest at about the halfway point between the two kingdoms.",
        "1... Nf6": "\nThe Kingside Reconnaissance Team moves out of the castle area to get a closer look at reports of a White Kingdom squadron moving closer to the Black Kingdom.",
        "2. c4": "\nWhile the squadron originating from d2 rests, Daxter sends c2 to accompany them.",
        "2... g6": "\nAntony deploys a squadron next to the reconnaissance team as a precaution, since the Whites' intentions are still uncertain.",
        "3. c5": "\nThe squadron of c2 moves ahead of d2, disobeying orders to wait for them.",
        "3... Nd5": "\nThe reconnaissance team moves fairly close to the two White Squadrons, but any attempt at communication is ignored.",
        "4. c6": "\nThe squadron of c2 moves up, ignoring the ordeal of those from d2 being blocked by the reconnaissance team.",
        "4... Nxc6": "\nThe Black Survey Corps are the first to spot the squadron, and assume the worst.\n\nThe squadron of c2 is destroyed and the Survey Corps get information from the reconnaissance team.",
        "5. Qb3 Bg7 6. Qxd5 Nb8 7. Qe5 Bh6 8. Qxh8+ Bf8 9. Qxh7 g5 10. Qh5 g4 11. Qxg4 d6 12. Qf4 Be6 13. Bd2 Bg7 14. Ba5 Bd7 15. Qg5 Bxd4 16. e4 Bc5 17. e5 dxe5 18. Qxe5 b5 19. Bd2 a5 20. Na3 Kf8": "king relocates",
        "21. Nh3 a4 22. Rc1 Bb6 23. Qxb5": "\nbishop wants to go kill the queen even if it costs his life, but antony won't allow him",
        "23... Bg4 24. f4 Qd4 25. Rxc7 Qd8 26. Nc4 Bd4 27. Na3 Qxc7 28. Qe8+ Kg7 29. Qxf7+": "Careless move, but the white queen was bloodthirsty from killing all those pawns",
        "29... Kxf7": "The king is forced to murer the white queen with his bare hands and nothing else",
        "30. Bc4+ Be6": "bishop defends king with his life",
        "31. Bxe6+ Ke8": "King cannot muster the strength to destroy the bishop, so he retreats",
        "32. Bb4 Nc6 33. Bxe7 Nxe7 34. g4 Ng6 35. Bd5 Nh4 36. Nb5 Bxb2 37. Nxc7+ Kf8": "King is mortified, runs away",
        "38. Ng5 a3 39. Nxa8 Kg7 40. Nc7 Ng6 41. Nce6+ Kh6 42. Ng7 Nxf4 43. Ne4 Bxg7 44. Nc5 Nh3 45. Nd3 Nf4 46. h4 Nxd5 47. h5 Kh7 48. g5 Nc3 49. Nf2 Nd5 50. Ne4 Nf4 51. Nc5 Bf8 52. Nb3 Nxh5 53. Nd4 Bd6 54. Nf3 Kg8 55. g6 Bc7 56. O-O Bb6+ 57. Rf2 Bxf2+ 58. Kxf2 Ng7 59. Ne5 Nf5 60. Nd7 Nd4 61. Nf6+ Kg7 62. Nh7 Nc2 63. Nf8 Ne1 64. Ne6+ Kxg6 65. Nf8+ Kf5 66. Nh7 Nd3+ 67. Ke2 Nc1+ 68. Kd1 Nxa2 69. Nf8 Ke4 70. Ne6 Kd3 71. Nd4 Kc3 72. Ne2+ Kd3 73. Nc1+ Nxc1 74. Kxc1 Ke2 75. Kc2 Ke1 76. Kd3 a2 77. Ke3 a1=Q 78. Kf4 Qd4+ 79. Kg5 Kf2 80. Kh6 Qf6+ 81. Kh7 Kg3 82. Kg8 Kh4 83. Kh7 Kh5 84. Kg8 Qe6+ 85. Kh8 Kh6": "The white king is locked up in the kingdom"
    },
    "url": "https://gameknot.com/annotation.pl/chess-game?gm=55197",
    "gameName": "Chess game",
    "players": "???  vs. ??? ",
    "opening": "King's Indian defence (E60)"
}