{
    "moves": {
        "1. e4": "This is a very turbulent game played between myself (White, 1615) and harmo (1727).\nIt is played in the extremely aggressive Muzio Gambit line of the King's Gambit, in which white sacrifices a Knight to develop quickly and attack the black king with dynamic and active (though outnumbered) pieces.\nBut is that enough?   ",
        "1... e5 2. f4 exf4": "The King's Gambit accepted.",
        "3. Nf3 g5": "I opt for the Knight's Gambit and he responds with g5, the classical defense.",
        "4. Bc4 g4": "I play bc4, which is a valid alternative to h4.\nHe plays g4, threatening a subsequent queen check on h4 when the Knight moves... ",
        "5. O-O": "The Muzio Gambit.",
        "5... gxf3 6. Qxf3 Qf6": "He accepts and then plays queen f6,which, according to theory,is the best move in this position.",
        "7. e5 Qxe5": "I play e5 to deflect the queen from f7, and he takes.  ",
        "8. Bxf7+ Kxf7": "I play a very risky line involving a Bishop sacrifice on f7 that draws out the black king.",
        "9. d4 Qxd4+": "I play d4 to open more files, and he accepts this last sacrifice as well.",
        "10. Be3": "I develop quickly with be3 and fight for compensation.",
        "10... Qg7": "He goes back...",
        "11. Bxf4 Nf6": "I take on f4, threatening a discovered check on e5.",
        "12. Be5": "I pile up on f6.",
        "12... Be7": "So he defends.",
        "13. Nc3": "I develop and threaten to play Knight d5.",
        "13... d6": "He prevents that.",
        "14. Bxf6": "So, I exchange on f6 and then plan nd5.",
        "14... Bxf6 15. Nd5 Nd7": "He covers f6.",
        "16. Rae1": "I bring the last piece into the game and threaten the very venemous check on e7.\nNow, the hunt for the black king can begin. ",
        "16... Re8": "He decides to allow an exchange and later fork on f7 in order to protect his king, which proves invaluable later on.",
        "17. Rxe8 Kxe8 18. Nxc7+": "I exchange and go for the fork as my material situation is rather precarious and any exchange would be fatal for me if I don't get compensation.",
        "18... Kf7": "He goes to f7, more solid than e7 which would allow me to save my Knight from h7 after a possible capture (the other two squares, of course, losing the queen to the Knight fork). ",
        "19. Qd5+": "I take the oppurtunity to throw in a check and close in with my queen. ",
        "19... Ke7": "He goes to e7, the only good move as g6 with a possible rf1-f3-g3 is suicidal and the other squares run into Knight forks.",
        "20. Qe6+": "I enter black's camp with a check.",
        "20... Kd8": "The king retreats to the relative safety of d8.",
        "21. Qxd6": "I take on d6 and clear e6 for the Knight.",
        "21... Qe7": "He barricades his king and tries to force a queen trade.",
        "22. Ne6+": "I check on e6 and analyze that the best I can get is a draw and offer one.\nAll in all, I attacked very vehemently and sacrificed a lot of material, but black kept finding resources to escape the many mate threats.\nSo, I ended up with this position and an unclear endgame where I can get back the h8 rook but loose the b pawn.\nMy somewhat hasty attack was brushed aside by this creative and resourceful opponent that kept finding defenses in very difficult positions.\nHowever, this game shows that the Muzio Gambit is nevertheless a potent surprise weapon that generates very interesting and fun games.\nIt is a huge risk, but unless black defends very accurately, he will be overrun.\nI will definitely retry it, get a feeling for it, and would recommend it to any aggressive player that is reading this annotation.\nThank you very much for reading!\nPlease comment, feedback is welcome. ",
        "22... Ke8": "Continuation!\nKe8 is forced.",
        "23. Nc7+": "I need the rook, so I have to play this. ",
        "23... Kf8 24. Qxe7+": "Unfortunately I have to exchange Queens for that.",
        "24... Kxe7 25. Nxa8": "I take.",
        "25... Be5": "He closes off the escape route...",
        "26. c3": "I take the oppurtunity be5 created to protect b2.",
        "26... b6": "He plays b6, preparing Bb7 to win back the knight.",
        "27. Re1": "I reopen an escape route for the Knight by pinning the Bishop.",
        "27... Kd8": "He moves out of the pin and now, my Knight is doomed",
        "28. Rf1": "I go back to f1 so that when he takes on a8, I can play rf7 and break into the seventh rank.",
        "28... Bb7": "Bb7 Comes.",
        "29. Nxb6": "I can at least still get a pawn and hope for compensation through an active rook on f7 and the 3:1 queenside pawn superiority.",
        "29... Nxb6": "He takes back.",
        "30. Rf7": "Rf7 is played. Even though my material situation is grave, I do develop some annoying rook activity and can perhaps win back some pawns.",
        "30... Be4": "Be4 is played to protect h7. I wasn't sure about this move as it leaves my 3 pawns unopposed after Rxa7.",
        "31. Rxa7": "Materialism....\nBut I really had no good alternatives.",
        "31... Bg6": "He wants to avoid having loose pieces, and so drops back the Bishop to the safety of g6.",
        "32. g3": "This move is very prophylactic, but I have to stop Bf4 and c1, which would threaten and harry my pawns from behind.",
        "32... Nc4": "Nc4 comes, threatening my pawn.",
        "33. Rb7": "So I protect even though the prospect of Nxb2 Rxb2 Bxc3 is daunting as I lose my only real advantage; my pawns on the queenside.",
        "33... Kc8": "He tries to push away my rook.",
        "34. Rb5": "I retreat and hit his Bishop.",
        "34... Bf6": "This decisive blunder allows me to turn the tables on him. 34 ... Bc7! would have been much better.",
        "35. Rc5+": "I fork.",
        "35... Kb7 36. Rxc4": "So now I am luckily up a piece and am winning. The rest is straightforward: push the pawns, force the Bishops to sacrifice themselves, and mate the king.",
        "36... Bb1": "He tries to get behind my pawn chain,but now it's too late.",
        "37. a4": "Charging to promotion.",
        "37... Bd8": "Trying to halt the avalanche of pawns.",
        "38. b4": "B4 gets it back moving.",
        "38... Bb6+": "This is an inaccuracy that would be better replaced by bd3, according to Computer Analysis.",
        "39. Kg2": "It just helped my king close with its pawns, which it wanted to do anyway.",
        "39... Bd3": "Hitting my rook. Now I just have to be careful to keep the rook supporting the pawns and not let it be displaced.",
        "40. Rf4 Be3": "Attacks it again. Note that rf3 runs into Be4.",
        "41. Rf7+ Kb6": "I activate my rook again...",
        "42. Kf3": "...and come in with my king.",
        "42... Bc1 43. a5+": "Pushing on.",
        "43... Ka6": "He blocks.",
        "44. Rc7": "Preparing c4 to shut out the d3 Bishop.",
        "44... Bf5 45. c4": "Another pawn advance.",
        "45... Bd2": "Bd2, which looks active, is actually an inaccuracy due to this little maneuver:",
        "46. Rc6+ Ka7 47. Rb6": "Now his king is caught on two squares and the pawns are free to adance.",
        "47... h5": "Trying to play 48... h4 and immobilize my pawns on the kingside, and also stops g4.",
        "48. c5 Bg4+": "Another inaccuracy which allows me to reach my queenside with my king.",
        "49. Ke4 Bh3": "Stopping my pawns but passively placing the Bishop.",
        "50. c6": "Now, the pawn is a concrete danger.",
        "50... Bg2+": "Activates the Bishop with check.",
        "51. Kd3 Be1 52. b5": "Sets a trap by inviting him to take on a5 and then play ra6+.\nThis sounds very naive but it is always good to trip up your opponent with small tactics. ",
        "52... Bxa5": "Incredibly, my primitive gamble pays off and I will be up another piece; extinguishing black's drawing chances.",
        "53. Ra6+": "The idea of 52. b5. ",
        "53... Kb8 54. Rxa5": "So now it is +5 materially and +9.58 positionally; Thus, the rest is just grinding through some basic endgame strategies.",
        "54... Kc7 55. Ra7+ Kb8": "The last blunder. Kb6 Rb7+ kc5 would still delay White for a long time and force him to use his kingside to deflect the hastily constructed yet effective Bishop-King barricade.\nAs it is, White simply crashes through.",
        "56. c7+": "c7+ is annoying as the rook cannot be taken. However, the Computer says rf7 is better as it leads to a faster mate.",
        "56... Kc8": "Is forced.",
        "57. b6 Bf3 58. Kd4": "Coming in with the king.",
        "58... Bg2 59. Ke5": "I had a faulty thought process that focused too much on the king advancing and missed the excellent 59. Ra2!! which have led to mate in eight moves or if black sacrifices his Bishop, a simple rook+king vs king local endgame.",
        "59... Bf3 60. h3 Bg2": "My blunder made this kingside intervention necessary.",
        "61. g4 hxg4 62. hxg4": "Now I have three past pawns.",
        "62... Bc6 63. Kd6": "This is where this Annotation's continuation ends. He played on to the bitter end, but this position is simply lost due to his unlucky 34th move.\nThis was a truly crazy game in which harmo showed that he is a strong defensive player who can hold together difficult positions, but a series of inaccuracies gave away the win, and then the draw."
    },
    "url": "https://gameknot.com/annotation.pl/chess-game?gm=58387",
    "gameName": "Chess game",
    "players": "jonasthiergart  vs. harmo ",
    "opening": "KGA (C37), double Muzio gambit"
}