{
    "moves": {
        "1. e4": "White begins with the most popular opening; occupying the centre with the King's pawn. ",
        "1... e5": "Black counters to block further advance of the white pawn & to compete for control of the vital centre squares.",
        "2. Nf3": "Good developing move - the knight is brought into play, it attacks both the centre and the black e-pawn, and prepares for castling on the Kside ",
        "2... Nc6": "Black develops Knight to defend the pawn & challenge White's aim for control over the centre",
        "3. Bb5": "Another good developing move - this classical opening is called the \"Ruy Lopez\" in which White is increasing the pressure on the Black e-pawn by attacking the piece that is defending it.",
        "3... Nf6": "This response is called the Berlin defence which tends to leave Black safe but cramping his development into the middle game.",
        "4. Bxc6": "White opts to take the Knight; the more usual move is to take the opportunity to castle early and get the White King safely away from the centre. Black's intention is obviously to gain material by winning the e-pawn, but an attack at this stage could be premature. It also means that White has moved the B twice but these moves will be lost when the piece is removed from the board.",
        "4... bxc6": "Black equalises material, with a pawn capture towards the centre, adding to the degree of control he has over the centre squares -  leaving both e-pawns vunerable to attack.",
        "5. Nxe5": "Nxp; also theatening the f-pawn - and potentially forcing the Black to move his King before he has castled. The Knight also attacks the black c-pawn preventing the advance of the d-pawn.",
        "5... Qe7": "Black develops his Q threatening the N, the e-pawn and also check on the K, whilst at the same time protecting the f-pawn.",
        "6. d4": "White protects the Knight with the d-pawn and releases his Q-side B for development, but the vunerability of the Knight, due to the early attack, denies White the opportunity to castle & so improve the security of the White King. Also, the White e-pawn remains unguarded.",
        "6... Nxe4": "Black captures the e-pawn whilst creating an attack on Black's f-pawn. ",
        "7. O-O": "White castles, avoiding the danger of the N being pinned, improving security for the King, and protecting the f-pawn.",
        "7... c5": "Black advances the c-pawn, removing it from the Knight threat, whilst attacking the d-pawn. The black c-pawn is protected by Knight, Queen & Bishop. If White chooses to exchange the pawns, the white Knight would be lost.",
        "8. c3": "White chooses to defend rather than exchange the d-pawn. This decision has the disadvantage of denying the White Knight on b1 its best development square.",
        "8... Bb7": "This Bishop move helps protect the black Knight on e4, but more importantly, will deny the white Knight access to the c6 square, planning for d6 next move.",
        "9. f3": "White attacks the black Knight , but the Knight has good escape options. This move weakens the white King's defences & also removes another escape square from the white Knight, which will shortly come under further attack.",
        "9... Nf6": "The black Knight escapes without difficulty, the black c-pawn loses one defender but is still well protected. Furthermore, exchanging the pawns now (after re-capture by the Q) would result in check from the Q along the diagonal and the subsequent loss of the Knight.",
        "10. Be3": "The white Bishop is developed to e3 giving added protection to the d-pawn (which however is already defended twice and attacked only once). More crucially, the Bishop itself is undefended on this square, and is vunerable to attack from the Q if the Knight is forced to move. ",
        "10... d6": "The white Knight is now attacked, and must move or be taken. It has a choice of three squares, but only two of these allow it to protect the Bishop, which will be subject to a \"discovered\" attack. ",
        "11. Ng4": "The Bishop is attacked once and defended once - but the only defender is itself also subject to attack! Furthermore, the Bishop will be lost to check, which will dictate White's reply. ",
        "11... Nxg4": "By exchanging Knight's, black removes the Bishop's only defender. ",
        "12. Bf2": "White accepts the loss of the Knight, and tries to protect the Bishop. Here, Black is in some danger of having his Queen \"pinned\" in front of the King and needs to take care to avoid Re8, because the Q then could not move (because to do so would mean putting the black King in check).",
        "12... Ne3": "Ne3 forks the Q & R, forcing the B back into the firing line.",
        "13. Bxe3 Qxe3+": "Bearing in mind the danger of having the black Q pinned, this move is only safe because the Q gives check whilst capturing the B.",
        "14. Rf2": "White remains a piece down, and chooses to block the Q check with the R.",
        "14... O-O-O": "Black opts to castle Q-side, immediately, to avoid any risk of the Q being pinned",
        "15. d5": "White advances the d-pawn, avoiding the risk of capture & blocking the Bishop threat along the long diagonal.",
        "15... Re8": "Re1 gives protection to the black Q, which, though alone & deep in enemy territory, could only be attacked at present by the opposing Q. As Black has a material advantage, a Q exchange would suit Black rather than White.",
        "16. Nd2": "Here Black has a problem with development, because the black Bishop on f8 is restricted and in turn is hindering development of the K-side Rook. ",
        "16... Be7": "Black's intention is to bring the Bishop to h4 adding to pressure on the alraedy pinned Rook. An option overlooked in the game was the B capture of the white d-pawn whose protention from the white Q has been blocked by the previous knight move. ",
        "17. Nc4": "This attack by the Knight highlights the danger to the black Queen who is undefended and needs to find a safer square to buy time for the development of his other pieces.",
        "17... Qf4": "The Queen finds a square from which to attack the Knight, forcing White to move or defend the Knight, so allowing the Bishop to come to h4. It can also be noted that White can create an attacking option if the Knight goes to h5 and the Queen to b3 on a subsequent move.  ",
        "18. Na5": "To allow the Knight to take the Bishop would enable a check by the Q on the next move after the King retakes.",
        "18... Ba8": "The Bishop retreats effectively preventing any advance by the Knight",
        "19. c4": "The pawn advance defends the d-pawn - possibly in preparation for Qb3?",
        "19... Bf6": "Black opts for the f6 square to advance his Bishop - having decided that a pawn fork involving Q & B if the B had gone to h3 would have been too dangerous. From f6 the Bishop threatens the b-pawn & pins it against the Rook.",
        "20. b3": "This pawn advance is obviously an error by White, losing the exchange after BxR",
        "20... Bxa1 21. Qxa1": "QxB occupying the long diagonal & threatening Black's g-pawn (though any such attack would allow either Q or R to check the White King on the back row).",
        "21... Re5": "Black's rook blocks the long diagonal, planning to align the Rooks next move for a back-row check that would win the White Queen",
        "22. Nc6": "A forked attack by the Knight theatening both Rook & pawn (with check from a7!)",
        "22... Bxc6": "Black takes the Knight removing the threat it posed, and preserving the possibility of aligning Rooks for a back row check. ",
        "23. dxc6": "White retakes with the pawn. Although well advanced the pawn is blocked and it lacks support, so does not pose a significant threat.",
        "23... Rhe8": "Black aligns Rooks threatening a back row check which would win the White Queen",
        "24. Rf1": "White sees the danger and defends the back row with the Rook",
        "24... Qd4+": "Black Q forks K & Q forcing the exchange. The idea is to create a passed pawn which White cannot prevent from being promoted",
        "25. Qxd4 cxd4": "The Queen exchange favours Black because because of the passed pawn but also because Black has a material advantage",
        "26. f4 Re5e2": "Black advances the rook avoiding the threat from the f-pawn and now attacks the a-pawn",
        "27. h4": "White's intention here is not clear. Advance of the a-pawn could have prevented its loss.",
        "27... Rxa2": "Rxp intending to bring the other rook to e2 creating a check-mating attack following removal of the g-pawn.",
        "28. Rf2": "White prevents the intended rook advance, but again the exchange suits Black in these circumstances.",
        "28... Rxf2 29. Kxf2": "The White king retakes the rook, but the passed pawn now has a clear path to promotion since the king cannot cross the e-file.",
        "29... d3": "White resigns at this point, recognising that mate will be inevitable within a few moves."
    },
    "url": "https://gameknot.com/annotation.pl/chess-tricks-lesson-one?gm=3644",
    "gameName": "chess tricks lesson one",
    "players": "irenehuls (1223) vs. tamochancer (1479)",
    "opening": "Ruy Lopez (C65), Berlin defence"
}