{
    "moves": {
        "1. d4": "im posting this annotation for a serious question about my opening, i need to see which of a certain move is better.",
        "1... Nf6 2. e3 e6": "ok, that's expected(kind of)",
        "3. Nf3": "question one: \r\n3 Nf3 ....\r\nor\r\n3 c4... which is better? the other becomes move 4",
        "3... d5 4. c4 c6": "that is an ugly pawn structure he has right there. all we know is that the c bishop isn't going anywhere anytime soon",
        "5. Bd2": "this is my main question, which is better:\r\n5 Bd2\r\nor\r\n5 Nbd2?",
        "5... Ng4 6. Ne5 Nxe5 7. dxe5 Qg5": "just an fyi. for the first time in one of my annotations: I take the queen through skill, not error. look for that around move 20.",
        "8. f4": "error on my part?",
        "8... Qh4+ 9. g3": "now i have an uglier pawn structure. this guy knows how to take people into middle game, I'll give him that. ",
        "9... Qh6": "the queen never moves again.",
        "10. Qb3": "kind of a stupid move because the bishop can't really move anywhere. ",
        "10... dxc4": "then again...",
        "11. Qxc4": "as long as my queen is out, I might as well take advantage of the situation.",
        "11... Be7": "develop and preparing for a castle. as you can see, my castiling ability is ... devastated. ",
        "12. Nc3 b5": "oops. thats a mistake. a big one, two. ",
        "13. Qe4 f5": "mistake?",
        "14. exf6 e.p.": "or did he just forget en passent?",
        "14... Bxf6": "was bishop take the best move?",
        "15. Nxb5": "this is just amazing. you have to watch this (the games already coming to an end) and that a8 rook is (as good as) dead",
        "15... Bb7": "i thought that might happen... so:",
        "16. Nc7+": "awesome",
        "16... Kf7": "now I COULD take the rook and be done with it. OR i could push the king a bit further. this is just awesome: watch this.",
        "17. Qxe6+": "5",
        "17... Kg6": "i see a future pin coming.",
        "18. f5+": "4",
        "18... Kg5 19. e4+": "3\r\nthis is just amazing. take a minute to absorb this.",
        "19... Kg4 20. Bxh6": "2",
        "20... Bxb2": "?!",
        "21. f6+": "1\r\nthese pawn pushes are really annoying to black right now.",
        "21... Kf3": "was this the best possible move for black? I think so, but it is still mate.",
        "22. Qf5#": "I didn't even notice this was mate until the little notice came up. he shouldn't have taken the b2 pawn and should've taken h6. "
    },
    "url": "https://gameknot.com/annotation.pl/chess-game?gm=35143",
    "gameName": "Chess game",
    "players": "???  vs. ??? ",
    "opening": "Queen's pawn game (A45)"
}