{
    "moves": {
        "1. e4 c5": "I immediately played c5 and hit the clock.",
        "2. Nf3": "A normal move.",
        "2... d6": "I thought for a while on this nove because I was most familiar with 2.... e6 and Nf6. I was playing a opponent who I know well. a6 and g6 is also possible.",
        "3. d4": "Striking the centre. I get whites better d pawn but white gets quick development.",
        "3... cxd4 4. Nxd4 Nf6 5. Nc3": "Standard moves. I was considering the 3 main options ( g6, a6 and e6)  I didn't want to play the Dragon because I don't play it frequently.",
        "5... a6": "The most aggressive line. Prepares for a minority attack.",
        "6. Bc4": "The Sozin attack. Attacks the weak f7 square.",
        "6... b5": "Gains tempo by attacking the bishop and allows my LSB to develop on the next move.",
        "7. Bb3": "Bd5 was possible here.",
        "7... Bb7": "A lot of pressure is being put on the centre.",
        "8. f3": "Protects the pawn on e4 and signals that whtie wants to castle queenside.",
        "8... e5": "Attacks the well placed knight on d4 but gives me a backward pawn on d6",
        "9. Nde2 Be7": "Develops the DSB",
        "10. Be3": "It seems that he's developing the queenside to get ready to castle on it.",
        "10... O-O 11. Qd2 Nbd7 12. O-O": "This move surprised me as White had the option to castle Queenside and could've easily started a pawn storm.",
        "12... h6": "A Flight square for my king. Maybe better was 12.... Rc1",
        "13. Bxh6": "It starts to get interesting here. I think that this was pointless and completely loses.",
        "13... gxh6 14. Qxh6": "White doesn't have the material to successfully checkmate me. It gets really crazy from here",
        "14... Nh7": "Makes way for my DSB and queen battery.",
        "15. f4": "White tries to bring more pieces to the attack.",
        "15... exf4": "Here I foolishly capture on f4.",
        "16. Rxf4": "I miscalculated that He could play Rg4 pinning my bishop to the king if I ever tried to fork the rook and queen. I realised this just then.",
        "16... Kh8 17. h4": "A kingside pawnstorm. He must be mad.",
        "17... Rg8": "Here I blundered with Rg8. Far better was Bg6 which blocks the rooks attack on f7 and prepares the bishop to defend.",
        "18. Bxf7": "The most obvious move.",
        "18... Rg7 19. Bg6": "Pressure on h7.",
        "19... Qg8": "Attacking g6.",
        "20. h5": "Reinforcing g6.",
        "20... Ne5": "The white queen is in a pretty awkward position with no escape squares.",
        "21. Raf1": "Doubles up. It was idiotic to not capture on g6.",
        "21... Qe6": "I try to get the rook to g8.",
        "22. Ng3": "I had some sort of feeling not to take the bishop on g6. I must;ve been drugged or something because that move stares you in the face.",
        "22... Rag8 23. Nf5 Nxg6 24. Nxg7 Rxg7 25. hxg6": "He tries to set up a trap. If the pawn is taken with the rook\n",
        "25... Qxg6 26. Qxg6 Rxg6": "2 bishops against a rook.",
        "27. Nd5 Bg5 28. Rg4 Re6 29. b3": "He begins to place his pawns on light squares as my LSB is out of action.",
        "29... Kg7 30. Rf5 Kh6 31. Nc7": "He blunders here. He touched and moved his knight and after moving stared at me and hoped that I didn't notice his blunder.",
        "31... Rxe4 32. Rxe4 Bxe4 33. Rf2": "Another blunder. I think he gave up here because before he made this move, he started to shake his head in disappointment.",
        "33... Be3": "White is lost here although he may try to salvage a draw.",
        "34. Kf1 Bxf2 35. Kxf2 Bxc2 36. Nxa6 Bb1 37. a3 Bc2 38. b4 Nf6 39. g3 Nd5 40. Nc7 Bd3 41. Ke1 Bc4 42. Kd2 Kg5 43. Ke1 Kg4 44. Kf2 Nc3 45. Ne8 d5 46. Nf6+ Kf5 47. Nh5 Kg4 48. Nf4 Nb1 49. Ng2 Nxa3": "White plays on to the lastmoment hoping for a draw. Here I just play around ",
        "50. Ne3+ Kh5 51. g4+ Kg5 52. Kf3 Nb1 53. Ng2 d4 54. Ne1 Nd2+ 55. Kg3 Nb1 56. Nf3+ Kh6 57. g5+ Kg6 58. Kg4 Nc3 59. Nh4+ Kg7 60. g6 Na2 61. Kg5 Nxb4 62. Nf5+ Kf8 63. g7+ Ke8": "I could've fallen into a hilarious mate after 63... Kg8 d3 64.Kg6 d2 Nh6#",
        "64. Nh6 d3 65. g8=Q+ Bxg8 66. Nxg8 d2 67. Kf4 d1=Q 68. Nf6+ Kf7 69. Nh5 Nd5+ 70. Ke4 Nf6+ 71. Nxf6 Kxf6 72. Kf4 b4 73. Kg3 b3 74. Kg2 b2 75. Kg3 b1=Q 76. Kf4 Qd5 77. Kg3 Qb4 78. Kf2 Qdb3 79. Ke2 Qb4c3 80. Kf2 Qcc2+ 81. Ke1 Ke5": "Here I mess around for a bit. I have about 3 minutes on the clock and my opponent has about 2.",
        "82. Kf1 Kf4 83. Ke1 Qe3+ 84. Kf1 Qee2+ 85. Kg1 Qef2+ 86. Kh1 Qfe2 87. Kg1 Kg3 88. Kh1": "I finish him off finally.",
        "88... Qe1#": ""
    },
    "url": "https://gameknot.com/annotation.pl/chess-game?gm=42299",
    "gameName": "Chess game",
    "players": "PLayer  vs. PLayer ",
    "opening": "Sicilian (B90), Najdorf, Lipnitzky attack"
}