{
    "moves": {
        "1. e4 e6 2. d4 b6": "Let´s try something new,,,",
        "3. e5 Bb7 4. Nc3 c5": "Sounds suspicious, but... for the sake of making some pressure",
        "5. Nf3 cxd4 6. Nxd4 Nc6": "(?) Maybe Bb4 was better , looking for a quick castling. Now Ndb5 creates a lot of pain in black´s defenses",
        "7. Nxc6 dxc6": "But now I have that problem resolved.",
        "8. Bf4": "Maybe ot the strongest position to play the bishop, but a safe move anyways",
        "8... Bb4 9. Bd2": "Black has gained a time here.  9.Bd3 seems more active",
        "9... Ne7 10. a3 Bxc3 11. Bxc3 Nd5": "Strong position for the Knight.",
        "12. Qg4": "...but creates a strong attack on the kings side",
        "12... Nxc3": "(!?) I found this move interesting, even after finishing the game. But it may have been a wrong one, since it seems white has compensation. At any rate, in a blitz game it is difficult to find the best defense. If 13,bxc3; O-O seems safe enough with a fair position for black.",
        "13. Qxg7 Rf8": "I was looking for a rook´s sacrifice, moving queen outside, but saw no compensation, no mate or attack for the rook.",
        "14. bxc3 Qd5": "With the idea of pressuring white´s castling and at the same time castling on the other side, with strong attack through g column.",
        "15. Bd3 O-O-O 16. O-O": "MAybe too early, considering incoming attack. I thought 16. c4 saved the day for white. 16.Bxh7 seems too risky, but it may also do the job.",
        "16... Rfg8 17. Bc4": "A mistake, but not easy to see",
        "17... Qxc4": "Black threats Qxf1+, gaining the bishop for free if white´s is not taken to a safe place.",
        "18. Qxf7 c5": "Bishop joins the attack. Black has the upper hand, can´t see a good defense for white.\n",
        "19. f3 Bd5": "I was running out of time here, and though to keep safe e6, seeing nothing better, but maybe I should have added both rooks to the g column. Anyways, didn´t see Qa7, I reckon it was a lucky move for next sacrifice. I felt I had just given white a small chance to counterattack on my king´s wing.",
        "20. Qxa7": "  But I saw a nice combination",
        "20... Rxg2+": "Beutiful. AS far as Bishop controls a8-h1, black seems safe enough and opening g column makes me look for a mate, which I didn´t see in sucha short period, but it seemed clear to me that white had no defense.",
        "21. Kxg2 Qe2+ 22. Kg3": "I considered 22.Rf2, then  Rg8+ will make a quick check mate. But Kh3 was more a pain, since rook does not go to g with a check. But as I said before, as far as I have the bishop controlling h1-a8, I can prepare the attack carefully. Therefore, 22.Kh3, Rg8 threatening Qg2+ and mate should suffice. In case of 23. Rg1, then is mate with ...Qxf3+ 24. Rg3, Qa5++",
        "22... Rg8+ 23. Kh3 Qg2+": "So, as a summary, not a great game (horrible opening), but an interesting and beautiful finish"
    },
    "url": "https://gameknot.com/annotation.pl/chess-game?gm=58459",
    "gameName": "Chess game",
    "players": "???  vs. kenderfender (1856)",
    "opening": "French defence (C00)"
}