{
    "moves": {
        "1. e4": "Manfred12g and I have played many games together. He is is used to me either going right into F4 (King's Gambit) or playing F4 after KnC3 (Vienna Game). Typically he accepts the gambit or does a \"counter-gambit\" (I guess) by moving pawn to D5. He threw me for a slight loop by playing...",
        "1... e5": "...",
        "2. f4": "...",
        "2... Qh4+": "this rather odd move, Q to H4#. I found this reply is not really as odd as it seems and is called the Keene's Defense. But I also have played enough games with manfred12g to know he checks fast and likes to bring his queen out really early. I had just lost two games in a row to him and hoped I would not lose three by getting into some odd, erratic game that he often fares better in if I am not careful.",
        "3. g3": "What else is there to do unless I relinquish my King of his castling privileges without a fight. ",
        "3... Qf6 4. fxe5": "I decide to follow the DB suggestions here for a while. The main thing here for me, and this line, is that I want to get that F file opened up. It creates weaknesses no doubt for white, especially from play between black's queen and black bishop, but that's just a risk I am willing to take for a little excitement now and then. ",
        "4... Qxe5 5. Nc3": "I feel I  know his style and know he will attack that Knight with his DS Bishop, and I will have doubled pawns. But I am not so afraid of doubled pawns anymore though I prefer to live without them. My other option was D3, but he would still 99.99% attack the knight and trade it off. I know this. Then I am still in a situation. If I pull out my bishop to block check he will take my B2 pawn with his Queen and things get too annoying too fast for me. ",
        "5... Bb4 6. Nf3": "This is still in the DB actually. It looks bad for white in some ways but I have played a lot of King's Gambit and/or Vienna Gambit games and this sit up is not all that alien to me. I usually fare better against manfred12g as white than black and yet I am a little queasy. ",
        "6... Qe7 7. Qe2": "To protect the pawn on E4 after the trade happens.",
        "7... Bxc3 8. bxc3": "I figure my D pawn to either D3 or D4 will not be that bad. Since the attack with the King's Gambit will occur from my Kingside I do not fret overly about my Queenside falling into tatters. My side looks all messed up (and I guess it is) but I have made four pawn moves so far and have one active piece on the board. His queen is guarding his king and not a good thing after I get castled and my rook can move to the E file, but I know he will castle as soon as he can  so do not even make plans around that.",
        "8... Nf6 9. d3": "Protect the E pawn. ",
        "9... O-O": "He castles and I will go ahead and prepare to castle Kingside. If a viewer now does not play the King's Gambit often the set up may look overly vulnerable (and there are problems for me) but the open F file with a willingness to take a risk and make sacrifices may help out later. Or it may not. ",
        "10. Bg2": "Not that I am trying to fianchetto to attack his rook later or anything. I am sort of forced into this awkward position by his line of attack in the beginning. Normally my bishop would be on C4 now, aiming at the F7 square, hoping for a break later. ",
        "10... h6": "I am not a high level player, and I am a terrible game analysist, but at the level I play I see this move so often and am not sure I consider it a good move. It is meant to stop my knight from going to G5, but without my bishop on C4 that is a weak line of attack for me right now. It also weakens his castled position way too soon in the game. By my being willing, as would many players, to sacrifice my DS bishop his castled king would become totally exposed. I think better to let the pawn sit unless the knight encroaches, then chase him off. It is a necessary move at times, but here I think moving  the G7 pawn becomes the objective for white now. ",
        "11. O-O": "Want my Rook on the semi-open F file now. (I think that is what you cal it now, semi-open. Correct me please if I am wrong.)",
        "11... Qc5+": "Here manfred12g cannot resist the check and capture of the doubled pawn. In fact I think it is better to leave the other guy's pawns doubled up. A move or two ago I was fretting over the doubled pawns and now my opponent helps me out of the bind, at the cost of one point in material. But gambits are all about loss of material and a bit of reckless hope. ",
        "12. Be3 Qxc3": "I know I cannot wait for manfred12g to sort things out. He has moved his Queen just too many times and has let seven piece remain untouched, but that will not last long. But he traded off (unwisely in the King's Gambit) a piece he really needed in my view as white, and that was his DS bishop. ",
        "13. Bd4": "I assume he will move to C6. ",
        "13... Qa5": "But he goes here instead. Earlier my plan was to trade of my DS bishop for his H6 pawn, but this makes it a little easier for me. An equal trade and he has to move that G7 pawn anyway. ",
        "14. Bxf6 gxf6": "Like that. ",
        "15. Nh4": "I want my queen on G4 of course. He knows this I assume and so...",
        "15... d6": "does the most sensible thing. But this is why he should have moved his queen to C6 and it was a bit of luck on my part he did not...",
        "16. Rxf6": "My queen now wants to get to H5. ",
        "16... Qc3": "Not a bad idea but he is trying to win the whole game with his queen alone. It is getting too late for that. ",
        "17. Raf1": "Although I am not sure how, I get the sense that this move seals the deal. ",
        "17... Nd7": "I am not sure what all he could do now. He attacks my Rook, okay, but in the process blocks his white bishop's line on G4. ",
        "18. Qg4+": "I predicted he wuld go to H7 and had sit up some conditionals, but he surprised me by...",
        "18... Kh8": "moving to H8 and thereby... ",
        "19. Rxh6#": "giving away the game. Maybe on purpose. manfred12g has a rather aggressive and \"in your face\" style that often does me in if I am hasty or not paying attention. But here he tried to have his queen carry the whole game and it was a bit too much for her. Had he developed a few more pieces and not been so hasty with wanting to check me early on with no clear follow up things may have turned out differently. "
    },
    "url": "https://gameknot.com/annotation.pl/chess-with-bill-keenes-defense-turns-bad-for-black?gm=53021",
    "gameName": "Chess with Bill - (Keene's Defense turns bad for Black)",
    "players": "billdancourtney (1368) vs. manfred12g (1233)",
    "opening": "KGD (C30), Keene's defence"
}