{
    "moves": {
        "1. Nf3": "White plays the Reti Opening, which is not an opening I usually see. ",
        "1... d5": "I respond with d5. My usual response to most opening moves back at that time was e5, but with the knight positioned where it is, that would of lost me a pawn, so d5 was my preferred alternative. This as well continued the Reti Opening. ",
        "2. c4": "The Reti continues.",
        "2... dxc4": "This is called the Reti Accepted. Generally if I see an opportunity gain a free pawn, I take it. ",
        "3. e3": "Obviously white likes the Reti, as he continues with the Reti Accepted.  ",
        "3... b5": "I knew hardly anything about other opening moves, so I end the Reti with b5. This is viewed by the computer analysis as an inaccuracy. True, for if white plays a4 the next move, black can defend but white gains a slight advantage. ",
        "4. b3": "White does not play a4, which of course is an inaccuracy by the computer analysis.  ",
        "4... cxb3": "I figure it is best to take. ",
        "5. Bxb5+": "Well I did not see that coming, but this is easy to counter.",
        "5... c6": "This is a good move, for now white must save their bishop instead of attack the b3 pawn, so black can still have a small material advantage. ",
        "6. Bc4 bxa2": "I take as I hoped, but of course that pawn is lost.",
        "7. Nc3": "? I was a bit puzzled by this move. White could of easily played Bxa2 or Rxa2, but instead chose to save their knight. True the pawn is still lost and although the computer analysis says nothing about this, in my view, they might as well got it over with now.",
        "7... e6 8. Rxa2": "Now white plays Rxa2. It's pretty obvious that white will castle king-side. ",
        "8... Nf6 9. O-O": "Yep, I was correct, a king-side castle. ",
        "9... Bb4": "I hope to trade the knight and bishop. ",
        "10. Qb3 Bxc3": "I take the knight as I planned, and of course white will take the bishop, but the computer analysis views this as a inaccuracy. I can not really see the reason why, but since it's only an inaccuracy, it would not give black a bad disadvantage. The best move was a5. True, for then both the pawn and the bishop would of protected each other, and white would not attack with one of their powerful pieces. ",
        "11. Qxc3": "That was the expected move.",
        "11... O-O": "I now castle. Get ready though, this game is about to become blunderful! ",
        "12. Ng5": "This would be the first of many mistakes and blunders. Ng5 was viewed as a mistake by the computer analysis. This is so because if this sequence followed: 12. ... Nd5 13. Bxd5 cxd5 14. Nf3 ... Black would gain a advantage ever so slightly, not in material, but in position, but not much. The best move for white here was Qa5, an attack on black's queen that likely would of ended up being a queens exchange. ",
        "12... h6": "Black would not play Nd5 but instead h6 to drive away the knight. This is viewed by the computer analysis as an inaccuracy. Although as stated earlier, Nd5 was the best move, this move doesn't really give black a disadvantage, but it doesn't give black an advantage either, for white will of course protect their knight.",
        "13. Ba3": "I was not expecting this move. What I didn't see though was the mistake white had made. Based on the computer analysis, if this sequence is played: 13. ... hxg5 14. Bxf8 Qxf8, black would gain an advantage in material by +1. Although black's rook would be lost, both white's bishop and knight would be lost, and those pieces are worth more together than 1 rook. The best move here was Nf3, to just simply protect the knight. Unfortunately for black, when it came to having their powerful pieces attacked...",
        "13... Re8": "...he did not want them taken. I did not see the advantage I could gain mainly because I didn't like having my rooks taken, unless it was a fair exchange, but that was not the case here, so I played this move. Of course this was a mistake and hxg5 was the best move.",
        "14. Nxf7": "??? This is a puzzling move. White takes the f7 pawn, but there are no other white pieces on that square, so now the knight is lost and black gains a big advantage. Of course computer analysis views this as a mistake. The best move was again Nf3, protecting the knight.",
        "14... Kxf7": "I can only take with my king, so if white wanted me to bring out my king some, then it worked, but black still has a good advantage.",
        "15. Bd3 Ba6": "I'm hoping to exchange bishops here.",
        "16. Bc4": "Interesting move. This doesn't give white any advantage and the computer analysis views this as a mistake. I view it more as an inaccuracy because black really doesn't gain any big advantage. The best move was Bxa6, which is pretty obvious. ",
        "16... Ne4": "Although Bxc4 was probably the best move, I see an opportunity to attack white's queen, so I take it. ",
        "17. Qd4": "This was a bad move, a blunder from the computer analysis. This sequence shows why: 17. ... Qxd4 18. exd4 Bxc4 19. d3 Bxa2 20. dxe4. This sequence would of left black with a massive advantage, for although there would of been a fair queens exchange, then black's bishop could of not only taken white's c4 bishop, but also that bishop would of been lined up on both of white's rooks, and since white would have no way of taking the bishop, one of those rooks were lost. If white played d3, then after black took the a2 rook white could take the e4 knight, but it would of left black with a +8 advantage. The best move for white would of been Qc2, which is true for that move would of protected white's queen and attacked black's knight as well.",
        "17... Bxc4": "Alas, I completely overlooked that fantastic opportunity and took white's c4 bishop and gave him the option to attack either my knight or my bishop. Of course my bishop because it was attacking both of white's rooks. Of course this was a blunder because I missed this great opportunity. I think you all know what the best moves were.  ",
        "18. Qxc4": "As expected, the bishop goes. ",
        "18... Nxd2": "Now black is falling apart. This seems like a good move, but it's actually a blunder. True, since black's queen is protecting the knight, this move should lose white a rook, but white would easily counter. The best move was Qd5. This would begin black's downfall. ",
        "19. Qf4+": "White counters by putting black in check. Black will have to protect his king and white would then be able to save their rook. ",
        "19... Kg8 20. Rd1": "Now black can't move his knight without losing his queen. ",
        "20... Nd7": "I decide that the knight is lost and thus I use my other knight to protect my queen. This is actually a mistake from the computer analysis, but there was not much better to do. Even the best move, Qd3, still would of left black with a disadvantage. ",
        "21. Rdxd2": "The d2 knight goes as expected, but computer analysis views Rdxd2 as a mistake and that Raxd2 was the best move. This is true because with Raxd2, white has a lined up on a attack for black's queen, unlike with the move you now see. So white gains an advantage with Raxd2 in regards to position, but even though that was not the move made, white is still gaining back the advantage. ",
        "21... g5": "I decide to attack white's queen with this move, but this is a blunder. It doesn't really seem like it though, but if white plays Qe4, they get in a dangerous position for black that could lose black their queen. It can even risk checkmate, partially because of black's bishop. Computer analysis predicts the following sequence because of this: 22. Qe4 Re7 23. Bxe7 Qxe7. I would of never seen it and would of lost it big time, but fortunately for black, white would not play Qe4, but it would still get worse for black. ",
        "22. Qg4": "White plays Qg4. This is viewed as a blunder by the computer analysis and as discussed already, Qe4 was the best move. Black is still in a bit of a precarious position.",
        "22... Rb8": "Well, with my options getting limited, I decide to see if I can line up for any attack. I still have a +1 material advantage, so all hope is not lost. This move though would be yet another mistake. Again it is because of that dangerous attack if white plays Qe4, but of course, I did not see that still.",
        "23. Ra1": "Yet again a mistake from the computer analysis and Qe4 was the best moved. To be honest this is getting old.",
        "23... Qa5": "Well I wanted to make something happen, so I decide to attack the d2 rook that was now no longer protected by the other rook. Yet, I completely overlooked a big blunder, that by moving my queen, the d7 knight was completely unprotected by the d2 rook. The best move was Qf6, which would of stopped the attack if white moved his queen to Qe4. ",
        "24. Rxd7": "White sees the opportunity and now has the advantage. ",
        "24... Red8": "Well truth be told I was getting better at chess, but I'm better today than I was then. Even though this game was only 2 months ago, as of when I annotated this game, I played like 50 simultaneous games. It's lower today and I focus more on my moves, unlike this game where I made yet another blunder. Qf5 was the best move, and I don't think I need to explain why, again. This was a bigger blunder though because if white plays Qxe6+, this becomes a automatic mate in 3 for white.",
        "25. Re7": "I do not see the full point of this move, unless he wants to make sure that the e6 pawn is his. Of course, Qxe6+ was the best move and this was a blunder.",
        "25... Qb6": "I continued to completely overlook the risk of checkmate because I saw checkmate myself. My hope was to attack on b1, for the king could not escape if my attack was successful. There would be no way for white to avoid checkmate, but I think we all know why this was yet another blunder, but this time... ",
        "26. Qxe6+": "...white saw the opportunity that was available. I looked hard for a counter, but all I saw was checkmate...",
        "26... Kf8": "...so with no way out, I decided to give it to him.",
        "27. Qf7#": "Checkmate. the1trueseeker is better than his rating. In fact, if you look him up, his rating is now around mine, not 1039. I think he's a pretty good player. Both this game and game 1 were pretty good. I hope you enjoyed this annotation. Feel free to comment and rate it. I'll have more great annotations in the near future."
    },
    "url": "https://gameknot.com/annotation.pl/chess-coaches-and-mentors-game-2-against-the1trueseeker?gm=55332",
    "gameName": "Chess Coaches and Mentors (Game 2 against the1trueseeker)",
    "players": "the1trueseeker (1039) vs. joveyboy1 (1124)",
    "opening": "Reti accepted (A09), Keres variation"
}