{
    "moves": {
        "1. d4 d5 2. c4": "I always start with the queen's gambit in blitz games.",
        "2... dxc4": "He accepts it, usually it's declined",
        "3. e3 Bf5 4. Bxc4": "I win back my pawn and have a strong center",
        "4... e6 5. Nf3 a6": "Seems like a wasted move",
        "6. Nc3 Nc6 7. a4": "I was a little worried about a b pawn push.",
        "7... Bb4": "Unfortunately, now I can't poke his bishop away.",
        "8. Qb3 Qc8 9. Bd2": "Breaking the pin and completing minor piece development.",
        "9... a5 10. O-O-O": "I decided to castle queenside because all my pieces are pointed kingside. ",
        "10... Nf6 11. h3": "Preparing a pawn storm",
        "11... O-O 12. g4 Bxc3 13. bxc3": "I prefer to capture with pawns when it brings it closer to the center. Unfortunately, however my DSB is the worst of bad bishops.",
        "13... Be4 14. Be2": "I reinforce my knight",
        "14... Nd5": "He starts to shift his pieces over to queenside.",
        "15. h4 b6 16. Rh3": "I decide to get my knight out of the pin",
        "16... Rb8": "I think he's preparing for a attack queenside, however it never occurs.",
        "17. Rg1 Nce7": "Maybe getting ready to defend?",
        "18. g5 g6 19. h5": "My pawn storm starts to gather momentum",
        "19... Kg7 20. Ne5": "Adding another attacker to the g pawn.",
        "20... f6": "Hmm, any thoughts on this move?",
        "21. gxf6+ Nxf6 22. hxg6 Nxg6 23. Nxg6 Bxg6": "And his bishop is pinned I wonder if I can make use of that.",
        "24. Bd3 Kf7": "The king hops out of the pin",
        "25. Bxg6+ hxg6": "And I finally get my open file to his king",
        "26. Qc2 Rg8 27. Rh6": "That g pawn is what kept me from winning this game.",
        "27... g5 28. e4 g4 29. e5 Nd5 30. Qh7+ Kf8": "The attack is going full on now",
        "31. f3": "I try in vain to get rid of that pawn",
        "31... g3 32. Be1 g2": "And now my rook is completely immobilized :(",
        "33. Bh4": "I bring my DSB into the attack",
        "33... Qe8 34. c4": "That knight was driving my crazy, if he moves it then Rf6# is mate",
        "34... Qf7": "RRRRRRGH if the knight wasn't there I could pin his queen to his king.",
        "35. cxd5": "I couldn't see anything better",
        "35... Qxh7 36. Rxh7 exd5": "Now I'm up by two points, but it's by no means over. That passer of blacks isn't going away any time soon",
        "37. Be7+ Ke8 38. Kd2": "I harbor vague ideas about getting rid of the g pawn",
        "38... c6 39. Ke2": "???? loses the bishop",
        "39... Rb7": "I looked for some time, but I couldn't find a way of getting out of it.",
        "40. Kf2 Rxe7 41. Rxe7+ Kxe7 42. Rxg2": "At least I get rid of that pawn.",
        "42... Rxg2+ 43. Kxg2": "It becomes a king and pawn game",
        "43... Ke6 44. f4 Kf5": "If he kills my f pawn, my e pawn marches on to glory",
        "45. Kf3 b5 46. axb5 cxb5": "Uh-oh, he has two connected passers",
        "47. Ke2 b4 48. Kd2": "I move my king over, but I don't think he can stop them.",
        "48... a4 49. Kc2 Ke6": "Too bad he didn't take my f pawn.",
        "50. Kb2 Kf5": "At this point I think the game is a draw. Neither side can force a pawn to promotion ",
        "51. Ka2 Ke6 52. Kb2 Kf5 53. Ka2 Ke6 54. Kb2 Kf5": "And I declare a draw by three fold repetition. Please drop a comment and rate on the star system."
    },
    "url": "https://gameknot.com/annotation.pl/chess-game?gm=50619",
    "gameName": "Chess game",
    "players": "porcho (1154) vs. pxqmate (1200)",
    "opening": "Queen's gambit accepted (D20)"
}