{
    "moves": {
        "1. d4": "This what yet another loss to this talented youngster, still only 17 years old.",
        "1... f5": "He plays the Dutch Defence as last time. https://en.wikipedia.org/wiki/Dutch_Defence",
        "2. Nc3": "I play a slightly different move order to our previous game. http://gameknot.com/annotation.pl/malpas-oswestry-1-v-chester-1?gm=64183",
        "2... Nf6": "He prevents e2-e4 - for now.",
        "3. g3": "I fianchetto again. I think around here I noticed that the board was the wrong way round(with h8 on my left hand sife, not a1) and I insisted it was set up right, so we had a little break while we set it up again.",
        "3... g6": "He plays the king-side fianchetto too.",
        "4. Bg2": "I complete it.",
        "4... Bg7": "So does he.",
        "5. e4": "We have now transposed into the previous game. We were both blitzing out our moves at high speed.",
        "5... fxe4": "He takes.",
        "6. Nxe4": "I take back.",
        "6... Nxe4": "He takes again.",
        "7. Bxe4": "I take again.",
        "7... d5": "He attacks my bishop as before.",
        "8. Bg2": "8. Bg2 is the only move in the opening databases I use. On f3 the bishop blocks the f2 pawn and could be vulnerable to attacks by the rook down the f file. For instance 8. Bf3? 0-0 and how is white going to complete the development of the king-side?",
        "8... Nc6": "And now he breaks with the previous game. I had to start to think. I have to deal with the threat to my d pawn.",
        "9. c3": "This is the most commonly played move for white here.",
        "9... e5": "Excellent move by black, it prevents his e pawn remaining backward on the semi-open file, like he mistakenly did in our last game. He played the move quickly, from memory.\n",
        "10. dxe5": "After a think I took.",
        "10... Nxe5": "And he took back instantly. Don't you just hate it when your opponent is better prepared than you? Now I had a long think. Do I take on d5 or not? If so what do I take with? Later I found this gameknot game where white took with the queen and lost quickly. http://gameknot.com/analyze-board.pl?bd=17990219&mv=17&rnd=0.5109989752169874 and the Gameknot computer gives 11. Qxd5 as a mistake. However there is also this game where white managed to play 11. Qxd5 and win http://gameknot.com/analyze-board.pl?bd=x685463&mv=21&rnd=0.5267607547382092 In the databases white normally did what I did, and play another move.\n",
        "11. f4": "After the game Danny told me that he thought this was the best move for white. He once again played his next move very quickly, and I sunk into thought again.",
        "11... Bg4": "What now? Eventually I moved and it was not what he had expected.....",
        "12. Qa4+": "It was this! I half expected the game to end in a quick draw now! 12....Bd7 13. Qd1 Bg4 14. Qa4+ etc. After the game Danny thought this wasn't very good, but I see now that it has been played before. White lost quickly in Bopp Thomas (2187) vs. Renner Christoph (2448) after 12.\tQa4+\tb5\n13.\tQxb5+\tc6\n14.\tQb7\tO-O\n15.\tfxe5\tQe8\n16.\tBxd5+\tcxd5\n17.\tQxd5+\tBe6\n18.\tQa5\tQc6",
        "12... Qd7": "But Danny played this, which perhaps lets me off the hook. As well as 12.....b5!? Fritz likes 12....Nc6, another move I was thinking he may play.",
        "13. Qxd7+": "I take.",
        "13... Nxd7": "He has to take this way, otherwise he just loses the knight. Now the question is - take the pawn or not take the pawn.",
        "14. Bxd5": "At the time I thought \"well queens are off the board now, it is going to be hard to whip up a winning attack with the queens off\" - but I was wrong! Fritz suggests 14. Be3 with slight edge to white.",
        "14... O-O-O": "Fritz likes this move. ",
        "15. Be3": "Fritz prefers 15. Bf3",
        "15... Rhe8": "Fritz likes this move too.",
        "16. Kf2": "Virtually forced, in order the save the bishop.",
        "16... Nf6": "I like this move, I think it is good, and it lays a trap into which I fall. Fritz thinks Nc5 is better. Ok so where should white retreat the bishop to?",
        "17. Bf3": "This seemed to be a mistake, but afterwards we played some variations, and white does have a tough position to play, so I am not 100% sure there is anything better. OK what did Danny play now?",
        "17... Bxf3": "Is that what you would have done?",
        "18. Kxf3": "If I had taken back with the knight he has Nf6-g4+ winning a piece.",
        "18... Rd3": "But now he has a winning pin. Only one way to defend the bishop....",
        "19. Re1": "Like so.",
        "19... Nd5": "And now I can't protect it again and it is lost. I played it out, but move-by-move account is no longer necessary.",
        "20. Nh3 Nxe3 21. Ke2 Rd7 22. Kf3 Rde7 23. Re2 Nc4 24. Rf2 Re7e3+ 25. Kg2 Re3e2 26. Rb1 h6 27. Ng1 Re2e1 28. Rxe1 Rxe1 29. Nf3 Re7 30. Nh4 Re6 31. b3 Ne3+ 32. Kf3 Nf5 33. Nxf5 gxf5 34. c4 Bd4 35. Rd2 c5 36. b4 b6 37. bxc5 bxc5 38. h3 h5 39. Rc2 Kc7": "And I finally resigned. Many thanks for reading, hope you would it entertaining and educational! Please leave a comment or two and rate the annotation on the star system, to let me know how I am doing. Until next time dear reader!"
    },
    "url": "https://gameknot.com/annotation.pl/chester-d-v-malpas-oswestry-1?gm=64256",
    "gameName": "Chester D v Malpas & Oswestry 1",
    "players": "Charles L Higgie (ECF180) vs. Danny Savidge (ECF181)",
    "opening": "Dutch, Spielmann gambit (A80)"
}