{
    "moves": {
        "1. e4": "hi all its nice Blitz game I've played it discuss the bishop bin to queen the 2 pieaces sac for a rook and the h6 as preventive for bishop pin",
        "1... e5 2. Nf3 Nc6 3. Bb5": "spanish opening",
        "3... d6 4. Nc3 Bd7": "the pin is neutralized",
        "5. d3 a6 6. Ba4 h6": "the h6 as preventive for bg5 which is not very good as it weaken the king side as u'll see ",
        "7. O-O": "king is safe",
        "7... Nf6 8. Re1": "to protect the e pawn",
        "8... b5 9. Bb3": "bishop in the place to control a2-g8 and prepared to b1-h6 which is powerful attack to the king side",
        "9... Bg4": "starting to pin the knight",
        "10. h3": "the usual",
        "10... Bh5 11. g4": "this move is depatable as it drive the the bishop away making it a negative bishop in g6 but also it weaken the king side greatly with the right sac I lost many game because of this move",
        "11... Nxg4": "here a sac  a knight for 2 pawns protecting the king",
        "12. hxg4 Bxg4": "the pin is still there and the bishop is active",
        "13. Re3": "lucky to have my rook in e1 it protect the knight so i can move the queen",
        "13... Nd4": "double attack i need to protect with 2 piece and to liberate the queen the brave king do it",
        "14. Kg2 Be7": "prepare to castle",
        "15. Qh1": "the queen finally liberated to protect the weak king side",
        "15... Nxf3": "here another trade bishop and a knight for a rook and a knight\r\nactually he had were very strong pieces an the rook and  the knight was vulnerable whose winning?\r\n",
        "16. Rxf3 Bxf3+ 17. Kxf3 O-O": "is it good to castle now or better to attack with pawns?\r\n",
        "18. Ke2": "trying to get out of the wind",
        "18... Bg5": "trading the bishops activate the black queen and the wight rook",
        "19. Bxg5 Qxg5 20. Rg1 Qf4": "the kingside now is owned bu the wight  queen and rook",
        "21. Nd1": "aiming for d5 through e3",
        "21... c5": "attacking the queen side the only option",
        "22. c3": "prepare to position the LSB on the important fileand protect the center",
        "22... a5 23. Bc2 b4 24. Ne3": "by allowing this moveblack lost the h6 pawn the weak protected only by the queen due to the pin in g7",
        "24... bxc3 25. bxc3": "doesn't change a thing",
        "25... Qf6": "???\r\n",
        "26. Nd5": "attackin the queen and the imp.squares e7-f6-f4",
        "26... Qd8": "the only scape",
        "27. Qxh6": "h6 is taken threat of mate",
        "27... g6": "a trial to prevent it",
        "28. Rh1": "no escape black resigned"
    },
    "url": "https://gameknot.com/annotation.pl/chess-game?gm=46430",
    "gameName": "Chess game",
    "players": "???  vs. ??? ",
    "opening": "Ruy Lopez (C62), old Steinitz defence"
}