{
    "moves": {
        "1. e4": "Lately playing really bad games. Losing a lot. Playing rushed and not concentrating, letting some aggressive players undo me. Manfred12g is a regular player and I am bit used to his style. Real aggressive and wants to trade piece for piece real fast. Usually trying to make queen exchanges right of the bat. \n\nLately I am trying new lines as well and I am falling prey to his straight ahead style playing though I should be doing a little better. Why?\n\nE4.",
        "1... c5": "Sicilian, and as is typical he answers with...",
        "2. d4": "d4. ",
        "2... cxd4": "I take the pawn and he will come in with his queen and take my pawn...",
        "3. Qxd4": "like this. Usually I would do knight to c6, but I try something else I had seen.",
        "3... Nf6": "King  knight to f6. I anticipate, as is his style, he will move his pawn to e5.",
        "4. e5": "He does. ",
        "4... Nc6": "I move my other knight out and threaten his queen and his moves her to",
        "5. Qc3": "... c3. Already I can see he is going to be chasing me around, but I brace myself for it. See what I can do and hope he slips up.",
        "5... Nd5": "I respond with my knight and pressure his queen, which he moves to ",
        "6. Qd2": "...d2. Logically figure I will guard my king with my king pawn...",
        "6... e6": "All seems okay for now. Nothing glaringly dangerous as far as I can see. ",
        "7. f4": "Suddenly he is down with this pawn. All he is really doing is moving his queen around, but I am getting frustrated. I want that pawn off of e5. But why? Why suddenly do I let the set up get out of hand. Why not move my bishop out to castle, instead I....",
        "7... f5": "push this pawn up and hope he will en passant, which he does...",
        "8. exf6 e.p.": "here, and then I....",
        "8... Qxf6": "take back the material with my queen. ",
        "9. Bc4": "I do not know why this is all bothering me so much. He has the upper hand but the game is even. I cannot take the pawn on f7. If I let him take my knight I get his bishop but lose my pawn. I feel he will be setting up a queen trade attack in a move or two. ",
        "9... Nb6": "Pressure his bishop. ",
        "10. Bb5": "Here I feel I make a big mistake. Maybe before really, but here I can just take the trade. My pawn would take him and be covered. I would be in a good position, but I....",
        "10... Nd4": "try to save the knight. At this point I am frustrated and trying to prevent him from trading pieces. But I get myself more tied up. I am not developing anything. He is not either I feel, but he is still in charge and there is no reason for it, had I just relaxed and thought it out and let the exchange happen. ",
        "11. Bd3": "Here he just moves his bishop. Not a good move but so what. I am not focusing. I move the a6 pawn to keep him away. ",
        "11... a6": "But then he begins to set up his queen trade attack. ",
        "12. Qe3": "Here I just get stupid. I needed to think this position out and I felt I tried. I knew my knight on b6 was not covered, but felt I could manage it. I wanted to move that knight to d6 and yet I knew almost with certainty that he would push his queen down to e5, forcing an exchange. And that too would have been better than what I try to do. ",
        "12... Bd6": "Keeps him off e5 I guess. ",
        "13. c3": "But then there is this totally simple move. I had got myself into this mess and now there is no way out. But I even totally forget about the knight on c6 now. My mind is way off. ",
        "13... Nf5": "I attack his queen and he, of course...",
        "14. Qxb6": "takes the unguarded knight. Totally stupid game. Just one of many lately. As is usual in this sort of situation I just resign since in the long run winning or losing is not the objective anymore. I played a stupid game. I rushed through moves. Out of 14 moves 5 of those were knight moves. I avoided trades that would either helped me or left the game equal. Utterly crappy playing. Much of this is a matter of psychology, or of me playing when I am tired and not focused. No need to rush moves. I have 5 days and yet and spending one minute or less. Not just in this game or with this player. All my games really. Need to change something. But then again, in the end... just another game. "
    },
    "url": "https://gameknot.com/annotation.pl/chess-with-bill?gm=45221",
    "gameName": "Chess with Bill",
    "players": "manfred12g (1363) vs. billdancourtney (1282)",
    "opening": "Sicilian (B21), Andreaschek gambit"
}