{
    "moves": {
        "1. d4": "more experimentation of the d4 opening. ",
        "1... e6": "this is one of the first times ive seen e6 as a response. there's probably some\r\ndevious methodology to it. ",
        "2. e3": "by this point you've pretty much got this opening memorized, if you've followed these games (i don't know why you would) please tell me where i made mistakes, because i need some help with this kind of game",
        "2... c5": "this is extremely unorthadox, but note the f8 bishop. ",
        "3. c4": "I'm not gonna let this throw off my opening. I should mention this was game 3 with 5 second delay, it will explain some mistakes. ",
        "3... cxd4": "? this is new... I should what?",
        "4. exd4": "this is justified next move, I know these two pawns are extremely over extended, but thats a risk im willing to take at this point. ",
        "4... e5 5. d5": "if you EVER want to tick someone off: push the pawn when they offer a trade. this also provided protectioin against Nc6 and helps really later on.",
        "5... Bb4+": "if you play this opening, you see this move 9 games out of 10, I'm not joking, it actually plays into the actual opening, but as you can see, I'm in mid game",
        "6. Bd2": "this is actually a trigger response",
        "6... Bxd2+ 7. Nxd2": "that knight is actually defending c4, allowing you to move/fiancetto that bishop on f1. note how the rook could easily take control of the c file right now. ",
        "7... Nf6 8. Ngf3": "locked knights attacking a pawn. lovely",
        "8... d6": "the only response. or is it? i would have pushed to e4",
        "9. c5": "i want that free pawn. but it has to be free or I don't risk the knight.",
        "9... Nbd7": "? mistake?",
        "10. cxd6": "pawn trade? ok. my knights are ready to counter.",
        "10... Nxd5 11. Nc4": "note the simple beauty of this move: i now have two knights on e5 and a discovered attack on Nd5. ",
        "11... e4": "this was the only possible way out for black. well, it saved a pawn. ",
        "12. Nfe5": "knights are locked again. ",
        "12... Nxe5 13. Nxe5 Qa5+": "this game would've completely differently if Qxd6",
        "14. Ke2": "i liked the queen where it was: alive and on the board. ",
        "14... Nf4+ 15. Ke3 Qxe5": "my opening tends to lose minors early on, doesn't it. oh well, I always seem to come back at the end. it's like watching the bears in reverse. ",
        "16. Rc1": "can you see what I'm doing? / I love black's cooperation the next couple of moves",
        "16... O-O 17. d7": "what was rule number one of annoying people again? push the pawn.",
        "17... Rd8": "mis. take. ",
        "18. dxc8=R Raxc8": "note he couldn't take my queen because of check. this is just poetic. ",
        "19. Rxc8 Rxc8 20. Qd7 Qc5+": "mis.take.num.ber.2.",
        "21. Kxf4 g5+": "gosh, this guy loves kamikaze pieces",
        "22. Kxe4 Qc2+ 23. Bd3 Rc4+": "this was not a mistake. I like this move on black's part. I didn't like it then, but i give props to black on this one. ",
        "24. Ke3 Qxb2 25. Qe8+ Kg7 26. Rb1": "don't you love it when black plays along?",
        "26... Qxa2": "i do. ",
        "27. Rxb7 Qa3": "can you see mate in 2?",
        "28. Qxf7+": "not including rolling barrel, that doesn't count. if you can't spot rolling barrel, you shouldn't be able to analyze annotated games.",
        "28... Kh6": "if you've found it. congrats, it took me about 10 seconds to double check. (note i don't take rook, well, because of mate)",
        "29. Qxh7#": "game one, once again, by white. this opening has obvious counters that have clever responses on white's half. it's also the best way to get your opponent to scratch their head since 'pribyl'"
    },
    "url": "https://gameknot.com/annotation.pl/chess-game?gm=35080",
    "gameName": "Chess game",
    "players": "???  vs. ??? ",
    "opening": "Queen's pawn (A40)"
}