{
    "moves": {
        "1. e4": "Black mercilessly crushes white for most of the game, and perishes after one incredibly sloppy move.",
        "1... e5 2. Nf3 Nc6 3. Bc4": "Almost a Ruey Lopez, close enough for me.",
        "3... Bc5 4. d3 h6 5. Nc3 Nf6 6. Be3": "He's making me nervous. No easy opening.",
        "6... Qe7 7. Nd5": "Chasing my lady early.",
        "7... Qd6 8. a3 Ng4 9. Bxc5 Qxc5 10. Qe2": "I left my e5 p unguarded momentarily. Had he gone h3 here it would have been his. I step in and fix the error, and white goes h3 too late.",
        "10... Qd6 11. h3": "See? We stay even.",
        "11... Nf6 12. Nh4 Nd4 13. Qd2 c6 14. Nf5": "Bad move for white. S'pose he didn't notice the knight on d5. Trade will end in my favor. And my lady will have the breathing room, she's lacked so far.",
        "14... Nxf5 15. exf5 cxd5 16. Bb3 Qb6 17. O-O d6 18. c3": "Oops. Unguarded b3 bishop.",
        "18... Qxb3 19. d4": "And I push further ahead. Cho is slob and a shlub.",
        "19... Ne4 20. Qe2 Bxf5 21. a4 Qc4 22. Qh5 Bg6 23. Qg4 h5 24. Qd1 Qb3": "I am up 7 points, and here is where I die. One sloppy move and the game is done.",
        "25. Qxb3": "Ouch. I am reeling to recover. Can't protect b7 and d5 at once.",
        "25... O-O 26. Qxd5": "Now I can't protect e5 and b7 at once.",
        "26... b6 27. dxe5 Rfd8 28. e6 f6 29. e7+": "Nasty fork for white! Well done!",
        "29... Bf7 30. Qxe4 Rde8 31. Rad1 d5 32. Rxd5": "White accepts a small sacrifice in the name of progress.",
        "32... Bxd5 33. Qxd5+ Kh7 34. Re1 Rac8 35. Qxh5+ Kg8 36. Qg6 Kh8 37. h4 a5 38. h5": "Rooks are trapped in the 8 row. Game's over. Case you hadn't noticed. I have perhaps too low an opinion of Cho, and try my hand at losing some pawns in the hopes of an eventual draw. But he's not that terrible a player. And who am I to talk since I'm losing to him?",
        "38... b5 39. h6 bxa4 40. Qxg7#": "The end. I challenge Cho to a rematch, knowing that I can beat him in game 2. He seems hesitant to accept. I don't blame him. I would kick his ass til there was noffin' left!"
    },
    "url": "https://gameknot.com/annotation.pl/cho-knows-how-to-get-lucky?gm=21955",
    "gameName": "Cho Knows How...to Get LUCKY!!!",
    "players": "choknowsall (1147) vs. hercules_isadore (1248)",
    "opening": "Giuoco Pianissimo (C50)"
}