{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Bb5 a6 4. Ba4 Nf6 5. O-O": "White just did not care about the pawn in e4. In that instance 5...Ne4 6.Re1 d5 7.d3 Nc5 white has to decide his bishop's place. 8.Bb3 d6 will make Black a pawn up. Other option, which is considerable, will lead 8.Bxc6 dxc6 9.Ne5 Be6 will be also better for black.",
        "5... b5 6. Bb3 Bc5 7. a4 Bb7 8. d3 d6 9. Nc3 b4 10. Nd5": "As I think, 10.Ne2 would be much better. It could be followed by 11.Ng3 which will create it more space and as a defense wall to the castled king. ",
        "10... Na5 11. Nxf6+": "He had understood that 'something is better than nothing'. What else will it do while on d5?",
        "11... Qxf6 12. Ba2 Bc8": "Good idea to obtain the bishop's work on the king side rather than creating pressure on a single pawn. It is an obvious advantage when compared with the bishop on a2.",
        "13. Ng5": "His main intention must be to capture f7, or alternatively to 14.Qf3, which seems no bad.",
        "13... O-O": "King into safety as well as f7 pawn. 13...Be6 also an aggressive response,'It moves for the very first time'.",
        "14. Qh5": "Attacks over attacks!!! This time for a mate!",
        "14... h6 15. Nf3 Be6": "Following with 16...b3 will make a lot of black pieces quite active.",
        "16. Bd5": "16.b3 will create a locked bishop restricted to b2 and a1. 16.Bb1 also creates almost the same result.",
        "16... Bxd5 17. exd5 c6": "Two good targets in one move. He simply hopes to swap a white center pawn and to make the knight more active.",
        "18. Bd2": "Taking the pawn would be much better. If he tried to defend the pawn, nothing happens with, 18.c4 bxc3 19. bxc3 cxd4 which is brilliant to black.",
        "18... cxd5 19. d4 exd4 20. b3": "20.Qxd5 would be obviously good. First, it takes a pawn. Secondly, it makes the queen's area slightly wider. Thirdly, it'll block all the available places of Na5.",
        "20... d3 21. Qxd5": "Too late!!! The black d4 pawn is finishing his work!",
        "21... dxc2 22. Rae1": "How about 22.Ra2 which will make the game more neutral?",
        "22... Rae8 23. Qd3 Qb2": "Threatening 24...Nxb3 which cannot be avoided.",
        "24. Rxe8 Rxe8 25. Rc1 Nxb3 26. Rxc2": "According to my view, I prefer 26.Qxc2.",
        "26... Qb1+ 27. Bc1": "A desperate move. All other alternatives lose quickly, other than 27.Qf8, but it still makes a piece down with 27...Nd2 28.Qxb1 Nxb1. Here, if 28.Nxd2 happens, black will easily put 28...Rc1 and grab the horse. 27.Rc1 is no hope. 27.Be8 continues as 27...Na1 28.Nd4 Bxd4 which loses the white rook. But see what happens......",
        "27... Nxc1 28. Qd1": "To have a shelter from the discovered backrank check and to save the rook!! Awesome board to see, isn't it? Can you recognize the next move? ",
        "28... Ne2+": "Black will have the queen absolutely for free!!! What else? White proceeded with his resignation."
    },
    "url": "https://gameknot.com/annotation.pl/chronical-game?gm=36668",
    "gameName": "Chronical Game",
    "players": "Von Bahr (2320) vs. Karl Johan (2354)",
    "opening": "Ruy Lopez (C78), Wing attack"
}