{
    "moves": {
        "1. d4": "Annotating this game for fun, since the new influx of annotations has been a bit slow in the last couple days. This is a mini-tournament game played by a friend of mine, white, who opens with 1. d4.",
        "1... d5 2. e3": "With 2. e3 white hints that he's looking to play the Stonewall System.",
        "2... Bf5 3. Bd3": "The recommended reply by black is 2. Nf6. Black instead opts to develop his bishop, and white confronts that bishop with 3. Bd3, placing his king's bishop on the square it most favors in the Stonewall.",
        "3... Bxd3 4. Qxd3": "Black exchanges, inviting the white queen to come out and play.",
        "4... Nc6 5. Nc3": "And now white deviates from his Stonewall plans (maybe he never really intended to play the Stonewall after all).",
        "5... Nf6 6. Nf3 e6 7. O-O": "Black has somewhat mirrored white, but he is two moves behind (having moved his bishop twice in this opening).",
        "7... Nb4 8. Qb5+": "Black attacked white's queen, and white responds with a 3-way fork against black's king, knight, and b7 pawn.",
        "8... Nc6 9. Ne5": "Black saved his knight and blocked the check, which leaves the b7 pawn hanging. White could simply snatch the pawn, but he prefers to press his attack, adding pressure to the pinned black knight on c3. There is nothing black can do to avert the loss of material. 9. ... Qd6 10. Qxb7 and now black's knight and rook are forked. 9. ... a6 meets a better fate, only losing a pawn.",
        "9... Be7 10. Nxc6": "9. ... Be7 is another choice for black that loses a pawn, but a pawn was to be lost no matter what, so black at least develops a piece.",
        "10... Qd7 11. Nxe7": "10. ... Qd7? is a blunder that loses a piece. The right move was 10. ... Bxc6 to only lose the pawn.",
        "11... Kxe7 12. Qxb7": "And now black is down a bishop and a pawn.",
        "12... Rab8 13. Qxa7": "12. ... Rab8? was the right idea, wrong rook, and it loses another pawn.",
        "13... Qc6 14. b3": "Evidently white is feeling guilty about building his material lead and decides to give some of it back with 14. b3?, moving his knight's only defender. Better was 14. Qc5+! forking black's king and queen and forcing the exchange of queens. Further, this craeates a 3-1 queenside pawn majority (if we discount white's c2 pawn, 4-2 otherwise) which is almost certain to eventually promote a pawn.",
        "14... Qxc3 15. Ba3+ Kd7 16. Qa4+ Kd8 17. Rfc1": "After a couple checks, white runs out of attacks and defends his pawn at c2. It's worth nothing that while white is still two pawns ahead, his queen and bishop are ineffectively placed on the edge of the board and his rooks are locked into defensive positions. Further, the white pieces acutally hinder the advance of his pawn majority. This might be a good time for black to try to counterattack before white regroups.",
        "17... Ng4 18. h3 Nf6 19. Bb4": "Black tried to follow my advice, probing with his knight, but his half-hearted counter attack is repelled. Then white blunders another piece with 19. Bb4?",
        "19... Rxb4 20. Qa8+": "Black returns the favor blunder for blunder. The right recapture was 19. ... Qxb4, leaving black materially ahead a piece for two pawns. By capturing with 19. ... Rxb4??, black exposes his king and his rook on h8 to a back-rank attack, and instead of gaining a material advantage, he ends up losing more material than he gains.",
        "20... Ke7 21. Qxh8": "White is now ahead by the exchange and two pawns, but black still might find some good counterattack prospects since all three of his pieces are developed while white's rooks are still locked into defense and his queen is far far away from being helpful. However, with so many pawns still on the board, it's difficult to see where black has any attacking chances.",
        "21... Qd2 22. Qxg7 Ne4 23. Rcf1": "Black gives it a good try, threatening the pawn on f2, but white defends admirably. This leaves the pawn on c2 en prise. Dare black take it?",
        "23... Qxc2 24. Rac1": "He did dare, but white's inevitable reply puts the danger into clear and present perspective. Black's queen must move, and in fact, she can capture the a2 pawn if she cares to. But white's reply, 25. Rxc7+ followed by 26. Qxf7 with mate to follow brings this game to a sudden and abrupt end. Faced with unstoppable mate, black resigns. Black can stop the checkmate with 24. ... Qxc1 25. Rxc1 Rb7 26. Qxh7 but that leaves white up by queen + 3 pawns vs. knight and a simple endgame to win with two passed pawns and a queen to support them."
    },
    "url": "https://gameknot.com/annotation.pl/clear-and-present-perspective?gm=25025",
    "gameName": "Clear and Present Perspective",
    "players": "remohgramps (1152) vs. globus (1277)",
    "opening": "Queen's pawn (D00), stonewall attack"
}