{
    "moves": {
        "1. e4": "Hi everyone!\r\n\r\nAfter two low draws and then a loss in my second game against dynamic_dv which at the moment I cannot bear to annotate, I am glad to report a successful mating attack.  My opponent plays a very unusual line of the Sicilian Defense which is characterised by 1. e4 c5.",
        "1... c5 2. Nf3 a5": "2. ...... a5 - most unusual.",
        "3. d4 e6 4. Be3": "4. Be3 - the standard d4 is followed by some normal development.",
        "4... Nc6": "4. ..... Nc6? - a developing move but loses a pawn.",
        "5. dxc5": "5. dxc5 - tvm!",
        "5... Nb4 6. a3 Na6 7. Bxa6 bxa6": "7. ...... Bxa6 - I cannot overcome my fetish for exchanging B for N in order to bust up opponent's pawn structures.  Sometimes it works and sometimes it doesn't.  Here it does.",
        "8. Nbd2": "8. Nbd2 - development.",
        "8... Nf6 9. b4": "9. b4 - consolidation of queenside pawn structure.",
        "9... Ng4 10. Bd4": "10. Bd4 - I sense Fou Lenoir is gonna do a grand job here.  Next turn I will not be disappointed.",
        "10... g6": "10. ...... g6?? - is this a Christmas Bonus?!",
        "11. Bxh8": "11. Bxh8 - one rook gratefully received.",
        "11... f6": "11. ..... f6 - tries to shut in Fou Lenoir but it ain't gonna work.",
        "12. e5": "12. e5! - It ain't gonna work cos this move backs up f6 to allow Fou Lenoir to emerge from the black camp and I will therefore remain a whole rook and pawn up.",
        "12... axb4 13. axb4": "13. axb4 - pawn trade.",
        "13... Bh6 14. Ne4": "14. Ne4 - my opponent's king is looking very draughty in the centre.  Glenda is just itching to get onto d6.  My opponent decides to give the f6 pawn back up with his king but still I take on f6 with Fou Lenoir.",
        "14... Kf7 15. Bxf6 Nxf6": "15. ..... Nxf6 - firstly black returns the compliment with a B for N trade.  Now I take the knight on f6 and increase my lead to 7 material points.",
        "16. Nxf6 Qc7 17. Qd6": "17. Qd6 - offering a queen trade which he refuses.",
        "17... Qd8 18. O-O": "18. 0-0 - time to make use of that extra rook.",
        "18... Bf8 19. Ng5+": "19. Ng5+ - the seed of a plan of attack on the black royal couple starts to germinate in the grey stuff between my lugholes.  No need to back Glenda off yet.  Seems unbelievable that it is not Glenda but her counterpart the Witch that is stuck on the back rank!",
        "19... Kg7 20. Nxe6+": "20.  Nxe6+ - the seed germinates and flowers into a won position for white.  I can exchange queens here but my opponent gives me the opportunity to do something a lot lot better ......",
        "20... Kh6 21. Qd2+": "21. Qd2+ and #2.  My gut feeling came to the fore.  Before the usage of analyse the board I thought Qd2+ looked good.  I played it out on analyse the board but it said check and not mate.  However, I then noticed the BK had no legal moves, aha.  So would Qxg5 be mate?  The detector said yes, so I set up the moves g5 and Qxg5# as conditionals.  My opponent duly played into them.  Nice.",
        "21... g5 22. Qxg5#": ""
    },
    "url": "https://gameknot.com/annotation.pl/clean-up-part-2?gm=26432",
    "gameName": "Clean Up - Part 2",
    "players": "jstevens1 (1823) vs. NN (1042)",
    "opening": "Sicilian defence (B27)"
}