{
    "moves": {
        "1. Nf3 Nf6 2. c4 g6 3. Nc3 Bg7 4. e4 d6 5. d4 O-O 6. Be2 e5 7. O-O Nc6 8. d5 Ne7 9. Ne1 Nd7 10. Be3 f5 11. f3 f4 12. Bf2 g5 13. Nd3 Nf6": "In knazmi (1654) vs. bronx_best (1729) 1-0\n1. d4 Nf6 2. c4\tg6 3. Nc3\tBg7 4. e4 d6 5. Be2\tO-O 6. Nf3 e5 7. O-O Nc6 8. d5 Ne7 9.\tNe1\tNe8 10. Be3 f5 11. f3 f4  12. Bf2 Nf6 13.\tNd3\tb6\nhttp://gameknot.com/analyze-board.pl?bd=10300240&rnd=0.9726561531424522\nbd=1030024\n\n",
        "14. c5 Ng6": "King Indian Defense Tranposed Via Reti Opening\n1. Nf3 Nf6 2. c4 g6 3. Nc3 Bg7 4. e4 d6 5. d4 O-O 6. Be2 e5 7. O-O Nc6 8. d5 Ne7 9. Ne1 Nd7 10. Be3 f5 11. f3 f4 12. Bf2 g5 13. Nd3 Nf6 14. c5 Ng6\nTill move 14, the move is book moves. \nBefore playing this, I have made survey on the opening possibility that my opponent prefer to play. Having to know that I can achieve KID via Reti when playing him, I played and steered the game into KID Taimanov Variation with 9. Ne1 Nd7 also known as Classical Variation. ",
        "15. Qb3": "15. Qb3 Novelty in Gameknot games archive\nGameknot Archive:\n15. Rc1 75% 25% 0% 4 Games\n      b4   0% 100% 0% 1 Game\n      cxd6 100%\t0% 0% 1 Game\n      a4  100% 0% 0% 1 Game\n\n\n",
        "15... h5 16. cxd6 cxd6 17. Rac1 b6 18. Nb5": "Exploiting c-file weakness",
        "18... Bb7 19. Rc7 Rf7 20. Rfc1 Rc8 21. Rc7xc8 Bxc8 22. Nxa7 Ne7 23. Bxb6 Qe8 24. Nb4": "Other move 24. Nxe5! Tactical blow. Now possible continuation is 24. ... dxe5 25. d6 Ng6 26. Bc4. I saw this but I prefer to try to win on positional advantage. ",
        "24... Bd7 25. Na6 g4 26. Nc7 Qb8 27. Nc6": "27. Nc6?! Better was Na6!",
        "27... Bxc6 28. dxc6 Nc8": "28. ... Nc8!",
        "29. Ba5": "29. Ba5?! Lose a piece but try to provoke for Queen Exchange. If not remain pressure on f7 square.  -",
        "29... Qa7+ 30. Kf1 Qxa5 31. Ne6 gxf3 32. gxf3 Qa7": "32. ... Qa7 Now my opponent saw the pressure at f4 and possibility for c pawn promotion via power move 33. Qb7!! ",
        "33. Nd8 Bf8 34. Nxf7 Qxf7 35. Qb7": "35. Qb7!! Pawn promote inevitable. My opponent resign. 1-0"
    },
    "url": "https://gameknot.com/annotation.pl/clochards-2-mini?gm=20363",
    "gameName": "clochard's 2. mini",
    "players": "knazmi (1739) vs. km_mountie (1578)",
    "opening": "Reti opening (A05)"
}