{
    "moves": {
        "1. e4 c5": "Mini Tournament game, I'm playing black and go for the Sicilian.",
        "2. Bc4 e6": "The Philidor Variation with 2. Bc4, considered inferior to Main, Close, Morra Gambit, and Wing Gambit, but I have seen it several times in maybe at most a couple dozen games where I have played the Sicilian as black. Maybe it has lots of hits in the GK DataBase?",
        "3. Nc3 a6 4. a3 Nc6": "Black played 3. ... a6 to keep white's pieces off of b5, and to prepare to play a black pawn to b5 sometime soon, so the move seemed reasonable. White responded with 4. a3 which seems to accomplish nothing. No black piece is held at bay, and the threat of white playing a pawn to b4 seems minimal at best. Evidently, white's intent was to allow the bishop a retreat along the a2-g8 diagonal after black plays a pawn to b5. Still, black now plays 4. ... Nc6 to cover b4 and prevent white from advancing that pawn easily.",
        "5. Nf3 Nf6 6. d3 b5": "As planned, exploiting the weakness of 2. Bc4.",
        "7. Ba2 d5": "Challenging the center.",
        "8. exd5 exd5 9. Bg5 Be7": "Breakingt he pin and preparing to castle.",
        "10. O-O Be6": "Preventing a 2nd pin that could arise from white playing Re1, although 10. ... 0-0 would have solved that problem too, leaving the black bishop free to roam up to g4 in a move or two.",
        "11. Re1 O-O 12. Ne2 h6 13. Bh4 Bg4": "A bit of a wasted tempo, but this seems a stronger square for the bishop.",
        "14. Nd2 Qc7": "I'm not really sure what I hoped to gain by this. It seems to leave the black pawn at d5 hanging, for white can win that pawn with 15. Bxf6 Bxf6, 16. Bxd5. However, then black replies 16. ... Bxb2 and evens the material with a minor positional advantage in pawn structures.",
        "15. f3 Bf5 16. Nc3 c4": "The black pawn at d5 was truly in danger this time, but rather than defend it, black pushes his pawn to c4, blocking the white bishop's attack against d5.",
        "17. d4 Nxd4": "17. d4? looks to be a blunder, though maybe only a minor one. White cannot hold that pawn on d4, as black immediately demonstrates. The threat now is 18. ... Nxc2 forking the two white rooks.",
        "18. Bxf6 Bxf6 19. Nxd5 Qc5": "I labored hard over this one. I knew white was going to play 20. Nxf6+ and ruin black's castle position and pawn structure and rob black of the bishop pair. Knowing all that made it hard to play 19. ... Qc5. But I liked the discovered attack on white's king too much to not play the move. With something safer, like 19. ... Qd6, 20. Nxf6+ Qxf6. 21. Rc1 defends the pawn and prevents the fork at c2.",
        "20. Nxf6+ gxf6": "As predicted",
        "21. Kh1 Nxc2": "Fork achieved.",
        "22. g4 Nxe1": "Looking at a possible threat to the white king involving Qf2, Rd8 (pinning the white knight) and Nxf3. Not that any of that is forced, but white must respond to it.",
        "23. Qxe1 Rfe8": "Black wants to save the bishop at f5, but this little zwischenzug gets a rook on the open e-file with gain of a tempo. White must see to saving his queen, giving time for the en prise black bishop to retreat next move.",
        "24. Qh4 Qd4": "The bishop remains en prise. But white cannot capture with 25. bxf5?? because that pawn is pinned and black would reply 25. ... Qxh4. Meanwhile, black's queen forks the white knight at d2 and the white pawn at b2.",
        "25. Rg1 Bg6": "White threatened a discovered check with 26. bxf5+.",
        "26. Qxh6 Re2": "White cleverly gained a pawn while protecting his en prise knight. Black responds by getting a rook on the 7th (2nd really, but it's black's 7th rank), doubling the threat on the white knight, but also adding pressure on white's king.",
        "27. Bb1 Qxd2": "White finds a little pressure of his own. The threat is 28. Bxg6 fxg6 29. Qxg6 beginning a king hunt offering white a chance to find a perpetual check or 3-move repetition, if possible. I didn't work out whether it is possible, because I found the winning move for black. After 27. ... Qxd2, black gains more material and now threatens the white queen, preventing 28. Bxg6?? by threatening 28. ... Qxh6.",
        "28. Qh3 Rae8": "Bringing in the final piece needed to pry the white king out of his ruined castle.",
        "29. Bf5 Re2e1": "Closing the net. Threatening 30. ... Rxg1 31. Kxg1 Re1+ 32. Qf1 Rxf1 and white loses his queen. Not 30. Rxe1??? for black simply plays 30. ... Rxe1+ with mate to follow.",
        "30. Be4 Bxe4": "White tried to block the e-file, but it merely costs him a pawn.",
        "31. fxe4 Re8xe4": "Final position. With no way out, white is facing a hopeless endgame in which black has a material advantage of queen+pawn and so white resigned at this point."
    },
    "url": "https://gameknot.com/annotation.pl/closing-the-net?gm=22778",
    "gameName": "Closing the Net",
    "players": "wunceaknight (1613) vs. blake84120 (1802)",
    "opening": "Sicilian defence (B20)"
}