{
    "moves": {
        "1. e4 c5 2. Bc4 Nc6 3. Nf3 g6 4. c3 Bg7 5. d3 d6 6. Ng5": "White wastes a move. Castling was best; and either 6. Be3 or 6. d4 was better than the text move. ",
        "6... e6 7. O-O Nf6 8. h3 Bd7 9. Bf4 Qe7 10. Na3 a6 11. Bg3 O-O 12. Nf3": "White \"unwastes\" his previous sortie. Well, not. Better was 12. f4 first, grabbing space.",
        "12... Na5 13. Nc2 Rac8 14. a3 Nxc4 15. dxc4 e5": "Inattentively grinding the gears somewhat. Better was 15. ...Ne4.",
        "16. Qd2 Bc6": "Yes, I could have captured again here, but the pawn's not going anywhere, and the Bishop is a powerhouse on the long diagonal.",
        "17. Qd3 Bxe4 18. Qe2 Rfd8 19. Bh4 Bc6 20. Ne3 b6 21. Rfd1": "Wrong Rook, technically, but it matters not. ...And just as an aside, how in the world can 2 chessplayers get 18 moves into a Sicilian (closed or not) and still have 15 of the original 16 pawns on the board?? Weird.",
        "21... Qb7 22. Nd5 Bxd5 23. cxd5 h6 24. Bxf6 Bxf6 25. Rd2 c4": "! Freezes White's Q-side pawns.",
        "26. Rad1 b5 27. Nh2 Rde8 28. Ng4 Bg7 29. Qf3 f5": "White's doing it to himself. This game should be a draw, ...after another couple hundred moves or so. But lulled (I suspect) by that big juicy rating of \"1200\" next to my screen-name, White assumes the win is in the bag and plays too aggressively, reaping the usual consequences.",
        "30. Ne3 Rc5": "Have to keep appearances up: Black makes it look as if he's focused on winning the d-pawn. But he's not.",
        "31. Nc2 a5 32. Qg3 Qf7 33. b4 cxb3 e.p. 34. Na1 a4": "Knight-under-glass, anyone?",
        "35. Rd2d3 f4 36. Qg4 e4": "White resigns. The c-pawn is about to be snapped off, putting Black 3 buttons to the good, and basically 2 pieces ahead because White's Knight is already entombed."
    },
    "url": "https://gameknot.com/annotation.pl/closed-sicilian?gm=45172",
    "gameName": "Closed Sicilian",
    "players": "samsun55 (1706) vs. Avocet (1200)",
    "opening": "Sicilian defence (B20)"
}