{
    "moves": {
        "1. e4 c5 2. Nf3 d6 3. Bc4 Nc6 4. a3": "White gives Black a free tempo. Coming from a solid A-player, the text is simply incomprehensibly weak, an almost completely wasted move.",
        "4... Nf6 5. d3 g6 6. c3": "White is committing the cardinal sin of chess - moving without a coherent plan. The text obviously supports a push to d4 (even after a preliminary attempt at a break at b4) ...which lets the e-pawn hang. Or perhaps White wants to stop Black's Knight from hopping to d4 ...where it could then easily be chased by the c-pawn or exchanged from f3. I don't know what White was thinking, to engage in this pointless dithering.",
        "6... Bg7 7. O-O O-O 8. Re1": "Notice that it's now taken White 3 moves to fully set up a pawn-push he had the option of playing on the 2nd or 3rd move of the game. Meanwhile, Black has already gained a lead in development merely by playing naturally.",
        "8... Qc7 9. Nbd2 Nd7": "White bottles up his Queen, a natural supporting piece to the push to d4, behind the QN which had no other square to develop to, and in the process also blocks his QB; so Black moves to make the push to d4 even less appealing. The right move was 9. Be3, continuing to put pressure on the square.",
        "10. h3 a6": "Black \"dithers\" more effectively than White whose push to h3 accomplishes exactly nothing, addresses exactly no threat. It was said by Fischer of Petrosian that the great Russian defensive genius had a gift for making innocuous-looking pawn moves in the opening that turned out to have great prophylactic significance 15 or 20 moves later in the middle game. That's not the case here. Black's \"dithering\" at least threatens ...b5, gaining space and a tempo.",
        "11. Nh2": "Ah, White's plan becomes clear - to push a pawn to f4 to gain influence in the center. And to achieve just the threat to accomplish this, all White had to do was remove from the center a Knight that was already there influencing it. ...The word \"anti-positional\" comes to mind.",
        "11... b5 12. Ba2 Bb7 13. Ndf3": "What?? White doesn't even take his opportunity to play the pawn to f4??",
        "13... h6 14. Ng4 Kh7 15. Qc2 Nde5 16. Nfxe5 dxe5": "This pawn capture, rather than a capture with either Knight or Bishop, makes Black's K-side almost impregnable.",
        "17. Re3 f5": "Gaining space and opening lines, with tempo.",
        "18. exf5 gxf5 19. d4 cxd4 20. cxd4 e4": "Renewing the threat of ...fxg4.",
        "21. Nh2 Qd6": "Breaking the pin, centralizing the Q, and positioning it to help guard h6 in some variations. Threats along the c-file now also favor Black.",
        "22. Rg3 Nxd4 23. Rxg7+": "Tantamount to a resignation in this position: White has nothing - no threats, no attacks, and no defense.",
        "23... Kxg7 24. Qc3 e5 25. Qg3+ Kh7 26. Kf1 Nc2 27. Be3 Nxa1": "And in this position, after an almost unbelievably poor performance for a player of good caliber, White resigns. ................ Re: blake78613's various comments: The proof is in the pudding. If White was trying out a new variation in this game, one could only say it met with resounding failure. Let me point out also that the Sicilian isn't the Ruy Lopez/Spanish game: the Sicilian is a fighting defense from the first move, and both players seek dynamic chances and counter-chances. Some variations are more positionally-minded, true, but none are cautious by nature or sedate, and all of them bristle with tactical fireworks simmering barely below the surface. It's my considered opinion that White's plan - if plan he had - was poor in both conception and execution against a defense as aggressive as the Sicilian. What makes my judgment valid, you may ask? Well, just take a look at the ratings of some of the Gameknot players my Annotated Games list includes. One final note: The Danish GM Bent Larsen was noted for his occasional barbed comments when analyzing games: I recall one (not one of his own games) where he bluntly wrote, \"In my opinion, both players are losing here,\" and earlier had said of Black, \"His whole game is incomprehensible.\" When I analyze I state my opinion about the position. If the reader doesn't like it, that's fine: he's free to look at someone else's games."
    },
    "url": "https://gameknot.com/annotation.pl/closed-sicilian-blitz-game?gm=44332",
    "gameName": "Closed Sicilian (Blitz Game)",
    "players": "jai1208 (1853) vs. Avocet (1200)",
    "opening": "Sicilian (B50)"
}