{
    "moves": {
        "1. d4": "1. d4 is not my regular opening for white; most of the time I'm playing the London System. ",
        "1... f5": "Wow ! A whole new world opened for me ! Dutch ! It was the first time I've played against that opening-line.. Let's see what it brings..",
        "2. c4": "Let's go into Dutch Defense then..",
        "2... Nf6 3. Nc3": "With this knight-move, white controls all centre-fields.. ",
        "3... e6": "In meanwhile, the opening is called \"Dutch with c4 & Nc3\". Black makes an open line to position his bishop on b4, to pin my knight.",
        "4. Bg5 Be7": "Black's preparing to castle..",
        "5. Nf3 O-O 6. e3": "Normal developing.. One more move and white is also ready to castle on kingside.",
        "6... Ne4": "A nice attacking move from black ! 6. ... h6 would create openings in her king's defence, where white could take advantage of..",
        "7. Bxe7": "Black is forced to take my bishop.. On the next move, I will capture her knight, wich, after taking back, will create a double-pawn.",
        "7... Qxe7 8. Nxe4 fxe4 9. Nd2": "Attacking that lonely e-pawn.. 9. Ne5 would result in 9. ... d6, so it would cost me another move to get my knight to a safer place..",
        "9... d5": "Protecting the e-pawn.. Actually, I think black hopes on 10. cxd5 exd5; wich will re-arrange black's centre-pawns.. ",
        "10. c5 e5": "11. dxe5 would mess up my pawn-structure, while awaiting 11. ? exd4 12. exd4 e3 would bring me in troubles.. Let's develop my bishop to e2, (only field available, since 11. Bb5 would straighten black's pawn-diagonal) to prepare the castling..",
        "11. Be2 a6": "I don't really understand why black played this move; since there is no threat from white's bishop..",
        "12. O-O": "Finally, castling :)",
        "12... Be6": "Maybe 12. ... Bd6 would've been better ? So black could have the chance to play 13. ... Bb5 ?",
        "13. f3": "I thought opening the f-line would be great; since my two rooks and queen where on the same rank (a nice open line could become desastreus for black; once white took control of it !).",
        "13... Bf5 14. fxe4": "Opening a nice line for my rook. Black now can take my pawn with his pawn, wich will double his structure up, once again. Not so good, so it's best to wait for white's actions..",
        "14... Be6 15. exd5": "That pawn is a double-pawn anyway, so why not putting some pressure on black, while winning some pawns ? The treathening on the f-file still remains, so .. ",
        "15... Bxd5": "Only (good) move at the moment.",
        "16. Rxf8+": "Exchanging some pieces.. Situation at the moment: black has an isolated pawn at the e-line, wich will be lost later on; while white still has a closed pawn-line from the a- till e-rank.. ",
        "16... Qxf8 17. Qf1 Nd7": "Nice move !! Now black keeps being dangerous, because it won't have to play 18. Qxf8  Kxf8  19. Rf1 . (where black would need to spend another move to develop his closed-in rook).",
        "18. Qxf8+ Rxf8 19. Rf1": "Is black willing to exchange her last rook ? ",
        "19... exd4": "Nope, she won't.. Trading the isolated pawn isn't a bad idea, in my opinion ?",
        "20. exd4 Bxa2": "A \"free\" pawn ? No, it now costs black her bishop, with a check.. She's forced to take my bishop, pretty obvious.",
        "21. Bc4+ Bxc4 22. Nxc4": "A nice position for my knight !!",
        "22... b6": "The score is equal at the moment, so black has good chances of promoting on the queenside ! ",
        "23. c6": "23. cxb6 would favour black.. So I'm NOT going to do this ! Giving some pressure on c6 feels better.. ",
        "23... Nf6": "Aiming for e4, for helping her pawns ?",
        "24. Rf3": "Can't remember why I played this move.. But I remember it had a good reason !",
        "24... Rd8 25. Rd3 Ne4": "There's e4.. Good place for the knight !",
        "26. Nd2": "Exchanging knights ? In fact, this move wasn't so good; since 26. ... Nc5 would cost me at least a pawn, at max a rook :/",
        "26... Nc5": "There you go..",
        "27. Re3 Rxd4 28. Nb3": "Double-attack, going for the knight-exchange ?",
        "28... Rd1+": "Nice move, but I think it only helps white to bring his King into the game..",
        "29. Kf2 Rd3": "Nice try ! 30. Rxd3 Nxd3  costs me a pawn.. So it's best to take away that rook's security !",
        "30. Nxc5 Rd2+": "Still going for that lonely pawn ! ",
        "31. Re2": "White wants to exchange those rooks hardly ! After exchanging, and loosing the knight, there's a good chance for white to promote (since black will have two pawns on the c-line).",
        "31... Rxe2+ 32. Kxe2 bxc5 33. Kd3": "Going for those pawns !! The following moves are, one by one, good moves for both sides..",
        "33... Kf7 34. Kc4 Ke6 35. Kxc5": "Now it's getting risky.. If one side blunders, things will be over.. (within x-number of moves offcourse).",
        "35... Kf5": "Excellent move ! White's king is forced to go back to the fourth rank, because all ways till the sixt rank are closed.",
        "36. Kb4": "Heading for that a-pawn..",
        "36... Ke5": "Coming back for the c-pawn. A good choice; since there isn't any treath on the g- and h-file..",
        "37. Ka5 Kd6 38. Kxa6 Kxc6 39. b4": "Closing black's c5 hide-out-square, while next move 40. b5 would result in a pawn-exhange and a sprint of both kings to the other side; where black should he favoured ! ",
        "39... g6": "Since white's king is closed-in, the chance on a pass-trough is great !",
        "40. h4 h5 41. g3": "Backing up for 41. ... g5  42. hxg5 h4 (wich offcourse would be a bad idea; since white would promote for sure).",
        "41... Kd7 42. Ka5 Ke6 43. Kb5": "I need that pawn !! :) Black will probably play 43. ... Kd5, so my king will be forced to move back up to the a-line.. All depends on the pawn-pushing of both sides !",
        "43... Kd5": "There he is :) Note black is still on the good side for the sprint to the g- and h-pawns !",
        "44. Ka6 Kd6 45. Kb7": "Awaiting for black's move..  ",
        "45... c6": "The loosing move for black, I guess ? Making a \"triangle\": 46. Kb6 Kd5 47. Ka5 ?",
        "46. Kb6 Kd5 47. Ka5 c5": "Maybe 47. ... Kc4 was better ? --> 47. ... Kc4  48. b5 cxb5 and black wins.. Or 47. ... Kc4  48. Kb6 Kxb4  49. Kxc6 Kc4 and so on..",
        "48. b5": "White passes and promotes one move before black.. Now it's sprinting time !",
        "48... c4 49. b6 c3 50. b7 c2 51. b8=Q c1=Q 52. Qg8+": "Double action; checking on black's king, and maybe stealing his g-pawn ?",
        "52... Ke4 53. Qxg6+ Kf3": "Black tries to remain on the white fields, so it's hard for white to give check and capture the enemy queen in meanwhile..",
        "54. Qxh5+ Ke4 55. Qg6+ Kd4 56. Qg4+ Kc5": "Final mistake ! This costs black's queen's life ! 56. ... Kd3 would've been better..",
        "57. Qc8+ Kd4 58. Qxc1": "Black gave up.. I really enjoyed this game ! It teached me a lot of things about the pawn-endings, and also about chasing the enemy's king.. Unfortunately for black, she made a fatal mistake in the final steps.. \r\nThanks to Karienake for the game ! I hope you folks enjoyed my first annotation ? Please give comment, so I can try to improve my games & annotations.. Thanks !"
    },
    "url": "https://gameknot.com/annotation.pl/club-belgie-tornooi-i?gm=12495",
    "gameName": "Club Belgie Tornooi I",
    "players": "Taufiq (1404) vs. Karienake (1585)",
    "opening": "Dutch with c4 & Nc3 (A85)"
}