{
    "moves": {
        "1. e4": "So, as usual I kick things off with the King's Pawn Opening.",
        "1... e5": "While I know all about this move and am certainly ok with handling it, I thought that black would respond with the Siclian.  But, in this case, it really doesn't matter nor should it since I know what to do here.",
        "2. Nf3 f6": "I don't why black played this.  It's not a developing and does not help to control the center.  Therefore, as far as I know, this move is out of book.",
        "3. Bc4": "So, I just continue with development in such a way that I will eventually castle Kingside.  Although really, I should just do this by my fourth move, if possible.",
        "3... d6": "This time, I know what he wants.  In this position, my opponent is attempting to force an exchange and cause problems with the idea of 4...Ne7, followed by ...d5.  Those are his intentions, but I am not going to allow that.",
        "4. d4": "Therefore, although I stated that white should castle, this is an exception.  And, in fact, that's why this move is better.  In addition, now there are two occasions where he has only advanced his pawn one space, so this how I decided to respond.  I actually should have done it earlier, the entire opening transposed into a philidors defense.",
        "4... Nc6": "At this point, black is intending to win a free pawn because of this move, but I won't allow that.  Instead, I will force several exchanges, in a chain of events here.  BTW, a chain of events is an occasion where one thing leads to another, or where just one road leads to rome.  That's the case here, because white and I are going to exchange like crazy, so that in the next two moves, four exchanges will be made.",
        "5. dxe5 Nxe5 6. Nxe5 fxe5 7. Qf3": "This where what should have been aggression with a purpose inadvertently became unsound, due to lack of concentration, actually.  While it may seem like it, which was the case in past games as most of you know, I was not intending to mate in one.  But, that's simply what it looks.  Better was what I actually had in mind and had wanted to play which was 7.Qd5.  Yes, it also poses a mate threat, but the idea was that no matter what I would be to play Qf7+.  The idea being is to expose black's K in a very unusual way.  7...Qd7 (indirectly forced), 8.Qf7+, Qxf7 9.Bxf7.  Edit: But, now I miscalculated as well, and that would have been bad.  That's because it would have lost material because after 9.Bxf7??, while the K gets exposed, black plays 9...Kxf7, I essentially lose a piece, in exchange.  That's even worse because losing material is actually worse exposing your K.  So, I would wind up making the exact same mistake during the misstep against blitzkov.  Something that didn't even come into consideration.  At least, I now learned that there is more then meets when what you think is good is actually bad.  This is something that a mentor and I have gone over, but is the only thing that I am still forgetting.  The good thing is that this is the way for me to remember once and for all.",
        "7... Nf6": "Of course, white is just going to continue developing in a non chalant manner, and why wouldn't he.  Eventually, chicoboy is going to punish me for my last move.",
        "8. Bg5": "However, unlike before, when I've made cheapo's this time, I'm just going to continue developing.  And, I'll start by pinning his N, with my DSB.",
        "8... Be7": "And, this is the move that I had anticipated in response.  But, that's also what I wanted.",
        "9. O-O": "That's because, as noted on move 4, I finally take advantage of my opportunity to castle.  So, in this case, one road did not lead to Rome, yet.  But, I have to be carefully not to jinx it because that will eventually change when I make another reckless move due to miscalculation.  ",
        "9... Bg4": "Now, this is where black punishes white for 7.Qf3!?  This time, I have no choice but to accept the consequences for my actions.  At first, I considered taking with 10.Qxg4, but I ruled that out almost immediately as then he retakes with ...NXQ.  A move that back some time ago, I actually could have missed, believe it or not.  At least, I spotted it very quickly.",
        "10. Qe3": "I had several outposts, but I feel that this is the best one as I'm now putting pressure on the e file.  I care more about the e and d files then any other files because I believe that pressuring it also puts pressure on black's center.  After this game and analyzing it, I realize that it was never going to be the case, but it's always worth a try because that's how I usually pressure the center, like that.  My goal is to always make it difficult for my opponent to control the center since central control is extremely important.  Sometimes, I get too much confidence from one move and feel that it automatically gives me an advantage, which isn't always the case.",
        "10... h6": "But, he counterattacks with this move.  This time, however, black is not punishing white.  I can escape but since I'm ahead and to delay and hopefully prevent anything worse, I will force an exchange.  At this point, the stress has ended and it's the next day.  But, don't let your guard down.  I am going to make a different mistake, that will seal my fate.  Before, any of that happens, there will be a few more moves free of any inaccuracies, including an exchange.",
        "11. Bxf6 Bxf6 12. Nc3": "At this point, I'm only interested in completing my development since a main goal in chess is to, \"develop, develop, develop\" as schakertjie would say.  In addition, this is excellent timing because it does not give away material.  It's just that I did a little differently then should have due to the sudden changes, as noted earlier.  But, at least for now, my head is back in the game, and I'm back to my normal self.  Let's see how long this lasts.",
        "12... Bg5": "I see that upon completing development, he decides to drive after my Q.  But, aside from that, what does he really want?  That's the question.",
        "13. Qg3": "Well, I do not know what it is, but I won't allow it.  Instead, I decide to punish black by reattacking him.  Because if your opponent goes after your piece, then, \"two can play that game.\"  One certainly has the right to fight back, and that's the case here.  It's the saying that someone once said which is, \"You attacked me, and I fought back.\"",
        "13... Qd7": "At first, I wasn't sure, but I was just going to keep on studying the position until I found out why.  And, that's because your opponent always has a reason for making a move, if that reason is bad.  Well, as it turns out, black had a very good reason for moving here.  In this position, his goal is to do something very unusual, which I've done in a couple games.  The idea is to complete development by castling, and actually that's a very good idea.  I actually saw how that was, by GM Judit Polgar in her video on how she surpassed Bobby Fischer's Record, in her game against Anand.  Normally, I would have castled much earlier, but there's nothing wrong with move, at all.  In fact, I did something like this in two of my past games.",
        "14. Rfd1": "?? At this point, I'm just trying to even more pressure on black's center while bringing my R over for additional.  But, there's really nothing to worry.  It's just that Jack Stockel has advised me to count how many pieces you have vs how many the opponent has for coverage.  And, if it's about equal or your opponent has another piece there, it's a good idea to bring something else to the table.  However, this move is actually a blunder, and not just an inaccuracy, because it's going to lose a R for his B.  I should have thought about that before moving here, but then again, I'm beginning to feel different affects from the sudden changes.  That's just when I thought that it was all over and had completely recovered, but then this happens.",
        "14... Bf4": "But, black is still punishing me for bringing out the Q too early.  I did not realize that a punishment could last this long, until now.",
        "15. Qd3": "Forced because if, instead, 15.Qh4?? white loses his Q, after 15...g5.  I took that right into calculation.  Otherwise, I would have made that blunder, believe it or not, since it was my first instinct.  Proof that your first instinct is not always correct. ",
        "15... Bxd1 16. Rxd1 a6": "I don't why black played this.  His Q wasn't in danger because had he not played, so I decided to play 17.Bb5, he can defend with 17...c6.",
        "17. g3": "Because I'm behind, I decide to become very aggressive, and not in an unsound manner at all.  While I know that is not just going let me win his DSB, sooner or later I will force it since I'm behind.  That's because when you're behind or in a losing position, you can afford to make the most aggressive moves since there's nothing else to lose.  At least, you're doing what you can to catch up on material or even pull a swindle.  While that usually doesn't work, occasionally it does, and it's worth trying, as opposed to just giving up.  I mean, that was my main weakness, when I was still a beginner.",
        "17... Bg5": "So, after this retreat I am going to wait until the right moment for me to win his B for one of my P, and then catch up.  But, this requires patience, otherwise he can just pull back again, and white would lose rather quickly.  Why?  It would become a different form of unsound aggression which wouldn't achieve anything, except nearly open up my K and leave it vulnerable.  And, that is something that I won't allow.",
        "18. Qf3": "While it might seem like a ?! move with a different form of unsound aggression that can easily be driven off, it can't.  Yes, he can easily defend against this mating, but that's what I actually wanted and had expected.  That's because of what I have in plan after he drives my Q off, this time.  So, it's actually anything but obvious.  However, I wanted to start it off as obvious because this pretty much forces the plan to work.",
        "18... Rf8": "As expected.",
        "19. Qh5+": "And, this is exactly why.  Now in order to get out of check, he either has to play 19...g6?, which loses a pawn after 17.Qxg6, or he does what I anticipated since move 18.",
        "19... Kd8": "But, this accomplishes my goal, and the reason being is that black now loses castling rights.  And, even better for me was that I did it now, as opposed to, later which was actually a good mistake and miscalculation.  The reason being is that I left his K vulnerable, without blundering away any more material.",
        "20. Qg6": "So, now that I see a weakness, I try to take advantage of it with this move.  Of course, what good is it really going to do.  But, my goal was to, ironically, put pressure on the f file.  Instead, white just shot himself in the foot, in one respect.  And, that's because he's going to do that, himself.",
        "20... Rf6 21. Qh7": "So, instead, I put pressure on the h file.  Once again, without success, but at least, this time, the plan did not backfire.",
        "21... Rf8": "Of course, he is trying to prevent a mate threat.  But, I would not be able to mate because if 22.Qh8+, Ke7, 23.Qf7+ is not feasible due to his R.",
        "22. b4": "At this point, I'm now interested in getting a passed pawn, but I don't think that this should be main focus right now because there are a lot of other things going on here that need the attention to.",
        "22... c6": "His goal, however, is to create room to move the K.  If his intention is ...Kc7, ...Rad8, and ...Kd8, then I would understand as it's basically the equivalent to castle.  Let's what he'll do here.",
        "23. Na4": "Knights should not be placed on the rim, but when you have a plan that requires it, and you're behind like this, then I say go for it and don't even worry about cheapos or the basics, for that matter.  That's because falling behind like this is usually a sign of bad omen, so one should do just about anything to pull a swindle.  Going for a family fork is a way to do things, but this, as expected is something that black will not allow.  BTW, a family fork is actually a 3 way fork, or better is to say a piece or pawn that attacks three pieces or pawns.  But, it specifically involves the Q, K, and a R.",
        "23... Kc7": "! Not surprisingly, he sees my intention, and decides use his K as a weapon.  Normally, that should wait until the endgame, but this is an exception.  Because if he played, say, ...Kb8, it would prevent a family fork.  But, there would certainly be a fork, at the very completely making up for the material, as that would win a R, for my N.  Now, my opponent is not going to allow, so this was best.",
        "24. a3": "Even though we're not at that phase, I decided to treat this as though it were an endgame, and the reason being is because played a move that you usually see in an endgame.  Now, in an endgame, it's usually a good idea to connect your pawns like this as it gives them extra protection and helps them to promote.  So, this was a power of influence.  Although, the timing of it is bad.  Black only did that because he was at risk of losing material.  But, I am just trying to figure out how to get something back by playing unusual lines.  ",
        "24... Rfh8": "But, chicoboy is having none of that, and instead, decides to attack my Q.",
        "25. Qg6": "Of course, a wasted move is not much of a factor in this game due to the fact that I'm completely developed.",
        "25... Raf8": "At this point, I feel that black is trying to come with a way to mate with his Q, f R, and DSB.",
        "26. Be6": "But, I won't allow that.  Instead, I move here just to give my opponent something else to think about.",
        "26... Qe7": "On the other hand, he counterattacks.  Knowing that he cannot take my LSB, due to my Q.  Instead, I decide to give him another challenge.",
        "27. c4": "??A pawn push.  However, this is a serious blunder because of what my opponent will play next.  For that very reason, \"almost anything was better then this move\".",
        "27... Rf6": "That's because, he decides to fork my LSB and Q in the worst way.  And, at the very least he is going to win a free piece, and there's nothing I can do about it.",
        "28. Qh5": "I am obviously not going to give him my Q.",
        "28... Qxe6 29. c5": "So, after he takes, I decide to put pressure on his d pawn, by connecting my pawns.  I surely thought that this move was enough to win something back, but that is not the case.",
        "29... g6": "Instead, he responds by hitting on my Q.",
        "30. Qe2": "Forced, as anything else loses this piece.",
        "30... d5": "So, he decides to attack my pawn.  And, even if I don't take, he'll still force an exchange after ...exd4.  So, I had two choices.  Either, be passive and allow him to take first.  Or, be aggressive and take right away.  I decide to be aggressive, as that should and will shortly give me an opportunity to win something back.  By doing this, I explore my mind and stretch my imagination so that I have more options later on.  And, this, believe it or not, will increase my concentration even more.",
        "31. exd5 cxd5 32. h4": "Guess what?  As alluded to in my last comment, this move certainly wins something back.  In this case, his DSB+a pawn for one of my pawns.  A good example of how to make comeback.  So, knowing this fact, is why I played this move.  And, had I not been aggressive by being the first to take, I certainly would have overlooked this.  The reason that I now have compensation is because his DSB has no where to go, as this is a half pin.  In other words, it's not a pin the way you'd think of a pin where something is, \"pinned down\".  But, his DSB is just in a natural position where it can't move.",
        "32... b5": "So, after my last move, he decides to attack my N, especially given that it's on the rim.  But, that's not a problem, this time because I can easily get out of this.  Losing tempii is not a big deal, when you know that you're about to win something.  ",
        "33. Nc3 d4": "Like before, he attacks my piece.",
        "34. Ne4": "But, I just retreat, with a vengeance.  This time, I counterattack by kicking his R.  That way, he can no longer delay the exchange that will win a B for a P, given that he will spend the time to retreat his Rook.",
        "34... Rff8 35. hxg5 hxg5 36. Nxg5 Qf5": "After getting something, black decides to attack my N.",
        "37. Ne4": "?? But, I don't mind.  In fact, \"what doesn't kill you makes you stronger\", as I proved when getting something back.  The only problem is that this move is the losing blunder, as we're about to see.  But, in reality, if this is the move that costs me the game, I don't mind.  The reason being is that in order then to stay in the game, white would have to give up a N, so I would fall just as far behind.  At first, however, I did not realize that this loses quickly, until I really studied the position.  But, let's say it did, at least I'm standing my ground by keeping material safe, this time, after giving things away earlier.",
        "37... Qh3": "The reason that this game is lost is because black now has a mate in one, after 38...Qh2#.  On this ground, I resigned.  Now, it might not have led to the lost immediately, but what affected this game was the sudden change in my schedule.  That produced a lot of stress, in this game, you saw the aftermath of that.  By the time I calmed down and everything settled down (so all said and done), I was already two points behind.  But, still I never gave up until now.  And, that confidence helped me to get something back and compensate for lost material.  That's because I did not resign earlier.  So, the idea is always remain strong, no matter what life throws at you.  Or, as the saying goes, \"When life throws a lemon at you, make lemonade.\""
    },
    "url": "https://gameknot.com/annotation.pl/clubs-first-mini?gm=52289",
    "gameName": "Club's first Mini.... :)",
    "players": "jkarp (1230) vs. chicoboy (1322)",
    "opening": "Damiano's defence (C40)"
}