{
    "moves": {
        "1. e3 e5": "One of my usual responses to 1 e3",
        "2. Qh5": "Trying to go for \"scholar's mate\" eh? If 2 ... g6??, then simply 3 Qxe5 is winning for white, so instead...",
        "2... Nc6": "...I develop the QN to protect e5 directly.",
        "3. Bd3 g6": "Now I can play 3 ... g6, as 2 ... Nc6 easily prevents 4 Qxe5 Nxe5 losing white's queen for a mere pawn.",
        "4. Qg4": "So white is forced to retreat the queen",
        "4... d5": "Attacking the center, and also taunting Qxc8 Qxc8",
        "5. Qxc8 Qxc8": "And white wanted to trade queen for LSB",
        "6. Bb5": "Pins Nc6 until threatened off the a4-e8 diagonal",
        "6... Qg4": "Does this queen move look premature? I need her out of the way in order to castle queen side",
        "7. Bf1": "Defeats the purpose of 6 Bb5 altogether, I would have preferred a N development",
        "7... O-O-O": "And now I castle.",
        "8. h3": "This move harasses my queen, so I need to retreat her, but to which square?",
        "8... Qd7": "And I went for 8 ... Qd7...",
        "9. Bb5": "...which renews the B pin",
        "9... a6": "I want that B off the a4-e8 diagonal, if 10 Ba4 then simply 10 ... b5 undoes the pin...",
        "10. Be2": "...hence the retreat to e2",
        "10... Bg7": "I went for a B fianchetto",
        "11. Bg4": "Of course white wants that Q for B trade to equalize material (and to serve as the first Check of the game)...",
        "11... Nf6": "...which I accept by developing the KN; both a R and a N are defending d7",
        "12. Bxd7+": "So which piece do I take with?",
        "12... Nxd7": "I went for the N",
        "13. c3 e4 14. Ne2": "Preparing a kingside castle, not 14 Nf3 exf3 15 gxf3 trading a N for my pawn",
        "14... b5": "Begin the pawn storm",
        "15. Nf4": "White claims f4 to be an excellent outpost for the N, as it prevents ... Nd5, ... Ne6, and ... Nd3+ by black, first two of which threaten ... Nc2+ followed by ... Nxa1 (in fact ... Nb4 was already prevented by 13 c3)",
        "15... Nce5": "I respond by putting a N on e5, but was 15 ... Nde5 better than this?",
        "16. Na3": "A N development that prevents ... Nc2 directly",
        "16... c6 17. d4": "And these pawn moves lock up the center",
        "17... h5": "Another pawn storm; I am amazed that after 17 moves by each army, all the pawns are still on board!",
        "18. dxe5 Bxe5": "First pawn gone, but for a N",
        "19. Ne2 Nc5": "In response to 19 Ne2, I posted my remaining N to c5, a post powerful enough to threaten ... Nd3+ followed by a N for B trade; I expected either 20 Nf4 or any king move (like 0-0)",
        "20. Nf4": "Here, a B for N trade takes away white's defense of the critical d3 square...",
        "20... Bxf4": "...so I went for it",
        "21. exf4": "Now I can play 21 ... Nd3+",
        "21... Nd3+": "Here, a K move is necessary by white; only 22 Ke2 or 22 Kd2 can connect rooks after the N for B trade. If 22 Ke2 then simply 22 ... Nxf4+ takes that important N post for black...",
        "22. Kd2": "...so he moves to d2 instead",
        "22... Nxc1": "Now the N for B trade to connect white's rooks; which rook takes?",
        "23. Raxc1": "And white obviously took from a1",
        "23... f5": "My pawn structure is still intact and still looks stormy, and I still have ... d4 on my agenda.",
        "24. Rhg1": "Now white develops the other rook to g1",
        "24... d4": "Perfect time to play 24 ... d4",
        "25. c4": "White elects not to trade on d4",
        "25... Rhe8": "Yet another important move on my agenda",
        "26. cxb5": "Because a R is patrolling the c-file, I cannot play ... cxb5, be it now or on black's move 27",
        "26... e3+": "So I went for a check first, hoping to move white's K to the c-file; if 27 Kc2 then 27 ... cxb5 becomes playable",
        "27. Kd3": "Of course white doesn't want that",
        "27... exf2": "Threatening promotion to queen; white needs to prevent that by moving the R...",
        "28. Rxc6+": "Of course he Checks first...",
        "28... Kb7 29. Rc8": "Now the promotion comes at a cost of trading rooks; 29 ... fxg1Q 30 Rxd8 Rxd8",
        "29... Rdxc8": "So I chose not to promote yet",
        "30. bxa6+": "Check again",
        "30... Kxa6 31. Rh1": "Now that white is out of checks, the rook needs to move",
        "31... Re3+ 32. Kd2 g5": "If fxg5 then simply ... Rg8 followed by ... Rxg5",
        "33. Nc2": "Forking d4 and e3",
        "33... Re4": "My natural response",
        "34. Nb4+": "Taunting the king to advance",
        "34... Kb5 35. a4+ Kxb4 36. fxg5": "Now I can play...",
        "36... Rg8": "...this, allowing ... Rxg5 to be played",
        "37. Kd3 Re3+": "I Check first",
        "38. Kd2 Rxg5": "Now this can be played",
        "39. a5 Rxg2": "Threatening ... f1Q# (or ... f1R#)",
        "40. Rf1": "Correct white response",
        "40... Kxa5": "Now Kxa5",
        "41. Ra1+": "Series of spite Checks, knowing black has this game in the bag",
        "41... Kb4 42. Ra4+ Kxa4 43. b3+ Kxb3 44. h4": "Now that white has run out of Checks, it's game over!",
        "44... f1=Q#": ""
    },
    "url": "https://gameknot.com/annotation.pl/clubhouse-games-ds-chess-game?gm=42514",
    "gameName": "Clubhouse Games DS chess game",
    "players": "CPU (hard) vs. pika25 ",
    "opening": "Amsterdam attack (A00)"
}