{
    "moves": {
        "1. e4": "So, I start off with my usual.",
        "1... e6": "Now, in the past he had questions about the French Defense.  So, I told him that this is that Defense.  @hiredgun112: The variation for the French is 1.e4, e6.",
        "2. d4": "And, I told him that this is the most common response to that defense, and he said ok.  @hiredgun112: In general, 2.d4 is most often played when black only his pawn one square on the first move.  So, for example, the most response for the Caro Kann, which is 1.e4, c6 is 2.d4.  The logic behind this is that it opens up other lines and variations, for an attack.",
        "2... Nf6": "This is a standard and developing move.  Note: I will not say anything else, unless my student has questions or makes a mistake.  The idea behind this is that you don't want to over coach because it might cause you to make a suggestion which would actually be a mistake, as I learned the hard way when I mentored someone.",
        "3. Bg5": "The only thing, which is a common move, btw, is that black now has to face a N pin.  Of course, it's not a big deal, if he finds the right move.  ",
        "3... d5": "I understand black's intentions, at this point.  Normally, this would be an ideal move, and it also develops a central pawn, which is just as important as developing a piece for central control.  The only problem here is that this move makes my pin quite serious.  At this point, he has two options.  His first is not a bad way to break the pin, and the move would be 3...h6, and afterwards this would happen.  4.Bh4, g5 5.Bg3 which does lose tempo for white.  But, the problem is that after the retreats, black is still not completely developed.  So, best was 3...Be7, which is actually the most common way to break this kind of pin, since it also develops another piece, at the same time.  But, because of this move, I am going to attack his N, so black is only going to have one way to defend it.",
        "4. e5 Be7": "?? Now, he decides to break the pin.  But, as I pointed out, this is a blunder.  In that I told said, I understand your intentions because it breaks the pin. In this position, however, best was 4...h6, and that also breaks the pin. The reason being is that was the only way to keep things safe and even because after that, I have two choices. Either, I exchange your N for my bishop, so 4.Bxf6 4...Bxf6 or 4...gxf6. Or, if I don't want to exchange, I could retreat back, so after 4...h6, then this would happen. 5.Bh4, g5, Bg3, and everything is safe.  That's because this move loses a piece for a pawn  And, I also stated that it illustrates just how an important a position is because, believe it or not, what you just played would have been best a move earlier. So, the lesson here is that what was or might have been good a move earlier is bad only one move later. And, that where there's more to a story then meets the eye.  In other words, \"Be a spectator of your game.\"  In other words, look at the entire board, and not just one or two things.  ",
        "5. exf6 gxf6 6. Bxf6": "?? This is a blunder on my part.  What happened here is that I got distracted because I just started a consultation thread in the Alt Chess Club which is similar and the same idea as ION's Group I Consultation thread in the, \"Walking the Walk and Learning How to Run\" forum.  And, some of my quizzes involved quizzes from GM Judit Polgar, in which I've annotated a couple of her past games.  Between this and there, I got distracted and made a mistake.  So, black finds that error by retacking.  But, in a private message, I used the FEN Notation to show what would have happened, had I not taken.",
        "6... Bxf6 7. Nf3": "In the meantime, I decide to continue developing, with the idea being that I will soon be able to castle K side.",
        "7... Bd7": "He also decides to develop.  The problem, however, is that this move crams his LSB.  He got it out, but there's not a lot of space to maneuver.  The thing is that mobility becomes a problem since there won't be a whole lot of movement with his LSB, and mobility is one of the most important aspects of chess.",
        "8. Bd3": "Having said that, I'm still continuing to develop and am planning to castle.  One way of doing so is by bringing my bishop into play.",
        "8... Be7": "I don't know why he played this.  But, @hiredgun112: Best was 8...Nc6, completing development without putting your N on the rim.  The idea being is that, in general as a guideline, it's not a good idea to move the same piece twice, in the beginning.  That's because, instead, you can use that time to develop, but moving something more then once gives your opponent the opportunity to continue with development, on his or her next move.",
        "9. O-O": "Having said that, now I decide to castle, here, which I had planned for two moves.",
        "9... c5": "While it's not all that bad, black plays with the idea being to force an exchange.  And, I'm about to accept it which doesn't affect the game, in any way, since material level is even.  The only thing is, that better is still the immediate ...Nc6 for development.",
        "10. dxc5 Bxc5 11. Ne5": "While it is generally better to use time to develop, as opposed to, moving the same piece more then once, it's just as important to think and plan ahead.  And, here that is what I was trying teach my student.  I have, in the next few moves, but the plan isn't to trick, like you'd normally see with any regular cheapo tactics.  But, the idea behind this cheapo or straightforward threat, as you'd call it, is to quiz him.  What I like to do is quiz my students by making threats, most which are pretty easy to drive off.  The reason that I do this is to teach them the importance of being your own spectator and thinking ahead.  Like do you see that threat?  I got this idea mainly from those quizzes by GM Judit Polgar where she'll quiz her viewers to make sure that they really understand the positions.  Now, those quizzes have helped me and a few of her viewers to make significant improvements which is how you know that she's a very good coach and mentor, despite not playing against her.  Well, the same idea applies here but it actually involves a real active game.  And, the good news is that he is going to pass with flying colors.  It starts off with this move, and in it, he says, \"See the hole in the fence always makes me nervous.And my left to me feels vulnerable.Going to move rook to g8 next.Been taught open ground that is not properly covered can turn into \"deadly\" ground\".  So, I respond by saying, lets see how that plays out. That move should work, but the idea is, \"Don't get nervous\", as my coach would say. But, I like your thinking, and the idea is to focus and concentrate on the positions.",
        "11... Ba4": "! Good move.  This time, however, castling is a bad idea because it would lead to mate shortly after 12.Qh5.  However, that is something that I'll play but because of this choice I don't have a chance to mate him.  This makes me proud of hiredgun112.  While this is not the real quiz, and the real deal comes on my next move, btw, it's a small but important part, which he sees ahead.  This is my goal.  In other words, my intention to teach him to think and plan several moves ahead.  I know how difficult it really is, but putting a student in a situation like this often makes this lesson fun to learn.  And, I like to make learning a fun and enjoyable experience.",
        "12. Qh5": "But, this move is the real quiz.  And, black accurately sees that with this mating threat, 12...Rg8?? will not work.",
        "12... Rf8": "And, he found the correct move.  In it, I said, correct.  BTW, the thing about this move is that it was a quiz, which you passed with flying color because any other move would lead to mate. Note: One way in which I teach is by quizzing students. Here, I do that by creating a threat which is generally difficult to defend against. The idea is to get one thinking to make him or her think because that's extremely important in chess and in life. The more you think about a situation, the better off you'll be in a game.",
        "13. Nc3": "So, after the quiz, I finally decide to bring my last piece and complete development.  But, there's one move that I should have made first.  Better was to take his pawn with 13.Qxh7.  Of course, I overlooked that, but my idea here is to show black what the minor pieces can do, in a game.  Note: It's still not too late for him to develop his remaining N.",
        "13... Bd4": "?? This is a blunder, which I forgot to bring out.  @hiredgun112: That's because this move loses a piece because if you take back, you'll find your position in serious trouble, in the next few moves.  Best, was 13...Bd7, so that if 14.Nxd7, you can take back with 14...Nxd7, and it's just an even exchange (meaning: that everything is still even).  But, with this move, I win a piece, and this time, there's no compensation.",
        "14. Nxa4 Qa5": "Of course, black is hoping and attempting to win my N.  This time, I will allow it, with the idea being that if he takes I get a couple of pawns, after placing him in check.  What I overlooked, however, is his f8 R, so letting him take is actually a mistake, as it would allow him to compensate for a lost piece.",
        "15. Rae1": "So, I decide to bring my N into action.  Now, taking on a4, would be a mistake because if, 15...Qxa4? this would happen, 16.Qxh7.  And, on my next move, the plan would be to play Nxf7, with the idea being that if he then responds with ...Rxf7, I put him in a nasty check with a mating sequence several moves after Qh8+.",
        "15... Ke7": "?? In this position, best was bring his remaining N out, even though it means he'd have to exchange when behind.  The problem with this move, is that it exposes his K. Because of this move, I am planning to find a mating sequence in the next move, so this move might cost him the game.  My idea is to illustrate why it's a bad to expose your K.",
        "16. Qg5+": "My plan starts with this move.",
        "16... f6": "As I expected.  Normally, this would be a problem for me since my N and Q is attacked.  But, I already anticipated this for about 2-3 moves, and now that he attacked my Q and N I know how to get out of that, and that is by placing him back in check.",
        "17. Qg7+ Rf7": "?? Normally, this is an ideal, so I wouldn't play it, normally.  But, what's normally good is a very serious blunder, here.  In that, he accurately said, \"DANG fell for that.should went Ke7-Ke8\".  And, my response was, That's what I would have said, to. Normally, this move would be ideal because it usually attacks the Q, so that black would have more time to develop attacks against the Q. But, in this position, best was 17...Ke8. Another option was also 17...Kd6, but that move would not be much better because it leaves the K exposed. This move, however, loses the R. The lesson here is that what might appear good can be bad. So, you don't if a move is good, unless you know what makes it good. That's the reason that why is the most common chess question.  ",
        "18. Qxf7+ Kd6": "His only other option was 18...Kd8, and that move would have been a little better to alleviate his exposure.  Although, either way, his K is pretty exposed, no matter how you slice it.  And, this is the move that I had anticipated.",
        "19. Qxf6": "! So, I take a pawn and while it looks like a blunder because it should give him compensation, this move is good, believe it or not.  Stay tuned.",
        "19... Qxa4": "?? Now, this move looks good and is a common response, but for strategical reasons, this move is quite bad.  In fact, this is his losing blunder as it will allow me to mate, in the next several moves.  In that, I told him that, In this case, \"To take is a mistake\". That's not true now, and it looks like I blundered, in this position. But, as noted earlier, there's always more to a story then meets the eye. And, white does have plans. The idea is to think ahead, and this is extremely difficult, as I know from experience. But, it's very important to try, and thinking is not only important in chess, but it's also important in life.  That's because my plan is to mate him, and this move will enable me to do just that.",
        "20. Nf7+": "!! So, the plan starts here.  And, no matter where he moves, I have a mating sequence.  This time, however, instead of what I'd normally do, I'm following elyhim's and realjimfrior's plan.  That, when a student makes a this kind of error, it's better to just go for it, as opposed to, show lienency.  That's because, he or she won't learn, if you just give them another chance because it's about playing based on your reflection.  That's especially true here because, as it turns out, hiredgun112 is going to play in a tourney.  And, in a chess tournament, the opponents are not going to show lienency, if you make an error.  So, this is good preparation for that.",
        "20... Kc5": "In this position, his only other option was 20...Kc7, but I'm still going to place him in check, with my next move.  And, this how I would have done even if he had played Kc7, instead.",
        "21. Qe7+ Kb6": "His only other option was 21...Kc7, but that would immediately lead to mate, after 22.Rxe6#.  This move, however, keeps him in the game for one more move.",
        "22. Qd8+": "My initial goal, in this position, was to play 22.Rxe6+ and then 22...Ka5 would be forced.  My idea was then to win his and b pawn with 23.Qxb7.  But, I overlooked something, before I even played that, which is why I didn't.  If, instead, 22.Rxe6, black can defend 22...Nc6, not only developing his last piece.  But, he would have a chance of counter play.  Well, this was something that I wasn't going to allow because, as noted earlier, he signed for an OTB tourney.  And, people do not show mercy in that tournament.  So, I was preparing him for that moment, and had I allowed him to defend with his N, that would have defeated the purpose as it shows him mercy and liency, which wouldn't do him any favors.  But, with this move, white is going mate in one more move, and there is no way around that.",
        "22... Kc5": "In this position, black only had one other option 22...Kc6.  No matter how you slice it, however, white now has a mate in one, and it is with the exact same move, 23.Qd6#.",
        "23. Qd6#": "After this game, I gave my student a summary of the lessons for this game in a PM.  So, as to speak, I summed it up.  @hiredgun112: The moral is to, \"Be a spectator of your game\", develop all of your pieces early, that what looks good might be bad so think before you make a move and look at the consequences of your decisions, try and study the positions, look at the big picture, and think steps ahead.  If you can remember these lessons, I think that your rating will easily hit 1100."
    },
    "url": "https://gameknot.com/annotation.pl/coaching-game?gm=53849",
    "gameName": "Coaching Game",
    "players": "jkarp (1261) vs. hiredgun112 (1009)",
    "opening": "French defence (C00)"
}