{
    "moves": {
        "1. e4": "So, I start with my usual.",
        "1... Nf6": "I was surprised to see him respond with the Reti Defense.  The most common move is 1..e5 or 1...c5  However, there is nothing wrong with what Mike played.  And, I view it as in book, as he is developing, whilst, threatening e4.",
        "2. Nc3": "So, I develop and protect.",
        "2... e6": "Now, we have a similar position to what we see in the French Defense.  The only reason it hasn't transposed into that is because you don't see Nc3.  But, the other moves are part of it.",
        "3. d4": "However, I am using the same methods that I'd use in the Caro Kann and French.  As the idea is that, in the opening, when black only advances one square, white should answer with d4.",
        "3... Bb4": "Pinning my Nc3 and going after my e4, in the process.  The threat is 4...Bxc3, 5.bxc3, Nxe4, and without my N, he'd get a pawn.",
        "4. Bd3": "Believe it or not, I came close to making that mistake.  That's because, I was inclined to break the pin with 4.Bd2  But, after my blunder against knightrider62 (when mentoring her), I wasn't going to make the same mistake here.  The idea being is that you shouldn't give your student an early advance, as kenneth_fiore_3 pointed out when annotating my training sessions with Mary and Gus.",
        "4... Nc6": "Not surprised to see this, as Mike is not only continuing to develop, but he is threatening my d4 pawn in the process.",
        "5. Be3": "So, I continue my development, whilst, protecting that pawn.",
        "5... e5": "Still going after that pawn.  I, initially, thought that I could get a free pawn with 6.dxe5, and was, therefore, going to tell Mike that he made a mistake.  But, that was, when visualizing the position at work.  However, when going back to the computer and analyzing, I realized that he would get the pawn back, immediately.  As a result, I did not say anything, as he hasn't made a mistake, so far.",
        "6. d5": "Knowing that e5 was safe, I did not feel like exchanging as this could benefit him.  The idea is the same of not giving your student an early advantage.  So, I hit his Nc6.  The idea now is to force black to waist tempo.  And, since everything's safe, that's when I'll use that time to break the pin since his Bb4 can get quite nasty.  Although it's not an immediate concern, I wasn't going to chance for the same reason that I noted, with how a different student won a piece for a pawn.",
        "6... Nd4 7. Bd2 c6": "Like before, he is going after my pawn.  But, this time, I allow it since I don't lose anything.  In fact, I'll take because I anticipate that he'll take back.  And, if Mike does, that's I'll respond with 9.Nf3, or 9.Nge2, so that, I can castle on the next move.",
        "8. dxc6 O-O": "? This, however, is Mike's first mistake.  In it, I said, You are playing very well, so far. And, normally, it is a good idea to castle because of K safety. The only problem is that this loses a pawn. Instead, was to retake on c6, as it would become an even exchange. Afterwhich, castling would be ideal.  Then, due to a grammatical error, I changed it.  Therefore, edited and said that better was to take on c6.  Later on, he said, \"I didn't see your messages. Thanks for the tip. What's the number of the move you're referring to?\"  So, I responded by telling that I was alluding to 8...0-0  What is meant is when he decided to castle, as opposed to, take back. ",
        "9. cxd7": "In order to keep my advantage, I take another pawn.  Now, I had a very difficult time deciding between here, or on b7.  So, variations were being calculated, and I did some visualization at work, but mainly, at spin class.  Then, I came back and did more.  After further studying, I thought that I would (in the long run) get further by playing this.",
        "9... Bxd7": "He takes back.  However, what made me reach the decision is where the bishop is now placed.  Had, I played 9.cxb7, after 9...Bxb7, I felt that his LSB would be better placed since it's generally good on it's longest diagonal.  Therefore, I was determined to take that option away from Mike.",
        "10. Nge2": "Completing my development and preparing to castle.  Although, I don't like my N being crammed, and thus, considered 10.Nf3 (especially with Jack saying that the players who aren't as strong often prefer when they're opponent's play this, the difference is that it gives my Nc3 added protection.  I analyzed 10.Nf3, Nxf3 11.Qxf3, or 11.gxf3, but now if 11...Bxc3, I must take back with my DSB.  By playing this, however, I would be able to recapture with my N, and I feel that my Knight is worth more then a Bishop, in this position.",
        "10... Bg4": "! By pinning my Ne2, if he takes on c3, I'm forced to recapture with my Bd2.  Luckily, that does not happen.   ",
        "11. O-O": "But, before we exchange, I castle, at once.",
        "11... Nxe2+ 12. Bxe2 Bxe2 13. Qxe2 Rc8": "Adding pressure to my Nc3.",
        "14. a3": "But, I get out of it by putting pressure onto his B.",
        "14... Nxe4": "?? Joe: ?? While it looks good, this move is a blunder because, although you got the pawn back, it'll cost you a piece with my next move. Best was 14...Bxc3, and if 15.Bxc3 it's an even exchange, as taking back with the R would be a blunder due my b2 pawn.  Mike:  I considered that. I Couldn't decide whether to take your knight with the bishop.  Joe: Except, that I can grab it first. This is good for improvement because I've noticed this in some of your games. It's easy to grab material, when you can. But, it is also important, however, to look at the big picture and see how the opponent can respond. So, the use of analyze is the board, and if it shows that capturing a pawn will lose something worth more, it's better not to take, right away.  Mike: Thank you  Joe: You're welcome. In fact, that's what we're here for.  By what we're here for, what I'm alluding is that we're here to learn.  Therefore, this lesson is going to help Mike to learn from his mistakes.  ",
        "15. Qxe4": "I had a hard time deciding between 15.Nxe4, 15.axb4, or this move.  But, as with the other moves, he is still going to take back with 15...Qxd2  The only difference was that afterwards, with anyelse, I'd be forced to take back with my Q.  After that, he'd be able to equalize with 16...Bxd2  So, by playing this, not only have I won material, but Mike will not be able to recompensate.  And, I will further liquidate.",
        "15... Qxd2 16. Qxb4 b6": "Protecting b6.",
        "17. Rfd1": "So, I go after his Q.",
        "17... Rfd8": "?? Joe: This, however, is a super blunder, as it's going to lose your Q for a R. Best was, 17...Qxc2, and this would be it's best follow up, afterwards. 18.Nd5, Rfe8 19.Ne7+, Kh8 After this, you don't lose anything else, right away.  So, the lesson there is to be aware of all threats, including captures. If a move will result in something worse, it's better not to play it.  Mike: Took the room. Looked like a free peice Rook  I feel stuck with Alan Fitzgerald. My bishop is stuck with nowhere to go  Joe: The thing to keep in mind is what's en-prise or hanging. That's why it's important to use analyze the board, as opposed to, making assumptions. Don't assume anything, or as my coach would say, \"Start thinking.\" Always keep in mind on how the opponent respond.  Mike: I'm confused by that;seems like I'm cheating  Joe: You're not. What I mean is what's being attacked. For example, your Q on d2 was attacked by my R. So, it's important to figure out what's being threatened, or what your opponent is threatening to do. The idea being that overlooking the these threats can get you in trouble.",
        "18. Rxd2 Rxd2 19. Rc1": "Protecting c2 with as the idea is to prevent my student from recompensating.",
        "19... Rcd8": "So, he doubles up on one file.  This is known to be dangerous. ",
        "20. g3": "With that being said, it appears that he was threatening mate.  What came to mind was that if 20.Nb5 (which I was planning to play), 20...Rd1+, 21.Rxd1, Rxd1+ 22.Qe1, Rxe1#  Therefore, I played this because Jack has said that when your opponent threatens a back rank mate, that is generally when you want to open up.  The idea is to, \"Give your King air to breathe\", as he puts it.  However, after trying to create a chess puzzle, I realize that it doesn't have to end in mate.  But, he would get some recompensation and, as I'd be force to give up my Q, to prevent mate.  So, after 20...Rd1+, 21.Qe1, but then, he has 21...Rxe1+, and after 22.Rxe1, he has recompensated for lost material.  So, I think I still made the right choice, to prevent this.",
        "20... Rc8": "At first, I wasn't sure why Mike played this.  But, then, it appears that he was trying to get a pawn back.  The idea being is that, if, for example, 21.Ne4, 21...Rdxc2, followed by, 22.Rxc2, he has 22...Rxc2, getting back a pawn.",
        "21. Nb5": "? I thought that this move prevented that, as now, I'm thinking along the lines of 21...Rdxc2, 22.Nxa7, Rxc1+ (which I forgot was check, due to something I abhor, which involves reversing the colors and a terrible oversight), so 23.Nxc8  But, with me being in check, I'd be forced to play 23.Kg2  So, the move wasn't just a mistake, but my thought process was completely wrong because, it could've allowed him to win back a Rook.  And, as TA points out, one can draw with a Queen and Two Rooks.  The difference is that I'd be a piece up, but even so, I think he'd able to draw, with best play.   ",
        "21... Rdd8": "? However, Mike played this, instead.  So, I said, I understand that protecting the Rook was important. But, you also could've protected the a7 square. With that being said, 21...Rd7! was best, as now, not only don't you lose the R, but a7 is safe. This move, however, loses another pawn.  Mike:  I was confused.  Trying to keep the king safe  Joe: Sorry. What I'm saying is that it's good to protect material. But, when protecting, you also want to ask yourself what else could be protected. For example, you could've protected the R, as well as, the a7 pawn.  Edit, @pagmatic68: I made a mistake here.  There is actually something better then 21...Rd7  With that being said, best was 21...Rdxc2! which would've won back a pawn due to the variations I provided a move ago.",
        "22. Nxa7 Rd4": "? I forgot to mention this, but @pagmatic68: While it looks good, this is also a mistake, as now, I win back a pawn.  Best was 22...Rb8, as it does more then just protect your pawn.  In addition, my threat against your Rook would be gone because I can't fork with 23.Nc6, as my Q is still attacked.  Therefore, my next move would be something like 23.Qb3  So, I'd have to run back, and then (after retreating) you'd be able to answer with 23...Rd7, which would force me to retreat, again.  Therefore, although ahead, you'd get some compensation by gaining two tempii, and tempo is also very important.",
        "23. Qxb6 g5": "?? Having had missed the opportunity to take his Rook on my last move, I wasn't going to overlook it, this time.  Now, I was threatening an eventual back rank mate.  But, it wasn't immediate, as there was somethingelse which was.  Joe: ?? Although this keeps the K safe, the problem is that this move loses a R. Best was 23...Rf8, as now the R is protected. And, after that 24...g5 would be an option.  Mike: I'm at the point that I'm not sure what to do? Not going to resign  Joe: Although they do consider it a resignable position, I think you're making the right choice. Yes, by staying in, there is more to learn. As Judit Polgar would say, \"Fight til the End.\"  The reality is that I do think that black should resign, soon, but not quite yet.  The idea being is that I told a different student the same thing about not resigning, after losing material.  Although Erika didn't lose her Q, everything else was the same, and point wise, she was further behind.  Yet, after opponent made mistakes, she pulled a swindle and won a hopelessly lost position.  So, I am trying to get this student in that habbit.  And, I was also worried that telling Mike to resign would make him feel rushed.  The one thing I don't want to do is make my students feel rushed because taking your time to concentrate is very important.    ",
        "24. Nxc8 e4": "?? With that being said, I help him out a little more since that's what training is about.  So, I said, However, I still think that giving advice is a good idea, as that's what here for. With that being said, almost any other move was better then this. The reason being was that your e pawn protected the Rook. By playing this, I take it.  After this, however, I don't say anything else, until after the game.  That's because with this blunder, Mike does not have any more good moves, left.  I also want him to realize, (at his own accord without me getting involved) that the position is hopelessly lost with no counterplay.  In seeing this, he will, at some point, resign without feeling rushed into doing so which is how I want it to be. ",
        "25. Qxd4 g4": "So, Mike plays this.  But, I will grab another pawn.  Better was 25...f5, but as noted, nothing will help any more.",
        "26. Qxe4 Kf8": "I'm not sure why he played this.  But, his h7 or g4 pawn could've been protected with 26...h5  However, I would answer with 27.Qe8+, and after 27...Kg7, 28.Ne7, followed by 29.Qg7+, and I believe that mate would be unavoidable.  Even if I couldn't mate immediately, I think that white still has an inevitable mating sequence.",
        "27. Qxh7 Ke8": "Preventing the immediate 28.Qh8#",
        "28. Rd1": "But, it's too late.  The reason being is that I will mate, one way or another, at this point.  If his monarch remains on e1, or goes to f1, I will mate with 29.Qh8#  If however, he advances his f7 pawn, I'll still mate with 29.Qe7#  So, either way, I have a mate in one.  I meant to tell him right away, but got busy with my work schedule.  However, I pm's him, yesterday.  And, I said, I've been meaning to go over it with you, but as I was busy yesterday and today, there wasn't much time to do it. But, the main lessons to learn are to look at and analyze each move before making them. That is, not playing something because it appears good.  With that being said, also look out for threats made by your opponent.  Remembering that will help you to improve your games."
    },
    "url": "https://gameknot.com/annotation.pl/coaching-game?gm=60230",
    "gameName": "Coaching Game",
    "players": "jkarp (1347) vs. pagmatic68 (834)",
    "opening": "Alekhine's defence (B02), Scandinavian variation"
}