{
    "moves": {
        "1. d4": "Sue and Ken discussed what to play because when you're playing with him, the agreement is that you discuss every move before playing, similar to what I had in the last unrated training game with a different teacher.  Now, Sue is more used to 1.e4, which makes this move, \"the more educational approach\", as Ken puts it.",
        "1... g6": "Just like with what I had against Ken, it will be become the KID.  But, this teacher deviates, slightly, from the mainlines.  Instead of started off with 1...d6, he fianchettos first.  But, then he plays the other moves, there just transposed, as it's followed with 2...Bg7, and then, 3...d6, just like our game.",
        "2. c4 Bg7 3. Nc3 d6 4. g3": "Of course, Sue is playing a good move.  But, as white, however, I would've fianchettoed on the other side.  In other words, I would've played 4.b3 because Ken and discussed it, and he implied that it was the most common, when playing against the KID.  On the other hand, I like her intentions which is to develop her Ng1 and castle, right afterwards.",
        "4... Nc6": "I was surprised to see Ken play this.  Afterall, he didn't advance the e pawn, but ...d6 was played, as part of the KID, which I noted earlier.  But, in that situation, it's said that you shouldn't bring the Knight to that square, until the c pawn has advanced two squares.  That makes it interesting as there is theory involved since that's what the teacher did.",
        "5. Bg2": "? As noted earlier, she's preparing to castle here.  However, this is mistimed, as Sue will go down a pawn.  This would've been later on, as better would've been 5.e3, but even stronger then that was 5.Nf3 which also develops.  The best move, however, would've been 5.d5 which attacks the N, and when he retreats that's when Sue would be able to bring her Bf1-b2 and remain safe.",
        "5... Nxd4 6. Nf3": "She continues with her development, but the problem is that Ken will liquidate as he is a pawn up.  So, better might have been 6.e3 which is how I would've responded, and when black retreats, 7.Nge2 would've been possible which still allows white to castle.  ",
        "6... Nxf3+ 7. Bxf3 c6": "I'm not sure why Ken played this.  I'm not critisizing but am interested in this move because I would've played 7...Nf6 which he'll play next.  Also, bringing my Bc8 into play, were I black, would've come into consideration. ",
        "8. O-O": "Not to my surprise, Sue castles, at once.",
        "8... Nf6": "The idea being is that Ken is continuing with his development.  But, as noted, I would've played this, a move earlier.",
        "9. Bd2": "Completing her development.",
        "9... O-O": "And, not to my surprise, Ken castles.",
        "10. Qc1": "Adding protection to her Queen.  Now, I know that there was conversation because as noted, moves need to be discussed.  As white, I would've played 10.Qc2, or 10.Qb3 to connect the Rooks.  But, there is something going on with the Bd2.  It's not in danger, but I quickly pick up on it that she wants to exchange.  I know how your feeling Sue as that's how I felt with Ken in our game, but there is something to learn which also happened to me.  After what I learned this was still problematic until I spoke to GM Susan Polgar and found what there is to learn with exchanges.  And, for Ken, I am going to borrow that book, probably, when I go away again.  It might even be in as early as a month.",
        "10... Bf5": "Completing his development.",
        "11. Bh6": "This is where I figure out that Sue wanted to exchange.  However, unlike our game, Ken accepts.  So, that desire is wrong, knightrider62, and I'll explain what I learned Susan Polgar on your next move.",
        "11... Qa5": "I'm not exactly sure why Ken played this, but my guess is to put pressure, in case, Sue takes his Bg7.",
        "12. Bxg7": "?! Which she does.  Now, I asked GM Susan Polgar when to exchange since that impulsiveness was still there, even after coaching with Ken.  In other words, it didn't go away.  And, not knowing when to do it, I'd just more often then not go for it and exchanged which was the first inaccuracy.  One time, though, I didn't and held off, after which, I lost since the best way to go would've been to exchange.  All of this is important Sue, as that's why I asked her.  And, she said, \"When to exchange and when not to is a complex topic and even Grandmasters at times misjudge it. \n\n\n\"Generally, ones judgement improves with experience. But in the meantime here are some guidelines to follow:\n\n\nTrade if it leads to some kind of material or positional gain \nTrade pieces (and especially Queens) when (your King is) under attack\nTrade a passive piece for an active one\nTrade Knight for Bishop\"  We do know, though, that there are times where Bishop must be exchanged for N, but aside from that, I completely agree with everything else.  With that being said, the issue is that, your Bh6 was more active then his Bg7.  So, exchanging, in this case, helped him out.\n  ",
        "12... Kxg7 13. Qd2": "And, now, Sue connects her Rooks.",
        "13... Rad8": "So, he centralizes one of his Rooks.",
        "14. Rad1": "As does Sue.  Of more significance, by my book is that the Rook is right behind her Queen which plays an important role.",
        "14... h5": "Getting a solid pawn chain with this move.  The only negative is that it appears that Ken's monarch is, potentially, vulnerable.  Since two of the pawns right near it are open, and we're not in the endgame.  Now, I went wrong by doing something, somewhat similar against Jack Stockel.  In my case, I got extremely impulsive.  That was, even more so then in a chess excercise which I wouldn't have been to solve.  It was figuring out how to win.  Now, the simple answer was a fork.  But, I was supposed to calculate variations of what it could do.  Well, I gave one variation and was asked something like, \"don't you think the N can get out.\"  It could before I gave up, not being able to figure our how it won the piece.  So, I got the answer right but for the wrong reason.  Trying to apply something there, I became extremely impulsive against Jack and, thus, acted on impulse which is a big no no as that way, you don't think about the position.  I decided to kick the N, similar to the previous excercise, I figured that it can't get out.  I missed one move, in which it did.  Once that happened, white was busted because my monarch was badly exposed which, from there, things were going to go downhill.  In fact, I got mated 8 moves later because of that.  What I learned overtime, which I taught a student was not to act on impulse.  Now that position looks, somewhat, similar to what I'm seeing now after ...g6, followed by, this move.  Of course, it doesn't mean anything here but I'm making a direct comparison since, in general, that slows down and has inhibited the implusiveness that I've been feeling.  As I'd be afraid to play this move for the reason mentioned.  Given that it's not an endgame, on top of it, I would've held off but would've played something like 14...Rfe8 to centralize the other Rook.",
        "15. Rfe1": "With that being said, though, I'm not surprised that Sue played this as this what I, most likely, would've done, as well.",
        "15... h4": "For the same reason, I have no idea why Ken played this.  I was thinking that, maybe, he wanted to get a passed pawn as it could be strategy.  But, that be if white only had the g pawn.  With her other pawns, however, I've ruled it out, so I'm not sure but am interested in Ken's thought process here.",
        "16. Kg2": "Contrary, however, I would've played this since there seems to be added protection against the h4 pawn.",
        "16... Qc5": "Unlike before, I know what Ken wants here which is her c4.",
        "17. b3": "And, Sue protects.",
        "17... Rfh8": "So, moving the g pawn which is right near the monarch still doesn't make sense, but moving the h pawn now does.  As now, he's adding another defender to his h pawn.  It's more typical when one has castled Q side, but we also see it when both sides castle short, just as not as often.  With that being said, it works here.",
        "18. e4": "I also would've also played this.  As now he retreats which will allow Susan to start her plan of doubling up with her Rooks.",
        "18... Be6 19. Re2 Qe5": "Adding pressure to Sue's pawns.",
        "20. Rde1": "But, Sue doubles up, anyway, which will allow him to exchange pawns.  I don't think it's the right choice because, after you exchange pawns, her monarch will become, as we'll see when plays 21...Rh3.  ",
        "20... hxg3 21. fxg3 Rh3 22. Kf1": "Trying to do undue some of the pressure, Sue moves back.  And, I also would've played this for the exact same reason, coincidentally.",
        "22... Bg4": "But, seeing this move is where I find out that I'm wrong.  As now, \"The pressure stays on\", as Ken told me in our game.  That's because he's threatening to win a piece, and when Sue protects, he'll further liquidate.",
        "23. Rf2 Bxf3 24. Rxf3 Ng4": "Next, Ken adds another attacker.  It might not look like much, but Sue is faced with more pressure against the monarch not to mention that her h2 is now attacked twice, somewhat similar to my last training game with her.",
        "25. Re2 Rdh8": "Once again, the pressure remains.  What that means is that, once Ken puts pressure on you, he'll ascertain that it stays in.  The idea behind this is preventing counterplay because, if you have the initiative, and let the student get it back they won't learn as much.  That's why when I, at one point, seemed happy when I coached Gus, Ken said that I shouldn't be.  I agree because what I didn't know is that, I made mistakes that could've allowed counterplay.  In fact, there was one that could've allowed him to win since I learned that there was a mate in 6 from this commentator.",
        "26. Qd3": "?? I'm not sure why he played this, but it is, in my opinion as now, Ken will more then just another pawn.  Best would've been 26.Kg1 as everything holds since the monarch would not only protect h2.  But, it would also prevent what's coming.",
        "26... Nxh2+": "And, Sue resigns here because, at the very least, Ken is also going to win a Rook for a Knight which isn't nearly enough compensation since she's two pawns down, as is.  Therefore, we can both agree that there's nothing left to learn.  I think that the moral of this story is, when faced with two attackers, try to figure out how to stop both of them.  Also, even when the idea is to develop, it's still a good idea to ask yourself what's being attacked.  As the center pawn was, so developing lost that important pawn.   "
    },
    "url": "https://gameknot.com/annotation.pl/coaching-game-2?gm=61697",
    "gameName": "Coaching Game 2",
    "players": "knightrider62 (1006) vs. kenneth_fiore_3 (2177)",
    "opening": "Beefeater defence (A40)"
}