{
    "moves": {
        "1. d4 Nc6": "Normally, white gets an easy game with 2. d5, but I stuck to my favorite. ",
        "2. Bf4 Nf6 3. d5": "...now that Ne5 can't be played...",
        "3... Nb8": "Sometimes you allow yourself such weak openings (in blitzes) trusting you'll be able to catch up. Not this time!",
        "4. Nf3": "Not c4 at once. I have to keep control of black's dsb, and after e6 and the exchanges...",
        "4... d6": "...but that's another story!",
        "5. c4": "Black can try something on the Qside, but without the dsb it won't be dangerous. ",
        "5... e5": "Expected, of course. ",
        "6. dxe6 e.p. Bxe6 7. e3": "Maybe Qb3 was sharper. ",
        "7... Nbd7": "Qb3 is not good anymore. ",
        "8. Nc3": "Keeping control of the center. ",
        "8... Be7": "Preparing to castle. Yummy and clear game!",
        "9. Bd3 O-O 10. Qc2": "The battery is set...",
        "10... Nb6": "Looking for counterplay based on c5's weakness. But it's too late. ",
        "11. Ng5": "The threat on h7 is \"on\". Black's turn to defend. ",
        "11... h6": "I always welcome this pattern!",
        "12. h4": "There was no time to fully calculate the outcome, but experience tells me that the Nsac will win the game for me!",
        "12... Bxc4": "Nxc4 gives black even less than this. ",
        "13. Bh7+ Kh8": "Ok, now... how to proceed? I feel confortable losing the lsb, but right now, with the BN in f6, I have nothing still...",
        "14. O-O-O": "Better players will tell, but this seemed to me a wonderful move, with lots of prospects. ",
        "14... Be6": "Maybe hoping in NxB, but I won't fall for that. I'll only give black two nice central pawns. ",
        "15. Be5": "...but this is very nice. I think black CAN take the B, since sooner or later one of my other minor pieces will fall, so it'll be two minor pieces and a R for the Q. But who dares?",
        "15... Nbd7": "Excellent move: unpins d6 AND if BxN, a BN will stand forever in f6. So...",
        "16. f4": "Can I give myself a ! for this move? I hope so!",
        "16... Ng4": "Now the game goes another way. You have to sense when it's time to change the path. ",
        "17. Nxe6 fxe6 18. Bxg7+": "I was blinded, thinking the mate was near. But it's not quite so. ",
        "18... Kxg7 19. Qg6+ Kh8": "Time to sac...",
        "20. Qxg4 Nf6 21. Qxe6": "Qf5 defended the B, but after the N goes, my Q gets exposed... not sure. ",
        "21... Kxh7": "How to proceed? A R in g3 would be nice, but I can't get it there.",
        "22. Ne4": "Black's N is to be removed from there...",
        "22... Nxe4 23. Qxe4+ Kg7": "Now, Rh3 is not completely good because of Bxh4. True is that after Rd-h1, black is doomed, but I didn't see it. ",
        "24. f5": "...but played this instead. It defends h4, opens the way for the Q to g4, and controls many near to the BK squares. Was it sound?",
        "24... Bf6": "...setting Re8. A free tempo for me - my Q has places to go to.",
        "25. Rh3 Qe8": "R or Q to check? Difficult to decide on the spot. ",
        "26. Qg4+ Kh7 27. e4": "I know my Q will be kicked, and Rg3 would be a terrible mistake, allowing black to recover the game after R's exchange. With this, I keep everyting in control, since...",
        "27... Rg8 28. Qf3 Qe5 29. Rd2": "...this is a good enough defence!",
        "29... Rg7": "Preparing to double the R's and press on g3 and g2. ",
        "30. g4": "...so this seemed logical. My pawn's phalanx will win the game for me. ",
        "30... Rag8 31. g5": "I'll lose the exchange, but in the process I'll give a check (or mate!), so...",
        "31... Be7": "?? Overwhelmed by threats, black overlooks the following move. (Do you think I mean f6, winning back the piece - but allowing some defence, for instance f6, Rf8? Not at all...)",
        "32. Rd5": "Q is lost - and the game. Even Bd8 - saving the Q was not enough. ",
        "32... Bf8": "I can go Qh5, threatening mate, but black has Re6, and h6 is defended. ",
        "33. Rxe5 dxe5 34. f6": "...probably better than g6+. ",
        "34... Rd7": "?? Rf7 was not much better, after Qf5+ and g6...",
        "35. Qf5+": "As Kenneth told me: too many mistakes by white to be proud of the game, but still... not a bad resut for a coffe-break!"
    },
    "url": "https://gameknot.com/annotation.pl/coffee-break?gm=61077",
    "gameName": "Coffee-break",
    "players": "damafi (1400) vs. boxer091 (1561)",
    "opening": "Queen's pawn (A40), Lundin (Kevitz-Mikenas) defence"
}