{
    "moves": {
        "1. e4 e5 2. Nf3 d6": "The Philidor defense is earning more respect nowadays than 30-40 years ago and it's not a surprise guest at GMs tournaments anymore.",
        "3. d4 Bg4": "Not the best, in fact, I believe I have a personal score of 100% in this line. This is also what was used in the famous Morphy - Count Isouard game, a perfect attacking jewel that will never lose its beauty.",
        "4. dxe5": "Forcing Black to give up the Bishop for the Knight or else lose a pawn.",
        "4... Bxf3 5. Qxf3 dxe5 6. Bc4": "White has a good lead in development and amongst other things is threatening mate on f7. ",
        "6... Qe7": "6...Qd7 is slightly better, but 6...Nf6 is outright bad after which at least 3 of my own games that I can remember went 7. Qb3 Qd7 8. Qxb7 Qc6 9. Bb5",
        "7. Nc3": "Aiming for d5, hitting the Queen.",
        "7... c6": "Covers both d5 and b5 but it's another pawn move and another lag in development.",
        "8. Bg5": "This is one of the reasons why 6...Qd7 is better.",
        "8... f6": "Black has moved nothing but pawns and I have each minor piece, Queen included on a good square. Plus this is an open game. So my next move was something I just had to play.",
        "9. O-O-O": "The dance has begun!",
        "9... fxg5": "The best way to deal with a sacrifice is to accept it.",
        "10. Nd5": "This looks just insane but it's the only move that doesn't concede the initiative to Black.",
        "10... cxd5 11. Bb5+ Nc6 12. exd5 a6 13. dxc6 axb5 14. cxb7": "White is two pieces down but his compensation isn't virtual. The b7 pawn is very strong and the Black monarch is still in trouble.",
        "14... Rb8 15. Qc6+ Kf7 16. Rd7": "A nice conclusion to the storm of sacrifices initiated earlier.",
        "16... Nf6 17. Rxe7+ Bxe7": "Theoretically, material is even, and under different circumstance, White would be the one in trouble but Black has serious problems coordinating his pieces.",
        "18. Qxb5 h6 19. Re1 Bd6 20. Qc6 Rhd8 21. Rd1": "Black is in deep trouble, he can't even exchange a pair of Rooks with 21...Be7 because that will allow Qc8 with devastating effects.",
        "21... Ke6": "Black finds a surprise defender to hold up the position.",
        "22. c4": "The Bishop is pinned and attacked twice. It's dead meat by any standards.",
        "22... Ke7": "Unpinning but also hemming in the Bd6.",
        "23. c5 Ne8 24. cxd6+ Nxd6 25. Qc7+ Ke6 26. Rxd6+": "The last tactical blow and the last straw for Black. He had had enough and resigned here."
    },
    "url": "https://gameknot.com/annotation.pl/coffeehouse-chess?gm=28689",
    "gameName": "Coffeehouse chess",
    "players": "nyctalop  vs. bone1 ",
    "opening": "Philidor's defence (C41)"
}