{
    "moves": {
        "1. d4 Nf6": "Sue told me that she, by mistake, played the KID.  It is the mainline.  I'm also bearing in mind what I've learned from Kenneth_fiore_3.",
        "2. Nf3": "But, it's independent for playing this.  As, this is the mainlines for both.",
        "2... g6 3. e3": "This, however, is where I deviate from what Ken told me.  It turns out that 3.b3 is the main continuation.  The reason for this deviation, however, is because I want to make Sue feel the same way that she would for the KID.  In other words, I don't want her getting overwhelmed that I do something different.  So, by playing it, as though, it were the Colle's System, I think that she'll play better.  In other words, one thing I don't like is putting my students on the spot which I felt would happen if I stuck to the continued with the KID.",
        "3... Bg7": "However, she continues which shows that Sue wouldn't have been taken off guard.",
        "4. b3": "So, I go back to the mainlines of the KID.",
        "4... e6": "Developing and castling.",
        "5. Bb2": "Staying with the mainlines of the KID.",
        "5... d5": "Continuing with her development.",
        "6. Bd3": "So do I.",
        "6... Nbd7": "Same idea.  The only difference is that Sue hasn't advanced her c pawn which would've made 6...Nc6?! an inaccuracy, as we saw in one of her games against archduke_piccolo.",
        "7. O-O": "This is where I take advantage of my opportunity to get my monarch to safety.  But, she is thinking along the same line as she'll also castle.",
        "7... O-O 8. Ba3": "Reconfiguring my DSB.  Forget about what happened in my game against bhidragon.  In that game, it was a mistake because it weakened my K side since he had threats.  But, in the context of how this game is developing, it's not.  First, black does not have any immediate K side attacks on me.  Second, but more importantly, her Rf8 is attacked and is thus, forced to defend, first.  After which, I'll use spend that time to advance my c pawn, as this will enable me to safely play Nc3, later on.  That is, especially once we exchange pawns, where that pawn comes off the board.",
        "8... Re8 9. c4 dxc4 10. bxc4 Nb6": "Redeploying her N.",
        "11. c5": "However, I'm going to treat it like one of the main variations of the French Defense, which I've repedetely about Susan Polgar showing it.  And, as previously noted, we saw that in the longest game that I annotated with TA where he drawed with both of his rooks for the Q.  That's because, after she retreats, that is when I'll complete my development with my Nb1.",
        "11... Nbd7 12. Nc3 e5": "Attempting to control the center with this move.",
        "13. dxe5": "So, I take.",
        "13... Nh5": "?! This is not a mistake, but rather her first inaccuracy.  Now, I wasn't going to say anything because ION said that for coaching, it's better to wait until the student has made a real mistake.  I did mention flawless until this move.  But, this is inaccurate because a Knight on the rim is grim.  With that being said, however, the other reason for not saying too much is due to bhidragon's advice of not thinking too much about those chess quotes.  So, I comment when it's a position wise mistake based on what the board really indicates.  With that being said, I missed a small, but not the overall, picture.  I was debating on what to do with this move.  Do, I attack with 14.g5?? as that appeared to win a N.  Then, I remembered that terrible loss with Jack Stockel and combined it here to see if it worked.  Turns out that Sue could defend that N.  However, a better move would to sac, if I were to play e5.  I calculated a bunch of variations, and if I advanced the g pawn, there's a variation where she would give up to deliver mate by bringing her Queen and Rook.  So, I did not invite attacking forces against this, especially after what happened in my loss, while training a different due to the exposed K.",
        "14. Bc4": "So, I followed TA's method by letting her Nh5 sit there, as it's worth less.  Instead, I go for a bigger picture by pinning the weakest.  Yes, it's always a question of to be or not to be.  And, up to people's surprise, I did because it worked in a different game.  This is not about to change.  Therefore, I ask myself if it works, and sometimes, experiment which is not a good way to go.  Well, it worked in my first game against blitzkov because the mistake happened a move later with a cheapo tactic I attempted which I don't do, anymore.  But, in my first completed game against dynamic_dv it didn't work.  Not sure if it should be done, I just act on instinct since it worked in earlier game, without giving it much thought.  I don't see any damage in trying it here.  I also kept in mind that, one way or another, my e pawn was a goner.  I saw this coming which is why I didn't say anything when Sue advanced her e pawn, and I took.  That's because she could get it back sooner or later, as what happens here.",
        "14... Bxe5 15. Qd5": "?? This, however, is a terrible blunder on my part that ought to have resulted in the loss of a piece.  I was not attempting a mate in a move, as that's too obvious.  Instead, there is another threat afterwards that would be difficult to drive off which is still mate but involving a N+R sac.  I calculated a long line of how.  On the other hand, a more experienced player wouldn't have even considered this move because there was something in that line that would've made it fail.  It goes along with what cplusplus11 and reversion have told me of calculating through those lines.  And, it wound up becoming a Homework question that I gave to Sue.  The only thing I got wrong was where I said flawless with 13...Nh5 being played.  ",
        "15... Kg7": "? Joe: You were flawless, until this move. But, this is your first mistake as it's going to lose a pawn. But, there is a move that I miscalculated in a long line that I was calculating. It was just one move that would've turned things, and you could've won a piece here. What would've been the best move, in this position?  Sue: I think Re6 would have been the best move. My concentration might be off for a while, I lost my Mum three weeks ago and I really miss her, chess is helping me cope with my loss but I find myself gazing up at her photo on the wall whilst playing.  Joe: You will make it through it. I know what that's like because I lost my Uncle about 10 or 15 years ago. And, I've lost people close to me. It's just one of those obstacles which will take a while. But, in that amount of time, the obstacle will be surpassed. Best was 15...Bxc3 I was thinking that I'd then play 16.Ng5, and if 16...Bxa1, 17.Qxf7+, which is mate in two. 17...Kh8 (forced) 18.Qxh7# But, I overlooked that after 16.Ng5, 16...Ndf6 or 16...Nhf6 which stops the mate and leaves me a piece down.  Sue: I thought you meant a move more recently than that. Or did you. I will investigate your chess analysis, when I feel more composed.  The answer is Be5 x Nf3.  Joe: Almost, but it was Be5xNc3.  Sue: That's what I meant got my notation muddied.  Joe: That's ok.  Easy to happen. ",
        "16. Qxf7+ Kh6 17. Nxe5": "Fixing the mistake that I made earlier.  That way, the student doesn't have the chance to win the piece.  It's important to note that Jack Stockel has done the same thing with me.  They weren't quite as easy.  But, after I failed to spot and exploit the mistake, he fixed them to take away that opportunity.  A perfect example was a one move back rank that he let me have.  And, when I failed, he kept his advantage and did not let me mate.",
        "17... Nxe5 18. Qd5": "The only thing is that my Queen and Bc4 were en-prise.  Therefore, this was the only way to defend both, as I studied in a previous annotation.",
        "18... Nxc4": "? It wasn't now, but much later on, I pointed something out important.  It really boils down which is worth more, a N or B which I've had troubled as we saw in charleshiggie's annotation, followed by the ongoing training game with Ken.  ",
        "19. Qxc4 b6 20. Qd5 Qxd5 21. Nxd5": "So, the conversation resumes here.  Joe: After that exchange, I played 18.Qd5, and you answered with 18...Nxc4? I know why as that Bishop did appear menacing. But, my Queen was a bigger danger. Better was to exchange Queens with 18...Qxd5 After which I'd be forced to take back with Bc4 as it was threatened by your Ne5. Were I to recapture with my Nc3, I'd lose a piece. But, by taking my Bc4, followed by 19...b6 black is going to wind up in trouble.  Sue:  I am still not concentrating fully I meant originally to take your queen but forgot that after you had made your move.  Joe: It's ok. Yes, when I had those tragedies, I was very distracting. There was a different instance, in which I was also distracted. I think a good lesson is that when they happen and can control them, it's better to hold off and wait until the concentration comes back. Sometimes that isn't possible, but in those instances, my advice would be to focus on the here and now. I had to learn that the hard way on Friday. That's because the distraction, back then, led to a terrible mistake which instantly lost.  You will note that after getting another pawn, I won't say much anymore because of what ION also noted.  In other words, I follow his method, and he told me you generally don't want to be too critical, when you have the intiative. ",
        "21... Rd8": "Attacking the N.  But, I'm still going to knab her c7.",
        "22. Nxc7 Rb8": "More or less forced.  And, now comes the time where I'll exchange.  The idea being is to keep Sue's Bc8 locked in since one of the things that you don't is your material tied down, like this.  It's not throughout the rest of the game, but for now, it is restricted.",
        "23. cxb6 axb6 24. Rfd1": "As I'm threatening to win her Rook.  But, that wasn't my goal.  In reality, it is accomplished since it was liquidating.  The idea being is to exchange pieces when you're ahead.",
        "24... Rxd1+": "With that being said, better for Sue would've been to move the Rook away from the d file.  As noted, I wasn't going to say anything since I felt that it would be overcritical with the 2 pawn initiative.",
        "25. Rxd1 Bg4": "Attacking my Rook.",
        "26. f3": "In calculating a bunch of variations, I found this to be the best way to defend.  As, not only have I reattacked, but she only has two safe guards.  And, one of them, which is, 26...Bf5 will lead to me reattacking which results in the same thing.",
        "26... Bc8 27. Rd8": "And, that is, Sue's LSB being pinned to her Rb8. ",
        "27... Nf6": "Repositioning her N.  But, there was no way to save, at this point.  Now, that we're in the endgame, had she left on h5, I would've played answered with g4, this time.  Therefore, it would've resulted in the same thing, as her N is coming off the board, sooner or later.",
        "28. Bf8+": "This is the cornerstone as her next move is forced.",
        "28... Kg5": "I thought hard about to what to do, and even, considered placing her in check with 29.f4+.  But, that would've just been for the thrills of it which isn't always the way to go, especially here.",
        "29. Be7": "Therefore, my decision was to play this since it pins her Nf6.",
        "29... h6": "I was a little surprised to see Sue play this.  But, my next move was going to be the same move.  And, it's the same one that I considered earlier as this will win the N.",
        "30. f4+": "At first, however, I considered 30.Bxf6 to further liquidate.  But, I figured out a way to get the N.  ",
        "30... Kf5": "As I anticipated.",
        "31. Rf8": "So, thinking about Susan Polgar's book, \"Chess Tactics for Champions\", I pin again.  This time, however, there is no way out, as I will take it on my next move with check, as it'll win another pawn.",
        "31... h5 32. Rxf6+ Ke4": "But, I hold off on taking that pawn since my e3 is a passer which I want.",
        "33. Kf2": "Since it is an endgame, I protect by bringing the monarch into action.",
        "33... Bd7": "Redeploying her B.  But, this is where I'll take that pawn, at once.",
        "34. Rxg6 Bf5": "Doing what Sue to get the intiative back, she attacks my Rook.",
        "35. Rh6": "And, I defend, whilst, attacking her h5.",
        "35... Re8": "?? And, she counterattacks.  But, it is a blunder.  As noted, however, I wasn't saying for the same reason with the advantage.  ",
        "36. Nxe8": "My student, however, brought it up and I replied.  Sue: I might resign soon. made a stupid move without thinking my thoughts elsewhere.  Joe:  Yes, it is important to think about each move. I know why you played Re8. The idea was my Bishop. But, it was attacked by the Knight. ",
        "36... b5": "Trying to get a passed pawn.",
        "37. Nd6+": "Which I stop.  Now, I capture take that pawn on my next move.  But, I'll take Sue's B, instead, as it is her last piece on the board. ",
        "37... Kd3 38. Nxf5 b4": "Still trying to get a passer.",
        "39. Bxb4": "Which I stop by taking, this time around.",
        "39... h4": "Hoping for counter play.",
        "40. Nxh4": "But, I take her remaining pawn.  With what I have against her lonely, I will push my f pawn, as it is a passer and closet to the eighth rank.  And, I will also give up a pawn to Queen. ",
        "40... Kc2 41. f5 Kb2 42. f6 Kxa2 43. f7 Kb3 44. f8=Q": "With that promotion, I've got a forced a mate which I'll take advantage.",
        "44... Kc4 45. Qc5+": "And, now it is a forced mate.",
        "45... Kd3": "As Sue's only other option was 45...Kb6, but then I'd a mate a move later 46.Ra6, Kb2 47.Qc3+, Kb1 48.Ra1#",
        "46. Rd6+ Ke4 47. Qd4#": "After this game, I pm'd Sue on where she went wrong, what was mentioned is the moral of this story.  So, I said, Overall, you played pretty well. You started off strong in the beginning, but made mistakes which lost pawns. What becomes important to ask is if and when a Bishop is worth more then a Knight or not. For example, we talked about exchanging. Better would've been to exchange my N as that's what became powerful. The second that I was two pawns up and you were faced with a cramped position, that's when it was going to go downhill. The final blunder was the Rook move because you attacked my Bishop but forgot that the Rook was emprise. So, after playing that my pieces became powerful. But, the last moral is what you mentioned. And, I know what you're going through. When distractions can't be avoided, you want to think about the here and now of what's going on the chess board. Because, in chess, what matters is what's happening at the very moment. Distractions can cause mistakes like what happened in my last game against Ted. Yes, focusing on what's happening at the very moment is going to help you in the future.   After that, but before this annotation, I showed her my loss against Ted in our second game, on May 6th.  As I had lost that game by not thinking about the here and now, either. "
    },
    "url": "https://gameknot.com/annotation.pl/colles-system-training-game?gm=61386",
    "gameName": "Colle's System Training Game",
    "players": "jkarp (1350) vs. knightrider62 (945)",
    "opening": "King's Indian (A48), East Indian defence"
}