{
    "moves": {
        "1. e4": "This is a game where my pieces work harmoniously together.",
        "1... e5 2. Nf3 Nf6 3. Nc3 Nc6": "Going into the four knights.",
        "4. Bb5": "rather than the common move in the four knights bishop to c4 i like the ruy lopez position for my bishop.",
        "4... d6 5. O-O Be7 6. d4 Bd7 7. d5 Nb8 8. a4 a6 9. Be2 O-O 10. Nd2": "Clearing way for f pawn advance.",
        "10... c6 11. f4 cxd5 12. exd5 exf4 13. Rxf4 Qb6+ 14. Kh1 Qc5": "Here is where the game gets really interesting. Enjoy the ride. ",
        "15. Nc4": "Allowing bishop to move.",
        "15... b5 16. Be3": "Ignoring threat of him taking my knight since my threat of taking his queen is stronger. I love how the piece being attacked is the piece defending the bishop.",
        "16... Qb4 17. Nb6": "Discovered threat as well as direct threat of taking his rook. I was hoping he would see the direct threat and react by moving his rook and thus losing his queen but he saw the discovered threat.",
        "17... Qxb2": "I could take rook but then I would lose knight and have bishop under attack so chose to double attack his knight threaten a discovered attack on his queen and protect the knight and still be threatening to take his rook all in one move.",
        "18. Bd4 g5": "seeing My position is better trade rook in order to get two of his minor pieces and still have discovered threat as well as threat on his rook still.",
        "19. Rxf6 Bxf6 20. Bxf6 b4": "Couldn´t help but laught that he took away his only escape square for his queen. And am pleased to win his queen.",
        "21. Ne4 Qxa1 22. Bxa1": "Could have taken with bishop or queen but saw that by taking with bishop I would have the threat of knight check winning his bishop through a discovered check and then trading his rook for my knight. Also currently threatening to take his rook still so I still have two threats.",
        "22... Ra7 23. Nf6+": "He removed one threat but this one was simply game. I hope you guys liked how many threats I had going constantly due to my pieces working together so well. It made the game quite fun to play."
    },
    "url": "https://gameknot.com/annotation.pl/colormans-mini-tournament-i?gm=60128",
    "gameName": "colorman's mini-tournament I",
    "players": "whocaresulost (1859) vs. mavod (1591)",
    "opening": "Petrov three knights game (C42)"
}