{
    "moves": {
        "1. d4": "So it starts conventionally.",
        "1... d5": "For some reason I was expecting a Benoni or King's Indian.",
        "2. c4": "So I play the Queen's Gambit.",
        "2... c6": "He plays the Slav Defence.",
        "3. Nf3": "I avoid the Slav Gambit (3. Nc3 e5) even though it really isn't that good - I was afraid he may know it better than me.",
        "3... Nf6": "He continues to develop.",
        "4. Nc3": "As do I.",
        "4... e6": "Is he planning on transposing into a main line of the Queen's Gambit Declined?",
        "5. Bg5": "Not sure, let's see.",
        "5... h6": "he hits my bishop.",
        "6. Bh4": "Bishop drops back.",
        "6... dxc4": "But now he takes.",
        "7. a4": "I stop him from protecting the pawn on c4 with b5.",
        "7... Bb4": "He pins my knight.",
        "8. e3": "I prepare to recapture.",
        "8... Qa5": "I think this is just being greedy. In my opening databases, all the variations with this have black losses - 9 games in total.",
        "9. Bxf6": "I take.",
        "9... Bxc3+": "He decides to take the pawn while he has a chance.",
        "10. bxc3": "I take back.",
        "10... Qxc3+": "He takes the pawn with check.",
        "11. Nd2": "My knight drops back.",
        "11... gxf6": "He takes the bishop.",
        "12. Bxc4": "I take the pawn back. Black is a pawn up, but white has loads of compensation with his better development, safer king and better pawn formation.",
        "12... Qa5": "As played in mehd872 (1714) vs. boriskhurgin (1782) http://gameknot.com/analyze-board.pl?bd=15978605&mv=23&rnd=0.9443431160899376",
        "13. O-O Nd7": "This move deviates from the game mentioned above, but black's game is difficult.",
        "14. Ne4": "Played to free up up my queen for action, and also perhaps throwing in a check on d6 or maybe ganging up on f6 at some point.",
        "14... f5": "Attacking the knight. OK try and guess what I played?",
        "15. Qh5": "Did you find it? This is far better than Nd6+ which leads to me exchanging off my attacking knight. But now I am threatening Nd6 check, with a double attack on f7, which explains his next.",
        "15... Ke7": "So he has parried that threat. OK Try and guess my next move?",
        "16. Ng5": "Did you find it? My attack on f7 wins back a pawn. Notice the pin on the h file - this game is going to be full of pins!",
        "16... Rf8": "So he protects f7.",
        "17. Qxh6": "I gain my pawn back.",
        "17... Nf6": "He develops his knight. Guess my next move?",
        "18. Qh4": "Did you find it? I thought this was a powerful half-pin on his knight. The threat is 19. Nh7 winning the knight. I though he had to move his king to e8, d7 or d6 but he finds another move.",
        "18... Rg8": "I don't rate this idea.",
        "19. Nh7": "So i continue.",
        "19... Rg6": "He protects.",
        "20. Nxf6": "I take - it may be better to build up the tension rather than play this immediately, but it does lure his rook onto a dreadful square.",
        "20... Rxf6": "He takes back. OK try and guess what I played again?",
        "21. Qg5": "The idea is to play e4, threatening e5 and, like before, there is a pin along the fifth rank, so that if he meets e3-e4 with f5xe4 then his queen goes.",
        "21... Qc7": "So the queen drops back to break the pin. I think he would have been better advised to play Qd8, allowing his king to move, and then his rook to move. My pin on his rook is too powerful for him.",
        "22. f3": "And I again threaten e3-e4.",
        "22... e5": "This looks to me to be a dreadful move - I was still thinking Qd8 must be his best move, admitting that he last move was wrong. Now the centre is opening up and his king is going to be vulnerable. ",
        "23. e4": "I want the centre opened as much as possible.",
        "23... Qb6": "Now he comes up with his own pin.",
        "24. Rad1": "So I protect my d pawn.",
        "24... Be6": "He finally develops his bishop. OK what did I do next?",
        "25. Kh1": "Did you find it? Breaking the pin threatens d4xe5",
        "25... Qb2": "So he prepares to meet d4xe5 with Qxe5. So find the best move now?",
        "26. f4": "Did you find it? I am determined to get a pawn to e5 and win his rook.",
        "26... Bxc4": "So he takes the bishop. So which pawn is it best to use to take on e5? Or should I move my attacked rook?",
        "27. dxe5": "Would you have played this?",
        "27... Bxf1": "Again, I have a choice. Which is best? Recapture the bishop, or take the rook, and if so, with pawn or queen?",
        "28. exf6+": "is this what you would play dear reader? This is best. If I take with the queen, after his king goes to e8 or f8 I can't pick up his rook on a8 with 29 Qh8+ followed by 30. Qh8xRa8 as he can reply Qb2xg2 mate! Now however, because I took with the d pawn on move 27, the d file is open and if his king drops back to e8 or f8 I can mate him with my queen. Yes, he can avoid this with Qxf6, but then 29. Rd7+ wins his queen (if 29....Ke6 then 30. Rd6+). Sure he has rook and bishop against my queen, but in this open board my queen is much better. I have a simple winning plan of h2-h4-h5-h6-h7-h8=rook, winning his rook, which is hard to stop. In this position then, my opponent, obviously able to see all these variations, resigned.\n\nMany thanks for reading, please rate this annotation on the star system, leave a comment or two to let me know how I am doing. Until next time dear reader!"
    },
    "url": "https://gameknot.com/annotation.pl/colwyn-bay-v-malpas-oswestry-chester-league?gm=62100",
    "gameName": "Colwyn Bay v Malpas & Oswestry, Chester League",
    "players": "Charles L Higgie (ECF166) vs. David Jameson (ECF 191)",
    "opening": "QGD Slav (D15), 4.Nc3"
}