{
    "moves": {
        "1. e4 c5 2. Nf3 d6 3. d4": "Open Sicilian",
        "3... cxd4 4. Qxd4": "Chekhover Variation. I was in an aggressive mood.",
        "4... Nc6 5. Bb5": "I could tell Nc6 was a reflex move. My opponent only now began to think of the consequences. His position is not bad but the time spent here thinking of the next move suggested he had now only begun to play.",
        "5... Nf6": "He decided to ignore the pin and catch up on K-side development.",
        "6. Nc3 Bg4": "Bg4? I think the Bishop could have been better used in breaking the pin rather than being traded away.",
        "7. Be3": "Development complete and I can castle long or short. ",
        "7... Bxf3 8. gxf3": "Trading away the Bishop damages my pawns but opens the g-file for my rook. It was not worth it.",
        "8... e5": "A late push.",
        "9. Qa4": "Applying more pressure to the Q-side. Now the pawns begin to quake too. I plan to castle long soon enough to attack the middle. My Q-side majority also means I can probably be greedy and pick up an extra pawn in a trade even though it will open lines to my King. Let's see...",
        "9... Qd7": "Ooh... My opponent has sharpened my pin for me.",
        "10. O-O-O h6": "Preventing Bg5 perhaps? That plan wasn't even on my mind. More likely planning Nh7 followed by Ng5 in an effort to destabilize the f3-pawn? Or does it prepare g5 and Bg7? Who knows?",
        "11. Nd5": "b6, c7 and e7 are all critical chokepoints. Also, 11... Nxd5 12.exd5 and the Knight on c6 is kaput. ",
        "11... Be7": "Attacking either of the Knights or the Bishop throws away a lot of my advantage for something approaching equality. The King seeks to get out of danger while connecting Rooks and initiating counterplay. How do I stop that from happening? ",
        "12. Nb6": "12. Nb6!  I confess it took me a while to see this combination. Pandemonium erupts!",
        "12... axb6 13. Qxa8+ Bd8 14. Bxb6 O-O 15. Bxd8 Rxd8 16. Qa4 Qc7 17. Bxc6 bxc6": "Now I am up both in position and material.",
        "18. Rhg1 Qb7": "We both take aim at the opposing King. Black's Knight is the last \"threat\" left. We are both stretched thin and attackers must be defenders too. We will both be thinking of marching pawns; him through the middle, me along the Q-side. His is the more dangerous path though.",
        "19. h4 d5 20. exd5 cxd5": "Each central opposing pawn down works in my favour.",
        "21. Qb3 Qc6": "Wary of all trades, and with good reason. Someone has to defend the Q-flank from invasion.",
        "22. Qd3 d4 23. Qf5": "I wanted to open some holes here (23 ...Re8 24.f4 leaving d4 en prise). 23 ... Rc8 24.Kb1 was another possibility with the Rook off the d-file.",
        "23... Qb5 24. f4 e4": "This blunder loses. I expected Rd5 instead.",
        "25. Qxb5": "Resignation. Not a brilliant finish. I was unsure if I should even bother to annotate this one. I decided I would only because there were some shining moments in the middle-game."
    },
    "url": "https://gameknot.com/annotation.pl/combination-in-the-chekhover?gm=33795",
    "gameName": "Combination in the Chekhover",
    "players": "tonnerre (1828) vs. ieeewiz (1724)",
    "opening": "Sicilian (B53), Chekhover, Zaitsev variation"
}