{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Bb5 Bc5 4. Bxc6": "Normally I wouldn't take that Knight, but after having looked at very old games for some times I had an urge to play old fashioned chess.",
        "4... dxc6 5. Nxe5": "Too cocky",
        "5... Qd4": "Ofcourse I missed this, what a blunder so early in the game!",
        "6. Nd3 Qxe4+ 7. Qe2 Qxe2+ 8. Kxe2": "And this had to follow...",
        "8... Bd6 9. Re1 Ne7 10. c4": "C4 is a bad move because of Bf5. I played it with a feeling of being silly, but never the less it turned out to confuse my opponent...",
        "10... O-O": "O-O is really too a bad move, not taking advantage of my split-up pawns and overlooking the following move by white.",
        "11. c5 Bxh2 12. Rh1 Bg3 13. fxg3 Nf5 14. Kf2 Nd4 15. Ne1 Re8 16. Nc3": "+ Jeg står ikke synderligt godt, men har en materiel overvægt. For at udvilke mig videre skal jeg have kongen i tryghed på f eller d. Da kongen nu er havnet på f-linien, c2 er dækket, ligeledes er e2, og ved yderligere forstærkning fra sorts side på e2, ignoreres truslen med d3 (forberedende Le3 (trussel mod springeren)) da det kun er tårnet hvid ikke vil have stående på e2. Springer og løber er ikke nogen trussel og kommer mere til at stå i vejen for sort, end den vil spille rollen som angriber.\n\nMeaning that I have plan for what to do, being in control of the posistion sort of...",
        "16... Bf5": "Black wants to take advantage of the weak white squares.",
        "17. d3": "En naturlig blokering, der også åbner for hvids sortfeltede løber, som kan placeres på enten e3 eller f4. Lb2 synes ikke at have samme effekt, da trækket kræver forberedelse med b4\n\nIt seemd to me as a natural blocker also preparing for the bishop to work",
        "17... Bg6": "Sort holder løberen i diagonalen og undgår at ståi vejen for tårnene. Diagonalen h5-d1 er dog ikke længere en mulighed da tårnet dækker h5. Indtagelsen af den diagonal virkede for mig farligere i det presset ikke umiddelbart kunne blokeres af hvid.\n\nMaybe black should have looked at the diagonal h5-d1 and the square at e2. Maybe there had been some pressure.",
        "18. Bf4": "Lf4 er ikke nogen direkte trussel. I stedet kunne der som nævnt tidligere være spillet b4 og L b2 eller Le3. Den direkte trussel af springeren på d4 gennem Le3 er ved første øjekast indlysende, men efter 18..., Sf5 taber hvid et tempo.\nStillingen er ikke uden muligheder for begge sider, og gennem upræcist spil kan der opstå ubehageligheder for hvid, der er foran i materiel, men som overhovedet ikke har sat sig på stillingen endnu.\n\nAt first I wanted to plant the bishop at e3, but got scared seeing Nf5",
        "18... Ne6": "Se6 var forventet men ikke farligt, da hvid gerne vil bytte af, specielt når afbytningen løser op for en ellers hæmmende dobbeltbonde.",
        "19. Rd1": "Forbereder Sf3 og en magtkamp om centrum, feltet e5 begynder. Sort kan forsvare sig med f6, men det vil kun resultere i f5, og der kan etableres en forpost.\n\nGetting ready to play Nf3, but overlooking Nxc5 which is a step-back for white",
        "19... Rac8": "Might not have been nessasary",
        "20. b4": "covering",
        "20... b6 21. d4": "the pawns are consolidating",
        "21... b5": "The attacking quuen-side of black seemed undangerous to me, but later on it got a little dangerous",
        "22. Be5": "This move wanted to provoke f6, but it did not give me anything",
        "22... Rca8 23. Nf3 a5 24. bxa5": "Playing a3 instead mighthave been more a standard defence, but I chose the following moves",
        "24... Rxa5 25. Rd2 Ra3 26. Ne2 Rea8 27. Ra1 Be4": "The fight over a2 takes a lot of effort for black, but the centre was too crowded ",
        "28. Nf4 Nxf4": "This move wins at least a pawn, but can black lose so many pieces?",
        "29. gxf4 Ra8a7 30. Re2": "Instead f5 or Ng5 should have been played by white...",
        "30... Bxf3 31. gxf3 f6 32. Rd2 fxe5 33. dxe5": "Attacking the centrelines  and a free pawn is coming...",
        "33... Kf7 34. Rd7+ Kf8 35. Rad1 Ra3xa2+ 36. Kg3 b4": "loses the game",
        "37. Rd7d8+ Kf7 38. f5 g6 39. Rd1d7#": "A bad game for both parts, whom both have a lot to learn about chess.\n\nPlease give me a comment if you see this..."
    },
    "url": "https://gameknot.com/annotation.pl/come-back?gm=33522",
    "gameName": "Come back",
    "players": "jazzas (1599) vs. akker (1650)",
    "opening": "Ruy Lopez (C64), classical (Cordel) defence"
}