{
    "moves": {
        "1. e4 e5 2. d4": "White opens up with the centre game - one I have never encountered much myself\n",
        "2... exd4": "Black captures...\n",
        "3. Qxd4": "and White recaptures, bringing the queen into early development. According to the database, more popular here is the Danish Gambit with 3.c3\n",
        "3... Nc6": "the most logical move, driving away the queen while developing a piece\n",
        "4. Qe3": "I expected Qa4 here (as with a main line in the Scandinavian defence; 1.e4 d5 2.exd5 Qxd5 3.Nc3 Qa5) but again, the DB says that this is the most common response to Black's last move, so it can't be bad\n",
        "4... g6": "?! the main response is Nf6 (again, according to the DB - this will be the last time I refer to it in this annotation) What I had in mind was [of course] Bg7, followed by a future Bd4 to pressure the queen once more\n",
        "5. Nc3": "White continues queenside development, and is two steps away (if he chooses) from queenside castling\n",
        "5... Bg7": "Of course\n",
        "6. Bb5": "The first aggressive attack from White, threatening to double up the pawns on the c-file.\n",
        "6... a6": "maybe 6...Qf6 would have been better in this situation, but my thinking here was that Black's pieces would have more room after the recapture with the d-pawn (and by pieces, I mean the queen and bishop)\n",
        "7. Bxc6 dxc6": "The next couple of moves are just simple development\n",
        "8. Nf3 Bg4 9. O-O Bxf3": "?! Of course, White doesn't need to double up pawns - he can easily retake with the queen - but I wanted to place the bishop on e5, then the queen on d6 (actually, I did it the other way around in the game) to pressure on h2. The most logical defence to this would be g3, which may provide weaknesses in the kingside position, but the real 'Catch 22' of this idea is that the best way to exploit the weakness would be the Queen and bishop on the h3 and f3 squares....\n",
        "10. Qxf3": "yup, the very same bishop I just traded off!\n",
        "10... Qd6": "going through with my plan anyway - there could still be a way to make it a weakness\n",
        "11. e5": "? gives up a pawn for nothing. Maybe White thought that Black would recapture with the bishop, at which point White would play 12.Bf4!, then 13.Bxc7 next move, preventing Queenside castling (12...Qe7?? is not possible because of 13.Rfe1!) Of course, Why would Black recapture with the queen when he has the bishop? [another interesting variation, which still ends up with an equal trade-off, was 11...Qxe5 12.Bg6 Bxh6 13.Rfe1 Qxe1 14.Nxe1+ Ne7, with a pawn, a bishop and a rook for Black's queen]\n",
        "11... Bxe5": "Now with the aforementioned attack on h2.\n",
        "12. Re1": "White decides to delay the attack for a move to get his rook onto a strong file\n",
        "12... O-O-O": "Also possible was 12...Ne7, in case Black had ideas of kingside castling\n",
        "13. g3": "as expected\n",
        "13... Nf6": "Black develops his last piece, while at the same time connecting the rooks. However, this is where things start to get complicated for both sides...\n",
        "14. Bg5": "It seems like White is just looking for an ordinary trade...\n",
        "14... h6": "and I'm happy to follow through with it. I reckon that if White had simply decided to trade off here, Black would have come out better; 15.Bxf6 Qxf6 16.Qxf6 Bxf6 - what Black is counting on in this line is the fact that his seventh rank is more protected than White's second rank, making it easier for Black to break through\n",
        "15. Rad1": "! the first complication. White threatens the queen while getting his other rook into the action\n",
        "15... Qe6 16. Qe3": "The nice thing about this move is that the threatened bishop still can't be safely taken as a free bishop; 16...hxg5 is met with 17.Qxg5 - the bishop cannot be saved, and White wins back the pawn (Ng4 can easily be driven back with a pawn) I noticed that this move also threatened to win the h6 pawn, and I could only see one way to defend everything....\n",
        "16... Ng4": "...which further complicates matters! I was looking at, after the queen moved; 17...Nxh2, and if 18.Kxh2 hxg5+  19.Kg2 Qh3+ 20.Kf3, luring the king into the open. However, that all depended...\n",
        "17. Qa7": "! on where White moved his queen! White threatens Qa8 mate, and the only way for Black to block that is Bd6, but Black can't do that because it loses his queen!\n",
        "17... Rxd1": "pretty much forced, as far as I can see - after White's attack finishes, it will have all boiled down to a rook-for-bishop trade, with advantage to White\n",
        "18. Qa8+ Kd7 19. Rxd1+ Bd6 20. Qxh8 hxg5 21. Qd4": "White, obviously worried about his queen being trapped in a corner, and brings her out\n",
        "21... b6": "Black plays defensively, preventing the queen from infiltrating the position again\n",
        "22. a3 Kc8": "Breaking the pin on the bishop\n",
        "23. Qh8+": "?! kind of useless, really - the queen threatens nothing there (though to be honest, I would have had troube finding a good move for White here - any suggestions, readers?)\n",
        "23... Kb7": "Black's king is now safely tucked away in a fortress of pawns!\n",
        "24. Qd4": "White changes his mind about the queen - however, this allows a sneaky little trick from Black, that eventually wins back the lost pawn\n",
        "24... Nxf2": "if White had simply declined the sac, Black still comes out with material equality, but White goes through with the more interesting variation here... \n",
        "25. Qxf2": "White accepts the sac, which is immediately met with....\n",
        "25... Bc5": "! White's next move is pretty much forced to avoid losing material (in fact, it actually turns this whole thing into an exchange)\n",
        "26. Rd4 Bxd4 27. Qxd4": "White is able to escape from the pin on the queen, but his back rank, the first rank, has been stripped of its defence....\n",
        "27... Qe1+": "...Which allows Black to break through!\n",
        "28. Kg2 Qc1": "Forking the b-pawn and the c-pawn.\n",
        "29. Ne4": "White is anticipating Black's next move...\n",
        "29... Qxc2+ 30. Nf2": "and defends the check with the knight. this turns out to be sufficient defence for the king\n",
        "30... Qf5 31. Qe4": "White looks to trade queens....\n",
        "31... Qb5": "but Black declines, while threatening the b-pawn\n",
        "32. b4": "the play continued 32...a5 33.Qe8  Qf5 34.bxa5 bxa5 before the draw was agreed on, but I find this last position so much more pretty - every piece is defended (save Black's f-pawn and White's a-pawn, but they can be easily defended if they get attacked) both kings are safely tucked away in their own fortresses, and neither side has an attack. Good game!\n"
    },
    "url": "https://gameknot.com/annotation.pl/complications-and-an-interesting-draw?gm=28635",
    "gameName": "Complications, and an interesting draw",
    "players": "martindarcy (1327) vs. x-machine (1278)",
    "opening": "Centre game (C22), Paulsen attack"
}