{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Bc4 Bc5 4. O-O": "This is a 3 min + 10 sec game so the quality at times is questionable but its fun.  I probably lose as many games as I win at this speed but I am addicted.  I have seen this position many times.\n",
        "4... Nf6 5. d3": "The move d3 prevents 5. ..., Ne4 followed by d5 to fork any piece that would recapture.  It also makes the pin Bg5 possible.\n ",
        "5... d6 6. h3": "Prevents Bg4 but white has no real advantage from the first move now.\n",
        "6... O-O 7. Bg5": "This pin can be annoying.\n",
        "7... h6 8. Bh4 Be6 9. Bb3": "White is unlikely to get anything from the pin now if he exchanges and keeping the pawns in reasonable order is important so white retreats.\n",
        "9... a5 10. a3 Nd4 11. Nxd4 Bxd4 12. c3 Bb6 13. Nd2": "White completes his development.  The position is basically equal.",
        "13... g5 14. Bg3 Kg7": "White feels secure with the bishop and rook holding the pawn at f2 but this is an illusion in some ways.  ",
        "15. Bxe6 fxe6 16. h4": "White thinks opening the kingside will benefit him.  I was wrong!",
        "16... gxh4 17. Bxh4 Rg8 18. Nf3 Kh7 19. d4": "White wants to cut off the the black DSB.  ",
        "19... Qf8 20. dxe5": "White changes his mind - bad idea and black jumps on it quick.\n\n",
        "20... Qg7": "There is only one way out of mate!\n",
        "21. Ng5+ hxg5 22. exf6": "This was forced since 21. ..., Kh1, 22. Nf7ch, would lead to a repetition or the Queen must capture on f7 and white may survive.\n \n",
        "22... Qg6": "If Black plays 22. ..., Qxf6 then it is met with 23. Qh5 ch and black must exchange Queens ",
        "23. Bg3 g4 24. Qe2 Qxf6": "Black cut off any possibility of white playing Qh5 ch before he captures a pawn.  If he had captured the pawn on e4 then \nQh5 ch followed by Qxg5 ch would be one chance for White.\n",
        "25. e5": "Capturing the pawn lets white use his DSB to effectively.",
        "25... Qh6 26. Qe4+ Rg6 27. exd6": "White is hoping for the automatic recapture since Qxb7 wins material and the game ( Black is shorter on time than white ).\n",
        "27... c6 28. Rad1 Kg8": "Black wants to use the h file to checkmate.  White may play Rd4 if necessary.",
        "29. d7 Qh5 30. Qe5": "Black runs out of time here.  The variation I expected was 30. ..., Qh7 31. Rd3, Rh6, 32. Bh2 and I am not sure who is winning!  If you have any continuations please comment.  "
    },
    "url": "https://gameknot.com/annotation.pl/complicated-position?gm=64527",
    "gameName": "Complicated position",
    "players": "jmd1952 (1200) vs. qxqxqxqxq (2065)",
    "opening": "Giuoco Piano (C50)"
}