{
    "moves": {
        "1. e4 Nf6 2. Qh5 Nxh5 3. a4 Ng3 4. Ra3 Nxh1 5. Rg3 Nxg3 6. Be2 Nxe2 7. Nf3 Nxc1 8. Ne5 Ne2 9. Nxd7 Ng3 10. Nxb8 Nh1 11. Nc6 Nxf2 12. Nxd8 Nxe4 13. Nxf7 Nxd2 14. Nxh8 Nc4 15. Ng6 h5 16. Nxf8 Nxb2 17. Ne6 Nxa4 18. Nxc7+ Kf7 19. Nxa8 Ke6 20. Nb6 Nc3 21. Nxc8 Ne2 22. Nxa7 Nd4 23. Nc6 Nxc2+ 24. Kd2 Nb4 25. Nxb4 Kf5 26. Kc3 Kf4 27. Kc4 Ke3 28. Kb5 Kf2 29. Kb6 Kxg2 30. Kxb7 Kxh2 31. Kc7 Kg1 32. Nc3 h4 33. Nbd5 g5 34. Nxe7 g4 35. Nf5 h3 36. Kc6 Kf1 37. Nh6 Ke1 38. Nxg4 Kd2 39. Nd5 Kc2 40. Nh2 Kb2": "This is the starting position in the desired endgame I would like to study and demonstrate to you. It is White's move here, and there are loads of players who would just offer a draw here as White. King and two knights vs. lone king is known to be a dead draw, so if you ever get close to reaching this two knights endgame, you should keep one of your opponent's pawns on the board, because it is possible to mate with two knights, if your opponent has remaining material, and you have the technique to win (like I will show you).",
        "41. Kc5": "White has a forced win (that will take many many moves). Black's pawn close to promotion on the h-file is a traitor, because without it, the position would be dead drawn. Two knights can usually win against a king and pawn if the pawn's promotion is blocked and sufficiently far from promotion (in this case 2 squares is far enough, but it usually isn't) and the losing king isn't close to helping the pawn.",
        "41... Kb3": "Black is fighting for a draw, so it's logical that he would want to try restricting the attacking king from coming in, but this just stalls White's win. It's up to Black to make it as hard as possible for White to win.",
        "42. Kb5": "White forces the enemy king back with opposition, and with the help of the knight. The other knight is a blockade to prevent pawn promotion. That knight will move later and allow a pawn move so that the black king won't be stalemated when the knights focre checkmate.",
        "42... Kc2": "Black wants to get toward the pawn and attack the blockader. It is pretty much the only hope for a draw. ",
        "43. Kc4": "It is important to have an agressive king in and endgame, especially when your opponent has minimal material. White's king is the most powerful piece on the board, where it restricts Black's movement. White's three pieces must cooperate accurately to win this. White has an offensive knight, and a defensive knight. The offensive knight helps the king to restrict the enemy king's breathing space, while the defensive knight simply blockades the pawn and then comes in later to complete the final mating maneuver.",
        "43... Kd2 44. Kd4 Ke2 45. Ne3": "This is a big decision for Black. Black can head toward the kingside and White will play Nef1 and there is no hope of Black's king breaking the blockade with both knights supporting each other. Black can stall the win longer by going to the queenside, where there is more free space.",
        "45... Kd2 46. Nc4+": "If Black heads to the kingside toward the pawn with Ke2, then Ke4  Kf2 Nd2 and White can set up the supporting knights strategy to continue the pawn blockade.",
        "46... Kc2 47. Na5": "Restricting the king from b3. This time if Black keeps heading toward the queenside with Kb2, then Kd3 Ka3 Kc3 Ka4 Nb7 and the king will be pushed back toward White's territory, and then pushed to the kingside. The reason the king needs to be pushed toward the pawn, is because White has a knight sacrifice tactic later. where White mates with a lone knight.",
        "47... Kd2 48. Nb3+ Kc2 49. Kc4 Kb2 50. Nd4": "The king and knight alone are able to restrict the enemy king until it is forced to get cornered on the kingside. The other knight comes in for the finish later.",
        "50... Ka2 51. Kc3 Ka3 52. Nb3": "The knight cornering method is complicated to master, but the ideas will come in handy in knight endgames, and especially in variants of this endgame.",
        "52... Ka4 53. Kc4": "The only winning move. Other moves allow the king to escape into a drawn position. ",
        "53... Ka3 54. Nc5 Ka2 55. Kd3 Kb2 56. Kd2": "Cornering with a knight takes time and practice to do effectively, and maneuvering must be precise. Opposition is the main idea of pushing the enemy king back (being two horizontal or vertical squares away from the defending king is the strongest)",
        "56... Ka2 57. Kc2 Ka3 58. Kc3": "Once again the only winning move. There are other variants of the last few previous positions that would've reached this position quicker. Pay attention to how the king and knight maneuver to control where the Black king is forced to move. White's goal is to get the black king toward the pawn where White has the sacrifice tactic.",
        "58... Ka2 59. Nd3": "If Ka3 here, then White plays the restricting Nb2. Now that Black's king has been effectively restricted in the corner, White must figure out how to zugswang the king into having to move toward the pawn. Don't worry if the winning process seems complicated, if you just play logical restricting moves and calculate ahead, you should be able to manage a win.",
        "59... Kb1 60. Kb3 Ka1 61. Kc2 Ka2 62. Nb2 Ka1 63. Nc4 Ka2 64. Kc3 Kb1 65. Kd2 Ka1 66. Kc1": "Since kings and knights cannot waste moves, White needs to have a good grasp of triangulation and opposition knowledge. Triangulation is when you make a series of moves that reaches almost the same position as before, except that the other player has to move. If you learn this technique then you will have a better understanding of how to corner with a king and knight.",
        "66... Ka2 67. Kc2 Ka1 68. Kb3 Kb1 69. Nd2+": "Finally White has made some progress in cornering Black's king. Black cannot play Ka1 here because play continues Nhf3 h2 Nd4 h1=Q Nc2#",
        "69... Kc1 70. Kc3 Kd1 71. Nb3 Ke2 72. Kd4": "This is a very important restricting move. Black can draw if he gets to e3 where it is impossible to corner him from the center.",
        "72... Kf2 73. Nc1": "Here, Ke1 is the move that stalls the win the longest, but I will show this variation since most players would play this as Black, attempting to break the knight blockade while the knights are not supporting each other.\r\nSo attacking the knight by moving the king to the g-file seem to draw the game right?",
        "73... Kg3": "How can White win now since the blockade has been broken?",
        "74. Ke3": "White has this nice mating tactic where Black will lose quickly if he takes the knight. After Kxh2, play continues Kf2 Kh1 Ne2 Kh2 (h2 Ng3#) Nc3 Kh1 Ne4 Kh2 (h2 Ng3#) Nd2 Kh1 Nf1 h2 Ng3#",
        "74... Kh4": "Kg2 also loses quickly because Ne2 maintains the sacrifice mating tactic (Ne2 Kxh2 Kf3 Kh1 Kf2 transposes into the line discussed before) and Black's king is completely restricted to the corner. White uses restriction to force Black to accept the knight sacrifice, where White can use the brilliant 1-knight mating tactic, which was once just a composed puzzle, but now it serves a purpose in this endgame. If Black's pawn wasn't a rook pawn, then it would have to be farther from promotion in order for White to still win, since mating with 1 knight can only be done if the king is trapped behind a rook-pawn",
        "75. Kf4 Kh5 76. Kf5 Kh6": "If Kh4, then Ne2 restricts the king to be pushed upward anyway",
        "77. Kf6 Kh7 78. Ne2": "White's powerful knights and Black's traitor pawn restrict the enemy king from crossing a barrier, Black's only hope of escaping is around the White king and back to the queenside.",
        "78... Kg8 79. Ke7": "Here we are nearing the 50-move rule. On most online chess servers, the 50-move rule is initiated, and White would have to sadly settle for a draw, but in competetive tournament play, the 50-move rule can be exempted for special cases that require more than 50 moves to win. Usually your opponent's defense won't be perfect, so there is still hope of winning in under 50 moves when playing online where the 50-move rule interferes with your win. If you are in an OTB tournament and you ever get a winning ending requiring more than 50 moves to win, I highly encourage you to cause a scene if the tournament director won't allow you more than 50 moves to win. I think the 50-move rule is dumb, because there is a famous position that requires almost 600 moves to force a win!",
        "79... Kh7": "Kg7 allows White to win slightly quicker with Nf4, where White's opposition of the king allows Black to be cornered quicker. A lot of players would've played Kg7, cutting off time from White's winning sequence. A lot of inaccuracies by a human player can take lots of moves of your winning sequence, and may allow you to finish in less than 50 moves in cases where extra time isn't allowed.",
        "80. Kf7 Kh6 81. Kf6 Kh7": "If Kh5, then White tightens the barrier with a Nc3 Ne4 maneuver",
        "82. Nd4 Kh6": "The finishing moves of this ending are usually the hardest to find. The cornering part at the beginning just required logical restricting moves. White now has to continue the restriction barrier into the h8-corner where White's h2-knight has sufficient moves to mate Black the same move the pawn promotes. Back when the king was cornered on a1, the knight wasn't close enough to force a mate, but the h2-knight served a purpose when it restricted the a1-square with a mating threat.",
        "83. Nf5+": "If Kh7 here, then Kf7 corners the king more quickly.",
        "83... Kh5 84. Ne3": "There are two totally different winning sequences.\r\nIf Black's plan is to move toward the h8-corner, then White will win by stalemating the king on h8 the same move the h2-knight moves to give Black a legal pawn move, then that knight will mate Black the same move the pawn promotes.\r\nIf Black's plan is to move toward the h1-corner, then White will win by figuring a way to get his king to g3 the same move Black plays Kh1, so that White will have Nf2 h2 Nf2#",
        "84... Kh6": "This is Black's longest way of surviving, since the knights are further from the h8-corner, but regardless, the knights are powerful enough to corner the king in either corner wherever Black flees.",
        "85. Neg4+ Kh7": "If Kh5, then Kf5 Kh4 Kg6 and White forces the king to h1 thanks to the powerful barrier restricting f3, f2, and f1. White would then need to get the king to g3 the same move the king is forced to h1, and then play Nf3 h2 Nf2#",
        "86. Kf7 Kh8 87. Nh6 Kh7 88. Nf5 Kh8": "The king has been forcefully cornered, so now White must figure out the mating sequence. There are certain squares the knights need to be on in order to complete the mating attack.",
        "89. Kg6 Kg8 90. Ng7 Kf8": "Kh8 loses quicker to Ne6 Kg8 Ng4!! where White has enough moves to mate Black on or before the move the pawn promotes",
        "91. Kf6 Kg8 92. Ne6 Kh7": "If Kh8, then Kg6 Kg8 Ng4!! reaching the same position discussed a couple moves ago.",
        "93. Kg5 Kg8 94. Kg6 Kh8 95. Kf7 Kh7": "Now White has maneuvered the knight onto a square where a forced checkmating sequence can begin with the movement of the blockading knight.",
        "96. Ng4": "It takes a lot of foresight and extremely accurate play to win an endgame like this, so hopefully these ideas will help you in your endgame. Even though this endgame took more than 50 moves to win, White still had a forced win, and most TD's will exempt the 50-move rule if you have the technique to win this. A lot of times the defenders's defense won't be well enough to make you take more than 50 moves, especially in lower rated games.",
        "96... h2": "Kh8 loses just as fast, after Nf6 h2 Nf4 h1=Q Ng6#.",
        "97. Ng5+": "Checking with this knight on g5 or f8 will win just as fast, since the knight will be guarding h7 in either case, the king will be stalemated in either case, and the g4-knight can complete the same mating maneuver in either case.",
        "97... Kh8 98. Ne5": "This is the final mating maneuver, Black has been successfully cornered into a stalemated position where forced mate exists.",
        "98... h1=Q 99. Ng6#": "This is a complicated endgame to study, and mastering it is a lot more complicated than mastering the knight-bishop checkmate, or the 2 bishops vs. 1 knight checkmate. Even though endings like this are rare, just the ideas and concepts will help you in similar endings, and using these tactical ideas will allow you to win logically in complicated endgames, rather than memorizing billions of possible endgame piece placements and positions that are forced mate in over 100 moves. Extreme calculation and technique is the key to winning endgames, and winning them will take time and effort, so it's best to study endgames rather than openings, since the simplicity of few pieces helps you better understand chess, and improve your overall chess."
    },
    "url": "https://gameknot.com/annotation.pl/complicated-endgame-study-no-1?gm=8788",
    "gameName": "Complicated Endgame Study No. 1",
    "players": "2 knights (6) vs. pawn (1)",
    "opening": "Alekhine's defence (B02)"
}