{
    "moves": {
        "1. d4": "Thomas's usual.",
        "1... d5 2. c4 e6": "I like the QGD for black -- especially if I can play the Cambridge springs variation, which has a lot of nice traps for black.",
        "3. cxd5": "The EXCHANGE?  I had never faced this before... I suppose this is one of the nice things about being a lower-rated player with 5000  games playing a higher rated one with ~ 30 games...",
        "3... exd5 4. Nc3 Nf6 5. g3 c6": "Shoring up the d5 pawn and allowing the queen access to the queenside.",
        "6. Bg5": "A mildly annoying pin.",
        "6... Bf5 7. Nf3 Be7": "Breaking the pin, but perhaps Nbd2 was better, as this is my \"good\" bishop, on a very passive square.",
        "8. e3 O-O 9. Bd3": "challenging my light-square bishop.",
        "9... Bg4": "?  Not a good move.  Moving the same piece twice in the opening is usually a bad idea, but I should've jumped at the chance to exchange the Bf4.  Now, while this pin looks dangerous since the g pawn is out of place, that threat proves to be a phantom.",
        "10. h3": "! A strong move that forces black to either give up the bishop pair or concede a space advantage to white.",
        "10... Bh5": "Wrong choice?  It's hard to find a good move for the bishop.",
        "11. g4": "Rolling the bishop back to g6.",
        "11... Bg6 12. Bxg6": "Now black gets the choice of which pawn to double.  The only compensation I have is that his kingside pawns are pretty far-flung.",
        "12... fxg6": "I choose (for better or worse) to open the f-file for my rook.",
        "13. O-O": "?!  not sure the king wouldn't be safer in the center or on the queenside, where there are no black pieces actively placed.",
        "13... Nbd7": "This should've happened 6 moves ago.",
        "14. Nd2": "Preparing to storm MY king, I see.",
        "14... h6": "Driving the bishop back, in turn; otherwise, the black pawns get undoubled.",
        "15. Bh4 Bd6": "?!  Underestimating the intent of Nd2.  Black has the idea to play g5 and then exchange the bishops on g3, opening the f-file completely.  White has other ideas.",
        "16. f4": "!  Giving white a clear advantage.  Now, Bd6 is a wasted and bad move -- the pin against the queen is strong and g5 is an impossibility.",
        "16... Qc7": "Trying to make the best of a bad situation.",
        "17. Nf3": "The knight has a good-looking home on e5 now that the f-pawn for black is on the g-file.",
        "17... Rae8": "Threatening Rxe3, but white still has...",
        "18. Ne5": "Ne5.  And taking the knight gives white a protected passed pawn on e5.",
        "18... Nh7": "With the idea of g5 on the next move, undoubling the black pawns and gaining a bit of counterplay.  White's response is good and practically forced, but sends the game into a very complicated state.",
        "19. Nxg6": "!?  The best try for an advantage.  White wins a pawn, but with the knight off of the e-file, black has some counterplay.",
        "19... Rxe3": "!  This is the move that gives black the most chances.  Saving the Rf8 with Rf7 just leaves white up a pawn with the better game.",
        "20. Nxf8": "Prove it!  Says white.",
        "20... Nhxf8": "Well, black has sacced the exchange in order to get his pieces mobile, and all five of them are pointing towards the white king.  White has to defend accurately now, as black gets some chances for the exchange.",
        "21. Kg2": "?!  Prevents Rxh3, but I'm not sure this is the best move in the position.  Worth considering are Ne2 and Rf3.",
        "21... Bxf4": "Winning back a pawn and opening more lines towards the suddenly exposed white king.",
        "22. Rf3": "Maybe a move too late.  The king has little business on g2, and black is under no obligation to swap rooks at this point.",
        "22... Ne6": "A solid move, getting the knight into the fray while overprotecting the bishop, the g5 square, and threatening to take on d4.",
        "23. Ne2": "White is threatening exchanges instead of making them... giving black plenty of chances.",
        "23... g5": "Now this move contains a lot of tactical threats.\n\n*This* is my goal when behind -- make the position more complicated and see how the opponent responds.",
        "24. Nxf4": "?  Losing the bishop.  Black can recapture on f4 with check, forcing white to either give back the exchange or lose the bishop.",
        "24... Nxf4+ 25. Kf1": "Rxf4 runs into Qxf4, and white loses even more material in order to avoid mate.",
        "25... Rxf3+": "Suddenly, black is exchanging off WHITE's pieces!",
        "26. Qxf3 gxh4": "Securing a material advantage that will win black the game.  Two knights and a pawn for a rook is a winning advantage.  As black's pieces are more active to boot, the end is near.\n\nNotice that chess isn't lost with one bad move or one mistake (err... often, anyway), it's whoever makes the worst and/or the last mistake.",
        "27. Re1 Nf6": "Preventing the rook from penetrating and preparing to stifle any chance for counterplay with Ne4.",
        "28. Re6": "I thought Re5 was a better move here.  I could win the exchange now with Nxe6, but I thought it was better to play...",
        "28... Ne4": "With the specter of Nd2 , forking queen and king.  White's response is forced.",
        "29. Rxe4 dxe4 30. Qxe4": "Black is now a full piece clear, and has only to find a few good moves to get the queens off to an easily won endgame.",
        "30... Qf7": "!  Solid!  This allows black to start cleaning up, as a knight move will lead to a nifty discovered check.",
        "31. b3": "? I guess this defends the a-pawn, but white really has not much to do here.",
        "31... Nxh3+ 32. Kg2": "?  Allows mate in two.",
        "32... Qf2+": "!  And the finish is either 33. Kh1 Qg1# or 33. Kxh3 Qg3#.\n\nA good game by Thomas, who had me on the ropes after a lackadaisical opening, but I managed to complicate and come out on top.  I know it's frowned upon by GMs, but if you don't give your opponent the opportunity to make mistakes, how are you going to obtain an advantage?"
    },
    "url": "https://gameknot.com/annotation.pl/complications-save-the-day?gm=3607",
    "gameName": "Complications save the day...",
    "players": "tag1153 (1395) vs. ethansiegel (1798)",
    "opening": "Queen's gambit declined (D30)"
}