{
    "moves": {
        "1. f4": "This is from a tournament game that went pretty well for me",
        "1... e5": "Starting point of the tournament, this is the Bird, From gambit",
        "2. fxe5 Nc6 3. Nc3": "I played this move for variety really, my natural instinct would be more towards protecting the pawn, possibly with d4",
        "3... Nxe5 4. d4 Ng6 5. e4 d6": "While I am sure its valid I don't like this move from black, it blocks his dsb, I guess with the intention of c5",
        "6. Bc4 c6": "I don't understand this move, it seems to me to waste a tempo when black is already behind in development",
        "7. Nf3 h6 8. Be3": "I think looking at it now I might have been better to fianchetto this bishop",
        "8... Nf6 9. Qe2": "My intention here was to line my queen up with the black king",
        "9... Be7 10. O-O-O Bg4": "I think if I were black I would have castled here, this move allows me to start pushing my pawns forward. ",
        "11. h3 Bd7 12. e5": "I'm looking to prevent black from castling",
        "12... dxe5 13. dxe5": "Black suddenly looks a little cramped",
        "13... Nh7": "pretty much forced",
        "14. e6": "maintaining pressure",
        "14... fxe6 15. Bxe6 Nhf8": "now blacks king is surrounded I want to get my bishop or my queen onto the h5-e8 diagonal, though the knights could be a nuisance",
        "16. Bb3": "Although this move may not seem the best, the bishop did not move for the rest of the game and proved influential at the end",
        "16... Qc7 17. Qc4": "threatening Qf7 though of course black can castle, if he does then I have Bxa7 and nc5 at my disposal",
        "17... Be6 18. Nd5": "Clearly cxd5 loses to Qxc7",
        "18... Qg3": "I think this is a mistake from black as it takes his queen away from the defence of his king, though he has few options for his queen",
        "19. Bf2": "Qxb loses to Nc7+",
        "19... Bg5+": "Again I am not sure how much this achieves as it takes another defender away from the black king, I can pin the lsb to the king with Rh-e1",
        "20. Kb1 cxd5 21. Qb5+": "I played this in preference to Ba4+ as it keeps open the option of Bxd5",
        "21... Bd7 22. Qxb7": "Possibly not the best, Rh-e1+ might have been better",
        "22... Qxf2": "Although black is ahead on material his position doesn't look that good to me",
        "23. Rhe1+ Ne6 24. Qxa8+ Ke7 25. Qxd5 Rd8 26. Qd6+ Ke8 27. Rxe6+ Bxe6 28. Qxe6+": "Black resigned.\n\nthanks for reading please comment"
    },
    "url": "https://gameknot.com/annotation.pl/concordborns-mini-tournament-iv?gm=42441",
    "gameName": "concordborn's mini-tournament IV",
    "players": "elwoos (1529) vs. mrrosewater (1571)",
    "opening": "Bird (A02), From gambit, Lasker variation"
}