{
    "moves": {
        "1. e4": "From a tournament, my second game with Jbravo58d. I lost the first one on passed pawns. White's first four moves and Black's first 3 are a theme opening of the tournament.",
        "1... e5": "classic response",
        "2. Nf3": "white knight attacks Black's e3 pawn",
        "2... Qf6": "In this variation, black queen comes out on f6 to defend the e3 pawn. I usually do not like taking out my queen early and I think in most cases it is a mistake to defend a piece with a queen anyway.",
        "3. d4": "white attacks the e3 pawn again. The other benefit is that white bishop on c1 has now an open diagonal to take part in the game",
        "3... Bd6": "Black defends it again with the bishop on d6. If it was not for the themed opening with the first four moves set, I would have played d5 to restrict the black queen and c1-g5 to a attack the black queen and after f6-g6, develop my knight on b1 to c3 to defend my e pawn",
        "4. Bg5": "White attacks Black's queen",
        "4... Qg6": "This is the first \"free\" move of black. He moves his queen to g6 and attacks the e pawn",
        "5. dxe5": "White ignores the attacks on the e pawn and takes Black's e5 and attacks the black bishop on d6. Black can play g6xe4 check, and probably the best move for white at that point would be d1-e2. f1-e2 would be met by d6xe5 with a Black strong attack on b2 and White rook on a1. Therefore, if 5... Qxe4+, 6.f1-e1 Bxe5, 7. Nxe5 Qxe5 with a fine game for Black despite being behind in development",
        "5... Bxe5": "Black has now an eye on the rook on a1",
        "6. c3": "a protection against the bishop attack as I was not keen on trading pieces at that point. I was happy to allow the check from Qxe4 as it will allow me to develop white chasing away the Black queen across the board",
        "6... Qxe4+": "The Qxe4 comes with check as expected",
        "7. Be2": "Again not keen on trading pieces. My idea was to castle white Black's king in still in the middle of the board. Nothing works like an absolute pin... There is nothing that Black can attack that is not well defended",
        "7... d5": "Not sure what this move was about. I think Black was trying to open up a1-f6 diagonale so that he can attack my rook but he surely must have known that I was about to develop my knight with tempo by attack his queen. By the queen his queen could not run too far away from the bishop which itself was under attack from the knight on f3 ",
        "8. Nbd2": "I attack Black's queen. She has nowhere else to go but f5",
        "8... Qf5": "As expected, Black's queen in her retreat must protect the bishop. So far so good...",
        "9. Bd3": "White attacks Black's queen. The idea here is to trade piece my white squared bishop with Black's black squared bishop and a strong attack on Black's position. if 9...Qxd3, 10. Nxe5 (a double attack on the f7 pawn and Black queen on d3) Qf5 11.f4 preparing my queen to join the attack after castling",
        "9... Qe6": "Black decides not to trade pieces and retreats again constrained by the cover it must provide to his black squared bishop",
        "10. O-O": "I castle. Now, let's go for the open centre and try and pin a piece to the Black king...",
        "10... Qd6": "Black again takes his queen out of the e file to avoid a deadly pin to the queen. But the bishop must stay thre and wait patiently for the rook pin",
        "11. Re1": "The rook (absolute) pin comes, now Black's bishop is attacked twice. I am expecting 11... Nd7 or Nc6. I personally would have played Nd7, just to allow the queen some breathing space, just in case... ",
        "11... Nc6": "Now Black's queen is cut off from top left quadrant of the board. Just a thought... An attack idea here?",
        "12. Bb5": "I pin the black knight to the king. At that point, I was happy taking the knight out to gain the bishop",
        "12... f6": "The only move really for Black. It allows me a 3rd attack on the bishop",
        "13. Bf4": "White's black squared bishop joins in the attack against the bishop. I do not see any other defence for the Black bishop on e5....",
        "13... Bd7": "Black tries to bring the knight back to the defence of the bishop by breaking the pin. If I am serious about taking the bishop out, then I must take the Black knight out now...",
        "14. Bxc6": "The knight is gone",
        "14... Bxc6": "Black recaptures my bishop",
        "15. Nxe5": "I use the knight to get a discovered check on the Black king, an attack on the queen check by taking out the bishop on c6",
        "15... O-O-O": "Black castles. I am sure he was just relieved to get his king out of the middle of the board",
        "16. Nxc6": "I take the bishop out. At this point, I am up 5 and Black has two choices, take my bishop out (+3), I take his rook (-5) and his retakes my knight for a 4 points loss, or he takes my knight and moves his queen out of the bishop attack for a two points loss",
        "16... Qxc6": "Black chooses the second option. Very sensible",
        "17. Qg4+": "Now for a queen fork with check. The only move for Black in Qd7. 17... Rd7 18. Rc8 mate or Kb8, 18.Qxg7 with knight now on g8 having to be lost to protect the more valuable rook",
        "17... Qd7": "As expected. At this point, I am happy to trade pieces for simplification",
        "18. Qxd7+": "Exchange queens",
        "18... Kxd7": "Here again, Black cannot take my queen with his rook, as that would be met with 19.Re6+ with a forced exchange of rooks",
        "19. Nb3": "Sending the knight out for a raid on Black's position",
        "19... b6": "Black protects the now valuable c5 square",
        "20. Rad1": "I attack d5 pawn and develop my rook. I just love where the Black king is....",
        "20... c6": "Black protects the d5 pawn. So far, so good. I attack, attack, attack. He defends, defends, defends",
        "21. Nd4": "The knight on the move. My idea at that point is just to put the knight deep into Black territory and see what happens",
        "21... Ne7": "Sensibly, black develops his knight and allows (at last, this is move 21!) his second rook into the game",
        "22. Ne6": "Quite happy to fork the rook on d8 and g7 pawn. Black must move his rook and at the same time nurse his pawn. I must admit that I don't like having enemy rook or queen on the same file as my king, no matter now many pieces are in between. But then, I have my bishop and as long as I make enough room for my king, the king, bishop and pawn taken together should be able to defend against a double rook attack",
        "22... Rdg8": "As expected. Now one of Black's rook is on the same file as my king. Danger!!!",
        "23. h4": "I I just go about make room for my king and at the same time giving from protection to a pawn attack against my bishop",
        "23... Nf5": "Black attacks the pawn. We can easily deal with this",
        "24. g3": "White shores up the pawn",
        "24... h6": "Black prepares for opening the h file",
        "25. h5": "I go meet his pawn attack. However he moves his g pawn, I will be able to meet it. And once his g pawn is out, Black's knight cannot be efficiently protected as it has few safe squares to go to",
        "25... g6": "The pawn moves. I must take it out. I have something in store for Black. I know he is trying to advance his h pawn to open up my king position. For my part, I just want to open up the centre...",
        "26. hxg6": "I take the pawn",
        "26... Rxg6": "I recaptures my pawn with his rook",
        "27. Nc7": "The idea is is to attack the d5 pawn which would allow a double attack on Black's king and undefended knight. This is one of the reason I do not like having rooks and queens across my king but thankfully for me, Black is oblivious to what is about to happen",
        "27... h5": "As expected, Black start descending on my king",
        "28. Nxd5": "Very few moves possible here, worst case I am up another pawn and the centre is open. The least damage is to capture the knight and limit the overall loss to two pawns. I do not see any other reply. Do you?",
        "28... cxd5": "Black takes out the knight, sensibly enough",
        "29. Rxd5+": "Double attack with check on the knight",
        "29... Kc8": "This is a big mistake. The king should not be in the same line as an undefended piece. A better move would have been king in c6. That has the double benefit of getting the king to participate in attacks later and putting immediate pressure on my rook",
        "30. Rxf5": "I take the knight",
        "30... h4": "Black's descent resumes. Very few moves, I can go for actually... I cannot take the pawn out",
        "31. Re7": "I decide to ignore the attack, I have enough pieces (with my king) to take care of defence. I sent the rook to the 7th rank for all sorts of good reasons: e.g. if I can get my other rook on the 8th, it is mate",
        "31... hxg3": "Black could have played 31... h3 32. Kh2, which would have gotten him nowhere",
        "32. Bxg3": "My loyal bishop holds the fort",
        "32... Rgh6": "Happy to allow check, now I can dine on a pawn",
        "33. Rxa7": "I take the pawn. One of two things, either I get my other rook on the 8th rank once black has vacated it on his search for a desperate mate, or I allow one of black's rook to roam off his other rooks' file for a skewer on h8",
        "33... Rh6h1+": "As expected, a useless check",
        "34. Kg2": "I control the h2 square twice. Nothing Black can do here",
        "34... Rb1": "As expected, Black is blindingly trying to recover some of his losses and forgets (or does not realise at all) the skewer on the 8th rank",
        "35. Ra8+": "There, game set. The position is irretrievable. Black resigns"
    },
    "url": "https://gameknot.com/annotation.pl/confederations-cup?gm=24281",
    "gameName": "Confederations Cup",
    "players": "arnihilator (1503) vs. jbravo58d (1539)",
    "opening": "Greco defence (C40)"
}