{
    "moves": {
        "1. e4 c5 2. Nf3 d6 3. Nc3 Nf6": "Playing with the idea in mind that this might transpose into the open Sicilian with d4.",
        "4. Bc4 e6 5. O-O Be7 6. d3": "Transposing into a closed Sicilian black usually prefers to have his bishop posted on the long h8 a1 diagonal, but due to the move order the bishop is on a less desirable square.",
        "6... a6": "This move is common for the Sicilian taking the b5 square from the white pieces it also prepares the push b5.",
        "7. Bg5 Nc6 8. a3": "Not sure if this was a waiting move or if white wanted to prevent Nb4 which I wasn't going to play my knight is more important right now defending e5.  Another possibility was this was to prepare b4 but I don't find that a good plan and I stopped it.",
        "8... b5": "Natural continuation the bishop doesn't look good on d7 to me.  I'd much rather have it slicing into whites king side on b7.",
        "9. Bb3 O-O 10. Ne2": "Gives up the control of the d5 square so I take it.",
        "10... d5 11. Bxf6 Bxf6 12. c3 Bb7 13. exd5 exd5 14. Nf4": "Threatening the d5 square.",
        "14... Ne7": "I defend the square and prepare to bring my knight to f5 or d5 at a later date.",
        "15. Bc2": "?!",
        "15... d4": "! a positional move isolating the d3 pawn and making the last move look inferior. ",
        "16. cxd4 Bxd4": "This seems like a strange move giving up the bishop pair however I felt that a pawn on d4 is not as effective as my Queen on d4 so I gave up the bishop pair for a structural advantage which is usually the long term advantage of the bishop pair anyway.",
        "17. Nxd4 Qxd4 18. Qc1": "defenses both threats of Qxf4 and Qxb2.",
        "18... Nd5": "Attacking the knight on f4 and centralizing my knight.",
        "19. Nxd5": "A knight trade.",
        "19... Qxd5 20. f3": "blocking the threat of Qxg2 but puts another pawn on the same color as the c2 bishop.",
        "20... Rfe8": "Takes the open file.",
        "21. Qf4 Re2": "The rooks best rank ! the black pieces are dominate in this position.",
        "22. Rac1 Rae8 23. Qg3": "? allows black the opportunity to come into the position.",
        "23... Qd4+ 24. Kh1 Qxb2 25. Rfe1": "And everything looks safe however this is not true.  Black has the winning tactic Qxc2! which I saw when I played Qd4+ coming into b2.  The only move white had was Bb1 and white looks really passive not to mention 2 pawns down.  However this is much worse.",
        "25... Qxc2": "!! Rxc2 Rxe1+ Qxe1 Rxe1# game over.  Rxe2 Qxc1+! Q(R)e1 Qxe1+ R(Q)xe1 Rxe1#.  Notice that both my rook and queen are totally protected form capture. ",
        "26. h3": "!? White releases the tension on his back rank.",
        "26... Re2xe1+": "begin to exchange down.",
        "27. Rxe1 Rxe1+": "? Bc6 was better due to problems with the b7 bishop.",
        "28. Qxe1": "I'm not out of the woods yet white has a chance to attempt to get my Bishop on b7.  Which it looks like he could have done but he missed the chance to get back into this game.",
        "28... Kf8": "defending myself from back rank mates.",
        "29. Qe3": "? the move here was Qe5! which would end up making the loss of my b7 bishop unavoidable.  However I believe after Qe5 black is still winning but white would have some drawing opportunities.",
        "29... Qc3": "? Trying to get my queen back into the protection of my king however my bishop is still lost after Qf4.  I should have played Bd5 moving to e6 should white threaten to take it.  White however doesn't see his chances and resigns here.  It would have been a hard fought endgame for me to go on and win after loosing my bishop.  I believe black is still winning but you have to give a fight when the game is still very close being up a few pawns is still hard to win in a queen endgame, especially with my exposed king."
    },
    "url": "https://gameknot.com/annotation.pl/consider-the-possibilities?gm=47721",
    "gameName": "Consider the Possibilities",
    "players": "andru2 (1615) vs. zwarwiz (1843)",
    "opening": "Sicilian (B50)"
}