{
    "moves": {
        "1. d4": "It was hard to know and how much participation we were going to get.  But, Mikko decided on 1.d4  It's a common move.",
        "1... d5": "And, I stick with what I know.",
        "2. Nd2": "ynwa77: E3, then c4?  Anyone?  knightrider62: C4 straight away e3 blocks the bishop in.  easy-win: My vote is for knight d2  ynwa77: Why Nd2? That sounds interesting.  easy-win: Nd2\nIs actually the prelude to an opening I am quite familiar with. \n\nHowever the preceding moves must be precise, due to the \nnature of the opening. Any variation will absolutely diminish \nthe possibility of success.  ynwa77: Then I also vote Nd2  knightrider62: I will join you Nd2 sounds intriguing  I made my move Nd2.",
        "2... g6": "I played this.  Although not a KID.  I am used to the variations which involves a very early fianchetto by black.  I'm not used to seeing 2.Nd2 being played, and as we know, openings can be very intense.  So, the idea is to adjust to what you're not used to by accepting it for what it is, just like how it is in Yoga.  That's why I expect the unexpected.",
        "3. f4": "easy-win: Vote 3.f4 A move that needs to be supported eventually but not immediately  ynwa77: I'm happy to stealth's idea. I want to see how this opening works.  knightrider62: Will follow stealth, likewise f4  ynwa77: I made the move.",
        "3... Bg7": "Of course, my idea of a good time is being able to complete fianchetto.  I enjoy having the longest diagonal for, at least, one of my Bishops.  In addition, I do have a threat against their d4 pawn.",
        "4. b3": "ynwa77: I vote b3 or e3.  knightrider62: My vote is b3  easy-win:  I concur 4.b3\nTime to protect the pawns in front.  ynwa77: B3 it is then.",
        "4... Bxd4": "And, this was played to win the pawn that I mentioned on my last move.",
        "5. Rb1": "ynwa77: I can think only Rb1. We still gonna lose our change to castle but at least rook is safe. \nAny other thoughts?  easy-win: 5.Rb1\nOf course, what I cannot understand is why you suggested \nb3 to begin with. \nIn doing that you went off the stonewall opening, and offered \nthat free pawn on d4. \n\nAlso, you did not give enough time for others to offer suggestions, \nand thus allow for us to change our vote, if we were confused with \nthe move b3. \n\nI thought you had some devious plan by suggesting that move, \nbut now I see that there was no logical thought behind it. \n\nIf we are to win this game, please give others and myself plenty \nof time to reconsider, in case of a typo, or some other reason.  ynwa77: I apologise. It was my fault. In future please notice, that I'll only make my suggest and if I have plan I will share it with you. \nI want to be positive. We will not be down in material and if we have to change wN to bB, our position is not too bad. Of course it would be nice to have castle, but we can manage without it. \n\nMy intention is never hurry other players. You can take all the time you want. We need to just learn how we each other think and things will get smoother. \n\nI want to think I made my blunder now and I make better moves later. \n\nAnd if you two think it is better to sacrifice R and keep castle still available, it's fine to me.  And I know this is just trying to explain things better, but we will have f,g and h pawns free to move them forward and that way we can make position unorthodox and unfamiliar for jkarp. \nBut that is something we need to talk later  ynwa77: And of course there is still c3 available if we want to go pawn down but keep queen side castle open.  knightrider62: Rb1 is the only move.  penguin_: Late entry I agree with Rb1  ynwa77: I will move Rb1 ",
        "5... Nf6": "ynwa77: Basic rules for this kind of game\nShall we have open discussion of this game or do we just talk about next move and why it is done? \nI think it would benefit us all if we can toss ideas and possible future moves and positions even if opponent can see it.  penguin_: I agree the major objective in these type of games is to learn winning is secondary.  knightrider62: Nd-f3 bringing the knight to a better square and attacking the bishop twice.  easy-win: Nd-f3 is not recommended by instructors\nThe point being is that if you move the same piece twice in the opening \nyou lose tempo since you could move another piece for advantage, \nin this case, the knight on g 1 has not been moved and will serve the \nsame purpose as moving that d knight. \nAlso, it makes more room for castling on the king side, if that is what we \nneed to do later. \nIn the opening, it is always good to place your pieces in such a way that \nthey will have more control like future attacks, and to defend if possible. \n\nAlso we should place the number in front of the suggested move, so we \ncan keep track of the number of moves we have made, and when to make \nthe next move. \n\nIn this case, it is premature to suggest a move before the opponent moves \nso that we can know what would be the best move after that move is made.\n ?! On a separate note: This was played to develop my N and prepare to castle.  But, better was 5...Bc3 to pin the N right away.  Once pinned, it would be difficult for them to break it.  I can only hope that white does not move their Nd2.  If they do, this opportunity is gone.  ",
        "6. h3": "easy-win: Vote Ng-f3\nIn making this move, we are controlling the way the \nopponent moves, by attacking. \nThe opponent will either move the DS bishop, or might \nwant to protect the it with a pawn or a knight. \n\nIt is always good to try to figure out what we think \nthe opponent will react to what we do. \nIf we can accurately figure that out, we have an \nadvantage. But in order to do this, we have to \nconsider the response/s as close as possible, \nwhich is not simple, especially when the opponent \nhas a much higher rating than we have.  knightrider62: Ok I agree as it has the same purpose as my suggested move nf3 it is.  ynwa77: Do we have plan if black moves next Bc5 or Bb6? Because if we miss next move it is going to be Ng4.  I think we should also consider h3. If we have to exchange N to B, we have strong B. \nJust thinking possibilities.  easy-win: The question is if Bc5 or Bb6\nWe need to keep developing, but let us wait what our opponent does first. \n\nOn that move of h3, again we have to wait for a move, to counter the move. \n\nThe blunder b3 has put us at a disadvantage which will be like waiting for a wound to heal  ynwa77: So is right way to play Ng-f3 and then, if black makes Bc5 or Bb6, h3?  easy-win: I think for now that is the best we can do, but let's see if anyone else \ncan make a better suggestion. \n\nOn h3 the knight can capture that pawn. \n\nB-b5 or c5 and we should fianchetto out BSB. \n\nStill we should wait for others. \n\nBy the way, how many are participating in the group?  penguin_: h3 White has gotten itself into a bit of a hole, however it can recover. I vote h3 to keep the B and N away.  easy-win: Votes\nStealth-invader 6.Ng-f3 \nknight rider 6.Ng-f3 \npenguin 6.h3 \n\nflatus77: not yet but to answer the question, h3, after Ng-f6, yes.  ynwa77: I prefer h3 first, but I can live with Ng-f6' then h3 if necessary too. I don't see any instant danger there.  penguin_: Take a look if Black plays Ng4 followed by Ne3. See what you think?  ynwa77: Ou! \nI saw only fork Nf2, not Ne3. So I vote H3.  knightrider62: I change my vote to h3 for the above reason",
        "6... Bc3": "penguin_: Question ?\nSo who is playing for black?  knightrider62: Joe Karp is.  It was his idea.  jkarp: Yes, I am black.  penguin_: OK I am with it now.  Be it note that, for the most part, I wasn't reading their posts.  But, as I was about to post this move with the fen this question came out.  Whenever something like that happens, I clarify it to avoid confusion.  On a seperate note, as implied, after I forgot about the opportunity, when playing 5...Nf6 I could've pinned at once.  I was just hoping that the opportunity wasn't gone.  But, with 6.h3 being played it was around, and I took advantage before that opportunity was gone.",
        "7. Ngf3": "easy-win: Vote 7.Nf3 This move will connect the knights,  knightrider62: A very good idea, I agree  penguin_: Bb2\nI would like to see us play Bb2 and force blacks play with his B. Otherwise he may advance to Ne4 and then to Nf2.  easy-win:  If we move our bishop to b2\nThen white will trade bishops in all likelihood, \nSince we are already at a disadvantage by \nlosing our b pawn without compensation \nI believe what we should strive for is to \nmaintain a positional balance until we \ncan find a point in the game when we \nmight be able to find it possible to \ngain an advantage.  ynwa77: E3\nIf we move Bb2, then black d4 and he still control tempo. With e3 we can next move Ne2 and give pressure to black's B. \n\nOr we can after e3 move Bb5+ and if black c6 we then Nf2 and I think we have better position. \n\nI'm not sure about this, but like to get your comments.  knightrider62: I still like Nf3 it is a developing move we need right now  I mean the N on g1  penguin_: Ngf3\nI will go along with Ngf3  ynwa77: Correction\nI meant e3, then Ne2, not Nf2. Sorry. \nI still think that is best option. I think trading our N to blacks B would benefit us.  easy-win: votes\nNgf3 3 Stealth-invader--penguin--knightrider62 \n\ne3 1 flautus77   ",
        "7... Qd6": "Just before making this move, there was some questions.  As it took me a while to make moves.  In fact, I postponed my games.  And, with the question came clarification.  knightrider62: What is happening about this game?  jkarp: Up until today, it was white's turn. But, now it is black's turn, Sue. I am going to take some time, but it is worth noting that what delayed this game was my decision to postpone. The final decision came as a result of the Blizzard which wasn't as bad. But, even without, I was considering postponing, anyway, because of how busy it got. It was mainly work related, but there were other things to. What's important to note is that this is why the game took a pause.  When I said as bad, I meant as bad as I thought.  What happened is that a Blizzard Warning was issued for my area.  And, the forecast called for 18-24 inches of snow with 50+ mph winds.  Power outage was a potential.  However, the wind wasn't as bad, and sleet mixed in.  Thus, all in all, I got about a foot of snow, and no power was loss.  Yet, a lot was going on, and postponing, by my books, was the right call.  On a separate note: The idea behind this move is that I am now threatening to win another pawn.",
        "8. e3": "easy-win: vote 8.e3 pawn f4 is attacked by the queen  knightrider62: I agree with you stealth.  penguin_: I agree e3 is the correct move  ynwa77: What do we do next if black Ne4? I see there only instant problems. If we have counter for that move, I agree e3  easy-win: ynw\nNe4 does not present a serious problem that I am able to discern. \nAmong other moves which can be made next is the possible Bb5+. \nI have found that extensive analysis into the possibilities that exist, \nare only as effective as the analyzer. \nFor this reason, we have several opinions from which to decide \non each move. At the present position, if anyone can identify a \ndanger on the suggested move, I ask that it can be discussed \nbefore we decide to proceed. \n\nynwa77, could you expound on the detrimental positional disadvantage \nthat you find in the suggested move, e3?  ynwa77: Stealth, I trust your analysis\nI am concerned the fact that black is connecting his pieces and is locking our pieces. I also don't like the idea that black is dictating tempo and therefore would like to try Ne5, then exchange bishops and attack to Q with both Ns. \nI don't have clear plan, so I don't want to ruin everybodys game because my gutfeeling. \n\nHere is way better players than me so I'm with e3.  easy-win: Not at all\nI always welcome other options, and am always open to receive \nother views which may be refreshing, such as yours. \n\nDo not ever hold back on your opinions, maybe no one else might be \nable to see something you can see. \n\nIn your suggestion of Ne5, neither one of our N's can move there, \n(to e5), and at this time, our pawn at f4 is in danger of being taken by \nthe queen on the next move which will also enable it to move to \ng3, checkmate! \n\nHowever, you are correct in that black has the advantage. \n\nWith e3 we may be able to free our WSB thus opening the back \nrank for king side castle. \n\nAt present, our N's are connected, giving our king more security.  ynwa77: Why can't we move N from f3 to e5?  I withdraw my previous question As I see now that we will lose N that way.",
        "8... Ne4": "The logic behind pinning their Nd2 was to allow this move.  As now, I have a plan against them.",
        "9. Bd3": "knightrider62: We are in a bit of trouble due to that earlier move of b3. Looks like our only move is Bd3 . 1. Bd3 BxN+, 2. BxB NxN. 3.QxN. The exchanges are equal but black is a pawn up from earlier and I'm not sure who benefits from the trades.but at least we develop two pieces.  easy-win: VOTE 9.Bd3 The best move in my opinion. \nIt develops our WSB and clears the f1 and g1. \n\nKnightrider62, It would be preferable if you could submit your vote with you explanation. \nBecause this way we can accumulate the votes necessary for our next move.  ynwa77: Vote Bd3\nIt opens chance to castle. \nI like to think situation positionally, and that Bc3 is disturbing me way too much. It is something I need to work with inside my own head, but right now I'm just scared that B is getting as big trouble. As I said, it's just a feeling.  easy-win:  ynwa77\nIt is not good to worry. \nWhen we see a position where the opponent has placed a piece \nor pawn in a threatening square, what we should do is to check how \nmany of our own pieces are defending, and if our defense is \nadequate, the next step is to see if it is possible for the opponent \nto bring additional pressure to the piece, and if so, is there a way \nto increase the defense, or parry with an attack of our own.. \nIn the present diagram, our d2 knight is defended 4 times, \nthe threat consists only of a knight, or knight bishop exchange \nbecause we have four defenders to the knight. \nThe move that might force the bishop away could be B-b2 \nif the bishop moves to the edge a file, then the rook falls. \n\nBut for now, I believe Bd3 is a safe enough move that \nfavors our development. \n\nBut I am always open to suggestions and/or discussion. \n\nThe bottom line is, not to worry, but to study the position \nand decide the best course to follow.  penguin_: Vote Bd3\nBd3 is the best we have at the moment. Then we may be able to castle and start to bring some pressure on black. White got into trouble early but we can recover.",
        "9... Ng3": "knightrider62: Newa to me it's the first I have heard of it.  easy-win: OKAY On with the game. \nWe shall wait for Joe to make his move, the go from there.  Thanks to all, for being attentive of the game.  And, I have played as this was the plan behind 6...Bc3 followed by 8...Ne4  As now, white is forced to give up their right to castle.",
        "10. Rh2": "knightrider62: My vote castle I vote we castle out of this threat by black  easy-win: Vote 10.Rh2 knightrider62, it is not possible to castle, since the black knight \ncontrols a square the king must cross. \nOur Rook at h1 is being threatened by \nthat knight, therefore it is imperative \nto move it away from h1.  ynwa77: Vote 10.Rh2 I agree Stealths point of view  penguin_: vote 10 Rh2\nSounds good to me ",
        "10... O-O": "ynwa77: Suggestion\nI think we should decide do we want to play this game orthodox or unorthodox way. \nConsidering the situation and nature of this game, it might be good idea to try something we don't do in normal games. \nI still want to win this game and play as good as I can, but maybe we can expand our game a bit. \nFor example in current position I normally wouldn't consider moving Kf2 but that's only because it looks risky. But is there some benefits in that move if we can use K active piece instead thinking it as something that must be just protected? \nAny thoughts anyone?   knightrider62: There are always exceptions to the rules. So it is the demands of the situation that we should meet. Not Wether it is orthodox or not. Trading a rook for a knight is not a. Good idea so cannot be considered as a worthy counter attack.  On a separate note: although white's opportunity to castle is gone, black's is not.  So, I took advantage of that opportunity while it was still there.  In addition, to avoid confusion, since I postponed, I notified everyone that I'm taking a break from my games. redfoxrising: Jkarp has paused Joe has a day vacation set, Now is a good time for white to discuss their next move.",
        "11. Bb2": "penguin_: Discussion play Kf2 If we play Kf2 I don't think we will see Ne4+ , because the following would likely be the play out. \n2.\tNxe4\tdxe4 \n3.\tBxe4\tand we get back a pawn. So I like Kf2.  ynwa77: But isn't next move Qxd1? Or am I missing now (again) something?  penguin_: Good point Yes it is if you look at one more move.  knightrider62: i am confused why would black move Nh5 after Bb2 Bxb2, Rxb2?  ynwa77: How about Nd4?\nIf black dont make exchange Bxd4...exd4 we can Nb5  easy-win: Vote 11.Nd4\nynwa77 \nI like your suggestion, please vote for that if you still like it. \n\nknight rider62 \nI liked your suggestion too, but I voted for Nd4 as ynwa77 because \nI like it a little better.  penguin_: vote 11 Bb2 My vote is for Bb2  ynwa77: Vote 11.Nd4\nI think black needs to play very well to maintain it's pressure after this move.  knightrider62: Vote Bb2\nMy vote is with penguin's suggestion Bb2  ynwa77: If we move Bb2\nAnd black responses Qc5 what do we do next? \nIf we try exchange, then \n12. Bxc3...Qxe3+ \n13. Be2....Qxc3  knightrider62:  I change my vote to Nd4\nI change my vote to Nd4.  penguin_: Look at this if we play Bb2 & Black plays Qc5\n1.\tBb2\tQc5 \n2.\tNd4\tBa5 \n\nWe gain some control of the center and open it up  Could even follow with Qf3\nCould even think about following with Qf3 and consider driving the N away.  ynwa77: Penguin,\nBb2 looks actually pretty good way you explained it, but I still like Nd4 more  penguin_: Here is an Nd4 senario\nNd4\tBxd4 \nexd4\tQxf4 \n\nnow we are down 2 pawns and the K is exposed to their Q  easy-win: penguin\n1.\tNd4\tBxd4 \n2.\texd4\tQxf4 \n3.\tNf3\t \n\nAnd the black queen is exposed to our BSB.  penguin_: Stealth\nAgreed but we are still down another pawn and black can take the Q to a number of safe positions including Qd6. \nDon't see how we come out ahead on this or even even. Vote Bb2\nI still prefer Bb2 my vote is Bb2  falcon67: My vote is Bb2.I also looked at Moving the king to f2.It is an idea .Something to think about though.  knightrider62: Why is it good to trade in this position where we are a pawn down or does it only matter not to trade when we are a piece down. I like Bb2 though and also Kf2 can't make up my mind which to vote for.  falcon67: It would be good to hopefully trade off queens at some point .Yes we shouldnt just trade off a bunch of pieces sorry my bad lol.My vote is still Bb2 for now.  knightrider62: I vote to change move I change my vote back to Bb2 along with penguin and falcon67.  redfoxrising: I'll take part and sggest Bb2\nI will also suggest the Bb2 move\n  \n",
        "11... Qb4": "In this position, I didn't want to be the first one to exchange.  As I had considered 11...Bxb2.  But, after that exchange, their Nd2 would no longer be pinned.  My idea was to keep it pinned.  However, I think that better might have been 11...Bb4 or 11...Ba5 to try to avoid the exchange.  As my B was more active.  On the other hand, when all is said and done, the pin will remain.",
        "12. Bxc3": "knightrider62: if we play a3 the queen will either go to a5 where it still AIDS the bishop on c3 or to b6 where it threatens to take the pawn on e3 and give check looks like a trade of bishops is inevitable.  redfoxrising: my suggestion might be to use the king as an attacker Kf2  easy-win: Vote 12. BXB Moving our king away from our d2 bishop is a blunder.  We lose the bishop without recompense.  penguin_: Vote 12 BxB I like the BxB best right now.  knightrider62: Vote BxB I also think BxB is best.  falcon67: I vote for BxB too.  ynwa77: Vote a3\nA3...Qc5 \nNd4...Bxb2 \nE4...Qc3 \n\nAnd this is only worse option I discovered.  easy-win: Ynwa77\nI cannot see too much harm in a3, it is just that \nif we allow a build up around our king, it may be \ndangerous by allowing black to increase tension. \n\nWe need to allow more time for two more votes, \nbefore making a determining continuation.  penguin_: Playing a3\nI must be missing something somewhere, but when I play the moves as suggested by ynwa77 and play blacks it's best moves as shown below we end up down 7 instead of down 1? \n\n1. a3\tQc5 \n2.Nd4 Bxb2\t \n3.e4\tBxd4  easy-win: Penquin\nYou are correct if we follow that sequence. \n\nI only considered a3 to move the queen away, but \ndid not care to analyze further because of my \nvoting preference for BXB. \n\nThanks for your input ",
        "12... Qxc3": "ynwa77: Penguin If we play way you post starting a3, we would take black's Q next move and then be +2.  easy-win: May I humbly suggest\nLet's put the a3 move behind us for now, \nand just wait to see what Joe moves. \n\nOkay?   Meanwhile, this move was forced to prevent the loss of material.  I think that I probably would've been better off to retreat, as noted on my last move.  But, I'm happy at where I am given that white's N is still pinned.   ",
        "13. Kf2": "ynwa77: Vote Kf2 Seems logical and I dont see any instant danger there.  falcon67: I vote for Kf2 as well force the knight to move.  redfoxrising: kf2 is mine also  easy-win: Vote 13.Kf2\nThe only logical move at this time. \nOur d2 knight no longer needs 2 guards, and we \nwill rid ourselves of the pesky knight threat.  penguin_: Vote 13. Kf2\nI am good with this, white is breaking Blacks momentum.  knightrider62: Vote Kf2\nI agree with this majority vote. ",
        "13... Nh5": "This is what I had overlooked.  I was thinking that I'd allow the exchange and keep the pin, but similar to a loss against Joann, followed by, the loss with Jack Stockel, I forgot that the K could move.  So, I really should've retreated earlier.  As now, I don't know where to go from here.  ",
        "14. Nd4": "easy-win: Vote 14.Nf-d4\nThe pawn at c7 will probably threaten that knight on the \nnext move, however, we can find an excellent square \nfor it, if that happens.  redfoxrising: my vote is same 14. Nfd4  ynwa77: Vote 14. Nd4 Seems logical and we start to dictate the tempo.  falcon67: Yes my vote is for Nfd4 as well.  knightrider62: Vote Nfd4\nMy vote also is for Nfd4.",
        "14... c6": "I gave this move a lot of thought.  In other words, I trying to figure out what to do and was struggling.  For one thing, I don't like blocking squares for one of my minor pieces.  But, white is threatening 15.Nb5.  With which, they'd be guaranteed to win a R and pawn for free, given that it can capture on c7.  So, I thought that this move was my only option.  14...a6 was also an option.  But, I didn't think it through well enough, as there was another option that I forgot.  Best would've been 14...Bd7.  It was a case of Tunnel Vision as I focused too much on the threat but forgot that my LSB could've covered the same diagonal as the b5 square.  And, it would've developed another piece.",
        "15. Ne2": "ynwa77: Vote 15. b4 Black has only one move to escape and if he makes that we still can put pressure other side of board.  easy-win: Vote 15.N-e2\nUpon moving the last suggested move, 15.b4 the queen will move to \na3, and since it will threaten the b2 pawn, I do not see the advantage. \n\nBTW My user name will be easy-win in the near future.  ynwa77: If we b4\nAnd black Qa3, we can g4 and put pressure to black and try to make him make mistake. If he plays right he can escape, but isn't that case in every move?  easy-win: ynwa77\nI went to the analysis and followed the moves \nwhich ended with the knight all the way to the \n7th rank, and still cannot see a good benefit.  ynwa77: Steath-invader\nThere is quite many different possibilities and if Joe plays everything correct there will not be advantage in pieces to us. My point is that there are many moves where we can put pressure to black and that way he could make wrong move. \nIf you think time is not right yet then we need to wait for better position, but I like my move no matter how much I think of it. \nWouldn't be first time I'm wrong tough.  easy-win: ynwa77\nUpon analyzing for the third time, here is my take on your suggested move. \nPlease note we will have lost another pawn on a 3 in this sequence.. \n\nPlease send me your analysis, and perhaps I may be able to consider the advantage. \n\n\n1.\tb4\tQa3 \n2.\tg4\tNf6 \n3.\tg5\tNh5 \n4.\tBe2\tQxa2 \n5.\tN2b3\tQa4 \n6.\tNc5\tQa3 \n7.\tRb3\tQa  falcon67: My vote is for Ne2 as well.  penguin_: Vote Ne2 I'll go along with Ne2.  redfoxrising: same 4 me Ne2 \n",
        "15... Qf6": "I thought about where to move my Q.  But, after something like 15...Qa5, they have 16.b4  And, if I played 15...Qb4, they hit it again with 16.c3  So, I didn't want to lose further tempo, and therefore, played this.  As now, there's also better mobility with my Q.",
        "16. Nf3": "easy-win: Vote 16.Nd-f3\nThe idea here, is to keep the queen from coming to \nh4 with a check. \nAs it is now, moving our knight to g3 would entice black \nto exchange knights, when we would then put our king \nat a more vulnerable square, where it could be attacked \nby a king side pawn storm, backed by the queen and the \nwhite bishop at c8. \nAlso that pawn on e3 is providing necessary protection \nto our center pawn at f4, \nIf the black e pawn jumps two squares to e5, we can not \nmove it, because it is pinned at this time by the queen, \nbut with a knight on f3 we can capture that pawn if it \nmoves there if he were to move it. \n\nWhen it is our time to vote, we should analyze by \npressing anywhere on the board with our cursor.  redfoxrising: Same as Stealth I Vote 16.Nd-f3  falcon67: I vote for Nd-f3 as well.  penguin_: Vote 16.Nd-f3 I am good with this.  ynwa77: Vote 16. Nd-f3 Seems logical move.  knightrider62: Vote Nd-f3 I agree., also. \n",
        "16... Bf5": "The reason behind this move is that it develops.  But, I am now ready to exchange.  I felt that my B was less active then theirs.",
        "17. Bxf5": "redfoxrising: I vote for Bxf5, this takes our LSB's off the board (there is no other place to put or LSB) I't better than playing c3 or c4 as it would pin our Bishop  easy-win: I vote 17.BxB\nBlack will take bishop with the queen or the g pawn \nIt will be to our advantage either way, after 18.p-g4 \n\nHowever, as always, I invite you to please examine the whole board carefully \nto see if you may be able to discover something better. \n\nIf you do, please explain in detail why another move might be better.  falcon67: Im good with the move BxB as well.  knightrider62: VOTE BxB I vote for the same BxB  penguin_: VOTE BxB I vote for the same BxB. VOTE BxB I vote for the same BxB.  ynwa77: Vote BxB. Don't see any other option.",
        "17... Qxf5": "?? I took back this way.  As I thought that taking back with the g pawn would expose the K.  The idea is not to open it too much, unless it's absolutely necessary, or it's the endgame.  But, this is one of those times where it was necessary.  So, 17...gxf5 because of what's about to unfold.  Believe it or not, I have overlooked these kinds of things before, so there was something for me to learn.   ",
        "18. g4": "easy-win: Vote 18.g4 \nWhat I see, is two advantages, \n\n1.To fork the queen and the knight \n\n2.To clear the g file for possible future aggression  falcon67: Yes g4 is my vote as well .Yes forking queen and knight resulting in opening g file .Good analysis stealth.  redfoxrising: g4 for me also.  ynwa77: Vote g4 Seems very good.  knightrider62: Vote g4 I agree attacks queen and knight winning the knight.  redfoxrising: g4 is good for me.",
        "18... Qe4": "I also could've retreated to e6 or d7, but seeing that they're now going to get the advantage, I'm doing the best that I can to work around it.  My idea is trying to put pressure on both of their N's.  But, this move is exactly why 17...gxf5 was essential.  An important lesson is to be aware of these forks by trying to figure if there is something like a pawn or a piece, with which they can attack two pieces.  It seems basic, but for me, it isn't.  It's also about asking myself if a piece is going into an attack which is what allows the fork.  In addition, penguin_ left my club because of that mistake.",
        "19. gxh5": "easy-win: Vote 19..gxN As planned we can take a knight and lose our g pawn, which will open \nthe g file for further aggression.  ynwa77: Vote 19.gxN I agree with Stealth-invader  knightrider62: Vote g xN\nI agree gxN stealth is right  falcon67: Yes i vote for gxK as well.  redfoxrising: 19.gxN for my vote.\n",
        "19... gxh5": "With the mistake that I made, I had to capture to get a pawn as compensation.  As otherwise, I would've wound up being down a piece for a pawn.  By playing this, I have two pawns, in return.",
        "20. Ng3": "easy-win: Vote 20.Ne-g3 This move is prelude to the attack on the king which is now exposed at the g file.  ynwa77: Vote 20.Ne-g3 I was first thinking Ne-c3, but easy-win's idea is better.  knightrider62: My vote Ne-g3 My vote is Ne-g3  falcon67: My vote is for Ne-g3 as well.  redfoxrising: my Vote Neg3",
        "20... Qg6": "The idea behind retreating here, as opposed to, e6 was an attempt to put pressure on their Ng3.  What I'm keeping in mind is that they can't play 21.Kg2 without walking into a pin.  Not surprisingly, there's no pressure, but I'm doing what I can being that my advantage has been gone for a while.",
        "21. Rg2": "easy-win: Vote 21.Rh2-g2\nIn my opinion, it has become apparent, that \nBlack's last move has entirely changed the the complexity of \nthe game to the point that instead of another normal knight \nmove, may be slightly more advantageous to resort to a different \nresponse in an attempt to abbreviate our efforts.  redfoxrising: Vote 21. Nfe5\nput pressure on the Q for now with Nfe5. I also support easy's suggestion as my 2nd choice, NOT 1/2 Vote on each...  easy-win: redfoxrising\nThe vote Nf3-e5 is also viable. \n\n1.\tNe5\tQh6 \n2.\tNxh5\tQe6 \n3.\tRg2+\tKh8 \n4.\tQd4\tQxh3 \n5.\tNd7+\tf6 \n6.\tNxf8\tNa6 \n7.\tNxf6\texf6 \n8.\tQxf6#\t \nCHECKMATE \n\nI believe we now have a won game either way, \nhowever as I mentioned in my last post, \nmoving R-g2 may abbreviate (shorten) the \ngame, and we can move on to another. \n\nOther suggestions are welcome \n\n1.\tRg2\tQh6 \n2.\tNxh5+\tKh8 \n3.\tQd4+\tQg7 \n4.\tQxg7#\t \nCHECKMATE.  falcon67: I vote for Rg2  knightrider62: I vote for Ne5 as Black's queen would probably move to f6 if we moved the rook to g2.  easy-win: Knightrider62, I would like to point out that if the black queen moves to f6 \nafter the move Rg2, as you note, we will take the pawn on h5 with the knight \non g3, discovering a check on the black king, after the king is forced to move \nout of check, we can take the queen, and black will probably resign.  ynwa77: Vore 21. Rg2\nSorry. I tought I already voted.",
        "21... Nd7": "?? The idea behind this move was to complete my development.  But, it is the final blunder.  As I overlooked what's about to happen.  Instead, I had to get my Queen out of harm's way.",
        "22. Nxh5": "easy-win: Vote 22.Nxh5\nYou will notice that the queen cannot recapture the knight because of the rook \npinning the queen to the king. Also that no other piece can be placed \nbetween the rook and the queen to break the pin. \nWhen/if the queen captures our rook, the king will capture the queen.  ynwa77: Vote 22. Nxh5\nI agree with easy-win.  redfoxrising: SAME I vote for the same Nxh5 as it is protected due to the pin it is on the rim but in this case that is the best outpost for our N.  falcon67: I vote for Nxh5 as well.  knightider62: My vote Nxh5 Nxh5 is my vote also.  jkarp: I resign with the following note. I played quite well in the very beginning. But, I made some terrible oversights. One was a pawn being on the same line as the N and Queen which allowed the winning back of material. And, just as important is what I just overlooked given that my Queen is on the same line as the K and your R. That was probably Ghost Vision as I thought that the Queen was on a different line. But, you guys played very well after these terrible moves. GG.  \n "
    },
    "url": "https://gameknot.com/annotation.pl/consultation-game?gm=63240",
    "gameName": "Consultation Game",
    "players": "ynwa77 (1292) vs. jkarp (1304)",
    "opening": "Queen's pawn game (D00)"
}