{
    "moves": {
        "1. e4 Nf6": "The Alekhine Defense. I love this defense as white has to make a choice of chasing down the knight or proper development. ",
        "2. e5 Nd5 3. c4": "I usually see d4 or Nf3 here, but this move is perfectly playable.",
        "3... Nb6 4. d4": "We are now out of book but this move doesn't seem bad. Gameknot says that c5 or b3 were better options. ",
        "4... d6": "Black always wants to disrupt white's central pawns in the Alekhine defense. ",
        "5. c5": "This is where I think White goes to far with his pawns. They are way to far up with nothing really supporting them.",
        "5... Nd5": "5... dxc 6. dxc Qxd1 7. Kxd1 I looked at but I liked this move as white is done chasing my knight around. ",
        "6. Nc3": "finally some minor piece development on move 6. ",
        "6... Be6 7. Nf3 g6 8. Bc4": "There is a lot of pressure in the middle, and all hell is about to break loose.",
        "8... dxe5 9. Nxe5 Bg7 10. Nxd5 Bxd5 11. Bxd5 Qxd5": "After 3 exchanges, all is even but white's position looks open and my queen and bishop are threatening to do some damage. ",
        "12. Nf3": "The best move",
        "12... Nc6": "I wanted that d pawn and no one was going to stop me from getting it.",
        "13. Be3 O-O-O": "I have 4 attackers on that pawn, and white can only muster 3 defenders, so that pawn will drop.",
        "14. O-O Nxd4 15. Nxd4 Bxd4 16. Bxd4 Qxd4 17. Qc2": "and white decides to keep his queen while also protecting that c pawn. ",
        "17... Rd5 18. Rfd1": "Better I think was Rac1 to save the pawn",
        "18... Qxc5 19. Qa4": "wanting to keep his queen.",
        "19... Rhd8": "If i take with the rook I lose tempo and control of the open file. Let him come to me. ",
        "20. Rxd5 Qxd5 21. h3": "Protecting and thoughts of a back rank mate.",
        "21... Qd4": "Please trade?",
        "22. Qa3": "Of course not and his queen is threatening my e7 pawn. ",
        "22... e6": "I was wary of this move, because eventually his queen was going to go to e7 and cause my pawns trouble, but I feel I can defend against it. ",
        "23. Rc1 Kb8 24. Qe7": "Threatening Qxc7+ and f7",
        "24... Qd7": "protecting against the threats.",
        "25. Qf6 Qe8 26. Qf4 f5": "I completely missed the threat on f7 again, whoops. ",
        "27. Qxc7+ Ka8 28. Qxh7": "My structure is deeeead",
        "28... a6": "give my king some breathing room.",
        "29. Rc7 Qb5": "protecting against an assault on b7. Maybe I can hold out.",
        "30. b3 Qb6": "His queen can't take on g6 or my queen will take his rook. ",
        "31. Rc2": "A blunder that ends the game I believe. ",
        "31... Rd1+ 32. Kh2 Qd6+ 33. g3": "forced",
        "33... Qd5": "threatening mate on h1.",
        "34. g4": "I think f3 would have been better. Sure it drops the pawn but his rook would have been able to move in. I think he wanted an escape to h4 with his king if I played Rh1+ or Qh1+. \ng4 loses a rook.",
        "34... Qe5+ 35. Kg2": "forced",
        "35... Qe4+": "There is no way to save the rook and my opponent resigned. I hope you guys enjoyed and please leave feedback. "
    },
    "url": "https://gameknot.com/annotation.pl/consequences-for-over-extending-pawns?gm=32257",
    "gameName": "Consequences for Over Extending Pawns!",
    "players": "larsof54 (1372) vs. purplelinkpl (1280)",
    "opening": "Alekhine's defence (B02), Steiner variation"
}