{
    "moves": {
        "1. e4": "With the white pieces, Morphy played 1. e4 exclusively. An interesting side note is that Bobby Fischer considered Paul Morphy the strongest player ever, and he as well played 1. e4 most of his career (with the glaring exceptions of the 1972 World Championship).",
        "1... e5 2. Nf3 d6": "Philador Defense.",
        "3. d4 Bg4": "? Allowing Morphy too many options. He can lock up the center, destroy the center, or freely develop. Better was to simply take the d pawn. After all, maintaining material equality this early in a game is vital against a player of Morphy's strength.",
        "4. dxe5": "Morphy swings first. He sees that he can a trade a knight for a bishop after 4...BxN, because 4...dxe4 is abysmal due to 5.QxQ KxQ and black has lost the right to castle.",
        "4... Bxf3": "Black probably sees this too, and obliges.",
        "5. Qxf3 dxe5 6. Bc4": "Morphy now has a threat  against f7 that must be dealt with immediately.",
        "6... Nf6": "Blocking the attack on f7 and developing.",
        "7. Qb3": "Finding a new way to maintain the pressure on f7, and eying b7 as well.",
        "7... Qe7": "The only way to protect f7. The pawn on b7 is now hanging. However.......",
        "8. Nc3": "Instead of taking on b7, Morphy develops his knight to c3 which threatens to move to d5. White is now solidly ahead in development as black's dark squared bishop is trapped.",
        "8... c6": "? Black is behind in development, and this move makes little sense. Keep your eyes on the open d file and the weakness of black's queenside. Does black actually think he can get away with playing b5?",
        "9. Bg5": "! Obvious move, but still great. Look at what it accomplishes. It develops, it pins the Nf6 against the enemy queen, and it enables castling long which puts a rook on an open file!",
        "9... b5": "Evidently, black thinks DOES think this play will work. ",
        "10. Nxb5": "! Time for Morphy to go to work. Black's position now starts to crumble. Just look at all of the weak squares around the black king!",
        "10... cxb5 11. Bxb5+": "Black is now officially on the ropes. Nbd7 is black's only logical response, and after castling queenside Morphy will have awesome pressure on d7.",
        "11... Nbd7 12. O-O-O Rd8": "Practically forced.",
        "13. Rxd7": "! A nice sac. If black recaptures with his knight, his queen is lost. If he recaptures with his Rd8 or his queen, that piece will continue to pinned against his king and succeptible to capture.",
        "13... Rxd7": "The lesser of three evils.",
        "14. Rd1": "! Why take the rook immediately? There is no hurry as it isn't going anywhere. Better to keep ganging up on it and not allowing black any counterplay whatsoever. If they could speak, I wonder what black's dark squared bishop and Rh8 would say? Probably something along the lines of \"LET US OUT OF HERE!!!",
        "14... Qe6": "A last chance effort to free the bishop while offering to exchange queens. Problem is, it is WAY too late.",
        "15. Bxd7+ Nxd7": "If the queen takes, she is lost.",
        "16. Qb8+": "! There is nothing quite like a beautiful queen sacrifice that forces mate in one! Game over.......",
        "16... Nxb8 17. Rd8#": "Truly a great one. As with most great attacking players, Morphy utilized the concept of TIME in his mating combinations. Just look at the final position of the board - if the victor were decided by who captures the most enemy material, Morphy didn't stand a chance. However, there is but one aim in this great game, and that is CHECKMATE! I hope you enjoyed it as much as I did:) - Thomas"
    },
    "url": "https://gameknot.com/annotation.pl/consultation-match?gm=669",
    "gameName": "Consultation Match",
    "players": "Paul Morphy  vs. Count Isouard and the Duke of Brunswick ",
    "opening": "Philidor's defence (C41)"
}