{
    "moves": {
        "1. e4": "My standard opening move",
        "1... g6": "Hmm my opponent throws me off guard here. This is the first time I would encounter this opening I guess",
        "2. d4": "So I grab a share of the centre with this pawn thrust",
        "2... Bg7": "The logical follow-up to his previous move I guess",
        "3. Nf3": "I continue developing",
        "3... d6": "My opponent makes way for his LSB",
        "4. h3": "Probably not the best move but I decided to restrict his LSB movement",
        "4... Nf6": "My opponent developes while threatening to win a pawn",
        "5. Nc3": "A good developing move to deal with my opponent threat",
        "5... O-O": "My opponent gets his king to safety... Not bad play from both sides so far",
        "6. Be3": "Since I didn't know where to put my LSB yet, I decided to develop my DSB to this good spot",
        "6... b6": "Hmm since the c8-h3 diagonal isn't favorable for my opponent LSB, I think he decides to fianchetto it",
        "7. Qd2": "This move makes way for queen side castling. I had a plan to castle queenside and launch a powerful attack on my opponents king",
        "7... Ba6": "Hmm I could have sworn my opponent would play Bb7 next. However, this move didn't trouble me",
        "8. Bh6": "I played this to eliminate my opponent potentially powerful bishop which would point at my planned castled position later in the game",
        "8... Bxf1": "Given the position of the black pawn structure, I would have held on to this LSB as black. The removal of this LSB might cause serious weakness for black along the light squares but since white also dosent have a LSB, black can breath a sigh of relief for the mean time",
        "9. Rxf1": "The only option if I wanted to castle",
        "9... c5": "After this move, I thought about playing d5 but instead played....",
        "10. O-O-O": "Probably not the best now as my opponent can capture the d-pawn and open lines to my castled position. Instead my opponent played....",
        "10... Nbd7": "Hmm I guess he just wanted to complete development ",
        "11. Rfe1": "Looking back at this move now, it feels like an inaccuracy. This rook should have stayed on the g or h file to support the pawn push I had planned earlier on to decimate my opponents castled position",
        "11... cxd4": "Finally, he opens up the c-file for his rook to attack my castled king",
        "12. Nxd4": "Of course! Capturing with my queen would have made me lose my DSB on h6",
        "12... Ne5": "My opponent starts playing lazily from around here. He needs to come up with an attacking strategy before I complete my own attack",
        "13. Bxg7": "This capture was made for the sole purpose of removing a very important defender of his castled position. I silently hoped my opponent would play something like Nc4 thinking he would gain time for the attack on my queen but alas my oppenent recaptured immediately",
        "13... Kxg7": "Of course!",
        "14. f4": "Onward I march with my pawn push",
        "14... Nc4": "Here, my opponent helps me gain a tempo as I needed to reposition this queen anyway. I also threating his knight",
        "15. Qe2": "Here comes the important queen repositioning. The queen would support my h-pawn push to h5 if need be",
        "15... Na5": "My opponents knight continue to hop around the board. Notice how it went from e5 to c4 and now to a5 without achieving anything",
        "16. g4": "Onward soldiers!",
        "16... Rc8": "My opponent finally decides to place his rook on this open file. ",
        "17. h4": "I played this move to later play h5 which would force lines to be opened for attack on the black king",
        "17... h5": "?? Instead of opening lines towards the white king, my opponents forces lines to be opened towards his own king",
        "18. gxh5": "And so I accept my opponent hospitality",
        "18... Nxh5": "My opponent is now simply trying to contain the situation which is fast becoming worse for him with each passing move.. My opponent correctly senses the danger of completely opening up the g-file",
        "19. f5": "I didn't want to slow down the pace of the game by defending the pawn while it was at f4. This move simply forces more lines to be opened towards the black king. (Note that black cannot play gxf5 or Qxh5 would be devastating",
        "19... Qd7": "?? My opponent continues with his lazy play. He needed to get his king off the g-file at once. ",
        "20. Reg1": "!! Very solid... The immediate threat is Qxh5 and black can't play gxh5 as the g-pawn is pinned. This move also brings a major piece into play",
        "20... Rxc3": "???? Here my opponent decides to sacrifice the exchange for no reason. Notice that my c3 knight wasn't doing anything anyway. Instead of this move, he should have played something like Rh8",
        "21. bxc3": "Here, I thought about ignoring the rook and instead play Qxh5. Instead, I took a break from the attack and snacked on the juicy rook ",
        "21... Kh7": "He finally gets his king off the dangerous g-file. Notice how for the past 5moves or so black has been trying to defend against my threats",
        "22. Qg4": "!!!  And of course I press the initiative. I threating to win the black queen with fxg6+... The black knight is also in danger of being lost if care isn't taken",
        "22... Nf6": "Its exactly after this move I spot a forced checkmate. ",
        "23. fxg6+": "!! The first move in the forced mate sequence.. Of the 5 options (Kg8,Kg7,Kh8,Kh6 and fxg6) available to get out of check, none actually saves black from mate as we would soon find out",
        "23... Kh8": "If fxg6 then (Qxg6+ Kh8 Qg7#) if Kh6 then [Qg5+ Kg7 gxf7+ (kxf7 Qg6#)(Kh8 Qg7#)(Kh7 Qg7#)] if Kg7 or Kg8 then (gxf7+ and mate follows) ",
        "24. g7+": "The correct followup. Any other move won't be as effective",
        "24... Kg8": "If Kh7 then gxf8=N+(Kh8 Qg7#) or (Kh6 Qg5#)  ",
        "25. gxf8=Q+": "! A double check which forces the black king to capure on f8 otherwise Kh7 would be met with any queen move to g7#",
        "25... Kxf8": "Black only prolongs his suffering",
        "26. Qg7+": "!! Of course I still keep the initiative and don't give any of black's remaining pieces a chance to interfere in my attack. It was at this point my opponent resigned. The game would have continued thus (Qg7+ Ke8 Qh8+ Ng8 Qxg8#). It was a wonderful game on my part and many thanks to all4nc for playing, I hope you enjoyed the game as this is my first annotation.. Many thanks and please rate the game..."
    },
    "url": "https://gameknot.com/annotation.pl/continuous-pressure-wins-the-day?gm=60760",
    "gameName": "continuous pressure wins the day",
    "players": "blackrook11 (1200) vs. all4nc (1687)",
    "opening": "Robatsch defence (A41), Rossolimo variation"
}