{
    "moves": {
        "1. d4 Nf6": "A mini-tournament game, my second game against this opponent, and this time I'm playing black. See Ready for the Cork, annotated on 4/5/09 for the first game of the match. White opens with 1. d4 so black opts for Indian.",
        "2. c4 c5": "The Modern Benoni.",
        "3. Nf3 cxd4": "White's 3. Nf3 transposes to the English Opening, avoiding the hack and slash brutality of the Benoni.",
        "4. Nxd4 e5 5. Nf3 Nc6": "Black has gained a tempo on white, and now has the lead in development, though that backward d-pawn may become problematic.",
        "6. Nc3 Bb4 7. Bd2 O-O": "Pin, break, castle. All normal stuff.",
        "8. e3 Re8": "8. e3 felt a little timid. That pawn wants to be on e4, I think, to permanently deny black's pawn the d5 square. It looks like 8. e4 Bxc3 9. Bxc3 Nxe4 10. Bxe5 is strong for white, isolating black's d-pawn and gaining the lead in controlling the center. Since white didn't do it, black adds some defense to the e5 pawn to prevent it in the future.",
        "9. h3 Bc5": "9. h3 feels like another passive move. There's work to be done here, and the white pieces seem shy to do it. Black knows what's coming next, so he takes white's thunder by relocating strategically, the point of which is also to cover d4.",
        "10. a3 e4 11. Nh2 d5": "With d4 covered, white's knight had no alternative but to go home or to the edge of the board. Not 11. Ng5? and then losing the knight to 11. ... h6.",
        "12. cxd5 Nxd5": "No more backward pawn. With the advanced center pawn and a much stronger center, and a castled king and 4 pieces developed to white's two (it seems unfair to call the knight on h2 developed), black is ready to exploit white's passive moves. Unfortunately for black, white's passive moves have left him fairly well defended with little for black to exploit.",
        "13. Bc4 Nb6 14. Ba2 Be6": "Looking to trade a few pieces, see where the dust settles.",
        "15. Nxe4 Bxa3 16. bxa3 Bxa2": "Black has managed to saddle white with an isolated pawn. Not exactly a winning advantage yet.",
        "17. Ng3 Bc4": "Pinning the white king in the center.",
        "18. Qg4 Ne5": "18. Qg4? seems natural enough, but it's a blunder, and black gives white no chance to undo it. The white queen doesn't have very many safe moves, and all of them lose material for white. For example, if 19. Qh5, then 19. ... Nd3+ 20. Kd1 Nxf2+ and white loses the exchange, and if 20. Kf1 or 20. Ke2 then 20. ... Nf4+ and white loses his queen. Alternatively, 19. Qd1 Nd3+ 20. K-any Nb2+ and white loses his queen. 19. Qf4?? and 19. Qe4?? both lose the queen immediately to Nd6+. e2, f3, h4, g5, g6, e6, d7, and c8 are all instant death. I think 19. Qf5 is white's only safe move.",
        "19. Qd4 Qxd4": "White seemed to find an escape, but black has a winning combo now. I have to admit, at this point I only thought I would win the bishop on d2.",
        "20. exd4 Nf3+": "Forces white's reply with the double check.",
        "21. Kd1 Bb3+": "Another forced reply, the king has only one legal move. After I played this move, I worked out the next few moves and realized that black can win much more than a bishop. At this time I announced mate in 5 beginning with the move just played, 21. ... Bb3+. I just created a puzzle out of this position, and in doing so, I discovered something that should have been obvious. White can block with his bishop, a futile move that does nothing but stall, but it turns this into a mate in 6 instead of 5.",
        "22. Kc1 Rec8+": "I had been planning to play 22. ... Rac8+ leaving my other rook active on the open e-file. The natural choice to activate the inactive rook and keep the strong rook on the open file. But, last move, I found the mate in 5 and it requires my rook on a8 to stay home.",
        "23. Kb2 Rc2+": "This is the point that white realized his goose was cooked and resigned. Maybe black's having announced mate in 5 three moves ago added to the realization. The continuation is 24. Kb1 Nxd2# or 24. Kxb3 Nxd4+, 25. Kb4 (forced) a5#. Checkmate with a pawn, made possible by the rook who stayed home on a8. I really love the way the four black pieces are all working in harmony, each one shutting off one or two escape squares for the king (with a little help from white's pawn, who adds the finishing touch by keeping the king from fleeing to a3."
    },
    "url": "https://gameknot.com/annotation.pl/cooked-goose?gm=22991",
    "gameName": "Cooked Goose",
    "players": "abbusen (1658) vs. blake84120 (1874)",
    "opening": "Benoni defence (A56)"
}