{
    "moves": {
        "1. d4": "King's Gambit. ",
        "1... d5": "Preparing for the gambit...",
        "2. c4": "Here comes the gambit...",
        "2... c6": "Black could have played e6 instead.",
        "3. Nc3": "White advances his knight.",
        "3... e6": "Pawn blocking Bishop at c8",
        "4. e4": "White continues to attack the centre.",
        "4... Bb4": "Instead of taking the pawn at c4, Black chooses to advance his Bishop. This is not a bad move but perhaps moving his Knight or even better taking the pawn at e4 would have been a better choice.",
        "5. e5": "White takes advantage of this and establishes strong presence in the centre",
        "5... dxc4": "At this stage I would have moved my Knight at g8 to e7 instead of taking the white pawn at c4.",
        "6. Bxc4": "White takes the pawn back with his Bishop",
        "6... b5": "Good move, threatening White bishop.",
        "7. Be2": "White Bishop retreats but instead of going to b3, white chooses to go to e2 as he plans to launch an attack on the Kingside.",
        "7... Ne7": "Black activates his Knight",
        "8. Nf3": "White moves his Knight to a good square. White is ahead in developing his pieces. He has a good centre. Black's bishop at c8 is blocked by his pawn at e6. He hasn't yet developed his other knight at b8. The good square for his knight (c6) is now occupied by his pawn. ",
        "8... O-O": "Black castles. I don't see anything wrong with this move.",
        "9. Bd3": "Now it is getting dangerous for Black. White launches his attack. ",
        "9... Nd7": "Black ignores the threat to h7 and develops his knight. ",
        "10. Bxh7+": "White takes the pawn at h7, sacrificing his Bishop. By this move he hopes to expose the black king. ",
        "10... Kxh7": "Black defeats the white bishop. Now White can check with his Knight",
        "11. Ng5+": "CHECK ",
        "11... Kg6": "Good move. If the black king had moved to h8, that would have led to check mate, as white queen can go to h5 and check the black king.",
        "12. h4": "White would have moved his Queen to c2 and check the black King again but instead he moves his pawn 2 squares and hope to threaten the king at next move. White's major pieces are now focused on defeating the black king.",
        "12... Qb6": "This is not a bad move but instead he could have moved his queen to a5. That would have constituted a far more dangerous threat to white. ",
        "13. h5+": "White continues to check the Black King. ",
        "13... Kh6": "This is the only good move. Otherwise, mate with white queen at f3.",
        "14. Qd3": "White moves his Queen to a commanding square",
        "14... Nf5": "Black blocks the way with his knight",
        "15. g4": "Whiten threatens to take the knight",
        "15... c5": "Black King can't move anywhere. Black advances his pawn to c5",
        "16. gxf5": "White takes the knight and Black resignes. "
    },
    "url": "https://gameknot.com/annotation.pl/copmaniss-zibenszelljiem?gm=25110",
    "gameName": "copmanis's zibenszelljiem:)",
    "players": "nastrovya (1620) vs. tosuraj (1556)",
    "opening": "QGD Slav defence, Alekhine variation (D10)"
}