{
    "moves": {
        "1. d4": "White starts with 1. d4, which seems to be more common among higher rated players than 1. e4, which has been my favorite since I first learned chess.",
        "1... d5 2. c4 e6": "Queen's gambit declined.  Doesn't work out for black so often on the game DB here, but I believe it to be more than solid.",
        "3. Nc3 Nf6 4. Bg5": "This pin on the knight is probably the most aggressive continuation for white.  Whenever white plays this, I try to play the Cambridge Springs defense -- more on why in the next note.",
        "4... c6 5. e3 Nbd7 6. Nf3 Qa5": "The defining move of the Cambridge Springs Variation.  Note that there's the nifty tactic that if black plays dxc4, there is a discovered attack on the bishop by the queen.  Black also has a strong queenside presence with his queen and (soon to be) his bishop as well.",
        "7. Qd2": "? More common is Nd2, defending against black's playing Ne4.  This move allows black a shot.",
        "7... Bb4": "Now that the setup is complete, white must definitely defend against Ne4, because black is threatening to win material with that move.  Bxf6 only delays the inevitable... what will white do?",
        "8. Bd3": "Not a bad move -- this prevents Ne4 for the immediate future.",
        "8... dxc4": "!  And this puts the question to the bishop.  Note that Nd2 on the 7th would have allowed white to recapture with the knight.",
        "9. Bxc4": "?  I would have thought Bc2 was better, jettisoning the c-pawn but at least preventing the knight from infiltrating.  What happens now is worse for white.",
        "9... Ne4": "Forcing the queen to move.",
        "10. Qc2 Nxc3": "White will win the exchange now.",
        "11. bxc3 Bxc3+ 12. Ke2": "The only move that allows an immediate recapture of the bishop.",
        "12... Bxa1 13. Rxa1": "And black has won a pawn and the exchange.  This should be enough to win -- so white gets a little desperate.  The following attempt to complicate is interesting and may have succeeded in blitz chess (as it almost does here), but the extra time-per-move of correspondence chess will prove decisive.",
        "13... O-O": "Anticipating a white attack, black gets his king to safety.",
        "14. Bd3 h6": "Hitting the bishop...",
        "15. h4": "!?  A speculative sacrifice to get something going.  I thought a long time here before taking the bishop, since white gets a rook on an open h-file as well as a well-positioned queen, bishop, and knight plus a pawn majority.  On the other hand, I think black can parry those threats.  Soooo...",
        "15... hxg5": "\"The only way to prove a sacrifice is unsound is to accept it.\"  Famous last words...",
        "16. hxg5": "How will black defend now?  The next moves will be crucial -- white has the easy job and black's is tougher, but there ought to be no \"time pressure mistakes\" like in over-the-board chess.",
        "16... f5": "!?  I like this move.  It seems anti-positional, but it prevents the bishop and queen from getting to the king for the moment.  Also, gxf5ep is met by Nxf6, a good defensive situation for black.",
        "17. Rh1 g6": "Trying to lock the position and keep the white pieces out.",
        "18. Bc4": "Bxe6  would be very good for white.",
        "18... Nb6": "Maybe the best defensive move -- threatening to exchange off another attacker and protecting e6.",
        "19. Ne5": "!  Oh, this is good!  If white can play Rh6, then Rxg6  followed by Rh6  leads to draw by perpetual check.",
        "19... Kg7": "I also didn't want to play Nxc4 now, since I felt I wouldn't be able to shake the perpetual.  I should've calculated it, though.",
        "20. Rh6": "Continuing with his plan...",
        "20... Rg8": "Giving the king a flight square, and preserving winning chances.",
        "21. Rxg6+ Kf8 22. Rf6+ Ke7": "!  Much better than Ke8.  White has one more check and then lacks a good follow-up.",
        "23. Rf7+ Ke8": "Now he's out of checks.  How will he continue the attack?",
        "24. f4": "?!  Solidifying his position, but allowing black to exchange off some key pieces...",
        "24... Nxc4": "Forcing white to recapture, or the knight is next.",
        "25. Qxc4": "?  Not good.  Nxc4 hangs the rook, but the fact that it hits black's queen may have been more important.  Now black can exchange off the queens...",
        "25... Qb5": "White admitted to me that he overlooked this move, which really hurts him.  With just two pieces, white is going to have to try to get his pawns rolling on the kingside to make anything happen now.",
        "26. Qxb5 cxb5": "And with just two pieces, there isn't much he can muster in the way of mate threats.  All I have to do is develop, and the fact that I'm up a rook will net me a full point.",
        "27. Kf3": "And here he comes on the kingside.  I should point out that I was oblivious to this danger until it was almost too late; I got lucky by realizing my mistake just in time!",
        "27... b6": "Realizing I have to get my last two pieces into play!  This is the last good move I make until move 32...",
        "28. g4 Rf8": "In hindsight, fxg4  or Rb7 would have both been better.",
        "29. Rh7": "Note that white allows the g-pawn the freedom to advance.",
        "29... fxg4+": "Allows the king closer -- black should have definitely played Rb8 with the goal of getting the rook to b7, taking back control of the 7th rank!  Black should have also allowed white to take; the black pawn is stronger on f5 than e6 at this point.",
        "30. Kxg4 Rf5": "??  What am I THINKING here?  Those pawns are a danger and I've got to stop them...",
        "31. Kh5 a5": "???  It's got to be the brain damage.  Saving the a-pawn means little here...",
        "32. Kh6": "OH!  Now that the king is here for the assist, I realize the danger.  What would I have done if white had simply started marching his g-pawn?  Would I have just lost?",
        "32... Rb8": "!  Finally; one more move of hesitation would have been a death-blow to me.",
        "33. g6 Rb7": "At this point, I was thinking of exchanging my rook for that pawn -- anything to stop it.",
        "34. Rxb7": "No such luck.",
        "34... Bxb7": "Look at this position -- white's pawn is certainly worth a lot more than just 1/5 of that rook, wouldn't you say?",
        "35. g7": "Alright, it looks like I've got to give up the rook for the pawn now...",
        "35... Rf8": "!  The only way to stop the pawn.  After 36. gxf8Q  Kxf8 37. Nd7  Ke7 38. Nxb6, white is up a pawn, but 38. ... Kd8 followed by Kc7 wins the knight.",
        "36. Nd7": "?!  But white doesn't take it!  On closer examination, it becomes clear why -- white will be unable to stop the black queenside pawns from queening long before his own pawns can queen -- it's the power of a good bishop plus good king position.  After all of that fighting, white still can't save the game!  Kh7 was black's last hope, but it's met by Be4 !, cementing the win for white.",
        "36... Rg8 37. Ne5": "Nxb6 offers no chances.  37. Kh7 is no good now, too, as it's met by Rxg7  38. Kxg7 Kxd7, and black has an easy win.",
        "37... Be4": "The once dormant white bishop now controls the entire board unchallenged.",
        "38. Ng4": "Threatening a nice fork...",
        "38... Kf7 39. Ne5+ Ke7": "A much better square for the king than e8.  Now the queenside pawns decide.",
        "40. Ng4 b4 41. Ne5 b5 42. Ng6+": "Total desperation.",
        "42... Bxg6": "After Kxg6, black will happily push the queenside pawns and sac the rook for the g-pawn when the time comes.  White is defenseless to prevent black from winning.\n\nAmazing, though, how despite being down a full major piece after the sacrifice, white almost pulled out a victory.  I'm not sure that this game illustrates anything more than I'm just barely smart enough to not blow a won game, but I hope you enjoyed it.\n\n-Ethan"
    },
    "url": "https://gameknot.com/annotation.pl/correspondence-saves-the-day?gm=4500",
    "gameName": "Correspondence saves the day!",
    "players": "niemker (1726) vs. ethansiegel (1801)",
    "opening": "QGD (D50), 4.Bg5"
}