{
    "moves": {
        "1. e4": "I am annotating for my dear friend Elena, in a game she had with another lady player. (Please note - so if you comment,please refer to her bishop, not his bishop etc.)",
        "1... c5": "So it starts conventionally enough",
        "2. Nf3": "A Sicilian Defence!",
        "2... d6": "This is very common, normally leading to a Najdorf or Dragon variation",
        "3. d4": "This is normal",
        "3... Bg4": "But this isn't! Simply taking the pawn is usual. Bg4 is not in the Gameknot \"World\" database, but it is in the database of Gameknot games. Post Match Computer Analysis (PMCA) gives this as a mistake, and I think quite rightly so.",
        "4. dxc5": "So White takes. If Black takes back, White exchanges queens, Nf3 goes to e5, hitting Bg4 and f7 and White already has an advantage. So Black avoids this.",
        "4... Qa5+": "White throws in a check",
        "5. Nc3": "White blocks",
        "5... Qxc5": "White gets the pawn back",
        "6. Bb5+": "White throws in a check, but I prefer simply Be3 or Be2",
        "6... Nc6": "Black blocks",
        "7. O-O": "White castles",
        "7... a6": "Black puts the question to the White bishop",
        "8. Ba4": "White retreats and we are now out of the opening databases",
        "8... Nf6": "Black develops",
        "9. Qd3": "As does White",
        "9... Bxf3": "This exchanges is a mistake, as in open positions like this, the Bishops are worth much more than the Knights",
        "10. Qxf3": "White takes back",
        "10... h6": "This is not given as a mistake by PMCA, but to my mind it is just a waste of a move. Black should be trying to develop his Bf8 to play Bg7 followed by 0-0",
        "11. Be3": "This move could have been played earlier",
        "11... Qh5": "Queen runs",
        "12. Qg3": "White wisely avoids the exchange. PMCA says white should exchange, but this is clearly wrong. Black hasn't castled, and White needs the queens on to exploit this. This is a strategic decision. Computers often make strategical errors, but rarely tactical errors.",
        "12... e5": "A poor move by Black. It leaves the d6 pawn backward and on a semi-open file, and hence open to attack down the d file to White's rooks and queen. Generally Black has a black squared bishop on f8 so she should be putting her pawns on white squares to give it squares to move to. e7-e6 leaves d6 weak, so g6 followed by Bg7 and 0-0 is best to my mind. PMCA likes b7-b5 followed by Ra8-c8, which is a reasonable plan. ",
        "13. f4": "So White wisely tries to open up the game before Black castles  ",
        "13... b5": "This is good, Black hits the bishop",
        "14. Bb3": "Bishop retreats to the only square available",
        "14... Nd4": "Presumably this was Black's plan",
        "15. Bxd4": "White takes",
        "15... exd4": "Black takes back",
        "16. Nd5": "Knight attacks",
        "16... Nxd5": "Black takes",
        "17. exd5": "White takes back",
        "17... Ra7": "PMCA gives this as an error, but I am far from convinced. It seems a natural way to get another piece protecting e7",
        "18. Rfe1+": "White throws in a check",
        "18... Re7": "Rook blocks",
        "19. c4": "PMCA gives this as a mistake, and prefers a4 - they both seem to be on the right line to me - open up lines on the queen side before Black castles",
        "19... Qg6": "Black offers the queen exchange again.",
        "20. Qf2": "White wisely avoids",
        "20... Qf6": "PMCA gives this as a mistake, but I am not convinced it is bad.",
        "21. Qc2": "PMCA gives this as a mistake and prefers cxb5. It does seem more natural to open up lines on the queen side.",
        "21... Re3": "PMCA prefers b5-b4, stopping any immediate opening of queen side files",
        "22. cxb5": "White takes at last. Her queen is en route to c6. Black is busted, White is 5.91 up.",
        "22... Be7": "This makes matters worse, Qd8 was the best shot",
        "23. Qc6+": "White throws in a check",
        "23... Kf8": "King runs",
        "24. bxa6": "White takes, but PMCA gives Qc8 check followed by b6. I have to agree as in this line White ends up with two queens",
        "24... g6": "Black makes a square for her King. At last the King is on a safe square. The only problem is Black will have to give up a rook for the a pawn marching down the board.",
        "25. a7": "So White pushes her pawn",
        "25... Kg7": "Black moves her king",
        "26. a8=Q": "White queens",
        "26... Rxa8": "Black takes",
        "27. Qxa8": "White takes back",
        "27... Qxf4": "But Black takes this one.",
        "28. Ref1": "White hits the queen",
        "28... Qe4": "Queen moves",
        "29. Bc4": "PMCA gives this as a mistake and prefers Qa6. I have to agree. If white can blunt Black's counter-play, then she can just march the a and b pawns forward",
        "29... d3": "Black's last hope",
        "30. Qa7": "White fails to find the best defence, Qa6!",
        "30... d2": "and now Black blunders. Black cannot take the Bc4 immediately, as her rook on e3 is attacked by the queen on a7. However by playing Re3-e2 first, she threatens mate on g7. Rf1-f2 is then the only defence, and then black can take the Bc4 and is back in the game. If white then tries to get the bishop back by exchanging rooks on e2 followed by Qa7xBe7, black wins by Qc4-d4+! and if Kg1-h1 then Qd4-d1+! and White is mated.\nPlease see this puzzle I created from this position\nhttp://gameknot.com/chess-puzzle.pl?pz=104726",
        "31. Bb3": "This is given as a mistake, White's last mistake, PMCA prefers Rad1, which prevents another opportunity which Black misses next move. ",
        "31... Re1": "And now Black blows another chance. PMCA says that White is now plus 6.68, but Re3-e2 instead gives Black a plus of 2.37. The point is that Re3-e2 threatens g2 and apart from giving up the queen with Qa7-f2, White's only other option is Rf1-f2. Then Re2-e1+! is very strong and if Rf2-f1 then Re1xRa1 and if White recaptures the rook she is mated. Please see this puzzle.\nhttp://gameknot.com/chess-puzzle.pl?pz=104729",
        "32. Qf2": "Now White is clearly winning, threatening to take on f7, with her own attack",
        "32... Rxf1+": "So Black has to take.",
        "33. Rxf1": "White takes back with her own mating threats\nhttp://gameknot.com/chess-puzzle.pl?pz=104731",
        "33... f6": "Black defends",
        "34. Qxd2": "White takes. Black could resign here, but she bravely plays on",
        "34... Bd8": "As good as anything",
        "35. Re1": "Hit the queen!",
        "35... Bb6+": "Throw in a check",
        "36. Kh1": "Hide the king!",
        "36... Qf5": "Queen now moves",
        "37. Re7+": "Another check",
        "37... Kg8": "King runs",
        "38. Qe2": "With another mate threat\nhttp://gameknot.com/chess-puzzle.pl?pz=104732",
        "38... Qb1+": "Queen checks",
        "39. Bd1": "Bishop blocks",
        "39... h5": "Black avoids the mate in 2 but runs into a mate in 3",
        "40. Qe6+": "Queen checks",
        "40... Kh8": "Otherwise if Kg8-f8 then Qf7 mate",
        "41. Qxf6+": "but now it is mate next move",
        "41... Kg8": "Forced!",
        "42. Qg7#": "Mate! Many thanks for taking the time to read this. Please leave a comment and rate this to let me know how I am doing with my annotations. Please also give your appreciation to a couple of lady players."
    },
    "url": "https://gameknot.com/annotation.pl/cosmopolitan-tournament?gm=50926",
    "gameName": "Cosmopolitan tournament",
    "players": "elenapetrova (1788) vs. sleeplesswarior (1430)",
    "opening": "Sicilian, Chekhover variation (B53)"
}