{
    "moves": {
        "1. e4 c5 2. Nf3 d6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 a6": "The Najdorf Sicilian again.",
        "6. Bg5": "and White adopts the old-fashioned approach which I've been playing myself recently.  As others have commented, the English Attack (featuring Be3 and f3) is now the main line.  Once again I shall refer extensively to John Nunn's book \"The Complete Najdorf: 6 Bg5\".",
        "6... e6": "Although the Najdorf's 5...a6 is supposed to prepare the central thrust 6...e5, I've never seen it played against 6. Bg5, so I haven't tried it myself.  As it doesn't even appear in Nunn's book, or in the later Nunn's Chess Openings (NCO) published in 1999, I think I'm probably right!  6... Nc6 would transpose to the Richter-Rauzer line.  Black adopts the more flexible Scheveningen formation.",
        "7. f4 Be7": "Black's main alternatives at this point are the Polugaevsky Variation and The Poisoned Pawn: the Polu has an immediate 7...b5, which avoids putting the bishop on e7, where it often proves vulnerable.  Play becomes very double-edged and I have not had great success with it.  The Poisoned Pawn was once almost eradicated but has made a comeback and fills 112 pages in Nunn's book.  I recently lost as White against a 2000+ player here on Gameknot in that variation.  Interestingly enough, some players have played 7...Qc7 against me here, which also has a whole chapter to itself in Nunn's book.  I've carried on with 8. Qf3, which Nunn describes as the critical line. ",
        "8. Qf3 Qc7": "Black's standard response to 8. Qf3",
        "9. O-O-O": "Immediate castling has been slightly unusual in my recent games.  White tends to play 9. Qg3 or 9. g4 or 9. Bd3 these days.  Looking it up in Nunn, I find that 9. 0-0-0 was considered the main line by Nunn in 1996, when the book was published, followed by one of those other moves.  Those lines take up 84 pages of closely packed analysis, so we're in well-trodden territory.",
        "9... Nbd7": "Again the standard move.",
        "10. Bd3": "This is one of three main alternatives to 10. g4 according to Nunn, though he also discusses 4 other choices briefly.",
        "10... b5": "The book response.",
        "11. Rhe1": "Again, following Nunn.",
        "11... Bb7": "and again :-)  Here Nunn mentions that Black has often provoked White into a strong sacrifice here with 11...b4.  I recently successfully played such a sac in the annotated game http://gameknot.com/annotate.pl?id=28675, though that was from a slightly different position and move order and against a weaker player than Burt.",
        "12. Qh3": "This is the first departure from a main line.  Nunn gives two examples: a correspondence game from 1983 and an OTB game from 1990 but it doesn't feature in the later NCO.",
        "12... O-O-O": "I continue with my plan to exploit the half-open c-file and avoid castling into White's kingside attack.  The drawback of this approach is that White is also well placed to attack Black's Queenside castled position, possibly with sacrifices on b5, d5 or e6.  Black has to be very careful.  White also has to resist temptation and not get carried away with sacrificial attacks that end in failure.",
        "13. a3": "This leaves Nunn's two quoted games but transposes into a third (Mateu-Quiroga, Buenos Aires 1995).",
        "13... Kb8": "Now this takes us completely out of Nunn's book.  I recently lost another game (http://gameknot.com/annotate.pl?id=26547) in this sort of position when I didn't get my K off the c-file early enough.  In this position I have the added motivations of wanting to get off the White Q's diagonal h3-c8 and to make room for my R to come to c8, creating a battery on the half-open c-file.  ",
        "14. Bh4": "This took me by surprise.  White adopts a cautious approach, not committing anything to an irreversible attack but waiting for Black to make a mistake (a fairly sure bet from me!)",
        "14... Rdc8": "Black continues with his plan but how is he going to divert all White's defenders if White doesn't himself attack?",
        "15. Bf2": "The bishop now eyes c5, b6 and a7: something else for Black to worry about.",
        "15... Nc5": "Black attacks the Bd3 and defends the Be7, not that it was attacked at this point but could soon have been.  Both players had so many options around here that every aspect of the position and every move required meticulous consideration.  This move also permits White to play e5 if he wants, when Black plans to play ...Nd5, inviting White to swap and clearing the way to c2.",
        "16. Kb1": "White vacates the c-file, preparing further defensive and attacking options.",
        "16... Rhe8": "I didn't want to tie my Q to the defence of the Be7, since I planned a line-opening ...d5 if conditions allowed.  Alternatively, White might have planned f5, when this gave me the option of taking on f5 as well as responding with ...e5",
        "17. Rd2": "White prepares to double on either e-file or d-file and also over-defends c2: a good flexible move.  While the rooks aren't coordinated, there may be an opportunity to exploit, so I now spent some time looking to see if I could get my Be7 to b4 before White could complete his rook manoeuvre.  However, first I found it necessary to practice a little prophylaxis on the kingside.  I didn't want White to gobble up my unprotected pawns, with an easily won end-game, while I engaged in speculative adventures on the queenside.",
        "17... h6": "Now my Nf6 may move.",
        "18. Bg1": "Another waiting move from White.",
        "18... d5": "With heart in mouth I commit myself to a central thrust, which works remarkably well.",
        "19. e5 Nfe4 20. Bxe4 Nxe4 21. Nxe4 dxe4": "Now my opponent looked rather uneasy :-)",
        "22. Nb3 b4": "and even more so now...",
        "23. Qe3": "Sensibly, he recentralised his Q, threatening mate in 1",
        "23... Bd5": "Fortunately the defensive response is also aggressive.",
        "24. Red1": "White completes his rook alignment, enabling him to swap on b4 if he so wishes.",
        "24... Red8": "As there's no longer a risk of the e-file being opened, this rook was free to move to a more active square.  I did, however, have to be careful to avoid a mass swap off on d8 unless it was safe.  Given White's response, perhaps it would have been better to take on a3.  White could also have swapped Qs and forced this R to move again with 25. Qb6+ Qxb6 26. Bxb6.",
        "25. a4": "Unexpected and good.",
        "25... a5": "? I thought this was my first serious mistake as now White could have won a pawn with 26. Qb6+ but White's response was even nastier.",
        "26. Qe2": "! White threatened penetration on the White squares, supported by Nxa5",
        "26... Bxb3": "I decided I had to swap off my beautiful bishop for his evil knight, giving him doubled pawns into the bargain.",
        "27. cxb3": "Played instantaneously.  I don't know whether he considered 27. Qb5+ or any other move at this point.",
        "27... Rxd2 28. Rxd2": "!?  Played as a deliberate provocation of the blunder to come.",
        "28... Qc1+ 29. Ka2 Qxg1": "??  I knew it was risky but I still did it as I thought my Q could dash back to defend on a7.  I should have looked this gift horse in the mouth and sent it back to the knacker's yard.",
        "30. Qb5+ Ka8 31. Rd7": "! The move I had missed.  I resigned because of 31...Rb8 32. Qa6+ Qa7 33. Qxa7++ or 32. Qc6+ Rb7 33. Qxb7++.  Will suggested afterwards that I might have grovelled for a while longer with 31.... Qa7 32. Rxa7+ Kxa7, with the hope of queening the e-pawn; but he soon found a way to prevent that."
    },
    "url": "https://gameknot.com/annotation.pl/cowley-1-v-didcot-1-bd-4?gm=28981",
    "gameName": "Cowley 1 v Didcot 1 Bd 4",
    "players": "Will Burt (2112) vs. Bob Jacobs (1776)",
    "opening": "Sicilian (B99), Najdorf, 7...Be7 main line"
}