{
    "moves": {
        "1. e4": "In OTB chess I haven't yet adopted my Gameknot policy of abandoning the KP openings against stronger players.",
        "1... e5 2. Nf3 Nc6 3. Bb5": "The Ruy Lopez, or Spanish Opening, the second opening I ever learnt after the Giuoco Piano.",
        "3... a6 4. Ba4": "The main alternative is the Spanish Exchange, whereby White takes on c6, giving up his powerful Bishop to give Black doubled pawns.  The game develops very differently.",
        "4... Nf6": "The Orthodox Defence",
        "5. O-O": "in which White allows Black to capture the e-pawn, if she wants, in return for an open centre and pressure down the open files.  Black normally declines the invitation in the interest of quick development.",
        "5... b5": "The disadvantage of the Spanish from White's point of view is the time wasted fleeing Black's attacks on this Bishop.  The benefit of doing so is the power exercised by the Bishop along the diagonals a2-g8 and/or b1-h7.  This is seen in this game.  By attacking the B so quickly, as in this game, Black gets the opportunity to force a swap off by following up with 6... Na5.  Otherwise this move order tends to transpose to the main line.",
        "6. Bb3 Bb7": "Interesting!  As explained, I was expecting 6...Na5, but Black sticks to opening principles, avoiding moving a piece twice, instead developing her QB on the long diagonal, threatening not only to attack my B but also the e-pawn at the same time.  Looking this up in my old book on the Spanish by Alexei Suetin, I find that this is the Archangel Variation, or a modern version of the Møller system.  I don't remember ever meeting this before.",
        "7. d3": "I opt for a cautious approach, defending the e-pawn with my d-pawn, since I fear that Heather's tactical ability will over-power me if I adopt a sharper variation.  The only alternative I seriously considered was 7. c3, providing a hole for my B, but I wasn't confident that I could cope with the tactical possibilities after 7...Na5 8. Bc2 Nxe4 9. Re1 d5, for example.  Suetin also considers 7. d4, 7. Nc3 and 7. Re1, which all look weak to me but White probably has hidden resources.",
        "7... Bd6": "? Shocking!  I've never seen such a bad opening move from such a good player.  Unsurprisingly this does not feature in Suetin's book.  I could only conclude that she was trying to encourage me to \"teach her a lesson\" and overstretch myself or that she planned 8 c3 Na5 9. Bc2 c5 and 10... Bc7.  The B belongs on e7, not blocking in the d-pawn, but protecting the Nf6 from being pinned against his Q.",
        "8. c3 O-O": "Resuming proper opening principles rather than following the plan I'd envisaged.",
        "9. Bg5": "Normally, with the Black B on e7, this B stays at home while the QN goes on a tour of the back ranks before emerging on e3 or g3 and then going to d5 or f5.  But in this position, I'd defended e4 with d3 rather than Re1, so I wasn't yet ready for that tour.  Furthermore, the Black B was out of position, so I decided to exploit that with this move.",
        "9... h6": "Naturally, Black chases him away",
        "10. Bh4": "I don't want to free Black's position by giving up the Bishop pair, swapping my good B for her N, allowing her to develop her Q to f6, which would partially justify her 7th move.",
        "10... Re8": "a sensible developing move, which also allows the B to retreat to f8, as it does in the Breyer, where Black also redevelops the QN via b8 to d7.  I seem to remember Spassky using that system against Fischer, unsuccessfully.",
        "11. Nbd2": "continuing my development in the most flexible way.",
        "11... Bf8": "Now it looks like Black will regain a tempo for her fianchetto by launching her g-pawn to g5, pushing my B back.  If I cooperate with her plan, I'll have a horribly cramped position, so I'm already thinking about taking on g5.  I haven't yet decided whether to sac the N or the B for two pawns though.  Both plans had their attractions with the f-pawn undefended and attacked by my Bb3 and with the potential to make the pin on the black diagonal permanent.",
        "12. Re1": "I make space for the QN to continue its tour if necessary, meanwhile reinforcing e4 and preparing to contest the file if it opens up after either ...d5 or d4.",
        "12... g5": "as expected",
        "13. Nxg5": "I decided to keep the bishop pair and maintain the bind, which is more difficult to cope with than the attack on f7",
        "13... hxg5 14. Bxg5": "now the natural reply would be 14... Bg7.  Here Heather sank into deep thought....",
        "14... Be7": "and moved the B back up its diagonal to break the pin.",
        "15. Bxf6": "Now Black can't retake with the Q, so I can see that her K is going to be under-defended if I remove the N.",
        "15... Bxf6 16. Qg4+": "immediately exploiting the open lines to her King.",
        "16... Bg7 17. Re3": "bringing up the heavy artillery before the cavalry",
        "17... Bc8": "preparing a discovered attack on my Q",
        "18. Bd5": "to prevent ... d5, which would have cut my B off from f7, as well as pinning the N against Black's QR and rendering it defenceless if the d-pawn moves.",
        "18... d6 19. Qh5": "I decided against exploiting the pin with 19. Qg6 since 19 ...Be6 would have defended, forcing my Q to move again",
        "19... Qd7": "defending the Nc6 and the pawn on f7 but also preparing the manoeuvre ...Nd8-e6-f4",
        "20. Rf3": "renewing the threat on f7",
        "20... Re7": "reinforcing the defence along Black's second rank",
        "21. Rg3": "now changing the focus of my attack to g7 and making room for my N to jump via f3 to h4 and f5",
        "21... Nd8": "!? as previously mentioned, the N is hastening to the defence of the Kingside, at the expense of the QR.",
        "22. Qh6": "nothing like a threat of mate in one!",
        "22... Ne6": "defending against that threat and cutting off my attack on f7, so now I convert my tactical advantage into a material one",
        "23. Bxa8 c6": "! sealing the B's fate",
        "24. Nf3": "heading for f5 to renew the attack",
        "24... Kf8": "??",
        "25. Qh7": "?? Missing Mate in 2, with 25. Rxg7 Nxg7 26. Qh8    This was pointed out after the game by our Board 1, who'd already lost his game and was watching.",
        "25... f6 26. Nh4 Nf4": "! both defending g6 and threatening ... Ne2 , forking my Rg3",
        "27. Re1": "! defending against that threat and bringing reinforcements to the attack",
        "27... Qc7": "freeing Black's QB for action, to occupy the a2-g8 diagonal",
        "28. Ree3 Be6 29. Ng6+ Nxg6 30. Qxg6 Bxa2": "!? pawn-grabbing with a hidden motive.  It's easy for White to overlook the B's covering of g8.  The B can also come to b1 to attack White's pawns from behind.",
        "31. d4": "immediately planning to block the B's defence of g8 and also hoping to rescue my own B.",
        "31... Qc8": "threatening to take the B before I can do so",
        "32. Bxc6": "so I take out a pawn with the desperado",
        "32... Qxc6 33. d5": "the pawn achieves its mission, buying another tempo at the same time",
        "33... Qc7 34. h4": "! both creating a hole for my King so that I don't have to worry about back rank mates and charging forward to attack the Bg7, now that mate on g8 is again threatened.",
        "34... Rf7": "reducing that threat",
        "35. Ref3 Bb1": "a nasty shock.  That note to Black's 30th was written with hindsight ...",
        "36. h5": "but safely ignored",
        "36... Ke7 37. h6 Bxh6 38. Qxh6 Bxe4 39. Rfe3": "Black now only had less than 10 minutes left, whereas I had about 40 minutes, so I took my time and played calmly, relying on time and my material advantage to see me through, rather than going for glory, which would have failed, with 39. Rxf6 Rxf6 40. Rg7  Rf7 41. Qe6  Kf8, when Black appears safe, as well as having extra material.  Black's remaining time was enough for her to make several moves yet, with which she could have converted her advantage.",
        "39... Rh7": "??",
        "40. Rg7+": "but I don't need a second invitation.  Now I get an overwhelming material advantage that I can convert at my leisure.",
        "40... Kd8": "?? better was 40...Rxg7",
        "41. Qxf6+ Kc8 42. Rxc7+ Rxc7 43. Rxe4": "as one watcher commented, White would be winning even without his Q!",
        "43... a5 44. Qxd6 b4": "Black plays to the end. Will I mate her before her flag falls?",
        "45. Qa6+ Kb8 46. Rxe5 Rc8 47. Re7 bxc3 48. Qb7#": "Black had less than a minute left.  I had 28.  I think that perhaps I'm not making enough use of my time?  At least I'm making good use of my opponents'!"
    },
    "url": "https://gameknot.com/annotation.pl/cowley1-v-didcot-1-bd-3-oxford-amp-district-league-div-1?gm=21295",
    "gameName": "Cowley1 v Didcot 1 Bd 3, Oxford & District League Div 1",
    "players": "Bob Jacobs (1592) vs. Heather Lang (1880)",
    "opening": "Ruy Lopez (C78), Archangelsk (counterthrust) variation"
}