{
    "moves": {
        "1. a4": "Joe starts off with an opening that I tell my students not to do.  Specifically, I stressed that to superandy, but when Joe does it, it makes me smile because he's much stronger.  What it shows isn't just how much theory one needs to know, but, they also must remember and apply against TA, as otherwise, it could mean letting your guard which often spells disaster.  This is no exception.",
        "1... e5": "As anticipated his opponent develops a central pawn.  The idea being, of course, to mobilize his K side, and castle.",
        "2. h4": "And, now, we have the Crab Opening.  As mentioned in another annotation, Joe is testing his opponents to see if they can keep their advantage.  The idea being that in blitz, you must play fast but accurately.  Against a senior master, and at this speed, your chances of doing that is less then the chance of getting a Royal Straight Flush in a poker game.",
        "2... f6": "But, this time, I'm surprised to see black this.  Although Joe can deviate his opponents should not do that.  Instead, I would've developed my Ng8, at once, as black.",
        "3. a5": "Advancing his wing pawn.  My guess is that Joe's long term plan is to get a passed pawn, but time will tell.",
        "3... d5": "Meanwhile, black prepares to mobilize his Q side.",
        "4. h5": "Advancing his other wing pawn.  My theory is still the same.",
        "4... Bc5": "As I anticipated.",
        "5. c3": "Blocking his Nb1, but this is a different aspect of the plan involving c2 since he will advance the d4.  Although this is not the Ruy Lopez (where black plays ...Bc5), the same concept still applies which is white gaining tempo, as we're about to see.  And, I can apply this in my games.  In fact, this will help me to remember what happens if Jack decides to playb Bc5, in the future which is another example of how much one can learn by studying these games.",
        "5... Bf5": "Meanwhile, black waists no time in continuing with his development.",
        "6. Nf3": "But, now Joe starts developing.  Meanwhile, black will exchange Bishop for Knight.  In my opinion, this is pointless because black's Bf5 is mobile, whereas, TA's Nb1 is not.  That makes it an open position which makes the bishop more dangerous, based on what I learned with his Sodium Attack.",
        "6... Bxb1 7. Rxb1 Nc6": "Meanwhile, black continues with his development.",
        "8. d4": "I like this move a lot.  This was the point behind 5.c3, but especially in this particular position since black's DSB is on c5.  Just like what reversion previously explained, it's now attacked, and while it might not appear, Joe is going to gain to time. ",
        "8... exd4": "? By taking, it appears that black now winds up in a lot of trouble.  It's hard to say, for sure, but black will wind up with problems.  Instead, I would've retreated to from c5-e7.  ",
        "9. a6": "So, Joe exploits the weakness that black left for himself, with this move, as now he threatens a passed pawn.  Taking doesn't help because he would do that away from the center, plus have isolated pawns.  Now, that we're passed the opening, doubled pawns can become problematic here.",
        "9... b6": "So black, in my books, made the right choice.  In fact, I also would've played this.",
        "10. b4": "Continuing that plan of gaining time.  For black, however, the loss of time is especially problematic, in this situation, as we're about to see.",
        "10... Bd6 11. b5": "This is where it really begins.",
        "11... Na5 12. Nxd4": "But, it gets worse for black because Joe intends to win another pawn.",
        "12... Ne7": "? But, black misses the threat.  Instead, the only way to refute it was bringing the Queen to the seventh rank, as we're about to see.",
        "13. Ne6 Qd7": "The idea being, if this was played a move earlier, Joe's N would not be able to come to e6.  Now that it has, he will take.",
        "14. Nxg7+ Kd8": "! Best.  Now, 14...Kf8?? appears to be stronger since one would think it gains tempo with the N attacked.  That isn't so.  It turns out that moving the monarch to f8 will lead to mate, after 15.Bh6, because of something like 16.Ne6#, as now, we have a mating net.  The reason for doing Homework on this is because I would've missed the threat which shows just how much there is to learn and why studying these blitz games, is part of my assignments.  So, like what we saw with Wizard Chess, or my recent loss against bhidragon, the idea here is pattern recognition and seeing the big picture.  In doing so, part of my weaknesses turn into strengths.  In fact, that happened when, not only did I learn not to resign early (from those Q sacs), but I then taught it to my students with one being able to pull a couple of swindles. ",
        "15. e3": "But, Joe comes up with other plans, though.",
        "15... Rg8": "Going after Joe's N.",
        "16. h6": "But, as noted in that blitz game with reversion that also resulted in a chess puzzle, followed by, a recent annotation with a different Q sac, it doesn't work against a more experienced opponent.  In fact, I met a similar fate with nuntar, as noted in my most recent annotation where I tried to reattack and got mated sooner",
        "16... Ng6": "? I'm not sure why black this, but just about, all other moves was better then this.  It turns out that the N on e7 prevented Joe's next move.  By moving it, black will find himself in a lot of trouble. ",
        "17. Qxd5 Rxg7": "?? Much better was for black to move his Ra8.  Like what we saw in some of my past games, including the second loss against the computer with Wizard Chess, black got greedy and wanted the N.  But, by taking, he will lose both of his Rooks, in return since when Joe takes, black will be in check forcing his 18th move.  In fact, it gets more dangerous because getting the second rook guarantees a passed pawn which will also prove to be a killer.",
        "18. Qxa8+ Ke7 19. hxg7 Be5": "?? I'm not sure why black played this, but 19...Qd8 was forced.  Of course, Joe would liquidate which black doesn't want.  That's why I presume that this was played, but it's better the what's to come, as white will promote.  And when that happens, it will go downhill for black.  In fact, he's busted, but this will force white's win, even sooner.",
        "20. Ba3+": "I would've promoted, at once but like this move better though since his monarch will have less options.  In fact, I'm pretty sure that this is what Joe has in mind since there is a mating sequence here that Joe will force, even sooner.",
        "20... Ke6 21. g8=Q+ Kf5": "Forced, which is also why 20.Ba3+  The idea being is that, had Joe promoted, immediately (right then and there), black would have other options.  And, mate would've taken much longer, and in fact, tlafleur123 might have been able to dodge the bullet, and possible, force a stalemate.  Well, the logic is to deny black the slightest chance of counterplay.",
        "22. Qf3+ Kg5": "Of course, black had a couple of other options.  22...Nf4, or 22...Bf4  He didn't want to lose a another piece, but Joe's move would've been the same, regardless.  And, it would still be mate.",
        "23. Rh5#": "The overall moral is that stronger players, like Joe, can disregard basic openings and get away with them, especially in blitz.  But, less experienced players need to abide by them, unless there's good reason not to.  Plus, it's more then just openings as one must need to know their theory and apply what they've learned by studying them.  If you've learned but don't study, someone like TA will be able to crush their opponents.  I've seen many examples in that club and have introduced some to the club with how much learning there is.  And, one thing remains, perhaps the most important, theory is a vital part to that curb.  With that being said, when Joe boasts about these wins, he's actually teaching them what other threats to be weary of.  In doing so, one learns and can apply that to his or her long correspondence games, as I have.  Moreover, I've then used a couple of those methods to teach my students."
    },
    "url": "https://gameknot.com/annotation.pl/crab-opening?gm=60487",
    "gameName": "Crab Opening",
    "players": "tactical-abyss (2372) vs. tlafleur123 (1200)",
    "opening": "Crab opening (A00)"
}