{
    "moves": {
        "1. d4 d5 2. c4 dxc4": "Here playing black with the queen gambit accepted (to decline is certainly better). One of my first blitz game, something like 5-6 months ago and one of my last queen gambit game! There are many inaccurate/weak moves but it still one of my favorite game I've done. I wanted to annotate it since a long time, so here we go!\n",
        "3. e4 b5": "?! Well not the best move... But I think I have seen this somewhere and I wanted to test it. I'm losing some tempo but deblocking some of my queen side pieces. a4 and white have a fine game I think.\n",
        "4. Nc3": "Protecting the e pawn and threatening b5.\n",
        "4... a6 5. Bf4 Bb7": "Protecting my rook and threatening e4.\n",
        "6. Nf3 e6": "Now i try to develop my king side as quickly as possible to castle.\n",
        "7. Be2 Nf6 8. Nd2": "? Bg5 was the best continuation here.\n",
        "8... Qxd4": "Gaining a piece, but gonna lose tempo later.\n",
        "9. O-O Bb4": "The idea was to gain both the knight and b pawn while developping.\n",
        "10. Be3": "Blocking the threat.\n",
        "10... Qe5": "?? What a blunder! I didn't seen it at all. I wanted to continue to threat c3.\n",
        "11. f4": "! Well done. If I do Qd6 he will do e5, forking both my queen and my knight.\n",
        "11... Ng4": "??! What a fool move, completely unsound! The opponent said I was a beginner, he was right! Anyway I wanted just to have some fun. The main idea was to equallizing in higher pieces... but a queen is still a queen!\n",
        "12. fxe5 Nxe3 13. Qc1 Nxf1": "A queen and a knight for a bishop and a rook?! Well just to lose a knight is not that bad finally!\n",
        "14. Qxf1 Bc5+ 15. Kh1": "Well the game must go on!\n",
        "15... Nc6": "Threatening the e pawn.\n",
        "16. a4 O-O-O": "I continue to develop and I threats the knight on d2.\n",
        "17. Nf3": "Saving the knight and protecting the e pawn, but the queen cannot reach anymore f7. White cannot use his queen right now without lose some tempo, so he can't beneficit right now of his advantage of the queen.\n",
        "17... h5": "?! Trying to break the defense of the king, but losing tempo. Well the time was flying (blitz game). Nb4 or Rd7 would have been probably better.\n",
        "18. axb5 axb5 19. Nxb5": "White regain one of his lost pawns.\n",
        "19... Nb4 20. Bxc4 Bxe4": "I'm still up a pawn, but white got a very nice position here and I've got to defend without a queen!\n",
        "21. Na7+": "White begin his attack. Ng5 could have been nice here.\n",
        "21... Kb7 22. Nb5": "Ba6+ doesn't look to achieve something if I do Kxa7 because I still got the bishop protecting a8 and b7. Probably white doesn't want to take some risks now that he has the advantage of the queen.\n",
        "22... Bd3": "! Nice counter-attack! Is this the game of the century? Just joking :P. Giving the oportunity to get 2 rooks on the d file. \n",
        "23. Bxd3 Rxd3 24. h3": "Taking some precautions for later.\n",
        "24... Rhd8 25. Nc3 Nc2": "Now begin the march of the knight!\n",
        "26. Rc1 Ne3": "Now white must move the queen.",
        "27. Qe2": "Qe1 would have been better here. \n",
        "27... Nf5": "Threatening a fork Queen+King\n",
        "28. Kh2 Be3": "Now begin the march of the bishop!\n",
        "29. Re1 Bf4+": "Going for a draw.\n",
        "30. Kg1 Be3+": "White still got the oportunity to give up his queen and his rook but by doing  this I'm gonna have the advantage after.\n",
        "31. Kf1": "??\n",
        "31... Ng3#": "Well I know there are a lot of mistakes but it's one of my most memorable games. To sacrifice a queen and then to win 20 moves later by this formidable finnish was really exciting and amusing. The moral of the story: fight till the end, never give up! Sometime losing a piece give you a nice position or give some confidence to your oponent, so it can be sometime useful. But still, the sacrifice must be sound!\n"
    },
    "url": "https://gameknot.com/annotation.pl/croisade-of-the-knight-and-the-bishop?gm=40524",
    "gameName": "Croisade of the knight and the bishop",
    "players": "jpl103  vs. drchopper ",
    "opening": "QGA (D20), 3.e4"
}