{
    "moves": {
        "1. e3": "I've never actually encountered this opening before, in my memory - according to the gameknot Database, this is the Van't Kruijs opening\n",
        "1... Nf6": "I have no idea why I did this. [not that there's anything wrong with the move - I guess i just wanted to try something different :) ]\n",
        "2. d4": "White develops his second centre pawn, which is now supported by the pawn at e3.\n",
        "2... d5": "I mirror the move, taking my own claim into the centre.\n",
        "3. Nf3 Bf5 4. Nc3 g6": "nothing much to say about the opening developing moves, but the fianchetto here is probably less common. By making this move, Black is directing all of his pieces towards White's queenside (it's a shame that White wants to castle kingside)\n",
        "5. Bd3": "White develops and threatens to double up Black's pawns on the f-file\n",
        "5... Bg7": "This could have waited, as it was pretty obvious that Black was planning this anyway. Better might have been Qd7, but then White has the strong Ne5! [yes, White does move a piece twice in the opening, but that's nullified when it forces your opponent to do the same thing] I did not want to initiate the exchange myself because that would let White pull ahead in development [at this point, It's -1.02, advantage White. I guess he played his opening better here]\n",
        "6. Bxf5": "! As expected...\n",
        "6... gxf5": "Now Black has doubled pawns on the f-file (and they're looking particularly ugly right now!)\n",
        "7. O-O": "Retreating the king to safety. Most likely this will become a game of 'opposite side castling', since Black will not want to castle into a weakened kingside\n",
        "7... Nc6": "Black's first step towards queenside castling...\n",
        "8. Ne5": "!? White starts to get aggressive - though after Black's reply, White now has doubled pawns down the e-file (though they're probably more effective than Black's doubled pawns)\n",
        "8... Nxe5 9. dxe5 Ng4": "Black avoids the pawn capture and now targets the e-pawn\n",
        "10. f4": "The most natural way to defend the e-pawn, though it could be seen as a case of 'weakening the king's defence,' though Black can't immediately take advantage of that. The other option is Qd4, but that just doesn't feel right... [this move also limits the power of Black's fianchettoed bishop - I notice this at move 14]\n",
        "10... e6": "this move pretty much locks in the centre, and now both sides will be looking towards wing action. With the way Black is positioned, he can play Qh4, threatening mate on h2. Black predicts what White would play in response to that threat...\n",
        "11. h3": "...snd it comes one move early. It seems reasonable too - the only safe square for the knight is the h6 square, which isn't entirely desirable. However... [at this point the score is -0.29, advantage White... in other words, roughly even\n",
        "11... h5": "Black hopes that after the knight sac, he can make something of the open h-file. after hxg4 hxg4, Black will then bring his queen over to the h4 square to pressure the now exposed king. White can stop this by g3 and Qe1 (I think Qe1 would be better) but then Black plays f6, and White (who loses a pawn otherwise) has to exchange, and the queen now reaches the h6 square. [as you would expect, the Gameknot Analysis didn't like this move at all, and gave this line; 10...h5 11.hxg4 hxg4 12.Qe1 Qe7... no thought about f6? maybe I missed something... in that line, Gameknot gives -1.54, advantage White... not completely losing, as far as I can see, so there must have been something in the knight sac]\n",
        "12. Ne2": "White senses something suspicious, and declines the exchange [and yes, every move where the g4 knight is ignored is a mistake from both sides... though Gameknot gives a very strange line for this line; 12.Qd3 Nh6 13.Qb5+ c6 14.Qxb7 Qb6 15.Qxa8 Ke7 16.Na4 Qc7 17.Qxh8 Bxh8 18.Bd2 c5 19.Nc3 Bg7... one problem; how about 13.Qb5+ Qd7 14.0-0, which only loses one pawn and allows Rfb1 next move... again, and I missing something?]\n",
        "12... Qh4": "looking back, this probably wasn't the best move (f6 was better) Now, hxg4 would be a big mistake, and if White didn't want to take the bait lost move, then I was a fool to think he'd do so now. I was also considering 12....h4, to tempt Black with the knight again and hope to make something about the g and h pawns. However, the problem with that plan is all White will have to do his move his knight and the the g-pawn is undefendable. \n",
        "13. Qe1": "Threatening the queen, who either has to retreat back to e7 or follow through with an exchange.\n",
        "13... Qxe1": "I don't like retreating :P\n",
        "14. Rxe1": "[the right thing to do - after Nh6, the game is dead even - though the fact that I was annotating this game while I went along, and that I wanted a knight sac in it, may have been what stopped me from playing Nh6 :P]\n",
        "14... h4": "with the queens off the board, this move is now safe. Sound? Well... we'll see eventually... [if White took the knight now; -2.69, advantage White... I did think this highly dubious at the time]\n",
        "15. Nd4": "what, still not taking?\n",
        "15... O-O-O": "I give one last chance for White to take the knight - if he declines now, I'll retreat it (or Nxe5 - but it turns out that I never had to make that decision)\n",
        "16. hxg4": "White finally accepts the en prise knight\n",
        "16... fxg4": "now that it has been accepted, I'll go ahead and say that this is my first attempted sac at an advantage that does not reap any (plainly) obvious advantage, though it is true that Black has more space on the board. Sooner or later, Black may want to push his pawns, but would it work? if h4 on Black's next move, White would be ill-advised to play gxh3, but if White plays g3.... the good thing about my position, though, is that the g and h pawns will be very hard to target, so I don't need to make a decision about them straight away\n",
        "17. Bd2": "Bringing out the bishop, and connecting rooks - as I've already mentioned, the pawns are next to impossible to budge, so White can't do anything about them right now\n",
        "17... c5": "Onward! Black pushes away the knight with tempo (at this point, I'm wondering whether I can have rooks on the h and g file, or doubled rooks on the h-file)\n",
        "18. Nb5": "I had expected Ne2 - I didn't think White would do this because a6 chases it away, but when this was played, I noticed that White threatened to win a pawn! I ought to have analysed the position more, then I might have been able to stop this\n",
        "18... Kb8": "luckily, there is a way to avoid further material loss\n",
        "19. Nd6": "I was hoping that White would do this, and I'll be allowed to make a few tactical shots later on (I think) but first, Black has to defend against Nxf7\n",
        "19... Rd7": "Now White's knight... should... have no more tricks up its sleeve - not that I can see, at least\n",
        "20. b4": "hoping to break up my pawn structure...\n",
        "20... c4": "I didn't think a lot about this move - there really didn't seem to be any other answer to White's b4. It also creates a formidable pawn chain for Black - all on the white squares so that most pawns are safe from it [I also like that White's bishop has a very limited scope right now - I can call it a 'bad bishop' then?]\n",
        "21. a4": "With the obvious try for a kingside pawn storm - what do I do about it? for now, nothing...\n",
        "21... f5": "This is the perfect time to execute this move - now, en passant will lose material (exf e.p, BxP and the rook and knight are forked) Giving support to the g-pawn is important, because I don't want to be stuck defending it with a piece later on - now I plan to double the rooks on the h-file and finally start a pawn push..... [I thought this so good at the time, but Gameknot deemed this an 'inaccuracy' - the line given was 20...f6 21.Bc3 fxe5 22.Bxe5 Bxe5 23.fxe5 Rh5 24.Ne8 Rxe5 25.Nf6 Rg7 26.e4 Rf7 27.Nxg4 Rxe4 28.Ne5 Rxe1+ 29.Rxe1 Rf4... it does win back a pawn :)]\n",
        "22. b5": "....provided White doesn't succeed with his now. It's around here that I start to worry whether my plan was too slow or not... I still think that Black can win this, but I had once fallen (when a piece up, in fact!) to a pawn storm just like this =.... I think I'll just close it up if he tries advancing too close, I don't want White getting an open file! [say... now I think about it, what else can White actually do here? comments appreciated on that]\n",
        "22... Bf8": "The bishop moves out of the way, and Black threatens to win back one of his pawns. Right now, the only safe square for him is the e8 square, since b5 is blocked,but then the knight can move to the f6 square afterwards.... what an annoying knight! hmmmmm....\n",
        "23. Bb4": "Well, I guess there's this too, that bishop wasn't doing anything on the d2 square.... but now the knight is pinned to the bishop! It seems safe to ignore this now, since White doesn't have any tricks up his sleeve (any knight move, Bxb4 and the bishop targets the e1 rook). However,once White decides to give the bishop any kind of protection [e.g c3], he will then have Nxc4!, willing to give back a piece to allow White's rooks entry into the black position (if anything happens to that e-pawn...), so if the bishop gets protection, I'll exchange (the check the bishop gets is merely a nuisnace) [wait, hold that though... White can recapture with pawn! That's probably better...]\n",
        "23... Rdh7": "great! now the rooks are on the doubled file, I can finally start attacking! :)\n",
        "24. a5": "oho, still thinking about that pawn storm, are we? [actally, before I played my next move I was worried of a prospect of a White sacrifice; 25.b5 a6 26.Nxb7+?! There was probably nothing to worry about, since my attack is coming about much faster, but still, I wanted to be sure]\n",
        "24... h3": "Now let's see what my pawns can do!\n",
        "25. g3": "earlier, I would have considered this move a mistake, but now, looking at this, I realise that White does, in fact, have a move that will hold everything in place...\n",
        "25... h2+": "does he see it? [actually, I think I should have just left the pawn where it was and should have played something like Rc7...] [-2.64 to -3.31...]\n",
        "26. Kh1": "well.... not yet....\n",
        "26... Rh7h3": "does he see it now?\n",
        "27. Re2": "good; no he doesn't. Kg2 would have been the move to make (White has enough defence to stop the pawn promoting) followed by Rh1. I think in that situation, the game might have been drawn, because I can't see a breakthrough for either side. While this move does get rid of the advanced pawn, Black picks up two pawns for his troubles, and will now have a dangerous rook behind enemy lines!\n",
        "27... Rxg3": "Black captures the first of the white pawns...\n",
        "28. Rxh2": "And White gets rid of the dangerous pawn... [White missed a strong Nf7! here]\n",
        "28... Rxh2+ 29. Kxh2 Rxe3": "...and Black gets rid of two white pawns!\n",
        "30. c3": "A reasonable way th defend teh c3 pawn, since Black threatens the fork Re2+, but....\n",
        "30... Rf3": "is there any way that White can save this pawn?  I don't think so! [I would have preferred playing Bh6 to get my bishop in the action, but that allows White to protect the pawn with Rf1] [turns out I was wrong.... that pawn does not get captured anytime soon]\n",
        "31. Kg2": "I was expecting this move - after Rxf4, Rf1 removes the threat of the rook....\n",
        "31... Bh6": "...so I bring my bishop over to attack the pawn instead! \n",
        "32. Rh1": "ugh! What an annoying move! Black threatens to invade on the first rank, and what can Black do about it? moving the bishop doesn't help, because the bishop will be captured (sooner or later, it will have to move to Black's first rank, where it will be pinned to the king) and then White would have a powerful rook!\n",
        "32... Rh3": "pretty much forced...\n",
        "33. Rf1": "now White has successfully defended the pawn, and Black's attack has stalled....for now\n",
        "33... Bf8": "time to rearrange the bishop!\n",
        "34. Nf7": "okay, so I guess that White doesn't want the bishop... I'm gonna have to exchange it... ok, let's see... Advantage for White, threatens Nd8, picking up the crucial e6 pawn... Advantage for Black, White's Queenside pawns weakened.... ripe for the picking for Black's rook.... and the passed pawns on the c and d rank... simply beautiful!\n",
        "34... Bxb4": "Needless to say, I was happy for this exchange\n",
        "35. cxb4": "[score; -0.01 - much better!]\n",
        "35... Rh7": "White was about to pick up the pawn with Ng5 ( a fork) so this seemed forced [actually, no it wasn't - Black just wasted a tempo] [Gameknot gives this line for a dead even 0.00 position; 35...d4 36.Ng5 Rh6 37.a6 bxa6 38.bxa6 Rg6 39.Rf2 c3 40.Rc2 Kc7 41.Kg3 Rh6 42.Rg2\n",
        "36. Ng5": "attack....\n",
        "36... Rh6": "and defending. The reason that Black stays on the h-file is that if White should mess up and play Rh1?? (Rxh1 Kxh1 and c-pawn promotes)\n",
        "37. Kf2": "Nope - White moves his king a little closer to the doubled passed pawns, though Black can't advance them yet - they'll be too weak [it's interesting to note that White can't do anything with any of his pawns queenside at the moment - 37.b6?! axb6 or 37.a6?! b6]\n",
        "37... Kc8": "I don't want to have my rook tied down to the e-pawn's defence forever - the king will be more than happy to take up that role \n",
        "38. Ke3": "wait a minute, is he trying to infiltrate with the king? well, after my next move...\n",
        "38... Kd7": "there isn't really any way he can break through - the c5 square, maybe, but no further...but he could do something with his pawns....\n",
        "39. Kd4": "yeah...\n",
        "39... b6": "preventing the king from breaching enemy lines. I'm pretty sure that White till exchange here, and he'll get some counterplay with his rook, but I think I will have some of my own that will keep me in the game.... [Gameknot put this down as a mistake, and White had a very powerful move here; 40.Ra1! Best (and one which I never considered) is 39...Rh2 40.Rg1 Ke7 41.Kc3 Kd7 42.b6 a6 43.Rf1 g3 44.Rg1 g2 45.Kd4 Ke7 46.Nf3 Rh3 47.Ke3... I guess I never did have any danger with allowing Kc5 after all, though this move becomes useful for Black later on]\n",
        "40. axb6 axb6 41. Ra1": "yeah, just what I expected, and now I begin my counter-attack...\n",
        "41... g3": "here goes something! :)\n",
        "42. Ra7+": "seems like a needless check... but I may be wrong... this will mean that the only defender of e6 is my rook, but when I plan to move it, hopefully it will mean that I have a promoted pawn :)\n",
        "42... Kc8": "to stop Rb7\n",
        "43. Re7": "White gangs up on the e6 pawn, and it looks like it cannot be saved, but that is the wrong pawn to be worried about! By doing this, White's rook cannot prevent the g-pawn from queening, and now it cannot be stopped! [for the first time - advantage to Black! Best for White, which would have left a -2.80 advantage, is 43.Rg7 Rh1 44.Nxe6 Rd1+ 45.Ke3 c3 46.Rc7+ Kb8 47.Kf3 d4 48.Kg2 Rd2+ 49.Kxg3 c2 50.Rc6 Kb7 51.Nxd4 Rxd4 52.Rxc2 Rxb4, though I would have still player 43...g2]\n",
        "43... g2": "well, he can if White plays Nf3... but I have a nifty trick up my sleeve if he tries that!\n",
        "44. Nf3": "as I  said, the only way....\n",
        "44... Rh3": "but now the knight is pinned, and White is in trouble. Ng1 doesn't work, because Black will mate with Rd3. White can't protect the knight either with Ke3, because the pin on the knight allows Black to promote his pawn. In short, White is screwed!\n",
        "45. Rg7": "White realises this, and swings his rook over for one last trick...\n",
        "45... Rxf3": "not to get rid of the pawn - Black still threatens mate - but a sneaky trick that could let him escape with a draw... ((wait one second, not *could* get a draw, White has a guaranteed draw here! dammit! Let's hope that White doesn't see it))\n",
        "46. Rxg2": "*phew* he doesn't notice it (my guess is that he only saw that Ng1, Rh1 would lose material anyway) looking back before Rxg2??, there are a two points to consider; 1) Black threatens mate on the next move (or mate in 2; 46.Rg3 g1=B+ [aren't I cheeky? :P]47.Rxg1 Rd3#... this was the 'sneaky trick' that I spotted before I saw the forced draw)  anything other than a check loses for White, in other words. White can draw the game out with Rg8+, Rg7+ etc, but couldn't the king just move over right next to the rook? Yes, but now I mention my second point; White can only move his rook, meaning that if it gets taken, it is stalemate! Since the king can't get anywhere past the second rank, this would indeed secure the draw... but since White missed it...\n",
        "46... Rd3#": "I am more than happy to end the game! I like this ending position - one of the more unusual situations where the king is trapped in the middle of the board! [I thought I had good chances through the game, but the Gameknot analysis gave the advantage to White through the majority of the game. Still, even though there were mistakes from both sides (naturally) it was still a very enjoyable game! :)]\n"
    },
    "url": "https://gameknot.com/annotation.pl/dancing-around-the-edges?gm=31132",
    "gameName": "Dancing around the edges",
    "players": "mr_x-ray_mind (1487) vs. x-machine (1444)",
    "opening": "Van't Kruijs opening (A00)"
}