{
    "moves": {
        "1. Nf3": "I started this game with the Reti opening, which gives some discomfort for the black because the knight attacks e5, but allowing a gentlemanly and beautifully game.",
        "1... d5": "Black choose to bid more common, which is the occupation of the center by a central pawn.",
        "2. c4": "This is the most coveted movement for white, creating conflict with the bid and forcing the black a big precautions.",
        "2... Nf6": "With this move the black going to a closed Reti which forces many strategic moves and allowing the black line a very strong defensively.",
        "3. g3": "For this opening, the bishops have to be fianchettoed, allowing the control of the center without occupying.",
        "3... e6": "The black remains the main line without exposing the defensive side of the king.",
        "4. cxd5": "I'd rather skip the 10th move and take the black pawn center.",
        "4... Nxd5": "It is the best option for black. If they opt for taking with the pawn, they gained freedom for the bishop's queen, but lost the E pawn. If they take with the queen the white attack with the knight and forced black to lose a time.",
        "5. Bg2": "The white Bishop to fianchetto, so the white continue to dominate the center from away.",
        "5... c6": "The black fuse the close Reti to Reti Slav. The black will be joining a line that is much studied, but that is scarcely in favor of these.",
        "6. O-O": "The white retains its plan to prepare the pieces for the confrontation.",
        "6... Be7": "The black release castling with this movement.",
        "7. Nc3": "More of the same.",
        "7... O-O": "Is the normal move.",
        "8. e4": "Attack on the knight and gain more time for white.",
        "8... Nf6": "The black in one move defend the knight and attack the pawn, forcing him to move.",
        "9. d4": "The white eventually occupy the center.",
        "9... Bb4": "The black bishop move to attack the knight in order to weaken the e4 pawn.",
        "10. e5": "The white seeing that, counter-attack the knight on f6.",
        "10... Nd5": "The black attack the knight on c3 with two pieces.",
        "11. Nxd5": "The white force the exchange of knight's in d5.",
        "11... cxd5": "The white knight was taken with the C pawn and thereby closing part of the center.",
        "12. a3": "The white force the black bishop to retreat.",
        "12... Be7": "And so do.",
        "13. b4": "The white draw a new plan, the advance wing of the queen.",
        "13... b5": "The black saw the plan and intercede against the white.",
        "14. Be3": "The white release c1 to the rook but was poorly played, should have moved to b2 and not to e3.",
        "14... Nd7": "The knight will take two moves to get c4. The black have initiative.",
        "15. Rc1": "The white deciding to exchange the rook for the knight to control the flank.",
        "15... a5": "The Black have the same plan to control the flank and will stop at nothing.",
        "16. bxa5": "Bad choice, just noticed after, the assault on the flank remains.",
        "16... Bxa3": "Good move, Black have the choice to win a extra pawn.",
        "17. Ra1": "It is a simple move.",
        "17... Be7": "I didn't understand this move, he could have won a pawn but retreat the bishop.",
        "18. Bd2": "I enjoyed the retreat, and protected the A pawn.",
        "18... Ba6": "The black made a excellent move, with the progression of the B pawn they attack the rook in f1 and re-attack the pawn on a5.",
        "19. Re1": "I saw that move and protected the rook.",
        "19... Rc8": "The rook on the c file, the black gain space.",
        "20. Qb3": "With this move I fought against the space won by black and I put pressure on the B pawn, the plan to win the flank remains.",
        "20... Nb8": "The black with two jumps of the knight want to put pressure in A and D pawns.",
        "21. Bf1": "Revenge, I attack the B pawn and force the defense of the pawn with the queen.",
        "21... Qd7 22. Rec1": "Now I attack the rook in open file, I threatening a trade rooks and get the C file for me.",
        "22... Rxc1 23. Rxc1": "We exchanged the rooks, the C file is now mine and threaten to capture the b5 pawn and become a wining pawn.",
        "23... Qb7": "To avoid the loss of the black pawn he moved the queen to b7.",
        "24. Rb1": "Pressure on the pawn on b5 with three pieces.",
        "24... b4": "The black pawn advance with the intent of the white to capture the bishop on a6 and then they capture the bishop with the knight and later geting three pieces to defend the pawn as well.",
        "25. Bxb4": "I switched around, I took the pawn on b4 with the bishop, forcing black to take it back, if they not accepted this line they will lose more.\nIf the black to take the bishop on f1: (26. Bxe7 Qxb3 27. Rxb3 Re8 28. Kxf1 and gain the bishop).",
        "25... Bxb4 26. Qxb4": "Now is the exchange of queens, if not then the Black loses a piece.",
        "26... Qxb4 27. Rxb4": "The white take the queen and gain a pawn, but the exchanges does not end here.",
        "27... Bxf1": "The black captured the bishop on f1, the white king takes the bishop and gain a vital time.",
        "28. Kxf1 Nc6": "Good move of black, the knight attacks a5, b4 and d4.",
        "29. Ra4": "The rook move to a4, defends the pawn and enter in the final phase of the game.",
        "29... Ra8": "Now the black attack the pawn on a5 with two pieces.",
        "30. a6": "Only option, move the pawn.",
        "30... Kf8": "Good movement, if not then else some problems happened to the black.\nIf (30. ... Nb8 31. A7 Nc6 32. Ra6 threatening the horse).",
        "31. Ke2": "New plan, protect the pawn on d4 and free the knight.",
        "31... Ke7": "The black plan, avoid the promotion of the A pawn.",
        "32. Kd3 h6": "Plan of black inconsistent.",
        "33. Nd2": "The white need three knight jumps to defend the pawn.",
        "33... Kd7 34. Nb3 Kc7 35. Nc5": "Upon completing the movement of the white knight. Now, defend the rook.",
        "35... Kb6": "The black is close to its objective, is the avoid promoting the pawn.",
        "36. Kc3 Ka7 37. f4": "New plan, attack the pawns of the King side.",
        "37... Rb8": "The black prepare the progression of the rook to be able to attack in the final rank.",
        "38. g4": "The plan continues.",
        "38... Rb1": "Same here.",
        "39. f5 exf5 40. gxf5": "The white can create a flaw in the black pawns defense.",
        "40... Rf1": "The black attack what they can.",
        "41. e6": "Good move, White has a pawn without opposition in the sixth rank.",
        "41... Rxf5": "The black captures the pawn on f5 and expect to white capture the pawn on f7.",
        "42. Rb4": "Yes, the black expected to white capture the pawn on f7, White gives a bait that is the rook on b4.\nIf (42. ... Nxb4 43. E7 Unable to black stop the promotion of the E pawn).",
        "42... fxe6": "The black did not fall into the trap and took the pawn.",
        "43. Rb7+": "White gives check and threatening mate in two.",
        "43... Ka8 44. Nxe6": "The white take the e6 pawn and threaten mate.",
        "44... Rf3+": "The black do everything to prevent the mate of the knight in c7.",
        "45. Kd2": "The white move the king to d2 and thus control the E column.",
        "45... Rf2+ 46. Ke3 Re2+": "The game is over, the black drop 1-0."
    },
    "url": "https://gameknot.com/annotation.pl/daniels-mini-tournament-2?gm=26353",
    "gameName": "daniels mini-tournament 2",
    "players": "wisemega (1738) vs. oying (1558)",
    "opening": "Reti opening (A09)"
}