{
    "moves": {
        "1. e4": "I'm not an expert chess annotator, nor an expert player. Also, this game maybe full of errors from both sides. I will elaborate on the game with whatever it was I was thinking throughout the process of deciding which moves to make.",
        "1... e6 2. d4": "I'm still far from being an opening expert, I just intuitively try to occupy the center, whenever possible.",
        "2... d5 3. exd5": "I'm not sure how good is to take the pawn, rather than developing the knight on b, I just prefer more open positions.",
        "3... exd5 4. Nf3 h6 5. Bd3": "Trying to clear the way for a possible castle, as soon as (if) possible.",
        "5... Be6 6. O-O Bd6 7. c3 Nd7 8. Qe2": "Trying to annoy black by pinning the bishop on e6, while possible.",
        "8... Ngf6 9. Nh4": "True; white is far from finishing the development of all its pieces but, as mentioned on a previous move, the purpose of this move, whether sound or not, is to create complications, threatening with and eventual Ng6 or even Nf5, hoping to double Black's pawns on columns d or g...",
        "9... Qe7": "It wouldn't have been so bad for black to castle, but black elected to \"unpin\" the bishop with its Queen, which will create more complications as we'll see soon...",
        "10. Re1": "Reinforcing the threat...",
        "10... O-O-O": "Black seems to have solved the complications by castling queen-side. Still, white could stubbornly try to double Black's pawns on g with 11. Ng6",
        "11. Bg6": "!? I (white) couldn't resist this move. I'm not sure how sound it is, but it sure resumes complications for Black.",
        "11... Ng4": "Black has now counter-played with a double threat, attacking the knight on h and, at the same time threatening to gain a pawn on h2...",
        "12. Nf5": "!? White reverts the situation by creating a double threat of its own! While the knight is attacking the queen, its own queen is attacking Black's knight on g4!",
        "12... Bxh2+": "Black wins a pawn with check, but it shouldn't forget that both its queen and knight on g4 are still under attack...",
        "13. Kh1": "13. Kf1 was also viable, but I wanted to keep the pressure on black by having now three black pieces under attack...",
        "13... Qg5": "?? At first I thought that Black simply didn't pay attention to my bishop on c1, but then I saw that maybe Black was taking a shot at opening the h column for its rook, creating a potentially nasty discovered check, having the bishop on h2. I will never know which of the two were Black's motivation, but Black's apparent \"queen sacrifice\" will prove to be not so sound.",
        "14. Bxg5": "I quickly grabbed Black's queen, with the assurance that I would also get Black's knight and knowing that Black's discovered check wouldn't force a quick mate.",
        "14... hxg5 15. Qxg4": "Now, Black has at its disposition the \"nasty\" discovered check, losing a whole queen in the process...",
        "15... Nf6": "Tricky move, if you try to blitz it (as I almost did). If White takes on g5, Black now has a profitable discovered check by attacking the queen with the bishop.",
        "16. Qe2": "White is \"unorthodoxically\" maintaining initiative. If 16... fxg6, then 17.Qxe6  Kb8. 18.Nxg7, eliminating the knight's protector.",
        "16... Rde8": "Not so good, as white will now take on g7 attacking both the rook on e8 and the white-squared bishop.",
        "17. Nxg7": "Logical move, maintaining the pressure against Black.",
        "17... Reg8": "The threat of a potential doubling of the black rooks on the h column seems now to complicate things for White.",
        "18. Bf5": "After analyzing this move for some time, days after the game, I'm not so sure if this was better than 18.Nf5 or 18.Nxe6. Honestly I need to look deeply at all the ramifications.",
        "18... Bxf5 19. Nxf5 Ne4": "?? This move totally ignores the fork on e7, which destroys the possibility of a rook-doubling on h.",
        "20. Ne7+": "Overwhelming material advantage after 20...Kd8, 21.Nxg8 Rxg8, 22.Kxh2. \r\nI enjoyed this game as this player was rated over 250 points higher than me (at GK rating system, though), and at the time he was second on the tournament and I was 10th."
    },
    "url": "https://gameknot.com/annotation.pl/david-vs-goliath-mini-tourney-9?gm=18278",
    "gameName": "David vs. Goliath (mini-Tourney #9)",
    "players": "sergeidave (1495) vs. nettundfrech (1742)",
    "opening": "French (C01), exchange, Svenonius variation"
}