{
    "moves": {
        "1. e4": "My traditional opening.",
        "1... e5 2. Nf3 Nc6 3. d3": "I normally play my bishop at this point. 3. Bb5 a6 4. Bxc6 xc6 5. Nxe5 f6 6. Nf3 Bg4 7. O-O is what I usually experience, or something along those lines. I didn't do it here this time.",
        "3... h6 4. Nc3": "Getting my knights out.",
        "4... Nf6": "Apparently so is he.",
        "5. Be2": "Preparing to castle.",
        "5... Bb4": "He is as well.",
        "6. Bd2": "I didn't want my pawn structure to be messed up or unbalanced, so I got the other bishop involved.",
        "6... Bxc3 7. Bxc3 d6": "Now I can castle.",
        "8. O-O": "Defenses are good, but I apply that for both sides.",
        "8... Bg4": "He does the same strategy he just did with my other knight.",
        "9. h3": "My bishop is already placed.",
        "9... Bxf3 10. Bxf3 Nd4": "Knights can be lethal, so I wasn't gonna let that one get in any deeper.",
        "11. Bxd4 exd4": "In my opinion, knights are stronger than bishops.",
        "12. c3 dxc3 13. bxc3 O-O": "The game is evenly matched so far.",
        "14. Rb1": "I hope to gain a pawn.",
        "14... b6": "An expected move.",
        "15. e5": "Now I gain an advantage. He could take my pawn, but then his rook would be gone, but not taking the pawn results in losing the knight. ",
        "15... Rb8": "He makes the smart move.",
        "16. exf6 Qxf6": "I have a good advantage now.",
        "17. d4 a5 18. Re1": "I'm hoping to trade rooks.",
        "18... Rfe8": "According to plan...",
        "19. Qd2": "...but my original plan was to let him attack...",
        "19... b5 20. Rxe8+": "...but he was so insistent I did the honors lol",
        "20... Rxe8": "But it wasn't the best idea. His b5 pawn is now open for attack.",
        "21. Rxb5": "My advantage grows.",
        "21... c5 22. dxc5 dxc5 23. Rxc5": "My advantage grows further. He doing his best for sure, but he's letting his pawns drop off.",
        "23... Rd8": "Of course, removing the pawns allowed him to attack my queen, but we all know I won't let him get it.",
        "24. Bd5 Kh8": "A bit surprised he didn't try to defend his a5 pawn.",
        "25. Rxa5": "I go another pawn up, my advantage is big! I'm a bit surprised with how he let them go.",
        "25... Qb6 26. c4": "I still need that rook.",
        "26... Qb1+ 27. Kh2": "Really a forced move. Moving the queen to protect would of resulted in disaster for me.",
        "27... f6 28. Ra8": "Hoping to exchange the last two rooks.",
        "28... Rxa8 29. Bxa8": "All according to plan.",
        "29... Qb8+": "I failed to see that coming though.",
        "30. Kh1 Qxa8": "My advantage is smaller now, but now I would make it tough for dfb1 by engaging my a and c pawns.",
        "31. c5 Qc6 32. Qc2 Kg8": "Not much else he could do.",
        "33. a4 Kf7": "Again, not much else he could do.",
        "34. Qc4+": "This allowed me though to drive back whatever he was planning.",
        "34... Kg6 35. a5 h5": "The f,g, and h pawns on both sides are basically stalemated right now.",
        "36. a6 Kh6 37. a7": "Black's lonesome queen can't stop both pawns.",
        "37... Qa8 38. Qa4 Kg6": "Nothing else black could do.",
        "39. c6 Kf7 40. Qa6": "This sequence of moves was likely to occur next: 40. Ke7 41. c7 Kd7 42. c8=Q+ Qxc8 43. Qxc8+ Kxc8 44. a8=Q+... I probably would of attacked black's f g and h pawns so I could engage my f g and h pawns so I could get more strong pieces to make checkmate easier. Checkmate is hard to do right now. dfb1 though knew that he would lose his queen and that I would still have a queen and so on. He resigned and this wonderful game was over. I hope you enjoyed this annotation and feel free to comment and rate this annotation."
    },
    "url": "https://gameknot.com/annotation.pl/dbf1s-mini-tournament-liii?gm=54121",
    "gameName": "dbf1's mini-tournament LIII",
    "players": "joveyboy1 (1049) vs. dbf1 (1291)",
    "opening": "King's pawn game (C44)"
}