{
    "moves": {
        "1. d4": "Queens pawn opening.",
        "1... b6": "Owens defence, I think. The plan is to develop first and then to attack in the centre with d5 and c5. However black plays extremely passivly.",
        "2. c4 Nc6": "This knight should only go here after black plays c5 or it may be better supporting c5 from d7. Here it's a target for the white pawns to attack.",
        "3. Nc3 Bb7 4. e4": "Builing a big pawn centre.",
        "4... Ba6": "The c4 pawn is already guarded so it may be better to play Bb7.",
        "5. Be3 Nf6": "Again, a tagret for the white pawns.",
        "6. e5": "Gaining time at the expense of the black knight.",
        "6... Ng8": "This is the only move as the white queen guards g4 and h5.",
        "7. f4": "This pawn centre is difficult to break down.",
        "7... f5 8. d5 Na5 9. b3 c5": "Black is trying to blockade the position to stop the pawns marching forward, but it is already nearly too late.",
        "10. Bd3 g6 11. Nf3 d6 12. O-O": "With development finished, white can try pressing for an attack now.",
        "12... Bg7 13. Qc2 h5 14. Ng5": "Looking at the weak square e6.",
        "14... Bh6": "Basically forcing the knight to a square it was already going to. For example Bc8 e6, Nh6 and it will take alot longer for white to break through. Black can try to organise a defence but white should eventually get through.",
        "15. Ne6": "Excellent square for the knight.",
        "15... Qd7 16. Qf2": "Intending Qg3 to pressurise g6.",
        "16... b5": "Loses a pawn.",
        "17. cxb5 Bb7 18. exd6": "Opening up a line of attack towards the king.",
        "18... exd6 19. b6": "Threat: Bb5",
        "19... axb6": "a6 may have been better, preventing Bb5.",
        "20. Bb5 Bc6": "Best move in a bad situation.",
        "21. dxc6 Qxe6 22. Bxc5": "Threatening to win the queen with Re1.",
        "22... dxc5 23. Rfe1 Qe7 24. Nd5": "No need to take the queen yet, as its not going anywhere.",
        "24... Ra7 25. c7+": "Managing to queen a pawn.",
        "25... Kf8 26. c8=Q+": "It's not often you manage to queen a pawn with check after 26 moves! The attack is deadly. ",
        "26... Qe8": "Its aforced win for white now.",
        "27. Qxe8+ Kg7 28. Qb2+ Nf6 29. Qxf6+ Kh7 30. Qexh8#": "Mate with the two queens."
    },
    "url": "https://gameknot.com/annotation.pl/dead-mans-chess?gm=727",
    "gameName": "Dead Man's Chess",
    "players": "smoran90 (1200) vs. munchanka (1200)",
    "opening": "Queen's pawn (A40), English defence"
}