{
    "moves": {
        "1. c4": "Hi everyone! This is a game from a recent team match, in which I set up a wild attack, chase the Black King across the board, and probably have a winning endgame before succumbing to my greed, snatching a pawn, and watching my empire come crashing down around me. Enjoy!",
        "1... e5 2. g3 Nc6 3. Bg2 Nf6 4. Nc3 Bc5 5. e3": "All standard.",
        "5... a6 6. Nge2 d6 7. d4 exd4 8. exd4": "Now the reasoning behind 5...a6 becomes clear.",
        "8... Ba7 9. h3 O-O 10. g4": "?! As I've yet to castle, I decide to sacrifice my kingside security in favor of a quick attack.",
        "10... h6 11. g5": "Blasting the kingside open. This might have been stronger with Rg1 first.",
        "11... hxg5 12. Bxg5 Re8 13. Ne4": "d4 is threatened, but I'm hoping to distract from that by piling on the Nf6 and hopefully castling queenside soon.",
        "13... Bf5 14. Nxf6+": "! Smashing Black's castle open. Let the Hunt begin.",
        "14... gxf6 15. Be3 Kf8 16. Bh6+": "?! Forcing the King to either block in the Rook, or come back into the open. I'm not sure this was such a great idea; it simply allows the BK to head for cover without losing time.",
        "16... Ke7 17. Qa4": "? Threatening c6 slightly, but the Queen can be easily repelled, and this doesn't do much for the attack. Furthermore, it leaves the King as the only defender of e2.",
        "17... Bd7 18. Nf4": "As Black has trapped his King on the kingside, I decide to turn up the pressure, since he's about to play ...Nxd4 and win time against my Queen. Both Kings are looking terribly exposed.",
        "18... Nxd4 19. Nd5+": "If only my Queen were still on d1, this would be devastating.",
        "19... Ke6 20. Qd1 Bc6 21. Qd3 Kd7+ 22. Be3 Ne6 23. Qf5 Bxe3 24. Nxf6+": "I see a combination that looks at least equal here, and maybe better if Black missteps, so I play it rather than safely retaking the Bishop.",
        "24... Kc8 25. Bxc6 bxc6 26. Nxe8 Bd4 27. O-O-O": "With the Ne6 pinned, Black's Bishop--his most active piece by a large margin--is now threatened. There's no time to take on e8 or play ...Rb8.",
        "27... Kb7 28. Nxd6+": "? I think 28.Qxf7 was better.",
        "28... Qxd6 29. Rd2": "I see 29...Qb4 and the ensuing attack, and move to preempt it. At this point I have a dangerous h-pawn and pretty decent mobility, so I should have decent endgame chances once I deal with the Black push on the queenside.",
        "29... Qb4 30. Rc2 Bc5 31. Qxf7": "?? Black could have defended this pawn last move, but chose not to--that should have been a clue that I ought not to take it. This is, if not the fatal misstep, then the first of two blunders that cost me the game. I don't think Black's attack is strong enough to give me problems, even with the possibility of ...Rf8 or ...Nd4, and I give in to the temptation of the free pawn.",
        "31... Nd4 32. Rd2": "? If the previous move was non-fatal, this one surely is. The only way I can see to hold was to give up the Rook with 32.Qh7 Nxc2 33.Qxc2 and my kingside pawns may give me enough counterplay to stay in the game. The text, refusing to give up my material edge, loses by force.",
        "32... Rf8 33. Qxf8": "33.Qh7 Qxc4+ 34.Kd1 Qa4+ 35.b3 Nxb3 is no better.",
        "33... Qxc4+ 34. Kb1 Bxf8 35. Rc1 Qd5 36. Rd3 Bh6 37. Rcd1 Qf5 38. a3 Nb3 39. Kc2 Nc5": "0-1. Further, crippling material loss is inevitable, and White resigns. Sometimes, a greedy play can work out for the best--but sometimes, all the enemy pawns are poisoned. This was a fairly instructive game, I thought, in making absolutely sure you haven't missed any combinations before taking a \"gift\". Thanks very much to Bobby for the fun games! Comments on the analysis or on the game itself are much appreciated; if you leave a rating, also comment letting me know why you rated the way you did. Thanks for reading!"
    },
    "url": "https://gameknot.com/annotation.pl/deadly-sins-greed?gm=45576",
    "gameName": "Deadly Sins: Greed",
    "players": "bwaa (1727) vs. bobby35 (1737)",
    "opening": "English opening (A20)"
}