{
    "moves": {
        "1. e4": "Chess opening: French (C00), Labourdonnais variation ",
        "1... e6": "Todas las partidas que presento de GameKnot, son \npartidas de varios días. A pesar de que aquí se pasen\ncon relativa velocidad.",
        "2. f4": "En el Gambito Rey, la debilidad en h4 se suele aprovechar. Así\ncomo la debilidad de la diagonal g1-a7",
        "2... d5": "Planteando una defensa francesa, con características posicionales",
        "3. exd5": "Este cambio, nos lleva generalmente a un final de tablas.",
        "3... exd5": "Claro, jugando bien las dos partes. Puede producirse un\nempate o tablas en el argot ajedrecístico.",
        "4. d4": "Cubriendo la debilidad de su diagonal.",
        "4... Nc6": "Ahora siento que era mejor, seguir con CF6, Ae7, 0-0, y luego c5.",
        "5. Nf3": "El blanco prepara su enroque.",
        "5... Bg4": "Inutilizando una pieza",
        "6. Be2": "Defendiendo el caballo, y prosiguiendo su enroque corto",
        "6... Nf6 7. Ne5": "Jugada más o menos fuerte, pero sencilla que marca todo \nel desarrollo de la partida, posteriormente.\n\n\n",
        "7... Bxe2": "Si 7...Cf6xCe5, sigue 8. f4xe5...amenazando dos piezas negras.\nSigue 8...Axe2, 9. Dxe2, Ce4. 10.Cd2, f5, etc.",
        "8. Nxc6": "No cayó en la pequeña trampa, porque si 8. Dxe2, Cxd4",
        "8... Bxd1 9. Nxd8 Bxc2 10. Nxb7 Bxb1 11. Rxb1 Bb4+ 12. Bd2 Bxd2+ 13. Kxd2 Ne4+": "Se pasa a final de partida, sin grandes complicaciones.\nTodo apunta a un final de empate.",
        "14. Ke3 O-O 15. Rhe1 f5 16. Rbc1 Rf7 17. Nc5 Rb8 18. b3 g5 19. Ne6 gxf4+ 20. Nxf4 c5 21. dxc5 d4+ 22. Kxd4 Rd8+ 23. Kc4": "Este fue un error, era mejor retroceder",
        "23... Rfd7 24. Kb4": "Otro error. ",
        "24... Rd7d4+ 25. Ka3 Nxc5": "Evidentemente si 26. Txc5, Txf4\nHe eliminado esta amenaza. Con la cual, el blanco\npudo haber ganado",
        "26. g3 Nd3": "Una jugada que me parece bastante pasiva, pero necesaria.\nInvito a mi rival a unas tablas.",
        "27. Nxd3": "Mi rival se niega.",
        "27... Rd4xd3 28. Rc7 Rd8d7 29. Rxd7 Rxd7": "De nueva cuenta, le invito las tablas.",
        "30. Re5": "Esta jugada, la pude analizar con Fritz y en efecto es mucho mejor\nque cualquier otra jugada de la máquina que conduce a un final de\ntablas",
        "30... Rd2": "Tuve que pensar demasiado. Pero a pesar de ser activa,\ncon esta jugada entrego el juego. Pero mi rival, no profundiza.",
        "31. Rxf5 Rxh2 32. b4": "Craso error.",
        "32... Rh3 33. Rg5+": "Aquí era mejor Tf3, trasladando el Rey hasta e3",
        "33... Kf7": "Me embarco en una pequeña celada",
        "34. Kb3 Kf6": "Esta jugada que parece buena, no lo es. Entrego el juego, \nde nueva cuenta pero lo que intento es \"meter miedo\", amedrentar\na mi rival para que este titubee.",
        "35. Rg4": "Ha cometido el error que esperaba.",
        "35... h5 36. Rg8 h4": "Bien, aún aquí siguen siendo tablas. Ofrezco tablas a mi rival por \ncuarta vez y él me contesta burlándose de que no conozco nada\ndel juego, que espera que aprenda de él.\n\nPor supuesto me dice que los dos peones que tiene de ventaja.\nSerán los de la victoria.",
        "37. Kc4": "Otro error táctico. Aún ahora, son tablas. Pero viendo \nla prepotencia de mi rival, decido no ofrecérlas más.\n",
        "37... Rxg3": "Además de que le respondo, de que espero ver su gran \njugada...Gran Maestro.\n\nNo me responde.",
        "38. Rf8+ Kg5 39. Rg8+ Kf4 40. a4": "Error garrapafal. Pero aquí ya no son tablas, no lo son de hecho desde \nla jugada 38.",
        "40... Rxg8 41. b5 h3": "Y las negras se rinden.\n\nEspero que les haya gustado la partida.\n\nCabe señalar que aquí gané 111.2 puntos de Raiting."
    },
    "url": "https://gameknot.com/annotation.pl/defensa-francesa-c00-labourdonnnais?gm=23776",
    "gameName": "Defensa Francesa (C00), Labourdonnnais",
    "players": "chibears1920 (1476) vs. hambleto (1388)",
    "opening": "French (C00), Labourdonnais variation"
}