{
    "moves": {
        "1. e4 c5": "This was a Fast Ladder challenge, and my opponent was selected purely by reason of how many rungs I might gain, and how fast he tends to make his average moves. Confronted with my favorite Open Game, I complicate things with the Sicilian.",
        "2. c3 Nf6": "White tries Alapin's Variation, not nearly as popular as 2. Nf3, but still it's the 3rd most popular amongst the experts in the World DB and it does quite well for white. Black responds with the main line which invites some immediate abuse by white's pawns, not unlike Alekhine's Defense.",
        "3. e5 Nd5 4. d4 cxd4": "Still in the main line here.",
        "5. cxd4 d6": "The main line here for white runs 5. Nf3. Since black's pawn on d4 is pinned (5. ... dxc3 6. Qxd5), white can gang up on it and develop a piece first. Jumping immediately to 5. cxd4 takes a little bit of the pressure off of black, giving him freedom to steer the course for a while.",
        "6. Nf3 e6": "Still pretty much the main line here",
        "7. Bb5+ Bd7": "7. Bb5+ it turns out is not a very popular choice in the World DB. More tentative developing moves like 7. Bc4 is much more popular and much more successful.",
        "8. Qa4 Nc6": "8. Qa4 was an interesting move. Not even a hint of it in the DB. Of the 17 games that got here, all 17 played 8. Bxd7+ instead. My instincts told me there is a reason this move is not chosen, but damned if I could find any way to exploit it. The one thing I didn't really want to do was give white an early queen exchange. With the disparity in our ratings, I wanted to keep the board as complex as possible.",
        "9. Nc3 Nxc3": "OK, with 9. Nc3? white offers up a pawn and further, a positional advantage as well. Though it might involve exchanging queens, black is willing to make that exchange for a won game.",
        "10. bxc3 a6": "If the bishop retreats, 11. ... Nxe5 wins a pawn.",
        "11. Bxc6 Bxc6": "Now the queen must retreat.",
        "12. Qd1 dxe5": "Either way, a white pawn falls. If 13. dxe5 then 13. ... Qxd1+ 14. Kxd1 Rc8 and white cannot hold both his queenside and kingside - something must give.",
        "13. Nxe5 Bxg2": "White chose a different way, possibly the best choice since it opens some interesting counterattack possibilities.",
        "14. Rg1 Be4 15. Qg4 Bf5": "The bishop was en prise.",
        "16. Qh5 Qc7": "The black pawn on f7 was under fire, and white was threatening checkmate with 17. Qxf7#. Black defends the pawn and makes a threat of his own against the white pawn on c3.",
        "17. Bd2 Bd6": "Time for the knight to go away.",
        "18. f4 O-O": "I thought long about this one. It felt like castling into danger with white's knight, rook, and queen just sitting right there in striking distance. It's never a good idea to castle into danger. Never castle onto a file your opponent controls, especially if you're only shielded by a poorly defended pawn, and especially if your opponent has multiple pieces lurking about to assist in any attack along that file. But I couldn't see any way for white to make good on the danger, and I really wanted to play 19. ... f6 to chase away the knight for good, so I decided the danger was illusory and took the plunge.",
        "19. Ng4 Bxf4": "There is some danger here to black. The knight can move and give check and the g7 pawn will be pinned and unable to capture. But black's bishops and queen cover all the danger areas and white cannot press the attack through to a checkmate. So, black gains a pawn while simultaneously bringing his second bishop into the defense in case it becomes necessary, or at least, making sure white cannot bring his bishop into the attack.",
        "20. O-O-O Qxc3#": "20. ... 0-0-0??? is ironic because just two moves ago black was worried about castling into danger. Never castle into danger, etc., etc. White's pawn on c3 looks defended, but appearances are deceiving. Before castling, the pawn is defended. However, unlike black's plunge on move 18, the danger here is definitely not illusory. But white castled right into position that pinned his own bishop, removing it from defense of the pawn. The black queen makes short work of the pawn and, aided by her two bishops, she delivers the killing blow."
    },
    "url": "https://gameknot.com/annotation.pl/definitely-not-illusory?gm=25388",
    "gameName": "Definitely not Illusory",
    "players": "benlim (1577) vs. blake84120 (2046)",
    "opening": "Sicilian (B22), 2.c3, Heidenfeld variation"
}