{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Bc4 Bc5": "3. ......... Bc5 (this opening is called the Guico Piano (quiet game) - one of the first openings beginners are taught to master).  Both pairs of knights and bishops control important squares.",
        "4. d3 d6": "4. ........ d6 (this is now the Pianissimo - the very quiet game)",
        "5. h3 Na5": "5. ......... Na5 (this move was played by my coach, Apastpawn (Wayne) against andzza (1893) - he won the game!)",
        "6. Qe2": "Marin does not play Nbd2 like Wayne's opponent though, he plays Qd2.  I decide to remove the bishop.",
        "6... Nxc4 7. dxc4 h6": "7. ........ h6 (a prophylactic move to prevent the king knight landing on g5)",
        "8. Nc3 Nf6 9. Be3 Bxe3 10. Qxe3": "10. Qxe3 (over the last few moves we have got on with developing some more pieces and exchanged a pair of bishops)",
        "10... Be6 11. b3 a6 12. a4 O-O 13. g4 Nh7 14. Rg1 Ng5 15. Rg3 Nxf3+ 16. Qxf3": "16. Qxf3 (over the last few moves development has been completed and Wayne decides on a kingside pawn storm - I decide to cut down the attackers by exchanging queens.  This turns out to be a fateful decision).",
        "16... Qf6 17. Qxf6 gxf6 18. Ne2": "18. Ne2 - I did not anticipate this move in my conditional moves/analyse board set up - OMG the knight is going to manoeuvre itself to h5 after the rook moves to f3 winning the weak f6 pawn.  Here I decide to take a gamble.  For piece activity on the g file I sacrifice a couple of pawns.  The idea is that after the major pieces have been exchanged and perhaps the minor pieces too - I may be able to afford to go into a king and pawn ending one or two pawns down because his extra pawns are on the h file and not too far away from my king and his own king would have to make a journey to the pawns.  To ensure this would happen I decided to ensure that my remaining f pawn was backed up by my rook and would attack the hind h pawn with my bishop winning it back.  The foremost h pawn would be used as a screen against the black king on the h file and be picked off by the king later on - unfortunately because of a series of zwizchensugs (in between moves) Marin has other ideas.",
        "18... h5 19. gxh5+ Kh7 20. Rf3 Rfg8": "20.......... Rg8 (the first stage of the doomed plan - my rook comandeers control of the g file)",
        "21. Rxf6 Rg5": "21. ........ Rg5 (attacks h pawn and prepares Rag8).  Marin defends with 23. Rf3",
        "22. Ng3 Rag8": "22. ........ Rag8 (I double up on the g file and I eye up g1 - Marin had better watch out because I have the idea of a skewie on g1 and his rook on a1 is loose!!)",
        "23. Rf3 Rg8g7": "23. ..... I now defend the f pawn and prepare B x h3 as planned",
        "24. Rd3 f5": "24. ........ f5?? - maybe I should have just played BxP but I was worried about Marin's threat on the queenside - I was also getting rid of a backward f pawn - maybe f6 was preferable - after the pawns are exchanged Marin has a shock for me, here come the zwizenchugs (please feel free to correct my spelling!)",
        "25. exf5 Bxf5 26. h4 Rxh5 27. Kd2 Bxd3 28. Nxh5 Rf7 29. Kxd3 Rxf2": "29. ........ Rxf2 after the resulting disastrous exchanges I am a whole piece down.  My rook does his best to hold things together - maybe if my opponent had an extra bishop instead of a knight I might have stood a better chance but that knight just hops about everywhere!  I will not further annotate this game as this is an exercise in futility - I resigned the game as I was about to go deeper into the red materialwise - Marin's last move was a horrible echo of what happened at the end of our previous game).  I think the best way forward is to finish the current games agains the Experts and then take stock.  What I am now going to do is to play more unrated games in the 1600s to 1800s bracket and try and work my way up.  Hopefully if I can get some good results against these I can have another stab at challenging an Expert (other than a training game) and give him or her a much tougher assignment - possibly reach that elusive utopia of half point or dare I hope, more!",
        "30. Rg1 Rf3+ 31. Kd2 Kh6 32. Ng7 Rf7 33. Ne6 Re7 34. Ng5 Rg7 35. Ke3 Rd7 36. Ne4 Rf7 37. Rg8 b6 38. Ra8 a5 39. Ra7 Kh5 40. Nxd6": ""
    },
    "url": "https://gameknot.com/annotation.pl/desperado?gm=11978",
    "gameName": "Desperado",
    "players": "marinvukusic (2064) vs. jstevens1 (1525)",
    "opening": "Giuoco Pianissimo (C50)"
}