{
    "moves": {
        "1. e4 e6 2. d4 d5 3. Nd2": "The Tarrash, my favorite approach. My opponent had played a game just a couple of weeks earlier that had ended in a draw, and I knew that the chances of him deviating were pretty slim. So I set about finding an improvement in that game as I felt that white had good chances had he played it a little differently",
        "3... c5 4. exd5 Qxd5": "The open variation, black avoids ending up with an isolated queen pawn but the downside is he may end up being slightly behind in development. A good system nontheless  ",
        "5. Ngf3 cxd4 6. Bc4 Qd6": "Still mainline. I actually annotated a game against this very same opponent (titled \"something out of nothing) where he played the experimental 6...Qd7!? but as he was somewhat outplayed there he decides to stick with the mainline  ",
        "7. O-O Nf6 8. Nb3 Nc6 9. Nbxd4 Nxd4 10. Nxd4 a6": "I think this is still theory, I dont normally play 1.e4 and I'm no French expert so I'm not sure exactly what point we leave the theoretical mainlines, most of my prep work was done working out the deviations from my opponents past game around move 13",
        "11. Re1": "Interestingly in the game I was following black had started with 10...Qc7 11.Qe2 a6 12.Re1 so I played this hoping to transpose back to the game. I never considered weather the slight move order difference means white might be able to improve. This is still a good move anyway.",
        "11... Qc7 12. Qe2": "transposing back to the game I was following. My main point is I wanted to hold off on Bg5 until black has played ...Bd6 as it sets up some interesting attacking ideas.",
        "12... Bd6": "In the game In was following, white played 13.h3, eventually dropped the bishop back to b3 and whilst he had a good position and chances to play for a win I felt there was room for improvement. Now was where my prep kicked in as I had found an improvement for white",
        "13. Bg5": "Instead of h3, it turns out that white can offer the h pawn as a sacrifice \n14...Bxh2+ 15.Kh1 Bf5 16.Nxe6! Bxe6 17.Bxe6 0-0 (Bxg5?? 18.Be7 mating) 18.Bxf6 where best for black is apparently fxe6 19.Qxe6+ and whites a pawn up with and has a beautiful position. if 15...Bd6 16.Nf5! turns out to be very dangerous ...Bf8 and either 17.Rad1 or Nh6!? both leave blacks king in the center and under heavy pressure with 16...0-0 17.Nxd6 apparently leaving white with a massive advantage according to the computer",
        "13... O-O": "Seeing that taking the pawn is dangerous for black, he opts to hoick the king out of the center before all hell breaks loose. At this point in my prep the computers first suggestion was 14.Bxf6 which led to some awesome stuff in many lines and gave white a great game but looking over reams of different lines I came to the conclusion that black had ways to equalize and even gain advantage with accurate play. However I felt there must be something better for white. ",
        "14. Bd3": "[!] Something of a Eureka moment for me, after some time I was able to determine that this forces matters nicely as now black comes under heavy attacks in all lines.",
        "14... Bxh2+": "Black only has two good moves in the position. This and the other being 14...Nd5!? to which I had ready 15.Qh5 applying the pressure and forcing and forcing black to weaken his king ...h6? is met with the very dangerous 16.Bxh6! gxh6 17.Qxh6 f6 is blacks best defense and the computer suggests 18.Nxe6 and announces that if black defends accuratly white must play a perpetual. But I was able to prove to it after some work that infact stronger is 18.Rxe6!? Bxe6 once again the engine insists that white must play a perpetual but actually it turns out that white can still play for a win without the rook. in any case it is hard to imagine any black player willingly entering 14...Nd5 15.Qh5 h6?! 16.Bxh6 gxh6 17.Qxh6 f6 as its clear only white can play for a win there so instead I'd expect 15...g6 16.Qh4 and with blacks weakened dark squares white will have a pleasant long lasting initiative on the kingside with the advantage and good game. Black didnt go for any of that though.",
        "15. Kh1": "Believe it or not black only has one move in the position. 15...Bf5 is now forced with the continuation 15...Bf5 16.Bxf6 gxf6 17.Qg4+ and in my analysis I found white gets a very strong attack in all lines with trouble occurring on h2, or black losing a bishop with g3/F4 and possible trouble on the h file I would have been comfortable with that line. ",
        "15... Bd6": "[??] black falls for one of the many devious traps I had prepared in the position. After this black is lost and falls apart very quickly indeed.",
        "16. Bxf6": "first white weakens blacks king and removes the defender to h7 ",
        "16... gxf6 17. Bxh7+": "[!!] and now follows up with a beautiful sacrifice that wins the game outright. 17.Qg4+! was also game winning. But this move aside from being both more forcing and more daunting to meet OTB, also happens to be much more aesthetically pleasing",
        "17... Kxh7": "technically it is slightly better to not take the bishop. But as white is clearly trivially winning in that line I think black is better off testing whites idea to see if it is sound.",
        "18. Qh5+ Kg7 19. Qg4+": "forcing the king to the h file ",
        "19... Kh7 20. Re3": "And now preparing to swing over to h3 to deliver mate. The only way for black to prevent it is to play ...Bg3 shedding masses of material. instead black allows me to deliver mate, besides, white still needs to make one accurate move.",
        "20... Bf4 21. Rh3+ Bh6 22. Qh4": "The final detail notice that 22.Qh5?? allows black to defend with Qf4, but by placing the queen on h4 instead white ensures that there is no longer any defense to mate.",
        "22... Kg8 23. Qxh6 Rd8 24. Qh8#": "Hope you enjoyed and/or learnt something. I think these sort of games are instructive as it demonstrates a number of useful patters on how to break down a castled king position. perhaps what was most fun about this game is that since it was all prep, I ended up playing all my moves as fast as I could right them on my score sheet meaning that with the time control 90 minutes + 30 seconds per move I actually finished with 6 minutes more than what I started with. The entire game took just under 15 minutes and was over before some games had even started."
    },
    "url": "https://gameknot.com/annotation.pl/destroying-the-french-defense?gm=58409",
    "gameName": "Destroying the French Defense",
    "players": "James Watson  vs. Patrick ",
    "opening": "French (C07), Tarrasch, Eliskases variation"
}