{
    "moves": {
        "1. b3": "I opened with clear intentions to take out a rook.",
        "1... e6": "He began with a slight variation to a common opening move. This caught my attention.",
        "2. g3": "I decided to hide my plan by symmetrizing...which happens to be a word. And hoped he wouldn't notice.",
        "2... Bc5": "He moved out his bishop, threatening king-side bishop pawn- and looking suspiciously like a 4-move checkmate.",
        "3. Bg2": "I decided to attack the left side rook, after consideration. I did this, because after planning out the enemies moves, I realized it would prevent the checkmate on me a turn too soon. Giving me no chance at taking the queen.",
        "3... Qf6": "He moved out his queen, in a motion different then I had seen before. It almost got me but I decided to prepare.",
        "4. f3": "I moved out my f-pawn, stopping the mate.",
        "4... Bxg1": "He took my bishop for a trade ",
        "5. Rxg1": "I accepted the trade and continued on my original plan. However, I then learned that the adversaries white bishop would have to be drawn out.",
        "5... Qxa1": "He stole my plan and took my rook easily.",
        "6. Nc3": "I trapped his piece, however could not threaten the queen.",
        "6... Nf6": "He developed his rook, realizing he could not escape easily.",
        "7. Ba3": "I offered a trade, because otherwise, it could have ended much worse.",
        "7... Qxd1+": "He accepted the trade and put me in check.",
        "8. Kxd1": "I escaped check 'narrowly' and killed off the queen. However, I was trapped behind a wall of pawns.",
        "8... Nc6": "He developed towards the middle, not giving the best position, but stopping my plans for the rook attack.",
        "9. Nb5": "I bellied up to the knight planning a check in my future and forking the rook and king.",
        "9... Nd5": "He noticed and took advantage of the position.",
        "10. f4": "I moved out, pinning his knights.",
        "10... Nce7": "He moved back and protected the king.",
        "11. Bxd5": "I took the knight beginning a trade for the pieces.",
        "11... Nxd5": "He took the bishop and gave me no advantage from the beginning places.",
        "12. c4": "I threatened his knight and he would be forced to move.",
        "12... Nb6": "He placed his knight in a position so that he could avenge his eventually dead rook.",
        "13. Nxc7+": "I checked his king with my secondary plan.",
        "13... Kd8": "He was forced to move in the only way he could have.",
        "14. Nxa8": "I took his rook and prepared for death.",
        "14... Nxa8": "He avenged and I was ready for his overdue attack.",
        "15. e4": "I opened up the congestion in the middle prepared to defend.",
        "15... d5": "He set up his pawns to avoid attack also.",
        "16. exd5": "I attacked to open the middle and was waiting for my rook to kill the king.",
        "16... exd5": "He opened his bishop and the middle for his rook.",
        "17. Re1": "I moved center already knowing my next move.",
        "17... dxc4": "He took another pawn, in my stair like position.",
        "18. bxc4": "I took him to stop his wrathful pawn.",
        "18... Bg4+": "A swift check caught me off gaurd",
        "19. Kc2": "I moved off the back line to avoid future complications",
        "19... Nb6": "He redeveloped his knight after the previous defense.",
        "20. Re7": "I moved up allowing only one move for him",
        "20... Re8": "he was ready for a trade between us to stop thew attack.",
        "21. Rxe8+": "I decided to do this and allowed my enemy to trade off",
        "21... Kxe8": "No Name took the piece and the center became officially open.",
        "22. c5": "I threatened the opposing knight hoping he would move out.",
        "22... Bf5+": "The response was to put me in check instead.",
        "23. d3": "I put myself out of check by moving forward a pawn.",
        "23... Na4": "He moved out of the way and challenged my piece.",
        "24. g4": "I challenged his bishop also, hoping the attack would draw him away.",
        "24... Bxg4": "He took it and fell back away from my king.",
        "25. d4": "I advance with my pawns hoping that I could make it to the end.",
        "25... b6": "With his knight trapped, he moved out to attack my pawn.",
        "26. Kb3": "I advanced on the knight knowing if I took the pawn, he could escape.",
        "26... Bd1+": "He put me in check with the only way he could have",
        "27. Kb4": "I escaped and still could take the knight",
        "27... b5": "He protected his knight but gave me a head start to the other end.",
        "28. c6": "I advanced upon the enemy lines.",
        "28... Kd8": "He attempted to stop it.",
        "29. d5": "I protected myself with the pawn.",
        "29... Nb6": "His knight escaped though, ruining my point.",
        "30. d6": "I still protected my pawn though, planning for a queen.",
        "30... Na8": "He set himself back to stop the attack.",
        "31. c7+": "I put him in check and forced action.",
        "31... Nxc7": "The best move for him, in his eyes, was to stop that pawn, at risk of promotion",
        "32. dxc7+": "I took the obvious solution, + ing him.",
        "32... Kxc7": "He escaped check though- easily.",
        "33. Kxb5": "I took a pawn, unsure of what to do.",
        "33... Be2+": "I was checked again, and had to act.",
        "34. Kc5": "Moved onto black, escaping more.",
        "34... g5": "He moved out a pawn, stopping future promotion, no matter what.",
        "35. fxg5": "I took him to even the playing field.",
        "35... Bd3": "He stopped me from advancing.",
        "36. h4": "I protected the future attack with another pawn.",
        "36... h5": "A pawn on the same line prevented motion.",
        "37. Kd5": "I moved to open up future attacks for my bishop.",
        "37... a5": "He began motion on his side.",
        "38. Bd6+": "I checked him with a single move.",
        "38... Kd8": "He easily backed into the corner.",
        "39. Kc6": "I continued to advance, as fast as possible...",
        "39... Be4+": "He put me in check though, stopping it.",
        "40. Kb5": "I stopped his pawn from promotion, ending his line.",
        "40... Bc2": "Having to move, he moved his bishop.",
        "41. Kxa5": "I took his pawn and stopped motion almost completely.",
        "41... Bb1": "He put my final able-to-move pawn in check.",
        "42. a4": "I advanced a.s.a.p.",
        "42... Kd7": "He threatened my bishop.",
        "43. Kb6": "Sacrifice was necessary for this mission.",
        "43... Kxd6": "He took my piece off the board and I was ready for it.",
        "44. a5": "I advanced and was ready for promotion.",
        "44... Bd3": "He stopped production of my future pawn.",
        "45. Kb7": "Nowhere to move, I looked for the end.",
        "45... Kc5": "He moved towards my pawn.",
        "46. Ka7": "I stayed where I was- relatively",
        "46... Kb5": "He moved, infinitely closer.",
        "47. a6": "Seeing my chance, I sprung.",
        "47... Ka5": "He was ahead a move and moved out.",
        "48. g6": "I forked him. He had to choose.",
        "48... Bxa6": "He saved his bishop and attacked my nearside pawn.",
        "49. gxf7": "I was ever-closer and was one step away.",
        "49... Bc4": "He moved out, leaving no congestion.",
        "50. f8=Q": "Promotion.",
        "50... Bd3": "Nowhere to move, he stumbled.",
        "51. Qa3+": "Fork. He was royally screwed.",
        "51... Kb5": "He escaped check.",
        "52. Qxd3+": "I took his bishop and he was in check yet again.\n",
        "52... Ka5": "He escaped AGAIN and I was planned out.",
        "53. Qd5+": "Fork. ",
        "53... Ka4": "I was ready.",
        "54. Qxh5": "Only his king now.",
        "54... Kb3": "He escaped downward.",
        "55. Qb5+": "No way out, I was ready for mate.",
        "55... Ka2": "He cooperated fully.",
        "56. Ka6": "He was stuck and had no where to go, So I took advantage.\n",
        "56... Ka1": "1",
        "57. Ka5": "2",
        "57... Ka2": "3",
        "58. Ka4": "4",
        "58... Ka1": "5",
        "59. Qd3": "Almost done.",
        "59... Ka2": "Still cooperating, he was ready to lose.",
        "60. Qa3+": "I nailed him and he had a forced position.",
        "60... Kb1": "With his last strength, he was already dead.",
        "61. Qd6": "Getting ready.\n",
        "61... Ka1 62. Kb3": "Annoyed that I could have finished sooner, I was tired.",
        "62... Kb1": "A wall of pawns stopping him he took his last move.",
        "63. Qd1#": "Checkmate. Hope you enjoyed."
    },
    "url": "https://gameknot.com/annotation.pl/destruction-streak-2?gm=35325",
    "gameName": "Destruction Streak #2",
    "players": "Destroyer333 (1200) vs. No Name (1347)",
    "opening": "Nimzovich-Larsen attack (A01)"
}