{
    "moves": {
        "1. g3": "Benko's Opening (I almost always open with g3) generally with the intention of playing the Kings Indian Attack or one of the many king side fianchetto openings.",
        "1... d5": "White: g3\nBlack: d5\n\nQueens Pawn to d5 (the most common and most effective response to g3.)",
        "2. Bg2 Nf6": "White: Bg2\nBlack: Nf6\n\nI've read this is an uncommon opening and I don't see any names for it. I'm sure I'm making a mistake here by opening with Bg2 but it tends to be how I continue unless Nf6 is played in response to g3. ",
        "3. Nf3 e6": "White: Nf3 \nBlack : e6\n\nReti Opening A05",
        "4. d3 c6": "White: d3\nBlack: c6\n\nBlack's response, I guess, is a Semi-Slav defense. \n\nAs white I'm beginning laying the groundwork for the Kings Indian Attack. Apparently, looking back on this game, better here for white would have been to castle. I played d3, defending the e4 square from the knight on f6.  ",
        "5. a3 Qa5+": "White: a3\nBlack: Qa5+\n\nI played a3 here... completely out of book, but I felt as though he was going to play Bb4+. I have played several games where my opponent and I were in this same position and they followed the 4th sequence with Bishop b4 check. Unfortunately, I was in a blitz game and didn't think about my prophylactic a3 leaving Qa5+ open. ",
        "6. Nbd2 Bb4": "White: Nbd2\nBlack: Bb4\n\nI don't know if it's considered a good move or not, but I like Black's choice to play Bb4 here. My first reaction was to take with the a pawn but I quickly saw how that sequence would result in the loss of the rook on a1. The a pawn is effectively pinned and he's got a strong attack on the Knight on d2 and my king who still hasn't castled. We were playing with semi-tight time restraints as it was a blitz game so there wasn't a lot of time to analyze position. \n\nI played Nbd2, continuing my KIA development and blocking the check on my King. ",
        "7. c3 Bd6": "White: c3\nBlack Bd6\n\nI played c3 attacking the Bishop and putting another line of defense up against the Queen on a5. I had two intentions here, one was to have the black bishop retreat and two planning to attack with my pawn on b2. I wanted to push it to b4, furthering development, and hoping the queen would either retreat or possibly move to a4. a4 would be a blunder, but I see stuff like that a lot in blitz games.  ",
        "8. e4 dxe4": "White: e4\nBlack: dxe4\n\nI played e4 completing my opening development and was fairly confident going into the late opening early middle game. I neglected to castle which probably was a mistake. I've been experimenting with waiting longer to castle and seeing how the game develops with the rapid development that not sacrificing a move to castling allows.\n\nMy opponent took my pawn on e4 effectively beginning the material exchanges that are usually inevitable in blitz games.  ",
        "9. dxe4 Ng4": "White: dxe4\nBlack: Ng4\n\nI quickly took back the lost pawn and my opponent surprised me with Ng4. I expected my opponent to bring his bishop back to c7 preventing me from pushing the e pawn to e5 attacking the Knight, yet still maintaining a strong presence on the dark b-h diagonal. ",
        "10. Nc4 Nxf2": "White: Nc4\nBlack: Nxf2\n\nI attacked with my Knight on c4 forking his Queen and Bishop. My opponent shocked me by forking both my queen and rook at f2. I hadn't even considered this possibility when I moved my Knight to c4. ",
        "11. Kxf2 Qc5+": "White: Kxf2\nBlack: Qc5+\n\nI took my opponents Knight on f2 with my King and he responded by checking my King with his Queen on c5 and attacking my Knight on c4. This was a very bad move on my part. Going back to move 10, had I taken the Bishop on d6 with my Knight I would have forked his King and Bishop. This would have allowed me to gain the Knight on f2 without losing any material. I noticed this immediately after I made the move, but unfortunately it was a blitz game and I was trying to play intuitively. Looking back this may have been my worst move. ",
        "12. Be3 Qxc4": "White: Be3\nBlack: Qxc4\n\nI was up two points in material prior to this sequence. Here I blocked the check on my King with my Bishop and my opponent took my Knight on c4. This put me down a pawn in material. ",
        "13. Qxd6 Nd7": "White: Qxd6\nBlack: Nd7\n\nI wanted to regain some tempo and material and I saw a clear opportunity to do so by taking my opponents Bishop on d6... This had the added benefit of attacking his King (check) and giving me control of the d file for the most part. At this point, I expected to bring a rook to the semi-open d file and have my opponent castle. My opponent blocked the check by moving his Knight to d7. ",
        "14. Rad1 Qb3": "White: Rad1\nBlack: Qb3\n\nI strengthened my control of the d file by bringing my Rook from a over to d1 supporting my Queen. My opponent moved his Queen to d2, I guess attacking the b pawn and planning the check that would be a result. I believe better for black would have been to Castle here. I had already considered this move by black when I moved my queen to d6. My Knight on f3 would block at d2 and attack forcing him to move to a4 or b5/b6. Qa2 would be a major blunder on his part. After Qa2 Rda1; Qb3, Qc4, Qd5 would all result in the loss of his Queen. ",
        "15. Rd2 Qa4": "White: Rd2\nBlack: Qa4\n\nI moved my Rook on a to d2 with the intention of doubling my rooks and gaining more control of the d file. My opponent responded by moving his Queen to a4. I'm not sure what his plan was here. I guess he was planning to attack the weak pawn on e4, but this was a fatal mistake. Mate can easily be achieved from here. MUCH better was Qb5. ",
        "16. Bc5": "White: Bc5\nBlack: Resigned\n\nThe game ended when I moved my bishop to c5. From here mate can be achieved several ways... though I was trying to get mate in one after: Nxc5 Qd8#\n\nHad Black responded \n16. Kd8 \n17. Ne5 Qd4+ (his only chance)\n18. Rxd4 Rf8 \n19. Qxf8+ Kc7\n20. Qd6+ Kd8\n21. Nxf7+ Ke8\n22. Qxe6#\n\nHad black not sacrificed his rook at move 18... you have: 19. Nxf7+ Ke8 20. Qe7#\n\nAll in all a good game. Black made some poor choices, as did I. I submit the game wondering how I played it wrong outside of move 11. I really enjoyed this game. Up until the end, I never really felt confident in a victory. I'm proud of the result, obviously, but I really like saving all of my games and reviewing them. Annotating them is a good way to see where my mindset is as I progress. \n"
    },
    "url": "https://gameknot.com/annotation.pl/did-i-play-this-correctly-blitz?gm=57941",
    "gameName": "Did I play this correctly? blitz",
    "players": "jc0le (me)  vs. kejzak ",
    "opening": "Benko's opening (A00)"
}