{
    "moves": {
        "1. c4": "As in our last game, my opponent chose the English but I responded differently.",
        "1... e5 2. g3 Nf6 3. Bg2 Be7 4. a3": "Seems a slightly odd response to ...Be7 but I suppose it prepares Queenside expansion coupled with Queenside fianchetto.",
        "4... O-O 5. Nc3 c6": "This move demonstrates the old observation that every move has its advantages and disadvantages: the pawn advance contests control of d5 and b5 but deprives the QN of its most active square",
        "6. d3 d6": "I felt the need to prepare for the development of my Queenside but couldn't yet commit to ...d5 because the sums didn't work..  ",
        "7. Nf3 Nbd7 8. O-O Rb8 9. b4 b5 10. cxb5 cxb5 11. Nd2 Bb7 12. Nde4 Nxe4 13. dxe4 a6 14. Nd5 Nf6 15. Nxe7+ Qxe7 16. f3": "From my point of view, the first mysterious move of the game.  It defends e4 while blocking in White's fianchettoed bishop and appears to prepare g4 but also exposes the K on the g1-a7 diagonal, not that Black can exploit it.",
        "16... Rbc8 17. Bh3": "? So Black immediately invites White to reactivate his B.",
        "17... Rc4": "? Advancing a Rook to no particular purpose is always risky",
        "18. Be3 Bc8 19. Bg2 Be6": "At least I've redeveloped my B where it is no longer biting on granite.",
        "20. Rc1 Rfc8 21. Rxc4 Rxc4": "? Recapturing with the wrong piece.  As a general principle it is always better to have the heavy artillery behind the lighter fighters.  This R soon becomes embarrassed, losing me the game.",
        "22. Qd2 d5": "I thought I was winning with this move...",
        "23. exd5 Nxd5 24. Bc5": "This move seals in the errant Rook while assaulting the Q.",
        "24... Qc7 25. e4": "Not only does this attack the Knight but it also cuts off the Rook's lateral options and opens up a potential line of attack for the Bg2 from f1.",
        "25... Nb6 26. Rd1": "Now there's a serious back-row mate threat to be followed by an attack on that errant R.",
        "26... f6 27. Bf1 Rxc5 28. Qd8+ Kf7 29. bxc5 Qxc5+ 30. Kh1 Qe3 31. Kg2 Nc4 32. Bxc4 bxc4 33. g4 Qxa3": "Black's chances seem to lie in promoting a Queenside pawn, so this is logical pawn-grabbing.",
        "34. Rd6 Qa2+ 35. Kg3 c3": "?? This seems to throw a valuable pawn away.",
        "36. Qc7+ Kg6 37. Qe7": "But White finds a more direct attack.",
        "37... Bf7": "? Given White's response, this move is inadequate.  It was probably better to advance the c-pawn again, giving up the B.",
        "38. Qxe5": "!  I'd completely missed this capture, exploiting the pin on my 3rd rank.  Now mate in 1 is threatened (Qh5).",
        "38... Kh6 39. g5+ Kh5 40. gxf6+ Kh6 41. h4 gxf6": "? Overlooking another pin on the 3rd rank.  It was probably impossible to avoid imminent mate but to overlook the immediate was unforgiveable.  If I'd played this knowing I was going to be mated next move I wouldn't mind ...  At least he took a couple of minutes to see it himself!",
        "42. Qg5#": ""
    },
    "url": "https://gameknot.com/annotation.pl/didcot-1-v-wantage-1-o-dl-bd-5?gm=35432",
    "gameName": "Didcot 1 v Wantage 1 (O&DL) Bd 5",
    "players": "Paul Paxton-Doggett (1824) vs. Bob Jacobs (1752)",
    "opening": "English opening (A20)"
}