{
    "moves": {
        "1. e4 c5 2. Nf3 d6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 a6 6. Be3": "All standard Sicilian Najdorf variation so far, hacked out at speed by both of us.  This move signifies the English Attack normally.  On Gameknot, I don't have a good record against it.  I normally play 6 ...e5, which forces White to move the Nd4 but leaves a hole at d5 that White may subsequently exploit.  I've also toyed with an immediate 6....Ng4 to harass the Be3 but with limited success.  This game, I decided on a more conservative approach.",
        "6... e6": "A standard Scheveningen formation, I believe.",
        "7. Be2": "White continues with minor piece development.  This is a very flexible move, giving the B good scope.  I'd expected 7. f3 followed by a g4 advance as is standard in the English Attack but I don't think there's anything wrong with this move.",
        "7... Be7 8. O-O O-O": "We've both elected to castle kingside and put development before tactics, as advised in all good chess primers.  However, as is typical of many Sicilian variations, White's pieces are better developed than Black's whose pawns have made more moves, so I'd normally expect a vigorous attack from White to begin now.",
        "9. f4": "Sure enough, the f-pawn launches forward and White is threatening to attack Black's central pawn fortification.",
        "9... Nbd7": "I continue with my development, preferring this square for the QN as it both supports the other N on f6 and also covers e5 and c5.  If I can get ...Nc5 in, I can counter-attack White's e-pawn.",
        "10. Bf3": "White occupies the long diagonal, discouraging me from playing the standard ...b5 advance, followed by fianchetto on b7.  This also over-defends e4, if he doesn't want to advance it.",
        "10... Qc7": "A standard square for the Q.  I played this now in order to enable ...b5 and ...Bb7 followed by centralisation of the Ra8.",
        "11. f5": "!? White spots the opportunity to win a pawn and fork Q and R if Black allows 12. fxe6 fxe6 13. Nxe6!  So this appears to force a careful response from Black.  I actually didn't think very long about my reply, though, as I spotted an attractive move to unclog my position, exploiting a newly available square.",
        "11... Ne5": "This frees up the Bc8 to defend e6 and simultaneously threatens to swap the N from White's Bf3, giving Black an advantage on the White squares.",
        "12. fxe6 Nxf3+": "The immediate recapture on e6 would have allowed White to avoid the swap, so I preferred to interpose this move.  The disadvantage of this sequence is that Black ends up with an awkward pawn formation of three islands of 2 and is faced with the threat that White will storm Black's position by exploiting the open f-file.  However, I felt that I could cope with that.",
        "13. Qxf3": "White now also has options to play Qg3 followed by Bh6 if he so chooses.",
        "13... fxe6": "I preferred this recapture to the B recapture as I wanted to preserve the advantage of 2 bishops if at all possible.  Furthermore, the swap on f3 had been intended to create an advantage on White squares, dependent on keeping the B, which currently also supports the central pawn island.",
        "14. Qe2": "?!  Odd.  Not quite sure why he played this.",
        "14... Bd7": "Now I wanted to connect and possibly double my rooks as quickly as possible.",
        "15. Rad1": "Standard developing move but White is not creating any immediarte threats or exploiting the weaknesses in Black's position.",
        "15... Rf7": "Preparing to double on the f-file in the hope of converting a perceived weakness into a strength.",
        "16. Nf3": "Threatening to attack the Rf7.  I can't now double because the Rf7 would be trapped after 16...Rf7 17. Ng5.",
        "16... h6": "Hence this defensive push that leaves a hole on g6.  If I'd been White, I would have rushed to exploit this with 17. Nh4.",
        "17. Bd4": "But White clearly had other plans.  Maybe 16. Nf3 had been played with the objective of enabling this all along.  White now threatens to advance his isolated pawn and use e5 as a strongpoint from which to attack Black's line of pieces on his second rank.",
        "17... e5": "So he's succeeded in provoking this move which creates another hole on d5 but frees up my B to exploit the white squares.",
        "18. Bf2": "Not sure that this is better than 18. Be3.",
        "18... Raf8": "At last I've doubled my rooks but I'm not sure there's anything constructive to do with them yet.",
        "19. h3": "This prevents Black from playing N or B to g4 but also creates a weakness on g3.",
        "19... Be6": "Taking advantage of the space created by 17...e5, I improve the position of this B and cover the hole on d5 with a view to enabling my N to move and free up my Rs.",
        "20. Nh4": "? White gets his N move in before I can, threatening once more to disrupt my plans; but now I spot another opportunity that White appears to have overlooked.",
        "20... Bc4": "! Now I skewer White's Q and R, threatening to win a material advantage.  Beacuse his Q is attacked directly, White can't interpose a counter-threat like 21. Ng6.  White's gurning confirmed that he hadn't expected this.",
        "21. Qe3": "After grimacing, he played this quickly ...",
        "21... Bxf1": "Having first checked that I wasn't walking into something, I, too, played this quickly.",
        "22. Rxf1 Kh7": "Played to prevent Ng6 as I didn't want to have to move my Rf8 again.",
        "23. Nf5 Rd8": "But now I decided I had to move it anyway in order to prevent him building up unmeetable pressure on d6.  Up to this point I'd been ahead on the clock but now I spent about 15 mins each on my next few moves, calculating all sorts of variations and rejecting various risky moves that I can't now remember!",
        "24. Kh1": "I wasn't quite sure what this was played for: probably to allow his B to retreat while retaining control of the g1-a7 diagonal or to allow Rg1, supporting a pawn advance.",
        "24... Qc6": "To get of the a5-d8 diagonal and make indirect threats down the long white diagonal, while retaining defence of d6.",
        "25. Bh4": "! Now the possibility of 26. Nxe7 Rxe7 27. Bxf6 gxf6 28. Rxf6 caused me concern.  Interposing the g-pawn looked too risky but I struggled to find a suitable way of maintaining my advantage.",
        "25... Rdf8": "With White no longer threatening to build up intolerable pressure on d6 but instead causing me a headache on the h4-d8 diagonal, I eventually shifted the R back again.  Most of my thought had gone into calculating variations based on N moves but I couldn't find any way of making them work.  I felt I was getting nowhere slowly ...",
        "26. Rd1": "Once again, attention shifts to the d-file and again I have a long think trying to find clever ways to assert my advantage before eventually settling for the mundane.",
        "26... Rd8 27. Nd5": "This looks nasty but allows me to counter-attack.",
        "27... Nxd5 28. exd5 Qxc2 29. Nxe7": "?? Oversight.",
        "29... Qxd1+": "and White resigned as I made the move.  He could perhaps have tried to continue with 30. Kh2 Rd7 31. Qe4+ Kh8 32. Ng6+ Kg8 but Black should eventually triumph."
    },
    "url": "https://gameknot.com/annotation.pl/didcot-2-v-oxford-city-2-bd3?gm=58381",
    "gameName": "Didcot 2 v Oxford City 2 Bd3",
    "players": "Dave Godfrey (1810) vs. Bob Jacobs (1646)",
    "opening": "Sicilian (B90), Najdorf, Byrne (English) attack"
}