{
    "moves": {
        "1. e4": "Hot on the previous night's lucky win for the 1st Team, last night was a return to Earth with this exciting game, lost in a rush of blood to the head on my part.  I open with my usual 1. e4 - I prefer tactical scrambles to strategic tussles on the whole, even though I'm prone to slipping up in the process ...",
        "1... c5": "The Sicilian, an opening to prefer to play as Black, as it's very resourceful in counter-attacking options.",
        "2. Nf3 d6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 a6": "Typical of the Najdorf or the Dragon variations.",
        "6. Bc4": "I've liked this move ever since I went to see the 17th game in the Short - Kasparov World Championship match in London.  6. Bg5 is probably the most common alternative, though the English Attack, characterised by f3 and Be3 is also very popular.",
        "6... e6": "Confirming the Najdorf rather than the Dragon (6....g6).",
        "7. Bb3": "I usually play this immediately as it cuts out the trick ...Nxe4, Nxe4, ...d5, forking B and N.  It also gets the B off the semi-open c-file and covers the queenside pawns in the event of queenside castling, though I usually castle kingside in this opening.",
        "7... Be7": "The standard move to prepare kingside castling.  Another approach is to develop the queenside to allow queenside castling or at least to disturb White's troop of minor pieces there, with 7....b5 followed by queenside fianchetto, though Black has to keep an eye on potential White tricks on e6, or 7...Nbd7 followed by ...Nc5, forking Bb3 and pawn on e4",
        "8. f4": "I've found this to be a more aggressive and flexible move than immediate castling.  My worries in this line usually concern my e-pawn when Black puts his B on b7.",
        "8... Nc6": "Quite unusual in my experience and less daunting than 8...b5 as explained previously.",
        "9. Be3": "I didn't want to swap the Ns yet, as the Nd4 provides me with so many possible plans.  In a previous annotation, I explained why I swapped on c6 at the first opportunity in terms of establishing an isolated pawn for Black.  It was pointed out to me that Black's mass of central pawns and half-open b-file more than compensated.  This B move develops it centrally and defends the Nd4 so that the Q can also develop freely.",
        "9... O-O": "Standard.",
        "10. Qf3": "I immediately prepare to attack the castled king, keeping my options open about where to put my king.",
        "10... e5": "With the N deprived of its most natural retreat square, Black attacks it.",
        "11. Nxc6": "Now I swapped, removing a defender of e5.  I didn't want to retreat the N and I rejected 11. Nf5 as I didn't like 11...Bxf5 12. exf5 d5 when I wasn't sure how to respond.",
        "11... bxc6 12. f5": "I played this quickly, without really thinking.  I was keen to prosecute the kingside attack, so it made sense to shut off Black's QB, but I think I should have planned a bit more carefully around here.  If Black counter-attacked in the centre, the pawn could become weak and my king exposed.",
        "12... Ne8": "Unexpected but it makes sense.  Black wants to swap the DSBs before White's attack gets going.",
        "13. O-O-O": "Now seemed a propitious time to castle queenside, allowing me to prepare an all-out kingside assault.  The king seems quite safe here as Black's pieces are more suitably arranged for kingside defence than queenside attack.",
        "13... Bg5": "Black pursues his plan to eliminate the DSBs.  My B is, of course, pinned against my K, so I can't avoid the swap but I can influence how it happens.  I didn't want his Q coming to g5, hence my reply.",
        "14. h4": "As I let go of the piece, I thought, \"Oh dear, he can just take the pawn\" but then decided that, if he did, I could happily play Qh3...",
        "14... Bxe3+ 15. Qxe3 Nf6": "Black reactivates the backward N as soon as possible.  The N covers g4 and h5 and inhibits my N and Q by attacking e4.",
        "16. Qf3": "and I returned my Q to f3 to support the pawns' advance.",
        "16... h5": "Black again inhibits the planned pawn push.",
        "17. Ne2": "I had to think quite a long time to devise a plan now, eventually deciding on Nc3-e2-g3 to attack the h-pawn, which would be difficult to defend safely.  The problem is that this allows Black to counter-attack in the centre.",
        "17... d5": "Black duly takes the opportunity.  A complex and exciting tactical struggle now ensues.",
        "18. Ng3": "This move now has a dual purpose, defending e4 at the same time as attacking h5.... Though it won't be able to do both indefinitely.",
        "18... dxe4": "With White's Q on f3 attacked , Black can afford to allow the pinned pawn to expose his Q to the attack by the Rd1",
        "19. Nxe4 Qe7": "Now Black moves off the open d-file...",
        "20. Nd6": "Another long think came up with this multi-purpose move.  I wanted to exert pressure on f7, possible swapping B and N for p and R, but also to defend f5 and possibly swap on c8, depending on how Black reacted.",
        "20... e4": "Black attacks White's Q and threatens to march the pawn to promotion pronto.",
        "21. Qg3": "With this sidestep, I over-defend the Nd6 and threaten to come to g6 at some stage.",
        "21... Nd5": "This cuts off my Rd1's defence of the Nd6 and my B's attack on f7.  It also supports the potential pawn advance, allows another piece to occupy f6 and puts the N in range of dangerous squares like b4, c3, d3.",
        "22. Rhf1": "Although my pawn on f5 was already defended, its defence was a precariously placed attacking piece.  This move also prepared my pawn's possible advance.  It did create the potential of a fork from d3, though, which I would have to watch out for.",
        "22... Qf6": "Yes.. the Q occupies f6, defending g7, lining up on b2 and barring the way forward for my pawn.",
        "23. Nxe4": "I was glad to seize this opportunity as soon as it arose.",
        "23... Qh6+": "Although it shouldn't have, this move took me by surprise.  Now the fork from d3 was a clear and present danger.",
        "24. Kb1": "I didn't fidn any of the ways of blocking the check very attractive.",
        "24... Qe3": "Played swiftly, this also took me by surprise.  Clearly Black was keen to swap Queens and then would be able to deliver the fork and gain a material advantage.  A rather panicked deliberation then ensued and I came up with ...",
        "25. Nf6+": "with which I felt inordinately proud, given that Black couldn't capture with his N because it would leave his Q undefended, nor his g7 pawn because it was pinned.  But of course, he could just move his King and then I would have two pieces en prise.",
        "25... Kh8": "I realised now that I had let my emotions get the better of me and that I was now in trouble.  How could I avoid the loss of material?",
        "26. Rd3": "?? Not like this.  We didn't have time to discuss the game afterwards as I had to get home, but Stephen did point out that I'd moved the wrong rook up.  26. Rf3 would have prevented the swap and allowed me another move to extricate my N.",
        "26... Qxg3 27. Rxg3 gxf6": "So now I was down a piece to a pawn, with no obvious way of renewing my attack on Black's King or of regaining the material.  The rest of the game is just wood-shuffling till the loss of more material was inevitable.",
        "28. Rd3": "I thought I ought to continue for a while in the hope of something coming up, so started by threatening to win back a pawn but my problem was always trying to find ways of attacking while having to avoid forks. ",
        "28... a5": "Black threatens to skewer the rooks, so one of them has to move.",
        "29. Rd4": "Maintaining the attack on d5 while relieving the threat of the skewer and avoiding a fork.",
        "29... Ba6": "Black attacks the Rf1 anyway, while connecting his rooks.",
        "30. Re1": "At least both rooks are now on black squares and Black's N is at least 4 moves away from one of the the forking squares, f3, which is also defended by a pawn.  The other forking square is c2, which is defended by King and Bishop.",
        "30... Rae8": "Black's plan is simple: swap off and accentuate the material advantage until it becomes overwhelming.",
        "31. Rde4": "? I think I should have avoided a swap for as long as possible as 2 rooks at least give one attacking potential, if they can be coordinated.  Unfortunately, I also had to guard against back-row mates, and was somewhat dispirited, so didn't look hard enough for another move.  31. Red1 was at least a possibility, though I didn't fancy being harried by N and B.",
        "31... Rxe4 32. Rxe4 Rd8 33. c4 Nb4 34. Re2": "To prevent ...Rd2",
        "34... c5 35. a3 Nc6 36. Re3": "I don't remember why I played this.  I think I had run out of ideas and just needed the appropriate prompt to resign.",
        "36... Ne5": "Now I wasn't going to be able to prevent the loss of the c-pawn or worse.",
        "37. Rc3 Rd4": "and that was enough for me.  I might as well have resigned after 27...gxf6 but you have to try for your team-mates..."
    },
    "url": "https://gameknot.com/annotation.pl/didcot-2-v-wantage-1-o-dl-div-2?gm=56416",
    "gameName": "Didcot 2 v Wantage 1 O&DL Div 2",
    "players": "Bob Jacobs  (1623) vs. Stephen Morris (1735)",
    "opening": "Sicilian (B90), Najdorf, Lipnitzky attack"
}