{
    "moves": {
        "1. e4": "I had played a few dozen games trying to learn the Stonewall Attack (watched some videos on YouTube and it looked like an interesting option for D4) but found there were too many issues for me as white to cover all the time. I guess most players in the range I play (1250 to 1500) recognize the line, as I do now, and know if they block or eliminate white's LS bishop the basic line is rendered useless. There are no doubt other variations but I do not have the time and skill to study chess that deeply really. So this game was not to be a Stonewall game and I think was I trying to go for a Spanish game when I opened with E4 as that I what I like to explore lately. But you will see it ended up resembling a board you might well see in a classic Stonewall Attack game. ",
        "1... e6": "But seems black wants to do a French Defense here, which is okay with me as it is my favorite to use as black (avoiding that annoying assault on F7 right off the bat that many players like to employ) , along with the slightly similar Caro-Kann. I figured I would do the advance variation as i am used it when I play black.",
        "2. d4 d5 3. Nc3": "But I decided not to do the advance because as black I get so burned out with it. 9 out of 10 times I deal with the advance so I try Knc3, which is the most popular move according to the Gameknot World DB. Few people at my level at GK use it so I thought I would give it a go, win or lose, and see where it led. ",
        "3... Nf6 4. e5 Nfd7 5. f4 Nc6": "This looks odd for white but I do not feel like I am too screwed. I like to play the King's Gambit and Vienna Gambit so I am a little okay with this sort of set up as long as I can castle king side and have the semi-open F-file I figure I will manage later. ",
        "6. Nf3 Be7 7. Bd3": "At this point I notice the game looks slightly like a Stonewall Attack game. Not a perfect book set up but I recall things looking this way. Of course one does not have to play something just like it goes in a book example to arrive at a similar board. The Caro-Kann winds up often looking like a French Defense game after black advances his pawn to D5 and it is covered by his DS bishop. I keep this in mind as we continue with what seems to be mostly book moves from the Database though I do not recall using it too much this game.",
        "7... b6": "I saw later we were both playing standard book moves here. This is a pretty serious looking set up and at this point I am feeling a bit lost. ",
        "8. O-O": "With this castle I am aiming to move out my rook and I figure I am going for the LS bishop sacrifice, not something I do lightly. I pray to my pagan gods for guidance and strength. ",
        "8... O-O 9. Ng5": "I am just dreaming here I can attack the H7 pawn and keep my bishop. I figure he is going to move pawn to H6. ",
        "9... Bxg5": "He takes with his DS bishop. I did not expect this really but it does not seem like a terrible move at all. But in the end, as the games advances,  my pawn on the G-file proves to be helpful to me and a problem for black.",
        "10. fxg5 Nxd4": "My kingside looks scattered. At this point the only thing keeping me going is the few dozen Stonewall games I had played and even won a few. The board does not look all that alien to me now and for all practical purposes I could have started the game as a SW game. I am not confident, but as long as I am in slightly charted waters I am a little okay. I did not like losing that pawn but I also feel it it not a necessary piece for now and I am about to lose bigger fish anyway as my next move is to sacrifice my LS bishop on H7. ",
        "11. Bxh7+": "Black simply has to take that bishop though in a few games in the past players did not. As if they were saying \"I will not fall for that one!\" or something, allowing white to keep the piece. That is totally great for white, but my opponent is a solid player really and does what needs to be done. I saw he ran an analysis on the game and this is an inaccuracy for white really. The analysis suggests rook to F4, attacking the knight and getting it out to where I want it to be anyway. I had considered that but felt black would just guard the knight with his C pawn and my rook was coming out in a couple moves anyway to harass the knight. ",
        "11... Kxh7 12. Qh5+": "In this situation white's material loss is worth it, though the game is far from over. I would like my pawn on G6. Will it get there in time? ",
        "12... Kg8 13. Rf4": "Rook is out and attacking the knight and heading to the H file where it can become a life threatening problem for black. ",
        "13... Nf5 14. g4": "Need to harass the knight to get my rook over to the H file. In the process I lose time and block the rook myself from heading to the H-file quickly. He obviously sees the threat and is trying to neutralize it. ",
        "14... Ne3": "But here he makes a grievous error under pressure. He did not have lots of choices but he did not want to lose his knight yet and allow my DS bishop into the battle.  Probably Knd6 would have been a better option for now. ",
        "15. Bxe3 Nxe5": "I figure he is going to G6 to protect H8 from my queen and rook combination. ",
        "16. Bd4 Ng6": "Yes. A fly in the ointment for sure. My doubled pawns are hindering me as well. I feel I had a good plan but like most Stone Walls I've tried to build it is crumbling. ",
        "17. Rf3 c5": "Jeesh. I saw it coming but wanted more time. ",
        "18. Bxg7": "This a bit amazing for me really as I am a really wimpy conservative player in my opinion. But maybe I am not really. My bishop has to move now after his attack. This is one of those moves I would not have made had he not forced me to.  I sacrifice my DS square bishop. It is a gamble but it can work if things go a certain way. Of course I would like his king to take it so my queen and pawn can work together a bit. ",
        "18... Kxg7 19. Qh6+": "At this point things begin turning in my favor in a big way and the pawn I sued to take his DS bishop earlier in the game serves a vital purpose now. As long as I keep my cool I suddenly see I can pull it off. ",
        "19... Kg8 20. Rh3": "The pressure is all on black to simply survive now. Black has to begin spending moves, quickly, trying to devise an escape route. I know the feeling as black myself when lack's casteled king is under an heavy assault. Hate that sensation. ",
        "20... Re8 21. Qh7+ Kf8 22. Rf1": "This is no doubt stressful for black and I really want to win it now as I took so many risks and am down in material even. Great to win against a strong player when you are down in sacrificed material I feel. This is the move by the \"hopefully forgotten rook\". You know, the rook move we see can happening and screwing us over and we hope the other guy does not see or has forgotten about. ",
        "22... Qd7 23. Qxg6": "The rook on the F-file has become a dire threat suddenly. ",
        "23... f5": "Here black allows his queen some freedom on the 7th rank. I did not want to get hasty and move my rook to H8 as his king can escape ultimately to D6. Slow down and take one more move here. ",
        "24. Qf6+": "Black resigns because Qf7 and then Rh8 mate. Good game to my opponent. A bit of luck mixed with recognition of old patterns from another line pulled me through. Not easy by any stretch. "
    },
    "url": "https://gameknot.com/annotation.pl/didnt-start-off-as-a-stonewall-attack?gm=54759",
    "gameName": "Didn't start off as a Stonewall Attack...",
    "players": "zhudan (1324) vs. dwwd (1407)",
    "opening": "French (C11), Steinitz, Bradford attack"
}