{
    "moves": {
        "1. e4": "This game was played terribly by me but it shows: never let your opponent get a queen in the endgame! e4 - Standard move.",
        "1... e6": "e6. French defense.",
        "2. d4 d5 3. Nc3 Bb4 4. e5 c5 5. a3 Bxc3+ 6. bxc3 c4 7. Nf3 h6 8. Be2 Ne7 9. O-O Ng6 10. a4": "a4, letting the Black Bishop out. However, most of Black's pieces are on the Queenside and White would be better attacking on that side.",
        "10... O-O 11. Bb2": "Now the Bishop moves to b2. This cuts off its line of effect and although it lets the Q come to b1, Ba3 was probably better from that perspective.",
        "11... Nc6 12. Nd2 f6": "f6, leaving a hole in the kingside, but trying to prevent a Kingside attack winning.",
        "13. exf6 Qxf6 14. Ba3": "Now the Bishop moves to a3, probably what it should have done to start with.",
        "14... Rd8 15. Re1 Nce7 16. Bh5 b6 17. Re3 Nf5 18. Rf3 Qg5": "Forcing the exchange, as the White Bishop was menacing on the Kingside.",
        "19. Bxg6 Qxg6 20. Rh3 Re8 21. Nf3 Bb7 22. Ne5 Qf6 23. Qh5 a6 24. Nd7 Qd8 25. Ne5 b5": "b5?? I completely missed the threat!",
        "26. Qf7+": "Oh dear.",
        "26... Kh8 27. Qxb7 Qb8": "Now, I thought an attack would finish me off, so I sought to swap off Queens. My only other alternative was Qf6, which probably also swaps off after Qf7 (notice the N forks winning the Q if it is on g5 or d8)",
        "28. Qxb8 Raxb8 29. g4": "g4! A good move by White. The Knight has no escape square, as Ne7 is punished by Bxe7, and if the Rook takes the Bishop, Ng6  winnning a whole rook.",
        "29... Nxd4 30. cxd4 Rec8 31. Nd7 Rb7 32. Nc5 Rb6 33. Re1 b4 34. Bc1 Re8 35. g5": "g5, winning another pawn. White is playing this game well from two pieces for a pawn up.",
        "35... e5 36. gxh6 Rg6+ 37. Kf1 e4 38. hxg7+ Kxg7 39. Rg3": "Now White swaps off material, which you should do when ahead.",
        "39... Rxg3 40. fxg3": "Now White has two connected passed pawns, which should be enough to win...",
        "40... a5 41. Kg2 Kg6 42. Nb7 Ra8 43. h4 b3 44. cxb3 cxb3": "Black tries to push through the Queenside, as that is really his only hope.",
        "45. Bb2 Rc8 46. Nc5 Rb8 47. Re3 Kf5 48. Rxb3": "White has enough of that!",
        "48... Re8 49. Re3 Rb8 50. Ba3 Rb1 51. Nd7 Rd1 52. Bc5 Ra1 53. Nb6 Ke6 54. h5 Ra2+ 55. Kh3": "Black now has to attempt to stop the pawn.",
        "55... Ra1": "If White plays h6, then Rh1  wins the pawn.",
        "56. Kg4": "White realises this and counters the threat again.",
        "56... Rh1 57. Kg5 Rf1 58. g4 Rf3": "Now that the King is on g5, Black can try this line... Rxf3, exg3 and the pawn cannot be stopped, although both sides get Queens. I think this is a win for White however.",
        "59. Nc4": "Nc4 - novel way of preventing the R taking!",
        "59... dxc4 60. Rxe4+ Kd7 61. h6 c3": "c3, another attempt!",
        "62. h7": "It was probably wisest to get the B to a3, so it could stop the pawn.",
        "62... Rh3 63. Kg6 Kc6": "Black realises that White's Rook can stop his pawn, so tries to get the king in.",
        "64. Kg7 Kd5 65. Re5+ Kc4 66. Rh5": "Rh5! If RxR, gxR and after c2 the B can stop the pawn queening by going to a3. ",
        "66... c2": "c2! The only hope. It probably still loses.",
        "67. Rxh3 c1=Q 68. h8=Q Qg5+": "Check until you can check no more!",
        "69. Kf7 Qd5+ 70. Kg6 Qe6+ 71. Kh5 Qf7+ 72. Kg5 Qd5+ 73. Qe5 Qg8+ 74. Kf4 Qf7+ 75. Ke3": "Black has no checks, but...",
        "75... Qg6": "neither does White! Black is threatening another spree starting at Qd3 ",
        "76. Kd2 Qc2+": "Qc2 !! If the King takes, it is stalemate.",
        "77. Ke1 Qd2+ 78. Kf1 Qf2+ 79. Kxf2": "Stalemate!"
    },
    "url": "https://gameknot.com/annotation.pl/dont-let-your-opponent-get-a-queen?gm=8031",
    "gameName": "Don't let your opponent get a Queen!",
    "players": "wizardx (1534) vs. casmith_789 (1615)",
    "opening": "French (C18), Winawer, advance variation"
}