{
    "moves": {
        "1. d4 d5 2. Nf3 Nc6 3. Bf4 g6 4. e3 Bg7 5. c3 f6": "Interesting way to contest the center. Until a sac is not possible in g6, it's perfectly ok. ",
        "6. h3": "The only thing I can do is to keep off black's lsb to g4, just in case. . ",
        "6... e5 7. dxe5 fxe5 8. Bg5 Qd6 9. Qa4 Bd7 10. Bb5 Nge7": "Now black is defending, but he has a very good center and wins me in developement. Concretely, if I had my Nb1 out of there, I would be able to bring my rook to d1, improving my position. h3 WAS a waste of a time, after all. ",
        "11. g4": "The conventional plan Nb-e2, o-o-o, Nc4 looks ok, but just a little slow. So I tried to further limit black's moves, controlling the good f5.",
        "11... O-O": "Black castles the right way. My forces are aimed to the queenside, and this correctly opens the way for the rook's action. ",
        "12. Nbd2 e4": "This advance is not good for black until he doesn't threat f2 seriously. It is better for him to keep the central tension and control. ",
        "13. Nd4 a6": "This loses a pawn, but a cost of a massive pieces exchange, and I'm not sure it was whortwhile. ",
        "14. Bxe7 Qxe7 15. Nxc6 bxc6 16. Bxc6 Bxc6 17. Qxc6 Qf7": "So I have my extra pawn, but... My pieces are still undeveloped, his are well placed. ",
        "18. O-O a5 19. Rad1": "He should have attacked b2 as soon as possible, to tie me. I don't know really how to proceed, because if I move my knight, his queen has a free highway to f3. ",
        "19... Rad8 20. Qc5": "This move is from a dubious plan to move the f pawn, and it was intended to protect e3 in some lines. ",
        "20... Rd6 21. f4": "The only \"advantage\" of my position is that the queen is in front of the rook, so I can challenge it with N or Rf3 if he takes. ",
        "21... Qf6": "How to proceed? It's really a nasty situation for me. Probably, I had to act trying to blockade the kingside and plan on the queenside, instead, taking a5 after reinforcing a2, etc. ",
        "22. f5": "Taking a risk. He cannot take inmediately, but he correctly envisaged...",
        "22... Qe5": "and I need to ",
        "23. Kg2": "so he can",
        "23... gxf5": "I was trying all the time to go Nc4, but nothing hanged behind. I even though about a sac for two pawns, but I didn't dare. Anyway, with this plan, as often happens in chess, he gets a hole by losing one. ",
        "24. Qxc7": "Now it becomes more interesting, but I must recognize HIS \"hole\" is larger than mine. But now I AM threatening Nc4. Only it is too late. ",
        "24... fxg4": "Nc4, gxh+ then it start to rain.",
        "25. hxg4 Qe6 26. Kh3 Qh6+ 27. Kg2 Rg6": "Interestingly enough, black didn't take e3 inmediately: QxR, Qe2+ and it's not for a blitz game to see if it wins, even if I suspect it does for black. ",
        "28. Qd7": "Of course I always had RxR+, eliminating complications (and the possibility for him to play the reversed exchange that weakens my defence) but I wanted to keep some \"I know what I'm doing\" attitude :-). I was almost lost, for sure: after Be5 (If I take d5 it with check, then QxB, Rxg4+, Qg3... and I'm dead.",
        "28... Qxe3": "Right move, wrong timing. ",
        "29. Qxd5+ Kh8 30. Rxf8+": "I wasn't sure it was the best thing to do, but no more risks...",
        "30... Bxf8 31. Qe5+": "Check to grab some seconds. I tried to make it with Qf5, but I couldn't be sure after Qe2+, Kmoves, Rxg4+, I could survive. I bet I couldn't, so I went for the endgame.",
        "31... Kg8 32. Qxe4 Qxe4+ 33. Nxe4 Rxg4+ 34. Kf3": "...and this is a nice and interesting engame. I have a knight against a bishop in an open position, with black with pawns on both sides, but I have one more. Probably I will win this, but there is a long game to play. ",
        "34... h5": "But he, once relieved the tension, relaxed too much and blundered. ",
        "35. Nf6+": "I'm sorry, but, yo played pretty well, and deserved to win. So this is tonight's lesson: check the outcomes of a position after the exchanges, and be careful with \"out-of-nowhere\" tricks. "
    },
    "url": "https://gameknot.com/annotation.pl/dont-relax-after-a-tense-midgame?gm=39397",
    "gameName": "Don't relax after a tense midgame...",
    "players": "damalfi  vs. anpajan ",
    "opening": "Queen's pawn game, Chigorin variation (D02)"
}