{
    "moves": {
        "1. e4 c5 2. Nf3 d6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 a6": "Najdorf Sicilian",
        "6. Bg5": "Bg5 is the old main line.",
        "6... e5": "e5?! this allows white to take up the knights outpost on f5.  Best by test is e6.",
        "7. Bxf6 gxf6": "(?! for structural reasons) Qxf6 leads to Nd5 black choices to weaken the king side to stop this idea.  The question to be asked now is where is the king going to go?",
        "8. Nf5": "Great square for the knight and must be dealt with.",
        "8... Bxf5 9. exf5": "Black decided to trade knight for bishop.",
        "9... Qc8 10. g4": "Solidifying my pawn Bd3 would have a similar effect but I wanted to place my bishop on the long diagonal.",
        "10... Nd7 11. Bg2 Rb8 12. Qd2": "Stopping the slightly troublesome Bh6.",
        "12... h5": "Black strikes out on the king side.",
        "13. f3": "solidifying a bit.",
        "13... Qc4": "Black plans to take hxg4 fxg4 Qxg4",
        "14. Qe2": "Protects and offers a trade.",
        "14... Qd4 15. Qe4": "Trying to drive the queen back as black doesn't seem to want to trade.",
        "15... Qb6 16. O-O-O": "Defending, developing, and getting my king to safety.",
        "16... Nc5": "Black develops and gains time.",
        "17. Qe2 Bh6+": "again...",
        "18. Kb1": "Black is fully developed, but to what purpose black doesn't have many threats his development just looks nice.  Much the same can be said for white too though.",
        "18... h4 19. Nd5": "Attacking the f6 pawn and the queen.",
        "19... Qd8": "Black can only defend the pawn in this way.",
        "20. f4": "Starting my king side attack.",
        "20... O-O": "(??) black completely ignores the fact that he is sealing his king off from defenders.  This is a classic mistake and one that is seen time and time again.",
        "21. g5": "My attack begins with a pawn sacrifice Blacks best would be to play Bg7.  I would continue with Qh5.",
        "21... fxg5 22. Qh5": "Attacking the bishop again.  Black would be wise to Bg7 I would follow up with fxg5.",
        "22... Kg7": "Kg7??? leads to mate.",
        "23. f6+": "Bishop is now lost.",
        "23... Kh7 24. fxg5": "using the theme of the pin.",
        "24... Ne6": "Black defends the first mate threat of Qxh6+ Kg8 Qg7#, but allows another mate.",
        "25. Qxh6+": "Here Be4+ and Qxh6+ lead to the same thing.  Mate in three more white moves at this point.",
        "25... Kg8": "I do have the option of Ne7+ which leads to a slower mate.  Ne7+ forces Qxe7 a nice material gain but I have better.",
        "26. Be4": "Black resigns only way to stall mate is Re8 Qh7+ Kf8 Qh8#.  Notice how quickly things go down hill for black after castling into an unforeseen explosion."
    },
    "url": "https://gameknot.com/annotation.pl/dont-castle-into-danger?gm=25703",
    "gameName": "Don't castle into danger",
    "players": "yoshark (1522) vs. fluido (1674)",
    "opening": "Sicilian (B94), Najdorf, 6.Bg5"
}