{
    "moves": {
        "1. e4 d5": "Scandinavian defence - For white I think the best response is 2.exd5 and try to draw the Queen out early. A search of GK Databse showed this as the most common reply to e4 d5. ",
        "2. exd5 Qxd5": "With the Queen now out on her lonesome, this highlights the issues with bringing the Queen out too early. It now enables white to develop while threatening the Queen allowing white to obtain a good lead in development. ",
        "3. Nc3 Qe6+ 4. Be2": "Blocking the check but creating a temporarily pinned piece. Be2 I think is the best move here, allows the KS knight to develop and provides the option to kingside castle",
        "4... Qg6": "Threatening g2",
        "5. g3": "No problems with this response as to what I can see",
        "5... e5 6. a3": "I know this is a slow move and is probably disliked by many higher rated players, but I need to get my queen pawn moving and I didnt want a pin on my QS knight with Bb4.",
        "6... c6 7. d3 Nf6": "Developing while threatening g4",
        "8. h3": "Another slow move, but necessary to shut down the threat",
        "8... h5 9. Nf3": "Time to get back to threatening the Queen",
        "9... e4 10. Ne5": "I opted not to take the pawn as focussed on my original game plan to threaten the queen",
        "10... Qf5": "Threatening e5",
        "11. d4 c5 12. g4": "Continuing with the plan. Black is finding it too difficult due to constant attacks on the queen",
        "12... Qe6 13. Bc4": "This is where I can see the end game is drawing near, black is in trouble again. The Queen has to move, but then allows for the next move sequence ",
        "13... Qe7 14. Bxf7+ Kd8": "Do I reveal check...No, I decide to continue development",
        "15. Bf4 cxd4": "This move demonstrated to me the black was struggling, I dont see the sense in this move, I think for black to stay in the game he needs to try and trade off some of my prominently positioned pieces, such as Nc6 or Be6",
        "16. Qxd4+ Nbd7 17. O-O-O": "Enabling me to keep the knight on d7 pinned and allow me to get my queen better placed",
        "17... hxg4": "Another nothing move - I dont know what black is thinking with these moves",
        "18. Nb5": "c7 is my target square",
        "18... Qc5": "Too late with the offer to exchange, checkmate is on its way ",
        "19. Ng6": "Opening the diagonal for c7",
        "19... Qxd4 20. Bc7#": "I love it when you stick to the plan and it comes to fruition its even sweeter to come through with a checkmate by seemingly giving up your Queen! I think black should have been aware of the risks in keeping the Queen out in the open and allowing white to gain tempo, I think after 2. exd5 Qxd5 the safest place is to get the queen back onto d7 and continue to naturally develop. Anyone got another opinion?"
    },
    "url": "https://gameknot.com/annotation.pl/dont-bring-your-queen-out-too-early?gm=19169",
    "gameName": "Dont bring your Queen out too early!",
    "players": "Abinadi1 (1514) vs. Black Player (1534)",
    "opening": "Scandinavian defence, Lasker variation (B01)"
}