{
    "moves": {
        "1. d4": "Classical 1.d4 ",
        "1... Nf6": "1.Nf6",
        "2. c4 e6 3. Nf3 b6 4. a3 Ba6 5. Qc2": "5.Qc2 This type of game for white is always exciting. White play in to queen so early. But still nothing is advantage for white.",
        "5... Bb7 6. Nc3 c5 7. e4": "7.e4 control the middle more precisely compare to black.",
        "7... cxd4": "7.cxd4 is a little bit problem. White night in f3 is positioning for the middle. ",
        "8. Nxd4 Bc5": "white knight also playing with more stronger line that is Nb3. This allow white better controlling the middle game and also danger for black bishop.",
        "9. Nb3 Nc6 10. Nxc5 bxc5 11. f3 Nd4 12. Qf2 d5 13. exd5 exd5 14. Be3 Nb3": "Allright. This is the most crusal game and may be the break point for all game. Nb3 is seem nice for black but it is not. This kind of attacks in chess always be dangerous. You thought that this is danger for white for its castle. But taking valuable pieces is not always win the games. İmportant thing is also playing strong positional playing. This kind of effort always one way battle. \n\n---- Black give up position strenght for this movement with taking 15. Nxa1 .-----",
        "15. cxd5": "black playing position strenght and sacriface its castle. ",
        "15... Nxa1": "Knight takes white rook but its a trap for black.",
        "16. Bxc5": "positional playing white playing 16. bxc5.",
        "16... Kd7 17. Bb5+": "counter attacks has begun for white. ",
        "17... Kc8": "escaping Kc8.",
        "18. O-O Nb3 19. Be3 Re8": "this is sacriface with no purpose.",
        "20. Bxe8 Qxe8 21. Rd1 h6 22. Kh1 Ba6 23. Re1 Qd7 24. Qc2": "White playing and threatşng b3 knight. ",
        "24... Bc4": "protecting b3 knight but still the situation is critical.",
        "25. Ne4": "Open c4 line and also danger for bishop.",
        "25... Qc7": "securing bishop but white has a sacriace again.",
        "26. Bf4": "bishop sacriface is balancing the game and white getting more advantage.",
        "26... Qxf4 27. Qxc4+ Kd8 28. d6": "this is important. Not to taking b3 and instead of play taking white play d6. Still playing for positional strenght.",
        "28... Rc8 29. Nxf6": "One of the good moves of this game. İf you look carefully. Black is has to take knight. There is no way to black take white queen here. ıf black takes to queen game is checkmate for white. (/Re8 is checkmate) ",
        "29... Qxf6 30. Qxb3": "and taking knight +2 point for white and also gain still positonal strenght.",
        "30... Qe6 31. Qb4 Qd5 32. h3 g5 33. Re7 h5 34. d7 Rc5": "trying to cut Re7 line for taking.",
        "35. Qb8+": "sacriface again for white for its castle.",
        "35... Kxe7 36. Qe8+ Kf6 37. d8=Q+": "but taking black queen and gain +5.",
        "37... Qxd8": "queen has to take queen and white taking Qxd8",
        "38. Qxd8+": "This is enough for resignation. White wins."
    },
    "url": "https://gameknot.com/annotation.pl/doru-games?gm=57063",
    "gameName": "Doru games",
    "players": "eekan (2106) vs. condoru (2083)",
    "opening": "Queen's Indian (E12), Petrosian system"
}