{
    "moves": {
        "1. e4 c5 2. Nf3 h6": "Black already demonstrates not knowing the Sicilian very well.",
        "3. b3": "taking control of the long dark square diagonal as black has given me free rain to do so.",
        "3... d6 4. Bb2 Nc6 5. Bc4": "Better is Be2 this move allows black to gain a sight advantage after the move e6, threating d5. ",
        "5... e6 6. Nc3": "Stops d5 for the moment and develops a piece.",
        "6... Nf6": "White now has an issue where is the light square bishop to go? Bb5 a6 Bxc6 only makes blacks center stronger.  Bd3 is silly and can be laughed at. As white really needs to play d4 soon.  d4 d5! exd5 exd5 Bd3?! (Be2 is now forced and black still has gained a lot of space) cxd4 looks good for black.  Be2 only serves to block the soon opening e-file. Wouldn't it be great if the Bishop could come to f1 and the Rook be on the open e-file after d4?  What is this you say it can lets see.",
        "7. O-O d5 8. exd5 exd5 9. Re1+": "opening up f1 for the bishop.",
        "9... Be7 10. Bf1 O-O": "d4 was a decent way to attempt to challenge this plan.  But black lets me off easy this time. d4 Ne4 Nxe4 Rxe4 Bf5 giving black has nice space gain.",
        "11. d4": "cutting d4 out of the equation for black and moving into a possible isolated pawn structure.",
        "11... Be6": "Too passive g4 would bee a good plan for the bishop.",
        "12. Ne2": "Planing on putting the knight on d4.",
        "12... Nh7": "I don't like this move at all. better would seem to be Ne4.",
        "13. dxc5 Bxc5 14. Ned4": "White completes the plan of taking control of the d4 square.  Whites threat is the simple Nxe6 fxe5 Rxe6.",
        "14... Nxd4": "Trading down?",
        "15. Nxd4 Qd7": "Better is Qd6",
        "16. Bb5 Qd6 17. Qe2": "Renewing the threat of Nxe6.",
        "17... a6 18. Bd3 Qf4": "Black would seem to be trading down queens here?  Via Qe3 or Qe5.  However white can finally win his pawn and gain an attack.  Though this also allows black to become dangerous.  I choose chaos.",
        "19. Nxe6": "!?",
        "19... fxe6 20. Qxe6+": "black can trade down now with Qf7 but it will leave black down a pawn and with an isolated pawn.  Kh8 is out because of the game ending Qg6 and there is no way to defend mate on g7 and h7.",
        "20... Rf7": "Seems to be the only move. White has slowed down blacks attack but now what Rf1 doesn't seem to defend the f2 pawn...  Bg6 would be a an option.  Though trading my active bishop for a passive rook on a8 doesn't seem to be that good to me.  Besides it can stay in the cards.  Qg6 is also an option threating Qxh7+ Kf8 Qh8 mate but black simply plays Ng5 and brings another piece into the game for attack and defense.",
        "21. Re2": "Expecting Bxf2+ making black expend a tempo to take the pawn.",
        "21... Bxf2+": "Better plans being Rd8 or Raf8.",
        "22. Kh1 Ng5": "I now take the Isolated pawn for free :)",
        "23. Qxd5 Be3": "? loses the bishop.",
        "24. Be5": "Queen must move to b4 g4 or h4.",
        "24... Qg4 25. Rxe3 Kh8": "unpinning the f7 rook, this will allow black to seek the back rank mate.",
        "26. Rg3": "forcing the queen to h5 and pinning down the g5 knight.  If Qh4 white has the very odd looking Rxg5! Qxg5 Qxf7 Qxe5 and Rf1 forcing trades now black must deal with the threat of Qg6.",
        "26... Qh5 27. Kg1": "threating the also odd looking h4. With the same tactic in mind but a loss of a pawn is involved.  This move also helps protect from mates and the f1 square.",
        "27... Raf8": "Stops h4 and finishes blacks plan.",
        "28. h3": "ending back rank threats once and for all. ",
        "28... Nh7": "Blacks final error.",
        "29. Bxg7+": "The queen and pawn is now traded for bishop and rook but white also gets a decent position after. Rxg7 Qxg7 Rxg3 Qe5+ Rg7 Rf1 allowing for more trading into a great endgame."
    },
    "url": "https://gameknot.com/annotation.pl/double-edge-sword?gm=36647",
    "gameName": "Double edge sword.",
    "players": "yoshark (1476) vs. sifonio (1452)",
    "opening": "Sicilian defence (B27)"
}