{
    "moves": {
        "1. d4 Nf6 2. Bf4": "My usual. ",
        "2... e6 3. Nf3 c5": "One of the strongest response. Black shouldn't lose the chance to move this pawn. He CAN, actually, go on with Nf6, but he has to handle developement very well to equalize, and often castle queenside. All this is avoided with the text move. ",
        "4. c3": "I have to be very careful. Black opened the way for his queen to go b6, threatening b2. Since I plan to castle queenside and attack black's kinside (it's my principal plan when playing white), I dont' want to play b3. Now, if black takes, I'll take back with the knight, since I don't want to move my c3 pawn at all, or a strong attack will come over me starting with Bb4+. I'll take with the knight, and if Nc6 or d6 is played... well, I'll see, I can afford this. ",
        "4... b6": "Black goes for another good move, developing the lsb on the big diagonal. I have to be very careful managing this. Accurate player can, I couldn't. Now, I lost a good way to play my game by dxc5, Bxc5, Bd6!, but hey, Ne4 throws away my hopes. ",
        "5. Nbd2": "I know I won't be able to play e4, but nevertheless, I have to develop... and quickly. This knight can reach d6 through c4...",
        "5... Bb7 6. e3": "My lsb must be free to check on b5 if black moves the d pawn. By exchanging pieces, I can improve my position. Anything but allowing black to cover d6 or to castle. ",
        "6... Be7 7. dxc5": "Now or never. ",
        "7... Bxc5 8. Nc4": "If black castles now, he gets into troubles when one of my pieces, B or N, go into d6, joined with b4. ",
        "8... d5": "RIGHT! As a good player will do. This counters my threat on d6. And Ne5 is a non-threatening move that goes for a quiet game, where I am squeezed in and undeveloped. This is the moment that Caissa have to bless me.",
        "9. b4": "I'll exchange pieces, queens and pawns, and my position will be decent. He will go for something more, I'm sure...",
        "9... Be7": "Right! And this leaves my queen's exchange meaningless, but...",
        "10. Qa4+": "Naive? Not at all: I'll defend my knight by pinning black's d pawn. ",
        "10... Bc6": "Not the best, but on Qd7, we had a boring game, and the N move would have conceded a lot after Ne5 - Rd1 etc. ",
        "11. b5": "Again, the crossed exchange favours me grately, due to c7+, so black has to decline. ",
        "11... Bb7": "He sopped my queen, but he is not more developed than before, and I still have...",
        "12. Rd1": "The BQ can move to c8, but in that case, I can play Nd6, forcing BxN, BxB, and black cannot castle, while I dominate the black squares. But this nice pin has a downside...",
        "12... O-O": "Yep, black can castle. Now, I have to find a way to exploit my outpost on b5, controlling c6, a key square for his developement. I want my TWO knights \"looking\" at c6... how to achieve it?",
        "13. Nce5": "Of course, black can't even think about d4. This is ok for now, but the opening of the white diagonal on g2 is a factor that I should have cared for. ",
        "13... Qc8": "As predicted, threatening c3, and avoiding my Nc6. I can defend it by Rc1, but hey, this rook will be undefended, giving some strange ideas to black... and my queen can't go to d4, or Bc5...",
        "14. c4": "Take this! Ok, I'm allowing black's lsb to grab the diagonal, but it will lead me to be able to close it with a knight... very tense and interesting situation, IMO...",
        "14... Nbd7": "Black, unbelievably, leaves c6... let's see: Nc6, BxN, bxB, Nc4... is it possible Qb5? Maybe all my \"advantage\" is just a fuzz...",
        "15. Nd4": "This will \"force\" him to exchange NxN, BxN, then he has Ne4, threatening a royal fork, or Ng4, threatening my bishop and winning some tempo chasing it. Acceptable loss. ",
        "15... Nc5": "My attack vanishes, but let's see if I can do something on the kingside, that was my original target!",
        "16. Qc2 dxc4": "Hard decision, so many lines and threats... but the only one I was reasonably sure about, was black's response after...",
        "17. Bxc4": "I know, g2 will fall. But chess is to fight, and I have anything to fight for on the queenside. Of course, I was wrong. And, you see, I CAN'T leave that pawn there, because it supports Nd3+. I will win a pawn, but black would have had a great power on me, and I will have lost all the initiative. ",
        "17... Bxg2": "Thank you...",
        "18. Rg1": "Now, I threat Bh6. He can play Be4, of course, but Qe2 and I can still have some hope. ",
        "18... Be4 19. Qc1": "? I went this way, instead, just hoping in a queen's exchange. I was worried I could have lost control of d3. But in doing so, I betrayed my foreseen scope, to attack the kingside. I later will see this as the losing move. ",
        "19... Nh5": "It's just ok.",
        "20. Bh6": "Now, if Kh8, Bg5. If f6, forking my pieces, I don't have enough firepower to attack on e6 because of the Nc5. So...",
        "20... Bf6": "!? Well, maybe Kh8 was better. This covers a lot of possible threats, and now e7, instead of a target, is a defended square for my...",
        "21. Nec6": "Well, at least I managed to get c6, even if, in sight of the situation, I wonder if it was whorty, but look: it controls d8 (ok), and threats a royal fork, if ever the black bishop is forced away. I coulod have moved the other knight, too, since after BxN, Be7+. I didn't see it at the moment. ",
        "21... Qc7": "With a threat on h2 I underestimated. I could have played Ke2, and if Qh2, Rh1, starting a fierce counterattack. So my next may be the losing move. ",
        "22. Be2": "Thinking in \"emergency exchanges\", I only spotted this. ",
        "22... Qxh2 23. Rf1": "After BxN, Bf5 will make me stay in the game. Black had returned my same money, and made of an attack a vulnerability, by not wasting a tempo in playing Kh8. Very, very clever. ",
        "23... Bg2": "I knew this, but I will win a knight ",
        "24. Bxh5": "If  BxR, Bf4, QxB, KxB, and maybe - just maybe - I can resist some more time. ",
        "24... Qxh5": "This is more interesting. ",
        "25. Rg1": "He will take the other bishop, and voilá. Just -2. But I was too tired, I overlooked...",
        "25... Qxh6 26. Rxg2 Qh1+ 27. Ke2 Qxg2": "Look at my poor queen. Qc1 was probably the losing move of the game, and with a strong opponent, one or two slips are enough. I just tired...",
        "28. Rg1 Qe4 29. Qc4 Qd5": "I spotted Rxg7, BxR, and Ne7, royal fork, but KxR will save him, and I have no force to win.",
        "30. Qc2": "h7 is still a target...",
        "30... Qh5+": "...quickly covered by black. ",
        "31. Ke1 e5": "NO more tricks, now...",
        "32. Ne2": "After e4, with the treat of Ne3+, white is busted. Ng3, thinking in Rh1, is futile against e4, that can be reinforced with one rook. After a6, black destroys my knight support, so I didn't see any hope. But while thinking about all this, I timeoutted the game. "
    },
    "url": "https://gameknot.com/annotation.pl/double-downside?gm=55999",
    "gameName": "Double downside",
    "players": "damalfi  vs. fotisbatzas1 ",
    "opening": "Queen's pawn game (A45)"
}