{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Bc4 Nf6": "The Italian Game is one of the oldest recorded chess openings.",
        "4. d3 Bc5 5. a3 d6 6. h3 O-O": "I'm not sure why white is pushing his rook pawns. 6. ... Bg5 might have been fun, but the knight is well protected. He could simply play 7. c3 to banish my knight from d4, then play h3 to drive off my bishop. Adn the previous 5. a3 eludes me.",
        "7. O-O Be6 8. Bxe6 fxe6": "This seemed like a good idea at the time. It doubles my pawns on the e-file, but it opens my rook on the f-file. Later it proves to be my undoing.",
        "9. c3 d5": "I thought this might un-double my e pawns, if white should play 10. Pxd5. Not that he had to do it, but I was hoping he might.",
        "10. b4 Bd6": "Afraid that if 10. ... Be7 or 10. ... Bb6 then 11. b5 drives off my knight and allows 12. Nxe5.",
        "11. Bb2 dxe4 12. dxe4 Nxe4": "I thought I might be winning a pawn here. My doubled and isolated pawns on the e-file are so weak it's pathetic. ",
        "13. Qe2 Ng5 14. Nbd2 Rf5": "My plan was to play Qf6 and Ra-f1 to put lots of pressure down the f-file.",
        "15. c4 b6 16. b5 Nxf3+": "I really just want to exchange everything and try to end up maintaining my pawn majority. Probably a forlorn hope.",
        "17. Nxf3 Ne7": "Not 17. Nd4 which loses both e-file pawns.",
        "18. Nxe5 Qe8": "Thinking that Qh5 puts a third piece on the knight at e5 and lets me trade queens.",
        "19. Nf3 Ng6": "To defend the sad, lonely little e pawn.",
        "20. Rfe1 e5 21. g4 Nf4": "Forking the queen and the pawn on h3, even though I knew I wouldn't win that pawn at the cost of my rook, I was hoping to get some kind of counterattack going, even if it had to lose steam while I save my rook.",
        "22. Qe4 Rf7": "And I pick the worst possible move for the rook. I truly didn't see the fork coming. I only blame the fact that I was moving quickly, practically speed chess, while I was playing a video game at the same time - not a wise decision if I wanted to keep my winning streak alive... My opponent, however, was paying perfect attention to this game and showed me no mercy at all.",
        "23. Ng5 Rf6": "Rf1 offered mate in 1. I really should have played g3 and let white win the exchange, but ultimately, that would have probably been fatal too after he saved his h3 pawn and finished his assault on e5, I most likely would have been down a pawn and the exchange. But at least there might have been hope for a comeback, or at least finding a way to draw.",
        "24. Qxh7+ Kf8 25. Qh8+ Ke7": "And now I lose the pawn at g7 and then my rook at f6. Definitely not my finest hour. After 26. Qxg7  Rf7, 27. Nxf7 Qxf7 white still has a good attack on the pawn on e5 and now he has a decisive material advantage and a pair of supported passed pawns on the g & h files.",
        "26. Qxg7+": ""
    },
    "url": "https://gameknot.com/annotation.pl/down-in-flames?gm=20935",
    "gameName": "Down in Flames",
    "players": "mrmarmalade (1430) vs. blake84120 (1442)",
    "opening": "Two knights defence (Modern bishop's opening) (C55)"
}