{
    "moves": {
        "1. d4": "The above title of this annotation gives an achievement which, by my standards, is pretty good! It's a shame our profiles doesn't give a \"highest rating drawn against\" info. Anyway, I think there are some pretty good reasons for my opponent offering a draw: a) The game was going nowhere, b) my opponent's 154-game winning streak had just ended, so that didn't matter any more and c) in this 2-a-side team match, our opposition had already won 3 out of 4 games! From my perspective, why did I eventually agree a draw? Well, it gave my rating a +7.7 bounce without me having to exert myself to win...and, to be honest, I didn't fancy my winning chances against a player whose rating was 400 points higher than mine! (*For the record, when the team match started, we had roughly the same ratings, so we got paired to play against each other). And so, back to the game itself...I start with my usual Queen Pawn.",
        "1... Nf6": "Black plays a generic, flexible defence, known as the Indian Defence, which may branch out into any of many defences, including King's Indian Defence, Benoni, Gruenfeld, Nimzo-Indian Defence, and many others. The main advantage for Black here is that he can more or less completely choose which opening to use.",
        "2. c4 e6 3. Nc3": "White plays the main line to use against most \"Indian\" defences.",
        "3... Bb4": "Black employs the Nimzo-Indian Defence, essentially playing for an open board and attempting to pin my knight to prevent me from occupying the centre with 4.e4.",
        "4. Qc2": "I play the Classical Variation, the most popular choice here for White. White does not want to clog up his pawn structure after 4...Bxc3 5.bxc3, so he prepares to recapture with his queen. The main drawback here is that White must waste a few tempi to recapture with his queen, allowing Black a slight lead in minor piece development.",
        "4... O-O": "Known as the Adorjan Gambit, and by far the most popular option in the GK database. Statistics show a very slight edge for Black.",
        "5. Nf3": "Much more popular is 5.a3, putting the question to Black's irritating, pinning bishop on b4. However, I prefer 5.Nf3, because it develops a piece, which will dilute Black's advantage in development after the inevitable ...Bxc3 .Qxc3 is finally played. Soon, however, White must challenge Black's bishop with .a3.",
        "5... c5": "A very common move in many variations of the Nimzo-Indian: Black challenges White's central pawn superiority with this queenside pawn thrust. It is a gambit move, since .dxc5 Bxc5 loses a tempo and allows White to get rid of the annoying pin: therefore, Black should not immediately regain the pawn. I usually play dxc5, at whichever stage Black plays ...c5, because, firstly, I hope that, if Black is a weak player, he will play ...Bxc5 - obviously not the case here. Secondly, I hope to slow Black down in the hassle he must undertake with his knight to regain the pawn.",
        "6. dxc5 Na6": "The first step of what I called \"hassle\" - OK, maybe not all that cumbersome for Black. But at least I can now step ahead in development.",
        "7. Bd2 Nxc5 8. a3": "I judged that it was time to challenge the bishop. Black's pieces are threatening superiority on my queenside, and are both very well-placed. Time to get rid of one of them. Obviously, 8...Ba5? 9.b4! loses material, so Black has only one move here.",
        "8... Bxc3 9. Bxc3": "Strengthening my bishop's position (only a little bit though) so that it now targets the crucially defensive knight on f6. I was now hoping to play 10.b4, gaining a tempo and a lot of space on the queenside.",
        "9... Nce4": "How downright irritating! That stops all my plans in their tracks! Black is defending the f6-knight with another knight, so exchanging on d6 will give me no advantage, and in fact be very slightly worse for me as I am losing bishop for knight in an open position. And, 10.b4 no longer gains a tempo.",
        "10. e3": "So I proceeded quietly, shoring up my c-pawn and preparing to develop a bishop.",
        "10... Nxc3 11. Qxc3": "Another exchange on c3. I now think this position is slightly better for White, as his pawns have slightly more control over the centre, he can develop his bishop more easily, and he has exchanged off all those Black minor pieces encroaching on his kingside.",
        "11... Qc7 12. Bd3 d6 13. O-O e5": "Grabbing more central space, opening up a line for his bishop, and in short neutralising all the positional advantages I detailed in my last comment. Oh...and, this also threatens the pawn fork ...e4! winning a minor piece for a pawn. Annoyingly, I have to spend another move getting out of this fork, in which he can catch up on development.",
        "14. Qc2": "I think this is White's strongest option: preparing a powerful attacking line down the b1-h7 diagonal, which keeps the f6-knight where it is, and threatening to capture the e4-pawn if it advances...otherwise, it can gain space by advancing anyway, albeit precariously.",
        "14... Re8": "Trying again to play that pawn fork. This time, I just have to concede the space to him and retreat my well-placed bishop <sniff>. Perhaps it would even have been better to retreat 14.Bc2, instead of now putting the bishop on the less active point e2.",
        "15. Be2 d5": "Claiming some central space, and strengthening the e-pawn should it choose to advance to e4.",
        "16. Rac1": "Placing a powerful battery on the c-file. Is Black going to tempt its powers by exchanging pawns on c4?...",
        "16... Be6": "No, he stays his hand and adds another attack line pointing at c4.",
        "17. cxd5": "This opens up a cheap discovered attack on the queen on c7. I though he might possibly fall for it...foolish on my part really...well, at least it reduces Black's central pawn superiority.",
        "17... Qxc2 18. Rxc2": "The exchange weakens my nice c-file battery, but, well, at least I retain the open file!",
        "18... Bxd5 19. Rfc1": "Shoring up my advantage on the open file.",
        "19... Bc6": "Can you see where the game is going? Answer: nowhere. Each player is simply and effectively defusing the other player's minor threats and advantages, but neither has actually made any attempts to gain a decisive advantage. In fact, if you look over the entire game, it has been JUST a sequence of threats being nullified, advantages neutralised. Do you all agree.",
        "20. h3 Rad8": "He offered a draw. I accepted."
    },
    "url": "https://gameknot.com/annotation.pl/draw-vs-1800?gm=23312",
    "gameName": "Draw vs 1800+",
    "players": "fatcat2 (1430) vs. carrick7 (1797)",
    "opening": "Nimzo-Indian (E32), classical, Adorjan gambit"
}