{
    "moves": {
        "1. e4 e5 2. f4 exf4 3. Nf3 g5": "I have seen all of this before",
        "4. h4": "new for me! I had a certain something that I was heading for which I just had to try out. Normally I would play Bc4 or d4. ",
        "4... g4 5. Ng5": "?? Allgaier gambit, white gives up massive material for immediate attack. Lets hope it works but I seriously doubt it. ",
        "5... h6 6. Nxf7 Kxf7 7. Bc4+": "Now I have to run through the gallows if I am going to survive. ",
        "7... d5": "now someone else in our club forums tried playing Nf6 here but this is much stronger.",
        "8. Bxd5+ Ke8 9. d4": "This is where I started to really pour into the position. Then I started to cry( I am serious I started to cry and yes like a little school..) because after 9... f3 10. gxf3 Nf6 11. Nc3 Nxd5 12. Nxd5 c6 13. Nf4 Rg8 is super bad looking. ",
        "9... Bd6": "I was expecting 9. ...f3 but this I might work some magic on. It does give me a sliver of time to develop another piece and consolidate my center",
        "10. Nc3": "For a brief moment I thought I just might be ok. But then...",
        "10... c6": "When I saw this move I could believe my eyes. I rubbed them once, I rubbed them twice and yelled, \"hello Christmas morning!\" As you can tell from the glee in my spoken word this is a game altering blunder by black. Instead, of charcoal which I get from 10... Ne7!! 11. Qd3 (11. e5?? Bb4 12. Be4 Rf8 13.\na3 Bxc3+ -/+) 11... Rf8 12. Bb3 c5 13. Ba4+ Bd7 14.Nb5 Bc7 15. O-O a6 16. Nxc7+ Qxc7 17. Bb3 b5 18. Bd5 Bc6 19. Be6 Bd7 20. Bd5 Nbc6 is black all the way man",
        "11. Bb3 Ne7": "Hum interesting, a little late chump the guy on d5 has gone home. ",
        "12. O-O": "Now I may have tried to push my luck with 12. e5!? but nah Santa already come I said. ",
        "12... f3 13. gxf3 g3": "now there is a forced draw here which I would have taken(yes I know whimps never draw *points up to the title of the game*). Can you find it?",
        "14. f4 h5": "?? Now I get have my Christmas cake and eat it too. Instead of me telling you why this is a bad move let me show you....",
        "15. f5": "!! There it is a past pawn and all her glory. With the all of the queen's men sitting at home watching the game and the all of king's rook on full time guard duty for h5, even the blinded queen(knight on e7) could not  see what was about befall her beloved man. It is so much like the humpty dumpty tragedy ",
        "15... Qb6": "Now this turns out to be a good move because it forces me to keep a piece back to guard d4. Which really cramps my swagger in a few moves. ",
        "16. f6": "The d-pawn is adequately defended so I take what is given and squeeze down harder. ",
        "16... Bg4 17. Qd3 Ng6 18. Be3": "Now this is sinister. Do you know why?",
        "18... Nxh4 19. e5": "excuse me! pardon me! coming through! ",
        "19... Bb4 20. e6": "now I am starting to think mate but...",
        "20... Na6": "I don't what this knight was doing but ok. ",
        "21. Bg5": "I am still thinking mate but...",
        "21... Nf5 22. Rxf5": "no this is not it, even though it is nice eh?",
        "22... Bxf5": "This is when I finally see that I cant deliver the death blow because my silly king is sitting on g1 the same color of square as the black queen. Do you remember back on move 15 where black played Qb6. This is what that was all about. I can not play 23. Qxf5 because 23. ...Qxd4 loses. and 23. f7+ does not mate. So I have to get rid of that queen.  ",
        "23. f7+ Kf8 24. Qe3": "My plan is 25. Bh6+ Rxh6 26. Qxh6+ and eventually get back to e5 where I will force the exchange of queens to simplify to a easy won endgame",
        "24... Qa5": "my opponent could have prolonged the torture with 24. ...Bxe6, but what sicko would want to do that!",
        "25. Bh6+ Ke7 26. Qg5+": "it is mate in 4"
    },
    "url": "https://gameknot.com/annotation.pl/draws-are-for-wimps?gm=47996",
    "gameName": "Draws Are for Wimps",
    "players": "elyhim (2337) vs. myevilluck (2020)",
    "opening": "KGA (C39), Allgaier, Urusov attack"
}