{
    "moves": {
        "1. e4": "If you read this annotation, please give it a mark.  \n\nThis is one of those tournament games where I felt that I had to win as Black.  I'd won the equivalent game as White in a Sicilian with 3.Bb5 and was looking for a double but thought that grisha might play the same line back against me.  Alekhine time. ",
        "1... Nf6 2. Nc3": "Always a frustration.  What to play?  2. ... e5?  If you want to play 1. ... e5, play it.  2. ... d6?  Play it at move 1.",
        "2... d5": "The only move to give something original, particularly if White plays 3. e5.",
        "3. exd5": "If White's going to play like this, what can you do?",
        "3... Nxd5 4. Nxd5": "And again.  As tense as a Mr Whippy ice cream.",
        "4... Qxd5 5. Qf3": "Oh come on!  What next?  A draw offer?  I think that OTB I'd probably punt for 5. ... c6 because if White exchanges the pawn structure is like an exchange Caro-Kann and I can develop the Bc8 before playing ... e6.  Instead, however, I made the fatal error of looking at the database and went for ",
        "5... Qc5": "Apparently White often plays 6. Qc3 here in a desperate pursuit of a draw. ",
        "6. c3": "White plays the other obvious continuation. ",
        "6... e5": "I'm never quite sure about playing ... e5 as Black.  I've never played it at move 1 and a lot of my systems are based on either a fianchetto or ... e6.  It always looks a bit loose somehow.  ",
        "7. d3 Nc6 8. Ne2 Be6 9. Ng3": "I must confess that I didn't see White's 11th, and 0-0-0 would be my choice second time around.",
        "9... f6": "?  I think that this was me playing for a win, expecting 10. Be2 0-0-0 11. 0-0 and opposite wing attacks.  I simply didn't see the plan.",
        "10. Ne4 Qa5": "With a nominal threat of 11. ... Nd4 or 0-0-0",
        "11. Nxf6+": "I'll give this an ! because it came out of the blue and wins a pawn for nothing.  So much for my plan of 0-0-0.",
        "11... Kd8": "Forced - 11. ... gxf6 12. Qxf6 wins instantly and this way I can at least get my bishop out.",
        "12. Ne4": "White is a pawn up with a big knight out on e4 and my development's messed up.  Obviously White's opening was a cunning plan.",
        "12... Nd4": "This at least was my plan at move 10.",
        "13. Qd1": "White is forced to undevelop his pieces.  Is there some compensation here for Black?",
        "13... Nf5": "The knight can't really stay where it is because 14. Bd2 will force the issue anyway.  Black's plan has to be to play c6, Kc7, perhaps Be7 and attack on the g- and h-files.  Can't dislodge that knight though, so maybe Nd6 will do the trick.",
        "14. Bd2 c6 15. Be2": "White continues his development.  Even a pawn up he seems to be adopting the most passive possible piece positioning. ",
        "15... h6": "Designed partly to stop Ng5 or Bg5 and partly to threaten g5 and thus to dissuade him from 0-0, the natural continuation from his previous play. ",
        "16. c4": "?! The d4-square is given away, the Queen obliged to move to a more useful square and the d3 pawn rendered permanently weak.  Is ?! too generous?  Should it simply be ?  ?",
        "16... Qb6": "If I can take the d4 square with a knight or even bishop, I can get some compensation for my pawn.  ",
        "17. Bc3": "White's obvious follow up, defending b2 and d4, whilst putting pressure on e5. ",
        "17... Nd4": "Obvious really, although I considered 17. ... Bb4 18. 0-0 Bxc3 19. bxc3 where the b-file might be useful for White.",
        "18. Bxd4": "I don't get this move.  White continues to exchange pieces but the white-squared bishop can only come into its own on the h1-a8 diagonal if Black plays exd4 with a reversed Modern Benoni, a pawn down.",
        "18... Qxd4": "Big Queen.  Suddenly Black has some compensation for the pawn.  White has done nothing to develop his position in the last 10 moves.  Now I'm not saying that Black has, but White's pawn structure is weakened and I can have a go at f2 from here.  Indeed, the remainder of the game consists of Black trying to get at f2, albeit that the Ne4 is a resolute defender. ",
        "19. b3": "?  Too passive.  White should be playing Qc2 and trying to 0-0.  Indeed, 19. 0-0 Qxb2 20. Rb1 Qxa2 21. Rxb7, giving back the pawn to open up the Black king, is sufficiently worrying that I'd probably have played 19. ... Be7 with a view to playing Kc7, Raf8 and g5.",
        "19... Bb4+": "20. Nd2 Bxd2 forces 21. Kxd2 when Qxf2 leaves Black perhaps a little more active with play against the d3 pawn.  White's advantage is fast disappearing.",
        "20. Kf1": "I always thought that castling was over-rated.",
        "20... Rf8": "X f2, again.  Can I bring enough pieces to bear?",
        "21. Bf3": "This is reasonably obvious, although Black can always look to dislodge it with g7-g5-g4.  White can play h3 but d3 is weak and Black has ample compensation for the pawn. ",
        "21... Kc7 22. Ke2": "Black castles by hand, whilst White's two king moves place the monarch in the midst of the assault.",
        "22... Rad8": "Put your rooks on open (or semi-open) files.  If Black had ... f5 available to him, his position is crushing.  Shame I blundered that pawn.",
        "23. Qc2": "White wants to develop his rooks, defend d3 and play on the Q-side with a3, b4, b5 etc.  Black has a bishop pair and an attack on f2, but that pesky horse holds firm.",
        "23... Bc5 24. Nxc5": "I didn't think that White could resist, although Rf1 or Rhd1 is probably stronger.  ",
        "24... Qxc5 25. Rhf1": "White misses his change to get the king to safety.  25. Rhd1 g5 26. h3 and White can try to play Kf1, Rd2, Rad1 and aim for d4, although it all looks a bit slow.",
        "25... Rd4": "Threatening to double rooks on either the f-file or d-file, depending on how the mood takes me.",
        "26. h3 Rdf4": "Still heading for f2, Black now threatens 27. ... Bxh3 because 28. gxh3 Rxh3 wins.  Helpfully, Black's king is already on a dark square, away from the White bishop.",
        "27. Rfh1": "Away from the defence of f2, but what else can White do.  His position is as trussed up as a Christmas turkey.",
        "27... Bf7": "A quiet, but devastating move.  Black simply relocates his bishop to h5 to force the issue on f3 and then f2.  29. Bxh5 Rxf2+ is the first plan, whilst Bf7-h5xf3 will cause devastation in the White ranks, and that's only Plan B, with Plan A involving Bf7-g6 and e5-e4 to open up the White King like a torpedo.",
        "28. Qc3": "A misconceived plan to start action on the Q-side brings the White position to a swift end.  The fight for d4 is too little, too late, and in any event, it's that f-pawn upon which I wish to wreak havoc.",
        "28... Bg6": "28. ... Bh5 29. b4 is interesting, because 29. ... Qd6 30. Bxh5 is cheeky.  29. ... Bxf3 30. gxf3 Qd6 is better, but White can play Rhg1 or Rag1 to try to generate g-file counterplay.",
        "29. b4": "White can't resist advancing his pawns with tempo, but the Black queen is simply being forced to the square she's fancied for some time.",
        "29... Qd6 30. c5 Qf6": "It's taken 22 moves, but I've tripled on the f-file, the Ne4 has gone and White is lost.  Any bishop move allows Rxf2+ winning, but the alternative ...",
        "31. Rac1": "runs into ",
        "31... Rxf3": "32. gxf3 Qxf3+mates after either 33. Kd2 Qxf2+ 34. Kd1 Bh5 or, well you can find them.  White did, and resigned."
    },
    "url": "https://gameknot.com/annotation.pl/duops-mini-tournament?gm=27736",
    "gameName": "duop's mini-tournament",
    "players": "grisha (1714) vs. dsb13 (1872)",
    "opening": "Alekhine's defence (B02), Scandinavian variation"
}