{
    "moves": {
        "1. Na3": "We are back with my games! 1. Nb1-a3 (A00 Durkin's Attack) follows a very good position",
        "1... Nf6 2. Nc4 g6 3. d4 Bg7": "Black tries to fianchetto. Fortunately, I use my defending skills to defend.",
        "4. c3 O-O": "I don't know why he castled king side (although I do sometimes)",
        "5. Qc2": "A very good queen position.",
        "5... Na6": "Tries to do a symmetrical Durkin's attack. Lukily by c and d pawns are defending both c5 and b4.",
        "6. Bg5 Nh5": "I would not take the knight because bishops are worth slightly more than knights (but still a very good move because pawns are worth less than knights.",
        "7. O-O-O": "Queen-side castling is much better because King-side castling would be stuck in the corner and would get checkmated easily.",
        "7... c6 8. Rd3 b6 9. g3": "It is going to be a very easy fianchetto.",
        "9... Qc7": "Oh, so that's what you want, hm?",
        "10. Bg2 d6": "I think he moved it there so it would be impossible to capture the queen\nthe next few moves",
        "11. d5": "11. d5! A very graceful sacrifice!",
        "11... cxd5 12. Bxd5": "I can't take with the rook or else it would lead into a boring position.",
        "12... Rb8 13. Rf3 Qc6": "13. Rd3-f3, Qc7-c6? A very silly move. He just leaves the queen in a place where I could take it.",
        "14. Bxc6 e5": "He's going to advance the bishop to h3 (probably).",
        "15. g4": "I just threat his knight, which is an okay move but he could just take my pawn.",
        "15... Re8": "At least i thought.",
        "16. gxh5": "Instead of taking the rook, I allowed checkmate in a few moves.",
        "16... gxh5 17. Be4": "Lining up the bishop with my queen, hey, whadda ya know, a double threat",
        "17... d5": "Sadly, he just threatens it.",
        "18. Bxh7+": "Check!",
        "18... Kf8 19. Nd6": "I played this because to threat AND checkmate in 1 yes I mean ONE move",
        "19... Rd8": "I thought about the position for a moment and then I saw...",
        "20. Rxf7#": "CHECKMATE! RF3XF7#!!! I won again! Hoped you enjoyed."
    },
    "url": "https://gameknot.com/annotation.pl/durkins-attack?gm=31646",
    "gameName": "Durkin's Attack!",
    "players": "good836dog  vs. NN ",
    "opening": "Durkin's attack (A00)"
}