{
    "moves": {
        "1. d4 f5 2. c4 Nf6 3. Nf3 g6 4. e3 Bg7 5. Bd3 O-O 6. O-O": "We started off with a dutch defense opening.",
        "6... d6 7. h3 Nc6 8. Nc3 e5": "Not all of my pieces are developed yet, so perhaps this was a little preemptive.  However, it gets the game going and allows for excellent position.",
        "9. dxe5 dxe5 10. e4 Nd4": "I'm looking to post my knight on f5.  If 11 Nxd4 exd4, white would probably move 12. Ne2 or 12. Nd5.  If 12. Nd5, I would follow with 12 . . . Nxd4 13. Bxe4 fxe4.  Now white must move his Knight on f3.  If 14. Nd2, I would move 14 . . . Re1 with the idea of e3.  White's knight on d5 seems to not make much sense anymore.  With a simple pawn move up to c6, White will retreat.  White's best move would have been 12. Ne2, however; black still has excellent position at this point.  ",
        "11. Bg5": "It may have been good for white if he had made an in between move of 11 Re1, although 11. Bg5 is useful later on to white, and it is a good position for white to have.",
        "11... Re8 12. exf5 Bxf5 13. Bxf5 Nxf5": "This is one reason why I moved my knight to d4.  I didn't want to have to retake with my pawn on g6.",
        "14. Qxd8 Raxd8 15. Nd5": "This is an excellent move by white.  I can't capture white's knight with my knight due to the pin.  After 15 . . . Nxd5 16. Bxd8 Rxd8 17. cxd5 Rxd5.  If I decide to protect my f6 knight due to the double threat, white wins a pawn with 14. Nxc7.  Since I am going to be down one point, I need to make the best of my situation.  Generally speaking, when you are down a point, more pieces are better.  In addition, I have lost several games because of one pawn.  Being down 1 point due to a rook traded with a knight and a pawn can sometimes be better.",
        "15... Rxd5": "I trade my rook for white's pawn and knight.  ",
        "16. cxd5 Nxd5 17. Rab1 h6": "Even though I am down 1 point, I have good position.  From here, it may be best for white's bishop to retreat to d2, or to h4 - which would leave 18. Bh4 g5 19. Bg3 e4",
        "18. Bd2 g5": "White chose Bd2, and I chose to free up my black bishop; although my Nf5 looks exposed.  I could have moved my king to h7, but thought this would give me better position.  I plan on moving my Nf5 anyway.",
        "19. g4 Nd6 20. Rfd1 c6": "I want to move my Nd5 to f4, but now is not the right time.",
        "21. Be3 b6 22. Kg2 Nc4": "I want to capture white's bishop, and I also want to advance my queenside pawns.",
        "23. Rde1 a6 24. b3 Ncxe3+": "After b3, I will capture Be3 as planned.  From my point of view, b3 is a wasted move.  For although it does force my Knight to move, I was going to attack anyway.  And at a later time, white could have moved b4.  However, white does not know I want to capture his bishop.  Usually when you are down points, you don't want to trade.",
        "25. fxe3 e4": "I am hoping for 26. Nd4 so I can trade my bishop for his knight and place my knight on the key f4 square.",
        "26. Nd4 Bxd4 27. exd4 Nf4+ 28. Kg3": "Luckily, the trade occurs and I move my knight to it's destination.",
        "28... Kg7": "From here, it may have been a good idea to advance my pawn, but I am hoping for a trap.  29. Re3 Nf4 30. Re2 Nc3 and I have forked white's rooks.  ",
        "29. Re3 Nd5 30. Ree1": "White sees the trap and retreats.",
        "30... Nf4 31. Rbd1 e3": "I will now advance my pawn to e3, but I am wary about the exchange of pawns on c6 and d5.  I absolutely do not want white's rooks in my territory.  That would be devestating.  Instead, I intend on keeping white's focus on my e-pawn.",
        "32. Kf3 e2 33. Rd2 a5": "This is an in between move that will save me a lot of headache.",
        "34. Rc2 Re6": "I must move my rook to this position.  Anything else could spell out disaster.  ",
        "35. h4": "This move does not bother me, and it allows my king to begin the long trek to white's queenside.  This will allow more maneuverability by my rook",
        "35... Kf7 36. Rc3 Ke7 37. Re3": "I was hoping white would make this move and pin my rook.  I will end up forking white's rook and king.",
        "37... Rxe3+ 38. Kxe3 Ng2+": "From this position, I can almost smell victory.  I have plenty of pawns for support, and will be up 1 pawn after the exchange.",
        "39. Kxe2 Nxe1 40. Kxe1 gxh4": "I can reach my pawn in time.  From here, I need to focus on my endgame strategy.",
        "41. Kf2 Kf6 42. Kg2 Kg5 43. Kh3 h5": "I am ok with the exchange.  Less is more here.",
        "44. gxh5 Kxh5": "If I only had my h pawn, and no other pawns were on the board, this would be a stalemate.  However, the extra pawns give me the advantage I need.",
        "45. a4 Kg5 46. Kh2 Kg4 47. Kg2 h3+ 48. Kh2 Kh4 49. Kh1 Kg3 50. Kg1 Kf3": "White's queen now has to chase my h pawn.  This gives me enough tempo to capture white's pawns and promote a queen.",
        "51. Kh2 Ke3 52. Kxh3 Kxd4 53. Kg3 Kc3 54. Kf3 Kxb3 55. Ke3 c5 56. Kd3 c4+ 57. Kd2 Kb2 58. Ke3 c3 59. Kd3 c2": "From this position, white respectfully resigns.  "
    },
    "url": "https://gameknot.com/annotation.pl/dutch-defence-leningrad?gm=28443",
    "gameName": "Dutch defence, Leningrad",
    "players": "kb77 (1652) vs. nefariousknight7 (1541)",
    "opening": "Dutch defence (A84)"
}