{
    "moves": {
        "1. e4": "This is a wild game because white plays very sloppy in the beginning. However, White wins in a pretty queen sacrifice. ",
        "1... Nf6 2. Nc3 e5 3. f4": "this is known as the vennia openning which is not very good for white. I choose to play it here because I wanted to do something different. In the past, I used to play this openning in tournaments and had good results against weaker opponents.",
        "3... d5": "A great move that creates a vey dynamic centre.",
        "4. exd5 Nxd5 5. fxe5": "a bad move that does not deal with black's major of ...Qh4. I needed to play Nf3 ",
        "5... Qh4+ 6. g3 Nxc3": "ouch man I really needed the knight",
        "7. bxc3": "as a general rule it is always better to capture toward the centre",
        "7... Qe4+": "good bye rook",
        "8. Kf2": "the most stubborn defence",
        "8... Qxh1 9. Nf3 Nc6 10. d4": "defending e5 and freeing the dark bishop",
        "10... Bg4 11. Qe2 Bxf3 12. Qxf3 Qxh2+": "This is where black goes off the tracks. Black should continue to trade peices, simplify the game and head into a favorable endgame. Instead he allows white to consolidate and retain an advantage of space which I take full advantage of.   ",
        "13. Bg2": "Now black has run out of checks and his queen is out of position",
        "13... g6": "?? a massive blunder that loses because of white's superior mobilty better is:13. ...Be7 denying white the d8-h4 diagnonal\r\n\r\n",
        "14. Bg5": "!! black's king is now stuck in the centre and white is suddenly winning",
        "14... Qh5": "?? Black is totaly oblivious to what is coming next. ",
        "15. Qxc6+": "Boom. And this bomb goes off in the black camp like a nuck. Black is left scratching his head and wondering what just happened "
    },
    "url": "https://gameknot.com/annotation.pl/e2-e4-nf6?gm=30086",
    "gameName": "e2-e4           Nf6",
    "players": "elyhim (1981) vs. theblackhorsie (1712)",
    "opening": "Alekhine's defence (B02), Scandinavian variation"
}