{
    "moves": {
        "1. e4 e6 2. d4 Qf6": "A rather quiet first move for Black, but this second move is rather curious.  Interesting.",
        "3. Be3 d5": "An attempt to prosecute a delayed attack.",
        "4. e5 Qe7 5. c4": "An attempt to press forward and gain superiority over a more open center.",
        "5... Qb4+ 6. Qd2 Qb6": "Defeats the aggressive alternative 6...dxc4, beaten by 7. a3 Qb6 8.Bxc4.",
        "7. a3 c6 8. b4 g6": "Black has missed White's bridge to be built, attacking the Queen.",
        "9. c5": "White has a strong queenside position, attacking Black and getting a good stonewall position far into Black's side of the board.",
        "9... Qc7 10. f4 Nh6 11. Be2 Qe7 12. g4 Qh4+": "White has made a small mistake and now stands to lose a pawn.",
        "13. Bf2 Qe7": "Black is arguably incompetent and misses a good chance, allowing White to continue on the offensive.",
        "14. g5 Nf5 15. Nc3 Bg7 16. Nf3 O-O": "Black has few good attacks and really ought to shore up his defense, but instead moves his king to a place which is not well defended.",
        "17. Nh4 Na6 18. Nxf5 exf5": "Black's dinking around has allowed White to clear off Black's pesky knight.",
        "19. h4 Bd7 20. h5 gxh5 21. Rxh5": "Now we can see the writing on the wall.  Nonetheless, 21...h6 would force 22.gxh6 Bxh6 23. Rxh6 Kg7 forcing a retreat and allowing for some possible Black action to save a draw.",
        "21... b5": "What in God's name is Black doing, anyway?",
        "22. O-O-O Nc7 23. Rdh1": "Not quite Alekhine's gun, but a strong attack on ",
        "23... Ne6 24. Rh5xh7 f6": "The first good move Black's made.\n",
        "25. gxf6": "Probably the best line for Black is 25...Qe8 16. fxg7 Nxg7 and the game is not totally lost.",
        "25... Qf7": "Instead Black pins his king in.",
        "26. fxg7 Nxg7": "Even there, capturing with the Queen was essential.",
        "27. Rh7h8#": "I think the game speaks for itself."
    },
    "url": "https://gameknot.com/annotation.pl/early-queen-early-checkmate?gm=46023",
    "gameName": "Early queen, early checkmate",
    "players": "johnpbro (1076) vs. nightfurey (971)",
    "opening": "French defence (C00)"
}