{
    "moves": {
        "1. d4": "I've used 1. e4 for the most part in my chess games but I'm starting to appreciate this move as well. I just need to find something good against the Nimzo. But I guess that's why so many players have turned to playing The Catalan or the QID.",
        "1... Nf6 2. c4 g6 3. Nc3 d5": "Since this is a thematic tournament, with The Gruenfeld or the KID as the main defenses to choose from, I was a little more relaxed to playing closed games. Needless to say, I had already chosen what I was going to play against my favorite defense. I'm still experimenting with the KID, but I'm going to settle on something soon. The problem is the exact opposite of the Nimzo, too many good lines to choose from.",
        "4. cxd5 Nxd5 5. e4 Nxc3 6. bxc3 Bg7 7. Nf3 c5 8. Rb1": "The modern tabia of the Gruenfeld. Played almost exclusively by Gelfand and used on the highest levels by the likes of Kramnik, Shirov and Polgar to name just a few.",
        "8... O-O 9. Be2 Nc6": "The most fashionable variation is 9... cxd4 10. cxd4 Qa5+ 11. Bd2 Qxa2 12. O-O. Players like Kasparov, Anand, Leko, Svidler, to name just the Gruenfeld devotees play this way. 9...Nc6 has fallen under a cloud and not without good reason, White has a strong initiative mainly because of the ease with which he creates a passed d-pawn and uses it to paralyze Black's forces, sometimes going for a full K-side attack.\n",
        "10. d5": "No use putting it off. This is the main reason why top GMs regard this line as suspicious. It allows White an early advance in the center with tempo.",
        "10... Ne5": "Trying to snatch the c3 pawn can run into serious trouble, as Gelfand demonstrated in a short game versus Stohl: 10... Bxc3+ 11. Bd2 Bxd2+ 12. Qxd2 Na5 13. h4 Bg4 14. h5 Bxf3 15. gxf3 e5 16. d6 b6 17. hxg6 fxg6 18. Qd5+ Kg7 19. Qxe5+ Qf6 20. Qh2 h5 21. Rd1 Nc6 22. Qg3 Kh6 23. Rd5 Rae8 24. f4 Qa1+ 25. Rd1 Qf6 26. f3 Nd4 27. f5 g5 28. Rxh5+. Of course, Black's blunder of 27...g5?? killed the game on the spot, but White's position was very good regardless. The problem for Black in this line is the lack of counterplay. All he can hope to achieve is some Q-side pawn advance but a good White player won't stand idle and allow it.\n",
        "11. Nxe5 Bxe5 12. Qd2": "This awkward defense of c3 is the best move. White wants the Bc1 to go to a3 or b2 and the Queen on d2 is already eying the dark squares around the Black monarch.",
        "12... e6": "Black wants to open the e-file, or else he'll get pushed off the board. ",
        "13. f4": "A little committal but it's all theory so far. This approach has proved the most dangerous one by far. White asks the Black Bishop where does he go now? The center was much to cozy for comfort and now Black must decide, go back to the K-side and give White a free hand in the center, or switch to the Q-side to pressurize c3 and hope White's attack won't come very soon on his weakened castle. ",
        "13... Bc7": "There is still a fierce debate over which retreat is better. Even the strange 13...Bh8 was tried, but that was soon proved inadequate after 14. c4 Re8 15. e5 f6 16. f5!. After the normal 13...Bg7, which was extensively played in the late '80s, White has been scoring rather well and some lines go as far as move 36. ",
        "14. O-O exd5 15. exd5 Ba5": "The point behind 13...Bc7. The problem is that the King isn't defended anymore and White can start an attack on the dark squares that have been deserted by the wandering Ba5.",
        "16. d6": "This looks hasty but it's rather strong. The pawn serves as a spearhead, cutting the chessboard in two and preventing Black from properly maneuvering pieces from one flank to the other.",
        "16... Rb8": "The ending after 16... b6 17. Bf3 Bf5 18. Bxa8 Bxb1 19. Bc6 Bf5 20. Re1 Qf6 21. Bb2 Rd8 22. Re8+ Rxe8 23. Bxe8 is better for White, but Black should be able to hold it, albeit with much suffering ahead.\n",
        "17. Ba3 Bf5 18. Rbd1 Rc8": "Stronger was 18... Qf6 19. Bxc5 Bxc3 20. Bd4 Bxd4+ 21. Qxd4 Qxd4+ 22. Rxd4 but simplifying material isn't enough to secure a draw in this line. Even low material endgames offer a lot of scope to outplay these kind of positions with White, simply because of the advanced d-pawn.\n",
        "19. g4": "Setting up the K-side pawn storm. Black's forces are too tied down to the blockade of the pawn to create any counter-threats against my King.",
        "19... Bd7 20. Bf3": "Not the best move, more to the point is 20. f5 Qh4 21. Bf3 b5 22. Kh1 and the g-file can be a real killer for the Black King.\n",
        "20... Qf6": "Black could have had a good game after 20... b5 21. Bb2 Qh4 22. Qe1 Qh3 23. Qg3 Qxg3+ 24. hxg3 c4, with the c3 pawn fixed, he has good chances to hold the ending.\n",
        "21. Bb2": "Defending c3. The threat is also c4, offering a disadvantageous Queen swap.",
        "21... Bc6": "The b-pawn wasn't a real target since g4 drops, therefore Black should have activated his Rook with 21... Rce8 22. c4 Qd8 23. Qd3 Qh4 24. f5.\n",
        "22. c4": "Once this Bishop comes into play, it's only a matter of time while either the d-pawn decides the game or an attack ensues on the Black King.",
        "22... Qd8": "After 22...Bxd2 23. Bxf6 Be3+ 24. Kg2 Bd4 25. Be7 Rfd8 26. Bxc6 bxc6 27. Bxd8 Rxd8 28. Rfe1 Rxd6 29. Re7, and the a-pawn will fall soon and with it, the game.",
        "23. Qg2": "Lining up on the long diagonal and on the g-file.",
        "23... Qd7": "The Queen is given the distasteful task to blockade a mere pawn. I'd just like to note something characteristic to the positions in these lines. Since both pairs of Knights have been exchanged, Black has no good pieces to blockade the d-pawn and his position also suffers from claustrophobia. The added space advantage that White has is nothing to sneeze at. Just by comparing the pieces in this position it's easy to figure that White has the upper hand. Black's Ba5 is loitering on the Q-side, when he's dearly needed to safeguard his King, while my Bb2 is perfectly placed on the open long diagonal.  ",
        "24. f5": "Starting the planned assault. There is a cardinal principle in chess, when your pieces are poised for attack, don't wait, start active operations at once. Opportunities are soon lost and time must not be given to the opponent to organize the defense.",
        "24... Bxf3": "Black should have kept the K-side closed with 24... g5 but after 25. Bxc6 Rxc6 26. Qd5 Re8 27. Be5 Bd8 28. h3 Ra6 29. Rd2 Ba5 30. Rd3 Bb4 31. Rf2, his dark square Bishop can't quite get back home and I can slowly turn the screw on Black's blockade.",
        "25. Rxf3": "Better than taking with the Queen, now the Rook can swing over on the third rank.",
        "25... f6": "A more sturdy defense was 25... Qa4 26. Rc1 Qc6  but after 27. Qh3 , Black is forced to play 27...h5 28. gxh5 g5 29. Rd3 f6 30. h6 Qd7 31. Rcd1 Rce8 and now the Queen infiltration decides 32. Qh5! Qf7 33. Qg6+ Qxg6 34. fxg6 Bd8, with the two pawns in phalanx near the Black King, h8 becomes on vital importance 35. Rh3! g4 36. Rh4 Ba5 37. Rf1 Bd2 38. h7+ Kg7 39. h8=Q+ Rxh8 40. Bxf6+ Kxg6 41. Rxh8, winning a full Rook. Notice how helpless the Black Bishop is in these lines.\n",
        "26. fxg6 hxg6 27. g5": "Black is presented with an impossible choice, to open the long diagonal or to curl up behind the pawn and watch helplessly as the Queen and Rooks swing around his King like sharks circling a group of castaways in the middle of an ocean.",
        "27... Rc6": "A nice line that shows the insurmountable task of defending the position goes like this: 27... Qc6 28. Qh3 Bd8 29. d7 Rb8 30. gxf6 Rf7 31. Rg3 Qe4 32. Qh6 and mate is looming in the air.\n",
        "28. gxf6": "Black had enough and resigned here. This game shows the dangers that Black is faced with in this line, where it's very difficult to find counterplay and stop White's dangerous initiative."
    },
    "url": "https://gameknot.com/annotation.pl/edge-of-the-precipice?gm=30518",
    "gameName": "Edge of the precipice",
    "players": "nyctalop (2057) vs. ksasidhar (1733)",
    "opening": "Gruenfeld (D85), modern exchange variation"
}