{
    "moves": {
        "1. Nf3 Nf6": "Yet another Ladder game. You might recognize my opponent, he annotates here frequently and is also a frequent contributor to the annotations of others. He begins with the Zukertort and black replies in kind, following the examples of Kasparov and Anand.",
        "2. c4 b6": "White transposes to the English Opening. Anglo-Indian Defense, King's Knight's Variation. Or, also the Reti/Zukertort Opening, English Variation. Black takes it a step farther toward the Queen's Indian Defense. Whew. Too many names for just four little moves so far.",
        "3. d3 c5": "Well, now he's gone and done it. Out of about 3,000 games in the World DB, for white's 3rd move he chooses one that has only been played 37 times but seems to give the best game to white, according to that DB. And he's way out of my book and also out of my references, so I guess we're just in some obscure line of the Reti, English Variation. I follow the DB's advice and pick the only move that plays better for black, also the move that the highest rated GMs chose, taking a piece of the center without losing a pawn on e5 or inviting exchanges on d5.",
        "4. g3 Bb7 5. Bg2 e6": "Still following the world DB. The sample size has gotten tiny, just 51 games - all of which favor white. Both sides have a fianchetto on the same long diagonal a8-h1. Both sides have two developed pieces and similar direct and oblique center control; it seems relatively even. I'm not sure why this position is so favorable for white in the DB. It looks relatively balanced to me.",
        "6. e4 d6 7. Nc3 g6 8. O-O Bg7": "More development. White gains ground in the center, black employs a second fianchetto aiming through the gap in white's center to pressure c3 and b2.",
        "9. Re1 O-O 10. d4 cxd4": "White fires the first shot, inviting the exchange on d4. Black accepts.",
        "11. Nxd4 Nbd7 12. b4 Ne5": "During the game, white told me he was so concerned about 12. ... Nc5 that he overlooked the danger of 12. ... Ne5. Black now threatens the pawn on c4 which, it turns out, is very awkward for white to defend. Black can bring a rook to the half-open c-file to add pressure while the beleaguered pawn cannot advance and it cannot be defended by an adjacent pawn.",
        "13. Bf1 Rc8 14. Qb3 Nfg4": "Now white's all-powerful queen is saddled with the task of defending a lowly pawn, so black creates a new threat by partially unveiling the bishop on g7. Black could have moved the knight elsewhere, such as d7 or e8, but this knight is also attacking the white pawns on f2 and h2, a seemingly harmless threat that is about to become more significant.",
        "15. Bb2 Nxc4": "White backs up his two knights, but it was the c4 pawn that was in most imminent danger. If white simply recaptures, he loses the knight on d4 and black has gained a pawn.",
        "16. Nxe6 Qf6": "White tried a different approach, an often useful tactic when your opponent launches a an exchange sequence. He captures a black pawn with his doomed knight, keeping material even. After 16. Nxe6? each player has a knight en prise, so we could both capture, or both retreat; either way material would remain even. But not this time. Black anticipated the tactic and had a zwischenzug prepared. Now thanks to the knight on g4, black threatens checkmate in two and white must respond, after which white will lose a piece. Better was simply recapturing with 16. Bxc4 or maybe saving the knight with 16. Nb5.",
        "17. Nf4 Nxb2": "White responds by saving his knight, but black's queen was not just threatening the knight, or just the checkmate. White's other knight is threatened too. In fact, 16. ... Qf6 was a three-way fork and white had to lose material.",
        "18. Ncd5 Bxd5 19. Qxd5 Qd4": "Ahead in material, black would like to trade queens and simultaneously give his remaining bishop a much more active role.",
        "20. Qxd4 Bxd4 21. Re2 Nd3": "Three attackers on that poor little pinned pawn on f2. The black knight on d3 is en prise and undefended, but when it moved here, it unmasked a discovered attack by black's bishop against the white rook on a1. White is faced with losing the exchange, or giving up a crucial pawn that is both vital for his king's security and also important to support the pawn on e4 if needed.",
        "22. Nxd3 Bxa1": "He chooses to save the pawn, and now black is up by a rook. Black's attack has, at this point, pretty much run out of steam. Time to settle in for the transition to a +rook endgame.",
        "23. Bh3 h5": "White pinned the black knight to the rook on c8, hoping to win back some of his material deficit. Black defends, but the knight is not out of the woods yet, for nasty little white pawns lurk nearby.",
        "24. f3 Bd4+": "Another zwischenzug. Before saving the knight, let's get that biship into a more useful, central location.",
        "25. Kf1 Rc3": "The black knight on g4 is pinned. If it moves, white would win the exchange. If it stays, white would win the knight. The only option is counterattack. Black will be more than happy if white chooses to exchange knights here.",
        "26. Rd2 Nxh2+": "I had to consider this one fairly long and hard. At first it appears that after the inevitable 27. Kg2 the black knight will be trapped. But I really wanted that pawn, so I explored the possibility of counterattacking to save the knight. And sure enough, the black knight is perfectly safe on h2, so the pawn falls as black's knight leaps out of the frying pan and into the fire.",
        "27. Kg2 Be3": "First, drive away the rook. If it goes anywhere but d1, black will win the white knight with 28. ... Rxd3, gaining knight+pawn (h2) for the doomed black knight.",
        "28. Rd1 Rc2+": "And now the black rook defends the black knight whilst attacking the white pawn on a2.",
        "29. Kh1 Nxf3": "Oh, this has all the elements of a checkmate written all over it. Black has three pieces aimed directly at the exposed and cornered white king. Well, not directly, or it would be triple-check, but close enough. Still, white has three well-placed defenders. So black grabs another pawn on f3, splitting white's kingside pawns into ruinous isolation, though the game is not likely to progress far enough for this to matter. But white threatened 30. Bg2 which would cut off the knight's defender and doom the knight to die, so it had to vacate h2 immediately and why not gain a pawn in the process?. Next plan, bring in black's trump card - his extra rook.",
        "30. Bg2 Ne5": "White drove the knight away, but not far, and now black offers an exchange.",
        "31. Nxe5 dxe5": "White accepted the exchange, perhaps a dubious choice when down by a rook and two pawns. Further, it allows black's only isolated and easily hunted pawn to find solace in the camaraderie of an adjacent black pawn.",
        "32. a4 Rfc8 33. Bf3 Rf2": "The beginning of the end. Black wants doubled rooks on his 7th rank (well, the second rank, but it's black's 7th). By threatening the white bishop, black is able to achieve command of the rank with tempo.",
        "34. Bg2 Rcc2": "I considered simply settling for 34. ... Rc1?, skewering white's only rook and forcing him to trade it off and ending up with a very simple endgame. But then I realized that that would be a mistake when there is material, and ultimately the game, to be won here. If white moves his bishop, 35. Rh2# is mate. If he defends his bishop with the only possible move, 35. Rg1, then the quiet 35. ... Re2 exposes white's rook to black's bishop and white cannot save the rook or black will simply play 36. ... Rxg2 and win the bishop, and black still threatens 37. ... Rh2#. Note that 36. Re1, counterattacking the black bishop, fails to 36. ... Bd4 and white has no way out - a bishop he cannot move or defend.",
        "35. Rd8+ Kg7": "So white tried a desperation check, but to no avail. He is now out of checks (other than the suicidal 36. Rg8+) and all of black's threats remain. In fact, after black plays 35. ... Kg7, he announces checkmate in 3.",
        "36. Rd1 Rfxg2 37. Rf1 Rgh2#": "But white courteously gives it up in two insead. A fun game with a dynamic opening (I had expected no less from this opponent) and a complex middlegame. And black gains a half page on the Fast Ladder."
    },
    "url": "https://gameknot.com/annotation.pl/elements-of-a-checkmate?gm=25473",
    "gameName": "Elements of a Checkmate",
    "players": "rjacobs (1553) vs. blake84120 (2037)",
    "opening": "Reti opening (A05)"
}