{
    "moves": {
        "1. e4": "Hi everyone!  That Expert Victory continues to elude me like a butterfly.  I end up being a pawn up from Move 5 onwards and carry this advantage right through to the conclusion of the game.  So, how was it that I am still jstevens1 and not TheBlackQueen?  Well, unfortunately my rook was on the wrong side of my passer in a rook ending.  So, how did all this happen?  Well, read on and follow the Gameknot Analysis on this link: http://gameknot.com/analyze-board.pl?bd=21355770&fb=1&rnd=0.6279427368148152",
        "1... e5 2. Nf3 Nc6 3. Bb5": "3. Bb5 - after a double king pawn opening we get the Ruy Lopez.  One of Gary Kasparov's favourites along with the Scotch.  I make the most popular response which is a6.",
        "3... a6 4. Be2": "4. Be2 - conservative development.",
        "4... Nf6 5. d4 exd4 6. Nbd2": "6. Nbd2 - a gambit, but will I be able to hold on to the pawn without compromising my position?  Only time will tell.",
        "6... d6 7. O-O Be7 8. a3 O-O": "8. ...... 0-0 - I must not get behind in development.  I now tuck Henry away which is just as well because there is soon gonna be a tactical stouche in the centre.",
        "9. Nb3 Nxe4 10. Nfxd4 Nxd4 11. Qxd4 Nf6": "11. ..... Nf6 - I remain a pawn up and I have exchanged a few pieces.  I just hope this advantage will continue.",
        "12. h3 Bd7 13. g4 Ne8 14. Bf3 c5": "14. ...... c5 - on the plus side I am not allowing myself to be too tied down.  On the minus side, my d6 pawn becomes vulnerable.",
        "15. Qd5 Bc6": "15. ..... Bc6 - driving off the Wicked Witch of the West and forcing an exchange of two further pieces.",
        "16. Qd1 Bxf3 17. Qxf3 Rb8 18. Nd2 Qc7": "18. ...... I want to move my b pawn, preferably to b5 but I do not want the Wicked Witch to land on c6.  So Glenda moves to c7 to prevent this.",
        "19. b3 Bf6": "19. ..... Bf6 - always worth attacking a rook along a long diagonal.  It is amazing how many rooks can get snaffled this way!",
        "20. Rb1 b5 21. Bb2 Bxb2 22. Rxb2": "22. Rxb2 - and another pair of minor pieces are traded off.",
        "22... Qb7 23. a4 Qxf3 24. Nxf3": "24. Nxf3 - and now the queens.",
        "24... Nc7 25. axb5 axb5": "25. ..... axb5 - pawn trade.",
        "26. Rd1 Rfd8 27. b4 f6 28. c3 Kf8 29. Rbd2": "29. Rbd2 - Gudrun, my opponent has been putting pressure on that weak d6 pawn over the last few moves.  Henry tries to add to the defense but his movements are literally put in check!",
        "29... Ke7 30. Re2+ Kf7 31. Ra2": "31. Ra2 - threatening Ra7.",
        "31... Ne6 32. Ra7+ Kf8 33. Nh4 cxb4 34. cxb4 d5": "34. ..... d5 - suddenly my d6 weakie is a passer!",
        "35. Nf5 Rb6 36. Re1 d4 37. Re7": "37. Re7 - that rook on e7 really is a bone in the throat, wouldn't you the Inquest Jury agree?  However, I find a way to break free!",
        "37... d3": "37. ..... d3! - with d3!",
        "38. Re1xe6 Rxe6 39. Rxe6": "39. Rxe6 - you think I am crazy, leaving my knight to hang, don't you?  Well .....",
        "39... d2 40. Ne3 d1=Q+": "40. ..... d1/Q+ - but Glenda makes Gudrun give it back!",
        "41. Nxd1 Rxd1+ 42. Kg2 Rd4": "42. .... Rd4 - Gudrun cannot avoid the loss of her b4 pawn, but ......",
        "43. Rb6 Rxb4 44. Kg3": "44. Kg3 - ..... unfortunately my b5 passer is backed up by my rook on the wrong side.  I remember a game called Turnaround many years ago when my opponent was a pawn up in similar circumstances and pushed it right up to the 7th rank.  However, it turned out to be a mistake because then Paul who was my opponent, neglected his kingside pawns so that his king could try and help his rook in an effort to crown that pawn.  Meanwhile those neglected p(r)awns were far too yummy for my seafood-loving Henry to resist!  I will not therefore make Paul's mistake.  Indeed over the next few moves, Henry kept right close to his pawns and I made no attempt to advance my passer.  A few moves later Gudrun and I agreed a draw.  Although it is another frustrating effort for Yours Truly, at least I held on to a material plus late on in the game and got myself out of a potentially fatal bind so there is another baby step in the right direction to becoming TheBlackQueen.",
        "44... h6 45. f3 Kf7 46. Rb7+ Kg6 47. h4 Rb1 48. Kf4 Rb4+ 49. Kg3 Rb1": ""
    },
    "url": "https://gameknot.com/annotation.pl/elusive-butterfly?gm=55810",
    "gameName": "Elusive Butterfly",
    "players": "algenmaedchen2 (2015) vs. jstevens1 (1840)",
    "opening": "Ruy Lopez (C68), exchange variation"
}