{
    "moves": {
        "1. e4": "As Black, I decide to play a well known opening that I haven't played before.",
        "1... e6": "This is the French, where the main line continues as: 2.d4 d5. Most chess coaches I know play 3.e5, but threr are other possibilities.",
        "2. b3": "Is it just me, or is my opponent not understanding the purpose of this opening. White is trying to develop the Queenside first by playing this move.",
        "2... Nc6": "I want to try for 3...d5.",
        "3. Bb5": "3...d5 is not so great, but it's playable along with 3...Bc5.",
        "3... d5 4. Bxc6+ bxc6": "Black is slightly better, but might have to deal with a troublesome e-pawn.",
        "5. e5": "Well, I think White had better moves, which include 5.Bb2.",
        "5... f6": "My goal is to help my Knight develop",
        "6. d4": "If this keeps up, 6...c5 is not a good suggestion.",
        "6... fxe5": "Looks like my position is going to suffer from development lack.",
        "7. dxe5": "The best thing I can do is develop my DSB.",
        "7... Bc5 8. Bf4": "I seriously doubt that White will get anywhere with this move.",
        "8... Ne7": "Aiming for 9...Ng6.",
        "9. Ne2": "I start wondering if both sides are experiencind development difficulties.",
        "9... O-O": "Now, 10...Ng6 looks good doesn't it?",
        "10. c3": "? This limits options for the Knight's development.",
        "10... Ng6 11. Qc1": "If White does this just for a dispositioned pawn, I will do this, just for a dispositioned pawn.",
        "11... Qh4 12. Bg3 Bxf2+": "Since I don't really know this game well, we'll see how this good opportunity vanishes in the end.",
        "13. Kd1": "Now, I'll win a free pawn.",
        "13... Bxg3 14. Nxg3": "Since there's no immediate threat, I should just play 14...Nxe5. ",
        "14... Qg4+": "This doesn't look good on my agenda.",
        "15. Kc2": "Rook to f2 isn't bad either.",
        "15... Rf2+ 16. Nd2": "The problem is the King is safe unless I take the wimpy e5 pawn and develop my Bishop.",
        "16... Nxe5": "What would I get done without this move?",
        "17. Qg1": "New plan: my Rook should be fine on f4. At least.",
        "17... Qg6+": "For good or worse, I check White again. ",
        "18. Kd1": "Maybe 18...Nd3 instead.",
        "18... Qg4+": "Worst place for White's King is back to e1, but otherwise, my advantage is all over.",
        "19. Nf3": "Why am I eyeing 19...Rb2?",
        "19... Rb2": "Probably because it is the most useless square for the Rook at this time.",
        "20. Qe3": "This proves my point.",
        "20... d4": "White's laughing at me now.",
        "21. cxd4": "Worse, my Rook is probably going to be trapped. 22.Qc1 Rxg2 23.Rg1. The plan is open for failure however.",
        "21... Rxg2": "This is okay, but I'm asking for more trouble.",
        "22. Rf1": "An exchange will lead us to the endgame.",
        "22... Nxf3 23. Qxf3 Qxf3+ 24. Rxf3": "Thanks for the extra pawn and a possible escape route, White.",
        "24... e5": "This isn't a free pawn. That is a free Rook.",
        "25. Re3": "Anyways, thanks for another pawn (if I can get to it).",
        "25... Bg4+ 26. Ne2 exd4 27. Re4": "27...Rxe2 28.Rxg4 e3.",
        "27... Rd8": "This works too.",
        "28. Ke1": "It's probably a good idea to advance the d-pawn.",
        "28... d3": "Which is what happens. White is best moving the Knight.",
        "29. Nc3": "Can Black play 29...d2+ safely? ",
        "29... Rg1+": "I could have also taken the h2 pawn before the check.",
        "30. Kd2": "Another possible move is 30.Kf2, attacking my Rook and preventing 30...Rf8+?? temporarily.",
        "30... Rxa1": "Take the Rook; lose the Bishop. Other options don't work too well.",
        "31. Rxg4 Rh1 32. Rh4 h6": "I would now want to get my King into the action.",
        "33. Ne4": "White is trying to take advantage of the space given during those exchanges.",
        "33... Ra1": "I don't necessarily like this move mainly because the Knight will return to this spot and I had better threats.",
        "34. Nc3": "As expected.",
        "34... g5": "I am guarenteed to lose the pawn afer 35.Rh3.",
        "35. Rxh6": "Or worse, win two pawns for free.",
        "35... Rd6": "Loses another pawn after 36.Rxd6 cxd6 37.Kxd3 with no check any time soon.",
        "36. Rxd6 cxd6 37. Kxd3": "I need to activate my Rook again.",
        "37... Kf7": "Better is 37...Re1",
        "38. Ne4": "Well, at least my Rook has another option.",
        "38... Rd1+": "That, or the risky 38...Kg6.",
        "39. Ke2 Rd5 40. Nd2 Re5+ 41. Kf2 Kg6": "Maybe 40...Re5 wasn't such a good move. 40...Rf5 was probably better.",
        "42. h3": "42...Kh5?",
        "42... Rf5+ 43. Kg3 Kh5": "I think that this is too late.",
        "44. Nf3": "Okay, never mind. I can play 44.Rf4.",
        "44... Rc5": "In a word: wasted. In two words: somewhat wasteful.",
        "45. b4 Rc3": "This is why. My Rook isn't doing anything once again.",
        "46. Kf2": "The good news about 44...Rc5 is when this starts happening, and I can make a safe exchange.",
        "46... g4": "Perhaps I can win an extra pawn.",
        "47. hxg4+ Kxg4": "Yep, I'll win an extra pawn.",
        "48. Nd2 Rc2": "Maybe 48...Kf4 should have been played before this move.",
        "49. Ke3": "I can take the pawn at my own risk.",
        "49... Rxa2 50. Ne4": "Now, 50...a5 creates chances to promote.",
        "50... Ra3+": "I wonder if all those checks were worthwhile because they didn't really benefit me too much so far.",
        "51. Kd2": "It's best to settle for a pawn exchange I suppose.",
        "51... Rb3 52. Nxd6 Rxb4 53. Nf7": "The threat is the fork, winning a pawn. ",
        "53... Rb3": "I don't know why I ignored it since 53...Kf4 was better.",
        "54. Ne5+ Kf4 55. Nxc6 a6": "I realize that if I lose the Rook, not only is it going to be a draw game, I will be two points down.",
        "56. Kc2": "I feel the urge to chase the Knight just a little bit for now.",
        "56... Rh3": "I think I had better moves such as 56...Rb6.",
        "57. Nd4 Ke4 58. Nb3": "Although the Knight is very irritating, I have no reason for a draw. In other words, I won't take the Knight yet.",
        "58... Kd5 59. Na1": "I think my opponent took this a little bit too hard.",
        "59... Kc4": "With the Knight having useless squares to go to, I decide to try to take advantage of the situation and push the King to its doom.",
        "60. Kb2 a5": "Also playable are 60...Rc3 and 60...Kb4.",
        "61. Kc2": "An idea is 61...Rh2+, forcing the King to a helpless row while the Knight isn't doing too much.",
        "61... a4": "I don't like this move particularly because it may lead to a draw.",
        "62. Kb2 a3+ 63. Ka2": "I realize that the pawn might be lost. Still, I have a good idea.",
        "63... Re3": "This move threatens a King and Rook vs. King endgame, and that's the best I can do right now.",
        "64. Nc2": "I expected this move and sucessfully pin it to the King.",
        "64... Re2": "This is what I mean when I say that it threatens a King and Rook endgame. The pawn is hanging, but it is all part of the goal of eliminating the Knight.",
        "65. Kb1": "With this expected move, I have to be very careful as this is a fragile and expensive opportunity. If I play this wrong, it's a draw.",
        "65... a2+": "!? Risks a draw!",
        "66. Kxa2": "He could have gone to a1, but instead, he triggers a winning position for Black.",
        "66... Rxc2+": "I take his Knight, expecting 66...Ka3.",
        "67. Kb1": "Forced mate in two now.",
        "67... Kb3": "This shoves White's King to a helpless square.",
        "68. Ka1 Rc1#": "When you are up points, you have to have sure that it is beneficial. Otherwise, a draw or even a losing position can occur. It is not best to judge a win by material and this is why. This game is an example where I ignored some potentially dangerous threats. Be on the lookout for any immediate threats, tactics, etc. because when performed, they haunt you for the rest of the game."
    },
    "url": "https://gameknot.com/annotation.pl/endgame-strategy?gm=44951",
    "gameName": "Endgame strategy",
    "players": "mel-lo (1077) vs. chesskingdom64 (1301)",
    "opening": "French (C00), Reti (Spielmann) variation"
}