{
    "moves": {
        "1. e4": "The funny thing about screwing up a chess game is that the process by which you recover from a series of mistakes is the most rewarding part of this game. ",
        "1... g6": "I decide to play the Robatsch (Modern variation) defense. ",
        "2. e5": "Over-extends the pawn. ",
        "2... Bg7 3. d4 d6 4. exd6 cxd6 5. d5": "more bad development from white",
        "5... Nf6 6. Nc3 O-O 7. Be2 e6": "here it comes..",
        "8. Bg5 exd5 9. Nxd5 Qa5+": "Black is dominating the opening and I confess overconfidence got the better of me. Watch as I proceed to dig myself in a hole. ",
        "10. b4 Qxd5 11. Bd2 Qxg2": "Can you see it? ",
        "12. Bf3": "Black's Queen is cutoff. I had two choices. Bg4 would have allowed me to trade queens but I didn't see it. Instead...",
        "12... Qxh1 13. Bxh1": "Throwing away the gains made in the opening. We're still even in material but not for long. ",
        "13... Bg4": "Too late. knight c6 would have been much better for obvious reasons. ",
        "14. Bf3": "yup",
        "14... Nc6": "and with that blunder white is about to pull ahead to black",
        "15. Bxg4 Rfe8+": "futile ",
        "16. Be2": "Now having dug myself into a hole, the fun part of fighting my way out begins. ",
        "16... Ng4 17. Rb1": "white throws a move away here. pretty sure white needs to get the queen out to derail an imminent attack on it's center. Perhaps he was feeling overconfident because the bishop is protected by the knight, the king, and the queen. ",
        "17... Re7 18. Bg5": "this move is a mistake too. the bishop doesn't stop the attack, Re6 protects the pawn on d6, and white's bishop remains immobilized. ",
        "18... Re6 19. Nf3": "Bishop on e2 is looking vulnerable, not sure what white is trying to do with the knight, he needs to be moving the king to get the bishop back in game. Bc4 would ruin black's day in a hurry. ",
        "19... Rae8 20. Be3": "white entrenches. His biggest advantage is the queen and it's still not in play. Plus Nxe3 is going to be a darn good move. ",
        "20... Nxe3 21. fxe3 Re6xe3": "the center hasn't folded yet, but it's coming. ",
        "22. Ng1": "white is pushed further back. However evening out material was no longer my priority, black now has a chance to take the offensive! ",
        "22... Bc3+ 23. Kf2": "king on the run.. kf1 would have been a better choice I think. ",
        "23... Bxb4": "this is I think the only mistake I made. I don't need the pawn, I need to keep attacking. This move gives white breathing room. ",
        "24. Rb3 Re3e5 25. c3": "White has failed to seize this opening. His queen has yet to move. ",
        "25... Bc5+ 26. Kf1": "white hands back the material with this move but more importantly I could now remove the knight. ",
        "26... Bxg1": "perhaps Rf5 is better, but black erases the material deficit. ",
        "27. Kxg1 Re5xe2 28. Qxd6": "the queen is finally out but it's too late. Black has a free pass at the king and from here on out the queen and the rook will be useless to white. ",
        "28... Re2e1+": "here we go. ",
        "29. Kg2 Re8e2+ 30. Kh3 Re2e3+": "Kg2 forces a draw, but white perhaps still thinks he can win. And he should be able to win.. he can easily pick off black's left pawns with either the queen or the rook. Instead he goes for the win and seals his doom. ",
        "31. Kg4 Ne5+": "that was probably the worst move for white. Black has three pieces he can use to go for the mate. ",
        "32. Kg5 f6+": "this one is tricky... but it works. His only option to get out of this situation is to take the pawn with the queen. ",
        "33. Kxf6 Rf1+": "White has only one real move, kg5. ke6 or ke7 lose him the queen but he would have survived. Unwilling to give up the queen, black plows toward checkmate. ",
        "34. Kg5 h6+": "now inevitable. ",
        "35. Kxh6": "another mistake. ",
        "35... Rh3+ 36. Kg5 Rf5#": "Here we come to the end of our tale. Despite having better firepower, white lost because he failed to get his queen in the game. I was playing as black and I should have lost this game, but was basically handed a lifeline. This is my first annotation so I probably made numerous mistakes but get better I shall! Thanks for reading. "
    },
    "url": "https://gameknot.com/annotation.pl/enduring-the-blunder?gm=33593",
    "gameName": "Enduring the blunder",
    "players": "siddvicious (1351) vs. big_red (1447)",
    "opening": "Robatsch (modern) defence (B06)"
}