{
    "moves": {
        "1. e4 e5 2. d4": "I free up my queen and bishops in conjunction with the centre game...",
        "2... exd4 3. Qxd4": "...then we trade pawns.",
        "3... Nc6": "Now my opponent develops a knight...",
        "4. Qe3": "...and I retreat my queen, in conjunction with the Paulsen attack.",
        "4... Nb4": "The knight is eyeing up my king, queen and rook...",
        "5. Na3": "...so I cover the c2 square with mine.",
        "5... b6": "My opponent opens up a pawn, possibly hoping to fianchetto the bishop...",
        "6. c3": "...so I attack the knight...",
        "6... Bc5": "...but the other bishop comes out to attack the queen...",
        "7. Qg5": "...so I attack my opponent's...",
        "7... Qxg5 8. Bxg5": "...and I get the swap I was hoping for.",
        "8... Nc6": "Now the knight must retreat...",
        "9. O-O-O": "...but I can't understand why I castled queenside...",
        "9... Bxa3": "...and I lose my knight...",
        "10. bxa3": "...in exchange for my opponent's bishop.",
        "10... h6 11. Bf4": "My bishop must retreat...",
        "11... Nf6": "...and the other knight comes out...",
        "12. Nh3": "...and I put my other knight on the edge, keeping the e-file half-open, and the f3 square clear...",
        "12... Nxe4": "...as the knight takes the bait of my king's pawn...",
        "13. Re1": "...and is instantly pinned down by my rook...",
        "13... d5": "...and although the queen's pawn moves forward to cover any rook attack...",
        "14. f3": "...I push up my pawn to ensure a win of more for less...",
        "14... Bxh3": "...but lose my other knight...",
        "15. gxh3": "...in exchange for the remaining bishop...",
        "15... O-O-O 16. fxe4": "...but finally remove the knight, with a net gain...",
        "16... Rhe8": "...and my opponent lines up a two-pronged attack on my e4 pawn...",
        "17. Ba6+": "...but I move up my bishop to connect my rooks and check the king to create a distraction...",
        "17... Kb8 18. exd5": "...allowing me to win a pawn and open up and contest the e-file.",
        "18... Ne7": "The knight retreats to cover the rook and attack my d5 pawn...",
        "19. Bc4": "...so I cover the pawn with my bishop...",
        "19... g5 20. Be5": "...and my other bishop moves into the centre to potentially fork the knight and a rook...",
        "20... Ng6": "...but the knight moves out of the way...",
        "21. Bf6": "...so I attack the d-rook and open up the e-file, and with both of my opponent's rooks now under attack...",
        "21... Rxe1+ 22. Rxe1": "...I get the exchange I was looking for.",
        "22... Rd6": "Although my opponent lines up my bishop...",
        "23. Ba6": "...I push up its twin to line up a potential checkmate, blocking off the king's escape route...",
        "23... c5": "...but my opponent moves up the c-pawn to give him that escape route by c7...",
        "24. Re8+": "...so I attack on the top rank...",
        "24... Kc7 25. Rc8+": "...and give the king the runaround...",
        "25... Kd7 26. Rd8+": "...and again, on both occasions being helped by the bishops...",
        "26... Kc7 27. Rxd6 Kxd6": "...before we again exchange rooks.",
        "28. Bb7": "Now I move my bishop to help my d-pawn...",
        "28... Nf4 29. Bg7": "...and eye up the h-pawn...",
        "29... h5 30. Bf8+": "...and I attack the king...",
        "30... Kd7": "...who retreats one rank...",
        "31. Bc6+": "...so my other bishop attacks...",
        "31... Kd8": "...and as the king moves onto his starting rank...",
        "32. d6": "...I can push up my pawn even further, with the b-to e-files on the 7th rank being controlled by my bishops and pawn.",
        "32... Nxh3": "Although the knight removes another pawn...",
        "33. Be7+": "...my black-square bishop attacks the king...",
        "33... Kc8": "...forcing him in front of my white-square bishop...",
        "34. Be8": "...which then moves to the top rank to shield my very passed pawn...",
        "34... Nf4 35. d7+": "...which can see that the way ahead is clear. Its next move would have been to d8, to become a queen, and then she would have helped my bishops to possibly clear the board but certainly trap the king."
    },
    "url": "https://gameknot.com/annotation.pl/englands-mini-tournament?gm=24288",
    "gameName": "Englands Mini Tournament",
    "players": "aspiemikey (1294) vs. rttesse (1484)",
    "opening": "Centre game (C22), Paulsen attack"
}