{
    "moves": {
        "1. c4": "My second english as black, second lost, ",
        "1... Nf6": "English opening, I do not like it but it's a reason to work on it.",
        "2. g3 e5 3. Bg2": "White opts for the fiancheto variation",
        "3... d5 4. cxd5 Nxd5": "It seems ok for black. I often trade the center pawn.",
        "5. Nc3 Nb6": "Retreat",
        "6. Nf3": "White develops",
        "6... Nc6": "Not a too bad position for the knights",
        "7. O-O": "King in safe.",
        "7... Be7 8. a3 O-O": "Castling as well.",
        "9. b4 Be6": "White advances on the queen side, black settles in the center.",
        "10. Rb1": "I don't understand this move and I do not like it.",
        "10... a6": "Preventing 11. b5 or 11. Nb5",
        "11. d3": "White developes the center.",
        "11... f5": "Black's plan is to attack the e and d file but it's a bad move for it weakens black's king. (my opponent thinks it is the losing move and looking at it now, I think he is right.)",
        "12. Bd2": "White carries on developping his pieces",
        "12... Bd5": "With the a2 g8 diagonal open and the king on g 8, trading the bishop is a strategical mistake. ",
        "13. Nxd5": "White accepts the trade, of course.",
        "13... Nxd5": "That was black's aim : to bring a knight on the center (The brave Lancelot was so impatient)",
        "14. Qb3": "Lancelot is pined and the white bishop has fallen on battle. Only dame Guenièvre can protect her faithfull knight.",
        "14... Bf6": "To enable the rook to come on the e file and to prevent 16. Nxe5 Nxe5 17. Bxd4 +",
        "15. e4": "It had to come",
        "15... Nce7": "Perceval will at least revenge his fellow knight.",
        "16. Ng5": "My opponent doesn't take but the situation is not getting better for black. At this point, I'm asking myself how I have done to be in such a situation after only 16. moves.",
        "16... c6": "The footman comes and help his knight.",
        "17. Ne6": "I had foreseen this move but thought, trading one rook against the advanced white knight was not so bad (compared to others possibilities).",
        "17... Qd7 18. Nxf8 Kxf8": "So, Now, Lancelot will meet his doom",
        "19. exd5": "Argh...",
        "19... cxd5": "Revenge but black's situation is very bad : 4 points late in material. The fact that white has a weak pawn on the d file and that black dominates the center doesn't compensate this late.",
        "20. f4 Nc6 21. Qxd5": "White proposes a trade",
        "21... Qc7": "Trading is not in black's favour, so dame Guenièvre has to hide behind perceval.",
        "22. fxe5": "White trades as much as he can and he is definitely right.",
        "22... Rd8": "A counterattack",
        "23. Qe6": "White can afford a couple of mistakes",
        "23... Nd4": "Garde !",
        "24. Qc4 Qxe5": "One less...",
        "25. Rbe1 Qb8": "Not a safe place for dame guenièvre but are there still safe places for a lady on this battlefield.",
        "26. Bf4": "Of course...",
        "26... Qa7": "Protecting the brave Perceval.",
        "27. Qc5+": "The trade is unavoidable",
        "27... Qxc5 28. bxc5": "No more queens on the field",
        "28... Nc2": "a last assault from Perceval",
        "29. Bd6+": "King in great danger.",
        "29... Kf7": "Little choice",
        "30. Rec1 Nxa3": "To take a pawn but I should probably have plaid 30. Bd4 to keep the center complicated and protect f5. Probably Perceval's morale was no more sufficient to properly fight.",
        "31. Bd5+ Kg6": "From now on, black tries to avoid the mate and hold 13. moves.",
        "32. g4 fxg4 33. Be4+ Kf7 34. Bxh7 Nb5 35. Be5 Rxd3 36. Bxd3 Ke6 37. Bxf6 Nd4 38. Rce1+ Kd5 39. Re5+ Kc6 40. Bxg7 Nb5 41. Rf6+ Kd7 42. Bf5+ Kd8 43. Rf7 Nc7 44. Bf6#": "It's finished. The king is dead and the faithfull Perceval still at his side could do nothing but cry.\n"
    },
    "url": "https://gameknot.com/annotation.pl/english-l?gm=49070",
    "gameName": "english (L)",
    "players": "bwaa (1785) vs. ptitroque (1687)",
    "opening": "English, 1...Nf6 (Anglo-Indian defense) (A15)"
}