{
    "moves": {
        "1. Nf3": "The Reti opening. Puts me off my first-choice move 1... e5, as the first time I used this response, it set the tone for the rest of the game, and I lost...",
        "1... Nc6": "...so I move my own knight up to contest the dark squares in the centre, and allow for 2... e5, unless he plays 2. d4...",
        "2. g3": "...but as he moves up the pawn in front of his knight, he's no doubt hoping to fianchetto his bishop onto the long light diagonal...",
        "2... e5": "...but because I have nothing to fear from the bishop landing there, I advance my king's pawn onto the other (dark) diagonal, where it is protected by my knight...",
        "3. d3 Nf6": "...and I get ahead on development with my other knight, to control all the centre squares. These early moves were half-consciously made, as I didn't know what else I could do...",
        "4. Bg2": "...and he finally fianchettos his bishop, as I anticipated...",
        "4... e4": "..so I move up my pawn to fork the knight and pawn. If he captures my pawn, my knight advances to recapture...",
        "5. Nfd2 exd3 6. cxd3": "...but as he declines to take it, I initiate the exchange, and he obviously captured with his bishop's pawn as he anticipated a response of 6... Qe7+, possibly followed by a block with his own queen, and even a trade, forcing his king off his starting rank...",
        "6... Bc5": "...so I move up my dark-square bishop to allow for kingside castling...",
        "7. Nb3": "...and as it is instantly placed under attack by one of his knights...",
        "7... Qe7": "...I defend it with my queen, although I felt this was a little dubious with the bishop having a wider range, even though it can never change square colour...",
        "8. Nxc5 Qxc5": "...and we trade the pieces, leaving me ahead on development, although my queen may look a little vulnerable in her current position...",
        "9. O-O O-O": "...and we both castle kingside to allow a rook some freedom...",
        "10. Nc3": "...and he develops his remaining knight to pull back on development...",
        "10... d5": "...and I advance my queen's pawn to protect my knight on the light diagonal and free my remaining bishop...",
        "11. Na4": "...and his knight places my queen under attack...",
        "11... Qd6": "...so I retreat her one square to keep her reasonably placed...",
        "12. Bf4": "...but she comes under attack from the bishop...",
        "12... Qb4": "...but why did I move her here, to attack his knight, when it was protected by his queen, exposing my pawn?",
        "13. Bxc7": "As I result I lose the pawn in front of my remaining bishop...",
        "13... b5": "...and in retaliation, I place his knight under attack with my knight's pawn...",
        "14. a3": "...but this was a blunder by him, trying to attack my queen instead of saving his knight...",
        "14... Qe7": "...when I could place a second piece under attack...",
        "15. Bf4": "...and as he saves his bishop...",
        "15... bxa4": "...I steal the knight. I was a little lucky there, but as the saying goes, you make your own luck.",
        "16. Bd2": "Why did he retreat his bishop? Was he trying to attack from another side?",
        "16... Bg4": "I bring my remaining bishop into enemy territory, although I probably brought it up to far...",
        "17. f3": "...when the obvious response was for it to be attacked by the pawn...",
        "17... Qc5+": "...although it did expose the king to be checked by the queen...",
        "18. Kh1 Be6": "..and I now retreat my bishop to safety, losing tempo...",
        "19. e4 dxe4 20. dxe4": "...and, being ahead on material, I decide to trade pawns....",
        "20... Rfd8": "...then I place a rook on the now open d-file, hoping to put my queen ahead, in order to win a piece, or even exchange...",
        "21. Rc1": "...and as he places his rook on the other open file, where my queen and knight are situated...",
        "21... Qd6": "...I save both by placing my queen on a safe square close to my knight, attacking the bishop...",
        "22. Bf4": "...and as it moves out of the way...",
        "22... Qxd1 23. Rfxd1": "...I get the queen exchange...",
        "23... Rxd1+ 24. Rxd1": "...along with a pair of rooks...",
        "24... Rd8": "...and I place my remaining rook on the open d-file to contest it. This may have been a little dubious, with me having one less long-range piece...",
        "25. Rxd8+ Nxd8": "...and I get the other rook exchange. OK, my knight landed back on its starting rank, but I am ahead on material, despite having fewer long-range pieces in the endgame where no piece is worth more than three points, and I am trying to weaken his counterplay.",
        "26. g4 Nc6": "I now move my knight back up to help to clean up the pieces...",
        "27. Be3": "...and his dark-square bishop lines up my queenside pawn still in its initial position...",
        "27... Ne5": "..but what was I thinking exposing it to the bishop?",
        "28. h3": "I sure got off the hook there! He could have gone Bxa7, and threatened to create two passed pawns on the queenside, although...",
        "28... Nd3": "...this was what I had in mind. I was trying to remove the pawn on b2, although the bishop could cover that square...",
        "29. Bd4": "...which is exactly what it does.",
        "29... Ne1": "However, it does allow me to trade pieces or win a pawn...",
        "30. Bxf6 gxf6": "..but was this the right move, trading his bishop for my knight, doubling pawns on f7 and f6? His counterplay has weakened.",
        "31. Bf1": "He therefore saves his other bishop...",
        "31... Nxf3": "..allowing me to capture the pawn on f3, isolating the one on e4, making it an easy target.",
        "32. Bb5": "He therefore lines up my pawn on a4, with the a7 pawn safe, as the dark-square bishop has gone...",
        "32... Nd2": "...and I line up his isolated pawn...",
        "33. Bxa4 Nxe4": "...and we capture the pawns.",
        "34. Kg2 Nc5": "I now line up his bishop...",
        "35. Bc2 Bb3": "...and attack it with my own...",
        "36. Bxb3 Nxb3": "...but why did he capture mine and allow the exchange? OK, my knight has a limited range, but, with some help, it can quite easily mop up my opponent's pawns.",
        "37. Kf2 Nd2 38. Ke2 Nc4": "I am now guaranteed to win another pawn...",
        "39. Kf3": "...so my opponent resigns."
    },
    "url": "https://gameknot.com/annotation.pl/englands-mini-tournament?gm=25519",
    "gameName": "Englands Mini Tournament",
    "players": "arfur1471 (1368) vs. aspiemikey (1337)",
    "opening": "Reti opening (A04)"
}