{
    "moves": {
        "1. c4": "English\nI did not play this game on GameKnot.com.  I played this person to person.",
        "1... e5 2. Nc3 g6": "This is a very slow move. It can give white the initiative d4! or Nf3!? I believe in the future, I'll play g6; Bg7; e5 or e5; Nc6; g6\nKnowing my opponent, I think he wouldn't even play the attacking move mention.",
        "3. g3 Bg7 4. Bg2 Nc6": "Both of us are now controlling each others (4th & 5th rank) d-pawn square ",
        "5. d3": "I am not sure if he played this move or e4 right away, but I know what it transposed to",
        "5... d6 6. e4": "My foe decieded to play the Nimzo-Botvinik system,  I learned of this system while my days playing at a chess club in seattle.  I've seen a couple of games  with white winning by using this system and heard it is a universal system for white.  I also seen a couple of games with black winning.  The setup I use, I'm black, is what Gregory Serper used to beat a young kid Michael Lee in Wa state Championship.  However, I did not play Nh5 and Instead playing Nd7 incorrectly playing the system.  Kasparov also played this line as black a couple of times",
        "6... f5": "Now I am setting up a King's Indian formation without having to move my knight twice to play f5.",
        "7. Nge2 Nf6 8. O-O O-O 9. a3": "?! A little meek.",
        "9... a5 10. Rb1 Be6 11. Bg5 Qd7 12. Nd5 Rf7": "This can lead to a wasted tempo via B/Nxf6; Bxf6 and B/Nxf6 and then I have to move my rook again.  This is where my knowledge of the Serper game left me.  Here he played Nh5 for what reason, I do not know.",
        "13. b4 axb4 14. axb4 Ne7": "  ?  Now I made a mistake.  I did not want to move the rook and surrender the a-file to White's Rook.  So, I wanted to attack the Nd5; c6, but this allows white to win the b-Pawn",
        "15. Nxe7+ Qxe7 16. exf5": "  !",
        "16... gxf5 17. Bxb7": "This is when I said, \"darn it, I knew I should have played Raf8\"",
        "17... Raf8 18. f4": "!?",
        "18... Qd7": "Trying to trap his bishop, in vain.",
        "19. b5 e4 20. Nd4": "  ?!  He gives me a extra move.",
        "20... exd3": "  !",
        "21. Bc6": "  !",
        "21... Qc8": "I did not want to pin my queen against his dark squared bishop on e7, restricting the mobility of my knight.  In the future, I knew he was going to be useful on e4.",
        "22. Ra1": "  !  I foresaw the doom of my Queen ",
        "22... Bxc4": "  !  I decided to go into the endgame",
        "23. Ra8 Qxa8": "  !",
        "24. Bxa8 Rxa8 25. Re1 Ne4": "  !",
        "26. Nxf5 Rxf5 27. Rxe4 Ra1 28. Qxa1 Bxa1 29. Rxc4 Rxb5": "  ??   Missing the chance to queen my pawn.  I played this on a real chess board  and did not calculate  deep enough.",
        "30. Kf2": "Now I can't queen my pawn",
        "30... Rd5 31. Ke1 d2+ 32. Kd1 c5 33. Rc2 h5 34. Rxd2 Rxd2+ 35. Kxd2 Kf7 36. h3 Ke6 37. g4 hxg4 38. hxg4 Bg7 39. Ke2 Kd5 40. f5 Ke5 41. Ke3 d5 42. Bh4 Bf6": "  ??",
        "43. Bg3#": ""
    },
    "url": "https://gameknot.com/annotation.pl/english-nimzo-botvinik-system?gm=20007",
    "gameName": "English:  Nimzo-Botvinik system",
    "players": "  vs. Freeman8201 ",
    "opening": "English opening (A21)"
}