{
    "moves": {
        "1. d4": "Playing against easy19 has a kind of psychological effect on me... I play worse than ever, as you will see. This is a lesson about how NOT to play. Still, there is a somewhat interesting countergame I couldn't manage well.",
        "1... Nf6 2. Bg5": "A mini tournament on this is currently being played. I never faced it, so I was looking into the database. ",
        "2... Ne4": "This seems logical and naive, but I couldn't see any damage. ",
        "3. Bf4 f5": "The idea is to get the knight back to f6 taking advantage of a kind of Dutch set for black. ",
        "4. Nd2 b6": "...but this was a blunder. I thought after NxN, my extra central pawn would have somewhat cramped white, but I was plainly wrong. ",
        "5. Nxe4 fxe4 6. e3": "My kingside is wide open now, and I am behind in developement. I can see I'm doomed right now. ",
        "6... g6": "The queen's check in h5, followed by Qe5, is already very annoying. Now, the bishop can go to e5 and makes me lose my castling on the queenside, but I have to think about a queenside castling - if ever. ",
        "7. h4": "Very easy to spot: an exchange on h5 is lethal, so...",
        "7... h5": "Another tempo wasted for developement. But h4 was lethal. ",
        "8. Nh3": "I expected g4 at once... but white can play as he wants.",
        "8... e6": "Hard choice. d6 prevents the bishop to go e5, but does little for my developement. This at least opens the way for my dsb to exchange some white pieces. Another option was d6. But this would have meant to admit b3 was just a wasted tempo. ",
        "9. Ng5 d5": "Bb7 is impossible since e6 would be taken. ",
        "10. f3": "Again, I thought that with g4 the game was over. ",
        "10... Be7": "I have to exchange this nasty knight soon.",
        "11. fxe4 Bxg5 12. Bxg5": "The bishop, there, is less dangeroud than the knight, and allows my queen to get into the game. ",
        "12... Qd6": "Now, if e5, Qb4+ and I can think about some countergame. ",
        "13. Bd3": "Well, I thought that o-o would have been fine. I have to protect myself against Bxg6+. ",
        "13... Qg3+": "...or Qb4+... I wasn't sure which would have been better. ",
        "14. Kd2": "Qxg2+, Kf1, dxe5... maybe it was the best chance. But if white defends the check with Qe2, I cannot solve the e4 problem. ",
        "14... Ba6": "I thought it was clever to exchange the bishop, but it was just a bad idea. ",
        "15. Bxa6 Nxa6 16. Qf1": "...because of this. Now, if I defend the knight, Qf6 was just deadly. I didn't see it. ",
        "16... Rf8 17. Qxa6": "Now black has some countergame, but... ",
        "17... Rf2+": "Or Qxg2+, but then? After dxe5 or Qxe5, Qb7 and I lose more material. ",
        "18. Kc3": "This is a good position for teaching how to analyze. White has a lot of treats. If Qb7, my rook is lost (Rd8, BxR the least). But it is not mate. I have two precious tempoes to make a counterattack. On the other side, my best defence is Kd7, that also protects c6 if Qb4+. But... is defence a good strategy in such a position? I spent a lot of time analyzing if Qxg2 was enough to stop white from playing Qb7. I can even let white take the a8 rook, if it gives me a tempo for a perpetual or something... but I missed the simple one. ",
        "18... Qxg2 19. Qa4+": "This one protects f2 and gives me check. Game over. ",
        "19... Kf8": "Well, at least my rook is saved but... what for?",
        "20. Qd7": "White calculated Bh6 and mate was unstoppable. I had to move the K to d7 earlier. A shame of a game. If Rxc2+, Kb3, Rxb2+, Ka3, and the only way I have to proceed is Qd7, threatening mate, but white comes first. ",
        "20... Rf7 21. Raf1 Qxf1 22. Rxf1 Rxf1 23. Bh6+ Kg8 24. Qg7#": ""
    },
    "url": "https://gameknot.com/annotation.pl/entangling-myself?gm=48073",
    "gameName": "Entangling myself",
    "players": "easy19 (2001) vs. damalfi (1762)",
    "opening": "Trompovsky attack (Ruth, Opovcensky opening) (A45)"
}