{
    "moves": {
        "1. e3 a6": "I begin the match with a classic opening move, often underestimated. Very skilled - a killer move. ",
        "2. a4 f6 3. c3 g6 4. Bc4 h6 5. Qb3 e6 6. d4 d6 7. e4 c6 8. Qd1 b6": "The Pwners Defence - a seldom-used but very effective opening. I believe it was the late Von Kodswallop that used this opening against then-no.1 Sir Vollingbottom, and beat him decisively. I will demonstrate its effectiveness soon...",
        "9. f4": "Meanwhile, I may add, the opponent has done nothing but wallow in his own incompetence. You can see his moves have no real tact at all - meaningless feints with little to gain from. ",
        "9... Ra7 10. Nf3 Rhh7": "The rearguard rook back-half snookle shmongfoddle formation is a classic. Here I have used with fluidity and decisiveness. ",
        "11. O-O Nd7 12. Bxe6": "The first real mistake of the match. The opponent, so amateurish in his execution, has been unable to open up his right-left-mid-flank-twaddle. You will see how disastrous this is soon...",
        "12... Rg7 13. Qb3 b5": "Skilled, almost effortless. Very proud of this move. ",
        "14. Nbd2 Qa5": "Hmph! Now who's laughing! ",
        "15. d5 Nc5 16. Qb4 Qxa4": "Probably the best move of the match - subtle, yet ferocious in its outcome. Just splendid. ",
        "17. Rxa4": "Yes... splendid. ",
        "17... Nxa4 18. dxc6 a5": "A few moves later, and I push at his rear-front-attack back, gaining control of the left rank. ",
        "19. Qb3 d5 20. Qxd5 Bc5+": "Here my opponent has failed to estimate the strength of my Chevsky's Feint. Whatever that means. ",
        "21. Kh1 Bxe6": "Deadly. Just... deadly. \n\nVery deadly. ",
        "22. Qd3 Bc4": "This move releases the pressure on my mid-back-hovskys-smovky-piddleplop. Very nice move, I can't help but congratulate myself.",
        "23. Nxc4 bxc4 24. Qxc4": "A quick of exchange of pieces... just as planned. ",
        "24... h5": "Very nice move here by me - almost languid, lazy... seemingly innocuos but indefinitely sealing a victory for me. If I remember correctly, it was this move that earned the late Baron Borabottle his easy victory of then-no.1 Van Banguilugud, in the Russo-Frencho-Indo-American championship final. ",
        "25. Qxa4": "Another foolish mistake by my enemy. ",
        "25... Nh6 26. c7+": "I don't want to seem harsh here... but that was just dreadful. My opponent has left a gaping hole in his right-forward-defence, leaving me easy passage to a mate. This silly move has done nothing but empahsize his childish 'tactics', the very scorn of great chess players. Like myself. ",
        "26... Rd7 27. c8=Q+": "I really thought my opponent would be better than this. ",
        "27... Kf7": "Brutal yet subtle yet malicious yet deadly yet yet yet. Yetty yet. ",
        "28. Qxc5": "My opponent, once again demonstrating his incompetence. His move seems effective, yet it bears no fruit in this game. Predictable and useless. NOTHING like my skilled moves. ",
        "28... Ra6": "See?",
        "29. Qxd7+": "I've run out of insults. ",
        "29... Kg8": "Skilled and deadly... almost professional in its execution. Oh wait... I AM a professional! Tee hee, silly me. ",
        "30. Qcc8#": "I believe it was the late 'Bungeeman' (what a silly name!) that used this mate against then-no.1 tehpwn3r (what a great name!), and beat him in a close match. \n\nHe obviously cheated you know. \n\nYeah. \n\n...\n\nObviously. "
    },
    "url": "https://gameknot.com/annotation.pl/epic-skillz?gm=43087",
    "gameName": "Epic skillz",
    "players": "bungeeman (1114) vs. tehpwn3r (1022)",
    "opening": "Van't Kruijs opening (A00)"
}