{
    "moves": {
        "1. d4 d5 2. c4 dxc4": "Queen's Gambit - this game took place in a mini-tournament, and this was the starting position for the tournament",
        "3. e4": "the 2nd most listed move in the game DB - Gives White a strong centre as well as threatening Black's c-pawn",
        "3... Nc6 4. Nf3": "developing, and protecting my d-pawn",
        "4... b5": "Black protects his c-pawn with his b-pawn",
        "5. d5": "forcing the knight away from its square - the only move where it can't be threatened is Nb8",
        "5... Nb4 6. Bd2": "developing and chasing away the knight",
        "6... e6": "this move both covers Black's knight and threatens to win a pawn with ....exd5   exd5 Qxd5, but then again, it could be too early for Black to bring out his Queen",
        "7. a3": "chasing away the Knight again, as it could be a problem on that square",
        "7... Na6": "not the best position for the knight",
        "8. Be2": "preparing to castle",
        "8... exd5": "wins a pawn, as mentioned, but instead of letting Black bring out his queen...",
        "9. Nc3": "I bring out my other knight to protect my e-pawn, with the added bonus of forking White's two pawns",
        "9... dxe4": "White captures, but missed a better move; 9.... d4, as; 10. Nxb5 d3 11. Bf1 and it not only traps White's bishop, but also prevents White from castling",
        "10. Nxe4": "although black is ahead by two points, he is not in a good posiition at this point; I have developed everything but my rooks and queen, and have centre control, but Black only has 2 pawns and a knight that is in a weak position",
        "10... Bf5": "Black finally gets his bishop out to a good square",
        "11. Nc3 b4": "a pawn exchange here may have been better for White, as it frees up White's left rook. Black probably was hoping to get his knight to c2, trading knight for rook, but castling easily prevents this. None of this happens, though, because...",
        "12. Qa4+": "King fork! now a pawn trade will become a knight trade, which here will suit White more because of development",
        "12... Bd7 13. Qxa6 bxc3 14. Bxc3": "and in addition, White wins a pawn from the exchange",
        "14... Be6": "? trying to prevent my bishop from taking the other pawn, but of course; 15. Bxc4 Bxc4 16. Qxc4 which leaves Black with no developed pieces whatsoever!",
        "15. O-O": "I didn't notice the move at the time, and castled instead",
        "15... Bd6": "Developing...",
        "16. Bxg7": "at the wrong time!",
        "16... Be5": "? Black hopes for a Rook-bishop exchange...",
        "17. Bxe5": "but I just take the bishop!",
        "17... Nf6": "White defends with the knight, but there's a flaw in his plan...",
        "18. Bxf6 Qxf6 19. Qc6+": "a 3-way fork this time!",
        "19... Ke7": "this is the only move that can save Black's rook...",
        "20. Qxc7+": "there's no way to save the pawn though",
        "20... Bd7 21. Bxc4": "I take Black's pawn and put my bishop in a strong position. There was also another purpose to this move, which Black fails to see...",
        "21... Rhc8": "seems like a good move, as the rook is prepared to win White's bishop, but better for Black would be Rhd8 (or Rad8) because...",
        "22. Rae1+": "White is now free to capture  the bishop!",
        "22... Kf8 23. Qxd7 Qxb2": "??? Black completely neglects to take the Bishop, and moves the only piece protecting from mate!",
        "24. Qxf7#": "checkmate"
    },
    "url": "https://gameknot.com/annotation.pl/ethankelly310s-mini-tournament?gm=26103",
    "gameName": "ethankelly310's mini-tournament",
    "players": "x-machine (1081) vs. jackmnolan (1156)",
    "opening": "QGA (D20), 3.e4"
}