{
    "moves": {
        "1. e4 e6": "The defining move of the French -- this is probably the first \"hypermodern\" opening, in the sense that it doesn't challenge white's claim to the center directly at first, but strikes back hard, and invites white to overextend.",
        "2. d4 d5": "This move is the strong point of the French defense -- either bypass it (the advance, 3. e5), capture it (3. exd4), or protect it (3. Nd2 or Nc3), but don't ignore it!",
        "3. Nc3": "I decide to develop this knight to its strongest square and defend the pawn.",
        "3... Bb4": "This is known as the Winawer variation, and is very hard for white to deal with, as white's a long way from castling, black threatens to win the e-pawn, and it looks like white will be stuck with doubled pawns on the c-file.  What to do here?",
        "4. e5": "At least this protects the pawn.",
        "4... Bxc3+": "?!  This move is okay, but I was expecting c5.  Black normally waits to capture until white does something to drive the bishop away (like a3), but I suppose Will didn't want to give me the chance to play something like Bd2.",
        "5. bxc3 c5": "This move is a lot less effective now.  I see I can win a pawn (temporarily) with dxc5, but the idea of having tripled pawns doesn't really appeal to me.  I'd rather develop some pieces.",
        "6. Qg4": "A strong move, forcing g6 (anything else loses at least 2 pawns).",
        "6... g6 7. Nf3 Qa5": "Threatening a ridiculously powerful fork.  I actually looked to see if a double-rook sacrifice would get me anything here...",
        "8. Bd2": "The answer is NO!  Bd2 seemed the best way to defend.",
        "8... Ne7": "A good way to get the knight into the game.  Also worth considering may have been Nh6 (tempoing the queen) followed by Nf5.",
        "9. Be2": "This is why I hate this variation of the French.  Look at my light-squared bishop.  Has a bishop ever looked more worthless?  Ever?\n\nIt makes a remarkable comeback...",
        "9... c4": "Making sure the bishop stays bad for a long time.  Sure, I've got the bishop pair, but what to do with it??",
        "10. O-O": "At the very least, my king will be safe over here.",
        "10... Nbc6": "Also, Will appears to be having trouble finding good things to do with his pieces.",
        "11. Qf4": "Maybe I can drum up a few threats on the kingside!  Qh6 followed by Bg5 looks strong...",
        "11... h6": "Prevents that idea...",
        "12. Qf6": "And this threatens the rook.  Of course it's easily parried, but I'm trying to disrupt black's plans, whatever they are.",
        "12... Rh7": "This square allows black to keep his pawn on h6.",
        "13. h4": "I figure if I'm going to have any chance at breaking through, a kingside storm is the way to go.  His pieces look pretty far from the kingside to me!",
        "13... Ng8": "!  Retreating to his home square is actually a VERY effective move... the queen doesn't have many good places to go.",
        "14. Qf4": "(Read: not many=this is the only one)",
        "14... Qd8": "I can hear the crowd on Will's side chanting \"De-Fence!\"  This is a good move, too.",
        "15. g4": "I'm still going for it -- this is maybe questionable, but I play better when I play aggressive.  (Don't tell that to rt4sm, who I'm 0-6 against!)",
        "15... f5": "I wasn't expecting that move at all!  I'm a little excited here, as I figure open lines can only help me.",
        "16. exf6 e.p.": "And now I realized that moves like g4 and h4 will leave my own king dangerously exposed!\n\nThis may not be best, but I thought it was a little safer than gxf5.",
        "16... Qxf6": "Hey there, sister.",
        "17. Qg3": "Of course, I figure keeping the queens on will benefit me.  I also didn't want to give him a free redeployment of his knight with QxQ.",
        "17... Qf8": "Is he planning Rf7?",
        "18. Ne5": "I'll nix that idea.",
        "18... Nxe5 19. Qxe5 Qf6": "Now, is there anything good for me other than exchanging?  Rf7 was impossible due to Qxe6, but if I don't take, well, that pawn on h4 is really bad all-of-a-sudden.",
        "20. Qxf6": "I had to.",
        "20... Nxf6 21. f3": "This'll ensure the protection of my kingside, as f3 keeps his knight out of... well, everywhere.\n\nIt's nice to notice that in a position this closed, black is waaaay behind in development, and it totally doesn't matter at all.",
        "21... Bd7 22. a4": "Having been stymied on the kingside, I decide to test the waters on the queenside.  a4 looks a little like a suicide run, though...",
        "22... O-O-O": "?  I've got to say, I don't understand this.  We're taught that castling is good, but I've just made an advance on his queenside and he seems to be inviting it.",
        "23. Rfb1": "I think the position totally called for this.",
        "23... Bc6": "...at least his bishop isn't any better than mine.  At this point, I figure my best shot to make something happen is to ram the a-pawn down his throat, play Bf4, and try to force the a-pawn through to a queening square by a rook sac on b6.",
        "24. a5": "Here it comes...",
        "24... Rdh8": "Oblivious to my plan...",
        "25. a6": "consistent, of course...",
        "25... b6": "And this plays into my plan -- bxa6 would've forced me to come up with a new one.",
        "26. Bf4": "I gotta say, this plan is looking pretty good, except... well, there's that little drawback that I'll have to sac a rook for the pawn, and then he can sac his bishop for my pawn, which just leaves me down the exchange.\n\nI'll see how he plays -- at least there's some pressure on him now, is my thought.",
        "26... g5": "Forcing the bishop to e5, which'll force him to play Rf8.  (hxg6 promises less -- I want to keep that h-file closed with the twin rooks there!)",
        "27. Be5 Rf8 28. h5": "keeping lines closed where his pieces are posted.",
        "28... Nd7": "And of course, if he can exchange his knight for my dark-squared bishop, I have nothing.  Therein lies, perhaps, the beauty of Will's defense -- I can play as hard as I can, and it is painfully hard to get any sort of advantage, or even a chance for one.  \n\nNote how incredibly ineffective *both* light-squared bishops are.",
        "29. Bd6": "Of course, I want to keep the bishop!",
        "29... Re8 30. Kg2": "My thought here is, if need be, I can push to f4, force an exchange, and then push g5, forcing another exchange, creating a passed pawn on the h-file.  Also, the light-squared bishop is now free to move as the king will guard f3.",
        "30... Nb8": "?  This *begs* for a rook sacrifice!  My head was swimming with winning lines and variations, and I jumped on it...",
        "31. Rxb6": "!?  Not a full exclam, because there is a defense that leads to rough equality -- there's no way he'll find it, though, is there?",
        "31... axb6 32. a7": "And now I expect Nd7, a8=Q , BxQ, RxB , Nb8 (or Kb7, losing the rook), Rxb8 , Kd7, Rb7 , KxB, RxR and white emerges a piece up.",
        "32... Na6": "!  He finds the best move, giving back a knight to play Kb7, stopping white's attack.",
        "33. Rxa6 Kb7": "And now I've got to back off.",
        "34. Ra1": "The best square, as the rook is mobile on the 1st rank.",
        "34... Ra8": "?!  This isn't necessary, as now his rook becomes worth exactly one bishop and one pawn...",
        "35. Bb8": "! Now, that's what I call a prison!",
        "35... Rh8": "Remember what I said about my kingside plans for pushing pawns?  Well, now's the time; his pieces are in no position to deal with the king, rook, and bishop all actively posted!",
        "36. Kg3": "And here it comes!",
        "36... Kc8": "Black knows he's got to get to the kingside, but how to do that effectively?",
        "37. f4": "In the meantime, I'm content to keep on working on making that passed pawn a reality.",
        "37... gxf4+ 38. Bxf4": "Bxf4 instead of Kxf4 -- it's really a wash.  I'll have to play Bb8 after Kb7 or Kg3 after Rc8 ; I decided that having his king on b7 is better than his rook on c8.",
        "38... Kb7 39. Bb8 Kc8": "There is no way he can get to the kingside quickly enough.",
        "40. Kh4": "Preparing g5.",
        "40... Rg8": "A stopgap measure.  At this point I realize I've got a won game, even though I'm still down a pawn.",
        "41. Rf1": "My rook is really strong here -- his rook on g8 is doomed to defensive duty and his Ra1 is like Mumm-Ra in his sarcophagus!",
        "41... Bd7": "Anticipating the forthcoming Rf6; but black is objectively lost here.",
        "42. Rf6 Rh8": "Otherwise h6 falls.  Now I can proceed with g5 unhindered, however.",
        "43. g5 hxg5+ 44. Kxg5": "And now I've got my passed pawn on h5; all I have to do is be careful not to blunder it and black will have to exchange a piece for it.",
        "44... Rxb8": "Stalling, and this will have the drawback of bringing the king even farther away from the kingside.  Black should've played this long ago; it would've saved him at least 2 tempos.",
        "45. axb8=R+ Kxb8 46. Bg4": "!  What a comeback by the light-squared bishop; its entrance into the fray is immediately decisive!",
        "46... Be8": "Black doesn't have any good way to deal with the passed pawn...",
        "47. Rxe6": "But I'll take the freebee.",
        "47... Kc7": "Bringing the king into the action -- but it's way too late.",
        "48. h6": "Now the king is going to be unable to tend to the pawn after Rg8 , but the rook's protection is more than sufficient.",
        "48... Rg8+ 49. Kh4": "The best way to keep my pieces mobile.",
        "49... Bg6": "This is the most tenacious move -- white must find the proper continuation.",
        "50. Re7+": "White finds the proper continuation -- black will be in a lot of trouble after Rg7.",
        "50... Kd6": "Trying to get to the action...",
        "51. Rd7+": "!  A wonderful in-between move that forces the king away from the action again.",
        "51... Kc6 52. Rg7": "There is no way for black to stop the pawn now.",
        "52... Rxg7 53. hxg7 Bh7": "Allows black to hold out a little bit longer.",
        "54. Kg5 Kd6 55. Kf6": "And this keeps the black king away from the pawn on g7.",
        "55... Bg8": "Trying to defend; this keeps the king away from f7.  There's no good defense to Bh5 followed by Bf7.",
        "56. Bh5 b5": "What else?  Black is hopeless here.",
        "57. Bf7": "Offering an exchange.",
        "57... Bh7": "Now, I could win the bishop for the pawn by promoting, but there is an even better continuation...",
        "58. Kg5": "!  Now white gets a new queen.",
        "58... Ke7": "Threatening the light squared bishop...",
        "59. Kh6": "!  But this is the end, folks.  After KxB, KxB, there is no way to prevent g8=Q, and so black resigns.\n\nThanks to Will for a very difficult game -- I'm proud to have pulled this one out!"
    },
    "url": "https://gameknot.com/annotation.pl/ethans-revenge?gm=9831",
    "gameName": "Ethan's Revenge!",
    "players": "ethansiegel (1730) vs. remybear (1497)",
    "opening": "French (C16), Winawer, advance variation"
}