{
    "moves": {
        "1. Nf3 d6": "The first white’s move prevents to black e5. If black wants to occupy e5 must first prepare the drive (it’s ok also d5 or c5",
        "2. g3 e5": "Natural follow-up of the English game",
        "3. Bg2": "The bishop on g2 exerts pressure on the squares e4 and d5",
        "3... f5": "This is the third consecutive move of the black pawn. It 'a bit' risky and not advised to move a lot of pawns at the beginning, better is to try to develop the pieces. In this case it is not an error, in fact, the pawn f5 increases the weight at the center and attacks c4",
        "4. c4": "white seeking control of the central squares d5 and in particular d5",
        "4... Nf6": "a natural response to capture the white’s",
        "5. b4": "ambitious move that seeks to put pressure on the side of the black queen",
        "5... e4": "Be7 would have been better. Black has moved twice the same piece just to annoy the white Knight, freeing up the diagonal for the white Bishop",
        "6. Nd4 d5": "is the fifth move of the black pawn. At this point he should have realized the risk and prefer to release the side of King",
        "7. cxd5 Nxd5": "with … Qxd5 black allows to white the best variations",
        "8. b5": "This advance makes difficult to move Kb8\n\n",
        "8... Nf4": "Black tries to dub the white pawns",
        "9. gxf4": "forced",
        "9... Qxd4 10. Nc3": "white contrasts the move on the Rook with a useful developing move",
        "10... Bc5": "Black threatens mate in one move, but white can avoid it with gain of time",
        "11. e3": "White realizes the black’s plans",
        "11... Qc4": "normally is not wise to play aggressive moves with the Queen  in the first stage of the game because, when she is opposed, is squeezed and causes loss of time",
        "12. Bb2": "The Bishop occupies the weakened diagonal",
        "12... O-O 13. Rg1": "the pressure on g7 becomes dangerous. The white, playing Bf1, he discovers the tower and wins time",
        "13... Rf7": "a weak defense of g7",
        "14. Rc1": "White starts the attack",
        "14... Qb4 15. Qc2": "White defends the bishop",
        "15... Bd6 16. Nd5": "The final attack begins",
        "16... Qxb5 17. Nf6+": "was also excellent Bf1",
        "17... Kh8 18. Bf1": "This attack, long awaited, is decisive. After Bc4, the two Bishops, are aimed at parallel diagonals and send the defenses of the black in panic",
        "18... Qxb2": " a desperation’s move?)",
        "19. Qxb2 Rxf6": "in exchange for the queen, black has got two minor pieces and a pawn that could help him to keep playing. But you remember my note about the developmental delay of the pieces?",
        "20. Qxf6": "the white look for the simplest solution to make a final with higher pieces quality",
        "20... gxf6 21. Bc4": "now black has to give a piece",
        "21... Be6": "after 21…. H6 22. Rg8+ Kh7 23. Rxc8, black, as well losing in quality, is nailed on the last line",
        "22. Bxe6 Na6": "Black avoids the checkmate on g8, but his situation is hopeless",
        "23. Ke2": "black can’t save f5",
        "23... Nc5": "black tries to save e4",
        "24. Bxf5 Rd8 25. Rg4": "(the white menace 26.Rh3, after  25…Rg8 26.Rxg8+ Kxg8 27.Rg1+ Kh8, the game is over) 1-0 "
    },
    "url": "https://gameknot.com/annotation.pl/europe-cup-slough-1997?gm=50238",
    "gameName": "Europe Cup , Slough 1997",
    "players": "Chernin  vs. Van der Wiele ",
    "opening": "Reti opening (A04)"
}