{
    "moves": {
        "1. d4": "Baadur is well-known as a very creative and sharp chess player. Therefore, my plan for the game was to play solid chess and stay away from complications, which is probably Baadur's strongest side. By move 10, it was clear that something went wrong..",
        "1... Nf6 2. Nf3": "The first interesting moment, already on the second move. Baadur periodically plays the Budapest gambit, but that day I did not want to see it on the board. The first four moves I tried to play some solid chess, but then had to fight to get my Pawn back.",
        "2... d5 3. c4 c6 4. Nc3 dxc4 5. a4 Bg4": "?! A well-known line, which has a reputation of being dubious. Even though I thought that knew the refutation, (as I had played a similar game a few years earlier) it turned out that things are not so simple.\n5...Bf5 is the main line.",
        "6. Ne5 Bh5 7. f3": "! The most principled answer and I believe that the strongest one.",
        "7... Nfd7 8. Nxc4 e5": "! The point of Bg4 line.  Now both captures lead to a good position for black, so white has to come up with something stronger.",
        "9. e4 Qh4+ 10. g3 Qf6 11. dxe5 Qxf3": "11...Nxe5 12.Nxe5 Qxe5 13.g4 Bg6 14.f4 Qf6 15.f5 Qh4+ 16.Kd2! and White is clearly better as in my chess game against Ipatov, but black did not get enough compensation for the bishop.",
        "12. Nd6+": "I was satisfied with my chess position since I knew that Bxd6 is losing for black and I could not believe that Ke7 can be actually playable.",
        "12... Ke7": "! Frankly, at first I was sure that the game would not last more than 10 more moves with such a King on e7 and a powerful knight in the attack. I had a feeling that the checkmate was not far away. .But the more I was thinking about the position, the more clearly I was realizing that there was no checkmate. Moreover, Black has his own active counterplay. Things got tricky, so for the next move I spent about 30 minutes.\nIf 12...Bxd6 13.Qxd6 Qxh1 White wins after 14.Bg5 f6 15.exf6 gxf6 16.Qe6+ Kf8 (16...Kd8 17.Bxf6++–) 17.Bh6 checkmate!",
        "13. Qb3": "The position looks kind of wild, but actually the next several moves are more or less forced for both sides. The toughest part was to find the upcoming Rg1 idea followed by Nd5, otherwise Qb3 would be just bad.",
        "13... Nxe5 14. Qxb7+ Kf6": "! It's not every day you see both queens get almost to the corner of the board to hunt the rooks. Not to mention that f6 is not the most common square for Black's king with a full board of pieces. Now Rg1 with the idea of Be2 looks very strong However, unfortunately, my queen is also getting trapped, even though that was not so clear from this position, considering that my queen has a number of squares to go right now.\nIf 14...Kxd6 then simply 15.Rg1.",
        "15. Rg1 Bxd6 16. Be2 Nbd7": "!",
        "17. Bxf3 Nc5": "?! Oops, it turns out that the White queen has no squares to retreat to, since 18. Qb4 runs into 18…Nd3+. But, here comes the help from the knight, which had to be foreseen in advance. Due to the fact that my next move white saves the queen, 17…Bf3 deserved serious attention.\nThen after 18.Qb3 Nc5 19.Qc2 g6! I am not sure how to evaluate the position, but I have a feeling that Black's play should be a bit easier as its pieces are much more active and the King hides well on g7.",
        "18. Nd5+": "!",
        "18... cxd5 19. Qxd5 Nxf3+ 20. Kf1 Be5": "!",
        "21. Qxc5": "Here a new stage of the game begins. With an extra queen, objectively White's position is close to winning. However, it is very easy to make a mistake.",
        "21... Rac8 22. Qf2 Bd4 23. Be3 Bxe3 24. Qxe3 Nxh2+ 25. Kg2": "?  I don't think I spent more than a minute on this move, but the computer shows a crazy balancing act of White's king with 25.Ke1! Nf3+ 26.Kf2 Rc2+ 27.Kf1 Nh2+ 28.Ke1 Nf3+ 29.Kd1 and white should win.",
        "25... Rc2+ 26. Kh3 Bg4+ 27. Kh4 h5": "I can't say that I felt very comfortable with the king on h4, but as we say in Russia: “If you are afraid of wolves, don’t go to the woods”. So I began to look for the ways to escape with the King without losing the queen or rooks along the way.",
        "28. Qg5+ Ke6 29. Qd5+ Ke7 30. Qb7+ Kf8": "? A serious mistake, which allows White's king to run away. Much stronger was 30...Bd7! 31.Kg5 Rh6!, getting the last piece into play. For those who are interested, you can turn on the engine and see that its evaluation is as usual: triple zero. That means it is a forced draw somehow. But, from the human's point of view, the position is far from being clear and all three results are possible.",
        "31. Kg5": "! ",
        "31... f6+ 32. Kf4 Re2": "I would love to confirm the myth of my extraordinary calculating chess abilities, but unfortunately I simply overlooked this move and its powerful threat of g7-g5 checkmate. So I began to frantically look for a perpetual check which I failed to find...The whole game flashed in my head, and it felt so disappointing to lose the game after such a heroic King escape.. Thus, the combination with a Queen sacrifice which led to the endgame with a big advantage for White was born out of desperation.",
        "33. Qb4+ Kg8 34. Qc4+ Kh7 35. Qxe2": "!",
        "35... Bxe2 36. Rg2": "! White wins one of the pieces and gets the endgame with a good winning chances. Baadur did not defend the best way, but I can understand his disappointment, when instead of a mating attack he had to fight for a draw in an unpleasant chess endgame.",
        "36... g5+ 37. Ke3 Ng4+ 38. Kxe2 Rb8 39. Kd3 a5 40. Kc3 Kg6 41. b3 Rc8+ 42. Kb2 Re8 43. Re1 Ne5 44. Rd1 Nf3 45. Rd5 Rxe4 46. Rxa5 h4 47. gxh4 Nxh4 48. Rc2 g4 49. Ra8 Kf5 50. a5 g3 51. Rg8 Re5 52. b4 g2 53. a6": ""
    },
    "url": "https://gameknot.com/annotation.pl/european-chess-championship-yerevan-2014?gm=65646",
    "gameName": "\"European Chess Championship Yerevan, 2014\"",
    "players": "GM Alexsandr Shimanov (2649) vs. GM Baadur Jobava (2716)",
    "opening": "Queen's pawn game (A46)"
}