{
    "moves": {
        "1. c4": "The English opening.",
        "1... e5": "Black grabs the center.",
        "2. Nc3": "White develops his knight behind the pawn and takes control of the white central squares.",
        "2... Nf6": "Black contests the center and prepares for castling.",
        "3. d3": "Supports c4 and stops ...e4",
        "3... d5": "Initiates a trade of a central pawn for a good knight outpost.",
        "4. cxd5 Nxd5": "Excellent outpost for the knight.",
        "5. g3": "Prepares a fianchetto.",
        "5... Nc6": "Develops the knight.",
        "6. Bg2": "Completed the fianchetto. And puts the knight on d5 under fire.\nThe whole game will revolve around the h1-a8 diagonal.",
        "6... Be6": "Protects the knight and develops the white bishop.",
        "7. e3": "White prepares d4 and temporarily locks in the dark bishop ",
        "7... Be7": "Bb4 is an option but stretches Blacks resources. Black has already a good hold of the center.\nHence Be7 is a good move and enables castling.",
        "8. Nge2": "* enables castling\n* develops a knight\n* supports the d4 advance",
        "8... O-O": "Bring the king to safety before committing oneself to uncertain campaigns.\n",
        "9. O-O": "ditto",
        "9... a6": "Takes the b5 square from the c3-knight.",
        "10. d4": "Here we go! A little central activity.",
        "10... exd4": "Forced: 11.dxe5 would have discovered a third attacker against Nd5\nI would have loved 11...e4 but that looses the pawn\n",
        "11. exd4 Bf6": "Put more pressure on the d4 pawn.",
        "12. Be3": "Protects the pawn.",
        "12... Nce7": "Ne7 supports Nd5 and enables the advancing of the queen-side pawns.\n\nMy long term target is the isolated pawn on d4\n",
        "13. Nf4": "Attacks d5 but fails after...",
        "13... Nxc3": "which gives me an excellent outpost on c4 and releases the pressure on d5.\n",
        "14. bxc3 Bc4": "Alternatives:\nc6 to protect my pawns and against d5\nor\nBc4!? grabs the outpost and avoids 15.Nxe6 \n",
        "15. Re1": "I wouldn't have played 14...Bc4 against a stronger player:\n15.Bxb7 would have been complicated: 15...Rb8 16.Rb1! Bxf1 17.Kxf1",
        "15... c6": "* Protects b7 \n* Takes control of d5\n* Opens the a5-d8 diagonal for the queen",
        "16. Qa4": "Threatens the bishop",
        "16... b5": "Natural follow up move - cements the bishop on c4. It will take the knight at least two moves to unsettle the bishop \nBecause of Qa4 - with tempo",
        "17. Qb4": "The queen is going to c5 which is a good outpost for White.",
        "17... Re8": "Seizes the open file and protects the knight.\nI will soon need to move the dark bishop or the queen and I don't want any tactics against the knight\n",
        "18. Qc5": "Threatens c6.\n\nThe queen has a good position here with many possibilities. It is also safe against short term threats from  Black's minor pieces.",
        "18... Rc8": "c6 needs another defender. \n\n",
        "19. Nh5": "I think White contemplated 19.Qa7 threatening a6. But this fails after ...a5.\nInstead White decided to remove the dark bishop. Black's dark bishop is putting lots of pressure on the c3-d4 pawns.",
        "19... Nd5": "Black don't want to take back with a pawn. Instead  19...Nd5\n* protects the bishop twice \n* threatens the c3 pawn. \n* still protects the c6 pawn by blocking the h1-a8 diagonal.\n\nNot bad with one move.",
        "20. Nxf6+": "White continues with his plan.",
        "20... Qxf6": "Best is to take back with the queen.\n* Makes the queen more active.\n* Binds the rooks\n* Keeps the pressure on the c3-d4 pawns.\n* Protects the c6 pawn so the knight can move.\n",
        "21. Bxd5": "? Defends c3 by removing the attacker. But this exchanges the light bishop for a knight. This means that the Black's light bishop can seize the h1-a8 diagonal.",
        "21... Bxd5": "The exchange ends with the bishop on the deadly h1-a8 diagonal shooting directly against White's king. Black dreams of Qg2 which ends the game.",
        "22. f4": "Takes away f3 from the queen.",
        "22... Qf5": "Putting the queen on the same color as the bishop to give me maximum flexibility. \nWhite it terribly weak on the light squares.",
        "23. Qa3": "The queen retreats:\n* defend the second rank (23...Qh3 24.Qb2) \n* threatens a6.",
        "23... Rxe3": "Re3!? My plan is to:\n* remove the dark bishop, which is a good defender: a queen invasion Qc2 is blocked by Bf2\n* invade on Qc2 - threatening mate on g2.\n* check on g1 and gobble up the rook: Kf1 Qg1  Kd2 Qxa1",
        "24. Rxe3": "Black is now vulnerable on the e-file, back-rank and a6 and must keep the initiative. ",
        "24... Qc2": "Qf2# is imminent and cannot be blocked for long.",
        "25. Kf1": "Forced, the only way to avoid mate.",
        "25... Qg2+ 26. Ke1 Qg1+ 27. Kd2": "All according to plan when I realized that Qxa1 looses after 28.Re1! and the queen is trapped! I should have calculated one more move before sacrificing the rook.\n\nActually mate can be forced in 10 moves after 22.Qa3.\nA sample variation is 23. Qa3 Qe4 24.Re2 Qh1  25.Kf2 Qf3  26.Ke1 Rxe3 27.Qf8  Kxf8 28.Rxe3 Qxe3  29.Kf1 Qf3  30.Ke1 Re8  31.Kd2 Re2  32.Kd1 Qf1#",
        "27... Qxh2+": "Gobbling pawns is another way to compensate for the sacrifice.\nWhite gives up at this point - probably premature. The possible continuation 28.Re2 Qxg3 29. Re1 Qxf4  30.Kc2 is a very sharp and uncertain position"
    },
    "url": "https://gameknot.com/annotation.pl/europe-v-rest-of-the-world-tournament?gm=15541",
    "gameName": "Europe v. Rest of the World Tournament",
    "players": "emad_ramzy (1574) vs. johanpiper (1825)",
    "opening": "English opening (A22)"
}