{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Bc4 Bc5 4. b4": "The Evans Gambit.   This was the starting point for all games in the tournament.   Lazybishop had gotten a nice combination to beat me in 16 moves in the first game, with me as black.   Revenge was called for!",
        "4... Bxb4 5. c3 Ba5": "Far more common than 5. ... Be7 per the game database, though both give white a similar edge.   My last annotated game was also an Evans Gambit game; then, stronger players than myself gave 5. ... Be7 as the stronger move.",
        "6. d4 exd4 7. Qb3": "The main line is 7. O-O; I think this line is sharper, if not necessarily better?",
        "7... Qe7": "This or 7. ... Qf6 is pretty much forced; I dunno is 7. ... Qf6 a small bit stronger?",
        "8. O-O Bb6": "Not that commonly played per the game DB, though it has the highest rating attached, and the best score for black.",
        "9. cxd4 Nxd4 10. Nxd4 Bxd4": "White is two pawns down, but way ahead in development.   My kind of opening!",
        "11. Nc3 Nf6": "Still following eight games on the DB.   Black is now ready to castle.   I'd rather he didn't, of course.",
        "12. Ba3": "Only played in one of the eight games, though it seems to me the obvious move.   12. ... d6 is almost forced, but then an e5 push becomes stronger.",
        "12... d6 13. Rad1": "I'm not too worried about losing the pawn on e4; at the moment, it'd just help to open lines for me.",
        "13... Be5": "13. ... c5 looks awkward for black after 14. Nb5, hitting the bishop and the new weakness on d6.   Black could and probably should have taken on c3 here; we've rejoined some other games in the game DB, and in all five games in this position, 13. ... BxN was played (with a 60% score for white).",
        "14. f4": "Now BxN is forced anyway.",
        "14... Bxc3 15. Qxc3 Nxe4": "Three pawns down!   Here, black had the alternative option 15. ... O-O, when I was planning 16. e5 Ne4 17. PxP NxQ 18. PxQ Re8 19. Rd8 Be6 20. BxB PxB 21. Rf3, when I think white's pawn on e7 will decide.   I'm not sure what black can do to improve on that line - 16. ... Ne8 17. Rd3 (stronger, I think, than Rfe1 - the rook's going to come to g3 and add more pressure to the king), and white can swap pawns, play 19. Bb3 threatening mate, and after the relieving 19. ... Qf6 20. QxQ PxQ 21. Rg3+ Kh8 22 BxP#.   After 19. ... Nf5, the simple 20. g4 wins a piece and keeps the g-file open for the rook.",
        "16. Qxg7": "Success in stopping black castling kingside anyway.   The knight is the target now.",
        "16... Rf8": "Forced.",
        "17. Rde1": "Logical to start ganging up on the knight now.",
        "17... Bf5": "Again, logical, completing development and \"threatening\" to castle.",
        "18. Qd4": "To meet 18. ... O-O-O with 19 QxP, while also adding more pressure to the knight.",
        "18... Kd8": "Making space for the rook.",
        "19. Bd5": "Winning more material.",
        "19... Re8 20. Bxb7": "So just the one pawn down now.   Black's pawns are scattered, his pieces are uncoordinated and his king stuck in the centre, pins abound...   Have to be happy as white here!",
        "20... c5": "Attacking the bishop and the queen, though providing a further tactic a couple of moves down the line.",
        "21. Qd5": "Forced, with the advantage of hitting black's bishop too.",
        "21... Rb8": "I can't forget that I'm material down here, so the swap of pieces doesn't suit.",
        "22. Bc6 Qe6": "Again, the swap doesn't suit.   Black's defending fairly doggedly here, I think.",
        "23. Qd1": "Black's rook is still hanging, of course.",
        "23... Rg8": "Hoping for chances down the g-file.   White has to be careful.",
        "24. Bxc5": "Taking advantage of the pin on the knight to pick up another pawn.",
        "24... Rc8": "? I think 24. ... Qg6 is called for here; 25. BxN BxB 26. g3 seems forced, when there's a threat of 27. RxN QxR 28. QxP+ and a possible mating attack with the f-rook to join the attack.",
        "25. Bxe4": "Better than 25. Bd5, when ... Qg6 threatens mate, with my bishop on c5 still hanging.",
        "25... Rxc5 26. Bxf5 Qxf5 27. Qxd6+": "Material up now, and the three heavy pieces are bearing down on black's king.",
        "27... Kc8": "Only move.   (27. ... Qd7?? 28. QxR)",
        "28. Qa6+": "Here, I missed 28. Rb1 - a better way to continue the attack.   The only defence to Rb8# seems to be 28. ... Rb5, which allows my f-rook into the attack with tempo.   The text is winning too, but nowhere near as clear-cut.",
        "28... Kd7": "28. ... Kb8 29. Rb1 and the a-pawn is gone anyway.",
        "29. Qxa7+": "An important pawn to gain; black has fairly little to play for if the game reaches an ending.",
        "29... Kd6 30. Qe7+": "I want to bring my rooks into the attack, but don't want black's king escaping to f6 and g7.   This keeps black's king in the open while I call up the rooks.",
        "30... Kc6 31. Red1": "Again, 31. Rb1 probably causes black more problems.   But here, he figured the best way to proceed was to swap off, which suited me.",
        "31... Qe6 32. Qxe6+ fxe6 33. Rdc1": "Endiing any chances of annoying double-rook counterplay.",
        "33... Rxc1 34. Rxc1+ Kd5 35. Re1": "Stopping the king encroaching on my kingside majority, and also restricting the e6-pawn's movement.",
        "35... h5": "??",
        "36. Re5+": "The rest is trivial enough.",
        "36... Kd6 37. Rxh5 Ra8 38. Kf2 Rxa2+ 39. Kg3 Ra3+ 40. Kg4 Ra2 41. g3 Rf2 42. h4 Re2 43. Rg5 Re5": "Oops!",
        "44. Rxe5": "And black resigned."
    },
    "url": "https://gameknot.com/annotation.pl/evans-gambit?gm=46471",
    "gameName": "Evans Gambit",
    "players": "cdeburca (1675) vs. lazybishop (1601)",
    "opening": "Evans gambit (C52), compromised defence"
}