{
    "moves": {
        "1. e4": "Good chess player's might think this isn't a really high level game and not much to learn from, but I believe it's a highly competitive and hard fought game with both players showing their moments of (desperate?) attacking chess depending on each ones waving conditions... In addition we did chat a lot about the game and each other lives and countries. I loved this game in all it's fractions and levels. THANK YOU brhan for a memorable game and valuable time spent!!!",
        "1... e5 2. f4 exf4 3. Nf3 d6": "Chess opening:vC34; KGA, Fischer defence. My really weak part in chess is the opening game, but after my first annotated game here at GK, pointing out my limitations in the opening, a master player kindly tipped me to use the game database(game DB) here at GK. This you will find as a option at bottom in the box of the game you are playing...",
        "4. d4 Bg4 5. Bxf4 Qe7": "GK game database; 5...Qe7 6 games, 66% white win, 33% black win, 0% draws. \r\nThe game DB shows that black's move mostly favour white, but with only 6 games played like this, it isn't really much to rely on. In my opinion, black's queen move is blocking the black squared bishop, which is not a according to basic rules of development in chess opening...",
        "6. Bd3": "And by this move I'm contributing to a totally new variation of this opening here at GK :-) Now I'm \"violating\" basic and general opening theory which states that knights should(in general) be developed prior to bishops. To play Nc3 instead of my 6. Bd3 at this position covers basic needs for white, which initially has the task of protecting e4 in the battle for centre playground domination. In addition, moving 6. Nc3, the game DB shows a 75% win for white......",
        "6... Nc6 7. Nbd2": "My plan by this move was to replace the f3 knight and subsequently protect the d4 pawn, but as usual I overlook rather simple conditions in the opening, like my  Nf3 being pinned and therefore not really protecting pawn d4. ",
        "7... Nxd4": "pawn lost",
        "8. O-O O-O-O 9. h3 Bh5 10. c3 Nxf3+ 11. Nxf3 h6 12. Qa4": "So far I don't feel threatened by while no black pieces are pointing towards my king side and I feel that black's queen move is still hampering the development. So I'm thinking this is the time to exploit the developed advantage and equalize(or even gain) in material.",
        "12... g5": "And now I was following up my idea of keeping the developed advantage, not getting intimidated and pushed into retreating/defensive playing, even sacrifacing a piece",
        "13. Qxa7 gxf4 14. Qa8+ Kd7 15. Bb5+ Ke6 16. Nd4+ Kf6 17. Qxb7 Re8 18. Rxf4+": "Here I have to admit I was feeling really good even though I didn't really see the continuation. This because literally all of black's pieces are imprisoned.  When analyzing this position I never dreamed black would move 18...Kg7, because then 19. Nf5 , forking black's king and queen... Hence I was expecting Kg5, threatening my rook and therefore I prepared Bxe8 in my mind. NEVER MOVE WITHOUT CONSIDERING THE OPPONENTS LAST MOVE!!! Again basic knowledge, but still it slip now and then",
        "18... Kg7": " ?? BLACK BLUNDER! Black has just invited white for a clean kill and what does white respond?",
        "19. Bxe8": "? WHITE BLUNDER! Obviously white(that is I) consider this as a petition for mercy, simply because black's actual move was ruled out as a possibility in white's mind.",
        "19... Qxe8": "I was of course disappointed of completely forgetting 19.Nf5 , but still I considered having a superior position because of black's inactive pieces and I have now also have a material advantage. What is the best continuation for white? The big task for black is to quickly activate the pieces",
        "20. Qxc7 Bg6": "I'm sure black has a better move...Maybe Be7 then Nf6... and the rook is partly free.",
        "21. Raf1 Be7 22. e5": "Trying to keep up the initiative",
        "22... dxe5 23. Qxe5+ Kh7": "Here I was looking for something which could attack black but couldn't find anything to open up the cramped defense and I ended up with pushing pawns",
        "24. b4 h5 25. b5": "I'm still feeling good about this game",
        "25... f6 26. Qd5 Qc8 27. Nc6 Qc7 28. Nxe7": "This move I did regret immediately after, because here I'm giving black the chance to develop the pieces. Maybe just continued pushing pawns?",
        "28... Qxe7": "First I thought black taking back with the queen was not that good, but then I see Qe3  and realize this might cause trouble for me",
        "29. Kh2 f5": "I must admit I was a bit surprised how strong black's defense appeared at this point",
        "30. a4 Nf6 31. Qd4 Rd8 32. Qf2": "Here I was also considering Qb4, but didn't find that one a good move (32.Qb4 Qxb4 and then black move Nd5)",
        "32... Qc7": "This move disturbed me, getting the feeling I'm now losing the initiative, because now black is pinning down my f4 rook and threatning a pawn. But then I thought I did find a suitable move, overlooking black's next one...",
        "33. Qg3 Ne4": "Here I had too smile and realizing I was right in losing the initiative ",
        "34. Qe3 Qxc3 35. Qxc3 Nxc3 36. Rc4": "I told my nice opponent he truly was back in the game and that my confidence in this game was considarably damaged. He claimed my position still being better ",
        "36... Nd1": "Here I saw black's Ne3 coming but didn't feel that fork of my rooks threatning because I have Rc7  and then able to save both rooks from the fork",
        "37. b6 Ne3 38. Rc7+ Kh6 39. Rb1": "Now I felt very good again and thinking my opponent was right in me having a better position and now further improved",
        "39... f4 40. b7 Nxg2": "A sacrifice! At first I thought he was just trying to confuse me and highlighted my pawn for a move. Then I remembered a recent game I played vs. packermandan (bd=8634663) where I was in material advantage(pawn promoted to Q) but where the opponent then managed to perform perpetual check just by the use of a rook and knight, making a draw. So I decided to first get rid of the knight",
        "41. Kxg2 Be4+": "This was an unpleasent move because I just have to admit black really knows how to fight for survival :-) But after looking through it again I realize this isn't really problem...",
        "42. Kg1 Rg8+ 43. Kf1 Rb8 44. a5": "White blunder! A couple of moves ago losing the b1 rook wasn't a problem, but now it is",
        "44... Bxb1 45. Rc6+ Kg5 46. Rb6 Bd3+ 47. Kf2 Kh4 48. Kf3 Kxh3 49. Kxf4 Kh4 50. Ke3 Bf1 51. Kf2 Bc4": "Black mistake, white pinning down the bishop. My suggestion here was Bd3",
        "52. Rb4 Rf8+": "Now I just thought; find a hidden place for the king, away from the rook...",
        "53. Kg2 Rg8+ 54. Kh2 Rb8 55. Rxc4+ Kg5 56. a6": "Thank you very much for the game, but first of all for a good chat during the game. "
    },
    "url": "https://gameknot.com/annotation.pl/everyday-players-2?gm=12499",
    "gameName": "Everyday Players #2",
    "players": "norjoa (1560) vs. brhan (1548)",
    "opening": "KGA (C34), Fischer defence"
}