{
    "moves": {
        "1. Nf3": "Hi everyone!\n\nIn this unrated game my opponent launches a kingside mating attack which included a speculative exchange sacrifice.  Somehow I managed to beat this one off and later on in the game I returned the compliment.  But which player triumphed?  Well, read on and see.  I start this game with my now usual Reti Opening 1.Nf3.",
        "1... Nf6 2. c4 g6 3. Nc3": "3. Nc3 - development.",
        "3... d5 4. cxd5 Nxd5": "4. ...…. Nxd5 - pawn trade.",
        "5. Qa4+ Bd7 6. Qh4": "6. Qh4 - Glenda is waiting to welcome the BK should he go kingside.",
        "6... Nb6 7. d4 Bg7 8. Bh6": "8. Bh6 - threatening the usual fianchetto bishop trade off to weaken the black squares on the kingside.",
        "8... Bf6 9. Qg3 e6 10. e3 Bc6 11. Bb5 a6 12. Bxc6+ Nxc6": "12. ……. Nxc6 - bishop trade.",
        "13. a3 Qd7 14. Rd1 O-O-O 15. O-O": "15. 0-0 - both players castle on opposite sides.  This usually means a kingside/queenside mating attack race.  ",
        "15... Nd5 16. Nxd5 Qxd5": "16. ……. Qxd5 - knight trade.",
        "17. Bg5 Bxg5 18. Qxg5": "18. Qxg5 - bishop trade.",
        "18... f5": "18. …… f5 - declines queen trade.",
        "19. Qg3 g5 20. Qxg5": "20. Qxg5 - Ella offers a pawn and Glenda zaps it.  But is it a mistake?  We shall see.",
        "20... Rhg8 21. Qh5 Rg4": "21. ….. Rg4 - preparing to double.",
        "22. Nh4 Qe4 23. g3": "23. g3 - now Henry is starting to feel a little draughty.  Thank heaven Ella's light square bishop is off the board.  Queen Ella would certainly be much more of a threat than she is now.",
        "23... Rd7 24. Ng2 Qf3": "24. ……. Qf3 - Queen Ella comes further in but Glenda also has ideas of gatecrashing black's position.",
        "25. Qe8+ Nd8": "25. ….. Nd8 - the only way to avoid losing a second pawn (e6).",
        "26. Rdc1 Rgg7 27. Nf4": "27. Nf4 - threatening Nxe6.",
        "27... Rde7 28. Qh5 Rg4": "28. …… Rg4 - declines queen trade.",
        "29. h3 Rxg3+": "29. ….. Rxg3+ here is Ella's rook sacrifice.",
        "30. fxg3 Qxg3+ 31. Kh1 Qxe3": "31. ….. Qxe3 - Queen Ella mercilessly zaps my pawns.",
        "32. Qf3 Qxd4": "32. ….. Qxd4 - Queen Ella does not Zap Glenda and instead zaps yet another white pawn.",
        "33. Rc3 Nc6 34. Rg1": "34. Rg1 - threatening Rg8+",
        "34... Re8 35. Rd1 Qf6 36. Rxc6": "36. Rxc6 - Here is my exchange sac and this prompts an immediate resignation on the grounds of ruinous loss of material as if Ella accepts it, Glenda will take on c6 threatening both Qa8# and Qxe8+ Qd8, Qxd8#.  This is now my third Expert Victory - what a twist!"
    },
    "url": "https://gameknot.com/annotation.pl/exchange-sacs?gm=66240",
    "gameName": "Exchange Sacs!",
    "players": "jotheblackqueen (1912) vs. el1a (2015)",
    "opening": "Reti opening (A05)"
}