{
    "moves": {
        "1. d4": "Once again,i'm boored so i decided to annotate one of my recent interesting games. I'm playing with the white pieces.",
        "1... d5 2. c4 e6": "The game became a QGD",
        "3. g3": "normally Black plays Nf6 instead of d5 and then d5 but i thought you can play this order too. This was one of my last Catalan games before i switched to 1.e4",
        "3... h6": "h6? it's pretty much tempo wasting.",
        "4. Bg2 Nf6": "Now it became a normal looking catalan but since black played h6 i have a tempo right now.",
        "5. Nf3 Bb4+": "Uh...i think this is the Bogo-indian. I have not prepeared for it at all. (of course white still has a tempo so technically this isn't the Bogo-indian)",
        "6. Nbd2 c6": "going in to some kind of a semi-slav. I dunno maybe this is one of the main lines,i don't have any clue how Bogo-indian goes.",
        "7. O-O Bd7": "a tiny error. Nd7 is a little better.",
        "8. Qb3": "now we see that after Bd7,my queen attacks b7",
        "8... Qa5": "if black wants to save the bishop.",
        "9. a3": "just putting some pressure on the bishop. Of course im not threatening to take it because the rook is hanging.",
        "9... Na6": "only way to get that knight out.",
        "10. c5": "Adding even more pressure on the bishop. The second idea is that even tho i gave up the battle for the d5 square i get the powerfull dark square d6 in this position.",
        "10... Bxd2": "I gained the bishop pair.",
        "11. Bxd2": "I suppose black didn't like the idea of having his bishop on pressure.",
        "11... Qc7 12. Bf4": "And now we see that after Qc7 in order to protect the pawn. White gets immideately more controll with tempo on the d6 square.",
        "12... Qc8 13. Qe3": "Here i simply put up the dangerous future trap of Bxh6. That's the second reason....h6 does both surrender a tempo and weaken blacks kingside. Of course white's e-pawn looks a little uncomfortable.",
        "13... Nc7": "the knight is better of on c7 it's as simple as that. Now it can go to b5 in the near future.",
        "14. b4": "Here i thought that since i have such a strong grip on the king-side. Why dont i get a strong grip on the queen-side as well? white's problem here is the e-pawn and the LSB.",
        "14... a5": "i think this was the best move.",
        "15. bxa5": "Opening up the b-file for me and making my grip a bit stronger.",
        "15... Qd8": "In one of my calculations,if he'd castle the queen would be better off on d8. Otherwise black temporary gambits a pawn for no compensation.",
        "16. Rfb1": "i ignored the fact that black can take the pawn. i didnt wanna become defensive. Instead i seize the b-file and putting an enourmous pressure on the b7-pawn.",
        "16... Bc8": "black moved back with his bishop to defend the pawn.",
        "17. Rb6": "Rb6. I have such a strong grip on the b-file and the b6-square that the next move is a little forced.",
        "17... Nd7": "Of course i was hoping for this move. Now i can finally play the annoying move Bd6 without having to worry about Ne4.",
        "18. Rb3": "I did look a little on a rook sacrifice in that position but it turns out black gets a better position (if he plays all the moves right and i didnt want to risk that)",
        "18... Rxa5": "Finally getting back the pawn and now b6 square isnt just as weak.",
        "19. a4": "stopping Nb5 so that i can finally play Bd6.",
        "19... Na6": "Well.... i dont like that move because of....",
        "20. Bd6": "It took me a white but i finally created a strong outpost for the Bishop on d6. perhaps he should have castled before because now you can tell he ain't going to castle for a while.",
        "20... Qf6": "well the only thing this does is controlling the h8-a1 diagonal.",
        "21. Qc3": "attacking the rook.",
        "21... Naxc5": "I am not sure if Qd8 works but he decided to sac a knight to save the rook.",
        "22. dxc5": "i felt that i had a winning position here with my strong grip and material.",
        "22... Ra8": "retreating the rook. I think i will win if i commence a Queen exchange because of my material but...",
        "23. Ne5": "I want to win this game by a crushing attack instead of material. That pleases me most!",
        "23... Nf8": "(the b-pawn was underfire, since if i go Nxd7 it drags away the c8 bishop which is the defender of b7)",
        "24. Qb2": "i did look at Nxc6 around here. but then saw that i can perhaps sac a rook for a bishop instead on b7.",
        "24... Ra7": "He saw my plan and prevented it.",
        "25. Qb1": "i was maybe hoping to play Nxc6 without him doing a queen exchange here ruining my attack.",
        "25... Nd7": "Now came Nd7. Again i was looking at Nxc6 and i loose on that variation.",
        "26. Nxd7": "So yeah...as you see i look a lot on sacrifices on gameknot.",
        "26... Bxd7": "With this move he over-looked a strong continuation. Kxd7 is just to ugly to be played but now i made this game interesting and guess what move i play.",
        "27. Rxb7": "Rxb7!? i sacrifice a rook but i analyzed this position carefully and judged that i win.",
        "27... Rxb7": "Now queen gets dragged from the a1 rook which is the rook sacrifice.",
        "28. Qxb7 Qxa1+": "heck he even takes that with check! but i have calculated this and i continued to play calm.",
        "29. Bf1": "now even if this sac fails i get a bishop for a rook and it can become a draw. ",
        "29... Qf6": "to stop Qb8+ winning da rook.",
        "30. a5": "this is what i am relying on. I calculated this very position and thought ''well why dont i advance with my a-pawn. unstoppable!",
        "30... Qd8": "Rushing the queen back to the defense.",
        "31. a6": "pushing that pawn another step.",
        "31... Qc8": "if 32. Qxc8 Bxc8 33. a7 Bb7 followed by Kd7 and black gets solid. Even 32. e3 f6 33. Qxc8 Bxc8 34. a7 Bb7 and white can try 35. Ba6 but after 35. ... Ba8 there is no way for white to win.",
        "32. Qb6": "Therefor i played Qb7. The main point is to push the a-pawn because 32. a7?? Qxb7. can anyone see.",
        "32... f6": "he wanted to make room of his rook but i analyzed Qb6 deeply and i knew that i would win with the next move...",
        "33. a7": "and now i expected him to play Qa8 here (only delaying my win!) but he played the blunder...",
        "33... Kf7": "And after...",
        "34. Bb8": "He resigned. My main point is to queen my a-pawn. I still thought that rook sacrifice was cool even tho the position became equal."
    },
    "url": "https://gameknot.com/annotation.pl/excile-explodes?gm=35303",
    "gameName": "EXcile EXplodes.",
    "players": "excile (1667) vs. queenwrapper (1647)",
    "opening": "Queen's gambit declined (D30)"
}