{
    "moves": {
        "1. d4 Nf6 2. c4 g6 3. Nc3 d5": "Gruenfeld defense.  Never know what to play against a GM. Just try something not too fashonable. ",
        "4. Bf4 Bg7 5. e3 O-O 6. cxd5": "Alternative is Nf3, then black answer c6 or c5.\nHere, it is a gambit that leeds to an equal position according to theory.",
        "6... Nxd5 7. Nxd5 Qxd5 8. Bxc7 Na6 9. Bxa6 Qxg2 10. Qf3 Qxf3 11. Nxf3 bxa6 12. Rg1": "Draw is reach after Ke2 - a5, Bxa5 - Ba6 , Ke1 - Bb7, Ke2 - Ba6  etc...\n",
        "12... Bb7 13. Ke2 Rac8 14. Rgc1": "So Rg1 was played just to get out of theory (actually, I was on my own since 4.Bf4 ;D )\n\nNow, you have 1' to find a plan.",
        "14... f5": "? Wrong idea. I plan to bring the king to d7 and exchange the rooks.\nBut black squares becomes weak, especially e5. Correct was f6 with the plan Re8 and e5 to activate the rooks and fight for the center.",
        "15. Nd2 Kf7 16. Rc5": "! Prepare to double the rooks on c file. ",
        "16... Ke6 17. Rac1 Kd7": "f4 ?! seems interesting, but  loose a pawn : \nf4, Bxf4 Rxc5, dxc5 and Bxb2 ? loose a bishop due to Rb1.",
        "18. Nb3 e6": "g5 to prevent white next move is better. ",
        "19. Bf4": "!\nI suddenly realise that black position is not difficult : it is totally lost. White threaten Rd7, and the knight is ready to fork on c5 or to attack the bishop from a5",
        "19... Bc6 20. Kd2": "! \nIf immediately Na5 ?!, then Bb5  and Rxc5.",
        "20... Bf6": "At least do not loose the bishop.",
        "21. Na5 Bd5 22. Rc5c7+ Rxc7 23. Rxc7+ Ke8 24. Rxa7 Bd8 25. Rxa6 g5 26. Bd6 Rf7 27. Nc6 Rd7 28. Ne5 Rb7": "Black should have resign here",
        "29. b3 f4 30. Ra8": "?\nwhen the position is too good, even GM can play \"light\" move.",
        "30... fxe3+ 31. fxe3 Rb6": "Damn, a double attack coming from nowhere !",
        "32. Rxd8+ Kxd8 33. Bc5 Ra6 34. a3": "white would be in trouble if the rook enters its position.",
        "34... Bxb3 35. Nf7+ Kd7 36. Nxg5 e5": "A mystake. I was aiming at Nxh7 Rh6, following the principle that less pawns means more drawing chance, but white \"weak\"e5 pawn is actually a dangerous passed pawn...",
        "37. Kc3 Bg8 38. dxe5 h6": "Rh6 is useless due to h3. May be Rg6. I'm open to any suggestion to improve black play. ",
        "39. Ne4 Bd5 40. Nf2 Ra4 41. Bb4 Ke6 42. Nd3": "Protect the pawn and threaten Nc5",
        "42... Ra8 43. Kd4": "Now threaten Nf4 !\nIt suddenly seems the board is too small for the bishop !",
        "43... Bh1": "And furthemore, there were only 5 opponents remaining, which leave me with 20' / move.",
        "44. Nf4+ Kf5 45. e6 Rd8+ 46. Kc5": "Prevent Bc6.\nThe pawn is impossible to stop",
        "46... Kf6 47. Kb6": "Now b7 is controlled by the bishop, and the king will come to support it too.",
        "47... Bd5": "Last blunder in a lost position. ",
        "48. e7 Rb8+ 49. Kc7 Rb7+ 50. Kc8": "and black resign in view of Fc6, e8Q BxQ KxR.\r\n\r\nNakamura finished the exhibition in 2 hours, with 18 win and 2 draw. \r\n\r\nThanks for looking, hope you enjoyed.\r\nDon't hesitate to give comments and 1 star rating. ^^\r\n"
    },
    "url": "https://gameknot.com/annotation.pl/exhibition-game-antibes?gm=15464",
    "gameName": "Exhibition game, Antibes",
    "players": "Nakamura hikaru (2686) vs. riwulof (1800)",
    "opening": "Gruenfeld (D84), Gruenfeld gambit accepted"
}