{
    "moves": {
        "1. c4": "The game was quite an interesting positional struggle. with an odd sort of prison occuring around my king. My opponent for this game is meant to be a very expierenced dangerous player however he does have a tendancy to play slightly to fast and is notourios for making these horrific blunders, one such won me this game however there was some intersting play before that.\r\n",
        "1... c5": "The symmetrical english, I have played this a couple of times now from blacks perspective and am starting to really enjoy it. During this game black (myself) played something of a very hypermodern style by allowing my opponent to overextend and then take advantage of the weaknesses later.\n",
        "2. Nc3 g6 3. g3 Nc6": "Normally I would just play Bg7 however this time I played this instead.\n",
        "4. Bg2 Bg7 5. e3": "preparing the thematic d pawn push. Here I decided on a whim to try something a little different from the norm.\n",
        "5... Ne5": "!? This came from some of my limited expierence from playing white in the english system. I often found a few times that by waiting too long for the d pawn push I began having problems when black took advantage of the hole created on d3. This move although it violates the principle that one should avoid moving a piece more than once in the opening does force whites hand. I think the loss of tempi is justified as it forces white to play in a way he is unfammilier with.\n",
        "6. d3": "Practically forced.\n",
        "6... Nf6 7. f4": "?! very agressive. I suspect my oponent is underestimating me in this game. I'm young and my only expierence playing this opponent tendid to be when I was still very new to chess. Now I'm starting to develop something of an appreciation for positonal play so although far from being good I'm slowly learning how to take advantage of some weaker moves my opponents occasionally play. As white I think I would be considering instead moves like Ne2, Nf3, or maybe even b3. This move however is not that bad when it comes down to it. \r\n",
        "7... Nc6": "The only other square being g4 and I didn't like the idea of playing my knights over to the king side. black needs to remain flexible in this position.\r\n",
        "8. Nf3 b6": "I decided to play a restrained sort of game, once again as well this comes from expierence playing the english, I often had troubles when my opponents opposed my King side fianchettoe as well as that I noticed that black doesn't do too badly in some of the games I have seen in the symmetrical english.\n",
        "9. O-O Bb7": "I think it's usually best to complete a fianchetto as soon as possible when you start one. \n",
        "10. Nh4": "The only reason white would play this move is he intends to play the f pawn foward. It's not a plan I would have chosen as white but I supose everyone has there own styles, besides it's consistent with whites play so far, what with the f pawn thrust before. Other moves that may have been sensible were e4 since the d pawn cant make its advance and must become backward then perhaps the e pawn will be the one to make its way foward. b3 planning to use the LSB on the a1-h8 diagonal and Re1 both seem to be potential ideas \r\n",
        "10... Rb8": "?! intended to give support to my b7 bishop and allow my knight to move should it be worthwhile, probably this was a waste of time. Had I given some thought to the reason behind my opponents previous move I may have have made the more logical move e6 which prevents any advance my my opponents f pawn as well as preparing a potential d pawn thrust. It would also make my opponents previous move look silly.  \r\n",
        "11. f5": "well with Nh4 not much else would make any sense.\n",
        "11... Ne5": "Hoping to get rid of whites LSB. Perhaps 0-0 or e6 should have been played instead.\n",
        "12. e4": "This was probably going to occur at some stage anyway, however now boths sides plans are becoming slightly more clear. Black intends to make use of the a1-h8 diagonal and maybe plant knights on d4 and e5 via d6-Nd7-Nde5 and the knight curently on e5 will go back to c6 to aim for d4. white it seems plans to press blacks position and see if he can drum up some form of attack. White should be able to make good use of the nice diagonal c1-h6 and maybe even look to trade DSB.\r\n",
        "12... O-O": "This or else d6. possibly even Nc6. I think the move I made was correct. \n",
        "13. Bf4": "Since I cant move the knight this seems alright. If I was to play d6 then Bxe5!? would be worth looking at for white the point being that Bxe5 dxe5 seems to be bad for black.  \r\n",
        "13... Nh5": "So I made this move almost instantly. White cant trade the bishop for the knight. I never considered trying to get a knight to e3. What does the reader think? would Ng4 (either knihgt) have been worth looking into?\r\n",
        "14. Be3 Nc6": "playing to plant a knight on d4.\n",
        "15. g4": "?! Very provocative, and probably a little weakning. \n",
        "15... Nf6 16. h3 Qc7": "The b8-h2 diagonal is significanly stronger, playing this plays on that diagonal. Possibly  should have played a6 first to prevent Nb5\n",
        "17. Qd2": "Good move by white, it threatens to exchange DSB which black cant afford. I mentioned before that this was a good diagonal for white and this emphasise that fact. \n",
        "17... Rfe8": "in order to keep control over the long diagonal. Now if white plays Bh6 I can just drop my bishop back to h8.\n",
        "18. Bf4": "Black was going to play d6 anyway so perhaps this move was unwise. Instead Bh6 or maybe exchanging pawns could have been played for this and the last few moves. \r\n",
        "18... d6 19. Ne2": "This move baffles me a bit. What was whites plan? Instead of this Bh6, Nf3 to give some extra control over e5 or possibly even exchanging with fxg would be better, they would actually be part of a plan at any rate. \n",
        "19... Nd7": "Puts two more pieces on e5. It also prepares to land the knight there.  \n",
        "20. Bh6 Bh8 21. Nf4": "I didn't quite know what to think at this point. white has a lot of pieces around my king, does he have an attack? I dont know. I chose to continue with my own plans by making use of all these squares I have worked so hard to create. \n",
        "21... Nde5 22. g5": "At this point I realised that the whites king side advance had effectvly been halted. With the kingside practially shut down its time for black to swicth and start pushing himself, but on the queen side where black seems to have better prospects.\n",
        "22... a6 23. a3": "?! I'm not quite sure what this move accomplishes. white should probably make something happen on the kingside.\n",
        "23... Nd4": "Black was eventually going to move here anyway but now it also threatns a fork. \n",
        "24. Rab1 Bc6": "I was slightly unsure how to proceed here, I thought by doing this I might be able to somehow find a better use for my LSB than what its doing right now.\n",
        "25. Nd5": "A good square for the white knight. \n",
        "25... Qc8": "I decided upon this square by rationalisng that this was the most promosing diagonal for the queen. Also it prepares to push e6. My LSB isn't going to be of much use this game so possibly I should have exchanged it for the knight.\n",
        "26. f6 Bxd5 27. cxd5": "interesting choice of recapture by white. Which one was best here? I'm not too sure.\r\n",
        "27... e6": "I had a good long think at this point in the game. I was trying to decide between exf6 or this move. I thought exf plans to make a target of whites f pawn however it frees his DSB yet leaves mine still very uninfluential. Thus I decided on this move. Now both players are effectivly playing without dark square bishops. For that matter as well my king could probably have no better protection from any middle game attacks. Though this move has plenty of down sides as well which I will outline later.\n",
        "28. dxe6 Qxe6 29. Kh2": "I assume white was using his king to protect the h3 pawn. However this square is really a very poor square for the white king. \n",
        "29... Qb3": "targeting the weak d pawn. Blacks position seems quite nice at the moment, certaitnly it's easy to play since it has clear plans as well as that black has those great knights in the centre, strong quuenside pawns and whites pieces seem uncordinated and kind of not doing much on the kingside.\n",
        "30. Rfd1 Rba8": "Incase the a file ever were to open. it also clears the b8 square for my other rook and allows Ra7 where I can choose to double rooks if I ever choose to.\r\n",
        "31. Rbc1 Qb5 32. Rc3 a5": "I probably played this to give my queen a6. \n",
        "33. Qf2": "What was this move all about? perhaps the reader has ideas about why white may be doing this, does it somehow prepare to start moving the kingside pieces over to the queen side? in my opinion white needs to move the king in order to do that. Blacks knights are doing a really good job of keeping whites position under raps.\r\n",
        "33... Ra7": "getting my rook out of line from the LSB as well as allowing a double up at some point.\n",
        "34. Nf3": "?? It's almost a shame for white to end the game so suddenly with this blunder. When there was so much play still left in it. How does the reader evaluate the position had white not blundered? To me it is very interesting. It seems on the surface that black is much better. He has these strong knights much easier play especially on the queenside where he can slowly advance the pawns and white right now is full of weaknesses and whites pieces are uncordinated inactive and will take a very long time to be made use of. However it seems to me that white has some good long term prospects with some accurate play. the key being that if white can get to an endgame he will be practially won. With blacks king completely out of play black would be effectivly a piece down since come endgame the kings become very useful attacking pieces, as well as that black will have a permanant back rank weakness. However it is difficult to achieve this and would require some very precise moves from white to make use of these features.\r\n",
        "34... Nexf3+ 35. Bxf3 Nxf3+ 36. Qxf3 Qxb2+": "Well this was an interesting game and a good result for me, I'm interested to see how the reader evaluates some of the positions in this games especially near the end.\n"
    },
    "url": "https://gameknot.com/annotation.pl/expiernce-vs-youth?gm=41580",
    "gameName": "expiernce vs youth ",
    "players": "opponent (1560) vs. thereaper1 (1072)",
    "opening": "English (A34), symmetrical variation"
}