{
    "moves": {
        "1. b3": "The Nimzo-Larsen Attack...a hypermodern opening with the idea to counter-attack from the flank. There will be no variations given as this is my first effort and I plan on taking a more narrative approach.",
        "1... c5": "Already I was uncomfortable at his response, i'm still learning this opening and i have never seen this response before, i'm sure my discomfort will pass, it's all part of the learning curve when using a new opening.",
        "2. Bb2": "fianchettoing my queen's bishop, notice how it points like a lazer beam down into the heart of black's king side.",
        "2... Nc6": "Both sides appear to be approaching the center from a safe distance.",
        "3. Nf3": "developing my pieces getting them ready to see active duty.",
        "3... d5": "Okay, now black has taken a foothold in the center.",
        "4. e3": "i continue to develop `nimzo-larsen` style...this pawn move allows me to develop my king's bishop while possibly supporting another pawn advance in the center later on in the game.....er war...my queen is also is allowed a little more space.",
        "4... Nf6 5. Bb5": "This bishop will play an important role of omission later in the game. On one level it is comedy but to the white king it will be a tragedy.",
        "5... Bd7": "black of course pursues his own plans of developing his pieces.",
        "6. O-O g6": "black seeks to counteract my own bishop on the long diagonal.",
        "7. c4": "Classic `nimso-larsen`stuff, I attack his center from the flank, notice how my b pawn backs up this attack on black's center.",
        "7... dxc4 8. bxc4": "an important development, he gives up a center pawn while I hang on to my own, this will help give me a more attractive pawn structure going into the middle game, notice too how i have not committed either of my center pawns to the center yet, they stand ready to advance later in the middle game, i like the idea of holding my center pawns back initially, all part and parcel of hypermodern strategy.",
        "8... Bg7": "He finally moves his bishop to g7 to counteract my own bishop on that diagonal.",
        "9. Nc3": "i continue to develop my pieces with the idea of piece activity in coordination with my pawn structure, a good opening will help guide you through the pitfalls of having your pawns get in the way of your own pieces.",
        "9... O-O 10. Qc2": "I was unsure here what to do, i could have played Q-e2 or B*c6.",
        "10... Nb4": "I get my answer immediately, his knight attacks my queen, maybe I should have taken his knight after all.",
        "11. Qb1 Bg4": "he`s getting aggressive here, so i decide to attack his knight at b4 with my pawn.",
        "12. a3 Bxf3 13. axb4": "A skirmish breaks out with both sides drawing blood.",
        "13... cxb4 14. gxf3": "and it continues...",
        "14... bxc3 15. Bxc3": "after the skirmish i feel pretty good about things, the `nimzo-larsen`will  often give you good pawn formations in the middle game, here i have a preponderance of pawns ready to advance towards the center, while my opponent is missing some center pawns.",
        "15... Qc8": "maybe Q-d8 was better, attacking my weak pawn at d2.",
        "16. d3": "now that pawn is supported by my queen.",
        "16... Qf5 17. Qd1": "at this point i`m thinking to put my heavy pieces behind my center pawns and advance them and maybe get a passed pawn out of this strategy.",
        "17... Rfc8 18. Ba4": "i want to get my bishop away from his pawns and get it more involved in my plans.",
        "18... Nh5": "this knight move of his puts the question to my bishop at c3.",
        "19. Bxg7": "i'm forced to take his bishop but i don't mind that much.",
        "19... Nxg7": "he in turn takes my bishop out of the game.",
        "20. Rc1": "so far so good, i`m really liking my position at this point, my pawns stand ready to advance.",
        "20... Qf6 21. f4": "a subtle but good move, creates an opening for my queen on f3 where it can attack black's b7 pawn which would be pinned due to his rook on a8.",
        "21... a6": "he's probably thinking about attacking my bishop, meanwhile my queen is sitting in the weeds waiting to strike at f3.",
        "22. Bb3": "i want to move my bishop away from his threatening pawns and get it more involved in supporting my center formation of pawns.",
        "22... Rc5": "he lifts his rook.",
        "23. d4": "i attack his rook forcing him to move it while at the same time advancing another pawn up the center of the board.",
        "23... Rh5": "i`ll have to keep an eye on my king side, i`m notorious for neglecting the safety of my king.",
        "24. Qf3": "attacking and pinning his b pawn, notice the mobility of my pieces and how they fit in with my pawn structure, this is a theme i plan on focusing on from this game on...the nimzo-larsen opening had done it's job and left me with a good pawn skeleton for the middle game wars.",
        "24... Nf5 25. Qxb7": "i capture his b7 pawn...oh it feels so good. i'm up a pawn and my center mass of pawns is looking more threatening all the time.",
        "25... Rd8": "i`m looking good here but instead of considering candidate moves (like R-a1), i decide to make the first move that pops in my head.",
        "26. Rfd1": "fortifying my pawn center, not such a bad move really, but now i'm thinking what i could have done with my rook if i had of moved it to a1.....looking at it now I have the whole queenside to myself with a queen, a bishop and two connected rooks ready to swing into action....the road not taken, as in life so it is in chess, but of course that leaves my king pretty lonely with black's queen, rook and knight hanging around a dark lamppost on the kingside...'for every solution there is another problem.'",
        "26... Nd6": "his knight attacking my queen.",
        "27. Qf3": "i don`t think this a bad move in itself, i just wonder if i shouldn`t have condsidered other moves. my great failing in chess is that i am impatient and easily frustrated and usually make the first move that comes into my mind....a basic character flaw that impeds my ability to improve my game.",
        "27... Rb8": "his rook attacking my bishop.",
        "28. Ba2 Rb2": "his rook zooms down to my second rank...oh i don't like that but chess isn't only about attacking your opponent...you have to deal with him attacking you as well.",
        "29. Bb1": "my bishop is in the thick of things now and doing his part to help the team.",
        "29... Ra5": "his rooks are carousing around like to big thugs on a dark street corner and the`re beginning to intimidate me but i still feel i have things in hand, my strategy is still to force through a passed pawn in the center and win this war.",
        "30. c5": "forcing him to move his knight while advancing my c pawn once again. notice my nice chain of pawns going up through the center of the board. the nimzo-larsen will often give you attractive pawn formations in the middle game if you play your cards right in the opening.",
        "30... Nb5 31. c6": "again this was a move i made immediately, i wonder now if i should have taken more time to consider it. it seems to make sense. in my mind he has got to worry about that pawn queening as his rooks are far abroad on their adventures (like king richard on his crusades).",
        "31... Qd6": "his queen gets involved in stopping my pawn adavance...this is a critical position and i looked at it and didn`t know what to do, and i didn`t take the time to find out what to do, i got impatient and frustrated, should have stopped right here and logged off and thought about things but that would have made too much sense, if i had stayed focused on my stategy (to queen that pawn), that would have been a good clue to my next move. fritz tells me B-d3, attacking his knight.",
        "32. h4": "instead i do this and at this point i lose the thread of my game. i was thinking to break up the pawns in front of his king.",
        "32... Ra3": "damn his rooks, always hanging around and making threats...remember that comment about my bishop i made early in the game...'This bishop will play an important role of omission later in the game'...i should have played B-d3 here attacking his knight on b5...instead i did something else...\n",
        "33. Rd3": "i moved too fast and make the move that loses me the game, probably should have played the bishop to d3 instead, i`m more of a positional player and tactics are not a strong suit for me, that combined with my lack of patience make chess challenging for me.",
        "33... Rxb1 34. Rxb1 Rxd3": "after the skirmish, i`m down on the exchange and down in other ways as well. i ruined a good solid position by getting frustrated and not taking my time...chess will bring out your character flaws and shine a spotlight on them.",
        "35. Rc1": "i moved fast, angry with myself for losing the exchange and bungling a perfectly good position...there is an important lesson here, if you make a bad move, logoff and get away from the game for awhile and get back to it later when your head has cleared and you're not as emotional....but you know what they say about advice, easy to give, hard to take.",
        "35... Rc3 36. Rxc3": "another bad decision but my heart is not in it anymore, maybe R-a1 was better.",
        "36... Nxc3 37. e4 Qxc6": "the rest of it is him closing me down.",
        "38. d5 Qc4 39. Kg2 Nxe4": "i resigned and learned another chess lesson, if i am to improve my game i will probably have to make changes away from the chessboard and do something about my `easily frustrated and impatient nature`...but this is part of the beauty of chess, it will reflect your character flaws and shine a light on them. it is up to me to do something about that....Boris Spassky once said that 'Chess is a metaphor for Life'...I think it is. A chess game will have drama, intrigue, tragedy, comedy. Think of it as a theatre of the mind where we play major roles in shaping our destiny.  It is life contained on a 64 square field and we are the Kings."
    },
    "url": "https://gameknot.com/annotation.pl/exploring-the-nimzo-larsen-attack-a-narrative?gm=44450",
    "gameName": "Exploring the Nimzo-Larsen Attack, a narrative",
    "players": "sixofspades (1356) vs. arshia85 (1543)",
    "opening": "Nimzovich-Larsen attack (A01), English variation"
}