{
    "moves": {
        "1. e4": "Hi everyone!\n\nAfter you have witnessed my two losses against IM David Patron I bet you may be wondering whether things may be coming in threes, although at least I was playing someone much closer to my rating.  However, in the opening he apparently blundered his queen for Fou Leblanc.  However, a few moves down the line, Henrythefifth showed me that my own King Henry was potentially in deep doodoos.  So, the question is, will Henry meet an inglorious end or will Glenda be able to make her presence felt just in the nick of time?  If you do not wish to see the spoiler below then do read on.",
        "1... e6": "1. ..... e6 - after I revert back to e4 (I have also played Nc3 quite a lot!) my opponent hits me with the French Defense.  I usually play the exchange variation but this time I try the advanced.",
        "2. d4 d5 3. e5 c5 4. c3": "4. c3 - standard advance in the French Defense Advanced Variation to try and keep my opponent tied down as much as possible by bolstering the advanced e5 pawn.",
        "4... Nc6 5. Nf3 Qb6 6. a3": "6. a3 - I want to keep black's queen knight out of b4 should my d4 pawn be traded off.",
        "6... f6 7. Bd3 fxe5 8. Nxe5": "8. Nxe5 - pawn trade.",
        "8... Nf6 9. O-O cxd4 10. Nxc6 bxc6 11. cxd4 Qxd4": "11. ...... Qxd4 ?!(!) - and now here is the queen sac.  Black allows Bg6+ because most of my pieces are undeveloped and he somehow finds a ferocious mating attack out of nowhere!",
        "12. Bg6+ hxg6 13. Qxd4": "13. Qxd4 - nacht!",
        "13... Bd6": "13. .... Bd6! - a strong follow up move.  Black is getting whatever is left of his army out and is attacking h2.  He is threatening to win Glenda back in two moves by means of a nasty discovered check down the h column.  I avoid this by playing g3.",
        "14. g3 e5 15. Qa4": "15. Qa4 - Glenda stays rooted to this square for many, many more moves.",
        "15... Bd7 16. Bd2": "16. Bd2- I now get my pieces out as quickly as possible.",
        "16... Ng4 17. h4": "17. h4 - staves off another threat on my g2 pawn but will the h column suddenly be a death trap for Henry?  We shall see.",
        "17... e4 18. Nc3": "18. Nc3 - finally the decks are cleared but my situation is not ideal.  For a starters, I do not like the fact that Glenda is on a discovery line (the a4 to e8 diagonal).  I also mislike the fact that black has the bishop pair (this was a telling factor in Easy 19 - aka The Master Mater's queen sac MTs) to rake across the board and inflict a lot of potential damage.  His knight on g4 looks ominously pesky.  There is a rook blasting down the h column and he could double up on it in a few more moves if I do not watch out.  Finally his d5 pawn is a passer in a very strong looking pawn chain.  Yup, at this point black is better.  Do you the Inquest Jury agree?",
        "18... Ne5": "18. .... Ne5 - threatening a really nasty knight fork on f3.",
        "19. Bf4 Nf3+ 20. Kg2 Bxf4 21. gxf4": "21. gxf4 - Well at least I have broken up that bishop pair, but now two of my kingside pawns are about to drop off and Henry is gonna shiver!",
        "21... Rxh4 22. Rfh1": "22. Rh1 - necessary counter attack along the h column.  Black now picks off the f4 pawn and lays a trap.  If Rh8+?? black will force mate in a few moves.  I now bring my knight over to give poor Henry some cover!",
        "22... Rxf4 23. Ne2 Rg4+ 24. Ng3": "24. g3 - now Henry is safe - at least for a while and I really am threatening Ra8+.",
        "24... Nh4+ 25. Rxh4 Rxh4 26. Rh1": "26. Rh1 - after sacrificing my rook to eliminate counterplay from that pesky knight of his, I now move my remaining rook onto the h column.  Will a more open board give Glenda a chance to make her presence felt?  We shall see.",
        "26... g5 27. Qd4": "27. Qd4 - finally Glenda does make her presence felt - she is eyeing up the rear doubleton isolani on g7 and threatening Qe5 check winning the g5 pawn.",
        "27... O-O-O": "27. ..... 0-0-0? I was expecting Kf7.  This now allows Glenda to pick off the pawn on g7.  She could have taken the a7 pawn but I felt it was better that Glenda should guard the h8 square.",
        "28. Qxg7 Bg4 29. Rxh4 Bf3+ 30. Kh3 gxh4 31. Kxh4": "31. Kxh4 - now both those weakies on the g column have vanished, although the second one has been devoured by Henry rather than Glenda.  Maybe I could use Henry to hold back black's central queenside pawns while Glenda is free to rampage elsewhere.",
        "31... d4 32. Nf1 d3 33. Nd2": "33. Nd2 - but my knight can get there a lot quicker to blockade them.",
        "33... Be2": "33. .... Be2 - laying another trap by hoping for Nxe4?  Blackwill then play d2 and I will have to trade off the knight for the pawn to prevent it from crowning.  Glenda, however, now snaps up the a7 pawn instead.",
        "34. Qxa7 Re8 35. Qe3 c5 36. Qxc5+": "36. Qxc5+ - on black's last move, in trying to bolster d3 he left his c5 pawn en prise.  Glenda gratefully snaps this one up with check and now my opponent decided to wave the white flag.  Kudos to black for an exciting middlegame!"
    },
    "url": "https://gameknot.com/annotation.pl/faced-with-a-q-sac-a-ferocious-mating-attack-now-what?gm=64369",
    "gameName": "Faced with a Q sac, a ferocious mating attack, now what??",
    "players": "jstevens1 (1745) vs. henrythefifth (1700)",
    "opening": "French (C02), advance, Milner-Barry gambit"
}