{
    "moves": {
        "1. d4 d5 2. c4 e6 3. Nc3 Nf6 4. Bg5 Be7 5. e3": "This is a fairly standard look to the Queen's Gambit Declined and there are a number of directions available. ",
        "5... O-O 6. Nf3 Nbd7": "I always find Nbd7 a difficult move to counter as my dark squared Bishop is now essentially without many good squares and taking the Knight seems wrong.",
        "7. Ne5": "I try an aggressive approach",
        "7... Ne4": "My opponent responds in kind. ",
        "8. Bxe7": "8. Nxe4 Bxg5 9. Nxg5 Qxg5 10. Nxd7 Bxd7 is also possible and judging by the game continuation probably better",
        "8... Qxe7 9. Bd3": "This not much of a threat although and with Black's Queen having open space on my Kingside the eventual castle that I make is probably not such a good idea in any case. I might have been better served with something like 9. Nxe5 dxe5 10. c5",
        "9... Ndf6": "Nicely protecting the Knight in that excellent forward position",
        "10. O-O": "I think this is a mistake with both Knights on that side of the board and the potential for the Queen to come in at a moments notice",
        "10... Qb4 11. Nxe4 dxe4": "Forces my Bishop back and gains a pawn. I think this is better than 11. ... Nxe4 12. b3 even though Black ends up with doubled pawns. The forward e-pawn is not bad at all",
        "12. Be2 Qxb2 13. f3": "I'm hoping to clean up that forward e-pawn and open the f-file for my Rook",
        "13... c5": "My opponent does not oblige",
        "14. fxe4": "I think this is also a mistake. It undoubles the pawns, allows Black's Knight into a strong square although does give me the f-file for my Rook. Better perhaps is 14. Re1 protecting my Bishop and allowing my Queen to get into the game.",
        "14... Nxe4 15. Bh5 g6": "Easily refuting my attack. ",
        "16. a4": "Retreating the Bishop is perhaps a better move but I wanted to make an active game and perhaps even get a mating attack with something like: 16. ... gxh5 17. Qxh5 Kh8 18. Nxf7+ Kg8 19. Qg4+ Ng5 20. Qxg5# although none of that is forced",
        "16... Qd2": "My opponent looks to trade Queens and pick up the Bishop",
        "17. Qf3": "Naturally I cannot allow that to happen",
        "17... f5": "This removes the potential attack on the f7 pawn",
        "18. Bxg6": "Now my Bishop is trapped and I have to make the most of a bad situation",
        "18... Nf6": "Immediately capturing the Bishop leads to a bit of a King chase with 18. ... hxg6 19. Nxg6 Rd8 20. Qh5 b6 21. Qh8+ etc or something of the like",
        "19. Bh5": "18. ... Nf6 covers the h5 square and prevents my Queen from coming in on the attack after hxg6 so I have to retreat my Bishop which leads to the loss of several pawns.",
        "19... Nxh5 20. Qxh5 Qxe3+ 21. Kh1 Qxd4 22. Nf3": "I'm down two pawns now although I have a bit of an attack on the unprotected King. I think Black is clearly better at this point and if my opponent can get his Bishop out and activate his Rooks I think it is a winning position.",
        "22... Qg7 23. Ng5": "Trying to stay active while down.",
        "23... Qg6": "Trying to trade Queens which I must avoid if I'm to have a chance in this game.",
        "24. Qh4 e5 25. Rab1 b6": "Preventing my Rook incursion and freeing up the Bishop to move",
        "26. Rbd1 h6 27. Nf3": "Backwards I go my activity diminishing by the moment",
        "27... Qf6": "This ideally tries to trade the Queens but ends up losing a pawn and I think is a mistake. 27. ... Bb7 is probably better getting the Rooks connected and the Bishop into the game.",
        "28. Qg3+": "No Queen trades for me",
        "28... Kh7 29. Nxe5 f4 30. Qc3": "The Knight must be protected",
        "30... Bg4 31. Rdc1": "Protecting the Queen so as to unpin the Knight",
        "31... Rae8": "A blunder although I fail to capitalize. The Knight is no longer pinned.",
        "32. Rce1": "Overlooking that reason I moved the Rook to c1 in the first place. Now 32. Nxg4 Qxc3 33. Rxc3 is possible and should have been played",
        "32... Qd6": "The blunder that saved the game for me. This forgets that the only thing stopping the Knight from capturing the Bishop was the pin. I think 32. ... Re7 is better preparing to double the attack on the pinned Knight.",
        "33. Nxg4 Rxe1": "Now down a piece my opponent trades Rooks which is probably inaccurate. ",
        "34. Rxe1 Qd7": "Perhaps flustered by previous mistakes my opponent now follows up with a third poor move. ",
        "35. Nf6+ Rxf6 36. Qxf6": "Now White is in a commanding position and Black must look for Perpetual Check",
        "36... Qg7": "The last in a poor series of moves seals the game for me.",
        "37. Re7": "At this point Black resigned. I enjoyed this game because I managed to find some good attacks once I fell behind which forced Black to manuever. Eventually I was fortunate when my opponent made a series of poor moves and I was able to get a win."
    },
    "url": "https://gameknot.com/annotation.pl/fast-ladder?gm=29862",
    "gameName": "Fast Ladder",
    "players": "tomlib (1504) vs. rsm3 (1274)",
    "opening": "QGD (D60), Orthodox defence"
}