{
    "moves": {
        "1. d4 d5 2. c4 e6 3. Nc3 Nf6 4. Bg5": "Queen Gambit Declined, Orthodox defence",
        "4... Bb4": "This is not main line of QGD, although it is played, more or less often. The most popular continuations here are 4... Be7 (Orthodox defence) and 4... Nbd7 (which usually leads to Cambridge-Springs variation). Black is going to prevent white's advance by making pressure on the c3 point.  ",
        "5. e3 c5 6. a3": "This is mistake, white can't get advantage that way. Better continuation would be 6. Nf3, or  6. cxd5 exd5 7. exd5, with clear advantage.",
        "6... Bxc3+ 7. bxc3 Qa5 8. Qc2 Ne4": "This is the point: black knight hits both bishop g5 and pawn c3. White has problems...",
        "9. Nf3": "White defend the bishop, and it is risky for black to try to win the с3 pawn: after 9... Nxc3 10. Qd2 the black knight gets tied, and it is not easy to find how to release it. The continuation 9... Qxc3+ 10. Qxc3 Nxc3 11. dxc5 dxc4 12. Rc1 Ne4 13. Rxc4 leads to approximately equal game.",
        "9... h6 10. Bf4 Nxc3 11. Qd2": "Yes, of course, black knight gets tied. It is not fatal, but black now have to play accurately to avoid further problems.",
        "11... cxd4": "This is mistake. The main problem for black here was to release the tied knight c3, and this could be done by 11... Nc6. After 12. dxc5 Ne4 13. Qxa5 Nxa5 14. cxd5 exd5 15. Rc1 white regain the pawn, but the position is still slightly better for black. And now white knight arrives to d4, and black can't release the c3 knight. They find another trick, but are unable to avoid major problems.",
        "12. Nxd4 dxc4 13. Bxc4 e5": "This pawn fork for knight d4 and bishop f4 lets black to regain the piese, but problems for them come from another side.",
        "14. Nb3": "The black queen has to retreat, leaving knigth c3 to its fate.",
        "14... Qb6 15. Qxc3 exf4 16. Qxg7": "The king's wing of the black position is damaged, and what is worse, black king's position is exposed, which is really dangerous here.",
        "16... Rf8 17. O-O f3": "This looks necessary, because otherwise white could play exf4, and the line e gets opened for frontal attacks against the king. From the other side, black pieces are undeveloped, and spending precious time to move the pawn is also very dangerous. I don't know what continuation here would be the best for black, but it is obvious that the bad times for them are coming.",
        "18. Nd4 fxg2": "More one black pawn move, while white uses every opportunity to develop their pieces, is fatal. At that moment I was sure that I'm 100% winning. And without 18... fxg2 I was going to continue 19. Nxf3, geting both material and great positional advantage, which would be absolutely sufficient for victory. And in postgame analysis Rybka shows here that black fails in all variations.",
        "19. Rfd1": "Nice position - almost all white pieces are already in the game, while neither black pieces, except the queen, started to play. Black king is vulnerable from any direction, and its white opponent looks absolutely safe. Black pawn g2 is an excellent defender, like sincere friend, making impossible for black to hit it in frontal attack, it looks even better defender than the white pawn :-). At that monent I was sure that black will be smashed in five moves or so. \nBut imagine black queen on g5, and black knight on f3 - this is mate :-(. No, this can't ever happen - black will be smashed soon!",
        "19... Qc5 20. Rac1": "Black's position is absolutely lost, the most obvious threat for them is 21... Bb5+. Computer shows that black are defeated in all variations, the problem for white player is only to find best continuations of the attack. But starting at this point, my opponent played briliantly, finding the strongest move, which can't be said about me...",
        "20... Nd7": "The threat 21. Bb7 is not actual any more. White can't play neither 21. Bxf7+ because of 21... Rxf7 22. Qg8+ Qf8. ",
        "21. Nb5": "The best continuation, creating new threats, for example 21... a6 22. Nd6+ Ke7 23. Bxf7 Qe5 24. Nxc8+ Raxc8 25. Rxd7+ Kxd7 26. Qxe5, or 21... Ke8 22. Qxf8+ Nxf8 23. Nxb8++ and Nxc5. ",
        "21... Ke7": "Excellent defence, wery hard to find, causing white the hardest problems to continue the attack. All threats created by the preceding play aren't actual now, because Bxf7 goes without a check.",
        "22. Nd6": "This is good move, but not the best. The threat Bxf7 is still dangerous, but not mortal. The best continuation, as Rybka shows, would be 22. Rd5!, which prevents black queen to get to  g5 square. The further play at this case could be 22... Qb6 23. Nd5 a6 24. Nf5+ Ke8 25. Rd6 Qa7 26. Bxf7+ Rxf7 27. Re6+ Kd8 28. Qxf7, and white wins. Computer shows that white still wins, but finding the way to the victory is more tricky now.",
        "22... Qg5": "Black queen gets to the g5 square, does this remind you something? No, don't mind, white still wins in all variations.",
        "23. Qd4": "This would be bad idea to excange queens here, right?",
        "23... Ne5": "wow, what a nigthmare, black knight is going to jump to f3 - and black wins! And what about attack, I just haved such strong position!\nComputer shows that white still wins, but don't speak about smashing black in five moves.",
        "24. Nxc8+": "This is good move, and white still going to win, but the best move would be 24. Be2 Re8 25. f4 Qg6 26. Qxe5, and white wins very soon.",
        "24... Rfxc8 25. Qd6+": "Right idea, white first comes out of the knight fork Nf3, and besides all, black king is getting again in very vulnerable place.",
        "25... Ke8 26. f4": "It is again good move, but not the best. Better would be first 26. Bb5+ Rc6 27. Bxc6+ bxc6 (or 27... Nxc6? 28. Rxc6 Rd8 29. Qxd8+ Qxd8 30. Rxd8+ Kxd8 31. Rxh6), and only now 28. f4. Please also note that if bishop stayed on e2 (see previous comment), f4 would be even stronger.",
        "26... Nf3+ 27. Kf2 Qh5": "Computer shows, that white still wins, but I was already discouraged by continuous efforts not bringing me success - and I was going to smash black in five moves. I encountered the position which seemed before like unrealistic nightmare, and I still have material disadvantage. Now I decided to go the way which gives me small, but reliable advantage ",
        "28. Bxf7+": "- and this turnes out to be mistake. If I played 28. Rd5, the victory could be easily achievable: 28... g1Q+ 29. Rxg1 Nxg1 30. Rxh5; 28... Qg4 (the only move black doesn't loose the knight immediately) 29. Bb5+ Rc6 30. Bxc6+ bxc6 31. Qxc6+ Ke7 32. Qb7+ Kf6 33. Rd6+ Kg7 34. Qxf6 - not very hard to be found. So while black made the best moves to defend, I made simply good, not the best moves to attack - but this is not enough to win.",
        "28... Qxf7 29. Kxf3 Rxc1 30. Rxc1": "I got only material equality, but I had a hope to achieve advantage by winning the pawn g2, which sometimes looked like my sincere frend and best defender. But even so, it is queens endgame, where one pawn advantage is often not sufficient to win. So my victory is questionable now. Very discouraging...",
        "30... Qh5+ 31. Kf2 g1=Q+": "Unexpected, but reasonable move. The main task for white now is to escape from checks. I considered continuation 31... Qh4+ 32. Kg1, where it is not a problem, and taking into account that black king is in exposed position, I hoped to win. As Rybka showed, 31... g1Q+ is the strongest defence. Now I had to decide, should the new queen be taken by king or rooch.",
        "32. Kxg1": "I took by king, and this again turns out to be mistake. I did not find how, if the rooch takes, to escape from checks, but computer showed that the way existed, although being very tricky: 32. Rxg1 Qxh2 33. Rg2 Qh4+ 34. Ke2 Qh5+ 35. Kd2! Qa5+! (35... Rd8? 36. Rg8+) 36. Kd3 Qb5+ 37. Ke4 Qa4+ 38. Kf5, king escapes, and black can't save their king - white should win. ",
        "32... Qg4+ 33. Kf2 Rd8 34. Qe5+": "The last hope - after 34... Kf8 35. Qh8+ Kf7 36. Rc7+ white wins, but black avoids this point.",
        "34... Kf7 35. Rc7+ Kg8 36. Qc3": "It is all, the draw is now inevitable.",
        "36... Qh4+ 37. Kg2 Qg4+ 38. Kf2": "Agreed for the draw.",
        "38... Qf3+": "This move was made after we agreed for the draw, and it does not matter."
    },
    "url": "https://gameknot.com/annotation.pl/fast-ladder?gm=52415",
    "gameName": "Fast Ladder",
    "players": "lame_duck (1968) vs. tat3225 (1755)",
    "opening": "QGD (D50), 4.Bg5"
}