{
    "moves": {
        "1. e4": "Here's a mini in from the fast ladder just finished this morning.  There is quite a disparity in ratings, and White deviates pretty early, but starts off with a line that Kasparov has used against the Accelerated Dragon.",
        "1... c5": "Having played 1...e5 for about 10 years and 1...e6 for 3 years, I have become a lifelong devotee of the Sicilian.",
        "2. Nf3 Nc6 3. d4": "Most lower rated players will try and keep the position closed, kudos to my opponent for the fighting spirit.",
        "3... cxd4 4. Nxd4 g6": "My beloved accelerated dragon.",
        "5. Nc3": "This is the move which I love to see as it most often is followed by the Yugoslav attack setup.  Again, Kudos to my opponent for this.",
        "5... Bg7 6. Nxc6": "The moment of truth!  White typically plays 6. Be3 Nf6; 7. Bc4, with the standard Yugo setup.  This move gives Black extra control over d5, but Kasparov has used it on occasion.",
        "6... bxc6": "6...dc, allowing the queen trade is playable, but I prefer to open the b-file to utilize by dark-squared bishop to the max.",
        "7. Bc4": "White is still playing quite aggressively, luckily, I am still in my preparation.",
        "7... Qc7": "7...Bxc3+ is also possible and good!",
        "8. Be3": "White never does get castled in this game and so I like 8. 0-0 here.  This removes any potential rook sac ideas on b2 should white play Rb1 to defend his queenside.",
        "8... Rb8": "Now Rb1 is silly.",
        "9. Qf3": "I expected 9. Bd4, as most players are keen to swap the black fianchetto bishop.  As most one move threats, it is easily dealt with as I kick off my queenside advantage.",
        "9... d5": "Anticipating 10. Bb3 Rxb3; 11. axb3 d4, with a slight advantage to black.  Instead White cedes the initiative to me and unnecessarily, a piece.",
        "10. exd5": "The open b-file and uncastled king are not good positional factors for white.",
        "10... Rxb2": "Hanging the knight and creating a whole series of problems for white.",
        "11. dxc6": "I saw a way to limit Blacks advantage with 11. 0-0 as 11...Bxc3 is a blunder after 12. d6, handing the initiative to white.  So after 11. 0-0 Rb4; 12. d6 ed, the f7-pawn is protected twice, but it looks like White's best chance.",
        "11... Bxc3+": "Now there is no hope for the White monarch.",
        "12. Kf1": "All other moves keep the White king close to the center.",
        "12... Nf6": "Blocking the White attack on f7 and developing.",
        "13. Bg5": "Uncovering an attack on the c3-bishop.",
        "13... Be5": "I didnt want to play Bd4 as I wanted to threaten the c2- pawn without allowing Qd3.",
        "14. Re1": "Setting up a tactic on the e-file, so I decide to neutralize it with...",
        "14... O-O 15. g3": "White tries to make some room for the king and link his rooks.  The position is still losing due to material and better coordination of the black pieces.",
        "15... Rxc2": "More material falls.",
        "16. Bb3": "Forcing me off the second rank, but I do get another pawn!",
        "16... Rxc6 17. Ba4": "Harassing my rook, but it only allows me to setup the final combination.",
        "17... Rc3": "Targeting the queen, but also with an eye on the white king.  Already I am seeing a potential sacrifice on g3.",
        "18. Qe2": " ",
        "18... Bh3+": "The most forcing moves get analysed first and here I saw huge material had to be given up to stave off mate.",
        "19. Kg1": " ",
        "19... Bd4": "Setting up the g3 sacrifice, but my opponent doesnt see it.",
        "20. Qd2": " ",
        "20... Rxg3+": "mate in 1!",
        "21. hxg3": " ",
        "21... Qxg3#": "Thanks to my opponent!"
    },
    "url": "https://gameknot.com/annotation.pl/fast-ladder?gm=25838",
    "gameName": "Fast Ladder",
    "players": "bowerbird (1328) vs. mybookrunsdeep (2043)",
    "opening": "Sicilian (B35), accelerated fianchetto, modern variation with Bc4"
}