{
    "moves": {
        "1. d4": "I'm most comfortable with Queen's Pawn Gambit",
        "1... d5": "Standard",
        "2. c4": "Queen's Pawn Gambit",
        "2... Nf6": "Standard",
        "3. Bg5": "I'm always mixed on this move. It often ends badly for me.",
        "3... dxc4": "Accepts the gambit one move later",
        "4. Bxf6": "I decided to double the pawns as I never get a lot of use out of my dark squared bishop anyway",
        "4... gxf6": "I was surprised here as it destablizes an king side castle but keeps the king's pawn available for central control",
        "5. e4": "Take the center",
        "5... e5": "Meets the move",
        "6. d5": "I thought the awkward pawn structure was worth keeping. I didn't want to trade queens nor did I like 6. ... exd4",
        "6... Bb4+": "Developing with a check",
        "7. Nc3": "My only good move",
        "7... Bxc3+": "This surprised me. I think it removes his good bishop and allows me a stronger pawn chain",
        "8. bxc3": "I'll take it",
        "8... f5": "Trying to remove his doubled pawns",
        "9. exf5": "I thought this was better trying to protect my pawn",
        "9... Bxf5": "Takes",
        "10. Bxc4": "Evens the game",
        "10... Be4": "Putting pressure on my g pawn. ",
        "11. Nf3": "Develop and relieve the pressure",
        "11... Nc6": "A blunder I think",
        "12. dxc6": "Always take advantage",
        "12... Bxc6": "Making the best of the blunder",
        "13. Qxd8+": "Up a piece I wanted to trade queens and also prevent any queen side castle",
        "13... Rxd8": "forced",
        "14. Nxe5": "I thought about short castle but I wanted to keep the pressure on with a fork threat",
        "14... O-O": "Short castle anyway. I thought perhaps 14. ... Bxg2 was better although it ends up even material after 15. Nxf7 Bxh1 16. Nxd8",
        "15. Nxc6": "Get rid of the threat of Bxg2 now that my fork is gone. Doubles pawns, eliminates his last Bishop.",
        "15... bxc6": "Takes",
        "16. O-O": "Connect the rooks. I thinking just Rd1 hoping for a trade bring my other rook into play. I knew I had to remember back rank checks to which I've fallen victim in the past",
        "16... Rd2": "Moving to the second rank which is always strong",
        "17. Rfe1": "Taking the open file",
        "17... Rc2": "Threatening Rxc3",
        "18. Re3": "Protecting the pawn and thus the Bishop",
        "18... Rb8": "Grabbing the open rank and threatening to connect rooks",
        "19. Rf3": "Keeping the c pawn protected and attacking his f pawn. ",
        "19... Rbb2": "Connecting and threating attacks along the 2nd rank",
        "20. Bb3": "Trapping his rook where it can't come to help against back rank attacks",
        "20... Rcd2": "Getting on open file",
        "21. Rxf7": "Now threatening a discovered check",
        "21... Kh8": "Running",
        "22. Re1": "Hoping for a back rank mate. Black's only move is Rd8 and then I start snapping up pawns",
        "22... Kg8": "Overlooked back rank, I've done it myself more than once",
        "23. Re8#": "I'm most comfortable with Queen's Pawn Gambit these days. This game hinged the blunder at move 11."
    },
    "url": "https://gameknot.com/annotation.pl/fast-ladder?gm=28506",
    "gameName": "Fast Ladder",
    "players": "tomlib (1200) vs. llosa (1026)",
    "opening": "QGD (D06), Marshall defence"
}