{
    "moves": {
        "1. e4": "An entertaining disaster incurred while watching the 1st Test between England and India, which is also turning into a bit of a disaster :-(  My opponent asked me where I got the idea for the Queen exchange from and I couldn't remember, so I decided to get the computer to analyse it and added a few of my thoughts ...",
        "1... e5 2. Nf3 Nc6 3. Bb5 a6 4. Ba4 b5 5. Bb3 Na5 6. c3 Qf6": "I don't like this early Q move, which just provides White with a target and threatens little at this stage.  It would be better to conclude the harrassment of the WSB by swapping the N for it.",
        "7. Bc2 Bb7 8. O-O d5": "This also seems hyper-aggressive.  The computer prefers 8...d6.",
        "9. d4 dxe4 10. Nxe5 Bd6 11. Qh5": "The computer doesn't like this either, suggesting that it throws away the advantage.",
        "11... g6 12. Qg5 Qe6": "and here it prefers the immediate exchange.",
        "13. Ng4": "Another mistake which should have helped Black to seize the initiative.",
        "13... f5": "Black spurns the opportunity to harrass the White Q immediately.  The computer prefers 13...f6.",
        "14. Ne3 h6 15. Qh4 Nf6 16. Rd1": "As on move 11, the computer prefers White to attack the Na5 with b4.  I think I considered it during the game but couldn't see the point.  The N suited me fine on the periphery.",
        "16... O-O-O 17. Nd2": "and now the computer prefers an immediate pawn assault with a4, followed by swapping off a piece and a pawn and then Na3.",
        "17... g5": "Now its assessment is -1.97: ie virtually a 2 pawn advantage to Black.  Given the danger to White's Q of getting trapped, it could be even greater.  My next few moves were dictated by concern for Her Majesty's safety.",
        "18. Qh3 g4 19. Qh4 Bf4 20. Nxf5": "? Desperation.  The computer points out that 20. d5 would have enabled the N to get out of the way by swapping on d5 with Black's N.",
        "20... Qxf5": "Now Black's advantage is 3.29",
        "21. Re1": "and this takes Black's lead to 6.10.  I should have preferred 21. Nf1, freeing up my DSB",
        "21... Bg5 22. Qg3 Rde8": "and now Black should have played 22...Nh5 23. Qe5 Qxe5 24. dxe5 Bxd2 25. Bxd2 Rxd2 etc",
        "23. c4 Bf4 24. Qc3": "This was the conclusion of my Q's escape plan but was another mistake.  I should have returned to h4",
        "24... Bxh2+": "Black returns the favour.  He should have preceded this with the diversionary 24...b4",
        "25. Kf1": "I mistakenly spurned the bishop offer, thinking that my defences would be fatally breached and Black would queen one of the menacing pawns.  I could have reduced my deficit from over 6 to 2.37 with accurate play.",
        "25... b4 26. Qe3": "Yet another blunder.  This would have been appropriate after 25. Kxh2 Qxf2 but now taking the pawn would have been better.",
        "26... g3": "Now this blocks the B on h2.  Better first to play 26 ... Bf4, attacking the Q.",
        "27. Re2": "Another blunder, taking Black's advantage to over 10.  Apparently 27. f4 would have restricted the deficit to about 6.",
        "27... Ng4 28. Nxe4": "??  and this more than doubles to deficit to over 22!  ",
        "28... Nxe3+ 29. Bxe3 Bxe4 30. Bxe4 Rxe4 31. Rae1 Nxc4 32. f3 Nxe3+ 33. Re2xe3 Rxe3 34. Rxe3 Qc2 35. Re2 Qd1+ 36. Re1 Qd3+ 37. Re2 Re8": "and finally I resigned, having run out of wriggle room and further possibilities of encouraging Black to blow his advantage."
    },
    "url": "https://gameknot.com/annotation.pl/fast-ladder?gm=55490",
    "gameName": "Fast Ladder",
    "players": "rjacobs (1532) vs. captron (1500)",
    "opening": "Ruy Lopez (C70), Taimanov (chase/wing/accelerated counterthrust) variation"
}