{
    "moves": {
        "1. e4": "this strange game deserves to be annotated, due to the surrealistic developments it evolved to. As I was confident I should lose it when the middle game showed white as much better placed in space, I decided to try some positional compensation for a rook sacrifice. It strangely worked, of course with a little help of my opponent. My moves are not correct in a chess master point of view. Though I like the game because of the erratic esthetic of it.",
        "1... c5 2. Nf3 d6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 a6": "the Najdorf tends to become my favorite as white or black, though I never play e4 as white, as I am afraid of 1 e4 e5\n",
        "6. Bg5 Nbd7 7. Bc4 e6": "black very defensive, condemned to crunchy position.",
        "8. Bb3": "I thought this was too much anticipation. But it may be theoretical, i am not sure",
        "8... Nc5": "i decided to give me some air",
        "9. Qf3": "pointing the right side!",
        "9... Be7 10. O-O-O": "sounds obvious, and until now, I see no real bad move from white.",
        "10... Bd7 11. Rhe1 Qc7 12. Kb1 O-O": "completing one of the usual configurations of a Najdorf",
        "13. g4 b5 14. Bh4 b4": "Black has to counter attack as soon as possible, or be crushed",
        "15. g5": "and... show time",
        "15... Ne8": "crunch, crunch crunch the space",
        "16. Nce2 g6": "of course, this aweakens h6 and f6, but it was almost necessary due to white pawn avance",
        "17. Qg2": "probably allowing f5",
        "17... a5": "continuing the counter-attack",
        "18. Bc4": "back from where it came",
        "18... a4 19. e5": "Shall I forget my rook? I could take e5, but would lose a8... Bad idea, of course.",
        "19... d5 20. Nf4 Rb8": "of course not dxc4... But next move could suit ",
        "21. Bxd5": "and here is the first sacrifice, from whities",
        "21... exd5": "accepted (I had few options)",
        "22. Nxd5": "gentle fork",
        "22... Qd8 23. Nf6+": "the idea, obvisouly, is to positionned a pawn on f6 ",
        "23... Bxf6 24. gxf6": "g7 has become \"the\" target.",
        "24... Qb6": "my counter attack has to accelerate",
        "25. b3": "I believe white had to go on the target faster",
        "25... a3": "b2 will become \"the\" other target",
        "26. f4 Nc7": "my guess was to counter ttack despite the importance to firbid anything to come on g7. Here, I had the idea to go on e6",
        "27. f5 Nb5": "changing plans",
        "28. Nxb5 Qxb5": "I was foreseeing Rd6 and didn't like it",
        "29. fxg6 fxg6": "according to the computer, hxg is better. But I thought it was hard to protect h8, h7 and g7 at the same time",
        "30. Bf2": "strqngely, white renounced to own attack",
        "30... Be6": "computer prefers Bf5. I can't but agree",
        "31. Rd6 Rb6 32. Red1 Nxb3": "to open queen attacking on e5",
        "33. Rxb6": "white proposes to exchange to abort my plan",
        "33... Qxe5": "i decline and offered rook and knight. Of course, the knight is now prohibited. And he has to impeach the queen move",
        "34. Bd4 Nxd4 35. Rxb4": "better than Rxd4, of course. Well seen? Computer says this is a blunder considering b7 instead",
        "35... Nxc2": "but it looks like Ne2 was better",
        "36. f7+": "new blunder? computer stills prefer Qb7",
        "36... Bxf7": "hopefully i made a new mistake here. R had to take",
        "37. Qxc2": "that is why B had to stay on e6",
        "37... Be6 38. Re4 Rb8+ 39. Kc1 Qb2+": "computer preferes Qg5, but my plan seemed ok from now.",
        "40. Qxb2 axb2+ 41. Kb1 Bf5": "i think this is a win",
        "42. Rde1 Rb4 43. a4 Rxa4 44. Kxb2 Rxe4 45. Rxe4 Bxe4 46. Kc3": "the rest is being hopeless though I made some approximation",
        "46... Kf7 47. Kd4 Bb1 48. Ke3 Kf6 49. Kf4 h6 50. Kg3 Kf5 51. h3 Ke5 52. Kg4 Ke4 53. Kg3 Ke3 54. Kg4 Bf5+ 55. Kg3 g5 56. h4 g4 57. h5 Ke4 58. Kh4 Be6 59. Kg3 Kf5 60. Kh4 Bd5 61. Kg3 Kg5": "avoiding a drawing pat",
        "62. Kf2 Kxh5 63. Kg3 Kg5 64. Kf2 Kf4 65. Kg1 h5 66. Kh2 h4": ""
    },
    "url": "https://gameknot.com/annotation.pl/fast-tournament?gm=42761",
    "gameName": "Fast Tournament",
    "players": "waynemo (1776) vs. thitho (1733)",
    "opening": "Sicilian (B94), Najdorf, Ivkov variation"
}