{
    "moves": {
        "1. e3": "I was puzzled by this however it did not alter my plans. ",
        "1... Nf6": "Standard opening.",
        "2. d4 d5": "Blocking progress in the center. ",
        "3. Nc3 g6 4. Nf3 Bg7": "Opening line for my B and preparing to castle. ",
        "5. Ne5 O-O 6. Qf3 Na6": "I realized this went against opening protocol. What I was avoiding was an early exchange. I was also using this move as a launching board for the next move positioning my N better. ",
        "7. e4 Nb4 8. Qd1": "My opponent smelled out my plan. ",
        "8... dxe4": "I claimed his center pawn. ",
        "9. Bc4 e6 10. a3": "If I had looked harder, I would have seen the opporunity to claim a sizeable material advantage and leave my opponent scrambling. ",
        "10... Nc6 11. f3 Nxd4 12. fxe4 b5": "Awkward movement on my behalf. I had not fully thought this move out.",
        "13. Bd3 c6 14. Be3 Bb7": "Development for the sake of development. I had better options available. ",
        "15. a4 bxa4": "This move left me in a precarious position later on. I misplayed horribly and my opponent took advantage. ",
        "16. Rxa4 c5 17. b4 Rc8": "I cannot recall what possessed me to move here. Very poor decision on my behalf. ",
        "18. Rxa7 Ra8 19. Rxb7": "My opponent claimed the easy captures and left me with a sizeable disadvantage. ",
        "19... Rb8 20. Rxb8 Qxb8 21. bxc5 Qb4": "I cannot recall exactly why I thought this was the better move vice Nxe5. I believe I wanted to pin his N.",
        "22. Qd2 Qxc5 23. Na4 Qa7": "I am pretty sure I was afraid of having my Q trapped in the middle of the board. ",
        "24. Qb4 Nxc2+ 25. Bxc2": "My opponent increased his material advantage. However, the center of the board was now open. ",
        "25... Qxe3+ 26. Kd1 Rd8+": "The computer likes Bh6 vice Rd8+. I was wanted to force my opponent into a mistake vice wait and be more reactive. ",
        "27. Nd3": "This was the blocking move I thought was least likely to occur. ",
        "27... Nxe4": "I opted to just move my N forward into a better attacking position. ",
        "28. Re1": "My opponents downfall. He took away his only escape. ",
        "28... Nf2#": "Mate. "
    },
    "url": "https://gameknot.com/annotation.pl/fast-ladder?gm=55783",
    "gameName": "Fast Ladder",
    "players": "mitchamm (987) vs. jallen85 (1121)",
    "opening": "Van't Kruijs opening (A00)"
}