{
    "moves": {
        "1. e4 c5": "Sicilian Defense",
        "2. Nf3": "By F A R the most common move at this point. Almost always leading to some manner of mainline, semi-open type of Sicilian position wherein WT plays d4. Although it is possible for him to play d3 after this, and enter a Closed Sicilian game, that is seldom played and is more limiting to WT than other move orders for a Closed Sicilian. The most common of those would be 2.Nc3 or 2.d3 for positions resembling a Kings Indian Reversed. The main alternative to those would be 2.c3, the Alapin Variation. My personal choice of response to that is 2...d5. Also possible would be 2.f4 for a Gran Prix Attack, tho this move order his earned some disfavor at present, with it being recommended now that the f4 idea be preceeded by 2.Nc3 in order to prevent BL from playing an immediate 2...d5, such as Tal has played, among others; which usually leads to WT finding himself \"embarrassed\", in wondering Why he has a pawn thrust out upon f4 all by itself. IMO",
        "2... d6": "2...d6 would allow me to go into either of my most usual Siclians; the Dragon Variation, or the Najdorf Sicilian. The Dragon has been of special interest to me. In Master/Expert level postal games from the 8th USCCC tournament I broke even in Dragon games. One Win and one Draw having the black pieces against Masters H. Anthony Buczko and Allen Wright, respectively. And a Loss with the White pieces vs the strong Expert, William J. Shipley, after I followed some analysis of a game played by Alex Sherzer which turned out to be insufficient in meeting Shipley's improved play as Black. Thus giving me a loss vs the ...h5 Soltis line after I played the sequence involving Bg5. I would now opt for ...Bh6 instead. But all this took place Before any of the Dragon games involving Kasparov were ever played~! So perhaps it will be time to reinvestigate the Dragon~? \nI have also played the Accelerated Dragon at times, but came to regard it as rather prone to draws. ",
        "3. d4": "As expected 98 times of 100 games. Although, for awhile in the late 1970's or early 1980's there was a fad to play 3.Nc3, to produce a finesse of such momentous importance ... that I can't remember Why anyone was doing it. Do you? If so, please bring Me to remembrance~!",
        "3... cxd4": "And presently, there is a quirky Blitz finesse being played, of avoiding 3...cxd4 and playing something else like ...e6 or Nf6 and then answering 4.dxc5 with Qa5+ and Qxc5 ... which I believe is solely aimed at changing the move sequence so that WT loses a bit of time changing his move, since he is probably holding a Nd4 hovering above that square to \"unclick\" for an Instant Nxd4 recapture. Objectively, WT probably does better to answer that with 4.d5 then. Or even 4.c3 making a durable center where BL will have lost a tempo if he should later play ...d5, such as after an ...e6 ala French Defense. All of which usually comes to little in a game of blitz Chess, unless it happens to be a one minute game, then the time lost in changing a move might mean something. But is most interesting and effective if/when someone has actually thought out a sequence like that where the opponent gets caught out a number of times, having to make a new move other than the commonly expected. And that is a fun part of lightning blitz, to try to set up such little quirks and finesses. Of course, you do know the technical difference between a Quirk and a Finesse? ",
        "4. Bc4": "Ah~! A Finesse~! He plays as I sometimes do myself. Offering Black a chance to enter a Smith-Morra Gambit type game if ...e5 is played and countered by c3. Tho it can become quite different than mainline play of that opening since, for instance, WT might play Ng5 vs ...e5 and then BL counters with ...Nh6 which is usually only seen in Accelerated Dragons at times. So it would get a bit odd, compared to the usual Smith-Morra game. Rather than just being up a tempo for Black since he plays ...e5 without the customary ...e6 before that. ",
        "4... e6": "Another Finesse. I let him know that I have no intention of entering the pseudo-Morra. Now it can easily become one of several Sicilians such as the Scheveningen, for one. Which is really the only one I myself play. Not being well versed in Paulsen/Taimanov etc. Too bad tho, it appears we shall not see a Dragon game after all. ",
        "5. Nxd4 Nf6 6. Nc3": "Have you figured it out yet? The way I see it is ... A Finesse is some unexpected move that makes me think \"That's Interesting!?\" ...and might be something that I would play. On the otherhand, a Quirk is an unexpected move that makes me think \"That's Irritating\", I'd never do That . . .  }B-( \n***\nI guess its a bit subjective. ",
        "6... Qc7": "...Qc7 was played with the intent of following 7.Bb3 with ...Nc6 for a Modern Scheveningen. The Old Scheveningen plays ...a6 to stop Nb5 from attacking BL's Queen. However, it is no longer felt that such a prophalactic move is necessary. So the Modern Schev. simply allows it and using the retreat ...Qb8 if needed. Then the WT Knight can be kicked out later by ...a6, with tempo. ",
        "7. Bg5": "7.Bg5??  Neither a Quirk nor a Finesse, but . . . a very great surprise~! Did he simply play at a glance and miss the threat? I do not know. Yet I find my game gets more difficult than I ever would have expected it to be after his next move, despite being a piece ahead. It may well be a deficiency of my own play that I seem to have trouble handling my Sicilian with doubled f-pawns. And so I do try to avoid the formation entirely, when possible. For instance, I do not play the Poisoned Pawn variation that Bobby Fischer so enjoyed. ",
        "7... Qxc4 8. Bxf6 gxf6 9. Ndb5": "Appears that Qc6 would be insufficient. Remaining candidates:Qc5 seems it may be the most solid at this time. And if then 10.Qf3 f5?! 11.ef5 Qf3 12.gf3 BL can still have chances of getting mated even with the Queens off! \n***\n9...Kd7 selfpinning K may have related problems, at a glance. Remaining is 9...d5!? but then tricky is 10.Nxd5!? \nAlso 9...d5 10.b3! Qc5 11.ed5 ed5 12.Nd5 seems to bust BL's idea. \nWhat was hoped for was 9...d5 10.ed5? Bb4 and after either d pawn move now, BL is fine. I felt great temptation to try playing 9...d5 but fortunately was able to restrain my self by repetitions of a Postal Chess mantra, \"Play what's GOOD, like I should; not play trappy, then be unhappy\". In the end, I came to believe that ...Qc5 here was really the only fully sufficient move. And that makes an odd circumstance, for being a piece ahead~! ",
        "9... Qc5 10. O-O Bd7 11. Qd3 Bxb5": "I do want to take off as many pieces as I can, without overly compromising the security of my position. Both to come closer to a winning endgame, and to minimize his forces available for future King hunting. For the security of my King is a very top concern to me here, and I do not like the options available to him. But one must expect to go thru some trouble if that is what it takes to be a piece ahead. ",
        "12. Nxb5 Nd7 13. b4 Qb6 14. a4 Ne5": "I want to be aggressive and active in my play, and not give him time to rally his remaining forces against my King. Yet I realize that this Knight move entails some risk. For in placing it upon e5, it may become an additional target for him, and gain him tempo, in simply following his most natural attacking idea, which is to advance his f-pawn. But I have judged my resources to be just sufficient to defend and counter. ",
        "15. Qc3 Kd7": "This King move is even more commital. In looking back, I believe I would have felt more secure to have played Bg7 and O-O as similar to a Sheveshnikoff Sicilian. ",
        "16. Rad1": "A sample line I looked at. I often run thru lines of play during a game, to see how things might go in general, even tho not being absolutely precise in the analysis. Rather I look for ideas to come up. And if something interesting does, then look closer to how to make it happen, and what difficulties and resources exist towards that end. In this case, I was quite concerned about his taking the g-file with his Queen, since I was desirous of placing my Rook to that file. And his Queen going there would forestall my Rook placement. \n***\n16.\tRad1\ta6\n17.\tNa3\tRc8\n18.\tQg3\tBe7\n19.\tKh1\th5\n20.\tf4\th4\n21.\tQb3\tNg4\n22.\tNc4\tNf2+\n23.\tKg1\tNh3+\n24.\tKh1\tQg1+\n25.\tRxg1\tNf2  He can defend it by 22.Rd2 however \n*****",
        "16... a6 17. Nd4 Rc8 18. Qb3 Be7 19. a5 Qc7 20. f4": "I was aware of the potential plan of WT to try overburdening the defenses of the e6 square from being attacked by both his Queen and Knight then advancing the f-pawn to f5; with hopes to so overwhelm the square (where the presence of my pawn is really only incidental to his desire to conquer that square) that he can make his final capture there with a Queen Check ...and so place my King in great jeopardy. In choosing to retreat my own Queen to c7 rather than Qa7, I did elect to release him from the pin of his f-pawn & Knight to his King, knowing I would have ample time to defend, however. The two responses now deserving the greatest attention by black, appear to be either 20...Nc4 or 20...Nc6. ...Qc4 would deserve review if it were not that the Ne5 is now under attack and must yield.  I favored ...Nc4 here since it will ease his pressure on ...e6. BL hopes it will permanently do so, and so chooses it with that intention. Also to consider is ...Ng6/Nf8 or ...Nc6/Nd8, tho this seems to me the least preferential location as a defender, even tho it does cover f7 as well as e6. Of course going to g6 does make an immediate target of the N for the f5 push and so the further retreat to Nf8 would then need to be immediate. \n",
        "20... Nc4": "Now it is important for WT to realize the nature of the position and potentials. Despite his +Piece, BL does not have a lot of ability to advance pawns or greatly improve his position without creating weakness or decreasing his King security, which is only sufficient. Such being the case, WT must look carefully to be certain he has no means for immediate win; To be able to force some gain or significant infiltration at once. Then seeing he does not have that, but realizing the difficulty of BL to try grabbing the initiative away; that in fact BL is pretty much relegated to placing his pieces as effectively as possible for defense, to be as responsive as possible to whatever manner of assault(s) WT may attempt ... WT should know that his proper approach will be to place all his own pieces as effectively & aggressively as possible; using whatever time (tempos) is needed to do so, without rushing. And only when fully situated should he initiate his assault. Indeed, being a piece behind it may be that he would wish only to situate effectively enough so that the threat of his assault can be stronger than its execution. Just strong enough so that Black cannot himself attempt to progress towards winning of the game. One can often find such type of situation in a Smith-Morra Gambit for instance ... where WT may not have winning position, but sufficient pressure created from his open lines and Rook placements, that BL can not press forward and convert his extra pawn into a win. I have also seen similar in the Goring Gambit. In neither of those have I actually ever had an opponent take the extra pawn and convert it to a win. Rather, when a loss would come as WT it would be due to factors from the middle-game. IE being \"outplayed\" or oversight. I have also seen pressure in d-pawn isolani positions, such that the isolani might be captured, but in doing so the player would unleash such pressure & havoc upon himself, that discretion pre-empted winning of the pawn. ",
        "21. h3 h5": "Looking back, I am not really sure Why I played ...h5. Maybe because I was not really sure why He played h3 ...!?  }B-)   Was I thinking of the dubious principle that \"One baffling move deserves another?!\"  Probably I wanted to be sure of getting another open line to his King if he did advance his pawns there. And in so doing, to somewhat discourage him from overly adventurous pawn rolling there. However, in letting the h-pawn stride forth so boldly, it risks tying my Rook to its defense or having the pawn become a liability as an added weakness in an endgame. Unless it should happen that it were to advance to h4 in a situation where the Be7 could protect it there. Once again, even at this point in the game, I am a piece ahead but the position does not \"Feel\" like being a piece ahead. Definitely his are more active and better places. Plus my King continues to be the primary concern and must be constantly looked out for ... with every move and every idea played. It would be very easy for this position to become disastrous for me. It would only take the overlooking of one check or one idea, and things could fall like a house of cards. ",
        "22. Rf3": "Is this the idea I overlooked? Well I probably did not give sufficient consideration to it. But it is as good, and natural an idea as it seems to be. And so he will induce me to make yet another move that will trade-off one risk for another.  ",
        "22... b5": "It may appear that ...b5 bolsters the protection of my Nc4, and that was a consideration. Yet the move can be seen as weakening of a6, as well as bolstering to c4. Now there will is always a potential that he might sac Nxb5 in such a way and time, that his having a protected passer at a5 could be very dangerous or maybe even winning. So I accept yet another object of attack to place under constant vigilance. But the move does give more scope to my Queen & Rook for movement & protection behind my pawn structure. It also eliminates his potential to advance b4 to b5. And it is now very unlikely he might ever be able to place his Nb6. Also I have regained the potential to pin his N to K by Qa7. A trade-off of risks & potential. ",
        "23. e5": "Reverting to the point previously discussed, WT might have been better off to have taken his time before making such a pawn break. He could have first placed his King where it would not be subject to getting his N pinned by Qa7, or being placed in check by that move if he ever removed his N from d4. So doing would then reduce the potential for counter-play. Another thing he might have tried before committing would be having repositioned toward several different threat ideas, to see how & if BL responded adequately. For instance he could have positioned toward making a RxNc4 sac with threats of Q-side pawn advancement. Or positioned for Nxb5 sac with a-pawn advancement. Or to look for ways he might threaten both fields of play; Q-side and Center vs the King. Might he have made threats of initiating one attack and being able to jump to the attack in the other field of play? \nI think those chances actually were probably insufficient for him considering the reduced pieces available and only two pawns placed for involvement in a center break. Yet if he had been able to advance his pawn to g4 and involve it, while keeping King security !? \nAgain, it is my feeling that he would fall short again due to having no real placement of complete King security available to him if he did make that pawn advance. But those are things that should be looked at very well. And indeed, it seems to me that BL might be in a very fearful circumstance here if only WT still had another piece upon the board~! Especially considering that it would be available to be sacrificed freely & leave him no worse off than at present~! In fact, it would not surprise me to find BL in a totally lost game here if WT did have another piece on the board. Particularly a Nc3 for instance? OR ...? \n***\nSo there is a worthwhile exercise to play with in analyzing such as this game. Can you look at the board as it was just after 22...b5 and find a way to add a piece on the board for WT; choosing what piece, and where to place it, that would make a winning game for WT? The point being, to hone your ability to create that winning position, and be able to identify and play towards such in a real game!? This type of \"fantasy\" exercise can be quite helpful in learning to \"think schematically\" in placing your pieces to be winning. And schematic thinking is particularly important in pursuing endgame points. Capablanca pointed that out in his own technique of looking at an endgame such that he would visualize where the existing pieces should be placed that would make it a winning endgame. And then you need only look for the means of reaching that formation. To know where you are going, and then seeing how to get there.\n ...... \n     Like reading a Road-Map and looking from Point-A (where you are) to Point-B (the destination) and calculating the route to get there quickest. Rather than just seeing Point-A and then picking roads that head in the general Direction of the destination, from one to another and a",
        "23... d5": "The way to guarantee a line opening of the f-file here would be to now play 24.f5 since the e8 pawn is presently rendered immobile and cannot push past. Thus the line Must open. But that is a point of technique only, since  of course 24...Nxe5 would be bothersome. So he will settle for opening of the e-file now. And then play to try opening his f-file as well, to get as many access routes to my King as possible~! BL must also be aware and watchful for moves such as Nf5 to undermine the d-pawn and open that file, making sure his defensive resources remain sufficient to meet such a bold attempt.  ",
        "24. exf6 Bxf6 25. f5 Bxd4+ 26. Rxd4": "Now the Candidates of greatest interest seem to be 26...Qe5, or the move I have been intending to make here; 26...Nd6 . I should also review 26...Qa7 to be sure it cannot be played safely enough, to win his Rd4 via ...e5 push or any other idea?! And doing so, it can be found to be 3 distinct ways for BL to lose his Q by playing 26...Qa7|~??! Such as this:\n***\n26.\tRxd4\tQa7\n27.\tfxe6+\tKxe6\n28.\tRe3+\tNxe3\n29.\tQxe3+ Kd7\n30.\tRxd5+ Kc6\n31.\tRc5+\tKd7\n32.\tRd5+\tKc6\n33.\tRc5+\tKd7\n34.\tQd4+\tKe7\n35.\tRe5+\tKf8\n36.\tQxa7\t\n*** \nFor an EG of Qe5: \n\tBxd4+\n26.\tRxd4\tQe5\n27.\tfxe6+\tfxe6\n28.\tRf7+\tKe8\n29.\tRdf4\tRh7\n30.\tRf8+\tKd7\n31.\tRf4f7+\tRxf7\n32.\tRxf7+\tKd6\n33.\tRa7\tRc6\n****\n",
        "26... Qe5": "A change of plan, going with the active 26.Qe5",
        "27. fxe6+ fxe6 28. Rdf4": "I had expected 28.Rf7+ here, which I do believe to be better than the game move that allows my Nd2 fork. In either case, my King will go to his safe haven, Kd6. Finally a place to call home, which proves to be quite snug & secure compared to the actual and potential residencies of the past. \n***\nIt may be, however, that WT chose the Rdf4 move as he did, in order to present the trappy play and provide the potential for errors that are soon reached in the game. If so, that is not an unreasonable method to chose a this stage of the game, since BL can now see his way to a win vs normal play by WT, even vs \"best play\". So optimizing the opponents chances to make choices that err is a very practical approach in such a case. Perhaps even advisable. ",
        "28... Nd2 29. Rf4f7+ Kd6 30. Qe3": "30.Qe3 would save WT if only Nxf3 were not with Check. But it is what it is, and that includes Check. ",
        "30... Nxf3+ 31. Qxf3": "31.Qxf3 of course. 31.Rxf3 ? Qxe3 32.Rxe3 would be too lost to even continue. Then thinking Schematically BL would realize he need only Rxc2 and other Rook to f-file cutting off WT King, to roll the center pawns in to Queen. Also that if he play Rc6 it would eliminate ever facing any danger, but that it is not even necessary to play it. \n   See how easy that would be? After developing the Schematic for the ending, BL need not even ever think again, for the rest of the game. So of course we can see why WT would never go into that sequence, besides the fact that he correctly wishes to maintain his most dangerous and active piece on the board, his Queen, as is proper when playing at material deficiency. Then the defender should try to trade or eliminate pawns, while maintaining pieces on the board. Thus generally provides the greatest chances of making a Win from opponent error, or a Draw. ",
        "31... Rxc2 32. Ra7": "I looked at winning his Rook by 32...Qd4+ 33.Kh2 Qxa7? but this is one of the trappy lines he has set for me. And he can then start using his Queen checks against me. For finally my King would be at his mercy. And I would not be expecting any mercy~! \nI arrived at 32.Rc1+ 33.Qf1 Qe3+ (or 33...Qd4+ also) being the most accurate win. Slightly shorter than to play 33. ...RxQf1+ 34.Kxf1 etc. It does seem a little surprising to see that it is quicker to win by leaving his Q on the board than removing it instantly. \n32.    Rc1+\n33.\tQf1 Qe3+\n34.\tKh2 Rxf1\n35.\tRxa6+ Ke5\n36.\tRxe6+ Kxe6\n37.\ta6 Rg8\n38.\ta7 Qg3#\n",
        "32... Rc1+ 33. Kf2 Qe1#": "My last \"personal\" move was Rc1+. I had entered 33...Qe1# then as a Conditional Move, but not expecting it to be triggered. Rather expecting to see 33.Qf1 and then my other conditional move sequence of 33...Qe3+ 34.Kh2 Rxf1 35.h4 Qe1 36.Rxa6+ Ke5 37.Rxe6+ Kxe6 38.Kh3 Rh1#. \n** ** ** ** ** \nI congratulate my opponent on producing the difficulties presented in this game, and making such a sporting effort after the early oversight, losing a piece. I am glad this was not \"Bughouse\" where he might have had an extra piece sitting on the edge of the table, just waiting to be \"dropped\" upon the board, wherever needed~! Or I would not fancy my chances if that were the case.  }8-) "
    },
    "url": "https://gameknot.com/annotation.pl/fast-ladder?gm=25157",
    "gameName": "Fast Ladder",
    "players": "palmeiras (1435) vs. ccmcacollister (1804)",
    "opening": "Sicilian, Chekhover variation (B53)"
}