{
    "moves": {
        "1. e4 e6": "The French.",
        "2. d4": "Standard.   If black's going to offer me the centre, it'd be rude not to accept.",
        "2... d5": "And an immediate challenge.",
        "3. Nd2": "The Tarrasch.   At various stages, I've played the advance and the Winawer as well, but I've settled on the Tarrash the past couple of years.   Maybe that'll change again in the future!",
        "3... Nf6": "This or 3. ... c5 are the most common; a matter of taste for black really.",
        "4. e5 Nfd7 5. Bd3": "The best diagonal for white's light-squared bishop in the French, usually.   Here, it targets h7, which is that bit weaker now that black's knight can't get to f6.",
        "5... c5 6. c3 Nc6 7. Ngf3": "7. Ne2 is more usual here; I like this line, where I tempt black with the offer of a free pawn - 7. ... Qb6 8. O-O cd 9. cd NxP?! 10. NxN QxN 11. Nf3 with a natural attack.   I've played this line four times between here and over the board games, winning each time.",
        "7... a6": "Presumably preparing a queen-side storm, though black is better advised to reclaim the f6 square by 7. ... f6.",
        "8. O-O cxd4": "Again, a standard motif in the French; black attacks white's pawn chain and hopes to create a decisive weakness on d4.",
        "9. cxd4 Be7 10. Re1": "Centralising the rook, and also allowing for the d-knight to manoeuvre via f1 to a more active spot on either e3 or g3.",
        "10... O-O": "Always a teensy bit risky in the French; black needs to play an f6 push sooner rather than later so as to get some pieces back protecting his king.",
        "11. Nf1 Nb6": "?!   I don't like this; the knight does nothing here. Again, 11. ... f6 12. ef Nxf6 was preferable to untangle black's position a bit, I think.   I don't have to take, of course, but then 12. Ng3 (say) fe 13. de Qc7 and the e-pawn is coming under a bit of fire.",
        "12. Ne3 Bd7 13. Qc2": "Looking to force some concession in black's kingside defences, though Black can probably meet this fairly comfortably with 13. ... h6, followed by 14. ... Rc8, harassing my queen.",
        "13... Nb4": "? Instead, black tries to trade off white's LSB.   He succeeds, but at a cost...",
        "14. Bxh7+": "Naturally.   Presumably black overlooked this move.",
        "14... Kh8 15. Qb1 g6": "Trapping the bishop.   The gameknot analysis prefers this over the meek concession of the h-pawn.",
        "16. Bxg6": "Again, naturally.   Black's king is going to be fairly exposed.",
        "16... fxg6 17. Qxg6 Qe8": "Looking to swap, but also to distract white's queen from defending the c2 square.   GK analysis calls this a mistake, and wants black to complete development with 17. ... Rc8 instead.",
        "18. Qh6+": "Obviously my attack is severely blunted if I swap.",
        "18... Kg8 19. Ng5": "Threatening mate.",
        "19... Bxg5": "?!   Better was 19. ... Rf7, but I just drop another piece into the attack wth 20. Ng4.   The text see Black lose one of his defenders.   My queen has the g5 square as well, and I've more pieces to follow up the knight I've lost, whereas black's minor pieces aren't contributing to their king's defence.",
        "20. Qxg5+ Kh7 21. Ng4 Nc2": "??   In desperation, black goes for the knight fork, and prays to luck at the other end.   His luck's not in though...",
        "22. Qh6+": "Naturally.   g5 is now freed for the bishop too.",
        "22... Kg8 23. Bg5": "A \"blunder\" actually; analysis called a mate in 9 here - 23. Nf6+ Rxf6 24. exf6 Qf7 25. Re5 Qh7 26. f7+ Kxf7 27. Qxh7+ Ke8 28. Bg5 Kf8 29. Bf6 Nxa1 30. Qg7+ Ke8 31. Qg8#   Still, winning the game is all that matters!",
        "23... Rf5": "Back to mate in 5.   Analysis preferred scrambling a piece back to defend by 23. ... NxP, but black is still lost after 24. Bf6 (threatening Qh8+ and Qg7#) RxB 25. NxR+, forking king and queen.",
        "24. Nf6+": "And black resigned in light of 24. ... Rxf6 25. Bxf6 Qe7 (which just prolongs mate by one move) 26. Qh8+ Kf7 27. Qg7+ Ke8 28. Qxe7#"
    },
    "url": "https://gameknot.com/annotation.pl/fast-mini-tournament-ii?gm=47750",
    "gameName": "fast mini-tournament II",
    "players": "cdeburca (1715) vs. zigi (1478)",
    "opening": "French (C05), Tarrasch, closed variation"
}