{
    "moves": {
        "1. Nf3": "Reti",
        "1... c5 2. c4 Nf6 3. Nc3 e6 4. g3 b6 5. Bg2 Bb7": "Opposed fianchetto; promises of a center battle that will be delayed.",
        "6. O-O Be7 7. d3 O-O 8. b3 d6 9. Bb2": "double fianchetto from my side. These are my favorites, but they are so rare.",
        "9... Nbd7 10. e3": "completing the opening: keeping the center is not occupying the center.",
        "10... a6 11. Qc2 Qc7 12. Rad1": "I know I had to focus on the center, but confronting a better player, I hesitated various moves.",
        "12... h6": "completing the defense",
        "13. a3": "projecting an eventual b3.",
        "13... Rac8": "b3 is cancelled :-)",
        "14. Rfe1": "center, center, center... But just after having done this move I thought to myself f2-f4 was unavailable; and it could have been important to play f4 some time.",
        "14... Rfe8 15. e4": "I thought about Nh4, but I wanted not to exchange the clear bishops",
        "15... e5": "from now, i focused Nd5. I really believe 15. ... e5 was a good move for white. Black can't put their knights on d4 very fast (could have played Nf8-e6, but it is long.",
        "16. Nh4": "now, f4 is clear",
        "16... g6 17. Ref1 Ng4": "threatening Bxh4",
        "18. h3 Bxh4 19. hxg4": "I wonder if black intended me to take h4. But I preferred to keep more centered pawns on f and g columns than on h column",
        "19... Bf6 20. f4": "at last!",
        "20... exf4 21. gxf4 Bd4+": "this was obvious, maybe too obvious. I had the intention to move K anyway.",
        "22. Kh2 Nf6": "free spaces for queen and Bb7 to come back on the other side",
        "23. Bh3": "almost forced, though I was seeing my bishop blocked there for a long time.",
        "23... g5": "I must recognize I would not have known what to play with black. Perhaps moving queen and Bb7 in the other side direction.",
        "24. fxg5": "i feel comfortable, here, with a half-column open for my rook.",
        "24... hxg5 25. Nd5": "And now blocking any possibility to open e-column for blak towers",
        "25... Nxd5 26. cxd5 Qe7": "at last, yes.",
        "27. Rf5": "by threatening g5, I focused on... f7... eternal f7",
        "27... Rc7": "protecting f7? No, opening spaces for bishop",
        "28. Qd2": "forcing next move",
        "28... f6": "f7 becomes f6: losing 2 defenders (rook c7 and king)",
        "29. Bxd4": "my queen was too busy",
        "29... cxd4": "the inconvenient, in my plan, is that I opened the c-column for the enemy; but I planned to be faster.",
        "30. Rdf1 Rf8 31. Qf2 Bc8": "this was a surprise. Why not Kg7? of course, I could eat d4, but it was a weak pawn anyway, and less necessary at first sight. Maybe black was already planning to \"pass\" this pawn after eating d3",
        "32. Rxf6": "sequence?",
        "32... Qe5+": "No! Surprise!!",
        "33. Kh1": "Of course: 33. Kg2 Rxf6 34 Qxf6 Rc2+ is very mortal; and Kg1 is probably the worst: \n33. Kg1 Rxc6 34 Qxc6 Qg3+, mortal too",
        "33... Rxf6 34. Qxf6 Qxf6": "Is there any other possibility?",
        "35. Rxf6": "end of sequence, after all, one pawn up",
        "35... Rc3": "was Rc1+ better?",
        "36. Bf1": "the other option Rf3... was not an option: would have lost a and b pawns.\nthe other option Rxd6 was foolowed by Rxd3 and black is better because white has to save the bishop before considering any other thing (even the Rg6+-Rxf6 is not very interesting right now)",
        "36... Bxg4": "hard to see; maybe Rxb3 would have been interesting too. But i am pretty sure white next move determines the victory. Was there previously a way to impede it?",
        "37. Rxd6": "now, 2 passed pawns.",
        "37... Rxb3 38. Rg6+": "discovering the pawns and recuperating a tempo",
        "38... Kf7 39. Rxg5 Bd7": "best move, i guess",
        "40. e5 Ke7": "I wonder if Bb5 was better or not. Anyway, either the king or the bishop had to move.",
        "41. Rg7+": "gaining another tempo",
        "41... Kd8 42. e6": "once again... a tempo...",
        "42... Bb5": "i am pretty sure move 39 was really bad. Though, maybe black was no more convinced he could win.",
        "43. d6": "\"when a pawn is passed and can go to queen, push it.\"",
        "43... Rb1": "of course not Bxd3 followed by Rg8x",
        "44. Rg8+": "almost mate",
        "44... Be8 45. d7": "strangely most other moves here could have given back an opportunity for black, allowing Re1; and e7 was not interesting at all, giving fresh air to both king and bishop.",
        "45... Rxf1+": "compensation check",
        "46. Kg2": "there is no way to escape from a new white queen now."
    },
    "url": "https://gameknot.com/annotation.pl/fast-tournament?gm=42757",
    "gameName": "Fast Tournament",
    "players": "thitho (1733) vs. waynemo (1776)",
    "opening": "Reti opening (A04)"
}