{
    "moves": {
        "1. d4 Nf6 2. c4 e6 3. Nc3": "I decided to allow the Nimzo-Indian, something I've avoided until recently, preferring either the Bogo-Indian or the Queen's Indian, but I don't think my results against either of those openings has been great.",
        "3... Bb4 4. e3": "The calm approach ...",
        "4... O-O 5. Bd3 d5 6. Nge2 dxc4 7. Bxc4 Nbd7 8. O-O c6": "Black adopts a solid formation, akin with the Slav and the Caro-Kann.  I hate having to deal with this...",
        "9. a3 Bd6": "Black maintains an aggressive posture with this bishop.",
        "10. h3": "Not so much to make a hole for the King at this stage as to prevent ...Ng4, attacking h2.",
        "10... b6": "Black prepares a Queen's Indian style fianchetto.",
        "11. Qc2": "This seemed a sensible posting for the Q, looking both at c6 and h7, and allowing Rd1 to support the d-pawn and point at the Bd6, Nd7 and Qd8",
        "11... Bb7 12. Bd3": "Increasing the pressure on h7 but not threatening anything concrete yet.",
        "12... e5": "If either c6 or d6 were to move, I'd have expected ...c5 first, so this came as a slight surprise.",
        "13. dxe5 Nxe5 14. Nd4": "I decided to improve the position of this N rather than try to prevent Black swapping off the Bd3, since I didn't expect to be able to complete the attack with the Q and B on h7.",
        "14... Nxd3 15. Qxd3 c5 16. Nf5 Be5 17. Qc4": "but I didn't want to swap Queens yet.  I already had designs on f7, though nothing concrete yet.",
        "17... Qc7 18. e4": "I needed to block the lsb's diagonal and to free up my dsb at the same time.",
        "18... Rad8 19. Re1": "Nimzowitschian over-protection of the e4 pawn.",
        "19... Rd7": "Black prepars to double on the d-file, so White needs to complete his development quickly.",
        "20. Bg5": "If Black completes his doubling, the Nf6 will be pinned.",
        "20... Bxc3": "!",
        "21. bxc3": "If 21. Qxc3, N or B xe4.  Material is still even but White's pawn structure is ruined.",
        "21... Nxe4 22. Rxe4": "! White gets 2 minor pieces for the R+P",
        "22... Bxe4 23. Qxe4 Kh8": "?! not sure what this was in aid of",
        "24. Re1": "Threatens a back row mate",
        "24... Qc8": "Perhaps this clears my last point.  25. Ne7 is not a fork with check.",
        "25. Ne7 Qa8 26. Qg4": "I still didn't want to swap Queens and thought it would be useful to attack his Rd7.",
        "26... f6": "? If this was a deliberate exchange sac, I'll eat my hat.",
        "27. Qxd7 fxg5 28. Nf5": "Threatens mate in one with Qxg7",
        "28... Rg8 29. Re7": "Threatening 30. Nh6 gxh6 followed by Rxh7# or 30....R moves Rxg7 followed by Rah7#",
        "29... Qd8": "This doesn't work but does allow a pretty finish.  I don't think Black could escape mate at this point.",
        "30. Nh6 Qxd7 31. Nf7#": ""
    },
    "url": "https://gameknot.com/annotation.pl/fast-ladder-another-smothered-mate?gm=27330",
    "gameName": "Fast Ladder - Another Smothered Mate",
    "players": "rjacobs (1586) vs. fourgmbari (1582)",
    "opening": "Nimzo-Indian (E48), 4.e3 O-O, 5.Bd3 d5"
}