{
    "moves": {
        "1. e4": "The last game of the tournament -- I have had a good run so far !",
        "1... Nf6": "Alekhine defense , Joji has played this against me earlier . Black provokes white to advance  the pawns and then attack later ",
        "2. e5 Nd5 3. Bc4": "last time I played d4 ( which is main line ?)",
        "3... Nb6 4. Bb3 d5": "d4 ? or exd6 ?",
        "5. exd6 e.p. cxd6 6. Nf3": "Black cannot play Bg4 and pin the knight .",
        "6... g6 7. Ng5": "?\nToo early ? \nI played this to that black plays e6 /e5 . e6 blocks the light Bishop and e5 leaves black with backward d pawn",
        "7... e6 8. d4": "I almost always try to put pawns on c3,d4  to defend against the fiancheto bishop",
        "8... Bg7 9. c3 O-O 10. Be3": "I dont know a good place for the Bishop . But played thios so that I can play Nbd2 without blocking the Bishop",
        "10... Bd7 11. Nd2 d5": "Now my White Bishop is losing teeth ?",
        "12. f4": "Looking to occupy e5",
        "12... Nc6": "Black is eyeing to put a Knight on c4 ... or get the Bishop pair",
        "13. Bc2 Rc8 14. Ngf3": "plan to go to e5 and attack the light Bishop",
        "14... Na5 15. Bd3 Nac4 16. Nxc4 Nxc4 17. Bxc4": "17 ...Rxd4 is responded with 18 Ne5 getting back the bishop for Knight  or just keep the Knight on e5",
        "17... dxc4": "Black gives up the half open file and also the e4 square ?",
        "18. Ne5 Bc6": "My Knight is well placed , Black's light bishop is active.If I take the Bishop out , I can contain the dark Bishop . ",
        "19. Nxc6 Rxc6 20. a4": "?\nto prevent b5",
        "20... Qh4+": "?\n",
        "21. g3 Qh3 22. Qf3": "At this point I wanted to Play Qf1 and drive the black queen away.. Later I decided to try to contain the the Black Queen rather than drive it away ",
        "22... Rb6": "The b2 pawn ...Can Black get more forces to atack on this \nI had to chose between Rb1 and Ra2.\nOn Rb1 , black may play Qf5 ?\nand Ra2 supports the a4 pawn as well and if given a chance the rook can go to a7 ",
        "23. Ra2 Rb3": "Black intends to double up . at this stage I thought black cannot double up since I have the a4 pawn ( I was wrong )",
        "24. Qe2": "change of plans -- instead of playing Qf1 I played Qe2 since I was afraid of Qf5 and Qc2 or Qb1",
        "24... Rc8": "black has to protect that ",
        "25. g4": "containing the black queen .. will follow up with Rg1 and Rg2 or Rg3",
        "25... Rd8": "Black is threatening   26 ...Bxd4  27 Bxd4 Rxd4  and I cannot take with my pawn ",
        "26. Rg1": "so that I can play Rg3 in between",
        "26... Bf6": "Plans to play Bh4 . But I get a temp to play g5 and then block the queen with Rg4 ",
        "27. g5 Be7 28. Rg4 Rd5 29. Kd2": "Use the King to protect the bpawn",
        "29... b5 30. axb5": "else b4 looks bad for white ?",
        "30... Rdxb5": "ahh ....now double rooks on b file.... I will get my Bishop to f1 ",
        "31. Kc2 a5 32. Bc1 Bf8 33. Ra4": "attacking the c pawn -- but I had no intention of taking it -- since I was scared of Ba3",
        "33... Rb3b4": "guarding the c pawn .\n34  cxb4 too risky with Qb3+",
        "34. Ra3 Rb4b3 35. Ra4 Rb3b4 36. Ra3 Rb4b3 37. Ra4": "Drawn by repetition"
    },
    "url": "https://gameknot.com/annotation.pl/ferdinando-carulli-rd-5?gm=62863",
    "gameName": "Ferdinando Carulli Rd 5",
    "players": "Kumar,Mihir (1752) vs. Escoto,joji (2002)",
    "opening": "Alekhine's defence (B02), Kmoch variation"
}