{
    "moves": {
        "1. e4 d5 2. exd5 Nf6 3. d4 e6 4. dxe6 Bxe6 5. Bd3": "All theory till now, but this is not on my personal database... :-) I guess Qxd5 gives some tempoes in return to white, so the scope of my defence will be lost. ",
        "5... c6": "Played almost authomatically, though. ",
        "6. Ne2 Nbd7 7. O-O Bd6": "I am a little late - as always - with my queenside ideal castling. ",
        "8. Bg5": "This helps me in winning the needed tempo.",
        "8... h6 9. Bh4": "True is that this B will block my attack on h2. ",
        "9... Qc7 10. Bg3 O-O-O 11. Bxd6 Qxd6": "A different asset from my usuals, which have both dsb, where mine is powerful. This is when I really start to think. ",
        "12. Nd2": "White has a lot of attacking moves. I have to find mine, or he will just walk all over me (c4, b4...)",
        "12... Ng4": "He has to react, and probably open the white squares for my B. ",
        "13. h3": "?? ...and, as often in blitzes, I lose the mate in one!",
        "13... h5": "...and played this sac!!",
        "14. hxg4 hxg4 15. Ng3 f5 16. Re1 f4": "This was what I was looking for.",
        "17. Nge4 Qxd4": "Now, g3 is deadly.",
        "18. Be2": "Not seen. ",
        "18... g3": "Only Ne4 stops the mate, but I have some other ideas...",
        "19. Bf3 gxf2+ 20. Nxf2": "This is the moment: now, I can play Rh1+, KxR, QxNf2 and the threat is Rh8+. He has Bh5 as an in-extremis defence, so I have to be sure I'll have another resource, then I played...",
        "20... Bd5": "With the Q on f2, if this B moves Qxg2#. White is +2, but he's suffering.",
        "21. c3 Rh1+ 22. Kxh1 Qxf2 23. Nf1": "The only move that can save him, but only for few moves:",
        "23... Rh8+ 24. Nh2 Qh4": "...can he stop the mate?",
        "25. Kg1": "Yes. I'm still winning? Yes...",
        "25... Qxh2+ 26. Kf1": "Here there is a single \"killer move\", and I missed it. Of course you can see it, it's a \"quiet move\"...",
        "26... Bc4+": "No, not this one, but there is little difference. ",
        "27. Be2 Qg3": "White has no moves. My opp could have thought I was sadistic by not mating him when I could... It was not so!",
        "28. Bxc4 Rh1+ 29. Ke2 Qe3#": "Thanks for reading!"
    },
    "url": "https://gameknot.com/annotation.pl/ferocious-attack?gm=63135",
    "gameName": "Ferocious attack...",
    "players": "vokrusss (1504) vs. damafi (1462)",
    "opening": "Scandinavian defence (B01)"
}