{
    "moves": {
        "1. e4 c5 2. Nc3 d6 3. f4 Nc6 4. Bc4": "Oscar, históricamente ha cometido errores graves en la apertura, en  las partidas que le conozco, por lo rápido de su juego. Esta vez decido utilizar un orden de jugadas poco usual y como se verá, nuevamente cayó en una imprecisión. Claro, esto no significa \"jugar a esperar el error\", solo que si sabes que tu rival le cuesta algo, ¿por qué hacerle la vida más fácil? la sicología está presente en el ajedrez.\n",
        "4... Nf6 5. Nf3 g6 6. d4 cxd4 7. Nxd4 e5": "Aquí está. Las blancas quedarán con ventaja.",
        "8. Nxc6": "\n",
        "8... bxc6 9. fxe5 Ng4": "En otra partida se había jugado: 8.Nxc6 bxc6 9.fxe5 dxe5 10.Bxf7+ Ke7 11.Qxd8+ Kxd8 12.Bg5 Ke7 13.Bb3 Bg7 14.O-O-O Bg4 15.Rd2 h6 16.Be3 Rhb8 [1-0, Mukhametgaleeva Railya (RUS) - Moiseenko Olga (RUS), Dagomys (Russia) 2004.04] ",
        "10. e6": "El truco consiste en bloquear la diagonal del alfil blanco de las negras, que defiende el caballo \"suelto\" en g4. Oscar busca un mejor recaudo para el corcel.",
        "10... Ne5 11. exf7+ Kd7": "La posición es claramente favorable a las blancas. Pero, no hay posición ganada, hasta que se gana.",
        "12. Bb3": "Y bueno, aquí solté la mano. Juan Meruvia daba la idea que después fue confirmada por el computador: 12.Af4 Cxc4 13.Dd4 (la idea es apuntar a la torre en el aire) Ah6 14.Axh6 Dh4+ 15.g3 Dxh6 16.Dxc4 De3+ 17.Ce2 Tb8 18.Tf1 Tf8.\n\nAhora en cambio, Oscar conseguirá algo más de libertad.\n",
        "12... Ba6 13. Bf4 Bg7 14. Bxe5": "De nuevo le doy más opciones. Más duro era 14.Dd2 Dh4+ 15.Dg3 Dh5 16.Td1 Af8 17.Dd4 Rc7 18.Da4 Rb7 ( 18...Ab7 19.Da5+ ) 19.Db4+ Rc7 20.Cd5+ pero en ese momento seguía pensando que el camino sencillo no era una mala decisión.\n",
        "14... Bxe5 15. Qg4+ Kc7 16. O-O-O Qf6 17. Qe6": "Y aquí estamos, cambiando un par de piezas, con dos peones de más y uno en séptima... ¿a quién no le gusta?",
        "17... Qxe6 18. Bxe6 Rab8": "Todo marchaba dentro de lo esperado, solo debo regularizar el tema de la columna C y cambiar un alfil...",
        "19. Na4": "Alternative variation: 19.h4 Rhf8 20.Rh3 \n",
        "19... Bc8": "Esto también era esperado, todavía seguía muy confiado",
        "20. Bxc8": "Alternative variation: 20.Bc4 \n",
        "20... Kxc8": "¿Por qué tomar con el rey? sutil diferencia que marcará diferencia.",
        "21. c4": "Alternative variation: 21.Rd3 Rb4 22.Nc3 \n",
        "21... Rf8": "Aquí caí en cuenta que el alfil tocaba en h2, y la torre de \"b\" pasará entrépidamente a b7 para terminar con la vida del aventurero peón de f7... pagué por mi relajo. Ahora, a re evaluar. Una vez que el peón f7 caiga, la principal amenaza de las negras sería entrar por la columna f, a la segunda fila. Las blancas deben encontrar un método para bloquear tal entrada, sin perder las oportunidades de victoria o por lo menos de mantener la igualdad. En estos finales, el alfil es superior al caballo, pero claramente, uno puede seguir buscando...",
        "22. Rdf1 Rb7 23. Kd2": "Las negras esperan 23.c5 Tbxf7 24.Txf7 Txf7 25.cxd6 Axd6 26.h3 Tf2 27.g4 Ae5 con compensación o incluso un poco mejor. La jugada de la partida me gustó, porque el rey marcha a e2 proponiendo un juego activo\n",
        "23... Bxb2": "Si 23...Tbxf7 24.Txf7 Txf7 25.Re2 con idea de tentar a las negras a llevar su torre a f4. El punto es que después de Re3, la torre queda tocada, lo que obliga a las negras a gastar un tiempo (como g5) para luego jugar c5 y amenazar la maniobra Ad4 - Tf2. Entonces, alcanzo a defender el peón de h2. \n",
        "24. Rfb1": "Sangre fría no es algo que sobre en la siguiente variante: 24.Cxb2 Txb2+ 25.Rc3 Txg2 26.Tf6 Txa2 27.Td1 \n",
        "24... Be5": "Alternative variation: 24...Bf6 \n",
        "25. Rxb7 Kxb7": "Ahora es la oportunidad del caballo",
        "26. Nb2": "El caballo marcha a d3, donde hará de todo, defiende f4, f2 ataca e5, lava, plancha y toca el acordeón...\n\n",
        "26... Rxf7 27. Nd3 c5": "Me parece que en este momento, faltando a la etiqueta, Oscar me ofrece tablas (debe realizarse con el tiempo propio)\n",
        "28. h3": "¿Creo que puedo ganar? la verdad, no lo sé, solo entiendo que si no veo cómo ganan las negras, porque no intentar crear algo...",
        "28... Kc7 29. Rb1": "Ahora mi idea es entrar por la columna b, tomando en algun momento en e5, dejando a c5 y al propio peón de e5 como objetivos. ¿y las negras? no es que estén atadas, solo que si tu rival te ofrece nuevamente tablas, da a entender que no ve posibilidades de victoria...",
        "29... a6": "La jugada de Oscar me da un nuevo tema, así que, intentaremos aprovecharlo.",
        "30. a4 Kc6 31. Rb8": "aquí va la torre",
        "31... Bd4": "Se burla la amenaza de Ce5, pero se suelta la casilla f4. Esto será muy importante luego. Sin embargo, sabía que faltaba algo más en el flanco de rey, si tan solo los peones negros estuvieran más cerca...",
        "32. a5 Rb7": "Si: 32...Ta7 33.Cf4 \n",
        "33. Ra8": "Con la idea de ganar el peón, cambiar las torres y atacar el flanco de rey",
        "33... h5": "¡Ahí está! el apuro me da justo lo que necesito",
        "34. Rxa6+ Kc7": "Alternative variation: 34...Kd7 \n",
        "35. Ra8 Rb8": "Ahora las torres se cambian y, por fin, el camino se aclara.\n",
        "36. Rxb8 Kxb8 37. Nf4 Ka7": "Alternative variation: 37...g5 \n",
        "38. Nxg6": "Las blancas tienen ventaja ganadora",
        "38... Ka6 39. g4": "También había analizado: 39.Cf4 h4 40.Cg6 Af6 41.Rd3 Rxa5 42.Cf4 Ra6 43.Cd5 Ag5 ( 43...Ae5 44.Ce7 ) 44.Ce3 con idea de Cf5, es imposible defender ambos peones.\n",
        "39... hxg4 40. hxg4 Kxa5": "también 40...Af6 41.Cf8 \n",
        "41. g5 Kb6 42. Ne7 Ka5": "42...Rc7 43.Cf5 Ab2 44.g6 \n",
        "43. Nc6+": "1-0, Mamani, Héctor - Gutierrez, Oscar, Arica 20- 1-2010 Festival Arica 2010\n"
    },
    "url": "https://gameknot.com/annotation.pl/festival-arica-2010-arica?gm=29154",
    "gameName": "Festival Arica 2010, Arica",
    "players": "Mamani, Héctor  vs. Gutierrez, Oscar ",
    "opening": "Sicilian (B23), closed"
}