{
    "moves": {
        "1. d4 Nf6 2. c4 g6 3. Nc3 Bg7 4. e4 d6": "I've always been a big fan of the King's Indian Defense.  That's what the KID stands for in my screen name \"Kia-Kid\".",
        "5. f3": "The Saemisch Variation.  White will (usually) castle queenside and start throwing his pawns down the kingside and often generates a very strong attack.  ",
        "5... O-O 6. Be3 a6": "5....e5 or ...c5 or ...Nc6 are more common, and often lead to complex, tense fighting positions.  With ...a6 I intended to nullify some of white's potential threats and steer the game into calmer waters, while at the same time trying to give myself space and play on the queenside. ",
        "7. Bd3 c6 8. Nge2 b5": "Part of my plan for queenside expansion.  Now, if cxb5, then axb5 gives me a space edge on the queenside as well as an open file for my rook.  Or, if white doesn't take on b5, then I have the option of bxc5 with an open b-file and potential to create a weak pawn for white later on with pressure against b2 with my rook and/or the a-pawn.",
        "9. O-O bxc4 10. Bxc4 Nbd7": "Strengthening e5 and preparing Nb6, or if white pushes d5, which he often does in the KID, Nc5 which can be supported by an ...a5 push (hindering b4 by white, dislodging the knight).",
        "11. Bb3 a5": "Still hoping white plays d5, while at the same time expanding on the queenside and preparing a possible Ba3, which could be very useful as the bishop cuts across the light squares where several white pieces lay currently and which might play some role in an annoying pin at some point.",
        "12. Rc1 Ba6 13. Re1 Qb8": "Here I thought it might be useful to get the queen on the open file and put some pressure on the b2 square.  Also, the queen can provide some protection for a knight maneuver to c4 (via b6), putting further pressure on b2 and the bishop on e3.",
        "14. Qd2 Nb6 15. Bh6 Nc4": "I didn't feel as though the weakening of my dark squares (from the Bh6xBg7 exchange) was as problematic for me as the b-file pressure I was getting against him.  I thought I could get some good chances on the queenside with the open b-file and the a-pawn battering ram and wasn't that concerned about any kingside attack from white.  He really had no pieces on my kingside that could cause much damage, while my rooks, queen and bishop had some room to work in and some targets to take aim at on the queenside.",
        "16. Bxc4 Bxc4 17. Bxg7 Kxg7 18. b3 Ba6 19. Na4 Qb4": "After white's b3, I wasn't as confident I could generate much on the b-file, so I decided an exchange of queens would do two things: first, virtually eliminate any real mating or serious threats of white against my somewhat weakened kingside and second, I would now have some pressure and play down the a-file if white exchanged queens.  And if he didn't exchange queens I thought his knight was awkward on the edge of the board and my queen was well positioned for threats to the a and b pawns.",
        "20. Qxb4 axb4 21. Rxc6": "I thought this might have been a small inaccuracy.  I think e5 or Nb6 might have been slightly better, with fewer counter play chances for black.  ",
        "21... Bb5 22. Rc7 Bxa4 23. bxa4 e6": "I thought quite awhile about this move and after I found it I liked it better than any of the other choices, the primary reason being to hold onto the important central pawn and not allow myself another weakness with an isolated central pawn.  I felt that the latent dynamism of the two center pawns (or at the very least not having an isolated central pawn) was important, and the two weak a-pawns for white would still be there for me to gobble up.",
        "24. Rc6 Rxa4 25. Rb6": "This struck me as more of a mistake than an inaccuracy.  Allowing me access to the c-file just didn't seem prudent.",
        "25... Rxa2 26. Rxb4 Rc8 27. Rc1": "Maybe Kf1 or Kf2 was better.  The exchange of rooks leads to some serious problems for white.",
        "27... Rxc1+ 28. Nxc1 Ra1": "A very annoying pin!",
        "29. Rc4 d5 30. exd5 Nxd5 31. Kf2": "Keeping the knight out of f4 would have been better.",
        "31... Nf4 32. Kg3": "The decisive error.  32. d5 would have dropped a pawn, but that's much better than the tactic that wins the game next move.",
        "32... Rxc1": "Of course, if RxR then Ne2+ wins back the rook and black is up a knight, while KxN leaves black up a rook.  So white resigned.  0-1"
    },
    "url": "https://gameknot.com/annotation.pl/fffff?gm=57076",
    "gameName": "FFFFF",
    "players": "rayz88 (1833) vs. kia-kid (1661)",
    "opening": "King's Indian (E81), Saemisch, Byrne variation"
}