{
    "moves": {
        "1. e4 Nf6": "Alekhine's Defense.",
        "2. e5 Nd5 3. d4 d6": "Standard play so far. This move aims to undermine white's strong pawn presence in the center.",
        "4. c4": "!? Ljubojevic is a leading expert of the Alekhine (from both sides) and 4.c4 is his \"pet line\". To play it against him shows a lot of nerve by Bronstein.",
        "4... Nb6 5. f4": "! The Four Pawns Attack.",
        "5... dxe5 6. fxe5 c5": "The Ljubojevic Variation of the Alekhine. Black is very comfortable in this position, and threatens to start ripping up the center.",
        "7. d5": "Preserving central strength, but advancing dangerously fast without sufficient development to support.",
        "7... e6 8. Nc3 exd5 9. cxd5 c4": "And both sides seem to have accomplished their goals. White has good space in the middle and will support with developing moves. Black owns the queenside and has numerous developing and attacking options.",
        "10. Nf3 Bg4 11. Qd4": "! Hitting the c pawn and the Bg4.",
        "11... Bxf3": "!? Black strikes with the aim of weakening white's kingside. While sometimes controversial to trade a bishop for a knight, notice that black is attempting to get white to castle queenside (putting his king on a half open file).",
        "12. gxf3 Bb4": "Developing with a nasty pin.",
        "13. Bxc4": "White starts gaining material.",
        "13... O-O": "Considered strong, but my belief is that 13...NxB 14.QxN 0-0 is just as good for white. It would at least remove the pesky bishop on c4.",
        "14. Rg1 g6 15. Bg5": "!! White exerts his dominance of the dark squares around the enemy king while developing with tempo. Very strong.",
        "15... Qc7 16. Bb3": "!! Bronstein also wants the light squares, so he preserves his light squared bishop. Surely he saw.........",
        "16... Bc5": "! To save his queen white must sac a rook!",
        "17. Qf4 Bxg1 18. d6": "Advancing, attacking, and opening the diagonal for his light squared bishop.",
        "18... Qc8": "And now for a quick evaluation.........black is up almost a full rook, but is underdeveloped. He should start getting his pieces moving quickly to maintain his material advantage. White is down almost a full rook, but his pieces are developed and he has momentum. Time for white to start pressing his initiative!",
        "19. Ke2": "?! Not wanting to castle into a pin, Bronstein activates his Ra1 in a much more dangerous fashion, as his king is now dangerously exposed.",
        "19... Bc5": "Preserving his material advantage, but not really accomplishing much else.",
        "20. Ne4": "This aggressive move by white tells his opponent that he demands the right to control the flow of the next several moves.",
        "20... Nb8d7": "? Perhaps 20...Nc6 was better.",
        "21. Rc1": "Pinning the bishop against the enemy queen.",
        "21... Qc6": "Fritz gives black the edge in this position.",
        "22. Rxc5": "!! Removing any control of the dark squares from black. Bronstein can now play Nf6  with lasting effectiveness.",
        "22... Nxc5 23. Nf6+ Kh8 24. Qh4 Qb5+": "Ljubojevic now seems poised to counter, as his queen and both knights can slip behind white's lines and cause havoc.",
        "25. Ke3": "! Gaining an \"insurance tempo\" as black now needs at least two moves or a big sacrifice to follow through with his plans.",
        "25... h5 26. Nxh5": "! White has to press here or black will gain the time needed to take advantage of white's exposed king.",
        "26... Qxb3+": "!? In post mortem, Ljubojevic said he felt that move was forced. With this queen sac, black now hopes to storm the queenside if he can only stave off white's attack on his weakened kingside! Use the 'Flip the board' option to see this position from both points of view. Wild stuff!",
        "27. axb3 Nd5+": "And black starts attacking in earnest.",
        "28. Kd4": "! Any retreat from conflict only empowers blacks aggression, so Bronstein lashes out with his monarch! The offensive properties of the king are sometimes forgotten. If a queen=9, a rook=5, a bishop=3.5, a knight=3, and pawns=1 point, a king can be considered a '5' and should be used when needed to disrupt an enemy's plan. Brave play by Bronstein.",
        "28... Ne6+": "As one of the knights is going to fall anyway, black uses this check to retreat forces back towards the action. His plan now should be to secure his king and the real estate directly around it.",
        "29. Kxd5 Nxg5": "Forced, as 29...gxh5 30.Bf6  Kg8 31.Ke4!",
        "30. Nf6+": "Correct. White sees that the black knight on g5 is toast anyway, so he is in no hurry to snag it just yet. Better to start positioning the enemy king where he is most vulnerable.",
        "30... Kg7 31. Qxg5 Rfd8": "Black is now down severely on material and tempo. His saving grace is that white is EXTREMELY short on his clock (I couldn't find out how short, but reportedly the next 10 moves by Bronstein were played VERY rapidly).",
        "32. e6 fxe6+ 33. Kxe6 Rdf8 34. d7": "This move and the ones that follow can only be described as having \"technique\".",
        "34... a5": "Black pins all of his hopes on rushing a pawn towards promotion.",
        "35. Ng4 Ra6+": "YIKES!!!!! Black's other rook now enters the fray, and enters with a vengeance! Has white screwed up?",
        "36. Kd5 Rf5+": "DOUBLE YIKES!!!!!!!!! Has white blundered his queen?",
        "37. Qxf5": "Bronstein saw all of this, and now just simply removes enemy ammunition.",
        "37... gxf5 38. d8=Q fxg4": "Forced.",
        "39. Qd7+": "! A check that threatens both b7 and g4 as well.",
        "39... Kh6 40. Qxb7": "Correct idea. White knows he is on cruise control, and should win. Removing ANY chance of a black pawn push while still safe from receiving a check is just good, solid, patient chess.",
        "40... Rg6 41. f4": "And Ljubojevic resigns, as his g pawn will never reach it's goal because of white's pawn on h2. His a pawn is worthless as well. In a game of queen vs. rook, he may have some play, but now because white's f pawn has entered the picture, he knows he can't defend on that many fronts. A wonderful game, and a beautiful example of the concept of TIME being used in a mating attack. I hope you enjoyed it:) - Thomas"
    },
    "url": "https://gameknot.com/annotation.pl/fide-interzonal-brilliancy-prize?gm=896",
    "gameName": "FIDE Interzonal (Brilliancy Prize)",
    "players": "David Bronstein (2575) vs. Ljubo Ljubojevic (2680)",
    "opening": "Alekhine's defence (B03), four pawns attack, Korchnoi variation"
}