{
    "moves": {
        "1. e4": ".“Carlsen gioca senza aperture, Anand senza finali. Statisticamente, questo è a favore di Magnus!” Così parlò ieri Kasparov, e la sesta partita del Mondiale 2013 gli ha dato ampiamente ragione! Anand conferma la scelta per l’apertura di Re, Carlsen si affida di nuovo alla berlinese ed il Campione del Mondo gioca 4.d3. I due giocatori seguono la Anand-Aronian del Memorial Alekhine 2013, finché Anand gioca la novità 10.Ag5. Carlsen riflette per 20’ e risponde con 10..Ae6. I motori si “eccitano” (e con loro gli spettatori) e danno +0,60 al bianco (con 11.Axe3 seguita da d4). Anand, dopo 10’, preferisce la “normale” Cbd2. La partita prosegue senza particolari emozioni ed entra in un finale di pezzi pesanti, valutato da praticamente tutti gli autorevoli commentatori di questo Match sostanzialmente pari ma … Carlsen, proponendo ad Anand grattacapi sempre più complessi (ed in questo il Numero uno al Mondo ha un talento fantastico!), con una delle sue “magie” riesce a vincere portandosi avanti nel match con un doRiguardo il finale, oggi abbiamo deciso di far parlare (tramite i loro tweet pubblicati nel corso della partita) solo GM con la “serie” anche i Grandi Maestri si chiedono: perché?\nJonathan Rowson, subito dopo la decisione di Anand di cedere il primo pedone con 38.Dg3: “Can anybody explain why Vishy blundered a pawn?”\nHikaru Nakamura: “Can someone tell me why Anand eschewed 51.b3 which led to a theoretical draw?” (Questa la breve linea che secondo Nakamura conduce alla patta teorica: 51.b3 Te3+ 52.Rh2 Txc3 53.bxc4)\nPer concludere, e per la serie “i GM rispondono”, segnaliamo invece quest’altro “tweet”, sempre di Nakamura: ”I know people say 60.b4 was a draw, but I am not sure anyone would have found it in that situation.“ So che le persone dicono che 60.b4 era patta. Ma non sono sicuro che chiunque l’avrebbe trovata in questa situazione.\nDomani è previsto il terzo giorno di riposo, dopodiché Anand avrà di nuovo il bianco (nella settima partita del match i colori si invertono). (da www.scacchierando.it)\n.\n.\n.\nAnand comincia con e4, una mossa chiaramente d'attacco. \n",
        "1... e5": ".",
        "2. Nf3": ".",
        "2... Nc6": ".",
        "3. Bb5": "Siamo, come nella 4a partita, tornati alla Ruy Lopez.",
        "3... Nf6": ".",
        "4. d3": ".",
        "4... Bc5": ".",
        "5. c3": ".",
        "5... O-O": ".",
        "6. O-O": ".",
        "6... Re8": ".",
        "7. Re1": ".",
        "7... a6": ".",
        "8. Ba4": "Questa mossa, se il nero risponde con 8...b5 9.Bb3 d6 ci porta ad una Ruy Lopez chiusa.  Generalmente il nero mira ad un vantaggioso ... d5. Il bianco mira invece allo sviluppo con Nbd2-f1-g3\n",
        "8... b5": ".",
        "9. Bb3": ".",
        "9... d6": ".",
        "10. Bg5": "In queste posizioni è uno svantaggio avere l' alfiere nero attivo confinato in c5 e non e7 , il cavallo f6 viene bloccato. Anand ha giocato contro Aronian all'inizio di quest'anno al Memorial Alekhine  10.Nbd2 invece di Ag5 . La partita si è conclusa con un pareggio senza troppi problemi per il nero. Uno dei piani del nero potrebbero essere  di giocare Rb8 seguito da b4 e guadagnare un certo vantaggio sul lato di Donna .",
        "10... Be6": "Magnus sfida il forte Alfiere bianco, una risposta tipica in queste posizioni. Dopo a4 il bianco mira a creare un punto debole per il nero in b5. ",
        "11. Nbd2": ".",
        "11... h6": ".",
        "12. Bh4": "Il nero può giocare Bb6 solo se il bianco muove d4. Di norma prendendo l'alfiere in e6 il bianco deve avere qualche idea concreta. Fare lo scambio di alfieri senza un guadagno posizionale è solo controproducente.",
        "12... Bxb3": ".",
        "13. axb3": "Fino a qui l'apertura ha seguito le linee standard. Unico svantaggio per il Bianco: ha dei pedoni doppiati: b2+b3.\nIl piano di axb3 Bianco potrebbe essere Nd2f1 e quindi Ne3 mentre quello del nero di  ottenere di comandare il gioco sul lato di Donna con a5 - a4 o una spinta al centro con d5",
        "13... Nb8": "Molto interessante idea da Magnus , vuole riorganizzarsi con Nbd7 , così da poter uscire dal blocco dell'Alfiere? Poteva giocare anche: 13... a5 14. Nf1",
        "14. h3": "Il bianco necessita attenuare la pressione sul lato di re. Nh2  e successivamente Ng4 è la combinazione più giusta.",
        "14... Nbd7": "..",
        "15. Nh2": ".",
        "15... Qe7": "De7, L' idea è quella di rispondere g4 con Qe6 . Dopo uno scambio di Alfieri, la regina in e6 è in una posizione ottimale.",
        "16. Ndf1": "Mossa per raggiungere g3/e3 e infine Nf5 . Il Nero dopo essere uscito dalla scomoda posizione, ha due modi per continuare:d5 o a5 e successivamente Bb6",
        "16... Bb6": "Una mossa che permette di continuare con a5 e liberare la Torre in a8 e rafforzare il gioco della donna. Una continuazione con 17.Ne3 a5 18.Nf5 QE6 19.Ng4 Kh7 appare pericolosa per il nero , anche se non dovrebbe esserci alcun problema reale. Il Nero dovrebbe giocare quanto prima Qe6. Kh7 è una mossa importane nel caso di eventuali sacrifici in h6",
        "17. Ne3": ".",
        "17... Qe6": ".",
        "18. b4": "Un invito al nero di giocare a5 e così eliminare il pedone doppiato.",
        "18... a5": ".",
        "19. bxa5": ".",
        "19... Bxa5": "Bxa5: Il nero sta giocando nel giusto modo, anche se la mossa del Bianco Nf5, potrebbe dargli qualche grattacapo. Il nero è comunque pronto in questo caso, a muovere d5, realizzando finalmente l'intento che insegue da molte mosse, esempio 20.Nf5 Bb6 21.Ng4 Rxa1 22.Nxf6+ Nx6 23.Qxa1 d5. ",
        "20. Nhg4": ".",
        "20... Bb6": ".",
        "21. Bxf6": "Una mossa sorprendente. Ora, se la regina, dopo una serie di scambi, riesce a raggiungere f6, il bianco non può muovere il cavallo e3 perché il Pf2 rimarrebbe senza protezione.",
        "21... Nxf6": ".",
        "22. Nxf6+": ".",
        "22... Qxf6": ".",
        "23. Qg4": "Un bel gioco, anche se non saprei scegliere tra queste due combinazioni: 23 ... Be3 24fe3 De7 seguito da c6 e 23. Qe2 ( se il bianco invece di Qg4 avesse optato per questa continuazione) Bxe3 24. Qxe3 c5",
        "23... Bxe3": ".",
        "24. fxe3": ".",
        "24... Qe7": "Il re Bianco è più al sicuro\n",
        "25. Ref1": ".",
        "25... c5": "Magnus minaccia c4. A mio vedere, in questo momento, il nero gioca per la patta.",
        "26. Kh2": ".",
        "26... c4": "Con questa spinta il nero guadagna spazio e fa pressione sul bianco.\nConsideravo, in un primo momento, 27.d4 una mossa sbagliata, ma guardando meglio (e per questo ho potuto postare le mie valutazioni solo un giorno dopo la partita ;-)) ho notato che con 27 ... exd4 28.exd4 Rxa1 29.Rxa1 avrebbe permesso al nero la conseguente riconquista del pedone. Tuttavia, a questo punto, la partita si sarebbe avviata verso un altro pareggio",
        "27. d4": ".",
        "27... Rxa1": "Un'altra alternativa interessante per il nero è: 27 ... b4 e se 28.cxb4 Rab8 29.Ra4 e ora exd4 30.exd4 Qe4.",
        "28. Rxa1": ".",
        "28... Qb7": "Qb7 minaccia ... exd4 . Se il bianco muove 29.d5, il nero può continuare con Rb8 con l'idea b4 Queste posizioni sono esattamente quelle che piacciono maggiormente a Carlsen. ",
        "29. Rd1": "29 ... exd4 30.Rxd4 Rxe6 danno vantaggio, anche se non decisivo, al nero. Carlsen è  comunque conosciuto per vincere partendo da posizioni che sembravano impossibili. Forse troppo docile il gioco di Anand, comunque non era visibilmente in possesso dell'agressività che serve per vincere.",
        "29... Qc6": ".",
        "30. Qf5": ".",
        "30... exd4": ".",
        "31. Rxd4": "Il Nero ha un pedone arretrato: d6\n",
        "31... Re5": "Il Nero minaccia di guadagnare materiale: Te5xf5\n",
        "32. Qf3": "L'idea di Qf3 del bianco è quella di rispondere a 32 ... f5 con Qd1",
        "32... Qc7": "Il bianco può giocare Rd5, ma la sua struttura pedonale è inferiore a quella del nero, al quale però, non è sufficiente per vincere.",
        "33. Kh1": ".",
        "33... Qe7": "La partita sembra avviarsi verso una patta. Anche se la struttura del bianco è migliore, è difficile con queste posizioni, immaginare la vittoria di uno dei due contendenti.\nAnand sembra quasi mirare al pareggio per prendersi un giorno di meditazione prima della ripresa dei combattimenti... ma queste cose, specialmente se si gioca contro Carlsen, sarebbe meglio non prenderle mai in considerazione.",
        "34. Qg4": ".",
        "34... Kh7": ".",
        "35. Qf4": ".",
        "35... g6": "Ora il bianco è bloccato ed il nero può cominciare a sviluppare i propri pezzi con Kg7 e h5. Anche se, e lo ripeto, personalmente a questo punto, è ancora difficile vedere un'idea di base dove costruire la vittoria per il nero.",
        "36. Kh2": ".",
        "36... Kg7": ".",
        "37. Qf3": ".",
        "37... Re6": ".",
        "38. Qg3": ".",
        "38... Rxe4": ".",
        "39. Qxd6": ".",
        "39... Rxe3": "2 al prezzo di uno",
        "40. Qxe7": ".",
        "40... Rxe7": "Siamo davanti ad un finale di torre e con un pedone in + che, per il nero, vuol dire molto.\n",
        "41. Rd5": ".",
        "41... Rb7": ".",
        "42. Rd6": ".",
        "42... f6": ".",
        "43. h4": ".",
        "43... Kf7": ".",
        "44. h5": ".",
        "44... gxh5": "Non è un sacrificio vero. Il nero, con i pedoni doppiati, dimezza la sua forza nella linea h.",
        "45. Rd5": ".",
        "45... Kg6": ".",
        "46. Kg3": ".",
        "46... Rb6": "Comincia la manovra Tb7-b6-e6-e4\n",
        "47. Rc5": ".",
        "47... f5": ".",
        "48. Kh4": ".",
        "48... Re6": ".",
        "49. Rxb5": ".",
        "49... Re4+": "La torre nera è ben piazzata.\n",
        "50. Kh3": ".",
        "50... Kg5": ".",
        "51. Rb8": ".",
        "51... h4": ".",
        "52. Rg8+": ".",
        "52... Kh5": ".",
        "53. Rf8": ".",
        "53... Rf4": " L'idea è Te4-f4-g4-g3\n",
        "54. Rc8": ".",
        "54... Rg4": ".",
        "55. Rf8": ".",
        "55... Rg3+": ".",
        "56. Kh2": ".",
        "56... Kg5": ".",
        "57. Rg8+": ".",
        "57... Kf4": "un finale nettamente superiore per il nero.",
        "58. Rc8": "Il Bianco minaccia di guadagnare materiale: Tc8xc4\n",
        "58... Ke3": ".",
        "59. Rxc4": ".",
        "59... f4": ".",
        "60. Ra4": "Qui forse è l'errore decisivo per il bianco. la mossa migliore in questa situazione era Rb4",
        "60... h3": ".",
        "61. gxh3": ".",
        "61... Rg6": "Fino a prima dell'errore Ra4 Anand ha avuto il pieno controllo sulla situazione. Ora però la situazione sembra sfuggirgli di mano. Infatti dopo 62 . Ra7 f3 63 . Re7+ Kf2 64 . h4 Rg2+ 65 . Rh3 Kf1 66 . Ra7 Rg6 67 . h5 Rg5 68 . Ra6 f2 69 . Rxh6 Kg1 70 . Rf6 Rxh5 + porta a frutto un altro finale di partita a favore di Carlsen.",
        "62. c4": ".62. Ra8 si rendeva necessaria\n",
        "62... f3": "Praticamente la partita è finita. Carlsen ha tirato fuori il classico coniglio dal capello e, approfittando di tanti piccoli errori di Anand, una posizione vincente.",
        "63. Ra3+": ".",
        "63... Ke2": ".",
        "64. b4": ".",
        "64... f2": ".",
        "65. Ra2+": ".",
        "65... Kf3": ".",
        "66. Ra3+": ".",
        "66... Kf4": ".",
        "67. Ra8": "67. Ra1 (non migliora alcunché) Re6 68. Ra7 Re1 69. Rf7+ Ke3\n",
        "67... Rg1": "(67... Rg1 68. Rf8+ Ke3 69. Re8+ Kd4 70. Rd8+ Kxc4) E' la mossa migliore. Ora la minaccia inevitabile per il bianco è di f2 in \"underpromotion\" . Anand abbandona. Ora ci troviamo con 2 punti di vantaggio per Carlsen e una grande vittoria per il norvegese.\n"
    },
    "url": "https://gameknot.com/annotation.pl/fide-chennai-game-6?gm=52686",
    "gameName": "FIDE Chennai Game 6",
    "players": "Anand, V. (2775) vs. Carlsen, M. (2870)",
    "opening": "Ruy Lopez (C65), Berlin defence, Kaufmann variation"
}