{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Bc4 Bc5 4. c3": "straightforward Italian so far, Blacks' next move is considered to be weak; better is Nf6, d4, exd4, cxd4, Bb4+, and take it from there...",
        "4... h6 5. O-O d6 6. d4 exd4 7. cxd4 Bb6 8. a3 Bg4 9. b4": "bold, but not the best of continuations; this will soon lose the game... best was d5, Nd4, Nbd2, Qf6, h3, and see where this ends...",
        "9... Nxd4": "obviously...",
        "10. Bxf7+": "the only thing, that could save White now, was Nbd2, Qf6, Rb1, sit and wait and pray; but I was blind...",
        "10... Kxf7 11. Ng5+": "if we lose, we lose in grace and with a great bang; even Ne5+ was better; this will open up the h-file, much to my dismay...",
        "11... hxg5 12. Qxg4 Qf6 13. Bxg5 Qe6": "totally winning is Qe5...",
        "14. Qf4+": "better is Qxe6, and try not to make more mistakes; but by now, I started to feel that Black didn't realize how winning he really had become at this moment...",
        "14... Nf6 15. Nc3 c6": "certainly not the best: Qb3/Qc4 was to be preferrred...",
        "16. Rae1 Qe5 17. Qxe5 dxe5 18. Kh1": "pure on speculation for other complications; Nc2 here, is a big problem... but hard to find...",
        "18... Rad8 19. f4 Nc2": "wrong timing; exf4 was stronger...",
        "20. Re2": "Rc1 was better, but Black seems oblivious...",
        "20... Ng4": "a real pity; Nh5 was surely winning, threatening exf4...",
        "21. Bxd8": "I confess: I totally missed Rxh2 and mate, running very low on time; lucky for me, Black had still no clue and even less time than me... plus my stunning looks, of course... ;)",
        "21... Rxd8 22. fxe5+ Ke6 23. Rxc2": "getting lucky this time, coming back from a totally lost game; but this is blitz at its finest... anyway, Ne3 will still win some material...",
        "23... Nf2+": "not sure what happened here: divine intervention? ghost vision? we will never know...",
        "24. Rcxf2 Bxf2 25. Rxf2": "by now, Black must have realized what he has done; there is no mate on the bottom row...",
        "25... Rd3 26. Rc2": "Rf3 is even stronger...",
        "26... Kxe5 27. h3 Kd4 28. Kh2 Rxc3": "winning my last pieces, but missing the point...",
        "29. Rxc3 Kxc3": "or Kxe4, Rg3...",
        "30. e5": "finally, it dawns on Black and he resigns; this is what I love about blitz..."
    },
    "url": "https://gameknot.com/annotation.pl/fierce-queen-unrated-3-10-blitz-carnage?gm=63423",
    "gameName": "Fierce Queen unrated; 3+10 blitz carnage...",
    "players": "fiercequeen (unrated) vs. grumpy79 (1718)",
    "opening": "Giuoco Piano (C53)"
}