{
    "moves": {
        "1. d4 d5": "what can we do, to prove that a blitz game actually happened, and that you won? above we have the PGN notation, taken from a recent game... about the only way, to prove this game actually happened...",
        "2. c4 c6 3. Nc3 f5 4. Nf3": "maybe, I should have given cxd5, cxd5, Bf4 a second glance; this f5 is trying to prevent a direct e4... but I was occupied with dxc4, and after that play the forcing e4...",
        "4... e6 5. e4": "safer options were c5 or Ne5, but I needed blood...",
        "5... fxe4 6. Ng5": "still nothing wrong with Ne5; but the exposed Black King made me wonder... I needed to conquer e4...",
        "6... Nf6 7. Ncxe4": "having nothing better, than Be2, Be7, 0-0, 0-0, Be3, h6, Nh3, I decided to set the board on fire...",
        "7... dxe4 8. Nxe4 Nbd7": "Nf6xe4, is already very dubious; for White that is... Black decides to consolidate...",
        "9. Bd3 Be7 10. O-O O-O 11. c5 Nxe4 12. Bxe4 Bg5 13. Be3 Bxe3 14. fxe3 Rxf1+ 15. Qxf1 Nf6 16. Bd3 Qe7": "by now, I had not much play left; but Black was starting to suffer a serious lack of time... so I decided to play 'va banque'...",
        "17. e4 Bd7": "missing e5, b4 (we have to prevent Qxc5+), exd4...",
        "18. Qf3": "still, e6-e5 is lethal...",
        "18... Rf8 19. Rf1": "at this point, I should have played e5 myself; after Nd5, Qe4, I might have stirred up some more trouble...",
        "19... e5 20. Bc4+": "at this point, Black was using up his last minute of playing time; I was losing but had minutes to spare: so I stirred up some additional complications; driving the King away from Rf8, thus pinning Nf6...",
        "20... Kh8": "better Be6, Qb3 (Bxe6, Qxe6 doesn't make it any better), Bf7...",
        "21. d5": "I needed another bluff... Nf6 is now pinned with the Black King on h8, due to mate; there is no way, to cover for Rf8 with a Knight move...",
        "21... cxd5 22. Bxd5 Nxd5": "after Bb5!, Rf2 (forced), Qxc5, h3 (forced), Qc1+, Kh2, Ng4+, White loses the Queen and all is over... but Black was running on his last seconds; running right into my last trap...",
        "23. Qxf8+": "no rocket science involved here: White is mating on the next move; Black resigned, just before his flag was about to fall... what did I prove? not much..."
    },
    "url": "https://gameknot.com/annotation.pl/fierce-queen-proving-nothing?gm=63495",
    "gameName": "Fierce Queen proving nothing?",
    "players": "fiercequeen (2001) vs. kingbelgian (unrated)",
    "opening": "QGD Slav defence, Alekhine variation (D10)"
}