{
    "moves": {
        "1. e4 c5": "Ive seen this response as black a few times, not sure what its called, but I think its a scandinavian defence?. I can see its aimed at stunting my progress into the centre with d4",
        "2. Nf3 a6": "Through review of other annotated games, this defensive move is common on GK and ive adopted the defence myself as it prevents the pin on the knight or d pawn with the white bishop on b5.",
        "3. Nc3": "I normally play an Itallian opening, which has worked ok for me, but i wanted to try getting both of my knights out into the centre before i developed my bishops",
        "3... e6 4. Be2": "clearing space to castle kingside, i heard it said once, castle early...not sure whether this is still thought of as a good idea. Ive also seen others wait until they see what happens in the opening game first then castle before the attack.",
        "4... d5": "challenging for the centre",
        "5. e5": "declining the challenge",
        "5... d4": "forcing my to move my knight again and losing opportunity to develop my pieces further",
        "6. Ne4 Nc6 7. O-O": "decide to castle early",
        "7... g6 8. c4": "stopping a further pawn push on c4",
        "8... Bg7": "aiming to own the a1 - h8 diagonal",
        "9. d3 Bxe5": "with my knight on e4 i intended to pressure blacks queen with my dark bishop taking advantage of the cover on e4. It is at this point that i see a few good forking opportunities. (thats fork - ing not the expletive way you'd pronounce it if you were from Ireland...I've got Irish ancestors...G'day to all the Irish out there)",
        "10. Bg5": "threatening the queen and hopefully obtaining a desired pin",
        "10... Nge7": "pin as desired",
        "11. Nxe5": "bait for hopefully a rook knight fork for 12.Bf6",
        "11... Nxe5": "takes the bait",
        "12. Bf6": "fork number 1 (once again - not in an Irish accent)",
        "12... Rg8": "opportunity for piece advantage so i decided to take the Knight",
        "13. Bxe5": "now for fork number 2... fork 14.Nf6 ",
        "13... Nc6": "Threatens e5, but i decide to go for fork number 2",
        "14. Nf6+": "fork no.2",
        "14... Ke7": "I thought about whether i wanted to go ahead with it, looking at 15.Ng4 16. Bf6  and winning the black queen, but i thought my opponent would have seen this and easily avoided the pin, So i went ahead and increased my piece advantage",
        "15. Nxg8+ Qxg8": "now to stay ahead in piece advantage",
        "16. Bf4": "moving away from 16.Nxe5",
        "16... e5": "threatening again",
        "17. Bd2": "getting back to base to load up and try for another fight",
        "17... Qd8": "I saw the pin once again on g5, but also saw 18.f6, so decided to make a more stupider move instead",
        "18. Qa4": "?this move was aimed at a few different senarios - both as you will see didnt work too well, but i was hoping for 18.b5 19.c4xb5, axb5 20.QxR8. At the end of the day i wanted to try and bust up some holes and saw c5 as a vulnerable hole and went for it",
        "18... Bd7 19. Qa3": "aiming at c5",
        "19... b6": "and there goes that idea...showing why im only 1300 rated, only able think a few moves ahead, now my queen is in a terrible position and will lose tempo trying to get her active again",
        "20. Rae1": "claiming the half open e file with potential to double rooks",
        "20... Kf8 21. Bf3 Ra7": "preparing to get the a file rook into the game ",
        "22. Bxc6": "I figured im up in pieces advantage and decided to sacrifice my white bishop which at this time looked a bit useless and personally i dont like playing against knights so i targeted what i thought could be a nuisance piece during the end game",
        "22... Bxc6": "However, black bishop now owns the a8 - h1 diagonal and looking quiite menacing...maybe the trade wasnt too well thought out and i realise i really need my queen in the action",
        "23. b3": "maybe better was 23. b4 c5xb4 24. Qxb  25.Qxb6 fork",
        "23... Qa8": "threatening g2",
        "24. f3": "Necessary block, but now my opponent has the opportunity to push around his centre pawns aimed at eventually threatening my rooks",
        "24... Re7": "powering up for a e4 push",
        "25. Qc1": "getting my Queen back into a more active square by backing up my dark bishop",
        "25... Kg8": "avoiding the check 26.Bh6",
        "26. Bg5": "threatening 27.Bxe7",
        "26... Re6 27. Bh4 b5": "thinking i can afford the lose, i decide to try and keep to my game plan to double rooks",
        "28. Rf2 bxc4": "cant afford 2 lost pawns and also took a step back thought of an  annotation i once read on GK which in my own words said to imagine all the pieces but the pawns remained in an endgame, connected pawns are more powerful than isolated pawns, always try and keep them connected, so thinking of the endgame I retake with 29.dxc4",
        "29. dxc4 e4": "and here comes the e4 push",
        "30. Qf4 Qe8": "getting more ammunition on the weakened e file",
        "31. Qh6": "trying to prevent the king from getting back out into the open",
        "31... e3": "pushing further and threatening f2, so i decide to double the rookos on the e file hoping to muscle my way in",
        "32. Rfe2 f5": "preparing to squeeze tighter and connect his pawns in the centre",
        "33. Bg5 a5": "better i think was 33. d3 pushing the passed pawn while threatening to weaken my e file rooks",
        "34. Bxe3": "! i'll give myself an exclamation here for a 1300 rated player, i thought this was a great move as i could see the end in sight... if 34.dxe3 35.Rxe3, Rxe3 36.Rxe3 and im up a piece while threatening blacks queen. If 36.Qxe3 37.Qxe3 threatening c5 and pushing my connected pawns to victory...",
        "34... d3": "I think a few moves too late",
        "35. Bd4": "! another exclamation for me i think deserved, threatening mate on g7 while opening my fire power on the e file ",
        "35... cxd4": "practically forced stopping the mate on g7, but now i have the fire power on the e file and fire away",
        "36. Re2xe6": "bang - threatening blacks queen ",
        "36... Qc8": "nothing can stop me now",
        "37. Re6e7": "threatneing g7 mate",
        "37... Qf8": "last ditched effort hoping for a drawn out endgame and me missing mate on h7, but...",
        "38. Qxh7#": "I didnt miss it. I was excited about how I played my end game thus i wanted to try an annotation. As i have said earlier, this is my first annotation so constructive comments are appreciated. I purposely removed my opponents name from this annotation as I dont agree with publicly annotating a game when i dont have the permission from my opponent, so in respect for my opponent i maintain his annominity."
    },
    "url": "https://gameknot.com/annotation.pl/fighting-for-the-e-file?gm=8071",
    "gameName": "Fighting for the E file",
    "players": "Abinadi1 (1353) vs. Anon. (1389)",
    "opening": "Sicilian (B28), O'Kelly variation"
}