{
    "moves": {
        "1. g3": "Anyway, after I boasted and got the lucky win, thereaper1 decided to challenge me to a game.  After winning easily, this is where damalfi retained what happened and said that I'd never be able to win against a 1600 rated with that kind of play, in my last annotation.  Guess what?  I beat someone stronger then that.  It was my coach and friend, Jack Stockel, who's a Class  A Player.  For example, in a game against Jack, I blundered very early, nearly as early as the misstep against blizkov where I was down a R+2 pawns early on, at the start of the midgame.  And, in the end, he had two passed pawns, and one of those pawns nearly promoted.  This time, I was nervous, up until he had this way to go wrong and then got it all back.  But, he made a mistake by taking another pawn and by doing so, overlooked a mate in two which I was able to take advantage of.  Therefore, I pulled a swindle and was able to pull a win in a hopelessly lost game.  And, it's the first time in history that I was able to defeat a Class A Player, after being down so much material.",
        "1... e5": "So after his decision to make an irregular opening, I'm already confident and feel that I have the advantage.  At the time, I had no idea it was called the Baseman Defense, but I learned what it was from id=wrecking_ball  However, this is the wrong approach.  The reason is that you fianchetto the LSB immediately and bring it on the longest diagnol.  I used to view it as pointless because it's not a center pawn, so it won't help control the center.  However, as I also learned from WB, it's not pointless because on that long diagnol, the B can do a lot.  And, just because someone starts off with an irregular doesn't mean anything, that you have the advantage, you still have to be careful with that kind of thinking because Baseman can lead to a good game from both sides, and if you play against it and have a nonchalant attitude, it could cost you the game.  Additionally, best was 1...e6 because it's said that when you're opponent opens by advancing a pawn one square, the best response is 1...e6",
        "2. Bg2": "Yes, this is the proper continuation of the Baseman.",
        "2... Bc5": "However, all I care about is developing my pieces.  But, more common was 2...Nf6  While no big deal, so that we don't get mixed signals, I emphasize to my students facts about General Openings, to set good examples.  One says that N's should be developed before your B because you know where that N goes first but have no idea where to place the bishop.",
        "3. e3": "?! Yes, it's a developing move as it's a central pawn.  However, it's pointless, in my opinion because it's generally not a good idea for white to play e3 early on.  It's common when black advances the e pawn one square but shamash said that if you're white, to play as white, not black.",
        "3... Nf6": "Meanwhile, I'll continue with development.",
        "4. c3": "?! I don't know why he played this.  But, this is an inaccuracy because it dosen't develop or help control the center.  In fact, it makes very difficult for white to develop his N because he must now lose tempo to get it out, or put that N on the rim in which, it loses value.    ",
        "4... O-O": "Because I'm better developed and closer to controlling the center, so I feel that my advantages are already growing.  Therefore, I waste no time in castling because while he played, I was just going to focus on what I like to do best, get the K to safety.",
        "5. b4": "Worried about me playing a5.  But more, important is to continue develop and get the monarch to safety.",
        "5... Be7": "Also possible was 5...Bd6 or 5...Bb6  In fact, that would've been a better alternative to what I played because I'm in a rather uncomfortable position with how my DSB is now placed.  But, I did this because, at the time, I had high levels of the Fight or Flight response and was paranoid about him reattacking my piece.  Of course, there's always more to chess then just an attack, as I emphasize to students.  But, when it comes to development, I really don't care because if someone makes an undeveloping move against me, I will try to exploit that weakness by attacking a piece, here and there, so that I immediately can get another piece out, while the opponent is forced to run away.",
        "6. Qb3": "I don't know why white did this because there's no reason to break the guidelines as nothing was being threatened, so this was not an exception to the guidelines.  Instead, he got his Q out before developing his other pieces.",
        "6... e4": "So, I'm already looking for a weakness that I can exploit here.  Therefore, I go about pushing my pawn because I decide to deviate a little from the guidelines since I had the advantage.  Note: This is the first game, ever, where I thought like a GM.  Of course, this happens later on, but I was retaining what TA implied that I just go by my instinct and play a move and deviate from normal continuations to find a weakness that can be exploited.  Of course, this move happened right after my misstep against blitzkov, but right before my lucky swindle against youthanasia, which I annotated.  What it means is that I was still very angry with cdeburca for making the comments he made.  So, I was trying to strategize and find a game where I'd play weak moves and win.  It didn't happen from this game, but that's where I figured out the perfect, the one against youthanasia.  But, one reason I had the wrong attitude and reason for certain was still out of anger against the kibitzers in that annotation.  So, here I was still trying to show off, which is why I deliberately pushed a pawn, as opposed to, developing another piece with 6...Nc6, the way it's supposed to be.",
        "7. Ne2": "Meanwhile, he wastes not time in getting another piece out of his own, and is getting ready to castle.",
        "7... Ng4": "? Better was to develop with 7...Nc6, but like with the last move, I was still very angry with cdeburca, so I deliberately broke the principal of not moving the same piece more then once since that's something I got yelled at for doing.  However, this was my first real mistake because it loses a pawn.  Instead, that N had to stay on f6 as a defender so that white would not be able to win my e pawn.",
        "8. Bxe4 d6": "?? But, this wasn't the game where I was going to teach that commentator a lesson because, at this point, I decide to go back to normal development after that mistake.  And, unlike what cplusplus11 said, I don't completely agree that keeping material safe is more important then developing a piece which is also why I'm annotating this game.  Actually, since my development and structure around that K is better, instead of getting nervous, which is what I used to do, I'm feeling better, and this confidence continues to grow.  Therefore, because I believe that my opponent has a weakness, I felt that I could exploit, and the way to do so was continue with development, as I do here.  Little did I realize that this is a developing move, but the real reason I did that was development, where I could bring my LSB into play.  In fact, this move is a blunder because, at the very least, it loses a piece for a pawn.  Like my game with feisty_pawn, this one also made me remember that it's generally a good idea to also take a break when you're angry.  That's because when that happens you often don't concentrate, and actually make the wrong move which often turns out to be a blunder, as is the case here. ",
        "9. f3": "Yes, he is attacking my N.  But, this move is pointless as that's the only reason he made this move.  In which case, I can and will develop by waisting white's time, so that he's in a difficult situation, while I develop another piece.",
        "9... Be6": "This, as noted earlier, is the reason why I'll get into pieces.  That's because it's way more then just that.  By doing so, he must protect it, while I can do something to contest the center and get things.  Of course, that attitude here is wrong as I'm about to find out.",
        "10. c4": "This was just before I was taught to expect the best move here.  What I figured used to be one of my main weaknesses as a mentor really reviewed this thought process, and now I use that information to teach chess.  I figured that with my last move, he had to retreat that Q.  But, you shouldn't assume that if you move here, he must play that.  Instead, ask what he or she can do.  And, is the move good and why or why not.  Do the needed HW to actually make sure it's good.  In addition, ask yourself what your opponent can do and how he or she will respond because if you just assume, but then your opponent plays something that you didn't expect, you'll be worse off.  That's actually what Jack means by, \"Start Thinking\"  He doesn't just mean to think ahead or about the game.  But, also don't assume anything.  That's why my model and take on it is expect your opponent to make the best move, not the worst.",
        "10... Nf6": "Of course, I protect my N.  But, here I thought I was out of trouble.  What I didn't see, however, were the other threats that my opponent.  That's quite terrible because, at best, I'm going to lose another pawn and a R for a B with best play.  So, already, I'm in rough shape.  Yet, I'm not giving, and now I'm not angry.  Instead, I was simply ignoring what cdeburca had to say in my misstep that when you're lost you resign.  It goes back to a negative experience but one thing this coach did say that I agreed with is that, \"Chess is not to supposed to be a Fight or Flight mechanism\", when I told him.  However, he wasn't interested in me telling him why it was, and he didn't want to hear it.  And, of course, this was still ongoing for a very long time, but then, at last, I got a lot of help in time of need.  I realize, and it was from Jack what that weakness was.  This happened when I was down material and had a disadvantage, and made mistakes and was ready to resign.  But, that's when he said, \"Don't get nervous.\"  And, then, \"Don't give up right away.  Try to find a way out of trouble\", which is also a major reason as to why he's more then just a coach, but also my friend as I realize that that trying to find a way out of a situation is also important, in life.  That's how I was able to eliminate the Fight or Flight response because of the fact that I used to get overworried simply do to the loss of material which is why I resigned prematurely.  And, this is also why I got really angry with the commentators that I mentioned earlier when they said that I should've resigned, and now, why I teach my students not to do this.  The very first game ever where I won a lost game was a game I annotated, where I was down by more then 2 R's and a B, yet, still managed to pull an amazing swindle.",
        "11. Bxb7 Nbd7": "?? Worth noting is that, I'm a much stronger player.  But, here I was obsessed with developing another piece, and that's the only reason I played.  Were it not for development, this would've been a free R because, only at the last second, did I see the possibility of 12...Qxa8  In other words, that was just like, not strategy or tactics, which chess is really supposed to be about.  Therefore, it's worth noting, is that there was a lot of hope chess, if you go by Dan's definition, as well as, flip chess because, at the time, I was playing too many games, and way too quickly.  Had about 20 simultaneous games, with average time controls of about 20 minutes.  So, I gave it little to no thought on most of my moves, which is why I emphasize, now not to play too much at once.  You don't absorb the information, so you don't learn from your mistakes, and you're more prone to making them.  Nonetheless, despite how bad it's turned out, I'm not giving up.  Instead, I'm going to maintain, not just hope but confidence.  But, this time, by thinking and planning ahead, even if there's miscalculations, which is more hope chess.  On the other hand, this is what it's going to take to win since I am in trouble and now finding ways out of it.",
        "12. Bxa8 Qxa8 13. Nd4": "The idea is to get that N in a more comfortable since it was a little tight on e2.",
        "13... Nb6": "Like before, but this time, I'm just trying to find a weakness and see if there's any way to exploit since my development is complete, whereas, he still has more to develop.  So, this shows that I'm already starting to come up with a plan.  This doesn't mean that I'll even attempt cheapos, but I coming up with a strategy.  To note: I'm doing the WB, and he has also helped me figure out the weakness and not resigning early due to his amazing Q sacs, which is what also gave me an idea of boasting when anyone says that I should just resign, as, \"It's not so easy.\"",
        "14. O-O": "? Of course.  But, what was good much earlier is now a mistake because I now compensate to large mistake.  Not only does it lose a pawn, but later, it'll cost him a R for my B.  And, this was all planned ahead because the idea is that since I'm at a disadvantage, I had to think outside the box to have another chance.  So, instead of getting hesitant, I'm thinking, and already finding ways out of a bad situation.  And, this, btw, is what I mean by instead of getting fretting over it, that's why I get more and more confident when in a desperate situation.  It's now about being aggressive since, at the time, I felt that I has nothing else to lose so you might as well just do anything to stay in.  It works here, but that still isn't the best approach, as I recently learned.  Having said all of that, best was 14.d3! to keep that pawn safe.  This is also why pawn chains are very important, in addition to what I've already learned.  In fact, I've kept one or two pawns safe just with a pawn chain, as that's something that strengthens the pawn structures.",
        "14... Bxc4 15. Qc3": "I would've played 15.Qa3 here because of my next move.",
        "15... Nfd5": "However, even if it weren't for the Q being harassed like, I still would've compensated with my next.  Note: That I had it all figured out since he castled, which shows that I thought about 4 moves ahead, which is, already, a significant improvement, since at the time, it was only move by move.  And, now this is where I start thinking like a GM.  By this, I retain I learned from both TA and GM JP. ",
        "16. Qb2 Bxf1 17. Kxf1 Bf6": "To put a lot of pressure on his N by pinning it.  This time, the pin is going to cause damage since I will give me that opportunity to double up his pawns right in the center.  And, doubled pawns in the center is the worst, more so then if they were away from the center.  Now, I also have way to expose his K.  Not right away, but it's going to come, sooner then later.",
        "18. a4": "I have no idea why he played this.  Now, what I didn't realize, at the time, was that knowing why your opponent made the move is just as important as the reason behind your moves.  It's part of theory and also why you expect your opponent to find the right response.  It's theory based on what he or she was thinking.  But, at the time, I didn't know why, so I felt that it didn't matter.  As far as, I was considered, it was an in inaccuracy since it doesn't develop so I was just going to take advantage of my opportunities with next move.  I realize, now, that it was about pawn structures.  The idea is connect him and go after my R, so that now I must do something about it and waste time.  ",
        "18... Nc4": "But, I have plans since his pieces aren't out.  And, now worth noting that my game against slongstaff, I believe it was, is now over, after here.  So, now it's about what the commentators mentioned of taking advantage of the weaknesses that you're opponent creates for him or herself which is the logic behind the General Opening Principals.",
        "19. Qc2": "Trying to get his advantages back.",
        "19... Bxd4": "But, I'm not going to make it easy.  In fact, this is also something that I was planning for several.  I was trying to figure how to do this, right after he played 15.Qc3  The idea was doubling up his pawn right in the center like this since doubled pawns in the center are the worst, even more so, then doubled pawns away from the center.  In fact, I've lost several games against Jack by allowing to double my pawns on the center squares, and I kept that in mind by planning this out, which does show that I'm an intelligent person.  That's why when I have people such as damalfi, cplusplus11, or cdeburca who imply or state that I should've or deserved to lose from a mistake I made, well, this is how I know otherwise.  And, that's also why I took offense when damalfi said that we know you'd lose against a 1600 rated player, as that's false given my swindles against Jack.",
        "20. exd4 Nxb4": "?? Blunder.  I felt that I just compensated for all that I lost.  As far as I was considered I completely bailed out of trouble.  However, I overlooked white's next move.  This was a blunder as it loses a piece, which is worth more.  Best was 20...Qe4 as it puts a nasty pin right on the N.  Even when he breaks it with 21.c6, there is still a bit of pressure against black's N.  However, as noted, I'm still going to remain confident and not resign.",
        "21. Qxc4 Qxf3+": "Part of my plan.  And, it was a tactic that I overlooked.  However, that I saw this, makes builds my optimism.",
        "22. Kg1": "Best! His only other option was 22.Ke1, but I'd mate soon after 22...Re8+  Now, when I play it, I don't have an immediate mate, but black will still have problems, one way or another. ",
        "22... Re8 23. Ba3": "?? Going after my N, whilst developing another piece.  However, despite being ahead, this loses immediately, as now I have a mate in 2 which can't be avoided.  Best was, 23.Qf1  Yes, white loses his Q, but it's the only alternative.  As, after 23.Qf1, my next move would be 23...Re1 pinning that Q, but I don't have a direct threat.  With this move, it's mate after 23...Re1+  Once again, I had to plan this out and think about it because if I didn't calculate he'd still have the advantages as I would've overlooked this mating sequence.  Now, the way I calculate, and occasionally, think like a GM is by using the Analyze the Board feature.  That's because I figure what to do with that feature.  Games like this from past experiences are why I emphasize that my students do that, so I give them HW questions that require you to use analyze the board.  ",
        "23... Re1+ 24. Qf1 Qxf1#": "So there are two morals to this game.  The first one is to develop your pieces, get the K to safety, and control the center, as schakertje emphasizes in his 3 step process.  Note: That white pushed pawns, moved the same piece more then once, and brought the Q out early, when the time could've been used to get his pieces into play.  More important, however, is to, \"Fight Til the End\", as I mentioned earlier.  As you now see, I had a disadvantage early on, as I was down material.  But, not only didn't I resign, but I maintained optimism and confidence and doing so, allowed me to pull this swindle.  So, what I remembered were the Q sacs from TA, as well as, Supplemental Talking the Talk rules which is the original WTW rules, that, you don't resign until you see that mate is inevitable.  The idea is that you never real know, and, \"it's not over til it's over\"  Afterall, just when you think it's over, your opponent might make a mistake that will allow you to make that combat and pull the swindle.  It even happens with stronger opponents.  So, don't give up hope.  Instead, when you're trouble, calculate, plan ahead, and ask yourself what you can do to get out of it.  And, even if you can't do anything, the longer you stay in, the more you learn which is one of the main things I teach in my training sessions.  Remembering these morals will help one improve his or her games.  In fact, this is what I needed to do to become as good as I am, today."
    },
    "url": "https://gameknot.com/annotation.pl/fight-til-the-end?gm=56868",
    "gameName": "\"Fight Til the End\"",
    "players": "poolplayer (967) vs. jkarp (1133)",
    "opening": "Benko's opening (A00), reversed Alekhine"
}