{
    "moves": {
        "1. d4 Nf6 2. Nf3 g6 3. c4 Bg7 4. Nc3 O-O 5. e4 d6 6. Be2 Nbd7 7. O-O h6 8. h3": "Parece estranho que os dois lados façam lances com o peão 'h' aparentemente sem motivo e ainda assim não haja nada de estranho. De mais a mais, 8.h3 é um lance útil em várias outras linhas. Aqui serve para evitar que meu bispo de casas negras seja expulso de e3, já que após Cf6-g4 ele não poderia contar com a casa g5.\n",
        "8... e5 9. Be3 exd4 10. Nxd4 Nc5 11. Bf3": "11.f3 não me agradou por causa da fraqueza das casas negras ao redor do meu roque. Algumas variantes me convenceram disso, mas o Fritz não vê problema.\nAlternative variation: 11. f3 Nh5 12. Qd2 Ng3 13. Rf2 Qh4\n",
        "11... Re8 12. Qc2 Nfd7": "Aqui começou uma série de manobras estranhas, das quais tirei vantagem.\n",
        "13. Rad1 Nb6 14. Ndb5": "Ameaça 15.Bc5 e cria pressão em toda a ala dama pisando em a7 e c7.\n",
        "14... Qe7 15. b4 Na6 16. Nd5": "Com o cavalo exilado em a6 tudo deveria ficar mais fácil, mas aqui optei por entrar em complicações desnessárias. Defender o peão em b4 e progredir lentamente com Dc2-b3, Bf3-e2, f2-f4, etc. seria o melhor caminho.\n",
        "16... Nxd5 17. cxd5 f5": "A idéia (equivocada) de tirar proveito da vantagem em desenvolvimento acabou facilitando as coisas pro negro.\n",
        "18. exf5 Bxf5 19. Qd2 Qh4 20. Nd4 Be5 21. Nxf5 gxf5 22. a3 Re7": "Desde 17...f5 até aqui fiz bons lances e tenho vantagem, objetivamente falando, mas achava que estava mal! Esse erro de avaliação e o efeito psicológico subsequente levaram aos próximos lances, que acabaram com a superioridade que eu tinha.\n",
        "23. Bd4 Rg7 24. Bxe5 dxe5 25. Kh2 Rd8 26. Qe3 e4 27. g3 f4 28. gxh4": "Outro erro significativo, que leva quase a igualdade. Muito mais forte seria 28.De1! ganhando o peão em seguida com grande vantagem.\n",
        "28... fxe3 29. Be2 exf2 30. Rxf2 Rd6": "O cavalo negro em a6 está muito mal posicionado e, em mãos mais hábeis a posição seria facilmente convertida em vitória. No entanto continuo fazendo questão de escolher lances fracos que dão chances de igualdade.\n",
        "31. h5 Nb8 32. Rf4 Re7": "Me permitindo 33.Tg1+ seguido de Tf8+ ou Txe4! Mas...\n",
        "33. Rd4 Nd7 34. Rdxe4 Rxe4 35. Rxe4 Nf6 36. Rd4 Nxd5 37. Bc4": "Segundo o Fritz a posição é igual, mas agora começo a ir de mal a pior.\n",
        "37... c6 38. a4 Kf7 39. b5 Ke6 40. a5 Ke5 41. Rd2 Nf4 42. Rxd6 Kxd6 43. a6 b6 44. bxc6 Kxc6 45. Kg3 Nxh5+ 46. Kg4 Nf6+": "Dois jogadores se esforçando pra mostrar como não se joga um final. 46...Cg7, impedindo meu rei de chegar em h6 seria muito mais forte.\n",
        "47. Kf5": "Aqui, em um final nem tão difícil de converter, meu adversário deixou a seta cair, confuso entre uma variante e outra. Uma armadilha comum em controles com acréscimo...\n"
    },
    "url": "https://gameknot.com/annotation.pl/final-estadual-sc-2009?gm=30609",
    "gameName": "Final Estadual SC 2009, ?",
    "players": "Brandao, Daniel (2049) vs. da Silva, Denison (1828)",
    "opening": "King's Indian (A48), East Indian defence"
}