{
    "moves": {
        "1. e4 e5 2. Nf3 Nf6 3. Bc4 h6": "hay temor al salto de caballo en g5, son preferibles las movidas [3...Cc6 Defensa de los 2 Caballos; 3...Cxe4 4.Cc3 Cxc3 5.dxc3 f6 la forma correcta de combatir este gambito de la Defensa Petroff",
        "4. Nc3": "Nc3 piloto automático de la apertura escolar! [4.Nxe5 deja a las blancas con gran ventaja ya que el ataque de caballo y alfil sobre f7 nos hace ganar peones 4...d5 5.exd5 Bd6 6.d4]",
        "4... Nc6 5. d3 d6 6. h3 Be6 7. Bb3 Be7 8. Be3 O-O": "hasta aquí nada podemos cuestionar a este inicio de partida en donde Pilar y Rodrigo cumplieron todas las recomendaciones que hacemos los profes en las aperturas: Desarrollo de piezas (sacar caballos y alfiles), ocupar el centro con peones y realizar el enroque prontito. Sin embargo desde una manera experta el enroque negro parece apresurado. Al tener el peón en h6 se genera un contacto de ruptura con otro peón blanco en g5, y Pilar podría lanzarse a un ataque sobre el Rey negro mediante Tg1, g4,g5 y Dd2. La recomendación en estas posiciones es esperar a que el otro enroque primero ya que este plan con el Rey en el blanco enrocado no se puede hacer, son preferibles entonces las movidas: [8...£d7; 8...d5] ",
        "9. Qd2 Kh7": "el Rey defiende h6 y se anticipa a un sacrificio Axh6 seguido de Dxh6",
        "10. Nd5": "10.0–0–0",
        "10... Bxd5 11. Bxd5 Qd7 12. Nh4": "una buena idea estratégica y un error táctico. El caballo se dirige a f5 donde no puede ser expulsado y permite un peligroso ataque en conjunto con el equipo Dd2-Ae3, sin embargo en h4 el caballo se encuentra en el aire y es mirado de reojo por el alfil de e7 ",
        "12... Nxd5 13. exd5 Bxh4 14. dxc6 Qxc6 15. O-O f5": "las negras tienen un peón de ventaja y movilizan sus infantes!, se amenaza f4 y el alfil de e3 queda encerrado ",
        "16. f4": "Pilar detiene el ataque de peones , este es un momento critico de la posición y ... dispone de varias opciones, la manera en que coloque sus peones determinan partidas distintas; se puede jugar como en la partida o dejar los peones centrales quietos o avanzar el peón a e4 ",
        "16... exf4 17. Bxf4 Qc5+ 18. Be3 Qc6 19. Rf3 Rfe8": "Se ocupa la columna abierta pero olvidamos a nuestro peón de f4! y Pilar equilibra el juego capturándolo ",
        "20. Rxf5 Re5 21. Rf7": "Siempre que se pueda es bueno ocupar con las torre la 7 fila en este caso la clavada al peón de g7 favorece la amenaza Axh6 ",
        "21... Bg5": "excelente defensa!, se desmantela el peligroso equipo Dama y Alfil [21...Tae8 22.Ad4 (22.Axh6 parece bueno pero queda encerrada nuestra torre después de 22...Af6) ",
        "22. Bxg5 Rxg5 23. Re1 Qc5+ 24. Kh1 Qd5": "24...Te5 es la mejor alternativa previniéndose del doblaje de torres en séptima fila y disputando la columna e, sin embargo Arispe no quiere renunciar al poder que le pueda dar su torre en la columna g en combinación con su dama",
        "25. Rxc7 Qxa2": "la maniobra realizada con la dama es incorrecta ya que se aleja de la zona de juego y posibilita que las torres negras mejoren su juego ",
        "26. Rxb7 Qd5 27. Ree7 Rg8 28. Rbxa7 Rf5 29. Ra1": "con peones de mas Pilar prefiere asegurar su ventaja y retrocede su torre para tener defendida su primera fila. Eran mejores otras alternativas en las que se siguen manteniendo la dupla de torres en séptima. ",
        "29... Rgf8 30. Kg1 Qc5+ 31. Re3": "hay temor a que ingrese la torre negra a f2 pero una autoclavada nos deja en peor posición lo lógico era 31.d4",
        "31... Qc7": "La partida es tensa estamos en la mesa 1 de la final 2011de 7 grado, Rodrigo no quiere volver a sentir la presión de las 2 torres en 7 fila y se defiende pero era justo el momento en que podía mejorar su posición considerablemente y ser el quien ocupara la séptima fila, era muy fuerte la continuación: [31...Tf2 32.Dxf2 (32.De1 Tf1+ 33.Dxf1 Txf1+ 34.Rxf1 Dxe3; 32.Dc1 Tc2 33.De1 Te8) 32...Txf2 33.Rxf2 Dxc2+] ",
        "32. d4 Qf7 33. Qd3 g6 34. Ree1 Qd5 35. c4 Qc6 36. Ra7+": "de regreso a su lugar en el mundo Torre",
        "36... Kg8 37. Qg3": "amenaza mate pero permite una defensa se ganaba inmediatamente con [37.Tee7 Sí, sí, sí las torres a la séptima fila! 37...T8f7 38.Txf7 Txf7 39.Dxg6+",
        "37... Rg5": "y en esta posición difícil acordaron las tablas. Todavía se puede seguir jugando pero no es fácil con poco tiempo en los relojes, la dama blanca parece que debe retirarse a h2 para defenderse de la mortal amenaza Dxg2. Sin embargo la posición final bien podría ser presentada como un problema de ajedrez que ejemplifica los siguientes temas: 2 torres en séptima fila; Mate del Caminante, Desviación; veamos su solución 38.¦ee7 amenaza mate en tres 38...Tf1+ liberando la casilla f8 para escapar con el rey [38...Tf6 39.Tg7+ Rf8 40.Th7 Rg8 41.Tag7+ Rf8 42.Dxg5 hxg5 43.Tc7 y las blancas ganan ya que si se retira la dama se recibe mate y es única 43...£xc7 44.¦xc7; si se acepta el obsequio se visualiza el poder de las torres dobladas en séptima 38...Txg3 39.Tg7+ Rh8 40.Th7+ Rg8 41.Tag7#] 39.Rxf1 Txg3 40.d5! La dama está sobrecargada en la defensa de la octava fila si logramos sacarla de c6 cualquiera de las dos torres da el mate escalerita 40...Dxc4+ [40...Dc8 41.Tg7+ Rf8 42.Taf7+ Re8 43.Tg8+ enfilada que recupera la dama y obtiene gran ventaja] 41.Rg1 Dc1+ 42.Rh2 ¿y ahora como se evita el mate escalerita? 42...Txg2+! desnudando al Rey para dar perpetuo con la dama 43.Rxg2 Dd2+ 44.Rg3 Dd3+ 45.Rg2 Dd2+ y continúan los jaques con la dama "
    },
    "url": "https://gameknot.com/annotation.pl/final-ajedrez-escolar-gcba-2011?gm=42403",
    "gameName": "Final Ajedrez Escolar GCBA 2011",
    "players": "Becerra, Pilar  vs. Arispe, Rodrigo ",
    "opening": "Petrov (C42), Italian variation"
}