{
    "moves": {
        "1. e4 e5 2. Nf3 Nf6 3. Nc3 Nc6 4. d4 exd4 5. Nxd4": "Estou empregando a Petroff há pouco tempo e não estou muito familiriazado com as transposições. Aqui já tive que começar a pensar.\n",
        "5... Bb4 6. Nxc6 bxc6 7. Bd3 d5 8. exd5 Nxd5": "Um erro. A única justificativa para capturar com o cavalo seria com intenção real de tomar duas vezes em c3, o que ninguém com menos de 4 processadores e força de 3255 faria. Correto é 8...cd5 seguido de 0-0 e c7-c6.\n",
        "9. O-O Nxc3 10. bxc3 Be7": "Pegar o peão é muito perigoso, pra não dizer perdedor. Depois de 11.Ba3 duvido que o preto consiga resolver os problemas que surgem.\nAlternative variation: 10... Bxc3 11. Ba3 Be6 12. Qf3 Qd7 13. Bb5\nAlternative variation: 10... Bxc3 11. Ba3 Bxa1 12. Qxa1 Qg5 13. Qc3\nAlternative variation: 10... Bxc3 11. Ba3 Bf6 12. Re1+ Be6 13. Be4\n",
        "11. Qf3": "Eu imaginei que a posição estaria próxima da igualdade depois de 10...Be7, mas o tempo a mais do branco faz toda a diferença.\n",
        "11... O-O 12. Qxc6 Be6": "Aqui eu achei que 12...Tb8 não serviria por causa de 13.Bf4 e Dxc7, mas 13...Bd6 seria razoável. Mesmo após o lance da partida há esperança, mas de agora em diante o preto nunca tem chance de obter real compensação pelo peão e faz um jogo de resistência, até fraquejar no lance 22.\n",
        "13. Rd1 Bd6 14. Be3 Qh4 15. h3 Rfd8 16. Be4 Qh5 17. Bd4": "O branco corretamente não se deixa levar pela idéia de trocar algumas peças, que deixaria ao preto bom contrajogo pelo déficit material.\nAlternative variation: 17. Qxa8 Rxa8 18. Bxa8 Qe5 19. Rab1 f5\n",
        "17... Rac8 18. a4 Qg5 19. Rd3 Bd7 20. Qd5 Qf4": "A última c hance de igualar estava justamente na troca de damas. 20.Df4 já permite um arremate imediato.\nAlternative variation: 20... Qxd5 21. Bxd5 Bf5 22. Rf3 Bh2+ 23. Kxh2 Rxd5 24. Bxa7 Ra5\n",
        "21. g3": "Alternative variation: 21. Rg3 Bf8 22. Rf3 Qh6 23. Qxf7+ Kh8 24. Bd5\n",
        "21... Qh6 22. Bf5 Qg5 23. Bxh7+": ""
    },
    "url": "https://gameknot.com/annotation.pl/final-estadual-sc-2009?gm=30608",
    "gameName": "Final Estadual SC 2009, ?",
    "players": "Cunha, Haroldo (2258) vs. Brandao, Daniel (2049)",
    "opening": "Petrov three knights game (C42)"
}