{
    "moves": {
        "1. d4 d5 2. Bf4 Nc6": "Not exactly weak, but look: in Q openings, both sides have to be careful about blocking the c pawn with the knight. It seems a normal move, and it is playable, but you must know about what are you giving up: the possibility to play c5 at some point, unless the knight goes away, and it won't be easy... ",
        "3. Nf3 a6": "Passive, and completely useless, since no threat for white to have a piece there for a couple of moves. Even doing so, it is not dangerous for black. BUT I understand that those were things I couldn't see were I was a beginner (and I still am, for sure!). ",
        "4. Nbd2": "This seems passive, but white is just following a good scheme, don't blocking the c pawn in sight of c4. (White is not going for this, but black can't know at the moment). ",
        "4... Nf6 5. e3": "This kind of passive developement by white aims to a game that can \"explode\" very easily if black omits some \"surprise moves\". It is defendable, for sure, but with great care. ",
        "5... e6": "This is a mistake, as it is doesn't seem to be. Black already gave up the c5 advance, and now gives up the square f5 to his lsb. The possibility to play Bf5 by black is assured, for the moment, by the a3 pawn, that avoids Bb4 by white. So, Bf5 could have been at least coherent with a3. I understand that black wants to shield himself, but this strategy seldom works, and you have to be very, very good to play for that. ",
        "6. Ne5": "Inviting an exchange, since black thinks that allowing NxN by white would debilitate his pawns, so he has to defend with Bd7, and this allows white to play NxB, something you would normally avoid. But this is not the case: Bd2 was a good move, since the white bishop is caged in (unless black wants to try a queenside pawnstorm), so it is less important than the well placed white knight. ",
        "6... Nxe5": "this seems harmless, but see: ",
        "7. dxe5 Ne4": "If white exchanges the knight, the pawn wall in the center would be a headache for both players, but white's queenside will reveal all its weakness, since the dsb is caged kinside. No, white doesn't have to wait for that: it is very important now white takes the initiative in a rather surprising way:",
        "8. Qg4": "Black can't now get the bishop out without exposing g7. Of course, black can chase the queen with h5, but this is what white wants: to provoke troubles on the kingside so not to allow black to expand on the queenside. ",
        "8... Nxd2": "This makes black happy: his knight found its fate, but with the honour of having put the white king on an exposed center. And he is completely right: white is probably doomed here, but... let's my opponent to demostrate it. ",
        "9. Kxd2 d4": "Good. This threat has to be handled with great care, since any other move gets white in real trouble. ",
        "10. Bd3": "This may seem strange, but black has no \"one move threat\" after the pawn's check. Of course, I expected c5 (finally!), with the idea of c4, but I can defend with c4 first... a tricky position. As you can see, in two moves the firework started. ",
        "10... Bb4+": "All into the calculations, guys, dont' shake...",
        "11. c3 dxc3+": "Yes, the opening of the d column was unavoidable. But black needs two aligned pieces to threat the central pawns...",
        "12. bxc3 Ba5": "Due to his lack of developement, black can't pile two pieces to take advantage of the pin and the exposed king. And, by this retreat, black forgets...",
        "13. Qxg7 Rf8": "Obviously...",
        "14. Bh6": "Obviously...",
        "14... Qe7": "Obviously...",
        "15. Bxh7": "...and this is just to play Bb8, and black must lose f7 by force. ",
        "15... Qd7+": "Ok, now...",
        "16. Ke2": "!? I just want to get the king out of checks, since black has to go back to the defence of Rf8 if not checking. So I am not worried for the c3 pawn at all, on the contrary, I leave it to test his judgement. ",
        "16... Qb5+ 17. Kf3 Qd5+ 18. Be4": "This was my plan. I have to give up the Bg8 plan, but black had played well its countergame, and I have to be wise and defend before he finds a way out. Now, I also have the rooks to enter into the fry...",
        "18... Qc5": "Black can take c3 with the bishop, but then, Rc1 will overload the queen (dued to f8 too), and the bishop will be lost. ",
        "19. Rad1": "Black was wise by not taking the pawn, but now my rooks plan comes in. Maybe better would have been Qf6 (my next planned move, uncovering the attack on the rook), but the main thing is: \"I must not allow black to castlle queenside\". And he will not be able to to it. Can you see how?",
        "19... Bd7 20. Qf6": "Now, to be truthful, black can simply offer the queen's exchange, and stay -2, based on c3's and a2's weakness. ",
        "20... Rg8": "But he still wants to attack, and this I liked very much...",
        "21. Bg5": "A very tricky move, as you would see...",
        "21... Bc6": "I expected this, in fact, since it is very nice for black to think about BxB+, KxB, Qc6+, Kmoves, Qxg2, pressing on the B... but hey, you overlooked white's power of the aligned pieces on d1. ",
        "22. Rd8+": "Black should recognize the pattern: a king on a border with the diag square blocked, a bishop and a rook. It is very useful to spot whenever possible. The game could have been more expectacular if I played the queen first, but with the same result. ",
        "22... Rxd8 23. Qxd8#": "I hope it helps. Remember: I'm not an expert, I'm just an amateur, and I can be deadly wrong. "
    },
    "url": "https://gameknot.com/annotation.pl/fireworks?gm=55550",
    "gameName": "Fireworks",
    "players": "damalfi  vs. Young Player (1200)",
    "opening": "Queen's pawn, Mason variation (D00)"
}