{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Bc4 Nf6": "I usually like to play aggressively, and so we started this game with a Two Knight defense opening.",
        "4. Ng5 Bc5": "This is a good play, white knight defends his pawn and attacks f7. I usually play d5 or Qe7, but this time I wanted to try something different and with Bc5 the game went to a Traxler variation.",
        "5. Nxf7": "Bxf7 it's a better play. Nxf7 seems better because of the dual attack on black queen and rook but leads to...",
        "5... Bxf2+": "... Bxf2+ that puts white under pressure and forces a move by the king.",
        "6. Kf1": "Kxf2 was also possibly but with Nxe4+ the queen is released. This move seems a good defense although the rook becomes trapped.",
        "6... Qe7": "Take the queen from the attack.",
        "7. Nxh8": "With this play white takes the lead in pieces but the knight is removed from play. Black has to take advantage of its positioning and pressure must be kept.",
        "7... d5": "I wanted to keep the knight trapped and remove the protection of the f7 tile. This also releases the bishop.",
        "8. exd5": "This is a better play than Bxd5, because of 8. ... Bg4",
        "8... Bg4 9. Be2 Bxe2+": "Had to switch bishops because the knight in c6 has to move and the white bishop had the queen support.",
        "10. Qxe2 Nd4": "The only play that saves the knight and still pressures white.",
        "11. Qd3": "Qxf2 would have been better.\nBlack could do 11. ... Nxc2 12. ... Na1 but doing that black loses its positional strength. And with 11. Qxf2 Ne4 black puts the f7 tile vulnerable.",
        "11... Qc5": "Since white was so eager to defend c2 and consequently the rook, I brought the queen into game expecting a defensive maneuver of the c2 tile.",
        "12. Nc3": "I think that was a strong play, trying to bring the knight into game, but probably c3 was better forcing black to move the knight.",
        "12... O-O-O": "Taking advantage of piece development I tried to bring the rook into game.",
        "13. Nf7 Rf8": "White has a possibility to put the knight into play. But with this play I can do Nf6 and put the white king in a dangerous position.\nAnd alternative was e4 which would lead to Qh3+ Rd7, a rook lock and a very mobile white queen.",
        "14. Nxe5 Nxd5": "Now white is in serious danger.",
        "15. Nxd5 Bg3+": "The white king is surrounded and in serious pressure. ",
        "16. Nf3 Nxf3 17. gxf3 Qf2#": "After 15. ... Bg3+ the mate was eminent.\n\nI really enjoyed this game. This really showed me the strength of a early pressure on the opposing king. \nWhite gained piece advantage but loose development which was crucial in the end game."
    },
    "url": "https://gameknot.com/annotation.pl/first-try-on-the-two-knight-traxler-variation?gm=30183",
    "gameName": "First try on the Two Knight - Traxler variation",
    "players": "manolo_barcelona (1320) vs. danaboca (1378)",
    "opening": "two knights defence (C57), Wilkes Barre (Traxler) variation"
}