{
    "moves": {
        "1. d4 Nf6 2. c4 g6 3. Nc3 Bg7 4. Nf3": "So far the opening has been quite easy to play. I was expecting him to play d5 and move into the grunfeld defence at this point. Nf3 is more of a waiting move with the hopes that he plays d5. I was sort of hoping for it since it was one of the few openings that I actually had prepared for that day. However my opponent didn't play with a lot of ambition and just sort of turtled up.",
        "4... O-O": "Not the move I was hoping for, but a valid move. For as far as I understand the position he'll turtle up and wait for me to go on the offensive and then hope to somewhere gain an edge.",
        "5. e4": "I accept his challenge. I'm not familiar with having this much control over the center, but it can't possibly be a bad thing.",
        "5... d6": "Setting up for his bishop to come to g4 and make a break via either e5 and c5 in the hopes to undermine my center.",
        "6. Bg5": "This was the first move on which I spent more then 5 minutes, surprising my opponent. It may seem like an easy move to make, but I had to calculate potential c5 and e5 plans. I figured that I was okay with e5 being played. I'd probably respond with d5 and suddenly his bishop on g7 becomes a lot less valuable. If he played c5 then I was okay with dxc5 since  I could potentially get a stronghold for my knight on d5. Granted that's looking many many moves into the future, but still. I was also considering to put my bishop on f4 since it puts a halt to e5 ideas, but didn't find a lot of value there. The d6 pawn is rock solid. I also could have put it on e3 but felt that wasn't ambitious enough.",
        "6... h6": "The idea is to chase away my bishop, but this move weakens his structure considerably and is the start of me slowly building towards a decisive attack.",
        "7. Bh4": "Retreating the bishop and provoking him to play g5, seriously weakening his position.",
        "7... c6": "Creating another diagonal for his queen and supporting an eventual b5 push. He won't play d5 since it doesn't actually accomplish a lot so I was sure that his plan was b5. I wasn't too afraid of it since him trading on c4 could create an interesting home for my light squared bishop.",
        "8. Be2 a6": "Another prep move for b5. He really seeks counterplay via the queenside of the board. I still wasn't terribly concerned.",
        "9. Qd2": "This move took me a surprising long time to make. The idea is very simple, but I had to look into the entire b5 affair.The idea is to capture the knight on f6. He loses a pawn if he recaptures with the bishop so he'll recapture with the f-pawn. It creates a nice open e-file for black, but his bishop is temporarily rather bad and the doubled pawns don't help a lot in defending his position. The open e-file can also serve as a way to get my own pieces into the attack.",
        "9... b5": "The dreaded b5 move, at this point I already had an idea on how I'd handle the situation. I had about an hour and 5 minutes left on my clock ( we started from 1 hour and a half ), he had spent 3 minutes.",
        "10. Bxf6 exf6": "Creating doubled pawns, since he'd lose a pawn otherwise.",
        "11. a3": "Preventing b4 before he gets that idea in his head. Maybe I should have castled instead, inviting b4 so I'd have a reason to play Nd1 -> Ne3, but I felt like there might be better things in the position rather then castling. Let's asses the position for a second. My control over the center is arguably better, he got doubled pawns and his pieces are still stuck on the 8th rank. On the other hand he got a nice open e-file and some questionable counterplay on the queenside. f5 is also coming after which the position becomes quite a bit more complicated and sadly all those complications are mine to calculate. I have about 55 minutes left on my clock.",
        "11... f5": "Let the complications start! The difficulty of this position is that if I allow bxc4 or fxe4 I lose material. Let's say I play a hypothetical 12. h3 bxc4 13. Bxc4 fxe4 and I can't recapture with the knight because of d5! forking bishop and knight. At this point I start calculating every possible way of capturing and if I can get away somehow with leaving the position as is. The conclusion I come to is that I can't  ignore it. Now I need to make a decision on whether I capture on b5 or on f5. There's also the issue of Re8 that's coming, pinning my bishop and king.",
        "12. cxb5": "This variation seemed the best result for White. Now there are 3 possible moves for black. axb5 which activates his rook, but makes his c6 pawn very vulnerable. cxb5 which isn't bad, but I could get a pawn on d5 and create a strong square for my knight on c6 or I could maybe get my bishop on f3, push e5. and then threaten to win material. The other option is fxe4 and it's the variation I was most worried about. fxe4 Nxe4 and with Bf5 he gets his bishop active again. That or he could play Re8 and threaten my knight. Either way my response will be the same.",
        "12... axb5": "Winning back the pawn, but his knight will have issues developing to a good square. and his c6 pawn is rather weak.",
        "13. exf5": "I am okay with him moving his bishop to f5. I have ideas after Bxf5 to play d5. If he trades cxd5 I can capture on b5 first and his doubled pawns in the center will become an easy target.",
        "13... b4": "Not the response I was expecting, but it's definitely more challenging then the ideas I had in mind. I can't take axb4 since Rxa1 follows. I don't have the time to castle either because of bcx3. I start looking for ideas along the lines of 13. fxg6 bxc3 14. gxf7+ Rxf7 15. Qxc3, but came to the conclusion that his now weakened kingposition wasn't worth the knight on c3. I also had some concerns still about Re8 that can come at any moment, but it's then that I noticed that if my knight was on g3 then it'd also defend my bishop on e2 and as a result I don't need to fear Re8 since I'd have enough time to castle out of the pin.",
        "14. Ne4 Bxf5 15. Ng3": "Defending the bishop on e2 and threatening to create yet another weakness in his position with Nxf5.  At this point in time I had about half an hour left, my opponent had 1 hour and 16 minutes left. With the additional 30 minutes still nowhere in sight I became a little bit frightened, but I knew my position should be winning.",
        "15... bxa3": "I didn't see it coming and most would have just played bxa3 or Rxa3 in an instant here however I  notice that capturing the pawn on h6 comes with check. I know what I want to play here, but still spent quite some time recounting the material over and over again. I may not have a lot of time left, but with a 30 second increment per move I won't run out.",
        "16. Nxf5": "Allowing the capture on b2 since I'll have Qxb2. Either he captures my knight and ruins his pawnstructure in the process or he goes through with his plan and I'll still have a superior position due to his pieces being stuck on the 8th rank.",
        "16... axb2 17. Nxh6+": "Capturing is more or less forced. Kh8 gets met by Nxf7 winning a pawn in the process and Kh7 gets met by Qxb2. It's the   same position, but his king is slightly more vulnerable. Note that Ng5+ after Kh7 looks promising, but doesn't lead to much. You can take on f7 and fork if he takes on h6, but with him promoting while winning your rook you'll be down in material. About 20 minutes on my clock left. My opponent gets an arrogant look on his face as if he finds it hard to believe that someone of his strength is drawing/losing to someone of mine. Especially since I'm a slow player. At this point I was a little bit sad since although I was convinced that my position was better, I wasn't sure if it was enough to force a win. Interesting to note, better was to just take Qxb2 here since he'll have to recapture gxf5 and it ruins his pawn structure completely, giving me a decent advantage.",
        "17... Bxh6 18. Qxb2": "Material is dead even again. Black might do well here to just trade off the rooks and hope he can hold a draw. Computers even suggest that black is up 0.7 after the trade of rooks for reasons that aren't completely clear to me. The position has been around equal for a long time now ( according to computers ), though it definitely didn't feel that way when I was playing. Perhaps because the position feels relatively easy to play for white.",
        "18... Nd7": "Finally developing his knight ( I can't say much as I haven't castled yet, but still. ) I start thinking about h4 ->h5 ideas, but found that while interesting I'd like to castle sometime soon as to not risk losing to some dumb thing I overlooked.",
        "19. O-O Qc7": "I don't fully understand this move. It defends both his pawns and indirectly aims at the h2 square, but it doesn't feel that strong.",
        "20. Rfd1": "Preparing the d5 push. The plan was easy. Either he captures and I'll get my rook on the 5th rank where I can wreak havoc in the future or he pushes and I put my knight on c6.",
        "20... Rab8": "A move that feels kind of pointless. You still have an hour left, why aren't you thinking of a concrete plan?!?, I shout in my mind.",
        "21. Qc2": "I was thinking of Qa2 since it makes him unable to move his f-pawn, but I was pretty sure I couldn't force anything on Qa2. The plan of Qc2 is to eventually get my rook to g3 and do some kind of sacrifice perhaps. Especially since I'd also be able to win his bishop, which is adequate compensation imo. Sacrifice on g6, get my queen on g6, his king moves to h8, I capture the bishop, he goes back to g8, I play Ng5 and it looks like it'll eventually end up in checkmate. That was the basic idea.",
        "21... Rfe8": "Threatening the bishop which is defended anyway. Better was probably Nf6.",
        "22. Nh4": "Had I played in this tournament half a year ago I wouldn't have found this move. But now I played it with little hesitation. I blame all the puzzles I solved over the course of the year sacrificing all types of pieces. The idea behind Nh4 is to play Nxg6.",
        "22... Nf6": "A good defence. Now Nxg6 fxg6 Qxg6 gets met with Qg7!. The only way to progress is to keep on adding pressure until he cracks.",
        "23. Ra3": "Preparing Rf3 or Rg3. I wasn't 100% sure of this yet, but my opponent finally started to realise he had an hour left on his clock and started to think. I'm pretty sure I decided on Rg3 back then.",
        "23... Nd5": "Preventing d5 and creating a rather strong knight. That being said, it does bring some trouble with it and I'm not sure if this is a blunder.",
        "24. Bc4": "Pinning the knight. If I manage to play Bxd5 I'll win since he can't recapture with cxd5.  He can't defend with Re5 or Rb5 since I'll just capture them and retreating the knight means I play Nxg6. There's only one good move here in my opinion.",
        "24... Qe7": "Very clever, moving his queen out of danger and creating ideas of Qe1+. It also attacks my knight. Talk about a multifunctional move.",
        "25. g3": "I don't want to retreat my knight to f3. so instead i opt for g3. It creates a flight square for my king in the future or g2 can become a home for my knight if it for whatever reason wants to retreat. More importantly it defends my rather strong knight. The only issue with g3 is that my rook can't get to there now, but I was planning to push my f-pawn in the future and attack that way.",
        "25... Kh8": "He finally gets his king the littlest bit safer since Qxg6 isn't a check anymore. Better might have been Kh7.",
        "26. Bxd5": "My bishop wasn't as strong anymore with his king now on the dark squares so I opt to trade it in preparation of f4.",
        "26... cxd5 27. f4": "The plan is to push f5 and make his king vulnerable.",
        "27... Bxf4": "I hadn't considered this option and white has to threat carefully since gxf4 gets met by Qxh4.",
        "28. Nxg6+": "Although it seems strange it's the only way that doesn't lose material and more importantly his pawn will get on g6 undefended so it's a potential target in the future. I will also most likely get a passed pawn on either the h or f-file if it comes down to an endgame.",
        "28... fxg6 29. gxf4 Rbc8": "My opponent offers up the pawn on g6. I'm fine with that since Rh3 will be checkmate if my queen can get on g6.",
        "30. Qxg6 Reg8": "Cleverly pinning the queen and king. Sadly for him he doesn't have the time to take advantage of the pin.",
        "31. Rh3+": "Here my opponent resigns since after Qh7 Rxh7+ there's nothing he can do. My opponent played well considering how little time he used ( he ended up using 40 minutes of his 1.5 hours ) and the position never reached a stage where either one of us was down 1 according to computer analysis, but it makes me wonder what he could have come up with had he used more of his time. My performance wasn't as convincing as I had liked either, but it'll do. This game is the first out of 9 games that will be played. I started well, hopefully my second game has the same result."
    },
    "url": "https://gameknot.com/annotation.pl/first-game-in-the-national-tournament?gm=59212",
    "gameName": "First game in the national tournament",
    "players": "Jeremy Goris (1369) vs. Warre De Waele  (1656)",
    "opening": "King's Indian (E61), Smyslov system"
}