{
    "moves": {
        "1. e4": "Good ol' e4.",
        "1... d6": "I respond with Fisher/Reti for black.",
        "2. d4 Nf6 3. Nc3 g6 4. h3": "White recognizes the potential for an attack from Bc8.",
        "4... Bg7 5. Nf3": "Pretty routine to this point.",
        "5... Nbd7 6. Be2 c5 7. Bb5 a6 8. Bxd7+": "White offers a bishop in exchange for a knight.",
        "8... Nxd7 9. O-O cxd4": "My notes at this point.  Looking back, I wonder why I didn't take the knight with my bishop and continue to trade pieces.\n10. Nxd4 Nf6\n11. Nf3 b5\n12. Ng5 O-O\n13. Qf3 Rb8",
        "10. Nxd4 Nf6": "Instead of staying aggressive, I close up the castle again.",
        "11. Be3 Rb8 12. a4 e5": "continuing to apply pressure",
        "13. Nf3 b5 14. a5 Bb7 15. Bb6": "White's bishop becomes a firmly planted thorn in my queenside.",
        "15... Qd7 16. b4 Nxe4 17. Nxe4 Bxe4 18. Ng5 Qc6": "At this point, somewhat obviously, I'm trying to simultaneously pressure the g2 and c2 pawns, and I'm feeling pretty good about the move.  But, after I made the move, I saw the folly in it.  In fact, I made a note to myself (as follows) of what might happen if white sees the opportunity for a counter-attack ...\n19. Nxe4 Qxe4\n20. Qxd6 Rc8\n21. Rf-d1 Qf5\n... as bad as this is, I didn't recognize the potential for even bigger problems in move 21.",
        "19. Nxe4 Qxe4 20. Qxd6 Rc8 21. Bc5 Bf8": "22. Qxa6 Qc6\n",
        "22. Qxa6": "My Dad taught me a simple rule a long time ago, never trade pieces when you're behind, unless you have a really good plan for how it's going to help you down the road.  Although this series results in an even score, I'm not sure I had a plan beyond that point.",
        "22... Qc6 23. Qb6 Bxc5": "24. bxc5 Qxc5\n25. Qxc5 Rxc5\n26. a6 O-O\n27. a7 Ra8\n",
        "24. Qxc5 Qxc5 25. bxc5 Rxc5": "A series of trades results in an even score and pressure on c2, but white has a rook behind a pawn, which is a strong position.",
        "26. a6": "And he knows it.",
        "26... O-O 27. a7 Ra8": "About the only thing I could do.",
        "28. Rfd1": "Why oh why didn't I take the c2 pawn?  We'll never know.  It seems so obvious now, but I was apparently concerned about something.",
        "28... Kg7": "A wasted move.",
        "29. Rd7 Rc4": "30. Rb7 Ra4\n31. Rxa4 bxa4\n",
        "30. Rb7 Ra4 31. Rb1 Ra5 32. Rb1xb5 Rxb5": "33. Rxb5 Rxa7\n34. Rxe5 Ra1 \n35. Kh2 Rc1\n36. Rc5 Kf6\n37. c4 Ke6\n",
        "33. Rxb5 Rxa7 34. Rxe5": "That pawn would be crucial.",
        "34... Rc7 35. Re2 Rd7 36. c3 Rd1+": "37. Kh2 Rc1\n38. Re3 f5\n39. f4 Kf6\n40. g3 g5\n41. h4 gxf4\n42. gxf4 Kg6\n43. Kg3 Rg1 \n44. Kf3 Rg4\n45. c4 Rxh4\n46. c5 Rh1\n47. Rc3\n",
        "37. Kh2 Rc1 38. Re3 f5": "Not sure what my plan was here, but white wisely exploits the opening to place me in check.",
        "39. Re7+ Kg8": "and now I'm conveniently trapped.",
        "40. Rc7 h5 41. c4 Kf8": "I try to go after the rook, but white evades nicely.\n42. c5 Ke8\n43. c6 Kd8\n44. Rd7  Kc8\n45. c7 Kxd7\n",
        "42. Kg3 Ke8 43. Kf4 Kd8 44. Rc6 Rc2 45. Rxg6 Rxc4+ 46. Kxf5": "and now things are really looking grim",
        "46... Rc5+ 47. Kf4 Ke7 48. Rg5 Rc2 49. Kg3 Rc3+ 50. Kh4 Rc2 51. f4 Rc4 52. Kxh5 Rxf4 53. h4 Kf6 54. g3 Rf3 55. Kh6 Ke6 56. Kg6 Rf6+ 57. Kh5 Rf3 58. Rg6+ Kf5 59. Kh6 Ke4 60. h5 Rf5 61. g4 Rf4 62. Kg7 Kf3 63. g5 Rh4 64. h6 Rh5 65. h7 Kg4 66. h8=Q Rxg5 67. Qc8+ Kh5 68. Qh3#": ""
    },
    "url": "https://gameknot.com/annotation.pl/fisher-reti-for-black-trap-at-move-18-backfires-missed-opportunity-at-28?gm=3965",
    "gameName": "Fisher/Reti for black, trap at move 18 backfires, missed opportunity at 28",
    "players": "robertjmarx (1463) vs. rpilaud (1467)",
    "opening": "Pirc defence (B07)"
}