{
    "moves": {
        "1. e4 c5 2. Nc3 Nc6 3. f4 e6 4. Nf3 b6": "I've seen this sideline a few times but am no good at dealing with it.",
        "5. Bb5 Bb7 6. O-O Nd4": "I probably should have taken the knight.  My bishop is next to useless in this position, where black has the white squares covered.",
        "7. Nxd4 cxd4 8. Ne2 Bxe4 9. Nxd4": "I was reluctant to make this trade, but I had little choice.",
        "9... Bc5 10. c3 Rc8": "I definetly like Bxd4 better for black, doubling my pawns and isolating them on the d-file.  ",
        "11. Qa4 Bxd4+ 12. Qxd4": "He should have played it earlier.",
        "12... Nf6": "This gives more weight to my g4 pawn push, as his knight is stuck defending the bishop.",
        "13. g4": "Aiming for g5, forcing black to part with the bishop or the knight.",
        "13... O-O": "A blunder.  d5 was better.",
        "14. g5 d5 15. gxf6 g6": "Now I have a focal point for my mating attack: the square g7, made vulnerable by the g6 pawn move.  instead, 15...Qxf6 16.Qxf6 gxf6 17.Kf2 is still better for white, but not quite so much as in the g6 line.  ",
        "16. d3 Rc5 17. dxe4 Rxb5 18. e5": "Allowing my queen to do as she pleases: namely, aiming at h6 and g7.",
        "18... Rc5 19. Qf2 Kh8 20. Qh4 Rg8 21. Rf3 Qf8 22. Rh3 h5 23. Qg5 Kh7 24. Kh1": "I almost blundered into 24.Rxh5+??, which would be fine if not for the black rook on the g-file that would pin my queen to my king after 24...gxh5.  Now Rxh5 is a legitimate threat.",
        "24... Rc4": "This seals black's fate, though chances were bleak anyway.  The only hope was to play Qh6.  ",
        "25. f5": "This subtle move was the key to white's attack.  The bishop reveals a deadly battery along the c1-h6 diagonal, and black is utterly lost.",
        "25... Qh6": "And black resigns.  26. Qxh6# would have followed."
    },
    "url": "https://gameknot.com/annotation.pl/foodisgood?gm=33587",
    "gameName": "foodisgood",
    "players": "slywing (1451) vs. rafferty (1333)",
    "opening": "Sicilian (B23), Grand Prix attack"
}