{
    "moves": {
        "1. e4": "Hi all! I'm coming to you today with a very special game--for me anyway. This game pushed me across the 1800 mark for the first time! I think the play itself is interesting enough to be worth a look, as well. I get an advantage relatively early on, and then on move 18 I make a choice that gives the game its very unique flavor. Enjoy!",
        "1... d5": "l-d-j chooses the Center Counter Defense--old but good.",
        "2. exd5 Nf6": "Personally I like this line more than the classical 2...Qxd5. This is the Marshall Gambit, where White may be able to hold on to his extra pawn if he so chooses.",
        "3. d4": "I stick to the main line, though. If Black takes on d5, I'll play c2-c4 and counterattack while gaining space.",
        "3... Bg4": "Unusual! It seems that White can very solidly hold on to the d5 pawn now with 4.f3 Bf5 5.Bb5+ Nbd7 6.c4, though the White Kingside will be cramped and he may find his light-squared Bishop awkwardly placed later on.",
        "4. Nf3": "I decide to begin development and keep my center open instead, letting Black regain his pawn. I can still follow up with c2-c4 after all.",
        "4... Qxd5 5. Be2": "Momentarily responding to the threat on my Knight. No sense in allowing Black to mess up my kingside pawns by trading on f3. Of course the immediate 5.c2-c4 was playable here.",
        "5... Nc6": "Already the position is very interesting; Black now threatens to win my pawn on d4 with ...Bxf3 Bxf3 Qxd4. **EDIT: This is actually not true; thanks to theduckquacker for catching it!",
        "6. c4": "Time to kick the BQ off her comfy central perch.",
        "6... Qf5": "Black maintains a centralized Queen and pressure on both f3 and c2.",
        "7. Be3": "O-O-O is coming and I don't want to have to worry about the defense of the d-pawn.",
        "7... O-O-O 8. Nbd2 e5": "Black makes his freeing break, also threatening to jump down to b4 with his Bishop. White needs to get his King out of the center and activate his heavy pieces.",
        "9. d5": "But first, this natural move is pretty strong. It kicks the Knight out of c6 and exposes a threat on the a7 pawn (but of course White can't simply win the pawn, because of Black's equally-natural response...)",
        "9... Nb4": "With the threat of ...Nc2+ thanks to the Queen.",
        "10. Rc1": "10.O-O was also an option here, but I like the open file this line gets me against the Black King's position.",
        "10... Nxa2 11. Ra1 Nb4": "Right back where we were, but now the a-file is half-opened for the White Rook at the cost of a pawn.",
        "12. O-O a6": "Of course, the only reasonable way to prevent the loss of the pawn.",
        "13. h3": "White needs to release some of the pressure on the kingside before he can pursue a queenside assault. This actually sets up a rather interesting option for Black: 13...h5?! where 14.hxg4 hxg4 gives Black a strong attack down the h-file. My opponent confided that he'd considered this line, but ultimately discarded it as White is not compelled to play hxg4 immediately.",
        "13... Bxf3 14. Nxf3": "Of course 14.Bxf3 was tempting, in order to set up an attempt to play Bg4, but the text is stronger, getting the Knight into the game and unblocking White's lines. Here the computer recommends 14...Bd6 to pressure the White kingside, evaluating the position as just about even with big attacks on both sides.",
        "14... Nc2": "?? A terrible misstep. Black intends to force White to give up his dark-squared Bishop and weaken his kingside squares further (after, for example, 15.Ra5 Nxe3 16.fxe3), but it's all moot as White has a crushing fork at his disposal now that the White Queen's scope extends to d3...",
        "15. Bd3": "And as quickly as that, White has a huge advantage. Of course 15...Nxe3 won't work, because 16.Bxf5+ Nxf5 leaves Black with only two Bishops for his Queen, and little counterplay.",
        "15... e4": "This is best, I think, though of course the pawn fork is a sham as the pawn is still pinned to the BQ.",
        "16. Bxc2 Bd6": "Black has to get all his forces into action immediately if he wants any chance to survive, so he develops the Bishop and prepares for Rook movement to the center as well.",
        "17. Qd4": "White centralizes his Queen with a powerful thrust, threatening to jump into the Black castle while pressuring e4 and g7.",
        "17... c5": "Giving White a passed pawn, but shutting down the White Queen's diagonal and giving her a kick. I fretted about my next move here for quite some time--transition to the queenside with Qc3 or Qd2? Give back some material for a counterattack play (18.Bxe4?! Nxe4 19.Qxg7 or 18...Qxe4 19.Qxe4 Nxe4 20.Ra5) and rely on my passed d-pawn to win?",
        "18. dxc6 e.p.": "!? Black has a nice combination available here, set up by his previous two moves. After analyzing it, I felt like I'd still be able to force a win, and the main result of the combination is to remove a lot of material from the board: an outcome I was perfectly okay with, being ahead by a full piece. There may well have been a more accurate move here, but I don't know what it was.",
        "18... Bh2+": "Unleashing the discovered attack against the White Queen. ",
        "19. Kxh2 Rxd4 20. Nxd4 Qe5+ 21. Kg1": "The dust has settled, and White has a Rook, Bishop, and pawn in exchange for his Queen, as well as his extra Bishop. It should be enough to win, but he'll still have to coordinate all his minor pieces while avoiding a mate from the remaining Black heavy forces.",
        "21... g5": "Black immediately marches on g4, attempting to free it for a Knight to occupy. I think 21...Rd8 looks playable as well, as this Rook doesn't have many prospects on the kingside right now, and Black needs every piece to be operating at full force.",
        "22. cxb7+": "Logical, bringing the Black King to where White can theoretically check him with Bxe4. The main draw of this move, of course, is removing obstacles to the White c4 pawn on its road to promotion.",
        "22... Kxb7 23. b4": "Preparing for Ra5 followed by Rfa1.",
        "23... g4": "I just don't think Black has time to make this attack effective. His Rook is still out of the picture.",
        "24. Ra5 Qd6": "Attempting to remain on the b8-h2 diagonal. The problem is, Black simply doesn't have the resources to defend everything that needs defending.",
        "25. hxg4": "I'm not sure if this is best, but I don't see anything obviously better. 25.c5 was my other main consideration. The goal of the text is of course to bring my LSB into the battle with check after drawing away the Knight, and win a pawn in the process.",
        "25... Nxg4 26. Bxe4+ Kb8": "White must, of course, be supremely careful, as Black is threatening instant mate on h2. But there is a swarm of minor pieces descending on the Black King...",
        "27. Nc6+": "White's goal is now to clean up the Black attack so that he can recoordinate and execute a mate. The plan starts by forcing the exposed Black King to submit to a fork or a discovered attack, losing material in the process. With correct play by White, it's only a matter of time now.",
        "27... Kc7": "Or: 27...Kb7 28.Ne5+, or 27...Ka8 28.Ne5+, or 27...Kc8 28.Bf5+ (winning the Ng4 in all cases).",
        "28. Bb6+": "! Forcing the BK onto one of the critical squares from which White can win further material. If 28...Kxb6? 29.c5+ wins the Queen.",
        "28... Kc8 29. Bf5+ Kb7 30. Bxg4 h5": "There's really nothing better for Black at this point. Death will come swiftly.",
        "31. Bf3 Qf4 32. Ne7+": "Keeping the King in his corner.",
        "32... Kb8 33. Rxa6 h4 34. Ra8#": "And that's all there is! Many thanks to l-d-j for a very enjoyable game. Comments are always appreciated! Thanks for reading!"
    },
    "url": "https://gameknot.com/annotation.pl/for-the-swarm?gm=49859",
    "gameName": "For The Swarm",
    "players": "bwaa (1808) vs. l-d-j (1777)",
    "opening": "Scandinavian defence (B01)"
}