{
    "moves": {
        "1. d4": "I think its time I annotated some lost games.  I know that this is probably more helpful by running through the reason I lost and not letting it happen again.  If I can avoid it that is!",
        "1... d5": "We both opened on the d file.  Me to d4 and my opponent to d5.",
        "2. Nf3 Nf6": "Next we developed out knights.  I played f3 and black played f6.",
        "3. g3 Bf5": "Now I moved pawn to g3 so I can fianchetto my bishop.  Black developed his LB to f5 pointing at my c2 pawn.",
        "4. Nbd2 e6": "I developed my knight to d2 protecting my f3 knight and black moved his pawn to e6.",
        "5. c4 Nc6": "I moved out my pawn to c4 and black developed his knight to c3 attacking my pawn at d4.",
        "6. Bg2 Bb4": "Now I moved my LB to g2 getting ready to castle.  Black developed his DB to b4 attacking my king which is protected by my knight.",
        "7. O-O Bxd2": "So I castle and remove my king from harms way and black captures my knight which is protected by the c1 DB, the queen and the f3 knight.",
        "8. Qxd2 dxc4": "So which one shall I use to capture the DB?  I capture the DB with my queen and black captures my c4 pawn with his d5 pawn.",
        "9. Ne5 Be4": "I move my f knight to e5 which is protected by the d4 pawn.  Black moves his LB to e4 attacking my LB at g2.",
        "10. f3 Bg6": "I move pawn to f3 and black LB retreats to g6.",
        "11. e3 O-O": "i move my pawn to e3 and black castles.",
        "12. f4 Ne4": "I push my f pawn to f4 and black brings down his f knight to e4 and is attacking my queen at present.",
        "13. Qe1 Nxe5": "So I retreat my queen to a safe spot back on e1 and black captures my knight at e5.",
        "14. fxe5 Qg5": "I recapture the knight with my f4 pawn and black brings his queen to g5 not a pleasant sight ",
        "15. h4 Qg4": "I attack the queen by moving my h pawn out to h4 and black's queen moves down to g4.",
        "16. Kh2 Bf5": "I move my king across to h2 as black has his knight at e4 and queen at g4.  I thought as I had bishop at g2 it could intercept the queen at h3 and then if the bishop follows I can take with my king.  If the queen decides to take on g3 I have my queen at e1 ready to take this.  Now black moves another piece into the action with his LB at f5.",
        "17. Rf4 Qg6": "I move my f rook up to f4 attacking the pieces and the queen moves back to g6.",
        "18. Rxe4 Bxe4": "I take the knight at e4 with my rook and black captures with his LB.",
        "19. Bh3 f5": "I move my LB over to h3 and black moves his pawn to f5.",
        "20. Bd2 Qh5": "I finally develop my DB to d2 supporting the queen at e1.  Black moves his queen to h5.",
        "21. Qg1 Qe2+": "I move my queen to g1 supporting the g3 pawn and black moves his queen down to e2 checking my king.",
        "22. Bg2 Qxd2": "I move my LB down to g2 to stop the check and black captures my DB.  I should have left it where it was.",
        "23. Kh3 Bxg2+": "I move my king up to h3 and black brings his bishop down to g2 and captures my LB and is checking the king.",
        "24. Qxg2 Qxe3": "I capture the LB with my queen and black moves his queen to e3.  ",
        "25. Qxb7 Qxd4": "I see a free pawn at b7 so I capture with my queen and black captures a pawn at d4.",
        "26. Re1 f4": "I bring my a rook across to protect my pawn at e5 and black pushes f5 pawn to f4 attacking my g pawn.",
        "27. Qe4 Qf2": "I bring my queen down to e4 to support the pawn at e5 protected by the rook at e1.  Black moves his queen to f2 far to close to my king for comfort.  I think at this stage I should have moved my queen down to g2 which would have given me more of a chance I don't think I was looking at the rook which could come down.  I thought the king would be able to fight it out rather than get locked in at h3.",
        "28. Kg4 Qxg3+": "I move my king over to g4 and black queen takes my pawn at g3 checking the king.   ",
        "29. Kh5 Rf5+": "I move my king across to h5 and black brings his rook to f5 checking the king and with queen at g3 the king has nowhere to go.",
        "30. Qxf5 exf5": "I capture the rook with my queen but knowing there is a pawn at e6 which will capture my queen.",
        "31. e6 Qg6#": "I valiantly try to move my passed pawn which is protected by my rook at e1 but the next move from black is checkmate.  I have 4 pawns while black has 7 with doubled pawns on 2 files c and f files.  So would that equate to 5 pawns, I don't know.  I suppose if I manage to take the first doubled pawn then he has the other to come down still.  Altogether I think it was a bit of a close game.  Sure you will let me know what you think."
    },
    "url": "https://gameknot.com/annotation.pl/for-the-love-of-it?gm=61151",
    "gameName": "For the Love of It",
    "players": "milly64 (1024) vs. fredbanda (1266)",
    "opening": "Queen's pawn game (D02)"
}