{
    "moves": {
        "1. e4 e5": "King's Pawn Game (for now).",
        "2. Nf3 Nc6": "Two Knights Game.",
        "3. Bb5": "This is the Ruy Lopez. I don't encounter it too much, but I hear that it is a great opening. My lag of experience for very complex openings prevents me from using it. However, I counterattack this opening with moderate ease.",
        "3... Nf6": "Correct me if I'm wrong, but I believe from my experience that this is the Berlin Defence.",
        "4. Bxc6": "This is not part of the opening played, therefore, it is an inaccurate move. 4.O-O is the main line and 4.d3 is the Mortimer variation while 4.d4 is the Nyholm Attack.",
        "4... bxc6": "I take toward the center.",
        "5. d3": "White protects his once hanging pawn.",
        "5... d5": "Inaccurate. 5...d6 is better.",
        "6. Nxe5": "As predicted. ",
        "6... Bb7 7. Bg5": "Why the other Knight? Can't White play a little less agressive?",
        "7... c5": "7...Be2 is slightly better than this move.",
        "8. Qf3": "Now, White is going too far. His Queen is in a rotten place, and there is no other way to attack my Knight. I call this a mistake.",
        "8... dxe4": "I don't really like my move either, but he doesn't catch it.",
        "9. Qf4 Be7": "We are so occupied with the Kingside that my LSB is now now just sitting there lonley, lost, forgotten, abandoned...",
        "10. Bxf6": "When calculating analysis, I was informed by a grandmaster that Bishop pairs are worth a lot (even more so in the middle game). I am shocked that my opponent didn't realize how useless he has been treating his Bishops.",
        "10... Bxf6": "I knew that White's Queen was in a pathetic place, so I take advantage of it. ",
        "11. Qxe4": "When White grabbed one pawn too many, the equal game turned into a Knightmare for White. I knew he would regret losing Bishops, because White only has Knights and Rooks to rely on.",
        "11... Bxe4": "Here comes my once forgotten Bishop who sacrifices herself for the Queen. This opens way for her sibling, the DSB, to carry out the next assault.",
        "12. Nf3": "Another severe blunder by White, who is now almost entirely destroyed. 12.dxe4 Bxe5 13.c3 should have been played.",
        "12... Bxb2": "After going down 11 points, White is forced to defend to the bitter end.",
        "13. dxe4": "Thanks for the help, LSB. My DSB is my only minor piece, but yet I have all of my major pieces (Rooks and the Queen). ",
        "13... Bxa1 14. O-O": "White is already doing his job. If I castle, White will have nothing left.",
        "14... Bd4": "I now tease White with my Bishop, which he could trade, but he chose not to.",
        "15. Nbd2": "I have no clue why White played this move.",
        "15... Bf6": "I again mock White, as he cannot do e5. 16.e5? Bxe5 17.Qxd2 and I win yet another pawn while White's position will be smothered faster.",
        "16. Nc4": "Still, I have no clue as to what White is doing. Maybe he's mocking me too.",
        "16... O-O": "I now take things seriously after that and castle to invade the 8th rank.",
        "17. g4": "Right now, I decide that my Queen needs the f6 square.",
        "17... Bg5": "The g5 square is just as effective.",
        "18. Nxg5": "I didn't expect him to take me, but I developed a plan for that in case.",
        "18... Qxg5 19. h3": "I now see what he is doing. He's preaparing a pawn storm.",
        "19... Qf4": "I decide to prevent f4.",
        "20. Na5": "Well, that plan failed. even if he did f3, 20.f3 Qg3+ 21.Kh1 Qxh3+ and I have the option to take his last major piece.",
        "20... Qxe4": "I take the pawn he left me.",
        "21. c3": "21...Qc2 wins another pawn.",
        "21... Rfe8": "Instead, I quickly decide to finish off his weak Kingside.",
        "22. a3": "I can tell that White has nothing to do, but I'll give something to do.",
        "22... c4 23. f3": "Pushing pawns. Hmm... now what?",
        "23... Qe3+": "I think his King needs to play a game of tag.",
        "24. Kh1": "He runs away.",
        "24... Qxc3": "I win another pawn.",
        "25. Nc6 Re3": "I think I'll chose to end the game.",
        "26. Kg2": "Qd2 wins permanently due to an inevitable mating pattern.",
        "26... Qd2+": "That's what I do. ",
        "27. Kg3": "Now, 27...Qd6+ overwhelms White's position excessively.",
        "27... Qd6+": "After this move, my opponent said that he was finished with this game by resigning. That being said, White played the Ruy Lopez as if he had little experience with it. It is one of the very few openings that require a lot of study time before you perform it. Also, look everywhere. Sometimes, I sit there looking at and studying a position for more than ten minutes to examine what I would need to do. If you're behind in points, start defending; if you're ahead in points, you can do more attacking. No matter where you stand in your games, you need to act as if no one is winning so that you don't hurry and mess up on your tactics."
    },
    "url": "https://gameknot.com/annotation.pl/forgotten-histories-the-forgotten-bishop?gm=42955",
    "gameName": "Forgotten Histories: The Forgotten Bishop",
    "players": "daves (1181) vs. chesskingdom64 (1051)",
    "opening": "Ruy Lopez (C65), Berlin defence"
}