{
    "moves": {
        "1. d4 Nf6 2. c4 g6 3. Nc3 Bg7 4. e4 d6 5. f4 O-O 6. Nf3": "Staying with the tried and true.  In any case this development is so 'natural' it must be good, eh?",
        "6... b5": "(!?) A bizarre move, it seemed to me. Apparemtly this was some Master's experimental line that Freddy wanted to try out.  It doesn't exactly give White's centre a hard knock, or anything...",
        "7. e5": "It seemed to me that a immediate capture on b5 fell in too easily with Black's plan - whatever it might be.  This thrust can't be bad, and now is a good opportunity to try it.",
        "7... Nfd7": "Exchanging first would have left Black with no centre at all, so he keeps some sort of stake in it by leaving the d-pawn as is.",
        "8. cxb5": "Free pawn.  It is hard to see what Black has got for his investment.",
        "8... a6 9. Be3": "Again, refusing to fall in too readily with Black's programme.  If Black captures on b5, then Bxb5 develops a piece nice and handily.  Meanwhile, White continues to develop.",
        "9... Nb6": "Alternatives here were indeed to take on b5 or try ...Bb7.",
        "10. bxa6": "OK, if you insist... White has a huge lead in development, and a strong central presence.  Yet Black does have some long-term prospects based upon the long dark diagonal - White's centre is far from invulnerable placed as it is - and the open files on the distant Queen's flank.  There are some resemblances here to the Benko and Blumenfeld Counter-gambits that White has to bear in mind.  White should also beware  - or be aware - of the long white diagonal (a8-h1), as well.  Finally, there is that tension between e5 and d6 which neither is willing for the time being to resolve.  Having said all that, 10.Be2 might have been simpler...",
        "10... Nxa6": "Had Black taken with the Bishop, I probably would have exchanged on a6.  I suspect, though, that Black had other plans for that piece, based on ...Bb7.  However, they were never to materialise.",
        "11. a3": "Partly with a view to a general infantry advance on this flank, but for moment mainly to constrain the N on a6.  Alternatively, Be2 or Bb5 were worth considering.",
        "11... c6": "Closing off the long white diagonal.  This allows a knight to land at d5...",
        "12. Be2 Nc7": "Definitely aiming to settle a knight on d5, whence it would not be easy to shift.",
        "13. O-O Qd7": "If instead 13...Bf5 I had in mind to play 14.Nh4, followed by 15.f5 with attack on the K-side.  One of the features of this game is that I found myself continually switching my attention from Q-side to K-side and back again.  I will return to this theme later...",
        "14. a4": "Looking to make capital of this passed pawn...",
        "14... Nbd5 15. Bd2": "Reluctant to exchange my c3-Knight for Black's c7-Specimen, I retire the bishop at once, keeping an eye upon the f-pawn.  I could probably have moved it back an extra square at that.",
        "15... Ba6 16. Bxa6": "Since the bishops would probably come off anyway, I exchange at once.  But I have to admit that I was starting to run out of ideas hereabouts - or at least, had the uneasy feeling of being unsure how to proceed.",
        "16... Rxa6 17. Nxd5": "(!?) A change of mind, hoping to do something with the Q-side pawns.  But I admit I didn't like this move, and still don't.  Maybe it ought to have waited a move, after 17.Qe2, say.  At any rate, I was still certain I had the edge - the extra pawn, and Black still didn't have much to show for it.",
        "17... Nxd5": "But Black now has this knight firmly established at a strong post in the centre. ",
        "18. b4 Rfa8 19. a5 Rb8": "Having induced the a-pawn forward, Black is in a position to blockade White's Q-side pair.  Generally speaking, rooks aren't ideal blockading pieces - a task that tends to write down their value more than somewhat.  But Black lacks alternative resources to keep the pawns under restraint.  He certainly doesn't want to divert his best piece, the knight, for the purpose.  On the other hand, White looks to have slender means of exploiting the tying down of Black's rooks.  In what follows, White is merely probing, looking for a weakness.  It would be long before he found one...",
        "20. Qb3 Rb5": "Completing the blockade.  I was rather pessimistically feeling Black had just about equalised here.  ",
        "21. Rfc1": "Rather optimistically hoping to find a way of bludgeoning a way throgh this c-file...",
        "21... Bh6": "Striking at the f-pawn, and just about forcing White's reply.  Possibly Black hoped to achieve something of interest on the weakened light squares around White's King, maybe it was merely to render White's K-side pawns a little less mobile.",
        "22. g3 Qb7": "So there's nothing doing on the K-side.  After 22...Qf5 23.Kg2 with 24.h3 to come, or 22...Qh3 23.Kh1 also in preparation for a pawn advance once the Queen had been driven off.",
        "23. Qc4": "The backward b-pawn had now 3 Black pieces attacking it, and just the two defenders.  This Q-manoeuvre would have been better played a move earlier, as Black could now, it seems, have got away with snatching the b-pawn: 23...Nxb4! 24.Rab1 Nd5 25.Rxb5 Qxb5  26.Qxb5 cxb5  27.Rc8+ Kg7  28.Rb8 and White can't quite recover the pawn.  Instead of this move 23.Rcb1 might have been tried, but I didn't have much confidence in it: 23...c5!",
        "23... Bf8": "A surprising decision, possibly intended to bolster the centre, or maybe looking towards eliminating the b-pawn in circumstances more favorable to Black.  But with the release of the pin at f4, I started to get interested in the likely consequences of the pawn's advance to f5...  After 23...Nxb4 White would  probably have been ready to settle for a draw.",
        "24. f5": "(!)  Entertaining notions of attack on the other wing.  As earlier foreshadowed, for much of the remainder of the game - until the ending was reached - I kept looking for attack on one wing, being stymied, and switching my attention to the other.  It is possible that Black felt like a tennis player being given the runaround, but a lot of it was pretty 'ad hoc' on my part, probing for a weakness.",
        "24... gxf5 25. exd6": "Played to isolate the f-pawn.  Less attractive was 25.Qd3 e6.",
        "25... exd6 26. Rce1": "Also playable here was 26.Qd3, a move that certainly formed part of my plan.  But I was entertaining hopes of penetrating to the 8th rank, here.",
        "26... Ra8 27. Qd3": "Kissing goodbye to the b-pawn.  To compensate myself with the f-pawn, I had to give up Bishop for Knight, but you know what thay say about omelettes.  Black's Kingside looked just a little vulnerable to attack right about now.",
        "27... Nxb4": "Alternatively Black could have retained hold over the f5-Pawn by 27...Qd7",
        "28. Bxb4 Rxb4 29. Qxf5": "Threatening 29.Ng5 or 29.Qg5ch.",
        "29... h6": "If instead 29...Rb5 then 30.Qg4ch Kh8  31.a6! Rxa6  32.Rxa6 Qxa6  33.Re8 with a strong attack.",
        "30. Re4": "Hoping to switch to the g-file.  At this point I felt that White's advantage had largely gone, and so was trying to mix things up a bit.  White seems to have the initiative, for the moment.",
        "30... Bg7 31. Rae1": "That poor little a-pawn looks all lonely away over on the abandoned Q-side.  The purpose of this move was more to cover the White King from checks from a rook landing at b1, but the doubling of rooks had its uses, too.  ",
        "31... Rb1": "(!) Putting a crimp in White's attack.  Off come a pair of rooks.  But White uses the moment to switch back to Q-side.  For the moment there's nothing doing on the King's flank.",
        "32. Re4e8+": "(!) ",
        "32... Rxe8 33. Rxb1 Qa8": "(!?) Why here?  With 33...Qa7, Black would have prevented White's next, whilst still attacking a5.  But then would have come 34.Rb6 d5  35.Rxc6 Qxa5  36.Kg2!? Rd8  37.Qg4 Qa2+ (say) 38.Kh3 Kf8  39.Nh4! Qd2  40.Nf5 Qg5  41.Qxg5 hxg5  42.Kg4 with a pretty good game for White.",
        "34. Qd7": "Indirectly defending the a-pawn and attacking Black's hanging pawn couple.",
        "34... c5": "(!?) There seems to be no real objection to 34...Rd8 ((35.Qc7 Rc8) instead.  Maybe Black was looking to complicate, seeking out winning chances of his own.",
        "35. Rb7 Rf8 36. Qb5": "White looks for all the world to have been entirely committed to the Q-side all along.  With the advanced outside passed pawn and the rook on the seventh, White looks very well placed, but Black's pawn couple has something to say to the matter, and although very defensively placed, Black isn't leaving many weaknesses to exploit.",
        "36... Bxd4+": "Alternatively: 36...c4, or 36...cxd4.  With this raid, Black is now a pawn ahead, and his pawn couple becomes passed.  As the 'pure' major piece ending looked unpromising, White keeps the minor pieces on - a hard decision, especially when you consider the relative locations of White King and Black queen!",
        "37. Kg2": "(!) ",
        "37... Bf6": "(!?) Right back to g7 looked more circumspect.",
        "38. a6 Kg7": "This latest manoeuvre by Black left me in the dark.  What was he about?  Maybe he merely wanted to keep the White knight out of h4, and the King move simply protected the Bishop.",
        "39. a7 c4": "An attempted decoy, or a run for home?  A bit of both, of course.",
        "40. Rc7 d5": "The alternative 40...c3 seemed to lead to a promising attack for White: 41.Qf5! (another switch to the opposite flank) 41...Qd8  42.Rc4  Qe7  43.Rg4+ Kh8  44.Re4 Be5  45.Rh4 Bg7  46.Ng5!  E.g. if 46...Qb7+  47.Kh3 Qc8  48.Nxf7+ Kg8  49.Qxc8 Rxc8  50.Nxd6 Ra8  (50...c2?? 51.Nxc8 c1=Q  52.a8=Q and Black has no useful checks)  51.Nb5 with a very favourable endgame.",
        "41. Qd7": "Around about here Black suggested a draw, an offer I very nearly accepted.  I thought I had a bit of an edge, but enough to convert to a win?  I took several days, not even looking at the position, thinking about it.  But then I recalled Freddy's policy of playing it down to the last resource, and a small thought occurred to me.  If Freddy is offering a draw, then, in Freddy's opinion, Black's game ain't looking so good.   ",
        "41... Kg8": "If instead 41...Qd8, then 42.Qg4+ Kh8  43.Qf4  ...\r\n[a] 43...Kg7  44.Rb7 Qa5  45.Nd4 Re8  46.Qg4+ \r\n[b] 43...Bg7  44.Rxf7!\r\n[c] 43...Bg5  44.Qe5+ Bf6  45.a8=Q Bxe5   46.Qxd8 Rxd8  47.Nxe5.",
        "42. Qg4+ Kh7": "If 42...Kh8  43.Qh5 Bg7?  44.Ng5! d4+  45.Kh3 Kg8  46.Ne6! brings Black's whole game under close assault.  Black does better after 43...Kg7 in this line but White has fine chances after 44.Ne5 Bxe5  45.Qxe5+ Kg8  46.Qf6",
        "43. Qf5+ Kg7 44. h4": "I really started to think I had a decisive K-side attack coming up, but Freddy shoves a spanner in the works...",
        "44... Qd8": "Well, that's the end of attack on the K-side, so far as I could see.   I had been planning 45.g4; Black's move prevented that.  Now it was, once again, Ho! for the Queenside.",
        "45. Rd7 Qe8 46. Qxd5": "I seriously considered 46.Qg4+ Kh8  47.Nd4 here, but the simple capture on d5 looked after all more promising.  At last, I felt that White was making real progess.",
        "46... c3": "(?)  A big surprise!    Was this desperation, or an oversight?  After this, I knew White had a winning game (see my note to Move 55).",
        "47. a8=Q": "(!) At the end of a glorious career, the hero dies for the sake of his comrades, in the moment of his crowning achievement!  Brings tears to your eyes, don't it?",
        "47... Qxa8 48. Rxf7+": "(!) 'The point', as they say, and the decisive breakthough.  The rook is untouchable.",
        "48... Kh8": "Not 48...Kg8 49.Rxf8+ winning the Queen; and even worse would have been 48...Kg6 49.h5#!",
        "49. Qxa8 Rxa8 50. Rxf6": "Winning a piece?  Not quite, as it happens.  That c-pawn has something to say to the matter.",
        "50... Rc8": "(!) White has to pay a price to stop the c-pawn...",
        "51. Nd4": "(!) Taking the h-pawn would have been ... well, not disastrous, exactly, but White's winning prospects would have looked a lot skinnier:  51.Rxh6+?? Kg7  52.Re6 c2  53.Re1 c1=Q  54.Rxc1 and the N and 2P would have had a tough struggle to overcome the Rook.",
        "51... c2 52. Ne2": "Necessary, as taking on c2 woud have yielded Black a check, and a book draw in the rook ending.  In view of what was approaching, I wondered if Black would try 52...Re8 with the idea of presenting some technical problems while he still had a couple of pawns, one on the brink of promotion, to play with.",
        "52... c1=B": "Low cunning, and a wry sense of humour.  Of course White takes, regardless.  ",
        "53. Nxc1 Rxc1 54. Rxh6+ Kg7 55. Rd6": "Before continuing, it is the sort of sequence that began with White's 47th move that shows how far ahead a forcing line allows you to 'see'.  After receiving Black's 46th move, I had worked out the whole line to here within two or three minutes.  This ending is easily winning for White, simply because the King and Rook are so ideally placed for a rook ending of this type.  The Black King is confined, and can do nothing but wait for the action to come to him.  At least he's not cut off on the Q-side.  ",
        "55... Rc2+ 56. Kh3": "Getting cover from the checks.  I play this ending very conservatively - no flourishes.",
        "56... Rc5": "Whether or not this is best, I figured Black would play it.  White wants to play h4-h5, then bring the g-pawn up, followed by the King (depending on the activities of the enemy rook).  Unable to play the h-pawn, White is then tempted to play the g-pawn up.  But after 57.g4 Rc3+ White's King is also for the moment cut off.  Rather than examine too closely the technical problems associated with the pawn move, the King advances instead.",
        "57. Kg4": "(!) ",
        "57... Rc7": "(?) A surprise.  I was expecting something like this: 57...Rc4+  58.Kf5 (58.Kf3 is probably as good, if not better) ...Rc5+  59.Ke4 ... (preparing to cover the nect check with 60.Rd4 with 61.g4 to follow) 59...Rh5  60.Rd5 Rh6  61.h5.  ",
        "58. h5 Kg8 59. Kg5 Rg7+": "(?) Totally out of the blue.  I'm guessing that Freddy decided to play 'second best' moves either in the hope I'd play 'routinely' into a bad line, or looking for a stalemate.  But the pawn ending was even more hopeless than the rook ending.",
        "60. Rg6": "The pawn ending is the simplest way to go.",
        "60... Kh8 61. Rxg7 Kxg7 62. g4": "(!)  A casual glance at the GK notes on this game will reveal that this was inferior to 62.h6+.  Even if that were true, I'd still play this advance, adhering to the principle of keeping the pawns together.  Only in special circumstances should the one abandon his comrade for the glory of promotion.  But ... just check out the next couple of GK notes ... :)  Yes, 62.g4 is the best move.",
        "62... Kh7 63. Kf6 Kh6 64. g5+": "I did consider 64.Kf7, but this is simplest and straightforward.",
        "64... Kh7": "Of course, ...Kxh5 deprived Black with even the smallest hope of a Stalemate.",
        "65. g6+ Kg8": "White has a forced mate, but 65...Kh8 would have prolonged the game by one move.",
        "66. g7 Kh7 67. Kf7 Kh6 68. g8=Q Kxh5 69. Qg3 Kh6 70. Qh4#": "(#, 1-0)  Of course, 70.Qg6 was also mate, but I have a fondness for this constellation.  This was my first ever win against  id=easy19, after two draws and I've lost count how many losses.  It also brought me to within the half-point of the MT winner.  This win almost - almost - made up for the disappointing loss with the Black pieces..."
    },
    "url": "https://gameknot.com/annotation.pl/four-pawns-attack-club-mt-ch-4?gm=33305",
    "gameName": "Four Pawns Attack (Club MT) Ch 4",
    "players": "ionadowman (2136) vs. easy19 (2231)",
    "opening": "King's Indian (E76), Four pawns attack, dynamic line"
}