{
    "moves": {
        "1. c4 Nf6 2. Nc3 g6 3. d4 Bg7 4. e4 d6 5. f4 O-O 6. Be3": "(?!) Already a very strange move...",
        "6... c6": "(?) ... and a very insipid response.  Black just wasn't attending.",
        "7. Bd3": "(?) Another weird move that lands White in a bit of hot water...",
        "7... Ng4": "(!)  This ought to have been played a move earlier.  However, since White positively insisted (with his 7th move) that this be played it seemed churlish to turn him down... :)",
        "8. Qf3 Nxe3 9. Qxe3 Qb6": "(!) White suddenly finds his centre under fierce attack.  He has to drop a pawn...",
        "10. Nge2 e5": "(!) Piling on the pressure!  Black's Q-side can wait for the time being...",
        "11. Qd2 exd4": "Winning a pawn - a centre pawn at that.  Black has now a protected passed pawn in the centre, a long term asset.",
        "12. Na4 Qc7 13. b4 c5": "Consolidating the advanced pawn, and taking an equal stake in the centre.",
        "14. a3 Bd7": "Possibly preferable might have been 14...Nd7 with the view to ...Nf6 shortly.  But the move played ought to be OK.",
        "15. Nb2 Nc6 16. O-O Rae8": "Mobilising for a central break.  Yet that break proved difficult to achieve.  For the next few moves Black tries to consolidate before embarking on a positive plan.",
        "17. Ng3 a6": "Something of a temporising move.  Having yet to decide on a plan, Black puts some constraint upon White's Q-side pawns.",
        "18. Rae1 b6": "I really wanted to advance this pawn 2 squares, but then White would have mobilised his centre-king side pawns: 18...b5? 19.cxb5 axb5 20.Bxb5 Rb8  21.Bxc6 Bxc6  22.f5 - not to mention wiping out the pawn deficit.  Now I hoped for 19.b5 axb5  20.cxb5 Na5, locking up the Q-side.",
        "19. Bc2": "(!?) Changing the guard at d3?",
        "19... h5": "(!?) Already planning to run the pawn forward as far as it would go.  I really did think the lines opened up would be of more use to Black than to White, but that belief was to prove unfounded.  But all this was in fact a change of mind.  I spent a deal of time looking at the possibility of giving up my passed d-pawn for the change of breaking through in the centre: 19...d3!? 20.Bxd3!? cxb4 21.axb4 a5 22.b5 Nd4 with maybe a bit of a bind on the position.  E.g. 23.Na4 Nb3  24.Qf2 Nc5  25.Nxc5 dxc5; or, possibly less OK for Black: 20.Nxd3 cxb4  21.axb4  Be6  22.Bb3 Nd4  23.Ba2 Bxc4  24.Bxc4 Qxc4  25.e5 (...dxe5; fxe5).  On the whole Black seemed to get nothing tangible for the pawn sacrificed.",
        "20. Nd3 h4 21. Nh1 h3": "This looked really good at the time, but White seemed more than happy with his game.",
        "22. gxh3": "(!?)",
        "22... Bxh3 23. Rf3 Be6": "(?!) Eyeing c4, but ...",
        "24. f5": "White knew Black wouldn't take the c-pawn, taking the bishop away from the more important c8-h3 diagonal.",
        "24... Bd7": "Not that I was all that fussed about the pawn on c4.  The position still looked OK to me.  To be sure, Black's K-side is weak, and looks to be getting weaker.  But owing to the strong centre that Black was planning to consolidate soon, Black thought any attack on the flank could be contained.",
        "25. Nhf2": "(!) I did expect 25.f6, but White prefers to keep things in a state of flux.",
        "25... gxf5 26. exf5 f6": "Establishing contact between the g7-bishop and the rest of the 7th rank.",
        "27. Re4 Rxe4": "Also playable were 27...Nc5 and 27...Qc8, aiming toward the f-pawn.  The text looked fine, though...",
        "28. Nxe4 Ne5": "Black's OK with the exchange on e5, which will yield a second central passed pawn.  Maybe Black ought to have taken notice they were already securely blockaded.",
        "29. Nxe5 dxe5": "Surely White hasn't enough on the K-side?  ",
        "30. Qg2 Bc6": "Maybe it was already time for ...Rf7.  I would have liked the King to duck out by 30...Kf6, but that would not have done: 30...Kf7?? 31.Qg6+ Kg8 32.Rg3 Bc8 33.Nf6+! wins for White.  But still... no worries, eh?",
        "31. Qg4 Rf7 32. Rg3 Bb7": "Played in order to exchange on b4 and then pick up the c-pawn.  It also prevented 33.bxc5 bxc5 34.Nxc5.",
        "33. bxc5 bxc5 34. h4": "(!) Expecting 34.Qg6, I found this pawn move a bit of a surprise.  But now the penny began to drop.  White's K-side operations notwithstanding I had up until now thought Black was fine, and able to contain anything White might contrive down the g- and h-files.  This pawn was so far away, what could it achieve?  But the more I looked at the sequel - and my planned ...Kf8 was still the best I could find - I played the move with the conviction that somewhere, somehow, I had thrown away a decent-sized advantage, and my opponent now had control of the game.  But there was a further surprise in store.  When I ran this game through the GK engine, it called this pawn advance an inaccuracy, indicating that Black had the whisker of an edge!  This has to be 'horizon effect'.  My misjudgement was in assessing Black's defensive resources.",
        "34... Kf8 35. h5": "Hurtling down the board almost as fast as his opposite did earlier in the game - but with deadlier purpose.",
        "35... Qa5": "Hoping for counter-action behind enemy lines (...Qd1ch, specifically).  I didn't really like 35...Ke8, but maybe Black's best chance lay in that direction: 35...Ke8  36.Qg6 (36.Nd6+ Ke7 37.Nxf7 Qe1+ 38.Kh2 Qh1# or 37.Nxb7 Qe1+ 38.Kh2 Bh6 with interesting attacking chances for Black) 36...Bxe4 37.Bxe4 Qa5  38.Bd5 Qe1+ and hope for a draw.",
        "36. Kf1": "(!) 'You can not pass!'  A fine prophylactic move that puts one in mind of GM Tigran Petrosian - or Gandalf facing the Balrog in Moria.  The Black Queen is denied entry into White's position.",
        "36... Bxe4 37. Qxe4 Rd7": "Partly to keep the White Queen out of d5, but also hoping to make some use of the d-pawn.",
        "38. Qg2": "Neatly changing the order of march along the g-file.",
        "38... d3": "Instead, 38.Qb6 Be4 still left Black without an invasion route.",
        "39. Bd1": "(!) This is very subtle stuff.  After 39.Bxd3 Qc3 Black might yet have been able to contrive something of interest.  ",
        "39... Qb6": "Now comes a decisive forcing line from White that I ought to have investigated more fully well before this.  But maybe it was not to be avoided at that.",
        "40. h6": "(!)",
        "40... Bxh6 41. Rg8+ Ke7 42. Qg6 Bf8": "Just about forced.  Much less inviting was 42...Rd8.",
        "43. Bh5 Qb1+": "Black has to find counterplay.  Passive defence offers no hope.",
        "44. Kf2 Qb7": "(??) A complete disaster.  I had intended to play 44...Qb8, and thought I had played it, hitting the submit button before I noticed the slip of the mouse.  The idea was 44...Qb8  45.Qf7+ Kd6  46.Qe6+ Kc7 and if 47.Rxf8 Qb2+ and pray for a miracle.  ",
        "45. Qf7+ Kd6 46. Qxf8+": "(1-0) After 46...Kc7 (47...Kc6 48.Bf3+ etc) 47.Qxc5+ Qc6 48.Rc8+ wins; or 46...Re7 47.Qxf6+ Kd7 48.Be8+ Kd8 49.Bc6+ etc.  To have continued would have been tedious and vexatious...  So disappointed was I at this result (though not specifically at that aberrant 47th move), that I just didn't want to look at this game for a long time afterward.  I'm still not sure what to make of it..."
    },
    "url": "https://gameknot.com/annotation.pl/four-pawns-attack-club-mt-ch-3?gm=33290",
    "gameName": "Four Pawns Attack (Club MT) Ch 3",
    "players": "easy19 (2273) vs. ionadowman (2105)",
    "opening": "English opening (A16)"
}