{
    "moves": {
        "1. h4": "Hi everyone!\r\n\r\nAnother futile duel with Freddy.  This time he kicks off with yet another unusual opening - 1. h4.  At one stage I end up being 2 pawns up, but with my kingside pawn structure it was only a matter of time before Freddy harvested the pawns like ripe apples.  Material was even for most of the game and even when I went behind I tried to make something out of the position.  Alas, the queenside became a death trap for poor ole King Henry.  Freddy crowned a pawn and on the next move delivered the coup de grace with a knight.",
        "1... e5 2. e4 Nf6": "2. ...... Nf6 - normal development by black.",
        "3. h5 Nxe4 4. Qe2 d5 5. d3 Nf6 6. d4 e4": "6....... e4 - a pawn up, everything in the garden seems rosy for black doesn't it?",
        "7. h6": "7. h6 - Freddy sacs another pawn to break up my kingside.",
        "7... gxh6 8. Bf4 Nc6": "8....... Nc6 - development.",
        "9. Qd2 Bf5 10. Nc3 a6 11. O-O-O Qd7 12. Be5": "12. Be5 - Freddy now generates some nasty threats, I respond with Bg7 to clear my ranks.  I keep a lead in development and material!  Even allowing for playing against such a strong Expert, how could black throw it away - well if black is jstevens1 - anything is possible.",
        "12... Bg7 13. Qf4 O-O-O": "13. ............ 0-0-0 - you would think the pawn on c7 would not be taken here wouldn't you?  Think again .......",
        "14. Bxc7 Qxc7 15. Qxf5+ Qd7 16. Qxd7+ Rxd7": "16. ......... Rxd7 - after this plethora of exchanges Freddy has regained a pawn.  I start to get aggressive next move with 17........ Ng4 - I think this will backfire on me big time.  But it still beggars belief - how could I end up getting Freddied from a position like this?",
        "17. Nh3 Ng4 18. Ne2 Re8": "18. .......... Re8 - centralisation.",
        "19. c3 f5 20. Ng3 Rf7 21. Be2 h5": "21. ...... h5 - provides additional support to the knight but I get floored by Freddy's next move.",
        "22. Ng5 Bh6 23. Rxh5 Bxg5+ 24. Rxg5 Kc7": "24. ....... Kc7 - Freddy gets material equality and a positional edge.",
        "25. Rxf5 Rxf5 26. Nxf5 Nxf2 27. Rf1 Nd3+": "27. ........ Nd3+ - the only move to avoid immediate loss of material.",
        "28. Kc2 Rg8 29. Ne3 Ne7": "29. ......... Ne7 - supports backward d pawn.",
        "30. g4 Rg7 31. Bxd3 exd3+ 32. Kxd3": "32. Kxd3 - and Freddy finally gets materially ahead.",
        "32... b6 33. Rf6 a5 34. a4 Kb7": "34. ....... Kb7 - the only move to avoid going further behind in material.",
        "35. b3 Kc7 36. Rh6 Kb7 37. c4 dxc4+ 38. bxc4": "38. bxc4 - after a forced exchange of pawns Freddy has a d4 passer.",
        "38... Ng8 39. Re6 Rg5": "39. ....... Rg5 - planning a  h pawn for g pawn swap on h5.",
        "40. Nd5 Rxg4 41. Rxb6+ Ka7": "41. ....... Ka7 - The good news - Freddy's g pawn has been removed, my h pawn is now a passer.  The bad news, it is only on h2 and Freddy has 2 queenside passers.  The c pawn will help bring doom to Henry.",
        "42. c5 h5 43. Rd6 h4": "43. ....... h4 - just 3 moves from Glendadom but this is as far as this pawn is gonna go.",
        "44. Rd7+": "44. Rd7+ - now comes a series of checks - Henry will now be confined to the queenside.",
        "44... Ka6 45. Nc7+ Kb7 46. Nb5+ Kb8 47. c6": "47. c6 - a quiet move but a deadly one as you will see.  I play Kc8 to try and stop the passer but I might as well have pushed up my h pawn.  I could have resigned here on the grounds of ruinous loss of material but as I knew the end would come the move after the promotion I decided to play it out to mate.",
        "47... Kc8 48. Nd6+": "48. Nd6+ - the killer - #4.",
        "48... Kb8 49. c7+": "48. c7+ - #3",
        "49... Ka7 50. c8=Q+": "50. c8=Q+ - behold the Wicked Witch of the West appears - #2.",
        "50... Kb6 51. Nc4#": "51. Nc4# - so for Henry the queenside was a coffin that Freddy carried him off in!  A cool knight checkmate - well played Freddy!"
    },
    "url": "https://gameknot.com/annotation.pl/freddied-in-the-endgame?gm=22570",
    "gameName": "\"Freddied\" in the Endgame",
    "players": "easy19 (2187) vs. jstevens1 (1776)",
    "opening": "Anti-Borg (Desprez) opening (A00)"
}