{
    "moves": {
        "1. d4": "Hi everyone!\n\nThis game was played between my master buddy, Freddy the Master Mater and a Class C player called Concordborn (Matthew).  This game certainly belongs under the It Can Be Done thread.  OK, it was a draw and not a win, although in the middlegame Matthew had great winning chances being a piece ahead, but alas allowed Freddy back into the game by getting his knight trapped.  Matthew did get a pawn for the knight and ended up in a same coloured bishop ending where he remained a pawn up right until the end.  However, because Freddy had put his king right up into his opponent's arc, Matthew had to be content with a Master Draw - at least it took him only 3 attempts to get there as opposed to my 50!  Anyhow, gameknot analysis is right here:- http://gameknot.com/analyze-board.pl?bd=14233842&rnd=0.8639711164224122",
        "1... d5 2. e3 Nf6 3. Bd3 e6 4. Nd2 Be7": "4. .... Be7 - very conservative development on both sides following a double Queen Pawn Opening.",
        "5. f4 c5 6. c3 O-O": "6. ..... 0-0 - Matthew tucks his king away on the kingside, but is any king safe when your opponent is Freddy?!",
        "7. Ngf3 c4": "7. ..... c4 - Matthew tries to cramp Freddy for style.",
        "8. Bc2 Nc6 9. Qe2 b5 10. e4 g6 11. Ne5 Nxe5 12. fxe5 Ne8": "12. ...... Ne8 - Matthew had to retreat his knight here.  An interesting battle with the footmen going on in the centre - a real stonewall.",
        "13. O-O Ng7": "13. ..... Ng7 - Matthew's king looks a little draughty - give him some cover - do!  Matthew does but with a knight rather than a bishop.  A bishop is better for this kind of thing methinks.",
        "14. Nf3 f5 15. exf6 e.p. Bxf6 16. Bh6": "16. Bh6 - would e5 have been a good move, I wonder?",
        "16... Rf7 17. g4 Bb7 18. Bg5": "18. Bg5?? - this move will cost Freddy a whole piece - however, will the 800 point rating differential save Freddy?  Only time will tell.",
        "18... Bxg5 19. e5": "19. e5 - Freddy certainly ain't gonna topple his king here, he is trying to counter-attack by going for the throat.",
        "19... Qe7 20. Nxg5 Rxf1+ 21. Rxf1 Qxg5": "21. ...... Qxg5 - Matthew forces an exchange of rooks before taking off Freddy's knight.  Now if Matthew can maintain his material advantage into the endgame it will be decisive.",
        "22. Qf3 Qe7 23. Qf6 Qxf6 24. exf6": "24. exf6 - Matthew naturally exchanges queens to do try and simplify into that won ending.  Alas, the knight on g7 is trapped and if Ne8 then f7+ wins it next turn.",
        "24... Rf8 25. fxg7 Rxf1+ 26. Kxf1 Kxg7": "26. ..... Kxg7 - Matthew has simplified into an endgame a pawn up.  That should really be enough to win, although Matthew's extra pawn on e6 is backward so it may make things rather difficult there.",
        "27. h4 h6 28. g5 Bc8": "28. .... Bc8 - hmm, rather passive but it is difficult to find the right plan here.",
        "29. Kf2 hxg5 30. hxg5": "30. hxg5 - pawn trade.",
        "30... Bd7 31. Ke3 Be8 32. Kf4": "32. Kf4 - Freddy's king advances up the board and is threatening to infiltrate via e5/d6.",
        "32... Kf7 33. Ke5 Ke7": "33. .... Ke7 - but Matthew's king prevents this.",
        "34. a3 a6 35. Bd1 Bc6": "35. .... Bc6 and DRAW OFFER - Freddy accepts the draw offer as there is no way through the gate - Freddy has been stonewalled and must now concede a Low Draw, although for him it could have been far, far worse.  Anyhow, hope you all have a good read and you Walk the Walkers take heart from this - it is possible to achieve something other than a big fat zero against The Master Mater!"
    },
    "url": "https://gameknot.com/annotation.pl/freddy-is-stonewalled?gm=40260",
    "gameName": "Freddy is Stonewalled!",
    "players": "easy19 (2229) vs. concordborn (1570)",
    "opening": "Queen's pawn (D00), stonewall attack"
}