{
    "moves": {
        "1. e4 c5": "My favorite opening; the Sicilian Defence. I am rather disappointed that the next move does not comply with any variation of this opening.",
        "2. Bc4": "I am not sure what I was thinking with this move. Maybe I was trying to prevent 2...c4, which Black would never do. This is a critical mistake in an opening in my opinion.",
        "2... Nc6": "Black was expecting 3.d4, a very sorrowful mistake. Better safe than sorry because as White, I would never think of playing that move.",
        "3. Nc3": "Black observed this move for a while, and he probably realized that I put a third attacker for d5. Black, apparently, had a mind of his own.",
        "3... e5": "This game is really out of control. Both me and my opponent were trying to take over the middle d squares.",
        "4. Nf3 Nf6": "Black looks like he is lagging in the opening a bit.",
        "5. Bd5": "I am not sure whether I, if I wanted a piece on d5, should have done 5.Nd5, or this move. Maybe I should have forgotten about the d5 square and instead play 5.d3.",
        "5... Nd4": "Breakthrough for Black, but not accurate enough.",
        "6. Nxe5": "Black left his pawn in boiling soup, and the burner was not turned off! I shocked Black with this move.",
        "6... Bd6": "Blind Black decides to ignore my Bishop and attack my knight. Big mistake.",
        "7. Nxf7": "Black looked at this sensational move that I performed. It won his rook AND won the game.",
        "7... Qe7 8. Nxh8": "UCM (unidentied crushing move) coming after this.",
        "8... Qe5": "Black is not yet close to pulverizing my highly guarded center.",
        "9. g3": "Even though I missed 9.Nd7, I looked at the opportunity to weaken Black.",
        "9... Nf3+": "That's basically why I played 9.g3!?.",
        "10. Qxf3": "Now my Queen leaps into action, and I don't have much time to waste.",
        "10... g6": "What was the purpose of this move.",
        "11. Nf7": "Here it is finally, my UCM!",
        "11... Qd4": "You can't bomb a central attack unless you really want to see what will happen to your position.",
        "12. Nxd6+ Kd8": "12...Ke7 was better play for Black.",
        "13. Nf7+ Ke7": "Now, I change my mind about 12...Ke7 and even playing it right now!",
        "14. e5": "! Forces the Black knight to trigger the trap; by taking my Bishop!",
        "14... Nxd5 15. Nxd5+ Ke8": "Now, it's White to move and forced mate in two.",
        "16. Nd6+ Kd8 17. Qf8#": "Good game, Black. Black played several mistakes that add up to five words: holding on to useless gains. Black tries too hard to hang on to his pieces, resulting in a collapsing position. "
    },
    "url": "https://gameknot.com/annotation.pl/frenzy-1?gm=39331",
    "gameName": "Frenzy #1",
    "players": "chesskingdom64 (1049) vs. harzer (837)",
    "opening": "Sicilian defence (B20)"
}