{
    "moves": {
        "1. e4 e6 2. d4 d5 3. Nc3": "At this moment, Black could choose to take on e4 thus entering the Rubinstein variation, but with a somewhat passive game. But if White is not cautious, Black could awaken his pawn majority (e and f) on the king side as Alexander Alekhine showed. This will be the case in this game as Black is going to transpose in this variation later.",
        "3... Nf6 4. Bg5": "Now we have 4...Be7 entering the main line of the classical variation (I believe White is better here), 4...Bb4 with the crazy Mac Cutcheon Variation. ",
        "4... dxe4": "(!) but this is the right move, by not spoiling too much his winning chances, Black is transposing into the Rubinstein variation, with the Bg5 not naturally posted here : in fact this is not the best arrangement of pieces that white could dream of here.",
        "5. Nxe4 Be7 6. Bxf6 Bxf6": "Here Black had the opportunity of taking on f6 with his g Pawn opening the g file for his Rooks and castling queen side.",
        "7. Nxf6+": "This is less common : generally White develops simply here by 7.Nf3",
        "7... Qxf6 8. Bd3 O-O 9. c3": "Same here, 9.Nf3 then castle is to be preferred.",
        "9... Nc6": "Tigran Petrosian's move vs Mecking in 1972, repeating the happy experience of another famous player Xavier Tartakower vs Sir Thomas in 1945. Both games were won by Black. For the moment, White has to deal with the opening of the center by e6-e5.",
        "10. Qf3": "This move is new. The best move for Black should be 10...e5 and even after the exchange of Queens on f6, the ending is quite good for Black due to his advance in development.",
        "10... Qh6": "But I did not want to exchange Queens.",
        "11. Ne2": "Happily my opponent missed the strong 11.Qg3 and it is not easy for Black to push the e-pawn without half sacrificing it and falling into complicated and double-edged play.",
        "11... e5": "Completely correct move.",
        "12. d5": "It would have been better for White to castle even with the very small disadvantage here of an isolated pawn. 12.O-O exd4 13.cxd4.",
        "12... Ne7 13. c4 f5": "Now Black has a pawn duo attacking with his pieces behind, and the White King cannot castle queen side due to the Black Queen on h6. Black is better now.",
        "14. Qe3 Qf6 15. Rb1": "Not a nice move, as the Rook on b1 will permit a little combination which will help Black greatly. The cool 15.Nc3 followed by castling was better.",
        "15... f4": "the right pawn to push, as White will not be allowed to occupy the e4 square.",
        "16. Qf3": "Forced, 16.Qe4 Bf5, and 16.Qd2 f3 ! and the attack begins.",
        "16... Nf5": "Trying to hit the Queen on f3 and the Pawn on g2 by a Nh4 fork",
        "17. g3 Nd6": "threatening combinations on the e5-e4 push basis.",
        "18. O-O": "18.gxf5 was met by 18...e4 19.Bxe4 Nxe4 20.Qxe4 Bf5 winning the Rb1.",
        "18... Qh6": "With the idea of fxg3 with a discovered check on the Queen.",
        "19. c5": "Missing the second e5-e4 threat.",
        "19... e4 20. Bxe4 fxg3": "Now white is forced to chose between mate or loosing the Bishop.",
        "21. Qe3": "Mate is chosen, but after 21.Bxh7  Kxh7 22.Qxg3 Ne4 23.Qxc7 then Bh3 followed by Nd2 is the end for White.",
        "21... Qxh2#": "Mate..."
    },
    "url": "https://gameknot.com/annotation.pl/french-burn-var-petrosians-legacy?gm=14498",
    "gameName": "French Burn var. Petrosian's Legacy",
    "players": "nueces (1724) vs. ifuinsist (1691)",
    "opening": "French (C11), Burn variation"
}