{
    "moves": {
        "1. e4 e6 2. d4 d5": "The French; my favorite! ",
        "3. Nc3 c5": "I overlook his Queen and lose a pawn in trades.",
        "4. exd5 exd5 5. dxc5": "I forgot that he could make this move before retaking with Knight, so I come out of it a pawn down. ",
        "5... Bxc5 6. Qxd5": "At this point, I thought I would simplify and then develop a little faster than my opponent could. ",
        "6... Qxd5 7. Nxd5": "White has a beautifully placed Knight, but without support, Black will endeavor to chase it back. ",
        "7... Kd7": "This seemed to be the only way to stop the fork without trading material. Besides, without the Queens on the board and my opponent's Rooks nestled in their beds, I figured that not castling would be okay. The only negative to this move that I could find is that it blocks in my LSB.",
        "8. b3": "Prepares for fianchetto, but overlooks Bd4.",
        "8... Bd4 9. c3 Be5": "Keeps control of the long diagonal, pins the pawn, and ties down the Knight to protection duty. ",
        "10. Bb5+ Nc6": "I try to trade trade my passive Knight for White's active Bishop. Then I can retake with pawn, and if White moves the Knight, I win the c-pawn, thus restoring balance and gaining a tempo a major piece with the King-Rook fork. ",
        "11. Nf3": "Pressuring the unprotected Bishop.",
        "11... f6": "Blocks the forward square from my Knight, but does the job. ",
        "12. O-O a6": "Forcing some action.",
        "13. Bxc6+ Kxc6": "I don't want to separate my a- and b-pawns, and now that White's Rook is activated, my King did not feel safe on the open file. ",
        "14. Nxe5+": "Forcing my hand, but I still don't like the idea of separating my pawns, so I put the King back on that stupid file. ",
        "14... Kxd5 15. Nf3 Kc6": "Now that we are back where we started, minus a few pieces, it's time to attack. ",
        "16. Bb2": "Finally able to activate the Bishop, which will become a thorn in my side. ",
        "16... Ne7 17. Rfe1 Nf5": "Advancing the Knight. But he has nowhere to go but back, if White pressures. ",
        "18. Nd4+ Nxd4 19. cxd4": "Now I will target the isolated d-pawn!",
        "19... Bf5": "After I connect my Rooks, of course!",
        "20. h3 h5": "Taking White's focus off of the center, I prepare for a pawn swarm. ",
        "21. Rad1 Rad8": "Daring the pawn to advance. ",
        "22. Re7": "This looks scary, but it helps me achieve my own ends, actually. ",
        "22... g5 23. d5+ Rxd5": "White could win a pawn after retaking with the Rook, but he doesn't ",
        "24. Bxf6": "He simply makes an oversight. Something we all do. He overlooked that by taking the Rook, I would put him in check, and thus allow my Rook to escape. ",
        "24... Rxd1+ 25. Kh2 Rg8": "Protecting my pawn, and getting off of the Black squares. ",
        "26. Re5": "Attacking the Bishop.",
        "26... Rd5": "I x-ray the Bishop. ",
        "27. Re2 g4": "I intend to open the h-file, and line up my Rook. ",
        "28. hxg4 hxg4": "Now this pawn will plug up the King's escape route later on. ",
        "29. g3 Rg6": "Now I can move my Rook to h6, but White's DSB can block.",
        "30. Bc3": "Until he does that. I assume it was to protect the Rook after a back-rank check when I force the King to the first rank. ",
        "30... Rh6+ 31. Kg1 Rd1+ 32. Re1": "I think that placing the Bishop there would have been more beneficial, to leave the Rook free to defend the e-file. ",
        "32... Be4": "But the King can still escape to e2...",
        "33. Kf1": "Yup. I don't normally like to make a non-checking move when I'm attacking, but nothing here worked, because the King could escape to e2. So I came up with the next move. Can you see it? It's not very hard, but it seals the deal.",
        "33... Bf3": "Bf3 locks in the King. I can't find a reply for it for White. Even exchanging Rooks will not avail. Rh1# is unstoppable, I believe. If you see a way out, leave a comment. :)\nThank you so much for reading! Please rate and comment, and I'll post another as soon as I can!\nUntil next time, theancientbeast."
    },
    "url": "https://gameknot.com/annotation.pl/french-defense-leading-to-open-center?gm=53125",
    "gameName": "French Defense Leading to Open Center",
    "players": "khursh (1398) vs. theancientbeast (1429)",
    "opening": "French (C10), Marshall variation"
}