{
    "moves": {
        "1. e4": "White opens with the King pawn",
        "1... e6": "Black plays the French defense.",
        "2. d3": "White pushes the d-pawn one square instead of the more normal two squares to d4.\nThis move has the disadvantage of blocking the light-square bishop.\nIn my opinion, nothing is gained by not playing the more normal d4 move.",
        "2... d5": "Black pushes the d-pawn to the centre. Black threatens ...dxe4",
        "3. Nd2": "White develops the knight",
        "3... Nf6": "Black develops the kingside knight",
        "4. c3": "White plays c3, which allows the Queen to develop along the diagonal.\nHowever, I think e5 would have been a stronger move.",
        "4... dxe4": "Black exchanges a pawn.",
        "5. d4": "Instead of recapturing, Which pushes his d-pawn, creating a powerful pawn chain.\nHowever, this move is a mistake. The pawn on e4 is fairly weak, but will take time to re-capture. I think it simply best to for White to have played dxe4",
        "5... c5": "This is White's problem; Black has time to strike out at the powerful chain of pawns with a flank pawn.",
        "6. Ne2": "White develops the kings knight.",
        "6... Nc6": "Black develops the Queen's knight",
        "7. g3": "White prepares to fianchetto the Bishop",
        "7... cxd4": "Black exchanges the flank c-pawn for a central pawn.",
        "8. cxd4": "White recaptures, and a isolated pawn has appeared.\nBlack has the advantage, due to the extra pawn.",
        "8... Bb4": "Black develops the bishop, and pins the knight. Also, the simple ...Nxd4 looks promising for Black.",
        "9. a3": "Black attacks the bishop with a pawn. If Black exchanges bishop for knight, White will gain the bishop pair. In this position the bishop pair would be powerful.",
        "9... Ba5": "Black avoids the exchange.",
        "10. Bg2": "White fianchettos the bishop and has a threat to capture the e4 pawn.",
        "10... O-O": "Black continues to develop.",
        "11. O-O": "White also castles. b5 would be a interesting move.",
        "11... Bxd2": "Black changes his mind and exchanges the bishop for the knight. This is a good trade, as the pawn at e4 is well defended by the knight on f6, and as long as it has a powerful cramping effect on White's position.",
        "12. Qxd2": "White is forced to recapture with the Queen otherwise Black can capture the d4 pawn.\nThe White Queen and dark-squared bishop are awkwardly placed.",
        "12... e5": "This is a powerful pawn advance, opening the diagonal for the light squared bishop and also threatening the d4 pawn.",
        "13. dxe5": "White exchanges pawns.",
        "13... Nxe5": "Black recaptures. The knight comes to a good central square.\nBlack has the advantage, due to the useful extra pawn. White does not have sufficient compensation of the two bishops.",
        "14. Qc3": "White avoids a Queen exchange which would help Black develop the f8 rook, and the White rook can also now come to d1.",
        "14... Bg4": "Counter-attacking the knight",
        "15. Qxe5": "White exchanges pieces",
        "15... Bxe2": "Black re-captures the piece and keeps the initiative by threatening the rook with the bishop.",
        "16. Re1": "White moves the rook from the attack.",
        "16... Re8": "Black develops the also threatens the queen",
        "17. Qf4": "Black moves the queen to a safe square.",
        "17... Qd3": "Centralisation. The Black Queen comes to a dominant central post. From here defends both the pawn and the Bishop.\nBlack has a winning game; he is a pawn ahead, and the pawn is advanced, well defended and cramps White. Also, Black has finished development and White still needs to develop his dark square bishop to connect his rooks.",
        "18. h3": "It is difficult to understand this move. White should try and develop his queenside. a4 followed by Ra3 is a idea",
        "18... Rac8": "Black develops his least active piece to a open file.",
        "19. b4": "Now White is again on the correct track; he is going to develop his queenside pieces.",
        "19... Rc2": "Black brings a rook to the seventh rank.",
        "20. Be3": "Probably the best move by White. He must develop.",
        "20... Nd5": "Black uses the knight to attack the Queen and the bishop.",
        "21. Qf5": "White moves the Queen to a safe square. Qg5 can probably be met by ...h6",
        "21... Nxe3": "Black exchanges knight for Bishop",
        "22. fxe3": "White must recapture to maintain material.",
        "22... Qxe3+": "Black wins a pawn with check.",
        "23. Kh2": "White king moves, but Kh1 is a better square to go as it is dangerous to stay on the second rank with the Black rook also on the same rank.",
        "23... Qd2": "Black forms a powerful Queen+Rook battery",
        "24. Qf2": "White blocks the rank",
        "24... e3": "The extra pawn proves useful in attacking the White queen, to clear the rank. If say Qf4 then ...Bf3! is devestating",
        "25. Qxe2": "White is forced to exchange Queens.",
        "25... Qxe2": "Black recaptures and wins the exchange. White resigns."
    },
    "url": "https://gameknot.com/annotation.pl/french-defense-irregular-outposts?gm=61467",
    "gameName": "French defense irregular. Outposts",
    "players": "mogensc (1908) vs. lordhumungus (2099)",
    "opening": "French (C00), Reversed Philidor formation"
}