{
    "moves": {
        "1. e4": "This game features an interesting positional battle in the modern French Classical.  I'm not an e4 player and I haven't played 1...e6 since discovering the Sicilian, however, I can't resist playing in a French tournament.  The positions are always interesting, with plenty of play for both sides.  As usual, I won't annotate the basic opening moves, which should be common knowledge.",
        "1... e6 2. d4 d5 3. Nc3 Nf6 4. e5 Nfd7 5. Nce2": "This seems like a good place to start the annotation.  Instead of 5. f4 leading to the Steinitz, this move betokens the modern treatment of the Classical.  The idea is for White to create a \"super-center\" with c3, f4, and Nf3.  In these positions, the standard break at ...f6 is not so good as it leaves Black with a terminally weakened pawn structure.  This is a fact which determines this game, even though we leave book very early.  Anand has played this several times with great effect.  For some truly amazing games, check out Anand-Shirov, 2000 and Anand-Morozevich, 2000.",
        "5... c5": "The typical French counter strike.",
        "6. c3": " ",
        "6... cxd4": "Releasing the tension doesn't help black.  6...Nc6 is better, followed by 7. f4 and either 7...b5, or 7...Qb6, increasing the pressure on d4 in standard French fashion.",
        "7. cxd4": " ",
        "7... f6": "Black is clearly a little nervous about the White center, but a capture on e5 after 8. f4 only solidifies the position in White's favor.  Piece development seems more prudent at this stage, in particular, ...Nc6 and ...Qb6, with the standard queenside play.",
        "8. f4": "Reinforcing the center.",
        "8... fxe5": " ",
        "9. fxe5": "White comes out of the opening with a clear static advantage.",
        "9... Nc6": " ",
        "10. Nf3": " ",
        "10... Bb4+": " ",
        "11. Nc3": "This is not so typical of a defense.  Better might be 11. Bd2 Qb6; 12. Bxb4 Qxb4 ; 13. Qd2, with advantage to White.",
        "11... O-O": " ",
        "12. Be3": "My pieces are centrally posted and my center is strong.  My short term plan is to deploy the Bishop to d3, castle and lift the queen to connect the rooks.  Not exactly rocket science, but you can see how the mass exchange strategy employed by Black has left him in a passive situation.",
        "12... Nb6": "Clearing the way for the light-squared bishop to possibly transfer to the kingside with ...Bd7-e8-h5 is pretty common.  Also, the b6-knight can come to c4, which will pretty much force me to exchange my light-squared bishop to keep Black's activity under control.",
        "13. Bd3": "Taking aim at the Kingside in the event the Black knight chooses not to sink into c4.  The White queen can move to c2 to pressure the Black kingside and provoke a weakness on the light-squares with either ...h6, or an h-pawn push if Black plays ...g6, also keeping in mind possible sacrifices on g6.",
        "13... Nc4": "I wasn't really excited about Bg5 followed by ...Qb6, and decided to chop the knight with...",
        "14. Bxc4": "No need to allow complications.  By exchanging the knight from c4, I keep the position simple and advantageous for the White pieces.  Black gets the d5-square for his pieces, but I get the e4-square for my knight after I castle, as a bishop capture on c3 would only strengthen my center and then Nd2-e4 would come anyway.  Black also has an isolated pawn on e6, which will be a problem later.  This capture seems like a good example of choosing to use superior technique over complications.",
        "14... dxc4 15. O-O": "Releasing the pin and preparing Ne4.",
        "15... Ne7": "Logical play from Black, who seeks to exploit the new d5-outpost square.",
        "16. Qe2": "Clearing the back rank to link the rooks, vacating d1 for a rook and attacking the c-pawn.  The queen also keeps an eye on the kingside here in case too many of Black's pieces head for the queenside.",
        "16... Nd5": "Hitting the knight twice, however, I decided to set a positional trap for my opponent.",
        "17. Nd2": "This prepares to route the d2-knight to e4.  My reasoning is that the open b-file will only benefit the White pieces, as Black wants to use the b6-square for his queen and the c-file for the rooks.  As the Black c-pawn is hanging, I wasn't worried about 17...Bxc3; 18. bxc3 Nxc3; 19. Qxc4 Nd5; 20. Rb1 with quite a bit of pressure on the queenside and a nice outpost on d6 for the knight after Ne4-d6.  I also wasn't concerned with 17...Nxc3; 18. bxc3 Bxc3; 19. Rxf8  Qxf8; 20. Rf1 Qe7; 21. Qxc4, when Black's Weaknesses are more prominent and White has control of both of the open files.",
        "17... Bd7": "Probably a wise choice, Black is seeking piece activity (a dynamic imbalance) to offset his space and pawn structure disadvantage (a static imbalance).",
        "18. Rxf8+": "I thought about Nde4, however, this move gives me some initiative.  Notice how Black does not have this luxury on move 17, as his Queen is not off the back rank and cannot challenge the f-file after 17...Rxf1; 18. Rxf1, with the initiative and maintaining the static plusses in the position.",
        "18... Qxf8": " ",
        "19. Rf1": " ",
        "19... Qe7": " ",
        "20. Nce4": "After the previous forced sequence of moves, I decided against my previous plan of Nde4 and opted for this move.  My reasoning was that if Black was ever going to exchange the d5-knight, I would rather have him take the crappy e3-bishop than one of my good knights.  Again, a bishop swap for a knight is only good for White.",
        "20... b5": "Expanding on the queenside and safe guarding the pawn.  Taking the pawn was never a consideration.  With black having the two bishops, I was trying to keep the position as closed as possible.  Black would have had ample compensation for the pawn.",
        "21. a3": "Not just kicking the bishop, but trying to erect some kind of dark-square influence on the queenside.  Especially c5 and d6!",
        "21... Ba5": " ",
        "22. Bg5": "Forcing the queen back and preventing a swap of Rooks on the f-file.",
        "22... Qe8": " ",
        "23. Nc5": "23. Nd6 Qb8; 24. Qf3 Qf8! and I wasn't so sure that White was accomplishing anything.",
        "23... Bc6": "Not sure about this move.  I wasn't really interested in taking the bishop.  ",
        "24. Nde4": " ",
        "24... h6": "This is makes the situation go from bad to worse.",
        "25. Bxh6": "The bishop is off limits after 26. Qg4  Kh8; 27. Nxe6 Qe7; 28. Rf6!! Black can resign.",
        "25... Qg6": "26. Bxg7 is a threat.",
        "26. Bc1": "I considered 26. Bxg7 followed by 27. Rf3, but it seemed like Black was getting too much.",
        "26... Bb6": "Maybe ...Rf8 or even ...Bd8 in view of...",
        "27. h4": "Black doesn't have any pieces to harass my king.",
        "27... Bxc5": " ",
        "28. Nxc5": " ",
        "28... Ne7": " ",
        "29. h5": " ",
        "29... Qe8": " ",
        "30. Nxe6": "Here Black resigned as he had enough.  Thanks to my opponent."
    },
    "url": "https://gameknot.com/annotation.pl/french-defence?gm=10463",
    "gameName": "French Defence",
    "players": "mybookrunsdeep (2059) vs. richard_pitts (1916)",
    "opening": "French (C11), Steinitz, Bradford attack"
}