{
    "moves": {
        "1. e4 e6 2. d4 d5 3. Nc3": "I normally go for 3.e5 straight, or else Nd2, unless I want to try an already forgotten Alekhine attack on the king´s side. But it is nice to try new things from time to time, especially on blitz games. Not sure what are the lines here though.",
        "3... Bb4 4. e5": "Going for a classic e5 spearhead, but without supporting d4 with c3. I know that white can try now h4 at a certain timepoint.",
        "4... c5 5. f4": "But also that an alternative to support e5 is this f4 before doing Nf3. Again, not sure if this is the strongest line for white here.",
        "5... Nc6 6. Nf3 Nge7": "trying to go to f5 and also Qb6 to support attack on d4. 7.Bd3 doesn´t look appealing now since 7...c4 seems a little bit annoying for white, so I tried to get rid of BB in b4 and at the same time getting creating a support in c3 for d4.",
        "7. a3 Bxc3+": "Now, is it Ba5 stronger than this?",
        "8. bxc3 Nf5 9. Bd3": "Now again, 9...c4 might not be that bad and after 10.Bxf5 black has chances and a more active bishop. Not sure if looking for the castling (black) would do me a favour though. King at the center might be good enough for black. Then I would have moved things onto the \"b\" column.",
        "9... cxd4 10. Bxf5 exf5 11. cxd4": "Doesn´t seem white has now enough firepower to go for the king, and that doubled pawn situation in \"f\" is not that bad after Be6.",
        "11... Be6": "Playing solid.",
        "12. O-O Na5": "Again, seems good to me to hold the castling and activate some figures for black. Now, what can I do? I considered that future Nc4 to be annoying enough to have it exchanged for my WB. Will black accept the trade?",
        "13. a4": "Threatening Ba3, blocking castling. Seems a pain, that´s why I bargained with the idea of changing those two pieces and at the same time activating my \"a\" rook. Seems a good deal for white.",
        "13... Nc4": "How about castling and then doing Nc4...? ",
        "14. Ba3 Nxa3": "It seems a must for black.",
        "15. Rxa3": "And now we have a rook in the third line that can go to \"b\", \"g\" or \"h\" column. Would castling be a safe move?",
        "15... O-O": "Let´s see. Now the idea is to set N at g5, Q at h5 and R in h3.",
        "16. Ng5 Qb6": "A fair counterattack. Black can try now, if white is passive enough, to advance f6 and then Bishop supports the defence and at the same time, 6th line is open for the BQ to heal as well.",
        "17. Kh1": "And white seems to play passive as I said. But I want´t sure what else to do, since moving the WQ would lead to d4 capture and check.",
        "17... Rac8": "Now this, although a general rule is also to attack the opposite flank you are hammering, doesn´t seem to help black to defend himself.",
        "18. Rh3": "18.Qh5 would have led to the same position (or very similar)",
        "18... h6": "And here comes the beauty of this position...",
        "19. c3": "Maybe passive again, but I didn´t see anything clear with 19.Qh5 yet. And though black wouldn´t dare to take N in g5.",
        "19... hxg5": "But I was wrong. Now, is this a grave mistake? It seems to me so, but I may be wrong.",
        "20. Qh5": "Now black doesn´t have many choices to avoid mate.",
        "20... f6 21. Qg6": "But white doesn´t have many either. A false move and it´d spoil the whole attack. It seemed to me the only one to keep pressure up. Would 21.fxg have been a better choice? I was aiming for Rh5 then h4 and open the \"h\" column for my rooks to double there and finish the job.",
        "21... g4": "But I didn´t see this one and now it seems I cannot count on my Rf1 to help me out. Now, black cannot come to f7 since it would mean mate in h7. How can I exploit that?",
        "22. Rh7": "Maybe with h3 or h4 (opening also an escape route for WK) and in case of gxh, f5. But now I have blocked the mate in h7..careful now. Not sure I can find a fast enough attack.",
        "22... Qc7": "Defending g7, a clear move. Maybe Rc7 would have been a better choice, allowing then R8f7 and letting the BK escape through f8-e7.",
        "23. Qh5": "But now, is mate in one in h8. It seems no way out could have been found for black after hxg5 (or maybe even before that). A beautiful ending for a classic attack on a french defence. 1-0"
    },
    "url": "https://gameknot.com/annotation.pl/french-blitz-5m?gm=59353",
    "gameName": "French blitz 5m",
    "players": "kenderfender (1856) vs. espartacu (1940)",
    "opening": "French (C17), Winawer, advance variation"
}