{
    "moves": {
        "1. e4 e6 2. d4 d5 3. e5": "The advanced variation, recommended by Nimzowitsch. Black has a cramped position, but white's advanced centre could become weak.",
        "3... c5 4. Nf3 cxd4 5. Bd3": "Yes, I have read Nimzo's My System! (I'm not sure if this is exactly what he used to play, but its something like this.)",
        "5... Nc6 6. Bf4 Bc5 7. Nbd2 Nge7 8. O-O": "I considered h4 to prevent black's next...",
        "8... Ng6 9. Bg3 O-O 10. h4": "But now I have h4-h5 as a threat",
        "10... Qc7 11. Re1 Qb6 12. Nb3 a5 13. a4": "I was more interested in Bb5 than Nxc5 (it's a good knight).",
        "13... Bb4": "Black makes sure he can keep his bishop.",
        "14. Re2 Bd7 15. h5 Nge7 16. Nh4": "Preparing for a pawn storm on the kingside.",
        "16... h6 17. Bh2": "To allow g2-g4",
        "17... Nf5 18. Nxf5 exf5": "White has gained something, as black's kingside pawns are weak.",
        "19. f4 Rfe8": "Black is going to play ...f6. I need a plan, or I will lose my strong pawn on e5.",
        "20. Kh1": "To allow Bg1 and B(d3) moves, threatening to round up the d4 pawn. (This is why I played f2-f4 first). More importantly, the d3 bishop can move without any fear of ... d4-d3+, with a discovered check from the queen.",
        "20... Qd8": "But ... Qh4+ stops that. ",
        "21. c3 dxc3 22. bxc3 Bxc3 23. Rc1 Bb4 24. Rxc6": "An exchange sac, because the knight was the only real threat to my central pawns. Now the knight has a good square on d4, where it blockades black's position and threatens his kingside pawns.",
        "24... bxc6 25. Nd4 Qh4": "I expected ...c5, and I can't keep the knight - but I didn't see that the h5 pawn was loose",
        "26. Bxf5 Bxf5 27. Nxf5 Qxh5": "A mistake, but otherwise there is nothing to stop my kingside pawns from advancing.",
        "28. g4 Qxg4": "I initially thought that without taking the pawn black could escape, but the queen is too short on squares. After 28. ... Qh3  29. Re3! it's trapped, and black doesn't even get the knight. (edit) but Qg6 is unclear",
        "29. Nxh6+": "I played two other Q + minor piece vs R R and minor piece endings today, losing the first one but winning the other.",
        "29... gxh6 30. Rg2 Qxg2+ 31. Kxg2 Kh7": "Black is slightly ahead on material because of those sac'd pawns, but his rooks aren't very active.",
        "32. Qc2+ Kh8 33. Kh3": "Lovely safe king. I didn't take the pawn, because that would just let black activate a rook.",
        "33... Rac8 34. Qf5": "The queen invades into black's position",
        "34... Ref8 35. Qf6+ Kh7 36. f5 Bc3": "36. ... Bd2 and black can last longer than in the game",
        "37. Bf4 Rfe8 38. Qxh6+ Kg8 39. f6": "Black resigns. He used about 15 minutes, I used about 9."
    },
    "url": "https://gameknot.com/annotation.pl/french-defence-blockading-sac?gm=32252",
    "gameName": "French defence (blockading sac)",
    "players": "athorist [me] (1646) vs. rsekhar (1681)",
    "opening": "French (C02), advance, Nimzovich system"
}