{
    "moves": {
        "1. e4 e6 2. d4 d5 3. Nc3 Bb4 4. e5 c5 5. a3 Bxc3+ 6. bxc3": "This opening favorise both attacks with semi open files and diagonals.",
        "6... Ne7 7. Qg4": "Menacing a king side attack",
        "7... Qa5 8. Bd2": "Some defense is necessary before attacking seriously the black king.",
        "8... O-O 9. a4": "Move not given in the database, but it seems efficient, obliging the queen to retreat.",
        "9... c4": "Black prefers not to retreat his queen but this move suits me as well, blocking the queenside as I anyway planned to attack kingside and e file. ",
        "10. Nf3": "preparing the short castle",
        "10... b5 11. Be2": "I hesitated long but if black takes a4, I'll have one pawn late but the a black pawn will block the file as good as mine and anyway, I'll attack within two or three moves, so that it won't have time to be a queen. If I fail my attack, the game will be lost anyway but with queen, knight, two bishop and one rook on e file, my attack should succeed.",
        "11... f6": "Not a good move, it weakens the king",
        "12. O-O bxa4 13. exf6": "Black must take with the rook and it will be vulnerable",
        "13... Rxf6 14. Bg5": "Now the rook or the knight are doomed",
        "14... Rg6": "Black prefer to loose the rook",
        "15. Ne5 Rxg5 16. Qxg5": "Menacing the knight that can be easily protected.",
        "16... Nbc6": "Protecting the e knight and aiming at the center",
        "17. Rfe1": "White need the rooks on line 1 to defend against the queen but one rook can also support the attack. The e file will be the crucial place.",
        "17... Qxc3": "Black underrates white's attack possibilities",
        "18. Qf4": "I thought that black would have plaid Nxe5 then Qxe5 menacing the e pawn and permiting Bg4 or Bh5",
        "18... Nxd4": "Black chooses to carry on attacking. White has a mate in 3 moves.",
        "19. Qf7+": "one",
        "19... Kh8 20. Qf8+ Ng8 21. Nf7#": ""
    },
    "url": "https://gameknot.com/annotation.pl/french-def-winaw-pois-pawn-w?gm=48659",
    "gameName": "French def. winaw. pois. pawn (W)",
    "players": "ptitroque (1642) vs. micfel (1639)",
    "opening": "French (C19), Winawer, advance, poisoned pawn variation"
}