{
    "moves": {
        "1. e4": "A friendly, unrated game played against a friend of mine - it quickly becomes very bloody.",
        "1... Nc6 2. d4": "Nimzovich Defense.",
        "2... e6 3. Nc3 Bb4 4. Qf3": "A horrible move. Black should play Nxd4. I don't know what I was thinking, but I just felt like attacking.",
        "4... Bxc3+ 5. Qxc3": "Black let me off the hook.",
        "5... Qf6 6. Nf3": "Now it looks like black feels like attacking. At least his queen move, unlike mine, actually makes an attack without leaving any pieces hanging. I play the obvious defense for the threatened d4 pawn.",
        "6... Nxd4 7. Nxd4": "A dubious move by black. The d4 pawn was adequately defended, so now he loses material.",
        "7... Ne7 8. Be3": "I wanted to play Qxc7, but not while my knight is hanging on d4 undefended. Moving the knight loses a tempo and allows black to exchange queens. I would prefer the bishop on f4 or g5, but those squares are currently unavailable, so this move lets me defend and develop and now threatens the c7 pawn.",
        "8... d6 9. Qxc7 e5 10. Bb5+": "My knight at d4 is in danger, but I have better things to do right now than rescue it.",
        "10... Nc6 11. Nxc6 bxc6 12. Bxc6+": "Ahh, one of my favorite forks.",
        "12... Kf8 13. Bxa8 g5 14. Qxc8+": "13. ... g5 created an escape for black's king. Had black saved his bishop by moving it off of c8, white could play 14. Qb8  followed by 15. Qxh8 and black would have lost a rook to save a bishop.",
        "14... Kg7 15. Qg4": "I could have saved the bishop by Qb7 or Qc6, but I was far enough ahead in material that I preferred to exchange queens, even at the expense of my bishop. Black could prevent the exchange with 15. ... h6, but that allows my bishop to escape with 16 Bd4. ",
        "15... Rxa8 16. Qxg5+": "The exchange is on.",
        "16... Qxg5 17. Bxg5": "And now white is out of steam for the moment, but I'm ahead by a rook, bishop, and 2 pawns, and both of black's rook pawns are isolated and look like fun targets.",
        "17... h6 18. Be3 a5 19. O-O-O": "The fastest way to get my two rooks out onto the open file, beginning with an attack against the backward pawn at d6.",
        "19... a4 20. Rxd6": "Black left it hanging, so I see no reason not to gobble the pawn.",
        "20... a3 21. Bxh6+": "That pawn on a3 isn't going anywhere soon so there is no reason to break up a defensible pawn structure with bxa3. Time to gobble a little more material with a little zwischenzug.",
        "21... Kg8 22. b3": "22. Pxa3 gains no advantage, but it breaks up my pawn structure and gives black's rook something to do. I prefer to maintain the status quo.",
        "22... Kh7 23. Rhd1": "Double D (my favorite, of course!) - two rooks on the  open D file.",
        "23... Rg8 24. g3": "No need to just give away my pawns.",
        "24... Rg4 25. f3": "Ditto.",
        "25... Rg6 26. Rxg6": "Ahh, black lets me trade off his only remaining piece.",
        "26... fxg6 27. Bg5": "! I love this move. All of black's pawns are stymied and black's king has exactly 8 squares to play with. He cannot reach my bishop nor can he reach any of my pawns. He gets a lonely little 8-square prison cell to call home until I am ready to finish him off. ",
        "27... Kg7 28. c4": "I don't think there is any way to force a mate with just a bishop and a rook. I could bring my king up, but black's pawns would force me to use the d-file to get past the pawns, letting black escape, or letting him block me in with his own king. That could take a while. On the other hand, I figured it was mate in 7 or less by simply pushing the c-pawn - black cannot pass the d-file, so the pawn can march merrily to promotion unmolested.",
        "28... Kf7 29. c5 Ke6 30. c6": "Black's monarch wanders around his little 8-square prison and looks on helplessly at the inexorable progress of white's c-pawn.",
        "30... Kf7 31. c7 Kg7 32. c8=Q": "Ahhh, the pawn fulfills his wildest dream, and now it's mate in 1.",
        "32... Kh7 33. Rd7#": ""
    },
    "url": "https://gameknot.com/annotation.pl/friendly-game-turns-bloody?gm=20960",
    "gameName": "Friendly Game Turns Bloody",
    "players": "blake84120 (1442) vs. khelmar (1200)",
    "opening": "KP (B00), Nimzovich defence"
}