{
    "moves": {
        "1. d4 d5 2. c4 c6": "QGD Slav defence (D10)",
        "3. Nf3": "QGD Slav (D11), 3.Nf3",
        "3... f6 4. e3 h6": "Här lämnar svart QGD Slav (D11), 3.Nf3. 4...e6 hade varit i linjen, och faktiskt varit statistiskt bättre för svart.",
        "5. Bd3 Be6 6. c5 a6 7. Nc3 Qa5 8. O-O": "Normal utveckling så här långt. Nu är det dags för mittspel.",
        "8... Nd7 9. Bd2 Qc7 10. b4 O-O-O 11. h3 f5": "Här är det frestande att gå upp med S till e5 i mitten. Problemet är att den utväxlingen slutar med att svart centraliserar sin dam på e5. Då får jag mindre spelrum, så jag försöker öppna upp tornet på b istället.",
        "12. Rb1 Ngf6": "Här ligger svart starkare till i mitten, så jag får satsa på mina sidobönder istället. Min a-bonde ligger efter, så den verkar lämplig.",
        "13. a4 b6": "Dags att öppna upp i svarts bondeled. Frestelsedraget Ne5 kvarstår, men så gör även positionsförlusten i o m att svarts D mobiliserar i mitten. Vi kör flankattack istället.",
        "14. b5 bxc5 15. Ne5 Nxe5 16. dxe5 Qxe5 17. bxc6 Kc7": "Här gäller det att utnyttja svarts dåliga positioner spec m a p K, bl a är hela b-filen öppen för avancemang. Hans D hotar förvisso h2, men den är inte uppbackad. Det finns stora möjligheter att tränga in svarts K i ett mattnät.",
        "18. Rb7+ Kxc6": "Nu tar vi befäl över b-filen med D och sätter press på hans K.",
        "19. Qb3 Nd7 20. Bxa6": "Tar ikapp lite material, även om jag positionellt ligger bättre till. Svart är relativt låst i sin position och hans bägge L är dåliga. Skyddar även mitt T med detta drag.",
        "20... Rb8 21. Qb5+": "Tränger in svarts K och skapar färre valmöjligheter för hans drag.",
        "21... Kd6 22. Rxb8": "Ett intressant läge med garanterad materialförlust för svart. Trampar han fel så blir det matt snart.",
        "22... Bf7 23. Bc8": "Röntgar flyktvägen mot e6 och binder ihop mattnätet.",
        "23... Ke6": "Nu går jag upp med T och schackar så får jag hans D innan vi säger godnatt. Möjligen finns det snabbare mattar, men frestelsen att slå hans D är för stor.",
        "24. Rb6+": "Nu kan han endast parera med D. Min L står fint och hindrar hans S från att slå mitt T.",
        "24... Qd6": "Nu är matten nära. Först slår jag Dxd5, sedan går han antingen med K till f6 eller e5 och och då slår jag Dxf5#.",
        "25. Qxd7+": "Matt om ett drag.",
        "25... Ke5 26. Qxf5#": "Där satt den !"
    },
    "url": "https://gameknot.com/annotation.pl/frnz571s-51st-mini-tournament-lii?gm=29053",
    "gameName": "frnz571's 51st mini-tournament LII",
    "players": "chekof (1256) vs. rave83 (1104)",
    "opening": "QGD Slav (D11), 3.Nf3"
}