{
    "moves": {
        "1. d4": "In our openings, we need to consult the databases and opening books, and there are reasons why departures from established theory are bad -- they are dross in the crucible of experience.  In this game, black's first error comes on the fourth move, and a crucial blunder at move seven makes white's win inevitable.  Yet white, confident in the outcome, makes a lazy decision at move 14, prolonging the game unnecessarily.",
        "1... d5 2. c4 e6 3. Nf3 dxc4 4. Bg5 f6": "?  This is a departure from established play (4. ... Be7), and it doesn't turn out well.  Unless black can now mobilize the queenside and castle over there, he is doomed.",
        "5. Bf4 Bd6 6. Bxd6 cxd6": "The idea seems to have been \"hold the center,\" but Qxd5 would have been better.",
        "7. e4": "White could have regained the gambit pawn with Qa4+, but to no strategic advantage.  I'm playing to expose black's king. ",
        "7... Qa5+ 8. Nc3 Nc6 9. Bxc4": "Regaining the gambit pawn.",
        "9... e5": "??  Bad move.  Black is behind in development and hasn't castled yet; putting the center in flux leads to his downfall.",
        "10. dxe5": "Exposing black's vulnerable d-pawn . . .",
        "10... fxe5": "When he promptly makes exactly the wrong move, losing immediately.  But 10. ... dxe5 doesn't look promising either. ",
        "11. Qxd6 Nf6": "11. ... Ne7 would have at least covered the king a bit, but 11. ... Qd8 was his best hope.",
        "12. Be6 Bxe6": "??  Still, 12. ... Qd8 was black's only chance.",
        "13. Qxe6+ Ne7 14. Qxe5": "Why grab a pawn and trade queens?  An ending could have been forced sooner:  14. Nxe5 Qc5  15. Qf7+ Kd8  16. Rd1+ Kc7  (16. ... Kc8  17. Qd6+ leads to mate in 4) 17. Rd7+ Kb6  18. Rxe7 Qb4 (to prevent 19. Qb3+) 19. Qe6+ Ka5 20. Nc4+ and black must lose the queen, mate coming soon afterward.",
        "14... Qxe5 15. Nxe5 O-O 16. O-O-O Ng6 17. Nxg6 hxg6 18. Kb1 Rfc8 19. f4 Rcf8 20. h3 g5 21. fxg5 Nh5 22. g4 Ng3 23. Rhg1 Rf3 24. e5 Re8 25. Rde1 b5 26. Nxb5 a5 27. Nd4": "And the rest of the game is white's slowly grinding his way to a win with the passed pawn.",
        "27... Rd3 28. Kc2 Rxd4 29. Rxg3 Rc8+ 30. Kb1 a4 31. g6 Rcc4 32. Rge3 a3 33. bxa3 Rd7 34. e6 Rb7+ 35. Ka1 Rc8 36. e7 Re8 37. Re3e4 Rb6 38. Re4e6 Rxe6 39. Rxe6 Kh8 40. a4": ""
    },
    "url": "https://gameknot.com/annotation.pl/frnz571s-52nd-mini-tournament?gm=29851",
    "gameName": "frnz571's 52nd mini-tournament ",
    "players": "yogaman28734 (1644) vs. jjfrede (1117)",
    "opening": "QGD Slav (D30)"
}