{
    "moves": {
        "1. e3 a6": "Obviously I had zero concept of strategy. Basically both me and D. B. were moving at random...",
        "2. a3 a5": "I could have done that in one move. Not that it's a good move anyway...",
        "3. Qh5 Ra6": "I obviously felt the need to involve my Rook. :-)",
        "4. Qxa5": "Here I could have taken his Queen. But...",
        "4... h5": "Apparently I was focused on getting my other Rook involved. Amazing to look back and try and figure out what goes on in the brain of a very young child...",
        "5. Qxc7": "D. B. was apparently impressed that the Queen could move in any direction.",
        "5... Rah6": "I apparently felt my Rooks should guard each other.",
        "6. h4": "??? I have no explanations. I can't figure out what goes on in the head of my 5-year-old son now, so...",
        "6... f6": "*shrugs shoulders*",
        "7. Qxd7+": "My father was watching us with a poker face, he claims. He also says that at this point, he had to remind D. B. to say, \"Check.\"",
        "7... Kf7": "Well, that did get me out of check.",
        "8. Qxb7 Qd3": "???",
        "9. Qxb8 Qh7": "I'm guessing I wanted to put my heavy pieces together?",
        "10. Qxc8": "Like I said, D. B was fascinated [apparently] by the Queen.",
        "10... Kg6": "Now all my major pieces -- Rooks, Queen, and King -- are all clustered together. Apparently my 3-year-old mind thought that was good strategy.",
        "11. Qe6": "At this point, according to my dad, he told us the game was over because I couldn't move, and no one was the winner. I apparently asked him how you could have a game where no one won and he assured us it was possible.\r\n\r\nOther than my father's say so and his handwritten score sheet, which he brought over for me to have when he picked up my son from school earlier this week, I have no other evidence the game happened. Obviously at 3 years old, me and D.B. wouldn't remember if it did or not. Assuming it did, what a weird game... but 3-year-olds produce weird stuff. "
    },
    "url": "https://gameknot.com/annotation.pl/from-two-children?gm=31356",
    "gameName": "From two children...",
    "players": "D. B.  vs. Hellion ",
    "opening": "Van't Kruijs opening (A00)"
}