{
    "moves": {
        "1. e4 e5 2. Bc4 Bc5 3. f4": "f4??   -      In de theorieboeken staat Pf3 of het brutale Dg4!\n",
        "3... Bxg1": " Lxg1! Koren op mijn molen! Een fantasie-opening! Nu komt het meteen op schaken aan.....\n",
        "4. Qh5": "En nu moet ik schrikken zeker???, Maar ik zag geen gevaar en speelde rustig de dame naar voren! Er volgde.\n",
        "4... Qe7": "Hij moest mijn loper eerst nog nemen....En dat tempoverlies gaf ik niet meer uit handen.\n",
        "5. Rxg1 Nf6": "Dit zou hij kunnen doen, Dxe5, dan dames afruilen en ik kreeg met Pxe4 mijn pion terug.\n",
        "6. Qe2 Nc6 7. d3": " Beter leek mij c3! Zelfs na analyse vond hij c3 slecht....",
        "7... d6 8. Nc3 Nd4 9. Qd2 exf4": "Hij mag niet Dxf4 spelen natuurlijk. \n",
        "10. Nb5 Nxb5 11. Bxb5+ c6 12. Ba4 d5 13. Qc3": "13. Dc3. ... Interessante zet. Er kan volgen: 13.  ... - dxe4, 14. Lxc6+ - bxc6, 15. Dxc6+ - Pd7, 16 Dxa8 - dxe3+ , 17. Kd2 - De2+ ,\n                 18. Kc3 - Dxc2+ , enz. ... maar wit durfde het toch niet aan en speelde d4...Ik had in ieder geval genoeg compensatie.....\n",
        "13... dxe4": "Ik had deze combinatie gezien. Zorgvoldig uitgerekend en daarom speelde ik wel degelijk deze zet dxe4!!\n",
        "14. d4 O-O": "Hij twijfelde, want hij dacht heel lang na en besloot de combinatie alsnog niet aan te gaan.\n",
        "15. Bxf4 Nd5": "De f-pion bleek giftig.\n",
        "16. Qg3 Nxf4 17. Qxf4 Qb4+ 18. c3 Qxa4": "Vol stuk en een pion die niet zomaar eventjes zonder gevaar gepakt kan worden.\n",
        "19. Rf1 Be6": "Geen enkel risiko nemen. Pion e4 mag hij hebben.\n",
        "20. g4 e3 21. h4 Qc2 22. Qxe3 Qxb2 23. Rd1 Bc4 24. Rf2 Rfe8": "Een wel zeer vreemde afruil, maar het kan zonder gevaar.\n",
        "25. Rxb2 Rxe3+ 26. Kf2 Re7 27. Rdb1 b5 28. a3 g6 29. Rg1 Rae8 30. Rg3 Re7e2+ 31. Rxe2 Rxe2+ 32. Kg1 Ra2 33. Rf3 Rxa3 34. Kf2 a5 35. Kg3 b4 36. Rf6 Rxc3+ 37. Kf4 Bd5": "Wit gaf eindelijk op...\n"
    },
    "url": "https://gameknot.com/annotation.pl/fsb-competitie-2e-klasse-b-16-04-2010?gm=30968",
    "gameName": "FSB competitie 2e klasse B 16-04-2010",
    "players": "Mohammed Hosseini (1798) vs. Chris Draijer (1743)",
    "opening": "Bishop's opening (C23), Classical variation"
}