{
    "moves": {
        "1. e4 c5 2. Nf3 e6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 d6 6. Bc4 a6": "Hier dacht ik nog even aan spektakel varianten met 6…..Pxe4. 7. Pxe4 d5. Dat wordt dan weerlegd door 8. Lb5 +. Daarom moet a6 eerst en Gerard haalt met zijn volgende zet de mogelijkheid Pxe4 er definitief uit. Dus ga ik op de normale Siciliaanse manier door met ontwikkelen",
        "7. f3 Be7 8. Be3 O-O": "De beslissing wat te doen met de stukken op de damevleugel nog even uitstellen",
        "9. Qd2 Nc6 10. O-O Bd7": "Ik had gedacht dat hij lang zou rocheren. Op Chess base kon ik 19 partijen met de korte rochade vinden, waarvan wit er flink wat won! ",
        "11. Rad1 Qc7 12. Bb3 Rac8 13. Nde2 Na5": "Nu is het voor zwart heel lastig om een goede voortzetting te vinden, daarom heb ik hier wel een minuut of 10-15 bedenktijd gebruikt. Belangrijk is meestal het goed op tijd plaatsen van de opstoot d6-d5. Ik besluit daarom de loper op b3 af te ruilen. Wat voor alternatieven heeft zwart? Tfd8? Pe5? h6? De laatste vond ik griezelig want misschien kan wit wel gewoon offeren op h6.",
        "14. Bg5 Nc4": "Achteraf lijkt 14.   Pxb3 15. cxb3 Kh8 me beter voor zwart, het wint een tempo ten opzichte van Pc4. Nu neemt wit het initiatief",
        "15. Bxc4 Qxc4 16. Bxf6 gxf6": "vooral geen Lxf6, vanwege Dxd6",
        "17. f4 Kh8 18. Rf3 Bc6": "Deze zet was erg naar mijn zin. ",
        "19. Nd4 Rfg8": "Dd4 lijkt mij een goed alternatief voor wit. Een heel dwingende zet, ik moet dan weer lang gaan nadenken of ik de dame wil afruilen en zo ja hoe. ",
        "20. Nxc6 bxc6": "bxc6 in verband met de opstoot d6-d5, die gaat mogelijk worden en geeft mij de nodige ruimte",
        "21. b3 Qc5+ 22. Kh1 d5": "Daar is-ie dan eindelijk. Df2 lijkt mij ipv Kh1 een solide alternatief voor wit, maar wel erg richting remise, bijvoorbeeld 22. Df2 d5 23 exd5 cxd5 24. Dxc5 Lxc5. Heel ander spel",
        "23. Rh3 Rg4 24. f5 Rcg8": "Gerard gaf hier zelf i.p.v f5 g3 als degelijker alternatief aan. Dat is voor wit minder riskant, maar zet wel Th3 geïsoleerd",
        "25. Qe2 Rg4xg2": "Hier kwam het nodige rekenwerk aan te pas. Gerards’ voortzetting heb ik gezien, maar ook \r\n     26. Dxg2 Txg2 27. Kxg2 d4! 28. Pb1 Dxc2+ 29. Td2 Dxb1 30. Txd4 Db2+, 0-1\r\n Ook  26. Dxg2 Txg2 27. Kxg2 d4! 28. Thd3 dxc3 29. Td7 lijkt mij uiteindelijk winnend \r\n",
        "26. Rxh7+ Kxh7 27. Qh5+ Kg7 28. Kxg2 Kf8+ 29. Kh1 Qxc3": "Het paard kan worden geïncasseerd, maar het initiatief is even weg",
        "30. fxe6 fxe6 31. Qh6+ Ke8 32. Qh5+ Kd7 33. exd5 Qxc2": "Op 33…..cxd5 volgt 34. Txd5, dan niet exd5 doen, maar Kc6 . In tijdnood zag ik deze mogelijkheid niet en dacht ik dat Tg8 er af ging na 34. exd5 35. Dd5+ Kc7 36. Dxg8",
        "34. dxe6+ Kc8 35. Qf3 Rh8": "Df3 is de enige oplossing voor wit, Td7 kan absoluut niet",
        "36. Rd2 Qc5": "Reken maar eens na, slaan op d2 is volgens mij niet goed",
        "37. Qd1 Qe5": "Dd3 lijkt lastiger, maar dan volgt Dd5 met ruil",
        "38. Qf1 Qe4+ 39. Rg2 Kb7 40. Qc4 Qxc4 41. bxc4 Kc7 42. Rg7 Kd6 43. Kg2 Kxe6 44. h3 Rh5 45. Kf3 Rxh3+": "Wit moet wel, want torenruil op g5 is een verloren eindspel",
        "46. Ke4 f5+": "De rest heb ik niet meer opgeschreven, want ik had toen al minder dan 5 minuten.\r\nDe afloop is bekend. Mijn f-pion sneuvelde op het veld van eer, de 2 resterende witte pionnen gingen er af, wit moest zijn toren geven om promotie van de a-pion tegen te gaan. De c-pion werd een prachtige dame met ideale maten en met nog 1 minuut op de klok bleef Rijs in klas 2.\r\n"
    },
    "url": "https://gameknot.com/annotation.pl/fsb-wedstrijd-rijs-dsc-13-maart-2009?gm=22494",
    "gameName": "FSB Wedstrijd Rijs-DSC 13 maart 2009",
    "players": "Gerard Baars (1846) vs. Jan Brinkman (1779)",
    "opening": "Sicilian (B40), Pin variation (Sicilian counter-attack)"
}