{
    "moves": {
        "1. e4 e6 2. d4 d5": "The French. Pretty boring for a blitz game, so I try to sharpen the position a bit. ",
        "3. Nc3": "Now either the Rubinstein variation or Winawer leads to a more sharp position. ",
        "3... dxe4 4. f3": "!? The exclamation mark being only for the audacity of playing the BDG. Still, in a blitz game it is a pretty fierce weapon. ",
        "4... exf3 5. Nxf3 Nf6 6. Bd3 Bb4": "?! A bit ambitious by Black, although nothing horrible right away. Just doesn't seem \"right\". Black should not be focusing on activity, but rather developing safely and protecting his pawn advantage. \r\n\r\n6. Be7 seems safer. ",
        "7. Bg5 O-O": "? I knew this move was a mistake the second I saw it, without having to calculate any variations or see any tactics. Black should not castle this early against a gambit such as the BGD and with all of white's pieces aimed at the kingside, Black just seems wrong.  \r\n\r\nbetter is 7. Nbd7",
        "8. O-O Be7": "Black gains some sense and moves his bishop back to e7, but ultimately wastes a tempo in his b4 to e7 excursion.  ",
        "9. Qe1": "Eyes the bishop on e7 and the h4 square. Black needs to tread very carefully. ",
        "9... Nbd7 10. Qh4 g6": "Blocking the h7 diagonal, but at a cost. Black's position now looks gross. With all the weak darksquares around the kingside, white should have a strong attack. ",
        "11. Ne4": "! Black cannot take the knight due to 11 Bxe7 forking the queen and rook and white retains the attack. \r\n\r\nAlso brings in another attacker. ",
        "11... Nd5": "A logical move, trying to get rid of the pesky pin. ",
        "12. Qh6": "White grabs control of even more dark squares. ",
        "12... Bxg5": "? This just loses straight away. Although Black was in a poor position as white is threatening to evict the d5 knight and proceed with the attack. ",
        "13. Nfxg5 Nd5f6 14. Nxf6+ Nxf6 15. Rxf6": "! Removes the h7 defender. The rest is just cleanup",
        "15... Re8 16. Qxh7+ Kf8 17. Rxf7#": "Black was probably prepared for a slow, quiet french when he walked into the BGD. With one of two dubious moves, he quickly fell behind in development and castled into the classic white kingside attack using all the white pieces except the a1 rook. \r\n\r\nWas quite simple and cute, but still the flow and ease of the attack made me want to annotate the game. "
    },
    "url": "https://gameknot.com/annotation.pl/fun-little-blitz-attack?gm=39075",
    "gameName": "Fun Little Blitz Attack",
    "players": "grntnick (1690) vs. eackiron (1776)",
    "opening": "French (C10), Rubinstein variation"
}