{
    "moves": {
        "1. e4": "I played Black in this tournament game.",
        "1... c5": "I believe this is the most logical defense against e4, since White wants to create a strong centre with d4. My move and e5 both control d4 to stop the central expansion, but c5 creates less weaknesses than e5.",
        "2. Nf3": "Playing Nf3 against Sicilian usually indicates White wants to open the position with d4. Although White doesn't have to play d4, so Nf3 doesn't really indicate a clear plan, it's just a simple developing move.",
        "2... d6": "I believe this is best, since it prepares to develop with Nf6.",
        "3. d4": "Open Sicilian",
        "3... cxd4 4. Nxd4": "This is a classic Sicilian position where White opens the centre to get faster and easier development, while Black is more cramped, but has a solid position.",
        "4... Nf6 5. Nc3 a6": "This is classic Najdorf Sicilian, but I thought maybe I should've played e6 in this position since a6 isn't needed right now.",
        "6. f4": "White grabs a huge chunk of the centre, but I am not worried since he is creating a lot of weaknesses. ",
        "6... e6": "Since I have an extra pawn in the centre, I can establish a small central fortress White cannot penetrate without giving me an advantage. I prefer my position here since I am better structured and have no major weaknesses. White's weakened squares around the king may be a problem for him later. ",
        "7. Be2": "This is a normal move for White in Sicilian positions. There really isn't a better square for the bishop.",
        "7... Qc7": "Since I usually try for a Qc7 setup, I guess playing a6 early wasn't that bad, since I almost always play a6 anyway to control b5 so my queen cannot be harassed by a knight.",
        "8. Be3": "This move invites the poisoned pawn variation, where I play Qb6 and White sacrifices the pawn to misplace my queen. But there is just too much studying to play into that, when simple moves should give me an advantage due to my inpenetrable central fortress. ",
        "8... b5": "This I think was a blunder since it overextends my position. I think b6 was better and more solid. I only played b5 because it threatens to win a pawn and gives me an initiative for a few moves, but White has a simple defense.",
        "9. a3": "This is necessary in defending the weak e-pawn, since the defender of a weakness should always be defended from attack.",
        "9... Bb7": "Hitting the weak e-pawn again",
        "10. Bf3 Nbd7": "Notice how I haven't played Be7 O-O yet? If I did, then White would storm my kingside starting with g4. My king is much more safe in the centre behind my small fortress where I can try to attack White's weak pawn with moves like Nc5.",
        "11. O-O": "It's hard to attack White's king in Open Sicilians where White castles kingside, which is why I don't like castling as Black. Whenever White castles kingside in this opening, I attack White's king with my h and g-pawns while my king's central fortress is untouched.",
        "11... Nc5": "I thought I had successfully taken advantage of White's weakness by piling enough forces on it, but I missed his next move.",
        "12. e5": "Now, White's not just going to hand me a free pawn, so I knew there had to be something up. After dxe5 fxe5 Qxe5, White has Bf4!! which actually traps my queen because Qxf4 is still losing to Bc6  with discovered attack on my queen.",
        "12... Nfe4": "I was considering this and Nfd7, but Nfd7 allows Bxb7 Qxb7 exd6 with many offensively tactical ideas for White.",
        "13. Nxe4 Nxe4": "Here it seems like I am doing good and will soon get an advantage since White must take d6 to avoid losing a pawn. White realizes his position is bad, so he must take drastic action.",
        "14. f5": "With this move, White signifies he would like to try a do or die attack against my uncastled king.",
        "14... dxe5 15. Nxe6": "I knew it was coming",
        "15... fxe6": "I have nothing better to do than accept, defend, and hold onto my extra piece",
        "16. Bh5+": "I'm not afraid of White's sacrifice, because with proper defense, my king will be completely safe.",
        "16... Ke7": "My position looks somewhat ridiculous, but that can easily be changed.\r\nThe fact that I am up a minor piece is a lot harder to change.",
        "17. fxe6": "Of course White wants me to take the pawn to expose my king further, but I have a better defensive move.",
        "17... Nf6": "White's pieces have no way to penetrate my position.",
        "18. Bf7": "White probably realizes his attack has failed, so all he can do is hold onto his passed pawn while restricting my king.",
        "18... Rd8 19. Qe1": "The only meaningful place for the queen",
        "19... Rd5": "Even though I'm up a piece which is usually totally winning, first I must get my king safe so I can actually activate my extra piece. I need this odd-looking rook move to get my king to d8 then to c8 etc.",
        "20. Qf2": "White can't really do much to try and save this position, except controlling my queenside weaknesses on b6 and a7.",
        "20... Kd8": "I was hoping White would fall for my trick, because if White carelessly plays Bb6? thinking he has won my queen, I have Bc5! a countertactic which forces the trade of pieces, going into a slightly simpler position where I'm still up a piece. White should try keeping as much material on the board as possible so my extra piece won't be as advantageous as in an endgame",
        "21. e7+": "White sees through my trick and instead wants to trade his bishop and pawn for my rook. Even though White wins the exchange, it still simplifies material on the board, and I'll still have a material advantage (something to always consider ater your opponent has sacrificed)",
        "21... Bxe7 22. Bxd5 Nxd5": "Now I wind up with two minor pieces against a rook. Two minors are generally considered better since they are two attacking forces, while a rook is only one. Although in some cases, a rook can be better than two pieces if the position is extremely open with hardly any other pieces.",
        "23. Rad1": "White can't really do anything here. ",
        "23... Kc8": "Walking to safety",
        "24. Qf5+ Kb8": "Now that my king is safe, I can finally take advantage of my lead in material ",
        "25. Bf2": "White's bishop was in danger and White spent a move moving it, so now I have the initiative.",
        "25... Nf4": "I was happy here, since I'm hitting the g2 pawn, and g3?? loses to Ne2#",
        "26. Rd7": "All White can try in this desperate position",
        "26... Qc6": "Threatening mate so White can't take e7.",
        "27. Qg4": "Stops mate while my bishop is still under attack.",
        "27... h5": "harassing White's queen since it must stay defending both g2 and d7",
        "28. Qxg7": "Only way to stay defending against mate, while creating a counter rook threat.",
        "28... Bf6": "This move wins material since White's queen is \"overworked\"",
        "29. Rxb7+": "The only way to hold on is to sacrifice the exchange, otherwise I will take the rook for free since White's queen must still defend against mate",
        "29... Qxb7 30. Qxb7+": "Probably best to trade queens since passively moving the queen gives me time for an attack like h4-h3 or something",
        "30... Kxb7 31. Be3": "It was right after the queen trade when I realized I may not be as winning as I thought I was. Even though I'm up a piece, I've reached an endgame, and the way to win endgames is to promote pawns. Pawns increase in value during the endgame, and White has an extra pawn against my piece.",
        "31... Nd5": "I should still be able to win with my extra piece, I just need to use more effort than I originally expected",
        "32. Bd2 e4": "my only passed pawn",
        "33. Rf5": "Hitting my knight so that if my knight moves, my bishop is gone.",
        "33... Kc6 34. c3": "blocking Bxb2",
        "34... Rf8": "I have a tactical cheapo of Bd4  and my rook on this file will create some future cheapos preventing White's king from crossing. ",
        "35. Rxh5": "Even though I lose another pawn, my pieces are clearly dominant, and I envisioned White would have to sacrifice his bishop for my passed pawn. Although maybe it was a safer way to win by just consolidating and grinding White down until he's in zugswang",
        "35... e3 36. Be1 e2": "I'm inviting White to fall for my cheapo, if Kf2, then Bh4   Kxe2 Re8  and I win White's bishop. ",
        "37. Bf2": "White can't do anything",
        "37... Re8": "threatening to queen",
        "38. Be1 Rf8": "I realized I am playing pointlessly and only trying for cheapos. Despite having an extra piece, it's still complicated to win and I must play absolutely perfect",
        "39. Bf2": "While White keeps moving his bishop, it seems as if I cannot penetrate using my extra piece",
        "39... Nf4": "Although I can, and should've played this on move 37 rather than just repeating positions trying for tactical cheapos",
        "40. Rc5+ Kd6 41. Rf5 Nd3": "Now I will queen for sure",
        "42. g4 e1=Q+ 43. Bxe1 Nxe1": "Here I thought I'd be totally winning, but the position is still complicated. I have two extra pieces, but now White has three extra pawns and pawns increase in value during the endgame. This is hard, but two pieces should be enough to beat White's three pawns.",
        "44. Kf1 Nd3": "More logical than Nc2 which just puts my knight out of play and doesn't threaten a pawn.",
        "45. b3 Be7": "I use this single opportunity to force a rook trade, going into a simpler ending",
        "46. Rxf8 Bxf8": "My two pieces will definitely be enough to beat White's three pawns now.",
        "47. Ke2 Ne5": "White's kingside pawns will fall now. White should've kept them back.",
        "48. g5 Ke6 49. h4 Bxa3 50. b4 Kf5 51. Ke3": "I realized maybe winning would take more effort than I originally thought. After trading rooks, the position looked effortlessly winning for me, but now I see that while I'm eating White's kingside pawns, his king has a path to my queenside pawns. If I try defending my queenside pawns, his kingiside pawns promote.",
        "51... Kg4 52. Kd4": "There's no way to defend my queenside pawns against White's king",
        "52... Ng6 53. Kc5 Bb2": "Now I see the only way to win is to get White's last queenside pawns before eating the kingside ones, leaving me with a king, bishop and knight against just a king.\r\nI honestly didn't think I'd be able to win that ending",
        "54. Kb6 Bxc3 55. Kxa6 Bxb4 56. Kxb5 Bd2 57. Kc4 Kxh4 58. Kd3 Bf4": "Bxg5 looked too passive",
        "59. Kd4 Kxg5": "I never learned exactly how to force a win in this ending, which is what made me think I couldn't win here. Although even if I had never considered ever getting this ending, the win is still there, and all it takes is logical chess to win.",
        "60. Ke4": "Winning this is hard because a knight and bishop cannot create a solid barrier to enclose White's king.\r\nA rook can easily create a solid barrier, while so can two bishops, which is why winning those endings are a lot easier than winning this one.",
        "60... Ne7": "Knight and bishop are strongest when they are on the same color, because they control both colors and make somewhat of a barrier.",
        "61. Kd3 Kf5": "restricting the king more. All I need to do is push White's king to the same colored corner as my bishop (it's impossible to force checkmate with bishop and knight in a corner that isn't the same color as the bishop)",
        "62. Kd4": "White should try staying as close to the centre as possible",
        "62... Bd6": "Creating a stronger barrier",
        "63. Kd3 Nc6": "The winning process is slow, but I'm fine as long as I can do it in less than 50 moves since I took the last pawn, so that White cannot claim a draw.",
        "64. Ke2 Bc5": "restricting more squares",
        "65. Kf3": "If Kd3 then my next move still creates a barrier",
        "65... Ne5+": "The knight and bishop have the strongest barrier when they are two horizontal squares away from each other, or two vertical squares.",
        "66. Kg3 Ng6": "I considered Be3 also, but this way looked faster. Looking back, maybe Be3 was correct",
        "67. Kf3 Nf4": "After each move, my barrier keeps getting tighter and White's king has less squares",
        "68. Kg3": "forced",
        "68... Ke4": "White can hold on a little longer if he plays Kg4, staying closer to the center, and play could continue Ne2 Kg5 Be7  Kg6 Ke5 Kf7 Kd6 Kg6 Ke6 Kh5 Kf5 and White's king is cut off and trapped toward the corner.",
        "69. Kh2": "Instead, White knows he cannot get mated in a light corner, so tries to get as far away from a dark corner as possible.",
        "69... Kf3": "Even though White's king is in the wrong corner, it's still more restricted than it would be in the centre, so it shouldn't be too hard to force the king into the correct corner of the board",
        "70. Kh1 Ne2": "preparing to control h1",
        "71. Kh2 Ng3 72. Kh3 Bg1": "The necessary restricting move in pushing White's king toward his doom on h8.",
        "73. Kh4 Ne4": "restricting the g5 escape square.\r\nEvery move must be accurate, or White escapes and goes to the 50-move rule. I took the last pawn on move 59, so White can claim a draw if the game reaches his 110th move.",
        "74. Kh5": "If White plays Kh3, I easily corral his king with Ng5  Kh4 Kf4 where White's king is forced to h5 anyway, but my pieces are a little closer than they are now.",
        "74... Kf4": "My king is my strongest attacking piece for trying to corral White's king by restricting squares around it, eventually forcing it to h8.",
        "75. Kg6": "Trying to get back to the centre",
        "75... Ng5": "This is an important move to remember, because the knight controls possible escaping squares, like after Kf6, then Bc5 solidifies the barrier and White cannot escape.",
        "76. Kg7 Bc5 77. Kf6 Bf8": "Now that I have the White king where I want him, I just need to make a waste move with my bishop to force the king off its square, so that I can control that square once the king is off, making the barrier tighter.",
        "78. Kg6 Be7 79. Kh5 Ne6": "I need to move my knight to prevent Kh4, and my knight needs to get to a square where it controls f7 and makes the barrier tighter",
        "80. Kg6 Nd8 81. Kh5": "There's nothing White can do to escape. The next moves are simple restricting moves that tighten the barrier",
        "81... Kf5 82. Kh6 Ne6": "The next step to corralling White's king to h8 is to control f8 with the knight to stop the king from escaping once I get my bishop to g5 to restrict h6, and my king to f6, the White king will be limited to three squares in the corner.",
        "83. Kh5 Bd8": "I need to make a waste move with my bishop in order to get White off h5, so that I can control h5 with Bg5 , taking away another square.",
        "84. Kh6 Bg5+": "White's king is forced toward the corner because of Kh5 Nf4#",
        "85. Kh7 Kf6": "This was the position I told you to imagine on move 82. White is within moves of being mated because it's breathing space is running out, thanks to my powerfully placed king, and minor pieces controlling the escape routes.",
        "86. Kg8 Kg6": "The next step in mating, is to limit the king to two squares, sealed off by my bishop, and then complete a mating maneuver with the knight.",
        "87. Kh8 Kf7": "Now that the king is limited to two squares, sealed off by my bishop, my knight does the mating maneuver.",
        "88. Kh7 Nf8+ 89. Kh8 Bf6#": "This is a hard mate to accomplish, but I had enough time on my clock to do it effeciently, and even some GMs have trouble doing this if they never studied it."
    },
    "url": "https://gameknot.com/annotation.pl/gambito-318?gm=7295",
    "gameName": "Gambito #318",
    "players": "Eradi (1884) vs. byakuugan3 (1802)",
    "opening": "Sicilian (B93), Najdorf, 6.f4"
}