{
    "moves": {
        "1. c4": "As my regular readers know by now, I'm concentrating on the English Open for OTB chess and am using Gameknot to help me practise its lines.",
        "1... e5": "This move opens up the Reverse Sicilian, but as it is White's move it keeps the advantage on White's side. ",
        "2. g3": "Allows White to begin his strategy of light coloured square control. ",
        "2... Be7": "I've stated this before in games at this point and I'll state it again, I think the best move is Nf6 here allowing a d5 push and strengthening the centre.  It also happens to be the preferred move of Karpov for this situation, although I wouldn't dare to guess at his reasoning! :o)",
        "3. Nc3 Nf6": "Black's plan of 2...Be7 is revealed as aiming for an early castle.",
        "4. Bg2": "Pin on the b7 Pawn and helps to gain some control over the centre.",
        "4... O-O 5. Nf3": "Looking at pushing my d Pawn forward.",
        "5... d6": "Black removes the threat on his e Pawn.",
        "6. d4 exd4": "Attacks White's Knight on c3.  I prefer 6...c6 for Black here, looking at keeping the centre stronger.  Maybe something like 6...c6 7.O-O e4 8.Ne1 Be6 9.Nxe4 Bxc4 10.Nxf6+ Bxf6  ???",
        "7. Nxd4": "Logical move.  Pin on Black's b7 Pawn and evens up the material.  Also, d4 is a strong position for any Knight, allowing it to make it's presence felt on 8 squares.",
        "7... c5": "Looks the best move.  Forces Black to move his Knight away.",
        "8. Nc2 a6": "I dislike this move, I don't feel it gains anything for Black, allowing White a \"move in hand\" as it were.  White already has the advantage of being first to move, so this sort of delaying move just plays into his hands.  I think I'd have looked at 8...Nc6 9.O-O Be6 10.Ne3 Qd7 11.Ned5 Bh3, which looks better.",
        "9. Ne3": "Aiming at putting a Knight on d5, another powerful square for a Knight.",
        "9... Ra7": "This smacks of another delaying move to me.  Perhaps someone else has some insight?  I'd have gone Nc6 with the aim of an eventual Rb8 and pushing the Queenside Pawns.",
        "10. O-O Bd7 11. Ned5": "Finally gained my Knight foothold in the centre.  Very powerful square, defended by my second Knight and my Queen.",
        "11... Bc6 12. e4": "At the time of making this move I wasn't sure whether to make e-Pawn push or send my Bishop to e3.  I think both moves have merit.  In the end I went with e4, more instinct than decision.  I simply didn't want to box in my e-Pawn with my Bishop.  The 12.Be3 line I had in mind was 12... b5 13.Qb3 Nxd5 14.Nxd5 Bxd5 15.Bxd5 bxc4 16.Qxc4, whereas the 12.e4 line I had in mind was 12... Nxd5 13.exd5 Bd7 14.Re1 b5 15.cxb5 axb5.  Was I right to go with the e4 one?  If correctness is measured by winning the game, then yes :o)",
        "12... Nbd7": "Not a terrible move, although I would've preferred taking the White Knight on d4.  Instead, Black chooses to defend his own Knight.  At this point I was beginning to feel that my opponent had decided to try and last against me, rather than to attempt to win.  This is a very good tactic when you feel outmatched in a game, allowing you to frustrate your opponent and occasionally force a draw or snatch a win through your opponent making an error.",
        "13. Qe2 Re8": "I remember being told several times that regardless of the intervening pieces, always place your Rook on the same file as the opposing Queen.",
        "14. Re1 b6 15. Bg5": "Should I have gone for 15.Nxe7+ ???",
        "15... h6": "Black dislikes having my Bishop so close and sends him on his way.",
        "16. Bf4 Nh7": "Finally!  The sort of move I've been waiting for.  h7 is a very weak square for the Black Knight, covering just 3 squares.  He has abandoned the double threat he was posing on my Knight at d5 and opened the doors up for several different ideas.  Perhaps 16...Ne5 17.Bd2 Nxd5 18.Nxd5 was better ???",
        "17. Rad1 Bf6": "Again, Black plays into my hands.  White can quickly gain a material advantage after 18.Nxf6+.",
        "18. Nxf6+": "Fork forces Black to take the Knight.",
        "18... Nhxf6 19. Bxd6 Qa8 20. f3": "I wonder if 20.Qc2 would've been more efficient?",
        "20... Re6 21. Bh3": "Puts some pressure on Black's Rook, forcing him back to e8.",
        "21... Re8 22. Nd5": "Baiting Black to take the Knight so I can gain a strong Pawn formation in the centre.",
        "22... Nxd5": "Thankyou :o)",
        "23. cxd5 Bb5": "Black is playing a wonderful game of patience, not allowing the pressure that White is inflicting to make a difference in his game Black continues to frustrate, hoping for an opening or a mistake.",
        "24. Qc2 Ne5": "Another nice move, threatening White's f3 Pawn and hoping to disrupt the nice chain White has constructed.",
        "25. Qc3 Nc4": "Forces the White Bishop off his pedestal.  I don't mind, I was intending on moving him shortly.",
        "26. Bf4 Qd8": "A shame, after all of Black's careful play it comes to a small mistake.  This gives up the Bishop.  Best move I can see is 26...Na5 27.b4 cxb4 28.Qxb4.",
        "27. a4 Bxa4": "No real choice.  Note, no good is 27...Bd7 which follows 28.Bxd7! Qxd7 29.Qxc4, winning the Knight and Bishop for a Bishop.",
        "28. b3 Bxb3 29. Qxb3 b5": "I think I'd have gone with Nd6 instead.  The Pawn was well defended where is was, so I see no need to have moved it.",
        "30. d6": "Beginning my attack run, hoping the pressure of having passed Pawns approaching the back rank forced my opponent into an error.",
        "30... Nb6 31. e5 c4": "Again, clever move.  Once more Black frustrates his opponent, forcing a move that slows the advance of the two central Pawns.",
        "32. Qb2 Qa8": "Obviously hoping to delay the match, intending to sacrifice a Rook to stop promotion rather than a Queen.  However, a poor move showing the pressure has finally got to my opponent.  I believe 32...Nd7 to be the best, following the line 33.e6 fxe6 34.Bxe6+ Rxe6 35.Rxe6.",
        "33. d7": "Black's best chance for delaying a mate is to take the Pawn with his Knight.",
        "33... Rd8": "Which he misses.",
        "34. e6": "Baiting Black, hoping to bring my Bishop into the attack.",
        "34... fxe6": "Thankyou again :o)",
        "35. Bxe6+": "During analysis, spotted mate in 11 - 35.Bxe6+ Kh8 36.Bxh6 Raxd7 37.Rxd7 Rxd7 38.Bxd7 c3 39.Qxc3 Qf8 40.Bxg7+ Qxg7 41.Re8+ Kh7 42.Bf5+ Kh6 43.Re6+ Kh5 44.Qxg7 a5 45.Qg6#.  Not as pretty as what was to come.",
        "35... Kf8 36. Bd6#": "A wonderful game!  A lesson to everyone playing a stronger opponent, frustration tactics can work extremely well.  I'll remember that next time I play against someone stronger than myself. :o)"
    },
    "url": "https://gameknot.com/annotation.pl/game-number-18-schupperts-second-attempt?gm=27834",
    "gameName": "Game Number 18 - schuppert's second attempt",
    "players": "freddz123 (1855) vs. schuppert (1458)",
    "opening": "English opening (A20)"
}