{
    "moves": {
        "1. e4 c5 2. Bc4 e6 3. d4 cxd4 4. Qxd4 Nc6": "The previous game against a different opponent, I hung a minor piece by pure Tom foolery. I didn't want to make that mistake.",
        "5. Qd1 Nf6 6. Nc3 Bb4 7. Nge2": "? This loses a pawn without just compensation",
        "7... Nxe4 8. O-O": "I decided to castle and live without the pawn. Alas. His sacrifice will hopefully help the game.",
        "8... Nxc3 9. bxc3": "!? Nxc3 is expected but does not gain a tempo like this move does. White does disrupt his pawn structure though.",
        "9... Be7": "Bc5 was also worth considering. Ba5 is a mistake due to 10. Ba3.",
        "10. f4": "!? White opens up the king side, hoping to attack black's soon to be castled position.",
        "10... d5": "Gaining tempo.",
        "11. Bd3 O-O 12. Ng3 a6": "This may have been a waiting move but it does not seem to do much. White must be wary of the Qb6+",
        "13. f5 e5": "This begins an odd, non forced, combination aimed at black's king.",
        "14. Nh5 f6": "The idea is if 14. ... e4 15. Qg4 g6 and the position is unclear. White would not have lost a piece at that point and would have weakened black's kingside.",
        "15. Qg4 g6 16. Qg3": "Necessary as fxg6 is a mistake due to Bxg4",
        "16... g5": "fxg6 e.p. is not possible now. This is the point that I really scratched my head looking for a way to continue the attack.",
        "17. h4": "Seems to be the only way.",
        "17... Kh8": "I was hoping for Qb6+ . This would have removed the black queen from the kingside. My opponent knew better though.",
        "18. hxg5 e4": "Finally, it is time to block the white bishop. This bishop hangs for 7 moves, before it moves away!",
        "19. g6": "! This pawn must be addressed. If 19. ... exd3 20. g7+ Kg8 21. gxf8=Q++ Kxf8 22. Bh6+ Kf7 23. Qg7+ Ke8 24. Qg8+ Kd7 (not 24. ... Bf8 25. Qxf8+) 25. Qe6+ Kc7 26. Bf4+ Bd6 27. Qf7+ Qe7 28. Qxe7+ Nxe7 29. Bxd6+ Kxd6 30. cxd3  and black can only defend the f6 pawn with Ng8, which ties up the knight, or Ke7 followed by Ne5 to interpose white's Rae1+. This should leave black passive and down the exchange. I didn't compute this far in the Blitz game. Just now I did this in my head since I didn't have a board handy so...take the proposed line thoughtfully, and look for better moves.",
        "19... hxg6 20. Qxg6": "Qg7# is the threat. As is Bh6",
        "20... Rf7": "! The only move",
        "21. Rf4": "?? I completely missed that the rook was hanging and looked for a checkmate! Arg! Taking the rook results in a winning position! I guess I was so focused on the king that I missed this. Black cannot even take the bishop after his rook is taken since Qg7# is threatened. ",
        "21... Rh7 22. Rg4": "This isn't exactly winning. Funny that my bishop is still hanging though. I was really considering following up with 23. Bh6 to finally crash through with 24. Bg7+. Note, 23. ... Bf8 fails to Qg8#. However, the following move caught me by surprise.",
        "22... Ne5": "! This does not look so good for white.",
        "23. Qxh7+": "Qg8+ was also an option, but I felt like this had better chances, especially since the black king is still trapped without cover.",
        "23... Kxh7 24. Rg7+ Kh8 25. Be2": "Now I was really expecting Qb6+. We were both running short on time (especially me).",
        "25... Bxf5 26. Bh6 Bf8": "I lose a minor piece if I retreat the rook. I decided to keep the game complicated.",
        "27. Rf1": "If 27. ... Bxg7 28. Bxg7+ Kh7 29. Rxf5.",
        "27... Bh7 28. Rxf6": "At this point, I decided I was lost and it was time to make the game as intimidating as possible. Black has a win here with 28. ... Qxf6! 29. Nxf6 Bxg7 and black should win.",
        "28... Bxg7": "This is not as good.",
        "29. Bxg7+ Kg8 30. Re6": "I am pretty much reduced to a paper tiger with mostly empty threats at this point. However, this is a blitz game and the best judgement is not always used. ",
        "30... Nf7": "! This solidifies black's position.",
        "31. Bg4 Qe8": "?? I am unsure if this was a miss click or if black really wanted to get rid of my rook and simplify. ",
        "32. Rxe8+ Rxe8 33. Nf6+": "The only way to equalize.",
        "33... Kxg7 34. Nxe8+ Kf8": "I think white is slightly better at this point due to the black bishop being slightly bad and the black pawns being defenseless. However, white's separated pawns are a big weakness.",
        "35. Nc7 Ke7 36. Nxd5+ Kd6 37. Nf6 Bg6 38. Kf2 Ne5 39. Be2 Kc5 40. Ke3": "?! This opens white up to a check, but gains a second black pawn.",
        "40... Nc4+ 41. Bxc4 Kxc4 42. Nxe4 b5": "If I can get black to trade his bishop, I may have a win here. ",
        "43. g4": "a3 is worth considering here. ",
        "43... a5 44. g5 b4 45. cxb4 axb4 46. Nd2+": "? This doesn't win. I think a win is lurking here for white, but I clearly missed it.",
        "46... Kc3 47. Nb3 Kxc2 48. Kd4 Kb2 49. Kc4 Kxa2 50. Kxb4": "And the position is drawn. I tried to see if my opponent would blunder but it became clear the game was a draw. The next moves are not particularly important.",
        "50... Kb2 51. Nd4 Kc1 52. Kc5 Kd2 53. Kd5 Ke3 54. Ke5 Bh5 55. Nf5+ Kf3 56. Nh6": "This delays the king from attacking the pawn.",
        "56... Bg6 57. Kf6 Bh7 58. Kg7 Bc2 59. Kf6 Bh7 60. Ke5 Kg3 61. Kf6 Kh4 62. Nf7 Kh5 63. Ne5 Bb1 64. g6 Bxg6 65. Nxg6": "1/2 - 1/2"
    },
    "url": "https://gameknot.com/annotation.pl/gameknot-blitz-http-gameknot-com?gm=51024",
    "gameName": "GameKnot Blitz, http://gameknot.com/",
    "players": "coolistdude  vs. yulia74 ",
    "opening": "Sicilian defence (B20)"
}