{
    "moves": {
        "1. e4 c6 2. Nf3 d5 3. exd5 cxd5 4. d4 Nf6 5. Nc3 a6": "This was a tough game, and very evenly matched.",
        "6. Bf4 Bf5 7. Bd3 e6": "White takes the bishop, clearing the file and giving me a stronger hold on e5.",
        "8. Bxf5 exf5 9. O-O Nc6 10. Re1+ Be7 11. Ne5": "White begins an attack already.",
        "11... O-O 12. a3 Re8 13. Qd3 Ne4": "Might as well take advantage of e5.",
        "14. Nxe4 fxe4": "White exchanges, and my pawns are connected again, in the center, and with an attack on the Q.",
        "15. Qc3 Rc8 16. Nxc6 Rxc6 17. Qg3": "Pesky bishop.  ",
        "17... Rxc2 18. Qb3 Rc6 19. Qxb7 Rb6": "White takes the pawn back.  I tried to trap his queen in the corner.",
        "20. Qa7 Bd6": "White exchanges the bishops, and gets quite frisky with the rooks.",
        "21. Bxd6 Qxd6 22. Rac1 Qf6 23. Qd7 Rd8 24. Rc8": "I'm still trying to get that pesky queen, or at least to chase it back out.  White is having none of it and is being quite aggressive.",
        "24... Rb8": "Might as well join the fray.",
        "25. Rec1 h6 26. Rxb8 Rxb8 27. Rc8+ Rxc8 28. Qxc8+": "We're down to queens and pawns.  I felt the outcome would be even and tenuous.  However white declined my offer of a draw.",
        "28... Kh7 29. Qc5 Qf5 30. h3 e3": "Might as well get some action going.  I'm attempting to gain the initiative, by attacking his king and gaining some pawns.",
        "31. fxe3 Qb1+ 32. Kh2 Qxb2 33. Qxd5 Qxa3 34. Qf5+": "White is having none of my plan, and now has a clear pawn in the center.",
        "34... Kg8 35. Qc8+ Kh7 36. Qe8 Qd6+ 37. g3 Qe6": "Again I offer a draw.  White declines.  ",
        "38. Qa4 Qxe3": "I can easily draw here, but feel I can win and decide to go for it.  ",
        "39. Qc2+ g6 40. d5": "Whoops ",
        "40... a5": "I should have gotten the king over first, then pushed the pawn.",
        "41. d6 Kg8 42. d7": "It's not looking good.  My game is in dire straits at this point.",
        "42... Qb6 43. Qd2 Qd8 44. Kg2 f5 45. Qd5+ Kf8": "Somehow my position has improved.  I feel white has a clear win here but manage to keep him away.",
        "46. Qd6+ Kf7 47. Kf2 a4": "I try to shake him up with a push of the pawn and it works.",
        "48. Qc6 Ke7 49. Qxa4 Qxd7": "Whew, back in the game with a slight advantage.",
        "50. Qh4+ g5": "Even again.  I decide to go for either a definite win or a draw.",
        "51. Qxh6 Qd4+": "A trap becomes clear, if only I make the right moves, and he doesn't see what I'm doing.",
        "52. Kg2 Qd2+ 53. Kf3": "It's a win, in a very tough game.  I'm glad for the experience with the queens.",
        "53... g4+": ""
    },
    "url": "https://gameknot.com/annotation.pl/game-5-rooks-middle-queens-pawns-endgame?gm=45345",
    "gameName": "game 5 - rooks middle - queens & pawns endgame",
    "players": "noboat (1486) vs. 3253 (1200)",
    "opening": "Caro-Kann defence (B10)"
}