{
    "moves": {
        "1. e4": "I start off with my usual.",
        "1... g6": "I wasn't sure what Nathan would do, but he opts for the Owen's Defense.  I'm now used to it because of ION playing that defense against me followed by Ken, in our training game.  That, of course, was during the midst of being overly critical of openings and defenses from Jack since that's why Ken did that training game.",
        "2. d4": "Unless it's the Domiano's Defense, when black moves his or her pawn just one square on the first move, this becomes my response.  As I want to claim that stake in the center which is also the main theme behind 2.d4  Speed also plays a very important role there.",
        "2... Bg7": "With his last move, I saw this coming due to that nice long diagonal.  In fact, that's often why I fianchetto, at some point.",
        "3. Nf3": "Meanwhile, I continue with my development.  My aim is to castle, ASAP.",
        "3... d6": "I'm not sure why Nathan played this.",
        "4. Bc4": "But, I decide to put pressure on his f7 pawn, and it was for a bad reason.  It was, as noted on my profile, based on why Jack said that the Italian Opening was the main one.  And, I'm about to err again on my next move, as a result since Nathan will play the standard 4...Nf6.  This is actually worse then it appears because, in the long run, this would've cost me, at least, a pawn.  To make matters it's right in the center.",
        "4... Nf6 5. Ng5 O-O": "Having said that, I would've tried to punish white with 5...e5 which is usually good, but Nathan made the right decision.  The reason being is that very similar to what Susan noted in Polgar Chess University, white would, possibly, be able to take away black's right to castle.  But, it gets worse since it would involve liquidating Q's while behind.  And, since Nathan is a R down to start, the thinking is why take a chance.  So, after something like 5...e5, I would promptly play 6.dxe5 forcing 6...dxe5 (for the obvious reason).  And, I, definitely, would've answered with 7.Qxd1+, to do just that.",
        "6. O-O": "Naturally, I do the same just because I enjoy castling early.",
        "6... h6": "I'm about to make an actual mistake here.  And, it's also due to what Jack taught, as noted on my profile.  It's the idea that exchanging as you saw there would be ok for the same reason.  With that, I play 7.Bxf7+? which is going to hurt, in the long run.  If this were played against me now combined with knowing who Jack is, I'd now answer with 7.Nf3  My thinking now is that it doesn't hurt to go back to the first square where I developed my N, although I'm still down a pawn.  But, it's better then exchanging my more mobile pieces for his less mobile one.  So, despite being down a R and liquidating, I believe that this will still leave black better, as his position is more mobile.",
        "7. Bxf7+ Rxf7 8. Nxf7 Kxf7 9. Nc3": "I continue developing.",
        "9... Na6": "As does he.  But, I'm not sure why Nathan put his N on the rim.",
        "10. Re1": "Not seeing the point to his last move, I centralize one of my R's, at once.",
        "10... Kg8": "Bringing his monarch back to it's home square after castling.  I think that this is the right choice since it's still very early.  In doing so, I believe that Nathan's K is safer now.",
        "11. e5": "I prepare to exchange as I was thinking about what my R could do.",
        "11... dxe5 12. Rxe5": "But, I believe that better would've been 12.dxe5, where the N is attacked.  By playing this, my R will be under siege twice, instead.",
        "12... Ng4 13. Rd5": "But, that's why I go after Nathan's Q, instead.",
        "13... Qf8 14. f3": "I then switch gears to his N.  But, instead of retreating, or even attacking with his attacked piece, Nathan will use his e pawn, instead.",
        "14... c6 15. Ra5 Qd8": "Targeting d4 and I have a ready answer since 16.Ra4 was also the equivalent to a conditional move.",
        "16. Ra4 b5": "I thought that this was a blunder and really start going here.  As I figured that Nathan left his Na6 en-prise but forgot that it was protected by his Bc8.  But, he'll do some nasty things before taking my B, starting on his next move.  In return, this will win more material.",
        "17. Rxa6 Bxd4+ 18. Kf1 Nxh2+ 19. Ke1 Bxa6 20. Bxh6 b4": "With that, I got panicked and thought that my position was lost here.  But, Nathan reminded me that I'm still a little ahead since I started a R up, and that's true.",
        "21. Ne4": "Getting out of the attack of course.  But, 21.Ne2 also came into consideration.  I didn't want to exchange Q's which would've been beneficial.  More importantly, however, was my plan to threaten a N fork with 22.Ng4.  But, what he plays next stops me cold in my track.  As now, material is almost level.  Giving him almost everything back, is almost guarantee for Nathan since he's a master.  And, that's based on what I learned with TA's Q sac, when his opponent blunders and lets Joe equalize or come very near it.  But, that's also the consequence of getting reckless and just taking on h6 affiliated with the wrong thought process.  ",
        "21... Bxb2 22. Rb1 Qxd1+": "This also favors Nathan, as well, due to how much more active my Q was then his.",
        "23. Kxd1 Rd8+ 24. Ke1 Bc3+ 25. Nxc3": "I also could've played 25.Kf2 but didn't think about it.  At this point, I was in a hurry, and it was almost time to leave.  So, I didn't give much thought other then the move played which wasn't so good either.  As I willingly, liquidate while behind, but this wouldn't have happened, if I had more time.  Actually, giving little thought, I played that on my next move.  I just had a plan to attack his Nh2 which you'll see my next move.  But, Nathan will stop this on his final move.",
        "25... bxc3 26. Kf2 Nf1": "I could've played on a little longer, but being out of time, I resigned right here.  It was already noon, and I had to get ready for work.  Now, I could've just left it as an unfinished since it would not have been continued, anyhow.  That would've happened against someone near my strength.  But, dealing with a master, being behind, and allowing further liquidation, I decided to throw in the towel here. "
    },
    "url": "https://gameknot.com/annotation.pl/game-3-simultaneous-exhibition-match-2?gm=68040",
    "gameName": "Game 3-Simultaneous Exhibition Match 2",
    "players": "Joe  vs. Nathan ",
    "opening": "Robatsch defence (A41), Rossolimo variation"
}