{
    "moves": {
        "1. Nf3": "White trys a different opening playing Kf3.",
        "1... d5": "good counter by black opening with d5.",
        "2. d3": "white to d3, leaving way for development of his dsb or moving a knight in front of his queen.",
        "2... Nf6": "black brings out a pesky knight to f6.",
        "3. Nc3": "white matches this by bring out his other knight to c3.",
        "3... Bf5": "black comes out with his lsb to f5. ",
        "4. h3": "white is setting up pawn protection for advancing his adjacent pawn to g4. This will have an effect of weakness on king-side castling.\n",
        "4... e6": "black e6 protecting the lsb.",
        "5. g4": "g4 is played to attack lsb on f5.",
        "5... d4": "black moves up pawn more on d-file to d4 attacking whites knight.",
        "6. Nb5": "white has to move knight due to the attacjing pawn.",
        "6... Bg6": "black move lsb back from the pawn attack.",
        "7. Nbxd4 Nc6": "Blk Kc6  developing.",
        "8. Nxc6": "White knight takes black knight on c6.",
        "8... bxc6": " Black pawn takes knight on c6",
        "9. g5": "white move pawn to g5 to shew away the pesky knight.",
        "9... Nd5 10. e4 Nb6 11. Ne5 Bd6 12. Nxg6 hxg6 13. c3 Qe7 14. Qg4 O-O": "Black castles King side.",
        "15. Be3": "DSB moves to e3",
        "15... f5": "Black advances pawn up 2 spaces to pressure whites queen. ",
        "16. gxf6 e.p.": "gxf6 e.p. I was hoping Black would allow me to take this move. En passant (from French: in passing)",
        "16... gxf6": "Black pawn takes pawn f6.",
        "17. Qxg6+": "Queen to g6 Check!",
        "17... Qg7": "Black queen put between her king and the checking white queen!",
        "18. Qh5": "White queen moves back 1 space to h5",
        "18... Na4": "Black knight moves to a4.",
        "19. Bh6": "White DSB to h6 and  attacks Black queen.",
        "19... Qf7": "Black queen backs up 1 space to f7 and looking at white queen on h5.",
        "20. Rg1+": "white rook to g1 to place black in check!",
        "20... Kh7": "King to h7.",
        "21. Qh4": "white queen moves back to h4  from Black queens attack.",
        "21... Nxb2": "Black knight seems lost, not realizing checkmate is soon and white is going to win! Neverless N takes pawn on b2.",
        "22. Bxf8+": "indirect check white moves DSB to f8 Check from queen on h4!",
        "22... Qh5": "Blacks only move is Queen to block the check.",
        "23. Qxh5#": "Checkmate! Q xh5# White never had to castle in this game! Black was up +15 This  game does support the notion that castling is not always the best thing you should do in a chess game. In this game the rook is on g1 on a open g-file."
    },
    "url": "https://gameknot.com/annotation.pl/gameknot-blitz-http-gameknot-com?gm=44589",
    "gameName": "GameKnot Blitz, http://gameknot.com/",
    "players": "redfox17  vs. ben13 ",
    "opening": "Reti (A06), old Indian attack"
}