{
    "moves": {
        "1. e4": "Once more as White I choose to open with the King's Pawn.  This will be the last of these for awhile, since I have recently switched to the English Open in my games at the coffee shop due to there being less lines for me to memorise.  However, I still believe King's Pawn to be the most beneficial opening move for White, allowing you to avoid many types of slow manoeuvring games.",
        "1... c5": "Black responds with the Sicilian, my favourite response to White's e4 opening.",
        "2. Nf3 Nc6": "Both natural development moves, allowing each player to stake a claim on the centre of the board.",
        "3. Bb5": "White moves into the Rossolimo Variation of the Sicilian.  The aim of this is to allow for early castling while still building a strong central pawn structure, something White is often denied in the Sicilian.  When masters play, Bb5 is considered a move aimed at drawing the match but when Black is not prepared or unaware of the theory it can allow for White to gain a considerable advantage.",
        "3... Qc7": "Considered to be \"in book\", I personally don't like it.  I think either e6 or d6 is the preferred move for Black here, attempting to gain an advantage in the centre.",
        "4. O-O e5": "Early castle followed by Black leaving the \"book\" moves for the  Rossolimo (which called for a6 here). e5 is well defended and gives Black a double threat on the unoccupied d4 square - I've always been told that control of the centre is essential for winning a chess match so Black is looking good.",
        "5. c3": "White prepares to play d4.",
        "5... Nf6": "Black threatens the undefended e4 pawn.",
        "6. d4 cxd4 7. cxd4 exd4": "Black wins the exchange in material, creating doubled up passed pawns on the d-file in the process.  White's e4 pawn is still under threat and Black is already up in material.",
        "8. e5": "White moves his e pawn to relative safety, threatening the Black Knight.",
        "8... Nd5": "The Black Knight runs to immediate safety, but. . .",
        "9. Qb3": "White continues the chase and threatens him again.",
        "9... Nce7": "Black moves his Knight to defend the threatened Knight.  I preferred a6 here, threatening the exchange of Knight for Bishop.",
        "10. Bd2 a6": "Black threatens White's Bishop.",
        "11. Na3 Nc6 12. Qxd5 Bxa3 13. Bc4 d6 14. bxa3 dxe5 15. Ng5 Nd8 16. Ba5": "Now White moves to take advantage, first by attacking the Black Queen.",
        "16... Qd7": "And again, Black rushes to move to safety and commits a second mistake, the Hang mentioned in the title.  By moving here, Black hangs his pawn at e5, which White can take and check the Black King.  The furthest I went into the line was to move 23 (17.Qxe5+ Ne6 18.Bb4 Qc7 19.Qf5 Qf4 20.Qxf4 Nxf4 21.Nxf7 Be6 22.Bxe6 Nxe6 23.Nxh8 a5), which puts Black down by a Rook and two Pawns.  I think the move that should've been made is b6, which does sacrifice the Rook but keeps the King safe.",
        "17. Qxe5+": "Pins Black's pawn at g7, forks Black's King and Pawn at g7 and isolates Black's pawn at d4.  White can almost taste victory.",
        "17... Ne6 18. Bb4": "White prevents the Black King from castling and keeps the pressure on Black.",
        "18... h6": "And the final part of the title, Black moves into mate.  At the time I was unaware it was forced mate from here, but it certainly felt good.  During analysis, I discovered from here we're looking at 19.Rfe1 a5 20.Nxe6 fxe6 21.Bxe6 Qxe6 22.Qxg7 axb4 23.Rac1 Qxe1+ 24.Rxe1+ Be6 25.Rxe6+ Kd8 26.Qxd4+ Kc8 27.Re7 Kb8 28.Qe5+ Ka7 29.Qc5+ Kb8 30.Qc7+ Ka7 31.Qxb7#.  If I'm incorrect, please correct me but I'm fairly sure I'm right.  I think the best move was Qc7, with an eye for playing 18...Qc7 19.Qf5 Qf4 20.Qxf4 Nxf4 21.Nxf7 b5 22.Rfe1+ Kd7 23.Re7+",
        "19. Rfe1 hxg5 20. Qxg7 Kd8 21. Ba5+": "I still hadn't spotted a mate, so kept pressure on the Black King instead.",
        "21... Ke8": "But after Black moved Ke8 I finally spotted a lovely little sequence that  led to mate.",
        "22. Qxh8+ Ke7 23. Rxe6+ fxe6 24. Bb4+ Kf7 25. Qf8+ Kg6 26. Bd3+ Kh5 27. Qh8+ Kg4 28. Qh3+ Kf4 29. Qg3#": ""
    },
    "url": "https://gameknot.com/annotation.pl/game-number-9-a-pin-a-hang-and-moved-into-mate?gm=26480",
    "gameName": "Game Number 9 - A Pin, a Hang and Moved into Mate",
    "players": "freddz123 (1585) vs. schuppert (1496)",
    "opening": "Sicilian (B30), Nimzovich-Rossolimo attack (without ...d6)"
}