{
    "moves": {
        "1. c4": "As I've previously stated, I have been advised that while I'm learning to play I should concentrate on learning the English Opening due to there being less lines to learn.",
        "1... e5": "This move opens up the Reverse Sicilian, but as it is White's move it keeps the advantage on White's side.",
        "2. g3": "Allows White to begin his strategy of light coloured square control.",
        "2... Nc6": "Karpov's preferred move.  I prefer Nf6 here.",
        "3. Bg2 Nf6 4. Nc3": "Reversed move order, but position now is the same as Reversed Rossolimo (1.c4 e5 2.g3 Nc6 3.Nc3 Nf6 4.Bg2), expecting Bb4 from Black to continue this.",
        "4... Bc5": "This move blocks White's pawn at c4 and enables the King-side castle for Black.  Could still be considered the Reversed Rossolimo, there is a line where Black moves Bb4 followed immediately by Bc5.",
        "5. e3": "White prepares to play d4.",
        "5... d5": "Attacks White's c4 Pawn and limits the fianchettoed White Bishop.",
        "6. cxd5": "Attacks Black's Knight and wins a Pawn in material.  However, White will now have to deal with the potential doubled up Pawns on the d-file.",
        "6... Nb4": "Defends the Knight.",
        "7. d4": "Weak fork on Black's Bishop and Pawn.",
        "7... exd4 8. exd4 Be7": "After the exchange, White remains up in material.",
        "9. Nge2 O-O 10. O-O": "Both sides castle.",
        "10... Nbxd5 11. Nxd5 Nxd5": "Evening up the material and blocks White's d4 Pawn.",
        "12. Nf4 Nf6": "Think Black should've looked at Nxf4 and exchange the final two Knights.",
        "13. Qd3 c6": "Black releases the pin on his Pawn at b7.",
        "14. Bd2 Qb6": "Threatens White's b2 Pawn.",
        "15. Rfe1 Qxb2": "Too early for Black to take the b Pawn.  15...Qxb2 16.a3 g5 17.Reb1 Qxa1 18.Rxa1 puts Black in a lost position.  I think the best move was Bd6, 15...Bd6 16.b3 Bd7 17.Rac1 Rad8.",
        "16. a3 Rd8": "Black misses the danger evolving here, 16...Rd8 17.Bc3 Qb3 18.Rxe7 Bf5 19.Qxf5 Qxc3.  As shown above, I think the better move was to sacrifice the Queen with g5.",
        "17. Bc3": "Attacking Black's Queen.",
        "17... Qb6": "Not that either move would help by now, but I think the best move was Qb3.  With Qb6, after 18.Rxe7 Black will have to follow up with Qb3.  By moving to Qb3 earlier, 17...Qb3 18.Rxe7 Bf5 19.Qe3 Re8 ?",
        "18. Rxe7": "As expected, White wins a Bishop and goes in front in material again.",
        "18... g5": "There weren't many worse moves that could've been made here.  Black is in too much of a rush to try and even out the material so weakens his King defence at a time when White is aiming for the kill.  18...g5 19.Qe3 gxf4 20.Qxf4 punishes Black, making the game all but over.  My preferred move here? 18...Qb3 19.d5 Bf5 20.Qd2 Rd6 21.Rae1, which pretty much just attempts to buy some time for Black to try and get out of the mess he's in.",
        "19. Qe3 gxf4 20. Qxf4 c5": "At the time of this move, I hadn't been aware that this was Black moving into forced mate.  During my analysis, I spotted 21.dxc5 Bf5 22.Qxf5 Rd6 23.cxd6 Qxd6 24.Bxf6 Kf8 25.Rae1 Qe6 26.R7xe6 fxe6 27.Qxe6 h5 28.Qe7+ Kg8 29.Qg7#.  At the time, I was simply thinking after 21.dxc5, Black could either give up his Queen by playing Bf5 which would give me a huge material advantage leading into the end-game or Black could play Qxc5 and make it mate in 5 (22.Qxf6 Qxf2+ 23.Kxf2 Rd2+ 24.Ke1 Rd1+ 25.Rxd1 Be6 26.Qg7#).",
        "21. dxc5": "Instead, Black admits defeat and resigns.  An interesting game which I thoroughly enjoyed."
    },
    "url": "https://gameknot.com/annotation.pl/game-number-11-too-early-for-the-queen-attack?gm=26640",
    "gameName": "Game Number 11 -Too Early For The Queen Attack",
    "players": "freddz123 (1654) vs. nuntar (1648)",
    "opening": "English opening (A20)"
}