{
    "moves": {
        "1. d4 c6": "I usually choose this response because It allows me to transpose into either the slav defense after white plays c4 (with an immediate d5), or into a modern defense system after e4 If white decides to occupy the center with his pawns.",
        "2. c4 d5 3. Nf3 Nf6": "The Slav defense Breyer Variation with both knights defend the respective queen pawns and controlling the center.",
        "4. Nc3 g6 5. e3 Bg7 6. Be2 O-O": "This is the desired position for black I was looking for when playing this type of system.\nIt is very solid and there are few exploitable weaknesses except for an undeveloped queenside, but how will white try attacking?",
        "7. O-O a6": "This is the desired position for black I was looking for when playing this type of system.\nIt is very solid and there are few exploitable weaknesses except for an undeveloped queenside, but how will white be able to exploit this? (It's worthy to note that white's queenside isn't fully developed either, a weakness that I can try to later exploit!)",
        "8. cxd5": "my opponent told me at this move that he hated this position so he relieves some tension in the center, other options to keep it equal would be c5 closing the position, but leaving the knight immobilized... or Qb3, adding more pressure to the diagonal and pinning the Bishop down to the b pawn.",
        "8... cxd5 9. Qb3": "after I recapture he decides to play it, but the knight on c3 cant really do much after the exchange.",
        "9... Nc6": "developing my queen side in a manner that was only given to me after the critical pawn exchange.",
        "10. Ng5": "This move gets a ?, the only things I could guess were that he was doing here was trying to invoke a weakness on my kingside pawn structure provoking me to play h6 or maybe rerouting the knight to f4 via h3??? Or maybe he was just trying to confuse me! It was around 3:30 am for him though...",
        "10... b5": "not going for the bait, curing my b7 weakness and pushing for some space on the queenside.",
        "11. e4": "e4!? My opponent was probably expecting me to exchange pawns with 10... dxe4 11. Ngxe4 Nfxe4 12. Ncxe4 allowing his knight to make use of the c5 square as an outpost.",
        "11... Nxd4": "Both the Knight on e3 and the pawn on e3 stopped defending this poor pawn, not only that I now threaten his queen and can trade a knight for the light squared bishop.",
        "12. Qb4": "Another mistake by white, falling apart in the position. Qd1 is his only real option.",
        "12... Nxe2+": "This was a blitz game and in retrospect I should have played Nc2 forking the queen and the rook.",
        "13. Nxe2 Bb7": "Developing my bishop and posing the question\"What do you want to do with that e pawn?",
        "14. Nc3": "return to defending with the knight, It might have been better to just exchange or even stronger to push the pawn to e5!",
        "14... d4": "I'll push my pawn, I'd rather take the advantages of a passed pawn in the end game especially If he lets me move a pawn to e5 next turn with a move like Rd1 or a horrible knight move.",
        "15. e5": "So the calculations must begin...",
        "15... dxc3": "I figure that I'll be up in material anyway this goes down, especially because I've got the tempo on him.",
        "16. exf6 cxb2": "my pawn has almost eaten enough of white's pieces to become a queen, white's best choice may be to take with the bishop now, this will however leave him down one more pawn after all the exchanges happen.",
        "17. fxe7": "goin for my queen? Better may was Bxb2, or even fxg7 followed by gxf8=Q (the line i was thinking might happen.)",
        "17... bxa1=Q 18. exd8=Q Raxd8": "The highly awsome queen teleport move completes and leaves me a rook up in material after the exchanges because white hasn't developed his bishop on the queenside. This shows that you should try to develop all your pieces, before its too late!",
        "19. Bb2": "Too late.",
        "19... Qxb2": "White resigns after this position. Hope you've enjoyed the game!"
    },
    "url": "https://gameknot.com/annotation.pl/gameknot-blitz-http-gameknot-com?gm=35880",
    "gameName": "GameKnot Blitz, http://gameknot.com/",
    "players": "n3wbm4n (1200) vs. johnjarvinen (1940)",
    "opening": "Queen's pawn (A40)"
}