{
    "moves": {
        "1. e4": "...",
        "1... e6 2. d4 d5 3. Bd3": "Not good according to theory, because this gives black a lead in development.\r\n",
        "3... dxe4 4. Bxe4 Nf6 5. Bf3": "Another play by the same piece.",
        "5... c5": "Attacking whites center, before playing Nc6",
        "6. Ne2": "This night would have been better places on f3, but alas that field is occupied",
        "6... Nc6 7. dxc5": "In the hope possibly of some relive after the exchange of the Queens, without which the offensive will be much less dangerous. However black is gaining a decisive lead in development.\r\n",
        "7... Qxd1+ 8. Kxd1 Bxc5 9. Bxc6+": "White should have accepted the loss of the pawn or maybe played Rf1.\r\nAfter this move Blacks lead in development becomes way to strong.",
        "9... bxc6 10. f3 Ba6": "Pinning down whites king",
        "11. c3": "An airhoe, but is if of no use, because of the of the king must protect Ke2",
        "11... O-O-O+ 12. Ke1 Rd7": "White is in serious troubles, soon blacks rooks and bisshop will have his king in a death trap.",
        "13. Bg5 Nd5": "Not allowing white some relieve by exchanging of another piece.",
        "14. Nd2 f6 15. Ne4": "White problems become clear, Bh4 fails because of Ne3+\r\nAt this point white starts paying well though, often finding a way out where no rescoue seems possible anymore.",
        "15... Bb6": "No way black is going to surrender such a storngly plaves bisshop.",
        "16. Bd2 Rhd8": "Blacks bisshops and rooks have combined into a deadly force.\r\nNote how black manages to combine all his pieces and have them work together in harmony.\r\n\r\nAnother problem for white is how he gets almost no chance of putting his rooks into play.",
        "17. b3": "Hoping to hemm in the bisshop on a6, but it does nothing to get his rooks into play. ",
        "17... f5 18. Ng5 Nb4": "The tactical trickery has started. \r\nAfter 19.cxb4, Rxd2; blacks has succesfully stormed the white castle.\r\nIn fact that would win a piece because the white kight cannot move the knight on e2, on penalty of checkmate with Bf2#\r\n\r\nHere the enormous strength of the combination of bisshops and rooks becomes apparent.",
        "19. Nd4": "The only move",
        "19... Nc2+": "But still they come!",
        "20. Nxc2 Rd7xd2 21. Nd4 Rxg2": "Black now has a rook on the 2nd row, combined with those the two nisshops this is still deadly.\r\nTaking control of the second rows also stop white from getting his rooks into play.\r\n\r\nHowever is would have been better to out the rook out of harms way with 21...Rb2;\r\n\r\n",
        "22. Ngxe6 Re8 23. Kd1 c5": "With the expectation of winning a pice, but white has some tricks up his sleeve still.\r\nThe two knight play well together.",
        "24. Nf4 Rf2": "I was now hoping for 25.Nh3, cxd4?!; 26. Nxf2, dxc3; 27.Nh3, Re2;\r\nThis creates a world of danger for white, and the dangerous pawn on c3 compendsates for the loss of the exchange.",
        "25. Nde6 Bb7": "A new trick, since there is nothing to be gained on the a6-f1 diagonal.",
        "26. Rg1 Bxf3+ 27. Kc1": "I think Ke1 would have been better. On c1 the King get caught in a net wich will lead to checkmate",
        "27... c4": "Reopens the diagonal. The loss of a pawn is of no importance.\r\nIn fact the immediate threat is Be3+, Kb1, Be4 checkmate",
        "28. Re1 Rxh2": "Freeing the field for the bisshop, putting the rook safwe, and preventing a future Nh3, threatening h6 and g5.\r\n\r\nAnother thought here is that if the attack would stall, then at the pawn formation garantees victory.\r\nHow would white stop them from marching south?\r\n\r\nBut white has to face more immediate threats against his king first\r\n",
        "29. b4": "bxc4 was needed, to create room for the Night on d3",
        "29... Bf2 30. Re5": "The rook must keep protecting e3 on penalty of checkmate.",
        "30... Be4 31. Rb5": "The only solution was Rxe4, sacrificing the exchange.\r\nNow the rook is out of play, and the white king has lost his last protector",
        "31... Be3+ 32. Kd1 Bf3+": "White surrendered as checkmate follows on the next move."
    },
    "url": "https://gameknot.com/annotation.pl/game-913?gm=30553",
    "gameName": "Game 913",
    "players": "cupido (1700) vs. eduard352 (1846)",
    "opening": "French (C00), Schlechter variation"
}