{
    "moves": {
        "1. d4": "A blitz game. My opponent had a higher rating, around 1700. I did not expect to win.",
        "1... Nf6": "Going for the Nimzo-Indian defence",
        "2. Nf3 g6 3. c4 d5": "I had no clear ideas here. I just thought of going for something sharp.",
        "4. c5 Bg7": "Carrying on with normal development",
        "5. Nc3 c6 6. b4 a6 7. a4": "White is clearly going for a pawn attack on the queen side. At this stage, I decided to leave off trying to counter this, and switch attention to normal development on the king side.",
        "7... O-O 8. Bf4": "Good occupation of the diagonal.",
        "8... Nbd7 9. b5 axb5 10. axb5 Rxa1 11. Qxa1": "The queen now has control of the a file, and is contesting the long diagonal. He is on the way to having a spatial advantage on the queen side, but to compensate, black has developed a solid defense on the king side.",
        "11... Re8": "Creating space for the knight.",
        "12. b6 Nf8 13. Bc7": "Only one place to retreat.",
        "13... Qd7 14. Ne5": "It now looks like white is developing a threatening attack, but the black defensive structure is solid.",
        "14... Qe6": "Primarily defending f7, but also looking at white king",
        "15. e3": "Completing the pawn chain and opening the file for white bishop",
        "15... Ne4": "At this stage, the knight is the only piece I wanted to move, keeping the king side structure solid and stable.",
        "16. Be2": "Preparing to attack the queen",
        "16... Qf5": "Looking at Qf2#",
        "17. O-O Nd7": "A blunder, I think. The knight was alright where it was, but hard to see what would have been a better move.",
        "18. Bg4": "Strong check to the queen, winning the knight. I considered resigning.",
        "18... Qf6": "Just moving out the way, but moving to a useful square.",
        "19. Bxd7 Bxd7 20. Nxd7 Qf5": "Moving to safety, and checking the knight.",
        "21. Ne5 Nd2": "The move I should have played earlier, I think. Again, the king side structure is solid. It appeared that there was no piece there which could be moved without creating a weakness. Only the knight was free to move. Here it would move the castle, then move back, threatening check. Just messing around, really.",
        "22. Re1 Ne4 23. Nf3": "Defending f2, but creating space for the e5 push",
        "23... e5": "Bringing the castle into the game",
        "24. Nxe5": "Queen will win back the pawn with tempo",
        "24... Qxf2+ 25. Kh1": "I was running out of time. I think I had a little over a minute, whereas white had around five. Nothing to do but to move back.",
        "25... Qf5": "Rf1 maybe? But instead...",
        "26. Nf3": "Hard to see the point here.",
        "26... Nf2+": "Again, just messing around. Again, it seems that this knight is the only piece which can move. All the others are keeping the defensive balance.",
        "27. Kg1 Ng4": "Attacking e3, the base of the pawn structure. Black has kept tempo, dictating the pace of the game, and preventing Qa7.",
        "28. Re2": "Planning to double up with the Queen? But the pawn is still underdefended.",
        "28... Rxe3 29. Rxe3 Nxe3": "Although behind in points, black has compensated with tempo.",
        "30. Qa8+": "Easily defended, losing the pawn though.",
        "30... Bf8 31. Qxb7 Qc2": "All of a sudden, things are looking dangerous for white. There is no way to save the knight, but more dangerous is the threatened mate on g2, which white appears to have overlooked.",
        "32. Nxd5 Qxg2#": ""
    },
    "url": "https://gameknot.com/annotation.pl/gameknot-blitz-http-gameknot-com?gm=68512",
    "gameName": "GameKnot Blitz, http://gameknot.com/",
    "players": "willyvw  vs. jaybalaram ",
    "opening": "King's Indian (A48), East Indian defence"
}