{
    "moves": {
        "1. e4 c5": "The Sicilian. An opening I love and had use to beat him on multiple occasions",
        "2. Nf3 d6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 a6": "The Najdorf which is my favourite Sicilian variation. I have used it to beat him a lot. No wonder he wanted to use it",
        "6. Bg5": "Probably the most popular line",
        "6... e6 7. f4 Be7 8. Qf3 Qc7 9. h4": "I deviate from the book. Not 9. O-O-O",
        "9... b5": "He starts his Q-Side pawn storm",
        "10. g4 Bb7 11. O-O-O h6": "Forcing an exchange",
        "12. Bxf6 Bxf6 13. Bd3": "Developing the last minor",
        "13... Nd7 14. g5": "Trying to force an exchange down the h-file",
        "14... Be7 15. Kb1": "Stops 15... d5 16... Ba3 17. bxa3 Qxc3",
        "15... e5": "attacking the strong e-h pawn island and d4 Knight",
        "16. Nb3 exf4 17. Qxf4 f6": "Trying to end the k-side attack",
        "18. Nd5": "I had thought of the dubious 18. e5 exchange sac but after ...Bxh1 19. Bg6+ Kd8 20. Rxh1 dxe5 21. Qd2 hxg5 22. Be3 Rc8 23. Nd5 Qd6 24. Nxe7 Qxe7 25. Bb7 Rc7 26 Bxa6 which sacs the exchange but loses a pawn as well and after 26... Rxh4 27. Rxh4 gxh4 Black has 4 passed pawns and these out weigh blacks king being stuck in the center.",
        "18... Bxd5 19. exd5 hxg5 20. hxg5": "allows the rook exchange down the h-file",
        "20... Rxh1 21. Rxh1 O-O-O": "Removes the chance of an attack on h8",
        "22. g6": "The only way to save the pawn",
        "22... Nc5": "Wanting exchange knights and try and tie the rook to the back rank",
        "23. Bf5+": "This means the king must move closer to the corner and is not as well defended",
        "23... Kb7": "Moves toward the d-pawn",
        "24. Nxc5+ Qxc5 25. Rh7": "Tries to tie the bishop to the back ran and stop the rook's movement",
        "25... Bf8": "Qfg1+ falls to Qc1 when if Q's are exchanged white bishop and 3 on 2 pawn Q-side pawn majority wins",
        "26. b3": "Provides and escape route for a back rank attack",
        "26... a5": "pawn storm continues",
        "27. a3 a4 28. b4 Qc4": "offers to exchange Q's and free White b-pawn",
        "29. Qxc4 bxc4 30. Kb2 Kb6 31. Kc3 Kb5 32. Rh8 Be7": "Offers to exchange rooks and free the Bishop",
        "33. Rxd8 Bxd8 34. Kd4 Kb6": "?? Gives up the c-pawn and means White can win through pawn majority. Better was Bb6+ were black can force draw by three fold or make white lose d-pawn",
        "35. Kxc4 Ka6 36. Kd4": "Freeing the c-pawn's advance",
        "36... Bc7": "A time-wasting move",
        "37. c4 Bb6+ 38. c5 dxc5+ 39. bxc5 Bd8": "Black is lost with passed c and d pawns white will win",
        "40. d6": "Beginning the advance",
        "40... Kb7 41. Kd5 Ka7 42. c6 Kb8 43. c7+": "Now Queen on d8",
        "43... Kb7 44. cxd8=Q": "Black resigns after losing a game in a drawn position"
    },
    "url": "https://gameknot.com/annotation.pl/game-1?gm=38282",
    "gameName": "Game 1",
    "players": "thedessertfox  vs. Friend ",
    "opening": "Sicilian (B98), Najdorf variation"
}