{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Bc4 h6 4. d4 d6": "A bit passive.",
        "5. d5 Nb4": "I was expecting 5. ... Na5 followed by 6. ... b6.",
        "6. Bd2": "I was hoping for 6. ... a5",
        "6... Na6": "Nc5 will certainly be a thorn in white's side if he cannot get rid of the knight. So far so good though as white has a lead in development.",
        "7. O-O Bg4 8. Bb5+": "Just to break the pin on the knight.",
        "8... Bd7 9. Bxd7+": "It seems best to take as retreating allows the pin. Also, this is my bad bishop and his good bishop with the current pawn structure. I didn't want to take the knight with the bishop since he could plant his bishop on b5 and cause minor irritation.",
        "9... Qxd7 10. c4": "Preventing the queen from getting to b5",
        "10... Nc5": "Expected. Kingside development is good too though.",
        "11. Qc2": "Defending the pawn and prevent Nd3.",
        "11... Nf6 12. Nc3 a6": "?? This loses the knight. b6 was better to provide an escape square.",
        "13. b4 Ncxe4": "13. ... Na4 was another possibility",
        "14. Nxe4 Be7 15. Rfe1 Ng4": "Somewhat pointless",
        "16. h3 Nf6 17. Bc3 Nh5": "Getting the knight to f4 is good. Black should probably castle though or push f5 and storm my knights",
        "18. Rad1 O-O": "f5 is still a good option.",
        "19. Bd2": "The bishop shuffling by white seems to be a waste of time.",
        "19... b5 20. c5": "This is better since my d pawn cannot be taken. Try to find why.",
        "20... dxc5 21. Nxc5 Qd8 22. Nxe5": "This is a good position for me as I have plenty of attacking options. I think his best move is Bxc5 to take off the second knight.",
        "22... Qxd5": "?? Find white's best move!",
        "23. Bxh6": "! Where can black's queen safely move? There are other bishop moves by white that trap the queen.",
        "23... Qxd1 24. Qxd1": "Better to take with the queen to threaten the knight.",
        "24... Nf6 25. Bg5": "At this point, black timed out. It was a good game though. Thanks for watching."
    },
    "url": "https://gameknot.com/annotation.pl/gameknot-blitz-http-gameknot-com?gm=52281",
    "gameName": "GameKnot Blitz, http://gameknot.com/",
    "players": "coolistdude  vs. eldestpabs ",
    "opening": "King's pawn game (C50)"
}