{
    "moves": {
        "1. Nf3": "Here I am playing as black, which I am still not very good at. This is probably the ugliest game I have played to date. Though, my awkward play on this game may have caused a bit of confusion for my opponent. At the time of this game his score was not 1555 due to his timeouts, but 1555 is his score at this time. Please feel free to comment. I know if I played him again he would probably do 1000 things different. I should have lost this one. ",
        "1... h6 2. Nc3 a6": "My pawn moves may look like wasted moves, but to me they are keeping those pesky knights from advancing. This is the first time I have ever opened up my game like this and it was the last. ",
        "3. e4 e6 4. Bc4 d6 5. d3 b5 6. Bb3 e5 7. Bd5 c6 8. Bb3": "Although I have no pieces developed I feel my rapid queen side pawn development stops his knight from advancing, and temporarily makes it difficult to attack.  ",
        "8... Bg4 9. h3 Bxf3 10. Qxf3 Nf6 11. Be3 Nbd7 12. a4 b4 13. Ne2 a5 14. O-O Be7 15. Bxf7+": "I'm not sure why he did this maybe someone else can see the point in sacrificing a bishop for a  pawn. ",
        "15... Kxf7 16. Ng3 g6 17. h4 g5 18. h5 Qg8 19. Nf5 g4": "This is a pretty awkward situation. Now I am regretting to have developed my pieces. My King is out in the open and I don't feel I have enough pieces to adequately provide the pressure needed to stay on the attack. ",
        "20. Qe2 Nxh5 21. g3 Bg5 22. Nxd6+ Ke6": "Now I am in trouble. the only thing I can hide behind is one single pawn. ",
        "23. Qxg4+ Kxd6 24. Qxh5 Rf8 25. Qe2 h5 26. Kg2 h4 27. g4 Nf6 28. f3 h3+ 29. Kh2 b3 30. c4 Bxe3 31. Qxe3 Nxg4+ 32. fxg4 Qxg4 33. Rfg1": "This game just keeps getting uglier by the minute. Point wise we are even, but my pawns are all singles, which means pretty much dead if he plays his pieces right. ",
        "33... Rf3": "What the hell. Lets trade at least I will have lined my rook up with pawns d3 and e4.",
        "34. c5+ Ke6 35. Rxg4 Rxe3 36. Rd1 Re2+": "Now I feel I have some breathing room. ",
        "37. Kh1 Rxb2 38. Rg6+ Kd7 39. Rg7+ Kc8": "I feel like I am in a rap song. Back that king up, Back that king up. ",
        "40. Rdg1": "Apparently, we are about to exchange rooks. I am not to worried because I have a pawn just 2 moves away from being a Queen. ",
        "40... Rc2 41. Rb1 b2 42. Rgg1 Rf8 43. Rge1": "I am feeling a little better now, I definitely have the advantage heading into the end of this game despite having all of my pawns strolled out everywhere. ",
        "43... Rff2 44. d4 exd4 45. e5 d3": "He resigned at this point. I do not see anyway that he can stop me from advancing at least one pawn across. No dought, this was an ugly game, but I guess I had luck on my side. "
    },
    "url": "https://gameknot.com/annotation.pl/game-won?gm=18530",
    "gameName": "Game Won",
    "players": "Someone (1555) vs. rtaylor7796 (1275)",
    "opening": "Reti opening (A04)"
}