{
    "moves": {
        "1. e4": "[Event \"GameKnot Blitz\"]\r\n[Site \"http://gameknot.com/\"]\r\n[Date \"2010.08.13\"]\r\n[Round \"-\"]\r\n[White \"cherise\"]\r\n[Black \"baronderkilt\"]\r\n[Result \"0-1\"]\r\n\r\n1. e4 d5 2. exd5 Nf6 3. c4 c6 4. dxc6 Nxc6 5. b3 Bg4 6. Be2 Qd4 7. Nc3 O-O-O 8. Bxg4+ Nxg4 9. Qf3 Nce5 10. Qg3 Nd3+ 11. Kd1 Ngxf2+ 12. Kc2 Nb4+ 13. Kb2 Nfd3+ 14. Ka3 Nc2+ 15. Ka4 Qb6 16. Nb5 Nc5# 0-1\r\n",
        "1... d5": "2...d5 is commonly called the Scandinavian Defense now. Formerly it was often referred to as The Center-Counter Defense. I feel it is an excellent choice for blitz play since WT must play precisely to keep an advantage, which should then be a small one. Granted that some small inaccuracy will probably not damage WT to the point of losing, as in more volatile Defenses such as the Dragon Sicilian. At the same time, BL faces less tactical risk here but still has some chances to mix-it-up with tactics. These may often result in positions resembling a Caro-Kann; or strangely, similar to a Goring Gambit Reversed(!) when the ...c6 gambit line is accepted, as we see in this game. If the ...c6 gambit is offered but declined, than it may well transpose to a line of the Panov-Botvinnik Attack of the Caro. ",
        "2. exd5": "exd5. What else?! While 2. e5 is certainly playable, the disadvantages for gaining that bit of space are: #1 Unlike a French Defense, BL can still develop his Bf5. #2 WT does not yet have a supporting pawn chain for the move, such as d4, that BL could prevent by 2...d4 himself, or he can immediately start to play against WT pawns being placed at e5 & d4 by 2...c5 now. Finally #3, WT used a tempo to push ahead to e5. We could also say a fourth thing being that BL gets a clearly defined game strategy against 2.e5, which will cost him some space but gives WT little chance for unexpected tactics. ",
        "2... Nf6": "I prefer 2....Nf6 here over Qxd5 since it keeps more options. And it also permits WT to play 3.c4!? or 3.Bb5+ , both of which I dearly enjoy to play against. Vs the Bb5+ I usually play the mainline of ...Bd7, but find ...c6 an acceptible alternative for blitz play. Had WT played differently then the responses possible are largely why I defer 2...Qxd5. I do like the transposing Q capture vs 3.Nf3 or especially 3.d4 since the latter can put BL in a bit of a cramp later if he has played Nxd5 before Nc3 has been played. ",
        "3. c4": "Oh, excellent ... I love to see this move from WT. Like the similar position, with colors reversed, in a Scotch/Goring Gambit, my object will be to expose a great gaping hole on the 4th rank of the opponent's d-file. If only he will Accept my offer . . . ",
        "3... c6": "The offer ... to put him a clear pawn ahead.  \"A pawn is a pawn\" , someone once said. I'm not sure who (likely Legions have), so let us try another one; \"The only way to refute a gambit is to accept it.\" GM Larry Evans. I'm not absolutely certain he used the word \"only\" tho.",
        "4. dxc6": "Accepted~! O.K. ... all that's left is to Refute me",
        "4... Nxc6": "The move 4. ...e5 here is quite interesting and entertaining here when 5.cxb7 Bxb7 is played; and it usually wins in my blitz games. I was introduced to it by a blitz opponent and tho I won that one, it required all my alertness toward the task of surviving. And so I put it on my own list to try out. That is a large part of my philosophy about opening choices/moves/variation. I figure that if it gave Me enough trouble, then it is worth seeing how others will fare with it. In other words, if they are not just a clearly better player than I, then they will have a heavy task set before them. I believe this is much the same stance taken by GM/WC Mikhail Tal in pursuit of his own tactical combinations. If He cannot find a refutation of his own sac/combination/continuation , then he defies the opponent to be a superior analyst. And THAT is not going to happen often to a Mikhail Tal. But, if You or I did so, yet lost ... well then we know how to handle that line the next time it gets played against us. So a Win situation even if a loss is taken~! ",
        "5. b3": "Now he weakens the entire a1-d4 diagonal, and exposes an undefended piece to possible attack; namely his Rook. For Tactical students; you now have more than 3 significant \"Tactical Elements\"  [aka \"Factors\"]  in the WT position, even before move 6~!!  In other words, you might say WT is \"asking for trouble\", so eyes wide open for your chances. The Elements: (1.)BL is +2 pieces ahead in development and maybe 3 since it is his move. (2.)WT \"hole\" on d4, which may be permanent, & (#3)Hole on d3, likely temporary, but becomes a backward pawn if he puts one there and still leaves d4 for BL to outpost on. (4.)The entire diagonal thru a1 is open. #5) The Ra1 is totally unguarded. Elements present now, but less important at the moment: Half-open c&d files(for BL) & e-file (for WT). Also f2 is hard to defend. ",
        "5... Bg4": "Normally I would look to 5... e5, 5...Bf5, or 5...Qd4 as Candidate Moves. The first ...e5 is much \"my style\" yet preceeding an e-pawn move with ...Bf5 seems objectively better. But I want to see how he handles Bg4 since a number of replies are bad for WT, and I will end up with another piece developed, irregardles. If asked which is the worst reply for him: f3, Ne2, Nf3, or Qc2 I would be hard pressed to pick one as worst, and would enjoy playing against all of those quite a lot. ",
        "6. Be2": "Be2 must be best. Here I could reply ....h5 or ...Bf5 also, but the latter is something of an \"admission\" that suggests I should have put it there the prior move, and saved a tempo. Of course that is Right, but . . . ",
        "6... Qd4 7. Nc3": "If instead he captured Bxg4 I planned 7...Nxg4 to make his choise between defense of f2 or a1",
        "7... O-O-O 8. Bxg4+ Nxg4": "The alternatives of 9.Nh3 or Qe2 both Seem better. (After Qf3 Ne5 gains tempo. Yet Qe2 has a definate problem that shows up later)  Notice WT weaknesses on a1, c2, d3, d4, f2 as well as his lag in Development and King Safety. Factors/Elements. Also the d-file. Still 5...Bf5 looks better to me all the time. For Bg4 did trade off a pair of pieces, which usually the Attacker does not wish to do unless he gets a critical defender in exchange. And perhaps the Be2 Was critical to the white square defense, ultimately. Yet the position has not reached \"critical mass\", tension and piece placements that can explode into a winning combination.",
        "9. Qf3": "Considering which Nf5 I chose to keep the pressure on f2 while bringing the other Knight more into the battle. Nb4 was not much considered with any intent to winning of the idle Ra1, but was a big idea in relation to striking at Nd3+, or Nc2+ if needed. Then it is important to see the potential N-forks that can exist if Nbd3+, Kd1 were played; and alert to follow-ups such as captures on f2, or Nge5, or ...e5/...e4 , must be analyzed. [We don't care about the f7 pawn except how letting it be captured by Qxf7 may impact our attack & overall position. Concerns to review would then be Qe3+, Qf5+, aor Nb5, Nd5, aor ability to bring Bf5 in with check or restriction of my K to Kc8. Now any Ne5 makes those concerns moot, for now.",
        "9... Nce5": "Made with tempo since his Q is attack and would not have been if it moved Qe2 instead of Qf3. But even then, Nd3+ is going to be fantastically strong for BL. Now we see he chose Qf3 to have Qg3 possible. ",
        "10. Qg3": "If 10... Nxf2 what happens? ",
        "10... Nd3+": "If 10...Nxf2 instead, then NOT 11.Qxf2?? or ...Nd3+ 12.Kf1 Qxf1# & winning Q as well. BL should should keep in mind to look at any WT moves that are possble threats, while continuing his attack. Note his own weak squares & K position. Did you see before this the potential Nb5 by WT; that it would have threatened Qc7# as well as Nxa7# , and so you looked at that even tho it subjects the Ra1 to capture? Never get so involved in attacking that you do not make a King Safety review when replies will not all be forced. And always look for the \"inbetween moves\" Zwishenzugs, for both players. Zzg's Win or reverse MANY games. Also, always look to see what your opponent can do AFTER you CAPTURE, not just TO the point of Capture. This is Very Important. You will not get hit with those \"shots\" as Fischer calls them, where you told yourself 'he cannot possibly move that, or loses his ZYX-piece'. ",
        "11. Kd1 Ngxf2+ 12. Kc2 Nb4+ 13. Kb2 Nfd3+ 14. Ka3 Nc2+ 15. Ka4 Qb6": "With little time left I play Qb6 ,seeing there will be 2 or more Mate Threats against him. But can you find a more Forcing continuation for me here, instead of ..Qb6? ",
        "16. Nb5": "After Qb6 BL's immediate Mate Threats were 16...Qa6,Nc5#,or Qb4#. It is nice to have choices. **** Yes 15...Qd7+ is more \"Forcing\" since it keeps him under checks until it is Mate. Whether or not he plays Nb5 or moves the King vs Qd7+, he can be mated using moves ...b6 and ...Qb7#, the difference being that ...Nc5+ is made first if he should interpose Nb5. Ka5 b6+, Ka6 Qb7# . Does this matter, it being more forcing? Maybe a bit. If he sac's ...Qb6, Qxd3 Qa6# Zwishenzug is played. Remeber, his N is not on b5 then. Otherwise, if it Were already there (the position you see before you now) then, saying WT to move, he could slow down BL with Qc7+ Qxc7 [forced], Nxc7 Nc5+ ... How does that come out? I will leave that one to you dear reader, as it did not appear nor get analyzed within the scope of the game. My impression upon sight of that one is, \"It gets raggedy, but there Might still be a Mate there in some extra moves!?\" ",
        "16... Nc5#": "The other Mate Threat, before and after Nb5, was Qa6# although his N move did eliminate the ...Qb4# threat."
    },
    "url": "https://gameknot.com/annotation.pl/gameknot-blitz-http-gameknot-com?gm=33308",
    "gameName": "GameKnot Blitz, http://gameknot.com/",
    "players": "cherise (Unr.) vs. baronderkilt (1846 GK)",
    "opening": "Scandinavian gambit (B01)"
}