{
    "moves": {
        "1. e4 c5": "King's Pawn followed by my standard response, the Sicilian Defence.  King's Pawn has always been my favourite opening move for White, I think it avoids the slow manoeuvring type of games which I generally dislike.",
        "2. Qf3": "Hmmmm, I've always been told by the guys teaching me to play that moving your Queen out early is a recipe for disaster.",
        "2... Nc6 3. Bc4": "Well, the expected threat of checkmate, I'm trembling :p",
        "3... Nf6 4. d3 d5": "The threat is easily deflected, so it's time to begin the punishment for a silly opening.",
        "5. exd5 Nd4": "White goes up in material.  Black forks White's pawn at c2 and White's queen.  Only a simple fork, but allows me to gain some tempo.",
        "6. Qd1": "Only realistic move White could make.",
        "6... b5": "Threatening White's ls-bishop.",
        "7. c3": "White offers exchange of ls-bishop for Black's knight.",
        "7... bxc4 8. cxd4 cxd4 9. dxc4": "Which Black accepts.",
        "9... Qc7": "Looking to equalise the material.",
        "10. Qa4+": "I preferred Qxd4 here, gaining White another piece of material and defending the vulnerable c4 pawn.  Qa4 was a fairly pointless check, easily defended with. . .",
        "10... Bd7": "Bd7, which forces the Queen to retreat.",
        "11. Qb4": "I think Qb3 was slightly better here. I see an opportunity to quickly. . .",
        "11... e6": "threaten White's poor queen again.  She must be beginning to feel slightly picked on by now!",
        "12. Qd2": "More retreating, back to pick on my vulnerable d4 pawn.",
        "12... Qxc4": "Isolates White's pawn at d5 and protects my own vulnerable d4 pawn.",
        "13. Qf4": "!!! Surely b3 was the correct move here?  Either way, I think it's not looking good for White, but Qf4 abandons the doomed d5 pawn, and allows me to threaten White's back-line.",
        "13... Nxd5": "That places me in front in material and places another threat on White's poor bullied Queen.",
        "14. b3": "I think Nd2 was better.  From what I can see, b3 will end with my winning more material and leaving White crippled.  It was the last move of the game for White, unfortunately he timed out.",
        "14... Qc2": ""
    },
    "url": "https://gameknot.com/annotation.pl/game-number-6-why-early-queen-moves-are-best-avoided?gm=26369",
    "gameName": "Game Number 6 - Why early queen moves are best avoided",
    "players": "abababab (1200) vs. freddz123 (1200)",
    "opening": "Sicilian defence (B20)"
}