{
    "moves": {
        "1. e4 e5 2. Qh5 Nc6 3. Bc4 g6 4. Qf3 Qf6": "Other replies possible.  I was out of practice playing against this all-out-attack style from white, and decided that the club-footed Qf6 looked effective.",
        "5. Qxf6 Nxf6 6. d3 Bc5 7. Nf3": "Threatening 8. Ng5, which I missed.",
        "7... d6": "? allows the white N to advance.  Perhaps this is harmless, but I see it as an oversight. The position is nearly symmetrical, but with important differences.",
        "8. Ng5": "Of course.  8. ...0-0 is possible, but for some reason I didn't like that, and played the admittedly passive...",
        "8... Nd8": "? Loses tempo, hinders a potential 0-0-0.  0-0 seems better, although it felt a bit exposed without the fiancetto bishop.",
        "9. O-O h6": "Kicking out then K, followed by getting rid of the LSB.",
        "10. Nf3 Be6 11. Bxe6 Nxe6": "Even with my clumsy, sometimes passive play, I am far ahead in development.",
        "12. c3": "I thought white was preparing a push at d4, and saw no imminent threat.",
        "12... O-O-O": "My development is complete, white's is lagging.  I am excited about the opposite-castle setup, with both knights prepared to strike at the white king, but I have no plan as of yet.",
        "13. b4": "I didn't see this one coming, but replies were easy to find.",
        "13... Bb6 14. a4 a6": "Creating a retreat square, keeping the B pointed at the white king.",
        "15. a5 Ba7 16. Bb2": "?  Very quiet, this cedes initiative, which white will never fully recover.  White needed to keep the pawn storm coming, finding support for a b5 push (16. c4?), or perhaps offering a sac by pushing immediately: 16. b5 axb5 17. a6 bxa6? 18. Rxa6 and black's king is exposed.",
        "16... h5": "I take the chance to begin my own pawn advance.",
        "17. d4": "I took note of my Rh8, in the line of white's DSB, and in the manner of blitz, blithely ignored the threat...  Here is where I began my attempt to channel my hero, Raoul.  His signature sac is of a minor piece on, in this case, g4, supported by a pawn, with a rook menacing the soon-to-open h file.  I saw that I could achieve this setup and simultaneously support the attacked pawn on e5, and jumped at the opportunity without calculation.",
        "17... Ng4": "My N reaches the sac square.",
        "18. dxe5 dxe5": "With this exchange completed, I can almost feel it coming, but still I don't have a plan.  The best I have seen is the possibility of doubled rooks on an open h file.",
        "19. h3": "There it is!  When white played this, I thought for a while, until I saw a faster attack than doubling the rooks.  Do you see it coming?",
        "19... Nf4": "!  I offer the sac which I now dub the \"Raoul\".  In fact, black quickly regains equality, with positional interest, even if white plays accurately.",
        "20. hxg4": "?  White gobbles the Raoul sac, but this probably loses.  White needed to consider Re1, c4, or activating the Nb1.",
        "20... hxg4": "There's the open file; the unprotected e2 square is the crucial fact, however.  White needed to play 21. g3 to stay alive, although with 21...Nh3 he will have to give back the N, the K will be on a forced march, and black will be firmly in control.\n\nEDIT:  A chessmaster friend points out this move as a mistake, missing a forced mate:  20...Ne2+  should be played immediately, followed by 21. Kh1 hxg4+ 22. Nh2 Rxh2+ 23. Kxh2 Rh8#  ",
        "21. Ng5": "?? white threatens the fork but misses mate in 1",
        "21... Ne2#": "! My proudest mating pattern so far.  Hope you enjoyed, thanks to aeronca, respect to Raoul, comments welcome."
    },
    "url": "https://gameknot.com/annotation.pl/gameknot-blitz-http-gameknot-com?gm=41319",
    "gameName": "GameKnot Blitz, http://gameknot.com/",
    "players": "aeronca  vs. benrous1 ",
    "opening": "KP (C20), Patzer opening"
}