{
    "moves": {
        "1. d4": "in speed games, I like 1. e4 - 2. f4 - 3. Nf3, or, like in this game: 1. d4 - 2. Nc3 - 3. Bf4 or Bg5, depending if my opponent plays Nf6 before my third move.",
        "1... d5 2. Nc3 e6 3. Bf4 c6 4. e3": "Forbids B to come back, but opens line for Bf1 development.",
        "4... Nd7": "Blacks seems to defend in a close game choice.",
        "5. Bd3 h6 6. Nf3 Ngf6 7. a3": "I lose a tempo but N will not be pending on the King no more: I prevent Bb4.",
        "7... Nh5": "N not in centre please me. Whether Blacks lose time coming back, wether they take my B and it will open my rook line because I'm going to g3 square. This trade is not so boring because the game is still closed.",
        "8. Bg3 Nxg3 9. hxg3 Qa5": "With this move, I decide to move pawns and possibly N, trying to close Queen's side, or to control a possible opened line after with my R and Q. I already think i will not castle and think (or hope!) e2 will be a good square for my King.",
        "10. b4 Qb6 11. Na4 Qc7 12. c4 Nb6 13. Nxb6 Qxb6 14. c5": "Now I am pretty happy because this close game decrease my opponent's pair of Bishops.",
        "14... Qc7 15. Ne5": "I take some space, watch, g6 and f7 squares, allow my Queen to play on d1-h5 line, and keep the game closed.",
        "15... Be7": "Black develop their black B, allowing castle on King's side. Maybe delopping the other B would be better, maybe Queen's side was safer for Blacks' King (in case of castle on this side).",
        "16. Qh5": "Big bullet coming, and threats. (With 16. ... - g6, Whites can sacrifice the B on g6 and are going to destroy Blacks' King side and take the rook after several checks).\n(for example: ... - g6 ; BXg6 - fXg6 ; QXg6+ - Kd1 ; Nf7+ and fork on rook.)",
        "16... O-O": "O-O: I have got 4 pieces targeting the King: B, N, Q and R + g3 pawn that could come (a little bit slowly, however). I think Blacks have no way to avoid defeat.",
        "17. Qg4": "Attack on h pawn, because: Rxh6 and then  g7 pawn cannot take the rook, pending on King because of my Queen.",
        "17... Bf6": "Black did not see it. They play a move to exchange material, but I still have 3 big weapons if my N is out of the game.",
        "18. Rxh6": "After that move, my opponent told me in the chat that i play like a computer and i am cheating. However, I often see humans do it (like me: often try it, and also often losing because too much \"heroic\" attacks that fail!).",
        "18... Bxe5": "Fatal move, but any move would not have helped. Another sacrifice: it's forced mate because f7-g7 pawns and Rf8 are a jail for Blacks'King (I create a puzzle of that position also).",
        "19. Rh8+ Kxh8 20. Qh5+ Kg8 21. Qh7#": "A nice \"miniature\" (but not perfect at all, strong players must laugh reading this analyse!). Conclusion: if you play me in blitz or anywhere, do not tell me I am cheating, because I hate cheating and it upsets me if you think I am one; and do not be afraid of my sacrifices: more than 50% of them make me lose  ; )  ."
    },
    "url": "https://gameknot.com/annotation.pl/gameknot-blitz-http-gameknot-com?gm=41102",
    "gameName": "GameKnot Blitz, http://gameknot.com/",
    "players": "jerofpara  vs. roisenp ",
    "opening": "Queen's pawn (D00), Chigorin variation"
}