{
    "moves": {
        "1. e4 e6": "I decided against playing my favourite Sicilian and played the French. My opponent didn't like openings where black gives white the center or a spacial advantage and so I tried to antagonize him and I also wanted to play something different",
        "2. d4 d5 3. e5": "The advance variation",
        "3... c5 4. c3 Nc6 5. Nf3 Qb6": "Still very much by the book",
        "6. a3": "Wanting to play 7. b4 forcing cxd4",
        "6... a5": "!? An anti b4 line although Nh6 is the book's recomendation",
        "7. Be3": "?",
        "7... Qxb2": "Black accepts the 'poisoned pawn'",
        "8. Nbd2": "Forced all others drop the rook",
        "8... Qxc3": "Now two pawns up and pinning the knight and forcing the queen into a defensive position",
        "9. g3": "Wanting to develop the bishop to a square that is not e2 where whites minor pieces are tripping over one another",
        "9... cxd4 10. Bf4": "forced however Bg5 may have been a viable alternative because of ...f6 exf6 gxf6 Bh4 (Bf4 falls to e5 were the Bishop is trapped) however the Bishop is trapped on the side and three pawns down however the weakened kingside means the king will be castling into danger on both sides. Rather than gxf6 Nxf6 could be played however Bxf6 forces gxf6 and removes the problem Bishop on the side of the board. However losing this also means the already struggling Queen becomes overloaded thanks to g3 were it now has the knight on f3 to defend but luckily black has no way to take advantage of this. Black must find a way to develop its remaining minor pieces and continue it attack otherwise its doubled c-pawns and advanced queen may come under attack with white just two moves away from castling and using it's better development to get an advantage.",
        "10... f6": "Wanting to develop the Knight to f6 to gain full control of e4 with the d2 knight pinned",
        "11. Bg2": "Forces black to make the play however will most likely results in a lot of pieces which is good for black meaning he can out play white in the end game and not worry as much about his development for now",
        "11... fxe5 12. Nxe5 Nf6": "Forcing white to make the exchange or keep it's DSB and queen overloaded",
        "13. O-O": "Exporting the King from the center is a good idea as it removes the pin from the d2 Knight",
        "13... Bd6": "Preparing to castle and give his rook the half open f-file",
        "14. Nxc6": "White exchanges hoping the black plays bxc6 to win bishop",
        "14... Qxc6": "bxc6 may have had some merit sacrificing the bishop to give the Rook the b-file however it also stops kingside castling and gives up the material advantage but the text move is just better",
        "15. Bxd6": "Don't exchange when your down however this is forced because the only other square is Bg5 which is defeated by h6 Bxf6 gxf6 which although weakens the king side means less pieces on the board and the Bishop is better than the Knight and also Bh4 falls to g5 which gives the rook the half open h-file and the king need not bother to castle at the moment",
        "15... Qxd6 16. Qa4+": "Wins a pawn",
        "16... Bd7": "Qd7 was valid as exchanging Q's brings black closer to the end game where he has a 3 pawn advantage",
        "17. Qxd4 O-O": "Gives the rook the half open f-file",
        "18. Rab1": "Wanting to gain another pawn and make the gap only 1 pawn",
        "18... Qxa3": "However the material difference will once again be 2 pawns after Rxb7",
        "19. Rxb7 Rab8": "When up on material exchange",
        "20. Rxb8": "?! this is giving black what he wants",
        "20... Rxb8 21. Nf3": "Planning on moving to e5",
        "21... Rb4": "Begins to attack however this leaves the possibility of mate on e8 if the Bishop moves",
        "22. Qa7": "Trying to get to the back rank ",
        "22... Bb5": "Attacking the rook and bringing more pressure onto the white king",
        "23. Re1 Qa2": "Looking to exchange rooks on b2",
        "24. Qa8+": "Forces the knight or bishop to back rank. Better was Ne5 which if ... Rb1 played Qe7+ Kh1 Qf8+ Ng7 Nf7#",
        "24... Ne8 25. h4": "Trying to give the King some more escape squares",
        "25... Rb1 26. Kh2 Rxe1 27. Nxe1 Qxf2 28. Nf3": "Protecting the Knight but overloading the Bishop.",
        "28... h6": "Gives the King an escape square",
        "29. Qxa5 Bf1": "Threating Qxg2#",
        "30. Kh3": "Trying to escape but better was Qd2 Qxd2 Nxd2 Bxg2 Kxg2 which draws the game into an ending where although two points down the Black knight is stuck at the wrong end of the board",
        "30... Qxg2+ 31. Kg4 g5 32. Nd4": "attacking the e-pawn",
        "32... Qh3+ 33. Kf3": "Kh5 gets the King trapped after Kh7",
        "33... gxh4": "Wanting to play Qxg3#",
        "34. Ke3 hxg3 35. Kd2 g2": "White Resigns with the g-pawn certain to queen.\n\nLesson to learn\n\nDon't exchange when down on material"
    },
    "url": "https://gameknot.com/annotation.pl/game-2?gm=38283",
    "gameName": "Game 2",
    "players": "Friend  vs. The Dessert Fox ",
    "opening": "French (C02), advance, Milner-Barry gambit"
}