{
    "moves": {
        "1. e4": "This game is from a team match.",
        "1... e6": "The French Defense has been somewhat of a favourite of mine lately.",
        "2. d4": "As white I like to play 2.d3 and transpose into the King's Indian Attack (Nd2, Ngf3, g3, Bg2, O-O, and so on).",
        "2... d5 3. Nc3": "3.Nd2 (Tarrasch Variation) or 3.e5 (Advance Variation) are other possible replies.",
        "3... Bb4": "The Winawer Variation. Other possibilities are 3...Nf6 (Classical Variation) and 3...dxe4 (Rubinstein Variation).",
        "4. exd5": "Not the most ambitious reply, but not bad by any means. 4.e5 or 4.Bd3 are other possibilities.",
        "4... exd5 5. a3 Be7": "Normally black will trade his dark-squared bishop in the Winawer, but that's after 4.e5 c5 5.a3 and now Bxc3+ (5...Ba5 is possible). Here, however, I saw no reason to relinquish the two bishops, so that's the reason for this retreat.",
        "6. Nf3 Nf6 7. Bd3 Bg4 8. h3 Bh5": "Keeping the pin, eventually black might play Bg6 to offer a trade of bishops.",
        "9. Bf4 O-O 10. O-O c6 11. Re1 Nbd7 12. g4": "I'm not sure about this move, it seems weakening. The pin was annoying and white decided to break it.",
        "12... Bg6 13. Qe2 Re8 14. Qd2": "Black was threatening a discovered attack.",
        "14... Nf8": "I wasn't sure this was best at the time. I wanted to reposition my knight (to e6 or g6) but I've given up control of the e5 square temporarily. I wasn't afraid of 15.Ne5 Bxd3 16.Qxd3 Ne6 (or Ng6, trying to simplify), but I thought I might have had better. 14...Bxd3 15.Qxd3 Nf8 (Qb6!?) also seemed a bit uninspiring. But the truth of the position seems to be I didn't really have a good active plan and I just had to wait for white to show his cards and only then react accordingly.",
        "15. g5": "(?!) This just seems to further weaken white's kingside. Possible alternatives may be 15.Ne5 Bxd3 16.Qxd3 as mentioned in the previous comment, or 15.Kg2 Ne6 16.Bg3. 15.Nh4 may have been the best try, I'd probably have replied 15...Bxd3 (15...Bd6!?) 16.Qxd3 g6, preventing the knight from hopping to f5, but also creating some dark square weaknesses.",
        "15... Nh5 16. Bh2 Qd7": "Attacking h3.",
        "17. Bf1": "White must also lose a pawn after 17.Kg2 Bxd3 18.Ne5 Qf5 19.Qxd3 Qxg5+. Even 18.Qxd3 isn't much better: 18...Ng6 19.Ne2 f6! 20.gxf6 Bxf6 21.Kh1 (otherwise 21...Rxe2 wins) Qxh3. ",
        "17... Qf5": "Attacking both f3 and c2.",
        "18. Bg2": "18.Re5!? Qxf3 19.Bg2 Bxg5 (the only move to save the queen, freeing f6) 20.Qxg5 Qf6",
        "18... Qxc2": "I went for the most obvious move. 18...Ne6 was also possible, but even there after 19.Re5 black would play 19...Qxc2.",
        "19. Qxc2 Bxc2 20. Rac1 Bf5 21. Re5 Be6": "Closing the e-file so Rce1 wouldn't be so effective.",
        "22. Re3 Ng6 23. Ne2": "Preventing Nf4.",
        "23... Bf8": "Getting the bishop out of the way to challenge the e-file and starting a manoeuvre to possibly bring the bishop to h6 (with f6 and if gxf6 gxf6 Bh6, or as in the game f6 h4 h6 etc.)",
        "24. Rb3 Bc8 25. Kf1 f6": "Undermining g5, taking the e5 square away from white's pieces and starting what I described at 23...Bf8.",
        "26. h4": "The pawn on g5 is cramping up black's kingside, so white tries to preserve it, gxf6 wouldn't be so good.",
        "26... a5": "The rook on a8 is doing nothing, so I began to slowly try to activate it. It's not easy to unbind on the queenside, however. I thought of a slightly strange plan here, which took some time and might not be best, but I also saw white doesn't have much to do himself. So, first of all I will play a5 (and later a4 to fixate the weakness on b2), enabling Ra6 (protecting the c6-pawn), then b5, Bd7 (again protecting c6), and only now the rook back to a8.",
        "27. Bc7": "27.Rb6 would stop my intended Ra6. I don't know if I would have been able to resist 27...Rxe2 here, with 28.Kxe2 Ngf4+ 29.Kf1 (29.Bxf4 Nxf4+ 30.Kf1 Bf5! inviting 31.Rxb7?? Bd3+) Kf7 30.Re1 where white is slightly better. 27...a4 28.Bc7 Re7 29.Bd6 Rf7 would be better, or 27...Re7 right away.",
        "27... Ra6 28. Re3 Rxe3": "I also considered 28...Kf7, so black still has the f4 square for the knights. However, the e3-pawn is now weak and is a potential target for my other rook on e8 and bishop on h6 (see 23...Bf8 and 26...a5).",
        "29. fxe3 b5 30. Kg1": "Maybe 30.Kf2 right away, or even 30.Ng3. I guess white didn't find a good plan here and decided to wait and see on what black does.",
        "30... Bd7 31. Kf1": "Again, 31.Kf2 or 31.Ng3.",
        "31... a4": "I didn't like 31...b4 32.a4.",
        "32. Kf2 Ra8 33. Nc3 Re8": "Finishing what I described under 26...a5.",
        "34. Bh2 Kf7 35. Bc7 h6 36. gxh6": "Maybe white could wait with 36.Rd1 as in the game?",
        "36... gxh6 37. Rd1 Ng7": "To play h5, freeing h6 for the bishop.",
        "38. Rh1": "Threatening h5, but it can easily be countered.",
        "38... h5 39. Rc1": "As it turned out, c1 wasn't the best place for the rook. Maybe 39.Re1 Nf5 40.Bh3 was more resilient.",
        "39... Nf5 40. Bh3": "Indirectly defending e3 and h4 because of the pin on the knight on f5. 40.Re1 N(either)xh4 41.Nxh4 Nxh4.",
        "40... Bh6": "Piling up on e3. This is probably the decisive move already.",
        "41. Nd1": "41.Re1 Bxe3+ 42.Kf1 Bc8",
        "41... Rxe3": "(!) The start of an exchanging combination that will leave black with a decisive material advantage.",
        "42. Bxf5": "Of course not 42.Nxe3?? Bxe3+ and Bxc1.",
        "42... Rxf3+": "(!)",
        "43. Kxf3 Nxh4+ 44. Kf2 Nxf5": "And not 44...Bxc1?? 45.Bxd7. Now black has three pawns for the exchange and d4 will also fall.",
        "45. Rc3 Nxd4": "Black is winning here. He must now try and limit white's counterplay, if possible not giving the rook open lines and possible targets to attack. I tend to resign early and would probably throw in the towel here as white.",
        "46. Bb6 Ne6 47. Rh3 Kg6 48. Ne3 Nf4 49. Rg3+ Bg5 50. Nf1 h4 51. Rc3 Kh5 52. Be3 Ng6": "A trade on g5 would be good for black, so the two passed pawns can be connected.",
        "53. Kg2 Ne5 54. Bxg5 fxg5 55. b4": "Getting rid of the b2 weakness, but creating another on a3.",
        "55... Nc4 56. Kh2 g4 57. Kg1 Bf5 58. Ne3 Be4 59. Nxc4 bxc4": "Black is easily winning here.",
        "60. Kh2 g3+ 61. Kh3 Bf5+ 62. Kg2 Kg4 63. Kg1 h3 64. Re3 Be4 65. Re2 c3 66. Ra2 c2 67. Rxc2 Bxc2 68. Kf1 h2 69. Ke2 h1=Q 70. Kd2 Qd1+ 71. Kc3 Qd3+ 72. Kb2 Bb3 73. Ka1 Qc2": ""
    },
    "url": "https://gameknot.com/annotation.pl/game-3?gm=27322",
    "gameName": "Game 3",
    "players": "onebelo (1875) vs. uros23 (1766)",
    "opening": "French (C15), Winawer (Nimzovich) variation"
}