{
    "moves": {
        "1. d4 Nf6 2. Nd2": "Strange outcome from white. but interesting. ",
        "2... e5": "I play the Budapest, in which this knight blocks the white's queen outcome. ",
        "3. c3": "Even stranger answer by white. ",
        "3... exd4 4. cxd4 d5": "Not bad. I have a potentially annoying pin that requires a lot of weakening pawn's moves from white. ",
        "5. e3 Bb4": "So let's go for it. My dsb will be the \"bad\" bishop, so it can be always exchanged for one knight. ",
        "6. Be2 Ne4": "Just to free the way for the queen. ",
        "7. Bf3": "Attemting to surprise me...",
        "7... Qg5": "But the surprise is his'.",
        "8. Bxe4 dxe4 9. g3 Bg4": "AWeakeness in white squares means exactly  this. ",
        "10. Qa4+ Nc6": "White can't support any d5, provided my queen guards it. ",
        "11. a3 Bxd2+ 12. Bxd2": "White has black's squares dominion, that's true, but... how can he exploit it? Will he know how?",
        "12... O-O": "First thing to do. ",
        "13. h4 Qd5": "The queen is well placed here, but it will be easily kicked by the knight... if allowed. ",
        "14. Qc2": "Threatenind the e4 pawn. I considered to go Bf3, and if NxB, my pawn will land on f3, but white could have castled queenside, so it was not a good plan. ",
        "14... Rfe8": "Freeing my queen. I wondered which rook move to do. I didn't see any future on the f column. ",
        "15. Nh3": "White opens the Pandora's bag here. ",
        "15... Bf3 16. Rg1 Qb5": "Just making pressure. ",
        "17. Nf4 f6": "Preparing a daring g5, to win the knight if white don't do something. ",
        "18. Bc3": "Something's done. Not a great plan, mine...",
        "18... g5": "Let's dare even more. ",
        "19. Nh5": "White threw the game by leaving me a free knight. A pity. Ne7 was not a bad option. ",
        "19... Bxh5 20. g4": "True, my bishop is rejected, but he has more squares to go to. ",
        "20... Bf7 21. h5 Bb3 22. Qd2 h6": "What can white do?",
        "23. Rg3 Rad8": "This is to play Ne5, Nd3+. ",
        "24. f3": "Good move (which for I saved the game=. My knight can still go there, though. ",
        "24... Ne5 25. Kf2": "It would have been more interesting if white had played fxe. ",
        "25... Nxf3 26. Qe2 Bc4 27. Qc2 f5": "This is the right way to continue the attack... isn't it?",
        "28. a4 Qd5 29. Ra3": "My queen blocks the liberatory pawn move d5, and will come into action when unstoppable. Here begins a nice fight. ",
        "29... fxg4 30. b3": "White still tried to surprise me with weird moves. This just causes him to lose a tempo and allow me a good move. ",
        "30... Bd3 31. Qb2 Ref8": "...and now, my knight will jump with check, and then my queen will join the attack, winning even if white threatens mate in three (d5, Bh1, Qg2#). ",
        "32. Bb4": "Rf7 has nothing bad, but I wanted to be brilliant. White is right not to take the g4 pawn, since it allows the queen to penetrate with tempo. ",
        "32... Qf5": "I don't care for my rook, giving the \"umbalancing element\" a good attack must have; often a sac. This is a strange way to perform it. ",
        "33. Bxf8 Nd2+": "This was to avoid the white queen to enter into the defence, but it was a mistake. After Ke1, black wins by sac the knight with Qf1+, KxN, Qe2+, Kc1, Qe1#.",
        "34. Kg2 Qf1+ 35. Kh2": "Now, RxB would have been decisive, but I wanted to go further. ",
        "35... Nf3+ 36. Rxf3": "And here, what to retake with?",
        "36... exf3": "Pressure against the king wins. After Be2, white has to play QxB to avoid mate, without hopes. ",
        "37. Ra1 Qh3+ 38. Kg1 Qg3+": "It was a mistake, since g3 was lethal to white. But is mate in some more mores  anyway, so my opponent resigned. The key to the win was to give tempoes more importance than material, and surprise my opponent, tempting him with a juicy candy. Thank you for reading and forgive the low game level from both sides. "
    },
    "url": "https://gameknot.com/annotation.pl/gameknot-blitz-http-gameknot-com?gm=55086",
    "gameName": "GameKnot Blitz, http://gameknot.com/",
    "players": "player (1200) vs. damalfi ",
    "opening": "Queen's pawn game (A45)"
}