{
    "moves": {
        "1. d4": "Once again, Spassky resorts to his QP opening, an indication that he prefers a solid buildup rather than the sharp play required in the Sicilian, Fischer's pet defence against 1. e4",
        "1... Nf6": "Black prevent's 2.e4 and leaves open many options.",
        "2. c4": "Gaining more center control.",
        "2... e6": "Preparing to pin White's Knight after 3.Nc3.",
        "3. Nc3": "Once again threatening e4.",
        "3... Bb4": "This is the NImzo-Indian defence, one of the most popular answers to 1.d4. By pinning the Knight Black gains several advantages. He neutralizes the Knight's pressure on the center. In some instances Black will exchange BxN, which weakens White's queenside pawns. Black also gains a temporarily lead in developmant with two pieces out. Finally, Black can now castle in one move, while White has yet to develop any of his Kingside forces. It is easy to see why the Nimzo is favored by many of the world's best players.",
        "4. Nf3": "White develops to control the center and prepares to castle kingside.",
        "4... c5": "Black brings up his pawn to chalenge d4.",
        "5. e3": "Preparing to bring out King's Bishop as well as protecting the pawn in d4. Now if Black plays 5...cxd4 6.exd4 retains a pawn on d4.   ",
        "5... Nc6": "Another solid development move and a favorite of the German Grandmaster Robert Huebner.",
        "6. Bd3": "White pursues straightforward development.",
        "6... Bxc3+": "Swapping the bishop is usually reserved until white plays a3. The text forces a permanent weakness on white's queenside pawns. Also White no longer has the option developing his Knight on e2 as in the normal Samisch line. Black saddles White with doubled pawns. However, amid the large scale of activities of the middlegame Black will have difficulty concentrating on this weakness as the diversion of force this would entail might leave his K-side in the lurch. Hence, Black plays to prevent or nutralize any aggressive overtures from White, knowing that an eventual endgame will allow him to exploit the doubled pawns without the fear of a K-side attack. This is also good psychology as it lets White know he must come up with resourceful middle game play or eventually face an inferior endgame.",
        "7. bxc3": "As the result of Black's sixth move, White enjoys the advantage of the two Bishops.However, two Bishops need an open position to function at maximum efficiency. White plays to open up the center. The trouble is that Black skillfully keeps the center well barricaded with pawns, restricting the scope of the Bishops. ",
        "7... d6": "This is consistent with Black's strategy; instead of the text, 7...d5 would be a grave strategical error as it would allow White to undouble his pawn and open up the center for his Bishops.",
        "8. e4": "Freeing the QB.",
        "8... e5": "Liberating the QB and contesting the center.",
        "9. d5": "While this has the advantage of cramping Black, the locked pawn formation in the center constitutes a formidable barrier against the activity of White's Bishops. But if 9. dxc5 dxc5 10.Qc2 Be6 11.Nd2 Na5! does not give White time for Nf1-e3-d5.",
        "9... Ne7": "The best square for the Knight. Instead, 9...Na5 would leave it out of play as White could easily defend his weak pawn on c3 while building up an attck on the other wing.",
        "10. Nh4": "Not the best solution. The right way is to sit on the position by 10.Nd2 followed by f3, Nf1-e3, etc.Black has no counterplay unless White tries violent measures. In view of the obstructing barrier of pawns in the center, the White Bishops have reduced mobility. To rectify this Spassky aims for f4 to try to open up lines as quickly as possible.",
        "10... h6": "Preventing the pin Bg5 and and deterring White from castling for fear of g5.",
        "11. f4": "Spassky pondered a half hour, pursed his lips, then launched this energetic thrust. But more in the spirit of things is 11.g3 or 11.f3 g5 12.Nf5 Bxf5 13.exf5 Qh5 14.Qc2! 0-0-0 15.h4 with advantage.",
        "11... Ng6": "Keen judgement. Black does not want to get involved in the complications arising from 11...exf4 12.Bxf4 g5 13.e5!. ",
        "12. Nxg6": "Virtually forced in view of the threats of Nxh4 and Nxf4.",
        "12... fxg6": "Now Black's kingside is secure. Fischer's defensive instinct is uncanny.",
        "13. fxe5": "Perhaps White hoped that Black's KP would become a weakness after this exchange; if so he is soon disillusioned. 13. 0-0-0 is clearly better.",
        "13... dxe5": "White's protected passed pawn is a long term plus but maenwhile his Bishops are hemmed in and lack scope.",
        "14. Be3": "Developing by a gain of time attacking Black's pawn.",
        "14... b6": "The simplest way to defend the pawn. But now Black must be alert against White's a4-a5.",
        "15. O-O": "The King has lingerd in the center long enough.",
        "15... O-O": "Ditto.",
        "16. a4": "To breakthrough on the Q-side.",
        "16... a5": "Black rteckons that his pawn on b6, although backward on an open file, is no weaker than White's a4 pawn. Also, the hole created on b5 cannot be occupied or exploited by a minor piece.",
        "17. Rb1": "Pilling up against the target pawn.",
        "17... Bd7": "Keeping a watch on the a4 pawn.",
        "18. Rb2": "More flexible is 18.Bc2, freeing the Queen of the onerous task of guarding the pawn.",
        "18... Rb8": "Overprotecting the pawn to free his Queen.",
        "19. Rbf2": "Vacillating. The Rooks have no future on the f file, but White really has no constructive idea. He rejected 19.Bc2 Ng4 20.Rxf8+ Qxf8 21.Qe2 Nxe3 22.Qxe3. And weakening is 19.Kh1 Ng4 20.Bg1.",
        "19... Qe7": "More efficient is 19...g5 followed by...Qe8.White has used 1hr and 20 min, Black only 40 min.Characteristically Fischer is again ahead on time.",
        "20. Bc2": "Necessary to protect the pawn and free the Queen from her menial task. Again 20.h3 is met by 20...g5. Spassky took 25 min on this retreat and was getting nervous because of the clock.",
        "20... g5": "Black begins to assume the initiative. Now Black's Knight can be manoeuvered to the strong post f4 via h5; If White plays Bxf4 then gxf4 undoubles the pawns and creates a viable 3-2 pawn majority on the K-side.",
        "21. Bd2": "Putting the Bishop on a less vulnerable square, out of reach of the Black Knight.",
        "21... Qe8": "A very fine concept. From here the Queen can pivot to the Q-side while keeping White's Queen and Bishop tied to the defence of the a pawn.",
        "22. Be1": "White is reduced to passivity.",
        "22... Qg6": "Nxe4 is not a threat yet( 23...Nxe4 24.Rxf8+ Rxf8 25.Rxf8+ Kxf8 26.Qf3+ Bf5 27.Bxe4 winning material) but Nh5 threatening to post the Knight powerfully on f4 is.",
        "23. Qd3": "Probably hoping for 23...Qe8 24.Qd1 Qg6 25.Qd3 with adraw by repetition.",
        "23... Nh5": "But Fischer of course is playing for the win. Black wants to force White to weaken himself on the white squares after g3 (keeping the Knigh out of f4).",
        "24. Rf2xf8+": "Spassky hopes exchanging will draw out the poison from Black's set up.",
        "24... Rxf8": "Black doesn't mind the exchanges as he foresees that he will still have a promising position.",
        "25. Rxf8+": "Continue to chop wood.",
        "25... Kxf8": "White still has problems with his passive Bishops.Also, Black's King can now get to c7 to defend the weak b6 pawn.",
        "26. Bd1": "The lesser evil is 26.g3 to keep the Knigh out of f4.",
        "26... Nf4": "Black is clearly better but a force win is still a long way off.",
        "27. Qc2": "This could be the worst blunder in Spassky's career. After 27.Qb1 is still a game.Curiously he took a good 5 min studying the position but still had 25 min left on his clock.For the first time on the match Spassky's will appears to be crumbling.",
        "27... Bxa4": "28.Qxa4 Qxe4 with the double threat of Qxg2 or Qxe1 mate decides quickly."
    },
    "url": "https://gameknot.com/annotation.pl/game-five?gm=38767",
    "gameName": "Game Five",
    "players": "Spassky  vs. Fischer ",
    "opening": "Nimzo-Indian (E21), three knights, Korchnoi variation"
}