{
    "moves": {
        "1. d4": "My opponent opens with the Queen's Pawn, which I consider to be inferior to the more popular King's Pawn openings.  This is because it is slower and tends to send the game down a route that leads to a tactical minefield.",
        "1... Nf6": "I respond with my standard response to the Queen's Pawn, attempting an Indian Defence.",
        "2. c4": "White sends his pawn to c4, the move I consider to be the perfect one in this situation.  Not only does this attempt to restrict Black's options in attacking the centre, but also allows White to develop the Queen-side Knight to it's powerful c3 square without blocking the c-pawn.",
        "2... g6": "I've been told that this is a risky move at this point of the game unless you know the lines particularly well.  I don't, but I do think I have a good grasp of \"why\" certain moves should be made.  With this one, I commit myself to a \"hyper-modern\" opening, pressuring White's centre with my dark-side Bishop after the inevitable fianchetto.  According to Gameknot's DB, at this point in world games White wins 40% and Black 27%.  Strangely, (or not when you consider what I said at the start of this move), on Gameknot the statistics are much more even with White winning 41% and Black 40%.",
        "3. Nc3 Bg7": "White strengthens his centre, obviously intending to play e4 when possible.  Black continues with the strategy mentioned before, aiming to attack the White central position from the sides.  Another option for Black was to play 3...d5!, which is the Grunfeld Defence, the main line being 4.cxd5 Nxd5 5.e4 Nxc3 6.bxc3 Bg7.  I've always been a Kasparov fan though, studying his games has given me a great appreciation for the Indian's Defence and early fianchetto.",
        "4. e4": "White now has control over the centre, and manages to stop me from playing the powerful d5.",
        "4... d6": "Preparing for the eventual e5 and protecting my Knight.",
        "5. h3": "A brilliant move, restricting the Black light-side Bishop and raising huge question marks over where I can develop it, due to the g6 pawn which blocks a retreat position for it.  It also successfully stops the advance of my Knight to g4.",
        "5... O-O": "I decide to ignore it, getting in the early castle.  My pieces are looking fairly cramped right now, but 4...d6 I am ready to begin my counter attack on the centre.",
        "6. Be3 e5": "White develops the Bishop, providing further protection for the d4 pawn.  Black finally moves the central e-Pawn in the long awaited e5 move.",
        "7. d5": "White advances the d pawn, opening up a line of attack for the dark-side Bishop and blocking the Black Knight from the powerful f6 square.",
        "7... a5 8. Nf3 Nbd7 9. Be2": "White finally has himself prepared for a castle.",
        "9... Nc5": "Blocks the advance of the White c-Pawn and places a second threat on the central White e-Pawn.",
        "10. Nh2": "I don't like this move from White.  It cedes the central e-Pawn too easily and places the White Knight on a weak square.  I preferred Nd2, protecting the centre.",
        "10... Nfxe4 11. Nxe4 Nxe4": "Good exchange for Black, giving me a material lead of +1.  Not only that, it destroys the White centre, allowing for a powerful f5 which begins my pawn storm.",
        "12. O-O f5 13. Bd3": "White seems to offer a Bishop-Knight trade.  I'm not unhappy about this trade, but would prefer the dark-side Bishop since the light-side Bishop is already marginalised.",
        "13... Nc5 14. Bxc5 dxc5": "Which White accepts.",
        "15. Rb1 e4": "Once more, Black advances a Pawn.  White defends the already marginalised light-side Bishop by retreating.  This move also strengthens my dark-side Bishop, who no longer has a competitor on the White-side.",
        "16. Be2 Bd4": "This pins White's pawn at f2 and places the dark-side Bishop in a position where he can cause a lot of pressure on the White King.",
        "17. Qd2 c6": "Threatening the completely wipe White out of the centre.",
        "18. Kh1": "Removes the pin on the f2 pawn.",
        "18... cxd5": "Black wins the Pawn and complete control over the centre.  The Pawn Storm continues.",
        "19. b3 Kh8": "Prepares for any eventual attack by the light-side Bishop through c4.",
        "20. Rbd1 Be6 21. cxd5 Bxd5": "Pawn exchange.",
        "22. Bc4": "Blocks Black's Pawn at c5 and threatens the Black light-side Bishop by offering an exchange.",
        "22... Bc6": "Which I reject.",
        "23. Rfe1 b5": "Further Pawn movement, this time threatening White's light-side Bishop.",
        "24. Bf1": "White is forced to retreat.",
        "24... Qf6 25. Qf4": "I think I'd have played Qc2 here.  Obviously the Queen had to move, since after Bc3 the White Queen and Rook would've been skewered.",
        "25... g5": "My Pawn storm continues as I attack the White Queen.",
        "26. Qd2 g4": "White is forced to retreat with his Queen, whilst the Black Pawn Storm rages.",
        "27. hxg4 fxg4 28. Nxg4": "Poor sequence for White here, culminating in a poor Knight move.  I preferred 28.Re3, which gives up the lost Pawn and offers an exchange of Queens after 28...Qxf2",
        "28... Qh4+": "Forks White's King and Knight.",
        "29. Nh2": "Hmmm, I think the Knight was lost here so Nh2 was a poor move.  I think instead I'd have given up the Knight for lost and played Kg1!",
        "29... Rxf2": "Attacks White's Queen, creates a passed Pawn on e4 and isolates White's Pawn at g2.",
        "30. Re2 Be5": "Mate in 5 - 31.Qh6 Qxh6 32.Rd8+ Rxd8 33.Kg1 Qxh2+ 34.Kxf2 Bg3+ 35.Ke3 Qh6# and White resigns.  A very enjoyable match."
    },
    "url": "https://gameknot.com/annotation.pl/game-number-10-the-big-one-zero?gm=26582",
    "gameName": "Game Number 10 - The Big One - Zero",
    "players": "tolasnuno (1565) vs. freddz123 (1620)",
    "opening": "King's Indian (E71), Makagonov system (5.h3)"
}