{
    "moves": {
        "1. e4": "These annotations are real-time as I play the game, NOT post game analysis.  Any post game analysis or comments will be much appreciated by any stronger players.  I'm playing Black.",
        "1... d5": "I've been fiddling with the Scandinavian Defense (Center Counter).  I like how it takes the initiative away from White.  The downside is that Black's Queen comes out early in the game.  Makes for an exciting, dynamic game!",
        "2. Qf3": "Interesting move.  If I play 2...dxe4, then he plays 3. Qxe4 and it's a reverse Scandinavian!  I believe White's best move was 2. exd4, but he opted to bring out his Queen....let's see how this plays out.",
        "2... e5": "Controlling the center.",
        "3. exd5 Nf6": "Attacking his pawn on d5 and developing...",
        "4. c4": "He's really trying to save that pawn on d5, and messing up his pawn structure in the process!",
        "4... Bg4": "Attacking his Queen...",
        "5. Qc3": "Getting his Queen to safety and attacking the pawn on d5.",
        "5... Nbd7": "Protecting the pawn on e5 and developing...preparing possible 0-0 or 0-0-0 depending how the next few moves...",
        "6. d4 exd4": "Taking the pawn and attacking White's Queen in anticipation White will play Qxd4  ",
        "7. Qxd4 Bc5": "Attacking White's Queen (again!) while continuing development.  Looking at the board right now, all my minor pieces are now developed and coordinated.  White has not developed any minor pieces.",
        "8. Qc3": "White is demonstrating the perils of bringing the Queen out early...ironic, isn't it, because this game started as the Scandinavian defense where Black is the one who is supposed to bring out his Queen early!  ",
        "8... Bxf2+": "With this move I know own White's Queen.  White best figure-out a way to play the game without it, because in two moves, it's gone!",
        "9. Kd2": "A better move for White was Kxf2.  Either move, Kxf2 or Kd2, White will lose his Queen, but at least with Kxf2 he captures my Bishop AND my Knight.  Now he only takes only my Knight.  Watch:",
        "9... Ne4+": "Forking his King and Queen.",
        "10. Kc2 Nxc3 11. Nxc3 Bf5+": "I thought of castling here (0-0) but wanted to keep the pressure on his King, to see what he does...if he plays K2, then I bring-out my Queen to g5 , then castle.  Right now, there is no threat to my King.",
        "12. Kd1 O-O 13. Nce2 Nb6": "Attacking the weak pawn on c4.  If he plays 14. c5 then ...Qxd5 , then ...Qxc5 taking both pawns!  ",
        "14. Ng3": "Apparently he's trying to protect his pawn on c8 (w/ his Bishop on f3) and at the same time attack my Bishop on f5 w/ his Knight.",
        "14... Bg4+": "My plan is to swipe is two center pawn off the board so I can attack his King with my fill arm, getting my Queen and Rooks into the fight.  Depending on how he replies, I'll either play Kxc4 or c6.  Either way, his center pawns are gone.",
        "15. Be2 Nxc4": "The end is near.  His King is out in the open, nowhere to hide.  ",
        "16. Bxg4 Qxd5+ 17. Kc2 Rad8 18. Nh3 Qd3#": ""
    },
    "url": "https://gameknot.com/annotation.pl/game-2?gm=19902",
    "gameName": "Game 2",
    "players": "mp-32 (1198) vs. gtwo (1200)",
    "opening": "Scandinavian (centre counter) defence (B01)"
}