{
    "moves": {
        "1. d4 Nf6 2. Bf4 d5 3. Nf3 c6 4. c3 Bg4 5. Nbd2 e6 6. h3 Bh5 7. g4 Bg6 8. e3 Bd6 9. Ne5 Qc7 10. h4 h6": "The expected \"mistake\". ",
        "11. Nxg6 fxg6 12. Qc2": "Kf7 is to be considered. Even after Bd3, black can allow the bishop's penetration, but not the queen's. ",
        "12... O-O": "Sealing his fate; castling into the enemy's fire. ",
        "13. Bxd6 Qxd6 14. Qxg6 e5 15. dxe5": "I can't allow him to block the white diagonal. ",
        "15... Qxe5 16. g5 Ng4": "I don't fear the f2's weakness if I can generate more urgent danger.",
        "17. Bd3 Nd7 18. Qh7+ Kf7": "The queen check is intended to block the rook's action. ",
        "19. Nf3": "...so to get the knight into the game. ",
        "19... Qe7": "gxh6, with the idea of Nxh6, allowing Ng5+ is probably better than the text. ",
        "20. Bg6+ Ke6 21. Bf5+": "Now, it was played as a plain mistake, I must admit it. But, in the hindsight, I think that RxB here would be deadly for black, e. g. 21... RxB, 22. Qg6+, Nd-f6 (forced: a piece has to block the check, being under the threat of the pawn). Follows Nd4+, and sooner or later black will lose more material. ",
        "21... Kd6": "Wisely or not, depending, black chooses the other way, plainsly losing...",
        "22. Bxg4": "...a knight, while I am defending my loose knight on f3. ",
        "22... Nc5": "Black is not without resources, despite the piece. ",
        "23. Qg6+": "Trying to make the queen come back into the game, but it's not so easy. I sensed gxh was a mistake, since black can have strong pressure on my weak kingside. ",
        "23... Kc7 24. Nd4": "Blockading d4. Black could have tried Rxf2 here, or at least considered the idea. ",
        "24... hxg5 25. hxg5": "I have to keep black as closed as possible. ",
        "25... Rf7 26. Nf5": "Wonderful bind on black's pieces. ",
        "26... Qf8 27. Kd2": "I don't dare to allow my e and f pawns to be attacked so easily. By playing o-o-o, I would have had the king far from them, forcing me to defend them with my pieces. Of course, it's a risky plan. ",
        "27... Ne4+ 28. Ke2": "Here, the black knight is almost useless, despite the good outpost. It would have been nice if black would have wanted to close the game, but it's the opposite. I won't play f3 now, since I can't allow any weakness to affect my pawns... and I feared Nxf2, for sure!\n",
        "28... Rd8 29. Rad1": "Not strong, but not bad. ",
        "29... Nd6": "Exchanging pieces is not what I want: this is the easy way. I want to convert into advantage my piece's mobility and coordination. ",
        "30. Nd4": "Triple fork threat. But allowing...",
        "30... Rxf2+ 31. Kd3": "Ok, now... what?",
        "31... Nc4": "Overlooking...",
        "32. Ne6+": "Here black resigned, even if after NxQf8, returning the compliment, but still losing another knight..."
    },
    "url": "https://gameknot.com/annotation.pl/gameknot-blitz-http-gameknot-com?gm=54421",
    "gameName": "GameKnot Blitz, http://gameknot.com/",
    "players": "damalfi  vs. chess31415 ",
    "opening": "Queen's pawn game (A45)"
}