{
    "moves": {
        "1. e4": "But I found this a fun game!",
        "1... c5": "I sac a piece for two pawns and an attack. My attack doesn't break through, but I gain another pawn and manage to win the ending.",
        "2. Nf3": "So I aim for an open Sicilian. ",
        "2... Nc6": "He seems to be heading for the same.",
        "3. d4": "The usual advance.",
        "3... e6": "But what is this? My opponent (who doesn't state a sex) offers a transposition to a Benoni type position.",
        "4. d5": "So I accept.",
        "4... exd5": "The pawn is taken.",
        "5. exd5": "I take back.",
        "5... Nb4": "The knight runs here.",
        "6. c3": "I attack it again.",
        "6... Na6": "Knight drops back.",
        "7. Bxa6": "I take - I am looking for quick development and keeping the black king in the centre.",
        "7... bxa6": "Takes back.",
        "8. O-O": "I castle.",
        "8... d6": "Black prevents the further advance of the d pawn.",
        "9. Re1+": "I throw in a check.",
        "9... Be7": "Black blocks.",
        "10. Bg5": "I am trying to make it hard for black to develop.",
        "10... f6": "He hits the bishop, but the e6 square is now weak.",
        "11. Bf4": "Bishop drops back.",
        "11... g5": "Black attacks the bishop again. What would you play here dear reader? Fritz recommends 12. Be3. This position was reached in a Gameknot game kiede (1698) vs. vl007 (1762) where 12. Bg3 was played and white won after Qb6\n13.\tb3\tKd7\n14.\tNbd2\tNh6\n15.\tNc4\tQd8\n16.\tQd3\tKc7\n17.\tRxe7+\tBd7\n18.\tBxd6+\tKc8\n19.\tQe3\t\nHowever in this game I was not using the opening databases. I couldn't resist sacrificing on g5 - I spent most of my time thinking about which piece to sacrifice. If you had to sacrifice on g5, which piece would you use?",
        "12. Nxg5": "I took this way.",
        "12... fxg5": "Black takes back.",
        "13. Bxg5": "I take. Fritz gives slight advantage to black now (+0.2)",
        "13... Kf7": "There is some logic in this, in breaking the pin, but perhaps Kd7 as in kiede (1698) vs. vl007 (1762) was better.",
        "14. Qh5+": "Of course! Fritz gives it as +3.25 to white now.",
        "14... Kg7": "What would you play here dear reader? Black threatens Bxg5 of course!",
        "15. Bxe7": "I completely missed 15. Rxe7! which wins a knight, as after 15......Nxe7 16. Bh6+ white wins the rook on h8 and ends up a knight up. Thanks to Fritz for pointing that out!",
        "15... Nxe7": "So black takes back. ",
        "16. Nd2": "Fritz puts white at -0.5 now.",
        "16... Ng6": "Black logically give the king some cover.",
        "17. Re3": "With ideas of doubling on the e file and/or moving the rook into action to f3 or g3. Fritz prefers Ne4.",
        "17... Rf8": "Black mobilizes the Rh8.",
        "18. Rae1": "And I get mine into action.",
        "18... Bd7": "I think this is a mistake. Time to either drive my queen back with Rf5 or to move his other rook to b8 and attack b2. A problem with putting the bishop on this square is that the protection of d6 is blocked.",
        "19. Ne4": "So I try to exploit that, with an attack on d6.",
        "19... Bf5": "Fritz prefers Rf5.",
        "20. Ng5": "Heading for the weak e6 square. Fritz now puts white as 0.5 up.",
        "20... h6": "Black attacks the knight.",
        "21. Ne6+": "So in it goes. A real family fork, attacking king, queen and rook.",
        "21... Bxe6": "Of course black has to take.",
        "22. Re3xe6": "I take back. attacking the knight.",
        "22... Rf6": "The best way, leading to another exchange.",
        "23. Rxf6": "I take.",
        "23... Qxf6": "Queen takes back.",
        "24. Re6": "The other rook comes in.",
        "24... Qg5": "Forcing an ending where I have three pawns for the knight. Fritz prefers 24.....Nf4 25. Rxf6 Nxh5 26. Rxd6 Nf4 27. g3 Nd3 and the black knight is more active than in the game, but I don't think it makes much difference. the way Fritz suggests gives me two passed pawns, but this way, only one.",
        "25. Qxg5": "So I take.",
        "25... hxg5": "Black takes back.",
        "26. Rxd6": "I take the pawn.",
        "26... Re8": "Black threatens mate!",
        "27. Kf1": "Fritz prefers 27. g3 keeping the knight out, and leaving white 0.34 ahead.",
        "27... Nf4": "The knight comes in.",
        "28. Rxa6": "I take another pawn.",
        "28... Nd3": "Black threatens mate again.",
        "29. Rxa7+": "Another pawn goes with check.",
        "29... Kg6": "Fritz prefers Kf6, but it makes little difference.",
        "30. g3": "I give my king a flight square.",
        "30... Rd8": "Black goes after my d pawn.",
        "31. c4": "So I protect it.",
        "31... Rf8": "Attacking f2.",
        "32. Ke2": "So I attack his knight.",
        "32... Nxb2": "Black takes my b pawn.",
        "33. Rc7": "I go after the black c pawn.",
        "33... Nxc4": "Black takes.",
        "34. Rxc5": "I take.",
        "34... Re8+": "Black checks. I am not convinced these checks are good - they just seem to drive my king up the board to where I want him to go.",
        "35. Kd3": "I attack the knight.",
        "35... Ne5+": "Another check.",
        "36. Kd4": "King up again.",
        "36... Nf3+": "Another check.",
        "37. Kc4": "King moves away. Here was one of the few times black paused and thought. I'd guess my opponent was looking at taking on h2 and worked out that there wasn't time. Fritz like 37...g4 here.",
        "37... Re4+": "Black throws in another check.",
        "38. Kb5": "My king now is in a good attacking position.",
        "38... Nd4+": "So the knight comes back to help defend.",
        "39. Kb6": "White king continues to advance.",
        "39... Re8": "Rook hurries back.",
        "40. d6": "Pawn advances, but Fritz thinks it is the wrong one, and prefers 40. a4",
        "40... Rb8+": "Yet another check.",
        "41. Kc7": "Rook is now attacked. Fritz actually prefers a7, but I thought this was more logical, keeping the king near the pawn.",
        "41... Ra8": "So rook flees to the corner.",
        "42. d7": "Fritz prefers 42. Kb7 but I was running short of time, and not sure whether I was trying to win or draw this. I saw the combination which lost my d pawn, but exchanged rooks, and then I saw that I could exchange black's remaining pawn and have at least a draw.",
        "42... Ne6+": "Of course!",
        "43. Kb7": "I attack the rook.",
        "43... Nxc5+": "Black takes my rook.",
        "44. Kxa8": "I take the black rook.",
        "44... Nxd7": "My pawn goes.",
        "45. f3": "But I am going to play h4 next move and exchange the last black pawn.",
        "45... Kf5": "The black king comes up. Fritz gives this as a mistake.",
        "46. h4": "I carry out my plan.",
        "46... Nc5": "Rather random knight move. Fritz is also critical of it.",
        "47. hxg5": "So I take.",
        "47... Kxg5": "Black takes back.",
        "48. Ka7": "I wasn't using an endgame database, but I managed to find the only move to win, according to it!",
        "48... Nd3": "Another random knight move.",
        "49. a4": "Most moves win, but this is the quickest.",
        "49... Ne5": "Attacking the pawn.",
        "50. a5": "Here I missed the quicker win 50. f4!",
        "50... Nc6+": "Knight check.",
        "51. Kb6": "Protecting the pawn and attacking the knight.",
        "51... Nb8": "Knight returns to the square its colleague started on.",
        "52. a6": "No stopping white now.",
        "52... Nd7+": "Another check.",
        "53. Kc6": "Attacking the knight. Kc7 is even stronger, but this was enough to force black to resign. Thanks for reading, I hope you found it enjoyable and educational. Please rank the annotation with the star system and leave a comment or two to let me know how I am doing. Until next time dear reader!"
    },
    "url": "https://gameknot.com/annotation.pl/gameknot-real-time-chess?gm=65293",
    "gameName": "Gameknot Real-time Chess",
    "players": "Charles L Higgie (About 2000) vs. batabatuta  (1200)",
    "opening": "Sicilian defence (B32)"
}