{
    "moves": {
        "1. e4 c5 2. Nf3 d6 3. c4 g6 4. Nc3 Bg7 5. d3 Bg4 6. Be3 Nc6 7. Be2 e6 8. Qb3 b6 9. O-O Nge7": "So far, so good.",
        "10. h3": "Computers dislike this move, even though it gives White a pair of bishops.",
        "10... Bxf3 11. Bxf3 Ne5 12. Be2 O-O 13. Qc2 a6 14. a4": "Before going on with the king-side attack, White decide to stop the possible breakthrough on the queen-side. Unfortunately, this weakens control over b4 square, which Black knights find very attractive.",
        "14... Ne7c6 15. Qd2": "White's plan is to exchange dark-squared bishops and launch an attack on the Black king.",
        "15... Nb4": "Black seizes the opportunity provided by White's 14.a4?! move.",
        "16. Rad1": "Sooner or later White plans to play Bh6, which may require Qxh6. Thus, while the queen is away, the rook will protect the d3 pawn.",
        "16... Nec6 17. Bh6 Ne5": "The knight returns to a square it was on just a move ago. Perhaps Black decided to use it in defense rather than attack, after all.",
        "18. Bxg7 Kxg7 19. f4 Nd7": "Computers are happy to play 20.d4 here, but in the game White prefers a king-side attack to a central domination.",
        "20. Rde1": "The \"e\" and \"f\" files will soon be exploded, and White wants to take control of it right now.",
        "20... Nc6 21. f5 Nd4 22. Bg4": "Joining the attack. If necessary, White will sacrifice the bishop to proceed.",
        "22... exf5": "A real mistake, allowing White to finally use its trump cards.",
        "23. exf5 Nf6 24. Bd1": "After 24.fxg6 Nxg4 25.hxg4 fxg6 I was not sure how to proceed with the attack, so I decided to keep the bishop. \n\nBlack should have taken the chance to equalize with 24...Nxf5 here.",
        "24... Qc7": "Rather pointless move. The queen is hardly of any use on this square.",
        "25. fxg6 fxg6 26. Rf2": "Rooks are preparing for an assault against Black king. Something must be done.",
        "26... Rae8": "White's following move gives the opponent an opportunity to fall into a tactical trap.",
        "27. Rxe8 Rxe8": "And the trap works! It looks natural to take with a rook -- after all, how good can 27...Nxe8 28.Rxf8 Kxf8 29.Qh6+ be for Black? But a knight on a rim is better than a knight off the board, as the White's following move proves.",
        "28. Rxf6": "...and Black should accept the loss of a knight. Taking the rook only makes it worse.",
        "28... Kxf6 29. Nd5+": "And Black resigned facing the inevitable 30.Nxc7."
    },
    "url": "https://gameknot.com/annotation.pl/gameknot-blitz?gm=43351",
    "gameName": "GameKnot Blitz",
    "players": "stevebest  vs. jbknijff ",
    "opening": "Sicilian (B50)"
}