{
    "moves": {
        "1. c4": "Once more, English Opening. Always use this OTB and for now, will be using it on Gameknot as well.",
        "1... c5": "My opponent meets me with a symmetrical move, which I believe is the best option for players experienced with the English.  It can develop in several very different ways from here, depending on how White chooses to go.  I like to do something fairly unusual when faced with this, the common responses being Nf3 which often is followed up by developing the d-pawn or Nc3 which signifies that White is happy with the symmetry for now and will continue his development.",
        "2. g3": "I however like to start my fianchetto as soon as possible, pressurising d5 with the long diagonal.  Can and often does transpose back to the Nc3 lines which it does in this game.",
        "2... g6": "Black is happy with the symmetry for now.",
        "3. Bg2 Bg7 4. Nc3": "After 2...g6 it became clear that Black was going for a symmetrical opening, so I decided to transpose back into the Nc3 lines, knowing that I could squeeze out an advantage since my development would be finished first.",
        "4... Nc6 5. Nf3 e5": "Not something I come up against very often, Botvinnik system Reversed.  According to the Gameknot database, Black wins 49% to White's 30% making it statistically a good response.  I had several considerations here, several different plans that I could work through.  Firstly, I considered Rb1, with the intention of a quick b4 to take initiative on the Queenside.  Of course, the Rook could just as easily stay where it is, moving a3 first before b4 and then Rb1 giving the same position (probably expect Black to go 6...a6?).  Another consideration was 6.e3 followed by 7.Nge2 and then either 8.d3 or 8.d4 depending on how Black has been responding.  Obviously I could go for 6.e4, which weakens the d4 square but makes it difficult for Black on the Kingside.",
        "6. d3": "Instead, I go for the more flexible d3.  Gameknot's database considers this to be a poor move, Black wins 62% to White's 28%.  I agree with this, if an uninformed player goes for 6.d3 here he'll probably find himself in trouble, but someone familiar with English Opening has many options for attacking Black's position.",
        "6... Nge7": "Not wanting to block his own Bishop but wanting an early castle Black has few options for the Knight.  I'm happy with the position here, although the Gameknot database is still greatly in favour of Black I think White has a slight advantage, a more flexible position and similar control over the centre.",
        "7. O-O O-O 8. Ne1": "Probably not the best of ideas, I was looking at getting another piece to control d4 and e4 by opening up my Bishop.  Probably should've considered 8.Bd2 instead (8.Bd2 d6 9.a3 h6 10.Rb1 Be6 11.b4 cxb4 12.axb4).",
        "8... d6 9. Nc2": "Have slightly better control over the central squares, but I've lost the little advantage I had.  Gameknot database has this position down as 100% drawn, and I'd have to agree the position is definitely equal now.",
        "9... a5": "I think Black should've considered 9...f5 10.Ne3 f4 11.Ned5 Nxd5 12.Nxd5.  However, 9...a5 does disrupt my plan of placing the Rook at b1 and advanced by b-Pawn to b4.",
        "10. Bd2": "Really feel now that I should've played this earlier.",
        "10... Be6": "Once more, I think Black should've considered 10...f5 11.Ne3 f4 12.Ned5 Nxd5 13.Nxd5.  I think Be6 is giving me back the advantage I squandered earlier, although it does give Black another piece attacking d5.  Possibly looking at 11.Ne3 Nd4 12.Ned5 Nxd5 13.Nxd5, giving a similar position, although weaker.",
        "11. Ne3 f5": "Too late, after 12.Ned5 h6 13.a3 Bf7 14.Nxe7+ Qxe7 White is eking out a lead.",
        "12. Ned5": "Because of the late f5, I've been able to place a dangerous Knight in the centre, looking at exchanging on e7 after playing a3.",
        "12... h6 13. a3 g5": "Was expecting Bf7, which I was planning on following up with 14.Nxe7.  After g5, Black is beginning to look weak on the Kingside so I adjust my strategy accordingly.",
        "14. e3": "Looking at 15.Qb3, attacking the weak b7 Pawn and am expecting Black to seek an exchange of Knights on d5.",
        "14... f4": "!?  Not sure of this move, I think 14...Bf7 15.Qb3 Nxd5 16.Nxd5 works out better for Black.",
        "15. Re1": "Looking at the eventual Pawn exchange on e3 to f4.",
        "15... Ng6": "Possibly looking out for the eventual Pawn exchange, as I was.  However, I think this is a poor move since after 16.Nb5 Bxd5 17.Bxd5+ Kh8 things start to look bad for Black.  I think a move that was to be considered is 15...Bf5 16.Qb3 Rf7 17.Qc2 Be6 18.Be4 a4 which I think looks slightly better.",
        "16. Nb5 Rc8": "Again, overlooked Bf5 which was better after 16...Bf5 17.g4 Bc8",
        "17. exf4": "Begin the exchanges.",
        "17... gxf4 18. Bxf4 Nxf4 19. Nxf4": "Although it looks like I've left my Knight open, after 19...exf4, 20.Rxe6 is a killer.  Black is almost forced to retreat the Bishop, since after 20.Nxe6 then Queen, Rook and Bishop are forked.",
        "19... Bf7": "Best move available as I see it.",
        "20. Nd5": "Moves my Knight out of immediate danger and places him back into the offensive d5 square, keeping the pressure on Black.",
        "20... h5": "Looks to me like this weakens Black's defence.  I think Black should've considered 20...Ne7 21.Nbc3 Nc6 instead.",
        "21. Qf3": "Trying to provoke Black into moving his Bishop off f7, further weakening his King's defence.",
        "21... Bg6": "Thank you very much :o)",
        "22. Qe3 Nd4": "Trying to force an exchange?",
        "23. Nxd4 cxd4": "I'm only too happy to oblige, I have a material advantage that I'd be happy to take into the endgame.",
        "24. Qe2 Rb8": "Looking at pushing his b-Pawn and then seizing the file after bxc4, attacking my currently weak b2 Pawn.",
        "25. b4 b5 26. cxb5 Rxb5": "Now have a passed Pawn on b4 and have opened up the c-file which. . .",
        "27. Rac1": "I seize control of.  I think perhaps I should've considered 27.a4 Rb8 28.bxa5 Ra8 29.Rec1 Rxa5 30.Rc8 Qg5, which is even better for White.",
        "27... Bf7": "Bolstering the King's defence again.",
        "28. Rc8": "Threatens Black's Queen, hoping for Qxc8 which would allow for 29.Ne7+ and net me the Black Queen.  If not, more likely was 28...Qd7 29.Rc7 Qd8 30.Rec1 axb4 31.axb4 which still looks good for White.",
        "28... Qd7 29. Rc7 Qd8": "Best bet here for Black, hope for the perpetual.  I have other plans however.",
        "30. Ra7": "As I said before, Rec1 was probably the better move.  Ra7 relies a little on luck to get the best from it, which happened to pay off here.  Had Black spotted it, we'd have been looking at something like 30...axb4 31.axb4 Qg5, which although is good for White it's not as good as Rec1 could've been.",
        "30... Bxd5": "But Black does not spot it at all.  He hangs his Pawn at h5 to gain a pretend material advantage, looking at 31.Bxd5+ Rxd5 and gaining +2.  If he'd looked further into the line, he'd have realised he had made a huge error here, 32.Qa2 Kh8 33.Qxd5 axb4 34.axb4 Qf6 and suddenly White is in complete control.",
        "31. Bxd5+ Rxd5 32. Qa2 Qf6": "And now Black feels the squeeze as White attacks the Black Rook to regain his advantage.",
        "33. Rxa5": "Could've just played Qxd5+ here, 33... Kh8 34.Re2 axb4 35.axb4.  Pretty similar really, not much difference.",
        "33... Kh7": "Black releases the Pin on his Rook, but the damage is done, White will go +4 in material and has two passed Pawns on the a and b files.",
        "34. Rxd5 Qf3": "I think perhaps 34...Qf7 35.Ra1 Rd8 36.Kg2 Qb7 is slightly better, but far from a winning move.",
        "35. Rxd6 Qxd3": "Creates his own passed Pawn, on d4.",
        "36. Qb1": "I deicide it's time we lost our Queens.  Black is forced to lose the Queen, due to the Pin, so the best bet is simply Qxb1.  Any other move pretty much finishes the game off for Black.",
        "36... Qxb1 37. Rxb1": "Exchange is complete.  Entering into Endgame territory and White has a considerable lead over Black.",
        "37... Ra8": "Not that it makes much difference, but I think 37...h4 38.b5 hxg3 39.hxg3 e4 40.b6 e3 41.fxe3 dxe3 is slightly better.",
        "38. Rb3": "I should've looked to my passed b Pawn to begin finishing the game, 38.b5 Rxa3 39.b6 Ra8 40.b7 Rb8 41.Rc6",
        "38... e4 39. b5": "Finally spot that the b-Pawn is a good way to finish off.",
        "39... d3": "Possibly 39...Re8 40.b6 e3 41.fxe3 dxe3 is slightly better?",
        "40. f3 exf3 41. Rdxd3": "Shame, but Black resigns.  I would've liked to see how the endgame evolved from here, and remember - no one ever won by resigning!"
    },
    "url": "https://gameknot.com/annotation.pl/game-number-17-62nd-gk-tournament-round-1?gm=27047",
    "gameName": "Game Number 17 - 62nd GK tournament Round 1",
    "players": "freddz123 (1834) vs. yellowlab (1783)",
    "opening": "English (A30), symmetrical variation"
}