{
    "moves": {
        "1. d4 d5 2. c4 c6": "Caro-Kann. Pretty safe. ",
        "3. Nf3 Bg4": "?! I'm not sure I like this move. Maybe it's because I don't know a good reply to Ne5.",
        "4. Ne5": "The last game started with a similar set up where my bishop overextended and was attacked by an aggressive knight. Looks like I didn't learn!",
        "4... Bf5 5. cxd5 cxd5 6. Nc3 Nc6": "f6 just seems to be asking for trouble at this point. This doesn't seem like a very clever move either though.",
        "7. Nxc6 bxc6 8. Qa4": "c6 is looking rather weak at the moment due to the lack of a b7 pawn. Development is somewhat equal at this point but white clearly has the initiative.  ",
        "8... Bd7 9. Bf4": "He is definitely not worried about the discover attack on his queen. Maybe because all that is threatened is a pawn.",
        "9... c5 10. Qb3 cxd4": "? I'm really asking for it this game it seems. Not sure what would be a better move but this one does not seem too good. Maybe I was in trouble already.",
        "11. Nxd5": "Okay I'm in trouble now. Maybe a solution is lurking somewhere, perhaps a shot at his king.",
        "11... e5": "! Denying his bishop access to d2. Even though d2 does not seem very important at the moment, it is a fundamental square for what's to come.",
        "12. Bxe5 Qa5+ 13. Kd1": "At this point white does not have very many good replies but this seems to lose the quickest.",
        "13... Ba4": "Pinning the queen to his king.",
        "14. Nc7+": "14. Qxa4+ Qxa4+ 15. b3 Qany 16. Nc2+ and white's position is slightly better than what happened.",
        "14... Kd7 15. Nxa8 Bxb3+": "16. axb3 Qxa1 or 16. Kc1 Qe1#\n\nEpicuro resigned at this point and suddenly opening strategy became very important. Even though this is a blitz game it shows you can sometimes turn a game around in difficult situations and that you should not give up."
    },
    "url": "https://gameknot.com/annotation.pl/gameknot-blitz-http-gameknot-com?gm=33267",
    "gameName": "GameKnot Blitz, http://gameknot.com/",
    "players": "epicuro (2426) vs. coolistdude (1704)",
    "opening": "QGD Slav (D11), 3.Nf3"
}