{
    "moves": {
        "1. e4": "\"Best by test\" - Bobby Fischer.",
        "1... e6": "The French Defence, delaying immediate central expansion in order to obtain a solid pawn on d5 and queenside counterplay. The major qualm I have with this opening is that it blocks in the Queenside Bishop. \r\n\"I have never in my life played the French Defence, which is the dullest of all openings.\" - Wilhem Steinitz",
        "2. d4": "Claiming the center with both pawns.",
        "2... d5 3. Nc3": "The Paulsen Variation (named after Louis Paulsen)",
        "3... Bb4": "The Winawer Variation, attempting to break up White's Queenside pawns. ",
        "4. e5": "The main line of the Winawer Variation. Until recently I normally played Bd2, the wonderful Fingerslip Variation, or Ne2, the Alekhine Gambit. But also until recently, I was a really bad player.",
        "4... c5": "The Advance Variation (I don't know why they give it a new name after every move). It attempts to attack White's pawn center at the base, but also blocks in the dark-squared Bishop.",
        "5. a3 Bxc3+": "Black opts for the most common response. This gives up a Bishop for a Knight in a closable position, and doublers the White pawns. It also opens the b-file for White.",
        "6. bxc3 Qc7": "Classical Variation. Brings another piece to bear against the center, developes the Queen to the 7th rank and defends the c-pawn. 6. Ne7 is more common.",
        "7. Qg4": "Attacks the g pawn. Still in book, surprisingly, as it seems to defy the accepted opening principle of not developing your Queen early. ",
        "7... f5": "Defends the g pawn with the Queen. Much sharper (read: more fun) is cxd4.",
        "8. Qg3": "8. exf6 Nxf6 9. Qf4 Qa5 (this targets the weak pawns, better than Qxf4 10. Bxf4) And White has given up a pawn to help Black with his developement. ",
        "8... cxd4": "Finally leaving book, 8. Ne7 is better. I don't really like this move, as it undoubles Whites pawns for little compensation. Black can't even take the pawn because after 9...Qxc2 10. Bd2 Qc7 ( 10...g6, 10...Kf1 or 10...Kf2 11. Rc1 Qe4  12. Ne2, and Black is under developed with an overextended Queen. White's easy developement should compensate for the pawn.) 11. Bb5  Nc6 12. Ne2 and Black has difficulty developing because of the pin and the pressured g pawn.",
        "9. cxd4 Ne7 10. Bd2": "Not 10. Qxg7? Qc3  11. Ke2 Rg8 (not Qxa1?? Qxh8 ) 12. Qxh7 Qxa1. 10. Bd2 defends the c3 square and threatens Qxg7.",
        "10... O-O": "!? Probably the best way to defend the pawn. 10... Rg8 is bad because it stops Black from castling Kingside. And 10...Ng6 looks bad after both 11. h4 which starts the ball rolling for a Kingside attack, and 11. Be2 which threatens a particularily painful pin.",
        "11. Bd3": "Defends the pawn and developes. The White Bishops a seem rather akwardly placed, but it is well placed for an attack after the bayonet ...g4.",
        "11... b6": "Prepares to fianchetto the Bishop, or use the a6-f1 diagonal, which is not closed off like the long diagonal.",
        "12. Ne2": "Gets ready to castle, or to attack the e pawn with Nf4.",
        "12... Ba6": "Tries to trade off Whites good Bishop for Black's bad one.",
        "13. Nf4": "Puts pressure on the e pawn. Also threatens to fork Queen and Rook with Nxe6. ",
        "13... Nec6": "? Attacks the d pawn but loses the exchange. 13... Qd7 to defend the pawn seems best. 13... Bxe6? 14. Nxe6 Qe7 15. Nxf8 Qxf8 16. Qxd3 is even worse.",
        "14. Nxe6": "Forks Queen and Rook and threatens mate on g7. Also wins a pawn, such a wonderfully loaded move.",
        "14... Qf7 15. Nxf8 Qxf8 16. O-O": "Black here cannot win a pawn by Nxd4 because of 17. Bxa6 Nxa6 18. Qd3 Nc6 19. Qxd5  which is good for White. So I chose to get my King to safety. But probably better was Bxa6 which puts an enemy Knight on the rim, makes room for my Queen to move along the rank, removes and important defensive piece of the enemy, and trades down while I'm ahead in material.",
        "16... Bb7": "I think the counter-intuitive Bc1 followed by Be6 here would have been better, in order to blockade the past pawn and defend Black's center pawns. Though after this the Bishop looks like an over-grown pawn with a funny hat.",
        "17. c3": "Now that the Black d pawn is defended (By the Bishop) I must defend my own.",
        "17... a6": "?! This defends against Bb5, which is not much of a threat as the Bishop is best on the b1-h7 diagonal, and prepares to expand on the Queenside with b5, which is not much of a plan for counterplay. It also blocks in the light squared Bishop. Instead Black should have played Nd8 to blockade the pawn. Note that Nd7 is bad because it lets white advance the passed pawn with tempo.",
        "18. Rfe1": "?! Preparing to push a pawn that can and should be pushed immediately, this gives Black a bit more time to try and blockade. 18. e6 now was better.",
        "18... Ne7": "Finally blockading with something, and also protecting the f pawn. Unfortunately this takes pressure off the c4 square. Better was Bc8, not only because it attacks e6, which is unimportant because Black missed his only chance to blockade there, but because it allows Ra7 and Re7.",
        "19. c4": "Aiming for a better Bishop and two connected passed pawns, well worth the price of giving Black a good Bishop.",
        "19... b5": "? Allows White to get a second passed pawn in two ways, cxd5 and c5 and also giving up a pawn if White so chooses with cxb5. Better was Nd7, and if 20. e6 Nf6 where both passed pawns are stopped for now.",
        "20. c5": "?! Closing the game when you have no Knights is rarely good, here           20. cxd5 Bxd5 (better than taking with the Knight, because the knight will be needed for the defence of f5) 21. Bb2 Nd7 22. Ba2 Rd8 23. Bxd5 Nxd5 24. Qf3 Nb6 25. Rc1 looks better for White.",
        "20... Nbc6": "Finally developing the Knight, and blockading.",
        "21. Bc3": "Played to protect d4, the Bishop's defence of d4 was meant to be only temporary. A military epigram about plans might be appropriate here, unfortunately I can't remember one.",
        "21... f4": "Overextending the pawn I think. Now I should, key word being should, be able to surround and destroy it.",
        "22. Qh4": "Threatens mate at h7.",
        "22... g6 23. Rad1": "Preparing to relieve my Bishop of the defence of the d pawn. I planned, in a Petrosianesque way, to bring both my Bishops back to c2 and c1, where they are ont hey're most agressive diagonals without obstructing the other pieces.",
        "23... f3": "According to Korchnoi, end-game player extraordinaire, pawn weaknesses should be pushed, until they become pawn strengths. I'm not so sure it applies here.",
        "24. g3": "I didn't really like the idea of exposing my King after Re3 fxg2 or bringing the Queen close AND exposing my king with gxf3 Qxf3, so I tried to follow the great Nimzovich's advice on dealing with rogue pawns; Restrain, Blockade, and Destroy.",
        "24... Bc8": "Trying to get activity for the Bishop.",
        "25. Re3": "Also possible is continuing with my afore-mentioned Bishop Manuevres and saving the pawn for later, or playing Qf6 where Black has to decide between his pawn, or bringing my passed pawn forward. 25. Qf6 Qxf6 26. exf6 Nf5 27. g4 (or penetrating down the newly opened file with Re8 ) Nfxd4 28. Bxd4 Nxd4 29. g5 looks very good.",
        "25... Be6": "More defensive blockading.",
        "26. Qf6": "This is just as strong now as it would have been last turn.",
        "26... Qxf6": "?! This allows me to both win a piece and gives me a more powerful passed pawn.",
        "27. exf6": "Of course I take back the Queen. It is also important that all the pieces that were blockading this pawn are now exposed on the file, and that both the knight and Bishop are being attacked. From this point on, I play mostly bad moves, my laziness spurred on by what was a dominant position (An attitude which I learned to avoid at a later OTB Tournament).",
        "27... Nf5": "Saves the good Knight, not the bad Bishop.",
        "28. Bxf5": "?? So stupid...",
        "28... Bxf5": "The Bishop is probably the strongest piece on the board, as my rook cannot really penetrate down the open file.",
        "29. Rxf3": "? Grabbing another pawn but losing the exchange to Bg4. Better was Rde1 to either trade rooks or try to Queen the pawn.",
        "29... Kf7": "? Missing his chance to regain the exchange. ",
        "30. Re1": "Taking over the file.",
        "30... a5": "! Of course not Kxf6? 31. g4 which wins the Bishop.  ",
        "31. Bb2": "Now b4 can be met by a4, and the passed pawn, while not absolutely harmless, is blockaded.",
        "31... a4": "31...b4 was better.",
        "32. Rf4": "? Bc3 to stop all Queenside threats once and for all was better. I'm not sure why I played this. I think it had something to do with attacking the enemy h pawn.",
        "32... Kxf6": "? I thought that now that the Rook was advanced 33. g4 would be met by Kg5, but in fact this is a mistake because of 33. g4 Kg5 34. Bc1! and White wins the Bishop.",
        "33. f3": "?? Trying to move my pawn majority. But missing 33. g4 and also not seeing the threat of g5, which traps the Rook.",
        "33... Kg7": "?? Missing 34. g5",
        "34. Bc3": "Stopping Queenside play.",
        "34... Rb8": "Preparing to push the pawn.",
        "35. Bb4": "?! This isn't bad because it gives up Bishop for knight, its bad because now my Bishop is such a bad piece, and because it remains such for most of the game. Though in truth this strategic oversight pays off, as you shall soon see.",
        "35... Ra8": "I don't really understand this move but it seems to me that he was going to capture my Bishop then push the pawn along the a file.",
        "36. h4": "Moving the pawn majority, slowly but surely. ",
        "36... h6": "h5 would have been better.",
        "37. h5": "Trying to undermine the Bishop's defence.",
        "37... Bd3": "?! 37...Nxb4 38. axb4 in order to get some counter-play, and a passer, was probably better.",
        "38. Re6": "?! Forking pawn and knight. This seems to give up a pawn for two very good rooks, but the pawn is immediately regained. 38. hxg6 was simpler and probably better, but I liked this more.",
        "38... g5 39. Rff6": "39. Rg4? Bf5.",
        "39... Nxd4 40. Red6": "Wins a pawn, as both d and h pawns are attacked.",
        "40... Bc4": "? The only way to defend the pawn but it gives up control of g6, which turns out to be a fatal weakness.",
        "41. Kf2": "?! Trying to bring the king in, but it's not necessary. Rxh6 was better here.",
        "41... Re8": "? This loses because it takes one of the King's flight squares away.  But Black was lost anyway.",
        "42. Rfg6+": "Wins the game.",
        "42... Kf7": "?? 42...Kh7 (Kh8 leads to pretty much the same thing) Rxh6  43. Rdg6  Ke7 44. Rh7  Kf8 45. c6  Re7 46. Bxe7  Ke8 47. Rg8#\r\n Best was 42...Kf8 (the only one I can see where white can't force mate) though after43. Rdf6  Ke7 44. c6  Kd8 45. Rg7 looks very bad for Black.",
        "43. Rd7+": "Forcing the King to the edge.",
        "43... Kf8": "Re7 holds out a bit longer. 43...Re7 44.Rxe7  Kxe7 45.c6  Kd8 46.Ba5  Ke7 47.c7 Kd7 48.Rg7  Kc8 49.Rg8  Kd7 50.c8=Q  Kd6 51.Qc7 .",
        "44. c6+": "And Black resigns. After this the game would go 44...Re7 45.c7 Ne6 46.c8=Q  Nd8 47.Rxd8  Kf7 48.Rf8#\r\n"
    },
    "url": "https://gameknot.com/annotation.pl/games-of-the-ashaman-blockading?gm=5857",
    "gameName": "Games of the Ashaman - Blockading",
    "players": "the_ashaman (1605) vs. corneliusblisand (1594)",
    "opening": "French (C18), Winawer, classical variation"
}