{
    "moves": {
        "1. e4 d5": "Scandinavian, my all-time favourite. ",
        "2. exd5": "Accepted. Another option in e5, that leads to a well-known kind of game. ",
        "2... Nf6": "The base for the Icelandic gambit. ",
        "3. d4": "The best response, according to theory. c4 gets white into troubles - you must know it to realize. ",
        "3... Nxd5": "Recommended, even if I don't like it after c4. But it is playable. ",
        "4. Nf3 Bf5": "I can't stop c4, so I develop. This bishop is going to be exchanged for the f3 knight, sooner or later. A key point of the game is to choose where and when. ",
        "5. Be2": "I don't prefer this kind of dev, but it is definitely glod and sound. ",
        "5... Nb4": "...but it allows an experiment. ",
        "6. Na3": "The only good answer. The knight is a little misplaced, but also will be mine after c3. ",
        "6... e6": "The bishop's way out. ",
        "7. c3": "At least I avoided c4. ",
        "7... Nd5": "I wanted to keep my c pawn mobile. If now c4, white has kinda returned me the tempo lost with the knight's moves. I forced white into a set, but it is not proven that it will be good for me (black). ",
        "8. Nc2": "White again goes passively but not bad at all. ",
        "8... Bd6": "It is very important to avoid Bf4, a good white's move. ",
        "9. O-O": "Help yourself... just where I wanted you. The only chance to \"prove\" this opening is for black to manage an attack on the kingside, and castle queenside. White's pawn storm on the queenside must be feared, but it has to be seen if white goes for it quickly enough. ",
        "9... Nd7": "Simple developement, but best would have been c6, wasting a tempo but providing c7 to the queen. ",
        "10. Bg5": "I considered f6, but I decided that I had to be careful about the weakness in e6. So...",
        "10... Nd5f6": "...anticipating the retreat if c4 is payed. ",
        "11. Ne3": "Wanting to open the column. Bg6 is the natural move, but remember I said my chance was to attack on the kingside? So...",
        "11... h6": "I take my chances to begin a pawn storm. If NxB, hxB. ",
        "12. Bh4": "Thank you. White's passive play is beginning to cost cash. ",
        "12... g5 13. Nxf5 exf5": "I have a spare tempo to hide the king, but I need two to get it castled queenside. And two to hide it in g7. In the meanwhile, white will lose a piece. But I don't want to take it with the pawn... here, Re1 would have made the game for white, on a quick look. ",
        "14. Nxg5": "White goes for a sac, maybe thinking that the dsb was lost anyway (Bg3, f4). ",
        "14... Bxh2+": "I got this little \"in between\" move that is the reason I wanted to save the game. ",
        "15. Kxh2 hxg5": "Now the bishop is pinned, and white must lose it. But it has counterattack. ",
        "16. Bd3": "Threatening to check and pileup against the e column. ",
        "16... Rxh4+ 17. Kg1 Ne4": "I know I will lose the knight, but I wanted him to move his pawns in front of the king, while taking time to hide my king, and get activated the rest of my forces. Ng4 does nothing. ",
        "18. Bxe4": "Mistake?",
        "18... fxe4 19. Re1 f5": "It worked perfectly, as planned... and I kept my piece. ",
        "20. f3": "Now?",
        "20... Nf6": "I have to find the way to activate my queen and get space for castling. ",
        "21. fxe4 fxe4": "If I take with the knight, it will be pinned. But it still was better that this. ",
        "22. Qf3 Qd6": "Accepting Rxe5+, Kd7. Maybe too dangerous. But Now I threat the Qh2+, Qh1+, QxR, Qxb7+ sequence. ",
        "23. Qf5": "Preventing my castling and threatening g5. ",
        "23... Kf7": "Ok, so if you take g4, you open another column against your king. ",
        "24. Re3": "Let's see what can I grab from this. By the way, Rf5 was good before and still is. If Qxg4, Rg8 seems good. ",
        "24... Qh2+ 25. Kf1": "Now, Rf4+ wins a queen for a rook, and the game, but I played so quickly... then I realized I forgot. ",
        "25... Qh1+ 26. Ke2 Qxg2+": "Now, black probably wins, but it still to be demostrated. My opponend abandoned the game. "
    },
    "url": "https://gameknot.com/annotation.pl/gameknot-blitz-http-gameknot-com?gm=52188",
    "gameName": "GameKnot Blitz, http://gameknot.com/",
    "players": "Player  vs. damalfi ",
    "opening": "Scandinavian (B01), Marshall variation"
}