{
    "moves": {
        "1. d4": "If you've read my other games then this *is* what I play.",
        "1... d5 2. c4 dxc4 3. e3": "Yeah, yeah, some people play Nc3, but I do this.",
        "3... Nf6 4. Bxc4 Bd7 5. Nc3 Nc6 6. Bd2 Na5 7. b3": "If he wants to give me an isolated pawn in exchange for a stronger center and a half open file then go ahead I think it would be in my favor.",
        "7... Nc6": "?! He lose a tempo there.",
        "8. Nf3 Bg4": "?! He could have moved there in one turn.",
        "9. h3 Bd7": "So now he's lost another tempo.",
        "10. O-O": "And white's development is very near complete. White is much better here, I have almost exclusive control of the center, and am far better developed. I also have a space advantage as none of his pieces are past the 6th rank.",
        "10... e6 11. Qc2": "I connect my rooks.",
        "11... Bd6 12. Bd3": "I load up on his h7 square pinning his knight in defense.",
        "12... O-O 13. a4": "I try to gain some extra space.",
        "13... Nb4": "Unfortunately, it makes a hole.",
        "14. Qb1 a6 15. Re1 Qe7 16. Bc2 Bc6": "I now believe that black has equalized or is even in the lead. His bishops are *much* more active than mine, the only thing I have going for my is my center control.",
        "17. Bd1": "? I need to stop playing so passive.",
        "17... a5": "I like this, it makes b4 an outpost.",
        "18. Ng5": "His f knight cannot move under pain of checkmate. (It can move to e4, but I'd just take it.)",
        "18... h6 19. Nf3": "Well I lost a tempo but induced a slight weakness.",
        "19... Ne4": "?? Sad, he didn't notice it was attacked twice. He might have been winning until then.",
        "20. Nxe4 f5 21. Nxd6 Qxd6 22. Bxb4 Qxb4": "I get rid of that pesky knight only to have it replaced by...His queen. I'm up, but I'm extremely passive and need to move fast or he might be able to get a draw.",
        "23. Kf1": "So that he can't play Bxf3 Bxf3 Qxe1+",
        "23... b6 24. Bc2": "I try to pressure something, but I'm still sadly passive. But he's not taking very much advantage either.",
        "24... Bxf3": "I'm not positive I would have done that, it gets rid of one of his pieces and thus reduced his activity advantage, and it exchanges while he's behind. The only good thing for him is it doubles my pawns and isolates one of them.",
        "25. gxf3 g6": "?! Pointless.",
        "26. e4": "I try to break from passivity.",
        "26... Rfd8 27. exf5 gxf5 28. Rxe6": "Finally, I get at least one piece active. He can take back the pawn but oddly doesn't.",
        "28... Kg7 29. Bxf5": "Now it's black who's coming under the attack, and his queen once so threatening is now sadly disjointed. Compare this position to move 23.",
        "29... Kf7 30. Qe4": "Bringing another piece into the attack. Black is doomed.",
        "30... Rde8 31. Bg6+ Kf8 32. Qf5+": "Not long now.",
        "32... Kg8 33. Qf7+ Kh8 34. Qh7#": "Fun game richfeet."
    },
    "url": "https://gameknot.com/annotation.pl/game-five?gm=51286",
    "gameName": "Game five",
    "players": "porcho (1237) vs. richfeet (1081)",
    "opening": "Queen's gambit accepted (D20)"
}