{
    "moves": {
        "1. e4 c5 2. Nf3 Nc6 3. Bc4 e6 4. O-O Nf6 5. d3 d5 6. exd5 exd5 7. Bb5 Bd7 8. Bg5 Be7 9. Re1 O-O 10. Nc3 d4": "Black may have pushed too early here, but is certainly willing to initiate the carnage that follows.",
        "11. Ne4": "Best posting for the Knight; centered and doubly defended.",
        "11... Nxe4": "Black seems willing to gamble on a blunder in the recapture to get ahead.",
        "12. Bxe7": "The correct recapture, regaining the piece with a threat to the black Queen.",
        "12... Nxe7": "Another example of black's willingness to trade, with the faint hope of a white error.",
        "13. Bxd7": "Correct again, trading the bishops out. Black could grab a pawn here by 13...Nxf7, 14. KxN, QxB. This would have put him black ahead in material as well as weakening white's position.",
        "13... Qxd7 14. Rxe4": "Better than 14. dxe4. The capture by the Rook leaves the pawn center intact, and places the Rook on an open file.",
        "14... Rfe8 15. Ne5 Qf5 16. Nc4": "Looking towards Nd6 for the Rook/Queen fork.",
        "16... Rad8": "Black defends the fork square.",
        "17. h3": "Freeing a spot for the white King as well as marking time to see what course black will pursue.",
        "17... Ng6": "?? black seems to have forgotten the importance of the d6 square.",
        "18. Rxe8+": "White takes advantage of black's error to set up the fork by using the open file and a check.",
        "18... Rxe8": "Black only real choice.",
        "19. Nd6": "Now white gets the fork he has been seeking.",
        "19... Qe5 20. Nxe8 Qxe8 21. Qh5": "Attacking the c5 pawn.",
        "21... Nf4": "Black overlooks the threat to c5. The pawn advance b6 was better.",
        "22. Qxc5 Ne2+": "A somewhat gratutitous check; it is easily countered and the d4 pawn will fall soon. 22...Ne6 is stronger.",
        "23. Kf1 Nf4 24. Qxd4": "White chooses to grab black's last center pawn rather than press the black Queen with 24. Re1. The text move does threaten both the Knight and maintains the threat to the pawn at a7 while giving the white Queen better access to the white King side.",
        "24... Qe2+": "Another gratuitous check, and a dangerous one, creating a back rank mating threat for the black King.",
        "25. Kg1 Nxh3+": "One wonders if black has decided on suicide rather than resignation. The best move here was clearly 25...Ne6, removing both the threat to the black Knight and the threat of 26. Qd8++ while attacking the white Queen.",
        "26. gxh3 Qh5": "Black's final blunder; no attempt to stop the mate.",
        "27. Qd8#": ""
    },
    "url": "https://gameknot.com/annotation.pl/gator-knights-2012?gm=45547",
    "gameName": "Gator Knights 2012",
    "players": "major (1512) vs. diosynus (1457)",
    "opening": "Sicilian defence (B30)"
}