{
    "moves": {
        "1. e4": "Disappointed in my performance in the first round on Friday evening, I  decieded to re-enter. The friend I was staying with in Dayton was playing in  the 2-day schedule anyway so it wasn't that hard of a decision. This first  round on Saturday morning was only G/90, while all the others were 30/90,  SD/1 d/5.\n",
        "1... c5 2. Ne2": "The Keres variation. My opponent was a young kid who I had a lot of rating points on. I wanted to see what he would play against this, see if I could rattle his cage at all. I always knew I would transpose into the mainline sicilian with d4 and Nd4, sometimes this can be a good  system to play if you want to delay and see what sicilian system your  opponent may be aiming for, you can always play g3, Bg2 and play a closed  sicilian if you don't like their variation.\n",
        "2... g6": "I never really intended to  play a closed position, I just wanted to see what my opponent would do, so  now we transpose back into the mainline open sicilian.\n",
        "3. d4 cxd4 4. Nxd4 Bg7 5. Nc3 Nc6 6. Be3 Nf6 7. Bc4 O-O 8. Bb3": "All book so far...\n",
        "8... Na5": "Very  much out of book, black's two main options are ...d6 or ...a5\nAlternative variation: 8. ... d6 9.  Qd2 Bd7 10. O-O-O Rc8 11. Kb1 [The variation I was looking for] \nAlternative variation: 8. ... a5  [A line I've never actually seen before, but was shown to me after the game  by another player and actually has roughly as many games in my database as  ...d6] 9. f3 d5 [And now the move is 10. Bd5 but I'm not sure I would have  found it over the board.] \n",
        "9. f3": "In keeping with White's play in the  mainlines, but not the way to punish Black for his move.\nAlternative variation: 9. e5 Nxb3 10.  exf6 Nxa1 11. fxg7 Nxc2+ 12. Nxc2 Kxg7 13. Bxa7 f6 14. Be3 [With good  development and coordination White should have an edge here.] \n",
        "9... Nxb3 10. cxb3": "Probably exposes the king too much, especially since I was planning to  castle long.\nAlternative variation: 10. Nxb3 [Better, and White can castle short.] \n",
        "10... d6 11. Qd2 Be6 12. Bh6 d5 13. Bxg7 Kxg7 14. e5 Nd7 15. O-O-O": "Perhaps dangerous to  castle long here, but I wanted to roll the kingside pawns and press for the  attack!\n",
        "15... Rc8 16. g4": "Black cannot capture on e5 of course.\n",
        "16... a6": "Too slow from  Black\nAlternative variation: 16. ... Nxe5 17. Nxe6+ fxe6 18. Qd4 [And the knight will fall] \nAlternative variation: 16.  ... Qc7 17. Nxe6+ fxe6 18. f4 b5 19. Kb1 b4 20. Na4 [And the deficit of  castling long can be seen as the White king is very exposed. Black is not  winning outright, but has much more straightforward plans for the attack.] \n",
        "17. Kb1 Nb6": "17...b5 is very natural here before placing the knight on b6.\n",
        "18. h4 Rh8": "An odd move, hoping to contest the h-file but I need not open it  if I do not want to, and this takes the rook away from the attacking forces.\n",
        "19. h5 Qd7 20. h6+": "Now bringing the rook back into the game will be very  difficult.\nAlternative variation: 20. Nxe6+ fxe6 21. hxg6 hxg6 22. Qg5 Qc7 23. Ne2 [Black cannot  try to capture the knight.] Kf7 (23. ... Qc2+ 24. Ka1 Qxe2 [And now mate  comes.] 25. Qxe7+ Kg8 26. Qxe6+ Kg7 27. Qf6+ Kg8 28. Rxh8# ) 24. Nd4 Qd7 25.  f4 [Perhaps a stronger line for White.] \n",
        "20... Kg8 21. Qg5": "Bringing all the  pressure to bear on Black's king.\n",
        "21... Na8": "Too slow again.\n",
        "22. Rhg1": "Alternative variation: 22. Rdg1  [Perhaps better to keep one of the rooks on the h-file.] \n",
        "22... b5 23. f4 Qe8": "Black is in trouble now.\nAlternative variation: 23. ... b4 [The move I had thought Black would  try, but White still has plenty.] 24. f5 bxc3 25. fxe6 c2+ 26. Nxc2 fxe6 (26.  ... Qxe6 [Still not great as the knight can get tempo by returning to d4] 27.  Nd4 Qb6 [So that e6 does not come with Queen threatening tempo and to attack  the knight.] 28. Nf5 Re8 29. Nxe7+ Kf8 30. Nxd5 Qc6 ) 27. Nd4 Nc7 28. Rgf1 \n",
        "24. f5 Bd7 25. Nxd5 Kf8 26. fxg6 hxg6 27. h7": "Looking for mate down the  h-file, but there's a stronger try!\nAlternative variation: 27. e6 [A move I had looked at over the  board, but decided to go for the line I could see fully.] Nc7 (27. ... f6  [The move that I thought saved Black] 28. Nxf6 Nb6 (28. ... exf6 29. Qxf6+  Kg8 30. Qg7# ) 29. Rgf1 [and Black's busted.] ) 28. exf7 Qxf7 29. Rgf1 \n",
        "27... Kg7": "Alternative variation: 27. ... Rxh7 [Leads to the same] \n",
        "28. Rgh1 Rxh7 29. Rxh7+ Kxh7 30. Rh1+ Kg8 31. Nxe7+": "Plenty strong, in fact I thought my opponent would resign here,  but misses the mate.\nAlternative variation: 31. Qh6 f6 32. Qh8+ Kf7 33. Rh7# \n",
        "31... Qxe7 32. Qxe7 Nb6 33. Qf6 Rc1+": "And my opponent throws in the spite check.",
        "34. Kxc1 Kf8 35. Rh8#": ""
    },
    "url": "https://gameknot.com/annotation.pl/gem-city-open-dayton-oh?gm=50296",
    "gameName": "Gem City Open, Dayton, OH",
    "players": "MWebber (1757) vs. MaxEgan (1460)",
    "opening": "Sicilian (B20), Keres variation (2.Ne2)"
}