{
    "moves": {
        "1. e4 c5": "1.e4 c5, my go to move. I typically am aiming for a Sveshnikov, but  have recently found a new weapon I may be uncanning soon...\n",
        "2. Nf3 Nc6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 e5 6. Nde2": "?! Certainly a response I had never  seen. White aims to bring the bishop out via g2 but black can at least  equalize easily.\n",
        "6... Bb4": "I snapped this move off pretty quickly, if I had  thought about it for a bit longer I may have played to c5, it ends up aiming  at that pawn later and the pressure is very helpful\n",
        "7. a3 Ba5 8. g3": "A  small blunder. My opponent said later that he just mixed up his plans with b5  and g3 and just played a touch too quickly.\n",
        "8... Nxe4 9. b4 Nxc3 10. Nxc3 Bb6 11. Bg2 a6": "I was worried about the knight moving into b5 and then d6, or into  d5, but one move immoblizes the knight and holds well for black\nAlternative variation: 11. ... Bd4  [Hard for white to kick out this Bishop without relieving some of the  pressure in the position] \n",
        "12. Qe2 O-O": "Tucking away the king and indirectly  protecting the pawn from Bc3->Qe5 but Bd4 still holds in a nice way.\nAlternative variation: 12.  ... Bd4 \n",
        "13. O-O Re8": "...Bd4 still waiting to be played\n",
        "14. Bb2 Bd4": "Finally it gets in. If black can complete development and hold the pawn he  should have no problems\n",
        "15. Rad1 Ne7": "Looking to try a d5 push, but a much  simpler alternative is much stronger\nAlternative variation: 15. ... d6 [Now the Bishop can be  developed, the e5 pawn is protected, the Queen can move and the rook can come  behind the d pawn.] \n",
        "16. Rfe1 d5": "Too aggressive too soon. Again, d6  holds although the advantage is admittedly smaller.\n",
        "17. Nxd5": "The wrong  capture for White, gives some small advantage back to black\nAlternative variation: 17. Bxd5 [And  Black can't recapture] a5 (17. ... Nxd5 18. Rxd4 Nxc3 19. Bxc3 Qb6 20. Qh5  ) \n",
        "17... Nxd5": "But Black gives white a huge advantage right back!\nAlternative variation: 17. ... Bxb2  [I barely considered this move because I saw White can win the queen, but  didn't realize it came at much too high a cost!] 18. c3 (18. Nf6+ [Not this  immediately, because then Black can hold onto the DSB and could even have an  edge.] gxf6 19. Rxd8 Rxd8 20. Rb1 Bc3 21. Qf3 Nd5 22. Rb3 Kg7 [And Black  should have enough for the queen to win, albeit in a tough position that  White can continue to fight.] ) Bxa3 19. Nf6+ gxf6 20. Rxd8 Rxd8 21. Ra1 Bxb4  22. cxb4 Rd4 [And the game is quite a fight] \n",
        "18. Bxd4": "A fine move for  White, but he had even better\nAlternative variation: 18. Rxd4 \n",
        "18... Bg4": "The only try for Black\n",
        "19. Qxg4 Nf6 20. Qh4 exd4 21. Rxe8+ Qxe8 22. Qxd4": "Any capture of d4 or Bb7  is great for White here\n",
        "22... Rb8": "Black is only materially down a pawn, but the  bishop just dominates the knight in this position, which has no good squares  to go to, and soon Black will run out of usefull moves.\n",
        "23. c4": "Not  strongest but just fine, White continues to add pressure and Black remains  hard pressed to find good moves\nAlternative variation: 23. Qa7 b5 24. Qxa6 [Strengthens White's  position even more, but his road to a win is not hard] \n",
        "23... b6 24. Qd6 Ne4": "Just  a blunder in pressure, missed that the rook was also attacked and the queen  cannot recapture until after I moved the knight\nAlternative variation: 24. ... h6 [Makes some luft  for the king, but Black still finds it hard to activate their pieces and  White should have little problems promoting a pawn.] \n",
        "25. Bxe4": ""
    },
    "url": "https://gameknot.com/annotation.pl/gem-city-open-dayton-oh?gm=50295",
    "gameName": "Gem City Open, Dayton, OH",
    "players": "Bruce Hall Bryant Jr (1570) vs. MWebber (1756)",
    "opening": "Sicilian (B33), Pelikan (Lasker/Sveshnikov) variation"
}