{
    "moves": {
        "1. e4 c5 2. d4 cxd4 3. Nf3 e5": "Standard development.  Central pawn, which helps control the center.",
        "4. c3": "Going for an exchange.",
        "4... Nc6": "Black has other ideas.  Simple development.",
        "5. Bc4": "Development, and preparing to castle.",
        "5... Nf6": "Standard.",
        "6. Ng5": "I don't why white played this.  This is not an exception to the guideline as black wasn't making a threat, and with it, he moved the same piece twice, when the time could've been used to bring something else, into play.",
        "6... d5": "Interesting.",
        "7. exd5 Nxd5 8. Nxf7": "cplusplus11 in my previous annotation said, ...\"but you can't beat players over 1600 without getting lucky if you play hope chess.\"  Did geniusacamel lose even though he played hope chess against 2462, which is way above (862 points) 1600?, and is he playing hope chess since he gives away a free knight and did not see 8...Kxf7?",
        "8... Kxf7 9. Qf3+": "Obviously.",
        "9... Ke6 10. a4": "I don't know why white played this.  I would've played 10.0-0",
        "10... Be7": "Developing another piece.",
        "11. O-O": "At last, white castles.",
        "11... g5": "I don't know why black this.  It doesn't develop anything or help to control the center.",
        "12. h4": "geniusacamel sacrifices material yet again.  This time, it's a pawn.",
        "12... h6": "But, this time, his opponent rejects the offer. ",
        "13. a5": "And, now white has passed pawn.",
        "13... Rf8": "Pointless as this was played just to win that Q, this time.",
        "14. Qe4": "Of course, white gets out of it.",
        "14... Kf6": "I don't know why he moved here.",
        "15. Bd3": "But, that's because I would've immediately checked here with 15.Qf3+  However, I like this move better, as now black better be careful, or white mates.  That was the idea since this threat is difficult to drive off.",
        "15... Rg8": "But, not impossible.",
        "16. a6": "Starting to look dangerous for back, especially, when he winds up with doubled pawns, away from the center.",
        "16... b6": "I would've captured with 16...bxa6, but this is better, preventing those doubled pawns.",
        "17. hxg5+ hxg5 18. Nd2": "Developing another piece.  ",
        "18... Be6": "Same idea but with a strong bishop pair.",
        "19. Qh7": "Interesting move with pressure right on the seventh rank.",
        "19... Rg7": "As anticipated.",
        "20. Qh5": "I would've played 20.Qh6+",
        "20... Bc5": "Don't why black moved here.",
        "21. Ne4+": "But, white wastes no time and gets right to it.",
        "21... Ke7": "21...Kf5 was also an option, but I like this better as it avoids the nasty discover check with 22.Nd2+",
        "22. b4": "But, white has other ideas.",
        "22... Nf4": "Now, black does get a fork, but observe that this is ineffective because of 23.Bxf4",
        "23. Bxf4 gxf4 24. bxc5": "And, now white has compensation for lost material, proof that one move like, 8.Nxf7 doesn't make a difference.",
        "24... dxc3 25. Qh4+": "Idea: the skewer which gets the Q's off and will force a draw, in this position.",
        "25... Kd7 26. Qxd8+ Rxd8 27. cxb6": "And, now white has full compensation because if 27...bxa6??, black's forced to lose a N, in order to protect the R since that pawn would immediately promote after 28.a7  Once again, this proves that white's eighth move did not cause any damage.  Meaning: it did not affect him, at all.",
        "27... Ke7": "So, this is his next move.",
        "28. bxa7 Nxa7 29. Rad1": "I would've played 29.Rac1 for that pawn.  Though, black could then answer with 29...Rc8, no matter how you slice it.",
        "29... Bh3": "Going for mate, which is difficult to drive off.",
        "30. Ng3": "But, white, however, has ways out of it.",
        "30... fxg3 31. gxh3 Nc6": "I don't know why black played this.  ",
        "32. Be4": "To cover a lot, say 15 squares.  The more squares the B covers, the better shape you're in, as I learned from easy19.",
        "32... g2": "A passed pawn, that this time, isn't dangerous.",
        "33. Rfe1": "Because of this, and with the K there, the pawn can't do damage.  I know because this is another position that Jack has also made me study as HW.  It was only with one or two positions, with that pawn in front of a K, and asking what kind of damage it could do, and the answer is no.  In fact, this is, more often then not how a stalemate occurs.  However, I would've taken that pawn 33.Bxg2, but white has other ideas.",
        "33... Rxd1 34. Rxd1 Nd4": "Well, black has to do something since the N is en-prise.",
        "35. a7": "At last, white has a pawn that is going to promote.",
        "35... c2": "But, so does black.",
        "36. Ra1": "The obvious move, protecting the R, and ascertaining the promotion since the R is directly behind his pawn.  Meaning: That they're on the same file.  And, there's nothing black can do since his R is not on a8.",
        "36... Ne2+": "I idea is a free promotion, since without a N on e2, black would not be able to promote.  In fact, it would then be a win for white, but this move guarantees a draw.",
        "37. Kh2 g1=Q+": "And, now black Q's with no way out of it.",
        "38. Rxg1 Nxg1 39. a8=Q": "But, so does white.",
        "39... c1=Q": "Same thing could be said here, except black's ahead.  But, like before, it's not going to make a difference.",
        "40. Qa7+": "And, now it is a draw by repetition.  ",
        "40... Kf6 41. Qb6+ Ke7 42. Qa7+ Kf8 43. Qa8+ Ke7 44. Qa7+": "As we can see, white gave up a piece, but it did not cost him the game, even in a position like this.  And, up against a stronger player, unlike what cplusplus11 outlined.  So, the moral is that there's always more to a story then meets the eye, so don't judge a book by it's cover."
    },
    "url": "https://gameknot.com/annotation.pl/geniusacamels-elite-mt-1?gm=56800",
    "gameName": "Geniusacamel's Elite MT 1",
    "players": "geniusacamel (2366) vs. von_gooms_gambit (2462)",
    "opening": "Sicilian (B21), Andreaschek gambit"
}