{
    "moves": {
        "1. d4": "White opens things up with the Queen's Pawn, a good opening.",
        "1... e6": "Black goes on with what was their usual strategy. I don't like the openings I use anymore, and this game was the beginning of change, as this game will show, my opening will be a bit different. Today though, if I am black and white opens with the Queen's Pawn like this, I will respond with the Queen's Pawn Keres Defense, which is what this move is. ",
        "2. e4": "Well this is not part of the book, thus the book ends. White is giving his pawns structure. ",
        "2... c5": "At the moment, this is still part of my original opening pattern. I don't think it's bad in this position.  ",
        "3. d5 e5": "White didn't take and I decided to do the same. Computer analysis says this was a mistake though. Well I don't agree with that. It says 3. exd5 was the best move. Maybe, but taking is not always best, and I felt it was better to not take in this case. ",
        "4. Nf3": "Well that I actually expected, but it will be easy to protect the pawn.",
        "4... d6": "I could of played 4. Bd6, but I think connecting the pawns was best. ",
        "5. Bd3": "For sure white is preparing to castle.",
        "5... h6": "Well this did go along with my old strategy. My opening is different when you look at the board, but this was a wasted move. I realize that now, but I didn't see that then.",
        "6. O-O": "Castle as expected. ",
        "6... Ne7": "Computer analysis sees this as an inaccuracy. I agree with that, it would of been better to play the best move, Nf6, which would of allowed a little better development and better limited white's forces on the king-side. ",
        "7. Nbd2 Nd7 8. Nc4": "White puts pressure on black's d6 pawn, but that can be countered easily. ",
        "8... Nb6": "Okay, it's going pretty good for black right now, the start isn't bad. For the most part, black is actually countering white's moves pretty well, and I am happy with that. ",
        "9. Ne3": "White again does not take, which I am not surprised with. By the looks of things, he is going to advance his knights king-side. When this game was occurring then though, I was expecting that, thus I was not going to make it easy for white. ",
        "9... Ng6 10. g3": "I'd say this move was to keep my knight from advancing further. Good move by white, for if he didn't play that, I likely would of advanced my knight too, but this move does allow me to advance my bishop. ",
        "10... Bh3": "Of course white will move his rook. That is really the best move to make. ",
        "11. Re1 Be7": "I am trying to advance king-side myself too, as well as castle. ",
        "12. a4 O-O": "Castled as planned.  ",
        "13. b3": "Looks like white is connecting his queen-side pawns. There is not much to do on the king-side anyway. ",
        "13... Nd7": "I decide to get my knight out of there in case white plays 14. a5. I also feel I should get the other knight involved on the king-side as well. ",
        "14. Nd2": "White has plans for that knight on the queen-side. ",
        "14... Nf6": "I plan to advance my other knight king-side here still. ",
        "15. Ndc4": "The d6 pawn again. At the stage though, I am not concerned with that move, for white wouldn't attack and give up some points at this stage.",
        "15... b6": "I decide to give my pawns more structure on the queen-side as well. ",
        "16. Nf5": "Interesting, white is quite focused on that d6 pawn. It is holding up white's center and removing that pawn would greatly help white. With this move though, I am still not concerned, for if white attacks with what he has now on d6, black will come out with the advantage, thus I know white will not be taking anything yet. ",
        "16... Ng4": "Finally after 10 moves, the computer finally speaks up again. The computer analysis views this move as an inaccuracy and that the best move was 16. Qc7. At first I thought this was wrong, but when you look at how white replies, it makes sense. ",
        "17. f3": "This is why the last move I made was an inaccuracy. I basically wasted a move, because with the move white made, black will now have to fall his knight back to f6, which was where that knight came from the move before. Again, a wasted move, but only an inaccuracy. ",
        "17... Nf6 18. Bb2": "The board it tight, and there haven't been any captures yet. I'm certain white has plans though. ",
        "18... Qd7": "With a tight board, this limits both sides options. It makes the moves I should make harder for me though. ",
        "19. Nce3": "Pressure is taken off of the d6 pawn.",
        "19... Nh5": "Well, you have to agree, black has played great in this game, far north of his rating. This is the move though that would begin black's downfall, the first real mistake. It was hard for me to see why this was a mistake, but the next move white makes will make it a bit clearer to me. The best move was Qc7 again. Earlier I didn't agree with that. Now though, I totally agree with that, for now that the one knight is positioned elsewhere on white's side, the d6 pawn would be safe, thus Qc7 would of been just fine. Things won't play out that way though. ",
        "20. Bb5": "This is why that last move was a mistake, for white has a clear shot to my queen, and white get's deeper in black's territory. White can also play Bc6 if he pleases. ",
        "20... Qc8": "This was another mistake by black says the computer analysis. Qc7 was the best move, not Qc8. I'm not totally sure why. With either move made by black, white can play Bc6 and attack the a8 rook. ",
        "21. Bc6": "As expected, white attacks the rook. ",
        "21... Rb8": "Of course I won't give up my rook easily. ",
        "22. f4": "Little did I know that this move right here would be the case of black's downfall in a couple moves. ",
        "22... Nf6": "I played this to maybe attack the now unprotected e4 pawn. It likely was better to play 22. exf4. ",
        "23. fxe5": "This move is where I made the wrong decision. ",
        "23... Nxe5": "Blunder, big blunder! I didn't see it, but white had planned this. He moved his pawn up a move ago to attack the e5 pawn. I definitely should of took the pawn in response. This move was way bad though. 23. dxe5 was far better. Because I moved that crucial knight, not only is the Bishop on e7 gone, but that move will also take the queen. You can see what will happen I'm sure. I look at this now and I am shocked that I didn't see it! I think it is because I played my opponent pretty fast, and I need a couple of minutes at least to make sure I made the right move. I didn't do that here, thus white has won. I know better now though; don't make a move unless you are certain it is the right one.",
        "24. Nxe7+": "Queen is gone. ",
        "24... Kh8 25. Nxc8 Rbxc8": "Things went downhill for black pretty quick actually. Well again, I will play until the very end. ",
        "26. Bxe5": "I was expecting that move actually. Of course best is to play 26. dxe5.",
        "26... Rcb8": "??? Okay I do not know what in the world I was thinking here! A obvious blunder! I say to myself when I see this, \"I made that horrible move?\" Of course dxe5 was the best move. ",
        "27. Bxf6": "Well that's interesting. I would of thought white would play Bxd6. I would surely lose a rook. I would originally say that this is a mistake by white, but it's far from it. On top of the computer analysis saying nothing about this move, this is actually a good move. Why? Well, let the next moves explain. ",
        "27... gxf6": "At this stage, doubled pawns is not a good thing, especially now that white has a better path to black's king. ",
        "28. Qh5": "Yeah it's getting worse for white. ",
        "28... Bc8": "At this point there is not much for black to do now. ",
        "29. Qxh6+": "It is pretty much over, mate in 6. ",
        "29... Kg8 30. Qxf6": "This is peculiar. The computer analysis says that this was a blunder??? I agree with what others say about the computer analysis, \"The computer is not always right,\" and I certainly agree with that in this case. I do not see how this is a blunder at all. I'm thinking maybe the computer feels that white lost the quickest way to checkmate or something, but white is just positioning himself for checkmate. It will be over in 3 moves anyway, and I am certain the computer messed up here. ",
        "30... Bb7": "Again, there is not much else black can do. ",
        "31. Nf5": "It is over, mate in 1. ",
        "31... Kh7 32. Qg7#": "Checkmate. Well, this game was, interesting. Up until move 19 though, I played really good, and I mean really good! No big mistakes and I stayed mostly even with white. Move 19 started the end though. If I played that position from move 19 today, I would of easily countered. Once white took my queen though, it was obviously over. I gave it my best, but I wish I played the end way better. Despite the bad ending though, I think this game was my best against Geniusacamel out of the 4 games. Well, I'm glad to of had this game, for I learned a few things I didn't know. I hope you all enjoyed this annotation! I will have another one soon, game 3 at that. "
    },
    "url": "https://gameknot.com/annotation.pl/geniusacamel-vs-joveyboy1-game-2?gm=56693",
    "gameName": "Geniusacamel vs. Joveyboy1 (Game 2)",
    "players": "geniusacamel (2138) vs. joveyboy1 (1154)",
    "opening": "Queen's pawn (A40)"
}