{
    "moves": {
        "1. d4": "Hi everyone!\r\n\r\nThis is a thematic tournament that I am taking part in and another game against the Master Mater.  I did not get Freddied this time but he did have me all bottled up at the end and I ended up resigning the game on the grounds of ruinous loss of material as I would drop a knight just for starters.  We pick up the action on move 6 because the first five moves are forced.",
        "1... Nf6 2. c4 g6 3. Nc3 Bg7 4. e4 d6 5. f4 O-O 6. Be3": "6. Be3 - this move nearly takes me out of the database.  Freddy's lsb protects the f4 pawn and the d4 pawn keeping up that formidable white pawn roll on white's 4th rank.",
        "6... c6 7. Nf3 a6 8. Bd3": "6. Bd3 - sound, sensible development from white.  Boy don't those pawns look like the Hoover Dam!  If I bust that, what could those pieces behind it do?   Will Henry be faced with a deluge?  Maybe I should take care but the urge to make a bid for freedom gets the better of me.",
        "8... b5 9. Qe2 Ng4": "9.  ....... Ng4 - this move seems OK but it does give me room for error.",
        "10. Bd2 e5": "10.  ....... e5? - this move costs me a pawn.  Maybe I should have prepared with f6 first.  What do you the Inquest Jury think?",
        "11. dxe5 dxe5 12. cxb5 axb5 13. h3": "13. h3 - pawn stab - this is gonna prove decisive - just you watch!",
        "13... Nh6 14. Nxe5": "14. Nxe5! - better than fxe5 immediately doubling up the pawns.",
        "14... Qh4+": "14. ....... Qh4+ - I did consider taking on e5 but to do so against the Master Mater, especially as he has the Wicked Witch of the West and his dsb on the board would be sheer, utter folly, almost crying out to be Freddied (and he will gladly oblige!).  So, I figured out that the only chance of regaining my pawn would be to force a doubleton on the kingside, but not with the Witch on the board.  So, I saw a queen check.  Either he blocks on f2 or Freddy displaces his king and Glenda sits in his arc.  If the Witch blocks on f2 and then QxQ+, Kxf2 then surely the exchange of Fou Lenoir for that knight on e5 bears some logic, especially as Freddy just lurves those horsies of his?  I then figured that I might find some way of rounding up that e5 pawn and restore parity .....",
        "15. Qf2 Qxf2+ 16. Kxf2 Bxe5 17. fxe5 Kg7": "17. ..... Kg7 - ...... firstly though Henry must go to g7.  Firstly to defend the knight on h6 and secondly to create an escape square on g8.  That is the second stage of my plan to regain the lost pawn.  However, Freddy is not a Master for nothing and he sure finds a rabbit in the hat to put a fly in my ointment.",
        "18. a4 bxa4 19. Rxa4 Rxa4 20. Nxa4": "20. Nxa4 - what has happened here?  After a pawn trade and a rook trade the a column is opened up for a rook.  Yup, Freddy uses this opening to disastrous effect for Yours Truly.",
        "20... Be6": "20. ....... Be6 - Fou Leblanc develops at last.  This aim is to blockade the e5 pawn and then start piling up on it with Nd7.  Sadly that knight does not get to d7.  You will just see how ......",
        "21. Rc1 Rd8": "21. ...... Rd8 - if I now move that knight to d7 the c6 pawn falls.  Wait a minute, in retrospect (hindsight is 20/20 vision, eh what?) maybe I should have played this move because if Nd7, Rxc6, Nxe5 then his rook and lsb will be forked.  Ahhgh, I feel a right chessic dunce here!",
        "22. Ke2 Ng8": "22. ..... Ng8 - again Nd7 may have been better.",
        "23. Nc5 Re8 24. Bc3 Kf8 25. Nxe6+ fxe6": "25. ...... fxe6 - Fou Leblanc goes for Freddy's steed.  Now Freddy shows me just how powerful that bishop pair is.",
        "26. Bb4+ Kg7 27. Ra1 Kf7 28. Ra7+ Ne7 29. Bd6": "29. Bd6 - here Freddy gleefully announces that the clouds are gathering.  I politely ask him whether Old Matey is in these clouds.  He says, not yet.  Hmmm.",
        "29... h6 30. Bc4 g5": "30. ...... g5 - soon I am gonna be in Zugzwang (can you see how?).",
        "31. Rb7": "31. Rb7 - this is the stuff of nightmares.  There is no way I can avoid losing a piece and the rest of my army is tied down.  I therefore feel I have sufficient grounds for resignation as the material loss coupled with the passivity is ruinous.  Therefore I would prefer to wave the white flag than suffer further torture.  So I make the jammy so and so's weekend by handing him one rating point.  I am now playing him as white and I hope I can do better - I will never give up until I end that losing run against him and I don't care how long it takes, but when I do it will be a big event when the Genie finally arises from the bottle - cheers and bye for now.  Joanne"
    },
    "url": "https://gameknot.com/annotation.pl/genie-in-the-bottle?gm=29465",
    "gameName": "Genie in the Bottle",
    "players": "easy19 (2278) vs. jstevens1 (1771)",
    "opening": "King's Indian (E76), Four pawns attack, dynamic line"
}