{
    "moves": {
        "1. d4": "Here is my final round game from the Georgia State Championship. I was sitting on 2 points going into it, and since I was already out of the money this game was just for pride. I arrived at the board 35 minutes late after spending an hour or so hanging out with a couple of buddies of mine (one is a Life Master and the other a Fide Master). I was so engrossed listening to them talk chess that I totally lost track of time. Good thing this tournament had long time controls! When I finally approached the board, I noticed two main things - more than 20% of my time had already transpired and my opponent was obviously not very happy that I was late. So I simply looked at him and the clock one more time, smiled, and walked away to watch some other games for a bit. I figured that if I was already psyching him out, I might as well try to put him on full tilt. I had the white pieces, so I would at least have the initial advantage. I would simply play a system that I was very familiar with and play the opening very quickly. With over 45 minutes of my time now gone, I return to the board and play my standard 1. d4.",
        "1... Nf6": "A standard response played very quickly. After this move, and approximately the 15 or so to follow, my opponent looks at the clock and smiles to himself. I'm betting that he is counting on his huge time advantage to carry the day. That is precisely what I want him to think - if he is concentrating more on his time than on his game, I can steer the game into familiar territory for me and attempt to to play some themes that I have had much success with.",
        "2. Nf3": "Intending any variation of the QGA or QGD (my personal favorites).",
        "2... g6": "Black intends the KID.",
        "3. c4 Bg7 4. Nc3 O-O": "4...d5 is stronger IMHO. Black cedes white a little tempo.",
        "5. h3": "Given the time, I go ahead and play a defensive move to stall the progress of black's light squared bishop.",
        "5... d6": "? Again, 5...d5 was stronger.",
        "6. e4": "White claims the center. It is interesting to note that my last six moves were played in approximately 30 seconds.",
        "6... Nc6": "Black makes what seems to be a logical developing move, but it has a very real weakness that white exploits.",
        "7. d5": "! I did spend about a minute on this one. The aim is to either harrass the Nc6 knight OR double black's pawns on the e file.",
        "7... Ne5 8. Nxe5": "As intended.",
        "8... dxe5 9. Be2": "Developing and preparing 0-0.",
        "9... Ne8": "? I didn't like this move at all for black. It does clear some space, but it is a retreating move.",
        "10. O-O f5": "Whoa....black makes a huge commitment very early that weakens what was once a very solid castled position.",
        "11. Qb3": "Hitting b7 which slows down black's light squared bishop, but just as importantly x-rays the black king.",
        "11... Rb8": "Black prepares to develop his light squared bishop and/or start a queenside push.",
        "12. c5": "! Stymying the Ne8 and preparing a discovered check.",
        "12... Kh8": "Black sees the check coming and sidesteps.",
        "13. Be3": "This move was made with the hope that black would push his f pawn, therefore closing down pawn threats in the center.",
        "13... f4": "Black obliges. Again, it is important to realize that my opponent is moving lightening quick to preserve his huge time advantage. I'm betting the farm that my experience in these type lines is greater than his. White now intends to play for a big space advantage.",
        "14. Bd2 g5": "Black just keeps pushing on the king side. The main problem for him is that this \"push\" is unsupported.",
        "15. g4": "I spent some time with this one. The idea was that if fxg e.p. I could trade rooks on the f file and own it after 15...fxg e.p. 16. fxg RxR 17. RxR.",
        "15... Rf6": "This move caused me some pause as f6 is not a natural square for that rook. So.........",
        "16. f3": "........I just go ahead and lock up the king side.",
        "16... c6": "OK - let's just consider d5. It is now and will become even more the central point of tension for the duration of the game. Both sides direct their forces around the future action on this square.",
        "17. Rfd1": "Rook to half open file in support of the potentially volatile d5 square.",
        "17... Qc7": "? Black made a move that was very strange to me. I figured he would play Nc7. But the really interesting part of this move has nothing to do with the position of the board. When he made it, I promptly wrote it down, looked at the position again, then put a \"?\" next to the move on my score sheet. After about 5 minutes of looking at and scribbling on his own score sheet, my opponent asked me if he could see mine. He evidently had lost track of the moves somewhere along the way and wanted to get the move order straight for himself. Without thinking about it, I gave him my score sheet. He copied down my version of the game so far, then gave me a very quizzical look. He had seen my \"?\" next to his 17th move. Big mistake on my part. I stood up, scanned the room, and caught the eye of my Life Master friend. As we are both smokers, I gave him the international \"let's go smoke a cigarette\" hand sign and we went outside. Without going into the specifics of the game, I told him what I had done. He just laughed at me, took a long drag from his smoke and prepared to speak. I was hoping for some golden nugget of wisdom and all I got was \"You're an idiot. Learn the lesson and don't EVER do that again!\" Gee.....thanks Master:)",
        "18. Be1": "Feeling somewhat bummed for my lapse of common sense in score keeping, I return to the board determined not to let it affect me. My position is still very good IMHO. 18. Be1 clears the d file and even prepares for action at h4.",
        "18... b5": "Was black using the info he got from my sheet? I don't know, but he certainly decided to rev things up on the queen side with this very aggressive push. I don't take e.p. because I want to keep my queen aimed at d5.",
        "19. Rd2": "Preparing to double rooks on the d file.",
        "19... Ba6": "19 moves in and black finally develops his last piece. He has committed himself to a queenside attack.",
        "20. a3": "I liked this move, as it creates an \"escape square\" for the queen so she can still aim at d5, and I hope to eventually play b4 which will totally stall black's advance.",
        "20... Rd8": "Obviously black can't play cxd as an ugly knight fork will be his reward, so he just continues to load up on d5.",
        "21. Rad1": "As do I.",
        "21... Qc8": "Now may be the time that black uses the knowledge gained from looking at my score sheet, and clears a square for his knight to develop to.",
        "22. Qc2": "As I have more than enough ammo directed at d5, I keep my queen centralized and prepare to play the b4 that I was hoping for.",
        "22... Bf8": "? A telling move. 22...Nc8 would have been much more effective. The tension on d5 still remains, and black has now straddled himself with a weakend dark squared bishop whose true liability will be realized very soon.",
        "23. b4": "Lock down!",
        "23... Ng7": "This knight is STILL incredibly weak.",
        "24. dxc6": "! Time to start the fireworks! Black can't play 24...Rxc due to 25. RxR! he can't play 24...Qxc for the same reason. His only viable choice is to exchange rooks, which still leaves white in control of the file.",
        "24... Rxd2 25. Qxd2": "! Keeping the heat on the d file. The white queen now prepares to wreak havoc behind enemy lines.",
        "25... Rxc6": "Logical, but what about Ne6?. It is interesting to note that my opponent spent about 20 minutes on this move. The huge time advantage he once had is gone. Our clocks were now within a few minutes of each other:)",
        "26. Bxb5": "Of course! The true weaknesses of the d5 conflict AND black's premature queenside push is realized. White now safely wins a pawn.",
        "26... Bxb5 27. Nxb5 Qa6": "Interesting, and truth be told I wasn't counting on that. Black threatens to regain the pawn. However, he must first deal with his very awkward piece placement.",
        "28. Qd8": "Threatening mate on the next move.",
        "28... Ne6": "Black gets his knight back into the game and protects the vulnerable bishop while delivering a pesky attack on the intruding enemy queen.",
        "29. Qb8": "! White gets his queen right where he wanted her. Who cares if black goes pawn grabbing? Qe5  is the goal!",
        "29... Rc8": "All things considered, this was probaly best. Black is about to have some serious back row issues, so he gets his rook on it.",
        "30. Qxe5+ Kg8": "?? Loses the game. 30...Bg7 was a far superior move which would have given black the chance to pick off white's hanging knight.",
        "31. Nd6": "!! Been given a reprieve from a sure death sentence, the white knight delivers the crusher! Black CAN\"T take the knight. 32...QxN 33. RxQ! OR 32...exN 33. QxN  are threats that black just can't deal with.",
        "31... Qe2": "Black is grasping for straws.",
        "32. Qxe6+": "Black can ONLY move to a dark square. Forced mate in 2.",
        "32... Kh8": "32...Kg7 was no better.",
        "33. Bc3+ Bg7": "Forced.",
        "34. Qxc8#": "Checkmate! A very pleasing end to a rather average performance in the Georgia State Championship. I hope you enjoyed the game:) - Thomas"
    },
    "url": "https://gameknot.com/annotation.pl/georgia-state-championship-u1600-rd-5?gm=7421",
    "gameName": "Georgia State Championship (U1600 Rd 5)",
    "players": "Thomas G. (tag1153) (1402) vs. Jeffrey B. (1317)",
    "opening": "King's Indian (A48), East Indian defence"
}