{
    "moves": {
        "1. b3 e5 2. Bb2 Nc6 3. e3 Nf6 4. Nf3 e4 5. Ne5 Nxe5 6. Bxe5 d5 7. c4": "This is a new idea for me here.\nI always have trouble with the pawn on e5, so I'll offer the pawn on c4 to weaken it protection. If she trades, I'll play Nc3 and offer another pawn. After I recapture axb3, the rook'll come out on a4and I'll eventually trade the B for the N on f6.",
        "7... Bd6 8. Bxf6": "Yeah, I hate trading that dark B for her knight. But e4 is where the action will be, so I'll trade a piece that can't attack e4 for one that can.",
        "8... Qxf6 9. Nc3 Qg6": "Now that's an interesting move. I've got the feeling she's planning something very sneaky. Does she expect me to capture with the knight, and then I have to take another move to retreat it after she plays c6? And my bishop is stuck on f1 until I play g3.\nSo I think I'll take with the pawn, instead, and see what she has planned.",
        "10. cxd5 O-O 11. g3 Bg4 12. Be2 Bh3": "I don't think I'll ever get to castle kingside. Must be time to consider going the other direction, unless I really want to stay in the middle all game.",
        "13. Qc2 Rfe8 14. f4 Qh6": "I can't play Nxe4 because she would get to play Bg2. Even after I trade my knight for her bishop, I think I'd have to give up my rook.\nI think I'll play Kf2 first to protect that square. I don't feel like my king is out in the open on f2. The black squares are well guarded, and my bishop protects all of the white holes. I'd be a lot more reluctant to do that if she still had a knight that she could put on g4.",
        "15. Kf2 Qg6 16. Rac1 Qf5 17. d3 exd3 18. Bxd3 Qh5 19. Be2 Qh6 20. Nb5 Re7 21. Nxd6 cxd6 22. e4 f5 23. exf5 Rae8 24. Bd3 Qh5 25. Rhe1 Bxf5 26. h4 Re7xe1 27. Rxe1": "I'm a pawn ahead, so I'm happy to trade pieces.",
        "27... Rc8 28. Qd2": "I looked a long time at Qd1, but I'm afraid it leads to a perpetual check.\nWe trade queens and then bishops, and then he gets to play Rc2+. My king has to go to f3 so he can't threaten my pawn on g3. After Rxa2, I play Rc3 to get the open file, and I'm going to get a pawn back and go ahead again. But at some point, that rook will be checking my king back and forth, and I can't get away unless I'm willing to go to h3 and hide behind the pawn on g3. (Actually, I just thought of that while I'm typing this note and I didn't look at that line ... too late now.)",
        "28... b6 29. Re7": "I love getting a rook to the 7th rank.",
        "29... Bxd3 30. Qxd3 Rc5 31. Rxa7 Qxd5 32. Qxd5+ Rxd5": "I've got the pawn lead, so I want to trade off the big pieces. \nI've got my rook behind his pawns, and I want to keep his rook off of his 7th rank.",
        "33. Ke3 Rc5 34. Kd4": "Now, my king's far enough advanced that I don't think it'll hurt me if he goes to the 7th rank. I'm going to make a passed pawn on the queenside -- probably the b-pawn, and I can use my king to guide it in and the rook to keep his king from reaching it.",
        "34... Rc2 35. Ra6 Rg2 36. Rxb6 Rxa2 37. Rxd6 Rb2 38. Kc3 Ra2 39. Rd3": "This rook will keep his king from stopping my pawn.",
        "39... Kf7 40. b4 Ke6 41. b5": ""
    },
    "url": "https://gameknot.com/annotation.pl/get-a-pawn-up-and-trade-off-until-you-win?gm=39985",
    "gameName": "Get a pawn up and trade off until you win.",
    "players": "chuckbo (1973) vs. phenomenal (1988)",
    "opening": "Nimzovich-Larsen attack (A01), modern variation"
}