{
    "moves": {
        "1. Nc3": "? This is the Dunst Opening, but it is also a blunder.  I understand the logic behind this move.  Mark wants to develop his minor pieces, in the beginning.  Jack Stockel has told me that it is important to develop your minor pieces during the beginning game but not on your first move.  Otherwise, it destroys the center (prevents you from controlling the center), so the Dunst Opening is not studied by masters and grandmasters.  According to Mr. Stockel, you are supposed to play openings that are studied by masters and grandmasters.  However, Jack agrees with ION's assessment about the Nimovitz Defense.  In Other Words, he says that it is ok to develop on your first move, if you are playing the Nimovitz Defense.  On the other hand, this is not the Nimovitz Defense, so Mario has an advantage, in this position.",
        "1... e5": "One would think that this is the King's Pawn Game.  For the King's Pawn Game, however, 1.e4,e5 must be played.  Therefore, I do not know what this is called.",
        "2. e4": "In my opinion, the Dunst Opening has transposed into the King's Pawn Game.",
        "2... Bd6": "? You are generally supposed to develop your knight before your bishops, unless you have an immediate tactical advantage by developing your bishop before your knights.  However, this does not give Mario an advantage, in this position.  If I were black, I would want to play 2...Nc6 or 2...Nf6.  I think that I would prefer 2...Nf6 because it brings you one step closer to castling Kings Side.",
        "3. Bc4": "! This is solid because Rick developed his LSB, after his knight.",
        "3... Nf6": "! Mario made this move so that he could castle Kings Side.  Therefore, this is a good choice, in my opinion.  I understand this position because I usually try to castle Kingside, ASAP.  ",
        "4. Qf3": "? This is a mistake.  According to general opening principles, you are not supposed to develop your queen, so early.  Therefore, white has skipped the basics, in my opinion.",
        "4... O-O": "I am not sure, if this was a good move.  As I had mentioned earlier, I usually want to castle Kingside, as soon as I can.  However, I might not want to castle, in this circumstance.  That is because Rick brought his queen out, on move 4.  I am not sure what other alternatives I would consider, in this position.",
        "5. d3": "! At first I did not why Rick chose this candidate.  However, I quickly figured out that Rick moved his d2 pawn to pin Mario's g5 knight.  That will give him a winning advantage, and I will explain that shortly.",
        "5... c5": "?? I do not know why Mario made this move, but 5...Qg3 would have been his best move as it would have prevented a pin.  I believe, however, that Mario is starting to panic.  ",
        "6. Nb5": "Rick decided not to Fianchetto immediately because he wanted to chase Mario's DSB and force Mario to play 6...Be7, so it is ok.  However, I believe that it would have been better if white pinned Mario's knight, on this move, but Mark will play the pin shortly.",
        "6... Bc7": "?? Eventhough, the game is not lost for black, Mario is in serious trouble.  Even, 6...Be7??  Once again, Qg3 would have been much better.  At this point, Rick will pin Mario's piece with 7.Bg5.  In the meantime, Mario is getting more worried about the position, and it is overwhelming his defenses.",
        "7. Bg5 a6": "?? In my opinion, this was Mario's loosing blunder because Mark will be able to find an inevitable mating solution, in this position.  Therefore, 7...h6 would have been Rick's best move, and if 8.Bh4, 8...g5.  This would, however, lead to a King exposure, but \"'There is always an exception to everything\"', as chesskingdom64 would say.  This was one of those exceptions.  That is because 7...h6, 8...g5 breaks the pin.  At this point, however, Mario is as nervous as you can get, and it has caused him to loose concentration.",
        "8. Nc3": "In this position, however, Rick is forced to retreat his knight, but the game is almost lost for black.  I believe that Mario is less anxious, but, \"the damage has already been done\", as it is said.",
        "8... d6": "I do not know why Mario chose this candidate.",
        "9. Qg3": "!! Rick made this move to pin Mario's g7 pawn.  This brings Rick one step closer to a the mating pattern, that I had mentioned earlier.  In my history of playing chess, I have not been able to find a mating solution, with a pin.",
        "9... h6": "?? Mario chose this candidate because he thought that it would break the pin.  At this point, he has regained his confidence, but it is still, \"too little, too late\", as it is said.  In most cases, this is a way to break a pin, but, \"not this time\", as they say.  In addition, Rick will win a pawn with 10.Bxh6, with this pin.  However, Mario will still be pinned.",
        "10. Bxh6 g6": "?? Therefore, Mario makes this move, but is a serious blunder.  I initially thought that Rick would win a free rook with 11.Bxf8, but it is far worse then that.  In fact, the game is now officially lost for Mario because Rick now has an official mating against black.  Therefore, Rick will mate Mario in two moves with 11.Qxg6, Kh8 (forced) 12.Qg7#  ",
        "11. Qxg6+ Kh8 12. Qg7#": "It is generally a bad idea to get in nervous in a chess game.  When you become anxious, you do not concentrate.  Therefore, you overlook immediate danger, including mating threats.  However, you can overcome obstacles and prevent stress by believing in yourself.  If you believe in yourself, you can quickly solve problems, in most cases.     "
    },
    "url": "https://gameknot.com/annotation.pl/getting-nervous?gm=44094",
    "gameName": "Getting Nervous",
    "players": "1landshark (1031) vs. mrc61 (982)",
    "opening": "Dunst (Sleipner,Heinrichsen) opening (A00)"
}