{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Bc4 Bc5 4. d3": "The very quiet game. Ha!",
        "4... a6": "Probably the root cause of all my problems - preparing a square for the Bishop in case of 5.Be3. But why should White play this? Since he hasn't played 4.c3 there's no real likelihood of 5.b4 This passive move, as opposed to the more active 4...Nf6, just allows White a developing move.",
        "5. Nc3": "Which he's happy to take. He could, I guess, have gone gung-ho with 5.Ng5, but if you're playing the Pianissimo that's probably not your style!",
        "5... d6": "I still pass up the chance to get my other Knight out, instead allowing my light-squared Bishop to develop.",
        "6. Bg5": "Without the Knight on f6 this is a direct attack on my Queen, so now I have to develop my Knight, but not really where I want it!",
        "6... Nge7": "6...f6 right away seems unnecessarily hasty, since I can play that shortly anyway.",
        "7. Nd5": "My early passive play already coming home to roost!",
        "7... Be6": "Probably better to try to drive away the Bishop with 7...h6, but I'm suddenly aware of how behind in development I am.",
        "8. c3 Bxd5": "Giving up my light-squared Bishop...",
        "9. exd5": "Just to allow a pawn to kick my Knight around was certainly not the best plan.",
        "9... Na7": "And this, again is too passive; better on a5, perhaps, or to counter with 9...b5?",
        "10. d4": "White could probably have just castled here, allowing me to castle also; he's already got a strong position, though, and I suspect he senses blood...",
        "10... exd4 11. b4": "Now it's the Bishop's turn to be driven back. White doesn't really want a series of exchanges that will dilute his attack.",
        "11... Bb6 12. a4": "Threatening to win the Bishop, but I can counter with 12...h6, which I perhaps should have played long ago.",
        "12... a5": "Instead I offer rather feeble resistance to the a-pawn's advance.",
        "13. Nxd4": "And White takes my pawn.",
        "13... Bxd4": "Giving up the Bishop is not a good idea, but it wasn't doing much. However, this really hands White the initiative, when 13...O-O or 13...h6 would have offered a little resistance.",
        "14. Qxd4 f6": "Castling should be my first aim here, but I decide to drive away the Bishop first. Probably not as good as 14...h6, something that becomes clear later.",
        "15. Bd2 axb4": "I don't like that hanging pawn though, so exchange first.",
        "16. cxb4 O-O": "Finally!",
        "17. O-O": "White has acres of space. I don't like that diagonal to the King either, even though it's currently blocked by a pawn.",
        "17... Ng6": "Probably better to put the Rook on the open file, but I decide I need defenders! Another possibility was bringing the other Knight back into play via c8.",
        "18. Bd3": "Now two Bishops loom against my K-side.",
        "18... Ne5": "Having put my Knight on g6 as a defender I now go on the attack with it, but no way is White going to allow me to exchange it for his Bishop. In my head I have closed up the open file for a moment too, but my position looks very fragile. I haven't yet, at this point, made an outright error though.",
        "19. Bf5": "Horrible, aiming at that hole on e6, which the advnace of my f-pawn has opened.",
        "19... Nc8": "He's going to e6 and I can't stop it! At least I can, belatedly, get my other Knight back into the game.",
        "20. Ra3": "White is in no hurry to play a move I can't stop.",
        "20... Ne7": "At least I have two knights covering g6...",
        "21. Be6+": "Even though that Bishop will surely be the end of me.",
        "21... Kh8 22. Rh3": "Very nasty. I'm like a rabbit lookingat a snake.",
        "22... Ne7g6": "My first innacuracy; this Knight is better placed on g8, but I suspect I'm finished anyway...",
        "23. Qe4": "I'm not sure what point of this is - it seems to give me a moment to try to save the position.",
        "23... c6": "Instead, I kill my chances altogether. I really hadn't seen the mate coming, expecting an attack on the Knight on g6 after 24.f4.",
        "24. Qf5": "Only a move later do I see the point of this little shuffle.",
        "24... Qb6": "To prevent 25.f4. But it's over now.",
        "25. Rxh7+": "Of course - White can't go to h4 with the Queen, hence the side-step. h5 is undefended.",
        "25... Kxh7 26. Qh5#": "And that's where she goes... An object lesson in how just not making errors isn't enough."
    },
    "url": "https://gameknot.com/annotation.pl/giuoco-pianissimo?gm=65564",
    "gameName": "Giuoco Pianissimo",
    "players": "bold49 (2317) vs. feathered_tiger (1853)",
    "opening": "Giuoco Pianissimo (C50)"
}