{
    "moves": {
        "1. e4 c5": "Mini-tournament game, I'm playing black and opt for the Sicilian.",
        "2. Nf3 d6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 a6": "The Najdorf.",
        "6. Bd2 e5 7. Nf3 Be7 8. h3 O-O": "Fairly normal development.",
        "9. Bc4 Nbd7 10. b4 Nb6 11. Bd5 Nfxd5": "White wants exchanges, and it seems black gains tempo by giving white what he wants.",
        "12. Nxd5 Nxd5 13. exd5 Qc7": "Development is 3-2 for black, and black has castled while white has not. Further, black controls more of the center. It seems black has come out with a positional advantage thus far.",
        "14. Qe2 Qxc2": "14. Qe2? was a blunder that cost white a pawn.",
        "15. O-O Qg6": "Black is now threatening Bxa3, capturing the undefended pawn while the white pawn on g2 is pinned to the white king.",
        "16. Kh1 Bf5": "A move with two threats. 17. ... Be4 forks the white knight on f3 and the white pawn on d5. White has precious few options to save that pawn because his queen needs to stay home to defend the knight (else white's castle will be opened wide and his pawn structure destroyed). 17. ... Bd3 skewers the white queen to the rook on f1. Both moves win material for black, and white is ill-positioned to defend against both threats, though 17. Rfc1 eliminates the skewer threat and threatens to counterattack after 17. ... Be4 by playing 18. Rc7 and making threats of his own. Black would need to play 17. ... Rfc8 to contest the open c-file before playing Be4, which would then give white time to secure e4.",
        "17. g4 Bd3": "White didn't defend against either black threat, giving black the choice of which he wanted. Black chose to win the exchange, and consequently white chose to resign rather than play on, down a pawn + the exchange."
    },
    "url": "https://gameknot.com/annotation.pl/give-white-what-he-wants?gm=22992",
    "gameName": "Give White What He Wants",
    "players": "jabbawock (1451) vs. blake84120 (1883)",
    "opening": "Sicilian (B90), Najdorf"
}