{
    "moves": {
        "1. e4": "Hi everyone!\r\n\r\nIn several of my recent games Glenda the Defender has found herself on h6 - wow that is in the enemy camp!  Well, her excursions into the enemy camp have brought me various types of outcomes.  This is the worst one so I will get this one out of the way now.  This is a mini-tournament which featured the International Master Beafyness, who I will remind you scored 1-1 against Coach Ion.  This game is a Sicilian Dragon.  Sicilian Dragons and Sicilian Naijdorfs can be quite hairy because they can involve white castling long and black castling short.  Pawn storms on both sides can ensue.  The question is, who will Cop Old Matey first?  I think you can guess the answer here.....",
        "1... c5 2. Nf3 d6 3. d4 cxd4 4. Nxd4": "4. Nxd4 - these are pretty standard early Sicilian moves.",
        "4... Nf6 5. Nc3": "5. Nc3 - development and supporting the attacked pawn on e4.",
        "5... g6 6. Be3 Bg7": "6. ...... Bg7 - black's last two moves are characteristic of the Dragon branch of the Sicilian Defense.  As in the King's Indian and the Robatsch Defense the bishop on g7 will rake down all the way to a1.  That bishop will disappear but alas not my problems!",
        "7. f3 Nbd7 8. Qd2 a6": "8. ...... a6 - preparing a b5 pawn roll and preventing a white knight or bishop settling in on b5.",
        "9. O-O-O b5 10. Bh6 Bxh6 11. Qxh6": "11. Qxh6 - this capture of Ion's dsb first brings Glenda to h6.",
        "11... Bb7 12. g4 Rc8 13. Kb1 b4 14. Nce2 e5 15. Nb3": "15. Nb3? - this is the start of my problems - Ion pointed out that I should have played g5 here.  Now Ion steals a pawn in broad daylight.  I cannot recapture with the f3 pawn because the pawn on c2 and the h1 rook will be forked.  Also, I have the possibility of a knight fork on f2 to contend with ....... aaargh!  There is only one thing to do ......",
        "15... Nxe4 16. Qe3": "16. Qe3 - Glenda to the rescue!  At least she does have a threat of hopping on her broomstick to a7 and attacking that lsb on b7.  The Wicked Witch of the West scotches that plan, not only defending that turbulent prelate but piling up on my poor c2 pawn forcing my rook to defend it.",
        "16... Qc7 17. Rc1 Nec5 18. Nxc5 Nxc5": "18. ....... Nxc5 - knight trade.",
        "19. Rg1": "19. Rg1 - I now unpin the f3 pawn.",
        "19... O-O": "19. ..... 0-0 - has Ion castled into it though?  We shall see.",
        "20. h4": "20. h4 - I start a pawn roll of my own to try and open up Ion's draughty king.",
        "20... d5 21. Qh6": "21. Qh6 - now Glenda returns to h6 where she will stay for the remainder of the game.",
        "21... d4 22. f4": "22. f4 - onwards and upwards!",
        "22... b3 23. axb3 Nxb3": "23. ...... Nxb3!! - a stunning knight sacrifice.  I decided to ignore the attack on the rook by playing f5 because if Nxc1?? then f6 may well cook Ion's goose for him.",
        "24. f5 Qa5": "24. ...... Qa5 - the killer!  It is now mate in 4.  Please see Puzzle #21641 to work out how this will come about.  I decided to finish things on my own terms.  At least it looks in the final position as though I have just been pipped at the post.  I hope you have all had a good read.\r\n\r\nBye for now.\r\n\r\nJoanne",
        "25. f6 Qa1#": ""
    },
    "url": "https://gameknot.com/annotation.pl/glenda-on-h6-pipped-at-the-post?gm=29828",
    "gameName": "Glenda on h6 - Pipped at the Post",
    "players": "jstevens1 (1771) vs. ionadowman (2096)",
    "opening": "Sicilian (B75), dragon, Yugoslav attack"
}