{
    "moves": {
        "1. d4": "Hi everyone!\n\nHad another sparring match with The Dentist who is a former Class C Player (Optimum Rating 1407).  In this game I did not win copious amounts of material but I mounted a steady, stealthy attack.  Funnily enough, my precious queen, Glenda, known as The Defender played an almost pedestrian role until the very end of the game, when she delivered the Coup De Grace.  So, how did this happen?  Here is the gameknot analysis version: http://gameknot.com/analyze-board.pl?bd=18564122&fb=1&rnd=0.7170936876536426\n\n",
        "1... d5": "1. ...... d5 - my opponent likes to kick off with d pawn openings.  I decided to follow suite.",
        "2. e3 Nf6 3. f3": "3. f3 - The Dentist just lurves pushing those pawns.",
        "3... Nc6 4. c3 e5": "4. .... e5 - after getting my two knights out, I now push a pawn, to e5 to open up Fou Leblanc's diagonal (c8-h3),",
        "5. h3 exd4 6. exd4": "6. exd4 - pawn trade.",
        "6... Bd6 7. b4 Bg3+": "7. ..... Bg3+ - I now displace his king, but will this be a winner?  Only time will tell.",
        "8. Kd2": "8. Kd2 - probably best as it takes his king off the open e file and with the king on the second rank, more pieces can get out.",
        "8... O-O": "8. ..... 0-0 - I want to plonk a rook on the e column, so Henry now tucks himself away on the kingside.",
        "9. Kc2 Bf5+": "9. ..... Bf5+ - now Fou Leblanc comes out to harass the WK.",
        "10. Kb2": "10. Kb2?! (hmm, probably best is Bd3 and if Bd3 then Qxd3 - at least white would be better developed.",
        "10... Re8 11. Ne2 Nh5 12. Kb3": "12. Kb3?! - Hmm, I expected NxB.",
        "12... a5": "12. .... a5 - now I sense blood.  I need to open the a file and get my pieces at the WK.",
        "13. b5 a4+ 14. Kb2 Na5": "14. .... Na5 - The Dentist starts to shake like his drill, he is feeling very cold.  There is a dark, dark shadow over the queenside.  Old Matey!  Guess which square he wants to descend before you read on!",
        "15. a3 Nc4+": "15. ..... Nc4+ - I go there anyway but a3 gives his king a flight square.",
        "16. Ka2 Bd7 17. Nxg3 Nxg3": "17. .... Nxg3 - B for N trade.",
        "18. Rg1 Nxf1 19. Qxf1 Bxb5": "19. ...... Bxb5 - at last, I am a pawn up after that plethora of exchanges.",
        "20. Qf2 c6": "20. ..... c6 - opening up a line for Glenda.",
        "21. Bf4 Qb6": "21. ..... Qb6, sneaky .... wait for it .....",
        "22. Re1 Ba6": "22. ...... Ba6 - even more sneaky, wait for it .....",
        "23. g4": "23.  g4?? - he doesn't see it and so it is now ..... wait for it .....",
        "23... Qb3#": "23. ..... Qb3 MATE!!  Seeing the board two moves or so back, you could never envisage Glenda doing something like this, would you?  Well, in the next two games, you are about to see another side of Glenda the Defender!  "
    },
    "url": "https://gameknot.com/annotation.pl/glendadoom-part-1?gm=47403",
    "gameName": "Glendadoom Part 1",
    "players": "The Dentist (1145) vs. jstevens1 (1953)",
    "opening": "Queen's pawn (D00), stonewall attack"
}