{
    "moves": {
        "1. e4 e5": "Both players start of with the King's Pawn Game.",
        "2. f4": "Here, Nakamura kicks off the opening with the aggressive King's Gambit. I am not really surprised by this move, considering the fact that Nakamura is an aggresive player. What White hopes to do is to gain the initiative in exchange for a pawn's loss.",
        "2... exf4": "Andreiken plays the most popular move by taking the pawn on f4, and now we get into the fierce King's Gambit Accepted.",
        "3. Nf3 g5 4. Bc4": "Nakamura diversed into the King's Knight's Gambit.",
        "4... g4 5. O-O": "Nakamura heats things up by playing the Muzio Gambit, a highly aggressive opening! White gains maximum initiative, but lets Black chop down the knight on f3. This is definitely not for the faint hearted!",
        "5... gxf3": "Andreiken gets his chance and gets material advantage.",
        "6. Qxf3 Bh6": "Andreiken starts to protect the f4 pawn.",
        "7. d4": "Nakamura builds up his center.",
        "7... Qh4": "More protection to the f4 pawn.",
        "8. Nc3 Nc6 9. Nd5": "Nakamura threatens Nxc7, forking the king and the rook.",
        "9... Kd8": "Andreiken has no way out, but to move his king.",
        "10. c3 d6 11. Nxf4": "The f4 pawn falls.",
        "11... Nge7 12. g3 Qg4 13. Qg2 Bd7 14. h3 Qg8": "Nakamura starts aggression and attacks the queen.",
        "15. Nh5 Bxc1 16. Raxc1 Qg5": "Andreiken forks the knight and rook, replying to Nakamura's aggression.",
        "17. g4 Ng6 18. Rce1 Rf8": "Andreiken starts counterplay on the queenside.",
        "19. Qg3 Qh4": "Andreiken wants the Dames off the board. If White accepts the trade by taking the queen, the knight will retake, threatening to control key squares around the king.",
        "20. Qxh4+ Nxh4 21. Nf6": "Nakamura accepts the trade and starts to dominate the kingside of Black's.",
        "21... Ng6 22. Nxh7 Rh8 23. Ng5": "Nakamura bounces his knight around the kingside, eventually threatening Nxf7, which forks the king and rook.",
        "23... Be8 24. Bxf7 Ke7": "Andreiken defends against Nakamura's incoming attack.",
        "25. Kg2 Rf8 26. Bb3 Bd7": "Andreiken managed to get Nakamura's pesky pieces off his camp. Note that Andreiken does not want to take the rook on f1 as Nakamura would just retake with the other rook and gains control of the f-file.",
        "27. Kg3 Na5 28. Bf7 Nh8": "Again, Andreiksen is forced to defend against Nakamura's annoying pieces.",
        "29. e5 Nxf7 30. exd6+ Kxd6 31. Rf6+ Kd5 32. Nxf7": "Finally, Nakamura regains material, also leaving Andreiksen's king exposed.",
        "32... Nc6 33. b3 Rae8 34. Rc1": "Nakamura does not take on e8, because doing that allows Andreiksen to control the e-file.",
        "34... Ke4 35. d5": "Nakamura starts assaulting the queenside.",
        "35... Ne5 36. Re1+ Kxd5": "Nakamura lauches a series of bombardments on Andreiksen's king, starting from here.",
        "37. Rd1+ Ke4 38. Rf4+": "The crushing attack! Now Andreiksen's king's safety is in jeopardy.",
        "38... Ke3 39. Re1+": "A tactical skewer!",
        "39... Kd2 40. Rxe5": "Now Nakamura is able to isolate te king from his other pieces, and he has those monstrous passed pawns on g4 and h3, ready to promote. It is pretty much a no brainer to know that Nakamura has the advantage in this position.",
        "40... Bc6 41. Rxe8 Rxe8 42. g5": "It's one way to go.",
        "42... Re3+ 43. Kh4 Bd7": "A crushing blunder for Andreiksen! He allows Nakamura for one final shot and eliminate his position!",
        "44. Rd4+": "Nakamura forks Andreksen's king and bishop, and Andreiksen resigned! This position is hopelessly lost for Andreiksen. The line will go like 44...Rd3 45.Rxd3 Kxd3 46.Ne5+ and Nakamura wins more of Black's material. Then he can safely promote those passes pawns and win the game. A glorious game for Nakamura!\nOver here, I would like to thank a few people like thereaper1 and vincerino for providing useful comments in my annotations. A special thanks and hope you like this annotation!"
    },
    "url": "https://gameknot.com/annotation.pl/glorious-win-by-nakamura-at-2010-world-blitz-championship?gm=38916",
    "gameName": "Glorious win by Nakamura at 2010 World Blitz Championship",
    "players": "Hikaru Nakamura  vs. Dimitry Andreiken ",
    "opening": "KGA (C37), Muzio gambit, Paulsen variation"
}