{
    "moves": {
        "1. e4": "Gioachino Greco, also known as Il Calabrese, was born around 1600 in Celico, Italy near Cosenza in Calabria. In 1619, Greco started keeping a notebook of tactics and games, and he took up the custom of giving copies of his manuscripts to his wealthy patrons. In 1621 Greco took off to test himself against the rest of Europe, visiting Paris and later, London. He spent the last years of his life at King Philipp IV's court and died in the West Indies, seemingly from a disease that he contracted there around 1634.  This is one of his exciting games that includes a queen sacrifice. The moral of this chess game is dont be materialistic. ",
        "1... b6": "? Owens Defence. This is an old defence which is now considered dubious. This obviously prepares to fianchetto the light squared bishop. This move is still however popular against the English(1.c4) where it is far more effective. An early fianchetto by Black shows a willingness to defend against a big pawn center, picking away at it from the wings. In ceding so much territory, Black must be on constant guard against direct attacks on the King, as this game illustrates :)",
        "2. d4": "This grabs more central space.",
        "2... Bb7": "Logical threatening the e4 pawn.",
        "3. Bd3": "Defending the e4 pawn. Greco often preferred developing his bishop to d3 for some reason, rather than c4 or b5. As this game progresses, you will see that this piece is perfectly placed.",
        "3... f5": "!This move tries to undermine the center at the expense of the pawn, but this move also undermines the safety of his own king as you will see, because he is opening the dangerous h5-e8 daigonal.",
        "4. exf5": "Greco seizes the pawn, and the fireworks begin.",
        "4... Bxg2": "Oh no Greco has fallen for this childish trap or has NN just fallen for a silly trap? You'll see. ",
        "5. Qh5+": "! The only possible defensive move now is 5. g6. ",
        "5... g6": "It is interesting that hundreds of years after this game was played, all of the moves so far are still actually considered \"book.\" If you weren't aware of the date, you might believe that this game was from the Hypermodern movement of the early 20th century.",
        "6. fxg6 Nf6": "Threatening the queen, but black is to greedy and loses immediately. The typical continuation is 6...Bg7 7.gxh7  Kf8 8.hxg8=Q  Kxg8 9.Qg6 (or Qg4) Bxh1 and Black has a reasonable game.",
        "7. gxh7+": "Greco says who gives a damn! I don't need no Queen.",
        "7... Nxh5": "Black greedily accepts the material, like a rabbit in headlights or a kid in a candy store.",
        "8. Bg6#": "Checkmate! A beautiful queen sacrifice. Go Greco! Absolutely great! This is an instructive game espeially for beginner playing stronger players \" If you see that your opponent is offering you a piece for what seems like nothing check it and then check it again, don't grab, don't be materialistic!\" I hope you liked this game. I'm happy for positive and negative feedback aslong as its constructive criticism! and feel free to leave comments. One thing I would like you to do is before you rate this game please think honestly and think how I can improve on it and leave comments and PM me with them. Don't just give one and a half stars and not tell me why.\nThanks\nTom\n"
    },
    "url": "https://gameknot.com/annotation.pl/go-greco-go?gm=4081",
    "gameName": "Go! Greco Go!",
    "players": "Guicchino Greco (N/A) vs. NN (N/A)",
    "opening": "Guatemala defence (B00)"
}