{
    "moves": {
        "1. e4": "This is a game I played in a mini-tournament. It was a hard game, and at that time, our rating difference was 201 ELO points. I guess my opponent was not expecting me to play solidly, and was somewhat careless. Playing with the white pieces, I was looking for victory, so I played the solid 1. e4 .",
        "1... e5": "The simmetrical response to my first move, wich leads to open games.",
        "2. Nf3": "A natural opening move that may lead to the Ruy Lopez ( Spanish), the Giucco Piano ( Italian Game ), the Scotch, etc.",
        "2... d6": "The Philidor Defense. \"Named after the 18th century player Francois-Andre Danican Philidor, it has the reputation of being solid if somewhat unambitious.\" I don't like the Philidor - it's way too soft. I see loads of people playing Philidor on the Internet, and it annoys me all the time, because it leads to boring positions.\r\n\r\n",
        "3. d4": "The Exchange Variation of Philidor. White fights for influence in the center.",
        "3... exd4 4. Nxd4 Nf6": "A move that puts pressure in the center and prepares castling.",
        "5. Nc3": "Both defensive and development move.",
        "5... Be7": "At this point, Black's positions is unambitious but solid.",
        "6. Bc4": "?! I still doubt of the efficience of this move.",
        "6... c6": "? This move is passive and perhaps loses time.",
        "7. O-O O-O 8. Nf5": "!? I also question this move's usefulness. I guess I was trying to show my teeth.",
        "8... Nxe4": "? Black wins material, but he has overlooked the position. I then reply...",
        "9. Nxe7+": "Nxe7! I can smell horse blood.",
        "9... Qxe7 10. Qe1": "This move pins the black Knight and tries to win material.",
        "10... d5": "A natural defensive and offensive move that loses me a tempo.",
        "11. Bb3": "At this point, White is a pawn down, but has compensation in development and the pin in the central Knight.",
        "11... Qe6": "(?) a weak move because it pins the d-pawn. It seemed to me that black was preparing an attack to my king. I started looking for counterplay, and found...",
        "12. Nxe4": "!! This move forcefully wins material, because the black d-pawn is pinned by the bishop and a queen exchange doesn't favour Black.",
        "12... Qg6 13. Ng3 a5": "A loss of time.",
        "14. a4": "I didn't wanted a pawn storm in the Queenside, so I blocked the a-pawns.",
        "14... Na6": "An unambitious move. White can easily counter the attack in the queenside.",
        "15. c3 Nc5": "My position had a hole...but it could be treated.",
        "16. Qd1 Ne4": "Why did Black proposed the exchange? He gets nothing out of it.",
        "17. Nxe4 h6": "?? Black lost material to...advance his h-pawn? What a blunder.",
        "18. Ng3 f5": "Now Black's intentions are revealed. He wants to launch a Kingside attack, and  he then forgets his plans of a queenside pawn storm.",
        "19. Bc2": "The White bishop pins the black f-pawn, thus preventing the pawn push that would have forced the Knight to move.",
        "19... Qf7": "Black breaks the pin. Here, playing 20. Bxf5 or 20. Nxf5 is bad for white, because the f-pawn is defended by the Bishop.",
        "20. f4": "This move prevents the pawn push.",
        "20... b6 21. Bb3": "Again pinning the d-pawn.",
        "21... Bb7": "A bad move. The Bishoh is not active.",
        "22. Be3 c5 23. Qc1": "A move that protects the c-pawn.",
        "23... c4": "I was expecting this move...a rather anoying one.",
        "24. Bc2 d4": "? This loses a pawn. Or so it seemed to me...",
        "25. Bxd4 Qd5": "! Suddenly, Black's intentions were clear to me. He created a batery in the a8-h1 diagonal, threatening checkmate in one move. All those moves that seemed useless were indeed preparing a strong tactic.",
        "26. Qd2": "Forced.",
        "26... g6 27. Rad1": "This move threatens a discovered attack on the queen and the black b-pawn, wich is unprotected.",
        "27... Rad8": "Black protect his queen and refutes the discoverd attack.",
        "28. Rf2": "A protective move.",
        "28... h5 29. h4": "Preventing futher pawn push.",
        "29... b5": "The pawn isn't threatened anymore ; but at what cost?",
        "30. axb5 Qxb5": "The Queen was driven away for a pawn exchange.",
        "31. Rb1": "Protecting my b-pawn.",
        "31... Qe8 32. Nf1": "With this move, I tried to redeploy my Knight to a more useful square. My position is cramped, but the extra material compensates.",
        "32... Qe7": "Black insists in the Kingside attack.",
        "33. g3 Qe6 34. Qe2": "! The central move that unbalances the whole game. Black wasn't going for the exchange because of its material disadvantage. Suddenly, I get an open file, and I can start the offensive.",
        "34... Qc6 35. Qf3": "? Once again, Black refutes the exchange, but he could have won material with ... Qxf3 Rxf3 Bxf3.",
        "35... Rd5": "Instead of moving his queen, Black pinned his rook.",
        "36. Ne3 Rfd8 37. Nxd5": "Exchanging material was great to me!",
        "37... Qa6": "?? Why did he purposefully lose one rook for no compensation?",
        "38. Qe2": "This move prepares the attack, but unprotects the Bishop.",
        "38... Bxd5 39. Qe5": "SUddenly, White threatened mate! The whole point seemed close to me.",
        "39... Rd7 40. Qh8+ Kf7 41. Qg7+ Ke8 42. Ba4": "This move pins the rook. The scent of blood was more and more evident.",
        "42... Bc6": "Almost forced.",
        "43. Bxc6 Qxc6 44. Re1+ Kd8 45. Qf8+ Kc7 46. Be5+": "By constantly checking my opponent, I tried to win a material advantage.",
        "46... Kb6 47. Bd4+ Ka6 48. Re7 Rd6 49. Qb8 Rd7 50. Qe8": "!! This final position is beautiful. Black loses material and the game no matter what. Black resigned after seeing my final move."
    },
    "url": "https://gameknot.com/annotation.pl/golf2s-mini-tournament-no-1?gm=6206",
    "gameName": "golf2's mini-tournament  no.1",
    "players": "afonsoz (1073) vs. beryonthethinker (1274)",
    "opening": "Philidor (C41), Berger variation"
}