{
    "moves": {
        "1. e4 d5": "The Scandinavian. I'm not totally disappointed of it, in its new version if (!?) Icelandic Gambit. ",
        "2. exd5 Nf6 3. Nc3": "Now, my opponent is a +1900. Shall I go for e6? ",
        "3... Nxd5": "No, let the Icelandic gambit aside, and play \"normal\". This move is not good when white can go c4, but in this position it seems harmless. ",
        "4. Nxd5 Qxd5": "An exposed queen, but the only developed piece on the board, is not so bad. I bet that I can handle this. ",
        "5. Nf3": "Good. My queen's threats on e5 are not to be undervaluated. No hurry now to hunt the queen, that has its safe square already in mind: a5 and (after c6), Qc7. White will occupy the center in the meanwhile, but black is still solid and has an easy developement (Bf5 and Nd7. The bishop is to be exchanged, mainly. ",
        "5... Bf5": "I can delay my c6 plan a move, thanks to the missing white knight. Now I threat Qe4+ and Qxc2 (Nd4, QxQ etc.). ",
        "6. Be2": "Again, without pushing but calmly developing. ",
        "6... c6": "Also calmly (now that the lsb is \"out of the way\" of the b8 Knight), I prepare the escape way for my queen in case white wanted to kick my queen. But normally players do...",
        "7. O-O": "The spare tempo that helps black to catch up somewhat in developement. \nI had to decide here if e6 or e5. Both are possible, and it is not clear to me which is better. The decision has to be made in a number of similar position, so it is not easy to address. c5 is aggressive, but also blocks black's own pieces from an useful square and diagonal. e6 is more solid, and goes for a quiet game. Slighlty too defensive for my taste, but hey, I'm playing black against a 1900+ so...\nBesides, in both lines, the idea is to resist to Nh4 with Bg6, that is, accepting to have it exchanged to absorb the force of the white's attack and opening an useful semiopen h column. ",
        "7... e5": "What the hell! 1900+ or not, I won't play as chicken! :-))).\nSeriously. I hadn't too much time to calculate, but I swore everything was under control, and that white has handable attacks only. True or false?",
        "8. Re1": "Ok, that does look threatening, but still it is hard for white to break in. If d4, e4. And the other pawn able to break the black center is the f one. If it moves, white's king gets somewhat exposed. And black is castling-minus-two only, so white must hurry if he wants to attack. This is a good start. \nNow black: on the agenda is Bc5. Or Bd6, if the point to be attacked will be h2. This will happen after white's exchange of the knight for my lsb. So it is better for me to wait white's intention and release the dsb's developement a little, while I have useful moves like...",
        "8... Nd7 9. d3": "I doubt that in the previous move I could have tried to provoke white's knight manouver with e4, but then I said: \"Why lose a tempo, if I can get it for free?\" White is going right into it. The best thing I can do is to develop. If c4 (white seems not in a hurry to play it, but you must be aware all the time: the escape route forthe queen is still safe and open? Now it is, for sure, but after 9. c4, which will be the proper place for her? a5, d6 or e6?)",
        "9... O-O-O": "This brings a rook on a vital column. White's queen has not it easy to move if white insist in not playing c4. ",
        "10. Be3": "Well, this is known. You know, I don't have to worry because of Bxa2, because after b6, I win it for two pawns. My king gets exposed, but white has not it easy to get serious attack (?). Anyway. The right thing to do is to take advantage of this move to complete my developement. ",
        "10... Bc5": "The natural Nc4, that avoids white's exchange, and keeps my dsb, looks attractive, but in fact I kind of \"lose a tempo\" for developement. And I sensed that in this position, developement is first black's need. White is almost forced to accept the exchange, unless he wants to release all the tension with d4 (but a good player won't retreat of his earlier decision so easily). \nThe alternative is Be7, avoiding the \"Knight manouvre\" against my lsb. But in fact I am not disgusted if white plays it, so why take a dangerous way with Bd7, Bxa2? \nAh. Kb8, to defend a7... is a passive move. Not the required one if black wants to survive. ",
        "11. Nh4": "At last! The Knight Maneuvre!",
        "11... Bxe3": "Ok, a mistake. Maybe. But think. I prefer to have a pawn in e6 that a freeway to the white rook. Since I can actually handle e4 (can you see it? Am I right?), is a good moment to play it. The attack on f2 was only a dream, so better to forget it. I have in mind to keep control of the game, and this accomplishes that purpose. If white goes 12. NxBf5 instead, black must think hard about Bxf2+, and if 13. KxB, maybe something can be done starting with e4. This is for homework... :-)",
        "12. fxe3 Bg6": "This is probably the best way to handle Bg4 by white. If I go Be6, White would press me with Bg4, and I can't exchange (After QxB+, I think white has better game because of Bf3), This way, white will go Bg4, and if the knight leaves, black can play f5. In the meanwhile, black has in the agenda Kb8, to unpin the knight, and white can't do much about it (Is this true or false?)",
        "13. Bf3": "Aha. Now, do you remember the \"escape route\" for the queen? Did you considered this? Ok, the queen has plenty of squares to go, but which would you choose?",
        "13... Qc5": "Trying to provoke d4. After the exchanges, I have a fair game. Useless Qb5. I don't want to take this pawn with my queen even if for free. ",
        "14. Kh1": "Unpinning the pawn. I love white's king in that corner... :-O). Now: how to continue the attack? f5 looks good, but... what's the point? f4, maybe? Does it look good? And, during the game, I wasn't able to focus on the Qb4 move. It was not to threat b2, but because if white goes for NxB, hxN opens the column, and if I could get my queen to h4... but I can't. White does have defence against it... isn't it? So I played",
        "14... Nf6": "This doesn't go right to Ne4, taking advance of the pin on the queen, but the pin is an element to be taken into account constantly by both sides. I don't say it is the best move. If white goes Bg4+ now, NxB, QxB is safe enough for me (?)",
        "15. Nxg6": "White, white, what do you have in mind?",
        "15... hxg6": "Now. I can think about things like e4, d4, exB!?, dxQ, f3xb2+, Kxb2, RxQ, RxR (either) and Ng4 goes on with the initiative, if not the attack. ",
        "16. a3": "Does white want to start a pawn push on my king? e4 was still \"on\", I think....",
        "16... Nd5": "Threatening e3. Simple. ",
        "17. b4": "Now, Qc3 where does me lead? ",
        "17... Qd6": "Better was Qe7, looking for h4. But here, I threat e4, can you see? :-)",
        "18. e4": "White wants to block the advance of my pawn. Nc3 is good. But e4 is so appetizing, that I tried to figure if I could sac the knight in order to do it.  ",
        "18... Rh4": "I know that if exN, e4, g3, Qxg3, Re2, so I have to be ready for Rd-h8. But this move is a mistake. Because after e4xN, e4, g3, Qxg3, and white can defend h2. ",
        "19. Rf1": "Interestingly, white offers an exchange sac (Ne3, NxR). I was unable to see if was safe, but I doubted it. Anyway, exN is good for me, so...",
        "19... Rdh8 20. h3": "Now, it was very risky Rxh3+, Rxh3+, but again it is deadly if exN. That's very nice, but how to proceed? Get the exchange sac? White can play like this because he is playing good or not? Anyway, ",
        "20... Nf4": "The queen can come in with Qe6. I was looking for Nxh3. ",
        "21. Bg4+ f5": "Foreseeing that after the exchanges, my queen has free way to h6. ",
        "22. exf5 gxf5 23. Bxf5+ Kc7": "Or Kb8. ",
        "24. Qf3": "So white has conquered the defence of h3. Not a good result, and I think my attack vanishes. Bg4+ was to be avoided, since it allowed white to defend h3. ",
        "24... g6 25. Bg4 Rh4h7": "Now g3 is a threat. I better control white's queen entry on f7. ",
        "26. Rae1 Nh5": "Threatening again a fork, after e4. ",
        "27. Qe3 e4": "No matter if Qxa7. The last sparks of my vanished attack. ",
        "28. Bxh5 Rh7xh5": "Wiser was gxh5, but I wanted to keep the pressure on h, just in case. ",
        "29. Rf4": "I expected Rf7+. Kb8, Qxe4, threatening hard my king. ",
        "29... Rh5h7": "No point in exchanging pieces. ",
        "30. Qxe4": "A second pawn lost for nothing. The game is lost. ",
        "30... g5 31. Rg4": "Now, if Rh4, after Qe7+, there is a plethora of exchanges, and white has a won endgame. ",
        "31... Rg7 32. Qe5": "No use to keep the queen. Hers great prospects are vanished. But this is almost the end of the story. ",
        "32... Qxe5 33. Rxe5 Rf7": "No use trying to save the pawn, I seek for compensation. ",
        "34. Re2 Rf1+ 35. Kh2 Ra1": "Or Rh5. ",
        "36. Rxg5 Rxa3 37. Rg7+ Kb6 38. Ree7 Rb8": "I don't see better options. Now, by pushing the pawn white wins. ",
        "39. h4 Rc3": "Let's fight. ",
        "40. Re2 Kb5 41. Rg4 c5": "I have to exchange the pawn, my rook cannot keep trapped like that. ",
        "42. bxc5 Rxc5 43. c4+ Kb4": "Now my game is to push the a pawn. I better have the king around it - it won't get on time on the kingside. ",
        "44. Kh3": "Rb2+, Kc3, and white loses a pawn. Still winning, but in the meanwhile, black can make the a pawn run a little. ",
        "44... Kc3 45. Re3": "Ra2, a5. A this point, I lost my cool blood, and I didn't see the next white move, so I played...",
        "45... a5 46. d4+": "Ouch!",
        "46... Kd2": "The exchange is not really bad for me. ",
        "47. dxc5 Kxe3 48. Rg6": "A free tempo?",
        "48... a4 49. Rb6": "Kd4 will fail. So...",
        "49... a3 50. Rb1": "Another tempo gift. But a2, Ra1, Ra8, and the white pawns win. ",
        "50... Kd4": "Just fight!",
        "51. c6 a2": "Now is different. I will lose my pawn, but the other will take its place. If white goes to the promotion, I will get the first queen check. ",
        "52. Ra1 bxc6 53. Rxa2 Kxc4 54. h5 Kb3": "The king will take that rook sooner or later... wouldn't he? :-)",
        "55. Ra5 Kb4 56. Ra7 c5 57. Rc7 c4 58. g4 c3 59. g5 Kb3": "I have no time to put my rook on the c column to get a free promotion. ",
        "60. g6 Kb2": "Rxc3 and black is technically dead, or not? ",
        "61. Kg4 Rb4+ 62. Kg5 c2 63. g7 Rb3": "White can't promote right now because of Rg3+.",
        "64. h6": "but the other pawn will get it. He is waiting the last moment to exchange the rook. ",
        "64... Rc3": "Let's make him nervous. My pawn queens with check ;-) This cat is hard to kill, isn't it?",
        "65. Rb7+ Kc1": "Ka1 seeks the draw, so I spared us and wanted to see if I could survive. ",
        "66. h7 Kd1": "White must check me. And I thought I had a safe square on g1, but I was wrong. ",
        "67. Rd7+ Ke1 68. Re7+ Kf1 69. Rf7+ Kg1 70. g8=Q": "And now, it's two checks in a row. ",
        "70... c1=Q+ 71. Kh4+ Kh1": "I am well placed for a king hunting, even after h1=Q. ",
        "72. Qa8+": "White sees it. ",
        "72... Rc6": "In a hurry now, I think this is better...",
        "73. Rf1+": "Smart. ",
        "73... Qxf1 74. Qxc6+ Kh2": "Still a threat: if white goes h8=Q, Qh3+ and draw!!! ",
        "75. Qc2+ Kg1": "Over. ",
        "76. Qg6+ Kh2 77. Qg3+ Kh1 78. Qh3+": "I was looking for a stalemate, but... I couldn't find it.",
        "78... Kg1 79. Qxf1+": "79 moves, and some moments of thrill all throug the game... thank you for reading. "
    },
    "url": "https://gameknot.com/annotation.pl/good-for-an-intermediate-lesson?gm=50256",
    "gameName": "Good for an intermediate lesson?",
    "players": "zzathras  vs. damalfi ",
    "opening": "Scandinavian defence (B01)"
}