{
    "moves": {
        "1. c4 Nf6 2. Nc3 d6 3. Nf3 e5 4. d3": "Ou 4. d4 Cbd7 5. e4 c6 6. Fe2 Fe7 7. O-O O-O. Mais je ne veux pas jouer d4 !\r\n",
        "4... Nbd7 5. g3 Be7 6. Bg2 O-O 7. O-O c6 8. Nd2": "Ou bien 8. e4 Re8 9. h3 a6 10. Fe3 b5 11. a3 Fb7 12. Cd2 Cf8 13. b4 Ce6 14. Cb3 Dd7 15. f4 exf4 la grande ligne théorique !\r\n",
        "8... Qc7 9. Rb1 Re8 10. b4 b6 11. a4": "11. b5 sans attendre que les Noirs jouent a6 !\r\n",
        "11... a6 12. b5 Bb7 13. Nb3": "Coup douteux ! 13. bxc6 Fxc6 14. Cd5 Fxd5 15. cxd5\r\n",
        "13... cxb5": "Oui !",
        "14. Bxb7": "Car si 14. axb5 a5 !\r\n",
        "14... Qxb7 15. cxb5 axb5 16. axb5 Rec8 17. Bb2 d5": "Les Noirs ne sont-ils pas mieux ?",
        "18. e3 Bb4 19. Ne2 Ne8": "Pour amener le Cavalier en d6. Mais cela autorise la réaction blanche qui suit à l'aile-Roi...",
        "20. f4 exf4": "Préférable était 20... e4 21. Ced4. Maintenant, les pièces blanches s'activent !\r\n",
        "21. Nxf4 Bc3 22. Nd4 Bxb2 23. Rxb2 Rc5": "23... Cd6 immédiatement !\r\n",
        "24. Nc6": "Les Blancs pouvaient augmenter la pression avec 24. Tbf2...\r\n",
        "24... Ndf6 25. Qb3": "Quelle truffe je fais ! La Dame n'a rien a faire ici ! C'est à l'aile-Roi que ça se passe ! Mais j'avais calculé une variante où les Blancs troquent leur Dame contre les deux Tours noires.\r\n",
        "25... Nd6 26. Nd4 Ra5": "Alexandre a de la suite dans les idées !",
        "27. Rfb1 h6": "La variante en question 27... Cxb5 28. Cxb5 Taxb5 29. Dxb5 Txb5 30. Txb5 De7 31. Cg2 Cg4 32. Txd5 Cxe3 33. Txb6 Cxd5 34. Tb8  Df8 35. Txf8  Rxf8 36. Rf2, qui soulage les Blancs !\r\nIci, le mieux pour les Noirs est 27... Dd7 28. Db4 avec le petit piège 28... Cxb5? 29. Cb3 qui gagne une qualité ( -). Mais les Noirs ont 28. ...Cf5 qui leur donne l'avantage.\r\n",
        "28. Rc2": "28. Dd1 pour recycler la Dame !\r\n",
        "28... Rxc2": "L'échange aide les Blancs ! Les Noirs ont 28... De7 29. Cg2\r\n",
        "29. Qxc2 Ng4 30. Nc6": "Le bon coup ! La Ta5 est attaquée et la Dame noire est coupée de la protection du Pd5...\r\n",
        "30... Rxb5 31. Rxb5 Nxb5": "Coup accompagné d'une proposition nulle d'Alexandre... Si 31... Cxe3?! 32. Db1 Dxc6 33. Txb6 la qualite est très forte !\r\n",
        "32. Nxd5": "les Blancs sont mieux désormais !\r\n",
        "32... Kf8": "Il faut le mettre en h8 !\r\n",
        "33. h3": "33. e4 est plus fort ; le Cd5 est protégé et la diagonale a8/h1 est neutralisée ! La position est à nouveau égale après le prochain coup noir !\r\n",
        "33... Ne5": "Tudieu !",
        "34. Nxe5": "La position se complique et les Blancs relachent la pression. Meilleur est 34. Ccb4\r\n",
        "34... Qxd5 35. Qc8+ Ke7 36. Nc6+ Kd6 37. Nd8 Ke7": "Et nulle acceptée ! Heureusement, je n'ai pas cédé a...\r\n",
        "38. Qb7+ Qxb7 39. Nxb7 Kd7": "Et mon Cavalier est enfermé ! Moi, je trouve qu'Alexandre a fort bien joué !\r\n"
    },
    "url": "https://gameknot.com/annotation.pl/grand-prix-du-var?gm=19886",
    "gameName": "Grand Prix du Var, ?",
    "players": "Touvron, Fabrice (1981) vs. Oltra, Alexandre (1658)",
    "opening": "English opening (A16)"
}