{
    "moves": {
        "1. e4": "040\n",
        "1... e5": "041\n",
        "2. Nf3": "044\n",
        "2... Nc6": "043\n",
        "3. Bb5": "Apertura Española.\n",
        "3... a6": "044 \n",
        "4. Ba4": "044\n",
        "4... Nf6": "046\n",
        "5. O-O": "044\n",
        "5... b5": "043\nAlternative variation: 5... Be7\n",
        "6. Bb3": "044\n",
        "6... Bc5": "042\nAlternative variation: 6... Be7\nAlternative variation: 6... Bb7\n",
        "7. a4": "045\nAlternative variation: 7. c3\nAlternative variation: 7. d3\n",
        "7... Rb8": "042\n",
        "8. axb5": "044\nAlternative variation: 8. c3\n",
        "8... axb5": "044\n",
        "9. c3": "044\nAlternative variation: 9. Nxe5\n",
        "9... d6": "044\n",
        "10. d4": "045\n",
        "10... Bb6": "044\n",
        "11. h3": "044\nAlternative variation: 11. Na3\nAlternative variation: 11. Qd3\n",
        "11... O-O": "0460\n",
        "12. Re1": "045 Tanstaafl : highway\n",
        "12... h6": "041023\nAlternative variation: 12... Bb7\n",
        "13. Na3": "044 trail : because you have orns trail : use your head\nAlternative variation: 13. Be3 Bd7 14. Nbd2 Re8 15. Qb1 b4 16. Qc2 Na5 17. Rxa5 Bxa5 18. dxe5 dxe5 19. Nc4 Rb5 20. Ba4 b3 21. Qd1 Qb8 22. Nfd2 Be6 23. Qa1 Rc8 24. Ba7 Qxa7 25. Bxb5 Bb6 26. Qxa7 Bxa7 27. Nxe5 Rd8 28. Ndf3 Bb6 29. Bc4 Re8 30. Nd2 Bc5 31. Bxe6 Rxe6 32. Nec4 Bf8 33. e5 Nd5 34. Nxb3 Nf4 35. h4 Ra6 36. Ra1 Rc6 37. Ra4 Nd3 38. Nd4 Rc5 39. e6 Be7 40. Ra8+ Kh7 41. Re8 [1-0 Kamsky,G (2695)-Almasi,Z (2704)/Reggio Emilia 2010]\n",
        "13... exd4": "04617\nAlternative variation: 13... Re8\n",
        "14. cxd4": "045\n",
        "14... Na5": "046\n",
        "15. Bc2": "046\n",
        "15... b4": "049\n",
        "16. Nb5": "043 junglebee : Nxd6 and e5 I guess after c6 jensk : This is an odd way of playing the game of chess - but of course legal according to the rules :) junglebee : if Bd7 then just Bd3? junglebee : if Bd7 Na7 then Ra8 tnedev : Sb5 its Kasparov see last book Kasparov -Karpov tnedev : plan its d5 -N---c6\nAlternative variation: 16. Nb1 c5 17. dxc5 dxc5 18. Bf4 Qxd1 (18... Rb7 19. Qe2 Ra7 20. Rd1 Rd7 21. Nbd2 c4 22. Ba4 c3 23. Bxd7 Qxd7 24. bxc3 bxc3 25. Nb3 Nxb3 26. Rxd7 Bxd7 27. Ra6 [ 1-0 Van Willigen,J (2404)-Belis,R (2195)/ICCF email 2006]) 19. Rxd1 [1/2-1/2 Istratescu,A (2602)-Sofronie,I (2436)/Niort 2004]\n",
        "16... Ba6": "04474\n",
        "17. Na7": "041 junglebee : Qd7 Ra5! junglebee : Ra8 Ra5! junglebee : Bb7 Qd3 maybe junglebee : Ra8 Ra5! Ba5 Nc6 wins the bishop junglebee : white's knight is quite safe :) junglebee : after Bb7 the knight can go back to b5 if it has to Kingway : This is one of the first games where I've seen Magnus play a TN (as far as I know) in a main line opening. junglebee : for example he could play Bb7 d5 Ra8 Nb5 and know the knight could come to d4 Kingway : Usually he follows theory (which he knows well) as opposed to demonstrating new theory. He just doesn't have the big teams like Kramnik, Anand and Topalov have... tnedev : Shirov not read the book?! Kingway : Magnus is wicked good in middlegames and endgames and solid in the opening. Last couple weeks excepted, of course!\n",
        "17... Bb7": "04673 tnedev : d5 mauchess : c5\n",
        "18. d5": "04135 jensk : White is of course clearly better - could be a hard blow to this line jensk : I guess black must play something like 6 or c5 now jensk : c6 or c5 it is jensk : Qd7 Ba4! jensk : Its something about the centre - old wisdom\n",
        "18... Ra8": "04874\n",
        "19. Nb5": "046\n",
        "19... Nc4": "049\n",
        "20. Rxa8": "04145\n",
        "20... Qxa8": "047 Brassman : maybe Bd3 Drahacik : that horse got some exercise Drahacik : Kramnik has to lose two, not draw two, for Carlsen to tie him Adaptation : looks like Carlsen finally has a real chance to win Adaptation : Qd3 or Bd3 both look very good Adaptation : what happens after Qd3 Ne5 Nxe5 dxe5 Qg3. looks pretty strong Adaptation : Nh4 looks strange Adaptation : maybe it's good though Adaptation : Nh4 Qa5 doesn't look so good Adaptation : Nd4 is forced and then Bxd4 Qxd4 b3 Adaptation : MC Hammer obviously JonLudvig : the one and only Adaptation : Bd3 Ne5 Nxe5 dxe5 Qf3 also looks good Adaptation : Qe2 Ne5 Adaptation : yes, I noticed that jdmce, that's why I prefer Bd3 Ne5 Nxe5 dxe5 Qf3 here Adaptation : don't worry, they didn't agree to a draw :) Drahacik : Kramnik drew, Magnus can't catch him now. Drahacik : Any other GM tournament in the world has such a fast time control, only 90 minutes for 40 moves, no increment?\n",
        "21. Nbd4": "041735\n",
        "21... Qa7": "044\n",
        "22. b3": "044\n",
        "22... Ne5": "044 Drahacik : threat Nxf3. Drahacik : Bb2? Nxf3+ forces gxf3\n",
        "23. Bb2": "0489 Drahacik : ok, he wants gxf3 for attack on the g-file Drahacik : well, I wasn't wrong that gxf3 is forced :) Drahacik : Re8 looks solid Sweere : Black shouldn't take on f3 here Drahacik : maybe Bc8 to take the knight when it goes to f5 Sweere : g-file combined with Bb2 and Nf5 Drahacik : Sweere, your GOTD lectures are great Sweere : Black is worse, but no sense in aggravating it Adaptation : position looks pretty difficult for Black Adaptation : look at that great bishop on b7 junglebee : could he try c6? Adaptation : Qa2 Qc1. what's the point? Sweere : anybody can be wrong Adaptation : c6 is possible. White will play bxc6 Nxc6 Qd2 and is still better Sweere : it's just a case of probalibities Drahacik : \"worse\" and \"not level\" seem consistent to me, Jekyll Adaptation : I'm usually wrong about these things, but I'm pretty sure White is better here Adaptation : maybe John, but I wouldn't get comfortable if I was him :) macguber : White may have some pawn structure issues Sweere : good lesson to the rest of us Adaptation : isn't Liv Tyler married? :) SealBall : lol liv tyler is 33 Drahacik : 20 minutes with no increment, Shirov in bad shape on the clock Adaptation : how is Carlsen getting \"smacked\"?\n",
        "23... Nxf3+": "04557 jensk : Oh dear, I would really like to have a channel for adults only\n",
        "24. gxf3": "048 Adaptation : it looks like Shirov might get smacked today Sweere : nuts Adaptation : Kh1, Rg1 Nf5 the attack plays itsel Drahacik : this attack looks easy, Rg1, Nf5 Sweere : Shirov probably agrees too, but he has to play something SealBall : Absolutely Adaptation : well he needs to at least reach the time control, which isn't so simple jensk : This is imply horrible for black\n",
        "24... Qa2": "0469 Drahacik : e5 too to open the Bc2 Adaptation : how about just Qc1 Adaptation : and then Nf5 next Sweere : Qc1 will be played once Carlsen recovers from the shock Nf3 gave him Drahacik : Kramnik would play Qa1 because he has a bad pawn structure :) Adaptation : Qc1 is the only move after all SealBall : that Qa2...weird Adaptation : (not really the only move, but nothing else makes sense) Adaptation : Qc1 Re8 Nf5 is just a disaster SealBall : Qc1 Bc8 maybe Drahacik : how about Qc1 Bc8? Adaptation : Qc1 Bc8 Nc6 is also pretty ugly for Black\n",
        "25. Qc1": "Diagram # 04161 Adaptation : maybe he should play Qc1 Nd7, but I doubt he can hold on Drahacik : Nd7 and f6 idea? weak light squares Adaptation : and then e6 drahacik.... Adaptation : anyway Nd7 Nf5 f6 Kh1 looks like an unstoppable attack Drahacik : Ne8 :) deep defense Adaptation : Bc8 nc6 ozgur Adaptation : then Bxf6 and Ne7 are threats SealBall : Shirov is running out of time Adaptation : Black should play bxd4\n",
        "25... Bxd4": "0413\nAlternative variation: 25... Nd7 $14 [Deep Rybka 4 w32.]\n",
        "26. Bxd4": "041\n",
        "26... Nd7": "041 Adaptation : at least he doesn't lose immediately here Sweere : we're more in a Kramnik territory now SealBall : that precious bishop.. Adaptation : he loses slowly, after Qd2 SealBall : Qd2 Ne5 Kg2 ? Adaptation : actually, isn't Qd2 the end immediately Adaptation : Ra1 is a huge threat, so how does he save b4 Adaptation : Qd2 Qa5 Ra1 Qb5 Bd3 also wins the queen Sweere : Qd2 Nc5 e5 Ra8 inviting ed6 cd6 Re8 Indiana-Jones : Ne5 after Qd2? Adaptation : then just Kg2 SealBall : is it that clear after Re8 Rxe8 Bh7+ Kh7 Qa2 Bxd5? Adaptation : Qd2 Nc5 e5 Ra8 why not just the simple e6 Adaptation : with a huge attack Sweere : otr course White should avoid winning the queen that way Drahacik : Carlsen is in danger of winning a game for the first time in 6 games? Sweere : I said inviting SealBall : sorry Sweere : but Carlsen won't take the bait Adaptation : Kh1 was played?\n",
        "27. Kh1": "04218\n",
        "27... f6": "042 SirJohn : maybe Re3 with ideas Bb1 and also f4-Rg3 Sweere : ugly describes it well Rahmaninov : black is just lost,b4 pawn weak,white has b pair,chances on both flanks,if there are no any tactical ideas for black then its just 1-0 Adaptation : well it's really ugly, but Qd2 the move before would have finished things off easier\n",
        "28. Rg1": "0445 Adaptation : Kh1 was not very accurate SealBall : why not:(? SirJohn : I liked Re3 instead of Kh1 Sweere : he wants mate Adaptation : yes maybe it wasn't too inaccurate :) Kh8 Be3 is pretty much finished Drahacik : Kf7 Sweere : Rf7 now SirJohn : Rf7 defends Nakamura-STL : Surely this must still be good for White. Adaptation : Kh7 e5, or Kh8 Be3 and Kf7 pretty much speaks for itself :) SealBall : Rf7 only move Sweere : Rf7 planning Kf8 get outta Dodge Adaptation : Rf7 there is again Qd2 Sweere : horrible for Black Adaptation : Rf7 Qd2 Nc5 e5 is winning, must be because of Bh7 Sweere : Shirov's play look tired SealBall : i stiill trust in black's position :)) Sweere : he wasn't that sharp against Anand yesterday Adaptation : Shirov got two blacks in a row right? Drahacik : If the clock times were reversed, Shirov might have a chance. Sweere : they all do at one point or another jensk : The most important aspect of this game seems to me that Magnus's play puts the whole line in question jensk : Browsing through the game I find it hard to find improvements for black Sweere : yeah the whole line is suspect Sweere : Shirov's been scrambling from one opening to another lately Sweere : he needs a break from top level chess SealBall : yeah, the French would have been better\n",
        "28... Rf7": "04277 Sweere : Shirov's openings are not to par with the others Brassman : Bxd4 was stange Indiana-Jones : yup, 2 games against Kramnik in a week, game against Anand yesterday, and game today Brassman : strange jensk : Bd1 is interesting too jensk : ...followed by f4 and Bg4 etc. Indiana-Jones : impossible to play against those 2800 dudes, and be just easily worse by move 15 with black Sweere : I suspect Shirov has to prepare for every game individually (here) Sweere : that is very tiring Sweere : he copuld use some time off that too Drahacik : Sweere what do you mean, that he doesn't have a second? Sweere : no idea, but what can a second do if the groundwork of opening repertoire wasn't complete Sweere : Bd1 or Qd2? Sweere : he did? Sweere : it's no secret to Kramnik that he's in his best when he plays solid\n",
        "29. Qd2": "04474 Sweere : lots of help from Shirov today Sweere : bad play from the opponent is the best cure to poor form\n",
        "29... Qa8": "04158 Drahacik : h6 or b4?\n",
        "30. Qxh6": "04132 Drahacik : Shirov slams out Qxg1+! and Magnus has a heart attack : )\n",
        "30... Ne5": "0460 Drahacik : The only penalty for an illegal move is two minute extra for the opponent right? Play Qxg1+ just for fun then. SealBall : illegal move here, that's too unprofessional! SealBall : lol\n",
        "31. Bd1": "04162 Phela : carlsen is back\n",
        "31... Qe8": "04187 SirJohn : Qe3 is simple and winning\n",
        "32. Qe3": "04195\n",
        "32... c5": "0453\n",
        "33. Bb2": "0434\n",
        "33... Re7": "048 Drahacik : f4 Nd7 and d5 is hanging, and e4 is hanging\n",
        "34. f4": "04131\n",
        "34... Nd7": "04107\nAlternative variation: 34... Ng6 35. f5 Rxe4 36. Qg3 $16\n",
        "35. Qg3": "044\n",
        "35... Qf7": "0423 SirJohn : Bf3 SirJohn : Bf3, Kh2 next then Bg4\n",
        "36. Bf3": "0446 SirJohn : Bg4 allows Rxe4 SirJohn : Be6 Rxe6 caveman Drahacik : Caveman Rxe6 thanks for the free bishop SirJohn : d5 is pinned SirJohn : but now simpl Kh2 then Bg4 SirJohn : or e5 on Nf8\n",
        "36... Ba6": "0474 Drahacik : Bg4 Nf8\n",
        "37. Bg4": "0453\n",
        "37... Nf8": "043\n",
        "38. Bf5": "0421\n",
        "38... c4": "0421\n",
        "39. bxc4": "049\n",
        "39... Bxc4": "042\n",
        "40. Qh4": "0414\n",
        "40... Bxd5": "0410 SirJohn : no defensse at all SirJohn : Bxf6 SirJohn : f3 is good too SirJohn : f3 is the best yeah Exorcist : Bf6 Re4 JonLudvig : f3 looks really good. Bf6 Re4 might be a problem Drahacik : \"choose\" rather than \"find\", it's not like he doesn't see f3 :) GuessTheMove : Guess the Move! Tell me your predictions before each move. Exorcist : Kh2 Ng6\n",
        "41. f3": "04276 GuessTheMove : Correctly predicting 41.f3: JFernandez Gibhor Gambit101 HaagOne acirce (Tell GuessTheMove your guess)\n",
        "41... Be6": "0439 GuessTheMove : Correctly predicting 41...Be6: Gambit101 (Tell GuessTheMove your guess) JonLudvig : Rb7 JonLudvig : not a very good one, but all there is :)\n",
        "42. Bxf6": "04131 GuessTheMove : Correctly predicting 42.Bxf6: bshribharath Morad-Magdy jonina HelgeStrand Gibhor BrotherJohn SorryWoodpusher (Tell GuessTheMove your guess) JonLudvig : bf6 bf5 ef5 is kinda funny\n",
        "42... Bxf5": "046 Adaptation : Irish pawn center always wins SirJohn : all possible captures win\n",
        "43. exf5": "0460 GuessTheMove : Correctly predicting 43.exf5: OfficeMan  (Tell GuessTheMove your guess) Adaptation : IPC to the rescue!\n",
        "43... Rc7": "0457 AGF : i carlsen not from russia?\n",
        "44. Rxg7+": "04112 GuessTheMove : Correctly predicting 44.Rxg7+: BrotherJohn jps7 (Tell GuessTheMove your guess) AGF : is carlsen peter heine son??? Adaptation : yeah Qh6 Rc1 would be a funny end to the game :)\n",
        "44... Qxg7": "048\n",
        "45. Bxg7": "044\n",
        "45... Rxg7": "04123 GuessTheMove : Correctly predicting 45...Rxg7: Vampire jps7 NeedsaBrain (Tell GuessTheMove your guess) Adaptation : not clear if White could win without the h-pawn Drahacik : good fighting by Shirov to survive this long old-soul : how to win if black Knight is on h7 and Rook on f6? Adaptation : somehow it must be winning Adaptation : 4 pawns and a queen Adaptation : sorry, there can't be a fortress\n",
        "46. f6": "04182 GuessTheMove : Correctly predicting 46.f6: jps7 prolo FilthyGarbage  (Tell GuessTheMove your guess) JonLudvig : we'll see nh7 and rf6 now .P\n",
        "46... Rd7": "0435 JonLudvig : or ofc... not Adaptation : f5 nice :) Adaptation : but f5 d5 Qxb4 d4 is not so clear Adaptation : yes after f5 d5 Qxb4 d4 it isn't all that easy to win Adaptation : f5d5 Qxb4 d4 Qb3 Kh7 Qd3 Kg8 and next Kf7-xf6 Adaptation : it's hard to call the f3 nd f4 pawns \"passed\"\n",
        "47. Qe1": "04253 Lala : f4 is passed when black catches f6 Adaptation : still, the f3 pawn has a long way to go :) Drahacik : d5 Qxb4 d4 hard to do anything with that d-pawn coming\n",
        "47... d5": "0433 GuessTheMove : Correctly predicting 47...d5: Drahacik (Tell GuessTheMove your guess) Adaptation : yes drahacik, it's not a clear ending at all Drahacik : got to block the d-pawn with the king, no? Adaptation : should be winning somehow\n",
        "48. Qxb4": "0464 GuessTheMove : Correctly predicting 48.Qxb4: Boye jps7 Bruster jonina HelgeStrand (Tell GuessTheMove your guess)\n",
        "48... d4": "046 Adaptation : Qb3 Kh7 Qd3 Kg8 Kg2 Kf7 Kf2 and the king goes to d2, then the queen is free\n",
        "49. Qc4+": "0434 GuessTheMove : Correctly predicting 49.Qc4+: ChessclubFriend Jonmeista jonina climber81 (Tell GuessTheMove your guess)\n",
        "49... Kh7": "044 Drahacik : even with the White king blocking the d-pawn, what are you going to do with the queen and those 4 pawns? Drahacik : some kind of zugzwang forcing the N or R to mvoe?\n",
        "50. Qd3+": "0482 GuessTheMove : Correctly predicting 50.Qd3+: Jonmeista jonina Boye HelgeStrand jps7 bholu YesSir ChessclubFriend Jinder acepoint (Tell GuessTheMove your guess)\n",
        "50... Kg8": "043 Brassman : Qc5?? d3! Drahacik : Shirov's a genius to get to this position from such a horrible middlegame JonLudvig : more than 200 moves ;) magnus got so many pawns he can move Tvedas : solid observation\n",
        "51. f5": "04120 GuessTheMove : Correctly predicting 51.f5: Noknima (Tell GuessTheMove your guess) Tvedas : I predict a draw around move 275 :) Drahacik : he should have made 49 moves, then played f5. Drahacik : I don't think Shirov wants to take these pawns. use them as shelter old-soul : may be K F7\n",
        "51... Kf7": "04111 GuessTheMove : Correctly predicting 51...Kf7: kich acepoint jps7 Vilhaze Boye (Tell GuessTheMove your guess)\n",
        "52. Kg2": "046\n",
        "52... Kxf6": "045 JonLudvig : kf7 qc4 kf6 qg8 ke7 is safe?\n",
        "53. Kg3": "046 GuessTheMove : Correctly predicting 53.Kg3: Boye (Tell GuessTheMove your guess) JonLudvig : apparently :)\n",
        "53... Kg7": "0451 GuessTheMove : Correctly predicting 53...Kg7: Boye (Tell GuessTheMove your guess) Drahacik : What's the plan to win if Black just goes back Kg7-Kg8? Drahacik : maybe the king goes to c6 and some kind of zugzwang :) Drahacik : Capinerio and then what? Drahacik : you going to queen one of the pawns/ Drahacik : where?\n",
        "54. h4": "04123 GuessTheMove : Correctly predicting 54.h4: mavaddat CrazyIvan Dbronstein06  (Tell GuessTheMove your guess)\n",
        "54... Nh7": "045 Drahacik : +3 means the computer doesn't see anything at all for White. +3 is just the material count.\n",
        "55. Kf2": "0448 Drahacik : IronicForce, if the computer says anything less than +5 then it has no idea how to win.\n",
        "55... Nf6": "0471 GuessTheMove : Correctly predicting 55.. .Nf6: jps7 Dbronstein06 (Tell GuessTheMove your guess) Brassman : Shirov have not give up\"! atalik : Ke1 Sikandar : What does Mr. Atalik think about this position? Tvedas : Octopus Paul says it's a draw Drahacik : when you switch blockaders the pawn gets to d3 Tvedas : Octopus Paul is never wrong. atalik : Difficult to plot a winning plan\n",
        "56. Qd2": "0490 GuessTheMove : Correctly predicting 56.Qd2: Jekyll (Tell GuessTheMove your guess) atalik : Nh7 Sikandar : Put the King on d2/d3 and Qe6\n",
        "56... Nh7": "0449 GuessTheMove : Correctly predicting 56...Nh7: atalik Dbronstein06 (Tell GuessTheMove your guess) atalik : How to put the king on d3? Drahacik : d3 giving away the knight didn't work?\n",
        "57. Ke1": "0425 atalik : d3 Drahacik : d3 Qg5+ Kf7 Qg6+ Ke7 Qg7+ Ke8 Qxf6 d2 Sikandar : It should be easy it seems after all atalik : Here he should go Nf8 most likely Drahacik : gotta love it when 1600's say easy win atalik : Should be winning then possible with Queen and double f pawns against Rook and Knight Adaptation : it's not an easy win\n",
        "57... d3": "04170 GuessTheMove : Correctly predicting 57...d3: atalik FilthyGarbage Drahacik Kismate (Tell GuessTheMove your guess)\n",
        "58. Qg2+": "0411 GuessTheMove : Correctly predicting 58.Qg2+: Carlsberg (Tell GuessTheMove your guess)\n",
        "58... Kh8": "0444 GuessTheMove : Correctly predicting 58...Kh8: jps7 (Tell GuessTheMove your guess) Drahacik : Kh8 Qg6 threat Qe8+ atalik : Kd2\n",
        "59. Kd2": "0424 GuessTheMove : Correctly predicting 59. Kd2: HelgeStrand Carlsberg atalik jonina YesSir fredrix jps7 (Tell GuessTheMove your guess) atalik : Nf8 Drahacik : Nf8 stops Qg6\n",
        "59... Nf8": "0456 GuessTheMove : Correctly predicting 59...Nf8: atalik Caveman Drahacik Carlsberg (Tell GuessTheMove your guess) atalik : Only Nf8\n",
        "60. Qg5": "0418 GuessTheMove : Correctly predicting 60.Qg5: ruzomberok (Tell GuessTheMove your guess) Innocent : pawn to f6 and Queen to e7 atalik : Kh7 Drahacik : Kh7-Kh8-Kh7 Drahacik : ah, f6-f7 give f-pawn for d-pawn joejan : pawns f6,f5, h6 and qg7 !\n",
        "60... Kh7": "0471 GuessTheMove : Correctly predicting 60...Kh7: atalik  (Tell GuessTheMove your guess) Innocent : f6 Qh5 Qe8 QQe7 Tvedas : innocent has a point, getting a pawn on f6 and Q to e7 would be winning, no? Innocent : as it was already pointed out, Bogolubow-Alekhine :-) atalik : Yes resignable what Innocent says wins on the spot Drahacik : At move 30 nobody thought Shirov would make it to move 60 atalik : h5 f4 f6 f7 is another plan Drahacik : price of raisins in Norway goes up today Smurfie : h5, any, Qf6, Kg8 h6 zugzwang JonLudvig : what will black do ;) Smurfie : h5 Kh8 Qf6 Kg8 h6 seems pretty easy IBorg : white puts queen on e8, pawn on f6 and threat is to play qe7 when rook is on d7\n",
        "61. h5": "04417 GuessTheMove : Correctly predicting 61. h5: jonina kich HelgeStrand CrazyIvan vardi sjakk atalik FilthyGarbage Smurfie Jekyll whiffy (Tell GuessTheMove your guess)\n",
        "61... Kh8": "0445 GuessTheMove : Correctly predicting 61...Kh8: jeopardy (Tell GuessTheMove your guess) IBorg : qh6 and f6 is another way : ) IBorg : yeah seems white's going to win\n",
        "62. f6": "04132 GuessTheMove : Correctly predicting 62.f6: eranh CrazyIvan (Tell GuessTheMove your guess)\n",
        "62... Kh7": "0441\n",
        "63. f4": "0472 GuessTheMove : Correctly predicting 63.f4: jeopardy cibrashers DJ-Maddogg vardi annicks (Tell GuessTheMove your guess)\n",
        "63... Kh8": "0425 GuessTheMove : Correctly predicting 63... Kh8: cibrashers jeopardy (Tell GuessTheMove your guess) joejan : qe5\n",
        "64. h6": "0449 GuessTheMove : Correctly predicting 64.h6: cibrashers Dbronstein06 whiffy kilimanjaro annicks fredrix Kismate (Tell GuessTheMove your guess)\n",
        "64... Kh7": "0470 GuessTheMove : Correctly predicting 64...Kh7: cibrashers Schadenfreude Dbronstein06 ruzomberok YourJudge NETAO jps7 (Tell GuessTheMove your guess)\n",
        "65. f5": "044 salao : 1-0? MightyViking : Kh8 Dg7+ MightyViking : That variation is a draw, Caveman... MightyViking : Yes, fxg7. MightyViking : Black sacs his king so he can't be mated... junglebee : since black can't play Kh8 due to Qg7+ he has to keep his rook on the seventh. Meanwhile white will bring his king up to c6 or d6 and then play Qg7+ Rxg7 fxg7 and black's knight will be trapped.' junglebee : Kxd3 Nf6? How can the knight get to f6? junglebee : it is zugzwang here. Black has to give up the pawn. White will take d3 and then bring his king to d6 or c6. Then he will play Qg7+ junglebee : oh, stalemate\n"
    },
    "url": "https://gameknot.com/annotation.pl/grand-slam-final-masters-bilbao-esp?gm=34470",
    "gameName": "Grand Slam Final Masters, Bilbao ESP",
    "players": "Carlsen, Magnus (2826) vs. Shirov, Alexei (2749)",
    "opening": "Ruy Lopez (C78), Wing attack"
}