{
    "moves": {
        "1. e4 c5 2. f4": "The GPA",
        "2... Nc6 3. Nf3 g6 4. Nc3 Bg7 5. Bc4": "The mainline. The positional 5. Bb5 is also good (but for me that's a little dull)",
        "5... e6 6. f5": "\"Chess for cavemen\" as Julian Hodgson would say. Quite discredited in opening theory (unfairly I feel). Wischess20 plays the book refutation (..Nge7, ..d5)",
        "6... Nge7 7. O-O d5": "\"At least equality for black, refutes white's play\". So what do you play here for white? For example, 8. fg dc 9.fe+ Kxf7 10. Ng5+ Kg8 11. Nf7 Qd4+ is advantage to black. To play the Bc4 GPA its important to know all the main attacking themes.",
        "8. Bb3": "This is I think the best move, and is a relative novelty with the planned sacrifice. The fxg lines are weak against the uncastled black king, as they give black some breathing space opening the h file for his rook. Black needs to play very accurately for the next few moves to wriggle out of white's mating threats. The subtlety of Bb3 is to permit black to win the bishop on white's terms.. ie. not dc (opening the d file for an annoying check by the black queen on d4) but ..c4, ..cb, and after ab white can whip his rook into the attack via a4.",
        "8... c4 9. fxe6": "White can avoid the sacrifice with 9. Ba4, 10. Bxc6 if he wants, although this is fine for black.  An example of 9. fg  \n[White \"Karpov, Petr\"]\n[Black \"Kutepov, Dmitry\"]\n[Result \"0-1\"]\n[ECO \"B23\"]\n[WhiteElo \"2087\"]\n[PlyCount \"48\"]\n[EventDate \"2004.09.??\"]\n1. e4 c5 2. Nc3 Nc6 3. f4 g6 4. Nf3 Bg7 5. Bc4 e6 6. f5 Nge7 7. O-O d5 8. Bb3\nd4 9. fxg6 hxg6 10. Ne2 b5 11. d3 Bd7 12. Ng5 Ne5 13. a4 bxa4 14. Ba2 N7c6 15.\nc3 Bh6 16. h4 Qe7 17. cxd4 cxd4 18. Qxa4 f6 19. Nf3 Nxf3+ 20. gxf3 Bxc1 21.\nRaxc1 Nb4 22. Qb3 Nxa2 23. Qxa2 Rxh4 24. Nxd4 Qd6 0-1\n\n",
        "9... cxb3 10. exf7+ Kxf7": "10. .. Kxf7 is the most confident (and I think correct) attempt to refute white's play [Event \"ARG-ch sf 84th\"]\n[Site \"La Plata\"]\n[Date \"2009.05.02\"]\n[Round \"4\"]\n[White \"Cappelletti, Gabriel\"]\n[Black \"Walsh, Hector\"]\n[Result \"1-0\"]\n[ECO \"B23\"]\n[BlackElo \"2134\"]\n[PlyCount \"37\"]\n1. e4 c5 2. Nc3 Nc6 3. Bc4 g6 4. f4 Bg7 5. Nf3 e6 6. f5 Nge7 7. O-O d5 8. Bb3\nc4 9. fxe6 cxb3 10. exf7+ Kf8 11. axb3 Bg4 12. d3 Bxc3 13. exd5 Bxf3 14. Qxf3\nBd4+ 15. Kh1 Nxd5 16. Bh6+ Bg7 17. Rae1 Bxh6 18. Re8+ Kg7 19. f8=Q+ 1-0\n\n",
        "11. Ng5+ Ke8 12. axb3": "Bringing the other rook into play",
        "12... Bxc3": "\"When ahead, exchange into a winning endgame\". Except when the piece being exchanged (the black-square bishop) is important for defence. This is a weak move for black.",
        "13. bxc3": "I briefly considered the silly dc (making 2 sets of doubled pawns) with the intention of bringing the bishop on c1 into the battle. But this is not necessary.  Preferable is to capture towards the centre, bringing the bishop in next move via d4. White needs to keep one eye on the endgame if black survives the attack",
        "13... h6": "13.. de is better and black should survive after 14. Nf7 Qb6+ 15. Kh1 Rg8",
        "14. Nf7 Qd7": "Or 14..Qb6+ 15. d4 still winning for white"
    },
    "url": "https://gameknot.com/annotation.pl/grand-prix-attack-gpa-5-bc4?gm=28490",
    "gameName": "Grand Prix Attack (GPA) 5. Bc4",
    "players": "longtail99 (1738) vs. wischess20 (964)",
    "opening": "Sicilian (B21), Grand Prix attack"
}