{
    "moves": {
        "1. e4": "So, I start with the King's Pawn Opening.",
        "1... e6": "So, he decides to respond with the French Defense.",
        "2. Nf3": "? Of course, my only goal is to develop.  As schkertjie mentioned in a different game, \"your main goal should be to develop, develop, develop.\"  However, this is my first mistake, as cdeburca points.  Afterall, this is not the Ruy Lopez and it's not going to be anything like the Ruy Lopez.  Best was 2.d4.  It's true that 1...e5 wasn't 't played. I am thinking about 1.e4, e5 2.Nf3, e6 3.d4.  Now, this also might have started as the same version, but with a transposition, given, that 2 out of the 4 moves had been played, but in a different order.  On the other hand, my opponent said, \"Different openings have different best moves. 2. d4 is generally played whenever black doesn't advance a pawn two squares. So it's commonly played against the Caro-Kann (1. e4 c6 2. d4), the Pirc (1. e4 d6 2. d4) and the French (1. e4 e6 2. d4).\"\r\n\r\n   ",
        "2... d5": "So, he responds by attacking my e pawn.  That, however, does not bother me, as I will exchange my pawn with his.",
        "3. exd5 exd5 4. Bd3": "Right now, I am only interested in continuing with development.  Of course, I am only thinking move by move, but this is where I want a little more then that.  However, he said, \" You should be interested in attacking; it's the point of chess. Especially when you're white. So the negative consequence of this move is that your d-pawn and dark-squared bishop are both blocked, and you'll have to waste time later on to unblock them.\"\r\n ",
        "4... c5": "For some reason, however, he decides to advance one of his pawns.  I am not sure why.  Afterall, this is not close to an end game.  I am not sure what he is planning, in this position.",
        "5. O-O": "So, I don't waste time to castle.",
        "5... Nf6": "However, he is also interested in developing and castling, so he starts with this move.",
        "6. b3": "Now, all I want to do is get all of my pieces out, onto active squares.  Of course, I now know that there is more to chess, during the beginning, then just development and getting pieces out onto active squares.",
        "6... Be7": "So, he continues to develop and prepares to castles.",
        "7. Qe1": "In the meantime, I told that there was a long term consequence to his last move, as I could pin the bishop.  I also told him that this move would, eventually, stop him from developing his LSB or b8 Knight.  Now, I see that it does not do that.  In addition, I told him that I could develop my b1 Knight, without getting it pinned.  However, he said, \"It doesn't concern me that you can pin my bishop; I was going to castle anyway and break the pin. Meanwhile your rook is more usually put on e1, not your queen, so again, your pieces aren't being optimally developed.\"\r\n",
        "7... O-O 8. Bb2": "So, I now decide to fiachetto my LSB.",
        "8... Nc6": "Now, he decides to develop his other Knight.",
        "9. Nc3": "So, I respond, by doing the same thing.  However, I told him that there was drawback.  What is it?  I told him that it could get kicked around, and he said, \"It won't get kicked around the board. If I play ... d4, your knight can go to e4, so I'm just wasting my time. It's only worth kicking pieces if it gains me something. So I'm going to keep your pieces out of b5, just to restrict them a bit more.\"\r\n",
        "9... a6": "That is why he plays this.",
        "10. Ne5": "?? In this position, my goal is to exchange knights.  However, \"I'll take this. I can see that when you take back with the queen, I can put my bishop to a better square (d6) with tempo - I'll be attacking your queen. You've blocked off your dark-squared bishop, so I'm not too worried about moving my bishop away from my knight on f6\", is what he says.  As it turns out, this the loosing blunder, as we shall see.  \r\n",
        "10... Nxe5 11. Qxe5 Bd6": "Now, I have to protect the Queen, but now he is going to do something, that I did not expect.  What is it?",
        "12. Qg5 Bxh2+": "This is it!  I had to protect my Queen.  While doing so, he takes advantage, by exposing my King.  At first, I thought that this was his loosing blunder, instead.  Why?  I reminded him that in one of my games against, blitzkov, as you'll see under the, \"misstep\", I lost with a similar move.  I decided to sac a piece for one of his pawns, to expose his King and stop him from castling.  Although he lost the opportunity to castle, his King was never exposed, and giving up a piece that early, was the loosing blunder.  This time, however, he has other plans, so my King is really exposed.",
        "13. Kxh2 Ng4+": "He takes advantage by placing me in check, and this is very serious, as I am going to loose the Queen.  That is why, 10.Ne5 was the loosing move.  Therefore, \"You need to look further! I've just won your queen\", is what he says, after 14.Qxg5.\r\n ",
        "14. Kh3 Qxg5 15. Be2": "BTW, he explained how you think more then one step ahead, without miscalculating, by saying, \"It's a common pattern that I saw when you took my knight. I had threats against h2, and I knew if you put your queen on g5, I could safely take on h2 and win a free pawn. If you took - as you did - I was going to win more material. So patterns help in thinking ahead.  I could have played 15. ... Ne3+, winning your rook for my knight. But instead, I'm going to try and bring your king into the centre of the board where I can mate him.\"  Then, I thanked him for teaching me where patterns play a role, thought process, tactics, strategies, and planning ahead.  His response was, \"I've set up a few conditional moves, as you only have one move for the next while!\"  Those moves were concealed.\r\n\r\n \r\n",
        "15... Qh5+ 16. Kg3 Qh2+ 17. Kf3 Ne5+ 18. Ke3 Re8": "At first, I had no idea why he moved there.  Then, I figured out that his intentions, were to place me in a dangerous check, as we will see.",
        "19. Nxd5": "?? In the meantime, I do not hesitate to take one of his pawns.  However, this is a very bad move, as he gets a double check, and wins more material.  BTW, one of those is a discover check, so I am now in even more trouble, as I cannot retake his Knight, with my b pawn.  This is where he said, \"Always be careful of discovered checks!\r\n ",
        "19... Nc4+ 20. Kf3": "?? In this position, my only other option was 20.Kd3.  However, that would have been a lot better, then this move.  If 20.Kd3, I still could have prevented mate, even if 20...Kxb2.  With this move, however, 20...Nxd2#, so mate in one is inevitable.",
        "20... Nxd2#": "Even if I had played 20.Kd3 and avoided mate, I would have resigned, at this point.  Why?  21...Nxb2+, loosing another piece, so there would be no way to catch up.  Either way, I would like to thank cdeburca for giving me this game.  As I had mentioned in the beginning of this annotation, I have graphomotor difficulties, and that is why I have a hard time calculating ahead.  This game, however, will help, improve my weak area.  Afterall, it is generally a good idea to convert a weakness into a strength, and this game is a start.  As a result, I am now on another upward trend.  Not just for my games, but outside of chess, as well."
    },
    "url": "https://gameknot.com/annotation.pl/graphomotor-difficulties?gm=48002",
    "gameName": "Graphomotor Difficulties",
    "players": "jkarp (1205) vs. cdeburca (1651)",
    "opening": "French (C00), Wing gambit"
}