{
    "moves": {
        "1. d4 Nf6 2. c4 g6 3. f3": "Trying to build a strong pawn center and avoid the proper Grunfeld Indian. Alekhine played the move in the world championship matches against Bogoljubov in 1929 and 1931.",
        "3... d5 4. cxd5 Nxd5 5. e4 Nb6 6. Nc3 Bg7 7. Be3 O-O 8. Qd2 Nc6 9. O-O-O f5": "9...Qd6 is more popular, challenging the white center with pieces.",
        "10. e5": "Chess is all about squares. Carlsen gives up the light squares on the diagonal a2-g8, but gains control of the dark squares on the kingside.",
        "10... Nb4 11. Nh3 Qe8": "?! Is the unusual new idea to play 12...Na4 next? ",
        "12. Kb1": "Carlsen decided to wait for the move Bc8-e6 to go Nh3-f4. At the same time, he is refraining from the kick a2-a3, not weakening the light squares around his king.",
        "12... a5": "Li probably realized that 12...Na4 13.Bc4+ Kh8 14.Nxa4 Qxa4 15.Bb3 Qb5 16.Bg5 gives White a big advantage. ",
        "13. Be2 c6": "Giving up on the diagonal a4-e8. The move 11...Qe8 now turns out to be a waste of time. Magnus' developing moves are easy to make since he has more space.",
        "14. Rdc1 Kh8 15. Ka1": "A good prophylactic move. Carlsen foresees that his a-pawn may fall and he does not want it to happen with a check. There is a little bit of Nimzowitsch or Petrosian in it. Another unique feature is that both kings line up at the corners of the long diagonal after only 15 moves - perhaps for the first time in chess history. ",
        "15... Be6": "Finally, Black is done waiting. The bishop comes to e6 and the real fight begins.",
        "16. Nf4 Qf7": "After 16...Bg8 comes 17.h4.",
        "17. h4": "!? Carlsen does not want to lose the rhythm of the attack. He didn't see any clear-cut option and the pawn sacrifice was too interesting. Advancing the rook pawns was Bent Larsen's trademark. He was planning to write a book about it, but he never did. ",
        "17... Bxa2": "?! Li could have made Carlsen's task more difficult with 17...Rfd8 18.Nxe6 Qxe6 19.f4 h5. \nBut not the immediate 17...h5 18.g4 and White breaks through on the kingside. ",
        "18. h5 Kg8": "The complications after18...g5 are in White's favor 19.Ng6+ The point! 19...Kg8 20.Nxf8 and now:\nA. 20...f4 21.Nxh7! fxe3 22.Qxe3 Kxh7 23.h6 Bf8 (23...Bh8 24.Bd3+) 24.d5 attacking the knight on b6, White wins. For example: \na1. 24...N6xd5 25.Qe4+ Kh8 26.Nxa2 Nxa2 (26...Nf6 27.e6 Nxe4 28.exf7+-) 27.e6 wins. \na2. 24...Bxd5 25.Qxb6 wins. \nB. 20...Bxf8 21.Bxg5 with advantage.;\n\nMagnus was expecting 18...gxh5, but White has two ways to deal with it successfully: \nA.19.Nxh5 Rg8 (19...a4 20.Nxg7) 20.Nf4 a4 21.e6 Bxe6 22.Rxh7+ Kxh7 23.Rh1+ Bh6 24.Nxe6 Rg6 25.Ng5+ wins. \nB.19.Rxh5 a4 20.Rch1 a3 21.Rxh7+ Kg8 22.e6 Bxe6 23.Rxg7+ Kxg7 (23...Qxg7 24.Nxe6+-) 24.d5 N6xd5 25.Nfxd5 Nxd5 26.Bh6+ Kf6 27.Ne4+! and White mates. ",
        "19. hxg6 hxg6": "We have to go back 45 years to Lugano to see the ideas from the game Larsen-Kavalek. The similarity to Carlsen's game is breathtaking. The great Danish grandmaster already played in Carlsen's mode: he got the knight to f4, pushed his h-pawn and exchanged it on g6.  In his book Studies for Practical Players, published by Russell Enterprises in 2009, the outstanding Russian chess composer Oleg Pervakov wrote:\" White has opened the h-file, and taken aim at the black king. It would be nice to push the queen over to h2 - but how? The d2-e1-g1-h2 route is pretty long and would grant Black time to whip up counterplay on the queenside. Larsen finds a cardinal solution to the problem.\" And indeed, Larsen's line-clearing on the second rank is remarkable: 20.g4! Nxg4 21.f3! exf3 22.Bxf3 Ne5 23.Qh2 and the queen is ready to infiltrate Black's position. Larsen's attack can be replayed at the end of this article.\nLet's see how Carlsen did it.",
        "20. g4": "! Clearing the second rank for the queen to land on the h-file. It is just a coincidence that the move g2-g4 also occurs on move 20 in the Larsen game. ",
        "20... Bb3": "After 20...a4 21.Bd1 a3 22.b3! Bxb3 23.Qh2 White is first. ",
        "21. Bd1": "! Challenging the bishop on b3. The line-clearing is finished. Carlsen's queen is ready to land on h2. ",
        "21... a4": "After 21...Bxd1 22.Qh2! Qb3 23.Qh7+ Kf7 24.Qxg6+ Kg8 25.Ne6 wins. ",
        "22. Qh2": "There she goes!",
        "22... Rfd8 23. Qh7+ Kf8 24. d5": "! Carlsen is attacking the strongest square that is covered six(!) times.\nThe black knight on b6 is hanging and the d-pawn cannot be taken: 24...N6xd5 25.e6! Qf6 26.Nxg6+ Ke8 27.Qg8+ Bf8 28.Rh8 and White mates soon.\n\nThis beautiful interference brings us to William Steinitz's best game played 120 years ago in Hastings. His opponent, the German count Curt von Bardeleben did everything to stop the d-pawn and yet, Steinitz did not blink and pushed the pawn forward to d5.  It freed the square d4 for the knight that jumped further to the square e6, signaling one of the most beautiful attacking finishes. The attack can be replayed at the end of the article.",
        "24... Nc4": "!? Amazing idea, Carlsen did not see at all. Li Chao creates a virtual mating attack. The chessboard suddenly becomes a mine field. Everything can go wrong with one false step.",
        "25. Nxg6+ Ke8": "The queen sacrifice doesn't work here: 25...Qxg6 26.Qxg6 a3 27.Rh8+! Bxh8 28.Bh6+ and White mates first.",
        "26. e6 a3": "! An entertaining queen sacrifice, threatening mate in two. There is only one way out. ",
        "27. exf7+ Kd7 28. Ne5+": "!! An important check, challenging the knight on c4. \"If you are close to being mated and you see a way to avoid it, you don't think much, you just do it,\" Carlsen explained. \nSurprisingly, after 28.f8N+? Ke8 White gets mated: 29.bxa3 Rxa3+ 30.Kb1 Rda8 and there is a mate on the square a1. ",
        "28... Bxe5": "White wins either after 28...Kc7 29.Nxc4 axb2+ 30.Kxb2 Bxc4 31.Qxg7; or after 28...Nxe5 29.Bxb3. ",
        "29. Qxf5+ Kc7": "After 29...e6 30.Qxe6+ Kc7 31.Qe7+ Rd7 (31...Kc8 32.Qxd8+ Kxd8 33.f8Q++-) 32.Nb5+! cxb5 33.Qxe5+ Rd6 34.Rxc4+ Bxc4 35.Qe7+ wins.",
        "30. Qxe5+": "! The final deflection of the dangerous knight wins material. 30.Nb5+ is less precise. ",
        "30... Nxe5": "After 30...Kc8 31.Qe6+ Kb8 32.Bf4+ Ka7 33.bxa3 wins.",
        "31. Bxb3 axb2+": "Or 31...Ned3 32.Nb5+ Kb8 33.Nxa3 wins. ",
        "32. Kxb2 Nbd3+ 33. Kb1 Nxc1 34. Rxc1 Kc8 35. dxc6 bxc6 36. f4": "After 36...Nd7 37.Nd5 wins. Black resigned."
    },
    "url": "https://gameknot.com/annotation.pl/great-chess-minds-think-alike?gm=60542",
    "gameName": "\"Great Chess Minds Think Alike\"",
    "players": "GM Carlson (2834) vs. GM Li (2750)",
    "opening": "Neo-Gruenfeld defence (D70)"
}