{
    "moves": {
        "1. e4 e6 2. d4 d5 3. Nc3 Bb4 4. e5 c5 5. Bd2 Ne7 6. Nb5 Bxd2+ 7. Qxd2 O-O 8. c3 Nf5 9. g4 Nh4 10. g5 cxd4 11. cxd4 Nc6 12. O-O-O Qa5 13. Kb1 Qxd2 14. Rxd2 f6 15. gxf6 gxf6 16. Bh3 fxe5 17. Nc7 Rb8 18. Nxe6 Rf6 19. Nc7 Bxh3 20. Nxh3 Nf3 21. Rdd1 exd4 22. Nxd5 Rf5 23. Ndf4 Rbf8 24. Nd3 Nce5 25. Nxe5 Rxe5 26. Ng1 Ng5 27. h4 Ne6 28. Rh2 Re4 29. f3 Re3 30. Re2 Rf4 31. Rxe3 dxe3 32. Rd3 Rxh4 33. Rxe3 Nd4 34. Re4 Rxe4 35. fxe4": "Although the position is heavily simplified and material level, Black has a number of important positional advantages: the outside passed h-pawn, the more active knight, and time to centralize his king before White will be able to do the same. The h-pawn is especially important in knight endgames, because knights have great difficulty dealing with rooks' pawns.\n\nAs usual, Black starts by bringing his king into the centre, in this case to the excellent outpost e5.",
        "35... Kf7 36. Kc1 Kf6 37. Kd2 Ke5 38. Ke3 h5": "\"Passed pawns must be pushed\"! Black sets his main asset in motion.",
        "39. a3": "Every pawn move creates a weakness,  and the text gives the Black king a penetration square on b3. White's choice was motivated by the fact that after 39 Nh3, there is 39 ... Nc2+ 40 Kf3 Nb4 41. a3 Nd3 42. b4 Ne1+ 43 Ke2 Nc2 winning material. However, Keres points out that White can instead play 40 Kd2! when 40 ... Nb4 41 a3 repulses the knight. It is still far from clear that 39 Nh3 would have saved the game, but it probably offe rs slightly improved chances thereof.",
        "39... a5": "Setting up the later possibility of ... a5-a4, fixing the white queenside pawns (see move 52).",
        "40. Nh3 Nc2+": "The text-move works in the game, but in view of the resource pointed out in the following note, it should have led to nothing. Keres instead recommends 40 ... Ne6! which forces 41. Nf2 (else 41. ... Ng5 wins the e-pawn) and now 41 ... Nf4! maintains great pressure.",
        "41. Kd3": "Once again, Keres points out that 41. Kd2! is a better defence, when Black has nothing better than to return the knight to d4 and try again.",
        "41... Ne1+ 42. Ke2 Ng2 43. Kf3 Nh4+ 44. Ke3 Ng6 45. Ng5": "45. Nf2 Nf4 would actually reach the position given in the note to move 40.",
        "45... Kf6 46. Nh7+ Kg7 47. Ng5 Kf6 48. Nh7+ Ke7 49. Ng5 Ne5 50. Kd4": "Dvoretsky makes the very sensible suggestion of 50. b3 here, to prevent the queenside pawns being fixed by\nthe move ... a5-a4.",
        "50... Kd6": "White's knight raid has somewhat disrupted Black's piece formation, but has not changed the essentials of the position. Black re-establishes his pieces in a secure central arrangement, and his h-pawn is ready to advance further.",
        "51. Nh3 a4": "See the note to move 39. Black fixes the weakness of the enemy queenside pawns. Now White always has to worry about the black king entering via b3, or the black knight landing on c4.",
        "52. Nf4 h4 53. Nh3 b6": "A typical endgame subtlety. Nimzowitsch plans to play the moves ... b5, ... Nc6+ and ...Kc5. However, he realizes that the knight check is best delivered with the white knight on h3, rather than f4. This is shown by the variation 53 ... b5? 54. Nf4 Nxc6+ 55. Kc3 and now the otherwise desirable 55. ... Ke5 walks into 56. Ng6+. In order to avoid this, Nimzowitsch sacrifices a tempo, by advancing his b-pawn in two moves, rather than one. \"Do not hurry!\"",
        "54. Nf4 b5 55. Nh3": "This is the decisive mistake. As the note to move 53 shows, the white knight is useful on f4, because it prevents the black king coming to e5, in view of the fork Ng6+. White should therefore retain this resource and instead play Dvoretsky's recommendation 55. Kc3! when it is not clear if Black can win. He can retain some pressure with 55. ... Kc5 (55 ... Ng6 56. Nxg6 h3 57. Nh4 h2 58. Nf5+ Ke5 59. Ng3 Kf4 60. Nh1 Kxe4 61. Kd2 is drawn) 56. Ne6+ Kb6 57. Nf4 Ng6! (such deflecting sacrifices are a typical idea in knight endings) 58. Nh3 (58. Nxg6? h3 and the knight cannot get back to stop the pawn) 58 ... Kc5  Dvoretsky), but it is still not 100% clear if this is enough. Extending this line, a sample variation is 59. b3 axb3 60.Kxb3 Ne5 (after 60 .. .Kd4 61. Kb4 Kxe4 62 Kxb5 the white a-pawn is too dangerous) 61. Ng5 Nc4 62. Ne6+ Kb6 (62 ... Kd6 63. Ng5 is no help, since 63 ...Ke5 runs into 64 Nf3+) 63. Ng5 Ka5 64. a4 Nd2+ 65 Kc2 Nxe4 (the last chance) 66 Nxe4 Kxa4 67 Ng5 Ka3 68 Kbl and the ending is a draw. There may be improvements in this line, but it is certainly clear that White has excellent drawing chances, whereas after the text, he is lost.",
        "55... Nc6+ 56. Ke3": "56. Nd3 Ke5 57. Ke3 Na5 is an illustration of the comment in the note to move 51. The black knight arrives on c4 with decisive effect.",
        "56... Kc5 57. Kd3 b4": "57 ... Ne5+ 58 Kc3 would not get anywhere; now 57 ... Ne5+ is a real threat.",
        "58. axb4+ Kxb4 59. Kc2 Nd4+ 60. Kb1": "Desperately passive, but after 60. Kd3 Ne6 he would have to play 61. Kc2 anyway, to stop the enemy king coming in to b3.",
        "60... Ne6 61. Ka2": "White decides to go after the apawn, in an attempt to create some counterplay. The alternative 61. Kc2 is\nmet by 61. ..Kc4, and now the attack switches to the white e-pawn (two weaknesses!), e.g. 62. Kd2 Kd4 63. Nf2 Ng5 and the h-pawn marches forward.\n",
        "61... Kc4": "Now Black trades his a-pawn for the enemy e-pawn, and, more importantly, wins the white knight. In this last phase, we see the helplessness of a knight in trying to defend against a RP. The proximity of the edge of the board means that the knight has too little room for manoeuvre.",
        "62. Ka3 Kd4 63. Kxa4 Kxe4": "The black king is heading for g2, trapping the knight.",
        "64. b4": "64. Ng1 Ke3 is no help.",
        "64... Kf3 65. b5 Kg2": "The centralized black knight is ideally placed, both denying the squares f4 and g5 to its opposite number, and also stopping the enemy b-pawn. 66 b6 Kxh3 67. b7 Nc5+ is the main point. A beautifully played ending by Nimzowitsch, and one of the most famous knight and pawn endings in chess history."
    },
    "url": "https://gameknot.com/annotation.pl/great-endgames-series-knight-endings?gm=52118",
    "gameName": "Great Endgames Series - Knight Endings",
    "players": "Emanuel Lasker (2863) vs. Aron Nimzowitsch (2780)",
    "opening": "French (C17), Winawer, advance, Bogolyubov variation"
}