{
    "moves": {
        "1. e4 c5 2. Nc3 Nc6 3. g3 g6 4. Bg2 Bg7 5. Nge2 d6 6. d3 Nf6 7. O-O O-O 8. h3 Bd7 9. Kh2 Rb8 10. Be3 h6 11. Qd2 Kh7 12. Nd1 b5 13. f4 Ng8 14. e5 Qc7 15. exd6 Qxd6 16. Nec3 f5 17. a4 a6 18. axb5 axb5 19. Ra6 e6 20. Qf2 Bd4 21. Bxd4 cxd4 22. Ne2 Nge7 23. Nxd4 Qxd4 24. Qxd4 Nxd4 25. Rd6 Nxc2 26. Rxd7 Rfe8 27. Rf2 Nb4 28. Re2 Rbd8 29. Rxd8 Rxd8 30. Rxe6 Ng8 31. Re2 Rxd3 32. Nc3 Nf6 33. Nxb5 h5 34. Bf1 Kh6 35. Nc3 h4 36. Rg2 hxg3+ 37. Rxg3 Rd4 38. Ne2 Rd2 39. Rb3 Nd3 40. Kg3 Ne4+ 41. Kf3 Ne1+ 42. Ke3 Nc2+ 43. Kf3 Rxe2 44. Kxe2 Nd4+ 45. Kd3 Nxb3 46. Kc2 Nd4+ 47. Kd3 Ne6 48. Ke3 Kg7 49. b4 Kf6 50. Bd3 Nd6 51. Be2 Nc8 52. h4 Nb6 53. Bf3 Ke7 54. h5 gxh5 55. Bxh5 Nd5+ 56. Kf3 Nd4+ 57. Kg3 Nxb4 58. Bg6 Ke6 59. Kf2 Nd5 60. Ke1 Nf3+ 61. Kd1 Nh4 62. Bxf5+ Nxf5": "This ending is one of the most technically fascinating in chess, although it occurs rarely in practice. As is well known, two knights cannot force mate against a bare king, because at the crucial moment the defender's king will be stalemated. However, if the defender has a pawn, the stalemate does not arise, so it is possible to force mate. Almost all of the research on this endgame was carried out by the legendary Russian analyst and study composer, Alexey Troitzky, in the early years of the 20th century. Troitzky's achievement is remarkable, as he analysed the endgame single-handedly, with no prior published theory or practice on which to build, and, of course, no computer help. He identified the basic plan, the techniques for corralling the defender's king, and he even worked out precisely where the defender's pawn needs to be, on each file, in order for the position to be a win. A few later analysts tidied up some loose ends, but almost all of the credit for solving this ending goes to Troitzky. The biggest compliment to the quality of his work came in 1995, when John Nunn published Secrets of Minor Piece Endings. This was part of a series of books in which Nunn updated and corrected established endgame theory for new discoveries thrown up by the early This ending is one of the most tech-generations of computer endgame tablebases. When it came to two knights versus pawn, Nunn decided to omit this ending from his book, \"after discovering that the pre-database work of Troitzky and other analysts was astonishingly accurate\". Effectively, the tablebase added nothing of real significance to the earlier analysis!\nThe basic technique for winning the endgame is always the same, and consists of three stages: 1. The stronger side blockades the enemy pawn with one of his knights. 2. He then drives the defender's king into a corner, using his own king and the other knight. 3. Having cornered the king in the corner, he brings over the blockading knight to effect mate.\nObviously, when he commences stage 3, he has to release the blockade on the pawn, which will then advance. It is important that the pawn cannot promote before the knights are ready to give mate, and this in turn means that the pawn needs to be blockaded far enough back to ensure that this is the case. For various reasons, the line behind which the pawn must stand is not uniform, and it varies depending on which file the pawn stands. Troitzky identified the full line, which is as follows (the diagram assumes that White is the stronger side and that we therefore have a black pawn): \nDespite Troitzky's analysis, the end­ing is extremely complicated and far from easy to handle well, even for top grandmasters. In practice, when this ending arises, it tends to be drawn rather more often than it is won. A few years after the present game, for ex­ample, the leading grandmaster Andor Lilienthal reached the endgame, but was unable to win it (see Norman­Lilienthal, Hastings 1934-5). He obviously did no",
        "63. Kd2 Nf6 64. Kc3 Kd5 65. Kb4 Kc6 66. Kc4": "The main alternative defence was to flee towards the a8 corner with  66. Ka5 although the tablebase shows that this is actually the weakest defence, and shortens the winning process by several moves. Black would con­tinue 66 ... Kc5 67. Ka6 Nd7! 68. Ka5 Nb6! 69. Ka6 Nc4! 70. Kb7 Kd6 etc.\nThe pattern shown over these last few moves is worth remembering, as it is a very typical one for this ending. It oc­curs again, much later, in the present game, but with the white king on the back rank-see moves 83-8S below.",
        "66... Ne4": "The knight on fs can never move until stage three is reached, else White will just push his pawn (Black can never afford to capture it, of course), so the job of corralling the white king has to be done by the black king and the other knight. ",
        "67. Kb4 Ned6 68. Kb3 Kc5 69. Kc3 Ne4+": "We can already see that white's king is gradually pushed back. One factor which makes this position slightly easier than some is that the blockading knight is quite centrally placed, and thus helps to control some squares, such as d4 and e3. With a rook's pawn, the blockading knight is further from the centre and exerts less influence, which complicates the job of driving the defender's king into the corner. ",
        "70. Kd3 Kd5 71. Ke2 Kc4 72. Kf3 Nf6": "This is a good illustration of the last note. The two knights create an impenetrable barrier on the kingside, preventing the white king from fleeing.",
        "73. Ke2 Kc3 74. Kd1 Ng4": "This is one of Seitz's few inaccura­cies in this whole endgame. The table­base shows that 74 ... Kd3 would mate five moves more quickly, but this is of little practical significance since Black has plenty of moves to spare in the 50 move allowance.",
        "75. Ke2 Nge3": "This is an interesting formation. As a general rule of thumb, two knights are less effectively placed when they defend each other, and are more effective on adjacent squares, creating a barrier, such as seen at move 72. However, here we see an exception -the two knights control g2, g3, g4 and h4, thus still con­fining the white king in the comer.",
        "76. Ke1 Kd3 77. Kf2 Nd5": "Now the knight heads to c3, to cut the white king off from d1.",
        "78. Ke1 Nc3 79. Kf2 Ke4 80. Kf1": "The encircling is almost complete. If now 80 Kg2 then 80 ... Ke3 81. Kh3 Kf3 ",
        "80... Kf3 81. Ke1 Ke3 82. Kf1 Nd1 83. Ke1 Nf2": "This is another typical formation. The knight on f2 stops the king going to d1, and after the forced reply .. ",
        "84. Kf1": "... the knight moves to take away e1:",
        "84... Nd3 85. Kg1 Ke2 86. Kg2 Nf2 87. Kg1": "If instead 87. Kh2 Kf3 88. Kg1 Nd3 89. Kf1  and now it is already time for stage 3: 89. ... Ne3+ 90. Kg1 Kg3 91. f5 Ne5 92. f6 Nf3+ 93. Kh1 Nd1 and mate next move....",
        "87... Ng4 88. Kg2 Nge3+ 89. Kh2 Kf2 90. Kh3 Kf3 91. Kh2 Kg4 92. Kh1 Kg3 93. Kg1": "Now the king is finally trapped in the comer, and it is time for the final stage, administering mate...",
        "93... Nh4 94. f5 Nf3+ 95. Kh1 Nd1 96. f6 Nf2#": "A splendid effort by Seitz, who scarcely put a foot wrong. It is interesting that two of the best technical displays in this book (the present game and Torre-Jakobsen, Game 16) should have come from players who did not even hold the grandmaster title. This shows that excellence in the endgame can be achieved by assiduous study."
    },
    "url": "https://gameknot.com/annotation.pl/great-endgames-series-knight-endings?gm=52109",
    "gameName": "Great Endgames Series - Knight Endings",
    "players": "Eugene Znoski Borovsky (2613) vs. Jacob Seitz ",
    "opening": "Sicilian (B24), closed, Smyslov variation"
}