{
    "moves": {
        "1. Nf3 Nf6 2. g3 d5 3. Bg2 c6 4. O-O Bf5 5. b3 e6 6. Bb2 h6 7. d3 Be7 8. e3 Bh7 9. Qe2 a5 10. a4 Na6 11. Nc3 Nc5 12. Ne5 O-O 13. f4 Nfd7 14. Nxd7 Qxd7 15. e4 dxe4 16. Nxe4 Nxe4 17. dxe4 Rfd8 18. Rad1 Qc7 19. Kh1 Rxd1 20. Rxd1 Rd8 21. Bf3 Rxd1+ 22. Qxd1 Qd8 23. Qxd8+ Bxd8": "At a casual glance, the position looks dead drawn, and it is indeed hard to believe that anyone could win such a position against a world-class grandmaster such as Polugaevsky. However, this is one of the reasons why I have selected it for inclusion in the present book. Quite apart from Larsen's superb handling of the ending, especially in the latter phase, the game is instructive in demonstrating that even apparently drawish positions can be won, with only the smallest error from the opponent, if one has the determination to try. In the first instance, the latter is the key. If one asks \"How does one win such a position against a strong opponent?\", the first stage of the answer is \"By not agreeing a draw!\" .\nIn playing on, White does have a couple of small straws, from which to weave his basket. Firstly, the black bishop on h7 is currently shut out of play by the white e4-pawn and will take some time to emerge into play. Secondly, White has a space advantage, thanks to his pawns on e4 and f4. ",
        "24. Kg2 g5 25. h3 Kf8 26. Kf2 gxf4 27. gxf4 f6 28. Ke3 Bg6 29. Bd4": "With this move, White commences a plan of going after the black h-pawn.",
        "29... Ke7 30. Bc5+ Kd7": "30 ..Kf7 would keep the enemy bishop out of f8, but White could strengthen his position by means of 31. Be2 with the idea of transferring the bishop to c4 and threatening f4-f5. Black's position would be rather passive and still somewhat uncomfortable.",
        "31. Bf8 Bb6+ 32. Kd3 h5": "Now the h-pawn is potentially vulnerable to a later white king march to h4.",
        "33. Ba3 Bc7 34. Bc1 Kd6 35. Bb2 Ke7": "Black continues to use the weakness of f4, to tie White down and hamper his attempts to make progress.",
        "36. Ke3 Bb6+ 37. Bd4 Bc7": "37 ...Bd4+ 38. Kxd4 Kd6 was the alternative, when White retains some pressure after 39 e5+ fxe5+ 40. fxe5+ Kc7 41. Be4. \nPolugaevsky prefers to retain the dark-squared bishops, believing that it will be harder for White to penetrate the black position with both bishops on the board.",
        "38. Bc5+ Kd7 39. Be2 b6 40. Ba3 Bd6 41. Bb2": "Now the exchange would be less dangerous for Black, since after 41. Bxd6 Kxd6 42. Kd4 e5+ it is White who\nhas weaknesses on the dark squares.",
        "41... Bc5+ 42. Kf3 f5": "Passive defence with 42 ...Ke7 was also possible, but Polugaevsky prefers to clarify the position.",
        "43. Bd3 fxe4+ 44. Bxe4 Bf5 45. Bxf5 exf5": "With the light-squared bishops having come off, Black still has some worries over his h 5-pawn, which can prove vulnerable after Kg3-h4. The position should still be drawn, but Black has problems to solve.",
        "46. Kg3 Be7 47. Bg7": "White's plan is Bh6-g5, followed by Kh4.",
        "47... Ke6 48. Bh6 Kd5": "Polugaevsky puts his faith in counterattack. Passive defence by 48 ...Kf7 49. Bg5 Bc5 should also be adequate to draw. It is worth noting that the game had been adjourned around move 41, so Polugaevsky was now following his home analysis. The fact that Larsen still managed to win the position, even after\nhis opponent had been able to analyse it at home, is a remarkable tribute to his endgame technique, and, in particular, his ability to continue to find ways to pose the maximum problems for Black.",
        "49. Bg5 Bd6 50. Bd8 Ke4 51. Bxb6 Bxf4+ 52. Kh4 Bd2": "Polugaevsky later wrote that he had reached this position in his adjournment analysis, and had stopped here,\nconvinced that the strength of his passed f-pawn should be sufficient to draw.",
        "53. Kxh5 f4": "This natural move proves to be the decisive mistake, although it takes some superbly subtle play by Larsen to prove this. Polugaevsky later claimed that 53 ...Kf3 ! would have drawn, preventing the white king from coming back to help fight against the f-pawn.",
        "54. Kg4 Be1": "54 ...Be3? 55. Bxa5 f3 56. Kg3 wins easily. This simple variation illustrates a key point about the ending - Black's f-pawn looks very dangerous, but is only so if the black king can reach the square e2. All the while the white pawn remains on c2, the only route for the king is the square e3, which White is able to patrol effectively with his bishop.",
        "55. h4 f3 56. Kh3": "This is the point. Now 56. ...f2 is not dangerous because of 57. Kg2 and after S7. ...f1Q+ 58. Kxf1 Bxh4 59. Bxa5 White wins easily.",
        "56... Kf4 57. Bc5 Kf5": "Since he is unable to support the further advance of his e-pawn, the black king returns to perform defensive\nduties in stopping the white h-pawn.",
        "58. Be7": "Preparing to advance the h-pawn, without allowing ... 􀀿g s. All previous annotators of this ending, including both of the players, have assumed that Black was lost after his 53rd move, and that Larsen's play was a flawless demonstration of that fact. However, although the first part of the statement is true, the second is not. In view of the note to Black's 62nd move, Larsen's last has to be considered a serious mistake, which should cost the win. Instead, 58 b4! wins, by setting up a second passed rook's pawn. After 58. ...axb4 (58 ...Bxb4? 59. Bxb4 axb4 60. Kg3! wins at once) 59 h5! (59 a5? b3!) Black simply cannot cope with both passed pawns, e.g. 59. ...Kg5 (59. ...Bd2 60. Kg3 Ke4 61. Kf2 also wins) 60. Bb6\nc5 61. a5 c4 62. a6 b3 63. a7 b2 64. a8Q b1Q 65. Qd5+ forces mate.",
        "58... Ke4 59. h5": "The black king has finally gained access to the square e3, but it is now too late, as the following variation shows: 59. ..Ke3 60. Bc5+ Ke2 (or 60. ...Kd2 61. h6 Kxc2 62. Bd4 and the h-pawn promotes) 61. h6 f2 62. Bxf2 Bxf2 63 h7 Bd4.\nNow there follows the decisive break 64. b4! axb4 65. a5 and the bishop cannot stop both passed pawns, e.g. 65. ...Kd2 66. a6 Kxc2 67. a7 Bxa7 68. h8Q b3 69. Qh7+ Kc1 70. Qxa7 b2 71. Qc5+ and White wins in standard fashion, by forcing the black king i n front of the b-pawn and then bringing his own king closer.",
        "59... Bd2 60. Bc5": "The bishop returns just in time, to close off the e3-square once again. In the meantime, the white h-pawn has advanced one rank closer to promotion.",
        "60... Be3 61. Bf8 Bd4": "62. ...Ke3 is again a threat, and 62. h6? Ke3 63. Bg7 fails to 63. ...Bxg7 64. hxg7 f2 when Black should draw the queen ending.",
        "62. Bh6 Be5": "62 ..Ke3! is the way to draw. Both Larsen (in the Danish magazine Skakbladet 1966 pp 77-79) and Polugaevsky (in his Preface to the Russian edition of Larsen's best games collection, and in Grandmaster Preparation) dismiss this, on account of 63 Bg7, when the e3- square is again denied to the black king, and the h-pawn threatens to advance. Larsen adds the moves 63. ...Bd4 64. h6 winning for White.  However, the merciless computer points out that 63 ...Bc5! (or 63. ...Bb6!) renews the threat of 64. ...Ke3, and leaves White with nothing better than a repetition of moves after 64. Bh6 (64. Bf6? Ke3 65.\nBh4 Bd4 is also not winning for White; indeed, he may well be losing) 64 ...Be3 etc. This possibility only came to light during the preparation of this book, and, as far as I am aware, it has not previously been pointed out anywhere else.\nAfter the text move, Black is definitively lost.",
        "63. Bd2": "Anticipating the threat of 63 ...Bf4, and also preparing to annex the a5 pawn, after which White will have two passed rooks' pawns.",
        "63... Bf4 64. Bxa5 Ke3": "Black will finally win the white bishop for his e-pawn, but it is too late, because the two passed rooks' pawns\nwill be too much for Black's own bishop.",
        "65. Be1 Ke2 66. Kg4": "A lovely final touch. White brings his king into contact with the f3-pawn, with gain of tempo. Instead, all of\nWhite's subtle play hitherto would come to naught after 66. Bh4? Bg5 67. Bg3 Bf4 with a draw.",
        "66... Bh6 67. Bh4 Bd2 68. Bg3": "Again, the most precise. Black will be driven into zugzwang.",
        "68... c5": "Or 68 ..f2 69. Bxf2 Kxf2 70 c3 Bxc3 71. h6 Ke3 72. h7 Kd3 73 a5 and wins",
        "69. c4": "And here it is. If Black's bishop moves, it allows one of the white pawns to advance, whilst the black\nking has no waiting moves that do not lose the f-pawn.",
        "69... f2 70. Bxf2 Kxf2 71. h6": "All beautifully done.",
        "71... Ke3": "Now that the black pawn has been lured to c5, closing the a7-g1 diagonal, Black's bishop cannot stop the a-pawn after 71 ...Bxh6 72 a5 .",
        "72. h7 Bc3 73. a5": "Superlative play by Larsen, despite the lapse at move 58."
    },
    "url": "https://gameknot.com/annotation.pl/great-endgames-series-bishop-endings?gm=52303",
    "gameName": "Great Endgames Series - Bishop Endings",
    "players": "Brent Larsen (2415) vs. Lev Polugaevsky (2274)",
    "opening": "Reti (A05), King's Indian attack, Spassky's variation"
}