{
    "moves": {
        "1. e4 b6": "This is the Queen's Fianchetto opening. Such an early fianchetto displays that Black is ready to defend against a big pawn structure in the centre, trying to flank the pawns with his own pieces. Black must be vigilant, so as not to fall victim to any direct attacks on the king, as this game very much illustrates.",
        "2. d4": "This is the natural move. White is fine with building up a big pawn structure.",
        "2... Bb7 3. Bd3": "Greco usually preferred developing his bishop to d3, instead of c4 or b5. As this game progresses, it will become apparent that the bishop is very well placed.",
        "3... f5": "Black advances a pawn to break up White's centre structure.",
        "4. exf5": "White accepts the pawn, and the fireworks begin.",
        "4... Bxg2": "This looks like a lot of trouble for White, as Black has the rook on h1 trapped. However, White needn't worry about it.",
        "5. Qh5+ g6": "'It is interesting that many years after this game was played, all of the moves so far are still considered \"book.\" If you weren't aware of the date, you might believe that this game was from the hypermodern movement of the early twentieth century.' I, myself, would certainly not consider this 'book.'",
        "6. fxg6 Nf6": "Black gets greedy and loses straight away. The usual continuation is 6. ... Bg7 7. gxh7+ Kf8 8. hxg8=Q+ Kxg8 9. Qg6 (or 9. Qg4) Bxh1, and Black has an okay game.",
        "7. gxh7+ Nxh5": "Black gleefully seizes White's queen, oblivious to his plan.",
        "8. Bg6#": "'Even after four centuries, some games can still elicit a smile.' Indeed, this checkmate is certainly more aesthetically pleasing than Fool's Mate, even though it's the same idea. If you wish to leave me a suggestion for an annotated game, or want to leave me feedback, please drop me a message. Your help is appreciated."
    },
    "url": "https://gameknot.com/annotation.pl/greco-unknown-rome-1619?gm=34162",
    "gameName": "Greco-Unknown, Rome 1619",
    "players": "Gioachino Greco (no rating) vs. Unknown (no rating)",
    "opening": "Guatemala defence (B00)"
}