{
    "moves": {
        "1. e3": "I don't understand why my opponent doesn't launch his pawn to e4 with a classical king pawn opening, but all the better for me.",
        "1... e5": "I send out my king pawn- though d5 would have been a better choice.",
        "2. Bc4": "With fast development of his bishop my opponent puts pressure on the weak f7 pawn, though there is not significant pressure as of the moment.",
        "2... Nh6": "None the less, I protect the f7 pawn and develop my knight",
        "3. h3": "Wasted move. Nothing to benefit from it.",
        "3... Bb4": "I develop my bishop and deny him the right to move his d-pawn in preperation to take out his e-pawn and in the process of pinning his d-pawn I prevent development of his black bishop.",
        "4. a3": "A simple reply to the situation.",
        "4... Bc5": "I didn't mind moving my bishop away and breaking the pin- the important thing to me was getting my bishop out before I blocked its development with the d-pawn.",
        "5. b4": "Now my opponent is after my bishop and I'm running out of places to put it where it will do good for me. It would have been better to have my bishop on e7 from the beginning instead of fooling with it while letting him create a pawn structure.",
        "5... d5": "I offer the chance to trade bishops in return.",
        "6. Bb3": "He retreats his bishop.",
        "6... Bd6": "I do the same with mine and add protection to my e-pawn.",
        "7. c4": "Now my opponent is out to destroy my d-pawn...",
        "7... c6": "...and I defend it.",
        "8. cxd5": "Now we exchange pawns...",
        "8... cxd5": "...and I end up with a pawn controlling the center.",
        "9. Bxd5": "Sadly it lacked protection and he snatched it up.",
        "9... Nc6": "I offer a trade; if he declines then I further protect my e-pawn.",
        "10. Qf3": "Now he adds pressure to the a8-h1 diagonal, but also puts the f7 pawn under significant pressure, waiting for me to blunder and move my knight.",
        "10... Bd7": "Undeterred, I add protection to my knight to prevent: 11.Bxc6 bxc6 [or 11... Kf8 and accept the loss of a knight, a pawn, and the right to castle] 12. Qxc6 leading to a rook-fork and once again, the loss of the right to castle.",
        "11. g4": "A move without reason.",
        "11... O-O": "I quickly castle to end the immediate pressure on my f7 pawn.",
        "12. e4": "Locks the e-pawns together, but does more harm than good, blocking of his queen from the a8-h1 diagonal.",
        "12... Nd4": "The pawn movement also let my knight into a beautiful position, not only safe from threats but attacks his queen and forces it back to its d1 post to prevent the dreaded rook fork on c2.",
        "13. Qd1": "Loss of tempo and lets me pursue other goals without interference from his queen.",
        "13... Bb5": "I aim to put an unruly grip on the f1 square and confine his king to its square.",
        "14. Bb2": "My opponent wants to trade away my knight because of its devastating control in his territory.",
        "14... Qb6": "I see promise in sending my queen to patrol the knight's outpost once the trade is complete; rather than having a pawn there instead doing very little.",
        "15. Bxd4": "The trade...",
        "15... Qxd4": "...and I get my queen in a worthy place, forcing him to waste tempo moving his rook or interposing with his knight to prevent the loss of a rook-the latter would be the best move for him.",
        "16. Ra2": "But no, he moves his rook. This fortifies the d-pawn's protection but I had little reason to attack it only to loose my queen.",
        "16... Rac8": "Here is where I prepared to go in for the kill; and I set the rook out as bait for one possible checkmate [the one that occurred in this game] or to prepare for a more elaborate checkmate.",
        "17. Bxb7": "My opponent took the bait, and I am about to set up for a checkmate that is unseen if you are concerned about going for my rook.",
        "17... Qc4": "I send my queen over and it looks as if it is protecting the rook [even though it is plenty protected] and it seems as this was just a wasted move.",
        "18. Bxc8": "The game is essentially over, my opponent took the bait [who cares about losing a rook in order to checkmate?] and I can move in swiftly.",
        "18... Qf1#": "Greed for the rook blinded him from seeing this checkmate."
    },
    "url": "https://gameknot.com/annotation.pl/greedy-for-a-rook-that-cost-the-game?gm=29895",
    "gameName": "Greedy for a Rook? That Cost the Game.",
    "players": "thathamkid  vs. chelseadaddy ",
    "opening": "Amsterdam attack (A00)"
}