{
    "moves": {
        "1. g4": "The absurd Grob 'attack.' Despite being shunned by normal humans it has a small cult following, along with it's sister 1. e4 g5. It's biggest problem is that it's user can't really castle safely. Luckily i have some knowledge of how to play this opening, which means i should make the game competitive. If so, this opening can lead to very wacky games",
        "1... d5": "The best move, forcing white to play a passive move covering the pawn?",
        "2. Bg2": "No. When black takes, white often aims c4 followed by Qb3, intending to win back the pawn by taking b7. ",
        "2... Bxg4 3. c4": "White obliges, but i've got a trump card to play.",
        "3... dxc4": "?! Black gives up the A rook for superior development. Infact Rooks don't help much at all for most of this game.",
        "4. Bxb7 Nd7 5. Bxa8 Qxa8": "Now Black rules the h1-a8 diagonal, which white wanted for themself. White has no development on their side except three empty squares.",
        "6. f3": "A horrible looking move, blocks in the knight, weakens the kingside and doesn't even threaten the bishop. I'd have preferred Nf3 even though black can give white doubled pawns by taking.",
        "6... e5": "The natural continuation, normal development with the D8-H4 diagonal looking tasty following whites f3.",
        "7. Qa4": "Eyeing the c and a pawn.",
        "7... Be6": "Bit annoying to have to move the same piece twice early, but that pawn makes d3? look dodgy for white, so i don't think it should be taken yet. With whites kingside almost undevelopable, i know i will still have a stronger position in the long term.",
        "8. Na3": "Still eyeing the c pawn. Nc3 looks more natural.",
        "8... Qd8": "Here we go...",
        "9. Kf1": "I expected h4 there, to try and rouse the Rook and prevent my next move.",
        "9... Qh4 10. Qxa7": "Whites queen finds time for some munchies. I don't think this game will be decided by who has the most pawns. More of a problem is the Qa8+ threat. black could have played Bc5 last move to cover it whilst continuing normal development.",
        "10... Bc5": "Threatens the queen and checkmate in one.",
        "11. Qa8+": "Only move for white. This appears to box in the knight, but i believe sacrificing the rook to develop it might be beneficial. White must play e3 next, which will leave a very weak f pawn.",
        "11... Ke7 12. e3": "I have no idea whether my plan will work, i can't see that far ahead, but i know it will give me chances. In a friendly match against a non-human it has to be worth a go.",
        "12... Bh3+": "The natural continuation of my plan.",
        "13. Nxh3 Qxh3+ 14. Kf2 Ngf6": "Ndf6 was an option, but i decided white could slow me down too much by replying with Qc6 . I decided letting the rook go in exchange for an extra knight bearing down upon the king was worth a gamble. No-one can win every gamble, not even people who love the fruities.",
        "15. Qxh8 e4 16. Qxg7": "brings the queen back into play, but besides that white has almost no development and wont do for a long time. The question is whether my attack has enough to win the game before white sorts themself out.",
        "16... Qxf3+ 17. Kg1 Bd6": "??? I really wanted to play Ng4 there, but after Qg5+ i thought white could practically force a queen swap with Qf4. I failed to see the e pawn was pinned to the king. In other words Ng4 would have won me the game but i blew it :( Bd6??? prevents the queen reaching f4 (not that it could have gone there anyway) and brings an extra piece to the attack, but also gives white precious time.",
        "18. Qg2": "White delays Ng4.",
        "18... Qd1+ 19. Qf1 Qg4+ 20. Kf2": "White was a good sport there, not playing Qg2. I don't want this game to end by threefold repetition.",
        "20... Ne5": "as i mentioned somewhere else, giving up the rook enables me to have an extra knight in the attack. That's very important for the way the game develops.",
        "21. Qe2 Nd3+": "That is a very snug home for the knight and makes development of the bishop even harder, whilst simultaneously continuing the attack.",
        "22. Kf1 Qf5+ 23. Kg1 Ng4": "Aiming for f2.",
        "24. Nxc4": "That's annoying for me...",
        "24... Ngf2": "I took some time deciding which knight to move. I made my choice on the basis the other knight is very good on d3 and and i can go Nh3+ Kg2 Nf4+!, winning the queen! If white tries to prevent that with 25. h3, Qg5+ 26. Kf1 Nxh1 is very good for black. Looks like it's curtains for white.",
        "25. Nxd6": ":( No it's not. Now the queen is threatened, the plan no longer works this turn.",
        "25... cxd6 26. h3": "And without my bishop this move is safe, as it allows the king to flee to h2 instead of f1 if i check it.",
        "26... Nxh1": "I'm running out of options now. If White takes the knight i can force a draw by repeatedly checking the king, starting on h3.",
        "27. Qg2": "The machine knows it. Winning a hibernating rook is not good enough for me, i'm still behind in material which will ruin me if white manages to develop the other pieces.",
        "27... Nhf2 28. h4": "A clever little move, moving the pawn to safety and threatening a queen swap on g5.",
        "28... Nh3+": "? I could easily have played h6 there and considered it, but decided to cover g5 with the knight instead, hoping to find a new attack on the king at the same time. i could not see a good way to continue attacking after h6, but it would still left me with a solid position.",
        "29. Kh2 Ndf2 30. Qg3": "Now i can't move either of my knights without one being taken. Nh3+ looks a poor move now.",
        "30... Qb5": "i've got no viable options left. If only i was playing a human they might let me play Qf1 and Qh1#. If only.",
        "31. b3": "White quickly responds, allowing Bb2 to make any move on the back file worthless.",
        "31... Qe2": "When you're losing, you can always hope for a discovered check. Sometimes people fall for those...",
        "32. Ba3": "White develops the bishop in a way that means the loss of a pawn is irrelevent.",
        "32... Qxd2 33. Rb1 h5": "My presents have all been opened, unfortunately i broke all the good toys. There's nothing left for me to do here. There's always next year.",
        "34. Rb2 Qd1": "Shame i can't play Qe1, thanks to the threat on d6.",
        "35. Rxf2 Nxf2 36. Qxf2": "A bishop down in an endgame, it's time to quit. It was still good fun, despite making my fair share of mistakes. As i wasn't playing a person i don't feel worried about copywright infringement. Comments welcome, of course."
    },
    "url": "https://gameknot.com/annotation.pl/grobbed?gm=44457",
    "gameName": "Grobbed",
    "players": "Computer (grandmaster) (2200+) vs. marmalite (1947)",
    "opening": "Grob (A00), Fritz gambit"
}