{
    "moves": {
        "1. e4 b6": "GK computer calls it the guatemala defense. Never heard of it.",
        "2. d4": "Anyway, in such cases, occupy the center is never bad.",
        "2... Bb7 3. Bd3": "Nc3 was another candidate move. d5 as well.",
        "3... e6 4. Nf3": "So that white can castle quickly. If 4. ... d5 5. e5",
        "4... Nf6 5. Qe2": "Queen on protection. e5 was another candidate move but white's plan is to develop quickly most of the pieces to control the center.",
        "5... Be7": "Preparing the castle.",
        "6. O-O O-O": "Both kings are safe.",
        "7. e5": "Attacking the first.",
        "7... Nd5 8. Qe4": "Dangerous but menacing mate by Qh7.",
        "8... g6": "Weakening the king side.",
        "9. a3": "preparing c4 to take black central knight which is pinned by the white queen.",
        "9... Qc8": "The knight is not pinned any longer. But the DSB has lost the queen's protection.",
        "10. Bg5": "Bh6 was another candidate move but I thought that the rook on f8 blocked the black king and white's plan is to attack the king straight away as most black pieces are on the queenside. White has to bring his queen on h4 to have two possibilities of attack : e7 (with the  assistance of the DSB) or h7 (with the help of the f knight which could come on g5 if black plays Nxg5 or if white Bxe7). ",
        "10... d6": "Weak move. It doesn't ",
        "11. c4": "Everything seems to be ready. White's b knight is still in his garage but I do not want to let the initiative to black and the 4 pieces aiming at black's kingside (not counting the e pawn) seems to be enough. So white launches his attack.",
        "11... Nb4": "Menacing to take white's LSB when the queen will have moved but white's attack will be more powerfull with queen on h4",
        "12. Qh4": "If 12. ... Bxg5 13. Nxg5 h5 14.axb4",
        "12... Bxf3": "Black has seen the danger and takes the knight but has now 3 pieces under menace.",
        "13. Bxe7": "At first sight menacing to take the rook but white has another plan and I hoped blck wouldn't think about it.",
        "13... Bxg2": "Not dangerous for the king (at least on a short term) and it doesn't disturb white's plan.",
        "14. Qh6": "Now, black has only one move to prevent the mate by 15. Nf6 ... 16. Qxg7 + mate",
        "14... f5": "Only move.",
        "15. exf6 e.p.": "Mating menace ",
        "15... Rf7": "Black hopes to save his rook (the other candidate move was 15. ... Rxf6 16. Bxf6 ",
        "16. Bxg6": "! If 16. ... hxg6 17.Qxg6+ Kh8 18.Qxf7 with queen's trade and black has still two pieces under menace.",
        "16... Qe8 17. Bxf7+": "Almost forced move.",
        "17... Qxf7": "The combination Bishop/pawn is a very efficient one ",
        "18. Qg5+": "Fork attack",
        "18... Kh8 19. Qxg2": "Black has still two pieces under menace.",
        "19... Nd7": "Blunder. Black should have traded the queen .",
        "20. Qxa8+": ""
    },
    "url": "https://gameknot.com/annotation.pl/guatemala-defense-w?gm=49637",
    "gameName": "guatemala defense (W)",
    "players": "ptitroque (1680) vs. bishopsfool (1613)",
    "opening": "Guatemala defence (B00)"
}