{
    "moves": {
        "1. e4": "Hi everyone!\r\n\r\nThis is my second non-timeout victory in the King Pawn Opening Mini-tournament against the same opponent in Two Against One.  He plays the King's Gambit and I accept it.  We then follow the database and I find a game between my opponent and an Expert called Erizo.  We follow the database until Move 11.  By that time a hell of a lot of damage had been done to white's position but as I said in a previous annotation, it is one thing to win big material and quite another to clean up your opponent should he refuse to wave that white flag!  My opponent does in fact cop Old Matey but you will need to read on to see just how.",
        "1... e5 2. f4 exf4 3. Nf3 g5": "3. ..... g5 - this move holds on to the gambit pawn but it does loosen up black's position a little.",
        "4. Bc4 Bg7": "4. ...... Bg7 - I must catch up on development while I can.",
        "5. c3 g4 6. Nd4 Qh4+": "6. ....... Qh4+ - and Glenda is at it again, well, she came out to h4 in my previous annotated game and wreaked havoc, can that gal do it again?  Read on.",
        "7. Kf1 Ne7": "7. ...... Ne7 - the database gave me 2 choices, both seemed favourable to black.  One was d6 but it branched out into one lost game so I decided to look carefully and I mean carefully at that Erizo game.  I also liked Ne7 because it did develop a piece and prepare for kingside castling, although d6 would have uncovered a defensive battery from Fou Leblanc onto my footman at g4.",
        "8. d3 f3 9. gxf3 Bxd4": "9. ....... Bxd4 - this trade of B for N knocks out a defender of the square f3.",
        "10. cxd4 d5 11. Bb3": "11. Bb3 - as I mentioned in my intro notes, here is a deviation.  NN played Bxd4 against Erizo and dropped his queen, here he also drops his queen, you will soon see how.",
        "11... gxf3 12. Qxf3 Bh3+": "12. ....... Bh3+ - here it comes .......",
        "13. Ke2 Bg4": "13. ...... Bg4 - ....... and here it is.  Fou Leblanc pins the Wicked Witch of the West to her other half and next move it is Ding Dong the Wicked Witch is dead!",
        "14. Bf4 Bxf3+ 15. Kxf3 Qh3+": "15. ..... Qh3+ - Glenda stays in the vicinity of the enemy king but she really needs some back up.  I spend the next few moves, merely developing moves, trying to find her some.",
        "16. Bg3 Nbc6": "16. ....... Nbc6 - just for starters, develops and hits out at d4.  The WK defends it.",
        "17. Ke3 O-O-O": "17. ........ 0-0-0 - now Henry chooses to go queenside.  More pertinently a black rook is lined up on the d column and there he stays.",
        "18. Nc3 dxe4 19. dxe4 Nxd4": "19. ....... Nxd4 - these last two moves have been played to destroy the protective pawn shield around the WK, there is only one pawn left.",
        "20. Bd1": "20. Bd1 - here I have to be very careful, Glenda and Henry are on the same diagonal.  Must watch out for a fork from white's lsb.",
        "20... Nef5+": "20. ....... Nef5+ - now comes a knight sac to blow away the remainder of the pawn shield.  Without that pawn shield guess what?  Ion, I know Alekhine's gun means heavies on one file but I wonder what you could call this particular arrangement, Glenda will line up on the f column, one rook will line up on the e column and another is already on the d column - and the WK is exposed on the e column.  It may not be long before he is well and truly Gunned Down!",
        "21. exf5 Qxf5": "21. ...... Qxf5 - and that is why I have taken back with Glenda instead of the knight.  Now all I need is a rook on the e column to complete the picture.",
        "22. Be2": "22. Be2?? - what's this?  This move allows a knight fork on c2 but will grabbing the rook on a1 waste precious time?  I put my horsie on that square in Analyse the Board and No, says gameknot, because the checkmate detector lights up!  Better put that horsie on c2 and click submit then!  I do just that and my opponent cops Old Matey.  This bumped my rating up to 1856.  It has been a great start to this morning, waking up to that white flag from Ledzepp in the Annotation Project Pt 2 and then to find myself delivering mate in another game.  Double nice.",
        "22... Nc2#": ""
    },
    "url": "https://gameknot.com/annotation.pl/gunned-down?gm=26793",
    "gameName": "Gunned Down!",
    "players": "NN (1679) vs. jstevens1 (1856)",
    "opening": "King's knight's gambit (C38)"
}