{
    "moves": {
        "1. d4": "I had white pieces and started with d4.",
        "1... d5": "d5 was my friend's response.",
        "2. e4": "e4, blackmar diemer gambit. ",
        "2... dxe4": "black accepts the gambit pawn. ",
        "3. Nc3": "Nc3, white is trying to get the pawn back.",
        "3... Nf6": "Nf6 is a very sensible move, develops the knight and defend the pawn.",
        "4. f3": "f3 challenging black pawn.",
        "4... exf3": "exf3, black wants to maintain the material advantage.",
        "5. Qxf3": "normally white would capture with knight, Qxf3 leaves the d4 pawn unprotected, but white is actually setting up the trap, d4 pawn is the bait.",
        "5... Qxd4": "my friend was a bit greedy and took the bait. ",
        "6. Be3": "Be3 develops the dsb, also attacks black queen.",
        "6... Qb4": "Qd8 looks embarrassing, but that would be a better move than the move played in the game, which is Qb4, attacks the b2 pawn. it seems like white can't castle queen side, because O-O-O results in Bg4, skewers the queen and the rook on d1. ",
        "7. O-O-O": "O-O-O was played anyway.",
        "7... Bg4": "Here comes the skewer! is white in trouble now, maybe my friend thought I would resign after this move.",
        "8. Nb5": " Nb5 was played! Did white commit suicide? Not really! Can you see black's problem? if black captures the queen, then Nxc7# !",
        "8... e6": "Black actually saw the problem, and played e6, now Nxc7 won't be mate.",
        "9. Qxb7": "Qxb7",
        "9... Qe4": "my friend realized he was in trouble, Qe4, protects the rook on a8, also hopes queen exchange. ",
        "10. Nxc7+": "No thanks, no queen exchange for you my friend, Nxc7+",
        "10... Ke7": "Ke7 is the only move",
        "11. Nd5+": "Nd5+, discovered and double check!",
        "11... Kd8": "Kd8, now there is mate in two",
        "12. Qc7+": "begins with Qc7+ ",
        "12... Ke8": "Ke8 only move",
        "13. Qc8#": "Here is mate! At move 11, black can play Kd6, but Qc6 would be checkmate. Halosar trap worked! That's all about this game, hope you like it, thank you!"
    },
    "url": "https://gameknot.com/annotation.pl/halosar-trap-succeed?gm=49797",
    "gameName": "Halosar trap succeed",
    "players": "superlalulalu  vs. NN ",
    "opening": "Blackmar gambit (D00)"
}