{
    "moves": {
        "1. e4 Nf6": "Alekhine's defense. I'm always weary playing against it because I have the habit of over extending my pawns just as black hopes.",
        "2. e5": "I must admit, I did contemplate transposing out of this opening with Nc3, but at some point I must learn",
        "2... Nd5 3. d4": "Most times I play c4 here, but i'm trying to play it at least a little bit more conservatively",
        "3... d6 4. Nf3": "Again, I struggled against playing against c4. I'm a bit too aggressive and I'm attempting to learn to play positionally. So I avoided the c4 and f4 line",
        "4... Bg4 5. Be2 e6 6. O-O Be7 7. c4": "All book moves. I contemplated playing perhaps h3 here to relieve the pin, but I'd rather force the knight away for now",
        "7... Nb6 8. Nc3 O-O 9. Be3 Bxf3": "I'm unaware to how the line is supposed to be played out. Capturing on f3 seems like it was too soon, perhaps Nc6 would have been better. The bishop pair side by side seems to be more formidable than having the knight on f3",
        "10. Bxf3 Nc6": "His only move really to prevent Bxb7. Although now, I realize at some point that if the position calls for I can play Bxc6 and double black's pawns, but I'd rather stagger his position more before trading a bishop for a knight",
        "11. Qe2 dxe5": "I'm not really sure how good of a trade this is for black. Maybe Qd7 would better and allow him to attempt to control the d file? I dunno.",
        "12. Bxc6 bxc6 13. dxe5": "All natural moves, but the trade seems to more in my favor than black's.",
        "13... Nd7": "It's as if black wants me to control the d file. although, the b file should be attacked more fully by black",
        "14. Rfd1 Qc8 15. f4": "Black seems so confined here. His pieces tend to point more queenside than kingside so I was considering a kingside pawn storm later if black allowed",
        "15... Bc5": "The doubled pawns of black's just seems to making his position so tough and cramped. I don't like this move by black at all, I'm unsure of a better move though. ",
        "16. Bxc5 Nxc5 17. b4 Nb7 18. Ne4": "Black is in an even worse position than he was before. He is even more cramped behind his lines and now my knight is sitting quite wondrously on e4",
        "18... c5": "Attempting to push back",
        "19. b5 a6": "At first glance at the position I thought the a6 pawn move was better than c6, but I have my doubts now. c6 would at least allow black's queen back into the game",
        "20. Qc2": "I make a little attack towards h7 in order to keep black preoccupied with more than the queenside.",
        "20... h6 21. a4 axb5 22. cxb5": "I'm dictating the game rather well at this point. Black should be fearing the pawn advanced up the a and b files and at any moment I can switch my attack over to the kingside and over extend all of his pieces",
        "22... Rd8": "Here comes his attempt at opening the d file",
        "23. Rxd8+ Qxd8 24. Rd1 Qe7 25. Rd2": "I realized at this point, that black's rook will also attempt to control the d file, so I pushed my rook forward in order to have my queen to the be the last one standing on the file after the trade occurs",
        "25... Rd8 26. Qd1 Rxd2 27. Qxd2": "I was offered a draw at this point of the game, but I think my position is much more solid. I just need to figure out a way to crack black.",
        "27... Kf8": "A very poor move by black. Essentially game losing after the next move",
        "28. a5": "one of these two pawns are going to promote. black's only real alternative is to play Nxa5 I believe, but than the psotion should be entirely mine. I don't see a way out of black now",
        "28... Ke8": "Another poor move",
        "29. a6": "1-0"
    },
    "url": "https://gameknot.com/annotation.pl/hanukah?gm=35374",
    "gameName": "Hanukah",
    "players": "vincerino (1764) vs. cilpa (1746)",
    "opening": "Alekhine's defence (B05), modern, Flohr variation"
}