{
    "moves": {
        "1. e4": "1.e4 - Tried and true",
        "1... e5": "1... e5 - This takes me well out of my element. I'm not a fan of Classical play because I'd rather not memorize the vast numbers of lines. I guess I played it because I wanted a different flavour to my game than usual. Only after I made the move did I notice the gap in ratings. Here I thought, \"This may have been a mistake.\" ",
        "2. Nf3 Nf6": "Initiating Petroff's Defense and avoiding the Ruy Lopez. I hope to take White out of his book as well and just get down and dirty.",
        "3. Nxe5 d6 4. Nf3 Nxe4": "I'm still not sure about this.",
        "5. Bc4 Be7 6. d3 d5": "This move characterizes the rest of the game. An eye for an eye.",
        "7. dxe4 dxc4 8. Qxd8+ Bxd8 9. Na3": "\"No sense trying to save the pawn,\" I thought. Go for tempo and position.",
        "9... O-O 10. Nxc4 Re8 11. Nfd2 Nc6 12. c3 Be6 13. Ne3": "\"I may never get that pawn back. I'm boned.\"",
        "13... Ne5 14. O-O Nd3": "Down a pawn, I think it best to eliminate pieces, accrue minor victories and head into the endgame.",
        "15. Rd1 Bg5 16. Nf3 Bxe3": "I didn't like his Knights. Normally I'd not give a Bishop for Knight but I still had a good, light-squared Bishop in play.",
        "17. Rxd3 Bxc1 18. Rxc1": "After this move, I was tempted with Bxa3 to reclaim the pawn. However, a3 is poisoned since 19. c4 ends my Bishop's career.",
        "18... Rad8": "Instead, I grab the open file. It's all about fundamentals. No flash. Keep it simple.",
        "19. Rxd8 Rxd8 20. b3 Bg4": "I seize an opportunity to pressure the Rook (indirectly through the Knight). 21. Ne1 (or Nh4) is answered by Rd1 and the exchange gives and endgame with Knight vs Bishop, neutralizing the pawn difference.",
        "21. h3": "I get to wreck his pawn structure.",
        "21... Bxf3 22. gxf3": "Equality achieved (approximately).",
        "22... Rd2 23. Ra1 Kf8": "Threatening White's c-pawn does nothing for me.",
        "24. Kf1 Ke7 25. Ke1 Rd6": "At this point I could tell we were both thinking of securing the opposition.",
        "26. Rd1 Ke6 27. Rxd6+": "I spent a lot of time thinking about the response.",
        "27... cxd6 28. Kd2 Ke5": "The 5th rank MUST be secured.",
        "29. Ke3 g5 30. a4 h5": "Baby steps. ",
        "31. c4 f6": "One of us has to surrender a move.",
        "32. b4 b6": "Careful now.",
        "33. b5": "Ugh. Here I thought I had slipped up somewhere. I'm still not 100% sure I made the right moves. Had I given up the move and allowed a passed pawn?",
        "33... h4": "It took what felt like forever to see this move. ",
        "34. Kd3": "I wonder if 34. f4+ gxf4+ 35. Kf3 f5  36. exf5 Kxf5 would have made a difference?",
        "34... Kf4 35. Ke2": "Seeing it impossible to pass a pawn on the Queenside before I completed the run on the Kingside, my opponent does the sensible thing.",
        "35... f5 36. exf5 Kxf5 37. Ke3": "Plays for the draw.",
        "37... Ke5 38. Kd3 Kf4 39. Ke2 Kf5 40. Ke3 Ke5 41. Kd3 Kf4 42. Ke2 Kf5": "An invaluable illustration of the principles of tempo and opposition."
    },
    "url": "https://gameknot.com/annotation.pl/hard-fought-draw?gm=32896",
    "gameName": "Hard Fought Draw",
    "players": "nozar (1541) vs. tonnerre (1200)",
    "opening": "Petrov (C42), French attack"
}