{
    "moves": {
        "1. e4 e5": "The second game of my favorite team match so far. My first game against this opponent was annotated on 6/29/09 as Throw It All Away: http://gameknot.com/annotation.pl/throw-it-all-away?gm=24895. That was the game I won despite, at one point near the end, my opponent having rook+bishop+6 pawns vs. my rook+4 pawns - definitely one of my favorite games ever. And now this one, not quite a spectacular, but hard-fought right down to the end. My opponent plays the Open Game and I match him, giving him the reins to pick his opening.",
        "2. Nc3 d6": "The Vienna Game. I don't know why white ever plays anything else. According to the GK and World databases, pretty much everything in this opening favors white. The top 6,000 games in the Expert+ world DB all have higher winning chances for white than for black. Finally, there are a mere 12 games that favor black with 2. ... f5, but the players who chose that were the lowest rated black players on the list... So, I went with the option that gets played by masters and has the lowest incidence of draws.",
        "3. Nf3 c5": "Aha! A move the masters play that favors black in the World DB. Incidentally, it gains great ground on d4, but completely surrenders d5. Still, the DB says it's best, and who am I to argue?",
        "4. Bc4 Be6 5. d3 Nc6": "Still following the most popular line from the DB, but now the DB says that the game is heavily drawish but otherwise favoring white. I'm going to rethink playing this myself, when I'm white. Here I would say that black's hole on d5 is more serious than white's hole on d4 (white can maneuver a pawn to c3 if he needs to, but black has no reasonable way to get a pawn to c6 if needed). Also, white's two bishops have more scope than black's.",
        "6. O-O Be7 7. Nd5 Nf6": "Still playing the popular line from the DB. White castles then seizes his advantage on d5. Black prepares to castle then challenges d5, but it's a fake challenge. Black dare not play 8. ... Nxd5 for 9. exd5 forks two black pieces. Tragically, the World DB has this line, among Experts and above, ending in 8 wins for white, 8 draws, and ZERO wins for black. If I am to believe the DB, I already have no chance to win and must hope for a draw...",
        "8. Ng5 Bxd5": "White advances, and black decides to alleviate a little center tension.",
        "9. exd5 Nb8": "And now black is un-developing - all still according to the World DB. It's like this knight had anywhere better to go; it would just be driven away from d4 or b4, a5 would be useful to eliminate white's bishop at c4 but the knight can just as well make his way to d7 and then be well-centered and available for battle on either wing.",
        "10. f4 Nbd7 11. fxe5 Nxe5": "And black has equalized, mainly. His backward d-pawn is compensated by white's doubled d-pawns and by both sides having equal development. We're pretty much out of the DB, down to just two games that end in draws.",
        "12. Bb5+ Kf8": "White checks, and the two experts, both rated hundreds of points higher than me, decide to block with their knights, but they disagree as to which knight is best. I have other plans. I'm done un-developing, and plan to put that kingside pawn majority to work for me, so I don't feel castling is in my best interest anyway.",
        "13. d4 cxd4 14. Qxd4 Qa5": "White undoubles his pawns, but black gets a half-open c-file to exploit. However, he must be careful with his isolated d-pawn. Should that pawn fall, white's easily defended d-pawn becomes the pivotal, and probably winning, factor of the game.",
        "15. a4 Bd8": "The threat is an obvious one, but hey, the bishop needed to find a better home than e7 anyway.",
        "16. Kh1 a6": "And I invite white to find a better home for his bishop, too.",
        "17. Bd2 Qb6 18. Qxb6 Bxb6": "This game is becoming more drawish with the queens off the board.",
        "19. Bd3 Re8": "Looking at this move now, I am wondering if I didn't miscalculate. 19. ... Nxd3 looks really juicy to me, doubling and isolating white's pawns on the d-file. In fact, so juicy, that looking at it now, I am really not sure why I didn't play it. I may have been worried about white building up on my knight at f6 with 21. Bc3, but it looks like that is manageable.",
        "20. Bb4 Bc5 21. Bxc5 dxc5": "White may have miscalculated that exchange. Sure, it gets him a passed pawn, but with two black knights and a rook and king to stop its advance. Meanwhile, black's isolatd pawn joins its queenside companions.",
        "22. Ne4 Nxe4 23. Bxe4 Nc4 24. Bf3 Ke7": "24. ... Nxb2 is met with 25. Rfb1 and then black's pawn on b7 falls. Connecting the rooks and getting the black king out into the path of white's passed pawn seems a greater priority. White could have made this more difficult by getting a rook onto e1, though he hasn't had much chance yet. 24. ... Ke7! takes the initiative before white closes it down.",
        "25. Rf2 Nxb2": "25. Rf2? loses a pawn. It was the f-rook that needed to move to b1 and then capture on b7. This way, 26. Rb1 loses the pawn on a4 and black remains a pawn ahead, but even better, that extra pawn is a passed pawn.",
        "26. Be2 c4 27. c3 Nd3": "The knight must move before white finds a way to drive it off, possibly winning b7 in the process. ",
        "28. Bxd3 cxd3": "Now this is odd. Both players have passed pawns - on the same file...",
        "29. Rd2 Kd6 30. Rxd3 Re4": "White equalizes the material, but he cannot hold it forever. I hope. The plan is black has two rooks and a king to attack white's queenside pawns, and white only has two rooks to defend them - his king cannot cross the e-file without the help of a rook - which will cost white a pawn, somewhere. And outnumbered 3 attackers to two defenders, white will lose a pawn anyway. At least, that's the overlying strategy here. ",
        "31. Kg1 Rc8 32. Rb1 Rc7 33. a5 Ra4": "Ah, this pawn seems winnable.",
        "34. Rb6+ Kc5 35. Rb1 Rxa5": "And so it is.",
        "36. d6 Rd7": "White's d-pawn is a credible threat. It's not going anywhere, but neither is black's rook on d7, now.",
        "37. Rbd1 Ra4 38. Rg3 g6": "White tries another way. Giving up his credible threat to decimate black's kingside. But black believes he can have his cake and eat it too - save the kingside and eliminate white's d-pawn.",
        "39. Rf3 a5": "The rooks are dealocked with the pawns they threaten and defend. Maybe it's time to put this passed pawn to good use. Surely I can find some way for this little guy to win this game?",
        "40. Rfd3 Kc6 41. Rd3d5 b6 42. Kf2 Re4": "Black must replace the wall that keeps white's king at bay.",
        "43. Rd5d4 Rxd4": "A juicy target. Trades can only help black at this point, even if this does release white's king.",
        "44. cxd4 a4": "White's doubled pawns are a death sentence. D6 can fall at any moment, and d4 cannot be saved. Still, black is in no hurry to chase pawns when he can chase a queen instead. Hmmm, better not take that out of context...",
        "45. Ke3 a3 46. Rd2 Ra7 47. Ra2 Kxd6": "And now that white's rook is sentenced to a miserable defensive post, it's time to activate the black king and go win this game.",
        "48. Kd3 b5 49. Kc3 Ra4": "Rook defends pawn, pawn defends rook, white's king cannot get any of them. Nor can white's rook move away or black will promote a pawn, or capture the white rook when it sacrifices to stop the promotion. That leaves black's king, free to roam about the board at his leisure.",
        "50. Ra1 a2": "That makes it even easier.",
        "51. Kb3 Kd5 52. Kc3 f5": "Three on two kingside pawn advantage to the rescue. White's king and rook can tie up black's entire queenside, so the win might lie elsewhere.",
        "53. h3 g5 54. Kb2 Kxd4": "This pawn had to die for black's king to really be free.",
        "55. Rd1+ Kc4": "White's rook escapes momentarily, but must soon return to defensive duty.",
        "56. Ka1 b4": "White tries another way, but this leads to a quick and brutal checkmate if he's not careful.",
        "57. h4 b3 58. hxg5 Kc3": "Mate in 1. White's choices are very limited.",
        "59. Rc1+ Kd2": "The rook is en prise. If it moves, say to h1, then 60. ... Kc2 threatens mate in 1 again, and white's pawn at g2 blocks white's rook from any meaningful defense; it must die horribly to prevent mate. Since the rook cannot stay there unprotected, and it (almost) cannot move, white only has two obvious choices. I think maybe 60. Rc1 is just as good as the move played, but after 60. ... b2+ 61. Kxb2 a1=Q+ 61. Rxa1 Rxa1 62. Kxa1 Ke3, black will eliminate white's kingside pawns and easily promote a pawn of his own for the win.",
        "60. Kb2 a1=Q+ 61. Rxa1 Rxa1 62. Kxb3 Rc1": "White made the right decision. If 62. Kxa1? then 62. ... Kc2 63. (any) b2+ 64. Ka2 b1=Q+ 65. Ka3 Qb3#. Instead, as played, white lives on. However, After 62. ... Rc1, white's king cannot reach his pawns. Black can choose between a King+Rook checkmate, or going after the white pawns, promoting a black pawn, and getting a Queen+Rook checkmate.",
        "63. Kb4 Kd3 64. g3 Rc3": "White stalled. If 64. ... Kd4, white plays 65. Kc3. Black needs a stlaling move of his own, and 64. ... Rc3 works out just fine.",
        "65. Kb5 Kd4 66. Kb4 Rxg3": "White puts his king into opposition, allowing black's rook to snatch a pawn. Now white is truly finished, as his king still cannot approach his pawn. 67. Kb5 Rc3 and the white king is trapped to ten small squares awaiting black's queen to come and deliver checkmate. Instead, white resigns. Technically, this is now tied for my longest game on GameKnot, though since I won that other game by checkmate, and this game still had 8 or 9 more moves to go, I would say that this game now holds the record as my personal longest game. Well-played by white."
    },
    "url": "https://gameknot.com/annotation.pl/hard-fought-until-the-end?gm=25202",
    "gameName": "Hard Fought Until the End",
    "players": "sirarthur (1874) vs. blake84120 (2023)",
    "opening": "Vienna game (C25)"
}