{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Bc4": "I'm generally a cautious-minded player, and this is my favorite opening.",
        "3... Nf6 4. Nc3 Bc5 5. O-O O-O 6. d3 d6 7. h3 h6": "The game has progressed very quickly up to this point in terms of real time. We haven't used much more than a minute each. But things slow down afterwards.",
        "8. Re1": "By now, the symmetry is getting frustrating. I take a while to look for clever ideas, and seriously consider plotting on the assumption that my opponent will mimic me. That doesn't lead me to any useful lines of thought, though so I try to station my rook on a file somewhat likely to be open up. But at the rate things are going, I don't expect a lot of action any time soon.",
        "8... Nh5": "I was wrong. \"Knights on the rim are grim (and/or dim)\", the maxim goes. This surprises me, and I look for a way to turn it into an advantage.",
        "9. Nxe5": "And duly find one.",
        "9... dxe5": "Trading off pieces when you're behind is generally considered a bad idea. Would Nf4 have been better? Otherwise, Black has to retreat the knight, which is also not a great idea at this stage in the game. Though I suppose I could have pushed the g-pawn to harass it...",
        "10. Qxh5": "Moving my queen to the fifth rank on my tenth move was decidedly not part of my plan prior to the game. It had been a long day, however, and my cautiousness had eventually been supplanted by the knowledge that my opponents are just as capable as me at making mistakes. It was a watershed realization.",
        "10... g6": "I'm not sure my opponent meant to do this, but touch-move was in effect.",
        "11. Qxh6 Qf6": "I'm feeling pretty good about my position at this point, and don't really think about what my opponent might be up to.",
        "12. Nd5": "So I attack the queen. Perhaps Bg5 would be better? It develops the only minor piece I still have on the back rank. Nevertheless, this proves to be a useful square for my knight to occupy. I'm anything but conscious of that at the time, though.",
        "12... Qxf2+": "And just when I was on a somewhat uncharacteristic attack, the momentum of the game changes drastically.",
        "13. Kh2 Be6": "If ...Qxe1, Nf6#. (Ne7 would also win were it not for the knight guarding it.) I think my opponent realizes this before I do, but soon enough I catch on and my new objective becomes luring the queen off the f-file.",
        "14. Re2 Qg1+": "I think either this or the next move was written down incorrectly, but I'm pretty sure this is how it happened. I remember feeling safe from imminent defeat because I knew the pawn could serve as a buffer.",
        "15. Kg3": "Thanks, little guy!",
        "15... Qf1": "Bxd5 might be better. Yeah, it's a trade, but it frees up the queen.",
        "16. Bf4": "It's been said that a true sacrifice requires an element of uncertainty. I'd like to think that I'm being clever here, but there's some miscalculation involved--I think I forgot that capturing the bishop would give check. Nevertheless, this provides yet another juicy target (the rook on a1), and stands between the queen and the magical f6 square.",
        "16... exf4+ 17. Kh4 Be7+": "I don't realize that this is check, and search the board for a long time before seeing the obvious Rxf1. As I grab my rook, my opponent notifies me of the check. Thankfully the rook has no legal moves!",
        "18. Nxe7+": "This square had fallen off my radar for most of the recent drama because it was guarded. This move didn't give mate, but it gave me the tempo I needed. I assume my opponent didn't see it coming.",
        "18... Nxe7 19. Rxf1 Rfd8": "My opponent takes a long time to come up with this move. The original speed of our first seven moves was long gone. But I knew I wouldn't give up even in this position, and began brainstorming how I'd fight back. And just as I was thinking \"move a rook to d8,\" the move came. Move-mirroring indeed.",
        "20. Rxf4 Bxc4 21. dxc4": "I'm hoping eventually to play Ref2, followed by Rxf7 and Qh7#.",
        "21... Rdf8": "But my opponent also sees this idea.",
        "22. Ref2": "I press on, though; trading off rooks is to my advantage at this point.",
        "22... f5": "This is actually a fairly good square for one of my opponent's pieces to occupy, though that's not the piece.",
        "23. Rd2": "However, I can now try for Rd7, Rxe7, and Qh7#.",
        "23... fxe4": "This frees up f5 for the knight to fork. The good news is, I see that threat coming, and try to move my pieces so they're not forked their. Should I move the queen? Nah, she's pretty useful where she is. I'll move the king!",
        "24. Kg3": "...The bad news is, I don't think about this very hard.",
        "24... Nf5+ 25. Rxf5 Rxf5": "But luckily for me, this does clear the board up somewhat.",
        "26. Rd7 Rf7 27. Qxg6+ Kh8": "If ...Kf8, Qxf7#.",
        "28. Qxf7 Rg8+": "I'd seen how h8 was better than f8, but didn't see that coming. Under the circumstances, my opponent put up a strong if forlorn defense.",
        "29. Kf4 c5 30. Qh7#": "But it's not enough. From quick though quiet openings to startlingly aggressive shifts in momentum, it was a thrilling game. It's hard to feel safe in games like that, but I guess that's part of the fun."
    },
    "url": "https://gameknot.com/annotation.pl/haste-makes-waste?gm=22517",
    "gameName": "Haste Makes Waste",
    "players": "me (500s) vs. my opponent (unranked)",
    "opening": "Two knights defence (C55)"
}