{
    "moves": {
        "1. e4": "Hi everyone!\r\n\r\nI had a peek through Nuntar's past game history and I spotted this little game.  This was against Coach Ion.  In this game Ion deviates from the usual Bxf7+ and plays Nxf7.  Here is how it all works out ....",
        "1... e5 2. Nf3 Nc6 3. Bc4 Nf6 4. Ng5 Bc5 5. Nxf7": "5. Nxf7 - this move used to be played before Bxf7+ was played mainly in our MT.  This choice of capture brings out an insane passage of play ......",
        "5... Bxf2+": "5. ...... Bxf2+ - ....... like this.  ",
        "6. Kf1": "6.  Kf1 - Ion has been denied the right to castle but will nuntar have the resources at his disposal to ensure he cops Old Matey?  Well, let's read on...",
        "6... Qe7 7. Nxh8": "7. Nxh8 - Ion's greedy knight gobbles up nuntar's rook, but this could be a costly loss of tempo.",
        "7... d5 8. exd5 Nd4": "8. ...... Nd4 - nuntar gives up a pawn but his queen knight is moving ever closer to the kingside.  Ion is not in any hurry to take nuntar's bishop.  Methinks he does not fancy his king being stared down by nuntar's queen on the f column.",
        "9. c3 Bg4": "9. ...... Bg4 - Nuntar has now cleared the decks with this move which also gains a tempo attacking the WQ.  Ion now counter-attacks with 10. d6.",
        "10. d6 cxd6 11. Qa4+ Nd7": "11. ..... Nd7 - preserving the option of 0-0-0.",
        "12. Kxf2 Qh4+": "12. ...... Qh4+ - now nuntar's queen moves in.  This is very aggressive stuff and nuntar must be as he is nearly the equivalent of a queen down.",
        "13. Kf1 Ke7": "13. ..... Ke7 - unpins the knight on d7 and makes way for the rook on a8 to come to the f column.",
        "14. cxd4 Rxh8": "14. ....... Rxh8 - but after the knight on d4 drops off nuntar decides to get rid of the knight on h8 but he is still 8 points down on material.",
        "15. h3": "15. h3 - nuntar is threatening mate in two here.  If Ion makes a \"sensible\" developing move such as 15. d3?? or Nc3?? then Rf8+ 16. Kg1 Qf2#.  There is only one way Coach Ion can avoid copping Old Matey and that is 15. h3.  However, Nuntar now claims High Draw Honours with Rf8+.",
        "15... Rf8+ 16. Kg1 Qf2+ 17. Kh2": "17. Kh2 - h3 created a flight square for Ion's king but now the BQ checks him on f4.",
        "17... Qf4+ 18. Kg1 Qf2+ 19. Kh2 Qf4+ 20. Kg1 Qf2+": "20. ...... Qf2+ ..... and can check him for ever more, so no doubt, on move 22, nuntar declared a draw.  The final position is interesting.  Coach Ion is 8 points ahead on material but his queenside is undeveloped and that is after move 15.  Ion was given no time to develop anything else.  It just goes to show that sometimes grabbing copious material at the expense of developing your pieces in the opening can meet with condign punishment, remember, the white player is a very strong Expert and don't I know it but here he came within a whisker of copping Old Matey from a 1600+ opponent, as it was, he had to concede a Low Draw.  I think this is why Nxf7 is NOT played by white against the Traxler as it lead to the above scenario.  Your attack was extremely enterprising, nuntar and I hope I have learned something from it.  You developed your pieces quickly and took advantage of the open lines and made multiple threats.  I take my hat off to you.  Cheers - Joanne",
        "21. Kh2 Qf4+ 22. Kg1": ""
    },
    "url": "https://gameknot.com/annotation.pl/hats-off-to-nuntar?gm=30103",
    "gameName": "Hats off to Nuntar!",
    "players": "ionadowman (2099) vs. nuntar (1668)",
    "opening": "two knights defence (C57), Wilkes Barre (Traxler) variation"
}