{
    "moves": {
        "1. a4": "Hi everyone!\n\nThis opening is the Meadow Hay Opening and it comes from Easy19's suggestion that I create a themed MT out of this opening.  I ended up playing against a very strong expert in this MT and I seemed to be doing OK.  But then my opponent conjured up Old Matey out of nowhere.  I could have avoided copping this mate but only at the cost of ruinous loss of material.  So, how did this happen?  Firstly I will begin commentary with black's move on Move 4 because that is where the fixed moves end.  The database has completely run out so each player is on their own.",
        "1... e5 2. a5 d5 3. e3 f5 4. a6 Nxa6": "4. ..... Nxa6 - there are several ways to capture this pawn, either with the b7 pawn or with the knight.  My opponent chooses the knight.",
        "5. Bxa6 bxa6": "5. .... bxa6 - this B for N trade splits up black's queenside pawns and may facilitate material restoration later on.",
        "6. b3": "6. b3 - this move prepares a fianchetto on the queenside and a possible move to c4 to try and break up black's strong pawn centre.",
        "6... Nf6 7. Bb2 Bd6 8. d3": "8. d3 - preparing Nd2.",
        "8... O-O 9. Ne2 c5 10. O-O": "10. 0-0 - with my opponent castled kingside, you wouldn't think I was castling into it, would you?",
        "10... Bb7 11. Nd2": "11. Nd2 - my development is nearly complete but black has a big spatial edge.  What an impressive wall of black pawns on the 5th rank!",
        "11... Qe7 12. Re1 Rad8 13. Qc1 Qf7": "13. ..... Qf7 - this is the start of black's dastardly plan.",
        "14. f3 Qg6 15. Kh1": "15. Kh1 - Henry sidesteps a possible pin, but this is where he will be boxed in!",
        "15... Kh8 16. Rg1": "16. Rg1 - it seemed such a good idea at the time - line up rook on same file as enemy queen.  Black showed me that this is not always the case!",
        "16... Qh6 17. Nf1": "17. Nf1 - this knight comes down and protects Henry against mate threats on the h column.  It also protects my vulnerable e3 pawn which is now defended by our poor put upon Glenda!",
        "17... e4 18. f4": "18. f4 - an attempt to block off the line of attack of black's dsb.",
        "18... Ng4": "18. ..... Ng4 - allo, allo, allo, suddenly Henry is now in Old Matey's shadow!  Only his dearly beloved better half can defend him now, so Glenda moves to e1 on the next turn.",
        "19. Qe1 d4 20. Bc1": "20. Bc1 - to bolster e3.  Now comes a plethora of exchanges that turn out to be an unmitigated disaster for Yours Truly.",
        "20... exd3 21. cxd3 dxe3 22. Bxe3 Rfe8": "23. Qg3?? - I think this was my fatal mistake.  I think Bd2 had to be played here.  Do you the Inquest Jury agree?",
        "23. Qg3 Rxe3": "23. ..... Rxe3!! a brilliant exchange sac!",
        "24. Nxe3 Qxh2+": "24. .... Qxh2+!!! - followed by a brilliant queen sacrifice.  Mate cannot be avoided.  Next move I am 9 points up in material but down a king! Sigh and double Sigh!  Not the usual Philidor's Legacy!  Never mind, I did have the consolation over the weekend by managing to add to my tally of Expert Draws with my secret weapon, Operation Joblock.  I will be annotating this game this week so watch this space!  ",
        "25. Qxh2 Nf2#": ""
    },
    "url": "https://gameknot.com/annotation.pl/henry-is-buried-alive?gm=49735",
    "gameName": "Henry is buried alive!",
    "players": "jstevens1 (1928) vs. Expert X (2130)",
    "opening": "Crab opening (A00)"
}