{
    "moves": {
        "1. c4": "Hi everyone!\n\nHas anybody ever heard of Steve Backshall?  Well, he is a guy who just lurves chasing wild animals, although on occasions they chase him.  I found out about him from watching a Children's programme called CBBC with my six year old Charlotte and later played the CBBC game where Steve has to outrun bees, hippos and alligators - this game is called Steve's Deadly Dash.  In this MT in aid of the Christchurch Earthquake I am playing Master Janet.  Things seemed to be OK for me when suddenly Henry was subjected to a deadly dash from her rook and the Wicked Witch of the West.  Alas, Henry got caught and he had to rest up!  Anyhow, on with the game.  Gameknot Analysis is provided in the following link.http://gameknot.com/analyze-board.pl?bd=15488483&fb=1&rnd=0.19786173690656117.  Janet kicks off with the English Opening - 1.c4.",
        "1... e5 2. g3": "2. g3 - white usually likes to fianchetto a lsb on the kingside in the English Opening and Janet is no exception.",
        "2... Nf6 3. Bg2 d5 4. cxd5 Nxd5": "4. ....... Nxd5 - pawn trade.",
        "5. Nf3 Nc6 6. O-O Nb6 7. Nc3 Be7": "7. ...... Be7 - clearing the way for kingside castling.",
        "8. a3 O-O 9. b4": "9. b4 - a queenside pawn storm perhaps?",
        "9... Be6 10. d3 a5 11. b5 Nd4": "11. ..... Nd4 - an interesting passage of play is about to evolve.  The e5 pawn is left to hang, but ....",
        "12. Nxe5 Bf6 13. f4 Nb3 14. Be3 Nxa1 15. Qxa1": "15. Qxa1 - ..... but there is an exchange sac on white's part.  Can this be justified?  We shall see.",
        "15... Bxe5 16. fxe5 Nd5 17. Bc5 Re8": "17. ..... Re8 - my rook is en prise and must move to the only possible square.",
        "18. Na4 b6 19. Bd4": "19. Bd4 - a line up on the a1-h8 diagonal could spell danger for Henry.",
        "19... Rc8 20. Qb2 Qd7 21. e3 Bh3": "21. .... Bh3 - wanting to exchange off white's strong lsb.  Unfortunately white's dsb is the one I should perhaps be thinking of ridding myself of.",
        "22. e6 Qxe6 23. Bxh3 Qxh3 24. e4": "24. e4 - puts the question to my knight.  I opt for f6 - will Janet be prepared to part with this strong bishop in order to open up the g column?  Will this decision prove costly to me?  Time will tell.",
        "24... Nf6 25. Bxf6 gxf6 26. Qxf6": "26. Qxf6 - Aha, here is the Wicked Witch and my f7 pawn is en prise.  I choose to defend by Qh5?? but this proves to be the losing move according to Gameknot Analysis.  My opponent also suggested 26.Qe6 and she thought that if I played that then I would have had great drawing chances.  Again I miss the chance to add Janet's name to my Master Draw list!",
        "26... Qh5 27. Rf5 Qd1+ 28. Kg2 Qb3": "28. ..... Qb3 - I eschew the knight on a4 because Henry will cop Old Matey if Glenda takes it.  Instead she defends the pawn on f7.  However, Rg5+ proves decisive and now comes Henry's Deadly Dash.",
        "29. Rg5+ Kf8 30. Qh6+ Ke7 31. Re5+ Kd7 32. Qc6+": "32. Qc6+.  Here I resign on the grounds of Unavoidable Mate.  Henry has only one square (d8) and next move comes Qxe1#.  Well played, Janet.  Joanne"
    },
    "url": "https://gameknot.com/annotation.pl/henrys-deadly-dash-part-1?gm=37871",
    "gameName": "Henry's Deadly Dash - Part 1",
    "players": "brigadecommander (2218) vs. jstevens1 (1784)",
    "opening": "English opening (A20)"
}