{
    "moves": {
        "1. c4 f5": "1. ............. f5 - the Anglo-Dutch Defense.  This could lead to a very sharp opening and it does.",
        "2. e4 fxe4": "2. ......... fxe4 - a gambit, eh?  Can I hold on to the extra pawn?  Time will tell.",
        "3. Nc3 Nf6": "3. ........... Nf6 - develops a piece and defends the advanced e pawn.",
        "4. d3": "4. d3 - opens up the white dsb's diagonal but gives me an opportunity to swap off the advanced e pawn enabling me to be a clear pawn up.  I am tempted to swap off at once but the database recommends e5 as the best move - it does enable me to get my own dsb out.",
        "4... e5 5. g4": "5. g4 - a type of delayed Grob Opening - that pawn is about to land on g5 forcing my knight back to g8.  I develop my dsb by pinning his knight on c3 to the white king.",
        "5... Bb4 6. g5 Bxc3+ 7. bxc3": "7. bxc3 - the black knight must now retreat to g8 but not before I leave him with a shattered queenside pawn structure.",
        "7... Ng8 8. Qh5+": "8. Qh5 , here comes the Wicked Witch of the West!  I decide to block her out with g6.",
        "8... g6 9. Qh4 exd3 10. Bxd3": "10. Bxd3 - I now find I have enough time to exchange pawns on d3 and so remain a clear pawn up, but will I pay for my retarded development?",
        "10... Ne7": "10. ......... Ne7 - this redevelopment to e7 is very necessary as white threatens Bxg6 winning the exchange as the h pawn is pinned to the rook on h8.",
        "11. Qh6": "11. Qh6, nasty, nasty.  The Wicked Witch of the West is threatening to come to g7 and take either the h8 rook or the h7 pawn.  I can prevent this however with d6 so that if white plays Qg7, Henry can move to d7 opening up a line for his wife Glenda to defend the rook on h8.",
        "11... d6 12. Qg7 Kd7 13. Qh6 Qf8": "13. ........... Qf8.  Glenda now fronts the Wicked Witch of the West.  White has the option of either leaving his queen where it is, taking my queen - either option results in a queen trade disarming white's mating attack or retreating it.  White takes the latter option by checking on h3.  Henry goes back to his home square.",
        "14. Qh3+ Ke8 15. Qg2 Nbc6 16. Ne2 Bf5": "16. ........... Bf5 - out comes the wood.  Now I have to manoeuvre my king into a castle by hand.  I choose the queenside as there is more pawn cover.  I might think about either a kingside or queenside mating attack on the white king wherever he chooses to go.  Both kingside and queenside is looking mega draughty.",
        "17. Be4 Bxe4 18. Qxe4 Kd7 19. f4 Qf5": "19. ........................ Qf5 this queen move controls quite a few squares and offers up a queen trade.  White declines the trade and moves the queen back to g2.  I now move my queen rook to f8, doubling up on the half-open f file and preparing to put my king on c8 achieving the planned Castle By Hand.  However ..........",
        "20. Qg2 Raf8": ".......................... I do not get to carry out my castle by hand plan because my opponent throws in the sponge on the grounds of Impending Ruinous Loss of Material!  He resigned because he felt he had no play for the pawn minus, and indeed his shattered queenside pawn structure could be a very vulnerable target resulting in further loss of material.  As in a previous note, where is the safest place for the white king?  All in all I think that black certainly has a clear advantage.  This game was unrated so I did not win any points.  However, I am very pleased to have survived an opening onslaught by the Wicked Witch of the West in such a sharp opening and to turn the tables on my opponent.  Very encouraging."
    },
    "url": "https://gameknot.com/annotation.pl/henry-survives-a-sharp-opening?gm=17101",
    "gameName": "Henry survives a Sharp Opening",
    "players": "dmaestro (1647) vs. jstevens1 (1689)",
    "opening": "English (A10), Anglo-Dutch defense"
}