{
    "moves": {
        "1. Nf3": "Hi everyone!\n\nWolfgang (caveman1960) managed to get up into the low 2000s.  Although his rating has fallen below it, after this game I still strongly back him to get back up there.  This game did last into the endgame, a B v N endgame and both our kings went on pawn gobbling missions.  But whose king got in first?  Well, read on or read GA below.  ",
        "1... d5 2. d4": "2. d4 - pretty standard double QP opening following the Reti.",
        "2... c6 3. c4": "3.c4 - which transposes into a Queen's Gambit Declined.",
        "3... Nf6 4. Nc3 e6 5. e3": "5.e3 - opening up Fou Leblanc's diagonal.",
        "5... Nbd7 6. Qc2 Bd6 7. Be2": "7. Be2 - clearing the decks for Henry to go kingside.",
        "7... O-O 8. O-O dxc4 9. Bxc4": "9. Bxc4 - pawn trade.",
        "9... a6 10. Rd1 Qc7 11. e4": "11. e4 - now opening up the diagonal for Fou Lenoir.",
        "11... b5 12. Be2": "12. Be2 - retreat.",
        "12... e5 13. Bg5 exd4 14. Rxd4": "14. Rxd4 - another pawn trade.",
        "14... Re8 15. Rc1 Ng4 16. h3 Nge5 17. Nxe5 Bxe5 18. Rdd1": "18. Rdd1 - after a knight trade another retreat.",
        "18... h6 19. Be3": "19. Be3 - and another.",
        "19... Nf6 20. Bf3 Bb7 21. Ne2": "21. Ne2 - looking to put pressure on the c6 pawn.",
        "21... Rad8 22. b3 Rxd1+ 23. Rxd1": "23. Rxd1 - rook trade.",
        "23... Rd8 24. Rxd8+ Qxd8": "24. ….. Qxd8 - followed by another.",
        "25. g3 Qc7 26. Bf4": "26. Bf4 - trying to relieve pressure down the h2 to b8 diagonal.",
        "26... c5 27. Bg2 Bxf4 28. Nxf4": "28. Nxf4 - bishop trade.",
        "28... c4 29. Ne2 Qc5 30. Kf1": "30. Kf1 - escaping from a very nasty pin from the BQ so that I can use the f3 pawn to back up the weak e4 pawn.",
        "30... a5 31. f3 Ba6 32. bxc4 b4": "32. ……. B4 - mmmm, crafty, he does not recapture on c4 due to the fact that he can now pin my knight on e2.  Nasty, nasty!",
        "33. Ke1": "33. Ke1 - Henry now tries to assist his beloved wife, Glenda in the defense of the queenside.",
        "33... Qxc4 34. Qxc4 Bxc4": "34. …… Bxc4 - and after the queens have been traded off, my pawn on a2 is en prise.  But there is a way out of this mess.",
        "35. Nc1": "35. Nc1 - like this.",
        "35... a4 36. Kd2 Nh5 37. Nd3": "37. Nd3 - Either the g3 or the h3 white pawns is a gonner so I concentrate on liquidating Wolfgang's queenside pawns.",
        "37... b3 38. axb3 axb3 39. Kc3": "39. Kc3 - king fork!  Yes, Wolfgang's bishop can still back it up along the a2-g8 diagonal but my knight will attack it on the next turn and then the black b pawn will be eliminated.",
        "39... Bxd3 40. Kxd3 Nxg3 41. Kc3 Kh7 42. Kxb3": "42. Kxb3 - the queenside pawns have been liquidated.  Henry now has a dilemma - should he merely defend the white vulnerable kingside pawns or should Henry counter-attack the black kingside pawns?  Henry, after a long deliberation decides that attack is the best form of defense so he goes for the black kingside pawns.",
        "42... Kg6 43. Kc4 Kg5 44. Kd5 Nh5 45. Kd6": "45. Kd6 - the heat is on.",
        "45... Nf4 46. Bf1": "46. Bf1 - this looks to be a reasonable move, activate Fou Leblanc.  This move proves to be a mistake, according to GA.  I should have moved this prelate to h1 instead.",
        "46... Ng6 47. Kd7": "47. Kd7 - at this stage Wolfgang is really impressed by Henry's move towards his pawns and told me he thought this was making the endgame very interesting.  Nice.",
        "47... Kf4 48. Ke8 Ne5": "48. ……. Ne5 - Henry is foiled.",
        "49. Kf8 g5": "49. ……. g5 - and foiled again!",
        "50. Kg7 h5": "50. ……. h5 - and again!",
        "51. Kf6 Nxf3 52. Kxf7": "52. Kxf7 - at last Henry is able to capture something, but there are still 2 black pawns left on the board.",
        "52... Kxe4 53. Kg6 h4 54. Kh5": "54. Kh5 - Henry desperately tries to make forg4 to block the g pawn.  Sadly King Wolfgang puts a stop to this.",
        "54... Kf4 55. Bg2 Kg3 56. Bf1 Nh2": "56. ……. Nh2! An excellent move - puts Fou Leblanc en prise and now the h3 white pawn may fall next move.",
        "57. Ba6 g4 58. hxg4": "58. hxg4 - only one black pawn left, but …….",
        "58... h3": "58. ……. h3 - there is no stopping the remaining black pawn so I now wave the white flag.  Although it is an expert loss at least I livened things up a bit in the endgame and took the fight to my opponent.  Sadly it did not pay off.  Well played Wolfgang, you certainly deserved your Expert status.  Kind regards - Joanne"
    },
    "url": "https://gameknot.com/annotation.pl/henry-on-a-mission?gm=65054",
    "gameName": "Henry on a mission",
    "players": "jstevens1 (1816) vs. caveman1960 (2004)",
    "opening": "Reti opening (A06)"
}