{
    "moves": {
        "1. e4 e5 2. d4 d6 3. d5": "I like this position because I am in a dominant posture right out of the gates. ",
        "3... Nf6 4. Nc3 g6 5. b3 Bg7 6. Bb2 Nc6": "This is your first mistake. The better move would have been to d7 which would provide cover for your knight on f6, and certainly not sacrifice a knight. ",
        "7. dxc6": "thus",
        "7... O-O": "Now here you castled, but as you learn later, an advanced pawn is a dangerous thing. So while I support castling early, I support capturing an advanced, wayward unprotected pawn more. ",
        "8. Bb5": "The pickle you get into would be averted already had you done so. ",
        "8... a6": "Again, rather take the pawn than threaten the bishop",
        "9. cxb7": "so now what are you gong to do?",
        "9... Bxb7 10. Bd3": "so you could have taken the pawn and not paid a penalty, now it is a straight exchange and you don't come out ahead. ",
        "10... h5 11. Qf3 a5 12. a4 Bc6 13. h3 Rb8": "I like this move though",
        "14. Nge2 Re8": "and this one",
        "15. Bc4 Qd7": "Was this move to protect f7? If so , not necessary at this stage. ",
        "16. O-O-O Bh6+ 17. Kb1 Qe7": "here is why, you could have moved right here now and have moved another piece earlier if that makes sense ",
        "18. Nd5": "In my mind the preferred trade from your point of view is knight takes knight. The reason I say that is that bishops are easier to manage late in the game. ",
        "18... Bxd5 19. exd5 c6 20. dxc6": "Because of the way you managed the trade, you end up losing another point and putting my pawn in an advanced position again.",
        "20... Rb6 21. Bc3 Rf8": "Honestly, I thought this a wasted move. ",
        "22. Bxa5": "because this was bound to occur - another point lost",
        "22... Rbb8 23. c3": "so this is the first of my moves to support that pawn on c6",
        "23... Rbd8": "I think you got into trouble here. I guess the lesson is to keep an eye on the advanced reach of the bishops. This is a good example of why I prefer them at the END of the game and go for knight exchanges. ",
        "24. Bxd8": "in fact...I am sure had you noticed the bishop you would never had made that decision right?",
        "24... Qxd8 25. b4": "so I am now aggressively pushing my support of the c6 pawn",
        "25... Qe7": "not sure whay you are taking this posture?",
        "26. b5": "Look at my [awn formation here. Now I need to get further ahead and the game is won...",
        "26... Bg5": "this gains what advantage I wonder?",
        "27. b6": "trouble brewing...",
        "27... d5": "OK, an attack down the flank repelled by an attack down the middle...good",
        "28. Ba2 Qa3": "This actually put you in a strong position, but at the same time you need to maintain awareness of my developing advance with the pawns. At first glance, I think had you brought your castle over to a8, you would have threatened mate",
        "29. c7": "instead, I distract you frm attack by attacking myself",
        "29... Ne8": "now you have cut off your escape and lost the power of your castle and I am immediately no longer under threat seriously AND I can push my pawn ahead further",
        "30. Rxd5": "All I have to do is contain you. ",
        "30... Qxa4": "I think the money play was you queen back to g7, or alternatively, to a8. Either one would have been better I think",
        "31. c8=Q": "here is why",
        "31... Be7": "now difficult to defend",
        "32. Rxe5": "because of this...which one do you defend?",
        "32... Nd6": "because I am up 16 points you just can't get into an exchange situation...I can simply trade with you until you have no more pieces right?",
        "33. Qc7 Nb5": "this looks like a key error. your bishop is unprotected and I will have three pieces attacking your pawn on f7",
        "34. Qxe7": "like so",
        "34... Nxc3+": "I can see why you would do this, but my knight and queen are your foil here. ",
        "35. Nxc3 Qa8": "too late perhaps?",
        "36. Bxf7+": "because",
        "36... Rxf7 37. Qfxf7+ Kh8 38. Qfg7#": ""
    },
    "url": "https://gameknot.com/annotation.pl/hez-to-win?gm=17925",
    "gameName": "Hez to Win",
    "players": "opus692 (1309) vs. chezter (944)",
    "opening": "Centre game (C21)"
}