{
    "moves": {
        "1. e4": "Thus begins a short game, initiated as a challenge by johnforteen6",
        "1... e6": "I play the French Defence, as usual. I only play anything else if I'm bored.",
        "2. d4 d5": "Main line French. Occasionally someone will play 2.Nf3, but this is the usual line.",
        "3. exd5 exd5": "The Exchange Variation of the French Defence. This leads to a symmetrical, drawish position, and White's only advantage is to have the first move. The Exchange French is often played by weaker players trying to get a draw against a stronger player, not the other way round!",
        "4. c3": "?! The Svenonius Variation. Not popular in GK's database, and statistics give Black an edge. This is a solid move, but removes the best developing square for White's queenside knight. If I were going to move that pawn, I would play 4.c4, forming a quasi-Queen's Gambit position, but obviously no longer a gambit as it is defended by the bishop. At any rate, I would probably favour a quiet, developing move such as 4.Nf3 or 4.Bd3.",
        "4... Bd6": "The most popular database option.",
        "5. Nf3 Nf6": "Following the database.",
        "6. Bd3 Qe7+ 7. Kd2": "Very interesting and unusual. White opts to move his king and lose castling rights, instead of more naturally blocking with Qe2 or Be3, both of which the DB suggests. I suppose that after 7.Qd2 Qxd2 8.Bxd2 White's light-squared bishop is not on such a good square, while White's dark-squared bishop is probably not very well placed on e3. At any rate, White's king is now blocking any development of White's dark-squared bishop, and preventing White's knight from developing onto any square other than a3, so I would definitely go for blocking the check in White's position.",
        "7... O-O": "Part of me - the adventurous, attacking part - wanted to play 7...Bf4 , forcing the White's king onto c2. But after 7.Kc2, (1) I have no more attack; (2) my dark-squared bishop is under attack by his dark-squared bishop and I have to either waste a move fleeing or exchange a developed for an undeveloped bishop; (3) his king is blocking his own development on d2 so I have no reason to want to force it off. Three good reasons for not playing that move. I decided against it, and went for the more flexible and calm 7...O-O.",
        "8. Re1 Qd8": "On second thoughts, maybe 8...Qd7 would have been stronger.",
        "9. Qb3 Nc6": "Both sides have poor queenside development, but there is a crucial difference: Black can develop his queenside at will, although I have not yet done so; White has a cramped queenside, whose development is blocked by his king and c-pawn.",
        "10. Kc2": "My opponent makes the logical and correct decision. He moves his king to a safer square, and opens up a line for the development of his dark-squared bishop.",
        "10... Bg4": "I am anxious to exchange pieces before my opponent can develop. If I can exchange off all his active pieces his lag in development will be much harder to cope with.",
        "11. Ne5": "I wouldn't play this myself. Another move that could have been used for development wasted!",
        "11... Re8": "Pinning and attacking his knight. Exchanging material is one thing; gaining material is much better.",
        "12. Bf4 Qe7 13. Nf3": "No! A pin turned into a discovered attack! Irritating, but not really a problem in any way. I just have to move my queen back.",
        "13... Qd7 14. Ne5": "Attacking my queen again. Maybe I should exchange off the pieces in the centre quth 14...Bxe5 (14...Nxe5 exe5) 15.Bxe5 Nxe5 etc. and make use of his lag in development. But for some reason my heart wasn't in it. ",
        "14... Qe7 15. Nf3": "What is irritating is that we both appear to be playing the best moves possible - well, maybe my opponent does, I'm not sure about myself... - but the position is still a draw.",
        "15... Qd7 16. Ne5 Qe7": "Draw declared by threefold repetition. I have a gut feeling that I should easily have won this position...am I right? Anyway, well played johnforteen6!"
    },
    "url": "https://gameknot.com/annotation.pl/hi-there-fancy-a-quick-game?gm=20890",
    "gameName": "hi there - fancy a quick game?",
    "players": "johnforteen6 (1571) vs. fatcat2 (1392)",
    "opening": "French (C01), exchange, Svenonius variation"
}