{
    "moves": {
        "1. e4": "Hi everyone!\r\n\r\nThis is an unrated game between myself and my buddy Steve from the Annotations Project.  This is my second Low Draw against Steve but this game did involve plenty of action.  I did temporarily have a pawn advantage in the game but unfortunately I was unable to keep it, although I did make sure that black did not have a remote queenside passer.  I then decided to liven things up a bit with an exchange sac.  This resulted in draw by perpetual check but if my opponent tried to avoid it then there were a few hidden traps.  Anyhow, on with the game, I kicked off with 1. e4 and he gave me the Robatsch Defense g6.",
        "1... g6 2. Nc3 Bg7 3. g3 e5 4. Bg2": "4. Bg2 - both sides fianchetto their kingside bishops.",
        "4... Ne7 5. d3": "5. d3 - supporting the centre and opening up the c1-h6 diagonal for Fou Lenoir.",
        "5... d6 6. Be3 Be6 7. Qd2": "7. Qd2 - we continue to bring out our pieces, Glenda now lines up on the d2-h6 diagonal behind Fou Lenoir with possible thoughts of exchanging those dsbs.",
        "7... h6": "7. ....... h6 - but not now says my opponent.",
        "8. Nge2 Nbc6 9. h3": "9. h3 - I clear the lines between Henry and the two rooks, where should Henry go?  I keep my options open and watch my opponent.",
        "9... Nd4 10. Nd5": "10. Nd5 - symmetry.",
        "10... Nxe2 11. Qxe2": "11. Qxe2 - knight trade.",
        "11... Nxd5 12. exd5": "12. exd5 - another knight trade but it leaves me with a doubleton on the queenside.",
        "12... Bd7 13. c4": "13. c4 - knitting the doubletons together.",
        "13... c5 14. Rb1": "14. Rb1? - I wonder whether I should have got rid of my doubleton with dxc6 e.p.  Now, after black's next move I look to go down a pawn.",
        "14... Qa5+ 15. b4": "15. b4 - if he is gonna grab a pawn then he can have a doubleton on the queenside too!",
        "15... Qc7": "15. ....... Qc7 - but the Wicked Witch of the West hot-tails out of my position on her broomstick.  My b4 pawn survives (it was twice attacked and only once defended by my rook) and the material count at the bottom remains at zero, phew!  After all that both sides now castle kingside.",
        "16. O-O O-O 17. b5": "17. b5 - I decide to keep my b pawn secure in a chain.",
        "17... b6 18. a4 Rae8 19. Qd2 Kh7 20. Kh2": "20. Kh2 - total symmetry on the kingside.",
        "20... Bf5 21. Be4 Bd7 22. f4": "22. f4 - not much doing here.  It is now a case of where do I go from here?  I just hope it doesn't turn my position south.",
        "22... Qc8 23. Bg2 Bf5 24. Rbe1 Re7 25. fxe5 Bxe5": "25. ........ Bxe5 - pawn trade.",
        "26. Bxh6": "26. Bxh6 - I might as well nab that insufficiently defended h6 pawn.  Black now doubles rooks on the e column.",
        "26... Rfe8 27. Be3 a6 28. Qd1": "28. Qd1 - I decided to let my opponent trade pawns on the b column first.",
        "28... axb5 29. axb5 Ra7 30. d4": "30. d4 - I have been contemplating getting rid of my backward doubleton on the d column for several moves, only Fou Lenoir has been pinned on the e column.  Now the rook moving to a2 has relieved it so some exchanges now take place.",
        "30... cxd4 31. Bxd4": "31. Bxd4 - pawn trade.",
        "31... Qxc4": "31. ........ Qxc4 - ouch, after these trades my c4 pawn is hanging to the Wicked Witch and she gleefully swoops down and turns him to dust!  Luckily black's b6 pawn is also hanging to Fou Lenoir who equally gladly reads him his last rites!",
        "32. Bxb6 Rb7": "32. ....... Rb7 - there is no saving the b5 pawn and I am scratching my head as to where to put Fou Lenoir.  I do not think I can get any more than a draw out of this - wait - as the game is unrated maybe I might just have a little fun here.  Maybe Glenda can intimidate black a little.  She looks so passive and the Witch so active.  However, an exchange sac now alters the picture a little.",
        "33. Rxf5 gxf5 34. Qh5+": "34. Qxh5+ - Glenda quickly goes to her wardrobe where there is a black outfit and a white outfit and black and white wands, dons her white gloves, puts her white cloak on over her equally white gown, puts on her white hat with gold tiara, picks up her white wand, shakes the cobwebs off her broomstick and then mounts it, her fair tresses flying loosely behind her as she flies off to h5, seeing the enemy king in her sights.  Ah, this is better says she!",
        "34... Kg7 35. Qg5+ Kf8 36. Qh6+": "36. Qh6+ - Glenda now gives the enemy king some hassle.",
        "36... Kg8 37. Qg5+": "37. Qg5+ - but unfortunately she has no back up.",
        "37... Kf8 38. Qh6+": "38. Qh6+ - here I offer a draw but black thinks he can escape the perpetual so he declines.",
        "38... Ke7 39. Qg5+ Kd7 40. Qxf5+": "40. Qxf5+ - Glenda grabs a pawn with check.  ",
        "40... Ke7 41. Qg5+": "41. Qg5+ - Now one trap which is fairly obvious is f6?? which will result in Qg7#.",
        "41... Kf8 42. Qh6+ Kg8": "42. ...... Kg8 - now black admits there is nothing better than to accept a draw by perpetual check.  If he plays Bg7?? then this more subtle hidden trap follows:-\r\n\r\n42. Qh6+ Bg7 \r\n43. Qxd6+ Kg8 \r\n44. Rxe8+ Kh7 \r\n45. Be4+ f5 \r\n46. Bxf5#\r\n\r\nSo black wisely plays his king to g7 and accepts the perpetual.  Steve has played very well and has earned his High Draw.  He is on a roll at the moment and his rating is steadily heading towards 1700.  I hope he gets there.  Anyhow, hope you are enjoying your weekend.  Bye for now - Joanne"
    },
    "url": "https://gameknot.com/annotation.pl/hidden-trap?gm=25423",
    "gameName": "Hidden Trap",
    "players": "jstevens1 (1794) vs. untateve (1668)",
    "opening": "Robatsch (modern) defence (B06)"
}