{
    "moves": {
        "1. e4": "Hi everyone!\r\n\r\nI have taken yet another trip down memory lane, this was shortly after I joined the coaching club after the Big Slump and my opponent is a fellow member.  In this game my eyes were a little sharper!  At least I think I took full advantage of my opponent's mistakes.  In fact I was very lucky because it looked as though in the early part of the middlegame that I might lose at least a pawn.  Here we get a c3 Sicilian after I kick off with 1.e4.",
        "1... c5 2. c3": "2. c3 - the c3 Sicilian, the purpose of this is to prepare d4 and to get a pawn centre on e4 and d4.",
        "2... Nf6 3. d3 Nc6 4. f4": "4. f4 - this move makes it more like a Sicilian Grand Prix attack though!",
        "4... e6 5. Nf3 d5 6. Nbd2": "6. Nbd2 - development.",
        "6... d4 7. Qc2 dxc3 8. bxc3": "8. bxc3 - pawn trade.",
        "8... Be7 9. Be2 h6 10. h3": "10. h3 - neither player wishes a knight or B incursion on g4 and g5!",
        "10... b6 11. Bb2": "11. Bb2 - Fou Lenoir moves to b2 to clear the decks.  Henry will stay in the centre, however.",
        "11... Nh5 12. f5 Nf4": "12. ....... Nf4 - but this is looking nasty, the pawn on g2 is hanging.",
        "13. g4 Nxe2 14. Kxe2": "14. Kxe2 - this knight trade keeps Henry in the centre.",
        "14... Bf6 15. Rag1": "15. Rag1 - should black castle short then my cannons could be waiting for him should the g and h files be opened.",
        "15... Ne5 16. Nxe5 Bxe5": "16. ....... Bxe5 - knight trade.",
        "17. Nf3 Bc7 18. c4 Rg8 19. Bc3": "19. Bc3 - Fou Lenoir moves to a better square.",
        "19... f6 20. Nh4 Bb7": "20. ...... Bb7 - development.",
        "21. Qa4+": "21. Qa4+ - just for once Glenda is not defending!!",
        "21... Kf7": "21. ....... Kf7 - now black's king has had to move.  Black could have offered a queen trade with Qd7 though.",
        "22. Ng6": "22. Ng6 - this knight is going to be well camouflaged behind a curtain of black and white pawns.  It's presence will not be felt until a little later.",
        "22... Qd6 23. Be1 Rgd8 24. Qc2": "24. Qc2 - Alas, Glenda must fulfil her usual role.",
        "24... Qd7 25. Bf2 a6 26. Rgd1": "26. Rd1 - I decide to move my rook to the same file as the Wicked Witch of the West!",
        "26... a5 27. Rd2 a4 28. Rhd1 Qe8": "28. ...... Qe8 - a lot of shuffling is going on here.",
        "29. Kf1 a3": "29. ....... a3 - pawn push.",
        "30. Qb1 Ba6 31. Qb3": "31. Qb3 - Glenda attacks as well as defends, for the moment the a3 pawn is hanging so black moves his lsb to b7.",
        "31... Bb7 32. Qc2 Bc6 33. Qc3 Bf4": "33. ....... Bf4 - black has been hypnotized by Glenda's shuffle from c2 to c3.  That horsie on g6 now leaps from behind the curtain and says Boo to black's dsb before lifting the mace!",
        "34. Nxf4 e5 35. Ng6": "35. Ng6 - this knight returns to his perch behind the curtain and there he remains for the rest of the game!",
        "35... Rdc8 36. Rb1 Rcb8 37. Rb3 Qc8 38. Rxa3": "38. Rxa3 - at last the a pawn falls and I am a piece + pawn up.",
        "38... Rxa3 39. Qxa3": "39. Qxa3 - rook trade.",
        "39... Ra8 40. Qb2 Qd8 41. Qc3 Ra7 42. Rb2 Qb8 43. Ke1 b5": "43 ........ b5 - pawn push.",
        "44. cxb5 Bxb5 45. Qb3+": "45. Qb3+ - Glenda puts herself on b3 but look how aggressive she is now.  The black lsb is now hanging but after black puts his king on e8 Glenda eyes much bigger game ......",
        "45... Ke8 46. Qg8+": "48. Qg8+ ........ the Wicked Witch of the West!  Next move it will be ding dong the Wicked Witch is dead after Qxb8.  My opponent waved the white flag!  An emphatic win, most unusual for jstevens1!"
    },
    "url": "https://gameknot.com/annotation.pl/hidden-behind-the-curtain?gm=23910",
    "gameName": "Hidden behind the curtain!",
    "players": "jstevens1 (1525) vs. Buddy E (1496)",
    "opening": "Sicilian (B22), 2.c3, Heidenfeld variation"
}