{
    "moves": {
        "1. d4": "I played this game while listening to some '77 Dead, and I was able to really outclass the opposition.",
        "1... d5 2. c4 c6": "Okay, so I think this is the Slav defence to the Queen's gambit.  I think Anand and Kramnik had a lot of Slav and semi-Slav positions in their championship a couple years ago.",
        "3. Nc3 Nf6": "Here I just took, thinking black would take cxd.",
        "4. cxd5 Nxd5": "This move is not what I would call classy, in fact I would say that it lacks class, and I would embarrass myself if I played it.  Since it asks for simplifications, it is aesthetically unappealing.",
        "5. e4": "But I try and prop by game up by playing with some class.  This e4 here immediately reasserts the desire for individuation if nxc3.",
        "5... Nxc3": "And he does, and here I think I have a great move prepared.  ",
        "6. bxc3": "Now that was a classy move from white.  I think white is going to have a lot of great attacking possibilities here with the bishops going naturally to b2 and d3, and maybe a gallant f4 break.",
        "6... e6": "This looks like another subpar move.  I think e5 may have been a lot better.",
        "7. Nf3": "Under no time pressure, I play nf3 before just f3.",
        "7... Be7": "This move looks slow, safe and uninspired.",
        "8. Bd3": "As you can see, the white position develops itself very naturally.  I can not help my courtly charm.  But will I prove a salacious rogue?",
        "8... O-O": "I think my development problem is almost solved, and I may be able to start attacking as early as the next move, which will only be move 10.",
        "9. O-O Nd7": "My old-world good manners and obvious noble bloodstock are just too much here.  I play a marvelously civilized nd2.",
        "10. Nd2 Nf6 11. f4": "He is a bold but comely rapscallion.  This is just a beautiful looking move.",
        "11... h6": "Okay, some maybe my opponent wasn't that great in this game.",
        "12. Nc4": "Maybe this knight idea isn't that brilliant.  Maybe just e5 or f5 would've been quicker and more to the point.",
        "12... b5 13. Ne5": "Okay, so I've got the knight where I want it, but why did I want it there.",
        "13... Bb7 14. f5": "Looking at the board, I think you would now say that the white attack is crushing.",
        "14... c5 15. Bxh6": "And it's obvious I have been to the best prep schools.",
        "15... Bxe4 16. Bxe4 Nxe4 17. Qg4 Bf6 18. Qxe4": "When I am not living in my ancestral castle, I am undoubtedly being waited upon in one of London's finer hotels.",
        "18... gxh6 19. Qg4+ Bg5 20. Qh5": "The threat here is simply qg6 after fxe.",
        "20... cxd4 21. fxe6": "I can be found in the owner's circle at the Kentucky derby.",
        "21... fxe6 22. Qg6+ Kh8 23. Rf7": "And I can't help the class.  If rxf7 then nxf7 is a beautiful mate.",
        "23... Qf6 24. Qh7#": ""
    },
    "url": "https://gameknot.com/annotation.pl/his-honourable-likeness?gm=35561",
    "gameName": "His Honourable Likeness",
    "players": "kitrich_omar  vs. tptperry ",
    "opening": "QGD Slav defence, Alekhine variation (D10)"
}