{
    "moves": {
        "1. e4 c5 2. Nf3 e6 3. d4 cxd4 4. Nxd4 Nc6 5. Nc3 Qc7 6. g3 a6 7. Bg2 Nf6 8. O-O Be7 9. Re1 d6 10. Nxc6 bxc6 11. e5": "Põnev avanguvariant, kus valged hiljem tihtipeale positsioonilise kvaliteedikahinguga musta mängu blokeerivad.",
        "11... dxe5 12. Rxe5 Nd5": "Seda käiku ei peeta just parimaks. Kuna mul variandi mängimise praktika eriti suur polnud, siis pani see siiski mõtlema.",
        "13. Nxd5 cxd5 14. Bf4 Bd6 15. Bxd5": "Hämmastaval kombel ma ei märganud üldse tugevat võimalust  15. Qxd5! ning pärast 15...Bxe5 16. Qxe5 Qxe5 17. Bxe5 Ra7 18. Bxg7 Rg8 19. Bf6 on valgel lõppmängus suur paremus.\n",
        "15... Bxe5 16. Bxe5 Qxe5 17. Bxa8 Qxb2 18. Rb1 Qe5": "Etturi löömine viib kuristikku: 18... Qxa2 19. Rb8! O-O 20. Bb7! Qc4 (20... Bxb7 21. Rxf8+ Kxf8 22. Qd8#) 21. Qd6 g6 (või 21... Re8 22. Bxc8 Rxc8 23. Qd8+) 22. Qxf8+ Kxf8 23. Rxc8+ Qxc8 24. Bxc8 enamviguriga.\n",
        "19. Bc6+ Ke7 20. Qd3 Qd6 21. Qc4": "Valgel on väike, aga selge ülekaal. Mustal on raskusi Oc8 mängutoomisega, kui valge c-ettur  hakkab edasi liikuma, siis valmistab seegi mustale muresid. Lisaks tiirutavad valged vigurid ka musta kuninga ümber...",
        "21... Rd8 22. Qh4+": "Parem oli kohe käia 22. Bf3, säilitades muuhulgas ka ähvarduse Lh4+ Näitlik variant: 22...h6 23. Rd1 Qb6 24. Rxd8 Qxd8 25. Qb4+ Qd6 26. Qc3 Bd7 27. Qxg7 etturivõiduga.\n",
        "22... f6": "Ei sobinud 22... Kf8 23. Bf3. Nüüd nõrgeneb musta 7. rida.\n",
        "23. Bf3 Qa3": "Julge käik. Pidasin seda algul veaks, arvestades variante a la 23... h6 24. Qg4 Kf7 25. Rd1 Qb6 26. Rxd8 Qxd8 27. Qh5+ Kg8 28. c4 selge ülekaaluga.\n",
        "24. Rb3 Qc1+ 25. Kg2 Qxc2 26. Qb4+ Kf7": "?? Kaotab kohe. Üllatusena märkasin analüüsides, et nii 26... Ke8, kui ka 26... Rd6 27. Rc3 Qd2 28. Rc7+ Bd7 29. Qb8 ei annagi valgele midagi erilist. Vähemetturi kompenseerivad valge aktiivsed vigurid, kuid c-ettur olnuks valgele hilisemas mängus tugevaks trumbiks... nüüd on see laualt lihtsalt lahkunud.\n",
        "27. Rc3 Qf5 28. Rxc8": ""
    },
    "url": "https://gameknot.com/annotation.pl/hof-2010-jyv-skyl-finland?gm=32605",
    "gameName": "HoF 2010, Jyväskylä, Finland",
    "players": "Lauk Ülar  vs. Riihimäki Pekka ",
    "opening": "Sicilian (B47), Taimanov (Bastrikov) variation"
}