{
    "moves": {
        "1. d4 d5 2. Bf4 e6 3. Nd2 c5 4. e3 Nc6 5. c3 a6": "Whit this move, black declares his intentions to go for a queenside pawn storm. My task is to press on the kingside, which is not easy while he doesn't develop this side of the board. ",
        "6. Ngf3 b5": "So my usual qside castling is out of question. Now I can try to hold this by playing a3, but it is kind of passive play, neglecting developement... no way. ",
        "7. Ne5 Nxe5": "I'm sure he expects me to take with the bishop, which is sound. But if I want to create something on the kinside, the best option is...",
        "8. dxe5": "I think he has to play d4, here, where I can't start the exchanges lightly. But Ne4 can allow me to play Nd6, and maybe - just maybe - I can have counterplay against d4xc3 or e3. ",
        "8... Bb7": "He loses his chance to play d4, and sets the threat of it by opening the diagonal for his B. But I am always very careful with this kind of threat, and this is the reason I don't move my lsb lightly and purposeless.",
        "9. Qg4": "This was my plan, if you can call it a plan. He is now in some trouble developing his kside, or this is the idea. ",
        "9... h5": "Best. My Q has to be very careful not to become trapped. ",
        "10. Qg3": "If h4, back to g5, of course. ",
        "10... Ne7": "His best developement chance, Nf5. And I can't counter with g4. Now I think I should have played the Q on h3, but this would have allowed him to play his dsb. ",
        "11. h4": "Making room for my Q and stopping any further advance of the a pawn. And controlling g5. ",
        "11... Nf5 12. Qh3": "Here, I still think his best move would be d4, where I'll be in trouble. I had handled badly this game, I'm aware.",
        "12... Be7": "Still, black is just helping me to fix all this. This allows",
        "13. Nf3": "?...but the N is overdued. He has to help controlling d4, defend h4, and it can be exchanged after d4. I'm busted. ",
        "13... Qc7": "Qa5 was better, with d4 as a definitive break into my position. ",
        "14. Ng5": "Since f6 can't be played (Nxe6 will help me), I hope to provoke some exchanges. ",
        "14... Bxg5 15. hxg5": "I know my dsb is just a pawn, but it helps a lot in holding the position. Now I  \"threat\" g4. ",
        "15... O-O-O": "Of course, he stops it. Now, how to get some activity from such a stinky position?",
        "16. g6": "A pawn sac can't be worse than what I already have. ",
        "16... fxg6 17. Bg5": "I calculated that he will move the rook, giving me time to play f4, kind of solidifying a center. But...",
        "17... Qxe5": "Well, it's a sound sacrifice but why not to accept it?",
        "18. Bxd8 Rxd8": "Now the threat is, again, d4 (I would castle Qside). And, of course, the sac Nxe3 is in the air. So...",
        "19. Bd3": "By exchanging his N I'll solve part of my developement problem, and I will loosen his power. Of course, I'll be two pawns down for the exchange. ",
        "19... d4": "Finally. ",
        "20. Bxf5": "Would he play dxc3? Not really, since I threat Bxe6+, and I won't take the pawn back.",
        "20... exf5": "Now, I have to keep him busy, exchange Queens, and go for the weak doubled pawn. Qg3 is not the way, of course. ",
        "21. O-O": "Reducing the power of his d4x moves. ",
        "21... d3": "...at this price, of course. But after the danger I was into, this looks still playable to me. ",
        "22. Qh4 c4": "b4 was better. No matter if the c column becomes open for my R, I can't take or Qxb2. ",
        "23. Qg5": "Let's see if he allows me to take his g pawn.",
        "23... Rd6": "No he doesn't. Now I can offer the Q's exchange on my own terms. ",
        "24. Qf4 Qd5": "Threatening mate on g2, but...",
        "25. f3": "...weakenind e3, but with no inmediate danger. ",
        "25... Re6": "Here he goes. Of course, Re1 is not a defence because of d2. ",
        "26. Qd4": "Making him hard to avoid the Q's exchange. ",
        "26... Qc6": "Of course he doesn't want it, which means my position gets slowly better. ",
        "27. Kf2": "No Qh2 for the time being. ",
        "27... g5": "? Going for an assault on my K, but overlooking...",
        "28. Qxg7 g4 29. Qh8+ Re8 30. Qxh5 gxf3 31. Qxf5+ Kb8": "...and, until here, I was satisfied. I started with a bad opening, I resisted the \"second/third\" best moves of my opponent, and I grabbed some pawns and an exchange, being +2 in a bad position, but still able to fight. Now, the strategic doubt: gxf3 joins my pawns. But it leaves a \"hole\" on the g and h column. I played with fear of possible infiltrations of his R and Q on these columns, joined with the need to control the d column and block his pawn's advance. ",
        "32. Qxf3": "Again offering a Q's exchange, and if Ka8 to shield, a4, inmediately...",
        "32... Qd6": "A phone call distracted me at this time, and I blundered the game. A pity. Some expert player can tell if the position was holdable, or even winnning?",
        "33. Qf4": "Unfortunate overlook. ",
        "33... Rf8": "...and I resigned. With a low rated player, I'd have gone for something like g3, and try to hold with two rooks against a Q and a B, but doing so at this rate was kind of insult. Moreover, I was well low on time. So I resigned. Thanks for reading and comment!"
    },
    "url": "https://gameknot.com/annotation.pl/holding-until-a-blunder?gm=64595",
    "gameName": "Holding until a blunder",
    "players": "damafi (1624) vs. king_staz (1776)",
    "opening": "Queen's pawn, Mason variation (D00)"
}