{
    "moves": {
        "1. d4 Nf6 2. c4 e6 3. Nf3 c5": "Topalov signals his intention to play the Modern Benoni. His move order (2..e6 instead of 2..c5) is the current preference, intending to meet 3.Nc3 with non-Benoni systems (i.e. 3...Bb4 and the Nimzo-Indian or 3...b6 and the QID). Black only plays 3..c5 when White has committed to 3.Nf3, which avoids the extremely potent Flick-Knife Attack involving an early f4.",
        "4. d5 d6 5. Nc3 exd5 6. cxd5 g6 7. h3": "Entering the Modern Classical variation, where White will continue with e4 and Bd3 and the struggle is slightly less explosive than the typical Flick-Knife encounter.",
        "7... Bg7 8. e4 O-O 9. Bd3": "The main position. White has overprotected e4 with Bd3, stymied the c8 bishop with an early h3 (preventing ..Bg4 and thereby cramping Black for a time - the c8 bishop has no natural development squares), and completed his kingside development.",
        "9... b5": "Black's most critical response, this ..b5 sacrifice opens lines on the queenside and deflects a defender from e4. With White's king still in the center, Black has many tactical possibilities along the e-file when White accepts the sac.",
        "10. Nxb5": "The knight capture is considered White's most aggressive option, as he aims to hold the pawn (or at least complicate Black's material situation). If Bxb5, Black typically responds ..Nxe4 followed by ..Qa5 , when he picks up White's bishop to regain material equality. In that line, White has a positional plus to exploit. Now, if Black tries the same ..Qa5 trick the b5 knight retreats to c3 with the extra pawn in hand. Given this, Black must play quickly to prove compensation or regain material equality, which often involves wild and active play, as in the game continuation.",
        "10... Re8": "Quickly pressuring the abandoned e4 pawn. The immediate ..Nxe4? (intending a sacrifice as in the game continuation) results in difficulties after 11.Bxe4 Re8 12.Ng5!, intending 12..h6 13.Ne6! and White turns the tables on Black's sacrifice with a dangerous offering of his own (e.g. 13...fxe6?? 14.dxe6 and the a8 rook is falling).",
        "11. Nd2": "Supporting e4.",
        "11... Nxe4": "First, the simple ..Nxd5 regains the pawn (the e4-pawn is pinned). It's a fair and playable alternative, but Black's hanging pawns (and d-pawn is backward) sit on open files and White must be doing well. Instead, Topalov decides to exploit 1) White's temporary clog in development, 2) Black's e-file pressure, and White's exposed king, with ..Nxe4!? Black sacrifices a knight for tremendous pressure on the White position...not exactly a novel idea in the Benoni, but undeniably a risky, fighting plan.",
        "12. Bxe4 Ba6 13. a4 Qa5 14. Nxd6": "The only clear way to retain advantage, as Black threatens both ...Bxb5 and ..Rxe4, exploiting pins along the a-file and the a5-e1 diagonal. Van Wely's move covers both holes and attacks a rook.",
        "14... Nd7": "Best. ..Rd8?? fails to Nxf7! when White will play Qf3  and d6, hitting the a8 rook and winning at least a piece. The text allows the simple Nxe8, but White is in serious trouble after Rxe8 and ..f5, winning the bishop and continuing great pressure on the White king (who's inability to castle makes the h1 rook useless in defense, while Black's a8 rook has entered the game decisively)",
        "15. Qc2": "Supporting e4 (in anticipation of the unavoidable ..f5) and creating an escape square for the beleaguered king.",
        "15... f5 16. Nxe8": "White becomes greedy. It is not clear if his appetite is unjust, but now his position becomes a nightmare to defend against a player of Topalov's caliber.",
        "16... Rxe8 17. Kd1 fxe4 18. Ra3": "White is up the Exchange and a pawn, but how will he survive? The text bluntly introduces the a1 rook into defense.",
        "18... c4": "A rare line, and the beginning of Topalov's novelty. Objectively, ...Bd3 is likely best (and the main line), when White must return the Exchange (the point of Ra3) via Rxd3, but here Topalov clears c5 for his knight (angling for the juicy outpost d3) and clamps down on the b3 square.",
        "19. Re3": "Inadequate, given Black's reply. Van Wely later suggested Re1, with (slightly) more favorable conditions.",
        "19... Qxd5": "The new move, and clearly best. Van Wely probably expected the old 19...Nc5, which favors White (again, more complications not practical to examine here)",
        "20. Rxe4 Rf8": "A terrific idea. ..Rxe4? is clearly bad, as White weasels out of his bind with a large material advantage. Exchanges typically favor the defending player in these situations. Instead, Topalov leaves the uncomfortable White piece at e4 and redirects along the f-file.",
        "21. f3 Nc5 22. Re7 Bf6 23. Rxa7 c3": "The king is under tremendous pressure.",
        "24. Rxa6 cxd2 25. Rxf6 dxc1=Q+ 26. Kxc1 Rxf6 27. Rd1 Qc6 28. Kb1 Nxa4 29. Qxc6 Rxc6": "Cashing out into a difficult endgame. White's exposed king is telling, as he will have trouble participating safely in defending the White pawns. It's not so useful to examine the endgame here, so the rest is without notes. Black will use his rook to keep the White king away from the kingside pawns, while manuevering his knight and king into winning position. Not as easy as it sounds.",
        "30. Rd8+ Kg7 31. Rd7+ Kh6 32. h4 Nc5 33. Rf7 Ne6 34. Ka2 Ra6+ 35. Kb1 Nd4 36. Rf4 Nf5 37. Re4 Rd6 38. Kc2 Ng3 39. Rg4 Nf1 40. Kc3 Ne3 41. Rg5 Nf5 42. Rg4 Kh5 43. b4 Ne3 44. Rd4 Rxd4 45. Kxd4 Nc2+ 46. Ke5 Nxb4 47. Kf6 Nd5+ 48. Kg7 Ne3": "White resigns. The Black knight will pick up the stray White pawns and the g-pawn ultimately promotes. A fantastic game."
    },
    "url": "https://gameknot.com/annotation.pl/hoogovens-wijk-aan-zee?gm=6231",
    "gameName": "Hoogovens, Wijk aan Zee",
    "players": "Van Wely, Loek (2605) vs. Topalov, Veselin (2740)",
    "opening": "Blumenfeld counter-gambit (E10)"
}