{
    "moves": {
        "1. e4": "This is a return game against heart-bleeads, I lost the first game, now with white. I have to admit there is no opening I know better than the absolute standard one, so here it goes.",
        "1... e5 2. Nf3 Bc5 3. Bc4 d6 4. h3": "I didn't even want him to think about going to g4 with his bishop, so I stopped him preemptively.",
        "4... h6 5. Nc3 a6": "he obviously doesn't like my light figures to snoop around in his area.",
        "6. d4": "Let's clear some space in the center, it's getting too crowded.",
        "6... exd4 7. Nxd4 Bxd4 8. Qxd4": "Bam Boom Bam and out is the queen and it even threatens the pawn on g7. Coincidence? Who knows. ;)",
        "8... Qf6": "He saw it coming, and he took out the big ones. Should I, or shouldn't I exchange?",
        "9. Qxf6": "I should.",
        "9... Nxf6 10. O-O": "Let's give ourselves a little more safety.",
        "10... Be6": "What? He wants to exchange more? But we just...? Hmmm...",
        "11. Bd5": "If you want to exchange, do it as I want, with my white pawn out of the way on the e line",
        "11... Bxd5 12. exd5": "Well, that worked, the line is free, let's nag him a little with the rook.",
        "12... Nbd7 13. Re1+ Kd8": "So much for your rochade - that THAT. But what now, there's so much space...",
        "14. a4": "To boldly go...",
        "14... Re8": "Oh nooo, more exchanges? He knows about my poor end game, doesn't he?",
        "15. Bf4": "I say no and take out my 2nd bishop instead.",
        "15... Nb6": "Now he's getting aggressive. My poor pawn on d5.",
        "16. Rxe8+": "So I distract him first with the rook exchange.",
        "16... Kxe8 17. Rd1": "And the other goes to save the pawn.",
        "17... Kd7": "He makes way for his rook.",
        "18. a5": "Godspeed, young pawn.",
        "18... Nc4": "So he goes after my backup troops",
        "19. b4 Re8": "I expected that.",
        "20. g4": "Maaaarch!",
        "20... Ne4": "Uh oh, the air is getting thin, I have this feeling.",
        "21. Rd4": "You cannot defend two knights with one move, right?",
        "21... Nxc3 22. Rxc4": "Riiiiight.",
        "22... Nxd5": "Ok, for now everything is in balance. I'm one pawn short, no big deal. But what to do now?",
        "23. Bg3": "I can't let my rook defend so many figures, so I take a little weight off.",
        "23... Nf6 24. f4": "I know only one way.",
        "24... Nd5": "Didn't you just come from here?",
        "25. Rd4": "Let's keep that knight on the move.",
        "25... Nc3 26. Kf2": "Again, I had this feeling, so I went up with the king to be able to assist the pawns.",
        "26... Re2+": "Should have seen that, but no one is hurt, right?",
        "27. Kf1 Rxc2": "Ouch, but...",
        "28. Rc4": "Hahaaa, one of you has to go - you pick.",
        "28... Rc1+": "Pfff, he's just stalling.",
        "29. Be1 Na2": "Or so I thought. Went from a threat to a nice clean exchange. Well, what could I do?",
        "30. Rxc1 Nxc1": "Ok, I can definitely see an end game here, so I have to look at the pawns again, especially since I'm two short. But mine are already half way, so maybe it'll all work out.",
        "31. Bc3": "Uuuuh, will he see this?",
        "31... g6": "Who would have though. But I see a nice place up there.",
        "32. Bg7": "That's a good spot for a swift bishop.",
        "32... h5": "Of course.",
        "33. gxh5": "Let's fight. There can be only one. And I have the church with me, in form of a bishop.",
        "33... gxh5 34. Kg2": "I'll just go and pick up those two black pawnies.",
        "34... Nd3": "Yeah, he's gonna get one of them.",
        "35. Kg3 Nxb4 36. Kh4": "But now I'll feast, too.",
        "36... Nd3": "Or won't I?",
        "37. f5 Ne5 38. Kxh5": "Now I will.",
        "38... c5": "This could be a close race.",
        "39. h4": "But I can win.",
        "39... Nc4": "This was the big mistake. Why he opened the diagonal up for my bishop while at the same time blocking his pawn, I'll never know. But thanks.",
        "40. Kg5": "Let's make way and go for that 2nd black pawn.",
        "40... Ne5": "You like jumping back and forth, don't you? But you gave me a head start now, so let's go.",
        "41. h5 Ke8": "Yeah, he has to try to stop me now.",
        "42. h6": "But he can't with that bishop in the way.",
        "42... f6+": "So he opens the way and checks me.",
        "43. Kxf6": "I don't think that was worth it, since he still can't go for my bishop.",
        "43... Nf7": "Ummm",
        "44. h7": "Ok, I'll just move away from that knight, ok? I already can see now, that I'll switch my pawn with the knight, which is a sweet deal, considering it's his last figure.",
        "44... c4": "No worries, the bishop will save me. Let's get active.",
        "45. h8=R+ Nxh8 46. Bxh8 c3": "It's getting closer...",
        "47. Ke6 c2 48. Bb2": "Just in time. Now it's easy.",
        "48... d5 49. Kxd5": "Nice try.",
        "49... Ke7 50. Ke5": "You want that pawn? Not yet.",
        "50... Kf7 51. f6": "I'll just move it into the safe zone.",
        "51... Kf8 52. Kd6": "Tadaaaaa. Immune.",
        "52... Kf7 53. Kc7": "I'll just grab these two, ok?",
        "53... c1=Q+": "Too little, too late.",
        "54. Bxc1 Kxf6": "Of course, but I still got one in the oven, and you can't get that.",
        "55. Kxb7 Ke7 56. Kxa6 Kd7 57. Kb6 Kc8 58. Bf4 Kd7": "Now the path is clear and it's just a matter of time.",
        "59. a6 Kc8 60. a7 Kd7 61. a8=Q Ke6": "Shouldn't be too hard.",
        "62. Qe4+": "Which corner will it be, black king? left or right?",
        "62... Kf6": "Right it is.",
        "63. Qe5+ Kf7 64. Kc6 Kg6 65. Kd6": "I'll take my time.",
        "65... Kf7 66. Qe6+ Kg7 67. Ke7 Kh7 68. Kf7": "Ok, time to finish him.",
        "68... Kh8 69. Qh6#": "That's it. Why didn't that work in the first game?"
    },
    "url": "https://gameknot.com/annotation.pl/hot-heart-bleeads?gm=21513",
    "gameName": "Hot heart-bleeads",
    "players": "kron (1200) vs. heart-bleeads (1429)",
    "opening": "King's knight opening (C40)"
}