{
    "moves": {
        "1. c4": "This was definitely a game of two halves as they say. It all started reasonably well then after around 20 moves everything fell apart. I think I learnt a lot from this game but would still be interested to see comments and thoughts.\n\nAnalysis is also available at http://gameknot.com/analyze-board.pl?bd=18461988&rnd=0.7610093399416655",
        "1... Nf6": "English, 1...Nf6 (Anglo-Indian defense) (A15), I'm not sure why but this isn't a response I see often to my favoured c4 opening",
        "2. Nc3 g6 3. Nf3 Bg7 4. e4 d6 5. d4 O-O 6. Be2 c5": "This is quite a common choice but I think I prefer e5 here for black",
        "7. O-O Na6": "While its still well within the Gameknot opening database I don't really understand this move. The computer calls it an innacuracy",
        "8. a3": "This was to prevent a knight incursion on b4 but the computer calls it a mistake preferring e5",
        "8... cxd4 9. Nxd4 Nc5 10. f3 a5 11. b3": "This move seems very passive to me I'm still not entirely sure why i made it.",
        "11... Ra6": "This was a bit unexpected I'm not sure where the rook is headed",
        "12. Be3 Bd7 13. b4": "Now my a1 rook is defended I can safely do this but I don't think its best as it allows black to exchange off his a rook which looks awkward to me",
        "13... axb4 14. axb4 Rxa1 15. Qxa1 Ne6 16. Rd1 Qc7 17. Ndb5": "Trying to push the black queen out of harms way",
        "17... Qb8 18. Qb1": "This is another move that I think especially with the benefit of hindsight is too passive",
        "18... Rc8 19. Qd3 b6 20. Nd5 Nxd5 21. Qxd5": "I thought long and hard about this and decided to take with the queen so as not disrupt my pawn structure too much, in particular I didn't want to open the c rank for black. As it turns out this was the start of my demise.\n\nAnalysis calls this an inaccuracy",
        "21... Be5 22. Bh6": "This didn't seem unreasonable at the time, the bishop is pretty safe there and keeps the black king hemmed in, I just need to work out how to get at it however analysis calls this a mistake preferring g3",
        "22... Bxb5 23. Qxb5": "For some reason I completely missed the threatened fork here. I took with the queen to avoid doubled pawns and to keep the c rank closed.\n\nAnalysis calls this a mistake and gives black a large advantage from this point.",
        "23... Nd4 24. Qd7": "I saw this as an attempt to cut my losses but at this point I started to lose my way, the computer prefers Rxd4, from now on I fall into my opponents hands completely.",
        "24... Nxe2+ 25. Kh1 Rc7 26. Qg4 Nc3 27. Rf1 Rxc4 28. Re1 Rxb4 29. f4 Nxe4 30. Qf3 Bc3 31. Rd1 d5 32. g3": "Thanks for reading please comment",
        "32... Rb2 33. Rxd5 Qa8": ""
    },
    "url": "https://gameknot.com/annotation.pl/how-to-lose-at-chess-pt-7?gm=47742",
    "gameName": "How to lose at chess pt 7",
    "players": "elwoos (1468) vs. ropertof (1832)",
    "opening": "English opening (A16)"
}