{
    "moves": {
        "1. e4": "In this game, I received a lesson from a lower-than-me player. It testifies that my current life is not suitable for serious chess. I am a \"talker\", but not a \"walker\". Anyway, the game is interesting and may teach something to someone. Due to time limitations, I won't be able to properly annotate move's numbers, and to set diagrams (as I usually do). Sorry for this!",
        "1... d5": "Scandinavian. ",
        "2. exd5": "Most usual response. e5 is another good option. Nc3 is not good because of d4...",
        "2... Nf6": "The risky line that tries to bring my enemy into my territory, playing a game I know well. ",
        "3. d4": "The best answer, according to databases and pros. c4 would open lines for Bb4+, Ne5 and strong pressure on white. ",
        "3... Qxd5": "Nxd5 is more conservative, but I am not completely convinced still... ",
        "4. c4": "Good and natural, so is...",
        "4... Qe4+": "A Q's retreat would have been just a failure of the entire plan. I have to go on and see where it leads. ",
        "5. Be3": "White need precise sequence to safely develop: Nf3, Bd3. This gives me two tempoes to open my lines. ",
        "5... e5": "Keeps both bishops free. The standard plan is that now white seems to have a very strong move with...",
        "6. Nc3": ", but my reply is...",
        "6... Bb4": "And this sets a very dangerous game, because it allows Qa4+. The only way for black not to lose Bb4 is Nc6, but this N is pinned to the king, so d5, apparently, wins the Nc6 and threatens c6xb7+.\nNevertheless, that is not so, because black will reply Nxd5, and white can't retake c4xd5 because the Qa4 is hanging (being Nc3 pinned by the Bb5). \nMore than that: black has BxNc3+ at any moment, and exd5 which establish a counter-pin on the Be3. So the situation is already very, very complex. ",
        "7. Bd3": "This move only adds to the previous lines the extra-possibility for black to play Qxg2, threatening the trapped Ra1. At the same time, this opens another completely different attack's way for white, based on dxe5 (instead of d5). This forces Nf6 to leave, allowing Be4, that protects the Ra1 and kicks black's Q away with tempo. But white misses a tempo and I could have defended against d5, even at the cost of Nc6, if I had a R (and, potentially, Ng1), as free targets leading to his King. ",
        "7... Qxg2": "I accepted the risk. The game is highly enjoyable and tactic. Here, a good move by white is Qf3, which saves white's rook, but for the tactical shot: BxNc3+, bxB, QxQ, NxQ, e4!, forking both pieces, and avoiding dxe5. All this is mind-blowing. A lot of themes simultaneously present at the same board...",
        "8. Qa4+": "White goes for the \"pin-plan\". Ok. Now it's very hard calculation: who'll be first, and which will be the real damage for me and my opponent?",
        "8... Nc6": "Ok, now let's recapitulate: white has: 1) d5, going for Nc6. Not good because after QxRa1, the WQ covers c6, and it would be Qxc6 after interposing BxNc3+. 2) The more subtle dxe5, threatening to occupy Be5, with strong threats on c6. This plan is a move too slow, even in case white wants to block the diagonal for the BQ with f3, since QxNg1+, Ke2, Qg4+(better than QxRa1), BxNc3+, bxN, followed by Q or Bd7, defending against dxN, bxc6. 3) Another more scaring way to proceed would be Nd5 or Nb5, but it's pinned. It will threaten the c7+ fork... but white finds the righ move: ",
        "9. O-O-O": "!! Wonderful. It frees Nc3, eliminates the check after BxN, and it defend Ng1 so after QxR, f3 can be played and it is possible dxe5, threatening the N but also conquering Be4, pressing Nc6. I saw all this, and I thought I will be a step smarter, with...",
        "9... Bxc3": "Bd6, even if sad retirement, was very indicated here. It defends c7, and ensures dxe5 is not a threat anymore. White will try to cash the N with d5, QxR, f3!, and I will have had e4!, closing to white the possibility to have a B on e4 (if Bxe4, NxB). ",
        "10. Ne2": "White sacs a piece, apparently. He trusts in the fact that if I take a tempo to retreat the B, it will be lost or threatened after d5, dxNc6. On the other side, white saved his Rh1, and now, Rd-g1 will be very strong, opening a new weakness in black's field. The obvious answer would have been Bxb2+, KxB, but then I had only one tempo to parry all the threats, so I thought it was better to exchange some pieces and eliminate some threats. (Sagely, GK's engine gives this move as ok for white, preferring it over bxc3 - which allows QxRa1). ",
        "10... Bxd4": "This move removes the pawn that was causing two different threats. Now Nc6 is solid as a rock, white can't go to Be4 without being exchanged or taken, there is no N aiming to c7...",
        "11. Rhg1": "Inviting Qxh2, but allowing Rxg7 with more threats. ",
        "11... Qf3": "Threatening BxB+, followed by Qxe3+, QxN... (GN's engine considers this a heavy mistake, preferring BxB+ at once, because of the following threat on e6. But black misses a move - this one - for this plan to be feasible. ",
        "12. Nxd4": "Wise. ",
        "12... exd4": "Sacrifying the pawn for one important tempo.",
        "13. Bxd4 Ng4": "!? (Be6 allowed Rxg7). This way, I set some interesting threats on f2. (GK's engine here starts to give as \"better\" lines that lead black to a very sad position. I admit I dared a little too much, trusting in lines that were only phantoms.",
        "14. Bxg7": "I hoped for this. Now, the plan was to take advantage from the weakened f2, even at the cost of Rh8. ",
        "14... Nxf2": "I am not worried by Re1+, Be6, which seems solid. And I am threatening NxB+, where RxN, QxR, BxR, Qe6+, taking Rg1 the next one. Many more lines are possible, and I bet they all lead to black's advantage. ",
        "15. Rg3": "Again, interesting. I am +4, with a R hanging. I hoped for Qc2, releasing pressure and giving me a little breath for Rg8. This move stops a lot of bad lines for white...",
        "15... Nxd3+ 16. Rxd3 Qf4+": "?? Looking for a tempo to escape and save my R, keeping my +4 advantage, I missed Qf1+ (Rd1, Qxc4+!, and if Qd1, QxQ+, KxQ, Rg8). ",
        "17. Rge3+": "check, a winner because of the tempo. ",
        "17... Be6": "The foreseen defence, but a tempo too late...",
        "18. Bxh8": "Ok, so we'll play an unbalanced game. ",
        "18... Ke7": "Unpinning the N and threatening the B, being Be6 still pinned. GK's engine suggests f6 (Re3 is pinned, so RxB is not possible. And gives as best for white Bxf6 - essentially losing a B for a R and a pawn. Not a real bargain...",
        "19. Bg7": "? Just a tempo for me! Bc3 would have been the best safe place. but black may want to go Rb3, pressing on b7, and Bc3 would be in the way. GK's engine suggests Qa3+ at once, and it is very strong, indeed. I'm surviving by miracle... and this normally doesn't work at chess!",
        "19... Rg8": "Anyway, I won't lose the chance to activate my R!",
        "20. Bc3": "White of course doesn't want NxB. ",
        "20... Rg1+": "? Not the best, coming back to it? Very difficult to say, please help! :-)",
        "21. Kc2": "...and here is the critical point. What do you think, dear reader? Does black have the game or not? I'll keep annotating this later. ",
        "21... Qxh2+": "? Not the best. Qf2+ restricted more white's defences. Rd2 is impossible due to QxRe3. ",
        "22. Kb3": "Self-pinning his c pawn... but putting the K on a safe place. I couldn't believe that I could not get something from this, and now Rg2 is not so threatening as if my Q would have been on f2. Anyway, white has already tactic mate: Qa3+, Ke8, Bf6! (the move I missed). ",
        "22... a6": "Desperate: after b5, bxc5+ would get me again into the game. ",
        "23. Qa3+": "Naturally. ",
        "23... Ke8": "I though I would have held for a tempo, but not after...",
        "24. Bf6": "!! Sigh, this sets tactical mate in few. Rxd8+ forces NxR, which opens the way for Qe7#. I can sac my Q on d6 to go on some more moves, but it would have been childish. My opponent played very well, with less weak moves than me, without falling in traps, as a proper serious chess player should do. Very well played by him!"
    },
    "url": "https://gameknot.com/annotation.pl/how-to-lose-for-overconfidence?gm=59139",
    "gameName": "How to lose for overconfidence",
    "players": "bert1bell (1615) vs. damalfi (1769)",
    "opening": "Scandinavian defence (B01)"
}