{
    "moves": {
        "1. e4": "This was a tournament game that I started part way through a significant slump in form. By the time this game was fully under way my rating was rising again, albeit slowly. This is one of the games that got me back over 1500 which is into the region that I normally inhabit.\n\nThe ending here involved a little luck but was a rather unusual one. \n\nPlease comment and rate this annotation",
        "1... c5 2. f4 e6": "grand prix attack",
        "3. Nf3 Nf6 4. Nc3 Nc6 5. Bb5 Qb6 6. d3 h6 7. Be3": "pins the pawn to the queen to discourage c4",
        "7... Nd4 8. O-O": "this is a blunder as it loses material",
        "8... Nxb5 9. Ne2 Ng4 10. Bf2 Be7 11. Qe1 f5 12. c4 Nxf2 13. Qxf2 O-O": "Another blunder which allows me to regain the material I lost earlier",
        "14. cxb5 a6 15. bxa6 Rxa6 16. Nc3 fxe4 17. dxe4 Rxf4 18. Qe3 g5 19. Qd3": "looking to open up the diagonal to h7 after e5",
        "19... g4 20. Ne5 Rxf1+ 21. Kxf1": "the black king doesn't have much in the way of defence at the moment, the question is can I get rid of the g4 and possibly the h6 pawns",
        "21... Bf6 22. Nxg4 Bg7 23. Qg3 Kh8": "avoids the dangers from n x h6 + \n",
        "24. e5": "protecting the knight on c3 which later turned out to be critical to the game result",
        "24... Qxb2 25. Re1": "I preferred this to Qe1 for example due to the possibility of Nf6, which constrains the black king to the corner",
        "25... b5 26. Nf6 b4": "Bxf6 loses to exf6  which will be followed by Qg7\n\nI realised here that if I could get my c3 knight to f7 or g6 I would win, blacks move here helped as I was forced to move the knight I decided to go with b5, d6 threatening the black lsb, which was of course a decoy as the knight would go to f7",
        "27. Nb5 Rxa2": "This was a great move for me as the only real threat to my plan was that black would see it and then R x d6. Obviously it's not too late for that",
        "28. Nd6 Ba6+": "forced, however after moving the king, black can't prevent my plan from succeeding",
        "29. Kg1 Ra1 30. Nf7#": "And there it is. Not a common mating pattern and consequently one that is quite satisfying. In this case it involved a little luck for me that black didn't spot it."
    },
    "url": "https://gameknot.com/annotation.pl/how-to-lose-at-chess-pt-14-an-unusual-finale?gm=65268",
    "gameName": "How to lose at chess pt 14 an unusual finale",
    "players": "elwoos (1514) vs. morgansm (1582)",
    "opening": "Sicilian (B21), Grand Prix attack"
}