{
    "moves": {
        "1. e4 c5 2. Nf3": "Start your game as usual. Big shocks like 1. h4 just make you look like an idiot and also, they lose.",
        "2... d6 3. Bb5+": "Start with playing less-played but dangerous variations - Who cares if you win a technical endgame in a Ruy Lopez?",
        "3... Bd7 4. Bxd7+ Qxd7 5. O-O Nf6 6. c3": "Sacrifice a pawn before the 10th move; the opponent will think it's a trap and he won't take it - you already have an advantage because of that.",
        "6... Nc6 7. d4": "Don't save your pawn at the next move - it's a sign of cowardice. Just be more and more aggressive.",
        "7... Nxe4 8. d5": "Gain tempos. People like games with may tempos in one side, they make the opponent feel like they doing something wrong.",
        "8... Nb8": "Watch for signs of cowardice and attack when the opponent feels the worst.",
        "9. Re1 Nf6 10. Bg5 Qf5 11. Bxf6 gxf6": "Always double enemy pawns. Even if you screw up something and enter an endgame with material (hopefully just 1-2 pawn) disadvantage, it's harder to exploit that with doubled pawns.",
        "12. Nbd2 Qxd5": "Make the opponent believe that you just blundered something..",
        "13. c4 Qc6 14. Ne4": "Gain some tempos that weakens the enemy positions further. (Here Nxf6 is threatened)",
        "14... Kd8 15. b4": "Make banal sacrifices that look very bad, this makes the opponent believe that you are an idiot and makes the audience believe that winning from here is impossible - which makes you a hero if you do it.",
        "15... cxb4": "The 10th move is passed, so the enemy will take pawns...",
        "16. c5": "When you have a development advantage, don't make use of it, because then they will just say \"Oh, you won because of better development...\" You may want them to say \"How the HELL you've won???\"",
        "16... d5 17. Nd4": "When the opponent thinks he won a tempo, slap him in the face by gaining one for yourself instead. By  now you should have a huge psychological advantage... who cares that the game will be won on the chessboard?",
        "17... Qd7 18. c6": "Strike te enemy where he does not expect it - in his midriff.",
        "18... bxc6 19. Nc5": "Move your pieces TOWARDS the enemy. Even if they are very bad moves, they are frightening at firs sight. A good tactic for blitz! Who cares that we play a long game right now...",
        "19... Qe8 20. Re6": "Around when the 20th move comes, make a sacrifice involving a move which doesn't seem to threaten anything. This makes everyone totally believe that you don't know what's going on... Foo them by proving your sacs were good (Here the threat is Nxc6 Nxc6 Qxd5+ Kc7 Na6+ Kb7 Qb5+ Kc8 Rxc6+ and mates...)",
        "20... fxe6 21. Ndxe6+": "Win pawns with tempo to make the kibitzers start to believe that you are kind of understanding something.",
        "21... Kc8 22. Qg4": "You can start to make very good moves here since by now everybody thinks you're a fool and fools don't know good moves...",
        "22... a5 23. Nxf8+ f5 24. Qxf5+ e6 25. Nfxe6 Nd7 26. Rc1": "Make silent moves (that lay an implication to the audience to stay silent also...)",
        "26... Ra7 27. Ne4": "When they think you are doing very good, just sacrifice more material to maximize the effect of your \"bolts from the blue\" later.",
        "27... dxe4 28. Rxc6+ Kb8 29. Qf4+": "When you see a check, do it - this makes you seem like a patzer.",
        "29... Ka8 30. Nc7+ Rxc7 31. Qxc7": "Only win back material if necessary - people don't like flawless play.",
        "31... Nb8 32. Qxa5+ Kb7 33. Rc7#": "Obtain a mating position which cannot be foreseen 5 moves earlier with your last two pieces  and your work is done. Watch for falling gold coins in the table!\n\n***\n\nHope you liked my annotation, comments are welcome."
    },
    "url": "https://gameknot.com/annotation.pl/how-to-shock-the-audience?gm=31892",
    "gameName": "How to shock the audience",
    "players": "Evgenij Kalegin  vs. Sergey Yuferov ",
    "opening": "Sicilian (B52), Canal-Sokolsky attack, Bronstein gambit"
}