{
    "moves": {
        "1. e4": "The key is to offer both sides plenty of positional troubles and goals to solve, while keeping tactics alive and well. That means there should be contact and tension between the forces, and the position needs some real imbalance to it positionally. If you turn it to a tactical melee, it is not really about safety check, but about calculation and tactical skills.",
        "1... c5 2. Nf3 Nc6": "By the way, my opponent's USCF rating is close to 1800. Although this game was rather one sided, I had to make it that way. ",
        "3. d4 cxd4 4. Nxd4 g6 5. Bc4": "My opponent does not know the theory of this line, which is great for me.",
        "5... Bg7 6. c3 Nf6 7. Nxc6": "Generally, it is a mistake to play this kind of way, allowing my center to grow more powerful. However, white has a tactical idea in mind.",
        "7... bxc6 8. e5": "Now it seems that black is needing to make a tough choice, as 8...Ne4 9.Bxf7+ could lead to complications. However, black counter right back, getting the position type we discussed before.",
        "8... Nd5": "Now white pretty much has to take the d5 knight, because otherwise his idea is ruined.",
        "9. Bxd5 cxd5 10. Qxd5 Ba6": "Now white has a real problem to solve- his king. Also, the bishops are in contact with the white army, and could attack the weaknesses. White really has no tactic chances vs black. OK, black did have to sacrifice a pawn to do it, but so what? White cannot promote that extra pawn. The desciption fits the typical club player, who in this case is stronger than average. He likes material and highly values it, so subconsciously rejected ...Nd5 as being good for white, since he wins a pawn. He is willing to go through these troubles since he has the pawn. In my opinion, he is fighting a losing battle. ",
        "11. Nd2 O-O 12. Nf3 Rb8": "Black has already a completed development, while white still suffers trouble. These moves for me were made very fast, while the opponent is already half an hour used up.",
        "13. c4 Qc7": "Attack the pawn. Now white played the move he had planned on the move before, without making the safety check- Not a good idea, since I had foreseen this move, and knew it had to be bad. ",
        "14. b3": "(??) Now black is losing immediately. Is the white player weak? Some strong players may say so, but he is in the strong level if he were to play on the site, probably well in the 1900/2000 range if he takes his time, but it depends on how much time he uses, of course. The point is that white had to concentrate so hard on his positonal troubles, and failed to safety check the black ideas. This happens naturally to most club players. That is the reason for them to make these tactical blunders without being in a tactical position.",
        "14... Bb7": "Now black is winning, and the rest of the game shows the technical plan, in which black consolidates material(not much of this, since black is still far more active) and then starts a decisive attack, winning more material.",
        "15. Qd4 Bxf3 16. Bf4 Bxg2": "Really no need to consolidate, just keep attacking, since black's bishops rake the board.",
        "17. Rg1 Qa5+ 18. b4 Qxb4+ 19. Bd2 Qb7 20. f4 d6": "The white's king is in the center, so we should attack it by opening. This follows the idea of using ALL your advantages in a position.",
        "21. Qf2 Qe4+ 22. Be3": "Now black has a nice little combination to force the win through.",
        "22... Rb2 23. Qg3 Bf3": "White gave up, since he is losing another piece."
    },
    "url": "https://gameknot.com/annotation.pl/how-to-make-the-opponent-blunder?gm=45654",
    "gameName": "How to Make the Opponent Blunder",
    "players": "Opponent (????) vs. Me (2096)",
    "opening": "Sicilian (B34), accelerated fianchetto, exchange variation"
}