{
    "moves": {
        "1. e4 e5 2. Nf3 d6 3. d4": "Black chose the Philidor's  Defense. So I attack it to break it up.",
        "3... Nd7 4. Bc4 h6 5. O-O": "I'm not sure that 4. ... h6 was called for.",
        "5... a6 6. Nc3": "Another edge pawn move by black. I respond by developing more pieces.",
        "6... b5 7. Bd5 Rb8 8. Bc6": "Here I was thinking along the lines of 8. ... Bb6, 9. d5 followed by 10 Be3 attacking the rook which only has one place to go, b8, whereupon Ba7 wins the exchange. No, this isn't forced. I was only hoping for it, while at the same time I'm pinning the knight on d7 and binding black's pieces.",
        "8... exd4 9. Qxd4 Bb7 10. Qd5": "Black cleverly foiled my plans, so I just keep attacking.",
        "10... Bxc6 11. Qxc6": "Keeping up the pressure, but this was a horrible blunder and I didn't even know it (I guess if I knew it I wouldn't have played the move).",
        "11... Ne7 12. Qxa6": "This was when I realized my queen was trapped, and I was going to lose her to a lowly knight. My queen only had one safe move, 12. Qxa6. Black should now play 12. ... Nc5 leaving my queen with a7 or a5, both of which fall to 13. ... Nc6, 14. Qa3 b4 or if I play 13 Qa3 b4 leaves the queen with only a7 or a5 and again she dies to 14. ... Nf6. All I could do now was pray that black didn't see this combination, but I was sure he did because 11. Ne7 started it all so beautifully.",
        "12... b4 13. Nd5": "I couldn't believe it. b4 not only fails to finish the queen-killing combination, but now she can escape to e2 if black tries to play it. I'm off the hook! So it's time to attack! I want an open e-file.",
        "13... Nxd5 14. exd5": "Black obliges, and now I can strike at his king along the e-file.",
        "14... Be7 15. Nd4": "But first I try for the fork - I figure if black missed his knight combo to kill my queen, maybe he's a little knight-blind, so I'll give it a shot. If 15. ... 0-0? 16. Nc6 and now moving black's queen loses the exchange, 16. ... Rb6, 17 Qxb6 Pxb6 17. Nxd8 Rxd8 also loses the exchange. 16. ... Ra8, 17. Qe2 loses even more material for now black must save his queen from the knight leaving his bishop on e7 to fall.",
        "15... Rb6 16. Qe2": "Black cleverly avoided my tricks. Curses, foiled again! Apparently I need less obvious tricks. I'm still thinking Nc6 looks really fun.",
        "16... O-O 17. Nc6": "So I played it. Now black has to lose his bishop, or if he prefers, he can lose the exchange with Rxc6 - which is what I thought he would do.",
        "17... Qa8 18. Nxe7+": "Here I should have played 18. Qxe7 which threatens the knight at d7. If black moves the knight with 18. ... Nf6 I would have 19 Qxc7 Nxd5, 20. Ne7 ! which wins the exchange. This all looks better than the move I played.",
        "18... Kh8 19. Qh5": "I am looking here at some interesting combinations. If black isn't careful and makes some queen-side attack, I have 20.  Bxh6! Pxh6, 21. Qxh6  . If black refuses the bishop sacrifice, he might try 20. ... Kh7 21. B moves anywhere is discovered checkmate. or 20. ... Nf6, 21. Bxg7 ! Kxg7, 22. Nf5  Kg8, 23. Qa6 Ne8, 24 Ne7  ",
        "19... Nf6 20. Qh4": "Of course, once again, black sees through my tricks! And I thought this last try was much sneakier... My move leaves those same possibilities on the table, though with black's Nh7 to block my check, and no white bishop, I don't think it will work so well now. I'm actually hoping for 20. ... Nxd5?? which lets me get get rolling on black's king.",
        "20... Re8 21. Nf5": "Still no mate. If 21. Bxh6? Pxh6, 22. Qxh6  Nf7 and my attack peters out with a loss of material. But, I can put more pressure on h6, as played.",
        "21... Re4 22. Qg3": "Blast it, now my queen is threatened, and next my d5 pawn will fall, leaving me only a piece up. Not enough to win a K B vs. K ending. And with black fairly well developed (once he plays Qxd5) and no really viable attacks, it's looking like a long drawn out middlegame and endgame transition lies ahead. My move as played threatens mate on g7. Moving that g-pawn loses the pawn at h6, so I am expecting either Qf8 or Ne8, either of which removes an attacker from d5, allowing me to play Rd1 (yeah, it's only the illusion of defense because if black plays xd5 and I respond with Rxd5??, then black plays Re1   (so I would actually play f3 firsst, to drive away his rook and create an escape for my king)",
        "22... Qxd5 23. Qxg7#": "But, after all that, black didn't see the mate and gobbled the d5 pawn instead. This game had been lots of fun, I was a bit disappointed that it ended so abruptly."
    },
    "url": "https://gameknot.com/annotation.pl/how-to-lose-a-queen-in-14-moves-or-less?gm=20967",
    "gameName": "How to Lose a Queen in 14 Moves or Less",
    "players": "blake84120 (1414) vs. deanfromblue (1297)",
    "opening": "Philidor (C41), Hanham, Krause variation"
}