{
    "moves": {
        "1. Na3": "This is to remind me, and all of you that wishes listen to the advice, how you shouldn't play a game.\n\nThis has been my first experience playing against a player much more higher rated, by far, than me. But instead of trying get the most, I make one great mistake: I feel confident enough and don't think as I should have done.\n\nAs a result, I fell easily. Why? I knew from the beginning that it could be very hard even to get a draw but my real sin was that I didn't follow the simple principles of chess, starting by the opening.\n\nAnd now, without further delay, here is the game.\n\nFirst move, first lesson. I asked 'may I look for help in opening books? Yes, of course'.\n\nNow look at this ... Don't pay so much attention to openings, variations and all those thing. Learn first the main principles of a good opening and try to put then into the game.",
        "1... Nf6": "I thought he was going to move a queen's pawn so I made a common move with my knight and stand waiting for his next step.",
        "2. Nb1": "Here it was when he explain me the first lesson. He was just joking to relax the game. My problem was that I felt too relaxed :(",
        "2... d5": "Up till now nothing special. Two correct moves from blacks trying to gain the centre. Maybe because I'm used to playing king's pawn openings I set my target on the e4 square.",
        "3. Nf3 Bf5": "Maybe Bg4 would be better. At that moment e4 square was for blacks so the help from the lsb wasn't necessary and the bishop at g4 could have put pressure over the knight.",
        "4. h3": "I supposed that white thought the same about g4. I even thought that was good for me because, in theory, it creates a weakness in the king's pawn structure that could help me in the future if white castle short.\n\nBut, as I discovered later, that move had another meaning ...\n\n",
        "4... e6": "Supporting the d5 pawn and releasing the path for the other bishop. Just common sense in development.",
        "5. g4": "And here is the surprise ...\n\nI was doing the right moves and I couldn't understand why white was creating so many weaknesses in their pawn structure instead of developing their pieces in the centre. I thought 'great, he is too relaxed and it's my opportunity to attack. He hasn't develop their pieces and the pawn structure is damaged. If I start attacking the kind side it won't be able to support with other pieces because of the lack in development'.",
        "5... Nxg4": "I even thought that a lost in material was acceptable but I didn't realise of to important points:\n\nFirst, I hasn't completed my development yet so maybe I didn't have enough forces to strike. Even more if you keep in mind that I was going to sacrifice one piece in my supposed tactical shot. It took only two moves necessary to see that the only thing I got was to threat the knight! I could get that move to g4 at the beginning! (Of course, I thought 'what the hell you were thinking about?' but that was afterwards).\n\nSecond, It was true that the attack created a weakness in the king side. The same side where there was a rook, and a bishop, and a knight ... All of them attacked by a lonely bishop! So maybe it wasn't that weak this side at that moment.",
        "6. hxg4 Bxg4": "So what!\n\nI turn from a theoretical good position with a correct development into nothing, loosing material in only two moves.",
        "7. d4": "Then, white started their development without any serious problem to solve.",
        "7... h5": "What should I have done?\n\nCommon sense told me 'Don't get thing worse, develop the rest of your pieces, castle long and try to take at least advantage of their open files in the king side'. Maybe that could have been the best decision, I mean, make a plan and try to set it up.\n\nSo, new lesson; if something doesn't work forget about it!\n\nI have always thought that you never should play without a plan. Even more, a bad plan is always better than no plan at all. But, look out! that plan was already fail and I should have pay attention to the previous rule.\n\nInstead of that, I continued trying to get advantage of the open files advancing my pawns. Not bad, but  in return I ignore my own defence. Great mistake!\n",
        "8. Ne5": "Now white is telling me 'You only have one piece and I'll go for it'.\n\nBelieve it or not, this is the beginning of the end ...",
        "8... Bf5 9. e4": "'What did you say about common sense? A simple move and I have the path open for my queen and my bishops', was telling me white ...",
        "9... Bxe4": "Do you want this pawn? No problem, I have more to eat, and I'm hungry!",
        "10. Rxh5": "Here is when I realise how wrong I was about my plan.\n\nI can't get rid of the knight in e5 with f6 and I have no extra tempo to develop mine and force the knight's exchange.\n\nFurthermore, I have no choice but exchange rooks witch creates a big hole for the white queen.",
        "10... Bxc2": "Maybe that rook exchange would give me a chance to play a little bit more but my next move was an awful blunder.\n\nI simply thought that attacking the queen I could get time to rearrange my position. I didn't analyse the position, so I didn't see the next quite logical move for white (following a simple rule; Whenever you can, move creating a threat).",
        "11. Qf3": "Simple and effective mate threat in f7.",
        "11... Qf6": "The computer analisys shows that 11.... Bb4+ 12. Bd2 Bxd2+ 13. Kxd2 Rf8, beleave it or not I was thinking it that combination.\n\nBut at that time, I was too shocked to think clearly and I tryed to move quicly.\n\nNext rule, this is not real-time chess! If you can't think clear, stop and wait. I didn't do it so I made a new more mistake. Force to exchange queens didn't save my rook ...",
        "12. Rxh8": "No comments ...",
        "12... Bf5": "And why not? Another mistake.\n\nWith so much material lost and so many pieces threatening my king I should have exchange queens and gain tempo to castle long to keep it save.\n\nInstead of that I moved my bishop, witch hasn't anything to do for helping me, forgetting that there's another side on the board ...\n\nAt this point you can see that my queen side it's not developed, my dsb is pinned and my only two pieces are both in the king side with no chance to move fast to the other side of the board. On the other hand, White's queen side isn't either developed but they can easily send their bishops and queen to the queen side and prepare an attack.",
        "13. Qb3": "And that's what they did ...",
        "13... Qe7": "That last move was my last blunder.\n\nThe b7 pawn is under threat and after that there's no way to protect the second rook.",
        "14. Qxb7": "Black has nothing to do so I resign.\n\nI would probably had lost this game at last but not in fourteen moves.\n\nWhen I see the moves played I realise that they are that simple that is hard to understand why I couldn't seen them.\n\nI also realise that, there's no point in learning openings or tactical shots or whatever, if you don't follow the main rules of chess you'll fail.\n\nHope these comments help someone as it helps me to write them."
    },
    "url": "https://gameknot.com/annotation.pl/how-you-shouldnt-play-chess?gm=41168",
    "gameName": "How you shouldn't play chess",
    "players": "easy19 (2258) vs. marvin2 (1582)",
    "opening": "Durkin's attack (A00)"
}