{
    "moves": {
        "1. e4 e5 2. Nf3 d6": "The makings of the Philidor Defense...",
        "3. d4": "The modern way, to handle this... What usually follows, is 3. ... exd4 4. Nxd4 Nf6 5. Nc3/Bd3... All very calm development...",
        "3... Bg4": "Too agressive, at this stage...",
        "4. dxe5": "White loses no time, after 4. ... dxe5 5. Qxd8+ Kxd8 6. Nxe5 Be6, white is already better...",
        "4... Bxf3": "To keep things under control, black had better played Nd7... Never exchange, when behind in development...",
        "5. gxf3": "In a normal paced game, I would normally have chosen 5. Qxf3 dxe5 6. Qb3 b6 7. Bc4 (Nc3, c6) Qf6 8. Nc3 Bc5 (c6, Bg5!, Qxg5?, Bxf7+, ..., Bxg8) 9. Rf1 Ne7 (c6?, f4!) 10. Nb5 Bd6 11. Bd2, with a very solid game, after 0-0, 0-0-0... But I figured a quick devastation coming up, considering black's play...",
        "5... dxe5 6. Qxd8+ Kxd8 7. Nc3 Bb4": "Had black known what was coming up, he would have played 7. ... Nd7, again...",
        "8. Bd2": "I see no real point in 8. Bg5+ f6 9. 0-0-0+ Ke8 10. Nd5 Ba5 11. Bd2 Bb6... This is quicker, was my guess...",
        "8... Bxc3": "Like clockwork!!! Of course black should have played 8. ... Nf6, plus a swift Nbd7... Now things are getting out of hand quickly... Black has no development left, apart from 1 pawn...",
        "9. Bxc3 f6": "Practically forced, after 9. ... Nd7 (a little late, now) 10. Rg1 g6 11. f4 Ngf6 (f6, 0-0-0!) 12. Bg2 Nh5/Ke7 13. fxe5... After 9. ... Nc6 10. Rg1 Ke7 (Rd1 threatens) 11. Rxg7 Nf6 12. Bc4! Raf8, and of course 13. 0-0-0... ",
        "10. O-O-O+": "There we have it... Black's only option, in order not to lose straight away, is 10. ... Ke7 11. Rg1 g6 (forced: g5, f4!) 12. Bb4+ Ke8 (Ke6?, Bc4 mate) 13. Bb5+ c6 (Nc6 ruins black's position) 14. Bc4 a5 15. Bc5 b5 16. Be6, and white reigns the board... And all of black's pieces - apart from pawns - in their original position...\n\nAfter 10. ... Ke8 11. f4! Nc6/Nd7 (exf4, Rg1 etc.) 12. Rg1 (or fxe5, fxe5, Rg1) g6 13. fxe5 fxe5 14. Bh3! Ngf6 15. f4!! White gets to play f4 two times...",
        "10... Nd7": "Considering the odds, a brave decision... After 10. ... Kc8 (the other option) 11. Bh3+ Nd7...",
        "11. Bh3": "Now it all depends on, how black loses his piece... There are still fighting chances, in this blitz game... To keep from further damage, black should try 11. ... f5! 12. Bxf5 Ngf6 13. Rxd7+ Nxd7 14. Rd1 Ke8, and let Rxd7 come as may... This is still blitz, never resign...",
        "11... Nh6": "Black loses track, now it is over...",
        "12. Rxd7+": "Now, blacks King is trapped in the center, while he could have been at e8... After 12. Bxd7+, Ke7...",
        "12... Ke8": "After 12. ... Kc8 13. Rg1!, our nice killer rook...",
        "13. Rxg7": "There a lots of ways to win this, e.g. 13. Bb4!, which threatens Re7+, plus a raging windmill along the seventh row, after Kf8 (Kd8?, Rd1 mate)... But I chose the prozaic way... This binds Rh8, and Nh6 is dead... Best is Nf7, Rhg1... Brrrr...",
        "13... Rd8 14. Rxc7": "Right... Who's next?",
        "14... Rg8": "Buckling for the threat Rg1... 15. Be6 finishes all, but why bother...",
        "15. Rxb7": "Black is in forcings, white can play, what ever he fancies, e.g. 15. Rxh7 Nf7 (forced) 16. Be6...",
        "15... Nf7": "Best is 15. ... f5 16. Rxa7 Rd7 (else Rxh7) 17. Rxd7 Kxd7 18. Bxe5... This closes the deal...\n",
        "16. Be6": "Black resigns, after 16. ... Nd6 17. Rxh7 Kf8 18. Rd1! Rg7 19. Rxg7 Kxg7 20. Ba5! it is done..."
    },
    "url": "https://gameknot.com/annotation.pl/how-not-to-play-the-philidor?gm=45147",
    "gameName": "How not to play the Philidor",
    "players": "vonbonkagain (1200) vs. John Doe (1750)",
    "opening": "Philidor's defence (C41)"
}