{
    "moves": {
        "1. c4": "English opening...has a bit of reputation of being a relatively dull opening...this is mainly due(i think) to the little bit of patience needed to build up and is not as hairy as Sicilians....!!",
        "1... e5 2. g3 Nf6 3. Bg2 Bc5 4. Nc3 O-O 5. e3": "..standard development so far. White is threatening d4 and build up pressure on the Q side. Black will usually counter the finachetto of an English with c6, Be6 and Qd7 to create a weakness on the K side. This is typically followed by f5 and further attacks. White typically needs to eliminate the Nf6...",
        "5... d6 6. Nge2": "..preparing 0-0 and d4",
        "6... c6 7. O-O Bg4 8. Qb3": "..releasing the pin and threatening to win material. Best way to force lines.",
        "8... Qe7": "..i though Qd7 was better, but the Knight needs to centralise- Na6-c7 might be an option to support a d5 push...?",
        "9. d4 exd4 10. Nxd4 Bxd4 11. exd4": "...need to link the rooks so to find a home for the dark square bishop...",
        "11... b6 12. Be3": "..with the Bg4, i do not have to worry for now about the Nf6. Rae1 to follow with indirect threats to the Q...",
        "12... Bd7 13. Rae1 Qd8 14. Nb5": "..tempt the winning of excahnge by cb followed by Bxa8. Also threatening to win  the pawn on d6",
        "14... d5 15. Nc3 dxc4 16. Qxc4 b5 17. Qd3 a5": "...similar principal to 14. to follow",
        "18. Nxb5 Na6 19. Nc3": "..pawn up....",
        "19... Nb4 20. Qd2 Bf5": "..spotting blacks little attack..i see the c6 pawn as hanging. a3 will misplace the knight.",
        "21. Rec1 Nbd5 22. Bg5": "..preventing Ne4 where black is trying to get my white square bishop !!",
        "22... Qd6 23. Nxd5": "..some mini traps here...with the long diagonal very strong...",
        "23... Be4": "...bad mistake from black....white is now material up. I spotted a continuation where i give the piece back, but end the exchange up of rook for Queen...and it start with....",
        "24. Nxf6+": "..the move black may have missed..an intermediate. I now have the c6 pawn in sight with a position collapse for black in mind...",
        "24... gxf6 25. Bxe4 fxg5": "...giving the piece back but now the Queen is in trouble and whites attack is quick.",
        "26. Rxc6 Qe7 27. Re1": "..forcing the queen away as Bxh7  wins the queen.",
        "27... Qb4": "..so now to the combination. I saw that the Queen has only check and a forced exchange down to stay in the game. So...first\r\n",
        "28. Qxg5+": "..the obvious...",
        "28... Kh8": "..forced...",
        "29. Qf5": "..now threatening mate so black is forced into the following 2 moves and i'm well up in material, and position is won..",
        "29... Qxe1+ 30. Kg2": "...safe as houses...",
        "30... Qxe4+ 31. Qxe4 f5 32. Qe5+ Kg8 33. Rc7": "...last gasp....but combination is still forced....white wins with a forcing of material off the board and left with a very active queen to mop up..",
        "33... Rf7 34. Rxf7 Kxf7 35. Qd5+ Kf6": "..black resigns..."
    },
    "url": "https://gameknot.com/annotation.pl/howdy-doody?gm=9768",
    "gameName": "Howdy Doody...",
    "players": "shambobala (1617) vs. artokokko (1556)",
    "opening": "English opening (A20)"
}