{
    "moves": {
        "1. d4 Nf6 2. c4 c5 3. d5": "So we go into the Benoni structures, most common here are the Benko Gambit 3...b5 and the Modern Benoni 3....e6.",
        "3... e5": "But she plays this, the Czech Benoni, just like she did the last time we played. http://gameknot.com/annotation.pl/hoylakevpen-y-ffordd?gm=38310",
        "4. Nc3": "I continue as I did last time.",
        "4... d6": "And she also.",
        "5. e4 Be7": "This is still as previous game.",
        "6. Nge2": "But this is different. Last time I played g3.",
        "6... Bg4": "This seems a complete waste of time to me.",
        "7. f3": "So I naturally block it.",
        "7... Bd7": "And the Bishop drops back.",
        "8. Ng3": "So continue with a plan I already had.",
        "8... Na6": "She develops.",
        "9. Nf5": "This may be premature - my computer likes Qb3 instead.",
        "9... Bxf5": "She takes.",
        "10. exf5": "I take back",
        "10... Nc7": "And she continues with her plan of b7-b5.",
        "11. Bd3": "I develop.",
        "11... a6": "Looking at playing b7-b5 again. ",
        "12. a4": "So I decide to clamp down on the queen side.",
        "12... Rb8": "Again, planning b7-b5",
        "13. a5": "Clamping down further on the queen side.",
        "13... h6": "I thought this was a waste of time too, and rather giving me a target. I couldn't have played 14. Bg5 anyway, because of Nf6xd5! winning a pawn.",
        "14. Be3": "Developing, but with an eye on that h6 pawn and also maybe playing b2-b4 and having the Be3 eye c5 and b6. ",
        "14... Na8": "I'm not sure why she played this.",
        "15. O-O": "Castling on the queen side is rather silly, given the lack of pawn cover there. I could have kept my king in the centre, but I definitely wanted to connect rooks, with the possibilities of the queen side opening up. Instead I did consider b2-b4 here, with the idea that if she took, Qa4ch won the pawn back, but it is not clear.",
        "15... O-O": "I was very pleased she followed suit!",
        "16. Qd2": "So I aim at h6.",
        "16... Nc7": "The knight comes back into play. I did consider sacrificing on h6 immediately, but instead decided to prepare more for it. My computer likes Rf-e1 here.",
        "17. g4": "Now the computer likes b7-b5 for her.",
        "17... Nce8": "But she retreats the knight.",
        "18. Bxh6": "I took - I thought this was winning. Computer doesn't go for it though!",
        "18... gxh6": "So she takes, otherwise she is just a pawn down.",
        "19. Qxh6": "And I take back.",
        "19... e4": "This is a great defensive move, which I hadn't considered! Otherwise g5 and f6 just wins for white.",
        "20. fxe4": "This is a mistake. My computer suggests just leaving this pawn and playing Bc2. I think just taking with the knight or bishop is better than what I played. I didn't realise I was putting my g pawn en prise.",
        "20... Nxg4": "And now she is back in the game!",
        "21. Qf4": "So I retreat and hit the knight.",
        "21... Ne5": "This is a wonderful square for the knight!",
        "22. Qg3+": "I throw in a check.",
        "22... Kh8": "King moves, threatening Rg8.",
        "23. Qh3+": "So I throw in another check.",
        "23... Kg8": "Is she offering a draw here? Objectively white is losing and should take the draw now, but she was short on time.",
        "24. Kh1": "Putting my king to a better square and vacating g1 for a rook.",
        "24... Nxd3": "This is a big mistake, giving up her powerful knight.",
        "25. Rfg1+": "I correcty throw in a check.",
        "25... Ng7": "Pretty much forced.",
        "26. Qxd3": "And now I take back.",
        "26... Bf6": "And now she exploits my weak dark squares in the centre.",
        "27. Raf1": "This can't be a bad move, getting this rook into action. However as I soon double on the g file, it turns out to be a crucial waste of a move. I had dreams of playing e4-e5 and Nc3-e4 and f5-f6, supported by rook and knight...",
        "27... Re8": "She gets her rook to a more active post.",
        "28. Rg4": "Giving support to e4 and preparing to double on the g file.",
        "28... Kf8": "She breaks the pin on the g file.",
        "29. Rfg1": "I played this to prevent Ke7 - if she does that move now, she loses two pieces for the rook.",
        "29... Nh5": "Presumably to prepare Ke7.",
        "30. Qh3": "So I hit the knight, and once again I thought I was winning. G7 seems the only square for her knight and then Qh6 seems very strong. I missed her simple defence!",
        "30... Bxc3": "She throws in this, to create a flight square for her knight. The computer now comes up with what seems to be an extraordinary winning line for white! I should have played 31. bxc3 Nf6 is forced if she doesn't want to lose the knight. Then I have 32. Rg6!! and if she takes on g6, she is mated - see this puzzle http://gameknot.com/chess-puzzle.pl?pz=161075\nOr if she takes on e4 with her knight she also runs into a pretty mate.\nhttp://gameknot.com/chess-puzzle.pl?pz=161076",
        "31. Rg4g8+": "But I played this instead",
        "31... Ke7": "Forced!",
        "32. Rxe8+": "So I take, hoping for king takes, allowing Rg8 winning.",
        "32... Qxe8": "But she doesn't fall for that!",
        "33. Qxc3": "So I take the bishop finally.",
        "33... Kd7": "She discovers an attack on e4",
        "34. Re1": "So I protect e4. Qe5 wins easily for her now, but she was running short of time.",
        "34... Nf4": "This mistake costs her the win.",
        "35. Qf3": "The knight will be lost.",
        "35... Qe5": "She protects it.",
        "36. Rf1": "I attack it again.",
        "36... Nxd5": "So she ends the game, in the same way I started the fire-works - by sacrificing a monor piece for two pawns.",
        "37. exd5": "I take the knight and offer a draw, which she accepts. Material is even, after she takes the pawn on b2, but I think she has a slight due to my weak queen side pawns.\nMany thanks for reading dear reader. Please leave a comment and rate this annotation on the star system. Until next time dear reader!"
    },
    "url": "https://gameknot.com/annotation.pl/hoylake-2-v-malpas-1-wirral-chess-league?gm=60359",
    "gameName": "Hoylake 2 v Malpas 1 Wirral Chess League",
    "players": "Charles L Higgie (ECF177) vs. Helena Griffiths (ECF146)",
    "opening": "Czech Benoni (A56), King's Indian system"
}