{
    "moves": {
        "1. d4": "So she plays into the Indian systems",
        "1... Nf6 2. c4": "I reply with my usual",
        "2... c5": "She takes us into the Benoni systems",
        "3. d5": "I carry on with the main line",
        "3... e5": "and now it is a Czech Benoni",
        "4. Nc3": "I continue to develop",
        "4... d6": "This is still pretty standard",
        "5. e4 Be7": "She continues the normal development.",
        "6. g3": "Other moves are available instead of 6. g3, but I already had the plan of advancing f2-f4 and being able to recapture on f4 with a pawn.",
        "6... O-O": "She continues to develop.",
        "7. Bg2": "as I do too",
        "7... Nbd7 8. Nge2": "I didn't want to block f2-f4 by putting my knight on f3. I did consider the immediiate f2-f4 but I didn't like the look of her exchanging on f4 and then moving her Nf6 and playing Be7-h4 check.",
        "8... a6": "This is a usual move in this system.",
        "9. f4": "This may be premature. 0-0 first is probably better.",
        "9... exf4": "So she takes.",
        "10. gxf4": "I didn't want to give her a lovely e5 square for her knights, which she would have got if I had recaptured any other way on f4.",
        "10... Nb6": "I was happy to face this move. Now her b7-b5 advance is hindered.",
        "11. Qd3": "I have to defend c4 of course, and I felt this was the best way to do that.",
        "11... Ng4": "So she opens up a diagonal for her bishop.",
        "12. Ng3": "I decide to block the diagonal. 0-0 was better.",
        "12... Bh4": "and she pins my knight on g3.",
        "13. Bd2": "So I open the option of queen side castling. 0-0 may have been better.",
        "13... Bd7": "and she develops again. f5 was probably better.",
        "14. h3": "and this is a definite mistake. Of course 0-0-0 allows a family fork with Ng4-f2 so I decide to chase the knight away first. The problem is that it drops a pawn! Ok find Black's next move!",
        "14... Nf6": "The knight simply retreats. The white queen is over-worked, protecting both c4 and Ng3, so I decide to protect the c4 pawn. Find Black's next move!",
        "15. b3 Nh5": "Oops! I hadn't seen that move. Find White's next move.",
        "16. Nce2": "yes, it is pretty well forced, the only way to protect the Ng3. Find black's best move.",
        "16... Nc8": "Thankfully she didn't see it! She could have played Bxg3, 17. Nxg3 Qh4 and now 18. Kf2 is the only way to protect the knight on g3 and she has either Nxf4 or f5 with advantage.",
        "17. O-O": "So I quickly try to rectify passed mistakes!",
        "17... Nxg3": "After moving my king, my knight on g3 was no longer pinned, so she had to exchange it.",
        "18. Nxg3": "and I had to recapture.",
        "18... b5": "So she does the thematic b7-b5 advance, although with the white king on the king side I am not sure it is best, maybe improving the position of her Nc8 or Qd8 was better. Find the best move for white.",
        "19. e5": "Did you get that? White is slightly better now.",
        "19... b4": "Black prevents Bc3, and my bishop has a lovely long dark diagonal. What is best now for white?",
        "20. Nf5": "Well done if you got that! I decided to grab the two bishops. A point also for a3 opening up another front.",
        "20... Bxf5": "So she exchanges.",
        "21. Qxf5": "and I recapture.",
        "21... g6": "She hits my queen. So which is the right square for it?",
        "22. Qg4": "This is best, stays near her king and prevents Ne7. ",
        "22... h5": "So she hits the queen again. Where now?",
        "23. Qf3": "I wanted to be able to move to d3, but a point for moving it to e2 too.",
        "23... Ne7": "Her knight is becoming active. What now?",
        "24. Qd3": "A point also for a3 opening up another front.",
        "24... Ra7": "Black hopes to be able to defend along the second rank and also takes her rook off the long white diagonal, and any potential attack from my Bg2. What now?",
        "25. Be4": "Well done if you found that. White is building up against the black king side. Nothing for anything else.",
        "25... Qd7": "Black finally mobilises her queen. What now?",
        "26. Kh2": "I wanted to use the open g file, and also to protect the h pawn. A point for f5 too, which is also strong.",
        "26... a5": "Black probably should have closed up the king side with f7-f5. What now?",
        "27. Rf3": "I wanted to play Rg1, but then saw that she had Bf2 and then her bishop gets to d4 and is very powerful, so I thought of playing the other rook over instead, and not allow this chance. A point also for f5.",
        "27... a4": "So she continues her queen side operations. What now?",
        "28. Rg1": "Of course! A point also for f5.",
        "28... axb3": "So she takes. What now?",
        "29. e6": "This is the move I had been planning for the last few moves. A point also for the simple axb3.",
        "29... Qe8": "She should have tried f7xe6. What now?",
        "30. exf7+": "Nothing for anything else.",
        "30... Qxf7": "What now?",
        "31. Bxg6": "Nothing for anything else.",
        "31... Nxg6": "What now?",
        "32. Rxg6+": "Nothing for anything else. White needs to recapture and it is silly to allow the exchange of queens with the Black king exposed. What should black play now?",
        "32... Kh8": "Yes, the king has to go here, as Kh7 loses the black queen to Rf6 check. What now?",
        "33. axb3": "I simply recapture. A point for Rh6 check too. What is best for Black now?",
        "33... Qf5": "Yes, she has to exchange my powerful queen. What is best for white now?",
        "34. Rxd6": "Might as well pick up a pawn. Nothing for anything else.",
        "34... Qxd3": "So she exchanges.",
        "35. Rxd3": "I recapture.",
        "35... Ra2": "What now for White?",
        "36. Kg1": "Black was threatening both Be1 and Rxf4 so a king move was forced. This is far better than Kh1, I need to mobilise my king, so nothing for anything else.",
        "36... Ra1+": "She checks.",
        "37. Kg2": "I move my king towards the centre, or, as Americans would say, towards the center.",
        "37... Rg8+": "Another spite check.",
        "38. Kf3": "I continue with my policy of an active king.",
        "38... Rf1+": "Another check",
        "39. Ke4": "More centralisation.",
        "39... Re8+": "Another check",
        "40. Re6": "and now black resigns. Please rate my annotation and leave a comment. Many thanks for reading this."
    },
    "url": "https://gameknot.com/annotation.pl/hoylakevpen-y-ffordd?gm=38310",
    "gameName": "HoylakevPen-y-ffordd",
    "players": "CharlesHiggie  vs. Helena Griffiths (BCF133)",
    "opening": "Czech Benoni (A56), King's Indian system"
}