{
    "moves": {
        "1. e4 c6": "Caro-Kann defence (B10)",
        "2. Nf3 d5 3. exd5 cxd5 4. d4 Nc6 5. Nc3 Bg4 6. Be2 e6 7. h3": "Everything up to here has been fairly standard. I attack the bishop to relieve the pin.",
        "7... Bxf3 8. Bxf3 Qb6 9. Ne2": "I move the knight to protect d4 and to free up the pawn on c3.",
        "9... Nf6 10. c3 Bd6 11. Bg5": "I hastily attack the f6 knight and hang my b2 pawn.",
        "11... Qxb2 12. Bxf6 gxf6": "but gain a doubled pawn for black and an opened king side.",
        "13. O-O O-O-O": "It seems the doubled pawn has swayed black to castle queen side.",
        "14. Qa4": "I move my queen to prevent the knight from heading to c4 via a5",
        "14... Qd2": "Not sure where blacks queen is going.",
        "15. Rfd1": "I attack the queen to get it out of my camp.",
        "15... Qg5 16. Rab1": "planning on doubling up my rooks on the b file to attack b7.",
        "16... Rd7 17. Ng3": "I move the knight to block the g file and to free up my bishop for a path to a6 via e2.",
        "17... Bxg3 18. fxg3 Qxg3": "but I overlooked another pawn capture.",
        "19. Rd2 Qf4 20. Rdb2": "my rooks now doubled up.",
        "20... Qe3+ 21. Kh2 Qxc3": "I lose another pawn.",
        "22. Rc2": "I attack the queen and pin the knight.",
        "22... Qd3 23. Rd1": "I attack again just to push the queen to a less desirable spot.",
        "23... Qxd1": "And to my surprise the queen took the rook?? Had the queen retreated to say g6, I don't think I could have won more than a pawn and the rook on h8 which doesn't seem to justify the queen sacrifice. ",
        "24. Bxd1 Rc7 25. Be2 e5 26. Bb5 Nxd4 27. Bd7+": "I check with the bishop making use of the rook pin.",
        "27... Kd8 28. Rxc7 Kxc7 29. Be8": "Attempting to win a pawn",
        "29... Nc6 30. Bxc6": "I decide instead to further reduce the minor pieces between us for an easier endgame.",
        "30... bxc6 31. Qxa7+": "And the rest is a fairly easy win for white.",
        "31... Kd6 32. Qxf7 Kc5 33. Qxf6 Re8 34. Qf7 Rh8 35. a4 Kb6 36. Qg7 Ra8 37. Qxe5 Rxa4 38. Qb2+ Ka6 39. Qb8 Rc4 40. Qc7 h5 41. Qe5 h4 42. g3 hxg3+ 43. Kxg3 Re4 44. Qd6 Kb5 45. h4 Re3+ 46. Kg4 Re4+ 47. Kg5 Re1 48. h5 Rg1+ 49. Kf6 Rh1 50. Kg6 Rg1+ 51. Kf7 Rf1+ 52. Ke7 Ra1 53. h6 Ra7+ 54. Kf8 Ra8+ 55. Kg7 Ra7+ 56. Kg6 Ra1 57. h7 Ra8 58. Qf6 c5 59. h8=Q Rxh8 60. Qxh8 d4 61. Qb8+ Kc4 62. Kf5 Kd5 63. Qb7+ Kc4 64. Ke4 Kc3 65. Qb1 Kc4 66. Qc2+ Kb5 67. Kd5 Ka6 68. Kxc5 Ka7 69. Kxd4 Kb6 70. Qc5+ Kb7 71. Kd5 Kb8 72. Kd6 Ka8 73. Qb5 Ka7 74. Kc7 Ka8 75. Qa5#": "2nd win to date as white against the GK intermediate (~1600) level computer. Thanks for watching. :)"
    },
    "url": "https://gameknot.com/annotation.pl/http-gameknot-com-chess-computer-pl?gm=52231",
    "gameName": "http://gameknot.com/chess-computer.pl",
    "players": "porygon (1600) vs. Computer (Intermediate level) (1600)",
    "opening": "Caro-Kann defence (B10)"
}