{
    "moves": {
        "1. e4 e5 2. d4": "An oddly regular move played by Excalibur. It has a tendency to remove central pawns as quickly as possible.",
        "2... exd4 3. Qxd4 b6": "I have practiced heavily against this move. I like the opening because the queen can be easily forced away.",
        "4. Qe5+": "Excalibur usually plays 4.Nc3... so this was a surprise. White decides on pushing the queen ahead. 4...Ne7 is forced since 4...Be7? leads to 5.Qxg7... +/-  and 4...Qe7 allows 5.Qxc7... +/-",
        "4... Ne7 5. Bb5": "White's play is active, and pressurises my own development. However, with calm moves, I can react sufficiently.",
        "5... f6": "At the price of kingside security, I can develop the e7-knight to g6 should White's queen play 6.Qh5+...",
        "6. Qc3 Nbc6 7. Ne2 Bb7": "White's knight is clearly aiming at d4 and f4. Therefore, I must find a way to counter him on these squares. Also, one deficiency in my setup is the open nature of my kingside. Hence, I will be castling queenside.",
        "8. O-O": "White joins a rook into the attack.",
        "8... Ng6": "Solidifying on e5, and pressuring on f4. A bishop on e5 will soon happen.",
        "9. Bxc6 Bxc6": "White now has the option to dominate the centre with his knights. However, 10...Bc5 still looms, and if 11.Nxc6... then 11...dxc6 gives me strong control over the d-file. ",
        "10. Nd2": "White seeks to improve his centre. c4 is now under threat, and e4 is defended well. b3 is also a possible target for the d2-knight, meaning 10...Bc5is early. However, 11.Nb3... is met with 11...Qe7 - threatening the e4-pawn. This means both sides are somewhat static.",
        "10... Bc5 11. b4 Bd6": "My central pawns are hindered, but I can now assault the advanced pawn.",
        "12. Nd4": "This is an important move.\nV1 12...Be5 13.Nxc6 Bxc3 14.Nxd8 Bxd1 -/+\nV2 12...Be5 13.f4 Nxf4 14.Nxc6 Ne2+ 15.Kh1(Kf2) Nxc3 =\nHere, I can neutralise my backward position and remove vital enemy pieces.",
        "12... Be5 13. a4": "White appears ready to push the queenside. b5 is impending.",
        "13... Qe7": "With White's best piece tied down, I now start to develop. White can threaten with Ba3, but I can compensate soon with my rooks.",
        "14. b5 Bb7": "The e4-pawn is still threatened.",
        "15. Ba3": "White moves in with tempo. The position favours White, but is still playable. Nevertheless, I will have the exchange pieces to regain position.",
        "15... Bxd4 16. Qxd4 Qe5": "Both queens are on as strong squares as possible.",
        "17. Qxe5+": "18.Nf3... was an option because 18...Qxe4? was counterable with 19.Rfe1... +/-",
        "17... Nxe5": "My main goal now is to render the a3-bishop weak. This can be achieved efficiently by placing a pawn on c5.",
        "18. f4": "I predicted this. White seizes central occupation. My knight is forced back. However, I can still attack from my own half.",
        "18... Ng6 19. f5": "(?!) White's f-pawn was perfectly strong where it was, forcing my knight to manoeuvre around the back rank (e.g. Ng6-e7-g8-h6-f7-d6) The advance seems premature, but not negative. Also, it does allow the f1-rook to pursue other uses.",
        "19... Ne5 20. Kf2 c5": "Now I have attempted to bar any threat of a central imposing bishop. If 21.Bb2... then an exchange on e5 wouldn't be the worst, because my rooks would soon attack the centre.",
        "21. h3": "(?!) White defends the g4-square from my knight. However, it's still odd considering more pressing matters, such as the repositioning of the a3-bishop, or rook placement.",
        "21... d5": "My backwards pawn becomes useful 21...0-0-0 was an option, but 23.c4... would have locked the game.",
        "22. c3": "Wisely, White prevents a d4 advance. Also, 22...dxe4 would be short lived after a rook on e1 which would concrete White's centre.",
        "22... O-O-O 23. exd5 Bxd5": "I am now dominating the centre.",
        "24. g3 Rhe8 25. Rfb1": "White's king can now be cut off from his pieces - a positional and tactical advantage.",
        "25... Nd3+ 26. Kf1 Re3": "Although this is at first a material threat, I can continue it into something more useful.",
        "27. g4 Rde8 28. c4 Bb7": "The a8-h1 diagonal is crucial to success, after Re3-Rxh3-Rh1#",
        "29. h4 Rh3": "My e8-rook cuts the king off, and the second rank is controlled by my minor pieces. White is faltering.",
        "30. Ne4": "(!) Although this move is desperate, I find interest in it. The knight has found the only square that blocks both the path of the b7-bishop and that of the e8-rook. When one piece captures it, it blocks the other. ",
        "30... Rxe4": "More crucial than 31...Bxe4 which would allow the king to run. Now White is trapped. Note how his previous advances with pawns on the kingside render defence a distant memory.",
        "31. Bxc5": "More desperation. If 33...Rh1+ 34.Kg2 Rxg4#. If 33.Bg1... temporarily stagnates the position.",
        "31... bxc5": "If 33.Ra2... then 33...Rh1+ 34.Kg2 Rxg4#\nIf 33.Kg2... then 33...Ree3+ 34.Kg1(Kf1) Rh1#",
        "32. Kg2 Ree3+ 33. Kf1 Rh1#": "In conclusion, we see how White - in a dominant position - failed to hold the centre properly (partly by wasting flank moves) This allowed me to take control, and then cut off White's king after the poor 25.Rfb1..."
    },
    "url": "https://gameknot.com/annotation.pl/human-v-computer-game-4?gm=55606",
    "gameName": "Human V Computer Game 4",
    "players": "Excalibur(Level70) (???) vs. Honza88888 (1534)",
    "opening": "Centre game (C21)"
}