{
    "moves": {
        "1. d4": "The first game in a series where I play to see if I can combat computers such as these.",
        "1... d5 2. c4": "I chose the Queen's gambit becuase computers tend to play classical positions very strongly. I wanted to test myself, so this seemed a logical choice.",
        "2... e6": "Black rightly so, denies the acceptance of the gambit.",
        "3. Nc3 Nf6 4. Bg5 Nbd7 5. e3 c6 6. Nf3 Bb4": "A classical opening has been played - with chances for both sides. An evaluation suggests how Black's knights are hemmed in, but he compensates for this by having central influence, and pressure on e4 which is amplified by the tying-down of my c3-knight. On the other hand, I have more active pieces than Black.",
        "7. c5": "Black's d7-knight is limited and suffering, and the b4-bishop has had its immediate escape route cut off. Furthermore, the d6-square is now a major weakness for Black. ",
        "7... O-O 8. Bd3": "The newly installed d3-bishop attacks the h7-pawn, weak due to the pin placed upon the f6-knight. Also, I can now castle kingside.",
        "8... h6": "Black reacts and regains some composure.",
        "9. Bf4": "The back-step might appear disadvantageous, but the d6-square has now become -  not just a square - but a valuable outpost. Another bonus by the step-back is the increased pressure on e5.",
        "9... Ne4": "Black prevents any effectiveness of my d3-bishop - essentially forcing the exchange.",
        "10. Qc2": "The h7-square is still the main threat, and e4 is starting to buckle. Either the centre falls, or the kingside weakens.",
        "10... Qa5": "Black gracefully develops. His threat of plundering c3 not only pressures me to swap off in the centre, but the battery on the a5-e1 diagonal still poses problems.",
        "11. Bxe4 dxe4": "I still think I have made progress after the swap on d4. His new e4-pawn is doubled, and in its wake are the weak d6 and e5-squares.",
        "12. Ne5 Nxe5 13. Bxe5 f6": "Black tries to repair at least some of the weaknesses in his half. If my bishop moves to d6, it should eventually be threatened by a b6-square pawn.",
        "14. Bd6": "At least I can manipulate Black's rook.",
        "14... Bxc3+": "Black counters the problem of doubled pawns by creating them on my side as well. However, it's crucial to see how the Black queen's power is now limited by my pawn structure, leaving her isolated.",
        "15. bxc3 Rf7": "Whilst the e4-pawn would be a strong asset to remove, it is necessary to safeguard the c3-pawn immediately.",
        "16. O-O": "c3 is now deemed useless. Both e4 and c3 could disappear to remove doubled pawns, and both sides would gain position.",
        "16... f5": "An evaluation shows how Black's dark-squared bishop isn't on the board, meaning the b8-h2 diagonal is under my control. This includes the d6 and e5-squares - meaning that Black has trouble manoeuvering effectively. Also, the fact that Black has now instituted two pawns on the c8-h3 diagonal means that Black's dark-squared bishop is useless. Even if Black could free the a6-square for the stricken bishop, It only aims at a pawn chain consisting of four pawns.\n In terms of movement, Black could have played 16...b6, but would result in (17.cxb6 axb6 18.Bb4 [else Qxe4] 18...Qf5 19.f3 exf3 20.Qxf5 exf5 +/-) leaving doubled pawns for Black.",
        "17. Rfd1": "I am preparing to push on d5.",
        "17... Bd7": "The only purpose of this move is to mobilise the a8-rook.",
        "18. c4": "I have decided that by doubled pawns have a role to play after all - before they are swapped off! Notice the isolation of the queen. 18...Qd8 would be passive and cut the a8-rook out, since the a,b and c-files don't really play a 'crucial' role.",
        "18... a6": "? I see this as an error - purely from a positional perspective. The b6-square is undefendable by Black, helped by his abscence of a dark-squared bishop. One of the queen's 'fall-back' squares is now occupied.",
        "19. Rab1": "The time for Black to run is now or never. There is an escape path for Black to d8. the only other safe square is a3 - and it is temporary.",
        "19... Be8": "? Black squanders his chance. The only benefit I see is that after the f7-rook moves, the bishop can move to h5 and dominate the d1-h5 diagonal. Still, no compensation for a trapped queen. Furthermore, the bishop can't liberat the queen, since it can only move upon light-squares, and these are blocked by his own pawns.",
        "20. Rb6 g6 21. Rdb1": "Note the lack of escape squares.",
        "21... Rd8 22. Kf1": "I'm planning 23.Qc1... and then 24.Rb3... forcing the capture on a2. The king defends e2 when in the future, no piece will cover it.",
        "22... Rdd7": "As many computers do, when a position is hopeless, the pieces move aimlessly about. Black can hold off 23.R1b4... with 23...Qa3 (providing a a safe sqaure on e3), and 23.R1b3... leads to 23...Qa4 24.a3 a5)with a glimmer remaning.",
        "23. Qc1": "The a3-square is gone. A capture on a2 by the Black queen would lead to 24.Ra1... +/-",
        "23... Rfh7": "The a2-pawn remains poisoned.",
        "24. Rb1b3 Rd8 25. Be5": "I have enough time to delay the trapping of the queen, so I control e5-h8 at the price of an extra pawn on a2 which is quite frankly useless.",
        "25... Qxa2 26. Ra3 Qxa3 27. Qxa3": "The position is still closes, but I can easily infiltrate.",
        "27... Rdd7": "My aim is to move the queen to the kingside and infiltrate e6. Nonetheless, the a6-pawn is a silent threat that must be watched.",
        "28. Qa2 Rdf7 29. d5 Rfd7 30. Bd6": "We can now see the appearance of a wekaness on the a1-h8 diagonal which is perfect for my queen to use. Also, Black has a pseudo-active King with nothing to control, and his two rooks' only aim is to hold together the ragged frame of his position.",
        "30... exd5 31. cxd5 Bf7 32. Qb2": "The development of Black's bishop isn't as important as improved position for myself.",
        "32... Bxd5 33. Qf6": "The checkmate threat on f8 appears.",
        "33... Bf7": "This essential move disrupts the correspondence of the rooks, and the d7-rook is unable to move without loss.",
        "34. Rb4 Rg7 35. Rd4 Bb3 36. Be5": "This tricks Black into deflecting the d7-rook from the aid of his comrade.",
        "36... Bd5 37. Bd6 Bb3 38. Qf8+ Kh7 39. Be5": "Note the malleability of Black's pieces under my influence!",
        "39... Rdf7 40. Qd8": "Black's defence is robust but temporary.",
        "40... Rg8 41. Qh4 Bc2 42. Rd6 a5 43. Bf4": "Checkmate looms again.",
        "43... h5 44. Qg5": "If 44...Kh8 then a picturesque checkmate occurs with 45.Qh6+ Rh7 46.Be5+ Rg7 47.Rd8# 1-0",
        "44... Rgg7 45. Rd8 Bd3+": "Now Black scrambles his last efforts.",
        "46. Ke1 Rf8 47. Rxf8 Rd7 48. Qh6#": "Black's play was generally robust, but some moves were wasted away from the action, and the move 18...a6? sealed the weakspot on b6,  coupled with 19...Be8? secured the fate of Black's already half-entombed and isolated queen."
    },
    "url": "https://gameknot.com/annotation.pl/human-v-computer-game-1?gm=55356",
    "gameName": "Human V Computer Game 1",
    "players": "Honza88888 (1534) vs. Excalibur(Level70) (???)",
    "opening": "QGD (D52)"
}