{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Bc4 Bc5 4. b4": "Why I was drawn to this move - I honestly cannot say, I rarely play such gambits against players, let alone computers. But I had been practicing it recently, and it was worth a try to see how a computer dealt with it.",
        "4... Bxb4": "I assumed this would be the continuation that Excalibur would select. Computers tend to grab material wherever they can. I predict the computer will return to c5.",
        "5. c3 Be7": "Instead, Black seeks a more classical line (since 5...Ba5 and 5...Be7 are most common.)",
        "6. d4": "I chose the most active continuation in what is now a rare, if not dead, opening. In a twisted way, White has surrendered a flank pawn (and isolated the a-pawn) in exchange for dominance in the centre of the board. This means that White must play positionally, or attempt to win materal back if this isn't possible. Common variations usually see a bishop on a3, a queen in b3, and the rooks firing ominously down the centre.",
        "6... Nf6": "Not the most common line. The most frequently played is the Cordel variation (6...Na5 7.Nxe5...) With strong position for White. Instead, Black tries to fragment the correspondence between my central pawns.\nVARIANT TREE of 7.dxe5...\nV1. 7...Nxe4  V1a. 8.Qd5...(V1ai. 8...0-0 9.Qxe4... +/-)(V1aii. 8...Ng5 9.Bxg5... +/-) V1b. 8.Bxf7+... (V1bi.8...Kf8 =)(V1bii.8...Kxf7 9.Qd5+... =)\nV2. 7...Ng4 V2a. 8.Qd5+... +/- V2b. 8.Bf4... =\nV3. 7...Ng8 V3a. 8.Qd5... +/- V3b. 8.0-0... =",
        "7. dxe5": "As per opening theory, the material has been rewarded positionally, and material balance itself is restored.",
        "7... Ng4 8. Qd5": "I take full charge of opening position, and deliver an early checkmate threat that forces Black to react with 8...0-0. Now I can force on the Black kingsid3. It should be noted that although I have a dominant centre, and a position benevolent to my cause, I have paid the price with my disturbed pawn structure.",
        "8... O-O 9. h3": "Black's most active piece is forced aside. Black's king lacks defenders, and his strife isn't aided by my queen's centralised place on d5, nor my control over f6 with a pawn.",
        "9... Nh6": "The question for White is, what next? 9.Bxh6 gxh6 leaves an exposed king, but needs a lot of time to generate an efficient attack, a saviour to him. Since the knight cannot actually move anywhere (safely), this move will wait. 9.g4... threatens 10.g5... with a piece lost on Black's part.",
        "10. g4 d6": "Black opens up the c8-bishop to attack the g4 and h3 pawns. Also, he threatens 11...dxe5, attacking both the centre, my queen and my material chances.",
        "11. g5 Be6 12. Qb5": "Several threats are kept alive with this move.",
        "12... Bxc4 13. Qxc4 Nxe5": "Black simply postpones the material loss, either on e5 now, or on h6 later.",
        "14. Nxe5 Bxg5": "I have lost position for material gain, but I can now respond strongly, and try to take back a controlling stance.",
        "15. Nd3 Bxc1 16. Nxc1 Re8": "Black joins a rook into the fray, and regains central stature.",
        "17. Kf1": "Black threatens 17...d5, and my king would become a problem.",
        "17... Re6 18. Ne2": "Several squares along the d8-h4 diagonal -which are weak- must be controlled.",
        "18... b5 19. Qd3": "The e4-pawn is more valuable than the b5-pawn. If e4 goes, then all of my pawns would be isolated.",
        "19... Qg5 20. h4 Qe5 21. f3": "This is the most useful move. All squares on my kingside are now secure. The vulnerable e4-pawn is now protected, and the h6-knight cannot infiltrate onto g4.",
        "21... Rg6 22. Nd2": "Black can threaten 22...b4, which is why the c3-pawn needs defenders. After the king moves, the a1-rook will also be safe.",
        "22... f5": "The breakdown of my pawn structure is now inevitable. I now have to search for positinal advantages elsewhere.",
        "23. Qd5+": "My weak queen is traded for a stronger piece.",
        "23... Qxd5 24. exd5": "The g-file has been sealed shut. e6 is no longer strong for Black, so a knight there would be benefical. Although Black can develop his knight to f7, the e5-square can be defended.",
        "24... Kf7 25. Nf4": "Black's rook is both hampered and a hindrance to Black himself.",
        "25... Rf6 26. Re1": "My achievement so far is to have tucked Black's pieces in front of his own pawns. Since he has exchanged a knight for two pawns, you can see how the material edge is only amplified on my part by this.",
        "26... Rb8 27. a3 Rb6": "After repositioning the king, it would be wise of Black to try and remove the d5-pawn.",
        "28. Kf2": "As well as developing the King, I threaten Nd2-Nf1-Ng3-Nh5.",
        "28... Ra6": "A strong threat, if the a3-awn were to be removed, then the a6-rook becomes strong, and can support the then passed a-pawn.",
        "29. Rea1 Ra4 30. Ne6": "With this move, Black's a4-rook has no valued influence on the 4th rank. Also the c7-pawn is under fire, and I now have time to manoeuvre the h1-rook.",
        "30... c5": "Black makes en passant on c6 impossible, and the passed pawn would be caught before he came to any use. He also threatens 31...b4 (32.cxb4 cxb4) and danger looms.",
        "31. Nd8+": "I give Black a chance to free his f6-rook after moving his king. In return, I can play Rhe1 and control the e-file, as well as move my knight to c6.",
        "31... Ke7": "(?) A slight error : this allows me to deliver check on the subsequent move, and hence 'gain' a move.",
        "32. Nc6+ Kd7": "The position now favours me. The advance on b4 is protected by the c6-knight, and even if the rook could move along the 4th rank, then the h7-pawn would fall.",
        "33. Rhe1 Rf7 34. Nb3": "My goal is to infiltrate onto a5, and cause chaos on Black's side. I can even develop a rook onto e6, and via Nb3-Na5-Nb7, threatens the d6-pawn.",
        "34... Rc4 35. Re3 Rxh4": "I am willing to gamble a passed pawn on the kingside in order to defuse queenside tension.",
        "36. Nxa7 Rh2+ 37. Kg1": "(37.Kg3??...would lead to 37...f4+ -/+) Anywhere else on the first rank, and 37...Rh1+ -/+ (positionally).",
        "37... Rb2 38. Na5 f4 39. Ree1": "Black is beginning to make inroads. I have to rid the b2-rook, get my knights back in play, and counter the kingside mass.",
        "39... Nf5 40. Reb1 Rxb1+ 41. Rxb1": "Black can now march. My pieces need to relocate very quickly.",
        "41... Ne3": "This move controls the cruciak c4-square, which the a5-knight may need for relocation.",
        "42. Nxb5 Nxd5 43. Nc4": "Black is accepting a weaker position with his knight. Also, I have created a passed pawn and threatened d6.",
        "43... Rf6": "I have been offered an exchange on d6 (44.Ncxd6 Rxd6 45.Nxd6 Nxc3). However, this concession of position would pretty much force a draw after the g7 and h7 pawns are captured, as well as the a-pawn",
        "44. a4 Re6": "Black composes pieces to attack on either e3 with the knight, or to attack the a-file with the rook via Re6-Re2-Ra2.",
        "45. a5 Rh6": "Black now appears to attack the f3-pawn, but maybe also wants to support his advance down the g + h files.",
        "46. a6 Ne3": "Blakc has missed his chance to prevent the a6-pawn from advancing, unkess he plays the rook down the board.",
        "47. a7 Rg6+": "V1. 48.Kh1 Rh6+, and Black forces perpetual check, unless V2 occurs.\nV2. 48.Kf2 Rg2+, and 49...Ra2 keeps Black alive.\nV3. 48.Kf2 Rg2+ 49.Ke1 Nxc4 50.a8(Q) Rg1+",
        "48. Kf2 Rg2+ 49. Ke1": "Of course, Black can play 49...Rg1+, and win the b1-rook, but I still gain.",
        "49... Nxc4 50. a8=Q": "I will lose the b1-rook, but I can respond strongly.",
        "50... Rg1+ 51. Ke2": "This evades the c4-knight for at least 3 moves against check.",
        "51... Rxb1 52. Qb7+": "If 52...Ke8 or 52...Ke6, then 53.Nc7+... wins the b1-rook.",
        "52... Kd8 53. Qb8+ Ke7 54. Qc7+ Ke6 55. Nd4+ Kf6": "(55...cxd4 56.Qxc4+...)",
        "56. Qd8+ Kg6": "(56...Ke5 57.Qe7+ Kd5 58.Qe6# 1-0)",
        "57. Qe8+ Kg5 58. Qe7+ Kh5 59. Qf7+ g6 60. Qxh7+ Kg5 61. Ne6+ Kf5": "(61...Kf4 and 62.Nxf4... destroys Black).",
        "62. Qf7+ Ke5 63. Qxf4+ Kxe6 64. Qxc4+ Kd7 65. Qf7+ Kc6 66. Qxg6": "The checking spree has ended, and the three pawns that Black boasted are gone.",
        "66... Rb2+ 67. Kd3 Kd7 68. f4 d5 69. f5 c4+ 70. Kd4 Rd2+ 71. Kc5 Rd3 72. Qe6+ Kc7 73. Qe7+ Kc8 74. Kc6 Rd2 75. Qc7#": "Black had chances to push his kingside pawns earlier, but chose to tustle positionally and lost out due to this."
    },
    "url": "https://gameknot.com/annotation.pl/human-v-computer-game-5?gm=55609",
    "gameName": "Human V Computer Game 5",
    "players": "Honza88888 (1534) vs. Excalibur(Level70) (???)",
    "opening": "Evans gambit (C51), Cordel variation"
}