{
    "moves": {
        "1. e4 c6 2. d4 d5 3. Nc3 dxe4 4. Nxe4 Bf5 5. Ng3 Bg6 6. Be3": "White deviates from the more common 6.h4..., which means he pressures development.",
        "6... Nf6 7. Nf3 Nbd7 8. Bd3": "White's development now surpasses my own, but a trade of bishops on d3 only enhances this advantage. My bishop shall remain on g6.",
        "8... e6 9. O-O Bd6": "If White decides to trade bishops on g6, I will recapture with my h-pawn, and my h8-rook will have an open file to shoot down, increasing his activity. Also, my d6-square may be weak, but at least I'm using it to pressure my opponent by placing a bishop on it.",
        "10. Bg5 Qc7": "Notw how heavy pressure on h2 is now increasing.",
        "11. Bxf6 Nxf6": "I decide that a better placed piece triumphs over a robust centre (something which would be provided if I had recaptured with 11...gxf6)",
        "12. Ne2": "White dangerously uncovers h2 for my diagonal battery. However, if his next move is 13.g3... , then he is safeguarding his position. Furthermore, he could be aiming at 13.c4... followed by 14.Nc3... for improved position. Another possibility is that he's simply defending the f4-square, vulnerable to my Ne5-f4.",
        "12... O-O-O": "I can now try to focus an attack on the White king.",
        "13. c3 Nd5": "My plan is to manoeuvre the knight to f4. If bishops are swapped on g6, I open up the h-file voluntarily. If we trade knights on f4, I will try to swap bishops on d3, and then advance my f, g and h-pawns towards the enemy king.",
        "14. g3": "White defies me!",
        "14... f5": "Rendering the d3-bishop poor (and indeed my g6-bishop), but also allows a potential movement of my own bishop by Bh5-g4-h3.",
        "15. Ng5 Qe7": "One possible variation is 16. Nf4?! Qxg5 17. Nxe6 Qe7 18. Nxd8 Rxd8",
        "16. Qc1 h6 17. Nh3": "A pawn advance is now near. White's last move builds greatly against f4. However, the move isn't dangerous, and f3 is now very weak - ready to be exploited.",
        "17... Bh5 18. b4": "White decides to stump my a3-f8 diagonal battery, but also shows possible intentions to march at my king with his queenside.",
        "18... Bf3": "I dominate the kingside light-coloured squares. I also have control over the a8-h1 diagonal. Now I must secure f4 safely. However, you also see how my f3-bishop prevents 19.f4!... which would complicate my stance.",
        "19. Nhf4 Qf6": "If the premature 19...g5? then 20. Ng6... +/-. Nonetheless that variation is playable, but risky - and with the advantage White would gain - damaging to Black's dominance on the kingside.",
        "20. Nxd5 exd5": "20...cxd5 would potentially allow 21. Bb5... Also, e4 is now secure and an open file for my rooks has appeared.",
        "21. Qe3": "White moves in with tempo.",
        "21... Be4": "The minor retreat is a setback but inevitable, but the downfall is easily compensated for by the limitng of White's development.",
        "22. Bxe4 fxe4": "It can be seen how I have essentially moved the f-pawn to the d-file. Also, an advance of my g+h pawns would suffocate White's counterplay. The only downside is the sudden passive nature of my d6-bishop.",
        "23. f3 Rhe8 24. fxe4 Rxe4 25. Qxe4 dxe4 26. Rxf6 gxf6": "Whilst I have developed a passed pawn, the price of this is the isolated h-pawn. However, he can stave off both opposing pawns.",
        "27. Rf1 Rf8 28. Kf2 Kd7 29. a3": "White dominates the dark-coloured squares, limiting my bishop. This is an advantage for White, whose knight can hop into my own half should he chose. White's last move allows his previously anchored c-pawn to advance further should he wish to limit my queenside.",
        "29... Ke6 30. Ke3 f5 31. Nf4+": "This allows me to exchange my passive piece for his, which is much more active.",
        "31... Bxf4+": "A closed position has occured.",
        "32. Kxf4 Kd5": "Now, either king has the potential to invade the other side, and it is possible for both to achieve this.",
        "33. h3 Ke6 34. Rb1 Rd8 35. g4 fxg4 36. hxg4 Kd5 37. Ke3 Rf8 38. Rh1 Rf3+": "An unbalanced position leaves me with a very slight edge.",
        "39. Ke2 Rg3": "An opposing passed pawn must not be created.",
        "40. Rh5+": "(?) White squanders his move, which in affect allows me to gain a move. ",
        "40... Kc4 41. Rc5+ Kb3 42. b5 cxb5 43. Kf2 Rd3": "If 43...Rxc3? then 44. Rxc3+ Kxc3 45. d5... 1-0 If 43...Rxg4, the White king would dangerously rejoin his pieces.",
        "44. Rxb5+ Kxc3 45. Rxb7 Kxd4 46. Rd7+": "I only have flank pawns remaining which allow a future win, meaning a draw is still possible.",
        "46... Kc3 47. Rxa7 Kd2 48. Kf1 e3 49. Re7 Rxa3 50. Rd7+ Rd3 51. Re7 Rd4 52. Re6 Rf4+ 53. Kg2 e2 54. Rd6+ Ke1": "(?) I fail to make the most of the position. If I had been patient, I would not hide behind the pawn and instead played 54...Kc3 - forcing eventually to make the enemy rook move, allowing me to promote on e1. I have squandered a win.",
        "55. Kg3 Rc4 56. Rxh6 Rc3+ 57. Kh4 Rd3 58. Re6 Kd2 59. g5 e1=Q+ 60. Rxe1 Kxe1 61. g6 Rd8 62. Kg5 Ke2 63. g7 Rg8 64. Kg6 Rxg7+ 65. Kxg7": "Solid play from both sides led to a drawn endgame. However, White made an error by gifting me an advance into his half of the board with my king when he played 40. Rh5+?... However, I replied with an error of my own on move 54 with 54... Ke1 and gifted a draw to White."
    },
    "url": "https://gameknot.com/annotation.pl/human-v-computer-game-2?gm=55561",
    "gameName": "Human V Computer Game 2",
    "players": "Excalibur(Level70) (???) vs. Honza88888 (1534)",
    "opening": "Caro-Kann (B18), classical, Flohr variation"
}