{
    "moves": {
        "1. e4 d6 2. d4 Nf6": "pircs defense",
        "3. Nc3 Nbd7 4. Nf3 e5 5. Bc4": "!? giving me the chance to attack. White has a chance to play Bxf7 ; Ng5  \nA drawback on my opening set up.",
        "5... exd4 6. Nxd4 Ne5": "I hate it when white plays Bxf7 ; Kxf7; Ng5 . As that would leave me crippled. \nHence, why I played exd4 moving (relocating) White's f3 knight. The e5 knight protects my f7 pawn and attacks White's c4 bishop.",
        "7. Be2": "Retreating the bishop giving me tempo. Better was Bb3",
        "7... Be7": "Now the point of the pirc's defense is of the hypermordern origin. Black concedes to the center. Allowing white to build up an ideal pawn center and controlling the central squares. While black develops his minor pieces so as to  later undermine whites pawn chain. Black waits and provokes white to attack premature. I prefer Be7 to g6; Bg7",
        "8. O-O Bd7": "A quiet move",
        "9. f4": "Provoking white to attack premature if you will",
        "9... Ng6 10. Be3 O-O 11. Qd3 c6": "This is the start of my attack. White attacks my king side with a pawn storm, while I position my pieces. I evade my opponent ; Defend and attack him head on, toe to toe. Unlike the Sicilian where black counter attacks on the queen side and Ruy Lopez where black creates a queen side pawn storm. ",
        "12. h3": "!! hindering my f3 knight movements and preparing g4",
        "12... d5": "Now I have formed my second pawn chain. The first was c7; d6; e5.  This new pawn chain b7; c6; d5 opens up my cramped position and forms my defensive barrier.Evade! Defend! Position! Attack! \nModern chess theory states that you attack where you pawn chain points, the King side.",
        "13. e5 Ne8 14. g4 Nc7 15. Nf3 Re8 16. f5 Nf8 17. g5 b5": "?? this was a bad move on my part. better was queen c8 or Bb4",
        "18. f6": "My advice would not to take the pawn as this opens up my king to attack",
        "18... Bb4": "!!! you did not know there was any place for my bishop to go did you!?",
        "19. h4": "Notice that his king is waiting to be attacked?",
        "19... Ng6": "My knights were hiding",
        "20. h5 Nxe5 21. Nxe5 Rxe5 22. fxg7": "***gasp***  The wise player would not take the pawn. There is no need to. Take a deep breath and relax.  If I did capture the pawn he would pin my rook via Bd4 or Qd4. \nNotice my rook is on a open file and his not?",
        "22... Ne6": "\"Bring them out\"  \"Bring them out\"  The second attack. ",
        "23. a3": "?! poor move, but forces the exchange.",
        "23... Rxe3": "!!! Do you see his Queen is doomed?",
        "24. Qxe3 Bc5": "!!Now I pined his queen against his King winning the game. The rest is a matter of technique ",
        "25. Qxc5 Nxc5 26. b4 Qxg5+ 27. Kh2 Qh4+ 28. Kg1 Qg3+ 29. Kh1 Bh3 30. Rfg1 Qh4": " I won!"
    },
    "url": "https://gameknot.com/annotation.pl/hyper-modern-opening-pircs-defense?gm=11892",
    "gameName": "Hyper modern opening Pircs defense",
    "players": "kulon (1545) vs. freeman8201 (1508)",
    "opening": "Pirc defence (B07)"
}