{
    "moves": {
        "1. e4": "My personal favorite way to start the game because of it generally having cutting lines and great tactics. Probably not a good thing against a player with such strength, but what is? At least it was fun. computer analysis http://gameknot.com/analyze-board.pl?bd=18855357&rnd=0.22834660526177641",
        "1... e5": "The most common reply to e4 creating a symmetry and opening up the opponents chances for counter-attacks and the likes.",
        "2. f4": "The King's gambit! Did I mention I hate symmetry? This opening is a romantic style of chess where white says, \"I sacrifice myself, so my brethren can storm the field!\" And technically the real reason of the move is to divert blacks e-pawn in hopes of creating a strong center and if black wants to keep that pawn, the opponent is forced to weaken their kingside.",
        "2... exf4": "Accepting the gambit. Like I always say, \"people who accept gambits are always more fun.\" Remember say no to counter gambits!",
        "3. Nf3": "I actually have a wheel in my house that I spin and it has 3. Nf3 or 3.Bc4. It just happened to land on this one.",
        "3... g5": "A strong move known as the Quaade attack. Weakening blacks Kingside, but makes it much of a struggle for the DSB to get free, also threatening the knight on f3. My personal favorite move. (No one likes anyone who plays the KGA modern defense either, so just don't do it!)",
        "4. Bc4": "A sharp way to play putting pressure on f7. (the weakest square from the start on black) Normally white plays 4. h4 to attack the protecting pawn on g5 and creating weakness in the kingside.",
        "4... g4": "Attacking my knight, and forcing me to do something about it. As you can see Black has made all pawn moves which most people are taught is bad, but there are extreme circumstances here and those call for extreme actions.",
        "5. Bxf7+": "This opening is called The Lolli Gambit or The Wild Muzio. The main idea is that it breaks down the king's pawn structure (it pretty much already was) and makes a wild offensive line, but black also gets some nice counter-play in this line. WARNING: Kids, don't try this at home. Also squeamish people should look away.",
        "5... Kxf7": "What else. You have to accept it.",
        "6. Ne5+": "Helps white get their pieces out with tempo.",
        "6... Ke8 7. Qxg4": "Black must be very careful at this point because dubious moves can be punished swiftly and without remorse. ",
        "7... Nf6": "Protects the threat of the queen moving to h5 and attacks the queen simultaneously. A good all purpose move.",
        "8. Qxf4": "Frees up the kings half of the board, but with a little price.",
        "8... d6": "Attacking the knight and letting the bishop out. Tempo Tempo Tempo.",
        "9. Nf3": "Sadly, I had to save the knight to fight another day. ",
        "9... Rg8": "Attacks the half open g-file and the weak pawn on g2. ",
        "10. O-O": "Saving the pawn and trying to get something going on the completely open f-file. ",
        "10... Qe7": "A surprising move to me as I expected Rg4 which is almost always played. Putting huge pressure on e4 here and if I don't protect it Rg4 is sure to come.",
        "11. d3": "I consider this a bad move now that I have tried it. White really shouldn't be worried about losing the e-pawn because it puts black's king on a wide open file. One he controls, but still it is something. I recommend something like d4 to keep my options open.",
        "11... Qg7": "Scary and for some reason I didn't think about this happening. Threatening me with mate on g2. Again tactics force you to do something immediately, and this is as dire as it gets. ",
        "12. Nh4": "Protects g2. I was hoping the knight might be able to do something later, but Ne1 is probably better. And if you are thinking g3.. bh3 will crush your dreams.",
        "12... Be7": "Threatens to take away my only protection against the mate.",
        "13. Nd2": "Anticipating that the opponent will move their knight on f6 to attack the knight, so the plan is simple Ndf3.",
        "13... Nh5": "Attacking my queen, and the knight. ",
        "14. Qf3": "The only way to defend. ",
        "14... Nf4": "Bxh4 is playable, but it just doesn't have that extra kick like this move (and isn't as good). Taking advantage of h3 with his two minor pieces. I know you're probably thinking I can take it, but it seemed pointless because I figured 14. Bxh4 15. g3 Bg5 16. Qf3 is about the same.",
        "15. Nc4": "Attacks the knight and helps open up the position a tiny bit, but it's just too late.",
        "15... Nh3+": "a foreseeable tactic that I knew I couldn't stop. Putting me in check and making it just that more terrible for my position.",
        "16. Kh1 Bxh4": "I thought this move was a little odd and figured he'd just develop a piece. ",
        "17. gxh3": "My only option, if I wanted any chance.",
        "17... Nc6": "A great move which foresaw my only hope left the weakness of f7 and f8. Also Be6 and Kd8 are playable.",
        "18. Bh6": "My only tactic left and it is a pretty good one (too bad my opponent is good also.) Trying to exploit the kingside one last time. He can't take it because of Qf7+ Qxg8+ which is very bad.Moving the queen also fails to Qh5+. Qg6 is no good because of Rg1. And Ne5 is really bad because of Nxe5 and you are in the same spot.",
        "18... Nd4": "The only good move, and I knew it was over.",
        "19. Bxg7 Nxf3 20. Rxf3 Rxg7 21. Raf1 Ke7 22. Ne3 Be6 23. Nf5+ Bxf5 24. Rf3xf5 Rag8 25. d4 Bg5 26. Rf5f3 Kd7 27. Rg3 h6 28. a4 Bh4 29. Rgf3 Re8": "30. Rf4 Bg5 31. Rg4 Rge7 32. Re1 and the loss is inevitable."
    },
    "url": "https://gameknot.com/annotation.pl/i-accept-your-club-challenge?gm=47998",
    "gameName": "I Accept Your Club Challenge",
    "players": "myevilluck (2020) vs. elyhim (2337)",
    "opening": "KGA (C37), Lolli gambit, Young variation"
}