{
    "moves": {
        "1. d4 Nf6 2. Bf4 d6 3. Nf3 Nbd7": "Not usual. ",
        "4. Nbd2 c6": "This makes me play...",
        "5. c3 Qc7": "This move reinforces e5, which I overlooked, so I played...",
        "6. e4 e5 7. dxe5 dxe5 8. Bg3": "This is very difficult to manage for me. I do have pressure on e5. ",
        "8... Nh5 9. Nc4 Nxg3 10. hxg3": "No problem in exchanging this \"bad\" bishop, even at the price to leave e5 as... a problem for black, instead than block me. ",
        "10... Be7 11. Qc2 Bf6": "Black overprotects e5 so he can move Nd7. ",
        "12. Nh4": "I will make the h column a value. ",
        "12... Bxh4 13. Rxh4": "It is always dangerous to risk a rook that way, but I felt I colud succeed in saving it if ever attacked by the black pawns. ",
        "13... Nf6 14. O-O-O": "I allow him to castle, but he will have to attack with b5. Now, this is impossible due to Nd6+ with strong attack. ",
        "14... Bd7": "Not good since it doesn't avoid...",
        "15. Nd6+ Ke7 16. Qb3": "f7 is threatened, forcing...",
        "16... Be6": "...that is countered by...",
        "17. Bc4": ", but was it a good plan? Probably not. Look: ",
        "17... Rhd8": "I considered Nxf7, but after RxR+, KxR, BxB, QxB, I didn't see a clear win! so I went, a little worried...",
        "18. Nf5+ Bxf5 19. Rxd8 Rxd8": "Now, to take the bishop is to allow black queen's penetration, with potential mate! But Bxf7, Bc8 was good defence for black. Even so, I should have gone for it instead of...",
        "20. exf5 Qd7 21. Rh1": "...praying that this was enough to save me from the mate. ",
        "21... Qd2+ 22. Kb1 Qxf2": "Ok, this is my chance: now or never! I considered Qxb7+, but after Rd7, Qxc6, I don't see anything definite, so...",
        "23. Bxf7": "? Bd6 was a reasonable move. ",
        "23... Qxf5+ 24. Ka1 Nd5": "Feeling very depressed for my lost attack, I seized the chance to simplify and see if I could draw at least. ",
        "25. Bxd5 cxd5 26. Qxb7+ Rd7 27. Qb4+ Ke6 28. Qb3": "...pinning the d pawn, trying to win some time. ",
        "28... Qf2": "Very annoying. I can't defend the pawns, but I am always thinking in attack rather than in defence. ",
        "29. c4 Qxg2 30. cxd5+ Rxd5": "See this beauty: ",
        "31. Rd1": "This kind of blocks black by now, but he has more pawns to advance. ",
        "31... h5 32. a3": "I have to open a square for my king out of the first row. ",
        "32... g5 33. Ka2 h4 34. Rc1": "Defence is useless. I have to attack. ",
        "34... Kf5 35. g4+": "Attracting the king to a square that doesn't favour me at all, unless I can find a tactic. ",
        "35... Kxg4 36. Qc4+ Rd4": "This was my purpose!",
        "37. Qe6+ Kg3": "Now Qxe5+ is advisable, but I played",
        "38. Rc3+ Kh2": "Black allowed Qxe5 anyway. ",
        "39. Qxe5+ Rf4": "It is very difficult a game to play. Could I ever save it?",
        "40. Qc5": "Embarassing black, that can't stand for Rc2... can he?",
        "40... h3": "He says he can. This is what I call a \"high voltage\" position. ",
        "41. Rc2 g4": "...to avoid Qxg4. ",
        "42. Rxg2+": "My secret weapon will be the h column. ",
        "42... hxg2 43. Qc2": "Play \"pin or check\". What else?",
        "43... g3": "Planning Rf2. ",
        "44. Qh7+": "Black has to block his own pawns. ",
        "44... Kg1 45. Qxa7+ Kf1": "Now, I can't stop checking him. Note that I have a full Q over a R, but I am still losing. ",
        "46. Qa6+ Kf2 47. Qb6+ Kf1 48. Qb5+ Kf2 49. Qc5+ Kf1 50. Qc1+ Ke2 51. Qg1": "I considered that this move will block the situation on this side of the board, and that black would have had to lose the game to my joined pawns. But black found a way to unravel. ",
        "51... Rf2 52. a4 Kf3": "Now, f1 comes, and I lose my queen for a pawn. Or I can go on checking him until possible... I tried for a line that, I hope, will surprise my opponent, based on tempoes. I miss my goal for one tempo. ",
        "53. a5 Rf1 54. a6 Rxg1 55. a7 Re1": "?? By Ra1+, KxR, g1=Q+, black wins. But my opponent missed it!",
        "56. a8=Q+": "Again a queen vs R and two doubled pawns. ",
        "56... Kf2 57. Qf8+ Kg1": "Again, I have some spare tempoes to advance my other pawn. Again, black has to unravel the situation.",
        "58. b4 Re4 59. Kb3 Rh4 60. Ka4": "?? I had to threat his rook with Qd8, or advance the pawn to b5. ",
        "60... Kh2": "...because now I dont' have any \"pin\" square for the g2 pawn!",
        "61. Qf6": "Now, it is very funny: if g1=Q, QxR#! It would have worked, if not for my stupid king move from before. ",
        "61... Rxb4+ 62. Kxb4 g1=Q": "Now, if I can stop this pawn, I can draw! Whew... will I ever be able?",
        "63. Qh4+ Kg2 64. Qe4+ Kf2 65. Qf4+ Ke1": "Just what I wanted. Now, ",
        "66. Kc3": "...and my King will support my queen in giving check. BUT it was a serious mistake. White can't allow black to exchange queens if my king ends far from the g pawn. ",
        "66... Qc5+": "Now, I've given black the chance to try to accomplish it. ",
        "67. Kd3 Qa3+ 68. Kc2 Qa2+ 69. Kd3": "?? The losing blunder. With Kc3, black could just repeat the checks, but with this one, he can press my king into the fourth rank. ",
        "69... Qb3+ 70. Ke4 Qc4+": "And this wins. ",
        "71. Kf3 Qxf4+ 72. Kxf4 g2": "Thank for the lesson, inzakenas..."
    },
    "url": "https://gameknot.com/annotation.pl/i-got-a-lesson?gm=55936",
    "gameName": "I got a lesson",
    "players": "damalfi (1805) vs. inzakenas (1777)",
    "opening": "Queen's pawn game (A45)"
}