{
    "moves": {
        "1. d4": "Trying out a new moment as either way i'll win the game.",
        "1... d5": "So far it is quite a normal game.",
        "2. Bf4": "I bring my bishop out.",
        "2... Nc6": "And black his knight.",
        "3. Nc3": "I also bring my knight out.",
        "3... Nf6": "And so does black.",
        "4. Nf3": "It seems like a 4 knights game apart from the bishop being in the game.",
        "4... Bg4": "I threaten to put opponent in a bad opponent.",
        "5. Ne5": "I move my knight out of the way.",
        "5... Nxe5": "I except the exchange.",
        "6. Bxe5": "I take with my bishop because if I took with my pawn his pawn would be able to advance and threaten my knight.",
        "6... Ne4": "I also go for a swap off.",
        "7. Nxe4": "This time it is me as white excepting the exchange.",
        "7... dxe4": "The only way I can take his knight- it seems as if my opponent is in the better position.",
        "8. h3": "I attempt to scare his bishop away.",
        "8... Be6": "There isn't much I could have done.",
        "9. Qd2": "I move my queen out of the way so that I can castle in my next move.",
        "9... Qd7": "I am copying white.",
        "10. O-O-O": "I castle.",
        "10... O-O-O": "And again...",
        "11. e3": "I push my pawn to release my bishop.",
        "11... Bxa2": "I, without thinking take the pawn.",
        "12. b3": "Just what I had hoped for.",
        "12... f6": "I push pawn to attack his bishop.",
        "13. Bg3": "Hardly a better move.",
        "13... Bxb3": "My best option.",
        "14. cxb3": "I capture his bishop but it leaves me in a bad position.",
        "14... a6": "I push pawn for maybe in the future.",
        "15. Bc4": "I put myself in a good position (I think).",
        "15... Qc6": "My bishop is pinned.",
        "16. d5": "I try and force his queen back.",
        "16... Qc5": "I just push my queen forward.",
        "17. h4": "I start advancing my end pawn.",
        "17... b5": "I have his bishop trapped at the cost of my position.",
        "18. Qa2": "Not much i can do to save my bishop.",
        "18... bxc4": "I take feeling better.",
        "19. bxc4": "I take back",
        "19... e5": "I push my pawn two forward forgetting about n.p",
        "20. dxe6 e.p.": "That is exactly what I do but I get rid of his double pawns.",
        "20... Rxd1+": "I take the oppurtunity of a swap off as I am in a better position.",
        "21. Rxd1": "My best move.",
        "21... g5": "I push my pawn in attempt for more exchanges.",
        "22. Qxa6+": "I am back in the lead and I believe there is a checkmate on the way.",
        "22... Kb8": "Only option.",
        "23. Rd8#": "And there you go- another game proving that I play better as white. I made quite a few mistakes in this game but that it is mostly because I was trying to play as fast as I can."
    },
    "url": "https://gameknot.com/annotation.pl/i-play-myself-again?gm=40599",
    "gameName": "I play myself again",
    "players": "lastav  vs. lastav ",
    "opening": "Queen's pawn, Mason variation (D00)"
}