{
    "moves": {
        "1. d4 d5 2. Bf4 Bf5 3. Nf3 e6 4. h3": "This is my \"bet\" on the London. White's push has a very small edge over black's symmetrical. The plan it to leave the black lsb looking freely to the diag, and playing around it. This theme will become crucial during the middlegame. ",
        "4... Nf6 5. g4 Bg6 6. Nbd2": "Not in a hurry. And not to c3. ",
        "6... Bd6 7. Ne5": "The thematic... threatening NxB, for one side...",
        "7... Nbd7 8. e3": "...but not playing it, actually, since it is beter for white to try to strangle black, instead of releasing the pressure. Besides, it would leave a semiopen column to black, and I'm not ready to defend or to use it to attack. ",
        "8... Bxe5 9. dxe5": "Thematic. The dsb keeps trapped for the rest of the game, but white's central dominion is strong, provided white takes care of the queenside. ",
        "9... Ne4 10. h4": "Again, trying to \"strangle\" instead of freeing him. And avoiding a nasty Qh4, of course. Nf3 could be playable, but this is more threatening. ",
        "10... Nxd2": "I was tempted to take with the king, so after Be4, f3. I didn't dare with a strong opponent like this. ",
        "11. Qxd2 Be4 12. Rh3": "Surprising him. I'm planning an inmediate f3. ",
        "12... h6 13. f3": "Not whorty for black Bxf3, RxB, Qxh4+, Rg3 and nothing happens. ",
        "13... Bh7 14. Qb4": "...before black takes advantage of my weak queenside. If Bxc2, Qxb7, Rb8, and I think black is better. Anyway. ",
        "14... Nb6": "This helps him. The only good is he can't castle kingside. ",
        "15. O-O-O": "Say we transposed the moves, and here we are. My kingside attack is stopped, and I'm playing indirectly in the center. ",
        "15... Qe7": "Unpinning at once the queen. ",
        "16. Qxe7+": "I knew that this would have helped him a hand, but I couldn't see anything better. ",
        "16... Kxe7 17. b3": "To control the knight, and providing my king a route to the action via dark squares. ",
        "17... c5": "Now, this is a pawn's game: it is really very difficult to handle in blitz time. ",
        "18. g5": "I lost my temper and attacked. ",
        "18... hxg5 19. Bxg5+": "This was intended to be a surprise, but it turned out to be a simple mistake. ",
        "19... f6 20. exf6+": "Better was Bf5. ",
        "20... gxf6 21. Bf4 e5 22. Bh2": "Ok. Black has won a battle, but not the war. ",
        "22... Bg6 23. Bd3": "I thought the bishop has not a good spot, and that better is to get it into the fight and leave the way free for my rook to g1. ",
        "23... Bxd3 24. cxd3": "I discover my king, but now I have a decent defence against the black's avalanche. ",
        "24... Rh6": "A mistake, in my view. Ra-g8 was deadly. ",
        "25. Rg1 Kf7 26. Rhg3": "I thought he thought I was so naive to set a trap hoping in a mistake of him. ",
        "26... Rxh4 27. Rg3g7+ Ke6 28. Bg3": "but no. Now, don't ask me why I gave my h pawn. I thought the rook's penetration would be decisive, even considering the e6 refuge his king has. ",
        "28... Rh3": "This was embarassing, and unforseen. Right. Now I can't move my rook from the g file or I will exchange a rook and lose a pawn (the least) in the process, after Rg8 by black. ",
        "29. e4": "I'm sure this is not the good one. I justified myself saying that I was looking to get away of the 3º row pawns in order to be able to move my bishop again (sob!)\n",
        "29... dxe4 30. dxe4": "...intending f4 without fearing Rd8. Note that I don't find time to take the b7 pawn. ",
        "30... Rah8": "Even here, I was tempted to Rxb7, but... ",
        "31. Bf2": "...this was much more important: to free my bishop. Now, I'm offering a clean pawn's exchange, but with a \"plus\"...",
        "31... Rh3h1 32. Bxc5": "! (I dare). I mean that RxR, RxR+, Kmoves and Rh2 wins the bishop. So I don't have to take, that's all. But with this move, I also threat...",
        "32... Rxg1+ 33. Rxg1": "Not Bxg1, or it will be pinned with Rh1. ",
        "33... Rh3": "Now that I have the mate in sight, let's try to be clever and use it.",
        "34. Rg7": "Can you believe? My opponent played...",
        "34... Rxf3": "And, of course, it was...",
        "35. Re7#": "In my language you say: \"warned soldier, half-saved soldier\". It sound horrible in English, but you get the meaning, don't you? Thank you for reading. "
    },
    "url": "https://gameknot.com/annotation.pl/i-told-you?gm=50764",
    "gameName": "I told you!",
    "players": "damalfi  vs. +1800 ",
    "opening": "Queen's pawn, Mason variation (D00)"
}