{
    "moves": {
        "1. e4 e5 2. b3": "Definitely not the most famous move. It does not take positions in the center. ",
        "2... Bc5": "That prevents early d4 and suggest d6. Pawn on e5 must be hardly defended from the bishop who in future might be on b4. ",
        "3. Ba3 Bb6": "Next a bit unexpected move I believe this is the best solution. Bishop on a3 mustn't be changed. It could be restricted and weaken by following d6. ",
        "4. Nf3 d6 5. Bc4 Bg4": "I don't hurry in preparing my castle on king side. ",
        "6. Nc3 Nc6 7. O-O Qd7": "Again. I could place my king on the queen side. ",
        "8. h3 Bh5 9. Bb5 O-O-O 10. Bxc6 bxc6": "My queen must remain active. ",
        "11. b4 g5 12. b5": "Not so reasonable move. ",
        "12... cxb5 13. Nd5": "In fact that is good. My black-squared bishop is powerful. ",
        "13... g4": "Ba5 should be played first. ",
        "14. Nh2 Ba5 15. hxg4 Bg6": "The pawn force is equal but white has inactive bishop and knight. Of course black hadn't ended their mobility but soon the king-side would be open. ",
        "16. Bb4": "Now I'll change my bishop, but white would lose another pawn on e4. ",
        "16... Bxb4 17. Nxb4 c5 18. Nd5 Bxe4 19. Ne3 Ne7 20. d3 Bc6": "Black ended their mobility and have a strong bishop at a big diagonal. ",
        "21. c3 h5 22. Rb1 hxg4 23. Nexg4 f5": "A realy good attack of the knight on g4. ",
        "24. Nf6": "The wrong square. ",
        "24... Qe6 25. Nh5 Qh6": "Now we see a posible mate. ",
        "26. c4 Rdg8 27. cxb5": "Not enough scary. ",
        "27... Rxg2+ 28. Kh1 Rg4+": "Rf2 was also possible, but if not followed by taking of the queen (within fast mate) it would let white to defend their knight on h2 easily. Now the rook weakens the defence on h5. ",
        "29. f3 Qxh5": "Mate threat. ",
        "30. Rb2 Rh4 31. Rff2 Bxf3+": "Finishing combination. If Qf3, black plays Rh2+, Rh1+ and Qh2 mate. ",
        "32. Rxf3 Rxh2+": "Mate again. ",
        "33. Kg1 Rh1+ 34. Kf2 Qh2+ 35. Ke3 Nd5#": "The game is good and it shows a few tips about the activity and the attacks on the king side. "
    },
    "url": "https://gameknot.com/annotation.pl/i-want-to-challenge-someone-with-a-higher-rating?gm=39186",
    "gameName": "I want to challenge someone with a higher rating",
    "players": "theredstreak (1156) vs. urnesthemingouey (1586)",
    "opening": "King's pawn game (C20)"
}