{
    "moves": {
        "1. e4 d5": "My usual Scandinavian...",
        "2. exd5 Nf6 3. Bc4": "...that in this case (the only one I know) can't be followed by the Icelandic gambit, since after the exchanges black will have an isolani on the e column... not any good!",
        "3... Nxd5": "So this is the profilactic move. But I am on almost unexplored threads. ",
        "4. Qf3": "Classic opening trick. It is either a naive attack or a nasty trick I should know. ",
        "4... e6": "Cautiosly, and blocking in my lsb (which is the beginning of my disgrace...",
        "5. d3 Nc6": "N looks as if to threat c7, but if fact he is aiming to e5, forking Q and B and resolving the tension in the center. ",
        "6. c3": "White, as foreseen, must defend c7 against the knight's jumps, so I go...",
        "6... Ne5 7. Bxd5": "White reacts, and it seems a blunder. Now, I can take with the queen and the game is even. Or I can...",
        "7... Nxf3+ 8. Bxf3 Qxd3": "I am +4, and it seems I am winning. ",
        "9. Be3 Qc2": "I wonder how can white defend b7 and develop, but I was dead wrong. ",
        "10. Nd2 Qxb2 11. Rb1 Qxc3": "+6. A N pinned. Relatively safe Q. b2 is lost, but I would welcome to exchange one of white's bishops. It is starting to look hard for me to develop. ",
        "12. Ne2 Qa5 13. O-O": "I though about Bb4 here, but Nc4 was awaiting me. Qxa7 would have been to insist on the classical \"too greedy\" mistake I was already in. ",
        "13... c6": "Guarding b2. I have to solidify, but in doing so, I wasn't answering the question \"where to develop my lsb? How to bring the rooks into the game? How bitter feel all those pawns. ",
        "14. Nc4 Qa6 15. Rfc1": "Can you believe it? I am under heavy fire! My opponent well could have sacrified the Queen on purpose! I hunger for good moves. ",
        "15... Be7 16. a3 O-O 17. Bd4 Bd7": "+6 and I should think about f6-e5 to win some manouver space. ",
        "18. Ne5 Rfd8": "Welcome, Bad Bishop's exchange!",
        "19. Be3": "White is too wise for that. ",
        "19... Be8": "f6 was coming into consideration, but I wasn't sure at all about opening the game. I needed control. ",
        "20. h3": "Ok, white will get me by hunger, with waiting moves until I lose my temper. Which I am very willing to do, in spite of a counter unbalanced exchange that can rid off some of white's overwhelmigly well placed pieces. ",
        "20... Bxa3 21. Rba1": "As foreseen. ",
        "21... Bxc1 22. Rxa6 Rd1+": "Just to win a tempo for doubling rooks. ",
        "23. Kh2 bxa6": "Sad necessity. I will lose a minor piece, leaving him the bishop's pair. But at least I had some mobility with my two rooks. ",
        "24. Nxc1 Re1": "? Blunder. Bd7 and I will have to work hard to even save the R from an exchange. ",
        "25. Nc4 Rb8 26. Nd3": "I am dangerously driving his pieces to open field, knowing that minor piece's weakness against the rooks it the \"two undefended sided pieces\" situation. ",
        "26... Ra1 27. Bxa7 Rbb1": "Now is where, if white plays as I suppose, I'll get him in a sided undefended situation. ",
        "28. Bd4 Ra4": "That's it. Of course, white has the other knight, so...",
        "29. Ndb2": "Now, I will lose a rook for two minor pieces. I am +4 now, I will be +6 then, but I will lose some of the lonely pawns on the kingside. I can hope just to be an exchange and a pawn up. And with the feeling to have fooled a horrible death. ",
        "29... Rxb2": "Now, of course white should have taken with the bishop, keeping the pair, but...",
        "30. Nxb2": "A blunder, since in such a position the bishop pair is most valuable. ",
        "30... Rxd4": "Now the game, sadly, loses interest, but it is still an unbalanced game...",
        "31. Kg3 g5": "I can play c4, of course, but I liked to speculate on the king itself. ",
        "32. Bh5 Kg7 33. Nd1 Kh6 34. Bf3 f5 35. Kh2 e5 36. Ne3": "Nasty threat, but all is under control. ",
        "36... Kg6": "Bh5+ doesn't work because there is no check fork on Nxf5. ",
        "37. g4 Rf4": "...wanting to play risky. All went as predicted: ",
        "38. gxf5+ Kf6 39. Bg4 Rxf2+ 40. Kg1": "...and here my opponent abandoned the game. My queen pawns will cost white a piece each, and then, my rook will win. "
    },
    "url": "https://gameknot.com/annotation.pl/im-up-and-i-cant-feel-it?gm=56643",
    "gameName": "I'm up and I can't feel it...",
    "players": "zintan  vs. damalfi ",
    "opening": "Scandinavian defence (B01)"
}