{
    "moves": {
        "1. d4": "1. d4 is the second most popular opening choice for white.  It occupies one center square and attacks another (e5).  It opens a line for the bishop on c1, and offers a slight boost to the queen's mobility.  The d2 square is now an option for the knight on b1 as well.  There is a slight weakening of the e4 and c4 squares, because the d-pawn can never be used to help control them.",
        "1... Nf6": "A flexible move.  It is a centralizing, developing move that doesn't tip black's hand.  The knight is almost certainly going to move to f6 anyway, so why not right away?  The knight attacks two center squares (e4, d5).  Since, white slightly weakened e4 with 1. d4, black will want to think seriously about fighting for this square.",
        "2. c4": "A natural follow-up to 1. d4. White is using the c-pawn to contest the d5 square.  Experience has shown that white's best hope to secure the initiative is to play the c-pawn to c4 prior to developing the knight to c3.  If white chooses not to use the c-pawn in the fight for the center, spatial equality is the most likely outcome.  In this game, white wants more.",
        "2... e6": "The Nimzo-Indian.  Named after the great theorist Aaron Nimzowitsch, this opening is based on a deep understanding of pawn structure.  Nimzowitsch's writing on pawn structure (first \"Blockade\" and then \"My System\") educated generations of chess players and it now belongs to our common chess heritage.",
        "3. Nc3": "This is obviously where the knight belongs.  It centralizes the knight (moves it towards the center), which usually increases the piece's power.  Pieces tend to be more mobile in the center of the board, and their power is tied to their mobility.  The knight is also helping to fight for the control of the e4 and d5 squares.",
        "3... Bb4": "The key move of the Nimzo.  Black is willing to trade his king bishop for white's queen knight, which is counter to classic chess theory.  What Nimzovitsch had in mind was to double white's c-pawns, then blockade them (prevent their advance) and then attack them.  This is a very deep strategical plan and we're only on the third move!",
        "4. Qc2": "There are many continuations, but 4. Qc2 is one of the most popular.  White wishes to be able to recapture on c3 with a piece, preserving the pawn structure and thwarting black's plan.",
        "4... Nc6": "The white queen is protecting c3 now, but has abandoned the protection of the pawn on d4.  Black takes advantage of this by making a developing move that includes a threat.  White must take time to defend the d-pawn.",
        "5. e3": "5. Nf3 is also possible.  5. e3 defends the d-pawn and opens a line for the bishop on f1, but notice what it does to the mobility of the bishop on c1.  Chess is about making choices and trade-offs.",
        "5... O-O": "Black has quickly completed his kingside development and castled.  With the king safely secured behind a phalanx of pawns on the side of the board, black can initiate action in the center.",
        "6. Bd2": "Because white has established a pawn chain on dark squares (f2, e3, d4) this is the weaker of the two bishops.  White would be happy to exchange it.  Notice, however, that white's kingside development has been neglected.",
        "6... d6": "Black intends to part with his dark square bishop.  His strategy now is to play d6 and e5.  He will use his pawns to fight for the dark squares and his c1 bishop to help fight for the light ones.",
        "7. Bd3": "The bishop belongs on this diagonal (b1-h7).  It is posted as aggressively as possible.",
        "7... Qe7": "Consistent with the plan of playing e6-e5.  The queen gets off of the back rank and asssists the e-pawn's advance.",
        "8. Nf3": "8. Nge2 was also possible, allowing the f-pawn to be used in the fight for control of the center.",
        "8... e5": "Black advances with a threat.  If white castles, for example, black would capture on c3 and then advance the e-pawn to e4, forking two of white's pieces.",
        "9. Nd5": "Intiating tactics in the center, which is dangerous, if you haven't castled.",
        "9... Nxd5": "9. ...Bxd2  was also possible.",
        "10. Bxh7+": "I was expecting 10. cxd5 Bxd2  ",
        "10... Kh8": "Forced.",
        "11. cxd5 Bxd2+": "Also forced.",
        "12. Nxd2": "12. Qxd2 would've been better, but black has 12. ...Nxd4 with a slight advantage.",
        "12... Nb4": "White cannot save the bishop without losing something.  13. Qb1 exd4 is better for black.",
        "13. Qe4": "This is a mistake.  White has to abandon the bishop on h7 with 13. Qb3, but again black can play 13. ...exd4 with the better game.",
        "13... f5": "Now the bishop is lost without compensation.  White may have over looked that the black queen controls the h4 square, so the white queen is forced to retreat.",
        "14. Qb1": "If 14. Bxf5 Bxf5 followed by 15. ...Nc2  winning.",
        "14... Kxh7": "Establishing material superiority.",
        "15. O-O exd4 16. exd4 Nxd5": "The captures are over and black is a piece ahead.",
        "17. Qd3": "First 17. Re1 taking over the e-file would've been a bit better.",
        "17... Qg5": "Transferring the queen to the kingside and threatening 18. ...Nf4.",
        "18. Qh3+": "18. Nf3 was better, because white needs to avoid a further reduction in material.  When ahead in pieces, each piece exchange (of equal value) increases your winning chances.  This is termed simplification in chess.  (It is easier to convert a 6-3 material advantage than one of 15-12, even though you are  3 in both cases.)",
        "18... Qh6 19. Nf3": "White's best chance was probably to go back to d3 with the queen.",
        "19... Qxh3": "Once the queens come off the board, black's material advantage is even more pronounced.",
        "20. Ng5+": "Temporarily preserving the integrity of his kingside pawn structure.",
        "20... Kg6 21. Nxh3": "The knight, however, has nowhere to go now.",
        "21... f4": "So, black attacks it.  White's kingside pawn structure will be ruined no matter what.",
        "22. a3": "Moving a rook to the e-file would've been a more active plan.",
        "22... Bxh3 23. gxh3 f3": "Clearing the f4 square for the knight, and sealing in the white king.",
        "24. Rae1": "A little too little too late.",
        "24... Nf4": "White's doubled h-pawn's provide scant shelter for the king.",
        "25. h4": "The last chance was 25. Re7, but black's plan would've been the same.",
        "25... Ne2+": "The knight and f-pawn combine to trap the king on the h-file.",
        "26. Kh1": "Notice the mating pattern.  If white's h-pawns were removed Rh8 would be mate.  So, black goes after the h-pawns.",
        "26... Rf4 27. d5": "Preserving a pawn, that black had no interest in.",
        "27... Rxh4": "The threat is now mate in two.",
        "28. Red1": "28. Rxe2 was mandatory, but hopeless.",
        "28... Rxh2+": "0-1. 29. Kxh2 Rh8#.  White got into serious difficulty by intiating tactical operations in the center, prior to castling.  Black always had defensive resources based on exploiting the white king position.  A miscalculation by white left him a piece down, which is a serious material deficit."
    },
    "url": "https://gameknot.com/annotation.pl/ic-dogs-team-1-mini-tournament?gm=3096",
    "gameName": "IC DOGS Team 1 Mini Tournament",
    "players": "kradak (1506) vs. yellowlab (1836)",
    "opening": "Nimzo-Indian (E33), classical, 4...Nc6"
}