{
    "moves": {
        "1. e4 d6": "The idea behind the Pirc and/or Modern defense is to allow white to establish a pawn center, and then try to undermine it.",
        "2. d4 e6": "We are already out of mainstream theory.  Black has already conceeded too much space to white.  Notice that the pawns on e6 and d6 interfere with the development of both bishops.",
        "3. f4": "It is useful to advance the f-pawn prior to developing the knight to f3.  The f-pawn will support further spatial conquest.",
        "3... f6": "This weakens the h5-e8 diagonal, and robs the g-knight of the f6 square,  which is its most natural post.",
        "4. Nf3": "White wishes to complete at least his kingside development before undertaking any further advance into enemy territory.",
        "4... c6": "This deprives the b-knight the c6 square, which is its most natural post.  The move does have the virtue of opening the a5-d8 diagonal for the queen.",
        "5. Bd3": "On c4 the bishop would run into d6-d5 and have to move again.  On d3, it is poised to attack the weakened light squares in black's kingside.  A move such as f7-f6, is a serious weakening.",
        "5... b6": "Now, it is almost comical.  The move allows the bishop to be developed, but it bottles up the queen again.  Is black hoping to get all of his pawns on the 6th?  I've seen this curious play before, where players forget about their pieces and move only pawns.  It isn't to be recommended.",
        "6. O-O": "Now, white has safely removed the king from the center and will try to open lines of attack and penetrate black's position.",
        "6... a5": "A break from convention!  The pawn advances two squares.  If the idea is to eliminate the d3 bishop, then the immediate 6. ...Ba6 would suffice.",
        "7. Nh4": "With the threat of 8. Qh4 ",
        "7... Nh6": "Perhaps a move such as 7. ...Qc7 in order to be able to answer 8. Qh4  with 8. ...Qf7.",
        "8. f5": "With the threat of 9. Bxh6 ruining black's pawn structure.",
        "8... g5": "An interesting moment.  9. fxg6 e.p. wins material, but I wanted more.",
        "9. fxe6": "Hoping for 9. ...gxh4 10. Qh4  Ke7 (forced) 11. Bxh6.",
        "9... Bxe6": "The right move.",
        "10. Nf5": "White is trying to open lines against the black king.",
        "10... Nf7": "Black goes into a defensive shell.  The problem is that black lacks space.  This means that white will be able to make threats that black will eventually be unable to respond to.  The important thing is to trust in the space advantage and not do anything rash.  You don't have to hurry in positions like this.",
        "11. c4": "Seizing more space.",
        "11... Nd7 12. d5": "Again with the idea of grabbing space.",
        "12... Bxf5": "Forced.",
        "13. Rxf5": "13. exf5 was also good, perhaps better.",
        "13... cxd5 14. exd5": "The pawns on d6, f6 and g5 really limit the bishop on f8.  Its counterpart on c1 is free to roam.  This is a big advantage for white.  Notice also that only the black h-pawn is on a white square.  White's pieces are free to settle on white squares in black's terrotory without having to worry about pawns driving them away.",
        "14... Qe7 15. Nc3": "White wants to complete his development, because the structural flaws in black's game are not going away anytime soon.",
        "15... Nh6 16. Rf1": "White doesn't want to allow f6-f5 followed by Bf8-g7.",
        "16... Kd8": "This was not absolutely necessary, because the threat of Re1 is always answered by Ne5.",
        "17. Nb5": "The white squares on the queenside are equally weak, so black will find no shelter there.",
        "17... Nc5": "The knight belongs on e5.",
        "18. Re1": "Taking advantage of the lapse to take over the e-file.",
        "18... Qf7 19. Be3": "The bishop is heading for d4.",
        "19... Nxd3": "This loses material and is positionally flawed as well.  The knight on c5 was a better piece than the bishop on d3.",
        "20. Bxb6+": "An in-between move that wins a pawn.",
        "20... Kd7 21. Qxd3": "White is now up material as well as still enjoying a lead in development and a spatial advantage.",
        "21... a4": "This allows black to play b2-b4 and eventually c4-c5. 21. ...f5 was to be prefered.",
        "22. b4": "The b-pawn will support the c-pawn's advance.",
        "22... Qg6": "Black offers the queen trade, but why open the h-file for black?  It would just help him untangle his kingside pieces.",
        "23. Qe3": "White doesn't mind trading down into an ending, however.  The extra pawn, which is soon to become passed, will be decisive.",
        "23... Re8 24. Qxe8+ Qxe8 25. Rxe8 Kxe8": "The reduction in material has not eased black's defensive task.  The c-pawn is going to cruise to its queening square.",
        "26. c5": "Creating a passed pawn on the c-file no matter what black does.",
        "26... dxc5 27. bxc5": "The c-pawn's advance can only be stopped by additional loss of material.",
        "27... Nf7": "The manuever, N-h6, f7, h6, f7 was not a successful one.",
        "28. Re1+": "Activating white's last undeveloped piece.",
        "28... Ne5 29. c6": "The pawn marches on.",
        "29... Ke7 30. Na7": "Controlling the queening square.",
        "30... Kd6 31. c7": " 1-0 It will cost black a rook to stop the pawn now.  Notice how the black rook and bishop are on their original squares.   Minimize your pawn moves until all the pieces are developed."
    },
    "url": "https://gameknot.com/annotation.pl/ic-dogs-team-1-mini-tournament?gm=2537",
    "gameName": "IC DOGS Team 1 Mini Tournament",
    "players": "yellowlab (1825) vs. yaashuu13 (1236)",
    "opening": "Pirc defence (B07)"
}