{
    "moves": {
        "1. e4": "hello everyone, and today I will annotate a game I played on the ICC( I must say, Gameknot is much better for correspondence)against a computer called \"BethO\". The computer was rated 1749 ICC, which is around 150 points from USCF. My ICC rating at the time was a low 1500. Now it is a low 1600. I just take it easy when playing on ICC, and don't play seriously. But anyways, the time control is very slow, and in the opening I prepared an unsound gambit(if you think not, please say so) that the computer, as I predicted, just couldn't resist.",
        "1... e5 2. Nf3 Nf6": "the petrov's defence. ",
        "3. d4": "I had looked at this line a bit, but never really studied it and prepared against it. ",
        "3... exd4 4. e5": "intermediate move.",
        "4... Nd5 5. c4": "rash pawn advance, kicking my knight one more time.",
        "5... Nb6 6. Qxd4 Nc6": "I just gain a tempo on the queen. ",
        "7. Qe4 d5": "I had prepared this nice unsound gambit in 10 minutes of my time. Computers, greedy as they are, will take almost any material as long as they think there are no tactical strings attached.",
        "8. exd6 e.p.+": "with check.",
        "8... Be6 9. dxc7": "here I gain a development advantage, but I'm sure CP still has advantage.",
        "9... Qxc7 10. Ng5": "moving a piece twice, threatening to win a pawn. If white had got his pieces out, I probably wouldn't get enough for the pawn, but here I do.",
        "10... O-O-O": "pawn down already, another one won't matter.",
        "11. Nxe6 fxe6 12. Qxe6+ Kb8": "Here, the imbalance of development vs. material is huge. I am playing a true sack here because I get no immediate material as in a \"fake\" sack. I am relying on my development and initiative to go for the king, but the queen or a couple of pieces is good too.",
        "13. Nd2": "Well, now I start getting my army out with threats to the queen.",
        "13... Bd6": "threat to the queen: Re8",
        "14. Be2 Rhe8": "my full army is developed, for just 2 pawns. However, to open up the position even more (!!!) I sack more material!",
        "15. Qg4 h5": "if the queen takes, then Nd4 gives black the decisive advantage.",
        "16. Qh4 g5": "now the queen is forced to leave the 4th rank. It takes a pawn though.",
        "17. Qxg5 Nd4": "now the bishop is lost.",
        "18. O-O Nxe2+ 19. Kh1": "and material is suddenly=, but my development confers a decisive advantage.",
        "19... Reg8": "offering up another pawn. Here, in this position, my pawns are just blocking my rook's files leading to the white king. Getting rid of them will assure me of a decisive attack.",
        "20. Qb5": "now there is a forced win for me.",
        "20... Rxg2": "threatening Rxh2ch with mate to follow.",
        "21. Kxg2 Qg7+ 22. Kh1": "if the king comes out, white is dead too.",
        "22... Rg8 23. Qe8+": "staving off mate for as long as possible",
        "23... Rxe8 24. Rd1 Rg8": "mate is unavoidable.",
        "25. Ne4 Qg2#": "good game? gambit unsound? please comment on this."
    },
    "url": "https://gameknot.com/annotation.pl/icc-slow-game-ratings-are-uscf?gm=33129",
    "gameName": "ICC slow game(ratings are USCF)",
    "players": "Computer (1600) vs. chessboard12 (1700)",
    "opening": "Petrov (C43), modern attack, main line"
}