{
    "moves": {
        "1. e4": "Always.  Always 1. e4",
        "1... c6": "Caro-Kann",
        "2. Ne2": "My own personal favorite, having experimented with the advance variation, with the Panov-Botvinnik attack, and even 2. Nf3 d5 3. Nc3!?",
        "2... d5 3. e5": "Just like the standard advance variation.",
        "3... Bf5": "To stop e6, a pawn sacrifice that can powerfully shut down the queenside and open up the h5-e8 diagonal in many situations.  This is the most common move.",
        "4. Ng3": "Ok.  White's idea is to keep the f-pawn open.  One idea for white that I did not follow is: 4. Nd4!? Bg6 5. f4 e6 6. g4 h7 (Be4? 7. Rg1 with d3 to come) and the question becomes whether the e6 breakthrough will be worth the trouble of the knight being kicked with a timely c5.  Alternatively trying for the pawn sacrifice with 5. e5!? is somewhat less convincing because the bishop controls the diagonal to the king and has moved out of the queenside.  Furthermore, the knight on d4 hinders the often useful control of e5 for white, making the counter-sac or potentially supported push e5 desirable and freeing at some point.",
        "4... Bg6": "The only consistent response.",
        "5. f4": "5. e4 puts us right back in more mainline channels.  5. e6 was possible, with d4 to follow.  It seems far less convincing here because, again, the bishop is not hindered and covers the important kingside light-squares.",
        "5... e6": "Not 5...h7?! 6. f5! Bh7 7. e6 fxe6? 8. Qh5+ (8. fxe6!?) Kd7 (8...g6 9. fxg6 Nf6? 10. g7+!, winning a rook) 9. fxe6+, where black's King will find itself in a good deal of trouble.",
        "6. d4": "Now, white sees that it is most correct to insist on classical lines of play.",
        "6... h6": "?  Black has already taken precautions to safeguard his bishop (5...e6).  This loses crucial time.  Instead, 6...Nd7 or 6...c5 look to be dynamically equal for black.",
        "7. Bd3": "White is happy to trade off black's \"bad\" bishop for his good one, as this will win him time.  The DSB is outside the pawn chain anyway, and has moved twice already, not counting the h6 move that made more space for him.  Thematic and good.",
        "7... Bxd3 8. Qxd3 Bb4+": "? A very bad move.  Black's idea was to get this bishop out with time, possibly finding some squares of activity on the queenside before c3 removes all of its options except e7.  However, this move can still be answered by...",
        "9. c3": "Obvious and good.  This move stops black from winning time and asks it where it's going.",
        "9... Ba5": "?! Stubbornly consistent and bad.  We shall see that black's bishop was sorely missed from the kingside.  Relatively best was 9...Be7, but white's space and time advantages should give him a good edge.",
        "10. O-O": "It's certainly possible for white to keep his options open with a move like 10. Be3, preparing a queenside castle.  Nevertheless, this move aims to quickly punish black for his sloth in the opening.",
        "10... Ne7": "?  More mistakes.  I think black was forced to play 10...g6 here, with an obviously grim defensive task in store.  White should probably just mobilize his forces with Be3 and Nd2 after g6, hoping to exploit the weak dark squares later.",
        "11. f5": "White, ahead in king safety, space, and development, looks to bust things open.  Obvious and good.",
        "11... exf5": "?! The f-file is coming open no matter what, but maybe this was black's last chance to castle.  White should then refrain from fxe6, and instead develop his back rank.  Here, white just has too much play, and the black king too few defenders.",
        "12. Nxf5 O-O": "?  Black is probably losing on any move, but this is convincingly crushed immediately.  On 12...Nxf5 13. Nxf5 0-0, white has the strong rook lift with Rf3 or Qh5 and Bxh6 in store.  If white stays in the center with his king, say 13...Qe7, White can just marshall his pieces for a timely e6.  Even Re1 immediately (not waiting to slide the a-rook over) looks strong.",
        "13. Bxh6": "Owch.  ",
        "13... gxh6": "Well, what else was there to try? 13...Nxf5 14. Rxf5 gxh6? 15. Qg3+ Followed by Rf6 and (if necessary) Qh4.  And if not gxh6, white has comfortably won a pawn that defends black's exposed king.",
        "14. Nxh6+ Kh8": "14...Kg7 is harder to crack, but with the black king so exposed, white has all the time in the world and may even just consider Nf5+ followed by Rf3 (Nxf5? Rxf5!).  ",
        "15. Qh3": "Also convincing is Nf7+, not only winning the exchange but also bringing White's rook to the powerful seventh rank.",
        "15... Ng6": "What else can black try?  This at least hopes to interpose Qh4.",
        "16. Rf6": "Highlighting black's helplessness.  Nxf7++ also wins; the queen cannot interpose as the knight is also checking.  The text stops black from entertaining any hopes of f6, and also blocks the black queen's defense.",
        "16... Kg7": "On any queen move (to avoid the fork), black falls on his sword by Nxf7++ and Qh8(6) mate.",
        "17. Nf5+": "Ruthless.",
        "17... Kg8 18. Qh6": "Black is helpless. 1-0."
    },
    "url": "https://gameknot.com/annotation.pl/icc-game?gm=43377",
    "gameName": "ICC game",
    "players": "Me (1378) vs. Someone else (1360)",
    "opening": "Caro-Kann defence (B10)"
}