{
    "moves": {
        "1. d4": "en résume, manque de travail global, faiblesse sur  la visualisation, faiblesse en pré-finale___en points positif, l'ouverture ça va pas mal, milieu de partie, j'ai eu un plan et finale et bien ça va pas trop mal non plus.___rien d'extra mais ça tient.",
        "1... Nf6 2. e3 d5 3. Bd3": "je suis déjà hors théorie___car que ce passerait-il sur  3...Bg4_4.f3 Bh5_5.g4 Bg6_6.Bxg6 hxg6 et ça devient complexe___ou 3...Bg4_4.f4 (mais là je retombe dans le stonewall)",
        "3... e6 4. f4 Nbd7 5. Nf3 h6 6. O-O Be7 7. Ne5": "et je reviens sur la théorie que je connais. En bilan pour l'ouverture c'est ok donc pas besoin de travailler cette partie du jeu pour le moment.",
        "7... Nxe5 8. fxe5 Ne4 9. Qf3": "un tournant de la partie, je crois avoir l'avantage vu que je vais prendre un pion",
        "9... O-O 10. Bxe4 dxe4 11. Qxe4 Qd5": "je crois que faire l'échange de dame n'est pas à mon avantage mais je n'ai pas confiance en moi pour oser jouer sans l'échange\n",
        "12. Qxd5 exd5": "C'est un tournant à nouveau. Quel plan jouer ? j'ai juste essayé de suivre le principe de faire une menace__l'idee est de jouer 13.Cc3 c6_14.e4 pour plomber son centre___ensuite j'ai l'option de jouer Cb5-d6 pour occuper un super avant-poste et si il y a échange d'avoir un beau pion passé en d6 (que j'espère pouvoir soutenir mais je n'ai réussi à bien voir, mais je vais tenter ça).",
        "13. Nc3 c6 14. e4 Be6": "\n",
        "15. exd5 cxd5 16. Nb5 a6 17. Nd6": "le plan se passe comme prévu, cool",
        "17... Bxd6 18. exd6 Rac8 19. c3 b5 20. Bd2": "peut-etre mieux 20.Bf4 b4_21.Rc1___ça faisait quelques coups que je me demandais où j'allais mettre ce fou, et bien je n'ai pas trouvé de réponse :-)\n",
        "20... Rce8 21. Rae1 Bd7 22. Re7": "c'est le coup que je suis content d avoir joue.______22.Re7 Rxe7_23.dxe7 Re8_23.Re1 et hop c'est couvert\n",
        "22... Rxe7 23. dxe7 Re8 24. Re1 Be6": "oups,  c'est balot ça, je vais perdre mon mega pion avancé.___deuxième faiblesse qui apparait, la visualisation\n",
        "25. Re3 Rxe7 26. Rg3": "pas terrible ce coup, j'ai pris un  coup au moral (qui ne va durer que un coup) mais ça m'a bien fait rire aussi sur le  moment son 24...Be6",
        "26... Kh7 27. Re3": "juste pour faire un coup d attente et me recentrer__le moral est revenu, je vais gagner en finale et puis c'est tout",
        "27... g6 28. g4": "Je ne sais pas trop quoi jouer mais avant tout je souhaite que ça bouge pour mettre la pression.___avec 28.g4 je crois que ça va gêner son expansion aile roi.",
        "28... Rd7 29. h3 Rd6 30. Re1": "pour essayer de faire jouer mon fou",
        "30... Kg7 31. Bf4 Rc6 32. Kg2": "mon plan est de monter l eroi pour ouvrir la colonne h ou au moins soutenir contre la poussée f5",
        "32... g5 33. Bd2 f6 34. Kg3 Kf7 35. h4 a5 36. hxg5 hxg5 37. Rf1": "et voilà la colonne h est ouverte pour ma tour et faire un tour en territoire noir. Au passage une petite menace sur g5.",
        "37... Kg6 38. Rh1 Rc7 39. Rh8 Rc8": "pas vu cette possibilité. Et si je recule ça ouvre la possibilité aux noirs de jouer Th8-h4. Donc je vais échanger mais ça me parait impossible d'éviter la nulle après.",
        "40. Rxc8 Bxc8 41. b3": "je n'ai pas de plan. Juste je vais essayer d'ouvrir des lignes avec en visualisation : 41.b3_42.c4 bxc_43.bxc dxc_44.Fxa5",
        "41... f5 42. gxf5+ Kxf5 43. c4 b4 44. cxd5 g4 45. Bf4": "l'idée est de faire le tour et de prendre ses pions a et b",
        "45... Ke4 46. Bc7 Kxd5 47. Bxa5 Kxd4 48. Bxb4 Be6 49. Be7": "voila, le spions a et b noirs ont disparu___le plan maintenant est de couvrir mes pions, avancer mon roi et bloquer g4__je crois donc que 49.Be7 est une première étape pour tout ca",
        "49... Ke4 50. b4 Kf5 51. a3": "mon plan sera de monter le roi vers mes pions__de ne surtout pas perdre le pion b car b8 est une case noir__de rester vigilant au pion g__de rester vigilant au sacrifice de fou sur le pion a",
        "51... Bd7 52. Bd6 Bb5 53. Kf2": "je me rend compte que le roi ne va pas pouvoir monter vers mes pions, son roi va etre plus rapide que le mien pour arriver sur l aile dame",
        "53... Ke4 54. Kg3": "alors j essaye juste de le distraire, au cas ou :-)",
        "54... Kf5": "Mon adversaire propose la nulle. Hors de question que je donne la nulle__je prefere perdre et voir si je connais ou non la technique de finale que de ne pas aller au bout___et puis c est a lui aussi de me montrer qu il connait la technique a utiliser\n",
        "55. Kf2 Ke6": "genial il laisse le champ libre pour mon roi",
        "56. Bb8 Kf5 57. Ke3 Ke6 58. Kd4 Bd7 59. Kc5 Ba4": "la maintenant je crois que c'est mort pour les noirs__je suis vraiment content d'avoir passé du temps sur les finales exactes (il y a des mois de ça maintenant) car je vois l'idée même si je ne sais pas trop comment faire exactement les coups",
        "60. b5 Kd7 61. Kb4 Kc8 62. Bg3 Bd1 63. a4 Kb7 64. a5": "juste à éviter le pat",
        "64... Bf3 65. a6+ Ka8 66. Ka5 Bd5 67. b6 Bb7 68. axb7+ Kxb7 69. Kb5 Ka8 70. Bf2 Kb7 71. Bg1 g3 72. Kc5 Kb8 73. Kc6 Kc8 74. b7+ Kb8 75. Kb6 g2 76. Bh2#": "{Game 165  (mrtoduvet vs. yorugua088) yorugua088 checkmated\n"
    },
    "url": "https://gameknot.com/annotation.pl/icc-internet-chess-club?gm=49091",
    "gameName": "ICC, Internet Chess Club",
    "players": "mrtoduvet (1419) vs. yorugua088 (1316)",
    "opening": "Queen's pawn game (A45)"
}