{
    "moves": {
        "1. e4 e5": "We each started off with a king's pawn opening, ",
        "2. Nf3 Nc6": "After going Nf3, I go Nc6 and hope he does a Ruy Lopez so I can get one step closer to trapping him with the Blackburne Schilling Gambit.",
        "3. c3": "But that didn't happen to be the case.",
        "3... Nf6 4. Bd3 d5": "This is basically a setup for a trade here, which would be executed.",
        "5. exd5 Nxd5": "Pawns were traded and I was to develop from there.",
        "6. g3 Bg4 7. h4": "I never really understood this move here, instead of attacking my bishop he went h4 instead. Strange...",
        "7... Bc5 8. b4 Bxf3 9. Qxf3 O-O": "Well after trading a bishop for a knight, I was an idiot here and forgot my bishop was under attack and castled instead.",
        "10. bxc5": "And if it wasn't obvious already, he took it.",
        "10... b6 11. Be4 Nce7 12. c6 f5 13. Bxd5+ Nxd5 14. d3 Qe7": "Don't ask me why on Earth I moved my queen here. It eventually ended up....",
        "15. Qxd5+": "That I was stuck with two rooks and a queen for the rest of the game. Yep, that's how blind I am.",
        "15... Kh8": "Was it wise to corner my king here?",
        "16. Bg5 Rfd8": "When the bishop attacked my queen, I mistakenly decided to attack his queen also, offering a trade, but then I realized too late that I had basically pinned myself. If that queen were to move to safety, I lose a rook.",
        "17. Qc4 b5 18. Qxb5 Rab8": "So I just kept attacking his queen until he gave out.",
        "19. Qc4 Qe8 20. Bxd8": "Well he didn't give out (why would he to be honest) and took my rook.",
        "20... Rxd8": "It was now peril for me as I was 9 points down, by two knights and a rook.",
        "21. h5 Rd6 22. Qb5 Rxc6 23. Kd2 e4 24. d4 a6 25. Qb4 Rb6": "I just tried to keep attacking his queen until it was trapped.",
        "26. Qc4 Rb2+": "Eventually I put some pressure on him with check.",
        "27. Ke3 Qe7 28. d5 Qg5+": "Now he only has one move here, and that is to go Kd4.",
        "29. Kd4": "Had I gone Qf6+, I could've drawn by three move repetition. But I'm not that type of person.",
        "29... Rxf2": "Decided to start taking pieces instead",
        "30. Qxc7 h6 31. Qc8+ Kh7 32. Qxa6": "After taking my pawn, the chance for a draw was gone.",
        "32... Qxg3": "This may have been a huge mistake on my part, because now he just won a queen.",
        "33. Qg6+": "He won my queen no matter what, so it would be sensible to trade here... right?",
        "33... Qxg6": "Right.",
        "34. hxg6+ Kxg6 35. Ke3 Rf3+": "Now I started to push his king to the last row, and push for promotion myself.",
        "36. Ke2 f4 37. Na3 Re3+ 38. Kf2 Rxc3 39. d6": "Now I was astonished at his decision to push for promotion! I just won a knight!",
        "39... Rxa3 40. Rac1": "Don't understand why he didn't go Rac2 here, could've saved the pawn and gotten promotion (if I had decided to save the rook), or won a rook.",
        "40... Rxa2+ 41. Kg1 Rd2 42. Rh2": "I'm pretty sure he regrets this decision to attack my rook.",
        "42... Rxd6": "Now he's stuck with two rooks for the rest of the game. Let's see how he pulls this one out.",
        "43. Rhc2 Kf5 44. Rc2c5+ Kg4 45. Rc1c4": "His only hope was to attack my pawns, to prevent a promotion for me.",
        "45... Kf3": "I just kept preventing him from taking pawns.",
        "46. Re5 e3 47. Re7 g5 48. Rce4 Kg3 49. Kf1": "I was kind of mad that he didn't go Kh1, then it would've been mate since I would've gone Rd1.",
        "49... Rd3": "Protection is key.",
        "50. Rh7": "He's starting to attack pawns now.",
        "50... Kf3": "I attack his rook.",
        "51. Rxh6": "NOW THIS IS WHAT COST HIM THE MATCH. Number one, he didn't protect that rook on e4. Number two, his king can't go forward. Number three, should've gone Kg1 to save himself. He took a lame pawn instead.",
        "51... Rd1#": "Checkmate. #IceInMyVeins"
    },
    "url": "https://gameknot.com/annotation.pl/ice-in-my-veins?gm=62452",
    "gameName": "Ice in My Veins",
    "players": "hj8317 (1132) vs. adiat2001 (936)",
    "opening": "Ponziani (C44), Jaenisch counter-attack"
}