{
    "moves": {
        "1. e4": "I've known Bob for a few years now, yet I'd only faced him over the board one other time: in the last round of my first tournament at the Illowa Chess Club in December 2001. (For those who don't know, Bob is the proprietor of the chess publishing & distribution company, ChessCo.  www.chessco.com)  Since he thrashed me during that first encounter (and since I've learned a thing or two since my days of pushing wood in the Class H section), I was happy to finally get the chance to redeem myself. Having played Bob only once (and that almost two years ago), I really wasn't sure what opening he played, so I asked a friend of mine what I should expect. Knowing my penchant for king-pawn openings, he told me Bob was fan of the French. This put me at ease a little since I've had good results against the French in past tournament play, but then, before I could finish my thought, my friend added, \"I think he's even written a book or two about it.\" Great. I knew I was in for a battle, but I was determined to make the best move against my formidable opponent, who isn't just one of the biggest chess proprietors in the nation, but also has a knowledge of opening theory that puts the little experience I have to shame. (Plus, I suffer from an affliction I like to call \"acute tactical glaucoma\", so I knew I needed to take my time.) I didn't always make the best move, but luckily for me Bob had a few inaccuracies of his own I was able to capitalize on and come out on top. ",
        "1... e6": "The French. Or, as some over-zealous Americans might now call it, \"The Freedom Defense.\"  I hate this opening.\r\n",
        "2. d4 d5 3. Nc3 Bb4 4. e5 c5 5. Nf3": "Bob doesn't like this move for some mysterious reason, but I'm not convinced it's too bad.",
        "5... Nc6 6. Bb5 Nge7 7. O-O Qa5 8. Bxc6+ Nxc6 9. Ne2": "Passive, but black is seriously undermining my center pawns and I thought this was the best way to deal with the threats. After I play c3, one of my knights will have a good home on d4. ",
        "9... cxd4 10. Nexd4 Qd8 11. c3 Be7 12. Qe2": "Here I didn't have a clear plan. I just wanted to get my queen to the e-file so if black plays ...f6 to open up the f-file for his rook I can undermine his e-pawn. ",
        "12... a6 13. Bd2": "13.Bf4 might be better here, but again, I had almost no idea what to do at this point.",
        "13... Qb6 14. Bg5": "?  Bad. Very bad. This awful move allows black to win a pawn.",
        "14... Bxg5": "Black needed to take with the knight first (threatening my queen) if he wanted that pawn. [14...Nxd4 15.cxd4 Bxg5 16.Nxg5 Qxd4] ",
        "15. Nxc6 Bh6 16. Ncd4": "Whew! That was a close one. Now I'm right back to where I want to be. \r\n",
        "16... O-O 17. Rfd1": "I thought the d-file might eventually open up -- and I wanted to avoid trading my good knight for black's bad bishop after the maneuver ...Bd7 and ...Bb5 -- so I thought it would be a good idea to take control of the half-open file. Though I may have moved the wrong rook since the play is all on the kingside, black's pawns and bishop are pointing at my queenside and I didn't want to start dropping pawns over there. \r\n",
        "17... Bd7 18. Rab1 Rac8 19. h3": "I want to get my other knight more actively placed on g4. And besides, giving your king a little breathing room is always a good idea to avoid those pesky back-rank mates. I had considered (albeit briefly) playing 19.g4, threatening to win his bishop by 20.g5, but after 19...g6 and 20...Bg7, my e-pawn will have to go because I don't have the time or resources to defend it. \r\n",
        "19... f6 20. Kh1": "I want to eventually push my f-pawn to defend his cohort on the e-file, but I wanted to avoid the nasty pin on my knight by her majesty on b6. \r\n",
        "20... Be8 21. Nh2 Bg6 22. Rba1": "I didn't like having to do this. ",
        "22... fxe5 23. Qxe5 Rxf2": "?!  I thought this was a bit too greedy, but nevertheless, this is the critical point of the game -- where accuracy is absolutely essential. Both of us have threats and I wasn't sure either of us could carry out our plans without taking a tempo or two for defense, but now my knight springs back into the game after a brief hiatus on h2. [After >=23...Rce8 24.Ng4 Bf4-/  black clearly has the upper hand.] \r\n",
        "24. Ng4": " /=  I was really happy to get my knight back into the fracas, but 24...Bf4 had me worried. \r\n",
        "24... Rxb2": "GM Jonathan Rowson might call this \"blinking.\" Black relinqueshes control of the only open file to snatch a pawn on the side of the board where nothing is happening or needs to happen. The play is all on the kingside. [Instead, if >=24...Rf7 25.Qxe6 Qxe6 26.Nxe6 Re8 27.Nxh6  gxh6= it's anybody's game.] \r\n",
        "25. Nxe6": " /-  I had seriously considered taking with the queen (with check), but I wanted to get material back by grabbing his d-pawn, simultaneously threatening a discovered check. Glad I didn't! Little did I realize that after Nxe6 white has almost a forced win. Black doesn't have sufficient time (or piece placement) to prevent Nxh6  followed by Qg7 mate, so he's forced to take drastic measures. Sometimes God grants little favors..... \r\n",
        "25... Kf7 26. Rdf1+": "This is why taking the rook off the f-file was a mistake.",
        "26... Ke7 27. Nc5+": "And here black resigned in view of 27...Kd8 28.Rf8  Be8 29.Rxe8#, or the even less attractive alternative 27...Qe6 28.Qxe6  Kd8 29.Qd7#."
    },
    "url": "https://gameknot.com/annotation.pl/illowa-cc-october-swiss?gm=2254",
    "gameName": "Illowa CC October Swiss",
    "players": "Matt Nemmers (1617) vs. Bob Long (1800)",
    "opening": "French (C17), Winawer, advance variation"
}