{
    "moves": {
        "1. e4": "A Mini-tournament game, I'm playing white and, you guessed it, I start with the Open Game.",
        "1... e6 2. d4": "My opponent, however, didn't want too much openness evidently, since he chose the French Defense.",
        "2... d5 3. Nc3 Nf6 4. Bg5": "My favorite French trick, though I never get to pull it off, is to follow 4. Bg5 with 5. e5 and win a knight. Black never seems to let me do it though. I blame the GK DB... Nevertheless, it's a good way to develop a piece, with a threat, and it nearly forces black's reply.",
        "4... Be7 5. e5 Nfd7 6. Bxe7 Qxe7 7. f4": "And now black is getting in his own way, with his knight on d7 blocking his LSB. But of course, anyone playing the French very often knows to expect a little cramping.",
        "7... a6 8. Nf3 c5 9. Qd2 Nc6 10. O-O-O": "Developing moves by both sides.",
        "10... c4 11. f5": "Time to poke the bear, see if he growls. The pawn on f5 is not protected, and can be freely captured, but white will reply with 12. Nxd5 threatening 13. Nc7+ and 14 Nxa8.",
        "11... Nb6 12. fxe6": "The e6 pawn is, in my opinion, the lynch pin of the French. So he dies, though black can replace him quickly enough if he chooses.",
        "12... Bxe6 13. g3": "The long diagonal looks good for white's LSB.",
        "13... h6 14. h3": "Preventing the pin by keeping the black bishop off of g4.",
        "14... Nd7 15. Bg2 b5 16. Nh4": "Planning to go to f5, though white is about to get sidetracked and it will take 6 moves to get this knight to f5.",
        "16... Nb6 17. Ne2": "Sidetrack. This knight wants to whelm upon the black bishop on e6.",
        "17... b4 18. Nf4 O-O-O 19. Nxe6 Qxe6 20. Rhf1": "Cogitating and cogitating. How white dearly would love to get his LSB on the h3-c8 diagonal and skewer the black queen to her king, but I could not find the way to force it to happen. Though, if I had not played 16. Nh4, the way would be open for 20. H4 threatening 21. Bh3. Not that I think that would have worked, and it's even less likely as a three-move combo. So, instead, white launches a mini-campaign against black's kingside pawns.",
        "20... Na4 21. Qf2": "This feels wrong, or at least dangerous, to hunt pawns on the kingside while black is forming a powerful queenside attack. White's king may find himself in jeopardy, risking the loss of the game, while black is risking only the loss of pawns - quite an imbalance of risks.",
        "21... Rhf8 22. Nf5": "The immediate threat is to black's pawn on g7. But white is also threatening Nd6+ which puts three white pieces on the black pawn on f7.",
        "22... Qg6 23. h4": "White may be trying to do too much. This move threatens both h5 and Bh3, each of which creates problems for black. It might, however, have been simpler to just start with 23. Nd6+, offering to trade knight+pawn for rook, else winning the f7 pawn outright.",
        "23... Kb8 24. Qf4": "Black solved the threat of Nd6+, so white puts more pressure on black's king. Funny how a kingside pawn hunt turned into a harassment of black's king, way over on the queenside.",
        "24... b3 25. axb3": "Black ignores the danger to his king, or more accurately, the danger to his other pieces that begins with a discovered check against his king, and launches an attack of his own. White must deal with the advanced black pawns before continuing with his own attack.",
        "25... cxb3 26. Rd3": "26. Rd3 pretty much forces black's next move, and 26. ... bxc2 effectively neutralizes black's advanced pawn until he can get more pieces into the attack. All of which gives white time to pounce.",
        "26... bxc2 27. e6+": "Put an ! on this move. 27. e6+! took a long time for me to work out, to figure out that all the angles were safe. With a combination of Qc7 and Rb3, white has several mating threats that black must carefully avoid. 27. ... Ka8 buys him the most time, but then he immediately loses material with 28. e7. White's pawn forks the two rooks, so 28. ... Nxe7 is forced, after which white plays 29. Nxe7 winning black's knight and threatening the black queen. 29. ... Qb6 blunts white's mating attacks but creates new problems after white plays 30. b3 and the black knight has nowhere to run. But any other queen move leaves black dangerously vulnerable to white's mating threats. And white still holds Qe5, forking the d5 and g7 pawns to win another pawn. Faced with all the threats, black chose to resign."
    },
    "url": "https://gameknot.com/annotation.pl/imbalance-of-risks?gm=23054",
    "gameName": "Imbalance of Risks",
    "players": "blake84120 (1897) vs. renatodefrias (1654)",
    "opening": "French (C14), classical, Steinitz variation"
}