{
    "moves": {
        "1. c4": "Hi everyone!  I have been watching a very interesting game played by my mentor, Ionadowman against a strong 1700  player.  Ion won this game by creating an imbalance through a brilliant counter sacrifice on h4 which caused his advanced pawns to break through to queen.  I really need to develop this part of my game.  The only time I have sacrificed material on gameknot is when I am already heavily up in material and I have done this to stamp out any remnants of counterplay by my opponent.  This is something altogether different.  I hope I can learn something from this.",
        "1... e5 2. g3 d6 3. Bg2 f5": "3. ...................... f5 - in response to The English Opening Ion decides to expand on the kingside.  Maybe there are possibilities of a kingside attack but black must be very watchful of action down The Fool's Mate Diagonal, particularly from the enemy queen in the opening.\r\n\r\nThis formation is his favorite response to the English Opening. Having had some affinity with the Dutch Defence, this is a very aggressive line. A good example of the way the game can develop is cormel vs ionadowman, played a couple of years ago. \r\n",
        "4. Nc3 Nf6 5. Nf3": "5. Nf3 -  natural square for the king knight.  However it could be driven back by e4 which would put a cramping effect on white's game.  However, Ion opts for clearing wood off the back rank first and preparing for castling with 5. ............... Be7.",
        "5... Be7 6. O-O O-O 7. d3 c6 8. b4": "8. b4 - white decides to expand on the queenside and prepares a fianchetto on b2 hitting indirectly at the g7 square.  Ion now develops his queen knight, temporarily blocking in his lsb, but I do not think his opponent can take advantage of this. I suppose if Ion plays Be6 before Nd7 then white can play his knight to g5 and if the bishop goes to f7 it will be swapped off.  Mind you, in closed positions knights can be better than bishops.\r\n\r\nIon stated that this is the beginning of a strategic dichotomy: White bases his chances on Q-side play; Black aims directly at White's King. Both side have chances. Although I like Black's game, I would have no objection to playing the White pieces in this sort of position.\r\n",
        "8... Nbd7 9. a4": "9. a4 - impressive looking wall of pawns on the queenside.",
        "9... Qe8 10. Bb2 Qh5": "10. ......... Qh5 - Ion goes on the aggressive, queen out to h5 to put some pressure on the white castled position.  A pawn storm will now follow.",
        "11. e3 g5": "11. ......... g5 - here it comes!",
        "12. Nd2 Qg6": "12. ......... Qg6 - the black queen retreats giving her other half some cover but bearing down on the g2 square.  Ion has an equally impressive wall of pawns on the kingside.",
        "13. h3 g4 14. h4": "14. h4! - eschewing an exchange because white wants to lock up the position and keep the h file closed especially to Ion's heavies.  Ion now tries to break through with f4.  Some wood is about to be exchanged for the first time in 15 moves!",
        "14... f4 15. Be4 Nxe4 16. Ndxe4 f3": "16. ......... f3 - hmm, puts a bit of a clamp on white's kingside position but then that could be a case of Too Many Cooks Spoil The Broth as far as direct mating chances go.  Ion's queen will need to take her own pawns to get through here and that is illegal!!  Ion's king is looking just a little draughty but his opponent will not be able to take advantage of this.",
        "17. d4 Qh6": "17. .......... Qh6 - threatening to bust open white's position with a dsb sacrifice on h4.  Suddenly it is looking very nasty for white who was just adding to his impressive pawn formation on the queenside.  Now white tries to counter down the centre files by exchanging d pawn for e pawn.",
        "18. dxe5 Nxe5 19. c5 d5 20. Nxd5 cxd5 21. Qxd5+": "21. Qxd5  - here we have it, a queen fork on d5, but black can get out of it by moving the knight out of the firing line and blocking the queen check.  White is a piece for two pawns to the bad but his queen is eyeing up Ion's open castled position.  Another thing.  White has a well supported passer on e3.  On the whole I would say that black has a slight advantage here.",
        "21... Nf7 22. Qd4": "22. Qd4 - just a little deterrent here.  Should Ion's queen stray away from the protection of g7 then he cops Old Matey.  Note that the knight on f7 is covering h8.  This may sound an obvious thing to state but I have delivered a couple of OTB mates with precisely this sort of line up!",
        "22... Rd8 23. Qc3": "23. Qc3 - still staying trained on g7 and h8.",
        "23... Bf5 24. Nf6+ Bxf6 25. Qxf6 Qxf6 26. Bxf6 Rde8": "26. ............... Re8 - over the last few moves there has been a plethora of exchanges.  Suddenly all thoughts of direct mating attacks have gone caput.  The material balance remains the same but white has a healthy pawn majority on both sides of the board.  Remember, if the material count stays the same with nearly all the pawns, the major pieces and one set of minor pieces swapped off the game may well be drawn.  Note - king and minor piece cannot mate lone king, 2 pawns are 2 potential queens which can quite easily mate a bare king.",
        "27. Rfd1 Re6 28. Bd4 Be4 29. b5": "29. b5 - onward Christian Soldiers!",
        "29... Rd8 30. Rd2 Nh6 31. Bc3 Rxd2 32. Bxd2": "32. Bxd2 - one pair of rooks have been swapped off.  Yes, I think white's plan is as per my earlier note.  But Ion foils it.  Let's see how.",
        "32... Nf5 33. Kf1 Kf7 34. Ke1": "34. Ke1 - both kings centralise themselves as this is now an endgame.  Ion now has a big, big surprise up his sleeve.  He is about to serve up one of his specialities .............. wait for it ...............",
        "34... Nxh4 35. gxh4 Rh6": "35. ................ Rh6 ........................ IMBALANCES!!!  Yes, Ion has sacrificed his knight for two pawns restoring the material count as the white h pawn cannot be saved.  White plays 36. Bc3 to protect his rook against a threatened skewer when black takes off the h pawn.  The black pawns on the kingside are now going to be a menace.\r\n\r\nIon stated that \"Black's 34th came as a surprise even to me - and I played it! Fact is, I was about to play something like 34...Ke7 and happened, rather idly, to glance at 34...Nxg3. Of course that move is quickly seen as hopeless, but suddenly the alternate capture came to mind, with the rook follow-up (as played). Clearly White's h-pawn cannot be protected, Black establishes a mobile majority of his own on the K-flank, and White has a possible skewer (...Rh1) to attend to. Such were the consequences of White's 34th move. The whole game is transformed. Good enough for me!\"\r\n",
        "36. Bc3 Rxh4 37. Kd1 Rh1+ 38. Kd2 Rh2 39. Ke1": "39. Ke1 - forced - the f pawn must be defended.",
        "39... g3": "39 ..................... g3!!! This move, however, forces resignation on the grounds of ruinous loss of material.  In fact if white takes the b pawn then Ion's rook on h2 will be an absolute bone in the throat!  Next move Ion will play f2 followed by Bg2 then f1/Q.  Not only will white be a whole queen down but Old Matey is not far away.  Well played Ion!  - Joanne\r\n\r\nIon stated that \"Some more detailed annotation is called for in this sequence, which contains errors on both sides. *A* At the beginning of this sequence, 36.Bc3 is not a mistake exactly (the move protects the rook on a1), but White could have continued 36.Ba5 Rxh4 37.Rd1 Rh1  38.Kd2 Rh2 (38...Rxd1  is also possible) 39.Ke1 g3 40.fxg3 Re2  41.Kf1 Bf5! 42.Kg1 Rg2  43.Kh1 Be4! wins for Black. *B* Instead of 37.Kd1 White might have improved a little with 37.Rd1 Rh1  38.Kd2, but White does have this remarkable resource: 38...Rxd1  39.Kxd1 Bc2 !! If White takes 40.Kxc2 g3! is curtains, but 40.Kd2 Bxa4 though it looks very good for Black, keeps White in the game. *C* Black should have played (instead of 37...Rh1 ?!) 37...g3! 38.fxg3 Rh1  39.Kd2 Bb1!! and the f-pawn can't be stopped even after 40.Rxb1 Rxb1. *D* Finally, White might have prolonged his resistance by 39.Bd4 or Be5, though 39...Rxe2  40.Kc3 Re2 is also winning for Black. \"\r\n"
    },
    "url": "https://gameknot.com/annotation.pl/imbalances-and-sound-sacrifices?gm=17375",
    "gameName": "Imbalances and Sound Sacrifices!",
    "players": "NN (1736) vs. ionadowman (2036)",
    "opening": "English opening (A20)"
}