{
    "moves": {
        "1. e4": "Hi everyone!\n\nYou would never believe that a queen could find herself without a move in a queen and pawn ending, would you?  Well, it happens here.  I will now start this game with the Scandinavian Defense.  I ended up in a similar position against damalfi and went on to lose but here it was a different story.  The Scandinavian (Centre Counter) is the move 1..... d5 in response to e4.  Black brings his/her queen out into the open before any other pieces are developed, but it can be possible to find a safe haven for her on a5.  Anyhow .....",
        "1... d5 2. exd5 Nf6": "3. ..... Nf6 - interesting, black does not recapture but develops a piece.",
        "3. c4 e6 4. dxe6 Bxe6": "4. ..... dxe6 - my 1 pawn advantage is preserved for the nonce but now I need to concentrate on developing my pieces.",
        "5. Nf3 Qe7 6. Qe2": "6. Qe2 - this move is recommended in the database but I am not altogether comfortable with it.  In fact, Fou Leblanc stays on f1 for a good part of the middlegame and Henry gets some rather hairy moments.",
        "6... Nc6 7. d4 O-O-O 8. Be3": "8. Be3 - funnily enough d5 is not recommended in the db, maybe because Henry is still caught in the centre and there is a potential for a really nasty pin from a black rook on the e column - and Glenda is right in front of Henry.  I must get my pieces out as quickly as possible and then move Henry to safety.",
        "8... Bf5 9. Nc3 Ne4 10. Nxe4 Bxe4": "10. ...... Bxe4 - knight trade.",
        "11. a3 Qd7 12. d5": "12. d5 - only now is this move played.  Funnily enough this very weak and vulnerable pawn stays on this square for the remaining part of the game.  I am toying with the prospect of putting Henry on the kingside and mounting a queenside mating attack.",
        "12... Na5 13. Nd2 Bc2 14. b4": "14. b4 - I now make that queen knight do the Hip Hop Beat!  It moves to b3 but I take the opportunity to trade knights - maxim, if material up (piece or less) exchange pieces rather than pawns to ensure that endgame win!",
        "14... Nb3 15. Nxb3 Bxb3 16. Qb2 Qa4": "16. ..... Qa4 - the appearance of the Wicked Witch of the West dissuades me in my quest to launch that queenside mating attack.  I now concentrate on Plan B.  Get Henry to safety on the kingside.",
        "17. Be2": "17. Be2 - at last Fou Leblanc moves and now Henry can castle which he finally does next move.",
        "17... Kb8 18. O-O f6 19. Bd1 Bxd1 20. Rfxd1": "20. Rfxd1 - that's another set of minor pieces traded off, but where do I go from here?",
        "20... Bd6 21. Bd4": "21. Bd4 - pressure on black's a1-h8 diagonal perhaps?",
        "21... Rhe8 22. Rde1 Bf4 23. g3 Qd7": "23. ..... Qd7 - the Wicked Witch of the West has a cunning plan.  If I take Pitroque's dsb, then I will concede a Low Draw by allowing Ye Olde Perpetualle due to the open g column.  So, I prevent the Witch from landing on g4 by playing f3.",
        "24. f3 Bh6 25. Qf2": "25. Qf2 - threatening Bxa7+.",
        "25... Qa4 26. Be3 Bxe3 27. Rxe3 Rxe3 28. Qxe3": "28. Qxe3 - just what I want, a plethora of exchanges.  Now it is just the queens and rooks.",
        "28... Re8 29. Qd3": "29. Qd3 - this is Glenda's berth for the remainder of this game.  You would never believe that the Wicked Witch of the West, sitting pretty on a4, is gonna get trapped on such an open board would you?",
        "29... a5": "29. ..... a5?? - here is the blunder.  Now, I thought long and hard as to whether I should take this pawn but then I thought, Hello, I can immobilise the witch right now with ......",
        "30. b5": "30. b5!! - This little pawn move now cuts off the Witch and Glenda finds herself defending some very important squares, a3 for starters and then b3, c2 and the rook and Glenda both defend d1.  Ooops, also c4 I quite forgot!  Then that humble pawn on a3 covers the b4 square.  Hey Ho the Wicked Witch is trapped!!  So, how do I exploit this fact?  Firstly I will exchange the remaining pair of rooks.  I will leave Glenda exactly where she is and then use Henry as a fighting piece.  With me being a pawn up, it will effectively be a won K&P ending.  Henry is already licking his lips at the thought of scoffing his favourite seafood - p(r)awns!",
        "30... b6 31. Kf2": "31. Kf2 - a multi-purpose move.  It gets Henry towards the centre and it prepares that exchange of rooks.",
        "31... g6 32. Re1 Rxe1 33. Kxe1": "33. Kxe1 - Henry has had to retreat to recapture the black rook, but from now on in, The Only Way is Up as far as he is concerned.  Yup, as I type, I am humming that tune by Yazz right now!",
        "33... f5 34. Ke2 Kb7 35. Ke3": "35. Ke3 - Here we go, here we go, here we go!",
        "35... g5 36. f4 g4 37. Kd4 Kc8 38. Ke5": "38. Ke5 - Ravenous Henry is just about to tuck in!",
        "38... Kd7 39. Kxf5 Kd6 40. Kxg4": "40. Kxg4 - two black kingside pawns drop off, yum and double yum says Henry!",
        "40... Kc5 41. f5": "41. f5 - I eschew that black pawn on h7 as I need to keep the Witch boxed in.  Yes, the weak pawn on c4 can be taken but that is not a problem because I calculated that this pawn would be able to reach Glendadom on f8 just in time should Pitroque decide to force an exchange of queens.",
        "41... h5+ 42. Kxh5": "43. Kxh5 - black is playing for a stalemate but alas for him, it's his queen not his king that is stalemated!",
        "42... c6 43. dxc6 Qxc4": "43. .... Qxc4 - black finally decided to exchange queens but before I could take on c4 he hit the resign button!  After allowing my pawn to capture on c6 I can now get two queens on the board to nail the BK.  Black sees this and it is game over, wheew and double wheeew!"
    },
    "url": "https://gameknot.com/annotation.pl/in-a-q-p-ending-the-wicked-witch-of-the-west-is-trapped?gm=50646",
    "gameName": "In a Q & P ending, the Wicked Witch of the West is ............ TRAPPED!!!",
    "players": "jstevens1 (1933) vs. ptitroque (1720)",
    "opening": "Scandinavian (B01), Icelandic gambit"
}