{
    "moves": {
        "1. e4 g6": "1....... g6 - starting the Robatsch Defense - prepares to develop dsb on g7.",
        "2. d4 d5 3. e5 Be6": "3. ....... Be6 - transposing into a Centre Counter (Scandinavian Defence).",
        "4. Nf3 f6 5. exf6 exf6": "5. ........ exf6 (I'm wondering whether this exchange on f6 is wise in retrospect as it gives black a chance to get a pawn roll going - and he does!)",
        "6. Be3 g5": "6. ....... g5 - the pawn roll gets going.",
        "7. h3": "7. h3 - an attempt to stop the roll in it's tracks but I am slowing down the development of my pieces.",
        "7... b6 8. Bd3 a6 9. a3": "9. a3 - in retrospect this move may have been a mistake - it will leave the a pawn vulnerable later on and make my dsb bad - in fact later on my dsb is tied to it until very late on in the game.",
        "9... Bg7 10. Nh2": "10. Nh2 - passive but I thought that the knight might be kicked out of f3 soon so I thought this was the least of 2 evils.  But this knight too stays out of the game until very late.",
        "10... b5 11. Be2": "11. Be2 - to prepare a check on h5 to stop black from castling.  In retrospect I am wondering whether Nd2 was better at this point then if black plays f4 then Nb3.",
        "11... h6 12. Bh5+ Ke7": "12. ....... Ke7 - I prevent the black king from castling, but has it actually achieved anything?",
        "13. Qe2": "13. Qe2 - I set up a potential pin on the e file - black now expands on the kingside.",
        "13... f5 14. c3 Qd6 15. Bc1": "15. Bc1 - in order to develop the knight I have to undevelop my bishop!",
        "15... Nf6 16. Bf3 c6 17. b4 Nbd7": "17. ......... Nbd7 - black now has a huge lead in development.  I now play g3 to screen off the black queen.  Black is better at this point - his pieces have the superior mobility.  His queen knight will become a menace later on.",
        "18. g3 Rhf8 19. Nd2 Ne4 20. Nxe4 fxe4": "20. ...... fxe4 - I would have liked to have kept my queen knight on, especially in the light of what was to follow - the h pawn was hanging though so I kept the bishop and moved it to g2 to defend the h pawn.",
        "21. Bg2 a5 22. Bb2": "22. Bb2 - necessary, so that if pawns are exchanged and the a file is opened up, then one pair of rooks will be exchanged.  Black moves his knight to b6 preparing an invasion on c4.",
        "22... Nb6 23. O-O": "23. 0-0 - On MOVE 23 I castle!!  The black knight now invades on c4 where it stays for the remainder of the game.",
        "23... Nc4 24. g4": "24. g4 - protects the h pawn by screening off the black lsb.  Take a look at this position now.  Which colour would you rather have at this point?",
        "24... a4 25. Rfe1 Rf6": "25. ....... Rf6 - preparing to double rooks on the f file.",
        "26. Ref1 Raf8 27. Bc1 Kd7 28. Be3 Qe7 29. Ra2 Qe8": "29. ......... Qe8 - black has achieved his objective over the last few moves by doubling the rooks.  He now prepares to put his queen on g6 - this I was made to realise later, was to prepare a deadly invasion on d3 or b1 - the queen eventually ends up on b1.",
        "30. Qe1 Qg6 31. Qe2": "31. Qe2 - my position is so bad I am reduced to moving my queen up and down from e1 to e2.  On move 33 I try to relieve the pressure with f3.",
        "31... Ke7 32. Qe1 Rh8 33. f3 h5 34. fxe4 dxe4 35. Rxf6 Bxf6 36. Bc1": "36. Bc1 - forced move - must remove bishop from firing line - there is a threat of a discovery - NxB would lead me to drop a rook or a piece.  Both losses would be ruinous - even against somebody 300 points south of my rating.  The bishop stays on his homesquare right until nearly the end.",
        "36... Bd5 37. Re2": "37. Re2 - moves rook out of firing line and piles up on the e pawn.",
        "37... Ke6 38. Bxe4 Bxe4 39. Rxe4+ Kf7": "39. ........ Kf7 - I win the a pawn and exchange off a pair of bishops, but my position is not enviable by no stretch of the imagination.  I was expecting him to move his king to d5 so that it would be well centralised in the endgame.",
        "40. Re2 h4": "40. ........ h4?! - surprising move.  I was expecting to force an exchange of pawns on g4 and then my hanging h pawn would go.  He has screened off one line of attack on my h pawn!",
        "41. Rf2 Re8 42. Re2 Rxe2 43. Qxe2 Qb1": "43. ........... Qb1 - at long last, after the final pair of rooks are exchanged the black queen finally invades on b1.  It looks as if all my queenside pawns could drop off!!  Yes, it certainly looks as if I might have to kiss 17 points goodbye.",
        "44. Qf1": "44. Qf1 - pinning the black dsb and protecting the white one.",
        "44... Qa1 45. Kg2 Kg6": "45. ...... Kg6? - bad move - allows Qf5 check giving me a snifter of bailing out with a perpetual.  This will still leave me 7 rating points in the red, though.",
        "46. Qf5+ Kf7": "46. ......... Kf7?? - I think this is the losing move.  Because I have moved my king off the first rank my dsb is no longer pinned and so I double up on the hapless black dsb by taking on g5.",
        "47. Bxg5 Qb2+ 48. Kg1 Qa1+ 49. Nf1": "49. Nf1 - successfully screens out the black queen's checks.  Black starts to gobble up my pawns but boy, isn't he going to get big indigestion!  His next move allows mate in a few moves.",
        "49... Qxc3 50. Qxf6+ Ke8": "50. ......... Ke8 - if Kg8 then Bh6.  Black can only delay the coming mate by one move by sacrificing his queen.  But this move allows instant death and on e7, Old Matey strikes!!  My opponent btw is a dentist and I really felt that up until move 45 I was well and truly in the dentist's chair, with a huge 17 point cavity about to be drilled into my rating.  Thankfully this did not happen and I was so relieved to come out of this with  2.8!",
        "51. Qe7#": ""
    },
    "url": "https://gameknot.com/annotation.pl/in-the-dentists-chair?gm=14581",
    "gameName": "In the Dentist's Chair!",
    "players": "jstevens1 (1573) vs. The Dentist (1272)",
    "opening": "Norwegian defence (B06)"
}