{
    "moves": {
        "1. e4 e6 2. d4 d5 3. e5 c5 4. c3 Nc6 5. f4": "Quite dubious. Ali chose to be more ambitious in place of the normal continuation 5.Nf3. Equal would have been 5...Bd7 6.Be3 Qb6 7.Qd2 cxd4 8.cxd4 Bb4 9.Nc3.",
        "5... Qb6": "I quickly equalise now; pressure on the d4, and the bishop on c1 should not have much to say.",
        "6. Nf3 cxd4 7. cxd4 Nh6": "Quite strange. The move appeared sensible though.",
        "8. Nc3 Nf5 9. Bb5 Bd7 10. Bxc6": "Otherwise Black picks the infant on e5.",
        "10... Bxc6": "One of the draw-backs of the French Defence is that this bishop is always having a bad time; locked out of the game by its own pawns and having a little area to preach from. It was surprising that my opponent was helping to bring it out in the open.",
        "11. O-O": "11.g4 Nh6 12.h3 Rd8 13.Qb3 Qxb3 14.axb3 Nc8 would not improve Ali's game.",
        "11... Bb4 12. Kh1": "12.g4 Ne7 13.h3 Be7! would have resulted in an a slight advantage for me.",
        "12... Rc8 13. Rf2": "(!) Aimed against 13...Bxc3 and the death of the infant on c3. Meanwhile, 13.Re1 Bd7 (also 13...O-O 14.a3 Qa3 15.Qb3 Be7) 14.Qd3 O-O 15.a3 Wa5 16.Bd2 was not likely to dampen my spirits. It appeared that we were in for along game.",
        "13... h5": "There was no need to castle now as my mornarch was safe, thanks to Ali for having no likely attack and for freeing my queen's bishop.",
        "14. a3": "I was smiling. The scope of Ali's queen's bishop is further limited. However, both 14.Rc2 O-O 15.a3 Be7 (or 15...Wa5 16.Rd2 Be7=) 16.b4 f6 17.exf6 gxf6 and 14.Qd3 f6 15.Rc2 fxe5 16.fxe5 Rf8 17.Bg5 f6 appears to be equal. My idea was to limit Ali's options as I sat there waiting for a revealation! Not that I had no sneaky ideas though.",
        "14... Bxc3 15. bxc3": "The game was equal now.",
        "15... h4 16. Rb2": "16.Qc2 Wa5 17.c4 h3 was slightly better.",
        "16... Qa6": "Interesting times indeed.",
        "17. Bd2": "The following variations also maintain equality: 17.Qe1 Qd3 18.Ng5 O-O 19.Rab1 Rfd8 20.Nf3; 17.Rab1 Ba4 18.Qe1 Bc6 19.Ng5 Rg8 20.Rb3 Qd3; and 17.Rb4 Bb5 18.Qb3 Bc6 19.Bb2 Ne3 20.Re1 Qd3. At this point it is worth noting that Ali was under considerable pressure to keep the balance.",
        "17... Qd3": "17...O-O and 17...Rc7 appear equal.",
        "18. Qf1": "(??) Better was 18.Be1 or 18.Ng5 Rg8 19.Qh5 g6 20.Qf3 Wc4 (20...Qxf3 21.Nxf3 h3 22.Nh4 Rh4) with equality. Lines starting with 18.Qb1, 18.Ng5, 18.Rc1 and 18.Rb4 would also lead to equality. Chess continues to be an obscure game though.",
        "18... Ng3+ 19. hxg3 hxg3+ 20. Kg1 Qh7": "This miniature was published in The New Vision Newspaper of November 13, 1995 under the heading, \"A Fine Mating Combination\", with an additional comment, \"Here is the game, which is very instructive and worth playing over several times\", by Niels Lauritsen. It was also published in the Uganda Chess Federation Newsletter of April 1995 as the \"most brilliant game of the tournament\". The position after the 18th move appeared in The Monitor Newspaper of May 25, 1999 with the comment, \"A superb tactical ending...which demonstrates the need for strategy in chess\", by Umar Kakumba."
    },
    "url": "https://gameknot.com/annotation.pl/independence-invitational-tournament-oct-1995?gm=26265",
    "gameName": "Independence Invitational Tournament, Oct 1995",
    "players": "Ali Kikoyo  vs. Ivan Katamba ",
    "opening": "French (C02), advance variation"
}