{
    "moves": {
        "1. c4 e5 2. Nc3 Nf6 3. g3": "Black to play.",
        "3... c6": "Stockfish prefers Bb4 first, and I have started playing this move.\n",
        "4. d4": "I find this move interesting.  It is perhaps the most aggressive.",
        "4... e4 5. Bg2 d5": "I have some experience with this pawn formation.  Although technically equal, sometimes Black's pawns can come under attack, like a reverse French Advance Variation.\n",
        "6. b3": "This is about the least helpful move White could make.\n",
        "6... Bb4 7. Bd2": "Now the computer likes 7... Na6 headed for c7, 7... Qe7, or 7... Bf5  and Black enjoys a slight advantage, mostly in space.",
        "7... e3": "I am personally fond of moves like this, but often they not the most accurate, which is true in this game.  However, this disrupts White's position in a way that is practically and psychologically troublesome.\n\n",
        "8. fxe3 Ng4": "It is better to castle first.\n",
        "9. Qc2 Qe7": "It is  more accurate to play 9... O-O 10. cxd5 Bxc3 11. Qxc3 cxd5  and White has a slight advantage.  Then 12. h3 would be too weakening and Black just plays Nf6.\n",
        "10. a3 Bxc3": "Now not 11. Bxc3 Nxe3.",
        "11. Qxc3": "\n",
        "11... O-O 12. h3": "Let's Black off the hook.\n\nWhite misses 12. cxd5 with a strong advantage.  12... cxd5 13. Bxd5 or 13. Nh3.  There is also 12. Nh3 Nf6 (12... Re8 13. cxd5).\n",
        "12... Nf6": "Black is slightly better here.\n\nIf 13. Nf3 Ne4.\nIf 13. Qc1 Re8.",
        "13. O-O-O": "This move has to be a disaster.\n\n",
        "13... Qxa3+ 14. Qb2 Qd6 15. g4 a5": "Not bad.  Now if 16. g5 Nh5 or 16. Nf3 Nbd7 17. Ne1 Re8 18. Nd3 a4 19. Rhf1 axb3 20. Qxb3 dxc4 21. Qxc4 Qa3+ with a strong position.\n\nThis is the second choice for the Stockfish engine.  It prefers 15... Ne4 headed to g3.  I would have chosen simple development with 15... Re8, but after 15... Ne4 16. Be1 (16. Bxe4 dxe4 with a strong advantage.) 16... Ng3 17. Bxg3 Qxg3 18. Bf3 Be6 with a strong advantage.\n\n\n",
        "16. c5 Qc7": "It would be slightly better to play  16... Qg3 17. Bf3 Re8 18. Be1 Qc7 19. g5 Ne4.\n\nNow if 17. Nf3 Ne4 or 17. Rf1 Ne4 18. Bxe4 dxe4 19. Qc2 Be6.\n",
        "17. Be1 Be6": "This indirectly eyes b3, because Black might play b6 and bxc5, and if then dxc5 then the move d4 becomes strong for Black.\n\nIf 18. Qc2 Nbd7 19. Nf3 b6",
        "18. Nf3": "\n",
        "18... Nbd7": "Slightly better than 18... b6.\n\nIf 19. Rf1 b6.  If 19. Qc2 b6.  19. Ng5 Rfe8.\n",
        "19. Rg1 a4": "Or  19... b6, 19... Rfe8, or 19... Ne4.\n\nWhite can hold out best with 20. b4 a3. Now if play were to continue 21. Qa2 Ne4 22. Rd3 b6 23. Rxa3 Qb7 24. Nh4 bxc5 25. bxc5 Rxa3 26. Qxa3 Ra8 27. Qb2 Qa6 28. Bxe4 dxe4 29. Bc3 Rb8 30. Qc2 Bb3 31. Qxe4 Qxe2 32. Re1 Qc4 33. Kd2 Nxc5 34. Qb1 (34. dxc5 Qxe4) 34... Qd5 35. e4 Qg5+ 36. Re3 Qxh4 37. Qe1 (37. dxc5 Qf2+) 37... Qd8.",
        "20. bxa4": "Now it all falls apart.\n\n",
        "20... Rxa4": "If 21. Ng5 Rfa8 22. Nxe6 fxe6 23. Bc3 Ra2 24. Qb3 R8a3 25. Qb4 Ra4 26. Qb3 R2a3 27. Qb2 b5 28. g5 (28. cxb6 Nxb6 29. Rd3 Nc4 30. Qb1 Qh2) 28... b4 29. Bd2 Ra1+ 30. Qxa1 (30. Kc2 R1a2) 30... Rxa1+ 31. Kb2 Rxd1.",
        "21. Rd3": "\n",
        "21... Rfa8": "If 22. Bc3 Ne4 23. Kb1 Nxc3+ 24. Rxc3 Qa5 25. Rb3 Nf6 (or 25... Ra1+) 26. Rd1 (26. Ne1 Ra1+ 27. Kc2 Ra2) (26. Kc2 Ne4 (or 26... Ra2 )) 26... Ra1+ 27. Kc2 Ra2.",
        "22. Kb1": "\n",
        "22... b6": "White doesn't die as quickly with  23. Bb4 but it is still very bad.  23... bxc5 24. dxc5 Qa7 25. Rb3 Ra1+ 26. Kc2 Ra2.",
        "23. Nd2": "\n",
        "23... bxc5": "White's position is resignable.\n\nIf 24. Rb3 c4 25. Rb7 Qc8.",
        "24. dxc5": "Makes things worse. \n\n",
        "24... Nxc5": "Or 24... Qa7.\n\nNow White is still lost after 25. Nb3 Nxd3 26. exd3 d4.",
        "25. Rc3": "This is a mistake that underestimates the danger on the B file.\n\n\n",
        "25... Rb8": "There are other choices like 25... Ra1+ 26. Kc2 R1a2 or 25... Qa7 26. Kc1 (26. Rxc5 Ra1+ 27. Kc2 Qxc5+) 26... Ra1+ 27. Nb1 Rb8.\n\nNow if 26. Rb3 Nxb3 27. Nxb3 d4 (27... Qh2).",
        "26. Nb3": "\n",
        "26... d4": "Best.  At first the computer prefers  26... Rab4 but on deeper thought it likes Black's move better.  There is also 26... Qh2 27. Rf1 Qxg2 28. Rf4 Rxf4 29. exf4 Nfe4 30. Rf3 (30. f5 Nxc3+) 30... Qg1 31. Kc2 Qxe1.\nNow if 27. Rxc5 Rxb3 28. Qxb3 Bxb3 29. exd4 Qa7 30. Kc1 Ra2 (or 30... Ra1+ 31. Kd2 Nd7 32. Ke3 Nxc5) 31. Bb4 Ra1+ 32. Kd2 Rxg1.",
        "27. exd4": "\n",
        "27... Nxb3": "27... Qh2 is also winning, but not as strong.\n\nNow if 28. Rd3 Nxd4 or 28. Kc2 Nxd4+, or  28. Bxc6 Ra1+ 29. Kc2 Nxd4+ 30. Kd3 Rxb2, or 28. Rxc6 Ra1+ 29. Kc2 Qh2 30. Bf2 (30. Rh1 Qxg2) 30... Rxg1.\n",
        "28. Bg3": "\n",
        "28... Nd2+": "Black is playing very accurately.\n\nOr 28... Ra1+ 29. Kc2 (29. Qxa1 Nxa1+) 29... Nxd4+ 30. Kd3 Qxg3+.\n",
        "29. Kc1 Rxb2": "Forces mate.\n\nIf 30. Kxb2 Ra2+ 31. Kc1 Qa5 32. Rxc6 Nb3+ 33. Kb1 Ra1+ 34. Kb2 (34. Kc2 Qd2#) 34... Qa2+ 35. Kc3 Qd2#\n",
        "30. Bxc7 Raa2": "Black has an overwheling position.\n",
        "31. Kd1 Bb3+": "Or  31... Nde4 or 31... Nfe4.\n\nNow if 32. Rxb3 Ra1#.  White resigns.  What a strong game!  Black played well.  If play were to continue ...\n",
        "32. Ke1": "\n",
        "32... Nde4": "If 33. Rc1 Rxe2+.\n",
        "33. Bxe4 Rbxe2+": ""
    },
    "url": "https://gameknot.com/annotation.pl/indianapolis-open-chess-com?gm=65218",
    "gameName": "Indianapolis open,  Chess.com",
    "players": "Xun (1400) vs. Steve Sims (1558)",
    "opening": "English (A23), Bremen system, Keres variation"
}