{
    "moves": {
        "1. e4 d5 2. exd5 Nf6 3. Nc3 Nxd5 4. Nxd5 Qxd5 5. d3 Nc6 6. Be3 g6 7. Nf3 Bg7 8. c4": "going for a space gain",
        "8... Qd6 9. Ng5 Bxb2": "taking pawn",
        "10. Rb1 Bc3+ 11. Bd2 Bg7 12. Qf3 O-O 13. Be2 Nd4 14. Ne4": "White blunder the queen but he manage to get a draw later",
        "14... Nxf3+ 15. Bxf3 Qxd3 16. Rc1 f5 17. Nc5 Qa3 18. Nb3 Qxa2 19. Bd1 e5 20. O-O b6 21. Ra1 Qb2 22. Bc1": "the queen is not trapped but I decide to save time",
        "22... Qxa1 23. Nxa1 e4 24. Nc2 Be6 25. Ne3 c6 26. Ba3 h5": "sacrificing the exchange to get bishop pair",
        "27. Bxf8 Bxf8 28. Ba4 Rc8 29. Rd1 Bc5 30. Nc2 Bxc4": "I have 3 connected passed pawns",
        "31. h3 b5": "I win a piece",
        "32. Bxb5 cxb5 33. Ne3 Bxe3 34. fxe3": "I have 2 connected passed pawns",
        "34... f4 35. Rd4 Re8 36. Rd6 fxe3": "trying to promote",
        "37. Rxg6+ Kf7 38. Rg3 Rg8 39. Rxe3 h4 40. Rxe4 a5 41. Rxh4 Bd5": "targeting g2",
        "42. Rg4": "not good now I can trade rooks and win easily",
        "42... a4 43. Kf2 a3 44. Rb4": "he decide not to trade and let me take g2",
        "44... Rxg2+ 45. Kf1 Rc2 46. Rxb5": "Bc4+ winning the rook",
        "46... Be6 47. Rb7+ Kf6 48. Ra7": "attacking pawn I win with a2",
        "48... Rh2 49. Rxa3": "now the game is a draw, but since this is an insanely complicated endgame, we can pretty much consider it winning for me right?",
        "49... Ke5": "advancing king",
        "50. Re3+ Kd5 51. Kg1 Rb2": "keeping pig on the 7th to trap king, White would have to be a grandmaster to get a draw here",
        "52. h4 Bf5": "trying to gain ground with king but need to move bishop first",
        "53. h5": "trying desperately to promote pawn",
        "53... Be4": "before gaining ground with king I can play Rg2+ and Rh2 to keep eye on pawn",
        "54. h6 Rg2+ 55. Kf1 Rh2": "now he will not promote",
        "56. h7 Kd4": "gaining ground with king, White is not a grandmaster, so he will not get a draw",
        "57. Ra3 Rxh7 58. Ra4+ Ke3 59. Ra3+": "I wanted to keep my king on same line as his so instead of check Bd3+ ",
        "59... Kf4": "I played Kf4 now if tries come to 2nd rank I chase away with Rh2+ and White king is back on the 1st rank again!",
        "60. Kf2": "which he tried",
        "60... Rh2+": "but he fail to keep him king away from the edge",
        "61. Ke1": "so it is in danger",
        "61... Bf3": "I seal off the d1 square so now there is a barrier d1, d2, e2, f2. White can try to become a grandmaster and learn the game before timeout.",
        "62. Ra4+": "check",
        "62... Kg3": "Hide behind bishop instead of Ke3 allowing Ra3+",
        "63. Ra3": "see now there is no check the bishop is a shield and the rook is a sword",
        "63... Re2+": "Kd1?? allows discovery check winning the rook",
        "64. Kf1": "so White tries to get safe",
        "64... Rd2": "Threatening checkmate Rd1#",
        "65. Ke1": "you could argue that White deserved to get a draw, but he is not a grandmaster so no that would be an invalid statement",
        "65... Rd1#": "If White deserved a draw then he should know how to keep a draw, but he should not feel bad, because only grandmaster is capable of keeping a draw."
    },
    "url": "https://gameknot.com/annotation.pl/insanely-complicated-rook-bishop-vs-rook?gm=64704",
    "gameName": "Insanely Complicated Rook Bishop vs. Rook",
    "players": "howdydoody1947 (1455) vs. hexchess (1714)",
    "opening": "Scandinavian defence (B01)"
}