{
    "moves": {
        "1. d4 d5 2. Nf3 e6 3. g3 Nf6 4. Bh3": "Sorry for skipping  the entire early game, but honestly, i find them to be really boring. Anyways, daniel plays h3 instead of standard g2. Not quite sure, could be his playstyle.",
        "4... Bb4+": "This is MY playstyle. Yes, it may be a stupid one, but really, i'm just going for some lucky break everytime. If opponent blocks with knight or bishop, it gives me the initiative.",
        "5. c3": "And of course... denied.",
        "5... Bd6": "So i fallback to this semi-precarious position, not doing much, but then, i'm just really going for king-side castle.",
        "6. O-O": "Which he does first.",
        "6... h6": "defending g6",
        "7. Qd3": "?? I am confuzzled",
        "7... e5": "And yes, i did it. What could this mean? it means that i am a crazy bastard. Before you comment on the move's stupidity, please consider all other alternates.",
        "8. dxe5": "And he TAKES MY PAWN. Plan A is already foiled, so i go for plan B",
        "8... Bxh3": "YOINK.",
        "9. exf6": "ARGH. He would be smart enough to take the knight.",
        "9... Qxf6": "I was forced. If you doubt my statemennt, check it.",
        "10. Rd1": "He moves his rook. And so here we are, 10 moves into the game, pawn structure is already broken, our pieces still underdeveloped, both our king in quite a dangerous position.",
        "10... c6": "YOUUUUUUUUU SHALLLLLLLLL NOTTTTTTT PASSSSSSSS",
        "11. c4": "But he wants to. So i have to come up with something, and it has to be fast.",
        "11... Na6": "If you guessed on me making this move, you should either visit a mental hospital, or you are a witch! or i'm actually good.(somewhat unlikely)",
        "12. cxd5": "Noble sacrifice.",
        "12... O-O-O": "yes, i do the dreaded queen-side castle.",
        "13. dxc6": "And he takes!!!!",
        "13... Bxg3": "I spring my trap",
        "14. Qc2": "He retreats to the safety of not being in line of fire.",
        "14... Rxd1+": "Fairly obvious move.",
        "15. Qxd1": "Another recap here, 15 moves into the game, both of our kings in a dangerous position, white still heavily underdeveloped, white pawn right in my doorstep. I really should take the pawn, shouldn't I?",
        "15... Bf4": "Nope, too far away. Might as well do something productive.",
        "16. Bxf4": "In case you didn't notice, tht was a joke.",
        "16... Qxf4": "So here, i have a mate threat, he has a pawn right in my face, and his rook is still stuck.",
        "17. cxb7+": "ARGH. That pawn shall live no further!",
        "17... Kb8": "My pieces refuesed my order.",
        "18. Qb3": "........... WUT??!?!?!?! *NOTE* Checkmate sequence: a) 18. ... Qc1+ 19. Qd1 Qxd1+ 20. N e1 Qxe1#  b) 18. ... Qg4+ 19. Kh1 Qg2#",
        "18... Qg4+": "YAY I WIN      Umm this game is still ongoing, (technically) but really... i won. but i give daniel credit, it's been a while i played chesss, and he made this game quite enjoyable. Please criticize our moves in comments!"
    },
    "url": "https://gameknot.com/annotation.pl/interesting-chess-game?gm=40342",
    "gameName": "Interesting(?) Chess game",
    "players": "daniel696 (1212) vs. rlawpghd (1200)",
    "opening": "Queen's pawn game (D02)"
}