{
    "moves": {
        "1. e4": "Hi everyone!\r\n\r\nAnother victory, taking my rating into the 1830s.  This was a very hard fought, tense battle.  My new buddy Elia played a very hard game.  Indeed, he had a rating in the 1700s but unfortunately he suffered some timeouts as a result of a bad internet connection.  But I digress, he was in the game until the very last move where he left his rook en prise to Fou Lenoir who gratefully read him the last rites!  Anyhow, on with the show.  Elia gives me the French Defense which is e6 in response to e4.  The purpose of this is to prepare d5 and challenge the centre.",
        "1... e6 2. d4 Ne7": "2. ...... Ne7 - unusual.",
        "3. Nf3 d6 4. Bd3": "4. Bd3 - development.",
        "4... Ng6 5. O-O Be7 6. Be3": "6. Be3 - out with the queenside pieces - this is beginning to look like a Pirc Defense.",
        "6... Nc6 7. a3": "7. a3 - preventing Nb4.",
        "7... a6 8. c4 Bd7 9. b4": "9. b4 - a pawn wall - can jstevens1 capitalise on this?",
        "9... O-O 10. Nc3": "10. Nc3 - white looks to have a spatial advantage but the white player is jstevens - passivitis 1!",
        "10... Na7 11. Qd2 f5": "11. ..... f5 - the first move that contests the centre from the black side.",
        "12. exf5 exf5": "12. ...... exf5 - pawn trade.",
        "13. Nd5 Nh4": "13. .... Nh4 - suddenly black is planning a kingside attack.",
        "14. Nxe7+ Qxe7 15. Nxh4 Qxh4": "15. ..... Qxh4 - as a result of a double piece trade the Wicked Witch of the West plonks herself on h4.  I am looking at that f8 rook, where there is a rook there is back up, where there is the Witch there is Old Matey and that Grim Reaper's beady eye is on the h2 square!",
        "16. f4": "16. f4 - this move will give Henry some air should the Witch ever descend on h2.",
        "16... Rae8 17. d5": "17. d5 - played to try and a. stop Re6, b, stop black's lsb raking down the h1-a8 diagonal.",
        "17... Nc8 18. Rf3": "18. Rf3 - Enough of this passivitis!  I will now try a mating attack and pray very hard that it comes off.",
        "18... Qf6 19. Raf1": "19. Raf1 - I spot the Witch's fire down the a1-h8 diagonal - my queen rook cannot stand the heat so he gets right out of that kitchen and heads off to f1 to aid a possible kingside castling mating attack.",
        "19... Ne7 20. Be2 Ng6 21. Rg3": "21. Rg3 - my rook bores down to g7 x-ray style.",
        "21... Qd8 22. Bh5": "22. Bh5 - pin.",
        "22... Qf6 23. Bxg6 hxg6": "23. ....... hxg6 - Elia's kingside pawns are doubled and the h file is open, can I make use of it?",
        "24. Bd4 Qf7 25. Rg5": "25. Rg5, contemplating a rook lift to f3 and possibly to g3 or h3.",
        "25... Re4 26. h4": "26. h4 - that e4 rook is trying to spoil the party.  I proceed with my attack.  I dream of a windmill, you know, that starts with Rxg7+ and the king is forced to h8 where a series of discoveries will net oodles of material!",
        "26... Be8 27. Re1 Qe7 28. Rxe4 Qxe4": "28. ....... Qxe4 - but I bottle out and end up trading rooks on e4.  And now here is that Witch!",
        "29. h5 Kh7 30. Qf2": "30. Qf2 - Glenda maintains her defense of Fou Lenoir on d4, now when is that poor gal not defending something?  However, Glenda is also eyeing up the h file and the possibility of landing on h4 which could be nasty if the h5 pawn takes on g6.",
        "30... Rh8 31. hxg6+ Kg8 32. Qe3": "32. Qe3 - I don't like the fact that the h column is open and there is a black rook on it.  I think a queen trade is needed here.",
        "32... Qb1+ 33. Kf2 Qc2+ 34. Qe2": "34. Qe2 - Glenda cannot resist snuggling up to her other half, now a queen trade does take place.",
        "34... Qxe2+ 35. Kxe2 Bd7 36. Rg3 Rh6 37. Re3": "37. Re3 - my rook occupies the e file and will use it as a highway to Elia's position.",
        "37... Rxg6 38. Re7 Ba4 39. Rxc7 Rxg2+": "39. ........ Rxg2+ - pawn trade.",
        "40. Kf1 Rg4 41. Be3 Bb3 42. Kf2 Kf8": "42. ...... Kf8 - Elias tries to centralise his king.",
        "43. c5 dxc5 44. Bxc5+ Kg8 45. d6": "45. d6 - suddenly a white passer appears out of nowhere!",
        "45... Rxf4+ 46. Ke3 Re4+ 47. Kd3": "47. Kd3 - Henry is given the run around!",
        "47... Bc4+ 48. Kc3 Bb5 49. d7": "49.  d7 - I now force Elia to give up his bishop for the d7 pawn.",
        "49... Bxd7 50. Rxd7 b5 51. Rd6 Rc4+ 52. Kd3": "52. Kd3 - peace for Henry but now the black queenside pawns are threatening to run away from my rook.",
        "52... a5 53. Rb6 axb4 54. axb4": "54. axb4 - pawn trade.",
        "54... Rc1 55. Rxb5": "55. Rxb5 - I am worried about those kingside passers but first I create my own passer.  Unfortunately he is at least six moves away from Glendadom as I must first move my rook out of his way.",
        "55... f4 56. Ke4": "56. Ke4 - something must stop those pawns.  My b passer, Fou Lenoir and my rook are all defending each other in a huddle on the queenside, but as you will see, Henry does a grand job!",
        "56... g5 57. Kf5": "57.  Kf5 - this move ensures that both pawns will disappear from the board so the worst case scenario is a Low Draw for me.  However, Elia, in his eagerness to defend his g pawn moves his rook to g1.  Fou Lenoir gladly administers the last rights and Elia waves the white flag.  Yet another huge sigh of relief for jstevens1!",
        "57... Rg1 58. Bxg1": ""
    },
    "url": "https://gameknot.com/annotation.pl/inter-team-championship-1700-1800-heavy-weather?gm=26134",
    "gameName": "Inter-team championship 1700-1800 - Heavy Weather",
    "players": "jstevens1 (1831) vs. el-rancho (1600)",
    "opening": "French defence (C00)"
}