{
    "moves": {
        "1. e4": "I wanted to look at this game, mostly because of the opening. It could have led to a closed sicilian or grand prix, which I know very well. The middlegame had some very complex analysis that even masters would find it tough to evualuate and make good moves. \n\nIm analyzing in my head to get better visualization. Consulted opening ex for white move 3.If I missed something tell me; the analysis is very tough.",
        "1... c5 2. Nc3 g6": "Although this is a move here, it is not as common as the moves 2...d6, 2...Nc6, 2...e6. Nc6 is the overall favorite, and all 3 lines mentioned may transpose to one another. ",
        "3. d4": "White may have played this with the intention that if black captures, as he would in most open sicilians, white may recapture and strike the rook at h8. So 3...cxd4 4.Qxd4 Nf6 5.e5 but black could have 5...Nc6, and looking at a few queen moves that save the pawn, 6.Qf4 seems to be the only playable move. After 6...Nh5 there could be some complicated play that appears to slightly favor white. 6.Qe3 is losing the pawn by 6...Ng4.",
        "3... Bg7": "This move is often played 3rd move in hyper accelerated dragon by 1.e4 c5 2.Nf3 g6 3.d4 Bg7!? as an interesting idea. If white captures 4.dxc5, he loses a center pawn. Black may choose to regain by 4...Qa5+ if he wants, or keep developing, as the pawn isn't going anywhere soon. By the move order Nc3, black threatens to win a pawn. The line 4.dxc5 Qa5 will win the pawn back, and white's position seems worse after 5.Bd2 Qxc5, but it 6.Nd5! is a very strong move, giving white multiple threats to work with, many involving forks on c7. The pawn on b2 is just a decoy, as 6...Bxb2 loses to 7.Bb4 Qc6 8.Bb5 and black can give up.",
        "4. e5": "A good move would have been to take the pawn. If he does, black does not need Qa5 right away to get the pawn back.\n@chizzo83 yes, Nf3 enters into theory, but why allow black to go into a perfectly acceptable position when he has made a less than optimal move? dxc5 grants white a small advantage already, and its only move 4...@excile no, dxc5 is the best move in this position, with white getting a much bigger advantage than all other moves. AlmostALL masters would play dxc5. Your variation of Bg7 hands over the advantage immediately, and fails to punish white for his inaccurate move. *in master games, nearly 50% of the time white wins in this variation. Black has a mere 20% at most.",
        "4... cxd4": "The way to win. 5.Qxd4 Nc6 is it.",
        "5. Qxd4 Nc6 6. Qd1": "A good of a move as any.",
        "6... Bxe5": "Slightly inaccurate, as now the valuable bishop is exposed and allows white time. Even up a center pawn, black does not want to allow white any positional gains.",
        "7. Nf3 Bg7": "7...Bxc3+ is actually something to look at. 8.bxc3, and black has avoided losing a tempo, and has doubled whites pawns. Although this may seem very little compensation for the loss of the nice bishop, black can now try to cover up his weaknesses by using his rapid development and center majority, his greatest weapon. Moves like Qa5, Nf6 with a well timed d5 or e5 may be potent. @excile I am fully aware of the strength of the black square bishop. But dont treat this like it is a normal sicilian, so dont use normal sicilian rules. The gaining of time, plus the extra pawn, makes Bxc3+ a reasonable idea, and should be considered.Concrete analysis instead of using general principles says that Bxc3 is okay.",
        "8. a3": "Not very useful, and not energetic enough for the pawn.",
        "8... e5": "This would have been the sort of move to play after playing my comsidered line 7...Bxc3+, to advance and shield some weaknesses. Now the bishop is blocked.",
        "9. Bc4": "White is now better positionally, but black does have the pawn, giving him an advantage if he hurries to develop.",
        "9... Nf6 10. h3": "still not useful for time. A simple, much better move is to castle. ",
        "10... O-O": "I looked at 10...e4, but 11.Ng5 and black loses the pawn.",
        "11. Bg5": "White pins after the king castles. This usually will prevent h6 and g5, knocking back the bishop, but black would not castle queenside in this opening.@exxcile a good of a developing move as any,",
        "11... d6": "It is clear that d6 is a weak pawn:another consequence of e5.  d5 is also an outpost. The bishop on g5 helps control it.",
        "12. O-O Qc7": "Getting out of the pin. Black has an extra pawn, so was very slightly better, but white now has the d6 target to attack. 13.Nb5 wins the d6 pawn.",
        "13. b4": "missing the fork. Here, if 13...Nxb4, then it gets complex. Possibilities include Bxf7+, Bxf6, and axb4. The loose bishop and the knight behind it signals that a tactic is in play. b4 is a bad move, and accomplished nothing. I should also say that white would have been better off doing nothing and passing with 13.Kh1, rather than play b4. It opens up all sorts of possibilities in the position, but for black. I would even look at moves like e4. There are too many lines to go through, all of them with possibilities going for black. @excile Its time to ignore general principles about developement FOR NOW. After black settles the tactics he can develop. Tactics beat general princples, and black has potential tactics. ",
        "13... Bf5": "The fork is still open, but now black attacks the c2 pawn. If Nb5, it isn't nearly so simple as before. White must analyze all possilbilties of where the queen goes after Nb5.",
        "14. g4": "White weakens the kings area. Again, a lot of analysis on the moves. One line goes 14...Be6 15.Bxe6 fxe6 16.Bxf6 Bxf6 17.Nb5 where white wins a pawn. But if black plays 16...Rxf6, he will be hitting the Nf3, which may distract white from Nb5, for example 17...Qe7 white should not capture the pawn. ",
        "14... Be4": "15.Bxf6 Bxf3 16.Qxf3 wins a piece. Black may compicate things with 16...Nd4, but 15.Bxf6 looks good now, removing the guard. White would get an advantage with this move.",
        "15. Nd2": "Instead, a retreat. ",
        "15... Nd4": "A tricky move, black depends on the coordination of his pieces to ensure safety. 16.Bxf6 Bxc2 and now the best move is not to move the queen, which would allow a delayed recapture on f6 and leave a complex position where black seems better. The forces are in clash, and tactics are everywhere. instead, I would suggest 17.Bxg7(!) If recapture, then move the queen and white is a piece up. Attempts to break in with 17...Kxg7 18.Qc1 d5 19.Nxd5 attacks the queen. If 17...Bxd1, then Bxf8 wins without a fight.",
        "16. f3": "not going with my suggested line, he allow the loss of a pawn.",
        "16... Bxc2 17. Qe1": "black is up 2 pawns. But how to get the bishop out? Luckily it is not in too much danger at the moment.",
        "17... d5": "complicating things. Not a great idea. I do not see a way for white to get the advantage, however. 18.Bxf6 dxc4. black is better.",
        "18. Nxd5 Nxd5 19. Bxd5 Bd3 20. Rc1": "with tempo, but this could simply drive the queen to a better spot. It could move to d7. ",
        "20... Qd6 21. Bxb7 Ne2+": "this does not accomplish anything. ",
        "22. Kh1": "And now a few board vision errors end the game.",
        "22... Ng3+ 23. Qxg3 Bxf1 24. Bxa8 Qxd2 25. Bxd2": "now black properly resigns. Please comment, especially if you see a combo or something I missed."
    },
    "url": "https://gameknot.com/annotation.pl/interesting-very-complex-game?gm=39998",
    "gameName": "Interesting very complex game.",
    "players": "jhl111252 (1235) vs. lenono13 (1088)",
    "opening": "Sicilian (B23), closed"
}