{
    "moves": {
        "1. c4": "Hi everyone!\r\n\r\nThis was the final game of my Inter-Team 1700-1800 Mini-tournament.  It ended in a Low Draw but after my usual middle-game probs I was glad to avoid finishing on a low note.  If my opponent manages to beat Grandad then I will top the table, still, at worst I will come second, not bad, not bad at all.  Anyhow, my opponent now kicks off with the English Opening which is 1. c4.",
        "1... e5 2. g3 Nf6 3. Bg2 d5": "3. ..... d5 - battle for the centre.",
        "4. cxd5 Nxd5": "4. ...... Nxd5 - pawn trade.",
        "5. Nc3 Nb6 6. e3 Be7": "6. ...... Be7 - development.",
        "7. d4 exd4 8. exd4": "8. exd4 - pawn trade.",
        "8... c6 9. Nge2 Nb8d7 10. d5 cxd5": "10. ....... cxd5 - this trade and the following trades give a clear advantage to white, sigh.",
        "11. Nxd5 Nxd5 12. Qxd5": "12. Qxd5 - that Wicked Witch of the West is at the centre of things now, sssss!",
        "12... Nf6 13. Qxd8+ Bxd8": "13. ........ Bxd8 - queen trade.  White's lsb is gonna be a thorn in my side for the entire game.",
        "14. O-O O-O 15. Nc3 a6": "15. ....... a6 - to prevent Nb5.",
        "16. Bf4": "16. Bf4 - nasty, nasty, my rook on a8 is extremely restricted.",
        "16... Bb6": "16. ....... Bb6 - I improve the position of Fou Lenoir and put his f2 pawn in a pin.  This pin will be a minor inconvenience to white very soon.",
        "17. Bf3 Bh3": "17. ....... Bh3 - I have had enough of this passivitis, time for some counter-attack.",
        "18. Rfe1 Ng4": "18. ...... Ng4 - putting pressure on f2.",
        "19. Be3 Nxe3": "19. ...... Nxe3 - I took with the knight because I wanted to preserve my bishop pair but I now get into another tangle.",
        "20. fxe3 Rab8 21. Nd5 Ba7": "21. ....... Ba7 - virtually forced.",
        "22. Rac1 Rfe8": "22. ....... Rfe8 - to put pressure on e3 and to stop white's knight going to e7 with check.",
        "23. Rc7 Kf8": "23. ...... Kf8 - it is time for Henry to lend a helping hand in the centre.",
        "24. Kf2 Be6 25. a3 Bxd5 26. Bxd5": "26. Bxd5 - I traded in Fou Leblanc for white's knight but there is a dangerous clamp on my queenside still.",
        "26... Re7": "26. ..... Re7 - the purpose of Henry going to f8 manifests itself here.  A rook trade now takes place on e7.",
        "27. Rxe7 Kxe7 28. Kf3 Bc5": "28. ....... Bc5 - now Fou Lenoir becomes active.",
        "29. Rc1 Bd6": "29. ....... Bd6 - prevents Rc7+.",
        "30. b4 f5 31. Rc4 g5 32. h3 h5": "32. ..... h5 - over the last few moves I decided to erect Jo's version of Hadrian's Wall to keep the Barbarians from the Gate!  Here the pawns will not be quite so much a target for the enemy rook, at least for now.",
        "33. Rd4 Be5 34. Rd3": "34.  Rd3 - this move allows me to free my own rook at long last from the duty of guarding that weakie on b7.  I can pin white's lsb to his unprotected rook and if he plays Bc4 then I can trade rooks going into an ending with even pawns and opposite bishops which is usually drawn.",
        "34... Rd8 35. e4 f4": "35. ...... f4 - Operation Joblock swings into action here.  I do not wish the e column to be opened up, particularly while Henry is sitting on it!",
        "36. gxf4 gxf4": "36. ...... gxf4 - pawn trade.  My sixth sense told me to expect a draw offer after this trade.  It duly arrived and I accepted.  Whew, another lucky escape.",
        "37. Rb3": ""
    },
    "url": "https://gameknot.com/annotation.pl/inter-team-championship-1700-1800-escape-from-passivitis?gm=27316",
    "gameName": "Inter-team championship 1700-1800 - Escape from Passivitis",
    "players": "tamulder (1743) vs. jstevens1 (1839)",
    "opening": "English opening (A20)"
}