{
    "moves": {
        "1. d4 g6 2. e4 d6 3. Nf3 Bg7 4. Be3 Nc6 5. c3 e5 6. Bb5 Bd7 7. d5 Nce7": "Progressivly, white gain space",
        "8. Bxd7+ Qxd7": "black is clearly less developped",
        "9. Nbd2 Nf6 10. h3": "leaving black less and less possibilities",
        "10... Nc8": "trying to find space on the queen side",
        "11. Qe2 Nb6 12. b3": "white continues the same tactic",
        "12... Nh5 13. a4 Nf4": "this may seem a mistake, but my purpose was clearly to open spaces, even though my pawns would face doubling.",
        "14. Bxf4 exf4": "for a few moves, this pawn is safe... it won't last.",
        "15. Rc1 O-O 16. a5": "chasing the only piece from queen side. Maybe I should have played a5 sooner.",
        "16... Nc8 17. Nd4 a6 18. Nd2f3": "white is still gaining spaces.",
        "18... Ne7 19. Qd2 Be5": "preferring my pawn than this bad bishop. And more: white knights are dangerous.",
        "20. Nxe5 dxe5 21. Nf3 f6 22. c4": "main attack by white: the pawns!",
        "22... Rad8 23. O-O c6 24. Kh2 Qd6": "mistake!",
        "25. c5": "of course!",
        "25... Qb8 26. d6 Rf7": "knight cannot be taken due to queen esposition.",
        "27. Qe2 Nc8": "focusing the only possible target: b5.",
        "28. Rcd1 Na7 29. Qc4": "and now, white will try to penetrate with this advanced pawn...",
        "29... Kg7": "freeing the pinned rook",
        "30. Rfe1": "maybe this was a loss of time",
        "30... Rdd7": "combining the rooks for their safety and overprotecting b7.",
        "31. Qe6": "i think that white forgot to use his knight.",
        "31... h6": "reducing possibilities of the white knight in case of king-side pawns advancing.",
        "32. Rd3": "white still lacks of ideas: there is no possibility to advance on d-line with the rooks.",
        "32... Nb5": "prohibiting many possibilities from white",
        "33. b4 Qd8 34. g3": "finally a good attacking move",
        "34... fxg3+": "forced",
        "35. fxg3": "white has oppened a good line: it was the thing to do!",
        "35... Rf8": "preparing the exchange of queen to avoid a task force against f6",
        "36. h4": "preparing the attack",
        "36... Qe8 37. Qh3": "the queen wants to still focusing on d7; good idea.",
        "37... Qf7": "focusing on the other side, threatening an intermediate check if possible",
        "38. Rf1": "preparing the attack on f6, with an advance against g5",
        "38... Rfd8 39. h5": "my mistake... it was on h5. The knight can now go on h4",
        "39... g5": "not anymore... but this is where white stopped to play. This is too bad, because I was planning a draw and the good possibilities on f6 were interesting for white...the last soldier for black could be the knight on d5, in case the rook on d column leaves its place to focus on column... well, many things, many things!"
    },
    "url": "https://gameknot.com/annotation.pl/interesting-game-until-a-strange-end?gm=33932",
    "gameName": "interesting game... until a strange end...",
    "players": "luarod55 (1710) vs. thitho (1749)",
    "opening": "Modern defence (A40)"
}