{
    "moves": {
        "1. e4": "1. e4 has many good points.  It attempts to secure space in the center, and open lines for the f1 bishop and the queen.  The g1 knight might also develop via e2 in some lines.  Two of the fundamental elements of chess: space and time, are well served by the move.  There is a slight weakening to the d4 and f4 squares, which should also be noted.",
        "1... e5": "Just as logical for black as for white.",
        "2. Nf3": "A developing move that centralizes the knight and attacks black's e-pawn.  Centralization is a key concept in chess, because peieces tend to grow stronger nearer the center.  A piece's power is tied to its mobility, and centralized pieces tend to be more mobile.",
        "2... d6": "A playable, but passive defense.  It secures the e-pawn, but also hinders the development of the f8 bishop.",
        "3. d4": "Siezing more space, and opening a line for the c1 bishop.  It again threatens to win the e-pawn.  Developing, while making threats, is a sign of the initiative.   The initiative is another critical concept in chess, where one side is pressing the other and limiting their choices.",
        "3... Bg4": "An overly aggressive move that is actually seen fairly often in similar positions, by developing players, until they learn about its drawbacks.  This is a tactical solution to the defense of the e-pawn that has a strategic drawback, which will become clear.",
        "4. dxe5": "Capturing on e5 with the d-pawn is the correct play.",
        "4... Bxf3": "4. ...dxe5 loses material to 5. Qxd8  Kxd8 6. Nxe5.  Material, or force, is another basic element in chess.  You must maintain the material status quo, or risk being overwhelmed.  Notice how the bishop has moved twice to capture a knight, which has only moved once.  Black is beginning to lag behind in development, or in the element of time.",
        "5. Qxf3": "5. gxf3 is possible, but it would result in a defect in white's pawn structure.  Pawn structure is another critical elelment in understanding chess.  In this case 5. gxf3 would give white doubled pawns on the f-file.  The pawns cannot defend one another and the f2 pawn's mobility is restricted.  White has continued his development, by recapturing with the queen, and secured the two bishops.",
        "5... dxe5": "Black has restored material equilibrium,  but at the cost of the two bishops.  Two bishops are more mobile than bishop and knight, and they are usually easier to coordinate.  Notice that white has one piece developed and is on the move, while black has no developed piece.",
        "6. Bc4": "With the not-so-subtle threat on f7.  Developing, while making threats, reduces your opponent's options.  White is making good use of the initiative.",
        "6... Qf6": "Propably hoping for 7. Qxf6 Nxf6, where black has caught up in development.  White, however, has no intention of helping out his opponent in that way.  Better was 6. ...Nf6, but 7. Qb3 still leads to an advantage, as in the famous game Paul Morphy vs. Duke Karl and Count Isouard. 6. ...Qe7 is another try.",
        "7. Qb3": "Creating a nice bishop-queen battery along the a2 g8 diagonal. and threatening 8. Qxb7.  The absence of black's light square bishop is felt almost immediately.",
        "7... Bc5": "A counter threat that gets white's attention.",
        "8. O-O": "White, unlike black, can respond to the threat with a natural developing move.  Castling secures the king behind a phalanx of pawns, and allows the rook to get into the game.",
        "8... b6": "8. ...b6 does not help black's development and further weakens the white squares.  8. ...Bb6 was probably better.",
        "9. Nc3": "Another centralizing, developing move with the threat of 10. Nd5 gaining even more time, because of the attack on the queen.",
        "9... Bd4": "9. ...Ne7 would've challenged white's control over d5.  Black has moved an already developed piece twice, before completing the development of his other pieces. 9. ...Bd4 is a waste of time in a position where black already trails white in that element.  Neglecting development is one of the most common mistakes in chess.",
        "10. Nd5": "Now, white gets a free move, since black must save the queen.",
        "10... Qd8": "White has three pieces developed to black's one, and it is white's turn to move.  An advantage in the element of time is a temporary one.  Ideally, you want to cash it in for an advantage in a more permament elelment such as material.  A lead in development means that open lines and attack are the order of the day.  Play passively and your opponent will catch right up to you in terms of time.",
        "11. c3": "Another free move for white.  The c-pawn fights for control over d4, and forces the bishop to retreat.",
        "11... Bc5": "No choice, if black wishes to preserve material equality.",
        "12. Rd1": "Rooks belong on open files, and the d-file is the only open file on the board.  Additionally there is threat of another free knight move exposing an attack on the queen on d8.",
        "12... Qc8": "Black still has only one developed piece.  A move such as 12. ...Nd7 would expose the white square weakness on the queenside allowing a move such as 13. Bb5 threating 14. Bxd7  or 14. Bc6, but at least it would've developed another piece.  Notice how black's knights and rooks are still on their original squares.",
        "13. Ne3": "This time the threat on f7 is renewed, and black's queen cannot come to its defense.",
        "13... Bxe3": "Losing material, but 13. Nh6 runs into 14. Nf5 which also wins material.",
        "14. Bxf7+": "An intermidiate move, which allows white to win a pawn, and rob black of the ability to castle.",
        "14... Kf8 15. Bxe3": "Now, white recaptures the piece after pocketing the extra pawn.  White has gained an advantage in the element of material, while maintaining his advantage in the element of time.",
        "15... Na6": "It is difficult to make suggestions in such cases, but perhaps 15. ...Nf6 would've been better. Black can always meet Bd5 with c6.",
        "16. Be6": "Redeploying the bishop to a more secure square, while simultaneously attacking the queen.",
        "16... Qe8": "Black would love to be able to play 17. ...Rd8 challenging white's control over the d-file.",
        "17. Rd7": "But white is too far ahead in development.  He invades the seventh rank with the threat of Rf7  winning the queen.",
        "17... Ne7": "Forced, but insufficient.",
        "18. Bg5": "Yet another developing move that contains a threat, but this one had to be calculated precisely.",
        "18... Nc5": "This family fork of the queen, rook and bishop looks like an effective resource.  Black has finally gotten some pieces into the game, but is it in time?",
        "19. Bxe7+": "White has correctly calculated a forced sequence of moves, and knows that he is, in fact, winning more material.  Black must recapture on e7.",
        "19... Qxe7": "The only legal move.",
        "20. Rxe7": "Well played.  White has another in-between move in store that will win the day.",
        "20... Nxb3": "White cannot capture the knight on the next move, because his rook on e7 is hanging.",
        "21. Rf7+": "White can, however, play the rook to f7, where it is protected.  Because the move is also check, black must move his king.",
        "21... Ke8": "The king must move, and that gives white time to capture the knight on b3.",
        "22. Bxb3": "After the smoke clears white is a piece ahead, has an extra pawn, and has a rook on the seventh, while black's rooks remain disconnected on their original squares.  White's advantage is overwhelming.",
        "22... g6": "It is time to just pick your poison, but 22. ...g5 was better.",
        "23. Rxc7": "Adding another pawn to the material plus.",
        "23... h5": "There is nothing constructive for black to do.",
        "24. Bf7+": "I would've probably played 24. Rd1, with the threat of doubling rooks on the 7th.  24. Rd1 Rd8 25. Rxd8  Kxd8 26. Rxa7 is clearly winning for white, but the game continuation is more than adequate.",
        "24... Kd8 25. Rc6": "White is letting black coordinate his rooks, which I would've tried to prevent, but it hardly matters, since white is up so much material.",
        "25... Ke7": "Allowing another pawn to fall, but connecting his roooks.",
        "26. Bxg6 Rad8": "Finally activating one of the rooks, but it is too little too late.",
        "27. Rc7+ Rd7": "The only chance was 27. ...Kf6 with the idea of getting his d-rook to the seventh.  With every piece exchange, white's material advantage looms larger.",
        "28. Rxd7+ Kxd7 29. Rd1+": "Even at this late stage, white is developing with tempo.",
        "29... Kc6 30. Rd5": "Merciless!  White merely has to create a passed pawn, and escort it to the queening square.  Black will be helpless to stop it.",
        "30... h4 31. Rxe5 Rg8 32. Bf5 a5 33. Be6": "Not merely attacking the rook, but gaining control of the g-pawn's queening square.",
        "33... Rg6 34. Bd5+ Kc7": "Notice how 34. ...Kd6 allows 35. Re6  Rxe6 36. Bxe6 Kxe6 37. f4, where white has simplified into an easily won k p ending.  Simplification is an important endgame strategy.",
        "35. Rh5 Rg4 36. h3 Rf4 37. g3 hxg3 38. fxg3": "Now, white has three passed pawns, of which two (g and h-pawns) are connected.  Connected passsed pawns are a real force in the ending, because they can help protect one another as they advance.",
        "38... Rf6 39. g4": "The march begins.  Passed pawns are very strong in endings, because it forces piece to try and blockade them.  Tieing a piece down to the defense of a square limits its mobility, which in turn limits its power.",
        "39... Kd6 40. g5": "40. e5  is another winning move.",
        "40... Rf8": "40. ...Rg6 would've only prolonged the struggle.",
        "41. g6": "Notice that the bishop covers the g-pawn's queening square.  Black cannot stop the advance of the pawn.",
        "41... Ke7 42. g7": "1-0 The key to this game was white's aggressiveness after he got a lead in development.  He continued to make threats while developing, which forced black to make further concessions.  White then cashed in on his advantage in time by winning material.  His lead in development was so great that he was able to continue to attack and win even more material.  By the time black finally got untangled the material deficit was so great that resistance was futile. "
    },
    "url": "https://gameknot.com/annotation.pl/international-chess-dogs-team-2-mini?gm=2945",
    "gameName": "International Chess DOGS Team 2 Mini",
    "players": "claukonen (1830) vs. dieu270 (1435)",
    "opening": "Philidor's defence (C41)"
}