{
    "moves": {
        "1. e4 e5 2. Nf3 d6": "Black plays Philidor's Defense",
        "3. Bc4 h6": "A very passive move.  Better is 3...Be7 to look to castle or 3...Nc6 to develop the knight",
        "4. d4": "Breaking open the center and freeing the dark-squared bishop.",
        "4... exd4 5. Nxd4 c5": "Although it fends off the knight on d4, this move creates a backwards pawn on d6 that white will look to attack and an outpost for a white piece on d5.",
        "6. Nf3 Qe7": "Black looks to attack white's e-pawn but blocks the development of black's dark-squared bishop",
        "7. Nc3 g5": "An extremely aggressive attack by pushing black's kingside pawns and black will also look to develop his bishop on the a1-h8 diagonal.  This will make blacks king vulnerable in the long-run if he chooses to castle kingside",
        "8. h3 Bg7 9. O-O Nf6 10. Re1 O-O": "With no development on blacks queenside, black plays 0-0 even though his pawn structure is shattered on the kingside.  Castling queenside here would most likely have been better for his king's safety",
        "11. b3": "Looking to contest the a1-h8 diagonal with Bb2.  White is leading in development",
        "11... Rd8 12. Bb2 Be6 13. Nd5": "Taking advantage of the outpost on d5.  Black has to take here 13...Qd7 14. Nxf6+ Bxf6 15. Bxf6 loses a piece",
        "13... Bxd5 14. Bxd5 Nxd5 15. Bxg7 Nf4": "Instead of taking back the bishop with 15...Kxg7, black looks to continue his original plan by bull rushing white's kingside.",
        "16. Bb2": "White's bishop has a wide-open diagonal peering into black's kingside defenses",
        "16... Qe6 17. Kh2": "defending 17...Nxh3+ 18. gxh3 Qxh3",
        "17... f6": "? Black misses 17...g4 which would open up white's defenses and threaten the king",
        "18. e5 f5 19. exd6 Qxd6 20. Qxd6 Rxd6 21. Re8+ Kf7 22. Rae1": "Now all of white's pieces are developed and organized for a devastating blow.",
        "22... b6": "?? Better is 22. Rd7 which prevents R1e7+, b6 does not prevent the attack",
        "23. Re1e7+ Kg6 24. g4": "Cutting off h5 and looking for mate",
        "24... fxg4 25. hxg4 Nc6": "Finally developing all of his pieces but it is too late as mate is inevitable",
        "26. Rg7#": "I am trying to become a better player so comments would be much appreciated.  Feel free to annotate any of my games (especially my losses) because I would love to learn where I went wrong and how I can improve."
    },
    "url": "https://gameknot.com/annotation.pl/intermediate-chess-philidor?gm=37204",
    "gameName": "Intermediate Chess - Philidor",
    "players": "jwb5400 (1424) vs. kknievel1 (1262)",
    "opening": "Philidor (C41), Steinitz variation"
}