{
    "moves": {
        "1. e4": "Hi everyone, I am taking a trip down memory lane, in fact 12 years ago.  This is my second local Bury League Match.  This is Cambridge City Chess Club playing against the ICI Sheepdogs in a place called Stowmarket somewhere in Suffolk, United Kingdom.  I was on board 4 of 4 in that match.  I had to do the driving, so it was very nice to drive home after what happened in this match.",
        "1... e6": "1.......... e6 - The French Defense.",
        "2. d4 d5 3. Nd2": "3. Nd2 - the Tarrasch Variation of the French Defense, backing up the e pawn and if the pawns are exchanged the knight will have a fine outpost on e4.",
        "3... dxe4 4. Nxe4 Nf6 5. Nxf6+ Qxf6 6. Nf3": "6. Nf3 - I decided to take on e4 - not sure that was wise though.  A knight exchange on f6 follows shortly after that.",
        "6... h6 7. Bc4 c5 8. O-O Nc6 9. c3 Bd6 10. Be3 O-O 11. dxc5 Bc7 12. Re1 Ne5 13. Bd4 Nxf3+ 14. Qxf3 Qxf3 15. gxf3": "15. gxf3 - after blundering a pawn on my 10th move, I try and negate white's advantage by shattering her kingside pawn structure.",
        "15... Bd7 16. Bd3 Rfe8 17. Be4 Rab8 18. Rad1 f5 19. Bc2 Bc6": "19. ......... bc6 - putting pressure on the white f3 pawn.",
        "20. Kg2 Re7 21. b4 Rbe8 22. c4 a6 23. a4 e5 24. b5 exd4 25. Rxe7 Rxe7 26. bxc6 bxc6 27. Rxd4 g6": "27. .......... g6 - pawn pushes and exchanges over the last few moves have resulted in both players having pawn islands.  White has islands on both sides and black has an island on the queenside.  Black is still a pawn minus but I am hoping for a drawn ending with opposite bishops once the rooks have been swapped off. ",
        "28. f4 Kf7 29. Bd1 Re4 30. Rd7+ Re7 31. Rxe7+ Kxe7": "31. ........... Kxe7 - now the rooks have been swapped off and it seems to be heading for a draw, but there are a few surprises yet.",
        "32. Kf3 Ba5 33. Ke3 Ke6": "33. ......... Ke6 - both kings centralise themselves for the endgame.",
        "34. Bf3 Kd7": "34. ......... Kd7 - to protect the pawn on c6.",
        "35. Kd4 Be1 36. Ke5": "36. Ke5?? - white is thinking about gobbling up my kingside pawns but my bishop has other ideas.",
        "36... Bc3#": "36............. such as Bc3# - Old Matey Strikes out of the blue!  Incredibly the white king has no squares to go to, the check cannot be blocked, the bishop cannot be captured so all this equals ........... CHECKMATE!!\r\n\r\nWhat a finale to a seemingly boring endgame!"
    },
    "url": "https://gameknot.com/annotation.pl/into-the-valley-of-death?gm=17270",
    "gameName": "Into the Valley of Death",
    "players": "Vicky Allen (1376) vs. Joanne Stevens (1240)",
    "opening": "French (C03), Tarrasch"
}