{
    "moves": {
        "1. e4 e5 2. Bc4 Nf6": "The Berlin defence. I thought the knight move was necessary to prevent a Scholar's Mate, should he play Qf3, and it gets me level on development.",
        "3. d3 Nc6": "I moved out my other knight to get ahead on development, and to assert some control of the centre (although d5 and e4 are out of bounds). I must try not to overdevelop my knights though, instead get out my bishops, or even go in for some trades.",
        "4. a3 d5": "I moved up my queen's pawn to fork his bishop and king's pawn hoping to trade my bishop for his knight, so my queen can emerge, and that would leave me well ahead on development...",
        "5. exd5 Nxd5 6. Bxd5 Qxd5": "...and I get the trade I was searching. I just hope I haven't developed her too early!",
        "7. Qf3": "Although he contests the long light diagonal...",
        "7... Be6": "...I decline to capture his queen, hoping to enforce the exchange. If I'd taken her (7... Qxf3), he would probably have played 8. Nxf3 to be level on development, keeping his pawn structure solid.",
        "8. Qxd5 Bxd5": "We therefore agree to trade our queens, and again I'm well ahead on development, with my bishop and knight controlling the centre. I think this was quite a good trade for me, as his best weapon has departed the scene (along with mine).",
        "9. f3": "He moved up his pawn to prevent his pawn structure from being distorted: had he played 9 Nf3, I would have played 9... Bxf3, forcing 10. gxf3, distorting his pawn structure, making his kingside pawns easy targets...",
        "9... O-O-O": "....however, as it was, I thought queenside castling was the way to go here, as my rook now defends my bishop.",
        "10. Nc3": "He's developed his knight to attack my bishop, but it's defended by my rook, and I'm not too worried about it landing on b5, as the pawn on a7 is defended by knight. If it does capture my bishop, my rook can gain tempo...",
        "10... a6": "...but I move up my pawn to guard the b5 square, to make sure that the knight cannot enter it. I'm still hoping he'll take my bishop...",
        "11. Bd2": "...but he moves his own up to allow for queenside castling...",
        "11... Be7": "...so I move out my dark-square bishop to connect my rooks, without it gaining too much tempo, in case it has to retreat. It could be used as bait, as it the knight captures its twin, it will be under attack...",
        "12. Nxd5 Rxd5": "...and I get the piece exchange, with my rook gaining some tempo, onto the 4th rank.",
        "13. Bc3": "He mow puts his bishop onto the long diagonal, to attack my pawn, no doubt hoping to play 14. f4 to attack my pawn, although my knight would take back should he play 15. fxe5, with a possbile piece exchange, although he could castle queenside...",
        "13... Nd4": "...and I move up my knight, hoping to win the pawn on c2, and the rook, on a1, or trade pieces on d4...",
        "14. O-O-O": "...but he reads this move, castling queenside, with his rook now defending the pawn on d3. However, the piece exchange is still on...",
        "14... Bg5+": "...and I decide to check, with offering the possibility of exchanging bishops on d2...",
        "15. Kb1": "...but he moves his king away, keeping his counterplay options open...",
        "15... f6": "...so I move up my bishop's pawn to protect it, and to help my king's pawn, although I may have actually blocked in my bishop...",
        "16. Bxd4 Rxd4": "...and again we trade pieces, giving my rook a bit more tempo, being so high up, with a possibility of doubling on the d-file, although Ne2 would force it back...",
        "17. g4 c5 18. Nh3": "...but the knight attacks my bishop from the other side...",
        "18... Bf4": "...so I move my bishop forwards, so another piece exchange would ensure my doubled pawns would support my knight's pawn up the board, without any being isolated...",
        "19. c3 Rd5": "...but my rook is forced to retreat one rank...",
        "20. d4": "...and it looks as though I'm going to lose a pawn should he play 21 dxe5...",
        "20... Rhd8": "...but this was a very good move by me, connecting my rooks on the d-file, forcing the pawn into a passive position, as if it captures, I can take two rooks for the price of one, so instead of losing a pawn, I'm about to win one...",
        "21. Kc2 cxd4": "...which I do here...",
        "22. cxd4 Rd5xd4": "...which is actually two pawns for the price of one...",
        "23. Rxd4 Rxd4": "...and with the extra pawn, I get the first rook exchange...",
        "24. Rd1": "...but yet again, an opponent gives up the other one! Was this the right thing to do?",
        "24... Rxd1 25. Kxd1": "If you said no, you were right...",
        "25... Bxh2": "...because the rook exposed its pawn, which I accept. I had used the conditional move to program 25... Kd7, but I realised that the pawn was up for grabs in time. I think I captured an important pawn there, as its neighbour now has support from only one pawn.",
        "26. Ke2 Kd7 27. Ke3 Bf4+": "I now decide to offer to trade the remaining pieces, being two pawns ahead...",
        "28. Nxf4 exf4+": "...which is what happens...",
        "29. Ke4": "...but he declines to take my doubled pawn...",
        "29... g5": "...so I give it some protection, from the pawn it is now supporting...",
        "30. Kf5 Ke7": "...and I give the pawn protecting it some protection from my king. I think I'm restraining the king very well here, as he only has one available square...",
        "31. Ke4": "...into which he moves. ",
        "31... Ke6 32. Kd4 b6": "Now there's no way for the king to enter my territory...",
        "33. Ke4": "...so he moves back again...",
        "33... h6": "...so I bring up my idle pawn, possibly to waste a move...",
        "34. b3 a5 35. b4 axb4 36. axb4": "...and the pawn exchange was, I believe the right way to go here, being up by two...",
        "36... f5+": "...so I decide to check with one of mine...",
        "37. Kd4": "...but why didn't he take it? I couldn't take back, as the pawn would be protected by his king, although I would be able to eventually remove it, and I would have a passed pawn on h6, which probably explains why he didn't capture on f5.",
        "37... fxg4": "As it is, I decide to take his own pawn, making my pawn on h6 passed...",
        "38. fxg4": "...and he takes back, making my pawn on f4 passed. I should be able to win here...",
        "38... f3 39. Ke3 Kd5 40. Kxf3": "...so I give up my most advanced pawn to threaten the one on g4, to use the kingside majority to win. He probably had to stop it anyway, to prolong the inevitable.",
        "40... Kd4 41. b5 Kd3 42. Kf2 Ke4 43. Kg3 Ke3 44. Kh3 Kf3 45. Kh2 Kxg4": "That move allowed my king to finally capture his remaining kingside pawn to make mine passed...",
        "46. Kg2 h5": "...and he resigns here, as he knew he couldn't stop all my pawns."
    },
    "url": "https://gameknot.com/annotation.pl/inviting-the-exchanges?gm=26566",
    "gameName": "Inviting the exchanges",
    "players": "ypled (1661) vs. aspiemikey (1398)",
    "opening": "Bishop's opening (C24), Berlin defence"
}