{
    "moves": {
        "1. Nf3": "Hi everyone!\n\nThis game will be categorised under the heading \"King in the Centre\".  Henry does get caught in the centre after an exchange of queens but unlike King Myrridin, Henry does not become involved in tactical shots based around him and in this game he manages to hold my position together like glue - just like his absent spouse Glenda tended to do.  It is not often now that I give away the result of the game at its commencement but I would like you read on just to find out how only my 4th draw in 37 games against The Coach came about.",
        "1... Nf6": "1. …. Nf6 - after starting with the Reti, Coach Ion replies by bringing out his own knight.",
        "2. c4": "2. c4 - kind of transposes into an English Opening.",
        "2... e6 3. Nc3": "3. Nc3 - out comes Sir Lollabout!",
        "3... d5 4. d4 dxc4 5. Qa4+": "5. Qa4+ - and out comes Glenda!",
        "5... c6 6. Qxc4": "6. Qxc4 - who zaps Ion's pawn on c4 to regain material parity.",
        "6... b5 7. Qd3 a5": "7. …… a5 - pawn roll.",
        "8. e4": "8. e4 - I counter in the centre with a pawn roll of my own.",
        "8... b4 9. Na4 Bb7": "9. …. Bb7?! - GA marks this down as an inaccuracy.  Difficult to see what is wrong with the move though.",
        "10. Bg5 Be7 11. e5 Nd5": "11. …… Nd5 - a black horsie now makes d5 a permanent residence.",
        "12. Bxe7 Qxe7": "12. ….. Qxe7 - bishop trade.",
        "13. Nc5": "13. Nc5 - I find an outpost of my own.",
        "13... Na6 14. Nxb7 Qxb7": "14. ….. Qxb7 - N for B trade.  I did not like the possibility of Ion's lsb landing on a6 so I thought I would trade it off.",
        "15. g3 O-O 16. Bg2": "16. Bg2 - only one move away from castling.  This does not happen because Ion offers me a queen trade.  I think very carefully before I accept it because if I do then there is a possibility of a black rook invasion down the c column later down the line.",
        "16... Qb5 17. Qxb5 cxb5": "17. ……. cxb5 - Ion does saddle himself with doubled pawns after this trade though but unfortunately I was unable to exploit this.",
        "18. Rc1 Rfc8 19. Kd2": "19. Kd2! This move prevents a rook invasion on c2 and as there are not so many pieces on the board and the rooks will soon be traded off, the centre becomes the right place for a king.",
        "19... Rc4 20. Rc2": "20. Rc2 - prepare to double!",
        "20... Rxc2+ 21. Kxc2 Rc8+ 22. Kd2": "22. Kd2 - one pair of rooks is traded off and Henry just shuffles back to d2 to allow my remaining rook to come to c1.",
        "22... a4": "22. ….. a4 - looks strong but it does make Ion's b pawns potential targets later on.",
        "23. Rc1 Rxc1 24. Kxc1": "24. Kxc1 - the final pair of rooks are traded off and we now have a two piece endgame.  In my Jo against the Titans MT Part 5, this game is now offering me the best chance of avoiding nul point as in my other games against the 3 Daves, Dynamic Dave, Dave Patron and Dave Rundle (all who had ratings of over 2400!) I have had to deal with being canned in the middlegame.  I also lost my game with the black pieces against Ion so it was great to reach a position like this against The Coach who, in this game was due to reach the dizzy heights of Masterdom!",
        "24... Nac7": "24. …… Nac7 - Ion's knights each back up a b pawn.",
        "25. Ne1 Kf8 26. Nd3": "26. Nd3 - putting pressure on b4.",
        "26... f5 27. exf6 e.p. gxf6": "27. gxf6 - pawn trade.",
        "28. Kd2 Ke7 29. f4": "29. f4 - to widen Fou Leblanc's scope.",
        "29... Kd6": "29. …… Kd6 - King Ion makes for my IQP but Fou Leblanc will not allow him to land on d5.  So long as Fou Leblanc keeps on that diagonal this vulnerable pawn is safe.",
        "30. Bf3": "30. Bf3 - followed by DRAW OFFER which Ion accepts.  This ensured that I signed off that MT with un demi point and my sixth Master Draw.  Coach Ion felt I had the better of it and GA gave me a plus score of 0.54.  GA also could not detect any errors in my game so an error free game against the Coach is a miracle in itself! I, however, was a little worried about that aforementioned IQP and I felt tied down to defending it, although I was also putting pressure on Ion's queenside pawns by means of Sir Slugabout.  So I can only conclude that this IQP weakness has prevented me from cooking Coach Ion's Xmas turkey and has saved his bacon and possibly the chipolatas that go with it!"
    },
    "url": "https://gameknot.com/annotation.pl/iqp-saves-coach-ions-bacon?gm=65851",
    "gameName": "IQP saves Coach Ion's bacon!",
    "players": "jotheblackqueen (1875) vs. archduke_piccolo (2201)",
    "opening": "Reti opening (A05)"
}