{
    "moves": {
        "1. Nf3": "First game annotation. Hope you'll enjoy the upside down Irish weather in this game.\r\nI'd like t annotate this game cause Yann brings me a lot of thought after that my attack that probably was under-analyzed.\r\nLet's start with a Reti ",
        "1... d5": "Black take the centre with queen pawn",
        "2. d4 Nf6": "Symmetrical position ",
        "3. c4": "Gambit offered to then take the centre but Yann doesn't like gambits . ",
        "3... e6 4. Nc3": "Develepping",
        "4... Bb4": "Pin",
        "5. Bg5": "Counter pin to prevent Ne4",
        "5... Nbd7": "Think this move is too passive for the game and stop the light square bishop and queen on any move.. but Yann has always somthing prepared....",
        "6. cxd5": "I decide to break the pressure on the centre and open c file.",
        "6... exd5 7. Qc2 b6": "Fianchetto preparation and my king is not ready to castle yet..",
        "8. Nd2": "removing the pin from the knightand defend e4",
        "8... Bb7": "as preview bishop enter in the ame with a strong diagonal ",
        "9. g3": "I need to counter this attack... so Fianchetto as well for white",
        "9... Be7": "Black decides to step back and reorganize his troops ",
        "10. Bg2": "Time to place my LSB",
        "10... h6": "Yann doesn't like my bishop in his field and gently asked to move it away",
        "11. Bf4": "Relocation to f4 for intersection in c7",
        "11... c6": "Clever Yann see this and stop immediately all my dreams",
        "12. O-O": "Safe King",
        "12... Rc8": "Black rook on a c file half open.. this could be annoying but I see a possible combination .",
        "13. e4": "Time to decide for the centre. ",
        "13... O-O": "Castling",
        "14. Rfe1": "rook ready to enter in action",
        "14... Re8": "Yanu load as well his canon",
        "15. e5": "I decide to not exchange and I prefer enter in his field with e pawn",
        "15... Nh7": "Not the only solution but propbably the safer",
        "16. Bh3": "Centre closed , I can load my light square bishop ready for action",
        "16... Ndf8": "Here Yann give up a rook?? I don't feel so confortable with this exchange. Probably is for the relocation of knight. ",
        "17. Nf3": "Anyway I cannot see very much a good plan taking his rook , I prefere to bring into rock another piece",
        "17... Ra8": "Rook place to security area.",
        "18. a3": "This is to prevent a pin ",
        "18... Ng6": "As thought, Knight relocated to better square attacking my BSB.",
        "19. e6": "I decide this is the time! Under attack I counterattack. In fact the knight was defending e6. I saw something and I take the chance.",
        "19... Nxf4": "Yann wanted my bishop and he got it.",
        "20. exf7+": "Tempo taken",
        "20... Kxf7 21. Qf5+": "I could take one of the kight but much better to have a check in between.",
        "21... Nf6 22. Qxf4 Bc8": "Black see the danger and want to remove some pieces from the board",
        "23. Ne5+": "I go for another check with a small combination in my pocket ^__^",
        "23... Kg8 24. Nxc6": "Treating queen",
        "24... Bd6": "very nice answer from Yanu. and here we are.. How to start, from where? \r\nAt this time of the game I realized my plan was not so great. my LSB is in a big danger since 3 moves and now even more.\r\nQueen under attack.Knight isolated.. I need a very strong move to get out of this situation without big damages..",
        "25. Rxe8+": "I go for a check !",
        "25... Qxe8 26. Qxd6 Bxh3": "I remove the danger but i finish in a position very critical where my king cannot move and my queen is too exposed.\r\nHere I understood I had fight at my best to resist the attack that is on his way... ",
        "27. Ne7+": "To let the knight move to a better square",
        "27... Kh7 28. Re1": "Very risky this move!! ",
        "28... Qh5": "Black has  a mate in 2!!",
        "29. Qf4": "Obliged",
        "29... Re8": "Support from the back. Wow I'm almost dead",
        "30. f3": "Need a way to escape from this bunker!",
        "30... Qf7": "Knight in emergency..",
        "31. Qe3": "Queen support and a bit of air after few moves in apnea",
        "31... Be6": "Miscalculation from Yanu.Wanted to isolate my knight but bishop is free to be taken.\r\n",
        "32. Qxe6": "Obviously i go for it.",
        "32... Qh5": "Yann decide to continue to attack my poor defence",
        "33. g4 Qh4": "rook in danger",
        "34. Qf5+": "check to break pawn defense",
        "34... g6 35. Qxg6+ Kh8": "I can see a nice royal fork but not easy to put it on place.",
        "36. Re5 Rf8": "With one piece more I need to close the game before Yann has the time to react",
        "37. Nf5": "Menacing mate on g7 and queen attack",
        "37... Qg5": "The only move",
        "38. Qxh6+": "Let move out of the board the 2 ladies",
        "38... Qxh6 39. Nxh6 Nd7": "Here the game is over, just few more move for the playout",
        "40. Rxd5 Nf6 41. Rf5 Kg7 42. g5 a6 43. Rxf6 Rxf6 44. gxf6+ Kxh6 45. d5 Kg6 46. Ne4 Kf7 47. h4": "Hope you enjoyed"
    },
    "url": "https://gameknot.com/annotation.pl/irish-weather?gm=28928",
    "gameName": "Irish weather",
    "players": "el-rancho (1753) vs. salmar (1520)",
    "opening": "Reti opening (A06)"
}