{
    "moves": {
        "1. e4": "Hi everyone!\n\nIt has been a while since I annotated a game.  I will copy this into both David Patron's and Charleshiggie's group for both Mentors to read and I will also create a thread about Damiano's Defense in my Unusual Openings Series.  In this game, for black, it all ends quickly - alas for him in my favour.  So how did this happen?  Well, just sit back and watch .....",
        "1... e5 2. Nf3 f6": "2. ..... f6?! - this is the move which characterises the Damiano's Defense.  Damiano analysed this move in the 1500s and he was far from happy with the outcome.  This opening, however, as a result of this demo, became permanently associated with this unfortunate Italian dude.",
        "3. Nxe5": "3. Nxe5 - this is Damiano's Gambit.  If it is accepted, then you have three choices. 1. Drop the exchange, 2. Play into a line called the Five Pawns Gambit - funnily enough there was an expert called Sam Sloan who managed to win the game playing black despite being 5 pawns adrift, or c. run into Old Matey.  Hmm, I don't think any of these choices are palatable although I will show you the link below of Sam Sloan's victory with the 5 pawns gambit.",
        "3... d5": "3. ..... d5 - an unusual response to my sacrifice.  He doesn't take the knight, but this move is just as bad.  Better is the Macgregor/Chigorin Variation with 3. .... Qe7.  At least this gets the pawn back but it does leave the Wicked Witch of the West a little vulnerable, particularly after white castles as you will see in my game \"Damiano's Defanged\" against dmaestro.  As a result of this d5 move, Chris is now gonna get a visit from Glenda!",
        "4. Qh5+": "4. Qh5+ - CHEEEECK! - In she comes on her broomstick!  Suddenly Chris' king is in Old Matey's shadow.  Glenda is eagerly eyeing up f7, the Scholar's Mate square.  Black does have a defense, however, and that is either Ke7 or g6.  Chris chooses the latter.",
        "4... g6 5. Nxg6": "5. Nxg6 - but now comes another sacrifice.  Chris can either lose a whole rook or the exchange as the rook on h8 is trapped in the corner.  Chris accepts the sac and drops the exchange.",
        "5... hxg6 6. Qxh8": "6. Qxh8 - so, where a black rook should be, at this stage of the opening, is Glenda!  Now the knight on g1 is in danger of being picked off.",
        "6... Ne7 7. d4": "7. d4 - I know that my development is a little slow here, but at least this move clears the path for Fou Lenor to come to h6 and exploit the pin on black's dsb on f8.",
        "7... Nbc6 8. Bh6": "8. Bh6 - voila!",
        "8... Nxd4": "8. ..... Nxd4 - black attempts some counterplay by threatening a fork on c2.  However, it is my turn to move and now Glenda creates mayhem.",
        "9. Qxf8+": "9. Qxf8+ - now isn't this cosy?!  Chris's king sure is one lucky bloke - he is neatly sandwiched between two ladies!  But one of those ladies, Glenda, is deadly to him!  The BK must now start running for his life.",
        "9... Kd7 10. Qxd8+": "10. Qxd8+ - I would have liked to have kept the queens on the board, but Glenda has no other checking move than to take off the Witch and lose her own life in exchange.  Any non-checking move from Glenda will result in that fork on c2.  I could leave her where she is because at least she is defended by Fou Lenoir after I play Na3.  Still, now that I am a rook up it is better to trade the remaining major pieces.",
        "10... Kxd8 11. Na3": "11. Na3 - stops the fork and develops a piece.  I am now ready to castle queenside.  When the queens are off and I get the option of castling, I usually prefer to put Henry on the queenside, keeping all options open.",
        "11... f5 12. exd5": "12. exd5 - I now offer up a pawn.  Black accepts but this one is laced with poison.",
        "12... Nxd5 13. O-O-O": "13. 0-0-0 - I finally manage to castle and this move prompts immediate resignation from my opponent on the grounds of ruinous loss of material.  Both black knights are skewered by my rook and only one can be saved.  13. ..... c5 does not cut the mustard because I can still win the knight on d4 with the pawn stab, c3.  Black already 6 points down in material will therefore be the equivalent of a whole queen behind.  Chris decided that was just too much.  Ah well, time to create that thread!"
    },
    "url": "https://gameknot.com/annotation.pl/is-damianos-defense-playable?gm=49111",
    "gameName": "Is Damiano's Defense playable?",
    "players": "jstevens1 (1933) vs. chrisforbes21 (1175)",
    "opening": "Damiano's defence (C40)"
}