{
    "moves": {
        "1. Nf3": "Hi everyone!\n\nI see you all enjoyed my game against Expert X in which Henry got entombed on the kingside.  That is really something!  I'd much rather not be on the receiving end of such a mating attack but it was certainly fascinating and awesome to watch.  Anyhow, I do get a huge slice of consolation for my loss - another Expert Draw, courtesy of Operation Joblock.  Dave, my opponent is a very strong player and his rating was only 25 points shy of Masterdom when we agreed that draw, so I was really, really chuffed to keep him out!  So how did this happen?  Well, let's start with Dave's first move - 1. Nf3 - the Reti Opening, named after a GM called Richard Reti who just lurved sticking his knight on that square.  This opening can transpose into a myriad of queen pawn openings, or the English Opening.",
        "1... Nf6 2. c4 g6": "2. ..... g6 - this is more akin to the English Opening.  Sooner or later white is bound to fianchetto his bishop on g2.  In this game, however, it doesn't happen.",
        "3. Nc3 Bg7 4. e4 d6 5. d4": "5. d4 - white is developing a very strong centre.  After getting Henry to safety(?) on the kingside, this time I do manage to puncture an Expert's strong pawn centre in a timely fashion!  At least with the g7 pawn already moved, white would be hard pushed to find a smothered mate here!",
        "5... O-O 6. h3 e5": "6. .... e5 - now comes the push.  Dave pushes his pawn onwards rather than exchange.",
        "7. d5 a5": "7. ..... a5 - holding back b4.",
        "8. a3 Na6": "8. ..... Na6 - preparing a possible Nc5.",
        "9. Bg5 h6 10. Be3 Nc5 11. Bxc5 dxc5": "11. ..... dxc5 - B for N trade.",
        "12. Bd3 Ne8": "12. .... Ne8 - hmm, Dave misses Nxe5.  However, there is the possibility of regaining my pawn by taking off his e4 pawn with my knight, discovering an attack on e5.  So, after 12. Nxe5, Nxe4 13. Nxe4, Bxe5, material is even.  However, I notice that the pawn is hanging so I decided to open up the h8-e5 line for Fou Lenoir.  I think my knight would be well placed on d6, hitting out at e4 and c4.  On the next turn that is just where my knight goes.",
        "13. Bc2 Nd6 14. Qe2 b6": "14. .... b6 - now I want to solidify my queenside pawn structure.",
        "15. Ba4 Bd7 16. Bxd7 Qxd7": "16. ..... Qxd7 - after a trade of bishops, Glenda comes out to play and reinforces the b5 square.  I don't think I would mind a white pawn on b5 though.  The seed of the Joblock Plan is already beginning to germinate.",
        "17. b3 Rad8 18. O-O Rfe8": "18. ...... Rfe8 - just a little bit of scratching around to see what Dave does.  Although I am stumped for a plan here, at least I can put my rook on the same file as the Wicked Witch of the West.  Although I got into bother in my last game doing this, on a central file, I think it is OK here.",
        "19. Rfc1 Rdc8 20. Ra2 Rca8": "20. ..... Ra8 - Hmm, I think Dave is trying to double rooks on the a column.  I think my heavies ought to be in the near vicinity of it to prevent any ingress of white pieces into my pos!",
        "21. Ne1 Qc8 22. Nd3": "22. Nd3 - Dave mirrors my plan of putting pressure on e5 and c5.  I think Fou Lenoir and my f pawn could be up to the task of defending e5 though.  c5 is already reinforced with a pawn on b6.  All very solid.",
        "22... Qb7 23. Qg4 Qc8": "23. ..... Qc8 - Glenda my Good Witch of the North and the Wicked Witch of the West glare at one another on the c1-h3 column.  Will there be a trade off?  We shall see.",
        "24. Re2 Qxg4 25. hxg4": "25. hxg4 - I trade, and now Dave has to contend with a doubleton on the kingside.  With me having a doubleton on the c column this appears to even up the game a little, although I may have to keep an eye on my h6 pawn because it is possible for Dave to double rooks on that column and try and provoke an ingress on it.  This must be prevented.",
        "25... f6 26. g3 Kf7 27. Kg2 Reh8": "27. Rh8 - I think I will have one rook plus either Fou Lenoir or Henry guarding my h6 pawn.  This will free my other rook to move wherever he likes on the first rank.  My knight will hold firm on d6.  I have confidence that I can prevent an ingress and a zugzwang.  This can only mean one thing for me and Dave.  My mouse is already beginning to hover over that Offer Draw button!",
        "28. f4 Rhe8 29. a4 Kg8 30. Rh1": "30. Rh1 - before I hit the button, I must make doubly sure that Dave cannot make ingress.  Here, he is trying to pile up on the h column.",
        "30... Re7 31. f5 g5": "31. ...... g5 - Dave told me in a post-match pm that he thought that this was the move that threw away half a point.  Not sure there.  According to Gameknot Analysis it was an error-free game.  Neither side had committed so much as an inaccuracy.  Dave however thought that it had given me the chance to sew up the kingside.  He is right on there, but can he do something on the queenside?!  We shall see.",
        "32. Kf3 Kf7 33. Nb5": "33. Nb5- Dave finally puts the question to my knight on d6.  I have been wondering whether he will do this for many moves now.  I decided to trade.  At least it does lock up b5 as I stated in one of my previous notes in the early part of this game.",
        "33... Nxb5 34. cxb5 Rh8": "34. .... Rh8 - now my queen rook decides to move to h8 and it is my king rook which will have a few moves at his disposal.",
        "35. Nb2": "35. Nb2 - aha, this knight is trying to make an ingress into d6 and support a possible advance of the d pawn.  I must prevent this.  I have a concrete plan and once I execute it, I will then hit the offer draw button.",
        "35... Rd7 36. Rd2 Bf8 37. Nc4 Bd6": "37. ..... Bd6 - Fou Lenoir occupies the berth that my queen knight had before I traded him off.  Now, Dave can trade off Fou Lenoir with my good blessing.  If he does then a black pawn will occupy the d6 square.  If Dave does double rooks on the h file then Henry will help my KR defend my h6 pawn.  This will free up my QR to move wherever he likes.  There seems to be no way of ingress.  The only way Dave can try to make progress is to sac his backward b3 pawn.  However, this is very risky and I didn't think that Dave would want to take such a risk.  I had in fact worked out that I would have been able to defend against this sac with my queen rook which would in turn support a passed black pawn.  At this juncture I decided to offer a draw.  I remembered something that Coach Ion had said in my epic draw game against The Master Mater.  \"Bad Bishops make excellent defenders!\"  I quoted that line to Dave in the chat after putting in my draw offer and he agreed with me and told me he would accept my offer and that I had given him a good game.  After acknowledging his complements with \"Thanks\" he then accepted my draw offer.  So, after incurring losses against IM Albertwall and Expert X, it was a great way to end my weekend!"
    },
    "url": "https://gameknot.com/annotation.pl/its-that-joblock-yet-again?gm=49745",
    "gameName": "It's that Joblock ....... yet again!!",
    "players": "dynamic_dv (2175) vs. jstevens1 (1931)",
    "opening": "Reti opening (A05)"
}