{
    "moves": {
        "1. d4": "Hi everyone! Here is an instructive game I played at my local chessclub RSR Ivoren Toren in Rotterdam, the Netherlands (hence the name of this game).\n\nI needed this win to be able to qualify for promotion to the next group and quite coincidentally I got the white pieces against Rampersad. \nA couple of weeks ago I was present when he was analyzing one of his games where he also had the black pieces and they had played the QGD, symmetrical variation, wich ended in a draw. But I had checked out the opening at home and found a small improvement for white, so now it was a good opportunity to show it! Enjoy...",
        "1... d5 2. c4": "At this point ofcourse I was wondering:''Will he play 2...c5?''. I remember the adrenaline pumping trough my body....",
        "2... c5": "Yes...ofcourse, like I said, the last game he played with this variation ended in a draw ( against the leading player in our group ), so why not try it again...",
        "3. cxd5": "The best move here.",
        "3... Qxd5": "Going for the same line he played against Fung*. \n*( M. Fung was the leading player at the moment in our group with a current KNSB rating of 1816. The game I played against him ended in a quick draw.)\n",
        "4. Nf3": "! Though not really worthy of an exclamation mark, this move is my first improvement. Fung had played 4.Nc3 when the game continued with 4...Qxd4 5.Qxd4 (5.Nf3!) 5....cxd4 6.Nb5 Kd8 6.Nxd4",
        "4... cxd4": "The most common continuation.",
        "5. Nc3": "This is all known theory ofcourse. Black has two common responses, 5...Qa5 and 5...Qd8. But allready white has won a tempo, since the queen must retreat.",
        "5... Qd8": "White has developed both knights, while black has yet to develop a piece! ",
        "6. Nxd4": "It's more common to take with the queen here, but I decided I didn't want to swap queens, going for sharp play and avoiding a draw.",
        "6... Nf6": "Black has to start bringing his pieces into action.",
        "7. Bg5 e6 8. e3 Be7": "Both sides developing their pieces...",
        "9. Bd3 Bd7 10. O-O Nc6 11. a3": "Perhaps 11.Nf3 is slightly better here, but I wanted to stop the c6-knight from jumping to b4, since I was planning to move my queen to c2.",
        "11... Nxd4 12. exd4 Qb6": "The queen attacks both pawns on b2 and d4.",
        "13. Qc2 Rc8": "Pinning the knight on c3.",
        "14. Rad1": "!? This pawn sacrifice is just too tempting. ",
        "14... Qxd4": "To say this is a blunder goes too far, but I would have considered another move  here. Actually 14...h6!? is the best chance for black here; 15.Be3 O-O with a more or less equal position. ",
        "15. Bb5": "Now white has a clear edge, because the black king is in a vulnerable position, for example 15...Qg4 16.Bxd7  Nxd7 17.Bxe7 Kxe7.",
        "15... Qc5": "Ok...what now? I'm still a pawn down...",
        "16. Bxd7+": "? Computer analysis shows a better alternative here: 16.Bxf6 Bxb5 17.Bxg7 Bxf1 18.Bxh8 wich is winning for white. But hey, my name is not Fritz, so I came up with another plan...",
        "16... Nxd7": "The position  is now equal again.",
        "17. Bxe7 Qxe7 18. Qa4": "The point. The queen attacks the pawn on a7 and simultaneously prevents black from castling since that would leave the knight 'en prise'. (For your information, en prise is a French expression meaning that a piece is unprotected and may be captured.)",
        "18... a6": "?? 18...Rc6 was the only move here, but black didn't want to give up his extra pawn.",
        "19. Nd5": "! White now has an overwhelming position.",
        "19... b5": "?? Black cracks under the pressure. Ofcourse the knight can't be taken because of 19...exd5 20.Rfe1",
        "20. Qxa6": "?? At this point I was so focused on taking back the pawn that I missed 20.Nxe7 bxa4 21.Nxc8, wich ofcourse leaves white with a decisive material advantage.",
        "20... Qc5 21. Nc3": "Attacking the pawn on b5.",
        "21... Rb8 22. Ne4": "The white knight is quite strong in this game.",
        "22... Qb6": "Now an exchange of queens is inevitable.",
        "23. Qxb6 Nxb6": "The position is again more or less equal now.",
        "24. Nd6+": "Black's b-pawn is now lost, but...",
        "24... Ke7 25. Nxb5 Nd5": "? A decisive mistake. 25...Na4!? 26.b3 Rxb5 27.bxa4 Ra5 would have probably led to a drawn game.",
        "26. a4 Rhc8 27. Rfe1 Nb6 28. b3": "Now white has a better position again, due to the pawns on the queenside.",
        "28... Kf6 29. Nd6 Rc2 30. Rdb1 Nd5 31. Kf1": "!? Setting up a trap for black. ",
        "31... Nc3 32. Rbc1 Rxc1 33. Rxc1 Rxb3": "?? The last couple of moves were played relatively fast, but by this time we were playing for almost two and a half hours. Can you guess what white played next?",
        "34. Rxc3": "! Inspired by the name of our chessclub, the white rook delivers a final blow! (34...Rxc3 35.Ne4 ). At this point black could have resigned, but he decided to fight 'till the end. The rest of the game is probably not so important but I'll post it anyway..Hope you enjoyed!\n\nSarasani",
        "34... Rb1+ 35. Ke2 Ke7 36. Nb5": "36.Nc4 is probably better here.",
        "36... Rb2+ 37. Ke3 Rb4 38. Ra3 f5 39. Nd4 Kf6": "39...Rb6 doesn't save black: 40.a5 Ra6 41.Rb3!",
        "40. a5 e5 41. Nc6": "41.Ne2 leaves black no chance.",
        "41... f4+ 42. Kd3 Rb2": "Black could have tried 42...e4   43.Kc3 Rb1, but white is still winning.",
        "43. a6": "43...e4  is no trouble for white: 44.Kxe4 Re2  45.Kxf4.",
        "43... Kf5 44. f3": "And black finally resigned."
    },
    "url": "https://gameknot.com/annotation.pl/ivory-rook?gm=7796",
    "gameName": "Ivory Rook!",
    "players": "Sarasani (-) vs. Rampersad, W. (1549)",
    "opening": "QGD (D06), symmetrical (Austrian) defence"
}