{
    "moves": {
        "1. e4": "Going into this game, I didn't know what to expect from white.  Looking at white's (short) game history, he looked like a ~1300 player, but it's hard to tell with the opponents he was playing.",
        "1... c5": "I did my usual king's pawn response.",
        "2. d4": "White plunges into main line Sicilian.",
        "2... cxd4 3. Qxd4": "To me, this is a weak move, but a lot of folks seem to like it.  I prefer c3.",
        "3... Nc6": "Chase the queen a little.",
        "4. Qe3": "Good place to hide the queen, except for the king/rook/queen fork it creates on c2.",
        "4... Nf6": "I though long and hard about this move.  I was *really* tempted to play either Nb4 or Qa5  in an attempt to get that king/queen fork, but in the end I decided that any strategy that relies on my opponent making a mistake is a bad strategy.  Instead, I cautiously fall back into king's indian.  I lead with the knight instead of the queen's pawn because e5 is met with Ng4, costing white the pawn.",
        "5. b3": "White prepares to fianchetto the dark bishop.",
        "5... d5": "I had origianlly intended to play d6, but I had been expecting more direct pressure from white.  Since white's last move was non-aggressive, it left me some room to play.  I decided to challenge white for the center.",
        "6. e5": "Another weak move.  As I noted before, it loses the pawn to Ng4.",
        "6... Ng4": "After 7. Qe2 Nxe5, I'm left in control of the center.  White is also left with his queen in front of his king on a half open file...",
        "7. Qe2 Ngxe5 8. Bf4": "Another weak move.  Not only is it not a pin, but it's reversible.",
        "8... Ng6": "Now the white bishop is in jeopardy, my knight's of out reach of a pin, and I'm lined up for e5.  I did screw up the king's indian, but I had already strayed from that path when I saw that I could take the center.",
        "9. g3": "Predictable.  Again white prepared to fianchetto the bishop.",
        "9... e5": "I now own the center, and the bishop is forced to flee.  Time to look towards castling.",
        "10. Bd2": "White retreats to a defensive stance.",
        "10... Nd4": "I now challenge both the white queen and Nxc2 .",
        "11. Qd1": "White falls back and protects c2.",
        "11... Bf5": "I bring additional pressure to the c2 square.  Play should continue 12. Bd3 e4 13. Be2 e3 14. fxe3 Nxc2  15. Kf2 Nxa1",
        "12. Nf3": "However, white failed to see the danger.",
        "12... Nxc2+ 13. Ke2": "I am now in an interesting position.  I could just claim the rook, but I also have the king interestingly cornered.",
        "13... d4": "I now threaten mate with d3  .  In addition, the white queen's knight is now trapped in place.",
        "14. Bg2": "White finds the only safe move.",
        "14... Qd6": "If I can get a queen or bishop onto the a6-f1 diagonal, it's mate.  I have no chance with the bishop, but I can do it with the queen in two moves.  The trick is doing it without making it obvious what I'm doing.  Qd6 lines me up for Qa6   while keeping the focus on the king side.  It also keeps the focus on the black squares, insead of the white diagonal.  As an added bonus, Qa6   is not vulerable to a random a4 like Qb5   is.  My hope was that white would be so concerned with a3, his queen's rook, and my d and e pawns that he would fail to notice the mating diagonal.  And even if white did catch on, the only safe move is Kf1, trapping his rook behind a wall of pieces.",
        "15. Ne1": "As I hoped, white, failed to see the mating diagonal.  Instead he makes a valiant effort to make me pay for the queen's rook with my knight, while at the same time opening up his bishop to attack my unguarded b pawn.  Aside from the part where it was the move that lost the game, it was a really nice play.",
        "15... Qa6+": "It is now mate in 1.  Either we have 16. Kf3 e4   or 16. Nd3 Qxd3  .",
        "16. Kf3": "White opts for my preference for how to end this game.",
        "16... e4#": "Checkmate with no significant pieces captured, and only four pawns removed."
    },
    "url": "https://gameknot.com/annotation.pl/javamoli-v-s-templeton?gm=1688",
    "gameName": "Javamoli v/s Templeton",
    "players": "javamoli (1200) vs. templedf (1512)",
    "opening": "Sicilian (B21), Andreaschek gambit"
}