{
    "moves": {
        "1. d4": "Hi everyone!\n\nThis is my third loss in the Jo against The Titans MT in which I am playing the top rated player in it.  Again, Henry is subjected to a kingside mating attack, only, this time at least you will get to see a king hunt, preceded by sacrifices, which was fun even though I was on the receiving end of it!  So, I will give you the gameknot analysis version of the game (which started out as a Queen's Gambit Accepted) before I start the commentary.  http://gameknot.com/analyze-board.pl?bd=15887004&fb=1&rnd=0.40403936277600444",
        "1... d5 2. c4 dxc4 3. Nf3 Nf6": "3. ..... Nf6 - I start getting my pieces out after accepting the proferred gambit.  Alas, in the Queen's Gambit I will not be able to hold on to my winnings!",
        "4. e3 e6 5. Bxc4": "5. Bxc4 - like this.",
        "5... c5 6. O-O a6 7. Bb3 Nc6": "7. ..... Nc6 - out comes the other knight.",
        "8. Nc3 cxd4 9. exd4": "9. exd4 - pawn trade.",
        "9... Be7 10. Be3 O-O 11. Rc1 Na5 12. Bc2 Nc4": "12. ..... Nc4 - thought I would liven things up a bit - we are now out of the DB.  However, my opponent has something up his sleeve, something that Dongoodman and I talked about in our game - a white steed on e5!",
        "13. Ne5 Nxe3 14. fxe3": "14. fxe3 - I decided to trade off my knight for his dsb.  In retro it was an error.  I should have been more interested in trading off his e5 knight and not that bishop because that f column yet again becomes an avenue for a white assault on Henry.",
        "14... h6 15. Qd3": "15. Qd3 - ssss, here's the Wicked Witch of the West and she is eyeing up h7.  Soon, I fear, it will be time for another Deadly Dash for Henry.",
        "15... Re8 16. Ne4": "16. Ne4 - aaargh!",
        "16... Kf8 17. Nxf6 Bxf6 18. Qh7": "18. Qh7 - as predicted.",
        "18... Ke7 19. Rxf6": "19. Rxf6!! - a brilliant exchange sacrifice to spark off the king hunt.",
        "19... gxf6 20. Qxf7+ Kd6 21. Nc4+ Kc6 22. Be4+": "22. Be4+ - Henry is now lured up the board into white's camp.  It is a very cold, inhospitable place for a king, especially in the middlegame.  Poor Glenda has been given no time to help him on with those medieval stockings which she has been carefully darning for him over the last few weeks.  All she can do is watch and wait for an opportunity to protect him from the Wicked Witch.",
        "22... Kb5 23. Qh5+ f5": "23. ...... f5 - this little pawn tries to screen the Witch from Henry but alas, this time, Operation Joblock is short-lived.",
        "24. a4+": "24. a4+ - Henry is still being hounded by checks.  There is a nice juicy looking p(r)awn for Henry to consume but it has a bad smell about it.  Henry eyes the a column and sees that he will be besieged by Ra1+.  So he opts for b4.  Alas, this square is not safe either!",
        "24... Kb4 25. Qd1 fxe4": "25. ....... fxe4 - It looks as though I am gonna cop Old Matey whatever I do so I have the satisfaction of ridding myself of white's turbulent lsb.  However, here comes the Wicked Witch (who has been eating garlic bread) to prepare herself to give Henry the kiss of death.",
        "26. Rc3": "26. Rc3 - the checks have stopped but this is what is called a Quiet Move.  A non-checking move.  This move threatens Qb3# but there is no way that Henry can escape from Old Matey's dark, dark shadow which descends on the next turn.  So, I must now write out a thousand times, DO NOT ALLOW ENEMY WHITE KNIGHTS TO CAMP OUT ON E5!!  Anyhow, well played, Rainer.",
        "26... Qg5 27. Qb3#": ""
    },
    "url": "https://gameknot.com/annotation.pl/jo-against-the-titans-henry-gets-hunted-down?gm=39274",
    "gameName": "Jo against The Titans - Henry gets Hunted Down!",
    "players": "rwurtinger (2519) vs. jstevens1 (1795)",
    "opening": "QGA (D27), classical, 6...a6"
}