{
    "moves": {
        "1. c4": "Hi everyone!\n\nThis is my return challenge against Janet the Brigadier which was a marginal improvement on my other game with her - I still lost though, sigh and double sigh.  We ended up in a queen ending but alas, Queen Janet, the Wicked Witch of the West outpowered Queen Glenda by a long way!  So, how did this happen?  Well, here is the Gameknot Analysis version: http://gameknot.com/analyze-board.pl?bd=18671614&rnd=0.48246097817512356.  I start off with 1. c4 which is the English Opening and Janet responds by pushing her pawn to f5.",
        "1... f5 2. g3 Nf6 3. Bg2": "3. Bg2 - this kingside fianchetto is typical of the English Opening.",
        "3... e6 4. Nf3 Be7 5. O-O": "5. 0-0 after clearing the kingside decks, I tuck Henry away.  Now for the queenside.",
        "5... d5 6. d4 O-O 7. Nc3 c6 8. b3": "8. b3 - after a bit more development I back up my pawn on c4.",
        "8... Ne4 9. Nxe4 fxe4": "9. ...... fxe4 - knight trade.",
        "10. Ne5 Nd7 11. Nxd7 Bxd7": "11. ...... Nxd7 - and another knight trade.",
        "12. Bf4 Bg5 13. Bxg5 Qxg5": "13. ....... Qxg5 - and now the dark square bishops get traded off.",
        "14. e3 Be8": "14. .... Be8 - uh, oh, heading for h5 and then a possible landing on f3 in an attempt to trade off the lsbs and to effect a support mate with the Witch on g2 should I initiate the trade.  If that happens then I must put Fou Leblanc on h1 so that if the bishops are traded off it will take Janet longer to rustle up this mating attack.",
        "15. Qd2 Bh5 16. Qb4": "16. Qb4 - thought I would try something on the queenside.",
        "16... Rf7 17. Rac1 Be2 18. Rfe1 Qh5 19. Qd6": "19. Qd6 - attacking the weakie at e6.",
        "19... Raf8 20. Qxe6 Bg4 21. Qd6": "21. Qd6? this could be the loser because Janet suggested that Qe5 drew!",
        "21... Rf7xf2 22. Ref1": "22. Rf1 - this rook move results in a plethora of exchanges leading to that Q ending!",
        "22... Rxg2+ 23. Kxg2 Bh3+ 24. Kg1 Bxf1 25. Rxf1 Rxf1+ 26. Kxf1 Qf3+": "26. ..... Qf3+ - voila!",
        "27. Kg1 Qxe3+ 28. Kf1 Qf3+ 29. Kg1": "29. Kg1 - hoping for a draw by repetition but Janet is having none of it and creates a bolt-hole for her king.",
        "29... h5 30. Qe6+ Kh7 31. Qh3 e3 32. Qf1 Qe4": "32. ....... Qe4 - Janet does not trade queens at this juncture because Henry would have been in reach of that nice juicy p(r)awn (would be delicious on top of Ryvita and Quark methinks!) and had it for supper!",
        "33. Qe2 Kg6 34. h3": "34. h3 - scratching around.  If Kf1?? then Qh1#!",
        "34... Qxd4 35. cxd5 Qd2": "35. ..... Qd2 - now Janet tries to force an exchange of queens in more favourable circumstances.  If QxQ?? then the pawn crowns.  I play Qf3?? which loses in a few more moves - I waved that white flag on what would have been my 39th move but Gameknot said that I should have put Henry on f1 and allowed Janet to initiate the queen exchange.  I think that the resulting K & P ending would have eventually been a loser for white though - do you the Inquest Jury agree?  Joanne",
        "36. Qf3 e2 37. Qe4+ Kh6 38. Qe6+ g6": ""
    },
    "url": "https://gameknot.com/annotation.pl/jo-against-the-titans-part-3-girl-power?gm=47783",
    "gameName": "Jo against The Titans Part 3 - Girl Power!",
    "players": "jstevens1 (1948) vs. brigadecommander (2232)",
    "opening": "English (A10), Anglo-Dutch defense"
}