{
    "moves": {
        "1. d4": "A very interesting midgame, with an endgame I should have won... or not. I didn't have time to go through the saved lines I copied here. I'll do some day...",
        "1... d5 2. Bf4 Nf6 3. Nf3 c5 4. c3 Qb6 5. Qc2": "Qb3 is preferred, but it leads to a drawish game, in my feeling. This is to take advantage of the fact that black can't go for Bf5, QxB, Qxb2?? Qc8 mate. ",
        "5... cxd4 6. Nxd4": "cxd4 is the standard move, and it's goog. The Qxc8# is easily covered with the smooth Nc6, so it's no shot. ",
        "6... Nc6": "It doesn't work Nb5, QxN, Bc7, tyrying to trap the queen. \n\n\n6.\tf3-d4\tb8-c6\n7.\tf4-e3\te7-e5\n8.\td4-e6\td5-d4\n9.\tc3-d4\tc8-e6\n10.\td4-d5\tc6-d4\n11.\te3-d4\tf8-b4+\n12.\tb1-c3\tb6-d4\n13.\td5-e6\tf6-e4\n14.\te6-f7+\te8-f7\n15.\tc2-b3+\tf7-e7\n16.\te2-e3\tb4-c3+\n17.\tb2-c3\td4-c3+\n18.\tb3-c3\te4-c3\n19.\te1-d2\tc3-e4+\n20.\td2-e2\ta8-d8\n21.\tf2-f3\te4-c3+\n22.\te2-f2\te5-e4\n23.\tf1-c4\td8-d2+\n24.\tf2-g3\te4-f3\n25.\tg2-f3\tg7-g5",
        "7. Nxc6": "It seems the wisest way is the mild one. I planned a doubtfoul surprise. ",
        "7... bxc6 8. Be3": "!? not really sure if it helps or not. It looked interesting enough to wake up the game. ",
        "8... c5 9. g3 e6": "Black prefers to look for the big white diagonal. I would have played e5, grabbing free central space and destroying white's dsb's usefulness. ",
        "10. Bg2 Bb7": "A well known double edged position.\n\n11.\tf2-f3\td5-d4\n12.\tc3-d4\tc5-d4\n13.\te3-f2\tf6-g4\n14.\tc2-a4+\tb7-c6\n15.\ta4-d4\tf8-c5\n16.\td4-c5\tb6-b2\n17.\tc5-c6+\te8-e7\n18.\tf2-c5+\te7-f6\n19.\tf3-g4\t",
        "11. O-O Be7": "White has a weird position, with the bishop in e3. The idea was to sacrifice the pawn's central advance in order to cause some problems to black. Now, the point is white has the chance to recover the pawn via Qa4+, so currently black cannot go d4, due to cxd4, cxd4, Qa4+!, and whatever black does, white recovers the pawn. This also happens if white goes BxB. The queen must retake, leaving the black diagonal guarding d4. Those are the two reasons black can't play d4 and crush me. \nNow, it is clear that black is just preparing his castling, seen that my developement is not quick or easy. The knight needs two moves to become an useful piece, and I don't see a good future for it. On d2, it blocks the rook's action, and white wants to have a rook on d1, stopping d4 even after the castling. But that means the knight has to develop to a3... an almost useless square in this position. So I considered: \n12. Rd1, o-o. And then?\n12. f3 seemed interesting. We have to take into account that black missed Ng4!, where my dsb must retire or be awfully exchanged. Based on the previous move, black is not considering it... but hey, at any moment black can change his mind and attack that way. So 12. f3 stops both knight's jumps (Ne4 is not really dangerous, but...). It also prevents black to play BxB at some point (in some lines she has to, or she will lose d4). It also prepares Bf2, and e4, a good plan for white not being squeezed and keep the pressure on c5 and avoiding d4.\nAll this sounds good, but now, seriously: you play to win, not to defend. \n12. b4 could be a good way to proceed. I am not really threatening anything. Ne4 can't help black, because of f3, but Rc8, that is a move surely on her agenda anyway. I don't want to help her to develop. And then? \n12. c4 may seem crazy, but look: if black moves d4, BxB, and black has to decide among QxB, cxd, cxd, Bxd4, or d4xBd3, BxRa8, d3xf2+, Rxf2, c4!. But it is doubtful the attack will compensate the material loss. But anyway: Why should black move the pawn in d5? He has no reason to do it. If I take cxd5, her knight gets into the action, so I won't do it. \n\nNow: look this funny line starting with an original idea: \n12. a4!?. \nIt is based on the idea that I have a \"spare\" tempo. And I want to avoid to \"simply defend\". The advantage of the next a5 is that it threatens the queen, so it blocks any black's action (except a check), and gives me more power on d4. If Qd6, Rd1 becomes attractive for white, and b4 comes again into consideration. \na5 blocks the square for the queen checks, but still BxB is \"on\" against d4. But I didn't see it at once, and analyzed the following: \n\n12.\ta4\t\td4!? Just suppose. Of course black wouldn't play it, but if he does, and white overlooks the BxB line, it goes: \n13.\ta5\t\tQa6. If Qb5, 14. Na3 becomes a developement move, giving me an edge. If Qxa5, Nc4 is a freeway to e5 or a5... But this move gives white another chance:\n14.\tQb3. You'd say it is futile, since Rb8, followed by o-o, is good f",
        "12. a4": "GK engine doesn't warn about overlenght. In short, the previous was a difficult position to assess, but I remembered a game I played shortly ago where I missed the queen's hunt with a4-a5, and it looked an interesting way to get out of the situation. ",
        "12... Qc7": "13.\tb1-a3\te6-e5\n14.\ta3-b5\tc7-a5\n15.\tb2-b4\tc5-b4\n16.\tc3-b4\te7-b4\n17.\tc2-c7\tb7-a6\n18.\tc7-c6+\te8-e7\n19.\te3-c5+\tb4-c5\n20.\tc6-c5+\te7-d7\n21.\tc5-d6+\td7-c8\n22.\td6-c6+\tc8-b8\n23.\tf1-b1\t",
        "13. Na3 a6 14. f3 O-O": "15.\ta1-b1\ta8-b8\n16.\tb2-b4\tc5-b4\n17.\tc3-b4\tf8-c8\n18.\tc2-d3\te6-e5\n19.\tg2-h3\te5-e4\n20.\td3-d4\tc8-d8\n21.\tf1-c1\tc7-d6\n22.\te3-f4\t",
        "15. b4": "Premature? It leads to an even position. ",
        "15... cxb4 16. cxb4 Qxc2 17. Nxc2 Rac8 18. Rfc1 Rc4 19. b5 axb5 20. axb5 Bc5": "Can't aviud bishop's exhange...",
        "21. Bxc5 Rxc5 22. Nd4": "No pawn, no attack, and if b6 instead, Rb5.",
        "22... Rxc1+ 23. Rxc1 Rc8 24. Ra1": "Trying to grab something out fom the position. ",
        "24... Ra8 25. Rxa8+ Bxa8 26. Nc6": "I will lose the pawn, but I will control black's game in the meanwhile. ",
        "26... Bxc6 27. bxc6 Ne8": "Now it will take some tempoes for black to take the pawn... will I be able to use them? ",
        "28. e4": "If Kf2, d4, f5 and white should be able to cash black's pawn. But black will find the way to take on c6. This game could have been won, but it needed much more expertise than mine. ",
        "28... Nc7 29. e5": "I'm not worried about the d pawn, but I don't want that knight to be free. ",
        "29... Kf8 30. Kf2 Ke7 31. Ke3 Nb5": "Interesting. \n\n32.\tf3-f4\tb5-a7\n33.\tc6-c7\te7-d7\n34.\te3-d4\td7-c7\n35.\td4-c5\ta7-c8\n36.\tg2-f1\tc8-e7\n37.\tf1-b5\te7-f5\n38.\tg3-g4\tf5-e3\n39.\th2-h3\te3-d1\n40.\th3-h4\td1-f2\n41.\tg4-g5\tf2-e4+\n42.\tc5-d4\tc7-b6\n43.\tb5-e8\tf7-f6\n44.\te5-f6\tg7-f6\n45.\tg5-f6\te4-f6\n46.\te8-f7\tb6-c6\n47.\tf7-e6\tc6-d6\n48.\tf4-f5\th7-h6\n49.\te6-f7\t\n",
        "32. f4 Na7": "Now black will take the pawn, but I hoped that in a cramped position. ",
        "33. Kd4 Nxc6+ 34. Kc5 Kd7 35. Bf1": "Black's position is solid, but a little restricted. ",
        "35... Kc7 36. Bd3 h6 37. Bb5 Nd8 38. Be8": "I thought this bishop manouver was whorty. ",
        "38... f6": "But it is not enough to win. ",
        "39. f5": "The last attempt...",
        "39... Nb7+ 40. Kd4 fxe5+ 41. Kxe5 exf5": "Here, probably, my losing mistake. Which pawn should I take?",
        "42. Kxd5": "Kxf5 is not possible because of the fork, so...",
        "42... g5": "Still, Kd6 could have fought for the full point. ",
        "43. Ke5 f4 44. gxf4 gxf4 45. Kxf4": "Another lost chance. By Kf6 I prevented black's king run to h8,",
        "45... Nd6 46. Bg6 Kd8 47. Kg4 Ke7 48. Kh5 Kf8 49. Kxh6 Kg8 50. h4 Kh8": "So Joanne got her drawn game. But now that I analyzed it, I saw that I didn't win because of my fault. And that, at least at a first sight, a4 was a positive attempt. Thank you for reading. "
    },
    "url": "https://gameknot.com/annotation.pl/jos-welcome-mt-part-3?gm=49894",
    "gameName": "Jo's Welcome MT Part 3",
    "players": "damalfi (1784) vs. jstevens1 (1908)",
    "opening": "Queen's pawn, Mason variation (D00)"
}