{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Bb5 Nf6": "3. ......... Nf6 - a viable alternative to the usual Morphy Defence a6.",
        "4. O-O": "4. 0-0 - white castles quickly.  There now follows a fight for the centre.",
        "4... d6 5. d4 exd4 6. Nxd4 Bd7 7. Nc3 Be7 8. Re1 O-O": "8. .......... 0-0 - both sides develop their pieces, now comes a double piece exchange.",
        "9. Nxc6 Bxc6 10. Bxc6 bxc6 11. Rb1": "11. Rb1 - the queenside pawns have been disrupted.  I now occupy the half open b file with my rook.",
        "11... Nd7 12. Bd2 Kh8 13. Qf3 Ne5 14. Qh3 Bg5 15. Bxg5 Qxg5": "15. ......... Qxg5 - after some piece play comes another swap off of bishops.  Black creates pressure on the kingside.  The WQ chases the BQ around until a queen swap occurs.",
        "16. Qe3 Qg6 17. b3 f5 18. Qg3 f4 19. Qxg6 Nxg6": "19. ........ Nxg6 - the queen swap has occurred and mating threats against the WK have been dispersed for now.",
        "20. f3 Rae8 21. Rbd1": "21. Rbd1 - both white rooks occupy half-open d and e files.",
        "21... Kg8 22. Kf1 Kf7 23. Rd4 Re5 24. Ra4 a5 25. Nd1 Rfe8 26. c4 Nf8 27. Nb2 Ne6": "27. .......... Ne6 - not much has happened over the last few moves but now, black makes, what I think the losing move because Julia is about to drop a pawn.",
        "28. Nd3 Rh5 29. h3 h6 30. e5 dxe5 31. Rxa5 Nd4 32. Raxe5 Rhxe5 33. Rxe5 Rxe5 34. Nxe5+ Ke6 35. Nd3": "35. Nd3 - over the last few moves there have been a plethora of pawn and rook exchanges.  Now we are in a knight ending but I am a pawn up.",
        "35... g5 36. Ke1 Kd6 37. Kd2 Ne6": "37. ........ Ne6.  This is the start of a lot of king and knight manouevres as I endeavour to convert this pawn advantage into a victory.",
        "38. Kc3 Ng7 39. Kb4": "39. Kb4 - played to support my passer on a2.  This pawn will eventually decide the game in my favour.",
        "39... Nf5 40. c5+ Kd5 41. a4": "41. a4 - passed pawns must be pushed!",
        "41... Nd4 42. Ne1": "42. Ne1 - to prevent a knight check on c2.",
        "42... Ne6 43. Nd3 Nd4 44. a5 Nb5 45. a6": "45. a6 - the pawn moves as far as he can safely go.",
        "45... Na7 46. Nf2 Kd4 47. Ng4": "47. Ng4 - attacks h pawn.",
        "47... h5 48. Nf6 h4 49. Ne8 Nb5 50. Nf6 Ke3 51. Ne4 Na7 52. Nxg5": "52. Nxg5 - after a further set of knight moves - black can only shunt her knight from b5 to a7 - my knight ensures that another black pawn drops off.  My own g pawn will drop off but the knight moves into a position where he defends both f and h isolanis.",
        "52... Kf2 53. Kc3 Kxg2 54. Kd4 Kg3": "54. ........ Kg3 - ha, ha, the black king cannot move any further up the g file!!  Meanwhile, the white king will wend his way to d7.",
        "55. Ke5 Nb5 56. Ke6 Na7 57. Kd7": "57. Kd7 - he gets there, while white continues to shuttle her knight from b5 to a7.",
        "57... Kf2 58. Kxc7 Ke3 59. Kb7 Nb5 60. Kb6": "60. Kb6 - the knight is now driven away from the b file and cannot go back to a7 or he will be taken!",
        "60... Nd4 61. a7": "61. a7 - although black can now win the f pawn Julia cannot stop me from crowning on a8.  Julia now throws in the sponge.  Julia and I have played 3 unrated games.  I lost the first one, drew the second and now won the third so we are level on 1.5-1.5!"
    },
    "url": "https://gameknot.com/annotation.pl/jos-endgame-success-part-4?gm=15294",
    "gameName": "Jo's Endgame Success - Part 4",
    "players": "jstevens1 (1525) vs. gothicgirl (1640)",
    "opening": "Ruy Lopez (C66), Berlin defence, hedgehog variation"
}