{
    "moves": {
        "1. e4": "I think this is a nice game of me. I have, in my opinion, a combination in the middle game and a nice, quick and sharp rook endgame... There was a fixed initial opening in this mini-tournament; 1. e4 c5 2. Nf3 d6 3. d4 cxd4 4. Nxd4 Sicilian",
        "1... c5": "\"At the master level and above, the Sicilian is the most popular and best-scoring response to White's first move 1.e4. Indeed, most statistical surveys suggest that 1.d4 is the most successful first move for White, but only because 1...c5! scores so highly against 1.e4.\"  http://en.wikipedia.org/wiki/Sicilian_Defense For more interesting and easy access knowledge about chess openings I suggest to read more at  wikipedia.org",
        "2. Nf3 d6 3. d4 cxd4 4. Nxd4 Nf6": "Sicilian (B54), Prins (Moscow) variation... 5.f3!?",
        "5. Nc3": "Sicilian (B56)",
        "5... a6": "\"The Najdorf Variation is Black's most popular system in the Sicilian Defence. Najdorf's intention with 5...a6 was to prepare ...e5 on the next move to gain space in the centre; the immediate 5...e5?! is met by 6.Bb5 !\"(wikipedia.org)",
        "6. f3": "I don't easily find theory about 6. f3,  It is also noted as Moscow variation if played in the 5th move, so maybe it's a transposed Moscow variation?",
        "6... e6 7. Bg5 h6 8. Be3": "I definately lose a tempo by retracting my bishop after first making Bg5. Why did I do that? Why not exchange my bishop for the knight? I only find subtle explanations like I want to be better in playing with my bishops, because I consider them as my weakest skill in piece maneuvers, so I want to keep it a bit further into the game.",
        "8... e5 9. Nb3": "I have never liked retracting my knight to b3, but I've noticed most players do that and I assume for a good reason :-)",
        "9... Be6": "I see the next moves from both sides as a natural development and none of them particularly weak or that it could have been much improvement...",
        "10. Qd2 Be7 11. Rd1 O-O 12. Be2 Nc6 13. O-O": "With both players castled and the pieces out of the back rank I guess we are facing middle game....",
        "13... b5": "Black is taking the initative on the queenside but still need a bit more preparations to back up the pawn advancement. ",
        "14. f4": "Hmmm! Better would be Nd5, because now I'm losing a pawn... And Nd5 also prepares for play in the c-file, e.g: 14.Nd5 Rc8 15.Rc1 Nb8 16.c4 Nxd5 17.cxd5 Bd7 18.Rxc8 Bxc8 \r\n",
        "14... b4 15. Nd5 Nxe4": "A pawn down and my queen harassed :-(",
        "16. Qd3 Nf6": "As black you should maybe have kept the initiative you now gained by playing  16...exf4 which might could lead into an even more interesting game. With the text move I immediately equal the game by winning a pawn back.\r\n",
        "17. Nxe7+ Nxe7 18. Qxd6": "Score and  more importantly I seize the now opened d-file! but a better move might be fxe5",
        "18... Qxd6 19. Rxd6 a5": "Nf5 would be better, threatening both my rook and black squared bishop",
        "20. a3": "? Definately 20. fxe5 Ne4 21. Ra6 and I keep the initiative(and an extra pawn)",
        "20... bxa3 21. bxa3 exf4 22. Bxf4 Ned5": "Obviously I can learn more about how to keep the initiative, because now I turn a bit defensive....",
        "23. Bd2": "playing c4 would probably be better for me. On the other hand I block the d4 knight from advancing any further into \"my\" area by covering c3,e3, b4 and f4.",
        "23... a4": "Now I think I'm playing a couple of accurate moves, or?",
        "24. Nc5 Rfe8 25. c4": "! The reason for this move is materialized in move 27. I'm quite happy when I discover this kind of tactical moves",
        "25... Nc7 26. Bxh6 gxh6": "I didn't expect him to retake my bishop but ao far I don't see any better move for black",
        "27. Rxf6 Kg7 28. Ne4": "I'm not so sure this is a good move. 28. Rf4 is probably better, covering c4 and prepare for Bg4, getting a stronger pressure on the black player's bishop.",
        "28... Re7 29. Rf4": "Here I realized  that keeping my rook at f6 binds up my pieces to much and I'm trying to find more dynamic play and trying to advance my c-pawn towards promotion... Black is now fighting to equalize and get back into the game",
        "29... f5 30. Ng3 Ne8 31. Rdd4": "I now clearly feel that I have a bit of initiative and are just trying to find better positions and prepare for advance of the c-pawn. Meanwhile black is still fighting well by disturbing my pieces",
        "31... Kf6": "? I'm not sure that willingly moving the king into a binding position is a good move and I immediately try to take advantage of that. Maybe keeping my plan of advancing the c-pawn would be stronger play but I do see an idea I can't let go...",
        "32. Bd3": "!",
        "32... Ng7 33. Nxf5": "!",
        "33... Bxf5 34. g4": "!",
        "34... Re1+": "I'm not sure this helps black, but I don't see much better moves either, maybe just Re5...",
        "35. Kf2 Re5 36. gxf5 Raa5 37. Kf3": "Maybe Rd6  instead of my king move...",
        "37... Nxf5 38. Bxf5": "Maybe Kg4...",
        "38... Rexf5": "And now we enter a rook endgame and which I also find ok by me",
        "39. h4 h5 40. Ke3": "I feel in control now and aim for the queenside and c-pawn promotion. I think that I quite effectvely have blocked interference of rook penetration behind my king",
        "40... Rae5+ 41. Kd3": "? And suddenly I allow rook penetration lol ",
        "41... Re1 42. Kc3": "I should exchanged the f-rook, but I remember I here thought I would now win the a-pawn and hence get 2 free pawns.",
        "42... Ke5": "Black should have exchanged rooks and maybe had better chances...Rxf4 43.Rxf4  Ke5 44.Rf8 Rh1 45.Re8  Kf5 46.c5 Rxh4 47.c6 but most likely lost anyway...  \r\n",
        "43. Rxf5+ Kxf5 44. Kb4 Ke5": "? mistake, because now he lose the h-pawn as well",
        "45. Rd5+ Ke6 46. Rxh5 Re4 47. Rh8 Kf6 48. h5": "! I see that I have a chance of still keeping all my pawns",
        "48... Kg7 49. Rc8 Re5 50. Rc5 Rxc5": "And black resigned! 1-0 Thanks for the game rankrook."
    },
    "url": "https://gameknot.com/annotation.pl/joe-hills-mini-tournament-2?gm=16218",
    "gameName": "joe-hill's mini-tournament 2",
    "players": "norjoa (1586) vs. rankrook (1337)",
    "opening": "Sicilian (B90), Najdorf"
}