{
    "moves": {
        "1. e4 c5 2. Nf3 Nc6 3. Bb5 g6 4. d3": "The start of the game proper.  White is supporting the central e-pawn and activating the dsb, although the computer considers this a weak move.  Castling and taking the bishop are far and away the most popular options, and seem to do well for White.",
        "4... a6": "Black pushes the bishop to a decision.",
        "5. Bxc6 bxc6": "Capturing towards the centre.",
        "6. c4 Bg7": "The point of 3. ... g6 was to allow this move.  Black gains decent control of one of the long diagonals.",
        "7. O-O e6 8. Re1": "7. ... e6 was obviously intending d5 to follow.  Establishing the rook at e1 makes opening up the centre less palatable for Black.",
        "8... Ne7": "Not considered a mistake or inaccuracy by the computer, but it does shift the evaluation down by about 1/3 of a pawn.  Black's aim is to open up for castling without blocking the bishop at g7.  The knight has more opportunity to be useful from here than from h6.",
        "9. e5": "Seals off the bishop at g7 and is well supported here.  Also creates issues for the lsb developing through the e6 pawn.",
        "9... d6": "Black attempts to break the deadlock.  The computer takes another third of a pawn here, leaving Black at -1.",
        "10. Bf4": "An unnecessary further reinforcing of the pawn.  White can instead win a pawn here with exd6 followed by Nc3.",
        "10... d5": "Black changes plans and opts to try undoubling his pawns.  His bishops are still in trouble and dxe5 was probably better.",
        "11. cxd5 cxd5 12. b3": "An uncertain move for me.  It doesn't seem to have much purpose.",
        "12... O-O": "Black tidies the king away in the interim.",
        "13. Qc2": "Eyeing the vulnerable c5 pawn.",
        "13... Qb6 14. Nc3 d4": "Bad.  Black has designs on winning a piece and, even if he doesn't, he still claims a small pawn wedge in the middle of the board.  But White can severly cramp his style in a line that, according to the computer, leaves White ahead two pawns.  It prefers 14. ... Bd7 to deter that line.",
        "15. Na4": "! The computer's best move, that leaves White at +2.",
        "15... Qd8": "Not sure about this move.  Black is under pressure and the pawn at c5 is lost, and he wants to preserve the queen rather than entice the enemy into attempting the exchange and offer protection to the d-pawn.  The computer prefers Qc6 but this scores about the same.",
        "16. Qxc5 Nf5": "Protecting the d4 pawn.",
        "17. Rac1": "Presumably intending to join the fight with Rc4.  The computer prefers to attack the queen with Bg5.",
        "17... Bb7": "Moves the bishop out of the White queen's line of fire.  Can also now trade with the knight for a weakened castle.",
        "18. Bg5 f6 19. Bd2": "The only place from which the bishop won't immediately be moved on again, and it allows the bishop to swing over to the queenside.  However, exf6 would have opened up the e-file for White's well-placed rook and would have been better.",
        "19... Rc8": "An attack on the queen that seems poorly planned as the queen can just move away.  There aren't any active squares the queen can safely move to, but the queen can trade itself or move to safety and force the rook to either shuffle home or pointlessly trade down.",
        "20. Qa3": "The White queen chooses inactivity over death.",
        "20... fxe5": "The pawn is only temporary.  Better was Bxf3, opening up the castle by brute force.  The computer has hated the last four moves, and now regards the position as +0.04 for Black.",
        "21. Rxc8 Qxc8 22. Bb4": "After the rook trade, White tries an attack that can't really go anywhere.",
        "22... Bxf3": "!  Ignoring the threat to his rook, Black attacks the knight and the castle.",
        "23. Bxf8 Bxf8 24. b4": "Protecting the queen from the attack, but hemming it in at the same time.  Better would have been to move the queen.",
        "24... Bd5": "A seemingly sensible idea, taking the bishop away from danger (though what it's doing where it is I can't really say).  Better was Nh4 which wins at the computer has winning heavily after gxf3 Nxf3+ Kf1 Nxf1 Kxf1.  It's tough for me to see what to do after 24. ... Nh4 25. g3.",
        "25. Nb6 Qb7": "The computer prefers to play 25. ... Qc3, threateing a queen trade with a dangerous passed pawn being shepherded through by the bishops, or else using the bishops to pick up the loose queenside pawns.  I think of this option as more conservative.",
        "26. Nxd5": "A questionable decision in my opinion.  The knight was valuable - I don't think White should be exchanging down without a clear advantage.",
        "26... Qxd5": "exd5 was also possible.  Using the Queen results in losing a queenside pawn instead of a central one (probably not good, given White's existing queenside pawn advantage) and gives White a possible mating attack with Nh4.",
        "27. f3": "Cuts out that attack Black was planning, but allows the knight to make a mess by advancing via e3 and c2.",
        "27... Qb5": "Preserving the a-pawn and attacking White's b-pawn and ultimately the queen.",
        "28. Qb3 Bxb4": "The idea is to threaten the rook and pick up a pawn.  But 29. Rb1 will severely lock down the position.  The computer rates the position as almost dead even now, instead of solidly winning for Black.  Activating the king with Kf7 was better.",
        "29. Qxe6+": "Black gets his edge back, as this unsupported attack must fade out.",
        "29... Kg7 30. Rxe5": "Adding support to the attack, but the knight/pawns combo is holding the position.",
        "30... Qxd3": "Creates a passed pawn in the middle.",
        "31. Qb3 Qxb3": "The computer doesn't like this, but the intent is clear - Black wants to emphasise the passed pawn by reducing material, and is confident his bishop and knight can contain the rook and get the pawn home.",
        "32. axb3 d3 33. Rd5 d2": "Putting the pawn in the bishop's protection.  Threats to the bishop or the a pawn can be met with a4 at will.",
        "34. Kf2": "The only good move.  Anything else and White will lose his rook and be in massive trouble.",
        "34... Nd6": "The knight must reach the fight zone, but is unable to do so via the kingside.  It will be a long journey, however.",
        "35. Ke2 Nb5 36. Rd7+": "A change of approach for White, who now gives check for not much reason.",
        "36... Kh6": "The Black king is on his way to the pawn.  The check has done nothing to hinder him.",
        "37. Kd1": "Frees the rook from the job of guarding the pawn against promotion.  It does, however, give the Black king access to e3, which will prove vital.",
        "37... Kg5 38. Rxh7 Kf4 39. Rh4+": "??  The game is done as White can no longer prevent the pawn from promoting without losing his rook.",
        "39... Ke3 40. Re4+ Kd3": "41. Rd4, 41. Re3 and 41. Rc4 are the only options that prevent Nc3#, and they all lose the rook (Rc4 swaps it for the knight).  White resigns as he is lost."
    },
    "url": "https://gameknot.com/annotation.pl/jokeslayers-sicilian-defence-mini-tournament?gm=43724",
    "gameName": "Jokeslayer's Sicilian Defence Mini-Tournament",
    "players": "vtsnowman (1381) vs. jokeslayer (1412)",
    "opening": "Sicilian (B31), Nimzovich-Rossolimo attack (with ...g6, without ...d6)"
}