{
    "moves": {
        "1. e3": "White starts of with one of their usual two openings, either c4 or, in this case, e3. My openings are unique and most would say that it is bad, but it seems to do good for me. Unless I can learn a new and better opening and remember it, I'll stick with this opening of mine. ",
        "1... Nf6": "Already black starts with an opening I'm not used to seeing, for I don't play higher rated players much. ",
        "2. c4": "White continues their opening with c4, which is what I would usually play.",
        "2... e5": "This kind of move can confuse me. Again I'm not used to playing high rated players, so this move made me think, \"What is this?\" Of course, for someone as high rated as him, this is all part of black's plan. ",
        "3. h3": "This is actually an inaccuracy, says the computer analysis at least. It also says the best move was 3. Nc3, which is actually part of my opening strategy usually. Well, this is also where I begin losing, believe it or not. Just take a look at the game analysis I showed at move 1. It's not much, but it is the beginning of the end for white, but the move made keeps black's f6 knight from advancing to g4. That is what I was thinking at the time. ",
        "3... Nc6": "Something I was kinda expecting actually, having both knights out early.",
        "4. a3": "I planned this move the moment I saw the c6 knight. Now that knight can't advance to b4. All part of white's opening.",
        "4... d5": "This kind of move you wonder which is better, stay or take. When I look at this though, this is when having the b1 knight on c3 would of been helpful. ",
        "5. cxd5": "I decide to take. ",
        "5... Nxd5": "Of course he would take back, but really, it's looking like black is gaining a positional advantage here. ",
        "6. Bb5": "I decide here to pin the knight. It can't move at this moment because of the knight being the only thing between the king. Of course, I'm sure I'll have to move it soon because black would likely play a move like a6.",
        "6... Qd6": "Not what I really expected. I expected black to bring their queen out soon, but after the move I made, I wasn't totally expecting that move. Of course black must be positioning himself. ",
        "7. Qc2": "I decide to do the same. Although the computer analysis says nothing, I'm pretty certain there were better moves than this. ",
        "7... a6": "Now black plays a6, as I was still expecting. ",
        "8. Bxc6+": "Well, I think about this move, and I don't like it. It exchanges knight for a bishop. Both knights and bishops are valuable, but in this case, my bishop's position may of been better than a trade. Thus, I think 8. Ba4 or Bc4 were better moves than Bxc6+. ",
        "8... Qxc6": "I expected that move. Unfortunately I am not good with thinking ahead, otherwise I know I'd be way better at chess. With that, the next move is where white starts losing control. ",
        "9. Nc3": "My first mistake was this move. Again, I don't do well looking ahead. Here's what the computer analysis predicts: 9. Nc3 Nxc3 10. Qxc3 Qxg2. Those moves will happen. After that, it gets worse for white. ",
        "9... Nxc3 10. Qxc3": "It was when I made this move for fair exchange between the knights that I realized I made a mistake. I should of played 10. f3. It would of helped. I'm sure you all know where black's queen is headed. ",
        "10... Qxg2": "The best move now to make is 11. Qxe5+. Black would defend and then I could protect my rook by playing Qh2. The problem is, I didn't do that.",
        "11. Qxc7": "I don't know what I was thinking here. The rook is lost now and black is winning, a big blunder for white. ",
        "11... f6": "I didn't know the point of this move at first, but now I see that there was no need for black to attack now and lose another pawn, even if he is winning. There's nothing white can do to stop the attack now. ",
        "12. Qc4": "With nothing else to take and with no attack available, white decides to fall their queen back to get it ready to land on f1 so it can protect the knight at least. ",
        "12... Qxh1 13. Qf1": "The rook is gone, and now with this move, I wasn't quite sure what else to do at this point, which is never good.",
        "13... Be6": "I'm guessing black is preparing for another attack. ",
        "14. d3": "I decide I should build up my defenses as much as possible. I don't think d3 was the best move at this point.",
        "14... Rc8": "He continues to line up for his attack. ",
        "15. Bd2": "I think this move of mine only crammed my king further. ",
        "15... Rc2": "It is hard for me to say weather I should of moved my bishop or not. By moving it, the pro is that my rook has more mobility options. The con is the move black just made. Now I must protect my pawn by playing Rb1. ",
        "16. Rb1 e4": "One thing I've come to realize slowly is that taking is not always the best choice. I didn't realize that as much in July when this game was in progress.",
        "17. dxe4": "Blunder, a big one in fact! Why? Well, I could explain here and now, but how about I explain through the next few moves. I should of played d4 or b4 instead of this.",
        "17... Bc4": "This is the big reason why. I have nothing to protect my queen except my knight, which is protecting the queen. The only option really is to move the knight. ",
        "18. Ne2": "White is falling, but the trouble is far from over. Queen exchanges for sure.",
        "18... Qxf1+": "You can probably see where the rest of the trouble comes for white now. White has no choice but to take the queen with his king. The problem is, when the king moves to f1, goodbye d2 bishop. Taking a measly pawn caused big trouble for white. The only reason I play on is to see how far I can get with my opponent. ",
        "19. Kxf1 Rxd2": "And the bishop is gone, but the trouble is still not over. ",
        "20. Re1": "This is probably the best move, for the knight needs to be protected. Unfortunately for white, the b2 pawn and soon also the a3 pawn will be lost. ",
        "20... Rxb2 21. f4": "I decide pushing the pawns forward and giving my king a little more space is best. ",
        "21... Bxa3 22. Kf2": "There's not much else white can do now. His disadvantage continues to grow, and they're about to grow more.",
        "22... Bb4": "The troubles continue. White must save their rook now. Thus, the knight is lost for white. ",
        "23. Rg1 Rxe2+": "Black has won, it is just a matter of time now. ",
        "24. Kf3 Rxe3+": "This move confused me. When playing this game, I thought he decided to go easy on my and give me his one rook. That was a mistake to believe, lol. ",
        "25. Kxe3": "I take, and that's when I see the problem. ",
        "25... Bc5+": "The problem is now all I have is a king and 3 pawns. ",
        "26. Kf3 Bxg1": "Black is really good, but I think lasting this long is pretty nice for white. The end is near now though. ",
        "27. f5": "Well, not much more white can do now.",
        "27... Bf1": "Well, although I have nothing to gain, I'll keep my remaining pawns up. ",
        "28. h4": "That was another blunder, the final one, says the computer analysis. The best move was e5? Well, I don't agree with that, but at this point, there really is no good moves. ",
        "28... Kf7": "Obviously black will get his rook involved now. ",
        "29. h5": "Nothing else to do really for white. ",
        "29... Rd8 30. Kf4": "With the rook about to attack, I decide it is best to try to hide. ",
        "30... Rd3": "It's over, mate in 2. ",
        "31. Kg4 Be2+": "Mate in 1.",
        "32. Kf4 Bh2#": "Checkmate. Well, I look at this and I know I could of done better. Well, I am glad to say I have improved my game, especially since I came on Gameknot about 1 year ago, so I'm proud of how I've improved, and I will continue to improve, that I know. This game helped teach me things I wasn't aware of, so I'm glad to of had this learning experience. Congratulations to Geniusacamel for his win and thank you all for reading, commenting, and rating this annotation. I hope you all enjoyed it! I'll be annotating game 2 hopefully next week, and games 3 and 4 in the weeks to follow. I hope you look forward to them! Until next time :)"
    },
    "url": "https://gameknot.com/annotation.pl/joveyboy1-vs-geniusacamel-game-1?gm=56624",
    "gameName": "joveyboy1 vs. geniusacamel (Game 1)",
    "players": "joveyboy1 (1110) vs. geniusacamel (2109)",
    "opening": "Van't Kruijs opening (A00)"
}