{
    "moves": {
        "1. d4": "Once again, my opponent attempts the QG, but I am going to decline it, this time.  However, something very interesting happens, right after the QGD.  What is it?  Stay tuned.",
        "1... d5 2. c4 c6 3. Nf3": "After I decline it, he responds by bringing out his Knight.  Believe it or not, Jack Stockel has told me that this move, is standard, right after the Queen Gambit gets declined.",
        "3... dxc4": "This is the interesting part.  I decide to take his pawn, initially transposing the QGD, into the QGA.  That is because he is going to win that pawn back.  As we all know, in the QGA, black often does not allow white to keep the extra pawn.",
        "4. e3": "Now, he is going to win that pawn, but as Master elyhim mentioned in my last annotation, this is a very big mistake that black can take advantage.  ",
        "4... b5": "In my protect it, this gets played.  Note: he did not play 4.a4, so I did not see how he could get the pawn back.  However, he is, somehow, gonna manage to do that.",
        "5. a4": "Now, he decides to play a4, but it should have been too little, too late.  However, he is lucky that it isn't, as I am about to make my first mistake.",
        "5... Bg4": "() This is it.  I decide to pin his f4 Knight, so this is my first mistake.  However, this is very minor because even if I had played ...bxa4, he would still win back the pawn because if 5...bxa4, 6.Rxa4.  Sooner or later, he would have been able to play Bxd4, so there would be nothing that I could do, to keep it.",
        "6. Be2": "But first, he has other goals to break my pin.  And, he wants to do more then just break a pin.  What is it?  In this position, he eventually intends to castle Kingside, as we shall see later on.",
        "6... Nf6": "Right now, my only goal is to castle, sooner or later.  Note: as mentioned in the beginning, I do not want cheapos or tricks, so I am only interested in developing and castling.  Of course, however, is the fact, that I will have to pull one or two tricks, in order to castle, not to mate in one because I also think that he is trying to stop me from castling.",
        "7. b3": "First, he wants to stop me from developing by trying to win my c pawn, but I am not falling for it.  Therefore, I will not hesitate to force a pawn exchange.",
        "7... cxb3 8. axb5 g6": "Now, I could have forced another exchange with 8...cxb5, 9.Bxb5, given that his LSB is no longer pinned.  However, I am not going to do that, as it resorts to a little bit of unsound aggression.  Instead, I am just going to develop my DSB, as my opponent is still trying to stop me from developing, and I will not stopped.  Afterall, development is one of the most important aspects of chess.  As schakerertjie would say, \"Your main goal is to develop, develop, develop\".",
        "9. Qxb3": "So, I let him have my pawn back, but it is just a trap.  In fact, this is a trick because I will continue with my goal.  And, I am going to start by fianchettoing my DSB.",
        "9... Bg7 10. bxc6": "This, however, is the main trick.  In other words, I give two things away and allow myself to go from a pawn ahead, to a pawn behind.  Why?  Because I now have the opportunity to castle Kingside, and I will take advantage of that opportunity while it exists.  Afterall, opportunities only exist for a finite amount of time.  BTW, people argue that loosing material, is worse then not developing or castling.  I disagree with this assessment and believe that proper development and castling is more important.  In fact, I heard about a player, grege79, sacking a piece to prevent his opponent from castling, and that is how we won that game.  However, no one was going to stop me, from doing that.",
        "10... O-O 11. h3": "So, he decides to kick my LSB away, which I accept, so I retreat it to the best square.  Afterall, I am not going to exchange my Bishop for his Knight, in this position.",
        "11... Be6 12. Bc4": "Now, he is looking to exchange, so I will make that exchange, as this benefits my position.",
        "12... Bxc4 13. Qxc4 Qc7": "You are supposed to finish development, before you let the Queen out.  Well, \"There is always an exception to everything\", as chesskingdom64 would say, and this is certainly one of them.  Why?  In this position, I want to win back a pawn by continuting with proper develop.  That way, everything is even, and I can connect my rooks.  That would not be feasible, if the Queen was not on the c file.  Because of this move, I will win it back, after he castles Kingside.  So far, I have only made a, \"fender bender\", which=a small error, nothing serious or big.  In fact, I feel that this is one of my best games against a strong player and the best one, on this site.  In addition, I intend to keep it that way.",
        "14. O-O Nxc6 15. Nc3": "Although everything is even, after this move, I feel that I have a slight edge because I am a little more developed.  Note: his development is not quite complete, yet because he still has his DSB on c1.  However, that will soon change, as we will see shortly.",
        "15... Rfc8": "In the meantime, I decide to take advantage by connecting my rooks.",
        "16. Ba3": "This is where the slight edge changes, so that noone has the edge.  Why?  In this position, he has just completed development, given that his DSB has just moved.  I originally thought that he was attacking e pawn, but it is not under attack.  Why?  It turns out that e7 is protected by my my c6 Knight.",
        "16... Na5": "In the meantime, I am only interested in a Queen exchange, and that is why I placed my Knight on the Rim.  In some cases, a Knight on the rim is beneficial.  The thing is that I was told by a Class A Ranked player that exchanging Queens, often benefits your position, against a stronger player.  He told me that this is a way to win a chess game.  In the meantime, my opponent is also interest in trading Queens, so he will accept this exchange.",
        "17. Qxc7 Rxc7 18. Bb4": "But, there is one drawback to my last move.  What is it?  He decides to kick my Knight.  Now, I have to retreat it.  In this case, however, tempo loss is not as bad, given that I am already completely developed.",
        "18... Nc6": "So, I decided to retreat it in the best spot, as this fork his LSB and d pawn.  Note: before, I decide to play a Knight fork, I ask myself if this will really benefit, and if it's worth doing.  Although, it does not provide real benefits, it was worth doing because I now know that my Knight is safe and cannot be attacked.",
        "19. Bc5": "At one glance, I thought that he was trying to attack my e7 pawn.  However, it is still protected by my Knight.",
        "19... a6": "Now, I am only thinking about promoting my a6 pawn into a Queen.  Of course, I know that he is not going to allow this.  But, the pawn is protected by my a8 Rook.",
        "20. Rfb1": "Of course, he decides to connect his Rooks, and my goal is to prevent him from playing 21.Rb6, as he will win that a6 pawn.  Why?  If 21.Rb6!!, He has another rook to take a6, so if 22.Rxa6, Rxa6 23.Rxa6, so he wins a free Rook.  Therefore, I have to defend a6.",
        "20... Nd7": "?? I thought that this was the best way to do that.  However, this my first serious mistake and is, in fact, the loosing blunder, even with best play.  In this position, 20...e6 was best.  I would loose that pawn, but he is going to something much worse.  What is it?  Well, this move traps my c7 Rook.  No matter what happens, he is going to win it.  With best, it will not be an even exchange.  Otherwise, that Rook is free.  Therefore, this is one of those games where I just went from a minor flaw, to loosing in one move.  If I had not made this error, the game might have ended in a draw.  Afterall, I had a shot at it.",
        "21. Nd5": "He decides to take advantage by forking e7 and my Rook.  Afterall, he is going to take the Rook, but I am not giving it away for free.  Instead, I am going to exchange it with his LSB. ",
        "21... Nxc5 22. Nxc7 Ra7": "? This is another mistake.  My only goal is to attack his Knight because he took my Rook.  The only thing is that I forgot that it was already with his LSB.  Therefore, we could have exchanged Knights, and that would have benefited, as he is ahead.  However, he is not going to do that.  Instead, he is going to retreat, but I am going to do the same with my Knight.  Afterall, I am not giving him gifts.  In other words, that Knight is not free.",
        "23. Nd5 Nd3 24. Rb6": "Little did I realize that he was going to attack this Knight.  However, I do not want to retreat because it is only safe, if I undevelop, and I do not like undo my development.  On the other hand, that would have been the best thing to do, in this position.  Because, that Knight is now for free, so I inadvertently gave him a gift.  In addition, this also gives him the opportunity to threaten mate in one.",
        "24... a5 25. Rxc6 Ra8": "At this point, I originally thought that mate could have also been prevented 25...e7.  A second look at the position, however, tells me that this is not the case, as he will use his Knight, to place me in check.  Therefore, this move was indirectly forced. ",
        "26. Nxe7+ Kf8": "In this position, my only other choice was 26...Kh8.  However, that would leave my K in a more dangerous environment, as it would be stuck in only one corner.",
        "27. Rc8+": "In this position, he is forcing a Rook exchange, and I have no choice but to accept it.  Therefore, I believe that it is safe to resign, even though I do not like to resign immediately.  That is because of what you saw in my last annotation, when Jack Stockel said, \"Don't give up right away\".  On the other hand, I know when a game is already lost, and this is one of those times because I do not stand a chance, at this point.",
        "27... Rxc8 28. Nxc8 Nb4": "At this point, I decide to make a random move, hoping to stay in the game, but it will not work.  After he takes, I resign.",
        "29. Rxa5": "Although it is generally not a good idea to give things away.  Sometimes, you have to sac material, in order to stay in the game.  For example, I had to give him a free pawn, in order to castle.  I also would have kept my chance, at a draw, if I gave him my a6 pawn, as it would have protected my Rook.  That is what I learned, from this game, and it is also the moral of this story.   "
    },
    "url": "https://gameknot.com/annotation.pl/jstevens1s-mini-tournament?gm=47906",
    "gameName": "jstevens1's mini-tournament ",
    "players": "xenophon98 (1830) vs. jkarp (1144)",
    "opening": "QGD Slav (D11), 3.Nf3"
}