{
    "moves": {
        "1. e4": "missloly is one of the delightful ladies featuring on the ~Sixth Sense~ 2015 calendar. I hope to play the ladies on it, in the month in which they appear. Miss Loly was the June lady.",
        "1... e5": "I don't normally play this, but I thought I would see what she would play.",
        "2. Bc4": "This is a sound developing move by her.",
        "2... Bc5": "So I copy it again.",
        "3. Nf3": "This is also a good move, attacking e5.",
        "3... Nc6": "Which I defend in the conventional way. This opening is now what the English speaking nations call \"Giuoco Piano\" - Italian for \"Quiet Game\" - and what the rest of the world call the Italian Game.\nSee https://en.wikipedia.org/wiki/Italian_Game",
        "4. O-O": "This is also a good developing move.",
        "4... d6": "I continue with my development, opening up a diagonal for my Bc8.",
        "5. d3": "She replies with the same.",
        "5... Nf6": "And I develop my knight.",
        "6. Ng5": "I think this is her first mistake. Nc3, c3, h3, and Bg4 are all stronger. The move attacks f7 again, but this is easily defended against. Making mistakes in the opening like this can easily but stopped on Gameknot by using the on-line opening databases, which are quite legal.",
        "6... O-O": "So now I have two defenders to f7.",
        "7. Nc3": "This is good development.",
        "7... h6": "So I put the question to the knight. The post-game computer analysis (PGCA)gives this move as a mistake, and gives Bg4 as stronger, but I am not convinced. The PGCA is not always right!",
        "8. Nxf7": "and she makes the wrong choice. Retreating was stronger. Although in theory knight and bishop are worth the same as rook and pawn, in practice they seldom are, and in this position, they certainly are not.",
        "8... Rxf7": "So I take.",
        "9. Bxf7+": "She takes back.",
        "9... Kxf7": "And so do I.",
        "10. Nd5": "PGCA gives this as a mistake, and recommends Be3. i tend to agree.",
        "10... Be6": "So I develop again.",
        "11. b3": "PGCA gives this as another mistake - which it is - Loly now drops a pawn for no reason. PGCA suggests Nxf6 followed by Be3 and I tend to agree.",
        "11... Nxd5": "So i take.",
        "12. exd5": "She takes back",
        "12... Bxd5": "I take again.",
        "13. c4": "She drives my strong bishop away from d5 - a good move from Loly.",
        "13... Be6": "So i retreat.",
        "14. Bb2": "This is a strong developing move by white.",
        "14... Qg5": "I start to probe her king side.",
        "15. Qf3+": "She throws in a check and brings her queen to the king side to defend - an excellent plan.",
        "15... Kg8": "So my king retreats.",
        "16. g3": "But this move is very weakening. h3, g4 and f3 are now weak white squares round her king - very dangerous - especially when I have a white squared bishop and she she doesn't!",
        "16... Rf8": "I hit her queen.",
        "17. Qg2": "She retreats.",
        "17... Nd4": "I am quite proud of this move. I offer her the pawn on b7. She shouldn't have taken it, as it mean her queen is taken away from the main scene of the action.",
        "18. Qxb7": "But she did take.",
        "18... Nf3+": "and I threw in the knight check.",
        "19. Kg2": "Kh1 was better, but this position is now lost for white.",
        "19... Bh3+": "I was pleased at finding this bishop sacrifice too.",
        "20. Kxh3": "This leads to mate, so one could argue that Kh1 is better, but black would still have an overwhelming position.",
        "20... Qh5+": "So queen check.",
        "21. Kg2": "That move was forced.",
        "21... Qxh2#": "And I mate her.\n"
    },
    "url": "https://gameknot.com/annotation.pl/june-1-challenge?gm=59031",
    "gameName": "June 1 Challenge",
    "players": "missloly (1035) vs. charleshiggie (2066)",
    "opening": "Bishop's opening (C23), Classical variation"
}