{
    "moves": {
        "1. e4": "As Black, I made a few mistakes that ended up with me losing two pawns, but all of a sudden I see a possible counter-attack on my opponent. One move later, I lose to a brilliant knight move. I love unusual mate positions (unusual, clever, pretty, dashingly handsome - they're all good!) even if they're played against me. This one involves a mate with a bishops and two knights",
        "1... c5": "This is my prime move when the King's Pawn is played - the silican. I might (as I mentioned in another annotation) work on what I can do with the Scandinavian defence though (1...d5)",
        "2. Bc4": "White brings out his bishop - but this is not the best response to the silican. I take the recommendation of nuntar and play...",
        "2... e6": "with the threat of d5, gaining tempo and driving back the bishop",
        "3. Nc3": "bringing out the knight",
        "3... g6": "playing my normal developing move, but if I wanted to play defensively then 3...a6 would work as well",
        "4. a3": "?! Though this pawn move may have looked good for Black, it seems like a waste of a move for White - right now I'm not planning to land a knight on the b4 square anyway. Maybe White was thinking of 5.b4, but although Black would lose some centre control, it'd weaken White's queenside, as well as lose a pawn (5...cxb4 6.axb4 Bxb4... but then White could play d4 to strengthen his centre control, which may compensate)",
        "4... Bg7": "the bishop now has control of the long diagonal (fianchetto)",
        "5. Nce2": "hmm.... this could be a little slow for White, but there's nothing seriously wrong with this move (I'd have played Nge2 or Nf3)",
        "5... Ne7": "Opening up a castling opportunity kingside. I do consider Nf3, but I'd lose tempo if White were to play e5 - the e-pawn would be vulnerable, but a) Ne4, Ng4 and Nh5 would all be open for White's pawns to push my knights around (f3 if Ne4/Ng4, and g4 if Nh5) and b) the time taken for Black to take the free pawn would allow White to catch up in development ",
        "6. Nf3": "White brings out his other knight, and the knight pair looks stable where they are (both knights control the d4 square). Also, White can now castle...",
        "6... O-O": "as Black does here",
        "7. c3": "?! another strange pawn move - perhaps White is thinking of b4 here? (though to be fair, that option was open to White since move 5)",
        "7... d5": "now's a good time as any - the White bishop has overstayed its welcome",
        "8. exd5": "White shouldn't retreat its bishop straight away due to 8...dxe4, forcing the White knight to move",
        "8... exd5": "Black's centre control looks good here",
        "9. Ba2": "better than Bb3, because of....",
        "9... c4": "White would have been forced to retreat again had he only retreated the bishop one square, but this move still packs a punch - it blocks off the a2-g8 diagonal for the bishop",
        "10. d4": "halts any further advancement of Black's pawns - I had a game where my opponent had me trapped like this in the opening moves - my first and only attempt with the French Defence as Black (1. d4 d6 2.d5 e5 3.e4 c5 4.c4 - that ended up being too cramped of a game for me, and I lost to a king/queen fork by my opponent's knight)  ",
        "10... b5": "I start a possible queenside attack",
        "11. h3": "stops Bg4, but this does something else to me psychologically... ",
        "11... h5": "my attention suddenly focuses on the kingside, and advancing my pawns while attacking the knight at the same time (when my pawns get there). What I should have done here was a4, continuing my queenside assault (White could play b4, but after a4, it really cramps queenside activity)",
        "12. Bg5": "a pin on the knight, but I have no problem with this...",
        "12... f6": "it's a perfect excuse to continue my kingside assault!",
        "13. Bf4": "?! I think at first that White blundered with this move...",
        "13... g5": "as shown here - attacking with tempo...",
        "14. Bxb8": "but I never expected this! This was new to me, and I definitely wouldn't have traded a developed piece for an undeveloped piece (this move also draws my attention to the fact that my queenside pieces are undeveloped - maybe I've been focusing too much on pawn advancement?) but then again, in this game knights could be more useful due to the (slightly) cramped nature of the game",
        "14... Rxb8": "naturally, I return the favour",
        "15. Bb1": "moving the bishop to a better position",
        "15... f5": "?? I see the bishop move, and I immediately play this to block in the bishop, but that pawn was needed elsewhere...",
        "16. Nxg5": "! protecting the g-pawn, for example. This is an obvious move, but it still packs a punch - it rips open a hole in my kingside defence",
        "16... Nc6": "A discovered attack on the knight, but Ng6 may have been better",
        "17. h4": "instead of retreating, White protects the knight, and therefore it remains a threat to Black",
        "17... f4": "? well, so much for my blocking the bishop... that h7 square isn't looking too good, and what can the pawn do at this point anyway? I was thinking of clearing more space for my rook, I think",
        "18. g3": "hm?  White's letting me attack the knight?",
        "18... f3": "well, if he insists...",
        "19. Nf4": "oh, wait, the queen. White threatens to take the pawn, but I see something else...",
        "19... Re8+": "White never castled in the 13 moves that he had the opportunity to, and now he never will! ",
        "20. Kf1": "Well now that's out of the way, I need to do something about that threat on the f-pawn, so I move my bishop to...",
        "20... Bd7": "? You know what, I'm raking my brain but I can't work out why I made this move! ",
        "21. Qxf3": "Why not? ",
        "21... Bg4": "NOW I move the bishop. Too late? well, yes but I didn't see what the Queen could do - the only safe square for the queen was the f2 square, and a pin on the king with Bh3 is threatened.Since the g3 square was defended by two knights and a rook, my aim was then to move the rook to e7, then the queen to e8 to threaten a possible mate with the king. Qd7 wouldn't work because White can move its bishop to stop Qe1#",
        "22. Bh7+": "!! speaking of which.... all roads lead to me getting thrashed. The lesser of the two evils- Kf1 - is met by Ne6+, winning the queen. Kh1, and Nf7 wins the queen, but at least it'd allow for an exchange of queens...",
        "22... Kh8": "right?",
        "23. Ng6#": "Nope! Why do that when you can do this? a nice finish by White! and those pawns over on the queenside never did go in for the attack... good game :)"
    },
    "url": "https://gameknot.com/annotation.pl/just-when-you-think-you-have-a-counter-attack?gm=26829",
    "gameName": "Just when you think you have a counter-attack...",
    "players": "willis59 (1381) vs. x-machine (1188)",
    "opening": "Sicilian defence (B20)"
}