{
    "moves": {
        "1. e4 c5": "Being a true winner, the only move I had expected from him. I decided to surprise him...",
        "2. Ne2": "The Keres system, one of my favourites next to 2. f4... I prefer this over Nf3, any day...",
        "2... g6": "Of course, black was not totally surprised. He had read my bio, past game history, and so on. He was expecting 2. f4... Exactly the reason, I didn't play it... So he decided, to play my favourite with black, 2. ... g6, in most cases... Out of respect for Doctor Keres, I would play 2. ... Nf6, the Nimzowitch approach. I lost some fine games against that; they drawed ;)",
        "3. Nbc3": "Most replies in the Sicilian Defense fail now. White prevents a quick d5... The trick with this variation is, that Bc8-g4 can never threaten the Kings Knight - defender of d4 - because of f2-f3... Nc3 can be replaced by Ne2-c3, let say after Nc3-d5... Paul Keres made a great contrubution to fighting the Sicilian, with this plan...",
        "3... Bg7 4. d4 cxd4 5. Nxd4 Nc6": "5. ... d6 6. Nd5 Nf6 7. Nxf6... Where's the Sicilian Maffia when you need them... Enters the Sicilian Dragon, accelerated, no less...",
        "6. Be3 Nf6 7. Qd2": "At this stage, the Queen must never leave the d-file... 7. Nxc6 bxc6 8. e5 Ng8 9. f4 Nh6 leads to nothing...",
        "7... Ng4": "Attacking the bishop... There is little hope in 7. ... 0-0 8. Rd1...",
        "8. Nxc6 dxc6 9. Qxd8+ Kxd8 10. Bd2": "Back to the drawing board, for black, we are leaving the Sicilian trail... After 8. ... bxc6 9. Bd4, white wins the opening stage... After 9. ... Bxd4 (0-0, Bxg7 is worse) 10. Qxd4 (hence 7. Qd2) f6 (0-0, h3, Nf6) 11. Be2 Ne5, white has nice play...",
        "10... Bd4": "Trying to make something out of nothing, El Nuño chatted...",
        "11. Nd1": "Forced... Surely, Nxf2, Nxf2, Bxb2, Rd1, Ke8 (else Bc3+), c3 is no option...",
        "11... Be6 12. f3": "Better then 12. Bc3 Bxc3 13. Nxc3 Kc7 14. h3 Nf6... And much stronger, then directly f4... 12. h3 Nf6 promises white nothing...",
        "12... Ne5": "12. ... Nf6 13. c3 Bb6! 14. Ne3 Nd7 looked fine for black... f4 is constant threat, now...",
        "13. Be3": "13. f4 Nd7, and all is well for black... This is a forcing move...",
        "13... Bxe3 14. Nxe3 f6": "14. ... Kc7 15. f4 Nd7 is surely sounder...",
        "15. a3": "I wanted to release the pressure on a2... After f4, Nd7... My plan of Be2, ..., Kf2 (let alone 0-0), didn't please me anymore... Black is planning an attack against whites kingside... We seek temporary solitude at the queenside...",
        "15... Kc7": "Practically forced, or else 0-0-0+, and white wins a tempo... 15. ... Nd7 16. Rd1, forfeiting 0-0-0 alltogether... ",
        "16. O-O-O": "Decisions, decisions... I wanted to keep f4, and Be2 as precious threats... Maybe not best. I had promised myself not to castle the long-shot but it seemed tempting, because blacks pieces are not in position for a queenside attack... Had I not played a3, now Bxa2 for sure, and black wins...",
        "16... Nd7": "So far, whites strategy worked. Black collapses under the pressure of f4... I was expecting Rad8, or h5...",
        "17. Be2": "The only move, in all variations... Complete development... The temporary closure of the d-file gives us (both) precious time to re-organize, and use the half-open d-file to our benefits... Black has to start a new plan...",
        "17... Rhd8 18. h4 Nc5 19. Rxd8": "Maybe better, is straightaway 19. h5 g5 20. b4, and keep the rooks on board... The plan is, to clean up the attack on the kingside, and travel my king back there, but I am probably better off with two rooks...",
        "19... Rxd8 20. h5 g5 21. b4 Nd7 22. g3 a5": "This reply caught me off balance, I was reckoning with 22. ... Bf7 23. h6 e6... 22. ... a5! clears all tensions... Black is opening the a-file...",
        "23. f4 axb4 24. axb4 Ra8 25. Kd2 Ra4": "Again, black finds the strongest reply. Maybe 25. Rd1 Ra4 26. c3 was better, because we have Ke1, but I didn't like the idea of Bb3!...",
        "26. Rb1 c5 27. c3": "The only way, for white... Black is playing only forcings, now... Soon, white will have to exchange rooks, or travel his King back to the kingside, at last...",
        "27... Ra2+ 28. Ke1": "I felt, it was too early to exchange rooks with 28. Nc2, and Ra1... Altough this game must end in a forced draw, black has still to prove his point...",
        "28... Nb6": "A trick question, avoiding the issues...",
        "29. Rc1": "All other moves are delusional, for white... Rc1 belongs...",
        "29... Na4": "I was reckoning with 29. ... Bb3, preventing Rc2... New material...",
        "30. h6": "Let's see, what he makes of this... Tempo play...",
        "30... Kd8": "It was surely about time, to play Bf7, to free the e-pawn...",
        "31. e5": "Relentless... Plan A is fulfilled: the kingside is under control... Now solve the queenside...",
        "31... gxf4 32. gxf4 fxe5 33. fxe5 Kc7": "Ad lib... Black is thriving into trouble... I was reckoning...",
        "34. Bd1": "Forcing b5...",
        "34... b5 35. Be2": "After 34. ... b5, I had planned 35. Rc2 Ra1 36. Kf2, and after 34. ... c4 35. Be2, via conditional moves. Something must have gone wrong, it resulted in this... Lesson: never use condition moves, sheer out of impatience...",
        "35... c4": "Of course...",
        "36. Kf2": "Chess blindness, still pretty much oblivious of what happened at move 35... In my mind, Rc1 was on c2, and his on a1... So I played 36. Kf2 out of blind faith; Rc2 was still in order... White loses a tempo here, and his precious edge... Now, he will have to fight, for a draw...",
        "36... Bf7 37. Nf5 Bh5 38. Nd4 Bxe2 39. Nxe2": "My punishment for ignoring Keres' rule: never play 0-0-0, or 0-0. Play f3, Kf2... From now on fourth, I will always have to exchange bishops at e2, and take back with a pinned knight...",
        "39... Rd2 40. e6 Rd5 41. Kf3": "I admit it full blooded: we had some (well-earned?) fortune... After 36. ... Kc6!! (pulls the hook out of any threats against b5) 37. Ke1/Kf1 (lost tempo at 36) Bd5! (prepares e6, and prevents Kf3), white has to start worrying... The text is forcing for white, after 36. ... Bf7, Nf5 is the only viable move... Of 40. ... Rd5, I am not utterly convinced. I feared Rd6, Nd4/Nf4 etc... This is very unclear now. After 41. ... Rd3+/Rf5+ 42. Ke4! (Rf5+, Kg4, Rf6 is better for black), white suddenly has Nd4! Damned knight?!",
        "41... Rh5": "I saw more light in the tunnel for black, after 41. ... Kd6 42. Nf4 (else Rd3) Rf5 43. Kg4 Rf6 44. Kg5 Nb2!, preventing Rd1...",
        "42. Rd1": "Just in time... The draw is settled. The most spectaculair variation (since both sides are forced) is 42. ... Nxc3 43. Nxc3 (Rd7+ leads to the same variation) Rh3+ 44. Kf4 Rxc3 45. Rd7+ Kc6 46. Rxe7 Rh3 47. Rxh7 c3! 48. Rh8 c2 49. Rc8+ Kd6 50. Rxc2 Rxh6 51. Rc5 Rxe6 52. Rxb5... Although white has a pawn left, he can never win; because of eternal checks by black, whites King cannot get to the pawn, and whites rook cannot get behind it... After 42. ... Rh3+ 43. Ke4, we lead into variations with eternal checks... 43. ... Nb6 (to prevent Rd7) 43. Nd4 Na4 (or else, trouble for black), same...",
        "42... Nb6 43. Nd4": "My opponent hates forcings by now. Let's see, what this variation does...",
        "43... Nd5 44. Nxb5+ Kb6 45. Na3 Rh3+ 46. Kg2": "43. ... Nd5 is a nice forcing, also; white has to follow... All is pretty much forced, for both sides... 46. Kg4 works, also... This is a very tense position. 46. ... Nxc3/Ne3+ 47. Nxc4+/Kxg2 doesn't work... In fact, 46. ... Rh5 47. Rd4, neither...",
        "46... Rxc3 47. Nxc4+ Rxc4 48. Rxd5 Re4": "After 48. ... Rxb4 49. Rd7 Rh4 50. Rxe7 Rxh6 51. Kg3...",
        "49. Rg5": "No more beating, around the bush... 49. ... Rxe6 50. Rg7 Rxh6 (else Rxh7, and black might even lose) 51. Rxe7... This is a technical draw, because blacks pawn cannot be held, like whites pawn... After 49. ... Rxb4 50. Rg7, I expect The Return of The Black King, 50. ... Kc6, 51. Rxe7 Kd6 52. Rxh7 Kxe6 53. Kg3 Kf6 54. Rd7 Kg6 (Ke6?, h7, and black loses) 55. h7 Rb8... Blacks King is keeping Whites King away from h7, whites pawn will be lost... I sent a draw offer, which was accepted..."
    },
    "url": "https://gameknot.com/annotation.pl/just-what-doctor-keres-ordered?gm=42033",
    "gameName": "Just what Doctor Keres ordered",
    "players": "vonbonkisback (1945) vs. kaspanatola (1945)",
    "opening": "Sicilian (B20), Keres variation (2.Ne2)"
}