{
    "moves": {
        "1. e4 e5 2. f4 Bc5 3. Nf3 Nc6 4. Nc3 Nf6": "King's Gambit Declined. I usually prefer 4.Nc3 to 4.c3. ",
        "5. d3": "I was in a mood for experiments. Usually I would get my bishop to c4 or b5, but this time decided to do something different. ",
        "5... d6 6. Na4": "Standard manouver in this type of positions, to exchange the annoying bishop. ",
        "6... Bb6 7. Nxb6 axb6 8. Be2 O-O": "Already here, I thought that leaving the bishop behind the pawn chain was not a good idea. Black has at least equality, natural positions for the pieces. The rook goes to e8, bishop to g4, d7 or e6, the other rook can join the game through a5... ",
        "9. O-O exf4": "Thank you. At least I can get the bishop out without losing a tempo. ",
        "10. Bxf4 d5": "Wow. I never expected this. Which made me feel bad for a moment, since unexpected moves are a sign of a bad form or poor thinking process. But then I thought, wait a moment, it shouldn't be so good. He just gave extra space to my bishop on f4, allowed e4-e5 with subsequent d3-d4. Doesn't smell right. Ah, e5 will be met by Nh5, but I'll play Bg5, so I am Ok. If f6, I'll just exchange the pawns.  ",
        "11. e5 Nd7 12. d4": "Naturally. I already started thinking about putting the bishop to d3, looking at the h7 pawn. ",
        "12... f6": "Damn. I did not even think what I was going to do if he played f6 now. Now I can capture, the knight will go back to f6 and black's position is Ok. The pawn looks bad on f6, I should be able to exploit it somehow. What if e5-e6? Strange, but here for some reason I thought that black knight is trapped. I did not even see it could go to b8!!!",
        "13. e6 Ndb8": "One pawn down. Need to think about damage control now. What is my advantage? Developed pieces. Let's continue developing the pieces. As Bronstein used to say: \"I'll give him a pawn, he will use a tempo to take it, I will make a useful move...\". ",
        "14. Qd2 Bxe6 15. a3": "Useful move. Limits the knight on c6, but also, the pawn on a2 may need protection. Strange thought? Not at all. Think of c2-c4 thrust and if black captures, I play d4-d5. But I need a rook on d1 for that. Take the rook from a1 and the a2 pawn will be defenceless. But also, I don't know at this stage where would be the best position for the rook - d1 or e1. So it is also a waiting move. Let's see what black has in mind. ",
        "15... Ne7": "Interesting plan. Rather strange. The second knight is coming to c6 I guess. Two black pieces on e file. Time to move the rook. ",
        "16. Rae1 Ng6 17. Bg3 Bf5": "Oooh. This just invites my next move. ",
        "18. h4 Nc6 19. h5 Nge7 20. Nh4": "White seems to have a serious pressure on the kingside. Wanna test it? Flip the board, look at the position with black's eyes. It feels uncomfortable. But black plays a good move!",
        "20... Be4": "Suddenly I felt not so optimistic. f6-f5 is coming. I need to think defence. Primary goal? Exchanging black's most active piece - Bishop e4! ",
        "21. Bd3": "!? Complications! Now N:d4 22.B:e4 de 23.R:e4 loses the queen after 23...N:f3 . I don't have time for c2-c3. ",
        "21... Nxd4": "As expected. ",
        "22. Bxe4 dxe4 23. Qf4": "! Yes. Not only delaying the capture on e4, but also giving up the pawn on c2. Good move, White's concentration of pieces on the kingside starts to look intimidating. ",
        "23... Nec6": "I would have preferred f6-f5. Now that another piece moved away from the kingside, my chances seem pretty good. ",
        "24. Rxe4 Nxc2 25. Nf5": "Closing in on the black king. I looked into different options with h5-h6 and capture on c7, looked at the possibility of throwing the rook on the 7th line (no idea how to get it done at this stage...) and decided to bring the knight closer to action. Tal liked to play moves like this - he called it \"throw in\". The knight becomes potentially very dangerous. You never know what it can do - sacrifice on g7 or h6, go to e7 to enable the rook finally get to the seventh line, or cover the d4 square. Very useful move. ",
        "25... Ra5": "Well played. Black brings the sleeping rook into the game. Little bit late I must say. ",
        "26. Qg4": "Simple, but efficient. Now g7 can't be protected by the rook, because Nh6  wins exchange. The black queen also can't step on d7 because of the same Nh6. So...",
        "26... Rxf5 27. Qxf5 Qd3": "An attempt to coordinate pieces that are all over the board. Black also attacks the bishop on g3. ",
        "28. Qe6+": "First, let's get out of the pin. ",
        "28... Kh8 29. Bxc7": "A move for a reason. Now here, a move like Ncd4, would be punished by 30.Qf7! threatening a back rank mate. Even if black plays something else that leave the d-file open, the queen can't come for help, since the d8 square is under control by the \"escapee\" bishop. But black preferred to lose differently. ",
        "29... Ne5": "Losing move. But follow the next few moves!",
        "30. Rxe5 Qxf1+": "Wow! Unexpected again. I quickly checked 31.K:f1 fe and realised that a natural looking Ke2 loses to Nd4 check! Nice. ",
        "31. Kxf1 fxe5+ 32. Kg1 Ne3 33. Bxe5": "Exactly! Another trap was there for Q:e5 - 33...Rf1  34.Kh2 and Ng4 winning the queen and the game! ",
        "33... Nf5 34. h6": "Simple. Finishes the game. ",
        "34... b5 35. hxg7+ Nxg7 36. Qe7": "Black is cornered. No chance. 1-0"
    },
    "url": "https://gameknot.com/annotation.pl/just-an-interesting-game?gm=11898",
    "gameName": "Just an interesting game",
    "players": "Beginner78 (???) vs. unknown (???)",
    "opening": "KGD (C30), classical, Svenonius variation"
}