{
    "moves": {
        "1. d4": "Game 3 of the league, and so far so good. I'm 2-0 and looking for another win to beat my 3-3 record last year. I had won the first three games and then lost the last three, sadly. But this time I can further rely on my greater experience, primarily from playing chess on Gameknot throughout the year.",
        "1... e5": "Some wierd move I had not seen before. I figured why not take the pawn?",
        "2. dxe5 f6": "Black's version of the Blackmar-Dymer gambit. I don't want the black knight coming to f3 right away.",
        "3. Nf3 Bc5 4. exf6": "Why I took here I can't remember; there were many other possibilities such as e3 or Nc3.",
        "4... Nxf6 5. c4": "I simply wanted to stake central control and allow my other knight to develop without blocking my c pawn with this move.",
        "5... Ne4": "Threatening checkmate (Bxf2#)",
        "6. e3 Qf6 7. Be2 Bb4+": "My opponent continues the attack before my king can castle safely.",
        "8. Nbd2 Bxd2+ 9. Bxd2": "Note the immediate checkmate if 8. ... Nxd2 (9.Qxf2#).",
        "9... Qxb2": "Black wins a pawn from the scrabble.",
        "10. O-O Nc3 11. Bxc3 Qxc3 12. Qb1": "Aiming for e4",
        "12... Qf6": "Black had to do this to save his king's ability to castle after 13. Qe4+, but, then again, I guess he could have castled.",
        "13. Qe4+ Qe6 14. Qd4": "Attacking g7",
        "14... O-O 15. c5": "Threatening Bc4.",
        "15... Nc6 16. Qc3 d5 17. cxd6 e.p. Qxd6 18. Bc4+ Be6 19. Ng5": "The only move that will save my opponent from losing material is Nd8.",
        "19... Rae8": "oops...",
        "20. Bxe6+ Rxe6 21. Nxe6 Qxe6 22. Qb3": "I trade down material, since I am ahead by a rook minus a knight.",
        "22... Qxb3 23. axb3 a6 24. Rfd1 b6": "That was a blunder.",
        "25. Rxa6 Nb4 26. Ra7 Rc8 27. Rd7": "My rooks become lethal on the seventh rank. It is too late for Black to save the pawn on c7. If it pushes forward, then Rxg7+",
        "27... Nc6 28. Raxc7 Ra8": "Threatening a mate in two (Ra1+ Rd1 Rxd1#) (A mate in three if I take the knight).",
        "29. g3": "Thankfully, in the midst of my ecstacy of winning, I saw the threat. (Many players get cocky too early while winning and end up losing in the process.)",
        "29... Rd8": "Essentially, he's giving up his knight.",
        "30. Rxd8+ Nxd8 31. Rc8": "A pin, behold.",
        "31... Kf7 32. Rxd8 Ke7 33. Rb8 Kf6 34. Rxb6+": "Now it's all just a matter of winning this game.",
        "34... Kf5 35. Rc6 g5 36. b4 h5 37. b5 Kg4 38. b6 Kh3 39. Rh6": "I should have not wasted my time messing with my opponent's pawns and instead should have marched my own pawn to promotion.",
        "39... Kg4 40. b7 Kh3 41. Rxh5+ Kg4 42. Rh6 Kf3 43. b8=Q": "Black Resigned. My third strait win! Rating and commenting are appreciated."
    },
    "url": "https://gameknot.com/annotation.pl/kamiak-edmonds-woodway-bd-3?gm=28878",
    "gameName": "Kamiak @ Edmonds-Woodway bd. 3",
    "players": "Travis Olson (878) vs. Matt McClenny (1040)",
    "opening": "Queen's pawn (A40), Englund gambit"
}