{
    "moves": {
        "1. c4 e5": "A mini-tournament game, I'm playing black and my opponent goes English, so I go Sicilian. Or more accurately, the Sicilian Variation of the English Opening, a.k.a. King's English. Note: this game seems to be well-played by both sides all the way through. I welcome any commentary by anyone who sees a winning line for either player, for I'm at a loss to find one.",
        "2. Nc3 Bb4": "Well, I'm already off the reservation. My little bit of resources suggests 2. ... Nf6, 2. ... Nc6, or 2. ... d6 in that order, but the GK DB seemed to show this move, 2. ... Bb4 as more successful, so I went with it.",
        "3. Nd5 Be7": "Even though it seems weird to charge out there then run right back home. Or nearly home.",
        "4. d4 d6 5. e4 Nc6": "I'm not a big fan of white's pawn center. I'm beginning to think the Sicilian might be better left to black to play, and not so good to drag white into a reversed Sicilian. Although, it could just be my awkward handling of it.",
        "6. Nxe7 Ngxe7": "At least black is out in front in the development race, to compensate that white center.",
        "7. d5 Nd4 8. Bd3 O-O 9. Ne2 Nxe2 10. Qxe2 f5": "Development is equalizing, so let's challenge the center.",
        "11. f3 c5 12. O-O fxe4 13. fxe4 Rxf1+ 14. Qxf1 Ng6": "I don't know what I hoped to gain by trading for no good reason. In the end, it may have been black's undoing. Black may have fared better by keeping the pieces on the board, complicating the position, and looking for openings. Instead, these trades and many that follow just simplify the position without gaining an advantage. Probably not a wise course of action.",
        "15. g3 Bd7 16. Bd2 b5": "I'm really quite at a loss here how to proceed. I am hoping to draw white into creating opportunities, but so far he's been reluctant to give me much.",
        "17. cxb5 Qb6 18. Be3 Rf8 19. Qg2 Bxb5 20. Bxb5 Qxb5": "More trades, but not to anyone's advantage.",
        "21. Qc2 Rf7 22. b3 Nf8 23. Rc1 Nd7": "Just centralizing. I think by this point I was already expecting an unfortunate ending to this game.",
        "24. Qc4 Qxc4 25. Rxc4 Rf3 26. Bg5 h6 27. Bd8 Rf7": "27. Bd8! was really quite clever. Instead of rampaging my rook through my opponent's backfield, I'm required to bring him home to save my own backfield.",
        "28. Bc7 Nb6 29. Bxb6 axb6": "Well, at least the black pawns feel stronger than the white pawns, though it won't do black much good.",
        "30. Kg2 b5": "And now we just waste some time...",
        "31. Rc3 g5 32. Rc2 b4 33. Re2 Kg7 34. Rc2 g4 35. Rf2 Rxf2+": "Final position. I had been hoping white would do something strange or desperate and give black an opening. But it was evident he was of no such inclination. Pouncing on his rook essentially nailed the last nail in the draw coffin, so I did so and offered the draw. White accepted. This game was very well played by my opponent."
    },
    "url": "https://gameknot.com/annotation.pl/keep-it-complicated?gm=23109",
    "gameName": "Keep it Complicated",
    "players": "pmcmurphy (1771) vs. blake84120 (1913)",
    "opening": "English, Kramnik-Shirov counterattack (A21)"
}