{
    "moves": {
        "1. e4": "This was my first win, that I can acknowledge to myself. I didn't play my h3 or a3 rather a regular opening.\nIt's the second game I comment here, after the lost one (http://gameknot.com/annotation.pl/lets-play-chess.pl?gm=23489)\n\nI am prompted to comment my games because I saw that some people comment on my analysis and give precious feedback of which I can draw much advises and understanding.",
        "1... c5 2. Nf3 g6 3. d4 cxd4 4. Nxd4 Nc6 5. c3": "c3 opens the files for Bf1 and Qd1. Moreover it secures d4. The only problem is that it blocks Nc3 which is not very bad if I develop the bishop c1.",
        "5... Nf6 6. f3 d6": "I was expecting e6.",
        "7. Bb5": "I wanted to gain time and castle very soon. The elo of my opponent indicated that he is a powerful player and in such cases I always try to castle soon because of my lack of opening theory.",
        "7... Bd7 8. O-O Bg7 9. Be3": "My position is good.",
        "9... Nxd4 10. Bxd7+ Nxd7 11. cxd4": "Some people have superior play when the position is somehow clear and not too much complex with the existence of major pieces.\nBy cxd4 instead of Bxd4 I was avoiding an exchange of pieces and avoiding the situation of playing a simplified position where I may fail to see how I can play while the other opponent (being an old, experiences player) may perform well in term of pawn structure etc.\n\n\n",
        "11... O-O 12. Nc3": "Moreover you can see that my Knight is much more happy at c3.",
        "12... Qa5": "A typical move. Only adds to the proofs that my opponent is respectable.\nIn this position I'd like to examine things and try see yourself what you can play. Give yourself a few seconds or even minutes.",
        "13. Qd2": "You may think that I played this naturally to give more freedom to my rooks in the a-rank. My queen is pinned and if not because of the bishop this can be dangerous in the future.\n\nMy idea instead to give possibility for Nd5 which attacks two pieces in one moment : the Queen at a5 and the pawn at f7.\nIf QxQ, then Nxf7+ then after K moves I just take the queen and win a pawn.\n",
        "13... Rfe8": "I was hoping that my opponent places one of his rooks at d8 so that when I go with my plan of Nd5 the queen no more can retreat at d8 to secure e7.\nAfter he played Re8 I noticed that my plan was bad from the start.\nIn fact if Qa5 takes my queen and Nxe7+, Kh8  and that I take the queen with my bishop e3, d4 will be undefended :\nblacks will play Bxe4+ and after K escape, Bxb2 : Now blacks have an extra pawn when they were down a pawn. Note that If Rb1 then Bf6 forces me to retreat the Knight that took the pawn and f7 and hence I loose the time that I would have used to take b7 and balance the material.\n\nTwo choices were available to me :\n1. Either correct the weaknesses in my position (for instances, employ the rooks to secure d4 and b1) or attack so not to let my opponent find the time to strengthen his position.\n\n",
        "14. f4": "This is the attack. future is f5, and my rook will remain at f1.",
        "14... Nb6": "Blacks begun to develop and enter the battle with attack.\n",
        "15. b3 d5": "I was really expecting e5.",
        "16. e5": "I'm better now.",
        "16... e6 17. g4": "Continuing the pressure.",
        "17... Bf8": "If Bb4 then I will be in trouble. At least I will be losing time while my opponent will be bringing his dormant rook at a8,etc.",
        "18. Qd3 Rac8": "Now It's my time. If I play Rac1, then my king-side attack will be affected : Bb4, then Ne2 then Rx and finally Rf1xc1. Rather I liked to keep my powerful pieces ready and focused on the king-side attack.",
        "19. Ne2": "So I consider this as the best move that I did in the whole game.",
        "19... Ba3 20. f5 exf5 21. gxf5 Rc6 22. fxg6 Rxg6+": "I was well aware since 22.fxg6 that Rxg6 will not reduce my attack possiblities.",
        "23. Kh1 Bb2 24. Qf5 Re7": "At this move I was studying the possiblity of the sacrifice with Nf4. In the end, I took my precautions and retreated my rook.",
        "25. Rab1 Qxa2 26. Nf4 Bc3 27. Nxg6 hxg6 28. Qf6": "My opponent resigned. His resignation was also another proof he was good. Personally I think I won this game by making strategic choices.\n\n"
    },
    "url": "https://gameknot.com/annotation.pl/keeping-the-attack-focus?gm=23493",
    "gameName": "Keeping the Attack \"Focus\"",
    "players": "potatosoftware (1411) vs. bill32606 (1680)",
    "opening": "Sicilian (B27), Hungarian variation"
}