{
    "moves": {
        "1. e4 c5 2. Nc3 Nc6 3. Nf3 d6": "Another blitz game!  Sometimes I play the open variation and sometimes closed and sometimes it is really a Kings Indian Attack variation.\n",
        "4. d3 Nf6 5. g3 e6 6. Bg2 Be7": "Black is solid and white wants to develop his DSB without the reply Ng4 so ...\n",
        "7. O-O Bd7 8. h3 Qc7 9. Be3": "Black should castle here or soon but he decides to prevent Nb5 and expand on the Queen's wing.\n",
        "9... a6 10. d4": "So white decides to open the center.  \n",
        "10... cxd4 11. Nxd4 h6 12. Qe2 b5 13. a3": "White prevented the expansion but black sees a good post for his knight.",
        "13... Rc8 14. f4 Na5 15. Rad1 Nc4": "Black has a nice tactical shot but it will leave him exposed in the center.",
        "16. Bc1 Nxa3": "If white plays bxa3 then black captures the knight on c3.  But white has a better reply.",
        "17. e5 dxe5 18. fxe5": "If Black plays Nd5 the white exchanges the knights and then captures on a3 getting a significant material advantage.  So black must retreat the knight and this traps his king the center.\n",
        "18... Ng8 19. Qf3": "Guarding the pawn on f7 is not possible.  Black should probably have retreated the knight to h7 so he castle and survive. ",
        "19... f6": "This stops the threat to f7 but there are other possibilities now.\n",
        "20. Qh5+": "Black must play 21. ..., Kf8 here after which the complications from 22. Nd5 are hard for me to calculate but that was the plan. ( Qxe5 is not possible as QxQ wins the queenas the f pawn would be pinned ) After other moves exf6 looks tough and 22. ..., exd5 if followed by 23. Bxd5 with the threat of mate on f7 and I don't see a good way to stop it since 23. ..., Be8 allows Nxe6 mate.  Please help me out if you see other options.",
        "20... Kd8 21. Nxe6#": "Black went the wrong way but I think he was in trouble anyway.  "
    },
    "url": "https://gameknot.com/annotation.pl/kia-vs-sicilian?gm=64561",
    "gameName": "KIA vs Sicilian",
    "players": "JMD1952 (1200) vs. leightern (1624)",
    "opening": "Sicilian (B23), closed, 2...Nc6"
}