{
    "moves": {
        "1. d4 Nf6 2. c4 g6 3. Nc3 Bg7 4. e4": "Here I am playing black with the King's Indian Defense in a blitz game.",
        "4... d6": "To prevent an immediate e5 and to do e5 later.",
        "5. Nf3 O-O 6. Bd3": "Well it's not the best continuation but it's still fine. Be2 or h3 are more popular and have more success.",
        "6... Nbd7": "Preparing e5 or c5. The knight block the way of the bishop but most of the time it's better to let him at c8 since he already facing a free diagonal.",
        "7. Be3 e5 8. d5": "It's most of the time better to close the position for white since it blocks the way for the bishop on g6 and black has less space to move his pieces.",
        "8... c6": "The idea of c6 is to block Nb5, making a way for my queen and the possibility to free white's dominance on the center. The f5 push for black is not a good strategy because light square bishop is on d3 at the moment.",
        "9. O-O Nc5": "The knight on c5 is a very classical position for black and most of the time black make a5 before to prevent b5. Here the knight threats e4 and d3.",
        "10. Rc1": "?! White should have kept his bishop.",
        "10... Nxd3 11. Qxd3 Ng4 12. h3 Nxe3": "To have the two bishops is sometime a must in the endgame since bishops cover more space and move faster.",
        "13. Qxe3 f5": "Attacking the king side and making room for my pieces.",
        "14. Qd3 Qe7": "Ready for Rd8 to cover d6 if white do dxc6 and Rd1.",
        "15. Nd2 Bh6": "The bishop covers a better line and pins the knight.",
        "16. f3": "?! White should have moved his rook to remove the pin.",
        "16... Qg5": "The queen threats Qxd2 and face the king, giving the possibility of a future Bxh3.",
        "17. Rcd1": "Necessary.",
        "17... c5": "! It was important to close the position at this time because if white opens the d line black's game is over.",
        "18. f4": "White lose a pawn but find a way to block the attack.",
        "18... exf4 19. Nf3 Qf6 20. Rde1 Re8 21. exf5": "? White should have done Re2 then Rfe1. Now black have an open line for an attack.",
        "21... Bxf5 22. Qd2 Re3": "! Not wasting time. The two bishop have the strenght to keep the pawn if white take the rook. White will have a hard time to remove that pawn out of the way and to keep his structure.",
        "23. Rxe3": "? g4 was way better.",
        "23... fxe3 24. Qe2 Re8 25. Nd1": "My bishop on f5 seems to be pinned but the knight on the f file have no good move.",
        "25... a6": "Took a lot of time to find that move, I couldn't find a better continuation than to attack on the queen side while white is struggling. The queen and the bishops have too much a dominant position to get out of these files. A better move would have been an immediate b5!",
        "26. Nh2": "?? Now black can continue to push easily. Nc3 was better.",
        "26... Qd4 27. Nf3 Qd3": "No turning back! Now black has an easy end game.",
        "28. Nc3 Qxe2 29. Nxe2 Bd3": "White cannot both defend the pawn and the knight.",
        "30. Re1 Bxc4 31. Nc3 b5 32. b3 Bd3 33. Nd1 c4 34. bxc4 Bxc4 35. Nc3 b4": "The game is over. White cannot stop both the e pawn and those on the queen side. One of my most straight forward and accurate game, strategy wise, in a blitz game."
    },
    "url": "https://gameknot.com/annotation.pl/kid-attack?gm=62610",
    "gameName": "KID attack",
    "players": "bjornjh  vs. drchopper ",
    "opening": "King's Indian (E90), Larsen variation"
}