{
    "moves": {
        "1. e4": "His opening move came as no surprise",
        "1... c5": "And my reply can't have been either.",
        "2. Nf3": "He varies from the d4 he played in the previous game.",
        "2... Nc6": "So one knight move deserves another",
        "3. d4": "All main line so far",
        "3... cxd4": "I take",
        "4. c3": "This was hardly a surprise either, he played the Smith-Morra gambit last time.",
        "4... Nf6": "So I did my usual reply. Black can accept the pawn, but this is good as well, a suggestion of Leonard Barden.",
        "5. e5": "This is the most commonly played move in the position.",
        "5... Nd5": "And this is the only decent move for black.",
        "6. Bc4": "He played this move last time, in a slightly different position.",
        "6... Nb6": "And I hit the bishop again. In the previous game, he now played Bxf7ch, but later found that he didn't have enough for the bishop, and he lost relatively quickly.",
        "7. Bb3": "But this time he played a sensible move.",
        "7... dxc3": "This move is inconsistent, and I later found out that it scores badly on the opening databases.",
        "8. Nxc3": "And this is about the only decent move for white. I thought here - well I am a pawn up, let's go for exchanges.",
        "8... d6": "Looking for exchanges on e5 if he doesn't take.",
        "9. exd6": "But he takes first.",
        "9... Qxd6": "Afterwards I found that exd6 is more commonly played, but I hoped this would lead to an exchange of queens and the chance to nurse my extra pawn to victory.",
        "10. Qxd6": "And he did take, after a long think",
        "10... exd6": "So I took back.",
        "11. Nb5": "Ouch! How am going to defend against Nc7 forking king and rook? I was also afraid of his bishop coming to f4 building up on my d6 pawn. Also my king can hardly go to d7 or the f7 pawn drops. I did afterwards find on the database a gameknot game from this position, and black finally won, after Rb8 12. Ng5 Ne5 13. f4 Nec4 whitefooted (2094) vs. yokenster (2078). However I think white can improve on this with 12. Bf4 and black looks to be in trouble. What do you think dear reader?",
        "11... Be6": "So I came to the conclusion the best bet was to sacrifice the exchange",
        "12. Nc7+": "So he checked",
        "12... Kd7": "and I moved the king",
        "13. Nxa8": "He took the rook",
        "13... Nxa8": "I took back",
        "14. O-O": "He castled",
        "14... Be7": "I developed my bishop",
        "15. Ng5": "This move does not look right to me. I think simple development, say Bf4 and moving the rooks onto the central files looks better to me.",
        "15... Bxb3": "So I stop his planned NxBe6 and double his pawns. The downside is that I open up the a file for his rook.",
        "16. axb3": "He takes back. I was dying to play Nd4 here, threatening to play Ne7ch, followed by NxBc8 and BxNg5. However White gets in first with Rxa7 followed by Rxb7ch, for instance Nd4 17. Rxa7 Ne2+ 18. Kh1 Nxc1 19. Rxb7+ Nc7 20. Rxc1 Bxg5 21. Rcxc7+  winning easily.\r\n",
        "16... h6": "So I hit his knight. There is an interesting continuation here. 17. Nxf7 Rf8 and his knight is trapped, but he has 18. Nxh6 gxh6 19. Bxh6 and he had gained 3 pawns for the knight.\r\n",
        "17. Ne4": "The knight is soon hit again on this square, so I think 17. Nf3 may have been better, although then I have Bf6 hitting his b7 pawn, making it hard for him to complete his development, but then maybe he can gambit it with 18. Bf4 and if Bxb7 he has Ra-d1 attacking my d pawn.",
        "17... d5": "I hit the knight",
        "18. Rd1": "He pins the pawn.",
        "18... Ke6": "I break the pin. King up for the ending!",
        "19. Nc3": "The knight eventually retreats.",
        "19... Rd8": "I have to protect d5 again, and this is best. If I protect it with my Na8 he can attack the knight with his bishop. I was beginning to feel a little happier with my position. If you compare it with the position after my 13th move, I have managed to bishop and rook onto better squares and double his b pawns. His rooks are more active, but he has wasted time with his knight.",
        "20. Re1+": "He checks",
        "20... Kf6": "The king moves",
        "21. Bf4": "He develops his bishop.",
        "21... d4": "I hit his knight again!",
        "22. Ne4+": "He checks",
        "22... Kf5": "King up. Now if he plays Bg3 then Bb4 looks good to me. To maintain the protection of his Ne4, 23. Re2 is forced, then d3 forces Re3 and then Nd4 looks massive to me. Nc7 is threatened and if Rxd6? loses to Ne7+. Unfortunately he probably saw all this too.....",
        "23. Bd2": "So he retreated his bishop to a better square.",
        "23... Nc7": "So finally this knight comes into play.",
        "24. b4": "He threatens b5 and if I take on b4 he wins the pawn on a7. I prevent b5, but maybe the best way of me to do this is to play b5 myself.",
        "24... a6": "So I stop b5",
        "25. Nc5": "But he has this, Maybe taking this knight was best, but instead I played ",
        "25... Rd5": "and held my breath. Now if he takes on b7, I take on b4, his knight on b7 is short of squares, I don't think I can actually win it. But luckily for me, while I was considering whether it was best to take with the knight or the bishop on b4, he played what I think is a weaker alternative for him.",
        "26. Nd3": "This protects b4 but....",
        "26... Rb5": "I can attack it again, and I have Nd5 coming in, attacking it again. He can't hold this pawn, and I think chances are equal now. Somewhere around here I offered a draw, which he turned down.",
        "27. h3": "I'm not sure this helps him much.",
        "27... Nd5": "Onwards with my plan",
        "28. g4+": "Yet another check, achieving about as much as the previous ones!",
        "28... Kf6": "In fact here I am protecting my bishop",
        "29. h4": "Hecarries on with this advance.",
        "29... Bd6": "No need to hurry to take the b pawn, it is not going anywhere. This move may prevent him from putting a piece on e5 or f4, and also in some variation he may play g5+ to devert my king from protecting my bishop.",
        "30. h5": "He continues with his plan.",
        "30... Ncxb4": "I finally take the pawn.",
        "31. Nxb4": "He takes",
        "31... Nxb4": "I take, threatening Nc2 forking his rooks.",
        "32. Bxb4": "So he takes.",
        "32... Rxb4": "I take back this way, hitting b7 and protecting d4",
        "33. Ra5": "This is a lovely move! Maybe this is what he had been planning? Can you see what he is threatening?",
        "33... g6": "He was hoping for Rf5 mate!",
        "34. hxg6": "So he takes",
        "34... fxg6": "I take back",
        "35. Rd5": "He attacks",
        "35... Bb8": "The plan with this move was Ba7 and if I can play Rxb2 I can gang up on his f2. ",
        "36. Rd8": "He hits the bishop. He was really short of time now",
        "36... Ba7": "I move the bishop",
        "37. Rf8+": "He checks",
        "37... Kg5": "King up",
        "38. Re5+": "He checks",
        "38... Kxg4": "Another pawn goes",
        "39. Kg2": "Still dreaming of weaving a mating net",
        "39... Rxb2": "This capture pins his f pawn",
        "40. Re4+": "He checks",
        "40... Kh5": "King retreats",
        "41. Re5+": "He checks again",
        "41... g5": "I block the check. I am playing for the win now! I lost track of what happened next. He played a rook to the 6th rank, threatening to double rooks on the sixth and win my h pawn. I prevented that by retreating my rook to b6 and he exchanged rooks on b6. Somehow I managed to blunder away my h, g and d pawns, but I pushed by b pawn to b2. My king was on f8, his pawn on f6 and he played Kg6?? thinking I couldn't queen as he was threatening mate. However I played b8=Q CHECK. Shortly afterwards I noticed he had lost on time, but he was a queen down anyway at that stage. So many thanks reading this, please leave a comment or two, and please rate this on the star system. "
    },
    "url": "https://gameknot.com/annotation.pl/kidderminster-club-championship?gm=44259",
    "gameName": "Kidderminster Club Championship",
    "players": "Promising youngster  vs. Charles Higgie ",
    "opening": "Sicilian (B32), Flohr variation"
}