{
    "moves": {
        "1. e4": "So he starts with the most popular",
        "1... c5": "and I reply with my normal",
        "2. Nc3": "In this case leading to a closed variation of the Sicilian, although sometimes White follows up with Nf3 or Ne2 and following it up with d4, going back into the Open Sicilian",
        "2... Nc6": "So I keep my options open",
        "3. g3": "and he confirms a closed Sicilian. An immediate 2. g3 is best met with d5, so 2. Nc3 prevent this",
        "3... g6": "So I can play this without any fear of him transposing into the Yugoslav attack against the Sicilian Dragon",
        "4. Bg2": "The natural follow up",
        "4... Bg7": "and I do likewise",
        "5. d3": "He develops again",
        "5... e6": "This is my usual in this variation, planning Ng-e7 and d5, as opposed to the usual plan of playing for b5",
        "6. Be3": "He hits the c pawn",
        "6... b6": "In line with my plan. I was thinking that d5 will now threaten d4 forking Be3 and Nc3. After the game Stuart said that he had had this position before, and black had then played d6, and he had continued as in the game.",
        "7. Qd2": "Going for a king side attack.",
        "7... Nge7": "So I continue to develop",
        "8. Bh6": "He plays very agressively",
        "8... O-O": "Calmly castling!",
        "9. h4": "On this the attack. He is already threatening h5, exchanging on g6, exchanging on g7 and Qh6 followed by mate on h7, but there are defences.",
        "9... Bxh6": "So I take",
        "10. Qxh6": "He takes back",
        "10... f6": "Now h5 can be met with g5 and his queen is in risk. I also have the option of Rf7 protecting h7. Also I have a long term plan - now that black squared bishops are exchanged, put all my pawns on white squares and then my bishop can weave in and out of them. Afterwards I found out that this was played in Perez Garcia, H… (2255) vs. Lemmers, Oscar (2385), black won in 61 moves.",
        "11. Qd2": "He decides the queen isn't doing much there",
        "11... e5": "So I continue with my plan",
        "12. f4": "Another agressive move",
        "12... d6": "and I carry on with my plan.",
        "13. h5": "Shredder assesses this position as +1.14 to white. Maybe my plan of putting pawns on black squares was too slow. Maybe I should have stayed with my plan of d5. What do you think dear reader?",
        "13... Bg4": "With the idea of blocking the h file and also preventing him from castling. I was still reasonably confident.",
        "14. hxg6": "Of course, if he had taken on e5, I would have taken on h5",
        "14... hxg6": "Keeping my pawns together",
        "15. Nd5": "Shredder thinks this is a mistake, letting me back into the game, and prefers f5 or Bf3. Shredder says the position is now level",
        "15... Nxd5": "Shredder likes this move",
        "16. exd5": "He takes back",
        "16... Ne7": "Shredder prefers Nd4 with equality, but I thought it may have good defence choices here, plus the chance to go to f5 and maybe take on g3.",
        "17. fxe5": "Shredder now gives this as +1.9 for white \"who has the upper hand",
        "17... fxe5": "Shredder likes this move, but during the game I was considering 17.... Nf5, and after the game we both thought maybe black should offer the exchange for a pawn with 17......dxe5 18. d6 Qxd6 19. Bxh8 ",
        "18. Qh6": "Shredder now thinks that white has a decisive advantage, after the game, Stuart said the same.....",
        "18... Kf7": "More or less forced",
        "19. Qg5": "and this was the subtle little move that I missed, which wins....",
        "19... Qd7": "Nothing better really. Immediately I played it, I saw the combination which he plays now, winning knight and bishop for rook. Shredder actually prefers Rh4 here \"and white is +2.93",
        "20. Rh7+": "Whereas now Shredder thinks that white is \"only\" +1.99",
        "20... Ke8": "Forced, otherwise I lose a whole knight",
        "21. Rxe7+": "He takes",
        "21... Qxe7": "I take back",
        "22. Qxg4": "He takes the bishop",
        "22... Kd8": "I offer the g pawn, in order to move my king to safety. Shredder agrees this is the best chance",
        "23. O-O-O": "He castles",
        "23... Kc7": "I finally connect my rooks, and, I thought, got my king to a safe spot. Shredder prefers Rf2",
        "24. Nf3": "He develops, with a threat of N-g5-e6",
        "24... Rf5": "So I stop that",
        "25. Qa4": "I hadn't seen this move. Now Qc6+ is crushing",
        "25... Qd7": "So I prevent that",
        "26. Qxd7+": "He takes",
        "26... Kxd7": "I take back",
        "27. Bh3": "And he wins the exchange, to leave himself a clear knight up, so I resigned. Many thanks for reading this, please leave a comment, and rate it with stars. Merry Christmas and Happy New Year!"
    },
    "url": "https://gameknot.com/annotation.pl/kidderminstervhalesowenbd1?gm=42465",
    "gameName": "KidderminstervHalesOwenBd1",
    "players": "Stuart Fishburne (BCF184) vs. Charles Higgie (BCF158)",
    "opening": "Sicilian (B24), closed, Smyslov variation"
}