{
    "moves": {
        "1. c4": "Ah the English. An opening that I am not all that accustomed to, so I was already feeling uncomfortable from the start. ",
        "1... c5": "e5 and Nf6 are equally good alternatives. I chose the symmetrical English because I felt it would lead to a simpler position out of the opening.",
        "2. Nc3 Nc6 3. g3 e6": "!? The main line of the Symmetrical English is g6. My objective was to strike out at the center with d5 at some point.",
        "4. Bg2 Nf6 5. Nf3 d5 6. cxd5": "White does not want to allow black to play d4 which will force white's knight to retreat back to b1.",
        "6... exd5": "?! Surely Nxd5 was best. The d5 pawn will soon become a big target.",
        "7. d4": "This is why exd5 was not so good. This move threatens dxc5, which will create an isolated d5 pawn and open the d file for the queen.",
        "7... Be6": "This move seems ok to me as it develops a piece and supports d5. Be7 was likely best, however because it sets up castling the next move.",
        "8. O-O Be7 9. dxc5": "Opening the d file for the queen.",
        "9... Bxc5 10. Bg5": "This is a powerful pin because it is attempting to remove a defender from d5. White is now threatening after 10...O-O 11 Bxf6 Qxf6 12 Nxd5 Qxb2 13 Nc7 Rc8 14 Nxe6 fxe6. I rejected allowing white to play this line in the game even though this was probably best because the e6 pawn would be tough to defend.",
        "10... Be7": "?! Waste of time. I was too concerned about the pin. O-O was called for in this position.",
        "11. Nd4": "Good move. White is aiming to play Nxe6, which will set up some king side attacks for white.",
        "11... O-O": "I can not play 11...Nxd4? 12 Qxd4 O-O 13 Rfd1, and white will capture the d5 pawn.",
        "12. Nxe6 fxe6 13. e4": "! My first instinct was that this was an inaccuracy. I calculated 13...Nxe4 14 Bxe7 Qxe7 15. Nxe4 dxe4 16. Bxe4 Rad8 gave me a small edge. However, white had a better idea....",
        "13... Nxe4 14. Nxe4": "! I had certainly not expected this. I began to think, and saw that after Bxg5 that the knight could hop over to c5 and fork my pawns. I quickly wrote that off though because if 15 Nc5 Qe7 protected everything... or so I thought.",
        "14... Bxg5": "So I was confident that I was now up a pawn and that I had fair chances against Ipatov.",
        "15. Nc5": "Expected. White now has a good advantage because it will be difficult for black to properly defend the e6 pawn.",
        "15... Qe7": "? I had moved almost immediately because I thought that this was the best way to protect both b7 and e6. I missed a nice tactical shot though that loses 2 pawns. Best would have been Rf6. White could not immediately play Nxb7? after this because Qe7 traps the knight. ",
        "16. Nxe6": "! Taking advantage of a pin. If Qxe6?? then Bxd5 pins the queen to the king. There is no way for me to defend both the d5 pawn and the rook on f8.",
        "16... Rf5": "It was either this or Re8. I preferred this because I wanted to drive out the bishop quickly from d5.",
        "17. Bxd5 Qd6": "? Not sure what I was thinking here. Kh8 was necessary to avoid any dangerous discovered checks like Nc7+ which wins the exchange for white. I was probably too anxious to get rid of the bishop. ",
        "18. Bb3": "? But Ipatov misses it!! It appears white might have been thinking that I was now forced to exchange queens or else white would simply play Nxg5+, winning the bishop.",
        "18... Qxd1 19. Raxd1 Kh8": "Forced in order to keep a piece or lose an exchange.",
        "20. Nxg5": "Hmm I am not a big fan of this move. I can understand the concept of exchanging pieces when ahead in material but white could have simply won another pawn with Rd7 if I am not mistaken.",
        "20... Rxg5 21. Rd7": "Should have been played last move.",
        "21... Rb8": "?! b6 was best I think so that the rook can do something better than guarding the b pawn.",
        "22. Re1": "? White's goal was to try to get connected rooks on the 7th rank. This actually turns out to make material even again.",
        "22... Ne5": "Threatening both rooks!",
        "23. f4": "Forced if white wished to avoid losing the exchange.",
        "23... Nxd7": "? The only excuse I have was that I was running low on time (I had about 5 minutes remaining). I could still not believe I had overlooked the obvious in-between move - Rxg3+ followed by Nxd7 with good drawing chances.",
        "24. fxg5 Nc5 25. Bf7": "I am skeptical of this move. My idea was that Ipatov was trying to exchange rooks with Re8+. However, with white having doubled pawns it might not be too difficult to get a draw if that was the case. Maybe white wanted to try g6 in an attempt to un-double his pawns.",
        "25... Nd3": "!? Perhaps g6 with the intentions of getting the king off the back rank was a better plan.",
        "26. Re2 g6 27. Bc4 Nc5 28. Re7": "Taking control of the back rank and also threatening b4 which would force the knight on the rim.",
        "28... Rd8": "?? The decisive mistake. a4 was required to prevent b4. Now white wins both the a pawn and the b pawn, which will give white an easily winning endgame. ",
        "29. b4": "If I play Nd7 then Bb5 would kick the knight regardless.",
        "29... Na4": "The knight probably has better prospects on c3.",
        "30. Bb3": "?! Why not just take the pawn? I wanted to move the knight to c3 anyway. Perhaps white was concerned with Rd1+ but I could not move the rook off the back rank because of the threat of Re8+ Kg7 then Rg8#",
        "30... Nc3 31. Rxb7 Ne2+": "?! Not best but it does not really matter at this point. Perhaps Ne4 was worth a shot.",
        "32. Kf2 Nd4 33. Rxa7 Nxb3 34. axb3": "White is up by 3 pawns. My only hope is that white's doubled pawns will make it slightly easier for me to defend.",
        "34... Rd3": "Rb8 was best because it would have forced the rook to a4 to keep the pawn. In that line the white king could run over to the queenside to protect the pawns and help push them to promotion.",
        "35. b5": "White did not want to waste his time defending an immobile b pawn, white is going for the win.",
        "35... Rxb3 36. Rb7 Kg8": "All white has to do now is get the king to the queenside and support the b pawn.",
        "37. b6 Kf8 38. Rb8+ Ke7 39. b7 Kd7": "Kd6 may have been a better alternative, but really it would just make the game last longer. 39...Kd6 40 Rh8 Kxb7 41 Rxh7+. Then white can push his king side pawns, and the outcome will be the same.",
        "40. Rh8 Rxb7": "This finishes the game quickly (it is not like I had any better move). Now white will force a rook exchange and simply push his pawns.",
        "41. Rxh7+ Kc6 42. Rxb7 Kxb7 43. h4 Kc7 44. h5": "I resigned. It was a great experience to play against a GM. Both sides had made their fair share of mistakes, but of course Ipatov took much better advantage of my mistakes than I did his!"
    },
    "url": "https://gameknot.com/annotation.pl/killed-by-the-english?gm=51197",
    "gameName": "Killed by the English",
    "players": "Alexander Ipatov (2583) vs. ben13 (1837)",
    "opening": "English (A36), symmetrical variation"
}