{
    "moves": {
        "1. d4": "I chose the quieter Queen pawn opening to steer the game into quieter lines. In so doing I am trading quick attacking chances for long term gains. Queen pawn games develop quietly and are more positional by nature. Thus, you will not see quick opening mates very often. ",
        "1... Nf6 2. c4 g6 3. g3 Bg7": "The kings indian is a very flexible openning system. GMs often use it to steer way from varations that they do not wish to play.",
        "4. Bg2": "fianchettoing this bishop is not my style. I prefer to develop it to Nc3 or c4. I am  a very positional player, I naturally play moves that optimize the potential of my pieces.",
        "4... d5 5. cxd5": "In the style of Petrosain I opt to release the tension in the centre immedaitely. ",
        "5... Nxd5 6. Nf3": "I decide to play queitly and opted out of e4 because my centre would be hard to defend. Nc3 is also playable. ",
        "6... O-O 7. Nc3": "In a resent game I had a opponent try Nxc3. I achieved a huge central pawn phalanx's and when on to win easily.\r\n\r\nhttp://gameknot.com/annotation.pl?gm=10358",
        "7... c5": "An ambitous move that strikes immedaitely at white's centre. This move is in the spirit of the Neo-grunfeld defence.",
        "8. Nxd5": "This removes black's advanced knight.",
        "8... Qxd5 9. O-O": "Black has a slight edge in the centre. ",
        "9... cxd4": "This is a very imposing pawn. ",
        "10. Be3": "Aiming to get rid of the pawn. ",
        "10... Qh5": "This is a bit odd. The queen does not exert much influence from here. Besides black gives back the pawn for nothing in return.",
        "11. Nxd4": "regaining the pawn with a temperary plus in position. ",
        "11... e5": "Ok I will move!",
        "12. Nb5": "This forces black a bit. ",
        "12... Nc6 13. Bxc6": "getting rid of my nice fianchetto bishop was not an easy decision but I have seen that this isolates C pawn(which black will have to contently defend) and makes advancing my queen pawns easier in the endgame. This move may have suprised Mercutio abit. ",
        "13... bxc6": "We are now entering the second phase of my overall game plan. Which is to create a pawn majority on the queen-side. I do this at the expense of creating a permanate weakness on the light squares. ",
        "14. Nxa7": "going up a pawn and decimating blacks queen-side. ",
        "14... Ba6": "Attacking whites weak e2 pawn",
        "15. Re1": "defends against the e2 threat. White can also try Qc2",
        "15... e4": "This clears the lines for black fianchettoed bishop  and creates a light square weakness around the king. This pawn becomes a monster. ",
        "16. Nxc6": "White is clearly better. My objective for phase two is now complete. Now that I have a clear material advantage I head for the touch down, by exchanging the remaining pieces. By exchanging my remaining piece for their black counterpart my pawn majority on the queenside become increasingly more powerful.",
        "16... Rfe8": "Black does not like the look of 17. Ne7  Kh8 18. Bd4 when white's advantage is clear. ",
        "17. Bd4": "This is an error. I was looking to forces black to give up the diagonal but I failed to see blacks next move.",
        "17... e3": "Excellent move that in my haste I totally missed. This move completely busts open my king and leaves it exposed. This also creates a weakness for black to exploit. This pawn has had an amazing career",
        "18. fxe3": "an eye score in an otherwise terrific position. ",
        "18... Bb7": "With the f pawn diverted to e3 the a8-h8 diagonal causes white a few problems. ",
        "19. Rc1 Rac8 20. Bxg7": "ensuring that I have the bishop in the endgame. I can not allow black to have the bishop pair. ",
        "20... Bxc6 21. Qd4": "I give black back the bishop to ensure that it is me who has the bishop in the endgame. ",
        "21... Qh3": "threatening mate so white is forced to give back the bishop",
        "22. Rxc6 Rxc6": "At this point, white enjoys a slight advantage in space, material and two connected pawns. White is winning but it will be difficult to convert the past pawns for the win. ",
        "23. Qd5 Qe6": "Black seeks to go straight into the endgame and try his luck there. However, the exchange of queens makes my connected queen side pawns very dangerous. Better in my opinion is Qc8. However, given the fact that Mercutio sees that he is almost 400 points stronger than me he takes his chances in the end game. But one of the strongest parts of my game is the endgame. Also in my favor is that I have a clear plan for victory. ",
        "24. Qxe6 Rcxe6": "White is clearly better. The endgame is an simple win. ",
        "25. Bd4 Ra8": "Because white has the strong bishop and two connected past pawns black does not stand a chance. All he can hope for is a draw. ",
        "26. Ra1": "White is clearly better now. The queenside pawns are major advantage. ",
        "26... f6": "Mercutio has major problems on the queenside. He does not have time to play passive moves like this one. ",
        "27. a4": "because of Mercutio's timid play I take advantage by taking a giant leap toward queening. ",
        "27... Rea6 28. b3 Rb8 29. Ra3 Kf7 30. Kf2": "centralizing your king in the end game is very important. ",
        "30... Ke6": "In the end game it is critical to centralize your king as soon as you can. ",
        "31. e4": "this prevents black from seizing control of the centre with his king.",
        "31... Rc6 32. a5": "Inching closer to queening. This move also keeps black's rooks in check.",
        "32... Ra6": "Black is completely tied down to defence white can slowly convert his advantage at his leisure",
        "33. Bc5": "preparing for b4 and denying the use of the c file for black.",
        "33... Kd7 34. b4": "white's rook is now free from defending the A pawn.",
        "34... Kc6": "Mercutio's king is going to a walk around the queenside but there is nothing he can do. The pawns are very secure. ",
        "35. Rf3": "The reason why I played this move over Ke3 is that I see that my rook will effect the most influence over the board from this file. If I had played Ke3 my rook would be locked behind my king. \r\n\r\nI have been studying FWC Petrosain's games and one thing I have been learning is to play moves that maximize the potential of your pieces. In three moves I will have complete domination over the board. My pieces will be well centralized and operating at their peak potential. ",
        "35... Kb5 36. e5": "this cleans up my pawn structure as well as creates a third past pawn",
        "36... fxe5 37. Rf7": "winning back the pawn. ",
        "37... h6 38. Re7 Rf8+ 39. Ke3": "I will create another past pawn and black can not defend against them both. ",
        "39... Rff6 40. Rxe5": "The centre is mine all mine!",
        "40... Kc4": "Mercutio does not like the idea of my King on d4",
        "41. Re4+": "I know have three pawns in the clear, but black still has some fight left. ",
        "41... Kb5 42. Kd3 Rf1": "Black is putting up a stiff defence but he will eventaully run himself out of useful moves. My game plan now is to win control over the 5th rank. ",
        "43. Re5 Rd1+ 44. Kc2 Rf1 45. Kc3 Ka4 46. h4 Rc1+ 47. Kd3 Kb3 48. Kd4 Rd1+": "black can not allow the white king to walk on to the 5th rank. ",
        "49. Ke3 Rd7 50. Re4 Ka4 51. Re8 Rd5 52. Kf4": "This move threatens to break the  5th rank barrier with via Re5",
        "52... Rf6+ 53. Ke4 Rd2 54. Ke3 Rd1 55. g4": "very slowly I am increasing my control over the 5th rank. ",
        "55... Rg1 56. Re4": "defending g4.",
        "56... Kb5 57. Re5": "In order to win this game I must play to force the off the board black's rooks. ",
        "57... Ra6 58. Bf8+": "chipping at black's defensive capablities. By removing the h pawn black is completely reduced to passive play. ",
        "58... Ka4 59. Re4 Rh1 60. Bxh6 Rxh4 61. Bf8 Rh1 62. Kd4": "Yay! I finally break into the fifth rank. Now my king can eventually support my pawns to the end. ",
        "62... Rf1 63. Be7": "my bishop is totally dominating the rooks. ",
        "63... Rd1+ 64. Ke5": "the invisable barrier on the 5th rank has finally been broken. White's victory is ensured now.",
        "64... Rd7 65. Kf4": "leaving the bishop on d7 cuts black off from the king side. ",
        "65... Rd5": "this attempt to prevent Kg5 but there is nothing black can do stop it.",
        "66. Re5": "The exchange would make life easy for white.",
        "66... Rd7 67. Bc5 Rc7 68. Rd5": "preparing to advance the e pawn.",
        "68... Rf6+ 69. Ke5": "and black resigns."
    },
    "url": "https://gameknot.com/annotation.pl/kings-indian-fianchetto?gm=11393",
    "gameName": "King's Indian Fianchetto",
    "players": "elyhim (1835) vs. mercutio (2133)",
    "opening": "King's Indian (E60), 3.g3, counterthrust variation"
}