{
    "moves": {
        "1. e4 e5 2. f4 exf4": "This game came out of a thematic mini-tournament. King's Gambit Accepted was the starting ground for all games. It leads to rather sharp and chaotic positions, which I tend to love.\r\n",
        "3. Nf3 g5 4. Bc4 g4": "Nothing out of the ordinary here.\r\n",
        "5. Bxf7+": "This startled me. I had just come out of a draw with the player after a VERY strenuous match, so I knew he was competent. After a short time I saw the threat, and was almost on the verge of resigning. Because...",
        "5... Kxf7 6. Ne5+ Ke8": "What now? I'm a piece ahead, but as long as he keeps throttling at my kingside, mate is an inevitability. Truth be told, defense is not exactly my strongest point, and I did not see how I could possibly turn this around. Still, I played on, curious to see how the line would develop.",
        "7. O-O": "Now those pawns on f4 and g4 look silly.",
        "7... d6": "There's no saving the g4 pawn, but I can open a few lines here.",
        "8. Nxg4 Qg5 9. h3 Nh6": "I typically hate putting Knights on the edge of the board, but I needed my Bishop to cover it instead of relying upon my Queen. Tempi were all-important here, and I couldn't afford to squander any.",
        "10. Nxh6 Bxh6 11. Qf3 Rf8": "I knew the f-pawn would be vital, so I began to protect it and focus on the f-file. Though my queen is still entirely exposed, the opponent is rather underdeveloped, and his earlier Castling move now allows me a few opportunities to cramp his king.",
        "12. d4": "Preparing to put a cramp on my Queenside, and opening up another attacker on the f-pawn.",
        "12... Qg7": "Otherwise, Black loses the pawn on f4.",
        "13. d5": "Restricting c6 for the Knight, and keeping my Bishop largely at bay.",
        "13... Nd7 14. Nc3 Ne5": "I always feel a little silly making two Knight-Moves to attack a Queen, but here it made sense.",
        "15. Qh5+ Kd8 16. Ne2 f3": "! Offers an exchange (favorable for Black, as he is ahead on material), threatens mate on g2 (Qxg2#), and destroys communication between White's pieces.",
        "17. Ng3 Bxc1 18. Raxc1 Qxg3": "Otherwise, the f-pawn is lost.",
        "19. Rf2": "Really, the only saving move.",
        "19... Qg6": "Encouraging the Queen exchange.",
        "20. Qxg6": "20. Qh4  is no real threat. White realizes this, and accepts the exchange.",
        "20... hxg6": "And here White resigned, down on material and without a positional advantage to justify further play. Black, with a series of counter-attacks and well-placed pieces, managed to stop White's assault."
    },
    "url": "https://gameknot.com/annotation.pl/kings-gambit?gm=11369",
    "gameName": "King's Gambit",
    "players": "idldice81 (1445) vs. cmberman (1382)",
    "opening": "KGA (C37), Lolli gambit, Young variation"
}