{
    "moves": {
        "1. e4 e5 2. f4 exf4": "I've lost a lot of games against this gambit, though mostly on blitz, to the point where I'm wary of accepting it. But more recently wins have encouraged me, so...",
        "3. Nf3": "Allowing 3...Qh4+ is playable, apparently, but I doubt many players with the White pieces would fancy it!",
        "3... d6": "Fischer's 'bust to the King's gambit' started with this, and though it's arguably an improvement on the immediate 3...g5 to support the pawn because it stops the Knight going to e5 it's hardly busting the gambit alone; there's a long way to go.",
        "4. h3": "Preventing the pin, but White needs to be quite aggressive now, having given up a pawn, with something like 4.Bc4 attacking the f7 pawn (the point of giving up the f-pawn after all) or 4.d4, pretty much forcing 4...g5 if Black wants to keep the pawn.",
        "4... g5": "White's last, rather passive move, gives Black the option to play 4...Nf6 and start developing, but I'm rather stuck in the usual mindset and play the usual move, defending my won pawn.",
        "5. Bc4": "Starting his attack on f7.",
        "5... Bg7": "Since I've played the g-pawn out, it seems logical to follow up with this.",
        "6. c3": "Far too slow. White can play 6.d4 right away; there's really no need for this prepatory move, which just seems to hand Black a tempo.",
        "6... Nc6": "Had White played 6.d4 on his last move he could have played 7.Nc3 now, with quite an intimidating centre. But c3 is occupied...",
        "7. d4": "At least he gets his central pawns in place.",
        "7... Qe7": "Attacking the undefended e-pawn and preparing to castle Q-side once the Bishop is out.",
        "8. O-O": "White adds to the indirect pressure on f7, and now taking the e-pawn is disatrous due to 8...Qxe4 9.Re1 and the Queen is pinned.",
        "8... Bd7": "The only square for my Bishop to land safely, but that's okay.",
        "9. b4": "Suddenly I don't fancy castling Q-side! It's still quite possible, for if after 9...O-O-O 10.b5 then 10...Na5 drives the Bishop away from its diagonal against f7. But I didn't think of that and still don't like it.",
        "9... a6": "Instead I try to prevent the b-pawn's advance first.",
        "10. a4": "White is making castling Q-side look precarious, though perhaps starting to develop his Q-side pieces might have been a better plan. 10.Na3 supports the b5 square without the risk of opening the a-file.",
        "10... h5": "Still, he's done enough to put me off Q-side castling, and I start to advance on the opposite wing instead. Now White makes a rather surprising gamble....",
        "11. Nxg5": "Giving up a piece with only one other piece developed is a risky strategy, but he's continuing with the basic King's gambit plan of hitting f7. A shame, really, as 11.e5 dxe5 12.Ba3 tips the balance White's way. I should have got my King away from the centre earlier, but fortunately I get away with it.",
        "11... Qxg5 12. Bxf4": "White's attack does look intimidating, even though he's given up some material to get it. And the Black Queen doesn't have too many escape squares.",
        "12... Qg6": "I decide this is the best one, since it's lining up against the King and 13...Bxh3 is potentially a killer.",
        "13. Qf3": "Guarding the h-pawn but more importantly lining up yet another piece against f7. 13.Kh1 would have been a good, if less glamourous option. But this opening is about attack, after all!",
        "13... Nf6": "I pondered on a few moves here, and decided on this as it gives me the option of castling K-side, blocks the Queen's line to f7 and gets out my final piece. 13...Be6 does the job of protecting f7 better though.",
        "14. e5": "Now White mis-steps, keen on opening central files before he's quite ready to use them. 14.Bd3 first would have made the threat of this pawn advance more dangerous. And 14.Nbd2 gets out the final piece and unties the Rooks so the Rook on a1 can come to the centre.",
        "14... dxe5 15. dxe5 Ne4": "It didn't even occur to me that giving back the material with 15...Ng4 16.hxg4 hxg4 17.Qg3 O-O-O gives me a better position; the Knight seemed safer here, protected by the Queen.",
        "16. Re1": "However, it's difficult to defend, and White seizes the initiative.",
        "16... Bf5": "Defending the Knight once...",
        "17. Bd5": "Only to see it attacked again. Time to liquidate the position with 17...O-O-O 18.Bxe4 Bxe4 19.Rxe4 Rd1+ 20.Qxd1 Qxe4, but I quite missed that 19...Rd1 was possible and decided to get my Knight out of its hole.",
        "17... Ng5": "Revealing a horrible diagonal towards c6, b7 and my Rook. It was starting to look like White might get the upper hand now.",
        "18. Bxg5 Qxg5 19. Bxf7+": "Instead he goes for that f7 point he's been building up against all the way through the game, effectively handing me a win if I play properly. And this when the expected 19.Bxc6 bxc6 20.Qxc6+ Ke7 21.Qc5+ and there's probably a draw by repetition.",
        "19... Kxf7 20. e6+ Ke7": "That pawn is going nowhere. Maybe a check with the Queen on d5 would have been slightly more effective, but my material advantage is now such I have to blunder to lose this.",
        "21. Ra2": "Had that Knight moved to d2 when it had ample opportunity White wouldn't have to make this rather convoluted move.",
        "21... Be5": "Cutting off support for the pawn.",
        "22. Rae2": "White builds up against the King.",
        "22... Bxe6": "Now the pawn falls, though I have opened the file for the Rooks, which was, in retrospect, not clever.",
        "23. b5": "White can shift one of the defenders of the Bishop that's in the line of fire now.",
        "23... Raf8": "I should of course have done this earlier.",
        "24. Qd3": "Better on e3 to keep up the pressure a little, but I feel I'm still on top even then.",
        "24... Bf5": "On d3 the Queen can be attacked again. However, the Queen can go to e3 now and I lose material. Probably not enough to win, the Knight will fall.",
        "25. Re2xe5+": "Instead White opens up an attack, possibly forgetting that the Rook can be captured by the Knight, which has had a lucky escape!",
        "25... Nxe5 26. Rxe5+ Kf6 27. Qd4": "The threat of a discovered check is easiliy dealt with...",
        "27... Rfd8 28. Rxf5+": "And as White's material dwindles so do his chances.",
        "28... Kxf5 29. Qc5+": "Now he has just the Queen and Knight to chase my King around, hoping to get a position where perpetual checks are viable.",
        "29... Kg6 30. Qxc7": "It's at this point that computer analyses go awry, since the suggested best move 30.Qxg5+ means White has no hope of perpetual check.",
        "30... axb5": "I didn't like the look of those pawns with the Queen in attendance, even though the Knight is there for the taking.",
        "31. Na3": "It escapes!",
        "31... Qd5": "31...Qc1+ wins the Knight, but I spend the next few moves trying to set up a forced Queen exchange while also avoiding White's checks.",
        "32. Nxb5": "A pawn falls and the Knight is able to be nuisance value, since it guards d6 where I was hoping my Queen might land at some point.",
        "32... Rdc8": "Harrassing. I really have to blunder badly to lose this, and White is heavily outnumbered, but he has still proved remarkably persistent for some time.",
        "33. Qg3+ Kh7": "Now he's running out of checks though.",
        "34. Nd4 Rhg8": "And I can line my material up against the King.",
        "35. Qd3+ Rg6 36. Qe2 Rcg8": "Actually, taking the pawn on c3 is a quicker route to mate. But not being a computer I do what seems the more logical approach!",
        "37. Nf3 Qc5+ 38. Nd4 Qg5": "Now there is no escape. I've missed a couple of forced mates and it did strike me that just giving up the Rooks for the Queen would leave me with an easy ending. But White's persistent escapes were driving me a little nuts.",
        "39. Qe7+": "So nuts, in fact, that I quite miss the en-prise Queen!",
        "39... Rg8g7 40. Qe2 Qc1+": "White resigned here, after escaping a few forced mates that I quite missed, and proving that the King's gambit can still pack a punch. Even though I won I felt in peril for much of the middle game, and White certainly missed a drawing chance."
    },
    "url": "https://gameknot.com/annotation.pl/kings-gambit-accepted?gm=66207",
    "gameName": "King's gambit accepted",
    "players": "merapi (1670) vs. feathered_tiger (1845)",
    "opening": "KGA (C34), Fischer defence"
}