{
    "moves": {
        "1. e4": "Standard opening.",
        "1... e6": "French defense",
        "2. Nf3": "Nf3. Not the most common move, but still pretty good. More usual would be d4.",
        "2... c5": "c5. A push for space, as in the Sicilian Defense. The c5 pawn lets the Q come to b6, and the N can slot in behind the pawn at c6.",
        "3. d4": "d4. This move is ultimately going to get the Q out early, or move the N twice, but is a good push for space.",
        "3... cxd4": "cxd4 - after a recapture, Black can develop while attacking.",
        "4. Nxd4": "Nxd5 - moving the N twice.",
        "4... Bc5": "Bc5 - Attacking the N, and developing the B.",
        "5. Nf3": "Nf3 - third N move. May have been better to play something like Nc3 instead.",
        "5... Qb6": "Qb6 - attacking f2, and, if the B on c1 is moved, b2. Aggressive.",
        "6. Qd2": "Qd2. This blocks in the B, but defends the pawn.",
        "6... Nf6": "Nf6. Develop again, and attack again.",
        "7. Bd3": "Bd3, developing and defending.",
        "7... Nc6": "Another development move.",
        "8. O-O": "Castling - another development.",
        "8... Ng4": "Ng4, very aggressive. There is not actually a threat as yet.",
        "9. b4": "b4? pawn sacrifice. This was not needed, although it was probably an attempt to divert attention from f2.",
        "9... Nxb4": "Capture, and bring the other N into the attack.",
        "10. h3": "h3 - trying to take pressure off.",
        "10... Nxd3": "This was in hope that he would take with the Q. Also, it swapped off (which when winning is usually a good idea.",
        "11. Qxd3": "Qxd3?? pxd3 or even hxg4 would be better.",
        "11... Nxf2": "Nxf2 - the N is in the heart of the defense.",
        "12. Qe2": "Qe2 - as it was attacked.",
        "12... Nxe4+": "Nxe4 . Discovered check, winning the pawn and also allowing the N to move to better squares later.",
        "13. Kh2": "Kh2. Only move.",
        "13... Bd6+": "Bd6 ; Qd6  was probably better, as it could then come in at g3.",
        "14. g3": "g3 - to prevent the loss of a Q.",
        "14... Nxg3": "Nxg3, a fork, and later a discovered check.",
        "15. Qd3": "The Q was attacked.",
        "15... Nxf1+": "Nxf1  . Double check; the king must move.",
        "16. Kh1": "Kh1. Kg2 may have been better, as it stops the Q coming in.",
        "16... Qf2": "Qf2! Threatening mate in 1, and with a good attack.",
        "17. Be3": "This did nothing. The best line was Qxd6, Ng3 , Qxg3, Qxg3. Black has won by this point.",
        "17... Ng3#": "A quick end to the attack. Checkmate."
    },
    "url": "https://gameknot.com/annotation.pl/kingside-attack?gm=7205",
    "gameName": "Kingside attack!",
    "players": "swampy999 (1279) vs. casmith_789 (1605)",
    "opening": "French defence (C00)"
}