{
    "moves": {
        "1. Nf3": "Hi everyone!\n\nWell, now that I have got my first ever Expert Victory out of the way I have another little gem for you against a near-Expert called myrydin (Tim).  Despite a queenless middlegame a player whose king is stuck in the centre is gonna cop a little trouble.  In order to find out whether it is King Henry or his Welsh counterpart King Myrydin that comes to grief you will just need to read on.  I begin with Nf3 which is the Reti Opening.  GA analysis is here: https://gameknot.com/analyze-board.pl?bd=27211149&rnd=0.27808322082055636\n",
        "1... Nf6 2. c4 e6": "2. …… e6 - transposing into an English Opening.",
        "3. d4 d5 4. e3 Nc6 5. Bd3": "5. Bd3 - after a few pawn moves on both sides I finally clear the way for kingside castling.",
        "5... dxc4 6. Bxc4 Bd6 7. Nc3 Bd7 8. O-O Na5": "8. ….. Na5 - instead of castling black decided to harass Fou Leblanc.",
        "9. Be2 a6 10. Bd2 b5": "10. …...b5 - pawn roll.",
        "11. a3 Nb7 12. e4": "12. e4 - pawn break threatening a pawn fork on e5.",
        "12... Be7 13. Re1 h6 14. Bd3 c5 15. d5 c4 16. dxe6 Bxe6": "16. ….. Bxe6 - pawn trade.",
        "17. Bc2 Qc7 18. Ne2 Bg4 19. Ned4": "19. Ned4 - Sir Lollabout temporarily allows a pin on f3 but this will not last.",
        "19... Rd8 20. Qc1 Bxf3 21. Nxf3": "21. Nxf3 - B for N trade.",
        "21... Bc5 22. e5": "22. e5 - King Myrydin has let himself be stuck in the centre and a pawn thrust exploits it.  This will set of a chain of events that will win an important pawn.",
        "22... Ng4 23. Re2": "23. Re2 - first the pinned f2 pawn must be guarded.",
        "23... Qb6 24. Be1": "24. Be1 - uh oh, the familiar Jo Stevens passivits appears to set in ……..",
        "24... h5 25. Qg5": "25. Qg5 - But Glenda ensures that appearances are deceptive and she is eyeing up Tim's pawn on g7.",
        "25... Qh6 26. Qxh6 Nxh6": "26. ….. Nxh6.",
        "27. Bc3": "27. Bc3 - putting pressure on g7.",
        "27... Be7 28. e6": "28. e6 - threatening a bishop fork on g7.",
        "28... f6": "29. Bg6+ - black's last move prevented that fork but allowed another.  Tim's h5 pawn is hanging.",
        "29. Bg6+ Kf8 30. Bxh5 Rd5 31. Bg6": "31. Bg6 - Fou Leblanc keeps King Myrydin stranded on the back row and locks in his king rook.",
        "31... Nc5 32. Nd4": "32. Nd4 - Sir Lollabout supports my vital e6 passer.",
        "32... Rg5 33. Bc2 Ng4 34. h3 Rgh5": "34. ….. Rgh5 - he lays a trap but I see that Henry will cop Old Matey on h1 if I take his g4 knight. I must be patient, very patient.",
        "35. Nc6 Nb3 36. Rd1": "36. Rd1 - threatening mayhem along the d file.  Tim decides to wave the white flag at this juncture.  GA confirms resignation on the grounds of ruinous loss of material as I have a plus score of 6.48.  A fascinating example of how an uncastled king can be in danger even when the queens have been exchange and on Move 36!  I hope you have had a good read and another example of a king being caught in the centre will occur in my Jo against The Titans game against Coach Ion.  It is Henry but against a player of Expert/Master strength such as Ion, will it be a recipe for disaster?  Well, wait and see.  Till next time, bye for now - Joanne"
    },
    "url": "https://gameknot.com/annotation.pl/king-in-the-centre-part-2?gm=65818",
    "gameName": "King in the Centre Part 2",
    "players": "jstevens1 (1864) vs. myrydin (1939)",
    "opening": "Reti opening (A05)"
}