{
    "moves": {
        "1. d4": "One of my favorite openings for white, the glorious queens gambit.",
        "1... d5": "standard reply to the queen pawn opening.",
        "2. c4": "white sticks with the normal queens gambit opening",
        "2... c5": "This is unorthodox for black",
        "3. cxd5": "never a bad idea to trade pawns if you can get rid of the black D pawn and keep your own d and e",
        "3... Qxd5": "black takes back the pawn with the only thing that it can use, the queen",
        "4. Nf3": "white defends its d pawn which is under attack by blacks c pawn and blacks queen",
        "4... Nc6": "black brings more firepower and puts more pressure on whites D pawn",
        "5. Nc3": "white decides to abandon the one-ups-man-ship.  Its never a bad idea to attack the queen.  This proves the theory that the queen should stay home until later in the game.",
        "5... Qh5": "The queen scampers away to a place which puts some mild pressure on whites king side.  Would have been much better for the queen to go home.",
        "6. Nb5": "When the queen is away, the white horse goes for a fork.  This is always a danger when the queen is away from home.",
        "6... Kd7": "Black really had no good options to defend the fork. The king had to move which eliminates any possibility for black to castle.",
        "7. dxc5+": "White sees an opportunity to take a pawn and also gives what is known as a \"discovered check\".  Black can not take back the pawn because he is in check.",
        "7... Ke6": "Black moves the king out of check and the game is deteriorating for black",
        "8. Nc7+": "White succeeds in creating a fork after all",
        "8... Kf6": "Black king moves out of check once again.  The black king is in a very unusual place for this early in the game.",
        "9. Bg5+": "White could have taken its bounty, but instead decides to rub salt into the wound.",
        "9... Kg6": "It gets worse and worse for black.  The king is having a nice trip around the board.",
        "10. Nxa8": "White could have given another check with the Queen but since it wasn't checkmate then white decides its time to take the bounty.",
        "10... e5": "Black pushes a pawn which does 2 things.  1) It makes it possible for black to threaten the white horse on the next move and 2) it opens up the black bishop 3) threatens the white pawn",
        "11. Qd2": "white adds protection to bishop with Q. White is planning to move the horse to H4 for a lovely check and needs to maintain protection on the bishop so the King won't take it.  Notice that white, fails to protect the pawn on C5 which may be an oversight, but it is a noble sacrifice considering the next white move.",
        "11... Bxc5": "black takes an unprotected pawn and brings his bishop into action.",
        "12. Nh4+": "White puts the King in check, and leaves black with only one possible move.",
        "12... Qxh4": "Black has no other choice.  He takes the offending horse with his Queen.  It is not an equitable trade.",
        "13. Bxh4": "White takes the black queen and is now 11 points up.",
        "13... Bb4": "Although black is on the ropes, and staggering, he comes back with a really nice \"skewer\"",
        "14. Qxb4": "White has no good option other than to give black and inequitable trade.  Blacks momentum is increasing.",
        "14... Nxb4": "Black takes the white queen as expected, and now white is only 5 points up.  That was some really good work for black.  He gained back 6 of his points with that.",
        "15. Kd2": "White sees a fork coming, and is forced to protect with the King.  Its like DeJaVu.  The momentum is still with black now.  White must abandon all hope of castling.",
        "15... Nh6": "Black brings out his other horse which opens up his lone rook.  I suppose the horse did not go to f6 because white might do a trade.",
        "16. a3": "White decides to move the black horse away.  There are probably other options at this point but ...",
        "16... Nd5": "Black moves away as expected.",
        "17. e4": "White continues to hound the black horse and also opens up the white bishop.",
        "17... Nf4": "Black moves away as expected.  The white bishop can not be so eager to move now that black threatens a pawn.",
        "18. Nc7": "Its time to get baby out of the corner.",
        "18... f5": "Black pushes a pawn.  This gives the black king an escape route.",
        "19. g3": "White could have done a pawn trade but decides to keep hounding that horse.",
        "19... Ne6": "The horse moves away as expected.",
        "20. Nxe6": "When you are up on points, its always a good idea to trade, trade, trade.",
        "20... Bxe6": "Black trades as expected.",
        "21. exf5+": "White is still in a trading mood.",
        "21... Bxf5": "Black trades as expected.",
        "22. Bc4": "Now the white bishop can come forth to a lovely square that actually pins in the black king.",
        "22... Ng4": "Black horse comes to a safe spot and threatens a pawn.",
        "23. Ke2": "White king protects the pawn. ",
        "23... e4": "Black has a loose pawn on the march.",
        "24. Rad1": "White brings some more fire power.",
        "24... Ne5": "Black horse threatens white bishop.",
        "25. Rd6+": "White ignores the threat on bishop and goes for check.",
        "25... Kh5": "Seems to be the only move available for black.",
        "26. Bd5": "White brings bishop out of jeprday and threatens a pawn and keeps the King pinned in.",
        "26... Bg4+": "The staggering fighter hits back.",
        "27. Ke3": "white kings moves out of check and threatens that loose pawn.",
        "27... Bf3": "It always a lovely idea to put a bishop in front of a pawn for a mutual protection society.  Besides that, the white rook is in trouble.",
        "28. Rc1": "White rook is prompted to join the party.",
        "28... Nd3": "black horse threatens rook.",
        "29. Bf7+": "White ignores the threat and goes for a check.",
        "29... Kg4": "black moves king out of check.  could have also pushed a pawn to accomplish this.",
        "30. Be6+": "white continues to hound the king.",
        "30... Kh5": "King bops back again.  White must becareful about the 3 fold thing.",
        "31. Rd5+": "The hounds are continuing to pester the king, all the while, the white rook is in trouble.",
        "31... g5": "Black solves the check. but will lose the pawn.",
        "32. Rxg5+": "white is now 6 points up and the black king is on the ropes.",
        "32... Kh6": "Just can't finish this guy off.  Keeps bobing and weaving.",
        "33. Rc7": "White rook comes out of jeoprday and helps to trap the king.",
        "33... Re8": "black threatens white bishop.",
        "34. Bf5": "bishop moves out of trouble and adds to the preasure on black king.",
        "34... Rh8": "Black sees big trouble coming and protects its pawn.",
        "35. Rf7": "white is trying to finish this thing off.  It ingnores the chance to take a pawn.",
        "35... Ne5": "black horse makes a last ditch effort.",
        "36. Rxb7": "White gets out of trouble and goes 7 points up.",
        "36... Nc4+": "Black checks",
        "37. Kf4": "White king moves out of check.  White must be careful not to get trapped in there.",
        "37... Nd6": "Black threatons rook.",
        "38. Rxa7": "White goes 8 points up.",
        "38... Nxf5": "Black executes a trade.  This is usually ill-advised when you are down on points. ",
        "39. Ra6+": "White declines the trade for now and makes a check.\n\nBLACK RESIGNS>"
    },
    "url": "https://gameknot.com/annotation.pl/king-takes-a-stroll-around-the-board?gm=33523",
    "gameName": "King Takes a Stroll Around the Board",
    "players": "jutterback (1466) vs. gpanchal (1386)",
    "opening": "QGD (D06), symmetrical (Austrian) defence"
}