{
    "moves": {
        "1. d4 Nf6": "This game comes from King Inidan Defense mini-tournament",
        "2. c4 g6 3. Nc3 Bg7": "King's Indian. I am more a Pirc player than King's Indian",
        "4. e4 d6 5. f3": "Saemisch",
        "5... O-O 6. Be3 c5": "The c5 break! It is a gambit, if you will. I play 6...c5 against the Saemisch 100% of the time.",
        "7. Nge2 Qa5": "I am unsure what better move there is. (the point of these public annotated games) White did not push his pawn to d5.",
        "8. Qd2 Nc6": "how would e5 do!?",
        "9. d5 Ne5 10. Ng3 a6": "queen side attack",
        "11. Bd3": "??",
        "11... Nxd3+": "Handing me the bishop",
        "12. Qxd3 Nd7": "?? this was a bad move on my part. Better would be 12...b5 with another gambit \n(cxb...axb; Nxb...Ba6) Then I would attack on a & b files withe my two rooks, then play Nd7 opening up the long diagonal for my dark square bishop. Attacking in the Benko gambit fashion",
        "13. f4 Bxc3+": "??",
        "14. bxc3 b5 15. O-O bxc4 16. Qxc4 Nb6 17. Qd3 Bb7": "?? Now I am stuck with a inactive bishop for most of the game. I got the Bb7 idea from playing too many Pirc games. That unblock c pawn really makes a difference.",
        "18. Rfb1 Rab8 19. Bd2 Nd7": "Now my pieces are cramp",
        "20. c4 Qa4 21. Ne2 Ba8": "?? what else is there",
        "22. Nc3 Rxb1+ 23. Rxb1 Qa5 24. h3": "??",
        "24... h5": "!?",
        "25. e5": "!? uh oh! Now I am starting to feel the shadow of defeat",
        "25... Qc7": "I begin to regroup",
        "26. e6": "!?",
        "26... Nf6 27. exf7+ Kxf7 28. f5 Rg8 29. Rf1 Bb7": "I here my bishop becomes active! Taking step #1 \nThe start of his Zig Zag journey",
        "30. fxg6+ Rxg6 31. Qf5 Kg7 32. Ne4 Bc8": "Step #2",
        "33. Qf3 Qd7": "I was prepared to exchange pieces now. I believe my opponent did not see the reason behind Qd7 back up by the bishop. The Zig Zag motion by my bishop saved me from defeat. Yes white can capture the h pawn but it is bait! Once we exchange pieces we'll have opposite color bishop's",
        "34. Nxf6 Rxf6": "!! This is one of the reason why I play Kxf7 earlier, as to let my rook maneuver about here and fro",
        "35. Qxh5": "?!",
        "35... Rxf1+ 36. Kxf1 Qf5+": "!! ",
        "37. Qxf5 Bxf5": "At last my bishop is free! Now we have a theoretical draw. Bishops of opposite color tend to be drawish. I offer my opponent a draw but he decline. (sigh)",
        "38. Ke2": "If anybody can calculate a win for either side please, leave a comment.",
        "38... Bb1 39. g4": "?!",
        "39... Bxa2": "!!",
        "40. Kd3 Bb1+ 41. Kc3": "??",
        "41... a5": "!!",
        "42. Kb2 Bd3 43. Kc3": "The king is toiling and struggling ",
        "43... Be2": "43...Bf1?",
        "44. g5 a4": "!! a passed pawn",
        "45. h4 a3": "I do not know if I should have played a3 or something else",
        "46. Kb3 Kf7 47. Bc3 a2 48. Bb2 e6 49. dxe6+ Kxe6 50. Kxa2 Bxc4+ 51. Kb1 Be2 52. Kc2 Kf5 53. Bf6 d5": "draw agreed"
    },
    "url": "https://gameknot.com/annotation.pl/kings-indian-b-v-b-amp-pawns-endgame?gm=18429",
    "gameName": "King's Indian B v B & pawns endgame",
    "players": "gastanf (1568) vs. freeman8201 (1625)",
    "opening": "King's Indian (E81), Saemisch, Byrne variation"
}