{
    "moves": {
        "1. c4": "hi this is an interesting game which, though I happened not to win an apparent winning game, gave me the opportunity to win my first tournament.",
        "1... Nf6 2. Nc3 g6 3. e4 Bg7 4. d4 d6 5. Nf3 O-O 6. Be2 e5 7. O-O Nc6 8. d5 Ne7": "scheme of the tournament",
        "9. b4": "my favorite attack... I should think about developing it when I play someone who does not know me, but find out another scheme with people who know me.",
        "9... Nd7": "preparing the classic f5",
        "10. a4": "queen-side full horror",
        "10... f5": "classic counter-attack on the king side.",
        "11. Ba3 Nf6 12. Nd2": "retiring from the battlefield to compose on the other side. We'll see my knights played a good part here.",
        "12... g5 13. f3": "trying to blockade the king side.",
        "13... Bd7 14. c5": "entering.",
        "14... Ng6": "negate the threat, continuing its own plan. I don't blame ataka: i'd do the same with black.",
        "15. g3": "computer considers this as an inaccuracy and proposes \n15 c6 bxc6 16 dxc6 Bxc6 17 exf which seems better, but was totally out of my plans.",
        "15... f4": "I think this gave me the opportunity to block this side for a while. I'd pose this as a first mistake from black",
        "16. g4 Qe7 17. h3": "just in case black is inspired by a sacrifice or a h5 move. I considered I had a little time to continue my own attack. Who said that: \"first defense, then attack\"?",
        "17... h5": "bingo!",
        "18. Nc4": "now, i consider my own attack.",
        "18... hxg4 19. hxg4": "h-column didn't seem to dangerous for now, since I considered my own attack as faster than the eventual movements rook-king to occupate the free corridor.",
        "19... Kf7": "But... black considered it... And this is the second mistake here, as the knights are very naughty pieces...\ncomputers proposes: 20.\tb5\tdxc5  21.\td6\tcxd6 22.\tNxd6+\tKg8  23.\tNxb7\tRac8 24.\tBc4+\tKh7 25.\tNd5\tNxd5 26.\tQxd5\tKh6 27.\tBxc5, but is black forced to play dxc5?",
        "20. cxd6": "anyway, my continuation seems very strong.",
        "20... cxd6 21. b5": "we are now both on d6... Black should play Ne8, thought after that I had some plan to continue my attack.",
        "21... Rfh8": "?!",
        "22. Nxd6+": "and check, and a pawn.",
        "22... Kg8 23. Nxb7": "and a second pawn... but i was now arrived at my own peak... and I did not know it.",
        "23... Qe8 24. Nc5": "I thought about various other continuations, but did not see any one winning including light black bishop. from now, black will be on the lead, but I still don't know it.\ncomputer proposes 24.\tNd6\tQd8 25.\tNf5\tRh7 26.\tRf2\tBf8 27.\td6\tKh8 28.\tRc1\tRc8 29.\tNd5\tRxc1  30.\tBxc1\tNxd5 31.\tQxd5 but once again, is blac forced to play all these moves?",
        "24... Rh3": "logical, without panicking, ataka leads its own attack.",
        "25. Qb3": "impressive, no? I thought it was... bishop and queen seem to be able to consider an attack on the king. ",
        "25... Rg3+ 26. Kf2": "king is comfortable to flee, here.",
        "26... Nh4 27. Ke1 Ng2+": "these 2 pieces seem busy. I have to admit that I considered to late the importance of the e3 square.",
        "28. Kd2 Rc8 29. Kc1": "dangerous choice, but I was scared of a Ne3-Rg2 continuation.\nThough the computer estimates this is my first mistake and proposes: 29.\td6+ \tKh8 30.\tRh1+\tNh4 31.\tKc2\tRg2 32.\tRag1\tRf2 33.\tKc1\tQg6 34.\tNxd7\tNxd7 35.\tRe1\tBf6 36.\tRh3\nthis time, i have to admit that I really did not play well... maybe this was the turn of the game.",
        "29... Bf8 30. Nxd7": "maybe should have done this for a long time.",
        "30... Nxd7": "black knigts are also very active tonight.",
        "31. Kb2 Ne3 32. Rf2": "preferring this to any other solution, i realized my rooks were blocked to defense. But I still got scared of Rg2.",
        "32... Nb6": "and now the dangerous spot is c4. I started to consider the draw, now, though I was 2 pawns ahead.\nComputers play Nxg4! I have to admit...",
        "33. Bxf8": "forced, as a Nc4 position would lead to a double attack on my bishop.",
        "33... Qxf8 34. Rc1 Nbc4+ 35. Bxc4 Nxc4+": "we can consider the knights have beem much more agressive than the bishop in this game. For both sides.",
        "36. Ka1": "I should have played Ka2 here...",
        "36... Rxf3": "gosh, this is a beauty! Congratulations to ataka.",
        "37. Rxf3": "thought I saw everything that followed, I had to take.",
        "37... Nd2 38. Qd1": "I considered for a moment Qa2, but I thought it does not lead to nothing and the f-pawn is too dangerous. Actually, it was the best shot",
        "38... Nxf3": "Here black proposed the draw. I accepted. \n39 Qxf4 would lead to Qa3 and a solid draw.\n"
    },
    "url": "https://gameknot.com/annotation.pl/kings-indian-mainline?gm=38065",
    "gameName": "Kings Indian Mainline",
    "players": "thitho (1700) vs. ataka (1516)",
    "opening": "English opening (A16)"
}