{
    "moves": {
        "1. d4": "White opens with the queens pawn (a centre pawn).",
        "1... Nf6": "Black develops a piece, and prevents pawn to e4",
        "2. c4": "White advances the c pawn, taking control of the d5 square",
        "2... c5": "Black advances the c pawn, attacking Whites centre pawns.",
        "3. e3": "White plays relatively passivly, and defends the d4 pawn with the e3 pawn, allowing this pawn to recapture if Black exchanges.\n",
        "3... e6": "Black opens a line for the dark squared bishop, and fights for control of the d5 square.",
        "4. Nc3": "White develops the knight.",
        "4... d5": "Black advances the pawn to d5. This comes with the slight positional threat of giving White a isolated queens pawn, starting with dxc5 followed by then cxd4.",
        "5. cxd5": "White exchanges the c pawn for the d pawn.",
        "5... exd5": "Black recaptures with the pawn, opening a line for his light square bishop.",
        "6. Nf3": "White develops a piece.",
        "6... Nc6": "Black also develops a knight.",
        "7. Bb5": "White develops the Bishop to a aggresive square, and pins the knight. This move comes with no sigificant threats, and the game is approximately equal.",
        "7... a6": "Black threatens the White light bishop, and invites the exchange.",
        "8. Bxc6+": "White captures the knight",
        "8... bxc6": "Black recaptures the bishop. White is 2 tempo ahead in development, and this is offset by the long term advantage of Black having the two bishops.",
        "9. Ne5": "White plays aggresively, advancing the knight to a better square, and threatening the c6 pawn",
        "9... Qc7": "Black defends the pawn and develops the queen.",
        "10. O-O": "White castles kingside, and improves the king safety.",
        "10... cxd4": "Black exchanges pawns, and removes his doubles pawns. I think a better move is Bd6, which develops the Bishop and comes with a threat against the e5 knight.",
        "11. exd4": "White recaptures with the pawn. The e line is now open, also the c1 bishop now has improved scope.",
        "11... Be7": "Black develops the Bishop to e7. This is a safe move, and looks to secure a long term advantage of the two Bishops. However this is offset by Whites strong knight on e5. Bd6 is another good development, and best met by Re1, and then after Black castles White can attack the knight by Bg5 and threaten to double Black kinside pawn.",
        "12. Bf4": "Good move. White develops with a threat of Ng6, exposing a attack on the Black queen and attacking the h8 rook.",
        "12... Qb7": "Black moves the Queen to a safer square, and threatens the b2 pawn.",
        "13. Qa4": "White counter-threats the c6 pawn.",
        "13... Bd7": "Black defends the c6 pawn with the Bishop.",
        "14. Nxd7": "White exchanges the knight for Bishop.",
        "14... Qxd7": "Black recaptures the piece with the queen.",
        "15. Rfe1": "White develops the rook to the open e line. White has a slight advantage, due to a slight initiative being two moves ahead in development.",
        "15... O-O": "Black castles kingside, and removes the pin on the e line.",
        "16. Re2": "White prepares to double the rooks on the e line. This move also defends the b2 pawn, which Black could have attacked.",
        "16... Rfe8": "Black moves the rook to the e line, ready to contest control of that line.",
        "17. Rae1": "White doubles the rooks.",
        "17... Kf8": "Black brings the king over to defend the Rook, but this move is a mistake.\nBetter is to immediately play Bd6, or else the more aggresive Nh5 to attack the f4 bishop.",
        "18. h3": "White advances the pawn, improving his position, allowing a retreat square to the f4 bishop.",
        "18... Nh5": "Black threatens the bishop with the knight.",
        "19. Bh2": "White defends the Bishop. Also interesting is Be5, which Black will probably counter with Bf6 to seek exchanges. ",
        "19... f5": "Black aggresively advances the f pawn. But this move reduces his king safety, and Black does not have good attacking prospects so this move is likely a mistake. He is planing f4, locking the White dark square bishop out of the game. I prefer the simple Nf6.",
        "20. Qc2": "White moves the Queen to the c2 square, where she is well positioned as she influences the kingside. The move prevent the advance f4 as Qxh7.",
        "20... g6": "Black prevents the Queen capture by advancing the g pawn. Blacks king safety is now quite poor and is a major factor in the postion.",
        "21. Na4": "White advances the knight, threatening Nb6 forking the queen and rook. The knight can also go to the strong square on c5.",
        "21... Qb7": "Black moves the Queen preventing the fork. This move is a tactical mistake.",
        "22. Re2xe7": "White exchanges rook for bishop. This is not a sacrifice of material as White can easily win back the exchange.",
        "22... Rxe7": "Black is forced to recapture.",
        "23. Bd6": "White pins the rook to the king. White has a large advantage, as he has a very large initiative, his pieces are more active, and Blacks king safety is poor. The dark squares around his king are very weak.",
        "23... Rae8": "Black brings the rook over to the e line ready to recapture.",
        "24. Nc5": "White advances the knight, threatening the Black queen with gain of time.",
        "24... Qb5": "Black defends the Queen and also attacks the e2 square, (the White queen can go here due to the pin)",
        "25. a4": "White attacks the black Queen with the pawn.",
        "25... Qa5": "Black defends the queen.",
        "26. b4": "White threatens the Black queen again with a unexpected move. The pawn cannot be taken due to Ne6+, with a discovered attack on the Black Queen.",
        "26... Qd8": "Black defends cleverly. Now Ne6+ forking king and queen is not as strong as it might seem, as Black will regain material and have two rooks against the White queen.",
        "27. Rxe7": "White exchanges a set of rooks.",
        "27... Qxd6": "Forced recapture, as Rxe7 loses to Ne6+",
        "28. Rxe8+": "White exchanges rooks.",
        "28... Kxe8": "Black recaptures.",
        "29. Nxa6": "White captures the a6 pawn. White is ahead one pawn in material. The passed a pawn is strong. Blacks king safety is quite poor. White has a large advantage.",
        "29... Nf4": "Black advances the knight, improving its position and preventing Qe2+",
        "30. Nc5": "White also improves his knight position, and allowes the a pawn to advance.",
        "30... Kf7": "Black moves his king off the open e line. Kc8 is impossible due to Nb7+ forking the queen and king. But I think better is the more aggresive Qf6 attacking the d4 pawn, and threatening Qg5 and trying to attack the White king.",
        "31. Qd2": "White improves the queen position, defending the weak d4 pawn, and also attacking the Black knight, reducing the movement of the Black queen which defends the knight.",
        "31... Ne6": "Black allows a exchange of knight. Black hopes to exchange knights and then play for perpetual check. This is the best way to defend a Queen ending when you are behind by one pawn in material.",
        "32. Qh6": "A very strong move. Blacks king safety is poor and White finds a way to take advantage of this. White threatens Qxh7+",
        "32... Kg8": "Black defends the pawn with the king. Nxd4 loses to Qxh7+ and then Qxh8+, and then capturing the black knight on d4.",
        "33. Qe3": "White improves his Queen positions taking control of the e line. White threatens Qxe6+.",
        "33... Nf4": "Black avoids the threat and advances the knight. Blacks king is now to far away from the a pawn to influence it, and White controls the important e line.",
        "34. a5": "White advances the passed pawn. White has a winning advantage.",
        "34... Nh5": "Black moves the knight to increase the scope of his Queen.",
        "35. a6": "White advances the a pawn. The pawn is now very strong and only 2 squares from queening square.",
        "35... Qc7": "Black prevents the pawn advancing to a7.",
        "36. Qe8+": "White checks Blacks king.",
        "36... Kg7": "Black moves the king out of check (forced).",
        "37. Ne6+": "White forks the king and queen with the knight. ",
        "37... Kf6": "Black resigns."
    },
    "url": "https://gameknot.com/annotation.pl/king-safety-and-queen-knight-endgame?gm=48263",
    "gameName": "King safety, and Queen + knight endgame",
    "players": "lordhumungus (2033) vs. schweine-hund (1882)",
    "opening": "Benoni defence (A56)"
}