{
    "moves": {
        "1. e4": "This game was a team training match and I am annotating it for the benefit of kvikas and the wider community.  If anyone has any insights to share, please comment/add as appropriate.",
        "1... e5 2. f4 d5": "The Falkbeer counter-gambit is one of my favorite defenses against King's Gambit Accepted (KGA), as it can completely steal the momentum from White.",
        "3. exd5 exf4": "A more common third move for Black is e4",
        "4. Nf3 Bc5": "I would either bring out Nf6 or Qxd5 to bring more immediate pressure.",
        "5. Nc3": "development and protection",
        "5... Ne7": "clearing the way for castling and more immediate support for a potential Bb5+.  It also leaves an option of Ng6 to protect the f4 pawn if desired.  I think this was Black's top play.",
        "6. d4": "clearing room for DSB to come and play and threatening f4 pawn simultaneously.",
        "6... Bb4": "Moving bishop from danger and applying pin pressure on knight.  Another option worth considering is Bd6.",
        "7. Bb5+": "Clearing the way for 0-0 and making use of the d5 pawn before it disappears.",
        "7... c6 8. dxc6 bxc6 9. Qe2": "This move is a mistake on my part.  The idea was cxb5, Qxb5+ to win the DSB on b4, but either knight defends against that play and I lose a bishop for a pawn.  Luckily for me, Black missed it.",
        "9... O-O 10. Bc4 Bg4": "Adding more pressure and developing a piece, I am in trouble and am about to lose my d pawn with proper play.  I started to get a little worried that I was going to be the one getting the education here.",
        "11. Bd2": "Willing to sacrifice the d pawn for K safety.",
        "11... Re8": "Thinking to pin the queen against the king is a great idea, but I might have played \n11. ... Bxf3\n12. gxf3 Qxd4",
        "12. O-O-O": "now that my king is safer, I can try to do some damage control.  If I were Black I would try to force me to double my b pawn onto c3",
        "12... Nd5": "I like the idea of the pin for extra pressure.  Another path to consider is Nf5.  While it doesn't have all of the immediate double attack options, it's a projection of power I can't easily dislodge, which will cause trouble long term.",
        "13. Qd3 Ne3": "I thought a while about this position and considered Rde1 as a response and giving up the pawn on g2, but taking with the bishop was the only solid path I think.",
        "14. Bxe3 Rxe3": "threatening to get the g pawn through bishop/knight exchange, and a far advanced pawn on the f rank would spell trouble.  However, now that the knight is gone from e3, I can escape and gain a pawn.",
        "15. Bxf7+ Kh8": "moving the king surprised me.  I anticipated him taking the bishop instead.  However, maybe he didn't want me to get the tempo move...  Moving the king to h8 is a lot better than moving the king to f8.",
        "16. Qc4": "getting queen to safety and threatening the bishop on b4.",
        "16... Qa5": "While not a bad move (and there are plenty of tactical options once you get so much firepower downrange), I think the better play is Bxc3, forcing an exposed hole for my king through which a queen/rook battery would spell trouble.",
        "17. Nd5": "Threatening the loss of a piece unless black takes with the c pawn, allowing me to net another pawn for free.",
        "17... cxd5 18. Bxd5 Nc6": "the best response by Black.",
        "19. Bxc6": "I looked at this position a few times and like my odds with the bishop taking to offer a queen trade (which would very much be to my advantage).  If I take with the queen I can also be forced into a less favorable defensive posture.",
        "19... Rc8": "duly applying pressure, hoping to net a free piece",
        "20. Qd5": "offering a queen trade...",
        "20... Qb6": "offer declined.",
        "21. Ne5": "Note that if Black takes Bxd1??, Nf7+! leads to mate in 4.",
        "21... Rxe5": "I think Bh5 is a better play instead of trading rook for knight, which would potentially have seen me respond with Nc4.",
        "22. dxe5": "better to line up rook/queen.",
        "22... Bxd1 23. Rxd1 h6": "Note if Black takes the LSB on c6 with either his rook or queen, I can force mate with Qd8.",
        "24. Ba4": "the only move to safety.",
        "24... Qe3+ 25. Kb1 Rb8": "A nice move by Black.  Note that if I play either a3 or c3, I lose the pawn for free and seriously compromise my defense.",
        "26. Bb3": "removing the danger and also supporting the queen.",
        "26... Be7": "Another good play by Black, looking to force a rook and bishop trade for a queen.",
        "27. Qe6": "threatening mate if Black now moves Rd8.",
        "27... Qe2": "Another good move by Black, putting pressure on my rook and g pawn at the same time.  If I now move my queen back to d5, I lose.",
        "28. c3": "I am willing to trade my g pawn pawn for his bishop, though it might be an even trade considering his position with the queen and his far advanced pawn.  However, with three pieces to two, I should be able to defend.",
        "28... Bc5 29. Qd5": "Now that he has moved his bishop to c5, and I have a good protection for my rook and a chance to attack the h7 square, I am ready to move my queen back.",
        "29... Bb6": "Unless Black is willing to commit a queen or rook to defense, he needed to move the bishop.  I thought he might try Be3 instead, but likely he wanted the chance to harass me with Rd8.",
        "30. Bc2": "Threatening mate if Black moves Rd8.",
        "30... Qa6": "tactical redployment.  I don't know what Black's endgame strategy is right now.  He probably should have considered Rf8 for a pawn push.",
        "31. Qe4": "threatening mate and Black's f pawn.",
        "31... Kg8": "the only move worth considering",
        "32. Qxf4 Ba5": "thinking to go after my c pawn due to rook pin.",
        "33. e6": "Black is now in a very dangerous place.  This pawn move threatens a lot of things at once and promises a promotion in the near term.  There are a lot of options that are bad here.",
        "33... Rf8": "This move wasn't as bad as some, but it allows me to trade a bishop and pawn for a rook.  The good news for Black is it will get rid of a pawn on the 6th row.",
        "34. Bh7+ Kxh7 35. Qxf8 Qe2": "A blunder on Black's part.  Take the pawn while you can.  I think Black got a little greedy here and didn't think the moves through.",
        "36. Qd6": "links back up queen and rook and protects the e pawn.",
        "36... Kh8": "in order to prevent Qd3+ and a forced queen trade.",
        "37. e7": "this move represents the end.  Black can't stop the promotion and the last domino falls.\n\nOverall I thought Black played very well in this game.  With a little more study on some of the moves, he could have had me in a real bind earlier on.  A big learning point in chess is that everyone makes mistakes, regardless of rating.  ",
        "37... Bxc3": ""
    },
    "url": "https://gameknot.com/annotation.pl/kings-gambit-accepted-training-match?gm=59801",
    "gameName": "King's Gambit Accepted Training match",
    "players": "evilgm (1899) vs. kvikas (1465)",
    "opening": "KGD (C31), Falkbeer counter-gambit"
}