{
    "moves": {
        "1. e4": "Hello again.  This match was requested by id=marvgiff to work on the Sicilian.  I do not play the Sicilian very much, but I do play against it quite a lot.  Regardless, it's always good to try something new now and again.  Appreciate your comments so we can all get better together.",
        "1... c5 2. Nf3 Nc6 3. d4 cxd4 4. Nxd4": "All pretty standard fare so far...",
        "4... Nf6 5. Nc3 e5": "One of the important considerations Black has in the Sicilian is when to play e5.  I believe that based upon play to this point it is the top play here, but some love g3 to go to the dragon variation...",
        "6. Nxc6": "Another option is to play Ndb5 to keep your power pieces in play a bit longer...",
        "6... bxc6": "when picking between two pawns, the question often arises in which one should I take with.  In this instance bxc6 is quite preferable to dxc6, because the queen trade would hurt Black's development.",
        "7. Bg5": "Adding some pin pressure to Nf6.  Another move for consideration is Bc4 to prep for a castle.",
        "7... Bb4": "Opting for a bit of aggression myself.  Be7 is a more defensive play, but no less serviceable.",
        "8. Bc4": "Good development for White, prepping for a castle.  An important \"general\" rule of thumb is to get your power pieces in play and don't overmove them.  Also, while trading pieces for advantage is part of the program, if you trade away too many pieces you won't have anything to work with to attack/defend.",
        "8... h6 9. Bh4 g5": "This move exposes my king's flank a little bit, but it shoos away the DSB, giving Nf6 some operating room.",
        "10. Bg3 d6": "Protecting the now vulnerable e pawn.  I also thought long and hard about Nxe4.  Note that if Bxe5 (threatening the rook), Qe7 allows for some play and a possible discovered check queen grab in exchange for a rook.  In retrospect, Nxe4 is likely better, because at worst it lets me trade queens and and best I get some significant material advantage.",
        "11. O-O Bxc3": "Seizing the change to double up his c pawns.",
        "12. bxc3 O-O 13. Re1 Be6": "Both side have now finished their development.  Although we are fairly equal on points/position, in general I like his setup better than mine, but there is still a lot of game left to play.",
        "14. Bd3": "I would have moved Bb3, giving Black an opportunity to undouble my pawns.  This move does give White some attack options, if they can get rid of the e4 pawn and place his queen on g5.",
        "14... Qa5 15. Qd2 Nd7": "With White moving his queen from the d1-h5 diagonal, it would have been an opportune time to play Nh5 to attack the DSB and remove it from the game.  This board will favor bishops and it would be worth the effort to offer an exchange.  The d6 pawn is very weak and needs some protection.",
        "16. h4 f6 17. hxg5 hxg5": "Again, looking at two pawns and which to take with, giving yourself an avenue to stack some rooks on the h file is always a good idea.",
        "18. f3": "Finding an escape path for his King to allow his rooks into that open h file.",
        "18... Kg7 19. Kf2 Rfh8 20. Reh1 Rxh1 21. Rxh1 Qxa2": "Seizing the defenseless pawn.  The trick now, however, is to make sure that my queen can stay relevant.  Notice that my pieces are somewhat askew to the right.",
        "22. c4 Nc5 23. Be2 Rd8": "A blunder on Black's part!  There are two better moves.  The best move is Qa3, threatening queen for knight trade with Nxe4+! if White plays Qxd6??.  Another better move is Nb7.",
        "24. Bxe5": "Wisely seeing the blunder for what it is, White pounces!",
        "24... Kg6": "Another mistake for Black.  It is better to play Nd3+ to get the queen off of the c1-h6 diagonal, exchanging the knight for a DSB.",
        "25. Bxf6 Kxf6 26. Rh6+": "I'm about to be in big trouble!",
        "26... Ke7 27. Qxg5+": "A helping hand from White!  It was a far better move to play Rh7+ instead, which would have had some more serious consequences for Black.\n\n27.\tRh7+\tBf7\n28.\tQxg5+\tKd7\n29.\tRxf7+\tKc8\n\nIs a much better position for White and almost a certain victory.",
        "27... Kd7 28. Rh7+ Kc8 29. Qe7": "In theory not a bad continuation, I just weep for the missed rook check.  Perhaps e5 to bring in some more pawn pressure.",
        "29... Qa5": "A mistake for Black.  I spent a lot of time considering Rd7, and in retrospect it was the better play.  It doesn't guarantee a rook trade, but it does give me some extra breathing room and prevents the loss of the a7 pawn.",
        "30. Bd3": "I am not certain what White's intent is here, but I fully expected Qxa7.",
        "30... Rd7 31. Rh8+ Rd8": "I'm still angry about this move.  Not as angry as 23... Rd8??, but Kc7 or Kb7 were both superior plays, since this move guarantees the loss of the a pawn.",
        "32. Rxd8+ Qxd8 33. Qxa7 Qh4+ 34. Kg1 Qe1+": "At this point I'm will to call it a draw and move on.  Note that if White decides to block with 35. Bf1, 35.... Bxc4 wins.\n\nWe each made several mistakes, but that's what makes chess fun, you don't always make the right move and your opponents can sometimes surprise you.  Thanks for reading and appreciate any comments."
    },
    "url": "https://gameknot.com/annotation.pl/kingslayers-training-game-sicilian?gm=61475",
    "gameName": "Kingslayers Training Game/Sicilian",
    "players": "marvgiff (1456) vs. evilgm (1900)",
    "opening": "Sicilian (B33), Pelikan (Lasker/Sveshnikov) variation"
}