{
    "moves": {
        "1. e4": "My favorite opening, the King's Pawn Play.",
        "1... Nf6": "He responds with the Nimovitz defense, but I do not see this too often.",
        "2. e5": "I usually consider this ?, as it is pushing a pawn.  However, this was ! because it forces the knight to retreat.  That is because the knight can become dangerous, in this position, since it has a potential to attack powerful pieces, based on my AP analysis.",
        "2... Ne4": "I do not know why he made that move, instead of Ng8 because he is not going to castle. ",
        "3. Qe2": "I chose that candidate because his knight is becoming more powerful, in this position.  However, this move was ? because I brought my queen out way too early.  Therefore, Bd3 would have been better, as it would have also chased the knight away.",
        "3... d5": "I do not why he made this move.",
        "4. Qb5+": "I respond by placing him in check immediately, and this was based on my KKQ assessment.  However, this move was ?.  ",
        "4... c6": "That is because I just wasted a move since he is threatening to capture my queen with cxb5. ",
        "5. Qb3": "Therefore, I am now forced to retreat my queen.",
        "5... f6": "He chose this candidate to force an exchange, and that will work when 6.exf6, exf6 are played.",
        "6. exf6 exf6 7. Qd3": "This gives me a tactical advantage because his queen is now blocked.   ",
        "7... Qd7": "He made this move to free his queen.",
        "8. Qe3": "I chose this candidate based on my KKQ assessment.  If I had left my queen on d3, he would have played Nc5 and threatened to capture my queen with Nxd3.  I did not want to deal with that threat.",
        "8... Qg4": "I do not why he made this move, but this will benefit me. ",
        "9. f3": "That is because I used an AP assessment to play a powerful fork between his knight and queen.",
        "9... Qf5": "In this position, he was forced to retreat his queen, so I will be ahead by two points.  That is because his knight will be exchanged for my pawn, when 10.fxe4, dxe4 are played.",
        "10. fxe4 dxe4 11. Nc3": "I decided to bring out one of my knights, based on the AP assessment.  That is because I am now threatening to capture his free e pawn with Nxe4, in this position.  If this happens he will not be able to recapture my knight with Qxe4, or he will loose the queen because I will respond with Qxe4. ",
        "11... Bc5": "As a result, he is now threatening to capture my queen with Bxe3.",
        "12. Qg3": "Therefore, I am forced to retreat my queen.  In exchange, I now threaten to capture his free g pawn.",
        "12... g5": "Consequently, he is now forced to protect his g pawn and his rook.",
        "13. d3": "I chose this candidate because it will force an exchange and attack his queen after the exchange, when exd3 followed by Bxd3 are played.  This was also based on my AP assessment.",
        "13... exd3 14. Bxd3 Qe6+": "As a result, he protects his queen by placing me in check.",
        "15. Nge2": "However, that does not bother me because I simply respond by bringing out my other knight.",
        "15... f5": "I do not know why made this move because I was not going to place him in check, due to his h pawn.",
        "16. a3": "If I did not move my a pawn, he would have been able to pin my knight on c3, and I did not want that to happen.  This threat was also based on my AP assessment. ",
        "16... f4": "He chose this candidate because he wants to capture my queen on g3.",
        "17. Qf3": "I could have played Qh3 and forced a queen exchanged with Qxh3 followed by gxh3, but I did not want do that because I would then have two h pawns.  I felt that it would put me at a structural disadvantage because my rooks would not connected, here.  Therefore, I respond by retreating my queen, and it was \r\n!, in my opinion.  In fact, I think that this was my best candidate move, based on the potential KKQ and AP, in this position.",
        "17... Na6": "I do not know why he made that move, but, \"a knight on the rim is grim\", in general. ",
        "18. Qh5+": "Based on my KKQ and AP analysis, I decided to place him in check because it is serious, instead of a mere nuisance, in this position.  That is because I will win his free g pawn, after he moves his king.",
        "18... Kf8": "Now, he is forced to move his king.",
        "19. Qxg5": "This is the free pawn that I had mentioned earlier.",
        "19... Qf7": "I do not know why chose that candidate because his rook was already protected by the queen.  In other words, I could not have played Qf6.  However, that does not bother because I will capture his f pawn, based on the AP, when Bxf4 is played.  In addition, he cannot recapture the DSB, or he will loose his queen and get placed in check because I will respond with Qxf4+.",
        "20. Bxf4 h6": "He made this move because he wants to capture my queen with hxg5, but I am not about to let that happen.",
        "21. Qd8+": "Instead, I respond by placing him in check based on my KKQ and possible AP.",
        "21... Kg7": "That is because he is now forced to move there or I will win his rook for free because I will play Qxh8, in this position.  ",
        "22. Be5+": "Therefore, I assess another KKQ by placing him in check, with my bishop.",
        "22... Qf6": "He also could have played Kh8, but it does not matter where he moves because I now have an inevitable mating pattern against him and will successfully capture his queen, in this position.  How did I reach this conclusion?  With my KKQ analysis. ",
        "23. Qxf6+": "He cannot recapture his queen.  Therefore, he can play Kg8 or Kh7, but it does not matter, at this point.",
        "23... Kg8": "That is because I will immediately force a mate with Qg7#.   ",
        "24. Qg7#": "I learned about the KKQ and AP assessments from a chess mentor.  This mentor also told me that it is only important to worry about, \"serious checks\", not, \"nuisance checks\" when analyzing the KKQ.  I am using these assessments more frequently, and it is helping me to become better at chess."
    },
    "url": "https://gameknot.com/annotation.pl/kkq-and-ap-assessments?gm=43239",
    "gameName": "KKQ and AP assessments",
    "players": "jkarp (944) vs. 10four (983)",
    "opening": "Alekhine's defence (B02), Mokele Mbembe (Buecker) variation"
}