{
    "moves": {
        "1. Nf3": "Can you find the refutation? In this game I rather speculatively sacrificed the exchange, in return for threats to both white's king and queen - on both sides of the board. I couldn't see any defence. Neither could my opponent, who surrendered material and lost quickly. Post-match analysis showed the sacrifice to be unsound. Perhaps against a stronger player I would have checked it out better and not played it. Can you find the defence we both missed at the time?",
        "1... d5": "So my opponent opens with the Reti (Nf3), I grab space in the centre.",
        "2. c4": "This was Reti's favourite, although King's Indian Reversed set-ups with d3 and/or g3 are common too.",
        "2... e6": "Perhaps d4 is more aggresive, but Black can end up with an over-extended centre, if he is not careful.",
        "3. g3": "The most common move in this position.",
        "3... Nf6": "I continue to develop.",
        "4. Bg2": "As does he.",
        "4... Be7": "The most common move in this position",
        "5. O-O": "This has to be played sometime, so there is no point in delaying.",
        "5... O-O": "and the same goes for Black.",
        "6. d4": "Transposing into the Catalan variation of the Queen's Gambit declined.",
        "6... dxc4": "This is the most commonly played move here.",
        "7. Ne5": "7. Qc2 is more common, but this is perfectly playable.",
        "7... Qd6": "7.... Qd6 is only the 5th most commonly played move in this position, but it had a good record.",
        "8. Nxc4": "So white recaptures.",
        "8... Qa6": "8.... Qa6 is the only move in the World Database on Gameknot.",
        "9. Qb3": "9. Qb3 is the most commonly played move.",
        "9... Rd8": "Black attack the pawn d4.",
        "10. Nc3": "Now on the database, there are 3 games with 10. Nc3 and one with Rd1 - which looks the obvious way to defend d4 - Stoer, Andreas (2150) vs. Lautner, Josef (2126), which Black one. OK, before reading on, consider what happens if Black just takes the pawn on d4 now. Why can't he take it?",
        "10... Nc6": "So why can't Black just take the pawn on d4? The point is that after 10... Rxd4, white has 11. Nb5 attacking d4 and c7, and after Rd7, which is the only way to meet both threats, White has Ne5, attacking the rook again, with advantage.",
        "11. e3": "So now White has to defend it with a pawn.",
        "11... Rb8": "This is the parting of the ways. There were 3 games on the database with this position, Rb8 ended in a Black win in Szymczak, Zbign… (2355) vs. Staniszewski, P… (2405), Nb4 led to a white win in Kristiansen, Je… (2435) vs. Ornstein, Axel (2430) as did Na5 in Manor, Ilan (2430) vs. Rubinetti, Jorg… (2445), so obviously I picked the one Black one!\r\n",
        "12. Bd2": "Now in that game, play continued b5 13. Ne5 Nxe5 14. dxe5 Nd7 15. f4 Bb7 16. Qc2 Bxg2 17. Qxg2. After my opponent's move, I thought this made b5 all the stronger. If 12....b5 13. Ne5 Nxe5 and if he recaptures, I can take his bishop on d2. The Bd2 also takes the d2 square away from the Nc4, so the only other square is 13. Na3, but b4 forking his knights on a3 and c3 seems strong.\r\n",
        "12... b5": "So I played it! Stop! Work out the best move for White here.",
        "13. Bxc6": "And he did the only move to avoid losing material immediately. Now he has surrendered his best minor piece, the Bg2, which was proudly surveying the entire long white squared diagonal from h1 to a8. Now if the simple recapture, Qxc6, White plays Ne5 and his knights on c3 and e5 in fact cover the white squares f3, e4, d5 and c6 and black is only slightly better. So, I played an interesting exchange sacrifice, which is not actually sound, but takes some refuting!",
        "13... bxc4": "Hitting the queen, virtually forcing the reply.",
        "14. Qxb8": "So he takes the rook.",
        "14... Qxc6": "And I take the bishop. The big threat is Bb7, threatening both the queen on b8, by the rook on d8 and a mate on g2. So find the best move for White now?",
        "15. Qxa7": "Yes, he has to move his queen off my back rank, so he may as well take a pawn.",
        "15... Bb7": "So I threaten a mate on g2. I am also threatening Ra8 winning the queen. So stop again, and find the best move for White.",
        "16. d5": "In the complications, this is where my opponent goes wrong. This is the right move, but at the wrong moment. Best was 16. f3 Ra8 and then 17. d5. Play may have continued with Nxd5 18. Qd4 Bf6 19. Qg4 Qb6 20. Nd1 Bc6 21. Re1 Bxb2 22. Nxb2 Qxb2 23. Qxc4 Bb5 24. Qd4 Rxa2 25. Rxa2 Qxa2 with a small advantage to White. ",
        "16... Nxd5": "So I take it with the knight, hoping to move it again, and still play the mate.",
        "17. Qa4": "White desparately wants to exchange queens to prevent the mate. This is another mistake, but the position is lost anyway. Better was 17. f3 Nb6 18. Qa5 Rxd2 19. Nd1 Rd3 20. Kg2 Nd7 21. Qe1 Ne5 22. Qe2 Nxf3 23. Rxf3 Qxf3+ 24. Qxf3 Rd2+ 25. Nf2 Bxf3+ 26. Kxf3 Rxb2, but Black would still be winning.\r\n",
        "17... Nxc3": "So I remove his defence of his queen, and threaten the mate again.",
        "18. Qxc6": "So he thankfully takes the queen.",
        "18... Ne2+": "but before recapturing I throw in a check, which means he can't take the knight back.",
        "19. Kg2": "This is the best square.",
        "19... Bxc6+": "Now I retake the queen.",
        "20. Kh3": "His king continues to march. The Gameknot computer says 20. f3 Rxd2 21. Rf2 Bb5 22. a4 Ba6 23. Re1 c3 24. bxc3 Bc5 25. c4 Bxc4 26. Rb1 h5 27. Rc1 Nxc1 28. Rxd2 Bxe3 29. Rd8+ Kh7 is marginally better, White is -6.53 instead of -9.15, but it is a bit academic now.",
        "20... Rxd2": "Because another piece is going.",
        "21. g4": "Gameknot still prefer f3.",
        "21... Rxb2": "I like taking material.",
        "22. Rfd1": "Gameknot prefers 22. a3",
        "22... Ba4": "And Gameknot prefers 22......Nc3, but it didn't matter, as my opponent resigned. I hope you enjoyed the game, please add your comments and rate my annotation!"
    },
    "url": "https://gameknot.com/annotation.pl/knights-of-honor-viii-open-tourney?gm=39867",
    "gameName": "Knights of Honor VIII Open Tourney",
    "players": "pawnstar2010 (1617) vs. charleshiggie (2149)",
    "opening": "Reti opening (A09)"
}