{
    "moves": {
        "1. c4 f5 2. g4": "This is the gambit move. It's not a \"pure\" Krejcik, which properly arises after 1. d4 f5  2. g4, so perhaps this specific configuration should be called the Krejcik Gambit System or (pardon the shameless self-promotion) the \"Avocet Gambit.\"  ;-)",
        "2... d5": "Interesting. In many gambits Black's \"correct answer\" features ...d5 at some point, usually quickly after the gambit move.",
        "3. Bg2 c6": "If 3. ...dc4 then 4.Qa4 --> Qc4 is a plausible response.",
        "4. cxd5 cxd5 5. gxf5 Bxf5 6. d3 Nf6 7. Qb3 Qd7 8. Bf4 e6 9. Nf3 Nc6 10. Nh4 Bg6 11. Nxg6": "Now everyone's pawns are bad ...but White's are just a little better.",
        "11... hxg6 12. Nd2 Nd4": "Impetuous.",
        "13. Qc3 Nc6": "Of course. There is no other square for the Knight to retreat to except the one it just came from.",
        "14. Rc1 Bd6 15. Bg3 Bxg3 16. hxg3": "Now White's pawns look even better.",
        "16... Rxh1+ 17. Bxh1 Rc8 18. Qb3 Nd4 19. Rxc8+ Qxc8 20. Qc3 Qxc3 21. bxc3 Nb5 22. c4 Nc3 23. a3 b6 24. cxd5 exd5 25. e4 dxe4 26. dxe4": "Maintaining the pawn-strength in the center.",
        "26... Ke7 27. f4 Nh5 28. Kf2 Ke6 29. Nc4": "?! -- Good idea, wrong moment. This should have been prepared-for with Bf3 threatening to snap off the h5N at an opportune moment, or 29. e5 followed by Bf3, and *then* Nc4.",
        "29... Nb1 30. Ke3": "?? -- Nothing but a blunder. Better was 30. a4.",
        "30... b5 31. Ne5": "This was the idea behind Nc4, to win Black's K-side pawns. But my previous blunder, hanging two pawns, had me pretty depressed at this point; I was just about ready to resign.",
        "31... Nxa3": "However, that was the wrong pawn to take. White's a-pawn isn't going anywhere, and ... Ng3 captures with tempo.",
        "32. g4 Nf6 33. Nxg6": "? -- Still trying to lose. Instead, an immediate 33. g5 had a nasty little bite to it, without dropping a pawn.",
        "33... Nxg4+ 34. Kd4 a5 35. e5 Kf5": "?? -- Amazingly this rather natural-looking move almost loses by force. The correct move was 35. ...Nh6.",
        "36. Be4+": "! - Simple, obvious, and strong.",
        "36... Ke6 37. f5+ Kf7 38. e6+": "Chessplayers have a tendency to forget that in conjunction with marching pawns, the Bishop-Knight tandem can be a powerful attacking duo.",
        "38... Ke8": "?? -- Loses instantly. The correct move was 38. ...Kg8!! which looks awful but seems a hard nut to crack. In fact, White may have no better than a perpetual with 39. Ne7 Kf8  40. Ng6 etc.",
        "39. Bc6+": "Black resigns. 39. ...Kd8  40. e7+ Kc7  41. e8=Q as too much.",
        "39... Kd8 40. e7+ Kc7": ""
    },
    "url": "https://gameknot.com/annotation.pl/krejcik-gambit-twixt-the-cup-and-the-lip?gm=47643",
    "gameName": "Krejcik Gambit - Twixt the Cup and the Lip",
    "players": "Avocet (1200) vs. alfil56 (1833)",
    "opening": "English (A10), Anglo-Dutch defense"
}