{
    "moves": {
        "1. Nc3": "Esta bonita historia acontece en esos tiempos lejanos del ajedrez romántico, posbilemente en Europa. Un terrateniente, cuyo nombre se ha perdido en los laberintos del tiempo, tenía la particularidad de ser tan despiadado como buen jugador (al menos eso era lo que decía). Para castigar a los campesinos que trabajaban en su tierra y, de paso divertirse, los citaba y obligaba a jugar, demostrando así su superioridad tanto económica como intelectual. Las sesiones eran humillantes y cada vez más frecuentes. Un día, llegó al latifundio un forastero. Sin tener donde dormir, encontró lugar entre la peonada que supo compartir su pobreza con el recién llegado. La alegría surgió cuando  el visitante, agradecido por la hospitalidad, prometió que vengaría el buen nombre de estas pobres personas en el propio juego del abusivo. Al día siguiente, el retador se presentó en la mansión del noble, quién, encantado de encontrar un retador, le dio las piezas blancas. Antes de empezar, dijo nuestro jugador, le confesaré que no solo estoy dispuesto a ganarle, sino que me he impuesto una condición secreta que procederé a escribir.\n",
        "1... e5 2. Nf3": "Debo aconsejarte que muevas los peones - Dijo el noble mientras pensaba en el pésimo jugador que tenía en frente.\n",
        "2... d6 3. d4 Nc6": "No me importa jugar sin enroque si ganaré de todas formas. Que juegue dxe5 si desea. Pensó el noble.\n",
        "4. d5 Nce7 5. e4 f5 6. Bg5 h6 7. Bh4": "Has perdido un alfil. Pensar que un par de jugadas atrás creías que me podías ganar\n",
        "7... g5 8. Nxe5 dxe5 9. Qh5+ Kd7 10. Bb5+ Kd6 11. Bxg5 Bg7 12. Be3": "Y en este momento el noble se dio cuenta que su situación no era tan cómoda como le hubiera gustado.\n",
        "12... f4 13. Bxf4 exf4 14. e5+ Kc5 15. Na4+ Kxb5 16. Qe2+ Kxa4 17. Qc4+ Ka5 18. b4+ Ka4 19. Qb3+ Kb5 20. a4+ Kb6 21. a5+ Kb5 22. c4+ Ka6 23. b5#": "Nuestro jugador dio el papel al noble, que decía: 'Tu tienes grandes riquezas, soldados y súbditos, pero de nada te sirve si te dejan solo. No solo daré mate con mis peones, sino que no me comerás ninguno. Ellos, avanzando unidos, lograrán destronarte'.\n"
    },
    "url": "https://gameknot.com/annotation.pl/la-venganza-del-campesinado-http-gameknot-com?gm=55095",
    "gameName": "La venganza del campesinado., http://gameknot.com/",
    "players": "Jugador  vs. Terrateniente ",
    "opening": "Dunst (Sleipner,Heinrichsen) opening (A00)"
}