{
    "moves": {
        "1. e4": "Little white infantry swoops in to city centre.",
        "1... e5": "Nice conversation between white and black infantry.",
        "2. Nf3": "White Cavalry swoops in in hope of stabbing the dark infantry.",
        "2... Nc6": "Black cavalry charges in and intercepts the attack of the white chavellier.",
        "3. c3": "Small march by c-infant in hope to invade big-time in city centre on d4.",
        "3... Bc5": "Dark elephant stampeding in to intercept the launch of the city centre.",
        "4. b4": "b-infant makes a bold step in hope to converse with the elephant.",
        "4... Bb6": "Elephant retreats cowardly from b-infant.",
        "5. a4": "a-infant marches in hoping to trap the dark elephant.",
        "5... a6": "the black-a infant steps forward to create a breathing hole for dark elephant.",
        "6. b5": "b-pawn marches in in conversation with dark knight and dark infant. Chariots line up, face to face. ",
        "6... Nce7": "Black cavalry retreats leaving poor e-infant ready to be massacred.",
        "7. Nxe5": "Brave e-infant is stabbed and killed by evil white cavalry.",
        "7... Nf6": "Le Chavellier negro introduced in hope of killing the e-infant. ",
        "8. Bc4": "White elephant marches in in hope of targeting the f-infant.",
        "8... O-O": "King manoeuvres and shelters safely in its castle. ",
        "9. Qb3": "White lady flies in on the queenside flank increasing pressure on the f-infant.",
        "9... d5": "Bold d-pawn marches forward and blocks the steady laser path of elephant and lady.",
        "10. exd5": "Brave d-pawn slaughtered but black takes revenge.",
        "10... Nexd5": "Goodbye le d-pawn blanc. ",
        "11. Bxd5": "Elephant kills horse.",
        "11... Nxd5": "And vice versa, horse kills elephant: summing up:\n\nBlack has more centre control than white and has an elephant looking at f2 whilst white has the king in the centre against the vulnerable e-file. Though black is an infant down, I think his position is somewhat better.",
        "12. Nxf7": "Knight attempting suicide mission as he slaughters protector f-pawn.",
        "12... Rxf7": "Castle attempts first slaughter as it kills cavalry de blanc.",
        "13. O-O": "White comes into safety with his castle.",
        "13... Qg5": "Still defending the knight and aiming at g2 - you know the variation- 14. ... Bh3 and white is doomed.",
        "14. d4": "d4! Controlling the centre, etching in my bishop and attacking my queen - 3 in 1. ",
        "14... Qf5": "Lining up the cannon on f2.",
        "15. Nd2": "Developing.",
        "15... Be6": "Preparing a sniper shot at the queen, like so with Ne4! winning the exchange\n",
        "16. Qd1": "The queen returns home. Here, Black is much more active than white.",
        "16... c5": "Trying to open the diagonal with a forceful c-infant",
        "17. Nf3": "The pawn is defended by chavellier de blanc.",
        "17... cxd4": "C-infant takes over city centre",
        "18. Nxd4": "Only to be replaced by the white knight aiming at the lady.",
        "18... Bxd4": "Black elephant storms and finishes off le chavellier blanc",
        "19. Qxd4": "White lady swoops in to city centre yet again.",
        "19... Rd8": "Inevitable.",
        "20. Qh4": "Queen flies to the edge, attacking the loose rook.",
        "20... Rdd7": "Moving and doubling up with his twin. Notice that all my pieces (but the g7 pawn) is on a light square.",
        "21. Bb2": "Finally developing the only white elephant.",
        "21... Nf4": "Aiming for Ne2+ or Qg6.",
        "22. Kh1": "I do not know why this move was played.",
        "22... Bd5": "Aiming the line at the g2 pawn. ",
        "23. f3": "Trying to etch my bishop out.",
        "23... Qg6": "Creating another threat - the threat of 24. ... Qxg2#.",
        "24. Qg3": "Hoping that I would exchange ladies and give up the attack.",
        "24... Qd3": "Not so - my queen storms into white's camp.",
        "25. Rad1": "Inevitable.",
        "25... Qe3": "Still a resilient black lady!",
        "26. Rfe1": "This forces me to unfortunately retreat. There is no good square I can go to.",
        "26... Qc5": "So I retreat back to safety.",
        "27. Re8+": "Re8+! if that rook on f7 had been a pawn, it would have been mate.",
        "27... Rf8": "The only move.",
        "28. Rde1": "No doubt supporting the rook.",
        "28... Nd3": "Forking the rook and bishop.",
        "29. Rxf8+": "Exchange first.",
        "29... Kxf8": "Not Qxf8? giving up the ferocious attack but Kxf8 and there is no good check white can give. 30. Qb8+ Kf7 doesn't help.",
        "30. c4": "?? An absolute blunder that will lose the game - the idea I can see - rook and pawn for knight and bishop is fine, but this loses the queen, and possibly the game, as you will see. ",
        "30... Nf2+": "Nf2+ wins. The awesome le chavellier negro swoops in and delivers a nasty check - either give up the queen by Qxf2, give up the queen by Kg1 Ne4+ or give up the game, as you will observe.",
        "31. Kg1": "The only square for his majesty.",
        "31... Nh3+": "Double check by le chavellier negro and the black lady - not Ne4+ just yet.",
        "32. Kf1": "?? The move that wins is actually Kh1! and not Kf1! Kh1! does not fall for smothered mate as you will see - 32. Kh1 Qg1+?? 33. Rxg1 Nf2+? is not mate as the queen can take it. But after 32. Kh1 Nf2+ 33. Kg1 Ne4+ the queen falls. But Kf1 is worse.",
        "32... Bxc4+": "The bishop swoops in for the check.",
        "33. Re2": "The king is stranded so the rook blocks, but this causes:",
        "33... Rd1+": "The black chariot swoops to the black rank and cuts the king's throat. Yet again his majesty is stranded so there comes the only saving move...\n\n[Yes, I know that Qg1# would have finished it, but hey, this version is prettier.]",
        "34. Qe1": "The lady swoops in in a vain attempt to defend his majesty.",
        "34... Qf2#": "And will you observe this spectacular checkmate! [Yes, fussy people, Qg1# would have been the same] - the bishop pins the rook so the rook cannot take, the rook pins the queen so the queen cannot take, and the knight protects the king! Thanks for watching and goodbye! @oodle3"
    },
    "url": "https://gameknot.com/annotation.pl/lady-strikes-again?gm=56955",
    "gameName": "Lady strikes again",
    "players": "mona1212 (1600) vs. oodle (1200)",
    "opening": "Ponziani opening (C44)"
}