{
    "moves": {
        "1. e4": "I'm at that point in my chess adventure that I have a few openings I feel comfortable with, and trust my tactical and positional instincts to get me through unknown lines. The French is one of those; I love its stable pawn structure and intense queenside play. However, I've learned chess \"backwards\" as to what is proper, concentrating on opening lines instead of endgame basis, and I often lose evenly matched endgames. Part of this is due to my limited ability to calculate long series of moves (as I'm no chess savant) and part of it is a fear of these types of endings (I'm much more comfortable mating in the late-middlegame).  So, this is exactly the type of game that I wish I had lost, or at least drawn - I made several severe severe endgame blunders that should have cost me the game, and I won only because my opponent (who had been playing extremely well) committed a more serious error than mine. In other words, a terrible way to win.\r\n\r\nThe middle game is an excellent (and surprisingly accurate) example of the subdued positional jockeying that branches off into a little used variant of the French Defense at the eighth move. The themes expressed in this game are typical themes of the French: queenside play and a stable center pawn structure by black, with a concession of space and development to white.\r\n\r\nAs always, all analysis has been supported by Crafty 20.14w32, the multi-threaded version of the Crafty engine.\r\n",
        "1... e6 2. d4 d5 3. Nc3": "Classical French system. Other options are: 3.Nd2 (Tarrasch:C03); 3. dxe4 (Exchange:C01); 3.c3 (also Exchange:C01), 3.e5 (Advance:C02). ",
        "3... Nf6 4. e5": "This move transposes the game into the Steinitz variation of the Classical French (C11). ",
        "4... Nfd7": "Standard opening book.\n\nBlack's major plans are to advance the c-pawn to attack whites pawn chain, then ...Nc6 and ...Qb6, focusing all play on the queenside.  His light-bishop will obviously be an issue, being almost impossible to develop until the late middle-game.  This is a serious pain the ass, but not necessarily a major handicap; the conservative nature of the french means that as long as the black e- and d-pawns stand, it will be almost impossible for white to break through. \n\nWhite's major plans are to defend his own center pawns and mount a kingside attack, often after both kings have been castled to opposite corners of the board.  Black can quickly overwhelm the d-pawn in particular, so careful play is needed. In the event that the d-pawn falls, the linked black center-pawns will eventually constitute a major advantage. In fact, these linked pawns are one of the biggest advantages of playing the French for black - these two pawns are often worth more than a rook in the end game (I give up a knight to maintain them in this game), and black's mission is to potect them at all cost!  Eventually, the d- and c- pawns will steamroll down the center of the board and promote early. In the event that white manages to shore up his pawn chain effectively, black will often sacrifice a knight to mount an attack.",
        "5. Nf3": "This move is not a major named variation, but my database lists 1138 games for this position. Most major variations proceed 5. f4, shoring up the e5 pawn, as the d4 pawn is about to come under heavy fire (this is the main line of play).",
        "5... c5": "The most popular reply.",
        "6. Be3": "6. dxc5 is the most popular choice here.",
        "6... Qb6 7. b3 Nc6": "Still in charted territory, although barely.",
        "8. Na4": "This move marginalizes the white knight at the edge of the board, but alleviates the mounting pressure on the d-pawn by forcing the black queen to retreat. This drawback, however, is that this begin a long period of exile for the knight by placing it in a terrible position - always strive to centralize your knights - and white won't move him again until the 22nd move.",
        "8... Qc7 9. Be2 cxd4": "The d-pawn falls",
        "10. Nxd4 Bb4+": "Not the best choice.",
        "11. Bd2": "11. Bd2?\n\n11. c3 was better.",
        "11... Bxd2+": "11. ...Nxd4 12. c3 (if 12.Bxb4 then 12. ...Nxc2!) was better\n",
        "12. Qxd2 Nxd4 13. Qxd4 Qxc2": "Netting another pawn,  one that could potentially block my center pawns advancing down the center - my center pawns are looking stronger already.",
        "14. Bd3 Qc7 15. O-O Nxe5": "Best was 15. ...Qxe5.",
        "16. Rac1 Qd6 17. Bb5+": "17. Bb5 !",
        "17... Bd7": "17. ...Bd7?\nStupid.\n\n",
        "18. Bxd7+": "My pitiful 17th move now puts me between a rock and a hard place. I now have two options: give up the knight, or give up castling. 18. ...Nxd7?? 19. Qxg7! is terrible for me. Not only can I not castle in either direction, but I have to hide my king behind my center pawns where it will eventually be overwhelmed as white dominates every other area of the board.  Under these conditions, my vaunted linked center-pawns will be tied to providing cover for my king. 18. ...Kxd7 and the white knight comes back into the attack with a gain in tempo, 18. Nc5 !.\n\nI decide to give up the piece to maintain my center pawns and castling rights, and press my pawns up the board, proving how bad it sucks to be on the receiving end of the French endgame. Crafty hates me for this, but that's because it can't understand positional advantages without calculating for days on end.",
        "18... Qxd7 19. Qxe5": "Advancing my center pawns with a gain in tempo. Now that most of the tension in the center has been resolved and there are no longer overwhelming tactical situations to consider, castling has become less necessary than gaining some momentum.",
        "19... f6 20. Qc7 Qxc7": "Crafty likes 20. ...e5. In the event of a queen trade, most of the pressure will be off the king to castle, and it can move up to support the pawn advance by moving up the board under cover of the pawns. Another option was 20. ...b6.",
        "21. Rxc7 O-O 22. Nc5": "Forking my e- and b- pawns. My mission is to protect the center pawns at all costs, and after giving up a knight for them, I'm not about to lose them now.",
        "22... e5 23. Rxb7 Rac8 24. b4 Rf7 25. Rd7 Rxd7 26. Nxd7 Rc3": "The rook belongs on c2, c3, or c4, in an active position in front of the pawn chain, and must not let its only open avenue be closed down with Nc5. I liked Rc3 at the time, but craft tells me Rc2 was best, followed by Rc4, with Rc3 as the third choice. Rc4 would have had the advantage of stopping the impending queenside pawn advance.\n",
        "27. a4 e4 28. Rd1 d4 29. Kf1 d3 30. Nc5 f5": "30. ...Rc4 was probably better, but at the time I was trying to prevent white from giving back his knight advantage with 31. Nxe4, stopping my center pawns cold.  I've nursed these pawns along this far, I don't want his lousy knight - I want a damn queen! \n",
        "31. f3": "White ends up getting his way in the end, however - I probably started forward with my pawns a few moves too early, and I can't push them to the 1st rank.",
        "31... Rc4 32. fxe4 fxe4": "White is finally gives back that knight advantage in order to stop my pawns.  I'm still a little angry at this exchange - I should have gotten more for those pawns! But it should illustrate why the center pawns are the most important feature of the French, and keeping them intact is worth a piece, especially later in the game.",
        "33. Nxe4 Rxe4 34. Rxd3 Rxb4 35. Ra3": "The game now reduces to a 3-pawn and rook endgame, exactly the sort I'm terrible at.",
        "35... Rb2": "35. ...a5 was best.\n",
        "36. a5": "To be continued.....",
        "36... Kf7 37. h3 h6 38. Kg1 Ke6 39. a6 Kd6 40. Kh2 g5 41. Kg3 h5 42. Ra5 h4+ 43. Kh2 g4 44. Ra3 g3+": ""
    },
    "url": "https://gameknot.com/annotation.pl/lapland-1945?gm=14595",
    "gameName": "Lapland 1945",
    "players": "braveart (1387) vs. elegy (1176)",
    "opening": "French (C11), Steinitz, Bradford attack"
}