{
    "moves": {
        "1. c4": "This move, known as The English Opening came as a pleasant surprise to me. I play this opening myself and understand its subtleties and strategies.",
        "1... e5 2. Nc3 Nf6 3. Nf3 Nc6 4. d4 exd4 5. Nxd4 Bb4 6. Bg5 h6 7. Bh4 Bxc3+": "We are still in theory at this stage of the game. My plan is to settle 9K with weak isolated, doubled c-pawns. 9k's plan should be to utilize his bishop pair  and space advantage to put pressure on my position. With correct play by both sides, I think the game should be about equal.",
        "8. bxc3 Ne5 9. e3": "8.bxc3 \tNe5 \r\n 9.e3? \t...\r\n\r\nWhite should play 9 f4! Here, with the following ideas in mind.  First, if Black plays 9…Nxc4? white answers by 10 e4! attacking that knight and building up a huge center. That gives white a big advantage and a big initiative. Black should on the other hand play  9…Ng6! 10 Bxf6! Qxf6 11 g3!  \r\n\r\nAnd now, if Black wants to stay out of trouble, he should send his knight on g6 on maneuvers with 11…Nf8! Intending Nd7 to c5. The game continuation, on the other hand, leads almost to a strategically lost position for White. 9K is burdened with doubled, isolated c-pawns with nothing to show for it.",
        "9... d6 10. Be2 Ng6": "9. ...\td6 \r\n10.Be2 \tNg6!  \r\n\r\nAfter the painful experience with pins in the game before, I was happy to break the annoying pin on my knight standing on f6.",
        "11. Bxf6": "The retreat 11 Bg3 also leads to an easy game for Black. ",
        "11... Qxf6 12. O-O O-O 13. Qc2 Re8 14. Rfd1 Nf8": "11. ...\tQxf6 \r\n12.0–0 \t0–0 \r\n13.Qc2 \tRe8 \r\n14.Rfd1 \tNf8! \r\n\r\nI logically maneuver the knight to its ideal square, where it influences a good chunk of territory and cannot easily be dislodged. White has very little counter-play here and must somehow manage with those weak, doubled and isolated c-pawns. \r\n\r\nAn added plus in my favor is the point that trades benefit me. If I could reduce it down to a king and pawn endgame, I would win easily.",
        "15. Bd3 Ne6 16. Nb3": "15.Bd3 \tNe6 \r\n16.Nb3!\t...\r\n\r\nCM is now on the defensive and this move correctly anticipates my intended maneuver of bringing the knight to c5.",
        "16... Rb8 17. a4": "This does not accomplish much and indicates that 9K lacked a constructive plan at this point.",
        "17... Qe7 18. a5 Bd7 19. a6": "17. ...\tQe7 \r\n18.a5 \tBd7 \r\n19.a6? \t...\r\n\r\n9K should have avoided this move because it closes the files on the queenside and shifts all attenion to the Kingside, where Black enjoys a clear advantage.",
        "19... b6 20. Nd4 Nc5 21. Nb5": "19. ...\tb6 \r\n20.Nd4 \tNc5 \r\n21.Nb5?\t...\r\n\r\nAfter the exchange of the knight for bishop, White’s position goes from bad to worse. White’s bishop does not have much defensive value because its own pawns keep it away from contact with the kingside.",
        "21... Bxb5 22. cxb5 Qf6": "21. ...\tBxb5 \r\n22.cxb5 \tQf6!  \r\n\r\nI am steadily improving my position by dominating the center. 9K has no way to create play on the queenside thanks to the blocked pawn structure on that side of the board. I will calmly build up my position by first doubling rooks on the e-file.",
        "23. Bc4 Re5 24. Bd5 Rbe8 25. Rd4 Ne6 26. Rd2 g6": "23.Bc4 \tRe5 \r\n24.Bd5 \tRbe8 \r\n25.Rd4 \tNe6 \r\n26.Rd2 \tg6!  \r\n\r\nI need to set my kingside pawns in motion to apply maximum pressure against 9K’s passive position. As a prelude to that plan it makes sense to first improve the position of my king. Kings can often play a very useful supporting role in the middlegame.",
        "27. Ra4 Kg7 28. Rd1 Re7 29. Rb4 g5": "The pawns are starting to rumble and there is little that 9K can do to ease the pressure.",
        "30. Bc6": "The alternative 30 Bxe6 R7xe6 does not help White at all. ",
        "30... Qg6 31. Qb2": "Trading queens with 31 Qxg6  Kxg6 hardly eases the pressure. I can improve my position at will while White has almost no prospects of creating counter-play. By keeping queens on the board, I must be alert to a surprise check or unexpected penetration of the White queen. ",
        "31... f5 32. Qb1 Qf6 33. Bd5 f4 34. e4": "31. ...\tf5 \r\n32.Qb1 \tQf6 \r\n33.Bd5 \tf4! \r\n34.e4 \t...\r\n\r\nAfter 34 Bxe6 Qxe6 I will force a breakthrough on Black's e3 point. Now, beside the game continuation Nf8, I had a strong alternative in 34..f3, which cuts off support of the White e-pawn from his comrades and imposes a powerful, decisive cramp on White’s king position.",
        "34... Nf8 35. f3 h5 36. Qc2 Ng6 37. Qa2 Kh6 38. Qd2 Rg7 39. Qd4 g4 40. fxg4 Nh4": "34. ...\tNf8!\r\n35.f3 \th5 \r\n36.Qc2 \tNg6 \r\n37.Qa2 \tKh6 \r\n38.Qd2 \tRg7 \r\n39.Qd4 \tg4 \r\n40.fxg4 \tNh4  \r\n\r\nI was sorely tempted to play 40...hxg4, but could not find a clear way to make progress after the reply 41 g3! which freezes my knight.  So, I went in for another plan to slowly build up pressure on 9K’s weak g2 pawn.",
        "41. Rb2 Rxg4 42. Kh1 Ng6 43. Rf2 Qe7 44. Qd2 Reg5 45. Ra1 h4 46. c4": "41.Rb2 \tRxg4  \r\n42.Kh1 \tNg6 \r\n43.Rf2 \tQe7 \r\n44.Qd2 \tReg5 \r\n45.Ra1 \th4 \r\n46.c4!  \t...\r\n\r\nI have tightened the vice on the position, but 9K has hung in there, staving off a decisive breakthrough by putting his pieces on their best defensive squares. My main problem was finding a secure square for my king, a problem which I address with my next few moves.",
        "46... Qe5 47. Rc1 Kg7 48. Bc6 Qe7 49. Rcf1 Re5 50. Qc3 Kh6 51. Bd5 Reg5 52. Qb3 Qe5 53. Rd1": "I've built up my position to the maximum extent. I had foreseen the following sacrifice and judged that it had to be winning. I was later severely criticized for playing the sacrifice but it was a later error that cost me the game.  \r\n\r\nAlthough a rook is a very heavy investment, I felt that the sudden exposure of White’s king and the prospect of obtaining two connected and far advanced passed pawns hurtling down the board just had to be worth the high price.",
        "53... Rg4g3": "White must accept the sacrifice. If 54 Qb1 I could plant a rook into the heart of White’s position with the devastating 54…Re3.",
        "54. hxg3 hxg3 55. Ra2": "54.hxg3 \thxg3 \r\n55.Ra2\t...\r\n\r\nThe only alternative was 55 Rf3, when I had in mind 55…Rh5  56 Kg1 Rh2 57 Kf1 Qh5 58 Rd2 Rh1  59 Ke2 Rg1 and White is in serious difficulties.",
        "55... Rg4": "55. ...\tRg4? \r\n\r\nSometimes, the most obvious continuation is also the strongest; I think Black wins here after 55…Rh5  56 Kg1 Rh2! - excellent move - 57 Qf3 Kg5! -that's a key move. Now, 58 Kf1 Nh4 59 Qb3 f3! , putting more presure over Black's position, till it cracks, 60 gxf3 g2  61 Rxg2 Nxg2 and White cannot hold out much longer.",
        "56. Kg1 Qh5 57. Kf1 f3": "56.Kg1 \tQh5 \r\n57.Kf1 \tf3  \r\n\r\nThis appears to be very strong but 9K managed to find the only defense. I had a strong alternative in the pawn-grubbing sequence 57...Qh1  58 Ke2 Qxg2  59 Ke1 Qh1  60 Kd2 g2 61 e5! Qxd1  62 Qxd1 g1=Q and Black has the upper hand.",
        "58. Ke1 f2+": "58.Ke1! \tf2 ??  \r\n\r\nOh boy !!! This is not just a blunder - it is a crime. Black is very much in the game after 58...Rf4! 59 Kd2 fxg2 60 Qe3 Kg7! getting the king out of harm's way.",
        "59. Kd2 Rh4 60. Qe3+": "59.Kd2 \tRh4 \r\n60.Qe3 !  ...\r\n\r\n9K starts to take control over important squares on the kingside while also forcing my king to retreat. I was starting to feel that I had royally butched this game.",
        "60... Kg7 61. Rf1 Qe5 62. Kc2 Rh2 63. Qf3 Qf4": "60. ...\tKg7 \r\n61.Rf1! \tQe5 \r\n62.Kc2 \tRh2 \r\n63.Qf3 \tQf4\r\n\r\nI was hoping to win the g2 pawn. But this proves to be just a pipe-dream.",
        "64. e5": "64. e5! \t...\r\n\r\nThis pawn sac brings the bishop on d5 into the battle for control over g2. I could have resigned now but decided to punish myself. Sometimes it is very difficult to accept the inevitable.",
        "64... Qxf3 65. Bxf3 Nxe5 66. Bd5 Rh5 67. Ra3 Rg5 68. Kd2 Ng6 69. Re3 Ne5 70. Ke2 Kf6 71. Rh1 Ng6 72. Rh7": "64. ...\tQxf3 \r\n65.Bxf3 \tNxe5 \r\n66.Bd5 \tRh5 \r\n67.Ra3 \tRg5 \r\n68.Kd2 \tNg6 \r\n69.Re3 \tNe5 \r\n70.Ke2 \tKf6 \r\n71.Rh1 \tNg6 \r\n72.Rh7 \t\r\n(1-0)\r\n\r\nAnd here I resigned. A very bitter defeat for me after I had skillfully built up my position to a crushing advantage. After the game, numerous spectators and kibitzer remarked that I had “gone nuts” with my sacrifice but it was my follow-up to the sac that cost me the game. At least the battle was entertaining!"
    },
    "url": "https://gameknot.com/annotation.pl/larry-christiansen-chessmaster-9000-game-three-3?gm=2239",
    "gameName": "Larry Christiansen - Chessmaster 9000 game three (#3)",
    "players": "Chessmaster 9000  vs. Larry Christiansen ",
    "opening": "English (A22), Bellon gambit"
}