{
    "moves": {
        "1. e4": "Another game that I think I played well other than a few mistakes, but I have only been playing for 7 months at this time so mistakes are going to happen. Fell free to comment if you see something I did not. I will try to learn all the abbreviations for pieces and moves in the future but I will do my best for now. ",
        "1... e5 2. Nc3 a6 3. Nf3 Bd6 4. Bc4": "This is how I was opening up most of the time for awhile. I grew not  so fond of it because if I move my Q pawn to d3 I end up leaving my bishop open for a pawn attack. ",
        "4... h6 5. d4": "Try to a achieve what I think is the Sicilian defence with a pawn exchange. ",
        "5... Nc6 6. a3 Qf6 7. Be3 Nge7": "We are both loaded up for a big exchange. ",
        "8. d5": "Trying to force something to happen. I feel I have control of the center and want to see his reaction to my push. ",
        "8... Na7": "Don't think that was the best move, but then again I have only been playing for 8 or 9 months. His knight is useless for the time being. ",
        "9. Ne2 Ng6 10. Ng3": "Preparing for a King side attack. ",
        "10... Be7 11. Nf5 d6 12. Nxe7": "Maybe I should not have sacrificed, but I definitely feel more comfortable attacking.",
        "12... Qxe7 13. Qe2 Bd7 14. a4": "Defending his bishop from advancing to b5. Maybe not a very good move.  ",
        "14... Qf6 15. h3 O-O 16. g4": "After he castles I start to push my pawn attack. I should be able to castle in the next few moves and bring my other rook into the game.",
        "16... Nf4 17. Bxf4": "I did not like that knight coming down on me. I struggle sometimes with defending the knight attacks. Maybe I have not been playing long enough to fully understand the best ways to defend them. ",
        "17... Qxf4 18. Nd2 Nc8 19. O-O-O Ne7 20. Kb1 Ng6 21. f3 Qf6 22. h4 Nf4 23. Qf2": "I have made him a nice little home for his knight. I am not feeling very comfortable at this point. Even though his knight does not seem to pose a great threat right now.",
        "23... Ng6 24. Rdg1 Qf4 25. h5": "Now that my rook's are where I want them I will continue my push with the pawns.",
        "25... Ne7 26. Rh4": "Now I feel a little more comfortable attacking his queen.",
        "26... Qg5 27. f4 Qxf4": "My atatck is not looking so strong anymore, but I still feel I have the upperhand. ",
        "28. Qxf4 exf4 29. Rf1 b5 30. axb5 axb5 31. Bb3 Ra7 32. Rxf4 c6 33. dxc6 Bxc6 34. g5 Bd7 35. gxh6 gxh6": "Now I have him opened up. ",
        "36. Rf6 Ra6 37. e5": "I will need this pawn to back up my rook. I know he will be moving his King to g7. ",
        "37... Kg7": "There it is. ",
        "38. Rh2 Be6": "This was a big mistake. Now I get  a bishop for free. ",
        "39. Bxe6 fxe6": "Not what I thought he would do. Instead of giving me a bishop for free he gave me his rook in 2 moves.",
        "40. Rg2+ Kh7 41. Rxf8 Nf5 42. Rg6 dxe5 43. Rgf6": "His next move was the ending. I guess he overlooked what was coming. ",
        "43... Nd4": "Big mistake. ",
        "44. Rf6f7#": ""
    },
    "url": "https://gameknot.com/annotation.pl/larsof54s-ultra-fast-players-81?gm=18475",
    "gameName": "larsof54's ultra-fast players #81",
    "players": "rtaylor7796 (1209) vs. someone (1520)",
    "opening": "Vienna game (C25)"
}