{
    "moves": {
        "1. d4 f5": "This is the first move of the Dutch Defence, a bold defense for Black.",
        "2. e4": "This is known as the Staunton Gambit, a pawn sacrifice used by Howard Staunton on a regular basis.",
        "2... fxe4 3. Nc3 Nf6 4. Bg5 e6": "4. ... Nc6 is more common these days. White can now win back the pawn.",
        "5. Nxe4 Be7 6. Bxf6 Bxf6 7. Nf3 O-O 8. Bd3 b6": "This is a fairly balanced position, even if Black's kingside is lacking in defenders. Note that White's two knights and bishop are geared towards the general direction of the Black king.",
        "9. Ne5": "Not the best move. Black can simply play 9. ... Bxe5 to get rid of the attacking knight. After 10. dxe5 Nc6, White can play 11. Qh5, but Black then has 11. ... Rf5 and is reasonably safe.",
        "9... Bb7 10. Qh5 Qe7": "This was the opportunity for Black to stay in the game. 10. ... Bxe5 would have been better, and if 11. Ng5 then 11. ... h6 and Black has a good game ahead of him. It must be noted that while for some, most likely those who haven't seen this game before, a checkmate anytime soon doesn't seem to exist unless Black really messes things up. White has a variety of responses. 11. Nxf6+ is good, but Black can reply 11. ... gxf6. 11. Ng5 receives the response of 11. ... g6, and 11. Nd6 is followed by 11. ... g6 12. Nxg6 Qxd6 13. Nxf8 Kxf8, which is fine for Black. But Lasker found another, much better move.",
        "11. Qxh7+": "As Saunders comments, 'In calculating all the candidate moves by the minor pieces, it was easy for Black to overlook this more drastic blow. Which of us in his shoes would have expected White to unleash such a fiendish sacrifice?'",
        "11... Kxh7 12. Nxf6+": "Black can't capture the knight as his king is checked by the bishop as well. He could play 12. ... Kh8, but then White plays 13. Ng6#. Black has only one other option.",
        "12... Kh6 13. Neg4+ Kg5 14. h4+ Kf4": "Black's king is being forced away from his territory and into White's own.",
        "15. g3+ Kf3 16. Be2+": "This isn't the quickest way to checkmate Black, as both 16. O-O and 16. Kf1 set up an unstoppable mate on the next move with 17. Nh2#. However, Lasker's path to victory is much more pleasing to the eye.",
        "16... Kg2 17. Rh2+ Kg1 18. Kd2#": "A strange choice of move by Lasker, as 18. O-O would have been so much more beautiful and dramatic. However, his queen sacrifice earlier in the game and the subsequent moves are no less impressive. According to Lasker himself, Thomas was very gracious in defeat, and, to be honest, that's the name of the game. To appreciate that it is only a game, however magnificent it is. If you wish to leave me a suggestion for an annotated game, or want to leave me feedback, please drop me a message. Your help is appreciated."
    },
    "url": "https://gameknot.com/annotation.pl/lasker-thomas-london-1912?gm=34341",
    "gameName": "Lasker-Thomas, London 1912",
    "players": "Eduard Lasker (no rating) vs. George Thomas (no rating)",
    "opening": "Dutch (A83), Staunton gambit, Staunton's line"
}