{
    "moves": {
        "1. e4": "I've annotated a few of my Chinese Dragon outings already and this one will be the last one, I think. The Dragon isn't in my regular repertoire but after this experience I might give it a future look, my results with it were quite satisfactory. And on the whole, the defense isn't really a defense, it's more of a full-blown attack with Black.",
        "1... c5 2. Nf3 d6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 g6": "The Dragon got its name after Black's K-side pawn structure which resembles the tail of a dragon. It's only suiting that the people which first introduced the legendary beast into their folklore get to attach their country's name to a line of the defense.",
        "6. Be3 Bg7 7. f3 O-O 8. Qd2 Nc6 9. Bc4": "9. 0-0-0 is the reason why I'm hesitant to play this opening as Black. It has overshadowed the old main line, the Yugoslav attack, in modern practice and for good reason. White has several promising lines in which he can put the squeeze on Black's position without allowing the standard counter-play. But I digress.",
        "9... Bd7 10. O-O-O Rb8": "The move that gave new life to the Dragon in the Yugoslav attack. The first serious analysis published on it was done by Luc Henris, although the move itself is much older than that but it wasn't very prominent until Black players started to have serious problems in the more analyzed lines with 10...Rc8 and 10...Qa5.",
        "11. Bb3": "The most elastic move by White and so far considered the best theoretical reply.",
        "11... Na5": "11...Ne5 is also an option but is just a little bit slower. Also it's a less secure square since after a possible immediate f4 push by White, Nc4 isn't possible.",
        "12. Bh6": "Perhaps 12. Kb1 was safer. White makes no defensive moves and goes on pure offense.",
        "12... Bxh6": "Without h4 having been played, this is a very good reply. White still needs a few more moves to get the attack going.",
        "13. Qxh6 b5": "But so does Black. This is the point behind Black's tenth move. The c-file is a little less useful for the attack than the b-file. Combined with a possible pawn on c4, White will have more trouble defending b2, compared to c2. The drawback is that it takes more time to execute this plan, as opposed to the standard plan in the classical main lines.",
        "14. h4": "Going for the h-file. Very straightforward play by White.",
        "14... b4": "But not necessarily best. I missed a much better course of action that started with the move 14...e5. After 15. Nde2 Nxb3+ 16. axb3 b4 17. Nd5 Nxd5 18. Rxd5 Be6 19. h5 Qc7 20. Rd3 Rfc8 and White's attack has stalled and Black's just about to start. The move I played gives about equal chances.",
        "15. Nd5 e5": "Less effective now as demonstrated by White's next.",
        "16. Nf5 Bxf5 17. exf5 Nxb3+ 18. axb3 Nxd5": "After 19. Rxd5 the position is about equal. White has some pressure against my King but I can defend quite well. Instead White got attacking ideas and played more daringly. Much to my surprise and delight.",
        "19. fxg6": "Hold on, what's this? You didn't want my Knight?",
        "19... Nf6": "I guess I'll retreat it now.",
        "20. gxh7+ Kh8 21. Rh3": "White has some compensation but it's clearly not enough.",
        "21... Nxh7 22. Rxd6 Qa5": "White has two pawns for the minus piece and a shadow of an attack. I still need to be careful. Luckily, White's King isn't sleeping in a bed of roses.",
        "23. Kb1 Rfg8 24. Rf6": "24. g4 looks like more sturdy. I guess White only has eyes for my King.",
        "24... Rxg2": "All of a sudden, it's White who's under attack. A simple back-rank mate is threatened.",
        "25. Rh1 Rbg8": "Continuing with the threat.",
        "26. Rc1 Qd5": "I have to admit I love a central Queen. It's just such a fitting place for such a powerful piece. ",
        "27. Rf5": "Trying to play 28. Rh5",
        "27... Rxc2": "But there is no more time for that. The Rook on f5 is loose and I should pick it up after this sacrifice.",
        "28. Kxc2 Rc8+ 29. Kb1 Qd3+ 30. Rc2": "30. Ka2 was the slow way to die. ",
        "30... Rxc2 31. Rh5": "White gets the tempo to play his intended move.",
        "31... Rc5+": "But I have mate in two. White resigned."
    },
    "url": "https://gameknot.com/annotation.pl/last-instalment-of-the-chinese-dragon?gm=29458",
    "gameName": "Last instalment of the Chinese Dragon",
    "players": "malik_ibn_harun (1665) vs. nyctalop (2028)",
    "opening": "Sicilian (B78), dragon, Yugoslav attack, 10.O-O-O"
}