{
    "moves": {
        "1. e4": "Here's another exciting game in the Latvian Gambit, this time the Svedenborg Variation, characterized by 3.Bc4 and 4...d5, where White has a stronger-than-usual attack at the very beginning, and despite the line being heavily analyzed, the position is very sharp and frequently unclear. This game features a king hunt and a very strong attack, and showcases what happens in this opening when Black has trouble getting his light-square Bishop into play.",
        "1... e5 2. Nf3 f5": "?! The key move of the Latvian Gambit. Black gives up a pawn (and usually more), inviting White to trash the Black kingside in exchange for open files and a potential lead in development.",
        "3. Bc4": "This is a particularly aggressive line for White to take. Like most of the other lines in the Latvian besides 3. Nxe5, this move's merit has been heavily disputed (and extensively analyzed).",
        "3... fxe4": "Kicking the Knight, inviting it to e5 for a threat on f7.",
        "4. Nxe5": "White accepts the generous offer, threatening a fork on f7. Black doesn't seem to have any compensation for his risky opening as yet.",
        "4... d5": "The more common line is 4...Qg5 5. d4 Qxg2 6. Qh5+ g6 7. Bf7+ Kd8 8. Bxg6 Qxh1+ 9. Ke2 Qxc1 10. Nf7+, but I think 4...d5 is stronger for Black.",
        "5. Qh5+ g6 6. Nxg6 Nf6": "6...hxg6 is a playable, but less common, alternative. ",
        "7. Qh4": "I can't find any literature for this move. More standard is 7. Qe5+ Be7 8. Bb5+ c6 9. Nxe7 Qxe7 10. Qxe7+ Kxe7 11. Be2 and White is a pawn up but will lag considerably in development.",
        "7... Rg8": "Unpinning the h-pawn, but more importantly, moving the Rook to the half-open g-file. ",
        "8. Nxf8": "This is probably the best play here, as White gobbles more material before his own pieces begin falling.",
        "8... Rg4": "?! Black continues to postpone taking White pieces, opting for a much more aggressive stance and in fact driving the White Queen forward to a defense of the f8 Knight. 8...Rxg2 is probably reasonable here as well, and perhaps better as it leaves g4 open for the Black Knight.",
        "9. Qh6": "White defends f8, but he no longer pins the Black Knight to the Queen, allowing ...Rxg2 followed by ...Ng4, threatening a dangerous attack focused at f2.",
        "9... Rxg2": "?! Black is planning 10. Nxh7 Ng4 11. Qf4 Rxf2 12. Qxf2 Nxf2 13. Kxf2 Qh4+, winning back some material and drawing the WK into the open, or if White is feeling less cooperative, a few variations on a king hunt are possible, with White chasing the BK to his queenside but unable to quite finish him off (for example, 11. Qg6+ Ke7 12. Qg7+ Kd6 13. Qf8+ Qxf8 14. Nxf8 dxc4 or 14...Bf5 and Black has decent compensation for his material).",
        "10. Nxh7 Ng4 11. Qf8+ Kd7 12. Qf7+ Kc6 13. Nc3": "! Piling pressure on the indefensible d-pawn. 13...dxc4 would be ill-advised, as it exposes Black to 14. Qxc4+ Kd6 or 14...Kd7 and White can chase the BK back across the board and trap him in the corner with his Queen and Knights.",
        "13... Na6": "The only way Black is getting out of this is if he gets some more pieces available for combat. With this move Black invites 14. Bb5+ Kd6 15. Qxd5+ Ke7, hoping to get his Bishop into play with tempo as soon as he gets a spare move, and then allowing his Queen and Rook to enter the fight and return some pressure against the White King.",
        "14. Bxd5+": "Not quite as strong as 14.Bb5+, I think, but certainly still good. White seeks to corner Black's King using his Knight, Bishop, and a-pawn (eg 14...Kb6 15.a4 Rxf2 16.Qg6+ Ka5 17.b4+ Kxb4 18.Rb1+ Kc5 19.Rb5+ Kd4 20.Qxe4#).",
        "14... Kb6 15. a4 Nb4": "This blocks b2-b4, making a5 a \"safe\" hiding place, and opens space for the Black King on a6 in the event of 16.a5+.",
        "16. a5+": "White continues to press the assault, making Black choose between claustrophobia on a6 and exposure on c5.",
        "16... Ka6": "This is much safer than 16...Kc5 in my opinion. The BK may have to retreat all the way to b8, but at least he'll be safe there.",
        "17. Bxe4": "Threatening Qc4+ and mate to follow.",
        "17... Rxf2": "?? Black badly underestimates White's attacking chances here and pays the price swiftly. Much better for Black was 17...Qd4, shutting the WQ off from c4 and legitimizing his own attack.",
        "18. Qc4+ b5 19. Qxb5#": "1-0. That's all there is! The early development of the White light-square Bishop and Black's inability to get his pieces mobilized (coupled with a few questionable moves) prevented the aggressive counterplay Black so desperately needs in this opening, leading to a painful demise for the harried Black King. Many thanks to invinlee85 for the game! Comments on the analysis or the game itself are much appreciated, and if you leave a low rating, please comment to tell me what I can improve! Thanks for reading!"
    },
    "url": "https://gameknot.com/annotation.pl/latvian-gambit-4?gm=45063",
    "gameName": "Latvian Gambit 4",
    "players": "irvinlee85 (1600) vs. bwaa (1629)",
    "opening": "Latvian (C40), Polerio variation"
}