{
    "moves": {
        "1. e4 c6 2. d4 d5": "The caro-kann is centrally a battle for the middle. For white the winning ideas always involve controlling d4 and e5. The chief advantage obtained from controlling d4 and e5 is space and a usually superior endgame.\nStrategically, white wants to cement his central pawn advantage-->exchange pieces--> and finally head into a slightly better rook pawn ending. For black the winning ideas involve controlling d5 and e4. The strategic ideas for black are to 1. exchange LSB eliminating the bishop pair advantage 2. undermine whites control of e5 with ...c5, ...f6 or fighting for direct control of e5 with nd7, Qc7 and Bd6. If black can win the e-pawn then white is nothing better than a draw. In the end what black hopes white will do is attack without adequent preparation and break himself against the rock solid black defence. ",
        "3. e5": "White pushes his pawn to e5 and therefore has guaranteed himself an enduring space advantage. The drawback of e5 is that white can no longer put knight on there, which is the most flexible option. Also in my opinion, 3. e5 poses no real threat to black since he can easily equalize by undermining white's center with ...c5 or ...f6. It is better to allow black to take on e4 and then recapture with Nxe4 putting a knight in the centre. ",
        "3... Bf5": "The real advantage of the caro-kann is that black's LSB actually has a destiny to fullfill. ",
        "4. Bd3": "Not so good for white since 4. ...BxB 5. Qxd3 Nd7 works out well for black. In general white should avoid the exchange of the LSB because the exchange of the LSB without a positional concession by black is one of his major strategic goals. ",
        "4... Qd7": "?? just plain stupid as d7 belongs to the knight. Because white has played e5 it is impossible for black to setup his dream position of Nd7,Qc7 and Bd6. However, the next best thing is Nd7, Qc7 and Be7\n ",
        "5. Qf3": "I can understand the idea of attacking f5 twice but after 5. ...Bxd3 6. Qxd3 black is just slight worse. Better was 5. Ne2 or Nf3 which prepares for castling and develops the knight. I like Ne2 because of it's flexiblity i.e defending d4 and still allowing for f4",
        "5... Bxd3 6. Qxd3": "black stands slightly worse but he has gained an important tempo after the exchange. All things considered the bishop exchange on d3 is a strategic victory for black since he has traded his bad bishop for whites good one without having to play the concessional weakness of ...h6",
        "6... e6": "closing the center and threatening the freeing ...c5",
        "7. Nf3": "It is possible that 7. Be3 is better since ...c5 8.dxc5 Nc6 9. Nf3 looks good for white",
        "7... c5": "undermining e5 black's most principled counterattack. ",
        "8. dxc5": "?? not good the most important theme in whites caro-kann plans is the control of e5. This move is counter caro-kann since it weakens e5 and allows black to easily play against e5. Better was 8.Be3",
        "8... Nc6": "deferring Bxc5 since 9.BE3 can gain a tempo off of black since he is obligated to retreat the bishop to e7. Black does not want to play 9...BxB since the DSB usaully is missed more by black then white. Also the DSB plays an important role in the fight for e5 and counterattacking chances on the king side. ",
        "9. Nc3": "if white tries to keep the pawn via Be3 then 9. ...Ne7 threatening ...Nf5 is good for black. It was GM Kornchoni who demonstrated very well how black should use his knights to harass white's DSB if he decides to develop it to f4 or e3",
        "9... Bxc5": "Regaining the pawn",
        "10. O-O": "the opening phase is just about complete and black can be happy with what he has achieved he has managed to increase his control for the important d5 square while at the same time denying white the immediate use of e5 and white has nothing to attack and his big center has been weakened considerably. From here black's tactical ideas are fight for control of d5 and d4 with ...d4 and Ne7-Nf5. Also black has opportunities on the c-file with ...Rc8.\n\nWhite's plan should be to support e5 and exchange pieces in order to increase his fleeting space advantage.",
        "10... Nge7": "a very flexible move that is heading to the nice outpost of f5 or g6 attacking e5.",
        "11. Ng5": "?? This is exactly what black was hoping white would do and it is white's first real blunder of the game. I am thinking that he played Ng5 to attack h7 but e5 is now hanging. To be frank the real mistake was beginning a flank attack while the center is unstable. Better is Re1, Bd2 or Be3",
        "11... Nxe5": "! a great move for two reasons. #1. gains tempo by forcing white to move his queen for the third time and #2. It completely eliminates whites center. FYI usaully if black manages to capture the e pawn it means that white's winning chances are over. ",
        "12. Qg3": "keeping the queen active but not free from harassment. Better most likely is 12. Qe2. when 12. ...h6 is met with 13. Nf3 fighting for e5. ",
        "12... Bd6": "also good is 12. ...Nf5 with a massive attack. But this is much better because it ensures that e5 never can fall back into enemy hands. ",
        "13. Bf4": "defending against the discover check attack on the queen and developing a piece. However, 13. f4 would have been a more solid defense. ",
        "13... h6": "playing the immedaite ...Nf5 only allows white to walking out of the frying pan since h3 is still available to the queen",
        "14. Nh3": "?? loses the queen. The only way was 14. Nf3 Nf5 15. Qh3",
        "14... Nf5 15. Bxe5 Nxg3 16. Bxg3 Bxg3": "with the material advantage now secure simplifying and heading straight into a won endgame.",
        "17. hxg3 d4": "kick starting the pawn roll. Actually from here white defends really well ",
        "18. Ne4 e5": "?! prehaps 18. ...Qc6 would have been more accurate",
        "19. Nc5 Qc6 20. Nd3 f6": "even though it does not matter much the consquence of 18. ...e5 is that it has allowed white to improve the position of one of his knights",
        "21. Nb4 Qc4 22. c3": "and excellent move that both defends and attacks",
        "22... a5 23. Nc2 g5": "threatening to win the poor knight on h3 with ...g4",
        "24. f4 dxc3 25. b3": "?? it is never a good idea to allow your opponent to have such a powerful passed pawn. Better is 25.bxc6 Qxc6 26. Rac1",
        "25... Qc5+ 26. Kh2": "if 26. Nf2 interposing then 26. ...e4! is winning",
        "26... exf4 27. gxf4": "If 27. Re1 then ...Kf7 28. gxf4 g4 29. Nf2 Qxf2 is misery for white",
        "27... g4 28. Rae1+ Kf7 29. Nf2 g3+": "the fastest way to win I believe since ...h5 allows white to keep lines to his king closed for much longer than the game line",
        "30. Kxg3 Rhg8+": "Rag8+ makes more sense doesn't it?",
        "31. Ng4 h5 32. Nce3 c2 33. Kh4 hxg4 34. Re2 Rae8": "threatening 35. ...Rxd3 36. Rxd3 Qxd3 37. Rf3 c1(queen) with mate in 1",
        "35. Nxg4 Rg6 36. Rxe8 Kxe8 37. f5 Rxg4+": "Last exchange of the game where the last of white's pieces are gone.\n",
        "38. Kxg4 Qd4+ 39. Kf3 Qd1+": "White resigns from a good fight. "
    },
    "url": "https://gameknot.com/annotation.pl/law-breakers-shall-be-punished?gm=42825",
    "gameName": "Law breakers shall  be punished",
    "players": "runner55 (1140) vs. elyhim (2257)",
    "opening": "Caro-Kann (B12), advance, Short variation"
}