{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6": "I start played and decide to use normal.",
        "3. d4": "The white decide to move d4.  ",
        "3... exd4": "I can attach the exd4.  But the white queen will attach me, or else. ",
        "4. Nxd4": "Also white knight can attach Nxd4. ",
        "4... Bc5": "I move bc5.  But as you see the white plan to attach black knight, but I attach white knight.\r\n",
        "5. Nxc6 bxc6 6. Qf3": "So the white queen decide to move Qf3. ",
        "6... Nf6": "I can move knight F6.  Because I protect it.",
        "7. Bc4 d5": "I decided that I moved d5 to help to keep protect my chess game.",
        "8. exd5": "So, white can attach exd5 so far.  I can attach cxd5 or I can different idea a move whatever I want.  ",
        "8... O-O 9. Bg5": "So, white move to bg5 again. ",
        "9... Qe8+": "But I move queen to check by Qe8 to check it.  ",
        "10. Be2": "Good protect.",
        "10... Bg4": "I decide to move bg4, because I plan to get move, because if queen want to attach, but I attach knight if it will happen.  ",
        "11. Nd2 Bxf3": "ohhhhhhhh tooo late!  You're not pay attention.  I attach the queen!  ",
        "12. Nxf3": "Knight attach black Knight.  Not bad.  I not afraid.  I happy to take care of my queen. :D",
        "12... Qe4 13. Bxf6": "White try to attach Bxf6, but I attach gxf6 next.",
        "13... gxf6 14. dxc6": "white try to attach dxc6.  But I move root.",
        "14... Rfe8 15. O-O-O": "White fear and to move 0-0-0.  ",
        "15... Qxe2": "I move queen the Qxe2.",
        "16. Rhe1": "White try to keep away from my queen, well too late.  ",
        "16... Qxf2": "I move anywhere I keep away from root.",
        "17. Rxe8+": "Root try to move rxe8 to check it, but I attach the white root.  There is no available to try to attach my king.  But not.",
        "17... Rxe8 18. a3": "white try to move and harder.  But white can't make up idea.",
        "18... Qxg2": "I decide to attach move to Qxg2 again.",
        "19. b4": "again same thing.",
        "19... Qxf3": "again I attach.",
        "20. bxc5": "white try attach, but I warn to see that Queen is powerful!  ",
        "20... Qxa3+ 21. Kb1": "King try to move.  But can't. ",
        "21... Rb8#": "I checkmate.  Remember keep watch the queen vs. queen is very important."
    },
    "url": "https://gameknot.com/annotation.pl/league-division-e3?gm=10519",
    "gameName": "League division E3",
    "players": "corvo (1145) vs. scottw (942)",
    "opening": "Scotch game (C45)"
}