{
    "moves": {
        "1. e4": "In the past I have had trouble against the kings gambit, so it was good to get this win. Although technically it was on time-out, the match was effectively over.\nThe game highlights the need to use moves effectively when material down, otherwise any positional or attacking advantage can be eroded",
        "1... e5 2. f4 exf4": "Kings gambit accepted",
        "3. Nf3 g5": "I have been well beaten using this line in other games, but have learnt from past mistakes.",
        "4. Bc4 Bg7": "Prevents Ne5 attacking the weak f7 square",
        "5. O-O d6 6. d4": "Grabbing the centre powerfully",
        "6... h6": "Securing the flank, and unpinning the queen from protection of the g5 pawn. With whites control of the centre, I need to develop quickly, and hopefully castle queenside since the kingside is now weak",
        "7. Nc3": "Aiming his knight at the d5 square. Another strong move is c3, opening up lines for his queen.",
        "7... Nc6": "Developing, and pressuring his d4 pawn.",
        "8. Bb5": "Usually moving the same piece twice in the opening should be avoided, but guidelines should be followed in light of the position. Nothing else is any better, and this move does present a threat and reinforces whites pressure in the centre.",
        "8... Bd7": "Developing another piece and moving closer to being able to castle if things get hairy",
        "9. e5": "The computer prefers d5 or Qd3, but neither are particularly exciting. And given that white is a pawn down, he needn't worry about material, and should look to open lines",
        "9... dxe5": "Allowing the pawn to capture exd6 would open lines in front of my king, and the move d5 simply loses the pawn. So I reason this is my best chance of keeping whites major pieces away from my king",
        "10. Bxc6": "Moving to recapture the pawn on e5, aswell as removing a queenside defender should I choose to castle that way. Re1 is stronger since the knights protection of the pawn can be removed",
        "10... Bxc6 11. d5": "A weak move, I suspect white forgot his original plan or made this move without considering the position (ie part of a combination worked out earlier and not rethought). I am forced to move the bishop, but the position remains closed which is to my advantage",
        "11... Bd7 12. Re1": "Finally plays the rook move, but with the bishop unpinned and sitting where it is I have a defense",
        "12... Bg4": "Nulls the threat of the knight",
        "13. Qd3": "Removes the pin, once again threatening Nxe5",
        "13... Bxf3 14. Qxf3 Qd6": "Defending the backwards pawn, and blocking the white d-pawn. Another possibility is an immediate f5, but I didn't want to expose my king too much or offer any counterplay",
        "15. Kh1 Ne7": "The knight can be routed to g6 to defend the pawn, and from it's current position puts pressure on the white d-pawn",
        "16. Nb5": "A largely meaningless move, although it does serve to complicate the position after d6, although I decided there was little threat from this move.\nAnother option is moving the bishop to d2 and unleashing the other rook",
        "16... Qb6 17. a4 a6 18. Na3": "Aiming to create counterplay on the queenside, starting with c4. Could possibly use the pawns in a battering ram with rook and knight in support",
        "18... O-O-O": "I missed an opportunity to pick up another pawn with Qa5 attacking pawn and rook, then if Re4, f5 forces a retreat. I also allowed white to win back a pawn since now both bishop and knight are undefended, so Bxf4 wins at least the pawn back as gxf4, Qg4  wins the bishop",
        "19. c4": "Defends the pawn",
        "19... Rhe8": "If white tries to come through my queenside, I'll counter by thrusting my e-pawn down the centre. My kingside pawns now look very threatening in comparison to whites.",
        "20. h4": "With this blunder whites position has fallen apart. My queen suddenly comes into play with checkmate threats. White propably considered gxh4 then Qg4  winning back the pawn. Another possibility is Qh5 attempting to undermine the pawns",
        "20... f5": "I liked this move from the moment I saw it. Even if I had found a refutation I might have played it anyway for the elegent way it creates a very aggressive blunt attack. The attention on the board has switched to the kingside, and my pawns now looking to batter down the white king",
        "21. hxg5": "Opening up the h-file so I can attack his king; given the queen covers the escape route this should make winning a formality",
        "21... hxg5 22. g3 Reh8+": "Keeping the g-pawn on the board limits the number of escape squares for the white king",
        "23. Kg2 e4": "Opening up lines for the bishop to join the attack",
        "24. Qf2 Bd4": "Missed the quick win with Rh2  winning the queen then mating the next move",
        "25. Qf1 f3+": "Only giving up the queen prevents checkmate now. Qh6 would have forced mate in 3, but the match is over regardless"
    },
    "url": "https://gameknot.com/annotation.pl/league-division-d1?gm=21044",
    "gameName": "League division D1",
    "players": "claudiocordeiro (1626) vs. alloutwin (1620)",
    "opening": "KGA (C38), Hanstein gambit"
}