{
    "moves": {
        "1. c4": "I won this game with a bishop sac on the kingside and a devastating fork.  I begin with the English Opening trying to get my opponent into unfamiliar lines.",
        "1... e5": "This is the King's English",
        "2. g3": "Preparing to fianchetto my bishop to take advantage of the light squares in the center.",
        "2... Nc6 3. Nc3": "I delay fianchetto to develop my c knight and prevent e4",
        "3... Bc5": "It is fairly common in the King's English to attack the f2 square early.",
        "4. Bg2": "Now I have control of d5.",
        "4... Nf6": "He develops his knight",
        "5. Nf3": "I develop my f knight for castling. I am not worried about e4 here because Ng5 wins the e4 pawn.",
        "5... d5": "I have lost control of d5 with the knight move and he takes advantage of this",
        "6. cxd5 Nxd5 7. d3": "Preparing for e4 and attacking the centralized knight.",
        "7... O-O 8. O-O Be6": "black tries to hold on to d5 with this move, now all of his minor pieces are developed.",
        "9. Ng5": "attacking the bishop and threatening to double up his pawns on the e file",
        "9... Nde7": "dont understand this move.",
        "10. Nxe6": "I take the bishop and double up his pawns on the e-file.",
        "10... fxe6 11. Bg5": "I develop my dsb and pin his knight to his queen",
        "11... Rf7": "Better to move the queen than make a risky move with taking the rook off the back rank.",
        "12. e3": "taking pressure off of f2",
        "12... h6": "He attacks my bishop and as you can see on the next move I sac it to blow away his kingside.  I know by analysing that I will get equal compensation for the bishop back.",
        "13. Bxh6": "The bishop sac which defined the character of this game.",
        "13... gxh6 14. Qg4+": "I immediately exploit his destroyed kingside and win compensation for the bishop.",
        "14... Rg7 15. Qxe6+": "He forgot about his pawn on e6.",
        "15... Kh8 16. Qxh6+": "Now we are equal in material and Ive destroyed his kingside, ive just got to get more pieces into the attack.",
        "16... Rh7 17. Qf6+ Kg8 18. Ne4": "I get my knight into play attacking his bishop while joining the Queen in the attack.",
        "18... Bb6 19. Ng5": "Attacking his rook now he cant use it to attack my queen.",
        "19... Rg7 20. Qe6+ Kf8 21. Qf6+ Kg8": "I need another piece in the attack so I decide to use my fianchettoed bishop",
        "22. Be4 Kh8": "black should not be worried by 23. Bh7+ because RxB NxR KxR and things are evened out.  Instead he makes a whale of a blunder with Kh8 as I fork the Queen and the King",
        "23. Nf7+": "Black resigned here."
    },
    "url": "https://gameknot.com/annotation.pl/league-division-d2?gm=29764",
    "gameName": "League division D2",
    "players": "dungeonking (1278) vs. seoulman (1303)",
    "opening": "English opening (A20)"
}