{
    "moves": {
        "1. Nf3 d6 2. d4 Nf6 3. c4 g6 4. Nc3 c6": "computer gives this as an inaccuracy, giving withe a slight advantage. I did not see it.",
        "5. e4 Bg7 6. Be2 Nbd7": "black plays the hedgehog for a while. Don't be mistaken: he will attack soon.",
        "7. O-O e5 8. dxe5": "computer gives an advantage of 1.25 to white, here... Well... it is a computer...",
        "8... dxe5 9. Qc2 O-O 10. Rd1 Qe7 11. Bg5": "though white seems better developped, there is nothing clearly dangerous till now.\nThe computer still counts a slight advantage to whithe, though unconclusive.",
        "11... h6 12. Bh4": "unaccuracy, according to the computer...",
        "12... g5 13. Bg3": "I intended to be here. I like that kind of movements with white.",
        "13... Nh5": "equalizing move.",
        "14. Bxe5": "had to be played before Nxe5, because if not Nxg3 wins. But the computer shows us a combination that leads to a splendid 2.2 advantage for black... ",
        "14... Bxe5": "this is consider as a mistake for black. Black should have played Nxe5, then after 15. Nxe5 Qxe5 16 Bxh5 is punished by ... g4!",
        "15. Nxe5": "discovering attack on the knight",
        "15... Nxe5 16. Bxh5 Nxc4": "the simplification is over. Let's take a look at the result, that both players had previewed (i guess). White may appear as better coordinated as his bishop, his queen and potentially his other pieces are well oriented. But there is no direct threats on black and it just needs one move (the c8 bishop to be almost completely developped.\nComputer says white has a slight advantage.",
        "17. b3 Ne5": "i have been surprised by this move, expecting Nd6, thinking it was more efficient",
        "18. Be2": "finally i considered the bishop there worthless and there was a clear threat to neutralized it by g4.",
        "18... Be6 19. Rd2 Rad8 20. Rad1": "all secured... everything could be a draw. Computer confirms the advantage is ridiculous.",
        "20... Kg7 21. h3 b5": "an attempt to create something.",
        "22. Rd2d4": "computer consider here as a draw.",
        "22... a5 23. Qd2": "another attempt.",
        "23... Rdc8": "leads to nothing for white. And all becomes dangerous for the d4-rook and for my knight.",
        "24. Qb2 f6": "avoiding the discovered attack on the diagonal.",
        "25. Qc1": "i am losing tempos... I already thought about the draw, here. Very slight advantage to black, according to computer.",
        "25... Rfd8 26. Rd4xd8 Rxd8 27. Rxd8 Qxd8 28. f3": "I thing I proposed the draw here. Computer saws that move as an Inaccuracy",
        "28... Qd4+": "he refused.",
        "29. Kf1 Ng6 30. Nd1 Ne5": "computer says this is an inaccuracy, giving back the draw situation. He prefers Nf4. So did I: I expected Nf4 from black and was relieved with this move.",
        "31. Qc3 Qb6": "by refusing the exchange, he clearly wants to show he is better. And, actually, I thought that too...",
        "32. Qd2": "occupying the only clear way.",
        "32... c5": "preparing the battery to pass by.",
        "33. Ne3 a4": "computer considers this as an inaccuracy, because of 34 Nd5... that i didn't see...",
        "34. bxa4": "inaccuracy from white...",
        "34... bxa4": "i carfefully thought about everything here, but I have to admit I was scared to have lost something, and the c-pawn seemed like a potential winner.",
        "35. Qc2 Qb4 36. Nd5": "provoking the bishop, trying to gain a passed pawn too.",
        "36... Qd4 37. Qc3": "i will have my passed pawn, finally",
        "37... Bxd5 38. Qxd4 cxd4 39. exd5": "two passed pawn on the same column! interesting. Here I thought I was better for having the bishop. And the computer thinks the contrary, giving a slight advantage to black.",
        "39... f5": "he foresaw my own desire to play g3-f4... damn...",
        "40. Bb5": "the exact goal was to gain a tempo, but, actually, I think Ba6 was better, to occupy c8 after. According to the computer, this moves gave me back the draw.",
        "40... a3 41. Ke2 Kf6": "now the idea is to attract the black king as far as possible, to have the time to take the a and d-pawns and go back to protect the f-g-h pawns... dramatic...",
        "42. d6": "sacrificing",
        "42... f4": "overprotecting e3. Good idea, but... Maybe letting white to move faster on the side.",
        "43. Kd2 Ke6 44. d7": "hoping for Nxd7 45 Bxd7 Kxd7 and 46 Kd3, so White has the preeminence of king position. I think he proposed me the draw somewhere by now, but I intended to go further. Slight advantage to white, according to the computer.",
        "44... Ke7 45. Kc2 Kd8 46. Kb3": "attracting the d4-pawn on d3...",
        "46... d3 47. Kc3": "it worked. Advantage of 0.93 according to the computer.",
        "47... Kc7": "black here provoked the next 3 moves.",
        "48. d8=Q+ Kxd8 49. Bxd3 Kc7": "but chose here not to simplify. Good instinct: it would have been devastating.",
        "50. Bc2": "here white lost some tempos... ",
        "50... Kd6 51. Be4": "losing tempo: I should have played this previously...\nComputers indicates me the best way to play here:\n51.\tKb4 \tKd5 52. Kxa3 Kc5 53. Kb3 Nc4 54. Bd3\tNe3 55. a4\tNxg2 56. a5 Ne3 57. a6 Kb6 58. Be2 Ka7 59.\tBb5\tNf5 60. Kc3 Ne3",
        "51... Kc5 52. Kb3 Nc4 53. Bd3 Ne3 54. Kxa3 Nxg2": "black is now maybe more dangerous. I proposed the draw the next move, and he refused once again. The computer sees the position as a draw.",
        "55. Kb3 Ne3 56. Bg6": "Here, i think, was the only option to preserve the draw.",
        "56... Nc4 57. Ka4": "mistake, according to the computer, who plays Kc3",
        "57... Ne5 58. Bh5": "White had no other option here, again.",
        "58... Kd4": "black is tempted by the forced attack... Letting a-pawn in plain run.",
        "59. Kb5": "this is a small mistake, as if a black pawn arrives on f1, it is a check... I regretted not having played b4, though there was the potential Nd3+... The computer agrees with my remorse.",
        "59... Ke3": "actually, here i expected and feared g4... I think black would have won with that move. and the computer says so.",
        "60. a4 Nxf3": "i guess black expected White to take back here...",
        "61. a5": "but... no... I calculated that the knight has no possibility to stop my pawn, and all the moves black had to do would have lost too much time. I intended to sacrifice my bishop on the eventual 62. ... f3 63 Bxf3 and wins. The computer saw that too.",
        "61... Ne5": "I think here black is already lost.",
        "62. a6 g4": "but black had another plan... trying to make me lose another move. (f3 was better, according to the computer, who foresaw a more complicate ending)",
        "63. a7": "no way: a8=Q is very strong on the diagonal, now!",
        "63... f3 64. a8=Q f2 65. Qg2": "Hop! Queen blocks the pawn. the g-pawn is powerless, the knight is powerless... ",
        "65... Ke2": "only move, giving white another tempo, as the f-pawn is pinned.",
        "66. hxg4": "not Bxg4+, followed by Nxg4 hxg leading to a difficult ending.",
        "66... Ke1 67. Qe4+": "decisive.",
        "67... Kd2": "if Kf8, then Qxe5; if Kd1, then g5+",
        "68. Qf4+ Ke1": "hoping for repetition, I guess...",
        "69. Qe3+": "but crushed hopes here: there is no more possibility to avoid the loss of the horse.",
        "69... Kf1 70. Qxe5 Kg2 71. Qe2": "pinning again",
        "71... Kg1 72. Kc5": "and now, white simply bet on g-pawn promotion.",
        "72... f1=Q": "no choice...",
        "73. Qxf1+ Kxf1 74. Kd5 Kf2 75. Ke5 Kg3 76. Kf5 Kh4 77. Kg6": "there was no more option for black... He resigned."
    },
    "url": "https://gameknot.com/annotation.pl/league-division-d1?gm=38281",
    "gameName": "League division D1",
    "players": "thitho (1718) vs. combijack (1788)",
    "opening": "Reti opening (A04)"
}