{
    "moves": {
        "1. d4": "Hi everyone.  This is the first of two losses against chesstico.  In both of these I think my endgame technique was found lacking.  The purpose of the annotations is to ask the question: how?  So I may skip a bit of the earlier stages.",
        "1... e6 2. c4 d5 3. Nc3 Nf6": "QGD",
        "4. Bg5 Be7 5. Nf3 O-O 6. e3 b6 7. Bd3 Bb7 8. O-O Ne4 9. Bxe7 Qxe7 10. cxd5 Nxc3 11. bxc3 Bxd5 12. c4 Bb7 13. Qc2 h6 14. Ne5 Nd7 15. Nxd7 Qxd7 16. Be4 Bxe4 17. Qxe4 Rac8 18. Rad1 Rfd8 19. Rd2 c5 20. Rfd1 cxd4 21. Rd2xd4 Qe7 22. Rd4xd8+ Rxd8 23. Rxd8+ Qxd8": "So far the game has been fairly uninteresting: not many tactical melees but Black has the advantage of only two pawn islands vs White's three, including the isolani on c4.  I probably made a mistake in getting here ...",
        "24. g3 Qc7 25. Qd4 f6 26. f3 Kf7 27. e4 Ke7 28. Kf2 Qd6 29. Ke3 Qxd4+ 30. Kxd4": "Perhaps I shouldn't have allowed the Q swap here but I felt that the more advanced position of my king would give me an advantage.",
        "30... Kd6": "Black seizes the opposition.  Now who has the more pawn moves to either keep it or snatch it away?",
        "31. a3 a6 32. a4 e5+": "I think I should have tried to prevent this, if at all possible.  So perhaps I should have tried for f4 and e5 before advancing my a-pawn but I don't think I could actually have prevented it after 30.... Kd6",
        "33. Kc3": "Perhaps 33. Kd3 would have left me the opportunity to play Kc3 at a later stage.",
        "33... Kc5 34. h3 g6 35. f4 g5 36. fxg5": "I couldn't just let Black take on f4, so I had to either take on e5 or g5 or advance to f5.  I think that would have lead straight to a draw.  Taking on e5 would have left the smae configuration as taking on g5.",
        "36... fxg5 37. g4": "Again, I don't think it would have made any difference which pawn I moved: 37. h4 gxh4 38. gxh4 h5 and White's K has to cede ground to Black's K: 39. Ke3 Kb4 wins the a-pawn.  39. Kb3 Kd4 wins the e-pawn.  This seems to confirm that 33. Kc3 was the losing move.",
        "37... a5": "It's zugzwang."
    },
    "url": "https://gameknot.com/annotation.pl/league-division-d1-an-end-game-lesson?gm=25080",
    "gameName": "League division D1- an end-game lesson",
    "players": "rjacobs (1580) vs. chesstico (1723)",
    "opening": "Queen's pawn (A40), Keres defence"
}