{
    "moves": {
        "1. e4": "My traditional opening.",
        "1... c5": "I was expecting 1. e5. He played this instead. It's not usually a move I encounter, but doing things different can be advantageous. ",
        "2. Nc3 Nc6 3. Bb5": "A move I almost always make.",
        "3... Nd4": "Again, something I usually don't encounter, but he does put pressure on the bishop.",
        "4. Bd3": "I decide to get it out of there.",
        "4... d6 5. Nf3": "Putting pressure on the knight.",
        "5... Bg4": "He responds by putting big pressure on my f3 knight, thus putting pressure on my queen, for moving the knight was no longer a good option.",
        "6. Be2": "I give the knight more protection with this move. True, the g2 pawn already protected the knight, but it's best to be on the safe side here. Besides, I was getting ready to castle. If I instead played 6. h3 Bxf3 7.xf3, a door would be opened to my king if I castled king-side, so no matter what he played next, the outcome would not be negative for white.  ",
        "6... Nf6": "Black starts getting the other knight involved.",
        "7. O-O": "I castle a planned.",
        "7... e5 8. d3 h6 9. h3": "Now I attack black's bishop. Black's three options are Bxf3, Bh4, or Be6 (Bd7;Bc8).",
        "9... Bxf3": "Option #1.",
        "10. Bxf3 Be7": "I was actually expecting him to attack with his d4 knight, but he had other plans.",
        "11. Be3": "My plan was to eradicate the knight in exchange for my bishop.",
        "11... O-O": "I knew he was planning this when he moved his bishop.",
        "12. Bxd4 cxd4": "My plan went accordingly, although now I needed to move my knight.",
        "13. Nd5": "This actually wasn't planed, for I did not want to lose both knights. Nb5 may have been better.",
        "13... Nxd5": "I loose my knight anyway, for it was becoming a danger for black.",
        "14. exd5 Bg5": "I don't see what he's planning at this time.",
        "15. c3": "I wanted to give d5 pawn more protection, although the bishop already provided that, but I did not want en passant, so I let black decide the next move. ",
        "15... f5": "He left the pawn alone, which was actually not what I expected.",
        "16. c4": "I went on with my plan.",
        "16... g6 17. a3 f4 18. Bg4": "Just trying to do something.",
        "18... Re8 19. Qa4 Re7": "He knows I wouldn't attack his rook with that much protection, but he moved it like it was in danger, or either he's trying to get it in a certain position?",
        "20. Be6+": "Not much this move accomplishes other than threatening the king a little.",
        "20... Kh8 21. Qc2": "I decide to pull the queen back.",
        "21... Bh4 22. Bg4": "I do the same with the bishop.",
        "22... h5": "Now he forces me to pull it back further.",
        "23. Bf3 Re8": "I don't think he was trying to get his rook in a certain position.",
        "24. b3 Rc8 25. a4 a5 26. Kh2": "I want to attack the bishop, or at least drive it away.",
        "26... Rg8 27. g3 Bf6": "I took care of that piece...for now.",
        "28. h4 Qf8 29. gxf4": "I decide to do pawn wars.",
        "29... exf4 30. Be4": "This move didn't really accomplish anything.",
        "30... Bxh4": "I overlooked that. The h4 pawn was completely unprotected, thus the bishop was there to steal it. Only a slight disadvantage for white now.",
        "31. f3 Bf6 32. Rfg1": "I put extra pressure on the g6 pawn.",
        "32... g5": "Black counters the attack.",
        "33. Kh1": "When I'm not sure what other moves to make, I move my king into a corner. Maybe not the best thing to do.",
        "33... h4 34. Ra2 b6 35. Bf5": "I open the door between the two sides, and I attack the c8 rook, which he'll defend.",
        "35... Bg7": "Or not!!! He moves his bishop to g7 so the queen can attack the bishop, overlooking the danger his rook was in. This is hard to overlook really. On top of that, his g5 pawn is now unprotected from white's g1 rook.",
        "36. Bxc8": "So the rook goes as expected.",
        "36... Qxc8 37. Rxg5": "The pawn goes now as expected. White has a good advantage now. True, only +2, but being up a powerful piece, like a rook, can be key.",
        "37... Qh3+": "I did not see that coming. White's f3 pawn is gone.",
        "38. Qh2": "Unless black wants to trade queens.",
        "38... Qxf3+": "And he doesn't. White's advantage shrinks a little.",
        "39. Rgg2 h3": "This is a big issue, or so I thought, but I didn't realize that it wasn't at the time...",
        "40. Raf2": "What I didn't realize though, was how all the pieces were lined up and how each were playing their part. I didn't realize at the time how white's queen was lined up to black's king. Thus, the only piece standing in between the two was the h3 pawn, therefore, it could not attack the g2 rook. If the black king wasn't where it is now, like maybe f8, moving the other rook would of done no good, for then, 40. xg2+ 41. Rxg2 Qxd3 likely would of occurred. Now though, black now has to save his queen due to the move just made here.",
        "40... Qh5": "40. Qxd3? I was expecting that, but this move is probably much better. Now that black's queen protects his king, the h3 pawn can attack the g2 rook, but by now I had seen everything unfolding.",
        "41. Rg1": "I save the rook.",
        "41... f3": "I would of attacked that pawn, but he moved it to f3, thus it was protected by his queen, so attacking it was currently not an option.",
        "42. Rg3": "Interesting scenario...",
        "42... Be5": "Even more interesting now...",
        "43. Rxg8+": "...and I blew it! Yes this move will result in an even trade and it saves white's queen, but instead I should of played this sequence: 43. Rxh3 Bxh2 44. Rxh5+ Kg7 45. Kxh2. This sequence would of left white with a sizable advantage. I panicked though when I saw both my queen and rook were in danger. I didn't really blow it, but I missed an opportunity. ",
        "43... Kxg8 44. Qg1+": "I may have missed that opportunity, but I have another to take the f3 and h3 pawns.",
        "44... Kf8 45. Qf1": "I go for the f3 pawn first.",
        "45... Ke8": "There isn't anything black can do to save it.",
        "46. Rxf3": "The h3 pawn is next.",
        "46... Qh6": "Again there is nothing black can do to save it.",
        "47. Rxh3 Qf6": "Obviously, black wants to trade queens.",
        "48. Qg2": "I still felt though I can make good use out of my queen.",
        "48... Qg7": "Again he goes for trade.",
        "49. Qf1": "Again I resist.",
        "49... Kd7": "Black realizes I didn't feel like trading.",
        "50. Qf2": "I'm not sure what moves to make now.",
        "50... Kc8 51. Qg1": "It dawned on me! There was oppurtunity for the win, but I realized that for it to work, black's queen had to disappear, so after resisting, I would now give black what he wanted.",
        "51... Qxg1+ 52. Kxg1": "All according to plan. White's and back's pawns are at a standstill, Black's bishop cannot steal any of white's pawns, for the bishop only runs on black squares and all the white pawns are on white spaces, so now it's time to get the king and the rook involved.",
        "52... Kd8 53. Kg2 Ke8 54. Kf3": "The bishop is a slight hurdle, but it can be passed around easily.",
        "54... Kf7": "Black is trying to evade the inevitable by getting his king out of the a-e spaces. He may be hoping I make a mistake or cause him to go into a dead position (draw). I planned, though, to find a way to win one way or another.",
        "55. Kg4 Kg7": "A bit surprised he didn't play Kg6 instead.",
        "56. Kf5": "I'm doing my best to keep my king off of the black spaces to avoid check from the bishop.",
        "56... Kf7 57. Rh7+": "Now I get the rook involved.",
        "57... Kg8 58. Kg6": "I protect the rook and bring my king in closer.",
        "58... Bf4 59. Rb7": "Checkmate was possible here, but I already knew that back saw it coming.",
        "59... Kf8": "As expected, checkmate is no longer immediately imminent. ",
        "60. Kf6": "I keep trying, but I moved my king on a black space...",
        "60... Be5+": "As a result, that happened.",
        "61. Kg6 Bg3 62. Rb8+": "I made a new plan:To force the king into a corner.",
        "62... Ke7 63. Kf5": "I wanted to drive the king to a8 or a6, but black could head in the opposite direction here. ",
        "63... Kd7": "Fortunately for white, he went white's way.",
        "64. Kf6": "Now black is in trouble.",
        "64... Be1": "Black tries to evade the inevitable. I'm surprised black didn't play Bh4+. Getting the bishop involved was better than letting it run away.",
        "65. Kf7 Kc7 66. Re8": "Of course I protect the rook.",
        "66... Bb4": "? This gives no help to black at all. ",
        "67. Ke7": "Checkmate is inevitable no matter what black does now. Mate in 3",
        "67... Kb7 68. Kd7": "Mate in 2",
        "68... Ka7 69. Kc7": "Mate in 1.",
        "69... Ka6": "Of course, I'm telling you when mate is gonna happen, but black could of moved the bishop around perhaps to delay the inevitable, but black decides to get it over with.",
        "70. Ra8#": "Checkmate. cwfreak played a great game, but all good things must come to an end. This long, incredible game was now over. I hoped you enjoyed this annotation and feel free to rate and comment about it. "
    },
    "url": "https://gameknot.com/annotation.pl/league-division-e3?gm=54248",
    "gameName": "League division E3",
    "players": "joveyboy1 (1052) vs. cwfreak (1142)",
    "opening": "Sicilian (B23), closed, 2...Nc6"
}