{
    "moves": {
        "1. e4": "This is my first effort at an annotation so here goes... ",
        "1... e5 2. Nf3 Nc6": "Nothing out of the ordinary yet.",
        "3. d4 exd4": "There were other options but this seemed the most \"fun\"",
        "4. Nxd4 Bc5": "NxN seemed like it would only be a good idea if you like to play from a bad position. I already had a plan in case he decided to NxN",
        "5. Nxc6": "Which he did...",
        "5... Qf6": "I planned this move because I didn't want to bxc double my pawns in the c column, or worse dxc to have doubled pawns and no castling option after a queen exchange. I know there is no safe retreat for his knight. The early mate threat seemed too good to resist too...",
        "6. Qd2 dxc6": "I chose dxc6 as I like the position of my queen already, and it releases my light square bishop. ",
        "7. Bd3 Be6": "Seemed like a natural next step. Enabling O-O-O and an pretty handy spot for my LSB. ",
        "8. Nc3 O-O-O 9. Qe2 Bd4": "I don't much like the look of his Queen sitting behind his bishop pointing at my quite empty looking defenses. I thought about playing b5, but bd4 seemed like it was a better, more aggressive move. He has to react to me, instead of building an attack. ",
        "10. Bd2 Nh6": "Just bringing the last minor piece into the game (probably not the most useful position - but it wasn't doing much where it was!) and connecting my rooks. ",
        "11. f3 Rhe8 12. h4 Bxc3": "Not the best move here. I can't really remember why I played it... His knight wasn't causing me any trouble. Just making some room on the board maybe :)",
        "13. Bxc3 Qf4": "I could have tried to save the pawn with Qg6, but I would have been making a big target for white and would have beest wasting tempos trying to escape. This way at least my queen is in a better spot, with some aggressive options. Preventing his O-O-O too. ",
        "14. Qf2 Kb8 15. Bxg7 Ng8": "I didn't much like having to retreat my knight. I could use it to trap his bishop maybe. I am now regretting 12...Bxc3,  I was looking to be in a strong position, now I am behind (slightly) in material, he has a bishop pair and has some counter attack options. ",
        "16. g3 Qd6": "The only move available, but it is a nice place to have my queen. I am thinking about how to formulate a (not very subtle) assault straight up the middle. ",
        "17. Bc3 f5": "His bishop has escaped to a potentially troublesome position. I played f5 to try to shake things up in the middle. I'm hoping that he is becoming worried about my artillery strewn about the centre columns. ",
        "18. e5 Qe7 19. f4": "I have my eye on g4 as a useful position for a knight...",
        "19... Bd5 20. Rf1 Nf6": "This move was a stepping stone to g4, and also to support Be4",
        "21. O-O-O": "White now adds some weight of his own to the centre. ",
        "21... Ng4": "A nice outpost for the horsie. I see Ba2 as looking quite tasty, but it can wait.",
        "22. Qe2 Qe6": "Better look after \"little f\" he's doing a good job. ",
        "23. a3 c5": "Just putting some pressure on his bishops. ",
        "24. Qd2": "Making room for his bishop to retreat perhaps? ",
        "24... Be4": "Locking that bishop in place, and opening a gate to the backdoor for my queen. ",
        "25. Bc4": "Offering me a bishop sac hoping for a cheap mate. Also offering a queen exchange. ",
        "25... Rxd2": "I'll take the queenexchange - I think he has missed something...",
        "26. Bxe6 Rxc2+ 27. Kb1 Ne3": "Rc3 seemed like a good option also. No matter he threw in the towel here. "
    },
    "url": "https://gameknot.com/annotation.pl/league-division-d3?gm=31791",
    "gameName": "League division D3",
    "players": "chimchar1 (1572) vs. pawnstar2010 (1434)",
    "opening": "Scotch game (C45)"
}