{
    "moves": {
        "1. e4 Nf6 2. e5 Nd5 3. c4 Nb6": "Aleksandr Alekhine was the first grandmaster to develop 1... N-KB3 as a viable defense to 1 P-K4. The Knight gets kicked a time or two in the early going but White doesn't develop any of his pieces either during the kicking, and the advanced Pawns could prove hard for White to defend. At least that's the theory...",
        "4. d4 d6": "Starting to take action against the White center.",
        "5. Nf3 g6": "Preparing...",
        "6. h3 Bg7": "... and completing a fianchetto. This also...",
        "7. Nc3 O-O": "...enables me to castle.",
        "8. Bd3 dxe5": "Starting to split apart White's center.",
        "9. dxe5 Be6": "Now I have to bring out my Q-side pieces.",
        "10. b3 Nc6": "All my minors are in play, whereas White still has a B on the first rank.",
        "11. Bb2 Nxe5": "Naturally, I take an opportunity to win a Pawn.",
        "12. Nxe5 Bxe5": "I complete the exchange of pieces.",
        "13. O-O Bd4": "I take a good diagonal while I can.",
        "14. Rb1 Qd6": "May as well connect my Rooks.",
        "15. Ne4 Qe5": "To maintain the guard on my Bishop.",
        "16. Bxd4 Qxd4": "OK, another exchange. I'm ahead in material, so I don't mind.",
        "17. Ng3 Rad8": "Naturally, I bring a Rook to the open file.",
        "18. Be2 Qxd1": "Might as well trade Queens. The more wood comes off, the more of an advantage being a Pawn up becomes, and with all those pieces around White's King a direct attack seems unlikely to succeed. I'll try to win in the endgame.",
        "19. Bxd1 c6": "\"Pass.\" I couldn't come up with any brilliant plan, so I decided to see what White does.",
        "20. Bc2 Rd7": "Well, now I'm going to...",
        "21. Rfe1 Rfd8": "...double Rooks on the open file.",
        "22. Ne4 Rd7d4": "With the idea of tying down White's pieces to the defense of the Knight.",
        "23. Ng5 Bc8": "Of course, if he simply moves it... and I'm in no mood to sacrifice a minor exchange.",
        "24. Rxe7 Rd4d2": "Oops. So much for being a Pawn up. Well, I just have to play on.",
        "25. Rc1 Kg7": "To avoid annoying Rook checks.",
        "26. Rxf7+ Kh6": "Oops again. Forgot it was guarded by the Knight. Oh well, I'm only down a Pawn. Still can fight on.",
        "27. h4 Rd8d7": "I want White's Rook OFF the 7th rank.",
        "28. Rf3 Na8": "I was expecting a Rook trade, but that works too.",
        "29. Rf6 Nc7": "I reposition my Knight to guard my K3, so White can't plant *his* Knight at K6.",
        "30. g4 Kg7": "Better duck clear of the Pawn storm.",
        "31. Rf4 Rd2d6": "My Rooks are needed for defense.",
        "32. Re1 a6": "Preparing to advance my Q-side Pawns a bit.",
        "33. a4 b6": "Now I'm ready to swap down on the Q-side so I can focus on the K-side.",
        "34. Ne4 Rd6d4": "H'mm. I have a pin on the Knight...",
        "35. g5 Re7": "Now it's a double pin.",
        "36. Kh2 Bf5": "Make it a triple pin!",
        "37. f3 Rd8": "With the idea of doubling the Rooks.",
        "38. b4 b5": "OK, must pay attention over here...",
        "39. cxb5 cxb5": "I complete the exchange.",
        "40. a5 Kh8": "\"Pass.\" I could double the Rooks but that means giving up the open file.",
        "41. Re2 Nd5": "Well, what's this? The Rook is trapped.",
        "42. Rxf5 gxf5": "If the Knight stays, I follow with... PxN. If the Knight moves to N3 or B3, I play 43... RxR 44 NxR NxP with a technically easy endgame win, being the Exchange ahead. So White resigns."
    },
    "url": "https://gameknot.com/annotation.pl/league-division-d3?gm=51832",
    "gameName": "League division D3",
    "players": "cubanisimo (1378) vs. last_archimedean (1491)",
    "opening": "Alekhine's defence (B02), Steiner variation"
}