{
    "moves": {
        "1. e4 d5": "This opening is called the center counter defense or the scandinavian defense. The idea for black is to avoid White getting a strong center. The drawback for black is how to answear, when/if White simple takes the pawn. If black for instance tries to recapture with the queen, he will a lose a tempo, if white replies with Nc6.",
        "2. exd5": "The most common answear for white. ",
        "2... Nf6": "So, Black avoids the problem with the exposed queen. However he is now down a pawn. At least for the time being. ",
        "3. d4": "White choses to develop instead of trying to keep the pawn.",
        "3... Nxd5 4. c4": "Black is now equal again, however he loses a tempo now.",
        "4... Nb6 5. Nf3": "Following the general principle(GP): Knights out before Bishops.",
        "5... g6 6. Nc3 Bg7": "Black tries with a fianchetto. ",
        "7. Be3 Bg4": "Always nice, when you can develop with a pin.",
        "8. Be2": "The GP: unpin ASAP!\r\nAs filippus kindly pointed out for me, after 8...Bxf6, 9. Bxf6, Black cant take the unprotected c-pawn with the Knight as White can play Qa4  or Bxb7 winning material...\r\nHowevever, as we shall see, White overlooked this fact. ",
        "8... c6": "I think castling or Nc6 would have been stronger and more natural. Black must keep up in \"the develop-race\".\r\nBut the pupose of this move is clear: W. can no longer respond with Qa4  or Bxb7(as the c6-pawn is blocking), after 8....Bxf6, 9. Bxf6. So W is now forced to recapture with the g-pawn if he wants to keep his c-pawn...",
        "9. O-O": "...Thats why castling on the Q-side should have been considered!",
        "9... Bxf3": "Black takes advantage of whites blunder. White now has to choose between a exposed king or a pawn down.",
        "10. gxf3": "Whites king is now exposed, but he has the bishop pair and dominance in the center.",
        "10... O-O 11. Qd2 Re8 12. Rfe1 Nb8d7 13. f4": "The plan is to strengthen the center and eventually trade of the double pawn.",
        "13... Nf6 14. Kh1": "Making room for the rook to fullfill a GP: Control open or half open files.",
        "14... e6": "The idea is perhaps to dispute Whites center control",
        "15. Reg1 Nbd7 16. Rg2": "Planning to double Rooks",
        "16... Qc7 17. b4": "It looks like Black is  preparing an attack at Whites center, however Whites response b4 is probably weak.",
        "17... a5": "Capturing here would allow Blacks a-rook to enter the game.",
        "18. b5 cxb5 19. Nxb5": "Nice outpost for the Knight - cant be attacked by pawns",
        "19... Qc6 20. f3": "unpinning, but White dominance in the center is still quite shaky!",
        "20... Nb6 21. Rc1": "Natural move with a pin",
        "21... Red8": "Natural move with a pin!",
        "22. Rg3": "weak or bad move as it allows Nh5 attacking the rook. However the white bishop is now allowed to move as the rook is protecting the f3-pawn.",
        "22... Nbd7 23. Rcg1": "Doubling the rooks - at last!",
        "23... b6 24. Qc2": "Preparing an attack on the King side",
        "24... Nb8 25. Bd3 Na6": "an intermezzo before the attack can proceed. White must avoid Nb4...",
        "26. a3 Nc7 27. Nxc7 Qxc7": "Whites pressure on g6 is very strong, but a sac is too expensive.",
        "28. Rg3g5": "The plan is to prepare a f-pawn push. Black can of course try h6, but that would also be satisfying for White as it would weaken Blacks pawn structure.",
        "28... Rd7": "Black is probably preparing to double his Rooks too, however that does not help to prevent Whites attack",
        "29. f5": "The attack begins",
        "29... exf5": "White is now allowed to recapture with the Bishop as Blacks g-pawn is the only defence aganist whites Rooks",
        "30. Bxf5 Re7 31. Qd3": "Protecting his black bishop",
        "31... Bh6": "The idea is good - if White retreats with the rook, Black gets Whites black Bishop. The Black king is however only protected by the g-pawn now...",
        "32. Rg5xg6+": "Now White is trading a Rook for a Bishop   a pawn. Probably the best choice.",
        "32... hxg6 33. Bxh6": "Black has now not many places to go",
        "33... Rae8 34. Bxg6": "A sac. For the Bishop White gets a pawn and a fully exposed Black king",
        "34... Re7e1": "Black is trying to couter-attack, but that is unwise, as White now delivers a double check!",
        "35. Bh7+": "If the Bishop was making the check alone, Black could simple respond with Nf6xh7, but as the Rook is checking too, Black is forced to move his King. That is the whole idea behind the double check.",
        "35... Kh8": "No other option",
        "36. Bg7#": "And checkmate. \r\n\r\nAs noted in the beginning - I have not used any help in this annotation - so if you have any comments or corrections, don't hesitate to message me!\r\n\r\nThanks,\r\nHenrik\r\n\r\n"
    },
    "url": "https://gameknot.com/annotation.pl/league-division-d1-the-double-check?gm=8007",
    "gameName": "League division D1 - The Double Check!",
    "players": "lynvingen (1626) vs. ssth (1501)",
    "opening": "Scandinavian (B01), Kiel variation"
}