{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Bc4 Nf6": "Two knights defence (C55)",
        "4. Nc3 Bb4 5. Ng5 d6": "Här funderade jag om jag skulle ta f7 med S eller med L, men beslutade att ta med S. Det ger fler möjligheter i fortsättningen.\n Här lämnar svart Two knights defence (C55) f ö . 5...0-0 hade varit i den linjen.",
        "6. Nxf7 Bg4 7. f3 Qd7 8. Nxh8 Be6 9. Bxe6 Qxe6 10. O-O O-O-O 11. d3 Rxh8 12. Be3 Nd4 13. a3 Bc5 14. Rb1 d5 15. exd5 Nxd5 16. Nxd5 Qxd5 17. b4 Bd6 18. c4 Qf7": "Här fortsätter jag att jaga svarts löpare. I övrigt så behöver jag komma ut med mina torn och min dam.",
        "19. c5 Be7": "Mina pjäser är en aning blockerade, så det är svårt att bygga upp någon snygg kombination för tillfället. Utväxlar L mot S på d4.",
        "20. Bxd4 exd4 21. Qe2": "Ett ganska aggressivt inbjudande, som kan leda till att vi snart utväxlar våra D. Om inte annat får jag lite spelrum för tornen. Bäst att isåfall flytta bT istället för fT, om utväxlingen sker längs f-filen. Men vi får se.",
        "21... Re8 22. Rbe1": "Om svart spelar medvetet, så kommer våra D snart att utväxlas. Fördelen är att jag gör det med schack.",
        "22... Bh4 23. Qxe8+": "Svart spelar som väntat, så jag går ner och utväxlar D. Så får jag ett T på köpet.",
        "23... Qxe8 24. Rxe8+ Kd7 25. Re4 Bf6": "Han går ner med L för att skydda d4, men då dubblar jag på e-filen.",
        "26. Rfe1": "Nu har jag både materiellt och positionellt övertag. En rad möjligheter att agera med mina T öppnar sig.",
        "26... b6 27. Re4e6": "Pressar uppåt och skär av svarts K i sina färdvägar.",
        "27... bxc5 28. bxc5": "En naturlig utväxling. Nu gäller det bara att behålla pressen uppåt, och leta efter avslut.",
        "28... c6": "Det börjar bli dags att sätta K in i spelet, men först lägger vi en bondestruktur på ljusa rutor. Då kan hans L inte tracka dom.",
        "29. g4 Bh4 30. Re1e4": "Han siktar förmodligen på att ta min c-bonde med L köksvägen. Bäst att låta a-bonden stå kvar och parera,men se upp för mörka rutor sålänge hans L existerar.",
        "30... a5": "Ser inget omedelbart, utan passar på att sätta a-bonden på ljus ruta. Stoppar även svarts a-bonde på sin promoväg.",
        "31. a4 g6": "Nu är det dags att sikta mot K, och ev mattnät kan växa fram.",
        "32. Rd6+": "Bonden skyddar fint även om han parerar på c7.",
        "32... Kc7 33. Re8": "Det är alltid klurigt att finna mattar när det står många pjäser kvar på brädet. Får se upp för patt också, samt hans lömska L.",
        "33... Be1": "Måhända offrar han sin L medvetet för att försena mattläget. Men jag vill helst slippa hans L. så jag tar den iaf.",
        "34. Rxe1 h5": "Då knyter vi ihop mattnätet.",
        "35. Re7+": "Vart han än går med K, så slår jag g6 med d-T. Säg att han går Kc8 och sedan Kc7, så säkrar jag e-T till h7 och sedan går jag ner och mattar.",
        "35... Kc8 36. Rxg6": "Nu är det endast en fråga om teknik, och sedan är han matt.",
        "36... Kd8 37. Rh7": "Matt inom ett drag.",
        "37... Ke8 38. Rg8#": "Där satt den !"
    },
    "url": "https://gameknot.com/annotation.pl/league-division-d3?gm=28933",
    "gameName": "League division D3",
    "players": "chekof (1203) vs. gatortim (1232)",
    "opening": "Two knights defence (C55)"
}