{
    "moves": {
        "1. e4": "This game was littered with blunders and errors. Fritz 8 analysis spit out nearly 2 pages of analysis and variations.",
        "1... c6": "I play the Caro-Kann, as I do about 90% of the time. It's the only defense I feel comfortable with and actually understand pretty well.",
        "2. e5": "Usually White's second move is d4, I don't know why he chose to move this pawn again.",
        "2... d5 3. d4": "And now we've transposed back into the Advance Variation.",
        "3... Bf5 4. Bd2": "Most of the time, White goes with Nc3 or Bd3 here. Bd2 seems pointless, as we are about to find out.",
        "4... e6 5. Be2": "Very conservative opening from White, doesn't seem to be interested in making trades straight away.",
        "5... Qb6 6. Be3": "A blunder. White only focuses on the d4 pawn and doesn't notice the b2 pawn (which was my goal). Bc3 was the best move here.",
        "6... Qxb2 7. Nd2 Bxc2 8. Qc1 Qxc1+": "Fritz shows Ba3 to be the move here instead of trading Queens. I remember thinking about this move for a long time and the only option I could come up with was trading Queens.",
        "9. Rxc1 Bg6": "I knew the Bishop would be useless on a4 so I kept it on the b1-h7 diagonal with this move.",
        "10. Ngf3 Bb4": "In the Caro-Kann, I normally aim for making the c5 pawn move and taking back with my dark-square Bishop. This wasn't an option since White has his Bishop protecting it. Thanks to the capture of the c-and-b pawns, I developed my Bishop here.",
        "11. O-O Ne7": "I love putting my Knight from e7 to f5 and controlling the Kingside with it...",
        "12. Nh4": "...but my opponent squashes those ideas by taking my Bishop. Of course I could've moved Bishop to f5 and made the trade that way, but I wanted to develop another piece, rather than worrying about putting my Knight on the exact square I wanted...",
        "12... Nd7 13. Nxg6 Nxg6": "...g6 still isn't a bad square for this piece but it's not as active as I would like.",
        "14. Rcb1 Bxd2 15. Bxd2 b5": "Fritz recommends ...b6 here instead of b5, and I agree. With b6, I would still have the flexibility of ...c5. ",
        "16. Rfc1": "And now, White makes me pay for it with an attack on the backward pawn.",
        "16... Rc8": "A horrible move, and the worst part of it is that I didn't even see the pin.",
        "17. Bxb5 O-O 18. Bxc6": "I had no choice but to allow White's regain of his two pawns.",
        "18... Nb6 19. Ba5 Nc4": "Had to put the Knight on its outpost.",
        "20. Bb7 Rcb8 21. Bc7 Nd2": "Another blunder...I figured I'd just cut my losses, never seeing the Nf4 move which would've kept it even.",
        "22. Rb2": "I think White must've given me too much credit here not to take the Rook. It's the same conservative strategy we saw in the opening from White.",
        "22... Nc4 23. Bxb8 Nxb2 24. Bxa7 Nc4": "I've had to move this Knight way too much.",
        "25. a4": "Now White gets aggressive and wants to Queen that pawn.",
        "25... Nf4": "I've noticed in many of my games, I often make certain moves several moves later than I should have. We'll see this theme later in the game from Black as well.",
        "26. Rc2 f5": "I knew White would not take en passant here because he had not shown me all game that he would accept complications, he kept going along in a conservative style.",
        "27. Ba6": "Two pieces now block the a-pawn. White wants to rid himself of my Knight.",
        "27... Ra8 28. Bxc4 Rxa7": "A blunder, it traps my Rook with nowhere to go.",
        "29. Bb5 Kf7 30. Ra2 Rc7 31. Ra1 Rc2 32. g3": "Now White is worried about a check on his King, rather than pushing his pawn like he wanted to before, he can't make up his mind!",
        "32... Nh3+": "I'm not making anymore trades.",
        "33. Kg2 Nxf2 34. Kf3 g5": "Another move I should've made 4 moves ago.",
        "35. Be2 Ne4 36. h4": "Has White forgotten all about his passed pawn? It appears so.",
        "36... Rc3+ 37. Kg2 Rxg3+ 38. Kf1 g4 39. a5 Nd2+": "This was a blunder...f4 should've been the move here. I considered it but wasn't sure of its merit, so I decided to try and check Black as much as possible.",
        "40. Kf2 Ne4+ 41. Kf1 Nd2+ 42. Kf2 Ne4+": "Trying for the threefold draw, but White decided against it. ",
        "43. Ke1 Rg1+ 44. Bf1 Nc3": "Another blunder, I wanted to make the move, g3, but again wasn't sure of myself. The game gets ugly from here on.",
        "45. Kf2 Rh1 46. a6 Rh2+": "According to Fritz, White can now successfully Queen his pawn, but...",
        "47. Kg3 Rb2 48. a7": "...this move gives it all away. Forced mate in 4...I didn't even see it until the checkmating move.",
        "48... Ne4+ 49. Kf4 Rf2+ 50. Ke3 f4+": "12 moves later, I finally make the f4 move!",
        "51. Kd3 Rd2#": "A surprise win for me...ugly, but a win nonetheless."
    },
    "url": "https://gameknot.com/annotation.pl/league-division-d2?gm=162",
    "gameName": "League division D2",
    "players": "garner (1427) vs. ecfchamps2002 (1606)",
    "opening": "Caro-Kann defence (B10)"
}