{
    "moves": {
        "1. c4": "Here's a lucky escape which shows the value of not automatically resigning in the face of overwhelming odds.  I owe some virtual flowers to my opponent.  Hopefully this draw may save me from demotion from D1 in the immediate future.  White starts with the English Opening, a very sound one that suits a strategically minded player.",
        "1... Nf6": "I respond by aiming for a King's Indian structure.",
        "2. Nc3 e5": "and then remember that I've seen some interesting wins for Black recently with this line, so vary from my normal practice.",
        "3. g3 g6": "and now revert to Plan A!",
        "4. Bg2 Bg7 5. Nf3 d6 6. O-O O-O 7. d3 c6": "to control d5, where I don't want White's N or B to settle.",
        "8. Rb1": "Getting the R off the long diagonal and preparing to support a pawn advance, so I try to discourage that advance with my next move.",
        "8... a5 9. a4 Nbd7": "This gets in the way of Black's QB, but, this early in the game, that piece has nowhere useful to go anyway.  With the pawn on c6, the alternative was ...Na6, which I often play in similar positions, but it is not so attractive when the attacking opportunities from c5 are not so obvious.  In a closed Benoni, Black often plays ...Na6 followed by ...Nc7.  Possibly that might have been a good choice here.",
        "10. Re1": "White prepares to support a central advance on the e-file.",
        "10... Ng4": "In turn, preparing to advance  ...f5 and gesturing towards the newly weakened f2 pawn.  Unfortunately this turns out to be a wasted move.",
        "11. h3 Ngf6": "Tha alternative ...Nh6 might have been better, still allowing ...f5, indeed supporting it, and leaving a good square fro the Nd7.  I needn't worry about 12. Bxh6 Bxh6, which increases the scope of Black's fianchettoed B.",
        "12. Bg5 h6 13. Bxf6 Nxf6": "An interesting position: Black has the advantage of the two bishops but it's a relatively closed position, so White has the advantage of the two knights.  White is also better developed, with only his Q on her starting position, whereas Black still has his QB and QR at home as well.  Whose advantage will pay off?",
        "14. e3 Be6 15. b3 Qd7": "at last exploiting the weakness created by my premature 10. ...Ng4 and White's 11. h3 but White can easily defend it.",
        "16. Kh2 g5": "launching an attack against a well defended King.",
        "17. g4": "which White easily blocks.  Now Black changes tack.  Unable to advance the h-pawn immediately, because the g-pawn would be en prise, Black seeks to exploit the newly weakened h2-b8 diagonal.",
        "17... Qc7 18. Kh1": "White sensibly gets off the weak diagonal.",
        "18... d5": "and now Black starts to open up the centre.  I think I was confident of gaining an advantage here.",
        "19. cxd5 cxd5": "revealing an attack on the undefended N on c3",
        "20. Nb5": "which counter-attacks.  White has good pressure on the Queenside.",
        "20... Qb8": "an ignominious retreat but I think I preferred to stay on the longish diagonal than remain on the exposed c-file or retreat to d7 once again or to the kingside, where she'd be pointing the wrong way for my plans.",
        "21. Rc1": "White seizes the open file with his Rook, so I immediately oppose it.  Unfortunately for me, theis square naturally belongs to the QR but my Q prevents it from getting there, so I have to use the KR, which really belongs kingside or, possibly, the d-file.",
        "21... Rc8 22. Rxc8+ Qxc8 23. Nxe5": "White picks off the loose pawn.  Now White's knights are really becoming a nuisance and his fianchettoed bishop is looking stronger with every move.",
        "23... Nd7": "so I seek to swap off one of the knights",
        "24. Nxd7 Qxd7": "another Q move and still no improvement in Black's position.  In fact, Black's pawns are a mess and he's one down",
        "25. e4": "White increases his control of the centre.  Black is happy to swap off the weakling on d5.",
        "25... dxe4 26. Bxe4 Rd8 27. Qf3": "White gangs up on the weakling on b7, offering up the pawn on b3 in exchange.",
        "27... Bd5": "I think I should have accepted the exchange of pawns as I would also have threatened the a-pawn as well.  With this move I meekly give up the bishop pair and allow White to exchange down while a pawn ahead.  Not bright.",
        "28. Bxd5 Qxd5 29. Qxd5 Rxd5 30. Rd1 f5 31. f3 Kf7 32. Kg2 Ke6": "?? a well-motivated blunder.  The good motive was centralising the King.  The blunder is revealed by White's next move.  I could have avoided this by the simple remedy of checking before I clicked the Submit button.  ",
        "33. Nc7+": "How often do I walk into a knight fork?  Too often...",
        "33... Kd6 34. Nxd5 Kxd5": "Objectively, Black is lost and could resign now with a clear conscience but I decided to bluff it out for a while.  See if White would return the favour.",
        "35. Rc1": "The threat of Rc7 looks devastating.",
        "35... fxg4": "but I decide to swap off my hanging pawn while I can.  Anything to be unpredictable.",
        "36. fxg4 Be5 37. Kf3 Kd4 38. Ke2 Bf4 39. Rc4+ Kd5 40. Kf3 Bd2": "I don't want to allow White to swap off the pieces when he would have two pawns extra and my King would be torn between three fronts.  better to keep the pieces on, even though the Rook is stronger than my Bishop.",
        "41. Rc7 b6 42. Rh7": "another pawn is about to fall for nothing",
        "42... Bb4 43. Rxh6 Bc5 44. Rg6": "and another ...",
        "44... Kd4 45. Ke2 Kc3": "so I go after White's Queenside pawns",
        "46. Rxg5 Kxb3 47. h4": "White immediately starts the campaign to promote his remote pawns.",
        "47... Kxa4": "Hoping to somehow win a race...",
        "48. h5 Bd4 49. Rd5 Bg7 50. g5 b5 51. Rd7 Be5 52. g6 b4 53. g7": "I have to sac the B for the pawn to prevent it queening.",
        "53... Bxg7 54. Rxg7 b3": "and now I'm ahead in the race!",
        "55. Rb7 Ka3 56. h6": "but White has my pawn covered and can simply advance his pawn at will.",
        "56... b2 57. h7 Ka2 58. Rxb2+ Kxb2 59. h8=Q+": "Now my one remote hope is somehow to swindle stalemate.",
        "59... Kb3 60. Qc8 a4": "or perhaps promote the pawn!",
        "61. Qc4+ Ka3 62. Qc3+ Ka2 63. Kd2 a3": "Now White has to be careful to leave Black a square for his King...",
        "64. Kc1": "but he falls headlong into the trap, unless of course he was just being charitable...  Black has no legal moves but is not in check, so it's Stalemate."
    },
    "url": "https://gameknot.com/annotation.pl/league-division-d1-its-not-over-till-its-over?gm=25517",
    "gameName": "League division D1- It's not over till it's over",
    "players": "berka52 (1463) vs. rjacobs (1542)",
    "opening": "English opening (A16)"
}