{
    "moves": {
        "1. e4 e5 2. Qh5": "The Parham attack.",
        "2... Nf6": "2. ... Nc6 is the usual continuation but I threw caution to the wind just to see what would happen",
        "3. Qxe5+ Be7 4. Nf3": "Now the trick is to develop and force White to move his Queen around as much as possible",
        "4... Nc6": "The first step in development although 4. ... d6 is also possible and maybe better as it frees the light squared Bishop while forcing White to move the Queen to safety",
        "5. Qf4 d5": "I liked this because it kept the pressure on White with 6. exd5 Nd5 attacking the Queen once again and with my Bishops acting in tandem giving the Queen few squares to which she might retreat",
        "6. e5 Nh5": "Run Queenie run",
        "7. Qe3 O-O": "I took a moment off here because I thought having my Rook available to jump on the e-file might be useful and of course, getting my King to safety",
        "8. Bd3 Bg4": "This might not have been such a good move but I wanted to get the Bishop out. 8. ... Be6 might be better",
        "9. h3 Bxf3 10. Qxf3 g6": "This protects the knight but does open the diagonal to White's attack with the dark squared Bishop and the Queen. Luckily this does not enter into the game continuation.",
        "11. Nc3 Nb4": "I'm just trying to use my space here and make potential threats. ",
        "12. Nxd5": "This is a blunder perhaps with an eye towards my Knight attacking the c2 square threatening a fork if the light squared Bishop ever moves but forgetting that it also defends this square",
        "12... Nxd5 13. Bc4 c6": "I like that Knight at d5 quite a bit and I want to make White trade off his good Bishop if he wants to rid himself of it",
        "14. g4": "Now, my Knight is in trouble but I find a nice series of zwischenzug moves of which I'm quite proud. ",
        "14... Nb4": "Threatening 15. ... Nxc2+ and picking up the rook",
        "15. Rb1": "I think 15. Qe4 is best or possibly 15. Bd3 Nxd3 16. cxd3 but this just gives up another pawn. I suspect my opponent missed the series of moves that ends up saving both my Knights",
        "15... Nxc2+ 16. Kd1 Nd4": "Pulling the Knight from danger and threatening the Queen",
        "17. Qe4 Ng7": "Getting both Knights to safety and picking up a pawn. My position is a bit cramped but White has lost the right to Castle and his dark squared Bishop and one Rook are both trapped for a bit longer",
        "18. d3 b5": "This forces the Bishop to a place where I can make a trade",
        "19. Bb3 Nxb3": "While I did like the Knight at d4 I thought getting rid of the good Bishop and doubling pawns was to my advantage",
        "20. axb3 Qd5": "Up two pawns I'm willing to trade Queens even if it means creating a pawn island",
        "21. Qxd5 cxd5 22. Bh6": "This is a good square for the Bishop if he can get his pawns into the attack",
        "22... Rfc8": "Taking the open rank but also clearing the f8 square for my Bishop as I want to rid myself of White's Bishop as quickly as possible",
        "23. Kd2": "Connecting the Rooks",
        "23... Rc6": "Getting ready to stack my Rooks",
        "24. Ke3": "Centralizing the King is a good move but I thought with the scattered pawns and me having an extra piece this was not the best move. I think maybe pushing forward with a Kingside attack with something like 24. f4 might be better",
        "24... Ne6 25. h4": "Now pushing pawns",
        "25... Bf8": "This allows me to trade off that last Bishop of White's and I was feeling pretty safe after that",
        "26. Bxf8 Kxf8 27. f4 Rac8 28. f5 Nc5": "White has a pawn advantage on the Kingside but I never felt like it was in danger of causing serious trouble so I thought getting the Knight back into the game was the best move",
        "29. fxg6": "I though that 29. f6 was better as it covers the e7 square forcing my king into a more roundabout escape rout",
        "29... fxg6 30. b4 Na6": "I'm angling for pawns now",
        "31. Rhf1+ Ke7 32. d4 Nxb4": "There's one pawn",
        "33. h5 Rf8": "Again, the passed pawn on e-file did not frighten me too much at this stage and I'm happy to continue to trade hoping my Knight will be able to snap up loose pawns as the game goes on",
        "34. hxg6 Rxg6": "I give up the c file but threaten another pawn",
        "35. Rbc1": "Takes the c-file for a brief moment but gives up the Rook trade and another pawn. I think White is looking at 36. Rc7+ picking up a pawn but I'm not going to allow that",
        "35... Rxf1 36. Rxf1 Rxg4 37. Rf6": "Now comes a series of manuevers where I snatch up pawns",
        "37... Rg6 38. Rf5 Ke6 39. Rh5 h6 40. Kd2 Nc6 41. Kc3 a5 42. Kd3 Ne7 43. Ke3 Nf5+ 44. Kf4": "This gives up the d-pawn. My plan was move the Knight to c6 via e7 and then push my pawn majority on the Queenside",
        "44... Nxd4 45. Rh2 Nc6": "Threatens another pawn",
        "46. Rh5 a4 47. Rh3": "White must protect against the pawn storm",
        "47... Nxe5 48. b4 Nc6": "48. ... axb e.p. 49. Rxb3 and then the other b-pawn falls as well",
        "49. Re3+ Kd6 50. Kf5 Rg5+ 51. Kf6 Nxb4": "The last White pawn falls to my Knight",
        "52. Re6+ Kc5 53. Re8 a3 54. Ke6 a2 55. Ra8 Rg1 56. Rc8+": "Nuisance checks are about all that is left",
        "56... Kd4 57. Ra8 a1=Q 58. Rxa1 Rxa1 59. Kf5": "Now it is a matter of time",
        "59... Rf1+ 60. Kg6 Ke5 61. Kxh6 Rg1 62. Kh5 Kf4 63. Kh4 Rh1#": "I was pretty happy with my play here although without the Knight blunder of my opponent I'm not sure how the game would have gone. Still, it was an unusual game and I thought fairly interesting."
    },
    "url": "https://gameknot.com/annotation.pl/league-division-d3?gm=29235",
    "gameName": "League division D3",
    "players": "genpel (1159) vs. tomlib (1445)",
    "opening": "KP (C20), Patzer opening"
}