{
    "moves": {
        "1. d4 d5 2. c4 c6": "The Slav, which was the main theme of the recent match, Kramnik-Topalov.",
        "3. Nc3 Nf6 4. Nf3 dxc4 5. e4": "White chooses the gambit-line - a very sharp continuation. Black holds on to his extra pawn on c4, but White gets a nice centre.",
        "5... b5 6. e5 Nd5 7. a4 h6": "According to a book by Markov and Schipkov - \"Winning with the Slav\" - this move prevents a Knight-move to g5. But does Black have the luxury of this kind of moves in the opening? I don´t know, it just doesn´t look right. But I decided to follow the book.",
        "8. axb5 Nxc3 9. bxc3 cxb5 10. Ba3": "A strong move, keeping the initiative. Now the main line goes: 10. - Be6 11. Be2 Nc6 12. 0-0 Bd5, and Black is fairly okay. The book had another suggestion though - and unfortunately I decided to try it.",
        "10... g6": "The idea is: 11. Nd2 a5! 12. Qf3 Ra7! when White is in greater danger than Black. Alternatively White could continue with: 11. d5!? Bg7 12. d6 Nc6 13. Qd5 Bd7, but Black is still okay.",
        "11. Qb1": "(!) A very natural and good refutation of Blacks opening play! The Queen attacks b5 and has an eye on the good square e4. I have simply lost too much time with the moves h6 and g6.",
        "11... a6 12. Qe4 Ra7 13. d5": "Now Whites centre-pawns comes rolling, and Blacks pieces are totally un-coordinated. Here already, I had the feeling it would be a short game ...",
        "13... Bf5 14. Qd4 Rb7 15. g4": "Forcing the Bishop away from the defence.",
        "15... Bc2 16. e6 Rh7": "Rooks on b7 and h7! It looks more like a joke than good opening-preparation.",
        "17. Rc1 Bb3 18. Qe4 Qa5 19. Bb4 Qb6": "Desperately searching for some kind of counter-play, but the Pawns on d5 and e6 are simply too strong.",
        "20. Ne5 a5 21. Ba3 Na6 22. Nxf7": "Enough is enough ... I can´t recall ever having had such a bad position after only 22 moves, but at least I learned a lesson: Opening-books are not flawless!"
    },
    "url": "https://gameknot.com/annotation.pl/league-division-c2?gm=2255",
    "gameName": "League division C2",
    "players": "valeriuzaharia (1764) vs. ybrevo (1855)",
    "opening": "QGD Slav defence, Alekhine variation (D10)"
}