{
    "moves": {
        "1. e4": "Standard opening. ",
        "1... e5": "Response. ",
        "2. Bc4 Nf6 3. d3 c6": "I played c6 to set up d5. d5 right away would have resulted in a slight material disadvantage. ",
        "4. Nf3 d5 5. exd5 cxd5 6. Bb5+ Bd7": "Blocking with my B seemed to be the best move in my opinion. It allowed for development of some variety while leaving my Q and K in place. Also, it provided a direct threat if my opponent choose to move a different piece. ",
        "7. Nc3 Bb4": "I wanted to pressure his N and his B would be exchanged regardless. ",
        "8. Bxd7+ Qxd7": "I should have captured with my N instead. ",
        "9. Nxe5 Qe6": "The N was now pinned to his K.  \r\n\r\nLooking at the computer analysis from the previous move, the computer said my move here should have been Qc7. I like having both N's pinned for the time being.  ",
        "10. d4 O-O": "I used the opportunity to tuck my K away into safety. Conversely, my opponents K was still in the center allowing his N's to remain pinned. ",
        "11. Bd2 Nc6": "Development of my N and threatening the d4 pawn.",
        "12. Nb5 Rad8": "The computer says my move here was to Nxe5. However that leaves me vulnerable to a very nasty fork with 13. Nc7. Despite the computer saying this resulted in more than a 3 pawn swing. I am inclined to say I disagree. ",
        "13. Bxb4 Nxb4 14. Nc7 Qe7 15. Nb5 a6 16. Nc3 Ne4": "I was ok with the positioning of my N. I did not want to move my N to d7. The computer keeps stating my opponents best move was to castle, however while this may be true. I did not see my opponent castling during the match. He appeared to be neglecting that aspect of play. ",
        "17. Nxe4 dxe4 18. c3 f6": "I was ok with the trade off in this situation. Additionally, I still had my eyes on his Q.     ",
        "19. Nc4": "Wisely, my opponent did not want to exchange N's. ",
        "19... Nd3+": "While I did not see my opponent castling, I wanted to remove the option completely. I also had my eyes on another play to reduce my opponents material. ",
        "20. Kd2": "My opponent facilitated my plans. I would be able to claim the advantage and maintain from this point forward. ",
        "20... Nxf2": "I was set up fairly well from this point forward. ",
        "21. Qe2 Nxh1 22. Rxh1 Rfe8": "I did not see anything else of value that I could play. This move would provide extra firepower and enable me to launch my Q into battle. ",
        "23. Nb6": "Awkward move in my opinion. It really did nothing for my opponent. ",
        "23... e3+": "A simple check. ",
        "24. Kd3": "My opponent played his K right into the heart of my maneuver. ",
        "24... Rd6": "I had limited options and opted to chase the N. ",
        "25. Nc4": "Im not sure what happened here however this sealed his fate. ",
        "25... Qe4#": "Mate. "
    },
    "url": "https://gameknot.com/annotation.pl/league-division-e2?gm=55782",
    "gameName": "League division E2",
    "players": "frank85715 (1240) vs. jallen85 (1121)",
    "opening": "Bishop's opening (C24), Berlin defence"
}