{
    "moves": {
        "1. e4": "I am putting this on for advice and comments from better players. I always play e4 opening but so far I have struggle with the Sicilian defence. Any tips are welcome",
        "1... c5 2. Nf3": "Preparing fro d2-d4",
        "2... d6 3. d4": "d2-d4 comes, now Black must take d4",
        "3... cxd4": "As expected",
        "4. Nxd4": "So far, the main line",
        "4... Nf6 5. Nc3": "I protect my e4 pawn.\nThis is a very intriguing position to my inexperienced eyes, what is the strategy for White from here? King side attack or Queen side? Castle King side or Queen side?",
        "5... g6": "Black prepares to fianchetto his dark squared bishop (DSB).",
        "6. Be3": "I shore up my Knight. Shall I have moved it? If so, where, f3 or b3?",
        "6... Bg7": "As expected",
        "7. Qd2": "I move my Queen to prepare for a Queen side castle. The idea at this stage is to attack Black's king side with pawns to open up the king's cover. Black's Queen side still had all pieces firmly hemmed in so he had to castle king side. Question: Is this the best position for White's Queen against the Sicilian defence? It would be good to discover a square similar to d6 for the Black Queen in the Caro Kann defence. Any thougths are welcome",
        "7... Ng4": "Black attacks my DSB. What to do? I am usually loathe to trade a bishop for a knight, but in hindsight, I should have allowed the trade as then Black would only have his DSB developped... Oh well, I did just the opposite",
        "8. Bg5": "Attacking the e7 pawn",
        "8... Nc6": "Black gets what they wanted, a second attack on the knight and perhaps later, doubling up my pawns on the c files (I hate doubled up pawns)",
        "9. Nxc6": "I take his knight out... Ready to castle queen side, notwithstandind the fianchetto. Was that just crazy?",
        "9... bxc6 10. O-O-O": "Caslte",
        "10... Be6": "black eying my a2 pawn",
        "11. f3": "I ignore the threat and focus on moving the knight on... I don't like knight hanging out too comfortably around my pieces",
        "11... Ne5": "Black readies to redeploy queenside",
        "12. f4": "I help him along with tempo, as I can take my pawns up the board to open up Black's king side",
        "12... Ng4": "The knight comes back to its original square",
        "13. h3": "So far, so good. The knight must move again",
        "13... Nf6": "The knight finally gets the message",
        "14. g4": "Getting ready to strangle Black, or so I thought....",
        "14... Qa5": "Black's first significant attack. So far, where have I gone wrong?",
        "15. a3": "I move my pawn up as opposed to defending it with my king",
        "15... Rb8": "Good move from black, getting a firm grip on the b file",
        "16. f5": "I continue with my original plan. I have to open up Black's position",
        "16... Qb6": "Black threatening checkmate.",
        "17. b4": "I should not played b2-b4. Short term it is good as it stops the mating threat, but long term I have weakened my king's defences. In hindsight, I should have payed Na4, protecting the b2 pawn and attacking Black's queen. The queen must have moved and I would have traded a pawn for a bishop. Thougths?",
        "17... Bd7": "Black takes his bishop out, but now I am in a weaker position and I know it...",
        "18. Be3": "I belatedly attack Black's queen. My plan at that point is to regroup my pieces around my king for defence",
        "18... Qb7 19. Bd4": "I pin the knight to the DSB and the rook",
        "19... a5": "Black decides to open up my pawn cover",
        "20. e5": "I continue with my original plan of a pawn attack on Black's king's position",
        "20... dxe5": "I know have an opportunity to break up the rook queen battery",
        "21. Bxe5": "My eyes were firmly on the rook",
        "21... axb4": "But Black did the unexpected. I should have calculated the variation better... Thoughts?",
        "22. Bxb8": "I continue on. The one thing I should have factored in was that the pawn could attack my queen... Oh well",
        "22... bxc3": "In my mind, this is the big moment in the game where Black has taken a decisive advantage but gaining time, I had to take the pawn and Black would have my DSB",
        "23. Qxc3 Qxb8": "Not good. And my queen is in the line of fire of the Bishop",
        "24. Qd3": "I hoping for an overshight when I could attack Black's light squared bishop with check...",
        "24... O-O": "Black castles. What would my next move have been? I must admit that my chief concern was getting my king out of its position. My monarch's pawn cover was bursted and he needed to find a better place to hang out",
        "25. Kd2": "The king is on the march",
        "25... Nd5": "Black is hoping for Ke2 when he would reply Nf4 forking queen and king. Ke2 does not work either as Black would play Bc3+",
        "26. Ke1": "The second alternative was the least worst one... Thoughts?",
        "26... Bc3+": "As expected",
        "27. Kf2": "As I said before, e2 was not available",
        "27... Qb6+": "Black is having a ball",
        "28. Kf3": "I must now take my king in the middle of the board",
        "28... Ra8": "Black aims at my a3 pawn. At that point, my chief concerned was about my queen and king on the same rank, ripe for a rook fork. In hindsight, I should have protected the pawn with Ra1. Instead, I return to my original idea. Opening up Black's king's position",
        "29. fxg6 fxg6 30. Qe4": "I know tend to my concern (queen-king line up). Again, Ra1 was the move here. Thoughts?",
        "30... Rf8+": "I had really nowhere to go",
        "31. Kg3 Qf2#": "Any thoughts, ideas, specially in the opening sequence is welcome. Thank you"
    },
    "url": "https://gameknot.com/annotation.pl/league-division-d2?gm=25217",
    "gameName": "League division D2",
    "players": "arnihilator (1574) vs. jantheog (1660)",
    "opening": "Sicilian (B72), dragon, classical attack"
}