{
    "moves": {
        "1. e4 c5 2. Nf3 d6 3. d4 Nc6 4. d5": "I wanted to gain space in the middle.",
        "4... Ne5 5. Nxe5": "I exchanged Knights so it would double Black's pawns on the e-file.",
        "5... dxe5 6. Bb5+": "Analysis by Fritz 8 says that White is ahead by almost a full pawn here.",
        "6... Bd7 7. Qe2 a6 8. Bxd7+ Qxd7 9. c4": "I made this move in order to fix Black's pawns on the dark squares in order to limit his Bishop's mobility.",
        "9... Nf6 10. h3": "This move was made to avoid an exchange on g4. I did not want to trade Queen's at this point since mine is crucial to holding my position together. I was focused on keeping my Pawns where they were. Fritz 8 says I should've made the move Nc3.",
        "10... b5 11. b3 e6 12. O-O Be7 13. Nc3 O-O": "I expected ...b4 here. In that case, I had planned on trying to get the Knight to b6 via a4. I realize now that the plan was faulty and Fritz 8 shows it to be a weak move.",
        "14. Rd1 exd5 15. Nxd5 Nxd5 16. Rxd5": "I wanted to control this d-file with my Rooks at any cost.",
        "16... Qe6 17. Bb2": "I made this move to force Black into the ...f6 move which put another pawn on the dark-squares, thus blocking his Bishop in even more.",
        "17... f6 18. Rad1": "Following through with putting my Rooks on the d-file.",
        "18... Rfd8 19. a3": "I realize now that this wasn't a good move. I didn't want to trade the Rooks by taking on d8, which is what Fritz 8 suggests.",
        "19... b4 20. a4": "I didn't take the Pawn because I knew it would free the Black Bishop.",
        "20... Rxd5 21. Rxd5 Rd8 22. Qd3 Rxd5 23. Qxd5 Kf7 24. f3 a5": "At this point, the draw was offered by Black. I was tempted to exchange Queens and knew that the Black King could not break through. Eventually the Pawns would be exchanged and the Black Bishop would be free to roam. I wasn't sure of my chances in the endgame so I accepted the draw."
    },
    "url": "https://gameknot.com/annotation.pl/league-division-d2?gm=62",
    "gameName": "League division D2",
    "players": "ecfchamps2002 (1606) vs. arvindmozumdar (1468)",
    "opening": "Sicilian, Chekhover variation (B53)"
}