{
    "moves": {
        "1. g4": "Grob's Attack. ",
        "1... d5": "According to Wiki (http://en.wikipedia.org/wiki/Grob%27s_Attack) 1. e5 is a significantly better try and this move opens the gate to many traps",
        "2. Bg2 Bxg4": "Compounding the issue by falling further into the trap but part of me was curious to learn the dangers.",
        "3. c4 Be6": "Not a good move but white is threatening Qb3 and eventually Qa4+ along with other dangers",
        "4. Qb3": "Attacking the b-pawn along with the light squared Bishop on the long diagonal should Black's d-pawn ever move which is fairly well forced",
        "4... Nd7": "Trying to save my rook from the coming invasion by the Bishop",
        "5. cxd5 Bg4 6. Qxb7 Ngf6": "I'm trying to develop pieces here as best as possible forgetting about the loss of the pawn",
        "7. d6": "This sets up a discovered attack on the Rook at a1",
        "7... Nb6": "Now I protect the Rook although at the cost of another pawn. ",
        "8. dxc7 Qc8": "I'm hoping for the Queen trade at this point because I at least save my Rook and hope to pick up the pawn fairly quickly thereafter thus escaping the mess with only minor damage",
        "9. Qxc8+": "9. Qc6+ Bd7 and Black is at least partially ok",
        "9... Rxc8 10. d3 Rxc7": "While this delays my development that c-pawn must go",
        "11. Be3 e6": "Now I'm trying to get my pieces out and make an active game for myself",
        "12. Nd2": "I'm not sure that White shouldn't try something like 12. h3 forcing Black to move about but there seems to be nothing wrong with this move",
        "12... Bb4 13. Kd1": "Giving up the right to castle rather cheaply. While the Knight is pinned Black cannot swoop in as it is well protected. I thought 13. Ngf3 Rc2 14. 0-0 Bxd2 15. Bxd2 wasn't better ",
        "13... Nbd5": "I'd love to be rid of that dark squared Bishop and with the Queens off the board I was planning on bringing the Rook directly into play without a castle",
        "14. Bd4 Ke7": "Trying to get my Rooks lined up and, while it is early to centralize my King I felt like I needed as many pieces in play as possible",
        "15. Be5 Rc6 16. Nc4": "Blocking down the c-file",
        "16... Bc5": "I'm trying to be as active as possible to keep White from marshalling an attack",
        "17. Bg3 Nh5": "I like to avoid putting the Knight in positions like this but I thought the f4 square looked awfully choice for my Knight and this proves to be accurate",
        "18. Bh4+ f6 19. f3": "19. ... Bf5 20. e4 is disastrous for Black so I must find counterplay",
        "19... Nhf4": "What a lovely square for my Knight and I started to take hope for the first time in this game",
        "20. fxg4 Nxg2 21. Bg3 Nge3+": "My Knights are working together like a pair of seasoned troopers in this game",
        "22. Nxe3 Nxe3+ 23. Kd2": "23. Ke1 Nc2+ forks the Rook and puts Black in the drivers seat",
        "23... Nxg4": "Material is even at last",
        "24. Nf3": "I'd like to say I planned for the series of moving coming up long in advance but I did not notice the Mate in Two until after fairly lengthy study. I was leaning towards 24. ... Be3+ 25. Ke1 Rhc8 and trying to force my way in but then spotted the game continuation.",
        "24... Bb4+ 25. Kd1": "The only move",
        "25... Ne3#": "And a pretty little mate. I was quite pleased with my play in this game because I didn't panic when confronted with a bad situation but slowly worked my way out of a hole and in the end my pieces worked extremely well in coordination with each other."
    },
    "url": "https://gameknot.com/annotation.pl/league-division-d3?gm=29352",
    "gameName": "League division D3",
    "players": "keithhomeyer (1329) vs. tomlib (1442)",
    "opening": "Grob (A00), Fritz gambit"
}