{
    "moves": {
        "1. d4 d6": "6:e vanligaste draget med 37-30 till vit.",
        "2. c4": "2:a vanligaste draget med 33-35 till svart. Vanligast är 2. Nf3 med 37-28 till vit.",
        "2... f6": "Ut ur worldbook, men draget är i botten på amatörboken som 17:e alternativ med 100 % till vit.",
        "3. d5": "+0,62 Ut ur teorin, där 3. e4 varit enligt boken med 100% till vit.",
        "3... e5": "+0,52, och 3...f5 hade varit gnuttan starkare.",
        "4. e4": "+0,52 och bästa draget i den positionen. Tar befälet över centern.",
        "4... c5": "+0,71 där 4...f5 varit bästa drag.",
        "5. dxc6 e.p.": "+0,54",
        "5... Nxc6": "+0,77",
        "6. Nf3": "+0,43, där 6. Bd3 varit starkare.",
        "6... Bg4": "+0,64 och svarts näst bästa drag. 6...f5 hade varit gnuttan starkare.",
        "7. Be3": "+0,35 och inte särskilt starkt. 7. h3 hade varit starkast med +0,64 i utdelning.",
        "7... Qa5+": "+0,92 och en aning förhastat. Svarts bästa drag är fortfarande avancemanget av f-bonden till f5.",
        "8. Nc3": "+0,72",
        "8... g5": "+1,83 och vit får tid att utveckla sig och förbereda rockaden.",
        "9. Be2 O-O-O": "Här borde jag observerat b4, och täckt upp det hålet med a3.",
        "10. O-O": "Men en rockad är inte fy skam ändå, och det står +2,12",
        "10... h5": "+2,54 och starkare hade 10...Nge7 varit med utveckling i fokus.",
        "11. h4": "+1,16 Ett uselt drag, och 11. a3 eller Rb1 hade varit betydligt starkare.",
        "11... Bxf3 12. Bxf3 g4": "+1,07 och jag får dansa fram och tillbaka med min L.",
        "13. Be2 Bh6 14. Nd5": "+0,92 och jag vill få upp mina trupper.",
        "14... Bxe3 15. Nxe3": "-0,17 och jag hade vunnit mer mark om jag slagit med bonden fxe3.",
        "15... Nd4": "Vill jag iväg svarts D här, så något optimistiskt förbereder jag det med a-bonden.",
        "16. a3": "-0,23",
        "16... Ne7": "-0,18",
        "17. b4": "-0,18",
        "17... Qa6": "Utjämnat läge -0,02",
        "18. Bd3": "Det bästa draget i den här positionen, och fortsättningen är något oklar.",
        "18... b5": "Svart öppnar upp positionerna, och det är vit som tjänar på det +1,38",
        "19. cxb5 Qb7 20. Rc1+": "+1,00 och vit har initiativet igen.",
        "20... Kd7": "Svart går åt fel håll, men jag ser inte det omedelbart och missar därför att gå upp med Qa4.",
        "21. b6": "Så det blir endast 1,00 till vits fördel.",
        "21... Qxb6 22. Qa4+": "Äntligen, och det här ger ett gott övertag på +4,71",
        "22... Nec6": "+7,62 men jag velar för mycket och missar det vinnande 23. Nd5",
        "23. b5": "+1,10 och jag är för orutinerad för att se kombinationerna så snabbt som jag borde.",
        "23... Ne7 24. Bc4": "+0,45 och mitt överlägsna övertag (som jag aldrig förstod att jag hade) är som bortblåst.",
        "24... Ng6": "Just som jag sade det, så får jag en chans till. Svart släpper bevakningen av d5 och nu ser jag situationen klarare.",
        "25. Nd5": "Sådärja, nu tar jag kommandot igen. +7,35",
        "25... Qc5": "+14,86 och skall en amatör som jag kunna utnyttja hela situationen fullt ut...?",
        "26. b6+": "+15,30 och jag behåller trycket mot svarts försvagade Kungsdomäner.",
        "26... Nc6": "Plötsligt gör jag rätt i flera drag, och det betalar sig. +17,45",
        "27. Bb5 Qd4": "Här ser man klart att svarts S är pinnad mot K, så jag hade lätt kunnat gå ner med Qxa7 och schackat.",
        "28. Bxc6+": "Men det här funkar också, och för ett proffs hade det här varit matt i 10 drag. För mig blir det några fler drag, men jag vittrar ett segrande övertag.",
        "28... Ke6 29. Nc7+": "Av någon anledning ser jag inte att Qxa7 är snabbare, och hade jag spelat så här mot ett proffs så hade han undvikit matten helt och hållet.",
        "29... Kf7 30. bxa7": "På vår nivå lönar det sig att tvinga motståndaren offra sin D, så jag går ner och hotar att promovera a-bonden.",
        "30... Nf4": "Svarts D och S ser farliga ut, så jag måste gå ur gaffeln på e2.",
        "31. Rc4": "+10,65 och ett tryggt övertag för vit.",
        "31... Qd3": "Nu är jag bra sugen på att kriga nere vid a8, och jag väntar mig ett gäng utväxlingar.",
        "32. a8=Q": "Svart slår säkert med T, och då får jag det till priset av en bonde.Vill sedan svart fortsätta striden så ryker bägge hans T.",
        "32... g3": "OK, då får man vara flexibel och ändra plan. Svarts agerande stärker ytterligare mitt övertag, och jag kopplar grepp med en schackning.",
        "33. Bd5+": "Eftersom min L täcker a8, kan jag frilägga 7:e raden och bygga upp ett mattnät. ",
        "33... Ke7": "Bättre hade varit Kg6.",
        "34. Ne6": "7:e raden frilagd och nu väntar jag mig strid vid a8.",
        "34... Nxe6": "Nähä, då passar det ju bra att 7:e raden är frilagd så lägger vi trycker där istället.",
        "35. Qa8a7+ Kf8 36. Bxe6": "Sådärja, nu känns matten inte alltför avlägsen.",
        "36... gxf2+": "Hoppsan, han ger sig inte. Möjligen överreagerar jag här och undviker den direkta konfrontationen med Rxf2",
        "37. Kh1": "Låt han få tornet, för det deltar ändå inte i mattsättningen uppe på svarts planhalva.",
        "37... Qxf1+ 38. Kh2 Qg1+": "Här gör jag en felkalkyl snart som svart gudskelov inte heller ser, för han kan promovera bonden till S och ta initiativet.",
        "39. Kg3": "Nu kan svart schacka mig med dels sitt T och en blivande S på f1.",
        "39... Rh7": "Aha...ibland har man tur.",
        "40. Qxh7": "Jävlar...om svart promoverar bonden till S så kan han matta mig istället. 40. Qxf2 hade varit det korrekta spelet här. Vit gav upp."
    },
    "url": "https://gameknot.com/annotation.pl/league-division-d3?gm=42990",
    "gameName": "League division D3",
    "players": "highlandt (1583) vs. straight-jacket (1332)",
    "opening": "Old Indian defence (A41)"
}