{
    "moves": {
        "1. e4": "Here's a kingside attack that actually worked!  My games recently have been littered with the other sort, hence my plummeting rating.",
        "1... c5 2. Nf3 d6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 a6 6. Bc4": "I revert to an old favourite, not actually considered a cutting edge response to the Najdorf these days.",
        "6... e6 7. Bb3": "I play this in order that if Black advances his d-pawn, I don't have to attend immediately to the bishop's safety.  From b3 it still drills through to f7, traditionally Black's weak point on the kingside.",
        "7... Be7 8. f4": "This is more aggressive than, and statistically slightly superior to, 8. 0-0, if my memory serves me correctly.",
        "8... Qc7 9. f5": "White hastens to attack while Black's king is still in the centre.",
        "9... e5": "The natural response, counter-attacking White's central knight but leaving a slight hole at d5.",
        "10. Nde2": "From here, the N can move to c3 to support the other N when it has gone to d5.  Alternatively it can go to g3 to defend e4 and, potentially, go via h5 to g7 or f6.  These options seem more flexible than those arising from 10. Nf3.",
        "10... Qc5": "Black occupies White's weakest diagonal, preventing castling.",
        "11. Na4": "So White harasses the enemy queen immediately.",
        "11... Qa5+ 12. Bd2": "The check has helped White to develop his remaining minor piece.",
        "12... Qc7 13. O-O": "At last White can castle.  The main advantage of this manoeuvre is to develop the rook, as the king doesn't look much safer on g1 than on e1, given that gaping diagonal.",
        "13... b5": "The N was controlling b6 and c5, so Black's pawn thrust is very pertinent, especially as the QB can now develop to b7.",
        "14. Nac3 Bb7 15. Ng3 Nbd7": "Black opens up his castling options, developing his final minor piece.",
        "16. Kh1": "Before launching an attack, White puts his king on a less exposed square.  I'd be interested in opinions as to whether this move, in this position, is a necessary prophylactic move or a waste of tempo.",
        "16... O-O": "Black makes his choice.  Now White knows where to concentrate his fire.  His pieces are reasonably well placed for action on either wing at this point but the bishops exploit their long range potential in the direction of the kingside.  So a kingside attack it is...",
        "17. Rc1": "First, White shifts the QR to c1 to oppose the enemy Queen and support the c-pawn in the event its other defenders desert it.  Possibly another wasted move or proper completion of development before undertaking decisive action?",
        "17... Nb6": "This N appears to be heading for c4 or supporting an advance to d5.",
        "18. Nh5": "The first aggressive gesture on the kingside, aimed at removing a key defender, the Nf6.",
        "18... Nxe4": "Black seizes the abandoned e-pawn.",
        "19. Nxe4 Bxe4": "Black is a pawn up and has a powerful looking central bishop.  In return, White nearly has control of f6 and an attack on g7.",
        "20. Qg4": "White threatens mate in 1.",
        "20... g6": "The threat has provoked a weakness in Black's defensive position.",
        "21. fxg6": "An interesting choice.  The other option was 21. f6, after which White has to single-mindedly manoeuvre his Q via g5 and h6 to g7 to deliver mate.  Black has to prevent the manoeuvre at all costs.",
        "21... Bxg6": "Black's powerful bishop assumes the role of a pawn.",
        "22. Bh6": "White's QB attacks the defending rook and the g7 square.",
        "22... Rfe8 23. Bxf7+": "Now f7 falls.  The B on g6 cannot recapture because of the pin by the Q.  Te K can't capture because of the Rf1.  All White's pieces except his QR are involved in the attack and mate is inevitable: 23....Kh8 24. Bg7++"
    },
    "url": "https://gameknot.com/annotation.pl/league-division-d1?gm=30055",
    "gameName": "League division D1",
    "players": "rjacobs (1513) vs. grogygrmln (1544)",
    "opening": "Sicilian (B90), Najdorf, Lipnitzky attack"
}