{
    "moves": {
        "1. Nf3": "White commenced with Nf3 preparing for e4 or d4 move.",
        "1... Nf6": "Black moved his knight to f6 and prepared to move his pawn to e5 or d5",
        "2. d4 d5 3. Ne5": "D file pawns were moved out and then white's knight came to e5 threatening the 7th rank.  ",
        "3... g6": "Black ignored the knight at e5 and continued his opening moves with g6 to allow his bishop to fianchetto.",
        "4. e3": "White moved out his e2 pawn to e3 supporting his d4 pawn.",
        "4... Be6": "Black moved his LB out to c6 also supporting the d pawn and the f7 pawn in case the e5 knight attacks.",
        "5. Bb5+": "White checks black king at b5 which can be dismissed with either my knights or bishop or queen (or maybe not).",
        "5... c6": "Black decides to move his c7 pawn out and stops the check by white.",
        "6. Ba4": "White's bishop retreats to a4.",
        "6... Nbd7": "Now b knight moves to d7 to provide support to the f6 knight and also threatening to take white's e5 knight.",
        "7. b3 Nb6": "White moves pawn to b3 to protect the bishop at a4.  Black knight moves again attacking the bishop at a4 whilst the knght at e5 is taken care of by the LB at e6 should he decide to attack.  DB is still waiting to fianchetto and black needs to castle.",
        "8. Qf3": "White moves queen to f3 but has still not finished developing his DB or b knight.",
        "8... Qc8": "Black moves queen across to c8 to support LB at e6.  The move Bg4 to attack the queen would not stand as e5 knight could take but black knight could retaliate.",
        "9. Nd3": "White decides to move knight back to d3 to protect his d4 pawn from pawn advance on c file which may be coming.",
        "9... Bg7": "Black fianchetto's his DB to g7 and this is the final piece to be developed.  Time to castle.",
        "10. Ba3 Qd7": "White moves DB to a3 attacking e7.  Black moves queen to d2 and now black can castle.",
        "11. Nf4 O-O": "White moves d knight to f4 and black castles.  I think black's pieces are looking quite good.  Threats are knight at f4 on black's bishop on e6 which is not major.  The queen is at f3 on the a8 diagonal but has a chain of pawns to d5 square.  The bishops are on the a file and DB is aimed at e7 but this is protected by queen at d7.  White king is in the centre still and knight still at b1.",
        "12. h4 h6": "White moves pawn on h file to h4 and black moves to h6.",
        "13. Nc3 Bg4": "Black is ready to attack and aims for queen by moving to g4 backed by queen at d7 and knight at f6.  White's knight is finally developed to c3 now protecting the LB at a4 along with the b3 pawn.",
        "14. Qg3 Ne4": "White queen moves across to g3 square so bishop cannot take so f6 knight joins the attack moving to e4.  The c3 knight can defend this move by black.",
        "15. Nxe4 dxe4": "So white takes knight at e4 and black moves d5 pawn to e4 and retakes white knight.",
        "16. Bc1 e5": "White moves his DB back to 1st rank to c1 square perhaps thinking that the queen would be moving onto the f8 diagonal.  However black moves e7 pawn to e5 forking white's knight and pawn.",
        "17. Ne2 Rac8": "F4 knight moves back to e2 and rook moves along to c8.  Not sure if this was the best file to move to maybe I did not want to move behind the queen on the d file to avoid being pinned.   Although that was a more open file and would be good for the rook to claim.",
        "18. c3 exd4": "White moves c2 pawn out to c3 and I take d4 pawn.  This pawn is protected by the fianchettoed bishop and queen.  Although the pawn at d4 now has no protection.",
        "19. cxd4 f5": "White takes black pawn at d4 and black moves f7 pawn to f5 to protect pawn at e4.  F5 pawn is also protecting bishop at g5 and queen is in a hole.",
        "20. Qf4 Kh7": "White queen moves into a square surrounded by black pieces which the queen is unable to take although the e2 knight is protecting her still and the pawn on e3.  The queen is on the diagonal to b8 and no other pieces are on the diagonal.  No threats or captures likely.  The king moves from g8 to safety onto the h7 square.",
        "21. Ng3 Nd5": "White's knight moves to g3 and black moves his b knight to d5 attacking the queen.",
        "22. Qxg4 Nf6": "White queen takes LB at g4 and black knight moves to f6 still attacking the queen.  I don't think I took the queen with my pawn at f5 as I did not want the knight coming in so close to the king.",
        "23. Qf4 h5": "Now the white queen moves back to f4 and black moves pawn to h5",
        "24. Bd2 Nd5 25. Qg5 Nf6": "White's queen moves to g4 - I must stop giving white these rest stops.  Black knight moves to f3 with protection from rook at f8 and bishop at g7.  Ready to defend if white's knight at g3 attacks the h5 square. ",
        "26. b4 b5": "White moves pawn to b4 and black replies with b5.",
        "27. Bb3 Ng8": "White's LB moves to b3 and black moves knight to g8 to provide protection to h6 square.",
        "28. Ne2 Qe7": "Whit moves g3 knight to e2 in case black queen tries to attack on b8 to a2 diagonal and black queen moves to e7 and attacks the queen at g5.",
        "29. Qxe7 Nxe7": "Black queen takes white queen and black knight retakes white queen at e7.  This has removed an attacker away from the king and things are a little quieter now.  For the moment!",
        "30. Nf4 Rf6": "Now white knight comes to f4 and black's rook moves to the 6th rank to f6.",
        "31. g3 Bh6": "White moves pawn to g3 to provide support to knight at f4 and also defending the king who is still in the middle by reinforcing the pawns.  I think he must have given up thinking of castling now!",
        "32. Rc1 a6": "White's rook moves to c1 and black moves pawn at a7 to strengthen pawns.",
        "33. Bc3 Rd6": "White moves bishop c3 tol protect pawn at d4 and find a better square to join in the attack.  Black moves f6 rook across to d6 which is a part open file with only 1 pawn at d4.  This file will enable the rooks to double up.",
        "34. O-O Rcd8": "Now white has castled. Never too late.  Black doubles up rooks by moving c rook to d8.",
        "35. Bb2 c5": "White moves DB to b2 from c3 as black has moved his pawn to c5 and is attacking a pawn at b4.  White's DB is still able to protect the pawn at d4 in the path of the doubled rooks.",
        "36. bxc5 Rf6": "White has taken pawn at c5 and black's rook moves along to f6.",
        "37. Ne2 Nc6": "White moves his knight to e2 and black's knight moves to c6 to stop the passed pawn in its tracks.",
        "38. Nc3 Nb4": "The knights continue their struggle with white's moving to c3 and black's to b4.  I am not sure why I took my black knight over there but it must have been the only piece I wanted to move at that time.",
        "39. a3 Nd3": "White moves pawn to a3 and attacks black knight.  Black moves knight to d3 attacking a bishop and rook.",
        "40. Rcb1 f4": "White moves c1 rook being attacked to b1 and black moves pawn to f5 attacking pawns in front of the king .  This pawn is protected 3 times and attacked twice.",
        "41. Nxe4 Rf5": "White knight is moves to e4 now providing protection to g3 and f2 pawns.  Black was not ready to break white's defences with the pawn at f4 so moves rook up to f5.",
        "42. Nc3 fxg3": "White's knight could not break out of the 4th rank to attack black's king as it would have been taken by either of the rooks.  So it retreated back to c3.  Now blacks f4 pawn breaks into the pawns protecting the king and takes the pawn at g3.",
        "43. fxg3 Bxe3+": "White's f2 pawn takes g3 pawn and black's DB takes pawn at e3 and checks king.",
        "44. Kg2 Rdf8": "White king moves out of check to g2 and rook moves along the 8th rank to f8 and rooks ar now doubled and ready to attack. White's rook is sitting at f1 but black's DB is attacking f2 square along with knight.",
        "45. Ne4 Rf5f7": "Now white's knight reappears at e4 and black moves rook back down the file to f7.  \nBlack moves back in order to provide protection for the king.",
        "46. Rf3 Rf7xf3": "White moves rook to f3 in order to avoid black's DB and knight but this suits black who moves rook up to take white rook at f3.",
        "47. Kh3 Nf2+": "White moves king out of the way to h3 which may give him an escape as can access g4 square except there is a black pawn protecting this square.  Now black moves knight to f2 to check king.",
        "48. Kg2 Nxe4": "King moves out of check to g2 and black takes knight at e4.",
        "49. Re1 Rf3f2+": "White moves rook along to e1 attacking bishop on e3 and black moves rook to f2 to check king supported by DB and knight.",
        "50. Kh3 Bf4": "White king moves to h3 again and black's DB moves to f4 to aboid being taken by white's e1 rook.",
        "51. Rxe4 Bxg3": "White takes knight at e4 and black moves bishop to g3.  White's bishops are still sitting at b2 and b3 and have not been the best bishops so far.",
        "52. Re7+ Kh6": "White decides to check black king with e7 move.  Black's king moves to h6 where he is protected by 2 pawns at h5 and g6.",
        "53. Bc1+ Bf4": "White's DB moves to check king at c1 and black replies with DB at f4 which is protected by the 2 rooks which are now on the f file.  This also allows black to take the bishop from the white king's clutches as it was at risk of being taken. ",
        "54. Bxf4+ Rf8xf4": "Now black's DB is taken by white's and this enables the rook at f8 to come down and take white's DB.",
        "55. Bd5 Rxd4": "The last bishop LB comes into the fray now by moving to d5 and black's rook moves along to d4 and picks up a pawn.  I moved the rook as the LB was blocking the square I would have used to check the king.  It was only a move in order to finish the job.",
        "56. Bg8 Rd3+": " LB moved to g8 to avoid being taken by the rook at d4 - white's LB could not affect the black king as the king was on a dark square.  Now black's d4 rook moves to d3 to check the king.",
        "57. Re3 Rxe3#": "The last move from white will be rook's move to e3 to block the check from black's rook but it is taken and its checkmate.\n\nI wanted to annotate this game as it is my highest rating and I think it was quite a good game.  From my side :)\n\nI am sure I will hear where I went wrong.  And look forward to your comments."
    },
    "url": "https://gameknot.com/annotation.pl/league-division-f3?gm=60786",
    "gameName": "League division F3",
    "players": "agoldenknight (953) vs. milly64 (1045)",
    "opening": "Reti opening (A05)"
}