{
    "moves": {
        "1. e3": "The Van't Kruijs Opening.  It's very non-committal at this stage, so I reply with something equally non-committal and flexible.",
        "1... Nf6 2. b3": "According to the database on 365Chess.com, which I've looked up for the purpose of this annotation, this is one of 17 continuations that has been played by White.  It's joint favourite with 2. f4. This looks like a typical Bent Larsen opening.",
        "2... g6": "Heading for my usual King's Indian formation which should work quite nicely with White having already eschewed e4.",
        "3. Bb2 Bg7 4. Nf3 O-O 5. Nc3 c6": "I'm first to deviate from \"the book\", if you can call it that.  365Chess.com gives 5...d6 and 5...d5.  The text move prepares ...d5 and gives Black's Q options on the d8-a5 diagonal.  Unfortunately, it also deprives Black's QN of its best square but I suspect I'd already decided to develop it to d7 anyway, to support the Nf6",
        "6. Be2": "White has a sort of reverse Queen's Indian formation but Black is not as committed in the centre as White would be if this were a normal Queen's Indian.  We're both developing very slowly and carefully here.",
        "6... d5 7. O-O Nbd7": "This shuts in Black's wsb but I didn't see this as a problem because it had nowhere sensible to go anyway: g4 is a poor square for the wsb when Black has fianchettoed and f5 doesn't look much better.  e6 would just hem in the e-pawn",
        "8. h3": "A mysterious waiting move, since I had no intention of moving anything onto g4.",
        "8... e5": "The first sign of serious aggressive intent in the game",
        "9. Nh2": "in the face of which, White retreats his N into the newly created hole on h2.  Perhaps 8. h3 was not a \"waiting move\" after all.  Presumably White wants to advance his f-pawn or maybe play Ng4 or deploy his B along the d1-h5 diagonal.  I decide I need to contest g4...",
        "9... Nc5": "Clearing the Bishop's way to g4 and also claiming control of e4",
        "10. Ng4 Nxg4 11. Bxg4 Bxg4 12. Qxg4": "The series of exchanges has rid me of my bad wsb for his slightly better wsb and got rid of both our kingside Ns, and left his Q somewhat exposed, so I lash out with a standard KI move",
        "12... f5 13. Qb4": "and the Q switches to the Q-side, attacking my undefended N and my b7 pawn, which will be undefended if my N moves.",
        "13... b6": "Black has an impressive looking wall of central pawns just waiting for White to snipe at it.",
        "14. Na4": "swinging to the rim to attack my N again and expose Black's e-pawn to the fianchettoed dsb",
        "14... Nd7": "Black's centralised N looks much better than White's peripheral one.",
        "15. Qd6": "White spots an unprotected square in the heart of Black's position and pounces.  The immediate threat is to the c6 pawn but that threat is easily met by ... Rc8.  More worrying for Black is the disruption that the intruder can cause to his plans and its proximity to Black's K, so Black defends the c-pawn with a more aggressive Rook move, which temporarily cuts off his B from his e-pawn but does tell the Q to buzz off straightaway.",
        "15... Rf6 16. Qa3": "White's adventures have left his Q looking rather silly.  With all those White pieces bunched on backward Q-side squars, now would be the time to launch a kingside attack.",
        "16... Qc7": "This move defends the e-pawn but also prepares for it to move forwards, when the time is right, exposing a Q attack on h2, and allows Black to double his Rooks on the f-file.   Black can also look to shut White's pieces in by advancing his c-pawn.",
        "17. f4": "a thematic advance by White, attacking e5 and blocking Black's own f-pawn",
        "17... Re6": "e5 is now well over-defended!",
        "18. c4": "White's assault on Black's centre proceeds swiftly.",
        "18... b5": "pushing the N back so that it will block the B.  Even if White diverts the c-pawn from its attack on the centre, the N will still have to move after Black recaptures on b5",
        "19. cxb5 cxb5 20. Nc3": "forking Black's d and b pawns, so ...",
        "20... Qc6 21. Bc1": "presumably preparing a retreat for the Q.  This move undevelops the B and disconnects White's Rooks, so there had better be a good reason for it!  White's d-pawn is now tied to the defence of his N, which is a further disadvantage of this move.",
        "21... Bf8": "I'm not sure about this move.  White was presumably planning to retreat the Q to b2 anyway, so there's not much point attacking it.  g7 was a better square for the B than f8, though there is an opportunity to redevelop it to d6 or c5, whence it can attack the K directly.",
        "22. Qb2 a5": "Not sure about this either.  I seem to have become determined to attack on the q-side, where all White's pieces are, rather than the k-side where they weren't.  Doesn't seem logical in retrospect.  White is gradually re-centralising his pieces while Black gains space on the q-side.",
        "23. fxe5": "odd timing...",
        "23... Nxe5": "Black's N looks very pretty :-)",
        "24. d4 Nd3": "such a tempting square, forking the Q and B",
        "25. Qd2": "The Black N is stranded out on a limb, so White attacks it",
        "25... Nxc1": "and as Black can't defend it, he has to swap it for White's bad B (retreating to b4 and then getting chased to a6 does not seem attractive).  So I'm not convinced of the rectitude of my play over the last few moves.  This does, however, leave me with a strong, unopposed dsb.  I remember reading somewhere that it is more important to consider what is left on the board after an exchange than what is being given up in the exchange (eg good N for bad B doesn't matter if afterwards Black's good B is even better).",
        "26. Raxc1": "Now White develops his R with tempo by threatening Black's Q",
        "26... b4": "Pinning the N with ...Bb4 might have been a worthy alternative.  The text move fixes White's q-side pawns and creates another square for Black's Q.",
        "27. Ne4": "? White exploits the revealed attack on Black's Q to redeploy the N via a square it couldn't otherwise have used.  In view of Black's reply, this move, while looking clever, is, in fact, a mistake.",
        "27... Qe8": "! skewering the N to the backward e-pawn",
        "28. Ng5 Rxe3": "a breakthrough!  Black is a clear pawn ahead",
        "29. Rc7": "but White has bought time to counter-attack.  A Rook on the seventh rank is always handy and h7 is under immediate attack.",
        "29... Re2": "Rather than defend h7, Black counter-attacks as well, skewering the White Q to the pawn on a2",
        "30. Qf4 Rc8": "completing Black's development on move 30!  If the White R takes on h7, Black plans to double on his seventh rank.",
        "31. Rf2 Re1+ 32. Kh2 h6 33. Nh7": "? 33. Nf3 would have been better",
        "33... Bg7": "trapping the N",
        "34. Nf6+ Bxf6": "Now Black has added a whole piece to his pawn advantage",
        "35. Rxc8": "but White swaps Rooks anyway.  There must be a tactical denouement coming up ...",
        "35... Qxc8 36. Qxh6 Qe8 37. Rc2 Bxd4 38. Qd2": "skewering B and p",
        "38... Be5+": "seems odd.  I must have looked at Bg1+ and rejected it. It looks strong, chasing White's K into the open eg 38...Bg1+ 39. Kg3 Qe5+ 40. Qf4 Bh2+! 41. Kxh2 Qxf4+ wins.  White could, however, have retreated to h1 when 39 ... Be3 with discovered check wouldn't have worked because the B would cut off Black's Q from defence of the Re1, so White could calmly respond with 40. Qxe1",
        "39. g3 Bc3": "a powerful square for the B but the passed d-pawn is not going to live any longer",
        "40. Qxd5+ Kh8 41. Qc4": "appears to prepare to swap White's R for a B and a p, or perhaps prepare an attempt at perpetual with Qh4+.  I think White should have grabbed the a-pawn while it was going.",
        "41... Re4 42. Qa6": "forking a-pawn and g-pawn",
        "42... Re5": "but the g-pawn was already defended so only the a-pawn needed to be defended on this move",
        "43. h4": "luft for the K, so that White isn't tied to the defence of e2.  It also restrains Black's k-side pawns",
        "43... Rd5": "Threatening to force a swap on d2",
        "44. a3 Rd2+ 45. Rxd2 Bxd2 46. Qxa5 Qe2+ 47. Kh3 Qg4+ 48. Kh2 Be1": "Threatening g3 but exposing the B to a fork in a couple of moves time",
        "49. Qd8+ Kh7 50. Qe7+ Kh6 51. Qxe1 bxa3": "So Black has lost his extra B but gained a remote passed pawn in compensation. Can he force it home?",
        "52. Qd2+ Kh5 53. Qa2": "White blocks the pawn at the expense of immobilising his Q",
        "53... f4": "Rather than tying his Q to the defence of the remote pawn, Black seeks to create another passer",
        "54. gxf4 Qxf4+": "There now follows a long series of checks while Black tries to solve the problem of how to keep the passed pawn, win one of White's pawns and retain the initiative.  There's also the possibility of skewering K and Q if White is careless and Black spots the opportunity at the right time.  Alternatively, a check from b2 will win it for Black.  I think it took me a while to realise this during the game.",
        "55. Kg2 Qg4+ 56. Kf1 Qh3+ 57. Kg1 Qe3+ 58. Kg2 Qe4+ 59. Kg1 Qg4+ 60. Kf1 Qf3+ 61. Kg1 Qd1+ 62. Kf2 Qd6": "62...Qd4+ followed by ...Qb2 would have been quicker",
        "63. Ke3 Kxh4 64. b4 Qxb4 65. Qf2+": "Now it's White's turn to play a series of checks",
        "65... Kg4 66. Qg2+ Kf5 67. Qd5+ Kf6 68. Qc6+ Kf5 69. Qc8+ Kg5 70. Qd8+ Kf5 71. Qd3+": "I couldn't understand why White was spurning opportunities to repeat position and get a draw.",
        "71... Kg5 72. Qd5+ Kh6 73. Qh1+ Kg7 74. Qa1+ Qb2": "!",
        "75. Qxb2+ axb2": "White resigned as he couldn't prevent the pawn from queening."
    },
    "url": "https://gameknot.com/annotation.pl/league-division-d1?gm=22355",
    "gameName": "League division D1",
    "players": "aghori (1651) vs. rjacobs (1575)",
    "opening": "Van't Kruijs opening (A00)"
}