{
    "moves": {
        "1. Nf3 d5 2. d4 Nf6 3. g3 e6 4. Bg2 Be7 5. O-O O-O": "By the book so far.",
        "6. b3 c5 7. dxc5 Bxc5 8. Bb2 Nc6 9. Nc3 Bd7": "Now both sides have cleared the minor pieces off the back rank and the real game begins.",
        "10. Na4 b6 11. Nxc5 bxc5 12. c4 Ng4 13. Ba3 Qa5": "The first major piece ventures out, combining attack and defense.",
        "14. Bb2 f6": "Creating \"luft\" and sealing the diagonal.",
        "15. cxd5 Nb4 16. dxe6 Bxe6": "I lost a Pawn in the mix-up but with my active pieces my positional advantage is sufficient compensation.",
        "17. e3 Rad8": "Seizing the only fully open file.",
        "18. Qc1 Nd3 19. Qb1 Nxb2": "Getting rid of White's only active piece.",
        "20. Qxb2 Rd7 21. Rfd1 Rfd8": "Doubling to keep control of the vital file.",
        "22. Rxd7 Rxd7 23. Ne1 Ne5": "Planning to again use the Q file, this time for my remaining Knight.",
        "24. Nc2 Nd3": "Seizing a powerful outpost with tempo.",
        "25. Qb1 Qd2": "Looking to mount a direct attack against the King and force a mate or decisive material gain. Note that White is horribly cramped, with no piece beyond the second rank or Pawn beyond the third. The *attack* is the way to exploit an opponent's cramped position.",
        "26. Na3 Qxf2+": "Forcing the King to the corner.",
        "27. Kh1 Nb2": "Clearing the vital Q-file -- my invasion route for the entire attack -- for the Rook's entry.",
        "28. Be4 Rd1+": "Winning Q and P for N and R, leaving me with a decisive material advantage in the coming end game.",
        "29. Qxd1 Nxd1": "Exchange is...",
        "30. Rxd1 Qxe3": "...complete, and with the King in the corner, White's B is tied to the long diagonal to prevent a Bishop mate.",
        "31. Rd8+ Kf7": "The value of \"luft\" -- if I hadn't made it earlier, the Rook check would have been mate.",
        "32. Bxh7 Bg4": "White overlooks the mating threat, and I move my B into position.",
        "33. Bg8+ Kg6": "Cutting off any spite checks.",
        "34. Nc4 Bf3#": "And that's a wrap."
    },
    "url": "https://gameknot.com/annotation.pl/league-division-d3?gm=39558",
    "gameName": "League division D3",
    "players": "pelangev (1243) vs. thehellion (1220)",
    "opening": "Reti opening (A06)"
}