{
    "moves": {
        "1. e4 e5 2. Nf3 Nf6 3. Nc3 Bb4": "This is the Three Knights position",
        "4. Nxe5 Bxc3": "I'm not sure if 4. ... d6 isn't a better move but I thought doubling the pawns might be a good idea.",
        "5. dxc3 d6 6. Nxf7": "This is typical of a Cochrane Attack with which I'm fairly familiar",
        "6... Kxf7 7. Bc4+": "They key for Black is to avoid getting the king hemmed into a mating net eventually getting the Kingside Rook to e8 and the King itself tucked into a castling position. White must try to avoid the activiation of that Rook.",
        "7... Be6 8. Bxe6+ Kxe6 9. O-O Re8 10. Bg5 Kf7": "This is a mistake I think. Better is 10. ... Nc6 getting another piece out and blocking off the eventually loss of the b-pawn. Something along the lines of 10. ... Nc6 11. Qd5+ Kd7",
        "11. Bxf6 Qxf6 12. Qd5+": "Now I lose more pawns",
        "12... Kf8 13. Qxb7 Nd7 14. Qxc7": "Those two pawns were extremely damaging even if I don't blunder the Knight later as White might well have been able to push his Queenside pawn majority down upon me forcing me to trade off the Knight in any case.",
        "14... Nc5 15. Rfe1 Rxe4 16. Qc6": "I'm not sure 16. Rxe4 isn't a little better as this move allows me to line up my Rooks. As my opponent won this game perhaps I'm wrong.",
        "16... Rae8 17. Kf1 Qh6 18. Rxe4 Nxe4": "We end up in the same position as if White had taken the Rook initially but now my second Rook is on the inviting e-file",
        "19. h3": "White cannot play 19. Re1 Nd2+ 20. Kg1 Rxe1#",
        "19... Qf6": "Threatening 20. ... Qxf2#",
        "20. f3 Qf7": "I was still looking at Knight checks on d2 and g3 but the major threats are now gone and I probably should have moved the Knight away from the danger",
        "21. Kg1 Ng3": "I'm still thinking aggressively at this stage and make a terrible blunder. My d-pawn is no longer protected.",
        "22. Qxd6+ Qe7 23. Qxg3": "Now the situation is dire for Black. The Queenside pawn majority is strong but the exposed position of the king eventually brings about the end of the game.",
        "23... Qb7": "Trying to play actively",
        "24. Qd6+": "There are just too many checks available that allow White to bring the Rook into the game",
        "24... Kf7 25. Qf4+ Kg8 26. b4 Qb6+": "Grasping at straws hoping for a perpetual that does not exist.",
        "27. Kh2 Re3": "Again trying to snatch pawns",
        "28. Rd1 Rxc3": "Better is 28. ... Re7 preventing white from getting his Rook to the seventh rank",
        "29. Rd7": "Now the mating threats are coming from all directions. 29. ... Rc8 30. Qf7+ Kh8 31. Qxg7# or 29. ... Qg6 30. Rd8+ Qe8 31. Rxe8#",
        "29... Qf6 30. Qb8+ Qf8 31. Rd8": "The death blow. There is nothing Black can do now so I resigned. I thought this was a fun game started by my opponents daring Cochrane style attack. While I had my chances my opponent kept up the pressure and took advantage of my mistakes to slowly improve his position and eventually gained a winning attack."
    },
    "url": "https://gameknot.com/annotation.pl/league-division-d3?gm=29720",
    "gameName": "League division D3",
    "players": "larryslade1 (1455) vs. tomlib (1478)",
    "opening": "Petrov three knights game (C42)"
}