{
    "moves": {
        "1. d4 f5": "I have been starting with the standard Reti opening line for my matches to try and build off a solid base. The opening concedes the center almost immediately however it helps me develop my pieces in a smooth manner. ",
        "2. g3 Nf6 3. Bg5 b6": "The computer analysis stated I should have played Nc6 here instead. That would have kept with the standard Reti however I wanted to try something different. ",
        "4. f4 Bb7": "The h1-a8 diagonal is open however that will be short lived. ",
        "5. Nf3 Ne4 6. Bh4 d5 7. Ne5 Nd6": "I can't remember why I moved N on e4 back however I believe it was to ward off the potential for Nf7.",
        "8. e3 c5": "Computer analysis tells me that I should have moved g6 instead. In retrospect, that probably would have been the better move. It would have connected the pawn chain on K side and provided a barrier between my opponent moving Qh5+. That would have completely changed the scope of the match. It was definitely an oversight on my part. So far I would say that my ability to recognize diagonal threats is weak.  ",
        "9. Be2 Nc6 10. Nf3 Nc4": "It is still early and we are both still developing. I left my N open for capture with slight protection from the pawn on d5. Initially I was thinking of moving my N to b2. ",
        "11. g4 Nxe3": "However, I saw an open pawn and went for the kill. This position also forced the Q to move, whether that is good or bad yet. I am not sure. ",
        "12. Qd3 Ng2+": "The check here prevented any potential for castling and as the match progresses works to my benefit. The computer analysis recommended my moving Ncb4 instead. I couldnt tell you why that would be more beneficial looking at the board. ",
        "13. Kf2 Nxf4": "I decided to go with Nxf4 vice Nxh4 due to the ability to keep my N in play. Nxf4 would have left me with a larger material advantage however the B on H4 was not an immediate threat that I was concerned about. ",
        "14. Qxf5 Qd6": "I moved my Q to d4 to provide protection to my N on f4. Computer analysis says I should have played Nxe2. However, I still dont like that choice. I could be wrong. ",
        "15. Ng5 e6 16. Nxe6": "Seemingly, my opponent forced an exchange on N's. ",
        "16... Qxe6 17. Qxf4 Nxd4": "I took the opportunity to capture the vulnerable pawn. My N still had protection from the pawn on c5 so I viewed it as a safe capture. Simultaneously, it forced my opponent to make a decision with his B. ",
        "18. Bd1": "He chose retreat. This helped develop the situation that would follow suit as his pieces slowly left his K isolated. ",
        "18... Bd6 19. Qd2 O-O+": "The move 18 threat on the Q opened up the move 19 castle with check. ",
        "20. Kg2 Qe4+": "I slowly maneuvered my pieces into position one check at a time. I was careful to run the possibilities and see what moves would leave my opponent with an easy escape. ",
        "21. Kh3 Rf3+ 22. Kg2": "This leaves me with a nice discovered check and the movement of Rg3+ gives mey R protection from the B on d6. ",
        "22... Rg3+ 23. Kf2 Rf8+": "I ran through the possibilities and decided that Rf8+ was a better option than moving back into a discovered check position or moving Rg2+. ",
        "24. Bf3 Rfxf3#": "Checkmate."
    },
    "url": "https://gameknot.com/annotation.pl/league-division-e2?gm=55677",
    "gameName": "League division E2",
    "players": "knightrw1110 (969) vs. jallen85 (1030)",
    "opening": "Dutch defence, Blackburne variation (A81)"
}