{
    "moves": {
        "1. c4 Nf6 2. Nc3 g6 3. d4 d6": "? c6 seems a stronger reply, followed with d5 and asserting some control of the centre. Continuing from the text move, Black might be considering c5 or e5 shortly.",
        "4. e4 Bg7": "? This seems out of step with Black's defence some how, better might be to continue c5, or e5 to prevent White's e5.",
        "5. f4": "Common is Knf3 instead, the text is playable but not favoured.",
        "5... Na6": "Non-standard, but seen in H Rob Evan der Plas vs Valery Vladimirovich Pankratov 1996 ending in a draw.  More usual is ..0-0.  I find the text move too passive: it achieves some development, but apparently for its own sake.",
        "6. e5": "! Direct.",
        "6... dxe5 7. fxe5 Ng4": "? Although it keeps Black's position open, this knight is hanging and will draw attention from White's pieces. White gains time in spades. Black might have considered instead Knh5 though best might be Knd7.",
        "8. Be2 h5": "White is being allowed to dictate the shape of Black's defence, making him play some unwelcome moves. Even Knh6 instead would prove uncomfortable in a few moves.",
        "9. h3 Nh6": "One of few options for the knight, but again unwelcome -- he'll have to move again once White develops his black square bishop and his Queen to d2.  Possibly worthy of consideration is the energetic ..Knxe5 instead.",
        "10. Bf4 Nf5": "Not a bad place for Black's knight, but it has come at some cost in time -- 3 of the last 4 moves by Black have involved this piece alone! In any case White would otherwise follow with Qd2, threatening to win a piece. Black's knight would have to move again or be supported, costing more time.",
        "11. d5": "Largely forced -- White's centre would crumble on the loss of this pawn, advancing finds safety and pressure. Note if Black had considered say c6 earlier, this move would not hold nearly the same strength.",
        "11... Nc5": "? Again, this is a good square for a knight but it has come at some cost -- the text is fairly premature as it's not clear what this move achieves, Black could have done this later, and it does nothing about White's advance.  Black's development is on the slow side.  Better might be ..e6.",
        "12. g4": "! White continues to cramp Black without hesitation.",
        "12... hxg4 13. Bxg4 e6 14. Qd2": "Develops while giving a good flight square to the White King. [Any exchange of pawns can wait.]",
        "14... Qh4+": "? Even though White's King has yet to castle in an open position, he is difficult to attack.  After sidestepping to d1 -- on the way to relative safety -- it remains a task for Black to find a way in, while still leaving enough time to protect his own King. This move was anticipated by White's 14. Qd2.",
        "15. Kd1 Qxg4+": "?! This came as a surprise to White. The only impression I can make is that Black, in making this sacrifice, is going straight for White's King.  However, I'm also of the opinion that this is a blunder by Black as the text will show -- he should note that, upon winning White's h-rook, the key square h2 is covered by White's black square bishop and his Queen. Moreover, when the White King moves again, to c2, White's knight is no longer vulnerable. There seems no way for Black to make good his loss (in this open position, his Queen counts for a lot). Further, Black has neglected his own development, giving up his active Queen while a bishop and rook are stuck at home. Last, even in this open position, I cannot see how Black will have the time to profit from the long h-file as the initiative stays with White.",
        "16. hxg4 Rxh1 17. Kc2": "! Protects the Knight, avails the rook, avoids a check, and finds safety.  A fine move.  Note, the key h2 square is very well protected, so White will retain the initiative unchecked, beginning with a fork on c7. That open h-file is not intimidating at all -- Black is not sufficiently developed to exploit it.",
        "17... Ne7": "In view of Black's material deficit and lack of attacking options, this is forced and costs further time.",
        "18. Nb5": "! Aiming right at c7. Black's position is such that there is no satisfactory defence. It's at times like these, that one really needs that Queen.  What follows is just technique.",
        "18... Na6": "Somewhat forced, but still White is not prevented from playing Knxc7 immediately.  The alternatives don't look great either.  Placing the King on the d-file is not on, and Kf8 offers only temporary respite [White continues d5-d6, promising to place his Queen on d8 after any exchange].",
        "19. Nxc7+": "! White will open up the d-file and prevent Black's king from finding safety, for a decisive endgame.",
        "19... Nxc7 20. d6 Ncd5 21. dxe7": "The correct choice -- Black cannot capture White's bishop without conceding instant mate.",
        "21... Nxe7 22. Rd1": "Threatening mate on d8 once again.",
        "22... Nc6 23. Bg5": "! Continuing to threaten mate, with Qd8 next and mate in two.",
        "23... Bd7 24. Qxd7+ Kf8 25. Qxb7": "! White is interested in displacing Black's rook on a8 (this isn't a pawn grab), the only piece preventing a back row mate. Beware of ..Rb8 too -- White will happily sacrifice his Queen, or else face perpetual check, but then is still guarranteed mate in two.",
        "25... Rh2+": "One of very few options left for Black.  Teeing up the threat of perpetual check is the best plan now, but it will need a particular error by White to work.",
        "26. Kb1 Rb8": "Again, natural for Black to set up a (classical) perpetual check.  If White does anything other than trade his Queen here, he will draw.  Upon sacrificing his Queen, it is mate in 2...",
        "27. Qxb8+": "To continue ..KnxQb8 Rd8#."
    },
    "url": "https://gameknot.com/annotation.pl/league-division-c3?gm=7202",
    "gameName": "League division C3",
    "players": "another_ken (1760) vs. oldtimer (1798)",
    "opening": "English opening (A16)"
}