{
    "moves": {
        "1. d4 f5 2. Nf3 Nf6 3. e3 b6 4. Bd2 Bb7 5. Bd3 g6 6. O-O Nc6 7. h3 d6 8. Ng5": "? It is not clear what White is intending here (maybe next Kne6 Qd7, d5), but whatever it is only wastes time and brings him trouble...",
        "8... Qd7": "Finishes Queen-side development, and allows Black to castle Queen side as well as covering e6",
        "9. b4": "To continue b5 no doubt, displacing Black's knight.  Too slow...?",
        "9... e5": "! Challenging for central control, and giving Black a good flight square for his knight on c6",
        "10. b5": "White's pawn on b5 cramps his white square bishop, a bonus for Black! What's more, Black will be able to offer his king excellent safety on the queen side just as soon as he can safely play a5(!)",
        "10... Ne7 11. Qe2": "?! White needs a flight square for his knight on g5, other than f3. White should consider d4 or h4 instead",
        "11... Bh6": "! White should have seen this coming, and played d4 or h4 in advance",
        "12. Nf3 e4 13. Ne1 exd3 14. Qxd3 a5": "! An important insurance move for Black conceived on move 9, for upon b5-a6x Black's white square bishop threatens a nasty pin and Black has the a-file all to himself. Anything else, and Black can castle Queen side without ever having to worry about a pawn storm from White -- his pawn structure is impervious, and White's b-pawn is blocking a6 (even White's knights cannot land there). This move seems to guarantee Black's future.",
        "15. Nc3 O-O-O 16. Qc4": "Winning some space, for Queen and knight",
        "16... g5": "! Black is initiating a kingside attack.",
        "17. Nd3 Bg7": "Clearing the way for Black's h-pawn",
        "18. a4": "? Cramping White's position further! Qf7 might be tempting here, but it only brings about an exchange of queens. Such an exhange only favours Black here -- he now has the White squares all to himself.",
        "18... h5 19. Qf7 Ned5": "! Forcing an exchange of queens, only good for Black here",
        "20. Qxd7+ Rxd7 21. Rae1 Nxc3": "Exchanging favours Black, while opening the main white diagonal and freeing up e4 for a knight -- winning more material!",
        "22. Bxc3 Ne4": "Gaining time and material for Black...!",
        "23. Bxa5": "Any other move by the White bishop costs White's f-rook (for the Black knight)",
        "23... bxa5 24. Kh1": "? For want of something to do?",
        "24... g4": "! More pressure on White's vulnerable position...",
        "25. Nf4 g3": "White cannot take the pawn on g3 on his next move",
        "26. f3 Nd2 27. Rfg1 Nxf3": "! A useful sacrifice -- Black is cramping White's position, and will win plenty of time/material at the very least",
        "28. gxf3 Bxf3+ 29. Ng2 h4 30. Reb1 Kb7": "Black's king will cover c5, closing off White, gaining time and protecting himself further",
        "31. c4 Kb6 32. Rbf1 Be4": "! Immovable.  White's position is decidedly cramped.",
        "33. Rf4 c5": "! Black will bring a rook to an open file shortly",
        "34. bxc6 e.p. Kxc6 35. Rc1": "Some breathing space for White's king, but at some cost -- time, material at least!",
        "35... Rb7 36. Kg1 Rb2 37. d5+": "? Black's second bishop now permanently enters the game!",
        "37... Kc5 38. Nxh4": "Stalling",
        "38... Bh6": "! White cannot save a rook here. Even so...",
        "39. Nf3 Bxf4 40. Rf1 Bxe3+": ""
    },
    "url": "https://gameknot.com/annotation.pl/league-division-c3?gm=6784",
    "gameName": "League division C3",
    "players": "palmada (1636) vs. another_ken (1824)",
    "opening": "Dutch (A80)"
}