{
    "moves": {
        "1. d4": "I want to play the old benoni and avoid the queens gambit and queens pawn games.",
        "1... c5 2. dxc5": "Most unusual and it caught me off guard.",
        "2... e6": "Attack and prepare to develop",
        "3. Nf3": "White is not concerned about his pawn here because it is not a true gambit.",
        "3... Bxc5 4. e3": "This bishop attacking this diagonal is a central theme in this game.",
        "4... Nf6 5. Bc4": "Bd3 was better.",
        "5... a6": "Preparing to drive away his bishop",
        "6. Nc3 d5 7. Bb3 Nc6": "No immediate threats to my kingside so I develope my c knight with my eye on d4",
        "8. O-O O-O 9. a3": "I really did not understand this move",
        "9... d4": "white is forced to flee his knight or take with the pawn.  If he does the former he will not have a good square for his knight",
        "10. exd4 Nxd4 11. Nxd4 Bxd4": "I still have pressure on his f2 square",
        "12. Ne2": "And now he decides to eliminate the attacker",
        "12... e5": "I should have retreated my bishop because I might need him later in the game since it is an open game.",
        "13. c3 Bb6": "Ba7 would have been better.",
        "14. Bg5 Bg4": "I develop my light squared bishop doing a pin of my own.  Notice he cannot do f3 because he would be in check by my dark squared bishop",
        "15. Qxd8 Raxd8": "In hindsight I should have taken back with the bishop because he can take my knight and double up my pawns on the kingside",
        "16. Ng3": "first he must find a safe square for his knight.",
        "16... h6": "h6?  why not Rd6?  A big blunder on my part.",
        "17. Bxf6 gxf6 18. Ne4": "Now the knight goes after the doubled pawn.",
        "18... Kg7": "I try defending both pawns with my king.",
        "19. Kh1": "White wants to attack my light squared bishop",
        "19... f5 20. Ng3 Rd2": "Now im double attacking his b pawn and his once guarded f pawn",
        "21. f3": "He finally attacks my bishop but I take his b pawn threatening his bishop",
        "21... Rxb2 22. fxg4 Rxb3 23. Nxf5+": "equal game here",
        "23... Kg6": "guarding my h6 pawn but look at my kings position on the board and then look at his!",
        "24. Nd6 Bc5": "Trading pawns",
        "25. Ne4": "White blunders here.  He should have taken the bpawn and I just simply take his a pawn and run for protection.",
        "25... Bxa3 26. Rf6+ Kg7 27. Rf3 b5": "Now i get my bpawn into play",
        "28. Nd6 Bxd6": "White blunders here and i take the knight for free.",
        "29. g3 Ra3": "Process of elimination",
        "30. Rxa3 Bxa3 31. c4": "tempting to take but I advance it instead",
        "31... b4 32. h4 Rc8 33. Kh2": "Now ill queen a pawn now that i can take his c pawn.",
        "33... Rxc4 34. Rb3 Rc3": "White resigned"
    },
    "url": "https://gameknot.com/annotation.pl/league-division-d3-old-benoni-defense?gm=29554",
    "gameName": "League division D3/Old Benoni defense",
    "players": "salmon_slayer63 (1295) vs. dungeonking (1337)",
    "opening": "Old Benoni defence (A43)"
}