{
    "moves": {
        "1. e4": "Hi everyone!\r\n\r\nI am happy to announce a welcome victory with an emphatic ending.  The last time I ended up delivering checkmate was on 08-Dec-08, that was a couple of months before I ended up having lessons on mounting mating attacks from Freddy, the Master Mater.  Well, hopefully it is starting to filter through.  Here I am playing The Dentist who has returned from another sabbatical.",
        "1... Nc6": "1. ...... Nc6 - Nimzowich's Opening.",
        "2. Nf3 f6": "2. ...... f6 - this move looks rather weak as it opens up the Fool's Mate diagonal and deprives the king knight of his normal square f6.  Mind you, Master Freddy played it in a game against a player near his own rating so it can't be too bad here!  One word of caution is that Freddy did lose that game http://gameknot.com/analyze-board.pl?bd=10328022&mv=7&rnd=0.25780495819961885 but whether that was the losing move is open to debate!",
        "3. d4 g6 4. Bc4": "4. Bc4 - my opponent's last move took me out of the db but I fall back on the old OTB principle of good normal sensible development here with Bc4.",
        "4... Bg7 5. c3 Na5 6. Bd3": "6. Bd3 - choosing to preserve Fou Leblanc.",
        "6... a6 7. b4 Nc6 8. Qb3": "8. Qb3 - Glenda moves to b3 and her beady eye is on the squares f7 and g8.  Black will have difficulty castling kingside.",
        "8... e6 9. O-O b5 10. Re1": "10. Re1 - centralisation.  My pieces will develop in due course - correction, Fou Lenoir will develop in due course.  Funnily enough my knight stays on b1 for the whole of the game!",
        "10... Bb7 11. a4 bxa4 12. Rxa4": "12. Rxa4 - pawn trade.",
        "12... Qb8 13. d5 Nd8 14. Bc4": "14. Bc4 - putting pressure on e6.",
        "14... Bc8 15. dxe6 dxe6": "15. ...... dxe6 - pawn trade.",
        "16. Nd4": "16. Nd4 - more pressure on e6.",
        "16... Bd7 17. Ra2 Qb6": "17. ...... Qb6? - loses pawn as you will see.",
        "18. Be3": "18. Be3 - first a sneaky line up behind the steed staged by Fou Lenoir on the Wicked Witch of the West - may gain a useful tempo here should black play e5.  Notice the line up of Fou Leblanc and Glenda on g8 - this will also be extremely useful to me later on. ",
        "18... Qb7 19. Nxe6": "19. Nxe6 - I now grab the free pawn on e6.  Black takes with the knight.  I retake with the bishop.",
        "19... Nxe6 20. Bxe6 Qxe4": "20. .......... Qxe4?? - black couldn't resist grabbing the e pawn because he thinks he will get his pawn back.  Better was Bxe6 then Qxe6 but after that black stands worse, a pawn down + Glenda in his arc, not pleasant.  However, in this line he now drops a whole piece.  Fou Leblanc swipes the knight on g8 with impunity because Rxg8?? will allow Qxg8+.",
        "21. Bxg8 O-O-O": "21. ........ 0-0-0 - black castles queenside but look at the a column, I now have a plan of attack which black is completely oblivious to.",
        "22. Bc4 Bh6": "22. ....... Bh6?? - misses a big combo, wait for it ......",
        "23. Bxa6+": "23. Bxa6+! - the BK is forced to b8, wait for it .......",
        "23... Kb8 24. Ba7+": "24. Ba7+!! - well guys and dolls here it is - a discovered attack.  Fou Lenoir checks the king.  Fou Lenoir can be taken but look - the Wicked Witch is en prise to the rook on e1.  Black cannot save her.  If it had not been for the check on a7 then Qxe1 would have been mate but it is check and Qxe1 is illegal, so next move it is, ding dong ........",
        "24... Kxa7 25. Rxe4": "25. Rxe4 ............ THE WICKED WITCH IS DEAD!!!",
        "25... Kb8": "25. ...... Kb8 - The dentist decides to move out of the way of another discovery, but after my next move he is doomed.",
        "26. Qd5": "26. Qd5 - after taking a pedestrian role on b3, Glenda springs into life and for the BK that means death!  It is now mate in 5.   Here are some variations and I set up conditional moves for all of them:- \r\n\r\nVariation A\r\n\r\n26. ... Bc6 \r\n27. Qxc6 Rd1+ \r\n28. Bf1 Rxf1+ \r\n29. Kxf1 Kc8\r\n30. Ra8#\r\n\r\nVariation B\r\n\r\n26. ... c6 \r\n27. Qd6+ Ka7 \r\n28. Qc7+ Ka8 \r\n29. Qb7# \r\n\r\nVariation C\r\n\r\n26. ... c6 \r\n27. Qd6+ Ka8 \r\n28. Bc8#\r\n\r\nVariation D\r\n\r\n26. ... Bc6 \r\n27. Qxc6 Rd1+ \r\n28. Bf1 Rxb1 \r\n29. Ra8#",
        "26... f5": "26. ....... f5 - but this move attacking my rook allows mate on the move.",
        "27. Qb7#": "27. Qb7 MATE!!! - Hail Glenda the Offender!"
    },
    "url": "https://gameknot.com/annotation.pl/learning-from-the-master-mater?gm=24516",
    "gameName": "Learning from the Master Mater",
    "players": "jstevens1 (1776) vs. The Dentist (1258)",
    "opening": "KP (B00), Nimzovich defence"
}