{
    "moves": {
        "1. e4": "We had trouble finding the venue due to somewhat vague directions, so started with a 15 minute time deficit.",
        "1... c5 2. Nf3 d6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 Nc6 6. Bc4 e6 7. Be3 Be7 8. Bb3": "Removing the possibility of Nxe4 followed by d5, also a kind of waiting move that means black won't gain a tempo with a later Ne5",
        "8... O-O 9. f3": "Preparing Qd2 and preventing Ng4, also supporting a later king-side pawn advance in anticipation of opposite side castling.",
        "9... Bd7 10. Qd2 a6 11. g4 Nxd4": "As he follows this with Bc6 then maybe Rc8 was better waiting to see if I decide to swap Knights.",
        "12. Bxd4 Bc6 13. O-O-O Nd7 14. h4": "I was quite happy to sacrifice the rook pawn as Qh2 seems good for white.",
        "14... b5": "Shredder has given the position as fairly even so far and likes this move",
        "15. Ne2": "I figured that the knight will have to move anyway with b5 looming and thought it wise to make a few defensive moves, making the c2 square available for my Bishop as it could get trapped on b3, and in the long term it may able to exert pressure on h2.",
        "15... a5 16. c3 Rc8 17. Kb1": "Now I think my defense is okay so I can carry on with directing my forces towards the king-side again.\nI felt Kb1 was necessary as is quite often the case with queen-side castling, especially after his rook move.",
        "17... Bxh4": "He finally can't resist taking the bait.  Shredder thinks this is a mistake and gives 17...a4 as slightly better for black!  ",
        "18. Be3": "Attacking d6, making d4 available for my knight, clearing the second rank to prepare Qh2.  According to Shredder this is not very good as it now plays 18...Ne5 with black +1.20.  White would probably have to respond with 19. Qxd6 as Nd4 does not prevent 19...Nxf3 due to 20. Nxf3 Bxe4+ I think I appear to have more attacking chances but did I go wrong as 18...Ne5 does look strong and my king-side pawns would have become very weak had he played it, having said that I'm not sure black should be too greedy as white is still poised to attack blacks king.  Maybe 18. Bc2 is better as in the short term as it nullifies the threat of Ne5 (with the idea of Nxf3) and in the long term increase the pressure on h7.... then after 18. Bc2 Ne5, 19. Rh3 Nc4, 20. Qf4 e5, 21. Qh2 g5, 22. Bf2 still leads to a winning position for white, due to the open h file with Rdh1 soon to follow.",
        "18... Be7": "This must have been a turning point as Shredders evaluation now favours white.",
        "19. Nd4 Nc5": "Shredder prefers a4 but still gives it a +2 for white.",
        "20. Qh2": "attack is now winning (+5.56)",
        "20... h6": "Bh4 may prolong things but white can respond with g5 (as the pawn can't be taken) followed by Qxh4",
        "21. Bxh6": "Black resigns... \n\nif gxh6 then black will win with Qxh6.  If 21...Bh4 then 22. g5 is winning (Shredder gives white +6.79 and played 22...Bg3 but after Qh3 its evaluation changed to +17.03, then it incredibly announced a mate in 15!...... but given a few more minutes it reduced it to 12.  (M12+)  \nwhich I had spotted of course? ha ha\n\nThanks for looking.  Interested in any comments."
    },
    "url": "https://gameknot.com/annotation.pl/leics-i-v-worcsi-sicilian-h-pawn-grab?gm=42988",
    "gameName": "Leics I  v  WorcsI  (Sicilian, h Pawn Grab!?)",
    "players": "John Wrench (165) vs. Dave Farrall (168)",
    "opening": "Sicilian (B57), Sozin, not Scheveningen"
}