{
    "moves": {
        "1. d4": "I like it when white opens with d4, as it creates an opportunity to play the Dutch. In this battle black will advance on the king side and sacrifice a pawn and a rook in the final combination.",
        "1... f5 2. c4 d6 3. Nc3 Nf6 4. Bf4 g6 5. Nf3 Bg7 6. e3": "A king side fianchetto is usually recommended for white. But this is also a pretty normal response for white.",
        "6... O-O 7. Be2 Qe8": "The fashionable Qe8 version of Leningrad Dutch.",
        "8. O-O c6": "Trying to discorage Nb5, with the threat of Nc7 forking the queen and the knight.",
        "9. Qb3": "Seen a lot on gameknot. Supposed to be an unusual but playable move.",
        "9... Kh8": "White threatens a discovered check after c5.",
        "10. d5": "This is a very normal move as well. It should probably not be used together with the Qb3.",
        "10... Na6 11. Ng5": "The placement of the knight on g5 and the bishop on f4 will be a big help for black when he starts to advance his king side pawns.",
        "11... Nc5": "The knight homes in on its best sqaure, and threatens the queen at the same time. The queen blocks a b4 pawn advance that could chase the knight.",
        "12. Qd1 a5": "Discouraging b4.",
        "13. Qe1 Bd7 14. Bd1 h6": "Starting the pawn advance. Winning one tempo because white must move the knight.",
        "15. Nf3 g5": "Winning another tempo as white must move the bishop.",
        "16. Bg3 e5": "The bishop on g3 is almost locked in. Preparing f4.",
        "17. h3": "Creating an escape square for the bishop. White could have trid dxe6.",
        "17... g4": "Sees the opportunity to open the h file for the queen.",
        "18. hxg4": "As the knight is threatened, white cannot avoid a pawn exchange opening the g or h file.",
        "18... Nxg4": "Having the knight influence the h2 square, which is a potential mating square for the queen. fxg4 looked like a good option as well.",
        "19. Bc2": "Attacking the f5 pawn.",
        "19... Qh5": "Protecting the f5 pawn as well as binding white pieces to the defence of h2.",
        "20. Nh4": "Locking the queen out, and again attacking the f5 pawn.",
        "20... e4": "Avoids the return of the knight to f3 and protects the f5 pawn from the c2 bishop. Also limits that bishops range.",
        "21. Bd1": "Pinning the knight.",
        "21... Be5": "Attacking both the g3 bishop, and the h4 knight which is protected by it.",
        "22. Bxg4": "Exchanging to get rid of the mating threat on h2.",
        "22... Qxg4": "Queen must retake or be taken.",
        "23. Ne2": "Protecting the g3 bishop.",
        "23... Bf6": "Attacking the h4 knight, which is now underprotected.",
        "24. Bxd6": "Grabbing a pawn and forking the knight and the rook.",
        "24... Qxh4": "The computer revealed Nd3, moving the knight out of danger and threatening the white queen.",
        "25. Bxc5": "Better than grabbing the rook. Now white is a pawn up.",
        "25... Rfg8": "Moving the rook to safety and intensifying the attack against the king.",
        "26. Ng3": "Protecting the g2 pawn pawn against the rook and attacking the e4 and f5 pawns.",
        "26... Be5": "Controlling an important diagonal. If white gains control of this, the knight on g3 will be hard to get rid of.",
        "27. Bd4": "Pins the bishop to the king.",
        "27... Bxd4": "The exchange opens up the advance of the f pawn. Better than the alternative Rae8.",
        "28. exd4 f4": "Sacrificing the pawn on e4 to get the knight out of the way.",
        "29. Nxe4": "Now its forced.",
        "29... Rxg2+": "Sacrificing the rook to get rid of the g2 pawn.",
        "30. Kxg2 Qh3+": "Getting the king away from its escape exit at f3.",
        "31. Kg1 f3": "White resigned. White have no moves to avoid Qg2#"
    },
    "url": "https://gameknot.com/annotation.pl/leningrad-dutch-with-kingside-attack?gm=20233",
    "gameName": "Leningrad Dutch with kingside attack.",
    "players": "aetars (1516) vs. wrimle (1564)",
    "opening": "Dutch defence (A84)"
}