{
    "moves": {
        "1. e4 e5 2. d4": "If 2. ... exd4 then 3. Qxd4 and White has good control of the center with his queen and pawn. Black can play 3. ... Nc6 to attack the queen, but, it can retreat to e3 and the two players can start to develop pieces after that. White's queen will be quite exposed, though, and Black has a development tempo.",
        "2... Nc6": "This move is a transposition into the Nimzowitsch Defence, and serves a dual purpose. Black protects the pawn on e5 while attacking White's pawn on d4. White either has to protect it, take the pawn, or come up with something else.",
        "3. d5": "Note that White also has the calmer possibility 3. dxe5 Nxe5 4. Nf3 which should promise a slight edge after 4 ... Bb4+ 5. c3, or 4 ... Qf6 5. Nc3 or 5. Be2. Usually, in this position, White plays 3. c3, the Danish Gambit.",
        "3... Nb8": "A mistake by Black. He should have played 3. ... Ne7, but, he was afraid of blocking the advance of his queen and dark-squared bishop. White has a good advantage.",
        "4. Qf3 Qf6": "Black is hoping for White to trade off queens. After 5. Qxf6 Nxf6 Black makes up for the loss of development made with the earlier knight move, and also attacks the pawn on e4. However, White is not so keen to do so.",
        "5. Bc4 Bc5": "Note that Black could have captured the queen on f3 but didn't like that idea. After 5. ... Qxf3 6. Nxf3 White has two pieces developed against Black's zero.",
        "6. Be3 Bxe3": "Black is eager to trade off, but after 7. Qxe3 White is leading in development. Note that his bishop is serving a good purpose on c4, helping the pawn on e4 defend the pawn on d5, and can't be attacked very easily. Unfortunately for White, it doesn't threaten much.",
        "7. Qxe3 d6": "An interesting move by Black. White has a relatively good bishop on c4 and can now check Black's king if he so wishes to.",
        "8. f3": "A good move by White. This stops any future attacks by the Black queen, though 8. Nf3 would have been better, as it develops a piece. White needn't worry, though, as Black doesn't have a dark-squared bishop to back up his queen.",
        "8... c6": "Another interesting move by Black. There is no great need for White to capture the pawn, although it would give the bishop good opportunities to attack the Black king later on. Note that, if Black takes the d5 pawn with his own, White can take with the bishop and will gain plenty of room to maneuver.",
        "9. Nc3 b5": "White's lack of action has resulted in an intimidating pawn structure for Black. However, White has a trick up his sleeve.",
        "10. dxc6": "An unexpected move for Black. He can now capture White's bishop on c4 with ease. ",
        "10... bxc4 11. c7": "White's plan is revealed. Although blocked by Black's bishop, he now has a pawn one square away from promotion, and threatens to capture the knight on b8. However, Black can easily defend.",
        "11... Na6 12. Nd5": "Clever. White protects the pawn while simultaneously attacking Black's queen. The knight is protected by the pawn on e4, and none of Black's pawns can attack the knight.",
        "12... Qe6 13. O-O-O Qd7": "Black now encircles the White pawn. White could have built up a defense with his queen, but instead chose to castle.",
        "14. Qg5": "White threatens to capture the pawn on g7 and trap the rook on h8.",
        "14... g6 15. Nf6+": "White forces Black to trade knights, otherwise his queen will be lost. This move breaks all defense on Black's pawn on c7, but White has little else to do.",
        "15... Nxf6 16. Qxf6 O-O": "Black castles. What attack White might have had with the queen is now lost, and his pawn on c7 will be gobbled up by the Black queen. White's bishop sacrifice earlier was in vain. But all is not lost, as White has one very intimidating move possible.",
        "17. Rxd6": "White's rook joins in on the action, taking a pawn in the process. Though this game was played over the internet, it's not hard to imagine Black's face showing fear of a counterattack as the rook rumbles down into his territory.",
        "17... Qxc7": "White now loses his first pawn in the game. Things are looking good for Black, but his extra bishop is useless along the c8-h3 diagonal as White has a strong pawn chain guarding half of it. Black's knight and two rooks are doing little at the moment, whereas White's rook on d6 is menacing Black's neighbourhood. Black's king should be feeling a little stressed what with White's queen so close, even if it threatens nothing at the moment, while the White king is relaxing comfortably on the first rank.",
        "18. Rc6": "White hassles Black's queen. Another move would be to capture Black's knight. After 18. ... Bxa6 White can take with the queen and end up with a queen, knight and rook against a queen and two rooks, but then White's king is in danger from Black's two rooks, and the pair can move more freely now that Black's bishop is out of the way. 18. Rc6 is probably the best option.",
        "18... Qd8 19. Rxa6": "White now makes his move. He has delayed the capture to place Black's queen in a less influential position, and to block movement of the two rooks. Note that Black could have placed his queen on b7 to stop the capture of the knight. After 19. Rxa6 Black can capture with the queen and is winning easily.",
        "19... Bxa6 20. Qxa6 Qd7": "Black sacrifices a pawn to mount an attack on the White king.",
        "21. Qxc4 Rad8 22. Ne2 Qd6 23. Nc3": "Black was preparing to move his two rooks behind his queen and sacrifice the queen on d1. 25. ... Qd1+ 26. Rxd1 Rxd1# is prevented after White moves his knight to c3. ",
        "23... Rd7 24. Rd1 Qe7 25. Nd5": "Black has to be careful not to get forked by the knight moving to f6, winning a rook or perhaps even the queen.",
        "25... Qd6 26. Nf6+": "Amazing! Black has to take the knight with the queen, otherwise the queen can be taken by the rook on d1.",
        "26... Qxf6 27. Rxd7": "The situation is now great for White. After having turned the tables by moving the knight to f6, White has taken Black's rook on d7, and is two pawns up. After having let Black take both a bishop and now a knight, White is winning.",
        "27... Qg5+ 28. Rd2 Rd8 29. Qe2 Rxd2": "Curiously, Black trades off. He is down two pawns, so exchanging might not be the best idea here.",
        "30. Qxd2 Qf6": "Black is smart enough not to trade queens. Otherwise, he would be crushed by White's queenside pawns.",
        "31. Qa5 Qe6": "Black gives up a pawn, perhaps preparing to attack White's structure. Note that after 32. Qxa7 Black has no queenside pawns, and thus no defense against a pawn advance by White.",
        "32. Qxa7 Kg7 33. h3 Qc4": "Black now threatens to invade White's territory.",
        "34. Qa5 Qe2 35. Qxe5+": "White clips the pawn on e5, knowing that Black can't play 35. ... Qe1# since it's check.",
        "35... Kh6 36. b4": "White could also play 36. Qg3 to save the pawn on g2 and defend against checkmate by the Black queen on e1.",
        "36... Qxg2 37. b5 Qxf3 38. b6": "A mistake by White. Black can now win the advancing pawn.",
        "38... Qe3+ 39. Kd1 Qf3+": "Black refuses to take the pawn, hoping that the White king comes further over to the kingside so he can harass it some more. However, White doesn't fall for it.",
        "40. Kc1 Qe3+ 41. Kd1 Qxb6 42. Qe8 Qd4+": "Black's big attack against the White king now begins.",
        "43. Kc1 Qa1+ 44. Kd2 Qxa2 45. Kd3 Qa3+ 46. c3 Qd6+ 47. Kc2 Kg7": "Black doesn't want to give up any of his remaining pawns, as it will then be hard to make any progress in the game. Note that material is now equal.",
        "48. e5 Qd5 49. h4 Qe4+ 50. Kb3 Qxh4": "Things now start to slip back into Black's favor. The problem for White is that his pawns are spread out, whereas Black's pawns are untouchable thanks to his king.",
        "51. c4 Qh3+ 52. Kb4 h5 53. c5 Qg4+ 54. Kb5": "White is slowly making his way to promotion on b8.",
        "54... h4 55. c6 Qe2+ 56. Kb6 Qe3+ 57. Kb7 Qe4": "Black pins the pawn on c6 against the White king. Note that Black's pawn on h4 is near unstoppable.",
        "58. Kb8 Qb4+ 59. Kc8 h3 60. e6": "White now goes on the attack, threatening to take the pawn on f7 with his queen to check Black's king. After that, Black will be in big trouble.",
        "60... fxe6 61. Qxe6 Qh4 62. Qe5+ Kh6 63. c7 h2 64. Qa1 h1=Q": "Promotion spells the end for White. He has no hope for survival here.",
        "65. Qh8+ Kg5 66. Qxh4+ Kxh4 67. Kb8 Qb1+ 68. Kc8 Qc1 69. Kb8 Qxc7+": "Black sacrifices his queen. His last remaining pawn is too far away for White.",
        "70. Kxc7 g5 71. Kd6 g4 72. Ke5 g3 73. Kf4 g2": "At this point, Lepeska resigned. Black will promote the pawn and probably win the game. This was a good display of tactics, with White making plenty of unexpected moves. Coming back from a disadvantage of being down a bishop for a pawn, he was eventually helpless against Black's queen. If you wish to leave me a suggestion for an annotated game, or want to leave me feedback, please drop me a message. Your help is appreciated."
    },
    "url": "https://gameknot.com/annotation.pl/lepeska-anonymous-gameknot-2010?gm=33735",
    "gameName": "Lepeska-Anonymous, GameKnot 2010",
    "players": "Paul Lepeska (1125) vs. Anonymous (1158)",
    "opening": "Centre game (C21)"
}