{
    "moves": {
        "1. e4": "Hi! this game only my recent victory against a tough opponent. He gave me a lot of pressure before I managed to outplayed him. I'm playing black so I'm preparing my fave Sicilian Defense once he opened e4. So let me hear all of your criticisms and suggestion, because my annotation was based on my logical perception and evaluations.\n\nMy opponent played e4..",
        "1... c5": "Most of the time I replied c5, It's very rare I used e5. But e5 is the most logical and solid  reply from black",
        "2. Nf3": "My opponent continued his development according to widely accepted opening theory. Nf6 control the e5 and influenced the d4 square, and as well the normal development of of one of his minor pieces for the purpose of  king castle.",
        "2... d6": "I played my favorite Najdorf variation, the fave of Fischer and Kasparov. This move gives black queen bishop free development and to restrict white pawn advance in e5 square.",
        "3. d4": "d4 the most common reply from white. Danish GM Bent Larsen heavily criticized the exchange of  center pawn with the plank pawns. He developed and popularized one opening,  the Larsen Opening which begin with b3.",
        "3... cxd4": "the normal reply from black",
        "4. Bb5+": "white was too aggressive with this move.",
        "4... Bd7": "I can play Nc6 which is the usual reply from black. But  I want to try other possible variations.",
        "5. Bxd7+": "Maybe his first objective is to remove my queen bishop, since no one will pin his knight in f3 and as well his light square are much more defined and objective than my position.",
        "5... Nxd7": "I think 5..Nc6 are much good than this move, but I want to try other variations and the next couple of moves out of bookline.",
        "6. Qxd4": "centralizing his queen and also restrict the advance of my g pawn, most of the players agree 6. Nxd4 is the logical move",
        "6... Ngf6 7. Nc3": "White other good continuation are: 7. 0-0 e5, 8. Qe3 Be7, 9. Nc3 0-0, 10. h3 Qc7 11. Bd2 Qc6, and white has a small advantage",
        "7... g6": "I'm worry to play 7..e6 here because white is still postponing his castling in kingside. I think he want a long castling, The purpose of this castling, his queen rook supporting his queen attacking my d6 pawn and as well preparing for kingside attack. atleast my pawn at this moment it is supported by e7 pawn, so I decided to fianchetto my bishop and then king castle.",
        "8. Be3": "Just what I feel...",
        "8... Bg7": "I'm looking the safety of my king before white break the center.",
        "9. O-O-O O-O 10. e5": "White start to break the center, which in my opinion was to premature. I think the most accurate plan for white is start to advance his h pawn and preparing to exchange his bishop against my bishop in g7 or vice versa, and then shift his forces in kingside",
        "10... Nh5": "just intended to pin the pawn and the white queen, but with loss of my two minor pieces in exchange of a rook. If 10.. Ne8, white continue 11. Bf4 then 12. Rhe1. Either my move white still has slight edge 10.. Nh5 I admit is too risky to exchange my two minor pieces against rook!!",
        "11. g4": "Before I played 10..Nf5, I already anticipate white will make this committal move.",
        "11... Nxe5 12. Nxe5 Bxe5": "Not 12.. dxe5? resulted to one piece down.",
        "13. Qxe5": "So white decided to simplify and move to endgame, on the other hand this is my favorite part of the game.",
        "13... dxe5 14. Rxd8 Raxd8 15. gxh5": "So now at the first glance its much easy to handle the white position, his first objective is to exchange my other rook and then shift his two minor pieces to harass my two pawns in queenside which give him a two passed pawn. generally two minor pieces has an advantage against a rook.",
        "15... b6": "It restrict bishop's activity. ",
        "16. a4": "Now he starting to advance his pawn. It's a very difficult task for me even to equalize here,  but I have two powerful rook atleast to compensate, he has an advantage his king is much near than my king.",
        "16... Kg7": "I'm starting to move my king to participate in battle, before white overwhelm the queenside.",
        "17. a5": "with the intention to create a pass pawn and threatening my a7 pawn ",
        "17... bxa5": "Its take a time for me before making this move. My plan is to remove all of pawns in queenside leaving only white c pawn and then shift the game in kingside  because I have a couple of pawns. My queen rook watching the queenside and my other rook supporting my plan in kingside  by pushing all of my pawns with the help of my king.",
        "18. Bxa7 Rd7": "I want to stay my rook in d file, I don't want to give his king a chance to move via d2",
        "19. Bb6 Ra8 20. hxg6": "I let white to capture my pawn eversince he capture my knight. I want a connecting pawns rather than two double pawns even I'm pawn up.",
        "20... hxg6": "this is good instead of 20..fxg6 because it will isolated my double pawns in e file which is not good.",
        "21. Rd1": "white he want to remove my rook's command in d file so he like to exchange.",
        "21... Rxd1+": "I accept to exchange the rook",
        "22. Kxd1 f5": "I'm starting to advance my pawn. I have a much solid phalanx of pawns against his two isolated pawns.",
        "23. Kd2 Kf7 24. Kd3": "White should move his king in kingside, he overestimate the position.",
        "24... g5": "My plan. the start of racing of pawns for queening..",
        "25. Kc4": "He totally committed his king to support his two minor piece in queenside but neglecting the kingside. It's not too late,  his move should move 25. Ke3.",
        "25... g4": "Aside from advancing my pawn it restrict the f and h pawn, these two pawns soon will be the target of my rook.",
        "26. Kd5 Kf6 27. Nd1": "Aside for the intention of 28. c4 it support his f2 pawn and move his knight in kingside.",
        "27... e6+ 28. Kc6": "I can play Rh8 but I' still wait his king to advance near my rook and also looking for the advance of my a pawn to exchange atleast with his b pawn.",
        "28... Rc8+": "just only for tempo, to distract his bishop in diagonal g1-a7.",
        "29. Bc7": "the only move..If he move his king I will capture the c pawn.",
        "29... f4": " To create a passed pawn in g file and the harassing his knight to stay away from my g pawn. I let white to capture my pawn in a6",
        "30. c4": "Obviously white don't want behind on the racing of pawns.",
        "30... Rh8 31. Bxa5 Rxh2 32. b4": "White has two connected passed pawn and supported by bishop and king, a very difficult game for me.",
        "32... g3 33. fxg3 fxg3 34. Ne3": "to stop my pawn advance in g2",
        "34... Re2": "my logical reply.",
        "35. Bb6": "white logical reply",
        "35... Kg5": "to help my rook's battle against two minor pieces..",
        "36. Kd7": "White intention is to capture my pawn as well giving way for his pawn advance in c file.",
        "36... Kf4 37. b5 e4": "The best move that I made. If we both promote our pawns to queen,  at least my king has a shield  against the queen's check.",
        "38. Kxe6 Rxe3 39. Bxe3+ Kxe3 40. b6 g2 41. b7 g1=Q 42. b8=Q": "white offered me a draw but I refused, because I have a slight advantage. and as well if I agree for a draw it will reduced my rating. Because I have a much higher rating than him. ",
        "42... Qg6+ 43. Kd5": "White should avoid the e5 and d6 square because it will skewer his queen after I checked his king.",
        "43... Qf5+": "I'm preparing my king move to f3 then push my e pawn, my queen cover the f file for white queen's check. And after f3 I can cover my king by pushing my pawn to e3. My queens check intention is to stay away the white king.",
        "44. Qe5": "White decided to exchange our queens.",
        "44... Qxe5+": "I accept ",
        "45. Kxe5 Kd3": "White think that after my pawn queening his pawn is already in 7th rank and hoping for a draw. But my king was so near. generally rook pawn and bishop pawn is draw.",
        "46. c5 e3 47. c6 e2 48. Kd6 e1=Q 49. Kd7": "giving a chance to advance his pawn in 7th rank",
        "49... Kc4": "My king is ready for king hunting!!",
        "50. c7 Qd1+": "The strategy for the series of these checks, here is to pressure white to put his king in c8 then giving a chance for me to advance my king.",
        "51. Ke8 Qh5+": "White is already lost here. But still hoping for my mistake :-)",
        "52. Kd8 Qd5+ 53. Kc8 Kc5 54. Kb8 Qb3+ 55. Ka8 Kb6 56. Kb8 Kc6+": "White resigns. If 57. Ka8 then 57.. Kb7mate. If 57. Kc8 then 57...Qg8 mate..It's a very big win for me, a very difficult endgame, and I acknowledge white for this game, one of my best."
    },
    "url": "https://gameknot.com/annotation.pl/lesson-in-endgame?gm=46560",
    "gameName": "Lesson in Endgame",
    "players": "hamebr17 (1867) vs. kingshunt (1936)",
    "opening": "Sicilian, Chekhover variation (B53)"
}