{
    "moves": {
        "1. e4 e5 2. d3 Nf6 3. b3": "This is usually followed by a fianchettoed bishop.",
        "3... Bc5 4. Bb2": "This was what I thought he'd do.",
        "4... d6": "I made sure my black squared bishop was past the d-pawn before I advanced it. This is pretty basic, but ti's important nonetheless.",
        "5. h3 O-O": "Castle early and often.",
        "6. a4 b6 7. Nc3 Ba6 8. Qd2 Nc6 9. Nd5 Nd4": "He threatens 2 different checks (both of which could be met) while I \"pin\" the g-pawn or the g-knight because of Nf3.",
        "10. Nxf6+": "Trading a knight for no reason? I don't see any advantage to this. That was before I noticed it exposed my king if i captured it with my pawn. however, that could be easily copensated.",
        "10... gxf6": "I didn't even think about Qxf6. I have a habit of playing too fast.",
        "11. c3 Nxb3": "Captured a pawn while forking the queen and rook. A big error for my opponent",
        "12. Qd1": "This isn't a good move, but it's probably the best he had.",
        "12... Nxa1 13. Bxa1": "I now no longer have my most mobile piece (which could be bad in the opening), but he lost one of his most powerful pieces in the process, so I'm a little less than 2 pawns ahead.",
        "13... Kh8": "Protecting my king from Qg4+ which makes him develope his queen with tempo.",
        "14. h4": "Not what I expected, and this move might deserve a question mark.",
        "14... b5 15. axb5 Bxb5": "Trading equal material is a good stradegy when ahead.",
        "16. h5": "The treat of the pawn is hidden if it even exists. I don't understand why he's weakening his g-file.",
        "16... c6 17. h6 Qa5 18. Qg4": "!? The threat is clear now, but the checkmate threat is a little too late.",
        "18... Qxa1+ 19. Qd1 Qxc3+": "Before I made this move, I thought of whether I should do this, or Qxd1+. I soon realized that if he makes his king safe, and plays Qg4 again, then Rg8 saves the threat and (if White's not careful) could win the queen.",
        "20. Ke2": "This is the stronger of the 2 possible moves, but (like 20.Qd2 Qxd2+ 21.Kxd2) now he can't move his queen to g4 with tempo until his king moves again.",
        "20... Ba6": "This was done because it allows both of my rooks to move to the b-file with tempo, and it pins the d pawn. He doesn't have a safe way to stop this, so I'm probably going to win unless he surprises me.",
        "21. Kf3": "He wastes a move and fails to remove the pin on the d3 pawn.",
        "21... d5": "Taking advantage of the pinned pawn.",
        "22. Rh5": "He fails to realize that dxe4 is safe since the d pawn is pinned. A potentially fatal mistake.",
        "22... dxe4+ 23. Ke2": "?? terrible move since exd3 now delivers check.",
        "23... exd3+ 24. Kf3": "I am now able to deliver checkmate in a few moves.",
        "24... d2+": "discovered check",
        "25. Kg4": "This is no better than the alternatives which also checkmate easily.",
        "25... Bc8+": "Needed to cover the f5 square and the h3 square.",
        "26. Kh4 Qd4+": "After this, 27.Kg3 Qf4# or Qg4 Qxg4 or 27.g4 Rg8 28.Be2 f5 29.f3 and white's only pieces are tied to protecting that one pawn.",
        "27. Kg3": "better is g4",
        "27... Qf4#": "checkmate"
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=35544",
    "gameName": "Let's play chess",
    "players": "bejjy (958) vs. dwillv (992)",
    "opening": "KP (C20), Indian opening"
}