{
    "moves": {
        "1. c4": "Esperaba defensa siciliana por la salida del peon debil, y seguramente luego el caballo.",
        "1... Nc6": "decidí desarrollarme por ese lado con el caballo",
        "2. Nc3": "efectivamente sacó el caballo",
        "2... e5": "saco el peón del rey que ya está defendido por el caballo y preparo la liberación de mis piezas mayores",
        "3. e4": "parece repetir mis movimientos",
        "3... Nf6": "Yo continúo desarrollando mis piezas",
        "4. d3": "apoya sus peones pero sigue sin desarrollar sus piezas. Al parecer le gusta jugar más con los peones agrandando su \"cancha\", como en un campo de fútbol",
        "4... a6": "aseguro que no entre el caballo en b5 y preparo mi enroque del lado del rey",
        "5. Bg5": "jugada bastante ofensiva, a parte prepara al parecer el enroque de rey",
        "5... d6": "sigo liberando mis piezas, en este caso el alfil de rey para poder realizar el enroque",
        "6. Nd5": "Penetra en mi zona del tablero con el caballo, teniendo mi caballo de reina clavado por el alfil",
        "6... h6": "largo",
        "7. Bxf6": "decide comer en lugar de irse, con lo cual pierde el alfil que es la defensa del enroque de rey",
        "7... gxf6 8. Qf3": "desarrolla su reina",
        "8... Nd4": "ataco su reina y preparo un ataque \"tenedor\" entre el rey y la torre, supuse que él retrocedería su reina para salvar su torre pero no se dio cuenta del tenedor.",
        "9. Qh5": "quiso ser ofensivo pero se equivocó",
        "9... Nc2+": "Jaque al rey y a la torre del rey",
        "10. Kd2": "el rey se acerca a \"atacarme\", ",
        "10... Nxa1": "tomo la torre",
        "11. Be2": "Empieza a sacar sus piezas para capturar el caballo con la torre de reina, yo tenía como prioridad preparar mi enroque.",
        "11... Be6": "libero la zona para poder enrocar",
        "12. Nf3": "Sigue sacando sus piezas para comerse a mi caballo. ",
        "12... Bxd5": "aprovecho para eliminar la amenaza del caballo suyo antes de enrocar",
        "13. cxd5 Qd7": "protejo al peón solitario y dejo a la reina libre para salir por los dos lados",
        "14. Rxa1 O-O-O": "000",
        "15. Ke1": "protege su rey",
        "15... Bg7": "preparo salida de la torre de rey por g",
        "16. Qg6": "Ese error no lo vi, lo confieso. NO me di cuenta de que ponía su reina al lado de mi peón prácticamente sacrificándola. Sölo me preocupé por mi peón sin darme cuenta de que su reina estaba a mi merced. ",
        "16... Rdg8": "????, tenía que haber capturado la reina",
        "17. Nh4": "??? tenia que haber movido su reina",
        "17... fxg6": "La capturé. su error fue grosero",
        "18. Nxg6": "ya la partida estaba perdida",
        "18... Rh7": "salvar mi torre",
        "19. h4 Bf8 20. Nxf8 Rxf8 21. Bg4": "el último error, atacó a mi reina, que estaba el linea con el rey, pero no se dio cuenta de que su alfil no tenía ninguna protección. Perdió la partida.",
        "21... Qxg4": ""
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=64874",
    "gameName": "Let's play chess",
    "players": "bigfoot57 (1180) vs. alexcajan (1224)",
    "opening": "English opening (A10)"
}