{
    "moves": {
        "1. e4 d5 2. e5 c5": "Logical. Black intends queenside activity.",
        "3. Bb5+": "Offering a clean bishop exchange in preparation for 0-0.",
        "3... Bd7": "Black accepts the idea.",
        "4. Bd3": "? Having already offered to trade light squared bishops, white renegs on the deal and chooses to move the bishop for a second time in a game only four moves old. Notice that addition to breaking that \"rule\", he has chosen the worst possible square to move it to. Bad idea.  Black wants to take advantage of white's backward d pawn.",
        "4... c4": "Black sees the tempo gaining expansion move.",
        "5. Bf1": "White is now WAY behind in development.",
        "5... Bf5": "This bishop is now safe to move outside the pawn chain, where it can exert more influence.",
        "6. d3": "White now tries to deal with his backward pawn.",
        "6... cxd3 7. Bxd3": "?! Not too sure about this one. Perhaps cxd was better.",
        "7... Bxd3 8. cxd3 e6 9. d4": "Unbelievable. After such suspect opening play, white has established a very solid position.",
        "9... Bb4+": "At this point, black realizes that he probably just screwed up that opening advantage. He intends to position himself for the most advantageous endgame position as quickly as possible. He shoots for a fast few skirmishes that hopefully will result in a R & P endgame.",
        "10. Nd2": "? Again, I question that move. It further restricts the dark squared bishop. Perhaps Bd2 was better.",
        "10... Ne7": "Given the time to develop, black prepares for 0-0.",
        "11. f4": "?! Dubious. White weakens the real estate around his leader, but is threatening overwhelming force on the kingside.",
        "11... Nbc6": "Developing, and threatening the pawn on d4.",
        "12. a3": "White attempts to kick out the bishop that is causing him so much grief.",
        "12... Qa5": "! Black loads up on the pin of the Nd2. White cannot retake because 13. axB QxR!.",
        "13. Kf2": "? 13. Nb6 was the play, as it would develop, protect the d pawn, and hasten 0-0.",
        "13... Nxd4": "Black launches the attack.",
        "14. Nb3": "! Great move on many levels. Black MUST take the knight, as it threatens his queen and his knight. White's plan is for even more rapid exchanges to recover the integrity of his kingside. ",
        "14... Nxb3 15. Qxb3 Bc5+": "Black of course saw this position in analysis, and was willing to play along. 16. Be3 is next, right?",
        "16. Kf1": "? White had such a strong possibility of recovering his kingside. I don't where that move came from.",
        "16... Qa6+": "Trying to punish the enemy king for his premature activity.",
        "17. Ne2": "White voluntarily walks into yet another pin.",
        "17... O-O": "Given the free tempo, black castles and prepares for the endgame.",
        "18. Be3": "!White once again finds the best move. He can STILL pull off his previous idea.",
        "18... Bxe3": "Pretty much forced, as black couldn't allow white to gain tempo.",
        "19. Qxe3 Nf5": "f5 is a natural post for the knight, and the white queen is compelled to move.",
        "20. Qf2": "Not much else available.",
        "20... Rac8": "Black claims the c file, and prepares for another volley.",
        "21. g4": "! Strong. Black must vacate f5.",
        "21... Ne7": "21...Na6 causes WAY too many complications.",
        "22. h4": "And the battle lines are drawn. White is surging straight forward on the kingside. Black is threatening to flood force on the queenside and come around from behind.",
        "22... Rc2": "! Strong. This move absolutely hammers the knight on e2. It is now doubly pinned. Black can now try to pick off b4.",
        "23. Re1": "? While this appears to alleviate a portion of the tension on the Ne2, it really does little else. The knight on e2 is extremely weak, yes - but it is also adequately protected.",
        "23... Rfc8": "Given yet another free tempo, black loads the c file and prepares to start shooting.",
        "24. h5": "While there is nothing inherently bad about this move, I don't question it. I just consider 24. Rh3 much more flexible.",
        "24... Rxb2": "Black picks up the freebie and prepares to load the 2nd rank with more more artillery.",
        "25. h6": "! As white is already committed, he launches his offensive first. Take a good look at this position. This game is all about who is gonna flinch first. White has the initiative, the space, and his queen and Rh1 to work with. Black has more firepower, but must defend first. White has a chance to end it right here and now. If he fails he's dead. Black has to defend for his life right now, but if he can survive then he's got the goods.",
        "25... Rcc2": "As planned.",
        "26. Rh2": "! Very strong. White further protects the critically weak Ne2 while maintaining all other threats.",
        "26... Nc6": "?! This move feels right, and black was wary of playing Ng6. Perhaps it was better to just let him stay right where he was however.",
        "27. hxg7": "White presses forward, and looks to get his queen to the h file.",
        "27... Nd4": "?? Incredibly bad. Black didn't see the white queen retaking.",
        "28. Qxd4": "White nabs the free piece.",
        "28... Rcd2": "Black attempts to keep white distracted.",
        "29. Qe3": "Looking for Qh3.",
        "29... Rd3": "! Nice tactic.",
        "30. Qf2 Qxa3 31. Qh4": "! White threatens mate in 1.",
        "31... Rf3+": "Black clings to the cliff.",
        "32. Kg1 Qe3+": "! Black can now defend h7 and give a brutal pin after 33. Kh1 Qe4.",
        "33. Kh1 Qe4 34. Qd8+": "White's only real attacking option is with his queen, so........",
        "34... Kxg7 35. Qg5+ Kf8": "If white plays ANY move that doesn't deliver a check he is lost.",
        "36. Qd8+ Kg7 37. Qf6+ Kf8 38. Qd8+ Kg7": "And draw agreed upon. A very interesting game I thought. - Thomas"
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=4781",
    "gameName": "Let's play chess",
    "players": "sadguy (1258) vs. tag1153 (1390)",
    "opening": "Scandinavian (centre counter) defence (B01)"
}