{
    "moves": {
        "1. e4 b6 2. b3 Bb7 3. d3 g6 4. Bb2 Nf6 5. Bxf6 exf6": "This somewhat compromised my pawn structure but I did get a Bishop for my Knight which may or may not be an even exhange.",
        "6. g3 Bb4+ 7. c3 Be7 8. Qc1 O-O 9. Bg2 d6 10. Nf3 Nd7": "My pieces are now where I like to place them in the opening.",
        "11. Nbd2 Ne5 12. Qc2 c5 13. O-O d5": "To open the position up somewhat.",
        "14. Rae1 Ba6": "Threatening the d3 square (if the pawn is still there then so much the better.)",
        "15. c4": "Blocking the Queen's Bishop's line to d3.",
        "15... dxc4 16. bxc4 Qxd3": "This is not how I intended to win the pawn at d3 but White kept putting an obstruction on c4.",
        "17. Rec1": "Giving the c4 pawn enough protection that I turned my attention elsewhere,",
        "17... Nxf3+ 18. Nxf3 Rad8": "Let him spend a tempo initiating a Queen exchange.",
        "19. Qa4": "He opts not to exchange Queens.",
        "19... Bb7 20. Qxa7": "He regained his pawn and is threatening my poor Bishop.",
        "20... Rdb8 21. Qxb6 Bxe4": "Keeping the material balance for the moment.",
        "22. Qc7 Rfe8 23. Qf4": "I am now thinking about his King's Rook coming to d1.",
        "23... f5 24. Rcd1 Qxc4": "I really thought he would proceed with the King's Rook keeping c4 under surveillance.",
        "25. Ne5 Qxa2": "Picking up another pawn.",
        "26. Rd2 Qe6 27. Re1": "Now his shots at the e4 Bishop are too much and I decide the best course of action is a Bishop exchange.",
        "27... Bxg2 28. Kxg2 Bd6": "Played to pin the Knight while attacking it three times.",
        "29. Rde2 f6": "This puts the question to White.",
        "30. Nc6": "He forcefully breaks the pin.  Quite honestly, I had expected Nc4.  The way the board sits now, I think I might be able to gain some material but only if I proceed aggressively.",
        "30... Qxe2 31. Qxd6 Qxe1 32. Nxb8": "This recapture gave me pause, as I had planned to picked up the Knight with ---, Qe4+ ; K moves, Qxf6 and the White Queen needs to run.  Now winning the Knight will require some luck and effort.",
        "32... Qe4+ 33. Kg1": "This the luck I wanted -- I really thought he would go to h3.  (Kf1 allows Qh1#.)",
        "33... Qb1+": "Forking King and Knight, thus winning the Knight.",
        "34. Kg2 Rxb8": "I wanted to maintain the Queen's ability to return to e4 with check.",
        "35. Qxc5": "There was nothing to done for that pawn.",
        "35... Qe4+ 36. Kh3": "The first rank would have been death after Rb1+.",
        "36... g5": "Tightening the Kingside noose.",
        "37. Qd6 g4+": "This forces the King to surrender the g2 square.",
        "38. Kh4": "At this point I really considered sacrificing the b8 Rook and going to g2, but upon further examination I decided that White would probably take the f6 pawn rather than the Rook so......",
        "38... Rf8 39. Kh5 Qg2": "And now there is a bona fide mating net in play  --  although White can break it up by giving up his Queen.",
        "40. h4": "Instead, White tries another approach that is consistent with Kh5",
        "40... gxh3 e.p.": "and probably did not count on this.",
        "41. Qd7 h2": "At this point I considered the game most definitely won although White can drag it out somewhat.",
        "42. Qe6+ Kg7 43. Qe7+ Rf7 44. Qe3 h1=Q#": "And the passed pawn wins!!"
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=19033",
    "gameName": "Let's play chess",
    "players": "dklopp (1337) vs. throneseeker (1463)",
    "opening": "Owen defence (B00)"
}