{
    "moves": {
        "1. e4 e6 2. d4 d5 3. Nd2 c5 4. Ngf3 Nc6 5. exd5": "Trying to leave Black with isolated pawn.",
        "5... Nxd4": "Speculative move that does not turn out well for Black",
        "6. Nxd4 cxd4 7. dxe6 Bxe6": "Black has a weak d pawn but seems to be ahead in development. However...",
        "8. Bb5+": "The start of a sequence of developing moves that undermine Black's position.",
        "8... Bd7 9. Qe2+": "Brings the queen out and protects the bishop while preparing for castling and undermining Black's d-pawn.",
        "9... Be7 10. O-O Kf8": "Seems like a good move, as Black actually won a game in the GK database from this point. However, White considers Nb3 stronger than the Nf3 played in that game.",
        "11. Nb3 Bxb5 12. Qxb5": "White still retains the advantage here, since Black must avoid going into an ending a pawn down.",
        "12... b6 13. Rd1": "Now piling up on the d pawn.",
        "13... Bf6 14. c3": "Exploiting the pin.",
        "14... a6": "Trying to drive the queen away, but neglecting development.",
        "15. Qf1": "Deciding to retain the queen for a future attack.",
        "15... Ne7 16. Nxd4": "Now up a pawn with a strong central knight.",
        "16... Qc8": "Takes the queen off of the rank, with possible future threats on c6 after a queen side pawn advance.",
        "17. Be3 b5 18. Qe2": "Brings the queen back out to exploit the holes in Black's position.",
        "18... g6": "Does not work out the way Black intended, since the strong black bishop will need to be exchanged later and the king is defending the knight.",
        "19. Bh6+": "Of course, since black must retreat the king or lose the knight.",
        "19... Kg8 20. Qe4": "Centralizes the queen and restricts the black knight.",
        "20... Ra7": "Defends the knight, but weakens the back rank, a factor later.",
        "21. Rd2": "Prepares to make threats on the back rank.",
        "21... Bg7": "Tries to exhanges the bishop to try and free the king from back rank threats. ",
        "22. Bxg7 Kxg7 23. Qe5+": "This check leaves Black with bad options. If 23 ...f6, white weaken's black's kingside and gains control of e6 for his knight. If, as in the game, black retreates the king, back rank threats persist.",
        "23... Kg8 24. Rad1": "Now the back rank threats are serious. ",
        "24... Qc7": "24... Qc7? Black was counting on this move, figuring they could gain some relief by exchanging queens into an ending only a pawn down. However, 24 ...h3 would have been more prudent, trying to get the king to h7. Unfortunately for Black, White has a surprise in store...",
        "25. Ne6": "25 Ne6!! is a surprising killer. If now  QxQ, Rd8 is #, and otherwise if the Knight is not taken, Qg7 is #. Black has no good options, but decides to play on a few moves.",
        "25... fxe6 26. Rd2d8+ Kf7": "Loses quickly. QxR would have prolonged the agony for a few moves.",
        "27. Qxh8 Nf5 28. Qf8#": "A quick end, but the game was totally lost after 25 Ne6!!."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=17094",
    "gameName": "Let's play chess",
    "players": "dmaestro (1551) vs. gbluesboy (1547)",
    "opening": "French (C07), Tarrasch, open variation"
}