{
    "moves": {
        "1. e4 c5 2. f4": "Grand Prix attack.",
        "2... g6": "\"textbook\" response to the GPA appears to be d5 instead. As is evidenced by subsequent moves, my line caused me many many problems.",
        "3. Bc4 Bg7 4. Nf3 Nc6 5. O-O d6 6. d3 e6 7. Nc3 Nge7 8. Ng5 O-O": "I sleepwalked right into this. A seemingly safe position but I believe the GPA actually wants black to castle right into the attack. A better move might have been d5.",
        "9. f5 exf5": "again, what seemed safe simply isn't so. gxf5 does not seem any better either. He has pieces gunned on my f7 pawn.",
        "10. Nxf7 Rxf7 11. Bxf7+ Kxf7 12. exf5": "one big ouch.",
        "12... Bxf5": "Again, I believed it was safe, not realizing the rook pin. 12. ...,gxf5 13. Qh5 , Kg8 leads to a rather complicated position (on hindsight) that is pretty ugly for black, but probably no more so than what was to follow.",
        "13. g4 Bd4+": "Desperation move. The white bishop was lost, I'd rather spend time moving pieces into an attacking position against a semi-exposed king while trying to move my own king into the safety of the queen-side. In all probability, I've lost this game unless my opponent blunders. Time to gun for a draw if possible.",
        "14. Kh1 Ke8 15. gxf5 Nxf5 16. Re1+ Ne5": "I chose to block and possibly move the knight into a position for attack rather than merely running away with 16. ...,Kd2. Moving the king also has the disadvantage of exposing the e-file to his rook's domination.",
        "17. Nd5": "A worrying development. My queen covers most of the knight's subsequent attacking positions, but it is a horrible way to use a queen and it certainly will not last long if he starts putting pieces into play.\n\nA hypothesis into his intentions: perhaps he thinks I might play Bxc3 at some point, but that only plays into his advantage. Personally, I would have played 17. Bf4, ... and then maybe 18. Qe2 (speculative because of a possible fork from g3) to put additional pressure on that knight while the king is still being pinned.",
        "17... Kd7": "My priority was king safety, so I had to get the king away from that pin. A constant worry is the fact that the opponent's knight has two positions from which to check the king on the next move.",
        "18. c3 Bf2": "I had planned to move the bishop eventually, so I'm forced to do so somewhat prematurely.",
        "19. Rf1 Qh4": "The start of a rather desperate attack on his semi-exposed king. This is a highly complex position ... at this point, there seems to be so many options, whether to try winning a rook or to find a possibility of a mate.",
        "20. Bf4": "Deters Ng3  and the fork. Still seemed hopeful, but I think I looked 4-5 moves deep and things became a whole lot less promising with lots of my pieces under attack at the same time.",
        "20... Ng4": "I felt this was my best move. Secures the bishop at f2, threatens the pawn at h2 and prepares for Ng3  which also happens to block his bishop from guarding his pawn while securing h2 for the queen's attack should the king runs (which was not possible in the earlier scenario).",
        "21. Qf3 Rf8": "My opponent's previous move puts even more pressure against Ng3  while threatening a very bad exchange of bishop knight for a rook (which for him is easy to replace since his a-rook is simply standing by). Also threatens a very deadly attack on my king via Qxb7  were his knight to simply move away (either for a check or to threaten some other piece).\n\nRf8 was meant to allow me to play Nfe3. I can't quite remember exactly what my main threats at that point was, but many of the lines results in mate.",
        "22. Kg2": "The refutation. Now I am in a bind because I am committed to the attack (no way to extract myself even if I wanted to). My job now was to find a way to gain the best exchange possible from this scenario. Many of the lines lead to a very clear loss in material for me.",
        "22... Nfe3+ 23. Nxe3 Nxe3+ 24. Bxe3 Rxf3 25. Kxf3 Bxe3 26. Kxe3": "A queen vs 2 rooks. My main advantage is the exposed king, a single pass pawn (actually 2, since I planned on taking away his h-pawn) and remnants of a pawn structure to hide my king from rook attacks (once he doubles his rooks, I cannot hope to do anything to him with my queen).\n\nThere's a tiny chance I could force a draw through perpetual check but it is clear his king has an escape path to the queen-side. Another possibility was to tear his pawn formation on the queen side but that is pretty dangerous because it generates open fields which enables his rooks to become more powerful and also leaves my 2 pass pawns (my only remaining hope for a win) exposed to attack.",
        "26... Qxh2 27. Rf2 Qg3+": "The dance begins. The nice thing about close-contact checking against a rook king is the acquisition of tempo to move my pass-pawns through every other check should he choose to block or run. ",
        "28. Ke2 h5 29. Rf7+ Kc6 30. Raf1": "An uh-oh situation. Both him and myself have to be very careful now ... I will attempt to catch his rooks when they separate and he will attempt to move his doubled-rooks in a fashion that will catch my pawns, queen or king off-guard.\n\nI recognize early on that the two pass pawns have to remain in close support of one another because the queen alone cannot support a lone pawn against 2 rooks. Fortunately, 2 rooks can only direct an effective attack on a single pawn with queen support which takes 2 moves, so I can read in advance a possible attack on a specific pawn and then move the targeted pawn into safety or the other pawn into a support position while making sure the queen is also in position to protect the targeted pawn.",
        "30... h4": "A safe move for now. One worry is Rh7 followed by Rh1 which is countered by g5. The other scenario I am trying to prevent is my opponent moving both rooks behind my pawns. The current scenario with the split rooks allows my queen to attempt to threaten one in isolation of the other. The nightmare scenario is if I lose this \"tool\" (so he never has to worry and hence lose tempo).",
        "31. Rf1f3 Qg2+ 32. Rf3f2 Qg4+ 33. Kd2": "Rf3 would have tied one rook up due to a pin.",
        "33... g5 34. Rh7 Qg3 35. Rff7": "Was my second uh-oh moment. Rc7  or Rxb7 are obvious follow-up moves. They are inevitable (I cannot prevent them) so I use this as an additional opportunity to move my pawns. Subsequent actions that involve my king running grants me safety for 1 turn anyways.",
        "35... h3 36. Rfc7+ Kd5 37. Rhe7": "A mate trap I had not expected. I am very glad he did not choose to take the b pawn first, although that might have bought me enough time to queen the pawn (which may or may not be useful depending on how serious the mate trap is).",
        "37... b5": "The only reasonable response I can make I believe. To continue with the mate trap, he would need to push his b-pawn forward afterwhich Qf2  could potentially drive his king back to the 1st rank and deprive him the defense of his pawn at d3 which is essential for the completion of the trap.",
        "38. b3 Qf2+ 39. Re2 Qf4+ 40. Kc2": "not quite what I had expected but now my queen has gotten to a position where I could potentially promote my h pawn after a sacrifice of the queen were he to pursue the mate trap. I am just amazed at how complex this position is still ...",
        "40... g4": "I think I had to ... to allow the h pawn a chance to promote. I cannot remember the line where his rooks could combine to maul that pawn ... unless I was sadly mistaken in my analysis.",
        "41. Re4": "Back into the mate trap position.",
        "41... Qf2+": "Now, I drive his king back to the 1st rank with an option to take the a pawn for a draw position or to keep him there for a potential mate if my h pawn promotes. From what I could see, he had an option of forcing a queen-for-rook exchange which would normally be devastating for me if not for the fact that my two pass pawns are now at the \"event horizon\". Against a single rook, one of those 2 pawns *will* promote.",
        "42. Kc1": "A draw was offered at this point. I was tempted to take it but I could not in good conscience do so because I felt (but not 100% sure) I had a decent winning chance. I decided to decline and push on and would have been perfectly happy to be proven wrong and lose instead.",
        "42... c4": "The idea was to force the exchange to happen to buy time for the h-pawn's promotion. Notice his d-pawn is now prevented from participating in the exchange or he'd lose his rook:\n43. bxc4, bxc4 44. Rcxc4,h2 or 44. Rexc4,h2 45. Rh7,g3.",
        "43. Rxg4": "This was unexpected and caused me to panic (see next comment).",
        "43... cxd3": "Terrible terrible move for 2 reasons ... one, I had not realized the refutation 44. Rd4 . Second, 43. Rxg4, Qe1  44. ..., Qe2  wins the rook. I even thought I had studied this position well and did not realize Rxg4 was a bad move on his part.\n\nThe motivations for this move of mine was to threaten Qc2#. I considered his options like c4  etc ...",
        "44. Rd4+": "At this point, I thought I had lost, having made that terrible blunder. I stayed calm though and thought about my remaining options.",
        "44... Ke6": "I had initially considered Ke5 but it potentially allowed my king to be chased by his c-rook to a point where my queen would have to be given away and hence a loss.\n\nThis scenario forced me to evaluate King-Queen combos that had advantages against 2 rooks, even if they are doubled. Close-contact appeared to be key (I believe rooks fare poorly in close-contact scenarios against King-Queen because they have to split-up in order to mount an effective attack) as well as diagonal domination of key rook-attack squares. Of course, I would prefer scenarios where his rooks were not doubled ... but that's not my call.\n\nAt the same time, I considered how I was going to promote the h-pawn for the win ...",
        "45. Rxd3": "Inevitable and his best move, actually.",
        "45... Qf5": "I believe this is my best reply. Attacks his rook, prevents Rh7 and keeps my pawn temporarily safe. He now has to move his rook away or 46. Kc2 to protect it (but gets into a pinned-rook scenario).",
        "46. Re3+ Kf6": "The fact that I can do this now is because I chose 44. ...,Ke6 instead of 44. ...,Ke5.",
        "47. Rxa7": "Again, an unexpected move. My original plan was to push the h-pawn, but now thanks to my earlier blunder, I recognized another opportunity ... Qg5 pins the rook *and* threatens it, forcing his king to move up to protect it (and beautifully, still forced to endure the pin) or forcing his rook to double up along the e-file.\n\nNormally, the doubled rooks would mean a draw at least (for him) due to perpetual check. However, my trusty d pawn (which has incidentally served as my king's bodyguard over the last 20 moves) prevents that! This means, after a certain point, he loses steam in the attack and allows me to (finally) promote my h-pawn.\n\nSo, he needs 2 moves ... Kd2 and Re7 (in any order, I think) to secure his weak rook. This allows me, regardless of his options, to make the h2 move.",
        "47... Qg5 48. Rae7 h2": "I thought he still had a possible game at this point ... one of the lines I thought about reduced this to a Rook-vs-Queen game but with a massive pawn advantage (*and* King support) on the queen side. I was not 100% sure at this point if my lone queen and my remaining pawns could stop it (I should be, but was not sure).\n\nThis is definitely the best chess game I've played so far, even if I had lost. See-saw scenarios with nail-biting moves that were reduced to single-tempo advantages."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=20579",
    "gameName": "Let's play chess",
    "players": "suvigenije (1729) vs. cheewai (1659)",
    "opening": "Sicilian (B21), Grand Prix attack"
}