{
    "moves": {
        "1. e4": "Queen sacrifice- my first I think. Cracking game where we both castled on opposite sides and tried to attack the other's king. Can you spot his brilliant trap on move 25 and if I say so myself, my nice move on #36 which allowed me to wrap it up. Pl comment freely, I am sure you will enjoy this high octane ride. Thanks also to tomoa who sent a nice message on defeat. PLEASE RATE",
        "1... c5 2. f4": "expand kingside",
        "2... Nc6 3. Nf3 Nf6 4. e5": "harass his knight, although it leaves this e pawn too much in front with no development of pieces. what do you think?",
        "4... Nd5 5. d3": "protect f4",
        "5... d6 6. c4": "continue pushing his knight about",
        "6... Nc7 7. Nc3": "want to develop my pieces",
        "7... Bg4 8. h3": "dont like pins on my q",
        "8... Bxf3 9. Qxf3": "now I think that exchange of an active bishop for a Knight is meaningless?!",
        "9... Nd4 10. Qd1": "rush back- prevent Nc2",
        "10... dxe5": "there goes my presence in the center",
        "11. fxe5 g6 12. Bf4": "need to protect e5",
        "12... a6 13. Qd2": "plan 0-0-0 quickly as my kingside is looking exposed",
        "13... Bg7 14. O-O-O": "phew",
        "14... Nde6 15. Be2": "ignore exchange of b/knight as I want to develop and take my lsb to f3",
        "15... Qd4": "well e5 pawn is lost, could I have done better?",
        "16. g3 Bxe5 17. Bxe5 Qxe5 18. g4 Rd8 19. Bf3 O-O 20. Bxb7": "now why did he let me take this b7 pawn, was it to open up the b file for an attack on my king?",
        "20... Nf4 21. Be4 Nce6 22. Nd5": "love my knight sitting on this forward perch",
        "22... Rd7 23. h4": "pawn storm",
        "23... f5": "now this was his biggest mistake for in the ensuing exchange he opens up the g file. watch",
        "24. gxf5 gxf5 25. Bf3": "see",
        "25... Rb8": "suddenly he attacks and sets up a brilliant trap. CAN YOU SPOT MY NEXT MOVE",
        "26. Kb1": "yes, if my king was still sitting on c1, then 26...Nxd3 would have been curtains for me. normally I do not spot such traps for I am the king of doziness often playing chess in one window and watching you tube on another",
        "26... Kh8": "now he gets his K off the open g file",
        "27. Rhe1": "no plan right now, just harass his Q",
        "27... Qd6 28. Ref1": "eye his f5 pawn in the future",
        "28... Nxd5 29. Bxd5 Nd4": "so much so for eyeing his f5 pawn",
        "30. Rfg1": "control open file, game has stalled somewhat",
        "30... e6 31. Bh1": "need to make sure he does not put rook or q on b7. but my q is quite passive here",
        "31... Qc7 32. Qg5": "now I attack, f6 would be a good square for my q",
        "32... Rf7": "he defends f6",
        "33. Rde1 f4": "he counterattacks, surprises me",
        "34. Be4": "never mind, I can now attack h7",
        "34... f3": "do not like this at all, not going according to my script",
        "35. Ref1 Qh2": "what the bloody hell!! should I bring my q back to c1, but then his knight will go e2- disaster. should I go b3 but then Nxb3, ax N, Rx b3  and I may as well go minesweeping in Bosnia. Spend 15 mins analysing. Can you spot a BRILLIANT move that I can play??",
        "36. Rf2": "he takes f2 and my q checks him at e5",
        "36... Qc7": "luck",
        "37. Rgf1": "hate this f pawn",
        "37... Rbf8 38. Qh5 Qd6": "should he have brought his q to g3?",
        "39. a3": "escape hatch for my k",
        "39... a5 40. Bxf3 Rf7f5": "CAN YOU SPOT WHAT I PLAY NEXT?? learnt in the 'Idiot's guide to chess' - a real book actually- that one should always defend by attacking",
        "41. Be4": "queen sacrifice, my first, I think",
        "41... Rxh5 42. Rf2xf8+": "wham ",
        "42... Kg7": "he should have retaken with his q for I go--",
        "43. Rf1f7+": "he resigns. pl comment freely. hope you enjoyed. game swung perilously at times, we started and finished on same day. thanks to tomoa, he sent a gracious message in defeat. PLEASE RATE"
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=19557",
    "gameName": "Let's play chess",
    "players": "dmisra (1616) vs. tomoa (1686)",
    "opening": "Sicilian (B21), Grand Prix attack"
}