{
    "moves": {
        "1. f4": "I began this game with Bird's Opening, for psychological effect. If I can get my opponent into an opening variation they're not comfortable with, maybe I can force a mistake.",
        "1... e6 2. Nf3 d5 3. d4": "I aim to control the black squares. It's a mirror image of the English Opening, where White tries to control the white central squares.",
        "3... Nd7 4. e3 Bb4+ 5. Bd2 Bxd2+ 6. Nbxd2 Ngf6 7. h3 O-O 8. Bd3": "Now that my opponent has castled King-side, I try to focus my attack on that wing.",
        "8... c6 9. Ng5": "This brings a second piece to bear on h7 and opens the diagonal for the Queen to move to h5.",
        "9... a6 10. O-O c5 11. Ndf3": "Now if the Knight on g5 moves, the Knight on f3 can take its place. The attack is forming up.",
        "11... c4 12. Bxh7+": "This was a pure gamble. After this, I have to force my attack through and either win back the sacrificed material or checkmate.",
        "12... Nxh7 13. Nxh7 Kxh7 14. Ng5+ Kg8 15. Qh5 Nf6": "The only defense against Qh7 mate. But the black King needs some flight squares.",
        "16. Qh4 b5": "A tactical mistake. Black should focus on getting the King out of danger, not on advancing the Queen-side Pawns.",
        "17. Rae1 Re8": "A good move, clearing space for the King -- provided the e-file remains closed.",
        "18. e4 Kf8 19. exd5": "The only chance. If Black doesn't take the bait, I'll probably have to resign in a few moves. I need an open file to get my Rooks active and to cut off Black's flight squares for his King. If Black doesn't capture the pawn on d5, I intend dxe6 fxe6 Nxe6+, which would at least keep the attack going and keep me afloat for the moment.",
        "19... exd5": "A huge error. Now the King is deprived of a chance to get away from the attack zone.",
        "20. Qh8+": "The logical follow-up, and Black can no longer fight off the attack. A short but very exciting game. I usually play a defensive style, and it was interesting to try something different."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=26351",
    "gameName": "Let's play chess",
    "players": "thehellion (1305) vs. goemon (1397)",
    "opening": "Bird's opening (A02)"
}