{
    "moves": {
        "1. e4": "The e4 opening by white is both popular and efficient because it opens the diagonals for white's queen and bishop, can lead to an early castle to the king side, and immediatly contests for the center squares.",
        "1... c6": "The Caro-Kann defense is becoming a favorite of mine. I rarely see it used by my opponents, and most people do not know any book moves for the opening, which often works to my advantage. This defense centers around a strong point at d5, and is just as an effective counter to white's e4 opening as the Sicilian Defense or e5.",
        "2. Bc4": "This is an awful move by white, which is known as the Hillbilly Attack. It winds up wasting white's time while black gains the center with 2. d5 3. exd5 cxd5.",
        "2... d5": "Logical.",
        "3. exd5 cxd5 4. Bb3": "I am not sure if this was better than Bb5 or not, but with white's blunder on his 6th move, he probably should have moved Bb5.",
        "4... Nf6": "Protects black's pawn at d5 and begins to further the control in the center.",
        "5. Ba4+": "Checks black's king.",
        "5... Bd7": "Threatens white's bishop and moves out of check.",
        "6. b3": "One of black's few mistakes, although probably his worst. Better is Bxd7.",
        "6... b5": "Traps white's bishop. I almost made the mistake of capturing with my bishop on this move, but luckily I saw the right course of action.",
        "7. Bxb5": "Logical, so that white's pawn formation is not destroyed.",
        "7... Bxb5": "Of course.",
        "8. d3": "Attempting to develop pawns and gain control of the queen side.",
        "8... e5": "Black continues to solidify his center.",
        "9. c4": "Forks the bishop at b5 and pawn at d5.",
        "9... dxc4": "Isolates white's d3 pawn.",
        "10. bxc4": "Threatens the bishop, better, however, is dxc4.",
        "10... Qd4": "Traps white's rook.",
        "11. Qb3": "Threatens the bishop and prepares to trap black's queen.",
        "11... Qxa1": "Who wouldn't?",
        "12. Ne2": "Prepares for the long castle and traps black's queen.",
        "12... Bd7": "Conserves the bishop.",
        "13. Nec3": "Allows white's queen to move to other areas, while keeping black's queen trapped, however, O-O is better.",
        "13... Na6": "Black must account for his trapped queen by threatening the white queen if white attempts Bb2.",
        "14. Qb7": "This move caught me off guard. I had expected white to move Bb2, but instead he threatens my rook and knight. This also allows black to save his queen.",
        "14... Rb8": "Gives up the lesser piece.",
        "15. Qxa6": "Of course.",
        "15... Bb4": "Pins white's knight to his king. Enables black to escape with his queen intact.",
        "16. O-O": "Moves out of the pin.",
        "16... Bxc3": "Completes the queen's escape.",
        "17. Qxa7": "MUCH better is Nxc3",
        "17... Rxb1": "Obvious.",
        "18. Qa8+": "Also obvious.",
        "18... Ke7": "Forced.",
        "19. Qa3+": "Better is Qa7, pinning the bishop to the king. Checks black's king.",
        "19... Bb4": "Removes the check on black's king and safely attacks white's queen.",
        "20. Qa7": "A little too late. White sees his impending doom and resigns."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=4207",
    "gameName": "Let's play chess",
    "players": "lambly (1200) vs. demagog (1200)",
    "opening": "Caro-Kann (B10), Hillbilly attack"
}