{
    "moves": {
        "1. d4 Nf6 2. e3 b6 3. Nf3 Bb7 4. c4 e6 5. Bd3": "Having lost several games one after another I am trying to play very carefully. Builing up something like a Colle system.",
        "5... d6": "Very quite too. Black and White still haven't \"touched\" each other.",
        "6. O-O": "Usual development - preparing rook to e1 and Queen to c2 to increase pressure on e4 (which will eventually follow)",
        "6... Be7": "Black wants to castle too",
        "7. Nc3": "Developing another piece - more pressure on e4",
        "7... O-O 8. e4": "Occupying more space and thinking about attacking knight on f6 - main black king defender.",
        "8... Nbd7 9. Qc2": "Aligning queen with the bishop on d3 - preparing attack on h7 once the black knight is removed.",
        "9... g6": "As a rule says - Delay your castling pawns moves as long as you can. By moving this pawn black created a weakness on black squares.",
        "10. Bh6": "which white is trying to use - developing bishop with a tempo",
        "10... Re8": "has to move. White has advantage in terms of space.",
        "11. h3": "Preventing black knight from developing to g4 - white want black to stay in that \"compact\" state.",
        "11... Bf8": "Obviously, black doesn't like that white bishop",
        "12. Qd2": "Since attack on h7 is not going to happen, moving queen to a better square protecting the bishop",
        "12... Bg7": "Surprise - This black bishop can become quite strong on this diagonal. Also it is a black king defender",
        "13. Bxg7": "... so better to remove it.",
        "13... Kxg7 14. e5": "Trying to open up this position a little",
        "14... Ng8 15. Ng5": "... with the idea of Qf4",
        "15... dxe5": "Black also doesn't mind to open it up.",
        "16. d5": "keeping black's white-squared bishop diagonal closed. Pawn on e5 is weak.",
        "16... exd5": "fighting for these central squares.",
        "17. cxd5": "still blocking the b7 bishop",
        "17... a6": "protecting b5 square  -both knight on c3 and bishop on d3 wouldn't mind to get there!",
        "18. f4": "White wants to bring heavy artillery into the game - rook on f1",
        "18... Nc5 19. fxe5": "opening f-file for the rook",
        "19... Nh6": "preventing Rxf7",
        "20. Rae1": "Supporting pawn on e5 and bringing another rook into the game. Mistake - should have played Rc3. White queen is overloaded - protecting 2 pieces at once (knight on g5 and bishop on d3)",
        "20... Nxd3": "Black uses this fact",
        "21. Qxd3 Qxg5": "1 piece down",
        "22. e6": "White's pieces are better developed - pushing pawns forward with the idea to open up the black king more",
        "22... fxe6 23. Qd4+ Kg8 24. Ne4": "Threatening fork on f6",
        "24... e5": "preventing the fork",
        "25. Qc4": "White is 1 piece down, so no trading queens at this stage! instead white attacks the c7 pawn AND prepares the discovered check (pawn d6) AND still attacking the black queen",
        "25... Kh8": "Fatal mistake - this also happens to me - when analysing different ways to respond you forget the obvious - the queen is still under attack.",
        "26. Nxg5": ""
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=2575",
    "gameName": "Let's play chess",
    "players": "2dio (1607) vs. eveniza (1629)",
    "opening": "Queen's pawn game (A45)"
}