{
    "moves": {
        "1. e3": "this game as black has to overcome whit",
        "1... e5 2. Nf3 e4 3. Nd4 c5 4. Nf5 d5 5. Bb5+ Bd7 6. Nc3 a6 7. Bxd7+ Qxd7 8. Ng3 Nc6 9. Na4 Qc7 10. b3 b5 11. Nc3 O-O-O": "castling works very well here, behind a blanket of pawns\nthis also act as bait, to attract the white queen away from the white king!",
        "12. Qg4+ Kb7 13. O-O": "now the white king has castled...black must distract one or more of his guards to capture the king. All the while distracting the white queen with the black king!",
        "13... g6": "defend before the counter attack..",
        "14. d4 Nf6": "put the white queen under a little pressure, gain the advantage..",
        "15. Qe2": "queen retreats..... Black now attacks....and advances!",
        "15... cxd4 16. exd4 Nxd4": "black breaches whites defence, threatening and pressuring white queen. \n ",
        "17. Qd1 Qxc3 18. Bd2": "hit the knight and run....draw the attention of the queen away from the somewhat safe white king?",
        "18... Qc7 19. c3 Nc6": "withdrawal tactically, encourages the white to attack the black king...and again distract the white queen from her somewhat safe king?",
        "20. a4": "white attacks the flank...whilst black then attacks head on....once again encouraging white to attack black king...again along the flank, making it lokk weak....therefore... beckoning the white queen to leave her post!\nSo that black may then capture the king and his castle!! ",
        "20... d4 21. axb5 dxc3": "attacking head on!",
        "22. bxa6+": "white attacks fllank again! as predicted!!",
        "22... Ka8": "the king as bait... is now in the perfect place to attract the white queen from her post.\nThus leaving the king with a few sleepy easy to confuse guards...",
        "23. Rb1 Nb4 24. Qe2": "mistake by whites",
        "24... Rxd2 25. Qb5": "now the king is for the taking",
        "25... Bc5 26. Rfc1": "white king opens the gate!",
        "26... e3": "send in the foot soldier",
        "27. Rxc3": "whites  hopes of victory are hopeless now as one move for black secures the capture!",
        "27... exf2+ 28. Kf1": "no help for white king now.....f6 to g4 secures the capture of the white king.. forcing his apponent to resign. checkmate imminent.",
        "28... Ng4": ""
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=23996",
    "gameName": "Let's play chess",
    "players": "jarrod_lee (1471) vs. topviews (1295)",
    "opening": "Amsterdam attack (A00)"
}