{
    "moves": {
        "1. e4 e5 2. Nf3 f6 3. Nxe5": "Willing to sacrifice night in order to disrupt King side pawn structure",
        "3... Qe7 4. Nf3 d5 5. d3 dxe4 6. dxe4": "I got the feeling that black was playing agressive so I played the next few moves carefully.",
        "6... Qxe4+": "Black regains his pawn.  I believe this was a mistake given the black queen's retreat allowed me to develop my knights with Nc3 and then Nd4",
        "7. Be2 Ne7 8. Nc3 Qe6 9. Nd4 Qd7 10. O-O": "I am prepared to handle anything black throws at me and then some.",
        "10... Nbc6 11. Be3 Ng6 12. Bh5": "Black Kings Knight was dangerous to me, and I felt my light-squared bishop was expendable, so I was willing to keep him pinned for now.  This also relieved pressure on the e5 square.",
        "12... a6 13. Qe2": "Starting to take advantage of the e-file.",
        "13... Nce7 14. Rfe1 c6 15. Rad1": "Putting black's queen in danger",
        "15... Nd5": "The turning point of the game, where black exposes his King to me.",
        "16. Bf4+ Be7 17. Ne4 Ndxf4": "Not intending to give up this bishop.  I consider this my first and only blunder. Black would not be able to take advantage as my superior knight development proved later.",
        "18. Qf3 Qc7 19. Ng3": "Worried now that black wanted to trade queens.",
        "19... Bd7 20. Ndf5 Bxf5": "I beieve Black should have casled on queen side here instead of trading",
        "21. Nxf5": "Black might be thinking I would start trading more pieces but I had other plans in mind. ",
        "21... Nd5": "Black stacking up to defend e7",
        "22. Nxg7+": "Look at what spaces the knight has access to this move and next..Black has very few options to defend against this attack.  ",
        "22... Kf8 23. Ne6+ Kg8 24. Nxc7 Nxc7": "Two white knighs for a black bishiop, pawn and queen.  Favorable position for white.",
        "25. Rxe7": ""
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=25753",
    "gameName": "Let's play chess",
    "players": "mooday (1200) vs. richmann (1232)",
    "opening": "Damiano's defence (C40)"
}