{
    "moves": {
        "1. Nf3": "My last game with the Reti Opening was weird, so I'll try it again.",
        "1... d5 2. d4": "Transposing into a queen's pawn game.",
        "2... c6 3. c4 dxc4": "An unusual time to accept the gambit, although the Slav Accepted does so on the fourth turn.",
        "4. e3": "Threatening to win the pawn back; it seems to be the most common move here.",
        "4... Qa5+": "Probably an overly aggressive queen move; there is no real threat.",
        "5. Bd2 Qd5 6. Nc3": "Continuing to pester the queen.",
        "6... Qh5 7. Bxc4": "The queen hasn't done anything other than allow me to develop with tempo, and now I can retake the pawn with a significant developmental lead.  The bishop also eyes f7, although e6 easily breaks this up.",
        "7... Nh6": "The f pawn doesn't need another defender, so why not Nf6?",
        "8. O-O": "I'm unsure about castling kingside, but this seems the best way to continue development.",
        "8... Bg4": "Perhaps the castling was too early; black threatens to open the g file.",
        "9. Rc1": "I don't want to retreat my bishop to e2, and after 9...Bxf3 10. Qxf3 Qxf3 11. gxf3, it looks fine, since I still have a large lead in development and my rook can use the g file.  Therefore I develop my other rook.",
        "9... Nd7 10. Qb3": "Unpins the knight, attacks b7, and adds pressure to f7.",
        "10... O-O-O": "Protecting the b7 pawn.",
        "11. h3": "I want to push d5, but I want a rook at d1 first.  I don't want the knight to be pinned, so I drive away the bishop first. Better would have been Nb5, with similar threats as later in the game; if 11...cxb5?, 12. Bxf7  wins the queen.  However, this turns out to lose a pawn.",
        "11... Bxf3 12. gxf3 Qxh3 13. Bxf7": "If 13...Nxf7 14. Qxf7, it's still not optimal, but not too bad. If 13...Qxf3 14. Nb5 looks like a potential mating combination or significant material loss for black with 15. Nxa7 .",
        "13... Qxf3 14. Nb5": "Sacrificing the bishop and threatening Nxa7 .",
        "14... Nxf7": "Black could have declined the sacrifice with Kb8.",
        "15. Nxa7+ Kc7": "15...Kb8 16. Nxc6  Kc8 (16...Ka8? 17. Qa4#) 17. Nd5  wins the queen.",
        "16. Ba5+ Kd6": "b6 was the saving move; after 17. Nxc6, white can eventually also win the rook for the knight, evening up material.",
        "17. Nb5+": "I finally see a mate in two: 17...cxb5 (forced) 18. Bc7#.",
        "17... cxb5 18. Bc7#": ""
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=5154",
    "gameName": "Let's play chess",
    "players": "timbentley (1515) vs. dkphoto (1558)",
    "opening": "Reti opening (A06)"
}