{
    "moves": {
        "1. e4": "Today I would like to talk about the \"fabulous five\" King Safety, Material, Space, Time & Pawn structure! ",
        "1... c5 2. Nf3 Nc6 3. Bb5": "White elects to play away from the open Sicilians an opts for the Rossilimo treatment, this was every popular about 35 years ago & most of the folks who play it have one advantage  that is they have to know a smaller body of opening theory! White \"threatens\"  to damage  blacks pawn structure and maintain an advantage in time! Note in this particular variation whites king is prepared to castle early and begin the big fight!",
        "3... Qc7": "Black choose to meet the threat and now the Qc7 has some influence along the h2-b8 diagonal.",
        "4. O-O e6 5. Re1 Nge7": "Notice since black is behind in \"time or development\" he does not play to open the center, his plan is to complete his development & 0-0 to bring his king to safety first!",
        "6. Nc3 Nd4": "Here black attempts to stops any attempts to blow open the center and he is willing to accept double pawns in in order to slow down any attacking ideas white was thinking about! Another plan for white instead of 6. Nc3 was c3 planning to build strong pawn center with d4 to follow!",
        "7. Bf1 g6 8. d3 Bg7 9. Nxd4 cxd4 10. Ne2 O-O 11. Bf4": "I am quite please with the opening phase complete but I see a lack of energy with the continuation white has chosen.  If you don't push, sooner or later you will be pushed! blacks strategy has been successful, he has no problems & his d4 pawn restricts or cramps white game greatly.  Notice that without doing anything special, black controls more space and will have first opportunity to seize the initiative!",
        "11... e5 12. Bg3 f5": "Here is a critical point in this struggle, black \"threatens\" to gain more space with f4 but white see an opportunity to win a pawn because of the pin along the h2-b8 diagonal, do you \"think capturing this pawn was consistent with whites game plan\"?! It is amazing what some folks will do in order to win material. Perhaps f4 was called for to fight for some space on his side of the board but  I'm sure he did not like fxe4 ...",
        "13. Nxd4 f4 14. Bh4 exd4 15. Bxe7 Rf7": "OK white has won a pawn or so he thought, but lets take stock of what black got in exchange for the pawn! Black controls more space in the center & on the king side & generally with on space comes more activity! Blacks pawns on f4 & d4 have claimed a large chunk of space on whites side of the board.",
        "16. Bb4": "Maybe this bishop looked better on the king side, I think the white king needs some help!",
        "16... f3": "I think white did not anticipate this idea ... if gxf3 Be5 focuses another piece at the lonely white king. Remember the responsibilities of a pawn ... a. keep the king safe, b. protect pieces, c. fight for territory or space, d. threat to promote as they advance!",
        "17. g3": "So white decides that \"keeping the king side closed\" might be in his best interests, now with the presence of the pawn on f3 blacks plan will be to exchange the white squared bishops leaving whites king without any protection!",
        "17... d6 18. Bd2": "I believe this waste to much time, perhaps c3 with the idea of Rc1 was better!",
        "18... Be6 19. a3 Rc8 20. Rc1 Qb6 21. b3 a5 22. a4 Rc5 23. b4 axb4 24. Rb1 b3": "Blacks probing on the queen side was a \"restrictive measure\" this way he controls what lines will be open an which ones will not! Always consider what the other players plan is!",
        "25. cxb3 Rh5": "Ave captain I think its a bit lonely over here ... but not for long!",
        "26. Qc1 Qd8 27. Rb2 Qd7 28. Bf4 Bh3": "Psst ... I fallen down and I can't get up... help! Hail hail the gangs all here, and here comes the queen!"
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=36012",
    "gameName": "Let's play chess",
    "players": "gidi (1767) vs. dinosaur53 (1893)",
    "opening": "Sicilian (B30), Nimzovich-Rossolimo attack (without ...d6)"
}