{
    "moves": {
        "1. e4 g6": "A pesar de que nunca me he enfrentado a esa defensa decido proseguir con mi idea inicial: apertura italiana.",
        "2. Nf3 Bg7 3. Bc4 d6 4. c3": "Hay que contrarrestar el poderío de su alfil negro: c3.",
        "4... Nf6 5. d3": "Con d3 defiendo el peón de rey y abro la diagonal para mi alfil negro.",
        "5... c5 6. Nbd2 a6 7. a3": "Gano un poco de espacio por si su idea es iniciar un avance en el flanco de dama.",
        "7... O-O 8. Nf1": "Cf1. Hay que empezar a atacar el enroque ya. Con la mayor cantidad de recursos posibles.",
        "8... b5 9. Ba2 Bb7 10. h4": "Como iba diciendo, hay que atacar con todo...",
        "10... h5 11. Rh3": "Incluso renunciando al enroque. Su peón en h5 interrumpe la acción de la la torre, así que hay que buscar una buena ubicación para ella, siendo g3 un punto que no puede atacar.",
        "11... Nbd7 12. Rg3 Ng4": "Hay que echarlo de ahí.",
        "13. Nf1h2": "Atacándolo.",
        "13... Nxh2 14. Nxh2 e6": "Cubre el punto f7 y ataca mi peón de h4. Mi alfil blanco pierde influencia, pero antes debo defender el peón.",
        "15. Rh3": "¡ Qué remedio ! Defenderlo con Cf3 implicaba obstaculizar la diagonal blanca que controla la dama.",
        "15... Nf6": "Error. Voy a clavar ese caballo.",
        "16. Bg5": "A ver qué hace con su dama...",
        "16... d5": "Otro error. Me garantiza una pieza a buen precio.",
        "17. e5": "Habrá que estar atento al punto g2.",
        "17... c4 18. d4": "Cierro el centro y mi alfil irá a b1 para controlar la diagonal que va hasta h7.",
        "18... Qd7": "Aparta la dama restando un defensor al caballo.",
        "19. exf6": "Pieza gratis. No creo que renuncie al otrora poderoso alfil negro o su rey quedará muy desvalido.",
        "19... Bh8": "Hay que atacar más. A su dama, por ejemplo. Y de paso bloqueo el peón de e6.",
        "20. Nf3 Qd8": "Lo ve.",
        "21. Ne5": "El caballo en esa posición es un monstruo. Inatacable. Supongo que tomará el peón tan molesto de f6.",
        "21... Re8": "¿ ?",
        "22. Qf3": "Consolido entonces el punto f6.",
        "22... Rf8 23. Bb1": "Comienza el asalto final.",
        "23... a5": "No calculo en profundidad porque instintivamente percibo que un contraataque en el flanco de dama no prosperará.",
        "24. Bxg6": "Capturar el alfil implica perder la dama y sufrir un peón en f7.",
        "24... Qc7": "Tomar el peón con la dama abriría la séptima fila y la dama negra podría auxiliar a su monarca.",
        "25. Bxh5": "Tomar el peón con al alfil abre más posibilidades.",
        "25... b4": "Dudo. ¿ Prosigo mi ataque o me defiendo ?",
        "26. axb4 axb4 27. Rxa8 Bxa8": "Y ahora, ¿ Qué pieza defiende mejor al rey negro ?",
        "28. Bh6": "La torre.",
        "28... Qa5": "No quiere abandonar. Le daremos mate.",
        "29. Qg4+ Kh7 30. Bg6+": "Si el rey toma mi alfil negro dama g5 mate. Si su peón toma mi alfil blanco dama g6 mate.",
        "30... fxg6 31. Qxg6#": ""
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=67291",
    "gameName": "Let's play chess",
    "players": "tiramisu (1828) vs. all4nc (1700)",
    "opening": "Robatsch (modern) defence (B06)"
}