{
    "moves": {
        "1. d4": "Hi, this is Ren and I would like to show you my first game here of GameKnot.\nMy opponent was 412364, who had black pieces; I, with white, started with d4.",
        "1... d5": "My opponent plays d5, giving a Closed Game opening.",
        "2. c4": "c4: Queen's Gambit...",
        "2... Nf6": "...and now Nf6, defending the pawn on d5.",
        "3. e3": "The idea behind e3 was to defend the c4 pawn with the light-square bishop, although taking on d5 may have been a better continuation.",
        "3... e6 4. Nf3": "Again, it would have been better for me to have played cxd5, as after the knight recaptures, this move, Nf3, could allow for 5.e4.",
        "4... Bd6": "Here, my opponent's bishop is developed nicely, sitting behind the d5 pawn.",
        "5. Nc3": "Perhaps not the best move in the circumstances, blocking off a diagonal for a potential bishop on d2.",
        "5... O-O 6. Qc2 Nc6 7. Bd3 Nb4": "7.Bd3 is a bit of a mistake, conceding the tempo with a knight fork on bishop and queen.",
        "8. Qd2 Ng4": "Black opts not to capture the bishop on d3, which may have been the strongest move, instead advancing the knight to g4.",
        "9. a3": "a3, with the aim to kick the knight back, seeing as black is reluctant to exchange it for my bishop.",
        "9... e5": "? A mistake by my opponent, leaving me to capture free material.",
        "10. axb4 exd4 11. exd4": "After the dust has settled, I am a piece up.",
        "11... Re8+": "Check is given for the first time...",
        "12. Ne2": "...I decide to block with my knight.",
        "12... c6": "Looking at the game now, is seems rather obvious in retrospect that I was given the opportunity to push my pawn to c5, forcing the bishop back to c7. Incredibly enough, neither of us saw it, and despite me having numerous opportunites to advance the pawn, it would forever remain on the fourth rank.\n\nLive and learn, I suppose...",
        "13. h3 Nf6": "...Instead, I kick the knight on g4 back with h3.",
        "14. O-O": "Probably played a move too early, looking back.\nAt this point I was expecting to see my opponent capture my pawn on c4, breaking my pawn structure on the queenside. However, as it happenned...",
        "14... Bxh3": "? Again I am puzzled by this sacrifice.\nI hesitated quite a while, thinking this could be a trap, however I resolved that it was free material a second time after not seeing any winning variatons for black.",
        "15. gxh3 Re7": "I'm a tad peturbed by this move, I'm thinking black's queen is coming to e8 to exploit the open e-file.",
        "16. Kh1 Qc7 17. Rg1": "A fairly clunky series of moves, and I've missed an opportunity to win black's dark-square bishop with c5 (e5, f4, g3 and h2 are all protected).",
        "17... Ne4 18. Bxe4": "Taking the knight with the idea of simplifying the position, since I am winning on material.",
        "18... dxe4 19. Qg5": "The threat here is checkmate on g7",
        "19... g6": "This is not the best defence. Although 19. ...g6 does prevent the queen coming to g7, a better continuation would have been ...f6, allowing black the tempo to capture my knight on f3.",
        "20. Nh4": "Preparing my knight to move to f5.",
        "20... Bxb4 21. Nf5 f6": "This is a blunder. After Qxf6, I have not only won a pawn, but black's king is trapped for now on g8, and has to attend to a mating threat on h6.",
        "22. Qxf6 Rd7": "?? A shame, despite having a better position than me at move 7, my opponent gradually threw away their advantage with a few silly mistakes. This does not defend the h6 square or allow the black king to escape, and mate in one follows.\n\nCommiserations to my opponent, who I'm sure will take a bit more care in the future, although I've seen that I certainly need to develop a bit more cunning into moves of my own.\n\nThat is all, I hope you enjoyed reading and bye for now.",
        "23. Nh6#": ""
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=45705",
    "gameName": "Let's play chess",
    "players": "renbeaudach (1200) vs. 412364 (1193)",
    "opening": "QGD (D06), Marshall defence"
}