{
    "moves": {
        "1. b4": "!? Intending to fianchetto the dark-squared bishop, but instead of the more solid 1.b3 White also intends to gain space on the queenside.",
        "1... a5": "I will try to prove that 1.b4 creates unnecessary weaknesses.",
        "2. b5": "Creates more weaknesses.",
        "2... d5": "I will develop like a normal London System, and try to exploit the extra weaknesses in White's base.",
        "3. Bb2": "Following through with the plan of posting bishop where it controls the most squares.",
        "3... Bf5": "Classic move of the London System. Get The bishop outside of the pawn chain before playing e6",
        "4. e3": "Boosting control of d4, while also defending b5.",
        "4... Nd7": "e6 immediately is probably better",
        "5. c4": "White strikes in center",
        "5... e6 6. cxd5 exd5": "I end up losing a central pawn for a flank pawn, but it is OK, because White is creating weaknesses with every additional pawn advance. I also get an open e-file for my rook if I need it.",
        "7. a4": "creating additional weaknesses in order to over-defend b5",
        "7... Ngf6": "developing like a London System.",
        "8. Nf3": "Improving control of the central dark squares. Very similar to a Queen's Indian, except that White has pushed the a & b-pawns further than normal.",
        "8... Bd6 9. Nc3 O-O 10. Be2 h6": "Creating luft for the bishop/king like in a normal London System.",
        "11. Qb3": "Queen is out rather early.",
        "11... Nc5": "Gain time",
        "12. Qa2": "retreat",
        "12... c6": "With prospects for a future kingside attack with the Queen/Bishop battery along the b8-h2 diagonal.",
        "13. bxc6": "gives up control of b5",
        "13... bxc6": "now I have prospects on the queenside with my open-file, in the center with my control of the light-squares, and on the kingside with my open e-file and control of the b8-h2 diagonal.",
        "14. O-O": "The f3-knight already defends h2, and I didn't see anything immediately decisive in the center,",
        "14... Na6": "Aiming to re-position the knight on the b4-outpost, where it cannot be chased away by pawns, it can only be attacked by pieces, in which I can replace b4 while improving something else.",
        "15. Ba3": "White could have tried this idea earlier.",
        "15... Nb4": "but here I block it",
        "16. Bxb4": "This trade is usually only good in a closed position, not an open one.",
        "16... axb4": "replacing while improving",
        "17. Nd1": "retreat",
        "17... c5": "This weakens b5, but I thought it is OK now that the knight cannot take advantage of the b5 outpost",
        "18. Bb5": "a bishop on an outpost is not the same. bishop's do not belong in a knight's role",
        "18... Bc7": "setting up the battery",
        "19. d4": "blocking the a1-h8 diagonal now that there is no bishop to obstruct",
        "19... c4": "but I advance with 2 connected passed pawns",
        "20. Bxc4": "? White sacrifices",
        "20... dxc4 21. Qxc4": "White has 2 connected passed pawns for the piece, but the a-pawn is isolated, and I have superior piece placement and the bishop pair.",
        "21... Qd6": "Checkmate prospects on h2",
        "22. g3": "creates weaknesses to block them.",
        "22... Bh3": "Takes advantage of those weaknesses. This time a bishop is appropriate for this task, because it is a kingside assault. ",
        "23. Nb2": "intends to be down a full rook",
        "23... Rfc8": "I decided to develop more instead of taking rook",
        "24. Rfc1 Ne4": "taking advantage of the d4-pawn advance, now there is no d3. I am also targeting f2, which has been weakened by the rook's movement.",
        "25. Nd3": "controlling f2 and c5 and e5",
        "25... Qf6": "targetting f3 & f2, and revealing the bishop to g3",
        "26. Nde1 Bxg3": "discovery attack",
        "27. Qxc8+": "White decides to give up the queen",
        "27... Bxc8": "two rooks are redundant, so I decided to leave White with 2 rooks.",
        "28. hxg3": "I have queen for rook and pawn",
        "28... Bg4": "but continue kingside attack",
        "29. Kg2 Qf5": "Intending Qh5 Qh3+ and Nxg3",
        "30. Rc4 Qh5 31. Nh4 g5": "kicking knight from stopping my plan",
        "32. d5": "gxh4 followed by hxg3 and Qh3+",
        "32... Nxf2 33. Kxf2 gxh4 34. gxh4 Qxh4+ 35. Kg1 Qg3+ 36. Kf1 h5 37. Ng2 h4 38. Rxb4 h3 39. Nf4 Bf3 40. Ra2 Kg7 41. d6 Rd8 42. Rd4 Rb8 43. Rad2 Rb1+ 44. Rd2d1 Bxd1 45. Rxd1 Qf3+ 46. Kg1 Rxd1+ 47. Kh2 Rh1#": "kingside attack finished"
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=64703",
    "gameName": "Let's play chess",
    "players": "dbinc007 (1480) vs. hexchess (1693)",
    "opening": "Polish (Sokolsky) opening (A00)"
}