{
    "moves": {
        "1. e4 e5": "I'm not much of an e5 player, but I chose to play it because I was hoping for a real Morphy King's Gambit game.",
        "2. d4 exd4 3. c3": "Danish Gambit, I rather like white's chances after the two pawn sacrifice so i'll decline.",
        "3... Qe7": "I debated between the Sörensen Defense immediately (d5), but I decided to see my opponents reaction to Qe7.",
        "4. Bd3": "An attempt to solve the e4 pawn, but instead later it allows me access for a decent post in his territory.",
        "4... d5 5. Qa4+ Nc6 6. Ne2 dxe4 7. Bb5 Bd7 8. Bxc6 Bxc6 9. Qxd4": "The whole time i was expecting a cxd4...poor b1 knight never got to participate much",
        "9... Bb5": "Preventing the imminent castle at least for the moment",
        "10. Be3": "I'm still unsure of this move, perhaps just for a development and for a battery?",
        "10... c5": "Destroying hte battery and launching a counter offensive",
        "11. Qd1 Bd3": "I particulary like this move. ",
        "12. O-O Nf6": "Development",
        "13. Re1": "Support to the knight; frees the queen",
        "13... O-O-O": "More support to the knight and also an indirect attack to the queen.",
        "14. Qa4 Qd7": "I figured I had decent position and I was welcome to the trade; however, my opponent fell for the trap....",
        "15. Qxa7": "gobbling the a7 pawn and...",
        "15... Bxe2": "losing the knight. Rxe2 and Qc1 ",
        "16. Nd2 Qb5": "Support to the bishop and also attacking the b2 pawn",
        "17. c4 Qxb2": "Here I looked into the position a little bit deeper and decided this was still in my best interest even after",
        "18. Rab1": "My queen will be traded out or I lose my bishop entirely",
        "18... Rxd2 19. Bxd2": "I was rather surprised at this move, I assumed he'd take the queen, but instead he tried to launch an attack at my weak base.",
        "19... Qxd2": "There was no immediate checkmates and I figured he could chase me around and I could end to safety at g6 if needed",
        "20. Qxb7+ Kd8 21. Qxf7": "Threatens mate with Rb8",
        "21... Bd6 22. Qxg7": "Another pawn gobbled",
        "22... Rf8": "everything seems well protected and no chances for me losing yet, so back to my offensive",
        "23. a4": "I guess my opponent decided we were in a sort of drawish position and figured he could push his a pawn without resistance",
        "23... Nd7": "Perhaps I could've made another move, but at the time I didn't account for Qb2 which halts my attack",
        "24. a5 Bd3 25. Qb2": "There's the Qb2...i get an extra pawn and let the trade occur",
        "25... Rxf2 26. Qxd2 Rxd2 27. Rbd1": "Tough position, perhaps better to not have traded rooks, but still I should be able to take the game with relative ease",
        "27... Rxd1 28. Rxd1": "He too decides it's too hard to continue. "
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=20564",
    "gameName": "Let's play chess",
    "players": "morphy76 (1570) vs. jackiesprince (1552)",
    "opening": "Danish gambit (C21)"
}