{
    "moves": {
        "1. g3 e6": "My normal opening playing Black. I tend to be very cautious... I don't know who I'm playing against so I use that as a probe.",
        "2. Bg2": "Anytime I see an opening like this, I feel the opponent is more cautious than me. It tells me, \"go for it!\"",
        "2... Ne7 3. e3 Ng6 4. d4 Be7 5. Ne2 O-O 6. O-O c6 7. b3 d5": "Anticipating a Knight move, I needed to boss the center. d5 destroys any thoughts of Be4, and dominates c4.",
        "8. Nd2": "Nd2 made true my hunch. Now, there's a bit of control for me on e4 and c4. I can always decline any attack from both squares.",
        "8... Nd7": "Not a good move, in my honest opinion. I needed to move a piece rapidly towards my opponent's King side... that was my only logical piece because my g6 Knight has all its squares compromised.",
        "9. c4": "My opponent did it!",
        "9... Nf6": "And I declined...",
        "10. c5": "By declining the challenge on 9. c4, I was able to advance my 9. ... Nf6. I still think I own the c4 spot because there're no opposing pawns attacking it. I will still be able to break c5 by playing ... b6, b4 bxc5, bxc5 Qa5... That opens up the channel for me.",
        "10... Ng4 11. h3 Nh6 12. h4 Nf5 13. h5 Nh8 14. Bh3 Nh6 15. Nf4 e5": "Dancing time is over. Let's break it up. The Bishop and Knight are both under threat. An opportunity to create two isolated pawns if 16. dxe5.",
        "16. dxe5": "Good! Isolated pawns at e5 and c5. Pawn attack broken up even before it started. I gain the center. Doubled pawns on e column.",
        "16... Bxc5 17. e6": "Good move, too! Opponent was aware of the hiccups and tried to rectify it with veiled attacks on Rf8 and Bc5... that is, if 17. ... Bxe6, 18. Bxe6 fxe6, 19. Nxe6 pinning the Queen, Rook and Bishop. Nice try, though.",
        "17... fxe6 18. Bxe6+ Nh8f7": "I still did not bite. A family fork is not what I want at the moment... Just saying!",
        "19. Bb2 Qe7 20. Bxf7+": "Stampeding opponent into making a decision on the occupancy of e6.",
        "20... Nxf7 21. Kg2 Ng5 22. Rh1 Ne4 23. Ng6": "Greed... Not good when playing chess. Opponent was thinking of mounting an offense along h. Thinking I'll do 23. ... hxg6, 24. hxg6 freeing the h5 square for his Queen. My g7 spot is under a Bishop attack and he's feeling lucky. Too bad a blizzard is coming.",
        "23... Rxf2+ 24. Kg1 Qf7": "To be perfectly honest, this move was my gamble. I had thought 24. ... Qg5 was more appropriate. Attacking g3 and e3 would have been awesome. In my haste, though, I saw an opportunity to give him some things to think about: Knight on g6; Bishop on b2; potential checkmate (if 25. Nxe4 Rxb2, 26. Nxc5 Qf2++). I was shocked what happened next...",
        "25. Ne5": "???",
        "25... Rg2+": ""
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=40311",
    "gameName": "Let's play chess",
    "players": "levonsg (1544) vs. legzyt (1526)",
    "opening": "Benko's opening (A00)"
}