{
    "moves": {
        "1. Nf3 Nc6 2. e4 e5 3. Nc3 Bb4 4. Nh4": "The french queen dines on white horse, a delicacy in those parts.  Before moving the knight to the side of the board advancing the g pawn one square would have offered it some cover.  Otherwise, you're sacrificing a valuable piece just to draw the french (black) queen out.",
        "4... Qxh4 5. Bc4": "Once black has moved his queen the four move checkmate no longer works.  Sorry I forgot to show you the two move check mate the other night.",
        "5... Qe7 6. d3": "This pawn move blocks the white bishop's return and removes support from the remaining knight.  Black might trade here just to break and double the white pawns.",
        "6... Qc5": "?  Not sure what advantage moving the queen again gives black.",
        "7. Qf3 Nh6": "Black defends against check, not checkmate, albeit a painful check (several free pieces for white).",
        "8. Bxh6": "Excellent move.",
        "8... f6 9. Bxg7": "Another good choice.",
        "9... Nd4": "Ouch!  White either protect the c2 pawn or risk losing a rook.  White COULD castle, and sacrifice the pawn for black's f6 pawn.",
        "10. Qh5+ Ke7 11. Qf7+": "More good moves.",
        "11... Kd6 12. Bf8+": "The trouble here is that white's rook remains at risk from the black knight.  There is still going to be material exchange.  My guess is black will take white's bishop.",
        "12... Rxf8 13. Qxf8+ Kc6 14. a3": "?  White's queen falls easy prey here.  QxQ+ forces black to do something so white can castle and protect the a1 rook from the continued black knight threat.  This pawn threat against the bishop does nothing to save the white queen.  The trade would have given white a big advantage, now that he was ahead 3 points.",
        "14... Nxc2+": "The white queen can wait, it seems.",
        "15. Kd2": "Oh, now black can defend the knight with QxPf2+.  After the white king moves again the black bishop can pick off the white queen.",
        "15... Qxf2+ 16. Kd1": "Ne3+ is a force mate.  Kc1 is better.",
        "16... Ne3+ 17. Kc1 Qc2#": ""
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=41270",
    "gameName": "Let's play chess",
    "players": "corpagent (1200) vs. mrlark (1200)",
    "opening": "Reti opening (A04)"
}