{
    "moves": {
        "1. e4 e5 2. Nf3 Qf6": "Greco openning. Caught me offguard. Only read up after I made the next move (which turned out to be \"solid\" but not the best.",
        "3. d4 Nc6 4. d5": "not sure if that was better than Be3.",
        "4... Nd4 5. Nbd2 d6 6. c3 Nxf3+ 7. Nxf3 Bg4 8. Be2": "Resisted the temptation to do a h3 which might have been bad for me.",
        "8... O-O-O 9. Bg5": "could not resist the obvious skewer. Her response was powerful though.",
        "9... Qg6 10. Bxd8": "with sufficient defense on f3, I went for the rook. Qxe4 was dangerous because my bishop would have been pinned, removing one level of defense on the knight at f3.",
        "10... Kxd8 11. h3": "probably premature on my part, Qd3 in preparation for O-O-O might have been a better way to activate my forces for an assault on her now extremely weak queen-side.",
        "11... Bxf3 12. Bxf3 Nf6": "I was very annoyed at this, she keeps up the pressure on the e4 pawn with myself running short on resources to defend it.",
        "13. Qe2": "I wonder if d3 would have been a better move?",
        "13... c6 14. c4": "provided me an opportunity to open up the c file for my rook to dominate. 14 ...,c5 might have been a better defense for her since her bishop is stuck even with cxd5 (which she played).",
        "14... cxd5 15. cxd5 Nd7 16. b4": "Can't risk her knight wrecking havoc on the now very open queen-side field.",
        "16... Nb6 17. a4": "again, the purpose was to prevent her knight from crossing the lines.",
        "17... h5 18. a5": "I might have been better off worrying about that h5 move instead of trying to drive her knight back prematurely. Kd2 might have worked better for me, moving the king to support the a/b pawns while uniting the two rooks for an assault later.",
        "18... Nd7 19. g4": "On hindsight, was pretty premature. Was tempting her to take the exchange so my bishop could direct an attack on the diagonal that ends on the crucial c8 square which my a-rook could reach.",
        "19... hxg4 20. Bxg4": "am now wondering if hxg4 might have been better. Seems risky exposing the king like the rook exchange that probably has to happen (her alternative would be Rg8, cramping her positions even more). Anyway, I did not consider this possibility at the time I made this move.",
        "20... Nf6": "Ridiculously powerful response. The double attack on the bishop and pawn is devastating. I was left scrambling to find resources to defend my position. Again, I failed to notice that Bf3 keeps my rook covered at h1.",
        "21. Bf5": "Seemed like the best response at that time, though I think f3 would have been safer. Her response had been considered by me and I worried about it for a while. Worked out in the end though.",
        "21... Qg2 22. Kd2": "My only possible response. Anything else loses the h-rook. I was not a happy camper.",
        "22... g6 23. Rag1": "Bishop was trapped. Fortunately, so was her queen.",
        "23... Qxg1 24. Rxg1 gxf5 25. f3": "The exchange stung even though I got rid of her queen. Now she had more pieces potentially attacking a weak point than I could field and my h-pawn was definitely lost. I considered my e-pawn way more important however, so f3 was forced as there was no other reasonable way to defend it. Luckily her bishop is of limited use at this point.",
        "25... fxe4": "I think this is her key blunder. I would have taken the h-pawn to attack the f-pawn and setup a possible queen-pin (probably would not happen since my rook was in a convenient position). In any case, if she believed I would take her \"free\" f-pawn, she's sadly mistaken. 26. exf5 would have broken my pawn structure into an indefensible mess.",
        "26. fxe4 Bh6+ 27. Kc2": "Feeling a little more confident now. It is still dangerous for me, but she had jammed her rook into a corner again with an ineffective bishop blocking the way.",
        "27... b6 28. axb6 axb6": "This exchange provided me with all the opportunity to press the attack before it was too late. She perhaps should have prepped the pawn exchange by moving the king foward to enable the rook to move queen-side for support. Now, I willingly abandon the e-pawn. My rook can cover the e2 square to prevent her e-pawn from queening, her bishop is useless and her knight at e4 would take forever to get in a position to attack my king.",
        "29. Qb5": "My preparation was for a Nd7 defense, for which my response 30. Qc6 would then force her bishop back to f8 to prevent 31. Qxd6 . Then, after tying up two of her pieces, I could find a way to push the h-pawn with king and rook support. That was the plan anyways ...",
        "29... Kc7": "She blew away any chance of a draw with this move.",
        "30. Qc6+ Kb8 31. Qxb6+ Kc8 32. Qc6+ Kd8 33. Qxd6+ Nd7 34. b5": "I believe this pawn push was useless. Ra1 now loses her the rook and bishop because the only way to avoid 35. Ra8# is 34. ..., Kc8.",
        "34... Be3": "Believe it or not, this move of hers alerted me to the move Ra1. Now, on hindsight, she should have attempted to drive my queen away with Bf8, allowing her 35. ...,Rxh3 and a possible assault (thankfully no perpetual check possible) on my king.",
        "35. Ra1 Rxh3": "too little too late. Even Bc5 now would not have saved her.",
        "36. Ra8#": ""
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=19528",
    "gameName": "Let's play chess",
    "players": "cheewai (1200) vs. jeanybeany (1122)",
    "opening": "Greco defence (C40)"
}