{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Bc4 Nf6 4. d3": "3. Con d4 en lugar de d3 se iniciaría el extremadamente complicado e inestable ataque de Max Lange. Aquí sigo otra línea de ataque...\n",
        "4... Bc5 5. Nc3 O-O": "5. ... 0-0. Las negras enrocan pero las blancas prefieren ganar un tiempo en desarrollo de ataque dado que el centro está cerrado y el rey, de momento, bien resguardado.",
        "6. Bg5": "6. Ojo a este movimiento que es la clave de la victoria de las blancas: el caballo en f6 queda clavado por el alfil. ¿Por qué descuidaron las negras esta situación?. Supongo que el razonamiento de levoxine100 sería proteger el caballo con la dama para evitar abrir peligrosamente la linea g al tomar el alfil con el peón g7.",
        "6... a6 7. a3 b5 8. Bd5 Bb7 9. Nxe5 Na5": "9. --- negras podrían haber jugado C x C..., pero, en principio, el criterio que siguieron las negras es más ortodoxo ya que tomando el caballo blanco suponía perder el alfil b7, y dado que auuuu llevaba ventaja material se debería evitar el intercambio de piezas (quedando así a iniciativa de las blancas). Hasta aquí resulta imprevisible el mortífero ataque de blancas.",
        "10. b3": "10. b3 en lugar de b4!... No me puedo explicar este lapsus (tal vez el único, pero suficiente para que la partida de blancas pueda considerarse perfecta). La intención era clara: el ataque doble a caballo y alfil, con pérdida inevitable de una de las dos piezas. Yo creía haber jugado b4 en lugar de b3, esto no se olvida fácilmente ya que es una de las jugadas más excitantes, pero al revisar la partida me encuentro con ese bug... lo que demuestra que la mente no está continuamente al 100%, sino que se producen oscilaciones el la curva de la atención, y cuando te pilla en un valle pues metes la pata.",
        "10... Bxd5 11. Nxd5 d6 12. Ng4 Bxf2+": "12. ... AL fin y al cabo el bug de b3 no tuvo consecuencias: lo curioso es que las negras reaccionaron como si las blancas hubiesen jugado b4, tomando el alfil negro en f2. Tal vez la explicación esté en un análisis más profundo por parte de las negras, al probar suerte esperando que el rey blanco tomase el alfil, lo que parece razonable ya que el caballo en g4 estaba muy bien posicionado. En este caso auuu fue prudente e inició un rápido \"Analize Board\", descubriendo así que con el rey en f2 las negras podrían jugar C x e4+, a lo que blancas deberian jugar d3 x e4, es decir, negras cambian el caballo clavado desde el principio por un peón... pero la dama negra tomaría el alfil en g5. De esta forma las negras acabarían con la iniciativa de las blancas, y adquirirían incluso ventaja material de un peón.\n\n-0-0-0-0-0-0-0-0-0-0-0-0-0-0-0-0-0-0-0-0-0-0-0-0-0-0-0-0-0-0-0-0-0-0-0-0-0-0-0-0-0-0-0-0-0-0-0-0-0-0-0-0-0-\n\n12 ... After the bug b3 did not succeed: the funny thing is that the black reacted as if White had played b4, taking the black bishop on f2. Perhaps the explanation is in a deeper analysis of the black, to try his hand waiting for the white king take the bishop, which seems reasonable since the horse was well positioned g4. In this case auuu was prudent and began a quick \"Analyze Board\", discovering that with the king at f2 Black could play C x e4 +, what white should play d3 x e4, ie Black exchanges the horse nailed from the principle for a pawn ... but the black lady would take the bishop on g5. This would end the black white initiative, and even acquire material advantage of a pawn.",
        "13. Nxf2 h6 14. Nxf6+": "14. Aquí se inicia la secuencia más engañosa, ya que las blancas tenían dos piezas amenazadas...\n\nMoraleja: analizar siempre, hasta lo más evidente.",
        "14... gxf6 15. Bxh6 Re8 16. Qg4+ Kh7 17. Qg7#": ""
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=56203",
    "gameName": "Let's play chess",
    "players": "auuuu (1388) vs. levoxine100 (1372)",
    "opening": "Two knights defence (Modern bishop's opening) (C55)"
}