{
    "moves": {
        "1. d4 b5": "This opening is not sound but without computer and database players often fail to find the best continuation.",
        "2. e4 Bb7 3. d5": "Typical opening mistake in Polish defense. f3 or Nd2 is much better.",
        "3... c6": "Nf6 is better.",
        "4. Nc3": "Now computer analysis says black is slightly better. 4. dxc6 is the right move.",
        "4... b4 5. Na4 cxd5": "Black should have played Qa5 before capturing. Now white can play Nc5.",
        "6. exd5": "White misses Nc5.",
        "6... Qa5 7. c4 bxc3 e.p. 8. Nxc3 g6": "A serious mistake. Black should continue the development with Nf6. In fact when I played this I hoped for some tactics related to pinned Nc3.",
        "9. Bd2 Bxd5": "Tactical blunder. White can instantly win with 10. b4!",
        "10. Nxd5": "Returning the favor. Now the position is nearly equal.",
        "10... Qxd5 11. Bc3 Qe6+": "Computer recommends Qxd1 followed by Nf6. I played Qe6+ cause I missed some important nuance(see the next comment).",
        "12. Qe2": "Be2 was better as it keeps queens on board and with two bishops in open position white has more than enough compensation for the pawn. ",
        "12... Qxe2+ 13. Bxe2 f6": "Notable mistake. I thought that with pawn on f6 I can advance the central pawns. Clearly it is not so simple. Nf6 was better as it develops the knight and if white takes the knight he loses bishop pair.",
        "14. Nf3 Nc6 15. O-O Kf7": "Serious blunder. e5 was correct. Now the d7 pawn is not protected, and f6 is pinned.",
        "16. Rad1 d6": "Ke8 was better. It is not too late to acknowledge your fault yet.",
        "17. Bc4+": "Ng5+ followed by Bb5 was winning.",
        "17... Kg7 18. Ng5 Ne5": "Nd8 is better. Now white can win with a simple tactic. I thought that white will trade pieces on e5 and play Nf7 to win an exchange.",
        "19. Ne6+ Kh6 20. Bd2+": "If 20. Bd5 was winning.",
        "20... g5 21. Be2": "Bd5 leads to huge material gain. Mow the position is nearly equal.",
        "21... Kg6 22. Nxf8+": "This move looks just stupid even without computer and calculations. White trades his very active knight for not developed yet bishop. Bishop completely blocked by it;s own pawns. Bishop that blocks development of the rook on h8. While not the most significant mistake in terms of score change this Nxf6? move is probably the one which players of every level can learn from.",
        "22... Rxf8": "Black is slightly underdeveloped and white has bishop pair, but connected passed pawns on the center can become extremely dangerous.",
        "23. f4 gxf4 24. Bxf4 Rb8 25. b3 Nh6 26. Rdc1": "Breaking the sequence of 6 half-moves without notable mistakes. Bxe5 was better.",
        "26... Rhc8": "Adequate response. Black finished the development and threatens to push the pawns.",
        "27. Be3 a5 28. Ba6 Rxc1 29. Rxc1 Nf5 30. Bf2 Ng4": "Ng4 looks dangerous but it is not the best move. Computer suggests 30. .. e6! or 30. ... d5! preparing to push the pawns. Now white can regroup his pieces.",
        "31. Be1 Nge3": "Another blunder. Knight must return to e5. Now white can play Rc8 with major problems for black.",
        "32. Bd3": "Missing the best move - Rc8.",
        "32... a4 33. Bf2": "Bd2 is better",
        "33... Kg5 34. bxa4 d5 35. h4+": "Strange move. White should use every opportunity to push the passed pawn rather than help black move his king to a more active position.",
        "35... Kf4 36. a5": "Too late. Now white must play Rb1.",
        "36... e5 37. a6 e4 38. Bf1 d4 39. a7 Ra8 40. Rc7 d3 41. Rxh7": "Rd7 was necessary.",
        "41... d2": "Another mistake. Too greedy, too early. Nxf1 followed by e3 was winning instantly.",
        "42. Be2 d1=Q+ 43. Bxd1 Nxd1 44. Bb6 e3 45. Kf1 Ng3+": "Yet another tactical mistake. I thought that after Ke1 I can play Nb2 and after it Nd3+ is crushing. What I missed is Bc7+ and black loses his knight. Now black must work hard to get a draw.",
        "46. Ke1 Nc3 47. Bc7+ Kf5": "Kf5 is the only move. Greedy Kg4 was losing instantly.",
        "48. Bb8": "That's a serious mistake. White was afraid of 48. Bxg3 Rd8 threatening Rd1#. Deeper analysis shows that black will have draw at most.\nWhile at first this move looks like something that removes black rook from the game it also paralyzes white pawn on a7 and bishop on b8. Now the position is reduced to two knights vs rook and we know that two knights are slightly better even in endgame.\nWhile probably still a draw with perfect play now white is the want who must work to make a draw.",
        "48... Nge4 49. h5 Nc5 50. Bg3 Nd3+": "Not the fastest way to win. Rd8 was mate in 9 but now black just promotes the pawn.",
        "51. Kf1 e2+ 52. Kg1 Ne4 53. Bh4 Kg4 54. Re7 f5": "The pawn can not be stopped. Computer says \"mate in 14\".",
        "55. Rxe4+": "Desperation. Now it is mate in 8.",
        "55... fxe4 56. Bf2 e3 57. h6": "Mate in 3. For example: 57. ... ef+ 58 Kh1 Kg3 59. a4 e1=R#\n\nThis game demonstrates the importance of blunders in games between club-level players.\n\nWhile some bad moves show lack of tactical sight other mistakes are more positional and show that players do not understand the spirit of the position. Such positional WTF? moves are 13. ... f6, 15. ... Kf7 by black and 22. Nf8 and 35. h4+ by white. Such moves are something to learn from even if your tactical sight and ability to calculate variation is close to absolute zero."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=32045",
    "gameName": "Let's play chess",
    "players": "albu (1660) vs. mistergo (1711)",
    "opening": "Polish defence (A40)"
}