{
    "moves": {
        "1. e4 e5 2. a3": "not contributing to development or control of the important central squares.",
        "2... Nf6": "attacking e4",
        "3. Nc3": "developing move defending e4",
        "3... Nc6": "following the rule to develop knights before bishops. but I think Bc5 would be fine here preventing d4.",
        "4. g4": "an attack after only one piece developed? hmmm. this really gets white behind.",
        "4... d5": "now the pawn can be taken, or if g5 then Nxe4. white has created weaknesses with the g5 move, so I will try for an open game.",
        "5. h3": "another pawn move to protect the weak g4 pawn. the dark squares are weakining around the king. he needs to play d3 and then Bg4 and Qd2 so he can castle queenside.",
        "5... dxe4": "free lunch! if d3 and Bg5 were played this would not be possible.",
        "6. g5": "the one pawn attack! such a brave little guy! Where are all the troops in the army? sleeping in the barracks?? What kind of army has only one brave soldier?",
        "6... Nd5 7. Nxe4 Bf5": "my troops rush to the frontier line en-mass!!",
        "8. Bg2 Nf4": "this attack is justified! it prevents further development and threatens material gain!",
        "9. Rh2": "like a stack of dominoes, once the first one falls, so go the rest.",
        "9... Nxg2+ 10. Rxg2 Bxe4 11. Rg3 Nd4": "perhaps I should have just continued developing here.",
        "12. d3 Bg6 13. c3 Nc6": "white has only developed the rook, and his pawns are a mess. black is a piece up with two pieces developed and no pawn weeknesses. Remember that each pawn move creates weak squares behind it.",
        "14. b4": "another pawn attack? pawn storms are effective, but perhaps only after development and ensuring king safty by castling.",
        "14... Bd6": "continuing with my development.",
        "15. a4 O-O 16. Ba3 e4": "in order to open up the center and attack the king that is still there.",
        "17. b5 Bxa3 18. Rxa3 Ne5 19. Kf1 exd3": "now I have a passed pawn.",
        "20. Nf3 Qd6": "combining the defence of the knight with an attack on the rook. also this move is developing. the rooks are connected. once the rooks come to the center my development is complete.",
        "21. Nd4": "it is nice to put the knight in the center! but your rook hangs.",
        "21... Qxa3 22. f4 Nc4 23. Kf2 Qxc3": "that passed pawn is looking stronger now.",
        "24. Qf3": "here I could play d2! and if Qxc3 then d1=N! forking queen and king. but perhaps I can get more.",
        "24... Qb2+ 25. Ne2 d2 26. Nc3": "this seems to defend d1, but the pawn promotes with check!",
        "26... d1=Q+ 27. Ne2 Rae8": "adding fuel to the fire",
        "28. Rg4 Rxe2+ 29. Kg3 Qe1+": "keeps the king from retreating to h4.",
        "30. Qf2 Qxf2#": "and ending matter quickly!"
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=2248",
    "gameName": "Let's play chess",
    "players": "beezo (1027) vs. jeffegg2 (1421)",
    "opening": "KP (C20), Mengarini's opening"
}