{
    "moves": {
        "1. e4 c5 2. Nf3 d6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3": "5. Nc3\n\nSince now we have followed the moves of the other annotated game (metalale (1423) vs. warvetchaosone1 (1461)).",
        "5... g6": "5. ...g6\n\nThe Dragon Variation. One of my favorite Sicilian systems.",
        "6. Be3 Bg7 7. f3": "7. f3\n\nPreventing Ng4 and an odd exchange between Knight and Bishop on e3. White wants to eliminate the g7 black Bishop and he needs his dark-square Bishop.",
        "7... O-O 8. Qd2": "8. Qd2\n\nCreating a battery along the c1-h6 diagonal and also freeing the path towards long castle.",
        "8... Nc6 9. Bc4": "9. Bc4\n\nBlocking the d5 option.",
        "9... Bd7 10. O-O-O Rb8": "10. ...Rb8\n\nProbably this is a mistake. Too passive. Black usually fights for the control of the c-file with Rc8 and then Qc7. Rb8 sustains the b-pawn, but I can fight about my plan with tranquillity.",
        "11. Bh6": "11. Bh6\n\nMy plan... exchange dark-square Bishops.",
        "11... Nxd4": "11. ...Nxd4\n\nMaybe played with the intention of 12. Qxd4 then 12. ...Bxh6  and the darksquare black Bishop is still alive.",
        "12. Bxg7": "12. Bxg7\n\nOk, no problem. I've reached my first goal easily.",
        "12... Kxg7 13. Qxd4 b5": "13. ...b5\n\nWhat?! Ok, this move was hidden to me since this moment. Maybe my opponent looked at it since he played 10. ...Rb8. Well done. But I was not afraid.",
        "14. Bb3 Qb6": "14. ...Qb6\n\nLooking for Queens exchange.",
        "15. Qd2": "15. Qd2\n\nNo Queens exchange. Keep my lady on board!",
        "15... Rfc8": "15. ...Rfc8\n\nOther pressure against my castle. ",
        "16. Nd5 Nxd5 17. Qxd5": "17. Qxd5?!\n \nThe change of Knights was forced, I think. My Nd5 was too strong and it was ruining the position of black. But now maybe I should have played 17. Bxd5 cause my Queen will be attack many times... not a good choice.",
        "17... Be6 18. Qg5": "18. Qg5?!\n\nAnother imprecision! Why to wait for 18. Qd2? The threat on e6? My opponent is not blind and with the simple Rc7 it can defend the pawn and prepare the square c8 for the b-Rook.",
        "18... Bxb3": "18. ...Bxb3\n\nThis wouldn't happened if I had played 17. Bxd5. My previous choices are bringing me towards oblivion. ",
        "19. axb3 f6": "19. ...f6\n\nMaybe 19. ...Rc7 would have anticipate the Rook battery.",
        "20. Qd5": "20. Qd5\n\nAgain, 20. Qd2 was more accurate, but now there is no imminent attack against Queen in this central square. The problem is that my c2 pawn will be more weak.",
        "20... a5": "20. ...a5\n\nTrying to march towards the King.",
        "21. Qe6": "21. Qe6?\n\nWhat is this?? Another Queen's move? If you look at my previous 10 moves, you will note that I've moved my lady 6 times!! She's a lady, not Rambo! And again, now her movements are limited to the diagonals. The poor pawn e7 was a goal to avoid!\n\nRemember, don't play like me in this game. Never go for something you will never have.",
        "21... Rc7": "21. ...Rc7\n\nFinally the Rc7 move is played. And for free!",
        "22. g4": "22. g4\n\nWith this move I tried to frighten the black King, but there are no menaces. It also weakens the f-pawn.",
        "22... Rbc8": "22. ...Rbc8\n\nThe battery... I have to defend my c-pawn!",
        "23. c3": "23. c3??\n\nWhat a mistake!! I was thinking about the obvious (and much much better) 23. Rd2. But then I thought that the pawn on c3 could guard the b4 square too... what a stupid thought! The b4 square against the safety of my monarch.\n\n23. Rd2 defends the c2-pawn, leaves the d1 square for the h-Rook and stops the check on e3. ",
        "23... Qf2": "23. ...Qf2\n\n23. ...Qe3  was more forcing.",
        "24. Rd2 Rc7xc3+": "24. Rxc3 !\n\nThe final attack begins...",
        "25. bxc3 Rxc3+ 26. Kd1": "26. Kd1\n\n26. Kb2 can change nothing...",
        "26... Qxf3+ 27. Re2": "27. Re2\n\n27. Ke1 Rc1  28. Rd1 Rxd1#",
        "27... Qxh1+ 28. Kd2": "28. Kd2?\n\nBetter was... resign! :)\n\nIn this way I taken mate in one, the shortest mate. The game was lost, but 28. Re1 Qf3  29. Re2 (29. Kd2 Qd3#) Qf1  30. Re1 (30. Kd2 Qc1#) Qf3#\n\n",
        "28... Qc1#": "What's the worst error? Someone could tell \"Your 23rd move!\". Yes, but the key of all was, in my opinion, 13. Qxd4 and the consequents Queen moves. \n\nSo, the advice is: \"Never overlooked a caught for another one, and don't go for wild attack without any kind of plan! Play solid and safe, think about defense before put your Queen in danger.\"\n\nSee you next time! "
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=19800",
    "gameName": "Let's play chess",
    "players": "metalale (1408) vs. eremituz (1538)",
    "opening": "Sicilian (B78), dragon, Yugoslav attack, 10.O-O-O"
}