{
    "moves": {
        "1. e4": "This is a very strong move. This frees the pieces off of the back rank and controls the center. This is also one of my favorite moves to play.",
        "1... e5": "This move is just as strong. This move does the same motives as my move, but also opposes my center control. Statistically, many games with these moves are drawn, but with my motive of \"play to win\", I went for an aggressive opening.",
        "2. Bc4": "This is with the intention of the Vienna game. This attacks f7 and controls the center. The theory also calls for f4 to be played later to dominate the center.",
        "2... Qf6": "I have seen this before, but I saw no apparent use of it. This also violates the strategical rule of \"Don't bring your queen out too early.\"",
        "3. Nc3": "Since f4 will be hard to push at this rate, I decided to take advantage of my situation by controlling the center even more, with the intention of making my knights and pawns to occupy the center.",
        "3... Qg6": "This was probably played to fight the g2 pawn.",
        "4. Qf3": "This is not something I usually play or see. In fact, I would have thought for 30 minutes in a tournament room trying to find the best move (which could be what I just played). I did not have much time on my hands here, so I just played this to protect the g2 pawn and protect the e4 pawn in case Nf6 was next.",
        "4... Nf6": "Fortunately that did happen next and I could continue developing.",
        "5. d3": "Perhaps this was not the best course of action. I have now overprotected my pawn and my knight would go really nice where my queen is now.",
        "5... Bb4": "In an attempt to pin the knight and king, my plan is ruined to do the futile Nb5 to win a rook or at least a pawn.",
        "6. Bd2": "I still want to play Nb5. I do not care whether my king is exposed or not because the position was already closed by d3.",
        "6... d6": "I was worried about Bg4 and later h5 and a king side attack. I could easily defend, but I felt like I could start my own instead of letting him start his.",
        "7. h3": "This also gears up for g4 if I can get any more protection.",
        "7... O-O": "This castles into a bishop pin.",
        "8. Nb5": "I try to go for my Nb5 now. I just wanted to trade my bad bishop off at this point and later go for Na3, c3, Nc2, d4.",
        "8... a6": "Attacking the knight, but I win a pawn.",
        "9. Nxc7": "This also attacks the rook.",
        "9... Ra7": "The intermediate move of Bxd2+ could have been played, but now the opponent lost a bishop as well.",
        "10. Bxb4": "I win a bishop and I still have my bishop pair while opening the position.",
        "10... Rd8": "To protect the pawn.",
        "11. Nd5": "I want to trade knights off. \"Always trade when you are winning, even if your position will get messed up a little bit.\"",
        "11... a5": "To get the bishop out of b4? Maybe?",
        "12. Ne7+": "I win the queen. I might as well win more material rather than trade off.",
        "12... Kf8": "This gets into another pin with the bishop on b4.",
        "13. Nxg6+": "I win an exchange.",
        "13... hxg6": "Taking with f6 will get him pinned by the queen.",
        "14. Ba3": "I want my pin. I also want to keep the bishop pair close together.",
        "14... Be6": "In an attempt to free some pieces I guess. Either way, we both know the game will be finished soon.",
        "15. Bxe6": "I trade following the aforementioned rule.",
        "15... fxe6": "Nothing more to take back with. I also get another pin with the queen.",
        "16. g4": "The h3 was useful then, but g4 is useful now. This threatens to win the knight.",
        "16... Rc8": "To win a pawn. There is nothing more than something desperate.",
        "17. g5": "I want the knight and get my queen into his territory to get a checkmate.",
        "17... Rxc2": "The game is over. There is nothing more to do but wait and watch my pieces take over.",
        "18. gxf6": "I win a knight.",
        "18... b5": "My opponent wants to win my bishop.",
        "19. fxg7+": "My intermediate double check.",
        "19... Kxg7": "This is the only move that does not let the pawn promote and does not get him checkmated.",
        "20. Bxd6": "I win a pawn and threaten more captures.",
        "20... Nc6": "Wanting to get a breakthrough of Nd4.",
        "21. Qf8+": "I close in on the king.",
        "21... Kh7": "The only playable move.",
        "22. Nf3": "Since I cant take the e5 pawn and checkmate, I go for another checkmate.",
        "22... Nd4": "There were more moves to procrastinate the game...",
        "23. Ng5#": "And that's game. In this game, you have seen a closed game turn into an open game. You also saw that a little plan and a little slip made the game turn into this. You also have seen the importance of bishops in an open game, knights in a closed game, and the interdependency of pieces to get the enemy king."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=32106",
    "gameName": "Let's play chess",
    "players": "sparkery (1208) vs. albannaich (1108)",
    "opening": "Bishop's opening (C23)"
}