{
    "moves": {
        "1. d4": "For an attacking player, this move is somewhat of a contradiction. 1. e4 is the preferred move .",
        "1... Nf6 2. f4": "True to his name. Very early, White is already revealing his intentions. A very aggressive move.",
        "2... g6 3. Nd2": "This move serves two purposes: a.) to support the advance of the e-pawn to e4 and b.) to make possible the move c4, which on 3. Nc3 the knight is blocking the path of the c-pawn.",
        "3... Bg7": "Black didn't bother to prevent the eventual advance 4. e4 with 3. ...d5. ",
        "4. e4": "Finally. The position has reached the kind of a King's Indian setup that offers good attacking possibilities for both sides. At this point, White has achieved a very menacing position due to his undisputed control of the center.",
        "4... O-O": "Black quitely continues with his development unmindful of White's dominating center.",
        "5. Bd3": "A very aggressive move and starting to exert his influence on the king's position.",
        "5... d6 6. f5": "Whooo. This is a big no no in the opening. Even though 6. f5 looks good, White hasn't completed his development yet. 6. Ngf3 followed by 7. O-O is the preferred alternative.",
        "6... c5": "Black counters by threatening to open up the position, thereby, leaving the White's king exposed in the center.",
        "7. c3 cxd4": "Black stayed on with the plan and begins to trade pawns in order to open the position.",
        "8. fxg6": "Again, a very aggressive move aimed at weakening the black king's position.",
        "8... hxg6 9. cxd4": "Examining the position at this point, it seems White has maintained his hold of the central squares while Black has somewhat realized his plan because the White king now is a little bit exposed.",
        "9... Nc6": "Continuing with his own development and exerting pressure on the central squares especially the pawn at d4.",
        "10. d5": "This is the start of his downful. By neglecting his development, White allowed the Black's forces to build up and exert pressure on his position.",
        "10... Ne5 11. Be2": "White has lost two moves with 10. d5 and 11. Be2. ",
        "11... Bg4": "Black made this move in the hope that if White exchanged Bishops with 12. Bxg4, he would weakened the white squares on White's position.",
        "12. Ngf3": "Preparing to castle kingside with 13. O-O thereby bringing the King to safety.",
        "12... Nfd7": "Black is slowly gaining control of the dark squares. Notice the position of the bishop on c1 that made the whole thing possible.",
        "13. O-O": "It seems White has already solved his main problem which is to bring his King to safety.",
        "13... Qb6+": "And now, it is Black who suddenly becomes aggressive due to the fact that his pieces are better placed than the White's counterparts. Notice his total control of the dark squares at the moment.",
        "14. Kh1 Bxf3": "If White replies with 15. Nxf3, Black would intend to play 15 ...Nxf3, 16. Bxf3 and the bishop would be bad because it is of the same white square as the central pawns.",
        "15. Bxf3": "This must be a bad move since it allows Black to proceed with his development uncontested.",
        "15... Rac8": "Taking control of the open file and bringing the rook to life. Black must be winning at this point.",
        "16. Qe2": "I don't understand why White insists of putting his knight on d2 which is obstructing the other bishop.",
        "16... Rc2": "Black has complete control of the position and it will be only a matter of time before White makes a decisive mistake.",
        "17. Rb1": "White's choices is very limited. ",
        "17... Rfc8": "Putting another dagger into White's position.",
        "18. a3": "White's last two moves were very passive indicating that he's waiting for Black to execute a decisive plan.",
        "18... Nc5": "Now, Black owns the d3 square.",
        "19. Bg4": "Threatening to capture the rook on c8.",
        "19... Rc7": "Black could have won the bishop on c1 with 19. ...Nxg4, 20. Qxg4 Nd3! followed by 21. ...Nxc1. But on the other hand, White has a very good move with 21. Qf3. And if Black takes the bishop with 21. ...Nxc1, White would reply with 22. Qxf7+ attacking the Black King.",
        "20. Nc4": "He should have done this a long time ago. It's too late now and White would lose the knight for nothing.",
        "20... Rxc4 21. Be3": "Finally, the Bishop breaks free for the cost of a whole piece. The remaining moves would need no more comments since Black is clearly winning.",
        "21... Qb3 22. Bxc5 Rc4xc5 23. h3 Rc5c2 24. Qe1 Rxb2 25. Rxb2 Qxb2 26. Qa5 Rc1 27. Qd8+ Kh7 28. Rxc1 Qxc1+ 29. Kh2 Nxg4+ 30. hxg4 Be5+ 31. g3 Qd2+ 32. Kh3 Qe3 33. Kg2 Bxg3 34. Kh3 Bf4+ 35. Kg2 Qe2+ 36. Kh1 Qh2#": ""
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=34289",
    "gameName": "Let's play chess",
    "players": "attack13 (1589) vs. matefork (1677)",
    "opening": "Canard opening (A45)"
}