{
    "moves": {
        "1. e4": "I managed to equalize the game right from the opening and in the middle game I was able to get a decisive positional advantage that would soon convert in to a promoted pawn... white in his effort to avoid this ended in a mate net!",
        "1... e5 2. Nf3 Nc6 3. Bb5 Nf6 4. O-O Nxe4": "Ruy Lopez (C67), open Berlin defence",
        "5. d4 Nd6 6. Bxc6 dxc6 7. dxe5 Nf5 8. Qxd8+ Kxd8 9. Nc3 Ke8 10. Rd1 h6": "let's try a transposition to the 9th game of the match between Kasparov and Kramnik, London 2000, let's see what white has prepared for us... I'll add some comments by Karsten Muler (KM), to my own comments about this game",
        "11. h3 a5": "preparing counter-play on the a column",
        "12. Bf4": "KM quotes here: 12.b3 Bb4 13.Bb2 Bxc3 14.Bxc3 c5 15.Rd2 b6 16.Rad1 Be6 17.a4 Ne7 18.Ne1 g5 19.f3 Nc6 20.Kf2 Ke7 21.Bb2 Rhd8 22.c4 Rxd2+ 23.Rxd2 Bf5\n0–1, Fritz5-Anand,V Frankfurt 1998\n",
        "12... Be6": "blocking the e pawn",
        "13. g4": "white goes after the knight, and my king side is a bit restricted, hence the need to have counter-play on the other wing, eventually playing g5 and activating the h8 rook and black can hold the position...\n\nKM: This time Kasparov takes energetic steps against the blockade on e6 and f5,\nwhich led to a draw in the first game.\n",
        "13... Ne7": "Ne7-d5, and black still has some problems to solve but should be fine",
        "14. Nd4 Nd5": "blocking the open d column",
        "15. Nxe6": "no the best option, in fact white exchanges my best bishop, but also by his best knight, so things are even there, but my e6 pawn will block white's e5 pawn severely restricting his remaining dark squared bishop, white derived from Kasparov-Kramnik",
        "15... fxe6 16. Ne2 g5": "with tempo now white has to remove the bishop from f4 and doesn't have the possibility of Ng4",
        "17. Bh2": "previously Bg3 was played in a drawn game Kindermann Stefan (AUT) - Lalic Bogdan (ENG), Portoroz (Slovenia), 1998 ",
        "17... a4": "freeing a5 for my rook, and preventing a4, now if white advances his a pawn it has to be placed on a dark square adding restriction to his bishop action",
        "18. a3": "and he does move a3",
        "18... Kf7": "I need to get my king closer to the king's wing my weakest spot",
        "19. c4": "just a little bit annoying nothing further",
        "19... Nb6": "forcing the defence or advance of the c pawn",
        "20. Rac1": "so defence it is",
        "20... Bc5 21. Ng3": "Ng3-e4 is maybe white's idea",
        "21... Rhd8": "offering the exchange of one rook with the possibility of Bd4 or Nxc4...",
        "22. Ne4 Rxd1+ 23. Rxd1 Be7": "preparing Nxc4",
        "24. c5": "? allows me to block the d column again and on occasion more permanently than before...",
        "24... Nd5": "again Nd5 block the open diagonal and now it's even harder to remove from d5, as white doesn't have the c pawn as a threat to it ",
        "25. Rd3 Ra5": "now the c pawn is doomed...",
        "26. Rd4": "to get the a pawn, but I've rather prefer the c pawn over my a pawn any day",
        "26... Bxc5 27. Nxc5 Rxc5 28. Rxa4": "a forced sequence",
        "28... Rc1+": "now after Kg2 b6 to prevent Ra5 and have both the b6 and c7 pawns are restricting white's bishop",
        "29. Kg2 b6 30. Kf3 Rc2": "I've considered also the immediate c5",
        "31. b4 c5 32. bxc5 Rxc5": "retaining the connected pawns",
        "33. Kg2": "I really don't see the point of this move by white... he needed more a active move threatening something",
        "33... Rc3": "threatening both white's weak rook pawns, I've also considered Ra5 to force the exchange of rooks and the resulting simplification, but I disliked white's counter play on the opposed wing forcing my king to be fixed to it's defence after which the bishop greater mobility compared to that of my knight might became a decisive favouring factor for white",
        "34. Ra7 Kg6": "I needed to remove my king from the 2nd rank in order to be able to advance the c pawn, at the same time this move allowed me a better defence of the king's wing",
        "35. f3": "my first thought was Nf4+ with the idea of Kg3 to defend h3 then Ne2+ with the idea of Nd4 aimed at f3, but then I realised white had the simple Bxf4 and after the forced gxf4 I might have had lost any chances with a rook endgame with only one extra pawn...",
        "35... c5": "... so I proceeded with my plan to play c5",
        "36. Bg3 Rb3": "defends the b pawn and gets out of the way of the more advanced c pawn",
        "37. h4 h5": "I'll end any counter play white might have here on the king's wing, forcing some pawn exchanges",
        "38. gxh5+ Kxh5 39. hxg5 c4 40. f4 c3": "now white needs Be1",
        "41. Rh7+": "? does he intended to play Rh6+ after Kg6 or Rh4+ after my Kg4... totally hopeless moves just wasting time!",
        "41... Kg6": "now white will lose his rook, Rh1 forced then I have c2 forcing white's reply Rc1 to which I'll answer with Rb1! then Rxc2 forced and Ne3+ with a double attack on king and rook wins the rook... the resulting technical endgame will pose no difficulties for black to win",
        "42. Rh6+": "?",
        "42... Kf5": "and now I'm safe Rf6+ meets Nxf6 losing the rook and the game and I have the powerful threat Ne3+ followed by Ng4",
        "43. g6": "oblivious to Ne3+ white keeps pushing his pawn",
        "43... c2": "let's lure him to play g7",
        "44. g7": "?? Now I have a nice move Ne3+ and all white king moves are losing, either allowing a promotion with check any move to the first rank (Kg1, Kh1); or allowing check with my next knight move Ng4+ (Kf2, Kh2, Kf3-discovered check) allowing then Nxh6 preventing white's promotion; or even the more resistant Kh3 after which both black and white may promote, but white's king position is inferior and is easily mated with Qh1+ Bh2 only Nf1+ Qg3 Qxh2++",
        "44... Ne3+": "now all ends, white doesn't have any good move, he his lost",
        "45. Kh3 c1=Q": ""
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=42281",
    "gameName": "Let's play chess",
    "players": "knight55 (1879) vs. kaspanatola (1974)",
    "opening": "Ruy Lopez (C67), open Berlin defence, l'Hermet variation"
}