{
    "moves": {
        "1. c4 e5 2. g3 Nf6 3. Bg2 Nc6 4. Nc3": "English Opening Carls' Bremen variation.  This is an opening I first saw played by gameknot player jekopiano.  He played it exclusively and did well.  I didn't know much about openings and thought this looked like a good alternative to e4 and d4.  A year or two later, ran into bigpeta who is also a fan of this opening. [I mention this because this annotation was first posted in the BigPeta Students club forum]",
        "4... Bb4": "since the knight is not pinned, rather than risk doubled pawns...",
        "5. Nd5": "5. Nd5, attacking black's bishop.  ",
        "5... O-O": "somewhat surprsingly, black castles.",
        "6. Nxb4": "6. NxB.  Even though I will lose the knight, it is probably not bad to have removed one of black's bishops.",
        "6... Nxb4 7. a3": "7. a3 kicks out the knight and puts potentially long-term protection on b4.  a small achievement for me this game is that I didn't over-play the a and b pawns.  they will not move for the rest of the game.",
        "7... Nc6 8. d3 d5": "black decides to open things up early?",
        "9. cxd5": "ok, fine.",
        "9... Nxd5 10. Nf3": "both sides have about equal influence on the center and are developing at about the same rate.",
        "10... a5": "10. ...a5.  nothing ever comes of this and I don't react to it (well I did worry about it a little).  if anything, it helps me such as when my queen goes to b6 during the final moves of the game. ",
        "11. O-O Nd4": "I suppose with this move black intends to set sup some advanced pawns in the center.",
        "12. e3": "I don't bite.",
        "12... Nxf3+": "only move 12 and half the minor pieces about to be off the board.  not my idea.",
        "13. Bxf3": "A bit of a defensive position for white, but reasonably strong.",
        "13... c6": "black sets up a strong side as well (though again note b6 is now easy to occupy, ...not that b3 is any stronger).",
        "14. e4": "giving some options to my dsb while marginalizing my lsb.  pushes knight back.",
        "14... Nc7 15. Be3 Nb5": "black brings his knight back to where it may be able to cause trouble.",
        "16. Rc1": "white takes ownership of a good portion of the c-file.",
        "16... Nd4": "I usually don't put up with a knight on my side of the board, especially not when that knight may soon have friends.  but I tolerate it this game rather than exchange away my better bishop with BxN.",
        "17. Bg2": "I'll keep this one, too.",
        "17... Be6": "black is starting to look very strong on the queenside.  I check again to be sure I can withstand the N and B coming forward...",
        "18. f4": " and decide to open up the other side of the board a bit.  Did not really want to do this as it makes my king less safe.  but I was feeling constricted and something had to give.  perhaps I will double my rooks on the f-file to some good end.",
        "18... Bb3": "reasonable for black to see what may come of massing his pieces on my side.",
        "19. Qd2": "still safe despite there being some heat.  d pawn looking a bit weak.  ",
        "19... f6": "now here the board is set for some action.  notice that both kings can be checked, the black king from b3 or c4, the white king from d4 etc.  as it turns out, the one move needed to get out of check will be key to the outcome of the game.  maybe my 18. f4 wasn't too bad after all.",
        "20. Rf2": "back to the idea of rooks stacked on the f file? maybe.  but I'm not selling off the c-file just yet.  ",
        "20... Qd6": "not sure about this.  extra piece attacking f4? support of c5?",
        "21. Kh1": "eliminates the possibility of being halted by a check at d4.  note that black's king is still open to being checked.",
        "21... c5": "appears to solidify black's knight and pawn structure.  but this may be an opportunity for white.  so, rather than swing the lower rook to f...",
        "22. Qc3": "22. Qc3. This puts two attackers on c5.  It also attacks the black bishop which is defended by only the knight, which in turn can be taken out by my bishop. ",
        "22... Rfc8": "black probably should have moved his bishop here, risking the loss of the pawn on c5.  But I think black, who was playing about 20 games - and quickly -  miscalculated, thinking perhaps he could capture my rook on f2 and that his rooks protect each other more than they actually do.  one way things could play out is: \n22. Qc3\tRfc8\n23. Bxd4\tQxd4\n24. Qxb3+\tc4\n25. Rxc4\tQxf2\n26. Rxc8#. Even if a more simple scenario plays out, if I capture on b3 with check, my rook is safe for a move.",
        "23. Bxd4": "23. BxN leaves black's bishop unprotected and three pieces attacking c5.",
        "23... Qxd4": "23. ...Qxd4",
        "24. Qxb3+": "24. QxN+ and I am up a minor piece, the check protecting my otherwise unguarded rook.",
        "24... Kh8": "24. ...Kh8",
        "25. Rfc2": "the c neighborhood looks better than the f.",
        "25... Rab8": "25. ...Rab8",
        "26. Qb6": "26. Qb6 put 3 attackers back on c5 and holds back the b pawn.",
        "26... Qxd3": "26. ...Qxd3.  ties my bishop to shielding the king but, as shall be seen, puts the black Q on the wrong side of d5. [was expecting 26. ...Rc6 here.  I had not intentionally left d3 as a poisoned pawn]",
        "27. Rc2xc5": "27. RxP",
        "27... Rcd8": "some danger for both sides here.",
        "28. Qc7": "close combat. lack of a flight square and his queen being ahead of his rook leads black to play...",
        "28... h6": "28. h6, but...",
        "29. Rd5": "29. Rd5 attacks the queen which can not make itself safe AND add protection to d8 (and RxR loses a rook).  black resigns.  Thank you to jbl_iii for a good game."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=49704",
    "gameName": "Let's play chess",
    "players": "hogfysshe (1810) vs. jbl_iii (1820)",
    "opening": "English opening (A20)"
}