{
    "moves": {
        "1. d4 d5": "Här tänkte jag mig en klassisk Queen's gambit och var inställd på att möta 2 c4.",
        "2. e3": "Queen's pawn (D00), stonewall attack, istället för Queen's gambit. Helt ny variant för mig, så jag fick tänka själv tidigt i detta parti.",
        "2... e6": "Bygger upp bondekedjan samtidigt som jag försvarar d-bonden. Vanligaste svaret på stonewall attacken är dock 2...Nf6, tätt följt av 2...Bf5 vars statistik är till svarts fördel.",
        "3. Bd3": "Vit bryter mot grundregeln att S skall mobiliseras före L, men enligt statistiken är 3.Bd3 till vits fördel i denna variation. Vanligaste draget är dock 3.Nf3.",
        "3... Nf6": "Här går jag spontant ut med kungsspringaren för att utveckla pjäserna normalt. Det visade sig vara det vanligaste svaret i denna variation, och statistiskt är 3...Nf6 till vits fördel.",
        "4. Bd2": "Här avviker vit från stonewall attacken, där 4.Nf3 är det vanligaste svaret i denna variation.",
        "4... Nc6": "Här transponerar proffsen till 4...c5 och får ett siciliansktliknande parti, men jag valde den säkra vägen och utvecklade ännu en springare.",
        "5. Nf3": "Vit gör det mest lämpliga draget, och får ut lite mer pjäser. ",
        "5... Nb4": "Här hade 5...Bd6 varit det lugnaste och mest långsiktiga draget, men jag kände för att spela offensivt och utväxla vits L.",
        "6. Bxb4": "Som väntat.",
        "6... Bxb4+": "Här bestämmer jag mig för att öppna upp spelet och gynna mina två L framför vits två S.",
        "7. c3": "En naturlig parering, även om 7.Nbd2 hade varit mer gynnsam för vits position. Nu får dock vit en stark bondestruktur.",
        "7... Bd6": "Retirerar till bästa möjliga position för L och behåller kontrollen över diagonalerna.",
        "8. c4": "Vit hoppas på att jag skall slå dxc4 för att därigenom kunna dominera centern bättre, och så här tidigt i ett parti hade jag nog inte förlorat så mycket på att ta c4-bonden.",
        "8... Ne4": "Men jag vill centralisera min S och utnyttja utposten, vilket hade straffat mig om vit spelat 9. c5. Då hade vit fått övertaget, så nästa gång dår jag tänka på den här positionen. Säkrast är att slå 8...dxc4 !",
        "9. cxd5": "Vit spelar enligt mina dåvarande kalkyler och ger mig kontroll över centern när jag slår d-bonden.",
        "9... exd5": "Nu har jag godkänd kontroll över min centerdel och jag öppnar även upp för min ljusa L.",
        "10. Bxe4": "Här släpper vit kontrollen över sin centerdel och tillåter mig att ta befälet över hans mittregion.",
        "10... dxe4": "I det här läget har fördelen svängt över till mig, och vit har inga svar som kan vända partit i hans riktning.",
        "11. Nfd2": "Den minst dåliga pareringen vit kan göra, men jag leder med -0,49.",
        "11... Bf5": "Här tycker experten att jag skulle gått ut med Qg5 och ta initiativ, men jag ville fortsätta utvecklingen av pjäserna i lugnare tempo. Kontrollen över 5:e raden med Q hade nog varit strategiskt bra, och jag hade även kunnat sabba vits rockad med Qxg2.",
        "12. Nc3": "Vits bästa svar, och han är snart klar med utvecklingen av sina pjäser.",
        "12... c6": "Här hade jag en tanke att blockera b5 för vits S, men förbisåg att min bonde på e4 endast är försvarad av min L; medan vit hotar med bägge sina S att ta sig fram den vägen. Experten anser därför att jag borde försvarat e4 med 12...Qe7.\n\nExperten ser detta drag som ett misstag och ger vit +0,53.",
        "13. Ncxe4": "Vit utnyttjar mycket riktigt svagheten på e4, och nu har vit övertaget i partit.",
        "13... Bb4": "Ett tappert försök att undvika utväxling av min L, eftersom jag planerat ett slutspel med löparna som huvudaktörer.",
        "14. Qf3": "Vit tar kommandot över Kungssidan, och experten anser att jag borde rädda min L genom att retirera med Be6; men jag väljet att försvara den  (och positionen) istället.",
        "14... Qd7": "Här väntar jag mig rockad på Kungssidan, och jag är beredd att göra detsamma snart.",
        "15. O-O-O": "Vit gör en skum Damsidesrockad, och den ser inte ut att vara till vits fördel. Nu står hans Kung svagt placerad längs c-filen, och det ska vi utnyttja ;-)",
        "15... O-O": "Experten tycker att jag skulle varit mer offensiv och spelat Bg4, men jag ansåg rockaden lämplig just nu; och jag vill få fart på mina torn.",
        "16. Nc4": "Här släpper vit det dubbla försvaret av e4, och svart skulle lätt kunna utnyttja övertaget genom 16...Qe6; attackerandes bägge springarna samtidigt. Datorn bedömer det som ett grovt misstag av vit och ställningen är -1,72.",
        "16... Bxe4": "Här har jag för bråttom, och missar att utnyttja positionen till min fördel. Men jag är inställd på att få igång mina torn, och det får jag genom den kommande utväxlingen. Enligt datoranalysen var det här mitt främsta misstag, men positionen står endast i +0,46.\n\nBättre hade varit 16...Qe6 !",
        "17. Qxe4": "Självklart, och jag får snart ut mina torn.",
        "17... Rfe8": "Få fördelar egentligen med denna attack, förutom att jag mobiliserar mitt torn på en halvöppen fil. Experten håller med om att det ändå är mitt bästa drag i det här läget. +0,36",
        "18. Qf4": "Vit siktar in sig mot min svaga f7-bonde, och hans S ser ut att vara sugen på att gå till e5 för att skrämma min D.",
        "18... f6": "Bevakar e5 från ev trix från vits S, och ger samtidigt min D lite mer rörlighet.",
        "19. a3": "Vit jagar iväg min L.",
        "19... Bf8": "Den bästa rutan att fly till, så att jag inte blockerar min D och mitt T. ",
        "20. e4": "Vit är på offensiven och har ett lätt övertag, men jag ser en svag S som kan angripas.",
        "20... b5": "Skjuter även fram min position och skapar mer rörlighet.",
        "21. Ne3": "Vits position är försvagad och jag kan börja ta initiativ igen.",
        "21... Bd6": "Aktiverar min L med en attack och erövrar mer mark.",
        "22. Qg4": "Vit bestämmer sig för att utväxla damer, och det stärker min position ytterligare. Experten bedömer det som ett grovt misstag av vit och ger svart -1,17. Bättre hade varit om vit parerat med 22.Qf3",
        "22... Qxg4 23. Nxg4 Rxe4": "Tveklöst det bästa draget i det här läget, och min position är rejält stärkt. Nu kan jag snart aktivera mitt andra torn och börja angripa vits Kung.",
        "24. f3": "Bättre hade varit om vit parerat med 24. Ne3, så hade han även blockerat mitt torns framfart längs e-filen.",
        "24... Re2": "Självklart, och nu plötsligt har jag såväl initiativet och det positionella övertaget.",
        "25. d5": "Vit hoppas på en utväxling av bönder så att han också skall få upp sitt torn. Det blir inget med den saken !",
        "25... c5": "En snygg bypass till c5, och vits bonde på d4 ser plötsligt meningslöst placerad ut. Skall han kunna promovera den framöver, och lär han hinna det innan jag börjar väva mitt mattnät ? - Knappast !",
        "26. Rhe1": "Vit hotar ånyo att komma upp med sin torn, men jag behåller isen i magen och undviker ett överlämnande av e-filen.",
        "26... Rae8": "Vill han utväxla torn, så får det ske på e2.",
        "27. Ref1": "En skum reaktion av vit, och föga produktiv. En utväxling av torn hade varit bättre för hans del,men jag tackar och tar emot.",
        "27... Rxg2": "Upprensning av kanonmaten.",
        "28. Rfe1": "Vit förlorar mer och mer tempo, och det är dags att förflytta striden till vits planhalva.",
        "28... Ree2": "Det starkaste draget, och även om vit utväxlar torn så behåller jag kontrollen över 7:e raden.",
        "29. Ne3": "Vit släpper försvaret av h2-bonden. Datorn bedömer det som ett grovt misstag av vit och analyspoängen ger -6,21. Ett enormt övertag för svart.",
        "29... Rgxh2": "Väck med den. Fast datorn ger mig en stor poängförlust för denna girighet, och nu står det -2,81. Ett rejält övertag ändå, så det får vara godkänt.",
        "30. Nf5": "Vit hoppas förgäves på att han skall kunna förhindra min L från att gå in i striden. Datorn ser en matt i 8 drag enligt: 30... Bf4+ 31.Rd2 Rxe1+ 32.Kc2 Rxd2+ 33.Kc3 Rc1+ 34.Kb3 Be5 35.Ne7+ Kf7 36.a4 Rxb2+ 37.Ka3 b4# 0-1",
        "30... Bf4+": "Slutstriden tar fart, och det här var precis rätt läge att ge den efterlängate schacken med löparen. Vits undergång är snar.\n",
        "31. Kb1": "Vits enda flyktruta. Han går in i en matt på 3 drag, där en parering med Rd2 hade förlängt plågan lite till.",
        "31... Rexb2+": "Nu är det matt i två drag.",
        "32. Ka1 Rba2+ 33. Kb1 Rhb2#": "Där satt den. En skön seger seger efter en ganska jämn kamp."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=42689",
    "gameName": "Let's play chess",
    "players": "tex6 (1259) vs. highlandt (1200)",
    "opening": "Queen's pawn (D00), stonewall attack"
}