{
    "moves": {
        "1. e4": "Hi, everyone...\nThis is a nice game I played.",
        "1... e5 2. Nf3": "Typical King's knight opening, you can see.",
        "2... d6 3. Bc4 h6 4. d4 exd4 5. Nxd4 Be7 6. Nc3 c6 7. O-O Nf6 8. h3 O-O 9. Qf3 Nxe4": "Now he got a pawn up offering the Knight and I have only the Queen to grab it. But if I do so, he will push the d pawn then a fork, I have pull back the Queen and he will take the Bishop and he will depend the pawn. So, I took the f pawn. ",
        "10. Bxf7+ Rxf7 11. Qxe4 Bf6 12. Be3 d5 13. Qd3 Bxd4 14. Bxd4 Bf5 15. Qd2 Nd7 16. b4 a5 17. a3 axb4 18. axb4 Rxa1": "Game got progressed smoothly and it is the time of exchange of Rooks. ",
        "19. Rxa1 Nf8 20. Ne2 Qd6 21. c3 Ne6 22. Qe3 Nxd4 23. Nxd4 Bg6 24. Nb3 Re7 25. Qd4 Re4 26. Qd2 Qf6 27. Nc5": "Now the end is coming. I attacked the Rook with my Knight. Simply, he has to move the Rook to a better place.",
        "27... Rxb4": "He moved Rook to the square b4 taking again a pawn , hoping that the Rook get cut with the pawn at c3 then he could take the Rook at a1 and also giving a check. But there is a big hole, did you observe it ? Certainly, my opponent missed it. ",
        "28. Ra8+ Kh7 29. cxb4": "I got a Rook up for a pawn.",
        "29... b5": "Again, making a mistake. Leaving the Queen in a wrong square. See, what I mean..",
        "30. Nd7": "Knight is coming and giving troubles not also to the Queen but also the King and the Bishop. ",
        "30... Qf5 31. Nf8+": "No matter where Queen got moved, Knight would be the hero for the moment with the support of the Rook.",
        "31... Kg8 32. Nxg6+ Kf7 33. Rf8+ Kxg6 34. Rxf5": "In the process Knight and Rook worked together and get rid of the black pieces. King can take the Rook, sure. After that what would be the future plans of my opponent. Of course you can guess, resigning, exactly that what he did.\nI thank him for playing and you can see how the game dramatically changed. Thanks for viewing my annotation.  "
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=42296",
    "gameName": "Let's play chess",
    "players": "kapila (1520) vs. surfingscotty (1489)",
    "opening": "Philidor (C41), Steinitz variation"
}