{
    "moves": {
        "1. e4": "hello everyone, today I will annotate I game I just finished against a lower rated player. Unfortunately for me, I challenged this player when I was still 1200, but the game was finished when I was 1700, so I lost rating points for winning. However, I will try to illustrate some points about my opponent's play: HE played pretty well for a 1200.\n\nSo, my opponent plays e4. Here, I was going to try and play an open sicilian. I would not do this against a more experienced player, because I play open sicilians badly(theory, theory, theory) and prefer closed or alapin variations.",
        "1... c5": "the sicilian defence",
        "2. Nf3": "now we can go into an open sicilian",
        "2... Nc6": "I will play the accelerated dragon.",
        "3. Nc3": "I don't know this variation, if it is one, but I'll just stick to the accellerated setup.",
        "3... g6 4. a3": "This is a waste of time. Instead, white should try developing faster/",
        "4... Bg7 5. Bc4": "My opponent probobly doesn't know this line, and he's just sticking to principles:develop",
        "5... d6": "the dragon setup",
        "6. d3 Nf6 7. O-O": "just developing",
        "7... a6 8. Bg5 Bg4 9. Qd2": "Well, now I chose to ruin his pawn structure, but give him an open g file.  I played this mainly becuase I see a  follow up on move 10, which allows me, I think to improve my position.",
        "9... Bxf3 10. gxf3 Nd4": "this move strikes at the f3 pawn, and my N is well placed. If Kg2, then the rook will be hard to activate on the g file.",
        "11. Qf4": "he leaves his c pawn undefended, but I don't have to chop it immediately.",
        "11... b5": "Here, I thought at the time,  Bb3 was correct, averting material loss. My analysis may be correct or not, but my opponent played a move that allowed me to win material",
        "12. Bxf6 Bxf6 13. Bd5": "this strikes at my rook, but I can counterattack",
        "13... b4": "this was the key move I calculated, winning 2 pieces for a rook",
        "14. Bxa8 Qxa8": "now  his N on c3 is attacked. Why not move it? 15.Nd5? Ne2+. You can calculate the rest. ",
        "15. axb4": "he opens the a file, and my a pawn is weak. ",
        "15... cxb4": "His knight is, in a way, pinned, because it can't move without dropping the queen.",
        "16. Qg4": "I also had to make sure he couldn't play Rxa6 or something, then checkmating me. However, my queen can multitask without being overloaded.",
        "16... bxc3 17. bxc3 Ne2+": "now I get a strong place for my knight.",
        "18. Kg2 Nxc3": "I am clearly better, and this is enough to win.",
        "19. Ra3 Nb5": "I need to prepare Nc7, even though it is passive, I need protection of the a pawn to keep the a file closed to castle",
        "20. Ra5 O-O 21. c4 Nc7": "now that my weaknesses are covered, I can drive his pieces back, improve my own pieces, and attack with my extra force.",
        "22. Rb1 Rb8 23. Rxb8+ Qxb8 24. Qd7 Ne6": "no weaknesses.",
        "25. Rxa6 Qb3": "while material lis equal for now, it won't be for long.",
        "26. Ra8+ Kg7 27. Qe8": "My king is in minimal danger",
        "27... Qxd3": "White's king is actually in mmore danger",
        "28. Qg8+ Kh6 29. Ra4 Nd4 30. Ra2": "a mistake, now he will be in big trouble.",
        "30... Qxf3+ 31. Kf1": "A fine move, as he was going to suffer a very long and agonizing loss. Better get it over quickly.",
        "31... Qh1#": "mate."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=32865",
    "gameName": "Let's play chess",
    "players": "mk09 (1243) vs. chessboard12 (1716)",
    "opening": "Sicilian defence (B30)"
}