{
    "moves": {
        "1. e4 g6 2. Nf3 d6 3. d4 Nf6": "If you're wondering about the opening, it's a kind of self-styled Robatsch defense I've been working on, with delayed fianchetto",
        "4. Nc3 Bg4 5. Be2 Bg7 6. O-O Nc6 7. Be3 O-O": "Normal development, white has a strong centre, black will be looking for opportunities to get his knights in...",
        "8. Qc1": "Thematic move against fianchettoed B, met with...",
        "8... Re8 9. Bh6 Bh8": "And corncutter goes to an out-of-the-way but powerful corner-square position. White's B admittedly scary and Black's K can't move now, but the bet is that that nasty chap will end up being more mouth than trousers and eventually have to retreat (let's hope)...",
        "10. Qg5": "Here's trouble, big time - she's not here to do the ironing...",
        "10... Bxf3": "I work to reduce White's effective foreces in the area...",
        "11. Bxf3 Nxd4": "First hints of counter-attack: that's the good guys a pawn up, and White's c-pawn needs defending... Also note the possible gratuitous swap-off which would displace his K-side pawns (I'd never give up this lovely knight on his hemmed-in light-squared B, but he doesn't know this!",
        "12. Bd1": "So back it goes, now White's rooks have lost sight of each other - good news for the revolutionary forces of freedom and justice",
        "12... c6 13. b4 a6 14. f4": "Ouch! - it's that kind of attacking move that can spell trouble",
        "14... Ne6 15. Qg3": "Queen redeploys and Black now has a combination (15... Nxe4 16Nxe4...BxR) that looks very tempting. Little do I realise, the body bag will never be recovered...",
        "15... Nxe4 16. Nxe4 Bxa1 17. f5 Ng7": "The f-pawn is a pain in the [word deleted by GK editorial staff] but it's the N on e4 that's really worrying, eg f6...Nh5 (not ...exf Nf6) fxe...NxQ Nf6 mate) If ...Qxe, Re1 and the N threat holds.  I'm sweating...",
        "18. c3": "I think, well he can't take it because his bish is still in the way, let's just wait for the N to move...",
        "18... Qd7 19. Bg4": "Racking up defence of the pesky f-bloke... meanwhile threatening the mortal x-ray f6 advance...",
        "19... d5": "Tell the nasty horsey to go away...! He has a three-way fork on f6 now... Help! ",
        "20. f6": "well, here it is, end of game I can hold him off for a couple of moves maybe...",
        "20... Ne6 21. Qd3": "why not fxe? is he planning something even more humiliating than taking my queen (may Allah's blessings be upon her) and getting me in checkmate?",
        "21... Qc7": "If I'm getting extra moves, let's do some damage limitation - and get out of that triple fork for a start...",
        "22. Ng3": "What? They're running away!!! Can those hours of constant prayer and meditation have been of some use?  Quick, do something decisive...",
        "22... exf6 23. Rxa1": "Whoops, there goes that Bishop... seems like so long ago now, and I'm almost relieved...",
        "23... f5": "Yeah! Get oudder here! The danger is his Queen and B getting together on the long diagonal, note: must keep horse here to protect  d4",
        "24. Nxf5": "Trying to rattle the troops, but my guys are in best defensive position and I'm not going to be falling for any of that gxN stuff...",
        "24... Rad8 25. Nh4 Rd7 26. Re1 Qd8": "Bits centralized, and I'm weathering the storm...",
        "27. Qg3 Rde7 28. Rf1 d4 29. Rd1 Qb6 30. Qf2 Ng7": "If White takes cxd, ...Qxb with some direct threats (with all those rooks)",
        "31. Kf1 f5 32. Bh3 Qb5+": "Gains the tempo for...",
        "33. Kg1 dxc3": "the pawn-take, and now things look fairly solid for Black...",
        "34. a3 c2 35. Rc1": "Can't take the pawn, of course, without some back-up on e1",
        "35... Rd7": "And then, just like that, Black completely blows his winning chances.  I won't make any excuses, just give this move a double ??",
        "36. Qxc2": "Dur!\r\n",
        "36... Re2": "Chess teaches us to carry on so after a number of deep breaths we take stock - all his bits are marginalized, I have two pawns and a rook for two bits, and a rook on the seventh.  On, On! The Thracian storm wind etc... (let's not get carried away, it's only a game ed.)",
        "37. Qb3+ Ne6 38. Qg3": "Again the White Q comes back to centre stage and that f pawn looks distinctly wobbly...",
        "38... Qa4": "To thwart this, Black must come up with a plan...",
        "39. Kf1": "He's seen it, but...",
        "39... Rd1+ 40. Kxe2 Nd4+ 41. Kf2 f4 42. Bxf4 Qb5": "This interposed move stops his Q from getting to b1 and start checking me. Qxf...Rf1+!",
        "43. Qe3": "White is not out of the woods yet - with that hanging rook there are plenty of chackmate chances...",
        "43... Qf1+ 44. Kg3": "All forced to...",
        "44... Ne2+ 45. Kg4 h5+ 46. Kg5 Rd5+": "He decides to block with the N which, if nothing else, was unexpected...",
        "47. Nf5 Qxf4+": "The only continuation giving any kind of parity for Black...",
        "48. Qxf4 Nxf4 49. Kf6": "Didn't take the N!",
        "49... gxf5 50. Bxf5 Rd2": "So, now the dust has settled, Black can be fairly pleased with how things turned out.  I wouldn't mind sacking the N on the h pawn and walking the bc pair home...",
        "51. Be4 Kf8": "Why didn't I take the g now?",
        "52. Rf1 Nxg2 53. Kg5+ Ke7 54. Kxh5 Ne3 55. Rh1 Ra2 56. h4 Kf6 57. Rg1 Rxa3 58. Bg6": "this is all good, if I can stop his K from coming off the h file and letting the pawn through...",
        "58... a5 59. bxa5 Rxa5+": "I love the smell of connected pawns in the morning...",
        "60. Rg5 Rxg5+ 61. hxg5+ Kg7 62. Be4 Nd5 63. Kg4 b5": "The guy offers me a draw somewhere round here and I am sorry to say I turned him down.  Wouldn't you (besides, I only ever offer draws in positions I consider lost, and must assume others do the same thing)...",
        "64. Kf5": "Maybe this K move seals it - my crosshead is too far away from the action from now on...",
        "64... b4": "Although we do give it a go...",
        "65. Ke5 Ne7 66. Kd6 Kf7 67. g6+ Nxg6 68. Bxc6 Kf6 69. Ba4": "The value of a bish in the end game...",
        "69... Ne5 70. Bc2 Nc4+": "Well, turns out Andy's a rock musician, goin' through college and generally an all-round nice guy so, after this symbolic final check the players agree a draw and adjourn down the pub.  Thanks, Andy for a good game, and hope the annotations are not offensive; they're all meant in good spirit..."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=26267",
    "gameName": "Let's play chess",
    "players": "abreyer (1595) vs. edegales (1589)",
    "opening": "Robatsch (modern) defence (B06)"
}