{
    "moves": {
        "1. c4": "Computer analysis of this game is available at http://gameknot.com/analyze-board.pl?bd=18564045&rnd=0.21791306044906378\n\nThis game was an open challenge as part of my attempts to get my rating back above 1500, as it turned out it was one of the shorter games I have played for a while in that it was all over in twenty moves.\n\nThe game starts with my favoured english opening",
        "1... e5 2. Nc3 Nf6 3. Nf3": "Bellon Gambit which I don't have much experience of so I thought I would give it a try",
        "3... Nc6 4. a3": "This is an unusual move for me but I wanted to reduce the risk of doubled pawns on c",
        "4... d5 5. cxd5 Nxd5 6. e4": "Qc2 is another option here but I was happy to have the chance to bring my b pawn to c",
        "6... Nxc3 7. bxc3 b6": "This takes us out of the Gameknot database which favours developing one or other bishop. The computer calls this a mistake preferring Bc5",
        "8. Bb5": "While this pin can easily be broken I think its irritating for black.",
        "8... Bb7 9. d4": "The computer prefers Qa4 here. I like the threat of d5.",
        "9... f6 10. O-O Bd6 11. d5": "last chance to play it before the knight can escape",
        "11... O-O 12. dxc6 Bc8 13. Nh4 a6 14. Bc4+ Kh8 15. Qh5 Qe8": "threatens Qxc6 which I am happy with due to Bd5 skewering the rook",
        "16. Qd1 Qxc6": "At this point I realised that if I could get the black queen away from the a4-e8 diagonal he would be in trouble due to the threat of Qh6",
        "17. Bd5 Qxc3": "he takes the bait, the computer now claims mate in 8\n\n… Qxc3 18. Qh5 Rf7 19. Qxf7 Be6 20. Bxe6 Qxc1 21. Rfxc1 Rf8 22. Ng6+ hxg6 23. Qxg6 Rf7 24. Bxf7 Bxa3 25. Qh5#",
        "18. Qh5": "Now the threat is Ng6#",
        "18... h6 19. Bxh6 gxh6 20. Qxh6#": "thanks for reading please comment"
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=47549",
    "gameName": "Let's play chess",
    "players": "elwoos (1483) vs. kasiandelu (1496)",
    "opening": "English (A22), Bellon gambit"
}