{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Bb5 Nf6": "I felt like playing the Berlin Defense, and see what happened.",
        "4. b3": "I was not expecting this. Normally the move would be to capture the black pawn on e5.",
        "4... Bc5 5. Bb2 O-O": "Position is now at equilibrium. White is not yet done with development. I expected from here to have White castle, and then develop his night. ",
        "6. Bxe5": "A major mistake, as the white king is not yet adequately protected.",
        "6... Nxe5": "Just a trick to start my combination. White might have expected this, but if he did, then he didn't deeply explore move. Or he didn't thing that I would sacrifice the Bishop. The best move now in my opinion is now D4. You can't let the Bishop get access to F2 if you still haven't castled.",
        "7. Nxe5 Bxf2+": "Start of the blitzkrieg that would give Black a decisive advantage. best move for white is now Kf1. This would limit the damage, and gain time to defend. ",
        "8. Kxf2 Nxe4+": "clearing the way for the black queen to dance.",
        "9. Kf3": "This was not all that great. It just exposes the king further, and pulls white to defeat.",
        "9... Qf6+": "What else?! black now has to attack to keep white off balance.",
        "10. Kxe4": "the capture practically begs not to be played, though I doubt that the position can be saved. ",
        "10... d5+": "Allowing another piece into the blitz.",
        "11. Kd4": "The capture of the pawn would only have lead to early defeat. if 11. Kxd5 then c6! and the capture of the knight. ",
        "11... Qf4+": "only move",
        "12. Kxd5": "Wrong way! the king should be heading towards safety!\n",
        "12... Be6+": "gaining even more time! the night now has to be abandoned. ",
        "13. Kc5": "only move... the King can't head to the hills.",
        "13... Qxe5+ 14. Kb4 a5+": "the only logical way to follow up the attack, and gains the bishop, though if white was concerned, he would've resigned by now.",
        "15. Ka3": "only move, and incidentally, sets up a trap. if 15. ...Qxa1?? then 16. c3! and the queen is trapped! ",
        "15... c6": "Capturing the bishop only loses time, and the white king is then safe.",
        "16. c3": "Setting up shelter. Finally, White can breath slightly easier, or can he...",
        "16... cxb5": "bringing even more pressure, if that is possible. This would be an absolute nightmare to defend against. ",
        "17. Kb2": "Some shelter is better than none! ",
        "17... a4": "an attempt to break open the shelter (17. ... a4 18. bxa4? bxa4 19. Re1 Qb5 ! 20. Kc1 a3. though white can escape by 21. Nxa3 Rxa3 22. Qc2\tRf-a8  23. d3\tRxa2       24.\tRxa2\tRxa225.\tQb1\tQxb1 26.  Kxb1\tand  black has the advantage, but the attack has ran out of steam, but has an extra piece.  Best move now is 17. b4, which seals the position right up, and allows white to escape. ",
        "18. bxa4 bxa4 19. Re1 Qb5+": "best way to prosecute the attack",
        "20. Kc1": "Interesting would be 20. Kc2!? with a sharp position, and some safety. ",
        "20... a3": "aiming for mate. white has to take the pawn or move his queen. if he moves his queen, then eventually, he has to lose it or trade it in check. even then, it only prolongs the agony. Black will win no matter what. ",
        "21. h4 Qb2#": "And Check Mate! White failed to antisipate this. "
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=8230",
    "gameName": "Let's play chess",
    "players": "xzam (1219) vs. berlin89 (1200)",
    "opening": "Ruy Lopez (C65), Berlin defence"
}