{
    "moves": {
        "1. e4": "I'm more familiar with the Queen pawn but it's good to work on one's weaknesses",
        "1... e5": "My ability with the Sicilian is very limited. I should probably try it more often.",
        "2. f4": "I've only got a couple of games played with King's Pawn Gambit and I always declined in the past and things didn't work out so well! ",
        "2... exf4": "Accepted",
        "3. Nf3": "Development",
        "3... Nc6": "I thought Nf6 would be bad because e5",
        "4. d4": "White controls the center",
        "4... d6": "Trying to get my pieces out",
        "5. Bxf4": "More development and control of center",
        "5... Nf6": "Safe now",
        "6. e5": "Or so I thought! ",
        "6... dxe5": "I thought it was better to clean up the middle than continue to allow white dominance",
        "7. Nxe5": "Keeps the Bishop",
        "7... Qxd4": "I thought this was better than Nxe5 with the center cleared. A trade of Queens leaves us with even development",
        "8. Nd3": "Perhaps Nxc6 is better doubling my pawns but also losing the right to castle after 8. ... Qxd8 9. Kxd8",
        "8... Qe4+": "I really want to trade queens",
        "9. Be2": "Now comes the crucial point of the game. If I immediately 9. ... Qxg2 it is followed by 10. Bf3 and eventually Qe2+ ",
        "9... Bg4": "My thinking was to pin the white light squared Bishop in place preventing Qe2+",
        "10. Nd2": "Driving my queen off",
        "10... Qxg2": "I expected 11. Rf1 thus giving me time to Queen side castle.",
        "11. Nf2": "This move came as a bit of a shock. My light square bishop is now in serious peril. I've got to somehow extract my queen and keep the bishop double protected",
        "11... Bc5": "Now 12. Bxg4 is met with 12. ... Qxf2#. It also sets up a short side castle which is vital to avoid Qe2+",
        "12. Rf1": "Preventing the mate and keeping the threat of Bxg4 alive",
        "12... Bxf2+": "My only choice to save the Bishop",
        "13. Rxf2": "Basically back to square one trying to save my Bishop somehow",
        "13... Qh1+": "I expected 14. Rf1 Qg2 15. Rf2 Qh3 thus getting my queen out and keeping the Bishop covered",
        "14. Nf1": "This was another surprise but it turns out mistake that gave me the win. ",
        "14... Rd8": "This move won the game for me. It took me quite a while to find it. It gives me the one Tempo I need to castle and connect my rooks with my two pawn advantage",
        "15. Qc1": "Saving the queen",
        "15... O-O": "Whew",
        "16. Qe3": "Hoping to bring the other rook into play",
        "16... Bxe2": "Forcing",
        "17. Rxe2": "Now my connected rooks take over",
        "17... Rfe8": "My knight on f6 is suddenly super important after being a spectator the whole game",
        "18. Qf2": "I think hoping for kingside attack with Bishop and Queen",
        "18... Rxe2+": "Getting rid of his active rook",
        "19. Kxe2": "Forced or loses queen to skewer",
        "19... Qe4+": "Finally my Queen is back in the game",
        "20. Ne3": "Now my long neglected knights move in",
        "20... Nd4+": "Checks and bringing pieces into the attack. I'm always told have your moves serve more than one purpose.",
        "21. Kf1": "Must avoid the d column and discovered checks",
        "21... Nd5": "More pieces to bear",
        "22. Bg3": "Losing a piece. I think 22. Nxd5 is better",
        "22... Nxe3+": "I'll take that with the check",
        "23. Kg1": "Running",
        "23... Nf3+": "More checks",
        "24. Kh1": "I was thinking Rd2 netting me the queen but then I found a more elegant mate which is something I always admire in stronger players",
        "24... Ng5+": "Another check and only 25. Qf3 prevents the immediate mate",
        "25. Kg1": "Allowing me my precious elegance",
        "25... Nh3#": "I really thought I lost this one with my Queen trapped in the corner but gaining that one tempo to castle and connect my rooks brought all my pieces into play. I'm always amazed how a game that could easily have been lost hinges on one tempo."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=28505",
    "gameName": "Let's play chess",
    "players": "thearrtofnoise (1379) vs. tomlib (1200)",
    "opening": "King's knight's gambit (C34)"
}