{
    "moves": {
        "1. c4": "I have studied 1.e4 openings from TA and not just during his blitz Q sac openings.  This is a little different but something I'm used to as not only have I played against it, but fiercequeen's original annotations involved the English Opening.",
        "1... Nf6": "I was surprised to see this played.  My response to the English Opening is 1...e5 since that's the reversed Sicilian being that 1...c5 is the Sicilian and the second most common response to 1.e4.",
        "2. d4": "I thought that 2.d4 was mainly played after 1.e4 when black responds by advancing a pawn one square, such as the Caro Kann Defense or the Owen's Defense.  However, I like this move, regardless as it opens up a line for TA's Bc1.",
        "2... e6": "I guess his opponent has the same idea in mind since black's Bf8 is now free to move about.",
        "3. Nc3": "Continuing with his development.",
        "3... d5": "And, black's idea of a good time is breaking through the center since he already advanced the e pawn.  As now, there is a solid pawn chain in the center.",
        "4. Nf3": "Meanwhile, TA continues to develop in preparation of castling.",
        "4... Bb4": "Not liking what TA might be planning to do with his Nc3, black pins it.",
        "5. Bg5": "But, as they say, it's a pin for a pin.",
        "5... O-O": "Not surprisingly, black castles right away.  And, I would've done the same thing here as K safety is important which TA has mentioned in his club.",
        "6. e3": "And, TA connects his pawn and develops by opening up a line for his Bf1.",
        "6... Nbd7": "I don't know why he played this.  I say that because even though it develops, I would've played 6...Nc6  This move appears to cram his Bc8.  As such, after developing the N, I'd want to bring my DSB into play, right afterwards. ",
        "7. Rc1": "Preparing for black to exchange the N.  So, not only do I understand why, but I like the logic behind this move.  As now, if black takes, TA does not have to double up his pawns in order to prevent losing a piece which keeps his pawn structures strong.",
        "7... h6": "Of course, black is going on the attack.",
        "8. Bh4": "Contrary to what I have said in previous annotations, I also would've played this.  As I also don't see a good reason for wanting to exchange the N for B.  And, if TA were to retreat with 8.Bf4, black would just force white to exchange pawns starting with 8...e5.",
        "8... c5": "Although, he is forcing the exchange, anyhow.  It's not of the same pawns, but I'd start to get a little nervous as I believe that this exchange favors black.  That is, if black recaptures correctly.",
        "9. cxd5 Nxd5": "?? But, he does not.  As black, I would not have considered anything else besides 9...exd5 which keeps things level.  As the N was pinned which is something that TA implied with this game which also blends in with something to talk about.  As the Q was protected, but he accurately mentioned that this blunders the Q.  And, with that being said, this loses, no matter how you slice it.  ",
        "10. Bxd8 Rxd8 11. Be2": "With that being said, TA completes his development and prepares to castle.",
        "11... Nd7f6": "And, black brings his N to a better spot.",
        "12. O-O": "But, TA waists no time to castle.",
        "12... cxd4": "I was a little surprised to see black exchange here since he is behind.  However, the rule of thumb is that when you're behind, exchange pawns, not pieces.  But, I would not even want to exchange pawns since they can become powerful, if they become passers.  With that being said, I would've completed developing with 12...Bd7 here.",
        "13. Qxd4": "But, this, in contrast, is how I also would've recaptured as now, we have an added defender, if black were to grab white's Nc3.  And, if were even and there were to be a slew of exchanges, white would not have to isolate his a and b pawn as the Q is right in the middle of action. ",
        "13... Be7": "I don't see the point of this move.  The B was not attacked of black's N.  And, if TA was take on d5, black has ...Nxd5 which keeps the B attacked in the same way.  So, I believe that this is just a waist of tempo which white will also use to his advantage.",
        "14. Rfd1": "And, that's because TA centralizes his R and increases his mobility in the center by having the R behind the Q.",
        "14... b6": "Black fianchettos to open up a different diagonal for his B where it will be more mobile.  But, this move is going to increase TA's advantage since white will liquidate N's.  For that reason, I would've played ...Nc7 earlier.",
        "15. Nxd5 exd5 16. Ne5": "TA has an attack lined up since he is threatening to fork with 17.Nc6",
        "16... Bc5": "However, black stops that.  But, it's only for a short moment.  ",
        "17. Rxc5": "That's because instead of retreating the Q, TA will exchange R for B and P.  I was wondering why he did that since a R is worth more, in terms of point values.  But, as kenneth_fiore_3 has mentioned the real issue is mobility.  And, I agree that black's Bc5 was more mobile then TA's R.  With that being said, when you add it up, if you add up a pawn, except for a pawn, TA exchanged something worth just as much in terms of how many points they're worth.  In other words, it was no big difference there, but this way, black has, pretty much, lost all of his mobility, on top of his Q.",
        "17... bxc5 18. Qxc5 Be6": "Doing what he can for counterplay, black finishes his development.",
        "19. Nc6": "Not surprisingly, TA responds by attacking blacks R.",
        "19... Rd7 20. f3": "And, TA connects another chain of his pawns.",
        "20... Kh8": "I don't know why black played this, but I would've tempted to connect the other set of pawns with 20...g5.",
        "21. Ba6": "I'm not sure why TA played this, but my guess is to prevent black's a7 pawn from advancing.",
        "21... Rc7": "Doing what he can for counterplay, black pins the N.",
        "22. b4": "This doesn't bother TA because that pawn is very dangerous.",
        "22... Rg8": "I don't know why black played this.  However, one move or another doesn't make a difference for him, anyhow.  As I don't believe that there's anything left for black to work with, at this point.",
        "23. b5": "Although it's not a passed pawn, TA follows through on his plan.  And, advancing it shows why this pawn is dangerous.  As after 24.b6 white's win would be almost immediate, from that point on.",
        "23... Bc8": "So, black tries to stop that pawn.  In this case, the only option is liquidating since 23...Rb7?? is, obviously, unplayable.",
        "24. Bxc8 Rgxc8 25. a4": "However, there is nothing that black can do about that pawn, anyhow as white TA has pawn chain.",
        "25... h5": "So, black is doing what ever else he can to hang on.  In this case, the is advancing, and I assume that the idea behind this is connect it with his g pawn.  As, I'd be tempted to follow up with 26...g6, in this position.",
        "26. Kf2": "Not only am I not surprised to see TA play this, but I would've considered this move.  The other move I would've looked at would be 26.a5 with the idea of 27.b6 which is also devastating for black.  In fact, that's what I would've done since white would have, more or less, an unstoppable passed pawn.  But, I like this move just as well because this gets the K in action and allows white to then follow up with an eventual Kg3-e5 which would make things even more difficult for black.",
        "26... Kh7": "Doing what he can to stop that, black brings his K in action.",
        "27. h3": "Contrary to before, I don't know why TA played this.  As white, I would've responded with 27.a5 at once.",
        "27... h4": "But, with this move, I figured out that there is something that I was missing there.  I just don't know what it was.",
        "28. Rd4": "However, TA attacks the h pawn with check.",
        "28... Kg8": "Getting out of the check, but I would've played 28...g5 to stop the attack.",
        "29. Qd6": "But, TA doesn't care about the pawn.  And, I know why, as he is threatening to win more material with 30.Ne7+  With that being said, I also would've played this move and for the same reason as this is signaling the official end for black since resignation is soon to come.",
        "29... Rd7": "Therefore, as a last resort, black gets aggressive and attacks the Q.",
        "30. Qxd7": "But, TA doesn't care about the Q and takes the R.  And, black resigned here because even if even if black takes back and doesn't get mated, white has too much material.  As he's left with an extra R+P.  In addition, white's pawn structures are much better then blacks.  In fact, TA can even get a passed pawn and promote, whereas two of black's pawns are isolated.  And, the ones that aren't, can't do much and cannot get a passed pawn which was too much for him to handle.  But, this situation resulted from the early blunder that black on his 9th move, and I believe that this was his only mistake.  With that being said, similar to the lesson in my last game with Ken; the moral of this story is that against a very strong player, just one mistake can be the difference between winning and losing a game."
    },
    "url": "https://gameknot.com/annotation.pl/lets-give-them-something-to-talk-about?gm=64086",
    "gameName": "\"Let's give them something to talk about\"",
    "players": "deeper_insight (2343) vs. jgerace1 (2347)",
    "opening": "English, 1...Nf6 (Anglo-Indian defense) (A15)"
}