{
    "moves": {
        "1. e4": "Opens Diagonals to Queen And Bishop",
        "1... d5": "immediately challenges White's weak pawn that is not undefended by no pieces.",
        "2. exd5": "white challenges my intention to take with the queen so white maybe gets lead in development in exchange for weaker center",
        "2... Nf6": "I am willing to sacrifice an pawn to commit White to weakening the structure of the pawns and I will get a lead in development and take advantage of White's horrible position",
        "3. Nf3": "white does not want any of that so just develops ",
        "3... Qxd5": "I have a better center and more solid pawn structure, but White can attack my queen with Nc3 or c4 after d4",
        "4. Be2": "maybe playing for a draw?",
        "4... Bg4": "I develop aggressively and cause White to struggle, usually it is Black who struggles, not White",
        "5. O-O": "White castles into a devastating attack",
        "5... Nc6": "getting another re-enforcement to the kingside",
        "6. d3": "I'm not sure if White can recover, but maybe his dark-squared bishop can help his position in shambles",
        "6... O-O-O": "developing incredibly aggressively, White has no chance.",
        "7. Bg5": "White tries to get the dark-squared bishop to help the situation but he only loses the valuable re-enforcement",
        "7... Bxf3": "BRILLIANCY ALERT GENIUS ALERT KING ALERT PROPHET ALERT!!!!! I have captured the defender of the bishop, now White might be scratching his head wondering how he is left with a deficit, not understanding that some people are just on another level",
        "8. Bxf3": "recaptures but....",
        "8... Qxg5": "BOOM!!!! now I have extra knight",
        "9. Bxc6": "takes to weaken my pawn structure, but it does not matter, I win",
        "9... bxc6": "no pieces to attack exposed king",
        "10. Nc3": "I have extra dark-squares bishop and I use it to attack the h2 square and win the game",
        "10... e6": "planning Bd6-h2",
        "11. a3": "maybe white thought I was going after c3 knight so he stops my move",
        "11... Bd6": "but he doesn't see that his kingside is lost",
        "12. g3": "blocks my bishop's path to the strong",
        "12... h5": "getting another re-enforcement to attack the weak",
        "13. Ne4": "trades but to no avail I win not complex but obvious",
        "13... Nxe4": "and takes",
        "14. dxe4": "and takes",
        "14... Bxg3": "and reveals the rook to the queen so White does not take my bishop",
        "15. Qf3": "but I win more easy",
        "15... Bd6+": "back",
        "16. Qg2": "block",
        "16... Qf4": "aim for h2",
        "17. f3": "do not understand",
        "17... Rh6": "aiming Rook g6 to win the queen",
        "18. Kh1": "prevents it",
        "18... Rg6": "attacks",
        "19. Qe2": "gets away",
        "19... Qxh2+": "I was getting really sick tired of white missing my attacks so I just trade queens to make win more obvious",
        "20. Qxh2": "forced",
        "20... Bxh2": "queens off board",
        "21. Kxh2": "I lost the extra bishop but I have pawns to win",
        "21... Rd2+": "rook to d2 check attacks c2 and x-ray b2",
        "22. Kh3": "a role",
        "22... Rgg2": "I win with awfully awesome process",
        "23. Rfh1": "he blocks",
        "23... g5": "but i get checkmate",
        "24. b4": "he moves",
        "24... Rgf2": "and i plan checkmate",
        "25. Kg3": "he stops it",
        "25... Rfg2+": "was not a mistake",
        "26. Kh3": "same position but no mistake",
        "26... Rdxc2": "takes I am winning more",
        "27. a4": "he moves",
        "27... h4": "now I threaten mate and I win",
        "28. b5": "he moves",
        "28... Rg3#": "ALERT I JUST PASSED THE BRILLIANCY TEST I HAVE BEEN PROMOTED TO CHANCELLOR"
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=64646",
    "gameName": "Let's play chess",
    "players": "pablo1965 (1198) vs. hexchess (1200)",
    "opening": "Scandinavian defence (B01)"
}