{
    "moves": {
        "1. d4": "This is why I lost the game...lol\n\nI haven't played enough d4 games to know how to react :P",
        "1... d5 2. c4": "Queen's gambit (just looked up the name...haha)",
        "2... Bf5": "Focused on developing...not really sure what the standard moves are. I'm too lazy to read books and stuff.",
        "3. Nc3": "Developing and threatening d5",
        "3... e6": "Developing and backup to d5",
        "4. Nf3": "Clop clop!",
        "4... h6": "Not sure why I did this. Perhaps to prevent Bg5 or Ng5",
        "5. Bf4": "Developing bishop and placing it in a powerful position",
        "5... Bd6": "Maybe Bb4 would've been a better move here (any insights?).",
        "6. e3": "White's development is much further than black's. You would think I would focus on getting the knights out and finishing up my development ... but...",
        "6... Bxf4": "Pikachu knows best...I don't really like so many white control on e5. And this doubles pawn on f-file for white.",
        "7. exf4": "Getting material back",
        "7... c6": "Usually I focus on developing knights before bishops...but like I said I was probably in a losing mood since 1. d4... haha\n\nI should've probably focused on developing knights at this point",
        "8. Be2": "Preparing for a castle",
        "8... Nf6": "Better late than never.",
        "9. O-O": "Long live the king!",
        "9... Qd6": "Okay, to anyone wondering why in the name of jellybeans I did this. I don't know. Usually when someone castles I start moving all my attacking pieces that way. This move was along those lines to attack the castle.",
        "10. Nh4": "Attacking the LSB",
        "10... Qxf4": "Free pawn ahoy!",
        "11. Nf3": "Moving back to a safe spot. Blocks the bishop at e2 though. Perhaps Nxf5 would've been a better move here.",
        "11... Ng4": "Attacking h2",
        "12. g3": "Removing threat to castle",
        "12... Qd6": "c7 might've been better here",
        "13. c5": "...for this reason",
        "13... Qc7 14. Nh4": "attacking bishop on f5 which is defending g4",
        "14... h5": "defending g4",
        "15. Nxf5": "Taking out a bishop that's attacking a free diagonal, and doubles up pawn on the f-file",
        "15... exf5": "Getting material back",
        "16. Re1": "Claiming the open e-file",
        "16... Kd8": "Not quite sure why I did this. Castling may have been a better move.",
        "17. Qd3": "Putting pressure on f5??",
        "17... g6": "Defending f5",
        "18. b4": "Not sure why this move was made. Maybe white wants to start attacking black's queenside?",
        "18... Na6": "Black finally develops the knight but to a useless square...duh\n\nShould've probably gone to d7",
        "19. a3": "Backing up the b4 pawn",
        "19... h4": "attack on the castle...hoping to open the h-file",
        "20. Bxg4": "Taking out another threat to the castle",
        "20... fxg4": "Getting material back",
        "21. Re2": "Perhaps to double up the rooks",
        "21... Kd7": "Connecting rooks. I think Re8 may have been a better option",
        "22. Rae1": "Doubled rooks on an open file...oh dear",
        "22... Rae8": "I wanted to break the double rook since it's a much bigger threat than my connected rooks",
        "23. Qd2": "This move was probably to get the queen to g5",
        "23... Rxe2": "Breaking the double rooks",
        "24. Nxe2": "Getting material back while moving knight from a passive square...good move imo",
        "24... Qd8": "I think this was to next move the queen to the h-file eventually",
        "25. Nf4": "Going on the offensive",
        "25... hxg3": "Opening the h-file",
        "26. hxg3": "Getting material back",
        "26... Kc8": "Moving to a safer place",
        "27. Nd3": "White's highly mobile knight is much more powerful than black's at this time.",
        "27... Qf6": "Again with the h-file in mind. Plan was to get to f3 first",
        "28. Ne5": "Defending f3",
        "28... Qf5": "Mobilizing towards h5",
        "29. a4": "Not sure why this was done. Most likely to bait me to move f6 because I didn't see the next set of moves coming...",
        "29... f6": "Bait taken",
        "30. Nf7": "Step 1 of the \"muhahaha strategy\"",
        "30... Rh7": "Saving private ryan",
        "31. Nd6+": "The Great Fork! I totally did not see this coming. At this point I thought with my poorly placed knight and black's rook on the open file I figured I did enough damage to my brain cells so I resigned. Maybe if I had kept on white would blunder which I could exploit, but seeing how the game had gone so far I think I would be more likely to blunder more ... lol\n\nThanks for reading if you have so far."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=56426",
    "gameName": "Let's play chess",
    "players": "johnbruno (1388) vs. shushanta (1356)",
    "opening": "QGD (D06), Grau (Sahovic) defence"
}