{
    "moves": {
        "1. e4": "My opponent had played the king pawn. I answered with the same move, as usual",
        "1... e5 2. Nf3 Nc6 3. d4": "My rival chose the Scotch opening, where the center of pawn is defined soon.",
        "3... exd4 4. Nxd4": "White can play in gambit mode with 4 Bc4 (Scotch gambit) or 4 c3 (i guess is Goring gambit). The move in the game is the most common. ",
        "4... Nf6": "This reply isn't the one. Black can play 4 ... Bc5. But I chose this move because leads to unbalanced positions.\nAnother reply is 4 ... Qh4 but is risky.",
        "5. Nc3": "Now, white enters in a variant of Four Knights Opening. Black can move your dsb to e7, c5 or b4. Obviously, the three alternatives leads to three different ways of play the position.  The main move in the Scotch is 5 Nxc6 bxc6 6 e5 Qe7 7 Qe2 Nd5 8 c4 Ba6. However, this variations has multiple subvariations and branches!!! ",
        "5... Bb4": "I played this move to accelerated the development while attacking the e4 pawn. ",
        "6. f3": "I don't like this move. It's weakening the e3 square and don't contribute to development. I was expected 6 Nxc6 bxc6 7 Bd3 d5 8 exd5 cxd5 where black has three pawn island but black too has a good development. ",
        "6... O-O": "I chose the castle. The main alternative in my mind was 6 ... d5. But, I prefer attack with the rook in e8 soon. Question of tastes, I guess.",
        "7. Nxc6": "White simplifies the game, but makes stronger the black center!",
        "7... bxc6": "Now, black can play d5 with initiative",
        "8. Bd2": "Avoids the double pawns",
        "8... d5": "Hitting in the center. I guess black has a slightly advantage here.",
        "9. e5": "This choice is natural. White is delayed in development and must close the lines. Alternative move is 9 Bd3, where black can open lines but white plays castle and hide the king in h1. It's too hard to calculate",
        "9... Re8": "But black needs open the lines to attack. I believe, black has a winning attack here (but I didn't find). In the post-mortem analysis, Stockfish agrees with my two next moves",
        "10. f4 Ng4": "This move isn`t forced. But,  I wanted attack the e-pawn with f6 and opening the column",
        "11. Qf3": "My rival hurries the long castle and gives me a pawn up. The natural variation 11 h3 is answered with Qh4 and black wins.  ",
        "11... f6": "I was shocked. The post-mortem analysis with Stockfish says 11 ... d4 is winning. In my head didn't appear the idea of to allows the jump  12 Ne4. But Stockfish knows chess better than me and gives amazing lines with 11 ... d4 12 Ne4 Bxd2+ 13 Nxd2 Ne3. I played 11 ... f6, more natural and consistent with my strategic idea",
        "12. O-O-O": "White gives up a pawn. But he needs put in a safe place his king. Intuitively, the opening of the e column with the king in the center leads to collapse",
        "12... fxe5 13. fxe5 Nxe5 14. Qg3": "I sayd in the introduction, I played well in the opening ( or better than my opponent, at least). At this point, I made several mistakes that could cost me the advantage",
        "14... Rb8": "Activate the rook, seeing the king position. However, I allowed the double attack (via x-ray) over  the weak c7-pawn. May be, better was 14 ... Bd6 and wait for development the rook.",
        "15. Bf4": "Now, I had time to play 14...  Bd6. But who says one says two",
        "15... Qf6": "I was felling here without idea to fight for the initiative! I am wanting the b2 pawn, but it's only a cheap threat!... white was activating its pieces! ",
        "16. Bd3": "At this moment, I calculates the next exchanges and evaluates in black favour. Now, I don't think so. I didn't evaluate the pieces that were left on the board",
        "16... Bxc3 17. bxc3 Nxd3+ 18. Rxd3": "Of course, if 18 cxd3 Qxc3++. I was happy, white has double pawn and the king positions is unsafe. Nevertheless, the position shows opposite bishop!! If white wants the exchange of queen and rooks, leads to a balanced endgame. Right now, White can takes in c7, restoring the balance of material. ",
        "18... Bf5 19. Re3": "Offering the rook exchange.",
        "19... Be4": "I closed the column. No rook exchange for the moment, please",
        "20. Bxc7": "Ok. Bye bye my pawn up. Now, I have a slightly advantage because both rooks are in opening columns, my bishop is in the center defended by a pawn and I have a better pawn structure. But, may be, that isn't enough",
        "20... Rb7 21. Ree1": "My opponent blunders. I need take a few minutes to calculates the next move. I didn't see before, but I can force the bishop exchange (with a pawn up and near of the king zone)! Clearly, mi opponent idea was move a rook (sure, the h-rook) to f1. ",
        "21... Rxc7": "Deflection of c3!",
        "22. Qxc7 Qxc3": "Threating checkmate and Qa1+ and Qxh1",
        "23. Rxe4": "The only move. But the opposite bishop are no more!",
        "23... dxe4": "I chose take with the pawn. The alternative was 23 ... Rxe4 but 24 Qd8+ Kf7 25 Rf1+ and my king take a tour on the board  (with probably draw for repetition). Stockfish says 23 ... Rxe4 24 Qd8+ Kf7 25 Rf1+ Kg6 26 Qd6+ Kg5 27 Qd8+ Kh6 28 Qd6+ g6 and no more checks. I don't need to see that variation if I can play 23... dxe4 and retain the initiative",
        "24. Kb1": "My opponent moves your king, avoids Qa1+. But it's a bit of exposed",
        "24... Qb4+": "This is a strategic blunder (this move and the next)! In my will of attack the king, I forget the retreat of the queen to e5 (in a centralized square!).  Objectively, the position is winning for black. But isn't easy with the move of the game. The direct move 24 ... e3 wins. But I saw 24 ... e3 25 Qg3 Qb4+ ?? 26 Kc1 e2 27 Re1. In this variation, I can play 25 ... Re5 with mate attack (Rb5+). Indirectly, we can see how the control of the central square e5 gave a winning attack",
        "25. Ka1 Rb8": "I closed my pieces against the king, following the idea of the last move",
        "26. Qe5": "But the queen defends the checkmate.",
        "26... c5": "Another mistake. It was better 26 ... e3 27 Qe6+ (or Qd5+) Kh8 28 Qb3 Qd4+ 29 c3 Qe5 30 Qc2. Anyway, black has advantage.",
        "27. Rd1": "White was activating the last piece.",
        "27... h6": "In some variation, I see the risk of 28 Qd5+ Kf8 (Kh8 Qd8+) 29 Rf1+ and I had played to avoid this maneuver. But the Stockfish says 27 ... Kh8 and black is winning (the evaluation is -5).",
        "28. Qd5+ Kh8": "Stockfish prefers Kh7. I only hide my king.  Now, the evaluation of Stockfish is -1. ",
        "29. Qb3": "I think this is a blunder. Black had nothing against the exchange...",
        "29... e3": "But, if I can, better with the pawn in e3. I played this part of the game with more precision.",
        "30. Qxb4": "Now, e2 was a strong threat and the queen must be deleted",
        "30... cxb4": "The correct takes! If 30 ... Rxb4 31 Rd8+ Kh7 32 Re8! and the rook is in the right position to controll the advance of the e-pawn!. Clearly, in this position I saw that 28 ... Kh7 was better.",
        "31. Kb2": "Now, the black strategy is very simply but I don't sure if that's winning. I must restrict the white king, move my king to the center (e4 is ideal) and, late, move the rook to f2 to capture the white pawns. The e3 pawn must be quiet, like a threat. That pawn is blockade with easily. The move of the rook (31 Rc8) is against the c-pawn. The direct 31... Re8 is answered with 32 c3 e2 33 Re1 and black has nothing! If 33 ... bxc3+ 34 Kxc3 followed by Kd3. A better try was 33 ... a5 34 cxb4 axb4 35 Kc2 Re3 36 Kd2 Ra3 37 Kxe2 Rxa2+ 38 Kf3 and black is a pawn up, but the rook isn't in the right position (ahead of pawn). The last position must be draw.   The another option 31... e2 leads to same position by transposition like  31 ... e2 33 Re2 Re8 34 c3",
        "31... Rc8 32. Rd3": "My opponent blunder and, right now, I am sure my position is winning. I must study, in the last move, the variation 32 Re1 Rc3!, where the black rook ties the white position and the black king must go to the center of the board to help the rook. But, in the said variation with the rook in c3, I need to reach f2 with the king by means to weaking the g3-square (I mean, advanced my kingside pawns). It's a very large plan but I believe I can play with patience",
        "32... Re8": "I take the initiaves. The main difference with the said variants we will see in the move 35 ",
        "33. Rd1 Kh7 34. Kb3 a5 35. c3": "Right now, where white tries to simplify the queenside, I use a simply tactic",
        "35... e2 36. Re1 Re3": "Now, white lost another pawn. ",
        "37. Kc2": "The idea 37 Ka4 is answered by means 37 ... bxc3 38 Kxa5 c2 39 Kb4 c1=Q 40 Rxc1 e1=Q 41 Rxe1 Rxe1. Similar variations if white plays 37 Kc4",
        "37... bxc3": "My first idea was 37 ... Rxc3+ 38 Kd2 Ra3 39 Ra1 b3 but I prefer take in c3 with the pawn and controls the move of the king. Stockfish agrees with me, but both line are winning.",
        "38. Kb3 Kg6 39. Kc4": "Too far with the king",
        "39... c2": "White resigns. Thanks! I hope it was pleasant and understandable. Comments are welcome. And the corrections, even more"
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=66042",
    "gameName": "Let's play chess",
    "players": "karpigutias (1593) vs. sogtulakk (1742)",
    "opening": "Scotch (C45), Schmidt variation"
}