{
    "moves": {
        "1. e4": "A very interesting game for me, from which I got 40 points.\nI danced and screamed after I won this :D",
        "1... e5 2. Nf3 d5": "My standard opening, I know is not the best available, I will try to think of a new one.",
        "3. exd5 Qxd5 4. Nc3 Qd6": "Again, I feel intimidated by knights. For a while I considered that knights are more valuable than bishops, but now I think they're both powerful if in good hands.",
        "5. d4 Nc6": "Protecting and attacking in the same time, I feel good about this move.",
        "6. Bb5": "... for a few seconds ...",
        "6... exd4": "Things are getting complicated, I take the pawn to make sure I get something.",
        "7. Nxd4": "I'm really scared when I see 2 knights in action, we have to clean the place a little :D",
        "7... Bd7": "Preventing check!",
        "8. Nxc6 Bxc6 9. Qxd6": "Oups, there goes my queen. ",
        "9... Bxd6 10. Bxc6+ bxc6": "2 pawns on the same line: I had to do it.",
        "11. O-O Nf6 12. Re1+ Be7": "Trying to protect the O-O",
        "13. Bg5": "You can't say he's not insisting ...",
        "13... Rd8": "Trying to get all weapons out",
        "14. Bxf6 gxf6": "Again, 2 pawns on a line: I had to.",
        "15. Ne4 O-O": " Good time to O-O ! Before the storm ...",
        "16. Re3 f5 17. Ng3 f4": "I regretted this move so much, I did it in a hurry: I had plans for my bishop and a rook (a plan that seemed very good and which I ruined with this move by loosing the bishop ... and the whole plan). \nBut what's done is done, I had think for a new plan.",
        "18. Rxe7 fxg3 19. Rxc7": "First idea was that I'm going to exchange the pieces and loose because of a few pawns. Very disappointed about my pawn move. Running after pawns did not look like a strategy for me, so I had to find something else. After some thinking I came with a plan (the only plan I could see for this game) while he was cleaning the place.",
        "19... Rd2": "Operation \"Cobra\".",
        "20. fxg3": "Forget my pawn, it's actually better with his pawn on the line, because he can't get his rook there as I'm planing to check the king. So, this move was in my advantage SO MUCH.\nAnyway the pawn was guilty ... so is not a waste.",
        "20... Re8": "The only plan I had.",
        "21. Rf1": "This should not be a problem for me, is not affecting my plan.",
        "21... Ree2 22. Rfxf7": "Still safe, nothing to worry about, he can't checkmate.",
        "22... Rexg2+ 23. Kf1 Rgxh2 24. Rfg7+": "I was not worried since he can't checkmate.",
        "24... Kh8": "See his pawn? Without that he could have put his rook on g1 or g2 protecting his king from checkmate!",
        "25. Rgf7": "He could avoid the checkmate by moving the king next to my rook, but he was to busy on my king.",
        "25... Rh1#": "My plan worked, although my plan initially was with the bishop and the rook, loosing the bishop was not so bad after all. I know this game is not much, but for me was the most \"thinking in advance\" I ever did. I put my basics on \"thinking in advance\", for a good future in chess."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=40836",
    "gameName": "Let's play chess",
    "players": "hpunktlienhard (1461) vs. theobserver (1356)",
    "opening": "QP counter-gambit (C40), Maroczy gambit"
}