{
    "moves": {
        "1. e4": "An open challenge taken up by someone who at the start was exactly the same rating as me. After reading some other annotations I was more aggressive than usual at the start and it paid off for me, though I can't help but feel it could have ended sooner.",
        "1... e5 2. d4": "Centre Game",
        "2... d6 3. Nf3": "Looking to develop quickly",
        "3... exd4 4. Qxd4": "I took with my queen partly to try to surprise my opponent.",
        "4... Nc6": "A calm and logical response",
        "5. Bb5": "This was where I had decided to be aggressive. Although I probably shouldn't have developed my queen so early, it can make life tricky for black.",
        "5... Bd7 6. Qd3": "Protecting the bishop and tempting Nb4",
        "6... Nb4": "My feeling is that this isn't the best move from black, firstly because he has now moved the knight twice, secondly because he still can't castle.",
        "7. Bxd7+": "Again possibly not the best move but this was in keeping with my plan to be aggressive.",
        "7... Qxd7 8. Qc3": "If black castles soon then my queen will be staring him down the c file.",
        "8... a5": "I don't like this move as it weakens the kings defence if he castles on the queen side. The knight is easy to shift with a simple a3",
        "9. O-O": "getting my king safe",
        "9... O-O-O": "Black looks to me to have put his king at some risk, the question is can I take advantage",
        "10. a3": "First lets shift that pesky knight, his options are limited and if he goes to c6 he is partially obstructing the black queens mobility",
        "10... Nc6 11. b4 b6 12. Nbd2": "I'm still not sure that something like Be3 may have been better here.",
        "12... f6": "I really don't understand blacks move here, this seems rather passive and it limits the moves his g8 knight can make",
        "13. Rb1": "My plan of action is to open a file to give me access to the black king",
        "13... axb4": "I would say black was better leaving my pawn alone.",
        "14. axb4": "And now I have a lovely a file to play with",
        "14... Kb7 15. Qa3": "Ra1 was better",
        "15... Ra8": "and this is why",
        "16. Qb3 b5": "Preventing b5 which not only pushes the knight out, but opens some more space around the black king",
        "17. Qd5 Kb6 18. Nc4+": "Sac to open space around the king, at the moment many of blacks pieces can only look on helplessly",
        "18... bxc4 19. Be3+": "Develops with tempo and pushes the black king back, but would b5 have been better?",
        "19... Kb7 20. Rba1": "I want to exchange so that I can gain control of the a file and eliminate one of blacks active pieces. Normally when you are attacking this may be ill advised but in this case my f rook would quickly get in on the action to make up for exchanging the a rook",
        "20... Rxa1 21. Rxa1": "Now I think white is looking pretty good, the question is, what are the best moves?",
        "21... Kc8 22. Ra8+ Nb8 23. Ba7 Kd8": "About the only option for black to continue the game.",
        "24. Rxb8+ Ke7 25. Rb7": "This was to prevent c6",
        "25... Ke8 26. Nd4": "Threatens Nc6 which traps the king on the back row with mate to follow, unfortunately for me black has a get out.",
        "26... Ne7 27. Rb8+ Nc8 28. Qa8": "I was a bit unsure what to try here, my plan in the end was to steam roller through the back rank. Note that as for much of this game, blacks options are limited.",
        "28... Be7 29. Rxc8+ Bd8 30. Ne6": "The exchange would be bad for black, e.g. QxN, RxB+, Kf7, RxR",
        "30... Ke7 31. Nxc7 Rf8": "Black s desperately trying to get some counter play, and would love to get a queen or rook on the first row.",
        "32. b5": "A bit unsure of what to do for best I decide to push my passed pawn. this has a temporary benefit of keeping the black queen from a4",
        "32... Rf7 33. Nd5+ Ke8": "I think this is best, e.g. Ke6 looks unpleasant for black after Bb6",
        "34. b6 f5": "I dont think this helps black much, I was expecting something like Re7 ",
        "35. Rc7 Qa4 36. g3": "Anywhere else and black could get a few more checks in",
        "36... Rxc7 37. bxc7": "And black resigned.\n\nThankyou for reading, please comment."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=39818",
    "gameName": "Let's play chess",
    "players": "elwoos (1517) vs. ajthechesster (1506)",
    "opening": "Centre game (C21)"
}