{
    "moves": {
        "1. e4": "typical KP opening...  \n",
        "1... e5": "mutual KP",
        "2. Qh5": "brought the Q out a \"little\" early in my own humble opinion, and unprovoked...?  I guess this is called the Patzer opening.",
        "2... Nc6": "defend my KP, without panic of his Q",
        "3. Bc4": "does he really think i am that easy of a CM?!?  ...though cannot blame him for trying, just setting his attack",
        "3... g6": "threaten his Q",
        "4. Bxf7+": "interesting move... eliminating my castle opportunity, while setting up another check",
        "4... Kxf7": "obvious D",
        "5. Qf3+": "retreat of his Q, with a check",
        "5... Nf6": "establish my knight, block his check",
        "6. a3": "rather passive in comparison to his previous 5 moves",
        "6... Nd4": "once he chose to be passive, i took the reigns as  the aggressor with a Q check and advancement of my knight.  hopes for a possible check (Nxc2 ) then take R (Nxa1)\n",
        "7. Qd3": "good move/defense... he noticed my plans for attack (Nxc2  to Nxa1) ",
        "7... d5": "seeing my opportunity to take full control the centre, i advance my QP",
        "8. Nc3": "good development of his knight to guard his KP and threaten my QP",
        "8... dxe4": "Q check which forces his knight to take my pawn",
        "9. Nxe4": "obvious D",
        "9... Qd5": "full control of the centre...  looking at Qxg2 once he moves his knight",
        "10. Ng5+": "smart move, though easily defended",
        "10... Ke8": "obvious D, didnt want to suffocate my R w/ Kg8 or my BB w/ Ke7 or Kg7",
        "11. Ng1f3": "smart, establishing his Knight while clearing out for a castle opportunity",
        "11... Bf5": "develop my WB; threaten his Q in order to prevent his plan to castle, while also providing protection for a check/fork of the rook; I view this as the defining point in the match to take full control",
        "12. Qc3": "no factor",
        "12... Nxc2+": "plan development",
        "13. Kd1": "i might have chose another option to move the K",
        "13... Nxa1": "plan executed",
        "14. Qxc7": "bad choice for a mere pawn; leaving K exposed to many threats",
        "14... Qb3+": "check, a few options available; wait to see what develops",
        "15. Ke1": "obvious move",
        "15... Rc8": "threaten Q while developing another piece to put this match in the books",
        "16. Qxe5+": "obvious D, move Q w/ a check",
        "16... Be7": "block check while defending Knight",
        "17. Nd4": "another unwise move, it seems more out of desperation than anything",
        "17... Rxc1+": "its almost over now",
        "18. Ke2": "only move available",
        "18... Qd3#": "OVER; really in control of the entire match.  Once an opponent brings the Q out on move #2 it almost over before it begins."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=4593",
    "gameName": "Let's play chess",
    "players": "michaeldommer (1367) vs. rieffer (1457)",
    "opening": "KP (C20), Patzer opening"
}