{
    "moves": {
        "1. e3 e5": "Amsterdam Attack. The main line continues 2. c4 d6 3. Nc3 Nc6 4. b3 Nf6.",
        "2. Nc3 Nf6 3. Nge2 d5": "An ambitious move on my part that may prove a liability later on.",
        "4. d4": "Solid response - establishes a pawn presence in the centre and threatens to win a pawn with dxe5.",
        "4... Bd6": "Also possible was 4... e4, but this is open to attack after 5 f3.",
        "5. a3 Nc6 6. dxe5 Bxe5 7. Nf4 Bf5 8. Nfxd5": "The move I had missed.",
        "8... O-O 9. e4": "A dubious move by white, as my next move shows, regaining a pawn.",
        "9... Nxe4 10. Bd3 Nd6 11. O-O": "At this stage, I probably had a slight edge, with my bishop pair a more powerful force than white's bishops. However, the game could still easily have gone either way.",
        "11... Nd4 12. Bxf5 Nd6xf5 13. Re1 Re8": "Reluctant to allow white control of the e-file.",
        "14. Qd3 c6 15. Ne3 Qd7 16. Nxf5 Qxf5 17. Qxf5 Nxf5 18. Ne2 h6 19. Bf4 Bxb2": "A cheap material snatch.",
        "20. Ra2": "Rab1 would have forced the b-file semi-open but losing another pawn on a3.",
        "20... Bf6 21. Kf1 b5 22. Ng3 Rxe1+": "Swapping off material to try and enter an advantageous endgame.",
        "23. Kxe1 Nxg3 24. Bxg3 a5 25. Bd6 Bc3+ 26. Kd1": "A blunder. Underestimates the power of the pin on d8.",
        "26... Rd8": "The white bishop is now lost, and I was free to take it at any time.",
        "27. a4 b4": "27... bxa4 28 Rxa4 and the white rook is freed. This keeps the white rook in isolation for a while yet.",
        "28. Kc1 Rxd6": "White abandoned the bishop to its fate, so I took it.",
        "29. Rb2": "?? To me, this seems to be a blunder. By exchanging bishop for rook, I was able to take a massive lead over white. His only advantage over me at this point was a more active king, but only marginally so - the d-file is blocked and my pawns block a3, c3 and b5.",
        "29... Bxb2+ 30. Kxb2 f5 31. f4 Kf7": "I considered Rd4 to stop the white king coming out via c4 but this is weak to 32 c3 bxc3  33 Kxc3. (32... other move 33 cxb4 axb4 and I have to stop white's a-pawn, a headache I didn't need.)",
        "32. Kb3": "Aiming for c4, as I feared.",
        "32... Ke6": "Now Kc4 can be met by 33... Rd5 and the white king is kept away from a5. More importantly, I can use my better placed king and rook to mop up white's king-side pawns.",
        "33. Kc4 Rd5 34. g3 h5 35. Kb3 Rc5": "c3 can be met by bxc3, and c4 by bxc3 e.p.",
        "36. c3 bxc3 37. Kc2 g6 38. h4": "At this point, white resigned. Although he had managed to free his king, moving it would let me promote my c-pawn, with victory sure to follow. Thank you for reading this. Comments are welcome."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=17842",
    "gameName": "Let's play chess",
    "players": "ollyon1 (1200) vs. fish613 (1200)",
    "opening": "Amsterdam attack (A00)"
}