{
    "moves": {
        "1. e4": "This was a case of what David Bronstein calls \"milking a cow\": I obtained a small advantage and then gradually turned the screws until my advantages became overwhelming, culminating in checkmate.",
        "1... e5 2. Nf3 Qf6": "Already, Black is at a positional disadvantage. Way too early to move the Queen.",
        "3. Nc3 c6 4. d4": "Now I have central pressure.",
        "4... Bb4 5. Qd2 exd4 6. Qxd4": "I will end up with a central advantage and a plus in development.",
        "6... Bxc3+ 7. bxc3 Qxd4 8. cxd4 d6": "Black's opening has been very weak. All I have to do is begin tightening the screws.",
        "9. Bc4 Be6 10. d5 cxd5 11. exd5 Bf5 12. Nd4 Be4 13. O-O": "My Rook will soon take over the e-file, while Black's development is badly lagging.",
        "13... Nd7 14. Re1 Ngf6 15. f3": "The pin is mightier than the sword. Black has no way to avoid losing the Bishop. If Black had been able to castle more quickly, his Bishop wouldn't have been exposed to the pin.",
        "15... Rc8 16. Bb5": "Now two of Black's pieces are pinned. Resignation wouldn't be a bad choice.",
        "16... O-O": "Way too late.",
        "17. Bxd7 Nxd7 18. Rxe4": "Now it's a matter of technique. I'm a piece up in what is essentially already an endgame.",
        "18... Ne5 19. Nb5 Rxc2 20. Nxd6 Nd3": "Black must press forward. Passive play = certain defeat.",
        "21. Bf4 Nf2 22. Rc4": "Either Black submits to the exchange of Rooks or he loses more material.",
        "22... Rxc4 23. Nxc4 Nd3 24. Bd6 Rd8 25. Rd1": "With Black being forced to retreat his Knight, his drawing chances vanish.",
        "25... b5 26. Ne5 Rxd6 27. Rxd3": "The exchange of minor pieces only helps me.",
        "27... a5 28. Nc6 a4 29. a3": "Black's Queen-side Pawns are now frozen and primed to fall.",
        "29... b4 30. Nxb4": "Now I have to move Black's Rook out of the way to advance my passed Pawn.",
        "30... h5 31. Na2 f5 32. Nc3 g5 33. g3 h4 34. Nxa4 hxg3 35. hxg3 Kf7 36. Kf2 Kg6 37. Nb2 Kh5 38. Nc4": "After some time-wasting on the King-side, I put my plan into action.",
        "38... Rd7 39. d6 Rd8 40. d7": "I was shocked when Black didn't resign here. He wants to play it out to the mate.",
        "40... g4 41. f4 Kg6 42. Ne5+ Kf6 43. Nc6 Rc8 44. dxc8=Q Kg7 45. Qe6 Kh8 46. Rd8+ Kg7 47. Rd7+ Kf8 48. Qf6+ Ke8 49. Qe7#": "I oblige him."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=28112",
    "gameName": "Let's play chess",
    "players": "thehellion (1288) vs. kokitov (1187)",
    "opening": "Greco defence (C40)"
}