{
    "moves": {
        "1. e4 c5 2. Nc3 e6 3. Nf3 Nc6 4. g3": "If White is going to play a Closed Sicilian, I can't help think that he's better playing 3. f4 or 3. g3 (with Nge2).",
        "4... d5 5. exd5 exd5 6. Bg2 d4": "White has the piece development, Black establishes a wedge in the centre.  The downside is the latent power of the Bg2.",
        "7. Ne2 g6": "Where to put the bishop?  Bd6 achieves very little, whilst Be7 is just a bit passive for me.  ",
        "8. O-O Bg7 9. d3 Nf6 10. c3": "White has to try to break the centre I suppose, although I can see that 10. c4 and playing for a reversed Benoni/Benko type position is interesting. ",
        "10... dxc3 11. bxc3 O-O": "Black's position is OK here, although if I'd thought about White's next move, I might have been tempted to shore up the c5 pawn somehow - perhaps I should be looking to play Bg4 or Bd7 at this stage.  11. ... Bg4 12. Ba3 b6 13. Nfd4 Nxd4  is interesting.  By contrast with the game line, Black can develop his Q-side, but will his king get stuck in the centre?",
        "12. Ba3": "The advantage of 10. c3 - White attacks c5, completes his development and threatens to blow open the long diagonal.",
        "12... b6": "I was comfortable with the idea of 13. Ne5 Nxe5 14. Bxa8.  14. ... Bh3/g4 or even Ba6 all emphasise that White's white squares can be as drafty as mine and the Bg7 outperforms the Ba3.",
        "13. Nfd4": "Variations on a theme, although I had been expecting 13. Ne5 as per the last note.  Material is going to have to be sacrificed for positional gain.",
        "13... Nxd4": "Better than 13. ... cxd4 14. Bxc6, not least because I manage to keep the c5 pawn for a couple of moves with a view to preserving at least one of my rooks.",
        "14. cxd4": "There's no rush to play Bxa8 - Black has made it quite clear that the rook isn't going anywhere. ",
        "14... Bg4 15. Bxa8 Qxa8": "And so the first positional sacrifice is made.  White's white squares are weak, his king is weaker than with the bishop still on the board, and Black has control over both diagonals.  In my view, there's reasonable compensation there.",
        "16. dxc5 Re8": "There's no point in playing 16. ... bxc5 - Black's idea is to be dynamic in this position and to utilise the weak squares in the White camp to keep in the game.",
        "17. Re1": "Forced, not least because 17. f3 Bxf3 wins back a pawn, opens up the king and maintains the threats.  \n\nTIMEOUT: Can you see Black's tactic to win back his piece?",
        "17... Nd5 18. d4": "18. Rc1 meets with the same reply which is ...",
        "18... Nc3": "Black's compensation bites.  The Ne2 is indefensible, so White gives back his extra piece in a slightly unusual way.",
        "19. Nxc3 Bxd1 20. Rxe8+ Qxe8 21. Rxd1 bxc5 22. Bxc5": "The dust settles.  Material equality is re-established.  It's hardly a queen sacrifice when you're a piece up and you're getting another rook and a passed pawn for it, but the position is still highly dynamic and difficult for both sides.  For White, the obvious plan is to try to push the d-pawn, supporting it with his pieces which can chase Black's queen away.  For Black, the plan is less obvious.  TIMEOUT.  What is Black's plan in this position?",
        "22... Qc6": "My first plan is to tie up as many of White's pieces as possible with my queen.  The knight worries me more than the bishop (as long as I can blockade the pawn before it gets to d7), so this move is designed to stop the Bc5 from moving, and stop the d4 pawn from advancing. ",
        "23. Re1": "TIMEOUT: Can Black tighten the zugzwang?",
        "23... Bf8": "I like this move.  The idea is to meet 24. Bxf8 with 24. ... Qxc3 where 25. Re8 (threatening Bh6#) loses to 25. ... Qc1+ 26. Kg2 Qc6+",
        "24. Re5 f6": "The Bf8 remains safe for similar reasons as before.  White gets himself into a bit of a pickle here, because of the threat of Bxc5.  24. Ne4 f5 looks pretty good for Black so maybe the move played is best, no matter how ugly the position gets. ",
        "25. Rd5": "TIMEOUT.  How does Black make the most of the zugzwang?  The Nc3 defends the Rd5 which defends the Bc5, which blocks the attack on the Nc3.  ",
        "25... Kf7": "Black brings his king into the game, mindful, always, of the possibility of Bxf8.",
        "26. f4 Ke6 27. h4 Be7": "Black completes the zugzwang on White's pieces - now the Rd5 has no escape squares and White is left to push his pawns.  I don't know if White fancies his chances here.  Given the material balance, I thought that my starting point should be to hold the draw rather than try to force a win.  I think it's important to realise that in the current position, simply removing all the K-side pawns can only be to White's advantage.  If White can get to a R+N+1 v Q endgame with all the pawns off the board, Black faces a long fight for a draw.",
        "28. h5": "TIMEOUT: What is Black going to do about the pawn position?  Which is most important pawn?  What benefit can he seize from White's problems with his pieces?",
        "28... a5": "Alfie the a-pawn is our hero.  Having frozen White's position, it is imperative to play a5-a4-a3 if at all possible, so that if I can pick up the a2 pawn, there's only two small steps to adding to my material.",
        "29. g4": "Does White fail to appreciate Black's plan?  \n29. a4 could be met by 29. ... Bxc5 30. cxd5 (30. Rxc5 Qf3!) Qxd5 31. Nxd5 Kxd5 and Black looks to have the winning chances in the K+Ps endgame. ",
        "29... a4 30. f5+ Kf7": "Not 30. ... gf 31. gf+ Kf7 when the lack of K-side tension can only assist White.",
        "31. fxg6+ hxg6 32. hxg6+ Kxg6": "TIMEOUT: 4 pawns have dropped off the board and it's worth considering whether White or Black has managed to improve his position as a result.  White is still in zugzang but the less Black pawns are left on the board, the harder it is for me to achieve anything, and if White can activate his king, my queen is going to struggle to hold back the tide. ",
        "33. Kf2 a3": "Completing my plan from move 28.  What's next?",
        "34. Ne2 Kf7": "Not 34. ... Qxd5?? 35. Nf4+ 1-0",
        "35. Nf4": "White has finally freed up the Bc5 by shifting his knight to f4, but has that left open the door?",
        "35... Qa4 36. Ke3 Bxc5": "If 36. ... Qd1, White plays Rd7 which is rather embarrassing.",
        "37. Rxc5 Qd1 38. Rc7+": "TIMEOUT.  More material has gone and again it's worth taking stock.  Can Black do anything with the a-pawn, or will White smash through with the d-pawn, supported by his rook and knight?  What is Black's plan?",
        "38... Ke8 39. Nd5": "Black's king is stuck on the back rank and one of his pawns is going to drop.  Time to get active.",
        "39... Qg1+": "Feinting at the g4 pawn when in fact it's the a2 pawn that I'm targeting.  If can pick up that pawn by checking with the queen, perhaps we can do something with this position. ",
        "40. Kd3": "40. Ke4 (the only other move to defend d4) is met by Qg2+ picking up the Nd5 (and then the a2 pawn)",
        "40... Qb1+ 41. Ke3 Kd8": "41. ... Qxa2 42. Nxf6+ is just giving White a tempo.  I can attack the rook, because the Nd5 can't move.  Can White find a decent move?",
        "42. Ra7": "Obvious, but nothing saves the a2 pawn.",
        "42... Qxa2 43. Ra8+ Kd7 44. Nxf6+": "TIMEOUT: Suddenly White has two passed pawns, a5-a4-a3 is looking useful, my king is looking over-worked and the game is still unclear.  First things first (as my Dad would say), let's see about stopping that g-pawn.",
        "44... Ke6 45. Ra6+ Kf7 46. Nd7": "White tries to get his knight back to take a3.  If he can exchange his knight for the pawn, I have problems.  The king can look after one of the pawns, but the queen is going to struggle against the other one. ",
        "46... Qb1": "A relatively simple tactic.  47. Rxa3 Qc1+ means that White doesn't have time to get his knight back. ",
        "47. Ne5+": "even with checks.",
        "47... Ke7 48. Ra7+": "TIMEOUT: Having said that I want my king to stop his g-pawn, how do I make progress?",
        "48... Kd8 49. Ra8+ Kc7 50. Ra7+": "It's all very well bringing my king across to the Q-side, but I'm going to have to dash back in a second.  Where do I go now?",
        "50... Kc8": "!  That's one of my best of the game.  50. ... Kb8? blows it.  51. Nc6+ Kc8 52. Ne7+ and my king has to head back to the K-side. ",
        "51. Ra8+ Kb7": "Now the king is safe from checks and White has to make a tough decision.  ",
        "52. Rxa3 Qc1+ 53. Ke4 Qxa3": "Black is now clear material up, but one slip and he'll lose this.  ",
        "54. g5": "White, sensibly, pushes the g-pawn.  What's the point of luring my king to the b-file otherwise?",
        "54... Qf8 55. g6 Qf6": "The zugzwang theme reappears.   That's g6 and e5 tied up whilst I get my king back into play.",
        "56. Kd3 Kc7 57. Kc4 Kd6 58. Nf7+ Ke7 59. Ne5": "Now my king can cover the g-pawn, it's time to activate my queen again.",
        "59... Qe6+ 60. Kb4": "Not good, although the response isn't obvious. \nTIMEOUT:\n\n60. Kc5 Qd6+ 61. Kc4 Qe6+ 62. Kc5 Qc8+ 63. Nc6+ Kf6 64. d5 Qf5 is another use of the zugzwang.\n60. Kc3 Qd5 61. Kd3 Qb3+ 62. Ke4 Ke6 forces something to give.  Interestingly in these lines, the g6 pawn has to sit and await its fate, as g7 leaves it too exposed. \n\nWhat's Black's next move after 60. Kb4?",
        "60... Qc8": "Separating the white king from the d4 pawn.",
        "61. Kb3 Kf6": "More zugzwang.  White can't play g6-g7, or Ne5-anywhere, or d4-d5",
        "62. Kb2 Qc7": "Another little waiting move.  Hands up if you saw that one.  Be honest.",
        "63. Kb3 Qc1": "Because you all wanted to play that, didn't you?",
        "64. Kb4 Qc2": "Oh yes.  White is squeeeezed.",
        "65. Nc4": "White's pips burst, g6 drops and Black moves inexorably towards his goal.  65. Kb5 Qc3 carries Black's plan to its end, d4 falls and the game is over.",
        "65... Kxg6 66. d5 Kf7": "The king keeps busy.",
        "67. Nd6+ Ke7 68. Nc4 Qd1": "Repositioning the queen for one final invasion.",
        "69. Kc5": "White finally has enough and resigns.  0-1\n\nI'm still not sure whether it's premature - the win isn't immediately obvious, although Qh5 (preventing d6) 70. Kc6 Qe8+ gets the queen back around to the correct side of the pawn and allows the king to go on a foray after the White knight, whereupon I should be able to pick up the pawn.  After that, blunders aside, the knight will fall and the game will end.  "
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=30450",
    "gameName": "Let's play chess",
    "players": "xiangzhi (1774) vs. dsb13 (1923)",
    "opening": "Sicilian (B23), closed, Korchnoi variation"
}