{
    "moves": {
        "1. e4 c5 2. Qf3 Nc6": "What I don't like about e6 here is that he can push with 3) e5. But, after 3) e5, I can do Nc6 and how does he defend the pawn? He can't use the d pawn because of my c pawn's central presence. He can't use the g Knight because of his queen being in f3. Can't use his c bishop (at least immediately because it's blocked by his own pawns. He can only use the queen. By moving his queen (twice at this point) in the opening around the board I might be able to attack it by developing my other knight to f6, pushing my pawn to d6, depending where he moves his queen to defend the pawn.",
        "3. Bb5": "Very accustomed to facing Bc4 here and using a double attack on the queen and bishop that also defends checkmate. This is a variation that must be solved as it gave me some difficulty.",
        "3... Nd4 4. Qd3 a6": "Could have just taken the bishop with Nb5 here instead. The consequences to that are to be explored later.",
        "5. Bc4 b5": "5)... b5 might be a mistake. I gain \"space\" in the queenside but he gains an attack on my rook . After 7) c3 position might be uncomfortable for black.",
        "6. Bd5 Ra7 7. c3 Nc6": "Ne6 and pawn to e6 were considered but ultimately dismissed for this move. I know I can potentially lose castling with this move but an exchange of queens and a bishop for my knight and my queen is not too bad in terms of material and without the queens it's a bit safer for my king to not have the castling ability vs having queens and more pieces on the board. The more pieces on the board the more dangerous it is for the king to stay in the center usually, unless it's somehow a very fixed position or board where pawns are stuck against each other and bishops, knights, rooks, queens are cramped.",
        "8. Qf3 Bb7": "b7 is a blunder. There's mate in one with Bxf7 or Qxf7. I must've been high. I was high..",
        "9. d4": "since he had mate in 1, d4 is a blunder here."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=66390",
    "gameName": "Let's play chess",
    "players": "gomaxgo (1131) vs. ricardoandrestn (1200)",
    "opening": "Sicilian defence (B20)"
}