{
    "moves": {
        "1. d4": "I won't anotate the whole game, very classical queen gambit play",
        "1... d5 2. c4 e6 3. Nf3 Nf6 4. g3 Bb4+ 5. Bd2 Bxd2+ 6. Nbxd2 O-O 7. Bg2 c6 8. Qc2 Nbd7 9. O-O b6 10. e4 dxe4 11. Nxe4 c5 12. Nxf6+ Qxf6 13. Ne5 Rb8 14. Nc6 Rb7 15. Ne5 Nxe5 16. dxe5 Qxe5 17. Bxb7 Bxb7 18. f3 Qe3+ 19. Qf2 Qg5 20. Rad1 Qf6 21. Rd7 Rb8 22. Rfd1 h6 23. Rd1d3 a5 24. Qe2 Ba6 25. b3": "White has a slight advance but a weak king and all his pieces are on white squares, vulnerable to a LSB attack. White controls the open file but the black pieces on the queen side are dangerous.",
        "25... b5": "good move, white cannot take",
        "26. Rd3d1": "Rook of the bishop fireline and preventing a further Qa1",
        "26... bxc4": "good move If white takes : 27. bxc4 ; 27... Rb2 and white is in serious trouble",
        "27. Ra7": "So that white decides not to take",
        "27... Bb7": "menacing to take the f3 pawn.",
        "28. Kf2": "to protect f3 but the white royal pair is subject to a further Rb2 and the white queen will be lost.",
        "28... Bd5": "puting pressure on b3 and f3",
        "29. Rxa5": "A free pawn is not somthing to neglect",
        "29... cxb3": "Now white is in serious trouble",
        "30. axb3": "Forced move",
        "30... Rxb3": "Black has several menaces : Rxf3+  Bxf3 and Rb2 are equally dangerous.\nBut this move is a mistake. White has only one move but it's the beginning of a winning sequence and I was very happy to have found it 2 moves before.",
        "31. Rxd5": "!\nThis annihilates the attack on f3 and if 31... Rb2 ; 32. Rd2 does the job.",
        "31... exd5": "Black takes and has now material advantage but not for long.",
        "32. Ra8+": "! Black has only one move available",
        "32... Kh7": "only move - the black rook hangs",
        "33. Qc2+": "fork attack",
        "33... g6": "33... Qg6 was another option, not better.",
        "34. Qxb3": "Now white has a material advantage.\nBlack's only hope is to promote one of the passed pawns but white's winning sequence is not finished.",
        "34... c4": "Only 3 squares before promotion.",
        "35. Qb8": "Mating menace. Black has only one move.",
        "35... Qd4+": "Clever, for it forces the white king to go away from  the center where it could block the passed pawns.",
        "36. Kg2": "king in safety. Not that black cannot hope for permetual chess because the white king can go to h3",
        "36... Qg7": "only move to avoid the mate",
        "37. Qf8": "forcing the queen exchange",
        "37... Qb2+": "to fire the white king further away",
        "38. Kh3": "King in safety",
        "38... Qg7": "only movz",
        "39. Qxg7+": "exchanging the queens",
        "39... Kxg7 40. Rd8": "It's over."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=64608",
    "gameName": "Let's play chess",
    "players": "ptitroque (1862) vs. ragnar (1795)",
    "opening": "QGD Slav (D30)"
}