{
    "moves": {
        "1. e4 e5 2. Nf3 d6 3. d4 exd4 4. Nxd4 c5": "Interesting choice here for black.  It later becomes obvious to me that I have a better grasp of the pawn game than fermoncada does, but at least early on he uses them forcefully.",
        "5. Nf3 Bg4": "Ye olde knight pin.  I'm a fan.",
        "6. Be2 Bxf3": "Interesting choice by black to trade knight for bishop here after opening the board up by taking pawns.  I wondered what he was up to.",
        "7. Bxf3 Be7": "Complete violation of the Knights-Before-Bishops rule of thumb.  I would've done Nc6.  I expected his bishop to come out to f6 and attack the center, but I think he was just making room to castle.",
        "8. Nc3": "I'm feeling pretty comfy with the center at this point.",
        "8... Nf6": "Why bring the bishop out if you're just going to block it in??  I don't get this move at all except in the \"castle ASAP\" idea.",
        "9. Bf4 O-O 10. Nd5": "I'm feeling a little aggressive here.  Probably not the best idea since it'll let his black bishop out, now that I think about it.",
        "10... Nxd5 11. Qxd5": "And out comes my queen.  I considered the pawn take, but I figured the queen up here was gonna be a thorn in his side.  Now I'm threatening b7, and he's got to watch out for d6 and f7.  And thanks to his earlier bishop trade and pawn trade, he's got nothing to scare her away with.",
        "11... Qb6": "Counter-attack by threatening b2.  Nice move.  I consider castling queenside, but figured I could just as easily counter with...",
        "12. b3 Qc6": "I don't get this trade. Why come here?  I admit my queen is in a better position than his, but hell, the board opens up more and I have both bishops.  Plus I get to mess up his pawn structure.",
        "13. Qxc6 bxc6 14. c4": "The best part of that queen trade for me is this position.  I have for now completely shut down his queenside pawns.  He's got nothing he can do there for a while.",
        "14... Na6": "I spent a lot of time analyzing this position.  It was clear that black intended knight to b4 to c2 for a fork.  The problem was that anything that prevented the fork was at risk of walking into a trap.  I considered 15. Bd2 for some time, but then the knight could go to d3 and cause trouble.  Any attempt to stop the fork by using the a1 rook would hang the a2 pawn and allow black's rook to move to b8 and undermine the pawn structure.  It was a complicated decision to castle, but in the end, I decided I could neutralize both the fork and the problem of Nd3.\n",
        "15. O-O Nb4": "As expected.  Black probably figured it was win/win - if the a1 rook moves, the a2 pawn hangs.  If not, Nc2 can challenge it while keeping the f-rook locked down.\n",
        "16. e5": "This move was intended to open up the d file for my rook, and prevent d5 later.\n",
        "16... dxe5 17. Bxe5 Nd3": "I figured black wouldn't be able to resist Nd3 here attacking the unprotected bishop.  Nc2 was suicide by this point.\n",
        "18. Bc3": "It's a careful dance.  I want to keep the black knight as locked down as possible.  This move makes black's only knight move to f4 that accomplishes little.  Meanwhile he's blocking the d file and keeping black's rooks from claiming it.  I'm planning Bxc6 to win the pawn.\n",
        "18... Rad8": "Black either anticipated Bxc6 and wanted to move the rook out of danger early, or expected 19. Be2 or Be4, which would threaten the knight.  I honestly don't like those moves because they just push black's knight away.\n",
        "19. Bxc6": "Free pawn and now black's f8 rook is locked down.\n",
        "19... Nf4": "Black moves his knight out, freeing up the d file for his rook, and leaving it ready to defend the bishop at e7 if need be.  A good move, but he's forgotten that the knight was the only thing keeping me off the e1 squarerook...\n",
        "20. Rfe1": "Simple and direct.  I'm expecting Ng6 here.  I would then respond with bringing the a1 rook into play on d1 and challenging black's control of that file.  The queenside pawns are also waiting to become a nice battering ram that will lock down black's rooks.  I'm feeling pretty good about this position.\n",
        "20... Rfe8": "Big blunder.  Forgetting the knight completely, black hangs his rook.\n",
        "21. Bxe8 Rxe8": "I win the exchange and now have the d-file all to myself.\n",
        "22. Rad1": "I'm clearly winning here, but need to be cautious.  I see Rd7 in my future and then a peaceful walk up the a or b files to queen.\n",
        "22... Ne6": "He's got plans for his bishop, I see.  This lets it move without risking back-rank mate, and his knight can enter the battle on either side from here.  Solid move.",
        "23. Rd7": "Time to harass that a-pawn.",
        "23... a6": "Obvious move.  a5 would fall to the bishop, and Ra8 loses his bishop.",
        "24. a4": "Just making sure he comes up no farther.",
        "24... Bf6": "He's offering a bishop trade.  I'm up material, so hell yes.  He thinks he's saving his a-pawn.  He's wrong.",
        "25. Bxf6 gxf6 26. Ra7": "I want that a-pawn.",
        "26... Rd8": "Interesting move this one.  I really did not see what he had planned, and paid for it later.",
        "27. Rxa6 Nd4": "Here's an interesting position.  He's wanting my b3 pawn for his f6 one.  I thought I could stop him by pinning the knight to his rook.  Big mistake.",
        "28. Rd1 Ne2+": "Oops.  I give back the exchange I won before.  I'm still up in pawns and still have a much better position afterwards, but ouch, this hurts.",
        "29. Kf1": "To state the obvious, Kh1...Rxd1#.  This is forced.",
        "29... Rxd1+ 30. Kxe2": "I saw where this was going.  He wanted to harass my kingside pawns now.  I was gonna have to shut that down quick.",
        "30... Rh1 31. h3 h5": "He's stopping g4, for now.  If I do it, it'll free his rook up in exchange for nothing.",
        "32. Rxf6": "One advantage of my screwup is that his rook is stuck behind my lines for now and mine is out and about.",
        "32... Rb1": "And here's where I make a second mistake, though this one's not nearly as bad.  From here, Rf5 is completely dominating.  He gets one of my pawns and I get one of his.  I can then pretty confidently force a rook trade and win the king&pawn endgame.  Instead I defend, which extends the game significantly.",
        "33. Rb6": "The reason I made this mistake is because I saw an interesting rook dance forming here and was intrigued by it 'cause I rarely get to play this rook-v-rook endgame.  I figured I could force his rook into stagnation on the a-file and I was right.",
        "33... Kf8": "He sees it coming and starts trying to activate his king.",
        "34. a5": "It won't work, however.  His king can't make it in time even if my rook lets him.",
        "34... Rb2+": "I'm guessing he was hoping I'd dodge to d3 or d1 to try and attack his rook, which would've set said rook loose on my pawns.  Fat chance.",
        "35. Kf3": "and just like that all my pawns are covered AND his kingside play is shut down.  He has nothing now but to try and hold for a draw.",
        "35... Ke7": "He seems to go back to plan A: kill the a-pawn.  This was a small mistake.  The a-pawn is safe no matter what, as you'll see.",
        "36. a6 Kd7 37. a7": "He can threaten my rook by going to c7, but then I queen.  His only chance is to prevent that with his rook at the same time.",
        "37... Ra2": "which he tries.  But here's where the king's presence at d7 helps me.  If he'd been at d8, my plan still would have worked, I think, with Rb8+...Kc7, a8=Q...Rxa8, Rxa8 and I've won the rook.  It's mop-up afterwards.  But this way I lock his rook down and start a kingside attack.  Slower to be sure, but I've pretty much won the game by this point.",
        "38. Rb7+ Kc8": "Rb8+...Kc7, a8=Q would've traded rook for pawn, and I missed that.  I'd found a way to win and didn't want to deviate, even though this would've won faster.  It's a bad habit I'm working on.",
        "39. Rxf7": "Since I missed winning the rook, I follow my plan.  Taking out the f7 pawn means the kingside is almost clear.  Trying to bring up the f2 pawn would be a mistake - his king is too active.  I have other plans.",
        "39... Kd8": "From here on out, all he can do is pray I blunder.",
        "40. g4": "Why g4?  Well, I force him to remove his last pawn that can do anything or let me pass at full throttle.  The sad thing is that even now I could've done Rf8+...Ke7, a8=Q and he loses his rook.",
        "40... hxg4+ 41. hxg4": "So now I have the passed g-pawn, the a-pawn, and the f-pawn.  That's WAY too much for him to defend.",
        "41... Ke8 42. Rb7": "My God.  Looking back on this game there were so many opportunities to win his rook.  In the end, he had to GIVE it to me.",
        "42... Kf8": "He's defending the g-pawn.  It won't help, but damn it.  I STILL had Rb8+.",
        "43. g5 Kg8": "I basically have free run of the board with my king.  Do I wander over and take his c pawn then walk up the c file?  Do I escort my g-pawn up to queen?  It's all up to me.  and I STILL fail to see Rb8+.",
        "44. Kg4": "From here on out I'll just assume you all know how much of an idiot I am for not just winning his rook.\n\nThis move was key, believe it or not.  Kf4 seems a better move at first glance, but once you see Rxf2+ you see he can harass my king all the way to the bank.  ",
        "44... Rxf2": "Clever move here.  He's defending the queening mate.  Won't help, but credit where it's due.  fermoncada fought hard the entire match.",
        "45. a8=Q+ Rf8 46. Qxf8+": "Heck yes I'll take that rook.  From here it's a game of choose-how-I'll-mate-you.  Took me long enough to win that rook, though.  Sheesh.",
        "46... Kxf8": "At this point we are well into my endgame comfort zone.  I've planned out every possible move.",
        "47. Kf5 Ke8 48. Kf6 Kd8 49. g6 Ke8 50. g7 Kd8 51. g8=Q#": "Well played, fermoncada."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess-http-gameknot-com?gm=43721",
    "gameName": "Let's play chess, http://gameknot.com/",
    "players": "ltchrysalis (1229) vs. fermoncada (1220)",
    "opening": "Philidor (C41), exchange variation"
}