{
    "moves": {
        "1. d4": "This was a long tough game for me. Over the period of our game both our ratings fluctuated, mine quite wildly. For me this makes the game more intriguiing. I hope you enjoy it It was one of the most enjoyable games I've played for a while.",
        "1... d5 2. c4 Nf6": "Queens Gambit declined, Marshall Defence",
        "3. Nc3 Bg4": "I don't often play this, my intention was to temporarily pin the e pawn",
        "4. f3": "slightly weakens the king side defence should he castle there. This also severely limits the possibilities for his knight ",
        "4... Bh5": "Again not a move I would normally play but this was intended to keep some pressure applied.",
        "5. Qc2": "Looking for e4\n\nThis takes us out of the Gameknot database",
        "5... Bg6": "This is a poor move that loses me a tempo",
        "6. e4": "White merely continues as planned",
        "6... e6": "Supporting the d pawn and opening a line for the dsb",
        "7. a3": "I'm not sure this move is necessary, though it does support a potential b4. It also suggests that white is thinking of king side castling, however none of his peices on that side are developed",
        "7... c6": "Further supporting my d pawn. I am not concerned about restricting my knight as I am looking to move the knight on b8 to d7. The pawn move also opens a line to a5 for my queen. If the queen is on a5 then Bb4 is a threat to white who can't take the bishop with his pawn or he will lose his rook. If white was better developed on the king side this would not be so much of a threat",
        "8. Bd3": "White is probably looking at e5 but I didn't see that at the time",
        "8... Bd6": "This is a blunder",
        "9. e5": "White continues with his plan but now has a bonus, not only the fork but the lsb is under pressure too",
        "9... Bc7": "This was about the best move I could see under the circumstances. It means that if I castle queen's side I have a little more protection for my king",
        "10. Bxg6 hxg6": "On the bright side my h rook gets a half open file. ",
        "11. exf6": "Opens the possiblity of Rxh2 which regains me a pawn and means that white can't castle kings side",
        "11... Qxf6": "I'm still not sure if this a mistake as gxf6 would give me a strong cluster of pawns near the centre. ",
        "12. Be3 Nd7": "Looking to castle",
        "13. O-O-O": "gives more support to the white d pawn",
        "13... Nb6": "I probably should have castled here. But my knight was eyeing up c4 and then a5 if forced. It is going to be hard to dislodge from that area",
        "14. c5 Nc4": "continuing as planned",
        "15. Bf2 Qg5+ 16. Kb1": "pretty much forced otherwise I could regain material",
        "16... b5": "This is what I can only describe as a calculated risk. If white takes the pawn en passant it could open the a file for my rook. ",
        "17. g4": "He declines and preserves his g pawn. At this point I was trying to work out how to dislodge his dsb as Ne3 was sorely tempting",
        "17... f5": "Hoping that I can bring the pawns in to help and undouble them in the process",
        "18. h4 Qf6": "I think this may be a mistake and that Qe7 is better as my queen is more mobile on the 7th rank",
        "19. g5 Qf7 20. Nge2": "White has been looking to do this for some time. I have deliberately avoided forcing the move",
        "20... O-O-O": "I figured here that the position is sufficiently closed that I was relatively safe. Castling short seemed to risky",
        "21. Ka2": "Not sure of the point of this but I suspect he is worried about my a and b pawns and my knight",
        "21... e5": "this is the start of a pawn push in the centre to open some lines for my queen towards the white king and my dsb if he takes the exchange",
        "22. b3": "He finally gets to move my annoying knight",
        "22... Na5": "Running to the bolthole that has been kept available for it. White can be happy with this as it blocks the a pawn from pushing forward",
        "23. Rdf1": "lined up against my queen in case I push my e pawn forward",
        "23... f4": "purely to prevent  white moving there with his f pawn, I can then advance my e pawn",
        "24. Kb2 Rde8": "preparing for advance",
        "25. Rfe1": "The White knight on e2 has limited options, perhaps c1 is the best",
        "25... e4 26. fxe4 dxe4": "I am happy now. I have 2 passed linked pawns and the white queen is pretty much trapped on c2. My queen also has a nice line to b3, I just need to work out how to make the most of it. I have a number of options. e3 will force the white dsb to g3 unlinking the rooks and resigning the h rook to defence of his h pawn. ",
        "27. Nxe4": "Weakens my pawns but I had planned for this in some conditional moves",
        "27... Rxe4 28. Qxe4": "Now his king only has two pawns for protection and his queen has been pulled away. ",
        "28... Qxb3+": "This was the last of my conditional moves. I hoped that with my knight and queen in the area I could apply enough pressure to the exposed king but is this enough?. I need to try to keep the king where the white queen cannot intervene. White is clearly hoping that he can withstand the onslaught",
        "29. Kc1": "The white king is now completely exposed.",
        "29... f3": "Looking to remove the knight from the defence of the king as well as protecting the pawn with the queen. I am expecting Ng3 or Nf4. As his queen will then be the sole defence for the king he is going to have to move it sooner or later , most likely to c2. At that point I will be looking to get my dsb to f4 ",
        "30. Ng3": "As predicted. I'm not sure of my best approach now",
        "30... Qxa3+": "I went for this option as it forces the king to move. We both need to be careful now, Kd2 for example invites Nc4  which quickly leads to mate.\n\nI think whites best option is either to get his king onto the second rank so that he can bring his rooks into play, or get his queen to the second rank with something like Re2!fxe2, qxe2 which is probably a good exchange for white as otherwise that pawn is going to be a major nuisance\n\nKd1 gives Qa1  and white seems to be in trouble\n\nKb1 gives Nc4 and white again seems to be in trouble\n\nKc2 gives Qb3 ",
        "31. Kd1 Qa1+": "Prevents the white queen getting into the fray. Whites best option now is probably Kc2 which also limits his queen.\n\nKd2 leads to Nc4+ which brings my knight and potentially by dsb into the assault",
        "32. Kc2": "Probably whites best option though it does restrict his queen a little, it looks like my earlier exchange is going to pay off",
        "32... Qa2+": "Pretty much forced. I'm trying to force the king where onto a black square so that I can bring my knight in",
        "33. Kd3": "A tough choice for white",
        "33... Qb3+": "At this point I setup a conditional move, white is finally where I wanted him. His king has to go onto a black square where my knight can come into play\n\n",
        "34. Kd2 Nc4+ 35. Kc1 Qb2+ 36. Kd1 Qd2#": "Thanks for reading, any constructive comments would be greatly appreciated"
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=21559",
    "gameName": "Let's play chess",
    "players": "phyrexianrook (1539) vs. elwoos (1490)",
    "opening": "QGD (D06), Marshall defence"
}