{
    "moves": {
        "1. d4": "Notes by Travis Colon.\n\nThis is my first annotated game. I assume that my audience has some intermediate knowledge of the opening, so I do not go into theory, mostly strategies and concrete variations. This is just a practice run against a weaker opponent. My future games will be played and annotated much better.",
        "1... Nf6 2. f3 g6 3. Nc3 Bg7": "We see a strange variation similar to a King's Indian. However, he declines c4, the most popular continuation. I should have exploited this with an immediate ..d5. I did not, and he should have went with an immediate e4. He does not, however, and the game soon shifts in black's favor.",
        "4. Bf4 O-O 5. Nb5": "A simple and harmless idea. nxc7 is much too obvious for me to miss. he should have spent time developing instead. Now, he loses tempo.",
        "5... d6 6. Nc3 Nc6 7. a3 Nh5": "...e5 should come before nh5, a move that prepares ...f5. The idea of this was to push his bishop back. ",
        "8. Be3": "White holds the d pawn, but his e pawn is blocked and his king side development is hindered substantially. On the other hand, my king is sheltered and my development is better. I use this opportunity to try a breakthrough in the center...",
        "8... e5 9. d5": "...And he closes.",
        "9... Ne7": "Closing the center is a common response to ...e5, when there is a white pawn on e4 to support it. Now I re-open the game in a manner beneficial for me, and attempt to exploit the absence of a pawn on e4. I can undermine d5 with c6 and move my center pawns forward with great affect. ",
        "10. g4 Nf6 11. b4": "He leaves his knight en prise, making e4 dangerous. I did not notice such threat until a few moves later, unfortunately. My observational abilities are apparently quite weak.",
        "11... c6": "I go along with my plan to undermine d5.",
        "12. dxc6 bxc6": "bxc6 is stronger than nxc6. If he pushes g5 for any reason then f5 is still available for my knight. The a6-f1 diagonal is open and so is the b-file, and now a pawn on d5 is very strong. I may even decide to place a knight on d5 in the future. \n",
        "13. Bg5 e4": "The idea behind this is to open up my bishop's diagonal and win the exchange by tactical means. Little did I know that winning the exchange would cost me the exchange, as I will explain later. ...d5 was probably the superior choice, but I was afraid that I would not be able to hold the e pawn, ",
        "14. fxe4 Nxg4": "14.nxe4 wins the exchange, however, my dark square weaknesses would force me to give the exchange back. Even so, I think I would emerge with an advantage.\n\n14.nxe4 nxe4 15. fxe4 bxa1 16.qxa1, and I don't see how I can stop 17.bh6, threatening mate. 16...f6 loses the pawn, and the only way to block the queen on the diagonal is to wait for bh6 so that I may push my pawn to f6, allowing white to capture my rook. I still appear to be OK, but I think capturing with the pawn as white did in the game was a lot better for me. Now the knight in being attacked by the bishop. The next move is forced.\n",
        "15. Qd2": "Protecting the knight and possibly exchanging the dangerous king's bishop. ",
        "15... h6": "I for one would rather keep it.",
        "16. Bxe7 Qxe7": "Now my threat is qh4  Developing his knight to f3 is probably best. ",
        "17. h3": "A Fatal mistake,as white loses the rook. Nf3 would have developed a piece and prevented the threat. Had he done so, I would have made my pawn thrust f5, strengthening my position even further, and eventually allowing me to open up the e or d file. With a centered king and queen, this would be equally lethal, although winning would have required a lot more work from me. His game is now completely hopeless.",
        "17... Qh4+ 18. Kd1 Nf2+ 19. Kc1 Nxh1 20. Nf3": "? It is too late, the next move seals the victory.",
        "20... Qf2 21. Kb2 Ng3 22. Qd1 Nxe4 23. Qe1": "White's options are very limited, and all moves lose.",
        "23... Bxc3+ 24. Kb3 Be6+ 25. Ka4": "Right now, qb6 is mate next move, but the next move is just as good. ",
        "25... Bxe1 26. Rxe1 Nc3+ 27. Ka5 Qb6#": ""
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=10672",
    "gameName": "Let's play chess",
    "players": "jrm12 (1348) vs. tcslick420 (1098)",
    "opening": "Paleface attack (A45)"
}