{
    "moves": {
        "1. d4 d5 2. b3 Nc6 3. Bb2 e6 4. Nf3 f6": "I'm a little dubious about this move.  It doesn't seem wise to compromise the Kingside.",
        "5. e3 a6 6. a3 b5 7. Bd3 g5 8. Nfd2": "I could have castled instead, but I didn't want my N chased off.  I can always castle Queenside if need be.  ",
        "8... f5": "I was surprised by this.  Black has decided on an all-out assault on the Kingside.  Theoretically, this is a bad idea.  In practice, it was not easy to handle at all.",
        "9. Qh5+ Kd7": "Black now cannot castle.  I'm hoping that having the K in the center will make it more difficult to coordinate his pieces.",
        "10. Qe2 g4 11. c4 Ke8": "I think Black needed to play bxc5 here.",
        "12. cxb5 axb5 13. Bxb5": "Now I've managed to sneak a pawn.",
        "13... Bd7 14. f3": "Castling was still probably a better idea.",
        "14... Nf6 15. fxg4 fxg4 16. Bd3": "Again, I don't recall why I was paranoid about castling.  As I am annotating the game, I'm not sure how easy it would be for Black to create pressure.",
        "16... Rg8 17. e4": "It's important to break in the center, but it might not be the best idea with my K exposed.",
        "17... h5 18. e5 Ne4": "This loses another pawn.  Black is staking everything on the Kingside pawn storm succeeding.",
        "19. Nxe4 dxe4 20. Bxe4 Rb8 21. Nd2": "It's hard to believe we're 21 moves into the game and my Rs are still not linked.",
        "21... Bh6 22. b4 Bxd2+ 23. Kxd2": "It took 23 moves to get developed and I'm still not happy about the exposed position of my K.  In compensation, I have a two pawn material advantage.",
        "23... Ne7 24. Rac1 Bb5 25. Bd3 c6 26. Bxb5": "Exchanging should tend the help the player with the material edge, unless you are trading good pieces for bad ones.",
        "26... Rxb5 27. Qe4 Rf8 28. Rhf1 Rxf1 29. Rxf1": "I now control the f file.  It is not as easy for Black to get control of the c file.",
        "29... Qd5 30. Qxd5": "Again, exchanges tend to help me.",
        "30... cxd5 31. Rf6 Kd7 32. Rh6 Rb8 33. Rxh5": "Now I've got a three pawn edge.",
        "33... Rg8 34. a4": "You need to attack where you have advantage.  My Queenside pawns are unopposed and mobile.  Away they go!",
        "34... Nc6 35. Rh7+ Kc8 36. b5 Na5 37. Bc3": "I have to prevent Nc4+ with the B still sitting on b2.",
        "37... Nc4+ 38. Ke2": "Moving the K to e2 prevents the R from penetrating on the f file.",
        "38... Rf8 39. a5 Rd8 40. Re7 Rh8 41. Rg7": "If Black plays Rxh2, I have Rxg4, getting back the pawn and guarding g2.",
        "41... Na3 42. b6": "Pawns keep rolling.",
        "42... Nb5 43. Bb2": "Now the B dominates the N.  It has nowhere to move.",
        "43... Kb8 44. a6 Rc8 45. a7+": "I have to prevent the R from penetrating on the c file, but I have time for a check first.",
        "45... Nxa7 46. bxa7+ Ka8": "Now I've got a nice material edge, although it is still not that easy to convert,",
        "47. Kd3": "Preventing the R from causing problems.",
        "47... Rc4 48. Ba3": "Black sees that after Bc5, my R will be free to pick off more of Black's pawns.  Black's K cannot fight.  Game over."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=26258",
    "gameName": "Let's play chess",
    "players": "mmoody95 (1804) vs. yosausage (1434)",
    "opening": "Queen's pawn game (D00)"
}