{
    "moves": {
        "1. d4 Nf6 2. h3 b6 3. Bf4 g6 4. Nf3 d6 5. Nbd2 Bb7 6. e3 Bg7 7. c3 O-O 8. Bd3 Nbd7 9. O-O a6 10. Re1 Nd5 11. Bh2 e6 12. e4 Ne7 13. e5 d5 14. Bf4 c5 15. Re3 c4 16. Be2": "White needed to go play Bf1, Bc2, or Bb1.  This loses the exchange.",
        "16... Nf5 17. Bg5": "Hoping for QxB?",
        "17... Nxe3": "I am content to exchange Queens, after all, I am currently a Rook ahead.",
        "18. Bxd8 Nxd1 19. Be7": "This and White's next are his saving grace.",
        "19... Rfe8 20. Ba3": "Guarding the b2 pawn.",
        "20... Nxf2": "The Knight was doomed.  This seemed better to me than anything else; at least I have the exchange and a pawn.",
        "21. Kxf2 f6 22. Bd6 b5 23. a4 Bf8": "The Bishop exchange is not quite forced.  Bc7 is available but after Rac1 White must either trade or removed the Bishop from action for the moment.",
        "24. Bxf8 Rexf8 25. Kg1 h6 26. b3 Bc6": "I like my pawn structure at the moment.",
        "27. Bd1 Kg7 28. b4 a5 29. axb5 axb4 30. Rxa8 Bxa8 31. cxb4 Bb7": "Making way for the Rook at a8.",
        "32. Nb1 Ra8 33. Bc2 Ra2 34. exf6+ Kxf6 35. Bd1 Rb2 36. Nbd2 Rxb4 37. g4 Nb6 38. Bc2 Rb2 39. Ne1 g5 40. Ndf3 Bc8 41. Kf2 Bd7 42. Ke2 Bxb5": "Taking the pawn while improving my position.",
        "43. Kd2 Na4": "I now believe Ba4 would have been better.",
        "44. Kc1 c3 45. Ne5 Nb6 46. Ne5d3 Ra2": "Perhaps I should have looked at exchanging some material first.",
        "47. Kb1 Ra7 48. Nb4 Ba4 49. Na2 Bxc2+": "Hoping for KxB.",
        "50. Nxc2 Na4 51. Kc1 e5 52. Nab4": "If instead 52. Kd1 then 52. --- Nb2+ wins the a2 Knight.",
        "52... Nb6 53. dxe5+ Ke6": "53. --- Kxe5 allows the Knight fork at c6.",
        "54. Kd1 Rf7": "Removing the fork and threatening the pawn at e5.",
        "55. Nd3 Nc4 56. Nce1": "I really expected Nd4+.",
        "56... Nxe5": "Taking the pawn while it is available and threatening to swap Knights.",
        "57. Kc2": "Additional protection for the Knight and attacking Black's c pawn.",
        "57... d4": "Pawn protection.",
        "58. Kb3 Nxd3 59. Nxd3 Rf3 60. Kc4 c2 61. Kxd4": "Taking the pawn in the mistaken belief that the c1 square is still guarded.",
        "61... Rxd3+ 62. Kxd3 c1=Q": "White resigned."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=58726",
    "gameName": "Let's play chess",
    "players": "chessaddict71 (1373) vs. tellurianking (1389)",
    "opening": "Queen's pawn game (A45)"
}