{
    "moves": {
        "1. e4 e5 2. d4": "Again with the Centre Game. I like this opening, as it keeps my options open (freeing up most of my pieces, with only the rooks being unable to move, although I would not want to move the king, as he is safe enough where he is).",
        "2... Qf6 3. dxe5 Qxe5": "He declines to take my pawn, bringing out his queen, hoping to develop her, so I initiate the exchange. Now I must try to repel the queen...",
        "4. Qd5 Qxd5 5. exd5": "...and I succeed in this. I thought the only way to repel her was to offer an exchange, and I succeed in that, but my pawn is a potential weakness, with it being so far advanced...",
        "5... Bd6 6. Nc3": "...so I defend it with my knight. It may have biocked in the pawn in front of my bishop, but I felt it was necessary to get a piece out, with my opponent getting out a bishop.",
        "6... a6 7. Nf3": "Moving his pawn allowed me to get ahead on development. I now have more control of the centre, with my knights, and my advanced pawn is defended by one of them.",
        "7... Bb4 8. Bd2": "As he moves his bishop to pin my knight down, I can instantly break the pin with my own bishop. Also, if he captures my knight, I can recapture and maintain a good pawn structure.",
        "8... Ne7": "I have nothing to fear yet, despite his knight coming out. My pawn is defended by my knight, and the enemy knight is so far back...",
        "9. O-O-O": "...so I castle queenside to bring a rook into play. I would say I am ahead on development, with two knights on the third rank, and a bishop on the second, while he has a bishop on his fifth rank, and a knight on his second.",
        "9... d6 10. a3 Bxc3 11. Bxc3": "I now get the piece exchange, hoping to poison his pawn on g7, with mine on d5 being protected by my rook...",
        "11... O-O": "...but he castles kingside and sees to that. However, I have more developed pieces out, with two pieces on the third rank.",
        "12. g3 Bg4 13. Bg2": "I decide to fianchetto my bishop, to defend the knight from the long diagonal...",
        "13... Nd7 14. h3 Bxf3 15. Bxf3": "...and I again get a knight for bishop exchange. I have the long-range bishop pair, he has the short-range knight pair, but we both have the rook pair, along with seven pawns, and there is one open file - the one where the kings start. Does anyone have a real advantage?",
        "15... Nb6": "Although the knight attacks my pawn, it's too well defended.",
        "16. Rhe1": "I now bring out my inactive rook to seize control of the open file, attacking the knight...",
        "16... Rfe8": "...but his rook moves to defend it...",
        "17. Ba5": "...so I attack the other knight with my bishop. If the knight moves, the pawn will disappear, or I will get ahead by a piece for a pawn: 17... Nbxd5 18. Bxd5 or 17... Nexd5 18. Rxe8+ Rxe8 19. Bxd5.",
        "17... Rac8 18. Bxb6 cxb6": "I now get the bishop for knight exchange, and I've now doubled pawns on the b-file. I am now hoping to target them, although they will support the rook's pawn down the board...",
        "19. Rd3": "...so I bring up a rook to target the pawn on b6...",
        "19... g6 20. Rb3": "...and move it across to line it up...",
        "20... b5 21. a4": "...but because it moves, I bring my rook's pawn to attack it, ensuring that I will either be a pawn up, or doubled pawns on the rook's starting file: 21... bxa4 22. Rxb7 (where the knight will now be under attack from two rooks) or 21... b4 22. Rxb4 or a potential 22. axb5...",
        "21... b6 22. axb5": "...but because the knight's pawn advances, I can capture the pawn in front of it. OK, I now have doubled pawns on the b-file, but they are strong, as not only can they support my bishop's pawn, but they will either undouble, or one can be used in a pawn trade, which would isolate the pawn on b6.",
        "22... a5": "As he declines to recapture (which would allow me to capture again, and force him to play Rb8)...",
        "23. Ree3": "...I double my rooks on the third rank. I'm now hoping to exchange a pair of rooks, being ahead by the odd pawn...",
        "23... Kf8 24. Rbc3": "...so I contest the half-open file with my queenside rook...",
        "24... Rxc3 25. Rxc3": "...and get the exchange I was looking for. I'm now hoping to exchange the other rooks, so I will go into the endgame with a single pawn advantage, where I can make the most of it.",
        "25... Rc8": "He sure gave up another exchange here! I am ahead on material, after all, and I would welcome the exchange...",
        "26. Rxc8+ Nxc8": "...which is what happens. He has weakened his counterplay, with only a short-range knight and six pawns against my long-range bishop and seven pawns in the endgame. I felt I was the favourite to win here: I control the b1, d1, b2, c2, d2, a3, b3, c3, d3, e3, g3, e4, f4, g4, h4, d5, a6, and c6 squares: he controls e8, g8, a7, e7, f7, g7, b6, d6, g6, a5, c5, e5 and b4, while we contest the e6 and h5 squares with our pawns and my bishop. What I intended was to manoeuvre my king to a4, then advance my pawn to b4, then get the trade, so the pawn on b6 would be isolated.",
        "27. Kd2 Na7 28. Be2": "I felt it was vital to defend my pawn on b5, so I retreat my bishop. ",
        "28... Ke7 29. Kc3 Kf6 30. Kb3 Ke5 31. c4": "I also advance my bishop's pawn to protect my pawns on b5 and d5, and it is now protected by my bishop. His king cannot penetrate, as I control the c3, e3 and g3 squares with my pawns, and d3 and f3 with my bishop, which also controls c4, while the pawn there controls b5 and d5...",
        "31... f5 32. Ka4 h5 33. b4 axb4 34. Kxb4": "...and although his kingside pawns advance down the board, I get the pawn trade I was referring to earlier. Now all my pawns are in single file, and are connected in threes.",
        "34... Kd4 35. Kb3 Ke4 36. Kc3": "I felt I restrained the king well here: I looked at the squares my king, bishop and pawns controlled in order to drive him away, and so I could get mine close to my bishop. His king can only move onto e5.",
        "36... f4 37. gxf4 Kxf4": "My kingside pawns may now be disconnected and isolated, but the king cannot move anywhere towards my bottom rank, as my bishop's pawn is denying him access to e3 and g3, while my bishop is denying him access to f3 and g4 (which is also controlled by my rook's pawn)...",
        "38. Kd4": "...and my king restrains him even further - he can now only move backwards, as mine has denied him access to e4 and e5.",
        "38... h4 39. Bg4 g5 40. f3": "His last two pawn moves allowed my bishop to move to some pawn protection, and to only allow the king one square: g3. Also, if the knight moves, it will be captured: 40... Nb5 41. cxb5, 40... Nc6 41. dxc6, 40... Nc8 41. Bxc8, and my bishop can now help my king to clean up the pawns, although it would have to rely on the pawns being on light squares, and undefended.",
        "40... Nc8 41. Bxc8": "I now remove the knight, and his last good piece has gone: all I need to do is create at least one passed pawn, and then queen it, then maybe get a second queen to help out...",
        "41... Kxf3": "...and although I drop my bishop's pawn...",
        "42. Bg4+": "...the bishop itself moves back to be protected by my rook's pawn. What I need to do is manouevre my king to eliminate the pawns on either side...",
        "42... Kf4": "...but I am unable to deal with the queenside pawns, as my king is denied access by the pawns and the king...",
        "43. Kd3": "...so I retreat him one square, to operate kingside.",
        "43... Ke5 44. Ke3 Kf6 45. Ke4 Kg6 46. Bf5+": "I now move my bishop to provide a distraction here...",
        "46... Kf6 47. Bd7": "...and I move it onto the 7th rank. If the king moves to e7, I can then eliminate the kingside pawns, even if I do drop the bishop, and make my rook's pawn passed: 47... Ke7 48. Kf5 Kxd7 49. Kxg5, and the king must stay on his second rank, and I then play 50. Kxh4, giving myself a passed pawn on h3, and then I queen on h8, and she  ought to have few problems hoovering up the queenside pawns.",
        "47... Kg6": "He defends his pawn...",
        "48. Kf3": "...so I move my king back. If he plays Kh5, I play Be8+, forcing Kh6, so I play Kg4, leaving him with Kg7 or Kh7, so I can then play Kxg5 then Kxh4, so I can then queen on h8.",
        "48... Kf6": "He moves towards my bishop...",
        "49. Kg4": "...so I move into the square to hunt down his pawns...",
        "49... Kg6": "...and he moves back again...",
        "50. Bf5+": "...so I check with my bishop. If he plays KKf6, I play Bb1, then remove the pawn on g5, 50... Kh6 would allow me to win the pawn in two moves, 50... Kf7/g7 51. Kxg5.",
        "50... Kh6 51. Bd3 Kg7 52. Kxg5": "I finally remove the pawn on g5...",
        "52... Kf7 53. Kxh4": "...followed by the one on h4, giving me a passed pawn on h3. My opponent resigned here, as he would have had to stop it from promoting, allowing my king to eliminate his pawns on b6 and d6, and get at least one queen queenside."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=25830",
    "gameName": "Let's play chess",
    "players": "aspiemikey (1380) vs. amasil (1334)",
    "opening": "Centre game (C21)"
}