{
    "moves": {
        "1. e4": "alrighty, So, this is Me after being kicked out of Southern Chess trying to build up my rating again.\r\nDude probably doesn't know that I'm actually stronger than my rating shows.",
        "1... g6": "I intended to get out one of the fancy schmancy modern openings out, so I began to ready the flanchetto.",
        "2. Qf3": "The 4-move opening again? pah!",
        "2... Bg7 3. Bc4": "I wonder how many people actually fall for that...",
        "3... e6": "That stops that.",
        "4. d3 c6": "intent to move ##. ... d5 eventually, forcing his bishop into a useless corner.",
        "5. Nh3": "This move always confuses me. Aren't knights supposed to be used near the middle, where they have the most manuverability?",
        "5... d5 6. exd5": "And so it begins...",
        "6... cxd5": "*clomp!*",
        "7. Bb5+ Bd7 8. Bxd7+": "If you can't tell, I forced that out of him...\r\nI contemplated 7. ... Nc6 8. ... a6 but I'm satisfied with the overall result.",
        "8... Nxd7 9. O-O Ne7 10. Bg5": "I was SO waiting for that. With that, I can score 6 points at least! *in an unenthusiastic cheer* yaaaaay.",
        "10... Bxb2 11. Nf4": "Y'know... wouldn't most people have moved the OTHER knight out of the way? for, like, avenging the rook?",
        "11... Qa5": "I did that to:\r\n   Free up my knight from the psuedo-pin he was in.\r\n   Add a defender to the d5 pawn\r\n   Prepare to jack up his bishop (by moving up my pawn)",
        "12. Nxe6": "This baffels me... Why would he give up a knight for a pawn if it doesn't really get him an advantage",
        "12... fxe6": "Meh, *recapture*",
        "13. Na3": "'bout time he moved the knight! Sheesh!",
        "13... Bxa1 14. Rxa1 Qxa3": "... and that puts me 8 up!",
        "15. Re1": "This worried me slightly, but then I saw an opening that would blow him to shreds if he took that pawn...",
        "15... Rc8": "this made that situation unstable for white. moving the rook away from the back row would cause it pain. MUCH pain.",
        "16. Qe3": "lining up for an e-file push?",
        "16... Rc6": "the take-over had to be put on hold for e-pawn defense",
        "17. h4": "the next few moves on his part confuzzled me! @.@;;",
        "17... Nc5": "extra e-pawn defense.",
        "18. h5": "... confuzzled me...",
        "18... Qxa2": "free pawn!\r\nI guess I over looked that one...",
        "19. hxg6": "??? A better move woulda been h6, no? because...",
        "19... hxg6": "It just relocked the h-file again for the white king...",
        "20. f4 Nf5": "like HECK I'm letting him do that again!",
        "21. Qe5": "oh, yeah... that whole queen thing... it was so useless through the game that I forgot about it.",
        "21... O-O": "That was to stop a rather annoying Qf6 move, which would've resulted in a checkmate for me or at the very least a loss of my pawn defense",
        "22. Bh6": "Qg7 maybe? Bf8? what was this guy thinking?!?",
        "22... Rf7 23. Qb8+": "and he takes his pot-shot.",
        "23... Kh7": "but his bishop is defenseless...",
        "24. Bg5 a6": "it took me the longest to figure out why he didn't take a pawn. Then I realized that they were both defended.\r\nI wanted to be able to move my queen, so that's why I bumped up this pawn.",
        "25. d4": "I was waiting for that. I knew it would happen eventually.",
        "25... Nxd4": "and there's my responce. My defense, planned 5 moves ahead.",
        "26. Qe5": "did he think he would nab my knight?",
        "26... Nxc2": "Ya-Ha!! I had just noticed that free pawn there...",
        "27. Rd1 Nb4": "I was planning on Nb-c4, forcinf his Queen away, then Qf2 ",
        "28. Qe3": "Tricky Punk. He saw it coming and avoided it!",
        "28... Ne4 29. Qh3+": ""
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=1032",
    "gameName": "Let's play chess",
    "players": "biledemon (1078) vs. judgeman (1093)",
    "opening": "Robatsch (modern) defence (B06)"
}