{
    "moves": {
        "1. e4": ".The opening resulted in a very closed game, were both sides avoided exchanges, until black decide for a centre pawn break with 11...d5 and after white's move decided to precipitate the action by exchanging the pawns, then instead of dealing with white threats (black had a pawn hanging and a knight pinned), black decided for an unneeded move 13.h6 after which white took the initiative and due to a cramped camp by black with lack of connection between pieces, white went on to win the game.",
        "1... e5 2. Bb5": "Portuguese opening",
        "2... a6": "one of the main replies, the idea is to repel the bishop from b5",
        "3. Ba4": "the main line keeping pressure over d7, inviting b5 to over extend blacks pawns",
        "3... Nf6": "counter-attack the best option for black",
        "4. Qe2": "d3 is the other option here",
        "4... Nc6 5. c3": "to open an escape route for the bishop keeping the light squares bishop is white's main idea, and to prevent both Nd4 and Nb4",
        "5... d6 6. d3": "now further support on e4, and opens c1-h6 diagonal, white pawn structure is cohesive although if black tires a d5 pawn break white might have some trouble due to the weakness of it's d3 pawn  ",
        "6... Bd7 7. Bc2": "so white doesn't have to exchange the bishop",
        "7... Be6 8. Be3": "Bg5 h6 Be3 is almost the same",
        "8... Be7 9. Nf3 Qd7 10. h3": "preventing Bg4",
        "10... O-O-O 11. Nbd2": "developing the last piece and leaving open the hypothesis of 0-0 or 0-0-0",
        "11... d5 12. Ba4": "pining the knight",
        "12... dxe4": "?! b5 was needed although would have weakened ",
        "13. dxe4": "no problems for white in opening the d column, it might even try to place a rook there latter on",
        "13... h6": "? a tranquil and inappropriate move, conceding the initiative to white",
        "14. Nxe5": "profiting from the previous pin over the c6 knight",
        "14... Qd6 15. Nxc6": "wins a pawn, as bxc6 Qxa6+ Kd7 Nf3 Kd8 only move due to the threat Rd1 to win the queen for the rook or a piece for a pawn in d5, and white is clearly better",
        "15... bxc6 16. Qxa6+ Kd7": "Forced sequence",
        "17. Nf3": "and white is better the threat now is Rd1 to win the queen and e5 with a pawn fork on knight and queen",
        "17... Ke8": "needed to avoid Rd1, but allows...",
        "18. e5": "... the fork, that wins more material",
        "18... Ra8": "?? Loses other piece",
        "19. Qxa8+": "now black has to block on the d8 square either way they lose at least a piece:\nQd8 Qxd8 exf6 wins the knight\nBd8?? loses the queen \nKd7?? Qxh8 and then exf6 wins another rook and the knight\n\n"
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=41256",
    "gameName": "Let's play chess",
    "players": "kaspanatola (1200) vs. kellyeight (1401)",
    "opening": "King's pawn game (C20)"
}