{
    "moves": {
        "1. e4 c5 2. f4 e6": "more normal is 2 .. d5 3 exd5 Qxd5 4 Nc3 Qd8 5 Nf3 =",
        "3. Nf3 d5 4. e5": "? breaking the tension in the centre. Better was 4 Nc3 Nc6 5 Bb5 Nge7 6 o-o =",
        "4... Nc6 5. Be2 c4": "? somewhat slow .. 5 .. Nge7 better ",
        "6. O-O Bc5+ 7. Kh1 Nh6": "! the best move preparing Nf5",
        "8. d3 b5": "8 .. cxd3 9 Bxd3 Ng4! 10 Qe1",
        "9. d4 Bb6 10. c3 Nf5": "or 11 .. o-o 12 Na3",
        "11. Na3 a6 12. Nc2": "the position is level with few imbalances. ",
        "12... a5": "o-o might be better here ",
        "13. Ne3 O-O": "permitting a degraded pawn structure though Black is not necessarily worse as a result. Alternatively 13 .. Nxe3 14 Bxe3 Ne7 with equality",
        "14. Nxf5 exf5 15. Be3 Qe7 16. Qe1 f6": "16 .. b4 17 Qg3",
        "17. Qf2 Bd7 18. h4": "? presumably trying to break the deadlock of a locked position but this moves seems to be needlessly weakening the White Kingside & King position. 18 b3 was an alternative.  ",
        "18... b4": "! playing for a pawn break on the opposite wing. ",
        "19. h5 h6": "an understanable response but probably unecessary . Black could wait for White to play h6 and then play g6 himself. Continuing to attack on the Queenside with 19 .. a5 was an alternative plan. ",
        "20. Nh4": "obviously threatening Ng6 - White is continuing to attempt to drum up threats on the Kside - a valiant effort in a very closed and level position. ",
        "20... Qe6 21. Bd2": "? hard to see the purpose of this move .. pressing on with the consistent 21 Ng6 seems stronger. ",
        "21... Be8": "? whites last move allows a tactic missed by both players here - Black could win a pawn with 21 .. fxe5 22 fxe5 Nxe5 exploiting the pinned d4 pawn",
        "22. Ng6": "? an error - theres no point putting this N here now that Black can just remove it in exchange for his own weak bishop. Knights are more useful than Bishops in this position. ",
        "22... Bxg6": "of course",
        "23. hxg6 fxe5 24. Bh5": "?? necessary was 24 fxe5 Nxe5 (again exploiting the pin) 25 Qe1?! Nd3 26 Bxd3 Qxe1 27 Raxe1 bxc3 28 bxc3 (or Bxc3) cxd3 with advantage for Black (a pawn up) but in a complex position with a poor pawn structure. ",
        "24... Ne7": "?? missing winning chances with\r\n\r\n24 .. bxc3 25 bxc3 exd4 26 Rfe1 Qd6 27 Qe2 Rab8 -  or\r\n24 .. exd4 25 Rfe1 Qf6 26 cxb4 axb4\r\n\r\nin both lines Black emerges 2 pawns ahead with a won position.  ",
        "25. fxe5": "! White closes the door",
        "25... bxc3 26. bxc3 Nxg6 27. Bxg6 Qxg6 28. Qf3 Qe6 29. Rab1 Bc7 30. Rb5 Rad8 31. Rfb1": "an immediate 31 Rb7 was an alternative plan worth consideration",
        "31... g5": "?! A bold approach. More solid might have been to liquidate into a better end game with 31 .. Rb8!?",
        "32. Rb5b7 Rf7": "again 31 .. Rb8 is possible, preventing 32 Rxc7 and offering exchanges favouring Black. The Kingside pawn majority might prove decisive in an endgame with the Rooks off. ",
        "33. Rb1b5 Qc6": "or 33 f4 getting the pawn majority moving",
        "34. a4 f4": "!",
        "35. Qg4 Rdf8 36. Ra7": "offering the possibility of doubling on the 7th rank whilst hitting the Black a-pawn but Black's defences are solid. 36 Qf3 might be better to blockade the f pawn, although the Queen makes for a poor blockading piece , vulnerable to being attacked and force to move. With no Black knights or white squared bishop however this seems a reasonable move here. ",
        "36... f3": "!",
        "37. Rc5": "?? Losing. It was essential to remove the dangerous f pawn",
        "37... Qxc5": "!!",
        "38. dxc5 f2 39. Qe6 f1=Q+ 40. Kh2 Bxe5+": "!",
        "41. Qxe5 Rxa7 42. Qxd5+ Qf7 43. Qxf7+ Raxf7": "A very well played finish by Black. The main reason for Blacks victory was whites overpushing on the King side allowing Black a 3-1 pawn majority on that wing. 22 Ng6 looked like a serious positional mistake by White allowing Black to commence a pawn push that led to victory. "
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=15212",
    "gameName": "Let's play chess",
    "players": "kolpa (1660) vs. mrmojo (1670)",
    "opening": "Sicilian (B21), Grand Prix attack"
}