{
    "moves": {
        "1. b3": "hello again\r\nthis annotation thing i pretty fun :)\r\ni can share my thoughts at the time the game was played and show my (rare, VERY rare) good sacrifices \r\nand hopefully someone can learn a thing or two from my games (which i doubt)\r\nhere i'm black again although i like playing white pieces more(and i play better as white)\r\ni was confused with this opening and made a few mistakes ( i noticed that i every single game i play i make an error and i'll do my best to fix that and go above 1700 )\r\n",
        "1... d5": "ok, mistake #1\r\nif he moves Bb2, it's stopping my pawn from e5 next move",
        "2. e3 e5": "but since he didn't play Bb2....",
        "3. c4": "wow\r\nwhat to play now?\r\nobviously i won't take it since Bxc4 develops his bishop",
        "3... Nf6": "so i ignore that and continue my game",
        "4. Nf3 Bd6": "now i'm ready to castle",
        "5. Bb2 Nc6": "defending the pawn and developing",
        "6. d3": "almost all his moves make no sense to me\r\ni've never seen opening like this before and i'm starting to think that i'll win this easily\r\n",
        "6... O-O 7. Nbd2": "wrong place for that knight\r\nNc3 is way better, attacking my pawn",
        "7... Be6": "oops\r\nthis was a mistake\r\ni guess i had that Nc3 in my mind and put my bishop on e6 in a second...\r\nand when i clicked \"submit\" i just wanted to slap myself\r\nwanted to play Bg4",
        "8. a3 Bg4": "a little passive so why not :)",
        "9. h3": "that was what i expected\r\n",
        "9... Bh5": "so lets try to make him push his pawns",
        "10. g4 Bg6 11. g5": "come, come :)\r\nthis actually losses a pawn for me but what the hell",
        "11... Nd7 12. cxd5 Ne7 13. e4 c6 14. h4": "i'd rather play Nc4 striking my e-pawn 3 times while i'm defending only twice",
        "14... Bh5": "\"bishop, go back pinning his knight and stop his h-pawn!\"\r\n",
        "15. dxc6 Nxc6": "i didn't want to take it with my pawn and isolate it",
        "16. Be2 f6 17. Rg1 Qb6": "eyeing on f2",
        "18. Nc4": "oops, missed this\r\ni was thinking about it a few moves ago and i forgot so quickly\r\nnow he can exchange knight for my DSB\r\nbut DSB wasn't included in my plan anyway :)\r\n",
        "18... Qc7 19. b4": "i really thought he'll take the bishop",
        "19... Bxf3 20. Bxf3 fxg5": "thats the reason i took his knight previous move",
        "21. hxg5 Rf4": "now i'm trying to put my both rooks on f file \r\nso now i'm hoping he'll attack it with his DSB and move it from this diagonal so i can play Nd4",
        "22. Bc1": "which he does\r\nbut....",
        "22... Rf7 23. g6": "....i have to move it again...and postpone my plan since now my king is under heavy fire (not yet but soon will be)",
        "23... Rf6 24. gxh7+ Kxh7": "maybe Kh8??",
        "25. Bg4 Raf8": "i was thinking about Ne7",
        "26. Be3": "protecting his f-pawn and attacking my a7 pawn\r\n",
        "26... a5": "lets try to exchange his well placed knight for mine with\r\n 27. bxa5 Nxa5 \r\n 28. Nxa5 Qxa5 \r\n ",
        "27. b5 Nd4": "i was thinking pretty long before making this move\r\ntwo options:\r\n1. Ne7 - protecting from Bf5  and closing the f file or\r\n2. Nd4 - exchanging knight for his DSB or if he doesn't take it, \r\n             exchanging it for his LSB with Nf3  forking his king and rook and \r\n             protect Bf5 \r\nsince option #2 includes option #1.....\r\n\r\n",
        "28. Bxd4 exd4": "now his f pawn is hanging, but not for long...",
        "29. Bf5+": "when i look at the board now, maybe Ne7 was better in move 27.",
        "29... g6": "this was a mistake that could've cost me the game should have played Kg8",
        "30. Bxg6+": "Qh5 !!!\r\ni can't take it because my pawn is pinned\r\nfollowed Kg8 (no difference)\r\nand it's either checkmate or losing my queen\r\n31. Bxg6  and no way to avoid checkmate or losing my queen if he makes right moves\r\n\r\nnext few moves are pretty much forced",
        "30... Rxg6": "but he didn't do that :)",
        "31. Qh5+ Rh6": "my king is safe from checking now",
        "32. Qd5 Ne5": "now if he takes pawn with his queen... Nf3  forking the queen and rook",
        "33. Ke2": "but unfortunately he saw it also :)\r\n\r\ndo you remeber what i wrote on my first move?\r\ni'll remind you\r\n\"show my (rare, VERY rare) good sacrifices\" ",
        "33... Rxf2+": "well, here it is\r\nplease, please, PLEASE take it :)",
        "34. Kxf2": "yes!!!\r\n\r\nhe didn't move his king to d1 and i thought this was so obvious but he was greedy i guess",
        "34... Nxd3+": "now he can choose the way the game will be ended\r\nlets see where he can move his king:\r\n1. e2 and g2 --> losses his queen instantly because of Nf4 \r\n2. f1 --> Rf6  his king is limited to two squares (e2 and g2, and we already \r\n    know what will happen there :) )\r\n3. f3 --> Rg6  followed by either e2 (see 1.) or g4 followed by Qg2  which \r\n    leads to checkmate in 4 or 5 moves",
        "35. Kg2": "so he chooses option number 1 :)",
        "35... Nf4+": "as i said",
        "36. Kf2 Nxd5": "the rest of the game is very easy for black",
        "37. exd5 Qxc4 38. Rac1 Rf6+ 39. Kg2": "and now i have forced mate in two\r\ndo you see it?",
        "39... Qe2+": "if Kh1 then Rh6#\r\nif h3 again Rh6#\r\n\r\ni have nothing special to say in the end but thank you jevgeni for the game and for the talk during the game\r\n\r\n"
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=14669",
    "gameName": "Let's play chess",
    "players": "jevgeni (1533) vs. drekec (1623)",
    "opening": "Nimzovich-Larsen attack (A01), classical variation"
}