{
    "moves": {
        "1. d4 e6": "French Defense, continuing as the Rubinstein Variation (or so I'm told) through the third move.",
        "2. e4 d5 3. Nc3 dxe4 4. Nxe4 Nf6 5. Bd3 Nxe4": "If instead 5...Qxd4, then 6. Bb5  wins the queen.",
        "6. Bxe4 c6 7. Nf3 f6": "This seems to be a weakening pawn move, preparing for ...e5 but leaving the king's pawn weak",
        "8. Be3": "It's a nice feeling to have all my minor pieces developed.",
        "8... Bd6 9. c3": "This move protects my d5 pawn while allowing me to coordinate my queen and my bishop by moving to c2.  With my black squared bishop developed, I don't need the c3 square open for it.",
        "9... Qe7 10. O-O": "My chess engine likes Qc2 or Bd3 better, I assume because there is no urgency in castling at the moment and that a queen developing move like Qc2 gives me the added flexibility of castling on either side.  Still, it makes me nervous to have my king on a half-open file when a queen is on the other side of it.",
        "10... Bd7": "This move seems to actually hinder black's development, since the white square bishop doesn't gain much in the way of development and severely limits the mobility of both the queen and the knight.",
        "11. Re1": "Developing my queen probably should have been a priority, but I blame Nimzovich (I've seen this spelled 4 different ways, and I'm not sure this is one of them) for stressing over and over how important it is to put rooks on open or half open files.  In this case, we have the added bonus that the rook is in front of black's queen.",
        "11... e5": "This contains all sorts of traps for black.  Fritz says I should take with my d pawn and eventually move my knight and play Qh5 .  However, after 12. Bd3, I was hoping for 12.... exd4 13.Bxd4 and the queen would be directly pinned to the king.  One can hope, right?",
        "12. Bd3 O-O": "Removing the threat of the pin on the king, but exposing white's king along the long white diagonal. 12...Bg4 (pinning white's knight) or ...Be6 (activating the bishop and preventing the queen pin or an eventual Bc4 ) might have been better, but since Bg4 was played the next move, 12...0-0 is fine.",
        "13. Bd2": "Unleashing the rook along the e file, like nimzovich told me.  However, the right way to unleash the fury would have been 13.Bf4, putting more pressure on the (pinned) e pawn.  The chess engine likes 13.dxe5 as well.",
        "13... Bg4 14. Qc2 g6": "Black is in some serious trouble here.  Moving his pawn to g6 will allow me to sacrifice my white bishop for both of his kingside pawns, making his king very uncomfortable after Bxg6...hxg6 Qxg6 .  In black's defense, the chess engine thinks 14...g6 is as good a move as any.",
        "15. Bh6": "Thought I'd add some pressure before the fireworks, allowing the black squared bishop to participate",
        "15... Re8": "...Bxf3 might have been better, since after BxR KxB black has removed some of my attacking power at the price of the exchange, while removing the possibility of a gain of tempo through a check from g6.",
        "16. Bxg6 hxg6 17. Qxg6+": "As an added bonus, I've forked the king and bishop.  If black moves 17....Qh7, then 18Qxh7#.",
        "17... Kh8 18. Qxg4 Rg8": "It probably would have been better to develop the knight to d7, allowing the rooks to be linked up (and as an added bonus, getting the knight closer to the crisis).  For my part, the chess engine likes Qh4 or Qh3 much better than Qh5, I guess because Qh4 puts more pressure on the f pawn.  I still like putting pressure on the e pawn, myself.",
        "19. Qh5 Nd7": "I like linking up the rooks.",
        "20. Bf8+": "The discovered check I had been waiting for.  Unfortunately I couldn't grab the queen with this, but after exchanging queens I got a bishop for free.  I wish I could have kept up the attack a little longer, but I was pretty much out of ammo.",
        "20... Qh7 21. Qxh7+ Kxh7 22. Bxd6 exd4 23. Re7+ Rg7 24. Rxg7+": "I was a bit ahead, so why not trade off?  There was always the possibility of trying again with R(a1)-e1-e7.",
        "24... Kxg7 25. Nxd4": "Taking with the knight instead of the pawn preserves my pawn structure.  Black's pawn at f3 is protected by a king and knight, and is a major liability.",
        "25... Re8 26. Kf1": "Moving the g4 pawn would have also been appropriate.  I guess we can now say we're in the endgame, since most of the threats will come to or from pawns.  I'm up a bishop and two kingside pawns- victory, I thought, was assured.  Credit my uneven playing and my opponents excellent tactical play, particularly with the knight, to turning this into a drawn game.",
        "26... c5 27. Nf5+": "A bit petty, but as good a spot for the knight as any.  The knight could have been stronger after moving my pawn to g4.",
        "27... Kf7 28. Ng3": "No idea what I was thinking here.  There's nothing wrong with the knight outpost I had, and scooting the h pawn up the board (or trading off rooks) should have been my top priority.",
        "28... b6 29. Re1 Rxe1+ 30. Kxe1 Ke6 31. Bc7": "And here's where I get greedy.",
        "31... Nf8 32. f4 f5 33. h4 Ng6": "My pawns are forked, but losing the f pawn is quite acceptable if I can sneak my h pawn further down the board.",
        "34. h5 Ne7 35. h6 Kf6 36. Bb8": "Bd8 was the better move here, pinning the knight and forcing black to choose between letting my pawn promote or giving up the knight for free.  My greed for pawns, on this move and the next, led me to an inexcusable blunder.",
        "36... a6 37. Ba7 Nc8 38. h7": "Kxf5 was the correct move here- if black takes back, I have a free ride to pawn promotion; if not, the knight makes it hard for the king to prevent the promotion.",
        "38... Kg7 39. Bxb6": "I could have saved my bishop here, or grabbed a pawn with the knight and force black's knight to capture the bishop on the edge of the board.",
        "39... Nxb6 40. Nxf5+ Kxh7 41. g4": "Didn't do me much good.  Should have probably moved the knight to e3 or d6, getting it involved in the queenside struggle while leaving my f pawn free to roam.",
        "41... Nd5": "See what I mean?  A pawn given up with no compensation.",
        "42. Kf2 Nxf4 43. Kf3 Nd3 44. b3": "Now I'm on the defensive, and poised to be picked apart by some precise play.",
        "44... Nc1 45. a4 Nxb3 46. Nd6 Kg6 47. Kf4 Nd2 48. Ne4 Nb3 49. g5 c4 50. Nd6 Nc5 51. a5 Na4 52. Nxc4 Nxc3 53. Ne5+ Kg7 54. Kf5 Nb5 55. g6": "According the to engine, this (and move 57) is where I entirely lost my advantage.  It suggests Nc6, Kg4, Nc4, Ke4, or Nd3... pretty much any move but the one I made.",
        "55... Nd6+ 56. Kg5 Nb7 57. Nd7 Nxa5 58. Nc5 Nc6 59. Nxa6 Ne7 60. Nc5 Nxg6": "And the game is drawn (for whatever reason, we exchanged draw offers a few times before we officially drew).  Overall, uneven play in the midgame and great play in the endgame by my opponent, and sloppy play in the endgame and fine play in the midgame by myself.  The moral of the story?  Spend more calculation time in the endgame positions, particularly since this is correspondence chess and I had days to make my moves.  Working some endgame puzzles probably wouldn't hurt either.",
        "61. Kg4 Ne5+ 62. Kf5 Nf3": ""
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=14025",
    "gameName": "Let's play chess",
    "players": "pretz (1304) vs. adrian220 (1290)",
    "opening": "Queen's pawn (A40)"
}