{
    "moves": {
        "1. e4 c6": "Caro-Kann Defence. This game is the first time - and surprisingly the only time to date - I have encountered it in actual play.",
        "2. d4 d5 3. e5": "The Advance Variation.",
        "3... Bf5 4. Nc3 e6 5. g4": "The beginning of an aggressive continuation, the bayonette attack.",
        "5... Bg6 6. Nge2": "The best deployment for the knight in this variation.",
        "6... Ne7": "Black adopts a quiet formation originating with Karpov, avoiding the wild tactics that can otherwise occur.",
        "7. Nf4 Nd7 8. h4 h6 9. Nxg6 Nxg6 10. h5 Ne7": "In the last few moves white has gained some space, weakened some light squares on black's king's side, and removed the light-squared bishop which was protecting them.",
        "11. Ne2": "Now white regroups in the centre, awaiting black's French-style counter-attack.",
        "11... c5 12. c3 Nc6 13. f4 cxd4 14. cxd4": "A pawn weakness for white, which black will try to exploit.",
        "14... Qb6 15. a3": "Preventing Bb4 , which would disrupt white's support for his weak pawn.",
        "15... Be7": "Black's bishop, though technically \"good\", no longer has many options.",
        "16. Bg2": "White's king's side formation may look unusual, but the plan is to exert pressure on black's pawn centre. (This eventually happens, though not until the endgame.)",
        "16... O-O-O 17. b3": "To allow the development of the other bishop, though this move allows black to create a few problems.",
        "17... Kb8 18. Qd3": "Still protecting the two pawns, but now also pressuring the weakened light squares f5 and g6.",
        "18... Rdc8 19. Be3": "Extra protection for d4, though this does not last long.",
        "19... Na5 20. b4": "Allowing black a knight outpost on f4. This was a conscious decision, banking on being able to generate more important play on the other side of the board.",
        "20... Nc4 21. Bc1": "Preserving the bishop and shackling the black knight.",
        "21... Qc7 22. f5": "Now it is once again white's turn to go on the attack.",
        "22... Ndb6 23. O-O": "Not the most comfortable castled position, but at least the rooks are nearly connected.",
        "23... Rcf8": "This gives white a tactical target.",
        "24. Nf4": "threatening forks on both e6 and g6 after a pawn exchange.",
        "24... Qd7 25. Re1": "A sidestep to prevent black's rook escaping from the coming fork with Rxf1 .",
        "25... Bg5": "This will lead to an exchange of dark squared bishops, which should not ultimately be to black's advantage. Better would have been to admit Rcf8 was a mistake and move it away again.",
        "26. fxe6 fxe6 27. Ng6": "Now white wins the exchange.",
        "27... Bxc1 28. Rexc1 Rhg8 29. Nxf8 Rxf8 30. Rcf1": "Seizing the f-file for the rooks, as black can keep the c-file blocked.",
        "30... Rf7 31. Qg6": "Those weak light squares again...",
        "31... Rxf1+ 32. Rxf1 Ne3": "Black attempts to find counterplay.",
        "33. Rf8+ Nc8": "Not Kc7?, otherwise Rf7 !",
        "34. Kf2": "Putting the question to the intruding knight.",
        "34... Nc4": "Black obviously judges that this knight is stronger than the bishop - which might appear logical, but that is not how things will work out.",
        "35. Re8": "The big question for me at this point was to stop black큦 queen coming down the c-file and possibly getting a perpetual (or worse). I thought this plan was the best way of tying her down.",
        "35... Nxa3 36. Qxe6 Qxe6": "Qc6 would have allowed the pleasing tactic 37 Qd6  Qxd6, 38 ed!",
        "37. Rxe6 Nc2 38. Bxd5": "The bishop joins the action at last.",
        "38... Nxb4 39. Be4": "Once again shackling the knight.",
        "39... a5": "Black's remaing trump is of course this pawn.",
        "40. Rg6": "White insists on going for the g7 pawn, attacking b7 and securing a winning breakthrough for an eventual pawn ending.",
        "40... a4 41. Rxg7 Nc6": "Black needs to prevent Rxb7 .",
        "42. Bxc6": "Disconnecting black큦 passed pawns. It might look as if the white rook is cut off from the a-pawn, but in fact it will reach it in time.",
        "42... bxc6 43. Ke3": "Getting out of the rook큦 way, while also threatening to enter the a-pawn큦 square.",
        "43... a3 44. Rf7 Nb6": "A last attempt to make trouble with the knight from d5.",
        "45. Kd3": "Getting the king off the a7-g1 diagonal in the event of a pawn race after g5.",
        "45... a2 46. Rf1 Nd5 47. Ra1 Kc7": "Hoping for 48 Rxa2? Nb4! (In fact this would probably still have lost - the knight is too far away from the king´s side pawns.)",
        "48. Kd2": "1-0. Black resigns because of the breakthrough 49 g5!, where neither king nor knight can catch the h-pawn.",
        "48... Kd7 49. g5 Ne7 50. gxh6": ""
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=4559",
    "gameName": "Let's play chess",
    "players": "orangutan (1681) vs. borde (1671)",
    "opening": "Caro-Kann (B12), advance, Short variation"
}