{
    "moves": {
        "1. d4": "I am really more of a tactical player so I'd rather play against e4 than this but it's not for me to choose",
        "1... Nf6": "I was reading a book by Nimzowitsch so I chose this defense",
        "2. c4 e6 3. Nf3 Be7": "Slow development, didn't want to trade my dark squared bishop after some Bb4+ lines",
        "4. e3 O-O 5. Nc3 d5 6. c5": "My opponent keeps telling me he enjoys closed positions",
        "6... b6": "Well I don't. Trying to open things up ",
        "7. Bd3 Nc6 8. O-O Bb7 9. cxb6 cxb6": "There we go, an open file at last",
        "10. Na4": "Weird move, not sure what's this about. He could at least tried Qc2 and put more pressure on my castling position",
        "10... Qd6 11. Nc3 Rac8 12. a3 Na5": "My knight wants to get to c4 obviously. My opponent is playing a waiting game as far as I can tell. Well, he did it for just a bit too long, now I'll snatch the initiative",
        "13. Nb5 Qb8": "My queen feels okay there, she's still eyeing the h2 square",
        "14. Ne5": "Throwing his knights at me, but their threats are easily parried ",
        "14... Nc6 15. Nf3 Bd6 16. Nxd6 Qxd6 17. Ng5": "This move would have been way more annoying if the white queen was on c2. Now I'm simply ignoring it, my knight defends h7",
        "17... Na5": "The knight is stubbornly continuing his journey to c4",
        "18. Qf3": "This move doesn't do much, of course he couldn't make Qc2 move as my rook controls the c file",
        "18... Nc4 19. b3 Na5 20. b4 Nc4": "Now I have a bit of a monster knight, no pawn can touch it",
        "21. Bxc4 Rxc4": "Handing over the outpost for the rook, now I'll be able to double up on the c file!",
        "22. Bb2 Rfc8 23. Rfe1 Rc4c2 24. Rab1 Rd2": "With a plan to double up on the second rank",
        "25. Re2 Rcc2 26. Rxd2 Rxd2 27. Bc3": "He at least should have tried to take the c file, then I might be in some trouble",
        "27... Rc2 28. Bb2 Ba6": "Capturing the f1 square from white king and also having an option to harass the white queen with Be2",
        "29. Qd1 Qc7 30. Rc1 Rxc1 31. Qxc1 Qc4 32. Qxc4 dxc4": "Although I'm not much of a positional player, but even I can understand I have an edge here. The domination of c file was awarded with a passed pawn!",
        "33. Bc3 Nd5 34. Bd2 c3 35. Bc1 c2 36. Nf3 Nc3 37. Ne1": "Missing the fork (probably)",
        "37... Ne2+ 38. Kh1 Nxc1 39. Nxc2": "I'm happy to exchange my passed pawn for a piece, I'll simply make other passed pawns having this material advantage!",
        "39... Nd3 40. f3 f6 41. h3 g5 42. e4 e5 43. d5 Nf4 44. g3 Nxh3 45. Kg2 g4 46. fxg4 Ng5 47. d6 Nf7 48. a4 Nxd6 49. Kf3 Bd3 50. Ne3 Bxe4+ 51. Kf2 Kf7 52. b5 Nb7 53. Nf5 Bxf5 54. gxf5 Nc5 55. Kf3 h5 56. g4 hxg4+ 57. Kg3 Nxa4 58. Kxg4 Nc3 59. Kf3 Nxb5 60. Ke4 a5 61. Kd5 Nd4 62. Kc4 b5+ 63. Kc5 b4 64. Kc4 b3 65. Kc3 a4 66. Kb4 b2": "Here my opponent resigned because he can't catch the b pawn and I was lucky to win against disliked d4!"
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess-http-gameknot-com?gm=38587",
    "gameName": "Let's play chess, http://gameknot.com/",
    "players": "mikec62 (1156) vs. eseth (1200)",
    "opening": "Queen's pawn game (E10)"
}