{
    "moves": {
        "1. d4 Nf6 2. e3 g6 3. b3 Bg7 4. Bb2 O-O 5. Nf3 d6 6. Be2": "I've been experimenting with this Zukertort-type setup as White.  When Black fianchettos, it sometimes makes more sense to expand on the Queenside rather than attack the King directly.  So Be2 might work better than Bd3.",
        "6... Nbd7 7. O-O Re8": "Black is playing for the e5 break, which makes sense.",
        "8. Nbd2 Nb6 9. c4 Bf5 10. Nh4 Bd7 11. Qc2 e5 12. dxe5 Ng4 13. Nhf3 Nxe5 14. Nxe5 Bxe5 15. Nf3 Bf5 16. Qd2 Bxb2 17. Qxb2 Nd7 18. Rfd1 Be4 19. Nd2 Bc6 20. b4 Qg5 21. Bf3 Qf5 22. Bxc6 bxc6": "White is better here, I think, because of the better pawn structure.  White should now focus on turning the immobile or isolated pawns into targets.",
        "23. e4": "Instead, I did this!  My idea was to follow with f3.",
        "23... Qf6 24. Qc2": "Here, I got stupid trying to be too tricky.  A straightforward Queen exchange, followed by f3 as I originally planned, would have left White slightly better.  Apparently I think I need my Queen on the board to improve my attacking chances.",
        "24... Qd4": "An excellent move that shuts down an immediate f3.",
        "25. Rde1": "Probably here I should have bitten the bullet with Kf1 and then played f3.",
        "25... Ne5 26. h3": "To prevent Ng4, which would have been brutal.",
        "26... Nd3": "Another excellent move.  Nd3 also targets the vulnerable f2 pawn.",
        "27. Nb3": "White's N has to move so the Queen can cover f2, but White will lose material now.",
        "27... Nxe1 28. Rxe1 Qf6 29. Qd2 Qh4 30. c5": "This is crazy.  f3 might still hold things together for a while.  Trying to pressure the center while already down the exchange is suicidal.",
        "30... Rxe4 31. Rxe4 Qxe4": "Black is now up another pawn.",
        "32. cxd6 cxd6 33. Qxd6 Qb1+ 34. Kh2 Qxa2 35. Qxc6 Rf8 36. Qf3": "This position is only survivable for White if all of the pawns somehow get traded off.",
        "36... Re8 37. Nd4 Qc4 38. Qc6 Qxc6 39. Nxc6 a6 40. Kg3 Re6 41. Nd4 Re4 42. Nc6 Rc4 43. Nb8 Rc3+ 44. f3 f5 45. Nxa6": "Eliminating a dangerous Queenside pawn.",
        "45... Rb3 46. h4 Ra3 47. b5 Rb3 48. Nc7 Kf7": "Black realizes that the King will have to help.  The R can't easily stop the pawn on its own with the N flying around.",
        "49. Kf4 Ke7 50. b6": "Rxb6? Nd5+ wins.  Of course, Black played carefully and didn't fall for any cheapos. ",
        "50... Kd6 51. Ne8+ Ke6 52. Nc7+ Kd7 53. Nd5 Kd6 54. Ne3": "This might not have been best, but Black is now winning here.  The R is much more mobile than the N.",
        "54... h6 55. Nxf5+": "Desperation.  There were much better moves available than this.",
        "55... gxf5 56. Kxf5 Rxb6 57. g4 Rb3 58. g5": "Another mistake.  I think the more pawns I hold on to the better.",
        "58... hxg5 59. hxg5 Rxf3+ 60. Kg6 Ke5 61. Kh7 Rg3 62. g6 Kf6": "And Black will take the last remaining pawn and checkmate shortly.  Well-played by Black and a good reminder to me to think more carefully about exchanges!"
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=59596",
    "gameName": "Let's play chess",
    "players": "mmoody95 (1773) vs. techbra (1746)",
    "opening": "Queen's pawn game (A45)"
}