{
    "moves": {
        "1. g3": "I'm not really comfortable with these flank openings as I do not know the best way to counter them. I dislike to become overextended so I don't usually throw my pawns forward.",
        "1... d5 2. Bg2 Nf6 3. Nf3 c5 4. Nc3 e6 5. d3 Nc6 6. O-O Be7 7. b3 O-O 8. e4": "?! This allows me to forward my centre pawns one rank and liberate my light-squared bishop. It also makes his fianchettoed bishop bad. I can say that the bishop on g2 won't play any role whatsoever in this game. Unfortunately, my opponent didn't need it!",
        "8... d4 9. Ne2": "9. e5? loses a pawn after 9... dxc3 10. exf6 Bxf6.",
        "9... e5 10. Nh4 Nh5": "?! A discovered attack on the knight on h4 and at the same time controlling f4, but my own knight will be vulnerable to discovered attack later on. ",
        "11. Nf5": "Obviously.",
        "11... Be6": "I didn't mind the trade of a knight for my dark-squared bishop as it's blocked by my own pawns.",
        "12. Nxe7+ Qxe7 13. Nxd4": "Attacks my knight on h4.",
        "13... Nxd4 14. c3": "Better than the alternative 14. Qxh5 Nxc2 15. Rb1 Nb4.",
        "14... Nf6 15. cxd4 cxd4": "At this point I was satisfied with how the opening went. My knight has obviously a brighter future ahead of him than my opponent's light-squared bishop.",
        "16. a4 a5": "? Loses the exchange, but perhaps his bishop is worth more in this position than the rook?",
        "17. Ba3 Qc7 18. Bxf8 Kxf8": "Wrong capture! My opponent can now quickly intensify the pressure on f7.",
        "19. f4": "This move does create a nice outpost for my knight on e3. Certainly when there is the option of winning the exchange back!",
        "19... Qb6 20. Rb1 Ng4 21. f5 Ne3 22. Qh5": "Unfortunately, I can not capture the rook as 23. fxe6 creates a mate threat on f7 and I therefore have no time to retreat the knight. Also, I figured 22... Bxb3 leaves my rook on a8 in peril as 23. Qxh7 Nxf1 24. Qh8+ Ke7 25. Qxa8 Ne3 favoures White. All of this could have been avoided if I had played 18... Rxf8 instead.",
        "22... Bc8 23. Rfc1": "?! It would be better to keep the rook on the f-file as 23... h6 would have allowed 24. f6.",
        "23... h6 24. g4 f6": "Trying to keep a strong dark-squared pawn-chain.",
        "25. Qg6 Bd7": "Necessary",
        "26. Qh7 Kf7": "Necessary too.",
        "27. Qg6+ Kg8 28. h4 Qd8": "Stopping 29. g5 but allowing White to double rooks on the c-file.",
        "29. Rc5 Qb6 30. Rbc1": "This allows me to capture two pawns, but all of my pieces will be pinned to their spots.",
        "30... Qxb3 31. Rc5c7 Qxa4": "My position is rather hopeless. I can only hope my opponent makes a mistake. My combination of queen and knight is unable to create serious threats for my opponents king. ",
        "32. g5 hxg5 33. hxg5 fxg5 34. Qxg5 Rf8 35. Qe7 Rf7": "No other way to protect my bishop. The bishop can't move because of Qg7#, but this move allows the nice shot...",
        "36. Rc7c8+": "I gave up, as 36... Bxc8 37. Rxc8+ is mate after 37... Kh7 38. Qh5# Well done, mustafaupk."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=32947",
    "gameName": "Let's play chess",
    "players": "mustafaupk (1560) vs. ragozin (1558)",
    "opening": "Benko's opening (A00)"
}