{
    "moves": {
        "1. b3": "Another close fought match with a few mistakes on either side which as a result could easily have gone either way",
        "1... e5": "It's a long time since I have seen this opening from white so I decided to go for the centre. This is the Nimzovich-Larsen attack, modern variation.",
        "2. Bb2 Nc6 3. e3 Nf6 4. Bb5 e4": "Played to avoid going a pawn down from Bxc6, b7xc6 Bxe5 which I didn't like the look of",
        "5. Nc3 a6": "There is only one game in the gameknot database that gets to this position",
        "6. Bxc6 dxc6": "I didn't like the possibly more natural bxc6 as it totally wrecked my pawn structure, this didn't look quite so bad as an alternative",
        "7. f3 Bf5": "This is the move that varies from the other game, there Bd7 was played.",
        "8. fxe4 Nxe4 9. Nxe4 Bxe4 10. Nf3": "Pretty much forced as Bxg2 would be unpleasant for white",
        "10... Qd5": "I'm still not entirely sure why I played this but it does make a claim on the centre and give me the option to castle",
        "11. O-O O-O-O 12. d3 Bxf3 13. Qxf3 f6": "I won't object too much if white exchanges as I can improve my pawn structure. This move was to protect the g7 pawn from whites bishop and it was also to prepare for a future pawn storm",
        "14. Qf5+ Kb8 15. e4 Qc5+ 16. Qxc5 Bxc5+ 17. Kh1 h5": "Here comes the pawns, can I make something of it",
        "18. Rae1 h4 19. e5 fxe5": "I didn't like the look of the alternatives here",
        "20. Bxe5 Rhg8": "protecting the pawn and preparing an advance but white had other ideas",
        "21. Rf7": "I had overlooked this",
        "21... Bd6": "about the only way to get out of it without losing material that I could see.",
        "22. Bxd6 Rxd6": "I preferred this to cxd6 due to Re-e7, which looked pretty nasty",
        "23. h3": "This seems a wasted move to me and was quite a surpise",
        "23... g5 24. Ree7": "and here it is, however as I still have a pawn on c7 I can resist the pressure",
        "24... Rc8 25. Rfg7 Rf6": "If white is going to start pawn grabbing I need to try to do the same",
        "26. Rxg5": "To me Kg1 looks better as it prevents my next move",
        "26... Rf2": "regains a pawn",
        "27. Rh7 Rxc2 28. Rxh4 Rxa2": "From here white looks better to me particularly with his connected passed pawns",
        "29. Rb4": "I dont understand this move ",
        "29... a5 30. Ra4 Rb2": "I preferred this to exchanging rooks as I was hoping to get a passer of my own",
        "31. Rgxa5": "and once again completely overlooked this move. Clearly white is threatening mate",
        "31... b5": "The only defence I could see from mate.",
        "32. Ra5a8+ Kb7 33. Ra4a7+ Kb6 34. Rxc8 Kxa7": "Now whites rook is a little stuck and although he can gain more material I think he has lost the initiative and I can get a passed pawn of my own",
        "35. Rxc7+ Kb6 36. Rd7 Rxb3": "Now there is surely going to be a race for promotion, I would hope that I have the advantage as my b pawn is one move ahead of whites pawns",
        "37. h4 b4 38. h5 Rb1+": "White has to be a little careful now as I have spotted a ploy that I am hoping will get me a queen and prevent him promoting but he is short of time and his rook is in no real position to gain more time e.g. with a check",
        "39. Kh2 b3 40. h6 b2 41. Rd8": "Threatens to skewer my pawn with Rb8",
        "41... Rh1+": "And now my plan comes to fruition, I really liked this move, probably one of the best I have played for some time.",
        "42. Kxh1": "Means that when I promote I can prevent the skewer as white will be in check",
        "42... b1=Q+ 43. Kh2 Qc1": "If h7 then clearly Qh6+ gains the pawn",
        "44. Rh8": "I need to be careful that I dont allow white to push his g pawn or his king (or both) up the board too far",
        "44... Qf4+ 45. g3 Qe5 46. Rh7 Qe2+ 47. Kh3 Qxd3 48. Rg7": "I'm looking to fork the pawn or rook with the king but white is too canny for that",
        "48... Qd6": "if h7 then Qh6+",
        "49. Rg4": "This was a shock, white concedes the pawn, and likely the game",
        "49... Qxh6+ 50. Kg2 c5": "Here white resigned. This was a hard fought match with mistakes on both sides, in the end there was an element of luck that prevailed. I think white still had chances right up to move 49 when he seemed to throw it away.\n\nPlease comment"
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=40870",
    "gameName": "Let's play chess",
    "players": "matanzas (1515) vs. elwoos (1552)",
    "opening": "Nimzovich-Larsen attack (A01), modern variation"
}