{
    "moves": {
        "1. d4": "This game was very complex. I was heavily challenged and was lucky to claw my way to a draw against a higher-rated opponent.",
        "1... d5 2. Nc3": "An immediate attempt to throw me off. I was expecting the Queen's Gambit.",
        "2... Nf6 3. Nf3 e6": "With my center secured, I now have to develop my pieces.",
        "4. Bg5 Be7 5. Bxf6 Bxf6": "I gain a minor exchange.",
        "6. e4 O-O": "Always castle early if you can...  I realize White can advance his e-pawn, but I would rather secure my King than worry about my Bishop being driven.",
        "7. e5 Be7 8. Bd3 c5": "Time to try and gain Queen-side space, as White controls more territory on the King-side.",
        "9. dxc5 Bxc5": "White decides to let me free up my Bishop.",
        "10. O-O Nc6 11. Na4 Be7": "I could have given back the minor exchange and activated my Queen with 11... Bb6 12 Nxb6 Qxb6. I didn't feel activating my Queen was worth it.",
        "12. c3 Bd7 13. b4": "White attempts to seize Queen-side space.",
        "13... Rc8": "I counter by attempting to pressure the exposed, backward c-pawn.",
        "14. Re1 Nb8": "Now my Rook aims down the c-file at the pawn.",
        "15. b5 a6": "I want to get rid of White's advanced b-pawn.",
        "16. Rb1 axb5 17. Bxb5 Bxb5 18. Rxb5": "I'm still up a minor exchange, and White's Pawn-storming attack has been neutralized. But now I have a weak pawn on the b-file. Defense will be a priority.",
        "18... Rc7 19. Qb3": "The b-pawn will fall.",
        "19... Nd7 20. Rxb7 Rxb7 21. Qxb7": "I'm down a Pawn. If I can remove White's passed a-pawn from the board, I feel I can hold the endgame.",
        "21... Nc5 22. Nxc5 Bxc5": "The more even exchanges there are, the better my position becomes. If I can have a Bishop vs. a Knight in the endgame, I feel I can easily hold, even down 1 Pawn.",
        "23. Nd4 Qa5": "I'm sure not going to exchange minor pieces.",
        "24. Nb3 Qxc3": "Material is even. Now to get rid of that obnoxious a-pawn...",
        "25. Rc1": "Uh-oh. Now I'm going to be down a piece. Maybe I should have traded minor pieces after all.",
        "25... Qxe5": "My Bishop is a goner anyway, so I may as well take the loose Pawn.",
        "26. Nxc5 Qe2": "A glimmer of hope. If I can capture that a-pawn and exchange the heavy artillery, I think my 5 Pawns can hold up against Black's 3 Pawns and 1 Knight.",
        "27. a4 Qd2 28. Nb3 Qf4": "Still harping on the same theme.",
        "29. Rc8": "White fell into the trap! Now I can not only get rid of the a-pawn but also exchange off the Rooks.",
        "29... Qxa4": "Finally!",
        "30. Rxf8+ Kxf8": "Now to exchange off the Queens and coast into a draw.",
        "31. g3 Qe8 32. Nd4 Qe7": "In position for exchange...",
        "33. Qb8+ Qe8 34. Qc7 Qe7 35. Qb8+": "White can make no progress. I accept the draw offer. A very interesting game."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=27444",
    "gameName": "Let's play chess",
    "players": "twoman51 (1485) vs. thehellion (1271)",
    "opening": "Blackmar-Diemer gambit (D00)"
}