{
    "moves": {
        "1. e4 e6 2. d4 Nc6 3. Nf3 b6 4. c3 Qf6 5. e5 Qf5 6. Nh4": "6. Nh4 was a particularly stupid blunder, which black capitalized upon with Qe4+.",
        "6... Qe4+ 7. Be2 Qxh4 8. g3 Qd8 9. Bf3 d5 10. exd6 e.p. Qxd6 11. Bf4 Qd7": "With Qd7 white thinks--the knight is pinned (not the queen).  Bxc6 forks the rook and pin-forks the queen.  Qd7 is the seventh time black has moved this piece, sacrificing development of the board (though still up white's knight).\n",
        "12. Qa4 Na5": "?? Bc7 protects the knight.  Now QxQ is mandated for a free rook.",
        "13. Qxd7+ Kxd7": "13. Why Kxd7 instead of Bxd7?  The rook is already lost.",
        "14. Bxa8 c6 15. Nd2 Ba6 16. b4 Bb7": "Forcing trades is probably not in black's best interest, rook to knight, as the inexorable law of increasing ratio makes white's remaining rook all the more valuable.",
        "17. Bxb7 Nxb7 18. a3 h6 19. Nf3 Nf6 20. Ne5+ Kc8": "Which free pawn?  Nxf7 threatens the rook, which must simply move.  Nxc6 weakens black's king side, but doesn't break up the pawns as much as the first option.  White foolishly molests c6.",
        "21. Nxc6 Ne4 22. Nxa7+ Kd8 23. Nb5": "White moves to protect pawn @ c3.",
        "23... Be7 24. O-O Bg5": " Although exchanges strengthen white's material advantage, black's response (Pxg5) opens the pawn @ h2 to attack.  Mm, or not--white stupidly thought Ng4 was an option for black.  Actually, Nxg5 (white's bishop), followed by Nf3+ and black's rook pawn slides down to create havoc and mayhem.",
        "25. Bc7+ Kd7 26. f4 Kc6": "This was a questionable move as black's bishop is more valuable than the white knight.  White thinks, \"trade up while I'm ahead?  Free pawn (Rxf7) to boot!\"\n",
        "27. fxg5 Kxb5 28. Rxf7 g6": "There is a lot of pressure on the pawn @ g5.  The wise thing for white would be to trade pawns @ h6.",
        "29. Be5": "White elects to push the rook of that file instead, opening an attack on the knight @ b7.  Black brings more power on white's pawn @ c3.",
        "29... Rc8": "Ok, what material has the higher value, the pawn or the knight?  Pxh6 might yield a queen in two more moves.",
        "30. Rxb7 Nxg5": "Nxg5 keeps black's pawns from being doubled.",
        "31. a4+": ""
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=34891",
    "gameName": "Let's play chess",
    "players": "pasha582 (1200) vs. bebescrew (1200)",
    "opening": "French defence (C00)"
}