{
    "moves": {
        "1. e4 c5 2. f4": "I was hoping for a Kings gambit, my fav move nowadays. Oh well, reflexively I  still play f4- ppl have told me this is the Grand prix opening.",
        "2... e6 3. Nf3 d6 4. Bc4 Nc6 5. O-O": "Want to castle quickly and attack his kingside",
        "5... Be7 6. Nc3 a6 7. a4": "to prevent b5",
        "7... Na5": "I dont think his knight move to a5 accomplishes anything. Knight is pushed to one side of the board.",
        "8. Ba2": "And I simply withdraw here, from where this serpent can uncoil and strike its long arm later",
        "8... b6 9. d3": "activate my dsb",
        "9... Bb7 10. Be3": "okay, all pieces developed. Now it is 'har har mahadev'- Hindu war cry, lol",
        "10... Nf6 11. Ng5": "Decide to attack his kingside, no definite plan as such. Feeling, exploring, needling a superior ranked player",
        "11... h6": "withdraw my knight, no I have other ideas. Can you guess?",
        "12. e5": "harass his knight, disrupt his center. If h6 x N, then the pawns on his kingside shall be disrupted",
        "12... Nd7": "quiz- what would you do now ?? Think.... then see what I did next !!",
        "13. Nxe6": "Wham- knight sacrifice- if he takes it ....the fun begins. Fasten yr seatbelts",
        "13... fxe6 14. Qh5+": "wham-  the wicked witch blasts into place",
        "14... Kf8 15. Bxe6": "He is in trouble. Almost certainly will lose his knight on d7, and if I can only open up the f file.",
        "15... g6": "he surprised me with this move,  I had been expecting Q to e8",
        "16. Qxg6": "never mind.  gobble gobble for now",
        "16... Qe8 17. Qf5+ Kg7 18. Bxd7 Qd8 19. Ne4": "Don't like his lsb pointing at my g2 pawn. Dont want complications should his rook move to g8 in the future. Also brings my knight over into the attack",
        "19... Bxe4": "oh well, he goes for the exchange",
        "20. dxe4 Rf8": "now his turn to harass, rightly so wants to drive my queen away. Note- I am 3 pawns up",
        "21. Qg4+ Kh8": "What do I do now?? I think of a way to bring my bishop to c3 with an uncluttered a1- h8 diagonal. watch..",
        "22. exd6 Bxd6 23. Bd2": "bishop withdraws for now ",
        "23... Be7 24. Rad1": "suddenly, I decide to postpone the move of my dsb for now. bringing this rook here, I kind of eye his queen !!",
        "24... Nc4": "his knight springs into life and surprises me. In one move it has centralised and if it moves to e3- it is a royal fork attacking both rooks and queen. Be very careful...",
        "25. Bc3+ Bf6 26. Qg6": "Dont mind the bishop exchange for he has lost his h pawn. The defence of his king is crumbling",
        "26... Bd4+ 27. Bxd4+ cxd4": "he has blocked off the d file and my bishop could be lost",
        "28. Qxh6+ Kg8 29. Be6+": "bishop escapes",
        "29... Rf7 30. Qg6+ Kh8 31. Qxf7": "Dont mind if his knight forks me on e3, for my f rook will go to f3- h3, mate.\r\nHope you enjoyed, this is chess for fun, for adrenalin junkies.\r\nWhen his pawn came out to harass me on move 11- h6- he had no idea that an attack could materialise from nowhere. COULD HE HAVE SAVED THE GAME AFTER MY KNIGHT SAC- pl let me know.\r\nPl comment freely and pl rate if you think this game is good."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=22061",
    "gameName": "Let's play chess",
    "players": "dmisra (1575) vs. billbaggins (1649)",
    "opening": "Sicilian (B21), Grand Prix attack"
}