{
    "moves": {
        "1. e4": "Nothing noteworthy in the opening...\n ",
        "1... c5 2. Nf3 Nc6 3. Nc3 e6 4. Bc4 a6 5. a4 Qc7 6. O-O Nf6 7. d3 Be7 8. Ne2 O-O 9. c3 e5 10. Be3 d6 11. h3 h6 12. Ng3 Na5 13. Ba2 c4 14. d4 b5": "The a6,b5,c4 pawn-chain proves to be durable enough to determine outcome of the game.",
        "15. Nf5 Nxe4 16. Nxe7+ Qxe7 17. dxe5 dxe5 18. Qd5 Bb7 19. Qxe5 Qxe5 20. Nxe5 Nf6": "d5 is a better square for the Black Knight.",
        "21. axb5": "White hopes to break the a6,b5,c4 chain chain formed in move 14, but the chain proves\nto be more durable than he thinks.",
        "21... axb5 22. Bb1 Nd5 23. Be4": "With this move white is forced to trade-off both his Bishops!",
        "23... Nxe3 24. Bxb7 Nxb7 25. fxe3 Rxa1 26. Rxa1 Re8": "27...Re8?!  gives the white knight an opportunity to move to d4 via f3 which is a much better square, and suddenly the pawn on e3 looks poisoned as Black's rook will be in the wrong place for defending the back rank.",
        "27. Nf3": "One possibility here is 27. Ra7, but Black might be able to remain up a pawn after some tricky moves, e.g.: 27.Ra7 Nd6 28.Ra6 Rxe5 29.Rxd6 Rxe3 30.Rd5 b4! 31.cxb4 Rb3",
        "27... Rb8": "Black was planning 27...Rxe3, but after 28.Ra7 Nd6 29.d4 Black needs to reconsider his greed. ",
        "28. Ra7 Nc5 29. Ne5": "I expected White to play 29.Nd4",
        "29... f6 30. Nc6 Rb6 31. Ne7+ Kh7 32. Nf5": "Also good was 32.Nc8 Rb8 or Rb7 followed by 33.Nd6",
        "32... Kg6": "Brain freeze: Black didn't see 33.Nxg7.  Black thought Kg6 was safe and then suddenly he is faced with mate after ...34.g4! h5??",
        "33. Nxg7 Nd3 34. g4": "34.g4!  A very subtle move.  34...Kg5 35. Nf5 is mate in 1.  34....h5 is also mate in 1.",
        "34... f5": "34...f5 sacrifice is Black's only chance.",
        "35. Nxf5 Nxb2 36. Rg7+ Kf6 37. h4": "37.h4?!  Better was 37.Rh7 Kg6 Rh8 to be followed by Rg8 ",
        "37... Nd1": "37...Nd1 is slightly better than Na4 because it helps keep White's King on his back rank.",
        "38. h5 Rb8 39. Rg6+ Ke5": "Big decision: centralize the King or try to guard g8.  39...Ke5 gives White less counter play so the brave King advances.",
        "40. Rxh6": "40.Nxh6 is slightly better because after Rxh6 White cannot move g5 without preparation.  However, Nxh6 leaves the Knight less active.",
        "40... Nxc3 41. Rc6": "41.Rc6 was a triggered move.  White seems concerned about Black's pawns and has put his own pawn-plans on hold.  Although a pawn down, Black is almost winning.",
        "41... b4": "41...b4!!  42.Rxc4 or Nd4 doesn't prevent the b pawn from advancing.",
        "42. Rxc4 b3 43. Rxc3 b2 44. Rc5+ Ke6": "44...Ke6! is best.  Every other King move allows the Rook-sacrifice for the b pawn which is White's last hope.  Black must take care to avoid any Rook checks on the d-file to prevent White from getting his Rook to d1 with tempo, e.g. 44...Ke6! 45.Rc6 [Kd7? or Kd5? 46.Rd6 ] Kf7 46.Rc7 Kf8.  Worse is 44...Ke4 which allows White to force the King to e2 allowing the Rook to fork the King and pawn.  And deadliest is 44...Kf6 45.Rc6  Kg5 46.Rg6#",
        "45. Nd4+ Kd6 46. Rc6+ Kd5 47. Rc7 b1=Q+ 48. Kg2 Rb2+ 49. Kg3 Qg1+ 50. Kh4 Qh2+": ""
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=7992",
    "gameName": "Let's play chess",
    "players": "bahnareanuvasile (1589) vs. markb56 (1576)",
    "opening": "Sicilian defence (B30)"
}