{
    "moves": {
        "1. e4 c5 2. Nf3 e6 3. d3": "I, of course, immediately get out of the standard variations. 3. d4 is considered more normal",
        "3... a6": "This is typical of the Kan variation hoping for b5 and a Queenside attack I later learned but I'm flaililng blindly now",
        "4. g3 Qc7 5. Bg2 d6 6. O-O Nf6": "Lots of development on both sides",
        "7. Bg5 Be7 8. Nbd2": "I thought the d2 square offered more possibilities for my knight than the c3 square",
        "8... Nbd7 9. Qe2 Rb8": "The rook behind the b pawn almost always seems to work out well.",
        "10. c4": "I'm worried about attacks down my Queenside at this stage and wanted to forestall them",
        "10... b5 11. a3 h6 12. Bxf6": "I thought 12. Be3 was really putting me into a cramped position. 12. Bh4 g5 loses the Bishop",
        "12... Bxf6 13. Rab1 Nb6": "I thought this was an odd place for the Knight at the time but it ends up being a nice support piece for a few moments",
        "14. Rfc1": "Action quickly shifting to the Queenside",
        "14... bxc4 15. Nxc4": "I thought 15. dxc4 left my e pawn in a precarious position",
        "15... Nxc4 16. Rxc4 O-O 17. d4 a5": "17. ... cxd4 18. Rxc7 loses the Queen",
        "18. Rcc1": "I wanted to open the diagonal for my Queen to penetrate. I'm looking at that a pawn as weak and a target",
        "18... Qa7 19. e5 dxe5 20. dxc5": "20. dxe5 Be7 might be better for white. Also possible is 20. Nxe5 Bg5 21. Nc6 forks Queen and Rook. I think I made the worst decision here although it is not directly bad.",
        "20... e4": "Trying to make use of the bad pawn",
        "21. Ne1": "21. Qxe4 Bb7 does not seem bad for white and I'm not sure why I didn't capture.",
        "21... e3 22. b4": "22. Qxe3 Bg5 pins my Queen against the Rook. 22. fxe3 creates an isolated pawn and weakens my defense but was probably the best choice.",
        "22... exf2+ 23. Kxf2 axb4 24. axb4": "24. Rxb4 Rxb4 25. axb4 is not bad for white but black does not have to capture with the rook. 24. Rxb4 Ba6 connects Blacks rooks with Tempo as my Queen is under attack",
        "24... Bd4+": "Now the attacks begin and I'm in serious trouble",
        "25. Kf3 Qe7 26. Nd3 e5": "Opens the very dangerous diagonal for the light squared Bishop",
        "27. g4": "Trying to close it down",
        "27... f5 28. Rcf1": "28. gxf5 Rxf5+ 29. Kg3 Rg5+ 30. Kf3 Qf6+ 31. Ke4 Bb7+ and white is pretty much finished",
        "28... fxg4+ 29. Kg3 Bf5 30. h3": "Trying to find somewhere safe for my King. The black Bishops are extremely strong",
        "30... h5 31. Kh2": "31. hxg4 Bxg4 32. Qa2+ is probably better for white gaining me a Tempo at least",
        "31... gxh3 32. Be4 Bxe4 33. Qxe4 Qg5 34. Kxh3 Rxf1 35. Rxf1 Qe3+ 36. Qxe3 Bxe3": "Massive trade off and I cannot protect my two pawn from the coming attacks",
        "37. Rf5 e4 38. Re5": "38. Ne5 Rxb4 and the other pawn will fall quickly leaving Black's dangerous e pawn a lane to promotion.",
        "38... exd3 39. Rxe3 Rxb4 40. Rxd3 Rc4 41. Rg3": "41. Rd5 g6 and my king is trapped behind the Black Rook and Black's King moves forward to snap up my last pawn. I thought I could snag the h pawn and possibly get a draw",
        "41... Rxc5 42. Kh4 Kh7 43. Rg5 Rxg5 44. Kxg5 g6": "The killer move. Now Black wins easily and I resigned. I thought this was a very sharp game with good attacking lines on both sides down the Queenside. The doubled black pawn ended up destroying my position and forcing me onto the defensive although I still had some counterplay. I had to be very sharp on the defensive because of numerous threats and almost managed to salvage the game. OldGus says that I had some strong attacks and felt this was winning or draw for White but I could not find the moves."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=28841",
    "gameName": "Let's play chess",
    "players": "tomlib (1481) vs. oldgus (1593)",
    "opening": "Sicilian defence (B40)"
}