{
    "moves": {
        "1. d4 Nf6 2. Nf3 e6 3. a3": "My rival makes a irregular move, may be try out my opening´s theory.",
        "3... c5": "If black plays 3...  b6, with 4 c4 enter in Petrosian system in QID",
        "4. c3": "After this move, black isn´t play b5. A punch to nobody.",
        "4... b6 5. Nbd2": "With 5 Bf4, white controlling e5 and black must play with attention. With the game´s move, White can play e4.",
        "5... d5 6. e3": "Similar a COlle system",
        "6... Bd6 7. Bd3 Nc6 8. h3 Bb7 9. O-O O-O 10. b4": "I analized Re1. this move open the c-column for me.",
        "10... cxd4 11. cxd4 Rc8 12. Bb2": "White pressure e5, with threat the e4 and e5 fourchette. ",
        "12... Qe7 13. Rc1 a6 14. Qe2 b5 15. e4": "Thematic advance. White now creates a isolated pawn for himself but try to attack in the kingside.",
        "15... dxe4": "Forced, of course. ",
        "16. Nxe4 Nxe4": "Forced, too. If I no take the Knigth, 17 Nxf6 Qxf6 and 18 Ne5 and cannot Nxe5. ",
        "17. Bxe4": "I think what Qxe4 was better. 17 Qxe4 g6 and h6 and f6 squares are weaks",
        "17... Nb8": "Will go to c4 or d5",
        "18. Bxb7 Qxb7 19. Ng5": "Lost time. Threat Nxe6 or Qh5, but both are neutralized. ",
        "19... Qd5": "Now, if 20 Qh5 h6 winning a piece.",
        "20. Nf3 Nd7 21. Rxc8 Rxc8 22. Rc1 Rxc1+ 23. Bxc1 Nb6": "THe exchanges gives me this move",
        "24. Qc2 h6": "24 ... Nc4 is an alternative. But I like this move, prevents 25 Ng5 g6 26 Ne4. May be 25 ... f5 it`s better, but I do not like create a weak pawn in e6.",
        "25. Be3 Nc4 26. Qc1 Kh7 27. Qc3 Qe4 28. Nd2": "Now, this move allows what I can force the exchanges, to go a bishop ending. I value adventage for me, because the isolated pawn in d4 an a3-b4 chain, all in dark squares.",
        "28... Nxd2 29. Qxd2 Qb1+ 30. Qc1 Qxc1+ 31. Bxc1 Kg6": "The ideal square for the king is d5. But, I cannot.",
        "32. g4": "Good move, now, I can not plays Kf5. If 32 ... f5 33 f4",
        "32... Kf6 33. f4 Ke7 34. Kf2 f5": "Now, with the king in the center, this move allows me create a passed pawn in h or blocked the white pawn in dark squares. If 35 g5 h5.",
        "35. Ke3 fxg4 36. hxg4 g6 37. Kf3 Bc7": "Bishop gives the place for the king, threats Kd5",
        "38. Be3 Kd6 39. Ke4 h5": "a passed pawn. ",
        "40. gxh5 gxh5 41. Bg1 h4 42. Bh2 h3": "Pressure, if 43 f5+ Kc6 (not 43... Kd7 44 fxe6+) and I am safe.",
        "43. Bg3": "White are in zugzwang?... May be, but I can´t affirmed that",
        "43... Kc6": "Now, this move gives d6 to the bishop. Try 44 ... a5 and if white does not takes 45 ... axb4 and 46 Bd6 with two passed pawn, in both wings.",
        "44. Bh2 a5 45. bxa5 Bxa5 46. Ke5 Kd7": "I can choice too 46 ...Bc3 47 Kxe6 Bxd4 48 f5 Bb2 49 f6 Bxa3 50 f7 Bc5 to not blocked the a3 f8 diagonal. "
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=40016",
    "gameName": "Let's play chess",
    "players": "borisrub (1695) vs. chizzo83 (1730)",
    "opening": "Queen's pawn (A46), Torre attack"
}