{
    "moves": {
        "1. e4 d5": "Counter-Counter, one of my favorite openings as of late.",
        "2. exd5 Nf6": "Scandinavian.  I am prepared to lose the pawn to gain development.",
        "3. c4 e6": "Scandinavian, Icelandic gambit.  if \n4. dxe6, Bxe6 and I am a pawn down with 2 minors developed.  ",
        "4. dxe6 Bxe6 5. d4 Bb4+": "Clears way for castle while providing check.",
        "6. Bd2 Bxd2+": "Trade off dark squared bishops.  Qxd2 is expected in lieu of Nxd2 due to following Qxd4",
        "7. Qxd2 O-O 8. Be2 Re8": "Looking to establish a pin on the bishop at e2.",
        "9. Nc3 Bxc4": "Take the free pawn and pin the bishop.",
        "10. Nf3 Qe7": "Now I have 3 attackers to 3 defenders on the bishop, with one of them being the king.  He cannot castle yet without losing the bishop.",
        "11. Ne5": "Ok, he interposed.  I need to trade off the bishops while I can.",
        "11... Bxe2 12. Nxe2": "More expected Qxe2 here, but don't know how that would play out.",
        "12... c5": "The c5 push attempts to strip the defender off the N at e5.",
        "13. f4": "He supplies another defender.",
        "13... cxd4 14. Nxd4 Ng4": "Playing to pick up the f4 pawn.  Trade knights, and pick up the pawn in the process.",
        "15. O-O Nxe5 16. fxe5 Rd8": "Instead of playing Qxe5, which would be followed by Rfe1! and cause me problems, I decide to put a pin on the knight at d4.",
        "17. Qe3": "Removes the pin while defending.",
        "17... Qc5": "Re-applies the pin, and adds an attacker.  At this point, I should be able to supply more attackers than he can defenders.",
        "18. Rad1": "Adds a defender",
        "18... Nc6": "and I add an attacker.",
        "19. Rf4": "And he adds a defender.",
        "19... Rd5": "Ok, so I'm looking to do Ra-d8 next move and complete the imbalance of attackers and defenders.",
        "20. Rd3": "This causes me pause.  If 20. ... Ra-d1, then Rc3 threatening my queen.  This gets somewhat dicey, so I decide to chance my target.",
        "20... Rxe5": "Noticing that I do have an available check at Qc1 (which is guarded by his Queen), I decide to take the pawn and threaten the Queen.  See if I can get him off.",
        "21. Qf3": "So now if I move Qc1 , he has Rd1 to block and threaten the queen.",
        "21... Nxd4": "Ok, let's get the knights off the board, see if I can open this up a little.",
        "22. Rfxd4 Rd8": "Rook at d4 is pinned.  I can apply 3 - 2 attackers to defenders on this point.",
        "23. b4": "Ok, looked at doing Qb6 to maintain the pin.  I must either maintain the pin or check, because if not then 24. Rxd1#.",
        "23... Qc1+": "So I decide to check.  Some possible lines:\n\nif 24. Kh2 Qe1#\n\nif 24. Qd1 Qxd1  and I can exchange Queens and Rooks, and play for endgame with a king side majority.\n\nif 24. Rd1 Re1  25. Kf2 (Rxe1 Qxe1  26. Qf1 Qxf1  27. Kxf1 Rxd4 and a rook up) Rxd1 which results in a trade off with me a pawn up on king side majority.",
        "24. Kf2 Qe1#": "So he didn't see the mate threat. "
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=6991",
    "gameName": "Let's play chess",
    "players": "willempie (1630) vs. kwijybo (1536)",
    "opening": "Scandinavian (B01), Icelandic gambit"
}