{
    "moves": {
        "1. e4": "e4 is good choice, open debut when you want to play and win",
        "1... e5": "e5 is correct",
        "2. Bc4": "bishop on c4 is old idea but so what???",
        "2... Nf6 3. Nc3 c6": "c6 looks not good and in my oppinion is waste of time",
        "4. Nf3": "but knight on f3 is not the best move now...",
        "4... d5": "d5 is absolute expectable",
        "5. exd5": "e:d is just one if white doen't want to play only in defence in this game...",
        "5... b5": "b5 is in the first view active move but in deeply thought is bad waste of temp",
        "6. Bb3 b4": "b4 is maybe outside of a correct course",
        "7. Na4": "knight goes to the end of board and this is not best zone for active play...",
        "7... e4": "e4 is not conditional move in my strategy... so untypical move",
        "8. Ng5": "this may be  not the best idea there for white to play...",
        "8... Nxd5": "now black control the center and have good bishops... white have quick Chance to make 0-0",
        "9. Nxe4": "White take a pawn and black now have a good temp and attack",
        "9... Qe7": "horse on e4 is bad animal ;-)",
        "10. Qe2": "just one saving move there for white",
        "10... Nf4": "so interesting idea - now have knight on g2...",
        "11. Bxf7+": "now white make decision to play aggressive and make risk move",
        "11... Kxf7": "best move because if queen takes on f7 white have knight on d6!",
        "12. Qf3": "NOW there are 2 stupid animals on the board - on e4 and f4 ",
        "12... g5": "g5 is terrible and really bad... but only for the black :-)",
        "13. g3 Bg4": "good idea for black- now if white play Q:g4 black have q:e4 and after this Q:h1...",
        "14. Qb3+": "just one saving move in this position...",
        "14... Be6 15. Qf3": "and again just one saved move... now black have a draw if they want but black want to win!",
        "15... Bh6": "this is realy stupid move...",
        "16. O-O": "0-0 and all problems with security of white king is over",
        "16... g4": "g4 is aggressive but not so deeply move",
        "17. Qd1": "queen on d1 is the best one... now white have d3 or d4 or g:f",
        "17... Bd5": "black bishop goes to the h1-a8 diagonal",
        "18. d3": "d3 is security one",
        "18... Bxe4": "this is relay bad decision for black... strong bishop for knight",
        "19. dxe4 Qxe4": "now black have Q on g2",
        "20. Bxf4": "best one in this situation",
        "20... Bxf4": "now white have g:f and rock on e1 and after this g:f...",
        "21. Re1 Qf5 22. gxf4 Qxf4": "now white have good rocks and queen but have a bad figure as well on a4... also g line is trouble for white king and g4 pawn is danger...",
        "23. Qd3": "white see Queen on G3 and then rock on a-d1",
        "23... g3": "black play bullshits now",
        "24. fxg3 Qg5": "now attack have just white",
        "25. Ref1+ Kg7": "and no place for black king :-)",
        "26. Qd4+ Kg6": "black king goes to the centre.",
        "27. Rae1": "now the winner is ready!",
        "27... c5": "miserable attempt to go to  draw",
        "28. Re6+": "best move\r\nnow black king must go to h5 and see kings guillotined head :-)",
        "28... Kh5 29. Qd1+": "check",
        "29... Qg4 30. Rf5#": "and mate!"
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=11414",
    "gameName": "Let's play chess",
    "players": "toni_the_man (1593) vs. milaro (1481)",
    "opening": "Bishop's opening (C24), Berlin defence"
}