{
    "moves": {
        "1. e4": "I hate, i hate openings... every time i see the first move, my mind says \"oh non, pas celle-là, encore!!!\"",
        "1... e5 2. Nf3 Nf6": "well, I have to review my Petrov, because i lose more than I used to, when I played against \"real people\".",
        "3. Nc3": "Oh, non! pas les trois cavaliers!",
        "3... d6 4. Bc4 Be7 5. d3 O-O 6. O-O Nc6 7. Bg5 h6 8. Bxf6 Bxf6 9. h3 Be6": "and this is the first bizarre move i really do like.",
        "10. Bxe6 fxe6": "and I really like this position... For me, it is the best I can achieve when we are both castled king size: my rooks are close to be linked, f-column is my reign and my only weakness cannot be easily attacked. I only fear the possibility of d4, but I usually have time before it.",
        "11. a4": "well this is new to me",
        "11... Qd7 12. Nh4": "ok, this is a terrible mistake, but we are not here to \"analyze\" it",
        "12... Bxh4 13. Qg4 Qe7": "I made a mistake here. not to big, but though: my queen is overcharged of defense: h4, e6 and c7.",
        "14. Nb5 Bg5": "i tryed to discharge... but why didn't I go back to f6? Because I wanted not to lose tempo for my f-column, even at the cost of a pawn",
        "15. g3 a6 16. h4 Bxh4 17. Nxc7 Qxc7 18. Qxe6+": "pawn lost? No, no... let's see the next moves.",
        "18... Kh8": "forced",
        "19. gxh4": "forced and this is a terrible situation, by the way.",
        "19... Qe7": "i hoped he would go away...",
        "20. Qxe7": "but he really pleased me.",
        "20... Nxe7 21. a5": "thank you again: the h-pawn is definetely mine. Could have saved it (temporarily) with 21. Kg2 and 22. Rh1.",
        "21... Ng6 22. h5 Nf4 23. Kh2 Nxh5 24. Ra3 Rac8 25. c4 Nf4": "i guess in my mind it was: the piece you have has to be the one active. It took time to me to appreciate Knights, but now I really do love them.",
        "26. b4 Rf6 27. b5": "that is a nice attempt to strike back by the way. All the credit to shammer not to resign. He found good ideas, according to me",
        "27... Ne2 28. bxa6 bxa6 29. Rb3": "like this one",
        "29... Ra8": "not Rc6 30. Rb6 and I am in terrible mess...",
        "30. Rb6 Nc3 31. c5 Na4": "Maybe taking directly 31. ... dxc was better. but I was preoccupied by the potential arriving of the second rook",
        "32. Rxd6 Nxc5 33. Rd5 Rc6": "ok, take my e-pawn, i take your d-pawn",
        "34. Rc1 Rac8 35. Rg1 Kh7 36. Rxe5 Nxd3": "as we said...",
        "37. Re7": "last attempt to scare me, but it was pretty obvious, no?",
        "37... Rg6 38. Rf1 Rc5 39. f4": "oh, no, another attempt, true... but this accelerate the end",
        "39... Rc2+ 40. Kh3 Nf2+ 41. Kh4 Nxe4": "woups, threats mate in one! You cannot take my horse...",
        "42. Rf3 Rh2+ 43. Rh3 Rxh3+ 44. Kxh3 Nc5 45. f5 Rf6 46. Re5 Nd3 47. Re6": "and finally thanks for this last mistake... But I enjoyed the game for the nice bizarre situations... Probably didn't deserve the annotation, but I liked it",
        "47... Nf4+": ""
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=31656",
    "gameName": "Let's play chess",
    "players": "shammer (1398) vs. thitho (1714)",
    "opening": "Petrov three knights game (C42)"
}