{
    "moves": {
        "1. c4": "this was an interesting game where i had to conserve my nerves against a powerful and intimidating attack. hopefully there was nothing probing in it, and i had the opportunity to claim back the center to take the initiative, until i had the possibility to gain a pawn, There is wher my opponent decided to \"give\" me a bishop... the end is less funny.",
        "1... e5 2. Nc3 Nf6 3. e4 Bb4 4. d3 Bxc3+ 5. bxc3": "i like this opening.",
        "5... h6 6. Nf3 d6 7. Ba3": "this is a try, first time i do it. Won't do it again, there is nothing there for white light bishop",
        "7... c5 8. Qc2 O-O 9. Be2 Nc6 10. O-O": "already ending the development.",
        "10... Nh7 11. Nd2 f5": "f5 from black: always a threat!",
        "12. f3 Qg5 13. Bc1": "the bishop has to go back before the a1 rook could enter into the defence game. but it will be all right. I calculated it.",
        "13... f4": "closing the attack: it gives me some tempos...",
        "14. Nb3 Bh3": "of course: this was a possibility, but, once again, nothing decisive.",
        "15. Rf2": "no black dark bishop, no knight can attack this strong rook.",
        "15... Be6 16. Bf1": "overcastling",
        "16... Rf6": "second attack",
        "17. Bd2": "preparing my own counter-attack",
        "17... Rg6": "yes, yes, yes... still nothing...",
        "18. Be1 Rf8": "here you are... but many people for such a small place, isn't it?",
        "19. a4": "my turn",
        "19... a5": "this is exactly what i wanted: close a place for your knight",
        "20. Qd1": "is she pointing f3?",
        "20... Bh3 21. d4": "NO, she is pointing d4!",
        "21... exd4 22. cxd4 cxd4 23. Nxd4 Nxd4 24. Qxd4": "and here i am!",
        "24... Qe5 25. Rd1 Qxd4 26. Rxd4": "\"this is the place i always wanted to beeeee\"",
        "26... Bd7": "threatening a4?",
        "27. c5": "not quite. if you take it, i take you. If dxc5, i take you... so back up!",
        "27... Bxa4": "wazup??? i told you to back up!",
        "28. Rxa4 dxc5 29. Rxa5": "i have two versions: or he was distracted, or he thought: my best chance is to go on with these two isolated pawns... but really they are too isolated... and my bishops are strong. And your knight is so far!",
        "29... b6": "yes, yes yes...",
        "30. Rb5 Ng5": "threatening Nh3+ and a fork",
        "31. Kh1": "so the king gets a room",
        "31... Rc6 32. Bc4+": "blockade to give time to the other pieces. the check was a bonus",
        "32... Kh8 33. Rfb2 Rd8": "i expected Rb8, so i could make Bf2, but he is looking for the easy mate.",
        "34. Bd5": "cut the passage.",
        "34... Rcd6 35. Rb5xb6 Rxb6 36. Rxb6": "simplificate.",
        "36... Rc8 37. Bc4": "blockade again",
        "37... Rd8": "insisting",
        "38. Kg1": "mate threats is over",
        "38... Rc8 39. Bd2 Rf8 40. Rc6": "hard to protect two pawns with one rook... the end is an esay one.",
        "40... Rf6 41. Rxf6 gxf6 42. Bxf4 Kg7 43. Bd6 h5 44. Bxc5 h4 45. Bd5 Nf7 46. Bxf7 Kxf7 47. Bf2 h3 48. gxh3 Kg6 49. Bh4 Kf7 50. Kf2 Ke6 51. Ke3 Ke5 52. f4+ Ke6 53. Kd4 Kf7 54. Kd5 Kg6 55. Ke6": ""
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=32387",
    "gameName": "Let's play chess",
    "players": "thitho (1705) vs. airwarrior (1579)",
    "opening": "English opening (A22)"
}