{
    "moves": {
        "1. e4 e5 2. f4": "Kings pawn offered",
        "2... exf4": "taken",
        "3. Nf3 Bc5": "this bishop will prevent me from castling, so-",
        "4. d4 Bb6 5. Bxf4": "pawn recovered",
        "5... Qf6": "unusual to bring the queen out early, comments welcome",
        "6. Qd2 Nc6": "triple attack on my d pawn",
        "7. e5 Qg6 8. Bd3": "harass the queen, maybe even a chance it gets trapped",
        "8... Qe6 9. Ng5": "i continue to harass his queen, ",
        "9... Qe7 10. c3 h6 11. Nf3 d6": "this is when i wish i had castled earlier",
        "12. O-O Qd8": "pushing his queen back after a lot of futile moves. \r\nobserve- i have castled, all pieces developed except the knight and three pawns pushed forward.\r\nblack still has 3 pieces undeveloped and has not castled",
        "13. Kh1": "get my k away from that black bishops gaze",
        "13... Nge7 14. exd6": "this will clear the e file for me and also isolate his -",
        "14... cxd6": "- isolate his e pawn",
        "15. Na3": "now suddenly i start dreaming an attack on his kingside- note queen and both bishops pointing there.\r\nonly problem was i had to make this unusual move of the knight to the edge",
        "15... O-O 16. Nb5": "double attack on his e pawn",
        "16... Bc7": "he protects it",
        "17. Bxh6": "boom",
        "17... gxh6 18. Qxh6": "boom",
        "18... Bf5": "if i take his lsb, he will retake with his knight and my queen will have to move. HOWEVER CAN YOU SPOT THE MATING ATTACK?",
        "19. Ng5 Bxd3": "dOUBLE BISHOP SACRIFICE.  He thinks he has h2 covered but HAVE YOU SPOTTED THE ALT ATTACK",
        "20. Rf3": "i think i can finish him off on h8 BY MOVING ROOK TO H FILE",
        "20... Nf5 21. Qh7#": "can anyone point out any flaws in my double bishop sacrifice, comments welcome. i am still learning"
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=17376",
    "gameName": "Let's play chess",
    "players": "dmisra (1531) vs. tyra66 (1527)",
    "opening": "King's knight's gambit (C34)"
}