{
    "moves": {
        "1. e4": "I am the white player and I have played different openings on gameknot recently but e4 seems to have the most succes. I also like to play d4 but I'm most skilled in e4.",
        "1... e5": "Black plays e5 and I'm happy with that, I rather play the simple e4 e5 than the silician.",
        "2. Nf3 Bc5 3. Bc4": "Basic opening and this is not the ruy lopez but tries to take advantage of the weak f7 early on. However my opponent didnt play nf6 here, or I would have played ng5 already.",
        "3... Nc6": "Note that Nxe5? is a blunder here. 4 Nxe5? Nxe5 5 d4 Nxc4! and I would have lost a piece.",
        "4. c3": "Found this on the gk database so I thought I should try it out. Also possible is the evans gambit with b4, or simply castling short. The queen will go to b3 shortly. I also had an interesting otb game with this which was 4 c3 d6 5 Qb3 f5? , which led to an interesting game but resulted in a draw.",
        "4... Nf6 5. d4": "This is the standard play here. It makes the way to d2 to develop the knight but not before the bishop is developped.",
        "5... exd4 6. cxd4 Bb4+": "After trading the pawns black puts me in check, but this allows me to develop my knight with a free tempo.",
        "7. Nc3 Nxe4": "Now things get interesting, this looks like a free pawn, but I will 0-0 and then the knight may get in trouble after Re1",
        "8. O-O Nxc3": "He took my knight, this looks like there is going to be another free pawn but things will not turn out the way black wanted it to be.",
        "9. bxc3 Bxc3": "My rook is attacked, but I chose not to defend it, I saw that there is another possibility in the chess opening book database, and it turned out nicely.",
        "10. Qb3": "Qb3! This loses the rook but gets a major attack on the king. If black takes the rook he will be in serious trouble.",
        "10... Bxa1": "Bxa1 now the board says -7 for me. That doesn't sound too good. How do I make up for it.",
        "11. Re1+": "This is probably the best, because it immediatly brings the rook into play.",
        "11... Ne7": "Kf8 doesn't look too good, this is probably the best answer. @l-d-j thanks for pointing that out.",
        "12. Bxf7+": "Check",
        "12... Kf8 13. Bg5": "The f pawn is now gone so the attack on the queen is here, Black doesn't have any solution to save the queen. At least he will still get some material out of it, though.",
        "13... d5": "This blocks the queen hoping black can grap the bishop later, but it won't work.",
        "14. Bxe7+ Qxe7": "Maybe 14 ... Kxf7 might be better but after 15 Ng5+ the queen may also get in play and black is in a lot of trouble.",
        "15. Rxe7 Kxe7 16. Qxd5": "I had thought about other possibilities but I found this to be better than moving the knight, because it simply wins a pawn.",
        "16... c6 17. Qh5": "If ... g6? 18 Bxg6 hxg6 19 Qxh8, which wins because white score is currently -1, and with the rook black will have not enough material to launch a good attack. The white lsb will also be blocked so white should have an easy win.",
        "17... Bd7": "Black wants to secure the 8th rank and this is probably better than ... Be6.",
        "18. Ne5": "White is ready to attack the king.",
        "18... Rhf8": "? This move doesn't achieve a lot but right now black doesn't have any good move.",
        "19. Qg5+": "check",
        "19... Kd6": "Forced",
        "20. Nc4+": "I found this move to be the best way to chase him into a corner.",
        "20... Kc7 21. Qe5+": "check",
        "21... Kd8 22. Nd6": "This move looks very scary to black. ",
        "22... b6": "Black is trying to make a runaway possibility and it turned out to be a good choice. The pawn was attacked by the knight.",
        "23. Nb7+": "I found this move to be the best.",
        "23... Kc8 24. Qe7": "I was trying to force black in a sort of mate postion, but he managed to escape.",
        "24... Kc7 25. Be6": "Note that there is a back-rank mate possibility for black if he managed to somehow get his rook safely on an open file.",
        "25... Kxb7 26. Qxd7+": "Black decides to trade off",
        "26... Ka6": "You would expect this to go mate but I couldn't find it.",
        "27. Bc4+": "I think this move is wrong. Much better is probably Qxc6",
        "27... Ka5 28. Qxc6": "Black has only 1 move here...",
        "28... a6": "a6 defends everything",
        "29. Bb3 b5": "And thus black somehow manages to escape the mate. Now the score says 0. But I had a good plan to get the bishop.",
        "30. Qc1": "! this will win blacks bishop",
        "30... Bxd4": "the only option",
        "31. Qa3+": "check",
        "31... Kb6 32. Qd6+": "check",
        "32... Ka5 33. Qxd4": "white is now ahead in material but 2 rooks can get very strong. On the other hand, black's king is exposed and this will lead to nasty checks.",
        "33... Rfd8": "Black may be trying for a back rank mate but my bishop defends d1 right now so there is no sweat yet.",
        "34. Qc3+ Kb6 35. g3": "to stop any back rank mate and get my king into play if necessary. Qxg7 probably was alright too.",
        "35... g6 36. Qg7": "I found this to be the best.",
        "36... Rac8": "Why didn't black play Rh8? I don't know.",
        "37. Qxh7 Rc6 38. Qh6": "With this, im going to try all sorts of nasty discovered checks on the king.",
        "38... Rdd6 39. Kg2": "Getting my king out of any discovered check.",
        "39... a5": "Black is going to push pawns here.",
        "40. Bf7": "trying to build pressure.",
        "40... Rdf6": "Interesting move",
        "41. Bd5 Rc2": "And now black's rooks aren't connected anymore while the black king is still vulnerable. This will lose a rook.",
        "42. Qe3+": "check.",
        "42... Ka6": "42 ... Rc5? 43 Qe7 threats both mate and loses the rook. 42 ... Kc7? Qe7+ loses the rook also.",
        "43. Bb7+": "!This way, I will trade my bishop for a rook.",
        "43... Kxb7": "forced",
        "44. Qe7+": "check",
        "44... Kb6": "going to the 8th rank would have avoided a check but probably made the pawns more vulnerable.",
        "45. Qxf6+ Rc6": "Although white is ahead in material, black has connected passed pawns on the 5th rank defended by his king, this won't be easy.",
        "46. Qb2 a4": "Black pushes pawns here.",
        "47. a3": "This will stop the pawn advancement for a while.",
        "47... g5": "? Black has no good move right now",
        "48. h4": "I'm trying to make use of my own pawns here.",
        "48... gxh4": "If I take with my g pawn, the pawns won't be connected and not as strong.",
        "49. Qd4+": "check",
        "49... Ka5 50. Qb4+": "I do not want the king there, this may look like a wasted move but I really hated to king to be there. the square is too good for his pawns.",
        "50... Kb6 51. Qxh4": "So, my pawns are still connected and b4 is not possible because it loses the pawn.",
        "51... Rc4": "Black probably wants his king on a5, so he played this move. Rc3 doesn't do much after 52 Qf6+ Rc6",
        "52. Qf6+ Ka5 53. Qe5": "This move stops the pawn advancement because the b pawn is pinned.",
        "53... Rc2 54. Qd4": "Was trying a dirty tactic here. Qa7 checkmate.",
        "54... Ka6 55. Kh3": "Moving my king to make way for my own pawns to advance.",
        "55... Rc4": "Black still doesn't have any good move, probably wants to free himself of the checkmate and move his king again.",
        "56. Qd2 Kb6": "He may be trying a different way to defend his pawns.",
        "57. f4": "Enough time wasted, time to go for another queen.",
        "57... Kc5": "Black found a spot for his king to advance his pawns. However, I calculated and saw there is no threat.",
        "58. f5 b4": "The long awaited pawn advancement by black.",
        "59. axb4+": "?! It turns out to be a free pawn",
        "59... Rxb4": "Not good",
        "60. Qxb4+": "! white sacrifices his queen to get the promotion first. The promotion will be with check, so white has nothing to be afraid of!",
        "60... Kxb4 61. f6 a3 62. f7": "I will be there too soon, black doesn't have enough time to advance by himself.",
        "62... Kb3 63. f8=Q a2": "Black is almost there...",
        "64. Qf7+": "check",
        "64... Kb2 65. Qxa2+": "Another queen sacrifice made black resign here. The g-pawn cannot be stopped and white will win with a queen and a king left! I hope you enjoyed the game. Feel free to comment!"
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=50156",
    "gameName": "Let's play chess",
    "players": "schakertje (1654) vs. cccm (1508)",
    "opening": "King's knight opening (C40)"
}