{
    "moves": {
        "1. d4": "My standard.",
        "1... d6": "This response isn't all that common and there is very little variation in what you see.",
        "2. c4": "Sticking to the gambit.",
        "2... g6": "My opponent decides to go into the modern defense.",
        "3. Nc3 Bg7 4. Nf3 Nf6 5. Bg5": "Normally one would play e4 but I wanted to get the bishop outside of the pawn chain so I would have the option of e3.",
        "5... O-O 6. e4": "Though Bg5 is not often seen in the modern defense, it is a typical position for it. I'm fully willing to play into his book.",
        "6... Nh5": "? Breaking the pin but taking the knight out of the center. I immediatly see the opporutnity to capture there with the light bishop and after the exchange taking the pawn.",
        "7. Be2": "I set my idea in motion. Also in my head is to push one of my pawns.",
        "7... Nd7": "He realizes this and protects c5 and e5. However this blocks in the light bishop.",
        "8. Be3": "Avoiding a threat on f6 and helping attack c5.",
        "8... b6": "Defending c5 and planning to fianchetto the bishop.",
        "9. d5": "Pushing the pawn that the knight doesn't attack.",
        "9... Nhf6": "Breaking the rule of not moving the same piece twice in the opening. Perhaps he feared an e5 pawn push, this was the last of the three pawns I was going to push.",
        "10. O-O Ng4 11. Bd4": "I would rather trade off bishops and place my knight on a strong square.",
        "11... Nge5 12. Nxe5 Nxe5 13. f4": "I normally hate pushing my king pawns but I can control the center this way, restrict the knight, and trade off bishops.",
        "13... Nd7 14. Bxg7 Kxg7": "I trade off bishops like I wanted to, this opens up his king early and I plan of taking advantage of that. I already envision my queen wreaking havoc in the center on d4.",
        "15. Bg4": "I launch my kingside attack and place pressure and further restriction on Black's light bishop.",
        "15... Nf6 16. Bxc8": "? Breaking the rule of not trading a good bishop for a poor one. This will serve me well on my assault of f7.",
        "16... Qxc8 17. e5": "The assault gains momentum and starts to get dangerous. I plan to remove the knight from protection and free up the f file.",
        "17... dxe5 18. fxe5 Nd7 19. Qd4": "Threatening a discovered check with e6! and Black loses his knight.",
        "19... Kg8 20. e6": "I play it anyway, placing pressure on both the knight and f7. This move will be key to my assualt.",
        "20... Nf6": "Blocking off my assault on f7. Better than fxe6 dxe6 with even more attacking opportunities for White.",
        "21. Rae1": "I plan to trade off knights.",
        "21... Qb7": "Connecting the rooks.",
        "22. Ne4 Nxe4 23. exf7+": "!! The attack comes to fruition and the kingside is destroyed.",
        "23... Rxf7 24. Rxf7 Kxf7 25. Qxe4": "Threatening e7 and maintaining the option of Rf! .",
        "25... c5": "Black must sacrifice the c pawn to protect the much more important e pawn. I will use this as insurance later.",
        "26. dxc6 e.p. Qc7 27. Rf1+ Kg7 28. Qe6": "Threatening Rf7 ",
        "28... Rc8": "Trying to take away my insurance pawn that makes simplifying unappealing to my opponent.",
        "29. Rf7+ Kh6": "The best move, Kh8 is met by 30.Rxe7 Qxc6 31.Qf7 Rg8 32.Qxh7#",
        "30. Qe3+ Kh5 31. Rxh7+ Kg4 32. Qf3+ Kg5": "The last three moves for black were forced and the culmination of my attack was to come on the next move.",
        "33. h4#": "I felt that this game was one of my best legitimate attacking games ever and I was never concerned. Completly confortable and satisfying victory."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=5230",
    "gameName": "Let's play chess",
    "players": "flcllove4 (1375) vs. bobw58 (1586)",
    "opening": "Modern defence (A41)"
}