{
    "moves": {
        "1. d4 e6 2. c4 Qh4": "The Queen is a powerful piece but bringing it out prematurely will help white develop his forces while gaining tempos, leaving black in a bad spot once the opening is done with. Better is  2 .. d5 or 2 ... Nf6 which would of been a standard response to 2. c4",
        "3. Nf3": "Developing while making black waste another turn by moving his Queen again.",
        "3... Qe4 4. a3": "I did this to stop Bb4 but I should of just kept developing with 4 Nc3",
        "4... Nf6 5. Nc3": "Another free move to get my Knight out since he will have to move his Queen rather then bring out more of his pieces.",
        "5... Qf5 6. e3 Ne4": "He is trading off one of the few developed pieces he has better would of been 6 ... d5",
        "7. Nxe4 Qxe4 8. Bd3 Qg4": "This is the 5th time he has had to move his Queen in the opening. It is ideal to move a piece just once during your development.",
        "9. O-O": "0-0 is a solid move but interesting would of been 9. h3 if 9... Qxg2? 10 Rh2! and black would lose his queen.",
        "9... Nc6": "Better is 9 ... Be7.   9 ... Nc6 followed by 10 d5 making his knight go to the edge of the board or cramping his position making him lose more time in getting his pieces active. I ended up missing the d5 move in the game though.",
        "10. h3": "I did this because I didn't like his queen staring down at my king but this move just wasted my time. ",
        "10... Qh5 11. b4": "Getting space and planning a home for my dark square bishop on the a1-h8 diagonal ",
        "11... f5": "11 ... d6 would of been better. I am far more developed then him and now he is starting to weaken his king side.",
        "12. e4": "My response to f5 since he is starting to weaken his king side I wish to open it up as much as I can to put pressure on it.",
        "12... Be7 13. exf5 exf5 14. Re1": "Getting my rook active on the open file.",
        "14... O-O": "This is a big mistake as he will lose material after 15. b5! now black will either lose his bishop or a knight.",
        "15. b5 Na5": "Black is in a bad spot no mater what but a better move would of been 15 ... Qf7",
        "16. Rxe7 b6 17. Bd2": "I did this because I would rather his Knight be placed on the b7 square then his bishop. But due to 17... a6 I believe 17 Bf4 would of been slightly better.",
        "17... Nb7 18. Qc2": "I did this to line up my queen and bishop on the b1 h7 diagonal  but 18 Qe2 would of been more of a threat.",
        "18... d6": "This hangs the c7 pawn. Which I do notice but i like where my rook is right now and taking the pawn right away I believe will slow down my progress.",
        "19. Rae1 f4": "19... Rf7 would of been better.",
        "20. Bxf4": "Better is 20 Rxc7 due to 20... Bxh3 which I ashame to admit that I did not see. \r\n\r\nNote that with 20 Bxf4 if black does 20... Rxf4 following will be 21 Re8+ Rf8 22. Bxh7 Qxh7 23. Qxh7+ Kxh7 24 Rxf8",
        "20... g6": "I guess he did this out in hopes of being able to later take my bishop on f4 but this just weakens his king side even more he should of just done 20... Bxh3",
        "21. Re7e8": "Better is 21. Be4 which leads to nasty trade down of his knight and rook for my bishop and pawn. The only reason I could find 21 Be4 was by having the game analysis afterwards by a chess engine the thought never even occur to me ingame. \r\n\r\n\r\n21.Be4 Bxh3 22.bxb7 Rad8 23.Bd5+ Kh8 24.Qd2 Bg4 25.Bh6 Rg8 26.Bxg8 Rxg8",
        "21... Bxh3": "This the only surprise I had during the game I should of saw it coming but I didn't. Lucky for me it was simple to remove the threats he had made since his Knight is on b7 unprotected",
        "22. Rxf8+": "Better would of been if I did Rxa8, it would of made his rook less active. \r\n\r\nSince I took his rook this way now when he retakes he will also be putting pressure on the f file",
        "22... Rxf8 23. Qd2 Qg4": "Threatens checkmate by Qxg2++",
        "24. g3 Qxf3": "24... Qd7 would of been better due to 25. Be4",
        "25. Be4 Qg4 26. Bxb7 h5": "He is trying to create a counter atk but this just weakens his king side yet again. This move is the final nail in his coffin.",
        "27. Bd5+ Kh7 28. Re7+ Kh8 29. Bh6": "I still have a forced win here but faster would of been 29 Be5+ follow by Qh6++ checkmate",
        "29... Qc8 30. Bxf8 Qxf8 31. Rf7 Qg8 32. Qh6+": "And black resigns next would of been 32... Qh7 33 Rxh7++ check mate"
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=25492",
    "gameName": "Let's play chess",
    "players": "chaosdreamer (1200) vs. blackymate (1291)",
    "opening": "Queen's pawn (A40), Keres defence"
}