{
    "moves": {
        "1. e4 e5 2. Nf3 d5 3. exd5 e4": "Ici je préfère avancer E5 pour menacer le cavalier, plutôt que de prendre tout de suite D5 avec la dame (que je pourrai de toute façon prendre plus tard). L'idée étant de me mettre en position d'attaquant pour rattraper le coup de retard noir.",
        "4. Nd4 Bc5": "Je continue la chasse",
        "5. c3": "Ici je vois deux choix qui s'offrent à moi :\n * Changer de cible (notamment, prendre D5 avec la dame)\n * Faire l'échange C5-D4",
        "5... Bxd4": "Je choisis de faire l'échange, pensant que le deuxième pion pourra être pris facilement",
        "6. cxd4 Qxd5 7. Nc3": "Je passe en position de chassé, ce qui ne me plait guère, mais j'ai l'avantage de pouvoir m'en sortir en prenant le pion, comme prévu ;)",
        "7... Qxd4 8. Bb5+ Nc6": "Ici je préfère sortir le cavalier que le pion, afin d'amener un renfort éventuel par la suite",
        "9. O-O": "Voyant son rock je suis conforté dans ma position d'attaquant et non plus défenseur. Je décide de tenter le mat avec dame en G2.",
        "9... a6": "Première étape : libérer le terrain. Il me faudra amener ma dame en D5 (couvert par le cavalier) et mon fou en B7 après avoir déplacé mon cavalier pour libérer la vue (impossible tant que le fou blanc B5 est là). Je commence donc par chasser le fou.",
        "10. Ne2": "Pensant jouer un bon coup en menaçant ma dame au lieu de fuir avec le fou, il m'aide en réalité puisque le cavalier ne couvre maintenant plus la position que je chérissais. Je peux sauver ma dame en menaçant son fou : les deux pièces qui me dérangeaient seront parties.",
        "10... Qc5 11. Ba4 b5 12. Bb3 Na5": "Le deux tours précédents me permettent surtout de libérer la place pour le fou C8 vers C7. Ils me permettent aussi à chaque tour de menacer son fou à cause de son mauvais placement, détournant l'attention de mon adversaire !",
        "13. d4": "Très mal joué ! Il ignorait la prise en passant, or il m'offre avec ce coup de déplacer gratuitement le pion E4 qui gênait ma vue vers le mat, tout en menaçant son cavalier (et lui faisant perdre encore un tour). Cela fait maintenant 4 tours que je me prépare sans qu'il ne puisse jouer ses propres coups.",
        "13... exd3 e.p. 14. Qxd3 Bb7": "Phase 1 : OK\nIl aurait du le voir à ce moment là et avancer son pion en F3.\nIl a sans doute cru que je préparais un rock.",
        "15. Be3": "Aveugle, il préfère menacer à nouveau ma dame. Je recule pour protéger mon roi de l'échec par la dame en E4. Accessoirement cela me mettra définitivement dans la position du mat.",
        "15... Qc6": "Je croise très fort les doigts pour qu'il ne casse pas mes plans. Il a maintenant trois moyens de le faire :\n * Avancer son fou en D5 (couvert par la dame)\n * Avancer son pion en F3 (couvert par le pion G2)\n * Ou encore couvrir G2 avec par exemple son cavalier en F4\nDans ce cas j'ai prévu de rocker avant de réorganiser un autre assaut.",
        "16. Rac1": "Difficile de croire qu'il n'a pas fait exprès de me l'offrir ;)",
        "16... Qxg2#": "Un classique"
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=28460",
    "gameName": "Let's play chess",
    "players": "viharnik (1140) vs. naholyr (1197)",
    "opening": "QP counter-gambit (C40), Maroczy gambit"
}