{
    "moves": {
        "1. c4": "I've started experimenting a little with the English opening with some success",
        "1... Nc6 2. d4 d5 3. Nf3 h6 4. cxd5 Qxd5 5. Nc3": "Develops with tempo",
        "5... Qf5": "This takes us out of the gameknot database and my next move may be why.",
        "6. e4": "harrasses the queen and strengthens the centre",
        "6... Qg4": "Attacking g2, preventing my lsb from moving which delays whites castling",
        "7. d5": "Putting the question to one of the few pieces that black has been able to develop, the knight has few reasonable options",
        "7... Nb4": "This is a mistake as it gives the knight away",
        "8. Qa4+ Bd7": "takes away the defence of the b7 pawn which my queen will be attacking after taking the knight",
        "9. Qxb4": "I'm still not sure if Bb5 would have been better",
        "9... b6 10. Ne5 e6": "Loses material",
        "11. Qxf8+ Kxf8 12. Nxg4 exd5 13. Nxd5": "Mistake from white from this time",
        "13... Bxg4 14. Bb5": "The black king is hemmed in but I don't think white is in a position to take full advantage",
        "14... Rc8": "threatening a fork with b6, Rd6 looks better to me",
        "15. Ba4 c6 16. Ne3 Bd7 17. O-O Re8 18. Bc2 Nf6 19. f3 g6 20. b3": "Looking to get the dsb on the A3-f8 diagonal, though the potential pin from Bb2 is tempting too",
        "20... Rh7 21. Bb2 Nh5": "Not an ideal place for a knight but were else could it go? Perhaps g8 then e7 would have been better",
        "22. Rad1 Be6 23. f4": "Trying to keep some sort of attack going",
        "23... f5": "loses a pawn",
        "24. exf5 gxf5 25. Nxf5 Bxf5 26. Bxf5 Rhe7 27. Bg6": "The fork was too tempting to resist, there is however an added benefit that the black king is held onto the 8th rank",
        "27... Rc8 28. Bxh5": "I'm not sure this was neccesary",
        "28... c5 29. Be5": "blocking out blacks rook from the e file, though again this move is probably not neccessary",
        "29... c4": "loses another pawn",
        "30. bxc4": "The c pawn is immune due to Rd8#",
        "30... Kg8": "I think black had seen the threat but didn't realise that this was not an escape route",
        "31. a4": "waiting move",
        "31... Rxc4": "loses immediately",
        "32. Rd8+": "Kh7, Rh8# to follow\n\nThanks for reading please comment"
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=40953",
    "gameName": "Let's play chess",
    "players": "elwoos (1560) vs. zednik (1372)",
    "opening": "English opening (A10)"
}