{
    "moves": {
        "1. d4 d5 2. e3 Nf6 3. Bd3 e6 4. c3 c5 5. Nd2 Bd6 6. f4": "! I can't remember playing this variant before. White might O-O swiftly after Nf3 on his next move?",
        "6... cxd4": "Trying not to close the game with capture in stead of c4. ",
        "7. cxd4 Bd7 8. a3 Bc6 9. h3": "! LSB is not going to g4 anytime soon, so perhaps played against Ng4?",
        "9... Ne4": "Both pawns are no longer able to kick the knight away, trading knights would be fine with me.",
        "10. Ngf3 Ng3": "Forcing the rook to move and preventing the O-O. ",
        "11. Rg1 O-O 12. Kf2 Ne4+ 13. Bxe4": "! expected a trade of knights, which would free white's DSB as well. ",
        "13... dxe4 14. Ng5 Nd7": "Developing the knight to the king side.",
        "15. Ngxe4": "Without the pawn, the LSB can target squares beyond e4. White's DSB is still locked. Both give some compensation for the -1 in material. ",
        "15... Nf6": "Either NxDSB or NxN develops the queen, the DSB is not very strong with all those white pawns on dark squares, but white might also use the queen to support the knight on e4. ",
        "16. Nxd6 Qxd6": "Like my DSB the queen is not very active on a dark square, looking for ways to improve this. ",
        "17. g4": "! pushing his king side pawns forward, the LSB is now very useful but I have to keep an eye on those pawns advancing any further. ",
        "17... Bd5": "preventing d5 and also targeting b3 in case the knight would go there to free the DSB for white. ",
        "18. Qc2 Rac8": "Making a claim on the open file. ",
        "19. Qd3 Rc7": "preparing to enforce the claim on the open file. ",
        "20. Ke2": "Probably a move to avoid check with the knight via e4 or g4 in the future?",
        "20... Rfc8": "Enforcing the claim on the open C file. If the king goes back to the first line, the DSB is a potential target. ",
        "21. e4": "Was bound to happen sometime, after retreating the LSB, e5 would be a problem, loosing my knight. ",
        "21... Qxf4": "possible follow ups are Qh2+, Rc2 or after pxd5, Nxd5.",
        "22. Qf3": "Offer to trade queens and also covering for Qh2+, Rg2. ",
        "22... Qxf3+": "Trade seems advantagious for me, considering that my pieces are slightly more active. ",
        "23. Kxf3 Bc6": "The king is unfortunatly the second defender for e4, so retreating the LSB even though it blocks the rooks. Trading the LSB on c4 would be disadvantagious, because it frees the DSB for white and the board is finally opening up. After b6, retreat the bischop further to activate the rooks again. ",
        "24. g5 Nd7": "Saving the knight takes priority. ",
        "25. Ke3": "Unpinning the pawn on e4. ",
        "25... f6": "After capture, recapture with the knight to gain the centre. ",
        "26. h4": "tactic rejected and pawn structure is now solid for white. ",
        "26... b6": "proceeding to relocate the bishop.",
        "27. Nc4": "Finally activating the DSB for white? Nd6 is though on the rook, but manageable. after pf6 is gone, that will also be an open file so escaping with the rook to f8 is not an issue. ",
        "27... Ba8": "Bb7 enables a trade after Nd6 and I value my LSB more than a knight. ",
        "28. Nd6 Rf8 29. Bd2": "Bb4 would be troublesome for the rook on f8, so let's avoid that with a5.",
        "29... a5 30. Bc3": "DSB is well placed for end game, targeting g7 eventually, together with the rook on g1. ",
        "30... f5 31. d5 f4+": "creating a passed pawn and follow up with pxd4, pxd5, Bxd5?",
        "32. Kd4 exd5 33. exd5 Rc5": "There is no way for white to guard the d pawn with another piece than the king while I'm attacking it twice now. Knight on d6 is not 1 move away from anything as well, but is a good follow up target. ",
        "34. Rad1": "This guards the knight after capture with +. Follow up with trade of rooks will improve the odds of promoting the passed pawn.",
        "34... Rxd5+ 35. Kc4 Rxd1 36. Rxd1 f3": "White's pieces are currently not in position to stop the promotion nor able to relocate effectively in time. so pushing passed pawn. ",
        "37. h5": "Looks threatening, but it is safe to continue with the passed pawn while defending the king",
        "37... f2 38. Ne8": "My knight is now targeted by his rook, which would create major danger as the rook will then target g7 again. White knight to f6+ is also something to keep in mind. However,",
        "38... f1=Q+": "Promoting to queen comes with a check, winning white's remaining rook for major advantage in the end game. ",
        "39. Rxf1 Rxf1 40. Nxg7": "White takes bake a pawn, but has no follow up threat for mate. Rf5 is not possible to win a pawn as well. Rf4 check has no real merit yet.",
        "40... Bc6": "The pawns, knight and LSB work together and take some fiels away from white's king, possible forcefull move become more likely to end in a mating attack. Also these pieces are now entwined, covering each other against all but the white knight which would need a couple of moves before a tradeoff is possible. (King f7 could trap the knight on it's current square, but the knight can easily be freed with h6.)",
        "41. Ne6": "keeping the knight active and preventing the mentioned king trap. ",
        "41... Rf5": "To be followed with Bd5+, winning the knight or a pawn if the knight moves away. ",
        "42. Bd2 Bd5+": "After capturing the knight, the end game would be steady progress, collecting pawns and finally the bishop. "
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=66451",
    "gameName": "Let's play chess",
    "players": "chessus11 (1765) vs. joost678 (1763)",
    "opening": "Queen's pawn (D00), stonewall attack"
}