{
    "moves": {
        "1. e4": "Classic",
        "1... e5": "Black responds with a classical opening, I prefer a modern opening: The Sicilian Defense, but to each his own.",
        "2. Nf3 f6": "?!?!?!?!?!?!  A awful move that not only fails to protect the e5 pawn (See next move) but does not develop any pieces either.",
        "3. Nxe5": "! A trick opening that leads to no disadvantages for White.  If Black recaptures than White goes on a forceful attack ...fxe5? 4. Qh5+!, Ke7 (...g6 leads to the capture of Black's Rook) 5. Qxe5+, Kf7 6. Bc4+, d5 (...Kg6 leads to 7. Qf5+, Kh6 8. d4+, g5 9. h4, no move can save black now... 10. hxg5+, Kg7 11. Qf7#) back to the main line 7. Bxd5+, Kg6 8. Bxb7!, (Black cannot take back because it is protecting the f5 square and white wins blacks rook.  That was a long-winded way of saying that 2 ..., f6?? is a terrible move and fxe5??????? is a worse one.",
        "3... d6": "A OK move, but now the dark square bishop is trapped",
        "4. Nf3": "\"Not aggressive but fundamentally sound\" is what someone may say, but they're wrong.  4. Qh5+! leads to a rook capture.",
        "4... c6": "? Black removes the best square for his knight and does not accomplish much",
        "5. d3": "A bad move by me for obvious reasons, 5. d4 is better.",
        "5... d5": "Black has not moved a non-pawn piece, he will quickly fall behind in development and center control.",
        "6. exd5": "The flaws of 5. d3 are becoming well known.",
        "6... cxd5": "Blacks knight has his square back",
        "7. Nc3": "White establishes better center control and a development lead.",
        "7... Nc6": "Black tries to catch up.",
        "8. d4": "This should have been played immediately at move 5.",
        "8... f5": "I don't get this move, it grabs little center and nothing else.",
        "9. Bb5": "3 to 1 in development, and Black's only developed piece is pinned.",
        "9... Bb4 10. Bg5": "Threatens the Queen",
        "10... Nf6": "One in a bunch of possible moves",
        "11. Qe2+": "Claims the e-file",
        "11... Kd7": "? Kf7 is so much better",
        "12. Ne5+": "Capitalizes on the center and development advantage",
        "12... Kd6 13. Bf4": "What terrible mockery of chess is this? A Queen, King, Rook fork is on the table!!!  Nf7+ looks like the best move by far.  But Black has no defense to Bf4.",
        "13... a6": "???????????????????????????????????????????????????????????\n???????????????????????????????????????????????????????????\n?????????????????????????????????  The worst move of the game",
        "14. Nxc6+": "One would expect Nf7++ but Nxc6+ leads to mate",
        "14... Kd7": "No other move",
        "15. Nb8#": "A beautiful mate."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=43606",
    "gameName": "Let's play chess",
    "players": "cmethan (1111) vs. crnkjuice (1074)",
    "opening": "Damiano's defence (C40)"
}