{
    "moves": {
        "1. e4 e5 2. d4": "Again with the Centre Game. The first time I used this series of moves, I won fairly convincingly, and I like this, as my bishops control two diagonals, and my queen controls another. I also have a high success rate with this opening.",
        "2... d5": "Is this another centre game? All four royal pawns are in the centre of the board, and I'm hoping to open up the queens' file by 3. dxe5 dxe4, followed by 4. Qxd8+ Kxd8 5. Bg5+, so I could eventually castle queenside, hopefully checking. (By royal pawns, I mean the pawns starting in front of the king and queen).",
        "3. dxe5": "I capture the king's pawn as mentioned in my previous comment, threatening to open up the d-file. I could now get ahead on development...",
        "3... c6": "...but my opponent declines to recapture, covering the queen's pawn. This sounds like a gambit to me...",
        "4. exd5": "...so I accept the pawn, leaving me two pawns ahead, with my royal pawns swapping files.",
        "4... Qa5+ 5. Nc3": "Moving out my knight to block the queen check was my best move, as should my opponent play 5... cxd5, I could regain the pawn, and possibly exchange queens, threatening a knight fork on c7, allowing me to win the rook on a8...",
        "5... Bc5": "...but my opponent declines to do this, developing the bishop, no doubt hoping to surprise me. This may have been the wrong square, although 5... Bb4 would have been dealt with by 6. Bd2, allowing us to trade pieces, but...",
        "6. dxc6": "...I can capture its twin's pawn, giving me a three pawn advantage. This certainly sounds like a gambit to me, with me accepting three pawns.",
        "6... Nh6 7. Bxh6 gxh6": "With me having a three pawn advantage, I can afford to trade my opponent's knight for my bishop. I have also forced doubled pawns in front of the kingside rook...",
        "8. cxb7": "...allowing me to capture a fourth pawn, giving me a passed pawn on c2. I have now removed half of my opponent's pawns, and although I'm about to drop one myself, I can now go in for equal value exchanges...",
        "8... Bxb7": "...as I finally lose a pawn myself, leaving me three up.",
        "9. Bb5+": "This was, I felt, the way to go. With the b5 square covered by my knight, should the queen move away, my kingside bishop can check the king, and I can possibly go in for an exchange...",
        "9... Bc6 10. Bxc6+ Nxc6": "...which we do with the light-square bishops...",
        "11. Qd5": "...an ideal opportunity for me to develop my queen, threatening a fork on c6...",
        "11... Qb6": "...but my opponent reads this, moving the queen to protect her knight...",
        "12. O-O-O": "...and I castle queenside to prevent a bishop check on f2, although this may have been unwise, with my pawn there under attack...",
        "12... Rb8": "...but my opponent declines to take it, no doubt hoping to capture the more important pawn on b2 instead...",
        "13. Qd7+": "...so I decide to get my opponent's king moving by checking, so castling can no longer be an option...",
        "13... Kf8 14. Na4": "...and I now move my knight to cover the pawn on b2, forking the queen and bishop, also saving the pawn on f2...",
        "14... Qa5 15. Nxc5 Qxc5": "...so I can trade the bishop for my knight...",
        "16. Qd6+": "...and perform a royal fork with my queen, also attacking the rook and knight (which I am actually not threatening to take)...",
        "16... Qxd6 17. Rxd6": "...and I get the queen exchange, although I used the wrong piece, but my opponent may find a way to capture the pawn: 17. exd6 Rd8, then manoeuvre the king to attack, then remove the pawn and possibly exchange rooks...",
        "17... Nxe5": "...as I lose my pawn on e5 to the knight. However, I still have an advantage, but it's only two pawns.",
        "18. Nh3": "I move out my remaining knight to free my other rook, as 18. Rxh6 would have lost a rook, where my opponent would play 18... Ng4! attacking the rook on h6, and the pawn on f2, also controlling the f6 square, and if I moved my rook away from h6, my opponent would play 19... Nxf2, and as the rook on h1 cannot move 20... Nxh1, so the knight move freed it (notice I placed my knight on h3, not f3, as that would have distorted my own kingside pawn formation 18. Nf3 Nxf3 19. gxf3)...",
        "18... Kg7": "...so the king can now cover the kingside pawns...",
        "19. Rd5": "...and use my rook in the middle of the board to attack the knight...",
        "19... f6": "...but the pawn covers it...",
        "20. Nf4": "...so I move my knight towards the centre of the board to help my rook...",
        "20... Rb4": "...and although the rook attacks it...",
        "21. Nd3": "...it allows me to fork the rook and knight...",
        "21... Nxd3+ 22. Rxd3": "...so I get the knight exchange, leaving an extremely familiar double-rook endgame. If I can exchange both pairs of rooks, without losing any pawns, I have an extremely good chance of winning the game.",
        "22... a5 23. Rhd1": "I now move out my inactive rook to connect it with its twin...",
        "23... Rhb8": "...and my opponent does likewise...",
        "24. Rb3": "...but this allows me to get an exchange, as if one moves away from the file, the other disappears. This may have been a little dodgy, however, as I could end up with doubled pawns on b2 and b3, although 24... Rxb3 25. axb3 may lead to a possibility of undoubling with the only queenside pawn being on the rook's starting file. And I have two extra pawns...",
        "24... a4 25. Rxb4 Rxb4": "...and my opponent enforces the exchange, moving to a single-rook endgame.",
        "26. a3": "I move up my queenside rook's pawn to stop my opponent's pawn's progress, and to pressure the rook...",
        "26... Re4": "...forcing the rook to move away, hoping to hoover up my pawns...",
        "27. Rd3": "...so I move mine up to help protect my pawns...",
        "27... Re2": "...and my opponent lines up my bishop's pawn on the kingside...",
        "28. Rd2": "...so I attack the rook with mine...",
        "28... Rxd2 29. Kxd2": "...but my opponent clearly didn't notice that my king was adjacent to my rook, when I clearly had a numerical pawn advantage. I was expecting 28... Re1+, which would have forced me to block the mate with my rook: 29. Rd1, and 29... Re2 should possibly be followed by 30. Rf1, protecting the pawn on f2. Anyway, I got the other rook exchange I was looking for, with two extra pawns, one of them being passed.",
        "29... Kg6 30. b3": "I move up my queenside knight's pawn to attack the remaining pawn on that side...",
        "30... axb3 31. cxb3": "...and get the swap, giving me a second passed pawn on the queenside, connecting them, so they could potentially help each other up the board...",
        "31... f5": "...but as my opponent moves the bishop's pawn on the kingside, my QRP has a clear run: 32. a4 Kf-file 33. a5 Ke-file 34. a6 Kd-file 35. a7 Kc-file 36 a8=Q...",
        "32. a4 f4 33. a5 Kg5 34. a6 Kg4 35. a7": "...so I advance my QRP up to the 7th rank, where this time, it is unstoppable...",
        "35... f3": "...but as my KNP is under attack...",
        "36. g3": "...I move it up its file, rather that capture the attacking pawn, as that would result in an exchange: 36 gxf3+ Kxf3, and I could only end up with four or even three queens...",
        "36... h5 37. a8=Q": "...and I now claim my queen...",
        "37... h4 38. Qc8+": "...and I move her along the top rank to check the king, forcing him onto the 5th rank had my opponent not resigned. The moral of the story? If you go into a pawn ending with a numerical advantage, in nearly every case, you will win, as you have more queening opportunities. It very often depends on how far advanced they are, and whether or not they are passed."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=25427",
    "gameName": "Let's play chess",
    "players": "aspiemikey (1344) vs. loungesport (1156)",
    "opening": "Centre game (C21)"
}