{
    "moves": {
        "1. e3": "Hi guys, again, this is a game in progress. I put this up because this indeed is interesting game, or I am pretty sure it will develop into one.",
        "1... e5 2. b3 d5 3. Bb2": "Attack on e5 pawn.",
        "3... Nf6": "Not exactly a wise move.",
        "4. Bxe5 Ne4 5. Bb5+": "I checked him with my bishop to develop a piece and to prepare for castling.",
        "5... Ke7": "Ummmm... Okay.",
        "6. Nf3": "On with the castling.",
        "6... c6": "Attack on my bishop, and moblized his queen.",
        "7. Bd3": "Natural.",
        "7... Nc5": "Attack on my bishop.",
        "8. O-O": "Castle.",
        "8... f6": "I guess... attack on my other bishop.",
        "9. Bd4": "Natural.",
        "9... Ne6": "Natural, too.",
        "10. Qe1": "Wasting turns.",
        "10... Bd7": "I have no idea.",
        "11. e4": "I was keen on breaking center control.",
        "11... Qe8": "Glenda moves to a somewhat better positioning.",
        "12. exd5 cxd5": "Creates a gap in his left side and also locks in his knight.",
        "13. Bc5+": "So, I can do this.",
        "13... Kf7": "King moves, notice that it frees the movement of the knight.",
        "14. Qe2": "kind of dumb.",
        "14... Bxc5": "Lost one there.",
        "15. Nc3": "Connecting the rooks.",
        "15... Nc6": "So is he.",
        "16. Nb5": "Aiming for the d6 square, which would win me a queen. If the bishop wasn't there.",
        "16... a6": "Trying to capture my knight and destroy my plan.",
        "17. b4": "Attack on the bishop.",
        "17... Nxb4": "It didn't work out so well.",
        "18. Nfd4": "Protecting the knight on b5.",
        "18... Qc8": "Glenda moves to support the bishop.",
        "19. Nb3": "I attack anyways.",
        "19... Bxb5": "Take.",
        "20. Bxb5": "Nautral.",
        "20... Nxc2": "I am surprised that he just didn't take the bishop.",
        "21. Rac1": "Gives me an extra turns for better positions.",
        "21... Ncd4": "Attack on queen and bishop.",
        "22. Nxd4": "Take.",
        "22... Nxd4": "Nautral.",
        "23. Qh5+": "I am really glad that I came up with this move. Notice that only f8 would save him from future checks and even then, I can take d5 and eventually push my rook up to attack his queen.",
        "23... g6": "This probably was the best he could think of.",
        "24. Qxd5+": "This way, I am now able to save my bishop.He can uncheck it by moving the knight, but I wouldn't bet on it.",
        "24... Kf8": "Natural.",
        "25. Rxc5": "Another attack, now we are even in numbers and actually, I am in a better position.",
        "25... Qf5": "A, what a foolish mistake! Now, I have many options. I can move my bishop to c4, take the knight, ect...",
        "26. Qd6+": "But I decided to do this. Now,  King is forced to move. No other piece is avaible. And I get a queen for a price of a rook.",
        "26... Kf7": "Wow. Really dumb.",
        "27. Bc4+": "I decided to give him a second chance of life, because I believe this was just a stupid mistake and things could be a lot better for him. Notice that if I checked with my rook instead of my bishop, I was guaranteed a checkmate. Not really a good second chance, though.",
        "27... Ne6": "Wow.... Okay, maybe he isn't so bright after all.",
        "28. Rc7+": "check.",
        "28... Ke8": "king to g8 would have been better, but it is checkmate either way.",
        "29. Qe7#": "... Thanks for.... getting into this to the finish, and let's find out how the others turn out."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=30276",
    "gameName": "Let's play chess",
    "players": "cleanswide (1371) vs. johnjingle (1154)",
    "opening": "Amsterdam attack (A00)"
}