{
    "moves": {
        "1. e4 e6": "The French Defense. The idea is to play d5, challenging White's e-pawn. But my opponent didn't play the main variation.",
        "2. d3": "I don't play this anymore, but the idea is to play Nd2 and keep the pawn on e4 if Black plays d5.",
        "2... g6": "Not a normal move. 2... d5 is the most common move here.",
        "3. f4": "I want to prep for a pawn storm on the kingside in case Black castles there.",
        "3... Bg7 4. Nf3 Nc6": "A better idea is to play 4...c5 before developing the knight there, because now I can control d4 with 5. c3.",
        "5. c3 Nh6": "An odd developing square, because that knight does not have any active purpose there.",
        "6. h3": "Planning g4 whenever Black castles. But Black may be afraid to castle there if I play it too early.",
        "6... O-O 7. g4": "I'm threatening g5, winning the misplaced knight.",
        "7... f6": "Gives the knight the escape square f7.",
        "8. g5": "I thought I was being too hasty. I should've continued the attack slower and safer.",
        "8... fxg5 9. fxg5 Nf7 10. d4": "Although I have a strong centre, I'm lacking in development from moving too many pawns, and my kingside is overextended.",
        "10... d5 11. e5": "Now the position becomes more like a French structure, but where Black hasn't played c5.",
        "11... a6": "I wasn't sure exactly what the reason for this was.",
        "12. Bd3 Ne7": "This move was also odd to me.",
        "13. Qe2": "I plan to castle queenside, where I have pawns to cover me.",
        "13... h5": "Black keeps making odd moves here.",
        "14. Bf4": "I thought Be3 was a better place for my bishop, where it doesn't sit on the open f-file.",
        "14... Nh8": "Black has made 4 odd moves in a row, and I should've been winning, except I made a huge blunder here, getting into a lost position.",
        "15. Nbd2": "15. Nbd2?? is totally losing because I hang the bishop. This is a common mistake in correspondence chess because a lot of times players will go to a game they haven't looked at for a few days, and make a move without checking the position for hanging pieces or threats. ",
        "15... Rxf4": "I am totally lost in this position, but miraculously I came back and won. You're probably wondering how that happened in a position like this.",
        "16. O-O-O Bd7 17. Nf1": "Usually the best way to try for a swindling desperate attack, is to attack the king. I move my knight so that I can reach the good g6 square, with a better chance to swindle Black.",
        "17... Qf8 18. Nf3h2 Rf2 19. Qe1": "My position looks terrible! A lot of my pieces are on the back rank, and Black has control of the f-file. I thought for sure I would lose, but I didn't resign because there were so many pieces on the board, and material advantages are only useful with fewer pieces on the board.",
        "19... Bb5 20. Bc2": "Although trading bishops would take away Black's bishop pair, I must avoid trading my active pieces if I want to swindle Black.",
        "20... Re2 21. Qg3 Rf2": "Black probably didn't think very much on that move. He probably thought I had no chance to win because I'm down a piece, and just expected the game to win itself.",
        "22. Ne3 Rf7": "Why is Black retreating? He must think I'm going to resign any move now.",
        "23. a4 Bc6": "In just a few moves, the position has changed. Now I'm the one with all the active mobil pieces, and Black is the one with the cramped position. And material advantages are less useful in cramped positions, so I'm not really \"totally\" losing. Just losing.",
        "24. Rhf1": "I challenge the f-file.",
        "24... a5": "Another random move. Black thinks there is no way he could possibly lose, but his bad play continued, giving me a brilliant swindle I felt very happy about.",
        "25. Nf3 b5": "Black wants to open up files to my king, but he doesn't have very many active pieces there, so I am not worried. I have lots of active pieces on the kingside, so I should mainly focus there.",
        "26. Nh4": "I am eyeing the weak g-pawn.",
        "26... Rxf1 27. Rxf1 Qc8": "Black just gave me control of the f-file, so my chances to swindle Black are increased. Black is probably thinking, \"why won't this guy just die.\" And is frustrated that his extra piece isn't helping him much.",
        "28. Qf3": "I don't care about losing my a-pawn, because I'm already down a piece, and a pawn won't make much difference. If I take the pawn, then Black can attack much faster, and I don't have time for my swindling attempt on the kingside.",
        "28... bxa4 29. Neg2": "I am headed for f4 where I attack the weak g-pawn. The key to getting a successful kingside attack is to first attack the pawns.",
        "29... Be8 30. Nf4 Bf7": "Another wasted move. Black doesn't want to work for his win and wants it to be handed to him. Black has an attack going on the queenside, and should've tried piling his heavy pieces on the b-file.\n",
        "31. Qd3": "Taking the a4 pawn just loses a tempo, deactivates my bishop, and material isn't important to me right now because I am working for a kingside attack. Don't let distractions like that keep you from carrying out your intended plans.",
        "31... c5": "Black is underestimating my swindling chances, and thinks anything he does will win because he has an extra piece and pawn.",
        "32. Nxh5": "If Black takes, then I will play Qh7  and g6, which gives me a lot more swindling chances than if he doesn't take my knight.",
        "32... Nf5": "Black is realizing now that I still have chances to win, and must neutralize these chances and win with his extra piece in the endgame.",
        "33. Nxg7": "It isn't good to trade when you're down material, but Black was threatening both my knights, so a trade was forced, and trading on f5 solidifies Black's kingside, lessening my swindling chances.",
        "33... Nxh4": "Not the best way to trade. My knight on g7 is much more powerful than my knight on h4.",
        "34. Nh5": "Black probably thought my knight was trapped, but if he takes, then I can still play Qh7 ",
        "34... Nf5": "Black blocks my strong diagonal.",
        "35. Nf6+": "Black should've taken this knight earlier, because now my knight is posted on f7, where it cannot be disturbed and controls good squares in Black's camp.",
        "35... Kg7 36. h4": "I am trying desperately for a swindling attempt.",
        "36... Nxh4": "A terrible move. If Black doesn't take the pawn and just keeps the knight on f5, then I have no chance to win, and Black is up a piece. Black probably greedily took the pawn without a second thought, and is amazed that I haven't resigned yet.",
        "37. Qh3": "Black is in big trouble, and may even be losing here, but his next move was a definite blunder, which hands me a winning position.",
        "37... Nf5": "Black may have still had a chance, I'm not sure, but now I am totally winning, although I hadn't realized it yet.",
        "38. Qh7+": "The h8-knight is doomed, and my crushing attack will eventually eat Black alive.",
        "38... Kf8 39. Qxh8+ Ke7": "I hadn't realized my winning position yet, until I found the one magical move, which saved my game.",
        "40. Nxd5+": "Nxd5!! wins and Black has no idea what hit him. His trouble started when he took my h-pawn. Now he must pay the price.",
        "40... exd5": "Kd7 was the only other legal move, but Nb6  or Bxa4  win Black's queen.",
        "41. Qf6+": "I'm down a piece again, but this time my attack is unstoppable.",
        "41... Ke8": "Kf8 loses after 42. Bxf5 gxf5 43. Rh1!! unstoppably threatening Rh8  which either mates or wins the queen.\nBut Ke8 is still losing.",
        "42. Bxa4+": "Now I can't kill Black's only good defender with Bxf5, but I need to get Black's king back into danger, and it gave me a more brilliant win.",
        "42... Kf8 43. Rh1": "Threatening Rh8#",
        "43... Ne7": "The only way to stop mate is to attempt to block on g8.",
        "44. Rh7": "Black resigned in this position, because he can't stop both my mating threats of Qxf7# and Qg7#.\nAlthough I wasn't pleased with myself blundering a piece, I love this game because it shows how I went from being down a piece in a hopelessly lost position, to fighting desperately for a brilliantly winning tactical attack, and it certainly must've made my opponent feel like crap to lose like this!"
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=1705",
    "gameName": "Let's play chess",
    "players": "bakerbaker (1589) vs. damacles (1596)",
    "opening": "French (C00), King's Indian attack"
}