{
    "moves": {
        "1. Nf3": "I like playing Nf3 because it has three important merits which I like:\n1- it is flexible ... not committing myself to any pawn structure\n2- directly gain two squares in the center d4 and e5\n3- allows a faster king-side castling",
        "1... Nc6": "I guess my opponent likes flexibility too",
        "2. d4": "pushing a pawn to the center, clearing the way for the dark-squared bishop and threatening d5 which if not taken care of, will make the knight make an exhausting journey.",
        "2... e6": "defending d5 and clearing the way for the dark-squared bishop",
        "3. e4": "gaining a two-pawns center ... I think the center will be mine",
        "3... d5": "countering my center superiority",
        "4. e5": "gaining space",
        "4... g6": "want to fianchetto the dark-bishop. It is not a bad move. But, I don't like it because black needs to remove my two center pawns before he can make use of the long dark diagonal ... which will require time\nand also this move weakens the f7 pawn a little",
        "5. c4": "attacking a center pawn from side ... this move also allows my queen access to the queen side",
        "5... Bg7": "fianchetto",
        "6. Nc3": "developing and adding more forces to guard the center",
        "6... f6": "want to clear the way for the bishop to use the long diagonal",
        "7. cxd5": "eating from side and attacking the knight",
        "7... exd5": "re-take",
        "8. exf6": "eating and attacking the bishop",
        "8... Nxf6": "re-take with development and guarding the center ... I think black achieved his plan of activating the dark-bishop",
        "9. Be2": "developing and clearing the way for castling",
        "9... Bf5": "developing and putting the light-bishop on a good diagonal",
        "10. O-O": "king-side castling",
        "10... Qe7": "clearing his back-rank and not committing himself to a specific type of castling",
        "11. Bg5": "developing the dark-bishop and pinning the knight",
        "11... O-O-O": "castling queen-side. now, everything is clear and I should come up with a plan.\n\nmmm ... let's try to weaken blacks pawn structure on the queen-side",
        "12. Bb5": "want to exchange and weaken his pawn structure",
        "12... Nb4": "disallowing the exchange",
        "13. a3": "attacking the knight",
        "13... Nc6": "I think instead of moving his knight, black should have moved his queen or d-rook to a place where a pawn-structure preserving re-take is possible.",
        "14. Bxc6": "exchange and ruining his pawn-structure",
        "14... bxc6 15. Qa4": "directly benefiting from the bad pawn structure and attack the isolated a7 pawn",
        "15... Kb7": "protecting the pawn",
        "16. Rfe1": "gaining the e file with tempo",
        "16... Qd6": "moves the queen from harm",
        "17. Ne5": "moving the knight to an excellent outpost and threatening Nf7 forking the queen and the two rooks",
        "17... Rhf8": "protecting against the fork ... I still have the initiative",
        "18. Rac1": "moving the rook to an important half open file",
        "18... Rde8": "trying to regain the e file",
        "19. Re3": "I want to move the rook so I can double my rooks either on the c or e file",
        "19... Bd7": "want to make a cheap discovery on my queen with c5 and winning the very important d4 pawn",
        "20. Nxd7": "disallowing the discovery and deprive him from the bishop-pair",
        "20... Nxd7": "re-take ... I have the initiative\n\nmmm ... what to do now; no comprehensive plans is coming to my head :-(",
        "21. Qb3+": "let's check to keep the initiative",
        "21... Ka8 22. Rce1": "doubling my rooks and threatening to win a rook ... note that my d4 pawn is hanging and nothing protects him but the \"initiative\"",
        "22... Rxe3": "exchange what to do to protect the d4 pawn ...",
        "23. fxe3": "re-take with the pawn to preserve material ... but, this gives him the very important f file :-( ",
        "23... c5": "This is a mistake as it lefts the d5 pawn hanging",
        "24. Bf4": "closing the f file before taking the d5 pawn",
        "24... Qc6 25. Qxd5": "taking the d5 pawn",
        "25... Qxd5 26. Nxd5": "an exchange in my favor. as I am better to go to the endgame ahead in material and having a better pawn structure and also having the initiative as I am attacking the c7 pawn",
        "26... Kb7": "protecting the c7 pawn",
        "27. dxc5": "taking the pawn ... notice that black cannot take b2 with the bishop as this will pin the bishop",
        "27... Nxc5": "re-taking the c5 pawn",
        "28. Rc1": "attacking the knight and keeping the initiative",
        "28... Kc6": "attacking my knight too",
        "29. b4": "attacking the pinned knight forcing an exchange that is in my favor as I am more prepared to go to the end game",
        "29... Kxd5": "exchange",
        "30. Rxc5+": "re-take with a check that preserve me the initiative",
        "30... Ke6 31. Rxc7": "taking another pawn and preserving the initiative by attacking the g7 bishop",
        "31... Rf7": "perfect ... another exchange. \n\nendgame is mine",
        "32. Rxf7 Kxf7 33. Kf2": "I am ahead in material having a passed pawn e3 ... I believe If made no mistake I will win this one and increase my rating",
        "33... Ke6": "a battle will start now between the two kings to centerialize",
        "34. Ke2 Kd5 35. Kd3 Bf8 36. e4+": "step back king",
        "36... Ke6": "ok I will",
        "37. Bb8": "move, you little pawn",
        "37... a6": "Ok ... I will",
        "38. Kd4": "I centralized",
        "38... Kd7": "nothing to do ... stepping back further",
        "39. Kd5": "So I step forward",
        "39... Kc8": "desperately attack the bishop  ",
        "40. Ba7 Kb7 41. Bc5": "do you want to exchange and give me another passed pawn",
        "41... Bh6": "of course not",
        "42. e5": "go go go pawn",
        "42... Kc7 43. Ke6": "putting the king in front of pawn to clear the way for him",
        "43... Bc1": "attacking my forces from back",
        "44. a4 Ba3 45. Bd6+": "step away because I want to promote",
        "45... Kb6": "Ok ... I will",
        "46. Kd7": "And now black resigns as there is nothing stopping my pawn from promotion. this game was decided by a single tiny mistake.\n\nIf black did make use of the f-file I opened for him I would've lost badly ... I want to say thanks to roland75 it was a very good game ;-)"
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=9025",
    "gameName": "Let's play chess",
    "players": "monofy (1361) vs. roland75 (1501)",
    "opening": "Reti opening (A04)"
}