{
    "moves": {
        "1. d4": "the opening was uneventful at first",
        "1... d5 2. e3 e6 3. Bb5+": "White brings his bishop out, and I have a theory..if I can get him to move his oening pieces twice, I gain time",
        "3... c6 4. Ba4": "like that...leaving me more developed",
        "4... g6": "I continue my opening strategy",
        "5. e4": "at this stage, I have an edge in development, white is further ahead in space",
        "5... Nh6 6. Nc3 Bg7 7. Nf3 Na6 8. Bf4 O-O 9. Ng5": "at this stage, I am feeling a little penned in, and white is further ahead in development and controls much more space",
        "9... e5": "So the way to repel an attack on the periphery is to launch an attack in the center",
        "10. dxe5": "this costs me a pawn",
        "10... Bg4 11. exd5": "whites fatal move - a pawn and a bishop for a queen ",
        "11... Bxd1": "thus",
        "12. Kxd1": "now ahead 4 points, I push on",
        "12... Re8": "rook to an open rank",
        "13. e6": "This is dangerous - white is making ground with his pawns while I languish in defence",
        "13... fxe6": "End it I say",
        "14. Nce4 Qxd5+": "The beginning of the end for white",
        "15. Nd2": "white retreats and opens the door for me to gain a couple of pieces and further weaken him",
        "15... Bxb2": "I go on the offensive first for a pawn",
        "16. Rb1 Qd4": "then for his bishops",
        "17. Ngf3": "an attempt at defense",
        "17... Qxf4": "in vein",
        "18. Rxb2": "with the exchange I emerge another three points ahead",
        "18... Qxa4": "and in a pretty good position",
        "19. Ne5 Qa5 20. Re1": "I threaten the knight, but I am really after the king",
        "20... Rad8 21. Nec4": "an attack on the queen? Not likely!",
        "21... Qh5+": "instead I can cull several pieces",
        "22. f3": "and with this move the game is almost over",
        "22... Qxh2": "My queen on the rampage",
        "23. Rxb7": "It looks to white like the same game is on at the other end..but its not really",
        "23... Rda8": "my two castles prevent major damage",
        "24. Nd6": "his knight presents a small problem - I need teh pawns out of the way so I opt for the pawn while the knight might have been the better choice",
        "24... Qxg2": "this opens him up",
        "25. Nd2e4": "and he helps me by doing so himself",
        "25... Qxf3+": "I am points ahead now and the game is not in doubt",
        "26. Re2": "not a bad move really",
        "26... Rab8": "so lets see what he is made of",
        "27. Nd2": "this move I do not understand.. I think he saw shadows in the closet",
        "27... Qf8": "so now white has to choose - a knight or a castle...",
        "28. Rxa7": "naturally he chooses the castle",
        "28... Qxd6": "so I capture the knight",
        "29. Rh2": "a fair attack on my knight, but from a position of weakness",
        "29... Qxh2": "especially since he made a HUGE blunder",
        "30. Ne4": "well the game is over, and white has not resigned yet",
        "30... Red8+": "so it is forced",
        "31. Ke1 Rb1#": "Mate"
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=2346",
    "gameName": "Let's play chess",
    "players": "demens (1200) vs. opus692 (1200)",
    "opening": "Queen's pawn (D00), stonewall attack"
}