{
    "moves": {
        "1. Nf3 d5 2. c4": "Playing a reti opening, if black accepts the pawn white will play e3 and regain the pawn.",
        "2... d4": "Becoming a reversed benoni.",
        "3. e3": "Challenging the black center",
        "3... c5 4. exd4": "Exchanging white's inactive e pawn for the strong d pawn. Another idea is b4, almost a reversed blumenfeld counter gambit, when white will sacrifice a pawn for a strong center.",
        "4... cxd4 5. d3 Nc6 6. g3 e5 7. Bg2": "Following along lines of the benoni.",
        "7... Nf6": "Black doesn't play the super sharp f5 because white can castle and black will be behind in devlopment.",
        "8. O-O Be7 9. Re1": "A typical benoni move pressurring e5.",
        "9... Bg4 10. Bg5": " Preparing to exhange on f6 because white has less space, ",
        "10... O-O": "Protecting the king.",
        "11. Nbd2": "A typical benoni move when white will play a3, b4, Qb3 and have queenside initiative.",
        "11... Rc8": "Developing his rook but probably not correct as this doesn't pressure white and white can develop his plan at ease. One try is h6 when at least black has the two bishops and he can try to bust open the center. ",
        "12. a3": "Preparing b4.",
        "12... h6": "Pressuring the bishop but at the wrong time as now white can implement his plan. Better was a5.",
        "13. Bxf6 Bxf6 14. b4 Re8 15. Qb3": "Releasing the pin and preparing a b5 or c5 advance.",
        "15... a6": "Trying to stop b5 . ",
        "16. Ne4": "Placing white's knight on an excellant square where it eyes the f6 bishop. This also clears the d2 square so the f3 knight might go to c4 after c5 and it will be clear the knights are better. ",
        "16... Rc7": "Defending all the weaknesses but black plays passively, still it's hard to find a plan for black. Maybe Bxf3 giveing up the two bishops because the f3 knight will go to c4.",
        "17. Nfd2": "Heading to c4.",
        "17... b6": "Trying to stop c5 but this creates more queenside weaknesses.",
        "18. c5": "Clearing the c4 square.",
        "18... Be6": "Attacking the White queen.",
        "19. Qa4": "Attacking the vuernable a6 pawn.",
        "19... bxc5": "This allows the white knight to come to c5, but it's hard to defend the b6 pawn, due to a6 and b6 earlier played.",
        "20. Nxc5 Nb8": "Trying to defend the indefensible, but white decides to keep his c5 knight instead of winning a pawn. ",
        "21. Nde4": "Placing both white knights on excellant squares.",
        "21... Ra7": "Defending the a6 pawn . ",
        "22. Rac1": "Putting the rook on the open file.",
        "22... Bd7": "Attacking whites' queen.",
        "23. Qb3 Bb5": "Trying to attack the isolated d pawn but nothign else can help the bishop attack.\r\nBetter wad a5 trying to breake up white's queenside pawn mass.",
        "24. Rc2": "Preparing to double on the c- file.",
        "24... Kh8": "Getting out of the pin, but black should try to activate his N on b8 before thinking of playing f5. ",
        "25. Rec1": "Doubling on the c file. ",
        "25... Qb6": "Still not activating his b8 knight, better was Nd7 challenging White's c5 knight. ",
        "26. Nb7": "White uses a tactic along the long diagonal to gain control of the c file.",
        "26... Rxb7": "If black doesn't take the knight white can either win the f7 pawn or play rc7 or c8. If black takes with his queen white takes on f6 and then on e8 due to the double attack on black's squeen and rook.",
        "27. Nxf6 gxf6": "If Qxf6 ... Bxb7 and white wins the exchange.",
        "28. Bxb7": "Black runs out of time but after the continuation ... 28:Qxb7 29: Rc7 White wins the f7 pawn and has a near unstoppable mate on h8 or g7 after Qxf7."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=868",
    "gameName": "Let's play chess",
    "players": "cheetah08 (1634) vs. jmee (1638)",
    "opening": "Reti (A09), advance variation"
}