{
    "moves": {
        "1. e4": "I decided to annotate this game I had here in this site just to share, both because I found it interesting and fun and because I think it illustrates quite nicely the dangers of underdevelopment. This is also a game where despite our ratings we \"only\" did a couple mistakes, and three blunders. Most moves are machine-approved. Despite that, this will obviously just contain my low-rated thoughts and a little machine analysis. I'll annotate some tactics I saw and some tactics the machine saw.\n\nIf anyone ever reads this, this is my first time doing this so I'm sorry if I do it wrong, and I hope you enjoy. I won't be able to provide much theory because I myself don't know much yet. My objective here is just to show a fun game, explaining my reasoning to hopefully make others enjoy it, too. Any comments are more than welcome :)\n\nSo to start, the very common e4.",
        "1... e5 2. Nc3": "If my opponent responds e5 I generally go to the Vienna Game because I always get very interesting and fun games with it. ",
        "2... c6 3. d4 exd4": "This is the first and only inaccuracy according to the game analysis, although it's a very common move I get whenever I play this line.",
        "4. Qxd4 Qe7 5. Nf3": "Simply developing, expecting d5 next. d5 I think  By this point, I'm already quite a bit better.\n\nApparently this position is in the book but I couldn't find how to get here.",
        "5... d5 6. Bd3": "Developing, adding a defender to e4 and avoiding the e file, which I aim to use.\n\nI had to stop myself from going bg5 a couple times this game and this was one of them. My aim right now is generally just to try to play solidly so most of my openings are just me following that principle. bg5 is actually a pretty good move as it either forces f6 which stops black from developing the knight effectively or forces black to exchange queens leaving white with three very active pieces against the wholly undeveloped black. All other moves are quite bad for black.",
        "6... Bf5 7. O-O": "bf5 the previous move was one of the two mistakes. Funnily enough, the GK machine does want me to go Bg5 here and then castle queenside. The point is that after castling, the f pawn doesn't win the bishop because the e pawn is no longer pinned. After that, and exchanging queens on d4 my king is quite safe and black's king ends up very exposed. \n\nIt'd go: 7. Bg5 f6 8. O-O-O Qb4 9. Rhe1 Qxd4 10. Nxd4 Kf7 to avoid a discovered check I believe.\n\nSF on the other hand recommends castling first.\n\nSo at first glance, this probably seems like a very easy decision, but I spent some time on this. I wanted two things in this position and I wasn't sure which to do first: either to develop the dark squared bishop and bring the a rook into the game, or to get the king to safety and unpin the pawn. \n\nI ended up going with castling because it both allowed me to get a rook to e1 faster (threatening to pin the bishop, the queen, or both) and because it allowed me to not commit to moving the bishop just yet.",
        "7... dxe4 8. Bxe4": "This is the other mistake in the game. \n\nThe machine wants me to take with the knight, maybe just to preserve the bishop pair. It could also be that by taking with the knight the bishop is forced to take because it can't really go to e6 with Ng5 coming and forcing black to lose tempo to preserve it or try to develop anyway with everything in the way.\n\nI thought Bxe4 would be the move that would most tempt black to take as it threatens the bishop and Bxe5 when takes a bishop. My plan since O-O was to make development as difficult as possible for black (and if possible, take everything that managed to escape).",
        "8... Bxe4": "This was the first blunder (+6.6 vs 3.1) of the game, though SF rates it as only 0.72 worse than the best move and is the second best move to make.",
        "9. Nxe4": "This was also why I took with the bishop, as I wanted to stop Nf6 as well. ",
        "9... Nd7 10. Re1": "Finally getting the rook to e1. The danger here for black is the very simple Nd6+ getting the queen for a rook. Black must now lose the right to castle. Of course he still can in this situation, but there's the very simple Qa7 which has to be played very solidly by black to avoid mate I believe, and which affords a lot of opportunities to develop with tempo,while black's pieces remain mostly stuck.",
        "10... Kd8 11. a3": "I had absolutely no interest in trading queens, which would've now been an interesting escape route for black. I missed a nice machine line here where Bg5 pins the queen and after Nf6 Nxf6 trades the queen and picks up two minor pieces along the way (though the line is maybe a little above my paygrade :P).\n\n11. Bg5 Nf6 12. Nxf6 c5 13. Rxe7 cxd4 14. Rxd7+ Kc8 15. Rxd4 b6 16. Ne4 Bc5 17. Nxc5\n\nBlack responds with the most baffling move, which I think seals his fate. Qe6 was probably the better move to get the queen out of the way anyway. Interestingly, though, GK engine doesn't rate it as even an inaccuracy.",
        "11... Qe8 12. Nd6": "Most natural for me, there's just no good way to defend the queen. If Bxd6 the rook picks up the queen and the queen picks up the rook with check. ",
        "12... Qxe1+ 13. Nxe1 Bxd6 14. Qxd6": "Now the bishop defends the rook so we have to settle for the minor piece and a very uncomfortable position for black.",
        "14... Ngf6 15. Bg5": "The pins begin. Remember my aim here is always to get whatever tries to develop if possible. This will also allow me to wreck black's structure and create pawn weaknesses.",
        "15... Re8 16. Bxf6+ gxf6 17. Rd1": "Preparing the pin and threatening checkmate if black doesn't react.",
        "17... Re7 18. Qxf6": "Pins galore. The best square for the king that I analyzed and SF seems to agree is Ke8, because if Qh8+ then Nf8 defends. There was no easy win then, but once my knight came over it was hard to defend.\n\nStrangely enough, GK evaluates this move as the second blunder, though SF thinks it's the best move. I think GK has a point, though, because the f6 pawn would always be an easy target. It goes like this:\n\n18. Nf3 Ke8 19. Nh4 Nc5 20. Qxf6 Nd7 21. Qd6 Nb6 22. Nf5 Rd7 23. Qe5+ Kd8 24. Rxd7+ Nxd7 25. Qh8+ Kc7\n26.\tQxa8\tf6",
        "18... Rc8 19. Nf3 Kc7": "And the obvious third blunder, which is the final nail in the coffin. \n\nOnce Nf3 the only real move to stay in the game is Ke8 for the reasons already mentions. Because once Ne5 everything is pinned and it's hard to black to keep everything and avoid checkmate.",
        "20. Qxe7 Rd8 21. h3": "At this point I was ready to just bring everything to the game.\n\nI hope, if anyone has read this, you enjoyed it! It was a fun game to play so I thought I'd share it. Any comments or suggestions are welcome. "
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=68122",
    "gameName": "Let's play chess",
    "players": "pochesat (1415) vs. wolfpacker (1510)",
    "opening": "Vienna game (C25)"
}