{
    "moves": {
        "1. c4 e6 2. d4 b6": "I've been experimenting with this pawn structure vs. the d4 c4 pawn center.",
        "3. e3 Bb7 4. Bd2 Nf6 5. f3": "I am guessing that White was trying to prevent Ne4, but I think moving the f pawn here compromises the K's safety slightly.",
        "5... Be7 6. Nc3 O-O 7. e4": "This phalanx looks imposing, but it's important to support it with pieces.  It's also sometimes dangerous to open the center before you have castled.",
        "7... d5 8. e5 Ne8 9. f4": "f4 opens the diagonal for Black's Bb7.",
        "9... dxc4": "White cannot recapture or Bxg2 also wins the R.",
        "10. Nf3 Nc6": "Now the d4 pawn is loose.",
        "11. Bxc4 Nxd4": "Sneaking a pawn.",
        "12. Nxd4 Qxd4": "Now White cannot castle Kingside, and the Bc4 and g2 are hanging.  ",
        "13. Bf1": "White has to un-develop and waste a tempo dealing with the hanging pieces.",
        "13... Bh4+ 14. g3": "This opens the diagonal to the Rh1.",
        "14... Bxg3+ 15. hxg3 Bxh1": "Now Black is up the exchange, plus a couple of pawns.",
        "16. Qc2": "White is hoping to castle Queenside.",
        "16... Bf3": "Preventing immediate castling.",
        "17. Ne2 Bxe2 18. Bxe2 Qg1+": "This combination will gain another pawn and eventually prevent castling altogether.",
        "19. Bf1": "Forced.",
        "19... Qxg3+ 20. Ke2": "Now the K has moved and is stuck in the center forever.",
        "20... c5 21. Qd3": "White offers a Q exchange.  With a significant material advantage and no real positional problems, I happily accept.",
        "21... Qxd3+ 22. Kxd3 Nc7 23. Bg2 Rad8+": "Getting my R on to the open file.",
        "24. Kc2 Nb5 25. Rg1": "I'm not sure why the R came here, but White is probably hoping for some kind of Kingside attack.",
        "25... Rd7 26. Be3 Rfd8": "Doubling Rs.  ",
        "27. Bc6 Nd4+": "This fork of Kc2 and Bc6 requires more liquidation by White.  Black's material advantage gets more noticeable as more pieces are traded off.",
        "28. Bxd4 Rd7xd4 29. Rf1": "To protect f4.",
        "29... Rd4d2+ 30. Kc1 g6 31. a3 Rh2": "Preparing to bring both Rs to the seventh rank.",
        "32. Rd1": "White offers another exchange.  Black is happy to accept again, since it will lead to the gain of another pawn.",
        "32... Rxd1+ 33. Kxd1 Rxb2": "Black's material advantage is significant and White's B is near useless.  It can't touch the Queenside pawns and the Kingside pawns are protected by Black's K.",
        "34. a4 Rf2": "In view of the loss of the f and e pawns also, White resigned here."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=63039",
    "gameName": "Let's play chess",
    "players": "mlok (1546) vs. mmoody95 (1837)",
    "opening": "English opening (A13)"
}