{
    "moves": {
        "1. e4": "wcates (1243) vs brahmslover (1200) (annotator)",
        "1... g6": "The Robatsch or the Pirc Defense.",
        "2. Nc3": "The most played move here is 2.d4 as it is more flexible.",
        "2... Bg7 3. d4": "Switching back to the main line.  The most aggressive 4th move here for White is f4 which leads to double-edged play. ",
        "3... d6": "Maintaining flexibility.",
        "4. h3": "Not a strong move.  The only positive side to this move is protection of d4 as I can't play Bg4 to attack the knight on f3. Yet I wasn't going to play Bg4 anyways as my target will be e4 after I play ...a6, b5, Bb7, Nf6, and possibly b4 all attacking e4.",
        "4... Nf6": "Taking advantage of White's passive play, I don't need to worry about the e5 push, and I can continue attacking the e4 pawn.",
        "5. Bg5": "The bishop belongs on e3.  White cannot afford to trade the dark squared bishop for the knight because then my bishop would become very powerful.",
        "5... O-O": "The natural move.",
        "6. d5": "?! This simply gives me a target to attack.  White does not have enough pieces developed to make pawn moves such as this.",
        "6... c6": "Attacking the center.  In line with hypermodern theory, I can't allow White to protect his center or else he will continue to gain space and suffocate me.",
        "7. Bxf6": "? See note to move 5.",
        "7... exf6": "Opening the e-file to attack the e4 pawn.  White is lost here.",
        "8. Nf3 Re8": "The e4 pawn is doomed.  White's king is stuck in the center.",
        "9. dxc6": "?? Allowing me to develop another piece.  White does not realize that he is lost.",
        "9... Nxc6 10. Bb5": "I am not worried about this.",
        "10... f5": "Winning the e4 pawn.",
        "11. Bxc6 bxc6": "Strengthening my center.  So I can attack e4.",
        "12. Qd3": "?? White must castle if he is to stay in the game.",
        "12... fxe4 13. Nxe4 Bf5": "The pawn is gone, but now the knight is pinned.  Now Black has a sure material advantage.",
        "14. Nfd2 d5": "Notice the difference in development between Black and White.",
        "15. O-O-O Rb8": "Black does not stop to take his material yet, instead he keeps his initiative.",
        "16. Nb3 Bxe4 17. Qa6 Qf6 18. f3": "??? Mate in 4, Can you find it?",
        "18... Qxb2+ 19. Kd2 Bxc2": "The key to the solution.  I have to admit I am very proud to find this move :)  At first I didn't think there was a simple mate, because the King just runs to the other side.  But, the white king is in a mating net, because of the rook on e8.",
        "20. Rde1 Bxb3+ 21. Kd3": "Mate in 1.",
        "21... Qc2#": "I hope you enjoyed the game, if nothing else then for the mate at the end.  Hopefully when I no longer have a provisional rating, I will get a evenly balanced game or even a good loss that I can analyze for you."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=23269",
    "gameName": "Let's play chess",
    "players": "wcates (1243) vs. brahmslover (1200)",
    "opening": "Robatsch (modern) defence (B06)"
}