{
    "moves": {
        "1. e4": "This was a standard game between two lowish-ranked players (although this was my first game, so my rank may not be representative). I (fish613, playing black) annotated this game not because it's a stunning game, although it does exemplify how strategic advantages can be thrown away with tactical mistakes, but simply because I wanted to develop my own thoughts and thinking process further. Comments are welcome - I'm sure I've missed a lot.",
        "1... e5 2. Nf3 Nc6 3. d4 Nf6": "Hence 4 dxe5 Nxe4. 3... d6 is an alternative but blocks the bishop. 3... exd4 4 Nxd4 Nxd4 5 Qxd4 is equal on material but white has an iron grip on the centre.",
        "4. Bg5": "The natural response, pinning the knight.",
        "4... Be7 5. Nc3": "Guards against the threat of 5... Nxe4",
        "5... O-O": "The white square bishop is still unmoved. 5... b6 leading to Bb7 would have been a viable option.",
        "6. Nxe5": "At this point white has a very powerful centre, and is ahead on development.",
        "6... d6": "6... Nxe5 7 dxe5 leaves white with a strong centre.",
        "7. Nxc6": "Forces the exchange and weakens the black queen-side pawns after the next move.",
        "7... bxc6 8. Bxf6 Bxf6 9. Bc4": "Allows castling as well as attacking f7.",
        "9... Qe7": "9... Re8 aiming at attacking the king is negated by castling next move and Rb8 is too easily blocked to be useful. This prepares for 10... Be6, hoping to exchange bishops without weakening the king side pawn structure.",
        "10. O-O Be6 11. d5 cxd5": "Black gets rid of his doubled pawn, but white is able to keep a pawn in a useful position.",
        "12. exd5 Bf5 13. Re1": "White tries to force open the e-file for his rook.",
        "13... Be5": "The advantage of this move is that it blocks the e-file and also attacks h2. Black's bishop pair is now a useful threat against the castled king. The game is wide open at this point, with white one pawn ahead.",
        "14. Qf3 Bxc2 15. Rac1": "Anticipated by black. White retains the tempo and restricts black's bishop, but black has snatched a pawn for nothing.",
        "15... g6": "This move and my next few show my biggest weakness - I tend not to think through moves properly. The gambit is an interesting one, but I had hoped for a mate after Qxe1#. I missed the fact that white could move the king off the back rank. This move, g6, was intended to let white think I had made a mistake and move the c-rook off the back rank.",
        "16. Rxc2 Bxh2+ 17. Kxh2 Qxe1": "This is the point at which my plan fell through. I had made the game level on points but left myself with a worse position.",
        "18. Re2": "A good move by white, leaving him with control of the e-file.",
        "18... Qc1 19. Nb5 Rae8 20. Rxe8": "White exchanges rooks but relinquishes the e-file - a factor which by chance becomes significant a few moves later.",
        "20... Rxe8 21. Nxc7 Re5 22. Qb3": "? The white queen has left her defence of the white king, and some interesting tactical opportunities for black are available. Black has 3 lines of attack, two of which are fairly unpromising but the third can easily lead to mate if white does not take care. The unpromising lines are Rh5  and Qh6 . Black played Qf4 .",
        "22... Qf4+": "23 g3 Qxf2  24 Kh1 Re1  25 Bf1 Rxf1#, 24 Kh3 Rh5 25 Kg4 Qf5#; 23 Kh3 Rh5#; 23 Kh1 Re1 24 Bf1 Rxf1# are all big pluses for black. White can defend with 23 Qg3 allowing black to swap queens or with 23 Kg1, which is more difficult for black to checkmate (due to defence of f1, a key spot in some of the variations shown).",
        "23. g3": "In the end, white missed those options and played a move (quite quickly, as he happened to be online at the time) that allows a decisive black attack.",
        "23... Qxf2+ 24. Kh3 Rh5+ 25. Kg4 Qf5#": "I won by checkmate.\nAs far as move 13 both players were doing fine, but I made a tactical error by sacrificing both bishops without looking ahead properly. It was mostly by luck that white made a worse tactical error in move 22. I spent about 15 minutes analysing the position - which for me is a very long time to spend on a move - and my suspicions were correct: there was a promising mating attack on. White made one last error in move 23, where he could have blocked the mate, but by playing without looking to the end of the sequence he let me force a mate.\nI hope you enjoyed reading this. Please feel free to comment."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=17141",
    "gameName": "Let's play chess",
    "players": "cubfan (1232) vs. fish613 (1200)",
    "opening": "Scotch opening (C44)"
}