{
    "moves": {
        "1. e4": "i do enjoy annotating the games that i won, there are many games that i lost, but i don't like to remember them, i think this is a human behaver and i think majority of people do the same, so expect to see me smiling with joy at the end of this game.\ndisregard what i said and let us start :\nplease note that i will use these abbreviations :\nN = knight\nB = bishop\no-o or o-o-o = castling\nK = king\nQ = queen\nP = pawn\nR = rock \ni like this starting move because it control the center and open the way to Q and B  ",
        "1... e5": "replay to my massage",
        "2. Nf3": "developing with attack, good move",
        "2... Nc6": "developing with protection, good move",
        "3. Bc4": "developing with attack to P in f7, good move",
        "3... Nf6": "developing with attack to P in e4",
        "4. d3": "advancing and opening a way to B",
        "4... Be7 5. a3": "some players don't like it, they think it is wast of time, but i do it to prevent B or N from going to b4 square ",
        "5... O-O": "o-o to protect K",
        "6. h3": "to prevent N from coming closer to my K",
        "6... d6": "it opened a way to one B and close it to the other ? !",
        "7. c3": "it opened a long way to my Q",
        "7... Be6": "ready to fight",
        "8. Bxe6": "the only benefit is to break his pawn chain",
        "8... fxe6 9. Ng5": "N attacking P in e6",
        "9... Qd7": "protection",
        "10. Qb3": "to reinforce the attack on the weak square e6 ",
        "10... d5": "protection",
        "11. O-O": "o-o there was no better move in this time than this one ",
        "11... Rad8": "to be ready to control the d file after exchange pawns in the center ",
        "12. Re1": "to enforce P in the center",
        "12... h6": "to get red of N from this advancing position  ",
        "13. Nf3": "N run back ",
        "13... d4": "to open the way to his heavy weapons (Q, R, N)",
        "14. Nbd2": "to develop the N",
        "14... Nh5": "opening the way to B and ready to jump to advanced square f4",
        "15. Nc4": "to attack P in e5 and then Q",
        "15... Bf6 16. Rd1 Nf4": "to be in an advancing position",
        "17. Kh2": "to be away from attack of N if it jump to e2",
        "17... Qf7": "to the way to get check mate with help of N",
        "18. g3": "to prevent this coming danger before it happened  ",
        "18... Nxh3": "after some calculations he sacrificed the N to get good tempo  ??",
        "19. Kxh3": "after some calculations i found it is safe to get the gift ",
        "19... Qh5+": "check with Q alone useless ??",
        "20. Kg2": "K run back protecting it self and N",
        "20... Be7": "to give the way to R ?? i think Q in g4 better",
        "21. Ncd2": "N protecting N and attacking P in e6 by Q  with check !! good move",
        "21... Rf6": "protection to P in e6 and to give the way to duple the rocks in the f file !! good move",
        "22. Rh1": "attacking Q",
        "22... Qg4": "Q in g4, but too late",
        "23. Rh4": "after the Q again",
        "23... Qg6": "Q run back",
        "24. Qd1": "Q left attacking in e6 because now it is well protected with Q and R, and went back for support and help !! good move",
        "24... Rdf8": "more power to f file !! good move",
        "25. c4 Nd8": "back to support Q and rocks",
        "26. Qe2": "position is critical, his full power will be towards my K, the big battle will be in f3 or in f2, so\nthe Q should be closer to the mentioned squares ",
        "26... Nf7": "to be in the battle field ",
        "27. Rh1 Ng5": "attacking my N, i think big battle will start soon ",
        "28. Nxg5": "to attack before being attacked",
        "28... Qxg5": "forced, he don't want to lose more material, he is already ( - 2 )  ",
        "29. Rf1": "now the real big battle in f2, so my R came to help",
        "29... Qg6 30. b3": "to give pass to my B",
        "30... Rf6f7": "to give pass to B to be in the battle field ",
        "31. Rh1": "to stop B from coming to h4 ! ?",
        "31... Rf7xf2+": "got my P in f2 with check",
        "32. Qxf2": "forced",
        "32... Rxf2+": "to get the Q !!",
        "33. Kxf2": "not to lose material",
        "33... h5": "advancing may be will help Q to attack my K",
        "34. Nf3": "N will stop this P advance",
        "34... Qg4": "Q is advancing this time to its coming trap ?????? big mistake",
        "35. Nxe5": "Nxe5 !!!!!!! excellent move\nQ is completely trapped, no where to go unless exchange her self with a single pawn.\n  at this position he resigned.\nconclusion : \n1- my opponent is a good chess player, he made a mistake, but we all make mistakes.\n2- annotation is a very hard job, i hope that my friend the reader will  appreciate what i \n    have done and may be the beginners will learn some thing.\n3- your advice, comments and evaluation will be appreciated with my thanks. \n4- i like you all.\n5- thank you.\n6- a lot of thanks to GameKnot.\nfriend of all   mustafa        "
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=35871",
    "gameName": "Let's play chess",
    "players": "mustafamohammed (1530) vs. dk_elite_army (1509)",
    "opening": "Two knights defence (Modern bishop's opening) (C55)"
}