{
    "moves": {
        "1. e4 d6 2. d4 Be6 3. c4 f6 4. Nc3 Bf7": "The 2nd, 3rd and 4th move of black have 2 purpose:\r\n 1) get out of books\r\n 2) (may be) make me in \"attacking mode\"\r\nI did not succeed to prove it, but loosing tempo in the opening is dangerous.",
        "5. Nf3": "Quiet development. Qb3, putting seeds on a queenside attack is interesting.",
        "5... e5": "Due to his hazardous opening, black has difficulites to develop kingside pieces.",
        "6. Be3 Nd7 7. Be2": "White develop quietly and postponed the question of the center.\r\n After dxe fxe, black would have the f6 square for the knight and e7 for the bishop with acceptable development.\r\n After d5, the position is locked and black can continue with plan involving g6, Bg7, Ne7, 0-0, f5. Like Philidor.",
        "7... exd4 8. Nxd4 g6 9. O-O Bh6": "I was expecting Bg7",
        "10. Qd2": "?!\r\nAfter BxBh6 ! NxB Qd2, black would have to play Ng8 (beurk) or g5, f4 and the position will open on a very unsafe king.",
        "10... Bxe3 11. Qxe3 Ne5": "Attack the c4 pawn.\r\nAfter Ne7, I would have probablt played Qh6 to prevent 0-0.",
        "12. b3 h6 13. f4": "Obviously, it is time to open lines for an attack !",
        "13... Nd7 14. Bg4 Kf8": "Black start a manual castle, as other pieces are somehow blocked.",
        "15. Rae1 Kg7 16. Be6": "Candidates move :\r\nA] e5, B] f5, C] Nd5, D] Qg3, E] Qh3\r\nProbably the best one was Qh3 with possible answer Nc5, f5 g5, Bh5\r\n\r\nWhite move intend to exchange an active defender but actually loose a piece.",
        "16... c5 17. Nf5+": "!! the knight will not leave for nothing ! Black king will have no safe harvest, black army will remain tied.",
        "17... gxf5 18. exf5 Nb6 19. Qg3+ Kf8 20. Bxf7 Kxf7 21. Qg6+ Kf8 22. Re6": "Well, black is a knight up, but kingside N and R cannot move, the Nc3 intend to jump on e4 b5 or d5, Rooks can attack on d, e and g files. What should black do ?\r\nI was expecting Qd7 then Qg7 (or f7) to exchange the Q but black choose another way.",
        "22... h5 23. Rd1": "After Ne4 Rh6, QxR NxQ, Rxf6+ is interesting but probably insuffisant.",
        "23... Rh6 24. Qg3 Nc8 25. Ne4 b6": "Prevent Nxc5",
        "26. Nxd6": "Probably the wrong move.\r\nBlack is so cramped than white should have take time Qf3 or Qc3 or Qd3-d5.\r\n",
        "26... Nxd6 27. Rdxd6 Qc7 28. Qd3 Rh7": "Here my opponent offered a draw. After considering the answer to Qd5 I felt there was not enough pieces left for an attack and agreed for it.\r\nFor instance Qd5 Rc8, Rc6 Qd8, RxR QxRc8, Qd6+ Kg7 and the king will be safe in h8.\r\n"
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=29123",
    "gameName": "Let's play chess",
    "players": "riwulof (1887) vs. strayshift (1888)",
    "opening": "Pirc defence (B07)"
}