{
    "moves": {
        "1. c4 Nf6 2. Nc3 g6 3. d4 Bg7 4. e4 d6 5. Nf3 O-O 6. Be2": "This is the classical King's Indian Defense starting position.  The normal move here is 6...e5.",
        "6... b6": "I think this is an error, possibly enough that the game is over now!  6...b6 creates weakness on the queen side for white to attack, the light-squared bishop is best on c8 in the KID to aid the pawn storm on the king side, and finally b6 wastes time in attacking the center compared to the normal 6...e5.\n\nOn <a href=\"http://www.chessgames.com/perl/explorer?node=37575&move=6.5&moves=d4.Nf6.c4.g6.Nc3.Bg7.e4.d6.Nf3.O-O.Be2&nodes=10703.11482.11470.11471.11472.11473.11518.37573.11686.11486.37575\">chessgame's database</a> ...b6 has resulted in white winning: 83.3% and draw: 16.7% and black won 0%!",
        "7. O-O": "Often times, developing classically is the most practical way to meet strange out-of-book moves.\n\nIn the computer match IsiChess vs Neurosis, 2006: continued 7.e5 Nfd7 8.exd6 cxd6 9.0-0 Bb7 10.Bg5 Nf6 11.d5 when white's space advantage gave him (it?) a slight advantage.\n\nI like 0-0 slightly better though, it seems strange to play e2-e4-e5 only to trade on d6 and not really gain anything.",
        "7... Bb7 8. d5": "Scholz-Lilienthal ICCF corr 1987 continued 8.e5 dxe5 9.dxe5 Nfd7 10.e6 fxe6 11.Qc2 Nc6 12.Rd1 Qc8\n13.Bg5 Nf6 14.a3 e5 15.c5 e6 16.cxb6 axb6 17.Nb5 Nd5 18.Rac1 Rf7 19.Bh4 Rd7 20.Ng5 Nf4 21.Bc4 Rxd1  22.Rxd1 Nd4 23.Nxd4 exd4 24.Nxe6! when white had his material back and the initiative.\n\nThis is more testing for the black side than my continuation which almost lets black off the hook.\n\nThe final alternative is 8.Qc2 protecting the center and slowly building up behind it since black seems to refuse to attack it !?",
        "8... c5 9. Bg5 h6 10. Be3 e6": "Crafty recommends: 11.dxe6 Nxe4 12.Nxe4 Bxe4 13.Bd3 Bxd3 14.Qxd3 Qe7 15.exf7  Qxf7 ( -.83)\n\nI instead threatened h6.",
        "11. Qd2 g5": "It seems 11...Ng4 would have been a much better move.  A possible continuation might be 12.Bf4 e5 13.Bg3 Nd7 14.Nh4 Ngf6 15.Qe3 Qe7 16.Qf3 Rad8 with a slight advantage for white.",
        "12. h4": "Attacking the new weakness, white firmly has the initiative now.",
        "12... Ng4": "This is just a mistake, losing a pawn.  ...g4 might have been better but after 13.Nh2 h5 14.Bg5 exd5 15.exd5 Re8 16.Qf4 Nbd7 16.f3 gxf3 17.Nxf3 a6 18.Rad1 exd5 19.exd5 white still has a large advantage.",
        "13. hxg5 Nxe3 14. Qxe3 hxg5 15. Qxg5 Qxg5 16. Nxg5": "White now a material advantage, along with superior minor piece.  Here is where the \"technique\" comes into play.",
        "16... Bh6 17. Nf3 e5": "Black closes the center hoping he can pull out a draw, but with this many pieces still on the board that will be very difficult to do.",
        "18. Nb5": "I should have won an exchange after this move because after 18...Rd8, the simple 19.Nc7 would have ended the game on the spot.  I of course didn't play this.....",
        "18... Rd8 19. a4": "A part blunder (!?) letting black back in the game.  I was aiming to take away all of black's counter play on the queen side, before using my extra pawn on the king side.",
        "19... a6 20. Nc3 Nd7 21. Rad1 Nf6 22. Nh4": "Aiming for the f5 post and threatening a possible f4 break.",
        "22... Bc8 23. b3": "I first tidy up the situation on the queen side.  We are playing correspondence chess, why hurry?",
        "23... Ra7 24. g3": "This was the first move of my king side play consisting of: Kg2, and doubling on the h-file",
        "24... Kh7": "Black prepares for his rooks to slide over.",
        "25. Kg2 Rb7": "Eyeing the b5 break.  But I just have to many pieces on that square.",
        "26. Rfh1 Bg5 27. Rdf1": "again threatening the f4 break.  Unfortunately, Nf5 dis ch does not do anything after Kg8. ",
        "27... Kg7 28. f4": "Finally a pawn break!",
        "28... Bh6 29. fxe5 dxe5": "Now I have a passed d-pawn for insurance.",
        "30. Bd3 Ng4 31. Nd1": "Not falling for those easy traps.",
        "31... Bg5 32. Nf5+": "Taking the strong f5 post.",
        "32... Kg6 33. Be2 Nf6 34. Bd3 Ne8 35. Nh4+ Kg7 36. Nf3 Bf6 37. Ne3": "I am reworking my knights to arrange the advance of the g-pawn.",
        "37... Kf8 38. Nf5 Kg8 39. g4": "Finally the g-pawn advances. This signals the end of the game.",
        "39... Ng7 40. g5 Nxf5 41. exf5 Bg7 42. f6": "And here black resigned.  The end would have looked like: 42...Bh8 43.Nxe5 Re8 44.Bh7  Kf8 45.Ng6 ! fxg6 46.Bxg6 when the h8 bishop is lost and black can't stop the pawns.\n\nI hope you enjoyed this game.\n\nStringplayer92"
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=17355",
    "gameName": "Let's play chess",
    "players": "stringplayer92 (1654) vs. cosimo (1758)",
    "opening": "English opening (A16)"
}