{
    "moves": {
        "1. d4 d5 2. c4 c6 3. Nc3": "Queens Gambit Declined opening.",
        "3... a6": "Bryan, to me this move doesn't seem to do much.  In the beginning of the game, it is good to develop your pieces and attempt to gain control of the center of the board.",
        "4. Nf3 Nd7": "This will win a free pawn.",
        "5. cxd5 Nb6": "Probably should have retaken with pawn on c6.",
        "6. dxc6 bxc6 7. Bf4 Be6": "Possibly a better position for black's bishop is b7.  It finachetto's black's queenside and guards c6.  It put's blacks bishop on one of two largest diagonals on the board and is excellent at indirect attacks.  Here, I would have moved 7 . . . Nf6 to develop the kingside with a goal of castling",
        "8. e3 Nf6": "good move.",
        "9. Bd3 h5": "Since black's white bishop is on e6 already, it would have been best to move the pawn 9 . . . g6, with thinking of 10 . . . Bg7, then 11 . . . 0-0.  The placement of this pawn allows my bishop on f4 to move to g4 and attack black's knight on f6.  If you were dead set on moving this pawn, perhaps it would have been better to move 9 . . . h6 to prevent my black bishop the oppurtunity of occupying the g5 square.",
        "10. O-O Ng4": "Not an unorthodox move, but it allows me to quickly move my pawn to h3 - which threatens black's knight.  This will gain white a tempo.",
        "11. h3 Rh6": "This move allows white to capture black's knight, as well as black's rook.  Black's knight should have retreated back to f6.",
        "12. Bxh6 gxh6 13. hxg4": "Now, white is quickly up 6 points after the capture of black's rook and knight.",
        "13... Ra7": "The best move here would have been 13 . . . Bxg4.  This pins my knight.  (My knight would not be able to move without black's bishop being able to capture white's queen.)",
        "14. gxh5": "Instead, it allows me to capture black's pawn.",
        "14... Bg4": "Good move.  It could also be followed up with 15 . . . Bxh5.",
        "15. Be4 Nc4": "A better move would have been 15 . . . Bxh5 - (if white's bishop had not been on e4), but this is not a bad move as it threatens my pawn on b2.  Of course to avoid this, I can either develop my queen by moving her to either e2 or c2; or I can threaten black's knight by moving my queen to b3, and at the same time guard my b2 pawn.  \r\n\r\nHowever, if I move my queen to b3, black could move 16 . . . Bxf3!, (also assuming white's bishop was not on e4.)  But it is.  If I retake with either my bishop or pawn, black could move 17 . . . Nd2.  This would fork white's queen, rook, and bishop.  This would help, as a for simply material value is worth, a rook is worth five points, and a knight is worth 3.\r\n\r\nIn addition, instead of guarding black's pawn on c6, black moved his knight.  This allows for me to capture the pawn and place black in check.\r\n",
        "16. Bxc6+": "Instead of moving my queen, I choose to capture a pawn and put black in check.",
        "16... Bd7": "The best position, as moving the rook or queen would have caused white to capture either with a gain of points.",
        "17. Qa4": "17. Qa4?! allows black to capture b2 and threaten white's queen, but I will gain the pawn back and position, moving in for a mating attack.",
        "17... Nxb2": "Good move.",
        "18. Bxd7+": "Black is down points, so trading is usually never wise when down pieces - so retaking with the queen may not be the best idea.  However, if black retakes with the rook, white will win a pawn on a6.  Tough decision. . . neither seems good.",
        "18... Rxd7 19. Qxa6": "White wins the pawn after 18 . . . Rxd7",
        "19... Nc4": "At this point it may have been best to move 19. . . e6, as it allows more free movement of black's queen and bishop.  But with 19 . . . Nc4, it allows white's queen to capture black's bishop. ",
        "20. Qxc4": "White captures black's knight.",
        "20... Bg7": "Good move, because it should eliminate the threat of 21. Ne5 ",
        "21. Ne5": "I move anyway.  I'm ok with trading pieces.",
        "21... Rb7": "I can see why black would move his rook, but this allows for a checkmate on the next move.",
        "22. Qxf7#": "Black cannot move to d7 as white's knight is guarding that square.  Good learning game.  :)"
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=28477",
    "gameName": "Let's play chess",
    "players": "nefariousknight7 (1546) vs. nexos361 (1200)",
    "opening": "QGD Slav defence, Alekhine variation (D10)"
}