{
    "moves": {
        "1. e4": "This game features an early blunder by white, and a recovery leading to a fairly quick victory for white. ",
        "1... e6 2. d4 d5 3. e5 c5 4. c3 Qb6 5. a3": "The French opening, played unreflectively by both parties. I opted for a3 without much thought, and relying heavily on a games database. Thinking on my own, I may have played Ng3 instead.",
        "5... Nc6 6. Nf3 cxd4 7. Nxd4": "This was the blunder. I should have taken with the pawn. ",
        "7... Bc5": "No way to add a third defender to the knight. Only option is to go down fighting.",
        "8. Nxc6 Bxf2+": "And lose a pawn. The king now has to give up castling rights. Virtually none of the minor pieces are developed. At this point I considered resigning, but somehow or other, continued playing.",
        "9. Kd2": "Trying to move the king to a safe position.",
        "9... bxc6 10. Kc2 Ne7": "Perhaps black should have pressed his advantage by attacking the e5 square with f6. It removes a strategically placed pawn and begins to open up a file for his light square bishop. ",
        "11. Bd3": "Protecting the king and connecting queen and rook.",
        "11... Ba6": "Not sure what black's plan is. My only concern is to get the knight and bishop out of their starting positions to connect the rooks.",
        "12. Bf4": "This pawn would prove very dangerous for black.",
        "12... Bxd3+ 13. Qxd3": "This proved a poor exchange for black. It enables white to develop the queen and renders his connected queen and bishop a little ineffective.",
        "13... Ng6 14. Bg3 Bxg3 15. Qxg3": "This series of exchanges proved favourable for white, enabling the development of his queen. The central pawn pivots the whole series of exchanges.",
        "15... Rb8": "Good move for black.",
        "16. b4": "This pawn defensive structure is extremely effective.",
        "16... c5 17. Nd2": "At last developing the knight and connecting the rooks. The defensive pawn structure looks strong, despite the additional attacker.",
        "17... d4": "Black tries attacking the base of the pawn structure. However, white can safely ignore the threat.",
        "18. Nc4": "Taking advantage of black's pawn advance and threatening the queen, and protecting the e5 pawn. It seems that this was an important square.",
        "18... Qc6": "Probable a good spot to retreat to, threatening a check on a4",
        "19. Nd6+": "Now the value of the advanced central pawn can be seen.",
        "19... Ke7": "Seems a good move, connecting his rooks.",
        "20. Qg5+ Kf8": "Losing the connected rooks. Perhaps Kd7 would have been better. ",
        "21. Rhf1": "Threatening pawn recapture with a powerful check.",
        "21... Nxe5": "At last he takes the pawn, but too late. White has already developed a strong attack. ",
        "22. Qxe5 Qxg2+": "Looks like a devastating move for black, but the threat to f7 was overlooked. ",
        "23. Kb3 Qd2": "Hoping for a powerful check in the next move, but giving white time to finish the game.",
        "24. Rxf7+ Kg8 25. Qxg7#": ""
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=54712",
    "gameName": "Let's play chess",
    "players": "jaybalaram (1429) vs. 12wuxxor (1369)",
    "opening": "French (C02), advance, Wade variation"
}