{
    "moves": {
        "1. e4": "Notes by myself :p",
        "1... e6": "The French defense is now my only answer against 1.e4",
        "2. d4 d5 3. Nd2": "The Tarasch variation: white's knight can't be pinned by Bb4 and the c3 square can be occupied by a pawn",
        "3... Nf6": "3...c5 is the main line, but this move is less drawish and equally good",
        "4. e5 Nfd7 5. Bd3 c5 6. c3 Nc6 7. Ne2 Qb6": "The old main line... It allows white less options than 7...cxd4 8. cxd4 f6 which is also good",
        "8. Nf3 cxd4 9. cxd4 f6 10. exf6 Nxf6 11. O-O Bd6 12. b3 O-O 13. Bf4": "!? Bb2 is more common",
        "13... Nxd4": "the old d5-fork trick (but on the other side of the board!)",
        "14. Nfxd4 e5 15. Be3 exd4 16. Bxd4 Bc5 17. Rc1 Bxd4 18. Nxd4 Bd7 19. Qd2 Rae8 20. Rfe1 Ne4": "Here i hoped that the isolated pawn would have given me more attacking chances on e4... Fortunately I was right",
        "21. Bxe4 dxe4 22. Nc2": "Trying to create a blockade on e3",
        "22... Bc6": "!? risky move, because if white succeeded in blockading the pawn, this bishop would become very passive",
        "23. Qd4": "going for exchanges",
        "23... Qb5": "24. Qxa7 Ra8 is not good for white, so I can avoid the exchange",
        "24. Red1": "Preventing Rd8",
        "24... Qg5": "Preparing Rd8",
        "25. a4": "Threatening Qxa7",
        "25... Red8": "! Allowing Qxa7... I have a good attack which is probably enough compensation",
        "26. Qxa7 Rd3 27. b4": "? This pawns will become very weak, maybe Qb6 was better...",
        "27... Qf4": "threatening e3",
        "28. Rde1": "28. Rf1? Rh3! is crushing, but maybe 28. Ne1 is a better defense",
        "28... e3": "! this pawn is attacked 4 times and can't be taken...",
        "29. f3 Bxf3": "30. gxf3 Rd2 and mate",
        "30. Nxe3 Bc6 31. Re2 Qxb4 32. Rf1 Rxf1+ 33. Nxf1 h6 34. Qf2 Qxa4 35. Re7": "Looking for a perpetual",
        "35... Qd4 36. Ne3 Be4": "! Now the perpetual is no longer possible, white has to exchange down into a lost endgame",
        "37. Nf1 Qxf2+ 38. Kxf2 Bc6 39. Rc7 Kf8 40. h4 Ra3": "40...Rd7 was simpler",
        "41. g3 Rf3+ 42. Ke2 Rf7 43. Rxf7+ Kxf7 44. Ne3 Be4 45. Kd2 Ke6 46. Kc3 Ke5 47. Nc4+ Kd5 48. Nb6+ Kc6 49. Nc4 Kc5 50. Nd2 Bd5 51. g4 b5 52. Kd3 b4 53. Ke3 b3 54. Kd3 Kb4 55. Kd4 Be6 56. Nxb3": "Despair",
        "56... Kxb3 57. g5 hxg5 58. hxg5 g6": "After Bf5 it will be easy for black to take the g5 pawn.."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess-http-gameknot-com?gm=17338",
    "gameName": "Let's play chess, http://gameknot.com/",
    "players": "jdee265 (1954) vs. sophistos (1877)",
    "opening": "French (C06), Tarrasch, closed variation, main line"
}