{
    "moves": {
        "1. e4": "So, like me, he starts off with the most common opening.",
        "1... e5": "Standard.",
        "2. Nf3": "Also standard.",
        "2... d6": "?! I understand this move in the sense that it develops since black just advanced his other center pawn.  However, this is inaccurate and better was 2...d5 as after 3.exd5, Qxd5  This move, however, compromises space for his DSB, so that he'll either have to cram it or waste time to get it out.  ",
        "3. d4": "So, white decides to take advantage of that with this move.  The idea behind it is to keep that B crammed by exchanging, and that's about to happen.",
        "3... exd4 4. Nxd4 Nf6": "So, black decides to bring another piece out.",
        "5. Bg5": "Of course, white decides to pin that N, and that's something that I also would have done.",
        "5... h6": "Very understandable and it is a good way to get out of it.  And, instead of retreating on h4, followed by g3, chicoboy is going to exchange his DSB for black's N.  However, I would've liked 5...Bf7, and it's the most common way to break the pin.  Jack Stockel told me that both ways, wheather the opponent develops his B or brings out his P like this are both equally common.  But, what I especially like about 5...Bf7 is that it would have developed another piece, whereas, this is not a developing move.  ",
        "6. Bxf6 Qxf6 7. c3": "In this position, white thought that his N was in danger, and this move does protect it.  However, Gerhard's d N was not in danger because of his Q.  In my mind, better was 7.Nc3.  The problem with this move is that it doesn't develop anything, and in fact, takes away a square that would normally be used to get the b1 Knight out.  In addition, this makes it less safe for white to castle K side.",
        "7... c5": "And, now black is trying to find a weakness with this move.  I figured it out, the reason that I've been into attacking material all has to do with tempo gain, and this is exactly what this move does.  As IM elyhim put it, \"Gaining tempo is like taking money out of your opponents and depositing it in your own bank.\"  Well, that is the case here because once white retreats black will be able to develop another piece.",
        "8. Nf3 Be7": "As noted earlier, because black played 2...d6, as opposed to 2...d5, this is the consequence.  While it might appear that having a crammed bishop isn't a problem, it's actually quite serious because it will make it very difficult to near impossible for black to control the center, given that the center is not well coordinated for black.",
        "9. Nbd2": "So, although slightly crammed, it's less then black, and this move actually gives white an advantage, all of a sudden.  Now both players are equal, in terms of development, but white's center is better coordinated, and should be able to control, within the next few moves.",
        "9... Bg4": "So, black now decides to pin white's N.",
        "10. h3": "As noted and implied earlier, I would have played 10.Be2, instead.",
        "10... Bh5": "This time, however, no exchange.  Instead, black retreats, but I'm not crazy about this, at all.  Instead, I would've exchanged because once white reattacks with 11.g4 black has to retreat again, after which white can finally complete develop, after 12.Bb5+.",
        "11. g4 Bg6 12. Bb5+ Nc6": "But, black's also completely developed.  The only difference as noted earlier, however, is that white's center is controlled, whereas black is not, so chicoboy has a noticeable edge, at this point.",
        "13. Qe2": "And, now, white's remaining piece out.  The only thing left is for him to castle.",
        "13... O-O": "And, that, however, is something that black does.",
        "14. Bc4": "I don't know why white played this because his LSB is not attacked.",
        "14... Rfe8": "?! The goal here is for black to put pressure on the e file.  However, in my opinion, this move is an inaccuracy because Jack Stockel told that it's generally a bad idea to bring both of your R's on the same file.  ",
        "15. O-O-O": "!? Yes, white does castle, but in my mind, this is not his best move.  In fact, it's risky because in general with this position being a perfect a example, castling Q side often leaves your K vulnerable to exposure, and this is a well known fact.  Therefore, castling K side, so 15.0-0 was best, in my mind.",
        "15... a6": "I don't know why black played this.",
        "16. Qe3": "I'm not sure what this move accomplishes.",
        "16... Na5": "At this point, black intends to exchange white's B for his N.  Not exactly sure why because, in this position, a N is worth more then a B.",
        "17. Bd5": "But, white is not going to allow that.  However, I would've exchanged because that would have immediately created a weakness.",
        "17... Rab8": "Putting pressure on the b file.",
        "18. e5": "? Now, white is going for an exchange.  At this point, black better be careful because his Q is left en-prise.  And, if he doesn't find the right move, white will win for something worth less.   But, this however, is a mistake, because if black finds the right move, he will wind up a pawn ahead.  ",
        "18... Qxf3": "?? This is the wrong move.  Best was 18...dxe5, in this position, as black would be a pawn ahead.  As noted earlier, with this move, however, white wins koki's Q for a N.",
        "19. Nxf3 dxe5": "Now, is a good time for black to take, but he's still behind.  The question will he be able to come back?  That remains to be seen.",
        "20. Qxe5": "?? This capture, however, is also a blunder.  It looks like a very good move, and in general, appears worthy of a !.  But, it's not a good idea to get attempted because it's well known that what looks good can be and sometimes is bad.  This is an example.  It looks like white won back a pawn, however, this move will allow black to win back the Q, for a B and P after a discover a check on his next move.",
        "20... Bg5+ 21. Qxg5 hxg5 22. Nxg5 Re7": "I don't know why black played this, maybe it was to put pressure on the e file.  However, best was a R fork with the immediate 22...Re5!, winning a free piece, this time, henceforth, giving black the advantage.",
        "23. Rhe1": "! This is a good move because, in general, as per what Mr. Stockel told me, while unlike with development and controlling the center, there's no rush with this.  But, it's a good idea to double up your rooks, like this, and what's good about this is that the doubled rooks are not on the same color.  Because Jack also said that it's not a good idea to bring your rooks on the same colored square.",
        "23... Rc7": "! Good choice.  Black decides to avoid exchanging R's with this move.  I like it because, in general, when you're behind, it's not a good idea to exchange as it would give you less to defend with in the endgame.",
        "24. Re2": "At first, I wasn't sure why, but quickly figured it out.  The idea behind this move is combine both rooks on one file.  Jack also mentioned that it's usually a good idea to do that because it's what makes doubled rooks powerful and dangerous against the opponent because they generally pose very serious threats that are not easy to deal with.",
        "24... Kh8": "In my mind, this move was pointless.  I believe that black was worried about a dangerous check with the E rook, LSB, and the remaining N.  But, what he forgot is that his LSB defends against it.  ",
        "25. Rde1": "In the meantime, Gerhard has now united his R's, as noted earlier.  And, as it turns out, they pose a very serious threat that black has to worry about.  And, if he's not careful, white will be able to mate him.",
        "25... f6": "!! Very good choice which shows that black was thinking ahead.  Had he not seen this, it would have been game over by exchanging R's, with 26.R2e8+!! 26...Rxe8 27.Rxe8#  However, black is not out of the woods and, \"he better be careful from now on\".  Otherwise, white will be able to force a win.",
        "26. Nf3": "In the meantime, white's not taking any chances, either.  He knew that leaving his N on g5 would leave it en-prise, and that black would win it, after 26...PXN.",
        "26... b5": "?? I don't know why black played this.  But, this is his losing blunder.  Despite being behind, best was to force an exchange, with 26...Be4.  With this move, however, white will either win a free piece, or find a mating pattern, in which, black will not be able to avoid, this time. ",
        "27. Nh4": "Very smart choice.  White's intention is to force mate or win a free piece.  What doesn't realize is that koki could have done both.  How?",
        "27... Bd3": "?? Now, it's all over, and there's no going back, this time.  Yes, he did protected his LSB by attacking white's R.  The idea was to gain tempii  Unfortunately for black, however, this move seals his fate.  That's because, in the next few moves, it will lead to an inevitable mating sequence.  It actually starts when white actually gains tempo, with his next move.  So, in short, koki missed the real threat.  ",
        "28. Re2e3 Bc4": "Black is trying to force an exchange, but instead of allowing it, white can now play the move, that I talked about earlier.  And, that's the move that seals black fate, once and for all.",
        "29. Re3e8+ Rxe8": "As I expected.  Yes, it does prevent the loss of a R, but no matter what black does, white has a forced win.",
        "30. Rxe8+": "The obvious response.  ",
        "30... Kh7": "Forced.",
        "31. Be4+ Kh6": "He also could have played 31...g6, but didn't want to lose a pawn.  Even if he did that, white would still mate quickly.",
        "32. Rh8+ Kg5": "Forced.",
        "33. Rh5+ Kf4": "Also forced.",
        "34. Bc2": "!! This move protects his LSB.  But, this time, it's not just good it's extraordinarily brilliant, worthy of two exclamation points, as opposed to, one.  And, that's because white's LSB will be used as an extra piece to coordinate the mating pattern, which is going to unfold soon.",
        "34... Bxa2": "Well, given that white is going to mate, black has nothing better to do then take.  The idea being is that no move is better then the other, in this case.  Therefore, I would've resigned, at this point, if I were black because of what's going to come on the next move.",
        "35. Rf5#": "Overall, an instructive game with a lot for both players to learn.  The moral being, and this is the same mistake that, sometimes, even GM's make.  But, we learned that it's always important to be very careful where you place or your pieces.  In other words, don't leave them en-prise as it can cause problems.  So, I guess you can say to watch the entire board carefully, or, \"be a spectator of your game\".  Otherwise, you might wind up paying the ultimate price, as was the case here."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=54096",
    "gameName": "Let's play chess",
    "players": "chicoboy (1345) vs. koki (1348)",
    "opening": "Philidor (C41), exchange variation"
}