{
    "moves": {
        "1. d4 f5": "Going into the Dutch Defence.",
        "2. Nf3": "Good, developing move.",
        "2... g6 3. e4": "I'll give this a \"?\" because it just loses a pawn.",
        "3... fxe4 4. Ng5": "putting the knight on a good square. However the gambit with \"e4\" is usually considered better in this line: d4 f5,e4 fxe4, Nc3 Nf6,Bg5. There is a trap here if black tries to hold teh pawn with \"d5\". Can you find it? Answer next.",
        "4... Nf6": "Defending the pawn. (The answer is Bxf6 exf6, Qh5  g6 and Qxd5 ;white has regained the pawn and will win another, putting them a clear pawn up.)",
        "5. Nc3": "Attacking the pawn.",
        "5... d5": "This works now because the Bishop can no longer go to g5.",
        "6. Bf4": "Keeping up the development but it's hard to belive its worth a whole pawn.",
        "6... c6": "Fortifying the centre and also keeping out ideas of Nb5.",
        "7. Qe2": "This is preparation for castling, although Qd2 may be better as it dosnt block the Bishop on f1.",
        "7... Bg7 8. O-O-O h6": "Forcing the active piece to retreat, or else to lose material.",
        "9. Nxd5": "This is also a \"?\". The sacrifice was never going to work but its hard to see a good plan. Nh3 would still have been best though.",
        "9... cxd5": "Accepting the knight.",
        "10. Qb5+": "It may look menacing, but it really has no effect.",
        "10... Nc6": "Developing.",
        "11. Be5": "White is giving his pieces up for nothing.",
        "11... hxg5": "Free knight!",
        "12. Bxf6 Bxf6 13. f3": "The rest of the game hardly need notation.",
        "13... exf3 14. gxf3 O-O 15. Qd3 Bf5 16. Qe3 Rc8": "Building up pressure against the king.",
        "17. c3 Qd6 18. f4 gxf4 19. Qf3 Nxd4": "Winning a pawn due to the pin on the c file.",
        "20. Qf2 Nc2 21. Bd3 Bxd3 22. Rxd3 Ne3 23. Rg1": "Almost all blacks pieces are aiming towards the white king.",
        "23... Kf7": "This calm move ensures that white cannot create threats against the king. The g pawn can be defended easily and black ca proceed with his attack.",
        "24. h4 Qa6 25. Rxd5 Qxa2 26. Rd7 Qa1+": "The king hunt begins!",
        "27. Kd2 Qxb2+ 28. Ke1 Bxc3+ 29. Rd2 Qc1+ 30. Ke2 Qxd2+ 31. Kf3 Qd5+ 32. Ke2 Be5 33. h5 Rc2+ 34. Ke1 Qd1#": "Checkmate!"
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=726",
    "gameName": "Let's play chess",
    "players": "xtrauniq (1182) vs. smoran90 (1200)",
    "opening": "Dutch (A80)"
}