{
    "moves": {
        "1. b4": "My first game on GK. ",
        "1... d5 2. Bb2": "A good response from Saltman. ",
        "2... Nc6": "This is a bad move as it loses tempo. ",
        "3. b5 Na5 4. e3": "d3 is probably better. ",
        "4... Nc4 5. Bxc4 dxc4 6. Nf3 Bg4": "This is where I feel the loss of my white bishop. ",
        "7. h3 Bh5 8. d3 cxd3 9. cxd3": "I like this position. My bishop has a clean line to operate. ",
        "9... Bxf3": "He should have maintained the pin but he realized the queen was overworked. If Qxf3 then 10..., Qxd3",
        "10. gxf3": "My king side is looking very dubious. ",
        "10... e6 11. Qe2": "Serves two purposes: 1 - to protect the pawn at b5 and it clears a square for the development of my knight. ",
        "11... Nf6 12. a3": "Not wanting the pin Bb4",
        "12... b6 13. Nc3 Be7 14. Rd1": "Putting some pressure down the central file. ",
        "14... O-O 15. Ne4 Nxe4 16. fxe4": "I thought long on this move. I wasn't sure if I should have taken with the e pawn as that would have forced a queen move. I also thought it would have exposed my king more. By this time I had no intentions of castling. ",
        "16... a5 17. h4 Bxh4": "This was the blunder that should have lost the game. But as you'll see, I finished this game in spectacularly bad fashion. ",
        "18. Qh5": "!!!",
        "18... g5": "Here's where the mirages start. ",
        "19. Ke2": "Here's where the mirages start. I should have taken the bishop. I think R*h4 (threatening mate) then after gxh4 I go Qg4  and I think mate in one, right? ",
        "19... f5 20. Rdg1": "RXh4 still wins signficant material. ",
        "20... fxe4 21. dxe4": "Amazingly, again, RXh4 still wins. ",
        "21... Rxf2+": "For my first game on GameKnot, I really had a good time. It's always painful to lose won games, but I have to chalk this up as a learning experience. "
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=5597",
    "gameName": "Let's play chess",
    "players": "mr5reasons1 (1200) vs. saltmann (1394)",
    "opening": "Polish (Sokolsky) opening (A00)"
}