{
    "moves": {
        "1. e4 e5 2. Nf3 d6": "Philidor's defence (C41) 3.d4 vanligast med 44 - 28 till vit.",
        "3. d4": "3...exd4 vanligast med 42-29 till vit.",
        "3... Bg4": "7:e vanligaste draget, med hela 62-12 till vit.",
        "4. Be2": "4...dxe5 vanligast med 62-12 till vit. Här spelade jag det enda draget som är till svarts nackdel i world book 0-50 till svart. I gameknots databas ger draget dock 63-31 till vit.",
        "4... Bxf3": "Vanligaste linjen i Philidor's defence (C41) bland amatörer, med 65-26 till vit.",
        "5. Bxf3": "Följer huvudlinjen utan att kunna öppningen 63-33 till vit.",
        "5... Nc6": "Vanligast är 5...exd4 och näst vanligast är 5...Nc6 med 71-23 till vit.",
        "6. c3": "Vanligast är 6.d5 i Philidor's defence (C41) med hela 50-9 till vit, medan 6.c3 är tredje vanligaste med 66-33 till vit.",
        "6... g5": "Svart lämnar gängse teori, där 6...Nc6 är vanligast med 33-66 till svart. Analys ger 7.Qb3 som bästa drag här med +1,90 för den ökade mark det draget vinner; men en rockad ger +1,49 så det blir MVG på draget ändå.",
        "7. O-O": "Här borde svart gå upp med 7...h6 och backa upp g-bonden",
        "7... Bg7": "Rent instinktivt vill jag låsa in svart med 8.d5 och samtidigt pressa undan hans S från centern. +1,46",
        "8. d5": "+1,59",
        "8... Na5": "Nu borde jag verkligen ha utvecklat min D till a4+, eller  min S eller L till ett främre läge. Mitt positionella övertag är dock så stort så vad som helst funkar. +2,71",
        "9. b3": "Med sikte på att konsolidera bondekedjan sedan med c4, men jag glömde min ljusa L i det resonemanget.",
        "9... Qd7": "Svart hänger sin g-bonde, så den plockar vi hem. +2,75",
        "10. Bxg5 h6": "Här hade jag kunnat vara mer offensiv med Bg4 mot svarts D, men jag har inte bråttom.",
        "11. Be3": "Bäst för svart hade varit att gå ut med Nf6, för att sedan få sina pjäser i rörelse.",
        "11... O-O-O": "Nu tvekar jag inte en sekund på att pinna svarts D mot hans K, och sedan är definitivt partit mitt.",
        "12. Bg4": "Självklart !",
        "12... Qxg4": "Hade väntat mig f5, men det här snabbar endast på processen.",
        "13. Qxg4+ Kb8": "Så går vi ner och plockar hem svarts L på g7.",
        "14. Qxg7 Ne7": "Svarts bästa drag, och han räddar åtminstone tornet.",
        "15. Qxf7 Rde8": "Här hade det varit smartast att slå Bxh6 för min del, för att samtidigt täcka f8.",
        "16. Qf3": "Backar hem och lugnar ner tempot lite, men det är som sagt inte nödvändigt. Övertaget påbjuder fortsatta offensiver och ett snabbt avslut.",
        "16... Rhg8 17. g3": "Mer ett impulsförsvar än en reaktion på ett allvarligt hot; för det föreligger inget sådant.",
        "17... c6": "Nu hänger även svarts h-bonde, så jag påbörjar operation upprensning.",
        "18. Bxh6": "+15,11 och svart släpper partit."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=42767",
    "gameName": "Let's play chess",
    "players": "highlandt (1200) vs. stogias (1088)",
    "opening": "Philidor's defence (C41)"
}