{
    "moves": {
        "1. e4": "While I like to play unorthodox openings, my overall style is rather traditional and, frankly, somewhat staid.  I use Gameknot to do research and to improve my play when I transfer into an over-the-board setting. My USCF rating, amazingly, hovers in the 1825 to 1875 range which is considerably more than Gameknot. \r\n\r\nThis game features perhaps the wildest game I've ever played on GK. Going into this match I was 2-0 versus Nick but both wins were quite some time ago. ",
        "1... d5": "The Center Counter Defense...an old friend that I have recently become reaquainted with. ",
        "2. exd5 Qxd5 3. Nc3 Qe6+": "I think this is called the Mieses-Kotrc variation. I've searched everywhere for games of this variation and found none. I figure since this is research, I might as well have an applied project. ",
        "4. Be2 Qg6": "This is the extent of opening theory that I know of this opening. From here I'm on my own. ",
        "5. Nf3 c6": "Rather than take the pawn here, I decided to stop the Knight to c7 fork which loses the rook. ",
        "6. g3": "I was hoping for 0-0 which wins the exchange I think. ",
        "6... Bh3 7. d4 Nf6": "This can't be theory because....",
        "8. Ne5": "Ut-oh, my queen is almost trapped. ",
        "8... Qf5 9. Bc4": "I'm going to lose material now. ",
        "9... Nd5": "Forced",
        "10. Nxd5 cxd5 11. Bxd5 Nd7": "Another forced pawn sac. Again, I made a wrong move somewhere. Knight to c6 loses the rook. ",
        "12. Bxf7+ Kd8 13. Bh5": "My first ray of hope because....",
        "13... Qe4+": "Threatening to win the rook. Now both kings are stuck in the center. YEE HAW!! ",
        "14. Kd2 Nxe5": "Taking the pawn with the queen forces the exchange of queens. I can't do that already down two points, folks. ",
        "15. dxe5 Kc7": "Threatening to win the queen and already pondering forced mating nets with the rook at d8 and queen at d4. ",
        "16. Be2": "He's trying to erect a defense",
        "16... Qxe5": "I have to watch out for the Bf4 pin",
        "17. Ke1 Qe4": "Rethreatening the rook. I was wondering how he was going to get out of this and then....",
        "18. Rg1": "This was the first time I felt like I was almost out of gas",
        "18... Rd8": "I made this move and offered a draw. I didn't see a winning combination and I hoped he would take it. I was ready for this to be over. ",
        "19. Bd2 e5 20. Qc1": "Breaks the pin. Note the point of e5 was to develop AND stop the B to f4 tempo check",
        "20... Bg4": "Reapplying pressure to the pin",
        "21. Be3": "I really wanted to get my bishop on that diagonal before him. I wanted to pressure F2 but now I have to retreat. Again, I don't feel as though I can trade down. ",
        "21... Bh3 22. Bd3": "In two moves he's managed to back off both threatienng pieces. ",
        "22... Qf3 23. Qd1 Qf7": "The threat of pawn to e4 is a bluff since it opens up too good a line to my king, plus he would win too many tempo. ",
        "24. Qd2": "e4 would lead to a Bf4 check....he's threatening Qc3 check as well. ",
        "24... Kb8": "Trying to find anything that looks like safety. Not only am I losing, but he clearly has 3 well developed pieces. ",
        "25. Qa5 b6": "I had a hard time finding this move. All other moves seem to lose. ",
        "26. Bxb6": "I don't think I can take back because the white bishop and queen will be too coordinated for me to survive. Far too many variations for me to work out  even in correspondence. ",
        "26... Rxd3": "With this sac I was already having dreams of figuring out how to fork the Queen and King with a bishop on b4. Also, this move weakens his dark squares which gives my bishop something to do....I think...",
        "27. cxd3 axb6 28. Qxe5+": "This move surprised me. I thought he would take at b6. ",
        "28... Qc7": "I think this is a poor move. Since his queen can't stay in front of the King, all I needed to do was find a way to manuever so that the bishop protected with tempo. Then I would be able to swing my rook into action. ",
        "29. Qxc7+ Kxc7": "Going into an end game down 2 points but up 3 pieces to 2. ",
        "30. Rc1+ Kb7 31. a3 Bg4": "I was worried about moves like g4 and then rook to Rg3 threatening to win the bishop. I really wanted to FINALLY develop my dark square bishop but here we are on move 31 and STILL I have two pieces that haven't moved. That certainly can't be opening theory, can it?",
        "32. Kd2 Bc5": "Trying to pressure F2 while finding an outpost for my bishop",
        "33. Rge1 Rf8": "I felt like I had to develop. Winning the pawn at f2 only opens me to a check at e7 and then his other rook can link up at c7",
        "34. f4 g5": "I think if I can crack this file open I might have some chances, right?",
        "35. b4 Bd4 36. Re7+ Ka6 37. a4 gxf4": "This should have been the fatal error.",
        "38. b5+ Ka5 39. Ra7+ Kb4 40. Rc4+ Kb3 41. gxf4": "I have no idea why he took the pawn and NOT the hanging bishop. Maybe he was afraid of the far passer but in every variation I looked at, he could defend it. Having been given a second life, I don't waste the opportunity. Note: I already see the pawn a4 push for white",
        "41... Bc5 42. a5": "I thought about checking at b4 but the problem is that white could sac back the exchange and then his advanced pawns would be free to roam.  Therefore....",
        "42... Re8": "I'm trying to set up a mating net, I think. 3 pieces all aimed at an unprotected king should be enough, right? ",
        "43. Re4 Rc8": "Obvioulsy I couldn't trade.  But now with this move, I see the potential advantages. ",
        "44. axb6": "This is a blunder because...",
        "44... Bxb6": "There you go....Nick has to waste a tempo getting his rook out the way meanwhile my rook now has access to an open file. ",
        "45. Rae7": "At this point, I didn't see the forced mate in 3. I originally saw the check at c2 forcing the king to the back rank and THEN winning the pawn at A2 and defending the pawn at A7. ",
        "45... Rc2+ 46. Ke1": "I looked at Bishop A5 check but THEN I saw the ending combo...",
        "46... Bf2+ 47. Kf1": "Forced",
        "47... Bh3#": "The End! What a wild ride with Nick. Don't try this at home. "
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=28006",
    "gameName": "Let's play chess",
    "players": "nick-flores (1609) vs. mr5reasons1 (1682)",
    "opening": "Scandinavian defence, Lasker variation (B01)"
}