{
    "moves": {
        "1. e4": "In this game I'm playing black against an opponent whose Elo rating is 200 points higher than myself so I play the move the I'm most familiar with, e5.",
        "1... e5 2. Nf3 Nc6 3. Bc4": "Giucco Piano - also called the Italian game.",
        "3... Bc5": "A common reply. Nf6 is also popular.",
        "4. a4": "?! This move surprised me. I'm not sure what my opponent was trying to do here. Maybe attack my queen-side? I was also not sure how to take advantage of the move....",
        "4... Nf6": "So I kept developing while attacking his pieces.",
        "5. d3 h6": "This might have been a waste of time but I didn't want white to pin my knight with Bg5.",
        "6. c3 Qe7": "Also possible is 6...d5 7. ed ...Nxd5.",
        "7. a5": "Threatening to tear up my queen-side.",
        "7... d5": "?? I didn't realize I couldn't take with my knight. I should've castled, put my rook on d8 and the played d5. Or played a6 first stopping the pawns advance and preventing the bishop or knight going to b5 in the future and then O-O, Rd8 and d5.",
        "8. exd5 Nxd5": "?????",
        "9. O-O": "Luckily for me, white didn't take my knight keeping me in the game.",
        "9... Be6 10. Qb3": "Attacking both the knight at d5 and the pawn on b7",
        "10... Qd6": "Defending the knight a second time.",
        "11. Qxb7": "?? Mistake. And soon you'll see why...",
        "11... Rb8 12. Qa6 Qd7": "Preparing to capture his queen with Ncb4. I'm not sure that 12. Qd7 is the best move because of 13.Bb5. Any suggestions as to what to do instead?",
        "13. d4": "Could white have stopped the attack on the queen with the move 13. Bd2?",
        "13... exd4 14. cxd4": "Does white avoid blacks attack on whites queen with the move 14.Ba2 letting white go to e2 next move with the queen?",
        "14... Ncb4": "Not 14...Ndb4 because of 15. Bxe6",
        "15. Bb5 Rxb5": "15... c6 is met with 16. Bxc6!",
        "16. Qxb5 Qxb5 17. dxc5 Qxc5": "Now I'm up by 4 points",
        "18. b3 Nc2 19. Ra2 Ndb4 20. Ra4": "What about 20. Rb2?",
        "20... Bd7 21. Bd2 Bxa4 22. bxa4 Qxa5": "And now white resigns."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=50970",
    "gameName": "Let's play chess",
    "players": "redrook4 (1700) vs. tinker101 (1509)",
    "opening": "Giuoco Piano (C50)"
}