{
    "moves": {
        "1. e4": "I was not accepting challenges but I had made a challenge against djburns of the English Team and he declined.  When I had made a challenge my German national Zugspitze appeared challenging me with me opening as white.  I tried to gracefully decline but the machine in Gameknot would not allow me to decline.  I figured it was a sort of computer thing and then I though oh well why not play another game when I had told GK I was through playing games with online chess players.  It was a moment I knew I was sealing my fate to play another game despite my limitations to GK saying no more online games but then GK allowed Zugspitze to come into my chess board and there was no way to get rid of him! \n\nI usually open e4 so this is no surprise.  ",
        "1... c6": "Now comes my surprise! Zugspitze (Black from here and after with me White here and after) uses the Caro Kann against ME! I use the Caro Kann most times selecting from two other defenses I trust: Alekhine's, and Sicilian (usually in Sicilian I opt for the Shev or the Dragon).  Imagine my immediate sparkle to Zugspitze (Black) to use my favorite defense against my e4 open!  I had to check this out! And play! ",
        "2. d4": "The first time I ever encountered the Caro was when I was playing against a blind seminarian (we were both seminarians having a hobby outside of Greek and Hebrew and Theology and Philosophy and Exegesis and Church History and Homiletics and Reformed Theology and Psychology and Sacred History and Secular History and all we had to do to get ordination.  We just got together and played chess and relaxed in Graduate School instead of going out to party.  We liked being unavailable to distractions sort of like monks in a monastery and we liked chess! This is the move I made in 1983 the first time I saw c6 to my open e4.  It was a reaction to take over the center of the board as fast as possible and it seemed the best move to make.  It turned out I had made the standard response to Caro Kann.  ",
        "2... d5": "My blind friend in seminary did the same move which is standard for the Caro Kann.  At this point I can't recall what I did in 1983 with the Blind Seminarian but soon after I had played with him I studied the Caro Kann.  I liked Sicilian and Alekhine's. I had decided for my brains to give up the Ruy Lopez since my father beat it every time with the King's Gambit.  I learned the King's Gambit from him and my records here on GK show I use it ALL the time against the insignificant Ruy Lopez. I had also studied the French Defense enough to see it was mostly a blockade like in Les Miserables by Victor Hugo when his book was written about something entirely different from chess.  I had read Rommel's book on being a Platoon Leader in WWI against the French and the French like blockades and retreating instead of fighting.  The French Foreign Legion is a gathering of exceptional troops and these troops of the French Foreign Legion are not included. However, in chess the French Defense is as it was in WWI against Rommel defeated and running behind barricades. ",
        "3. e5": "This is called the closing action from white instead of the engaging act from white to trade pieces.  White can do other moves to engage in conflict but in this case white is dealing with the Caro Kahn and white has many published responses to d5.  I confess my response here is what I would have to think the most about if I was Caro Kann (Black).  What is happening is I am responding to Black in the fashion I know I would have to WORK HARD as Black to get this opening just right! ",
        "3... Bf5": "I know when I play Caro it is absolutely essential to run out the q bishop right there! ",
        "4. Bd3": "This is really the only thing white can do of worth and I figure black has his next move ready to go which is really very predictable in all annuls of Caro Kann.  ",
        "4... Bxd3": "Usual. ",
        "5. Qxd3": "Usual in all history of what is going on when Black is using Caro Kann.....",
        "5... Qa5+": "This is a deviation from what I would do if I am black using Caro. It is not what I would do.  I would have done e3 to make an Infantry formation blocking and opening the King Bishop.  \n\nThe problem when somebody does something unexpected is amateurs do unexpected things and win from sheer chance or luck or the stupefying effect it has upon a person thinking all is fine until something jumps out like a cougar to attack from nowhere.  I had to think a bit about this move and even if it is in the book written as a standard I still felt it was premature.  So.....",
        "6. Nc3": "...can't choose the pawn over the knight to block because the pawn would block the development of the knight! ",
        "6... Qa6": "What can my queen do at this point? If I try to set her aside it leaves black to advance at my cost.  It is time to execute that early developed queen...",
        "7. Qxa6": "...thusly.",
        "7... Nxa6": "Expected. Now to trap the black night into a useless field of fire...",
        "8. a3": "Thusly. Now the board will be on the right side for action from white:\n",
        "8... e6": "And black does the infantry formation finally as I thought he should have done before sacrificing our queens.  ",
        "9. Nf3": "Just reinforcement and development for the obvious reason. ",
        "9... Ne7": "Whatever.  I think a better move is available instead of Knight to e7. I think I would rather it have been Bishop to e7 or 0-0-0 or a few other pawn movements to advance the infantry before taking two moves to get a knight out of the king side.  I am not a genius but maybe Zugspitze is about the Caro.  The Caro is always able to respond with clarity for the next moves.  I think some moves done by black are not in synch with Caro but I cannot really figure it out for now because I never used these moves in the sequences black is doing now.  It is going to be a learning lesson for me at this point.  ",
        "10. O-O": "I basically have to get my rooks doubled and 0-0 is the fast way to do it.  It also means I have to commit to the right side of the board with my King....",
        "10... h5": "This game is ongoing and is actually 13 moves ahead of all this.  I am annotating it now and making it public since GK let someone challenge me when I said I would decline all challenges.  Whatever anyone says about this game until the 10th move is so far behind the actual game.  I don't think Zugspitze or I would really care what is publically stated about what to do after what move.  When a game is played it is between the two and when this game finishes I will deliver the final annotation along with my worthy opponent, Zugspitze.  So hold your horses on this game until we end it and remember we are 13 moves ahead.  Remember you cannot counsel either one of us while this game progresses.  You may look at it but it is cheating if either one of us is helped along the way.  This is Gameknot policy for online chess.  ",
        "11. Ne2": "This is a mobile knight and it is time to move him to greater arenas or greener grass...",
        "11... Nf5": "Where else is this knight from black able to go to develop to do any kind of good?",
        "12. Ng3": "It is going to be trading time.....",
        "12... Nxg3": "...as I said.",
        "13. fxg3": "I had thought about using the h pawn instead of the f pawn but I felt better opening up my rook on f1.  ",
        "13... Be7": "This bishop from black has to get out of the way at all cost from the rear where he sat until now...",
        "14. Bg5": "F6 is the place I want to make a statement because I can and I will and I do it.  ",
        "14... f6": "Here I see the opening up on the entire king side of both of us and I am thinking instead of pushing on this side why not make my bishop available to BOTH sides at once...so ",
        "15. Bd2": "..I do it. Why not?",
        "15... c5": "I saw this when I decided to move my bishop to d2 and now I think the best move is what I do next....",
        "16. Bc3": "I want my bishop available on Both sides! I can't use a pawn to constrain him behind a pawn line! ",
        "16... f5": "Black wants to move forward...",
        "17. h3": "So do I.  ",
        "17... g5": "3 pawns on the line...I did not want to put h3 pawn on h4 in my last move. There is the obvious reason for this.  And now is the reason.",
        "18. Kf2": "The king is a fighting piece and it is time for my king to get into action.  Many chess players ignore the power of the king in a battle field. I never ignore my king in a battle.  The king is a powerful piece even though he is the prize of the opposition.  I use the King's Gambit regularly against the slow Ruy Lopez and the Gambit opens up the King to attack. The King can take care of his battlefield in the event of the King's Gambit against the dull and slow Ruy Lopez.  I never use the Ruy Lopez.  Check my records and know why I never do.  ",
        "18... g4": "I expected this.  I just move my knight. ",
        "19. Ne1": "I move my knight to the rear which is better than either h4 or d2.  H4 would stack pawns on the side and d2 would blocks my c3 bishop to d2. ",
        "19... gxh3": "Time for me to take a pawn for the obvious reason.  ",
        "20. gxh3": "Thusly.  ",
        "20... h4": "A premature maneuver for passing a pawn all alone...I have double rooks and a knight able to take care of a passed pawn and I decide against most ideas about a \"passed pawn\" to monitor and fix and kill that stray pawn.  ",
        "21. Nf3": "This is a way to re rook the rooks together and attack the stray pawn from black.  Blacks pawn has very little chance of promotion.  Black's pawn has all the faith to have his head taken off while I move forward.  It is an English thing to do in a gentlemanly fashion utilizing the French Guillotine.  ",
        "21... Kd7": "I didn't feel any move Black would make would hurt me so what ever move he made I had seen (always anticipate your opponent's next move) already. So it's the King....",
        "22. g4": "I have to open up our king sides in order to advance and eventually chop off the black advancing pawn's head.  Do I use the English axe used on Sir Thomas Moore or do I just do a nasty guillotine from French history? It is up to Black to decide the fate of this lone pawn....",
        "22... fxg4": "Reasonable move and expected.  ",
        "23. hxg4": "Reasonable clearing to execute the lone pawn by guillotine or hatchet used to execute Sir Thomas Moore in England some centuries ago....",
        "23... Rag8": "Expected. I think at this point the rook on h8 is incredibly denied action except to advance the lone pawn into a beheading.  ",
        "24. Rfg1": "I have to protect my own pawn on g4 to allow me to execute the lone pawn.  ",
        "24... cxd4": "My opponent is moving to my left side for action.  I had put my bishop there ahead of time anticipating both side action for my bishop.  ",
        "25. Bxd4": "I can also protect my king from attack (and rook in the pin) by using my bishop! See now why I wanted my bishop free for left and right?",
        "25... Nc5": "Here is an opportunity to attack the knight and make him check my king into the center of the board.  I like it! ",
        "26. b4": "I advance a pawn to my opponent's knight and unless he wants to retreat he will check my king into a better position....",
        "26... Ne4+": "...and there it is! ",
        "27. Ke3": "My king is checked into a better position.  In puzzles we find a checked king moving forward eventually advances with his troops to fix and kill the opposition.  The king is a powerful piece not to be hidden away in a paradise surrounded by soldiers.  He is a fighter and he can do more damage than most chess players think...",
        "27... Ng3": "This is a move to get the headless black pawn to promotion...in the meantime I can take out a pawn without missing a move and so I do. ",
        "28. Bxa7": "And so I do it.  ",
        "28... Rxg4": "Black has to be very aggressive.  With rooks and the knight and the lone pawn.  I don't see the picture black has painted for king side advance.  I am thinking I might be wrong but then I have to see if black can prove me wrong.  I aim to behead that lone pawn and advance at the same time on the left or right. ",
        "29. Kd3": "I am moving my king into battle position here.  The king is a battle piece to be respected. ",
        "29... Rf8": "I have to go back to the right side to behead the lone pawn...",
        "30. Nh2": "I have the material and position to behead the advancing pawn while black tries to advance him to promotion (Beheading). ",
        "30... Re4": "Predicted. I saw this as black's best move with his g4 rook.  ",
        "31. Be3": "Time for my bilateral bishop to keep watch on BOTH sides!",
        "31... Rxe5": "Black is maneuvering his e4 rook (slow to maneuver as rooks are) to a better position to operate with his other rook. I see this! In the Army field of artillery (rooks in chess) have to have time to operate in sync with the advancing opposition. I am THRILLED! ",
        "32. Rae1": "I know how FA (LIGHT) in Field Artillery work.  I spent my life in the Army with FA (LIGHT) and IN (LIGHT) and Armor (Heavy). \nJoin the US Army to be an Army of ONE! ",
        "32... Re4": "Black is trying to figure out a better position for his own FA (Field Artillery) and so far it seems to me he is doing the best with what he has.  Problem is I am doing the best as well.  In the fog of war things can change the outcome. ",
        "33. c3": "One little move here.  It is like the Caro Kann against e4 open. One simple pawn moving one square forward.  Remember the Caro Kann is an infantry formation and defense and attack.  ",
        "33... b5": "Seemingly closing up the left side advance at least for now...",
        "34. Bb6": "Time to unleash my Field Artillery by disclosing my bishop...",
        "34... Rxe1": "Trading. ",
        "35. Rxe1": "Trading. ",
        "35... Rf4": "? is this move...to me...why not bring back the bishop...",
        "36. Be3": "..to THIS side.",
        "36... Re4": "Black had to move his rook and where he'd move it was anticipated by me.  I respond to the best place in the center forward point with my side knight. ",
        "37. Nf3": "To f3!",
        "37... Bf6": "When you are minus one you have to be on your toes to make sure there are no more minuses.  In many attacks going minus one is best to gain position (King's Gambit) to defeat the opposition in timely manner. This move by black is just a time wasting move leading to who knows where....",
        "38. Rg1": "I think the h pawn over the line is not a problem so I fix his movement in the board. Black loses the knight if that pawn is advanced on the h side and there is nothing threatening me to make a better move.  ",
        "38... Nf5": "Of course g7 is a square I'd like to deploy my rook from the rear and black is double protecting that square! ",
        "39. Bd2": "Black's maneuver to double protect the g7 square also involves an attack upon my bishop.  I could have moved f2 but my king is the only one protecting c3.  I do with my bishop what a bishop always does for the king.  Be his messenger and be ready to support him.  The king wants to protect the c3 pawn for the obvious reason and the bishop, without asking why, comes to the king to do what he is skilled to do along diagonal lines.  ",
        "39... e5": "Whenever you see a line formation in the field of battle positioned forward and laterally against you you really have to start worrying about a Pickett's Charge in Gettysburg. Pickett was a Confederate General (Major General) who made an assault with a column three quarters of a mile wide against the Union troops of General (Major General) Meade in Cemetery Ridge in 1863. I don't have my infantry to attack at this point.  Neither does black so it is going to be a lock up in INFANTRY while the remaining PIECES take over.   ",
        "40. Rg6": "I move my FIELD ARTILLERY forward where FIELD ARTILLERY (LIGHT) is FORWARD instead of acting like Field Artillery (HEAVY) that just stays in the rear to send shells bigger than 105 Howitzers.  Heavy FA can't move on a chess board.  Rooks are ALWAYS LIGHT FIELD ARTILLERY.  Chess was invented and played WITHOUT HEAVY FIELD ARTILLERY!\n\n",
        "40... Ke7": "Black knows by this time if not before the king is a fighting piece.  I've always said this in my annotated games.  ",
        "41. Kc2": "I had to get my king out. He would be trapped without me moving him out.  He is the key prize after all and when he cannot fight right he needs to get out.  ",
        "41... Rc4": "Good black move forcing me to get my king out...",
        "42. Kb2": "Oh well.  I am going to be cordoned off into a more limited arena to operate.  Keep in mind my opponent used the Caro Kann against me and the Caro Kann should be the most feared against e4 open.  Not Sicilian necessarily.  Those who use Caro Kann go a lot further than Sicilian. Forget the weak Ruy Lopez.  I respected my opponent after his first move against my e4.  He responded c6! Caro Kann!",
        "42... Kf7": "I am constrained in a cordon....",
        "43. Rg2": "I have to retreat FA to a better position....",
        "43... e4": "...and the cordon continues to trap me into smaller space....",
        "44. Ng5+": "I get to check him but at this time I am thinking I need some serious reposition with this night....",
        "44... Bxg5": "...that is taken.  ",
        "45. Bxg5": "I am not feeling good about this trade.  I have to trade now because I am minus a piece I wanted in the event it was passed up for a trade.",
        "45... Rc8": "I can't use my bishop here.  I have to go to a place where he is still useful...",
        "46. Bf4": "..where there are open spaces along diagonals to work. ",
        "46... Rh8": "But of course a rook behind a passed pawn is a real problem....",
        "47. Kc2": "I have hope that the rook and bishop can handle that side pawn trying to get to the promotion front....",
        "47... h3": "No problem.",
        "48. Rg1": "Rooks can block and attack a lone pawn especially on the side when a bishop is working to help.  ",
        "48... Nh4": "I am going to move my bishop to clear the way to check the king.  ",
        "49. Be5": "While doing so I attack the rook! ",
        "49... Nf3": "I can't take the rook with my bishop.  Then the pawn gets promoted.  I have to do something else.  Move my rook to block the advancing side pawn to promotion while keeping the rook under attack behind it....",
        "50. Rf1": "Best way to do it while pinning the knight in front of the king...",
        "50... Rg8": "I am thinking concentrate forces to deal with all at once in a confined area and let God sort it out....",
        "51. Bf4": "Closing in my bishop....",
        "51... h2": "Now I get to behead the pawn as I said I would awhile ago! ",
        "52. Bxh2": "Like so! I predict black does rook to g2.  I have already put in the GK machine my auto response for this.....\nAlways anticipate the next most dangerous move.....",
        "52... Rg2+": "It was the most dangerous move and I had to do it.  I had no choice and now my hope is to deal with the loss of a piece while drawing the board if I can....",
        "53. Kd1": "I looked into what I'd do at this point if I was black and realized white lost to the Caro Kann.  ",
        "53... Rxh2": "I knew it was over but then made another move because I wasn't ready to resign.  I did it because once in a great while a game is won by a mistake by the opponent.  ",
        "54. Kc1": "Unless black is absolutely non compis mentis he'd lose.  I realized I have to respect my opponent.  I resigned.  \nLong live the Caro Kann my favorite Black Defense against e4 open! I applaud Zugspitze for using it against me.  He is way ahead of the players who resort to Ruy Lopez and French Defense.  I'd like to have him on MY team!  \nJohn "
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=52649",
    "gameName": "Let's play chess",
    "players": "9422m (1981) vs. zugspitze (1950)",
    "opening": "Caro-Kann (B12), advance, Short variation"
}