{
    "moves": {
        "1. f4 d5": "White camp is attacking on the King side. I answer by 1. ... d5, right in the center, because that is what is important in early game. ",
        "2. h3": "2. h3? Playing Nf3 is better. h3 is totally a bet, because I can play Bg4 or Ng4, but not before a long time. More important, it loses time, and Black camp can attack by 2. c5! which controls the center. In this game, that's the plan.",
        "2... c5 3. Nf3 Nc6 4. a3": "4. a3? Same as 2. h3. It is a bet, and, my knight has nothing to do there. Its place is more in the center. ",
        "4... g6 5. g4 Bg7 6. a4": "6. a4 ? White are making a lot of mistakes. After 5. g5?! I thought that the would push against my castle and control f6, which would have forced my knight to go to e7, which is not really a good place.",
        "6... Nf6 7. d3 O-O 8. e3": "8. g5! to continue the plan. Control the center is not the plan for White here. And their bishops don't play. Black definitely have the initiative.",
        "8... Re8": "e3 is weak, and I need to open the game by e5, after playing 9. ... Qc7",
        "9. c3 Qc7 10. Bg2 e5 11. b3": "White have a great pawn structure here. But in fact, that does not serve their game: it definitely breaks their Knights and Bishops. 11. ... exf4 is very dangerous too.",
        "11... exf4 12. Qe2 fxe3": "12. ... Rxe3 is not possible (even very tempting) because of the Bishop in c1.",
        "13. Bxe3 Qg3+": "Black want to gain something. As all the White pieces are on the King, it is time to attack.",
        "14. Kd1 d4 15. Qf2 Qxf2 16. Bxf2": "With the opening of the center, I prefer the exchange of the queens. Next step, continue to exchange and maybe win some material. ",
        "16... Nd5 17. Nfd2 Nxc3+ 18. Kc2 Nxb1 19. Raxb1 Be6 20. g5 Bf5 21. Bxc6 bxc6 22. Bg3 Re3 23. Bf4 Rxd3": "With a very dangerous rook in d3, the b column wide open, I concentrate my forces on the queen size where the white king hides. ",
        "24. Kd1 f6 25. Kc1 fxg5 26. Bxg5 Be6 27. h4 Rb8 28. Kc2": "Looking to obtain the b pawn. 28. Kc2 remebered me that it is not a pawn, it is the king that I want. ",
        "28... Rc3+ 29. Kb2 d3": "29. ... d3 prepares Rc2. Bxb3 is interesting too, but the Bishops pair is too precious. ",
        "30. Ka3": "Even better! I need just to play c4, and then, the white position is crushing itself. ",
        "30... c4 31. Ka2 cxb3+": "There is only one square where the king is safe. I did not found a checkmate for this continuation, but the advantage of the Black camp is too strong to do something great. \n\nAfter 31. Kb2, we have:\n31. Kb2 Rc2+\n32. Ka3 Bf8+\n33. Be7 Bxe7#\n\nIf they play 32. Ka1, 32. ... b2+ may give you everything white camp has.\n",
        "32. Ka3 b2+ 33. Nb3 Rbxb3+ 34. Ka2 Rb4#": "Thanks for reading this annotation (sorry for the bad English, I'm french and it's late :)) and see you later for another analysis."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=51660",
    "gameName": "Let's play chess",
    "players": "toplady (1073) vs. tybalt39 (1200)",
    "opening": "Bird's opening (A03)"
}