{
    "moves": {
        "1. e4 c5 2. e5 Nc6 3. Nf3 Qc7 4. Qe2 d6 5. exd6": "probably not the best move by me there",
        "5... Qxd6 6. b3 e5 7. Bb2 Bg4": "good move, but he doesn't anticipate me swapping queens",
        "8. Bxe5 Nxe5 9. Qxe5+ Qxe5+ 10. Nxe5": "that renders the bishop move useless, gains me an extra pawn and now i'm attacking the bishop",
        "10... Bf5 11. Bb5+": "that all left his king wide open",
        "11... Ke7 12. Nc3 Nf6 13. O-O-O": "preparing to move rook in line with black king",
        "13... Ng4": "looking for the fork or trying to remove my knight from the attacking position",
        "14. Rde1 Nxe5 15. Rxe5+ Kf6": "seems like a strange move not to move back ",
        "16. Rhe1 Bd6 17. Nd5+": "i don't want to play defensive by simply moving my rook out of danger",
        "17... Kg5 18. h4+": "if i continue to attack his king he will have to leave the bishop free to take",
        "18... Kg6 19. h5+ Kg5 20. f4+ Kxh5 21. Rxf5+": "now i have an extra knight on him with my two rooks in a very attacking position. his rooks are yet to move, his king is now extremely vulnerable and he has no way of bringing my king into check quickly",
        "21... Kh4 22. Rh1+": "now begins the attack on the king, i'm hoping to be able to catch him check mate without swapping anymore pieces",
        "22... Kg3 23. Rh3+": "i thought i had him now but i neglected to see he can simply take my pawn",
        "23... Kxg2 24. Rd3": "opening up an attack on his bishop",
        "24... a6 25. Ne3+": "would've been good to go a bit further but black doesn't really have much of a chance now. please leave some comments and tell me what you think. and check out my other annotated game with otherj, which is probably a bit more interesting than this game. cheers.\nAlex"
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=12573",
    "gameName": "Let's play chess",
    "players": "alexjones85 (1382) vs. omejas (1555)",
    "opening": "Sicilian defence (B20)"
}