{
    "moves": {
        "1. e4": "I kind of lost my way confronted to a modern defence to the King pawn opening",
        "1... c6": "Intriguing move from Black. Preparing for d7-d5? Is a better response a pawn centre or e4-e5? Or even better would be Nf3 to prepare for a pawn centre? ",
        "2. d4": "I choose the pawn centre. Probably not the best move in hindsight. Nf3 better?",
        "2... d5": "Black responds by attacking my e pawn. White must decide whether to capture, defend or ignore. Even at this stage, I start not liking how the game is developing. Look at my pieces all still hemmed in the starting squares...",
        "3. Nc3": "I decide to defend. The main motivation being development. I normally do not like castling queen side due to the large field that is difficult to defend that emerges on the bottom left of the board. But I had to begin factoring a queen side castle in my strategy",
        "3... dxe4": "Black is really not making it easy. I have to move my knight twice now during the opening.",
        "4. Nxe4": "re-capture. Was a better move 4.Be3 in order to keep developing and winning the pawn back later?",
        "4... Bf5": "Black attacks again my knight. He is having a very strong opening as he is developing by attacking my piece which had to move again (3rd time in first 5 move). Should I have played 5.Qf3 and put the question back to Black? Or 5.Bd3 to keep developing and defending at the same time? I did not choose 5.Qf3 because I did not want to get my queen out too early and 5.Bd3 as I did not want to have to destroy my pawn structure later if I had to castle queen side. ",
        "5. Ng3": "I therefore flee and attack the bishop at the same time",
        "5... Bg6": "Mission half accomplished, Black had to retreat but still maintains pressure on my position (c2 pawn). But at least I had a chance to get the initiative back",
        "6. Be3": "Start developing queen side to 1) fight for the centre and 2) prepare my for a queen side castle. Was that the right strategy? In hindsight, I took me the same moves to castle king side, which is more comfortable in the middle game. Any thoughts?",
        "6... e6": "Black liberates his f bishop. By now, it is clear to me that Black will not fight for the centre pawn for pawn. What should my strategy have been at that case?",
        "7. Nf3": "May be I still had time to castle king side?",
        "7... Nf6": "Black also developing. He controlled now the e4 square (attacking it twice).",
        "8. h4": "I decide to go for the bishop. I did not want the game to get too comfortable for my opponent. Black had either to play 8..h6 or accept doubled up pawns. The game was starting to go better for me",
        "8... h6": "The best move for Black. Was there a better move for him?",
        "9. Bd3": "Still threatening the doubled up pawns",
        "9... Bxd3": "Which Black declines but initiating the exchange",
        "10. Qxd3": "I re-capture. Even though I did not like having 4 of my pieces on the same rank, it was just temporary and I did not see any medium term threat that Black could initiate. Was I wrong?",
        "10... Nbd7": "I am not sure what was going on in Black's head, but I would have been happy if I was him",
        "11. O-O-O": "I castle queen side (my king side was compromise by 8.h4). My a2 pawn is now pretty lonely out there",
        "11... Nd5": "Black is on the attack. Does he want my bishop for his knight or trying to fork my queen and a2 pawn? I think the latter. Excellent move from Black.",
        "12. a3": "Happy to exchange, as the alternative could have been worse. Say if I had played 12. anything else Nb4 (forking my queen and a2 pawn) 13.Qb3 where my queen would be playing nurse to a lowly pawn. But perhaps in hindsight, I should have played 12.Bd2 Nb4 13. Bxb4 Bxb4 14.Qb3, forking black's bishop and b7 pawn (even though having a semi-open file above my queen side is not too tempting...). Any thoughts?",
        "12... Bd6": "Black threatens to double up my g pawns and at the same time would be free to castle king side in the next move. I was happy to Black to castle king side because I could slowly but surely strangle his king side my my pawn army but I do not like doubled up pawns..",
        "13. Ne4": "I go on the attack. Black had to move the bishop or defend it as the 14.Nxd6+ came with a check",
        "13... Bc7": "Black makes the right decision. Preparing to redeploy on my queen side?",
        "14. Nc3": "Inviting the exchange. Black's knight was getting too bothersome in the middle of the board with the support of 2 pawns",
        "14... Nxe3": "Best move for Black?",
        "15. fxe3": "Capturing towards the centre",
        "15... Nf6": "Black trying his hand at either putting his knight again in the middle of the board with 16...Nd5 or the hole on g4 with 16...Ng4",
        "16. Rd2": "Preparing a battery of rooks and queens",
        "16... Nd5": "Here he goes again",
        "17. Nxd5": "I did not like his knight hanging in the middle of the board. Black had now a Bishop for my knight and a definite edge",
        "17... cxd5": "re-capture. I think this was the best move for Black. Any thoughts?",
        "18. Qb5+": "A fork the Black's king and b7, just trying to get an edge in the game with a pawn up",
        "18... Qd7": "The best move for Black",
        "19. Qxb7": "I grab a pawn",
        "19... O-O": "Black castles king side. The game was going better now...",
        "20. g4": "I can take my pawns up the board to open up Black's king side. Now I was having fun",
        "20... Rfb8": "Black attacks my queen which had to move and thereby creating a semi-open file to my king's position. I knew that came with 19.Qxb7, so I have happy to move",
        "21. Qa6": "Put my Queen out of danger",
        "21... Rb6": "Black gains a tempo by attacking my queen and prepares to double up rooks. Excellent move",
        "22. Qd3": "My queen had to retreat and prepare to defend",
        "22... Rab8": "The battery comes as expected",
        "23. c3": "I defend",
        "23... Qa4": "Black getting ready to put his queen first(?) with 24...Qb3?",
        "24. Rhh2": "Very questionable move. I overlooked Black's bishop on h7",
        "24... Bxh2": "Black did not overlook my rook. Not good. Pissed off with myself",
        "25. Rxh2": "re-capture. I now had a lone rook against Black battery and slow knight to fight off a huge attack. Propects looked grim",
        "25... Qb3": "Queen goes into the hole. Nothing to fear from this as I would be up the exchange",
        "26. h5": "I resume my trying to open up Black's king's position",
        "26... Qa2": "Excellent move getting his queen out of the way to make the most of this battery of rooks",
        "27. Qb1": "I offer to exchange queens",
        "27... Qc4": "Black declines the exchange",
        "28. Ne5": "I attack the Queen with my eye firmly on the forking potential on d7",
        "28... Qf1+": "Black is now happy to exchange queens",
        "29. Kc2": "I move my king out. Black had to exchange queens",
        "29... Qxb1+": "capture. Was there a better move for Black? I did not think so...Any ideas?",
        "30. Kxb1": "recapture. My forking potential on b7 did not go away. Would Black overlook it and give me a way back into the game?",
        "30... Rb8b7": "Nope. Black is awake and well",
        "31. Ka2": "I had to take my king to engage in battle like any other pieces. I had not a lot to loose",
        "31... Kf8": "Black had the same idea (using his king in battle)?",
        "32. b4": "Neutralising the battery to give Black an incentive to vacate the 7th rank",
        "32... Ke7": "Black (consistently I must admit) continue to march his king to the middle of the board",
        "33. Rf2": "I had a chance to gain the f7 pawn ",
        "33... Rc7": "Black attacks my c3 pawn. Was the better move to defend the pawn on c3 or attack f7?",
        "34. Rxf7+": "I choose to attack f7. Attacking is always a lot more fun than defending but now I was committed to exchanging rooks and would be left with a clunky knight for the end game. Was this my best move?",
        "34... Kd8": "Black defends his rook",
        "35. Rxc7": "I initiate exchange, otherwise my c3 pawn was gone and I quite liked the pawn chain I had from a to e. Was this my best move?",
        "35... Kxc7": "re-capture",
        "36. a4": "Marching my army up",
        "36... a5": "Black wants to open up the b file",
        "37. b5": "Which I refuse, still trying to maintain the chain",
        "37... Rb8": "Black prepares to go to the open f file. I cannot prevent 38.Rf8, not good",
        "38. c4": "I offer to exchange pawns which would allow me 39.Nxc4 and 40.Nxa5 and a good chance to chase Black's king away and queening of my pawns",
        "38... Rf8": "Black does not cooperate to my crafty plan and is hung up on intruding past my pawns, the game is all but lost. What to do? Any ideas?",
        "39. c5": "I push my c pawn up. This move has a lot of drawback, chief of which is that now my king was trapped on this side of the board but I had to try and queen",
        "39... Rf2+": "Black's aims the axe",
        "40. Kb3": "I dodge the axe",
        "40... Re2": "My pawn is gone",
        "41. e4": "Inviting a check that would allow my king to get closer to the action",
        "41... Rxe4": "Black does not cooperate",
        "42. Kc3": "I try to get closer to the action anyway",
        "42... Re3+": "Now comes the check",
        "43. Kd2": "I attack. In hindsight, I would have played 43.Kb2, so not to be far from a4 and make life hard for back when trying to pick either a4 or d4. Any thoughts?",
        "43... Ra3": "Black is very determined",
        "44. b6+": "Patsy sees a check",
        "44... Kb7": "Good parade",
        "45. Nf7": "aiming for a fork with check of the e pawn. I did not want to go down willingly",
        "45... Rxa4": "Black takes the pawn, his a pawn was now unstoppable to the coronation. Should I resign?",
        "46. Nd8+": "But not before giving check and getting a pawn. Still hoping for a blunder that would allow me back into the game",
        "46... Kb8": "Black parries",
        "47. Nxe6": "Was a better move c5-c6, where I would look to deliver another check to try and create a queen fast? I must admit that I could not see any other check possible within 2 moves that would allow me to surprise Black. Any thoughts?",
        "47... Rc4": "Black gets the memo addresses the c5-c6 threat and at the same time 1) liberates his a pawn to march lustfully to a1 for coronation and 2) keep my king out of the party",
        "48. Kd3": "Useless move. Much better was Nxg7",
        "48... a4": "Hallelujah",
        "49. Nxg7": "I take a pawn. A consolation knowing I got a point",
        "49... a3": "Hallelujah",
        "50. c6": "Should I resign?",
        "50... Rxc6": "Nothing I would do to stop it. Les des sont jetes!",
        "51. Nf5": "Get me a pawn",
        "51... a2": "Hallelujah. I resign. I blundered by offering my rook for a bishop but otherwise I think I put up a decent game. Any thoughts, suggestions, advice, general comment on my (or Black's) play would be welcome"
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=24430",
    "gameName": "Let's play chess",
    "players": "arnihilator (1543) vs. vccoach13 (1544)",
    "opening": "Caro-Kann (B18), classical, Flohr variation"
}