{
    "moves": {
        "1. e4": "Alright. Same opening, different variation.",
        "1... e6": "Ok already black is going to fall into trouble fast as he is giving me the centre of the board. I have lots of options here but which one is best? Well his pawn push stops any attempt for the 4 move checkmate. I am sure everyone is familiar with it, but just in case I will include it below.\r\n1. e4\r\n2. Bc4\r\n3. Qf3\r\n4. Qxf7# \r\nThese are whites moves only and of course it depends entirely on blacks responses to these moves. \r\nNote: King's gambit also chases the same square but after white castles King-side the Rook would also be baring down on f7.",
        "2. d4": "Might as well take the centre seeing as how he is giving it to me.",
        "2... c6": "Right. Black has opened his Queen up for both directions but the real threat is d5 to try and gain control of the centre.",
        "3. Nc3": "Develop.",
        "3... Bb4": "I'm glad he did this, remember Rule #5? Bishop stronger than Knights in the endgame. Now Black probably really doesn't want to take my knight here. I wouldn't. This is a tactic to get me to push him away with my Queen-side pawns(4. a3  Ba5  5. b4 Bb6), which would force me to castle King-side, having destroyed my Queen-side pawn structure,  and giving his bishop an attack on f2. That is what I would do anyway. If he does take it he is breaking Rule #5 anyway so that will ultimately be to my advantage.",
        "4. Bd2": "Now if he takes my Knight here I can keep my pawn structure and my bishop will be in a position to attack Black on his King-side which at this stage is probably going to be the side he wants to castle on.",
        "4... d5": "Ok, the pawn push. Now he is trying to control the centre. I can't take here as he has 2 pawns and his Queen on it, so I will just push on.",
        "5. e5": "Now I have the ability to develop Nf3 and then possibly later on chase his queen with my bishop, but not yet. Also because my pawn is now on e5 It has become somewhat of a priority for me. His Knight can only develop to two squares, Nh6 which is very bad (Rule #3), or Ne7 which isn't much better. Ne7 means e will probably push the f7 pawn 1 or 2 squares on the next turn, or castle. His alternative is to push the pawn 1 or 2 squares now. of course 2 squares and I En passen his ass.",
        "5... h6": "Well he is trying to preempt my bishop move, but this is really a no meaning move. I have two pieces to his one developed so he really should be developing. If I had already brought my Nf3 then I would expect him to play it in response.",
        "6. Nf3": "I'm going to do it anyway. 3-1 in development.",
        "6... a6": "This was another no meaning move. What black is trying to do here is give his bishop a place to retreat to (Ba7) If/when I decide to chase him. Nothing to do with my f1 Bishop as I already cannot move beyond d3. Black is assuming that I am planning on castling King-side. Note: I prefer my opponent to castle first so that I can plan his demise.",
        "7. Bd3": "4-1 in the development stage. Ready to castle king-side (only if I have to). Black is so far behind in development now, it's gonna take a miracle for him to beat me at this stage.",
        "7... c5": "Mmmm. Let's see. If I take the pawn @c5, black gets what he wants in two moves instead of three\r\n8. d4xc5   Bxc5 then he can retreat to a7 and give my f2 pawn pressure (no real meaning at the moment as he has nothing to back it up with).\r\nBut seeing as how I am vindictive I will make him work for it with....",
        "8. a3": "Mmmm Take my knight or back off.",
        "8... Ba5": "A fine choice but I can now claim my free piece.",
        "9. dxc5": "Yummy!",
        "9... d4": "Now this is mistake by black. Better to do Nc6, I feel, get some development happening.",
        "10. Ne4": "Now black is getting into trouble. The big threat from white is Nd6 . If he does Bxd2  I take with my Queen and then I can castle either side.",
        "10... Nc6": "Don't know why he develops the Knight now as I can't take his Bishop with mine, he has his Queen on it which would put me in check, I would take with my Queen, Queen-swap and I would have to take with my Knight which would be detrimental to my development. Best to push his Bishop away...",
        "11. b4 Bc7": "Ah I see. A double attack on my e5 pawn. He was thinking ahead, but he wasn't looking from both sides of the board",
        "12. Nd6+": "Time to disrupt. Black has two options, move the King or do a swap. Either result is good for White. If he swaps Knight for Bishop, good for me (rule #5) and I will have a passed pawn ( rule #9) and still be a point ahead.",
        "12... Kd7": "Not what I would have done. I was looking to pick up his Bishop on c8 but he is throwing away his Rook on h8.....I just can't resist the temptation.",
        "13. Nxf7 Qe7": "Better move for black would have been Qe8 effectively trapping my Knight after my next move. Instead he is allowing me to bring it back into play and attack his Queen.",
        "14. Nxh8": "Yummy!  7 with 4-3 development and a disrupted King. I can taste the victory already",
        "14... Bxe5": "Maybe he wants to move his King into the corner here, or maybe he wants to push g7 one or two squares to expose my Knight. Either way I'm not gonna stick around to find out especially when he keeps giving me forks to jump on",
        "15. Ng6": "Yummy!",
        "15... Qe8": "From here better to develop the other Knight, bringing it into play and opening up my Queen.",
        "16. Nfxe5+": " Danger, Will Robins, Danger!",
        "16... Nxe5 17. Nxe5+": "As you can see he broke rule #7 \"when behind in material don't swap off\".  9, 3-0 Development and he is in check.",
        "17... Kc7 18. Qf3": "Finally on move 18 I move my Queen. Black has already moved his twice but ineffectively. Let's see if I can do better. I am attacking f7 looking for the Queen swap. This is to my advantage. Elimination is now my game (rule #7)",
        "18... Nf6": "Alright he seen it. but I have other options available.",
        "19. c6": "Like this. If we swap off I will still be  6 and I will castle King-side.",
        "19... Nd5": "Not what I was expecting. Let's chase his Queen around and see if he makes a mistake.",
        "20. Bg6 Qd8": "Oh I see the mistake, can you. All I need to do now is set up for a discovered attack, with my bishop.",
        "21. Bf4 a5": "No meaning move. He broke another rule, Rule #6. When pinned, don't be there.",
        "22. Nf7+": "Bye bye Queen",
        "22... Nxf4": "A temporary fix.",
        "23. Qxf4+": "I would have taken the Queen but (Rule #16) there was a better alternative. Black cannot even put his Queen in front as it will still be free.",
        "23... e5": "Now he is just giving me material.",
        "24. Qxe5+ Kb6": "Finally he does what he should have done on move 21.",
        "25. Nxd8": "Yummy!",
        "25... axb4": "\"OH MY GOD!\" he exclaimed, \"He got a pawn from me. Don't want to take it and lose both my Rooks",
        "26. a4": "Push on. At best he can chase my Queen with his Rook. Then he is probably looking to hide his King in the corner.",
        "26... Ra5": "Here we go. But I found a better move than retreating...",
        "27. Qb8": "Here he either gives me his bishop or his pawn",
        "27... Kc5": "\"Run Forest Run\".",
        "28. Qxc8": "Yummy! Watch out for the fork, Black!",
        "28... b6": "Didn't see it.",
        "29. Nb7+ Kc4 30. Nxa5+": "Yummy!",
        "30... Kc3 31. Qa6 Kb2": "Might be time to castle I feel.",
        "32. O-O bxa5": "What's a knight with such a leed. I am looking for mate.",
        "33. Qc4": "Big trouble here",
        "33... d3": "Blacks only possible move, apart from h5 which is no meaning as there is only one move left to play...",
        "34. Qb3#": ""
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=11183",
    "gameName": "Let's play chess",
    "players": "samurai_warrior (1276) vs. jgietzmann (1231)",
    "opening": "French defence (C00)"
}