{
    "moves": {
        "1. d4": "Queen Pawn Opening... I have spent the past few games trying this type of game out.  There is so much to an opening so I have a long way to go before I start pick up all the nuances!",
        "1... Nc6": "This has to be a quetionable move.",
        "2. d5 Ne5": "Continue the fun?",
        "3. e4": "not quiet yet....",
        "3... Nf6": "undoubtedly here right?",
        "4. f3": "sigh... I miss the chance to create another tempo",
        "4... c6 5. f4": "now I see what I missed before.  One play behind!",
        "5... Nxe4": "Curious move",
        "6. fxe5 cxd5": "If I had not missed my early move I would have been in much better shape with my overadvanced pawns.. now I just have to accept those losses.",
        "7. Qxd5": "honestly I expect him to play something \"Safe\"",
        "7... Nf2": "This catches me a bit off guard... obviously he hopes to keep me from castling and he hopes to exploit that.",
        "8. Kxf2": "I accept the material advantage.",
        "8... e6": "finally a move I was expecting",
        "9. Qd4": "Attempting to throw off bishop check and queen check all in one. ",
        "9... b6": "easy to determine what his plan here was right... ",
        "10. Nf3": "Yep... you guessed it.  I missed it",
        "10... Bc5": "Here is me accepting the loss of material... big time",
        "11. Be3 Bxd4 12. Bxd4": "all that loss and I am still not too bad. Not good, but not terrible.",
        "12... Bb7 13. Nbd2 Bxf3 14. Nxf3": "Hmmmm... things are looking up just a hair.",
        "14... d6": "hmmm my chance to keep him from being able to castle",
        "15. Bb5+ Kf8": "Not sure which was better Kf8 or Ke7",
        "16. exd6 a6": "At this point I am wondering if he knows how I am not expecting any of this",
        "17. Be2": "Here I expect some involvement from the queen...",
        "17... b5": "... and not this time",
        "18. b4": "Thinking I could perhaps throw some structure to the game... with a little luck and gifts from the opponent",
        "18... f6 19. c4": "take or not?",
        "19... Rc8": "... not.  I think 19. ... bxc4 was better I could be wrong though",
        "20. c5": "completing a pawn chain",
        "20... Kf7 21. a4": "wondering if I could hope up some room for my rooks to roam",
        "21... a5": "interesting choice here",
        "22. axb5 axb4 23. Bd3": "Keeping his King from becoming a bit of a nuisance",
        "23... b3": "not seeing this as much of a threat",
        "24. Nd2": "however, I see this as a chance to reposition a knight.. or at least begin it.",
        "24... b2 25. Ra7+": "forcing the king back",
        "25... Kf8 26. Nc4": "interesting isn't it?",
        "26... f5": "He finally decides to block off  my bishop?",
        "27. g3": "I wasn't sure what to think but I figured he was looking to push his pawns forward.  In thinking about this I missed the obvious Bxg7 .",
        "27... f4": "Well he still did it.. I guess that answers that question about his intentions... now what?",
        "28. Bxg7+": "I finally see the Bxg7 . Not much of a good choice for him here",
        "28... Kg8 29. c6": "figure nothing is keeping me from taking rook later... might as well push the pawn while I still can",
        "29... Ra8": "Offers a trade now",
        "30. Rxa8": "of course I take  This will leave his queen to my rook bishop and knight",
        "30... Qxa8 31. Bxh8": "now was the time",
        "31... Kxh8 32. Nxb2": "again.. now was the time",
        "32... Qa7+": "his fun for a little while... check fabulous",
        "33. Kg2 Qa2": "good sacrafice time?",
        "34. c7": "absolutely",
        "34... Qxb2+": "his only chance now is to keep me  running",
        "35. Kh3 Qc3": "only real thought here is I can't push my pawn yet",
        "36. b6": "but that may help eventually",
        "36... Qc6 37. Ba6": "He resigns here not seeing any good coming from the position."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=2973",
    "gameName": "Let's play chess",
    "players": "bwethington (1295) vs. peterfay (1249)",
    "opening": "Queen's pawn (A40), Lundin (Kevitz-Mikenas) defence"
}