{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Bb5 f6 4. Bxc6": "White decides to clear the board by exchanging pieces early as in move 4",
        "4... dxc6": "WhitBlack defends with his Queen Pawn, opening his Queen and Bishop",
        "5. d3": "White opens his Bishop diagonal",
        "5... Bd6": "Black brings his Bishop to the front",
        "6. O-O": "White castles",
        "6... h5": "Moving his Pawn allows him to attack the Knight and Queen behind that if he wants",
        "7. Be3 Be6 8. c4": "White starts to use his pawns",
        "8... c5 9. Nc3 g5 10. Qb3 b6 11. Qa4+": "Queen calls check",
        "11... Bd7 12. Qa6": "Can't see any purpose behind this move, but it leaves his Queen off in a corner",
        "12... h4 13. Nd5": "Knight will draw a pawn out of position",
        "13... c6 14. Nc3 Nh6 15. h3 Ke7 16. Nxg5 Qg8 17. Nf3 Bxh3": "Bishp cannot be taken because of the queen",
        "18. Qb7+": "Queen attack doesn't do much but brings the Queen out of her hole",
        "18... Ke6": "King's best move",
        "19. Ng5+": "This lets White capture the Bishop in an even exchange, by sacrificing his Knight.",
        "19... fxg5": "Now the Pawn can take the Bishop",
        "20. gxh3 g4": "Another exchange by White ",
        "21. Bxh6": "I liked the game up until 21, with the exception of White bringing out his Queen to early and leaving his King defenceless.  But then Black blundered.  Now Black did end up winning the game, (in 55 moves) but he could have ended it in 22 or 23 moves.  Right now!  Instead he follows White's tune and goes along with the exchange. \n\nFigure it out?  The Black Queen has the White King on the same file with only a Pawn in between.  If he moves the Pawn out of the way, the King will be in check.  The Bishop can jump in between, but White has nothing protecting g5, so the Queen could take that and again call check,  The White King only has 2 possible moves.\n\nPawn takes Pawn  - check.\nWhite's King can only move to h1 or h2\nQueen to g2 is mate",
        "21... gxh3+ 22. Kh2 Qg2#": ""
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=30783",
    "gameName": "Let's play chess",
    "players": "ferdi (1649) vs. mariusdamian (1610)",
    "opening": "Ruy Lopez (C60), Nuernberg variation"
}