{
    "moves": {
        "1. e4 e5 2. Nc3 Bc5 3. Nf3 d6 4. Nd5 c6 5. Ne3 d5": "This leaves Pe5 undefended.",
        "6. exd5 cxd5 7. Nxe5": "Bye, bye, Pe5.  I hardly knew ye.\n",
        "7... Nf6 8. f3 d4 9. Ne3c4 Nd5 10. d3 Ne3 11. Bxe3 dxe3 12. Qe2 Nc6 13. Nxc6 bxc6 14. a3 O-O 15. Nxe3 Re8 16. g3": "Oops.  Black has two pieces attacking the white knight, white has only the queen defending it.  Worse, if black takes the knight with the rook, the white queen is pinned.",
        "16... Rxe3 17. O-O-O Rxe2 18. Bxe2 Bh3 19. d4 Bxd4": "Unwise.  Pc3 nets white that black bishop.  Or if black moves the bishop, white trades a rook for the black queen, undoing a good part of black's material advantage.  Then again, Qg5+ or Qe7 trades bishop for bishop.  So nabbing the pawn isn't that bad after all.  Carry on...\n",
        "20. Bc4": "Now I'm thinking Bg2 followed by BxPf3.",
        "20... Bg2": ":)",
        "21. Rhe1 c5": "That won't save the bishop from Pc3.",
        "22. Rd3 Qb8 23. Bb3": "Now here black should move somewhere to protect a pawn fork of white's rook and bishop.  Perhaps Qb5.",
        "23... c4": "This seems a bit premature, but with the material advantage black can afford to trade down.",
        "24. Rxd4 cxb3 25. c3 g6": "So why not BxPf3?  Maybe better safe than letting the king get killed in his own castle--but white is moves away from setting up a palace coup.",
        "26. f4 Qb7 27. Rb4 Qf3": "Qd5 would have protected Pb3, at least momentarily.",
        "28. Rxb3 Qf2 29. Rd1 Qe3+ 30. Rd2 Rd8": "The white rook has fallen.",
        "31. Kb1 Qxd2": "I think I would have recommended using the rook instead.  This would make it easier to bring more heavy artillery to bear on the king's position.",
        "32. Ka2": "Ok, Bd5 is a classic pin.",
        "32... Qc1 33. a4 Rd1": "I still like Bd5--it keeps the white rook from moving, and should ultimately make for a quicker game.  Failing that, Rd2 might be better than Rd1.  This would confine white's rook to the b column (or QxPb2#).\n",
        "34. Rb8+ Kg7 35. Ka3 Qa1+ 36. Kb3": ""
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=54920",
    "gameName": "Let's play chess",
    "players": "threeeputtt (1139) vs. psycho422 (1054)",
    "opening": "Vienna game (C25)"
}