{
    "moves": {
        "1. e4": "My first annotaion of a game.",
        "1... c5 2. Nf3 d6 3. d4 cxd4 4. Nxd4": "At this point, I'm already trying to calculate what next. My mind is already saying to develop knight's to c3 and b3, as well as Bishops to c4 and e3, but also Rooks on d1 and e1. I also want my queen on f3. My pawn structure should be orientated on attacking the centre, achievable by playing f4, h3 and Kb1 to get my King safe.",
        "4... Nf6": "Black plays the Prins defence, perhaps the most solid in this situation.",
        "5. Nc3": "The classical line.",
        "5... a6": "Najdorf variation : secures b5 from my three minor pieces all poised.",
        "6. Bg5": "I saw this as the most active continuation.",
        "6... e6": "An important move that although blocks in the c8-bishop, contests the centre heavily.",
        "7. f4": "This is to counter Black's two central pawns. My future plans are to pick out pawn targets, to castle (most likely queenside) and to play Bc4, h3 and develop my heavy pieces.",
        "7... Be7": "A passive yet necessary move.",
        "8. Qf3": "Browne variation. My pieces are now ready to develop onto stronger squares.",
        "8... O-O": "The first move to not be by the book. Computer analysis says this is an innacuray, and that Black would have more success with 8...h6 or 8...Qc7. To accord to my plan, I am aiming to attack the king or at least limit the movement of Black. However, it is also important to note the weakness on b6, and that this is a potential target.",
        "9. Bd3": "My response is intended to aim at Black's kingside. The h7-pawn is a real weakness.",
        "9... Nc6": "Strong : Forces my d4-knight to stay in the centre, or control it from afar.",
        "10. Nb3": "I saw this as possibly the best move. Black's c6-knight isn't extremely strong, and so I didn't want to swap off mine.",
        "10... e5": "?! In my opinion, a dubious move. I can now put a pre-meditated plan into action - To make Black's pieces (namely the Bishops) useless and poorly situated.",
        "11. Bxf6 Bxf6 12. f5": "You will now notice several positional plusses for me. Firstly, Black's c8-bishop has one square to move to. Secondly, the f6-bishop is now the only defender to Black king. Furthermore, the d6-pawn is now a backwards pawn and liable to attack. Also, the d5-square is now weak enough for me to attack the f6-bishop, thereby removing the defender. Also, a pawn march is now a potential threat. I also have my eyes on 1. h4 Bxh4? 2. Qh3... +/-. ",
        "12... Nb4": "A strong move. My bishop can't move else 13...Nxc2+. Also, d5 is now partly covered.",
        "13. a3 Nxd3+": "The loss of the bishop isn't costly. I now have central dominance, piece placement is better, and a potential attack is formulating.",
        "14. Qxd3": "The d6-pawn is now seriously weak.",
        "14... b5": "This has the benefit of limiting the c3-knight's activity, but also of providing a square for the c8-bishop, not to mention one which can attack the weak e4-pawn.",
        "15. O-O-O": "Qxd6 is now a serious threat. However, Be7 leads to a pawn onslaught, so maybe a single pawn isn't too important....?",
        "15... Bb7": "?! Black prefers development over material.",
        "16. h4": "!?  After long thought, I believed that this was an answer - an experiment. Yes, 16. Kb1!... leads to poor counterplay for Black, but this looked interesting and I didn't want to pass up the opportunity. There is no material threat - 16...Bxh4 17. Qh3? Bg5+ and Black is relatively safe. However, after I gambit the pawn away, I end up with strong pieces, and a poorly placed bishop for Black. ",
        "16... Bxh4": "As I expected.",
        "17. Qxd6": "If he swaps, my rook will lead to a heavy attack.",
        "17... Qg5+": "?!  As I stated, earlier, the bishop is now poorly placed on h4..... but now for a little longer!",
        "18. Kb1": "My king is FINALLY secure.",
        "18... Rad8": "Strong tempo move. The e5-pawn is free, but a variation is possible to pick him up again.",
        "19. Qxe5 Rdc8": "?? This move effectively costs the game. Black had two main options. One was the defensive 19... h6 which secured an average endgame, albeit a pawn down. However, the more aggresive and striking option was 19... Bg3! which would lead to complications for me in the centre, and give Black a chance to win his pawn back with 20. Qc5 Rxd1 21. Rxd1 Qf4 and strong play from Black would secure a strong endgame.",
        "20. Qh2": "At this point, some form of disaster is inevitable.",
        "20... Rxc3": "Also favoured by the computer.",
        "21. bxc3 Bxe4": "Black can get some compensation in the form of central pawns for his bishop.",
        "22. Qxh4 Qxf5 23. Nd4": "Covers c2 but also attacks the queen.",
        "23... Qc5": "?? If 23... Qg6 an alternative variation was 24. Rde1 Bf5 25. Nxf5 Qxf5 26. Re5! [ 26...Qxe5 27. Qxh7#] 26...Qg6 27. Rg5!...",
        "24. Qxe4": "1-0 Thankyou to my opponent for this game!"
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=53529",
    "gameName": "Let's play chess",
    "players": "honza88888 (1503) vs. howard562 (1855)",
    "opening": "Sicilian (B98), Najdorf, Browne variation"
}