{
    "moves": {
        "1. d4": "Black takes advantage of a series of blunders by white to earn a win through mate",
        "1... d5": "A queen opening. I choose to match white in the middle of the board and see how the opening progresses. ",
        "2. Nc3": "I am under immediate pressure",
        "2... e6": "I choose defense",
        "3. Bf4": "WHite is ahead in development and pressing me firmly",
        "3... a6": "I protect against the attack on C2 and the fork to follow",
        "4. Nh3": "White continues to develop his minor pieces, I am lagging seriously behind",
        "4... Nf6": "So I step up my efforts to catchup in development",
        "5. g3": "I see white building a castle",
        "5... g6": "and I follow suite",
        "6. Bg2 Bg7 7. O-O O-O": "The castles constructed, I breathe a sigh of relief. I do not like my King so exposed",
        "8. Na4": "A move I do not fully understand. White is trying to ....do what.....????????????",
        "8... Re8": "I continue my castle development and my opneing sequence",
        "9. Qd3": "So white brings the Queen. This gives white control of much of mys side of the board I suppose, so in one sense, white is well ahead. ",
        "9... Nbd7": "Undaunted, I continue to open the game",
        "10. Qd2": "See, this is what I call a wasted move. White could have done this a move earlier, and then I would have had to react then, bit I did not worry about it until now. ",
        "10... Ne4": "OK, so I threaten the queen and force a retreat",
        "11. Qe3": "Well at least that is what I thought would occur",
        "11... e5": "So instead I challenge the bishop",
        "12. dxe5": "oops.....",
        "12... Nxe5": "So this is a bit planned. I can be foiled if white captures my Knight in an exchange",
        "13. f3": "BUt white does not, instead, white gives me an opening. ",
        "13... Nc4": "this is interesting, now white has to make a small decision - a knight for a queen, I think not...",
        "14. Qb3": "not really a ah rd choice, but the solution white selects plays white into a fork",
        "14... Ned2": "A double knight attack is a bit formidable",
        "15. Qb4": "again white chooses the queen",
        "15... Nxf1": "bye bye castle",
        "16. Bxf1": "bye bye night. ",
        "16... Bf8": "with a 2 point advantage, I can now tackle the queen",
        "17. Nc5": "so this is a good situation for me because the knight is pinned. ",
        "17... b6": "bye bye knight right?",
        "18. Qc3": "yep..bye bye knight",
        "18... bxc5": "now taking this knight was a bit foolish because the queen was in a position to be pinned to the castle - there is another term for this, but I can't recall what that is...",
        "19. b3": "in any event white does not recognize the danger",
        "19... Nb6": "I give him an out....by running away",
        "20. Bc1": "still not seeing the danger, white tries to build an attack",
        "20... Bg7": "too late....",
        "21. Qxc5": "bye bye castle",
        "21... Bxa1": "indeed!",
        "22. Qd4": "Now this is  HUGE blunder by white certainly ensuring a quick end to the game. ",
        "22... Bxd4+": "bye bye queenie...an 18 point lead and check to boot",
        "23. Nf2": "what is next....white retreats and black...",
        "23... Bb7": "begins to set up the end game. ",
        "24. e3": "a futile attempt to lure me into retreating...",
        "24... Bxe3": "bye bye paywn - just a mere foot soldier - cannon fodder",
        "25. Bxe3": "this is not going to help. White should be preserving pieces not sacrificing them",
        "25... Rxe3": "this is calculated. I need the pawn up a row, the g3 pawn gone, and the queen on d5",
        "26. Bd3": "white tries...this....",
        "26... Rxf3": "OK, step one....",
        "27. Be2": "like I am going to allow a bishop interfere with my plans",
        "27... Re3": "next step...",
        "28. Bf1": "finally white is getting the picture. But this retreat locks the king in for me and makes my life easier. ",
        "28... d4": "step two....clear d5",
        "29. Nd1": "this is actually a very interesting move. White fails to see the danger of capturing the castle. In the event he does so, I capture the knight and bring my pawn up to guard the f2 square. With the bishop on g1, I am almost home dry",
        "29... Qd5": "finally, step three and a move or two away from mate",
        "30. Nxe3": "white makes the fatal mistake of capturing the castle afterall",
        "30... dxe3": "the f2 square is closed to retreat for white. The king is captured, there is nothing white can do. ",
        "31. c4": "in a futile attempt to distract me, white tries to threaten my queen. ",
        "31... Qh1#": "On to Mate. A well planned and executed end game. "
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=2755",
    "gameName": "Let's play chess",
    "players": "mac011 (1206) vs. opus692 (1262)",
    "opening": "Queen's pawn (D00), Chigorin variation"
}