{
    "moves": {
        "1. e4": "King's pawn Start",
        "1... c6": "I wasn't expecting this ",
        "2. d3": "Chiefly to get the black bishop into picture as the pawn on c8 has exposed",
        "2... d5 3. f3": "reinforcements at the center of the field...",
        "3... e5": "Same thing he does...",
        "4. f4 Nd7": "He gets in a horse",
        "5. Nf3": "So do I to put more pressure on e5",
        "5... f6 6. f5": "This effectively prevents the horse on g8 to be in picture early in the game",
        "6... dxe4": "He gets things moving...",
        "7. dxe4": "So do I",
        "7... Qa5+": "CHECK!... My King is exposed! ",
        "8. Bd2": "Could have brought the pawn at c2 forward but this is more attacking. that would also prevent the horse at b1 to come out to the center",
        "8... Qb6": "Seems like a retreating move but actually the pawn at b2 (and the rook at a1 eventually) is under threat as the bishop is out!",
        "9. b3": "I read that :)\nAnd brought the pawn in danger forward ",
        "9... Nh6": "The horse couldn't come in the center and thus went the other way",
        "10. c4": "Steady approach towards the queen.\nNot a big plan.",
        "10... Ng4": "Oops!\nIf the horse comes to f2, the queen and rook are in compromising positions!",
        "11. Qe2": "I read that and brought queen forward to save the day.\nBut black is in much better position now as the queen at b6 is attacking areas near the castle.",
        "11... Bb4": "Good move by black. The bishop is pinned with the king.\nIf I take the bishop with the bishop at d2, the black queen will replace it and check!\nWhite queen has to come in the middle for it (so that king does not move and castling is possible)\nThis might have been a better option that what I did eventually.",
        "12. h3": "Moved the pawn forward to threaten the horse instead of taking the bishop at b4\nHe still has the choice open to kill the bishop d2 with b4",
        "12... Nh6": "Hurrah!\nMoral victory! \\m/ Horse retreats! felt really good :)",
        "13. Kd1": "Ahh... The joy is shortlived.\nConsidering the attack on the black squares by the bishop and the queen, the king decides to move to a white d1 and sacrificing castling",
        "13... O-O": "He shows he can do what I can't :(\n",
        "14. Bxh6": "I take this now as the clean path for the rook to come out is undone by the castling.\nI don't mind exchanging bishops for horses... anyday.",
        "14... gxh6": "Plus it exposes the king for a straight rook attack on the king which is exactly what I wanted.",
        "15. a3": "Time to drive the bishop away. It is blocking the path for the horse on b1 (and thus for the rook to get into the game)\nI start feeling a little better about the game... After the initial attacks black was on top but with the loss of an attacking horse and now the possible retreat of the bishop, life is better. I think putting the king to a white d1 was a good move after all.",
        "15... Bd6": "Bugger retreated!\nI expected him to go to c4 but he interestingly chose d6 instead!\nBishop here is vulnerable and unprotected.",
        "16. b4": "I think i know why he did that... he was offering me to put my queen at d2\nIf he wanted my queen to come and attack the bishop from d2, he would've given me a check with queen at b3 and gobbled up some pawns.\nI think i read that and with this little pawn move to b4, the queen cannot come forward - neither can the bishop or the horse!\nIts a great move!",
        "16... c5": "This is also an awesome move.\nI had to think a lot after this -  be it at 230 in the night.\nI must not exchange the pawn at c5 i said to myself. Coz if i do, either of the three (queen bishop or horse) can take the pawn and enter in and open battlefield.\n",
        "17. b5": "I call in for peace and move my pawn forward to b5. The queen is not under threat but it seems that queen to a5 is the only okish move for him.\nNote how the bishop at d6 (also the one at c8),  horse at d7 are locked. the rooks are not yet in the game.\n",
        "17... Rf7": "He opts to get the rook into picture instead of pushing the queen forward vulnerably.\nthis might be a better move than the queen to a5.",
        "18. g4": "wanted to do queen to d2 first. that would've threatened pawn at h6 and also forced the black queen to retreat all the way back to d8 if the horse at b1 made its easy way to d5 2 moves later. But that doesn't really help I think, by that time, the rook can be comfortably sitting at a \"might be dangerous later position\" of g3. there are a thousand permutations but i think this would've happened.",
        "18... Rg7": "Hmmm... He did that either way... I'm not sure why he did that... If its because of lack of moves, I'm happy. But if its not, its a matter of serious concern.\n",
        "19. Nc3": "Could've moved that queen to a d2 position and threatened the pawn at h6. I would be a pawn up but I don't see the queen getting anywhere after it reaches h6. Pawn let go.. Wonder how hard this would hit back.\nMeanwhile the horse is brought into picture to create some trouble for black queen.",
        "19... Qa5": "He finally moves his queen to a5!\nHorse at c3 is under threat ",
        "20. Kc2": "I move my king instead of the queen.\nSomehow, my queen at d2 doesn't interest me :P\nThis is mostly done so that the rook at a1 can get moving to d1 in a short while",
        "20... Nb6": "The horse can finally breathe! It can't come to c4 though... Well protected. Didn't think about a4",
        "21. Qd2": "Moved the queen to d2 to threat unprotected pawn h6 and bishop at d6 (and later f6)",
        "21... Nxc4": "He took a lot of time before doing this. So obviously he has a plan.\nBut he MUST know that the bishop at f1 was protecting the pawn the black horse takes at c4.\nHe doesn't really have many moves apart from this. ",
        "22. Bxc4+": "So my plan seems to be working. This move finishes the last of his horses with both mine intact, and gives a check for which realistically leaves him only 1 move (King to f8) \nI even put a conditional move that if the king moves to f8, my next move would be the queen to take the free bishop at d6",
        "22... Kh8": "So he feared the check and moved the other way",
        "23. Qxd6": "...That doesn't effect my next move though...",
        "23... Qc7": "He obviously wants to exchange queens which i don't want to right now.",
        "24. Qxc7": "But i do it either way.\nTried a lot of combinations like moving to capture pawn f6 and giving check at d8 or f8 but all eventually involved queen exchanges or worse with rook in more mobile position.\nI might have missed something that's the deepest I could go for the moment ",
        "24... Rxc7": "Queen exchanged",
        "25. Nd5": "Attack the rook",
        "25... Rg7": "if he would've put it at f7 to save the pawn, he would have been a rook down with horse at b6 ",
        "26. Nxf6": "So the pawn is not saved and captured",
        "26... b6": "I can't read why exactly he did that...",
        "27. Rad1": "with a rook at d1, next move would be to get it at d8 and black is in trouble.\njust thinking... bringing the rook at h1 would've been a better choice actually ",
        "27... Bb7": "That was a nice move. If the pawn dies, its a check, the horse dies and then rooks are under threat.",
        "28. Bd5": "I think that's the only good counter",
        "28... Bxd5": "He exchanges.... Doesn're really have much choice.... does he ?",
        "29. Rxd5": "Rook is the best way to take out of the 3 options.\nGame is in a stage where every you can start guessing his moves\nEDIT: Just after saying that, Black resigns :)"
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=34580",
    "gameName": "Let's play chess",
    "players": "shikhersitoke (1200) vs. mbh476 (1167)",
    "opening": "Caro-Kann (B10), closed (Breyer) variation"
}