{
    "moves": {
        "1. d4": "Very tied game with uncommon situation and draw obtained by sacrifying a rook.",
        "1... Nf6": "Looking for a benoni",
        "2. c4": "common answer",
        "2... e6": "Main modern benoni line",
        "3. Nc3 c5": "The benoni move.",
        "4. Nf3": "White doesn't play 4. dxc5",
        "4... cxd4": "... so that I opt to take",
        "5. Nxd4": "Trading",
        "5... Nc6": "developping",
        "6. e4": "Another possibility was 6. Nxc6 bxc6, creating a semi open file in b for the black rook.",
        "6... Bb4": "pinning the knight. Another option was to fiancheto the bishop by playing 6.g6",
        "7. f3": "White weakens both sides in case of a castling but white has now a strong center",
        "7... O-O": "king in safe",
        "8. Be2": "preparing the castle",
        "8... d5": "i do not want to let white fully control the center",
        "9. Nxc6": "It seems a mistake, for it enables black to set a pawn on c6, thus reinforcing the central d pawn and it creates a semi open file on b.",
        "9... bxc6 10. e5": "pushing on the center but the pawn will be hard to defend.",
        "10... Nd7 11. Bf4": "defending the e pawn.",
        "11... Qa5": "To prepare a queenside attack",
        "12. Qc2": "The queen can be dangerous, aiming on h7 and she protects c3",
        "12... Ba6": "c5 would have been better, enabling d4",
        "13. O-O": "King in safe but the opened a7 g1 diagonal is dangerous.",
        "13... Qc5+": "... and black has to seize the occasion.",
        "14. Kh1": "Only move.",
        "14... Bxc4": "Black gets a pawn.",
        "15. Rae1": "White prefers to protect his bishop but I think trading (15. Bxc4 Qxc4) would have been better. Black's plan is now to get the b pawn on c3 so that white has 2 isolated pawns.",
        "15... Qd4": "Attackin the unprotected f4 knight and preparing to trade.",
        "16. Bg3": "only move if white doesn't want to lose the e pawn.",
        "16... Bxc3": "Black trades",
        "17. bxc3": "White has now 2 isolated pawns and one pawn less.",
        "17... Qc5": "This is a bad place for the queen but the aim is to send it on a5.",
        "18. f4": "Developping and stenghtening the center.",
        "18... Bxe2": "I didn't found anything better and black has got enough material and positional advance to afford trading.",
        "19. Rxe2 a6": "To prepare 20. ... Rb8",
        "20. f5 Rab8": "I choose not to take and to prepare my attack (plan : occupy the open file - done, double the rooks and set one on the first line), estimating that it will take at least 4 moves to white to build a dangerous attacking possibility against the black king and I'll get a mating menace in 3 moves if white doesn't defend.",
        "21. f6": "I underestimated the danger of white's progression.",
        "21... g6 22. Qd2 Rfc8": "I didn't see any other place for the rook but it's a weak move, letting the initiative to white. 22. Rb7 would have been better.",
        "23. h4": "White is on attack on the kingside",
        "23... Rb7": "to double the rooks",
        "24. h5 Rcb8": "Black lost one move by playing 22. Rc8",
        "25. hxg6": "I saw little point in this move. The following trade doesn't seem to have much importance in this position. It weakens both kings. in fact I underestimated white's attack.",
        "25... hxg6 26. Rf4": "To enable a furher Rh4",
        "26... Rb7b1+": "It seemed to me the obvious move to play",
        "27. Kh2": "White culd have interpose a piece but chooses to move the king.",
        "27... Qg1+": "Harassing the white king but Dame Guenièvre is blocked far away from her king and husband.",
        "28. Kh3": "forced move",
        "28... Rd1": "To chase the queen from the c1 h6 diagonal",
        "29. Qc2": "The white queen is less dangerous on this diagonal. But the 2 pieces on line 1 are cramped",
        "29... Rf1": "To prepare 30. ... Qh1 31. Bh2 Rxf4",
        "30. Bh2": "... but whites sees the danger and prevents it",
        "30... Qh1": "No choice",
        "31. Rg4": "Danger on g6 : if 32. Rxg6 ! fxg6 33. Qxg6+ Kf8 34. Qg7+ with mate to follow.",
        "31... Kf8": "preventing the danger",
        "32. Rxg6": "Equalising material. Both kings are unsafe and material is equal but black has 2 pieces blocked in the corner.",
        "32... Rf5": "To counterattack.",
        "33. Rh6": "Menacing 34. Rh8 mate",
        "33... Ke8": "Only move.",
        "34. Rh8+ Nf8": "Forced move",
        "35. Qa4": "Now white's attack is getting even more dangerous.",
        "35... Kd7": "To protect the c pawn.",
        "36. Qa3": "menacing 37. Qe7+ Kc8 (forced) 38. Rxf8 mate",
        "36... Rh5+": "I couldn't find any other idea.",
        "37. Rxh5": "White is one rook ahead and the game seems to be lost for black",
        "37... Ng6": "\"My kingdom for a horse\" The brave Perceval goes for a desperate ride to save the situation and obtain a draw.",
        "38. Qd6+ Kc8": "Only move to prevent the mate (if 38. ... Ke8 39. Qe7+mate)",
        "39. Qxc6+": "White carries on pressing the black king.",
        "39... Kd8": "Forced move.",
        "40. Rh7": "Menacing 41. Rxf7 ... 42. Qc7+ with mate to follow or 41. Rg7 ... 42. Rg8+ with mate to follow. Verrry dangerous but in both cases white needs 2 moves before setting Arthur in chess.",
        "40... Qb1": "... so that black has 2 moves available. Dame Guenièvre saves her husband for she menaces : 41. ... Nf4+ If 42. Kh4 Qxh7+, 43. ... Nxe2 it's white's turn to be in trouble. If 42. Kg3 Nxe2+ 43. ... Qxh7 and white is in late in material.",
        "41. Rf2": "Black cannot be in advance of material if playing 41. ... Nf4",
        "41... Nf4+": "... But still plays it. Perceval lays down his life for his king without any hesitation.",
        "42. Rxf4": "42. Bxf4 was another candidate move.",
        "42... Qxh7+": "Reducing the late in material and preparing a draw.",
        "43. Kg4 Qg6+": "43. ... Qxh2 was another possibility but I wasn't so sure it lead to a draw for white would regain the initiative.",
        "44. Kf3 Qd3+": "Forcing the draw.",
        "45. Kg4": "If 45. Kf2 Rb2+ and the white king is doomed. White proposes the draw... Gladly accepted !"
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=52719",
    "gameName": "Let's play chess",
    "players": "zendenball (1802) vs. ptitroque (1810)",
    "opening": "Nimzo-Indian defence (E20)"
}