{
    "moves": {
        "1. e4 c5": "Sicilian.",
        "2. e5": "This disobeys one of the basic rules of the opening:never move a piece twice. Better moves are Nf3 and Nc3.",
        "2... Nc6 3. f4 d5 4. exd6 e.p.": "It may have been better to play Nf3 and keep the position closed as white is slightly behind in development but the move played shouldn't be disastrous.",
        "4... exd6": "Now white is already behind in development.",
        "5. Bc4": "Sensibly developing, however e2 or b5 were better squares as now black can gain more time with the move d5.",
        "5... Nf6 6. c3": "Nf3 continuing to develop would be better.",
        "6... d5": "Making a big pawn centre and also pushing the bishop away from its active square.",
        "7. Bb5": "Now its on a square it could have gone to in 1 move rather than two.",
        "7... Bd6": "Black now has two more pieces developed than white. Alarm bells should be ringing if you find ourself in this kind of position and you should be looking to castle as quickly as possible. However white dosnt and plays...",
        "8. Qa4": "You have to be very careful about pawn grabbing in the opening, especially when a few tempi down. But the pawn on f4 neede to be defended. Better could have been d3.",
        "8... Bd7": "I dont think black needed to do this. Yes, the knight is attacked twice and only defended once, but look at the position after 0-0,Bxc6 bxc6,Qxc6 and Re8 . THe whhite king is tuck in the centre and this has to be worth a pawn.",
        "9. Ne2": "Finally getting to the right idea although it's nearly too late. White would have to play extremely accuraltely to keep himself in the game.",
        "9... O-O": "Now the rook wll also enter the game.",
        "10. Qc2": "Another instance of a piece taking 2 moves to get to a square it only took 1 move to get to. Castling is the best move by far as then white can fight for equality without the king in to much danger. Now thought, the king gets stuck defending the e2 knight.",
        "10... Re8 11. Na3": "Still, castling was best as the knight is defended by the bishop on b5.",
        "11... Bg4": "Now castling is out of the question as the e2 knight drops.",
        "12. d4": "This is the losing move. D4 is not supported enough for this advance. However its hard to see what else to do. h3 trying to drive away the bishop may have been the best try. This wat white drops only a pawn after Bxe2 and then Bxf4",
        "12... cxd4": "The pawn capture opens white right up and the end is not far away.",
        "13. Bxc6 bxc6": "There are too many pieces attacking the knight and it will be lost soon.",
        "14. Kf1 Bxe2+ 15. Kg1 d3": "Opening up the g1-a7 diagonal for the mating attack.",
        "16. Qa4 Qb6+ 17. Qd4": "The only move as Be3 Qxe3 is mate.",
        "17... Bc5": "The queen is pinned against the knig and white decides to call it a day. A nice miniature."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=874",
    "gameName": "Let's play chess",
    "players": "uriel (1287) vs. smoran90 (1200)",
    "opening": "Sicilian defence (B20)"
}