{
    "moves": {
        "1. d4": "I'm Black in this game where I mistakenly took material and ended up having to fight for a draw, but then miraculously I got lucky at the end and won.",
        "1... g6 2. e4 Bg7 3. Nf3 d6 4. Be2 Nf6 5. Nc3 O-O 6. O-O": "So far both sides have castled kingside, but White has a lot more control of the center. I personally don't like putting many pawns in the center, and instead I play flexible setups that will contest the center later. Even though I don't have much space, I am more flexible and I can play to break in the center with e5 or c5.",
        "6... a5": "At first glance this move seems strange and unorthodox. I couldn't really think of a better move to do. I mainly wanted to stop b4. My plan was to play for a c5 boost with b6-c5, but after b6, b4 is annoying. This stops the annoying b4, and I can follow up with b6 and c5.",
        "7. Be3 Nfd7": "This puts more control on the dark squares",
        "8. Qd2 b6 9. Bh6 c5": "This move doesn't appear as strong now that White has the option of removing my fianchetto, but the control of the dark squares remains the same if both dark-squared bishops are gone, White will have simplified the control. This is sort of like the Kavutskiy variation of the Modern Defense, but White sets up his pieces Bd3 c3 Na3 in that opening. Trading dark bishops usually isn't a problem for Black in the Kavutskiy variation.",
        "10. a3": "I'm not sure if playing for b4 should be White's best plan, he already played Bh6, so it seems like White would want to trade bishops and think about starting a kingside pawnstorm",
        "10... cxd4 11. Nxd4 Bb7": "Now the position has turned into a variation of Sicilian Dragon where Black hasn't played Nc6, and has made a lot of odd moves. White can play b4 here, but after axb4 axb4 Na6 I can put pressure on the b-pawn, and if Black advances the b-pawn then my knight gets an outpost on c5.",
        "12. Bc4": "White moves his bishop to a more agressive square, but I think it's better if White trades bishops and starts an attack f4-f5",
        "12... Na6": "This stops b4 and makes way for Rc8, and also there are ideas of putting a knight on c5.",
        "13. Rfe1": "Maybe White wants to trade bishops and play f4-e5 gaining space in the center.",
        "13... Rc8 14. b3 Nc7": "I know this move is terrible but I was probably moving through my games too fast and I made a lot of hasty moves, but that happens a lot in correspondence chess.",
        "15. b4": "Since I blocked my rook's path, White decides the pawn isn't needed to defend the bishop anymore, and plays the b4 advance, but like I mentioned before, I can put pressure on the b-pawn and play Nc5 if White ever plays b5",
        "15... Ne5 16. Bb3 axb4 17. axb4 Na6 18. b5 Nc5": "White has given my knight the c5-square, but he can remove my other knight with Bxg7 and f4. My knights aren't really dangerous, so I need to find some kind of play quick before White generates some activity.",
        "19. Bd5 Bxd5 20. Nxd5 Nc4": "White delayed trading dark bishops for too long, so now I can gain some tempo",
        "21. Qg5 Bxd4": "Here I get two minor pieces for a rook, which can be a crushing advantage in a lot of positions, but White's rooks get active and my minor pieces take awhile to coordinate, so White was able to get a lot of play and almost won.",
        "22. Bxf8 Kxf8": "Qxf8 hangs the e-pawn",
        "23. Ra7 Nd7": "I thought blocking was the safest and soundest option, even though it moves my knight off the outpost I spent so much time getting it too, the outpost is useless now",
        "24. Qh6+ Kg8 25. Nb4": "White threatens Nc6 here, so I should've played Bg7 and been safer, and after that I shouldn't have any problems. My material advantage should be enough to win, but I played more risky moves and White got a huge initiative. A material advantage is only useful if your extra pieces can coordinate well, and my minor pieces cannot coordinate well at the moment.",
        "25... Nce5": "I decided to play the riskier variation where I threaten to play Ng4, but it is too greedy to grab more material and stall the coordination of my minor pieces.",
        "26. Kh1": "This move shocked me I thought Rf1 was probably the best move. Here I should just play Bxf2 and have a comfortable advantage of two minor pieces and a pawn for a rook, but I played to win more material which gave White some tempo",
        "26... Ng4 27. Qd2 Nxf2+ 28. Kg1": "The most I can get out of this is an exchange,",
        "28... Nd3+ 29. Kf1 Nxe1 30. Nc6": "because of my greediness, White gets this tempo move in and my material advantage drops. This caused me to make a horrible move and give White winning chances, in what should've been an easy win for me.",
        "30... Rxc6": "Another hasty move. I should've played Qe8 and settled for a 1-pawn advantage after White takes my bishop and wins my trapped knight, after this blunder, White gets a passed pawn and gains a lot of tempo and almost wins,  while my minor pieces cannot coordinate and can be picked off in their horrible positions.",
        "31. bxc6 Ne5 32. c7 Qc8 33. c3": "This move makes way for Qa2 where White's major pieces are threatening on the open file. My minor pieces are too slow to stop that action and are virtually useless. Here I realized my only hope is to get my queen active and draw by perpetual check.",
        "33... Nc6 34. Qa2": "White can afford to sacrifice the exchange because of the very strong passed pawn. After the trade, White's queen on a7 can go to c8 and White will promote.",
        "34... Nxa7 35. Qxa7 Kg7": "My best bet is to get my king off the back rank so that I can play Qa6  if White plays Qb8, and manage a draw by perpetual check. I also thought about saving my minor pieces and going into an ending where I have two minors and three pawns (9 points) vs. a queen (9 points) but the queen will just dominate on the open board and win some pawns.",
        "36. cxd4": "White removes my attacker of the g1-a7 diagonal so now White can probably escape the perpetual. My best chance to draw is to take a pawn to clear more space for my queen to find checks. ",
        "36... Nxg2 37. Qb8 Qa6+ 38. Kxg2": "After this I knew I had succeeded in getting a draw, there isn't really any way White can escape the checks after this.",
        "38... Qe2+ 39. Kg3 Qe3+ 40. Kg2 Qe2+": "Qxe4 is more risky because it gives White's king more space to roam and a better chance of escaping the checks. It doesn't matter how many pawns I win, because White is going to queen if I stop checking, and none of my pawns are close to promoting. White declined the draw, and just when I thought there was no possible way I could win this, he made a horrible blunder that loses the game immediately.",
        "41. Kh3": "White should've realized that he couldn't escape the checks, and settle for a draw, but now White has just suicided his king, by allowing me to draw him closer to my territory with tempo, so that White's promotion threat is meaningless now.",
        "41... Qf3+ 42. Kh4 h6": "The only thing that beats a promotion threat is a mating threat. I will play g5# here if White promotes, and all White can do is sacrifice his queen to stall his loss",
        "43. Qf8+ Kxf8 44. c8=Q+ Kg7 45. Qg4": "This is the only way to stop the mating threat, and after the queen trade, I have an easy win because of my advantage in pawns.",
        "45... Qxg4+ 46. Kxg4 Kf6": "Probably more accurate to push the passed pawn immediately, but that doesn't really matter in an easily winning position",
        "47. Kf4 e5+ 48. dxe5+ dxe5+ 49. Ke3 Kg5 50. Kd3 f5 51. Ke3 f4+ 52. Kf3 b5 53. Ke2 b4 54. h3 b3 55. Kd2 f3": "White cannot stop both passed pawns, so he resigned here."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=9849",
    "gameName": "Let's play chess",
    "players": "rafaeloliveira (1675) vs. byakuugan3 (1714)",
    "opening": "Modern defence (A40)"
}