{
    "moves": {
        "1. h3": "This game was a slow, positional affair. The Pawn position got locked in place and made for few opportunities to attack, but some sharp tactics enabled me to get a small advantage and eventually exploit it for a difficult win.",
        "1... e5": "I respond to White's unusual opening by trying to seize the center.",
        "2. e4 Nf6 3. d3 d5 4. Qe2": "This move surprised me. White's development will be slowed a little.",
        "4... d4 5. c3 c5": "I'm thinking I might be able to get a positional advantage by controlling more space.",
        "6. b3 Nc6 7. Bb2 Be6 8. Qc2": "I thought White would play Nb2 here and prepare to castle, but he prefers a slower style of development. Wilhelm Steinitz used such a style to great success, so it can work -- but only in a relatively closed position.",
        "8... Be7 9. g3 O-O": "My own development is now complete. I have a slight edge in space, so my objective will be to try and keep White cramped.",
        "10. Bg2 b5 11. a3 a5 12. Nf3 h6": "In keeping with the cramping principle. White's Knight cannot now venture to g5.",
        "13. Nbd2 Bd6 14. O-O": "white completes his own development.",
        "14... b4 15. c4 Qd7 16. g4 Nh7": "When one has an advantage in space, one should try and deny the opponent threats. Retreating pieces to prevent the opponent from freeing his game is acceptable, per Znosko-Borovsky.",
        "17. a4 f6 18. Nh2 g6": "Now all of White's pieces are on his 1st or 2nd rank. I have 3 pieces past my 2nd rank and 2 advanced Pawns helping to keep White cramped. It's time to start squeezing the life out of White's position.",
        "19. f3 f5": "If a file opens, it'll be to my advantage, as I am in more of a position to attack.",
        "20. Rf2 fxe4 21. fxe4 Rxf2 22. Kxf2 Rf8+": "Now I have control of the only open file, augmenting my positional advantage.",
        "23. Ndf3": "A self-pin. If I were in White's position, I would have preferred 23 Ke2 to be followed by 24 Rf1, disputing Black's control of the file.",
        "23... Ng5": "I pile on. White should move his King to unpin his Knight.",
        "24. Qe2 Nxf3 25. Bxf3 h5": "The pin will cause White to lose material if he lets it stand. 26 Kg1! is called for.",
        "26. Kg2": "Unpinning, but now the Bishop can't move. If White had played Kg1, his Bishop would now be mobile.",
        "26... Be7 27. Rg1 Bg5 28. Bc1 Bxc1 29. Rxc1 hxg4 30. hxg4 g5": "White's g-pawn is now fixed as a target.",
        "31. Rh1 Ne7 32. Qd2 Rf4": "Black's own g-pawn is shielded from attack.",
        "33. Qe2 Ng6 34. Kf1 Nh4": "The threat is ...Nxf3 Nxf3 Bxg4, creating a passed Pawn for Black.",
        "35. Ke1 Nxf3+ 36. Nxf3 Bxg4": "Not only is Black up a Pawn, White's Knight is now pinned as well. Too many pins to overcome -- the danger of a cramped, immobile position.",
        "37. Rf1 Qf7 38. Rf2 Bxf3 39. Qf1": "Now I'm up a piece and a Pawn. If I can exchange off the heavy artillery, the endgame should be an easy win.",
        "39... Bxe4": "If White plays 40 dxe4??? the follow-up is 40...Rxe2 41 Qxe2 Qxe2 42 Kxe2 Ke7 and White can resign, as the King-and-Pawn ending is hopeless. White must keep at least 1 major piece on the board to have any chance of drawing.",
        "40. Rxf4 Qxf4": "White's only chance is to move his Queen. 41 Qh3 is probably the best move.",
        "41. Qxf4 gxf4": "Game over. The King-and-Pawn ending is easy to win.",
        "42. dxe4 Kf7 43. Ke2 Kf6 44. Kf2 Kg5 45. Kf3 Kh4 46. Kg2 Kg4 47. Kf2 Kh3 48. Kf1 Kg3 49. Kg1 Kf3 50. Kf1 Kxe4 51. Ke2 d3+ 52. Kf2 Kd4 53. Kf3 Kc3 54. Kf2 Kc2": "White resigns, as Black's d-pawn Queens in 2 moves."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=28157",
    "gameName": "Let's play chess",
    "players": "bobtucker (1338) vs. thehellion (1292)",
    "opening": "Global opening (A00)"
}