{
    "moves": {
        "1. e4": "King Pawn Opening.",
        "1... e5 2. Nf3 Nf6": "Petrov.  Not my favorite of openings.",
        "3. Nxe5": "Petrov, French Attack.  ",
        "3... Nxe4": "Petrov, Damiano variation.\n\nI've always heard, and been of the opinion myself, that Nxe4 is a mistake here.  d6 is more mainline",
        "4. Qe2": "So the knight at e4 must be protected in fear of Nc6 ",
        "4... d5 5. d3": "this is why I don't like 3. ... Nxe4.  Now in order to equalize, black must take my knight in response to me taking his.  Moving the knight is still invalid due to Nf6 ",
        "5... Bd6": "Black offers trading the knights.",
        "6. Nxf7": "I decide to accept the trading of knights on my terms.  Grab the pawn, force him to use 3 moves too castle (really two as one is the knight capture.  ",
        "6... Kxf7 7. dxe4 Re8": "Pinning the pawn.  Expected.  ",
        "8. Qf3+ Kg8 9. Bd3": "Protecting the pawn.  Also, allows for short castle.",
        "9... Rf8 10. Qh5": "Was tempted to do Qe3, but this puts more pressure on the king's castled position.",
        "10... Qf6 11. O-O g6 12. Qh6": "Only real move here.",
        "12... Rf7 13. Bg5 Bf8": "So, now to trade queens or not too.  Again, if I control the moment of exchange, I can use it to my advantage.",
        "14. Bxf6 Bxh6 15. e5": "Now my bishop is locked into a very nasty space for black.",
        "15... Nc6 16. Nc3 Be6 17. a3": "Spending a temp to prevent Nb4",
        "17... Nd4 18. Nb5": "Offering a knight trade.  ",
        "18... Nc6": "?  Why move to Nd4 then waste it by moving back Nc6?  ",
        "19. c3": "Setting up a post for my knight on d4",
        "19... a6 20. Nd4": "Now the knight trade is force, for if he doesn't take then I will take his or take the bishop on e6.",
        "20... Nxd4 21. cxd4": "So, looking at things now.  I have a passed pawn on e5, very aggressively placed bishop on f6, solid castle position, and a pawn up.  Need to keep building the pressure.",
        "21... g5": "This needlessly weakens the already weak king side.  Better was b4 followed by c5, attacking the base of my pawn chain.",
        "22. Rac1": "? \n\nWasted move.  g4 threatens my rook, and there is no threat on the pawn on c7.",
        "22... c6 23. b4 a5": "?\n\nHe needed to push b5 first to prevent me from pushing the pawn.",
        "24. b5 cxb5 25. Bxb5 g4": "Now g4 is played.  Have to move the rook",
        "26. Rcb1 Bf8 27. a4": "Set up a post for my bishop and block his pawn's further advance.",
        "27... h5 28. f4": "if 28. ... gxf3 e.p., then 29 Rxf3 with a very strong king side attack to follow.",
        "28... Rh7 29. Bd3": "Cornering in the rook.",
        "29... Rh6 30. Bg5": "Only one square for the rook to go too now.",
        "30... Rh8 31. Rxb7": "Take the hanging pawn, and seize the 7th rank.",
        "31... Bh6": "??\n\nthis boxes in his rook at h8.",
        "32. Bf6 Bc8 33. Rc7 Ba6 34. Bxa6 Rxa6 35. Bxh8 Kxh8": "Now it's time to push the two passed pawns, but 1st....",
        "36. Rb1": "threaten a mate.",
        "36... Kg8 37. Rb8+ Bf8": "pin the bishop",
        "38. Rcc8 h4 39. Rcxf8+ Kg7 40. Rfg8+ Kf7 41. Rxg4 Rh6 42. f5": "time for the charge of the light brigade.",
        "42... h3 43. Rb7+": "the h pawn is a non-issue.",
        "43... Kf8 44. f6 hxg2 45. f7": "Missed a mate in 2 with 45. Rg-g7.  As it is now, white has a mate in 4.\n\n45. ... Rg6 (if Rxg6 draw) 46. Rh4 Rg5 47. Rh8  Kg7 48. f8=Q  Kg6 49. Qf6  ",
        "45... Rc6 46. Rg8#": ""
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=8647",
    "gameName": "Let's play chess",
    "players": "kwijybo (1454) vs. bonnernose (1382)",
    "opening": "Petrov (C42), Damiano variation"
}