{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Bb5 f5": "The Schliemann Defence, never encountered it before in all my Ruy Lopezing, not even sure if I've spelt it right! An interesting reply, but seems destined to lose to White by force. Let's see....",
        "4. d3 Nf6 5. exf5": "Castling may be the leading move in the world database but I've learned that the R-L can be cramped if one does not stay proactive. Additionally, with 5 O-O fxe4, Black can begin to dissolve away the centre and leave the board a mess. This opponent did similar with the Alekhine before they stumbled into a blunder field and handed Tips an easy victory. Not going to give Black that opportunity a second time! (Opportunity to leave the board a mess, the opportunity to stumble into a blunder field I shall keep wide open! :) ) Finally, I'm not sure Black is good enough to recover that pawn it just sacced with its choice of 4....Nf6. We'll soon find out! ",
        "5... Ne7": "Black relieves the pressure on its knight and makes a play at the errant pawn. Back in my wild gambiting days I learned if an opponent tried to retain the pawn gain it can oft tie itself into knots or over-extend its forces. White declines, then, Nxe5 (after some pause) as   Black would gain a knight pairing in exchange for White's 2 officers being far in front of the rest of its forces and a single pawn in material. Though admittedly Black would have no pawns operating forward of the 7th rank. None the less, Nxe5 is ignored in a multitude of R-L lines for good reason and I'm unconvinced those reasons are sufficiently overturned in this novel opening. ",
        "6. Qe2": "Instead, then, White chooses to continue with development, territorial claims and aggression ....whilst also making it harder for Black to recover its gambited pawn (gambited is a word dammit). Yet White's forces are also beginning to link up instead of being over-extended. In the end, with 6 games on the World database and 0 on the gameknot, this is frontier R-L territory so time for Tips to trail blaze! (Especially  since this match is potentially eligible for the GK database! :) ) Allons-y!",
        "6... c6 7. Ba4 d6": "So Black can recover the gambited pawn but it is going to lose tempo in doing so. This is part of why I no longer favour gambits. ",
        "8. Nc3": "Strong developmental move for virtually free. Yes White is developing its own bishop but f5, though an okay position for the bishop, is not the best. Plus I shall develop a bishop of my own in return and ask some questions of Black. ",
        "8... Bxf5 9. Bg5": "Question asked.",
        "9... Qd7": "Though it sets Black up for castling, not the best answer. Black perhaps expected White to castle or push on with the exchange but my rule with the R-L is simple, \"Don't move your bishop till you need to.\" ",
        "10. Ne4": "Running other lines, I realised the ....e4 movement could become a problem. In devising ways to counter, I realised this gem, possible due to the lavish tempo Black handed me with the (forced?) recapture of the gambited pawn and then the pre-castling move too early. Any advantages of clearing out the qside and putting Q and lcb on same diagonal are erased through the pressure about the e4, e5 and f6 squares that White is exerting. Piece coordination is the key to good chess and here the knight pairs, d pawn, Queen and dcb are all combining for some heavy pressure on the centre. With that pressure coming from knights, Blacks better pawn structure is compromised and about to become a liability if Black is not careful. This is quickly becoming the R-L at its best; with quickly developed officers threatening to wreak havoc on Black's over-extended lines. ",
        "10... Nfd5": "Exchange bishop for knight then castle seems the leading line here but there is temptation to chase that pony. Unlike in the Alekhine, the pursuit of Black's knight with pawns would develop White's position instead of leaving the board a mess. ",
        "11. c4": "Ah screw it. Does introduce some turmoil to the board but what's life without a little turmoil? :) GERONMIO! ",
        "11... Nb6 12. Bb3 Ng6": "Perhaps, in retrospect, exchanging at f6 or e7 was the preferred move since Black has now uncoiled its position to have those knights as sentinel on both the king and queenside flanks. The downside, for Black, is that those knights will find it hard to co-ordinate so far away from each other. I had previously mentioned the essence of the R-L was to develop officers quickly then hit an over-extended line. 13 d4, then, is perhaps the favoured line as gets the exchanges going. But this is an atypical R-L, demonstrated by the fact White hasn't castled AND has the option of castling both sides. As such there are options aplenty: a4 threatening to push the Black knight into retreat, B/Nh4 tempting an exchange, O-O, O-O-O, Be3, h3 all beckon as White's lucky 13th move. Much analysis required! ",
        "13. O-O-O": "So why this out of all those vaunted possible moves? Well I could just use rmannstaedt's saying, \"If in doubt, scream and shout, or alternatively, castle.\" :) But let's go through those options one by one.  \"a4 threatening to push the Black knight into retreat\" comment: why retreat a piece that can't move forward? Let it stay and act as a bulwark to its own forces. For, in time, those same defensive walls that provided shelter in the early middle can become the walls of an opponent's tomb by the late middle or endgame.\"B/Nh4 tempting an exchange\" comment: my knight and bishop are co-ordinating and are threatening to a much greater extent than Black's knight on g4. Choosing to exchange here, then, would suit Black better than White.  Be3 exposed, through analysis, that Black could attack the backwards pawn on d3, with a doubling on the d file if allowed to castle long. Once that was exposed O-O-O or Rd1 became favoured over O-O. h4 was also tossed out on its arse for keeping the h3-g4 combo alive. Rd1 was ditched as I didn't want to move my rook off h1, meaning that putting the king (eventually) onto b1 was preferable to having it sandwiched betwixt the 2 rooks. O-O-O, then, provided needed support on the d file, opening the possibility of pawn to d4, whilst allowing the king to get over and support the a pawn. Lots of analysis but necessary when you've got so many seemingly good moves. That concludes this lesson of how Tipsy uses the process of elimination to find the best of a seemingly good bunch. :)",
        "13... c5": "Clever move by black, attempting to keep the backwards pawn exactly that. Now the bishop/knight's coordination shifts from money in the bank to money which needs to be spent. The f pawn needs to be freed up for an attack on e5, in turn releasing the d pawn from its box. Otherwise White can be cramped up. ",
        "14. Nh4": "White invites an exchange, setting up for g3-f4 but needs to be wary of cutting off the bishop's escape squares with its own pawn movements. ",
        "14... Nxh4 15. Bxh4 Be7 16. Bxe7": "Rather than risk complications involving Black's kingside pawns, with support from the dcb, coming down the board to cramp the kingside and White's officers, White goes for simplification. ",
        "16... Qxe7": "Basically, from my perspective, White has now gained degrees of freedom on the kingside where previously it was looking in danger of being severely cramped. White considers g3-f4 sequence but: 17.g3 g5 and now White faces the exact same problem on the f4 square as it does on the d4. In addition White is looking cramped again. ",
        "17. Ng3": "Instead, White asks a little question of Black. With lines worked out for the g6 or Qf7/e6 support movements, White is prepared to further simplify on the kside as its pawn majority on that side should be telling over time. Black can retreat the bishop but White has plans for that as well. In the very least, a bishop retreat yields more space to White, allowing it to finally uncoil on the kside. Not bad considering how cramped it looked previously. And, of course, there's always the chance Black will stuff things up completely in the coming set of exchanges/ensuing retreat though unlikely. They are playing with more poise this game it seems. ",
        "17... Bg6": "Ah crap. So obsessed with the bishp retreating along the h3 diagonal I completely and utterly missed this glaringly obvious move. Kingside advancement is stalled and (I've just noticed) the checking diagonal is also open. Qc2 post haste for Ba4+ seems the order of the day, emergency movement on the qside. Less drastic options involve Qe3 or something else. Returning the knight to it's previous position may also be an option, tempo wasting as it is, to avoid being hampered later in the game by that knight sitting in front of the pawns. ",
        "18. Ne4": "Well there's one thing, now g4 is an option as Black has cut off g5. So, if that move can be effected, this hasn't all been for naught. ",
        "18... O-O 19. Rhf1 Nd7 20. g3 Nb8": "Hmmmm. I was certain Black had move their knight to d7 in order to get onto f5 and really exert some force around the centre-kingside. Since it seems unlikely they are manoeuvering to post their knight way out on a6, their goal may well be Nc6. From Nc6 it could leap to that troublesome d4 square. And a knight there could become a real knightmare! Ba4 is the reply if I believe 21...Nc6 is to be avoided. The downside for Black of their plan is the 3 movements of the same piece. In the 2 moves it will take to get their knight to its destination, can I concoct a competent counterplay?  ",
        "21. Ba4": "The answer is no. The end of the day I've been agitating for f4 so I can knock out the e5 pawn so I can advance the d pawn to catch the cat that ate the rat who chewed the fat in the house that Tipsy built! With Nc6 that entire plan goes south and the d pawn remains stymied. It's been a long time since ol Tips has seen an endgame; it has been a string of victories distilled from early or high middle games of late. In the last endgame I played it was a loss brought about by, you guessed it, a stymied backwards d pawn facing a very similar killing zone that we have here in this game. I will not allow some sneaky knight movement to condemn me to the same fate! (Incidentally there is also a potential trap here for Black, but I'll discuss that if it looks like being set.) ",
        "21... a6": "Ok, but having set up for Nc6, Black was probably better continuing with their plans even though I had prepared for them. Here they might be manoeuvering for better pawn structure on the qside, or perhaps they think I'll fall for 22...b5 23. cxb5 axb5 24. Bxb5 Ra2 but if so they are living in optimism. ",
        "22. Qg4": "22.f4 exf4 and now a discovered pin on the knight, so getting Q off the e file and over to where I want to make action on the kingside. This middle game is becoming quite enjoyable, both highly tactical and positional. ",
        "22... b5": "Now, remember that trap I mentioned at 21. Ba4? Here it is being set (with a smaller snare already sprung), if 23. cxb5 axb5 24.Bxb5 Rxa2??? 25. Bc4!! and adios to Black's rook! (Admittedly the net gain in material will only be +2 after all that, but the imbalance in rooks could well have great significance come the late middle or endgame.) The smaller snare is that Black has dropped a pawn with the 22...b5? movement. As previously mentioned, Black would have been better off following through on their intended Nc6 movement as their 21st move. FINALLY, Black has put a foot wrong. It is only a stumble but in such an even contest that little stumble might be all the yield I require to eventually cause Black to fall! ",
        "23. cxb5 axb5 24. Bxb5 d5": "Ah, good move! So Black isn't going to give up 2 in material and leave a rook imbalance after all. ",
        "25. Nc3 Qb7": "This is a delicate position: the knight on c3 is tasked with protecting both the a pawn and the bishop on b5. Yet it is vulnerable to a pawn on d4. Meanwhile Black has problems with the Qe6+ move that results in removal of the e5 pawn. Black has gone with a bold, aggressive sequence of moves here to try and overload Tipsy's tactical ability. If this were an OTB position it would be spellbinding. BUT, with 10 days per move, good ol Tips can sit back and play through the variations. Tactical calculation is much easier than strategic appraisal so that all Tipsy should need, in theory, is time. Time and scotch! :) ",
        "26. a4": "With the impending threat on the knight and the present threats on the a pawn and bishop, this elegant movement allows bishop and pawn to mutually support each other, relieving the knight of its double burden of having to support said pieces. Mobility has been restored to the knight; a prize far more valuable than Black's e5 pawn. \n\n{For those playing at home these were the main lines analysed and my appraisal: \n26.\tQe6+\tBf7\n27.\tQxe5\td4\n28.\ta4\tdxc3\n29.\tbxc3\t\n\nBlack is back to parity. \n\n26.\tQg5\td4\n27.\tBc4+\tBf7\n28.\tNb5\tBxc4\n29.\tdxc4\tNc6\n\nWhite remains a pawn ahead. But the line is dull. \n\n26.\ta4\tKh8\n27.\tf4\texf4\n28.\tRxf4\t\n\nFar more interesting. White retains its pawn advantage. }",
        "26... Kh8 27. f4": "By my calculations, exf4 is forced. Whilst the pawn movement, setting up for an attack on the Bishop, (28. gxf4) may look enticing, introducing the immediate threat of mate with Rxf4, and again with 27. f4 exf4 28. Rxf4 Rxf4 29. Qxf4 puts Black under some mini pressure, whilst also putting the Queen into a powerful position. By now, if you've followed my games, you'll realise my middle is all about continually asking questions of an opponent until they find themselves without an answer. ",
        "27... Qf7": "Black has unleashed a dashing move: 28 fxe5 Qxf1 29 Rxf1 Rxf1+ and Black has won 2 rooks for 1 queen, getting themselves back to parity through force. Magnificent! On the surface, it may be hard to see counterplay for White. With this movement, Black has exceptional piece coordination: look at how the knight is guarding c6 AND d7, the bishop f5 and how about that doubling up on the f-file? However, when it comes to doubling,  two can play that game (pun intended :) ) : 28. Qf3 is most enticing. Either way, this has been a most enjoyable middle, with more yet to come! \n\n",
        "28. Qe2": "So, Qf3, under analysis, was terrible! 28.\tQf3\texf4 29.\tgxf4\tBh5 and Black is back into the game! Qe2 provides no such counterplay to Black whilst opening up options for White. ",
        "28... e4": "Black has overplayed their hand: \n\n29. dxe4 dxe4 30. Nxe4 and he's dropped another pawn.\n\nIf 29. dxe4 d4 30. Nd5 he's still dropped a pawn. Etc. Multiple lines, all in White's advantage. In all of them Black drops a pawn. \n\nI once again applaud Black's open aggression and attempt to unseat the Tipsy, fortunately White on this occasion was good enough to turn aside Black's cuts and thrusts. Now, for the riposte! :)",
        "29. dxe4": "I'm curious to see how Black miscalculated this position. Their next move may reveal their error, or they'll realise their mistake now, too late, and seek to mitigate. Given the aggressive nature of their previous moves, unlikely! ",
        "29... d4 30. Nd5 Qb7": "I was correct that Black would continue with their aggressiveness but they are simply opening up their position and allowing the material majority to take effect. White can roll up that kingside and, ultimately, wrap up the match. But first, White may wish to connect the and b pawns (in turn connecting up the the bishop) to ensure there is way for Black to break through on the queenside. ",
        "31. b3": "It was hard to split betwixt 31. b3 and 31. f5 with potential similar positions. And I have won so many times, of late, by asking a little question of the opponent; f5 achieves this, b3 doesn't. But, aside from hiccuping up some material through miscalculation of a sharp line, Black has played with a more pronounced solidarity than our first meeting on the black and white battlefield. Indeed, that hiccuping of material does serve as a reminder that aggression too early, before one's pieces are all in position, will undo even a savvy player. I can see no glaring flaw in f5 but I simply do not feel I am ready for kingside aggression, that work needs to be done locking up the qside, especially with so many of Black's heavies facing a comparatively thin White line. With 31 f5 Be8 32 Bxe8 even less material is left qside so, for my own peace of mind, the consolation before conquest. \n\n(And I used to be such a dashing, devil-may-care player! But then I used to also be 1300 :P) ",
        "31... Nc6": "I expected that, but after 31...Be8/7 where Black hurries the bishop away from the threat on f5. Might simply end up an almost equivalent position, instead of say, 31.b3\tBf7 32.Qf3\tNc6 we see instead 31.b3 Nc6 32. f5 Bf7/8 33.Qf3 but, then again, maybe not. I feel a miscalculation. My Tispy senses are tingling though that could just be because my glass is running low. I shall refill, analyse and see what there is to see....\n",
        "32. f5": "Well at any rate, this is obviously the best next move. I'll see whether Black withdraws to f7 or e8 since there's no point wasting time analysing two distinct lines. ",
        "32... Bf7": "Hmm I said before I sensed a miscalculation and I may be right. The problem is the miscalculation may be mine. :P Back at 31. b3, by shoring up that queenside before going after the bishop I may have handed Black tempo which they used to get the knight into the c6 position: setting up for the powerful Ne5. Black has handed back the tempo with the need to move their bishop but now, for example, Qf3 places the queen in danger after Ne5 and suddenly tempo is handed back to Black as I move the queen twice in succession. The simple solution to this problem, of course, is 33.Bxc6 which 31.b3 makes possible. There are actually a lot of moves here for White, this could prove the difference between consolidating that 2 in material and moving onto victory or Black returning to parity, or worse. Time to think music....",
        "33. Bxc6": "I went nuts over the different lines, but, then I simply reminded myself of a very simple rule in chess: when in front, exchange down all the way. You'll win in the end game. ",
        "33... Qxc6 34. f6": "I did consider Qb5 here but there is no guarantee of an exchange and it drags the most powerful piece on the board away from both the centre and the site of action. Continuing on the mantra of exchanging all the way, White virtually (by my calculations) forces a pair of exchanges here, 34...Bxd5 35 exd5/fxg7+ (haven't decided which of those I prefer) causes exchanges all over the place! So, now, I'm happy with my 31.b3 move as I can leave my thin White line intact on the qside, king safe as houses despite its seemingly open position, whilst Black has to deal with all sorts of problems on the kingside as its seemingly solid fortress gets torn asunder. GOD I LOVE CHESS! :) ",
        "34... g6": "...you know. Every now and then. I forget pawns can avoid battle like that. :S Still, I recently commented in one of Joe's annotations about pawns that can become satellites, sitting high up in space, unassailable, they can ultimately win the war. The pawn on f6 could become most telling in the end game. So, instead we'll concentrate on keeping the pawn on e4 in our hands. ",
        "35. Qf3": "Protects exd5 if Bxd5, doubles up on the f file. Sound move. I hope. :P",
        "35... c4": "Sharp! Very sharp! This whole game has been sharp from the batman and they are continuing in their aggressive vein. Raise a glass, ladies and gentleman, this is attacking chess at it's best. I've had enough, myself, of playing it all with a straight bat (pun intended). Time to raise the stakes again, I'll concede the discovered check and passed pawn on the 6th rank for ultimate positional and tactical gain. After a fair chunk of my Saturday spent on analysis, I concluded that pawn will not promote. Black just doesn't have the material to get it over the line. We'll soon find out if I'm right! :) ",
        "36. Rxd4": "Here we go! 36...cxb3+ 37. Nc3 opens the d file and closes the book on any legitimate threat on the king/attempt to promote. I hope! :P",
        "36... cxb3+ 37. Nc3 Qc5": "Well, that was probably unexpected though it has been some time betwixt my last move and this annotation, so I may have expected this and forgot about my reply!  With the inevitable 38...Qa3+ after I do something to ensure I don't lose my rook with my own 38th move, Black is setting up to capture the h pawn it seems unless it tries to crack open the Qside that I am so sure is locked down. The interesting thing about this line is that, maybe, against normal chess theory, I may want to encourage the Q on the 7th rank and falling upon my kingside pawns. Like a lobster trap, perhaps once the Q ends up way over on the kingside and in my back rank, it will find itself unable to come out the way it came in and thoroughly trapped!  ",
        "38. Rd7": "Whilst I flirted with Qd3, this movement continues the aggressive trend of the late middle and also, effectively, forces Black into making the move I wanted them to move in the first place: Rxa4. Oh, sure, Black could still opt for the Qa3+ but the continuation that sees its Q taking the h pawn becomes even more fraught with danger than the lobster trap scenario posited earlier. Instead of containment round the Q, instead White could focus on counterplay on Black's king and threaten to deal a mortal blow. White now has the game back on their terms instead of constantly reacting to Black's aggression. ",
        "38... Rxa4 39. Kd2 Rc4": " ...or not. I initially dismissed this line as trivial: superficially it looks like an empty threat from Black; if Black captures the knight it seems a pointless rook sac and Black goes to -4 in material.  However that is far from the truth.  (I'm on my ph so can't post my lines but why don't you give it a go? ) White is again forced into fighting withdrawal as I couldn't find any move other than Rd3 which didn't end in disaster! White  is slowly, steadily, being outplayed. But, through luck, they are still a pawn up. If White can get its King out of jeopardy and double or triple on the d file, or force Black to simplify, they may just fall over the line. If.",
        "40. Rd3 Rc8 41. Qe3 Qa3": "White, through maximum defence, has now a chance to try and at least tempt Black to \"simplify\" 42. Qh6  Qf8 and the ladies take their leave. 42 Qh6 Qb2+ 43. Ke1 Rg8 44. Qd2 and the Qs face off again. But no guarantees that Black will agree to the exchange. We'll soon find out!",
        "42. Qh6 Qb2+ 43. Ke1": "43...Rg8 is essentially forced here. ",
        "43... Rg8 44. Qd2": "Face-off",
        "44... Qa1+": "Exchange declined again. But, where is Black going with this? 44.Kf2 b3 perhaps? There are only many times he can sensibly decline the exchange or sensibly check the King before he actually is going backwards. That, from a position where I believed Black was (slowly) outplaying White. ",
        "45. Kf2 Qa7+": "Well, case in point. Getting the K away from the hotseat seems the favoured course here and that pointless(?) check gives White a free move to sneak into g2 or f3 OR to once again face the Ladies off. ",
        "46. Kg2": "No checks for you! NEXT! Black has generously played White back to parity in position. I have the bonus pawn but we shan't really count that for now as a recent consultation game in Tipsy's Place has shown that even a material of advantage of +4 can still result in a draw. ",
        "46... Qc5 47. Rf2 Qe5": "Black is now simply electing to wheel and manoeuvre, hoping to find a weakness or some unlikely way to promote its pawn. White can keep its pieces from denying Black this objective, but, at the same time, will be so occupied in keeping Black at bay, won't ever have the chance to mount an attack on Black's king or promote the f pawn. I said Black has generously played White back to parity, from here I can't see either side being able to tip the scales. And so, I might have to do what Tipsy seldom does. Offer a draw. ",
        "48. Kg1": "Draw offer made. ",
        "48... Qc5": "Draw offer declined. ",
        "49. Kg2 Qe5": "??? The Bat is just setting this up for a 3 fold declaration? What the heck is the point of that? Why not just accept the draw when it was offered? ",
        "50. Kg1 Qc5 51. Kg2": "Draw declared. Curious and bemusing end. However it was a most engaging, delightful game that had Tips harnessing all his chess powers just to stay in the game and on parity with his opponent. In the end that little mistake by Black was telling; doubtful I would have been able to force this into a drawn scenario had Black just one more pawn to play with! In particular I was pleased with my own ability, though clearly, at multiple times, I overestimated the strength of my position, once I felt the tide turning against me, I was able to coordinate my pieces into a cohesive defence and resist the ocean itself. Great game! Bravo both sides! "
    },
    "url": "https://gameknot.com/annotation.pl/lets-go-again?gm=59963",
    "gameName": "Let's Go Again!",
    "players": "tipsyjourneyman (1623) vs. batman44600 (1704)",
    "opening": "Ruy Lopez (C63), Schliemann defence"
}