{
    "moves": {
        "1. e4": "King-side Battle!",
        "1... e5 2. Nf3 Nc6 3. Bc4 h6": "?!",
        "4. d4 Bd6": "something fishy was seemed here, but i could not understand. Later after finishing the game, Computer suggests d5 ... Nb8",
        "5. Nc3": "developing to prepare the attack.",
        "5... Nf6": "but Black seems more close to Castle, that's not good. I must do something to hang the Black King in center.",
        "6. dxe5 Bxe5 7. Nxe5 Nxe5 8. Bb3 d6 9. O-O Bg4 10. f3 Bh5": "as i was already thinking to forward the f-pawn, driving away black pieces and opening the lines as Black King is still in center ... but after 9 ... Bg4 my Kingside pawn invasion is automatic with tempi ...",
        "11. g4 Bg6 12. f4 Nc6": "Critical Position. I want to forward the pawns, but calculation is not successive without the Queen support. Qf3 and Qe2 was under consideration. Qf3 was coming under-attack of Knight Ne5 while Qe2 was inline with Black King!",
        "13. Qe2 h5": "?!",
        "14. g5 Ng4": "? Mistake. Knight is trapped!",
        "15. h3 Qd7 16. hxg4 hxg4": "Black got the passed pawn, but it is endangered species.",
        "17. f5": "further invasion! and smothering the bishop.",
        "17... Bh5": "Black bishop is supporting the pawn, but its scope is totally reduced, Black got the h open file, but again this bishop is hindering.",
        "18. Nd5": "idea: making the piece active, kingside is looking so expanded so coming to the kingside for support as it was already useless to queenside! threatening to Nf4 and attacking trapped bishop.",
        "18... Ne5 19. Kg2": "as Knight was threatening Nf3 check, plus clearing the way for Rook to h-file. and another theory: coming to passed pawn for blockade.",
        "19... O-O-O": "ah! after all Black castled!",
        "20. Kg3": "No Hope for Black Bishop now!",
        "20... c6 21. Nf4 Kb8": "hm! avoiding the bishop pin at e6.",
        "22. Rh1 g6 23. Be3 Nf3": "threatening Nxg5",
        "24. Nxh5": "after the game, computer suggests. 24. Qc4 as i can take the bishop any time with my knight as clearing the way for my bishop to black knight if he take the pawn!\ncomputer var goes: 24. Qc4 if Nxg5 25. Nxh5 Rxh5 26. Rxh5 gxh5 and f7 pawn goes ...",
        "24... gxh5 25. c3": "clear the way for bishop backward and covering d4 square as black-squared bishop has to move.",
        "25... Rde8": "e4 pawn.",
        "26. Bf4 Ka8 27. Qd3": "d6 pawn",
        "27... Ne5 28. Qd4": "my further thoughts were Be3 threatening checkmate at a7 and a4 a5 moving pawn up. opening a file ... at this place. and also Rd1 to pressure the d-file.",
        "28... h4+ 29. Rxh4": "this move was played in hurry. but conditions favored me.",
        "29... Rxh4": "see Knight fork. one mistake and all over.",
        "30. Bxe5 c5 31. Qxd6": "forced!",
        "31... Qxd6": "computer suggests for Black: 31 ... Rh3+ if KxP the Reh8 hanging the Queen, but if White takes the Queen the R8h4 checkmate!",
        "32. Bxd6 Reh8": "trying to checkmate...",
        "33. g6 Rh4h3+ 34. Kxg4 f6 35. Bg3 Rh8h5 36. Rd1 a6 37. Rd7": "for supporting g pawn promotion.",
        "37... c4 38. Bxc4 Rh3h1 39. g7 Rg5+ 40. Kf3": "not 40. Kf4 as later Black can be checkmated by putting bishop at d5 and Rxb7 and moving the Rook away on 7th rank and checkmate. well it seems to away to apply BUT keep the options opened.\nWELL Black resigned as there was no hope!\nLesson: It is not always dangerous to expose the King-side.\nFollow the principles, But Play your Own ..."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=26792",
    "gameName": "Let's play chess",
    "players": "abro (1652) vs. piter949 (1475)",
    "opening": "King's pawn game (C50)"
}