{
    "moves": {
        "1. e4": "He played the traditional e4. El hace la apertura tradicional e4. ",
        "1... e5": "trato de hacer un juego similar. no ponerme a la defensiva. sino tratar de ocupar el centro como lo hace el . I do the same tipe of game.",
        "2. Bc4": "He is pointing my f7. Is attacking this square. Esta atacando el punto f7. en lugar de defender sigo atacando yo tambien. INSTEad of deffende, I attack the same. ",
        "2... Bc5": "Instead of defende I am doing the same to him or her. ",
        "3. Nf3": "Attacking my pawn. Esta atacando mi peon que esta en e5.",
        "3... d6": "In order to avoid him or her to grabb my pawn. Evito que coma mi peon. ",
        "4. d4": "Me amenaza el alfil. puedo sacarlo o comer su peon",
        "4... exd4 5. Nxd4 Bxd4 6. Qxd4": "es muy peligrosa la amenaza en el punto g2. very dangerous for the g2 point. or square. ",
        "6... Qf6 7. Qd3": "decide no darme la ventaja de movimiento. He decides not give to me a time of advantage in the develop of the knight. ",
        "7... Nc6": "I am developing. ",
        "8. O-O": "good decision. ",
        "8... Nge7 9. Qg3 Ne5 10. Bg5": "I am in bad situation.",
        "10... Qg6": "if he takes my knight with his bishop probably wins. ",
        "11. Bb5+ c6 12. Ba4 f6 13. Bh4 Be6": "that move was horrible from me. porque ese punto es debil al lado del peon debil y del caballo sin defensa en e2, me crea el centro mas debil de la historia. ",
        "14. Qa3": "pega justo donde mas duele. he is striking exactly where it herts.",
        "14... Qxe4": "trato de amenazar los dos alfiles al mismo tiempo para que no pueda comer. es un intento desesperado por salvar la situacion. ",
        "15. Bg3": "se libera de mi  amenaza y sigue amenazando mi punto debil en d3. my weak point in d3",
        "15... O-O": "trato de alejar mi rey del desastre que se viene en el centro mio. i am trying to save my king, from the inminent disaster",
        "16. Nc3": "brillante. estoy perdido. no tengo donde ubicar mi dama I am lost I have no place to my queen. ",
        "16... Nf3+": "perdido por perdido doy jaque. es un intento deseperado por sobrevivir. con la dama atrapada, que tiene que empezar a escapar por todo el tablero y el centro debil. no me queda otra que dar jaque. if I am lost. why not a chek.",
        "17. gxf3 Qxf3 18. Rae1": "para que hizo eso. perdio un tiempo vital. esa fue su derrota. tenia el partido ganado. perdio solamente un tiempo. que le costo el partido. no tenia sentido asegurar el ataque que ya estaba ganado. ",
        "18... Bh3": "no puedo perder tiempo. aprovecho el ultimo recurso",
        "19. Bb3+ d5 20. Nxd5 Qg2#": ""
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=2377",
    "gameName": "Let's play chess",
    "players": "bobodano (1200) vs. miperralaica (1200)",
    "opening": "Bishop's opening (C23), Classical variation"
}