{
    "moves": {
        "1. e4": "I usually avoid e4 because it often leads to e5, which I think is often boring, but this time the response was the Sicilian Defense, which is one of the more interesting openings out there.",
        "1... c5 2. Nf3": "the traditional response",
        "2... e6": "a line that I haven't seen before.  I'm sure that it has a name and a following, but from here on out, I'm out of book, which is probably exactly what Black wanted.",
        "3. d4": "White tries to follow the book moves anyway",
        "3... d5 4. exd5 exd5": "Opens up the e-file, which at this point is probably not an ideal situation for either side, but since White has the tempo, black in is even more trouble.",
        "5. Nc3 Nf6 6. Bg5 c4": "Locking down the queenside and hampering development by White's light-squared bishop.",
        "7. Qe2+": "Developing with check and preparing 0-0-0, though it does lock down the White bishop for the forseeable future.",
        "7... Be7 8. O-O-O O-O": "Both sides have castled, white has better development and better center control while black has slightly more space and much more secure King position.  I give white the slight edge right now, despite the hampered bishop.",
        "9. Re1 Bb4": "Bb4!  While it might not seem all that great off hand, it completely compromises White's king position.  White has no way to prevent the trade and no way to take the back on c3 without compromising the attack or severely weakening the King.",
        "10. a3 Bxc3 11. Bxf6": "Bxf6?  Almost certainly not the best move.  It allows black to win the b2 pawn and develop his queen with tempo while pointing her straight at the even weaker king down the a1-h8 diagonal.",
        "11... Bxb2+ 12. Kxb2 Qxf6 13. g4": "g4??  White tries to weaken Black's king with a pawn rush, but neglects the bishop on c8.",
        "13... Bxg4 14. Bg2": "White finally moves the bishop, but it is still doing no good doesn't appear that that will change in the near future.",
        "14... Bxf3": "Removing the defender of d4 so that the Queen can access the King.",
        "15. Bxf3 Qxd4+ 16. Kb1 Nc6 17. Red1 Qb6+ 18. Kc1 Nd4": "Nd4???  Black wins with the simple c3.  White has nowhere to go and no way to prevent Qb2.  However, black was to caught up in trying to trade pieces down because of his three pawn advantage to see that he had a mate.  This is another reason why the \"guidelines\" in chess are often meant to be ignored.  It is much more important to see the position than it is to memorize catchy little sayings about Knights on the Edge...",
        "19. Qe3 Nxf3 20. Qxf3 Qa5": "Now black threatens to push the pawn to c3 again.",
        "21. Rhg1 c3": "Black has mate in two now, but white must give him the time to do it, which he White has no intention of doing.",
        "22. Rxg7+": "Black still has a way out with Kh8.  However, grabbing material is so intuitive, he can't resist the hanging rook.",
        "22... Kxg7 23. Rg1+ Kh8": "if Kh6, then Qf6, Kh5, Qg5  .",
        "24. Qf6#": "The moral of the story, as much fun as catchy phrases about chess are, the thing to remember is that they are only helpful hints, not rules that are set in stone.  Make your moves in response to the position you are in, not the cliche advice of someone you've never met."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=7499",
    "gameName": "Lets play chess",
    "players": "jamesxc (1437) vs. howler68 (1386)",
    "opening": "Sicilian (B40), Marshall variation"
}