{
    "moves": {
        "1. d4": "Hi, everyone! Here is another game I played at my local chessclub. Though the  end result was a draw, it was a really exciting game. My opponent got the advantage in the opening, but then I surprised him with a daring combination, temporarily sacrificing two minor pieces and eventually even getting a slightly better postion. Have fun!",
        "1... d5 2. c4 e6 3. Nc3": "Straight from the book.",
        "3... Nf6 4. Nf3 c5": "Now we're entering the Semi-Tarrasch defence. Black is immediately putting pressure on the d4 square.",
        "5. e3": "Another possibility is 5.Bg5, but I like playing the move e3 in these positions, so the light squared bishop can go to d3 and maybe fianchettoing the dark squared bishop to b2. Notice how symmetrical the position is.",
        "5... Be7 6. cxd5 exd5 7. Bd3": "This bishop is now aiming at h7, wich will become vulnerable to attacks when black castles kingside, as we're about to see in this game.",
        "7... Bg4": "Black plans to play Nc6 soon, increasing the pressure against the d4 square.",
        "8. b3": "I wanted to prevent the black c-pawn from moving forward to c4. Also this move  enables the fianchetto. ",
        "8... Nc6": "As expected. Black is now threatening to win a pawn with 9. .. cxd4 10.exd4 Nxd4.",
        "9. dxc5": "Now black has an isolated pawn on d5, and the b2 square is an even stronger outpost for white's dark squared bishop because of the increased scope on the a1-h8 diagonal. ",
        "9... Bxc5 10. Qe2": "?! This weak move proved to be very important in this game. I think 10.Be2 would have been better, releasing the pin on the f3 knight, but instead the text move keeps the pin and gives black the opportunity to take advantage of this by playing knight to e5. But as we're about to see, the diagonal d1-h5 will prove to be very prolific for the white queen...\nThe actual reason I played this move was to stop black from playing 10. .. d5, but my opponent later told me he wasn't even planning on playing that move:) ",
        "10... O-O": "Forcing white to castle too, or 11. .. d5 does become a threat, because of the vulnerable position of the white queen on the e-file.",
        "11. O-O Ne5": "As expected.",
        "12. Rd1": "! Another important move of the game! The main purpose of this move is to anticipate the attack of the black bishop after 12. ... Nxf3  13.gxf3 Bh3. But there's more...",
        "12... Nxf3+ 13. gxf3 Bh3": "Now the white king is in a very vulnerable position.",
        "14. f4": "! This move makes a nice but also tricky combination possible.",
        "14... Qd7": "Unaware of what's about to come...",
        "15. Nxd5": "! My opponent looked at the board with a puzzled look on his face as I sacrificed  my knight...Let the fun begin!",
        "15... Nxd5 16. Bxh7+": "! Now an even more puzzled look and people around us we're checking out the position on our board...",
        "16... Kxh7 17. Qh5+ Kg8": "My opponent spent almost twenty minutes before making this move! Ofcourse there is only one move for black, but he wanted to make sure he had analyzed the position correctly after his 18th move!",
        "18. Rxd5": "! Ofcourse! White wins back the piece since both black bishops are under attack! Notice how this was all possible because at the 10th move, the white queen 1: stayed on the d1-h5 diagonal and 2: cleared the d-file for the rook! \nSo I guess I made the best of a weak move? Well, black's 18th move has still to come...",
        "18... Qc6": "! Nice! The rook is pinned because of mate on g2. ",
        "19. e4": "Giving the rook some extra support and blocking the diagonal for the black queen, but unfortunately 19... Rfd8 is pretty much winning now.",
        "19... Bxf2+": "Lucky for me my opponent didn't see the winning move! Black decides to give back the piece, but like a kami-kaze pilot the bishop at least grabs a pawn and exposes the white king some more.",
        "20. Kxf2 Qc2+ 21. Rd2 Qc3": "Black defends his bishop and attacks the rook on a1. He's a pawn behind in material.",
        "22. Rb1 Rfd8 23. Qe2 Qf6 24. Qf3": "The white queen is quite strong on her favourite diagonal of this game. (d1-h5)",
        "24... Qh4+ 25. Qg3 Qxg3+ 26. hxg3": "Though I was a pawn ahead I still decided to offer a draw, because in such an open position I didn't think it would've been enough for a win.\n\nI hope you enjoyed the game as much as I did!\nBye,\n\nSarasani"
    },
    "url": "https://gameknot.com/annotation.pl/level-every-angle-q-g-d-semi-tarrasch-defence?gm=6912",
    "gameName": "Level Every Angle! Q.G.D. semi-Tarrasch defence.",
    "players": "Sarasani (-) vs. J.B. (1695)",
    "opening": "QGD (D40), Semi-Tarrasch, symmetrical variation"
}