{
    "moves": {
        "1. e4": "Hi everyone!\r\n\r\nAs part of a drive to do some further homework on Master Freddy, I thought I would look up some closely fought battles between him and players near his own rating.  I thought I would start with this one, which sadly was a loss for Freddy and try and see the purpose behind the moves and to spot any possible tactics and potential tactics in the position as the game progresses.  Hope you have a good read.  Freddy kicks off with e4 and his opponent responds with the Sicilian, c5.",
        "1... c5 2. Nf3 d6 3. d4 cxd4 4. Nxd4": "4. Nxd4 - all standard Sicilian moves.  Black now moves his knight to f6 and Freddy leads the development race by moving his knight to c3.",
        "4... Nf6 5. Nc3 a6": "5. ....... a6 - the Naijdorf - this little pawn push prepares another pawn push to b5.",
        "6. f3 e5": "6. ......... e5 - the pawn push comes down the centre though, and Freddy now chooses to retreat the d4 knight to b3.",
        "7. Nb3 Be6": "7. ....... Be6 - the potential for taking the knight on b3 and doubling up white's queenside pawns.  His opponent eschews this for the movement and gets on with his development with Be7 after Freddy continues with his development by putting his dsb on e3.",
        "8. Be3 Be7 9. Qd2": "9. Qd2 - Freddy clears the decks to prepare for queenside castling.  Hmm, what do we have here?  Castling on opposite sides?  That seems to be standard practice in the Naijdorf and Dragon Sicilian.  This usually leads to pawn storms on both sides.  Who will cop Old Matey first I wonder?",
        "9... O-O 10. O-O-O b5 11. g4 b4": "11. ....... b4 - here come the mutual pawn storms.  Freddy must now move his knight.  He chooses d5 as it is the most aggressive square and at least there are no pawns to drive it away.  This will trigger off an exchange though.",
        "12. Nd5 Bxd5 13. exd5": "13. exd5 - Freddy's pawn looks a little vulnerable on this square.  In my game Six Feet Under, my former IM opponent took advantage of this weakness.  I think Freddy is rather glad to see the back of black's lsb though.  It is very instructive to see how Freddy covers this weakness on d5.",
        "13... a5": "13. ...... a5 - oh, oh, Master Albertwall now sends the a pawn down to plague Freddy's other knight.",
        "14. Kb1": "14. Kb1 - this king move is also pretty standard.  It gives Freddy the option of moving his soon to be attacked horsie to c1 rather than completely on the rim on a1.  In the Sicilian Dragon or Naijdorf the c pawn is vulnerable to a pin by black's heavies on that open column so it is a good idea for Freddy to move his king off that line!",
        "14... a4 15. Nc1": "15. Nc1 - see my previous note.  As the knight is on c3 rather than a1 there are possibilities of it jumping to d3 and then moving towards the kingside to help in a possible attack.",
        "15... Qa5": "15. ....... Qa5 - Master Albertwall's queen comes into a4 for a potential deadly line up on the a column should black force an exchange of queenside pawns.  Nasty, nasty.",
        "16. g5": "16. g5 - Freddy continues with his own pawn storm.",
        "16... Nfd7 17. h4": "17. h4 - the pawn storm continues but his opponent packs a punch with f5.",
        "17... f5 18. f4 Na6": "18. ....... Na6 - Master Albertwall now moves his knight to the rim, possibilities of a move to c4, hmm.  If Freddy doesn't watch out things could get a little, grim!",
        "19. h5 Nac5 20. Bg2": "20. Bg2 - Freddy connects his rooks and now black retreats his bishop to d8, ah maybe that prelate is moving to the queenside to give black's attack a little back-up.",
        "20... Bd8 21. fxe5 Nxe5 22. Bf4": "22. Bf4 - Freddy takes advantage of black's d pawn isolani.  If the knight on e5 moves then Freddy will snaffle it with his bishop.  That pawn must be defended by pieces, so black could be a little restrained here.  Master Albertwall now siezes upon the e column with his rook and Freddy moves his h rook to try to neutralise the power of that black cannon.",
        "22... Re8 23. Rhe1": "23. Rhe1 - the downside of Freddy doing this is that it pulls a rook away from the file where he wants to pursue his attack on the black king.",
        "23... b3 24. a3": "24. a3 - Freddy wisely keeps the a column closed.  There is a potential lethal pawn fork on c2 that Freddy must watch out for.",
        "24... Qxd2 25. Bxd2": "25. Bxd2 - a queen trade, now comes the pawn fork.",
        "25... bxc2+ 26. Kxc2 Ba5 27. Bxa5 Rxa5": "27. ....... Rxa5 - Freddy looks OK here but appearances can be deceptive.",
        "28. Na2": "28. Na2 - Freddy tries to get his knight into play.  Ah, but on the other wing, Freddy watch out!  Black has a passer on the f file.  Will this pawn be a pain in the wotsit?  We shall see.",
        "28... f4 29. Nb4 Raa8 30. Nc6": "30. Nc6 - I think Freddy is hoping for a knight trade on this square and to get himself a supported passer on c6.  Note that lsb on g2.  Will Master Albert cut that line off though?",
        "30... Ng4 31. Ne7+": "31. Ne7+?  I am wondering if this is the losing move.  Maybe it would have been better if Freddy had moved his king or his d1 rook.  Right now they are perfectly lined up for a knight fork, not to mention the bishop on g2.  Would Rd2 have been the answer?  You the jury decide.",
        "31... Kf8": "31. ..... Kf8 - black sidestepps the knight check and moves his king towards the centre for the endgame.",
        "32. Nf5 g6 33. Nxd6": "33. Nxd6 - The isolani on d6 does drop off but there is a nasty knight fork from black on e3.  Ouch and double ouch!",
        "33... Ne3+ 34. Rxe3 Rxe3 35. hxg6 hxg6 36. Nc4 Rg3 37. Bh1": "37. ..... Bh1 - Freddy gets his passer, but that clever little in-between move from his opponent means that he is the exchange for a pawn down.  Worse, that black pawn on f4 looks really menacing.",
        "37... Re8 38. d6": "38. d6 - Freddy pushes his passer.  Black now lands a nasty check on e2 though.  With a black rook on the third rank things are starting to look a little ominous for Freddy's king.  At least with one white rook near his king, Old Matey will be kept at bay for a little while yet.",
        "38... Re2+ 39. Rd2 Rxd2+ 40. Kxd2": "40. Kxd2 - Freddy exchanges off his remaining rook to cut down the possibility of a visit from that chessic Grim Reaper.  Now what can his lsb do against a rook?",
        "40... Rxg5": "40. ...... Rxg5 - the loose white pawn on g5 drops off and now black has two passers which will soon be connected.",
        "41. Bc6": "41. Bc6 - well, that prelate tries to help the advanced d pawn get to the 8th rank.  If it was my pawn I would say Glendadom!",
        "41... Rg3 42. Ke2": "42. Ke2 - Freddy gets his king closer to that monster f pawn.  He then advances his pawn to d7.  Alas, that is as far as it gets.",
        "42... Rd3 43. d7 Ke7 44. Nb6": "44. Nb6 - to give added protection to the d7 pawn.",
        "44... Rd4 45. Nd5+": "45. Nd5+ - Freddy tries to drive off the black king and screens off a file attack from the black rook.",
        "45... Kd8": "45. ...... Kd8 - the black king is driven back all right, but he blocks off the d8 square for Freddy's d7 passer.  I think that Freddy is in zugzwang here, if he moves his king to f2 then Rd2.  If he moves his king to e1 then the black pawn advances to f3.  So Freddy moves his knight.  This will result in the loss of his d7 pawn.",
        "46. Nb4 g5": "46. ....... g5- as I thought, Master Albertwall has connected his passers.  Freddy will have the devil's job to stop both of them, especially without a rook.  He tries to do this with his king however.",
        "47. Kf3 Nxd7": "47. ...... Nxd7 - Sadly, Master Albertwall can now snaffle the pawn on d7.  With it goes any hope for Freddy of salvation.  Already the exchange + pawn down, he now has the two black kingside passers to deal with.  Freddy has had enough and waves the white flag on the grounds of ruinous loss of material.\r\n\r\nFreddy has better fortune in his other GK tournament game against the same opponent, he draws it.  I will be writing about that game later.  For now, I hope this is a useful lesson in how and how not to play against the Sicilian Naijdorf."
    },
    "url": "https://gameknot.com/annotation.pl/life-near-the-top-of-the-tree-part-1?gm=23634",
    "gameName": "Life near the top of the Tree Part 1",
    "players": "easy19 (2220) vs. albertwall (2346)",
    "opening": "Sicilian (B90), Najdorf"
}