{
    "moves": {
        "1. e4 c5": "Black plays the Sicilian defense.\n",
        "2. Nf3 g6": "This pawn is the Hungarian variation of the Sicilian.  The bishop is fletchetted on move 4.\n",
        "3. c4": "Ancton extension of the Sicilian.  On GK black has an advantage responding with Nc6, I'm unsure why.  The higher rated players seem to prefer fletchetting the bishop already instead.",
        "3... Nc6 4. Nc3": "The higher rated players prefer d4 here by almost 10 to 1.  I don't know why I went with Nc3 instead.",
        "4... Bg7": "...as promised.",
        "5. Rb1": "This looks like a wasted move.  White's black bishop isn't open yet.  Not much advantage putting this rook on the b file.  Maybe it will prove advantageous later on.",
        "5... a6 6. Be2 d6 7. O-O Nf6 8. d3": "Finally the black bishop has a nice diagonal.  The white bishop is completely blocked and virtually worthless.  It remains largely useless into the end game.",
        "8... O-O 9. Nd5 Ng4 10. h3 Nge5 11. a3 f5": "White decides to trade knights.",
        "12. Nxe5 Nxe5": "It was not a great trade.  Black retains center control, though neither knight has much room to move.",
        "13. g3": "Black decides to open the f file by trading pawns.  This has the additional advantage of picking off the undefended h pawn.",
        "13... fxe4 14. dxe4 Bxh3 15. Re1 e6": "I remember a Bobby Fischer blunder where a pawn cuts off the bishop's escape.  Don't have an opportunity to do that just yet.\n\nhttps://www.chess.com/video/player/fischer-blunders-a-bishop----or-did-he\n",
        "16. Nf4": "Retreating the knight here also encourages black to move the bishop to safety.",
        "16... Rxf4": "Black opts to swap rook for knight instead.  This move struck me as a mistake.  While the king's castle is breached, white's position isn't quite that bad so long as he doesn't play 17. gxf4.",
        "17. Bxf4 Qf6": "Pd6 is undefended.  Not a blunder, but an apparently questionable move.  That early Rb1 is starting to look almost prescient.",
        "18. Qxd6 Rc8": "Up two white is pleased to swap another 12 points--bishop and queen for bishop and knight.",
        "19. Bxe5 Qxe5 20. Qxe5 Bxe5": "So six pawns each, rook and two bishops versus two rooks and a bishop.  Black controls more squares, but his e pawn is isolated.",
        "21. f4 Bd4+ 22. Kh2": "Black's white bishop falls.  I think he trades it for a pawn, but first pushes the e rook.",
        "22... Bf2 23. Red1 Bd4": "Were I playing black I would have moved Bf5, to drop two points instead of three.  White's king also wants to advance further into the field.  However, Bd4 was motivated by black's desire to block open files.  White has nothing to move this bishop or advance the c pawn.  Pb4 would be answered with b6.\n\nSo the bishop is slain.",
        "24. Kxh3 Rf8 25. b4 b6": "...as predicted.  But white can open the b file, at least.",
        "26. bxc5 Bxc5": "...or not.  My first inclination is to make the a pawn invisible to the black bishop with a4.  On the other hand, getting the rooks on the same file also seems like a good idea.  The d rook's file is completely open.",
        "27. Rb3 Rb8 28. Rd7 Kh8 29. Bg4 Re8 30. Rbd3 a5 31. a4": "I just don't want black's a pawn to progress any further.",
        "31... Kg8": "Kh8, Kg8, black seems to be wasting time.  But at this stage white is up 5 points, it's going to be hard to make a comeback.",
        "32. Rc7 h5 33. Bf3 Re7": "Trading equal value pieces is all to white's advantage.  The inexorable laws of mathematics come into play.  18/13 (w/b = 1.38) is smaller than (18-5)/(13-5) = 1.63.  Does black gain positional advantage with this trade?  I don't see it.  White could play Rd8+, then trade, but the d rook is going behind enemy lines shorty regardless.",
        "34. Rxe7 Bxe7 35. e5": "First we want to open the diagonal for the white bishop.  It was blocked by a4, c4, e4, and h5.  Black probably couldn't hold the e file closed, but this move improves both the value of the white bishop and white's right side pawn structure.",
        "35... Kf8 36. Rd7": ""
    },
    "url": "https://gameknot.com/annotation.pl/lifers-tourney?gm=66886",
    "gameName": "LIFER'S TOURNEY",
    "players": "lord_shiva (1792) vs. claukonen (1889)",
    "opening": "Sicilian (B27), Acton extension"
}