{
    "moves": {
        "1. e4": "A Mini-tournament game. I'm white and begin with the Open Game.",
        "1... c5 2. Nf3 Nc6 3. Bb5": "OK, I really played this move fast, cycling between all the opening moves in two mini-tournaments I had just started. I thought I was playing the third move of the Ruy Lopez here. Fortunately for me, this is a real line of the Sicilian too, the Rossolimo, also known as the Hispano-Sicilian because of its similarity to the Ruy Lopez (Spanish Game).",
        "3... e6 4. Nc3": "Black replies main line, and white's main line reply would be 4. 0-0, but I went a different way with 4. Nc3 leading to the Anderssen Variation.",
        "4... Nd4 5. Bc4": "4. ... Nd4 is the Anderssen Variation, and that's about all I know about it. The DB said white should pull the bishop back to c4, so that's what white did.",
        "5... Nf6 6. O-O Qc7 7. d3": "White might want to play Nb5 or Nxd4 some time soon, so extra defense on e4 seems called for.",
        "7... a6 8. Nxd4 cxd4 9. Ne2": "White would lose the pawn on e4 right now if not for 7.d3.",
        "9... Nxe4 10. Nxd4": "A sneaky move by black. If white recaptures the knight with 10. dxe4, black wins the white bishop with 10. ... Qxc4 and now white is down a pawn, though he now has 11. Qxd4 or 11. Nxd4 to restore material equality. However, black would be much better developed and will have gained quite nicely positionally, so the move as played, 10. Nxd4 seems the better choice.",
        "10... Nf6 11. Bb3": "Maybe wasting a tempo, but a black pawn on d5 (or b5) looks inevitable and unstoppable, and the white bishop feels much safer on b3.",
        "11... d5 12. Bg5 Be7 13. Re1 h6 14. Bh4 g5 15. Bg3": "Black ruined his kingside castle chasing the black bishop to g3, a good square for him right now, aiming at the black queen on c7.",
        "15... Bd6 16. Qf3": "Adding defense for g3 but more interestingly, threatening the black knight on f6. Currently, this knight is the onnly defender of the pawn on d5 since the pawn on e6 is pinned to the black king. If black moves the knight, d5 falls. ",
        "16... Nd7 17. Nxe6": "16. ... Nd7?? was a big blunder for black. 17. Nxe6!! is the proverbial lightning from a clear blue sky, and it destroys black immediately, though it's not immediately clear why. I began looking at lines involving 17. Qxd5 and 17. Bxd5 and they often ended up with Nxe6 somewhere along the way. Then I tried the old Reverse-the-Move-Order game, and lo and behold, this idea sprang up. Black's queen is en prise first and foremost. She could run, but almost all available squares allow white to get her by moving the knight with discovered check. Of the few that don't, such as 17. ... Qb6, white wins with 18. Nxg5+ Kd8 and one possible continuation, much of which is forced, goes like this: 19. Nxf7+ Kc7 20. Nxd6 Qb4 21. Nb5+ Kb6 22. Bc7+ Kxb5 23. Qxd5+ Nc5 24. a4+ Qxa4 25. Bxa4+ Kb4 26. Qc4# (and still wins black's queen along the way).",
        "17... fxe6 18. Rxe6+": "Having little better, black accepts the sacrifice, but that also seals his doom. Black has only two legal moves. 18. ... Be7 loses the queen immediately to 19. Bxc7, and 18. ... Kd8, 19. Bxd6+ Qxd6 20. Rxd6 still wins the queen. And if black tries to run away, say with 18. ... Kd8, 19. Bxd6+ Qa5, then 20. Qf7 forces mate in 1 (2 if black stalls with 20. ... Qe1+). Since black has nothing better than losing his queen (after which white's attack is still overwhelming), he resigned at this point. I'm pleased with this little gem in the late opening/early middlegame and feel like it might redeem me a bit from my recent blunder/loss."
    },
    "url": "https://gameknot.com/annotation.pl/lightning-from-the-clear-blue-sky?gm=22693",
    "gameName": "Lightning from the Clear Blue Sky",
    "players": "blake84120 (1775) vs. soul2197 (1529)",
    "opening": "Sicilian (B30), Nimzovich-Rossolimo attack (without ...d6)"
}