{
    "moves": {
        "1. e4 e6 2. f4": "An unusual option against the French Defence, transforming the game into species of King's Indian Attack.  White early announces an interest in K-side operations.  Things don't quite turn out that way!",
        "2... d5": "Good counter-attacking choice.  It's good against 2.d4; even better against 2.f4.",
        "3. e5": "Keeping the centre closed, and possibly has ideas of cramping Black's K-side.",
        "3... c5": "Aimed against a possible future d4 move by White.",
        "4. Nf3 Nc6": "Maintaining control over d4.  White could still play d4 if she wanted, but after, say, 5.d4 cxd4  6.Nxd4 Qb6 Black would have every reason to be happy with his position.  White waits until well prepared before playing the d-pawn forward.",
        "5. c3": "For the next several moves, White singlemindedly prepares for d2-d4.  She has alternatives that were probably as good: 5.Be2 or even 5.b3.",
        "5... Nh6": "Black has a complementary scheme in mind, building up obstacles to White's plan.   The knight is headed, then, for f5.",
        "6. Na3 Be7 7. Nc2 Nf5": "Black has piled a lot of power aimed at the d4-square,  but White has more! A good alternative was 7...0-0.\n",
        "8. Be2": "White seems unconcerned about the possibility of 8...Bh4ch.  The bishop would have to be left strictly alone as after 9.Nxh4??Qxh4ch 10.Kf1 and Black has the choice of picking up two pawns for nothing after 10...Qxf4ch, or winning the Exchange after 10...Ng3ch 11.hxg3 Qxh1ch  12.Kf2 Qxd1.  But after 8...Bh4ch 9.Kf1!, White would have been well enough placed.",
        "8... Bd7": "Rather than go in for ...Bh4ch cheapos, Black prefers to develop.",
        "9. O-O": "Also possible here was to begin K-side operations BEFORE castling: 9.g4!? In the event, then, of 9...Bh4ch? White can respond 10.Kf1 Nh6  11.g5 Nf5  12.Ne3.",
        "9... O-O": "9....Qb6 was a thematic alternative, concentrating more power against d4.",
        "10. d4": "The long-awaited d2-d4 break.  Again, 10.g4 was an aggressive, though more committal, alternative, e.g.: 10.g4 Nh4  11.Nxh4 Bxh4  12.g5!? (12.d4 is good here) 12...f6  with an unclear position.  On the whole, White was probably wiser to take the more pragmatic approach.  After all, flank attacks are really justified only if, e.g. by closing it up, one can guarantee one's opponent has no counter-measures available in the centre.",
        "10... cxd4": "10...Qb6!?",
        "11. Ncxd4": "11.g4!? Qb6  12.Ncxd4",
        "11... Nfxd4 12. Nxd4": "Possibly it were better to have kept the second pair of knights: 12.cxd4.",
        "12... Nxd4 13. cxd4 Qb6": "At this point, The GK Engine gives Black a whisker (-0.42) of an edge.  Hardly anything in it really.  White has more space, but a bit of a weakness at d4.",
        "14. b3": "Frees the Queen's Bishop, but perhaps more flexible would have been 14.Rf3!  The idea is that on the third rank, the rook can switch from flank to flank, threatening to drive off the Queen by Rb3, and later to switch back to the K-side for an attack against the King.  The Queen's Bishop could have been developed at d2, where it, too, would have something to say on either flank.",
        "14... Bb5": "Forces off the light-square Bishops, whether White takes now, or leaves that chore to Black.  ",
        "15. Bxb5": "White prefers to resolve that tension at once.  A move like 15.a4 would have incurred a fresh weakness at b3.",
        "15... Qxb5 16. Be3": "The exchange of Bishops has left White with a 'bad' bishop in the centre and Black with a 'good' one.  Black's has the more scope - not that it is extensive - But White hopes to expand hers with the f4-f5 break fairly soon.  It might have been better, withal, to get that break in now (16.f5!) for Black now cuts across it.",
        "16... g6": "16.g6!  Prophylaxis: Black holds up the f5-thrust.  The weakening of the K-side dark squares is of little account if White can not take advantage of it.",
        "17. Qg4": "Still hoping to generate something interesting on the K-side.  17.g4 was another option with the same end in view.",
        "17... Rac8": "Seizing the open file.  The best defence against flank operations is a counter-action in the centre, or maybe on the other wing.  If Black can gain possession of the the only open file, he might more than counter-balance White's K-side pressure.",
        "18. Rac1": "That possession has to be challenged, lest Black gain invasion entries at c2 and c3.",
        "18... Ba3": "Good move, striking at the base of White's end of the open file.  This will ensure Black gains control of its entire length.",
        "19. Rxc8 Rxc8 20. f5": "[?] <FLASH> As no further challenge can be made on the c-file, White returns to her K-side, hoping to generate some attack.  But this is too committal, and overlooks a response in the centre that would decisively have tipped the balance in Black's favour (see next note).  Instead 20.Qd1! though it threw White onto the defensive, at least would have kept her in the game: 20.Qd1 Rc3  21.Re1 Bb4  22.Re2 Qd3 (It can not be denied Black would have wrested the initiative for himself in this line!) 23.Qxd3 Rxd3 24.Kf2 Bc3 25.Rc2 Bxd4  26.Bxd4 Rxd4 27.Ke3.  Though a central protected passed pawn down in this end game, possession of the open file would have given White very reasonable drawing chances.",
        "20... Rc2": "[??] <BANG> Black completely misread the situation!  It is not clear what this move is intended to achieve - but it hands the initiative, and a decisive advantage, to White.  The right move was 20....Qd3, at once attacking the bishop.  The game might have continued: 21.Bg5 Bb2  22.Rd1 gxf5! 23.Rxd3 fxg4  24,h3 h5  25.hxg4 hxg4 26.Kh2 ... with an end game not easy to assess.  Black would have an extra pawn, and White the more weak ones (a2 and d4 in particular), which suggests an edge for Black.  ",
        "21. fxe6": "<ROLLING THUNDER> Decisive.  Now, 21....fxe6ch simply leads to 22.Qxe6ch and a swift quietus.  Seeing the turnip shape his game had taken on, Black resigned here.  He could probably have fought on, but White had available from here a pretty simple plan to bring home the win: 21...Rc7 (an absolute essential to survive at all) 22.exf7ch Rxf7  23.Rxf7 ... (Not 23.Qxe6?? Qxf1#!)  23...Rxf7  24.Qc8ch! Rf8  25.Rxf8ch Bxf8  26.Bh6 Qb4.  At this point, White can force the exchange down to a 'pure' pawn end game.  But she would be ill-advised to do so yet, as it is possible for Black to set up an impenetrable barrier against the WK's invasion.  She should  simply hold the Black pieces to ransom, and manoeuvre her King as far forward as he can safely reach, before liquidating.  So: 27.Kf1! Qa3  28.Ke1!  Qb4ch  29.Ke2 Qb5ch  30.Kf2 ... Observe that by taking four moves instead of one to reach this square, White has prevented Black from obtaining the space to go all out for a perpetual check.  White can afford to be patient.  30... Qb4  31.Kg3 Qe1ch 32.Kh3 Qf2.  Now the WK is far enough forward to have an immediate effect in the pawn end game.  33.Qxf8ch Qxf8  34.Bxf8 Kxf8  35.Kg4 Kg7  36.h4! From this point, Black can not prevent White from opening up a path for her King into Black's position, e.g. 36...h6 37.h5! White wins."
    },
    "url": "https://gameknot.com/annotation.pl/lightning-and-thunder-from-a-clear-sky?gm=59823",
    "gameName": "Lightning and thunder from a clear sky.",
    "players": "jstevens1 (1724) vs. spunyarn (1905)",
    "opening": "French (C00), Labourdonnais variation"
}