{
    "moves": {
        "1. d4": "In this tournament game, I'm paired up against jstevens, a well-known and popular annotator/player here on Gameknot.  I had no doubt if Nosferatu choked this opening round the evidence would be immortalized in writing.",
        "1... d5 2. Bf4": "This is a theme tournament, using this as the starting position.  This is the \"Mason Opening,\" named after Irish chessmaster James Mason who often employed 2. Bf4 in symmetrical queen-pawn games.  It usually transposes into what became known later as the London System, but there are a few independent curiosities.",
        "2... c5 3. e4": "!? Such as this one, which is an invitation for black to enter into an Albin Counter-Gambit...reversed!  After 3. ...de 4. d5, white is a tempo up compared to an analogous black position in this opening.  Black often plays his bishop either to ...f5 or ...g4 in the Albin proper, so Bf4 is thematically in-character for such an opening.  I play the Albin myself, so I was looking forward to the enterprising play that would arise in a reversed approach, especially since the staid positions in the London System are usually not to my taste.",
        "3... Nc6": "To my disappointment, jstevens decides to decline the gambit, which is a sound course of action when facing a sharp invitation into something one doesn't quite trust (I've declined or counter-gambited many lines myself in my playing career).  3. ...de 4. d5 Qb6 must be critical, and will have to wait for another day.",
        "4. Nc3": "Having gotten his e4 advance in \"for free\" white must now play actively.  I chose aggressive development, but the alternative 4. dc!? is worth considering.  Now 4. dc Nf6 5. e5 Ne4 6. Nf3 and 4. dc e5 5. ed exf4 6. Qe2ch!? are interesting lines (particularly the later) to try if I reach this position again.",
        "4... cxd4": "4. ...de 5. dc Qa5 is also playable.  When the game is sharpened with tension this early in the opening there are many different possible branches.  The text immediately puts the question to my knight, since after my fourth move my d4 point was attacked twice and protected but once.",
        "5. exd5": "After 5. Nxd5?! e5, black takes a generous helping of the center with tempo, and with freer lines for development, a very comfortable game ahead.",
        "5... dxc3 6. dxc6": "As our pawns mow lines in parallel paths, who will blink first?",
        "6... Qxd1+": "Best.  Trying to keep queens on the board and get tactically cute with 6. ...Qa5 doesn't work: 7. b4! Qxb4 (Qf5 8. Qf3) 8. c7 Bd7 9. Ne2, followed by Rb1, and white is ahead of development in a messy position that should favor him, with the lingering tenant on c7.",
        "7. Rxd1 bxc6": "Or 7. ...cb 8. cb Bxb7 9. Bb5 mate, if jstevens wanted to wrap things up early, though I had an inkling she was in for the long haul.",
        "8. Bc7": "Threatening Rd8 mate, though the real goal of this move is to maneuver my DSB back via c7-a5-c3 and try to bait black into developing her LSB on the inferior b7 post, where its activity would be predictable to monitor on my part.",
        "8... Bb7": "Black obliges.  8. ...Bg4 is actually better, because after 9. Nf3 black can splatter my king-side pawns, and after 9. f3 I deny my knight its most active square and black can retreat to the comfortable d7 square.",
        "9. b3": "I wanted to win the weak doubled c-pawn, but not at the expense of my *own* pawns.  I figured I could swipe it up later when the time presented itself.",
        "9... Nf6 10. Nf3": "There are many potential white moves here, like 10. Ne2, 10. Ba4, 10. Bc4.  I chose the text because I was going to set a little trap.  The solid thing to do would be to play 10. Ne2 Nd5 11. Ba5 and round up the marooned c3 pawn.",
        "10... Nd5": "? Black falls into it.  Sometimes the slightly inaccurate gamble pays off!",
        "11. Rxd5": "! 11. ...cxd5 12. Bb5 is mate, which is a threat I tend to have niggled joanne quite a bit during this game.  I cannot suppress the worse angels of my nature.  After 11. ...e6 12. Ba5 Nd5 (now this maneuver is safe) white will have to work a bit more to win the pawn (13. Nf3-g5-e4 comes to mind), and in the meanwhile black can finish developing her kingside.",
        "11... Rc8": "Now both my rook and bishop are hanging, so this tactic is actually a roundabout exchange of minor pieces, but I can take a tempo to win a crucial wing pawn.",
        "12. Ra5 Rxc7 13. Rxa7": "And here we are.  Now if I can pick off the c6 pawn, I have excellent chances to create two connected queenside passers in the endgame, basically a winning advantage all other things being equal.",
        "13... Kd8": "Forced, because of the threat of 14. Ba6 on my part.",
        "14. Ne5": "Continuing to pressure the cramped black position.",
        "14... e6": "Forced to defend f7 by opening the row.  14. ...Ke8? 15. Ba6 is lost for black.",
        "15. Be2": "The second-best move.  15. Ba6, the best, did run through my mind as an alternative.  However I doubted my ability to win the c-pawn after 15. Ba6 Bxa6 16. Rxa6 c5.  If I'd looked a little deeper I should have seen that 17. Ke2 followed by Rd1ch would give me significant initiative while black's lines of development were still crossed up.",
        "15... Bd6": "15. ...f5 16. Nc4 c5 was to be considered.  Junior apparently found a cute tactic in 17. O-O?! Bxg2! 18. Rd1ch Bd5! and there is plenty of play left in the position.",
        "16. Nc4 Ke7 17. Bf3": "The point of 15. Be2, and ideally trying to coordinate my pieces with a future Na5 to win the *other* c-pawn, if given the chance.",
        "17... Ra8": "...Bc5 has been available to black in the last couple of moves, but I didn't think jstevens would move the bishop twice (and if she did, I would have been fine with redeveloping my rook) while busy activating the rest of her pieces.  Now she aims to permanently oust the bothersome tenant on a7.",
        "18. Rxa8": "A series of simplifying exchanges commence which ultimately favor white.",
        "18... Bxa8 19. Nxd6 Kxd6 20. Ke2": "Finally my king moves forward to free my KR and eventually hone in on c3.",
        "20... Ra7 21. a4 c5": "If black moved 21. ...Kc5 I intended 22. Rd1ch and Rd8 to stir up havoc beyond the enemy pawn lines.",
        "22. Rd1+ Ke7 23. Bxa8": "One more piece of wood for the block.  Black's LSB had little to do this game anyway.",
        "23... Rxa8 24. Rd3 c4 25. Rxc3 cxb3 26. cxb3": "I had my dream goal of connected passers.  I'm not much for endgames and I don't consider them my forte, however I can play them with the need arises.  Of course, this one isn't too challenging, thankfully, though one should never relax even with a \"won\" game.",
        "26... e5 27. Rc7+ Kf6 28. Kd3 Rd8+ 29. Ke4": "Of course 29. Kc3 occured to me, but I was trying to tempt black into 29. ...Rd2 30. Rc5ch Kg5 31. Kxe5 Rxf2 32. Rc3, when 32. ...Rxg2 would run into a forced rook trade via 33. Rg3ch, and the win.",
        "29... Rd4+": "Black doesn't opt for it.  Alas.",
        "30. Ke3 Rb4 31. Rc3 Ke6 32. Kd3 Rd4+": "I expected something like 32. ...f5 here, and figured I'd have to play Kc2 and Rc4.  Black makes it a tad easier for me.",
        "33. Kc2 Re4 34. Re3 Rxe3": "I didn't think black should have exchanged his last piece in such a position, but I had no complaints, naturally.",
        "35. fxe3 f5 36. Kd3 g5": "An impressive pawn phalanx.  Now, how to get over there?",
        "37. a5": "Displace the enemy king with one of my passers, is the solution.",
        "37... Kd6 38. a6 Kc6 39. a7 Kb7 40. Kc4 f4 41. Kd3 Kxa7 42. exf4 exf4 43. Ke4 h6": "White has one major pitfall to avoid, which is 44. Kf5 Kb6 45. Kg6?? g4, followed by ...f3 and promotion, if I play thoughtlessly.  In the above line, 45. h3 also wins, however.",
        "44. h4": "! The final blow.  After either 44. ...gxh4 45. Kxf4 or 44. ...Kb6 45. hg hg 46. Kf5 I mop up the remaining enemy kingside pawns and will promote one of my remaining passers.  An auspicious start in the tournament for the unglamorous vampire clashing with more comely competitors.  Thanks to Joanne for the game and annotation privileges."
    },
    "url": "https://gameknot.com/annotation.pl/livers-in-mason-jars?gm=36413",
    "gameName": "Livers in Mason Jars",
    "players": "-nosferatu- (1819) vs. jstevens1 (1773)",
    "opening": "Queen's pawn, Mason variation, Steinitz counter-gambit (D00)"
}