{
    "moves": {
        "1. d4 g6 2. Bf4 Bg7 3. c3 c5": "Just hitting at the right point. Both d5, dxc or Nf3 seem playable. I won't go into it. ",
        "4. e3": "Keeping the game on the scheme I want. ",
        "4... cxd4 5. exd4 Nc6": "As good as d5.",
        "6. Nf3": "Contolling e5.",
        "6... Nf6 7. h3": "? A loss of tempo, being Nb-d2 more accurate for developement. But I have g5 in mind to control black's lsb.",
        "7... d6 8. g4": "It could ad should be delayed. Nevertheless, it causes some sort of psychological effect on my opponent. ",
        "8... Ne4": "This nice outpost doesn't threat anything, and I have a tempo to play against e5.",
        "9. Bd3": "Another plan could have been b4. Is the only way to prevent Na5, in order to build an attack on f7 after castling with moves like Nc4, Qb3, Ng5. I know by experience that it is an attack black can defend from, and I sense my opponent knows it very well. So I went for this. I have to take advantage from my g pawn: if f5, I can open the g column for my attack. ",
        "9... d5 10. Qc2": "I threat to win a central pawn. Developing in the meantime. Now, Nd2 or Ng5 can be emergency plans if needed. ",
        "10... h5": "Very smart idea to counterattack! My h pawn is pinned.",
        "11. gxh5": "? A mistake. I had to be wise and play g5. It blocks my minor pieces' best square, g5, but gets a grim on black position. The text allows a potentially dangerous attack on my kingside. ",
        "11... Rxh5": "Ok, my h3 pawn is threatened, but I have my pawn win waiting for me too. ",
        "12. Bxe4 dxe4 13. Qxe4": "Well, if black goes for h3 I will be partly ok unless black can build some quick attack. Plan is castle Qside, and get the bN to c4.",
        "13... Bf5": "Another little \"price\" I have to pay. But it just helps my Q to go to a better square: ",
        "14. Qe2": "Pre-defending b2. ",
        "14... Qb6": "Post-attacking b2 and opening the way for o-o-o, or a sac on d4. I think on moves like Ng5 (f6? Ne6, BxN, QxB, threatening Qg8+ and QxB). ",
        "15. Ng5 f6": "Now I stopped for a moment and realized that I was falling on my own trick. If now Nd6 (threatening NxBg7+), after BxN and QxB, black has Qxb2. This threatens QxR and... wow, very hard to get into. Can I allow myself to wait?",
        "16. Nf3": "Let's see. I said \"no\" to the tactic line. Your turn to do something. This is an antinatural strategy I won't recommend, but in this case, it is stupid to go into a tactic you spotted if you realize it won't work. I'll accept the return of a pawn, and will go Na3, Nc4 as planned. g5 is not a concern after Nxg5, RxN (or QxR+), BxR, fxB, Qh5+, followed by choice between going on with checks or play b3, stopping black. ",
        "16... Bxh3": "Pawn grabbed and B threatening Bg4. I am sure he didn't expect my next one: ",
        "17. Rg1": "As before, g5 is not wise (in my opinion. Later, with the analysis borard I'll be able to tell). ",
        "17... O-O-O": "I can't say if black estimated more valuable the K's safety than the pawn, or he was simply got distracted and missed Bf5! ",
        "18. Rxg6": "This puts him in troubles with his dsb: how to defend it? I would have gone Rh7. With no white's lsb, it's the best place. ",
        "18... Bh8": "As I suspected, he preferred to hide and keep the other R free to act... but how? Nevertheless, I have the same problem: how to proceed? If Ng5, RxN, but if 19. Ng1... and black loses something after any move, e.g. 19..., Rh7, NxB, RxN, Qe6+, followed by QxRh3. BUT remember that still in that case, black has Qxb2, winning a R. ",
        "19. Na3": "Instead of throwing stones into the dark, I addressed the Qside issue, hoping black won't find a quick attack. ",
        "19... Bf5": "Rh1+ is threatened. ",
        "20. Nc4": "I know I'll receive a strong attack, but I also have some tricks in my sleeve.",
        "20... Qa6": "I thought this move was going against my interests, since I don't like a Q exchange if I want to win. I should have played Rh6, to keep all in control. I got distracted. I won't lie. ",
        "21. O-O-O": "?? Yes, I just blundered the R. ",
        "21... Bxg6": "...but you have to see the good side of everything. ",
        "22. Qe6+": "Finally I got the Q where I wanted it to be! Yes, at the cost of a R and a deadly weakness of my K. ",
        "22... Rd7": "Now what? Na3 was safe.",
        "23. d5": "...but I was betting \"all or nohing\" now, since hey, I am a R down. ",
        "23... Qxa2": "As predicted...",
        "24. Na3": "...as planned, missing the obvious Qa1+, Kd2, Rhxd5+, forcing Nd4 to go on hopelessly for some more moves. ",
        "24... Na5": "?? Sparing me from my fate! ",
        "25. Nd4": "This doesn't stop Rhxd5, but if this is played, I'll have Qg8+, winning black's lsb. ",
        "25... Rhxd5 26. Qg8+": "Given the situation, I thought the wisest was to go for a draw. Cash the prize won't have assured me a good game (I'm -6, and I can recover 3). ",
        "26... Rd7d8 27. Qe6+": "...and I force a draw. But it was my opponent's turn to blunder. ",
        "27... Rd8d7 28. Qg8+ Rd7d8 29. Qe6+ Rd5d7": "Blunder or will to win, after all, instead of allowing a low-draw? I'll never know!",
        "30. Qxa2": "I am only +3, he has the B pair and a fork: e5, that frees his position and makes an unbalanced but very interesting game (if I am right, of course). ",
        "30... Rd7xd4": "? A pity, after e5 it would have been another game. ",
        "31. Rxd4 Rxd4 32. cxd4 f5": "No move can save black, in a way or another. ",
        "33. Qg8+": "I'm sorry for this ignominious finale. But the midgame was whorth it, I hope. Thanks for reading!"
    },
    "url": "https://gameknot.com/annotation.pl/live-chess-chess-com?gm=61836",
    "gameName": "Live Chess, Chess.com",
    "players": "damafi (1435) vs. Mustafa-2011 (1502)",
    "opening": "Modern defence (A40)"
}