{
    "moves": {
        "1. e4 e6 2. d4": "Black to play.",
        "2... d5 3. e5": "This is the \"Advance Variation\".  For years computer analysis has suggested that this move only gives White equality.  If White wants to play for an advantage he should try the Tarrasch variation with 3. Nd2.  The reason this works is because it is easier for White to defend his center while enjoying a slight space advantage and better bishops.",
        "3... c5": "Here I often see people falter with 4. Nf3?! and then after 4... cxd4 5. Nxd4 Nge7! and 6... Nbc6 Black is doing better because he has the stronger center.",
        "4. c3": "If White doesn't play this, his game is terrible after 4... cxd4.",
        "4... Nc6": "All the emphasis will be on attacking the center.",
        "5. Nf3 Qb6": "6. dxc5?! Bxc5 temporarily gives Black the initiative because White has to defend f2.",
        "6. Be2": "I have seen this move quite a bit lately.\n\nOther good choices include : 6. a3, 6. Bd3!? and 6. Qb3!?\n\n",
        "6... cxd4": "I have known for years that computer analysis prefers this move, but I didn't necessarily know why.  The key is that it is important to attack the center before White castles, after which he has some tricks like after 6... Nh6 7. O-O threatening 8. dxc5 Bxc5 9. b4, or say after 6... Nh6 7. O-O cxd4 White can try 8. b4! dxc3 9. b5 and 10. Nxc3 without worrying about the safety of his king.  \n\n",
        "7. cxd4": "\n",
        "7... Nh6": "Preparing to go to f5.   Obviously not 8. Bxh6 Qxb2 although a few people have played this against me.  Black can also play 7... Ne7.\n\nThe key for White to maintain equality is to now move the knight to c3 and a4.  The moves 8. Nc3 Nf5 9. Na4 Qa5+ 10. Nc3 Qb6 11. Na4 leads to a draw.  If 10. Kf1 b5 11. Nc3 b4 12. Nb5 and then 12... h5 is miniscule better for Black.",
        "8. b3": "Not necessarily the strongest.\n\n\n",
        "8... Nf5 9. Bb2": "It is common in this opening for White to hold the pawn this way.",
        "9... Bb4+": "This doesn't particularly give Black an advantage.  Computer analysis barely prefers 9... h5.\n\nNow not 10. Bc3 Nfxd4.  Playing either knight to d2 drops the d4 pawn.",
        "10. Kf1": "Although this might look bad for White, the game is equal.\n\n",
        "10... Be7": "This bishop retreat is questionable.  It might be better to wait.\n\nComputer analysis likes both 10... O-O and 10... f6.\n",
        "11. g3 f6": "Attempting to undermine the center.  Now if 12. Kg2?! fxe5 13. dxe5 Bc5 with a slight edge for Black.",
        "12. exf6 Bxf6": "Here White absolutely has to play 13. Nc3 O-O (capturing d4 is losing after14. Na4) 14. Na4 Qc7 15. Kg2.\n",
        "13. Ne5": "This move is a disaster.  Not only does he take a defender off of d4, but it is now too late to try to save himself with Nc3.",
        "13... O-O": "There could be some tricky lines if Black doesn't castle, and it is more important to build up strength on the F file than it is to capture the pawn right away.\n\nNow 14. Nc3 loses a piece to 14... Bxe5 because of the threat of Ne3+.",
        "14. Nxc6": "\n",
        "14... bxc6 15. Qd2": "15. Kg2 is about the same.",
        "15... Bxd4": "The pawn finally falls.  Black wants to trade pieces to go into a favorable endgame.",
        "16. Bxd4 Nxd4": "At first this seems counterintuitive because taking with the Queen would result in the trade of pieces.  However, Black has a trick up his sleeve.\n\nWhite needs to play 17. Bd1 and then Black's best response would be 17... e5",
        "17. Nc3": "But instead he falls for a two move tactic.",
        "17... Nxb3": "With the discovered threat of mate on f2.",
        "18. Qe1 Nxa1": "White can't even take back because of the mate threat.\n\nThe game is essentially over."
    },
    "url": "https://gameknot.com/annotation.pl/live-chess-chess-com?gm=64671",
    "gameName": "Live Chess, Chess.com",
    "players": "bbarber2012 (1738) vs. john2001plus (1878)",
    "opening": "French (C02), advance, Milner-Barry gambit"
}