{
    "moves": {
        "1. e4 c5 2. Nf3 d6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 g6": "Tipikal pembukaan Sisilia Naga, notasi komentar di sini menggunakan huruf Inggris (N=kuda, K=raja, B=gajah, Q=ratu).",
        "6. Be3 Bg7 7. f3 O-O 8. Qd2 Nc6 9. g4 Be6 10. Nxe6": "White usually disdains this capture and plays 10. 0–0–0, thinking to get on with the traditional kingside offensive, but it is interesting to see what happens if he does play the obvious move.\r\n\r\nPutih biasa tidak mencaplok di sini dan bermain 10.0-0-0 rotasi panjang, untuk memperoleh serangan dari arah sayap raja. Akan menarik untuk melihat apa yang terjadi kalau dia main langkah tersebut.",
        "10... fxe6 11. O-O-O Rc8": "Rather unusual. Most Black players prefer to stop White’s next move with 11...Ne5 first, and this is probably better than the text.\r\n\r\nKurang biasa. Biasanya hitam memilih menghentikan langkah bidak putih  dengan 11...Ne5 duluan, lebih baik dari langkah teks.",
        "12. Bc4": "Completely logical. White seeks to exploit the weakness on the a2-g8 diagonal.\r\n\r\nMasuk di akal. Putih segera menyerang kelemahan di diagonal a2-g8.",
        "12... Qd7 13. Bb3 Na5 14. h4 Nc4": "Superficially, 14...Nxb3+ to knock out the light-squared bishop is tempting, but it is not clear then where Black’s queenside counterplay is coming from. If he cannot conjure up something, he might simply get mated on the kingside. This is an occupational hazard of playing the Dragon, of course. As Nigel Short put it in the commentary room: “Dragon players don’t really mind getting mated”, though one could hear Dragon expert GM Chris Ward in the background saying “oh yes, they do!”.\r\n\r\nMemainkan kuda mencaplok Gajah di b3 cukup menggoda, tapi hitam tidak yakin bisa memperoleh bantuan serangan dari perwira-perwiranya dalam tempo singkat. Kalau gagal, hitam bisa saja terkena skak mat, tapi ini adalah tipikal pembukaan Sisilia Naga. Seperti kata Nigel Short dari ruang komentator : \"Pemain Naga tidak pusing terkena skak mat\", walaupun GM Chris Ward, pakar Naga, terdengar menjawab \"....nggak... (kami peduli)\"",
        "15. Qd3 Qc6": "You might find your computer gets excited at the prospect of 15...Nxb2!? here, with the idea of 16 Kxb2 Nd5 17 exd5 Rxc3 18 Qxc3 Bxc3+ 19 Kxc3 Rxf3 20 dxe6 Qc6+ 21 Kd2 a5, etc, but the two players were dismissive of this line, feeling that White’s rook and two bishops were more than adequate compensation for the queen. \r\n\r\nDi komputer mungkin terlihat menarik prospek dari 15...Nxb2, dengan ide  16 Kxb2 Nd5 17 exd5 Rxc3 18 Qxc3 Bxc3+ 19 Kxc3 Rxf3 20 dxe6 Qc6+ 21 Kd2 a5. Tapi kedua pemain sepakat line tersebut tidak baik, dengan pertimbangan Benteng putih dan dua gajah sudah cukup kompensasi untuk Ratu.",
        "16. Ne2 Nd7 17. Nd4 Qa6 18. f4": "18 Nxe6? Bxb2+ 19 Kb1 Rxf3 20 Ng5 Rxe3! 21 Qxe3 Bf6 gives Black a very useful attack for the small material investment. Besides which, White doesn’t want pawns, he wants to give mate.\r\n\r\nVariasi di atas, hitam memperoleh potensi serangan yang baik dari sedikit kompensasi materi. Selain itu putih tidak menginginkan bidak, tapi serangan skak mat.",
        "18... e5 19. fxe5 Ndxe5 20. Qe2 Kh8": "It would all too easy to fill up the page with analysis here but let’s look at just one alternative: 20...d5!? 21 exd5 Nxg4 is another try if Black is afraid of being mated. However, White could continue with 22 Bg5!?, e.g. 22...Nf2 23 d6! Nxd1 24 Qe6+ Kh8 25 d7! and White seems to emerge with an advantage.\r\n\r\nCukup banyak variasi di sini, salah satu alternatif hitam 20...d!? (sesuai di atas) bisa dilangkah kalau hitam takut skak mat. Tapi putih bisa main 22.Bg5!? (sesuai di atas) dan Putih keliatan lebih baik malah.",
        "21. h5 gxh5 22. g5": "Both players were in severe time trouble by now. Here Nigel Short thought he must be winning on the kingside but calculated that his likeliest tries were flawed, e.g. 22 Rxh5!? Nxe3 23 Qxe3 23...Rf1! 24 Rh1 (24 Rxh7+ Kxh7 25 Qh3+ Bh6+ (the fact that this is check is vital, of course) 26 g5 Nd3+!! is another stunning resource for Black) and now the implausible 24...Qd3!! comes to Black’s rescue. But 23 Qh2! would surely have won the game after all.\r\n\r\nKeduanya memasuki masa krisis waktu. Nigel Short merasa ada potensi menang tapi segera sadar kalkulasinya salah contohnya 22. Rxh5!? Nxe3 23 Qxe3 23...Rf1! 24 Rh1 (24 Rxh7+ Kxh7 25 Qh3+ Bh6+ (skak di sini penting) 26 g5 Nd3+!! Hitam bisa cukup mematikan di sini) dan sekarang 24...Qd3!! bisa menyelamatkan hitam sudah. 23. Qh2! juga memenangkan.\r\n\r\n",
        "22... Ng4 23. Bg1": "An annoying necessity. 23 Rxh5 Ncxe3! 24 Rxh7+ Kxh7 25 Rh1+ comes close but 25...Kg6 and the black king is perfectly safe.\r\n\r\nTerpaksa, karna variasi di atas (23.Rxh5...) raja hitam akan aman cukup dengan 25...Kg6.",
        "23... Nce3": "Forcing the exchange of queens more or less guarantees that Black will not be mated on the kingside.\r\n\r\nMemaksa pertukaran Ratu menjamin hitam tidak akan terkena skak mate di sayap pertahanannya.",
        "24. Qxa6 bxa6 25. Bxe3 Nxe3 26. Rd3 Bxd4 27. Rxd4 Rc5": "The endgame is a very different story. Black is already a pawn up and has further white pawn weaknesses to target.\r\n\r\nDi permainan akhir ceritanya cukup berbeda. Hitam sudah satu bidak unggul dan juga potensi menggali kelemahan di susunan bidak putih.",
        "28. Rd3 Ng2": "Indirectly defending the hpawn with a fork on f4. Nigel had hoped for 28...Rf1+?? 29 Rxf1 Nxf1 30 Rf3 Nh2 31 Rf8+ Kg7 32 Rg8 mate.\r\n\r\nKuda hitam secara tak langsung menjaga bidak h nya, dengan ancaman garpu di f4. Nigel berharap 28..Rf1?? maka...29 Rxf1 Nxf1 30 Rf3 Nh2 31 Rf8+ Kg7 32 Rg8 mate.",
        "29. Rg3 Nf4 30. Kd2 Re5 31. Re1 Kg7 32. Ke3 Kg6 33. c3 Rxg5 34. Rxg5+ Kxg5 35. Rg1+ Kh6 36. e5 dxe5 37. Ke4": "Though Black has three sets of doubled pawns, his endgame advantage is secure.\r\n\r\nWalaupun hitam terpecah dalam 3 set susunan bidak, tapi permainan akhirnya menjanjikan.",
        "37... Ng6 38. Bc4 a5 39. Kd5 Rf2 40. b4 axb4 41. cxb4 h4 42. a4 h3 43. a5 h2 44. Rh1 Kg5": "Nigel might have resigned around here ordinarily but he sportingly plays on to a more clear-cut conclusion for the benefit of the big crowd watching.\r\n\r\nNigel bisa segera menyerah, tapi dia dengan sportif terus bermain sampai ke bagian yang lebih nyata kalahnya, demi penonton yang ramai mengikuti.",
        "45. b5 Kg4 46. b6 axb6 47. a6 Kg3 48. a7 Rf8 49. Kc6": "Both advanced pawns can queen and ‘buy’ a rook but Black has a back-up supply of potential new queens, of course.\r\n\r\nDua-duanya bisa mempromosikan bidak jadi ratu, dan tukar dengan benteng. Tapi tentu hitam punya bidak cadangan yang lebih banyak untuk menang.",
        "49... Nf4 50. Ra1 e4 51. Ba6 Nh3 52. Bb7 Ng1": "http://red-white-chess.blogspot.com"
    },
    "url": "https://gameknot.com/annotation.pl/london-chess-classic-london-eng-blingual-indonesia?gm=40027",
    "gameName": "London Chess Classic, London ENG (blingual Indonesia)",
    "players": "Nigel Short (2680) vs. Luke McShane (2645)",
    "opening": "Sicilian (B76), dragon, Yugoslav attack, Rauser variation"
}