{
    "moves": {
        "1. d4": "A \"new\" Queen Gambit? :-)",
        "1... d5 2. Nf3 Nc6 3. Bf4 Nf6 4. h3 e6 5. Nbd2": "Wrong move. White has to defend the d4 pawn here, with e3. Because the plan is to answer to black's Bd6 with Ne5, leaving the pawn unattended. This happened here, but...",
        "5... Bd6 6. Ne5": "So, this was a simple blunder. A little one, of course, but a blunder. Nevertheless...",
        "6... Nxd4 7. e3 Bxe5": "My plan to take in e5 with a pawn, one of the keys of this opening, fails... ",
        "8. Bxe5 Nf5": "The simple Nf6 is better, but I cannot blame him for not seeing what was coming on...",
        "9. g4": "Again, Nh4 looks better, but g5 follows, and then the queen goes out... ",
        "9... Nd6 10. g5": "Where does this nasty pawn go?",
        "10... Nfe4": "Ok, now I had to choose between h4, f4, or Nf3. Neither look bad... but I like to be aggressive, and after some calculation...",
        "11. Bxg7 Rg8 12. Bh6 Nxg5": "Never allow such a pin!",
        "13. Rg1": "Now it starts to be really tactic. One of the funniest variations I found was the following. \n\n13. ...        Rg6\n14. Qh5\tNd6-e4\n15. o-o-o\tNxf2\n16. Rxg5\tNxd1\n17. Rxg6\th7xg6\n18. Qe5\tf7-f6\n19. Qg3\tKf7\n20. Bd3\tf6-f5\n21. Nf3\tQf6\n22. Ne5+\tKe8\n23. Bb5+\tc7-c6\n24. Nc6\tQb2+\n25. Kxd1\tQb5\n26. Qxg6+\tKd7\n27. Ne5+\tKc7\n28. Qxf7+\tKd6\n29. Bf4\tQb1+\n30. Kd2\tQb4+\n31. c2-c3\tQb2+\n32. Kd3\tQb1+\n33. Kd4\tQd1+\n34. Nd3+\tKc6\n35. Qc7+\tKb5\n36. Qc5+\tKa6\n37. Qa3+\tKb6\n38. Qb4+\tKc6\n39. Qc5+\tKd7\n40. Qc7+\tKe8\n41. Bg5\tQa4+\n42. Ke5\tQe4+\n43. Kf6\tBd7\n44. Ne5\tRd8\n45. Qd6\tand mate the next one, or black loses the queen. ",
        "13... Rg6 14. Qh5": "Here it goes, the dangerous queen. ",
        "14... Nde4 15. O-O-O": "Risking again. A quiet way to play was to protect f2 (Rg2... looks weird), or h4 or f4... but I adore tactics, and if a sacrifice is possible, I do it. ",
        "15... Qf6": "Oh, playing hard... now I have to change my bishop, and all seems to stay calm, with a pawn less. Not quite. ",
        "16. Bxg5 Nxg5": "A half blunder, since it allows my bishop to come into the game aggressively.",
        "17. Bd3 Rg7 18. f4": "This move makes me recover the pawn, but no only this. ",
        "18... Ne4 19. Nxe4 dxe4 20. Bxe4": "It opens the 5º row to my queen's action, and bishop and rook are perfectly placed for a mortal attack. Black worry about his h pawn...",
        "20... h6 21. Rxg7 Qxg7 22. Qb5+": "A mortal check, due to the combined action of my bishop and rook.",
        "22... Ke7 23. Bxb7": "Qc4+ was also good. But this one is a little more sadistic, since it seems to give black some chances. ",
        "23... Rb8 24. Qc5+": "Ke8 is followed by Bc6+...",
        "24... Kf6 25. Qe5+": "...and the game is over. Black can struggle more, and white can allow himself not to take the black's queen, with: \n\n25. ... Ke7 \n26. Qc7+, Kf6 \n27. Qd8+, Kf5 \n28. e3-e4+, Kxf4 \n29. Rf1+, Ke5 \n30. Qc7+, Kd4 \n31. c2-c3+, Ke3 \n32. Qf4+, Kd3\n33. Rf3+, Kc4\n34. d5+, any, \n35. Qb4#\n\nSure there are more defences for black, but the game is won if white just gets the black's queen. ",
        "25... Kg6": "The shortest way to lose, but... what else?\n\nTo say the truth: my opponent was trapped in a tactics difficult to see, and I got it by chance. One of those games in which a \"little\" mistake leads to major material loss. ",
        "26. Rg1+ Kh7 27. Qxg7#": ""
    },
    "url": "https://gameknot.com/annotation.pl/london-very-nice-attack?gm=25902",
    "gameName": "London very nice attack",
    "players": "damalfi (1643) vs. just_william (1673)",
    "opening": "Queen's pawn game, Chigorin variation (D02)"
}