{
    "moves": {
        "1. d4": "Another two interesting tactical situation, one in the middle game and another in a pretty uncommon ending, that I handled very, very badly. ",
        "1... f5": "A good but not very frequently seen answer. I like it, since it makes more difficult my favorite London attack.",
        "2. Bf4 Nf6 3. Nf3 g6 4. e3": "I can advance inmediately this pawn because if Nh5, Be5. If Bg7, I exchange bishops and the game can go on. If Ng7, my bishop will be pushed away eventually with d6, but black development will also resent. Interesting but I think it is playable. If Rg8, I made him loose the castilng rights for the kingside. ",
        "4... Bg7 5. h4": "Attacking inmediately. I've seen this move on DB and it is in the spirit of the London system. Probably is a bad one, tough... :-)",
        "5... d6 6. Be2": "Aiming to sacrifice the h pawn in order to disrupt black pawn chain, or at least to open the h column. Better would have been Bc4, I realized later. But, in black's shoes, I would have played d5. He loses a tempo, but I will, also, so it is playable. I thought my Bc4 plan will go nowhere unless I have much more attacking power.",
        "6... Nbd7": "Aiming to fiachetto the lsb on b7. ",
        "7. Ng5": "It looked interesting. Now I regretted not to have placed my bishop in c4, but I am also opening the white diagonal, aiming to h5.",
        "7... e5": "...or he can lose his queen... :-)",
        "8. Ne6": "If I don't play this one, and retire the bishop, I lose the initiative.",
        "8... Qe7": "I thought a lot about Nxc7 , Kd8, but after this... what? If NxRa8, e5xBf4 is dangerous for me, and I am not sure I can hold the knight without major problems against my king. Maybe o-o is enough to hold the position, but who wants a king's castling with the pawn in h5? And, after f4xe3... I was very doubious about white's position. So I preferred the \"clean\"...",
        "9. Nxg7+ Qxg7": "The strong bishop is gone. Now, the other can go to b7, and I have to make room for my own dsb.",
        "10. Bg3 O-O": "Incredible... wasn't it better to try to castle queenside in few moves, instead? b6 was the move!",
        "11. h5": "Ok, I'm risking something, but black's challenge should be met!",
        "11... g5 12. h6 Qe7": "It seems an useless pawn on h6, but it is not, as you will see...\nAt this point, it was tempting Bh5, but... he wouldn't be so naive as to play NxB, so...",
        "13. f3": "Making room for my dsb, etc.",
        "13... Nd5": "It looks as a strong move, but...",
        "14. Bc4 Nd7b6 15. Bb3": "Aha, now, what? I am threathening e4, winning a piece.",
        "15... Kh8 16. Qd2": "Time to defend. Maybe Bf2 would have be better, but I keep underdeveloped. I am planning to castle queenside, and either c4 or Nc3. ",
        "16... f4": "I think he should have taken care of his developement, with Be6. But he was looking for \"something\" about the e column and my king... and maybe he has. But...",
        "17. Bf2": "NOw I have to give back the dsb for a knight, but it's ok.",
        "17... Nf6": "Why this retirement? It \"saves\" me from defending. After f4xe3, Bxe3, Nf4 would have put me in troubles. now he can play Bf5, placing it in a very good square...",
        "18. e4": "Ahhhh... I am not attacking anymore, but my king is protected. Now, can I take advantage of the h column in some way?",
        "18... g4 19. Bh4": "Almost forced, since otherwise my bishop would be released to the sad g1 square! But it is very strong, there!",
        "19... Qe8 20. Nc3": "Now, if g4xf3, I take back the pawn and then, with o-o-o and the open g column, is good for me... all because he didn't play the c8 bishop before!",
        "20... Bd7": "At last! But now it's my turn...",
        "21. O-O-O g3": "Now, I need to \"justify\" my h6 pawn, but I cannot without having room on the h column... note that my own bishop is on the only safe square... if I play it to g5, I would not be able to defend it, so...",
        "22. Bxf6+": "I found a way to have pieces on the h column, making my rook penetrate. Unfortunately, this means to exchange a bishop for a knight, but it gives me the h5 square for my rook. And I calculated I could defend my h6 pawn. ",
        "22... Rxf6 23. Rh4 Qf8": "As foreseen, leaving h5 to my rook. ",
        "24. Rdh1 a5": "Interesting, but not enough. ",
        "25. a4": "Maybe I should have played d4xe5 inmediately, and then rook on h5. If a4, Ba2 and hold tight. Anyway... I choosed to be prudent...",
        "25... Qe8 26. Rh4h5": "Setting a major future threath but letting him take the a4 pawn... I love to risk. Note that I am winning the d5 square too.",
        "26... Nxa4 27. dxe5 dxe5": "I was aware I was opening for him the d column, but the queen should go to c3, after the knight exchange on a4. But... I saw something, and I took the risk.",
        "28. Nd5": "First tactical interesting situation. \nIt seems a mistake, because of Rd6. But, after Nxc7, RxQ, NxQ, BxN, Rg4! threatening mate in g8! He must move the bishop, and NxR, winning a quality. After Kxb2, Kc3 and the only way not to lose the knight is a4. NxN, a4xBb3, Nxb3 and he must defend the e4 pawn. If this is a winning position for me, is to be decided, but I think yes. \nOf course, this is not the only line here... ",
        "28... Rd6": "Anyway, I must think about the other possible moves after Nxc7, like Qe7. I was not satisfied with Bd5, or Nd5, so I thought that it was better to let c3 free for my queen. ",
        "29. Bxa4 Bxa4 30. Qc3 Rc6 31. Rxe5": "Second minor interesting tactical position. I recover my pawn, and it looks not a bad idea to have a free passed pawn in the center. But the black a pawn will prove to be very strong, too.",
        "31... Rxc3 32. Rxe8+ Bxe8": "The good part of this position is that the black's lsb has very few things to do here. Unfortunately, I have to take the rook back with my knight, which allows...",
        "33. Nxc3 c6": "Now is my knight that is misplaced. But he will lose a second pawn anyway, f4 is definitely dead. I didn't play Ne2 because I was \"smelling\" something bad with the black pawn's majority on the queenside, but I wasn't able to calculate such a large number of variations. And I wanted to activate my rook. \nAnyway, a more deep look shows that the white position is not as good as it looks. I was unable to see it, and I got in serious troubles. ",
        "34. Rh4 b5": "Aha. It looks darker and darker on the queenside. Anyway, my h6 pawn is starting to play right here.",
        "35. Rxf4": "threatening a very uncommon mate.",
        "35... Bd7 36. Rf7": "Probably Rf6 is better, preventing the bishop to run to the good diagonal a2-g8. I wanted to access with my rook the darker pawns...",
        "36... Be6 37. Re7": "Again, Rc7 would have been better. ",
        "37... Bg8 38. Rc7 Ra6": "I planned to play Rc8 here, pinning the bishop, but I didn't see that with c5 he would have taken my h6 pawn... with a mate threat if I move my knight. And with b5 he makes me move it very easily...",
        "39. Rg7": "Now, to take g3 is not the great idea here, but to block black's rook after it takes the h6 pawn. ",
        "39... a4": "Another VERY interesting tactical position. \nIf I play Rxg3, b4, Nb1?, a3! and I am lost! Do you see it? If I play\nNb1 at once, b4, and then I cannot avoid to lose the knight for the a3 pawn, to say the less. \nIf Rxg3, b4, Ne2 is slightly better, since I have room for my King to go to b1-a1 to stop the a pawn. But who wants to play with a pinned king?\n(Rxg3, b4, Ne2, a3, b2xa3, b4xa3, Kb1, a2, Ka1... ok, I can probably came out of this one, but it looks weird). \nOk, so look to Kb1. It looks good, since it gives the king a precious time to stop the a pawn. But: \nKb1, c5!, now if I go Rxg3, Rxh6... threatening mate in 1! After Rh3, I can stop it, but does it look good?\nOk, so let's take a look against the other black's attack line: \nKb1, b4. Na2, and then apparently everything is under control, except that black can play c5, I lose h6 AND I have a delicate situation for the control of the 1 line and the weak g2 pawn. \nInteresting for a greater mind than mine... :-D\n ",
        "40. Rb7": "An ugly move, but necessary. I won the fool's medals for my way to move the rook in the last moves. ",
        "40... Ra8": "In order to avoid any mate threat, then making the bishop free. \nThe alternative was c5, Rxb5, Rxh6, Rxc5, but probably black had more moves to play. For instance, Bc4 threats Bf1, winning the g2 pawn... \nLater, I realized he could play Bh3!, scarifiying the bishop to crown his g3 pawn! I completely missed the point, and that proves I completely misunderstood the position. Good lesson for me!",
        "41. Rb6 Rc8 42. Nb1 Be6 43. Kd1 Bh3": "\"I retired the knight to b1 in order to answer Nd2 to Bc4. I didn't see this brilliant sacrifice. \nIf I go direcly for the g3 pawn, with Nd2, you will play c5, and I cannot take because of Bc4, winning a piece. Very nice. \"",
        "44. Ke1 Bxg2 45. Nd2 Bh3 46. Rb7 Rg8 47. Rg7 Rxg7 48. hxg7+ Kxg7 49. f4 h5 50. Nf3 Bg2": ""
    },
    "url": "https://gameknot.com/annotation.pl/london-vs-dutch-lost-in-the-endgame?gm=20412",
    "gameName": "London vs. Dutch, lost in the endgame",
    "players": "damalfi (1661) vs. bravura (1658)",
    "opening": "Dutch (A80)"
}