{
    "moves": {
        "1. d4 Nf6 2. Nf3 g6 3. Bf4": "My beloved London. It is not that wonderful against the king fianchetto, but still I feel confortable with it. ",
        "3... Bg7 4. c3": "The solid move I like. Of course c4 is playable, but I think it gives some undeserved balance for black, weakening the black diagonal.",
        "4... d5 5. h3": "No hurry. f5 is a worderful outpost for black's lsb, so let's keep it controlled.",
        "5... Nbd7 6. Nbd2 O-O 7. Qc2": "Controlling e4. I don't have a plan yet. ",
        "7... b6 8. e3 c5": "Ok, black just provided me of a \"hole\". It is not very useful, but the alternative plan is Be2, in sight of Ne5, g4, g5, and the black knight in f6 has to retreat. But this is very unilkely to happen, since black has many tempoes to \"do something\" in the meanwhile.\nWith the move I played, I intended to give the lsb some activity before black can play c4, trapping it. ",
        "9. Bb5 Bb7": "If 9. ..., a6, 10. Bc6, just for fun. I have to be very careful not to have this bishop trapped. Of course, I am prepared to exchange it with the knight, since it is not likely to have a great game against the fiachetto. ",
        "10. g4": "Well, this is just to make him wondering what the hell am I doing :-D.\nAs long as the white diagonal is closed (and it will stay like that, no doubt), I can do moves like this without fear. \n",
        "10... c4": "Oh, well, queenside is blocked, so I can think about attacking the kingside, which is not easy. Let's make some room first. ",
        "11. Ne5 Nxe5": "Hmmm... yummy. I can start to clear the kingside landscape. ",
        "12. dxe5": "You will say: but you are opening the white diagonal! In fact: no risk, no gain. I thought that 12. ..., d4, 13. exN, d3!, 14. Qa4, BxRh1, 15. fxg7, Kxg7 (or Re8), 16. ...xc4 (B or Q), would have been nice to play. Too deep and rich to calculate, but funny.  \nProbably my opponent was a little worried to take this path. ",
        "12... Nd7": "I expected Ne4. The exchange is not good for me, because the pawn is supported by the Blsb. f3 is not good because Nc5 threats Nd6+, a wonderful outpost, so the game would have been even or bad for me. \nI think this move is intended to compell me to exchange my lsb with the knight, since if I defend it with Nf3, after e6 it would have been an easy target.",
        "13. Bxd7": "But I think it is ok to exchange this bishop, since it is doing basically nothing :-)",
        "13... Qxd7 14. Rh2": "Don't think I didn't realize the danger on the white diagonal... :-) d4 - d3 is wonderful for black.\nI am sure black could have had some advantage playing it before, but it is hard to review.",
        "14... e6": "Now, the position looks even to me. I don't see weaknesses in black's position, nor I see which way he has to attack me. His bishops are wonderfully placed, but obstructed. I still don't know where the game is going to. ",
        "15. O-O-O": "Nf3 would have been better. But this is not so bad, since d4 is met by Nxc4...",
        "15... f6": "The logical break-in, which leaves e6 weak but opens the f column for black. Fortunately, f2 is well covered by the rook (this is the reason that Rh2 was preferred to Rg1. Now, I can have the other rook on g1, and keep all my fire power against the black king).",
        "16. Nf3": "Of course, d4 is not possible now for black. ",
        "16... fxe5": "I was tempted, here, to play Bxe5, since I liked the knight to be there, in sight of Nxg6's sac or something like that. But I didn't see it clear, not more than to have a bishop on the black diagonal!",
        "17. Nxe5 Bxe5": "A mistake, I think. Now my bishop is strong and black has no knight to take it away from it. ",
        "18. Bxe5 Rf7": "Trying to compensate by occupying the f column. Logical. d4 is still not possible because of the rook.\nNow, the logical answer would be f4. Black has to play g5 if he wants to break in... ok. But...",
        "19. h4": "There is no real hurry to defend f2, and I can use the tempo in order to gain more control and more threats on the kingside.\nNote that the black queen is doing almost nothing, and the Blsb is useless. ",
        "19... Raf8": "Still not a real threat. ",
        "20. h5 g5": "Of course, but now...",
        "21. h6": "Hmmm... what an annoying pawn I have!",
        "21... Rf7f3": "This rook is not annoying at all. But my attack is stopped. How to progress?\nThe only piece that can do something is my queen. So, even if it takes a long way, let's put it in the fight.",
        "22. Qd2 Qd8": "At last. But this is not the best move for the queen, in sight of what's coming.",
        "23. Qd4": "I know I am giving away the f2 pawn, but no risk, no gain. But NOW I have a plan, a tactic. If I remove the dsb, black is forced to defend the mate in g7 (this is why I said the black queen was not very well relocated some moves ago). Nothing really special, but still... ",
        "23... Rf3xf2": "Is black seeing that after 24. Bg3, his only move that doesn't lose a quality is Rf2-f6?",
        "24. Rh5": "This allows black to spend some tempoes in doubling rooks on the second row. There must be some \"hole\" in black's position... g5 is, no doubt. ",
        "24... Rg2": "Falling in the trap. ",
        "25. Bf4": "And this is the key. I think I've won, now. ",
        "25... Rf7 26. Rxg5+ Kf8 27. Qh8+": "The purpose of moving the king from g.",
        "27... Ke7 28. Rg8": "Threating Bg5+ as well. ",
        "28... Qd7 29. Bg5+ Kd6 30. Rd8": "Forced material gain. But black could have tried Rf7-f2, being just a tempo from drawn for perpetual check. \nWhite should have played RxQ+, KxR, Qxh7+, Kc6 or c8, also winning because of the h pawn (since white should have lost his queen for the two rooks), but with an interesting resistance. ",
        "30... Qxd8 31. Qxd8+ Kc5": "Now there are a couple of lines to mate, very nice.",
        "32. Be7+": "If Kc6, Qd6+, Kb5, Qd7+, now if Bc6, white has Qxa7, that forces black to avoid a4# by something like RxB (but a4!, Kc5, QxR#) or Bsomewhere, with no much more ways to escape. ",
        "32... Kc6 33. Qd6+ Kb5 34. Qd7+ Ka5": "Bf6 could have resisted a little longer, as explained, since a4+ is not the best move: Kxa4, if QxBf6+, Ka5, Bb4+, Ka6, Qa4+ Kb7. \nAnd if Kxa4, Qxa7+, Kb5. \nWhite should win with Bf6 Qxa7!, but it is a little harder to see.\nThe text move, unfortunately, loses at once, since the escape square b7 is blocked by the bishop. ",
        "35. Bb4+ Ka6 36. Qa4#": ""
    },
    "url": "https://gameknot.com/annotation.pl/london-vs-fianchetto-with-9-bb5?gm=32100",
    "gameName": "London vs. fianchetto with 9.Bb5",
    "players": "damalfi (1748) vs. j0st (1629)",
    "opening": "King's Indian (A48), London system"
}