{
    "moves": {
        "1. d4": "An interesting and very hard to analyze position in the middle game, and a long and very tactical chain, cut by a blunder from my opponent, in a very difficult position. ",
        "1... d5 2. Nf3 Nf6 3. Bf4 c5": "With the c column open, white should defend b2 with the queen, so it is important to play c3 and not e3, or black will go Qb6, creating problems. ",
        "4. c3 Nc6 5. e3 Qb6": "This is the good one. With black, against a London attack, is necessary to attack the white's queenside early, or the white's attack on the kingside will make you suffer.",
        "6. Qc2 g6": "And this is another good one. The threat of Bf5 forces the white to defend. ",
        "7. b3 Bf5 8. Bd3": "Played with fear of the consecuences of black's c4. Because I'll win the pawn in f5 after the bishop's exchange, but then black will have his return value on b3, and my King is still in the center. ",
        "8... e6 9. Nbd2": "Ok, let's play keeping the unresolved tension... but I protect b3 in the meanwhile, since he protected f5 ;-)",
        "9... Rc8": "I feel inferior, now. Good opening for black. And he's almost trheating to open the c column. BxB doubles a pawn, but... I don't know if it is worthwhile.",
        "10. O-O": "If he goes c5xd4 and then Nb4, I probably will lose the bishop in d3. ",
        "10... Ne7": "This passive play gives me some counterplay in order to balance the situation. ",
        "11. Be5 Bg7 12. dxc5": "I am speculating now with the uneasy and exposed position of his queen. ",
        "12... Qd8": "I thought he would have taken the pawn, but of course I had Bd4. \nBut now what? The plan is: 1 not to leave him castle. 2. Take advantage of the d column with the rook after exchanges and if he Rxb5, Ne4. In some variants, it threats both the bishop (after re-taking the N in F6) and the rook. But it doesn't work. \nSo what?\nSo I choosed to solidifying my pawns and take advantage of them. Too bad he will castle. ",
        "13. b4 O-O 14. Bd6": "I have now a very strong advanced post on d6, but at the price of giving him the black diagonal. Very interesting, I think. ",
        "14... Re8": "Now it was complicated. I could see some advantage, but with a time more. My wsb and my queen are pinned, this is really embarassing. So I analyzed a lot, and took my chance.",
        "15. e4 dxe4 16. Nxe4 Nxe4 17. Bxe4 Bxe4 18. Qxe4": "I calculated before than after Bxc3, white gets advantage from his threat Qxb7.",
        "18... Qd7": "He, correctly, defends b7. My calculations gave me advantage, but now it is really complicated to take advantage correctly from it. \n\n19. Rad1... defends c3, because if Bxc3, Be5 and black loses the bishop since he has to defend his queen.\n19. Rc1... defends c3, but allows the black queen to reach b5 and a6. I won't die because of that, but I'd like to \"squeeze\" him the most. So I considered\n19. a4... the queen can go to c6, allowing him some freedom, and leaves c3.\n19. Ne5. Prevents the black queen to go to c6, and BxN favours me, in theory. It's ok, apparently. But he has Nf5, to which I should play Rd1. This is the reason 19. Nd4 is slightly inferior. But Ne5 allows Qb5. Let's look for surprising and not natural moves: \n19, g4... prevents Nf5. But, again, loses c3.\n19. Ng5... because if black f5, Dxe6. But again, it loses c3 without compensation. \n\nSo, this is a very complicated position for me. I cannot say I did know how to manage it correctly, I had to play \"blind\".",
        "19. Rad1": "After all, it seemed the most aggressive move. Even if it allows...",
        "19... Qc6": "Now, to exchange queens is good for him, since my queen has more activity than his. I tried to be more aggressive (always I do, even if it is not always the best idea). ",
        "20. Qf4": "and not Qh5. My idea is Ng5, in order to try to make him play f5, leaving the e6 pawn somewhat weak. ",
        "20... Nd5": "Now, the Knight is far from the king, and I can act. If I moved the queen right away to h4, Nf5 grabs my good bishop or defends h6...",
        "21. Qh4": "Letting definitively the pawn in c3 (and b4). I misplayed the last two moves, but now I have an attack over the kingside. Tactics plays an important role here. ",
        "21... f6": "Now, e6 is weak, but I cannot take advantage of it right now. And his pawn blocks his own bishop. ",
        "22. Nd4": "Now my knight cannot be taken with the bishop.",
        "22... Qa4": "Now, I have to explain that I was tempting him to take the a2 pawn! The idea is Ra1, and eventually to take a7, g7, and display an attack on the 7º file. Even at the cost to lose my queen pawns, I \"must\" find a tactical way to make my previously weak moves worth to have been played. ",
        "23. Qh3": "Ok, now I am attacking e6, and it doesn't matter he will take c3. But more than that, I am aiming to d7 with my queen, since I thought a next logical move from his side would be e5...",
        "23... e5": "...and he did it. If I would be a master (but I am not, I'm just an average player), I would say that you must learn to see when to leave something unattended (c3) in order to take time to create threats. And that multiple threats normally win. But I must admit I didn't see how Qh3 strong was when I started my plan avoiding the exchange. What I correctly estimated was that, being my queen much more mobile than his, I must use it and not exchange it. But this is an early lesson. \nBut I didn't see all the comsecuences of my move. ",
        "24. Ne6": "!? Observe the Nd5 is \"en prise\", which is pretty obvious, but limits the possible move for him. \nOk, now he should think about Nxc3, 25. Qxc3, RxN. This is good for him, since he can push his king's pawns. But my replay could have been  Nxc3, 25. NxBg7, NxRd1, 26. NxRe8, RxN, 27. Qf3, Nb2 (or he loses it), and now white has both 28. Qxf6 or Qxb7, that still give a good positional advantage. So, wisely, he didn't went for it. But the choice wasn't better. I wonder if black has any chance here, and my thought is \"yes\". But the game is very delicate for him. ",
        "24... Qxa2": "Ah... defending the knight, knowing the queen can move trought the white squares. Well, so I have the chance to take real advantage of the 7º row, so I need to take away my Knight to open the way for my queen. But I have also to eat 2 pawns up there... one is granted, but the other isn't (and, without the other, all the 7º row plan won't work). ",
        "25. Nxg7 Kxg7": "Now, I should have taken the chance inmediately with 26. Qd7+, which assures me the g pawn. Right moves, wrong order.",
        "26. Rda1 Qc4 27. Rxa7 h5": "Ok, probably he fears the Q and R conjunction in h7, and he saw that to try to defend the pawn with 27. ..., Qb5, fails to 28. c4!, and black loses either the d5 knight or the b7 pawn. (Kf5 doesn't work here, since 29. cxQ, KxQ+, 30. gxN and black cannot prevent to lose b7 and the white pawns go to promotion soon). \n\nA plan to be considered was Nxc3, , leaving the 7º row to 28. Qd7+, Kh6, 29. Rxb7 (or Qxb7), with the plan: 29. ..., Ne2+, 30. Kh1 (forced), Ng3+!, with perpetual check. \nNevertheless, white has a sadistic tactic here: 31. h2xN, QxRf1+, 32. Kh2 (forced), and then... ? Qxf2, and 33. Qh7+, Kg5 (forced), 34. Qh4+, Kf5 (forced), 35. g4+, and black loses the queen!\nOf course, black can play also other moves, like 32. Rh8, in which case, white will go on with 33. Qh3+, Kg4 (forced), 34. f4+!, exf (forced), 35. Bxf4, QxB (forced), losing the queen for a bishop and a pawn. \n\nSo you see, the situation is already very compromised for black. Nevertheless, I must be very careful with some surprise over my king with black Q and N, since if I lose this one by perpetual or something, I will shoot myself :-)",
        "28. Qd7+ Kh6 29. Rxb7": "Guns armed and aiming. Still, you can believe it or not, I have to keep thinking. ",
        "29... Nf4": "?! Even now, a good move, since it covers very weak points, and threats the Ne2+ - Ng3+ sequence we saw in the last comment! Nevertheless, it would have been much better Nxc3, not in order to win the pawn, but to allow d4 accessible for the queen, too. This will prove to be very important for black, and a key to his loss. \nIn that case (Nxc3), my plan would have been: 30. Qg7+!, Kg4 (forced), 31. f4+, and I think black is almost lost: if exf, 32. Bxf4+, if Kf5, 32. fxe+, and to any other king move, white queen takes pawn with check and mate in few. ",
        "30. g3": "With this move, I pretended to free my king from the perpetual trap. \n\nIf Ne2+, 31. Kg2, Qe4+, f3! and the black is stopped. But if 31. ..., Nf4, I must be very careful at 32. g3xN, since Qe4+, and if the white king tries to escape from the perpetual threats, it will be mated: 33. Kh3, Qf3+, Kf4 (forced) and g5+!, and ckeckmate in the next!\nSo I have to think about all the alternatives: Kh1, Ke3. I won't do it here now, because it will take really very long for both of us, but you can enjoy the tactics black have, and that often lead him to mate me!\n\nSo, I cannot really assure 30. g3 this is a good move or not, but, being black, I would have gone for Ne2+, without any doubt. He didn't. \n",
        "30... Ne6": "Very good, indeed. Now, g7 is forbidden for my Queen, and I analyzed Qh7 without finding a clear victory. \nNow, it becomes very clear the difference would black had taken the c3 pawn: I couldn't have played my next one. ",
        "31. f4": "Can I ask for a (!) here? I am threatening mate in h7. He must defend, so...",
        "31... Reh8": "Now, BOTH my checkpoints have been defended. But my attack now comes from another side. I cannot imagine (at my poor chess level) a most interesting play.\n\nBlack cannot take exf, since 32. Bxf4+ (threatening now mate in h7), NxB (forced), g3xNf4, and black cannot stop one of two queen's mates. ",
        "32. f5": "...and NOT fxe, that makes me lose a tempo after f5. ",
        "32... gxf5": "Forced. He cannot move the knight, or 33. Qg7+, Kg5 (forced), g3xf4+, winning, both if exf (Qxg7+ follows), or if Kf5 (fxe+ follows. In this case, he ends losing its queen for a rook, minimum. It is fun to go for it). ",
        "33. Qf7": "It seems to lose a tempo, but threats Qxf6+ AND pins the black knight. ",
        "33... Kg5": "The wise one. If Rc-b8, Re7 wins the knight.",
        "34. h4+": "But the cavalry comes to help!",
        "34... Kg4 35. Qg6+": "Now, black seems to be lost if he moves the king. Kh3, 36. Qf5+, Qg4, 37. QxQ, hxQ, and with 38. Rf2!, black cannot stop the following mate! Very nice. \nBut it is not: if 36. ..., Kxg3, I would have had some difficulty to go on. His king is trapped, but also is mine (by his own - awkward!), and a lost tempo anywhere can give me surprises, from perpetual to mate (look at something with Qd5+....), so I have to play with a lot of care. \nThis is the good part, many things occurred, and I have a crushing attack, and three blessed pawns on the queenside in the worst case, but the game is not over. \n\nAnyway, he thought he was lost, so moved...",
        "35... Ng5": "Do you see, Kg2 would be the winning move in a standard problem, but I don't want to allow his queen to check me (and, much more important, to free herself from his pawns trap and threatening my rook). So I have to think about something more. The \"simple\" hxK is probably good enough to win, but I had my doubts after Rc-g8 (maybe Rg7 is enough to win, but you never know... black always has Kxg3 and I cannot mate, neither win the queen with a check with the rook because of the damn pawn in e5, covering f4! So, it will take too long to analyze! But in some lines I saw, I got saved only by my pawns, or not even that... I still need to be careful!). ",
        "36. Qxf5+": "Let's see what happens NOT taking the knight... now. ",
        "36... Kxg3 37. Bxe5+": "Ok, maybe I am crazy. But now I AM threatening Rf4!, so the king cannot go to h4. The only other move is exB. After which, Qg4+, Qg5 (forced: if Kh3, Rf3#), after which I MUST exchange the queens (if I allow Kxh5+, surprisingly... I WOULD BE MATED IN FEW MOVES!), and then I will win with my pawns (and his king so far... curiously, if he checks me Rg8, HE goes mated in few moves... can you see this?). \nBut... is there anything better?\n38. Qxe5+, \n38. ..., Kh3, 39. Qe3+!, Kxh4 (forced, unless black wants to interpose the knight), 40. Rf4+\nQxR (forced), 41. QxQ+, Kh3, 42. QxN, and Rg8 doesn't help because of 43. Rg7, RxR, 44. QxR, Re8, 45. Kf2! and white mates in few moves!\n38. ..., Kg4. If I take the knight, I get stalled in perpetual checks, with care not to lose a tempo, or I can try 39. Qf5+, Kh3, and we are in pretty the same position I just analyzed it, with the big difference that I cannot play the winning Qe3+!\n\nSo I have to look for another move after Kg4. \nMaybe 39. Rg7, Rc8, 40. Qxg4+, and mate. \nSince I cannot see any other good move by black, I think I have won the game... Let's see if it is true.\n",
        "37... Kxh4": "Well, this is a blunder, or I was right. But it was a blunder, because all other variants are much longer.",
        "38. Rf4+": "Now, even if there is no inmediate mate he loses the queen and any hope. "
    },
    "url": "https://gameknot.com/annotation.pl/london-nice-midgame-king-hunt?gm=22408",
    "gameName": "London, nice midgame, King hunt",
    "players": "damalfi (1670) vs. chrisg (1649)",
    "opening": "Queen's bishop game (D02)"
}