{
    "moves": {
        "1. d4": "A good sacrifice saves a bad opening. ",
        "1... d5 2. Nf3 Nf6 3. Bf4 e6 4. Nbd2 c5 5. e3 Nc6 6. c3": "This move is necessary here to prevent black's Qb6, making possible the countermove Qc2.",
        "6... Bd6 7. Ne5": "The \"key\" of this opening. If something takes my Knight, I take with the pawn. While it seems to make my bishop useless, it provides me with a strong \"disturbing element\" that allows me to attack the kingside. In fact, the best strategy for black is to castle queenside. ",
        "7... Qc7 8. Ndf3": "Just in time, as foreseen. ",
        "8... O-O": "He \"falls\" in my preferred attack scheme. ",
        "9. g4": "Slower but safer h4, or even h3-g4. But I wanted to open the g column. ",
        "9... cxd4 10. exd4 Nxg4 11. Nxg4 Bxf4 12. Rg1": "Now, the black bishop is bothering me, yes, but my guns are pointing at the enemys heart. ",
        "12... f5": "The right one (ouch!)",
        "13. Ne3 Bxh2 14. Rg2 Bf4 15. Bd3": "This bishop won't do anything, here, but I have to prepare the run of my forces across the 1 row. Also, it means that a future f5-f4 would be almost impossible for him. ",
        "15... Bxe3 16. fxe3 h6": "Anyway, this entire line is not the best for white, and in fact I am inferior now. ",
        "17. Kd2": "Things you have to do in order to speed up the attack. To move the queen would have been too slow, since it has no good square. Now, it can go to h1, and the other rook to g1...",
        "17... g5": "Wrong line. Black should have developed, solving his Bc8 problem, instead of trying a futile attack. ",
        "18. Nxg5": "Of course. If hxN, Rxg5 , Kf7, Qh5  etc. He loses his queen for a rook, minimum.",
        "18... Kh8 19. Qh5": "With my pieces like that, I recovered the position, with advantage. ",
        "19... Qg7": "What else? Maybe Rf6 would have been better. ",
        "20. Nf7+": "Nice, isn't it? RxN, RxQ, and if QxN, Qxh6, Qh7, Qxf8 winning. ",
        "20... Rxf7 21. Rxg7 Kxg7": "My other rook is not trapped as his.",
        "22. Rg1+ Kf8 23. Qxh6+ Ke7 24. Rg8 Nd8 25. Qg5+": "Now, it's just a matter of time. ",
        "25... Rf6": "Uh oh, another possibility for me to simplify. Otherwise, black could have resisted with ugly position, Kd7...",
        "26. Rxd8 Kxd8 27. Qxf6+": "The game is over...",
        "27... Kc7 28. Qe5+ Kd7 29. Bb5+ Ke7 30. Qc7+ Kf6 31. Qd8+ Kf7 32. Be8+ Kg7 33. Qe7+ Kg8": "With Kh6 back could have resisted a little more, but without hope. ",
        "34. Bg6 b6 35. Qf7+ Kh8 36. Qh7#": ""
    },
    "url": "https://gameknot.com/annotation.pl/london-saved-by-nice-sac?gm=21655",
    "gameName": "London, saved by nice sac",
    "players": "damalfi (1643) vs. mb1122 (1669)",
    "opening": "Queen's bishop game (D02)"
}