{
    "moves": {
        "1. d4": "A fuzzy middlegame resolves into victory. A blunder on each side. ",
        "1... f5 2. Nf3 Nf6 3. Bf4 e6": "When someone plays this opening, specially against my favorite London attack, I have always the feeling that I must be able to destroy him. And I never do. \r\nSo I do actually fear of players that use it against me. They must be very sure of a deep knowledge of it to play it. I started to fight against my fear of this opening. And willing to face it, of course, with all my senses alerted and a desire to be very, very bad with him, a desire to finally beat this \"ugly\" and \"weak\" scheme that... beated me so many times! ",
        "4. h4": "Dare to play g6 and I will sure play h5. No problem I don't have any support to advance the g4 pawn. Oh, it would have been nice, but no, I am so sure of my absolute superiority that I can go on without it. At least: this is what I wanted him to think! (Actually I realized it afterwards :-)",
        "4... Be7 5. Nbd2 O-O": "Sure, sure, why he is so damned sure that there is no danger in the kingside castling? Sure he had read hundreds of books about this, and knows how to face almost all attacks (just as I do with my version of the Scandinavian). So the fear reverted to me. I am sure he was not aware of that, but this actually was... an aggressive move by him!\nA strong desire to play h5 at once. But the support on g5 could be necessary in the future. One of the keys of this would be to open the h coumn with some exchange on g5. ",
        "6. c3": "You will say that c4 was the good one. And it probably is. But I have not read any book, and I know that normal moves are faced, they always are. But I believe in my God: the London System. And in this scheme, the queenside is very hard to attack for black, far and unaccessible as the peak of a high and rocky mountain. Too bad if it seems a loss of time, or a bad move... ",
        "6... Ne4": "Experience told me that, with some care, this advance is not good for black, in the long term. So, this move, that probably he played in order to making me pay for my bad opening, didn't mean any aggression to me, being just a part of a masterplan, \"my\" London System attack, in which this knight never plays a real threat (if I play with the due care to black queen and bishop). \nNow, the natural move, here, would have been to protect the h4 pawn, maybe with an ugly move like g3... bleah! It stinks. Where is the attack in g3? It just builds a trap for my beloved bsb. ",
        "7. Qc2": "A central pawn for a lateral one. Good for me, unless he does something. \nUnfortunately for me, he can, so...",
        "7... d5": "It is not the first time I play against this, but now it is not easy for white to keep a thing called \"attack\". Again... I was playing as if I had a masterplan...",
        "8. e3": "It seems that black has an attack, but he would have to prove it. ",
        "8... c5": "Here the \"mild\" complexities of this position. Variants I looked to...\r\n\r\n9.\td2-e4\tf5-e4\r\n10.\tf3-g5\th7-h6\r\n11.\tg5-h3\te7-h4\r\n12.\tg2-g3\th4-f6\r\n13.\tc2-e2\te6-e5\r\n14.\td4-e5\tc8-h3\r\n15.\tf1-h3\tf6-g5\r\n16.\th3-e6+\tg8-h7\r\n17.\tf4-g5\td8-g5\r\n18.\th1-h5\tg5-g6\r\n19.\te6-d5\tf8-f3\r\n20.\th5-h4\r\n\r\n9.\td2-e4\td5-e4\r\n10.\tf3-g5\th7-h6\r\n11.\tg5-h3\te7-h4\r\n12.\tg2-g3\th4-f6\r\n13.\te1-c1\tc5-d4\r\n14.\te3-d4\td8-a5\r\n15.\tc1-b1\te6-e5\r\n16.\tf1-c4+\tg8-h8\r\n17.\th3-g5\te5-d4\r\n18.\tg5-f7+\th8-h7\r\n19.\tf4-h6\tf8-f7\r\n20.\th6-f4+\th7-g6\r\n21.\tc4-f7+\tg6-f7\r\n22.\tc3-d4\tb8-c6\r\n23.\td4-d5\tc6-b4\r\n24.\tc2-b3\tf7-g6\r\n25.\td5-d6\tb4-d3\r\n26.\tb3-g8\td3-f2\r\n27.\tg8-h7+\tg6-f7\r\n28.\th7-h5+\tf7-f8\r\n29.\th5-h8+\tf8-f7\r\n30.\th8-h5+\tf7-f8\r\n31.\td6-d7\tg7-g5\r\n32.\th5-e8+\tf8-g7\r\n33.\te8-h8+\tg7-f7\r\n34.\th1-h7+\tf7-e6\r\n35.\th8-e8+\t\r\n\r\n9.\td2-e4\td5-e4\r\n10.\tf3-g5\tc5-d4\r\n11.\te3-d4\th7-h6\r\n12.\tg5-h3\te7-h4\r\n13.\tg2-g3\tg7-g5\r\n14.\tf4-e5\tg5-g4\r\n15.\tc2-d2\tg4-h3\r\n16.\td2-h6\td8-g5\r\n17.\th6-h8+\tg8-f7\r\n18.\th8-h4\tg5-h4\r\n19.\tg3-h4\t",
        "9. Nxe4": "I decided to play a pawn sac in order to develop the h column attack. I am sure that he didn't expect a move like this, that apparently makes just me lose a pawn. \r\n",
        "9... dxe4 10. Ng5": "The \"normal\" one would have been Ne5. This allows black to take the h pawn. But... this way, he also gets it, and besides, the knight would be in a horrible positiont. Do I have trap for him? No, I really didn't. I was just playing as if I had it (the previous procedure is dangerous. Don't try it at home or without your's parents advice! :-) ",
        "10... h6 11. Nh3": "Why should I have allowed this? Oh, yes, because of c5. So no problem, just exchange c5, and everything's fixed. \nAnd I couldn't castle queenside in order to take advantage of it. I don't want my king to be blocked in the center!",
        "11... cxd4 12. exd4": "The base of the London System is that the white's queenside must keep being a fortress. Period. ",
        "12... Bxh4": "And no, not the stupid g3 move he could expect!",
        "13. Bc4": "The attack on the weak e6 coud have been set without the sac, but it is too good to avoid it. ",
        "13... a6": "Oh, wonderful masterplan! g4 makes me lose all my steam! But... see what happens. ",
        "14. Qb3 Re8": "Now it is the tough moment. How to continue? \nI can play: g3, or o-o-o, Be5, or d5. \nLet's see some variants. \n\n4.\tc2-b3\tf8-e8\n15.\td4-d5\th4-f2+\n16.\te1-f2\td8-h4+\n17.\tg2-g3\th4-g4\n18.\td5-e6\tg4-f3+\n19.\tf2-g1\tb8-c6\n20.\tf4-c7\tc6-a5\n21.\tb3-a4\tf3-e3+\n22.\tg1-g2\te3-f3+\n23.\tg2-g1\tf3-e3+\n24.\tg1-f1\te3-f3+\n25.\th3-f2\te4-e3\n26.\ta4-e8+\tg8-h7\n27.\th1-h6+\th7-h6\n28.\te8-h8+\th6-g6\n29.\th8-e8+\tg6-g5\n30.\te8-e7+\tg5-g6\n31.\te7-f7+\tg6-g5\n32.\tf7-e7+\tg5-h6\n33.\te7-h4+\th6-g6\n34.\tg3-g4\ta5-c4\n35.\th4-h5+\tg6-f6\n36.\tc7-d8+\tf6-e6\n37.\th5-e8+\te6-d5\n38.\ta1-d1+\tc4-d2+\n39.\td1-d2+\te3-d2\n40.\te8-f7+\td5-c6\n41.\tf7-c7+\tc6-d5\n42.\tc3-c4+\td5-d4\n43.\tc7-g7+\td4-c5\n44.\tg7-c7+\tf3-c6\n45.\td8-e7+\tc5-d4\n46.\te7-f6+\td4-c4\n47.\tc7-f4+\tc4-d5\n48.\tf4-d2+\td5-e6\n\n\n15.\tg2-g3\tg7-g5\n16.\tg3-h4\tg5-f4\n17.\th1-g1+\tg8-f7\n18.\th3-f4\td8-h4\n19.\tc4-e6+\tc8-e6\n20.\tf4-e6\te8-e6\n21.\tb3-b7+\te6-e7\n22.\tb7-a8\te4-e3\n23.\te1-c1\th4-f4\n24.\ta8-d5+\tf7-f6\n25.\tf2-e3\tf4-e3+\n26.\tc1-c2\te3-e4+\n27.\td5-e4\te7-e4\n28.\tc2-d3\th6-h5\n29.\tg1-g8\tb8-c6\n30.\td1-h1\tf6-f7\n31.\tg8-h8\tf7-g6\n\n14.\tc2-b3\tf8-e8\n15.\tf4-e5\tb8-c6\n16.\th3-f4\tc6-e5\n17.\tf4-e6\tc8-e6\n18.\tc4-e6+\tg8-h8\n19.\td4-e5\th4-f2+\n20.\te1-f2\td8-d2+\n21.\tf2-g1\te8-e6\n22.\tb3-e6\td2-b2\n23.\th1-h6+\tg7-h6\n24.\te6-h6+\th8-g8\n25.\th6-c1\tb2-c1+\n26.\ta1-c1\t\n\n\n14.\tc2-b3\tf8-e8\n15.\td4-d5\te6-e5\n16.\td5-d6+\tg8-h8\n17.\tf4-g5\th4-g5\n18.\tc4-f7\td8-d6\n19.\tf7-e8\td6-d2+\n20.\te1-f1\te4-e3\n21.\tb3-c4\tc8-e6\n22.\tc4-e6\te3-e2+\n23.\tf1-g1\te2-e1+\n24.\ta1-e1\td2-e1+\n25.\tg1-h2\te1-e4\n26.\th3-g5\te4-f4+\n27.\th2-g1\tf4-c1+\n28.\tg1-h2\tc1-f4+\n29.\tg2-g3\tf4-f2+\n30.\th2-h3\th6-g5\n\n\n14.\tc2-b3\tf8-e8\n15.\tf4-e5\tb8-c6\n16.\th3-f4\tc6-e5\n17.\tc4-e6+\tc8-e6\n18.\tf4-e6\td8-e7\n19.\te6-g5+\te5-f7\n20.\tg5-f7\th4-f6\n21.\tf7-h6+\tg8-h7\n22.\th6-f5+\t\n\nf8-e8\n15.\tf4-e5\tb8-c6\n16.\th3-f4\tc6-e5\n17.\td4-e5\th4-g5\n18.\tf4-e6\td8-d2+\n19.\te1-f1\te4-e3\n20.\te6-g5+\tg8-h8\n21.\tg5-f7+\th8-h7\n22.\tf7-g5+\th7-g6\n23.\tc4-f7+\tg6-g5\n24.\th1-h5+\tg5-g4\n25.\tf2-f3+\tg4-g3\n26.\th5-h3+\tg3-f4\n27.\tg2-g3+\tf4-f3\n28.\tf7-d5+\tf3-g4\n29.\tb3-c4+\tg4-g5\n30.\tc4-h4+\tg5-g6\n31.\th4-h5+\tg6-h7\n32.\th3-h2\td2-d5\n33.\th5-e8\tf5-f4\n34.\tg3-f4\tc8-g4\n35.\te8-a8\te3-e2+\n36.\tf1-e1\td5-d1+\n37.\ta1-d1\te2-d1+\n38.\te1-f2\td1-f3+\n39.\tf2-e1\tf3-f4\n40.\th2-f2\tf4-e3+\n41.\te1-f1\tg4-h3+\n42.\tf1-g1\te3-g3+\n43.\tg1-h1\tg3-f2\n44.\ta8-b7\tf2-f1+\n45.\th1-h2\tf1-f4+\n46.\th2-g1\tf4-e5\n\n14.\tc2-b3\tf8-e8\n15.\tf4-e5\tb8-c6\n16.\th3-f4\tc6-e5\n17.\td4-e5\th4-f2+\n18.\te1-f2\td8-d2+\n19.\tf2-g3\te4-e3\n20.\tc4-e6+\tc8-e6\n21.\tf4-e6\td2-f2+\n22.\tg3-h3\te8-e6\n23.\tb3-e6+\tg8-h7\n24.\th1-f1\tf2-b2\n25.\te6-f5+\th7-h8\n26.\ta1-b1\tb2-a2\n27.\tb1-b7\te3-e2\n28.\tb7-g7\th8-g7\n29.\tf5-f6+\tg7-h7\n30.\tf6-e7+\th7-h8\n31.\tf1-f8+\ta8-f8\n32.\te7-f8+\th8-h7\n33.\tf8-e7+\th7-g6\n34.\te7-f6+\tg6-h7\n35.\tf6-f5+\th7-h8\n\n14.\tc2-b3\tf8-e8\n15.\tf4-e5\tb8-c6\n16.\th3-f4\tc6-e5\n17.\td4-e5\th4-f2+\n18.\te1-f2\td8-d2+\n19.\tf2-g3\te4-e3\n20.\tc4-e6+\tc8-e6\n21.\tf4-e6\td2-f2+\n22.\tg3-h3\tf5-f4\n23.\te6-f4+\tg8-f8\n24.\tf4-g6#\t\n\n14.\tc2-b3\tf8-e8\n15.\tf4-e5\tb8-c6\n16.\th3-f4\tc6-e5\n17.\td4-e5\th4-g5\n18.\tf4-e6\td8-d2+\n19.\te1-f1\te4-e3\n20.\te6-f4+\tc8-e6\n21.\tc4-e6+\te8-e6\n22.\tb3-e6+\tg8-h7\n23.\tf4-e2\te3-f2\n24.\te6-f5+\th7-h8\n25.\tf5-f2\tg5-e3\n26.\tf2-f3\td2-b2\n27.\tf3-e3\tb2-a1+\n28.\te2-c1\ta1-b1\n29.\th1-h6+\tg7-h6\n30.\te3-h6+\th8-g8\n31.\te5-e6\tb1-f5",
        "15. d5": "Ohhh... breaking the center before the castling! What an enormous demostration of a masterplan... except for one little, obvious move...",
        "15... b5": "I didn't see it!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\nALL my plan - to sacrifice the h pawn in order to unbalance the center in my advantage - was pure crap. \nAnd I didn't see it.  \nIncredible (ejem :-). \nI could hardly believe it... how could I been so stupid? \nOh, no, another sillyly lost game!",
        "16. Be2": "Veeeeeery funny. Now I lose a second clean pawn. Oh, what a wonderful masterplan!",
        "16... Qxd5": "I tried not to change queens, and maybe I should have avoided it. But you see, I was discouraged. I was not trusting anymore my game. I couldn't see anything better that to wait for the ox to fall on my face...",
        "17. Qxd5 exd5": "So two straight pawns less, a knight very badly placed (since without the queens the planned attack on the kingside is hardly possible). A pawn storm coming down, and I have not even castled!",
        "18. O-O-O Bb7": "OK, ok, I have to fear the white diagonal. The advance of the black central pawns will point to weak white squares, with a lot of uneasyness for me. \r\nBut, to the other side, the only chance to make the game meaningful for me, up to this point, was to try to complicate things enough so I could hope in some trick or distraction by him. Yes, why not? The win is already his, so I have anything to lose. \r\nI cannot wait passively the pawn storm that is approaching. I will be squeezed to death, forced to give a piece for two pawns (with luck), thus staying in a lost game. \r\nAh, by the way: my knight being tied to the defence of the f2 pawn, and opening the way to diagonal power. As an hero in war movies, I was leaving my bulletproof jacket back in order to run faster, even if exposed to the enemy's fire... :-)))",
        "19. g4 fxg4 20. Bxg4": "Oh oh, suddenly my bishop pair shows itself at least as good as his...",
        "20... Bf6": "I see you come. The natural move would have been Be3, but again, I had to complicate things. The only weakness I saw was the bishops against the rook, taking advantage to the underdevelopment of his queenside (that compensates my knight bad position), but I bet that unless he plays soon g4 - and he will think twice to do that BECAUSE OF the sacrifice of the h pawn in the previous part of the game! - my knight will be an active battleforce after jumping to f4. Just a couple of meaningful moves in between... time enough for him to develop his queenside! Ah, he can still end in a neat 2 pawns advantage! But he will have to fight for it, and on the least inaccuracy, things could revert in my favour.  ",
        "21. Bh5 Rd8": "Ok, so now the rook is just where it wants to go. This wasn't a good move. From MY side! Just fine. Let's act as it was all part of a deep plan, and see if he gets scared. ",
        "22. Rhg1 Kh8": "He GOT scared! for nothing! And I won a tempo, pulling away my rook from the white \"radioactive\" white diagonal. ",
        "23. Be3": "I couldn't find anything better. My knight MUST participte in the game, even at the price to let him free his queenside. But, more than just that, my bishop is aiming at b6, bothering the rook occupation of the d column. If only I hadn't moved my white bishop!!!!",
        "23... Nc6": "Just fine, but much wiser would have be to play Kd7, preventing my bishop's next move. ",
        "24. Bb6 Rd6 25. Bc5": "With the white bishop in g5, I had Bc7 here... but not now. ",
        "25... Rdd8": "He insists not to move his rook on the white square because of my Bg4. But... should I go for drawn, betting he will not be able to take the rook away because of the bishops' combined force threatening to win the exchange? Maybe. But I had a \"master plan\" to carry on, do you remember it, some moves ago? I had no idea of which this masterplan would be. But it SEEMED to be a magic combination involving the two rooks and the open columns... that I couldn't find at all. But probably HE thought I had one, and make him be less aggressive that he should. ",
        "26. Nf4": "Ok, the knight comes into the play. Now is the time to prove that the whole plan, since Kg5 instead of e5, was just a superdeep combination I supposedly saw at the beginning of the midgame. ",
        "26... Ne7": "He choosed to defend. He couldn't have done this having played the knight to d7, as I suggested before. \nHmmm... it's looking as if black is starting to have the urge to be careful, to take care of his weaknesses... more than attacking (which I think it would have been his better plan). \nAnd this is the reason he doesn't see the horrible blunder that this moves represents. I checked it a thousand times, just to see what I could be losing after the piece win... and now, the game was psycologically reverted: now I am the one looking for a masterplan in my opponent's game... a masterplan that probably didn't even exist! \nSo I went for it. ",
        "27. Bxe7 Bxe7 28. Ng6+ Kh7 29. Nxe7": "Now, it is true I lost my beloved bishop pair but... you have to give something if you want to get something... now I am in advantage. What I pronosticated became true: he went inaccurated against a complex game. In other words: I have been able to find the small pieces of advantage, to have put them together and to get something from them... yummmm!!!!!",
        "29... Rd7 30. Nf5 Rf8": "Now, you see, the knight is not in danger, while the black king stays where he is. And to move it is a tempo I could have taken some advantage. \nTrue. \nBut... except for this detail of taking back a rook for a knight because of the ckeck, the check itself wasn't really a great progress in the attack! My attack (I started thinking in attack! This is a nice turn for me!).\nAnd you see, my pressure over g7 is mild, unless I double my rooks (still far). So, what if I don't take advantage of it, and let me exploit the OHTER threats I could do? A far better one came to be...\n",
        "31. Bg4": "This one. Isn't this threat more interesting than the pressure on g7? Kxh6 must be met someway. ",
        "31... Rdd8 32. Nxg7": "Nice! I recover one pawn. \nHe can take the knight, but after Bc8+ I will take his beloved bishop and more pawns...\nSo, my Knight came to be a force in this game... now, threatening Ne6. \nRg8 worths a look... but it isn't enough to recover the piece. ",
        "32... Rxf2": "Oh, yes, this \"little\" detail. Now, I have to fight against the e pawn, threatening to crown in e1. So, back to the hard thinking. \r\nIt was hard because I bet that he doesn't have the chance to make suffer with his pawns, but... I cannot be so sure. I, again, played \"as if\" I was sure of it. ",
        "33. Ne6": "With my knight on d4, the black pawns will be half-blocked, and the e one will be on e2. Maybe. ",
        "33... Rg8 34. Nc7": "Where does this crazy knight go? Why so far from his favorite and strongest squares?",
        "34... Rd8 35. Bh5": "And what is this stupid bishop doing there?",
        "35... Rf6 36. Ne8": "You see, I was just causing him some headache. He could survive, for sure, but he had to be aware of many threats... Rg7, Bg6+... I AM being very, very nasty. ",
        "36... Rb6": "In order to protect the bishop after R76+. But...",
        "37. Rdf1": "Give me an exclamation mark here. He is blocked by his own pawns, and my pieces are all active... ",
        "37... Rd7": "Another blunder. I don't know if he could have saved himself. Maybe Ba8, or something evenly ugly. ",
        "38. Nf6+ Rxf6 39. Rxf6 b4 40. Bf7": "Threatening mate in 2.",
        "40... Rd8 41. Bg6+": "Winning move. Kg7, Rf7+, winning the bishop. Kg8, Bxe5+ and mate. ",
        "41... Kh8 42. Bxe4": "I didn't defeat the f5 scheme of my opponent, but I won a lost game. With a great help by his side. I'm sorry for him. "
    },
    "url": "https://gameknot.com/annotation.pl/london-vs-dutch-won-by-blunder?gm=26447",
    "gameName": "London vs. Dutch. Won by blunder...",
    "players": "damalfi (1684) vs. yvanovitch (1684)",
    "opening": "Dutch (A80)"
}