{
    "moves": {
        "1. d4 d5 2. Nf3 e6 3. Bf4 Nf6 4. c3 c5 5. e3 Nc6 6. Nbd2 h6 7. h4 a6 8. b3 Be7 9. Ne5 Bd6": "Strange move. It seems a plain loss of time. Actually, the bishos stays better in e7, in this scheme. He should attack the queenside, in order to free his lsb and stop my own attack on the kingside. ",
        "10. g4 Nxe5": "...And this seems to be a blunder... or maybe not. Maybe he thought he would have compensation for the piece, and in fact during some moves I thought he had. ",
        "11. dxe5 Be7 12. exf6 Bxf6 13. Rc1 Qa5": "It starts \"raining\", and my \"umbrella\" has some holes. ",
        "14. Qc2 e5 15. Bg3 Bxg4": "More rain... I realized I had to react, and soon. ",
        "16. Be2": "In order to take away the bishop pair without bolcking my B in g3 (I considered f3, too), and, if the exchange is accepted, to communicate my rooks. If Queen checks, c4 is ok, I think. ",
        "16... Be6": "The black center is impressive. I am two pawn under, despite my piece. Time to act...",
        "17. O-O": "Very risky, but I bet...",
        "17... g5": "Of course. ",
        "18. h5 Bg7": "He clearly wants to play f5, with devastating effects. ",
        "19. f4": "I evaluated the position and I knew I should break, in some way, his pawns army. I considered e4 or c4 carefully, but finally I decided for this \"crazy\" one. I realized I was exposing my king, allowing him to open the g column. ",
        "19... gxf4 20. exf4 e4": "But now I am ready to sacrifice! And the f pawn become a stunning attack force. ",
        "21. f5 Bd7 22. Nxe4": "He should have castled here. ",
        "22... dxe4 23. Qxe4+": "Suddenly, his center is broken, my attack is strong, and his pieces almost useless (look at the blocked queen...). Material is equal...",
        "23... Kd8": "I had to choose between Rd1, Qxb7, and... (but all the three moves will be done...)",
        "24. f6 Bf8 25. Qxb7 Rc8 26. Rfd1": "I needed this \"tempo\", allowing him to play...",
        "26... Rc7": "A quality (Bxc7) is a quality, but I was much more cruel. I planned a queen sacrifice, here...",
        "27. Qb8+ Rc8 28. Bg4": "I think it is a pretty good sight from my side. \nIf RxQ, 29. Rxd7+. Now: \n29..., Ke8, 30. Re1+, Be7 (forced), I had 31. Rxe7+, Kf8 (forced), 32. Rxf7+, if Kg8, 33. Rg7+, Kf8 (forced), 33. Bd6+ and f7#.\nif 32. ..., Ke8, 33. BxRb8 and I win with 34. Bc7#, regardless black's move. \nand if \n29..., Kc8, 30. Re7+ (and not any other), Kd8, 31. Rd1#. So he resigned. "
    },
    "url": "https://gameknot.com/annotation.pl/london-giving-back-a-piece-to-win?gm=22935",
    "gameName": "London, giving back a piece to win",
    "players": "damalfi (1715) vs. payam_eagle (1716)",
    "opening": "Queen's pawn game (D02)"
}