{
    "moves": {
        "1. d4 d5 2. Bf4 Nd7 3. Nf3 f6": "Not recommended unless you know it very well. It opens the BK to attacks by the Q on h5, if supported by Nxg6.",
        "4. Nbd2 e6 5. e4": "Opening the diag for the Q. ",
        "5... dxe4 6. Nxe4 Ne7": "Shielding g6. ",
        "7. Nh4": "Inviting to fork the two pieces.",
        "7... Nd5": "Black thinks he's smart, and plans to exchange the Rh8 for two pieces, with a great risk of having my Q trapped. ",
        "8. Qh5+": "Accepting the challenge, but of course, I'm not going for the previous line. ",
        "8... g6 9. Nxg6 hxg6": "If now QxR, NxB, and white loses. ",
        "10. Qxg6+": "But this saves my piece (I sacrificed a N for two pawns and black has a lot of developement difficulties, specially after...",
        "10... Ke7 11. Bd2": "...this move. Note that if I play c4, the black N has to go to b6, allowing my B to check him in b4. After c5, dxc, the threats is still on. ",
        "11... f5": "Qg4+ only helps him to exchange some piece and improve his position. So...",
        "12. Ng5": "Threatening a nasty check on f7 or e6. ",
        "12... Rh6": "Defends from both, but I still have a haven for my Q. ",
        "13. Qg8": "Now, Nc6 just doesn't work because it allows Qxd6+. ",
        "13... b6": "? Nf7, Nc6 and we have the exchanges he needs to balance the game. ",
        "14. c4": "...Now this N has no place to go to.",
        "14... Bb7 15. cxd5": "It allows black to defend d6, thoug. But I recovered my piece and, IF I can save my Q from being trapped, the game is almost won. Bb4 is still a strong threat. ",
        "15... Bxd5 16. Bb4+ c5 17. dxc5": "Gives him another tempo, but it is also opening the d column for my R. ",
        "17... bxc5 18. Bc3": "If Ba3, keeping the pressure on c5, Qa5+ would allow him to unravel his position. ",
        "18... Nf6": "Now he can play this, of course, since d6 is defended, but I still have...",
        "19. Qf7+ Kd6 20. O-O-O": "...and now d6 is threatened again. Now, if something like Qe7, I can happily exchange my Q and  I'll be fine, though not winning. ",
        "20... Ng4": "Threatening Nxf2, forking my Rooks. I don't mind: it's time to attack.",
        "21. Bc4": "Nxf2, Bxd5, NxRd1, BxRa8+, winning. But I overlooked my free N on g4.",
        "21... Qxg5+ 22. Bd2": "Q and R are threatened. Qg6 seems the only way to save the day for black, but even so, it was a tough position for black, who went wrong by playing...",
        "22... f4 23. Bxf4+": "Black can still save himself by playing Ne5, and after BxQ, NxB, BxR, NxR, black will have a great edge, but the game was still playable. My opponent resigned here. In case he wouldn't, the game would have gone like this: ",
        "23... Ne5 24. Bxg5 Nxf7 25. Bf4+ Kc6 26. Bxd5+ exd5 27. Bxh6 Bxh6+ 28. Kb1 Rb8 29. Rhe1 Bg7 30. b3": "...it's still a playable game.",
        "30... Nd6": ""
    },
    "url": "https://gameknot.com/annotation.pl/londons-at-work?gm=63308",
    "gameName": "London's at work!",
    "players": "damafi (1497) vs. sliwka (1567)",
    "opening": "Queen's pawn, Mason variation (D00)"
}