{
    "moves": {
        "1. e4": "In this game I come out ahead by a big blunder by white.",
        "1... c5": "The Sicilian my favorite!",
        "2. Nc3": "Closed variation of the Sicilian",
        "2... Nc6": "aiming for control of d4",
        "3. f4": "This looks like a hybrid between the closed and grand prix variations.",
        "3... g6": "Still aiming for control of the dark center squares and d4.",
        "4. Nf3": "Knights before bishops is the general principle here.",
        "4... Bg7 5. d3": "He abandons d4 for control of e4",
        "5... d6": "Preventing a pawn advance",
        "6. Be2 e6": "Preventing his knight from occupying d5 as an outpost.",
        "7. Bd2 Nf6": "I still have control of d4 now I develop my knight with no worries from pawn to e5",
        "8. O-O O-O 9. h4": "His immediate kingside attack is met symetrically.",
        "9... h5 10. Ng5": "A good outpost for white here as he aims for the h7 square.",
        "10... e5": "Probably not a good move here since he can move Nd5",
        "11. Be3": "He wants to grab my pawn on c5 with 12.fxe5 dxe5 13.Bxc5",
        "11... Nd4": "I prevent him from doing this by establishing an outpost of my own.",
        "12. fxe5 dxe5 13. Nf3 Bg4": "Bg4?  What if NxP?",
        "14. Nxe5": "He takes the pawn as expected",
        "14... Bxe2": "I threaten his Queen and Rook but not for long",
        "15. Nxe2 Nxe4": "Instead of taking his knight I sac my knight to take his bishop.",
        "16. Nxd4": "He takes my other knight and I take back with the pawn now I am threatening to take two of his bishops.",
        "16... cxd4 17. Nxg6": "He sacs his knight to destroy my kingside.",
        "17... fxg6 18. dxe4": "He takes my knight",
        "18... dxe3": "And somehow ive won the exchange by taking his bishop very complicated position.",
        "19. Qe2": "He wants to grab the e pawn.",
        "19... Qb6": "I protect it and also have a direct diagonal to his King!",
        "20. b3": "A gross blunder as he leaves his rook open for capture",
        "20... Bxa1 21. Rxa1 Rf2": "White resigned here.  Notice he cannot stop the advance of the e pawn."
    },
    "url": "https://gameknot.com/annotation.pl/looking-to-join-kings-and-queens-of-the-dungeon?gm=29800",
    "gameName": "Looking to join Kings and Queens of the dungeon?",
    "players": "hijonnyb (1335) vs. dungeonking (1295)",
    "opening": "Sicilian (B23), Grand Prix attack, Schofman variation"
}