{
    "moves": {
        "1. e4": "I basically always play e4. I'm a huge fan of regular, open, tactical sharp play.",
        "1... e5": "He plays e5- I relax, these are the games where I can use openings I'm a lot more familiar with.",
        "2. Nf3": "So I play Nf3, again, my usual.",
        "2... d6": "And Black goes for the Philidor's Defense. I'm not a real fan of this opening for Black. I think it's a tad passive, and allows White to just charge right into the center with attacking power. I can't remember any time where this opening gave me pause- is there a value in e5-d6 this soon at all?",
        "3. d4": "So, like I said, I just eagerly charge right in. Main line for White.",
        "3... exd4": "He takes. Probably best- I can't see much value in Bg4 if White has dxe5.",
        "4. Nxd4": "I prefer Nxd4. Qxd4 apparently does equally well in the databases, but say if you've played the Scandinavian defense as White, Qxd4 is usually immediately met by Black playing Nc6. Why throw a queen out when it just gets chased away?",
        "4... Nf6": "Black develops, sensing a more urgent need to castle instead of trying maybe Nc6.",
        "5. Nc3": "I continue my development, seizing more control over d5 and e4.",
        "5... a6": "He plays this, apparently the so-called Berger variation. I don't like this line at all. Yes, this stops White from putting either knight or the Bishop on b5, but this is passive for Black's developing and it's not like Black can't hold a grip on c6 in case I were to try and go in that way. If Black's king were in danger, I think the alternative ...Be7 would help get the King in a position to hide away sooner.",
        "6. Be2": "This bishop has nowhere good to go now, on the other hand, so I push it here to further prevent Bg4 from Black and I ready myself to castle.",
        "6... h6": "Once again, opting to passively protect the two strongest squares for the bishops to be on, but I think this is mostly a waste of time for Black. Black only has 1 back rank piece and no stake in the center, against my near perfect control of the center and three developed back pieces! White is clearly better here.",
        "7. O-O": "Putting my king away and allowing several possibilities for White's next best moves, ranging anywhere from f4, Re1, Bc4... the list continues.",
        "7... Bd7": "Once again, I think he's worrying about the wrong bishop. Why not Be7?",
        "8. Be3": "This was more of a waiting move. It maintains control over d4, and opens the door for the Queen to join the bishop on a possible h6 attack if the Black King castles short. Black must consider carefully.",
        "8... Nh7": "...Okay, I'm out of ideas. Why this???",
        "9. Bg4": "I miscalculated the strength of his next move, or even the strength of my bishop compared to his here. Frankly, looking back, I wish I tried f4 here or something.",
        "9... Nf6": "He moves the knight back. Not sure if I like the repetition of moves out of Black... the other knight on b8 was already protecting the Bd7 with the Queen. Heck, would even Ng5 be better?",
        "10. Bf5": "I know that I can't move the bishop to h3, and retreating seems like ripping a page out of the book I'm preaching against. So, I try to make the most out of a miscalculation, hoping to tempt Black into playing g6 and weakening the kingside even further.",
        "10... Be7": "Black finally plays this, aiming to castle, not seeming to mind the thought of my bishop on f5 yet.",
        "11. Qf3": "So I play this, having a plan to keep my control of f5 in case he decides to start an exchange.",
        "11... O-O": "He finally hides the king away to safety.",
        "12. h4": "There was an idea behind this, but once again, I think I miscalculated the situation. The idea here was to pin the pawn on h6 down and the g7 pawn would remain frozen in place as a result. It increases focus on the center and I would have superior pressure against his King in the end of the exchanges. Of course, this didn't quite go according to plan, but I can't say it was a complete failure either- my ideas wouldn't have worked if this pawn was still on h2. What was my best move here?",
        "12... Nc6": "Anyway, Black starts pointing his spears toward my center pieces, and I need to start considering how I want the exchange combinations carefully. Frankly, Black probably had the right idea here.",
        "13. Nd5": "I begin by threatening more pieces than Black. It's tough to say if this is inaccurate or not.",
        "13... Nxd5": "But he exchanges for this knight. I'm just going to stop speculating all combinations- after, if you have ideas, could you post them at the end of this set? For now I'll just go over my viewpoints:",
        "14. Nxc6": "I exchange this knight first to cause more of an instability on his queenside, and an attack on his Queen to boot. Black can't counterthreat, so this knight has to be addressed right now.",
        "14... Bxc6": "Except I was expecting him to capture with the pawn first. So I thought I'd still have Bxd7 after.",
        "15. exd5": "Instead I try to launch what I thought would be cutting my losses, but...",
        "15... Bb5": "...while I did eventually see this bishop landing here as a possible outcome, this was way back when I had the other bishop and two knights barking down b5. So no, I didn't exactly see this coming once the exchanges started, and immediately I was cursing not looking closer after the fact.",
        "16. Rfc1": "I know that I can't save the pawn on h4 now, but it doesn't seem like a lost cause either. I tried to force this rook onto the square where it would be the safest from harms way for the next 2-3 turns. (I picked wrong.)",
        "16... Bxh4": "The bishop eats the dropped pawn, but now I have an idea to begin a trap in mind.",
        "17. g3": "Starting here. I want to force the bishop away and I give my King a flight square. ",
        "17... Bf6": "Black then puts the bishop here. The threat should be obvious, but I was just too confused at why Black hadn't played Bg5 instead, and I was also too focused on my plan to notice what he was doing.",
        "18. Kg2": "So I do this. Perhaps it'd have been better for White to wait longer.",
        "18... Bxb2": "This was the first clearly obvious mistake I made this match.",
        "19. Rch1": "But it's okay, because I'm also sure that I have just barely enough resources in place to launch one final all out attack, even if I just dropped another rook...",
        "19... Bxa1": "Black eagerly eats the rook. I am now down a full Rook and two pawns at this point.",
        "20. Bxh6": "And I guess to Black's shock, I didn't revenge capture the Bishop either. There would have been no point- if I was wrong about the power of my remaining pieces, I was sure I was going to lose anyway, Bishop or not. But all my remaining pieces remain extremely powerful against his uncoordinated ones. After all, it's the Philidor's Defense we're talking here, so CHARGE!!!!!",
        "20... Bf6": "I'm not sure if Black saw more defensive value out of his own bishop, or saw more risks in taking mine. I'm not sure what was Black's best move here.",
        "21. Qg4": "But I did know I was very happy in pinning that pawn. Now the Bh6 lives whether Black wants it to or not, and I have a very dangerous attack in mind.",
        "21... c6": "An attack that Black completely overlooks, and resumes trying to gain even more material.",
        "22. Bh7+": "If it's material Black wants, I'm offering it. (Frankly, I was quite worried about Black playing g6, I wasn't too sure of my options after that.) But now, the Black King is forced to move, and neither square looks that great for him.",
        "22... Kxh7": "He captures. Fantastic! I might be a full Pawn, Rook, and Bishop down now (the power of a Queen!!!), but I was certain Black's King just walked into a trap he would not be walking out of alive. I was definitely more concerned with the King biding his time with Kh8...",
        "23. Bxg7+": "Instead, I open the discovered check. Black is severely compromised, but I was pretty sure all options at least turned the situation in complete favor White, if not at least a Mate in no less than 10 moves.",
        "23... Kg8": "Instead, Black makes his final, fatal blunder. Giving the bishop via Bh4 was the only saving move.",
        "24. Bxf6#": "MATE! I have never seen myself in a steadily worsening material disadvantage (the move before this I was at MINUS EIGHT!) to land myself into a checkmate. I was very thrilled to have pulled this off, even against a lower ranked opponent, as I was sure I made so many mistakes this match. Was there ways for both sides to have played this better? Thanks for reading the annotation!"
    },
    "url": "https://gameknot.com/annotation.pl/look-before-leaping?gm=57986",
    "gameName": "Look before Leaping!",
    "players": "rickdaily12 (1698) vs. ajurshin (1400)",
    "opening": "Philidor (C41), Berger variation"
}