{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Bb5 Nge7": "This was interesting.  It stops Bxc6 for the moment as I'd be reluctant to trade Bishop for Knight without taking any pressure off of the center.",
        "4. O-O": "Nc3 was also an option but I wanted to keep c3 on the table.",
        "4... a6 5. Ba4 g6 6. c3": "With a Knight on e7, Bxc6 is still not attractive so White's Bishop will need an escape route.  Also, as an added bonus, c3 keeps Black's Knight off of b4/d4.\r\n\r\nWhite's Q-side Knight and Bishop are a bit hemmed in but after d4 they should be able to effectively develop.",
        "6... Bg7 7. d4 exd4 8. cxd4": "Now the b1-Knight and c1-Bishop can deploy.",
        "8... O-O 9. Nc3 d5 10. Bxc6": "The Knight is no longer pinned and looks to be a key player in any upcoming central fur-ball.  Black could always take with Nxc6 (and still have a Knight in position) but that would leave d5 under-guarded.  Black's doubled pawns on the c-file will not be much of a negative.",
        "10... bxc6 11. h3 c5 12. e5": "The d-pawn is sure to drop.  I'll probably have to play Re1 to give the e-pawn some long-term protection.",
        "12... cxd4 13. Qxd4 h6 14. Re1": "At least the e-pawn is taken care of for the moment and the Queen can get off of the a1-h8 diagonal.  The c1-Bishop has to come off of the back rank and end up somewhere constructive pretty soon ... Bg5 would have been nice but that's off the table.\r\n\r\n(bigpeta suggested Rd1.  There were other options as well)",
        "14... Re8 15. Bf4": " I need to get Bishop out but on f4 can't Black push it back to e3 by playing g5? I suppose I could retreat to g3 or h2 instead. Bf4 still seemed logical.\r\nHowever, Black is aiming for Nc6 which I think is a very dangerous move for White. White would have to thread a very thin needle to stay in the game at all (Qxd5 may work). Even then, a Knight on c6 is only two moves away from c2 attacking the Rooks. Obviously White's a1-Rook needs to get into play (I'm thinking c1 or d1), but that brings us back to the Bishop.\r\nI considered Be3 ... but that begs the question 'Why did you move the Rook to e1 in the first place if you're going to block it with a Bishop?'\r\nI ended up with Bf4.",
        "15... c6": "Black will probably play Nf5 next. This attacks my Queen (immediate issue) but also opens the d8-h4 diagonal ... giving Black's Queen a route into White's K-side. Would this discourage Black from playing g5 (and blocking the diagonal)? Hummm ... don't know.\r\nAnyway, the Queen could fall back to d1, 2 or 3 and still have a playable position. The e-5-pawn is not in wonderful shape but doesn't need the Queen for protection at the moment.\r\nSo ... I don't think I need to move the Queen right at this moment. There may be something more useful on this move.\r\n\r\nNa4 looks interesting. From there it could drop into b6 (as long as White's Queen stayed on d4 (which ain't going to happen as Black will play Nf5 anyway), or c5 blocking the c6-pawn. c5 might be a nice little outpost ... especially with a3 and b4 as protection. Just thinking out loud here.\r\n",
        "16. Na4 g5 17. Bh2 Qa5": "An excellent example of a ‘complicating move’ ... and a move that I normally don’t handle well at all.  Now I'm faced with a position that only a couple of moves ago concentrated on the K-side (with a bit going on in the center) that now stretches from K-side, through the center to the very extent of the Q-side.  With 16. Na4 and 17. ... Qa5 we’re now playing laterally across the whole board.\r\nNot only do I have to deal with a vastly expanded playing field, I have to figure out how much a threat (and what kind of threat) Qa5 actually is!  It’s subtle ... and insidious.  It does not ‘force’ me to take any action at all ... the Knight is protected by White’s Queen.  But I now must think past the current state of play and down the road of ‘what happens to the Queen if things start to break loose on the K-side or the center?’ ... ‘what then?’\r\nI'm feeling the level of play start to crank up.",
        "18. a3": "a3, b4 and then Nc5",
        "18... Bd7 19. Rac1 Nf5 20. Qd1": "Continuing to protect the Knight.  I think now I can get both the Rook and Knight into play.",
        "20... Bf8": "Black's position may have looked a little cramped but is very flexible.  White faces a constant series of speed-bumps.",
        "21. b4 Qd8 22. Nc5 a5 23. Nb7 Qb6 24. Nxa5 Rec8 25. g4 Ng7 26. Ra1": "The worst move of the game!  True, later moves toward the end gave up more material, but up 'till this point I felt pretty good about White's chances.  This move, and what followed, took all the wind out of White's sails.  Black takes control at this point.\r\n\r\nMy concern was getting the a5-Knight onto a more active square, eventually c5 or d4.  Therefore, I had to protect the a-pawn.  I spent a lot of time looking at Queen moves but couldn't come up with anything.\r\n\r\nI simply could not get a clear picture of the board ... and any suggestions on how to do that would be greatly appreciated!  My opponent gave some good advice regarding playing over annotated master games.\r\n\r\nAnyway, 26. Re3 seems to be the popular choice here ... but I'm not clear on how that allows Nb3 in the near-term.",
        "26... c5 27. Qxd5 Be6 28. Qb7": "I didn't see the follow-up Bishop fork that would give up a piece.  I was still beating myself over Ra1 and didn't have my head in the game.  I was thinking, 'up some material ... let's trade Queens!'",
        "28... Qxb7 29. Nxb7 Bd5 30. Nd6": "Had to move one of them.  Here I at least attack a rook.",
        "30... Bxd6 31. exd6": "OK ... protected passed pawn in the center.  Maybe there's something left in this position after all!",
        "31... Bxf3 32. b5 Ne6 33. a4": "My first thought is Re3.  Maneuvering my Rooks behind my advanced pawns will be very difficult with Black's light-squared Bishop still on the board ... as will freeing my King should the need arise.  If I can get my Rook to d2 or d4 then the forward d-pawn will be a bit more secure.  Whatever the case, Black is getting ready to play Rd8, but the d-pawn is (for a move or two) covered by White’s Bishop ... but then the pawn can’t move forward without a Rook backing it up.\nHowever, with the Knight coming into play I have to make sure I get the Rooks and King are on different colored squares ... hummm, three pieces and two colors ... that really is going to be a trick!\nThe second choice is Be5 ... but there an eventual f6 (backed up by something of course) forces it away, maybe back to where it is now.  So that’s sort of a bust.  Although the Bishop really lacks any scope where it is, it seems to be doing its limited job fairly well.\nAnd that brings us to a4.  Not a great move ... but it does protect the b-pawn.  And, now that I think about it ... Black is going to drop the Knight onto d4, threatening Nxb5 or Nc2 forking the Rooks.  So, to keep from dropping the pawn White has to cover it this move.  I think a4 does that.  Black obviously has a lot of optional responses ... but at least it works for one move.\n\nIn retrospect, I failed to realize how powerfully Black's Bishop was positioned.  Re3 was again the best move.\n",
        "33... Rcd8 34. a5 Nd4": "Expected ... and brutally effective.",
        "35. Reb1": "Although this looked logical at the time, I think Re3 (a third chance!) and sacrificing the exchange would have been interesting.\n\n35.  Re3  Nc2\n36.  Rxf3 Nxa1\n37.  a6\n\nWhite is down material but is more active.",
        "35... Be4 36. Rb2 c4 37. a6": "Trying to create something out of thin air ... ",
        "37... Rac8 38. b6": "36. Rb4 was at least a chance (not much of a chance to be sure).\n\nWhite has three (3!) passed pawns, two of which are backed by Rooks ... and has managed to get into a dead lost position!!  Black's piece placement is perfect. ",
        "38... c3 39. Rb4 c2": "And the instructor graciously offered the student a draw."
    },
    "url": "https://gameknot.com/annotation.pl/lopez-learning-experience?gm=44548",
    "gameName": "Lopez Learning Experience",
    "players": "bhidragon (1800) vs. bigpeta (2000)",
    "opening": "Ruy Lopez (C60), Cozio defence"
}