{
    "moves": {
        "1. e4": "This is a game where a mistake in the opening forced me to seek for positional advantage all the game. The game was entitled by my opponent",
        "1... e5 2. Nf3 Nc6 3. Nc3 Nf6 4. Bb5 Bb4": "C49 Four Knights Opening\\Double Spanish Variation 4.Bb5 Bb4  \r\nA risky opening for black pieces, as white have the initiative, but it is still OK.",
        "5. O-O": "C49 Four Knights Opening\\Double Spanish Variation 4.Bb5 Bb4  \r\nA risky opening for black pieces, as white have the initiative, but it is still OK.",
        "5... d6": "my mistake in the opening. instead of castling, as the opening book recommends, I tried to protect my pawn, in case of 6.Bxc6 bxc6 7.Nxe5.\r\n\r\nhere my score is -0.88",
        "6. Nd5": "...and this is the result. Now I couldn't make the Nxd5 move, as, after exd5, my opponent wins a knight for a pawn, also having my pawns on c file doubled. So I was forced to move my bishop either to a5, or to c5.",
        "6... Ba5 7. d3": "my opponent prepares the Bg5, which would be a very powerful move, taking into consideration that my f6 knight which will be pinned is attacked by his d5 knight\r\nHere my score is -0.92",
        "7... a6": "I try to make use of the fact that my opponent doesn't win material from pinning my f6 knight so I try to attack his bishop, as I will have it either chased, or traded with my",
        "8. Bxc6+": "the score for black is -0.47",
        "8... bxc6 9. Ne3 O-O 10. Nc4 Bb6": "Trying to make my queen-side pawn structure stronger",
        "11. Be3": "A move that comes into conflict with the chess principle \"if you are up positionally, try to maintain the pressure and avoid trading\"",
        "11... Bg4": "gaining counter-play",
        "12. b3": "I can't understand why did my opponent move like this. weakening the pawn structure on purpose and losing tempo\r\nhere my score is  +0.03 And I did my best to maintain it positive till the end of the game. Basically that's the point where I took the initiative.",
        "12... Re8": "I wanted to push my pawn to d5, but I had to defend my e5 pawn first.\r\nScore: +0.10",
        "13. h3 Bh5 14. g4 Bg6 15. Re1": "I wonder why did my opponent move this way. Probably he was afraid that I would take his bishop and he still wanted to maintain that pawn on the f file, trying to push it forward. even so, the bishop was protected by the knight and my opponent even took my bishop with his knight at 17. g5 Bxe3 18. Nxe3, so this was a pointless move, copying mechanically  my 12th move. as result of this move, I gained tempo and my score was +0.17",
        "15... Nd7 16. h4 h5 17. g5": "My opponent weakened his castle-sided pawn structure on purpose, a fact that I fully exploited in the end of the middle-game. Perhaps he has a wrong conception of what a strong pawn structure is.\r\nScore: +0.18",
        "17... Bxe3 18. Nxe3": "Probably, my opponents intention was not to lose tempo in case of 18.Rxe3 d5, where he should have retreated with the knight in a more defensive position, as d, as my next move would have been d4, pushing my pawn forward and chase his knight, if he retreated to e3. If he chose 19.exd5 cxd5, no problem, he should have retreated with the knight, and I gained tempo anyway.",
        "18... Nc5": "Aiming for Qd7 and then Qg4",
        "19. Qd2": "Probably connecting rooks",
        "19... Qd7 20. Kf1": "here the computer suggests that White's best move would have been Kh2",
        "20... d5": "The computer analysis suggests that my best move would have been Qh3+, aiming for 20. Ke2 Ne6 21. Qd1 Nf4+ 22. Kd2 d5 23. Rh1 Qe6 24. exd5 cxd5 25. Kc1 Rab8 26. Rb1 d4 27. Nc4 Rb5. Now, after the game, this sequence of moves makes sense to me, as I really could gain more pressure on White's King, however, during the game I tend to focus on material advantage and when I saw that after Qh3+ I couldn't capture his Knight, I considered this move to be pointless, not seing the potential check with my knight, but centralizing my pawns was also a good move, which gave me the score of +0.60",
        "21. exd5 cxd5": "now I fully control the center. My score is +0.93",
        "22. Ng1": "preventing Qh3+",
        "22... d4": "pushing my pawns",
        "23. Nc4 e4": "Here I offered a trade while I was up positionally, however, by getting rid of two central pawns, I could open the game and increase my pieces mobility",
        "24. dxe4 Nxe4 25. Qf4 Rad8": "Score: +1.12",
        "26. Nd2": "the computer characterizes this move as a mistake, and recommends 26. Rad1, following Qf5 27. Qxf5 Bxf5 28. Ne2 Nc5 29. b4 Be6 30. Na5 d3 31. cxd3 Bh3+ 32. Kg1 Nxd3.",
        "26... Qb5+": "Even if the computer suggests that it is a mistake, as 26. Nc4 Nd6 27. Qxd4 Be4 28. f3 Nxc4 29. Qxc4 Qxc4+ 30. bxc4 Bxc2 31. Kf2 Bd3 32. c5 gave me an advantage of +1.26 and recommends Qg4 26. Rxe4 Rxe4 27. Qxc7 Ree8 28. Qg3 Qxg3 29. fxg3 Bxc2 30. Rc1 Rc8 31. Nc4 Bd3+ 32. Kf2 Bxc4 33. bxc4, which could give me an advantage of +3.50, I was almost sure that my opponent will try to attack my queen, forgetting about en passant",
        "27. c4": "Mistake: +4.09 » 27. c4 dxc3 e.p.+ 28. Nc4 c2 29. Kg2 Nc3 30. Ne3 Qc6+ 31. Kh2 Rd2 32. Nf5 Nb1 33. Rc1 Re4 34. Nh3 Rxf4 35. Ne7+ Kh7 36. Nxc6 Rxh4\r\nBest: +1.26 » 27. Nc4 Nd6 28. Qxd4 Be4 29. f3 Nxc4 30. Qxc4 Qxc4+ 31. bxc4 Bxc2 32. Kf2 Bd3 33. c5 Bc4 34. Ne2",
        "27... dxc3 e.p.+ 28. Nc4": "too late... Notice that from this point to the end of the game, My opponent made a large number of mistakes, because of the psychological factor. I won't judge my opponent's mistakes, as I don't have the right to criticize him, because this game was still disputed. I'm going to show you just the computer analysis.",
        "28... Nd2+ 29. Kg2 Qc6+ 30. Nf3": "Mistake: +5.71 » 30. Nf3 Nxf3 31. Qxf3 Be4 32. Rxe4 Rxe4 33. Ne3 Rd3 34. Kf1 Qb5 35. Ke1 Rxh4 36. Rd1 Rxd1+ 37. Nxd1 Qe5+ 38. Qe2\r\nBest: +4.07 » 30. f3 Rxe1 31. Rxe1 Nxc4 32. Qxc4 Rd2+ 33. Kh3 Qxc4 34. bxc4 c2 35. Kg3 Rd1 36. Re8+ Kh7 37. Ne2 c1=Q 38. Nxc1 Rxc1",
        "30... Be4 31. Ncxd2": "Mistake: +6.80 » 31. Ncxd2 cxd2 32. Re3 d1=Q 33. Rxd1 Rxd1 34. Kg3 a5 35. a3 f6 36. gxf6 gxf6 37. Qh6\r\nBest: +4.70 » 31. Re3 c2 32. Rc1 Nxc4 33. bxc4 Qxc4 34. Kg3 Rd1 35. Re1 Rxe1 36. Rxe1 Qxa2 37. Qc1",
        "31... cxd2 32. Red1": "Blunder: +12.28 » 32. Red1 Rd3 33. Kg1 Bxf3 34. Rxd2 Rxd2 35. Qa4 Qxa4 36. bxa4 Re4 37. Kh2 Be2 38. Kg3 Rd3+ 39. Kg2 Rg4+ 40. Kh2 Rxh4+ 41. Kg2 Rxa4\r\nBest: +7.95 » 32. Re3 d1=Q 33. Rxd1 Rxd1 34. a3 Bd5 35. Qa4 Qxa4 36. bxa4 Rxe3 37. fxe3 Rd3 38. g6 Rxe3 39. gxf7+ Kxf7",
        "32... Rd3 33. Rxd2": "Blunder: +16.99 » 33. Rxd2 Rxf3 34. Qh2 Qc3 35. Rad1 Rh3+ 36. Kg1 Rxh2 37. Kxh2 Qf3 38. Rg1 Qf4+ 39. Kh3 Qxd2 40. Kg3 Qxa2\r\nBest: +11.47 » 33. Kg1 Bxf3 34. Rxd2 Rxd2 35. Qa4 Qxa4 36. bxa4 Rd4 37. Kh2 Rg4 38. Rc1 Rg2+ 39. Kh3 Rxf2 40. Rxc7 Rxa2",
        "33... Rxf3 34. Qh2 Rf4+": "Blunder: +14.18 » … Rf4+ 34. Kf1 Rg4 35. a4 Bg2+ 36. Kg1 Qc3 37. Qxg2 Qxa1+ 38. Kh2 Rxh4+ 39. Kg3 Rg4+ 40. Kh2 Qe5+ 41. Qg3 Rxg3 42. fxg3 Qxg5\r\nBest: +17.18 » … Rh3+ 34. Kg1 Rxh2 35. Kxh2 Qc3 36. Rf1 Qf3 37. Rg1 Qf4+ 38. Kh3 Qxd2 39. g6 Bxg6  \r\nLooks like my attacks weren't perfect neither...",
        "35. Kg1": "Blunder: +Mate(7) » 35. Kg1 Qc3 36. Rad1 Rg4+ 37. Kf1 Qf3 38. Re2 Bd3 39. Rdd2 Bxe2+ 40. Ke1 Bd3+ 41. Re2 Qxe2#\r\nBest: +21.14 » 35. Kf1 Rg4 36. f3 Bb1 37. Rxb1 Qxf3+ 38. Rf2 Qd3+ 39. Re2 Qxb1+ 40. Kf2 Rxe2+ 41. Kxe2 Qxa2+ 42. Kf3 Qxh2 43. g6 Rg3+ 44. Ke4 Qxh4+ 45. Kd5",
        "35... Rg4+ 36. Kf1 Qb5+ 37. Ke1 Bc2+": "I like this move. Not only it discovered the attack from Re8, it prevented the opponents king to run to d1",
        "38. Re2": "He could hold for one more pair of moves, giving up his queen, but it was pointless",
        "38... Qxe2#": ""
    },
    "url": "https://gameknot.com/annotation.pl/lord-of-the-strings?gm=34002",
    "gameName": "lord of the strings",
    "players": "minidovan (1429) vs. crinel (1407)",
    "opening": "Four knights (C49), Gunsberg counter-attack"
}