{
    "moves": {
        "1. d4 d5 2. Nf3 Nc6 3. e3 Bf5 4. c3 Nf6 5. Bd3 Be4 6. O-O e6 7. Qe2 Ng4 8. Nbd2 f5 9. h3 h5": "sacrificio più che accettabile, se mi mangiava il pony per lui sarebbe stata quasi finita, con la colonna h libera, il pedino avanzato protetto e la donna che con un passo si sarebbe trovata nella colonna h.",
        "10. Bb5": "questa mi ha rotto i coglioni tutta la partita",
        "10... Qd6 11. c4 Bxf3 12. Nxf3": "qui tra un pò mi veniva un colpo, per prendere il cavallo ha involontariamente fatto cadere la regina, pensavo volesse mangiare con quella.",
        "12... g5": "un pò di pressione, tanto non poteva muovere il pony",
        "13. c5 Qe7": "chiaramente un pò di pressione anche lui",
        "14. b4 Bg7": "da qui perdo un sacco di tempi",
        "15. Bb2 Bf6 16. Ne5 Ngxe5 17. dxe5 Bg7 18. f4 g4 19. Qf2 gxh3 20. gxh3": "qui per me lui ha sbagliato",
        "20... Qd7 21. Qg3 O-O-O 22. Kh2 Rdg8 23. Qf2 Kb8 24. Rfg1 h4 25. Rg6": "io ho sempre il cavallo inchiodato e la donna quasi, sempre lì a proteggerlo, ora dimmi se una donna si deve sacrificare così",
        "25... a6 26. Ba4 Qf7 27. Rag1 Nxb4": "ce l'ho fatta a liberare il cavallo ma ora io ero convinto che spostasse la donna invece avevo previsto male",
        "28. Ba3 a5 29. Qb2 Nd3 30. Qb5": "qui ha risbagliato, se la metteva in b3 lasciava spazio per l'alfiere ",
        "30... Nxe5": "qui se avesse mangiato avrebbe perso una torre",
        "31. Rb1 c6 32. Qb6 Rgc8 33. Rg2 Rc7": "qui ho sbagliato, volevo altri pezzi a proteggere c6 e ciao ciao cavallo",
        "34. fxe5 Bxe5+ 35. Kh1 Rg8 36. Qxa5 d4 37. exd4 Bxd4 38. Qb4 e5 39. Bb2 Rd8 40. Bxd4 Rxd4 41. Qb3 Qd7 42. Rg8+ Rc8 43. Rxc8+ Kxc8 44. Rg1 Qd5+ 45. Qxd5 Rxd5 46. Rg8+ Kc7 47. Rg7+ Rd7": "e qui ri ho sbagliato, ero convinto che volesse pattare, ripensandoci era solamente a 2 scacchi",
        "48. Rg5 Rf7": "da qua in poi è stato un pianto, non c'è bisogno di dirlo",
        "49. Bb3 Rf8 50. Rh5 e4 51. Rxh4 f4 52. Kg2 b6 53. cxb6+ Kxb6 54. Kf2 Kc5 55. Rh7 Re8 56. Rf7 f3 57. Ke3 Rh8 58. Kxe4 Rxh3 59. Rxf3 Rxf3 60. Kxf3": "e ho risbagliato a cambiare la torre",
        "60... Kb4 61. Ke4 c5 62. Kd3 Kb5 63. Kc3 Kb6 64. Kc4 Kc6 65. a4 Kb6 66. Kd5 Ka5 67. Kxc5 Ka6 68. Kb4 Kb6 69. a5+ Ka6 70. Bc4+ Ka7 71. Kb5 Kb8 72. a6 Ka8 73. Bd5+ Kb8 74. Kb6": "adieu, mi sono arreso, era l'ora"
    },
    "url": "https://gameknot.com/annotation.pl/lucca-2011-open-c-round-1?gm=39290",
    "gameName": "lucca 2011 open c round 1",
    "players": "bianco  vs. Escalabar ",
    "opening": "Queen's pawn game, Chigorin variation (D02)"
}