{
    "moves": {
        "1. c4": "I'll try the Reti Opening",
        "1... e5": "I guess he prefers KP openings",
        "2. d3": "I don't know why I didn't play Nc3..",
        "2... h6": "I thought this was premature.. my knight's not even on f3 yet\r\n",
        "3. Nc3": "now I make the knight move (I think I feared pawn advance on the 2nd move, followed by f5 because, at the time, his rating was much higher than mine)",
        "3... Bb4": "he pins the knight",
        "4. Bd2": "y bishop runs interference",
        "4... Nf6": "he's ready to castle and I'm not even close!",
        "5. a3": "I try to run off the bishop",
        "5... Bc5": "It worked! (usually they trade me, knight for bishop)",
        "6. e3": "I don't want him to force me to move the King with Bxe2 ",
        "6... O-O": "his king is safe.. I'm still at least 2 moves away!",
        "7. g3": "I'll put my white bishop on the long diagonal",
        "7... Nc6": "I would have played d6 first (but what do I know?)",
        "8. Bg2": "one more piece to move and I can castle",
        "8... Ne7": "this move confused me...",
        "9. b4": "I decide to move the bishop back some",
        "9... Bxe3": "he gets grumpy...",
        "10. Bxe3": "a pawn for a bishop. I don't understand, but I'll take it.",
        "10... d5": "so... he wants centre control!",
        "11. Nf3": "a bad move... I don't know what I was thinking",
        "11... d4": "a pawn fork. He'll get his piece back now.",
        "12. Bxd4": "trading down looked like my best option.",
        "12... exd4": "he's even again",
        "13. Ne2": "I run away.. (Nxd4, QxN didn't look good to me!)",
        "13... Re8": "he prepares a nasty attack on my uncastled King",
        "14. O-O": "so, I'd better castle.",
        "14... Rb8": "I guess he worried about me uncovering the white bishop",
        "15. Nexd4": "now I can nab the pawn safely",
        "15... b6": "looks like his bishop wants the long diagonal too",
        "16. Qa4": "I spy a weak pawn..",
        "16... Bd7": "I smell a trap!",
        "17. Qc2": "so, I back off, but still own the diagonal",
        "17... Nf5": "he uncovers the rook and gains control of the open file",
        "18. Nxf5": "I'll trade knights (they can be unpredictably dangerous)",
        "18... Bxf5": "he completes the trade.\r\n",
        "19. Rad1": "the pawns position was weakened by the trade, so I add support",
        "19... Qd7": "is he going to attack the bishop with Bh3, or put a rook on the file behind his Queen?",
        "20. Qc3": "I didn't like the Queen behind the pawn with a bishop lined up on them, and maybe, if I'm patient, I can set up a knight fork",
        "20... Rbd8": "now there are two lines of attack set up, the d-file and the c8-h3 diagonal",
        "21. Ne5": "this attacks his Queen, adds protection for my d3 pawn, and opens my bishop up on the diagonal.",
        "21... Qd4": "he offers to trade Queens (basically, he forces me to, or I lose the knight)",
        "22. Qxd4": "I take it",
        "22... Rxd4": "so does he, and now my knight is naked again!",
        "23. Nc6": "I escape, forking a pawn and rook",
        "23... Rxd3": "he nabs a pawn",
        "24. Rxd3": "I trade rooks",
        "24... Bxd3": "no time to nab the pawn, I need to move the rook",
        "25. Rc1": "I protect my pawn, but wonder if Rd1 would have been better",
        "25... a6": "he saves his pawn",
        "26. Bf3": "I try to keep the knight contained",
        "26... g5": "I think he's out to free the knight with g4 to follow",
        "27. Rc3": "a fatal mistake..",
        "27... Re1+": "my goose is cooked!",
        "28. Kg2": "I try to run away (like \"a little girly-man\")",
        "28... Bf1+": "no good...",
        "29. Kg1": "forced",
        "29... Bh3#": "stick a fork in me!"
    },
    "url": "https://gameknot.com/annotation.pl/luckyjacks-new-mini-tournament?gm=6385",
    "gameName": "luckyjack's new mini-tournament",
    "players": "johnb221 (1460) vs. bottlenose (1407)",
    "opening": "English opening (A20)"
}