{
    "moves": {
        "1. e4": "By mistake, I played this. Mistake for my standards... :)",
        "1... e6": "French! I'm scared about it, because it has so much theory behind...",
        "2. d4 d5 3. e5 c5 4. Nf3": "I think Ne2 is the modern move.",
        "4... Nc6 5. c3": "...anyway, the usual attack/defence...",
        "5... Bd7": "Passive, but how can it be bad?",
        "6. Be3": "I know this is offbeat, but \"threatening\" is the only way for me to keep the game in control. dxc5 is threatened. ",
        "6... Qc7": "Probably planning something... yes: If dxc, Nxe5. ",
        "7. Na3": "Another offbeat move, but I'm threatening Nb5. ",
        "7... a6": "Ok. Now, notice how this move sets an attack (instead of a defence) on the white squares.",
        "8. Qa4": "It seems a mistake, since now black's N can take anywhere due to the discovered attack on my Q. But...",
        "8... Nxe5 9. Nb5": "he can't take because of QxR+. If BxN, BxB+ and it's the same.",
        "9... Nxf3+ 10. gxf3 Qb6": "I got myself into a trap. The N can't retire, and now BxN is possible. But...",
        "11. dxc5 Bxc5": "Unfortunately, I can't force the BQ far from c7's guard... I thought I was lost. ",
        "12. Bxc5 Qxc5 13. b4": "Last resource, but now, just by retiring the Q, I have no way out. Of course, but... where to retire the Q? Nowhere to prevent a N's check. He can take it... the next move. ",
        "13... Bxb5": "Now I have to defnd c3 (I saw it will become weak, but this was a hot game, and I wasn't thinking in long-term strategy: I just need not to allow Qxc3+, winning the R. I'm lost anyway, when BxQ, bxQ and... I'm a piece under, with very few chances to even draw the game. BUT: when you go out of normal sequences (Na3, for Nb5, as an example), and the opponent is not \"seeing\" the consequences of an \"odd move\"... it is more difficult for him to keep the reasoning \"on\". This works for blitzes only, of course... ",
        "14. Qa3": "I'm still a piece under, and that's all. Just retiring the Q, and black would have won. But...",
        "14... Bxf1": "He forgot about his Q. ",
        "15. bxc5": "Can you believe? I am ONLY +2, despite black's blunder!",
        "15... Bb5 16. Rg1": "...no point in castling, of course. Another weakness targeted...",
        "16... g6": "...weakening the black squares, so...",
        "17. Qb2": "setting a double threat. Of course you can see it... do you?",
        "17... Nf6": "He didn't!",
        "18. c4": "Lucky me... I don't recommend my game, of course, but this time it worked. :-)"
    },
    "url": "https://gameknot.com/annotation.pl/lucky-game?gm=60245",
    "gameName": "Lucky game",
    "players": "damafi (1471) vs. Player (1595)",
    "opening": "French (C02), advance, Nimzovich system"
}