{
    "moves": {
        "1. d4": "So this was the first game of the season in the Shropshire League for Oswestry A.",
        "1... Nf6": "Thankfully we won 5-0 to go top of the league!",
        "2. c4": "So it starts conventionally enough.",
        "2... g6": "I am hoping to play a Grünfeld Defence.",
        "3. g3": "But he doesn't play Nc3.",
        "3... Bg7": "So I calmly complete the fianchetto.",
        "4. Bg2": "As does he. I was tempted to castle and go into King's Indian type positions, but I decided instead on what I always call the Semi-Grünfeld, because that is what Max Euwe calls it in his book, \"The Road to Chess Mastery\", although no one else seems to call it that! He seems to be \"threatening\" e2-e4 now, so I play the usual Grünfeld move.",
        "4... d5": "This.",
        "5. Nf3": "He plays this, rather than the more combatative cxd5.",
        "5... O-O": "I castle.",
        "6. O-O": "So does he.",
        "6... c6": "I support my pawn on d5 and also with a threat.",
        "7. Nc3": "Which he ignores.",
        "7... dxc4": "So I take.",
        "8. e4": "He grabs the centre.",
        "8... b5": "I support my pawn on c4",
        "9. e5": "He advances",
        "9... Nd5": "Hoping that he will exchange on d5 and I can take back with the pawn and straighten out my pawns.",
        "10. Ne4": "But he centralised his knight. Aleksic, Nenad (2435) vs. Dinic, Dragan (2270)\t\t1995 continued with a4.",
        "10... Nd7": "I develop.",
        "11. e6": "He sacrifices another pawn to break up my pawns.",
        "11... fxe6": "So I thought I may as well take.",
        "12. Nfg5": "Attacking e6, threatening a fork of my queen and rook.",
        "12... Nd7b6": "So this protects it with my bishop.",
        "13. Nc5": "He attacks again.",
        "13... Qd6": "I defend again.",
        "14. Bh3": "He attacks it yet again.",
        "14... e5": "I am two pawns up. I am planning on giving up the exhange for a pawn, leaving me with three pawns for the exchange and an overwhelming position.",
        "15. Nce6": "He hops in.",
        "15... exd4": "I leave my rook en prise, and take an important central pawn.",
        "16. Nxf8": "He takes.",
        "16... Bxh3": "I finally move my Bc8.",
        "17. Nxh3": "He takes back.",
        "17... Rxf8": "And so do I. So for the sake of a small amount of material (rook for knight & pawn), I have established a huge centre, all my pieces are on good squares, his most attcaking pieces have been exchanged or driven back. In short black now has a massive advantage. ",
        "18. Ng5": "He decides to re-centralise his knight.",
        "18... d3": "Opening up the long diagonal, making it hard for him to develop his Bc1, and also pushing my passed pawn nearer to the queening square.",
        "19. Qg4": "He tries something on the king side, but he just doesn't have the central control or the development to do anything successfully.",
        "19... Rf5": "Stopping his knight from coming in on e6.",
        "20. Qh4": "Threatening the pawn on h7.",
        "20... h6": "Easily prevented.",
        "21. Ne4": "Knight hits the queen. He seems to think he is winning a pawn, but I had seen all this, and he is sleep walking into a trap.",
        "21... Qe6": "The queen moves.",
        "22. Bxh6": "This is what he had planned, but it is a massive mistake, throwing away a piece.",
        "22... Rh5": "Because I have this, and his queen has no squares.",
        "23. Ng5": "His only hope is this counter-attack. ",
        "23... Rxh4": "After a lot of thought I decided to take the queens off. I have many other winning moves, but I decided this was the simplest, transposing into an easily winning endgame.",
        "24. Nxe6": "He takes back the queen.",
        "24... Rxh6": "I take his bishop. I now have knight, bishop and two pawns for the rook, but what is more, my pieces and pawns are in a dominating position.",
        "25. Rab1": "He protects his b pawn.",
        "25... g5": "Again, there are various ways to win. This seemed the best, if he takes on g5 it means that his knight can't get back to help stop the black pawns, and 26....c3 or 26.....Bxb2 both win very easily.",
        "26. Nxg7": "So he took.",
        "26... Kxg7": "I take back.",
        "27. Rbc1": "Trying to hold back my pawns.",
        "27... Re6": "Centralising my rook, and preparing to penetrate on e2.",
        "28. Rce1": "He prevents that, but allows another exchange.",
        "28... Rxe1": "So I take.",
        "29. Rxe1": "He takes back.",
        "29... Na4": "And now, his position hopeless, he resigns. Many thanks for reading. Please leave a comment or two, and rate the annotation on the star system, to let me know how I am doing. Until next time dear reader!"
    },
    "url": "https://gameknot.com/annotation.pl/ludlow-v-oswestry-a?gm=63513",
    "gameName": "Ludlow v Oswestry A",
    "players": "Joe Watson (ECF160) vs. Charles L Higgie (ECF176)",
    "opening": "King's Indian (E60), 3.g3, counterthrust variation"
}