{
    "moves": {
        "1. d4": "started with a d4 opening",
        "1... g6 2. c4": "transposed immediately in the english",
        "2... Bg7": "in my opinion, this defense is the safest. But i recognized that black will soon find problem on the queen side.",
        "3. Nc3 Nf6": "still nothing on the center. It is the plan. This black knight is one of the most important pieces in the game.",
        "4. e4": "I like to play that with white too. As far as it goes, i'd play the same from the other side.",
        "4... d6 5. Nf3 Bg4": "This is something I play a lot, as I generally don't know what to do with this clear black bishop, and the knights are dangerous pieces in the closed english",
        "6. Be2 O-O 7. O-O": "and now starts the real position where black goes on f-g columns and white on b-c.",
        "7... c5": "oups... no... so, did I lie? No: black just tries to block queen side, as you will see. But it won't really work",
        "8. Be3": "white clearly views queen-side.",
        "8... b6 9. h3": "...and defend king-side",
        "9... Bxf3": "exits one knight",
        "10. Bxf3": "exit my dubious bishop. I won't cry for him. And his white bishop loses a move here. It will be important as we will see.",
        "10... e5": "trying to open on the center. May be over confident, as I haven't finished my development, unlike white.",
        "11. d5": "white closes the center. The battle really will be on the flanks.",
        "11... Na6": "he is a defender. Will not see the ocean on the king side.",
        "12. a3": "defending b4 and preparing... b4 :-)",
        "12... Nc7 13. b4": "white is on the move BEFORE black...",
        "13... Rb8 14. Rb1 h6": "finally a first move on the king side. Looked like I forgot it... But no, i just assured the lemmo \"defense first\".",
        "15. Nb5": "forces the next move. Was it really useful? I am not sure as it exchanges a good knight against a bad one. But it will contribute to open b-line.",
        "15... Nxb5 16. cxb5": "Now, I prefer black position, but it won't last.",
        "16... Qd7 17. bxc5 bxc5": "I have one big advantage, theoretically: the clear white bishop, which is necessary to the attack, is blocked by the defense of e4. But white could easily poses the queen on c2 and free the bishop. I am surprised he never did that... On the other side...",
        "18. a4": "... white has a tremendous advantage here: a potential passed pawn!",
        "18... Rb7": "hesitating on the defense.",
        "19. Be2": "?!",
        "19... Nxe4": "I haven't seen the trap, therefore, there is no trap.",
        "20. Qc2": "a bit late?",
        "20... f5": "black pawns are on their move. I feel comfortable here. Maybe too optimistic (as frequently)",
        "21. f3": "strange, to my opinion. I have been surprised by this defense. I really think white has to concentrate on his attack, and it helps me on mine",
        "21... Ng3": "i think it is better than getting back home, cause I have to attack.",
        "22. Rfe1": "Maybe I should have taken the clear bishop, here, as it is an important attack piece to a-b attack.",
        "22... f4": "But i decided to continue my attack",
        "23. Bf2 Nf5": "and still think that my knight has a big potential.",
        "24. Bd3": "so does he, maybe. I think he should have concentrated more effort on his nice potential attack on a-b side.",
        "24... Qc8": "would you believe it? I had no clear idea here... I made some approximations.",
        "25. a5 Qb8": "confused, really.",
        "26. Rb2": "?!? really dubious, as the next moves clearly gives me an advantage. Or so i think.",
        "26... e4": "opening the diagonal and attacking simultaneously the bishop and the rook.",
        "27. fxe4": "yes, taking the pawn is the best option.saving the rook would loses a bishop for a pawn.",
        "27... Ne3": "Not Bxb2 immediately, as it is followed by exf and white recuperates a good pawn on g6.",
        "28. Bxe3": "the only viable option here",
        "28... Bxb2": "now, white has to make a bad choice: taking my bishop or saving his...",
        "29. Qxb2": "he takes mine...",
        "29... fxe3": "... so i take his.",
        "30. Rxe3": "well, it looks like I still have the same advantage, considering the captured scale. And white still has his fine attack, but there is much more than that. Look weel: white has the diagonal h8-a1, a potential attack on e5 with the pawn, and opening the diagonal for the bishop on g6... so, do I have to be glad of my quality advantage? It is not really clear. I had a lot of doubts, here, after I foud myself very proud of the 26th move...",
        "30... Kh7": "protecting g6",
        "31. Rg3": "attacking g6 with potential e4-e5",
        "31... Qe8": "protecting g6, but also and mostly pointing to e5.",
        "32. Qe2": "pointing the attack on the same spot: g6",
        "32... Qe5": "blocking the bishop. This same old bishop i refused to take some moves ago...\nI open some opportunities here, like Qd4+, Qa1+ and threatening the rook.",
        "33. Qg4": "this is much more thant just pointing on g6: it is saying to the rooks: stay on your lines! If not, I go on 7th or 8th line. It is a competent move, looking confident, and I thought to myself: this game is going to last... It is strange to feel as the mouse in the game, when I am supposed to have a good advantage.",
        "33... Rg7": "ok, i stay on my line, but I protect my g6 essential point.",
        "34. Rf3": "i guess white has no more idea...",
        "34... Rgf7": "and here white resigns... I have no doubt he could have resisted much more, testing me by going back to g3, for example, moving the pawn h3, h4, h5...\nMy plan was to try to find a way to play g5 or h5, then to play Rf4. So, I guessed white intended here to exchange his rook against the other one and to advance the pawns AFTER having put the bishop under safety (I am potentially threatening Qd4+, remember). I suppose white has no more passion in the game. Too bad, because I wanted to try myself here..."
    },
    "url": "https://gameknot.com/annotation.pl/lunarossa13?gm=35287",
    "gameName": "LUNAROSSA13",
    "players": "wwgia (1658) vs. thitho (1758)",
    "opening": "Beefeater defence (A40)"
}