{
    "moves": {
        "1. e4": "When I start these annotations, I am not sure about the final result, but I can already say this was a great game. Both of us we fought for this last game of the tournament, where we had nothing more to win (we are at the queue of the competition). We attacked, and attacked and attacked. I must recognize that at first, I was disposed to propose the draw on move 15... But, then, all of sudden, every thing seemed so bright, that I had to continue...",
        "1... c5 2. Nf3 d6 3. Bc4": "d4 is the most classical move, here, but Bc4 is maybe more active. Thought it entered into a variation where black have more positive results.",
        "3... Nc6 4. d3": "White is more developped till now.",
        "4... g6 5. Nc3 Bg7 6. Ng5": "a little bit naive... a loss of tempo.",
        "6... e6 7. O-O Nge7 8. Kh1": "prophylactic",
        "8... a6 9. a3 O-O 10. f4 h6 11. Nf3": "now development is equal. And, though, white is more exposed than black",
        "11... Kh7": "preparing a possible move by dark bishop and an eventual move of f7, without eing exposed to light white bishop",
        "12. Ba2": "i did not expect that one: i think it was a little bit too much anticipated.",
        "12... Nd4": "I was here preparing a situation to be in a good position to propose the draw.",
        "13. Be3 Nec6 14. Rb1 b5 15. Qd2 f5": "here, i was up to propose the draw; i forgot to do it... and then...",
        "16. e5": "!? White decided to open at a cost of a pawn? or didn't he see the next 2 moves? Well, I don't know. Only anton can tell.",
        "16... Nxf3 17. Rxf3 dxe5 18. fxe5 Nxe5": "a pawn up (apparently), but a more opened situation where white is pointing all forces on black king. Maybe it was a good thinking.",
        "19. Rh3 Ng4": "Viewing this, I decided to give back the pawn, to regain more agressive game.",
        "20. Bxc5": "white takes back the pawn",
        "20... Re8 21. b4": "this may be a strange move, because now the queen is linked to the knight.",
        "21... Bd4": "Thought, I decided that white dark bishop was more inconvenient for me than my own dark bishop was useful",
        "22. Bxd4 Qxd4": "exchange.",
        "23. Rf1": "yes, white had well in view that my strenght is now on f2.",
        "23... Bb7": "but now, i have strenght also on a8-h1 diagonal.",
        "24. Rf4": "great move!",
        "24... Qg7": "Of course! on every other move, R takes the Knight and threats h6 with both queen and rook!!!",
        "25. Nd1": "freeing the queen, and disposing the Knight to a good defensive point.",
        "25... g5": "Now, my pawns chain is going to be very strong.",
        "26. Rf1 f4": "the h3 rooks is now in prison.",
        "27. d4": "new interrogation. Is it to free the rook? Because this pawn move enweaken white defense.",
        "27... Rad8": "the pawn is pinned!",
        "28. c3": "whatever, the pawn is still pinned. Maybe the move was necessary, but it gives me the tempo to play...",
        "28... e5": "the pawns chain will advance a bit more: the pawn cannot be taken. Though, the price is high: light white bishop has gained some more space and my king is potentially threatened by it.",
        "29. Qd3+": "this was not the best shot ever.",
        "29... e4": "new tempo gained.",
        "30. Qc2 Qg6": "i have to recognize that this is not the best shot ever neither, but I needed a free spot for my king. ",
        "31. Bb1": "And I didn't expect that move!",
        "31... Kg7": "My king is freeer, and my h-pawn is also a little bit more relieved.",
        "32. Qe2": "pinning my e4 pawn and attacking my good old knight... Too bad: he will have to move. ",
        "32... Nf6": "Maybe I could have played h5 to continue the threat on f2, but, actually, the threats combined by the white bishop, the queen and the rook seemed more dangerous.",
        "33. Nf2": "logical... though, maybe not necessary, but will be revealed as important later",
        "33... g4": "glorious pawns!",
        "34. Rh4": "only possible place for the rook...",
        "34... Qg5": "Maybe h5 first was stronger.",
        "35. Rxg4": "a glorious pawn is down, but at what cost for white! Any other move is too costly for white anyway.",
        "35... Nxg4": "The knight takes back its position, with benefit, andserious threats again on the king.",
        "36. Nh3": "36 Nxg4 would have been punished by f3! 37 gxf exf and the knight fall. Even Qxg4 was not a very good idea. This move, Nh3, really surprised me and appeared to be the best answer.",
        "36... Qh4": "though this answer looked very dangerous, i think it was also the best possible. I didn't want to let white takes back the knight with a check, and Qg6 or h5 was followed by Nxf4!",
        "37. Rxf4": "Of course, not Nxf4, followed by immediate mate. Another brave pawn falls... :-(",
        "37... h5": "protecting the Knight, but letting g5 unprotected.",
        "38. Rf5": "Threats Rg5",
        "38... Nf6": "My king is in a nexus of mate and my queen has too few moves. there were many possibilities of drawing here.",
        "39. Qe3": "Here are other new unexpected threats. I really think this game generated great surprises.",
        "39... Rd5": "And... here is mine! Here we see the interest of the overprotection of the pawn e4.",
        "40. Rf4": "Looks like a return to the old situation, but, actually, with the white queen on e3 and my rook on d5 it is very different.",
        "40... Ng4": "forced and threatening an exchange.",
        "41. Qc1": "new surprise for me I expected Qe2. For me, this is a weak move... we'll see later wht the computer thinks of it.",
        "41... e3": "Finally, my pawns chain is back on the field... Well... there is no more chain, but without the chain, there would have been no e4-e3. I think this move is decisive, and I see Qc1 as a possible mistake.",
        "42. Be4": "expected. I have thought here about a potential Rxe4, but it does not lead to real advantage.",
        "42... Rd7": "already thought about Rxe4, followed by Rxe4... not interesting.",
        "43. Bxb7 Rxb7": "evacuating 2 strong opponents... Too bad my bishop disappear but, althought he didn't move since his first, he played a great role. But I am pretty sure white lost here a possible protector for the column e.",
        "44. Rf5": "I guess, white had the same scheme in mind as before (threatening Rg5), but, now, with e3, it is no more a good idea.\nBut, anyway, I am not sure there is still something here to save. ",
        "44... Nf2+": "winning...",
        "45. Nxf2 exf2": "there is nothing more, here, than a possible check on g5, then Kf6... And too many threats."
    },
    "url": "https://gameknot.com/annotation.pl/lunarossa13?gm=38035",
    "gameName": "LUNAROSSA13",
    "players": "ant0n_98 (1658) vs. thitho (1692)",
    "opening": "Sicilian (B50)"
}