{
    "moves": {
        "1. e4 e5 2. d4 exd4 3. e5 d6 4. Qxd4 dxe5 5. Qxe5+ Be6": "?? you have the right idea but bad execution \n\nWell done, on removing the center pawns from the board you have created a lot of open lines to develop your pieces quickly. I am very happy to see that you have the right idea of developing your pieces toward the center. However, playing ...Qe7 is CORRECT move for you because you don't lose a pawn. \n\nAfter 5. ...Qe7\n\na) 6. QxQ BxQ black is ok. (you just continue your development as normal)\nb) 6. Nf3 Nc6! 7. QXQ(white is not forced to take the queen) BxQ 8. Black is better than ok (you are better than white because of a major lead in development)",
        "6. Qb5+": "White wins a pawn.",
        "6... c6": "?? I give this one two thumbs down. For reasons that I am sure you know 6 ...Nd7 is the CORRECT move",
        "7. Qxb7 Nd7 8. Qxc6 Ne7": "an OK move that is not the best because you hinder the development of your dark bishop. I would have played the forcing move 8. ...Rc8 gaining space and harassing the queen. ",
        "9. Qc3 Nd5 10. Qd2 Bb4": "Very nice sequence of moves.",
        "11. c3 Bc5": "I think also Ba5 is also playable because:\r\n12. B4?? creates serious weaknesses in Whites position i.e the pawn on c3 would be very difficult to defend",
        "12. Bb5 O-O 13. Ne2 Qb6": "? Removing the knight from harms away would be more prudent. The CORRECT move is 13. ...Nf6 which threatens 14. ...Ne4 with a dangerous attack on the queen and f2!",
        "14. a4 a6": "again 14. ...Nf6 followed by a6 would have been better",
        "15. Bc4": "Bad move by white he should have played\n\n15. BxN! and you are down a piece ",
        "15... Bxf2+ 16. Kf1 Ne5": "Very nice move. you have a very well coordinated attack going and on your way to crushing your opponent",
        "17. Nd4 Ne3+": "?? a huge blunder that drops a critical piece in your attack. if you look at the position you will notice that white has a hanging bishop  with a check on the queen. ",
        "18. Kxf2 Ne3xc4": "This is OK but a bit awkward. The correct move is \nAfter\n18. ...Ne5b4+\n\na)19. Kg1 NxB( you are up a piece)\nb)19. Kg3 Qd6+ 20. Ka3 Nf2+(double check) 21. Ka4(only move) Qf4+ with mate in 1\nc)19.\tKf3 Qb7+ 20.Kg3 Nxc4( you have a easy win)\n",
        "19. Qc2 Ng4+ 20. Ke2 Rae8 21. Nxe6": "The bishop is totatlly not worth the knight this is a bad trade for white",
        "21... Qxe6+ 22. Kd3 Red8#": "good mate! In my opinion you won because all of your pieces were on good active squares and you developed all of your pieces before attacking. Well Done! "
    },
    "url": "https://gameknot.com/annotation.pl/lvdks-mini-tournament-v?gm=25773",
    "gameName": "lvdk's mini-tournament V",
    "players": "lvdk (1348) vs. ashleyanderson (1229)",
    "opening": "Centre game (C21)"
}