{
    "moves": {
        "1. e4 e6 2. d3": "Not sure, what this is called, but I'm coming up against it more and more recently",
        "2... d5 3. Nd2": "e5 seems to be the other popular choice",
        "3... Nc6": "I used to play c5 here but decided this was better",
        "4. Ngf3 e5": "not a move i see many people play really, but I really fancy blacks position here",
        "5. c3": "Seems a little too defensive a setup for white for my liking, but if it works, it works",
        "5... Nf6 6. Be2 Be7 7. Qc2 O-O 8. O-O Be6 9. a3 d4": "Think this is the right time to push, could play Qd7, Rad8 first but I don't think it helps a great deal",
        "10. cxd4": "whites best option here I think is to swap off like he did",
        "10... Nxd4 11. Nxd4 exd4 12. Nf3": "Now with the pawn advantage in the centre, e5 is always a threat",
        "12... c5": "decided to play c5 to bring another pawn into my centre and to aim for a6, b5 later on",
        "13. b4": "this move still strikers me as a bit odd, I guess it's a way of generating some play for himself, and he obviously thinks if he plays this, he will win the pawn on d4 back at some stage",
        "13... cxb4 14. axb4 Bxb4 15. Ba3": "15 Rb1... a5 \n\nAnd I think black is better, this is to exchange the black bishop and weaken my possible defense of the d4 pawn further",
        "15... Bxa3 16. Rxa3 b5": "Have to start these pawns rolling",
        "17. Qc5": "there goes d4! Looks like b4 was a very good tactical move after all",
        "17... a6 18. Nxd4 Nd7": "Have to bring the knight into the action",
        "19. Qd6 Nb6 20. Qb4 Qf6": "want to get my queen active to free up the rooks on the bottom rank without putting it somewhere it can be attacked easily",
        "21. Nxe6": "Maybe a slightly strange move seeing as this is pretty much his only decent piece, maybe he thinks that his bishop can outplay my knight in the long run ",
        "21... fxe6": "decided to take back with this to open a nice little F-file and provide a barrier for his 2 central pawns that he is trying to advance",
        "22. d4": "here they come, perhaps a bit too early as I can easily attack it but maybe I'm just being picky ;)",
        "22... Rfd8 23. Rd1 Qf4": "Trying to make him wish he hadn't pushed the pawn and weakned them!",
        "24. Qb3": "Very clever move",
        "24... Qd6": "24 ... Qxe4\n25 Bf3\n\n",
        "25. Qh3": "keeping the attack on the e-pawn while preparing some sort of Bd3, e5 manouver",
        "25... Nc4 26. Rg3": "I dominate the queenside and have locked his centre for now so he tries a kingside assault",
        "26... Rac8": "I think maybe I should just push the pawns here, but I'm a little concerned it is too slow and he can just continue with his more immediate threats around the kingside, so I tried to positionaly outplay him.",
        "27. Qg4": "There's the first ;)",
        "27... Qe7": "I prefer this to moving a rook up, want to keep those rooks firmly patrolling the back rank, theres are too many open files to be doubling up yet.",
        "28. Rh3": "Now he switches attention to the h-file, I can't help thinking he may be running out of ideas a bit here, these threats are somewhat trivial and pretty easy to defend really.",
        "28... Nb2": "I like this move, it threatens his rook whilst forcing it to stay on the d-file to protect the pawn.",
        "29. Rd2 Rc1+": "Tying the bishop to the back rank",
        "30. Bf1 Nc4": "I think here I must have some advantage, my knight is active, his bishop is tied down and the pawns are ready to advance. ",
        "31. Rd1 Ne5": "I think Rxd1 lets him off the hook a bit",
        "32. Qh5 g6": "Pretty much completely attack-proofs my kingside for now",
        "33. Qe2": "Now I have to do something with my knight!",
        "33... Rxd1": "Lets his bishop back free but I think it's my best move now",
        "34. Qxd1 Nc6": "Preferred this to Nc4 as it pressures the d-pawn nicely and with the knight on c4, b4 must wait",
        "35. Rd3": "d5 loses the pawn eventaully I think, plus my e6 pawn is a target for later on",
        "35... Qf6": "Continuing the pressure on d4, I'm trying to get him to move one of his central pawns, which will weaken them",
        "36. e5": "there we go!",
        "36... Qe7 37. Qg4": "Maybe he should play Qb3 here and defend the pawn advance, but I think if he does that he's doomed eventually as the pawns can move forward without worrying about any counterplay from white",
        "37... a5": "The pawn advance begins.",
        "38. h4": "This is a good move, now committed to counterplay rather than all out defense he has to break by pawns up",
        "38... Kh8": "I need the option of gxh5",
        "39. h5 gxh5": "Think this is the best move as I can defend the h7 pawn quite well and after Qxh5 I can pick up his d-pawn",
        "40. Qxh5 Nxd4": "Now a pawn up",
        "41. Rh3 Rg8": "I have to play this otherwise\n\n42 Bd3 ... Rd7 \n43 Bxh7 ... Qxh7\n44 Qg4",
        "42. Qd1 Nf5": "here I think Rd8 might draw as it forces the perpetual but I thought I'd give the win a go.",
        "43. Bxb5 Qg7": "The open g-file hasn't done me any harm either!",
        "44. Bf1": "I think g3 is a better move really but he can't play it here as it shuts the rook in",
        "44... Qxe5 45. Qd7 h6": "Rg7 and I think white has a perpetual ",
        "46. Qf7 Rg7": "Now the king has an escape square after the check",
        "47. Qf8+ Kh7 48. Rd3": "Looking to play Rd8, Qh8 \n\nMaybe Bd3 was a bit too risky here?",
        "48... Qa1": "Pins the bishop, defends the pawn, and allows e5",
        "49. Rd8 Qe1": "Maybe I should have played this instead of Qa1, protects the e-pawn which can be won through checks if I don't protect it",
        "50. Qf6": "Hmm I get the feeling one of my pawns is dropping some time soon..",
        "50... a4": "The only play I have at the moment..",
        "51. Re8": "good move",
        "51... Qb1": "defends the knight after Rxe6. \n\n52 Rxe6 ... a3 \n\nand black has the edge",
        "52. Qc3": "Preparing Qc8",
        "52... Qe4": "Have to defend the e-pawn now",
        "53. Qc8 Nd4": "Threatening Nf3 ",
        "54. Rh8+": "Eliminating the pin on the g-file and nullifying all my Nf3  threats",
        "54... Kg6 55. Qe8+ Kg5": "55 ... Kf6\n56 Rxh6  ",
        "56. Qf8 Rg6": "Thinking long and hard about the safety of my king after every move at this point, luckily his pawns cannot afford to move and so I'm relatively safe.",
        "57. Qa3": "there goes my precious pawn! If I move the knight away to try and defend it then Qg3  and then Rf8  is very dangerous",
        "57... Kh5": "the only move really",
        "58. Qh3+": "decides to go for more than the pawn",
        "58... Qh4": "Not sure if this is the right move or not, but the thought of Kg5 really does look iffy",
        "59. Qe3": "Be2  is coming",
        "59... Qf6 60. Be2+ Nxe2+": "not happy about having to swap the knight off for his bishop but if I don't I lose",
        "61. Qxe2+ Kg5 62. Rc8": "Still got my pawn, but I have a feeling it won't last ",
        "62... Qd4": "I have to play this really to stop the checks",
        "63. Rc4": "unfortunately it loses my pawn",
        "63... Qd5 64. Rxa4 Kf6": "Should be able to keep my king relatively safe in the corner now",
        "65. Qb2+ Kf5": "Kf7, Ra7  and I think I lose ",
        "66. Qc2+ Kf6": "Have to stop him getting a Ra7  and pinning me to the back rank",
        "67. Rf4+ Kg7": "Now it's safe to go back as the rook can't check me.",
        "68. g3": "dealing with the mate",
        "68... Qd6": "threatening his rook",
        "69. Rc4 Rg5": "Have to allow my king the g6 sqaure ",
        "70. Rc7+ Kf6 71. Rh7 Rh5": "Only way of holding the pawn",
        "72. Ra7 Qd4 73. Ra8": "Preparing Rf8 ",
        "73... Rh3 74. Qb3": "Defends the g3 pawn and attacks e6",
        "74... Rh1+": "Think it's time to trade off the rooks and play for draw, should be fairly straight forward",
        "75. Kxh1 Qe4+ 76. Kh2 Qxa8 77. Qe3 Qf8": "King can only defend one of them!",
        "78. Qf4+ Kg7 79. Qxf8+ Kxf8": "I have a draw now as long as I play sensibly",
        "80. Kh3 Kg7 81. Kh4 Kg6 82. Kg4 h5+ 83. Kf4 Kf6 84. Ke4 Kg5 85. f3 Kf6": "Draw agreed."
    },
    "url": "https://gameknot.com/annotation.pl/m8in2s-fast-tournament?gm=12212",
    "gameName": "m8in2's FAST tournament.",
    "players": "zvardon (1990) vs. paddl3s (1860)",
    "opening": "French (C00), Reversed Philidor formation"
}