{
    "moves": {
        "1. d4 Nf6": "{Lagrave, Polgar - 72%} (1...f5 {Nakamura - 28%})",
        "2. c4 g6": "{Lagrave, Nakamura - 51%} (1...e6 {Polgar - 49%}) The vote sends us into the King's Indian: fianchetto, Uhlmann (Szabo) variation (ECO E62).",
        "3. Nf3 Bg7": "{Polgar, Nakamura, Lagrave - 100%} When the GM's all agree we don't get to vote.",
        "4. g3 O-O": "{Lagrave, Polgar - 66%} (4...d6 {Nakamura - 36%})",
        "5. Bg2 d6": "{Nakamura, Polgar - 79%} (5...c6 {Lagrave - 21%})",
        "6. Nc3 Nc6": "{Nakamura, Polgar - 66%} (6...c6 {Lagrave - 34%} There is nothing wrong with c6 but if I had a choice to add a third move here I would pick c5 over c6. I'm not an expert in this opening however so my preference might have been a bad idea. ",
        "7. O-O e5": "{Polgar - 52%} (7...a6 {Lagrave, Nakamura - 48%}) The fight for the centre begins. Blacks Knight and pawn on e5 exert pressure on the d4 square. Blacks dark squared bishop also exerts latent pressure on this square. However white is exerting pressure of his own on the d5 square with his flanking pawn on c4 his knight on c3 and his bishop on g2. There is also nothing stopping him from taking this square by placing his d pawn on d5 driving the c6 knight away. This is the move he plays next. ",
        "8. d5 Ne7": "{Polgar, Nakamura, Lagrave - 100%} All the GM's agree to this move. If we had played the knight to a5 then white probably would have answered b3. Perhaps the knight could have aided the c pawns advance to c6. ",
        "9. e4 c6": "{Nakamura - 58%} (9...Ne8 {Polgar - 26%}) (9...Nd7 {Lagrave -16%}) I think the reason Lagrave wanted to play his choice would be to get the knight to the c5 square. Perhaps with a5 first to stop white forcing the knight to retreat. This would give the knight control of b3 and a4 keeping the queen of those squares. Polgar's move might have been chosen to get the knight to a6 via the c7 square. It might also have been to get the knight to d4 after cxd5 cxd5. But only if the queen was no longer covering that square. The knight move might also be to guard against white playing c5. Which might lead to a pawn advancing to d6. (9...Ne8 10. c5 cxd5 11. cxd5 b6 12. cxd6 Nxd6) \nAnother reason for the two knight moves would be to move the f6 knight so black can begin a kingside attack with the advance of the f7 pawn to f5",
        "10. a4 Bg4": "{Nakamura - 44%} (10...a5 {Lagrave - 29%}) (10...Ne8 {Polgar - 27%})\nLagraves move stops the a - pawns advance and prevents the b - pawn going to the b4 square. Polgar wants to move the knight to play f5 we probably should be trying to start a kingside attack. In this fianchetto variation it seems that white is going after the queen side and we should be going after the kingside. I'm not sure we should have played c6 earlier. If you consider the direction of the pawns ours are pointing kingside. We probably should have gone with Polgar's move. ",
        "11. a5 cxd5": "{Lagrave, Polgar - 63%} (11...Qd7 {Nakamura - 37%}) Nakamura's move prevents h3 since that would lead to (11...Qd7 12. h3 Bxh3 13. Bxh3 Qxh3)",
        "12. cxd5 Qd7": "{Lagrave, Nakamura - 83%} (12...Ne8 {Polgar - 17%}) All out pieces are on the Kingside our dark squared bishop is bad and white has plenty of potential weak spots to attack. The pawns on d6 and b7 are potential problems. Qd7 keeps the knight away from b5 and prevents the white queen going to a4 unless white wants to exchange it. He can however still move it to b3 to attack the b-pawn. I think maybe Ne8 would have been better since we need to begin attacking the kingside with the pawn advance f7-f5. ",
        "13. Be3": "White adds another piece to his attack on the queenside pressuring the pawn on a5.",
        "13... Rfc8": "{Lagrave, Nakamura - 71%} (13...Nh5 {Polgar - 29%} taking control of the c-file and getting a piece over to our vulnerable queenside. Polgar wants to get the knight out of the way for the pawn advance. (13...Nh5 14. h3 Bxf3 15. Qxf3 f5)",
        "14. Qa4 Ne8": "{Lagrave, Nakamura - 69%} (14...Qd8 {Polgar - 31%}) Although it would be possible still to advance the f pawn that doesn't seem to be the reason for this knight move. It seems instead we are going to used the knight to defend our queen side. Polgar's move is probably to avoid swapping queens. ",
        "15. Nd2": "White is bringing another piece over to the queenside to aid in his attack.",
        "15... Qd8": "{Lagrave, Polgar - 66%} (15...Nc7 {Nakamura - 34%}",
        "16. Qb4 Nc7": "{Nakamura, Polgar - 78%} (16...Bd7 {Lagrave - 22%} Continuing to get the knight over to the queen side to aid in the defence. White doesn't take the hanging pawn since Rcb8 would win his queen. The two black knights are covering the flight squares a6 and c6.",
        "17. Nc4 Na6": "{Polgar, Nakamura, Lagrave - 100%} The queen is now free to take the pawn. Black had to make the choice either lose the d pawn or the b pawn. Letting the knight take the d pawn was probably more dangerous.",
        "18. Qxb7 Rxc4": "{Nakamura - 65%} (18...Nc5 {Lagrave, Polgar - 35%}) I think the move chosen was probably the best. Since (18...Nc5 19. Bxc5 dxc5 20. d6)",
        "19. Qxa6 Rb4": "{Polgar, Nakamura, Lagrave - 100%} We now seem to be on they way out trying vainly to defend our queen side with no attempt at counter attack. This move was mandatory since our rook was under attack by the queen.",
        "20. f3 Bc8": "{Polgar, Nakamura, Lagrave - 100%} A good move driving the king away from the queenside. Perhaps buying us time for a counter attack.",
        "21. Qe2 f5": "{Nakamura, Polgar - 88%} (21...Qd7 {Lagrave - 12%}) The pawn is finally at f5 but I suspect its too late now. You may notice as you go through the game that our knight on e7 does very little in the game from now on.",
        "22. Qd2 Ba6": "{Nakamura, Polgar - 81%} (22...f4 {Lagrave - 19%}) The move played keeps the knight out of b5. It also attacks the rook. I'm not sure if it was the best move however. Since white wants his rook over on the queen side anyway. What about f4 (22...f4 23. gxf4 exf4 24. Bxf4) It opens the a1 - h8 diagonal for us but it also lets his bishop put pressure on d6. There is something be said for the move making our bishop more active. Perhaps f4 was the better choice. Maybe the move a6 was worth considering? The dark square bishop would no longer be targeting our pawn and the knight wouldn't be able to go to b5.",
        "23. Rfc1 Qb8": "{Nakamura - 51%} (23...Qd7 {Lagrave, Polgar - 49%}) Attempting to put some pressure on the b - pawn. The alternative move stops white moving the knight to a4. (23...Qd7 24. Na4?? Rxa4 25. Rxa4 Qxa4) It also stops the rook moving to a4. It also allows the queen to get to g4 after 23...Qd7 24. Qc2 fxe4 25. fxe4 Qg4)",
        "24. Na4 Rb3": "{Lagrave, Polgar - 70%} (24...Qb7 {Nakamura - 30%}) The rook move is probably in order to later move to d3 since the bishop is protecting that square. Nakamura's move may be because of the threatened move Nb6. That move is no longer a threat since the rook has moved.",
        "25. Rc3": "Prevents the rook getting to d3 and also prepares to double up the rooks.",
        "25... Rb4": "{Nakamura, Polgar - 72%} (25...f4 {Lagrave - 28%}) I'm not sure its a good idea to move rook back again it seems like a wasted move. It also allows white to double up his rooks. f4 might have been better since it frees the bishop. It would also put pressure on the b-pawn.",
        "26. Rca3 f4": "{Lagrave, Polgar - 66%} (26...Rb7 {Nakamura - 34%}) I think Nakamura is looking to avoid Nb6. The move that was chosen forces white to move his bishop. Maybe Nc8 followed by Bc4 in order to advance the pawn to a6 and then move the knight to a7 to try and make it more active.",
        "27. Bf2 Bh6": "{Nakamura - 70%} (27...Rb7 {Polgar - 17%}) (27...fxg3 {Lagrave - 13%}) I think polgar now wants to avoid Nb6. I believe Lagrave's move is to give room to manoeuvre for the bishop and to force white to protect his bishop again by hxg3. I'm not sure about Nakamura's move it doesn't stop what comes next.  ",
        "28. Nb6": "White plays the move as I suspected he would.",
        "28... fxg3": "{Polgar, Nakamura, Lagrave - 100%} If white goes after the bishop (29. Qxh6 gxf2+ 30. Kxf2 Rxb2+ 31. Ke1 axb6)",
        "29. Qxb4 gxf2+": "{Polgar, Nakamura, Lagrave - 100%}",
        "30. Kxf2 Bc8": "{Nakamura - 57%} (30...axb6 {Polgar - 30%}) (30...Bf4 {Lagrave - 13%})",
        "31. Rb3 axb6": "{Polgar, Nakamura, Lagrave - 100%} Material is not equal since white will now take the pawn. However black had no option but to take the knight.",
        "32. Qxb6": "White is a pawn ahead in material and has to pawns that can queen on the queen side. The a - pawn being the most dangerous and in fact the piece that causes our side to resign.",
        "32... Qa7": "{Nakamura, Polgar - 82%} (32...Qxb6 {Lagrave - 18%}) Neither move seems likely to save us at this point.",
        "33. a6 Kf7": "{Nakamura - 70%} (33...Bg5 {Polgar - 15%}) (33...Qd7 {Lagrave - 15%}) Qd7 seems like a bad idea its probably a move to defend the d - pawn but it lets white push the pawn. The other two moves are probably partly to defend the knight. The king move also prevents whites queen putting black in check.",
        "34. Qxa7 Rxa7": "{Polgar, Nakamura, Lagrave - 100%}",
        "35. Rb6 Ke8": "{Lagrave, Nakamura - 59%} (35...Bd2 {Polgar - 41%}) No way to defend the d - pawn unfortunately. The Bishop doesn't really have anywhere to go after d2.",
        "36. Rxd6 Bf8": "{Polgar, Nakamura, Lagrave - 100%}",
        "37. Rb6 Nxd5": "{Polgar, Nakamura, Lagrave - 100%} This seems like a desperate move but we don't have many options. The knight has been a liability for quite a bit of the game anyway.",
        "38. Rb8 Bc5+": "{Nakamura, Polgar - 50%} (38...Nb6 {Lagrave - 50%}) The knight move defends the bishop but I think the move that was played is better. It makes the dark squared bishop a little more active and the knight can still run to the defence of the light square bishop.",
        "39. Kg3 Ne7": "{Polgar, Nakamura, Lagrave - 100%}",
        "40. Bh3 Kd8": "{Nakamura - 60%} (40...Rc7 {Lagrave, Polgar - 40%})",
        "41. Bxc8 Nxc8": "{Polgar, Nakamura, Lagrave - 100%}",
        "42. Rc1 Rc7": "{Lagrave, Polgar - 89%} (42...Be3 {Nakamura - 11%}) No move can do much good at this point I'm not sure which is better. The two rooks are going to over whelm our position anyway. ",
        "43. Rxc5 Rxc5": "{Polgar, Nakamura, Lagrave - 100%}",
        "44. a7": "Black resigns. (44...Ra5 45. a8Q Rxa8 46. Rxa8)"
    },
    "url": "https://gameknot.com/annotation.pl/magnus-carlsen-vs-the-world-http-rwcc-g-star-com?gm=33836",
    "gameName": "Magnus Carlsen Vs The World, http://rwcc.g-star.com/",
    "players": "Magnus Carlsen  vs. The World ",
    "opening": "King's Indian, 3.Nf3 (E60)"
}