{
    "moves": {
        "1. e4": "One of the best (or more interesting) games I remember having played here.\n",
        "1... e5": "(Extra comments about engine-valuation are only based in GK computer analysis)",
        "2. Nf3 Nc6 3. Bb5 a6 4. Ba4": "Entering Ruy Lopez...",
        "4... Nf6 5. O-O Be7 6. Re1 d6": "Ruy Lopez (C87), closed, Averbach variation.",
        "7. c3 b5 8. Bb3": "He could have also chosen Bc2.",
        "8... Na5 9. Bc2 c5 10. d4 Qc7": "More or less standard moves, after his decission",
        "11. Nbd2 O-O": "Before ... cxd4 12. cxd4 followed by Nc4, the pawn in e5 needed to be protected (because after 13. Nxc4 Qxc4, 14. dxe5 wins the pawn).",
        "12. h3 Re8 13. Nf1 Bf8 14. Ng3": "Typical idea in the Spanish opening.",
        "14... g6": "Avoiding Nf5.",
        "15. d5": "Nothing that was really unexpected.",
        "15... Nc4": "Maneuvering to place my knight in a more active position.",
        "16. b3 Nb6 17. Bg5 Bg7 18. Qd2": "Since the rook is not in f8, it's possible to avoid exchanging the bishops with the move we'll see (since it wouldn't make any sense losing my black bishop after the 'false' fianchetto I've made).",
        "18... a5 19. Bh6 Bh8 20. Nf5": "Good idea. If ...gxf5 21. Qg5+ Bg7 22. Qxg7#",
        "20... Bxf5": "It' seems there's no immediate threat, but any better ideas? After 21. Qg2 the pressure could start to be very dangerous.",
        "21. exf5 Re7": "Reinforcing g7 and preparing an eventual Rf7.\nNbxf5 seems inoffensive according to the GK computer analysis, but I didn't think so due to a possible bishop sacrifice on g6, combined with Qf5.",
        "22. fxg6 fxg6 23. Bg5 Rf7 24. Rad1 b4": "Forcing white to place all queenside pawns on black squares.\nGK says that c4 (-0.18) is a better option and b4 (-0.88).",
        "25. c4": "Time to seek a black bishops-exchange.",
        "25... Re8 26. Nh2": "Preparing f4.",
        "26... Ree7": "I didn't like quite much Qd7, since it blocks Nd7.",
        "27. Ng4": "I wasn't aware of the double-attack with Nh6 until he placed his knight here.\nHere the engine recommends Nxg4, followed by 28. hxg4 Bf6. hxg4 instead of Bxe7 because of Nf2 (two minor pieces for a rook, altough I wouldn't be opmimistic with that knight's future after Ra1 Qxe7 Rf1",
        "27... Rf8": "Funny movements by my rooks. Any better ideas?",
        "28. Nh6+ Kg7": "Settling for a perpetual draw.",
        "29. Ng4 Kg8 30. Nxf6+": "No perpetual draw any more.\nGK engine recommends to place the knight in h6 to keep me under pressure.",
        "30... Bxf6": "-0.83 after this move.",
        "31. Bh6 Bg7 32. Bxg7": "Alternative: 32. Bg5 Ref7 ?",
        "32... Kxg7": "Goal achieved, now time to seek a knight vs bishop ending.",
        "33. Re4": "Aggressive move with a clear direct attack as objective.",
        "33... Ref7 34. Rh4 Kg8": "In case of ...Rf2 35. Qh6+ Kg8 36. Bxg6, and then if hxg6, the forced sequence 37. Qh8+ Kf7 38. Rh7+ Ke8 and finally, simply 39. Rxc7 Rxh8 Kxf2 or 39. Qxf8+ Rxf8 and 40. Rxc7 with up the exchange",
        "35. f3": "Avoiding Rxf3, but allowing the rook exchange.",
        "35... Rf7f4": "Exchange which I'd for sure go for.",
        "36. Rxf4 Rxf4 37. Be4": "Senseless at first sight, but then I realized it was a preparation for g3",
        "37... Qg7": "Placing the Queen in the best, more flexible place and allowing Rf8 after 38 g3 (so that and eventual Qg5 had no squares to go",
        "38. g3 Rf8 39. Qg5": "I love it when a plan comes together",
        "39... Qf6": "Offering Queen's exchange, let's not forget that the goal is to get a knight vs bishop ending, to take advantage of White's pawns placed on the same colour squares as his bishop",
        "40. Qxf6": "I don't think this was a good idea for him.",
        "40... Rxf6 41. Kf2 Nd7": "What about a5 instead? 42. bxa5 (avoiding closing definitely the queenside) Nxa5 43. Ra1.\nb3 as answer to a3 could be a good idea, but Bc2 would be a perfect answer instead of b3.\nNo suggestions by the GK analysis.",
        "42. Ra1 Rf8 43. a3 Ra8 44. axb4": "I had miss-calculated axb4 and realized now.",
        "44... cxb4 45. Ke3 Kf7 46. f4 Kf6 47. fxe5+ Kxe5 48. Rf1": "No more GK comments until this move, where it suggests that Nc5 forces Rf7 and then a4 gives Black +1.31.\n",
        "48... Rf8": "After considering Nf6, I thought it wouldn't be a good idea to trap the king (notice that after 49. Bc2 if 50. Re1 my King would needed a free square to flee after the discovered attack with 51. Kd3+).\nI decided to offer a rook exchange (which I thought it wouldn't be accepted). After 49. Ra1 Nc5 50. Bc2 and then I would have considered if Nb7 would be a good move to avoid losing the 'a' pawn, at least while placing h&g pawns in black squares.",
        "49. Rxf8": "Surprise!",
        "49... Nxf8": "+0.01",
        "50. h4 h6 51. Kd3": "51. g4 better, followed by Kf6 52. Kd4 Nd7 53. Bf3 Nc5 54. Bd1 (and leading towars a draw, this analysis by GK engine)",
        "51... g5 52. Bg2": "'Fatal' mistake.",
        "52... gxh4 53. gxh4 Ng6": "Threatening Nf4+.",
        "54. Bh1 Nxh4": "Free pawn.",
        "55. c5": "The only move that gives White chances to draw the game.",
        "55... dxc5 56. Kc4 Nf5": "Kd6 was much better here.",
        "57. Kxc5 Nd6 58. Bf3 a4": "Taking risks to try to win the game.",
        "59. bxa4": "I was expecting 59. Kxb4 axb3 60. Kxb3. But this is even better (for you, the viewer). ",
        "59... b3": "I confess I didn't see the move that comes now. I only checked that after 60. Be2 Ke4 the game was 0-1.",
        "60. Bd1": "Surprise! (II).",
        "60... b2 61. Bc2 h5 62. a5 Nb7+": "Fortunately, I had this double attack to avoid losing (!) the game.",
        "63. Kc4": "Wow. Just... wow.\nI could have expected Kb5, tempting me to take on d5 (and losing the game, because the 'a' pawn would become unstoppable).",
        "63... Nxa5+ 64. Kc3": "Blunder (which, of course, I didn't see).  h4 65. Kxb2 h3 66. Kd1 Kf4 67. Bh5 h2 and, thanks to the 'd' pawn, 0-1.\n",
        "64... Kxd5 65. Kxb2": "Time to try to trick my rival, because I was sure the position was a theoretical draw.\nBut theory is for theoreticians!!!",
        "65... Nc4+": "From now on, I'll try to expose my thoughts (which are, obviously, almost always not accurate).\nFirst, bringing the knight to the fight.",
        "66. Kc3 Ne3": "Then, threatening the bishop.",
        "67. Ba4 Ke5": "And... nothing really else to add, logical moves (for a human, or a low-average chess player as I am).",
        "68. Kd2 Kf4 69. Ke2 h4": "70. Bd6 draw (after Nf4+ 71. Bxg4 Kxg4 72. Kg1, king in his way to safety).",
        "70. Kf2 h3 71. Kg1": "Mate in 12 (Kg3 72. Kh1 Ng3 73. Kg1 h2+ 74. Kf1 h1=Q+...).",
        "71... Kg3 72. Bc6": "Surprisingly*, my rival allowed my to end this beautiful game with a mate in 3. In fact, I was thinking of 72 Bd7 with only Nf1 as possible solution, but 72. Bc6 can also be followed by Bg4.\n*Well, not really surprisingly, after all this fight our minds (at least mine) were exhausted and, as he admitted after the game, he moved too fast in the end (last ~50 moves were played in one afternoon).",
        "72... h2+": "Puzzle #145113\nhttp://gameknot.com/chess-puzzle.pl?pz=145113",
        "73. Kh1 Nd1 74. Bf3": "Game (with analysis): http://gameknot.com/analyze-board.pl?bd=22801576&fb=1&rnd=0.7000481062568724",
        "74... Nf2#": "I hope you enjoyed the game and the annotation, thanks for 'watching'.\nPlease feel free to add any comments, suggestions or corrections; and sorry for any possible grammar mistakes."
    },
    "url": "https://gameknot.com/annotation.pl/make-me-lift-the-hat-open-challenge-from-skovbakke?gm=58087",
    "gameName": "make me lift the hat (open challenge from skovbakke)",
    "players": "skovbakke (1774) vs. eduherminio (1698)",
    "opening": "Ruy Lopez (C87), closed, Averbach variation"
}