{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. d4 exd4": "The Scottish game ",
        "4. Nxd4 Nf6 5. Nc3 Bb4": "pins the knight and seeking to undermine the e4 pawn. Though this comes at a cost of a permanent structural weakness.  ",
        "6. Nxc6 bxc6 7. Bd3": "Developing and defending e4. This  bishop can become a useful future attacking piece if white ever has a chance to play e4-e5. \n",
        "7... d5": "un-doubling the pawns while at the same time increasing the scope of his LSB and queen. Black is following a common theme in the Scottish game which is to hit at and liquidate the e4-pawn. Here he succeeds in getting white's center pawns of the board but at the expense of freeing the d3-bishop. Such wide open spaces often suit the bishop pair. ",
        "8. exd5 cxd5 9. a3": "putting the question mark on the bishop and forcing black to decide what to do retreat or exchange. ",
        "9... Be7": "This is IMO slightly more accurate than 9....Bxc3 as in one resent correspondence game white manage to make good use of his bishop pair after 10.bxc3 0-0 11. 0-0 Qd6 12. Qf3 Ba6 13. Bf4",
        "10. Bf4": "Develpoing the bishop to a very active square and hitting at the weak c7 pawn. ",
        "10... c6": "shores up d5 but not that threatening more active is 10...c5!? with counter play. ",
        "11. O-O": "An alternative here was to spend the extra tempo gained from ...c7-c6 to play 11.h3 preventing black from playing a piece onto g4. however, the immediate ...Bg4 is met with f3 increasing white's control of the e4 square and forcing black to retreat the bishop with tempo. Therefore, I saw no need to create a weakness in front of my castled king position. It is often advised to now move the pawns in front of the castled king unless absolutely necessary. ",
        "11... O-O 12. Na4": "This is a novelty in my books. The idea is to immediately challenge black's main idea which is to play ...c5. For example, if black did try the immediate 12...c5 white could now counter with 13.c4 and black's counter chances are all but stopped and settled with a backward c-pawn that could be a target. ",
        "12... Re8 13. Re1": "centralizing the rooks. ",
        "13... c5": "I had prepared for this and had planned to meet it with c4",
        "14. c4 Bb7": "IMO 14...d4 with an enduring space advantage in the center was a better option. ",
        "15. cxd5": "black now has an isolated c-pawn. White's bishops are slightly better than black's. Things are slightly in white's favor. ",
        "15... Qxd5": "setting up an immediate attack on g2 and regaining the pawn. ",
        "16. Bf1": "defending g2. ",
        "16... Qf5": "black has a very active queen and LSB while white has been forced to retreat a bit. ",
        "17. Bg3": "despite having the bishop pair kicked around abit the position is dynamically equal due to white's strong presence in the center and black having a isolated c-pawn. ",
        "17... Bf8": "Neither side is willing to commit to an attack. So black quickly offers a trade and tries to force a draw. ",
        "18. Rxe8 Rxe8 19. Nc3": "It will have to be an error on one side to break the deadlock here. But for now I seek to rejuvenate my pieces.  ",
        "19... Bc6": "Bc6 slightly improves the scope of the bishop and prevent the white knight from going back to a4 to attack c5. It also opens up the b-file for future use. In such positions it is best not to move pawns but to seek out active/safe squares for your pieces. ",
        "20. Nb5": "Small moral victory? threatening to create a past pawn situation after Nxa7. Though black should be able to hold easily the treat of the idea is often enough to cause some small inaccuracy. ",
        "20... Ne4 21. Nxa7 Bb7 22. Nb5": "With the extra pawn I forced black into playing for the quick draw or die situation. ",
        "22... Nxg3": "wrong move. Can you guess black's only move to save the game?",
        "23. hxg3 Re6": "black is looking to create mating threats on f2 but he does not have the time or resources to do that. I continue to increase my control of the center and look for an opportunity to march my passer. ",
        "24. Nc3 Rf6 25. Qe2": "defending f2",
        "25... Bc6 26. Rd1": "developing the remaining rook and increasing my advantage in the center",
        "26... g6 27. Qe3": "a very cunning waiting move that puts black in a virtual positional bind where any move now increases white's advantage. This move follows the same principle that I suggested earlier about in equal position seek to increase your piece activity. ",
        "27... Re6 28. Qd3": "the offer of trading queens is poisonous because with the queens off the board it will make it easier for white to march the a-pawn up the board. ",
        "28... Qe5 29. a4": "here it comes!",
        "29... Qb8 30. Qc2 Qb4 31. b3 Rd6 32. Nb5": "hemming in the black queen and forcing black to trade on d1",
        "32... Rxd1 33. Qxd1 Qe4 34. Qd3 Qb4 35. Nd6": "The idea is Nc4 and now a4-a5 would be possible. ",
        "35... Qd4 36. Nc4 Qxd3 37. Bxd3": "the forward march of the a-pawn is decisive.  ",
        "37... Bg7 38. Be2 Kf8 39. Bf3": "gaining control of the queening square which is a must if you want to queen a pawn. ",
        "39... Bd7 40. Bd5": "hitting the weak f7 pawn and preventing Be6 and also protecting b3. ",
        "40... Ke7 41. Nb6 Bf5 42. a5 Be5 43. a6 Bb8 44. Bc4 h6 45. Na4": "attacking c5 and threatening to win another pawn\n",
        "45... Ba7 46. Nc3": "the threat is Nb5 forcing the a-pawn forward",
        "46... Bd7 47. g4": "entombing black's bishops",
        "47... f6 48. Nd5+ Ke6 49. f4 Kf7 50. Kf2 Bb8 51. f5 gxf5 52. gxf5 h5 53. g3 Kg7 54. Nc3 Kh6 55. Kf3 Bc6+ 56. Ke3 Kg5 57. Bd5": ""
    },
    "url": "https://gameknot.com/annotation.pl/making-progress-when-there-is-none-to-be-made?gm=60203",
    "gameName": "Making progress when there is none to be made. ",
    "players": "elyhim (2490) vs. remajik (2494)",
    "opening": "Scotch (C45), Schmidt variation"
}