{
    "moves": {
        "1. e4 e5 2. Nc3 Nc6 3. Nf3 Nf6": "The four knights game.  Depending on white's next move, this could transpose into the Italian Game (Bc4), the Ruy Lopez (Bb5), the Scotch (d4), or the extremely aggressive Halloween Gambit (Nxe5).",
        "4. Be2": "Nothing *wrong* with this move, but it doesn't really take the game to black the way the other lines do. ",
        "4... d5": "It's just my preference, but if my opponent is going to play passively, that's every invitation for me to come out aggressively.  Why not be the one controlling the action; after all, attacking is a lot easier than finding the right defense!",
        "5. exd5": "Understandably, not wishing to allow d4.",
        "5... Nxd5": "The only logical move.",
        "6. Nxd5": "Unnecessarily trading pieces, where black's d5 knight will be replaced by his queen.  Not necessarily fatal, of course, but any number of moves, such as 0-0, d3, or Bb5 (finding a better square for the e2 bishop) look better.",
        "6... Qxd5": "After this recapture, black may already be slightly better.",
        "7. O-O": "While d3 should also be considered here, as it prevents black from playing e4, 0-0 looks at least just as good to me.",
        "7... Be7": "I considered e4 for some time here, as it seems like it can't possibly be bad to boot the knight to e1.  But after that, black lacks a good follow-up, and white's eventual d3 will give the knight new life.",
        "8. b3": "?!  But if white plays b3 now, black's e4 will carry a much stronger punch.  The open diagonal to the a1 rook becomes a weakness, as either the black queen or e7 bishop can strike at it, \"forcing\" white to play c3, making a potential d3 much less effective.",
        "8... e4": "The logical move, as discussed last note.",
        "9. Bc4": "?  On the surface, it appears that white has found a good in-between move.  This should force the black queen away from her powerful position on d5, while the temporary presence of the knight on f3 still guards e5 and d4, preventing the queen from threatening the a1 rook.\n\nBut black has a shot.",
        "9... Qh5": "!  This move wins the knight.  The only \"safe\" square for the knight, e1, would cause white to lose his queen thanks to this move.  A couple of small mistakes followed by one tactical oversight puts white at a large disadvantage.  But there is still a lot of chess to be played.",
        "10. Re1": "An interesting try.  I was expecting Be2, with exf3 being followed by Bxf3, at least chasing the queen and giving white another tempo for his knight.  But the rook's threat down the e-file could turn out to be useful down the line.",
        "10... exf3": "Of course, if black doesn't claim his prize now, he won't have an opportunity to.",
        "11. d4": "A slightly confusing move to see.  Why play b3 at all if the plan isn't to move the bishop to b2?  Still, black must be careful not to lose his c6 knight the same way white lost the one on f3.",
        "11... Qg6": "?  And here's my first real mistake of the game!  Threatens mate, and if Qxf3, threatens Qxc2, so how can this be bad?  Well, it isn't nearly as good as Qg4, which not only threatens mate, but can meet Qxf3 in any number of ways, and increases the pressure on the newly-far-flung d4 pawn.  White is still losing here, but black could have made this game a lot easier for himself!",
        "12. Qxf3": "And now it's painfully clear why Qxc2 wasn't a real threat after all; white gets a monster attack on f7 and e7 if the queen leaves the defense of the f7 square!",
        "12... O-O": "No time like the present to free the bishop on e7, get the king to safety, add another defender to f7 and get the rook more active all at once.  This, my friends, is why we castle!",
        "13. c3": "Saves the c-pawn, but also takes the d4 and b4 squares away from black's knight.  ",
        "13... Bg4": "Not a bad move here, but maybe not the best.  The white queen isn't on a great square right now, and forcing her to move doesn't really have a good follow-up.",
        "14. Qe3": "Really, really making sure black doesn't move that c6 knight.",
        "14... h6": "?  Seeing the queen lined up with a potential Bg5, I couldn't resist playing h6.  AND I SHOULD HAVE; h6 allows white to greatly improve his position, as white demonstrates.",
        "15. d5": "!  Looks like white is going to win his piece back.  d5 threatens the knight, and if the knight moves, then Qxe7.  Black is going to have to fight to try to hold onto his advantage!  Note that one seemingly innocuous mistake -- last move's h6 -- is enough to throw away a winning advantage.",
        "15... Bg5": "The only chance to hang onto the extra material; the threat to the queen is much more pressing than that to the c6 knight.",
        "16. f4": "...and this renews the double threat.  Black cannot save both pieces, but he's got to try!",
        "16... Bh4": "Threatening to win a rook for the two pieces, leaving black up a rook for a bishop and pawn.  Black is not making it easy for white to even the score here.",
        "17. g3": "?  This might look like it renews the threat to both the knight and bishop, but this is a phantasm.  This time, the bishop on h4 is immune, as a hypothetical gxh4 gets met by a lethal discovered check, Bf3+, winning for black.  (Note that Bf3 is the only square that works; it blocks the queen from interposing at g3.)",
        "17... Na5": "?  Ne7 was better; after the bishop moves, b4 traps the knight.",
        "18. Bd3": "Best.  And moving the bishop here ensures that the knight is a goner.  Black has no choice but to address the threat to the queen.",
        "18... f5": "Also best.  Now that there's no threat to the King on g8 from the a2-g8 diagonal, the pawn on f7 is free to advance.  White is going to have to contend with an impending Rae8, making white's heavy pieces very uncomfortable.  Despite it all, though, b4 on the next move makes this a very interesting game.",
        "19. gxh4": "??? Losing immediately.  Much better was b4, where Rae1 leads to Qf2, an exchange of rooks, and plenty of interesting chess after that.  In my opponent's words, \"being the dope that I am, I was thinking small...hey he can't take any of my pieces when he moves the B....who needs the King anyway!\"",
        "19... Bf3+": "!  You need a king to live.",
        "20. Kf2": "Kf1, the only other legal move, is also mate.",
        "20... Qg2#": "A miniature full of small mistakes, to be sure.  But as you can see, not all mistakes are created equal!"
    },
    "url": "https://gameknot.com/annotation.pl/making-the-most-of-your-chances?gm=39942",
    "gameName": "Making the most of your chances",
    "players": "troop80 (1645) vs. ethansiegel (1825)",
    "opening": "Vienna game, Max Lange defence (C25)"
}