{
    "moves": {
        "1. c4": "In this match Malpas & Oswestry were home to Wrexham in Malpas. We(Malpas & Oswestry) were missing several players, so I had to play on top board, rather than board 4. I had already lost to Bob with black earlier in the season, where he played 1. e4 and an open Sicilian. Instead now he plays The English Opening. The English derives its name from the English (unofficial) world champion, Howard Staunton, who played it during his 1843 match with Saint-Amant and at London 1851, the first international tournament.",
        "1... Nf6": "Hoping to a transposition to main lines with 2. d4.",
        "2. g3": "But he plays this. I decided to copy his fianchetto.",
        "2... g6": "With this.",
        "3. Bg2": "He completes the fianchetto.",
        "3... Bg7": "So do I",
        "4. Nf3": "His knight comes out.",
        "4... O-O": "I castle.",
        "5. O-O": "So does he.",
        "5... c5": "I decided to turn it into the symmetrical variation of the English Opening. It is drawish, but hey I'd be happy to draw with Bob.",
        "6. Nc3": "He develops his knight.",
        "6... Nc6": "So do I.",
        "7. d4": "He breaks in the centre.",
        "7... d5": "I maintain the symmetry. ",
        "8. dxc5": "He takes.",
        "8... dxc4": "I take back.",
        "9. Qa4": "He moves to recapture his pawn. I could have just followed the symmetry with Qa5 here. Gameknot computer suggests .....Nd5 10. Qxc4 Nxc3 11. bxc3 Be6 12. Qh4 h5 13. Bb2 Qa5 14. Nd4 Qxc5 15. Nxe6 fxe6 16. Bxc6 bxc6 17. Rad1 but....",
        "9... Be6": "I protect the pawn like this.",
        "10. Ng5": "He attacks my bishop.",
        "10... Qc8": "I don't want him taking and doubling my pawns.",
        "11. Rd1": "He takes the open file.",
        "11... Rd8": "I contest it.",
        "12. Rxd8+": "He takes.",
        "12... Nxd8": "I take back.",
        "13. Be3": "He develops.",
        "13... Ng4": "I attack his rook, and drawn on my suggestion. As we were already 3-0 down in a five board match, my opponent agreed. After the game we found that white actually has a combination here, which wins a pawn - 14. Qe8+ Bf8 15. Nxh7! Many thanks for reading, please rate this on the star system, and leave a comment or two to let me know who is reading my annotations! Until next time dear reader!"
    },
    "url": "https://gameknot.com/annotation.pl/malpas-oswestry-v-wrexham?gm=63372",
    "gameName": "Malpas & Oswestry v Wrexham",
    "players": "Bob Clark (2010) vs. Charles L Higgie (1918)",
    "opening": "English, 1...Nf6 (Anglo-Indian defense) (A15)"
}