{
    "moves": {
        "1. d4": "At last I win a game again!",
        "1... Nf6": "Lovely feeling after losing my first game of the season.",
        "2. c4": "It was a crucial win, helping my team to a 3-2 win.",
        "2... g6": "http://www.wirralchessleague.uk/results.php?club=Malpas_Oswestry&team=1",
        "3. Nc3": "Mind you I did out-grade him.",
        "3... d5": "So it starts with a Grünfeld Defence https://en.wikipedia.org/wiki/Gr%C3%BCnfeld_Defence",
        "4. cxd5": "He goes with the exchange variation. https://en.wikipedia.org/wiki/Gr%C3%BCnfeld_Defence#Exchange_Variation:_4.cxd5_Nxd5_5.e4",
        "4... Nxd5": "I take back.",
        "5. e4": "He attacks the knight.",
        "5... Nxc3": "I take.",
        "6. bxc3": "He takes back.",
        "6... Bg7": "I develop.",
        "7. Nf3": "In a similar position - after 1.\td4\tNf6\n2.\tc4\tg6\n3.\tNc3\td5\n4.\tcxd5\tNxd5\n5.\te4\tNxc3\n6.\tbxc3\tc5\n7.\tNf3\tIn his excellent book, \"The Road to Chess Mastery\" (1966) the former World Champion described this move as 7. Nf3(?) \"White attempts to defend the knight a third time. But at any time Black can nullify this defence by pinning the knight with ....Bg4. Therefore 7. Nf3 is not adequate. White should have played 7. Bc4 followed by 8. Ne2.\" That was an accurate assessment of chess theory at the time. However in the 1980s an alternative method of development was found, making 7. Nf3 playable after all. Bill Hartston's 1970 book \"The Grünfeld Defence\" also makes no reference to this move.",
        "7... O-O": "I just carry on developing.",
        "8. Rb1": "This is part of the new system. By attacking b7 white makes it harder for black to play Bc8-g4. White also prepares to advance his d pawn without having to worry about ....Bg7xc3 followed by .....Bc3xRa1.",
        "8... c5": "I carry on with the usual development moves.",
        "9. Be2": "As does he. I did pause here. Here there is a very reasonable alternative to what I played - that is the usual exchange of pawns on d4 followed by throwing a queen check on a5. After cxd4 10. cxd4 Qa5+ the pawn sacrifice 11. Bd2, giving up the a2 pawn, scores well for white - but may be playable.",
        "9... Nc6": "But instead I play this, inviting a different pawn sacrifice.",
        "10. d5": "Which is this! I see now on the opening databases that usual is to decline the pawn with 10....Ne5, but I had it in my mind that the best line was to take the pawn and then give it straight back.",
        "10... Bxc3+": "So I took.",
        "11. Bd2": "He blocked.",
        "11... Bxd2+": "I took.",
        "12. Qxd2": "He took back.",
        "12... Nd4": "And I offer the pawn back. I see now on the opening databases that 12....Na5 is more common.",
        "13. Nxd4": "He takes.",
        "13... cxd4": "I take back.",
        "14. O-O": "This was the first real surprise, and the first time I stopped for a decent think.",
        "14... e5": "I try to hang onto the pawn on d5. I found out afterwards that this has all been played before. In Blackburn, Jonathan LB (2162) vs. Guy, David T (2051) white won following e5\n15.\tdxe6 e.p.\tfxe6\n16.\tf4\tb6\n17.\tBc4\tQd6\n18.\te5\tQd7\n19.\tRbd1\tBb7\n20.\tQxd4\tQc6\n21.\tRf2\tRad8\n22.\tQxd8\tRxd8\n23.\tRxd8+\tKg7\n24.\tBb3\tQe4\n25.\tRd1\tBd5\n26.\tBxd5\texd5\n27.\tRfd2\tg5\n28.\tfxg5\tQxe5\n29.\tRxd5\tQe3+\n30.\tKh1\ta5\n31.\tR5d3\tQf2\n32.\tRd7+\tKg6\n33.\tR1d6+\tKh5\n34.\tRxh7+\tKg4\n35.\th3+\tKxg5\n36.\th4+\tKg4\n37.\tRg6+\tMy opponent tries another way, which I think is inferior. I wasn't sure what I would do after 15.\tdxe6 e.p. maybe take back with the bishop and give up the b7 pawn. Either way I wasn't happy with my position.\n ",
        "15. f4": "He tries to undermine my pawns in this way.",
        "15... f6": "But I can just protect like this. I was very happy with my position now. I thought I was just a clear pawn up.",
        "16. Rb3": "He goes for the big king-side attack which works in some variations of the Grünfeld Defence but in this case black is secure there. I think he would have been better advised to try and grab the c file before I complete my development.",
        "16... Qd6": "Firmly blockading the passed d pawn and also threatening .......e5xf4 in some variations.",
        "17. h3": "I think he wants to swing his rook over from b3 to f3 without having to worry about ....Bg4 but this is too slow. Besides, 17. Rf3 Bg4 can be met with 18. f4xe5 and black has to recapture with the queen and the black d4 pawn is not looking so secure.",
        "17... b6": "preparing to develop the Bc8.",
        "18. Rbf3": "He carries out his plan.",
        "18... Bd7": "I like this move, keeping an eye on the king-side with the bishop and maybe going to a4 in some variations. Fritz prefers Bb7.",
        "19. Bc4": "Maybe hoping for a discovered check with d5-d6 sometime?",
        "19... Kg7": "Stopping that, and also stopping the white queen from coming to h6.",
        "20. Qf2": "Trebling on the f file!",
        "20... b5": "Putting the question to the bishop.",
        "21. Bd3": "Bishop drops back.",
        "21... Rac8": "I start to take control of the c file.",
        "22. Qh4": "He is still dreaming of something on the king-side.",
        "22... b4": "Making sure his a2 pawn cannot advance.",
        "23. Rg3 Rc3": "My rook comes in.",
        "24. Rff3": "He gives his bishop more support.",
        "24... Rfc8": "My other rook swings over.",
        "25. Qh5": "This is a blunder in an inferior position.",
        "25... Rc3c1+": "Black has an overwhelming advantage now.",
        "26. Kh2": "Best, but the position remains hopeless.",
        "26... exf4": "Ooch!",
        "27. e5": "One last desperate effort.",
        "27... fxg3+": "I take with check.",
        "28. Rxg3": "He takes back.",
        "28... fxe5": "I take back. After a think he realised it is lost and resigned. Many thanks for reading. Please rate the annotation on the star system and leave a message or two to let me know how I am doing. Until next time dear reader!"
    },
    "url": "https://gameknot.com/annotation.pl/malpas-oswestry-1-v-wallasey-1?gm=65444",
    "gameName": "Malpas & Oswestry 1 v Wallasey 1",
    "players": "Greg Hughes (ECF159) vs. Charles L Higgie (ECF173)",
    "opening": "Gruenfeld (D85), modern exchange variation"
}