{
    "moves": {
        "1. e4 c5": "The Sicilian Defense.  Black is looking to create an unbalanced position from his first move.",
        "2. c3": "This is a different take on the Sicilian than normal.  White looks to play 3. d4 and have a two-pawn center (pawns on d4 and e4).",
        "2... d5 3. exd5 Qxd5": "A center-counter-like line to draw the black queen to the center of the board.  White, however, cannot effectively drive the queen away, as Nc3 is prevented by a white pawn occupying that square.",
        "4. d4": "May open a discovered attack on the black queen by dxc5.",
        "4... Nf6 5. Nf3 Bg4": "Pins the knight on f3 to the queen.",
        "6. Be2": "Removes the pin and allows for a discovered attack on the bishop.",
        "6... e6 7. h3": "Attempts to drive the bishop off of g4.",
        "7... Bh5": "Moves to safety while keeping what control he has over the d1-h5 diagonal.",
        "8. O-O Nc6 9. Be3 cxd4 10. cxd4": "All moves that precede this as well as this are book moves: the Sicilian Defense / Alapin Variation (B20).  It seems that this opening starts both sides' attacks geared toward the kingside.  (Book source: Chessmaster XI)",
        "10... Bb4": "Out of book (book source: Chessmaster XI).  This move looks to control space deep in white's camp; however, white can play 11. a3 to drive that bishop off the square.  Chessmaster's annotation suggests Be7, simply opening up for the kingside castle (which this move does), and leading to 11. Nc3 Qd6.  Personally, I would play Bd6, challenging some of white's kingside control.\nOne other thing that this move does: it forces Deep Blue to begin calculations, as it is not in the computer's opening book.",
        "11. a3": "Now Kasparov finds himself on defense.",
        "11... Ba5": "Again, black continues to contest squares deep in the white camp.",
        "12. Nc3 Qd6 13. Nb5 Qe7 14. Ne5": "Now the two white knights are advancing on black too.",
        "14... Bxe2 15. Qxe2 O-O 16. Rac1 Rac8": "Both sides are looking to take control of the open c-file.",
        "17. Bg5 Bb6 18. Bxf6 gxf6": "White is out of bishops but has his knights advanced.",
        "19. Nc4 Rfd8": "Black looks to control the d-file as well as the c-file.",
        "20. Nxb6 axb6 21. Rfd1": "The competitors are after 3 files: the c-, d-, and e-files.  White controls more territory on these three files, so he has the edge.",
        "21... f5 22. Qe3 Qf6": "Concedes the e-file but stares intimidatingly at the d4 pawn.",
        "23. d5": "White gets the pawn out of the queen's and knight's lines of sight.  exd5 here would be a big mistake.",
        "23... Rxd5 24. Rxd5 exd5": "Black wins the pawn and a rook for a rook, and a passed pawn on d5; however, now the white queen can move all over the e-file.",
        "25. b3 Kh8": "Moves the king back in order to make it seem less exposed.  Opens a new line on the g-file for black's rook.",
        "26. Qxb6 Rg8 27. Qc5": "Putting a chokehold on the c-file.",
        "27... d4": "Pushing the passed pawn, but it still looks doomed.",
        "28. Nd6 f4 29. Nxb7": "A move that would often be overlooked in favor of more offensive moves.  This demonstrates the big difference in the way humans and computers think.  Humans typically evaluate moves that fit in with their overall strategy and current plan, while computers evaluate all moves.  Deep Blue \"sees\" that Kasparov is attacking but really does not care because there is no real threat.  Many humans would see black's attack and think that they were in deep s***.",
        "29... Ne5": "Keeps pushing his pieces toward the kingside in order to continue the attack.",
        "30. Qd5 f3": "Exploits the pin on the pawn on g2.",
        "31. g3": "Halts the pawn advance.",
        "31... Nd3 32. Rc7": "Right to the seventh rank, and now black is in some trouble.",
        "32... Re8": "There's an attack, but the silicon monster that is Deep Blue calculates that this is a less-than-legitimate threat.",
        "33. Nd6 Re1+ 34. Kh2": "Forced.  Now the white king is trapped; however, black's king is wide open.",
        "34... Nxf2": "Threatens Rh1 and mate.  But white will exploit the open position of black's king to render this threat moot.",
        "35. Nxf7+ Kg7": "\"Also futile is 35...Qxf7 36. Qd8+ Kg7 (or 36...Re8 37. Qxd4+) 37. Rxf7+ Kxf7 38. Qd5+ Kg6 39. Qxf3 d3 40. Qxf2 Re2 41. Kg2\" (Chessmaster).  And the harassment of black's king begins.  Black has run out of good moves.  Out of three legal moves, all of them lead to continued harassment of the king and an eventual removal of the mate threat.",
        "36. Ng5+ Kh6 37. Rxh7+": "Kasparov has two options here: move the king to g6 or raise the proverbial white flag.  He chooses the latter.\nKasparov describes chess as \"a fight of two intellects, two egos, two wills.\"  He informs us \"[W]hen playing a computer suddenly you don’t have an opponent, you have an operator in front of you who just moves the pieces. It’s a kind of wall, you know. It’s a face, but the person represents virtually nothing to you.\"\nThis game's impact on chess is undeniable; we have seen that computers can play sound chess.  They do not play like humans, but we can gain new insight on chess by examining the calculations that computers make.\nI believe that, no matter how strong computers get, humans will not be far behind them for this reason."
    },
    "url": "https://gameknot.com/annotation.pl/man-vs-machine-part-1-kasparov-vs-deep-blue-game-1-1996?gm=24814",
    "gameName": "\"Man vs. Machine\" Part 1 -- Kasparov vs. Deep Blue, Game 1, 1996",
    "players": "Deep Blue  vs. Garry Kasparov ",
    "opening": "Sicilian (B22), Alapin's variation (2.c3)"
}