{
    "moves": {
        "1. e4 d6 2. d4 a6 3. Nf3 Nh6 4. Nc3 Be6 5. Be3 Bh3": "This is where I realized we were a little unmatched...",
        "6. gxh3 f6 7. Bd3 g6 8. Qd2 Rg8 9. Bxh6 a5": "6 points up, and then my momentum starts to slow. There is never any danger of losing the game for white, but for some reason finding holes is harder than I feel it should be...considering my opponent seems to be moving without rhyme or reason...",
        "10. Bf4 Nd7 11. Rg1 Rb8 12. h4 Rh8 13. Bb5 h5 14. d5 g5 15. hxg5 a4 16. Nxa4 f5 17. exf5 b6 18. g6 Ra8 19. Ng5 Ra5 20. f6": "This is actually a bad move, but I make it with the knowledge that my opponent will make a move at random, and not just take my completely undefended pawn. This is a very attractive checkmate in 1 for me. I've never checkmated anybody with just a pawn...I don't think.",
        "20... Qb8": "The queen seems to randomly slide to the side. Or maybe it saw the checkmate coming, and made a slightly comprehensible move...no telling.",
        "21. g7 Rh6 22. Ne6": "If it were a real game I would snatch the rook, but this game is taking too long, and I'm starting to feel embarrassed, so I go for the mate. None of this would ever work against a real opponent. By playing against the monkey program I am anti-learning.",
        "22... c5 23. g8=Q Rh8": "Another seemingly comprehensible move. Chasing my queen. I think it's just a coincidence, though.",
        "24. Qg6#": "I win. I can't even say gg. However, I don't think this \"monkey\" level program is completely useless. I think it would make for a satisfying game for a complete beginner who is just learning how the pieces move. In my opinion it would be exactly the right level of non-frustration level. The kids have a guaranteed win, pretty much. I'm going to try it with my students later."
    },
    "url": "https://gameknot.com/annotation.pl/man-v-monkey-game-i?gm=21981",
    "gameName": "MAN V. MONKEY GAME I",
    "players": "Man (Herc) (1250-ish) vs. Monkey (CM lowest lvl.) (3.5?)",
    "opening": "Pirc defence (B07)"
}