{
    "moves": {
        "1. e4": "King's Pawn game. The most popular, although not most successful, opening for white.",
        "1... d6": "Pirc Defense.",
        "2. Bc4": "I admit I was expecting d4, Nf3 or even Nc3 here since the LSB often belongs on e2 in the lines I know. Aside from that, a natural development move that also pressures the weak f7 square, which, as you'll see ahead, the Android intends to exploit.",
        "2... Nf6": "Attacking the e4 pawn and continuing with my castling kingside agenda.",
        "3. Nc3": "Defending e4.",
        "3... g6": "Again,in the Pirc Black intends to castle kingside and control the center from the flanks.",
        "4. h3": "A quiet, but not uncommon, move that intends to prevent Black from exchanging it's passive LSB on c8 with the quite active White knight that'll sit on f3. Although it fulfills White's purpose in development, this move will prove to be quite critical in White's future demise.",
        "4... Bg7": "Natural development.",
        "5. d4": "d4 finally.",
        "5... O-O": "Castled at last. Now I can proceed to try and undermine White's central control.",
        "6. Nf3": "White prepares to castle too.",
        "6... c5": "Striking the center from the flanks. e5 is also commonly played, but  prefer to let my DSB have clear view of the a1-h8 great diagonal.",
        "7. dxc5": "Most would go for d5 and scramble the center even more for a while, but there's nothing wrong with exchanging.",
        "7... Qa5": "Everything quite standard so far.",
        "8. Ng5": "Now, this move I find quite annoying even though its alright for Black. Guess I just grew tired of the old bishop and knight eyeing on f7 cliche.",
        "8... Qxc5": "Recapturing on c5. If White wants to exchange his most active pieces for my king's stationary defenses, so be it.",
        "9. Bxf7+": "Here it comes.",
        "9... Rxf7": "I proceed with the trade.",
        "10. Nxf7": "No going back. White must take the Rook or lose the exchange.",
        "10... Kxf7": "It's common sense that, in a simple kingside castle position (a.k.a.- non fianchettoed castle), exchanging White's most active knight and bishop for the f7 pawn and the still innactive f8 rook is suboptimal. After all,  piece activity plays a big role in any strong position. But, since Black's kingside pawn structure is already slightly weakened by the fianchettoed Bishop, this move is alright since it weakens it even more and removes two main defenders.  From now on I must make sure all my minor pieces are active to make up for my lost rook and slightly exposed king.",
        "11. O-O": "Taking his king to safety after bringing mine closer to the center.",
        "11... Nc6": "Piece activity must be the name of the game for Black from now on.",
        "12. a3": "I don't think this was the most optimal move here, but maybe White intends to prepare for a future queenside push while protecting b4 from being used as outposts for Black's queen or knight.",
        "12... Be6": "Again, piece activity. I decide to bring my LSB to e6 and guard the a2-g8 diagonal that leads straight to the king. Also, this is a way more active spot for the bishop than d7 and allows the rook to come later to c8 or f8 if need be.",
        "13. Be3": "Developing with tempo and kicking the Black queen from the queenside (Qc4 is viable but quite useless in my opinion).",
        "13... Qh5": "I decide to offer a trade, since exchanging queens would mean that my slightly exposed king would start to look less vulnerable and more active once once the endgame arrives.",
        "14. Qd3": "White declines the trade and instead tries to bring his own queen into action. At this point I start to have ideas about how to start attacking White.",
        "14... Ne5": "I bring my knight closer to where action seems to be and force the White queen to move.",
        "15. Qb5": "Computers love to attack weak spots, and the Android is no exception. I start to regret having placed all my pieces on the kingside, but then i see...",
        "15... Bxh3": "Not really a sacrifice since 16. gxh3 Qxh3 17. f3 Qg3+ 18. Kh1 Nxf3 19. Rxf3 Qxf3+ regains the bishop and a lot more.",
        "16. Qxb7": "White decides to attack back. But all it does is seal the White king's fate. Instead, f3 should have been played. Now I have a bigger fish to catch and no time to waste worrying about the a8 rook. From here I have mate in 5.",
        "16... Qg4": "The bishop offer is overdue and now its too late to capture. White must defend, but all its attempts are feeble from this point forward.",
        "17. Qb3+": "A time gaining move. It doesn't do anything against my attack besides wasting time.",
        "17... Kf8": "Any other move would allow White to keep putting my king in check and make me waste even more moves in the future.",
        "18. g3": "Closing one hole and opening another...",
        "18... Qf3": "White has DOOM spelled all over its position and there's no escaping from it.",
        "19. Qb8+": "Again, wasting my time since this Android is not programmed to resign like a more poweerful engine.",
        "19... Rxb8": "Not much else to do other than finally putting a stop to the annoying White queen.",
        "20. Bxa7": "Nothing productive to do here, so why not snatch a last pawn?\n",
        "20... Qg2#": "Case closed in a round 20 moves. Hope you have enjoyed."
    },
    "url": "https://gameknot.com/annotation.pl/man-vs-machine?gm=55745",
    "gameName": "Man vs. Machine",
    "players": "Android (12)  vs. idc1702 ",
    "opening": "Pirc defence (B07)"
}