{
    "moves": {
        "1. Nc3 d5 2. Nf3 Bf5 3. e3 e6": "Pursuing my favourite scheme.",
        "4. d3": "Going slowly. ",
        "4... c5": "which allows me to play this more confortably. ",
        "5. e4": "Interesting and new. ",
        "5... dxe4": "d4 was possible, but you have to calculate a lot. ",
        "6. dxe4": "Interestingly, white allows the queen's exchange keeping his knight. ",
        "6... Qxd1+ 7. Kxd1 Bg4": "I threat BxN and then Nc6, Nd4 (once prepared). ",
        "8. Be2 Nc6 9. h3": "Bh5, then Bg6 was possible. ",
        "9... Bxf3": "But this will surprise him. ",
        "10. Bxf3 O-O-O+ 11. Bd2 Nd4": "Black is more confortable already, but the queenside is undeveloped. ",
        "12. Be2 Nxe2": "The knight is doing well, but a bishop's pair is a bishop's pair. It was calculated that it would have been tough for white to preserve the pair. ",
        "13. Kxe2": "Actually, this helps white. ",
        "13... Bd6": "Better to develop the knight in e2 (avoiding the pin), but better to get developed the bishop first. ",
        "14. Rad1 Ne7 15. Nb5": "Foreseen. ",
        "15... Bb8": "This knight will be my nightmare, but by kicking it I will expand. ",
        "16. Bc3 f6 17. Ba5 b6 18. Bc3 a6": "No problem in opening the king's position. White is in no position to attack effectively. ",
        "19. Na3": "b5 comes to mind, but it is premature. Ba5, Rd2...",
        "19... Nc6": "This is to cover a5. ",
        "20. Nc4": "Threats b6.",
        "20... Kb7": "My King is playing as a piece more...",
        "21. a3 Nd4+": "I calculated this will force white to exchange the bishop. ",
        "22. Bxd4 cxd4": "Black has the initiative, here, and a potential strong pawn's chain, at the cost of the inactivity of his dsb. ",
        "23. g3 b5 24. Na5+": "You're welcome, my dear...",
        "24... Kb6 25. Nb3 e5": "Not Be5, f4. ",
        "26. h4 Rdc8": "Also possible was to double rooks on the d file and try to push the pawn. ",
        "27. Rd2 a5": "Taking space. ",
        "28. Rhd1 a4 29. Nc1": "This was good. The knight can go to d3, as in fact it does. ",
        "29... Ba7": "I have to manage my bishop to \"do something\". From here, he x-rays f2 if ever d3 is to be played. ",
        "30. Nd3": "Hm. Nothing can prevent the white knight to go to b4 ans d5. A pity. ",
        "30... Rc7 31. Nb4 Ka5": "To make effective the x-ray over f2. ",
        "32. Nd5 Rc6": "I cannot play Rh-c8 now, I have to be patient. ",
        "33. Nb4 Rc4": "...or draw!",
        "34. b3": "At last a brake in white's position. ",
        "34... axb3 35. cxb3 Rc3 36. Rb2 Rhc8": "Accomplished! Thank you white! Pushing d3 is still out of question. ",
        "37. Rd3 Rc3c1": "What can a rook here can do? You'll see. ",
        "38. Nd5 Ra1": "I think white didn't think about this move. ",
        "39. b4+ Ka4": "Very, very dangerous. I bet on my calculations. ",
        "40. Rbb3 Rc2+ 41. Kf3 Raa2": "And white resigned. It was impossible not to lose more pawns, for a slow but lost endgame. Thank you for reading. "
    },
    "url": "https://gameknot.com/annotation.pl/manouvering?gm=49232",
    "gameName": "manouvering",
    "players": "about 1650  vs. damalfi ",
    "opening": "Dunst (Sleipner, Heinrichsen) opening (A00)"
}