{
    "moves": {
        "1. d4 Nf6 2. Nc3 e5": "Let's try the Budapest that way. In theory, it will work all the same :-)",
        "3. Nf3": "He doesn't fall for it, and I had to think. ",
        "3... e4": "Let's try this one. His horse will jump a little while I am developing. ",
        "4. Ng5 d5": "Nice counter-center, isn't it?",
        "5. e3": "I don't like to block my own bishop that way, even if I know that it's playable. ",
        "5... h6 6. Nh3": "Ok, now I can make two pawns isolated on the h column, but... is that \"intelligent\"? Is that \"nice\"? or \"fun\"?",
        "6... a6": "The knight is not blocked, but he will jump to a very weak position on f4, regardless of the pressure that he will make over d4. ",
        "7. Nf4 c6": "This move is possible because the white's dsb is trapped. ",
        "8. g3": "But MINE isn't!",
        "8... Bg4": "Probably this was not the proper way to take advantage of the white squares' white weakness. ",
        "9. Be2": "...because of this. ",
        "9... h5": "Well: try to act as if everything was part of a plan. ",
        "10. Bxg4": "He falls for it (h3 would have been better: I had to exchange, and after that he is more developed that me (even if white's position is not particularly good). ",
        "10... hxg4": "Nxg5, h3 and my knight has to retreat. This way, I condemn my knight \"forever\" to guard g4, but it blocks white's developement if not handled properly. ",
        "11. O-O": "Castling into the danger. But, on the other side, I am very tangled and my queen cannot reach h8 - otherwise, Rxh2 was in sight. ",
        "11... g5 12. Ng2": "This knight had a lot of moves, and it is not in a good square - given the e6 square is occupied by a pawn. ",
        "12... Bd6": "Making sure white cannot even think about f3. ",
        "13. Kh1 Kd7": "Now, I know that I am blocking my own knight's developement square, but I \"had\" to make more pressure, and the king in e2 prevented the queen to reach f6, if needed. It was a wrong line, because black' queen strenght will be felt from c7. ",
        "14. h4": "Thank you white. ",
        "14... gxh3 e.p.": "this blocks the column for my rook, but I sweared I could make the most of a Bxg2 sac. I was wrong.",
        "15. Ne1": "Note white pieces are horribly tangled, unable to move. ",
        "15... Qc7": "Now, looking at Bxg3, after Qxg3, I have no straight win!!! What will I do? Was it wise to push the pawn to h2? On the other hand, my knights cannot join the fry to give some unbalancing move. ",
        "16. Kh2": "Oh, well...",
        "16... Nh5": "Nxg3 now \"must\" work. I was wrong again!",
        "17. Ne2": "Ok. White is inmovilized. But there is no zugzwang in sight (the queenside is still mobile). And what can I do more for attack?",
        "17... f5 18. c3": "I'm not worried, still. ",
        "18... a5": "This is to free the knigh and allow the other rook to support the attack. Of course not g4 - Kxh3 and I will win easily with Nxg3+. ",
        "19. a3 Na6 20. Rb1": "White is planning a queenside attack, but I'm not worried, still. ",
        "20... Nxg3": "?? I intended to play f4, and break the pawn's barrier with the other rook at one move. But I don't know why, I played this sacrifice, that throws the game for black (yes, me...)",
        "21. fxg3 f4": "Too late. But let's play as if it was a plan.",
        "22. gxf4 gxf4 23. Nxf4": "My counter is: whatever piece retaked there, is pinned. Now, it's the other rook's turn. ",
        "23... Rag8": "Here! If in f8 (I must not take the piece in f4, for any reason!), Qg4+!",
        "24. Bd2": "Untangling himself, but far away from it. ",
        "24... Qd8": "The queen can penetrate in g3. Maybe. ",
        "25. Qe2": "Ok, not so easy. ",
        "25... Bxf4+": "?? No, the bishop (and NOT THE QUEEN) should go to g3. I don't know why I played this, really!",
        "26. Rxf4 Qg5": "At least some pressure... Rf7+ is not a problem.",
        "27. Qf2": "After Rf7+, Kc8... what? ",
        "27... Nc7": "Now I need all my pieces, because despite the pawn I cannot see the way to win. ",
        "28. Rf7+ Kc8": "Mistake. Kd8 would have avoided...",
        "29. Qf5+": "Ouch! Exchanging queens and then slowly death. ",
        "29... Qxf5 30. Rxf5 Ne6 31. b4": "Ok, I have to make something of my pawn, so...",
        "31... Ng5 32. bxa5 Nf3+": "The defending knight of e1 is dead (unless RxN). Otherwise, Rg1#.",
        "33. Nxf3 Rg2+": "Not allowing him to take the pawn. I liked to have seen it. ",
        "34. Kh1 exf3": "Now, it's the pawn or the bishop. ",
        "35. Be1": "Of course the pawn. Now...",
        "35... h2": "Naive mate threat, but... the bishop is lost. I could have pursued the a pawn, (or e, or c) but being under as I was, the pawns are not worrying me...\nWhen I am trapped in such a way (and I do), I'm normally very annoyed. I felt sorry for white. I didn't calculated it (I wish I could have done it in a blitz). It came \"alone\". With a little help from my side. ",
        "36. Bf2": "Now, with Bh4, if I go RxB, white's rook take their revenge on b7. ",
        "36... Rxf2 37. Rf7": "They want to do it anyway. It's a tempo thing, now. ",
        "37... Rg8": "If he taked in b7, his rook will become vulnerable. ",
        "38. Rfxb7 Rg1+ 39. Rxg1 Kxb7": "Why lose a pawn? ;-)",
        "40. Rb1+ Ka6": "I can imagine how this will end: a rook agains a lot of joined pawns. This is not won at all. Of course, probably Kc7 would have beeb wiser. ",
        "41. Rb6+ Kxa5 42. Rxc6 Re2": "My pawn must pass. He will have to lose his rook to stopping me from queening. ",
        "43. Rc5+ Ka4 44. Rxd5 f2 45. Rf5 Re1+ 46. Kxh2 f1=Q 47. Rxf1 Rxf1": "Was this the best? The point is the \"residual advantage\" I have: the white king is unable to reach his pawns - otherwise I'm fried. ",
        "48. Kg2 Rf8 49. c4": "Now, my king has to do all the hard work. But he can. ",
        "49... Kxa3 50. c5 Kb4 51. c6 Kc4": "Normally, this is lost for black, but with a rook...",
        "52. c7 Kd5": "The story is another. White timed out, but the position was hopeless. Thank you for reading. "
    },
    "url": "https://gameknot.com/annotation.pl/massive-cuasi-zugswang?gm=48690",
    "gameName": "Massive cuasi-zugswang :-)",
    "players": "nathaniel57  vs. damalfi ",
    "opening": "Queen's pawn game (A45)"
}