{
    "moves": {
        "1. d4 f5": "Morphy, disliking the positional QP game, counters with a Dutch defense.",
        "2. c4 e6 3. Nc3 Nf6 4. Bg5": "Harrwitz, his skills honed by thousands of games at the Cafe de la Regence, issues notice that he won't be pushed around.",
        "4... Be7 5. e3 O-O 6. Bd3 b6": "Morphy wants his B on the long diagonal, anticipating that Harrwitz will castle K-side.",
        "7. Nge2 Bb7 8. O-O": "You could argue a case of \"castling into it\", but Harrwitz wants to expand and attack on the Q-side.",
        "8... Nh5 9. Bxe7 Qxe7 10. Ng3 Nxg3": "Breaking up the Pawn barricade surrounding the King.",
        "11. hxg3 d6 12. f4": "To prevent a Pawn-storming attack on the weakened K-side.",
        "12... Nc6 13. g4 Nb4 14. gxf5": "Ridding himself of the doubled Pawn.",
        "14... exf5 15. Qd2 Rae8 16. Rae1": "Both men shift the heavy artillery to the K-side.",
        "16... Qh4": "Morphy presses forward, hoping to smash Harrwitz's defenses quickly.",
        "17. Bb1 Re6 18. Qf2": "Trying to break the attack by exchanging off the Queens.",
        "18... Qh5 19. d5 Rh6": "Doubling on the \"artificially\" open KR file, with mating threats.",
        "20. Qf3": "Creating a flight square.",
        "20... Qh4 21. a3 Na6 22. b4 Nb8 23. Ne2 Nd7": "Trying to augment the attack by bringing the Knight into play.",
        "24. Ng3 g6 25. Kf2": "Looking to escape the danger zone.",
        "25... Nf6 26. Rfh1 Ng4+ 27. Kg1 Qf6": "With this retreat, the attack is broken. Morphy will have to win in the end game.",
        "28. Rxh6 Nxh6 29. Qd1": "Morphy has a slight advantage with Harrwitz's KP backward and a flank majority on the K-wing.",
        "29... Ng4 30. Qd2 Qh4 31. Nf1": "Securely guarding the weak link.",
        "31... Re8 32. g3 Qh3 33. b5 Nf6 34. Qg2": "Eliminating the Queens, and ensuring a drawn-out battle.",
        "34... Qxg2+ 35. Kxg2 a6 36. a4 axb5 37. axb5": "Locking the Q-side in place.",
        "37... Ra8": "Morphy takes command of the only fully open file.",
        "38. Nd2 Ra3": "Inducing Harrwitz to jettison the backward KP in hopes of counterplay.",
        "39. e4 fxe4 40. Nxe4 Nxe4 41. Bxe4 Rc3 42. Bf3 Kf7": "Cutting off the Rook's entry squares at K7 and K8.",
        "43. Re4 Bc8 44. Be2 Bf5": "Finally activating this Bishop.",
        "45. Rd4 h5 46. Kf2 Kf6": "Morphy is looking to utilize his wing majority on the KN and KR files.",
        "47. Rd2 Bc2 48. Ke1": "Harrwitz's pieces are locked in a defensive crouch.",
        "48... Be4 49. Kf2 Kf5 50. Ra2 h4 51. gxh4 Kxf4": "Morphy charges forward, trying to constrict Harrwitz's pieces.",
        "52. Ra7": "An overaggressive bid for freedom. Harrwitz's Rook was necessary for defense.",
        "52... Rh3": "Threatening to create a dangerous passed Pawn with ... RxP.",
        "53. Rxc7 Rh2+ 54. Ke1 Ke3": "Harrwitz resigns. If he doen't move the Bishop, he loses the piece: if he moves the B out of danger, R-R8 mates him."
    },
    "url": "https://gameknot.com/annotation.pl/match-game-paris-1858?gm=36423",
    "gameName": "Match Game, Paris 1858",
    "players": "Daniel Harrwitz  vs. Paul Morphy ",
    "opening": "Dutch defence, Rubinstein variation (A84)"
}