{
    "moves": {
        "1. e4": "Hi everyone!\r\n\r\nNow finally here is Part 4.  I thought that this time I would round it off with a game against two masters just to prove a point that in general 2 pieces are certainly better than a rook.  We see Master Freddy in action again.  In fact, Freddy's opponent is a IM so a tough game in store for Freddy.  After white played 1. e4 Freddy starts off with another fav opening of his with the blacks - the Alekhine's Defense.  This move is Nf6.",
        "1... Nf6 2. e5 Nd5 3. d4": "3. d4 - standard pawn thrusts.",
        "3... d6 4. c4": "4. c4 - Freddy's knight must move.  He chooses b6.",
        "4... Nb6 5. f4": "5. f4 - those white pawns just keep on rolling!",
        "5... dxe5 6. fxe5": "6. fxe5 - pawn trade.",
        "6... Nc6 7. Be3": "7. Be3 - development.",
        "7... Bf5 8. Nc3 e6": "8. ....... e6 - Freddy tries to keep up with his opponent in the development stakes, he opens up a line for his dsb.",
        "9. Nf3 Bg4": "9. ...... Bg4 - development and pin.",
        "10. Qd2 Bb4": "10. ........ Bb4 - and a pin the other side of the board.",
        "11. Be2 Na5 12. b3 Bxf3 13. Bxf3": "13. Bxf3 - B for N trade.",
        "13... Nbxc4 14. bxc4 Nxc4": "14. ..... Nxc4 - Hmm, Freddy has sacrificed a piece for 2 pawns, interesting.",
        "15. Qd3 Nxe5 16. Qb5+": "16. Qb5+ - not dxe5??  If white plays that then his queen drops on d3 with QXQ.",
        "16... Qd7 17. Kf2 Bxc3 18. Qxe5 Bxa1 19. Qxg7": "19. Qxg7 - white grabs the g7 pawn after his rook goes on a1.  As the rook on h8 is en prise there is nothing Freddy can do to avoid his dsb being taken.  Instead of 0-0-0 at once, could Freddy have played Bxd4 instead, grabbing a white pawn as the rook on h8 would have been covered by just one more move.",
        "19... O-O-O 20. Rxa1 f5 21. Qxd7+ Rxd7": "21. ....... Rxd7 - queen trade.",
        "22. Kg3 Rd6 23. Rb1 Rb6 24. Rb3 Rxb3 25. axb3": "25. axb3 - rook trade.",
        "25... Rd8 26. Kf4": "26. Kf4 - white's king centralises himself for the endgame.",
        "26... Rd6 27. d5 exd5 28. Ke5": "28. Ke5 - surprise, white does not take the f5 pawn, I wonder why?",
        "28... f4 29. Bxf4": "29. Bxf4 - the pawn drops now though.",
        "29... d4 30. Be4 d3": "30. ....... d3 - Freddy tries to promote his passer on the d file but it is easily stopped.",
        "31. Bd2 h5 32. Kf4 c5 33. Ke3 Rb6 34. Bd5": "34. Bd5 - backing up his b3 pawn.",
        "34... Rd6 35. Bc4": "35. Bc4 - oh dear, it looks as though Freddy's lovely passer is about to drop.",
        "35... Kd7 36. Bxd3": "36. Bxd3 - although material is even, Freddy has had enough.  It looks as though white's kingside pawn majority could be decisive here as Freddy's isolani on h5 could easily drop off allowing those white g and h pawns to crown.  So he resigns on the grounds of ruinous loss of material.  Commiserations and good effort against the IM, Freddy!\r\n\r\nJoanne"
    },
    "url": "https://gameknot.com/annotation.pl/material-imbalances-2-pieces-are-better-than-1-rook-pt-4?gm=24669",
    "gameName": "Material Imbalances - 2 pieces are better than 1 rook - Pt. 4",
    "players": "epicuro (2414) vs. easy19 (2227)",
    "opening": "Alekhine's defence (B03), four pawns attack, Tartakower variation"
}