{
    "moves": {
        "1. e4": "I am white in this gameknot mini-tournament. It shows how I didn't give up after losing a piece and ended up with a brilliant tactical attack.",
        "1... e5": "This move, and 1...c5 are the openings with the best reputations against e4. Still playable, but less common and slightly more passive are 1...e6 and 1...c6.",
        "2. Nf3": "The accurate move since I develop a piece while attacking a pawn.",
        "2... Nc6": "2...d6 is a more solid move, but it is also passive.",
        "3. Bb5": "I believe the best choices for White's 3rd move are 3.Bb5 or 3.d4. I don't think any other moves will give White a slight advantage.",
        "3... a6": "This is the main line of the Ruy Lopez.",
        "4. Ba4": "Main line.",
        "4... f6": "This is not the main line. Black does not develop anything, and cramps his position. I thought about the complicated sacrifice, Bxc6 dxc6 Nxe5 fxe5 Qh5 , but it is too risky and unsound. I should be able to get an advantage another way.",
        "5. d4": "Black's wasted tempo justifies me wanting to open up the centre.",
        "5... Bd6": "Black is obstructing his d-pawn and developing his bishop to an unimportant square,  while all my moves have been toward development.",
        "6. c3": "This move gives my bishop the c2 retreat square if it wants to give additional support to my e-pawn, while also giving me the option of recapturing with the pawn if Black plays exd4.",
        "6... Qe7 7. O-O b5 8. Bb3": "I don't want to go to c2 yet. I wanted to attack Black's weakened a2-g8 diagonal.",
        "8... Bb7": "Black's position is starting to recover, but mine is clearly more solid and better positioned.",
        "9. Re1 O-O-O": "Castling kingside would be hard to do because of my strong light bishop. But now I have a target on the queenside.",
        "10. a4 b4 11. a5": "Gaining space for my attack.",
        "11... g5": "Black wants to start an attack on the opposite side of the board. I love positions like that.",
        "12. Be3": "My bishop is X-raying toward Black's queenside castled king.",
        "12... Qg7": "Black is positioning his queen to attack my king now.",
        "13. d5": "Unleashing my bishop while gaining space with tempo.",
        "13... Nce7 14. c4": "Threatening to win a piece with c5.",
        "14... Ng6 15. c5 Bf8 16. Qd2": "This is where I blundered sadly. I am going to lose a piece next move, but since no pieces have been exchanged yet, there's still a lot of time left in the game for me to come back.",
        "16... g4": "Arrghhh!",
        "17. Ng5": "I thought this was the best way to give up the piece, but I think I may be wrong. Tell me if you see a better way.",
        "17... fxg5 18. Bxg5 Re8 19. Qxb4": "I have two pawns for the piece, and my huge queenside territory may overwhelm the black king later. I would say that I have enough compensation for my blundered piece, but I'm not a grandmaster.",
        "19... Be7 20. Be3": "It usually isn't good to trade when you're down material, unless your opponents piece is more important than yours. Black's bishop can't do much, while my bishop can become strong when I attack Black's king.",
        "20... Nf4 21. Qc4": "I am preparing to unblock the b-file and play b2-b4-b5, while also threatening the crushing c6!",
        "21... c6": "Blocks c6.",
        "22. Nc3 Nf6 23. d6": "Because of the cramped nature of this position, me being down a piece doesn't matter much. It's too early in the game for material to be of much importance.",
        "23... Bd8": "Better than Bf8, which would cramp his position even more.",
        "24. Ba4": "I'm trying to entice Black to play Bxa5, because I have (Bxc6 Bxc6 Rxa5) or (Bxc6 Bxc3 Bxb7 Kxb7 bxc3) which would both give me my pawn back, while further exposing Black's weak king position.",
        "24... h5": "I think it is harder for Black to complete a mating attack than it is for me since my king's position is more solid and not overextended.",
        "25. b4": "I plan to sacrifice a piece on b5 if I need to. I'll try any desperate sacrifice to exploit Black's weak king before he finishes his attack. I'm already down a piece and will try anything.",
        "25... Qg8 26. Qf1": "No I do not want to trade queens. Black wants the easy way out of a winning game, by mindlessly trading until the board is simple enough to exploit his material advantage. If you're good, you'll know that being up a piece this early in the game isn't winning yet. It is unclear since there are so many pieces on the board.",
        "26... Ne6 27. b5": "It's now or never. I plan to sacrifice my bishop to breakthrough to Black's king, while also giving me a strong a-pawn.",
        "27... Bxa5": "I forgot about my tactical trick earlier, and now it won't work. I considered resignation here, since I'm down a piece and my attack is dying, but I saw a brilliant win if Black falls for my trick.",
        "28. bxa6": "Here, Black's winning move is Ba8, and then he's up a piece and putting pressure on my e4-pawn and my c3-knight and my a5-e1 diagonal, but watch how Black's humorous blunder gave me a brilliant tactic.",
        "28... Bxc3": "YES!!!!!!! This is one of the few times in chess where my opponent has fallen for a trap that I deliberately set. Black sees that Ba8 Rec1 Bxc3 Rxc3 Nxe4 will leave him up a piece for a pawn, so he jumps at the chance to take a piece while forking my rooks, so that he'll end up with an extra rook once the smoke clears. But Black has underestimated my queenside attack tactics against his exposed king.",
        "29. axb7+": "Black should've just kept his extra piece and probably win, but his greediness for a rook has lost the game for him. Now there are a lot of winning lines for me. Obviously (Kd8 b8=Q#) and (Kd8 b8=R#) are ones, and (Kxb7 Reb1  Kc8 Qa6  Kd8 Rb8#) is a less obvious one, and (Kxb7 Reb1  Ka7 Bxc6  Bxa1 Rxa1  Kb8 Ra8#) is an even less obvious one. But what if Black plays Kb8?",
        "29... Kb8": "I gave out the obvious winning moves for me if Black had played Kd8 or Kxb7, but now my winning moves are less obvious, and Black thinks he's off the hook and can win a rook freely. But there is still an unobvious winning tactic against Kb8.",
        "30. Qa6": "Threatening Qa8#.",
        "30... Nc7": "This is the only move that stops Qa8#. Black probably expects me to take the piece, but that will only result in the end to my mating attack, and I'll end up down an exchange (my rook for his bishop). I have a much better move here that is more brilliant and wins immediately.",
        "31. Qa8+": "Anything's possible when you have tactics. All the next moves are forced.",
        "31... Nxa8 32. bxa8=Q+ Kxa8 33. Bxc6+": "33.Bxc6   Double Check!!",
        "33... Kb8 34. Ra8#": "Despite being down a queen, I have effectively finished my intended mating attack, because of Black's greedy rook fork. Black didn't even get a chance to take one of my rooks because of all my tactics. So this game shows not to worry about material in the opening phase of the game. Material is only important in the endgame where it is easier to exploit."
    },
    "url": "https://gameknot.com/annotation.pl/mathematics-nerds-iv?gm=3425",
    "gameName": "Mathematics Nerd's IV",
    "players": "bakerbaker (1646) vs. jeehosephat (1466)",
    "opening": "Ruy Lopez (C70)"
}