{
    "moves": {
        "1. e4 g6": "This normally leads to a Modern Defense or Pirc, but for the first time ever I decided to try a very rare opening: The Hippopotamus!",
        "2. d4 d6 3. Nf3 Bg7 4. Nc3 a6 5. Be3": "In my opinion 5. a4 is more correct to restrict Blacks expansion on the Queen side.",
        "5... Nd7 6. Bc4 e6 7. O-O h6 8. Qd2 Ne7": "Six pawns on the sixth row and Knights on e7 and d7 - a typical setup for the Hippo. The major headache for White is where to put his pieces and find a soft spot to attack.",
        "9. Rad1 b5 10. Bb3 Bb7 11. d5 e5": "Now the center is closed, and Black tries to move forward on the King side. This plan is probably too bold, and I have no idea of where to place the King. But those worries will have to wait until later.",
        "12. Ne1 f5 13. f3 f4 14. Bf2 g5": "Agreed, the Bishop on g7 looks horrible now, but nevertheless it will decide them game in the end!",
        "15. Nd3 Nf6 16. a3 Qd7 17. Nb4": "Seems like a waste of time, but it also softens up the Black Queen side so castling long will be out of the question.",
        "17... a5 18. Nd3 h5 19. Qe2 Ng6": "From a passive position now both Knights are ready for the attack.",
        "20. a4 b4 21. Nb5 Ba6 22. Bc4 g4 23. b3 gxf3 24. Qxf3 h4 25. h3": "A good move effectively stopping the Black pawn-roller. ",
        "25... Kf7 26. Nc5": "Ouch! This is the kind of moves that make you fall out of your seat. It is a very strong sacrifice, giving White a dangerous attack and a d-pawn close to the queening square. From now on Black will have to defend all he can.",
        "26... dxc5 27. d6+ Kf8 28. Bxc5 c6 29. Nc7 Bxc4 30. Nxa8 Bxf1 31. Nb6 Qd8 32. Qxf1": "But this must be wrong. Blacks pieces are totally out of coordination, and simply 32. Kxf1 will keep the heat on Blacks King. Now not only does White loose the important pawn on e4, but Black also gets rid of the annoying Bishop on c5 with good chances of saving himself.",
        "32... Nxe4 33. Qc4 Nxc5 34. Qxc5 f3": "As Napoleon said: The best defense is to go into the offensive! Black wants to open up the fort of the White King.",
        "35. Qxc6 fxg2 36. Kxg2": "I think White should have just left the pawn on g2, where it was working as a shelter and instead have tried his luck with promoting the d-pawn. Now the tide turns dramatically.",
        "36... Qg5+ 37. Kf2 Qg3+ 38. Ke2": "Obviously the White King seeks shelter on the Queen side, but with a combinative attack from Blacks Queen, Knight and Bishop, it is doomed even there.",
        "38... Nf4+ 39. Kd2 Qf2+ 40. Kc1 Ne2+ 41. Kb1 Nc3+ 42. Kc1 Bh6+ 43. Kb2 Nxd1+ 44. Kb1 Nc3+ 45. Kb2 Bc1+": "A strong resource. If King takes Bishop there is a mate on b1 in a few moves.",
        "46. Ka1 Qe1 47. Qc8+": "The only hope for White is finding a perpetual check, but actually there is a forced mate in 10 from this position (you are welcome to play it through!). Instead White chooses the shortcut to defeat.",
        "47... Kg7 48. Qg4+ Bg5+": "The lousy Bishop blocks the check with a counter check from the Queen on e1 and thereby becomes the hero of the day! It is mate in two, so White resigned. What a mess of a game, but that is also what makes chess such a funny game to play. I still think the Knight sac. on move 26 was a terrific practical chance for White to win the game, but miraculously the hippopotamus stayed above the water line."
    },
    "url": "https://gameknot.com/annotation.pl/matslochs-mini-tournament?gm=25421",
    "gameName": "matsloch's mini-tournament",
    "players": "mmuru (1455) vs. ybrevo (1834)",
    "opening": "Norwegian defence (B06)"
}