{
    "moves": {
        "1. e4 c5 2. Nf3 Nc6": "Sicilian opening",
        "3. Bb5": "Nimzovich-Rossolimo attack (without d6)",
        "3... a6 4. Bxc6 bxc6 5. d3 d5 6. O-O Bg4 7. Nbd2 Nf6": "So far standard",
        "8. e5": "Pawn's crucial - they can not go back. So the white will need to put extra attention to this pawn.",
        "8... Nd7 9. Qe1 e6 10. Qe3 Bxf3 11. Nxf3 Qc7": "It is obvious now that the black pawns are dominant in the center of the board and that the white pawn on e5 is more difficulty for the white than for the black.",
        "12. Re1 Be7 13. d4": "That won't do it. The only way to support the e5 pawn is from f4.",
        "13... cxd4 14. Qxd4 c5": "Now it becomes obvious - the black pawns on d4 and c4 control the center.",
        "15. Qg4 g6 16. Bg5 Bf8": "Not Bxg5 - it will give the white strong attack in the King's wing. ",
        "17. Qf4 Bg7": "The weakest point in the black's position is the pawn on f7 - so I have to pay the price of not playing f6 much earlier in the game; unfortunately that maneuver became impossible. ",
        "18. Bh6 O-O": "Again not Bxh6 - the same reason as before. After Qxh6 and Kg5 the white has huge advantage.",
        "19. Bxg7 Kxg7 20. h4": "Although it seems bad for the black the white has nothing on the King's side attack. - Why? - you will see.",
        "20... h5 21. Qg5 Rfh8": "The only way to defend g4 - well no but I was still not in the mood to take the queen in defense. Yet Qd1 would have been better solution.",
        "22. b3 a5 23. Rad1": "Due to the position of the e5 pawn the white has just limited range moves. He has to defend it with two figures - one is the queen but the other is either the knight or the rook. The black control of the center and the white pawns position does not allow the knight to get to any better square and the rook can not come to the third row in order to assist the white's attack and with the neutralization of the g4 possibility the white's King side attack came to a stop.",
        "23... a4": "So now its time for the black to open the Queens side. Actually this is why I wanted the queen in the attacking position and not in the defending - I will have to admit that I was wrong.",
        "24. c4 d4": "As said before the opening should be in the Queen's side - not the middle. dxc4 opens the game for the white and places the black in not so good position. Furthermore the black d-pawn has open way to promotion.",
        "25. Nd2": "The previous move have just made a possibility of coordinated attack of the Queen, the Rook and the Knight - but will there be time?",
        "25... Qd8": "Admitting the mistake - better late than never. The queen will defend the King and control the center and the rook will go to the Queen's side attack.",
        "26. Qf4 Qe7 27. Ne4 Rhb8": "Instead using three pieces to guard the crucial weak black squares (f7, f6 and c5) it is done with only the knight and the queen. So it is time to see what can be done on the Queen's side.",
        "28. Rd3 axb3 29. axb3 Ra3 30. Rb1": "The only way for the white defend - it defends the weak b3 pawn with the rooks, it stops the d-pawn advancement with the rook and holds the knight and queen back with the knight and queen attack. \n\nAlso now it has the possibility for the attack on the King's side - but...",
        "30... Rba8": "The only way for the black is to penetrate into the white's \"ranks\". The rook on the first row is perfect for attacking - rook change with check will allow the black into disruption of the King's side attack.",
        "31. Qg3 Ra3a1 32. Rbd1": "It doesn't matter - it still allows for the black to advance to the second row.",
        "32... Rxd1+ 33. Rxd1 Ra2 34. Rd2": "It will prove that the white should have hold onto his rook. The black's advanced d-pawn is much harder to control without a rook than with a rook in play.",
        "34... Rxd2 35. Nxd2 f6": "Finally something I should have played in the opening moves. With this the white will have to concentrate on defense - not offense.",
        "36. exf6+ Nxf6 37. Qg5": "I find the following white moves quite not understandable - I strongly believe that he should have found better position for the knight, improve the pawn structure and bring the King into play. ",
        "37... Kf7 38. Nf3 Nd7 39. Qf4+ Qf6": "Who needs queen with advanced pawn! - Oh I forgot the white needs his queen in order to defend the promotion.",
        "40. Qc7": "To defend the promotion - so what the hell is that queen doing on c7?",
        "40... Ke7 41. Ng5": "It seems that the white underestimated the d-pawn; that's a lesson that will cost him the game.",
        "41... d3 42. Nf3": "Late - it will be damn hard to stop that pawn now (I would suggest 42. Qa4 Qb2 43. Nf3 as a better solution) ",
        "42... Qc3 43. Qa7": "Also I do not see the point in this move.",
        "43... d2 44. Nxd2 Qxd2": "The white lost the knight but will lose some more due to the queens position.",
        "45. Qa4 Qe1+ 46. Kh2 Qxf2": "It does not just materializes - it also opens the e-pawn. Unfortunately I was more interested into changing the queens.",
        "47. Kh3 Qe3+ 48. Kh2 Qf4+ 49. g3 Qd2+ 50. Kg1 Qb4": "The white had to try as hard as he could to preserve the queen.",
        "51. Qxb4": "This way it is just game over.",
        "51... cxb4 52. Kf2 Nc5": "Another open pawn. The white king can not stop them both.",
        "53. Ke3 Nxb3 54. Kd3 Kd6": "Finally realizing he lost. The white resigns!"
    },
    "url": "https://gameknot.com/annotation.pl/mavio33s-mini-tournament-i?gm=29001",
    "gameName": "mavio33's mini-tournament I",
    "players": "mavio33 (1581) vs. goikoetxea (1651)",
    "opening": "Sicilian (B30), Nimzovich-Rossolimo attack (without ...d6)"
}