{
    "moves": {
        "1. e4": "Annotated by legspin.  This is the first game I have annotated.  I picked this one due to a rook sacrifice later in the game which I thought people may find interesting.  I am not a grandmaster (or anywhere near), I have not memorised all openings.  I do refer to a book for openings and I am not as good over the board as on this site.  However, I do think about what I am doing and try to understand why certain moves are the preferred one.  This is my view of what happened and why - better players may disagree but lets not worry about that!  My favourite opening.  Who knows whats coming back at you?",
        "1... c5": "Sicilian - fairly standard amongst top players on this site.  Which of the many thousand variations is coming?",
        "2. Nf3": "Standard response",
        "2... d6": "OK, I'm now thinking probably Nadjorf but I'll have to wait and see",
        "3. d4": "Standard response which should lead to the normal trade off",
        "3... cxd4": "Yep",
        "4. Nxd4": "And again",
        "4... Nc6": "Now this took me by surprise.  Nearly all Sicilian openings would see Nf6.  Some  use Nc6 as the second move instead of d6 but I cannot find a variation that would result in the above position in my sources.  That said, I have looked on some game databases and this does happen fairly regularly so I reserve judgement.  Nf6 would force Nc3 to protect the pawn.  I now have free reign to do what I want so I plumped for continuing development.",
        "5. Nc3": "Now I was expecting Nf6.............but",
        "5... a6": "So now we have the Nadjorf position but with a black knight at c6 rather than f6.  Not quite sure whats going on here so continue development...",
        "6. Bg5": "Pin the pawn preventing e5 and an attack on the knight",
        "6... Qa5": "Pins my knight and attacks the bishop.  Personally I'm not keen on developing the queen so early when the whole kingside remains stationary.  This comes back to cause problems later.",
        "7. Nf3": "Knight back to protect bishop and make the knight better protected whilst also maintaining control on the centre of the board",
        "7... Bg4": "Black development continues pinning my knight.  Time to chase off the queen and prepare for a queenside castle which is under pressure at the moment with the queen  at a5.",
        "8. Bd2": "Threatening Nd5 and a revealed threat on the queen",
        "8... Qd8": "Black queen retreats in anticipation",
        "9. Qe2": "Queens gone so no need to move the knight, get the queen out of the way and double it with the bishop.",
        "9... Nd4": "Threatening the queen and  c2 with a fork on the king and rook",
        "10. Qd3": "Avoiding the Nxd4 blunder which would have let the bishop take my queen took the only move available to protect c2 and move the queen other than going backwards and messing up my castling as well as leaving it less well developed",
        "10... Nxf3+": "Check - no choice for a reponse",
        "11. gxf3": "Doubled pawn - not ideal but at least threatens the bishop so I can take back the initiative",
        "11... Bd7": "Retreat - I have doubled pawns but much better development",
        "12. O-O-O": "Finally I castle which gets the rook down the centre.  I going to ramble a little here.  My understanding of opening theory is to develop pieces, control the centre of the board, keep pieces protected and gain space.  Apart from my doubled pawn I am in a better position on all fronts.  I am expecting black to play Nf6 and maybe g6 followed by Bg7 to free it up.  I was again wrong...",
        "12... b5": "Black opts for a pawn charge on my castled position.  No urgent problems for white so development continues",
        "13. Rg1": "Control the g file",
        "13... b4": "It really is a pawn charge - time for some knight activity",
        "14. Nd5": "Threatening the b4 pawn",
        "14... e6": "threatening the knight",
        "15. Nxb4": "remove the pawn - pawn charge neutralised and a6 pawn under threat",
        "15... a5": "Sensible response - more knight hopping required",
        "16. Na6": "Only option available - this is where having control of the board comes in as both the queen and the bishop are protecting it and there was nowhere else to go",
        "16... Qb6": "Still enough protection for the knight (and nowhere else for it to go so.....)",
        "17. Rg5": "Bring out the rook to put further pressure on the queens side.  I now have every major piece aimed into the queens side except the rook at d1 which is straight down the middle.  Conversely, black still has not moved a single piece on the kingside",
        "17... e5": "To cut off the rook but black didn't see what was coming",
        "18. Rxe5+": "Rook sacrifice for a pawn - check!  A killer blow although it may have appeared a blunder.  I'm now looking at dxe5 and then Bxa5 which means my queen supported by the rook have a clean run at the black bishop on d7 and mate if it is not protected",
        "18... dxe5": "The obvious response and I don't think it would have made any difference if something else had been played at this stage",
        "19. Bxa5": "Threatening Qxd7 mate if the queen removes the bishop",
        "19... Qh6+": "A short reprieve",
        "20. Kb1": "a simple sidestep and then back to the action - note the black kingside is still in place",
        "20... Ra7": "Protects the bishop and therefore mate",
        "21. Qb5": "Threatens Qb8 with the bishops lined up to close in for mate or Qxd7 if the rook moves.  Taking the queen with the bishop is not appealing as Bxb5   Rd7  Rxd7 and then Qxa6 or the knight moves in for mate.  A bit more play and blacks queen is taken leaving even on major pieces but a clear path for whites pawns to advance down the king side",
        "21... Qxa6": "Black brings across his queen to join in but too late",
        "22. Qxe5+": "Check - only a couple of options left for black",
        "22... Qe6": "Saves his queen from Bxa6 but still in desparate trouble",
        "23. Qb8+": "Mate is now inevitable and unavoidable.  ",
        "23... Ke7": "Bc8 would have prolonged it a few more moves but I suspect black knew what was coming and went for the short version",
        "24. Qd8#": "Mate - the moral of the story is............develop your pieces and look for those sacrifice opportunities.  Hope you found that interesting.  I now have a rematch to worry about!"
    },
    "url": "https://gameknot.com/annotation.pl/max-mini-tournament?gm=4341",
    "gameName": "max-mini-tournament",
    "players": "legspin (2007) vs. andre25505 (1908)",
    "opening": "Sicilian (B54)"
}