{
    "moves": {
        "1. d4": "this game shows an example of an attack to blacks casteled king. you will see some sacrifices and white will use every equipment he has to win.",
        "1... Nf6 2. c4 Nc6": "seems not a successful opening for the black. development of knights before pawns might give white to conquer the center and initiative to develop the game on either side he wants",
        "3. Nc3 d5 4. cxd5 Nxd5 5. e4 Nxc3 6. bxc3 e5 7. d5 Nb8": "white has an obvious opening advantage right now. pawns are nicely placed in the center.",
        "8. Nf3 Nd7 9. Bb5 Bd6 10. O-O O-O 11. Ng5": "blacks squezed position and underdevelopment gives white a chance to attack",
        "11... Nc5": "black is thinking to remove the white's knight at the next move and so leaving the e4 pawn unprotected. And also opening his bishops diogonal. But losing tempo and giving a white chance to attack. 11....f6 could have been better",
        "12. Qh5 h6 13. f4": "they are entering into a deep dark forest now. and the path leading out will be wide enough only for one..",
        "13... hxg5": " exf4 would have been safe for black.",
        "14. fxg5 g6": "black is afraid of white's g6. but it wouldnt be that dangerous for the black. besides 14...Ne4, then Bc5 and Nf2 would give black a chance to draw.",
        "15. Qh4": "this is better than Qh6 as it is protecting e4.",
        "15... a6 16. Rf3": "second sacrifice. white is slowly but surely doing his plan. he will close the white diagonal to blacks bishop and will attack from h column",
        "16... axb5 17. g4 Re8": "now Rh3 is not good enough as blacks king could escape thru f8, e7, d6 and then protects himself with his rook, bishop and queen.",
        "18. Be3": "this is nice. bishop is opening the road for the last heavy gun of white and at the same time still on the c1-h6 diagonal.",
        "18... Nxe4": "protecting f6 square as whites Queen would treat otherwise with Qf6 after 19.Rh3 Kf8, 20.Qh8 Ke7",
        "19. Rxf7": "third sacrifice! this will leave blacks king completely open to attack.",
        "19... Kxf7": "now black has no chance but to accept the sacrifice. otherwise Qh7 would be inevitable",
        "20. Qh7+": "taking the king back to the last row.",
        "20... Kf8 21. Rf1+ Bf5": "now white has a chance to make draw with Qh8, Qh7.. but such attack should end with a win.",
        "22. Rxf5+ gxf5 23. g6": "beautiful ending. Threats are not only Qf7, Qh8, g7 but also Bh6!"
    },
    "url": "https://gameknot.com/annotation.pl/megachesssuperknockout?gm=24650",
    "gameName": "MegaChessSuperKnockOut",
    "players": "okat (1723) vs. yamunotri (1725)",
    "opening": "Kevitz-Trajkovich defence (A50)"
}