{
    "moves": {
        "1. e4": "Rules: Players are to take turns and play, and no discussions are allowed between players. When one side has only 1 minute left, only one player can continue. So firstly, Alexandra Kosteniuk opened up the King's Pawn.",
        "1... e6": "Ruslan Ponomariov replied using the French Defence.",
        "2. d4": "Almira Skripchenko replied with the most popular move, d4, building up the center for White.",
        "2... d5": "Evgeny Bareev attacks White's center. All of you have to remember that the first few moves are actually bookmoves of the French Defence, in fact the Winawer variation. Notice the alternating motion of the players too.",
        "3. Nc3 Bb4 4. e5 Ne7": "!? Bareev plays an interesting Ne7. The most popular move in this position is c5, where the game continues: 4... c5 5 a2 Bxc3 6 bxc3, then Ne7. However, Ponomariov first moved the knight to e7.",
        "5. a3 Bxc3+ 6. bxc3 c5": "Now Bareev gets into the normal position for the Winawer variation of the French Defence.",
        "7. Qg4": "Here, Kosteniuk opts for the Poisoned Pawn Variation of the Winawer Variation. White hopes to gain material by chopping on g7, on the other hand, Black gets the initiative to attack.",
        "7... Kf8": "!?!? Ponomariov gives up castling and moves his king to protect g7? Unbelievable! This completely new move set the women surprised. Most normal line would be 7... Qc7 8 Qxg7 Rg8 9 Qxh7 cxd4. You chess fans can give your opinions on this move Ponomariov played.",
        "8. Nf3": "Skripchenko continues development.",
        "8... Qc7": "Bareev tries to create play on the c-file.",
        "9. Kd1": "!?!? Kosteniuk imitates Ponomariov by moving the king? What is she trying to do? Even in the video featuring the game, Kosteniuk comments herself that move is not a possibility! How will the game turn out?",
        "9... Bd7": "Ponomariov continues his development, also trying to create play on the queenside.",
        "10. Bd3": "Skripchenko also continues development.",
        "10... h6": "Bareev waits.",
        "11. Bd2 c4": "Here Ponomariov plays on the queenside, kicking the light-squared bishop off d3, getting the initiative.",
        "12. Be2 Nbc6": "More pieces on the queenside. White really needs to worry about the queenside, if Black attacks there.",
        "13. h4 Rg8 14. h5": "Skripchenko ignores the queenside and turns her attention to the queenside.",
        "14... b5": "Bareev ignores his kingside and switches to the kingside! It is getting interesting here. The men plan to attack on the queenside while the women plan to attack the queenside. How will this game turn out?",
        "15. Nh4 Nf5 16. Qf3": "Ponomnariov defends his kingside by initiating a trade of knights.",
        "16... Nce7": "! I don't know if this move is really good, but in my opinion this move is good. The knight on c6 isn't accomplishing anything on the queenside, and Bareev intelligently moves that knight to e7, connecting both knights and defending the kingside.",
        "17. g4 Nxh4 18. Rxh4": "White starts counterattacking the kingside.",
        "18... Ke8": "!? Bareev moves king away after Ponomariov moved it to f8 in move 7! It is hard to find the intention of this move, but I think Bareev wants to save his king away from the kingside when the attack is held there.",
        "19. Qg2": "Kosteniuk threatens the kingside again my placing her quuen on the g-file.",
        "19... Kd8": "Once it is done it has to be done. Ponomariov continues moving his king to the queenside.",
        "20. f4": "Skripchenko initiates more firepower on the kingside.",
        "20... Qb7": "Bareev tries countrerplay on the queenside by playing Qb7, also giving an escape square for the king.",
        "21. Rh3 Kc7 22. g5 Nf5": "Skripchenko starts counterattacking the kingside, but Bareev refuses to expose the kingside.",
        "23. Bg4 a5": "Ponomariov dashed his pieces to the queenside, preparing for an attack.",
        "24. Rb1": "Skripchenko tries to defend the queenside.",
        "24... Qc8": "?! Bareev gave the initiative to White, letting them prepare to attack the kingside! This is dubious as this queen move does not help Black really much.",
        "25. Ke2": "! Good move! Kosteniuk prepares to get counterplay on the kingside by freeing the 1st rank, for the rook to slide freely to kingside or queenside as she wants.",
        "25... Ne7": "?! Huh? Ponomariov moves the knight out of its f5 outpost? Not only the knight's defence on the kingside diminishes, Black passes the initiative to White!",
        "26. Rg3": "Skripchenko creates a powerful gun on the g-rank, achieving great counterplay on the kingside.",
        "26... Kc6": "Bareev waits, also allowing the king to get into the action on the queenside.",
        "27. Bh3": "Kosteniuk opens up the g-rank, ready for an attack.",
        "27... Qf8": "Ponomariov defends. Attacking the queenside is also possible, but Ponomariov probably sensed danger on the kingside",
        "28. Rg1": "! A great gun! Skripchenko really demands counterplay on the kingside. Now Black needs to be really careful, or the attack would smash right on their faces and defending would be too late.",
        "28... Rh8 29. Qf3": "You would realise that the position is so cramped for both sides that none is able to really make any progress. This reminds me of the Battle of Arcole, where the French and Austrian armies are stuck in a stalemate (although Napoleon managed to cross the bridge and break through the Austrian position).",
        "29... Nf5": "?! Again? Ponomariov has been wasting moves moving the knight to and fro.",
        "30. Bxf5 exf5": "Skripchenko decided to take the knight and double up Black's pawns on f-rank.",
        "31. g6": "? Kosteniuk could have played gxh6, leaving White an exposed g-rank for the doubled up White rooks to come crashing in and attack, but she didn't see that.",
        "31... f6": "Ponomariov does not want to open up the kingside for White to attack, of course. The result for White is that they cannot break through the kingside.",
        "32. Bc1": "Skripchenko tries to find a way for the dark-squared bishop to be active on the board.",
        "32... fxe5 33. fxe5 Be6": "The kingside is closed. Now Black can safely chop on the queenside and do damage to White's position.",
        "34. Qf4 b4": "Black's attack comes. Will White be in trouble?",
        "35. cxb4 axb4 36. axb4 Qxb4": "Look at this! Although the position is about equal, the queenside is completely exposed for Black to attack!",
        "37. Bd2 Qb2 38. Rc3 Kd7 39. Qh4 Ra3": "Black relentlessly tries to bite on White's position.",
        "40. Rxa3 Qxa3 41. Rg3": "? Kosteniuk missed the excellent move, 41 Rb1!!, turning this closed position into a winning position for White. Too bad Kosteniuk missed that marvellous move.",
        "41... Qb2 42. Rc3": "White defends relentlessly against Black's attack.",
        "42... Qa1 43. Qe1": "Kosteniuk wants to trade off the queens.",
        "43... Qa2": "Ponomariov rejects the offer and continues to stay on the 2nd file.",
        "44. Qh4 Rb8 45. Qg3": "Black fights on, wanting to trash White's position. White won't give in, however. ",
        "45... Rb1": "Ponomariov slides his rook onto b1, taking dominance of the 1st rank.",
        "46. Bxh6": "!! 1 minute left! Only one player plays for White, and that is Kosteniuk. Kisteniuk played this marvellous move, which releases the kingside for White to assault.",
        "46... gxh6 47. g7 f4": "? Ponomariov attacks the queen on g3. Didn't he see that a powerful and dictatoring queen would be produced if White promotes the g-pawn?",
        "48. g8=Q fxg3 49. Qg7+ Kc8 50. Qf8+": "Things definitely look simple for White. All Kosteniuk needs to do is to keep on checking and get a draw out of it.",
        "50... Kb7 51. Qe7+ Kb8 52. Qd6+": "A draw looks certain.",
        "52... Kb7": "Bareev almost moved Ka7??, which the line 52...Kb7 53 Ra3+ Qxa3 54 Qxa3+ loses the queen for Black. Luckily for him, he played Kb7.",
        "53. Qe7+ Kb8 54. Qd6+ Kb7 55. Qe7+": "The game ends as a draw due to perpetual check. Hope you guys like this game played between the men, Ruslan Ponomariov and Evgeny Bareev, and the women, Alexandra Kosteniuk and Almira Skripchenko. Also check out Alexandra Kosteniuk's youtube channel, http://www.youtube.com/user/ChessQueen, where she make movies featuring games played by her and some chess exercises."
    },
    "url": "https://gameknot.com/annotation.pl/men-vs-women-tandem-blitz-golden-blitz-tournament-moscow-2005?gm=38871",
    "gameName": "Men vs Women Tandem Blitz, Golden Blitz Tournament, Moscow 2005",
    "players": "Alexandra Kosteniuk & Almira Skripchenko  vs. Ruslan Ponomariov & Evgeny Bareev ",
    "opening": "French (C16), Winawer, advance variation"
}