{
    "moves": {
        "1. e4": "This time, she's white, and I'm playing as black.  The idea behind it is to do what most coaches.  When you play with one color the first, it's common, and generally, a good idea to play with the opposite so that you can see how your student will adjust to the different changes.  By doing so, you can make different suggestions to help them to improve.  Now, after she plays the King's Pawn Opening, I said that the same thing that I've said in past games which is, As you recall, this is the most common opening. Now, there are several ways for black to respond, but I'm going with the most common variation which is also not too difficult to learn.\"  That will be 1...e5.  The idea being is that I could but choose not to play 1...c5  Why?  Because that would be getting her used to the Siclian Defense.  And, as other's have mentioned in the first game where I coached, despite the fact that the Siclian Defense was one of the first opening that my OTB coach made me learn since it's one of the most studied, it's not really a good idea to teach your students because it's more complex and requires a lot more variations.  When you teach, you want to start off simple, and then gradually make it more complicated.  ",
        "1... e5 2. Nf3 Nc6 3. Nc3 Nf6": "At this point, Erika annotated her game against leastofthese.  After seeing the comments, she said, \"i need to let something sink in before I can make my next move\"  After that, I pointed out something important which is, a well known fact because when it comes to training people I like to mention the well known facts.  That is, take your time. What I played with 3...Nf6 is called the Four Knights Defense.  Now, earlier, you played 3.Nc3. There's nothing wrong with this move. But, slightly better, believe it or not was 3.Bb5 which is the Ruy Lopez. Now that's an aggressive line that is studied by masters and GM's. For example, in the world champion chess match between Anand and Carlson they had at least one round that involved the Ruy Lopez and it led to a good game.  And, I also said, Also letting the information is key to improvement. The way to remember is, as someone recently told me which I agree with is that there's very little luck in chess, unless of course you're in a lost position and manage to get a draw or win. Otherwise, it's about skills and mathematics. One thing that I enjoy about coaching and mentoring is getting students to become familiar with the process and taking time to process the information is a very good way to do that.",
        "4. Bc4": "Now, comes an interesting part.  Note: This was not a HW assignment, or a quiz.  Meaning: That I didn't expect her to answer the question, but I decided to give her something to think about because thinking about these things is a way to become a better said.  The concept I gave was, Before I make another move, suppose that I had played something other then 1...e6, how would you respond? Would you have still played 2.Nf3 or would you have responded differently? The reason I ask is that I've noticed that with many different opening, you've played 2.Nf3 I understand why because it develops a piece, and development is important. For example, if black had played 1...e6, as opposed to 1...e5, then 2.Nf3 would not be a good move. Instead, 2.d5 would be the best response. So, the idea is meeting the exchange that when your opponent plays something that you're not accustomed to, the idea is to be able to meet the change in that position.  This is a good lesson that I learned some time ago from thereaper1.",
        "4... Bc5 5. d4": "?! I didn't realize this, so I wasn't going say anything because I don't want to over do things when it comes to coaching.  I learned about this the hard way when I did that in my last training against the same opponent, and I inadvertently gave the wrong advice because there was simply too much.  But, after looking at the post game computer analysis, and today is the first time I did this, according to the computer this is an inaccuracy.  Now, according to the analysis best was 5.d3, as after black often replies 5...d6  I agree, but at the same time, disagree with the assessment.  I agree about 5.d3, but only under the technicality white can free her DSB without losing a anything.  But, I disagree that 5...d6 is a good response because this limits the amount of places black's DSB can travel.  However, what Erika also shows why were here.  That is, \"if you take my pawn then i can get your bishop and then trade off on the knights then I could castle after the trade off that would elave white -1 and black +1\"  But, this is where I did something different, and got the idea from a mentor on GK, and then followed by Stalhandske in his game against brigadecommander about the Phillidor's Defense.  I made a suggestion that was bad, and then stalhandske as a HW made me figure out, on my own, why that was so.  The idea being is that it's good training, and I agree with it since this is what I do with quizzes from GM Judit Polgar.  And, the fact that my OTB chess coach, in order to help me learn, has done things similar by showing GM games and making answer question to the move I played or was about to play of why it's not good, and/or, how it loses immediately.  In fact, I remembered that quiz to defeat an opponent here, as well as, Jack Stockel in a couple of past games, especially when I was in a hopelessly lost position.  So, the quiz which I made her, as which was HW is in two stages.  First, No. If I don't take, you would win my B. But, if black takes with N, so ...NXP, or ...Nxd4, we end up with a pawn exchange. But, I don't have the pawn. Quiz: What else can black take with?  Second, I don't want to give you too much, but it occurred to me, and this is another important aspect of absorbing the information. So, another thing to note is that I don't have to take, in order to avoid losing a piece. So, the second part to the HW question is, aside from capturing, wherelse can my bishop move?  And, until I only have a day left to move, I will wait to make my next move, until you complete the HW assignments, meaning: answer these questions. I know how difficult this is, but it's also very important because trying to figure out the answers is what it takes to become a better chess player, believe it or not. And, I don't want to do things too quickly, as I want to give you time to answer the questions.  Then, I said, I also know why it's difficult because this used to be my weakness too. ",
        "5... Bxd4": "BTW, during the last move she accurately told me, which also makes me happy the fact that pieces are worth more then pawns. While, I thought that this was the best way to retake, according the post game analysis, this move is a mistake and best was to capture, with the e pawn, for after 5...exd4 then 6.Nb5, Nxe4 7.0-0, 0-0 8.Bd5, Nf6 9.Bg5, Be7 10.Bb3, Na5 11.Qxd4, Nxb3 12.axb3  Note: That computers are not always accurate.  This time, however, I agree for the exact reason that it outlines.  ",
        "6. O-O": "According to analysis, this move is an inaccuracy.  That, best was, 6.Nxd4, exd4 7.Nd5, h6 5.Bf4, d6 9.0-0, 0-0 10.Re1, Bd7 11.Qd3, Re8 12.Rad1, Kh8 13.Qf3  Unlike before, however, I disagree with that and think that Erika played was actually the best move.  The idea is to, \"castle early and often\".  And, from where I come from, earlier is better because K safety is, aside from keeping things safe, the most important thing, making the second most important concept.  Now, this is something that I taught her in some of her past annotations shortly before I started mentoring her.",
        "6... Bxc3 7. bxc3": "At this point, I said to her, However, you were right about the way I capture which shows improvement right there. Yes, if I had taken with the e pawn, so played 5...exd4, instead, then white could respond with 6.f4, and I wouldn't be able to take with 6...Nxe5, as that would lose a piece for a pawn. So, then black would have to give up tempii in order to save his N, when the time is needed to develop. Of course, I am going to castle, but in this position, I was considering to take your e pawn. But, 7...Nxe4?? is a very serious blunder.  It's not super serious, but actually is a mistake. It's a complicated position and might take a while to answer the question. In an unusual this mistake would be serious. However, it isn't a HW assignment, but rather, a quiz because one thing to help someone improve is also be quizzing them to see what they know. One way or another, I'll answer. The idea is to see if you can figure out why, in this case, \"To take is a mistake\", in this situation.",
        "7... O-O": "Then, I said, admitting that it would be too difficult to answer because what I gave was, in my opinion was very advanced.  So, I admitted the error by saying, I was hoping that you'd answer it, but this time, the question I gave was too difficult. The real answer is that 7...Nxe4?? is a blunder because if the N captures, white can 8.Qd5. So, black would have to lose a piece or expose his K.  The idea being is that the only place where black's N can retreat without losing a piece, right then and there, but at the same time, defending the mate is with 8...Nd6, but that's then met with 9.Ba4 which becomes, pretty much, the same situation.  And, it's more complicated then that. Instead of 9.Ba3, white has an even more powerful threat with 9.Ng5, and to make matters more complicated, with Black's DSB, white can't take the N. And, even if mate wasn't feasible right away, black would have a very difficult to position and be in quite a bit of trouble as all of white's minor pieces would be working against the K. So, in this case, K safety is important. My idea is for you to see this because an important part of thinking and planning ahead is by preparing for something that you didn't expect.",
        "8. Ba3": "At this point, reachforgoals asked me a very good question.  \"in this case is double pawn a bad thing\"  It's very good because archduke_piccolo told me to erase all fears about doubled pawns.  And, later he told me that it's not always a bad thing and depended upon the position.  This time, my response was the same that ION implied when I said, In this case, it is a little bit of a weakness, but it's not, by any means, super bad. It's just that the two pawns on one file seperates e pawn from the c pawns. So, it's said to also be isolated pawns, since they're not all connected to one another. It's not so bad, unless or until, it reaches the endgame. That's when pawn structures become important, because what it usually takes to get a passed pawns are all of the pawns connected.",
        "8... Re8": "The idea behind this move was to protect my f R, but I overlooked one other way that I could've done that, and it would've been 8...d6  In fact, this was the best move according to the post game analysis, as then this would happen.  9.Re1, Be6 10.Bb3, Qe7 11.Rb1, Na5 12.Qd3, Rab8 13.Bb4, Nc6 14.Ba3, Ng4 15.Re2, Kh8  BTW, I absolutely agree with this.  ",
        "9. Ng5": "This is when I realized that my last move was a mistake because of the weakness that I have.  And, white did an excellent job exploiting it.  So, I decided to give her more optimism by accurately saying, BTW, you are playing extremely well in this game, so far. And, it shows significant improvement.  Then, she said, \"if i am not mistake if I move the white knight to f7 checkmate or f7 i could take the queen the move after that\"  So, I responded by saying, Yes. It's not checkmate, but you would win my Q, if I'm not careful. However, there is one way for black to get out of this situation. HW: How can black get out of trouble?  Note: It doesn't directly, but rather, indirectly prevents white from playing 10.Nf7  The reason I give you this assignment is because as noted, black can out of trouble, in this position. That's also something important that's important to think about in your actual, rated, games. It's about what can your opponent do, and how can he or she respond because chess is not easy where, if I move here then my opponent must move there, or my opponent will lose something. The way to remember this is as GM Judit Polgar once said, \"Chess is a very complex game and full of interesting ideas.\" Actually, there are two moves that black can make to avoid losing his Q. But, one move, in exchange, loses a R. So, it's down to one move that keeps everything safe, so by getting out of trouble, this is what I'm alluding to.  Then, she said, \"you have move the queen to e7\"  So, my response was, Yes, 9...Qe7 protects the Q, but it's not the best move because it still loses a R, after 10.Bxf7 because black cannot take back with 10...Qxf7, do to the g N. But, there is one move that will keep things safe, and only loses a pawn. But, there is only way that black can do this.",
        "9... d5": "So, I waited a day or two, but after that, I was in danger in of timing out, so I had to play the best move, as I mentioned. But, that's when I gave her a different question, to see if she figured out why that was so.  That's because, as noted earlier, this is a very good way to learn. She said, \"opsss my bad we have a sick at ovr here you will need tofinsh your last bishop you would make a move to protect your queen you can not take my bishop because i can take your queen.\" However, she got the answer wrong. ",
        "10. Bxd5": "A little earlier, Erika said, \"In addition, shortly afterwards, and it shows that Erika has learned a lot since in our first mentoring session, we worked on not resigning early.  And, she said, \"I know you do not like resign in one of my gmaes I have no other cohice iam 26 down\"  This time, however, I when it came to resignation, I said, Well, 26 points down is a lot, and while I personally wouldn't have resigned. In a case like that, I understand. Being 26 points, only if you only have a Q with the opponent having much, on very rare occasions lead to a stalemate. But, generally, it's over when you're that far behind. Which game was this?  What that means is not to resign just because a piece is left attacked or like if you're down by a piece even a Q, or possibly a little more. But, if your down by 26 points down, that's a different story. ",
        "10... Nxd5": "Actually, this is the reason that I have to take your B. But, if QXB, meaning that I capture, with the Q, then you could take my Q. However, while you do win a pawn back, I can take back with my N. What you said is very true, that I have to develop my remaining piece, but defending material is of even more importance.  What you said, for the most part, was correct, but there's more to it then meets the eye. The idea behind 9...d5 was to cut the bishop's diagnol because your LSB was dangerous. With your B on c4 combined with your g5 N and DSB you were threatening to win, at the very least my R. Had I not cut it down with 9...d5 this would've happened, and I could not allow it. So, now this is an instructive. Yes, development is very important. But, even more important is trying to find a way out of trouble, and defending material. Note: Before I played ...d5, black was in a lot of trouble. But, by thinking about it, I got out of the situation. Being able to do that won't just help you in chess, but in life, as well. There are certain situations where you're faced with obstacles and problems, and knowing how to overcome these obstacles is a way to achieve your goals.  BTW, I said all this with a smiley face.",
        "11. c4": "?? At first, I wasn't sure why she played.  But, when the game was over, she told me why.  The reason why is she studied a video about connected pawns that I showed.  So, the idea was to get connect her c and e files and reconnect her pawns, meaning, eliminate her doubled pawns so that one of her pawns would remain on c4, whereas, the other would be on d5.  The idea behind it is to promote.  Normally, this kind of thing would work, but in the endgame.  The problem here is that it's a blunder, and not because of what the game analysis mentions, at all.  Had she taken, white would've compensated for lost material, and in fact would wind up a point ahead.  However, with this move, I can and will force an exchange, increasing my advantage.  But, what she said was alarming to me and raised a red flag.  That is, \"you knight is in danger so you would have to move your knight\"  So, my response was, You make a very good point, that my d5 N is in danger. That's true, but I don't have to move it, per say. If I take on g5, then even if white captures on d5, you have an even exchange. Now, an even exchange=exchanging something worth the same value. e.g., N for N. B for B. Or, if you exchanged Q's. Note: And, this is a very important concept, and what I mean by preparing for the unexpected.  You said, that I must move my N. Now, until recently, I made this mistake thinking ok, I'm attacking here, and since I'm about to win something, he must do this to defend. However, \"it's not so easy\", as my coach puts it. There's always more to a story then meets the eye. This is where you want to ask yourself, what else can my opponent do, as opposed to, inferring that he must play something else. That's because planning so, as were the case here, that's is cause preplanning a move because, presumably, he has to do respond about it and has a difficult position to defend. But, then he or she plays something that you didn't expect but is just as good or even better can spell disaster.  A very good example, that is while I was still having problems was with a mentor here. My Knight was well placed, where it originally was. Now, I moved to fork his pieces. I thought that the position was very difficult to defend both, and he could only make one move that would do this. And, once he made that move, I would have the advantage. But, I was wrong. He caught me off guard and made a move that I didn't expect. So, the joke was on me because I was then forced to move the attacker 5 times, back to it's original, when it should've only stayed on one. And, the mentor told me, more or less, the same thing.",
        "11... Qxg5": "According to the post game analysis, this move is a mistake.  Best was, 11...Nd4 12.Qxd8, Rxd8 13.Rfd1, Bg4 14.f3, Bh5 15.g3, Ne2+ 16.Kf2, Ned4 14.f3, Bh5 15.g3, Ne2+ 16.Kf2, Ned4 17.Rac1, f6 18.g4, Bxg4 19.c3, fxg5 20.cxd4  However, I don't like the position afterwards, so I disagree with them.  In my mind, this is the best move as it creates that is, this time, somewhat difficult to defend against.  And, with best play from white, black will remain a piece ahead.",
        "12. Qxd5": "?? This, however, is an outright blunder.  Best, as the computer analysis notes and was 12.cxd5  And, it's similar to what I later pm'd reachforgoals.  But, this is better because it goes into more variations.  So after PXP 12...Bh3 13.Qf3, Bg4 14.Qc3, Nd4 15.Kh1, Nb5 16.Qb3, Nxa3 17.f3, Bh5 18.Qxa3, Bg6 19.Rab1, b6 20.Qd3  But, with this move, however, when black does make a threat, plays ...Bh3, it will be extremely difficult to defend against.  Note: as some might recall, my first lost against the Master Mater, which jstevens1 annotated and called it, \"Back with a Vengeance\"  And, in the end, I mentioned that I used some of his strategies to defeat my opponent and game an example of such.  Well, this is even better and almost identical as this same threat is almost identical, so stay tuned. ",
        "12... Bh3 13. f4": "?? I understand this move perfectly well.  The idea was to gain by forcing my Q away.  Unfortunately, this is the move that's going to seal her fate, once and for all.  Note: This, ironically, is the same mistake that I made against the Master Mater.  When, I was in trouble, I decided to kick his Q figuring that I got out of it.  But, what I overlooked was the mate in one which he did take advantage of, in the exact same way, ironically.  That was, his LSB+Q.  While it might appear differently, this, by my standards is the losing blunder, and not her previous move, QXP.  In order to prevent mate, white's only move was to move her g pawn.  But, when she does that I take and capture her R, with 13...gxf1+  In other words, white would be, this time, forced to give up her R for my B in order to prevent mate.  Note: if you lose a lot of material, even against a much stronger opponent, you still have chances of counterplay and are sometimes able to turn a loss into a draw or win, henceforth, a swindle.  I know, because I have pulled such swindles against Mr. Stockel in hopeless positions, but once you leave yourself vulnerable to a mating sequence, that's when it's over.  That, is when the opponent takes advantage of that weakness, which is what you typically see.",
        "13... Qxg2#": "Overall, reachforgoals played this game extremely well.  The performance in this game was far north of her rating.  In my mind, she played like an 1100.  However, the game was quite instructive with a lot to learn.  @Erika: The morals of this game is that if you're in trouble, don't panick.  Instead, as Mr. Stockel puts it, \"Try to find a way out of trouble.\"  An example was when I played 9...d5, when I was in trouble.  Second, \"expect the unexpected\" and to, \"be ready for anything and everything.  For example, instead of hesitating, when I had something to think about after getting out of trouble knowing that I could wind up in that situation.  And, you were doing damage with your Bishop and Q.  So, I figured it out, by answering and recapturing with 10...Nxd5  The other concept of preparing for the unexpected is not assuming well if I do this, then this is how my opponent must respond because there might and usually is something that he or she can do, which is just a good, yet you never expect.  When that happens, you're often in worse shape.  Third, \"be a spectator of your game.\"  That means, look at the entire board, and not just one or two moves.  The perfect example was after I played 12...Bh3, you were interested in hitting my Q with 13.f4.  Now, had you seen the immediate mating thread, you would've advanced the h pawn.  In addition to what happened with the Master Mater, this is a mistake that I made against Mr. Stockel, one time.  I was in a lot of trouble, but he made a mistake that I overlooked, an immediate back rank mate.  As instead, I hyperfocused on getting out of trouble, henceforth.  As soon as I missed it, I wound up getting in even more trouble.  So, what should've been the winning move became the losing blunder. If you can remember these morals, combine with what we said in your past annotations, and our first training, I'm confident that your rating will surpass 1000, once and for all."
    },
    "url": "https://gameknot.com/annotation.pl/mentoring-game-2?gm=55335",
    "gameName": "Mentoring Game-2",
    "players": "reachforgoals (766) vs. jkarp (1273)",
    "opening": "Four knights (C46), Italian variation"
}