{
    "moves": {
        "1. e4": "So, I start of with my usual.",
        "1... e5": "She remembered what I've told her, including the fact that 1...e5 is the most common response.  I forgot when it was, but I think it was just before our second training session where this student implied that she learned that from me.  ",
        "2. Nf3 Nf6": "I had anticipated 2...Nc6, as after we'd have the Ruy Lopez.  However, there is nothing wrong with this move as it also develops.  BTW, @reachforgoals: The Ruy Lopez is a well known opening that starts off with 1.e4, e5 2.Nf3, Nc6 3.Bb5  It is good to learn these different opening.  Though this can lead to other things such as the Four Knights opening, which is going to happen.  My goal here is to try and have you become familiar with different opening and variations as it's good practice.",
        "3. Nc3": "I considered 2.Nxe5, with the idea being that after 2...Nxe4, I'd gain tempo and a pawn after 3.Qe2 because when her Ne4, would retreat, that's when I'd play 4.Qxe5  But, I don't know the proper continuation after that so I didn't want to go into complications.  Therefore, to keep it simple, I decided to just continue developing.  At this point, the conversation begins.  Erika: I am thinking abut ethier mvoing the bisop to get ready for castle or the knigt.  if I move the bishop then pawn could be taking taking but if i move the knight i have a piece in place just case the other player takes the pawn  Joe:  Either one is good for castling purposes. One of the main things you want to do, in general, is develop your pieces and get the K to safety. The only thing to note about moving the B, which is what you were thinking is that, you generally want to develop the Knight before the bishop. The reason is that you know where to place, but with bishops, however, it is a different story. And, moving them away from the eighth rank doesn't lose anything.",
        "3... Nc6": "Following my advise, she plays this.  And, that makes me proud of her.",
        "4. Bc4": "With that being said, I continue developing and prepare to castle.  Erika:  I know this is off subject but can some one win a game if one player has a king and other player has a king and 2 queens.  I am only asking that. i was in a game that 2 queens and ask for draw becuase i was not sure if i could win that way. yes the draw was accepted.  Joe: Yes, if played correctly, two Q's and the K can win. In fact, there are some games, where just a Queen and King can mate against the King. The way to do that is confine the King to the corner, so on the a and/or h files. From there, it is in a place where it can't get out. However, if you have those Queens but make a blunder the game could still end in a draw, usually by stalemate but there's also 50 move rule, where no captures have been made in 50 moves. Or there is a different mistake where you keep checking, he or she gets out, and the position repeats three times, until you have a draw by repetition. But, if everything is done right, you would have a win.  When I said that, however, I made a mistake which I spotted out by visualization.  In fact, I pictured a position just before I fell asleep, on Monday night.  And, I corrected myself, and showed her that fen yesterday.  I got two Queens mixed up with Knight and Bishop, which, that must be in the corner.  But, with two Q's and K against K, the monarch being confined to the back rank is enough to mate.  So, said, in a pm, I did make a small mistake on how to mate with two Q's and the K. In most endgames, the idea is confining the monarch to the corner, so on the a or h file in the corner. But, with Queen's, we don't need that. The best way to mate there is to force the monarch on the back rank, so on the 1st or eighth rank. ",
        "4... b6": "Erika: bad moveo n myhaalf  Joe: It's not so bad. Sure, it doesn't develop, but this is a fianchetto, and what it boils down to is if you have time to do this. Given that d7 hasn't advanced, yet, you have time to play this.  Now that I think of this, as noted, it isn't that bad. But, slightly better was to advance the d pawn because the way to control the center is to dominate the center files which is the d and e files. However, it's not a terrible move because as you can still develop your Bishop here.",
        "5. O-O": "Meanwhile, I was going to castle, one way or another.",
        "5... Bc5": "So, my student prepares to castle by continuing to develop.  ",
        "6. Ng5": "It, is technically, considered unsound.  But, it's now what one would think.  In other words, I did not play this to win material, as one would think.  Instead, I am quizzing Erika by putting her in this situation.  My goal is to see if she finds the right move.  The idea being is this student to learn since one of the weaknesses is missing threats, which we'll see later on.  In this case, the fear is winning a pawn and a major piece by forking her Rh8 and Qd8  I also bared that this is not that easy to spot.",
        "6... O-O": "But, by following my advice on developing and castling, she found the best move.  And, that also makes me proud of her.",
        "7. d3": "With that being said, I decide to play this.  For one thing, it enables me to get complete development.  And, in the process I have a solid pawn chain, which in this particular position it's very beneficial, especially since those three pawns are together.  It's, thus, important to note that if instead of d3, let's say that other pawn was on a3.  In that case, I wouldn't go for the pawn chain as it wouldn't be as useful.  Meanwhile, the training resumes.  Erika: when good time to use Conditional moves and when is i not a good time  Joe: You have to anticipate accurately. In general, it's only preferred when a move is forced. But, if there are other options, then I wouldn't recommend it because if he or she makes a move that the opponent does not anticipate, he or she could wind up in trouble. That actually happened to me in a game, about 7 years ago, and that sealed my fate.  Erika:  i need time tbeofre i make my next move that is not a good move c5 to to f2 nor moving the knight form f3   ",
        "7... a6": "After about a day and a half, she plays this.  I understand the logic behind it because the plan behind it is 8...b5, which would gain a tempo, and it would boil down to the same thing that would occur, if black were to 7...h6  Joe: Always take your time before moving. One reason I set the time control to 14 days was so that there's be plenty of time. And, you are right, that taking on f2?? would be a blunder.  Erika: nor b7 to b6 nor h7 to h6  Joe: You are right about b7-b6? being a mistake, as I'd take the pawn.  Although this is not bad, you asked about 7...h6 In this case, that was best because I'd be forced to lose tempo (time) which you be able to use the time to complete your development.",
        "8. Bd5": "So, I go for the gusto by putting pressure on her c6-b8 diagonal.",
        "8... Nxd5": "She takes.  ",
        "9. exd5": "I take back.  Erika: we both loss the same amount of its fair  Joe: Yes, but since it's even, we haven't lost anything. It's actually known as an even exchange because everything remains even.  The only problem, as you see here is that by taking on d5, although it's an even exchange, I have gained tempo because I took back with my e pawn, as opposed to, the N.  Erika: how many days do have i need to fiand amove  Joe: The time control is set at 14 days per move. Given that it's only been a day, you have 13 days. So, take as much time as you need.  Erika:  right i as thiknking of saving the knight but it is just aminior piece  Joe: Yes, but minor pieces are very important. The idea being is not to give anything away, especially pieces.",
        "9... Nd4": "So, he protects.  And, in a private message, she asked me a good question.  Erika: when would you ask for a draw?  Joe: A draw is offered, when you feel that noone can win. Now, if the other side agrees with your assessment, he or she accepts. But, if the opponent disagress, the offer is declined. However, you generally want to play it out, first. Meaning: You want to play until near the end, and then if both sides are even, and it doesn't appear that one can win, that's when they generally offer a draw. The idea being is that, early on, anything can change.",
        "10. Qh5": "In the meantime, this is considered unsound, so on a regular basis, a move like this would not come into consideration.   But, with Erika, that is an extenuating circumstance because I know her weakness.  So, I play this to help her improve.  Plus, in a couple of her annotations, reachforgoals missed the threat by grabbing her opponents R, but overlooking a bigger threat similar to this.  In doing so, her opponent was able to mate.  So, my goal is to help my student learn.  Therefore, as the saying goes, unusual circumstances calls for desperate measures.  Although this isn't desperate, everything else applies here.  And, that is especially because of what happened, in our last training session.  The threat was similar, except that it involved my DSB and Queen, as black.  However, she missed that threat which resulted in mate.  Like before, I am, therefore, quizzing her to see, if she spots the threat.",
        "10... g6": "?? I didn't anticipate anything from black, but she overlooked it, and played this.  So, I said, this loses, Erica. You did mention about the loss of a piece, which I said was important. But, what I was threatening was even more important here that got overlooked. This allows white to mate.  ",
        "11. Qxh7#": "Since I saw similar mistakes, in her past games, as noted, I gave her Homework and was going to give Erika a little more time to study this.  The problem, however, is that I was going to annotate.  Now, after today, there wouldn't be time to annotate, until Tuesday or Wednesday.  Normally, that's allright except that this game lasted for almost a month.  So, in two more days, some of the game chat will be deleted.  And, for learning purposes, I wanted to get this annotation out, before that happened.  Consequently, I continued by saying, The main lesson is, as cplusplus11 puts it, \"You have to be aware of all threats made by your opponent, checks, and captures.\" For example, the reason that you kicked my Queen was because it appeared to gain time since, in general, it would have to retreat. But, there was an immediate threat there. So, that had to be dealt with, beforehand.  No good was 10...Qxg5 because, although it prevents mate, you'd lose your Queen for a Knight. Therefore, the only way to prevent mate without losing your Queen was 10...h6 So, this was forced (hitting my Ng5, as now, I can't mate on h7 since that pawn has moved.) After that, my next move would be 11.Nf3, and after, for example, 11...Nxf3+, 12.Qxf3 it would still be even.  Then, I showed her that position and concluded by saying, the other annotations where I witnessed that example was when you took a R but missed the threat which enabled the opponent to deliver mate. So, remembering the moral on what your opponent is threatening to do, seeing what's happening in that position, and figuring out how to meet that threat will help you improve."
    },
    "url": "https://gameknot.com/annotation.pl/mentoring-game-3?gm=60282",
    "gameName": "Mentoring Game 3",
    "players": "jkarp (1358) vs. reachforgoals (704)",
    "opening": "Petrov three knights game (C42)"
}