{
    "moves": {
        "1. e4 e5 2. Nc3 Nc6 3. Nf3": "As noted, I don't remember what I told her.  But, here I think I said that 3.Bb5 is most common as it's the Ruy Lopez which is why I played.  I was not going to play the Siclian because as I learned, you don't want to get your student too used to that since it's a much more complicated line.  In reality, there's nothing wrong with this move, as I believe Two Nights Opening.  Could be quite wrong with what it is, but that's not the most important.  What matters is how you teach.",
        "3... Nf6": "Now, we have the well known, Four Knights Defense.  And, I will, however, be playing the more common lines as that's good for someone who you train to learn.  It's about how to get used to a certain, and also, what he or she might not be used to.",
        "4. Bb5": "Now, Sue plays it like a Ruy Lopez.  And, I'm impressed with how she's doing, so far.  Worth noting is that, until the next move, I was surprised and thought she played extremely well.  That, however, is about to change, so I became over optimisic, but the thing is that I always like to see and think of the best of my student as it's about the student feeling comfortable and gaining confidence, as time goes on.",
        "4... d5": "Generally, I don't self imposed pins.  But, this is something that my coach frequently does.  And, this is how he does it.  I always ask myself why and can't figure out the logic.  Sure, it develops as it's a central, but why create a pin on yourself.  However, he always does this, so there must be a good reason, and I often find myself later, with a disadvantage.  And, that is something I kept in mind.",
        "5. Nh4": "? Her First mistake.  Don't know why Sue played this.  Actually, while I don't remember what exactly was said, I approximate.  Sure, as noted, I don't have a pictogram, but I have a memory very close to that, and if only things went right into long term memory, then I would have it.  However, what's more important and worth noting is that this is her first mistake.  Let's go back in time, where a N on the rim is, indeed, grim.  First, at that rating, yes it is important to follow most of the general guidelines and not deviate, unless extenuating circumstances, which in a case like that, rarely happen with who you're against.  That is because this move enables me to win a center pawn, and right after an exchange which is liquidation of pieces.  @knightrider62: This is something important to learn, but liquidate=an exchange of pieces when behind.  It is known to give the opponent whose ahead, the advantage because if it should boil to an endgame, it generally boils down to a few pawns and the K.  Now, in general, it only takes one pawn to make the difference between and loss, and if, you've liquidated and exchanged pieces when behind, then you have less to defend with.  That's why, when the opponent is ahead, he or she has an advantage.  It's also important to go back to what I learned from Susan Polgar.  That GM Karpov, who was, at the time, the world champion, lost a game by placing his N on the rim which allowed his opponent to fork his B and N, and consequently, Karpov lost a piece.  So, following the guidelines is very important.  And, as you recently asked me, if your opponent dosen't follow them, and goes for something unsound, the best way is to calmly continue development, and then, you wind up with the advantage.  That, I knew, but was still reviewed with Susan.",
        "5... Nxe4 6. O-O": "?? @knightrider62: The move played is very understandable, but this is one of the times where you had to deviate from the guidelines.  Yes, K safety is important, but protecting the N on h4 takes priority.  It would still result in liquidation, but that's better then what happens.  With that being said, you had to play 6.Nf3, as it was the only way to protect.  Let's look at other possibilities, and possible variations that I'm about to come up with.  You might think that N could've retreated to other squares, but there are only two other outposts, aside from, what I mentioned, as it's limited which is also why that guideline is important.  If you played 6.Nf3 which looks good and safe, black, immediately captures with 6...Bxf5  In addition, 6.Ng6, wouldn't have helped because I'd recapture with 6...fxg6 and forget about my doubled pawns.  Winning a piece is far worse then that.  But, yes, no matter how you look at it, anything else other then 6.Nf3 loses the N, as it did. ",
        "6... Qxh4 7. Nxe4": "White thought that she had won something back, which I understand perfectly, as that's what I thought, even after surpassing 1000.  It took me, until, my rating was between 1050-1100 to remember this.  But, what's important is overload, which is defenders and attacker.  And, I have an extra defender, so now that white took, I immeidately liquidate with my next move.",
        "7... dxe4 8. Re1": "Threatening the e pawn.  But, I think she played this to control the center, as one way of controlling the center is to attack it.",
        "8... Bd7": "Breaking the pin in the most common way, as Jack.  And, one reason I also played this was so that Sue would learn and know what do when you have a pin like this.  As Jack says, it's the most common way to break it.  But, then, there are exception when the B can't go back.  So, what would you do?  The solution would be with ...a6",
        "9. d3": "Want's to exchange.  I would've given this as an inaccuracy because I thought that any exchanges were bad when you're down.  But, as I now know, this only applies when pieces are exchanged.  With pawns, however, it's another story.  With that, I view it as a good move because it develops and now helps control the center allowing room for the DSB.",
        "9... exd3": "Now, I want to know what she's going to do.",
        "10. Bd2": "?! Better was 10.cxd3 or 10.Qxd3 because it's exchanged, right away.  However, I only give this as a small inaccuracy because white can still get that pawn.",
        "10... dxc2 11. Qe2": "? Now, it's a mistake, that pawn is free.  Best was 11.Qxc2 where white recaptures.",
        "11... Bd6": "The idea isn't even castling, but rather, strengthening the B's as they're known to be well placed on d6 and d7.  I know this from studying a training game between steppenwolf and adivela.",
        "12. Rac1": "?? Was worried about a promotion, but there was no need to.  With the R where it originally was, there was no way that I could've promoted that pawn.  However, this is a blunder because of the next move. ",
        "12... Nd4": "The reason behind this is because black wins, yet, another piece with the discovered.  Let's look at one move and variation.  Also possible was 12...e4 with a threat against the K with an immeidate threat.  I didn't play it, however, because I viewed as unsound.  That's because, for me, the reason would be hope chess, and as we know, hope chess is quite bad.  As, I would only play that for mate, and the idea is that we don't want unsound aggression.  So, at that, I predicted that if I played this, my student would respond with 13.h3, in which case, the plan would not work.  But, winning more material, however, I deemed to be real chess as it's imminent.  Note: at the time, I didn't know any of those terms, Hope Chess, Flip Coin Chess, and Real Chess.  As of early May, remembering what C++ said, what I was doing, and where it applied as that was still a weakness, that's when it became second nature.  However, I do not the basics that you don't just do something for mate, as it's unsound.  ",
        "13. a3": "?? I think she played this for the pawn chain.  The idea that you could keep one pawn in front of another, like I did with Mary, until one promotes.  With my R, however, that wasn't possible.  And, this is, so far, the biggest blunder of the entire.  Although, there were some mistakes.  But, this move loses a Q for N, in addition to what's been lost.  For that very reason, the Q had to get out of harm's way.  @Knightrider: What there is to learn here and from other moves is something that C++ said some time ago, which was one of the very few things, that I did remember.  That is, \"Consider all threats made by your opponent, checks, and captures.\"",
        "13... Nxe2+ 14. Bxe2 Ba4": "Adding pressure to the c2 and d1 squares.  This, obviously, protects the pawn.  But, I say obviously because it's not that obvious.  Although I didn't know the term, at the time, the idea being here is overload which is adding the defender.  So, in addition, the way to putting pressure on those squares is with defenders.  BTW, I bring up that term because Susan said that it's important to know terms that I once, was not familar with, until recently.  One of them being overload which I learned from a different annotator.",
        "15. Bf3": "This is the one threat that I overlooked, and I admit that it shouldn't have happened.  Coaches and mentors generally won't overlook threats like that.",
        "15... O-O": "? I was more then interested in K safety and guidelines.  The idea being wasn't just to connect R's, but the, long term, plan was to bring both of my R's on one file as that's known to be dangerous. That's how Jack defeated me, despite, being down a Q, early on.  I kept it in mind, but I now know a weakness, at that, which I'm familiar with, and the same thing happens when playing through GM annotations.  The idea is being able to apply them in your games.  But, you have to know when it's too much as overanalyzing can cause problems.  Just like the tempo I lost in that coaching game, that you saw.  But, a better example was my game against jstevens1, as some of you saw in, \"the jkarp campaign\"  How did I enable the fork.  Well, I saw that Joann's pawn was pinned, so I placed my Q there, as an extra attacker, keeping in mind.  It's mainly because I played through several variations in those GM games where the pawn right near the K is pinned, so the variation included bringing that extra piece in the pin.  The only difference, which was vital, is that there was no safe spot for the K, as this was from a private annotation, which at the time, was my favorite.  But, that's because the opponent didn't develop properly, so that pin would've been an immediate killer.  But, in the game with Joann, the K could move, and when it did, I had to face an awful fork, which as she notes, that's when it all went downhill.  So, the lesson is that, sometimes what you see and play through might not be so good in that particular game.  And, that applies here, with this mistake.  ",
        "16. Bxb7 e4": "However, I'm aware of the threat, and now that I know what's going on, this is where I decide to play that.  The idea being, as I, very recently, learned what it actually called a combo.  I always thought it was gambit, but it's not.  It's a combo where you sac material, sometimes a R or the Q, for something much worse.  That's because a common mistake is to take, as I've made that mistake before.  The idea being that, \"To take is a mistake.\"  I anticipated, and my calculation was that Sue would play 17.Bxa8, in which case, I'd mate very quickly.",
        "17. Re3": "?? But, she doesn't.  However, this is just as much of a blunder as taking.  In fact, I don't know exactly why white played.  But, my guess would be to harrass the Q.  However, this mistake will result in the same thing that would've occurred, if she took.  With that being said, mate is now inevitable.  Better was 17.h3 to prevent the threat, but best was 17.g3 which also prevents mate, but at the same time, gains time, and wins the R, at the same time because I'd have to retreat, and then you take.  After which, white compensates and gets a little of that advantage back.  @knightrider62: Whenever you play a move, you have to ask what's being threatened and where that threat is occuring.  If it's something like, where I threaten the K, then you have to, \"Open Up\"  That means, move the pawn right where the K sits to, \"give it air to breathe.\"  In this case, I wouldn't be able to check.  But usually, they can check, and when they do, you can get out with the K.  With this move, however, there is no way out.",
        "17... Qxh2+ 18. Kf1 Bb5+": "The lessons to learn are consider all threats made by the opponent.",
        "19. Ke1 Qh1#": "So, there was a lot to learn from this game.  The lessons are consider all threats made by the opponent, and follow the guidelines.  In particular, don't leave the N on the rim, unless there is an extenuating circumstance, especially when faced with a threat.  In this case, a discover attack that, like with Kasporov, lost a piece.  @Knightrider62: If you can remember these lessons, you'll improve.  And, I must say that you have become a better player.  Not just by rating, but I looked at a couple of your games, and say that you are getting each time.  Just keep on studying, remember those lessons, and I'm confident that your rating will skyrocket to 1200, sooner then you know it."
    },
    "url": "https://gameknot.com/annotation.pl/mentoring-game?gm=59284",
    "gameName": "Mentoring Game",
    "players": "knightrider62 (775) vs. jkarp (1267)",
    "opening": "Vienna game, Max Lange defence (C25)"
}