{
    "moves": {
        "1. d4": "Hello! I decided to annotate this game, which was a tough one, actually played against a team mate of mine! The team is Yeshua´s Army, one of Gameknot six Christian teams. Anyway, I started with 1. d4, I like to play the Queens Gambit pretty much nowadays. My opponent answered with d5. ",
        "1... d5 2. c4": "c4, the Queens gambit move.",
        "2... e6": "Now is it Queens Gambit Declined, QCD. As far as I have read in the theory books, this move is better than accepting the gambit.",
        "3. cxd5 exd5 4. Nf3": "Just playing standard opening moves.",
        "4... Nf6 5. e3 a6 6. Bd3 c5 7. O-O Nc6": "If I was Black, I had choosen 7... c4 instead with space advantage!",
        "8. dxc5 Bxc5 9. Nc3 O-O": "After we both have castled, it´s even.",
        "10. b3 Bg4 11. Be2 Bxf3 12. Bxf3 Ne7 13. Bb2": "Occupying the a1-h8-diagonal with my DSB. For you that don´t know what this shortening means, it´s the Dark Squared Bishop! Aiming towards the Black King , of course it´s some pieces in the way, but they will sooner or later be removed!",
        "13... Rb8 14. Na4 Qd6 15. Nxc5 Qxc5": "After this last exchange, I have the bishop pair and my opponent two knights. According to the chess theory it´s a small advantage!",
        "16. Bxf6": "Suddenly, I saw that i could exchange my dark squared bishop for one of my opponents knights! Furtrhermore that knight was not protected by any piece, only by a pawn. That means that after my opponent has striked back with his g-pawn, it will appear a hole in the pawn shield in the front of his king! To demolish the pawn shield in front of the enemy king is, as far as i know, a greater advantage than the bishop pair. So I gave the bishop pair up, because of this new, greater advantage. So must you think in chess.",
        "16... gxf6 17. Qd3 f5": "17...f5 was a good move, it somehow defends the Black King from threats alongside the diagonal b1-h7!",
        "18. Rfd1 Rfd8 19. Rd2 b5 20. Rc2 Qd6 21. Rd1 Rd7 22. Qe2": "Trying to replace my pieces in optimal positions. I want to triple on the d-file, with Queen and two Rooks. Furthermore, my light-squared bishop is also aiming against Blacks d5-pawn. that means that Black will be tied up with the defense of that pawn.",
        "22... Qe5 23. Rcd2 Rbd8 24. Rd2d3 Rd7d6 25. Rd1d2 Kg7 26. Qd1": "Finally, I have reached my desired position. But this is not enough, because Black can defend properly. Now it´s time for me to create a new weakness, according to the theory of the two weaknesses, well known in the chess theory!",
        "26... f6": "Blacks position is rather passive.",
        "27. g3 h6 28. Rd3d4 Kh7 29. Bg2 Kg6 30. Qf3": "Now I´m also aiming against Blacks f5-pawn. The theory of the two weaknesses!",
        "30... Kh7 31. Bh3 Rg8 32. Qd1 Rgd8 33. Bg2 Kg6 34. e4": "Maybe not the most innovative move in the position, but I couldn´t find any stronger!",
        "34... fxe4 35. Bxe4+ f5 36. f4": "Gaining a tempo with threat against Blacks Queen. Is also fixing Blacks f5-pawn.",
        "36... Qe6 37. Bg2": "Material it is even, but maybe I have got a small positional advantage here? But it´s not easy to know how to best proceed from here!",
        "37... h5": "? Not a good move, creates another pawn weakness for Black!",
        "38. Re2 Qf7 39. Bf3": "Starting to pressure along the d1-h5 diagonal. ",
        "39... Kh6 40. a4": "The game seems a little bit locked on the kings-side, so therefore I will try to provoke a new pawn weakness for Black on the queens-side!",
        "40... Nc6 41. Rdd2 b4 42. Re3 a5": "The game bears the stamp of slow manuevering, in this stage.",
        "43. Kf2 Ne7 44. Bxh5": "Maybe the breakthrough, at last? I wins a pawn, thanks to this tactics!",
        "44... Qf6 45. Be2 d4 46. Re5": "I´m aiming at both Blacks a- and f-pawns, forcing Black to passively defend. ",
        "46... Nc6 47. Rc5": "Better was b5.",
        "47... d3": "A great tactics by Black here, if I escape with my bishop here, Black will give a check on d4 in the next move and then win my undefended Rook on c5 for free!",
        "48. Rxc6": "I found that this little sacrifice was the only solution! Better than lose a whole Rook anyway!",
        "48... Rxc6 49. Bf3": "Now am I quality under. ",
        "49... Qd4+ 50. Kg2 Rc3": "Now it doesn´t looks so fine out for me! I have got a very passive, crampy game and is also a quality under!",
        "51. Qe1 Rd6 52. g4": "A  pawn move that opens up the diagonal e1-h4 for a counterattack with my Queen.",
        "52... fxg4": "Better was to escape with the King to a safer square!",
        "53. Qh4+": "Now I get a pretty nasty check!",
        "53... Kg7 54. Qe7+ Kh6 55. Be4 Rf6": "He totally missed the checkmate in the next move with Qh7#.",
        "56. Qh7#": "Checkmate! This was a really hard game between two Christian team players. Have tolerance with me if my comments not is of a very high standard, but I have tried to give my opinions about the game, after my best ability!"
    },
    "url": "https://gameknot.com/annotation.pl/metalwarrior1969s-mini-tournament-xxxiii?gm=52573",
    "gameName": "metalwarrior1969's mini-tournament XXXIII",
    "players": "haratta (1650) vs. metalwarrior1969 (1542)",
    "opening": "Queen's gambit declined (D30)"
}