{
    "moves": {
        "1. d4": "Here is an exciting game!  With a major surprise turnaround by black.  I am playing as black against smitya and get into trouble early.",
        "1... d5 2. e3": "Setting up for a Stonewall attack.",
        "2... Nf6 3. c4 c6 4. Nc3 e6 5. c5 g6": "Looking to fianchetto my bishop since he blocked it in with c5.",
        "6. Nf3 Bg7 7. Ne5": "White takes the strong e5 square with his knight very early!",
        "7... O-O 8. f4 b6 9. b4 b5": "Looks like this game will be closed up and a long arduous task to position ourselves...",
        "10. Be2 Nbd7 11. Nxc6": "Oops!  I give my pawn to black.  This is not good!",
        "11... Qc7 12. Ne7+ Kh8 13. Nxb5": "He takes another pawn that is now weakened and attacks my queen!",
        "13... Qb7": "Qb7 anything else and my queen is fried!  \n13....Qd8 14.Nc6 Qe8 15. Nc7 forking my queen and rook, with nowhere for her to go.  \n13....Qb8 14.Nc6 Qb8 I guess I did have another option, however I did not see that I could take the knight on c6 after 15.Nd6.",
        "14. a3 Ne4": "I need space, and can't trade anything right now.",
        "15. c6 Qb6 16. c7": "That pawn starts to get at my nerves.",
        "16... Bf6": "That knight has nowhere to go without recapture on c8.  I like my rook behind the advanced pawn.",
        "17. Nxc8 Raxc8 18. Qc2": "Reinforcing the pawn?",
        "18... a6": "Take away the defender of the c pawn.",
        "19. Qa4": "???  He still loses the knight!",
        "19... axb5 20. Bxb5": "Now the c pawn has no defenders!",
        "20... Qxc7 21. Bxd7": "I think this is the losing move for white...",
        "21... Qc3+": "Forking king and rook!  But I see more to this.  It is not game over, but white's situation is dire.",
        "22. Kd1": "This move truly loses it for white.  Mate in 4.",
        "22... Qd3+ 23. Ke1": "Forced",
        "23... Rxc1+": "Capture or block it doesn't matter, capturing just extends by a turn.",
        "24. Qd1 Qxd1#": "Very fun game!  Thanks Smitya!"
    },
    "url": "https://gameknot.com/annotation.pl/metalwarrior1969s-mini-tournament-3-13-2013?gm=49436",
    "gameName": "metalwarrior1969's mini-tournament 3/13/2013",
    "players": "smitya (1403) vs. baumannjoe (1262)",
    "opening": "Queen's pawn (D00), stonewall attack"
}