{
    "moves": {
        "1. e4": "An exciting game from Gameknot's 80th tournament. After Black launches an assault on White very early on, White is able to storm back after a couple of errors in Black's attack gives White the advantage in position and material... though he soon gives up that material advantage in favour of what he hoped to be a winning positional strike. It doesn't quite work out that way... well, it shouldn't have worked out that way, but it did!\n",
        "1... c5": "http://gameknot.com/analyze-board.pl?bd=15699296&rnd=0.2643783134408295 <-- GK analysis\n",
        "2. Nf3 Nc6 3. d4 cxd4 4. Nxd4 e6": "Normal Sicilian play so far, but still, this move (though book according to analysis) is a new one for me\n",
        "5. Nc3 Nf6 6. f4": "A standard Sicilian move from White - an early kingside pawn advancement is in order here!\n",
        "6... d6 7. Bc4 Be7 8. Be3 O-O": "Again, all standard stuff. I was feeling a little reckless at this point though, and decided to try something new...\n",
        "9. g4": "? It will most definitely not be a move that I'll play again, though! White goes for a kingside pawn storm that comes way too early, and Black is quick to exploit that!\n",
        "9... Nxd4": "But first, the exchange!\n",
        "10. Bxd4 e5": "! The key move - as well as hitting the d4 bishop, it discovers a second attacker on the pawn that I have just pushed forward.\n",
        "11. fxe5": "To avoid losing a pawn, the following sequence is pretty much forced.\n",
        "11... dxe5 12. Bxe5 Nxg4": "...but it seriously exposes White's position!\n",
        "13. Qxd8": "White recognises that he's exposed and exchanges queens - I wonder whether Bg3 was better, followed by Qd3 and 0-0-0 - probably not, since that isn't taking into account what Black's moves would be!\n",
        "13... Rxd8": "Since the king would move over a checked square, castling seems even more unlikely now!\n",
        "14. Bf4": "The bishop was threatened, but as I mentioned earlier, it might have been better to move it back to the g3 square...\n",
        "14... Bh4+": "...because of this check!\n",
        "15. Ke2": "I don't really know why I didn't block the check now, but GK analysis didn't see anything wrong with this move!\n",
        "15... Nf2": "Attacking the rook...\n",
        "16. Rhg1": "?! ...and moving away from the danger - but to the wrong square? Rf1 was preferred with analysis due to Nh3 - a double attack on the rook and bishop - and Black keeps up the pressure!\n",
        "16... Bg4+": "Black plays this check instead, and though it looks perfectly natural apparently it threw away the advantage that Black had...\n",
        "17. Ke3": "...leading to GK analysis judging this position to have equal chances for both sides! (well, 0.08 to White but that's negligible!) That's pretty crazy given the Black pieces invading kingside!\n",
        "17... Bh5": "Not really sure what this was actually meant to do, but it provides White with a great opportunity to rid my weak kingside of invading pieces...\n",
        "18. Bg5": "...like this! By forking the rook and the undefended bishop, Bxg4+, followed by a knight check on g4 or d1 is pretty much forced!\n",
        "18... Ng4+": "? Wrong order! This allows a rook exchange for two pieces - materially advantageous for White!\n",
        "19. Rxg4 Bxg4 20. Bxh4": "As well as gaining the material advantage, White now has the bishop pair on the open board - the advantage is definitely his!\n",
        "20... Rd6": "Black has control of the d-file, so he looks to make the most of that advantage\n",
        "21. Rg1": "Meanwhile,White issues a threat to the g4 bishop. The only realistic squares for the bishop is e6, d7 and c8, the last two interfering with rook communication. \n",
        "21... h5": "Black opts to defend the bishop...\n",
        "22. Rf1": "...so White targets f7 instead!\n",
        "22... Be6": "Black doesn't want to assign his rook to defensive duties, and the pawn is pinned so it can't move, so Black chooses the bishop block...\n",
        "23. Bxe6": "...and White exchanges. I didn't really want to give up the bishop pair, but there were three reasons for this; 1) I was ahead in material 2) any other square for the bishop didn't look like a good square in my view - but perhaps that's just me! 3) If the bishop moved, I would have to do something about my knight being confined to protecting a2 - just a minor reason though because of b3.\n",
        "23... Rxe6 24. Nd5": "knight centralisation...\n",
        "24... Rae8": "...and Black piles on the pressure on my isolated e4 pawn!\n",
        "25. Rf4": "Forced [White doesn't want to waste tempo by retreating the knight to the original square]. A rook having to defend along a row like this looks pretty ugly beyond the second rank, especially when there are only two squares on said row, but it's a solid defence thanks to my h4 bishop defending g5\n",
        "25... Rd6": "Black switches his attention to my knight, which is currently in danger due to the pin on e4...\n",
        "26. Be7": "!? I was feeling a little reckless with this move! :) White is aware that he's giving back the material he won earlier but also realises that he gets a passed pawn out of it! Sure, Black does too on the f file but White's passed pawn is more advanced!\n",
        "26... Rxd5": "Black follows through with getting his material back with the same 'rook for two pieces' trick that I used earlier!\n",
        "27. exd5 Rxe7+ 28. Kf2": "There were two reasons behind this king move;  1) The king is set to halt any advance by the f-pawn should Black want to do something with it 2) White doesn't want a rook intrusion on the second rank\n",
        "28... g6": "Black bolsters his h5 pawn - just in case!\n",
        "29. c4": "White wants support for the d-pawn, but the rook alone won't do that - this is the first step of a fairly long sequence that makes the pawn all the more powerful!\n",
        "29... Kf8": "While I do that, Black looks to get his king in the action!\n",
        "30. c5 Ke8 31. a4": "Can you see where the a-pawn is headed? :)\n",
        "31... f5": "Black relieves the king and rook of protective duties on f7.\n",
        "32. a5 Kd7 33. a6": "! Completing White's plan - now no matter what Black does here, White gets two connected passed pawns on the c and d files!\n",
        "33... bxa6": "Or 33...b6 34.c6+\n",
        "34. Ra4": "I was focusing on how best to advance either my c pawn or d pawn (perhaps not the best plan to begin with) but, finding no good way to do that, tried something different instead. There's no way to defend a6...\n",
        "34... Re5": "! So Black creates a counter-threat! White's e5 pawn has more value than the a6 pawn!\n",
        "35. c6+": "?! White plans to defend d4, of course, but instead pushes forward with tempo. Is it the right thing to do? According to GK analysis, it wasn't!\n",
        "35... Kc7": "If Kd6, then White would move his rook to c4 with the very real threat of c7. This king move keeps my pawns in check.\n",
        "36. Rd4 Kd6 37. h4": "White could have tried Rc5 now, but instead he decides to defend a little kingside. This position according to analysis is pretty much drawn, with neither side having an effective use for their pawns\n",
        "37... a5 38. b3": "Preventing a push to a4 - Black only has a6 before he is out of valid pawn moves!\n",
        "38... Re8": "Rook moves are okay, though!\n",
        "39. Kf3": "White is heading for g6, his king being the most active piece right now\n",
        "39... Kc5": "Black moves his own king, chasing away my rook. He uses the rook diversion a little later on...\n",
        "40. Rd3 Kd6 41. Kf4 Re4+": "...like this!\n",
        "42. Kg3": "White protects the h-pawn - I could have played Kg5 instead of this, though, not fearing Black's next move\n",
        "42... Rg4+": "Black checks again with his rook...\n",
        "43. Kh3": "In this position, Black has one forced move to stay in the game...\n",
        "43... a4": "?? And this isn't it! Black looks to create a passed pawn on the a-file, creating some counterplay of his own, but greatly underestimates the strength that my passed pawns have! Re4 was the only move for Black here!\n",
        "44. Rc3": "! White's c-pawn is going to promote, and there is nothing Black can do to stop it!\n",
        "44... axb3": "? Black is lost anyway, but this makes things easier for me - 44...Re4 45.c7 Re8 46.c8=Q Rxc8 47.Rxc8 is the only way to go, though White is winning after that! Black promotes a queen with this line...\n",
        "45. c7 b2 46. c8=Q b1=Q": "...and if it was his turn to move, then Qh1# would win. However...\n",
        "47. Qe6#": "White has an equally destructive move! It is a little funny how the game ends with queens on the board when they had been absent since move 13! :)\n"
    },
    "url": "https://gameknot.com/annotation.pl/middlegame-pressure-endgame-risk?gm=38499",
    "gameName": "Middlegame pressure, Endgame risk!",
    "players": "x-machine (1635) vs. sigidi (1722)",
    "opening": "Sicilian (B32), Flohr variation"
}