{
    "moves": {
        "1. b3 e5 2. Bb2 Nc6 3. e4 Nf6 4. d3 d5 5. exd5 Nxd5 6. Be2 Bc5 7. h3 O-O 8. Nf3 Re8 9. Nbd2 Nf4 10. O-O Bf5 11. Re1 Bxh3": "if gxh3 then 13...Nxh3  followed by capturing the f2 pawn.Black would have 3 pawns for the piece which it apprears would be enough compensation .",
        "12. g3 Ng6 13. Ne4 Bf8 14. Nh2 Bf5 15. a3 Nd4 16. c3 Nxe2+": "Black is hoping to take advantage of the light colored squares.The question will be was it worth it to have control of the light squares in exchange for a centralized knight taking off a relatively inactive bishop?",
        "17. Rxe2 Qd7 18. b4 Rad8": "In this position black is taking aim at the backward pawn putting pressure on the d file",
        "19. Rd2 Bxe4": "The knight was defending the d2 square.It appears that white has lost a piece.on 19.d4 black would have played exd4 attacking the knight on e4.",
        "20. d4 exd4": "I wanted to play Qh3 here but I think f3 could cause black some problems.Now if rook takes on d4 Qh3 would be strong.If 21. cxd4 black will have to come up with another plan possibly Bd5 to keep the bishop on the h1-a8 diagonal",
        "21. cxd4 Bd5 22. f3 Re3 23. Qf1": "since the d file is closed black transfers operations to the e file.Black also hopes to take advantage of the weak g3 square.The f3 square may also be a target for attack.Black also has to find a way to activate the knight on g6",
        "23... Rde8 24. Rdd1 Bd6": "Black is trying to introduce another piece into the attack.",
        "25. Rde1 Bxg3 26. Rxe3 Bxh2+": "Trying to eliminate a defensive piece.Black hopes to pressure the f3 square after taking the rook.f4 is a potentially good square for the knight",
        "27. Kf2 Bg3+ 28. Kg1 Rxe3": "Bearing down on the f3 square",
        "29. Qg2 Rxf3": ""
    },
    "url": "https://gameknot.com/annotation.pl/mindfields?gm=7926",
    "gameName": "Mindfields",
    "players": "mrcolnago (1395) vs. soulpower74 (1685)",
    "opening": "Nimzovich-Larsen attack (A01), modern variation"
}