{
    "moves": {
        "1. d4": "Hey hey all. Another d4 opener that i desperately hate. but this game i took advice from one of you who annotated my last game and had a much more easier and enjoyable game.",
        "1... e6": "i stick with the e6 that i like to open with ",
        "2. e4": "and once again im faced with d4.  last time i had tried c5 and it gave a weird game. i was suggested to play d5 and decided to give it a try, I already find myself in uncharted territory on move 2 but we will deal with the flow and see what happens",
        "2... d5 3. e5": "my opponent pushes by. I dont know why i thought he would go exd5 and open up the board. but pushing by makes me feel like this opponent is more experienced. i decide to check his profile out and his 22-10 damn good starting record i have to watch myself this game it seems!",
        "3... c5": "i dont know if this is a good reply but it felt right to maybe undermine his middle pawn and deploy my DSB if he takes",
        "4. Bb5+": "he decides to take his LSB out with a check i will just reply by saying ",
        "4... Bd7": "lets take our LSB's off the board!",
        "5. Bxd7+": "and he accepts",
        "5... Qxd7": "felt like retaking with the queen was more appropriate i wanted my knight on c6 having already played c5",
        "6. c3": "hmm unanticipated reply. i like these kinds of games not too aggressive. Some set up for a nice mid game with some thought. Instead of straight forward swap outs with the most aggressive replies.",
        "6... Nc6": "decide to finally develop a piece. one of us has too! and he doesnt bite on letting my DSB out",
        "7. Be3": "after he played this i realised that our LSB's are off the board and pushing my pawn forward seems so much stronger than doing some exchanges in the middle.  if he tries some queen side pushing i can just set up on a6 and b5 and have entire pawns on white squares.",
        "7... c4": "and so i decide to go for a control of the white squares. since all his pawns are on dark squares i thought it greatly added value to my bishop over his and would allow ten times more mobility",
        "8. Nf3": "he further develops planning for a king side castle i can see. i decide im going to queen side castle at this stage and just move my pawns up left side of the board and see what develops",
        "8... h6": "i play this as to restrain his knight and bishop my castle can wait 1 more turn he cannot interupt it immediately",
        "9. h3": "hmmm this reply i thought to be curious and made me think he wouldnt king side castle. I thought he was trying to formulate some sort of counter play king side. i saw it as a non threat as im going to be pushing that side. Especially since i was planning to go ne7 not nf6 so the pawn wouldnt help against my knight",
        "9... O-O-O": "queen side castle!",
        "10. O-O": "im surprised he still decided to king side castle after playing h3 but this really delighted me",
        "10... f5": "i tempted him with an en passant instead of f6,   i thought he wouldnt take, and it goes with my plan of having all pawns on white squares. and to help push the g pawn",
        "11. Nbd2": "hmm i really liked this move hes giving very little breathing room to his knight on the f3 square and i will be coming up to pressure him",
        "11... g5": "more pawn development. i dont know if all these pawns are weakening but they seemed to the point having a good developed game.  yes my DSB and Gknight are still unmoved but are well aligned with the fray and my bishop cant really go anywhere right side except e7 but i was saving that square for my knight.",
        "12. Nb1": "after this reply it made me realise he thought i was going for his DSB lol silly me i wasnt even looking for that and i mightve missed it i was heading for g4 lol, but then i could count it as a time gain for what i was going for and saw an oppurtunity to get my dsb in play for some type of swindle,",
        "12... Be7": "so i temporarily take my knights e7 square",
        "13. b3": "oh wow unanticipated time gain i calculated my things a second time and it looked like a go witout having to reply to that",
        "13... g4": "g4! let the games begin",
        "14. hxg4 fxg4 15. Ne1": "ooo not the d or H files what a surprise.  at this stage of the game i didnt see it serves better to protect the g2 square though",
        "15... Bg5": "i saw that this would leave some hanging pawns that i would hope he would start eating as time gainers but i also saw it as the only way to connect my rooks with an open board to his king in a quick pace. ",
        "16. Bxg5": "and so he takes!",
        "16... hxg5 17. Qxg4": "chomp chomp 1 pawn down will he eat more!",
        "17... Qh7 18. f3": "ooo sees the threat coming will it be enough though!",
        "18... Nge7": "ne7 hahaha! it was never nf6 buddy! nor was it ever going to be Qh1+ without having the knight on f5",
        "19. Qxe6+": "ouch wtf! i thought he was going to go Qxg5. i had more hanging pawns than i thought, hmm lets see what he does on his time gain",
        "19... Kb8": "scoot scoot",
        "20. Kf2": "hmmm trying to run that king away. i dont think hes going to have enough time whats this omg i see something i dont think he will see coming!",
        "20... Nf5": "boom! look at that Minefield his queen finds himself in lol! his Qxe6 really surprised me but now i knew he wouldnt move his queen and all i needed to do was to kick his king to e2 with Qh4 check,  my opponent left for the night. i tried to anticipate his moves. the only one that saves his queen is nc2 but then he loses the cover he has on the g2 square. i dont know what his best reply was.  i was looking maybe hes going to go bxc4 or nd2 is what i thought the most",
        "21. Ke2": "WHAT!!!!!!!!!!! a dream come true unanticpated SURPRISE not reply, but i think this fork was really veiled cause of that pawn line. and its right smack in the middle off it",
        "21... Ncxd4+": "my opponent never saw this coming or that king wouldve never went to e2",
        "22. cxd4": "the only small compensation he will get for his Q and 2 pawns ouch  i got my 2 pawns back i guess! knight for queen",
        "22... Nxd4+ 23. Kd2 Nxe6 24. Nc3": "hes now trying to reconnect his rooks. i respected my opponent for staying many times when an opponents queen finds itself forked. pun intended >< the resignation soon follows",
        "24... Nd4": "i decide to bring my knight back into action since he hadnt played nc2",
        "25. Nc2": "oops this was another blunder. i think my opponent was discombobulated after his queen had fallen but this made it Mate in 6. i created a puzzle from this position ><",
        "25... Qxc2+": "not much he can do his second knight drops and hes can move 5 more times all to checks into a checkmate, my opponent resigned after this move.    maybe he also had lost sight of my queens angle trying to focus mid board and on his rooks. i hope you enjoyed the development i had and nice little end game trap in the pawn line, as for me another 60/30 opponent beaten. but i have lost 4-5 in the passed few days stagnating around 1500 elo for a week. i hope i dont do many more blunders.   Thank you for the d5 suggestion on move 2 i really do read the comments on my annotations to help better my game thanks all again! comments appreciated as always"
    },
    "url": "https://gameknot.com/annotation.pl/minefield-and-sneaky-fork-nice-battle-comments-appreciated?gm=58826",
    "gameName": "Minefield and sneaky fork! nice battle, comments appreciated!",
    "players": "africanhunter (1386) vs. trixstermtl (1487)",
    "opening": "Queen's pawn (A40)"
}