{
    "moves": {
        "1. e4": "my typical opening.",
        "1... e5 2. Bc4 a6 3. Qf3": "going for the quick checkmate.....can always still develop with Nb3 if plan A fails.",
        "3... Nf6": "blocks with the Knight...this is the typical way to stop QxP (checkmate)",
        "4. Qf5": "Attempting to take the pawn at e5",
        "4... Nc6": "Hopewell blocks by moving out his other knight.  This is also a good move because he continues to develop his pieces...and he can move the knight to d4 to threaten my queen.",
        "5. Nf3": "I pose a double threat on the pawn and also prevent knight to d4 without causing a knight exchange.",
        "5... d5": "EXCELLENT MOVE by Hopewell!  This move threatens my queen with his bishop (revealed check) and threatens my bishop at the same time.  This is going to cost me a three point lead and a major piece.  Hard to swallow--but I must move the queen...and lose the bishop. ",
        "6. Qg5 h6": "he doesn't feel the need to take my bishop right away--and forces my queen back farther first.",
        "7. Qe3 dxc4": "down 3 points and position....my situation is not looking as well....he opened his queen rank as well for an attack.  He has control of this game.",
        "8. Nc3": "trying to develop some before the attack comes in.  The best offense is a good defense.",
        "8... Nd4": "threatens my c2 pawn--which would split my king, queen, and rook in one shot.",
        "9. Kd1": "protected the pawn, but lost my ability to castle with this move.  Another good play by hopewell.",
        "9... Nxf3": "knight exchange.",
        "10. gxf3 Qd4": "his attack continues to develop--his queen now controls center and protects the loose pawn on c4.",
        "11. Qxd4": "queen exchange--I was thinking I needed to clear out some space.",
        "11... exd4 12. Ne2 d3 13. cxd3 cxd3": "still threatening my knight--but more importantly locking my king in.  This pawn is in a very threatening and annoying place right now for me.  Hopewell continues to thrive.",
        "14. Nc3 Bb4": "threatens to exchange another lesser piece in attempt to gain positioning and advance his pawn.",
        "15. b3 Bxc3 16. dxc3 O-O": "Hopewell castles to give rook support to his pawn which has already moved almost all the way across the board and we are only on move 16!",
        "17. Bb2": "attempting to clear a space for my rooks to move in--but I have a bigger plan then that--Rg1, Pc4, BxN or if his knight moves RxP to create a slide.",
        "17... Nd7": "He moves his knight obviously not seeing what is to come, I move the rook first trying to be conspicuous.",
        "18. Rg1 Ne5": "whoops.",
        "19. c4": "now I threaten his knight and have the developed \"slide\" right behind it. However, by moving Ng6--he can still salvage this position.",
        "19... Nxf3": "instead he attempts to threaten my rook and move his pawn to d2.  He didn't see the position I am now in until it was too late!",
        "20. Rxg7+": "RxP!",
        "20... Kh8": "only one spot to move.",
        "21. Rxf7+": "RxP! check.",
        "21... Kg8": "once again, he only has one spot to move. I'm down by 2 now.",
        "22. Rg7+": "check.",
        "22... Kh8 23. Rxc7+": "I'm down by one--he has no escape from my attack.",
        "23... Kg8 24. Rg7+": "check again.",
        "24... Kh8 25. Rxb7+": "even.",
        "25... Kg8 26. Rg7+": "where should I go now....my rook has free reign to move the board.",
        "26... Kh8 27. Ra7+ Kg8 28. Rxa8": "I end my attack with RxR and I now have a 5 point lead.",
        "28... Nxh2": "he frees the rook to take my pawn at f2.",
        "29. Kd2 Rd8": "interestingly he doesn't take the pawn, but decides to protect his pawn with his rook.  Probably a better move.",
        "30. Bf6": "I threaten his rook....If he moves it away from the bishop, I have the bishop and check.....if he retreats from the pawn, I will have the pawn.  Either way, he is in a worse position than when he started.",
        "30... Nf3+": "check....good move.",
        "31. Ke3 Rf8": "a bishop for a bishop?",
        "32. e5": "I protect my bishop.",
        "32... Bg4": "he protects his and now, if I take his rook--it will just be an exchange.",
        "33. Rxf8+ Kxf8 34. Kf4": "threatening the piece that protects his knight.  It is generally a good idea to move your king between pieces that are protecting each other.",
        "34... h5": "He protects the bishop and prevents my attack from working.  He also advances a pawn that could become a queen sometime soon.",
        "35. c5 d2": "I advance a pawn as does he.....",
        "36. Ke3": "this move was to threaten the pawn's currently location making it impossible for him to move the knight and bring the pawn all the way across.  My rook guards the pawn from making it right now.",
        "36... Nxe5": "He made a pawn exchange hoping that I would take his knight and not realize he was going to cross with the pawn (now protected by the bishop).  Hopewell holds on.",
        "37. Kxd2": "I take the pawn exchange.",
        "37... Nc6": "and he retreats with the knight--blocking off my c pawn.",
        "38. Re1 Kf7": "threatens my bishop. Hopewell continues to try to regain ground.",
        "39. Bh4": "I block off his h pawn.",
        "39... Be6 40. Kc3 a5 41. a3 Bd5 42. Rd1": "nothing changes for awhile...the game continues....",
        "42... Ke6 43. b4": "here I threatened the pawn on a5.  Since this is 1 of 2 remaining pawns, and he can't checkmate with a knight/bishop combination, he will have to either move a4 or defend his h pawn and get a queen.",
        "43... axb4+": "he choses to exchange...the h pawn now becomes crucial for black's survival.",
        "44. axb4 Ne5 45. Re1": "I attempted to pin his knight and then attack with my bishop on g3.",
        "45... Kf5": "it didn't work.",
        "46. Bg3": "I still am attempting an exchange since I am up in pieces.  This time, if RxN--then he will also lose the bishop on d5.  A strong move by white, as least so it seemed.",
        "46... Nf3": "until he moved his knight and threatened my rook.",
        "47. Re3 Kg4": "double protection on the knight....the knight will play an important role in moving black's h pawn across.",
        "48. b5": "I am trying to get a queen as well....but his bishop stands in the way at d5.  I hope to move c6 and have protection so I can continue to cross.",
        "48... h4 49. Bd6 h3": "he continues to proceed with his pawn....I plan to exchange with my bishop once he reaches h2.",
        "50. c6": "I continue to move my pawn forward hoping to get a queen.",
        "50... h2": "somewhere along the line, I forgot that I was going to exchange...and made a really bad move! ):",
        "51. Rxf3": "I tried to remove protection first and he got his queen!  And a 1 point lead.",
        "51... h1=Q": "I have to move the rook to escape his attack.",
        "52. Rg3+": "so I put him in check...double protecting my rook with a pawn and a bishop.  The goal here was to keep all my pieces protecting each other so that the queen can't pick them off.  This move put the king in check and did just that.",
        "52... Kf5 53. c7": "one more space--and I've got a queen too.",
        "53... Qc1+": "Check!  He won't let me make it!",
        "54. Kb4 Qb1+": "check again--black's best bet is to keep me in check hoping to pick off pieces...we can see both sides of this situation being played out--there are two specific goals in mind--mine is to defend my remaining pieces, his is to attack and pick off my pieces.  May the best man win!",
        "55. Kc5": "I'm trying to hide behind my pawns now...",
        "55... Bb7": "he moves the bishop to prevent my pawn from crossing to the other side.  This is actually a good move....I'm stilted because I am out in the middle of the board....he can attack with the queen easily.",
        "56. Re3": "this move made Re5 possible which would be check and give me a little more protection for my king....however, my pawn on f2 is now weak.",
        "56... Qc2+": "check......if I moved to b4--it would have been game....his bishop and queen are too powerful--the best bet is b6 (behind my pieces).  However, I block off my pawn by doing so.",
        "57. Kb6": "I threaten his bishop.",
        "57... Bc8": "he moves to block off my pawn--hopewell still has the upper hand.",
        "58. Re8": "Re8!!!!!!!!!  This was one of my best moves in the game....he is either forced to loose the bishop or move it and allow me to queen my piece.  The best thing to do was probably Be6.  If I proceeded with my pawn in this case, he would have had the c8 spot double protected.",
        "58... Qxf2+": "who says I would have moved my pawn in that  case--probably would have moved the king to b7 first.  Anyway, it doesn't matter because hopewell hopes that by putting me in check he can postpone or escape this dilemma.  He has noticed that my rook on e8 is no longer protected. Neither is the bishop on d6.",
        "59. Bc5": "Bc5!!!!!  Suddenly he is in trouble.  The queen is threatened as well as his bishop and he can't put me in check.  He is forced to move the queen and his bishop is mine.  I now have a 1 pt lead.",
        "59... Qh4 60. Rxc8": "and he has only a queen and king to play with.",
        "60... Qh6+": "check...trying to split my pieces again.",
        "61. Kb7": "I hide behind my pawns--once again, he is not able to check me....and I'm set for my next attack.",
        "61... Qe6": "this seemed like a logical move....he needed to get closer.",
        "62. Rf8+": "Rf8!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!  This amazing move puts his king in check and allows me to move forward my pawn for a queen the next move!!!  This double-edged move gives the full advantage back to me.",
        "62... Kg6 63. c8=Q": "I know have a queen, rock, bishop--and a 9 pt lead!",
        "63... Qe4+": "check...he tries to keep the queen in motion still hoping to pick off pieces.",
        "64. Qc6+": "Qc6!!!!!!!!!!!!!!!!!!! Check and the queen if he chooses to move his king.  However, if he chooses to take with the queen--he is not standing alone with his king...I still have a bishop, rook, and pawn.  He is in a very bad position....",
        "64... Kg5": "he doesn't protect the queen.....the best move here would have been the exchange....I think he realizes whatever the case, it is a lost cause.  The best he can hope for now is a draw.",
        "65. Qxe4 Kh5 66. Qg2": "one move away from checkmate.  All good things must come to an end. And he resigns."
    },
    "url": "https://gameknot.com/annotation.pl/mini-tournament-point-seekers-3?gm=6033",
    "gameName": "Mini-Tournament Point Seekers #3",
    "players": "nathanman22 (1361) vs. hopewell (1312)",
    "opening": "Bishop's opening (C23)"
}