{
    "moves": {
        "1. e4 e5 2. f4 exf4": "The King's Gambit accepted.",
        "3. Nf3": "Kings knight variation. I mostly play this variation, but since the purchase of Thomas Johansson's 'The Fascinating King's Gambit' I'm starting to play the King's Bishop variation too.",
        "3... Be7": "An odd move, black's obviously going for the check on h4. Sure, it stops me from castling, but i think this line gives white too much of a free hand. Most common (and better) are 3..d6 3..d5 and 3..g5",
        "4. Bc4": "I could stop the check with 4.h4, but i decide to go for a no-nonsense aproach with Bc4; developing the bishop to its best square, and by threatening to castle, i'm provoking black into continuing with his 'plan'.",
        "4... Bh4+ 5. Kf1": "i could've taken on h4, but i decide that the bishop on h4 would have to move again wasting another tempo for black.",
        "5... Nh6": "The knight doesn't look good on h6, but its the only place it can go without leaving the bishop on h4 hanging. Better would've been d6.",
        "6. d4": "If black doesn't want the centre then i'll be too happy to take it for him, in doing so I gain a tempo in threatening to take on f4.",
        "6... Bg5": "Another Bishop move! ",
        "7. Nc3": "7.h4 would kick the bishop around further and thus allowing me to take on f4. But Nc3 seems the more natural move. ",
        "7... O-O 8. Nxg5 Qxg5 9. Nd5": "Kicking the Queen around.",
        "9... Qd8 10. Bxf4": "Regaining my invested pawn with another gain of tempo in attacking c7 (and the Rook on a8)",
        "10... d6 11. Qd2": "Gaining yet another tempo, boy, is that Knight on h6 looking silly now.",
        "11... c6": "The only challenging move (but still not a good one), taking on h6 would now be a mistake for white since after black takes on d5 he also attacks the bishop on c4 leaving black to sweep up the bishop on h6.\r\n",
        "12. Bg5": "After a long stint of thought i spot a combination which takes advantage of blacks exposed Queen and badly placed Knight.",
        "12... Qd7 13. Nf6+": "A good move. It wins a pawn by force. After the g pawn takes the Knight blacks own Knight on h6 is hanging, and the King is in grave danger.",
        "13... gxf6 14. Bxf6": "Threatening mate and the Knight, the point of the sacrafice.",
        "14... Qg4": "The only move.",
        "15. Qxh6 Nd7": "Attacking the Bishop (and effectively stopping White's threat of mate).",
        "16. h3 Qxe4": "A horrific mistake, the loosing move allowing a mate in one. ...Qg6 and black would've survived to fight another day, but even then it still looks bad as white has a substantial lead in development and a pawn to the good. But anything's better than this.",
        "17. Qg7#": "An enjoyable game for me, in which two dodgey moves by black in the opening give white a free hand and an initiative. My efforts crowned by a brilliant combination based on the Nf6 sac."
    },
    "url": "https://gameknot.com/annotation.pl/miniture-in-the-kings-gambit?gm=25798",
    "gameName": "Miniture in the King's Gambit",
    "players": "norfolknight (1675) vs. donutley (1395)",
    "opening": "KGA (C35), Cunningham, Bertin gambit"
}