{
    "moves": {
        "1. d4": "Hi all. Here is a game - my first on GameKnot's new Slow Ladder - in which, thanks mainly to some less-than-accurate opening play on the part of my opponent, I launched a successful minor piece attack early in the game. As per the Ladder challenge rules (challenger plays Black, defender plays White) I had the White pieces, and I open with my usual queen pawn.",
        "1... e6": "This is a transposing move, often seen played by Black. It is very flexible: after 2.c4, Black can transpose into a Nimzo-Indian with 2...Nf6, a Queen's Gambit Declined with 2...d5, a Benoni with 2...c5, or even a Dutch Defence with 2...f5. The main drawback is that it fails to take a hold of the e4-square, so White is not prevented from placing two pawns in the centre.",
        "2. e4": "Transposing back into a French Defence position. Black's most common move now is to follow up with the key French move 2...d5, striking back at White's centre.",
        "2... c5": "Instead, Black strikes from the wing, assaulting White's d-pawn rather than the e-pawn. This may transpose back into a main line French Defence position though.",
        "3. Nf3 d6": "I am not entirely convinced by Black's opening play. This seems now to have transposed into a sort of Open Sicilian variation - not great for me, as I have no experience with Sicilian lines. However, Black has not yet exchanged pawns on d4. I feel that Black's play is too conservative here.",
        "4. dxc5 dxc5 5. Qxd8+ Kxd8 6. Bc4": "I stop Black from castling with this queen exchange, and take a lead in development. My light-squared bishop is now on a strong square, and cannot be chased away with ...d5 since Black's d-pawn no longer exists!",
        "6... Nd7": "Developing a knight, but I cannot help but think that it would have been better-placed on c6. On d7. the knight controls less central space, and also blocks Black's light-squared bishop. I couldn't think why Black had not played 6...Nc6.",
        "7. Bf4": "I continued with my plan - develop quickly, control powerful diagonals into Black's position (such as this f4-b8 diagonal) and build up a space advantage.",
        "7... a5": "(?) I feel that Black should definitely be developing here; I can see no possible benefits of 7...a5. Perhaps ...a6 followed by ...b5 and a queenside expansion with tempo, but then only when Black is more developed.",
        "8. Nc3 b6": "Black hands me the weak b5-square on a silver platter. Time to place a very powerful outpost on it. I think that you can already see my attack forming.",
        "9. Bb5": "If Black challenges my outpost with 9...Ba6, my knight is waiting to take up the reins - no pun intended - of the b5-outpost. Black decides not to...",
        "9... Ndf6": "...and moves an already developed piece again. Surely 9...Ngf6 would have been much, much better! I think Black needs to develop his understanding of opening principles here.",
        "10. Ne5": "Leaping into the attack. 10...Ke7 is Black's only way of preventing a knight fork on f7, winning the exchange (I had no high hopes of my knight escaping).",
        "10... Ke7 11. O-O-O": "Bringing a rook in to help with the attack, and hold Black's king down. 11.Rd1 also works.",
        "11... Ra7": "Allowing an easy fork on c6, winning the rook.",
        "12. Nc6+ Ke8 13. Nxa7+ Bd7": "I had been hoping for 13...Ke7 14.Nxc8#. Never mind, I still have a clear win.",
        "14. Bxd7+ Ke7": "Black's final, and still incomprehensible, error. Why doesn't he just recapture with the knight? Never mind...",
        "15. Nc6#": "A neat denouement to my winning minor piece attack. I can feel quite proud of myself for this win...however, I still remind myself that it was more my opponent who lost, than me who won. I would be interested to see viewers' comments!"
    },
    "url": "https://gameknot.com/annotation.pl/minor-piece-mate?gm=24997",
    "gameName": "Minor Piece Mate",
    "players": "fatcat2 (1446) vs. tootsmel (1131)",
    "opening": "Queen's pawn (A40)"
}