{
    "moves": {
        "1. e4": "Hi Everyone!\n\nI have some really mixed emotions here!  On the one hand, I am chuffed to gain parity with my on the board nemesis in chief, Freddy the Master Mater, on the other, I somehow feel I could have got even more out of the game if I had had Henry on b1 instead of a1 to allow my knight to interpose a back row check so that my heavies and my g pawn passer could really get to work.  Alas, this did not happen, and my advantage dissipated and at one time Freddy had a big advantage in the endgame.  Thankfully he slipped up and allowed me back into the game, and not only that, he found himself playing reluctant host to Glenda and her white steed late on in the game.  Freddy eventually allowed a draw by repetition.  So, how did all this come about?  Well, read on.......",
        "1... e5 2. Nf3 b6": "2. ..... b6!? - Freddy decided to gambit a pawn.  It does open lines for his lsb to bear down on my e4 pawn however so I must watch out here.",
        "3. Nxe5 d6 4. Bb5+": "4. Bb5+ - although with this check, Fou Leblanc has made it very possible for Henry to castle kingside, although as far as Freddy is concerned, I like to keep him guessing as to where Henry will eventually reside as long as possible.",
        "4... Nd7 5. Nxd7 Bxd7 6. Bxd7+ Qxd7": "6. ...... Qxd7 - a plethora of exchanges have cleared the way for Freddy to put his king on the queenside.  I now start to pay attention to developing my queenside.",
        "7. Nc3 Ne7 8. d3 g6 9. Be3": "9. Be3 - it has only taken 3 more moves to almost clear the decks both sides of Henry and it will be four when Glenda moves to d2 on the next turn.",
        "9... Bg7 10. Qd2 d5": "10. ..... d5 - threatening a pawn fork on d4.  In order to avoid this I invite a trade of dsb's.",
        "11. Bh6 Bxh6 12. Qxh6": "12. Qxh6 - and Freddy accepts the invitation.  Glenda controls f8 so Freddy goes queenside and I follow suit.",
        "12... O-O-O 13. O-O-O Kb7 14. f3": "14. f3 - bolstering e4.",
        "14... d4 15. Ne2": "15. Ne2 - Freddy exerts a bit of a cramp here and now the Wicked Witch can land on a4.  Yikes!",
        "15... Rhe8": "15. ...... Rhe8 - not yet though!",
        "16. Rhe1 Nc6": "16..... Nc6 - starting to amass his forces on the queenside.",
        "17. Qd2 Re5": "17. ..... Re5 - now a rook swinger to the queenside.  Ominous.",
        "18. Kb1": "18. Kb1 - might as well defend a2 and bring the knight across to reinforce it.",
        "18... Qd6 19. Nc1 Rb5 20. g3": "20. g3 - I preserve my one pawn advantage by shutting out the wicked witch.  Now I must turn my attention back to the queenside.  I move Henry to a1 where he stays until move 41.  However, this move will waste a vital tempo later on which could have made a difference between an Expert Draw and an Expert Victory.  You will see just how!",
        "20... a5 21. Ka1 Ne5 22. Ref1": "22. Rf1 - to guard the f pawn.",
        "22... h5 23. h4": "23. h4 - checks Freddy's kingside pawn roll.",
        "23... a4": "23. .... a4 - now comes one on the queenside!",
        "24. a3": "24. a3 - halts it but for how long?",
        "24... c5 25. Na2 Qc6 26. g4 hxg4 27. fxg4": "27. fxg4 - pawn trade.  It looks as though Freddy can play Nxg4 but if he does I will counter with Rxf7+ and my innocuous looking e4 pawn will become a passer.",
        "27... Qd7 28. g5 Ng4": "28. .... Ng4 - a familiar and much dreaded Freddy knight incursion.",
        "29. Rf3 Ne5": "29. ...... Ne5 - hmm, I was expecting Ne3.",
        "30. Rf4 Qh3 31. Qf2": "31. Qf2 - I now line up on that f7 pawn and also doubly protect my h4 pawn.  Now, over to the Inquest Jury.  Would Kb1 rather than an immediate Rxf7+ on the next turn have made the difference between me being merely jstevens1 or TheBlackQueen?!",
        "31... Ra5 32. Rxf7+ Nxf7 33. Qxf7+ Rd7 34. Qxg6 Qxh4": "34. ..... Qxh4 - after all that plethora of exchanges I have 2 pawns for the exchange.  Unfortunately my passer on g5 is also isolated and it is really weak.  If Henry had been on b1 then Nc1 would allow interposition without loss of the knight to a back row check.  This would allow my rook to join in and defend that weak g pawn and maybe shepherd it to Glendadom.  But Henry is on a1 and not b1 and that is a real headache.  As a result of this, over the next fifteen moves or so, apart from a few spurts, I ended up letting my clock wind down to just over 2 days per move before making a decision. \n",
        "35. Qf5 Kc7 36. Qe5+": "36. Qe5+ - at least Glenda is aggressively placed but alas she has no support whatsoever at the mo. and Freddy will be able to hide his king - sigh and double sigh!",
        "36... Kb7 37. Qf5 Rc7": "37. ..... Rc7 - at least Freddy is doing a lot of scratching around at the moment, but is he up to something?!",
        "38. Qf6": "38. Qf6 - Glenda stays in the vicinity of King Freddy, watching and waiting.",
        "38... Ra8 39. Qe5 Qg4 40. Rc1": "40. Rc1 - Gameknot analysis cites this as the move that prevents me from becoming TheBlackQueen.  Suddenly from me going from being the equivalent of a pawn up - this advantage turns to Freddy.",
        "40... Rd7 41. Kb1": "41. Kb1 - Finally Henry moves to that b1 square.  Alas it is one move too late to do anything about my poor g5 pawn.",
        "41... Rg8 42. Rf1 Rxg5 43. Qe8": "43. Qe8 - so I lose my pawn, tears!  However, I still plan my counterplay .......",
        "43... Rg8 44. Rf8": "44. Rf8 - for one moment, a dark, dark shadow looms over King Freddy and he shivers!  Can you, the Inquest Jury, guess what that shadow represents and what is the move from Glenda that could make King Freddy shiver?",
        "44... Rxf8 45. Qxf8": "45. Qxf8 - Freddy avoids copping Old Matey by trading rooks.  Now, will the Wicked Witch land a check on my back row?",
        "45... Qg7 46. Qf5": "46. Qd5+ - strangely enough he retreats her - he wants to drive Glenda out of his arc.  I keep her there and I submit a draw offer which Freddy declines.  As far as he is concerned, it is the 50 move rule for Yours Truly!",
        "46... Rc7 47. Qd5+ Ka7 48. Qc4": "48. Qc4 - attacking a4.",
        "48... Qd7 49. Qg8": "49. Qg8 - Glenda does her best to stay in Freddy's camp but boy I think she feels like humming Monsoon's \"Ever So Lonely\" because she really is a Lone Ranger, aaaah!",
        "49... b5": "49. ..... b5 - this now sets the 50 move rule to move 99 provided there are no further pawn moves or captures.  I will then be able to declare the game drawn.",
        "50. Qg2": "50. Qg2 - Homesick Glenda temporarily returns to her hometown, but not for very long.",
        "50... c4": "50. ...... c4 - make that move 100.",
        "51. Nb4 cxd3 52. cxd3": "52. cxd3 - I must now mark time until Move 102.  However, I am slightly happier with my position than I was a few moves back.  For a starters, my knight is now a lot more active and it is controlling some vital squares such as c2 and d3.  I suppose that is one advantage of being the exchange down, at least a relatively low value piece is defending a pawn to the piece/s that can attack it!",
        "52... Rc8 53. Qg6": "53. Qg6 - Now that she sees that she will have her horse to keep her company she is not quite so averse to the idea of a return trip into Freddy's position.",
        "53... Rh8": "53. ..... Rh8 - Gameknot Analysis marks this move up as an inaccuracy. Although it does threaten to come down on h1 for a check and the Witch can then check Henry on the a2-g8 diagonal, at least the knight can block the check by moving to d5.  However, he does not have to do this because King Freddy is about to feel ........",
        "54. Qa6+": "54. Qa6+ - CHEEEECK! ....... the white heat from Glenda!  Freddy however has just one legal move, sigh and double sigh and that is to b8.",
        "54... Kb8 55. Qb6+": "55. Qb6+ - can the BK run away?  We shall see.",
        "55... Kc8 56. Qa6+ Qb7": "56. ..... Qb7 - Freddy tries to hide his king behind the Witch, but Glenda is having none of it.  An observation test for the Inquest Jury here:  If King Freddy plays 56. ..... Kd8?? why is this move a double question mark?",
        "57. Qe6+ Qd7 58. Qa6+": "58. Qa6+ - Ah Freddy, let's do this dance again!",
        "58... Qb7 59. Qe6+": "59. Qe6+ - and again, for if he goes back to d7 next turn, I am now in a position to declare a ........",
        "59... Qd7 60. Qa6+": "60. Qe6+ ...... DRAW!!!  Yup, after 60 moves the game is drawn, wheew and double wheew.  So much so that after I got the game drawn, I googled Youtube and downloaded these tracks to boogie on down in order to release loadsa adrenalin.  http://www.youtube.com/watch?v=O972NI6s958 then  http://www.youtube.com/watch?v=otBdxNmEq6k and http://www.youtube.com/watch?v=CpP2d5NBoqU.  So after chilling out to those lurvely 80s soul funk grooves I then annotated the game.  There will be more games from me to annotate later on but for now I hope you have all had a good read.  Bye for now - Joanne"
    },
    "url": "https://gameknot.com/annotation.pl/mixed-emotions?gm=53578",
    "gameName": "Mixed Emotions",
    "players": "jstevens1 (1817) vs. easy19 (2181)",
    "opening": "King's knight opening (C40)"
}