{
    "moves": {
        "1. e4 g6 2. d4 Bg7": "THIS is where this mini-t starts! White has full center control. Black is, well... just there. My mission, as black in this type of opening is to gain center control WIHTOUT, loosing too much material to do so... lets see how this one plays out. However, \"sonata296\" has a nice rating and PLENTY of experience to back him up... dad and mom are awesome players!\r\n\r\nSomebody wish me luck!",
        "3. c4": "That move freaks me out for some reason... so used to KP openings... seeing 3 pawns all lined up on the middle seems strange... :-)",
        "3... c5": "After white moves to c4, c5 seems to be the best move to allow black to challenge the 'center control'. ",
        "4. Nf3": "I personally believe that white would have been better off to take the pawn @c5... but that is a \"personal\" oppinion. :)",
        "4... Qa5+": "But, since white did not take c5... the best 'offensive' move for black to take is Qa5+. Then, this opens the door for black to focus more attention on the center control in moves to follow.",
        "5. Bd2": "in my personal oppinion... this was the best move for white... it defends and attacks.",
        "5... Qb6 6. Be3 Qxb2": "FREE pawn, and Free Rook IF knight is not moved... black is still focused on the center control... in a round about 'forced move' sorta way.",
        "7. Nbd2 cxd4": "After forced knight move @#7, black can now move in on the center control issue forcing the QB out of the center, if only momentarily!",
        "8. Bf4 d6": "Open up for KB and putting a little presure on center....",
        "9. Qa4+": "maybe, not such a good move for white... kills the QR!",
        "9... Bd7": "defensive & offensive move... ",
        "10. Qb3": "White Q hopes for a trade...",
        "10... Qxa1+": "...but a free Rook is too hard to refuse! Much less xR+",
        "11. Ke2 Bc6": "Now KB puts more presure on center control... :)",
        "12. Nb1 e5": "And now... center control is much more balanced than before... but I know, my Queen's in rut!!! ",
        "13. Bc1": "B retreats... ",
        "13... Nf6": "KN places more presure on center control...",
        "14. Nfd2": "Now... black seems to have center control. Will it hold out... what will happen to blacks Queen?",
        "14... Nxe4 15. Bb2": "Well... the Q question is answered... I did NOT see that coming! Crazy, but I didn't! I was TOO busy looking at \"center control\"... now I've only got two choices... no, really only one... d3+",
        "15... d3+": "There it is... my only saving hope for Q salvation... or at least material swap balance!",
        "16. Ke1": "Great Move!... taking the pawn might not have been the best move.... however, it would have forced a Q-swap I believe... whereas, now... ",
        "16... Nxd2": "now, it all depends on what white chooses to do...",
        "17. Bxa1": "BxQ... the same move I would have made... Q-swap and material points temp remain the same... however, black has a slight advantage due to the \"center control\"...",
        "17... Nxb3": "The Q-swap complete... White Resigns."
    },
    "url": "https://gameknot.com/annotation.pl/modern-defence-discover-a-new-opening?gm=29454",
    "gameName": "Modern Defence : Discover a new opening",
    "players": "sonata296 (1448) vs. imabsolute (1372)",
    "opening": "Robatsch (modern) defence (B06)"
}