{
    "moves": {
        "1. e4": "Yay, I get to be white this time. This was a challenge from a new 1200 player. I have no idea why he picked me out of the hat. Turns out, my opponent is quite young, barely a teenager, yet evidently playing at or near a 2000 level already - none of which I knew when I accepted this challenge blindly. Let's see if I can get a Ruy Lopez...",
        "1... c5 2. Nf3": "Nope.",
        "2... Nc6 3. d4 cxd4 4. Nxd4 e5 5. Nb5": "The Kalashnikov Variation of the Sicilian. White wants one of the black bishops, and playing 6. Nd6 guarantees to trade the knight for one of them. Black generally won't let this happen.",
        "5... Nf6 6. Nb1c3": "Now we've transposed into the Sveshnikov variation.",
        "6... d6 7. Bg5 a6 8. Na3": "Main line Sveshnikov, except for the move sequence. Now black usually plays 8. ... b5.",
        "8... Be7 9. Nc4": "OK, we're off to try something different.",
        "9... Nd4 10. Bxf6 Bxf6 11. Nd5": "White hasn't exactly given up the bishop pair. He can return the favor with either Nb6 if he wishes, or even capture on f6 if black allows.",
        "11... Be6 12. Nxf6+ Qxf6 13. c3": "White has allowed black to get ahead in development.",
        "13... Bxc4 14. Bxc4 Rc8 15. Bd5 Nc6 16. Qb3": "A lively move, threatening the pawn on b7 but also putting pressure on f7.",
        "16... Qe7 17. O-O O-O 18. Rad1": "Seizing the half-open file.",
        "18... Rc7 19. Rd2": "And now we begin a long, monotonous process of jockeying for position. Over the next 25 moves, there will be only 2 captures as we exchange pawns and a pair of minor pieces, and 23 other positional moves.",
        "19... Nb8 20. Qb6 Rfc8 21. Bb3 Rc7c6 22. Qb4 Qc7 23. Rfd1": "Doubling up on my half-open file. Black has tripled-up on his. The big difference is that black is aimed at a pawn that is supported by another pawn, making it hard to lead off the capturing with a RxP move since it will cost him the rook. White is aimed at a backward pawn, only supported by pieces. If white can mount enough force, that pawn should fall. Unfortunately, white's bishop is of the wrong color, and black can defend with his knight, so it's unlikely white will be able to build up the force necessary to win the d-pawn.",
        "23... Rd8 24. a4 Rb6 25. Qc4 Rc6 26. Qb4 Rb6 27. Qa3": "Black seemed content to play for a 3-move repetition there, but white isn't ready for that yet.",
        "27... a5 28. Rd2d3 Na6 29. Rf3": "Let's see if there is play on the kingside, starting with hunting the f7 pawn.",
        "29... Rf8 30. Bd5": "Nothing more than relocating more centrally, keeping black from advancing his d-pawn, which limits the mobility of the rook on b6. But, maybe Qa2 would have been more fun, though black has sufficient cover on f7 that it would produce no results.",
        "30... Qe7 31. Bc4 Nc7 32. Rfd3": "Back to the old d-file theme.",
        "32... Rd8 33. b4 axb4 34. cxb4": "Oooh, material is just flying off the board now. ",
        "34... Rc6 35. Bb3 Ra6 36. Rf3 Ne6 37. b5 Raa8 38. Bxe6 fxe6 39. Rfd3": "I was so tempted to take that d6 pawn. Finally. But then I thought my rook would be pinned to my queen and vulnerable. And black could respond with 39. ... Rd7 and after all the dust settles, white would lose the pawn on a4. So reluctantly, I backed down from the trade.",
        "39... Kf7 40. Qb3 Kg8 41. h3 Rd7 42. Qc4 h6 43. Qa2": "Finding nothing happening other than positional bouncing, I offered a draw at this point and black accepted. Well played by black, at any age - a flawless performance, as far as I can tell. It started off with a bit of a flurry, trading pieces, making attacks, then very quickly bogged down into monotonous positional play. This was definitely one of the most tedious games I have played in a long time (which means black did his job very well) - I hope I made it equally tedious for him..."
    },
    "url": "https://gameknot.com/annotation.pl/monotonous?gm=23646",
    "gameName": "Monotonous",
    "players": "blake84120 (1967) vs. syd-wilson (1747)",
    "opening": "Sicilian (B32), Labourdonnais-Loewenthal (Kalashnikov) variation"
}