{
    "moves": {
        "1. d4": "this game shows how a balanced position could be changed thru a sound sacrifice. parties played this opening before and robberman won at that time quickly, as black made mistake with locating his bishop at the beginning.",
        "1... Nf6 2. c4 e6 3. Nc3 d5 4. cxd5 exd5 5. Bg5": "white likes this opening :)",
        "5... Be7 6. e3 c6": "now both sides closed their queen sides and aggreed that the fight will occur on the king side of the board",
        "7. Qc2 O-O 8. Bd3 g6": "this is not very meaningful actually. detoriating blacks pawn position. Nbd7 could be a more common option. ",
        "9. Bh6": "this seems early. white helps blacks rook to develop and losing tempo. too early in the game to get the benefit of having a bishop on h6 ",
        "9... Re8 10. h3": "they are out of usual lines now. white doesnt want blacks knight come to g4 to threat his bishop.",
        "10... Na6": "to get white's useful white-bishop out after Nb4",
        "11. a3": "to prevent Nb4",
        "11... Qa5": "suddenly attention turned to Queen side. White's uncasteled King is bothering.",
        "12. Nge2 Nb4 13. Qd2 Nxd3+": "now black has two bishops, which is better for the end game. from here on, black will try to reach to the end game several times, and white will try to hold the pieces on the board as much as possible",
        "14. Qxd3 Bf5 15. Qd1 Nd7": "trying to locate the knight to c4",
        "16. O-O Nb6 17. Ng3 Bd7 18. e4": "white will bring another piece to King side for attack, but leaving the pawn at d4 alone.",
        "18... dxe4 19. Ncxe4 Nd5": "plan has been changed for the black. now d5 is a better place for knight. on general just the front square of an alone pawn is a safe place for opponents knights and bishops",
        "20. Re1 Bh4 21. Qf3": "white is powerful at this point with many guns directing blacks king. and blacks queen is far away to help his queen.",
        "21... f5": "this is risky. now blacks king is getting relatively unprotected but in turn whites one knight will move away",
        "22. Nc3 Nxc3": "black still has two bishops for the end game.. ",
        "23. Rxe8+ Rxe8 24. bxc3": "white is not taking the knight with his queen for the reason i stated above about the end game. after 24.Qc3, black will make ..Qc3.. getting closer to the end game.. now at the boards position the balance starts to turn for the advantage of black. Black has two bishops which will be more powerful as game progress, and rook covering 'e' column.",
        "24... Be6": "will place the bishop to a better location.. to c4",
        "25. Bd2 Bc4 26. Qf4 Bd8 27. Qd6": "Qb8 might be better",
        "27... Qc7 28. Qb4": "this is not good.. as white's queen is getting out of the fighting place..white could have tried his chances with 28.Qxc7 Bxc7, 29. Nf1...then 30.Ne3",
        "28... b5 29. a4 Be7 30. Qb2 Bh4 31. Nh1": "this allows blacks attack to start. Nf1 and then Ne3 could be still better.",
        "31... Re2": "now black has an obvious location advantage.",
        "32. axb5": "now the winning move comes. try to guess before looking..",
        "32... Bxf2+ 33. Nxf2 Qg3 34. Rf1 Bd5": "no escape from the mate"
    },
    "url": "https://gameknot.com/annotation.pl/more-fun?gm=24723",
    "gameName": "more fun",
    "players": "robberman (1756) vs. okat (1743)",
    "opening": "Nimzo-Indian defence (E20)"
}