{
    "moves": {
        "1. e4": "En esta partida veremos un ejemplo como puede explotarse la ventaja de tener dos alfiles.",
        "1... c5 2. Nf3 e6 3. d4 cxd4 4. Nxd4 a6 5. c4 Nf6 6. Nc3 Qc7 7. Bd3 Nc6 8. Nde2 Bc5 9. Bf4 d6 10. O-O Ne5 11. h3 Nfd7 12. Rc1 O-O 13. Bb1": "Primer punto de atención, las blancas deciden conservar su alfil de casillas blancas, al analizar la posición con un poco de cuidado, vemos que los alfiles de las negras tienen un limitado rango de acción y entorpecen el desarrollo del resto de las piezas.",
        "13... Ng6 14. Bg3 Nde5 15. b3 Bd7 16. Kh1 Bc6": "Hasta este momento, las negras parecen haber ubicado correctamente sus piezas, sin embargo puede verse que los caballos no tienen buenos puntos de apoyo, esto decide explotarlo el blanco en las siguientes jugadas.",
        "17. f4 Nd7 18. Nd5": "Excelente jugada, que permite aprovechar la falta de desarrollo y la inactividad de las negras para tomar control del centro.",
        "18... exd5 19. cxd5 Bb5 20. b4 b6 21. Re1 Bxe2 22. Qxe2 Rfe8 23. bxc5 Nxc5 24. h4 Ne7 25. Qf3 Rad8 26. h5 h6": "En esta posición, las blancas tienen ventaja, especialmente por la pareja de alfiles. Por ello, la siguiente maniobra, abriendo juego y creando un peón pasado, es el plan más adecuado.",
        "27. e5 dxe5 28. fxe5 Qb7 29. d6 Qxf3 30. gxf3 Nc6 31. f4 Nd4 32. Bh4 Rdb8 33. Red1 Nc6 34. Bf2": "La ventaja blanca es decisiva. Ahora las negras adoptan una medida desesperada, pero ya no había nada mejor.",
        "34... Nxe5 35. fxe5 Rxe5 36. d7 Rxh5+ 37. Kg2 Rd8 38. Rd6 Kf8 39. Rxb6 Nxd7 40. Rd6 Ke7 41. Rcd1 Rb5 42. Bc2 Rb2 43. Bb3 a5 44. Kf1 a4 45. Bxa4 Rxa2 46. Rd6xd7+ Rxd7 47. Rxd7+ Ke6 48. Bb3+ Kxd7 49. Bxa2 Ke8 50. Bd4 Kf8 51. Kf2 f5 52. Kf3 g5 53. Be6 f4 54. Bf6": "Las negras rinden."
    },
    "url": "https://gameknot.com/annotation.pl/mosc-1982?gm=49085",
    "gameName": "Moscú, 1982",
    "players": "Sokolov, Andrei  vs. Suetin, Alexei ",
    "opening": "Sicilian (B41), Kan, Maroczy bind - Bronstein variation"
}