{
    "moves": {
        "1. e4": "Mini Tournament, I'm white and start with the Open Game.",
        "1... c6 2. c4": "Bah! The hated Caro-Kann again. I try the English Variation this time.",
        "2... d5 3. cxd5": "Evidently, white is supposed to capture with the kingpawn, 3. exd5 cxd5 then follow up with 4. d4. Always the maverick, I try something else from the GK DB.",
        "3... cxd5 4. exd5 Qxd5 5. Nc3": "And now white has an isolated d-pawn. Not the worst problem in the world, but still a concern. Let's see if white can gain some tempi in compensation.",
        "5... Qd6 6. Nf3 Bg4 7. d4": "Development even, white has more control of the center and better mobility. ",
        "7... Nf6 8. Be3 e6 9. h3 Bh5 10. g4": "Bishop-B-Gone.",
        "10... Bg6 11. Ne5 Nc6 12. Bg2": "Fianchetto with a pin.",
        "12... Nd5 13. Nxd5 exd5 14. O-O": "Well, I guess white is compensated for that isolated d-pawn, now that black has one too...",
        "14... Be4 15. f3 Bg6 16. f4": "The black LSB jumps forward to the attack, but is driven back by the white pawn. Then the white pawn advances again. Will the black LSB jump back to the attack?",
        "16... Be4 17. Bxe4": "Yes, he did. The first time, 14. ... Be4 was a fairly good move. But the second time, 16. ... Be4 will cost black a pawn. The difference? White can now open the f-file for an attack on f7. It's true.",
        "17... dxe4 18. Qb3": "Forking the undefended pawn on b7 and the under-defended pawn on f7.",
        "18... Qc7 19. Rac1": "Black saved both pawns, but not for long. The black knight is now pinned.",
        "19... Qe7 20. d5 Nxe5 21. fxe5": "Ahh, but it's white who first loses a pawn. However, I had not expected black to run his only defenders out to the center of the board, leaving his king so exposed. My alternative combo only wins the b7 pawn. This is much more delightful.",
        "21... Qxe5 22. Qa4+": "This is actually the position white was playing for, to get the black king to d8. If he tries 22. Ke7 instead, then 23. Bc5+ will drive him to d8. Not 23. ... Kf6?? allowing 24. Bd4! skewering the black queen to her king.",
        "22... Kd8 23. Bb6+": "If 23. axb6, 24. Qxa8+ and 25. Qxb7+ create big problems for black. The beauty is, black has to move to the 7th rank, and white's rook can move to c7 with check, and supported against black's queen. In fact, if black's queen were a rook, white would have mate in two. But, she's not. Still, the position will force black to sacrifice his queen to remain in the game.",
        "23... Ke7 24. Rc7+ Qxc7 25. Bxc7": "The queen sacrifice was forced, but black isn't safe yet. If white were a GM instead of an A-player, he might have announced mate in 7. In fact, a few moves ago, he might have announce mate in 10. But I didn't see the mate yet, in game, though now in hindsight I see that all the rest of black's moves were forced and white has a forced mate here, and has had it for at least the last couple moves.",
        "25... f6 26. d6+ Kf7 27. Qc4+ Kg6 28. Qxe4+": "White really wants to get his queen to d6. All this maneuvering is just to keep checking black, driving him back to the center, and allow Qd6+.",
        "28... Kh6 29. Qf4+": "White announced mate in 5, beginning with 28. Qxe4, and then entered the conditional moves. Pretty late in the combination - I guess I'm not a GM yet.",
        "29... Kg6 30. Qf5+ Kf7 31. Qd5+": "Forces 31. ... Ke8. If 31. ... Kf6, 32. Qh6#.",
        "31... Ke8 32. Qe6+": "Mission accomplished. The king is all done running. 32. ... Be7, 33. Qxe7#. However, black had one final defiant trick up his sleeve: he denied white the gratification of playing the finishing move by resigning."
    },
    "url": "https://gameknot.com/annotation.pl/much-more-delightful?gm=23122",
    "gameName": "Much More Delightful",
    "players": "blake84120 (1913) vs. mc_rennett (1837)",
    "opening": "Caro-Kann (B10), anti-anti-Caro-Kann defence"
}