{
    "moves": {
        "1. e4 Nf6 2. Nc3": "I still can't believe that this is White's best line, but it avoids the main theory of 2. e5 and the obscure positions that occur. ",
        "2... d5 3. d4": "I'm not sure whether this is !? or ?! - White gives up a pawn to change the style of the game.  The position is akin to a Veresov (1. d4 d5 2. Nc3) or potentially, a French Defence.  Black's pawn on e4 can only be defended at the cost of a weaknesses at e6 and/or d6 in the event of ... f5 and White gets some open lines. ",
        "3... Nxe4": "Probably better than 3. dxe4 where White can look to play Bg5 to pressurize the Nf6 in due course.",
        "4. Nxe4 dxe4 5. Bf4 Bd7": "The GK computer says that this is inaccurate and suggests 5. Nc6 5. c3 e6 6. Qc2 f5 7. Nh3 Bd6 8. 0-0-0 0-0 9. Be2 Bd7 10. d5 as +0.87 for Black. Personally, I think that White has good compensation for his pawn in this line.  His king is safe, his pieces are freer and he has f3 and g4 to prise open the K-side.  5. Bd7 is flexible and looks at playing ... e6 and .. c5, whilst keeping an eye on Bb5 threats in the event of ... Nc6.  The computer thinks that 6. Qh5 e6 6. 0-0-0 Bd6 is pretty equal.",
        "6. Bc4 e6 7. a3": "Is this a waste of tempo?  7. Qe2 Bd6 8. Nh3 0-0 9. 0-0-0 Re8 10. Re1 Bc6 11. d5 could leave Black's K-side a little fragile and there is the option of recapturing on e4 at moves 9/10 etc if White fancies it.  For my part, I was thinking about ... b5 (which Qe2 would have prevented) but I'd probably have gone with 7. ... Bd7-c6-d5 and ... c5 to hold the pawn and to compete in the centre.  I don't see that Black needs to rush to 0-0 in this position - he can always 0-0-0 instead.",
        "7... c5": "It seems sensible to attack the centre at this stage, before playing ... Nc6 although the computer suggests  6. ... Bd6 7. Qg4 0-0 8. Bg5 f6 9. Bxe6+ as the best line for Black.  My personal rule is that if White can get away with playing Qg4, you probably don't want to be meeting it with 0-0.  I'll go with 6. ... c5 thanks.",
        "8. Ne2": "8. f3 exf3 9. Nxf3 looks more in keeping with White's plan for an attack, although there's nothing wrong with this move.",
        "8... Nc6 9. dxc5": "White gives up what remains of his centre but does he really want an isolated pawn on d4?",
        "9... Bxc5 10. b4 Bb6 11. O-O": "White's development is almost complete, he has a pawn majority (and space) on the Q-side and the e4 pawn is a little isolated.  11. ... 0-0 simply moves the king away from his minor pieces, whilst d6 is already looking somewhat weak.  Perhaps 10. ... Be7, controlling d6, is better, but it looks rather passive and the Bd7 isn't going anywhere.",
        "11... f5": "If this looks cavalier, it's based on some relatively sound dynamic principles.  It defends e4 in the first instance, threatens ... g5 and ... e5 followed by ... f4 and looks to utilise Black's K-side majority as soon as possible.  Granted, e6 is drafty, but I have a cunning plan.",
        "12. Qd2": "Stopping 12. ...g5 and threatening to double on the d-file.",
        "12... Qf6": "The computer thinks that 12. ... 0-0 13. Qd6 Re8 14. a4 Bc8 15. a5 is a better continuation.  Any takers?",
        "13. Rad1 Bc8": "! - The obvious square really.",
        "14. Qd6": "The obvious move, although 14. Bd6 might be stronger.  Black can play 14. ... a5 according to the computer, although 14. ...g5 demands consideration at this stage.  Black's K-side pawn advance looks very imposing. ",
        "14... e5": "I really liked this move too.  At a stroke, Black frees himself of the weaknesses at e6 and e5 and grabs a share of f4 and d4.  The computer wants to grub around with 14. ... Kf7 which looks a bit grotty, but the threat of ... Rd8 is actually rather difficult to meet.  15. Be3 Qe5 16. Qd2 Rd8 is, on the face of it good for Black, but I had an extra pawn and wanted a phalanx, shoulder to shoulder, to advance on the White king.  At this stage, however, I'd be lying if I thought I was better.  Equality first as Black, then push on to win if you can.",
        "15. Qxf6 gxf6 16. Bh6 Ke7": "The position is, according to the computer, equal.  Black's pawn apparently counts for nothing at all, but is that right?  The Bh6 looks nice enough, but what if I can play ... f4!?  Can White force a pawn through on the Q-side?",
        "17. Nc3": "White's only central square is d5.",
        "17... Be6 18. Nd5+ Bxd5": "I'd rather keep my dark-squared bishop than my light-squared one.  I have dreams of playing ... f4 or ... e3 at some point, but here and now I'll settle for equality.",
        "19. Bxd5": "Black's in a bit of a bind here.  His pawns aren't going anywhere and his pieces are tied up. I can't use g8 and b7 is weak.  How to solve the problems?",
        "19... Rhd8 20. c4": "White's pawns start to move, and the threat is 21. b5.  20. b5 Nd4 hits c2, e2 and b5 and potentially forces 21. c4 when White has compromised the flexibility of his pawns and the Nd4 looks useful.  Black might even be tempted to play Rxd5 and try to advance his pawns.  \nAt this stage, I wasn't particularly confident about the outcome.  Black has an extra pawn, but it's doubled and White has the bishop pair.  Can Black stop White playing 21. c5 and closing down his Q-side for good?  I think White is actually better here, despite the nominal material difference.",
        "20... Rd7 21. c5": "So what's Black's next move?",
        "21... Rad8": "21. ... Rad8! A zwischenzug, or 'in-between' move. 21. ... Bc7 22. Bxc6 bxc6 23. Rxd7+ gives White lots of compensation for his pawn - his Q-side pawns are up and running and my pieces are passive.  Now, suddenly, the tables are turned.  White has to go backwards at this point.  22. cxb6 Rxd5 23. Rxd5 Rxd5 24. bxa7 Nxa7 and White's pawns go nowhere.  Suddenly, I felt as if I might survive on the Q-side and take advantage.  Firstly, though, I wanted to get the rooks off because I thought that would minimise White's winning chances and give me the best chance in the endgame.",
        "22. Bb3 Rd7xd1": "22. ... Bc7 is supposed to be stronger according the GK analysis, but is too messy for my liking.  Here, I get rid of the rooks and use my endgame technique.",
        "23. Rxd1 Rxd1+ 24. Bxd1 Bd8": "Now we have an interesting endgame.  This is one of those positions where it's worth stopping and looking at it.  White's pawns are more advanced, but Black's king can get there first.  The Bh6 could find itself trapped if it's not careful and the Nc6 can hop into d4 where it dominates the board.  Much as I like the visceral thrill of a direct attack on the king, this is a tense, dynamic position. ",
        "25. f4": "White blinks first. Giving Black a passed pawn can only end in trouble, although the alternative sees Black play ... a5 and (if necessary) ... b6 to neutralise the Q-side.  White can pick up the h7 pawn but at a cost.  25. Bb3 a5 26. bxa5 Bxa5 27. Bg8 Kd7 28. h4 Bd8 30. Bf8 Be7 31. Bxe7 Kxe7 32. h5 Kf7 is the line suggested by the computer as best for White, albeit practically equal.",
        "25... Kf7": "25. ... Bc7 is likely to be met by 26. fxe5 Bxe5 27. g4 Bd4+ 28. Kg2 Ke6 29. h3 Bb2 30. Be3 a6 31. gxf5+ Kxf5 32. Bg4+ Ke5 33. Bc8 when the Q-side pawns start to disappear.  I think that White can hold the draw by a timely sacrifice of bishop for 2 pawns in this line. ",
        "26. Bh5+": "White is lured into a check.  What are those bishops up to?",
        "26... Ke7 27. Kf2 Bc7 28. g3 a5": "Finally, Black gets to break up those pesky White pawns.",
        "29. b5 Nd4": "And the knight gets big.",
        "30. b6 Bb8": "One of those difficult choices.  30. Bd8 avoids the possibility that the bishop gets trapped, but 30. ... Bd8 31. fxe5 fxe5 allows the bishop out and gives White chances again.  I was a bit worried by 32. Bg5 and 33. Bxd8, although 32. Bd1 is probably better, restricting the knight's squares and meeting Ke6/d7 with Bf8, Ba4 and c6 if he can get away with it.",
        "31. Bd1 exf4": "So which way does White recapture?  ",
        "32. gxf4": "Whilst this looks to leave the Bh6 trapped, 32. Bxf4 Bxf4 33. gxf4 Ke6! is winning for Black.  33. ... Ne6? 34. c6! is, however, not so hot.",
        "32... Ne6 33. Bb3": "33. ... Nd4 34. Bg8 is unclear\n33. ... Bxf4 34. Bxe6 Bxh6 35. Bxf5 throws it all away.\n33. ... Nxf4 34. Bxf4 Bxf4 35. Bd5 is embarrassing. \nAny ideas?",
        "33... a4": "33. ... a4 is, I suppose, one of those logical, dynamic continuations in a position like this.  It feels as if it should work (if the Force is with you).  34. Bxa4 Nxc5 35. Bc2 Bd6 and the Bh6 is trapped.",
        "34. Bxe6 Kxe6": "The possibility of opposite coloured bishops disappears, White's pawns are on the wrong coloured squares and if I can activate the bishop, we're quids in. ",
        "35. Ke3 Kd5": "A hint of psychology to this move.  It looks aggressive, and White's reply is pretty forced, but White is now looking to hold the draw, and gets suckered into a repetition.  35. ... Kd7 is stronger because I can triangulate the king to lose a tempo if necessary.  36. Bg7 Ke7 37. Bh6 Kf7 38. h4 Ke6 39. h5 Ke7 40. Bg7 Kf7 and I can waste a move by playing Ke7.",
        "36. Bf8 Ke6 37. Bh6": "?  37. Bg7 is, I think, stronger.  White doesn't realise how short of moves he's going to get, and the bishop needs to be on g7 to give flexibility as to when it goes to f8.  Black's not exactly blessed in the moves category at this point - his bishop may have potential energy, but that's about it, whilst his pawns aren't going anywhere.  A tempo here or there will make all the difference. ",
        "37... Kf7 38. h4": "Offering a draw, but I've got one more plan.",
        "38... Kg6 39. Bf8 h5": "Now 40. Bd6 is met by Bxd6 and the King covers the d-pawn whilst White's King is stuck stopping Eddie (né Duncan).\nAmusingly, 40. Be7 Kf7 41. Bd8 Kd6 42. Bc7 Bxc7 43. bxc7 Kd7 also shows the power of zugswang.\nIn this line, if White ever tries to move the King, f4 falls.",
        "40. c6": "Surely that's it?  Except it's still not that simple.  ",
        "40... bxc6 41. b7 Kf7 42. Bc5": "Black can still make a real mess of this.  White's idea is to meet ... Bxf4 with Ba7 forcing Black to give up the bishop. ",
        "42... Ke6 43. Kd4 Kd7 44. Bb6": "Another moment of decision.  44. ... Bxf4 45. Ba7 gives White saving chances. \nI saw that 44. ... c5+ 45. Kxc5 Bxf4 46. Ba7 Be3+ is winning, but after 46. Kd5 Bb8 47. Bd4 Kc7 48. Ke6 f4 49. Kf5 I am not sure that Black can break through.  If White can pick up the f-pawn and sacrifice the bishop for the a-pawn, I have the wrong bishop to queen on h1.  I thought I might be able to lure the White king away from the e-file first.",
        "44... Kd6 45. Kc4 Kd7": "Allowing White to repeat with 44. Kd4 but the last time he tried that, it didn't work out for him.  If he had, I think I would have tried 44. ... Kd6 45. Kc4 c5, akin to the game continuation.",
        "46. Kb4 c5+": "It's only a pawn, and it was getting in the way.  47. Kxc5 Bxf4 and the check on e3 allows me to get back to b8",
        "47. Bxc5 Kc6": "Now the b7 pawn falls but there's one sting left.",
        "48. Be3 Kxb7 49. Kxa4": "Now we both have a passed pawn and my doubled pawns don't look healthy.  What's Black's move?",
        "49... Ba7": "Of course.  If White plays 50. Bd2 e3 51. Bc3 e2 and ... 52. Bf2 (where have I seen that theme before?) wins the bishop and, because White's K-side pawns are fixed on dark squares, the game.",
        "50. Bxa7 Kxa7 51. Kb4": "And, having exchanged the queens, then the rooks, and then the minor pieces, we arrive at a K+4 v K+3 endgame.",
        "51... Kb6": "Black takes the opposition, but there is nothing left for White here.  If the King stays with the a-pawn, the e-pawn will run.  If not, the a-pawn drops and then the King makes its way to the K-side.\nA couple of examples:\n52. Kc4 Ka5 53. Kb3 Kb5 54. a4 Ka5 55. Ka3 e3 -+\n52. Kc4 Ka5 53. Kd4 Ka4 54. Ke3 Kxa3 55. Kd4 Kb4 56. Ke3 Kc3 57. Ke2 Kd4 58. Kd2 e3+ 59. Ke2 Ke4 -+",
        "52. a4 Ka6": "White realises that he's had enough and resigned.  Exhausting, but fun.\n\nPlease rate the game if you got this far.  Cheers, D"
    },
    "url": "https://gameknot.com/annotation.pl/muek54s-mini-tournament-ix?gm=31714",
    "gameName": "muek54's mini-tournament IX",
    "players": "pilou (1905) vs. dsb13 (1959)",
    "opening": "Alekhine's defence (B02), Scandinavian variation"
}