{
    "moves": {
        "1. e4": "1. e4 Bobby Fischer once wrote that 1. e4 was \"best by test.\"",
        "1... c5": "The Sicilian Defense is one of the most popular responses to 1. e4.  It signals a willingness to do battle, because it avoids symmetry.",
        "2. Nf3": "Developing and centralizing.  The knight benefits more than any piece by its proximity to the center.",
        "2... g6": "The Accelerated Dragon.  Black is going to fianchetto his king's bishop and try to obtain counterplay along the dark squares.",
        "3. d4": "The principled continuation.  White will try to develop rapidly and attack black's position.",
        "3... cxd4": "Exchanging a wing pawn for a center pawn, which is a plus for black.  Look, however at the open lines for the white bishops.  Black cannot develop as quickly as white.",
        "4. Nxd4": "The knight moves twice, but the loss of time is compensated by the fact that material equilibrium is reestablished, and the knight is well placed in the center of the board.",
        "4... Nc6": "Developing and centralizing.",
        "5. Nxc6": "Playable, but it is the third move of the knight, and it exchances it for a piece that has moved only once.  White's advantage in development is somewhat mitigated now.",
        "5... bxc6": "5. ...dxc6 would allow the exchange of queens and black would forfeit the right to castle.",
        "6. Bd3": "The bishop is more active on c4.  A piece's power is tied to its mobility.  The Bishop on d3 is restricted by the pawns on c2 and e4.",
        "6... Bg7": "The bishop rakes the long diagonal.  Compare its mobility to the white bishop on d3.",
        "7. O-O": "Castling is usually good.  It secures the king and prepares to activate the rook.",
        "7... d6": "With the dark square bishop actively posted, Black wants to do the same with the bishop on c8.",
        "8. Nd2": "8. Nc3 is probably better.  White's most active idea is to proceed with development and then play f4-f5.",
        "8... Nf6": "Black's pawn structure is sound, and he wants to complete his development.",
        "9. c3": "Perhaps not the best use of time.  Every move is precious and ought to be optimized.",
        "9... O-O": "Black has caught up in development.",
        "10. Nf3": "Blocking the f-pawn.  White now has no active plan of attack.",
        "10... c5": "Black decides to activate the c8 bishop along the other long diagonal, but this might not be the best decision.",
        "11. Bg5": "Another idea is to play 11. h3, Be3, and Qd2 followed by Bh6.  Exchanging the dark square bishops is in white's best interest.",
        "11... Bb7": "Attacking the e-pawn, and developing the last of his minor pieces.",
        "12. Bxf6": "12. Re1 defending the e-pawn, was better.  The bishop, which has moved twice is exchanged for a knight that has only moved once.  Black is now left with the advantage of the \"two bishops.\"",
        "12... Bxf6": "Restoring material equality, while preserving his pawn structure.",
        "13. Re1": "Activating the rook and preparing for a possible push e4-e5.",
        "13... Qb6": "Hitting the b2 pawn and clearing the back rank for the rooks.  Notice that the b-pawn cannot move or the c-pawn would be lost.",
        "14. Qc2": "Developing and defending at the same time.",
        "14... Rab8": "Black intends to increase the pressure along the half-open b-file.",
        "15. e5": "Just about the only hope for activity.",
        "15... Bg7": "Black wants to keep the two bishops.  Capturing on e5 would only allow white to activate his knight.  15. ...Bxf3 16. exf6 is better for white.",
        "16. exd6": "16. e6 was also to be considered.",
        "16... exd6": "Again, taking on f3 is bad.  16. ...Bxf3 17. dxe7!",
        "17. Rab1": "Defending the b-pawn, but allowing black to ruin white's pawn structure.",
        "17... Rfe8": "Objectively, 17. ...Bxf3 is correct.",
        "18. Rxe8+": "Black welcomes exchanges, because the power of the bishops increases the closer we get to an endgame.",
        "18... Rxe8": "Forced.",
        "19. Re1": "Black is again happy to exchange.  Players often think that exchanges lead to draws, and that is sometimes the case.  Strong players sometimes say they got \"Hoovered into a draw.\"  They mean that their opponent vacuumed off all the pieces leaving them with no winning chances.  However, if you have an endgame edge, exchanges are to be welcomed, not avoided.",
        "19... Rxe1+ 20. Nxe1 d5": "Black would ideally like to exchange queens.  His next objective is to obtain a past pawn.  The bishops are superior to a knight when there are pawns on both sides of the board.",
        "21. b3": "White is tired of defending the b-pawn, but now the c-pawn must be defended.  Notice that, if white's c-pawn advances, Black's bishop on g7 gets even stronger.",
        "21... Qe6": "Moving to the only open file.",
        "22. Kf1": "The king is in no danger and wants to be active, if the queens come off the board.  However, there is a tactical drawback to this move.",
        "22... Qe5": "This is a tactic called a double attack.  The h-pawn and the c-pawn are both threatened.",
        "23. Nf3": "White can only save one of the pawns.",
        "23... Qxc3": "Establishing material superiority.  Black now has a technically won game.",
        "24. Qxc3": "White has little choice but to exchange queens now.  Otherwise, Black would go into attack mode.",
        "24... Bxc3": "Bllack is up one pawn, and still has the two bishops.",
        "25. g3": "I'm not certain why white played this move.",
        "25... Kg7": "25. ...c4 was a consideration, but white holds after 26. bxc4 dxc4 27. Be2.  Better was the immediate f7-f6.",
        "26. Ke2": "Activating the king.",
        "26... f6": "One of the keys for playing against knights is to rob them of the squares they want to move to.",
        "27. h4": "White wishes to exchange pawns.",
        "27... Kf7": "Activating the king.",
        "28. Nd2": "The knight has no good square to move to.",
        "28... Ke6": "Continuing to activate the king.  The king is a fighting piece in the endgame.",
        "29. Nb1": "Black is not troubled by this attack.  The bishops can move out of the knight's range relatively easily.",
        "29... Ba5": "The bishop is no worse off on a5 than c3, and the knight is certainly not better on b1.",
        "30. Ke3": "Activating the king.",
        "30... Ke5": "Ditto.",
        "31. f4+": "This drives the king from the e5 square, but now white's kingside pawns may become vulnerable.",
        "31... Kd6": "The king provoked the pawn advance and retreats to the next best square.",
        "32. f5": "White wants to initiate pawn exchanges, but now the kingside pawns become weakened.  Notice also that the e5 square is once again available for Black's king.",
        "32... g5": "Black is expecting 33. hxg5 fxg5 34. g4 Ke5 with advantage.",
        "33. hxg5": "Best.",
        "33... fxg5": "Forced.",
        "34. f6": "34. g4 was much better.  Black still has the better game, but now the material advantage becomes decisive.",
        "34... h6": "The f-pawn is no danger, so Black moves the h-pawn away from danger.",
        "35. Bf5": "White will try to make it hard for black to win the f-pawn, but it is doomed.",
        "35... Bd8": "A direct attack.",
        "36. f7": "Forced.",
        "36... Be7": "The bishop secures the queening square and white is basically helpless.",
        "37. Bg6": "There isn't any good plan at this stage.",
        "37... Ke5": "Heading for f6.",
        "38. Kf3 Kf6 39. Bh5 d4+ 40. Ke2 Bd5": "The f-pawn is going to fall and a two pawn advantage is generally decisive.",
        "41. Nd2 Bxf7 42. Bxf7 Kxf7 43. Ne4 h5": "The d-pawn is already a protected passed pawn.  Black wishes to create another passed pawn.  The knight will have trouble being in two places at once.",
        "44. Nf2 Ke6": "Patience is a virtue in endgames.  Black once again activates the king.",
        "45. Nd3 Kd5 46. Kd2": "Oops.  A tactical oversight.  White needed to keep an eye on the g-pawn.",
        "46... Bd6": "A direct attack.",
        "47. g4": "The best option, but black is now three pawns to the good.",
        "47... hxg4 48. Ke2 c4": "Breaking open a second front.",
        "49. bxc4+ Kxc4 50. Ne1 g3 51. Ng2 Bf4": "0-1  Believe it or not the key to the game, was White's unforced decision to exchange bishop for knight.  Black was happy to trade material and the advantage of the two bishops grew more and more evident as the endgame approached.  One of the more difficult concepts to master in chess is the art of exchanging pieces."
    },
    "url": "https://gameknot.com/annotation.pl/muttit-coaching-game?gm=12264",
    "gameName": "Muttit - coaching game...",
    "players": "muttit (1620) vs. yellowlab (1926)",
    "opening": "Sicilian (B27), Hungarian variation"
}