{
    "moves": {
        "1. e4": "White opens e4.",
        "1... c5": "Black counters with c5",
        "2. b3": "White advances a pawn to b3 on the queen side to open up his bishop.",
        "2... Nf6": "I bring out my kings knight to f6 to pressure the middle white pawn on e4.",
        "3. Nc3": "White brings out the queens knight to c3 to protect the middle e4 pawn.",
        "3... d5": "I bring up my black pawn to d5 to add pressure to the middle pawn in e4.",
        "4. e5": "White passes my black pawn and puts pressure on black knight on f6.",
        "4... Ne4": "I move up my knight to e4.",
        "5. Nxd5": "White knight takes my pawn in d5.",
        "5... Qxd5": "I take the knight in d5 with my queen. That was a blunder I guess. I was not sure if it was a trap of some kind. Time will tell.",
        "6. Bc4": "White brings out the bishop to c4 and pressures my queen in d5.",
        "6... Qd4": "I push up my black queen to d4 pressuring the rook in a1 and same time his King and pawn on f2 which has pressure from my knight.",
        "7. Qe2": "White queen  protects her King by moving to e2.",
        "7... Qxa1": "I take the rook in a1 with my queen. I now have pressure on his bishop on c1.",
        "8. Qd1": "White brings back the queen to d1 to protect the bishop in c1.",
        "8... Qd4": "I bring my black queen back to center on d4 to where he first countered with his queen to e2. This time I think he decides to do something different. Watch what happens next.",
        "9. Nf3": "White brings out the kings side knight to f3 a strong position to pressure my queen on d4. His next move would be to castle O-O.",
        "9... Qxf2#": " I had to move my queen out of harms way and I looked  at the pawn on f2 and see that its protected by my knight on e4. If I used my knight to take his pawn in f2 I would pressure his kings rook and queen at the same time. I had a better move and put him in checkmate with my queen to his pawn in f2 for check mate. This was my 5th win. This was done in 9 moves over a 12 day time period."
    },
    "url": "https://gameknot.com/annotation.pl/my-5th-win?gm=43213",
    "gameName": "My 5th Win!!!",
    "players": "csbarry321 (1118) vs. redfox17 (1094)",
    "opening": "Sicilian defence (B20)"
}