{
    "moves": {
        "1. e4": "This was the 7th and last round of the 2008 North American Open. I played in the U1700 section and had 3.5 points going in the last round. I was out of the money so the game was important to me for 2 reasons. (1) possible creative achievement.  (2) personal pride(The best I had done at a big national tournament was 3.5/7)",
        "1... e6": "I love playing both sides of the french.",
        "2. d4 d5 3. Nd2": "This move was sort of a bluff. I had prepared somewhat to play the tarrash but if my opponent really knew his stuff I knew I could be in trouble.",
        "3... dxe4": "This is what I was hoping for. I am perfectly happy playing either side of the rubinstein.",
        "4. Nxe4 Nf6 5. Nxf6+ Qxf6": "Theory frowns on the queen capture here as white is supposed to take advantage of the position of blacks queen on f6. Theory reccomends taking with the g pawn.",
        "6. Nf3 h6": "otherwise 7. Bg5 would be highly unpleasant",
        "7. Bd3": "Just calmly developing my pieces.",
        "7... Bd6 8. h4": "Making way for a possible rook lift.",
        "8... Qe7": "Black wants to play e5.  However, after the immediate 8..e5 9. Qe2 puts pressure on blacks position.",
        "9. Ne5": "preventing e5.",
        "9... Bxe5": "Personally if I were black I would play Nd7 here.",
        "10. dxe5": "Now the bishop is stuck behind the pawn chain. It is natural to develop it on b7 but this lead to problems in the game. Perhaps it would have been better to play Bd7-Bc6.",
        "10... Nc6": "attacking the pawn",
        "11. Qe2": "protecting the pawn and delaying the decision as to where to put my king. I could castle quennside or walk my king to the kingside. My kingside rook gets into the game via Rh3.",
        "11... b6": "This makes the knight vulnerable to a pin.",
        "12. Bb5": "naturally",
        "12... Bb7": "black continues with his plan nonchalantly.",
        "13. Qc4": "Building the attack. Rh3-c3 is coming next. ",
        "13... Qd7 14. Rh3": "Headed to c3",
        "14... O-O 15. Rc3 Rfd8 16. Be3": "A blunder. 16. Bf4 apperars to win a piece on the spot.",
        "16... Nxe5": "Of course...what was I thinking?",
        "17. Qe2": "Now I am aiming for complications.",
        "17... Qe7": "What I was worried about was 17..c6 after which I was actually considering a piece sac starting with 18. Bxh6. But maybe the natural 18.Ba4 b5 19. Bb3 is better where Bxh6 is still threatened.",
        "18. Bxh6": "discovery attack on the knight",
        "18... Ng6": "Otherwise the queen picks off the knight.",
        "19. Bg5": "Protecting my pawn and forcing black to weaken his kingside.",
        "19... f6 20. h5": "fighting for the initiative.",
        "20... fxg5": "Black should have retreated the knight. Taking the bishop give white a mating attack.",
        "21. hxg6 a6": "maybe the pawn sacrifice 21. c6 can save black from immediate disaster.",
        "22. Qh5": "Now nothing can save black.",
        "22... Qd6 23. Qh7+ Kf8 24. Qh8+": "with mate to follow."
    },
    "url": "https://gameknot.com/annotation.pl/my-first-rook-lift?gm=20983",
    "gameName": "My first rook lift.",
    "players": "Stack,J  vs. Roberts, J ",
    "opening": "French (C03), Tarrasch"
}