{
    "moves": {
        "1. e4 c5 2. Bc4 e6 3. Qf3": "?! Playing for a quick mate.",
        "3... Nc6": "Controlling the e5 square and preparing Nf6.",
        "4. c3": "?! White risks to fall back in development. There is no way he can play d2-d4 on the next move, therefore his 4. c3 is pointless.",
        "4... Nf6": "Now the d5 square is controlled and black is ready to play d7-d5.",
        "5. d3": "?! Very passive pawn play, black is already clearly better developed.",
        "5... d5 6. exd5 exd5": "Black seizes the initiative.",
        "7. Bb5 Bg4 8. Bxc6+": "?! The bishop made three moves to get exchanged for a knight that made just one move.",
        "8... bxc6 9. Qg3": "Not a good square for the Queen - here it is vulnerable.",
        "9... Bd6": "Eqploiting the position of the white Queen.",
        "10. Qe3+": "If 10. Bf4 then black plays the intermezzo 10. ...Qe7 ",
        "10... Kd7": "! gaining another tempo - now Re8 winning the queen is threatened.",
        "11. Qd2 Re8+ 12. Kf1 Qe7": "Black has developed 5 pieces while white has only one piece playing.",
        "13. f3": "What else? White pieces are tied down. He tries to secure the e2 square.",
        "13... Rab8": "!? The advantage in development has to be exploited as soon as possible.",
        "14. fxg4": "After some thought white accepts the sacrifice.",
        "14... Nxg4": "Threatening Bf4.",
        "15. Nf3": "This leaves the e2 square vulnerable and black immediately regains his sacrificed piece.\nHow else could white continue development?\n15. Na3 might look like a good alternative, but it runs into 15. ...Rxb2!! - conquering the important e3 square for the knight.\nThe best was 15. Qe2, but then black could continue his attack with 15. ...Qh4",
        "15... Bf4": "!",
        "16. Qc2": "If 16. Qxf4 then 16. ...Qe2  17. Kg1 and 17. ...Qf2#",
        "16... Bxc1": "White can't recapture and is now completely lost. Black threatens both Ne3  and Rxb2 winning.",
        "17. Na3 Rxb2 18. Qd1 Ne3+": "White either gets mated or loses his queen. He chooses to end the game quickly.",
        "19. Kg1 Rxg2#": ""
    },
    "url": "https://gameknot.com/annotation.pl/my-first-gk-game?gm=10236",
    "gameName": "My first GK game",
    "players": "rahmed (1333) vs. humphreyappleby (1200)",
    "opening": "Sicilian defence (B20)"
}