{
    "moves": {
        "1. e4": "This game marks my first victory against a 2000+ rated player. It was an interesting Sicilian defense which tested both my tactical and strategic skills. Any advice or comments are greatly appreciated.  \n",
        "1... c5": "I opt to play the tactical Sicilian defense, usually giving both sides mutual winning chances.\n",
        "2. Nc3": "White goes for the closed Sicilian to try for a more positional type of game.\n",
        "2... Nc6 3. Nf3 d6 4. d4": "Logical moves have been played so far. With d4, white plans to dominate and attack the center while I will continue natural development until I see which side of the board white chooses to castle.  \n",
        "4... cxd4 5. Nxd4 Nf6 6. Bc4": "While the Sozin variation is still playable, it is not as popular as it once was because a pawn push to e6 neutralizes much of the LSB power along the a2-g8 diagonal. \n",
        "6... e6": "As mentioned before, this move shuts out the bishop from any future king-side attacks.\n",
        "7. Be3 Be7 8. Qe2": "All part of the main variation. With the swift development of the queen side, white aims to castle on the queen side and look to push through the black's king side with a pawn storm. \n",
        "8... a6": "A necessary move which prevents the knights from taking a strong outpost on b5 while also threatening a pawn push to b5 to prepare a queen side attack.  \n",
        "9. Bb3": "A logical move which foresees the pawn push to b5. \n",
        "9... O-O 10. O-O-O Qc7": "A common developing move which prepares for pawn to b5 and places the queen on the open file. \n",
        "11. Rhg1": "Although 11. g4 could have been played right away by white, this move further supports the advancement to try and rip open black's king side. \n",
        "11... b5 12. Nxc6": "The first deviation from the main line. This knight exchange benefits black because it gives more time and space for queen side development. \n",
        "12... Qxc6 13. f3": "A logical move, defending e4 and further supporting a g2-g4 pawn push.\n",
        "13... Bd7": "Bb7 was also a good alternative, but I chose to post the bishop to d7 to prepare for an a5-a4 pawn advancement.\n",
        "14. g4 a5": "Threatening to trap white's bishop. However, before white looks to defend, it is crucial that white continues with its plan first before defending. \n",
        "15. a4": "?! This move can wait. It was important for white to continue with its own by playing 15. g5! first to force the knight to retreat to e8 so that the rook on f8 would remain inactive. Now, after the exchange of pawns there will be an open file that the f8 rook can exploit. \n",
        "15... bxa4 16. Bxa4 Qb7": "The most logical square to retreat to where the queen can potentially attack the weak b2 pawn.\n",
        "17. b3": "?! A defensive move that gives me more tempo. Best would have been to continue to push forward with the plan and play 17. g5 Rfb8 18. b3 Ne8. \n",
        "17... Rfc8": "Exploiting the weakness of the dark squares around white's king to develop and attack the knight at the same time. \n",
        "18. Bxd7": "? A mistake, leaving me two options the knight or the bishop. If I was to play Nxd7 my knight could have made excellent use of the e5 square afterwards and I would be able to put a lot of pressure of the king. However, I opted to capture the knight which also puts great pressure on the king.\n",
        "18... Rxc3": "Now, the bishop must retreat to a4 and the king will take heavy bombardment along the c-file and along the weak dark squares. \n",
        "19. Bd4": "?? A natural response which seems that white may be getting counter play. However, this loses to a tactical shot. \n",
        "19... Qxb3": "! The king is now in grave danger. White seems to have quite a few defenses after Bxc3, however, they all lose due to the latent power of the e7 bishop, the exposure of the king, or the fact that the d7 bishop is hanging.  \n",
        "20. Bxc3 Qxc3": "White can attempt to hold on to the bishop, but all attempts would fail. For example, 21. Bb5 d5! and the king can not avoid mate while also not dropping the g1 rook. For example, 21 Bb5 d5 22. Rd3 Qa1+ wins the rook.\n",
        "21. Qd3": "Probably the best option for white to try to hold. After the exchange of queens, the game will go to the endgame where I will have material advantage, but it will still be tricky to convert the win.\n",
        "21... Qxd3 22. cxd3 Nxd7 23. Kb2": "Of course, white's first priority is to stop the advancement of the a pawn, however d4 may have been slightly better to prevent the knight from taking advantage of the e5 or c5 square.  \n",
        "23... Ne5": "Exploiting the hole while I still can.\n",
        "24. f4 Nf3 25. Rg2 Bf6+": "?! Not following the proper plan. At this point, I really began to lose sight of what my main goal was. The bishop was supposed to be used to defend the pawn once it reached a3. Additionally, it gives white more time to block the pawn. \n",
        "26. Ka3 g6 27. Ka4": "Now white has successfully blockaded the a pawn due to my poor play. \n",
        "27... Rc8": "I decided to create a concrete plan to try to force the king into an uncomfortable position, then follow that up by attacking the weak pawns. Although I do drop the a pawn, perhaps I have some compensation because I can mobilize my pieces quickly to the queen side. \n",
        "28. Kxa5 Bc3+ 29. Ka6 Nd4": "White must now be careful. If white allows me to get my rook on the b file then there are some mating threats that could arise.\n",
        "30. Rb1": "White plays the most rational move which takes control over the b file.  \n",
        "30... Nc6": "This knight maneuver attempts to block the power of the b1 rook while also threatening a fork by placing it on b4.  \n",
        "31. Rgg1": "! A good quiet move which allows white to defend the d3 pawn after 31...Nb4+ 32. Kb7 Rc5 33. Rgd1.\n",
        "31... Nb4+ 32. Kb7 Rc5 33. Rgd1": "White has done a great job of defending, and I was beginning to fear that I may have let the win slip away. Since there is no more attacking lines, I decide to try my best to get the best position that I can before any major exchanges occur. \n",
        "33... Kf8 34. g5 Rb5+": "Forcing the king to the back rank. Of course white does not want to go to c7 or a7 because the knight check would force the exchange of rooks and black would be better because of the strong bishop.\n",
        "35. Kc8 Bd4 36. Kd7 Be3": "?! Rb7+ was probably best to try and bait white to play 37. Kxd6?? Ke8! and white must continue with Rxb4, or otherwise mate is inevitable. This move gives white a good drawing chance after 37. Rb3! and I could not play Bxf4 because the knight would drop after Rdb1. \n",
        "37. Rdf1": "?! White is playing too defensively. Rb3! gives white good drawing chances since the bishop must stay back to defend the knight.  \n",
        "37... d5": "Giving some more breathing room for the bishop after a retreat c5. After this I have all the time in the world to plan the best way to continue. \n",
        "38. Rb3 Rb6 39. Rfb1": "Even though white has doubled rooks on the b file, there is no further way in which white can pursue an attack. Now I had a concrete plan, after 39...Bc5 40. d4 Be7 41. e5, I would find a way to place the my rook behind white's weak pawns which should result in a win.   \n",
        "39... Bc5 40. d4 Be7 41. e5 Rb7+": "Before I attempt to get my rook behind white's pawns, it is important to first force the king further away from the pawns and to relieve some pressure on the bishop. \n",
        "42. Kc8 Ra7": "! Finally finding a simple way to victory. Although material will once again be equal after 43. Rxb4 Bxb4 44. Rxb4, my rook can just drop behind white's pawns and pick them off since white's king can't defend them. \n",
        "43. Rb3xb4 Bxb4 44. Rxb4 Ke8": "! An important in-between move. If I was to play 44...Ra2? right away, white can hold to a draw after 45. Kd7 Rxh2 46. Rb8+ Kg8 47. Ke7 Rf2 48. Rf8 Rxf4. Even though I would be up two pawns after this line, there is no way that I could convert my advantage since I can't move the rook off the f file to protect the f7 pawn while white's king could simply move back and forth to e7 and e8 to keep up the pressure on the pawn.  \n",
        "45. Rb2": "So white has a chance to defend one pawn at least, but after 45...Ra3 white must choose between keeping the d or f pawn. \n",
        "45... Ra3 46. Kc7 Ke7 47. Rd2 Rf3": "Now that I will be up a pawn, it still won't  be a clear cut win. White can move the king to c5 to protect the d4 pawn to allow white's rook to defend the h and g pawns.\n",
        "48. Kc6 Rxf4 49. h3": "! This subtle move protects everything, for now at least. Any way in which I try to attack the h pawn would result in the rook backing it up with Rh2, then following it up with h4 to protect the g pawn. \n",
        "49... Rf3 50. Rh2 Rg3 51. h4 Rg4": "This square movement that I just made with the rook may not appear to make too much sense, but it works out very well. After the king moves to c5, there is absolutely nothing that white can do other than move the rook back and forth along the h file to continue to protect the h pawn. This will give me all the time in the world to bring my king over to g7, after which I can follow that up with pawn to h6 to force a pawn exchange which will allow my king to attack the h pawn as well. \n",
        "52. Kc5 Kf8 53. Rh3 Kg7 54. Rh2 Rf4": "A safe which secures the f file. Of course, there is no rush in playing h6. \n",
        "55. Rh3 h6 56. gxh6+ Kxh6 57. Rh2 Kh5": "White is running out of time. Although I still can not play Rxh4? right away because of Rf2, my king still has room to run over to g4 to try and push the rook off of the h file. \n",
        "58. Kd6": "A good try, but I will not be foolish enough to play Rxd4? Again, this will let white draw after Rf2. \n",
        "58... Kg4": "So I continue with my plan, forcing the king back to c5 since my rook can now block after Rxd4, Rf2, Rf4. \n",
        "59. Kc5 Rf1": "Taking away the rook's last escape square on the h file, making Kg3 followed by the loss of the h pawn inevitable.   \n",
        "60. Kd6 Kg3 61. Rd2 Kxh4": "The rest of the game is mop up. All that I need to do now is push my g pawn to the promise land. \n",
        "62. Rh2+ Kg3 63. Rh7 g5 64. Ke7": "A last ditch effort to try and win the f pawn, but it is too late since the g pawn will promote well ahead of white's e pawn.\n",
        "64... g4 65. Rxf7 Rxf7+ 66. Kxf7 Kf4 67. Kxe6 g3": "White resigns seeing that there is no possible way to promote in time. This was a hard fought battle and a fun game to play. Any comments or criticisms are greatly appreciated.  \n"
    },
    "url": "https://gameknot.com/annotation.pl/my-first-expert-victory?gm=55370",
    "gameName": "My First Expert Victory ",
    "players": "escoliosis (2082) vs. ben13 (1961)",
    "opening": "Sicilian (B23), closed, 2...Nc6"
}