{
    "moves": {
        "1. c4 e6 2. Nf3 d5 3. cxd5": "A large number of people play this move.\nAlternative variation: 3. d4 [is best here, I think.] \nAlternative variation: 3. g3 [playable.] \nAlternative variation: 3. b3 [also playable here.] \n",
        "3... exd5 4. d4 Nf6 5. a3": "Alternative variation: 5. Nc3 [should be considered here.] \n",
        "5... Bd6 6. Nc3 c6 7. Bg5 O-O 8. e3 Bg4": "Getting the Bishop out before my Knight. I want to play Nbd7.\n",
        "9. Be2 Nbd7 10. O-O h6 11. Bh4 Re8 12. Re1": "Here I had a number things, or fantasy positions, I wanted to go for. I wanted to unpin my Knight , so a Queen move here is what I was looking at here.\n",
        "12... Qc7": "This was move I had chosen.\nAlternative variation: 12... Qb6 [This is the move I looked at more than any other, I wonder why I didn't play it.] 13. Qc2 g5 14. Bg3 Bxg3 15. hxg3 Bh5 [Heading to g6.] \n",
        "13. Bg3 Bxg3 14. hxg3": "Wow! I was planning to double the pawns, but my opponent has done that for me. This is the only advantage I had in the game for the next 15 or 20 moves. My pawns are better here, This is what Karpov and Capablanca would call a long term strategic advantage. \n",
        "14... Ne4 15. Qc2": "Alternative variation: 15. Nxe4 Rxe4 [Followed by Nf6 or Rad8 or Qb6 to attack the b pawn.]  (15... dxe4 16. Nd2 Bxe2 17. Qxe2 Nf6) \n",
        "15... Nxc3 16. Qxc3 Bxf3 17. Bxf3 Nf6 18. Rac1 Ne4 19. Bxe4 Rxe4 20. b4 Re6": "Now I don't to lose a tempo with f2-f3.\n",
        "21. b5 Rc8 22. a4 a6": "I don't know how if this was a good move or not. It just seems right to play, so I did. \n",
        "23. bxa6": "Alternative variation: 23. bxc6 Rxc6 (23... Qxc6 24. Qxc6 Rexc6 (24... bxc6 25. Rc3 Kf8 26. Rec1 (26. Rb1 a5 27. Rb6 c5 28. Rxe6 fxe6 29. dxc5 Rc6 [My opponent has two pawn island to my three, but I still think I have an advantage here.] ) ) 25. Rxc6 Rxc6 26. Rb1 Rc7 (26... b6 [Not sure if this wolud be a good move or not. ] ) ) 24. Qb2 Rxc1 25. Rxc1 Qd7 26. Rxc8+ (26. a5 Rxc1+ 27. Qxc1 Qb5 28. Qc8+ Kh7 29. Qc7 f6) 26... Qxc8 27. Qb3 Qc6 [Standoff.]  \n",
        "23... bxa6 24. Rcb1 c5": "I wasn't planning on this move, but when Rb1 was played, I wanted to strke for the soon to be open c-file. I didn't plan on using the b-file at all, I just wanted to protect c6.\n",
        "25. Qxc5 Qxc5 26. dxc5 Rxc5 27. Rb4 a5": "Alternative variation: 27... Re4 28. Rb6 (28. Rxe4 dxe4 29. Rd1 (29. Rb1 Rc4 30. Ra1 a5) 29... a5 30. Rd4 Re5 31. f4 exf3 32. gxf3 Rxe3) 28... Rxa4 29. Rb8+ Kh7 30. Reb1\n",
        "28. Rd4 Re4 29. Red1 Rxd4 30. Rxd4 Rc4": "Alternative variation: 30... Rc1+ 31. Kh2 Rc4 [This was also a thought.] \n",
        "31. Rxc4": "Alternative variation: 31. Rxd5 Rxa4 [The only problem here is that the Rook is in front of the passed pawn and not behind it.] 32. Rd8+ Kh7 33. Rd7 ( 33. Ra8 Kg6 34. Ra6+ f6) 33... Kg6 34. Ra7\n",
        "31... dxc4 32. Kf1": "Here I had to count to see if my King would get to the c pawn in time.\n",
        "32... Kf8 33. Ke2 Ke7 34. Kd2 Kd6 35. Kc3 Kc5": "Now that the passed pawn is protected, how can I put White into Zugzwang.\n",
        "36. f4 f5": "This move jump out at me like a lighting bolt, but not there yet.\n",
        "37. g4 g6 38. gxf5": "Alternative variation: 38. g3 h5 39. gxh5 (39. gxf5 gxf5)  39... gxh5\n",
        "38... gxf5 39. g3 h5": "Zugzwang.\n",
        "40. e4 fxe4 41. f5 e3 42. f6 Kd6 43. Kc2 c3": "Alternative variation: 43... Ke6 [The winning move for me.] \n",
        "44. Kxc3 e2 45. Kd2 Ke6 46. f7 e1=Q+ 47. Kxe1 Kxf7 48. Kf2 Kf6 49. Kf3 Kf5 50. Ke2 Ke4": "Alternative variation: 50... Kg4 51. Kf2 Kf5 52. Kf3\n",
        "51. Kf2 Ke5": "Alternative variation: 51... Kd4 52. Kf3 Kc4 53. Kf4 Kb4 54. Kg5 Kxa4 55. Kxh5 Kb4 56. g4 a4 57. g5 a3 58. g6 a2 59. g7 a1=Q 60. g8=Q Qh1+ 61. Kg6 Qg2+ 62. Kf7 Qd5+ 63. Kg7 Qg5+ [Draw] \nAlternative variation: 51... Kf5 52. Kf3 Kg5 53. Kg2 Kg4 54. Kf2 Kg5 55. Kf3 Kf5\n",
        "52. Ke3 Kd5": "Alternative variation: 52... Kf5 53. Kf3\n",
        "53. Kf4 Kc4 54. Kg5 Kb4 55. Kxh5 Kxa4 56. g4 Kb3": "Alternative variation: 56... Kb4 57. g5 a4 58. g6 a3 59. g7 a2 60. g8=Q [No check, as in the game.] 60... a1=Q [Draw.] \n",
        "57. g5 a4 58. g6 a3 59. g7 a2 60. g8=Q+ Kb2 61. Qb8+ Ka3": "Alternative variation: 61... Ka1\n",
        "62. Qa8+": "Alternative variation: 62. Qe5 Kb3 [Winning move for my opponent, as pionted out in the chat by another playerafter the game. Wow! Only I can turn a win into a lose. Oh well, that's chess.] 63. Qh8 Kc2 64. Qa1 Kb3 65. Kg4 [Bringing the King over to help and the game will be over shortly.] \n",
        "62... Kb2 63. Qb7+ Kc1": "Alternative variation: 63... Ka1\n",
        "64. Qa6 Kb1 65. Qb5+ Kc2": "Alternative variation: 65... Ka1\n",
        "66. Qa4+ Kb2 67. Qb4+ Ka1": "Keeping the King in the corner as much as possible.\n",
        "68. Qa3 Kb1 69. Qb3+ Ka1 70. Qa3 Kb1 71. Qd3+ Kb2 72. Qd4+ Kb1 73. Qb4+ Ka1 74. Qa3 Kb1 75. Qxa2+ Kxa2": "Draw better than a lose. I let one get away...again. The truth is, we BOTH let that one get away, but I had the win first.\n"
    },
    "url": "https://gameknot.com/annotation.pl/my-game-against-roninreturns?gm=55261",
    "gameName": "My game against roninreturns.",
    "players": "roninreturns (1355) vs. herbie53 (1269)",
    "opening": "English opening (A13), Agincourt variation"
}