{
    "moves": {
        "1. c4": "When I have spoken to people and asked, given the choice what would you prefer to trade? An active knight for a strong bishop, or vice versa? The majority usually opt to trade the knight for an opponents bishop I would say, in my experience. However this game serves as an example of just how lethal a pair of active knights really can be.\n      The English, I like this opening myself, which means I also know how it works...",
        "1... e5": "I stake my claim on the center, white cannot be given time to consolidate a strong center himself..",
        "2. Nc3": "By the book....",
        "2... Bc5": "Some people don't like this move, I still use it though I often get good results when I do, maybe not strictly because of this move though....",
        "3. g3": "e3 is often the response, I like that it's not....",
        "3... Nf6": "Because I don't have to spend time moving my bishop around yet..",
        "4. e3": ".....",
        "4... d6": "I decide I'm happy to trade bishop for knight at this point if it came down to it...",
        "5. Bg2 c6": "Defending againt Nb5/d5 or a sneaky + on a4...",
        "6. Nge2": "Ready to 0-0",
        "6... Be6": "....",
        "7. d3": "....",
        "7... O-O 8. b3": "Allowing the d-pawn to continue it's march and possible suicide on d4...",
        "8... Qd7": "All good preparation so far....",
        "9. O-O Bh3": "A common but effective tactic to annihilate the defending bishop...",
        "10. Re1": "....",
        "10... Na6": "Not the usual way of developing a knight but I felt c7 was a good route for it to take to enter battle..",
        "11. a3": "These pawn pushes are giving me time to swing my Q's knight over towards the white king....",
        "11... Bxg2": "As he didn't play Bh1 I don't give a second chance for a change of heart...",
        "12. Kxg2 Nc7 13. Na4": "Now I'm in the position where I can't save the loss of both bishops....",
        "13... Ne6": "So I press on galloping my horses into battle...",
        "14. Bb2": "Now I have to decide if I want to move that Bishop and save a pawn...",
        "14... Ng5": "The Attack seemed more critical than the defence of a pawn, I didn't want to be slowed down or distracted by minor issue's, knowing full well just how often games are decided by such \"minor\" issue's...",
        "15. Ng1": "Defending against Qh3+ and a nice little attack....",
        "15... Bb6": "I can save the pawn now, I don't wanna give it away for nothing...",
        "16. Qc2 h5": "I wanted to send in a battering ram if poss, also it serves as an outpost for g4 for a minute....",
        "17. Nxb6 axb6": "The Bishop wasn't playing a leading role in the game so I was content for it to perish...",
        "18. f4": "This move caused me to take stock, I couldn't take with the e pawn b'cus the exchange on f6 would rip open my kings defences and expose him to the harsh realities that no king need endure, So...",
        "18... Ngh7": "I give up the pawn...",
        "19. fxe5 dxe5 20. Bxe5 Ng4": "I had forseen this sequence and I liked how it looked...The white king is exposed to the elements and both my knights are within striking distance...",
        "21. Bb2": "Back to safety, but also out of the way....",
        "21... Rfe8": "Threatening to even up the score...",
        "22. Qc3": "White makes a threat of his own, a deadly one!",
        "22... Nhf6": "Putting a stop to that!",
        "23. d4": "This move allows a beautiful ending to the game leaving white helpless...",
        "23... Ne4": "......",
        "24. Qb4": "Again attacking the fodder....",
        "24... Qf5": "While I seek to end it permanently..",
        "25. Ref1": "Re2 might have been a better defence....",
        "25... Nxe3+": "A nice little fork, although.....",
        "26. Kh1": "Forced...",
        "26... Nf2+": "I could have been greedy and slaughtered a rook here for free but this seemed the best move to me, far more elegant. As a consequence my opponent resigned, there is no defence 27.Rxf2 Qxf2 and white cannot defend against mate on g2 next move. A nice example of knight dominance I thought. Thx and comments are always welcome."
    },
    "url": "https://gameknot.com/annotation.pl/my-kingdom-for-a-horse-q-a-com?gm=30444",
    "gameName": "My Kingdom for a horse Q.A.com",
    "players": "Carp diem (1887) vs. Me  (2001)",
    "opening": "English opening (A21)"
}