{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Bc4 Bc5 4. c3 Nf6 5. d4 exd4 6. cxd4 Bb4+ 7. Bd2 Bxd2+ 8. Nbxd2 d5 9. exd5 Nxd5 10. Qb3 Nce7 11. O-O O-O 12. Rfe1 c6 13. Rac1 Qb6 14. Bxd5 Nxd5 15. Qc2 Nb4": "Threatening the Q and unprotected White pawn on a2. Also protects the Black pawn on c6",
        "16. Qb1 Be6": "Bringing another piece into the action with the aim of either 18...Bxa2 or 18...Bxf3. Also connects the rooks and extinguishes the possibility of Rxe8#",
        "17. a3 Nd5": "Moving the knight back towards the centre. Will aim to bring the rooks into action soon.",
        "18. b4 Rac8": "This is the first in a series of positional moves I'm aiming to put together. Next I will transfer the queen to the other side of the board via b6-d8 before shifting my knight to f4.",
        "19. Nc4 Qd8 20. Qc2 Nf4 21. Qd2 Nd5": "Trying to keep the knight in the 16 inner squares. I will now work on getting pawns on the a-b-c files up the board.",
        "22. h3 b6 23. Qd3 Nf4 24. Qe3 Nd5": "I've decided to play the patience card here and try not to do anything rash. If I see anything better later, I'll play it, but at this moment I'm happy to chew up some time. Depending on what White decides to play next, I may push b6-b5 to put pressure on the c4 knight.",
        "25. Qd2 b5 26. Nce5": "A good move that makes my previous b5 push look silly.",
        "26... Nf6": "keeping the knight in the middle of the board and freeing the diagonals for the bishop",
        "27. Nxc6": "An even better move that forces the queen to be moved. I am now a pawn down on material.",
        "27... Qc7 28. Nce5 Qb7": "with the aim of getting to a6 to attack the vulnerable white a-pawn ",
        "29. Nd3 Qa6 30. Rca1 Rfe8 31. Nc5 Qc6 32. Rac1 Bd5": "With the aim of trading off pieces and leading into the endgame."
    },
    "url": "https://gameknot.com/annotation.pl/n-three?gm=41926",
    "gameName": "N.Three",
    "players": "alphamouse (1200) vs. jwzwong (1200)",
    "opening": "Giuoco Piano (C54), Krause variation"
}