{
    "moves": {
        "1. e4 c5 2. Nf3 d6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 a6 6. Bg5": "from the najdorf tournament. Thanks to enasab i know now better the sicilian.",
        "6... e6": "my favorite defense, tending to be able to castle gently or to have good opportunity in the center.",
        "7. Qd2 h6 8. Be3 Ng4": "so i can exchange the good bishop for the average knight",
        "9. Be2 Nxe3 10. Qxe3 b5": "classical move for najdorf",
        "11. b4 Be7": "I am now ready to castle, which seems frequently difficult for black",
        "12. O-O": "white casltling too. Frequently najdorf leeds to o-o-o for white.",
        "12... O-O": "i really felt secure here",
        "13. a4": "but white has found a way to disturb me, though",
        "13... bxa4 14. Nxa4 Bd7 15. c4": "i guess the idea was to create a hole on queen side",
        "15... Nc6": "i have been thinking a good while here",
        "16. b5": "excatly because of this move... but it is clearly a mistake... seen why? Because d4 and a1 are on the same diagonal...",
        "16... Nxd4 17. Qxd4 Bf6": "and this is the key",
        "18. Qe3 axb5": "i could have played the obvious Bxa1 now, but I found out that in that case i only gain a quality and white can have a passed pawn...",
        "19. cxb5 Bxa1 20. Rxa1 Ra5": "now, b6 would face Rxa4. ",
        "21. Ra2": "tries to free his knight.",
        "21... Bxb5": "but it is too late for his pawn then",
        "22. Bxb5 Rxb5 23. h3 Qb8": "it is not simple yet now: i only have a quality and a pawn. ",
        "24. Ra3": "he clearly tells me: go ahead I want to see what you have",
        "24... Rb1+ 25. Kh2 d5+": "well i have... this...",
        "26. g3 dxe4": "now Qxd4 would meet Qd2 with the necessity to exchange queens.",
        "27. Nc3": "preferes not to",
        "27... Rb3": "well then I exchange the rooks",
        "28. Rxb3 Qxb3 29. Qc5 e3": "pawn lost of lost, i dismantle his pawn structure",
        "30. fxe3 Qb2+ 31. Kg1 Ra8": "and... threats mate -resign"
    },
    "url": "https://gameknot.com/annotation.pl/najdorf-for-fast-players?gm=32959",
    "gameName": "Najdorf for fast players",
    "players": "aitrie (1513) vs. thitho (1732)",
    "opening": "Sicilian (B95), Najdorf, 6...e6"
}