{
    "moves": {
        "1. e4": "another game with edler that could have been shorter...",
        "1... c5 2. Nf3 d6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 a6": "I begin to know this opening, hello najdorf",
        "6. Bg5": "and here is the end of the themes. This is the last game of this tournament, i finished 4th.",
        "6... e6": "my favorite defence",
        "7. f4": "the most aggressive, i guess",
        "7... Be7": "maybe safer is Nbd7, but I wanted to try this one",
        "8. Bd3 Nbd7": "a big bowl in the centre of my defence... Najdorf is not very safe for black defence.  I learned that you have to be very precautionous. This tournament learned me a lot of stuff.",
        "9. f5 e5 10. Nf3 h6 11. Bh4": "here i studied carefully the next 10 moves... And I decided I was up one pawn.",
        "11... Nxe4 12. Bxe7": "12 Nxe4 loses the bishop with a check: ... Bxh4+ 13 Nxh4 Qxh4+ and the queen can come back to protect the pawn if necessary.",
        "12... Nxc3": "and here go the queens.",
        "13. Bxd8 Nxd1": "the option 13 bxc3 Qxe7 is really worse for white as it isolate two pawns on c-column, which is open for black.",
        "14. Bc7 Nxb2 15. Bxd6 Nxd3+ 16. cxd3 f6": "one pawn ahead and a much better structure. I think that at a good level, white should already resign. Here edler is right to continue: I am not a good player.",
        "17. O-O Nb6": "continuing the development and threatening f5, which means gaining another tempo",
        "18. Nh4": "the knight is out for the battle for a good while, as we'll see.",
        "18... Kf7": "a fake casling. I am sort of proud in a humble way for these 2-3 movements here, after the exchanges.",
        "19. Rad1": "Now white try to diminish his structure's weaknesses, for example by exchanging a bad pawn against a good one. ",
        "19... Nd5": "but I found out how to refuse the exchange.",
        "20. Rde1": "white's hesitations.",
        "20... Re8": "preparing the eventual d4.",
        "21. Rec1": "what will I do, says white...",
        "21... Bd7 22. Rc5": "ah, finally... but this is pointless. ",
        "22... Bc6": "a very good option, as it threatens, if necessary, Rad8 and Ne3. So black has to find a way out for his bishop.",
        "23. d4": "one option. Not mine. I would have played Rcc1.",
        "23... e4": "and here is my past pawn... brave soldier is going to win my esteem.",
        "24. Re1 Rad8": "go away, you fool.",
        "25. Bg3 Nb4": "overprotecting e4, but also threatening Nd3... So white has to retreat on c3 and loses his pawn d4.",
        "26. Bf2": "but he prefers to keep the pawn...",
        "26... Nd3 27. Rxc6 bxc6": "I am not sure I played the best move here. But I already have a quality and a pawn.",
        "28. Rb1 Nxf2": "once again, maybe not the best move... I should have consider more carefully e3.",
        "29. Kxf2 Rxd4": "so finally white will exchange the bad pawn...",
        "30. Rb6": "... against my own bad pawn :-) So i agree",
        "30... e3+": "step by step...",
        "31. Ke2": "maybe Ke1 was better",
        "31... Rd2+": "have you seen what I missed???",
        "32. Ke1 Rxa2": "but ok, I am still well ahead...",
        "33. Rxc6 a5": "the second soldier is on his way... what left has white? Wouldn't you have resigned for a long time? edler wouldn't...",
        "34. Rc7+ Re7 35. Rc1": "exhcange is of course excluded for white.",
        "35... a4 36. Ng6": "finally the knigt awakes (well, I should have killed him a few moves ago, but... ok)",
        "36... a3": "Is it a mistake? No, I said to myself: if you want to take the quality back, it is ok for me: my 2 pawns are ready to make some better improvements.",
        "37. Nh8+": "but white has a final trick in mind!!!!",
        "37... Ke8": "of course not Kg8 => 38 Rc8 Kh7 forced 39 Ng6 is lethal. And Kf8 leads to repeating moves.",
        "38. Ng6 Rd7": "well now, I disconsider the exchange :-)",
        "39. Nf4 Rb2": "pass, my dear boy.",
        "40. Ne6": "last last last trick?",
        "40... a2 41. Rc8+ Ke7 42. Rc1": "it really was \"pour la galerie\".",
        "42... Rb1": "and white finally resigns... :-("
    },
    "url": "https://gameknot.com/annotation.pl/najdorf-for-fast-players?gm=34753",
    "gameName": "Najdorf for fast players",
    "players": "edler (1536) vs. thitho (1790)",
    "opening": "Sicilian (B98), Najdorf, 7...Be7"
}