{
    "moves": {
        "1. e4": "This game, played between the last two undefeated players of this mini-tournament, is an instructive example of how quickly things can go wrong in an open game. White made a slight inaccuracy in the opening and, though Black (me) did not find the most accurate continuation right away, I was able to pose some concrete problems that my opponent failed to meet actively and energetically enough.",
        "1... e5 2. Nf3 Nc6 3. d4": "The Scotch Game – though the idea of advancing the d-pawn right away is a simple one, the resulting positions tend to be complex and challenging to play for both sides.",
        "3... exd4 4. Nxd4 Nf6": "The other common line is 4. …Bc5, where White has either 5. Be3 Qf6 6. c3 0-0 7. Bc4 with a tense position, or else 5. Nxc6 Qf6 6. Qd2 dxc6, with Black's activity compensating for the slightly damaged pawn structure. Of course not Nxd4 5. Qxd4, when White's Queen radiates power over the entire board and cannot be easily challenged.\nI chose 4. …Nf6 because in my opinion it gives Black good chances to complicate the game and outplay the opponent.",
        "5. Nc3": "Popular, but not as challenging as 5. Nxc6?! bxc6 6. e5!? Qe7 7. Qe2 Nd5 8. c4 Ba6! with extreme complications to come. After the less ambitious text move, Black can put the White center under a lot of pressure.",
        "5... Bb4 6. Nxc6 bxc6": "…dxc6 is sadly not an option due to Qxd8+.",
        "7. f3": "?! An inaccurate move, misjudging the needs of the position. White secures the center pawn, but what he really needs to do now is develop and get the King out of the center. To this end, Bd3 is the normal move, while Qd4!? is also logical.\n7. f3 seems to secure the center for good, but in fact the e-pawn is going to be gone in a few moves, after which White will be behind in development and having the pawn on f3 will just leave a weakness on the kingside.",
        "7... d5": "! Striking back in the center immediately. Black wants to eliminate the e-pawn and open lines while White is still two moves away from castling.\n\nI also considered some kind of Knight sacrifice to allow …Qh4+, but I could not find anything worthwhile after 7. …Nxe4? (…Nd5? is similar) 8. fxe4 Qh5+ 9. g3 Qxe4+? 10. Qe2! and the Queen is now pinned and must be traded off, ending the attack.",
        "8. exd5": "Ceding the center to Black, though 8. Bd3 dxe4 (…d4?! 9. a3 gives Black very little) 9. fxe4 (Bxe4?! Qxd1+ 10. Kxd1 Bxc3 11. bxc3 Nxe4 12. fxe4 Bg4+ ∆…Rd8(+) and Black's pieces are more active) Bg4 10. Qd2 is hardly better.",
        "8... cxd5": "? Here, being all too happy with my position, I made a careless natural move that should have let White off the hook. Much better was …Bxc3+!, after which might follow 9. bxc3 cxd5 and now 10. Qe2+ can be safely met with …Be6 11. Bb5+ Nd7 with ideas of …a6 and …Qh4+, or just …0-0 and a gradual buildup in the center. Black has better development and central control, while White has both Kingside and Queenside weaknesses and lacks a safe place to put the King. \nBy failing to make this exchange now, Black allows White a chance to get the King out of the center right away and avoid the grim fate described above. \nThe pawn sacrifice with …0-0!? was also interesting and deserved consideration.",
        "9. Bd2": "? This moment is the critical point that decides the course of the entire rest of the game. White misses his last chance to safeguard the King and equalize. \nThis is a very instructive psychological error. 9. Bd2 seems like an entirely natural and logical move: it develops and breaks the pin on the Knight. The problem with this line of thinking is that it misses the urgency of the situation: White's position is extremely perilous and requires radical action. The White king is sitting on an open e-file and needs either three moves to castle safely on the Queenside, or else two moves to run to the dubious shelter of an airy (remember 7. f3?) Kingside. True, Black has no immediate threats against the King, but that does not matter: if the White King does not make it out of the center safely, Black can take all the time he needs setting up threats against a sitting-duck target. Thus, urgent tactical means are necessary to get the King to safety NOW: 9. Qe2+! Qe7 (forced: …Be6? loses to 10. Qb5+!, winning the Bishop – this is why Black should have traded last move) 10. Bd2 and White can castle safely next move. With the King castled and the Queenside pawns intact, White is out of danger.\nAfter the text, Black is able to keep the White King in the center long enough to build up a crushing attack. Not realizing the danger of the situation, White did not look for an antidote: as a lesson to all players, it is hard to find a solution to your problems if you don't know that they're there!",
        "9... O-O 10. Be2": "White looks to be ready to castle and finish development, but now Black is ready to start making threats:",
        "10... d4": "! Driving the Knight back.",
        "11. Nb1": "This fits in with Blacks plans a bit too easily. 11. Nb5? Bc5 ∆ …c6 puts the Knight similarly out of play, but 11. Na4 Qe7 12. 0-0 Bd7 13. b3 Bxa4 14. bxa4 gives Black only a small advantage.",
        "11... Bc5": "! Exchanges with Bxd2+? would just ease White's traffic jam on thr first two ranks. The Bishop has served its purpose on the Queenside and now reposts itself to control the Kingside dark squares. Castling is prevented by the threat of …d3+. Already, White has very few useful moves.",
        "12. Bg5": "What else? The LSB must stay and block the e-file, the Queen and Rooks have nowhere to go, and the Knight has only a3 as a safe destination.",
        "12... Re8": "Continuing to tie White up and build pressure.",
        "13. Qd3": "?! White thinks to blockade the d-pawn and allow castling, but this plan has a tactical flaw – the blockade can be broken! White had no better than Kf1, thanks to the threat of …Ba6.",
        "13... Qd6": "Unpinning the Knight, yes, but also preventing castling for yet another move thanks to a surprising combination that my opponent overlooked.",
        "14. O-O": "?? Losing on the spot, though White's game was already very difficult. Instead, Kf1 is the only safe way to break the debilitating pin on the e2-Bishop. Black could then increase the pressure either with …a5 (∆ …Ba6) or with the simple …Nd5.\n",
        "14... Ba6": "!! White thought to prevent this move with Qd3, but Black can play it anyway! There is no way to avoid the loss of material.",
        "15. Bf4": "A creative, though insufficient, response that I had not expected.\n15. Qxa6? drops the Queen to …d3+!, while otherwise the threats of Bxd3, d3+, and R/Bxe2 are decisive.",
        "15... Qxf4 16. Qxa6 d3+ 17. Kh1 dxe2 18. Re1 Bd6": "Black's advantage is overwhelming and any number of moves win here, but this one ends things quickly. Once you have an advantage, don't sit there waiting for the position to win itself – that's when you get swindled. When you smell blood, go for the throat!",
        "19. g3 Qxf3+": "19. Kg2 Bc5#\n\nAn instructive miniature!"
    },
    "url": "https://gameknot.com/annotation.pl/nando_52s-mini-tournament-iv?gm=30132",
    "gameName": "nando_52's mini-tournament IV",
    "players": "philip1234 (1669) vs. jestey1 (1852)",
    "opening": "Scotch (C45), Schmidt variation"
}