{
    "moves": {
        "1. Nf3 d5": "On a blitz game, I won't think too much: the Reti is an \"open\" start move, I just will go to the scheme I know best.",
        "2. e3 Bf5": "I already know I would play h6, e6, c5, almost for sure. ",
        "3. Be2 Nf6 4. O-O h6 5. d3 e6": "White helped me, with this passive opening. ",
        "6. Nd4": "But now, something changes. This is the first \"real\" move. Ok, no problem. I will retreat my bishop, and the naughty knight can go nowhere to be dangerous, while it is ready to be kicked away with c5 - or even e5, if I decide so.",
        "6... Bg6 7. Bf3": "Ok, the good thing is this way I will get some tempo, sooner or later, attacking h2. The bad part is that he will be able to press hard on the diagonal - and b7 if ever my pawn chain gets open. Which is not likely just now, but wait...",
        "7... c5 8. Nb3 Nc6 9. c4": "Normal, he wants to put a question mark on my pawn chain. Now, d4 is the \"normal\" move. He can exchange the pawns, or the bishop, but nothing too dangerous. So, I tried something more interesting... at a blitz sight. ",
        "9... Nb4": "Now I am the one that threats the white diagonal, and the nasty knight is mine. Look: incredibly enough, it is not that easy for him to defend d3! It just lacks of a minor piece behind it! Let's see what he does. ",
        "10. cxd5": "He went for it. A logic decision for a blitz game. Now, again, I can play Nxd5 (or exd5) etc. etc. But I went for the tactic.",
        "10... Bxd3": "A lot of things are possible, here. If dxe6, the white bishop can take b7, threatening my rook, and e6 can take f7, giving check and weakening my king's position. On the other side, my bishop is threatening the rook f1, and the knight is approaching to a fork on c2. Normally, those forks are bad, because I will lose two pieces for a rook. BUT I had the feeling (I couldn't calculate it) that the knight will survive: look, after he takes the rook e1 (it will be there if he tries to save it), the queen would have taken the bishop and I will be able to play NxBf3 with check, so no danger...",
        "11. Re1": "He did the first part. I would have played dxe6, leaving me the decision to be greedy (BxRf1) or try to save the day with fxe6. This one is bad, since white throws in Bh5+ and my king goes dangerously out in the worst possible way, no matter BxR or Nc2, winning another rook, I will probably be lost. But he behaves... good boy!",
        "11... exd5": "I still have Nc2, but I didn't want to give away the B unless necessary. This way, I prevent some bad surprise on the diagonal, ensuring a retreat point for my bishop, etc. I think I could have though about c4, solidifying the bishop and making Nc2 much more dangerous, but I was not sure about e6xf7+...",
        "12. a3": "Ok, so he makes it, so I have to prove my early intuition was right. Here I go:",
        "12... Nc2 13. Qxd3 Nxe1 14. Qb5+": "Yes, the only flaw in the plan. But too bad and too late. Anyway, I have won the exchange, I only have to keep the knight and don't lose it. ",
        "14... Qd7 15. Qxd7+": "it",
        "15... Kxd7": "I won't lose my nice d5 pawn, of course. In fact, he is more or less the knight safeguard. Now, in a blitz, it is very easy to become nervous and play Nc2, but I had the feeling it would have just made me lose the knight. So,the most important thing: \"keep (or exchange) the knight\".",
        "16. Be2": "Bad move, but I understand he wants to keep the pawns lined and the bishop pair. But it just doesn't work, because of my d5 pawn!",
        "16... c4": "Just to create a support for my knight. ",
        "17. Nd4 Nd3": "I know he can exchange it, and probably he will get the pawn, too, but it is still better than lose the knight stupidly. ",
        "18. Bxd3 cxd3 19. Bd2": "The pawn in d3 STILL is hard to attack!!!! :-) Who digged this \"hole\" in white? :-D",
        "19... Ne4": "Yes, I know, I have to develop, but I just wanted to squeeze him a little more... ",
        "20. Be1": "Now, c1 is a juicy \"hole\" for my rook!",
        "20... Rc8 21. Nd2": "Naive plan, I have to admit. But if he exchanges, it is all in my favour, so no problem. Of course, f3 is coming...",
        "21... g6": "Too bad. I have to limit a little the action of the Nd4, and I thought the big diagonal would have been a fantastic place for my bishop, \"looking\" at b2.",
        "22. Nd2b3 b6": "Not accurate. It was not so dangerous Na5.",
        "23. Rd1 a5": "Now I'm playing changing plans: I thought that after a4 the knight have to fly, and my rook can go to c1. To change plans in the middle of one of them is always dangerous (if not bad).",
        "24. Rxd3 a4 25. Nd2 Rc1": "So I lost my beloved d4 pawn. Probably, with accurate play, I could have made much harder for him to take it, but... I like the Rc1, too. What I don't like is the weak d5, my king and his rook, all lined up...",
        "26. Kf1 Nc5": "No, I'm not trapping the rook, I just want to stay calm and exchange it so to avoid possible tricks. A pity, in a timed game this position deserves more accurate calculations. ",
        "27. Rc3 Rxc3 28. bxc3": "In doing so, the a pawn will fall to my bishop, that is playing without moving (I love it!)",
        "28... Nd3 29. Ke2": "I know all the stuff about active pieces etc. etc.Probably Nb2 would have been better, but then Nc2 defends the a pawn... and, in the endgame to come, a bishop is good for him, so...",
        "29... Nxe1 30. Kxe1 Bxa3 31. Nb5 Bb2": "Now see what happens: his knight must fly soon, and I will take c3... or not?",
        "32. Kd1 Kc6 33. Kc2 a3": "Ok, maybe this was the wrong plan, but I have a rook left to use.",
        "34. Nd4+": "He cannot keep his knight in the right position. Note that, being my king away, Nb1 forces me to use the rook to defend the a pawn, and he will win this fight with the help of his king. ",
        "34... Kc5 35. Nd2b3+ Kc4": "No tricky mate in sight, but I must be careful: two knights and pawns can be very dangerous. ",
        "36. g3 b5 37. Nd2+": "Of course, the b pawn is my great secret weapon, and he doesn't want to let me use it. (For beginners: funny, isn't it? My rook's actios is blocked by my own pieces, so the ONLY way I have to break into white's \"fortress\" is with the \"b\" pawn - even if helped with the rest of the pieces. Great frustration comes when you are up in material and you lose... you always have to identify the \"unbalancing\" piece of manouvre of a \"won\" position, if you want to cash the full point. I fail in it often...)",
        "37... Kc5 38. Nd2b3+ Kb6": "Now I realized the king was not THE piece to break in with, so I avoided more checks.",
        "39. h3 Rc8": "Now, the rook is a threat... because of b4! ",
        "40. Ne2 b4": "White surrendered here. A pity. But another pawn will fall, and it was matter of time (and a little technique). "
    },
    "url": "https://gameknot.com/annotation.pl/nasty-forks-and-break-in-a-defence?gm=40253",
    "gameName": "Nasty forks... and break in a defence.",
    "players": "reythekingofches  vs. damalfi ",
    "opening": "Reti opening (A06)"
}