{
    "moves": {
        "1. e4": "Hi everyone, had a good week this week - managed two draws against 1950  oppo.  Here is the first of the two.  Both games were Sicilians so good results.  Joanne",
        "1... c5 2. Nf3 Nc6 3. Bb5": "3. Bb5 - this move is the start of the Nimzo-Rossolimo attack which had a similar start to my game Pawn Stab.  My 1900  opponent plays the opening differently, however.",
        "3... g6 4. Bxc6 bxc6 5. O-O Bg7 6. Re1 Nh6": "6. ........ Nh6 - this knight will go to f7 on move 11.",
        "7. c3 O-O 8. d4 cxd4 9. cxd4": "9. c xd4 - white has a pawn centre but can this be maintained?",
        "9... d6 10. Nc3 f6 11. b3 Nf7 12. Bb2": "12. Bb2 - development nearly completed and it is when I play Qc2 next move.",
        "12... Ba6 13. Qc2 Qd7 14. Rad1": "14. Rad1 - after black played Ba6 on his 12th move I completed my development with my 13th and decided to centralise my queen rook to support my pawn centre.",
        "14... e5 15. dxe5 fxe5 16. Ba3": "16. Ba3 - after my pawn centre was busted a move ago I decide to pin and try and pile up on the d pawn.",
        "16... Qe6 17. Bc1": "17. Bc1 - bishop retreats to home square - I now try to force a knight exchange on g5 but black stops it with h6 - weakening his castled position.  I note this but at the moment cannot find anything to attack it with.",
        "17... h6 18. Bb2 Rac8 19. Qb1": "19. Qb1 - Glenda moves out of the way of the black rook on the c file and I prepare to put a rook on the c file to negate the black rook's control at a later date.",
        "19... g5 20. Nd2": "20.  Nd2 - this knight is making a tour to g3 hoping to come in on f5 or h5 to try and force an exchange of knight for dsb.",
        "20... Rfd8 21. Nf1 d5 22. exd5 cxd5 23. Ne2 Nd6 24. Nfg3 Qf7": "24. ........ Qf7 - the Wicked Witch of the West foils my plan, however.  Black now has a good pawn centre and a passed d pawn and a strong lsb.  Offset against it is a black isolani on a7 - also, Glenda has a clear line from b1-h7 - I would lurve Frere Leblanc to be on the board here but unfortunately he ain't so I must think of another way.",
        "25. f3": "25. f3 - this move allows Henry to move to h1 if necessary.",
        "25... Bb7": "25. .......... Bb7 - this move allows me to contest the c file without worrying about my d2 knight being lost should my g3 knight be driven away.",
        "26. Rdc1 Rde8": "26. ........ Re8 and DRAW OFFER!, or more pertinently for me, 6 rating points are on offer - I decide to run with the money!  In a post match analysis Coach Ion had the following to say:-\r\n\r\n\"I don't know what you had planned for next move, but Ba3 looks OK with the view of coming in at c5, after which a2-a4 and/or b3-b4 suggest themselves.\"\r\n\r\nSo, this is all worth noting if I find myself in a similar position later on.  For now I am a very happy lady and now, get ready for Near-Expert Draw Part II. "
    },
    "url": "https://gameknot.com/annotation.pl/near-expert-draw-part-1?gm=19639",
    "gameName": "Near-Expert Draw - Part 1",
    "players": "jstevens1 (1705) vs. luke_nl (1973)",
    "opening": "Sicilian (B31), Nimzovich-Rossolimo attack (with ...g6, without ...d6)"
}