{
    "moves": {
        "1. Nf3": "Here's the King's Indian Attack again.",
        "1... Nc6 2. g3 e5 3. d3 d5 4. Bg2 Nf6 5. Nbd2 Be7 6. O-O O-O 7. e4": "All book moves so far.",
        "7... dxe4 8. dxe4 Be6 9. c3": "I was outside the system for this move.\nI usually like Nc4, but that's before the d-pawns get traded. I often play c3 in this opening because it keeps his knight off of b4 -- and the pawn on c2 gets vulnerable if my queen wants to attack kingside. c3 also gives my queen an opening if she wants to attack on b3.",
        "9... Qd3": "That's new!",
        "10. Re1 Rad8 11. Bf1": "In all the years (okay, decades) that I've played the KIA, this may be the first time that I've undeveloped my bishop on move 11. I want to force the queen to retreat. I would've liked to play Qb3 except for his bishop on e6. His rook-queen battery pin my knight which traps the bishop, so I need to deal with that next.",
        "11... Qd6 12. b4": "So I can move out my bishop and have another rook protecting my queen.",
        "12... Bg4 13. Bg2 h6 14. b5 Na5 15. Qa4": "I'm not sure about this move -- it doesn't feel good. I feel like I'm moving my queen to where it can't do any good, but I've got to break the pin on both of my knights.",
        "15... b6 16. Nb3 Bxf3 17. Bxf3": "Now I know that my queen's out of place, while his pieces control the important d-file. I don't know how I'll be able to respond to Qd3. Probably take the knight, he'll take my bishop, and I'll have to put my knight somewhere. c6 would be a good outpost.",
        "17... Qd3 18. Nxa5 Qxf3 19. Nc6 Bc5": "That's a nasty threat on f2. I don't see anything but block it with Be3.  \n \nIf he plays 20. ... Rd2, then I get to play Nxe5 and I'm ahead.\n \nIf he plays 20. ... Bxe3, I recapture Rxe3. Then I have to worry about him playing Ng4 and Qxh2. So I probably play h4 to keep his queen off of h3. I'm not sure who's ahead then.\n\nOr if he plays 20. ... Ng4 (more threats against f2 and h2), I'll take the bishop on c5 and see what happens next.",
        "20. Be3 Ng4": "Wow, What an awesome move!\nI didn't think he could afford that because we'll trade bishops on c5, and then my queen will come back to c2 to guard f2 and keep his rook off of e2. But it just hit me that if he plays Rd2 instead of capturing my bishop, I might be dead. But everything else loses lots of material, so all I can do is capture the bishop and see if he'll play bxc5 instead of Rd2. This is not a good situation to be in, hoping that a 2055-player misses a move. More likely, I'm about to go behind in this game.",
        "21. Bxc5 Rd2 22. Nxe5 Nxe5 23. Bd4": "Well, I just looked at the standings for this match. We're down 1-3, and I have to win both of my games for us to get a draw. And I don't even see how I'll win either one. \nI've got to hold on to my bishop here no matter what, since next his knight goes to g4 and he'll have three pieces attacking f2. Fortunately, he can't put his knight on f3 while his queen is there! It'll get interesting if he plays Rd8 and trades his rook for my bishop.",
        "23... Ng4 24. Ref1 Rd8 25. Qb3": "This game's been moving so slowly that I almost forgot my plan to play Qb3 (and it's probably the only move that doesn't lose).\nNow, if he captures my bishop, I can go ahead and take back, and that gives me a discovered attack on his queen. And my queen's guarded by a pawn.",
        "25... a5": "A very nice move.\nHe threatens a4. I think I'll have to play bxa6 to stop it, and that lets him play c5 and remove my bishop defender. It looks like I can play h3 after that. My pawn are going to be an awful mess, but maybe I escape his attack.",
        "26. bxa6 e.p. c5 27. h3 h5 28. hxg4": "Suddenly, I feel like I've dodged the cannonball.\nMaybe Qb6 is better, attacking the rook and then taking the knight. But I've got to get fewer of his pieces around my king.",
        "28... h4": "How to stop h3?",
        "29. Qxb6 Re8": "He can't let me take his rook and check him because then my queen gets back to h4 and helps defend.",
        "30. e5": "I think that's my only hope. I'll be able to put the queen on b7 and guard g2 through his queen.",
        "30... cxd4 31. Qb7 Qxg4 32. cxd4 hxg3 33. Qg2 Rxf2 34. Rxf2": "No, I don't see any escape from this.",
        "34... gxf2+ 35. Kh1 Qxd4 36. Rf1 Re6": "Rxf2 loses to Rh6+.\nQxf2 loses faster to Rh6.\nBoth lose, but Qxf2 at least gives him more opportunities to make the wrong move.",
        "37. Qxf2 Rh6+ 38. Kg2": "Won't be long now. He's got a forced mate -- and I'll just make sure he sees it before resigning.",
        "38... Rg6+ 39. Kh1 Qe4+ 40. Kh2 Qxe5+ 41. Kh1 Qh5+": "Yeah, this is the one I knew I was a goner in. But it was a fun comeback for awhile."
    },
    "url": "https://gameknot.com/annotation.pl/nearly-a-comeback?gm=35643",
    "gameName": "Nearly a comeback",
    "players": "chuckbo (2004) vs. rollingpawn (2055)",
    "opening": "Reti opening (A04)"
}