{
    "moves": {
        "1. e4 e5": "I actually don't play double kingpawn openings very often.  When I do, it is typically a speed chess game where no record of the moves is kept.",
        "2. Qh5": "Quite the taboo in my book.  Every game I have played that has begun this way ended with the same ultimate result as this one.  I believe this game illustrates the flaws in this opening.",
        "2... Nc6 3. Bc4": "This is a \"double down\" on the previous mistake.",
        "3... g6 4. Qf3": "OK, let's compound the mistake.  It is true that black responses after e5 have been forced, but there is actually nothing wrong with black's play.  The continued pressure on f7 will force either Qf6 of Nf6.  White compells black into a set defence, but what does white really get out of constantly shuffling the queen from square to square?  Nuntar believes that Qf3 is the critical mistake, but I still contend that a fianchettoed kingside bishop is no real disadvantage.  Sure f6 and h6 are no longer controlled by a pawn, but fianchettos survive in top-level play today.",
        "4... Nf6": "After either Nf6 or Qf7, black is better developed and has the \"first move advantage.\"  At any rate the queen here blocks the f pawn.  Deployed back to d1, White can place pawns on d3 and f4, a knight on e2, and continue the attack.  The real problem is Black gains time at White's expense.  I think best is 5.d3 Na5.",
        "5. Nh3": "I would say at this point that the opening advantage for white is gone.  Every time I check the variations I see, I run into the same problem: White needs more preparation, but that preparation also allows Black to respond to the threats presented.  Nuntar and I have debated on whether Qf3 or Qh5 was a 'mistake' per se, but White's Nh3 allows Black the tempo he needs to start dictating the flow of the game.  I think it debatable whether Ne2 here was best largely because the White queen is impeded from d1 and because I really believe the best White plan includes f4.\r\n\r\nOne White variation keeps calling to me though: 5.Qb3 Nd5 6.Bxf7+ Ke7.  The white attack is complicated by Black rather quickly.  Take a look at http://gameknot.com/analyze-board.pl?bd=8062818 -I provided a clickable link in the comments-- Qb3 is played.  ",
        "5... Nd4 6. Qc3": "I think Qd1 is better, but that admits that Qh5 was a mistake.  Qf3 was entirely consistent with play up until this point.  Given that Qf3 forced Nf6, White should strongly consider Qd1, d3, and f4.  The White e pawn will fall, but the open files on e and f seem to suit the aggressive style of play that White sought until now.",
        "6... Nxe4 7. Qd3": "The only move owing to the knight fork threat.",
        "7... d5": "To a certain extent this is a bluff because to take the bishop is to cede the knight.",
        "8. f3": "? Loses the bishop.",
        "8... Nc5 9. Qc3 dxc4 10. Qxc4": "Black now has two options to consider.  Bxg3 and some other generally usefull developing move.",
        "10... Bf5 11. Na3": "I had hoped to exploit the c2 vulnerability, but, as it turns out, I ended up liking his knight out on the edge of the board influincing play as little as possible.",
        "11... Bxh3": "The c2 square is not easily exploited anymore, and I thought that bringing my queen into play was solid and active.  Such play tends to force the weaker side to sluff off material to avoid mate, and consequently, if the game does make it to endgame play, moves towards an endgame that favors the attacker.",
        "12. gxh3 Qh4+ 13. Kd1": "I was a little surprised at this move, but the more I examine the consequences of Kf1, it becomes clear that this was the only move.  I misread the comment at first.  [edit: I am unsure what I meant because Kf2 is not possible.]",
        "13... Qxh3 14. Qd5": "Defends f3, but I still wonder if this is best.  There are so many ways to drive off the queen.",
        "14... Qxf3+": "However, driving off the queen allows her to remain on the board when simplification favors me.",
        "15. Qxf3 Nxf3 16. b4 Ne6 17. c3": "Too defensive.  He is not going to win this game with a defensive strategy.",
        "17... O-O-O": "Adding pressure to d2.",
        "18. d3": "Tempting.  18... Rxd3+ 19.Ke2 Rxc3, etc.",
        "18... Nf4": "This has more bark than bite.",
        "19. Bxf4": "I was not unhappy to see this despite the introduced flaw in pawn structure.",
        "19... exf4 20. Rf1 Rxd3+": "That pretty little bishop was making Ke2 a much more viable defence.",
        "21. Kc2 Ne5 22. Rxf4": "I think better was Nc4.",
        "22... Bh6 23. Re4 Rd2+ 24. Kb3": "I have a plan forming in my head.  If I can put a pawn on b5, a neat little checkmate should emerge, but first I decide to reinforce the knight.",
        "24... f6 25. Nb5": "How considerate!  I wanted a way to put a pawn on b5, and he provides with tempo!",
        "25... a6 26. Nd4 b5 27. Ne6": "Prevents Rd8.",
        "27... Nc4 28. Rb1": "Forced.  Play can actually proceed with 28.Rxc4 bxc4+ 29.Kxc4, but I still believe that play favors Black.",
        "28... Rxh2": "Perhaps a threat I had running in my head was more \"rusty pocketknive\" than excaliber as Gary Kasparov once put it, but that belief in your own attack often gives you an advantage.  Bc1, Ba3 does not allow a pretty mate, but it did lead directly to another solid move.",
        "29. a4 Nd2+": "The consequences of discovered checks abound.",
        "30. Ka2 Nxe4+ 31. Ka1": "Can I really say Rb2 was better?  It cannot be worse.",
        "31... Nxc3": "How to defend both squares?  I think this would be the moment to resign.",
        "32. Rb2": "Bluff, bluster, or whatever you want to call it.",
        "32... Rh1+": "A move late, at least, and my opponent resigns.  Unfounded queen moves dominated his path.  What does he get from Qh5?  If the opponent is caught sleeping, a cheap victory.  If the opponent is on his toes, a hard fought game where the initiative becomes black's."
    },
    "url": "https://gameknot.com/annotation.pl/never-volunteer-for-an-execution?gm=24673",
    "gameName": "Never volunteer for an execution!",
    "players": "Chad E. MacQueen (1248) vs. Jay D. Kuykendall (1339)",
    "opening": "KP (C20), Patzer opening"
}