{
    "moves": {
        "1. d4": "Light game, light annotation.",
        "1... d5 2. Nf3 e6 3. Bf4 c5 4. c3 cxd4 5. Nxd4": "Pretty standard so far.",
        "5... Bd7": "I like it more than Nc6. ",
        "6. e3": "I could have tried Nd2 - e4, but it was no threat for black due to Nf6. If I have to go Bg5, I would have wasted a bishop move in the opening. The plan must be another. ",
        "6... a6 7. Nd2": "Waiting for him to get out the dsb to play Qg4, looking at g7. But he didn't. ",
        "7... Nc6 8. Nd2b3": "Qb3 was also possible, but it seemed too \"normal\" to me.",
        "8... h6": "Insisting in delaying the developement. We are seeing who lose his temper the sooner. ",
        "9. Bd3 g5 10. Bg3 f5": "Oh...",
        "11. Qh5+": "Of course!",
        "11... Ke7 12. Nxc6+": "This is to make possible to my bishop to go to e5 undisturbed. I couldn't see nothing better.",
        "12... bxc6 13. Be5 Be8 14. Qe2": "Now black loses a pawn.",
        "14... Nf6 15. Bxa6 Qb6": "The logic one is Bd3 and hold with black's expansion c5 etc. I wanted to be smarter, and... blundered!",
        "16. Nc5": "Just a present for him. No compensation. ",
        "16... Qxc5 17. Bd4 Qa5 18. Bd3": "Ok, now I'm under a minor piece, my position is cramped, he has a strong pawn center, and the bishop pair. ",
        "18... c5 19. Be5": "Expecting c4, Bc2, and a rainstorm. Ok, I have a free a pawn, but it looks almost impossible to take advantage of it. ",
        "19... Rg8 20. O-O Ng4 21. Bg3 h5 22. h3 Nf6 23. f4": "Desperately trying to open a little the position in order to make some pressure on the black king.",
        "23... h4": "A pawn in g3 is less dangerous that a g semiopen column. And if I win a pawn and some space into the bargain... well... better than Bh2, g4...",
        "24. fxg5 hxg3 25. gxf6+ Kxf6": "Still no way to break in, so...",
        "26. c4": "Anything to open the position. If I could just take awas the e3 pawn, I would do it. ",
        "26... dxc4": "Giving some life to my bishop!",
        "27. Bxc4 Bh6 28. Qd3": "Rd8, Qb3. ",
        "28... Bg6": "e4 can be interesting: a double pin... f4 e5+, Kxe5, Ra-e1 is in the air. ",
        "29. Qb3": "Pressure, at last!",
        "29... Bf7": "Better was Ra-e8. He don't take the d column, but the more the pieces he has \"playing\", the best. Anyway, now comes...",
        "30. e4 f4": "And now a pretty nice move: ",
        "31. e5+": "Attraction will give me some attack, but not the victory. Anyway, he played conservatively: ",
        "31... Kg7": "Pretending to be wise. I can take Bxe6, but all this fuzz just for a pawn? True, my queen will be very well placed, then, but I won't win with it and the e pawn... ",
        "32. Rad1": "This is not good, but if he plays a rook on d8, I can always take the e6 pawn. ",
        "32... Rge8": "So he thought it was better to defend it. Ok, but my target was another...",
        "33. Rd7": "Pressure is better than cashing. Now a pin is added to black's position.",
        "33... Rab8": "Better was Ra7, but this does look good, except for another good move from mine...",
        "34. Qf3": "Qxg3, fxQ, RxB+ is not mate. But now I threat Qg4+.",
        "34... Rxb2": "A blunder: I wonder what I would have done after Qa4 (threatening R and B). The answer is: Bxe6 (defending the rook), RxB, Qg4+, winning back the rook and defending mine. Still, black should have defended now. ",
        "35. Qh5": "This is better than Qg4+, because forces him to play Rf8, blocking an important escape square for the king. ",
        "35... Rf8 36. Qg4+": "Bxe6 was ok and probably winning. But now...",
        "36... Kh8": "The only one. Kh7 only helps me with Bd3+.",
        "37. Bxe6": "Time to cash in.",
        "37... Bxe6 38. Qxe6": "...threatening the B with mate. The move for black was Rb6. I Rd6, RxR, QxR, and then he can defend the bishop on g7 without so much danger. ",
        "38... Bg7": "Blunder, but who would say it at the first glance?",
        "39. Qe7": "It's to defend it or mate. ",
        "39... Rg8 40. Qh4+": "...and mate the next one. So, once again: NEVER GIVE UP! Things like this won't happen often, but it is fun to try! :-)"
    },
    "url": "https://gameknot.com/annotation.pl/never-give-up-2?gm=40035",
    "gameName": "Never give up 2",
    "players": "damalfi  vs. jarrod_lee ",
    "opening": "Queen's pawn game (D02)"
}