{
    "moves": {
        "1. b4": "This was a very lucky win for me, as my opponent missed a complicated winning combination at the end. This game didn't have very auspicious start for me. I was late. I couldn't find the venue, even though I had played there before. It was about 8 pm when I arrived. I hoped to be able to rattle through a few moves of theory without really thinking, but my opponent had played 1. b4, the Polish (Sokolsky) opening (A00) - also known as the Orangutan Opening - a complete surprise, and I had to start thinking for myself right from the start. Not what I wanted!",
        "1... e5": "I remember in the Sixth form of King's School, Chester, Martin Lee telling me that 1....c6 refutes 1. b4 and showing me the line 1. b4 c6 2. Bb2 Qb6 3. a3 a5 but I am not convinced that it is best for black to neglect development like that. I follow another path - what I found out later to be the most common reply.\nMartin sadly died at a young age. http://www.hackneychess.org.uk/node/538",
        "2. Bb2": "He attacks my pawn.",
        "2... f6": "I defend it.",
        "3. e4": "He decides to sacrifice his d pawn, for the sake of quick development.",
        "3... Bxb4": "So I take.",
        "4. Bc4": "He develops, threatening to regain the pawn by taking the knight with his bishop on g8 and then playing Qh5+ after my rook recapture.",
        "4... Ne7": "So this seemed the best way to stopping that.",
        "5. Qh5+": "He plays the check anyway.",
        "5... Ng6": "I block with my knight.",
        "6. Nf3": "Normal development - but at this stage I was frightened of him playing Nf3-h4 next move.",
        "6... Ke7": "This looks most odd, but I wanted to break the pin for the reasons given above. Almost as soon as I had played it I saw that Nc6 was better, preparing Nc-e7 to back up my Ng6. Interestingly Fritz also likes a king move, but likes Kf8 instead. No human player playing black has moved the king at this stage - it looks madness to give up castling rights like this - but perhaps it is not so bad. You will see shortly why I decided to move my king to e7 rather than f8.",
        "7. O-O": "He obviously hadn't expected the king move, and at least it had the benefit of slowing him down. Up to now he had been moving virtually instantly. After his think, he just calmly castled, planning to open up the centre and get at my king.",
        "7... d6": "But I have plans too, one of which is Be6 to blunt his Bc4, which is why I played my king to e7 not f8.",
        "8. d4": "So this is part of his plan to open up the centre.",
        "8... Be6": "I carry on with my plan. Fritz prefers Qe8.",
        "9. Nbd2": "He develops, protecting his Bc4. Stop - find black's next move.",
        "9... Nf4": "Did you see it? part of a combination of moves to pick up a second pawn.",
        "10. Qh4": "So the queen drops back, pinning my f pawn.",
        "10... Bxd2": "This is part of my plan, although Fritz likes 10....g7-g5 instead, and if 11. Qh6 then 11....Qf8. Although it looks crazy to throw forward king-side pawns like that, but this variation does seem to force the queens off, leaving me a pawn up, so it probably was better than what I played.",
        "11. Nxd2": "He has to recapture, although it draws a protector of d4 away from duty.",
        "11... Bxc4": "and this move removes the protector of the e2 square.",
        "12. Nxc4": "He recaptures.",
        "12... Ne2+": "I check.",
        "13. Kh1": "Forced!",
        "13... Nxd4": "And I get my second pawn - but my king is still stuck in the centre.",
        "14. f4": "The correct move, trying to open up the position more.",
        "14... Nd7": "I needed to protect e5 again - as my f6 pawn is pinned, in effect it is only protected by the d pawn, and he is attacking it twice - with pawn and knight. Fritz prefers Ke8 instead, unpinning the pawn, but I much prefer this knight move, as it aids my development.",
        "15. Rad1": "This threatens 16. Bxd4 followed by Rxd4.",
        "15... Qg8": "This move not only attacks the knight, but also there is an x-ray attack on the pawn behind it.",
        "16. fxe5": "He takes, opening up the position.",
        "16... dxe5": "I take back. This seems the natural move, but Fritz prefers Qxc4.",
        "17. Ne3": "His knight drops back.",
        "17... Qxa2": "I boldly take the pawn, although Fritz prefers c7-c5 or Ke8",
        "18. Bxd4": "He takes.",
        "18... exd4": "I take back.",
        "19. Rxd4": "And so does he, leading to an interesting position, in which I still have two extra pawns, but my king is still wandering around the centre and development of my rooks - especially my Rh8 - is difficult, while all his pieces are active. On the plus side I have managed to exchange most of the minor pieces.",
        "19... Rad8": "I get my a rook into the game. Fritz prefers a queen retreat.",
        "20. Nd5+": "He comes in with his knight - one of the extra pawns is going to go.",
        "20... Kf7": "So my king moves over. He misses a very strong move here - 21. e5!! and if 21...Nxe5 22. Nxf6! wins for white.",
        "21. Qh5+": "Thankfully he misses that, but this is still strong.",
        "21... g6": "The obvious block.",
        "22. Qf3": "But now he has three attackers on f6 and I have only two defenders.",
        "22... Qa6": "Fritz prefers 22..... c7-c5 counter-attacking his rook first, and then 23... Qa6 after his rook moves.",
        "23. Nxc7": "So one pawn goes.",
        "23... Qb6": "Counter-attacking rook and knight.",
        "24. Qc3": "And he protects them both.",
        "24... Kg7": "My king moves to a safer square.",
        "25. Rb4": "He attacks my queen.",
        "25... Qd6": "I move, returning the second pawn, but taking control of the d file and eyeing the b8-h2 diagonals.",
        "26. Rxb7": "He takes.",
        "26... Rhf8": "I finally mobilise this rook.",
        "27. Qb3": "With a threat of Ne6.",
        "27... Kh8": "Has my king finally found a safe square?",
        "28. Rxa7": "Another pawn goes.",
        "28... Ne5": "But my pieces are coming to life.",
        "29. Ne6": "He forks my rooks.",
        "29... Ng4": "I attack h2. OK stop and find white's best move.",
        "30. Rfa1": "Instead of this, he could have won with 30. Rxh7+. After the game we were looking at this, and he was following it up with, after Kxh7, 31. Qh3+ but then black has Nh6 defending. The correct follow up, which was pointed out to me later was 31. Qb7+. Now 31... Kh8 or g8 leads to 32. Qg7 mate, and if 31...Kh6 then 32. Qg7+ Kh5 33. Qh7+ Nh6 34. g2-g4+ and white is mating (Kxg4 35 Qxg6+ or Kh4 35. Qxh6+).\nThat means after 31. Qb7+ black has to block on d7, after which white simply exchanges on d7 and then plays Nxf8, forking King on h7 and whichever piece black has on d7, and ends a rook and pawn up. Luckily, my opponent missed that and allowed me to play....",
        "30... Qxh2#": "This simple mate in one. So I managed to win a game I should have lost. Many thanks for reading. Please leave a comment or two and rate the annotation on the star system, to let me know how I am getting on. Until next time dear reader!"
    },
    "url": "https://gameknot.com/annotation.pl/newport-a-v-oswestry-a?gm=62850",
    "gameName": "Newport A v Oswestry A",
    "players": "Ian Jamieson (ECF162) vs. Charles L Higgie (ECF166)",
    "opening": "Polish (Sokolsky) opening (A00)"
}