{
    "moves": {
        "1. e4": "This game I hope to significantly batter Rob,  who I have managed but one draw in 6 games against.   I start with the standard opening",
        "1... g5": "a response I haven't seen before ",
        "2. d4": "I press for center board control",
        "2... Bg7": "he apparently wants to give me the pawn ~ ",
        "3. Nc3": "since he is by far the better player  i sense a trap and decline and continue to develop",
        "3... h6": "guess he changed his mind...",
        "4. f4": "i press to get him furhter off balance, figuring I am going to O-O-O at somepoint anyway.",
        "4... c5": "he apparently smells that and wants to Break that up.  I really don't like this..At this point we are trading silly banter.\r\n(rt4sm) I have a confession to make... i often hype up my opponent's play, i think it can get them overconfident whilst ensuring they like me, so i still make friends. I'm supposed to be the star of SC, but i still stoop low enough to enter the psychological battleground. \r\nComment: (yodean) Your confession only validates you to be the scum you are. wait till i tell the others. Your tactic may work on YoDean, the simp, but not the great nfgatchess !  \r\n\r\nI finally respond with Ne2  not sure why...  i just don't like my other options~ they seem to put other pieces out in places I don't want them yet.\r\n",
        "5. Nge2": "...",
        "5... cxd4": "so he (surprisingly) plays as predicted...",
        "6. Nxd4": "and so do I.",
        "6... Qa5": "Now I am thinking since his castle is messed up on both sides if i can just swap material for a while i can work into a winning position since he won't be able to castle effectively  (I think) - Qd3  \r\n",
        "7. Qd3": "I don't see a respnse he has that can really gain him anything",
        "7... Nc6 8. Nxc6": "I really want to see which way he takes it.",
        "8... dxc6": "so he takes AWAY from the center of the board,  but it does open up his white bishop",
        "9. Be2": "I move,  I figure I might end up with stacked pawns  but now it looks like I am going to O-O (instead of O-O-O) and develop the rook at the same time on the f-file",
        "9... Bxc3+": "he ends up starting what i think will stack my pawns on c-file",
        "10. Qxc3": "...",
        "10... Qxc3+": "...",
        "11. bxc3": "He does..  ",
        "11... gxf4 12. Bxf4": "now we play the pesky g-f pawn trade",
        "12... Nf6": "he develops his knight finally",
        "13. Bd3": "i decide to play slow, a bit of defense instead of pinning the knight.  I am scared of 'obvious' moves against Rob",
        "13... Bg4": "He develops his bishop.  ",
        "14. O-O": "I really thought about h3 here but i didn't see what it bought me really, so i continue with my slow defensive play.  I figure he will castle O-O-O sooner or later.",
        "14... Nd7": "hmm  Nd7,  My guess is his next move is either O-O-O or e5,  I really don't like either,  I am going to sit and think on this a while",
        "15. Rab1": "I really don't want him to castle  but I can't figure out a nice way to prevent it.  so i go ahead and force the issue with plans on loading up on that side.  Maybe i should have thought about it more, but it is another boring day at work",
        "15... e5": "he dicedes to be an agressor",
        "16. Be3": "I just want the middle of the board",
        "16... b5": "he has pawns on that side and seems like he wants to keep pushing",
        "17. c4": "I offer him the swap",
        "17... a6": "he delays...",
        "18. cxb5": "at this point, even if i end up down a pawn  on a file I am thinking he will have  a wide open a- d files and i can stack my rooks and come after him in about 6 or 8 moves  I think i will follow with c4 after either pawn takes",
        "18... axb5": "predicted",
        "19. c4": "This line is continuing what I was thinking at move 17 (a6)",
        "19... Ra3": "...",
        "20. Rb3": "...",
        "20... Rxa2": "...",
        "21. cxb5": "so we continue down this road...I am looking at being even with him after 21 moves.  At this point I see 3 advantages for me, 1) king is in better position, 2) I have two bishops to his bishop and knight and 3)  my pawns are maybe slightly better in postion.  I don't know if that is going to be enough going into and end game against Rob though  (end game?  and we are only at move 21???) ",
        "21... cxb5": "following the logical path",
        "22. Bxb5": "I take and pin his knight\r\n",
        "22... Be6": "he attacks my rook and links the pawn/bishop pair",
        "23. Rd3": "i go ahead and keep pressure on his knight  ~ even if he goes B c5 attacking both rooks  I end up with the knight and bishop for a rook\r\nAt this point though, my hope of \"significantly Battering\" Rob appears to be quickly faiding,  now I am hoping to get a marginal win or at least a draw.",
        "23... Rg8": "He moves his rook threatening r8xg2 wihcih would be an immediate death ",
        "24. g3": "I had this as a conditional move ",
        "24... Ra5": "he (not so surprisingly) attacks my bishop  I don't have a conditional move for this.  I have to think a while about whether I take the knight or protect with my f-rook",
        "25. Rb1": "Best I can figure is if I play this, i end up after about 5 moves with a rook and a bishop against a knight and a bishop.  something like ( ... rxB, 26.RxR, Bc4. 27. Rc3, Bxb5 28. Rc8 , Ke7 29. RxR, ....)    I think....  then after that   i don't know what...  Usually I would have just taken the knight,  since it gets more material off the board and I can think with fewer variables.",
        "25... Rxb5": "as planned with conditional moves in there",
        "26. Rxb5": "conditional move set",
        "26... Bc4": "assumed",
        "27. Rc3": "conditional move",
        "27... Rxg3+": "this is different...  but the outcome is nearly the same  I guess",
        "28. hxg3": "so here we  are,  I put in conditional move after 28....  Bxb5.  29. Bxh6.  I don't know what he may do after that.  I am up a rook to a knight but his pawns are paired in the middle of the board.  so my advantage is minimal (if any)  I get 7.6 points for a draw against him but I sure would like ten more points and the pride of getting a win !!!! ",
        "28... Bxb5": "So he evens this up.",
        "29. Bxh6": "I get a pawn,  ",
        "29... Ke7": "he pushes king towards the middle",
        "30. Kg2": "i do similarly.  at this point I am running out of pieces (and Ideas) with which I can squash him. my odds of getting a win are looking bleak.  but Hey,  I did make a close game after 30 moves (so far).",
        "30... Ke6": "he pushes his king to the middle some more  I understand that,  ",
        "31. g4": "i go ahead and keep pushing a pawn   (and hoping I figure out something or he makes a mistake ~ either case seems doubtful)",
        "31... f6": "an obvious move..",
        "32. Kg3": "I go ahead and support the pawn, hoping at some point i have a little more flexibiity in where I can move what.  By keeping my king on a black square,  he can't put me in check with his bishop at least.  maybe i can sneak around and get a pawn to the 8th rank,  this is going to be a long drawn out process",
        "32... Kf7": "he just moves his king,  Kind of like he wants to attack my bishop .  ",
        "33. Be3": "I don't see any real advantageous move so i just move the guy out of the way to save for a rainy day",
        "33... Ke6": "he looks like he is just wanting the middle of the board.  this game is looking more and more draw-ish  ",
        "34. Rc8": "I don't see any really good moves, so I stall ,  this is just my 'less bad' move  and I am getting kind of ancy about this game altogether.",
        "34... Bd3": "At this pint I am seeing very little chance of getting anything on him  , frustration, (and boredom at work) is beginning to set in",
        "35. Rc6+": "strictly a delay tactic,  maybe he will do something wrong.",
        "35... Kf7": "i kiind of thought he might try to bait me by going to e7 (then Bc5 , Nxb5,Rxb5....  ) that would have given him my bishop for the knight...but ok.",
        "36. Kf3": "I thought briefly about Rd6 but then if he gets the pawn at e4 sacrficing the knight,  i have little opportunity to keep him from getting a pawn promoted. or if i do,  I have to give up a piece and it is still a draw game (dammit)",
        "36... Bb5": "gee  he wants me to move my rook.  I have no idea where to put it so i decided just to pin the knight ",
        "37. Rc7": "so I pin the knight,  I don't really have a plan, and that concerns me",
        "37... Kg6": "I sure wish i could get somewhere with this and wonder about Rb7 and Rc8",
        "38. Rc8": "I decide on this because I am hoping i can somehow pry that stupid knight off of the support for the pawn at f6 ~  it seems to be impeding my progress (progress???!!!!)",
        "38... Kg7": "so it appears he is more than willing to take the draw.  but I want a win !  I am scratching my head going  \"I am up against his knight and paired pawns against my rook and split pawns  There has to some what I can do something !!!!.  I see me pinning the knight again leading to a repetative move deal.  I look for something else,  the problem seems to be he has additional strenght in that his bishop has more relative strength against my split pawns than mine has against his paired.  i push ",
        "39. g5": "I am swapping pawns to break up the pair hoping it will give me SOMETHING !",
        "39... fxg5": "he sees that he HAS to swap, but states in comments: \"Just one more teensy wincy pawn and the draw is mine, i can't believe i'm actually having to play for a draw...\"  almost like I am supposed to get some sort of satisfaction out of getting  draw from him.  DAMMIT I WANT A WIN!",
        "40. Bxg5": "OK so now I have broken his pawns up (at a cost ~  I think a worthy cost) and start work on getting his pawn out of my way (or at least working a rook to knight end game that maybe I can win)",
        "40... Kf7": "I don't see much..  still,  If i go Kg4 then he can put me in check, with the knight.  fat lotta good Kg4 does me .....",
        "41. Rc7": "I go back to pinning the knight I want to get my king around or my bishop behind that stupid pawn.   Really it is a stall so I can think...  he doesn't have to know that though",
        "41... Ke6": "he gets out of that and supports his pawn",
        "42. Bd2": "at this point,  the back door may be an idle threat,  so I figure give him a threat that I will com from a long range attack ...  ( actually I am just frustrated that I can't do anything about this and still have no real plan  hopefully he will mess up and let me get two pieces (my rook to e8 bishop c3 and  my kingf 5...  doubtful...but its all I have\r\nI add a ridiculous comment for him  \"I see mate at move 73 how about you?\"",
        "42... Bd3": "so he attacks my pawn and i guess a little check wouldn't hurt",
        "43. Rc6+": "  No pain......",
        "43... Kf7": "for him....",
        "44. Ke3": "i need to do something   i just make him move his bishop,  hopefully somewhere wrong...",
        "44... Bf1": "Obviously that wasn't a wrong move    ~  I am really stumped here.  I actually consider (once more) offering a draw..  I just can't.  I decide to stall a day or so\r\n~ A day goes by ~ I decide to offer a draw on the condition that I can cuss him and play him again sometime.  \r\nI post messages about his alleged habits with blow up dolls that have needle marks all over them that he picked up on the side of the road in Blackpool.",
        "45. Bb4": "I send some silly message to the team about this game (for the sake of SC humor) move to b4 because i can't see any damage that he can do to me and send draw offer.  I do this because I figure the chances of me screwing up are a lot greater than him screwing up.  After 44 moves and I am up 2 points (a rook to a knight which I actually fought for !) I would be pissed as hell to lose,  in fact  I am pissed I couldnt' figure out a way to win.\r\nI again remind wife of my need for a chess book for Christmas"
    },
    "url": "https://gameknot.com/annotation.pl/nfgatchess-squashing?gm=12049",
    "gameName": "nfgatchess squashing",
    "players": "yodean (1649) vs. rt4sm (2044)",
    "opening": "Reversed Grob (Borg/Basman defence/macho Grob) (B00)"
}