{
    "moves": {
        "1. e4": "I started this game because I was bored and wanted to play someone a couple days after joining the \"Southern Chess\". Why not play a teammate? I looked for someone near my rank, and voila! here we are. I'm actually annotating this on my 22nd move.\r\n\r\nAh, my standard opening.",
        "1... c5": "I'm seeing this more and more nowadays...",
        "2. d4": "This is the something Moria Gambit... I have no clue about official names, but I'm told he's to take the pawn... <_<",
        "2... e6": "Gambit... declined? \r\nFINE! Gambit sucked as an X-men anyway. :P",
        "3. Ne2": "Might as well...",
        "3... Nf6 4. f3 Bd6 5. e5": "Drop it like it's hot (hot)\r\ndrop it like it's hot (hot)\r\nAnd when a b--ch gets an- oh, sorry, I really don't have much to say about this schtuff.\r\nI figured a favorable pin was in store since I was feeling a threat in the middle, so i figured that snatching a pawn or knight for a pawn was very good. Especially the bishop, since it wasn't protected.",
        "5... Nd5 6. exd6 Qa5+": "Harsh, dude, harsh. Moving that queen all up in my turf, denying me that d6 pawn coverage from his buddy back two squares...",
        "7. c3 c4 8. Bd2 Qb6 9. b3": "And I have to make the nessesary sacrifice...",
        "9... Qxd6 10. bxc4": "An eye for an eye.",
        "10... Nf6 11. Nf4": "I forget my original reasoning for this move... I think it was to keep the queen off d5 because of my next move...",
        "11... e5": "he's probably plotting to force my knight away and get himself a pair of pawns for one of his own. well, either that, or he wants me to blow a move moving my knight back to defend that pesky pawn there on d4",
        "12. c5": "He can have the Knight. I wants me somma dat!",
        "12... Qc7": "I honestly considered for a few minutes chasing the queen with my knight.",
        "13. Nd3": "but, alas, it was not to be!",
        "13... Nd5 14. g3": "flanchetto prep, dawg.",
        "14... O-O 15. Bg2 Nc6": "Apparently, he doesn't see me lining up the knight in my sights with my bishop...",
        "16. f4 f6": "And he gave me a free check, to boot.",
        "17. Bxd5+ Kh8": "Does anyone else agree that having a king stuck in one square is a bad thing?",
        "18. fxe5 Re8": "smart move. It locks off my pawn from causing further discord amoungst the Black Forces.",
        "19. Bf4": "time to pump up the defense. You can do eet, little guy! Scare black into submission!",
        "19... b6": "now if only he'd move his other knight <3",
        "20. O-O": "to free up the pawn, y'see. I'm not a big fan of castle-ing (I cant spell >.<)",
        "20... Bb7": "I didn't forsee his next move...",
        "21. Re1 Nxe5": "giving up his knight for a pot-shot at my bishops and knight... GENIUS! :P",
        "22. dxe5": "I accept his attack on my bishop humbly. I was out manuvered this day... BUT I SHALL WIN THIS WAR!!",
        "22... Bxd5 23. exf6": "What happen?\r\nSomebody set us up the bomb!",
        "23... Qd8 24. Ne5": "There's the set-up for Nf7",
        "24... Qxf6": "I shall avenge you, loyal pawn!!",
        "25. Qxd5": "!",
        "25... Rad8": "Pawn fortification...",
        "26. Nf7+": "All your Base are belong to us!\r\nThe following is the Checkmating sequence. It would've been a bit closer if he took the knight on f7 instead of moving.  I would've gotten a Queen, but he would've gotten a Knight and Rook, so it would've been pretty awesome, no?",
        "26... Kg8 27. Nxd8+": "This Game is pretty much over. See? I was right that the whole not giving the King an escape hatch was a bad idea... not enough mobility for the king. It allows me to force out a series of moves leading to checkmate. looking back, Nf7 was his only chance to throw off the mating sequence, but would've thrown away his queen.",
        "27... Kf8 28. Bd6+": "Next moves were:\r\n28. ...        Qxd6\r\n29. Qxd6  Kg8\r\n30. Rxe8#\r\n\r\nThanks for the Game, CW! It was fun! (Oh, And the Boss is/was telling me that my annotations were a little harsh to you and that I have an asswhooping coming my way via him. Message me if there's anything you want me to add/remove, m'kay?)"
    },
    "url": "https://gameknot.com/annotation.pl/nice-friendly-game-unrated?gm=559",
    "gameName": "Nice, friendly game? (Unrated)",
    "players": "judgeman (1151) vs. cwfreak (1187)",
    "opening": "Sicilian (B21), Smith-Morra gambit"
}