{
    "moves": {
        "1. e4": "After listenting to the comments, I realized this is not a good annotation in many aspects... forgive me and, if you want to go throug it, don't forget to read comments.",
        "1... d5": "Who knows me knows I always play \"my Scandivian\". This was a nice example of the queen's exchange variation, one of the worst for black (IME :-).",
        "2. exd5 Qxd5 3. Nc3 Qe5+ 4. Qe2": "This is the queen's exchange variation. Of course black can try to avoid the exchange, and take advantage of the miplaced white's queen. But, in return, his own queen is misplaced and easily chased all around the board. Nc6, defending it, allows a tempo for Nd5, that black must avoid at any cost. And about Qa5, I can recommend it only in another line (where white plays d4 earlier). ",
        "4... Qxe2+ 5. Bxe2": "Three pieces against no pieces is a huge advantage, but look at the pawns... and I bet black have a smooth developement here. The main point would be the control of the black diagonal h2-b8. ",
        "5... c6": "This is not as odd as it seems, since it is the best way for black to prevent knight's jumps. Of course it causes weakness on the black squares black would have to cope with. ",
        "6. Nf3": "According to the last vision, black would better open the way for his dsb, occupying the center, with d4. Probably white just wants to take it easy. ",
        "6... Bf5": "Developing with tempo, at last. ",
        "7. d3": "White can try Nd4, here, to which I would just go Bg6. The white's knight will be rejected with tempo in most lines after this. ",
        "7... Nd7": "Here, I normally have to choose between e6 or e5. I've not played enough games to say which is better, provided that e6 sets a strong defence, though giving the dark squares (and betting white cannot do too much harm on them), or the tempting e5, that blocks white's dsb but sets a target for white, that in that case has developement advantage (by castling and Re1). So I decided to try something new, giving priority to my king's \"safety\" (I normally castle queenside in my Scandivian. White's attacks over the queenside are well known to me, and I still believe I can survive by attacking white's kingside (the kind of game I like :-). What about the lsb? Even if it seems bad, I assume it would be exchanged by the knight now in f3, and there is no problem at all, provided it makes me semi-open the h file...",
        "8. O-O": "Delaying Bf4. ",
        "8... O-O-O": "Tempting him to Bf4... I'll see later what to do with the center. ",
        "9. Bf4": "Finally... :-)",
        "9... f6": "Ok, now that I'm castled, I can try to fight for the black squares. So no developement, again. ",
        "10. b3": "IMO, a mistake. White should fight for the center, with d4, here, an excellent outpost that controls my knight on d7 and prevents e5, since after the exchange, my pawn will be exposed and my king... even more. \nDuring the game, I thought that white feared Bxc2, but in fact this would have favoured him, by opening lines against my weak castled king. \nThe played move gets me the chance to reverse my selflocked position with the thriumphant...",
        "10... e5": "Note that this move also deprives my Nd7 of another useful square but... c'est la vie!",
        "11. Be3": "Setting the classic a7 threat. I still have to study in which conditions can white take the pawn without losing the bishop or, by sacrifying it, win the game due to the queenside pawn's storm that follows. ",
        "11... Ba3": "The normal one would have been Bb4, but I tried to improve it, and I think I succeeded. ",
        "12. Nh4": "My threat was Bb2, of course, but white found a counterthreat. Now, my lsb is important to my position, but I saw the right moment to catch up in developement.",
        "12... Ne7": "Afterwards, I realized that with NxB, NxN, Bg4, I have to go on with g6... an annoyin x-ray pin, but hey! I still have the Bb2 threat to be dealt with...",
        "13. Na4": "I'm not sure if my opponent missed b5, or he was tempting me to it in order to weaken c6... but it was unlikely. White's move here was Rb1, and then try to exchange my annoying bishop. As always, it's easy to see afterwards. ",
        "13... b5": "\"I fell into the sin, forgive me, Lord, but I'll win an exchange for our army, because of it.\"",
        "14. Nc3 Bb2": "A pity. Such a beautiful warrior... ",
        "15. Nxb5": "Here it goes white's compensation!",
        "15... cxb5": "I have to accept.",
        "16. Rab1 Bc3": "...and my bishop sets himself as a pawn's blocker. ",
        "17. Bxa7": "Well, a pawn is a pawn, but this can even favour me, with my grip on a2!",
        "17... Kb7": "Leave room for my Rooks, Fou Lenoir! :-)",
        "18. Be3 Nb6": "Now, my plan was to exchange white's dsb, of course. But I overlooked next white's sequence...",
        "19. Bf3+": "Very intelligently, my opponent managed to make me forget about my Ne7 as \"unavailable\"...",
        "19... Kc7": "I don't like this square for the king, but I thought that more importan was the undefendable a column than the nice c one... But I overlooked next's white...",
        "20. Bc5": "!! I was in total contol of this square some moves ago, and now it is my opponent's revenge: I LOSE A PIECE here. Nd7 is under attack. He cannot retire attacking, so I will lose the B on f5. It is not whort to sac it... Bxd3, BxNd7!. I miss a tempo to defend both the knight and the bishop. I choosed to lose a piece with...",
        "20... Nbd5": "I would have worked but for BxNd4, and any capture by black loses a piece. I am recovering it, in fact, but... 2 pawns' behind! So white's Na4 had reasons behind it, after all... Of course, I should have moved Ba3 insatead, and goodbye problem. A small lesson.",
        "21. Bxe7": "But white didn't! In the chat, he told me something like \"no, you don't lose a piece\", and I don't know if it refers to the fact that he was just recovering it or that he didn't see Bxd4. But that's blitz! There were few seconds left, and hutrry is a bad adviser.",
        "21... Nxe7 22. Nxf5 Nxf5 23. g4": "Now, my knight can dance with the bisop...",
        "23... Nd4 24. Be4": "Tempting me again to go naively Nxc2, after which I lose a piece (this time I saw it!) by Rc1 - with my poor king behind...",
        "24... Ne2+": "But I know more steps...",
        "25. Kg2 Bb4": "\"Be welcomed, fierce beast, to your best possible square... forking enemy's last soldiers...\"",
        "26. Kf3": "White should have tried to avoid the fork with Bf3, IMO. ",
        "26... Nc3 27. Rba1 Nxe4 28. dxe4": "Even if I am only +1 in theoretic material, my bishop is too well placed. IMO, white should have kept the lines closed as long as possible, with Kxe4 (Rd4, Kf3, and my rook is to at its ease, there (Rc1, threatening c6...)",
        "28... Bc3": "Quickly, before a4 by white!",
        "29. Rac1 Rda8": "Cashing another pawn, and ending white's possible resistance, I fear. If Ke3 (with the idea d3), white falls to Rd8. Rf-d1 (either) is probably the best try, thinking on d5 (black cannot block it with Bd4 due to c3). ",
        "30. Rcd1": "The normal sequence after Rf-d8: Bb2, Rb1, Rxa2, Rd5 or Rd2...",
        "30... Rxa2 31. Rd3": "Better, IMO, Rd5, but there's not a great difference.",
        "31... Rxc2": "Rf-d1 doesn't offer white anything after Bd4 - now solid as a rock. My opponent resigns. But this was a very interesting game. Even after the blunder, there was something to be said. Thank you ab15 for playing me, and hope to see you again."
    },
    "url": "https://gameknot.com/annotation.pl/nice-to-meet-you?gm=44784",
    "gameName": "Nice to meet you!",
    "players": "ab15  vs. damalfi ",
    "opening": "Scandinavian defence, Lasker variation (B01)"
}